[{"category": "", "categoryclass": "", "imagename": "efc9c52f6509661dabbde21ceef40691.jpg", "infoid": 1000799, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "莱斯大学的研究人员已经发明了一种高效、低成本的装置，它可以将水裂解来生产氢燃料。这个平台是由水稻材料科学家Jun Lou的布朗工程学院实验室开发的，它集成了催化电极，当阳光触发时，它会产生电力。电流流向将水转化为氢和氧的催化剂，阳光转化氢的效率高达6.7%。\n这种催化并不是什么新鲜事，但实验室将一层膜和电极封装成一个模块，当它落入水中并置于阳光下时，无需进一步输入即可产生氢气。\n由楼、主要作者、赖斯博士后研究员贾亮和他们的同事在美国化学学会杂志ACS Nano上介绍的这种材料是一个自给自足的生产商，他们说，应该很容易批量生产。\n楼说，这个概念与人造叶子大致相似。我们拥有的是一个集成模块，它将太阳光转化为电能，驱动电化学反应。它利用水和阳光来获取化学燃料。\n钙钛矿是一种具有立方状晶格的晶体，众所周知，它可以收集光线。到目前为止生产的效率最高的钙钛矿可以达到25%以上的效率，但这种材料很昂贵，而且容易受到光、湿度和热的压力。\n楼说，贾跃亭已经用碳等替代品取代了钙钛矿太阳能电池中更昂贵的成分，如铂。这降低了商业收养的准入门槛。像这样的集成设备很有前途，因为它们创造了一个可持续发展的系统。这不需要任何外部电源来保持模块运行。&#34；\n梁说，关键成分可能不是钙钛矿，而是包裹它的聚合物，保护模块并允许长时间浸泡。他说，其他人已经开发出催化系统，用导线将水外的太阳能电池连接到浸没的电极上。我们将钙钛矿层用一层聚合物薄膜包裹起来，从而简化了系统。\n梁说，图案化的薄膜允许阳光到达太阳能电池，同时保护它，并作为电池和电极之间的绝缘体。\n卢说，有了一个巧妙的系统设计，你可以潜在地制造一个自我维持的循环。即使在没有阳光的情况下，你也可以用化学燃料的形式储存能量。你可以把氢气和氧气产品放在不同的油箱里，并加入另一个模块，比如燃料电池，将这些燃料重新转化为电能。\n研究人员表示，他们将继续改进封装技术以及太阳能本身，以提高模块的效率。更多信息：贾亮等，一种面向太阳能驱动的低成本和高效率的集成装置，ACS Nano(2020)。网址：10.1021/acsnano.9b09053", "note_en": "Rice University researchers have created an efficient, low-cost device that splits water to produce hydrogen fuel.    The platform developed by the Brown School of Engineering lab of Rice materials scientist Jun Lou integrates catalytic electrodes and   that, when triggered by sunlight, produce electricity. The current flows to the catalysts that turn water into hydrogen and oxygen, with a sunlight-to-hydrogen efficiency as high as 6.7%.\n  This sort of catalysis isn&#39;t new, but the lab packaged a   layer and the electrodes into a single module that, when dropped into water and placed in sunlight, produces hydrogen with no further input.\n  The   introduced by Lou, lead author and Rice postdoctoral fellow Jia Liang and their colleagues in the American Chemical Society journal  ACS Nano is a self-sustaining producer of   that, they say, should be simple to produce in bulk.\n  &#34;The concept is broadly similar to an artificial leaf,&#34; Lou said. &#34;What we have is an integrated module that turns sunlight into electricity that drives an electrochemical reaction. It utilizes water and sunlight to get chemical fuels.&#34;\n  Perovskites are crystals with cubelike lattices that are known to harvest light. The most efficient perovskite   produced so far achieve an efficiency above 25%, but the materials are expensive and tend to be stressed by light, humidity and heat.\n  &#34;Jia has replaced the more expensive components, like platinum, in perovskite solar cells with alternatives like carbon,&#34; Lou said. &#34;That lowers the entry barrier for commercial adoption. Integrated devices like this are promising because they create a system that is sustainable. This does not require any external power to keep the module running.&#34;\n  Liang said the key component may not be the perovskite but the polymer that encapsulates it, protecting the module and allowing to be immersed for long periods. &#34;Others have developed catalytic systems that connect the solar cell outside the water to immersed electrodes with a wire,&#34; he said. &#34;We simplify the system by encapsulating the perovskite layer with a Surlyn (polymer) film.&#34;\n  The patterned film allows sunlight to reach the solar cell while protecting it and serves as an insulator between the cells and the electrodes, Liang said.\n  &#34;With a clever system design, you can potentially make a self-sustaining loop,&#34; Lou said. &#34;Even when there&#39;s no sunlight, you can use stored energy in the form of chemical fuel. You can put the hydrogen and oxygen products in separate tanks and incorporate another module like a fuel cell to turn those fuels back into electricity.&#34;\n  The researchers said they will continue to improve the encapsulation technique as well as the solar   themselves to raise the efficiency of the modules.        More information:\t\t\t\t\t\t\t\t\t\t\t\tJia Liang et al, A Low-Cost and High-Efficiency Integrated Device toward Solar-Driven Water Splitting,  ACS Nano (2020).  DOI: 10.1021/acsnano.9b09053", "posttime": "2020-05-06 02:30:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "叶子,leaf,阳光,sunlight", "title": "“人造叶子”概念启发了太阳能燃料生产的研究", "title_en": "'Artificial leaf' concept inspires research into solar-powered fuel production", "transed": 1, "url": "https://phys.org/news/2020-05-water-splitting-module-source-perpetual-energy.html", "via": "", "real_tags": ["叶子", "leaf", "阳光", "sunlight"]}, {"category": "", "categoryclass": "", "imagename": "6db21dab327bbcfaf519f0c3c9d3a71b.jpg", "infoid": 1000798, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的6周里，我们看到了空前数量的人想要搬出旧金山湾区，而几乎没有人想要搬到这个地区。\n风险投资放缓，以及初创企业和科技公司的大规模裁员，可能是推动净移民模式急剧转变的一些主要因素。\n在涉及旧金山湾区的大约1200次移动搜索中，近90%是关于出境搬迁的。洛杉矶和奥斯汀是最受欢迎的目的地之一。\n相比之下，在去年同期，我们的搬家成本计算器上有980次涉及旧金山湾区的搬家搜索。在这980个请求中，57%是向外迁移，43%是向旧金山湾区迁移。这对于任何一个大城市来说都是典型的，因为在任何给定的时间都有很多人进进出出。\n但我们目前看到的是，令人难以置信的是，涉及旧金山湾区的搬家搜索中，90%是目前希望离开的居民，只有10%的人希望搬进该地区。这与去年的情况截然不同。\n旧金山湾区有着复杂的迁徙历史，所以很难说到底是什么推动了这一变化。最近，我们还观察到纽约等其他大城市的搬迁请求发生了变化。\n但该地区最终可能会经历人口减少的原因有很多：\n虽然长期净移民趋势需要数年时间才能衡量，但这一早期数据确实表明，离开旧金山湾区的居民大幅加速。这是我们一定会密切关注的趋势。", "note_en": "Over the past 6 weeks, we’ve seen an unprecedented number of people looking to relocate out of the  Bay Area, and almost no one looking to move into the region.\n  The slow down in VC funding, as well as massive layoffs at startups and tech companies, could be some of the major factors driving this sharp shift in net migration patterns.\n  Out of roughly 1,200 moving searches involving the Bay Area,  almost 90% have been for outbound relocations. Los Angeles and Austin were among the most popular destinations.\n  To put this into perspective, during the same period last year, there were 980 move searches involving the Bay Area on our  moving cost calculator. Of those 980 requests, 57% were for outbound moves and 43% were for moves into the Bay Area. This is typical for any major city that has a lot of people coming in and out at any given time.\n  But what we’re currently seeing is an incredible 90% of move searches involving the Bay Area are current residents looking to leave and only 10% are people looking to move into the region. That’s a very different picture from just last year.\n      The Bay Area has a  complicated migration history, so it’s hard to say precisely what’s driving the change. We’ve also observed changes in relocation requests out of other major cities like  New York recently.\n  But there are many reasons why the region could finally be experiencing a shrinking population:\n    While long term net migration trends take years to measure, this early data does suggest a major acceleration in residents leaving the Bay Area. This is a trend we will certainly be keeping an eye on.", "posttime": "2020-05-06 02:18:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "旧金山,速度,francisco,趋势,major", "title": "旧金山居民正以前所未有的速度离开", "title_en": "San Francisco Residents Are Leaving at an Unprecedented Rate", "transed": 1, "url": "https://www.movebuddha.com/blog/sf-outbound-surge-2020/", "via": "", "real_tags": ["旧金山", "速度", "francisco", "趋势", "major"]}, {"category": "", "categoryclass": "", "imagename": "99f2a4867840879bbc756f59cbd839ff.jpg", "infoid": 1000795, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自2019年10月以来，Facebook及其子公司WhatsApp一直与以色列间谍软件公司NSO Group在法庭上争执不下，声称该公司利用WhatsApp为间谍软件分发提供便利。虽然尚未得出结论，但此案提出了关于NSO集团和用户隐私状况的有趣概念。但没关系，这家臭名昭著的恶意软件供应商现在正在销售一款冠状病毒跟踪应用程序。想必跟间谍业务没什么关系。\n在这篇文章中，我们简要介绍了WhatsApp黑客案件以及NSO集团在其中所扮演的角色，查看了这家间谍软件公司的冠状病毒应用程序，并指出了一些对此问题的担忧。\n2019年10月29日，WhatsApp发布了一份声明，通知用户团队在2019年5月早些时候阻止了一次网络攻击。在声明中，WhatsApp将此次攻击归咎于NSO集团，这是一家向全球各国政府和“授权机构”出售间谍软件的以色列公司。这家信使及其母公司Facebook也对NSO集团提起了诉讼。\n根据WhatsApp的研究，信使的视频通话服务被利用，将恶意代码植入用户的移动设备。大约1400名用户成为这次攻击的目标。原来，这些用户中有记者、人权活动家和持不同政见者。\n在攻击过程中，这些用户收到会用间谍软件感染设备的语音电话。目标甚至不需要接电话。有问题的间谍软件是Pegasus，这是NSO集团开发和销售的旗舰解决方案。进入Android或iOS设备后，Pegasus可以发回密码、联系人、消息和日历，还可以使用相机、麦克风和GPS传感器获取更多信息。\n复杂的法庭案件仍在进行中。脸书和WhatsApp声称，NSO集团违反了“信使服务条款”、“计算机欺诈和滥用法”以及с的其他法律。作为回报，NSO集团表示，他们与此次攻击及其客户使用软件的方式无关。\n“我们的产品用于制止恐怖主义、遏制暴力犯罪和拯救生命。NSO集团并不为其客户运营Pegasus软件，“该公司告诉”卫报“(The Guardian)。\n让此案变得棘手的是，WhatsApp在技术上并没有被黑客攻击，而是被利用来侵入用户的设备。\n它变得更时髦了。2020年4月30日，Facebook请求法院取消代表NSO集团的King&amp；Spalding律师事务所的资格。他们争辩说可能存在利益冲突。由于该公司此前曾在另一起案件中代表WhatsApp，他们可能获得了一些知识，这将使他们获得不公平的优势。本案涉及司法部破解WhatsApp加密的努力，而King&amp；Spalding正在保护加密不受政府攻击。\n有趣的是，当时负责此案的King&Amp；Spalding律师事务所的律师是现任联邦调查局局长克里斯托弗·雷(Christopher Wray)。如今，他是科技公司引入的强加密的反对者。\n无论结果如何，与Facebook的法律战给NSO集团及其在间谍软件业务方面取得的成就带来了大量媒体关注。这一点恰好特别重要，因为该公司现在正在推动一项新的大产品。\n一家利用其全部技术和知识通过销售间谍软件赚取收入的公司，将处于开发冠状病毒跟踪IT解决方案的完美地位。至少在使用恶意软件提供商制造的良性跟踪应用程序的前提真正深入人心之前，情况似乎是这样的。\nNSO集团正在销售一种代号为Fleming的软件解决方案，该解决方案旨在根据手机数据监控和预测病毒的传播。该公司向世界各地的政府推销，声称一些国家已经在测试该软件。\n据报道，Fleming使用改编版本的用户界面和分析工具，旨在补充NSO集团制造的臭名昭著的恶意软件Pegasus。该公司声称，它不会访问任何信息，这款应用程序也不会收集地理位置数据。政府客户将不得不走老路，要求当地移动电话运营商分享他们的记录。\n“这是一家臭名昭著的间谍软件公司扩展到大规模监控领域的一次极其愤世嫉俗的尝试。世界上的每个公民都希望尽快恢复正常。对监控技术的淘金热很容易意味着人们对隐私的正常期望，我们将很难回到那里，“公民实验室的高级研究员约翰·斯科特-雷顿(John Scott-rayton)告诉主板。\nNSO集团参与拯救世界免于流感大流行的大胆决定引发了许多问题，可能至少也有一些人表示怀疑。需要重申的是，该公司卷入了许多争议，因为其Pegasus间谍软件已被全球各国政府广泛使用，以瞄准不想要的人。即使NSO集团说的是真的，他们的意图是好的，也没有太多理由相信他们的客户会表现出来，因为他们过去显然不会这样做。\n“上一次社区传播这种流行病的病例已经过去很久了，我担心的是，像NSO这样的无良公司正在推销的这些监控机制将继续留在我们的网络上，继续跟踪我们的手机。这是一个我们可以防止的反乌托邦结果，“约翰·斯科特-雷顿补充道。\n考虑到这种有争议的情况，NSO集团的跟踪应用程序的故事造成了一个更大的问题。\n根据研究，大约41%的美国成年人既有技术能力也有使用病毒跟踪应用的意愿。了解到其中一些应用程序是由为政府配备左右间谍软件的公司开发的，这对全球的努力没有丝毫帮助。还有一个事实是，一些政府非常渴望滥用他们强有力的监测工具，无论是否流行。\n似乎有理由认为，一个旨在跟踪大流行传播的应用程序必须被无处不在地使用才能正常工作。当一半的人口仍然是未知变量时，这种跟踪的有效性是值得怀疑的。\n然后就是一个很大的两难境地。现在看来，全世界都可以利用一切帮助来控制疫情和经济，而追踪病毒传播的手段可能会非常有帮助。但要付出巨大的代价，因为在健康危机之后很长一段时间里，额外的监测可能会继续存在。\n在Twitter和Facebook上关注我们，加入我们的电报频道，了解加密是怎么回事，为什么它很重要。", "note_en": "Since October 2019, Facebook and it’s subsidiary WhatsApp have been fighting in court with an Israeli spyware firm NSO Group, claiming that the firm used WhatsApp to facilitate spyware distribution. Although the conclusion is yet to be reached, the case brought up interesting notions about NSO Group and the situation with users’ privacy. But nevermind that, the notorious malware vendor is now selling a COVID-19 tracking app. Nothing of that spying business, presumably.\n  In this piece, we give a rundown on the WhatsApp hacking case and the role of NSO Group in it, look at the spyware firm’s COVID-19 app and point out a few concerns about it all.\n  On October 29th, 2019, WhatsApp published a  statement informing the users about a cyberattack the team stopped earlier in May 2019. In the statement, WhatsApp attributed the attack to  NSO Group, an Israeli firm that sells spyware to governments and “authorized agencies” around the globe. The messenger and its parent Facebook have also filed a  lawsuit against NSO Group.\n According to WhatsApp’s research, the messenger’s video call service was exploited to implant malicious code into the user’s mobile devices. Around 1,400 users were targeted by the attack. It  turned out that among these users were journalists, human rights activists, and dissidents.\n Over the course of the attack, these users received voice calls that would infect the device with spyware. The targets didn’t even have to pick up the call. The spyware in question is Pegasus, a flagship solution developed and sold by NSO Group. After getting onto an Android or iOS device, Pegasus was able to send back passwords, contacts, messages, and calendars, as well as use cameras, microphones, and GPS sensors to get additional information.\n The complicated court case is still unfolding. Facebook and WhatsApp  claim that NSO Group violated the messenger’s Terms of Service, the Computer Fraud and Abuse Act, and сertain other laws. In return, NSO Group  said that they had nothing to do with the attack and the ways their clients use the software.\n “Our products are used to stop terrorism, curb violent crime, and save lives. NSO Group does not operate the Pegasus software for its clients,”  the company told The Guardian.\n What makes the case tricky is the fact that WhatsApp wasn’t technically hacked, but exploited to hack into user’s devices.\n It gets funkier. On April 30th, 2020, Facebook  asked the court to disqualify the law firm King &amp; Spalding representing NSO Group. The argued that there may be a conflict of interest. Since the firm had previously represented WhatsApp in another case, they may have gained knowledge that would give them an unfair advantage. The case in question had to do with the Department of Justice’s efforts to break through WhatsApp’s encryption, and King &amp; Spalding were protecting the encryption against the government.\n Interestingly enough, at that time, the lawyer at King &amp; Spalding who worked on the case  was Christopher Wray, the current director of the FBI. Nowadays, he is an opponent of strong encryption introduced by tech companies.\n Regardless of the outcome, the legal fight with Facebook brought a lot of media attention to NSO Group and its  achievements in the spyware business. This happened to be especially important, as the company now pushes a new big product.\n  A company that makes revenue from selling spyware with all its tech and knowledge would be in a perfect position to develop an IT-solution for COVID-19 tracking. Or so it may seem until the premise of using a benign tracking app made by a malware provider really sinks in.\n NSO Group is  selling a software solution ambitiously codenamed   Fleming, which is meant to monitor and project the spread of the virus based on mobile phone data. The company pitches governments around the world claiming that some countries are already testing the software.\n Reportedly,  Fleming uses adapted versions of the user interface and analytical tool that were designed to complement Pegasus, the notorious malware made by NSO Group. The company claimed that it won’t be accessing any information and the app won’t be collecting geolocation data. The government clients will have to go the old-fashioned way and ask local mobile phone operators to share their records.\n “This is an extremely cynical attempt from a notorious spyware company to branch out into mass surveillance. Every citizen of the world wants to go back to normal as soon as possible. The gold rush to surveillance technology could easily mean that there is a normal expectation of privacy that we will have a hard time going back to,”  John Scott-Railton, a senior researcher at the Citizen Lab,   told  the Motherboard.\n NSO Group’s bold decision to take part in saving the world from the pandemic raised a lot of questions and probably at least a few eyebrows. To reiterate, the company is involved in numerous controversies, as its Pegasus spyware has been used extensively by governments around the globe to target unwanted people. Even if what NSO Group says is true and their intentions are good, there aren’t many reasons to believe that their clients will behave, as they clearly haven’t in the past.\n “Long after the last community transmitted case of this pandemic, my fear is that these surveillance mechanisms that are being pitched by unscrupulous companies like NSO will stay on our networks and continue to track our phones. This is one dystopian outcome that we can prevent,”  John Scott-Railton added.\n  Given the controversial circumstances, the story with NSO Group’s tracking app contributes to a much larger problem.\n According to  research, about 41% of American adults have both the technical capacity and the willingness to use a virus-tracking app. Learning that some of these apps are made by companies that equip governments with spyware left and right will not help the global effort in the slightest. And then there’s the fact that some governments are very eager to misuse their potent surveillance tools, pandemic or not.\n It appears reasonable to assume that an app meant to track the spread of a pandemic has to be used ubiquitously to work properly. When half of the population remains an unknown variable, the usefulness of such tracking is dubious.\n And then there’s the big dilemma. It looks like right now the world could use every bit of help to get the pandemic and the economy under control and the means to track the spread of the virus could’ve been very helpful. But there is a substantial price to pay, as extra surveillance is likely to remain in place long after the health crisis.\n Follow us on   Twitter  and   Facebook  and join our   Telegram channel  to know what’s up with crypto and why it’s important.", "posttime": "2020-05-06 02:05:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,病毒,冠状病毒,间谍,spyware", "title": "臭名昭著的间谍软件供应商推出冠状病毒跟踪解决方案", "title_en": "Notorious Spyware Vendor Pushes Covid-19 Tracking Solution", "transed": 1, "url": "https://forklog.media/notorious-spyware-vendor-pushes-covid-19-tracking-solution/", "via": "", "real_tags": ["软件", "病毒", "冠状病毒", "间谍", "spyware"]}, {"category": "", "categoryclass": "", "imagename": "c33a589f1243651c8ee9b454432af4ea.png", "infoid": 1000794, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转以搜索X窗口系统(X11，或简称X)是位图显示的窗口系统，在类Unix操作系统上很常见。\nX提供了GUI环境的基本框架：在显示设备上绘制和移动窗口，以及与鼠标和键盘交互。X不强制使用用户界面-这是由单独的程序处理的。因此，基于X的环境的视觉样式差异很大；不同的程序可能呈现完全不同的界面。\nX起源于1984年麻省理工学院(MIT)的雅典娜项目。[1][需要更好的来源]X协议自1987年9月以来一直处于版本11(因此&#34；X11&34；)。X.Org基金会领导了X项目，目前的参考实现是X.Org Server，根据麻省理工学院的许可和类似的许可许可，X.Org Server作为免费和开放源码软件提供。[2]。\nX是一个独立于体系结构的系统，用于远程图形用户界面和输入设备功能。使用联网终端的每个人都能够与任何类型的用户输入设备与显示器交互。\n在其标准发行版中，它是一个完整的、尽管简单的显示和界面解决方案，它提供了一个标准工具包和协议栈，用于在大多数类Unix操作系统和OpenVMS上构建图形用户界面，并且已经移植到许多其他当代通用操作系统上。\nX提供了用于构建这样的GUI环境的基本框架或原语：在显示器上绘制和移动窗口，以及与鼠标、键盘或触摸屏交互。X不强制使用用户界面；单个客户端程序处理这一点。程序可以在没有用户界面的情况下使用X的图形功能。因此，基于X的环境的视觉样式差异很大；不同的程序可能呈现完全不同的界面。\n与大多数早期的显示协议不同，X专门设计为在网络连接上使用，而不是在集成或连接的显示设备上使用。X具有网络透明性，这意味着在网络(如Internet)上的某台计算机上运行的X程序可以在网络上其他计算机上运行的X服务器上显示其用户界面。X服务器通常是X客户端的图形资源和键盘/鼠标事件的提供者，这意味着X服务器通常在人类用户面前运行在计算机上，而X客户端应用程序运行在网络上的任何地方，并与用户的计算机通信，以请求渲染图形内容并从包括键盘和鼠标的输入设备接收事件。\n术语服务器被应用于用户面前的软件的事实常常令习惯于他们的程序是远程计算机上的服务的客户端的用户感到惊讶。这里，不是远程数据库作为本地应用程序的资源，而是用户的图形显示和输入设备成为由本地X服务器提供给需要共享用户的图形和输入设备以与用户通信的本地和远程托管的X客户端程序的资源。\nX&#39；的网络协议基于X命令原语。此方法允许可能在不同计算机上运行的X客户端应用程序的2D和(通过GLX等扩展)3D操作仍可在X服务器的显示器上完全加速。例如，在经典的OpenGL(3.0版之前)中，包含大量对象的显示列表可以由远程X客户端程序完全构建并存储在X服务器中，然后通过在网络上发送单个glCallList(它)来呈现每个对象。\nX不提供对音频的原生支持；有几个项目可以填补这一空白，有些项目还提供透明的网络支持。\nX使用客户端-服务器模型：X服务器与各种客户端程序通信。服务器接受图形输出请求(Windows)并发回用户输入(从键盘、鼠标或触摸屏)。服务器可以作为以下功能运行：\n这种客户端-服务器术语-用户的终端是服务器，应用程序是客户端-经常会让新的X用户感到困惑，因为这两个术语看起来是相反的。但是X站在应用程序的角度，而不是从最终用户的角度：X向应用程序提供显示和I/O服务，因此它是服务器；应用程序使用这些服务，因此它们是客户端。\n服务器和客户端之间的通信协议是网络透明的：客户端和服务器可以运行在同一台机器上，也可以运行在不同的机器上，可能具有不同的体系结构和操作系统。客户端和服务器甚至可以通过在加密的网络会话上通过隧道传输连接来安全地在Internet上通信。\nX客户端本身可以通过向其他客户端提供显示服务来模拟X服务器。这称为X嵌套。Xnest和Xephyr等开源客户端支持这样的X嵌套。\n要在远程计算机上使用X客户端应用程序，用户可以执行以下操作：\n请求本地显示/输入服务(例如，如果未使用启用X转发的SSH，则导出显示=[用户的机器]：0)\n然后，远程X客户端应用程序将连接到用户的本地X服务器，为用户提供显示和输入。\n或者，本地机器可以运行连接到远程机器并启动客户端应用程序的小程序。\n使用客户端应用程序加入协作工作组中的大量其他终端用户。\n在远程计算机上运行计算密集型模拟，并在本地台式计算机上显示结果。\n在一台显示器、键盘和鼠标的控制下，同时在多台机器上运行图形软件。\n除非实现者没有新功能就无法完成真正的应用程序，否则不要添加新功能。\n决定一个制度不是什么和决定它是什么一样重要。不要满足世界上所有人的需求；相反，要使系统具有可扩展性，以便能够以向上兼容的方式满足其他需求。\n唯一比从一个例子中概括更糟糕的是从根本没有例子中概括。\n如果问题没有被完全理解，最好是根本不提供解决方案。\n如果您可以用10%的工作量获得90%的预期效果，那么使用更简单的解决方案。(另请参阅越差越好。)。\n提供机制而不是政策。特别是，将用户界面策略交到客户端手中。\n第一个原则在X11的设计过程中被修改为：不要添加新功能，除非您知道某些实际的应用程序会需要它。&#34；[3]。\nX在很大程度上遵守了这些原则。开发样本实施是为了扩展和改进实施，同时保持与原始1987年议定书的兼容。\nX主要定义协议和图形基元-它故意不包含应用程序用户界面设计的规范，如按钮、菜单或窗口标题栏样式。取而代之的是，应用软件-如窗口管理器、GUI小部件工具包和桌面环境，或者特定于应用的图形用户界面-定义并提供这样的细节。因此，没有典型的X界面，几种不同的桌面环境在用户中变得流行起来。\n窗口管理器控制应用程序窗口的位置和外观。这可能会导致桌面界面让人联想到Microsoft Windows或Apple Macintosh(示例包括GNOME 2、KDE、Xfce)，或者具有完全不同的控件(例如平铺窗口管理器，如wmii或Rattoxic)。一些界面，如Sugar或Chrome OS，完全避开了桌面的比喻，简化了专门应用程序的界面。窗口管理器的复杂性和复杂性从基本的窗口管理器(例如，TWM，随X提供的基本窗口管理器，或evilwm，一个极其轻量级的窗口管理器)到更全面的桌面环境(如启蒙)，甚至到用于垂直市场(如销售点)的特定于应用程序的窗口管理器，不一而足。\n许多用户在桌面环境中使用X，除了窗口管理器之外，桌面环境还包括使用一致用户界面的各种应用程序。流行的桌面环境包括GNOME、KDE软件编译和Xfce。UNIX 98标准环境是通用桌面环境(CDE)。freedesktop.org计划解决桌面与竞争对手X桌面所需组件之间的互操作性问题。\nX.Org实现是X的规范实现。由于自由许可，出现了许多变体，既有免费的，也有开源的，也有专有的。商业Unix供应商倾向于采用参考实现并使其适应其硬件，通常是对其进行定制并添加专有扩展。\n直到2004年，XFree86在类Unix免费系统上提供了最常见的X变体。XFree86最初是作为X到386兼容PC的端口，到20世纪90年代末，已经成为X技术创新的最大来源和X开发的事实标准。[4]然而，自2004年以来，XFree86的分支--X.Org服务器占据了主导地位。\n虽然将X与Unix相关联是很常见的，但X服务器也以本机方式存在于其他图形环境中。VMS Software Inc.的OpenVMS操作系统包括一个X版本，其标准桌面环境为通用桌面环境(CDE)，称为DECwindows。[需要引用]苹果最初以X11.app的形式将X移植到MacOS上，但为了支持XQuartz实现，这一做法遭到了抨击。在20世纪90年代苹果较旧的操作系统System7和MacOS8和9下的第三方服务器，包括苹果的MacX和白松软件(White Pine Software)的大量撤离。\nMicrosoft Windows未附带对X的支持，但存在许多第三方实现，如Cygwin/X等免费开源软件，以及Except、MKS X/Server、Reflect X、X-Win32和Xming等专有产品。\n还有X服务器的Java实现。WeirdX可以在任何支持Swing 1.1的平台上运行，并且可以作为小程序在大多数浏览器中运行。Android X Server是一个运行在Android设备上的开源Java实现。\n当具有本地窗口系统的操作系统另外托管X时，X系统可以在单独的主机窗口中使用其自己的普通桌面，或者它可以无根运行，这意味着X桌面被隐藏，并且主机窗口环境管理主机屏幕内托管的X窗口的几何形状和外观。\nX终端是只运行X服务器的瘦客户端。这种体系结构在构建便宜的终端公园方面变得流行起来，许多用户可以同时使用相同的大型计算机服务器作为每个用户的X终端的客户端来执行应用程序。这一用途非常符合麻省理工学院项目的初衷。\nX终端使用X显示管理器控制协议探索网络(本地广播域)，以生成允许作为客户端的可用主机列表。其中一台客户端主机应该运行X显示管理器。\nX终端和大多数瘦客户机的一个限制是，除了键盘、鼠标和显示器之外，它们不能进行任何输入或输出。假设所有相关数据仅存在于远程服务器上，并且X终端用户没有可用于从本地外围设备保存或加载数据的方法。\n专用(硬件)X终端已不再使用；配备X服务器的PC或现代瘦客户端通常以相同或更低的成本提供相同的功能。\nUnix-Hater手册(1994)花了整整一章来讨论X的问题。[5]Gajeska、Manasse和McCormack在1990年出版的“为什么X不是我们的理想窗口系统”详细说明了协议中存在的问题，并提出了改进建议。\n在X中缺乏设计指南导致了几个截然不同的界面，以及应用程序并不总是能很好地协同工作。客户端间通信约定手册(ICCCM)是客户端互操作性的规范，以难以正确实现而著称。进一步的标准努力，如Motif和CDE，并没有缓解问题。这让用户和程序员感到沮丧。[6]图形程序员现在通常通过编码到特定桌面环境或特定窗口小部件工具包来解决应用程序外观和通信的一致性问题，这也避免了必须直接与ICCCM打交道。\nX还缺乏对X服务器上用户定义的存储过程的本机支持，这与新闻报道的方式不同-没有图灵完整的脚本工具。因此，各种桌面环境可以提供它们自己的(通常是相互不兼容的)设施。\n基于X构建的系统可能存在可访问性问题，这会使残疾用户难以使用计算机，包括右键单击、双击、中键单击、鼠标悬停和焦点窃取。一些X11客户端比其他客户端更好地处理可访问性问题，因此有可访问性问题的人不会被排除在使用X11之外。但是，X11没有可访问性标准或可访问性指南。在X11标准过程中，没有关于可访问性的工作组，但是，软件项目正在解决可访问性需求，以便在X之上提供这些功能。\nOrca项目向X Window系统添加了可访问性支持，包括实现API(AT-SPI[7])。这与GNOME的ATK结合在一起，允许使用GNOME/GTK API在X程序中实现辅助功能。[8]KDE提供了一套不同的辅助功能软件，包括文本到语音转换器和屏幕放大镜。[9]其他主要台式机(LXDE、XFCE和启迪)都试图与ATK兼容。\nX客户机通常不能从一台服务器分离并重新连接到另一台服务器，除非它的代码专门为它提供了支持(Emacs是少数几个具有此功能的常见程序之一)。因此，将整个会话从一台X服务器移到另一台服务器通常是不可能的。然而，像虚拟网络计算(VNC)、NX和Xpra这样的方法允许从不同的X服务器到达虚拟会话(以类似于终端的GNU屏幕的方式)，并且其他应用程序和工具包提供相关的工具。[10]还存在x11vnc(VNC：0观众)、Xpra的影子模式和NX#39；的nxagent影子模式等解决办法，以使当前的X-server屏幕可用。此功能允许将正在运行的应用程序的用户界面(鼠标、键盘、监视器)从一个位置切换到另一个位置，而无需停止和重新启动该应用程序。\n默认情况下，X服务器和远程X客户端之间的网络流量不加密。拥有数据包嗅探器的攻击者可以拦截它，从而可以查看显示到用户屏幕或从用户屏幕发送的任何内容。加密X流量的最常见方法是建立用于通信的安全外壳(SSH)隧道。\n与所有瘦客户端一样，当在网络中使用X时，带宽限制可能会阻碍位图密集型应用程序的使用，这些应用程序需要以低延迟快速更新大部分屏幕，例如3D动画或照片编辑。即使是相对较小的未压缩的640x480x24Mbit 30Fps视频流(~211 Mbit/s)也可以轻松超过单个客户端100Mbit/s网络的带宽。相比之下，现代版本的X通常具有诸如MESA之类的扩展，该扩展允许本地程序的图形的本地显示被优化以绕过网络模型并直接控制视频卡，以使用全屏视频、渲染的3D应用程序和其他此类应用程序。\nX&#39；的设计要求客户端和服务器分开操作，而设备独立性和客户端和服务器的分离会产生开销。大部分开销来自客户端和服务器之间的网络往返延迟时间(延迟)，而不是协议本身：性能问题的最佳解决方案取决于高效的应用程序设计。[11]对X的一种常见批评是，如果仅在本地使用，其网络功能会导致过度复杂和性能下降。\n现代X实现使用Unix域套接字在同一主机上进行高效连接。此外，可以使用共享内存(通过MIT-SHM扩展)来实现更快的客户端-服务器通信。[12]但是，程序员仍必须显式激活和使用共享内存扩展。还需要提供后备路径，以便与较旧的实现保持兼容，并与非本地X服务器通信。\n有些人曾试图编写X的替代方案和替代方案。历史上的替代方案包括Sun的新闻和Next的Display PostScript，这两个基于PostScript的系统都支持用户可定义的显示端过程，这是X所缺乏的。目前的替代方案包括：\nMacOS(和它的移动同行iOS)实现了它的Windows系统，也就是众所周知的Quartz。当苹果公司(Apple Inc.)。购买NeXT，并使用NeXTSTEP构建MacOSX，它用Quartz取代了Display PostScript。Quartz的作者之一Mike Paquette解释说，如果苹果在X11中增加了对它想要包括的所有功能的支持，它就不会与X11有太多相似之处，也不会与其他服务器兼容。[13]。\n在Linux内核上运行的Android使用自己的系统来绘制称为SurfaceFlinger的用户界面。3D渲染由EGL处理。\nWayland正在由几个X.Org开发人员开发，作为X的潜在替代品。它通过DRI直接与GPU硬件一起工作。Wayland可以将X.org服务器作为客户端运行，这可以是无根的。[14]2013年完成了Raspberry Pi的Wayland后端的专有端口。[15]该项目于2012年达到1.0版。和Android一样，Wayland也是基于EGL的。\nMIR是Canonical Ltd.的一个项目，目标与Wayland类似。[16]MIR旨在与使用ARM芯片组的移动设备(明确的目标是与Android设备驱动程序兼容)以及x86台式机一起使用。和Android一样，Mir/UnityNext也是基于EGL的。与X客户端应用程序的向后兼容是通过Xmir实现的。\n其他替代方案试图通过直接使用硬件来避免X的开销；这样的项目包括DirectFB。[17](旨在为帧缓冲区提供可靠内核级接口的直接渲染基础设施(DRI)可能会[需要引用]使这些工作变得多余。)。\n通过图形服务的网络传输性，实现X的网络透明性功能形式的其他方式包括：\n虚拟网络计算(VNC)，这是一个非常低级的系统，它通过网络发送压缩的位图；Unix实现包括一个X服务器。\n远程桌面协议(RDP)，目的类似于VNC，但在移植到类Unix系统之前起源于Microsoft Windows；参见NX、GoToMyPC等。\n在X之前有几个位图显示系统。施乐推出了Alto(1973)和Star(1981)。阿波罗计算机公司推出了“显示经理”(1981)。苹果推出了丽莎(Lisa)(1983年)和麦金塔(Macintosh)(1984年)。Unix世界有安德鲁项目(1982)和罗伯·派克的Blit终端(1982)。\n卡内基梅隆大学制作了一款远程访问应用程序。\n..", "note_en": "Jump to navigation  Jump to search  The  X Window System ( X11, or simply  X) is a  windowing system for  bitmap displays, common on  Unix-like  operating systems.\n X provides the basic  framework for a  GUI environment: drawing and moving  windows on the  display device and interacting with a  mouse and  keyboard. X does not mandate the user interface – this is handled by individual programs. As such, the visual styling of X-based environments varies greatly; different programs may present radically different interfaces.\n X originated at the  Project Athena at  Massachusetts Institute of Technology (MIT) in 1984.  [1] [   better source needed] The  X protocol has been at version 11 (hence &#34;X11&#34;) since September 1987. The  X.Org Foundation leads the X project, with the current reference implementation,  X.Org Server, available as  free and open source software under the  MIT License and similar  permissive licenses.  [2]\n   X is an architecture-independent system for remote graphical user interfaces and input device capabilities. Each person using a networked  terminal has the ability to interact with the display with any type of user input device.\n In its standard distribution it is a complete, albeit simple, display and interface solution which delivers a standard  toolkit and  protocol stack for building graphical user interfaces on most  Unix-like operating systems and  OpenVMS, and has been  ported to many other contemporary general purpose  operating systems.\n X provides the basic  framework, or primitives, for building such GUI environments: drawing and moving  windows on the  display and interacting with a mouse, keyboard or touchscreen. X does not mandate the  user interface; individual client programs handle this. Programs may use X&#39;s graphical abilities with no user interface. As such, the visual styling of X-based environments varies greatly; different programs may present radically different interfaces.\n Unlike most earlier display protocols, X was specifically designed to be used over network connections rather than on an integral or attached display device. X features  network transparency, which means an X program running on a computer somewhere on a network (such as the Internet) can display its user interface on an X server running on some other computer on the network. The X server is typically the provider of graphics resources and keyboard/mouse events to X  clients, meaning that the X server is usually running on the computer in front of a human user, while the X client applications run anywhere on the network and communicate with the user&#39;s computer to request the rendering of graphics content and receive events from input devices including keyboards and mice.\n The fact that the term &#34;server&#34; is applied to the software in front of the user is often surprising to users accustomed to their programs being clients to services on remote computers. Here, rather than a remote database being the resource for a local app, the user&#39;s graphic display and input devices become resources made available by the local X server to both local and remotely hosted X client programs who need to share the user&#39;s graphics and input devices to communicate with the user.\n X&#39;s network protocol is based on X command primitives. This approach allows both 2D and (through extensions like GLX) 3D operations by an X client application which might be running on a different computer to still be fully accelerated on the X server&#39;s display. For example, in classic OpenGL (before version 3.0), display lists containing large numbers of objects could be constructed and stored entirely in the X server by a remote X client program, and each then rendered by sending a single glCallList(which) across the network.\n X provides no native support for audio; several projects exist to fill this niche, some also providing  transparent network support.\n    X uses a  client–server model: an X server communicates with various  client programs. The server accepts requests for graphical output (windows) and sends back user input (from keyboard, mouse, or touchscreen). The server may function as:\n  This client–server terminology – the user&#39;s terminal being the server and the applications being the clients – often confuses new X users, because the terms appear reversed. But X takes the perspective of the application, rather than that of the end-user: X provides display and I/O services to applications, so it is a server; applications use these services, thus they are clients.\n The  communication protocol between server and client operates  network-transparently: the client and server may run on the same machine or on different ones, possibly with different  architectures and  operating systems. A client and server can even communicate  securely over the Internet by  tunneling the connection over an  encrypted network session.\n An X client itself may emulate an X server by providing display services to other clients. This is known as &#34;X nesting&#34;. Open-source clients such as  Xnest and  Xephyr support such X nesting.\n To use an X client application on a remote machine, the user may do the following:\n request local display/input service (e.g.,  export DISPLAY= [user&#39;s machine]:0 if not using SSH with X forwarding enabled)\n The remote X client application will then make a connection to the user&#39;s local X server, providing display and input to the user.\n Alternatively, the local machine may run a small program that connects to the remote machine and starts the client application.\n  using a client application to join with large numbers of other terminal users in collaborative workgroups\n running a computationally intensive simulation on a remote machine and displaying the results on a local desktop machine\n running graphical software on several machines at once, controlled by a single display, keyboard and mouse\n   Do not add new functionality unless an implementor cannot complete a real application without it.\n It is as important to decide what a system is not as to decide what it is. Do not serve all the world&#39;s needs; rather, make the system  extensible so that additional needs can be met in an upwardly compatible fashion.\n The only thing worse than generalizing from one example is generalizing from no examples at all.\n If a problem is not completely understood, it is probably best to provide no solution at all.\n If you can get 90 percent of the desired effect for 10 percent of the work, use the simpler solution. (See also  worse is better.)\n  Provide  mechanism rather than policy. In particular, place user interface policy in the clients&#39; hands.\n The first principle was modified during the design of X11 to:  &#34;Do not add new functionality unless you know of some real application that will require it.&#34;  [3]\n X has largely kept to these principles. The sample implementation is developed with a view to extension and improvement of the implementation, while remaining compatible with the original 1987 protocol.\n    X primarily defines protocol and graphics primitives – it deliberately contains no specification for application  user-interface design, such as  button,  menu, or window  title-bar styles. Instead, application software – such as  window managers, GUI  widget toolkits and  desktop environments, or application-specific  graphical user interfaces – define and provide such details. As a result, there is no  typical X interface and several different desktop environments have become popular among users.\n A window manager controls the placement and appearance of application windows. This may result in desktop interfaces reminiscent of those of  Microsoft Windows or of the Apple  Macintosh (examples include  GNOME 2,  KDE,  Xfce) or have radically different controls (such as a  tiling window manager, like  wmii or  Ratpoison). Some interfaces such as  Sugar or  Chrome OS eschew the  desktop metaphor altogether, simplifying their interfaces for specialized applications. Window managers range in sophistication and complexity from the bare-bones ( e.g.,  twm, the basic window manager supplied with X, or evilwm, an extremely light window-manager) to the more comprehensive desktop environments such as  Enlightenment and even to application-specific window-managers for vertical markets such as point-of-sale.\n Many users use X with a desktop environment, which, aside from the window manager, includes various applications using a consistent user-interface. Popular desktop environments include GNOME, KDE Software Compilation and Xfce. The  UNIX 98 standard environment is the  Common Desktop Environment (CDE). The  freedesktop.org initiative addresses interoperability between desktops and the components needed for a competitive X desktop.\n  The  X.Org implementation is the  canonical implementation of X. Owing to liberal  licensing, a number of variations, both  free and open source and  proprietary, have appeared. Commercial Unix vendors have tended to take the reference implementation and adapt it for their hardware, usually customizing it and adding proprietary extensions.\n Up until 2004,  XFree86 provided the most common X variant on free  Unix-like systems. XFree86 started as a  port of X to  386-compatible PCs and, by the end of the 1990s, had become the greatest source of technical innovation in X and the  de facto standard of X development.  [4] Since 2004, however, the  X.Org Server, a  fork of XFree86, has become predominant.\n While it is common to associate X with Unix, X servers also exist natively within other graphical environments. VMS Software Inc.&#39;s  OpenVMS operating system includes a version of X with  Common Desktop Environment (CDE), known as  DECwindows, as its standard desktop environment. [   citation needed]  Apple originally ported X to  macOS in the form of X11.app, but that has been deprecated in favor of the  XQuartz implementation. Third-party servers under Apple&#39;s older operating systems in the 1990s, System 7, and Mac OS 8 and 9, included Apple&#39;s  MacX and White Pine Software&#39;s eXodus.\n Microsoft Windows is not shipped with support for X, but many third-party implementations exist, as  free and open source software such as  Cygwin/X, and proprietary products such as  Exceed,  MKS X/Server,  Reflection X,  X-Win32 and  Xming.\n There are also  Java implementations of X servers. WeirdX runs on any platform supporting  Swing 1.1, and will run as an applet within most  browsers. The  Android X Server is an open source Java implementation that runs on  Android devices.\n When an operating system with a native windowing system hosts X in addition, the X system can either use its own normal desktop in a separate host window or it can run  rootless, meaning the X desktop is hidden and the host windowing environment manages the geometry and appearance of the hosted X windows within the host screen.\n    An  X terminal is a  thin client that only runs an X server. This architecture became popular for building inexpensive terminal parks for many users to simultaneously use the same large computer server to execute application programs as clients of each user&#39;s X terminal. This use is very much aligned with the original intention of the MIT project.\n X terminals explore the network (the local  broadcast domain) using the  X Display Manager Control Protocol to generate a list of available hosts that are allowed as clients. One of the client hosts should run an  X display manager.\n A limitation of X terminals and most thin clients is that they are not capable of any input or output other than the keyboard, mouse, and display. All relevant data is assumed to exist solely on the remote server, and the X terminal user has no methods available to save or load data from a local  peripheral device.\n Dedicated (hardware) X terminals have fallen out of use; a  PC or modern  thin client with an X server typically provides the same functionality at the same, or lower, cost.\n   The Unix-Haters Handbook (1994) devoted a full chapter to the problems of X.  [5]  Why X Is Not Our Ideal Window System (1990) by Gajewska, Manasse and McCormack detailed problems in the protocol with recommendations for improvement.\n  The lack of design guidelines in X has resulted in several vastly different interfaces, and in applications that have not always worked well together. The  Inter-Client Communication Conventions Manual (ICCCM), a specification for client interoperability, has a reputation for being difficult to implement correctly. Further standards efforts such as  Motif and  CDE did not alleviate problems. This has frustrated users and programmers.  [6] Graphics programmers now generally address consistency of application  look and feel and communication by coding to a specific desktop environment or to a specific widget toolkit, which also avoids having to deal directly with the ICCCM.\n X also lacks native support for user-defined stored procedures on the X server, in the manner of  NeWS – there is no  Turing-complete scripting facility. Various desktop environments may thus offer their own (usually mutually incompatible) facilities.\n  Systems built upon X may have  accessibility issues that make utilization of a computer difficult for disabled users, including  right click,  double click,  middle click,  mouse-over, and  focus stealing. Some X11 clients deal with accessibility issues better than others, so persons with accessibility problems are not locked out of using X11. However, there is no accessibility standard or accessibility guidelines for X11. Within the X11 standards process there is no working group on accessibility, however, accessibility needs are being addressed by software projects to provide these features on top of X.\n The  Orca project adds accessibility support to the X Window System, including implementing an API ( AT-SPI  [7]). This is coupled with GNOME&#39;s  ATK to allow for accessibility features to be implemented in X programs using the GNOME/GTK APIs.  [8] KDE provides a different set of accessibility software, including a text-to-speech converter and a screen magnifier.  [9] The other major desktops (LXDE, Xfce and Enlightenment) attempt to be compatible with ATK.\n   An X client cannot generally be detached from one server and reattached to another unless its code specifically provides for it ( Emacs is one of the few common programs with this ability). As such, moving an entire session from one X server to another is generally not possible. However, approaches like  Virtual Network Computing (VNC),  NX and  Xpra allow a virtual session to be reached from different X servers (in a manner similar to  GNU Screen in relation to terminals), and other applications and toolkits provide related facilities.  [10]Workarounds like  x11vnc ( VNC :0 viewers), Xpra&#39;s shadow mode and NX&#39;s nxagent shadow mode also exist to make the current X-server screen available. This ability allows the user interface (mouse, keyboard, monitor) of a running application to be switched from one location to another without stopping and restarting the application.\n Network traffic between an X server and remote X clients is not encrypted by default. An attacker with a  packet sniffer can intercept it, making it possible to view anything displayed to or sent from the user&#39;s screen. The most common way to encrypt X traffic is to establish a  Secure Shell (SSH) tunnel for communication.\n Like all  thin clients, when using X across a network,  bandwidth limitations can impede the use of  bitmap-intensive applications that require rapidly updating large portions of the screen with low latency, such as 3D animation or photo editing. Even a relatively small  uncompressed 640x480x24 bit 30 fps video stream (~211 Mbit/s) can easily outstrip the bandwidth of a 100 Mbit/s network for a single client. In contrast, modern versions of X generally have extensions such as  MESA allowing local display of a local program&#39;s graphics to be optimized to bypass the network model and directly control the video card, for use of full-screen video, rendered 3D applications, and other such applications.\n  X&#39;s design requires the clients and server to operate separately, and device independence and the separation of client and server incur overhead. Most of the overhead comes from network  round-trip delay time between client and server ( latency) rather than from the protocol itself: the best solutions to performance issues depend on efficient application design.  [11] A common criticism of X is that its network features result in excessive complexity and decreased performance if only used locally.\n Modern X implementations use  Unix domain sockets for efficient connections on the same host. Additionally  shared memory (via the  MIT-SHM extension) can be employed for faster client–server communication.  [12] However, the programmer must still explicitly activate and use the shared memory extension. It is also necessary to provide fallback paths in order to stay compatible with older implementations, and in order to communicate with non-local X servers.\n  Some people have attempted writing alternatives to and replacements for X. Historical alternatives include  Sun&#39;s  NeWS and  NeXT&#39;s  Display PostScript, both  PostScript-based systems supporting user-definable display-side procedures, which X lacked. Current alternatives include:\n macOS (and its mobile counterpart,  iOS) implements its windows system, which is known as  Quartz. When  Apple Inc. bought NeXT, and used  NeXTSTEP to construct  Mac OS X, it replaced Display PostScript with  Quartz.  Mike Paquette, one of the authors of Quartz, explained that if Apple had added support for all the features it wanted to include into X11, it would not bear much resemblance to X11 nor be compatible with other servers anyway.  [13]\n Android, which runs on the  Linux kernel, uses its own system for drawing the user interface known as  SurfaceFlinger. 3D rendering is handled by  EGL.\n Wayland is being developed by several X.Org developers as a prospective replacement for X. It works directly with the  GPU hardware, via  DRI. Wayland can run an X.org server as a client, which can be rootless.  [14] A proprietary port of the Wayland backend to the  Raspberry Pi was completed in 2013.  [15] The project reached version 1.0 in 2012. Like Android, Wayland is EGL-based.\n Mir is a project from  Canonical Ltd. with goals similar to Wayland.  [16] Mir is intended to work with mobile devices using ARM chipsets (a stated goal is compatibility with Android device-drivers) as well as x86 desktops. Like Android, Mir/UnityNext are EGL-based. Backwards compatibility with X client-applications is accomplished via Xmir.\n Other alternatives attempt to avoid the overhead of X by working directly with the hardware; such projects include  DirectFB.  [17] (The  Direct Rendering Infrastructure (DRI), which aims to provide a reliable kernel-level interface to the  framebuffer, might [   citation needed] make these efforts redundant.)\n Additional ways to achieve a functional form of the &#34;network transparency&#34; feature of X, via network transmissibility of graphical services, include:\n Virtual Network Computing (VNC), a very low-level system which sends compressed bitmaps across the network; the Unix implementation includes an X server\n Remote Desktop Protocol (RDP), which is similar to VNC in purpose, but originated on Microsoft Windows before being ported to Unix-like systems; cf  NX,  GotoMyPc, etc.\n   Several bitmap display systems preceded X. From  Xerox came the  Alto (1973) and the  Star (1981). From  Apollo Computer came Display Manager (1981). From  Apple came the  Lisa (1983) and the  Macintosh (1984). The  Unix world had the  Andrew Project (1982) and  Rob Pike&#39;s  Blit terminal (1982).\n Carnegie Mellon University produced a remote-access app\n......", "posttime": "2020-05-06 01:53:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "system,服务器,server", "title": "X Window System：原理", "title_en": "X Window System: Principles", "transed": 1, "url": "https://en.wikipedia.org/wiki/X_Window_System#Principles", "via": "", "real_tags": ["system", "服务器", "server"]}, {"category": "", "categoryclass": "", "imagename": "cf05bee9112af8dc340f8fd1208a9269.jpeg", "infoid": 1000793, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大流行使他们的游戏重新登上排行榜榜首，现在他们正在进行更新，在那里你可以结束一场大流行，而不是导致它。", "note_en": "The pandemic brought their game back to the top of the charts, and now they're working on an update where you can end a pandemic rather than cause it.", "posttime": "2020-05-06 01:53:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,开发,expected,排行榜,pandemic", "title": "“瘟疫公司”的开发者从未想过现实会像它的视频游戏一样。", "title_en": "'Plague, Inc.’ developer never expected reality to look like its video game", "transed": 1, "url": "https://www.vice.com/en_us/article/bv8g8z/plague-inc-developer-never-expected-reality-to-look-like-its-video-game", "via": "", "real_tags": ["游戏", "开发", "expected", "排行榜", "pandemic"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000792, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转搜索硝基苯基戊二烯醛、硝基苯基戊二烯醛、NPPD或METKA(俄语意为标记)，俗称间谍尘，[1]是一种化学化合物，在冷战苏联时期被克格勃用作标签剂。莫斯科的苏联当局通过在美国人的衣服、汽车、门把手和其他物品上涂上一种几乎看不见的粉末来追踪他们。间谍尘埃的其他一些变体可能含有鲁米诺，在紫外光下会发光。[2][3][4]。\n1963年，亚历山大·克雷帕诺夫(Alexander Chrepanov)首次向莫斯科的中央情报局(Central Intelligence Agency)披露了这一消息，他是一名克格勃成员。[4]。\n1984年，克格勃官员Sergei Votontsov(代号GT/COWL)提供了该物质的样本。[4]。\n1985年夏天，这种粉末开始大量出现在莫斯科。由于担心该物质对健康的影响，美国国务院公开向苏联提出抗议。后来确定，对健康的威胁很低。[7][8][9]。\n从大约2005-2015年开始，使用NPPD开发了供执法机构使用的化学品追踪工具包。[10]为了检测NPPD，将0.1%的萘间苯二酚甲醇溶液加入到问题物品的棉签中，然后加入浓盐酸。观察到红色表示检测呈阳性。[11]在早期的有机化学研究中，经常使用间苯二酚来确定溶液中是否存在醛基，在酸性溶液中会形成红色加合物。[12]。\n首页--期刊主要分类--期刊细介绍--期刊题录与文摘--期刊详细文摘内容。5-(4-硝基苯基)-2，4-戊二烯醛(烟尘)的吸收和代谢。毒效唑，Appl，药典。87(1)：121-126。电话：90090-1，电话：10.1016/0041x(87)008x。PMID为3798448。\n高普曼G，Kalos A，Frierson M，Rosenkranz HS(1986)。据预测，NPPD(间谍粉尘)是一种诱变剂。环境诱变剂。8(4)：627-30。doi：10.1002/em.2860080413.。PMID为3525138。\n马歇尔，E.(1985)。间谍灰尘激怒了外交官。科学。229(4717)：952。DOI：10.1126/Science.229.4717.952.。PMID为17782513。\n铃木，新一；大田，Hikoto；铃木，安弘；铃田，Ritsuko；鹿松，Masaaki；森，Masahito；中岛，Hidemitsu(2005)。5-(4-硝基苯基)-2，4-戊二烯-1-醛(NPPD)在模拟犯罪现场被非科学家用作示踪剂。国际法医科学协会。152(1)：29-34。doi：10.1016/j.forScience int.2005.02.026.。PMID为15939173。", "note_en": "Jump to navigation  Jump to search  Nitrophenyl pentadienal,  nitrophenylpentadienal,  NPPD, or  METKA (Russian for &#34;mark&#34;) colloquially known as &#34;spy dust&#34;,  [1] is a chemical compound used as a tagging agent by the  KGB during the  Cold War Soviet Era.  Soviet authorities in  Moscow tracked Americans by applying an almost invisible powder to their clothing, cars, doorknobs and other objects. Some other variants of &#34;spy dust&#34; may have contained  luminol and would glow under  ultraviolet light.  [2]  [3]  [4]\n   It was first revealed to the  Central Intelligence Agency in Moscow in 1963 by  Alexander Chrepanov, a KGB walk in.  [4]\n  In 1984, KGB officer  Sergei Votontsov (Code name GT/COWL) provided a sample of the substance.  [4]\n  In the summer of 1985 the powder began to appear in Moscow in much larger quantities. Concerned about the health effects of the substance, the  United States  State Department publicly protested to the Soviets. It was later determined that the health threat was low.  [7]  [8]  [9]\n Beginning about 2005-2015, a chemical tracking kit for law enforcement agencies was developed using NPPD.  [10] To detect NPPD a 0.1%  methanol solution of  naphthoresorcinol is added to a swab of the item in question and then concentrated hydrochloric acid is added. The observation of a red color indicates a positive test.  [11] Napthoresorcinol was frequently used in early organic chemistry investigations to determine the presence of  aldehyde groups in solution, a red  adduct is formed in acidic solution.  [12]\n  ^   Burka LT, Sanders JM, Kool CP, Kim YC, Matthews HB (1987). &#34;Absorption and metabolism of 5-(4-nitrophenyl)-2,4-pentadienal (Spydust)&#34;.  Toxicol Appl Pharmacol.  87 (1): 121–126.  doi: 10.1016/0041-008x(87)90090-1.  PMID  3798448.\n       ^   Klopman G, Kalos A, Frierson M, Rosenkranz HS (1986). &#34;NPPD (spy dust) is predicted to be a mutagen&#34;.  Environ Mutagen.  8 (4): 627–30.  doi: 10.1002/em.2860080413.  PMID  3525138.\n ^   Marshall, E. (1985). &#34; &#34;Spy Dust&#34; Irritates Diplomats&#34;.  Science.  229 (4717): 952.  doi: 10.1126/science.229.4717.952.  PMID  17782513.\n  ^   Suzuki, Shinichi; Ohta, Hikoto; Suzuki, Yasuhiro; Sugita, Ritsuko; Kasamatsu, Masaaki; Mori, Masahito; Nakajima, Hidemitsu (2005). &#34;5-(4-Nitrophenyl)-2,4-pentadien-1-al (NPPD) used as a tracer by nonscientists at a simulated crime scene&#34;.  Forensic Science International.  152 (1): 29–34.  doi: 10.1016/j.forsciint.2005.02.026.  PMID  15939173.", "posttime": "2020-05-06 01:30:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "戊二烯,dust,nppd", "title": "间谍尘(硝基苯基戊二烯醛)", "title_en": "Spy Dust (Nitrophenyl Pentadienal)", "transed": 1, "url": "https://en.wikipedia.org/wiki/Nitrophenyl_pentadienal", "via": "", "real_tags": ["戊二烯", "dust", "nppd"]}, {"category": "", "categoryclass": "", "imagename": "c9fdfda44195491a8f42cd177561eafd.jpg", "infoid": 1000791, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "代码：https://github.com/Henry-E/poisson_poops推特版本：https://twitter.com/EldinhoC/status/1233407388927000580", "note_en": "Code: https://github.com/Henry-E/poisson_poops Twitter version: https://twitter.com/EldinhoC/status/1233407388927000580", "posttime": "2020-05-06 01:30:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "爆炸案,bombings,https", "title": "二战爆炸案和鸟粪有什么共同之处？(概率模拟)", "title_en": "What do WWII bombings and bird poop have in common? (probability simulation)", "transed": 1, "url": "https://www.youtube.com/watch?v=PKqUzsG9txo&feature=youtu.be", "via": "", "real_tags": ["爆炸案", "bombings", "https"]}, {"category": "", "categoryclass": "", "imagename": "0498fa6474ad6d2d18227c6c018514cb.png", "infoid": 1000789, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通过今天的发布，Firefox加强了对您的在线帐户登录和密码的保护，并在这一关键时刻以创新的方式管理您的帐户：\n如果您的一个帐户涉及网站入侵，而您在其他网站上使用了相同的密码，现在系统将提示您更新密码。钥匙图标标识哪些帐户使用该易受攻击的密码。\n自动为更多网络上的新帐户生成安全、复杂的密码，这些密码很容易保存在浏览器中；\n您可以在主菜单的“登录”和“密码”下轻松访问和查看保存的密码。如果你的设备碰巧在你的家人或室友之间共享，最新的更新有助于防止你不经意地偷偷窥探。如果您没有为Firefox设置主密码，Windows和MacOS现在需要先登录到您的操作系统帐户，然后才能显示您保存的密码。\n画中画允许您进行多任务处理，无论您在计算机上做什么、跨不同的应用程序，甚至是跨工作空间，小视频窗口都会随之而来。现在，当您准备好将焦点放在视频上时，双击可以使小窗口进入全屏。再次双击可再次减小大小。\nFirefox现在支持Audio Worklet，这将允许更复杂的音频处理，如虚拟现实和网络游戏；并且正在被你喜欢的一些软件程序采用。\n有了这个改变，你现在可以加入Firefox上的Zoom通话，而不需要任何额外的下载。\nWebRender继续推出更多适用于Windows用户的Firefox，目前在现代Intel笔记本电脑上默认可用，小屏幕(&lt；=1920x1200)用于改进图形渲染。", "note_en": "With today’s release, Firefox strengthens protections for your online account logins and passwords, with innovative approaches to managing your accounts during this critical time:\n If one of your accounts is involved in a website breach and you&#39;ve used the same password on other websites, you will now be  prompted to update your password. A key icon identifies which accounts use that vulnerable password.\n Automatically  generate secure, complex passwords for new accounts across more of the web that are easily saved right in the browser;\n You have been able to access and see your saved passwords under Logins and Passwords easily under the main menu. If your device happens to be shared among your family or roommates, the latest update helps to prevent casual snooping over your shoulder. If you don’t have a  master password set up for Firefox, Windows and macOS now requires a  login to your operating system account before showing your saved passwords.\n  Picture-in-Picture allows you to multitask, the small video window following along no matter what you are doing on your computer, across different applications and even workspaces. Now, when you are ready to focus on the video, a double click can take the small window into full screen. Double click again to reduce the size again.\n  Firefox now supports Audio Worklets that will allow more complex audio processing like VR and gaming on the web; and is being adopted by some of your favorite software programs.\n With this change, you can now join Zoom calls on Firefox without the need for any additional downloads.\n  WebRender continues its roll out to  more Firefox for Windows users, now available by default on modern Intel laptops with a small screen (&lt;= 1920x1200) for improved graphics rendering.", "posttime": "2020-05-06 01:17:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "firefox,火狐,现在", "title": "火狐76", "title_en": "Firefox 76", "transed": 1, "url": "https://www.mozilla.org/en-US/firefox/76.0/releasenotes/", "via": "", "real_tags": ["firefox", "火狐", "现在"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000788, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "到现在为止还好。现在，如何解释数字通常用公式来解释：这通常是我翻转表的地方。也许我对数学符号过敏，但当我读到这篇文章时，我的大脑里就是有什么东西没有灵光一闪。感觉像是在学画猫头鹰。\n虽然这种解释浮点的方式是正确的，但通常会让我们中的一些人完全不知所措。我指责这个可怕的符号让大批程序员灰心丧气，把他们吓到再也不回头去理解浮点的实际工作原理的地步。幸运的是，有一种不同的方式来解释它。不是指数，而是两个整数的两个连续幂之间的窗口。考虑窗口内偏移量，而不是尾数。该窗口告诉您数字将在哪两个连续的2次幂范围内：[0.5，1]、[1，2]、[2，4]、[4，8]等等(最高可达[$2^{127}$，$2^{128}$]。偏移量将窗口划分为$2^{23}=8388608$存储桶。使用窗口和偏移量，您可以近似计算一个数字。窗户是一种很好的防止溢出的装置。一旦您在一个窗口中达到最大值(例如[2，4])，您就可以将其浮动并表示下一个窗口(例如[4，8])中的数字。因为窗口变得两倍大，所以它只需要一点精度。下图说明了数字6.1将如何编码。窗口必须从4开始，跨度到2的下一个幂8。偏移量大约是窗口的一半。\n当窗口覆盖范围较大时，精度会损失多少？让我们以窗口[1，2]为例，其中8388608个偏移量覆盖范围1，其精度为$\\frac{(2-1)}{8388608}=0.00000011920929$。在窗口[2048，4096]中，8388608个偏移量覆盖$(4096-2048)=2048$的范围，这给出了精度$\\FRAC{(4096-2048)}{8388608}=0.0002$。\n让我们举另一个例子，详细计算我们都很熟悉的一个数字的浮点表示：3.14。数字3.14是正的$\\right tarrow S=0$。数字3.14介于2和4的幂之间，因此浮动窗口必须从$2^1$$\\right tarrow E=128$开始(请参阅公式，其中窗口是$2^{(E-127)}$)。最后，有$2^{23}$偏移量可用于表示3.14在区间[2-4]内的位置。在使偏移量$M=2^{23}*0.57=4781507$的区间内，它位于$\\frac{3.14-2}{4-2}=0.57$。\n其二进制翻译为：因此，值3.14近似为3.1400001049041748046875。用难看的公式对应的值：最后是用窗口和偏移量表示的图形：希望对您有帮助：)！既然浮点单位速度如此之慢，为什么C语言以FLOAT和DOUBLE类型结束呢？毕竟，用于发明语言(PDP-11)的机器没有浮点单元！制造商(DEC)曾向丹尼斯·里奇和肯·汤普森承诺，下一款将会有一款。作为天文学爱好者，他们决定在他们的语言中加入这两种类型。琐事：1991年真正想要硬件浮点运算单元的人可以买一个。当时唯一可能想要一台的人可能是科学家(根据英特尔对市场的理解)。它们在市场上被称为数学协处理器。性能一般，价格惊人(1993年的200美元相当于2016年的350美元)。因此，销售表现平平。\n*", "note_en": "So far, so good. Now, how numbers are interpreted is usually explained with the formula:       This is usually where I flip the table. Maybe I am allergic to mathematic notation but something just doesn&#39;t click in my brain when I read this. It feels like learningto  draw a owl.\n     Although correct, this way of explaining floating point usually leaves some of us completelyclueless. I blame this dreadful notation for discouraging legions of programmers,scaring them to the point where they never looked back to understand how floating pointactually works.   Fortunately, there is a different way to explain it. Instead of Exponent, thinkof a Window between two consecutive power of two integers. Instead of a Mantissa, thinkof an Offset within that window.       The window tells within which two consecutive power-of-two the number will be: [0.5,1], [1,2], [2,4], [4,8] and so on (up to [$2^{127}$,$2^{128}$]. The offset divides the window in $ 2^{23} = 8388608 $ buckets. With the window and the offset you can approximate a number. The window is an excellent mechanism to protect from overflowing. Once you have reached the maximum in a window (e.g [2,4]), you can &#34;float&#34; it right and represent the number within the next window (e.g [4,8]). It only costs a little bit of precision since the window becomes twice as large.  The next figure illustrates how the number 6.1 would be encoded. The window must start at 4 and span to next power of two, 8. The offset is about half way down the window.\n    How much precision is lost when the window covers a wider range? Let&#39;s take an example with window [1,2] where the 8388608 offsets cover a range of 1 which gives a precision of $ \\frac{(2-1)}{8388608}=0.00000011920929$. In the window [2048,4096] the 8388608 offsets cover a range of $(4096-2048) = 2048$ which gives a precision $ \\frac{(4096-2048)}{8388608}=0.0002$.\n    Let&#39;s take an other example with the detailed calculations of the floating point representation of a number we all know well: 3.14.  The number 3.14 is positive $\\rightarrow S=0$.  The number 3.14 is between the power of two 2 and 4 so the floating window must start at $2^1$ $\\rightarrow E=128$ (see formula where window is $2^{(E-127)}$).  Finally there are $2^{23}$ offsets available to express where 3.14 falls within the interval [2-4]. It is at $\\frac{3.14 -2 }{4 - 2} = 0.57$ within the interval which makes the offset $ M = 2^{23}*0.57 = 4781507$\n Which in binary translates to:  The value 3.14 is therefore approximated to 3.1400001049041748046875. The corresponding value with the ugly formula:    And finally the graphic representation with window and offset:         I hope that helped :) !     Since floating point units were so slow, why did the C language end up with  float and  double types ? After all, the machine used to invent the language (PDP-11) did not have a floating point unit! The manufacturer (DEC) had promised to Dennis Ritchie and Ken Thompson the next model would have one. Being astronomy enthusiasts they decided to add those two types to their language.    Trivia: People who really wanted a hardware floating point unit in 1991 could buy one. The only people who could possibly want one back then would have been scientists (as per Intel understanding of the market). They were marketed as &#34;Math CoProcessor&#34;. Performance were average and price was outrageous (200 USD in 1993 equivalent to 350 USD in 2016.). As a result, sales were mediocre.\n       *", "posttime": "2020-05-06 01:06:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "解释,point,浮点,window", "title": "直观地解释浮点", "title_en": "Floating Point Visually Explained", "transed": 1, "url": "http://fabiensanglard.net/floating_point_visually_explained/index.html", "via": "", "real_tags": ["解释", "point", "浮点", "window"]}, {"category": "", "categoryclass": "", "imagename": "39ddde4c274d251badf844f3a2b613c2.png", "infoid": 1000787, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们已经开发了一条分析管道，以便于实时跟踪SARS-CoV-2中的突变，最初专注于Spike(S)蛋白，因为它介导人类细胞的感染，是大多数疫苗策略和基于抗体的治疗的目标。到目前为止，我们已经在Spike中鉴定出14个正在积累的突变。突变在更广泛的系统发育背景下、地理上和随着时间的推移被考虑，以提供一个早期预警系统，以揭示可能在传播或抵抗干预方面具有选择性优势的突变。每一个基因都被评估为正选择的证据，并通过结构建模来探索突变的含义。突变Spike D614G令人迫切关注；它于2月初开始在欧洲传播，当它被引入新的地区时，它迅速成为主导形式。此外，我们还提供了局部流行菌株之间重组的证据，这表明存在多个菌株感染。这些发现对SARS-CoV-2的传播、发病机制和免疫干预具有重要意义。\n↵谢菲尔德冠状病毒基因组组的#名成员：阿德里安·安格亚尔、丽贝卡·L·布朗、劳拉·卡里莱罗、卢克·R·格林、丹妮尔·C·格罗夫斯、凯蒂·J·约翰逊、亚历山大·J·基利、本杰明·B·林赛、保罗·J·帕森斯、穆罕默德·拉扎、莎拉·罗兰-琼斯、雷切尔·M·塔克、丹尼斯·王、马修·D·怀尔斯。", "note_en": "We have developed an analysis pipeline to facilitate real-time mutation tracking in SARS-CoV-2, focusing initially on the Spike (S) protein because it mediates infection of human cells and is the target of most vaccine strategies and antibody-based therapeutics. To date we have identified fourteen mutations in Spike that are accumulating. Mutations are considered in a broader phylogenetic context, geographically, and over time, to provide an early warning system to reveal mutations that may confer selective advantages in transmission or resistance to interventions. Each one is evaluated for evidence of positive selection, and the implications of the mutation are explored through structural modeling. The mutation Spike D614G is of urgent concern; it began spreading in Europe in early February, and when introduced to new regions it rapidly becomes the dominant form. Also, we present evidence of recombination between locally circulating strains, indicative of multiple strain infections. These finding have important implications for SARS-CoV-2 transmission, pathogenesis and immune interventions.\n   ↵ # Members of Sheffield COVID-19 Genomics Group: Adrienne Angyal, Rebecca L. Brown, Laura Carrilero, Luke R. Green, Danielle C. Groves, Katie J Johnson, Alexander J Keeley, Benjamin B Lindsey, Paul J Parsons, Mohammad Raza, Sarah Rowland-Jones, Rachel M. Tucker, Dennis Wang, Matthew D. Wyles", "posttime": "2020-05-06 01:05:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,cov,transmissible,突变,spike", "title": "一种传播性更强的SARS-CoV-2病毒的出现", "title_en": "Emergence of a more transmissible form of SARS-CoV-2", "transed": 1, "url": "https://www.biorxiv.org/content/10.1101/2020.04.29.069054v1", "via": "", "real_tags": ["病毒", "cov", "突变", "spike"]}, {"category": "", "categoryclass": "", "imagename": "ec4a7ac484cb7478d106dfebd01eb16a.jpg", "infoid": 1000786, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "了解如何使用Yahoo_FIN包使用Python下载基本面数据，包括市盈率和市盈率、股本回报率等。", "note_en": "Learn how to download fundamentals data with Python using the yahoo_fin package, including P/E and P/S ratios, return on equity, and more.", "posttime": "2020-05-06 00:42:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,fundamentals,download", "title": "如何使用Python获取股票基本面数据", "title_en": "How to get stock fundamentals data with Python", "transed": 1, "url": "http://theautomatic.net/2020/05/05/how-to-download-fundamentals-data-with-python/", "via": "", "real_tags": ["python", "download"]}, {"category": "", "categoryclass": "", "imagename": "ac38074248627e19bb32e7e8212ecd5a.jpg", "infoid": 1000785, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚州库比蒂诺-苹果公司(Apple)今天宣布，从6月22日开始，它将在苹果开发者应用程序和苹果开发者网站上举办一年一度的全球开发者大会(Worldwide Developers Conference)，对所有开发者免费开放。该公司还宣布了SWIFT学生挑战赛，学生开发人员可以通过创建自己的SWIFT游乐场来展示他们对编程的热爱。现在，WWDC20已经进入第31个年头，全球数百万富有创意和创新的开发人员将有机会早日接触iOS、iPadOS、MacOS、TVOS和WatchOS的未来，并向苹果工程师学习，因为他们正在努力构建丰富全球苹果客户生活的应用程序体验。\n苹果负责全球市场营销的高级副总裁菲尔·席勒(Phil Schiller)表示：“WWDC20将是我们迄今规模最大的一次，它将以前所未有的方式将我们超过2300万的全球开发者社区聚集在一起，在6月的一周时间里了解苹果平台的未来，”苹果负责全球营销的高级副总裁菲尔·席勒(Phil Schiller)说。我们迫不及待地想在6月份与全球开发者社区在线会面，与他们分享我们一直在开发的所有新工具，以帮助他们创建更令人难以置信的应用程序和服务。随着我们越来越接近这一激动人心的活动，我们期待着与大家分享有关WWDC20的更多细节。“。\n苹果负责软件工程的高级副总裁克雷格·费德里吉(Craig Federighi)说：“学生是苹果开发者社区不可或缺的一部分，去年WWDC吸引了来自37个不同国家的350多名学生开发者参加。”在我们期待WWDC20的同时，虽然我们今年的聚会将是虚拟的，但我们想要表彰和庆祝我们来自世界各地的年轻开发人员的创造性贡献。我们迫不及待地想看到这位下一代创新思想家通过斯威夫特学生挑战赛将他们的想法变成现实。“。\nSWIFT游乐场是一款适用于iPad和Mac的革命性应用程序，它使学习SWIFT编程语言变得互动和有趣。现在到晚上11点59分。PDT时间5月17日，来自世界各地的学生开发人员可以通过在SWIFT操场创建可在3分钟内体验的互动场景，提交SWIFT学生挑战赛。获奖者将获得一件独家WWDC20夹克和别针套装。欲获知更多信息，请访问网站：developer.apple.com/wwdc20/swift-student-challenge.。\n鼓励开发人员下载Apple Developer应用程序，在那里将在6月份共享其他WWDC20计划信息-包括主旨和平台国情咨文细节、会议和实验室时间表等。信息还将在苹果开发者网站和电子邮件上提供。\nApp Store目前在175个国家和地区，是世界上最安全、最具活力的应用程序市场，每周有超过5亿人访问。它是用户发现新应用程序的最佳场所，允许各种规模的开发者将他们的应用程序分发给世界各地的客户。App Store为开发者提供了许多建立业务的方式，自2008年推出以来，开发者一直在创建影响文化和改变生活的创新应用程序。\n苹果在1984年推出了麦金塔，给个人技术带来了革命性的变化。今天，苹果凭借iPhone、iPad、Mac、Apple Watch和Apple TV引领世界创新。苹果的五个软件平台-iOS、iPadOS、MacOS、WatchOS和TVOS-在所有苹果设备上提供无缝体验，并为人们提供突破性的服务，包括App Store、Apple Music、Apple Pay和iCloud。苹果公司的10万多名员工致力于制造地球上最好的产品，并致力于让世界变得比我们发现的更好。", "note_en": "Cupertino, California — Apple today announced it will host its annual Worldwide Developers Conference virtually, beginning June 22, in the  Apple Developer app and on the  Apple Developer website for free for all developers. The company also announced the Swift Student Challenge, an opportunity for student developers to showcase their love of coding by creating their own Swift playground. Now in its 31st year, WWDC20 will be an opportunity for millions of creative and innovative developers around the world to get early access to the future of iOS, iPadOS, macOS, tvOS, and watchOS, and to learn from Apple engineers as they work to build app experiences that enrich the lives of Apple customers around the globe.\n  “WWDC20 will be our biggest yet, bringing together our global developer community of more than 23 million in an unprecedented way for a week in June to learn about the future of Apple platforms,” said Phil Schiller, Apple’s senior vice president of Worldwide Marketing. “We can’t wait to meet online in June with the global developer community and share with them all of the new tools we’ve been working on to help them create even more incredible apps and services. We look forward to sharing more details about WWDC20 with everyone as we get closer to this exciting event.”\n  “Students are an integral part of the Apple developer community, and last year WWDC saw attendance from more than 350 student developers spanning 37 different countries,” said Craig Federighi, Apple’s senior vice president of Software Engineering. “As we look forward to WWDC20, although our gathering will be virtual this year, we want to recognize and celebrate the creative contributions of our young developers from around the world. We can’t wait to see this next generation of innovative thinkers turn their ideas into a reality through the Swift Student Challenge.”\n  Swift Playgrounds is a revolutionary app for iPad and Mac that makes learning the Swift programming language interactive and fun. Now through 11:59 p.m. PDT on May 17, student developers from all over the world can submit to the Swift Student Challenge by creating an interactive scene in a Swift playground that can be experienced within three minutes. Winners will receive an exclusive WWDC20 jacket and pin set. For more information, visit  developer.apple.com/wwdc20/swift-student-challenge.\n  Developers are encouraged to download the Apple Developer app where additional WWDC20 program information — including keynote and Platforms State of the Union details, session and lab schedules, and more — will be shared in June. Information will also be made available on the Apple Developer website and by email.\n  The App Store, now in 175 countries and regions, is the world’s safest and most vibrant app marketplace, with more than half a billion people visiting each week. It is the best place for users to discover new apps and allows developers of all sizes to distribute their apps to customers around the world. The App Store features many ways for developers to build their businesses, and since its launch in 2008, developers have been creating innovative apps that influence culture and change lives.\n  Apple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, Apple Watch, and Apple TV. Apple’s five software platforms — iOS, iPadOS, macOS, watchOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, and iCloud. Apple’s more than 100,000 employees are dedicated to making the best products on earth, and to leaving the world better than we found it.", "posttime": "2020-05-06 00:30:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,app,开发,apple,全球", "title": "苹果将于6月22日开始主办虚拟全球开发者大会", "title_en": "Apple to host virtual Worldwide Developers Conference beginning June 22", "transed": 1, "url": "https://www.apple.com/newsroom/2020/05/apple-to-host-virtual-worldwide-developers-conference-beginning-june-22/", "via": "", "real_tags": ["苹果", "app", "开发", "apple", "全球"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000784, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最近花了很多时间编写茴香，并为它的编译器做贡献。由于它是一种编译Tolua的语言，这也意味着需要花费大量时间来了解Lua。本文将集中讨论Lua(不过我会在脚注中不时提到茴香)。\nLua是一种整洁、优雅、相对简单的语言。我发现它特别值得注意的是它可以嵌入到其他程序中；能够承载多种不同风格的编程；以及它的一个实现LuaJIT的出色性能。在很多方面，它给人的感觉更像是一个更优雅、更有节制的JavaScript--它支持尾部调用消除[1]和协程，它没有令人困惑的var/let区分(尽管它在Lua5.4之前没有像const这样的特性)，并且它没有将类语法优先于其他风格的编程(面向对象的编程可以在Lua中使用元表进行，但是没有像在JS中那样给出特殊的语法)。\n这就是说，它有一些无疑是古怪的方面-数组和字典被统一到表中，其整数索引从1开始；标准库非常小，这是对它的适用性的认可；它像JavaScript一样，使得变量在默认情况下是全局的，只有在您要求的时候才是局部的，这是一个巨大的错误。奇怪的是，它还支持一种非常不常见的语言特性：多个返回值(为简洁起见，我们将其称为“倍数”)。这是我们今天要详细讨论的最后一个话题。\n由于Lua是一种动态语言(例如，与Go相反)，因此以一种相当奇怪的方式实现了多个urn。这并没有像我希望的那样在Lua的文档中进行详细的探讨，所以我想提供一个一站式资源，解释我所能想到的关于该语言这一特殊部分的所有内容。\n剧透：不幸的是，在您关心的代码中使用乘数将会变得平淡无奇。它们使用起来很笨拙，有很多问题，会带来维护风险，而且(据我所知)它们的性能并不比它们的主要替代产品--表好多少。这不是一篇非常有用的文章，除非您需要了解Lua行为的细节。\n在Lua中有三种主要方式来表示多值。其中每一个都有自己独特的用途。下面的每个代码片段都会生成相同的多值：\n多值文字：1、2、3。(请注意，这不包括像{1，2，3}这样的可编辑文字)。\n函数中的vararg，.：局部函数x(.)。回来..。结束x(1，2，3)\n本地函数Two_Values()return&#34；First&#34；，&#34；Second&#34；End local tab={Two_Values()}print(tab[1]，tab[2])--print&#34；first Second&#34；\n局部函数multival_first(x，.)。RETURN x END PRINT(MULVAL_FIRST(1，2，3))--PRINTS&#34；1&#34；LOCAL函数MULVAL_REST(x，.)。回来..。End Print(multival_rest(1，2，3))--打印&#34；2 3&#34；Print(SELECT(2，1，2，3))--打印&#34；2 3&#34；与最后一行相同。\n为了从多值的末尾获得值，我们有两个选项。第一个是递归：\n局部函数INCRYMER_EACH_VALUE(FIRST，.)。如果FIRST，则返回FIRST+1，INCREMER_EACH_VALUE(.)。End End Print(INCREMER_EACH_VALUE(1，2，3))--打印&#34；2 3 4&#34；\n第二种方法是将多个值打包到一个表中。有两种方法可以做到这一点，下面演示了这两种方法：\n--1.可以将Multival直接打包到表文本函数pack_multival(.)。return{.}end--Lua对表的默认打印仅显示标识；我们将改为--打印长度。print(#pack_multival(1，2，3))--prints&#34；3&#34；--2.您可以使用table.pack，它内置于Lua 5.2和更高版本的local tab=table.pack(1，2，3)print(#tab)--prints&#34；3&#34；--table.pack还会在它返回的表上设置&#34；n&#34；字段。这比使用#tab更有效，后者在表中迭代。打印(选项卡。n)--打印&#34；3&#34；\n当您开始使用多个数时，它们可能看起来非常简单。只要您正在使用具有固定长度的List或者可以通过遍历列表的头部和尾部来表示的内容，那么使用多值似乎应该是不错的和可预测的。\n如果您尝试使用多值包，您可能会遇到的第一个问题来自于期望它们以与其余Luados相同的方式工作。简而言之，Lua的局部变量使用所谓的词典作用域。这意味着变量定义的作用域是您在源代码文件中看到的包含变量定义的代码块。其他函数以什么顺序调用，或者它们是否被调用都无关紧要-局部变量的定义只需查看代码结构即可确定。这与动态作用域相反，在动态作用域中，在给定点定义的变量依赖于程序本身的运行时。Lua的全局变量有效地使用了动态作用域。\n如上所述，引用多值只有三种方式：为其返回值调用函数、按字面意思插入用逗号分隔的多值或使用vararg符号.。作为函数参数。我们感兴趣的是最后一个案子。\n当你使用..。在函数签名中，必须放在参数列表的末尾。(这就是阻止您-至少在语法上-访问.的末尾的原因。而无需将整个内容赋给单个变量、递归遍历它或将其打包到表中。)。\n你也不能把整个东西赋给一个变量，因为赋值.。对于一个变量意味着解包多值并将第一个值赋给变量-如果指定了多个值，则将其赋给多个值。例如：\n--将vararg赋给单个变量会将该变量--赋给vararg的_first value_。局部函数try_to_assign_vararg(.)。本地x=.。返回x结束打印(try_to_assign_vararg(1，2，3))--打印&#34；1&#34；\n然而，关于vararg还有一条额外的规则，这与Lua的其余部分的行为非常不同。您只能在定义vararg的函数中使用vararg。例如，这样可以防止您将vararg保存到闭包中：\n无法运行，并出现以下错误：无法在靠近&#39；.&#39；的vararg函数外部使用&#39；.&#39；。这意味着，当你可以使用..。在两个嵌套函数中，每个函数.。只能引用当前运行的函数的varargof。你不能在闭包中捕获.来持久化它。实际上，..。不是字典作用域的，而是一个动态作用域的变量，具有某些额外的规则，比如不能重新赋值，并且不能在定义它的函数外部使用。\n另一种说法是，Lua的乘数是“二等”值。您可能熟悉有第二类函数的语言，第二类函数不能赋值给变量，也不能作为参数传递给函数。这与此类似，但值得注意的例外是，我们可以将vararg传递给另一个函数。我们不能将其保存在变量中，不能将其保存在闭包中，也不能以特定方式对其进行操作。\n将乘数传递给函数并将其打包到表中非常简单，但是关于这一点有一个我们尚未克服的主要问题。请看以下示例：\n局部函数Returns_Three_Values()return 1，2，3 End Print(Returns_Three_Values())--Prints&#34；1 2 3&#34；print(#{Returns_Three_Values()})--Prints&#34；3&#34；Print(Returns_Three_Values()，4，5)--Prints&#34；1 4 5&#34；Print(#{Returns_Three_Values()，4 5})--Prints&#34；3和#34；\n正如第二对打印表达式所演示的那样，如果函数调用是多值中的最后一个，则它只能将多个值返回到多值中。在多变量中使用任何其他值(即使为空)调用函数后，将在第一项截断其返回值。\nLua较好的属性之一是在表中无法区分设置为nil的键和不存在的键。例如，在Javascript中，您既可以使用obj.x=unfinded将属性设置为unfinded，也可以使用delete obj.x将其从对象中实际删除。(还有obj.x=null，但我们暂时忽略它。)在Lua中，只有tab.x=nil，无法区分设置为nil的属性和从未设置的属性。\nlocal y={nil，nil，nil}print(#y)--在表格末尾打印&#34；0&#34；-nils与本地函数multival_length(.)无关。选择(&#34；#&#34；，.)。结束打印(multival_length(table.unpack(Y)--打印&#34；0&#34；print(multival_length(nil，nil，nil))--打印&#34；3&#34；。什么鬼东西？\n如本例所示，倍增操作会将该良好属性抛出窗口。我只想说清楚：\n在Lua中，multival_length(nil，nil)和multival_length()有一个区别。这种区别是通过SELECT(&#34；#&#34；，.)进行的。\n与返回零值的函数(而不是nil)结合使用时，这会变得更加令人困惑：\nPrint(SELECT(&#34；#&#34；，Print(&#34；a&#34；)，Print(&#34；b&#34；)，Print(&#34；c&#34；)--首先将&#34；a&#34；、&#34；b&#34；和&#34；c&#34；打印到各自的行上，然后打印&#34；2&#34；。等等，什么？\n正如您所预期的那样，返回零值的函数会创建一个空多值。如果您在末尾调用它，它也不会在多项式的末尾添加任何东西。但是，如果对零返回值函数的调用出现在多值结束之前，则会导致在多值中插入nil来代替其零返回值。因此，Lua没有将由所有三个print调用组成的multival折叠成单个零长度的multival，而是折叠了最后一个print调用，但将另外两个调用变为空。这并不适用于表，因为与乘数不同的是，表中的NILS实际上等同于缺少值。\n乍一看，这一切似乎都不属于Lua。不带SELECT(&#34；#&#34；，.)。形式，则无法从多值本身的末尾判断多值末尾为零。然而，这使得某些抽象更容易创建。\n一种值得注意的情况是选择(&#34；#&#34；，.)。在包装返回乘值的函数时变得特别有用。选择(&#34；#&#34；，.)。让您轻松判断是否可以简单地保存函数的第一个返回值，或者是否需要创建atable来保存所有值。\n当第一次查看Lua中的乘数时，决心以某种方式使用它们的程序员可能首先倾向于将它们与尾递归结合起来，以灵活地表示不同的函数。例如，我们可以实现如下范围：\n局部函数range1(acc，n)如果n&lt；1，则返回ELELSE如果n==1，则返回acc，否则返回acc，range1(acc+1，n-1)end end local function range(N)如果n&lt；1，则error(&#34；n必须为&gt；=1&#34；)end return range1(1，n)end print(range(3))--prints&#34；1 23&#34；print(#{range(10)})--打印&#34；10&#34；\n这个很管用！当我们想要一个长度为n的多值时，我们可以调用range(N)，当我们想要等效表时，可以用像{range(N)}这样的大括号将它括起来。这应该可以让我们避免在不需要的时候分配额外的表。由于Lua具有尾部调用消除功能，因此对自身进行的递归调用范围1永远不会打乱堆栈。对吗？\n事实证明，多个人打破了尾部呼叫消除。如果您重新返回多个值，Lua需要收集所有这些值，然后才能实际开始返回它们。这意味着它不能丢弃递归函数的堆栈框架。这与在range1内返回{range1(acc，n)}时发生的情况非常相似。那个案子显然不是尾巴。正是乘数的特殊语法使这一点令人困惑，因为它看起来并不像是被任何东西“包围”的人造尾部调用。[2]。\n为了避免堆栈溢出，正确地递归函数，我们可以使用下表来实现Range：\n本地函数范围1(tab，acc，n)如果n&lt；1，则返回tab否则tab[acc]=acc返回范围1(tab，acc+1，n-1)END END本地函数范围(N)如果n&lt；1，则错误(&#34；n必须是&&gt;；=1&#34；)END返回范围1({}，1，n)END PRINT(#RANGE(1000x1000))--PRINTS&#34；1000000&#34；\n它可能不那么优雅，混合了递归和突变，但是它的运行时特性要好得多。\n递归到太多可能会导致堆栈失效，这是有道理的。不太直观的是，即使在没有递归的情况下，乘法运算的大小也有一个上限。请考虑使用我们上面定义的范围函数：\n太棒了！现在，让我们试着将其解包成一个多重数。不涉及递归，所以这应该可以很好地工作，对吗？\n事实证明，乘法只是对它们可以包含的值的数量有一个上限。没有办法解决这个问题--如果您需要处理一个项目列表而不用担心它有多大，请使用atable，而不是multival。\nprint((function()return 1，2，3，4，5，6，7，8，9，10，11，12，13，14，15，16，17，18，19，20，21，22，23，24，25，26，27，28，29，30，31，32，33，34，35，36，37，38，39，40，41，42、43、44、45、46、47、48、49、50、51、52、53、54、55、56、57、58、59、60、61、62、63、64、65、66、67、68、69、70、71、72、73、74、75、76、77、78、79、80、81、82、83、84、85。86、87、88、89、90、91、92、93、94、95、96、97、98、99、100、101、102、103、104、105、106、107、108、109、110、111、112、113、114、115、116、117、118、119、120、121、122、123、124、125、126、127、128、129。130、131、132、133、134、135、136、137、138、139、140、141、142、143、144、145、146、147、148、149、150、151、152、153、154、155、156、157、158、159、160、161、162、163、164、165、166、167、168、169、170、171、172、173。174、175、176、177、178、179、180、181、182、183、184、185、186、187、188、189、190、191、192、193、194、195、196、197、198、199、200、201、202、203、204、205、206、207、208、209、210、211、212、213、214、215、216、217。218、219、220、221、222、223、224、225、226、227、228、229、230、231、232、233、234、235、236、237、238、239、240、241、242、243、244、245、246、247、248、249、250、251、252、253、254、255())-投掷&#34；函数或表达式需要太多的寄存器&#34；错误打印(1，2，3，4，5，6，7，8，9，10，11，12，13，14，15，16，17，18，19，20，21，22，23，24，25，26，27，28，29，30，31，32，33，34，35，36，37，38，39，40，41，42，43，44、45、46、47、48、49、50、51、52、53、54、55、56、57、58、59、60、61、62、63、64、65、66、67、68、69、70、71、72、73、74、75、76、77、78、79、80、81、82、83、84、85、86、87。88、89、90、91、92、93、94、95、96、97、98、99、100、101、102、103、104、105、106、107、108、109、110、111、112、113、114、115、116、117、118、119、120、121、122、123、124、125、126、127、128、129、130、131。132、133、134、135、136、137、138、139、140、141、142、143、144、145、146、147、148、149、150、151、152、153、154、155、156、157、158、159、160、161、162、163、164、165、166、167、168、169、170、171、172、173、174、175。176、177、178、179、180、181、182、183、184、185、186、187、188、189、190、191、192、193、194、195、196、197、198、199、200、201、202、203、204、205、206、207、208、209、210、211、212、213、214、215、216、217、218、219。220、221、222、223、224、225、226、227、228、229、230、231、232、233、234、235、236、237、238、239、240、241、242、243、244、245、246、247、248、249、250、251、252、253、254、255)--抛出&#34；函数或表达式需要太多寄存器&#34；错误。\n但是，对表字面值没有限制，这强化了这样一个事实，即表字面值的内容不是多位数，尽管它们在外观上很相似：\n所有这些多值怪癖的不同例子表明，乘法只是另一种数据结构。(我发现这种情况最好的原因是，在多值内递归时，尾部调用消除不起作用，就像它一样\n不能将乘数赋给变量。它们只能作为文字、函数调用表达式或vararg.引用。\nvararg不能在创建它的函数外部使用(包括在该函数中创建的闭包内)。\n在结束之前将乘数插入到另一个多值中时，会在第一个值处截断乘数。\n与表格不同，乘数的内置长度与多值内NIL的排列无关。可以使用SELECT(&#34；#&#34；，.)搜索此长度。\n当多值在结束前包含对零返回值函数的调用时，函数的返回值将插入nil。\n当函数在Multival内进行递归调用时，不会应用尾部调用消除。因此，在业余时间内递归太多次会使堆栈失效。\n尝试使用过多参数调用函数或从函数返回将导致错误。这一限制远远低于前面提到的解包表格的限制，仅略低于255个项目。\n最后，关于多值，还有一个令我难以置信的主观问题，那就是vararg使用的语法。在我看来，事实上…是有效的Lua使得在示例代码中插入易于理解的占位符变得不必要地困难。\n虽然乘数仍然是Lua的一个奇怪而锋利的角落，但我希望多亏了这篇文章，他们会更容易理解。虽然它们很少是特定问题的最佳解决方案，但对于Lua用户来说，了解它们的优点和局限性仍然是有帮助的，即使这只是为了证明避免它们是合理的。\n也称为尾部呼叫优化。使用InSafari的JavaScriptCore有适当的Tail CallSupport，但大多数JS开发人员无法利用这一点，因为它在大多数平台上的流行浏览器中不可用。↩。\n在茴香中，这种句法混乱会变得更糟！在那里，多个数没有自己的特殊语法，而是用特殊的值表示。(值1 2 3)在Fennelis中与在Lua中的1、2、3相同。不幸的是，这使得进入此场景的递归函数看起来更像真正的尾递归函数。这是在Fennel中使用多个函数和递归时需要注意的问题！↩", "note_en": "I’ve been spending a lot of time lately writing  Fennel andcontributing to its compiler. Since it’s a language that compiles toLua, that also means spending a lot of time getting to know Lua. Thisarticle will be focused on Lua (though I’ll address Fennel from timeto time in the footnotes).\n Lua is a neat, elegant, and relatively simple language. I find itparticularly notable for its embeddability into other programs;capability of hosting many different styles of programming; and theexcellent performance of one of its implementations, LuaJIT. In many ways, it feels like a more elegant andrestrained JavaScript - it supports tail call elimination  [1] and coroutines, it doesn’t have the confusing  var/ letdistinction (though it lacked a feature like  const until Lua 5.4),and it doesn’t privilege class syntax over other styles of programming(object oriented programming can be done in Lua with metatables, butit’s not given special syntax like it is in JS).\n That said, it has aspects that are undoubtedly quirky - arrays anddictionaries are unified into &#34;tables&#34;, whose integer indices start at1; the standard library is unusually minimal, a nod to itsembeddability; it, like JavaScript, makes the immense error of makingvariables global by default and local only when you ask. Curiously, italso supports a quite uncommon language feature: multiple returnvalues (which we’ll call “multivals” for brevity’s sake). It is thislast subject that we’ll be unpacking more about today.\n Since Lua is a dynamic language (as opposed to, say, Go) multiplereturns are implemented in a rather odd way. This isn’t explored in asmuch detail as I’d like in Lua’s documentation, so I wanted to providea one-stop resource that explains everything I can think to write downabout this idiosyncratic part of the language.\n A spoiler: unfortunately, multivals will turn out to be somewhatunderwhelming for use in code you care about. They’re awkward to workwith, have numerous gotchas, are a maintenance hazard, and don’tperform notably better (that I know of) than their primaryalternative, tables. This is not a very  useful article, unless youhave a use for knowing minutiae about Lua’s behavior.\n   There are three primary ways to represent a multival in Lua. Each ofthese has their own distinct uses. Each of the following code snippetsproduces the same multival:\n A multival literal:  1, 2, 3. (Note that this does not includetable literals like  {1, 2, 3}).\n  The vararg,  ..., in a function:  local function x(...) return ... end x(1, 2, 3)\n  local  function  two_values ()  return  &#34;first&#34; ,  &#34;second&#34;  end local  tab  =  { two_values ()} print ( tab [ 1 ],  tab [ 2 ])  -- prints &#34;first second&#34;\n  local  function  multival_first ( x ,  ...)  return  x  end print ( multival_first ( 1 ,  2 ,  3 ))  -- prints &#34;1&#34; local  function  multival_rest ( x ,  ...)  return  ...  end print ( multival_rest ( 1 ,  2 ,  3 ))  -- prints &#34;2 3&#34; print ( select ( 2 ,  1 ,  2 ,  3 ))  -- prints &#34;2 3&#34;; identical to the last line\n In order to get values from the  end of a multival, we have twooptions. The first is recursion:\n local  function  increment_each_value ( first ,  ...)  if  first  then  return  first  +  1 ,  increment_each_value (...)  end end print ( increment_each_value ( 1 ,  2 ,  3 ))  -- prints &#34;2 3 4&#34;\n The second is packing the multival into a table. There are two ways todo this, both of which are demonstrated below:\n -- 1. You can pack a multival directly into a table literal local  function  pack_multival (...)  return  {...} end -- Lua&#39;s default printing for tables only shows identity; we&#39;ll just -- print the length instead. print ( # pack_multival ( 1 ,  2 ,  3 ))  -- prints &#34;3&#34; -- 2. You can use table.pack, which is built in to Lua 5.2 and later local  tab  =  table.pack ( 1 ,  2 ,  3 ) print ( # tab )  -- prints &#34;3&#34; -- table.pack also sets the &#34;n&#34; field on the table it returns. This is -- more efficient than using #tab, which iterates through the table. print ( tab . n )  -- prints &#34;3&#34;\n  When you start working with multivals, they might seem prettystraightforward. As long as you’re working on something that uses alist with fixed length or that can be expressed by iterating throughthe head and tail of a list, it seems like working with multivalsshould be nice and predictable.\n The first issue you’ll likely run into if you try to use multivalsheavily comes from expecting them to work the same way the rest of Luadoes. In short, Lua’s  local variables use what’s called  lexicalscope. This means that the scope of a variable definition is theblock of code that you see it contained in in your source codefile. It doesn’t matter what order other functions are called in, orwhether they’re called at all - the definitions of local variables canbe determined just by looking at the structure of the code. This is asopposed to  dynamic scope, where the variables defined at a givenpoint are dependent on the runtime of the program itself. Lua’s global variables effectively use dynamic scope.\n As discussed above, there’s only three ways to refer to a multival:calling a function for its return values, literally inserting multiplevalues separated by commas, or using the vararg symbol  ... as afunction argument. It’s this last case that we’re interested in.\n When you use  ... in the signature of a function, you must place itat the end of the argument list. (This is what prevents you -syntactically, at least - from accessing the end of  ... withouteither assigning the whole thing to individual variables, recursingthrough it, or packing it into a table.)\n You also can’t assign the whole thing to a variable, because assigninga  ... to a variable means unpacking the multival and assigning the first value to the variable - or multiple values, if that’sspecified. For example:\n -- Assigning the vararg to a single variable will assign that variable -- to the _first value_ of the vararg. local  function  try_to_assign_vararg (...)  local  x  =  ...  return  x end print ( try_to_assign_vararg ( 1 ,  2 ,  3 ))  -- prints &#34;1&#34;\n There’s one additional rule about the vararg, however, that’s veryunlike the behavior of the rest of Lua. You can only use a vararg within the function where it is defined. This prevents you from, forinstance, saving the vararg into a closure:\n  This fails to run with the following error:  cannot use &#39;...&#39; outside a vararg function near &#39;...&#39;. This means that, while you can use ... in two nested functions, each  ... can only refer to the varargof the function that’s currently running. You can’t capture  ...within a closure to persist it. Effectively,  ... is not lexicallyscoped, but rather a dynamically scoped variable with certain extrarules like not being reassignable and not being usable outside afunction that defined it.\n Another way to put this would be to say that Lua’s multivals are“second class” values. You might be familiar with languages that havesecond class functions, which can’t be assigned to variables or passedas a parameter to a functions. This is similar, with the notableexception that we  can pass the vararg to another function. We justcan’t save it in a variable, save it in a closure, or manipulate it incertain ways.\n  Passing multivals to functions and packing them into tables is prettystraightforward, but there’s one major gotcha about it we haven’t goneover yet. Take a look at the following example:\n local  function  returns_three_values ()  return  1 ,  2 ,  3 end print ( returns_three_values ())  -- prints &#34;1 2 3&#34; print ( # { returns_three_values ()})  -- prints &#34;3&#34; print ( returns_three_values (),  4 ,  5 )  -- prints &#34;1 4 5&#34; print ( # { returns_three_values (),  4  5 })  -- prints &#34;3&#34;\n As the second pair of  print expressions demonstrates, a functioncall can only return multiple values into a multival if it is the lastthing in the multival. Following a function call in a multival withany other value, even  nil, will cut off its return values at thefirst item.\n    One of Lua’s nicer properties is how a key set to  nil and anon-existent key are indistinguishable in a table. In Javascript, forinstance, you have both  obj.x = undefined to set a property to undefined and  delete obj.x to actually remove it from theobject. (There’s also  obj.x = null, but let’s ignore that for now.)In Lua, there’s just  tab.x = nil, and there’s no way to distinguishbetween a property that was set to  nil and a property that was neverset at all.\n  local  y  =  { nil , nil , nil } print ( # y )  -- prints &#34;0&#34; - nils at the end of a table don&#39;t matter local  function  multival_length (...)  select ( &#34;#&#34; ,  ...)  end print ( multival_length ( table.unpack ( y )))  -- prints &#34;0&#34; print ( multival_length ( nil ,  nil ,  nil ))  -- prints &#34;3&#34;. wtf?\n As this example demonstrates, multivals throw that nice property outthe window. Just to be clear:\n There is  one distinction between  multival_length(nil, nil) and multival_length() in Lua. That distinction is made by select(&#34;#&#34;, ...).\n This becomes even more confusing when combined with a function thatreturns  zero values, as opposed to  nil:\n print ( select ( &#34;#&#34; ,  print ( &#34;a&#34; ),  print ( &#34;b&#34; ),  print ( &#34;c&#34; )))  -- first prints each of &#34;a&#34;, &#34;b&#34;, and &#34;c&#34; on their own lines  -- next, prints &#34;2&#34;. wait, what?\n  As it turns out, a function that returns zero values creates an emptymultival, as you’d expect. It also doesn’t add anything to the end ofa multival if you call it at the end. However, if a call to azero-return-value function appears  before the end of a multival, itresults in a  nil being inserted into the multival in place of itszero return values. Thus, instead of collapsing the multival made upof all three of the  print calls into a single zero-length multival,Lua instead collapses the  last call to  print, but turns the othertwo calls into  nil. This all doesn’t apply to tables, because,unlike in multivals,  nils in tables are truly identical to absentvalues.\n At first, this all seems like something that doesn’t belong inLua. Without the  select(&#34;#&#34;, ...) form, there’d be no way of tellinga  nil at the end of a multival from the end of the multivalitself. However, this makes certain abstractions much easier tocreate.\n One notable situation where  select(&#34;#&#34;, ...) becomes particularlyuseful is when wrapping functions that return multiplevalues.  select(&#34;#&#34;, ...) lets you easily tell if you can simply savethe first return value from the function or if you need to create atable to save all the values.\n  When first looking at multivals in Lua, a programmer who’s determinedto use them somehow might first be inclined to combine them with tailrecursion to neatly express different functions. For instance, wecould implement  range as follows:\n local  function  range1 ( acc ,  n )  if  n  &lt;  1  then  return  elseif  n  ==  1  then  return  acc  else  return  acc ,  range1 ( acc + 1 ,  n - 1 )  end end local  function  range ( n )  if  n  &lt;  1  then  error ( &#34;n must be &gt;= 1&#34; )  end  return  range1 ( 1 ,  n ) end print ( range ( 3 ))  -- prints &#34;1 2 3&#34; print ( # { range ( 10 )})  -- prints &#34;10&#34;\n This works great! We can call  range(n) when we want a multival oflength  n, and surround it with braces like  {range(n)} when we wantthe equivalent table. This should let us avoid allocating extra tableswhen we don’t need them. And since Lua has tail call elimination, therecursive call  range1 makes to itself should never blow thestack. Right?\n   As it turns out, multivals break tail call elimination. If you’rereturning multiple values, Lua needs to collect all those valuesbefore it can actually begin to return them. This means that it can’tthrow away the stack frames of the recursing function. It’s verysimilar to what would happen if you returned  {range1(acc, n)} within range1. That case is clearly  not a tail call. It’s the particularsyntax of multivals that makes this confusing, since it doesn’t looklike the faux-tail-call is “surrounded” by anything.  [2]\n In order to avoid the stack overflow and properly recurse thefunction, we can implement  range with a table as follows:\n local  function  range1 ( tab ,  acc ,  n )  if  n  &lt;  1  then  return  tab  else  tab [ acc ]  =  acc  return  range1 ( tab ,  acc + 1 ,  n - 1 )  end end local  function  range ( n )  if  n  &lt;  1  then  error ( &#34;n must be &gt;= 1&#34; )  end  return  range1 ({},  1 ,  n ) end print ( # range ( 1000  *  1000 ))  -- prints &#34;1000000&#34;\n It’s perhaps less elegant, mixing recursion and mutation, but itsruntime characteristics are vastly better.\n  It makes sense that recursing to much could cause issues by blowingthe stack. What’s less intuitive is that multivals have a cap on theirsize even when you make them  without recursion. Consider this use ofthe  range function we defined above:\n  Great! Now, let’s try unpacking that into a multival. No recursion isinvolved, so this should work fine, right?\n  As it turns out, multivals simply have a cap on the number of valuesthey can contain. There’s no way to work around this - if you need tohandle a list of items without worrying about how big it is, use atable, not a multival.\n  print (( function ()  return  1 ,  2 ,  3 ,  4 ,  5 ,  6 ,  7 ,  8 ,  9 ,  10 ,  11 ,  12 ,  13 ,  14 ,  15 ,  16 ,  17 ,  18 ,  19 ,  20 ,  21 ,  22 ,  23 ,  24 ,  25 ,  26 ,  27 ,  28 ,  29 ,  30 ,  31 ,  32 ,  33 ,  34 ,  35 ,  36 ,  37 ,  38 ,  39 ,  40 ,  41 ,  42 ,  43 ,  44 ,  45 ,  46 ,  47 ,  48 ,  49 ,  50 ,  51 ,  52 ,  53 ,  54 ,  55 ,  56 ,  57 ,  58 ,  59 ,  60 ,  61 ,  62 ,  63 ,  64 ,  65 ,  66 ,  67 ,  68 ,  69 ,  70 ,  71 ,  72 ,  73 ,  74 ,  75 ,  76 ,  77 ,  78 ,  79 ,  80 ,  81 ,  82 ,  83 ,  84 ,  85 ,  86 ,  87 ,  88 ,  89 ,  90 ,  91 ,  92 ,  93 ,  94 ,  95 ,  96 ,  97 ,  98 ,  99 ,  100 ,  101 ,  102 ,  103 ,  104 ,  105 ,  106 ,  107 ,  108 ,  109 ,  110 ,  111 ,  112 ,  113 ,  114 ,  115 ,  116 ,  117 ,  118 ,  119 ,  120 ,  121 ,  122 ,  123 ,  124 ,  125 ,  126 ,  127 ,  128 ,  129 ,  130 ,  131 ,  132 ,  133 ,  134 ,  135 ,  136 ,  137 ,  138 ,  139 ,  140 ,  141 ,  142 ,  143 ,  144 ,  145 ,  146 ,  147 ,  148 ,  149 ,  150 ,  151 ,  152 ,  153 ,  154 ,  155 ,  156 ,  157 ,  158 ,  159 ,  160 ,  161 ,  162 ,  163 ,  164 ,  165 ,  166 ,  167 ,  168 ,  169 ,  170 ,  171 ,  172 ,  173 ,  174 ,  175 ,  176 ,  177 ,  178 ,  179 ,  180 ,  181 ,  182 ,  183 ,  184 ,  185 ,  186 ,  187 ,  188 ,  189 ,  190 ,  191 ,  192 ,  193 ,  194 ,  195 ,  196 ,  197 ,  198 ,  199 ,  200 ,  201 ,  202 ,  203 ,  204 ,  205 ,  206 ,  207 ,  208 ,  209 ,  210 ,  211 ,  212 ,  213 ,  214 ,  215 ,  216 ,  217 ,  218 ,  219 ,  220 ,  221 ,  222 ,  223 ,  224 ,  225 ,  226 ,  227 ,  228 ,  229 ,  230 ,  231 ,  232 ,  233 ,  234 ,  235 ,  236 ,  237 ,  238 ,  239 ,  240 ,  241 ,  242 ,  243 ,  244 ,  245 ,  246 ,  247 ,  248 ,  249 ,  250 ,  251 ,  252 ,  253 ,  254 ,  255  end )())  -- throws &#34;function or expression needs too many registers&#34; error print ( 1 ,  2 ,  3 ,  4 ,  5 ,  6 ,  7 ,  8 ,  9 ,  10 ,  11 ,  12 ,  13 ,  14 ,  15 ,  16 ,  17 ,  18 ,  19 ,  20 ,  21 ,  22 ,  23 ,  24 ,  25 ,  26 ,  27 ,  28 ,  29 ,  30 ,  31 ,  32 ,  33 ,  34 ,  35 ,  36 ,  37 ,  38 ,  39 ,  40 ,  41 ,  42 ,  43 ,  44 ,  45 ,  46 ,  47 ,  48 ,  49 ,  50 ,  51 ,  52 ,  53 ,  54 ,  55 ,  56 ,  57 ,  58 ,  59 ,  60 ,  61 ,  62 ,  63 ,  64 ,  65 ,  66 ,  67 ,  68 ,  69 ,  70 ,  71 ,  72 ,  73 ,  74 ,  75 ,  76 ,  77 ,  78 ,  79 ,  80 ,  81 ,  82 ,  83 ,  84 ,  85 ,  86 ,  87 ,  88 ,  89 ,  90 ,  91 ,  92 ,  93 ,  94 ,  95 ,  96 ,  97 ,  98 ,  99 ,  100 ,  101 ,  102 ,  103 ,  104 ,  105 ,  106 ,  107 ,  108 ,  109 ,  110 ,  111 ,  112 ,  113 ,  114 ,  115 ,  116 ,  117 ,  118 ,  119 ,  120 ,  121 ,  122 ,  123 ,  124 ,  125 ,  126 ,  127 ,  128 ,  129 ,  130 ,  131 ,  132 ,  133 ,  134 ,  135 ,  136 ,  137 ,  138 ,  139 ,  140 ,  141 ,  142 ,  143 ,  144 ,  145 ,  146 ,  147 ,  148 ,  149 ,  150 ,  151 ,  152 ,  153 ,  154 ,  155 ,  156 ,  157 ,  158 ,  159 ,  160 ,  161 ,  162 ,  163 ,  164 ,  165 ,  166 ,  167 ,  168 ,  169 ,  170 ,  171 ,  172 ,  173 ,  174 ,  175 ,  176 ,  177 ,  178 ,  179 ,  180 ,  181 ,  182 ,  183 ,  184 ,  185 ,  186 ,  187 ,  188 ,  189 ,  190 ,  191 ,  192 ,  193 ,  194 ,  195 ,  196 ,  197 ,  198 ,  199 ,  200 ,  201 ,  202 ,  203 ,  204 ,  205 ,  206 ,  207 ,  208 ,  209 ,  210 ,  211 ,  212 ,  213 ,  214 ,  215 ,  216 ,  217 ,  218 ,  219 ,  220 ,  221 ,  222 ,  223 ,  224 ,  225 ,  226 ,  227 ,  228 ,  229 ,  230 ,  231 ,  232 ,  233 ,  234 ,  235 ,  236 ,  237 ,  238 ,  239 ,  240 ,  241 ,  242 ,  243 ,  244 ,  245 ,  246 ,  247 ,  248 ,  249 ,  250 ,  251 ,  252 ,  253 ,  254 ,  255 )  -- throws &#34;function or expression needs too many registers&#34; error\n There is, however, no limit on table literals, reinforcing the factthat the contents of table literals are not multivals, despite theirsimilarity in appearance:\n    What all these different examples of multival quirks demonstrate isthat multivals are just another data structure. (I find this case ismade best by how tail call elimination doesn’t work when recursingwithin a multival, just like it wouldn’t work within a table literal.)They aren’t exceptions to the rules that data structures follow - infact, they have  extra rules that tables don’t. To sum up:\n Multivals cannot be assigned to variables. They can only referred toas literals, function call expressions, or the vararg  ....\n The vararg cannot be used outside the function that creates it(including within closures made within that function).\n Multivals are cut off at the first value when inserting them intoanother multival before its end.\n Unlike tables, multivals have a built-in length that is unrelated tothe arrangement of  nils within the multival. This length can beretrieved with  select(&#34;#&#34;, ...).\n When a multival contains a call to a zero-return-value functionbefore the end of the multival, a  nil is inserted where thefunction’s return value would go.\n When a function makes a recursive call within a multival, tail callelimination is not applied. Recursing too many times within amultival will thus blow the stack.\n  Trying to call or return from a function with too many argumentswill result in an error. This limit is much lower than thepreviously-mentioned limit on unpacking tables, being just below 255items.\n  Finally, one incredibly subjective thing that bugs me about multivalsis the syntax used for the vararg. In my opinion, the fact that  ...is valid Lua makes it unnecessarily hard to insert aneasily-understood placeholder into example code.\n  While multivals remain a strange and sharp-edged corner of Lua, I hopethat they’re a little bit easier to understand thanks to thispost. While they’re rarely the best solution to a given problem, it’sstill helpful for a Lua user to understand their strengths andlimitations, even if it’s only to justify avoiding them.\n   Also known as Tail Call Optimization. JavaScriptCore, used inSafari, has  Proper Tail CallSupport,but most JS developers can’t make use of this, as it’s notavailable in popular browsers on most platforms.  ↩\n In Fennel, this syntactical confusion gets even worse! There,instead of having their own special syntax, multivals arerepresented with the  values special.  (values 1 2 3) in Fennelis the same as  1, 2, 3 in Lua. Unfortunately, this makesrecursive functions that run into this scenario look even  morelike real tail-recursive functions. This is a gotcha to keep inmind whenever working with multivals and recursion in Fennel!  ↩", "posttime": "2020-05-06 00:18:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "知道,lua,函数,multival", "title": "你不想知道的关于Lua的多重价值的一切", "title_en": "Everything You Didn't Want to Know About Lua's Multi-Values", "transed": 1, "url": "https://benaiah.me/posts/everything-you-didnt-want-to-know-about-lua-multivals/", "via": "", "real_tags": ["知道", "lua", "函数", "multival"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000782, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Web授权协议T.LodderstedtInternet-Draft yes.com包含状态：最佳当前实践J.Bradley Expires：2020年10月7日Yubio A.Labunets D.Fett yes.com 2020年4月5日OAuth 2.0安全最佳当前实践草案-IETF-OAuth-Security-Themes-15摘要本文档描述了OAuth 2.0的最佳当前安全实践。它更新和扩展了OAuth 2.0安全威胁模型，以纳入自OAuth 2.0发布以来收集的实际经验，并涵盖了由于OAuth 2.0的更广泛应用而带来的新威胁。本备忘录的状态本互联网草案完全符合BCP 78和BCP 79的规定。互联网草案是互联网工程任务组(IETF)的工作文件。请注意，其他小组也可以将工作文件作为互联网草稿分发。目前的互联网草稿列表在https://datatracker.ietf.org/drafts/current/.。互联网草案是有效期最长为6个月的草案文件，可随时更新、替换或被其他文件淘汰。使用互联网草稿作为参考材料或将其作为正在进行的工作以外的引用是不合适的。本互联网草稿将于2020年10月7日到期。版权所有(C)2020 IETF Trust和指定为文档作者的人员。版权所有。本文件受BCP78和IETF Trust关于IETF文件(https://trustee.ietf.org/许可证信息)的法律规定的约束，自本文件发布之日起生效。请仔细阅读这些文档，因为它们描述了您的权利Lodderstedt等人。2020年10月7日到期[第1页]。\n互联网-草案OAuth-安全-主题2020年4月以及与本文档相关的限制。本文档中提取的代码组件必须包括简化的BSD许可文本，如信托法律规定的第4.e节所述，并且如简化的BSD许可中所述不提供担保。目录1.简介。。。。。。。。。。。。。。。。。。。。。。。。3 1.1.。结构。。。。。。。。。。。。。。。。。。。。。。。。4 1.2.。约定和术语。。。。。。。。。。。。。。。4.建议。。。。。。。。。。。。。。。。。。。。。。。5 2.1.。保护基于重定向的流。。。。。。。。。。。。。5 2.1.1。授权码授予。。。。。。。。。。。。。。6 2.1.2。隐含的授予。。。。。。。。。。。。。。。。。。。6 2.2.。令牌重放防止。。。。。。。。。。。。。。。。。7 2.3.。访问令牌权限限制。。。。。。。。。。。7 2.4.。资源所有者密码凭据授予。。。。。。。。8 2.5.。客户端身份验证。。。。。。。。。。。。。。。。。。8 2.6.。其他建议。。。。。。。。。。。。。。。。。。8 3.更新的OAuth 2.0攻击者模型。。。。。。。。。。。。9 4.攻击及减刑。。。。。。。。。。。。。。。。。。。11 4.1.。重定向URI验证不足。。。。。。。。。。11 4.1.1。重定向授权代码授予上的URI验证攻击。。。。。。。。。。。。。。。。。。。。。。。。11 4.1.2。重定向隐式GRANT上的URI验证攻击。。13 4.1.3.。对策。。。。。。。。。。。。。。。。。。。14 4.2.。通过Referer标头泄露凭据。。。。。。。。。15 4.2.1。从OAuth客户端泄漏。。。。。。。。。。。。15 4.2.2。从授权服务器泄漏。。。。。。。。15 4.2.3。后果。。。。。。。。。。。。。。。。。。。。16 4.2.4.。对策。。。。。。。。。。。。。。。。。。。164.3.。通过浏览器历史记录泄露凭据。。。。。。。。。17 4.3.1.。浏览器历史记录中的授权码。。。。。。。。17 4.3.2。浏览器历史记录中的访问令牌。。。。。。。。。。。17 4.4.。混杂的攻击。。。。。。。。。。。。。。。。。。。。。18 4.4.1。攻击描述。。。。。。。。。。。。。。。。。18 4.4.2。对策。。。。。。。。。。。。。。。。。。。204.5。授权码注入。。。。。。。。。。。。。。21 4.5.1。攻击描述。。。。。。。。。。。。。。。。。21 4.5.2。讨论。。。。。。。。。。。。。。。。。。。。。22 4.5.3。对策。。。。。。。。。。。。。。。。。。。23 4.5.4。限制。。。。。。。。。。。。。。。。。。。。。244.6.。访问令牌注入。。。。。。。。。。。。。。。。。24 4.6.1。对策。。。。。。。。。。。。。。。。。。。25 4.7.。跨站点请求伪造。。。。。。。。。。。。。。。25 4.7.1。对策。。。。。。。。。。。。。。。。。。。25 4.8。资源服务器的访问令牌泄漏。。。。。。。25 4.8.1。假冒资源Lodderstedt等人的访问令牌网络钓鱼。2020年10月7日到期[第2页]。\n互联网-草案OAuth-安全-主题2020年4月服务器。。。。。。。。。。。。。。。。。。。。。。。26 4.8.2.。受损的资源服务器。。。。。。。。。。。。。31 4.9.。打开重定向。。。。。。。。。。。。。。\nInternet-草案OAuth-security-主题2020年4月3.更新的OAuth 2.0攻击者模型在[RFC6819]中，列出了一个攻击者模型，该模型描述了必须保护OAuth部署免受攻击的攻击者的能力。在以下内容中，此属性。\n..", "note_en": "Web Authorization Protocol T. LodderstedtInternet-Draft yes.comIntended status: Best Current Practice J. BradleyExpires: 7 October 2020 Yubico A. Labunets D. Fett yes.com 5 April 2020  OAuth 2.0 Security Best Current Practice  draft-ietf-oauth-security-topics-15Abstract This document describes best current security practice for OAuth 2.0. It updates and extends the OAuth 2.0 Security Threat Model to incorporate practical experiences gathered since OAuth 2.0 was published and covers new threats relevant due to the broader application of OAuth 2.0.Status of This Memo This Internet-Draft is submitted in full conformance with the provisions of  BCP 78 and  BCP 79. Internet-Drafts are working documents of the Internet Engineering Task Force (IETF). Note that other groups may also distribute working documents as Internet-Drafts. The list of current Internet- Drafts is at  https://datatracker.ietf.org/drafts/current/. Internet-Drafts are draft documents valid for a maximum of six months and may be updated, replaced, or obsoleted by other documents at any time. It is inappropriate to use Internet-Drafts as reference material or to cite them other than as &#34;work in progress.&#34; This Internet-Draft will expire on 7 October 2020.Copyright Notice Copyright (c) 2020 IETF Trust and the persons identified as the document authors. All rights reserved. This document is subject to  BCP 78 and the IETF Trust&#39;s Legal Provisions Relating to IETF Documents ( https://trustee.ietf.org/  license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights Lodderstedt, et al. Expires 7 October 2020 [Page 1]\n  Internet-Draft oauth-security-topics April 2020 and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the  Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.Table of Contents  1. Introduction . . . . . . . . . . . . . . . . . . . . . . . .  3  1.1. Structure . . . . . . . . . . . . . . . . . . . . . . . .  4  1.2. Conventions and Terminology . . . . . . . . . . . . . . .  4  2. Recommendations . . . . . . . . . . . . . . . . . . . . . . .  5  2.1. Protecting Redirect-Based Flows . . . . . . . . . . . . .  5  2.1.1. Authorization Code Grant . . . . . . . . . . . . . .  6  2.1.2. Implicit Grant . . . . . . . . . . . . . . . . . . .  6  2.2. Token Replay Prevention . . . . . . . . . . . . . . . . .  7  2.3. Access Token Privilege Restriction . . . . . . . . . . .  7  2.4. Resource Owner Password Credentials Grant . . . . . . . .  8  2.5. Client Authentication . . . . . . . . . . . . . . . . . .  8  2.6. Other Recommendations . . . . . . . . . . . . . . . . . .  8  3. The Updated OAuth 2.0 Attacker Model . . . . . . . . . . . .  9  4. Attacks and Mitigations . . . . . . . . . . . . . . . . . . .  11  4.1. Insufficient Redirect URI Validation . . . . . . . . . .  11 4.1.1. Redirect URI Validation Attacks on Authorization Code Grant . . . . . . . . . . . . . . . . . . . . . . . .  11  4.1.2. Redirect URI Validation Attacks on Implicit Grant . .  13  4.1.3. Countermeasures . . . . . . . . . . . . . . . . . . .  14  4.2. Credential Leakage via Referer Headers . . . . . . . . .  15  4.2.1. Leakage from the OAuth Client . . . . . . . . . . . .  15  4.2.2. Leakage from the Authorization Server . . . . . . . .  15  4.2.3. Consequences . . . . . . . . . . . . . . . . . . . .  16  4.2.4. Countermeasures . . . . . . . . . . . . . . . . . . .  16  4.3. Credential Leakage via Browser History . . . . . . . . .  17  4.3.1. Authorization Code in Browser History . . . . . . . .  17  4.3.2. Access Token in Browser History . . . . . . . . . . .  17  4.4. Mix-Up Attacks . . . . . . . . . . . . . . . . . . . . .  18  4.4.1. Attack Description . . . . . . . . . . . . . . . . .  18  4.4.2. Countermeasures . . . . . . . . . . . . . . . . . . .  20  4.5. Authorization Code Injection . . . . . . . . . . . . . .  21  4.5.1. Attack Description . . . . . . . . . . . . . . . . .  21  4.5.2. Discussion . . . . . . . . . . . . . . . . . . . . .  22  4.5.3. Countermeasures . . . . . . . . . . . . . . . . . . .  23  4.5.4. Limitations . . . . . . . . . . . . . . . . . . . . .  24  4.6. Access Token Injection . . . . . . . . . . . . . . . . .  24  4.6.1. Countermeasures . . . . . . . . . . . . . . . . . . .  25  4.7. Cross Site Request Forgery . . . . . . . . . . . . . . .  25  4.7.1. Countermeasures . . . . . . . . . . . . . . . . . . .  25  4.8. Access Token Leakage at the Resource Server . . . . . . .  25 4.8.1. Access Token Phishing by Counterfeit Resource Lodderstedt, et al. Expires 7 October 2020 [Page 2]\n  Internet-Draft oauth-security-topics April 2020 Server . . . . . . . . . . . . . . . . . . . . . . .  26  4.8.2. Compromised Resource Server . . . . . . . . . . . . .  31  4.9. Open Redirection . . . . . . . . . . . . . . . . . . . .  31  4.9.1. Client as Open Redirector . . . . . . . . . . . . . .  32  4.9.2. Authorization Server as Open Redirector . . . . . . .  32  4.10. 307 Redirect . . . . . . . . . . . . . . . . . . . . . .  32  4.11. TLS Terminating Reverse Proxies . . . . . . . . . . . . .  33  4.12. Refresh Token Protection . . . . . . . . . . . . . . . .  34  4.12.1. Discussion . . . . . . . . . . . . . . . . . . . . .  34  4.12.2. Recommendations . . . . . . . . . . . . . . . . . .  35  4.13. Client Impersonating Resource Owner . . . . . . . . . . .  36  4.13.1. Countermeasures . . . . . . . . . . . . . . . . . .  36  4.14. Clickjacking . . . . . . . . . . . . . . . . . . . . . .  36  5. Acknowledgements . . . . . . . . . . . . . . . . . . . . . .  37  6. IANA Considerations . . . . . . . . . . . . . . . . . . . . .  38  7. Security Considerations . . . . . . . . . . . . . . . . . . .  38  8. Normative References . . . . . . . . . . . . . . . . . . . .  38  9. Informative References . . . . . . . . . . . . . . . . . . .  39  Appendix A. Document History . . . . . . . . . . . . . . . . . .  42 Authors&#39; Addresses . . . . . . . . . . . . . . . . . . . . . . .  46  1. Introduction Since its publication in [ RFC6749] and [ RFC6750], OAuth 2.0 (&#34;OAuth&#34; in the following) has gotten massive traction in the market and became the standard for API protection and the basis for federated login using OpenID Connect [ OpenID]. While OAuth is used in a variety of scenarios and different kinds of deployments, the following challenges can be observed: * OAuth implementations are being attacked through known implementation weaknesses and anti-patterns. Although most of these threats are discussed in the OAuth 2.0 Threat Model and Security Considerations [ RFC6819], continued exploitation demonstrates a need for more specific recommendations, easier to implement mitigations, and more defense in depth. * OAuth is being used in environments with higher security requirements than considered initially, such as Open Banking, eHealth, eGovernment, and Electronic Signatures. Those use cases call for stricter guidelines and additional protection. * OAuth is being used in much more dynamic setups than originally anticipated, creating new challenges with respect to security. Those challenges go beyond the original scope of [ RFC6749], [ RFC6750], and [ RFC6819]. Lodderstedt, et al. Expires 7 October 2020 [Page 3]\n  Internet-Draft oauth-security-topics April 2020 OAuth initially assumed a static relationship between client, authorization server and resource servers. The URLs of AS and RS were known to the client at deployment time and built an anchor for the trust relationship among those parties. The validation whether the client talks to a legitimate server was based on TLS server authentication (see  [RFC6819], Section 4.5.4). With the increasing adoption of OAuth, this simple model dissolved and, in several scenarios, was replaced by a dynamic establishment of the relationship between clients on one side and the authorization and resource servers of a particular deployment on the other side. This way, the same client could be used to access services of different providers (in case of standard APIs, such as e-mail or OpenID Connect) or serve as a frontend to a particular tenant in a multi-tenancy environment. Extensions of OAuth, such as the OAuth 2.0 Dynamic Client Registration Protocol [ RFC7591] and OAuth 2.0 Authorization Server Metadata [ RFC8414] were developed in order to support the usage of OAuth in dynamic scenarios. * Technology has changed. For example, the way browsers treat fragments when redirecting requests has changed, and with it, the implicit grant&#39;s underlying security model. This document provides updated security recommendations to address these challenges. It does not supplant the security advice given in [ RFC6749], [ RFC6750], and [ RFC6819], but complements those documents.  1.1. Structure The remainder of this document is organized as follows: The next section summarizes the most important recommendations of the OAuth working group for every OAuth implementor. Afterwards, the updated the OAuth attacker model is presented. Subsequently, a detailed analysis of the threats and implementation issues that can be found in the wild today is given along with a discussion of potential countermeasures.  1.2. Conventions and Terminology The key words &#34;MUST&#34;, &#34;MUST NOT&#34;, &#34;REQUIRED&#34;, &#34;SHALL&#34;, &#34;SHALL NOT&#34;, &#34;SHOULD&#34;, &#34;SHOULD NOT&#34;, &#34;RECOMMENDED&#34;, &#34;NOT RECOMMENDED&#34;, &#34;MAY&#34;, and &#34;OPTIONAL&#34; in this document are to be interpreted as described in  BCP  14 [ RFC2119] [ RFC8174] when, and only when, they appear in all capitals, as shown here. This specification uses the terms &#34;access token&#34;, &#34;authorization endpoint&#34;, &#34;authorization grant&#34;, &#34;authorization server&#34;, &#34;client&#34;, &#34;client identifier&#34; (client ID), &#34;protected resource&#34;, &#34;refresh Lodderstedt, et al. Expires 7 October 2020 [Page 4]\n  Internet-Draft oauth-security-topics April 2020 token&#34;, &#34;resource owner&#34;, &#34;resource server&#34;, and &#34;token endpoint&#34; defined by OAuth 2.0 [ RFC6749].  2. Recommendations This section describes the set of security mechanisms the OAuth working group recommends to OAuth implementers.  2.1. Protecting Redirect-Based Flows When comparing client redirect URIs against pre-registered URIs, authorization servers MUST utilize exact string matching. This measure contributes to the prevention of leakage of authorization codes and access tokens (see  Section 4.1). It can also help to detect mix-up attacks (see  Section 4.4). Clients MUST NOT expose URLs that forward the user&#39;s browser to arbitrary URIs obtained from a query parameter (&#34;open redirector&#34;). Open redirectors can enable exfiltration of authorization codes and access tokens, see  Section 4.9.1. Clients MUST prevent Cross-Site Request Forgery (CSRF). In this context, CSRF refers to requests to the redirection endpoint that do not originate at the authorization server, but a malicious third party (see  Section 4.4.1.8. of [RFC6819] for details). Clients that have ensured that the authorization server supports PKCE [ RFC7636] MAY rely the CSRF protection provided by PKCE. In OpenID Connect flows, the &#34;nonce&#34; parameter provides CSRF protection. Otherwise, one-time use CSRF tokens carried in the &#34;state&#34; parameter that are securely bound to the user agent MUST be used for CSRF protection (see  Section 4.7.1). In order to prevent mix-up attacks (see  Section 4.4), clients MUST only process redirect responses of the authorization server they sent the respective request to and from the same user agent this authorization request was initiated with. Clients MUST store the authorization server they sent an authorization request to and bind this information to the user agent and check that the authorization request was received from the correct authorization server. Clients MUST ensure that the subsequent token request, if applicable, is sent to the same authorization server. Clients SHOULD use distinct redirect URIs for each authorization server as a means to identify the authorization server a particular response came from. An AS that redirects a request potentially containing user credentials MUST avoid forwarding these user credentials accidentally (see  Section 4.10 for details). Lodderstedt, et al. Expires 7 October 2020 [Page 5]\n  Internet-Draft oauth-security-topics April 2020  2.1.1. Authorization Code Grant Clients MUST prevent injection (replay) of authorization codes into the authorization response by attackers. The use of PKCE [ RFC7636] is RECOMMENDED to this end. The OpenID Connect &#34;nonce&#34; parameter and ID Token Claim [ OpenID] MAY be used as well. The PKCE challenge or OpenID Connect &#34;nonce&#34; MUST be transaction-specific and securely bound to the client and the user agent in which the transaction was started. Note: although PKCE so far was designed as a mechanism to protect native apps, this advice applies to all kinds of OAuth clients, including web applications. When using PKCE, clients SHOULD use PKCE code challenge methods that do not expose the PKCE verifier in the authorization request. Otherwise, attackers that can read the authorization request (cf. Attacker A4 in  Section 3) can break the security provided by PKCE. Currently, &#34;S256&#34; is the only such method. Authorization servers MUST support PKCE [ RFC7636]. Authorization servers MUST provide a way to detect their support for PKCE. To this end, they MUST either (a) publish the element &#34;code_challenge_methods_supported&#34; in their AS metadata ([ RFC8414]) containing the supported PKCE challenge methods (which can be used by the client to detect PKCE support) or (b) provide a deployment- specific way to ensure or determine PKCE support by the AS.  2.1.2. Implicit Grant The implicit grant (response type &#34;token&#34;) and other response types causing the authorization server to issue access tokens in the authorization response are vulnerable to access token leakage and access token replay as described in  Section 4.1,  Section 4.2,  Section 4.3, and  Section 4.6. Moreover, no viable mechanism exists to cryptographically bind access tokens issued in the authorization response to a certain client as it is recommended in  Section 2.2. This makes replay detection for such access tokens at resource servers impossible. In order to avoid these issues, clients SHOULD NOT use the implicit grant (response type &#34;token&#34;) or other response types issuing access tokens in the authorization response, unless access token injection in the authorization response is prevented and the aforementioned token leakage vectors are mitigated. Lodderstedt, et al. Expires 7 October 2020 [Page 6]\n  Internet-Draft oauth-security-topics April 2020 Clients SHOULD instead use the response type &#34;code&#34; (aka authorization code grant type) as specified in  Section 2.1.1 or any other response type that causes the authorization server to issue access tokens in the token response, such as the &#34;code id_token&#34; response type. This allows the authorization server to detect replay attempts by attackers and generally reduces the attack surface since access tokens are not exposed in URLs. It also allows the authorization server to sender-constrain the issued tokens (see next section).  2.2. Token Replay Prevention A sender-constrained access token scopes the applicability of an access token to a certain sender. This sender is obliged to demonstrate knowledge of a certain secret as prerequisite for the acceptance of that token at the recipient (e.g., a resource server). Authorization and resource servers SHOULD use mechanisms for sender- constrained access tokens to prevent token replay as described in  Section 4.8.1.1.2. The use of Mutual TLS for OAuth 2.0 [ RFC8705] is RECOMMENDED. Refresh tokens MUST be sender-constrained or use refresh token rotation as described in  Section 4.12. It is RECOMMENDED to use end-to-end TLS. If TLS traffic needs to be terminated at an intermediary, refer to  Section 4.11 for further security advice.  2.3. Access Token Privilege Restriction The privileges associated with an access token SHOULD be restricted to the minimum required for the particular application or use case. This prevents clients from exceeding the privileges authorized by the resource owner. It also prevents users from exceeding their privileges authorized by the respective security policy. Privilege restrictions also help to reduce the impact of access token leakage. In particular, access tokens SHOULD be restricted to certain resource servers (audience restriction), preferably to a single resource server. To put this into effect, the authorization server associates the access token with certain resource servers and every resource server is obliged to verify, for every request, whether the access token sent with that request was meant to be used for that particular resource server. If not, the resource server MUST refuse to serve the respective request. Clients and authorization servers MAY utilize the parameters &#34;scope&#34; or &#34;resource&#34; as specified in [ RFC6749] and [ I-D.ietf-oauth-resource-indicators], respectively, to determine the resource server they want to access. Lodderstedt, et al. Expires 7 October 2020 [Page 7]\n  Internet-Draft oauth-security-topics April 2020 Additionally, access tokens SHOULD be restricted to certain resources and actions on resource servers or resources. To put this into effect, the authorization server associates the access token with the respective resource and actions and every resource server is obliged to verify, for every request, whether the access token sent with that request was meant to be used for that particular action on the particular resource. If not, the resource server must refuse to serve the respective request. Clients and authorization servers MAY utilize the parameter &#34;scope&#34; as specified in [ RFC6749] and &#34;authorization_details&#34; as specified in [ I-D.ietf-oauth-rar] to determine those resources and/or actions.  2.4. Resource Owner Password Credentials Grant The resource owner password credentials grant MUST NOT be used. This grant type insecurely exposes the credentials of the resource owner to the client. Even if the client is benign, this results in an increased attack surface (credentials can leak in more places than just the AS) and users are trained to enter their credentials in places other than the AS. Furthermore, adapting the resource owner password credentials grant to two-factor authentication, authentication with cryptographic credentials (cf. WebCrypto [ webcrypto], WebAuthn [ webauthn]), and authentication processes that require multiple steps can be hard or impossible.  2.5. Client Authentication Authorization servers SHOULD use client authentication if possible. It is RECOMMENDED to use asymmetric (public-key based) methods for client authentication such as mTLS [ RFC8705] or &#34;private_key_jwt&#34; [ OpenID]. When asymmetric methods for client authentication are used, authorization servers do not need to store sensitive symmetric keys, making these methods more robust against a number of attacks.  2.6. Other Recommendations Authorization servers SHOULD NOT allow clients to influence their &#34;client_id&#34; or &#34;sub&#34; value or any other claim if that can cause confusion with a genuine resource owner (see  Section 4.13). Lodderstedt, et al. Expires 7 October 2020 [Page 8]\n  Internet-Draft oauth-security-topics April 2020  3. The Updated OAuth 2.0 Attacker Model In [ RFC6819], an attacker model is laid out that describes the capabilities of attackers against which OAuth deployments must be protected. In the following, this att\n......", "posttime": "2020-05-05 23:54:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "当前,current,oauth", "title": "OAuth 2.0安全最佳当前实践", "title_en": "OAuth 2.0 Security Best Current Practice", "transed": 1, "url": "https://tools.ietf.org/html/draft-ietf-oauth-security-topics-15", "via": "", "real_tags": ["当前", "current", "oauth"]}, {"category": "", "categoryclass": "", "imagename": "e143cdc76004a381ee210eb9db2ac105.png", "infoid": 1000781, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们刚刚开源了“Reaction Flow”：一个用于呈现基于节点的交互式图形的库，它具有流畅的平移和缩放行为，有很多不错的功能，甚至还有一些有用的插件，比如迷你地图！\n在这篇文章中，我将向您展示一个简单的Reaction Flow应用程序示例。如果您想更快入门，可以直接转到文档或查看演示：\n如果我们可以帮助您开发一个自定义的基于节点的工具，我们很高兴收到您的消息：[电子邮件受保护]。\nReaction Flow不仅呈现图形，还增加了交互性，并附带了许多内置功能：\n为了使这个库尽可能灵活，除了位置之外，我们不做任何状态更新。这意味着您需要自己传递更改显示的节点和边的所有函数。您可以实现自己的函数，也可以使用库附带的帮助器函数。\n您可以通过NPM安装Reaction Flow。遗憾的是，Reaction-Flow已经被获取，因此您需要安装Reaction-Flow-渲染器：\n现在您可以将其集成到您的Reaction应用程序中。简单的图表可能如下所示：\n从&#39；REACT&#39；导入ReactFlow从&#39；REACT-FLOW-RENDER&#39；；常量元素=[{id：&#39；1&#39；，数据：{Label：&#39；Node 1&#39；}，位置：{x：250，y：5}}，{id：&#39；2&#39；，数据：{Label：&#39；Node 2&#39；}，位置：{x：100，y：100}}，{id：&#39；e1-2&#39；，源：&#39；1&#39；，目标：&#39；2&#39；，动画：true}]；常量图形样式={宽度：&#39；100%&#39；，高度：&#39；500px&#39；}；常量基本图形=()=&lt；ReactFlow Elements={Elements}style={raphStyles}/&gt；；\n如您所见，我们正在将元素传递给ReactFlow组件。在元素列表中有两个节点和将这些节点彼此连接的边。您可以通过源属性和目标属性的存在来标识边。节点有一些初始位置，因此它们不会重叠。我们还传递了一个样式，以便获得一些空间来呈现图形。您可以在文档中找到完整的选项列表。上面的示例如下所示：\n图形几乎总是具有不同的节点类型。反应流有三种基本类型：输入、默认和输出。您可以使用节点的类型属性选择类型：\n常量元素=[{id：&#39；1&#39；，类型：&#39；输入&#39；，数据：{Label：&#39；输入节点&#39；}，位置：{x：100，y：5}}，{id：&#39；2&#39；，类型：&#39；默认&#39；，数据：{Label：&#39；默认节点&#39；}，位置：{x：100，y：100}}，{id：&#39；3&#39；，类型：&#39；输出&#39；，数据：{label：&#39；输出节点&#39；}，位置：{x：100，y：200}}]；\n如您所见，允许您连接节点的句柄和类型的颜色是不同的。您可以通过传递带有CSS规则的标签和样式对象来自定义这些现有类型：\n常量元素=[{id：&#39；1&#39；，样式：{背景：&#39；#ffcc50&#39；，宽度：100}，数据：{label：&#39；自定义样式&#39；}，位置：{x：100，y：5}}]；\n反应流具有以下边类型：直、默认、阶跃。与节点一样，您可以通过将类型传递给元素列表中的边来选择类型：\n常量元素=[{id：&#39；1&#39；，类型：&#39；输入&#39；，数据：{Label：&#39；Node 1&#39；}，位置：{x：5，y：5}}，{id：&#39；2&#39；，数据：{Label：&#39；Node 2&#39；}，位置：{x：100，y：100}}，{id：&#39；3&#39；，数据：{Label：&#39；Node 3&#39；}，位置：{x：250，y：150}}，{id：&#39；4&#39；，数据：{Label：&#39；Node 4&#39；}，位置：{x：500，y：200}}，{id：&#39；E1-2&39；，来源：&#39；1&#39；，目标：&#39；2&#39；，类型：&#39；直通&#39；}，{id：&#39；E1-3&39；，来源：&#39；1&#39；，目标：&#39；3&#39；，类型：&#39；默认&#39；}，{id：&#39；E1-4&#39；，来源：&#39；1&#39；，目标：&#39；4&#39；，类型：&#39；步骤&#39；}]；\n如果您想创建自定义节点或边类型，可以查看自定义节点示例的源代码。在那里，我们实现了一个自定义节点组件，然后通过将其作为nodeTypes属性传递给Reaction流组件，使其在呈现器中可用。\n正如我在前面指出的，Reaction流具有一些基本的交互性，但不会对呈现的元素进行状态更新。您可以缩放、平移和拖动或选择元素，但是如果您想要添加或删除节点，例如，您需要自己实现该功能，或者使用Reaction流帮助器函数之一。每当Reaction流组件上的元素属性更改时，我们都会重新呈现图形。因此，例如，如果您想要添加一个节点，您需要将一个新节点推送到Elements数组，并将其传递给Reaction流组件。如果要删除节点，则需要通过将函数传递给onElementsRemove prop来侦听Remove事件：\n导入React，{useState}从&#39；Reaction；导入ReactFlow，{removeElements}从&#39；React-Flow-Renender&#39；；const initialElements=[{id：&#39；1&#39；，类型：&#39；输入&#39；，数据：{Label：&#39；Node 1&#39；}，位置：{x：5，y：5}}]；const Graph=()=&gt；{const[Elements，setElements]=useState(InitialElements)；const onElementsRemove=(ElementsToRemove)=&gt；setElements(Els=&gt；removeElements(elementsToRemove，Els))；Return(&lt；ReactFlow Elements={Elements}style={raphStyles}onElementsRemove={onElement。\nReaction Flow附带两个插件：图形控件和迷你地图。控制面板带有一个放大、缩小和焦点图按钮。您可以将CSS样式传递给它或使用如下所示的默认样式：\n如果您想要将这些插件添加到您的图表中，您只需要将它们作为子级传递给您的Reaction流组件：\n从&#39；REACT&#39；导入ReactFlow，{Minimap，Controls}从&#39；REACT-FLOW-RENDER&#39；常量元素=[{id：&#39；1&#39；，类型：&#39；输入&#39；，数据：{Label：&#39；Node&#39；}，位置：{x：0，y：0}}]；const Graph=()=&gt；{return(&lt；ReactFlow Elements={Elements}style={{width：&#39；100%&#39；，Height：&#39；500px&#39；}})&gt；&lt；最小地图节点颜色={n=&gt；{if(n.type=&#39；input&#39；)return&#39；Blue&#39；if(n.type=&。输出&#39；)返回&#39；绿色&39；；如果(n.type=&#39；默认值&#39；)返回&#39；红色&39；；返回&#39；灰色&39；；}}/&gt；&lt；控件/&gt；)；}。\n在上面的示例中，我们使用nodeColor属性来更改显示节点的颜色。您可以使用nodeColor、nodeBorderRadius、maskColor或style属性来调整迷你地图的外观。\n我希望我能给你们一个很好的反应流程概述。如果您有任何问题或意见，请随时通过邮件或Twitter与我联系，或在Github上发布问题。祝大家万事如意，万事如意！", "note_en": "We just open sourced  “React Flow”:  A library for rendering interactive node-based graphs with a smooth panning and zooming behaviour and lots of nice features and even some useful plugins like a mini map!\n In this post I will show you a simple example of a React Flow application. If you want to start even faster you can directly go to the  documentation or check out the demo:\n  If we can help you to develop a custom node-based tool we are happy to hear from you:   [email protected].\n  React Flow not only renders a graph but also adds interactivity and comes with a lot of built-in features:\n  In order to make this library as flexible as possible we don’t do any state updates besides the positions. This means that you need to pass all functions that change the displayed nodes and edges by yourself. You can implement your own ones or use the  helper functions that come with the library.\n  You can install React Flow via npm. Unfortunately  react-flow was already taken so you need to install  react-flow-renderer:\n  You can now integrate it in your React application. A simple graph could like like this:\n import React  from  &#39;react&#39; ; import ReactFlow  from  &#39;react-flow-renderer&#39; ; const elements  =  [  { id :  &#39;1&#39; , data :  { label :  &#39;Node 1&#39;  } , position :  { x :  250 , y :  5  }  } ,  { id :  &#39;2&#39; , data :  { label :  &#39;Node 2&#39;  } , position :  { x :  100 , y :  100  }  } ,  { id :  &#39;e1-2&#39; , source :  &#39;1&#39; , target :  &#39;2&#39; , animated :  true  } ] ; const graphStyles  =  { width :  &#39;100%&#39; , height :  &#39;500px&#39;  } ; const  BasicGraph  =  ( )  =&gt;  &lt;ReactFlow elements = {elements } style = {graphStyles }  / &gt; ;\n As you can see we are passing  elements to the ReactFlow component. In the list of elements there are two nodes and an edge that connects these nodes with each other. You can identify the edge by the presence of a  source and  target attribute. The nodes have some initial positions so that they dont overlap. We are also passing a  style in order to get some space for rendering the graph. You can find a full list of options in the  documenation. The example above would like this:\n   A graph almost always has different node types. React Flow comes with three basic types:  input,  default and  output.You can select the type by using the  type attribute of a node:\n const elements  =  [  { id :  &#39;1&#39; , type :  &#39;input&#39; , data :  { label :  &#39;Input node&#39;  } , position :  { x :  100 , y :  5  }  } ,  { id :  &#39;2&#39; , type :  &#39;default&#39; , data :  { label :  &#39;Default node&#39;  } , position :  { x :  100 , y :  100  }  } ,  { id :  &#39;3&#39; , type :  &#39;output&#39; , data :  { label :  &#39;Output node&#39;  } , position :  { x :  100 , y :  200  }  } ] ;\n   As you can see the handles which allows you to connect nodes and the color of the types are different.You can customize these existing types by passing a  label and also a  style object with css rules:\n const elements  =  [ { id :  &#39;1&#39; , style :  { background :  &#39;#ffcc50&#39; , width :  100  } , data :  { label :  &#39;custom style&#39;  } , position :  { x :  100 , y :  5  } } ] ;\n   React Flow has the following edge types:  straight,  default,  step. As with the nodes you can select the type by passing it to the edge in the elements list:\n const elements  =  [  { id :  &#39;1&#39; , type :  &#39;input&#39; , data :  { label :  &#39;Node 1&#39;  } , position :  { x :  5 , y :  5  }  } ,  { id :  &#39;2&#39; , data :  { label :  &#39;Node 2&#39;  } , position :  { x :  100 , y :  100  }  } ,  { id :  &#39;3&#39; , data :  { label :  &#39;Node 3&#39;  } , position :  { x :  250 , y :  150  }  } ,  { id :  &#39;4&#39; , data :  { label :  &#39;Node 4&#39;  } , position :  { x :  500 , y :  200  }  } ,  { id :  &#39;e1-2&#39; , source :  &#39;1&#39; , target :  &#39;2&#39; , type :  &#39;straight&#39;  } ,  { id :  &#39;e1-3&#39; , source :  &#39;1&#39; , target :  &#39;3&#39; , type :  &#39;default&#39;  } ,  { id :  &#39;e1-4&#39; , source :  &#39;1&#39; , target :  &#39;4&#39; , type :  &#39;step&#39;  } ] ;\n   If you want like to create a custom node or edge type you can look at the  source of the custom node example. There we implement a custom node component and then make it available within the renderer by passing it to the React Flow component as a  nodeTypes property.\n  As I pointed out earlier React Flow comes with some basic interactivity but doesn’t do state updates for the rendered elements. You can zoom and pan and drag or select elements but if you want to add or remove a node for example you need to implement the function by yourself or use one of the  React Flow helper functions. Whenever the elements property change on the React Flow component we re-render the graph. So if you want to add a node for example you need to push a new node to your elements array and pass it to the React Flow component. If you want to remove a node you need to listen to the remove event by passing a function to  onElementsRemove prop:\n import React ,  { useState  }  from  &#39;react&#39; ; import ReactFlow ,  { removeElements  }  from  &#39;react-flow-renderer&#39; ; const initialElements  =  [  { id :  &#39;1&#39; , type :  &#39;input&#39; , data :  { label :  &#39;Node 1&#39;  } , position :  { x :  5 , y :  5  }  } ] ; const  Graph  =  ( )  =&gt;  {  const  [elements , setElements ]  =  useState (initialElements ) ;  const  onElementsRemove  =  ( elementsToRemove )  =&gt;  setElements ( els  =&gt;  removeElements (elementsToRemove , els ) ) ;  return  (  &lt;ReactFlow elements = {elements } style = {graphStyles } onElementsRemove = {onElementsRemove }  / &gt;  ) ; }\n  React Flow comes with two  plugins:  Graph controls and a  mini map. The controls panel comes with a zoom-in, zoom-out and focus-graph button. You can pass css styles to it or use the default styles which look like this:\n    If you want to add these plugins to your graph you just need to pass them as childrens to your React Flow component:\n import React ,  { useState  }  from  &#39;react&#39; ; import ReactFlow ,  { MiniMap , Controls  }  from  &#39;react-flow-renderer&#39; ; const elements  =  [  { id :  &#39;1&#39; , type :  &#39;input&#39; , data :  { label :  &#39;Node&#39;  } , position :  { x :  0 , y :  0  }  } ] ; const  Graph  =  ( )  =&gt;  {  return  (  &lt;ReactFlow elements = {elements } style = { { width :  &#39;100%&#39; , height :  &#39;500px&#39;  } }  &gt;  &lt;MiniMap nodeColor = { n  =&gt;  {  if  (n .type  ===  &#39;input&#39; )  return  &#39;blue&#39; ;  if  (n .type  ===  &#39;output&#39; )  return  &#39;green&#39; ;  if  (n .type  ===  &#39;default&#39; )  return  &#39;red&#39; ;  return  &#39;gray&#39; ;  } }  / &gt;  &lt;Controls  / &gt;  ) ; }\n In the above example we are using the  nodeColor property to change the color of displayed nodes.You can adjust the look of the mini map by using the  nodeColor,  nodeBorderRadius,  maskColor or  style properties.\n  I hope that I could give you a good overview of React Flow. If you have any questions or remarks, feel free to contact me via  mail or  twitter or post an  issue on Github. Best wishes and stay safe everyone!", "posttime": "2020-05-05 23:54:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "flow,节点,node", "title": "Reaction-Flow：创建基于节点的交互式图形的库", "title_en": "React-flow: a library to create interactive node-based graphs", "transed": 1, "url": "https://webkid.io/blog/react-flow-node-based-graph-library/", "via": "", "real_tags": ["flow", "节点", "node"]}]