[{"category": "", "categoryclass": "", "imagename": "7d6ec9c22e2a3b96cb40a8cb0026429e.jpg", "infoid": 1004005, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ESET的安全研究人员发现了由Turla实施的新攻击，Turla是俄罗斯最先进的国家支持的黑客组织之一。\n新的袭击发生在2020年1月。ESET研究人员说，袭击的目标是三个备受瞩目的实体，如高加索的国家议会和东欧的两个外交部。由于国家安全原因，无法点名识别目标。\n这些入侵是一长串受害者名单中的最新一例，其中大多数包括外交和军事实体。这份清单始于2000年代中期的五角大楼，多年来一直持续到欧洲、中东、亚洲和非洲的目标。\n然而，2020年1月的攻击之所以脱颖而出，是因为部署了更新版本的Comrat恶意软件，ESET表示，该软件包含了一些相当聪明的新功能。\nComrat恶意软件，也被称为Agent.BTZ，是Turla最古老的武器之一，也是他们在2008年用来从五角大楼网络中虹吸数据的工具。\n该工具多年来经历了几次更新，分别在2014年和2017年发现了新版本。\n最新的Comrat v4首次出现在2017年，然而，在今天发布的一份报告中，ESET表示，他们发现了Comrat v4的一个变种，其中包括两个新功能，比如能够渗出反病毒日志，以及能够使用Gmail收件箱控制恶意软件。\n这些功能中的第一个是恶意软件从受感染的主机收集防病毒日志并将其上传到其中一个命令和控制服务器的能力。\n黑客组织的确切动机一直不清楚，但分析恶意软件的ESET研究员Matthieu Faou告诉ZDNet，Turla操作员可能正在收集防病毒日志，以便让他们更好地了解是否检测到了恶意软件样本，以及检测到了哪些恶意软件样本。\n人们相信，如果Turla操作员看到检测到的东西，他们就可以调整他们的恶意软件，避免将来在其他系统上被检测到，这样他们就可以在不被检测到的情况下操作。\nFaou说，窃取日志的恶意软件很常见，但事件响应人员总是很难检测到这种行为。\n法乌告诉我们，问题是通常很难确定攻击者泄露了哪些文件。但对于相对先进的群体来说，试图了解他们是否被发现或是否留下痕迹并不少见。\n但这并不是最新的Comrat恶意软件版本中唯一的重大变化。Faou说，恶意软件现在包括的不是一个，而是两个命令和控制机制。\n第一种是通过HTTP联系远程服务器并检索在受感染主机上执行的指令的经典方法。\n第二个，也是新的一个，是使用Gmail的网络界面。Faou说，最新的Comrat v4接管了受害者的一个浏览器，加载了一个预定义的cookie文件，然后启动了与Gmail Web仪表板的会话。\n在这里，恶意软件读取收件箱中的最新电子邮件，从收件箱下载文件附件，然后读取文件中包含的说明。\n这个想法是，每当Turla操作员想要向在受感染主机上运行的Comrat实例发出新命令时，黑客只需向Gmail地址发送一封电子邮件即可。执行以这种方式发送的指令后收集的所有数据都被发送回Gmail收件箱，并重定向回Turla操作员。\nESET说，尽管有新的功能，Turla运营商仍然像以前一样使用Comrat，这主要是作为已经感染的主机上的第二阶段有效载荷。在这里，Comrat用于在文件系统中搜索特定文件，然后将数据渗透到远程点，通常是OneDrive或4Shared上的云文件共享帐户。\n两周前，卡巴斯基还发布了一份关于一些较旧的Turla恶意软件的报告，该软件收到了漂亮的更新。研究人员说，他们发现了一种新版本的COMPFUN恶意软件，Turla操作员可以使用一种依赖HTTP状态码的新颖且前所未见的系统来控制这种恶意软件。", "note_en": "Security researchers from ESET have discovered new attacks carried out by  Turla, one of Russia&#39;s most advanced state-sponsored hacking groups.\n The new attacks have taken place in January 2020. ESET researchers say the attacks targeted three high-profile entities, such as a national parliament in the Caucasus and two Ministries of Foreign Affairs in Eastern Europe. Targets could not be identified by name due to national security reasons.\n These intrusions represent the latest entries in a long list of victims, most of which include diplomatic and military entities. This list started in the mid-2000s with the Pentagon and has continued throughout the years with targets in Europe, the Middle East, Asia, and Africa.\n The January 2020 attacks, however, stood out due to the deployment of an updated version of the ComRAT malware, which ESET says contained some pretty clever new features.\n  The  ComRAT malware, also known as Agent.BTZ, is one of Turla&#39;s oldest weapons, and the one they  used to siphon data from the Pentagon&#39;s network in 2008.\n   The tool has seen several updates across the years, with new versions discovered in  2014 and  2017, respectively.\n  The latest version, known as ComRAT v4, was first seen in 2017, however, in a report published today, ESET says they&#39;ve spotted a variation of ComRAT v4 that includes two new features, such as the ability to exfiltrate antivirus logs and the ability to control the malware using a Gmail inbox.\n   The first of these features is the malware&#39;s ability to collect antivirus logs from an infected host and upload it to one of its command and control servers.\n The exact motives of a hacker group will always remain unclear, but Matthieu Faou, the ESET researcher who analyzed the malware, told  ZDNet that Turla operators might be collecting antivirus logs to &#34;allow them to better understand if and which one of their malware sample was detected.&#34;\n The belief is that if Turla operators see a detection, they can then tweak their malware and avoid future detections on other systems, where they can then operate undetected.\n Faou says that malware that steals logs is common, but it&#39;s always hard for incident responders to detect the behavior.\n &#34;The thing is that it is generally hard to determine what files were exfiltrated by the attackers,&#34; Faou told us. &#34;But for relatively advanced groups, it is not uncommon to try to understand if they are detected or if they leave traces behind them or not.&#34;\n  But this wasn&#39;t the only major change in the latest ComRAT malware version. Faou says that the malware now includes not one, but two command-and-control mechanisms.\n The first is the classic method of contacting a remote server via HTTP and retrieving instructions to execute on infected hosts.\n The second, and the new one, is the use of Gmail&#39;s web interface. Faou says that the latest ComRAT v4 takes over one of the victim&#39;s browsers, loads a predefined cookie file, and then initiates a session to the Gmail web dashboard.\n Here, the malware reads recent emails in the inbox, from where it downloads file attachments, and then reads the instructions contained within the file.\n The idea is that whenever Turla operators want to issue new commands to ComRAT instances running on infected hosts, the hackers merely have to send an email to the Gmail address. All data collected following the execution of instructions sent this way is sent back to the Gmail inbox, and redirected back to Turla operators.\n  ESET says that despite the new features, Turla operators continue to use ComRAT as they did before, which is primarily as a second-stage payload on already infected hosts. Here, ComRAT is used to search the filesystem for specific files, and then exfiltrate the data to a remote point, usually a cloud file sharing account on OneDrive or 4shared.\n  Two weeks ago, Kaspersky also published a report on some older Turla malware that received a nifty update. Researchers said they spotted a new version of the COMpfun malware, which Turla operators could control using a novel and never-before-seen system  that relied on HTTP status codes.", "posttime": "2020-05-28 08:05:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,病毒,hacker,恶意软件", "title": "Turla Hacker Group窃取防病毒日志以查看是否检测到其恶意软件", "title_en": "Turla Hacker Group Steals Antivirus Logs To See If Its Malware Was Detected", "transed": 1, "url": "https://www.zdnet.com/article/turla-hacker-group-steals-antivirus-logs-to-see-if-its-malware-was-detected/", "via": "", "real_tags": ["软件", "病毒", "hacker", "恶意软件"]}, {"category": "", "categoryclass": "", "imagename": "5253dd6c43cd039d295da84a253dd826.jpg", "infoid": 1004004, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周早些时候，微软发布了Winget(不要与AppGet混淆)，作为其2020版本声明的一部分。在过去的几天里，我一直在整理我的想法，弄清楚过去12个月到底发生了什么。\nTLDR；我将不再开发AppGet。客户端和后端服务将立即进入维护模式，直到2020年8月1日，届时它们将被永久关闭。\n一年前(2019年7月3日)，我收到一封来自微软高级经理安德鲁的电子邮件，\n我负责Windows应用程序模型工程团队，特别是应用程序部署团队。我只想给你一张简短的便条，感谢你构建了Appget-这是对Windows生态系统的一个很好的补充，让Windows开发人员的生活变得容易得多。未来几周，我们可能会在温哥华与其他公司会面，但如果您有时间，我们很乐意与您和您的团队会面，听取有关如何让您的应用程序构建工作更轻松的反馈。\n自然，我很兴奋；我的爱好项目被微软注意到是一件大事。我回复了，两个月后，加上几封电子邮件，我们终于计划于8月20日在微软温哥华开会。会议是在我、安德鲁和同一产品组的另一位工程经理之间进行的。我玩得很开心；我们谈论了AppGet背后的想法，我认为目前Windows中的包管理器系统有什么问题，以及我对AppGet的未来有什么计划。我们出去吃午饭，聊了更多关于AppGet、Windows Phone和其他一些事情，但据我所知，会议的结果是，微软能做些什么来帮助我们？我提到过一些Azure信用会很好，得到一些关于新的MSIX包如何工作的文档，如果他们能修复我在下载链接上遇到的一些问题。\n很高兴见到您，并了解更多关于Appget的情况。我正在为您跟进Azure启动定价。如你所知，我们是Windows软件包管理器的忠实粉丝，我们希望在这一领域做得更多。我的团队正在壮大，其中一部分是建立一个团队，负责确保Windows上的包管理器和软件分发向前迈进一大步。我们正在寻求对我们在Windows上启用软件分发的方式做出一些重大改变，这是一个很好的机会(嗯，我想说这不是吗？)。帮助定义整个Azure/Microsoft 365中Windows和应用程序分发的未来。\n考虑到这一点，你有没有考虑过花更多的时间致力于应用程序，甚至可能是在微软？\n起初，我有点犹豫；我不想去微软从事Windows Store、MSI Engine或其他一些与应用部署相关的工作。不久之后，我得到了保证，我会把所有的时间都花在AppGet上。经过大约一个月的长时间电子邮件来回发送，我们得出的结论是，这一安排将非常类似于收购-聘用；微软将聘用我，AppGet将与我一起来，他们将决定是想要重新命名为其他名称，还是将其更名为Microsoft AppGet。\n在整个过程中，我非常不清楚我在微软将扮演什么角色。我的职责是什么？我该向谁汇报呢？谁/任何人会向我汇报？在那些缓慢的对话中，我试图澄清其中的一些答案，但从未得到明确的答案。\n在又进行了几个月的非常缓慢的电子邮件交谈后，我被告知通过BizDev进行收购-招聘过程将需要非常长的时间。加快这一过程的另一种选择是，只需用“奖金”聘用我，然后在事后迁移代码所有权。我没有任何异议，所以我们在雷德蒙德安排了一些会议/面试。\n12月5日，我飞往西雅图，在微软总部参加了一整天的面试/会议。我会见了四个不同的人；其中三个会议更像是典型的面试；与Andrew的会议更多的是关于在这一切结束后我们应该做什么，以及我们如何迁移AppGet的流程和基础设施，以便能够处理Microsoft的规模。我们谈到了我们的一些选择，但总的来说，我认为一切都很顺利。\n我最后一次会议在下午6点左右结束。我打了一辆优步去机场，然后回到了温哥华。\n然后，我有六个月没有收到微软任何人的任何回音。\n直到本周早些时候，我得到了Winget第二天发射的通知，\n嗨，凯文，我希望你和你的家人过得很好-与美国相比，BC似乎在Covid方面处理得很好。\n我很抱歉，首相的职位没有成功。我想花时间告诉您，我们非常感谢您的意见和见解。我们一直在构建windows包管理器，第一个预览版将在明天的build上上线。我们在博客中也给了appget一个呼吁，因为我们相信Windows上会有不同的包管理器的空间。您将看到我们的包管理器也是基于GitHub的，但显然是基于我们自己的实现，等等。我们的包管理器也将是开源的，所以显然我们欢迎您的任何贡献。\n我期待着在我们明天上线后与您讨论我们的套餐管理器。显然在明天早上之前这是保密的所以请保守秘密。你和巧克力是我们事先告诉的唯一两个人。\n我并不太惊讶；几个月前我就知道“微软的事情”并没有发生。\n我等到第二天才看到这个新的包管理器会是什么样子。当我最终看到公告和GitHub存储库时，我感到震惊？心烦意乱？我甚至不确定我在看的是什么。\n当我把它拿给我妻子看时，她说的第一句话就是：“他们管它叫翼片？你是认真的吗？“。我甚至不需要向她解释核心机制、术语、清单格式和结构，甚至包库的文件夹结构是如何受到AppGet的启发的。\n他们没雇我，我是不是很生气？不是的，参观完校园后，我不太确定我是否想为这么大的公司工作，而且从加拿大搬到美国也不是我太兴奋的事情。此外，在整个过程中，我从来没有认为这是一笔交易。\n微软，一家市值1.4万亿美元的公司，最终齐心协力，为他们的旗舰产品发布了一个像样的软件包管理器，我是不是感到不安？不，他们几年前就该这么做了。他们不应该像他们那样把Windows Store搞得一团糟。\n实际上，无论我多么努力地推广AppGet，它的增长速度永远不会像微软解决方案那样快。我创建AppGet不是为了发财，不是为了成名，也不是为了受雇于微软。我创建AppGet是因为我认为我们这些Windows用户也应该得到不错的应用程序管理体验。\n让我烦恼的是整件事是怎么处理的。缓慢而可怕的交流速度。最后完全的无线电寂静。但最让人痛心的是公告。客观上，Winget的大部分想法都来自AppGet，只是提到它是碰巧存在的另一个包管理器；而其他Winget很少共享的包管理器则被提到，并更仔细地进行了解释。\n还有一线希望。Winget将建立在坚实的基础上，并具有成功的潜力。我们忽视了Windows用户可能最终会有一个像样的软件包管理器。-", "note_en": "Microsoft released  WinGet (  Not to be mistaken with    AppGet) earlier this week as part of their  Build 2020 announcements. For the past few days, I’ve been collecting my thoughts figuring out what actually happened in the past 12 months.\n TLDR;   I’m no longer going to be developing AppGet. The client and backend services will go into maintenance mode immediately until August 1st, 2020, at which point they’ll be shut down permanently.\n  A year ago (July 3rd  , 2019) I got this email from Andrew, a high-level manager at Microsoft,\n I run the Windows App Model engineering team and in particular the app deployment team. Just wanted to drop you a quick note to thank you for building appget — it’s a great addition to the Windows ecosystem and makes Windows developers life so much easier. We will likely be up in Vancouver in the coming weeks for meetings with other companies but if you had time we’d love to meet up with you and your team to get feedback on how we can make your life easier building appget.\n Naturally, I was excited; my hobby project being noticed by Microsoft was a big deal. I replied, and two months and a few emails later, we finally had a meeting planned on August 20th at Microsoft Vancouver. The meeting was between me, Andrew and another engineering manager in the same product group. I had a great time; we talked about the ideas behind AppGet,  what I thought was broken about the current package manager systems in Windows and what I had planned for AppGet’s future. We went out for lunch and talked a bit more about AppGet, Windows Phone, and a few other things, but the outcome of the meeting as far as I understood it was,   what can Microsoft do to help? I mentioned some Azure credit would be nice, getting some doc on how the new MSIX packages work and if they could fix a few issues I had with some of their download links.\n  it was a pleasure to meet you and to find out more about appget. I’m following up on the azure startup pricing for you. As you know we are big fans of package managers on Windows and we are looking to do more in that space. My team is growing and part of that is to build a team who is responsible for ensuring package managers and software distribution on Windows makes a big step forward. We are looking to make some significant changes to the way that we enable software distribution on Windows and there’s a great opportunity (well I would say that wouldn’t I?) to help define the future of Windows and app distribution throughout Azure/Microsoft 365.\n With that in mind have you considered spending more time dedicated to appget and potentially at Microsoft?\n Initially, I was a bit hesitant; I didn’t want to go to Microsoft to work on Windows Store, MSI engine or some other app deployment-related stuff. Shortly after, I was assured that I would spend all my time on AppGet. After about a month of prolonged email back and forth, we came to the conclusion that the arrangement will be very similar to an acqui-hire; Microsoft would hire me, AppGet would come with me, and they would decide if they wanted to rename it something else, or it would become Microsoft AppGet.\n Throughout the whole process, I was very unclear on what my role would be at Microsoft. What would my responsibilities be? Who would I report to? Who/anyone would report to me? I tried clearing some of these answers throughout those slow conversations but never got a clear answer.\n After another few months of again very slow email conversations, I was told that the acqui-hire process through BizDev would take a very long time. An alternative to speed up the process would be just to hire me with a “  bonus” and then work on migrating the code ownership after the fact. I didn’t have any objections, so we scheduled some meetings/interviews in Redmond.\n I flew to Seattle on December 5th to have a full day of interviews/meetings at Microsoft HQ. I met with four different people; three of the meetings were more like your typical interviews; the meeting with Andrew was more about what we should do once this is all over and how we would migrate AppGet’s process and infrastructure to be able to handle Microsoft’s scale. We talked about some of our options, but in general, I thought everything went well.\n My last meeting ended at around 6 pm. I took an Uber to the airport and was back in Vancouver.\n And then, I didn’t hear anything back from anyone at Microsoft for six months.\n Until earlier this week when I was given heads up about WinGet’s launch the next day,\n Hi Keivan, I hope you and your family are doing well — BC seems to have a good handle on covid compared to the us.\n I’m sorry that the pm position didn’t work out. I wanted to take the time to tell you how much we appreciated your input and insights. We have been building the windows package manager and the first preview will go live tomorrow at build. We give appget a call out in our blog post too since we believe there will be space for different package managers on windows. You will see our package manager is based on GitHub too but obviously with our own implementation etc. our package manager will be open source too so obviously we would welcome any contribution from you.\n I look forward to talking to you about our package manager once we go live tomorrow. Obviously this is confidential until tomorrow morning so please keep this to yourself. You and chocolatey are the only folks we have told about this in advance.\n I wasn’t too surprised; I had figured out months ago that the “Microsoft thing” isn’t happening.\n I waited until the next day to see what this new package manager was going to be like. When I finally saw the  announcement and the  GitHub repositories, I was shocked? Upset? I wasn’t even sure what I was looking at.\n When I showed it to my wife, the first thing she said was, “They Called it WinGet? are you serious!?” I didn’t even have to explain to her how the core mechanics, terminology, the  manifest format and structure, even the package repository’s folder structure, are very   inspired by AppGet.\n Am I upset they didn’t hire me? Not really, after visiting the campus, I wasn’t too sure I wanted to work for such a big company, also moving from Canada to the U.S. wasn’t something I was too excited about. Also, throughout the process, at no time I assumed this was done deal.\n Am I upset that Microsoft, a 1.4 trillion-dollar company, finally got their act together and released a decent package manager for their flagship product? No, they should’ve done it years ago. They shouldn’t have screwed Windows Store as badly as they did.\n Realistically, no matter how hard I tried to promote AppGet, it would never grow at the rate a   Microsoft solution would. I didn’t create AppGet to get rich or to become famous or get hired by Microsoft. I created AppGet because I thought us Windows users deserved a decent app management experience too.\n What bothers me is how the whole thing was handled. The slow and dreadful communication speed. The total radio silence at the end. But the part that hurts the most was the announcement. AppGet, which is objectively where most ideas for WinGet came from, was only mentioned as another package manager   that just happened to exist; While other package managers that WinGet shares very little with were mentioned and explained much more deliberately.\n There is a silver lining. WinGet will be built on a solid foundation and has the potential to succeed. And we neglected Windows users might finally have a decent package manager. —", "posttime": "2020-05-28 08:04:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,appget", "title": "AppGet去世的那一天", "title_en": "The Day AppGet Died", "transed": 1, "url": "https://keivan.io/the-day-appget-died/", "via": "", "real_tags": ["app", "appget"]}, {"category": "", "categoryclass": "", "imagename": "e7df6d203f02a2964574bc6841958324.jpg", "infoid": 1004003, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "IBM3270型终端是大型计算机终端。我长期以来一直对IBM的大型机着迷，尤其是这些终端。3278和3279等早期机型有独特的美学，它们的块状设计与无处不在的VT系列终端有很大的不同。\n我并不是唯一一个想要将真正的IBM终端连接到Hercules仿真器上的人。不幸的是，很难找到必要的带以太网或令牌环接口的IBM3174终端控制器，这是支持TCP/IP且处于工作状态的软件版本。此外，它们很大，噪音很大，而且很难维护，因为软件是从一张不常见的2.4MB 5.25英寸软盘上加载的-如果你幸运的话，还有一个20MB的硬盘选项。所以我决定建造我自己的，并在这个过程中学到一些东西。\n根据IBM的说法，3270信息显示系统于1972年推出，5年后的1977年成为标志性的3278终端。彩色终端于1979年与3279一起问世。将IBM型号和日期混为一谈非常令人困惑！\n3270是最易识别的面向块的终端之一。3270数据流允许程序员描述包含受保护文本、不受保护字段和格式属性的屏幕。不受保护的字段允许您输入或修改数据。终端不会像面向字符的终端那样立即将您按下的每个键都发送给主机，而是会存储输入，直到您按下注意键(如Enter)。只有当您按下注释键时，输入才会发送到主机，这样可以缩短缓慢或不可靠连接的感知响应时间。它还降低了主机处理要求，允许连接到主机的终端比面向字符的终端多得多。它与HTML表单没有太大不同。\n早期的3270终端上有令人兴奋的外围设备，包括用于改进导航和磁卡读卡器的光笔；不幸的是，我从未在eBay上看到过这些。\n在星形拓扑中，终端通过同轴电缆连接到控制器。Balun可以将此转换为更常见的双绞线布线，尽管我认为IBM更喜欢您使用他们的布线系统。控制器根据是本地控制器还是遥控器和年份通过不同的接口连接到主机，接口包括：\n因此，IBM 3174和3274控制器有许多不同的形状和大小-从小型台式设备、中型机架安装设备到大型落地式设备。\n包括Memorex在内的其他公司也生产兼容的终端和控制器。一旦个人计算机变得司空见惯，终端就可以被ISA、PCMCIA以及后来的PCI卡取代，PCI卡允许运行仿真器的PC使用相同的同轴电缆进行连接。后来，随着LAN和TCP/IP的出现，这些连接被不需要额外硬件或同轴电缆的TN3270 Telnet所取代。\n对于现在拥有TCP/IP网络但也拥有大量物理终端的客户，后来的3174控制器提供了通过TCP/IP上的Telnet将这些终端连接到大型机的能力。这些是您要连接到大力神的控制器。让我感兴趣的是，这些后来的控制器还提供了VT100仿真功能，3270终端可以通过telnet连接到UNIX或VMS主机，就像它是VT100一样。这对我来说似乎很奇怪；如果终端是面向块的，似乎不可能以一种有用的方式模拟VT100。\n最后一台IBM终端是20世纪90年代末推出的3483。到那时，该终端类似于瘦客户端，并使用行业标准的VGA显示器和PS/2键盘连接。\n我最初的搜索发现了所使用的电缆和3270数据流的描述，这是有详细记录的，但没有关于终端和控制器之间使用的协议的描述。直到我找到了用于构建PC接口的现已过时的芯片的数据表，我才从芯片和国家半导体公司(National Semiconductor)找到了我想要的细节：\n设备通过特性阻抗为93&Amp；Ohm的RG-62型同轴电缆进行点对点连接-与使用总线拓扑和50&Amp；Ohm阻抗电缆的10BASE2以太网不同。为了减少长电缆线路上的噪声干扰，使用了差分信令，该规范允许设备之间的距离长达1.5公里。\n使用MACHESTER编码以2.3587 Mb/s的比特率发送数据。该编码方案确保每个比特中间的转换(从高到低或从低到高)，从而允许接收器可靠地恢复数据。一帧包含一个或多个10位字；帧中的每个字以同步位开始，以奇偶校验位结束。唯一的序列指示帧的开始和结束。\n控制器发起所有通信；它向终端发送包含命令字和可选数据字(将其视为参数)的帧。终端用包含一个或多个数据字的帧进行响应。\n原来有两种不同类型的终端切割和DFT。切割型终端依靠控制单元来处理3270数据流，并将其转换为基本操作，例如将光标移动到该地址，并将这些字符写入显示缓冲器(称为再生缓冲器)。该控制器处理与3270终端相关的大部分智能人员，这意味着CUT终端逻辑比可比的VT100更简单。DFT类型的终端可以自己处理3270数据流，并且控制器将其传递给终端。\n你仍然可以在易趣上找到国家半导体DP8340发射器和DP8341接收器，所以我和数据手册参考电路中显示的其他元件一起购买了一些。我最初认为我必须从头开始建立一个接口，但这些发射器和接收器IC为我提供了数据链路层处理。\n我还找到了一个带令牌环接口的IBM3174-23R机架式控制器，我想我已经准备好出发了。不幸的是，控制程序软盘已损坏，只能加载诊断盘。诊断程序确实在终端上显示菜单，这足以捕获终端和控制器之间的一些流量进行分析。\n我根据DP8341数据表在面包板上构建了一个简单的接收器电路，将其连接到Arduino Mega上，并使用T形连接器连接控制器和终端之间的线路。当数据可用引脚第一次变高时，我非常兴奋，并且调用了我的中断处理程序。我花了一段时间才能可靠地从接收器读取数据。我很快就发现Arduino Mega；的8KB内存溢出了，而且数据速率太快，无法通过串口实时将数据卸载到我的PC上。\n我捕获的大部分消息都是来自控制器的轮询命令和来自终端的确认响应。因为控制器发起所有通信，所以它必须轮询终端以连续检查按键。过滤掉无按键消息后，我可以将终端返回的扫描码映射到键上。\n我还捕获了与显示缓冲区相关的LOAD ADDRESS COUNTER和WRITE DATA命令。提取地址很容易，但根据终端上显示的诊断界面，我没有看到以EBCDIC编码写入显示缓冲区的数据，它也不是ASCII。原来终端使用的是不同的字符编码，我不知道它叫什么，也找不到任何与它相关的信息。我从诊断界面获得了足够的示例，可以从捕获的数据构建大部分映射。当我将DP8340发送器添加到面包板时，在第一次写入后能够生成完整的映射。当然，hello world！\n3270终端在显示屏底部显示状态行。除当前光标位置外，状态行由控制器管理。令人困惑的是，状态行开始于显示缓冲器的地址0，尽管它位于屏幕的底部，但地址80是80列模式中的左上角单元。此外，状态行的字符编码是不同的，并且包括许多不寻常的符号。\n最终，我能够创建一个Python库pycoax来序列化和反序列化3270帧-Python代码在您的PC上运行，并通过串行(真正的USB)与Arduino通信。\n最后，我使用KiCad设计了我的第一个PCB，并将设计发送到JLCPCB。15美元，一周后，我准备好了5个Arduino盾牌，可以组装了。与面包板电路相比，PCB是一个相当大的改进，我注意到接收器错误显著减少。好的，我承认第一次有一个路线错误-我确实不得不订购一个修订版！\n我的目标是构建一个可以与Hercules一起使用的IBM3174控制器的替代品。现在我明白了切割型终端不会直接处理3270数据流，我意识到首先实现VT100仿真比实现TN3270更容易。\n我发现了pyte，它提供内存中的VT100仿真，我可以连接到进程(比如shell或SSH)。我所要做的就是轮询终端上的按键，将这些按键传递给进程，用进程输出更新pyte仿真器，然后将模拟的终端屏幕写入终端-需要一些映射。再重复一遍。除此之外，我还必须监视终端是否连接(通电)或断开，并监控进程运行状况。\n在内存昂贵的时代，像我这样在控制器内存中维护屏幕副本不是早期控制器的操作方式。取而代之的是，切割终端提供命令以从显示缓冲器读取并查找与特定模式匹配的单元，例如指示未受保护字段的开始的属性。没有同样的资源限制，我发现维护屏幕副本和使用更改的内容更新终端要容易得多。\n受pyte的启发，我编写了pytn3270，这是一个提供类似内存仿真的纯Python TN3270库。将其与控制器集成几乎不需要更改；我需要做的所有不同之处就是将字段属性映射到3270终端属性字节。我本来可以使用x3270，但我想更好地理解telnet协议和3270数据流。我只实现了最低限度的TN3270协议，但是连接到z/OS就足够了，一个纯Python库可能会在本项目之外派上用场。\n今天，OEC远不能提供IBM3174控制器的所有功能，但它是可用的。\n首先，我想添加一个连接菜单，以便您可以选择主机(它当前只能连接到单个主机)和多个逻辑终端支持。稍后的EAB和TN3270E支持-我需要实现一些缺少的pytn3270功能来支持这些功能。\n我正在研究一个基于FPGA的接口，它不依赖于过时的国家半导体IC-在这个过程中，我了解了更多关于协议和一些Verilog的知识。\n如果您对这些感兴趣，我很乐意收到您的来信。目前关于这些终端的信息很少，我可能把现存的东西和历史错误地拼凑在一起了-欢迎任何更正、澄清或其他信息！", "note_en": "The IBM 3270 type terminal is a mainframe computer terminal. I&#39;ve long been fascinated by the IBM mainframe, and especially these terminals. Early models such as the 3278 and 3279 have a unique aesthetic, and their block-oriented design is so different from the ubiquitous VT series terminals.\n    I&#39;m not alone in wanting to  connect a real IBM terminal to the Hercules emulator. Unfortunately, it&#39;s difficult to find the necessary IBM 3174 terminal controller with Ethernet or Token Ring interface, version of the software that supports TCP/IP and in working condition. Also, they are large, noisy, and difficult to maintain, given the software is loaded from an uncommon 2.4 MB 5¼-inch floppy disk - if you are lucky, there is a 20 MB hard disk option. So I decided to build my own and learn a little in the process.\n  According to IBM, the 3270 information display system was introduced in 1972, the iconic  3278 terminal 5 years later, in 1977. Color terminals arrived in 1979 with the 3279. Mixing IBM model numbers and dates is very confusing!\n  The 3270 is one of the most recognizable  block-oriented terminals. The  3270 data stream allows the programmer to describe a screen containing protected text, unprotected fields, and formatting attributes. Unprotected fields allow you to input or modify data. Instead of sending every key you press to the host immediately, as is the case with a character-oriented terminal, the terminal stores the input until you press an attention key - such as  enter. Only when you press an attention key is the input sent to the host, this improves the perceived response time over a slow or unreliable connection. It also reduces the host processing requirements allowing many more terminals to be connected to a host than could be with character-oriented terminals. It&#39;s not that different from an HTML form.\n  Exciting peripherals were available on early 3270 terminals, including light pens for improved navigation and magnetic card readers; unfortunately, I&#39;ve never seen these on eBay.\n  Terminals are connected to a controller by coax cable in a star topology. A balun can convert this to more common twisted pair cabling, although I think IBM would prefer you use their  cabling system. The controller is connected to the mainframe by different interfaces depending on whether it is a local or remote controller and year, interfaces include:\n    As a result, IBM 3174 and 3274 controllers come in many different shapes and sizes - from small desktop units, medium rack-mount, and large floor standing units.\n    Other companies, including Memorex, manufactured compatible terminals and controllers. Once personal computers became commonplace, terminals could be replaced with ISA, PCMCIA, and later PCI cards that allowed a PC running an emulator to connect using the same coax cable. Later, with the advent of LANs and TCP/IP, these connections were replaced with TN3270 telnet needing no additional hardware or coax cabling.\n  For customers that by now had a TCP/IP network but also a large number of physical terminals, the later 3174 controllers offered the ability to connect these terminals to the mainframe via telnet over TCP/IP. These are the controllers you want to connect to Hercules. It intrigued me that these later controllers also offered a VT100 emulation feature where a 3270 terminal could connect to a UNIX or VMS host via telnet as if it were a VT100. That seemed strange to me; if the terminal is block-oriented, it would seem impossible to emulate VT100 in a useful way.\n  The last IBM terminal was the 3483 introduced in the late 1990s. By then, the terminal resembled a thin-client and used industry-standard VGA display and PS/2 keyboard connections.\n  My initial search uncovered a description of the cabling used and the 3270 data stream, that is well-documented, but nothing about the protocol used between the terminal and the controller. It was not until I found datasheets for the now-obsolete chips used to build  PC interfaces that I found the detail I was looking for, from CHIPS and National Semiconductor:\n    Devices are connected point-to-point by coaxial cable with a characteristic impedance of 93 &amp;ohm, type RG-62 cable - unlike 10BASE2 Ethernet networks that use a bus topology and 50 &amp;ohm impedance cable. To reduce noise interference over long cable runs differential signaling is used, the specification allows up to 1.5 km between devices.\n  Data is sent at a bit rate of 2.3587 Mb/s using  Machester encoding. This encoding scheme ensures a transition (from high to low or low to high) in the middle of each bit, allowing the data to be recovered reliably by the receiver. A frame contains one or more 10-bit words; each word in a frame starts with a sync-bit and ends with a parity bit. Unique sequences indicate the start and end of a frame.\n    The controller initiates all communication; it sends a frame containing a command word and optional data words (think of these as parameters) to the terminal. The terminal responds with a frame containing one or more data words.\n  It turns out that there are two different types of terminal  CUT and  DFT. CUT type terminals rely on the control unit to process the 3270 data stream and convert this to basic operations such as move the cursor to this address and write these characters to the display buffer (known as the  regen buffer). The controller handles much of the intelligence people associate with 3270 terminals, meaning the CUT terminal logic is simpler than a comparable VT100. DFT type terminals can process the 3270 data stream themselves, and the controller passes this on to the terminal.\n  You can still find National Semiconductor DP8340 transmitters and DP8341 receivers on eBay, so I bought some along with the other components shown in the datasheet reference circuits. I had initially thought I&#39;d have to build an interface from scratch, but these transmitter and receiver ICs provided the data link layer handling for me.\n  I also found an IBM 3174-23R rack-mount controller with Token Ring interface and thought I was ready to go. Unfortunately, the control program floppy disk was corrupt, and only the diagnosis disk could be loaded. The diagnosis program did display menus on the terminal, which was sufficient to capture some traffic between the terminal and the controller for analysis.\n  I built a simple receiver circuit from the DP8341 datasheet on a breadboard, attached it to an Arduino Mega, and using a tee connector tapped the wire between controller and terminal. I was very excited when the  DATA AVAILABLE pin went high for the first time, and my interrupt handler was called. It took me a while to reliably read data from the receiver. I soon discovered I was overflowing the Arduino Mega&#39;s 8 KB of memory, and the data rate was too fast to to unload the data to my PC over the serial port in real-time.\n  The majority of the messages I captured were  poll commands from the controller and acknowledgment responses from the terminal. Because the controller initiates all communication, it has to poll the terminal to check for keypresses continually. After filtering out the no keypress messages, I was able to map the scan codes returned by the terminal to the keys.\n  I also captured  load address counter and  write data commands associated with the display buffer. Extracting the addresses was easy, but I did not see the data written to the display buffer in the  EBCDIC encoding that I expected based on the diagnosis interface shown on the terminal, it wasn&#39;t ASCII either. It turns out the terminal uses a different character encoding, I don&#39;t know what it&#39;s called and couldn&#39;t find any reference to it. I had enough examples from the diagnosis interface to build most of the mapping from captured data. When I added the DP8340 transmitter to the breadboard was able to generate a complete mapping after first writing &#34;hello world,&#34; of course!\n  3270 terminals have a status line shown at the bottom of the display. Other than the current cursor position, the status line is managed by the controller. Confusingly the status line starts at address  0 of the display buffer, although it is at the bottom of the screen, address  80 is the top-left cell in 80 column mode. Also, the character encoding for the status line is different and includes many unusual symbols.\n  Eventually, I was able to create a Python library,  pycoax, to serialize and deserialize 3270 frames - the Python code runs on your PC and communicates with the Arduino over serial (really USB).\n  Finally, I designed my first PCB using KiCad and sent the design off to  JLCPCB. $15 and a week later, I had 5 Arduino shields ready to assemble. The PCB was a considerable improvement over the breadboard circuit, and I noticed a dramatic reduction in receiver errors. Ok, I admit there was a routing mistake the first time around - I did have to order a revision!\n  My goal was to build a replacement for the IBM 3174 controller that I could use with Hercules. Now that I understood CUT type terminals don&#39;t process the 3270 data stream directly, I realized implementing VT100 emulation first would be easier than TN3270.\n  I found  pyte, which provides in-memory VT100 emulation that I could connect to a process (such as a shell or SSH). All I had to do was poll the terminal for keypresses, pass these to the process, update the pyte emulator with the process output and then write the emulated terminal screen to the terminal - some mapping required. And repeat. Other than that, I had to watch for a terminal being attached (powered on) or detached and monitor the process health.\n  Maintaining a copy of the screen in the controller memory as I do is not how early controllers operated in an era where memory was expensive. Instead, the CUT terminal provides commands to read from the display buffer and to find cells matching a particular pattern, such as an attribute indicating the start of an unprotected field. Without the same resource constraints, I found it far easier to maintain a copy of the screen and update the terminal with what changed.\n  Inspired by pyte, I wrote  pytn3270, a pure Python TN3270 library providing similar in-memory emulation. Integrating this with the controller required little change; all I had to do differently was to map the field attributes to the 3270 terminal attribute byte. I could have used x3270, but I wanted a better understanding of the telnet protocol and 3270 data stream. I&#39;ve only implemented the bare minimum of the TN3270 protocol, but it is enough to connect to z/OS, and a pure Python library may be useful beyond this project.\n  Today oec is far from providing all of the IBM 3174 controller features, but it is useable.\n  First, I want to add a connection menu so you can select the host (it can only currently connect to a single host) and multiple logical terminal support. Later EAB and TN3270E support - I&#39;ll need to implement some missing pytn3270 features to support those.\n  I&#39;m working on an FPGA based interface that doesn&#39;t depend on obsolete National Semiconductor ICs - learning a little more about the protocol and some Verilog in the process.\n  I&#39;d love to  hear from you if you are interested in any of this. There is very little out there currently about these terminals, I may have pieced what does exist and the history together incorrectly - any corrections, clarifications or additional information is welcome!", "posttime": "2020-05-28 08:04:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ibm3270,building,终端", "title": "构建IBM3270终端控制器", "title_en": "Building an IBM 3270 terminal controller", "transed": 1, "url": "https://ajk.me/building-an-ibm-3270-terminal-controller", "via": "", "real_tags": ["ibm3270", "building", "终端"]}, {"category": "", "categoryclass": "", "imagename": "6df6ff571c944ed2d5c0f8ccf96980b7.jpg", "infoid": 1004002, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在发布了40多个测试版和候选版本之后，我们非常兴奋地推出了SnowPack 2.0：一个用于现代网络的构建系统。\nSnowPack 1.0的设计目的很简单：安装直接在浏览器中运行的NPM包。当时的理论是，JavaScript包是在开发过程中唯一仍然需要使用捆绑器的东西。去掉这一要求，去掉捆绑包，加快每个人的web开发。\n你猜怎么着？啊，真灵!。数以千计的开发人员开始使用SnowPack来安装他们的依赖项，并使用更少的工具构建网站。一种全新的更快、更轻的开发突然成为可能。\nSnowPack 2.0是为这个web开发的新时代设计的构建系统。SnowPack从您的开发环境中删除了捆绑包，利用浏览器中的本地ES模块(ESM)语法直接提供构建的文件。这不仅仅是一个速度更快的工具，它还是Web构建系统的一种新方法。\n捆绑是一个O(N)复杂度的过程。随着项目的发展，您的开发捆绑程序需要更长的时间来启动并对更改做出反应。一些捆绑包甚至可能具有O(n^2)复杂度：随着项目的增长，您的开发环境会变得成倍地变慢，因为它在启动和每次更改时都要处理代码拆分、树抖动和其他捆绑包排列。在处理数百甚至数千个文件的开发期间，这两种情况都不理想。\nSnowPack是一个O(1)构建系统。这个术语最早是由Ives van Hoorne首创的，它完美地概括了我们的愿景：每个文件都通过线性输入&&gt；build-&gt；output build管道，然后输出到浏览器(或者最终的构建目录，如果您是为生产而构建的话)。多文件捆绑成为单文件构建步骤。\n最后一点很关键：每个构建的文件都被单独缓存并无限期地重用。如果您从不更改文件，则永远不需要重新构建它。\n运行Snowpack dev来启动新的web开发环境，您首先会注意到的是O(1)构建工具的速度有多快。积雪启动时间不到50毫秒。这不是打字错误：50毫秒或更少。\n无需开始捆绑工作，您的服务器将立即启动。在您的第一个页面加载时，Snowpack会构建您第一个请求的文件，然后缓存它们以备将来使用。即使您的项目包含一百万个不同的文件，SnowPack也只生成加载当前页面所需的文件。这就是积雪保持快速的原因。\nSnowPack dev包括一个开发服务器和一系列熟悉的开箱即用功能：\n构建脚本允许您连接您最喜欢的构建工具。使用SnowPack，您可以将每个构建表示为线性输入-&gt；构建-&gt；输出工作流。这允许Snowpack通过管道将您的文件传入和传出任何现有的UNIX-y CLI工具，而不需要特殊的插件生态系统。\n//nowPack.config.json{&#34；script&#34；：{//每&#34；*.css&34；文件通过PostCSS CLI//stdin(源文件)&gt；postcss&gt；stdout(生成输出)&#34；build：css&#34；：&#34；postcss&34；，}}。\n如果您曾经使用过您的Package.json“脚本”配置，那么您应该熟悉这种格式。我们喜欢直接使用CLI的简单性，不需要不必要的插件系统。我们希望这个模式能提供类似的直观设计。\n如果您希望更好地控制您的构建(或者希望编写您自己的构建工具)，SnowPack还支持第三方JavaScript插件。请查看我们的文档，了解有关自定义构建的更多信息。\n需要说明的是，SnowPack并不反对捆绑生产。事实上，我们推荐它。文件缩小、压缩、消除死码和网络优化都可以让捆绑站点为您的用户运行得更快，这是任何构建工具的最终目标。\nSnowPack将捆绑视为最终的、仅限生产的构建优化。通过将捆绑作为最后一步，您可以避免在同一个巨大的配置文件中混合使用构建逻辑和捆绑逻辑。取而代之的是，您的捆绑器获得已经构建的文件，并且可以只专注于它最擅长的事情：捆绑。\nSnowPack为webpack和Amp；Parcel维护官方插件。连接您最喜欢的网站，然后运行Snowpack Build来构建您的站点以用于生产。\n如果你不想用捆绑机，也没关系。SnowPack的默认构建将为您提供一个运行良好的非捆绑站点。这就是积雪项目从一开始就要做的：使用捆绑器是因为你想要，而不是因为你需要这样做。\n今天我们很高兴能与大家分享这一切。下载SnowPack，体验网络发展的未来。\n如果您已经有一个现有的SnowPack应用程序，SnowPack 2.0将指导您更新任何过时的配置。SnowPack最初的软件包安装程序仍然可以正常工作，并且通过新的dev&amp；build命令，Snowpack甚至可以为您管理您的Web软件包。\n开始使用积雪最简单的方法是创建积雪应用程序(CSA)。CSA使用预配置的雪地驱动开发环境自动为您初始化入门应用程序。\n感谢我们所有的80多位贡献者，感谢他们使这个版本成为可能。马云感谢Melissa McEwen&amp；@TheoOnTwitch帮助编辑了这篇帖子。", "note_en": "After 40+ beta versions &amp; release candidates we are very excited to introduce  Snowpack 2.0: A build system for the modern web.\n     Snowpack 1.0 was designed for a simple mission: install npm packages to run directly in the browser. The theory was that JavaScript packages are the only thing still   requiring the use of a bundler during development. Remove that requirement, remove the bundler, and speed up web development for everyone.\n Guess what? It worked! Thousands of developers started using Snowpack to install their dependencies and build websites with less tooling. A whole new type of faster, lighter-weight development suddenly became possible.\n Snowpack 2.0 is a build system designed for this new era of web development. Snowpack removes the bundler from your dev environment, leveraging native  ES Module (ESM) syntax in the browser to serve built files directly. This isn’t just a faster tool, it’s a new approach to web build systems.\n   Bundling is a process of  O(n) complexity. As your project grows, your dev bundler takes longer to startup and react to changes. Some bundlers may even have  O(n^2) complexity: as your project grows, your dev environment gets   exponentially slower as it handles code splitting, tree-shaking, and other bundle permutations on startup and on every change. Neither scenario is ideal during development when you’re working with hundreds or even thousands of files.\n Snowpack is a O(1) build system. The term was first coined by  Ives van Hoorne and it perfectly encapsulates our vision: Every file goes through a linear  input -&gt; build -&gt; output build pipeline and then out to the browser (or the final build directory, if you’re building for production). Mutli-file bundling becomes a single-file build step.\n   That last point is key: every built file is cached individually and reused indefinitely.  If you never change a file, you will never need to re-build it again.\n   Run  snowpack dev to start your new web dev environment and the first thing you’ll notice is  how flippin’ fast O(1) build tooling is. Snowpack starts up in less than 50ms. That’s no typo: 50 milliseconds or less.\n With no bundling work needed to start, your server spins up immediately. On your very first page load, Snowpack builds your first requested files and then caches them for future use. Even if your project contains a million different files, Snowpack only builds the files needed to load the current page. This is how Snowpack stays fast.\n snowpack dev includes a development server and a bunch of familiar features right out of the box:\n   Build Scripts let you connect your favorite build tools. With Snowpack, you express every build as a linear  input -&gt; build -&gt; output workflow. This allow Snowpack to pipe your files into and out of any existing UNIX-y CLI tools without the need for a special plugin ecosystem.\n // snowpack.config.json  {   &#34;scripts&#34; :  {   // Pipe every &#34;*.css&#34; file through the PostCSS CLI   // stdin (source file) &gt; postcss &gt; stdout (build output)   &#34;build:css&#34; :  &#34;postcss&#34; ,   }  }\n If you’ve ever used your  package.json “scripts” config, this format should feel familiar. We love the simplicity of using your CLIs directly without an unnecessary plugin system. We hope this pattern offers a similar intuitive design.\n If you want more control over your build (or want to write your own build tool) Snowpack also supports  third-party JavaScript plugins.  Check out our docs to learn more about customizing your build.\n   To be clear, Snowpack isn’t against bundling for production. In fact, we recommend it. File minification, compression, dead-code elimination and network optimizations can all make a bundled site run faster for your users, which is the ultimate goal of any build tool.\n Snowpack treats bundling as a final, production-only build optimization. By bundling as the final step, you avoid mixing build logic and bundle logic in the same huge configuration file. Instead, your bundler gets already-built files and can focus solely on what it does best: bundling.\n Snowpack maintains official plugins for both Webpack &amp; Parcel. Connect your favorite, and then run  snowpack build to build your site for production.\n  If you don’t want to use a bundler, that’s okay too. Snowpack’s default build will give you an unbundled site that also runs just fine. This is what the Snowpack project has been all about from the start:  Use a bundler because you want to, and not because you need to.\n  We are so excited to share this all with you today. Download Snowpack to experience the future of web development.\n  If you already have an existing Snowpack application, Snowpack 2.0 will walk you through updating any outdated configuration. Snowpack’s original package installer still works as expected, and with the new  dev &amp;  build commands Snowpack even manages your web packages for you.\n   The easiest way to get started with Snowpack is with  Create Snowpack App (CSA). CSA automatically initializes a starter application for you with a pre-configured, Snowpack-powered dev environment.\n     Thank you to all of our  80+ contributors for making this release possible. ma Thanks to  Melissa McEwen &amp;  @TheoOnTwitch for helping to edit this post.", "posttime": "2020-05-28 07:18:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "介绍,introducing,构建", "title": "介绍积雪2.0", "title_en": "Introducing Snowpack 2.0", "transed": 1, "url": "https://www.snowpack.dev/posts/2020-05-26-snowpack-2-0-release/", "via": "", "real_tags": ["介绍", "构建"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004000, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "htmx允许您使用属性在HTML中直接访问Ajax、WebSockets和Server Sent Event，因此您可以使用超文本的简单性和强大功能构建现代用户界面。\n&lt；！--从unpkg加载--&gt；&lt；Script src=&#34；https://unpkg.com/htmx.org@0.0.4&#34；&gt；&lt；/script&gt；&lt；！--让按钮通过AJAX发布单击--&gt；&lt；按钮HX-POST=&#34；/单击&#34；HX-SWAP=&#34；外部HTML&#34；&gt；单击我&lt；/按钮&gt；\n&#34；当用户单击此按钮时，向/CLICED发出AJAX请求，并将整个按钮替换为响应&#34；", "note_en": "htmx allows you to access  AJAX, WebSockets and  Server Sent Eventsdirectly in HTML, using  attributes, so you can build modern user interfaces with the  simplicity and power of hypertext\n   &lt;!-- Load from unpkg --&gt; &lt;script src=&#34;https://unpkg.com/htmx.org@0.0.4&#34;&gt;&lt;/script&gt; &lt;!-- have a button POST a click via AJAX --&gt; &lt;button hx-post=&#34;/clicked&#34; hx-swap=&#34;outerHTML&#34;&gt; Click Me &lt;/button&gt;\n  &#34;When a user clicks on this button, issue an AJAX request to /clicked, and replace the entire button with the response&#34;", "posttime": "2020-05-28 07:03:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,用于,high,ajax", "title": "htmx-用于HTML的高性能工具", "title_en": "htmx – high power tools for HTML", "transed": 1, "url": "https://htmx.org/", "via": "", "real_tags": ["性能", "用于", "high", "ajax"]}, {"category": "", "categoryclass": "", "imagename": "0b37347f047636e8d42e1c654625a8da.jpeg", "infoid": 1003999, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "空军一号(路透社)-白宫发言人周三表示，美国总统唐纳德·特朗普(Donald Trump)不久将签署一项关于社交媒体公司的行政命令。\n发言人凯莉·麦克纳尼(Kayleigh McEnany)在与特朗普一起从佛罗里达州前往华盛顿的空军一号上对记者发表了上述言论。一天前，推特公司(Twitter Inc)对特朗普的一些推文发出警告，促使读者对总统的说法进行事实核查。", "note_en": "ABOARD AIR FORCE ONE (Reuters) - U.S. President Donald Trump will sign an executive order shortly regarding social media companies, a White House spokeswoman said on Wednesday.\n Spokeswoman Kayleigh McEnany made the remark to reporters aboard Air Force One, traveling with Trump to Washington from Florida a day after Twitter Inc attached a warning to some of his tweets prompting readers to fact-check the president’s claims.", "posttime": "2020-05-28 07:02:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "媒体,sign", "title": "特朗普将签署针对社交媒体公司的行政令", "title_en": "Trump will sign an executive order on social media companies", "transed": 1, "url": "https://www.reuters.com/article/us-twitter-trump-executive-order/trump-will-sign-an-executive-order-on-social-media-companies-white-house-spokeswoman-idUSKBN2333BT", "via": "", "real_tags": ["媒体", "sign"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003998, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你在Facebook上关注我，你就会知道我每天都在发布冠状病毒的统计数据。我使用Johns Hopkins GitHub存储库中的每日更新来生成这些统计数据。\n起初，我只是手工将数据复制到电子表格中。但这很快就变得单调乏味了。\n然后，在3月下旬，我编写了一个小Clojure程序来提取和处理数据。每天早上我都会启动回购，然后运行我的小程序。它读取文件、计算数学并打印结果。\n但在过去的几周里，我对这个程序做了相当多的小修改；而且它已经有了很大的增长。在进行这些调整时，我选择使用不同的规程：REPL驱动的设计。\nREPL驱动的设计在Clojure圈子里非常流行。它也很有诱惑力。我们的想法是，您可以在REPL中尝试一些实验，以确保您有正确的想法。然后使用这些想法在代码中编写一个函数。最后，通过在REPL调用该函数来测试该函数。\n事实证明，这是一种非常令人满意的工作方式。周期时间-代码实验和REPL测试之间的时间-几乎与TDD一样小。这使人们对解决方案充满信心。它似乎还节省了模拟和创建假数据所需的时间，因为至少在我的情况下，我可以在REPL测试中使用真实的生产数据。因此，总体而言，我感觉自己比TDD走得更快。\n但后来，在4月下旬，我想做一些比往常更复杂的事情。这需要对我的基本结构进行设计更改。突然我发现自己充满了恐惧。我无法确保这些设计更改不会以某种方式破坏系统。如果我做了这些更改，我将不得不检查每一个输出，以确保它们都没有损坏。因此，我推迟了改革，直到我可以鼓起勇气，把需要的专门时间放在一边。\n这个变化并不太痛苦。Clojure是一种易于使用的语言。但验证并不是微不足道的，这导致我在部署程序时发现了一个小错误-4天后我捕捉到的一个小错误。这个错误迫使我回去更正我生成的数据和图表。\n为什么我需要修改设计？因为我没有嘲笑和创造假数据。我的函数只是直接从repo文件中读取。没有办法给他们传递假数据。我需要进行的设计更改与嘲笑和伪造数据所需的设计更改完全相同。\n如果我坚持TDD原则，我就会自动进行设计更改，就不会面临恐惧、延迟和错误。\n具有讽刺意味的是，TDD会强迫我进行的设计更改正是我最终需要的设计更改？不用谢。为了传递孤立的输入和收集孤立的输出，TDD强加给我们的解耦几乎总是强调灵活性和促进变化的设计。\n所以我已经吸取了教训。REPL驱动的开发感觉比TDD更容易、更快；但事实并非如此。下一次，我又回到TDD了。", "note_en": "If you follow me on facebook you know that I’ve been publishing daily CoronaVirus statistics. I generate these statistics using the daily updates in the Johns Hopkins github  repository.\n At first I just hand copied the data into a spreadsheet. But that became tedious quite rapidly.\n Then, in late March, I wrote a little Clojure program to extract and process the data. Every morning I pull the repo, and then run my little program. It reads the files, does the math, and prints the results.\n  But over the last several weeks I’ve made quite a few small modifications to the program; and it has grown substantially. In making these adaptations I chose to use a different discipline: REPL Driven Design.\n REPL Driven Design is quite popular in Clojure circles. It’s also quite seductive. The idea is that you try some experiments in the REPL to make sure you’ve got the right ideas. Then you write a function in your code using those idea. Finally, you test that function by invoking it at the REPL.\n It turns out that this is a very satisfying way to work. The cycle time – the time between a code experiment and the test at the REPL – is nearly as small as TDD. This breeds lots of confidence in the solution. It also seems to save the time needed to mock, and create fake data because, at least in my case, I could use real production data in my REPL tests. So, overall, it felt like I was moving faster than I would have with TDD.\n But then, in late April, I wanted to do something a little more complicated than usual. It required a design change to my basic structure. And suddenly I found myself full of fear. I had no way to ensure that those design changes wouldn’t leave the system broken in some way. If I made those changes, I’d have to examine every output to make sure that none of them had broken. So I postponed the change until I could muster the courage, and set aside the dedicated time it would require.\n The change was not too painful. Clojure is an easy language to work with. But the verfication was not trivial, which led me to deploy the program with a small bug – a bug I caught 4 days later. That bug forced me to go back and correct the data and graphs that I generated.\n Why did I need the design change? Because I was not mocking and creating fake data. My functions just read from the repo files directly. There was no way to pass them fake data. The design change I needed to make was precisely the same as the design change that I’d have needed for mocking and fake data.\n Had I stuck with the TDD discipline I would have automatically made that design change, and I would not have faced the fear, the delay, and the error.\n Is it ironic that the very design change that TDD would have forced upon me was the design change I eventually needed? Not at all. The decoupling that TDD forces upon us in order to pass isolated inputs and gather isolated outputs is almost always the design that fascilitates flexibility and promotes change.\n So I’ve learned my lesson. REPL driven development feels easier and faster than TDD; but it is not. Next time, it’s back to TDD for me.", "posttime": "2020-05-28 07:02:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,驱动,driven,tdd", "title": "REPL驱动的设计", "title_en": "REPL Driven Design", "transed": 1, "url": "http://blog.cleancoder.com/uncle-bob/2020/05/27/ReplDrivenDesign.html", "via": "", "real_tags": ["设计", "驱动", "driven", "tdd"]}, {"category": "", "categoryclass": "", "imagename": "9947574ad946f0dbe022efabe4ac64a4.jpg", "infoid": 1003997, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "西雅图-已故保罗·艾伦(Paul Allen)创立的地区文化机构，包括西纳马电影院和生活计算机博物馆+实验室，在瓦肯公司(Vulcan Inc.)之后面临永久关闭的可能性。周四宣布，将在今年年底前关闭火神艺术+娱乐公司和火神制作公司。\n在瓦肯的一份声明中，该组织提到了新冠肺炎大流行的破坏性影响，以及在2018年微软联合创始人艾伦去世后，需要继续评估其作为一个组织的演变。\n虽然持续的健康危机导致许多企业在州政府强制关闭期间关闭，但瓦肯的举动让人怀疑它的一些组织是否会回来。\n这一举措影响了历史悠久的西纳马博物馆(Cineama)，它正在进行因疫情而暂停的翻修；生活电脑：计算技术和互动展品的历史展示--博物馆+实验室(Museum+Labs)；西雅图现当代艺术博览会；华盛顿州埃弗雷特的飞行遗产和战斗装甲博物馆(Fly Heritage And Tighting Armor Museum)，等等。\n与世界各地的许多企业一样，新冠肺炎危机的经济影响要求瓦肯评估其规模和结构，以最大限度地提高效率和影响，并在我们的联合创始人去世后作为一个组织继续发展。我们已经做出了极其艰难的决定，在未来几个月内关闭两个部门，因为我们正在迈向一个将因大流行而以无法预测的方式改变的未来。这意味着我们将在今年年底前关闭瓦肯艺术+娱乐公司和瓦肯制作公司。\n这场大流行对许多企业和非营利组织都产生了毁灭性的影响，特别是那些依赖公共集会和特殊活动作为实现使命的一部分的企业。\n出于这个原因，“活着的计算机：博物馆+实验室”将暂时关闭，并在接下来的几个月里重新评估是否、如何以及何时重新开放。由于大流行，西内拉马的翻修已经暂停，在可预见的未来也将继续关闭。已经取消了2020年的西雅图艺术博览会，在决定任何进一步的计划之前，将需要一段时间看看形势和艺术世界日历的发展情况。同样，埃弗雷特的飞行遗产和战斗盔甲博物馆的董事会已经决定，它现在也将保持关闭，以评估是否、如何以及何时重新开放。我们还做出了永久关闭洛杉矶h俱乐部的极其艰难的决定，并开始了关闭伦敦原来的h俱乐部的提案程序。\nVulcan Productions今年将继续与他们值得信赖的合作伙伴和联合制片人合作，逐步结束和过渡项目，在我们逐步退出的过程中，尽最大努力为这些项目的成功做好准备。\n我们为数十万人受到这些独特的机构和电影项目的教育、娱乐和启发而感到自豪，它们的全球影响不可低估。Vulcan仍然致力于使世界变得更美好的使命，我们感谢每一位团队成员每天所表现出的奉献和承诺。正是通过他们的专业知识和对我们使命的热情，我们多年来在这些项目中取得了如此多的成就。\n艾伦的去世在西雅图的慈善艺术界留下了一个巨大的缺口，因为他是音乐、艺术、电影和科幻小说的长期拥护者，并根据这些热情花费了大量财富。\n在阿伦姐姐乔迪·艾伦的领导下，瓦肯的未来以及阿伦身边和亲爱的大量资产，包括西雅图海鹰队和波特兰开拓者队，都面临着不确定的几年。\n火神没有将流行文化博物馆(MoPOP)列为面临不确定性的组织之一，这是艾伦的另一件作品，火神表示，音乐和科幻博物馆是一个独立的501(C)3组织，不受这些决定的影响。\n艾伦在1998年收购的高科技电影院Cineama在2014年进行了一次重大的最先进的技术升级，并在2月份关闭，进行了更多的改变。由于当时被宣传为临时关闭，在新冠肺炎之前，瓦肯解雇了一批员工。\nGeekWire Space&amp；Science-获奖航空航天和科学编辑艾伦·博伊尔(Alan Boyle)每周头条", "note_en": "Seattle-area cultural institutions founded by the late Paul Allen, including the  Cinerama movie theater and  Living Computers Museum + Labs, face the possibility of permanent closure after Vulcan Inc. announced Thursday that it will wind down Vulcan Arts + Entertainment and Vulcan Productions by the end of the year.\n In a statement from Vulcan, the organization cited the devastating impact of the COVID-19 pandemic as well as the need to continue to assess its evolution as an organization following the 2018 death of Allen, the Microsoft co-founder.\n While the ongoing health crisis has caused numerous businesses to close during state-mandated lockdowns, Vulcan’s move called into question whether some of its organizations would ever return.\n  The move affects the historic Cinerama, which was undergoing renovations that had been halted by the pandemic; Living Computers: Museum + Labs, a historical showcase of computing technology as well as interactive exhibits;  Seattle Art Fair, a modern and contemporary art showcase in Seattle; the  Flying Heritage and Combat Armor Museum in Everett, Wash.; and more.\n  Like so many businesses worldwide, the economic impacts of the COVID-19 crisis require Vulcan to assess its size and structure to maximize effectiveness and impact, and continue to evolve as an organization following the death of our co-founder. We have made the extremely hard decision to close two divisions over the next several months as we move to a future that will be changed in untold ways by the pandemic. This means we are winding down both Vulcan Arts + Entertainment and Vulcan Productions by the end of the year.\n The pandemic has had devastating effects on many businesses and nonprofits alike, especially those that rely on public gatherings and special events as part of achieving their mission.\n For this reason, Living Computers: Museum + Labs will remain closed for now and spend the coming months reassessing if, how, and when to reopen. Cinerama’s renovation was already paused given the pandemic, and will also stay closed for the foreseeable future. The Seattle Art Fair, which was already cancelled for 2020, will take some time to see how the situation and art world calendar evolve before deciding any further plans. And similarly, the board of the Flying Heritage and Combat Armor Museum in Everett has decided it will also remain closed for now to evaluate if, how, and when to reopen. We have also made the extremely difficult decision to permanently close h Club LA and are beginning the proposal process toward closing the original h Club in London.\n Vulcan Productions will continue to work with their trusted partners and co-producers to wind down and transition projects this year, doing their best to set these projects up for success as we make a gradual exit.\n We are proud of the hundreds of thousands of people that have been educated, entertained, and inspired by these unique institutions and film projects, and their global impact cannot be underestimated. Vulcan remains committed to its mission of making and leaving the world a better place, and we are grateful to each and every team member for the dedication and commitment they have exhibited on a daily basis. It is through their expertise and passion for our mission that we have accomplished so much in these projects throughout the years.\n Allen’s death left a gaping hole in Seattle’s philanthropic arts scene, as he was a longtime champion of music, art, film and science fiction, and spent large sums of his wealth in accordance with those passions.\n The future of Vulcan and the vast array of holdings near and dear to Allen, including the Seattle Seahawks and Portland Trail Blazers, have  faced an uncertain couple of years under the leadership of Allen’s sister, Jody Allen.\n  The Museum of Pop Culture, or MoPOP, another Allen creation, was not listed by Vulcan among the organizations facing uncertainty, and Vulcan said the music and sci-fi museum is an independent 501(c)3 organization that is not impacted by the decisions.\n Cinerama, the high-tech movie theater that Allen purchased in 1998, underwent a major start-of-the-art technology upgrade in 2014 and was  closed for more changes in February. With what was billed as a temporary closure at the time, before COVID-19, Vulcan laid off a number of employees.\n      GeekWire Space &amp; Science - Weekly headlines from Alan Boyle, award-winning aerospace and science editor", "posttime": "2020-05-28 06:31:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电影,电影院,seattle,关闭", "title": "西雅图电影院和生活计算机博物馆的未来悬而未决", "title_en": "Future of Seattle’s Cinerama and Living Computers Museum in Doubt", "transed": 1, "url": "https://www.geekwire.com/2020/paul-allens-vulcan-inc-shuttering-divisions-impact-cinerama-cultural-institutions/", "via": "", "real_tags": ["电影", "电影院", "seattle", "关闭"]}, {"category": "", "categoryclass": "", "imagename": "78a4bff214844f9aaec3cd17cf4cd57e.jpg", "infoid": 1003996, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一款真正令人惊叹的视频游戏结合了巧妙的代码、华丽的图形和巧妙的动画-外加数千小时的辛勤工作。\n国际足联(FIFA)、狂人(Madden)和其他流行游戏背后的艺电公司(Electronic Arts)的研究人员正在测试人工智能的最新进展，以此来加快开发进程，使游戏更逼真。一个巧妙的转折是，研究人员正在利用一种人工智能技术，通过玩一些最早的游戏机视频游戏来证明自己。\n来自EA和温哥华不列颠哥伦比亚大学的一个团队正在使用一种名为强化学习的技术，这种技术大致上是受到动物对正面和负面反馈做出反应的学习方式的启发，以自动制作类人角色的动画。“结果非常非常有希望，”艺电高级软件工程师法比奥·津诺(Fabio Zinno)说。\n传统上，视频游戏中的角色和他们的动作都是手工制作的。国际足联(FIFA)等体育游戏利用动作捕捉(Motion Capture)，这是一种涉及跟踪真人的技术，通常使用真人脸上或身体上的标记来呈现更逼真的人类角色动作。但可能性受到已经录制的动作的限制，仍然需要编写代码来为角色设置动画。\n例如，通过自动化动画过程以及游戏设计和开发的其他元素，人工智能可以为游戏公司节省数百万美元，同时使游戏更加逼真和高效，这样一款复杂的游戏就可以在智能手机上运行。\n近年来，强化学习通过让计算机在没有任何指导的情况下学会玩复杂的游戏和解决令人烦恼的问题而激起了人们的兴奋。2013年，后来被谷歌(Google)收购的英国公司DeepMind的研究人员利用强化学习创建了一个计算机程序，该程序学会了将几款雅达利(Atari)视频游戏玩到超人的水平。该程序通过实验以及像素和游戏分数的反馈学会了玩游戏。DeepMind后来使用同样的技术构建了一个程序，该程序掌握了极其复杂和微妙的棋类游戏围棋等。\n在7月份将在计算机图形学会议Siggraph 2020上展示的工作中，EA-UBC的研究人员展示了强化学习可以创造出一种可控的足球运动员，无需使用传统的编码或动画就可以真实地移动。\n为了制作这个角色，研究小组首先训练了一个机器学习模型，以识别和复制动作捕捉数据中的统计模式。然后，他们使用强化学习来训练另一个模型，以再现具有特定目标的真实运动，例如在游戏中向球跑去。重要的是，这会生成原始运动捕捉数据中找不到的动画。换句话说，该程序学习足球运动员如何移动，然后可以自行设置角色慢跑、冲刺和摆动的动画。\n纽约大学(NYU)教授朱利安·托格利厄斯(Julian Togelius)说：“我绝对可以看到这项技术在不同方面都很有用。”他也是一家为游戏制造人工智能工具的公司a Modl.ai的联合创始人。他补充说，强化学习项目是自动化或“程序生成”方法浪潮的一部分，这些方法将改变游戏内容的创建方式。\n托格利厄斯说：“程序化动画将是一件大事。”“它基本上自动化了构建游戏内容的大量工作。”\n随着游戏机、个人电脑和智能手机变得越来越强大，游戏将变得越来越复杂和复杂，需要游戏公司进行更大的投资。现有的工具可以帮助设计师和动画师提高效率，但每一步都需要它们。就像人工智能可以在输入足够的数据时炮制出照片级的面孔和场景一样，算法可能会自动创建新的角色和场景。\n人工智能可以为其他流派生成内容，包括动作和角色扮演游戏。一些游戏公司正在试验程序生成，以此作为使游戏更具扩展性的一种方式。一种简单的方法被用来生成新的世界，供玩家在2016年发布的太空生存游戏“无人的天空”中探索。Togelius说，人工智能也正在成为一种使用人造玩家测试游戏和发现错误的强大方式。\n在光谱的另一端，人工智能有可能从头开始生成简单的视频游戏。周五，来自多伦多大学(University Of Toronto)、麻省理工学院(MIT)和制造游戏芯片的英伟达(Nvidia)的研究人员披露了一款人工智能引擎，它学会了如何在没有任何原始代码的情况下重现经典游戏吃豆人(Pac-Man)。\n在街机游戏发布40周年之际，研究人员展示了一个名为GameGan的程序如何通过观察屏幕并监控5万个吃豆人游戏期间使用的控件来重现简单的游戏。GameGan随后生成了自己的版本，包括新的场景和平台。\nPac-Man背后的Namco公司的10名工程师花了17个月的时间来设计、编程和测试最初的游戏。如果提供足够的数据，这样的算法最终可能会创造出一款引人注目的新游戏--“愤怒的小鸟”或“糖果粉碎传奇”，没有人需要编写代码。\n多伦多大学(University Of Toronto)助理教授、英伟达(Nvidia)人工智能主任桑贾·菲德勒(Sanja Fidler)表示：“你可以想象在许多游戏上训练它-数千种不同的游戏。”“人们会希望，现在你能以某种方式将不同游戏中的不同东西混合在一起，并插入其中。”\nEA的Zinno说，游戏开发者可能需要几年时间才能例行公事地使用人工智能，部分原因是机器学习算法很难理解和调试。他指出，证据将在由此产生的游戏的受欢迎程度中得到证明：“游戏开发就是它自己的野兽。不管你的动画技术有多不可思议，关键是，玩起来好玩吗？“。\n参与EA项目的UBC教授Michiel van de Panne说，下一步是使用强化学习在物理现实环境中训练非人类的视频游戏角色。但他承认，训练算法从头开始制作全新的动画将更加困难，因为很难量化玩家会发现什么是有吸引力的。Van de Panne说：“我在等着看真正充分利用人工智能来生成动画的东西。”“但它肯定会来的。”\n👁大脑是人工智能的有用模型吗？另外：获取最新的人工智能新闻。\n🏃🏽‍♀️想要最好的健康工具吗？看看我们Gear团队挑选的最好的健身跟踪器、跑步装备(包括鞋子和袜子)和最好的耳机", "note_en": "A truly kick-ass videogame combines clever code, gorgeous graphics, and artful animation—plus thousands of hours of hard work.\n Researchers at  Electronic Arts—the company behind   FIFA,   Madden, and other popular games—are testing recent advances in  artificial intelligence as a way to speed the development process and make games more lifelike. And in a neat twist, the researchers are harnessing an AI technique that proved itself by playing some of the earliest console videogames.\n A team from EA and the University of British Columbia in Vancouver is using a technique called  reinforcement learning, which is loosely inspired by the way animals learn in response to positive and negative feedback, to automatically animate humanoid characters. “The results are very, very promising,” says Fabio Zinno, a senior software engineer at Electronic Arts.\n  Traditionally, characters in videogames and their actions are crafted manually. Sports games, such as  FIFA, make use of  motion capture, a technique that involves tracking a real person often using markers on their face or body, to render more lifelike actions in human characters. But the possibilities are limited by the actions that have been recorded, and code still needs to be written to animate the character.\n By automating the animation process, as well as other elements of game design and development, AI could save game companies millions of dollars while making games more realistic and efficient, so that a complex game can run on a smartphone, for example.\n  Reinforcement learning has sparked excitement in recent years by letting computers learn to play complex games and solve vexing problems without any instruction. In 2013, researchers at  DeepMind, a UK company later acquired by Google, used reinforcement learning to create a computer program that  learned to play several Atari videogames to a superhuman level. The program learned to play through experimentation and feedback from the pixels and the game score. DeepMind later  employed the same technique to build a program that  mastered the fiendishly complex and subtle board game Go, among other things.\n  In work to be presented in July at  Siggraph 2020, a computer graphics conference, the EA-UBC researchers show that reinforcement learning can  create a controllable soccer player that moves realistically without using conventional coding or animation.\n  To make the character, the team first trained a  machine-learning model to identify and reproduce statistical patterns in motion-capture data. They then used reinforcement learning to train another model to reproduce realistic motion with a specific objective, such as running toward a ball in the game. Crucially, this produces animations not found in the original motion-capture data. In other words, the program learns how a soccer player moves, and can then animate the character jogging, sprinting, and shimmying by itself.\n “I can definitely see this technology being useful in different ways,” says  Julian Togelius, a professor at NYU and the cofounder of a  Modl.ai, a company that makes AI tools for games. He adds that the reinforcement learning project is part of a wave of automated or “procedural generation” methods that will transform how game content is created.\n “Procedural animation will be a huge thing,” Togelius says. “It basically automates a lot of the work that goes into building game content.”\n As consoles, PCs, and smartphones become ever-more powerful, games will become increasingly sophisticated and complex, requiring greater investment from game companies. Existing tools can help make designers and animators more efficient, but they’re still needed at every step. Just as AI can concoct photo-realistic  faces and  scenes when fed enough data, algorithms may automate the creation of new characters and scenes.\n AI could generate content for other genres, including action and role-playing games. Some game companies are experimenting with procedural generation as a way to make games more expansive. A simple method is used to generate new worlds for players to explore in   No Man’s Sky, a space-based survival game released in 2016. Togelius says AI is also emerging as a powerful way to test games and find bugs, using artificial players.\n  At the other end of the spectrum, there’s potential for AI to generate simple videogames from scratch. On Friday, researchers from the University of Toronto, MIT, and  Nvidia, which makes gaming chips, revealed an AI engine that learned how to recreate the classic game  Pac-Man without any of the original code.\n  On the  40th anniversary of the arcade game’s release, the researchers showed how a program called  GameGAN can recreate simple games by watching the screen and monitoring the controls used during 50,000 games of  Pac-Man. GameGAN then generated its own version, complete with new scenarios and platforms.\n  It took 10 engineers at Namco, the company behind  Pac-Man, 17 months to design, program, and test the original game. If fed enough data, such an algorithm might eventually fashion a compelling new game—an  Angry Birds or  Candy Crush that no one needed to code.\n “You can imagine training it on many games—thousands of different games,” says  Sanja Fidler, an assistant professor at the University of Toronto and director of AI at Nvidia. “And one would hope that now you can somehow mash up and interpolate different things from different games.”\n Zinno of EA says it may be several years before game developers routinely use AI, partly because machine-learning algorithms are tricky to understand and debug. The proof will be in the popularity of the resulting games, he notes: “Game development is its own beast. No matter how incredible your animation technology, the point is, is it fun to play?”\n Michiel van de Panne, a professor at UBC who is involved in the EA project, says the next step is to use reinforcement learning to train nonhuman videogame characters inside physically realistic environments. But he acknowledges it will be more difficult to train algorithms to come up with entirely new animation from scratch, because it is difficult to quantify what players will find appealing. “I’m waiting to see something that really takes full advantage of AI for the generation of animation,” van de Panne says. “But it will come for sure.”\n   👁 Is the brain a  useful model for AI? Plus:  Get the latest AI news\n 🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2020-05-28 06:16:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,游戏,人工智能,制作,inject", "title": "游戏制作人注入人工智能以开发更逼真的角色", "title_en": "Gamemakers Inject AI To Develop More Lifelike Characters", "transed": 1, "url": "https://www.wired.com/story/game-makers-inject-ai-develop-more-lifelike-characters/", "via": "", "real_tags": ["开发", "游戏", "人工智能", "制作", "inject"]}, {"category": "", "categoryclass": "", "imagename": "ecd2506e767922c9713a626ebdc9df18.png", "infoid": 1003994, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "部分Word功能無法於“谷歌文件”顯示。如果您作出變更，有關內容可能會被移除.", "note_en": "部分 Word 功能無法於「Google 文件」顯示。如果您作出變更，有關內容可能會被移除。", "posttime": "2020-05-28 05:59:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,自助式,bootstrapped,變更", "title": "我要卖我的自助式SaaS项目。目前的MRR为2500美元，而且还在不断增长", "title_en": "I'm selling my bootstrapped SaaS project. Currently doing $2500 MRR and growing", "transed": 1, "url": "https://docs.google.com/document/d/1BwBZUhgTLJTIXPV6GhC4ihBodlmjdJ0lH_vW9xoKxKA/edit?usp=sharing", "via": "", "real_tags": ["app", "自助式", "變更"]}, {"category": "", "categoryclass": "", "imagename": "0033f61c541dbe022aa163d2689519e4.png", "infoid": 1003993, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于初级系统管理员(或心烦意乱的人)来说，😆😣", "note_en": "For the junior sysadmins (or the distracted ones) 😆😣", "posttime": "2020-05-28 05:59:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "系统管理员,memes,心烦意乱", "title": "系统管理员的迷因", "title_en": "Memes for Sysadmins", "transed": 1, "url": "https://sysadminmemes.com/", "via": "", "real_tags": ["系统管理员", "memes", "心烦意乱"]}, {"category": "", "categoryclass": "", "imagename": "59f5d937570b5b372ac725cea83cafe2.jpg", "infoid": 1003992, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SpaceX和OneWeb已经请求美国允许向近地轨道发射数万颗额外的卫星。\n除了已经获得许可的近12000颗卫星之外，SpaceX还申请发射3万颗卫星，这与SpaceX之前宣布的Starlink计划是一致的。\nOneWeb申请发射近4.8万颗卫星令人惊讶，因为这家卫星宽带公司在3月份申请破产。在目前的结构下，OneWeb不太可能发射很大比例的卫星，因为据报道，该公司在申请破产时裁减了大部分员工，并表示打算利用破产程序出售业务，以实现公司价值的最大化。获得联邦通信委员会的批准，发射更多卫星可能会提高OneWeb的资产价值，并为收购该公司的人提供更多选择。\nOneWeb在其FCC申请中表示，OneWeb已经获得债务人占有融资，预计很快就会退出破产法第11章的程序，使OneWeb的战略资产价值最大化，并确保其利益相关者和客户有一条可行的前进道路。\n由于FCC的最后期限，SpaceX和OneWeb的申请是昨天提交的。其他供应商，如Telesat(1671颗卫星)、开普勒(360颗卫星)和Viasat(288颗卫星)提交了较小的低地球轨道星座申请。Mangata Networks提交了791颗中地球轨道卫星的申请。\n重要的是要明白，OneWeb申请这么多卫星的原因是，这将使其他努力变得更加困难，特别是(对亚马逊的子公司)Kuiper，从而有可能提高OneWeb的第一代许可证的价值。卫星行业顾问蒂姆·法勒(Tim Farrar)在Twitter上写道，这与SpaceX提出的30K卫星提案的理由类似。\nFCC规定，除非获得豁免，否则卫星许可证持有人可以在6年内发射50%的许可卫星，并在9年内发射所有卫星。\nOneWeb已经获得了发射720颗卫星的许可，其申请寻求由47,844颗卫星组成的第二阶段的授权。OneWeb没有要求改变其1200公里的轨道高度。该公司在本文件中向FCC提供了有关其计划的更多技术细节。\nOneWeb写道，由于联合轨道的使用，OneWeb卫星基本上覆盖了地球表面的所有部分，因此，原则上讲，它们有能力为地球上所有位置提供服务。地球表面的每一点都会看到高度不低于55º的OneWeb卫星，最小仰角随纬度增加。例如，阿拉斯加的用户总会体验到明显高于55º的仰角。\n与轨道约35000公里的地球静止卫星相比，低地球轨道卫星预计将提供更低的延迟和更快的速度。OneWeb表示，它的用户往返延迟将不到50毫秒，大约是GSO(地球静止轨道)卫星延迟的1/13，与地面网络相当。OneWeb还表示，其技术可以提供32ms的平均延迟。\nSpaceX公开预测其服务的延迟低于20ms，但该公司在向FCC申请时也使用了低于50ms的数字，并表示消费者几乎不会注意到这个延迟水平。FCC测量到康卡斯特在高峰时段的延迟中值略高于20ms，而Verizon FiOS的中值延迟略高于10ms。\nSpaceX提交给联邦通信委员会的文件称，其拟议的3万颗卫星将用于第二代系统，该系统建立在该公司目前部署的第一代系统之上。在拟议的30,000颗卫星中，超过85%的卫星将在400公里以下的极低高度运行，使用8颗总轨道高度从328公里到614公里不等的卫星。\n就像新的增密型5G网络的大规模部署正在帮助那些处于更多城市环境中的人一样，SpaceX提出的增密型卫星星座将大幅增加容量，并推动即使在农村和偏远地区也能接入真正强大宽带的消费者数量。虽然SpaceX的下一代星座将只使用地面技术部署的天线数量的一小部分，但其频谱效率高的设计和密集的频谱重用将使其能够为农村地区带来以前仅为城市客户保留的服务类型和价格。\n通过在低海拔和极低海拔运行，SpaceX Gen2系统将实现更小的光斑波束和更大的卫星分集，实现提高世界任何地方可用容量所需的密集频率重用。SpaceX的下一代系统保证了位于地面任何地点的每个客户都能看到多颗卫星，从而具备了与其他频谱用户协调所需的灵活性，同时仍能提供强大的服务，即使在拥挤的频谱环境中也是如此。\n在申请破产之前，OneWeb已经发射了74颗卫星。到目前为止，SpaceX已经发射了大约420颗卫星，目标是在今年晚些时候提供服务，刚刚与美国陆军签署了一项协议，测试Starlink用于军事用途。", "note_en": "SpaceX and OneWeb have asked for US permission to launch tens of thousands of additional satellites into low Earth orbit.\n SpaceX&#39;s application to launch 30,000 satellites—in addition to the nearly 12,000 it already has permission for—is consistent with  SpaceX&#39;s previously announced plans for Starlink.\n OneWeb&#39;s  application to launch nearly 48,000 satellites is surprising because the satellite-broadband company  filed for bankruptcy in March. OneWeb is highly unlikely to launch a significant percentage of these satellites under its current structure, as the company  reportedly &#34;axed most of its staff&#34; when it filed for bankruptcy and says it intends to use bankruptcy proceedings &#34;to pursue a sale of its business in order to maximize the value of the company.&#34; Getting FCC approval to launch more satellites could improve the value of OneWeb&#39;s assets and give more options to whoever buys the company.\n &#34;OneWeb has already secured debtor-in-possession financing and expects to soon exit the Chapter 11 process in a manner that maximizes the value of OneWeb&#39;s strategic assets and also ensures a viable path forward for its stakeholders and customers,&#34; the company said in its FCC application.\n The SpaceX and OneWeb applications were filed yesterday because of an  FCC deadline. Other providers such as Telesat ( 1,671 satellites), Kepler ( 360 satellites), and Viasat ( 288 satellites) filed applications for smaller low-Earth-orbit constellations. Mangata Networks filed an  application for 791 satellites in medium-Earth orbits.\n &#34;It&#39;s important to understand that the reason OneWeb filed for so many satellites is that it will make others&#39; efforts more difficult, especially [for  Amazon subsidiary] Kuiper, and thereby potentially enhance the value of OneWeb&#39;s first gen license. Similar rationale to SpaceX&#39;s 30K satellite proposal,&#34; satellite-industry consultant Tim Farrar  wrote on Twitter.\n FCC rules give satellite licensees six years to launch 50 percent of licensed satellites and nine years to launch all of them, unless a waiver is granted.\n  OneWeb already had permission to launch 720 satellites, and its application seeks authorization of a second phase consisting of 47,844 satellites. OneWeb did not ask for a change in its orbital altitude of 1,200km. The company provided the FCC with more technical details on its plan in  this document.\n &#34;Because of the use of combined orbits, the OneWeb satellites essentially pass over all parts of the Earth&#39;s surface and therefore, in principle, have the ability to provide service to all Earth locations,&#34; OneWeb wrote. &#34;Every point on the Earth&#39;s surface will see, at all times, a OneWeb satellite at an elevation no less than 55º, with increasing minimum elevation angles with latitude. For instance, users in Alaska will always experience elevation angles significantly higher than 55º.&#34;\n Low-Earth-orbit satellites are expected to provide much lower latency and faster speeds than geostationary satellites that orbit at about 35,000km. OneWeb said its users &#34;will experience round-trip latency of less than 50 milliseconds, which is approximately 1/13th of the latency of GSO [geo-stationary orbit] satellites, and comparable to terrestrial networks.&#34; OneWeb has also  said its technology can provide average latency of 32ms.\n SpaceX has publicly  predicted sub-20ms latency for its service, but the company also used a sub-50ms figure in its application to the FCC and said this level of latency &#34;is nearly unnoticeable to consumers.&#34; The FCC has  measured Comcast&#39;s median latency at just over 20ms during peak usage hours and Verizon FiOS at just over 10ms.\n SpaceX&#39;s FCC filing says its proposed 30,000 satellites would be for a &#34;Gen2 System&#34; that builds on the first-generation system the company is currently deploying. More than 85 percent of the proposed 30,000 satellites would &#34;operate at very low altitudes below 400km, using eight total orbital altitudes ranging from 328km to 614km.&#34;\n  Just as large deployments of new densified 5G networks are helping those in more urban environments, the densified satellite constellation SpaceX proposes will substantially increase capacity and drive up the number of consumers even in rural and remote areas with access to truly robust broadband. While SpaceX&#39;s next-generation constellation will use only a small fraction of the number of antennas being deployed for terrestrial technologies, its spectrally efficient designs and intensive spectral reuse will allow it to bring to rural areas the type of services and prices previously reserved only for urban customers.\n By operating at low and very low altitudes, the SpaceX Gen2 System will enable smaller spot beams and greater satellite diversity, achieving the intensive frequency reuse needed to heighten capacity available anywhere in the world. And by guaranteeing multiple satellites in view for every customer located at any point on the ground, SpaceX&#39;s next-generation system incorporates the flexibility necessary to coordinate with other spectrum users while still delivering robust service, even in a crowded spectrum setting.\n OneWeb had launched 74 satellites before filing for bankruptcy. SpaceX has launched about  420 satellites so far, is aiming to provide service later this year, and just  signed a deal with the US Army to test Starlink for military use.", "posttime": "2020-05-28 05:59:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "申请,oneweb,卫星", "title": "破产的OneWeb为48,000颗卫星申请牌照", "title_en": "Bankrupt OneWeb seeks license for 48,000 satellites", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/05/spacex-and-oneweb-seek-licenses-to-launch-78000-broadband-satellites/", "via": "", "real_tags": ["申请", "oneweb", "卫星"]}, {"category": "", "categoryclass": "", "imagename": "aaba03073006f7d91342f5066d42f863.jpg", "infoid": 1003991, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "学者们说，他们在Linux、MacOS、Windows和FreeBSD等操作系统使用的USB驱动程序堆栈中发现了26个新漏洞。\n由普渡大学(Purdue University)的惠鹏(音译)和瑞士洛桑联邦理工学院的马蒂亚斯·佩耶(Mathias Payer)组成的研究团队表示，所有的漏洞都是通过他们创建的一种名为USBFuzz的新工具发现的。\n这个工具就是安全专家所说的绒毛器。模糊器是允许安全研究人员将大量无效、意外或随机数据作为输入发送到其他程序的应用程序。\n然后，安全研究人员分析测试的软件如何发现新的漏洞，其中一些漏洞可能会被恶意利用。\n为了测试USB驱动程序，彭和佩耶开发了USBFuzz，这是一种专门为测试现代操作系统的USB驱动程序栈而设计的新的Fuzz。\n研究人员说，USBFuzz的核心是使用软件模拟的USB设备向驱动程序提供随机设备数据(当他们执行IO操作时)。\n由于模拟的USB设备在设备级别工作，因此将其移植到其他平台非常简单。&#34；\n这使得研究小组不仅可以在大多数Fuzzer程序工作的Linux上测试USBFuzz，还可以在其他操作系统上测试USBFuzz。研究人员表示，他们对USBFuzz进行了测试：\n9 Linux内核的最新版本：v4.14.81、v4.15、v4.16、v4.17、v4.18.19、v4.19、v4.19.1、v4.19.2和v4.20-rc2(评估时的最新版本)。\n在他们的测试之后，研究小组说，在USBFuzz的帮助下，他们总共发现了26个新的漏洞。\n研究人员在FreeBSD中发现了一个漏洞，在MacOS中发现了三个漏洞(两个导致计划外重启，一个系统冻结)，在Windows 8和Windows 10中发现了四个漏洞(导致蓝屏死亡)。\n然而，绝大多数且最严重的错误都是在Linux中发现的--总共18个。\n16个是各种Linux子系统(USB核心、USB声音和网络)中具有高安全性影响的内存错误，一个错误驻留在Linux USB主机控制器驱动程序中，最后一个驻留在USB相机驱动程序中。\n彭和佩耶说，他们向Linux内核团队报告了这些错误，并提出了修补漏洞的补丁，以减轻内核开发人员在修复报告的漏洞时的负担。\n研究小组表示，在18个Linux漏洞中，有11个自去年首次报告以来收到了补丁。这11个漏洞中有10个还收到了CVE，这是一个分配给主要安全漏洞的独特代码。\n研究人员说，剩下的漏洞分为两类：仍在禁运或正在披露的漏洞，以及那些同时被其他研究人员发现和报告的漏洞。\nPayer昨天公布了研究团队的白皮书草稿，描述了他们在USBFuzz上的工作。彭和佩耶计划在定于2020年8月举行的Usenix安全研讨会虚拟安全会议上展示他们的研究成果。\n过去也进行过类似的工作。2017年11月，一名谷歌安全工程师使用谷歌制造的名为syzkaller的Fuzzer发现了79个影响Linux内核USB驱动程序的漏洞。\nPeng和Payer表示，USBFuzz优于之前的工具，如vUSBf、syzkaller和usb-fuzzer，因为它们的工具为测试人员提供了对测试数据的更多控制，而且还可以跨操作系统移植，而不像上面所有的工具通常只能在*Nix系统上工作。\nUSBFuzz计划在Peng和Payer的Usenix Talk之后作为开源项目在GitHub上发布。回购将在这里提供。\nPeng和Payer的论文名为“USBFuzz：A Framework for Fuzing USB Drivers by Device Emulation”(USBFuzz：A Framework for Fuzing USB Drivers by Device Emulation)，这里和这里都有PDF格式的文章。", "note_en": "Academics say they discovered 26 new vulnerabilities in the USB driver stack employed by operating systems such as Linux, macOs, Windows, and FreeBSD.\n The research team, made up by Hui Peng from Purdue University and Mathias Payer from the Swiss Federal Institute of Technology Lausanne, said all the bugs were discovered with a new tool they created, named  USBFuzz.\n The tool is what security experts call a  fuzzer. Fuzzers are applications that let security researchers send large quantities of invalid, unexpected, or random data as inputs to other programs.\n Security researchers then analyze how the tested software behaves to discover new bugs, some of which may be exploited in a malicious way.\n  To test USB drivers, Peng and Payer developed USBFuzz, a new fuzzer specifically designed to test the USB driver stack of modern-day operating systems.\n   &#34;At its core, USBFuzz uses a software-emulated USB device to provide random device data to drivers (when they perform IO operations),&#34; the researchers said.\n &#34;As the emulated USB device works at the device level, porting it to other platforms is straight-forward.&#34;\n   This allowed the research team to test USBFuzz not only on Linux, where most fuzzer programs work, but also other operating systems. Researchers said they tested USBFuzz on:\n 9 recent versions of the Linux kernel: v4.14.81, v4.15,v4.16, v4.17, v4.18.19, v4.19, v4.19.1, v4.19.2, and v4.20-rc2 (the latest version at the time of evaluation)\n  Following their tests, the research team said that with the help of USBFuzz, they discovered a total of 26 new bugs.\n Researchers found one bug in FreeBSD, three in MacOS (two resulting in an unplanned reboot and one freezing the system), and four in Windows 8 and Windows 10 (resulting in Blue Screens of Death).\n However, the vast majority of bugs, and the most severe, were found in Linux -- 18 in total.\n Sixteen were memory bugs of high-security impact in various Linux subsystems (USB core, USB sound, and net-work), one bug resided in the Linux USB host controller driver, and the last in a USB camera driver.\n Peng and Payer said they reported these bugs to the Linux kernel team, along with proposed patches to reduce &#34;the burden on the kernel developers when fixing the reported vulnerabilities.&#34;\n Of the 18 Linux bugs, the research team said 11 received a patch since their initial reports last year. Ten of these 11 bugs also received a CVE, a unique code that&#39;s assigned to major security flaws.\n   &#34;The remaining bugs fall into two classes: those still under embargo/being disclosed and those that were concurrently found and reported by other researchers,&#34; researchers said.\n  Payer published yesterday a draft of the research team&#39;s white paper describing their work on USBFuzz. Peng and Payer plan to present their research at the Usenix Security Symposium virtual security conference, scheduled for August 2020.\n Similar work has been carried out in the past. A Google security engineer used a Google-made fuzzer named syzkaller to discover  79 bugs impacting Linux kernel USB drivers in November 2017.\n Peng and Payer said that USBFuzz is superior to previous tools like vUSBf, syzkaller, and usb-fuzzer because their tool grants testers more control over the test data and is also portable across operating systems, unlike all the above, which usually work only on *NIX systems.\n USBFuzz is scheduled to be released on GitHub as an open source project following Peng and Payer&#39;s Usenix talk. The repo will be available  here.\n Copies of Peng and Payer&#39;s paper, titled &#34; USBFuzz: A Framework for Fuzzing USB Drivers by Device Emulation,&#34; are available in PDF format  here and  here.", "posttime": "2020-05-28 05:44:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows,linux,tool,漏洞", "title": "新的模糊工具在Linux、Windows、MacOS和FreeBSD中发现26个USB错误", "title_en": "New Fuzzing Tool Finds 26 USB Bugs in Linux, Windows, macOS, and FreeBSD", "transed": 1, "url": "https://www.zdnet.com/article/new-fuzzing-tool-finds-26-usb-bugs-in-linux-windows-macos-and-freebsd/", "via": "", "real_tags": ["windows", "linux", "tool", "漏洞"]}, {"category": "", "categoryclass": "", "imagename": "f1754e98ed8bcff3effa8f206460c3fc.jpg", "infoid": 1003989, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国各地至少有11家地方电视台似乎播放了与亚马逊编写的相同的新闻套餐，在人们对公司仓库工人安全的担忧日益加剧之际，亚马逊宣传了该公司为保持司机和客户健康所做的努力，亚马逊拒绝透露有多少员工死于冠状病毒。\n周二，左倾新闻机构Courier Newsroom以视频蒙太奇的形式发布了这个电视节目包，其中显示当地新闻主播大声朗读来自亚马逊的脚本片段，兜售该公司的安全协议。\n亚马逊的一位发言人为公司通过新闻线发送视频新闻稿进行了辩护-通讯线包含一个脚本和视频-告诉福布斯，这不是宣传视频，这是公司的常见做法。\n这份新闻稿发布之际，亚马逊的股东计划在周三举行年会时向该公司施压，要求其采取安全措施。截至周二，亚马逊的市值超过1.2万亿美元，使其成为世界上最有价值的公司。\n在冠状病毒大流行期间一直开放的仓库的条件受到了密切关注，工人们举行抗议活动，要求进一步保护他们免受病毒的侵袭，同时也要求公司为他们提供带薪病假。\n关于这些条件的问题已经引起了十几个州总检察长的注意，他们给亚马逊发了一封信，要求亚马逊公布其仓库和全食超市(Whole Foods)有多少工人感染了冠状病毒，以及有多少人死亡的统计数据。\n在发送给当地一家新闻编辑部的一封电子邮件中，亚马逊吹嘘自己发送的视频片段“让观众第一次深入了解了公司的建筑，看看公司是如何改变运营方式的，以回应新冠肺炎”。福布斯获得了这封电子邮件。\n亚马逊表示，它正在向员工提供口罩和体温检测，并进行令人震惊的轮班，但仓库工作人员表示，公司做得还不够。工人们表示，对社会距离的执行力度不够，并要求关闭和清理有感染的设施。\n该公司对冠状病毒的反应引起了劳工活动人士和民主党政客的愤怒，佛蒙特州参议员伯尼·桑德斯(Bernie Sanders)。周二，在一条提到Courier Newsroom视频的推文中，对该公司进行了猛烈抨击。\n播放这段视频的电视台的编辑判断力也受到了质疑。\n这段汇编视频引发了人们对2018年发布的一段类似蒙太奇视频的回忆，当时辛克莱SBGI广播站的190多名主播朗读了一个相同的脚本，警告人们警惕“偏见和假新闻”。在播放亚马逊节目的电视台中，似乎只有一个是辛克莱电视台。", "note_en": "At least 11 local TV stations across the U.S. appear to have run identical news packages that Amazon scripted, promoting the company’s efforts to keep drivers and customers healthy as concerns grow about worker safety at the company’s warehouses, with Amazon refusing to say how many of its workers have died from the coronavirus.\n      The TV package, which the left-leaning news outlet Courier Newsroom published as a  video montage that widely spread on Tuesday, shows local news anchors reading aloud the scripted segment from Amazon, touting the company’s safety protocols.\n  A spokesperson for Amazon defended the company sending out the video news release over a news wire—which contained a script as well as video—telling  Forbes it was not a promotional video and is common practice for companies.\n    The release comes as Amazon shareholders plan to press the company on its  safety measures when it holds its annual meeting Wednesday, with its market capitalization as of Tuesday sitting at over $1.2 trillion—making it the most valuable company in the world.\n  Conditions at warehouses—which have remained open throughout the coronavirus pandemic—have come under scrutiny, with workers staging  protests demanding further protection from the virus while also asking the company to provide them with paid sick leave.\n    Questions about those conditions have drawn the attention of a group of over a dozen states’ attorneys general, which sent a  letter to Amazon demanding the company release statistics on how many workers at its warehouses and Whole Foods have been infected with coronavirus, as well as how many have died.\n  In an email sent to a local newsroom and obtained by  Forbes, Amazon touts the video footage it sent as “giving viewers for the first time an inside look at its buildings to see how the company has transformed its operations in response to COVID-19.”\n    Amazon has said it’s providing masks and temperature checks to employees and staggering shifts, but warehouse workers say the company hasn’t done enough. Workers have said there’s not enough enforcement of social distancing, and have asked that facilities with infections be shut down and cleaned.\n    The company’s response to coronavirus has drawn the ire of labor activists and Democratic politicians, with Sen. Bernie Sanders (I-Vt.) lashing out at the company in a tweet Tuesday referencing the Courier Newsroom video.\n    The TV stations that aired the video have also had their editorial judgment brought into question.\n            The compilation video sparked memories of a similar montage  video published in 2018, where more than 190 anchors at Sinclair    SBGI  Broadcast stations read an identical script warning against “biased and fake news.” Only one of the stations that ran Amazon’s segment appeared to be a Sinclair station.", "posttime": "2020-05-28 05:27:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,亚马逊,发布,照本宣科,scripted", "title": "亚马逊发布了一段照本宣科的新闻片段，11家电视台播出了这一片段", "title_en": "Amazon Sent Out a Scripted News Segment, and 11 Stations Aired It", "transed": 1, "url": "https://www.forbes.com/sites/nicholasreimann/2020/05/26/amazon-sent-out-a-scripted-news-segment-and-11-stations-aired-it/", "via": "", "real_tags": ["amazon", "亚马逊", "发布", "照本宣科", "scripted"]}, {"category": "", "categoryclass": "", "imagename": "f4aa39bdbd75645727f02b2c1805e62c.png", "infoid": 1003986, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Concurnas是一种开源的JVM编程语言，旨在构建可靠、可扩展、高性能的并发、分布式和并行系统。\n使用Concurnas使并发和并行编程变得更容易，从而帮助组织充分利用现代多核CPU和GPU硬件。\nConcurnas可与Java(和其他JVM语言)互操作-组织能够在并发环境中利用现有的Java软件。\n与其他语言相比，使用Concurnas开发人员需要编写的代码行更少。该代码更安全、更易于测试，从而提高了质量并提高了开发人员的工作效率。\n受Python和Java等语言的启发，Concurnas是一种静态类型的垃圾回收语言，它利用易于学习的语法进行类型推理。\nConcurnas是一种在Java虚拟机上运行的编译语言，因此可以访问JVM提供的难以置信的性能。\nConcurnas使从小型研究原型到全球范围的分布式生产解决方案使用相同的代码成为可能。\nConcurnas是一项开源技术，可以自由使用和修改。由Concurnas Ltd提供的持续开发和商业支持\nConcurnas@JAX伦敦2020.。我们将在2020伦敦JAX大会上谈论Concurnas。\nConcurnas提供了一个简单但极其强大的并发模型，它允许您编写并发代码，而不必编写样板代码来管理线程、临界区或锁！\nConcurnas作为并发计算的专门化，为分布式计算提供了一流的公民支持。\nConcurnas为GPU编程提供一流的公民支持。您可以用惯用的Concurnas代码编写代码并在GPU上运行，而不必切换到C/C++！\nConcurnas为与非堆管理、非垃圾回收的内存交互提供了一流的公民支持。这使得使用GPU、大数据和自定义数据库变得轻而易举。\nConcurnas支持现代命令式计算中使用的所有常用构造，例如：if-Elif-Else、for、while循环、断言、异常。加上来自块的隐式返回，以及语句、列表理解、复印机等等！\nConcurnas从面向对象编程中去掉了繁重的工作和繁琐的工作，让它再次变得有趣起来。Concurnas高级支持类(具体、抽象、继承)、泛型(输入、输出、通配符、有界)、枚举、注释。以及诸如特征、元组、对象提供程序、类型定义、基于用法的泛型类型推断、类字段getter/setter的自动生成/重定向、类散列代码和等式等新特性。\n函数式编程范例结合了一组非常有用的解决问题的方法，但是纯函数式编程在世界上很少见。在Concurnas中，我们采用了函数式编程中使用最广泛的元素，并将它们集成到Concurnas中。使用Concurnas，您可以访问方法和函数引用、lambdas、部分函数求值、惰性求值、模式匹配等等！\nConcurnas对新兴的反应式编程范例拥有一流的公民支持。使用Concurnas，您可以编写自动响应输入参数更改的代码，从而允许您创建反应式管道。一种非常自然的解决算法问题的方法。\nConcurnas为核心数据结构(包括数组、矩阵、列表、映射、范围和集合)提供了一流的公民支持。\nConcurnas是一种在科学计算社区中流行的技术，它允许您通过一个字符运算符将运算符应用于数组/矩阵/列表的所有元素。\nConcurnas提供独立编译器、交互式REPL shell、Jupyter Notebook、VS Code、Atom和Sublime Text支持。\nConcurnas是一种空安全语言，这有助于消除现代编程中最常见的错误来源之一：空指针异常！\nConcurnas在Java虚拟机上运行，这不仅让您可以访问JDK和JVM提供的出色的多平台性能，而且还可以与其他JVM语言(如Java、Scala、Kotlin和Clojure)兼容-此外，您可以轻松地集成/使用所有现有的JVM代码，而无需修改。\nConcurnas是一种静态类型语言，它广泛使用类型推理来消除类型负担。通常情况下，Concurnas代码与Python代码(被广泛认为是最容易编码的语言之一)没有什么区别，但具有Java的性能！\n编程语言不仅仅是机器用的--人们也需要阅读它们！Concurnas提供了简洁的语法和许多快捷方式，使编写易于阅读和维护的代码成为规范。对于需要额外清晰度的代码，Concurnas也可以冗长。\nConcurnas通过表达式列表、扩展函数和运算符重载对特定于域的语言提供广泛支持。Concurnas还支持语言扩展，允许您将非Concurnas代码段直接嵌入到Concurnas代码文件中。\ndef gcd(x int，y int){//两个整数的最大公约数While(Y){(x，y)=(y，x mod y)}x}calc1=gcd(8，20)！//在隔离calc2=gcd(6，45)中运行此计算！//如果calc1&gt；calc2否则calc2，请在单独的隔离calc3=calc1中运行此计算//^等待calc1的结果。\nConcurnas允许您通过使用bang！在单独的线程型容器(称为隔离)中轻松地并发执行计算！接线员。\n并发计算通常被认为是现代软件工程中最困难的方面之一。\n请注意并发计算是如何在Concurnas中成为一行程序的，创建/管理线程、线程池、生命周期、锁(或死锁！)、临界区、同步、等待、通知线程等都不用担心。所有这些困难的事情都会自动处理-让您专注于重要的事情。\nn=10 nplusone={n+=1；n}！//在一个分离物中执行此计算，n的副本为nminusone={n-=1；n}！//另一个分离物在n的单独副本上//以上两个分离物永远不会相互干扰。n//nplusone==11//nminusone==9。\nConcurnas中的所有代码都在隔离中执行。隔离被映射到运行代码的机器的底层硬件线程上。隔离器在其自己的专用内存空间内运行。\n将复制隔离中使用的所有状态，但引用、参与者和一些特殊标记的可共享类除外。这种状态隔离使推理和设计并发算法变得更容易，因为它减少了为同步和竞争条件编写代码的需要。\nAREF INT：//这是一个INT{//并发执行的复杂隔离最终设置AREF.//此处的复杂代码.AREF=10}！//AREF&#39；需要其当前值：RESULT INT=AREF//如果尚未设置任何值，执行将暂停System.out.println(&#34；AREF的值为：&#34；+RESULT)。\nexeccount int：=0 for(A In 1 To 10){//一些复杂的计算..execount++}！//生成隔离以并发执行上述操作。等待(execount；execount==10)//暂停进一步执行，直到execount==10。\naval int：//未设置初始值bval int：=22//初始值已知SUMMARTS int：=EVERY(aval，bval){aval+bval}//以上初始化后，允许执行.aval=100 bval=200//上面的每个块都将并发运行，并最终将SUMMICS设置为：AWAIT(SUMMILES；SUMMILES==300)。\n它们不是在隔离之间复制，而是共享，但提供对其可变状态的受控原子访问。如果请求时尚未在REF上设置值，则暂停执行，并允许执行其他隔离，直到设置了值，之后继续执行。\n我们可以通过Concurnas提供的以下反应式编程构造对引用的更改做出反应：\n等待将暂停执行，直到在REF上设置了值并且满足了可选的保护条件。\nonchange将在其监视的任何引用发生更改时触发其代码块的并发执行。\n每个参数的行为与onchange相同，但如果在任何受监视的引用上设置了初始值，则会触发\na int：b int：c&lt；=a+b//相同于：C int：=Every(a，b){a+b}d&lt；-a+b//相同于：C int：=onchange(a，b){a+b}。\n与Concurnas的大多数语法元素一样，提供了反应式编程构造Every and OnChange的简明版本。这有效地将反应式计算变成了一行操作。\ncount1 int：=100 count2 int：=100 onchange(count1，count2){System.out.println(&#34；sum：{count1+count2}&#34；)}trans{count1-=10 count2+=10}//将输出：&#34；sum：200&#34；\nConcurnas通过TRANS BLOCK关键字支持软件事务内存。这允许我们对一个或多个引用进行更改，并使这些更改在事务之外以原子为基础可见。\n来自com.concurnas.lang.Pulsar导入Pulsar，RealtimePulsar来自java.time导入持续时间Pulsar=new RealtimePulsar()oneOffTrigger：=10秒时间内的pulsar.after(Duration.ofSeconds(10))//schedule事件.每个(OneOffTrigger){System.out.println(&#34；当前时间：&#34；+oneOffTrigger)}//每2秒安排10次事件.RepeatingTrigger：=Pulsar.Repeat(Duration.ofSecond(2)，10)每(RepeatingTrigger){System.out.println(&#34；当前时间：&#34；+RepeatingTrigger)}。\n并发系统工程中的一种常见模式是希望有一些基于时间的触发器，等待10秒，然后执行x&#34；或每隔3秒做一次y等，或在此特定时间执行此操作。在Concurnas，我们将此称为时间计算。\n时间计算通过内置的Pulsar库得到支持，该库位于：com.concurnas.lang.Pulsar。此库允许我们将活动安排在经过一定时间后在将来进行。它还允许我们为将来的重复安排任务。\nConcurnas提供脉冲星的实时实现和冰冻时间实现(主要用于测试时间应用)，允许时间作为受控变量注入。\nresult=parfor(b in 0到10){gcd(b，10-b)}//result==[10：，1：，2：，5：，2：，1：，2：，1：，10：]。\nConcurnas拥有对并行for循环的头等公民支持。这些是用于在循环上下文中并行执行基于任务的操作的方便而直观的机制。它们与Concurnas中的常规循环具有相同的语法。\nACTOR MyActor{//让我们定义一个ACTOR-count=0 def Increment(){count++}}//使用上面的ACTOR：ma=new MyActor()ma.incremental()//就像正常的方法调用一样，将阻塞，直到执行完成sync{//sync-等待块中创建的所有隔离完成{ma.increate()}！//并发调用{ma.increate()}！}count=ma.getCount()//count==3，这是不可能的。\nConcurnas中的参与者使我们能够构建微服务。每个参与者都在自己的专用隔离内运作。从调用代码的角度来看，参与者的外观和行为与常规对象一样。\n参与者允许我们以单线程样式编写服务代码，并且能够以并发方式安全地运行它们，而不必担心同步或争用条件，因为对参与者的每个调用都是按顺序运行的，并且在完成之前具有对参与者状态的独占访问权限。自然，因为参与者实现了他们自己的并发控制，所以无需跨多个隔离进行复制就可以安全地共享它们。\nclass MyCounter(-count int){//普通类def increment(){count++}}//我们现在可以通过of关键字定义和使用我们的类型化执行元，如下所示：Actor MyActor of MyCounter(0)//让我们使用新的类型化执行元：ma=new MyActor()ma.incremental()sync{//sync-等待块中创建的所有隔离完成ma.increate()！ma.increate()！}count=ma.count//count==3。\n有时我们没有从零开始定义演员的奢侈。如果我们使用的是预先存在的代码，情况尤其如此。为此，Concurnas提供了类型化的参与者。类型化的参与者构造它们自己的角色，并围绕一个普通对象的实例。\n用于创建被包装的类或方法的实例的任何构造函数也由类型化参与者提供。\nclass MyCounter(-count int){def increate(){count++}}inst1=执行元MyCounter(0)//在MyCounter上新建执行元inst2=new执行元MyCounter(0)//在MyCounter上创建新执行元。\n创建类型化执行元的另一种方法是，在创建对象的实例(现在是AND ACTOR！)时，只需使用ACTOR关键字代替或附加于NEW关键字。\n//一个简单的矩阵乘法内核.gpukernel 2 matMult(M int，K int，GLOBAL in A Float[2]，GLOBAL in B Float[2]，GLOBAL OUT result Mat Float[2]){globalRow=get_global_id(0)globalCol=get_global_id(1)acc=0.0f；for(k=0；k&lt；K；k++){acc+=A[k*M+globalRow]*B[globalCol*K+k]}。\nConcurnas拥有GPU计算的一流市民支持。GPU可以像CPU协处理器一样使用，通过它们的使用，我们经常能够将许多计算限制问题的计算速度提高100倍以上，而不是传统的基于CPU的计算。\nGPU计算的核心是内核。这些都是在我们的GPU上执行的，以便执行计算。Concurnas允许您使用Concurnas编程语言的子集创建内核。这意味着我们只需稍加修改就可以编写惯用的并发代码，以便在GPU上执行计算。\n//在GPU设备上创建数组缓冲区ar gpus.GPUBufferInput=device.makeOffHeapArrayMixed&lt；int[]&gt；(int[].class，10)//将数据从堆复制到缓冲区.copy Complete布尔值：gps.GPURef=ar.writeToBuffer([1 2 3 4 5 6 7 8 9 10])//在我们等待复制完成的同时，可能在GPU上执行其他计算.await(Copy Complete)//a仅输入缓冲区ar gpus.GPUBufferInput=device.makeOffHeapArrayIn&lt；int[]&gt；(INT[].class，10)//a 2 x 4输出矩阵矩阵垫gpus.GPUBufferOutput=device.makeOffHeapArrayOut&lt；int[2]&gt；(int[2].class，2，4)。\n当我们检查要在GPU上执行的算法时，通常它们设计和使用的一个重要因素是与GPU之间的数据传输有关。Concurnas为此过程提供专门的支持。\n一些最高效的GPU算法通过同时实现数据传输和计算的流水线来实现它们的效率，从而使GPU始终忙于做有用的工作。Concurnas凭借其对非阻塞GPU操作(如通过Refs进行数据传输)的本机支持，使得这一点变得很容易。\n//定义符合C99的原始OpenCL C代码：@GPUStubFunction(Source=&#34；Float plus1(Float a，Float b){return a+b；}&#34；)gpudef plus1(a Float，b Float)Float//使用现有的符合C99的OPENCL C代码：@GPUStubFunction(sources=[&#39；./cpucode.cl&#39；，&#39；./gpuutilCode.cl&#39；])gpudef plus2(a Float，b Float)Float。\nConcurnas使用OpenCL实现GPU计算。这是有利的，因为除了其多供应商支持(主要是英特尔、NVIDIA和AMD)外，用户还可以访问用于GPU计算的整个现有库代码。\nConcurnas允许以两种方式之一使用现有代码，要么直接通过用符合C99的OpenCL C代码编写的代码字符串使用，要么作为附加到存根内核的注释中的直接文件引用。\n//一种利用GPU本地内存gpukernel 2matMultLocal(M int，N int，K int，常量A浮点[2]，常量B浮点[2]，GLOBAL OUT RESULT FLOAT[2]){row=get_local_id(0)col=get_local_id(1)globalRow=CacheSize*get_group_id(0)+row//结果行(0..M)globalCol=CacheSize*get_group_id(1)+colof result(0..N)//本地内存保存缓存A和B中的CacheSize元素*CacheSize元素。CacheSize]acc=0.0f//循环遍历所有分片cacheSize int=K/CacheSize for(t=0；t&lt；cacheSize；t++){//将全局内存中的A和B的一段缓存//到本地内存tiledRow=CacheSize*t+row tiledCol=CacheSize*t+colcacheA[ol][row]=A[tiledCol*M+globalRow]cacheb[ol][row]=B[globalCol*K+tiledRow]屏障(True)/。k++){//累加矩阵子部分的结果acc+=cacheA[k][row]*cacheb[ol][k]}屏障(True)//确保在移动到下一个缓存节之前完成所有工作项}result[globalCol*M+globalRow]=acc}。\nConcurnas具有对本地GPU内存和屏障的本地惯用支持。通常，当在GPU上使用本地内存实现空间局部性很强的算法时，它们会在性能方面受益良多。\nConcurnas GPU实施提供了详细的性能分析选项。这对于开发、使人能够调试GPU代码以便确定执行某些操作所花费的时间以及用于监视目的都是有用的。\n//远程服务器：reMServer=new com.concurnas.lang.Dist.RemoteServer(port=42001)remServer.startServer()//等到终止remServer.close()。\n//客户端：rm=Remote(&#39；localhost&#39；，port=42001)//远程执行代码，返回ref：ans int：={10+10}！(rm.onailReter())rm.close()//ans==20\nConcurnas为分布式计算提供了一种易于使用、直观和非侵入式的解决方案，它是对并发计算隔离模型的扩展。通过这种方式，我们能够使用我们已经习惯/已经使用的并发计算模型来构建我们的软件，并且可以很容易地将其扩展到远程工作。通过这种方式，当我们的计算需求增长时，我们可以很容易地扩展我们的解决方案来适应。\nConcurnas抽象化了许多关于管理分布式计算的艰苦工作，使我们能够专注于我们试图解决的更有趣的问题。例如，使用Concurnas，远程服务器将缓存结果，并在发生网络故障时等待客户端重新连接。\n//远程服务器：reMServer=new com.concurnas.lang.Dist.RemoteServer()//使用默认端口42000 remServer.startServer()//等到终止remServer.close()。\n类MyCalculator{//依赖代码-callCounter=0//两个整数的最大公约数.def gcd(x int，y int){//+计数器和Result While(Y){(x，y)=(y，x mod y)}&#34；count：{++callCounter}，result：{x}&#34；}}//远程连接并执行RM=Remote(&#39；127.0.0.1&#39；)//使用默认端口42000结果=try{calc=MyCalculator()calc.gcd(344756)//还传输依赖代码(MyCalculator.class)和对象状态(CallCounter).res字符串：={calc.gcd(97,7081)}！(rm.onailReter())res：get()}Finally{rm.close()}//result==count：2，result：97。\n使用Concurnas，可以对远程服务器进行配置，以便它们可以运行提交给它们的任何被认为可以安全执行的代码。\n内部Concurnas分布式计算API包括对依赖关系解析的规定，该依赖关系解析本身相当复杂，并且为了提高性能，能够执行静态代码依赖关系分析，以便预先确定并抢先提供执行所需的代码。\n..", "note_en": "Concurnas is an open source JVM programming language designed for building reliable, scalable, high performance concurrent, distributed and parallel systems\n    Using Concurnas helps organizations take full advantage of modern multi-core CPU and GPU hardware by making concurrent and parallel  programming easier.\n  Concurnas is  interoperable with Java (and other JVM languages) - organizations are able to leverage existing Java software in a concurrent environment.\n  Compared to other languages, with Concurnas  developers need to write fewer lines of code. That code is safer and easier to test, increasing quality and boosting developer productivity.\n    Inspired by languages such as  Python and  Java, Concurnas is a statically typed, garbage collected language utilizing type inference with an easy to learn syntax.\n  Concurnas is a compiled language which runs on the Java Virtual Machine and as such has access to the incredible performance offered by the JVM\n  Concurnas makes it possible to use the same code from a small research prototype to a planet scale distributed production solution\n  Concurnas is an open source technology, free to use and modify. With on going development and commercial support provided by  Concurnas Ltd\n  Concurnas @ JAX London 2020... We will be speaking about Concurnas at  JAX LONDON 2020\n    Concurnas offers a simple but extremely powerful concurrency model which allows you to write concurrent code without having to write boilerplate code to manage threads, critical sections or locks!\n  Concurnas offers first class citizen support for distributed computing as a specialization of concurrent computing\n  Concurnas offers first class citizen support for GPU programming. You can write your code in idiomatic Concurnas code and run on the GPU without having to switch to C/C++!\n  Concurnas offers first class citizen support for interacting with non heap managed, non garbage collected memory. This makes working with GPUs, big data and custom databases a breeze.\n  Concurnas supports all the usual constructs used in modern imperative computing such as: if-elif-else, for, while loops, assertions, exceptions. Plus implicit returns from blocks, with statements, list comprehension, copiers and much much more!\n  Concurnas takes the hard work and boiler plate out of object oriented programming and makes it fun again. Concurnas has advanced support for\r\t\t\tclasses (concrete, abstract, inheritance), generics (in out, wild cards, bounded), enumerations, annotations. As well as new features such as traits, tuples, object providers, typedefs, usage based generic type inference, automatic generation/ redirection of class field getters/setters, class hashcodes and equalities.\n  The functional programming paradigm incorporates a set of tremendously useful approaches to solving problems, but pure functional programming is rarely seen in the wild. With Concurnas we&#39;ve taken the most widely used elements of functional programming, and integrated them into Concurnas. With Concurnas you have access to method and function references, lambdas, partial function evaluation, lazy evaluation, pattern matching plus a whole lot more!\n  Concurnas has first class citizen support for the emerging reactive programming paradigm. With Concurnas you can write code which will react to changes in input parameters automatically - thus allowing you to create reactive pipelines. A very natural way of solving algorithmic problems.\n  Concurnas has first class citizen support for core data structures including arrays, matrices, lists, maps, ranges and sets.\n  A technique popular in the scientific computing community, Concurnas allows you to apply an operator to all elements of an array/matrix/list via a one character operator\n  Concurnas offers a standalone compiler, an interactive REPL shell, Jupyter Notebook, VS Code, Atom and Sublime text support.\n  Concurnas is a null safe language, this helps to eliminate one of the most common sources of bugs in modern programming: the null pointer exception!\n  Concurnas runs on the Java Virtual Machine, which not only gives you access to the JDK and fantastic multi-platform performance offered by the JVM but also compatibility with other JVM languages such as  Java,  Scala,  Kotlin and  Clojure - plus you can easily integrate/use all your existing JVM code without modification.\n  Concurnas is a statically typed language which uses type inference extensively to remove the burden of types. Often times Concurnas code is indistinguishable from Python code (widely recognized as one of the easiest languages to code in) but with the performance of  Java!\n  Programming languages are not just for machines - people need to read them too! Concurnas offers a concise syntax and many shortcuts to make writing easy to read and maintainable code the norm. Concurnas is also able to be verbose, for code which requires that extra bit of clarity.\n  Concurnas has extensive support for Domain Specific Languages via; expression lists, extension functions and operator overloading. Concurnas also supports language extensions, which allow you to directly embed segments of non Concurnas code into your Concurnas code files.\n    def gcd(x int, y int){//greatest common divisor of two integers\r while(y){\r (x, y) = (y, x mod y)\r }\r x\r}\r\rcalc1 = gcd(8, 20)!//run this calculation in an isolate\rcalc2 = gcd(6, 45)!//run this calculation in a separate isolate\r\rcalc3 = calc1 if calc1 &gt; calc2 else calc2\r//^^^ wait for the results of calc1 and calc2 before assigning calc3\n  Concurnas allows you to easily execute computation, concurrently, in separate thread-like containers called  isolates via use of the bang  ! operator.\n  Concurrent computation is often recognized as one of the most difficult aspects of modern software engineering\n  Notice how concurrent computation is a one liner in Concurnas, there is no worry about creating/managing threads, thread pools, life-cycles, locks (or deadlocks!), critical sections, synchronization, wait, notifying threads etc. All this hard stuff is taken care of automatically - leaving you to focus on what&#39;s important.\n    n = 10\r\rnplusone = { n += 1; n }!//perform this calculation in an isolate, a copy of n is made\rnminusone = { n -= 1; n }!//another isolate, on a separate copy of n\r//The above two isolates will never interfere with one another&#39;s copy of n\r\r//nplusone == 11\r//nminusone == 9\n  All code in Concurnas is executed in isolates. Isolates are mapped onto the underlying hardware threads of the machine upon which one is running one&#39;s code. Isolates operate within their own dedicated memory space.\n  All state used in an isolate is copied with the exception of references, actors and some specially marked shareable classes. This isolation of state makes reasoning and designing concurrent algorithms easier since it reduces the need to code for synchronization and race conditions.\n    aRef int://this is a ref of type int\r{//complex isolate executed concurrently eventually sets aRef...\r //complex code here...\r aRef = 10\r}!\r\r//aRef&#39;s current value is requested of it:\rresult int = aRef//If no value has yet been set execution will pause\r\rSystem.out.println(&#34;The value of aRef is: &#34; + result)\n  execount int: = 0\rfor(a in 1 to 10){\r //some complex calculation..\r execount++\r}!//spawn an isolate to execute the above concurrently.\r\rawait(execount; execount==10)//pause further execution until execount == 10\n  aval int://no initial value set\rbval int: = 22 //initial value known\r\rsumvals int: = every(aval, bval) { aval + bval }\r//after initializing above, execution is allowed to carry on...\r\raval = 100\rbval = 200\r\r//every block above will run concurrently and eventually set sumvals to:\rawait(sumvals; sumvals==300)\n  They are not copied between isolates, rather they are shared but provide controlled, atomic access to their changeable state. If a value is not yet set on a ref when it is requested, execution is paused and other isolates are allowed to execute until a value has been set, after which execution continues.\n  We can react to changes to refs via the following reactive programming constructs provided by Concurnas:\n  await Will pause execution until a value has been set on a ref and an optional guard condition has been satisfied\n  onchange Will trigger execution of its code block to occur concurrently upon any of its monitored refs being changed\n  every Behaves as  onchange but will trigger if an initial value has been set on any monitored ref\n    a int:\rb int:\r\rc &lt;= a + b //same as: c int: = every(a, b) { a + b }\rd &lt;- a + b //same as: c int: = onchange(a, b) { a + b }\n  As with most syntactical elements of Concurnas, a concise version of the reactive programming constructs  every and  onchange is provided. This effectively turns reactive computing into a one line operation.\n    account1 int: = 100\raccount2 int: = 100\ronchange(account1, account2) {\r System.out.println(&#34;sum: {account1 + account2}&#34;)\r}\r\rtrans{\r account1 -= 10\r account2 += 10\r}\r\r//will output: &#34;sum: 200&#34;\n  Concurnas supports software transactional memory via the trans block keyword. This allows us to make changes to one or more refs and have those changes visible outside of our transaction on an atomic basis.\n    from com.concurnas.lang.pulsar import Pulsar, RealtimePulsar\rfrom java.time import Duration\r\rpulsar = new RealtimePulsar()\r\roneOffTrigger := pulsar.after(Duration.ofSeconds(10))//schedule event for 10 seconds time...\revery(oneOffTrigger){\r System.out.println(&#34;Current time: &#34; + oneOffTrigger)\r}\r//schedule event every 2 seconds 10 times...\rrepeatingTrigger := pulsar.repeat(Duration.ofSeconds(2), 10)\revery(repeatingTrigger){\r System.out.println(&#34;Current time: &#34; + repeatingTrigger)\r}\n  A common pattern in concurrent systems engineering is to want to have some for of time based trigger, &#34;wait 10 seconds then do x&#34; or &#34;do y every 3 seconds etc&#34; or &#34;perform this action at this certain time&#34;. At Concurnas we refer to this as temporal computing.\n  Temporal computing is supported via the built in Pulsar library found at: com.concurnas.lang.pulsar. This library allows us to schedule activities to take place in the future after a certain amount of time has elapsed. It also allows us to schedule tasks for future repetition.\n  Concurnas offers both a realtime implementation of pulsars and a &#39;Frozen&#39;-time implementation (designed primarily for testing temporal applications), which permits time to be injected as a controlled variable.\n    result = parfor(b in 0 to 10){\r gcd(b, 10-b)\r}\r\r//result == [10:, 1:, 2:, 1:, 2:, 5:, 2:, 1:, 2:, 1:, 10:]\n  Concurnas has first class citizen support for parallel for loops. These are a convenient and intuitive mechanism for performing task based operations in the context of a loop, in parallel. They have the same syntax as conventional loops in Concurnas.\n  actor MyActor{//lets define an actor\r -count = 0\r def increment(){\r count++\r }\r}\r\r//Use of the above actor:\rma = new MyActor()\r\rma.increment()//just like normal method call, will block until execution is complete\r\rsync{//sync - wait for all isolates created in the block to complete\r {ma.increment()}!//called concurrently\r {ma.increment()}!\r}\r\rcount = ma.getCount()\r//count == 3, not possible with regular objects!\n  Actors in Concurnas enable us to build micro-services. Each actor operates within its own dedicated isolate. Actors look and behave just like regular objects from the perspective of the calling code.\n  Actors allow us to write service code in a single threaded style and be able to run them safety in a concurrent manner without having to concern ourselves with synchronization or race conditions as each call to an actor runs sequentially and has exclusive access to the sate of the actor until it completes. Naturally, because actors implement their own concurrency control they are safe to be shared without copying across multiple isolates.\n    class MyCounter(-count int){//ordinary class\r def increment(){\r count++\r }\r}\r\r//We can now define and use our typed actor through the aid of the of keyword as follows:\ractor MyActor of MyCounter(0)\r\r\r//let&#39;s use our new typed actor:\rma = new MyActor()\r\rma.increment()\r\rsync{//sync - wait for all isolates created in the block to complete\r ma.increment()!\r ma.increment()!\r}\r\rcount = ma.count//count == 3\n  Sometimes we do not have the luxury of defining actors from scratch. This is particularly the case if we are working with pre existing code. To this end Concurnas provides typed actors. Typed actors construct their own and wrap around an instance of an ordinary object.\n  Any constructor used to create an instance of the class or method being wrapped is also provided by the typed actor.\n    class MyCounter(-count int){\r def increment(){\r count++\r }\r}\r\rinst1 = actor MyCounter(0) //create a new actor on MyCounter\rinst2 = new actor MyCounter(0) //create a new actor on MyCounter\n  Another way to create a typed actor is to simply use the actor keyword in place of or in addition to the new keyword when creating an instance of an object (now and actor!).\n  //a simple kernel for performing matrix multiplication...\rgpukernel 2 matMult(M int, K int, \r global in A float[2], global in B float[2], global out resultMat float[2]) {\r globalRow = get_global_id(0) \r globalCol = get_global_id(1) \r acc = 0.0f;\r for (k=0; k&lt;K; k++) {\r acc += A[k*M + globalRow] * B[globalCol*K + k]\r }\r resultMat[globalCol*M + globalRow] = acc;\r}\n  Concurnas has first class citizen support for GPU computing. GPUs can be used like CPU co processors and through their use we&#39;re often able to improve the speed of computation for many compute bound problems by over 100x compared to conventional CPU based computation.\n  Central to GPU computing are kernels. These are executed on our GPUs in order to perform computation. Concurnas allows you to create kernels in a subset of the Concurnas programming language. This means we can write idiomatic Concurnas code with only slight modifications in order to perform computation on the GPU.\n    //create an array buffer on a GPU device\rar gpus.GPUBufferInput = device.makeOffHeapArrayMixed&lt;int[]&gt;(int[].class, 10)\r//copy data from the heap into the buffer...\rcopyComplete boolean:gps.GPURef = ar.writeToBuffer([1 2 3 4 5 6 7 8 9 10])\r//perform other computation, possibly on the GPU, whilst we wait for the copy to complete...\rawait(copyComplete)\r\r//an input only buffer\rar gpus.GPUBufferInput = device.makeOffHeapArrayIn&lt;int[]&gt;(int[].class, 10)\r//a 2 by 4 output matrix\rmat gpus.GPUBufferOutput = device.makeOffHeapArrayOut&lt;int[2]&gt;(int[2].class, 2, 4)\n  When we examine algorithms to execute on the GPU, often a big factor in their design and usage concerns transference of data to and from the GPU. Concurnas offers dedicated support for this process.\n  Some of the most efficient GPU algorithms achieve their efficiency by implementing pipelining of data transference and computation together so to always keep the GPU busy doing useful work. Concurnas makes this easy by virtue of its native support for non blocking GPU operations such as data transference via refs.\n    //defining raw C99 compliant OpenCL C code:\r@GPUStubFunction(source=&#34;float plus1(float a, float b){ return a + b;}&#34;)\rgpudef plus1(a float, b float) float\r\r//using existing C99 compliant OpenCL C code:\r@GPUStubFunction(sources=[&#39;./cpucode.cl&#39;, &#39;./gpuutilCode.cl&#39;])\rgpudef plus2(a float, b float) float\n  Concurnas implements GPU computing by using OpenCL. This is advantageous because in addition to its multi vendor support (mainly Intel, Nvidia and AMD) one has access to a whole host of existing library code for GPU computation.\n  Concurnas allows for existing code to be used in one of two ways, either directly via a code string written in C99 compliant OpenCL C code or as a direct file reference in an annotation attached to a stub kernel.\n    //a matrix multiplication algorithm leveraging GPU local memory\rgpukernel 2 matMultLocal(M int, N int, K int, \r constant A float[2], constant B float[2], global out result float[2]) {\r row = get_local_id(0)\r col = get_local_id(1)\r globalRow = CacheSize*get_group_id(0) + row //row of result (0..M)\r globalCol = CacheSize*get_group_id(1) + col //col of result (0..N)\r\t\r //local memory holding cache of CacheSize*CacheSize elements from A and B\r local cacheA = float[CacheSize, CacheSize]\r local cacheb = float[CacheSize, CacheSize]\r\t\r acc = 0.0f\r\t\r //loop over all tiles\r cacheSize int = K/CacheSize\r for (t=0; t&lt;cacheSize; t++) {\r //cache a section of A and B from global memory\r //into local memory tiledRow = CacheSize*t + row\r tiledCol = CacheSize*t + col\r cacheA[col][row] = A[tiledCol*M + globalRow]\r cacheb[col][row] = B[globalCol*K + tiledRow]\r\t\t\r barrier(true)//ensure all work items finished caching\r\t\t\r for (k=0; k&lt;CacheSize; k++) {//accumulate result for matrix subsections\r acc += cacheA[k][row] * cacheb[col][k]\r }\r\t\t\r barrier(true)//ensure all work items finished before moving on to next cache section\r }\r \r result[globalCol*M + globalRow] = acc\r}\n  Concurnas has native idiomatic support for local GPU memory and barriers. Often algorithms with a strong degree of spatial locality benefit hugely in terms of performance when they are implemented with local memory on a GPU\n    The Concurnas GPU implementation provides detailed profiling options. This is useful for both development, in enabling one to debug one&#39;s GPU code so as to determine how much time is spent performing certain operations, and for monitoring purposes\n  //A remote server:\rremServer = new com.concurnas.lang.dist.RemoteServer(port = 42001)\rremServer.startServer()\r//wait until time to terminate\rremServer.close()\n  //A client:\rrm = Remote(&#39;localhost&#39;, port = 42001)\r//execute code remotely, returning a ref:\rans int: = {10+10}!(rm.onfailRetry())\rrm.close()\r//ans == 20\n  Concurnas provides an easy to use, intuitive and non invasive solution for distributed computing which acts as an extension of the isolate model of concurrent computation. In this way we are able to use the concurrent computing model which we are used to/have already built our software using and can easily extend this to working on a remote basis. In this way as our computational requirements grow we can easily scale our solutions to accommodate.\n  Concurnas abstracts away much of the hard work Concerning managing distributed computing, allowing us to focus on the more interesting problems which we are trying to solve. For instance, with Concurnas remote servers will cache results and wait for clients to reconnect in the event of network failure.\n    //A remote server:\rremServer = new com.concurnas.lang.dist.RemoteServer()//use default port 42000\rremServer.startServer()\r//wait until time to terminate\rremServer.close()\n  class MyCalculator{//dependent code\r -callCounter = 0\r //greatest common divisor of two integers...\r def gcd(x int, y int){//+ counter and result\r while(y){\r (x, y) = (y, x mod y)\r }\r &#34;count: {++callCounter}, result: {x}&#34;\r }\r}\r\r//connect and execute remotely\rrm = Remote(&#39;127.0.0.1&#39;)//use default port 42000\rresult = try{\r calc = MyCalculator()\r calc.gcd(34, 4756)\r\r //Dependant code (MyCalculator.class) and object state (callCounter) is also transmitted...\r res String: = {calc.gcd(97, 7081)}!(rm.onfailRetry())\r res:get()\r}finally{\r rm.close()\r}\r//result == count: 2, result: 97\n  With Concurnas, remote servers are able to be configured such that they can run any code submit to them deemed safe for execution.\n  The internal Concurnas distributed computing API includes a provision for dependency resolution which itself is quite sophisticated and in the interests of performance is able to perform static code dependency analysis in order to determine and preemptively provide upfront the code that is required in order to execut\n......", "posttime": "2020-05-28 04:55:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "programming,编程,编程语言,代码", "title": "并发编程语言(Concurnas Programming Language)", "title_en": "The Concurnas Programming Language", "transed": 1, "url": "https://concurnas.com/", "via": "", "real_tags": ["编程", "编程语言", "代码"]}]