[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1008423, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在团队的所有成员之间共享他们都可以理解、参与和编辑的模型或图。\n在构建系统之前、在构建它的时候以及在将来维护它时都要描述它--使描述和系统保持最新，并且保持同步。\n在源代码存储库中维护该文本版本，并将其放在它所描述系统的代码旁边。\n符合持续集成、持续交付以及包括图表在内的“一切都是代码”的现代实践。", "note_en": "share a model or diagram between all members of the team that they can all understand and contribute to and edit\n  describe a system before you build it, when you’re building it, and as you maintain it into the future - keeping the description and the system current, and in sync.\n maintain that text version in a source code repository beside the code for the system it is describing\n  fits with modern practices of Continuous Integration Continuous Delivery - and “everything as code” including diagrams.", "posttime": "2020-06-26 23:21:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "搭便车,guide,系统", "title": "PlantUML搭便车指南", "title_en": "The Hitchhiker’s Guide to PlantUML", "transed": 1, "url": "https://crashedmind.github.io/PlantUMLHitchhikersGuide/", "via": "", "real_tags": ["搭便车", "guide", "系统"]}, {"category": "", "categoryclass": "", "imagename": "e466618df07ab64c087a50d9f8e130df.jpg", "infoid": 1008422, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "更新版：周四晚些时候，Verizon加入了参与Facebook广告抵制的公司名单，成为第一家电信公司，也是迄今为止加入的最大公司。\nVerizon在一份书面声明中表示：我们有严格的内容政策，当它们被违反时，我们是零容忍的，我们会采取行动。我们将暂停我们的广告，直到Facebook能够创造出一个可以接受的让我们感到舒服的解决方案。该公司还补充说，它退出Facebook的方式类似于2017年在YouTube平台上的广告出现在极端主义内容旁边后暂时停止在该平台上投放广告的方式。\n据CNBC报道，在反诽谤联盟发现一则Verizon广告出现在阴谋组织Qanon的一段视频旁边后，Verizon做出了退出Facebook和Instagram广告的选择。这段视频使用了仇恨和反犹太主义的言论。\n在这场结束反黑人的全球运动中，我们赞扬这些公司迅速响应我们的呼吁，明确维护正确的立场，这样我们就可以追究Facebook对其种族主义政策的责任，“改变颜色”(Color Of Change)的总裁拉沙德·罗宾逊(Rashad Robinson)表示。该组织是抵制活动的组织之一。\n罗宾逊说，到目前为止，已经有近100家公司加入了抵制行动，并补充说：Facebook需要做出一个决定：要么采用民权基础设施，要么继续看到关键广告商从其平台上消失。\n原创故事：几个品牌已经同意在7月份暂停Facebook上的广告，并呼吁其他公司加入他们的行列，抵制该平台，以抗议该平台对种族主义和仇恨言论的处理。\n周日，高端外衣生产商巴塔哥尼亚(Patagonia)成为最新一家表示暂时将从Facebook和Instagram上撤下所有广告的公司。Facebook营销主管科里·拜尔斯在一份书面声明中表示，长期以来，Facebook一直未能采取足够的措施阻止仇恨谎言和危险宣传在其平台上传播。赌注太高了，不能坐视不管，让公司继续同谋散布虚假信息，煽动恐惧和仇恨。\n巴塔哥尼亚紧随员工安置公司Upwork和户外服装竞争对手REI和The North Face之后，这两家公司周五都证实将加入抵制活动。North Face母公司VF Corp也告诉CNN，其其他服装品牌，包括Dickies，Vans和Timberland，也在考虑加入抗议活动。\n这场名为“停止仇恨谋利”的抵制运动是由非营利组织联盟发起的，其中包括全国有色人种协进会(NAACP)、反诽谤联盟(Anti-Defamation League)和改变颜色(Color Of Change)等。这些团体指责Facebook允许种族主义、暴力和可证实的虚假内容在其平台上猖獗，同时放大白人至上主义者的信息，允许煽动暴力，并且未能扰乱利用该平台进行伤害的坏人。\nFacebook在周日发布的一份冗长的声明中表示，它正在采取措施审查我们的政策，确保在我们如何应用我们的政策时做出决定时的多样性和透明度，并在我们的平台上促进种族正义和选民参与。\n倡导团体对Facebook及其首席执行官马克·扎克伯格的不满并不新鲜。据《华尔街日报》近日报道，早在2016年，Facebook高管就知道他们存在极端主义和两极分化的问题。\n2018年，Facebook同意进行民权审计。审计负责人劳拉·墨菲(Laura Murphy)在2018年的一份报告中写道，毫无疑问，Facebook面临着一系列严重的民权挑战，包括允许传播仇恨言论和错误信息，以及为选民压制提供便利，歧视性广告投放，隐私漏洞，不公平的审查和算法偏见。\n这些挑战一直存在。例如，今年早些时候，司法部长和新泽西州州长进行了干预，让Facebook停用了一个活跃的仇恨团体的页面，该团体正在宣传和支持该州的暴力呼吁。\n最近，由于唐纳德·特朗普(Donald Trump)总统及其连任竞选活动在过去一个月里发布的信息，在全国范围内支持黑人社区和反对警察暴力的抗议活动中，Facebook与其用户分享的内容之间的紧张关系达到了顶点。Twitter在5月下旬对特朗普的一条推文采取了行动，警告称美化了针对抗议者的暴力行为，这违反了该网站的规定。然而，Facebook没有对同样的内容采取行动，该公司因这一选择而受到民权倡导者和员工的抨击。\n6月初，来自三个民权组织-变化之色、公民和人权领导人会议以及全国有色人种协进会法律辩护和教育基金-的领导人与扎克伯格和Facebook首席运营官谢丽尔·桑德伯格就这一决定举行了电话会议。电话会议结束后，这些团体表达了对Facebook的失望，在一份声明中表示，他们对马克令人费解的解释感到失望和震惊，并补充说，[扎克伯格]没有表现出对历史或现代选民压制的理解，他拒绝承认Facebook是如何为特朗普呼吁对抗议者采取暴力行动提供便利的。", "note_en": "Update: Late Thursday, Verizon joined the list of companies participating in the Facebook advertising boycott, becoming the first telecom firm and also the largest company by far to join in to date.\n &#34;We have strict content policies in place and have zero tolerance when they are breached, we take action,&#34; Verizon said in a written statement. &#34;We’re pausing our advertising until Facebook can create an acceptable solution that makes us comfortable.&#34; The company also added that its withdrawal from Facebook was similar to the way it  temporarily stopped advertising on YouTube in 2017 after its ads appeared next to extremist content on that platform.\n Verizon made the choice to withdraw from Facebook and Instagram advertising after the Anti-Defamation League identified a Verizon ad &#34;appearing next to a video from the conspiracy group QAnon drawing on hateful and antisemitic rhetoric,&#34;  CNBC reported.\n &#34;Amid this global movement to end anti-Blackness, we credit these companies for answering our call swiftly and taking a clear stand for what&#39;s right so we can hold Facebook accountable for its racist policies,&#34; said Rashad Robinson, president of Color of Change, which is one of the groups organizing the boycott.\n Almost 100 firms have joined the boycott so far, Robinson said, adding: &#34;Facebook has a decision to make: adopt a civil rights infrastructure or continue to see key advertisers dropping from its platform.&#34;\n Original Story: Several brands have agreed to suspend advertising on Facebook for the month of July and are calling for other companies to join them in boycotting the platform to protest its handling of racism and hate speech.\n Patagonia, producer of high-end outerwear, on Sunday became the most recent company to say it was pulling all advertising from Facebook and Instagram for the time being. &#34;For too long, Facebook has failed to take sufficient steps to stop the spread of hateful lies and dangerous propaganda on its platform,&#34; company head of marketing Cory Bayers said in a  written statement. &#34;The stakes are too high to sit back and let the company continue to be complicit in spreading disinformation and fomenting fear and hatred.&#34;\n Patagonia followed employee placement firm  Upwork and outdoor wear competitors  REI and  The North Face, which all confirmed on Friday they would join the boycott. North Face parent company VF Corp also  told CNN its other apparel brands, including Dickies, Vans, and Timberland, were considering joining the protest.\n The boycott campaign,  Stop Hate for Profit, is spearheaded by a coalition of non-profit organizations including the NAACP, the Anti-Defamation League, and Color of Change, among others. The groups  accuse Facebook of &#34;allowing racist, violent, and verifiably false content to run rampant on its platform,&#34; while &#34;amplifying the messages of white supremacists, permitting incitement to violence, and failing to disrupt bad actors using the platform to do harm.&#34;\n Facebook, in a  lengthy statement published Sunday, said it is &#34;taking steps to review our policies, ensure diversity and transparency when making decisions on how we apply our policies, and advance racial justice and voter engagement on our platform.&#34;\n  Advocacy groups&#39; frustration with Facebook and its CEO Mark Zuckerberg is not new. As far back as 2016, Facebook executives knew they had a problem with extremism and polarization, The Wall Street Journal  recently reported.\n In 2018, Facebook agreed to a  civil rights audit. There is &#34;no question that Facebook faces a number of serious civil rights challenges, including allegations of allowing the propagation of hate speech and misinformation and the facilitation of voter suppression, discriminatory ad targeting, privacy lapses, unfair censorship, and algorithmic bias,&#34; the audit leader, Laura Murphy, wrote in a 2018 report ( PDF).\n Those challenges have persisted. Earlier this year, for example, the attorney general and the governor of New Jersey intervened to have Facebook deactivate the page of  an active hate group that was promoting and endorsing calls to violence in the state.\n Most recently, the tension between Facebook and the content its users share has come to a head due to messages posted by President Donald Trump and his re-election campaign in the past month, amid nationwide protests in support of Black communities and against police violence. Twitter in late May  took action against a Trump tweet by appending a warning that it glorified violence against protesters, in contravention of the site&#39;s rules. Facebook, however, took no action against the same content, and the company took heat from both   civil rights advocates and  employees over that choice.\n Leaders from three civil rights groups—Color of Change, The Leadership Conference on Civil and Human Rights, and the NAACP Legal Defense and Educational Fund—in early June held a conference call with Zuckerberg and Facebook COO Sheryl Sandberg about the decision. After the call, the groups expressed frustration with Facebook, saying in a statement they were &#34;disappointed and stunned by Mark&#39;s incomprehensible explanations&#34; and adding, &#34;[Zuckerberg] did not demonstrate understanding of historic or modern-day voter suppression and he refuses to acknowledge how Facebook is facilitating Trump’s call for violence against protesters.&#34;", "posttime": "2020-06-26 23:03:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,facebook,广告商,joins", "title": "Verizon加入越来越多的Facebook广告商抵制活动[更新版]", "title_en": "Verizon joins growing Facebook advertiser boycott [Updated]", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/06/facebook-faces-advertiser-backlash-over-its-handling-of-racism-hate-speech/", "via": "", "real_tags": ["广告", "facebook", "广告商", "joins"]}, {"category": "", "categoryclass": "", "imagename": "e560a71dc83ac34808b55fedd40ced79.jpg", "infoid": 1008421, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软正在放弃实体零售。今天，该公司宣布计划永久关闭美国和世界各地的所有Microsoft Store门店，除了四个将被“重新设想”为不再销售产品的体验中心的门店。\n这些地点是纽约市(第五大道)、伦敦(牛津马戏团)、悉尼(悉尼韦斯特菲尔德)和雷蒙德校区。这家伦敦商店大约一年前才刚刚开张。美国和全球所有其他微软商店门店都将关闭，该公司将专注于数字零售的发展。微软表示，Microsoft.com、Xbox和Windows店面达到了“190个市场的12亿月度客户”。\n该公司告诉The Verge，今天的决定不会导致裁员。微软商店副总裁大卫·波特在LinkedIn上发布的一篇移动帖子中表示：“我们致力于从这个多元化的人才库中成长和发展职业生涯，这一承诺比以往任何时候都更加坚定。”\n一位了解微软零售业务的消息人士告诉The Verge，这一计划原本计划在明年实施，但新冠肺炎疫情加速了这一计划的实施。微软的Xbox Series X将在这个假期推出，因此，该公司至少在最初计划让商店走到这一步是有道理的。同样在假期期间发货的Surface Neo设备已经被推迟，尽管Surface二人组显然仍在今年的轨道上。如果你希望你当地的微软商店是购买新Xbox的必经之路，那你就得另谋高就了。\n这一重大决定在一定程度上解释了为什么微软在考虑到大流行而关闭了所有门店后，至今仍未重新开放一家门店。上周，微软告诉The Verge，它“通过监控全球数据、听取公共健康和安全专家的意见，以及跟踪当地政府的限制，对重新开放微软商店门店的方法进行了慎重和谨慎的指导。”当时，该公司拒绝提供任何门店可能重新开业的最新情况。\n由于许多微软商店都在购物中心和购物中心，因此持续关闭并不是什么不寻常的事情。在美国各州，为了避免新型冠状病毒卷土重来，正在采取谨慎的方式恢复零售业务，大多数商场仍然关闭。在指导方针较为宽松的地区，新冠肺炎案件已经激增，这导致苹果重新关闭了一些最近才欢迎顾客回来的门店。\n今年4月，微软在一篇博客文章中概述了有多少零售店员工在日常工作被搁置后转向远程工作。在大流行期间，该公司继续为团队成员提供定期薪酬。该公司在今天的更新中表示：“我们的零售团队成员将继续为在微软公司设施或远程工作的客户提供服务，我们将继续发展我们多样化的团队，以支持整个公司的使命和目标。”\n微软商店于2009年首次亮相，紧跟苹果成功的零售策略。每家商店都是该公司Surface和Xbox硬件的展示窗口，外加精选的第三方个人电脑。员工们精通Windows的所有东西，该公司还提供店内活动、研讨会、客户服务和维修。\n美国东部时间6月26日上午9：50更新：文章已更新，以澄清所有Microsoft零售店将关闭。该公司在纽约、伦敦、悉尼和雷德蒙德的地点将被改造成不销售产品的体验中心。", "note_en": "Microsoft is giving up on physical retail. Today  the company announced plans to permanently close all Microsoft Store locations in the United States and around the world, except for four locations that will be “reimagined” as experience centers that no longer sell products.\n Those locations are New York City (Fifth Ave), London (Oxford Circus), Sydney (Westfield Sydney), and the Redmond campus location.  The London store only just opened about a year ago. All other Microsoft Store locations across the United States and globally will be closing, and the company will concentrate on digital retail moving forward. Microsoft says Microsoft.com and the Xbox and Windows storefronts reach “up to 1.2 billion monthly customers in 190 markets.”\n The company tells  The Verge that no layoffs will result from today’s decision. “Our commitment to growing and developing careers from this diverse talent pool is stronger than ever,” Microsoft Store VP David Porter  said in a LinkedIn post on the move.\n A source with knowledge of Microsoft’s retail operations told  The Verge that this plan was originally in place for next year, but was accelerated by the COVID-19 pandemic. Microsoft’s Xbox Series X is launching this holiday, so it makes sense that the company had at least initially planned for the stores to make it that far. The Surface Neo device that was also going to ship during the holidays has been delayed, though the Surface Duo is apparently still on track for this year. If you were hoping your local Microsoft Store would be a surefire bet for a new Xbox, you’ll have to look elsewhere.\n The big decision partially explains why Microsoft had yet to reopen a single store after they were all closed in light of the pandemic. Last week, Microsoft told  The Verge that its “approach for re-opening Microsoft Store locations is measured and cautious, guided by monitoring global data, listening to public health and safety experts, and tracking local government restrictions.” At the time, the company declined to offer an update on when any stores might open again.\n   Since many Microsoft stores are in shopping centers and malls, the continued closure hasn’t stood out as unusual. In US states that are taking a cautious approach to restoring retail operations — to avoid a resurgence of the novel coronavirus — most malls remain closed. There have already been spikes of COVID-19 cases in regions with more relaxed guidelines, which has led Apple to re-close some stores where it had only recently welcomed customers back in.\n In April,  Microsoft outlined in a blog post how many retail store associates had shifted to remote work after their everyday jobs were sidelined. The company has continued to provide regular pay for team members through the pandemic. “Our retail team members will continue to serve customers working from Microsoft corporate facilities or remotely and we will continue to develop our diverse team in support of the overall company mission and objectives,” the company said in today’s update.\n The Microsoft Store debuted in 2009 and closely adhered to Apple’s successful retail playbook. Each store is a showcase for the company’s Surface and Xbox hardware, plus a selection of third-party PCs. Employees were well-versed in all things Windows, and the company also offered in-store events, workshops, customer service, and repairs.\n Update June 26th 9:50AM ET:  The article has been updated to clarify that all Microsoft retail stores will be closing. The company’s locations in New York, London, Sydney, and Redmond will be converted into experience centers that do not sell products.", "posttime": "2020-06-26 23:02:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,微软,关闭,permanently", "title": "微软将永久关闭几乎所有零售店", "title_en": "Microsoft to permanently close nearly all of its retail stores", "transed": 1, "url": "https://www.theverge.com/2020/6/26/21297400/microsoft-retail-stores-closing-cities-open?utm_campaign=theverge&utm_content=chorus&utm_medium=social&utm_source=twitter", "via": "", "real_tags": ["microsoft", "微软", "关闭"]}, {"category": "", "categoryclass": "", "imagename": "6d8e3a75ab7db63ed193b24a2508194d.png", "infoid": 1008420, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据亚马逊的声明，Zoox将继续作为一项独立的业务存在，现任首席执行官艾卡·埃文斯(Aicha Evans)以及首席技术官兼联合创始人杰西·莱文森(Jesse Levinson)将继续担任她的职务。发布说明称，他们的整体公司使命也将保持不变。《金融时报》报道称，这笔交易价值12亿美元。\n“华尔街日报”(Wall Street Journal)曾在5月底报道称，亚马逊正在将Zoox视为潜在的收购目标，这笔交易已经进入后期阶段。\nZoox选择了自动驾驶行业可能成本最高的道路之一，寻求从头开始制造一款适合用途的自动驾驶乘用车，以及提供自动驾驶能力的软件和人工智能。Zoox在过去一年里进行了一些引人注目的成本削减，并于2019年初从英特尔聘请了首席执行官埃文斯，可能是为了利用她的经验帮助公司走向商业化。\n有了亚马逊这样财大气粗的母公司，Zoox应该会获得赶上其主要竞争对手Waymo所需的跑道。Waymo最初是谷歌的自动驾驶汽车项目，谷歌所有者Alphabet是其企业所有者。\n亚马逊一直在致力于自己的自动驾驶汽车技术项目，包括其最后一英里的送货机器人，这是一种六轮人行道行走的机器人，旨在将小包裹运送到客户家中。该公司还投资了自动驾驶初创公司Aurora，并对自动驾驶货运初创公司Bookk提供的自动驾驶卡车进行了测试。\n亚马逊表示，收购Zoox的具体目的是帮助这家初创公司“将他们自动叫车的愿景变成现实”，因此这看起来不会立即专注于亚马逊的包裹递送物流运营。但Zoox的基础技术，包括开发专门为自动驾驶制造的零排放车辆，可以很容易地转化为亚马逊运营的那一边。\n与此同时，如果Zoox真的继续发展客运叫车业务，这可能会为亚马逊打开一个全新的市场-一旦自动驾驶技术成熟，亚马逊将与优步(Uber)和Lyft正面交锋。", "note_en": "Zoox   will continue to exist as a standalone business according to Amazon’s announcement, with current CEO Aicha Evans continuing in her role, as well as CTO and co-founder Jesse Levinson. Their overall company mission will also remain the same, the release notes. The  Financial Time reports that the deal is worth $1.2 billion.\n The Wall Street Journal had reported at the end of May that  Amazon was looking at Zoox as a potential acquisition target, and that the deal had reached the advanced stages.\n  Zoox has chosen one of the most expensive possible paths in the autonomous driving industry, seeking to build a fit-for-purpose self-driving passenger vehicle from the ground up, along with the software and AI ended to provide its autonomous driving capabilities. Zoox has done some notable cost cutting in the past year, and it brought in  CEO Evans in early 2019 from Intel, likely with an eye towards leveraging her experience to help the company move towards commercialization.\n  With a deep-pocketed parent like Amazon, Zoox should gain the runway it needs to keep up with its primary rival – Waymo, which originated as Google’s self-driving car project, and which counts Google owner Alphabet as its corporate owner.\n Amazon has been working on its own autonomous vehicle technology projects, including its last-mile delivery robots, which are six-wheeled sidewalk-treading bots designed to carry small packages to customer homes. The  company has also invested in autonomous driving startup Aurora, and it has  tested self-driving trucks powered by self-driving freight startup Embark.\n The Zoox acquisition is specifically aimed at helping the startup “bring their vision of autonomous ride-hailing to reality,” according to Amazon, so this doesn’t look to be immediately focused on Amazon’s logistics operations for package delivery. But Zoox’s ground-up technology, which includes developing zero-emission vehicles built specifically for autonomous use, could easily translate to that side of Amazon’s operations.\n Meanwhile, if Zoox really does remain on course for passenger ride-hailing, that could open up a whole new market for Amazon – one which would put it head-to-head with Uber and Lyft once the autonomous driving technology matures.", "posttime": "2020-06-26 23:01:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,自动,acquire", "title": "\n亚马逊将收购自动驾驶初创公司Zoox", "title_en": "\n\t\t\t\tAmazon to acquire autonomous driving startup Zoox\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/amazon-to-acquire-autonomous-driving-startup-zoox/", "via": "", "real_tags": ["amazon", "亚马逊", "自动", "acquire"]}, {"category": "", "categoryclass": "", "imagename": "a450ba2f58bc39fb50ca25ac41cfdba5.jpg", "infoid": 1008419, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着其他零售商开始缓慢而谨慎地重新开业，微软宣布将永久关闭其绝大多数零售店。也有一些例外，包括伦敦、纽约市、悉尼等城市中心的旗舰店，以及位于华盛顿州雷蒙德的自己的校园，但其余的门店正在消失。\n自那以后，微软已经写信澄清，那些将留下来的少数地点将被改造成“微软体验中心”，而不是标准商店-基本上是一个与产品互动和学习课程的地方，没有实际的采购方面。\n在一篇标题乐观的帖子中，微软商店宣布了新的零售方式，该公司详细阐述了一种相当于零售方式的深刻转变，此前该公司曾发现，该公司希望在自己的实体游戏中与苹果竞争。\n它指出，由于新冠肺炎的原因，计划中的地点暂时关闭，但尽管大流行无疑对该行业产生了影响，但这可能会持续很长一段时间。去年6月，它关闭了在美国规模较小的专卖店和售货亭。\n公司副总裁大卫·波特在帖子中表示：“随着我们的产品组合演变为以数字产品为主的产品，我们的在线销售额有所增长，我们才华横溢的团队已被证明成功地为任何物理位置以外的客户提供服务。”\n所有这些中都有一些好消息。微软已承诺将零售员工过渡到新的销售和其他角色，因为该公司将资源重新转移到在线商务上。\n“公司的零售团队成员将继续从微软公司设施为客户提供服务，并远程提供销售、培训和支持，”它写道。微软将继续投资于其在Microsoft.com上的数字店面，以及Xbox和Windows的商店，每月覆盖190个市场的超过12亿人。", "note_en": "As other retailers begin the slow, cautious move to reopen, Microsoft has announced that will be permanently shutting down the vast majority of its retail stores. There are some exceptions, including flagships in urban hubs including London, New York City, Sydney and its own campus in Redmond, Washington, but the remainder of the locations are going away.\n Microsoft has since written to clarify that those handful of locations that will remain will be turned into “Microsoft Experience Centers,” rather than the standard stores — basically a place to interact with products and take courses, without the actual purchasing aspect.\n In a post optimistically titled,  “Microsoft Store announces new approach to retail,” the company spells out what amounts to a profound shift in an approach to retail that had previously found the company looking to compete with Apple at its own brick and mortar game.\n  It notes the planned temporary shutdown of locations due to COVID-19, but while the pandemic no doubt had an impact on that sector, this was likely a long time coming. In June of late year,  it closed its smaller Specialty Stores and kiosks in the U.S.\n “Our sales have grown online as our product portfolio has evolved to largely digital offerings, and our talented team has proven success serving customers beyond any physical location,” said Corporate VP David Porter says in the post.\n Some goodish news in all of this. Microsoft has committed to transitioning retail employees to new sales and other roles, as the company shifts resources back into online commerce.\n “The company’s retail team members will continue to serve customers from Microsoft corporate facilities and remotely providing sales, training, and support,” it writes. “Microsoft will continue to invest in its digital storefronts on Microsoft.com, and stores in Xbox and Windows, reaching more than 1.2 billion people every month in 190 markets.”", "posttime": "2020-06-26 23:01:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,微软,关闭,closing", "title": "\n微软将永久关闭所有零售店", "title_en": "\n\t\t\t\tMicrosoft is closing all of its retail stores for good\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/nearly-all-of-microsofts-retail-stores-will-close-for-good/", "via": "", "real_tags": ["microsoft", "微软", "关闭", "closing"]}, {"category": "", "categoryclass": "", "imagename": "3c039aa2326c56d4766bba35777c9890.jpg", "infoid": 1008417, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以每股20美元的价格，首日发售的1,750万股票筹集了3.5亿美元，对于一家2020年第一季度营收约占这一数字10%的公司来说，这是一个巨大的收获。假设你卑微的仆人正确地进行了A类到ADS的股票转换计算，按IPO价格计算，Agora的价值约为20亿美元。\n根据Crunchbase的数据，Agora在GGV Capital、Coatue和其他公司的支持下，筹集了远远超过1亿美元的资金。\n该交易所每天都在关注初创企业和私人市场，以获得额外的Crunch订户；使用代码交换获得完全访问权限，并将订阅优惠25%。\nAgora是一家API驱动的公司，允许客户在他们的应用程序中嵌入实时视频和语音功能；适当地，该公司在美国的股票代码将是“API”。\nAgora的年运行率为1.422亿美元，20亿美元的估值使其运行率倍数约为14倍。这是丰富的，但不是平流层。也许Agora的利润率低于70%(第一季度利润率为68.8%)，因此无法获得更高的市盈率？\nAgora的财务状况使其IPO定价成了一个巧妙的谜题，所以让我们来分析一下好的和坏的，以便更好地理解为什么市场愿意支付比公司预期更高的价格。\n在简短的练习之后，我们将记录当前的IPO环境，包括我们从Agora学到的东西。(独角兽的剧透：情况看起来很好。)。\n在我们得到最新的申报文件之前，我们不能有把握地计算Agora的企业价值。但考虑到该公司首次公开募股前的现金和负债，其隐含的企业价值/运行率约为13倍。(如果该公司的股票在上市后没有上涨，那么这一数字将会下降，因为它的现金状况因出售股票而上升；更多信息请参见这里的企业价值。)", "note_en": "At $20 per share, the 17.5 million shares sold in its debut raised $350 million, a huge haul for a company that reported around 10% of that figure in Q1 2020 revenue. Provided that your humble servant is doing his Class A to ADS share conversion calculations correctly, Agora is worth about $2.0 billion at its  IPO   price.\n Agora raised  well over $100 million while a private company, backed by GGV Capital, Coatue and others, according to Crunchbase data.\n  The Exchange is a daily look at startups and the private markets for Extra Crunch subscribers; use code EXCHANGE to get full access and  take 25% off your subscription.\n  Agora is an API-powered company that allows customers to embed real-time video and voice abilities in their applications; appropriately, the company’s ticker symbol in America will be “API.”\n With an annual run rate of $142.2 million, a $2 billion valuation gives Agora a run-rate multiple of around 14x. That’s rich, but not stratospheric. Perhaps Agora wasn’t able to command a higher multiple due to its sub-70% margins (68.8% in Q1)?\n Agora’s financials make its IPO pricing a neat puzzle, so let’s pull apart the good and the bad to better understand why the market was willing to pay than the company anticipated.\n After that short exercise, we’ll make note of the current IPO climate, inclusive of what we learn from Agora. (Spoiler for unicorns out there: things look good.)\n  We can’t calculate Agora’s enterprise value with confidence until we get updated filings. But taking into account the company’s pre-IPO cash and liabilities, its implied enterprise value/run rate is something around 13x. (That figure will dip if the company’s shares don’t rise after its debut, as its cash position rises from its share sale;  more on enterprise values here.)", "posttime": "2020-06-26 23:00:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ipo", "title": "\nAgora高于区间的IPO定价突显了一个受欢迎的IPO市场", "title_en": "\n\t\t\t\tAgora’s above-range IPO pricing underscores a welcoming IPO market\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/agoras-above-range-ipo-pricing-underscores-a-welcoming-ipo-market/", "via": "", "real_tags": ["ipo"]}, {"category": "", "categoryclass": "", "imagename": "ce1d46b2546ff53a466f8f5a835c4cc5.jpg", "infoid": 1008416, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "RODECaster Pro是一个强大的制作工作室，但对于那些不是音响工程师的人来说，这并不是压倒性的。甲板天平在保持相对简单的同时提供了大量的物理控制，为你提供了音量滑块和用于顶级控制的大型垫式按钮等东西，然后在多层菜单后面添加了更先进的功能和微调，这些菜单可以通过大尺寸、高分辨率的触摸屏进行访问，以满足希望进行更微调操作的用户的需求。\nRODECaster Pro包括四个XLR输入，每个输入都可以为电容器麦克风提供(单独选择)幻象功率，以及四个1/4“耳机输出用于相应的监控。这很棒，因为这意味着如果你有客人习惯了录制播客和高质量的音频，他们可以听自己的输入，或者你可以选择只有一个制作人来记录一切。还有一个左右1/4英寸的音频输出，用于演播室监视器扬声器或其他输出，以及一个用于插入电脑的USB-C接口，以及一个3.5毫米的接口，用于连接智能手机或其他外部音频源。智能手机也可以通过蓝牙连接，这对于通过无线方式包括来宾非常方便。\nRODECaster Pro的主表面包括用于每个可用输入和预设音效的音量滑块；用于每个耳机和扬声器输出的音量旋钮；用于激活和停用输入的按钮；用于播放预设音频文件的大按钮和一个大录音按钮。还有一个触摸屏，可以让你访问菜单和设置，还可以在录制时充当视觉级别编辑器。\nRODECaster Pro的设计使您可以完全独立于任何计算机或智能手机使用它-它有一个用于录制的microSD插槽，然后您可以通过USB直接连接卡座或将卡插入microSD卡读卡器并传输文件来上传这些文件。您还可以在RODECaster Pro上使用多轨转USB或立体声USB输出模式，将演播室硬件有效地转换为Mac或PC的USB音频接口，让您可以使用您喜欢的任何数字音频制作软件进行录制，包括流媒体软件。\nRODECaster Pro的设计完美地融合了演播室级的硬件控制和简单性，使得业余爱好者和专业人士都可以使用该设备。我在短短几分钟内就可以开箱即用，在没有对声音配置文件或设置进行任何调整的情况下，我就用RODE PodMic录制了动听的录音。Rod PodMic是一款售价99美元的麦克风，通过RIDE进行了优化，可以开箱使用RODECaster Pro。\n所有控件都易于管理且直观，您不需要阅读任何说明手册或指南即可入门。八个按钮的音效网格可能是整个物理界面中最复杂的部分，但即使Ride包含的默认声音也可能很有用，你可以通过Mac和PC上的RODECaster同伴应用程序轻松设置自己的声音，在方框中你会找到一些指南，可以用来覆盖按钮并对它们进行标记，以跟踪哪个是哪个。\n滑块使用起来非常流畅，可以很容易地对介绍和结尾或预先录制的声音片段进行均匀、手动淡入和淡出。用于活动/非活动输入的背光键、静音状态和大的记录按钮意味着您可以快速一眼看出轨道上哪些是活动的，哪些是当前不活动的。\nRode巧妙地在盒子里包括了一个锁定电源适配器，这样你就不会发现电源线在录制过程中被意外拉出。每个XLR输入还包括一个用于安全连接的快速释放闩锁。虽然RODECaster Pro绝对占据了很大的空间，体积大约相当于13英寸的MacBook Pro，但它足够轻，可以完美地放在背包里进行现场录制。\n触摸屏显示器是另一个设计亮点，因为它是高分辨率的，有一个哑光盖子，使它在广泛的光线范围内都可以看到，以及非常灵敏的触摸输入，这是通过软件扩展甲板功能的一个很好的方式，同时仍然确保没有感觉到麻烦或难以导航，例如，就像你在Zoom录像机上看到的那样，硬件慢跑控制器就是这样的情况。\nRODECaster Pro运行良好的真正原因是如何平衡简单性和功能。如果您刚开始使用它，基本上可以开箱即用，而不需要更改它的工作方式。如果你使用的是RODE的任何麦克风，那就更是如此，每个麦克风都有内置的配置文件，可以即时优化声音设置。\n我在上面提到过，rode PodMic以这种方式与RODECaster Pro配合使用进行了优化，结果非常棒。如果RODECaster Pro的价格是一种威慑，那么值得考虑的是，PodMic是一款价格非常实惠的动态播客麦克风，当与底座搭配时，它产生的声音远远超过同类产品。因此，与其他解决方案相比，使用这两种解决方案的骑行播客设置的总成本实际上是相对合理的。\n如果你准备好投入并定制声音，你可以切换一些功能，如内置压缩器、去ESSER和其他音频效果。自本月早些时候发布固件2.1以来，您还可以手动调整这些效果中的每一个-让您通过RODECaster Pro配套应用程序调整每个包含的声音效果的处理，以获得完全自定义的、独特的最终声音。\n在RODECaster Pro上按需预加载和调用音效和其他音轨的能力是另一个杀手级功能。诚然，你可以在后期录制编辑中实现很多这一点，但在现场录制场景中手头掌握所有这些东西感觉更好，而且它还可以实现与客人的真正互动，否则这是不可能的。2.1版固件更新还带来了无限循环剪辑的能力，如果你想在整个录音中放置一个微妙的背景音乐，这可能是很棒的。\n我要强调的最后一个功能是智能手机连接，因为它非常棒，特别是在一个很难持续让客人进入演播室的世界里。你既可以通过电缆插入，也可以通过低延迟蓝牙连接，在智能手机上使用任何你想要的软件，实现极好的来电互动。\nRODE在构建配件生态系统方面做得非常出色，以进一步扩展RODECaster Pro的功能，并增强整体用户体验。在其最近发布的产品中，有上面提到的rode PodMic，以及与每种输入背光颜色相对应的彩色线夹，可以轻松跟踪哪种硬件是哪种硬件；1/4“到3.5 mm立体声插孔适配器，用于将标准耳机用作显示器；一根TRRS到TRRS 3.5 mm音频辅助电缆，用于智能手机连接；以及一根USB电源线，用于更换适配器，以便在移动中更轻松地插入电源。\nXLR电缆的小塑料袖口是跟踪设备的简单而智能的方式，特别是当每个人都使用相同的麦克风时(为了声音的一致性，它们很可能是应该的)-而且它们还有助于增强您的整体设置的外观。尤其是USB电源线，对于您打算在您自己的录音棚/家庭之外使用的任何RODECaster Pro套件来说都是一个很好的补充，因为您可以将它与您必须手持的任何USB充电器一起使用-只要它可以提供5V/2.5A输出。\n然而，RODECaster Pro真正的必备配件是RADE PodMic。这是一款不大惊小怪、制作精良、经久耐用的麦克风，便于携带，可以灵活地与各种安装选项配合使用，并且可以在各种环境下使用，包括露天和演播室内。是的，你可以用更昂贵的麦克风获得更好的音质，但有了PodMic，你可以买一套四个的麦克风来补充RODECaster Pro，价格与购买一个更高端的麦克风的价格相同，而且大多数人不会注意到他们的播客需求的音频质量差异。\nRODECaster Pro是升级您的家庭播客游戏的绝佳方式，也是在您有能力的情况下带着节目上路的完美方式。它的高质量硬件控制与智能、复杂的软件相结合，通过持续的RODE固件更新来解决用户随时间的反馈，对于业余爱好者、专业人士和介于两者之间的任何人来说，都是一个获胜的组合。", "note_en": "The RODECaster Pro is a powerful production studio, but it’s not overwhelming for people who aren’t audio engineers by trade. The deck balances offering plenty of physical controls with keeping them relatively simple, giving you things like volume sliders and large pad-style buttons for top level controls, and then putting more advanced features and tweaks behind layers of menus accessible via the large, high-resolution touchscreen for users who desire more fine-tuned manipulation.\n RODECaster Pro includes four XLR inputs, each of which can provide (individually selectable) phantom power for condenser mics, along with four 1/4″ headphone outputs for corresponding monitoring. That’s great because it means if you have guests used to recording podcasts and high-quality audio, they can listen to their own input, or you can opt to just have one producer keeping track of everything. There’s also a left and right 1/4″ audio out for a studio monitor speaker or other output, as well as a USB-C connector for plugging into a computer, and a 3.5mm in for connecting a smartphone or other external audio source. Smartphones can also be connected via Bluetooth, which is very handy for including a call-in guest via wireless.\n   The main surface of the RODECaster Pro includes volume sliders for each available input and pre-set sound effects; volume knobs for each headphone and speaker output; buttons to activate and deactivate inputs; large buttons for playing back pre-set audio files and a large record button. There’s also a touchscreen which gives you access to menus and settings, and which also acts as a visual levels editor while recording.\n RODECaster Pro is designed so that you can use it completely independently of any computer or smartphone – it has a microSD slot for recording, and you can then upload those files via either directly connecting the deck through USB, or plugging the card in to a microSD card reader and transferring your files. You can also use multitrack-to-USB or stereo USB output modes on the RODECaster Pro to effectively turn the studio hardware into a USB audio interface for your Mac or PC, letting you record with whatever digital audio production software you’d like, including streaming software.\n  The RODECaster Pro’s design is a perfect blend of studio-quality hardware controls and simplicity, making the device accessible to amateurs and pros alike. I was up and running with the deck out of the box in just a few minutes, and without making any adjustments at all to the sound profile or settings, I had great-sounding recordings using the RODE PodMic, a $99 microphone that is optimized by RODE to work with the RODECaster Pro out of the box.\n  All the controls are easy and intuitive to manage, and you shouldn’t need to read any instruction manuals or guides to get started. The eight button sound effects grid is likely the most complicated part of the entire physical interface, but even the default sounds that RODE includes can be useful, and you can easily set your own via the RODECaster companion app for Mac and PC, and in the box you’ll find guides that you can use to overlay the buttons and label them to keep track of which is which.\n The sliders are smooth and great to use, making it easy to do even, manual fade-ins and fade-outs for intro and outro or pre-recorded soundbites. Backlit keys for active/inactive inputs, mute status and the large record button mean you can tell with a quick glance what is and isn’t currently active on the track.\n RODE has smartly included a locking power adapter in the box, so that you won’t find the cord accidentally yanked out in the middle of a recording. Each of the XLR inputs also includes a quick release latch for secure connections. And while the RODECaster Pro definitely takes up a lot of space with roughly the footprint of a 13-inch MacBook Pro, it’s light enough to be perfectly portable in a backpack for on-location recordings.\n  The touchscreen display is another design highlight, since it’s high-resolution, with a matte cover that makes it viewable in a wide range of light, and very responsive touch input, It’s a great way to extend the functionality of the deck through software, while still ensuring nothing feels fiddly or hard to navigate, which can be the case with hardware jog controllers like you’d find on a Zoom recorder, for instance.\n  Balancing simplicity and power is the real reason RODECaster Pro works so well. If you’re just starting out, you can basically just begin using it out of the box without changing anything at all about how it’s set up to work. That’s especially true if you’re using any of RODE’s microphones, each of which has built-in profiles included for optimizing sound settings instantly.\n I mentioned above that the RODE PodMic is optimized for use with the RODECaster Pro in this way, and the results are fantastic. If the price tag on the RODECaster Pro is a deterrent, it’s worth considering that the PodMic is a fantastically affordable dynamic podcasting mic, which produces sound way above its class when paired with the deck. so the overall cost of a RODE podcasting setup using both of these would actually be relatively reasonable vs. other solutions.\n  If you’re ready to dive in and customize sound, you can toggle features like built-in compressor, de-esser and other audio effects. You can also manually adjust each of these effects since the release of Firmware 2.1 earlier this month – letting you adjust the processing of each included sound effect through the RODECaster Pro companion app for a totally custom, unique finally sound.\n The ability to pre-load and call up sound effects and other audio tracks on demand on the RODECaster Pro is another killer feature. It’s true that you could achieve a lot of this in editing post-recording, but having it all to-hand for use in live recording scenarios just feels better, and it also enables genuine interactions with your guests that wouldn’t be possible otherwise. That 2.1 firmware update also brought the ability to loop clips indefinitely, which could be great if you want to place a subtle backing track throughout your recording.\n One final feature I’ll highlight because it’s fantastic especially in a world where it might be hard to consistently get guests in-studio is the smartphone connectivity. You can either plug in via cable, or connect via low-latency Bluetooth for terrific call-in interactivity, using whatever software you want on your smartphone.\n  RODE has done a great job building out an ecosystem of accessories to further extend the capabilities of the RODECaster Pro, and enhance the overall user experience. Among its recent releases, there’s the Rode PodMic, mentioned above, as well as  colored cable clips that correspond to each input backlight color for easily keeping track of which hardware is which,  1/4″ to 3.5mm stereo jack adapters for using standard headphones as monitors, a  TRRS-to-TRRS 3.5mm audio aux cable for smartphone connections, and a  USB power cable to replace the adapter for easier plug-in power on the go.\n  The small plastic cuffs for your XLR cables are simple but smart ways of keeping track of gear, especially when everyone’s using the same mic (as they likely should be for sound consistency) – and it helps that they enhance the look of your overall setup, too. And the USB power cable in particular is a great addition to any RODECaster Pro kit that you’re intending to use outside of your own recording studio/home, since you can use it with any USB charger you have to hand – so long as it can provide 5V/2.5A output.\n The real must-have accessory for the RODECaster Pro, however, is the  RODE PodMic. It’s a no-fuss, well-built and durable microphone that transports well and that can work flexibly with a wide range of mounting options, and in a wide variety of settings including open air and in-studio. Yes, you can get better sound with more expensive mics, but with the PodMic, you can afford a set of four to complement the RODECaster Pro for the same price you’d pay for one higher-end microphone, and most people won’t notice the audio quality difference for their podcasting needs.\n   The RODECaster Pro is a fantastic way to upgrade your at-home podcasting game – and a perfect way to take the show on the road once you’re able to do so. Its high-quality hardware controls, combined with smart, sophisticated software that has improved with consistent RODE firmware updates to address user feedback over time, are a winning combo for amateurs, pros, and anyone along the spectrum in between.", "posttime": "2020-06-26 22:59:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "播客,rodecaster,updates,用于", "title": "\n通过功能更新和新的附件，RODECaster Pro是播客梦想成真", "title_en": "\n\t\t\t\tWith feature updates and new accessories, the RODECaster Pro is a podcaster’s dream come true\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/with-feature-updates-and-new-accessories-the-rodecaster-pro-is-a-podcasters-dream-come-true/", "via": "", "real_tags": ["播客", "updates", "用于"]}, {"category": "", "categoryclass": "", "imagename": "114daf5688dca608ab2f762881f43034.jpg", "infoid": 1008415, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软一直在计划推出第二款价格更低、功耗更低的下一代Xbox游戏机。代号为洛克哈特的这款游戏机，旨在吸收Xbox系列X中的大部分关键的下一代改进，并以1080p或1440p的较低价位提供游戏。发布在Twitter上的一份新泄露的微软文档中提到了这个洛克哈特游戏机和多个“斯嘉丽项目游戏机”(Project Scarlett Console)。\nScarlett项目是微软在正式命名之前最初用来展示其Xbox Series X控制台的名字。有传言称，在更广泛的斯嘉丽计划下，有两款下一代游戏机：蟒蛇(Anaconda)和洛克哈特(Lockhart)。微软已经在Xbox Series X主板上蚀刻了一条蟒蛇，但该公司从未公开讨论过其洛克哈特计划。\nXbox Series X主板上刻有一条蟒蛇，那么洛克哈特又会刻上什么呢？pic.twitter.com/cV7oXoDZmO。\n-汤姆·沃伦(@tomwarren)2020年3月17日。\n泄露的文件还提到了洛克哈特分析模式。熟悉微软Xbox计划的消息人士告诉The Verge，这种特殊的洛克哈特模式是Xbox Series X开发工具包的一部分。代号为但丁的devkit允许游戏开发商启用一种特殊的洛克哈特模式，该模式具有微软希望在第二台游戏机上达到的性能概况。据我们所知，这包括7.5 GB的可用RAM，略微低于频率的CPU速度，以及大约4万亿次的GPU性能。Xbox系列X包括13.5 GB的可用RAM，目标GPU性能为12万亿次浮点。\n开发人员将能够使用此洛克哈特模式根据此性能配置文件测试他们的游戏，并进行验证检查。微软预计将把其洛克哈特游戏机定位为1080p或1440p游戏，这是目前PC游戏显示器使用的两种最流行的分辨率。\n虽然微软还没有承认洛克哈特，但在该公司的Xbox One操作系统中也可以找到这个代号，以及对蟒蛇和但丁的引用。我们了解到，如果微软不在最后一刻取消，第二代下一代Xbox游戏机将与Xbox Series X一起发布。洛克哈特可能会被命名为“Xbox Series S”，这解释了为什么微软将“Xbox Series”商标注册为“Xbox Series”品牌。\n第二款Xbox游戏机将是微软下一代游戏机定价策略的关键。该公司已经承诺为Xbox Series X推出Xbox All Access订阅，捆绑包括游戏机、Xbox Live和Xbox游戏通行证，按月收费。微软Xbox首席执行官菲尔·斯宾塞(Phil Spencer)本周早些时候在Game Lab Live的一次主题演讲中表示：“Xbox All Access对我们推出Xbox Series X以及整个一代产品都将是至关重要的。”", "note_en": "Microsoft has been planning a second, cheaper and less power next-gen Xbox console.  Codenamed Lockhart, it’s designed to take most of the key next-gen improvements found in the Xbox Series X and provide them at a lower price point for gaming at 1080p or 1440p. A newly leaked Microsoft document,  posted on Twitter, includes references to this Lockhart console and multiple “Project Scarlett consoles.”\n Project Scarlett was the name  Microsoft originally used to reveal its Xbox Series X console before it was officially named. Rumors had suggested two next-gen consoles under the broader Project Scarlett plans:  Anaconda and Lockhart. Microsoft has etched an anaconda snake into the Xbox Series X mainboard, but the company has never publicly discussed  its Lockhart plans.\n an Anaconda snake is etched into the Xbox Series X mainboard, so what&#39;s going to be eteched into Lockhart?  pic.twitter.com/cV7oXoDZmO\n— Tom Warren (@tomwarren)  March 17, 2020\n The leaked document also mentions a Lockhart profiling mode. Sources familiar with Microsoft’s Xbox plans tell  The Verge that this special Lockhart mode is part of the Xbox Series X developer kit. The devkit, codenamed Dante, allows game developers to enable a special Lockhart mode that has a profile of the performance that Microsoft wants to hit with this second console. We understand that includes 7.5GB of usable RAM, a slightly underclocked CPU speed, and around 4 teraflops of GPU performance. The Xbox Series X includes 13.5GB of usable RAM, and targets 12 teraflops of GPU performance.\n Developers will be able to use this Lockhart mode to test their games against this performance profile and do validation checks. Microsoft is expected to position its Lockhart console for 1080p or 1440p gaming, two of the most popular resolutions used by PC gaming monitors currently.\n   While Microsoft hasn’t acknowledged Lockhart, the codename can  also be found in the company’s Xbox One operating system, alongside references to Anaconda and Dante. We understand this second next-gen Xbox console will launch alongside the Xbox Series X providing Microsoft doesn’t cancel it at the last minute. Lockhart will likely be named “Xbox Series S,” which explains why Microsoft  trademarked the “Xbox Series” branding.\n This second Xbox console will be key to Microsoft’s pricing strategy for the next generation of consoles. The company has already committed to introducing its  Xbox All Access subscription for the Xbox Series X, a bundle that includes a console, Xbox Live, and Xbox Game Pass for a monthly fee. “Xbox All Access is going to be critical to both our launch for Xbox Series X as well as just the overall generation,” said Phil Spencer, Microsoft’s Xbox chief, in a Game Lab Live keynote earlier this week.\n Microsoft  currently offers an Xbox One S All Digital Edition subscription for $19.99 a month that includes Xbox Game Pass Ultimate. It’s reasonable to imagine that this Lockhart console will be offered in a similar way to entice people into Microsoft’s subscription offerings. Microsoft is also bundling its Project xCloud game streaming technology into Xbox Game Pass later this year, in yet another effort to bolster its subscription service.", "posttime": "2020-06-26 22:58:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,微软,文档,xbox", "title": "泄露的微软文档暗示第二代下一代Xbox", "title_en": "Leaked Microsoft Document Hints at Second Next-Gen Xbox", "transed": 1, "url": "https://www.theverge.com/2020/6/26/21304112/microsoft-xbox-series-x-lockhart-leaked-document-specs-rumors", "via": "", "real_tags": ["microsoft", "微软", "文档", "xbox"]}, {"category": "", "categoryclass": "", "imagename": "1dcfeecc84f2f7eb67d0e636a1b1068f.png", "infoid": 1008414, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "6摘要：结构和导航必须相互支持，并与搜索和跨子站点集成。复杂性、不一致性、隐藏选项和笨拙的UI机制使用户无法找到他们需要的东西。\n糟糕的信息架构导致了大多数彻底的用户失败，而且ISN的改善速度没有达到其他Web可用性问题的速度。为了找出原因，我找出了10个长期疼痛的拇指，它们每年总共给网站造成数十亿美元的损失。\n我将以下IA最严重的错误分为两部分，这与我们在IA课程中划分材料的方式相对应：结构和导航。当然，你需要两个都做对，但它们本质上是两个不同的设计层次：看不见的站点结构方式和用户理解和管理该结构的可见方式。\n最值得注意的结构性问题是，当设计师把一个网站当成一个大沼泽，没有针对单个项目的组织原则时。是的，用户可以使用搜索，或者通过跟踪当前促销或外部网站的链接来钓鱼。但不管他们挖出的是什么都是。没有机会了解网站的其他产品或定位相关物品。\n这种错误在新闻网站和基于目录的电子商务网站上很常见，在这些网站中，每个项目(分别是文章和产品)都被视为一个独立的单元，与相关项目没有联系。难怪用户离开这些网站这么快。\n我们很早就知道，用户经常表现出搜索主导的行为。然而，这并不意味着搜索就是他们需要的全部。从搜索中到达一页就像空降到一座城市。希望如果你想去巴黎，你会在那里降落，而不是在阿姆斯特丹，但无论如何，你都不太可能降落在你最喜欢的餐厅的门口。要到那里，你需要步行或打车。同样，用户通常需要在他们的搜索目的地附近导航。\n当然，只有当站点具有定义其邻域的结构时，本地导航才能起作用(参见错误#1)。但设计还必须向用户公开本地选项。如果它表明相邻选项与用户的当前查询有多相关，那就更好了。\n当每个搜索命中显示其在站点结构中的位置时，SERP(搜索引擎结果页面)的可用性会增加。像谷歌这样的外部搜索引擎并不总是能做到这一点，因为它们不知道网站的结构，也不知道哪些导航维度与常见的网站任务最相关。但你确实知道你的网站的结构，因此应该包括在你自己的SERP上的信息。\n遗憾的是，在许多网站上，搜索和导航无法相互支持。另一个常见的错误加剧了这个问题：导航设计没有指明用户的当前位置。也就是说，在用户点击搜索结果后，他们无法确定自己在网站中的位置--就像当你搜索裤子并点击一条裤子，但随后无法看到更多裤子时一样。\n我们建议网站有一系列类别，每个类别都链接到自己的登录页面，为用户提供部分概述。有时，网站会放弃总览页面，直接提供指向某个部分中各个页面的链接。这可能会减少网站页面的数量，但当没有页面被明确标识为副主题页面时，用户可能会误解网站的范围，并错过重要的详细信息、产品和服务。\n分类页面也可以帮助搜索引擎优化，因为当人们搜索某种类型的产品、服务或信息时，它们是最显眼的着陆点。它们也是克服错误#2的一种方法，因为如果搜索将用户带到一个过于详细的叶节点，它们可以帮助用户在站点结构中提升一到两个级别。(面包屑可以方便用户轻松提升级别。)。\n与现实世界相比，在线世界的好处之一是物品可以存放在多个地方。因为网站可以从多个维度对产品和其他内容进行分类，所以它们可以帮助用户在本地导航到相关项目，并将大量产品空间分方面筛选成可管理的短名单，以满足用户的主要需求。\n这一切都很好，但多层次结构很容易成为拐杖。团队不会花时间预先开发几个直观而有逻辑的顶级类别，而是匆忙完成这个重要的过程，创建大量的弱类别，并在其中多次列出产品。可用性的影响是什么？用户在顶级分类上花费了太多的时间，当他们看到多个地方出现的项目时，他们会感到困惑(这些是同一件事吗？&#34；)。\n太多的分类选项和太多的结构化维度，迫使用户更努力地思考前进。选择的丰富也让人们对信息的味道产生了质疑。这种在网站早期缺乏信心的体验会延续到他们的整个访问过程，并可能对最终结果产生负面影响(例如，通过阻碍购买)。\n废弃的微型网站作为旧营销活动的碎屑散落在网络上。当你推出一款新产品时，专门的微型网站可能是个好主意，但到了第二年，它会破坏你的在线战略，稀释你的在线影响力。\n网页设计是为时代而设计的。想一想你做的任何事情在5年后会有什么感觉。\n通常情况下，最好放弃独立的微型站点，将新信息放在主站点内的子站点上。但是您仍然需要将这些子站点集成到整个站点结构中。\n例如，在微型网站和子网站上，我们经常看到特定于产品的页面无法链接到产品背后的公司或组织的信息。此外，许多站点在主站点搜索中不能很好地代表它们的子站点-这通常完全忽略微站点。\n最糟糕的错误可能是没有导航，但这种情况非常罕见，我不打算讨论它。尽管如此，用户看不到的任何功能也可能不存在；因此，看不见的导航几乎和没有导航一样糟糕。\n发现导航不应该是一项主要任务：让它在页面上永久可见。小孩子喜欢扫雷(在屏幕周围移动鼠标看看里面藏了什么)，但青少年不喜欢，成年人也讨厌。\n同样，当导航本身看起来像横幅，或者您将其放在看起来像广告的元素旁边，从而用户将其屏蔽掉时，您应该避免横幅失明。即使你的导航显示在屏幕上，如果用户不看，你的导航也可能是看不见的。\n通常情况下，任何移动和反弹的东西都会损害Web的可用性；当导航移动而用户试图找到自己的路时，这是致命的。用户应该关注较高级别的问题，即去哪里，而不是较低级别的问题，即如何操作GUI。\n这里的两个常见违规者是启动和阻止内容的过度敏感的滚动，以及自动移动、旋转或旋转的元素。用户经常抱怨这些类型的元素。在网站中使用它们的设计师和程序员严重低估了用户挫折感带来的商业影响。\n导航的存在是为了帮助用户，而不是它本身就是一个谜。用户应该能够立即理解它，并将这种理解应用于整个站点。可悲的是，随着用户的移动，许多网站改变了它们的导航功能。选项来来去去，让用户感到失控。我怎么才能拿回菜单选项呢？我几页前才看过。\n虽然全球导航不是网站最受欢迎的元素，但它的持久性有一个关键目的：它是一个帮助用户了解自己所在位置以及在迷路时如何轻松返回网站顶部的灯塔。\n我们全天的导航设计研讨会涵盖了25种不同的网站导航技术。每种方法都有自己的易用性优势和潜在的劣势，导致研讨会将重点放在设计的权衡上-也就是，什么时候使用什么形式的导航。\n有一点是明确的：每种导航技术在某些类型的网站和内部网上都有自己的位置。但是，如果你全部使用它们，你不会得到每种技术的益处的总和。你会弄得一团糟。\n在过去，这个错误的排名会更高，但幸运的是，现在它不像过去那么突出了。尽管如此，仍然有太多的网站继续为标签和其他导航选择编造自己的术语。\n除了让用户困惑之外，编造的导航词还会损害搜索；如果用户不知道它叫什么，他们就找不到东西。即使你提供了同义词，主要的导航词也会带来额外的SEO权重，为没有人会发布的查询进行优化是一种浪费。\n老字眼更好。当用户了解他们的选择时，他们更有可能选择正确的选择。直言不讳，言简意赅。如果用户不理解菜单项，他们不太可能点击该菜单项。矛盾的是，公司尤其倾向于为他们最新也是最重要的产品编造花哨的条款，从而用双管步枪击中自己的脚。", "note_en": "6    Summary: Structure and navigation must support each other and integrate with search and across subsites. Complexity, inconsistency, hidden options, and clumsy UI mechanics prevent users from finding what they need.\n    Bad information architecture   causes the majority of outright user failures and isn&#39;t improving at the rate of other Web usability issues. To determine why, I&#39;ve identified 10 long-term sore thumbs that together cost websites billions of dollars each year.\n I divided the following list of worst IA mistakes into two parts, which corresponds to how we partition the materials across our IA courses:   structure and  navigation. Of course, you need to get both right, but they&#39;re essentially two different design levels: The   invisible  way the site is structured and the   visible  way users understand and manage that structure.\n   The most notable structural problem is when designers treat a site like one big swamp with   no organizing principle  for individual items. Yes, users can fish the swamp using search or by following links from current promotions or outside sites. But whatever they dredge up is it. No opportunities for understanding the site&#39;s other offerings or locating related items.\n This sin is common on news sites and catalog-based e-commerce sites, where each item (articles and products, respectively) is treated as a stand-alone unit without connections to related items. No wonder users leave those sites so quickly.\n  We&#39;ve long known that users often exhibit   search-dominant behaviors. This  doesn&#39;t mean that search is all they need, however. Arriving on a page from a search is like parachuting into a city. Hopefully, if you want to go to Paris, you&#39;ll land there rather than in Amsterdam, but in any case, you&#39;re unlikely to land on the doorstep of your favorite restaurant. To get there, you&#39;ll need to walk or take a cab. Similarly, users often need to   navigate the neighborhood around their search destination.\n Of course,  local navigation works only if the site has a structure to define its neighborhoods (see mistake #1). But the design must also expose local options to users. Even better if it indicates how relevant the neighboring options are to the user&#39;s current query.\n SERP (search engine results page) usability increases when each search hit exposes its location within the site structure. External search engines like Google can&#39;t always do this because they don&#39;t know the site&#39;s structure or which navigational dimensions are most relevant to common site tasks. But you do know your site&#39;s structure and should therefore include the info on your own SERPs.\n Sadly, search and navigation fail to support each other on many sites. This problem is exacerbated by another common mistake:  navigation designs that   don&#39;t indicate the user&#39;s current location. That is, after users click a search result, they can&#39;t determine where they are in the site — as when you&#39;re searching for pants and click on a pair, but then have no way to see more pants.\n  We recommend that sites have a series of categories that each link to their own landing page that gives users a   section overview. Sometimes, sites forego the overview page and simply offer links directly to individual pages within a section. This might reduce the number of site pages, but when no page is clearly identified as a sub-topic page, users can misunderstand the site&#39;s scope and miss important details, products, and services.\n Category pages also help SEO because they&#39;re the most prominent landing place when people search for a type of product, service, or information. They&#39;re also a way to overcome mistake #2 because they help users bump up a level or two in the site structure if search takes them to an overly detailed leaf node. ( Breadcrumbs facilitate users&#39; ability to easily move up the levels.)\n  Compared to the physical world, one of the online world&#39;s benefits is that items can live in multiple locations. Because websites can classify products and other content along multiple dimensions, they help users navigate locally to related items and provide faceted winnowing of a large product space into manageable shortlists that can satisfy the user&#39;s main requirements.\n This is all good, but polyhierarchy can easily become a crutch. Rather than spend time upfront to develop several intuitive and logical top-level categories, teams rush through this important process, creating  numerous weak categories and listing products multiple times within them. The usability impact? Users spend too much time agonizing over top-level categories and then get confused when they see items showing up in multiple places (&#34;are these the same thing?&#34;).\n With too many classification options and too many structured dimensions,  users are forced to think harder to move forward. The profusion of options also makes people question the information scent. This lack of confidence early in the site experience extends throughout their visit and can negatively impact the end result (by thwarting a purchase, for example).\n  Abandoned microsites litter the Web as the detritus of old marketing campaigns. A dedicated microsite might have been a good idea back when you launched a new product, but by the next year it&#39;s undermining your online strategy and diluting your online presence.\n Web design is design for the ages. Think about how anything you do will feel in 5 years.\n It&#39;s typically best to forego independent microsites and place new information on subsites within the main site. But you still need to  integrate these subsites within the overall site structure.\n For example, on both microsites and subsites, we often see product-specific pages that   fail to link to information about the company or organization behind the offering. Further, many sites poorly represent their subsites in the main site search — which often ignores microsites altogether.\n   The very worst mistake might be to have    no  navigation, but that&#39;s so rare that I&#39;m not going to discuss it. Still, any feature that users can&#39;t see might as well not exist;  invisible navigation is thus nearly as bad as no navigation.\n Uncovering navigation shouldn&#39;t be a major task: Make it permanently visible on the page.   Small children like minesweeping (passing the mouse around the screen to see what&#39;s hidden), but   teenagers don&#39;t like it, and adults hate it.\n Similarly, you should avoid   banner blindness bleed, when either the navigation itself looks like a banner or you place it next to elements that   look like advertising and thus users screen it out. Even if it&#39;s on the screen, your navigation might as well be invisible if users don&#39;t look at it.\n  Typically, anything that moves and bounces detracts from Web usability; when navigation moves while users are trying to find their way, it&#39;s deadly. Users should focus on the higher-level problem of where to go, not the lower-level problem of how to manipulate the GUI.\n Two common offenders here are overly sensitive rollovers that launch and block content, and elements that move, spin, or rotate of their own accord. Users routinely complain about these types of elements. Designers and programmers who include them in websites severely underestimate the business impact of   user frustration.\n  Navigation exists to help users, not to be a puzzle in its own right. Users should be able to understand it immediately, and apply that understanding throughout the site. Sadly, lots of sites change their navigation features as users move around. Options come and go, making users feel a loss of control.   How do I get that menu choice back? I saw it just a few pages ago.\n Although   global navigation  is not a site&#39;s most popular element, its persistence serves a key purpose: it&#39;s a beacon that helps users understand both where they are and how they can easily maneuver back to the top of the site if they lose their way.\n  Our full-day   seminar on navigation design covers   25 different website navigation techniques. Each approach has its own usability advantages and potential downsides, leading to the seminar&#39;s focus on design trade-offs — that is, when to use what form of navigation.\n One thing is clear: each navigation technique has its place on certain types of websites and intranets. But, if you use them all, you don&#39;t get the sum of each technique&#39;s benefits. You get a   mess.\n   In the past, this mistake would have ranked higher, but luckily it&#39;s less predominant today than it used to be. Still, too many sites continue to  make up their own terminology for labels and other navigation choices.\n In addition to perplexing users, made-up navigation terms also hurt search; users can&#39;t find something if they don&#39;t know what it&#39;s called. Even if you provide synonyms, the main navigation terms carry extra SEO weight and it&#39;s a waste to optimize for a query that nobody will issue.\n Old words are better. When users understand their choices, they&#39;re more likely to pick the right one. Speak plainly and speak simply. If users don&#39;t understand a menu item, they&#39;re less likely to click on it. Paradoxically, companies are particularly prone to making up fancy terms for their newest and most important offerings, thus shooting themselves in the foot with a double-barreled rifle.", "posttime": "2020-06-26 22:50:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "架构,information", "title": "最大的信息架构错误(2009)", "title_en": "Top Information Architecture Mistakes (2009)", "transed": 1, "url": "https://www.nngroup.com/articles/top-10-ia-mistakes/", "via": "", "real_tags": ["架构"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008412, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作者声明：[Ed.。注：此帖子包含促销！这基本上是对我目前的在线互动节目“破碎的空间”的一次推广。]。\n[但我也有很多很酷的技术东西要告诉你，所以请留下来，如果这听起来很有趣，请随意在这里买票！]。\n可以肯定地说，过去几个月的情况与我们许多人的预期有很大不同。3月初，当隔离开始，我所有的投影设计演唱会都被取消时，我联系了几个亲密的朋友，谈到完全在网上建立非线性影院体验的事情。很多人一直在尝试在Zoom上表演戏剧(并找到了许多有趣和聪明的方式来使用这种媒体)，但我觉得如果我们建立自己的定制视频会议应用程序，我们就可以做出一些真正独特的东西。\n疯狂？那肯定是10年前的事了。但网络平台的进步(以及移动设备中摄像头和硬件的质量)将这一点带入了“可能-如果有点堂吉诃德式的话”的境地。\n三个月后，我们已经做到了：“破碎的空间”是一部互动剧场，讲述了一个双星系统的双星(“母亲”)已经消失的故事。你和你的观众同伴是明星骑师，他们被征召乘坐宇宙飞船四处飞来飞去，以了解Matra系统的居民，看看你们能做些什么来帮助你们。\n如果你想更好地了解正在发生的事情，这里有个预告片。\n如果你看了那个预告片，你可能已经知道这个节目涉及3D图形(WebGL)、视频会议(WebRTC)，也许还包括一些音乐和音频处理(Web Audio)。这些都是我过去在某种程度上使用过的技术，但这次展览要求我以完全不同的方式来思考它们。这一切都是因为以下中心问题：\n这个基于WebRTC的监控系统允许后台乐队实时看到舞台，并从演员那里获得线索。前台门户使用WebGL进行渲染。(欢迎来到2019年巴尔的摩摇滚歌剧协会莎士维尔)\n在过去的几年里，我已经使用WebGL和WebRTC为许多节目构建了投影/视频效果，但在每一种情况下，我都在编写只能在我的计算机上运行的代码。如果我遇到影响我的电脑(或我的iPhone，或我的Raspberry PI团队)的设备特定错误，我有足够的时间和访问权限来调试它或想出解决办法。这次不行。\n如果有人支付我们15美元，通过电子邮件收到登录链接，试图在一台便宜的2014年笔记本电脑上打开它，但它无法在不崩溃的情况下加载，那就是退款。我们不仅仅是在摆弄先进的网络功能，我们还需要以最经久耐用、最具弹性的方式部署它们，同时还需要捕获刚刚足够的数据和日志，以查明谁有问题，并在节目开始前理想地解决这些问题。\n这意味着超越您在入门教程中看到的代码种类，真正深入研究这些API如何处理内存管理、它们如何响应连接问题、它们如何失败，以及如何在运行时进行调整以确保帧率保持在较高水平并且丢弃的数据包很少。我学到了很多关于制作这些特性的知识，我想尽可能多地与大家分享，但首先让我们谈谈基础知识。\n“破碎空间”的参观者被分成6组，每组5人。每组被分配到一艘围绕系统飞行的“船”上，他们与节目中的角色作为一个组进行互动。与会者可以选择将麦克风静音，如果他们愿意的话，可以关闭摄像头(边上有一个短信聊天，他们可以用来交流)，尽管我们鼓励人们在感觉舒服的情况下让他们一直开着。\n7台Janus WebRTC媒体服务器。每艘船一张，还有一张额外的，用来播放结尾场景的实况转播。\nAdmin App是一款Reaction/Redux Web应用程序，它处理日程安排表演，跟踪哪个演员正在与哪艘船交谈，并具有实时仪表板，其中包含客户端错误和连接问题的日志。\n演员应用程序(Actor App)，一个由演员使用的Reaction/Redux网络应用程序，用于通过音频、视频、文本和从船舶库存中赠送/取走物品与观众互动。\nAttendee App是一款Reaction/Redux网络应用程序，与会者可以在其中观看演出，并通过音频、视频和文本与演员和其他人互动。\n当我说Show Service“跟踪节目的整体状态”时，我指的是所有状态。大多数Redux操作(在所有3个应用程序中)不会改变Reducer的状态，而是命中Show Service上的端点，该端点更改数据库中保存的状态，然后从数据库获取所有状态，并将其作为WebSocket消息发送给所有用户，然后该消息将覆盖Reducer的大部分状态。这样，任何客户端在API调用返回之前乐观地更新其减少器都不会导致“孤立状态”，并且可以通过单个数据库调用来获取所有用户的更新状态(这个针对每个人的刷新所有状态的方法被取消并实现了排队机制，以确保我们不会同时有太多的数据库调用)。\n我基本上采用了丹·阿布拉莫夫的简单而优雅的系统，并对其进行了这样的处理。抱歉，丹。\n(我要指出的是，这种体系结构在某种程度上是有机地出现的，而且可能有更干净或更优化的方式来实现这种“Redux-但-the-server-is-the-Reducer”体系结构。我对像Relay或Meteor这样的产品是否更适合V2的反馈意见持开放态度。)。\n通过Admin应用程序，我们可以查看谁已登录以及节目中发生了什么。\n在3个Reaction/Redux应用程序中，Admin应用程序使用的Web技术最少，几乎只是一个显示数据库内容的仪表盘。作为管理员，我们可以看到哪些演员和与会者已经登录，哪些船当前正在访问哪些演员，如果需要，我们可以在船上之间移动与会者，我们还可以看到演员和与会者遇到的错误列表(稍后将详细介绍)。\n演员应用程序允许表演者与观众互动，并查看与他们交谈的船只的信息。\nActor App更为复杂，因为它需要处理WebRTC和媒体设备问题。它还有3种模式：正常、移动(如果窗口的尺寸小于500px，则自动使用)和Headless(如果querystring变量Headless设置为true，则使用)。正常模式由大约一半的演员使用，能够让他们看到自己，配置音频/视频设备，更改有关用户、角色或行星的任何信息，以及查看有关与他们交谈的船只的信息(他们的聊天、库存、以前地方的历史等)。\n演员应用程序的移动和无头模式使我们的演员可以灵活地使用他们可用的任何设备\nMobile模式使用基于选项卡的布局来尝试并实现所有相同的目标，但是由于一次只能在屏幕上显示一个选项卡，单独使用它有点麻烦。我们有Headless模式，它不执行任何音频/视频流，但显示关于当前船的所有信息，并且可以在任何笔记本电脑上运行。许多演员选择使用移动模式(因为他们的手机有很好的摄像头)，但在旧笔记本电脑上保持无头模式打开，以便更容易使用其他功能。\n与会者应用程序和演员应用程序一样复杂，但没有Headless模式(这实际上只是演员的高级用户功能)。这款应用程序有多个屏幕，对应于节目的不同阶段：\nPresshow-大堂屏幕，与会者可以在这里会见将与他们一起飞行的船友。\n自由播放-节目的主要部分，参观者在与角色互动和从导航屏幕选择下一个目的地之间交替。\n结束-这只是将参与者从应用程序重定向到一个静态页面，其中包含我们演员的个人资料。\n在节目的最后，我表演了一个场景，扮演星际骑师的人工智能指挥官恐慌上校。在这个场景中，我走遍了每一艘船，回顾了他们设法收集的物品。然后，一个“决心”发生了，我不会破坏这里。\n这场表演是在我的台式PC(英特尔8700K+RTX 2080TI)上呈现的，并带有我专门为此构建的Actor应用程序的特殊版本。这里的Three.js场景包括至少7个带有MeshPhysicalMaterial和12个Moving PointLight的大型模型，所以我没有在与会者的电脑上渲染，而是在我的电脑上渲染，并使用Elgato Camlink 4K、ffmpeg和Janus(下面解释)流媒体插件将其流式传输给他们。\n动作捕捉工作是通过从ARKit文档中提取苹果TrackingAndVisualizingFaces示例的修改版本，并让它通过WebSocket将每一帧mocap数据发送到服务器，然后服务器将其转发到Host应用程序来完成的。令人惊讶的是，它可以在低于100ms的延迟下工作，但它确实如此。\n我计划在展览结束后将所有这些都开源，但我想清除git的历史，以防有任何秘密存在，我要警告任何感兴趣的洞穴探险者，它将更像是一件“有趣的艺术品”，而不是“一件你可以很容易在当地跑起来的东西”。\n在撰写本文时，在浏览器中进行实时视频会议的唯一免插件方式是通过WebRTC，这是一种实时通信的Web标准，可以处理流式音频、视频，甚至是任意数据包。在教程中，WebRTC经常被演示为一种点对点通信工具，它当然可以做到这一点。但是如果您在一个房间中有5个与会者，那么每个人必须广播4个音频/视频流(每个与会者一个)，并接收另外4个流。对于有连接问题或正在使用移动网络的人来说，这可能很困难。\n通常，如果您想构建一个基于Web的视频会议产品，您会希望云中的服务器能够为您多路复用这些流。这样，每个与会者只需要发送他们的流的一个副本(他们仍然必须接收另外4个，这是无能为力的)。这两种方法的行业术语是“网状”与。“选择性转发单元”(通常缩写为SFU)。\n有很多开源服务器可以做到这一点，我们用于粉碎空间的服务器是MeetEcho团队的Janus。我是在其他项目中熟悉它的，它的维护人员已经投入了多年的持续工作(认真看看这张贡献者图表)，而且由于它是用C语言编写的，所以它的速度非常快，几乎从未在EC2上的t3a.nan上达到两位数的CPU使用率。\nJanus不仅为您多路复用数据流，它还拥有一些API，可以帮助您完成启动WebRTC会话所需的大量麻烦的信令和NAT攻击。所有这些都封装在一个客户端JS库中，其中包含许多很好的、有用的示例，可以作为项目的起点(如果您还不了解它，我真的很喜欢它)。\n我遇到的两个棘手问题围绕着接下来的两个部分的主题：\n但除此之外，贾纳斯很棒。我从来不需要因为内存泄漏而随机重启服务器，插件系统为你提供了大量的功能选项，你可以在几分钟内创建一个Docker镜像并部署它。说真的，看看这玩意儿。\n创建和维护WebRTC PeerConnection是您在前端可以做的最具副作用的事情之一。您需要：\n多种类型的错误，每种错误都有不同的错误处理程序(其错误需要根据其原因以不同的方式处理)。\n创建更有状态副作用的多种其他事件(如用户加入房间、离开房间或切换静音开关)。\n需要“清理”或处理大量未解决的问题，比如来自本地媒体设备的连接对象或流(我们稍后将介绍这些内容)。\n我没有任何尊重我的时间的观念，所以很自然地，我选择用Redux来构建这个应用程序。\n撇开玩笑不谈，我真的很喜欢Redux和它让我组织应用程序的方式。我已经使用它很多年了(通常是通过生成器-反应-webpack-REDUX)，并且发现它非常适用于许多项目。尽管如此，它最大的弱点之一是在处理副作用方面。我通常使用redux-thunk包来处理异步或副作用流程，但对于这一次，我决定尝试redux-saga。这是个不错的选择。\nRedux Saga需要一些时间才能让你头脑清醒(与JS世界的其他人不同的是，它跳下了异步/等待列车，登上了发电机一号)。但是一旦这样做了，您就会发现它能够创建抽象，承诺和异步/等待只能梦想着像事件通道一样，可取消的异步任务，甚至是单线程事件循环中的“分叉”进程。这对于像这样的时候是很棒的，在这样的时候，你需要旋转一些东西来响应一个动作，吸入它发出的任何动作，并在你完成它之后清理干净。我打算写一篇关于在WebRTC应用程序中使用Redux Saga的更详细的文章，因为它们是为彼此而生的配对。\n尽管这是许多WebRTC入门教程的主题，但这款应用程序最难的部分是首先获得用户的摄像头和麦克风。当然，80%的时间都很简单，只需等待Navigator.mediaDevices.getUserMedia({audio：true，video：true})，然后如果用户认为您的应用程序值得，您就会收到一个您可以在&lt；video&gt；元素中查看的MediaStream，然后发送一个RTCPeerConnection等等。虽然这基本上是正确的，但如果您正在构建一个真正的生产应用程序，您还需要考虑其他一些问题。\n首先，如果用户拒绝您的摄像头和/或麦克风请求，您需要一种在不减少太多功能的情况下优雅地后退的方法。在我们的案例中，我们礼貌地要求用户允许我们使用他们的麦克风和摄像头，并让他们知道他们可以在节目中随时打开或关闭它们。但如果他们不信任我们，想要通过短信聊天(同时观看和听到他们的船友和演员)完成整部剧，我们也要确保让他们这样做。这使得事情变得复杂(部分原因是我们试图检测用户是否允许摄像头但不允许麦克风，反之亦然)，但我们只是触及了皮毛。\n如果你的用户的设备设置像我的一样一团糟，你需要给他们工具让他们自己找出来。\ngetUserMedia可用的默认视频和音频源可能不是用户打算使用的。例如，用户可能具有：\n一个好的USB麦克风，一个带有坏麦克风的蓝牙耳机(但它是最近安装的，是浏览器的默认麦克风)。\n在他们的监视器上安装了一个良好的USB摄像头，在他们的笔记本电脑上安装了一个以“翻盖模式”运行的内置摄像头(但浏览器选择了这种模式作为默认模式)。\n一个好的usb网络摄像头，当你试图访问它时，它会“挂起”…。因为它正被像SplitCam这样的网络摄像头过滤器应用程序使用，SplitCam提供了它自己的伪视频设备，您应该改用它。\n一种采集卡或类似的设备，以网络摄像头的形式呈现，但实际上只显示用户监视器上的内容。\n因此，您自然会想要制作一个选择器，允许用户选择要使用的设备(或者根本不使用设备)。为此，您需要Navigator.mediaDevices.EnumererateDevices()，它返回用户可用设备的完整列表、它们的用户可读标签，以及您可以用来请求其提要的deviceID，所有这些都不会提示用户许可。\n如果用户没有授予权限(或者没有被询问)，您将得到一个列表，其中只包含默认的音频和视频设备、它们的groupID(而不是deviceID)，没有标签。这是为了防止指纹识别，而且一切都很好，因为您可以通过调用Navigator.mediaDevices来确定是否提示用户访问麦克风/摄像头……嗯，没有办法做到这一点。\n因此，当我们的应用程序启动时，获取可用设备列表的逻辑如下所示：\n尝试{//在此之后，我们将确定是否请求了权限let stream=await Navigator。媒体设备。getUserMedia({video：true，audio：true})；//但这些可能不是我们真正想要的设备，//因此转储此流，等待用户选择设备流。getTracks()。地图(Track=&gt；{流。移动轨道(轨道)；轨道。stop()；})；//如果我们已经走到这一步，我们就知道我们会得到好的名单，让设备=等待导航器。媒体设备。枚举设备()；}catch(E){控制台。日志(`获取输入设备时出错：${e.。消息}`)；}。\n没错：我们获取一个流(并且希望默认的媒体设备可用，并且不会挂起)，然后如果我们获得了一个流(这意味着我们已经获得了许可，可以获得真正的设备列表)，我们立即转储该流，然后获得设备的列表。当然，这要复杂得多--如果我们无法获取我们试图分别获取摄像头和麦克风的流，然后使用这些结果(在转储流之后)来计算出用户授予了我们什么权限--但是就像Saga/WebRTC集成一样，这个主题可能也值得写一篇自己的文章。\n但我还会讲得更久一些：您需要非常熟悉每个浏览器+操作系统组合关于设备访问和偶尔的“坏习惯”的不成文规则。诸如此类的事情：\n在iOS上：一次只能有一个应用程序可以访问摄像头，所以如果用户刚刚结束了缩放呼叫，但忘记关闭它，即使用户之前已经授予了您的应用程序权限，尝试拉取媒体流时也会出现错误。\n在iOS上：Safari App、Safari独立PWAS和SafariViewController都可以使用WebRTC。UIWebViews和WKWebViews不能，Navigator.mediaDevices实际上是未定义的。这意味着Chrome for iOS不支持WebRTC，但如果你从Slake或现代电子邮件应用程序打开一个链接，WebView实际上可以使用WebRTC。这是出于安全原因，与过去的“Safari App or Bust”相比，这是一种改进，但我真的希望苹果和谷歌能想出一种方法，在iOS版的Chrome上实现这一点。\n一般来说：你经常会遇到一些无用的错误，比如“找不到设备”或“视频源启动失败”。这些可能意味着几乎任何事情，但我经常发现，切换到“无输入”几秒钟，然后再次切换到设备可以修复它，如果设备通过USB连接，拔下插头并重新插入设备也可以。这是一个很难远程诊断的问题，而且是一个真正令人讨厌的问题。\n关于一般的网络摄像头：请记住，网络摄像头通常以特定的分辨率和帧率开始录制，如果另一个应用程序或页面请求使用不同分辨率或帧率的相同摄像头，就会像是“我已经在录制了，你会得到你想要的”。网络摄像头通常不能接受传感器输入，并将其转换为不同应用程序的不同形式。我建议从不同的厂商买2个便宜的摄像头，这样测试更容易，覆盖面更好。\n最后，我还要注意一些使用媒体设备的开发人员需要注意的事项：\n如果你要实现这种设备切换(对于消费者视频应用来说，这是非常强制性的用户体验)，这意味着你不能依赖像Janus.js这样的库来为你处理这些事情。您需要自己获取MediaStream并将其交给您的WebRTC库，而不是仅仅告诉库“使用视频而不是音频”。\n当您切换设备时，不像将您的MediaStream中的MediaTrack与新的MediaStream中的MediaTrack交换那么简单，因为这样做会导致旧的MediaTrack触发终止事件，从而终止您的RTCPeerConnect。\n..", "note_en": "[ Ed. Note: This post contains a promotion! It basically *is* a promotion for my current online interactive show: Shattered Space.]\n [But I’ve also got a lot of cool technical stuff to tell you about, so stick around and if this sounds interesting feel free to  buy a ticket here!]\n    Safe to say that the past couple months have gone a lot different than many of us were expecting. In early March, as quarantine was starting and all of my projection design gigs were being cancelled, I hit up a couple close friends about building a non-linear theatre experience entirely online. A lot of folks have been trying to perform plays on Zoom (and have found a lot of interesting and clever ways of working with that medium), but I felt like we could make something really unique if we built our own custom video conferencing app.\n  Crazy? It definitely would’ve been 10 years ago. But advances in the web platform (as well as the quality of cameras and hardware in mobile devices) took this down into the realm of “possible-if-slightly-quixotic”.\n Three months later, we’ve done it: Shattered Space is a piece of interactive theatre about a binary star system whose twin stars (“The Mothers”) have disappeared. You and your fellow audience members are Star Jockeys, and have been conscripted to fly around in spaceships to get to know the denizens of the Matra System and see what you can do to help.\n  Here’s a trailer if you want a better idea of what’s going on\n If you watched that trailer, you’ve probably figured out that this show involved 3D graphics (WebGL), videoconferencing (WebRTC) and perhaps also some music and audio processing (Web Audio). These were all technologies that I’d worked with on some level in the past, but this show required me to think about them completely differently. All because of the following central problem:\n   This WebRTC-based monitoring system allowed the backstage band to see the stage in real time and take cues from actors. The onstage portal was rendered with WebGL. ( Welcome to Shakesville, Baltimore Rock Opera Society 2019)\n I’ve used WebGL and WebRTC to build projection/video effects for a number of shows the past couple years, but in every case I was writing code that would only run on  my computer. If I ran into a device-specific bug that affected my computer (or my iPhone, or my squad of Raspberry Pis) I had all the time and access I needed to either debug it or come up with a workaround. Not this time.\n If someone pays us $15, receives the login link via email, tries to open it on a cheap 2014 laptop and it can’t load without crashing, that’s a refund. We weren’t just messing around with advanced web features, we needed to deploy them in the most battle-hardened and resilient way possible, while also capturing just enough data and logs to pinpoint who was having problems and ideally solve them before the show started.\n This meant going beyond the kinds of code you see in introductory tutorials and really digging into how these APIs deal with memory management, how they respond to connection issues, how they can fail, and how to tweak things at runtime to ensure that framerates stay high and dropped packets are few. I learned a lot about productizing these features, and I’d like to share as much of that as I can, but first let’s talk basics.\n   Attendees of Shattered Space are broken up into 6 groups of 5. Each group is assigned to a “ship” that flies around the system, and they interact with the characters in the show as a group. Attendees have the options to mute their microphone and turn off their camera if they wish (there is a text chat on the side they can use to communicate) although we encourage people to keep them on if they feel comfortable.\n  7 Janus WebRTC media servers. One for each ship and a extra for broadcasting a livestream of the ending scene.\n  The Admin App, a React/Redux webapp that handles scheduling shows, keeping track of which actor is talking to which ship, and has real-time dashboards with logs of client-side errors and connectivity issues.\n  The Actor App, a React/Redux webapp used by actors to interact with the audience via audio, video, text, and the giving/taking of items from a ship’s inventory.\n  The Attendee App, a React/Redux webapp where attendees view the show and interact with the actors and each other via audio, video and text.\n When I say that the Show Service “keeps track of the overall state of the show”, I mean  all of the state. Most of the Redux actions (across all 3 apps) don’t mutate the state of the reducers, but instead hit an endpoint on the Show Service that changes the state kept in the database, then fetches  all of the state from the database and sends it to  all of the users as a WebSocket message which then overwrites most of the reducers’ state. This way, no client can end up with “orphan state” as a result of optimistically updating their reducer before their API call returns, and fetching the updated state for  all users can be done with a single database call (this refresh-all-state-for-everyone method is debounced and implements a queueing mechanism to ensure we don’t have too many database calls at once).\n I basically took Dan Abramov’s simple and elegant system and did this to it.   Sorry Dan.\n (I’d note that this architecture emerged sort of organicly and there are probably cleaner or more optimal ways of achieving this “Redux-but-the-server-is-the-reducer” architecture. I’m open to feedback on whether something like Relay or Meteor would be a better fit for a V2)\n  The Admin app allows us to see who’s logged on and what’s happening in the show\n Of the 3 React/Redux apps, the Admin App uses the least of these shiny web technologies, and is pretty much just a dashboard for displaying what’s in the database. As admins, we can see which actors and attendees have logged on, which ships are currently visiting which actors, we can move attendees between ships if need be, and we can see a list of errors the actors and attendees have encountered (more on this later).\n The actor app allows performers to engage with the audience and view information about the ship they’re talking to\n The Actor App is more sophisticated, since it needs to handle WebRTC and media device concerns. It also has 3 modes: Normal, Mobile (used automatically if the window has a dimension less than 500px) and Headless (used if the querystring variable  headless is set to  true. The Normal mode is used by about half of the actors, and has the ability for them to see themselves, configure their audio/video devices, change any info about their user, character or planet, and view information about the ships they’re talking to (their chat, inventory, history of previous places, etc.).\n The mobile and headless modes of the actor app give our actors flexibility to use whatever devices they have available\n The Mobile mode uses a tab-based layout to try and accomplish all the same goals, but since only one tab can be on the screen at a time, it’s a bit of a pain to use on its own. We’ve got Headless mode, which doesn’t do any of the audio/video streaming, but shows all the information about the current ship and can run on any laptop. Many actors have opted for using the Mobile mode (since their phone has a good camera) but keeping Headless mode open on an old laptop to make it easier to use the other features.\n  The Attendee app is about as complex as the actor app, but doesn’t have a Headless mode (which is really just a power-user feature for actors). This app has multiple screens corresponding to the different phases of the show:\n Preshow - A lobby screen where attendees can meet the shipmates they’ll be flying with\n    Freeplay - The bulk of the show, where attendees alternate between interacting with characters and choosing their next destination from the Navigation Screen\n    Ended - This just redirects attendees out of the app to  a static page with our casts’ bios.\n  At the end of the show, I perform a scene as Colonel Panic, the AI commander of the Star Jockeys. In this scene I go around to each ship and review the items they’ve managed to collect. Then a “resolution” happens that I won’t spoil here.\n This performance is rendered on my desktop PC (Intel 8700K + RTX 2080TI) with a special version of the Actor app that I’ve built just for this purpose. The three.js scene here involves at least 7 huge models with MeshPhysicalMaterials and a dozen moving PointLights, so rather than rendering on attendees’ computers, I render it on mine and stream it to them using an  Elgato Camlink 4K, ffmpeg and the Janus (explained below)  Streaming plugin.\n The motion capture work is done by taking a modified version of Apple’s  TrackingAndVisualizingFaces example from the ARKit docs and having it send each frame of mocap data over WebSockets to the server, which then forwards them to the Host app. It’s amazing that this works with sub-100ms latency, but it does.\n I’m planning on open-sourcing all of this when the show is done, but I’d want to purge the git history in case there are any secrets lying around, and I’d warn any interested spelunkers that it will be more of an “interesting artifact to look at” than “a thing you could easily get running locally”.\n  As of this writing, the only plugin-free way to do real-time video conferencing in the browser is through WebRTC, a web standard for RealTime Communication that can handle streaming audio, video and even packets of arbitrary data. In tutorials, WebRTC is often demoed as a Peer-to-Peer communication tool, and it certainly  can do that. But if you have 5 attendees in a room, then each one has to broadcast 4 audio/video streams (one for each other attendee) and receive 4 more streams. This can be tough on people who are having connectivity issues or are using mobile networks.\n  Generally if you want to build a web-based video conferencing product, you’ll want servers in the cloud that can multiplex these streams for you. That way, each attendee only has to send a single copy of their stream (they still have to receive the other 4, this can’t be helped). The industry terms for these two approaches are “Mesh” vs. “Selective Forwarding Unit” (often abbreviated SFU).\n There are a number of open source servers that can do this, and the one we used for Shattered Space is  Janus by the team at  meetEcho. I was familiar with it from other projects, its maintainers have put in years of consistent work ( seriously  look at this contributor graph), and since it’s written in C it’s blazing fast and almost never hits double-digit CPU usage on a  t3a.nano on EC2.\n Janus not only multiplexes streams for you, it also has APIs that assist with a lot of the troublesome signalling and NAT-punching required to start a WebRTC session. All this is wrapped up in a client-side JS library with lots of  good  useful  examples that can serve as starting points for projects (if you’re not getting it yet I really like this thing).\n The two thorny issues I ran into revolved around the topics of the next two sections:\n  But other than those, Janus was great. I’ve never needed to randomly restart the servers because of memory leaks, the plugin system gives you tons of options for features, you can whip up a Docker image and deploy it in minutes. Seriously, check this thing out.\n  Creating and maintaining a WebRTC PeerConnection is one of the most side-effecty things you can do on the front end. You’ve got:\n multiple kinds of errors, each with different error handlers (whose errors need to be handled in different ways based on their cause).\n  multiple kinds of other events which create more stateful side-effecty stuff (like when a user joins the room, leaves the room, or toggles their mute switch)\n  a lot of loose ends that need to be “cleaned up” or disposed of, like connection objects or streams from a local media device (we’ll get to those in a moment)\n I lack any notion of respect for my time, so naturally, I chose to build this app in Redux.\n Joking aside, I really like Redux and the way that it lets me structure applications. I’ve used it for years (usually via  generator-react-webpack-redux) and have found it pretty adaptable to a number of projects. Nonetheless, one of its biggest weaknesses is around handling side effects. Usually I use the   redux-thunk package to handle asynchronous or side-effecty processes, but for this one I decided to take a crack at   redux-saga. This was a good choice.\n Redux Saga takes a bit of time to get your head around (unlike the rest of the JS world, it hopped off the async/await train and onto the generators one). But once you do you’ll find that it is capable of creating abstractions that Promises and async/await could only dream of, like  event channels,  cancellable async tasks and even  “forked” processes within the single threaded event loop. It’s great for times like this where you need to spin something up in response to an action, inhale any actions it puts out, and clean up when you’re done with it. I intend to write a more detailed article about using Redux Saga in WebRTC apps, because they’re a pairing that was made for each other.\n   Despite being the topic of  numerous  introductory  WebRTC  tutorials, the hardest part of this app was just getting the user’s camera and microphone in the first place. Sure, 80% of the time it’s as simple as going  await navigator.mediaDevices.getUserMedia({ audio:true, video: true }), and then if the user deems your application worthy you receive a   MediaStream that you can view in a  &lt;video&gt; element, send over an   RTCPeerConnection, etc. And while that’s basically true, if you’re building a real production app there are a number of other concerns you need to account for.\n First of all, if the user denies your request for camera, microphone or both, you need a way to gracefully fallback without reducing too much functionality. In our case, we politely ask users to allow us to use their microphone and camera and let them know that they can turn them on or off at any time in the show. But if they don’t trust us and want to do the whole show via text chat (while viewing and hearing their shipmates and the actors) we make sure to let them do that too. This makes things complicated (in part because we try to detect if the user has allowed camera-but-not-microphone and vice-versa) but we’re only scratching the surface.\n If your user’s device setup is a mess like mine, you’ll need to give them the tools to dig themselves out.\n The default video and audio sources available to  getUserMedia may not be the ones the user intends to use. For instance, a user might have:\n a good USB microphone, and a Bluetooth headset with a bad microphone (but which was set up more recently and is the browser’s default mic).\n  a good USB webcam mounted on their monitor, and a built-in webcam on their laptop which is running in “clamshell mode” (but which the browser chooses as the default)\n  a good USB webcam that “hangs” when you try to access it… because it is being used by a webcam filter app like SplitCam which presents its own pseudo-video device you should be using instead\n  a capture card or similar device which presents as a webcam but actually just shows what’s on the user’s monitor.\n So naturally you’ll want to make a selector that allows users to choose which device to use (or to use no device at all). For that you’ll need   navigator.mediaDevices.enumerateDevices(), which returns a complete list of the user’s available devices, their user-readable labels, and the deviceIds you can use to request their feeds, all without prompting the user for permisson.\n  Well, if the user hasn’t granted permission (or hasn’t been asked) you’ll get back a list containing only the default audio and video devices, their groupIds (but not deviceIds) and no labels. This is to prevent fingerprinting, and is all well and good because you can figure out if you’ve prompted the user for mic/camera access by calling   navigator.mediaDevices...uhoh there&#39;s no way to do this.\n So, as our app is booting up, our logic for getting a list of available devices looks like this:\n try  {   // After this we&#39;ll know for SURE whether we&#39;ve asked permission   let  stream  =  await  navigator . mediaDevices . getUserMedia ({   video :  true ,   audio :  true   });   // But these might not be the devices we actually want,   // so dump this stream and wait for the user to select a device   stream . getTracks (). map ( track  =&gt;  {   stream . removeTrack ( track );   track . stop ();   });    // If we&#39;ve made it this far, we know we&#39;ll get &#34;the good list&#34;   let  devices  =  await  navigator . mediaDevices . enumerateDevices ();  }  catch ( e )  {   console . log ( ` Error  getting  input  devices :  $ { e . message } ` );  }\n That’s right: We acquire a stream (and hope the default media devices are available and don’t hang) and then if we get one (meaning we’ve got permission and can get the real device list) we immediately dump the stream and then get a list of the devices. Of course, it’s more complicated–if we fail at getting the stream we test trying to get the camera and microphone individually and then use those results (after dumping the streams) to figure out what permissions the user has given us–but like the Saga/WebRTC integration, this topic probably also deserves it’s own article.\n But I’m going to go on a bit longer: You will need to become  intimately familiar with each browser+OS combo’s unwritten rules around device access and occasional “bad habits”. Things like:\n On iOS: only one application can have camera access at a time, so if the user just got off a Zoom call but forgot to close it, you’ll get an error when trying to pull a media stream even if the user has previously given your app permission\n  On iOS: the Safari App, Safari standalone PWAs, and SafariViewControllers can all use WebRTC. UIWebViews and WKWebViews cannot, and  navigator.mediaDevices is actually undefined. This means Chrome for iOS does not support WebRTC, but if you open a link from Slack or a modern email app, that WebView actually  can use WebRTC. This is for security reasons, and is an improvement over the old days of “the Safari App or bust”, but I do wish Apple and Google could figure out a way for this to work in Chrome for iOS.\n  In general: You’ll often come across unhelpful errors like “unable to find device” or “video source failed to start”. These could mean almost anything, but I’ve often found that switching to “no input” for a few seconds and back to the device again can fix it, as can unplugging and replugging the device if it’s over USB. This is a hard one to diagnose remotely, and is a real stinker.\n  Regarding webcams in general: Bear in mind that a webcam generally starts recording in a particular resolution and framerate, and if another app or page requests that same camera with a different resolution or framerate, it’ll be like “I’m already recording, you’re gonna get what you’re gonna get”. Webcams generally can’t take their sensor input and transform it into different forms for different apps. I recommend getting 2 cheap webcams from different manufacturers to make testing easier and coverage better.\n And finally I will note a few more things that developers working with media devices need to be aware of:\n If you’re going to implement this sort of device switching (and it’s pretty mandatory UX for a consumer video app) it means you can’t rely on libraries like Janus.js to handle this stuff for you. You’ll need to acquire the  MediaStream yourself and hand it to your WebRTC library, rather than just telling the library “use video but not audio for this one”.\n  When you switch devices, it’s not as simple as swapping a MediaTrack in your MediaStream with a MediaTrack from your new MediaStream, as doing so will cause the old MediaTrack to fire an  ended event which will kill your RTCPeerConnect\n......", "posttime": "2020-06-26 22:43:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "webrtc,webgl,online", "title": "利用WebGL和WebRTC实现大区在线", "title_en": "Taking Theatre Online with WebGL and WebRTC", "transed": 1, "url": "https://chrisuehlinger.com/blog/2020/06/16/unshattering-the-audience-building-theatre-on-the-web-in-2020/", "via": "", "real_tags": ["webrtc", "webgl", "online"]}, {"category": "", "categoryclass": "", "imagename": "3aa95bc36e69434130ece5e1ed634e37.png", "infoid": 1008410, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "搜索系统的关键指标之一是索引延迟，即新信息在搜索索引中可用所需的时间。此度量很重要，因为它决定了新结果显示的速度。并不是所有的搜索系统都需要快速更新内容。例如，在仓库库存系统中，每天更新一次搜索索引可能是可以接受的。就像Twitter--人们不断地在寻找“发生了什么”的答案--实时搜索是必须的。\n直到2019年年中，Twitter搜索系统的索引延迟都在15秒左右。它足够快，可以为基于相关性的产品功能提供动力，比如根据相关性发布推文的排名主页时间线(Rating Home Timeline)。由于确定一条推文的相关性是基于其参与度等因素，因此即时索引的需要较少。然而，需要低得多的索引延迟的用例不能由我们的搜索基础设施提供支持。例如，我们不能使用相同的搜索系统来检索个人个人资料页面的Twets，在该页面中，人们通常希望看到他们的Tweet在发布时出现。\n创建推文时，某些字段(与每条推文关联的信息位)不可用。例如，完全解析的网址通常比缩短的网址(如http://t.co/foo.)提供更好的排名信号。然而，解析新的URL需要时间，而且我们的旧系统要求我们同时为Tweet的所有字段建立索引，因此我们需要等待所有这些延迟的字段变为可用。\nTwitter应用程序中的大多数功能会优先处理最新的相关Tweet。因此，我们按照创建Tweet的时间对索引进行排序。如果我们的系统接收到严格有序的事件，这将很容易做到。但是，因为我们的搜索系统与Tweet创建分离，所以搜索系统不一定按时间顺序接收Tweet。为了克服这一限制，我们在摄取管道中添加了一个缓冲区，该缓冲区将所有传入的Tweet存储几秒钟，并在将它们发送到索引系统之前严格按照创建时间的递增顺序对它们进行排序。\n克服这些限制需要对我们的摄取管道和索引系统进行重大改变，但我们相信这些结果是值得的。tweet现在可以在创建后一秒内进行搜索，这使得我们可以支持具有严格实时要求的产品功能，例如实时对话或个人资料页面。让我们仔细看看我们是如何做到这一点的。\n几乎所有搜索系统的核心都是一种称为倒排索引的数据结构。倒排索引旨在快速回答诸如哪些文档中包含单词cat？&#34；这样的问题。它通过保存从词条到帖子列表的映射来做到这一点。术语通常是一个单词，但有时也是一个连接词、短语或数字。公告列表是包含术语的文档标识符(或文档ID)的列表。发布列表通常包括额外的信息，如术语在文档中出现的位置，或者用于提高排名算法相关性的有效负载。1个。\nTwitter的搜索系统每秒处理数十万个查询，其中大多数涉及搜索数千个项目的帖子列表，这使得我们在帖子列表中迭代的速度成为有效服务查询的关键因素。例如，考虑有多少Tweet包含单词“the”。\n我们使用Lucene作为我们的核心索引技术。在标准Lucene中，索引被细分为称为段的块，文档ID是Java整数。为特定片段中索引的第一个文档分配ID 0，并按顺序分配新的文档ID。在搜索段时，搜索从段中最低的文档ID开始，然后继续到段中的最高ID。\n为了支持我们首先搜索最新Tweet的要求，我们与标准Lucene不同，从高到低分配文档ID：一个片段中的第一个文档被分配一个最大ID(取决于我们希望Lucene片段有多大)，每个新文档获得一个较小的文档ID。这允许我们遍历文档，这样我们就可以首先检索最新的Tweet，并在检查客户指定的命中数之后终止查询。这一决定对于减少评估搜索查询所需的时间至关重要，因此对于让我们扩展到极高的请求率也是至关重要的。\n当我们使用传入Tweet的排序流时，很容易分配文档ID：片段中的第一个Tweet将获得片段大小减1的ID，第二个Tweet将获得片段大小减2的ID，依此类推，直到我们获得文档ID 0。但是，如果在创建Tweet时未对传入流进行排序，则此文档ID分配方案不起作用。为了消除排序带来的延迟，我们需要想出一个新的方案。\n在新的文档ID分配方案中，根据创建时间为每个Tweet分配一个文档ID。我们需要将文档ID放入31位空间，因为Lucene使用正Java整数作为文档ID。每个文档ID在一个段内都是唯一的，我们的段通常在大约12小时内是可写的。我们决定分配27位来存储毫秒粒度的时间戳，这足以让一个数据段持续37小时多一点。我们使用最后四位作为具有相同时间戳的Tweet数量的计数器。这意味着如果我们收到超过2 4(16)条具有相同毫秒时间戳的Tweet，那么其中一些将被分配一个稍微有些不正确的文档ID。在实践中，这种情况极为罕见，我们认为这种缺点是可以接受的，因为当Tweet延迟超过15秒时，我们经常会在旧系统中遇到类似的情况，这也会导致分配无序的文档ID。\n在过去的八年里，Twitter的搜索系统使用仅限预端的展开链表作为支持张贴列表的数据结构。这使我们避免了为每个值存储指针的开销，并且极大地提高了遍历张贴列表的速度，因为它是缓存友好的。(展开的链表是每个链接有多个值的链表-维基百科上有很好的描述。)。\n在我们的旧实现中，链表一开始只有一个值，每次列表需要增长时，我们都会分配指数级更大的节点。\n搜索器线程将从链表中最近添加的项开始，并跟随指针直到到达列表的末尾。写入者只会将新项目添加到列表的开头，方法是在现有数组中添加新帖子，或者创建新块并将新帖子添加到新块。在添加项目并正确设置链接之后，编写器将自动更新其指向链表新头部的指针。搜索者将看到新指针或旧指针，但绝不会看到无效指针。\n该列表是预置的，因此我们不需要在内部重写指针，还因为将项目添加到一组帖子的中间需要复制、减慢写入者的速度并需要复杂的簿记(如跟踪哪些块是最新的、哪些块已过时但仍被搜索者使用，以及哪些块可以安全地用于新的帖子)。它还可以很好地与我们的旧文档ID分配方案配合使用，因为它保证了公告列表始终按文档ID排序。\n这些链表在不使用任何锁的情况下支持单个编写器和许多搜索器，这对我们的系统至关重要：我们的每个CPU核心都有一个搜索器，每个服务器有几十个核，每次需要添加新文档时锁定所有搜索器的成本将高得令人望而却步。前缀到链表也非常快(发布列表大小为O(1))，因为它只需要跟随单个指针、分配新元素和更新指针。\n你可以在Twitter上找到更多关于我们在Earlybird：实时搜索中使用的展开链表方法的详细信息。\n链表数据结构多年来一直很好地服务于我们的系统：它很容易理解，而且非常高效。不幸的是，该方案只有在传入的Twets被严格排序的情况下才有效，因为您不能将新文档插入到列表的中间。\n为了支持这一新需求，我们使用了一种新的数据结构：跳过列表。跳过列表支持O(Logn)查找和插入到排序的集合或映射中，并且相对容易适应以支持并发性。\n跳过列表有多个级别，每个级别都将元素存储在链接列表中。最低级别包含所有元素，下一个最高级别包含这些元素的一部分，依此类推，直到我们达到只包含几个元素的最高级别。如果元素存储在级别N，则它也存储在所有级别1、2、…。较高级别中的每个元素都包含到较低级别中的等效元素的链接。要查找给定的元素，您可以从最高级别开始，沿着该链表阅读，直到找到一个大于您要查找的元素的元素。此时，您将下降一级，并开始检查填充更密集的链表中的元素。\n当我们添加元素时，我们总是将其添加到最底层。如果我们将元素添加到N级，我们会随机决定以20%的概率将元素添加到N+1级，然后递归地继续，直到我们不再随机决定将元素添加到下一个更高的级别。这为我们在每个更高级别提供了五分之一的元素。我们发现1：5的比率是内存使用和速度之间的一个很好的折衷。\n我们可以在单个平面数组中实现跳跃列表，其中每个“指针”只是跳跃列表数组的索引，如下所示：\n注意，跳过列表的每个级别都以特殊的“级别结束”值结束，该值通知搜索过程在该级别的跳过列表中没有更高的值。\n我们的跳跃列表实现有几个值得注意的优化，以减少每个张贴列表中使用的内存量，提高搜索和索引速度，并支持并发读写。\n首先，我们的跳过列表总是将元素添加到分配池的末尾。我们使用它来实现文档原子性，如下所述。当添加新元素时，我们首先在池的末尾分配元素，然后更新跳过列表最低级别的指针以包括该项目。通常，这是跳过列表的“头”指针，但如果它的文档ID比跳过列表的头大，我们将进一步向下遍历跳过列表，并将帖子插入到正确的位置。我们有时还会重写跳过列表结构的较高级别中的指针。我们将该值添加到跳过列表的第二级的可能性为五分之一，将其添加到第三级的可能性为25%，依此类推。这就是我们如何确保每个级别具有其下级别密度的五分之一，以及我们如何实现对数访问时间。\n其次，当我们在跳过列表中搜索元素时，我们跟踪跳过列表级别的下降，并将其保存为搜索手指。然后，如果我们稍后需要查找文档ID大于或等于给定值的下一张贴子(假设我们要查找的值高于找到的原始值)，我们可以从手指给出的指针开始搜索。这将我们的查找时间从O(Logn)(其中n是发布列表中的元素数量)更改为O(Logd)，其中d是发布列表中介于第一个值和第二个值之间的元素数量。这一点很关键，因为搜索引擎中最常见和最昂贵的查询之一是合取，这在很大程度上依赖于此操作。\n第三，我们的搜索系统中的许多数据结构将它们的所有数据存储在一个原语数组中，以消除JVM存储指向对象的指针所带来的开销，并避免让许多活动对象在老一代中存活的成本，这可能会使垃圾收集周期花费更多的时间。这使得编写数据结构更具挑战性，因为数组中的每个值都是无类型的-它可能是指针、位置、有效负载，或者在竞争条件下完全乱码。使用另一种语言的类或结构等编程语言级别的功能将使理解和修改这些数据结构变得容易得多，因此我们热切期待OpenJDK的项目Valhara的结果。\n第四，我们只为跳过列表的每个级别分配一个指针。在典型的跳跃列表中，节点将具有一个值、指向列表中下一个最大元素的指针和指向跳跃列表较低级别的指针。这意味着分配到第二级的新值将需要用于两个值和四个指针的空间。我们通过总是连续分配跳过列表塔来避免这种情况。每个K级指针将只指向其他K级指针，因此要提取与K级指针P相关联的值，您可以读取P-K处的值。一旦到达一个值大于您要搜索的节点的节点，您就可以返回到上一个节点，只需从指针中减去1即可向下返回一个级别。这样，我们只需消耗值和两个指针的空间，就可以将值分配到第二级。它还减少了我们需要花费在跟踪指针上的时间，因为指向塔的指针很可能与该塔中较低的指针位于同一缓存行上。\n在特定节点而不是数组中的元素之间使用链表的一个缺点是，与展开的链表或B树相比，跳过列表对缓存的友好性要差得多-每个单个元素访问都需要追逐一个指针，这通常会导致缓存未命中。这增加了遍历单个帖子列表所需的时间，特别是非常密集的帖子列表。然而，树结构和对数访问时间实际上提高了访问稀疏文档(合取和短语查询)的查询的速度，并允许我们达到与展开的链表几乎相同的平均查询计算速度。\n在任何数据存储和检索系统中，确保操作自动进行是很重要的。在搜索系统中，这意味着文档中的所有术语要么都已编入索引，要么都没有编入索引。否则，如果一个使用Twitter的人搜索否定词，例如，过滤器：图像狗和热狗，而我们正在将图片注释添加到“狗”的帖子列表中，但没有将其添加到“热门”帖子列表中，那么这个人可能会看到一张烤香肠三明治的照片，而不是一只可爱的狗。\n当使用顺序文档ID并避免更新时，很容易跟踪哪些文档对搜索者可见。搜索器线程从标记最小可见文档ID的原子变量中读取，并跳过任何小于该文档ID的文档标识符。\n由于索引系统的更改，我们不再需要我们的摄取管道有一个缓冲区来对所有传入的Tweet进行排序。这对于减少我们的索引延迟来说是一大胜利，但是我们仍然有等待某些字段变得可用而导致的延迟。\n我们注意到，我们希望索引的大多数Tweet数据在创建Tweet后立即可用，而我们的客户端通常不需要延迟字段中的数据立即出现在索引中。因此，我们决定我们的摄取管道不应该等待这些延迟字段中的数据变为可用。相反，它可以在Tweet发布后立即将大部分Tweet数据发送到我们的索引系统，然后在其余数据可用时发送另一个更新。\n这种方法允许我们消除摄取管道中的最终人为延迟，代价是非常新的Tweet没有完整的数据。由于大多数搜索用例仅依赖于立即可用的字段，我们认为这是可以接受的代价。\n推出如此重大的变化并非易事。首先，我们的摄取管道变得更加复杂，因为我们从完全同步的管道切换到具有同步和异步部件的管道。其次，更改索引服务器中的核心数据结构会带来引入单元测试中几乎不可能检测到的模糊错误的风险。第三，很难预测返回更新的推文是否会违反客户代码中的任何假设。\n我们决定测试新的摄取管道的最好方法(除了编写许多新的测试之外)是将其与旧的摄取管道一起部署。这意味着在推广期间，我们有两份完整的索引数据副本。此策略允许我们逐步迁移到新的摄取管道，同时，如果出现问题，我们可以轻松地切换回旧的数据流。\n我们还设置了索引服务器的临时集群，该集群尽可能接近地镜像我们的生产环境，并开始将我们的一小部分生产请求发送到除了生产服务器之外的这些服务器(一种称为暗读的技术)。这允许我们使用真实的生产流量和负载，以及新旧的Tweet数据流，对核心索引数据结构的更改进行压力测试。一旦我们确信新的数据结构按预期工作，我们就重用这个临时集群来测试新摄取管道生成的数据的正确性。我们建立了这个集群来索引由新的摄取管道产生的数据，并比较对生产的响应。这样做会暴露出一些细微的错误，这些错误只会影响黑暗的流量。一旦我们修复了它们，我们就可以将更改部署到生产中了。\n因为我们不知道我们的客户在他们的代码中做了什么假设，所以我们采取了保守的方法。我们向索引服务器添加了代码，使其不为过去15秒内发布的任何Tweet提供服务(我们的初始索引延迟)，并逐步推出了索引端的所有更改。一旦我们确信索引更改按预期工作，我们就删除了旧的摄取管道。我们与客户进行了核对，看看最近的推文是否会导致任何问题，以及。\n..", "note_en": "One of the key metrics for a search system is the  indexing latency, the amount of time it takes for new information to become available in the search index. This metric is important because it determines how quickly new results show up. Not all search systems need to update their contents quickly. In a warehouse inventory system, for example, one daily update to its search index might be acceptable. At Twitter -- where people are constantly looking for the answer to “what’s happening” -- real-time search is a must.\n  Until mid-2019, the indexing latency for Twitter’s search system was around 15 seconds. It was fast enough to power relevance-based product features such as the ranked Home timeline, which delivers Tweets based on their relevance. Since determining a Tweet&#39;s relevance is based on factors such as how much engagement it gets, there is less need for instant indexing. Use cases requiring a much lower indexing latency, however, couldn’t be powered by our search infrastructure. For example, we couldn’t use this same search system to retrieve Tweets for a person’s profile page where people generally expect to see their Tweets appear the moment they are published.\n    Some  fields (bits of information associated with each Tweet) are not available when a Tweet is created. For example, a fully resolved URL usually provides a much better ranking signal than a shortened URL like http://t.co/foo. However, resolving new URLs takes time, and our old system required us to index all fields for a Tweet at the same time, so we needed to wait for all these delayed fields to become available.\n  Most features in the Twitter application prioritize the newest relevant Tweets. Therefore, we sort our index by the time a Tweet was created. This would be easy to do if our systems received events that were strictly ordered. However, because our search system is decoupled from Tweet creation, the search system doesn’t necessarily receive Tweets in chronological order. To overcome this limitation, we added a buffer in our ingestion pipeline that stored all incoming Tweets for a few seconds, and sorted them in strictly increasing order of created time before sending them to our indexing system.\n  Overcoming these limitations required major changes to our ingestion pipeline and our indexing system, but we believe the results were worth the effort. Tweets are now available for searching within one second of creation, which allows us to power product features with strict real-time requirements, such as real-time conversations or the profile pages. Let&#39;s take a closer look at how we&#39;ve achieved this.\n    The core of almost all search systems is a data structure called an  inverted index. An inverted index is designed to quickly answer questions like &#34;Which documents have the word  cat in them?&#34;. It does this by keeping a map from  terms to  posting lists. A term is typically a word, but is sometimes a conjunction, phrase, or number. A posting list is a list of  document identifiers (or  document IDs) containing the term. The posting list often includes extra information, like the position in the document where the term appears, or payloads to improve the relevance of our ranking algorithms. 1\n  The search systems at Twitter process hundreds of thousands of queries per second and most involve searching through posting lists of thousands of items, making the speed at which we can iterate through a posting list a critical factor in serving queries efficiently. For example, consider how many Tweets contain the word “the.”\n    We use Lucene as our core indexing technology. In standard Lucene, an index is subdivided into chunks called  segments, and document IDs are Java integers. The first document indexed in a particular segment is assigned an ID of 0, and new document IDs are assigned sequentially. When searching through a segment, the search starts at the lowest document IDs in the segment and proceeds to the highest IDs in the segment.\n  To support our requirement of searching for the newest Tweets first, we diverge from standard Lucene and assign document IDs from high to low: the first document in a segment is assigned a maximum ID (determined by how large we want our Lucene segment to be), and each new document gets a smaller document ID. This lets us traverse documents so that we retrieve the newest Tweets first, and terminate queries after we examine a client-specified number of  hits. This decision is critical in reducing the amount of time it takes to evaluate a search query and therefore in letting us scale to extremely high request rates.\n  When we were using sorted streams of incoming Tweets, it was easy to assign document IDs: the first Tweet in a segment would get the ID of size of the segment minus one, the second Tweet would get the size of the segment minus two, and so on, until we got to document ID 0. However, this document ID assignment scheme doesn’t work when the incoming stream isn’t sorted by the time a Tweet was created. In order to remove the delay added by sorting, we needed to come up with a new scheme.\n  In the new document ID assignment scheme, each Tweet is assigned a document ID based on the time that it was created. We needed to fit our document IDs into a 31-bit space, because Lucene uses positive Java integers as document IDs. Each document ID is unique within a segment, and our segments are usually writable for about 12 hours. We decided to allocate 27 bits to store timestamps with millisecond granularity, which is enough for a segment to last for a bit more than 37 hours. We use the last four bits as a counter for the number of Tweets with the same timestamp. This means that if we get more than 2 4 (16) Tweets with the same millisecond timestamp, then some of them will be assigned a document ID that is in a slightly incorrect order. In practice, this is extremely rare, and we decided that this downside was acceptable because we often ran into a similar situation in the old system when a Tweet was delayed for more than 15 seconds, which also resulted in the assignment of an unordered document ID.\n    For the past eight years, the search systems at Twitter used a prepend-only unrolled linked list as the data structure backing the posting lists. This has allowed us to avoid the overhead of storing a pointer for every value and vastly improved the speed of traversing a posting list because it was cache friendly. (An unrolled linked list is a linked list with multiple values per link — there is a good description on  Wikipedia.)\n  In our old implementation, the linked list started out with a single value, and we allocated  exponentially larger nodes each time the list needed to grow.\n    Searcher threads would start at the most recently added item of the linked list and follow pointers until reaching the end of the list. Writers would only add new items to the start of the list, either by adding a new posting in the existing array or creating a new block and adding the new posting to the new block. After adding the item and setting up the links correctly, the writer would atomically update its pointer to the new head of the linked list. Searchers would either see the new pointer or the old pointer, but never an invalid pointer.\n  The list was prepend-only so that we didn’t need to rewrite pointers internally and also because adding items to the middle of a block of postings would have required copying, slowing down the writer and requiring complex bookkeeping (like tracking which blocks were up to date, which were stale but still used by searchers, and which could be safely used for new postings). It also worked well with our old document ID assignment scheme, because it guaranteed that posting lists were always sorted by document ID.\n  These linked lists supported a single writer and many searchers without using any locks, which was crucial for our systems: We had a searcher for every CPU core, with tens of cores per server, and locking out all of the searchers every time we needed to add a new document would have been prohibitively expensive. Prepending to a linked list was also very fast ( O(1) in the size of the posting list) as it just required following a single pointer, allocating a new element, and updating the pointer.\n  You can find more details on the unrolled linked list approach we used in  Earlybird: Real-Time Search at Twitter.\n    The linked list data structure served our system well for many years: it was easy to understand and extremely efficient. Unfortunately, that scheme only works if the incoming Tweets are strictly ordered because you can’t insert new documents into the middle of the list.\n  To support this new requirement, we used a new data structure:  skip lists. Skip lists support  O(log n) lookups and insertions into a sorted set or map, and are relatively easy to adapt to support concurrency.\n  A skip list has multiple levels, and each level stores elements in a linked list. The lowest level contains all of the elements, the next highest level contains some fraction of those elements, and so on, until we reach the highest level which contains just a few elements. If an element is stored at level  N, then it is also stored at all levels 1, 2, …,  N - 1. Each of the elements in a higher level contains a link to the equivalent element in a lower level. To find a given element, you start out at the highest level, and read along that linked list until you find an element that is greater than the one you are looking for. At that point, you descend one level and start examining elements in the more densely populated linked list.\n    When we add an element, we always add it to the bottom level. If we add the element at level  N, we randomly decide to add the element at level  N + 1 with 20% probability and continue recursively until we don&#39;t make the random decision to add an element at the next higher level. This gives us 1/5th as many elements at each higher level. We have found a 1:5 ratio to be a good tradeoff between memory usage and speed.\n  We can implement the skip list in a single flat array where each “pointer” is just an index into the skip list array, like so:\n    Note that each level of the skip list is terminated with a special “end of level” value, which signals to the search process that there are no higher values at this level of the skip list.\n  Our skip list implementation has a few notable optimizations to reduce the amount of memory used in each posting list, improve search and indexing speed, and support concurrent reading and writing.\n  First, our skip list always adds elements to the end of an allocation pool. We use this to implement document atomicity, described below. When a new element is added, first we allocate the element at the end of the pool, then we update the pointer at the lowest level of the skip list to include that item. Typically, this is the “head” pointer of the skip list, but if it&#39;s a larger document ID than the head of the skip list, we will traverse further down the skip list and insert the posting into the correct place. We also sometimes rewrite pointers in the higher levels of the skip list structure. There is a one-in-five chance that we add the value to the second level of the skip list, a one-in-25 chance that we add it to the third level, and so on. This is how we ensure that each level has one-fifth of the density of the level below it, and how we achieve logarithmic access time.\n  Second, when we search for an element in a skip list, we track our descent down the levels of the skip list, and save that as a  search finger. Then, if we later need to find the next posting with a document ID greater than or equal to a given value (assuming the value we are seeking is higher than the original value we found), we can start our search at the pointers given by the finger. This changes our lookup time from  O(log n), where n is the number of elements in the posting list, to  O(log d), where d is the number of elements in the posting list between the first value and the second value. This is critical because one of the most common and expensive queries in a search engine are conjunctions, which rely heavily on this operation.\n  Third, many of the data structures in our search system store all of their data in an array of primitives to remove the overhead imposed by the JVM of storing a pointer to an object and to avoid the cost of having many live objects survive in the old generation, which could make garbage collection cycles take much more time. This makes coding data structures much more challenging, because every value in the array is untyped — it could be a pointer, a position, a payload, or completely garbled in the case of race conditions. Using programming language-level features like classes or structs in another language would make understanding and modifying these data structures far easier, so we are eagerly awaiting the results of  OpenJDK&#39;s Project Valhalla.\n  Fourth, we only allocate one pointer for every level of the skip list. In a typical skip list, a node will have a value, a pointer to the next largest element in the list and a pointer to the lower level of the skip list. This means that a new value allocated into the second level will require the space for two values and four pointers. We avoid this by always allocating skip list towers contiguously. Each level  K pointer will only point to other level  K pointers, so to extract the value associated with a level  K pointer  P, you read the value at  P -  K. Once you reach a node with a value greater than the one you are searching for, you go back to the previous node, and descend a level by simply subtracting one from the pointer. This lets us allocate a value into the second level by just consuming the space for the value and two pointers. It also reduces the amount of time we need to spend chasing pointers, because a pointer into a tower is likely to be on the same cache line as the lower pointers in that tower.\n  One of the downsides of having a linked list between elements in a particular node instead of an array is that the skip list is much less cache friendly than an unrolled linked list or B-tree — every single element access requires chasing a pointer, which often results in a cache miss. This increased the amount of time it took to traverse a single posting list, especially the very dense ones. However, the tree structure and logarithmic access time actually improved the speed for queries that accessed sparse documents (conjunctions and phrase queries) and allowed us to reach nearly the exact same average query evaluation speed as the unrolled linked list.\n    In any data storage and retrieval system, it’s important to ensure that operations happen atomically. In a search system, this means that either all of the terms in a document are indexed or none of them are. Otherwise, if a person who used Twitter searched for a negation, for example, &#34;filter:images dogs AND -hot&#34;, and we were in the middle of adding the image annotation &#34;I sure love hot dogs!&#34; to the ”dogs” posting list but hadn’t added it to the “hot” posting list, the person might see a photo of a grilled sausage sandwich instead of a lovable canine.\n  When using sequential document IDs and avoiding updates, it&#39;s easy to track which documents are visible to the searchers. A searcher thread reads from an atomic variable that marks the smallest visible document ID, and skips over any document identifiers that are smaller than that document ID. This let us decouple the logical level of consistency — the document — from the underlying data structures that support concurrency at a more granular level.\n  In our new system, newer documents are no longer guaranteed to have smaller document IDs. To support atomic updates to the skip list posting lists, we take advantage of the fact that the skip lists allocate new values at the end of a given allocation pool. When a searcher is created, it atomically gets a copy of a data structure that tracks the current maximum pointer into each allocation pool, which we call the  published pointer. Then, whenever the searcher traverses a posting list, if the address of a posting is greater than the published pointer, the searcher will skip over that posting, without returning the document as a potential match. This lets us update the underlying data structure while the searcher is running, but preserves our ability to atomically create and update documents, and achieves our goal of separating data structure level atomicity from the logical, application layer atomicity.\n    Because of the changes to our indexing system, we no longer needed our ingestion pipeline to have a buffer to sort all incoming Tweets. This was a big win for reducing our indexing latency, but we still had the delay caused by waiting for some fields to become available.\n    We noticed that most Tweet data that we wanted to index was available as soon as the Tweet was created, and our clients often didn’t need the data in the delayed fields to be present in the index right away. So we decided that our ingestion pipeline shouldn’t wait for the data in these delayed fields to become available. Instead, it can send most of the Tweet data to our indexing system as soon as the Tweet is posted, and then send another update when the rest of the data becomes available.\n    This approach allowed us to remove the final artificial delay in our ingestion pipeline, at the cost of very new Tweets not having complete data. Since most search use cases rely only on fields that are immediately available, we believe this was an acceptable price to pay.\n    Rolling out a change of this magnitude isn’t easy. First, our ingestion pipeline became more complex, because we switched from one that was fully synchronous to one with synchronous and asynchronous parts. Second, changing the core data structure in our indexing server came with the risk of introducing obscure bugs that were virtually impossible to detect in unit tests. And third, it was hard to predict if returning newer Tweets would break any assumption in a customer&#39;s code.\n  We decided that the best way to test our new ingestion pipeline (in addition to writing many new tests) was to deploy it alongside the old ingestion pipeline. This meant that during the rollout period we had two full copies of indexing data. This strategy allowed us to gradually migrate to the new ingestion pipeline, and at the same time, we could easily switch back to the old stream of data if there was a problem.\n  We also set up a staging cluster of indexing servers that mirrored our production environment as closely as possible and started sending a fraction of our production requests to these servers in addition to production servers (a technique known as  dark reads). This allowed us to stress test the changes to our core indexing data structures with real production traffic and load, with both the old and new streams of Tweet data. Once we were confident that the new data structures were working as expected, we reused this staging cluster to test the correctness of the data produced by the new ingestion pipeline. We set up this cluster to index the data produced by the new ingestion pipeline and compared the responses to production. Doing so revealed a few subtle bugs, which only affected dark traffic. Once we fixed them, we were ready to deploy the change to production.\n  Since we didn’t know what assumptions our clients made in their code, we took a conservative approach. We added code to our indexing servers to not serve any Tweet posted in the last 15 seconds (our initial indexing latency) and gradually rolled out all changes on the indexing side. Once we were confident that the indexing changes worked as expected, we removed the old ingestion pipeline. We checked with customers to see if recent Tweets would cause any issues, and\n......", "posttime": "2020-06-26 22:41:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "索引,search", "title": "将搜索索引延迟缩短至一秒", "title_en": "Reducing search indexing latency to one second", "transed": 1, "url": "https://blog.twitter.com/engineering/en_us/topics/infrastructure/2020/reducing-search-indexing-latency-to-one-second.html", "via": "", "real_tags": ["索引", "search"]}, {"category": "", "categoryclass": "", "imagename": "e560a71dc83ac34808b55fedd40ced79.jpg", "infoid": 1008409, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软正在放弃实体零售。今天，该公司宣布计划永久关闭美国和世界各地的所有Microsoft Store门店，除了四个将被“重新设想”为不再销售产品的体验中心的门店。\n这些地点是纽约市(第五大道)、伦敦(牛津马戏团)、悉尼(悉尼韦斯特菲尔德)和雷蒙德校区。这家伦敦商店大约一年前才刚刚开张。美国和全球所有其他微软商店门店都将关闭，该公司将专注于数字零售的发展。微软表示，Microsoft.com、Xbox和Windows店面达到了“190个市场的12亿月度客户”。\n该公司告诉The Verge，今天的决定不会导致裁员。微软商店副总裁大卫·波特在LinkedIn上发布的一篇移动帖子中表示：“我们致力于从这个多元化的人才库中成长和发展职业生涯，这一承诺比以往任何时候都更加坚定。”\n一位了解微软零售业务的消息人士告诉The Verge，这一计划原本计划在明年实施，但新冠肺炎疫情加速了这一计划的实施。\n这一决定在一定程度上解释了为什么微软在考虑到大流行而关闭了所有门店后，至今仍未重新开放一家门店。上周，微软告诉The Verge，它“通过监控全球数据、听取公共健康和安全专家的意见，以及跟踪当地政府的限制，对重新开放微软商店门店的方法进行了慎重和谨慎的指导。”当时，该公司拒绝提供任何门店可能重新开业的最新情况。\n由于许多微软商店都在购物中心和购物中心，因此持续关闭并不是什么不寻常的事情。在美国各州，为了避免新型冠状病毒卷土重来，正在采取谨慎的方式恢复零售业务，大多数商场仍然关闭。在指导方针较为宽松的地区，新冠肺炎案件已经激增，这导致苹果重新关闭了一些最近才欢迎顾客回来的门店。\n今年4月，微软在一篇博客文章中概述了有多少零售店员工在日常工作被搁置后转向远程工作。在大流行期间，该公司继续为团队成员提供定期薪酬。该公司在今天的更新中表示：“我们的零售团队成员将继续为在微软公司设施或远程工作的客户提供服务，我们将继续发展我们多样化的团队，以支持整个公司的使命和目标。”\n微软商店于2009年首次亮相，紧跟苹果成功的零售策略。每家商店都是该公司Surface和Xbox硬件的展示窗口，外加精选的第三方个人电脑。员工们精通Windows的所有东西，该公司还提供店内活动、研讨会、客户服务和维修。\n美国东部时间6月26日上午9：50更新：文章已更新，以澄清所有Microsoft零售店将关闭。该公司在纽约、伦敦、悉尼和雷德蒙德的地点将被改造成不销售产品的体验中心。", "note_en": "Microsoft is giving up on physical retail. Today  the company announced plans to permanently close all Microsoft Store locations in the United States and around the world, except for four locations that will be “reimagined” as experience centers that no longer sell products.\n Those locations are New York City (Fifth Ave), London (Oxford Circus), Sydney (Westfield Sydney), and the Redmond campus location.  The London store only just opened about a year ago. All other Microsoft Store locations across the United States and globally will be closing, and the company will concentrate on digital retail moving forward. Microsoft says Microsoft.com and the Xbox and Windows storefronts reach “up to 1.2 billion monthly customers in 190 markets.”\n The company tells  The Verge that no layoffs will result from today’s decision. “Our commitment to growing and developing careers from this diverse talent pool is stronger than ever,” Microsoft Store VP David Porter  said in a LinkedIn post on the move.\n A source with knowledge of Microsoft’s retail operations told  The Verge that this plan was originally in place for next year, but was accelerated by the COVID-19 pandemic.\n The decision partially explains why Microsoft had yet to reopen a single store after they were all closed in light of the pandemic. Last week, Microsoft told  The Verge that its “approach for re-opening Microsoft Store locations is measured and cautious, guided by monitoring global data, listening to public health and safety experts, and tracking local government restrictions.” At the time, the company declined to offer an update on when any stores might open again.\n   Since many Microsoft stores are in shopping centers and malls, the continued closure hasn’t stood out as unusual. In US states that are taking a cautious approach to restoring retail operations — to avoid a resurgence of the novel coronavirus — most malls remain closed. There have already been spikes of COVID-19 cases in regions with more relaxed guidelines, which has led Apple to re-close some stores where it had only recently welcomed customers back in.\n In April,  Microsoft outlined in a blog post how many retail store associates had shifted to remote work after their everyday jobs were sidelined. The company has continued to provide regular pay for team members through the pandemic. “Our retail team members will continue to serve customers working from Microsoft corporate facilities or remotely and we will continue to develop our diverse team in support of the overall company mission and objectives,” the company said in today’s update.\n The Microsoft Store debuted in 2009 and closely adhered to Apple’s successful retail playbook. Each store is a showcase for the company’s Surface and Xbox hardware, plus a selection of third-party PCs. Employees were well-versed in all things Windows, and the company also offered in-store events, workshops, customer service, and repairs.\n Update June 26th 9:50AM ET:  The article has been updated to clarify that all Microsoft retail stores will be closing. The company’s locations in New York, London, Sydney, and Redmond will be converted into experience centers that do not sell products.", "posttime": "2020-06-26 22:40:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,微软,关闭,permanently", "title": "微软将永久关闭几乎所有零售店", "title_en": "Microsoft to permanently close nearly all of its retail stores", "transed": 1, "url": "https://www.theverge.com/2020/6/26/21297400/microsoft-retail-stores-closing-cities-open", "via": "", "real_tags": ["microsoft", "微软", "关闭"]}, {"category": "", "categoryclass": "", "imagename": "0dfa7786ce6c69aabaa4b668402fbd30.png", "infoid": 1008408, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Prisma，我们的目标是彻底改变应用程序开发人员使用数据库的方式。考虑到大量不同的数据库和使用它们的各种工具，这是一个非常雄心勃勃的目标！\n我们很高兴能够通过由Amplify Partners牵头的1200万美元的首轮A轮融资，进入追求这一目标的下一个篇章。我们对这一伙伴关系感到特别兴奋，因为Amplify是开发者工具生态系统的经验丰富的投资者，并领导了许多公司的投资，如Datadog、Fastly和Gremlin。\n尽管关系数据库是在20世纪70年代开发的，但它仍然是今天最常用的数据库。尽管同时开发了其他数据库类型，从文档数据库到图形数据库，再到键值数据库，但使用数据库仍然是应用程序开发中的最大挑战之一。\n虽然开发堆栈的几乎所有其他部分都已经现代化，但数据库工具在过去几十年里一直停留在相同的范例上。\n在使用关系数据库时，开发人员可以选择直接使用SQL或使用称为ORMS的高级抽象。这些选择都不是特别有说服力。\n使用SQL的级别非常低，从而降低了开发人员的工作效率。相比之下，ORM级别太高，开发人员在使用这种方法时会牺牲对执行的数据库操作的控制。ORM还遭受了一种从根本上被误导的抽象，称为对象关系阻抗不匹配。\n类似于React.js如何使前端开发现代化，或者Serverless如何发明了一种新的计算基础设施模型，Prisma在这里带来了一种新的、现代的处理数据库的方法！\nPrisma使用生成的查询构建器解决数据库访问问题的独特方法是完全类型安全的，并且可以根据任何数据库模式模式进行定制，这使它有别于以前解决相同问题的尝试。\n现代化的很大一部分来自于我们对开发人员体验的主要关注。数据库工具经常与摩擦、不确定性、痛苦的调试时间和代价高昂的性能瓶颈联系在一起。\n开发人员体验是我们Prisma DNA的一部分。使用数据库往往与摩擦和不确定性联系在一起，而它本应是有趣、愉快和高效的！\n我们希望让使用数据库变得有趣、愉快和高效，同时引导开发人员在日常使用数据库时采用适当的模式和最佳实践！\n作为一家公司，在过去的几年里，我们已经经历了许多主要产品的迭代和调整。\n我们最初的产品GraphCool和Prisma1专注于将GraphQL作为一种技术。然而，当我们在生产中运行这两个工具时，我们意识到它们并没有解决开发人员的核心问题。\n我们意识到，我们使用这两个工具提供的很多价值并不一定在于快速提供GraphQL服务器，而在于开发人员不需要显式地管理他们的数据库工作流。\n这种认识导致了一个转折点，最终体现在对Prisma 2的重写中。使用这个新版本的Prisma，我们找到了正确的抽象级别，确保开发人员对其开发堆栈保持完全的控制和灵活性，同时不需要担心数据库工作流！\nPrisma为这种现代化所采取的方法受到了Twitter、Facebook或Airbnb等大型科技公司的启发。\n为了确保应用程序开发人员的工作效率，这些组织中的常见做法是引入统一的数据访问层，该层抽象数据库基础结构，并为开发人员提供更熟悉、更方便的数据访问方式。\nFacebook开发了一个名为TAO的系统，以满足应用程序开发人员的数据需求。Twitter已经建立了一个名为Strato的虚拟数据库，它将多个数据源集合在一起，这样就可以对它们进行统一的查询和变异。Airbnb结合了GraphQL和Thrift，抽象出查询数据的实现细节。\n构建这些自定义数据访问层需要大量时间和资源(因为这些通常是由专门的基础架构团队实现的)，因此对于大多数公司和开发团队来说不是一种现实的方法。\nPrisma基于与这些系统相同的核心思想和原则，使统一数据访问层的模式大众化，并使其成为各种规模的开发团队都可以访问的开源技术。\n在运行了预览版和测试版一年多之后，我们最近推出了Prisma2.0投入生产。为了过渡将Prisma的核心从Scala重写到Rust，我们已经为将来扩展Prisma工具包以涵盖各种数据库工作流奠定了坚实的基础。\nPrisma的主要功能是Prisma客户端，这是一个自动生成的类型安全的查询构建器，可用于访问Node.js和TypeScript中的数据库。多亏了自省，Prisma客户端可以用来操作任何现有的数据库！\n注意：Prisma目前支持PostgreSQL、MySQL和SQLite数据库--还有更多计划中的数据库。如果您想查看对特定数据库的支持，请创建新的GitHub版本或订阅现有版本(例如MongoDB或DynamoDB)。\njs生态系统以许多不同的框架而闻名，这些框架试图简化工作流并规定某些约定。许多框架作者决定使用Prisma作为他们选择的数据层，我们对此感到非常谦卑。\n由GitHub联合创始人Tom Preston-Werner创建的新Redwood JS框架试图成为Node.js的Ruby on rails版。Redwood JS基于React和GraphQL，并附带了用于无服务器功能的内置部署模型。\n另一个在社区中越来越受期待和兴奋的框架是Blitz.js。闪电战构建在Next.js之上，与Redwood相比，它采取了一种与Redwood完全不同的方法。它的目标是完全消除API服务器，恢复服务器渲染框架的简单性。\n在Prisma，我们是GraphQL的超级粉丝，并相信它的光明未来。这就是为什么我们成立了Prisma实验室团队，他们致力于在GraphQL生态系统中开发开源工具。\n它目前专注于构建Nexus，这是一个用于开发GraphQL服务器的令人愉快的应用程序框架。与Redwood JS相反，Nexus是一个仅限后端的GraphQL框架，对于如何从前端访问GraphQL API没有任何意见。\n数据库迁移是许多开发人员的共同痛点！特别是对于在生产中运行的应用程序，通常不清楚执行架构更改的最佳方法是什么(例如，在CI/CD环境中)。许多开发人员求助于手动迁移或自定义脚本，使得该过程脆弱且容易出错。\nPrisma Migrate是我们对这个问题的解决方案。PRISMA Migrate允许开发人员将声明性PRISMA模式映射到他们的数据库。在幕后，Prisma Migrate生成执行迁移所需的SQL语句。\n注意：Prisma Migrate当前处于实验状态，不应在生产环境中使用。\nPrisma Studio是各种数据库工作流的可视化伙伴。它提供了一个现代的GUI，允许您查看和编辑数据库中的数据。您可以在表视图和树视图之间切换，后者对于深入挖掘嵌套数据特别方便(使用下面的选项卡浏览这两个视图或尝试在线演示)。\n注意：Prisma Studio当前处于实验状态，不应在生产环境中使用。。\nPrisma客户端是一个特定于语言的薄层，它将查询计划和执行的重任委托给Prisma的查询引擎。查询引擎是用Rust编写的，并作为独立进程与主应用程序一起运行。\n此架构使我们能够将Prisma客户端扩展到其他语言，并为Node.js社区以外的开发人员带来好处。我们已经在Prisma客户端的第一个阿尔法版本的围棋准备试用！\nPrisma的设计方式是，只要有合适的连接器，它就可以潜在地连接到任何现有的数据源！\n到今天为止，我们已经为PostgreSQL、MySQL和SQLite构建了连接器。MongoDB的连接器已经在开发中，未来还计划开发更多的连接器。\n我们致力于构建世界级的开源工具来解决应用程序开发人员常见的数据库问题。为了能够持续我们的开源工作，我们重新计划构建商业服务，使开发团队和组织能够在使用PRISMA的项目中更好地协作。\n注意：商业服务的计划不会影响我们正在构建的开源工具，这些工具将永远免费。\n我们非常感谢在我们旅途中陪伴我们的每一个人！在Slake、GitHub、Twitter和许多其他渠道上看到我们活跃的社区，人们在那里谈论Prisma并相互帮助，这是一件非常棒的事情！\n如果您对Prisma很好奇并想了解更多，请务必查看我们将在接下来的两天举行的在线Prisma日会议！\n一定要收听汤姆·普雷斯顿-沃纳(GitHub联合创始人兼Redwood JS作者)、马特·比尔曼(Netlify首席执行官)和许多Prisma团队成员的精彩演讲和许多有趣的演讲！\n要尝试Prisma，您可以按照快速入门或使用您自己的数据库设置Prisma。\n快速入门(5分钟)了解如何使用Prisma客户端针对演示SQLite数据库发送数据库查询-无需设置！", "note_en": "At Prisma, our goal is to  revolutionize how application developers work with databases. Considering the  vast number of different databases and  variety of tools for working with them, this is an extremely ambitious goal!\n We are thrilled to enter the next chapter of pursuing this goal with a  $12M Series A funding round led by  Amplify Partners. We are especially excited about this partnership as Amplify is an experienced investor in the developer tooling ecosystem and has led investments for numerous companies, such as  Datadog,  Fastly, and  Gremlin.\n    Despite having been developed in the 1970s, relational  databases are still the most commonly used databases today. While  other database types have been developed in the meantime, from  document, to  graph , to  key-value databases, working with databases remains one of the biggest challenges in application development.\n While almost any other part of the development stack has been modernized, database tools have been stuck with the same paradigms for the last decades.\n  When working with relational databases, developers have the choice of working directly with SQL or using a higher-level abstraction called ORMs.  None of these options is particularly compelling.\n Using SQL is very low-level resulting in reduced developer  productivity. In contrast, ORMs are too high-level and developers sacrifice  control over the executed database operations when using this approach. ORMs further suffer from a fundamentally misguided abstraction called the  object-relational impedance mismatch.\n  Similar to how React.js modernized frontend development or how Serverless invented a new model for compute infrastructure,  Prisma is here to bring a new and modern approach for working with databases!\n Prisma&#39;s unique approach to solving database access with a  generated query builder that&#39;s fully type-safe and can be tailored to any database schema schema sets it apart from previous attempts of solving the same problem.\n A big part of the modernization comes from our  major focus on developer experience. Database tools are often associated with friction, uncertainty, painful hours of debugging and costly performance bottlenecks.\n Developer experience is part of our DNA at Prisma. Working with databases is too often associated with friction and uncertainty when it should be fun, delightful and productive!\n We want to make working with databases  fun,  delightful and  productive while guiding developers towards proper patterns and best practices in their daily work with databases!\n  As a company we&#39;ve gone through a number of major product iterations and pivots over the last years.\n  Our initial products, Graphcool and Prisma 1 were focused on  GraphQL as a technology. However, as we were running both tools in production, we realized they didn&#39;t address the  core problems developers had.\n We realized that a lot of the value we provided with both tools didn&#39;t necessarily lie in the quick provision of a GraphQL server, but rather in the fact that developers didn&#39;t need to manage their  database workflows explicitly.\n This realization led to a pivot which ultimately manifested in the rewrite to Prisma 2. With this new version of Prisma, we have found the right level of abstraction that ensures developers keep full control and flexibility about their development stack while not needing to worry about database workflows!\n  The approach Prisma takes for this modernization is inspired by big tech companies such as Twitter, Facebook, or Airbnb.\n To ensure productivity of application developers, it is a common practice in these organizations to introduce a  unified data access layer that abstracts away the database infrastructure and provides developers with a more familiar and convenient way of accessing data.\n Facebook developed a system called  TAO that fulfills the data needs of application developers. Twitter has built a &#34;virtual database&#34; called  Strato which  brings together multiple data sources so that they can be queries and mutated uniformly. Airbnb  combines GraphQL and Thrift to abstract away the implementation details of querying data.\n  Building these custom data access layers requires  a lot of time and resources (as these are typically implemented by dedicated  infrastructure teams) and thus is not a realistic approach for most companies and development teams.\n Being based on the same core ideas and principles as these systems,  Prisma democratizes the pattern of a uniform data access layer and makes it accessible as an open-source technology for development teams of all sizes.\n    After running Preview and Beta versions for more than a year, we&#39;ve recently  launched Prisma 2.0 for production. Having rewritten the core of Prisma from Scala to Rust for the transition, we&#39;ve built a strong foundation to expand the Prisma toolkit to cover various database workflows in the future.\n Prisma&#39;s main feature is  Prisma Client, an auto-generated and type-safe query builder which can be used to access a database in Node.js and TypeScript. Thanks to  introspection, Prisma Client can be used to work with any existing database!\n Note: Prisma currently supports  PostgreSQL,  MySQL and  SQLite databases – with more planned. Please create  new GitHub issues or subscribe to existing ones (e.g. for  MongoDB or  DynamoDB) if you&#39;d like to see support for specific databases.\n  The Node.js ecosystem is known for lots of different frameworks that try to streamline workflows and prescribe certain conventions. We are extremely humbled that many framework authors decide to use Prisma as their data layer of choice.\n  The new  RedwoodJS framework by GitHub co-founder  Tom Preston-Werner seeks to become the &#34;Ruby on Rails&#34; equivalent for Node.js. RedwoodJS is based on React and GraphQL and comes with a baked-in deployment model for serverless functions.\n   Another framework with increasing anticipation and excitement in the community is  Blitz.js. Blitz is build on top of Next.js and takes a fundamentally different approach compared to Redwood. Its goal is to completely eliminate the API server and  &#34;bring back the simplicity of server rendered frameworks&#34;.\n  At Prisma, we&#39;re huge fans of GraphQL and believe in its bright future. That&#39;s why we founded the  Prisma Labs team which dedicates its time to work on open source tools in the GraphQL ecosystem.\n It is currently focused on building  Nexus, a delightful application framework for developing GraphQL servers. As opposed to RedwoodJS, Nexus is a  backend-only GraphQL framework and has no opinions on how you access the GraphQL API from the frontend.\n   Database migrations are a common pain point for many developers! Especially with applications running in production, it is often unclear what the best approach is to perform schema changes (e.g. in CI/CD environments). Many developers resort to manual migrations or custom scripts, making the process brittle and error-prone.\n Prisma Migrate is our solution to this problem. Prisma Migrate lets developers map the declarative  Prisma schema to their database. Under the hood, Prisma Migrate generates the required SQL statements to perform the migration.\n Note: Prisma Migrate is currently in an experimental state and should not be used in production environments.\n  Prisma Studio is your visual companion for various database workflows. It provides a modern GUI that lets you view and edit the data in your database. You can switch between the  table and the  tree view, the latter is especially convenient to drill deeply into nested data (explore the two views using the tabs below or try out the  online demo).\n  Note: Prisma Studio is currently in an experimental state and should not be used in production environments. .\n  Prisma Client is a thin, language-specific layer that delegates the heavy-lifting of query planning and execution to Prisma&#39;s  query engine. The query engine is  written in Rust and runs as a standalone process alongside your main application.\n This architecture enables us to expand Prisma Client to other languages and bring its benefits to developers beyond the Node.js community. We are already working on  Prisma Client in Go with a first  alpha version ready to try out!\n  Prisma is designed in a way that it can potentially connect to  any existing data source as long as there is the right  connector for it!\n As of today, we&#39;ve built connectors for PostgreSQL, MySQL and SQLite. A  connector for MongoDB is already in the works and more are planned for the future.\n   We are commited to building world-class open-source tools to solve common database problems of application developers. To be able to sustain our open-source work, we&#39;re planning to build commercial services that will enable development teams and organizations to collaborate better in projects that are using Prisma.\n Note: The plans for commercial services do not affect the open-source tools we are building, those will remain free forever.\n   We are incredibly grateful for everyone who has accompanied us on our journey! It is fantastic to see our lively community on  Slack,  GitHub,  Twitter and a lot of other channels where folks are chatting about Prisma and helping each other out!\n   If you&#39;ve become curious about Prisma and want to learn more, be sure to check out our online   Prisma Day conference that will be happening over the next two days!\n Be sure to tune in and hear from great speakers like  Tom Preston-Werner (GitHub co-founder &amp; RedwoodJS author),  Matt Billmann (Netlify CEO) and lots of Prisma team members for interesting talks and a lot of fun!\n  To try Prisma, you can follow the Quickstart or set up Prisma with your own database.\n  Quickstart (5 min) Explore how to send database queries with Prisma Client against a demo  SQLite database – no setup required!", "posttime": "2020-06-26 22:39:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "database,数据库,打造,build", "title": "Prisma筹集1200万美元A系列资金打造下一代数据库工具", "title_en": "Prisma Raises $12M Series A to Build the Next Generation of Database Tools", "transed": 1, "url": "https://www.prisma.io/blog/prisma-raises-series-a-saks1zr7kip6", "via": "", "real_tags": ["database", "数据库", "打造", "build"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008407, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2010年4月/5月，我花了四周的时间为洋葱新闻网(Onion News Network)做自由撰稿人。\n除了在简历上看起来很棒之外，这也是一份令人敬畏的工作和一次巨大的学习经历。不足为奇的是，我经常被问到这件事。\n所以这里是我所知道的关于如何为“洋葱报”找到一份写作工作的一切，以及我从我的(短暂的)工作中学到了什么。\n为“洋葱报”找到一份写作的工作并不容易。但这也不是什么大秘密。\n是啊。这就是我受雇为“洋葱报”撰稿背后的大新闻：我上了他们的网站并申请了职位。\n但事情是这样的--在我被录取之前，我至少做了两次，但没有运气。\n我会经常(痴迷地)查看工作列表，每隔一次，上面就会有一个职位叫自由撰稿人或自由撰稿人。你发送一封电子邮件，附上你的简历和样本，他们会发回一份申请书让你填写。你必须退还两样东西：\n视频小品的20个标题和概念的列表。(我看到的所有工作清单都是洋葱新闻网的--他们的录像带。我从来没有看到过任何编辑职位的空缺。)\n根据他们提供的想法或概念为他们的一个新闻片段小品编写的完整脚本。\n就像我说的，我至少经历了两次这个过程(最终产品在业内通常被称为a#34；Packet&34；)，但都没有成功。这听起来不是很多，但很难。我辛辛苦苦地读完了这20个头条新闻，你简直不敢相信。即使是最好的想法，在你盯着它们看了一周之后，也会开始看起来像屎一样。\n还有剧本。伙计，那太难了。他们从来没有给你一些重磅炸弹的概念，我想那是故意的。这总是某种干巴巴的、微妙的笑话--他们想看看你能做些什么，以及你会把它带到什么程度。\n但是我第三次申请的时候很吸引人。我永远不会忘记打开电子邮件时看到的这些话：\n洋葱新闻网祝贺您被选为国际金融公司系列的贡献者。我们有大量的申请者，我们对这个团队的强大感到兴奋。\n我记得发短信给我的妻子--当时的女朋友。她正在上课，走进大厅给我打电话。我们俩基本上都在电话里尖叫了几分钟。\n附注：我已经有几年没有看到洋葱杂志网站上列出的任何写作职位了。诚然，我不再那么频繁地检查，但我认为，如今与他们打交道的唯一途径是被招募，认识那里的人，或者作为实习生或作家的助理在职级中晋升。\n如果你真的想找份为“洋葱报”撰稿的工作，那就给他们发邮件吧。我听说过这样做的人的故事。他们说他们不会主动拿任何东西，而且他们有99%的可能性赢不了，但谁知道呢？机缘巧合可能会让你如愿以偿。\n他们马上让我们开始工作。那是在2010年，当时“洋葱”正在筹备它的第一个电视节目--国际金融公司(IFC)的洋葱新闻网(The Onion News Network On IFC)(独立电影频道)。\n它会很像我们知道和喜欢的洋葱视频内容，除了半小时的格式和反复出现的主播作为角色。\n我们被要求每周交25个点子；一个点子是一个标题或概念，并对这个笑话做一个简短的解释，以及这一部分将如何进行。\n有几周，我们会在清单上得到非常简短的反馈。其他几周，不是。然后，到周中，他们会把所有他们喜欢的想法汇编起来。有些会被标记为&34；One liners&34；，或者在节目期间会被拉进屏幕底部滚动的笑话。其他人则根据他们在节目中可能适合的地方进行细分，其中一些人被指定进入脚本阶段(在那里将由专职编剧接手)。\n这一过程进展很快。我的工作，和其他自由职业者一样，就是想出主意。我们并没有被真正咨询或告知关于这个节目的任何其他事情。没有讨论选角的会议。没有电话为我们的笑话集思广益。我们的工作是激发创造力，让全职员工过滤掉一切。一切都是通过电子邮件完成的。\n最后，我的想法中只有一个真正进入了节目--除非我错过了其中某个地方的俏皮话，这是很容易做到的。\n有趣的是，我的这个想法是从我的投稿包里提出来的--我非常肯定这就是他们雇用我的原因。他们实际上选择了用它来揭开整个系列的序幕，这是相当酷的。\n我把试播的时候录了下来，可能还和家人一起看了十几遍。这是我作为作家经历过的最酷的时刻之一。\n在很短的时间内，这对我来说是一次巨大的学习经历。我可能会一连几天谈论我在“洋葱报”当了四周作家时学到的一切，但如果非要简而言之，我会这么说：\n或者，在他们的情况下，是笑话。他们让我们想出了这么多的小品点子和头条。他们的长长的名单。一旦他们死了，他们就死了。在前几周，没有不能完全进入榜单的重复使用的想法。不要重复几乎就是这样的笑话。当一个想法被拒绝时，就是继续前进的时候了。总会有更大更好的笑话，或想法，在外面等着你去发现。\n我还学会了如何真正挖掘一个想法，看看它是否有潜力。他们不断地催促我们不要看新闻头条。这只是一个有趣的句子，还是有空间去探索和扩展成一个3分钟的小品？有实质内容吗？\n我喜欢“洋葱”的写作过程是因为它的体积之大。一周25个点子。没有借口。很多时候，我会上交超过25个，还有一大串我知道不够大的俏皮话，无法画出完整的草图。首先，它迫使我深入挖掘，忘记那些最初的想法，这些想法很容易出现。它还帮助我通过重复了解了“洋葱”的编辑话语权，这一点怎么夸张都不为过。\n我有一个很棒的主意，为了得到这份工作，我在申请中用光了它。我从头到尾都写了几个有趣的笑话，但远不及“洋葱”顶尖编剧的水平。我希望我能给你看我每周在收件箱里收到的这些被批准的想法的清单。通读它们绝对是一件令人兴奋的事；这些男孩和女孩都是如此的有才华和幽默。\n在项目结束时，他们选择留住一些自由撰稿人--唉，我不是其中之一。我也没想到会是这样。要想成为一名专业的幽默作家，你必须非常有趣和富有创造力。我是一个优秀的作家，我得到了他们的声音，我有一些好的想法，但我永远不会成为“洋葱报”的全职作家。这没什么。\n为“洋葱报”撰稿是我经历过的最酷的经历之一，我感到很幸运能得到这个机会。\n我的意思是，我看到一个我坐在起居室里的想法在电视上付诸实施，有真正的剧本，真正的演员，真正的制作价值。那真是太棒了，我永远不会忘记。更重要的是，我实际上拿到了一张薪水支票。人们付给我真金白银让我想出笑话来。太不可思议了。\n我认为，尽管这份工作很短暂，但我大胆地与职业喜剧编剧们一起深入研究，从中学到了很多东西。", "note_en": "In April/May of 2010, I spent four weeks as a freelance writer for The Onion News Network.\n Besides looking great on a resume, it was an awesome gig and a huge learning experience. Not surprisingly, I get asked about it pretty often.\n So here&#39;s everything I know about how to get a job writing for  The Onion, and what I learned from my (short) time doing it.\n    Getting a job writing for The Onion is not easy. But there&#39;s no big secret to it, either.\n  Yep. That&#39;s the big story behind how I got hired to write for The Onion: I went on their website and applied.\n But here&#39;s the thing -- I did this at least twice with no luck before I got accepted.\n  I would check the job listings frequently (obsessively), and every once in a blue moon, there&#39;d be a position on there called Freelancer or Freelance Writer. You&#39;d send in an email with your resume and samples, and they&#39;d send back an application for you to complete. You had to return two things:\n A list of 20 headlines and concepts for video sketches. (All the job listings I ever saw were for The Onion News Network -- their video leg. I never saw anything for editorial positions.)\n A completed script for one of their news segment sketches based on ideas or concepts they provided.\n Like I said, I went through this process (the final product is often known in the industry as a &#34;packet&#34;) at least twice with no success. It doesn&#39;t sound like much, but it is TOUGH. I labored over those 20 headlines like you wouldn&#39;t believe. Even the best ideas start to look like shit after you&#39;ve stared at them for a week.\n And the scripts. Man, those were hard. They never gave you blockbuster concepts to work with, and I think that was on purpose. It was always some kind of dry, subtle joke -- they wanted to see what you could do and how far you would take it.\n But the third time I applied was a charm. I&#39;ll never forget opening my email and seeing these words:\n The Onion News Network would like to congratulate you on being selected as a Contributor for the IFC series. We had a huge number of applicants, and we are thrilled with how strong this group is.\n I remember texting my wife -- girlfriend at the time. She was in class and stepped into the hall to call me. We both basically screamed on the phone for a couple of minutes.\n Side Note: I haven&#39;t seen any writing positions listed on The Onion&#39;s website in years. Granted, I don&#39;t check as frequently anymore, but I think the only way to get in with them these days is to be recruited, know someone there, or come up through the ranks as an intern or writer&#39;s assistant.\n If you REALLY want to get a job writing for The Onion; email them. I&#39;ve heard stories of people that have done this. They say they won&#39;t take anything unsolicited, and there&#39;s a 99% chance they won&#39;t, but who knows? Serendipity just might strike for you.\n    They put us to work right away. This was back in 2010, and The Onion was going into pre-production on its very first TV show -- The Onion News Network on IFC (The Independent Film Channel).\n It would be a lot like the Onion video content we knew and loved, except in a half hour format and with recurring anchors as characters.\n We were required to turn in 25 ideas a week; an &#34;idea&#34; being a headline or concept along with a short explanation of the joke and how the segment would play out.\n Some weeks, we&#39;d get really brief feedback on our lists. Other weeks, not. Then, by mid week, they&#39;d compile all the ideas they liked. Some would be marked down as &#34;one liners&#34;, or jokes that would be pulled in to scroll across the bottom of the screen during the show. Others were segmented by where in the show they might fit in, with some of them designated to move to the scripting stage (where the staff writers would take over).\n The process moved fast. My job, along with the other freelancers, was to come up with ideas. We weren&#39;t really consulted or informed about anything else surrounding the show. No meetings to discuss casting. No phone calls to brainstorm around our jokes. It was our job to pump out creativity and let the full time staff filter everything out. Everything was done over email.\n In the end, only one of my ideas actually made it into the show -- unless I missed a one-liner somewhere along the line, which would be easy to do.\n Funny enough, the idea of mine that made it to production was one from my submission packet -- I&#39;m pretty sure it&#39;s the reason they hired me. And they actually chose to open the entire series with it, which was pretty cool.\n I recorded the pilot when it aired and probably watched it a dozen times with my family. One of the coolest moments I&#39;ve ever had as a writer.\n    This was a huge learning experience for me in a very short amount of time. I could probably talk for days about everything I learned working as a writer for The Onion for four weeks, but if I had to boil it down, here&#39;s what I&#39;d say:\n  Or, in their case, jokes. They made us come up with so many sketch ideas and headlines. Huge lists of them. And once they were dead, they were dead. There was no reusing ideas that didn&#39;t quite make the cut in previous weeks. No iterating on almost-there jokes. When an idea was rejected, it was time to move on. Always bigger and better jokes, or ideas, out there to be found.\n I also learned how to really dig into an idea to see if it had any potential. They were constantly pushing us to see past the headline. Is it just a funny sentence or is there room to explore and expand this into a 3 minute sketch? Is there substance?\n  What I loved about The Onion&#39;s writing process was the sheer volume of it. 25 ideas a week. No excuses. Often times, I&#39;d turn in more than 25, along with a big list of one-liners I knew weren&#39;t big enough for full sketches. For one thing, it forced me to dig deep and get past those first initial ideas that came easily. It also helped me learn The Onion&#39;s editorial voice through repetition, which is something that can&#39;t be overstated.\n  I had one great idea and I used it up in my application to get the job. I wrote a few other funny jokes throughout, but nowhere near the level of The Onion&#39;s top writers. I wish I could show you these lists of approved ideas I got in my inbox each week. Reading through them was an absolute blast; these guys and girls are so freaking talented and funny.\n At the end of the project, they opted to keep a few of the freelance writers on -- alas, I was not one of them. And I didn&#39;t expect to be. To be a professional humor writer, you have to be insanely funny and creative. I&#39;m a good writer, and I got their voice, and I have a few good ideas, but I was never going to make it as a full-time writer for The Onion. And that&#39;s okay.\n    Writing for The Onion was one of the coolest experiences I&#39;ve ever had, and I feel lucky to have gotten the opportunity.\n I mean, I got to see an idea I had sitting in my living room acted out on TV with a real script, real actors, and real production value. That was awesome, and I&#39;ll never forget it. And to top it off, I actually got a paycheck. People paid me real money to come up with jokes. That was incredible.\n And I&#39;d like to think that, even though the gig was short lived, I learned a ton by being bold enough to jump into the deep end with pro comedy writers.", "posttime": "2020-06-26 22:38:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "文章,writing,洋葱", "title": "我从为“洋葱报”写了一个月的文章中学到了什么(2015)", "title_en": "What I learned from writing for The Onion for a month (2015)", "transed": 1, "url": "https://wordsbyevanporter.com/what-i-learned-from-writing-for-the-onion-for-a-month/", "via": "", "real_tags": ["文章", "writing", "洋葱"]}, {"category": "", "categoryclass": "", "imagename": "97d4e312862e1c937713f930861470c0.jpg", "infoid": 1008406, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这一发现暗示，地下海洋在太阳系外很常见，这对那些寻找外星生命的人来说是个好消息。\n当早期的地球还是一个表面游动在液态岩浆中的熔融物质时，冥王星和它的地下海洋才刚刚形成。在那之后的数十亿年里，冥王星上的液态水一直留在遥远的太阳系中，为生命提供了潜在的栖息地。至少，这是6月22日发表在“自然地球科学”杂志上的一项新研究的结论。这项研究改写了科学家关于冥王星早期历史的理论，并表明曾被认为是地球独有的其他液态海洋在太阳系外的矮行星上很常见。“海洋无处不在。它们中的大多数都在太阳系外。西南研究院天文学家、NASA“新地平线”任务负责人S·艾伦·斯特恩(S.Alan Stern)说。“这是我们看待太阳系方式的根本改变。”\n2015年，当“新地平线”号飞船飞越冥王星时，它揭示了一个如此活跃和复杂的表面地质，以至于科学家们怀疑，在冥王星厚厚的冰壳下数英里的地方可能曾经埋藏着一个海洋。近年来，这些怀疑越来越接近于假设。现在，大多数行星科学家一致认为，即使在今天，冥王星的表面下也有一个全球性的液态海洋。但是，一个比地球月球还小的世界怎么会停靠在海洋上呢？它是如何在数十亿年的时间里避免冰冻的呢？有了这项新的研究，科学家们认为他们终于有了这些问题的答案。到目前为止，天文学家一直认为冥王星是由非常缓慢地聚集在一起的冰冷物质形成的。当一个尘土飞扬的碎片盘围绕着我们的太阳合并时，这颗矮行星将逐渐从碎石和冰块中聚集在一起。一旦冥王星的内部热量足够大，它的一些冰就会融化，形成地下海洋。天文学家说，这个故事很管用，因为冥王星的地下海洋仅仅是由放射性元素的衰变来解释的。但这项最新研究背后的团队无论如何都想要测试这一理论。他们想要找出冥王星是否从热开始，并像早期地球一样通过一系列巨大的撞击而形成。加州大学圣克鲁斯分校的研究生卡弗·比尔森(Carver Bierson)说：“我们从早期太阳系内部，通过陨石和其他东西很好地理解了这张照片。”然而，他补充说，“我们实际上并没有太多关于外太阳系的图片。”事实证明，有一种方法可以通过简单地观察矮行星的表面来判断冥王星是热的还是冷的。它与一个简单的事实有关，即水在冻结时膨胀，在融化时压缩。斯特恩说：“如果你拿一杯水放在冰箱里，玻璃杯会在一夜之间破碎，因为当水结冰时，它会膨胀。”“冥王星上也是如此。”当水结冰时，里面的分子振动较少，形成一种晶体结构，使冰的密度变小。这就是为什么冰块漂浮在你的杯子里，也是为什么这种固体水也会膨胀的原因。因此，如果冥王星开始变热，然后慢慢冻结，它的表面应该已经膨胀，留下了通过膨胀形成的地质特征的证据。但是，如果冥王星有一个冷的开始，这颗矮行星的表面应该会显示出压缩的证据，可以追溯到世界遥远的历史。为了探究这两种情况中哪一种符合证据，研究小组仔细查看了“新视野”的数据，寻找扩张或压缩的迹象。他们对他们的发现感到惊讶。“我们看到冥王星上的地形看起来非常古老，大致相当于太阳系的年龄，我们没有看到这种压缩的证据，”比尔森说。这表明这是一个炙手可热的开始。一个这样的例子来自陨石坑。撞击冰雪世界通常会形成整齐的圆圈。但随着时间的推移，冥王星的陨石坑都被拉长了，即使是那些坐落在最古老的地形上的陨石坑也是如此。但是，它们中没有一个是压缩的。还有其他方面的证据。Bierson继续使用热启动情景模拟冥王星的早期形成。他发现，如果冥王星是通过一系列快速的大撞击形成的，那么这些爆炸产生的热量将会继续积累。这将使冥王星的内部海洋保持液态。但比尔逊说，要做到这一点，世界必须在大约3万年内形成-如果不是更少的话。尽管如此，这个想法实际上与最近其他关于柯伊伯带早期演化的模型非常吻合，柯伊伯带是海王星以外的一个由冰冻物体和矮行星组成的区域。研究表明，较小的柯伊伯带天体可能在短短几百年或几千年内形成。“地质学告诉我们这一点，这是一件好事，”他说。“试图了解(柯伊伯带)动态的人也来了。", "note_en": "The discovery hints that subsurface oceans are common in the outer solar system, which is good news for the those seeking extraterrestrial life.\n   When early Earth was still a molten mass with a surface swimming in liquid magma, Pluto and its underground ocean were just forming. And for the billions of years since, liquid plutonian water has remained in the distant solar system, providing a potential abode for life. At least, that’s the conclusion of a new study  published June 22 in the journal  Nature Geoscience.  The study rewrites scientists’ theories about the early history of Pluto and suggests that other liquid oceans — once thought to be unique to Earth — are common on dwarf planets across the outer solar system.  “Oceans are ubiquitous. Most of them are in the outer solar system. And they could be abodes for life,” says S. Alan Stern, an astronomer at the Southwest Research Institute and head of NASA’s New Horizons mission. “This is a fundamental sea change in the way we view the solar system.”\n When the  New Horizons spacecraft made its flyby of Pluto in 2015, it revealed a surface geology so active and complex that scientists suspected there may have once been an ocean buried miles beneath Pluto’s thick crust of ice. Those suspicions have grown closer to presumptions in recent years. And now, most planetary scientists agree that, even today, Pluto has a global liquid ocean under its surface. But how does a world smaller than Earth’s moon harbor on ocean? And how did it manage to keep it from freezing over the course of billions of years? With the new study, scientists think they finally have an answer to these questions.  Until now, astronomers assumed that Pluto formed out of cold material glomming together very slowly. As a dusty disk of debris coalesced around our Sun, the dwarf planet would have gradually clumped together out of bits of rock and ice. Once large enough, Pluto’s internal heat would have melted some of its ice, creating a subsurface ocean. That story works well, astronomers say, as Pluto’s underground ocean is explained simply by the decay of radioactive elements.  But the team behind this latest research wanted to test that theory anyway. They wanted to find out whether Pluto started off hot instead, and formed through a series of massive impacts much like early Earth.  “We understand this picture fairly well from the early inner solar system through meteorites and other things,” says lead study author Carver Bierson, a graduate student at the University of California, Santa Cruz. However, he adds, “we actually don’t have much of a picture for the outer solar system.” As it turns out, there is a way to tell whether Pluto formed hot or cold by simply observing the dwarf planet’s surface. It relates to the straightforward fact that water expands as it freezes and compresses when it melts. “If you take a glass of water and put it in the freezer, that glass is going to break overnight because when the water freezes, it expands,” Stern says. “The same thing is true on Pluto.” When water freezes, the molecules inside vibrate less and form a crystalline structure that leaves ice less dense. That’s why ice cubes float in your glass, and why this solid water also expands. So if Pluto started hot and then slowly froze, its surface should have expanded, leaving evidence of geologic features formed through expansion. But if Pluto had a cold start, the dwarf planet’s surface should show evidence of compression going back into the world’s distant history. To probe which of these two scenarios fits the evidence, the team took a closer look at New Horizons’ data, searching for signs of either expansion or compression. They were surprised by what they found.  “We see terrains on Pluto that look to be very old, roughly the age of the solar system, and we don’t see evidence of that compression,” Bierson says. That suggests a hot start. One such example comes from craters. Impacts on an icy world typically form neat circles. But over time, Pluto’s craters have all been stretched out, even ones that sit in the oldest terrains. However, none of them are compressed.  There are other lines of evidence, too.    \rBierson went on to model Pluto’s early formation using a hot-start scenario. He found that if Pluto formed through a rapid succession of large impacts, the heat from those explosions would continue to build up. This would maintain Pluto’s internal ocean in a liquid state. But for that to have happened, Bierson says, the world must have formed in some 30,000 years — if not less.   \rStill, this idea actually matches up well with other recent models of the early evolution of the Kuiper Belt, a region of icy objects and dwarf planets beyond Neptune. Studies suggest that smaller Kuiper Belt objects could have formed in just a few hundred or thousand years.    \r“It&#39;s kind of nice that the geology is telling us this,” he says. “People trying to understand the [Kuiper Belt] dynamics are also coming to this conclusion.” The conclusion of a hot start for Pluto “is a weird, surprising answer,” he adds.\n Pluto’s suspected sizzling start also carries major implications for the small world’s neighbors, like Eris, Makemake, and Haumea. If Pluto formed hot and fast, other dwarf planets likely did as well. Taken together with new knowledge of the icy ocean moons around the gas giant planets, astronomers are overturning the old notion of Earth as the sole ocean world in our solar system. Instead, it could be that the outer solar system is surprisingly rich in liquid water.   \r“Dozens of worlds in the inner and outer solar systems could have oceans,” Stern says. “It’s one of the most profound discoveries in planetary science in the Space Age.”   \rThese alien worlds might not seem like a likely place for life to emerge. Pluto sits an average of some 4 billion miles from the Sun (about 40 times farther away than Earth), where very little light reaches the dwarf planet&#39;s surface, letting temperatures drop to around –400 degrees Fahrenheit.   \rBut below Pluto’s frigid surface, in the relatively warm subsurface ocean, life would be protected from radiation and asteroid impacts.    \r“The interesting thing about oceans on the inside is that, in some ways, they’re much safer havens for life,” Stern says. “You’re protected from impacts like the ones that killed the dinosaurs. If the Sun releases flares or a supernova goes off, then you’re safe from that.”\n This latest find adds to a growing body of evidence that suggests Pluto has long harbored an active ocean. And another piece of that puzzle only arrived earlier this year.   \rPluto’s icy “heart” is the world’s most recognizable feature. The region is shaped by what looks like a giant impact basin the size of Texas. The heart’s left lobe consists of a 600-mile-wide (1,000 kilometers) ice plain called Sputnik Planitia, which is the largest glacier in the solar system. When New Horizons first brought this feature into clear focus, astronomers thought it must have formed when another large object smashed into Pluto in its past.    \rHowever, the exact location of the basin is suspicious. It sits on precisely the opposite side of world from Pluto’s large moon, Charon. Because an impactor could have hit Pluto anywhere, Stern says, “the idea that this just happened to strike opposite to Charon could be coincidence, but it seems to me too much to believe that it happened entirely by chance.”   \rInstead, he thinks the alignment between Charon and Sputnik Planitia could be due to a complicated process called polar wander. Based on models, scientists think the massive glacier could have easily slid along the dwarf planet’s surface until it sat directly opposite from Charon. But that model only makes sense if Pluto has an ocean.\n Are you ready to see what New Horizons learned at Pluto? Check out our free downloadable eBook,   The strange, icy world of Pluto to learn more about the groundbreaking mission to this distant world.\n Still, Stern admits the evidence they have for the existence of Pluto’s ocean is indirect. “We have several lines of circumstantial evidence, but you usually can’t convict in a court of law on circumstantial evidence,” he says.    \rAnd that’s  why Stern and a team of researchers are pushing for a Pluto orbiter that would not just return to the dwarf planet, but actually orbit it. New Horizons only got a quick look at Pluto during its brief flyby. And though groundbreaking, the probe only captured high-quality images of 40 percent of the distant world. And another 40 percent of the surface was too dark for New Horizons to even make out anything at all. A Pluto orbiter, on the other hand, could be built with radar and laser instruments that don’t need visible light to see the surface.   \rAccording to Stern, “We’re going to need an orbiter to clinch the case [for Pluto’s ocean], just like it took Cassini to clinch the case for an ocean at Enceladus and Galileo to clinch the case for an ocean at Europa.”", "posttime": "2020-06-26 22:38:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可能,maintained,冥王星", "title": "冥王星可能维持了数十亿年的地下液态海洋。", "title_en": "Pluto has likely maintained an underground liquid ocean for billions of years", "transed": 1, "url": "https://astronomy.com/news/2020/06/pluto-has-likely-maintained-an-underground-liquid-ocean-for-billions-of-years", "via": "", "real_tags": ["可能", "冥王星"]}]