[{"category": "", "categoryclass": "", "imagename": "ce1dd2c891c2def57b6dba394bfc61ed.jpg", "infoid": 1005348, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有时，有毒物质，如危险废物和工业副产品，会渗入地下水，这是我们饮用水的来源。其中一种污染物是高氯酸盐，这是一种用于火箭燃料、烟花爆竹、化肥和其他材料的化合物。这种化合物被认为对人类的健康问题有贡献，如甲状腺功能减退，即甲状腺分泌的激素减少，这可能会影响发育。\n在2020年5月25日发表在“自然结构与分子生物学”杂志上的一项新研究中，约翰霍普金斯医学院、范德比尔特大学和加州大学欧文分校的研究人员报告了高氯酸盐影响和损害甲状腺正常功能的机制。\n他们说，这些发现表明，饮用水中可接受的安全高氯酸盐浓度比之前认为的要低10倍。\n研究人员专注于高氯酸盐如何阻断碘元素的负电荷形式碘进入甲状腺细胞的主要途径。碘化物帮助甲状腺分泌荷尔蒙，这些荷尔蒙对人体新陈代谢、体温和其他重要功能的调节至关重要。\n甲状腺细胞通过一种称为钠/碘同向转运体(也称为Na+/I-同向转运体或NIS)的蛋白质通道来控制碘的流入。与其他蜂窝传输系统一样，移动碘化物也使用“锁和钥匙”的方法，NIS充当锁，钠充当钥匙。钠在NIS的两个结合位点上适合解锁通道，使碘化物能够通过并积累在甲状腺细胞内。\n由约翰霍普金斯大学医学院生物物理和生物物理化学教授L Mario Amzel博士和范德比尔特大学研究员Nancy Carrasco医学博士领导的研究小组确定，高氯酸盐通过抓住NIS蛋白并改变其形状来阻断通道。更少的钠结合到畸形的通道上，从而显著降低了可以在甲状腺细胞内移动的碘化物量。\n研究人员研究了不同浓度的高氯酸盐如何通过首先生长的表达SLC5A5基因的甲状腺细胞影响碘的运输，SLC5A5基因编码了建立NIS通道的指令。接下来，高氯酸盐和放射性碘被放在一些细胞的外面，而其他的细胞外只放了放射性碘。最后，研究人员跟踪了两组中有多少发光的碘化物被允许进入细胞。他们发现，高氯酸盐处理的甲状腺细胞内的碘化物比未处理的要少得多，即使是在非常低的化学物质浓度下也是如此。\n2020年5月，美国环境保护局(EPA)裁定不对饮用水中允许的高氯酸盐含量进行监管。这项新研究的结果强烈表明，这种环境污染物比之前认为的更危险，这引发了人们对这一决定的严重担忧。\n“我们希望这些发现能促使环境保护局改变主意，”Amzel说。", "note_en": "Sometimes toxins, such as hazardous wastes and industrial byproducts, seep into groundwater, the source of our drinking water. One such pollutant is perchlorate, a chemical compound used in rocket fuels, fireworks, fertilizers and other materials. The compound is thought to contribute to health issues in humans such as hypothyroidism, the decreased production of hormones from the thyroid gland, which can impact development.\n  In a new study published May 25, 2020, in the journal   Nature Structural &amp; Molecular Biology, researchers at Johns Hopkins Medicine, Vanderbilt University and the University of California, Irvine, report on the mechanism that perchlorate uses to impact and damage normal functioning of the thyroid gland.\n  The findings, they say, suggest that an acceptable safe concentration of perchlorate in drinking water is 10 times less than previously thought.\n  The researchers focused on how perchlorate blocks a main route by which iodide, the negatively charged form of the element iodine, enters thyroid cells. Iodide helps the thyroid make hormones that are essential to the body’s regulation of metabolism, temperature and other important functions.\n  Thyroid cells control the incoming flow of iodide by using a protein channel called the sodium/iodide symporter, also known as the Na+/I- symporter or NIS. Like other cellular transport systems, a “lock-and-key” approach is used to move iodide, with NIS acting as the lock and sodium as the key. Sodium fits into NIS at two binding sites to unlock the channel, enabling iodide to pass through and accumulate inside a thyroid cell.\n  The team, led by   L Mario Amzel, Ph.D., professor of biophysics and biophysical chemistry at the Johns Hopkins University School of Medicine, and Vanderbilt University researcher   Nancy Carrasco, M.D., determined that perchlorate blocks the channel by latching onto the NIS protein and changing its shape. Less sodium binds to the misshaped channel, thereby significantly lowering the amount of iodide that can be moved inside thyroid cells.\n  The researchers studied how varying concentrations of perchlorate affects iodide transport by first growing thyroid cells that expressed the gene SLC5A5, which encodes the instructions for building NIS channels. Next, perchlorate and radioactive iodine were placed outside of some of the cells and just radioactive iodine outside the others. Finally, the researchers tracked how much glowing iodide was allowed to enter the cells in both groups. They found that there was much less iodide inside thyroid cells treated with perchlorate than in untreated ones, even at very low concentrations of the chemical.\n  In May 2020, the U.S. Environmental Protection Agency (EPA) ruled not to place regulations on the amount of perchlorate that can be allowed in drinking water. The findings from the new study strongly suggest that this environmental pollutant is more hazardous than previously thought, raising serious concern about the decision.\n  “We hope that these findings will prompt the EPA to change its mind,” Amzel says.", "posttime": "2020-06-06 05:01:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "火箭,氯酸盐,rocket,甲状腺", "title": "火箭燃料中使用的高氯酸盐可能比之前认为的更危险。", "title_en": "Perchlorate, used in rocket fuels, may be more hazardous than previously thought", "transed": 1, "url": "https://www.hopkinsmedicine.org/news/newsroom/news-releases/research-story-tip-something-in-the-water-environmental-pollutant-may-be-more-hazardous-than-previously-thought", "via": "", "real_tags": ["火箭", "氯酸盐", "rocket", "甲状腺"]}, {"category": "", "categoryclass": "", "imagename": "84f324e7e163aa0928a869fe61f9b9f6.png", "infoid": 1005347, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Kubernetes已经成为集装箱化世界的新标准。开发团队可以利用各种有用的抽象，以可靠的方式编排容器。尽管Kubernetes很有魅力，但它是一个非常复杂的平台。操作和维护它需要一支技术高超的团队。在本文中，我想分享一下我们是如何解决构建内部Kubernetes产品的问题，以帮助我们的开发团队最大限度地利用Kubernetes。\n本文较少关注平台的实际技术设计。我们想要了解为什么这样的产品对我们来说是有意义的，以及我们认为引导我们进行可靠设计的各种主题。\n如果我们的组织中没有集中管理的Kubernetes产品，团队将开始构建自己的集群。通常，这些服务将由云提供商(GKE、AKS、…)管理。需要团队投入大量额外的时间和精力。\n在某些用例中，每个开发团队使用一个集群是有意义的，但是，通常情况下，我们在使用此模型时遇到了多个问题：\n规模经济：Kubernetes的构建是为了利用规模经济。单个群集通常具有较低的Pod密度和较高的财务开销。命名空间、资源配额或RBAC等多个概念本身就支持多租户。\n技能：开发团队需要几个月的时间才能达到这样的水平，即他们拥有在生产中运行自己的集群所需的技能和经验。我们不能期望，也不希望每支球队都走上这条路。如果一个不合格的团队运行您的Kubernetes基础设施，您最终支付的费用将比购买中央平台团队的费用高得多。\n成本：这与规模经济有关，但足够重要，需要单独指出。几个云提供商都有支持您的群集所需的最低节点数。也就是说，遵循每个团队一个群集的方法时，群集往往会过度调配/未得到充分利用。除了资源方面的考虑外，每个团队都必须计划额外的时间和精力(成本)来运营自己的集群。\n卓越中心：如果每个团队都运行自己的集群，那么几个团队很可能会遇到相同的问题，并且不交换任何信息。在大型组织中，所学到的经验教训通常不会共享。您很可能会看到不同的配置和糟糕的安全实践-简而言之：治理的噩梦。中央团队可以强制执行最佳实践，并专注于其最擅长的工作：运行集群。\n有几个Kubernetes as a Service产品可能值得一看。本文重点介绍如何为您的组织启动内部Kubernetes产品，以及如何使其成为对您的开发人员有吸引力的替代产品。\n“集装化浪潮”最近席卷了我们的组织，大多数团队决定使用Kubernetes作为他们的容器编排引擎。库伯内斯对许多球队来说都是新的，但这并没有阻止他们使用它。部署您的容器化应用程序并不那么困难。然而，操作和维护集群是很重要的，而且这对大多数团队来说并不需要太长时间就会变得显而易见。\n值得一提的是，许多不熟悉Kubernetes的团队低估了在生产环境中运行集群所需的知识和经验。启蒙可以很快到来，但也可能需要几个月的时间-但它肯定会到来。\n不幸的是，当团队意识到运行一个或多个集群确实有多难时，往往为时已晚。您必须维护您的集群，并将您的资源花在应该由平台团队处理的运营任务上。\n在构建新产品之前，您应该很好地了解客户的痛点和您要解决的问题。让您的客户参与此阶段以确保您了解要求和需求，这一点至关重要。\n根据痛点和您的总体组织目标，您可以得出您的KPI，完成此步骤非常重要。没有关键绩效指标，您就不知道您的产品表现有多好。花点时间思考一下KPI，这些KPI实际表明平台做得有多好，以及确定的痛点减少到了什么程度。关键绩效指标应该会影响您的路线图。内部Kubernetes产品的一些KPI可能包括：\n理想情况下，对于您确定的每个痛点，您还需要一个KPI来衡量您的产品在多大程度上减少或消除了此痛点。\n根据这些痛点和您的KPI，让我们看看将引导我们为您的组织引入替代模式的高级需求。事先要有一个重要的思维定势：使用自己的单独集群的团队不应该被强迫迁移到共享集群。我们的想法应该是以开发团队想要迁移到内部产品的方式构建内部产品。为了构建如此引人注目的产品，以下是需要满足的一些高级要求：\n容易迁移：在单个集群中，在出现故障之前不会引起注意的不良做法。在共享集群中，必须强制执行最佳实践以使其适用于所有人。例如，您必须调整部署应用程序的方式，以支持自动伸缩或防止吵闹的邻居。其中一个需求是通过帮助开发团队应用这些最佳实践来简化他们的迁移。\n功能对等：开发团队应该至少获得他们当前通过各自集群获得的功能集。此外，它对应用程序应该是透明的，无论它是在独占集群中运行还是在共享集群中运行。所有功能(例如云提供商区域的可用性或服务发现)应该从一开始就可供客户使用。\n运营稳定性：大多数团队转移到集中管理的集群的主要原因是Kubernetes带来的运营痛苦。因此，平台团队必须做好工作，使尽可能多的操作任务远离开发团队。这包括故障转移到其他区域和快速启动新群集的能力。\n孤立和吵闹的邻居问题：共享模型中的大多数开发团队最关心的是“我不想因为其他团队搞砸了而处理停机时间”。我们必须确保利用Kubernetes概念和其他工具来防止一个团队干扰同一集群上的另一个团队。\n监测和遥测：通过遥测获得信任并能够根据实际数据回答问题是关键。对于成本降低和可用性等关键绩效指标，平台必须生成自动报告。\n以下各节将探讨您必须花费时间来满足确定的需求的一些主题。\nKubernetes提供多种支持多租户和隔离的功能。目标应该是提供最少数量的特权，范围限定为您的每个团队所需的资源。应该很好地理解和实施的一些功能包括：\n确保平台团队强制执行它们，并且开发团队将它们考虑在内，然后部署他们的应用程序。这意味着开发团队需要很好地了解其资源需求，并且必须能够在没有集群管理员访问权限的情况下工作。提供详细的文档和部署示例对您的开发团队有很大帮助。\n运行多租户工作负载时，您可以信任的唯一隔离级别是虚拟机管理程序，以确保真正的安全性。这意味着Kubernetes的安全域成为整个集群。因此，建议在物理上将您的非PROD和PROD环境分开。\n如果您必须通过您的平台服务于所有主要市场，并且目标是将PROD与非NPROD群集物理隔离，则设置可能如下所示：\n作为灾难恢复计划以及支持具有高可用性要求的团队，提供了两个可用性区域(区域#1、区域#2)。这些是您的云提供商的配对区域，因此数据中心故障不会同时影响这两个区域。\n与单个群集相比，此设置提供了巨大的优势。开发团队必须运行至少6个集群才能在平台级实现相同质量的服务(灾难恢复或高可用性)。\n为了将应用程序从单个群集迁移到共享群集，您不仅需要群集级别的功能奇偶校验，还需要遵守共享模型中所需的一些策略。要在移动到共享集群之前检查团队的部署，可能值得通过策略自动执行冲突检查，例如缺少资源定义和部署到默认命名空间。此处的一个选项是Open Policy Agent：\n要使集群自动缩放器有效运行，您必须定义您的资源(请求/限制)。这就是为什么在共享集群中，您必须强制每个团队配置资源定义。\n尽可能自动执行迁移。理想情况下，提供一种自助体验，开发团队可以在其中提供命名空间名称、资源配额和RBAC组等信息。特别是对于生产流量而言，对金丝雀部署的工具支持是必不可少的。\n在开始时限制您迁移到您的平台的应用程序的类型可能是个好主意。您只能允许无状态应用程序或流量较低的应用程序。此外，这可能是一个好时机来质疑球队的决定，甚至去库伯内斯。与其盲目地让团队接受您的产品，您可能需要为他们的问题提出不同的解决方案。\n这里的目标是监视整个群集的运行状况。我们感兴趣的是集群中节点的健康状态、容量大小、每个节点上运行了多少应用程序以及整个集群的资源利用率。\n在这里，您开始涉足您的客户的领域。如果有系统或平台Pod，则必须由平台团队进行监控。如果您希望您的开发负责他们的命名空间中发生的事情，他们需要研究这种监视。\n对于生产中的Kubernetes来说，对资源指标的洞察是至关重要的。通常，生产中的Kubernetes错误是由CPU或内存资源不足引起的。通过实时了解资源使用情况，可以避免此类事件。使用方法是分析任何系统性能的一种方法。资源指标对于成本洞察和成本控制也很重要，如下面的成本管理部分所述。有关监控资源指标的一篇很棒的帖子可以在这里找到：\n当涉及到监控Kubernetes时，开源工具的事实标准是Prometheus&amp；Grafana。如果您的组织习惯于麋鹿，这也是一个有效的选择。如果您有足够的人数和经验来管理开源解决方案，那么根据我们的经验推荐使用Prometheus&amp；Grafana。\n如果您的组织负担得起，您绝对应该考虑几种SaaS解决方案，DataDog就是一个例子：\n监控工具应该为您提供涵盖上述主题以及验证SLO和KPI所需的洞察力。\n如果您的KPI之一是在组织级别上降低成本，那么在迁移前后跟踪每个团队的支出是至关重要的。这假设团队的应用程序负载在度量的时间范围内没有显著变化。即使成本不是您的KPI的一部分，您也可能希望为管理报告建立按存储容量使用计费模型或跟踪成本。\n在这两种情况下，您都需要能够将成本分配给导致它的团队。这些功能不是Kubernetes或任何主要云提供商的Kubernetes产品的开箱即用功能。幸运的是，您可以选择以下几个选项：\nKubecost模型为团队提供了对当前和历史Kubernetes支出和资源分配的可见性。这些模型在支持多个应用程序、团队、部门等的Kubernetes环境中提供成本透明性。\nKubernetes成本核算、分配和按存储容量使用计费是生产Kubernetes实施遇到的首批操作问题之一。准确分配Kubernetes成本不仅是管理要求，也是优化Kubernetes成本的第一步。\n除了资源成本，日志记录可能成为一个重要的成本因素。您的平台团队不应为客户生成的日志收费，请在设计解决方案时牢记这一点。\n当开始提供Kubernetes平台时，事情就会失败。从一开始就不会一帆风顺，您的平台团队将以与开发团队相同的方式吸取教训。尝试尽快获得生产流量的经验，因为这是真正学习它的唯一途径。从小型的特殊用途群集开始，而不是构建满足所有工作负载要求的单个群集。\n您的客户必须知道您的责任在哪里结束，他们的责任从哪里开始。为了防止给您的客户带来任何意外，请在您的文档中划出这条线，并将其非常清楚地显示出来。\n确保对每一次停机进行分析，并将其记录在运行手册中，以防止再次发生这种情况。运行手册的编写方式应该是，即使是在半夜，随叫随到的团队中的任何人都知道该做什么。\nKubernetes是一项快速发展的技术，每年都会有多次版本升级。您需要清楚地记录该流程，并将其传达给您的客户。在这种情况下，您必须做出的另一个决定是就地升级还是新群集。就地升级应该是可行的，而且通常是对您的客户影响最小的方法。如果您想让客户有机会按照自己的进度迁移到新版本，那么使用新版本的单独群集是个好主意。\n有多个案例研究和失败案例值得您查看，其中一个例子就是：", "note_en": "Kubernetes has become the new standard in the containerized world. Development teams can leverage various useful abstractions that orchestrate containers in a reliable way. Despite all the charm of Kubernetes, it is a very complex platform. Operating and maintaining it requires a highly skilled team. In this article I would like to share how we tackled the problem of building an internal Kubernetes offering to help our development teams getting most out of Kubernetes.\n This article will focus less on the actual technical design of the platform. We want to look into why such as an offering made sense for us and the various topics we considered that lead us into a solid design.\n  If there is no centrally managed Kubernetes offering available in our organization, teams will start spinning up their own clusters. Usually those will be managed by the cloud provider (GKE, AKS, …) with a lot of additional time and effort required from the team.\n  There are use cases where one cluster per development team make sense, generally however, we experienced multiple problems with this model:\n Economies of scale: Kubernetes has been built to leverage economies of scale. The individual clusters usually have a low pod density and a high financial overhead. Multiple concepts such as namespaces, resource quotas or RBAC support multi-tenancy natively.\n Skills: It takes multiple months to take a development team to a level where they have the skill set and experience to run their own cluster in production. We can’t expect and we don’t want every team to go down this path. If an unqualified teams runs your Kubernetes infrastructure, you will pay much more at the end than you would have paid for a central platform team.\n Cost: This is related to economies of scale but is important enough to point it out separately. Several cloud providers have a minimum node count to support your cluster. That is, clusters tend to be over-provisioned/underutilized when following the one cluster per team approach. Besides the resource considerations, every team has to plan for additional time and effort (cost) to operate their own clusters.\n Center of excellence: If every teams runs its own cluster, chances are high that several teams will run into the same issue and don’t exchange any information. Lessons learned are often not shared in a large organization. Chances are high that you will see diverging configurations and bad security practices — in short: a governance night mare. A central team can enforce best practices and focus on what it can do best: running your cluster.\n  There are several Kubernetes as a Service offerings which may be worth a look. This article focuses on starting an internal Kubernetes offering for your organization and how to make it an attractive alternative for your developers.\n   A “containerization wave” went through our organization recently and most teams decided for Kubernetes as their container orchestration engine. Kubernetes is new to many teams but this did not stop them from using it. Deploying your containerized application isn’t that hard. Operating and maintaining a cluster however is, and it didn’t take long to become apparent to most of the teams.\n Worth mentioning is that many teams that are new to Kubernetes underestimate the required knowledge and experience you need run a cluster in production. The enlightenment can come very quickly but can also take multiple months — but it will come for sure.\n  Unfortunately, when a team realizes how hard it really is to run one or more cluster it is often too late. You are stuck with maintaining your cluster and spending your resources on operational tasks that should be taken care of by a platform team.\n   Before building an new product you should have a good understanding of the customer pain points and the problem you are solving. It is crucial to involve you customer in this phase to be sure you understand the requirements and needs.\n      Based on the pain points and your overall organizational goals, you can derive your KPIs and it is important you go through this step. Without KPIs you don’t know how well your product is performing. Take the time to think about KPIs that actually indicate how well the platform is doing and to which extent the identified pain points are reduced. The KPIs should shape your roadmap. Some KPIs for an internal Kubernetes offering could be:\n  Ideally for every pain point you identified you also have a KPI that measures to which degree this pain point is reduced or eliminated by your product.\n  Based on those pain points and your KPIs, let’s look into the high level requirements that will lead us into an alternative pattern for your organization. One important mind set beforehand: Teams using their own individual clusters shouldn’t be forced to move to a shared one. The idea should rather be to build the internal offering in a way that development teams  want to migrate to it. In order to build such a compelling offering, here are some of the high level requirements to be fulfilled:\n Easy migration: In an individual cluster, bad practices to not attract attention until something fails. In a shared cluster, best practices have to be enforced to make it work for everyone. For instance, the way you deploy your application has to be adapted in order to support auto-scaling or prevent the noisy neighbors. One of the requirements is to make the migration easy for development teams by helping them applying those best practices.\n Feature parity: Development teams should get at least the set of features they currently get with their individual clusters. Additionally, it should be transparent to the application whether it is running in an exclusive or a shared cluster. All features, such as availability of cloud provider regions or service discovery should be available to the customers from the beginning.\n Operational solidity: The main reason for most of the teams to move to a centrally managed cluster is the operational pain that comes with Kubernetes. So the platform team has to do great job of keeping as many operational tasks as possible away from the development team. This includes fail-over to other regions and the ability to quickly spin up new clusters.\n Isolation and noisy neighbors problem: The biggest concern of most development teams in a shared model is “I don’t want to deal with down times because other teams screw up”. We have to make sure we leverage Kubernetes concepts and additional tools to prevent one team from disturbing another one on the same cluster.\n Monitoring and telemetry: It is key to gain trust through telemetry and to be able to answer questions based on actual data. For KPIs such as cost reduction and availability, the platform has to generate automated reports.\n The following sections will look into some of the topics you have to spend time on in order to fulfill the identified requirements.\n  Kubernetes provides multiple features that enable multi-tenancy and isolation. The goal should be to provide the least number of privileges, scoped to the resources each of your team needs. Some of the feature that should be well understood and implemented are:\n  Make sure the platform team enforces them and development team take them into account went deploying their applications. This means a development team needs a good understanding of its resource requirements and has to be able to work without admin access on the cluster. Providing detailed documentation and deployment examples is a great help for your development teams.\n   When running multi-tenant workloads, the only level of isolation that you can trust for true security is the hypervisor. This means that the security domain for Kubernetes becomes the entire cluster. Therefore, it is recommended to physically separate e.g. your NONPROD and PROD environment.\n  If you have to serve all major markets with your platform and aim to physically isolate the PROD from NONPROD cluster, the setup will probably look something like this:\n  As disaster recovery plan as well as to enable teams with high availability requirements, two availability regions are provided (region #1, region #2). Those are paired regions of your cloud provider so that a data center failure does not affect both of them.\n This setup provides a huge advantage in comparison to individual clusters. A development teams would have to run at least 6 clusters to achieve the same quality of services (disaster recovery or high availability) on a platform level.\n  In order to migrate an application from an individual cluster to a shared cluster, you need feature parity on the cluster-level but also compliance with some of the required policies in a shared model. To check a team’s deployment before moving to the shared cluster, it may be worth to automate violation checks via policies, such as missing resource definitions and deployments to the default namespace. One option here would be the Open Policy Agent:\n  For the cluster autoscaler to function effectively, you have to define your resources (request/limit). This is why in a shared cluster you have to mandate resource definitions to be configured by every team.\n Automate the migration as much as possible. Ideally, provide a self-service experience where development teams can provide information such as the namespace name, resource quotas and RBAC groups. Especially for production traffic, tool support for canary deployments is a must have.\n It may be a good idea to restrict the kind of applications you migrate to your platform in the beginning. You could only allow stateless applications or application with low traffic. Also, this may be a good time to question the team’s decision to even go for Kubernetes. Instead of blindly on-boarding teams to your offering, you may want to propose different solutions for their problem.\n    The objective here is to monitor the health of the entire cluster. We are interested in health status of nodes in the cluster and at what capacity, how many applications are running on each node, and the resource utilization of the entire cluster.\n  Here you start stepping into the territory of your customers. If there are system or platform pods those have to be monitored by the platform team. If you expect your development to be responsible for what is happening in their namespace, they need to look into this kind of monitoring.\n  Insights about resource metrics are crucial for Kubernetes in production. Typically, Kubernetes errors in production are caused by insufficient CPU or memory resources. Incidents like that can be avoided by having a visibility into resource usage in real-time. The  USE method is an approach for analyzing the performance of any system. Resource metrics are also important for cost insights and cost control as outlined in the Cost Management section below. A great post about monitoring resource metrics can be found here:\n   The de-facto standard for open source tools when it comes to monitoring Kubernetes is Prometheus &amp; Grafana. If your organization is used to ELK, this is also a valid option. If you have the head count and experience to manage an open source solution, the recommendation from our experience would be Prometheus &amp; Grafana.\n  There are several SaaS solution that you should definitely look into if your organization can afford it, one example is DataDog:\n  The monitoring tools should provide you the required insights to cover the topics mentioned above as well as to validate your SLOs and KPIs.\n  If one of your KPIs is reducing cost on an organizational level, it is crucial to track spending per team before and after the migration. This assumes the team’s application load does not change significantly in the time frame of measurement. Even if cost is not part of your KPIs, you may want to establish a charge back model or track cost for management reporting.\n  In both cases, you need the capability to assign costs to the team that caused it. Those feature does not come out of the box with Kubernetes or with any major cloud provider’s Kubernetes offering. Luckily there are a few options for you:\n   Kubecost models give teams visibility into current and historical Kubernetes spend and resource allocation. These models provide cost transparency in Kubernetes environments that support multiple applications, teams, departments, etc.\n   Kubernetes cost accounting, allocation and chargeback is one of the first operational problems production Kubernetes implementations run into. Accurately allocating Kubernetes costs is not only a management requirement but also a first step towards optimizing your Kubernetes costs.\n Besides resource costs, logging can become a significant cost factor. Your platform team should not be charged for the logs generated by your customers, keep that in mind when designing your solution.\n  When starting to offer a Kubernetes platform things will fail. It won’t go smooth from the beginning and your platform team will learn its lessons the same way as the development teams. Try to get experience with production traffic as soon as possible as this is the only way to really learn it. Start with a small, special purpose cluster instead of architecting the one single cluster that satisfies all workload requirements.\n  Your customers have to know where your responsibility ends and where their responsibility starts. To prevent any surprises for your customers, draw that line and make it very explicit in your documentation.\n  Make sure every outage is analyzed and covered in a run book to prevent it from happening again. Run book should be written in a way that anyone in the team that is on-call knows what to do even if it is the middle of the night.\n  Kubernetes is a fast moving technology and there a multiple version upgrades per year. You need to clearly document the process and communicate it to your customers. Another decision you have to make in this context is in-place upgrades vs. new clusters. In-place upgrades  should work and usually are the least intrusive approach for your customers. If you want to give customers an opportunity to move to a new version at their own pace, a separate cluster with the new version is a good idea.\n  There are multiple case studies and failure stories out there that you should check out, one example:\n   As mentioned above, it is important to gain trust through monitoring. A live status page for all your cluster is helpful to communicate possible outages. Make sure you determine your SLIs and monitor any SLO violations. Even if you may not want to commit to SLAs from the very beginning, it is definitely something you should aim to do at some point.\n   Uptime for Google Kubernetes Engine is nevertheless highly important to Google, and Google has an internal goal to keep the monthly uptime percentage at 99.5% for the Kubernetes API server for zonal clusters and 99.95% for regional clusters regardless of the applicability of a financially-backed service level agreement.  https://cloud.google.com/kubernetes-engine/sla\n  As a free service, AKS does not offer a financially-backed service level agreement. We will strive to attain at least 99.5% availability for the Kubernetes API server. The availability of the agent nodes in your cluster is covered by the Virtual Machines SLA. Please see the Virtual Machine SLAs for more details.  https://azure.microsoft.com/en-us/support/legal/sla/kubernetes-service/v1_0/\n GKE introduced SLAs as enhanced option and AKS provides the Uptime SLA option at least in some regions. So fortunately this is changing and based on the SLAs provided by the underlying cloud provider, you can build the SLAs for your platform.\n  Make sure you involve your customers from the beginning. That is, from the brain storming phase, to the requirement gathering phase, to the conceptual phase, to the implementation phase and especially for the migration to your platform. This is mutual beneficial as you get valuable feedback to improve your offering.\n   Learning and knowledge sharing is an important part of building a developer community around your platform offering. This is the only way to scale without the platform team being involved in every developer question. The more time and money you can invest in learning the better. As a minimum you should have a frequently updated FAQ section and troubleshooting page, ideally a knowledge management solution such as Stackoverflow Enterprise:\n   I hope I could create some awareness for all the topics you have to take into consideration when introducing an internal Kubernetes offering. Following you can find some interesting further reading. I would love to hear your feedback and learn more about your experience with providing a similar offering:  https://twitter.com/l4mp1.", "posttime": "2020-06-06 04:59:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "kubernetes,internal,团队", "title": "启动内部Kubernetes产品", "title_en": "Starting an Internal Kubernetes Offering", "transed": 1, "url": "https://medium.com/swlh/starting-an-internal-kubernetes-offering-a1cd3bed2e0", "via": "", "real_tags": ["internal", "团队"]}, {"category": "", "categoryclass": "", "imagename": "4d70d1cff37a70d7b04c53ad9dd24712.jpg", "infoid": 1005346, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欧盟气候监测网周五表示，上个月西伯利亚的气温比平均水平高出10摄氏度，西伯利亚是地球大部分永久冻土的所在地，全球经历了有记录以来最热的5月。哥白尼气候变化局(C3S)报道，西伯利亚大片地区连续几个月异常温暖。\nC3S资深科学家Freja Vamborg告诉法新社说，真正大的异常始于1月份，从那时起，这个信号就一直很持续，C3S高级科学家弗雷娅·范伯格(Freja Vamborg)告诉法新社(AFP)。\nC3S在一份声明中说，鄂毕河和叶尼塞河部分地区的气温比1981年至2010年的平均水平高出近10摄氏度，这两条河的冰出现了创纪录的提前破裂。\n上周，北极城市诺里尔斯克附近约800公里(500英里)的一个水库坍塌，导致2.1万吨柴油污染一条河流，俄罗斯官员认为这与永冻土融化有关。\n新数据显示，在全球范围内，截至2020年5月的12个月，地球平均表面比工业化前的水平高出1.3摄氏度，而工业化前的水平通常是衡量全球变暖的基准。\n根据2015年“巴黎协定”，近200个国家承诺将地球上升幅度控制在远低于2摄氏度，如果可能的话，控制在1.5摄氏度。\n席卷西伯利亚和阿拉斯加部分地区的热浪将在去年因创纪录的高温而被森林大火吞没的地区引起特别的警觉，哥白尼警告称，地下酝酿的僵尸大火可能会重新点燃。\n在全球范围内，5月份比1981年至2010年的平均5月份高出0.63摄氏度，阿拉斯加、欧洲、北美、南美、非洲和南极洲的部分地区的气温高于平均温度。\n欧洲的一些地区-从巴尔干半岛到斯堪的纳维亚半岛-5月份的气温低于平均气温，澳大利亚、南亚和美国东部也是如此。\n总体而言，自19世纪中期以来，全球气温已经上升了1摄氏度以上，这主要是由燃烧化石燃料推动的。\n过去五年是有记录以来最热的一年，过去十年也是如此。\n在整个北极，自19世纪中期以来，平均气温上升了两摄氏度以上，是全球平均气温的两倍。\n曾经坚固的永久冻土-横跨西伯利亚、阿拉斯加和加拿大北部-的软化已经颠覆了土著社区，并威胁到工业基础设施，特别是在俄罗斯。\n联合国气候科学小组--政府间气候变化专门委员会(IPCC)在去年一份关于全球冰冻圈或冻区的里程碑式的报告中表示，预计本世纪将出现大范围的永久冻土融化。\n北极的大部分基础设施位于预计到本世纪中叶将加剧永久冻土融化的地区。\n北极变暖也加速了格陵兰岛几公里厚的冰盖的融化，导致全年净损失6000亿吨冰块-约占2019年海平面总上升的40%。\n俄罗斯和加拿大森林的永久冻土含有多达1.5万亿吨的二氧化碳-大约是目前年排放量的40倍。\n联合国去年表示，未来十年，人为温室气体排放量需要每年下降7.6%，才能将上限控制在1.5摄氏度。\n目前的减排承诺使地球在本世纪末走上了变暖几度的道路。引用：有记录以来最热的5月，西伯利亚10摄氏度更热(2020年6月5日)从https://phys.org/news/2020-06-warmest-siberia-10c-hotter.html检索到2020年6月5日。\n本文档受版权保护。除为私人学习或研究的目的而进行的任何公平交易外，未经书面许可不得复制任何部分。提供的内容仅供参考。", "note_en": "Temperatures soared 10 degrees Celsius above average last month in Siberia, home to much of Earth&#39;s permafrost, as the world experienced its warmest May on record, the European Union&#39;s climate monitoring network said Friday.    Large swathes of Siberia have been unusually warm for several months running, the Copernicus Climate Change Service (C3S) reported.\n  &#34;The really large anomalies started during January, and since then this signal has been quite persistent,&#34; C3S senior scientist Freja Vamborg told AFP.\n  Temperatures reached close to 10C above the 1981-to-2010 average over parts of the Ob and Yenisei rivers, which have seen record-early break-up of ice, C3S said in a statement.\n  The collapse of a reservoir some 800 kilometres (500 miles) further north last week—leading to 21,000 tonnes of diesel fuel polluting a river near the Arctic city of Norilsk—has been linked by Russian officials to melting permafrost.\n  Globally, Earth&#39;s average surface   for the 12 months to May 2020 is close to 1.3C above preindustrial levels, the benchmark by which global warming is often measured, according to the new data.\n  Under the 2015 Paris Agreement, nearly 200 countries have pledged to cap the rise in Earth   to &#34;well below&#34; 2C, and to 1.5C if possible.\n  The heatwave across parts of Siberia and Alaska will cause particular alarm in regions that were engulfed by huge forest fires last year fuelled by record heat, and where Copernicus has warned that &#34;zombie&#34; blazes smouldering underground may be reigniting.\n  Globally, May was 0.63C warmer than the average May from 1981 to 2010, with above average temperatures across parts of Alaska, Europe, North America, South America, Africa and Antarctica.\n     Some regions in Europe—from the Balkans to Scandinavia—saw cooler than average temperatures in May, as did Australia, southern Asia and the eastern United States.\n  Overall, global temperatures have risen more than one degree Celsius since mid-19th century levels, driven mostly by burning fossil fuels.\n  The last five years have been the hottest on record, as has been the last decade.\n    In the Arctic as a whole, average temperatures have risen by more than two degrees Celsius since the mid-19th century, twice the global average.\n  The softening of once solid permafrost—which stretches across Siberia, Alaska and northern Canada—has upended indigenous communities and threatens industrial infrastructure, especially in Russia.\n  &#34;Widespread permafrost thaw is projected for this century,&#34; the UN&#39;s climate science panel, the IPCC, said in a landmark report last year on the world&#39;s cryosphere, or frozen zones.\n  &#34;The majority of Arctic infrastructure is located in regions where permafrost thaw is projected to intensify by mid-century.&#34;\n  A warming Arctic has also accelerated melting of Greenland&#39;s kilometres-thick ice sheet, resulting in a net loss of 600 billion tonnes of ice mass for the year—accounting for about 40 percent of total sea level rise in 2019.\n  The permafrost in Russian and Canadian forests contains as much as 1.5 trillion tonnes of carbon dioxide—around 40 times current annual emissions.\n  The United Nations said last year that manmade greenhouse gas emissions needed to tumble 7.6 percent annually over the next decade to cap   at 1.5C.\n  Current pledges to cut emissions put Earth on a path of several degrees warming by the end of the century.           Citation: Warmest May on record, Siberia 10C hotter (2020, June 5) retrieved 5 June 2020 from https://phys.org/news/2020-06-warmest-siberia-10c-hotter.html\n  This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.", "posttime": "2020-06-06 04:59:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "记录,record,全球", "title": "有记录以来最热的5月，西伯利亚更热10摄氏度", "title_en": "Warmest May on record, Siberia 10C hotter", "transed": 1, "url": "https://phys.org/news/2020-06-warmest-siberia-10c-hotter.html", "via": "", "real_tags": ["记录", "record", "全球"]}, {"category": "", "categoryclass": "", "imagename": "e4b58701ea238f43b183e2ba47cb626d.jpg", "infoid": 1005345, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "唐纳德·特朗普总统发布了一项新的行政命令，允许联邦机构绕过一些环境法的要求。总统说这是关于振兴经济，但环保人士不同意。\nMarketplace新闻的南希·马索尔·根泽将带来详细报道。以下是她与“市场早报”主持人大卫·布兰卡西奥(David Brancaccio)的谈话，经过编辑后的文字记录。\n南希·马歇尔·根泽：总统说，我们需要加快对大型基础设施项目的环境审查，比如矿山、高速公路和管道。他说，环境审查是“濒危物种法”等法律的一部分，这些审查正在减缓这些项目的进度。\n马歇尔-根泽：他们说，这些环境评估很重要，因为它们给了那些会受到影响的人，比如穿过他们社区或靠近他们社区的新管道的影响，有机会在项目中拥有发言权。我们采访了布鲁金斯学会(Brookings Institution)研究员萨曼莎·格罗斯(Samantha Gross)，她谈到了这个问题：\n“研究表明，COVID-19对接触过环境污染物的人来说更难接受。因此，作为对此的回应，我们将撤销一项可能保护人们免受更严重污染的法律？“。\n马歇尔-根泽：不，不会那么容易。格罗斯表示，毫无疑问，这项行政命令将在法庭上受到挑战。她说，环保组织将提起诉讼，要求搁置该法案，以阻止其生效。\n现在允许哪些企业重新开业？哪些企业实际上在这么做呢？\n随着各州开始重新开业，陷入灰色地带的企业想知道什么时候才能重新开业。在许多地方，沙龙仍然关门。酒吧也大多关闭，尽管根据州政府的不同，餐馆可能会被允许增加门店。全国独立企业联合会(National Federation Of Independent Business)的伊丽莎白·米利托(Elizabeth Milito)表示：“这几乎是无处不在的。”\n无论是在美国还是在国际上，今年夏天都不可能成为正常的度假季节。但这并不意味着旅行是不可能的。人们只需要在这件事上变得聪明就行了。这可能意味着离家更近的度假，特别是在汽油价格如此之低的情况下。今年夏天，航空旅行将成为可能，尽管这是一种与往常截然不同的体验。\n国会通过并于3月份由唐纳德·特朗普总统签署的CARE法案授权额外的失业救济金，增加金额，并扩大谁有资格。增加的失业救济金有一个到期日-该法案授权的每周额外600美元将于7月31日结束。\n作为一家非营利性新闻机构，我们的未来取决于像您这样相信公共服务新闻力量的听众。\n您对Marketplace的投资帮助我们保持无付费墙，并确保每个人都可以获得值得信赖、不偏不倚的新闻和信息，无论他们的支付能力如何。\n今天就捐吧--不管多少钱--成为一名市场投资者。现在，你的承诺比以往任何时候都更重要。", "note_en": "President Donald Trump has  issued a new executive order allowing federal agencies to bypass requirements from some environmental laws. The president says this about energizing the economy, but environmentalists disagree.\n Marketplace’s Nancy Marhsall Genzer has the details. The following is an edited transcript of her conversation with “Marketplace Morning Report” host David Brancaccio.\n Nancy Marshall-Genzer: The president says we need to speed up environmental reviews for big infrastructure projects — things like mines, highways and pipelines. He says environmental reviews that are part of laws like the Endangered Species Act are slowing down those projects.\n   Marshall-Genzer: They say these environmental reviews are important because they give people who would be affected by, say a new pipeline going through or near their community, a chance to have a say in the project. We spoke with Samantha Gross, a fellow at the Brookings Institution, about this:\n “Studies have shown that COVID-19 is harder on people who’ve been exposed to environmental pollutants. So, in response to this, we’re going to roll back a law that potentially protects people from greater pollution?”\n  Marshall-Genzer: No – it won’t be that easy. Gross says there’s no question that this executive order will be challenged in court. She says environmental groups will bring lawsuits to put a stay on it, to prevent it from going into effect.\n   Which businesses are allowed to reopen right now? And which businesses are actually doing so?\n As a patchwork of states start to reopen, businesses that fall into a gray area are wondering when they can reopen. In many places, salons  are still shuttered. Bars are mostly closed, too, although restaurants may be allowed to ramp up, depending on the state. “It’s kind of all over the place,” said Elizabeth Milito of the National Federation of Independent Business.\n  There’s no chance that this summer will be a normal season for vacations either in the U.S. or internationally. But that doesn’t mean a trip will be impossible. People will just have to  be smart about it. That could mean vacations closer to home, especially with  gas prices so low. Air travel will be possible this summer,  even if it is a very different experience than usual.\n  The CARES Act, passed by Congress and  signed by President Donald Trump in March, authorized extra unemployment payments, increasing the amount of money, and broadening who qualifies. The increased unemployment benefits  have an expiration date — an extra $600 per week the act authorized ends on July 31.\n  As a nonprofit news organization, our future depends on listeners like you who believe in the power of public service journalism.\n Your investment in Marketplace helps us remain paywall-free and ensures everyone has access to trustworthy, unbiased news and information, regardless of their ability to pay.\n Donate today — in any amount — to become a Marketplace Investor. Now more than ever, your commitment makes a difference.", "posttime": "2020-06-06 04:59:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "允许,order,新闻", "title": "新的行政命令允许联邦机构绕过环境法", "title_en": "New executive order allows federal agencies to bypass environmental laws", "transed": 1, "url": "https://www.marketplace.org/2020/06/05/trump-executive-order-environmental-laws-covid-19-economy/", "via": "", "real_tags": ["允许", "order", "新闻"]}, {"category": "", "categoryclass": "", "imagename": "d81b494ad50a58f6803e68d50e0be3dc.png", "infoid": 1005344, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "葡萄酒开发版本5.10现已发布。此版本中的新功能(详情见下文)：-WineD3D Vulkan后端的更多进展。-开始为NTDLL创建单独的Unix库。-更好地支持反作弊内核驱动。-DirectWrite中有更多字形替换。-支持DSS私钥。-ARM64异常处理修复。-各种错误修复。源代码可从以下位置获得：适用于各种发行版的https://dl.winehq.org/wine/source/5.x/wine-5.10.tar.xz http://mirrors.ibiblio.org/wine/source/5.x/wine-5.10.tar.xzBinary软件包将从以下位置获得：https://www.winehq.org/downloadYou将找到有关https://www.winehq.org/documentationYou的文档，也可以直接从Gitpository获取当前源代码。详情请查看https://www.winehq.org/git。多亏了许多人的努力，才能买到葡萄酒。参见发行版中的文件作者，了解5.10中修复的完整list.--Bugs(共47个)：7102Microsoft word6.0for Windows：复制/粘贴导致未实现的函数ole2.dll16.OLEISCURRENTCLIPBOARD 26171 BVRP Classic Phone Tools Installer报告错误&#39；缓冲区不足&#39；尝试安装打印处理器时(添加打印处理器存根应与添加打印处理器W对称)26489 GetKeyState无法与切换键(VK_CAPITAL、VK_NumLock、VK_SCROLL)一起正常工作32483 Windows系统内部工具由于缺少视频设备类&#39；{4D36E968-E325-11CE-BFC1-08002BE10318}&#39；的注册表数据而无法检索视频驱动程序描述。33194使用MSVCR110.dll移植到WINRT/ARM的多个应用程序需要msvcrt。__C_SPECIFICAL_HANDLER 34842当后期绑定的Riched20.dll&20.dll&39；预链接地址已被占用，并且PE映射到&gt；2GiB地址范围(Garmin Basecamp 4.1.2，GZdoom Builder2.3)时，38020 Foxit Reader6.12在未实现的函数msasn1.dll.ASN1_上崩溃。s vcredist_arm.exe在riched20：：isurlnetic()44432 AArch64：使用qemu_aarch64Ubuntu16.04 44925的alloc_page_vprot中断言失败44925多个内核驱动程序需要&#39；ntoskrnl.exe.ExCreateCallback&#39；存根来返回STATUS_SUCCESS(StarForce v3，Trackmania Nations ESWC。Denuvo Anti-cheat)45536 Total Commander 9.x在未通过命名导出检测到Wine时，在未实现的函数usp10.dll.ScriptGetFontAlternateGlyphs上崩溃49045不支持46788 RtlIpv6AddressToStringA 49045名为Koikatsu的日语eroge在升级到Wine5.7后崩溃49117当分配大量视图时，虚拟内存分配会变慢(我们高兴的很少。存根未初始化输出参数49179 winetest.exe无法在Windows ARM上运行(Surface RT/ARMv7)：在动态链接库C：\\Users\\User\\Desktop\\winetest.exe中找不到过程入口点NtCurrentTeb 49189 Auslogics注册表清理程序8.x崩溃并显示&#34；OLE错误80004001&#34；(SetCurrentProcessExplicAppUserModelID存根需要返回S_OK)49194 Denuvo。存根驱动程序(Winsock内核套接字API/wsk)49198 Denuvo Anti-cheat&#39；denuvo-anti-cheat.sys&39；在入口点崩溃(在重新定位处理期间恢复了不正确的页面保护)49208葡萄酒无法加载Explorer.exe或wineboot.exe，状态为c0000018(kernelbase.dll映射超过4MiB并加载在主可执行地址空间中)49211多个游戏和应用程序由于传递到的设备通知句柄为空而崩溃。denuvo-anti-cheat.sys&#39；在未实现的函数ntoskrnl.exe.KdRefresh DebuggerNotPresent 49217上，denuvo-anti-cheat.sys&#崩溃在未实现的函数ntoskrnl.exe.KeQueryActiveProcessorCountEx 49219 Denuvo-Anti-cheat.sys&#上崩溃，ntoskrnl.exe.KdRefresh DebuggerNotPresent 49217 denuvo Anti-cheat.sys&#在未实现的函数ntoskrnl.exe.KeQueryActiveProcessorCountEx 49219 Denuvo Anti-cheat.sys&#上崩溃。denuvo-anti-cheat.sys&#39；在未实现的函数ntoskrnl.exe.KeRevertToUserAffinityThreadEx 49224上的未实现函数ntoskrnl.exe.KeRevertToUserAffinityThreadEx 49224 Denuvo-Anti-cheat.sys&#39；在未实现的函数ntoskrnl.exe上崩溃。{KeGenericCallDpc，KeSignalCallDpcSynchronize，KeignalCallDpcDpcDone}49228", "note_en": "The Wine development release 5.10 is now available.What&#39;s new in this release (see below for details): - More progress on the WineD3D Vulkan backend. - Beginnings of a separate Unix library for NTDLL. - Better support for anti-cheat kernel drivers. - More glyph substitutions in DirectWrite. - Support for DSS private keys. - ARM64 exception handling fixes. - Various bug fixes.The source is available from the following locations:  https://dl.winehq.org/wine/source/5.x/wine-5.10.tar.xz  http://mirrors.ibiblio.org/wine/source/5.x/wine-5.10.tar.xzBinary packages for various distributions will be available from:  https://www.winehq.org/downloadYou will find documentation on  https://www.winehq.org/documentationYou can also get the current source directly from the gitrepository. Check  https://www.winehq.org/git for details.Wine is available thanks to the work of many people. See the file AUTHORS in the distribution for the complete list.----------------------------------------------------------------Bugs fixed in 5.10 (total 47):  7102 Microsoft Word 6.0 for Windows: copy/paste causes crash on unimplemented function ole2.dll16.OLEISCURRENTCLIPBOARD  26171 BVRP classic phone tools installer reports error &#39;Insufficient buffer&#39; when trying to install print processor (AddPrintProcessorA stub should be symmetric to AddPrintProcessorW)  26489 GetKeyState does not work correctly with toggle keys (VK_CAPITAL, VK_NUMLOCK, VK_SCROLL)  32483 Windows Sysinternals &#39;PsInfo&#39; tool fails to retrieve video driver description due to missing registry data for &#39;Video&#39; device class &#39;{4D36E968-E325-11CE-BFC1-08002BE10318}&#39;  33194 Multiple applications ported to WinRT/ARM using MSVCR110.dll require msvcrt.__C_specific_handler  34842 Multiple .NET 3.5 apps occasionally fail to run when late-bound &#39;riched20.dll&#39; prelink address is already occupied and PE mapped into &gt;2 GiB address range (Garmin BaseCamp 4.1.2, GZDoom Builder 2.3)  38020 Foxit Reader 6.12 crashes on unimplemented function msasn1.dll.ASN1_CreateModule during validation of digital signatures  38587 RF:G is Incredibly Laggy, Then Crashes  44115 vcrun2012&#39;s vcredist_arm.exe crashes in riched20::isurlneutral()  44432 AArch64: assertion fail in alloc_pages_vprot with qemu_aarch64 Ubuntu 16.04  44925 Multiple kernel drivers require &#39;ntoskrnl.exe.ExCreateCallback&#39; stub to return STATUS_SUCCESS (StarForce v3, TrackMania Nations ESWC. Denuvo Anti-Cheat)  45536 Total Commander 9.x crashes on unimplemented function usp10.dll.ScriptGetFontAlternateGlyphs when Wine is not detected via named export &#39;ntdll.wine_get_version&#39;  46788 RtlIpv6AddressToStringA is not supported  49045 Japanese eroge called Koikatsu crashes after upgrading to Wine 5.7  49117 Virtual memory allocation gets slower when large number of views are allocated (We Happy Few)  49160 Unity: SystemInfo.deviceUniqueIdentifier always the same under Wine  49178 Spitfire Audio 3.x crashes on start due to &#39;WTSQuerySessionInformationA&#39; stub not initializing out parameters  49179 winetest.exe fails to run on windows arm (surface rt / armv7): procedure entry point NtCurrentTeb could not be located in the dynamic link library C:\\Users\\User\\Desktop\\winetest.exe  49189 Auslogics Registry Cleaner 8.x crashes and shows &#34;OLE error 80004001&#34; (SetCurrentProcessExplicitAppUserModelID stub needs to return S_OK)  49194 Denuvo Anti-Cheat &#39;denuvo-anti-cheat.sys&#39; fails to load, needs &#39;netio.sys&#39; stub driver (Winsock Kernel Sockets API / WSK)  49198 Denuvo Anti-Cheat &#39;denuvo-anti-cheat.sys&#39; crashes in entry point (incorrect page protection restored during relocation processing)  49208 Wine fails to load explorer.exe or wineboot.exe with status c0000018 (kernelbase.dll mapping exceeds 4 MiB and is loaded in main executable address space)  49211 Multiple games and applications crash due to NULL device notification handle passed to &#39;user32.UnregisterDeviceNotification&#39; (BandLab Cakewalk 2020.04, Glorious Model O control software)  49216 Denuvo Anti-Cheat &#39;denuvo-anti-cheat.sys&#39; crashes on unimplemented function ntoskrnl.exe.KdRefreshDebuggerNotPresent  49217 Denuvo Anti-Cheat &#39;denuvo-anti-cheat.sys&#39; crashes on unimplemented function ntoskrnl.exe.KeQueryActiveProcessorCountEx  49219 Denuvo Anti-Cheat &#39;denuvo-anti-cheat.sys&#39; crashes on unimplemented function ntoskrnl.exe.KeSetSystemAffinityThreadEx  49221 Denuvo Anti-Cheat &#39;denuvo-anti-cheat.sys&#39; crashes due to unhandled emulation of MSR register reads related to CPU / virtualization features (returning zero value is sufficient)  49222 Denuvo Anti-Cheat &#39;denuvo-anti-cheat.sys&#39; crashes on unimplemented function ntoskrnl.exe.KeRevertToUserAffinityThreadEx  49224 Denuvo Anti-Cheat &#39;denuvo-anti-cheat.sys&#39; crashes on unimplemented function ntoskrnl.exe.{KeGenericCallDpc,KeSignalCallDpcSynchronize,KeSignalCallDpcDone}  49228 Mouse movements are reversed/erratic for multiple games (Gothic 2, The Elder Scrolls V: Skyrim SE; Oblivion, Machinarium)  49230 Multiple kernel drivers crash on unimplemented function ntoskrnl.exe.KeSetTimer (Denuvo Anti-Cheat &#39;denuvo-anti-cheat.sys&#39;)  49235 Multiple .NET 4.x applications crash with stack overflow in IDWriteTextAnalyzer::GetGdiCompatibleGlyphPlacements (Microsoft Visual Studio 2010 Express, Win10 SDK installer)  49251 Mouse cursor leaves a trail when anti-aliasing enabled (Secret Files 1-2, Fahrenheit, Ufo:Extraterrestrials)  49257 Avast Free Antivirus 20.3 crashes before installing due to unimplemented function rpcrt4.dll.RpcIfInqId  49262 Heap debugging (WINEDEBUG=+heap) broken since wine-5.7-30-gba1495f7c2  49264 MultiSync installation crashes (needs _Command::get/put_CommandText)  49267 Denuvo Anti-Cheat &#39;denuvo-anti-cheat.sys&#39; needs support for CustomTimerDpc via ntoskrnl.exe.KeSetTimer{Ex}  49272 MultiSync installation crashes (msado15.dll needs {b196b284-bab4-101a-b69c-00aa00341d07} IConnectionPointContainer)  49281 FinanceExplorer crashes inside msado15.dll  49283 Some win10 run into : err:module:import_dll Library api-ms-win-core-libraryloader-l2-1-0.dll not found  49289 Denuvo Anti-Cheat &#39;denuvo-anti-cheat.sys&#39; crashes on unimplemented function ntoskrnl.exe.ExRegisterCallback  49291 Denuvo Anti-Cheat &#39;denuvo-anti-cheat.sys&#39; crashes on unimplemented function ntoskrnl.exe.ExUnregisterCallback when unloading  49295 Prefix creation freezes  49299 PowerToys for Windows 10 crashes on unimplemented function KERNEL32.dll.GetPackageFamilyName  49300 Multiple debuggers/tools from Windows 10 SDK want api-ms-win-downlevel-kernel32-l2-1-0.dll  49303 MultiSync installation crashes (msado15.dll needs IConnectionPointContainer::FindConnectionPoint)  49305 Sniper Elite V2 (Sniper Elite 3, Zombie Army Trilogy) fails to start on Steam----------------------------------------------------------------Changes since  5.9:Aaro Altonen (5): msado15: Implement _Command get/put CommandType. msado15: Implement _Command get/put CommandText. msado15: Add IConnectionPointContainer stub to _Connection. msado15: Add IConnectionPoint stub to _Connection. msado15: Implement IConnectionPointContainer_FindConnectionPoint.Akihiro Sagawa (2): gdi32: Handle vertical faces in the fontconfig fallback. gdi32: Add a vertical font replacement if it&#39;s a DBCS font.Alex Henrie (12): ntdll: Increase size of IPv6 address string buffers. include: Add RtlIpv4AddressToString(Ex)[AW]. include: Add more RTL functions. ntdll/tests: Drop RTL function workarounds for Windows &lt;= 2000. ntdll/tests: Add more RtlIpv6AddressToString tests. ntdll: Implement RtlIpv6AddressToString(Ex)[AW]. ws2_32: Reimplement inet_ntop on top of ntdll functions. ws2_32/tests: Put WSAAddressToString tests in tables. ntdll/tests: Make RtlIpv6AddressToString test data static and constant. kernelbase: Add GetPackageFamilyName stub. kernel32/tests: Fix GetNLSVersion test failure on Windows Server 2003. quartz/tests: Fix overflow in 32-bit time calculation.Alexandre Julliard (48): server: Update shared user data timestamps on every request. kernel32: Leave some more space for kernelbase. kernel32: Use set_ntstatus() in more places. ntdll: Implement ProcessImageInformation class in NtQueryInformationProcess(). kernel32: Reimplement GetProcessVersion() in kernelbase. kernel32: Reimplement DosDateTimeToFileTime/FileTimeToDosDateTime using ntdll functions. kernel32: Remove actctx.c. kernel32: Remove cpu.c. kernel32: Remove environ.c. kernel32: Remove time.c. kernel32: Remove string.c. ntdll: Fix off-by-one buffer size error. ntdll: Don&#39;t call terminate_thread request if not necessary. ntdll: Create user shared data section in the server, and initialize it in wineboot. ntdll: Don&#39;t include ntdll_misc.h from the Unix library. ntdll: Move server initialization functions to the Unix library. ntdll: Move fd cache functions to the Unix library. ntdll: Move server call functions to the Unix library. ntdll: Move NtClose() and NtDuplicateObject() to the Unix library. ntdll: Add missing server_init_process_done() call. ntdll: Move the threading initialization functions to the Unix library. ntdll: Use the actual zero_bits parameter in the server requests. ntdll: Move server wait functions to the Unix library. ntdll: Properly reset the stack environment at thread exit on ARM64. ntdll: Move NtSetContextThread() implementation to the Unix library. ntdll: Move NtGetContextThread() implementation to the Unix library. ntdll: Move the virtual memory functions to the Unix library. ntdll: Use the local server_send_fd() function in the Unix library. kernel32: Move SetConsoleCtrlHandler() implementation to kernelbase. ntdll: Move the thread startup code to the Unix library. ntdll: Move the thread creation code to the Unix library. ntdll: Move more of the thread exit code to the Unix library. ntdll: Consolidate some of the init routines into the init_threading() entry point. ntdll: Move mapping of the user shared data to the Unix library. ntdll: Move some wait functions to the Unix library. ntdll: Move the semaphore functions to the Unix library. ntdll: Move the event functions to the Unix library. ntdll: Move the mutex functions to the Unix library. ntdll: Move the timer functions to the Unix library. ntdll: Move the keyed event functions to the Unix library. ntdll: Move the section object functions to the Unix library. ntdll: Move the rest of the thread creation code to the Unix library. ntdll: Implement RtlCreateUserThread() on top of NtCreateThreadEx(). ntdll: Use NtCreateThreadEx() for remote thread creation. ntdll: Move NtCreateThreadEx() to the Unix library. ntdll: Move DbgUiIssueRemoteBreakin() to the Unix library. secur32/tests: Update for new WineHQ certificate. wininet/tests: Update for new WineHQ certificate.Alistair Leslie-Hughes (1): include/ddk: Add wsk.h file.Anton Baskanov (11): amstream: Don&#39;t crash if parent is NULL in AMAudioStream:: and AMDirectDrawStream::GetMultiMediaStream. amstream: Move initialization code from audio_stream_create into AMAudioStream::Initialize and ::JoinAMMultiMediaStream. amstream: Move initialization code from ddraw_stream_create into AMDirectDrawStream::Initialize and ::JoinAMMultiMediaStream. amstream: Move initialization calls from *_stream_create into AMMultiMediaStream::AddMediaStream. amstream: Allow AMAudioStream and AMDirectDrawStream to be created by CoCreateInstance. amstream: Add tests for IAMMediaStream::Initialize and ::JoinAMMultiMediaStream. amstream: Leave critical section on error in MediaStreamFilter::EnumPins(). amstream: Implement AMAudioStream::BeginFlush() and ::EndFlush(). amstream: Implement MediaStreamFilter::SupportSeeking(). amstream: Implement MediaStreamFilter::SetPositions(). amstream: Call MediaStreamFilter::SupportSeeking() in AMMultiMediaStream::OpenFile().Arkadiusz Hiler (2): user32: Move *RegisterDeviceNotification*() to input.c. user32: Fix NULL dereference in UnregisterDeviceNotification.Aurimas Fi šeras (2): po: Update Lithuanian translation. po: Update Lithuanian translation.Austin English (1): api-ms-win-downlevel-kernel32-l2-1-0: New dll.Biswapriyo Nath (2): include: Add missing structures in dcommon.idl. include: Add include guard in d2dbasetypes.h.Brendan Shanks (4): winex11.drv: Set GPU LUID property for monitors. winex11.drv: Set output id property for monitors. winemac.drv: Set GPU LUID property for monitors. winemac.drv: Set output id property for monitors.Damjan Jovanovic (2): libwine: Fix a regression in the return value check for mmap() on FreeBSD. ntdll: Reserve the area whenever possible in reserve_area() on FreeBSD.Daniel Lehman (6): vcruntime140_1: Support unwind handler with frame. vcruntime140_1: Change pointer math in decode_uint. vcruntime140_1: Skip unwind if already at last level. vcruntime140_1: Don&#39;t terminate on state of -1. vcruntime140_1: Unwind state 0. vcruntime140_1: Don&#39;t terminate on -1 trylevel.François Gouget (1): winex11.drv: Avoid using the mailing list address in error messages.Gerald Pfeifer (1): ntdll: Include &lt;stdarg.h&gt; in unix/debug.c.Gijs Vermeulen (6): include: Add cfg.h. wuapi: Add UpdateInstaller coclass. wuapi: Fake success in IUpdateInstaller::get_IsBusy. wtsapi32: Implement WTSQuerySessionInformationA. wtsapi32: Improve WTSQuerySessionInformationW stub. winemac: Cast buffer to const WCHAR* in insert_clipboard_format.Hans Leidekker (8): mountmgr: Return the disk serial from IOCTL_STORAGE_QUERY_PROPERTY(StorageDeviceProperty). wbemprox: Get the disk drive serial number from mountmgr. bcrypt: Implement BCryptDeriveKeyCapi. bcrypt: Add support for BCRYPT_DSA_ALGORITHM. msado15: Fix NULL pointer dereference in close_recordset. bcrypt: Add support for importing and exporting DSS private keys. mountmgr: Fix buffer length check. bcrypt: Handle different sized R/S signature components.Henri Verbeet (39): wined3d: Move the swapchain logo texture blit to wined3d_cs_exec_present(). wined3d: Move the swapchain cursor texture blit to wined3d_cs_exec_present(). wined3d: Implement occlusion queries for the Vulkan adapter. wined3d: Implement timestamp queries for the Vulkan adapter. wined3d: Implement timestamp disjoint queries for the Vulkan adapter. wined3d: Implement event queries for the Vulkan adapter. wined3d: Implement pipeline statistics queries for the Vulkan adapter. wined3d: Map vkGetPhysicalDeviceFeatures2() to vkGetPhysicalDeviceFeatures2KHR(). wined3d: Also load the index buffer in wined3d_context_vk_apply_draw_state() if STATE_INDEXBUFFER was invalidated. wined3d: Use wined3d_buffer_vk_get_buffer_info() when binding the Vulkan index buffer. wined3d: Use wined3d_buffer_vk_get_buffer_info() when binding Vulkan vertex buffers. wined3d: Initialise more caps and limits in wined3d_adapter_vk_init_d3d_info(). wined3d: Map Vulkan adapter bo&#39;s persistently on 64-bit architectures. wined3d: Move swapchain buffer discarding to wined3d_cs_exec_present(). wined3d: Implement swapchains for the Vulkan adapter. wined3d: Wait for the command stream to finish before removing the context in adapter_no3d_uninit_3d(). wined3d: Create WINED3D_NO3D swapchain surfaces without GPU access. wined3d: Check for GPU access before attempting an upload blit in texture2d_blt(). wined3d: Explicitly check for WINED3D_NO3D instead of &#34;d3d_initialized&#34; in surface_convert_format(). wined3d: Set &#34;device-&gt;d3d_initialized&#34; in wined3d_device_set_implicit_swapchain(). wined3d: Get rid of the &#34;d3d_initialized&#34; check in wined3d_device_reset(). wined3d: Get rid of the &#34;d3d_initialized&#34; check in context_resource_released(). wined3d: Get rid of the &#34;d3d_initialized&#34; check in device_resource_released(). wined3d: Get rid of the &#34;d3d_initialized&#34; check in wined3d_texture_update_map_binding(). wined3d: Use &#34;depth_size&#34;/&#34;stencil_size&#34; to check for depth/stencil formats in arbfp_blit_supported(). wined3d: Use &#34;depth_size&#34;/&#34;stencil_size&#34; to check for depth/stencil formats in glsl_blitter_supported(). wined3d: Use &#34;depth_size&#34;/&#34;stencil_size&#34; to check for depth/stencil formats in ffp_blit_supported(). wined3d: Use &#34;depth_size&#34;/&#34;stencil_size&#34; to check for depth/stencil formats in wined3d_texture_blt(). wined3d: Use &#34;depth_size&#34;/&#34;stencil_size&#34; to check for depth/stencil formats in texture2d_blt(). wined3d: Use &#34;depth_size&#34;/&#34;stencil_size&#34; to check for depth/stencil formats in texture2d_depth_blt_fbo(). wined3d: Use &#34;depth_size&#34;/&#34;stencil_size&#34; to check for depth/stencil formats in fbo_blitter_blit(). wined3d: Use &#34;depth_size&#34;/&#34;stencil_size&#34; to check for depth/stencil formats in the FBO cache. wined3d: Use &#34;depth_size&#34; to check for a depth format in resolve_depth_buffer(). wined3d: Use &#34;depth_size&#34;/&#34;stencil_size&#34; to check for depth/stencil formats in query_internal_format(). wined3d: Use &#34;depth_size&#34;/&#34;stencil_size&#34; to check for depth/stencil formats in create_and_bind_fbo_attachment(). wined3d: Introduce WINED3DFMT_FLAG_DEPTH_STENCIL. wined3d: Clear WINED3DFMT_FLAG_DEPTH_STENCIL if the format is not supported as FBO attachment. wined3d: Reference the back buffer in wined3d_swapchain_vk_blit(). wined3d: Partially implement adapter_vk_clear_uav().Huw D. M. Davies (3): ntdll: Use the correct size when the read spans a page boundary. ntdll: Remove unnecessary page variable. bcrypt: Add stubs for DSS private key functions on macOS.Jacek Caban (41): rpcndr.h: Avoid error_status_t redefinition. winegcc: Store main arguments in strarray. winegcc: Add support for @file arguments. winegcc: Add support for -Wl,--whole-archive option. setjmp.h: Use __intrinsic_setjmpex when using ucrt. winnt.h: Provide inline NtCurrentTeb implementation for mingw arm builds. dmusic/tests: Introduce compare_time helper. kernel32/tests: Remove workaround for NT4. kernel32/tests: Avoid using abs on ULONGLONG values. wintab32: Fix -Wabsolute-value warning. taskmgr: Introduce size_diff helper. d3d9/tests: Use int for indexes in generate_bumpmap_textures. mshtml: Use return_nsstr_variant in HTMLTable_get_width. mshtml: Add IHTMLTableCell::height property implementation. mshtml: Add IHTMLTableCell::width property implementation. gdiplus/tests: Introduce compare_uint helper. ieframe: Return S_FALSE in IWebBrowser2::get_Document when returning NULL. gdiplus: Introduce absdiff helper. quartz/tests: Fix -Wabsolute-value warnings. jscript: Support ES5 Array.prototype.sort arguments handling. jscript: Support context argument in Array.prototype.forEach. jscript: Throw proper exception in RegExp.prototype.toString when called on non-RegExp object. mshtml/tests: Introduce sync_test helper. winmm/tests: Introduce compare_uint helper. winmm: Introduce compare_uint helper. configure: Enable -Wabsolute-value on cross compiler. jscript: Inline add_eval implementation. jscript: Don&#39;t realloc interpreter stack. jscript: Throw proper stack overflow exception. mshtml/tests: Improve tests exception handling. jscript: Add Object.keys implementation. jscript: Use wide string literals in array.c. jscript: Add Array.prototype.reduce implementation. jscript: Support passing non-string pattern to RegExp constructor. jscript: Support passing non-string flags to RegExp constructor. jscript: Add Object.preventExtensions semi-stub implementation. mshtml: Use return_nsstr_variant in IHTMLBodyElement::get_bgColor. mshtml: Use default white value in IHTMLDocument2::get_bgColor. mshtml: Add IHTMLCSSStyleDeclaration2::transform property implementation. mshtml: Add IHTMLCSSStyleDeclaration2::animationName property implementation. mshtml: Add IHTMLCSSStyleDeclaration2::transition property implementation.Ken Thomases (1): winemac: Fix a string format warning for tick counts in update_clipboard().Liam Middlebrook (1): winevulkan: Update t\n......", "posttime": "2020-06-06 04:57:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "wine,无法", "title": "WINE 5.10版本", "title_en": "Wine 5.10 Release", "transed": 1, "url": "https://www.winehq.org/announce/5.10", "via": "", "real_tags": ["wine", "无法"]}, {"category": "", "categoryclass": "", "imagename": "0ec38f4d8b50259e2934b9c6aa1f0345.jpeg", "infoid": 1005342, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司周一证实，Change.org上的一份请愿书呼吁为乔治·弗洛伊德伸张正义，目前已成为该网站签名最多的请愿书，目前已有超过1400万人签名。\n但Change.org现在正面临着强烈反对，因为它促使用户在签署请愿书后捐款-并将这些捐款回馈Change.org本身。\n这是该网站筹款模式的一部分：Change.org不会将捐赠资金传递给请愿组织者或弗洛伊德的家人等受影响的各方，而是保留这笔钱，并将其用于在自己的网站上更广泛地传播请愿活动。\n该网站在表格中用较小的字体表示了这一点，但Business Insider采访的捐赠者中没有一人表示，他们不知道捐款是如何使用的，并表示他们感觉被模糊的措辞所欺骗，这些措辞让他们相信捐款将用于支持组织者或弗洛伊德的家人-而且他们一直无法获得退款。\nChange.org的一位发言人告诉“商业内幕”(Business Insider)，该公司将请愿书募集的资金用于进一步传播请愿书，并用于Change.org网站的运营成本。据这位发言人称，乔治·弗洛伊德的请愿书出现在Change.org的广告宣传活动中，展示在全美118个数字广告牌上，并已向Change.org网站的900多万访问者推广，Facebook和Instagram上的访问者也有数百万人。\n这位发言人说，请愿筹集的资金将用于帮助竞选活动取得胜利，并帮助我们建立和维护我们的技术平台，使我们有可能为人们提供赢得他们想要看到的变化所需的工具。\n这位发言人拒绝透露Change.org从乔治·弗洛伊德请愿书的大法官那里筹集了多少资金，理由是公司政策不披露请愿书特定的收入。这位发言人补充说，捐款并想要退款的人可以通过给网站的支持团队发电子邮件提出要求，他们的目标是尽可能对退款请求做出回应。\nChange.org是一家营利性的风险支持公司，负责托管公众撰写的维权请愿书，收集签名者的电子邮件地址，并鼓励人们在社交媒体上大量传播请愿书。虽然是营利性的，Change.org是一家具有B公司地位的公益公司。它已经从包括LinkedIn创始人里德·霍夫曼在内的支持者那里筹集了7200万美元。\n人们在乔治·弗洛伊德的请愿书上签名后，Change.org敦促他们捐出3美元，把这份请愿书列入议程，成为英雄。一旦人们点击进入下一页，Change.org就会提示他们在3美元、25美元、50美元或100美元捐款之间进行选择。捐款按钮下方较小的文字表明，这笔钱将用于在Change.org自己的网站上宣传请愿书。\n一些捐赠者说，他们觉得被公司误导了。许多捐款的人告诉“商业内幕”，Change.org的免责声明不够清楚，当得知没有一笔钱会捐给抗议组织者时，他们表示怀疑。\n上周末，一条澄清Change.org捐赠模式的推特帖子被广泛转发，并获得了数百条回复，这些人说他们捐赠了，感觉自己被骗了。\n加利福尼亚州奥克兰的居民达拉·皮尔斯周五在请愿书上签名，之后她感到有动力采取更多行动。因此，当Change.org促使她捐款将这份请愿书提上议事日程时，她很快就为这项事业捐出了25美元。\n直到捐款后，她才意识到她的钱不会捐给请愿书的组织者，请愿书呼吁签名人帮助我们为乔治和他的家人伸张正义，也不会捐给弗洛伊德的家人。\n老实说，皮尔斯告诉“商业内幕”，我觉得自己有点傻。我本应该读一下细则，但我以为钱至少会捐给弗洛伊德家族或组织者。\n我看到了捐款的请求，当然想帮助这项事业，直到我捐款后，他们才提到这笔钱将用于宣传请愿书，居住在迪拜的澳大利亚公民克里斯捐赠了25美元，她告诉“商业内幕”(Business Insider)。\n截至周三，请愿书页面显示，超过850万人要么捐款，要么在社交媒体上分享请愿书，但没有提供具体的细目。根据该网站上自动滚动的捐赠者名单，至少有一名签名者捐赠了1000美元。\nChange.org的网站表示，每20美元将在Change.org上额外发布250次请愿书广告，但没有具体说明这将如何转化为印象或点击量，而大多数在线广告销售额都是以此来衡量的。相比之下，根据广告分析公司AdStage的数据，广告商在谷歌广告上的每1000次印象花费约2.80美元。\n一些人还对Change.org的捐款模式表示困惑，因为该公司以前确实举办过众筹活动，允许人们向活动组织者捐款，Change.org从每笔捐款中提取5%的分成。根据一个常见问题页面，Change.org&34；筹款工具将于2019年停止使用。", "note_en": "A  petition hosted on Change.org calling for &#34;Justice for George Floyd&#34; is now the site&#39;s most-signed petition ever, the company  confirmed on Monday, with over 14 million signatures so far.\n But Change.org is now facing backlash for prompting users to donate after they sign the petition — and funneling those donations back to Change.org itself.\n This is part of the site&#39;s fundraising model: Change.org does not pass along donated funds to petition organizers or to affected parties like Floyd&#39;s family, but rather keeps the money and uses it to &#34;circulate&#34; petitions more widely on its own site.\n The site says this in the form in smaller print, but none of the donors Business Insider spoke to said they knew that was how the donations were being used, and said they felt duped by vague wording that led them to believe the donations were going to support organizers or Floyd&#39;s family — and that they haven&#39;t been able to get refunds.\n   A Change.org spokesperson told Business Insider that the company spends the money raised from petitions to further circulate petitions, and on operating costs for Change.org&#39;s site. The George Floyd petition is being featured in a Change.org ad campaign displayed on 118 digital billboards across the US and has been promoted to more than nine million visitors to Change.org&#39;s site and millions more on Facebook and Instagram, according to the spokesperson.\n &#34;The money raised from petitions goes toward helping the campaign win and helping us build and maintain our technology platform, making it possible for us to provide people with the tools they need to win the change they want to see,&#34; the spokesperson said.\n The spokesperson declined to say how much Change.org has raised from the Justice for George Floyd petition, citing company policy against disclosing petition-specific revenue. The spokesperson added that people who donated and want refunds can request them by emailing the site&#39;s support team, who will &#34;aim to be as responsive as possible to refund requests.&#34;\n Change.org is a  for-profit, venture-backed company that hosts activist petitions written by members of the public, gathers email addresses from signees, and encourages people to circulate the petitions heavily on social media. While for-profit, Change.org is a public benefit company with B Corp status. It has  raised $72 million from backers including LinkedIn founder  Reid Hoffman.\n   After people sign the Justice for George Floyd petition, Change.org urges them to &#34;become a hero&#34; by chipping in $3 to &#34;get this petition on the agenda.&#34; Once people click through to the next page, Change.org prompts them to choose between $3, $25, $50, or $100 donations. Smaller text below the donation buttons clarify that the money will be used to advertise the petition on Change.org&#39;s own website.\n  Some donors say they felt misled by the company. Multiple people who gave money told Business Insider that Change.org&#39;s disclaimers weren&#39;t clear enough, and were incredulous to learn that none of the money would go to protest organizers.\n A  Twitter thread clarifying Change.org&#39;s donation model was shared widely over the weekend and garnered hundreds of replies from people who said they donated and felt duped.\n  Dara Pierce, a resident of Oakland, California, signed the petition Friday, after which she felt galvanized to take more action. So when Change.org prompted her to donate money &#34;to get this petition on the agenda,&#34; she quickly chipped in $25 for the cause.\n   It was only after donating that she realized her money wouldn&#39;t go to the organizers of the petition, which calls on signatories to &#34;help us get justice for George and his family,&#34; nor would it go to Floyd&#39;s family.\n &#34;I feel kind of stupid, honestly,&#34; Pierce told Business Insider. &#34;I should have read the fine print but I assumed the money would be going to the Floyds or to the organizers at least.&#34;\n  &#34;I saw the request for a donation and of course wanted to help the cause and it wasn&#39;t until after I donated that they mentioned that the money would be going towards &#39;promoting&#39; the petition,&#34; Chryss, an Australian citizen living in Dubai who donated $25, told Business Insider.\n   As of Wednesday, the petition page says that over 8.5 million people either contributed money or shared the petition on social media, without providing a specific breakdown. At least one signer gave $1,000, according to an auto-scrolling list of donors on the site.\n  Change.org&#39;s site says that &#34;every $20 will advertise the petition 250 extra times on Change.org,&#34; but doesn&#39;t specify how that might translate into impressions or clicks, the metrics by which most online ad sales are measured. By contrast, advertisers spend roughly $2.80 per 1,000 impressions on Google ads, according to the ad analytics firm  Adstage.\n Some people also voiced confusion about how Change.org&#39;s donations model because the company previously did host crowdfunding campaigns, allowing people to donate to a campaign organizer with Change.org taking a 5% cut of each donation. According to an  FAQ page, Change.org &#34;decommissioned&#34; the fundraising tool in 2019.", "posttime": "2020-06-06 04:56:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "募集,petition,请愿书", "title": "Change.org根据乔治·弗洛伊德请愿募集捐款，保留资金", "title_en": "Change.org solicits donations under George Floyd petition, keeps money", "transed": 1, "url": "https://www.businessinsider.com/change-org-george-floyd-donations-petition-keeps-money-2020-6", "via": "", "real_tags": ["募集", "petition", "请愿书"]}, {"category": "", "categoryclass": "", "imagename": "620b875635592d9f658c9a26b23c7dc0.jpg", "infoid": 1005341, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Insta继续表示，小费诱饵很少见，只有不到0.5%的订单在送货后会取消小费。它说，自从新冠肺炎疫情开始以来，购物者的小费总额翻了一番。然而，这一政策变化表明，该公司在如何对待其购物者网络方面取得了进展，这些购物者网络一直是必不可少的，因为就地避难所订单让人们和免疫力受到影响，不能去杂货店。\nInsta现在要求送货后收取小费的客户留下反馈，并声称它将停用任何持续收取小费的客户。该公司还表示，将把小费调整窗口(客户可以改变小费的时间段)从3天减少到24小时。\n理想情况下，较小的窗口将限制购物者等待最后一笔小费所需的时间。\n随着小费的变化，Insta也在更新其于2019年首次推出的即时套现功能。购物者现在可以在完成送货24小时后兑现小费，以便更快地获得资金。该公司还将在2020年7月底之前免除使用Visa卡的购物者的所有现金手续费。Instant Cashout也在扩展到加拿大。\n这一消息传出之际，Insta的购物者网络继续变得越来越不满。作为背景，该公司宣布计划将其购物者网络增长近250%，原因是大流行和避难所就地订单的需求。一些购物者说，激进的招聘火上浇油，并没有解决Insta的核心问题，比如应用程序中的漏洞、小费诱饵或缺乏安全套件分发。\n今年3月，Insta的购物者举行罢工，要求更好的待遇，包括询问Insta是否可以将默认的小费百分比改回10%。今天的政策变化不包括这一变化。默认的小费百分比是5%。\n在这段时间里，零工工人是必不可少的工人。Insta早就应该开始做出政策改变，像对待他们一样对待他们。", "note_en": "Instacart continues to say that tip-baiting is rare and that less than 0.5% of orders have tips removed after delivery. It says tip totals have doubled for shoppers since the COVID-19 pandemic began. However, the policy change shows progress on  how the company treats its shopper network, who have been essential as shelter-in-place orders keep people and the immunocompromised from going to grocery stores.\n Instacart is now requiring customers who remove tips after delivery to leave feedback, and claims it will deactivate any customer who consistently removes tips. The company also said that it is reducing the tip-adjustment window (the time period for how long a customer can change the tip) from three days to 24 hours.\n  The smaller window, ideally, would limit the amount of time that a shopper needs to wait for a final tip.\n Along with the tip changes, Instacart is updating its Instant cashout feature, first launched in 2019. Shoppers will now be able to cash out tips 24 hours after they complete a delivery for more immediate access to money. The company is also waiving all cashout fees for shoppers using Visa cards until the end of July 2020. Instant Cashout is also expanding to Canada.\n The news comes as Instacart’s shopper network continues to grow more disgruntled. For context, the company has announced plans to grow its shopper network by  nearly 250% due to demand from the pandemic and shelter-in-place orders. Some shoppers say that aggressive hiring adds fuel to the fire and doesn’t address core problems with Instacart, like bugs in the app, tip-baiting or lack of safety kit distribution.\n In March, Instacart shoppers  went on strike to demand better treatment, including asking if Instacart could change the default tip percentage back to 10%. The policy change today does not include this change. The default tip percentage is 5%.\n Gig workers are essential workers during this time. It is long overdue for Instacart to start making policy changes that treat them like it.", "posttime": "2020-06-06 04:19:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "小费,tip", "title": "Insta在接到购物者投诉后更改小费政策", "title_en": "Instacart Makes Changes To Tip Policy Following Shopper Complaints", "transed": 1, "url": "https://techcrunch.com/2020/06/05/instacart-makes-changes-to-tip-policy-following-shopper-complaints/", "via": "", "real_tags": ["小费", "tip"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005340, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们是SpaceX团队中的几名成员，他们帮助开发和部署了飞龙软件，并为我们的载人航天演示任务(又名Crew Demo-2)的触摸屏显示器提供动力。现在Bob和Doug已经在国际空间站上了，Dragon处于静止状态，我们在这里回答您关于Dragon、软件和在SpaceX工作的任何问题。\nWendy Shimata-我管理Dragon软件团队，负责Dragon的容错和安全工作。\n太平洋时间6月6日(星期六)中午12点到下午1点30分，我们将在这里回答您的问题。", "note_en": "We&#39;re a few of the SpaceX team members who helped develop and deploy software that flew Dragon and powered the touchscreen displays on our human spaceflight demonstration mission (aka Crew Demo-2). Now that Bob and Doug are on board the International Space Station and Dragon is in a quiescent state, we are here to answer any questions you might have about Dragon, software and working at SpaceX.\n  Wendy Shimata - I manage the Dragon software team and worked fault tolerance and safety on Dragon\n We&#39;ll be here answering your questions on Saturday, June 6 from 12:00 to 1:30pm PT.", "posttime": "2020-06-06 04:18:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,software,dragon", "title": "我们是SpaceX软件团队，有任何问题都可以", "title_en": "We are the SpaceX software team, ask us anything", "transed": 1, "url": "https://www.reddit.com/r/spacex/comments/gxb7j1/we_are_the_spacex_software_team_ask_us_anything/", "via": "", "real_tags": ["软件", "software", "dragon"]}, {"category": "", "categoryclass": "", "imagename": "ae610b67a009c0a615bf61ce814df3c3.jpg", "infoid": 1005339, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Open Democratic因其与私营科技公司达成的大规模NHS COVID-19数据交易而面临法庭诉讼的几个小时前，英国政府屈服于压力，公布了与亚马逊(Amazon)、微软(Microsoft)、谷歌(Google)以及有争议的人工智能公司Factional和Palantir达成的所有交易合同。\n这些合同今天向公开民主和科技司法公司Foxglove发布，披露了被描述为将数百万NHS用户的个人健康信息“史无前例”转移到这些私营科技公司的细节。\n值得注意的是，合同显示，与多米尼克·卡明斯有关联的公司“学院”为NHS提供人工智能服务的报酬超过100万英镑。文件还显示，在Foxglove根据信息自由法提出最初的透明度要求后，该交易的条款发生了变化。\n合同显示，参与NHS数据存储项目的公司，包括Factional和Palantir，最初获得了知识产权(包括创建数据库)，并被允许培训他们的模型，并从前所未有的NHS数据访问中获利。\n政府律师现在声称，随后对与学院的合同进行了(未披露的)修订，解决了这个问题，但他们没有公布进一步的合同。OpenDemocratic和Foxglove要求立即发布它。目前尚不清楚其他合同是否也被更改。\n在这些披露之前，openDemocratic和Foxglove发出了法律信件，要求对COVID数据存储交易进行透明度，就在openDemocratic定于在法庭上发布诉讼程序的前几个小时。\n在过去的几周里，议员们在议会就这些有争议的交易提出了问题，超过1.3万人加入了要求透明度的呼声。\n今天，open Democratic正在全面公布合同，以便于专家分析和支持公众辩论。\n今年3月，NHS的一个博客宣布了COVID-19数据存储项目-它说，目的是提供关于这种流行病的“单一真相来源”，以阻止其传播。\n当时，英国国家医疗服务体系强调，“必要的数据治理程序和既定的公开透明原则仍然是我们所做一切的核心”；收集到的数据“只会用于新冠肺炎”；“只会收集相关信息”。\n它还表示，“一旦公共卫生紧急情况结束，数据要么被销毁，要么按照法律和NHS与合作伙伴之间严格的合同协议归还”。\n然而，人们对这些交易的保密性以及一些参与公司的过往记录都表示担忧。\nPalantir由硅谷亿万富翁、特朗普的亲密盟友彼得·蒂尔(Peter Thiel)创立，是一家数据挖掘公司，以支持中央情报局(CIA)在伊拉克和阿富汗的反叛乱和情报行动而闻名。\n2019年，它因支持美国移民和海关执法局残酷的驱逐制度而受到批评。关于其与美国警察部队签订的广泛合同的报道显示，在获取敏感数据方面存在问题，价格随着时间的推移而上涨，以及公众对他们的“预测性警务”产品缺乏信任。\nPalantir在美国赢得的类似的COVID-Data合同价值数百万美元，然而据报道，这部电影正在运行新的NHS GB 1合同，这引发了人们对该公司将如何从这笔交易中受益的进一步猜测。\n与此同时，人工智能初创公司Factional由马克·华纳(Mark Warner)领导，他是本·华纳(Ben Warner)的兄弟，负责多米尼克·卡明斯(Dominic Cummings)领导的投票离开运动的数据操作。据报道，教师们在18个月内赢得了8份政府合同，价值近160万英镑。他们最近赢得了与住房部的一份合同，从“社交媒体、公用事业提供商和电信账单、信用评级机构”中挖掘和分析数据。\n政府还没有披露它对NHS COVID交易进行的数据保护影响评估，声称今天将在NHS网站上公布这些评估。OpenDemocratic和Foxglove在法律信件中要求政府具体说明这一重要的法律合规步骤是在授予合同之前采取的，还是在授予合同之后采取的。\n这些披露正值有关私营公司推动从冠状病毒危机中获利的辩论愈演愈烈之际。外包巨头Serco正在运行政府延迟的测试和跟踪计划，该公司泄露的电子邮件显示，首席执行官鲁珀特·索姆斯(Rupert Soames)希望这场危机能“巩固.。私营部门公司在公共部门供应链中的地位。“。\n如果你认为公共利益新闻应该在COVID危机期间和之后很长一段时间内继续要求透明度，请考虑支持Open Democratic和Foxglove。", "note_en": "Hours before facing court proceedings from openDemocracy over its  massive NHS COVID-19 data deal with private tech firms, the UK government has caved to pressure and released all the contracts governing its deals with Amazon, Microsoft, Google, and controversial AI firms Faculty and Palantir.\n The contracts, released to openDemocracy and tech justice firm Foxglove today, reveal details of what has been described as an ‘unprecedented’ transfer of personal health information of millions of NHS users to these private tech firms.\n Significantly, the contracts reveal that the  Dominic Cummings-linked firm Faculty is being paid more than £1m to provide AI services for the NHS. The documents also show that terms of that deal were changed after initial demands for transparency were made by Foxglove under the Freedom of Information Act.\n The contracts show that companies involved in the NHS datastore project, including Faculty and Palantir, were originally granted intellectual property rights (including the creation of databases), and were allowed to train their models and profit off their unprecedented access to NHS data.\n Government lawyers have now claimed that a subsequent (undisclosed) amendment to the contract with Faculty has cured this problem, however they have not released the further contract. openDemocracy and Foxglove are demanding its immediate release. It is not clear if other contracts were altered as well.\n The disclosures come after openDemocracy and Foxglove sent legal letters demanding transparency over the COVID datastore deal, and just hours before openDemocracy was due to issue proceedings in court.\n Over the past few weeks, MPs have asked questions in parliament about the controversial deals and over  13,000 people joined a call for transparency.\n Today, openDemocracy is publishing the contracts in full, in order to facilitate expert analysis and support public debate.\n     In March, an NHS blog announced the COVID-19 datastore project – intended, it said, to provide a “single source of truth” about the epidemic, in order to stem its spread.\n At the time, the NHS stressed that “essential data governance procedures and established principles of openness and transparency remain at the core of everything we do”; that the data collected “will only be used for COVID-19”; and that “only relevant information will be collected.”\n It also said that “once the public health emergency situation has ended, data will either be destroyed or returned in line with the law and the strict contractual agreements that are in place between the NHS and partners”.\n However concerns were raised about both the secrecy around the deals, and the track record of some of the companies involved.\n Palantir, founded by Silicon Valley billionaire and close Trump  ally Peter Thiel, is a data-mining firm best known for  supporting the CIA’s counterinsurgency and intelligence operations in Iraq and Afghanistan.\n In 2019 it was  criticised for its support for US Immigration and Customs Enforcement’s brutal regime of deportations. Reporting over its extensive contracts with American  police forces revealed problems with access to sensitive data, prices rising over time, and a lack of public trust in their ‘predictive policing’ products.\n Similar COVID-data  contracts Palantir has won in the US are worth millions of dollars, however the film is reportedly running the new NHS contract for  £1, prompting further speculation about how the firm was due to benefit from the deal.\n Meanwhile Faculty, an artificial intelligence startup, is headed by Mark Warner: brother of Ben Warner who ran the data operation for the Dominic Cummings-led Vote Leave campaign. Faculty is  reported to have won eight government contracts worth almost £1.6m in 18 months. They recently won a  contract with the Department of Housing to mine and analyse data from “social media, utility providers and telecom bills, credit rating agencies.”\n The government has not disclosed the Data Protection Impact Assessments it carried out over the NHS COVID deals, claiming it will publish these on the NHS website today. openDemocracy and Foxglove, in legal correspondence, have asked the government to specify whether this important legal compliance step was taken before the contracts were awarded – or after.\n The disclosures come amid intensifying debate about private companies’ push to profit from the coronavirus crisis. Leaked emails from outsourcing giant Serco, which is running the government’s delayed test-and-trace scheme, show CEO Rupert Soames  hoping the crisis would “cement... the position of the private sector companies in the public sector supply chain.”\n If you think that public interest journalism should continue demanding transparency during the COVID crisis and long after it, please consider     supporting openDemocracy   and     Foxglove.", "posttime": "2020-06-06 03:44:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,压力,uk", "title": "迫于压力，英国政府公布与大型科技公司的NHS COVID数据交易", "title_en": "Under Pressure, UK Government Releases NHS COVID Data Deals With Big Tech", "transed": 1, "url": "https://www.opendemocracy.net/en/under-pressure-uk-government-releases-nhs-covid-data-deals-big-tech/", "via": "", "real_tags": ["交易", "压力", "uk"]}, {"category": "", "categoryclass": "", "imagename": "c8b90314b8a8ced430f128de6683f25d.jpg", "infoid": 1005338, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "让事情变得复杂的是，谷歌保留了Google+，即使在Current推出后也是如此，但在给G Suite管理员的电子邮件中，谷歌现在宣布，Google+for G Suite将于7月6日关门，之后将没有办法选择退出Current或恢复到Google+。\n至此，谷歌已经在Google+的棺材上钉上了最后一颗钉子。Google+移动应用程序将自动更新为最新版本。所有到Google+的现有链接都将重定向到Current。\n展望未来，Google+将只会成为一个模糊的记忆，充满了朋友圈，所有的朋友圈都被迫使用真名(至少在一开始是这样)，到处都是+1按钮，火花四溅，承诺会有有趣的游戏、涟漪等等。\nCurrent完全是业务-虽然我不知道有多少公司在使用它，但对于那些在微软生态系统中使用Yammer/Teams组合的公司来说，它看起来是一个可靠的选择。现在，我想，在谷歌推出另一个社交网络之前，我们可以开始倒计时了。\n如果你想在记忆中漫步，看看我们的Google+历史吧：", "note_en": "To complicate matters, Google kept Google+ around, even after the launch of Currents, but in an email to G Suite admins, it has now announced that Google+ for G Suite will close its doors on July 6, after which there will be no way to opt out of Currents or revert back to Google+.\n  And with that, Google has driven the final nail into Google+’s coffin. The Google+ mobile apps will be automatically updated to Currents. All existing links to Google+ will redirect to Currents.\n Going forward, Google+ will only live on as a  hazy memory, filled with  circles of friends, all of which were forced to use their real name (at least at the beginning),  +1 buttons everywhere,  sparks and the promise of fun games,  ripples and more.\n Currents is all business — and while I’m not aware of a lot of companies that use it, it looks to be a solid option for companies that would otherwise use the  Yammer/Teams   combination in the Microsoft ecosystem. Now, I guess, we can start the countdown before Google launches another social network.\n If you want to take a stroll down memory lane, check out our history of Google+ below:", "posttime": "2020-06-06 03:43:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google", "title": "这就是Google+", "title_en": "And That’s It for Google+", "transed": 1, "url": "https://techcrunch.com/2020/06/05/and-thats-really-it-for-google/", "via": "", "real_tags": ["google"]}, {"category": "", "categoryclass": "", "imagename": "97cc2254b069720063879157184ead38.jpg", "infoid": 1005337, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Serena Williams的丈夫Alexis Ohanian-Reddit的联合创始人-今天辞去了Reddit董事会的职务。他在推特上宣布了这一举措，敦促公司聘请一名黑人候选人代替他，并承诺他未来从Reddit股票中获得的收益将服务于黑人社区。\n就在两天前，一些受欢迎的Subreddits私有化，在某些情况下，禁止发布新帖子，以抗议该公司的仇恨言论政策。该网站一些最大社区的一些版主特别指责Ohanian的联合创始人、现任首席执行官史蒂夫·赫夫曼(Steve Huffman)未能采取行动反对种族主义，以及该网站一些最恶毒的社区，如支持特朗普的子编辑网站r/the_Donald。\n我已经辞去了Reddit董事会成员的职务，我敦促他们用一位黑人候选人来填补我的席位，+我将利用我的Reddit股票未来的收益来服务黑人社区，主要是为了遏制种族仇恨，我将从向@kaeperick7的@your rightscamp承诺100万美元开始。\n-Alexis Ohanian Sr.(@alexisohanian)2020年6月5日。\nReddit是一个全球论坛，也是最早普及和优先考虑不受限制的言论自由理念的在线群众性聚会场所之一。最近，它的立场发生了变化。\n在过去的几年里，Reddit已经开始主动禁止在唐纳德·特朗普当选总统之前它会容忍的社区类型，比如qanon subreddit或另类右翼r/Million DollarExtreme。但这并不完美。就在本周，前首席执行官鲍康如(Ellen Pao)-在用户对她任职期间网站的变化表示反抗后辞职-指责Reddit历史上容忍种族主义和白人至上主义思想。\n我有义务叫你出来：你应该关闭_Donald，而不是放大它及其仇恨、种族主义和暴力。现在发生的很多事情都在你的脚下。当Reddit一天到晚培养白人至上主义和仇恨并将其货币化时，你就不能说“BLM”了。https://t.co/VN5XCiYp5g。\n-鲍康如(@EKP)2020年6月2日。\nOhanian希望利用他的权力和地位做一些好事的愿望令人钦佩，但这并没有消除Reddit所造成的伤害，因为它对言论的承诺高于一切。\n我相信辞职实际上可以是当权者的一种领导行为。致为拯救我们支离破碎的国家而战的每一个人：不要停下来。https://t.co/LWI1OnCaVi。\n-Alexis Ohanian Sr.(@alexisohanian)2020年6月5日。\nReddit首席执行官史蒂夫·赫夫曼(Steve Huffman)周五在一篇帖子中写道，公司将尊重奥哈尼安的要求，用一名黑人候选人取代他。“我们正在与MODS合作，改变我们的内容政策，明确解决仇恨问题，”赫夫曼补充道。“我想为多年来让我们走到这一步的政策历史负责，我们还有工作要做.”", "note_en": "Serena Williams’ husband Alexis Ohanian — the co-founder of Reddit — resigned from Reddit’s board of directors today. He announced the move in a tweet, urging the company to hire a black candidate in his stead and promising his future gains on Reddit stock to serve the black community.\n The move comes just two days after a  number of popular subreddits went private or, in some cases, banned new posts to protest the company’s hate speech policies. Some moderators of some of the site’s largest communities specifically called out Ohanian’s co-founder, current CEO Steve Huffman, for failing to take action against racism and some of the site’s most virulent communities like r/The_Donald, its pro-Trump subreddit.\n I&#39;ve resigned as a member of the reddit board, I have urged them to fill my seat with a black candidate, + I will use future gains on my Reddit stock to serve the black community, chiefly to curb racial hate, and I’m starting with a pledge of $1M to  @kaepernick7’s  @yourrightscamp\n— Alexis Ohanian Sr. (@alexisohanian)  June 5, 2020\n Reddit is a global forum, and one of the earliest mass gathering places online that popularized and prioritized the idea of unrestricted free speech. Its stance has changed more recently.\n Over the last couple years,  Reddit has started to proactively ban the kinds of communities it would have tolerated before Donald Trump’s election as president, like the QAnon subreddit or the alt-right r/MillionDollarExtreme. But it hasn’t been perfect. Just this week, former CEO Ellen Pao —  who resigned after users revolted over changes to the site during her tenure — took Reddit to task over its historical tolerance of racism and white supremacist thought.\n I am obligated to call you out: You should have shut down the_donald instead of amplifying it and its hate, racism, and violence. So much of what is happening now lies at your feet. You don&#39;t get to say BLM when reddit nurtures and monetizes white supremacy and hate all day long  https://t.co/VN5XCiYp5g\n— Ellen K. Pao (@ekp)  June 2, 2020\n Ohanian’s desire to do some good with his power and position is admirable, but it doesn’t erase the harm Reddit has done because of its commitment to speech above all else.\n I believe resignation can actually be an act of leadership from people in power right now. To everyone fighting to fix our broken nation: do not stop. https://t.co/LWI1OnCaVi\n— Alexis Ohanian Sr. (@alexisohanian)  June 5, 2020\n Reddit CEO  Steve Huffman wrote in a post Friday that the company would honor Ohanian’s request to replace him with a black candidate. “We’re working with mods to change our content policy to explicitly address hate,” Huffman added. “I want to take responsibility for the history of our policies over the years that got us here, and we still have work to do.”", "posttime": "2020-06-06 03:42:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "西斯,ohanian,reddit", "title": "亚历克西斯·奥哈尼安(Alexis Ohanian)从Reddit辞职，要求由黑人候选人接替他的职位", "title_en": "Alexis Ohanian asks to be replaced by black candidate as he resigns from Reddit", "transed": 1, "url": "https://www.theverge.com/2020/6/5/21281744/reddit-co-founder-alexis-ohanian-resigns-board", "via": "", "real_tags": ["西斯", "ohanian", "reddit"]}, {"category": "", "categoryclass": "", "imagename": "c4319da3500309ad8d2e9fde44bb66ac.jpg", "infoid": 1005336, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1965年，英特尔(Intel)联合创始人戈登·摩尔(Gordon Moore)预测，计算机芯片上可以容纳的晶体管数量将呈指数级增长--事实的确如此，大约每两年翻一番。半个世纪以来，摩尔定律一直存在：计算机变得更小、更快、更便宜、更高效，使得个人电脑、智能手机、高速互联网等在全球范围内迅速普及。这种小型化趋势导致了今天的硅芯片具有几乎不可想象的小电路。晶体管，即实现计算机微处理器的微小开关，如此之小，以至于1000个首尾相连的晶体管还不到一根头发那么宽。在很长一段时间里，晶体管越小，它们切换的速度就越快。\n但今天，我们正在接近晶体管可以小到什么程度的极限。因此，在过去的十年里，研究人员一直在绞尽脑汁寻找其他方法来提高性能，以便计算机行业能够继续创新。\n虽然我们在等待量子、碳纳米管或光子学等新计算技术的成熟(这可能需要一段时间)，但随着摩尔定律的终结，还需要其他方法来提高性能。在最近发表在“科学”杂志上的一篇期刊文章中，CSAIL的一个团队确定了继续提高计算速度需要优先考虑的三个关键领域：更好的软件和更精简的硬件。\n资深作者Charles E.Leiserson说，几十年来，小型化带来的性能好处是如此之大，以至于程序员能够优先考虑让代码编写变得更容易，而不是让代码本身运行得更快。这种趋势带来的低效是可以接受的，因为更快的速度总是能够弥补不足。\n不过，麻省理工学院电气工程与计算机科学系埃德温·西布利·韦伯斯特(Edwin Sibley Webster)教授莱瑟森表示，如今，要想在机器学习、机器人和虚拟现实等领域取得更大进展，将需要巨大的计算能力，而小型化已经无法提供这些能力。如果我们想要充分利用这些技术的潜力，我们必须改变我们的计算方式。\n莱瑟森与研究科学家尼尔·汤普森、丹尼尔·桑切斯教授、兼职教授巴特勒·兰普森以及研究科学家乔尔·埃默、布拉德利·库兹毛尔和陶沙德尔共同撰写了这篇论文。它将发表在本周出版的下期“科学”杂志上。\n对于软件，他们说，程序员以前把生产力放在性能之上的优先顺序导致了一些有问题的策略，比如减少：取处理问题A的代码，并用它来解决问题B。例如，如果有人必须创建一个系统来识别是或否，但不想编写一个全新的自定义程序，他们可以使用一个能够识别广泛单词的现有程序，并将其调整为只对是或否的答案做出响应。\n虽然这种方法减少了编码时间，但它产生的低效很快就会加剧：如果单个缩减的效率是自定义解决方案的80%，然后添加20层缩减，那么代码的效率最终将比它可能的效率低100倍。\n汤普森说，随着硬件改进速度的放缓，程序员必须重新考虑这些策略。如果我们想继续获得我们已经习惯的提速，我们就不能继续照常做生意。\n取而代之的是，研究人员推荐像并行化代码这样的技术。许多现有的软件都是使用古老的假设设计的，即处理器一次只能执行一项操作。但近年来，多核技术使复杂任务的完成速度提高了数千倍，并以更节能的方式完成。\n没有参与该项目的赖斯大学(Rice University)计算工程教授摩西·瓦迪(Mohe Vardi)表示：既然摩尔定律不会在银盘上给我们带来更好的性能，我们将不得不以艰难的方式提供性能。这是计算研究的大好机会，[麻省理工学院CSAIL]报告为此类研究提供了路线图。\n对于算法，该团队建议了一个三管齐下的方法，包括探索新的问题领域，解决对算法如何扩展的担忧，以及对它们进行调整以更好地利用现代硬件。\n在方面，该团队主张精简硬件，这样可以用更少的晶体管和更少的硅来解决问题。精简包括使用更简单的处理器和创建为特定应用程序量身定做的硬件，如图形处理器(GPU)是为计算机图形量身定做的。\nSchardl说，为特定领域定制的硬件可以更高效，使用更少的晶体管，使应用程序的运行速度提高数十到数百倍。更广泛地说，硬件精简将进一步鼓励并行编程，创造额外的芯片面积，用于更多可以并行操作的电路。\n虽然这些方法可能是最好的前进道路，但研究人员说，这并不总是一帆风顺的。使用这种技术的组织可能直到投入了大量的工程时间之后才知道他们努力的好处。此外，提速不会像摩尔定律那样一致：它们可能在一开始是戏剧性的，然后需要大量的努力才能做出较小的改进。\n汤普森表示，对于谷歌(Google)和亚马逊(Amazon)这样的科技巨头来说，其数据中心的巨大规模意味着，即使是软件性能的微小改进也能带来巨大的财务回报。但是，虽然这些公司可能是领头羊，但其他许多公司如果想要保持竞争力，就需要认真对待这些问题。\n要在团队确定的领域得到改善，还需要建立使其成为可能的基础设施和劳动力。\nLeiserson说，性能增长将需要新的工具、编程语言和硬件来促进更多更好的性能工程。这也意味着计算机科学家可以更好地了解如何让软件、算法和硬件协同工作，而不是把它们放在不同的竖井里。\n减少是指您提取处理问题A的代码，并使用它来解决问题B。(例如，如果某人必须创建一个识别是或否语音命令的系统，但又不想编写一个全新的自定义程序，那么他们可以采用一个能够识别大范围单词的现有程序，并将其调整为只对是或否的答案作出响应。)。\n虽然这种方法减少了编码时间，但它产生的低效很快就会加剧：如果单个缩减的效率是自定义解决方案的80%，然后添加20层缩减，那么代码的效率最终将比它可能的效率低100倍。更多信息：查尔斯·E·莱瑟森(Charles E.Leiserson)等人。顶层有很大的空间：在摩尔定律、科学(2020)之后，什么将推动计算机性能？网址：10.1126/cience.aam9744", "note_en": "In 1965, Intel co-founder Gordon Moore predicted that the number of transistors that could fit on a computer chip would grow exponentially —- and they did, doubling about every two years. For half a century Moore&#39;s Law has endured: computers have gotten smaller, faster, cheaper and more efficient, enabling the rapid worldwide adoption of PCs, smartphones, high-speed Internet and more.    This miniaturization trend has led to silicon chips today that have almost unimaginably small circuitry. Transistors, the tiny switches that implement computer microprocessors, are so small that 1000 of them laid end-to-end are no wider than a human hair. For a long time, the smaller the transistors were, the faster they could switch.\n  But today, we&#39;re approaching the limit of how small transistors can get. As a result, over the last decade researchers have been scratching their heads to find other ways to improve performance so that the computer industry can continue to innovate.\n  While we wait for the maturation of new computing technologies like quantum, carbon nanotubes, or photonics (which may take a while), other approaches will be needed to get performance as Moore&#39;s Law comes to an end. In a recent journal article published in  Science, a CSAIL team identifies three key areas to prioritize to continue to deliver computing speed-ups: better software,   and more streamlined hardware.\n  Senior author Charles E. Leiserson says that the performance benefits from miniaturization have been so great that, for decades, programmers have been able to prioritize making the writing of code easier rather than making the code itself run faster. The inefficiency that this tendency introduces has been acceptable, because faster   have always been able to pick up the slack.\n  &#34;But nowadays, being able to make further advances in fields like machine learning, robotics and virtual reality will require huge amounts of computational power that miniaturization can no longer provide,&#34; says Leiserson, the Edwin Sibley Webster Professor in MIT&#39;s Department of Electrical Engineering and Computer Science (EECS). &#34;If we want to harness the full potential of these technologies, we must change our approach to computing.&#34;\n  Leiserson co-wrote the paper with research scientist Neil Thompson, professor Daniel Sanchez, adjunct professor Butler Lampson and research scientists Joel Emer, Bradley Kuszmaul and Tao Schardl. It will be published in the next issue of  Science, out this week.\n         With software, they say that programmers&#39; previous prioritization of productivity over performance has led to problematic strategies like &#34;reduction&#34;: taking code that worked on problem A, and using it to solve problem B. For example, if someone has to create a system to recognize yes-or-no  , but doesn&#39;t want to code a whole new custom program, they could take an existing program that recognizes a wide range of words, and tweak it to respond only to yes-or-no answers.\n  While this approach reduces coding time, the inefficiencies it creates quickly compound: if a single reduction is 80 percent as efficient as a custom solution, and you then add twenty layers of reduction, the code will ultimately be 100 times less efficient than it could be.\n   &#34;These are the kinds of strategies that programmers have to rethink as hardware improvements slow down,&#34; says Thompson. &#34;We can&#39;t keep doing &#39;business as usual&#39; if we want to continue to get the speed-ups we&#39;ve grown accustomed to.&#34;\n  Instead, the researchers recommend techniques like parallelizing code. Much existing software has been designed using ancient assumptions that processors can only do only one operation at a time. But in recent years multicore technology has enabled complex tasks to be completed thousands of times faster and in a much more energy-efficient way.\n  &#34;Since Moore&#39;s Law will not be handing us improved performance on a silver platter, we will have to deliver performance the hard way,&#34; says Moshe Vardi, a professor in computational engineering at Rice University who was not part of the project. &#34;This is a great opportunity for computing research, and the [MIT CSAIL] report provides a road map for such research.&#34;\n  For algorithms, the team suggests a three-pronged approach that includes exploring new problem areas, addressing concerns about how algorithms scale, and tailoring them to better take advantage of modern hardware.\n  In terms of  , the team advocates that hardware be streamlined so that problems can be solved with fewer transistors and less silicon. Streamlining includes using simpler processors and creating hardware tailored to specific applications, like the graphics-processing unit (GPU) is tailored for computer graphics.\n  &#34;Hardware customized for particular domains can be much more efficient and use far fewer transistors, enabling applications to run tens to hundreds of times faster,&#34; says Schardl. &#34;More generally, hardware streamlining would further encourage parallel programming, creating additional chip area to be used for more circuitry that can operate in parallel.&#34;\n  While these approaches may be the best path forward, the researchers say that it won&#39;t always be an easy one. Organizations that use such techniques may not know the benefits of their efforts until after they&#39;ve invested a lot of engineering time. Plus, the speed-ups won&#39;t be as consistent as they were with Moore&#39;s Law: they may be dramatic at first, and then require large amounts of effort for smaller improvements.\n    &#34;For tech giants like Google and Amazon, the huge scale of their data centers means that even small improvements in software performance can result in large financial returns,&#34; says Thompson. &#34;But while these firms may be leading the charge, many others will need to take these issues seriously if they want to stay competitive.&#34;\n  Getting improvements in the areas identified by the team will also require building up the infrastructure and workforce that make them possible.\n  &#34;Performance growth will require new tools, programming languages and hardware to facilitate more and better performance engineering,&#34; says Leiserson. &#34;It also means computer scientists being better educated about how we can make software, algorithms and hardware work together, instead of putting them in different silos.&#34;\n      Reduction is when you take code that worked on problem A, and use it to solve problem B. (For example, if someone has to create a system to recognize yes-or-no voice commands, but doesn&#39;t want to code a whole new custom program, they could take an existing program that recognizes a wide range of words, and tweak it to respond only to yes-or-no answers.)\n  While this approach reduces coding time, the inefficiencies it creates quickly compound: if a single reduction is 80 percent as efficient as a custom solution, and you then add 20 layers of reduction, the code will ultimately be 100 times less efficient than it could be.        More information:\t\t\t\t\t\t\t\t\t\t\t\tCharles E. Leiserson et al. There&#39;s plenty of room at the Top: What will drive computer performance after Moore&#39;s law?,  Science (2020).  DOI: 10.1126/science.aam9744", "posttime": "2020-06-06 03:24:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,开发,不能,smaller,需要", "title": "如果晶体管不能变得更小，那么软件开发人员就必须变得更聪明", "title_en": "If transistors can't get smaller, then software developers have to get smarter", "transed": 1, "url": "https://techxplore.com/news/2020-06-transistors-smaller-software-smarter.html", "via": "", "real_tags": ["软件", "开发", "不能", "smaller", "需要"]}, {"category": "", "categoryclass": "", "imagename": "1975dc0e42e3eab67dc91fd094e1cecd.jpg", "infoid": 1005335, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了解决系统性种族主义问题，亚历克西斯·奥哈尼安(Alexis Ohanian)要求用一名黑人成员取代董事会成员。\n他承诺将他的Reddit股票收益投资于造福黑人社区的项目。\n2005年与人共同创立社交媒体聚合网站Reddit的亚历克西斯·奥哈尼安(Alexis Ohanian)今天宣布，他已从公司董事会辞职，并敦促其余董事会成员用一名黑人候选人取代他。\n奥哈尼安还表示，他将把从Reddit股票中获得的收益再投资于服务黑人社区，主要是为了遏制种族仇恨。他的第一笔捐款是承诺给前旧金山49人队四分卫科林·凯珀尼克(Colin Kaepernick)的“了解你的权利营”(Know Your Rights Camp)。\n奥哈尼安嫁给了网球明星塞雷娜·威廉姆斯(Serena Williams)，他说他觉得有必要这么做，这样当他黑人女儿问他，你做了什么时，他就可以回答她了。\n这一举措正值美国开始与系统性种族主义作斗争，此前发生了几起备受瞩目的黑人公民死于警察之手的事件。\n奥哈尼安认为，他可以提供帮助的一种方式是在一个缺乏黑人代表的竞技场上让位。Black Enterprise的2019 Power in the董事会报告发现，37%的标准普尔500指数成份股公司没有黑板成员。这包括思科、甲骨文和Intuit等大型科技公司。\nReddit的小董事会位于标准普尔500指数之外，目前也没有黑人成员。它由奥哈尼安、康泰纳仕的高管罗伯特·索尔伯格、OpenAI的萨姆·奥特曼和个人资本公司的波特·盖尔组成。\n虽然他在美国访问量最大的网站之一担任的高管职位可以为奥哈尼安提供一个巨大的平台，但他离开Reddit的全职职位可能会让他更多地专注于向拥有不同领导团队的项目投入大量资金。\nOhanian共同创立的风险投资公司Initialized Capital已经投资了Coinbase等密码初创公司，并在3月份牵头了对Horizon Block Chain Games的一轮投资。通过将他的激进主义与他的钱包相结合，奥哈尼安可以帮助改变密码项目的竞争环境，这些项目通常旨在纠正系统性的不公正。\n例如，Coinbase在2月份报告称，美国黑人受到当前金融体系负面影响的可能性是白人的两倍。", "note_en": "In a bid to address systemic racism, Alexis Ohanian asked to be replaced on the board with a black member.\n   He has pledged to invest his Reddit stock earnings to projects that benefit the black community.\n Alexis Ohanian, who co-founded the social media aggregator site Reddit in 2005, announced today that he has resigned from the company&#39;s board of directors and urged the remaining board members to replace him with a black candidate.\n Ohanian also said he would reinvest gains from his Reddit stock &#34;to serve the black community, chiefly to curb racial hate.&#34; His first donation was a pledge to former San Francisco 49ers&#39; quarterback Colin Kaepernick&#39;s   Know Your Rights Camp .\n   Ohanian, who is married to tennis star Serena Williams, said he felt compelled to make the move so he can answer his black daughter when she asks, &#34;What did you do?&#34;\n The move comes as the nation begins to grapple with systemic racism in the wake of several high-profile deaths of black citizens at the hands of police.\n Ohanian felt that one way he could help was by stepping aside in an arena where black representation is lacking.   Black Enterprise &#39;s 2019 Power in the Boardroom  report  found that  37% of S&amp;P 500 companies had no black board members. That included major tech firms like Cisco, Oracle, and Intuit.\n  The small board at Reddit, which lies outside of the S&amp;P 500, currently has no black members either. It&#39;s comprised of Ohanian, Condé Nast executive Robert Sauerberg, OpenAI&#39;s Sam Altman, and Personal Capital Corporation&#39;s Porter Gale.\n Although his executive post for one of the country&#39;s most-visited websites would conceivably give Ohanian a large platform, his full-time move away from Reddit may allow him to focus more on pouring money into projects with diverse leadership teams.\n  Initialized Capital , a venture capital firm Ohanian co-founded, has already invested in crypto startups such as Coinbase, and it   led an investment round  in Horizon Blockchain Games in March. By pairing his activism with his pocketbooks, Ohanian could help change the playing field for crypto projects, which often aim to redress systemic injustices.\n Coinbase, for instance,  reported in February  that  black Americans were twice as likely to &#34;have been negatively impacted by the current financial system as white Americans.&#34;", "posttime": "2020-06-06 03:24:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "联合,founder,黑人", "title": "Reddit联合创始人辞职打击种族不公正", "title_en": "Reddit co-founder resigns to fight racial injustice", "transed": 1, "url": "https://decrypt.co/31436/reddit-co-founder-resigns-fight-racial-injustice", "via": "", "real_tags": ["联合", "founder", "黑人"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005334, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几年里，我到处听到关于Crystal编程语言的消息，但直到昨天才有机会去看一看。\n什么是水晶？它是一种静态类型的、编译的、面向对象的语言，其语法深受Ruby的启发。\n其网站上的承诺是，该语言像C一样快，像Ruby一样流畅。这句话听起来令人兴奋，让您想看看Crystal与Ruby相比有多快。当然，这不是一个公平的比较，因为一个是编译语言，另一个是解释语言(下面使用的Ruby MRI实现)。\n从Crystal的网站上摘取的一个基本HTTP服务器的实现按预期工作，代码看起来确实像Ruby的：\n要求&#34；http/server&#34；server=HTTP：：server。新建DO|Context|Context。回应。content_type=&#34；文本/纯文本&#34；上下文。回应。打印&#34；Hello world，获得#{上下文。请求。PATH}！&#34；END PUT&#34；侦听http://127.0.0.1:8080&#34；服务器。聆听(8080)。\n让我们用Ruby和Crystal编写一些代码，为给定的数字生成斐波纳契数列。然后，我们可以查看查找序列中第46个数字(即1，836，311，903)所需的时间。稍后你就会明白我为什么选这个号码了。\n如果我们试图找到斐波纳契序列中的下一个，第47个数字，Crystal实际上会给我们一个错误：\n未经处理的异常：Fibonacci中的Fibonacci中的算术溢出(OverflowError)。cr：6：6 in&#39；__Crystal_Main&#39；中的/usr/local/Cellar/crystal/0.34.0/src/crystal/main.cr:105:5 in&#39；Main&#39；\n如果您还记得Crystal是一种静态类型的语言，但是您可以省略显式类型限制，编译器会尝试推断变量的类型。在我们的代码中，Crystal对n变量使用Int32类型，它的最大值为2，147，483，647，但是第47个数字更高。在本例中，我们需要指定n的类型。我们可以使用无符号整数64。\n我们可以优化代码并引入记忆化，以返回先前计算的数字的缓存结果。\ndef Fibonacci(n，cache=[0，1])如果cache[n]cache[n]=Fibonacci(n-1，cache)+Fibonacci(n-2，cache)end放入斐波纳契数(100)，则返回cache[n]。\ndef fibonacci(n，cache=[0，1]of UInt128)如果cache[n]？(cache&lt；&lt；&lt；fibonacci(n-1，cache)+Fibonacci(n-2，cache))[-1]end放置斐波纳奇数(100)，则返回cache[n]。\n当我们尝试寻找斐波纳契序列中相当大的第100个数字时：354,224,848,179,261,915,075，结果如下：\n这表明，必须首先优化的是算法，而不是选择一种速度更快的语言或机器。\n水晶碎片数据库-就像水晶的Ruby工具箱", "note_en": "I’ve been hearing about the  Crystal programming language here and there over the last couple of years but never had a chance to give it a look until yesterday.\n What is Crystal? It’s a statically type, compiled, object-oriented language with syntax heavily inspired by Ruby’s.\n The promise on its site is that the language is fast as C, sleek as Ruby. This statement sounds exciting and makes you want to check how fast Crystal is comparing to Ruby. Of course, it won’t be a fair comparison since one is a compiled language and another is an interpreted one (the Ruby MRI implementation used below).\n       An implementation of a basic HTTP server taken from the Crystal’s web site works as expected and the code indeed looks like Ruby’s:\n require  &#34;http/server&#34; server  =  HTTP :: Server . new  do  | context |  context . response . content_type  =  &#34;text/plain&#34;  context . response . print  &#34;Hello world, got  #{ context . request . path } !&#34; end puts  &#34;Listening on http://127.0.0.1:8080&#34; server . listen ( 8080 )\n  Let’s write some code in Ruby and Crystal to generate a Fibonacci sequence for a given number. We can then see how much time it takes to find the 46th number (which is 1,836,311,903) in the sequence. You will see in a bit why I picked this number.\n        If we try to find the next, 47th number in the Fibonacci sequence, Crystal will actually give us an error:\n Unhandled exception: Arithmetic overflow (OverflowError) from fibonacci from fib.cr:6:6 in &#39;__crystal_main&#39; from /usr/local/Cellar/crystal/0.34.0/src/crystal/main.cr:105:5 in &#39;main&#39;\n  If you recall Crystal is a statically typed language but you can omit explicit type restriction and the compiler will try to infer the type of variable. In our code Crystal uses the Int32 type for the n variable which has the maximum value of 2,147,483,647 but the 47th number is higher. In this case we need to specify the type of n. We can use Unsigned Int 64.\n    We can optimize our code and introduce memoization to return cached results of the previously calculated numbers.\n  def  fibonacci ( n ,  cache  =  [ 0 ,  1 ])  return  cache [ n ]  if  cache [ n ]  cache [ n ]  =  fibonacci ( n - 1 ,  cache )  +  fibonacci ( n - 2 ,  cache ) end puts  fibonacci ( 100 )\n  def  fibonacci ( n ,  cache  =  [ 0 ,  1 ]  of  UInt128 )  return  cache [ n ]  if  cache [ n ]?  ( cache  &lt;&lt;  fibonacci ( n - 1 ,  cache )  +  fibonacci ( n - 2 ,  cache ))[ - 1 ] end puts  fibonacci ( 100 )\n When we try to find the 100th number in the Fibonacci sequence which is pretty big: 354,224,848,179,261,915,075 we end up with the following results:\n  Which makes the point that what has to be optimized first is the algorithm and not picking up a faster language or machine.\n    A Database of Crystal Shards - it’s like the Ruby Toolbox for Crystal", "posttime": "2020-06-06 03:06:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ruby,性能,水晶,crystal", "title": "红宝石与水晶性能对比", "title_en": "Ruby vs. Crystal Performance", "transed": 1, "url": "https://ptimofeev.com/ruby-vs-crystal-performance/", "via": "", "real_tags": ["ruby", "性能", "水晶", "crystal"]}, {"category": "", "categoryclass": "", "imagename": "98aa4dc1ecb29d00c69465fe9745dce3.jpg", "infoid": 1005333, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "知情人士告诉CNBC，正在调查谷歌潜在违反反垄断行为的州总检察长倾向于推动拆分其广告技术业务，这是预计将提起的诉讼的一部分。\n近几个月来，50名司法部长一直在调查谷歌的商业行为，与此同时，美国司法部也在领导一项类似的调查。知情人士告诉CNBC，美国各州和美国司法部都在寻求在未来几个月内对这家互联网巨头提起诉讼。\n知情人士说，各州和司法部尚未正式决定是否合并他们预期的诉讼，尽管他们一直在密切合作。两家公司一直在调查谷歌的搜索、广告技术和安卓业务。\n其中一位消息人士称，调查谷歌的总检察长尚未明确排除推动其广告技术业务替代方案的可能性，比如对其业务运营方式施加限制。谷歌隶属于Alphabet，港湾。诉讼还可能包括推动这一选择和拆分广告技术业务。\n如果总检察长积极寻求拆分谷歌的广告技术业务，那将是值得注意的。虽然监管执法机构最近青睐−拆分和资产剥离的结构性补救措施，但监管机构可以找到不那么繁琐的解决方案，比如通过同意法令禁止某些行为。\n一旦总检察长提起预期的诉讼，他们就有许多工具可供他们使用，以表明他们有意推动拆分谷歌的广告技术业务。这包括他们所声称的，他们介绍的证据，审判前的简报会和新闻发布会。\n一些律师表示，在谷歌的案例中，推动拆分其广告技术业务可能很困难，因为它不是作为一个容易剥离的独立部门而存在的。它的两笔主要交易，2007年的DoubleClick和2009年的AdMob，都是几年前的事了。\n20年前微软(Microsoft)反垄断案的政府律师之一斯蒂芬·霍克(Stephen Houck)表示：法院非常担心，拆分一家公司会伤害消费者，并让那些没有这样做的专业知识的人的情况变得更糟。\n虽然谷歌大约1610亿美元的收入中有大部分来自广告销售，但它从作为这项业务支柱的软件和技术中获得的收入要小得多。其网络会员业务，包括AdMob，AdSense和Google Ad Manager，在上一财年创造了约220亿美元的销售额。\n谷歌在2018年停用了DoubleClick这个名称，将面向广告商的DoubleClick产品与谷歌分析360(Google Analytics 360)放在一起，成为谷歌营销平台。然后，谷歌将面向出版商的DoubleClick产品和DoubleClick广告交易所放入了谷歌广告管理器(Google Ad Manager)。\n尽管政府过去曾成功地争取拆分企业巨头，包括1911年的标准石油(Standard Oil)和20世纪80年代的美国电话电报公司(AT&amp；T)，但最近的案例实施的补救措施较弱。上世纪80年代的IBM和2000年的微软都在没有拆分各自公司的情况下结束了反垄断诉讼。\n唐纳德·特朗普(Donald Trump)总统与其他共和党人一起指控谷歌(Google)等公司审查保守内容，谷歌否认了这一指控。本月早些时候，他签署了一项行政命令，誓言要通过通信体面法案(Communications Decency Act)第230条打击谷歌等互联网公司的责任保护。\n司法部长威廉·巴尔(William Barr)出席了这项行政命令的签署仪式。在谷歌最高反垄断官员马坎·德拉希姆(Makan Delrahim)回避后，巴尔的副手最近接手了司法部对谷歌的反垄断调查。\n总统候选人乔·拜登(Joe Biden)担任巴拉克·奥巴马(Barack Obama)的副总统，奥巴马因允许科技公司在他的领导下变得过于强大而受到批评。拜登曾表示，作为总统，他将在司法部内设立一个新部门，回去研究已经发生的大型合并和正在提议发生的合并。\n谷歌的一位发言人在一份声明中告诉CNBC，我们继续参与由司法部和司法部长帕克斯顿领导的正在进行的调查，我们没有任何关于猜测的最新消息或评论。\n事实很清楚，她补充说，我们的数字广告产品在一个拥挤的行业中与数百个竞争对手和技术竞争，并帮助降低了广告商和消费者的成本。她补充说，我们的数字广告产品在这个拥挤的行业中与数百家竞争对手和技术竞争，帮助降低了广告商和消费者的成本。\n德克萨斯州司法部长肯·帕克斯顿(Ken Paxton)的发言人拒绝置评。帕克斯顿负责调查的广告技术部分。美国司法部发言人没有回复记者的置评请求。\n批评人士称，谷歌将其广告工具捆绑在一起，这样竞争对手就无法与其提供的产品相匹敌，而且它对搜索结果、YouTube、Gmail和其他服务的运营阻碍了广告竞争。他们还表示，谷歌拥有出售和购买广告的拍卖交易所的所有方面，这让它获得了不公平的优势。\n谷歌辩称，它还在与许多垂直整合的公司竞争，包括美国电话电报公司(AT&amp；T)、康卡斯特(Comcast)和威瑞森(Verizon)。与此同时，圣路易斯联邦储备银行(St.Louis Federal Reserve)的数据显示，数字广告产品的价格自2010年以来下降了40%以上。\n虽然目前尚不清楚司法部长可能会以何种方式拆分谷歌的广告技术业务，但谷歌斥资31亿美元收购DoubleClick为其在广告技术领域提供了关键的立足点。联邦贸易委员会(Federal Trade Commission)以4比1的投票结果决定，它不会寻求阻止这笔交易，裁定它不是反竞争的。\n反对票帕梅拉·琼斯(Pamela Jones)当时辩称，她担心这笔交易会通过DoubleClick提供的数据赋予谷歌太多权力。\n她写道，通过收购DoubleClick，谷歌将获得有助于并加剧网络效应的数据。因此，谷歌和DoubleClick的合并很可能会使搜索和显示市场对谷歌有利，并使任何其他公司更难挑战合并后的公司。\n琼斯补充说，合并后的谷歌和DoubleClick可以获得无与伦比的数据源，这将使谷歌能够以竞争对手无法比拟的方式匹配广告买家和卖家。\n根据CNBC获得的一份法庭记录，谷歌的一名律师今年早些时候在德克萨斯州一家法院表示，总检察长的调查正在寻求有关谷歌广告技术客户姓名和产品定价细节的非常详细的信息。他说，调查集中在谷歌的DoubleClick和AdMob业务上。\n就谷歌而言，它在去年的一篇博客文章中辩称，广告技术行业是出了名的拥挤，并援引了电信(Telaria)、卢比孔项目(Rubicon Project)和贸易台(Trade Desk)等竞争对手的话。它还表示，出版商使用它的技术来获取数百个合作伙伴的需求，而广告商使用它的技术在80多个交易所购买广告空间。", "note_en": "The state attorneys general investigating Google for potential antitrust violations are leaning towards pushing for a breakup of its ad technology business as part of an expected suit, people familiar with the situation told CNBC.\n Fifty attorneys general have been probing Google&#39;s business practices for months, alongside a similar probe being led by the U.S. Department of Justice. Both the states and the DOJ are looking to file a suit against the internet giant as soon as within the next few months, people familiar with the situation told CNBC.\n  The states and the Justice Department have not yet officially decided whether to combine their expected suits, the people said,  though they have been collaborating closely. Both  have been investigating Google&#39;s search, ad technology and android business.\n The attorneys general investigating Google, which is owned by  Alphabet, haven&#39;t yet definitively ruled out pushing for alternatives for its ad technology business, like imposing restrictions on how it runs its business, one of the sources said. A suit may also include a push for both that option and breaking up the ad tech business.\n Should the attorneys general aggressively pursue a break up of Google&#39;s ad technology business, it would be notable. While regulatory enforcement agencies have recently favored &#34;structural remedies&#34; − break-ups and divestitures − regulators have less onerous solutions available, like barring certain behaviors through a consent decree.\n Once the attorneys general file their expected lawsuit, they have a number of tools at their disposal to signal their intent to push for a breakup of Google&#39;s ad technology business. That includes what they allege, the evidence they introduce, pre-trial briefings and press conferences.\n In Google&#39;s case, pushing for a break up of its ad technology business may be difficult, some lawyers say, because it does not exist as a stand-alone unit easily hived off. And its two main deals,  DoubleClick in 2007 and AdMob in 2009, were years ago.\n  &#34;Courts are very concerned that by ripping a company apart, it hurts consumers and make it worse for people that don&#39;t have the expertise to do that,&#34; said Stephen Houck, one of the government lawyers in the  Microsoft antitrust case two decades ago.\n While Google generates the majority of its roughly $161 billion in revenue from ad sales, the revenue it gets from the software and technology that serve as the backbone of that business is far smaller. Its Network Members business, which includes AdMob, AdSense, and Google Ad Manager, generated about $22 billion in sales the last fiscal year.\n Google retired the DoubleClick name in 2018,  putting its DoubleClick products for advertisers together with Google Analytics 360 to become the &#34;Google Marketing Platform.&#34; Then it put its DoubleClick products for publishers and the DoubleClick ad exchange into the &#34;Google Ad Manager.&#34;\n While the government has successfully fought for a break up of corporate giants in the past, including Standard Oil in 1911 and AT&amp;T in the 1980s, more recent cases have imposed weaker remedies. Both  IBM in the 1980s and Microsoft in 2000 concluded antitrust suits without breaking up the respective companies.\n  President Donald Trump has alleged, along with other Republicans, that companies like Google censor conservative content, a claim Google has denied. He earlier this month  signed an executive order vowing to crack down on the liability protections internet companies like Google through section 230 of the Communications Decency Act.\n Attending the signing of that executive order was Attorney General William Barr, whose deputy recently  took leadership of the Justice Departments&#39; antitrust investigation into Google, after the country&#39;s top antitrust official, Makan Delrahim, recused himself.\n Presidential candidate Joe Biden served as vice president to  Barack Obama, who has been criticized for allowing tech companies to become too powerful on his watch. Biden has said that, as president,  he would set up a new department within the Justice Department to go back and look at the mega-mergers that have occurred and those who are being proposed to occur.\n A spokesperson for Google told CNBC in a statement, &#34;We continue to engage with the ongoing investigations led by the Department of Justice and Attorney General Paxton, and we don&#39;t have any updates or comments on speculation.&#34;\n &#34;The facts are clear,&#34; she added, &#34;our digital advertising products compete across a crowded industry with hundreds of rivals and technologies, and have helped lower costs for advertisers and consumers.&#34;\n A spokesperson for Texas Attorney General Ken Paxton, who is leading the ad tech part of the probe, declined to comment. A spokesperson for DOJ did not respond to a request for comment.\n  Critics have said that Google bundles its ad tools so that rivals can&#39;t afford to match its offerings and that its operation of search results, YouTube, Gmail and other services to hinder ad competition. They also say that Google owns all sides of the &#34;auction exchange&#34; through which ads are sold and bought, giving it an unfair advantage.\n Google has argued it competes with many vertically integrated players including  AT&amp;T,  Comcast, and  Verizon. Data from the St. Louis Federal Reserve, meantime, show that the price of digital advertising  has fallen by more than 40% since 2010.\n While it remains unclear in what fashion the attorneys general might push to break up Google&#39;s ad tech business,  Google&#39;s $3.1 billion acquisition of DoubleClick provided it the crucial foothold into advertising technology. The Federal Trade Commission decided in a 4-1 vote it would not seek to block the deal, ruling that it was not anti-competitive.\n The dissenting vote, Pamela Jones, argued at the time she worried the deal would give Google too much power by way of the data that DoubleClick provides.\n &#34;By purchasing DoubleClick, Google will acquire data that will contribute to, and exacerbate, network effects,&#34; she wrote. &#34;As a result, the Google/DoubleClick combination is likely to &#39;tip&#39; both the search and display markets in Google&#39;s favor, and make it more difficult for any other company to challenge the combined firm.&#34;\n Jones added that the combined Google and DoubleClick could get access to &#34;unparalleled data sources&#34; that would allow it to match up buyers and sellers of ads in a way its competitors could not.\n A lawyer for Google said in a Texas court earlier this year the attorneys general probe was seeking &#34;very detailed information&#34; on the names of Google&#39;s ad tech customers and details pertaining to product pricing, according to a court transcript obtained by CNBC. Inquiries focused on Google&#39;s DoubleClick and AdMob businesses, he said.\n For its part, Google argued in a blog post last year the ad technology industry is &#34;famously crowded,&#34; citing competitors like Telaria, Rubicon Project and The Trade Desk. It also said publishers use its technology &#34;to access demand from hundreds of partners,&#34; while advertisers use its technology to buy ad space &#34;on more than 80 exchanges.&#34;", "posttime": "2020-06-06 03:05:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,谷歌,google,拆分,lean", "title": "美国各州倾向于拆分谷歌的广告技术业务", "title_en": "U.S. states lean toward breaking up Google's ad tech business", "transed": 1, "url": "https://www.cnbc.com/2020/06/05/states-lean-toward-pushing-to-break-up-googles-ad-tech-business.html", "via": "", "real_tags": ["广告", "谷歌", "google", "拆分", "lean"]}]