[{"category": "", "categoryclass": "", "imagename": "5ea6b3e0af22649d2fa6d116bfd0f439.jpeg", "infoid": 1006240, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿-据熟悉谈判情况的政府官员透露，特朗普政府正在权衡一项暂停一系列基于就业的移民签证的提议，其中包括令人垂涎的H-1B高技能签证，这是在疫情的经济后果中可能采取的几项措施之一。\n这些官员说，拟议中的暂停可能会延长到政府从10月1日开始的新财年，届时通常会发放许多新签证。这可能会阻止任何国外的新H-1B持有者来到.", "note_en": "WASHINGTON—The Trump administration is weighing a proposal to suspend a slate of employment-based immigration visas, including the coveted H-1B high-skilled visa, according to administration officials familiar with the talks, among several possible measures amid the economic fallout of the pandemic.\n  The proposed suspension could extend into the government’s new fiscal year, beginning Oct. 1, when many new visas are typically issued, these officials said. That could bar any new H-1B holder outside the country from coming to...", "posttime": "2020-06-12 09:06:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "政府,administration,签证", "title": "特朗普政府考虑在秋季暂停H-1B和其他签证", "title_en": "Trump Administration Considers Suspending H-1B, Other Visas Through the Fall", "transed": 1, "url": "https://www.wsj.com/articles/trump-administration-considers-suspending-h-1b-other-visas-through-the-fall-11591915950", "via": "", "real_tags": ["政府", "签证"]}, {"category": "", "categoryclass": "", "imagename": "6546b10e51e1e1e6cd91a3c94333830f.png", "infoid": 1006237, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "血清学检测在身体对特定感染(如新冠肺炎)做出反应时，会检测血液中是否存在抗体。换句话说，检测是检测身体对病毒引起的感染的免疫反应，而不是检测病毒本身。在感染的早期，当身体的免疫反应仍在建立时，可能检测不到抗体。这限制了测试的有效性，诊断新冠肺炎，这是一个原因，血清学测试不应该被用作诊断新冠肺炎的唯一依据。血清学测试可以通过帮助医疗专业人员识别可能对SARS-CoV2产生免疫反应的个人，在对抗新冠肺炎的斗争中发挥作用。此外，这些检测结果还可以帮助确定谁可以捐献一部分名为恢复期血浆的血液，这可能会成为新冠肺炎重病患者的一种可能的治疗方法。然而，要正确使用血清学试验，了解它们的性能特点和局限性是很重要的。此外，正在进行研究，以解决将更好地为这些测试的适当使用提供信息的问题，例如抗体的存在是否传达了可以防止或降低再次感染的严重程度的免疫水平，以及免疫持续的时间。\n这些检测的表现是通过它们的敏感性，或它们识别那些有SARS-CoV-2抗体的人的能力(真阳性率)，以及它们的特异性，或它们识别那些没有SARS-CoV-2抗体的人的能力(真阴性率)来描述的。一个测试的敏感性可以通过确定它是否能够检测到来自已被确认患有新冠肺炎的患者的血液样本中的抗体来估计，这些患者已被证实患有核酸扩增试验，或称NAAT。在这些检测的一些验证研究中，比如美国食品和药物管理局与美国国立卫生研究院、美国疾病控制与预防中心和美国疾病控制与预防中心合作进行的研究中，使用的样本除了来自经NAAT确认患有新冠肺炎的患者外，还可能通过其他血清学测试证实存在抗体。检测的特异性可以通过检测在SARS-CoV-2已知已经传播之前收集和冷冻的大量样本来估计，以证明该检测不会产生阳性结果，以应对呼吸道感染的其他原因，如其他冠状病毒的存在。\n这些对敏感度和特异度的估计仅仅是：估计。它们包括95%的置信区间，这是我们大约95%确定一项测试的灵敏度和特异性将落在给定的在性能验证中使用的样本数量的估计范围。用来验证一项测试的样本越多，置信区间就越小，这意味着我们可以对所提供的灵敏度和特异性的估计更有信心。\n测试也用它们的正负预测值(PPV和NPV)来描述。这些措施是使用测试的敏感性、特异性和对人群中具有SARS-CoV-2抗体的个人百分比的假设(在这些计算中称为流行率)来计算的。每次测试都会返回一些假阳性和假阴性结果。PPV和NPV帮助那些解释这些检测的人了解，考虑到携带抗体的个体在人群中是多么普遍，从检测中获得阳性结果的人真的有多大可能真的有SARS-CoV-2抗体，以及从检测中得到阴性结果的人真的没有对SARS-CoV-2抗体的可能性有多大。一项测试的PPV和NPV在很大程度上取决于该测试要检测的流行程度。由于所有检测都会返回一些假阳性和一些假阴性结果，包括检测SARS-CoV-2抗体的测试，因此广泛使用这些测试，如果没有得到其他相关信息的适当信息，如临床病史或诊断测试结果，可能会识别出太多的假阳性个人。\n我们目前不知道SARS-CoV-2抗体阳性个体在美国人口中的流行率，流行率可能会根据病毒在美国停留的时间和缓解措施的有效性而变化。此外，由于感染率不同，不同地点和不同人群(如卫生保健工作者)的流行率可能有很大差异。在低流行率人群中，这将是大部分无症状的普通人群，单一抗体测试的结果不太可能足够准确，不足以做出关于个人是否以前有过感染或确实有病毒抗体的知情决定。第二次测试，通常是评估是否存在不同病毒蛋白的抗体，通常需要进行第二次测试，以提高整体检测的准确性。\n开发者：Vibrant美国临床实验室测试：Vibrant新冠肺炎抗体分析技术：高通量CLIA目标：尖峰和核衣壳。\n开发人员：纽约州卫生部沃兹沃斯中心测试：纽约SARS-CoV抗体检测技术的微球免疫分析：MIA目标：核衣壳。\n在某些情况下，本页上的数字与使用说明中的数字可能存在细微差异。本页显示的敏感性和特异性的置信区间是按照CLSI EP12-A2(2008)中描述的评分方法计算的。请参阅公认的共识标准。PPV和NPV的置信区间是使用敏感性和特异性的95%置信区间的值来计算的。", "note_en": "Serology tests detect the presence of antibodies in the blood when the body is responding to a specific infection, like COVID-19. In other words, the tests detect the body&#39;s immune response to the infection caused by the virus rather than detecting the virus itself. In the early days of an infection when the body&#39;s immune response is still building, antibodies may not be detected. This limits the test&#39;s effectiveness for diagnosing COVID-19, and this is one reason serology tests should not be used as the sole basis to diagnose COVID-19. Serology tests could play a role in the fight against COVID-19 by helping healthcare professionals identify individuals who may have developed an immune response to SARS-CoV-2. In addition, these test results can aid in determining who may donate a part of their blood called convalescent plasma, which may serve as a possible treatment for those who are seriously ill from COVID-19. However, to use serology tests properly, it is important to understand their performance characteristics and limitations. Moreover, studies are underway to address questions that will better inform the appropriate use of these tests, such as whether the presence of antibodies conveys a level of immunity that would prevent or reduce the severity of re-infection as well as the duration for which immunity lasts.\n The performance of these tests is described by their &#34;sensitivity,&#34; or their ability to identify those with antibodies to SARS-CoV-2 (true positive rate), and their &#34;specificity,&#34; or their ability to identify those without antibodies to SARS-CoV-2 (true negative rate). A test&#39;s sensitivity can be estimated by determining whether or not it is able to detect antibodies in blood samples from patients who have been confirmed to have COVID-19 with a nucleic acid amplification test, or NAAT. In some validation studies of these tests, like the one FDA is conducting in partnership with NIH, CDC, and BARDA, the samples used, in addition to coming from patients confirmed to have COVID-19 by a NAAT, may also be confirmed to have antibodies present using other serology tests. A test&#39;s specificity can be estimated by testing large numbers of samples collected and frozen before SARS-CoV-2 is known to have circulated to demonstrate that the test does not produce positive results in response to the presence of other causes of a respiratory infection, such as other coronaviruses.\n These estimates of sensitivity and specificity are just that: estimates. They include 95% confidence intervals, which are the range of estimates we are about 95% sure a test&#39;s sensitivity and specificity will fall within given how many samples were used in the performance validation. The more samples used to validate a test, the smaller the confidence interval becomes, meaning that we can be more confident in the estimates of sensitivity and specificity provided.\n Tests are also described by their Positive and Negative Predictive values (PPV and NPV). These measures are calculated using a test&#39;s sensitivity, its specificity, and using an assumption about the percentage of individuals in the population who have antibodies to SARS-CoV-2 (which is called &#34;prevalence&#34; in these calculations). Every test returns some false positive and false negative results. The PPV and NPV help those who are interpreting these tests understand, given how prevalent individuals with antibodies are in a population, how likely it is that a person who receives a positive result from a test truly does have antibodies to SARS-CoV-2 and how likely it is that a person who receives a negative result from a test truly does not have antibodies to SARS-CoV-2. The PPV and NPV of a test depend heavily on the prevalence of what that test is intended to detect. Because all tests will return some false positive and some false negative results, including tests that detect antibodies to SARS-CoV-2, broad use of the tests, when not appropriately informed by other relevant information, such as clinical history or diagnostic test results, could identify too many false-positive individuals.\n We do not currently know the prevalence of SARS-CoV-2 antibody positive individuals in the U.S. population, and prevalence may change based on the duration the virus is in the country and the effectiveness of mitigations. Moreover, prevalence may vary widely between locations and between different groups of people, such as health care workers, due to different rates of infection. In low prevalence populations, which will be much of the asymptomatic general population, the result of a single antibody test is not likely to be sufficiently accurate to make an informed decision regarding whether or not an individual has had a prior infection or truly has antibodies to the virus. A second test, typically one assessing for the presence of antibodies to a different viral protein, generally would be needed to increase the accuracy of the overall testing results.\n For this page, FDA has summarized the expected performance of the tests it has authorized based on the information FDA reviewed when deciding whether or not to grant these tests an Emergency Use Authorization and assuming a prevalence of 5% for PPV and NPV calculations. For tests that had multiple validation studies or where the tests showed variable performance in samples collected at different times after symptom onset, FDA experts selected the results they considered to be most representative of expected test performance. This is an incomplete representation of the performance of these tests.  Always refer to the complete instructions for use to put these estimates into the proper context and to understand how to use and interpret these tests. FDA also is providing a  calculator that will allow users to see the estimated performance of a single test or two independent tests based on their performance characteristics and the estimated prevalence of SARS-CoV-2 antibodies in the target population.\n                                                              Developer: Mount Sinai Hospital Clinical Laboratory  Test: Mt. Sinai Laboratory COVID-19 ELISA Antibody Test  Technology: 2-Step ELISA  Target: Spike\n            Developer: Ortho-Clinical Diagnostics, Inc.  Test: VITROS Immunodiagnostic Products Anti-SARS-CoV-2 Total Reagent Pack and Calibrator  Technology: High Throughput CLIA  Target: Spike\n                        Developer: Vibrant America Clinical Labs  Test: Vibrant COVID-19 Ab Assay  Technology: High Throughput CLIA  Target: Spike and Nucleocapsid\n      Developer: Wadsworth Center, New York State Department of Health  Test: New York SARS-CoV Microsphere Immunoassay for Antibody Detection  Technology: MIA  Target: Nucleocapsid\n      In some cases, there may be minor differences between the numbers on this page and those in the instructions for use. Confidence intervals for sensitivity and specificity that appear on this page were calculated per a score method described in CLSI EP12-A2 (2008). See  Recognized Consensus Standards. Confidence intervals for PPV and NPV were calculated using the values from the 95% confidence intervals for sensitivity and specificity.", "posttime": "2020-06-12 08:32:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,授权,authorized,测试", "title": "EUA授权血清学检测性能", "title_en": "EUA Authorized Serology Test Performance", "transed": 1, "url": "https://www.fda.gov/medical-devices/emergency-situations-medical-devices/eua-authorized-serology-test-performance", "via": "", "real_tags": ["性能", "授权", "测试"]}, {"category": "", "categoryclass": "", "imagename": "e429a44de42010cf22347d1e3da3623f.jpg", "infoid": 1006235, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "田纳西州诺克斯维尔市在夜间发生勒索软件攻击后，被迫关闭了整个计算机网络。勒索软件攻击的目标是该市的办公室。\n诺克斯维尔的人口超过18万，是田纳西州仅次于纳什维尔和孟菲斯的第三大城市，也是诺克斯维尔大都会统计区的一部分，据报道，2015年人口近87万。\n据诺克斯维尔首席运营官大卫·布雷斯(David Brace)表示，诺克斯维尔网络上的电脑一夜之间就被加密了，6月11日凌晨4点30分左右，该市消防部门的员工注意到了这次攻击。\n请注意，我们的网络遭到了勒索软件的攻击，周四上午发给该市员工的一份通知写道。\n信息系统目前遵循推荐的协议。这包括关闭服务器、我们的互联网连接和PC。请不要在此时登录网络或使用计算机应用程序。&#34；\n虽然诺克斯维尔市官方网站在本文发表时仍处于停机状态，但诺克斯县政府的计算机操作并未受到攻击的影响。\n在勒索软件攻击和计算机网络关闭后，市法院的开庭时间也被取消，一旦系统恢复，开庭日期将被重置。\n据DJ·科克伦(D.J.Corcoran)和斯科特·埃兰德(Scott Erland)的发言人表示，事件发生后，该市消防局和警察局的行动没有受到影响，但工作人员无法访问该市的网络。\n诺克斯维尔发言人埃里克·弗里兰在接受WBIR采访时表示，伦敦金融城没有存储信用卡信息，因此在网上预订伦敦金融城设施的个人不会面临风险。\n诺克斯维尔：在对市政府办公室的勒索软件攻击中，没有获取个人信息。首席运营官大卫·布雷斯(David Brace)明确表示，没有个人信息被访问。我会在@6News pic.twitter.com/lPXksVAXMv上看到最新的#WATE@，从4点开始。\n-Madisen Keavy(@madisenkeavy)2020年6月11日。\n该市向联邦调查局(FBI)报告了勒索软件攻击事件，目前正在与田纳西州调查局合作，作为正在进行的事件调查的一部分。\n市政府发言人告诉WATE 6。市政府各部门正在进行相应的调整，以满足居民和企业的需求，但市政府办公室和服务都照常开放，尽管来市政府办公室的游客可能会遇到一些不便。“(市政府发言人告诉WATE 6。&34；市政府部门正在进行相应的调整，以满足居民和企业的需求。)”\n首席运营官大卫·布雷斯(David Brace)表示，此次袭击背后的威胁分子也要求为每条诺克斯新闻支付赎金，但他拒绝透露具体金额。\n诺克斯县市长还在推特上就该市的勒索软件攻击发表了一份声明，称无论防御多么出色，任何人或任何政府都可能遭受网络攻击。在很多情况下，这不是是否的问题，而是何时的问题。\n目前，对这次攻击负责的勒索软件组织仍不清楚，但我们会在得到更多信息后立即更新文章。\n2018年5月，诺克斯县受到另一次网络攻击的影响，当时诺克斯维尔的诺克斯县政府在发生分布式拒绝服务(DDoS)攻击后，在地方选举期间一些服务器被切断。\n今晚，我们的网络服务器遭受了成功的拒绝服务攻击。选举结果没有受到影响，因为我们的选举机器从来没有连接过互联网。我们的工作人员正在努力遏制攻击，并继续在https://t.co/aH2Pdne56k.发布选举申报单。\n-诺克斯公司政府(@knoxgov)2018年5月2日", "note_en": "The City of Knoxville, Tennessee, was forced to shut down its entire computer network following a ransomware attack that took place overnight and targeted the city&#39;s offices.\n Knoxville has a population of over 180,000, it&#39;s Tennessee&#39;s third-largest city after Nashville and Memphis, and it&#39;s also part of the Knoxville Metropolitan Statistical Area, with a reported population of almost 870,000 in 2015.\n  Computers on Knoxville&#39;s network were encrypted overnight, with the attack being noticed by employees of the city&#39;s fire department around 4:30 AM, June 11, according to Chief Operations Officer David Brace.\n &#34;Please be advised that our network has been attacked with ransomware,&#34; a notice sent to city employees on Thursday morning reads.\n &#34;Information Systems is currently following recommended protocols. This includes shutting down servers, our internet connections, and PCs. Please do not log in to the network or use computer applications at this time.&#34;\n While the  City of Knoxville official website was still down at the time this article was published, Knox County government computer operations have not been affected in the attack.\n City Court sessions have also been canceled after the ransomware attack and the computer network shut down, with court dates to be reset once the systems are restored.\n  The city&#39;s Fire Department and Police Department operations are not affected following the incident according to spokesmen D.J. Corcoran and Scott Erland, but personnel cannot access the city&#39;s network.\n  &#34;No credit card information is stored by the City, so individuals who have made any online reservations of City facilities are not believed to be at risk,&#34; Knoxville spokesman Eric Vreeland told  WBIR.\n Knoxville: No personal info accessed in ransomware attack on city offices.  Chief Operating Officer David Brace made it clear, no personal information was accessed.  I&#39;ll have the latest on  #WATE @ starting at 4 on  @6News  pic.twitter.com/lPXksVAXMv\n— Madisen Keavy (@madisenkeavy)  June 11, 2020\n The city reported the ransomware attack o the Federal Bureau of Investigation (FBI) and is currently working with the Tennessee Bureau of Investigation as part of an ongoing incident investigation.\n &#34;City offices and services are open and available as usual, though visitors to City offices may encounter some inconveniences,&#34; a city spokesperson told  WATE 6. &#34;City departments are adjusting accordingly to address the needs of residents and businesses.”\n Chief Operations Officer David Brace said that the threat actors behind this attack have also asked for a ransom to be paid per  knox news, but he refused to give the exact amount.\n Knox County Mayor also  issued a statement on the city&#39;s ransomware attack on Twitter saying that &#34;[c]yber attacks can happen to anyone or any government no matter how good the defense is. In a lot of cases it’s not a matter of if but a matter of when.&#34;\n  At the moment, the ransomware group responsible for this attack is still unknown but we will update the article as soon as we have more information.\n Knox County was affected by another cyberattack in May 2018 when the Knox County Government in Knoxville had some of its servers knocked offline during a local election following a distributed denial-of-service (DDoS) attack.\n Tonight, Our web servers suffered a successful denial of service attack. Election results were not affected, as our election machines are never connected to the Internet. Our staff is working to contain the attack &amp; continue releasing election returns at  https://t.co/aH2Pdne56k.\n— Knox Co. Government (@KnoxGov)  May 2, 2018", "posttime": "2020-06-12 08:15:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,knoxville,攻击", "title": "诺克斯维尔市在勒索软件攻击后关闭网络", "title_en": "City of Knoxville Shuts Down Network After Ransomware Attack", "transed": 1, "url": "https://www.bleepingcomputer.com/news/security/city-of-knoxville-shuts-down-network-after-ransomware-attack/", "via": "", "real_tags": ["软件", "knoxville", "攻击"]}, {"category": "", "categoryclass": "", "imagename": "dae30d8d858959e197be917040d88595.jpg", "infoid": 1006234, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人民大学，是第一所非营利性、免学费、在线认证的美国大学，了解更多关于", "note_en": "University of the People, is the first non-profit, tuition-free, online accredited American university, learn more about the", "posttime": "2020-06-12 07:57:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,大学,people,美国大学", "title": "人民大学：免费、经认可的在线学位课程", "title_en": "University of the People: Tuition-Free, Accredited Online Degree Programs", "transed": 1, "url": "https://www.uopeople.edu/", "via": "", "real_tags": ["免费", "大学", "people", "美国大学"]}, {"category": "", "categoryclass": "", "imagename": "da084bf51c794403fb2eea8b2c72e18d.jpeg", "infoid": 1006233, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "汽车租赁公司赫兹全球控股公司(Hertz Global Holdings Inc.)。希望利用本周早些时候出现的股价反弹，出售高达10亿美元的股票，尽管破产有可能将它们抹去。\n本周早些时候，赫兹的股价涨至5.53美元，比该公司5月22日申请破产后56美分的收盘价上涨了近10倍。", "note_en": "Rental-car company Hertz Global Holdings Inc. wants to capitalize on the rally in its stock seen earlier this week by selling up to $1 billion in shares, despite a bankruptcy that threatens to wipe them out.\n  Hertz’s shares rose to $5.53 earlier this week, a nearly 10-fold increase over their closing price of 56 cents following the company’s May 22 bankruptcy filing.", "posttime": "2020-06-12 07:57:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "赫兹,hertz,破产", "title": "破产的赫兹希望出售高达10亿美元的新股", "title_en": "Bankrupt Hertz Wants to Sell Up to $1B in New Shares", "transed": 1, "url": "https://www.wsj.com/articles/bankrupt-hertz-wants-to-sell-up-to-1-billion-in-new-shares-11591917121", "via": "", "real_tags": ["赫兹", "hertz", "破产"]}, {"category": "", "categoryclass": "", "imagename": "af69fee01023d64db8002bc08093b936.jpg", "infoid": 1006230, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的100万年里，人类人口史上发生了一些奇怪的事情。首先，我们的数量降到了18500只，我们的祖先比黑猩猩和大猩猩更濒危。然后我们反弹到非同寻常的水平，远远超过了其他类人猿。\n根据世界野生动物基金会(World Wildlife Fund)的数据，今天大猩猩、黑猩猩、黑猩猩和猩猩的总数估计只有50万左右。许多物种处于极度濒危状态。与此同时，人口已激增至77亿。具有讽刺意味的是：我们惊人的繁衍能力现在威胁到了包括我们在内的许多物种的长期可持续性。\n发生了什么？为什么我们生活在人类世，而不是一个类似于人猿星球的世界？我们大约99%的DNA与我们的类人猿表亲、黑猩猩和矮黑猩猩共享。那么，是什么让我们与我们最亲密的亲戚不同，使我们拥有惊人的繁殖和生存能力呢？\n作为一名进化论人类学家，这些问题让我在墨西哥的尤卡泰克·玛雅人、委内瑞拉的普梅狩猎采集者和马达加斯加的塔纳拉农学家中生活和学习。我的研究与基因数据和其他研究相结合，提供了一些线索，揭示了在遥远的过去，是什么让人类如此成功-无论是好是坏。\n在20世纪70年代，墨西哥尤卡坦半岛与世隔绝的Xculoc村庄是大约300名玛雅人的家园。种植玉米的居民没有电，也没有自来水。妇女们用绳子和水桶从50米深的井里拉水。他们用手摇的研磨机研磨玉米--他们的主食。\n然后引入了两项技术，改变了这些玛雅人的生活，并最终改变了他们的人口：一台燃气水泵和两台燃气玉米研磨机。\n使用这些设备，年轻女性每天节省了大约两个半小时的劳动力和325卡路里的热量。此外，年幼的兄弟姐妹可以更容易地取水和碾碎玉米，解放了他们姐姐的时间，实际上减少了他们每天的繁重工作。这一点很重要，因为研究发现，繁重的自给自足工作会抑制卵巢功能，而减少分娩和提高女性的能量平衡与生育率的提高有关。\n随后，徐克洛克的妇女第一次生育的年龄下降了两岁。根据我的长期研究，在这些机器到来后开始生育的女性比前几代人产生的家庭要大得多。到2003年，在20世纪70年代开始生育的女性有了8到12个孩子。\n节省妇女的时间和精力是增加人口的核心。人类已经发展出许多不同于我们的类人猿亲戚的技术和社会方式来实现这一点。\n值得注意的是，科学家在将当代人或类人猿与我们的远古祖先进行直接类比时必须谨慎。但是现代人和灵长类动物是我们最好的工具，用来推断我们的数字成功的基础可能是如何演变的。\n在进化道路上的某个地方，人类开始青睐新的生育和抚养后代的方式。母亲们很早就开始给婴儿断奶。在现代社会，婴儿依赖母亲的母乳，而不是奶瓶喂养，婴儿要哺乳两到三年。相比之下，大猩猩妈妈要哺育她们的幼崽四到六年。\n母乳喂养的卡路里费用很高。一位母亲每天要多摄入600卡路里的热量才能产奶。所以，她越早停止哺乳，就能越早从生理上支持另一次怀孕。在没有避孕措施的现代社会，母亲平均每三年分娩一次。其他类人猿的出生间隔可能长达六到八年。\n我们的远古祖先也喂养、庇护和照顾那些断奶但仍在生长的幼崽。这给了它们更好的生存机会，而非人类的大猩猩幼崽在断奶后会自己照顾自己。今天，生活在狩猎采集社会的孩子活到15岁的可能性是野生黑猩猩的两倍。\n与早期的原始人相比，新颖的育儿方式意味着人类母亲处于一种独特的境地，即同时要照顾多个不同年龄的受抚养人。我无法强调这在多大程度上将人类母亲和孩子与其他类人猿区分开来。\n有很多孩子对这个物种的成功是很好的。但有个问题。母亲们一天中没有足够的时间全职照顾她们的婴儿，同时还要照顾年长的孩子。这一点尤其正确，因为人类饮食的独特方面给母亲们带来了许多需要处理的任务。\n当这些古老的生活史特征进化时，我们的祖先以狩猎采集为生，他们通常吃各种各样的食物，包括水果、坚果、块茎、根、大大小小的猎物、鸟类、爬行动物、蛋、昆虫、鱼和贝类。拼凑这样的菜单需要现代狩猎采集者平均每天旅行13公里。相比之下，黑猩猩和大猩猩平均每天漫游2公里。\n更重要的是，狩猎-采集者对他们的大部分食物进行加工，以使其更易于消化或提高营养的生物利用率。正如每个做饭的人都知道的那样，这需要相当长的时间。\n在来自委内瑞拉大草原的Pumé狩猎采集者中，女性每天大约花三个小时敲碎、捣碎、研磨、敲打、筛分、筛选、屠宰和烹饪食物。生活在中非伊图里森林的埃菲妇女-狩猎-采集者也是如此。\n除了准备时间之外，Pumé和Efe还花了几个小时寻找食物，然后把材料带回营地。此外，每项加工任务都需要专门的技术，这意味着必须有人收集原材料和制造工具。！南部非洲卡拉哈里沙漠的功夫男女每天花大约一个小时制作和修理工具。稀树草原上的女性花在工具制作上的时间将近两个小时--是男性的两倍。\n狩猎采集者还建造庇护所和壁炉，以提供一个安全的地方来加工食材，储存食物和工具，并留下可能太小而不能陪同其他人进行长途觅食的孩子。此外，他们还必须运水、劈柴、穿衣服，并维护获取地理上分散的资源所需的社会和信息网络。\n对于任何一个人来说，一天中没有足够的时间来完成所有这些事情。所以，我们的祖先想出了一个解决方案。\n这个解决方案是合作，但不是许多物种参与的那种分担任务的方式。狩猎-采集者发展了一种称为代际合作的独特特征：父母帮助孩子，孩子帮助父母。\n这不是我们和其他类人猿共有的特征，它们不太擅长分享食物，不擅长帮助不是自己亲生的母亲或后代，甚至不擅长在自己的孩子达到一定年龄后赡养他们自己的孩子。一旦断奶，非人类的类人猿母亲很少与他们的幼年后代分享食物，而且幼猿也不会给他们的母亲提供食物。\n但在人类中，代际合作意味着确实需要一个村庄来抚养孩子。在不同的文化中，狩猎采集和农业社会的母亲只提供婴儿直接护理的一半左右。例如，除了母亲之外，稀树草原上的婴儿平均有9名照顾者。EFE婴儿平均有11个。\n父亲和祖父母在养家糊口方面肯定扮演着重要的角色。但这还不够。玛雅母亲的平均年龄是60岁，到她最后一个孩子离开家时，所以在那之后她只有很少的几年时间可以做保姆或收集食物的祖母了。\n我的研究表明，一个更明显的帮助来源被忽视了：儿童。在许多文化中，除了母亲之外，儿童提供了大部分的儿童护理。而7到10岁的孩子承担了大部分的保姆工作。\n孩子们还负责处理大部分食物和料理家务。一个Pumé男孩每天平均带回家4.5公斤的野果。这相当于3200卡路里-足以养活他自己和至少他的一些家人。(这还不包括他在野外做的任何零食。)。他的妹妹可以带回家超过一公斤的根(价值约4000卡路里)-其中一些她会吃，但大部分是她分享的。在东非的哈扎族狩猎采集者中，孩子们每天觅食5到6个小时。到5岁时，他们可以在某些季节提供大约50%的自己的卡路里。\n农业社区的孩子也是勤劳的工人。尤卡特克·玛雅的年龄在7岁到14岁之间，每天花2到5个小时做家务和实地工作。15岁至18岁的青少年每天工作约6.5小时-与他们的父母一样多。\n到玛雅母亲40岁时，她家里平均有7个孩子。这些孩子每天总共贡献了20个小时的工作，提供了家庭消费的60%。\n多亏了这种多代人的帮助，女性可以花时间做只有她才能做的事情：多生孩子。因此，儿童增加了人口，但他们的劳动力也是推动社区生育和加快生殖的内在引擎。\n随着代际合作和多样化的饮食策略，我们的祖先繁衍并经受住了人口瓶颈。1800年刚过，人口就达到了10亿。\n随后，全球人口呈指数级增长，主要是因为婴儿和老年人的存活率都有所提高。1927年达到20亿，1960年达到30亿，1974年达到40亿，1987年达到50亿，1999年达到60亿，2011年达到70亿，今天超过77亿。这些数字作为一个进化之谜引起了我的兴趣，并作为一个当代问题深深地关注着我。不过，毫无疑问，人类已经取得了令人难以置信的成功。问题是：我们还能保持这种成功多久，并且仍然是可持续的？答案就像我们过去的增长秘诀一样，站在合作的肩膀上。\n*编者按：这篇文章的大部分内容来自她第47次JAR杰出演讲，题为“我们是如何变得如此众多的”，该演讲发表在2019年冬季的“人类学研究杂志”(Journal Of Anthropolical Research)上。", "note_en": "Something curious happened in human population history over the last 1 million years. First, our numbers fell to  as low as 18,500 , and our ancestors were more endangered than chimpanzees and gorillas. Then we bounced back to extraordinary levels, far surpassing the other great apes.\n Today the total population of gorillas, chimpanzees, bonobos, and orangutans is estimated to be only around 500,000, according to the  World Wildlife Fund. Many species are critically endangered. Meanwhile, the human population  has surged to 7.7 billion. And the irony is: Our astonishing ability to multiply now threatens the long-term sustainability of many species, including ours.\n What happened? Why do we live in the Anthropocene and not a world resembling   Planet of the Apes? We share around 99 percent of our DNA with our great ape cousins, chimpanzees and bonobos. So, what makes us different from our closest relatives that gives us our staggering capacity for reproducing and surviving?\n As an evolutionary anthropologist, these questions have led me to live and study among the Yucatec Maya of Mexico, the Pumé hunter-gatherers of Venezuela, and the Tanala agriculturalists of Madagascar. My research, * combined with genetic data and other studies, offers clues to what developed in the deep past that has made humans so successful—for better or for worse.\n  In the 1970s, the isolated village of Xculoc, in Mexico’s Yucatan Peninsula, was home to about 300 Maya people. The maize-farming residents had no electricity or running water. Women hauled water from a 50-meter-deep well using ropes and buckets. They ground maize—the mainstay of their diet—in hand-cranked grinders.\n Then two technologies were introduced that changed these Maya’s lives and, ultimately, their population: a gas-powered water pump and two gas-powered maize grinders.\n Using these devices, young women saved about two and a half hours of labor and 325 calories a day. In addition, younger siblings could more easily fetch water and crush maize, freeing up their older sisters’ time and literally decreasing their daily grind. That’s important because studies have found that heavy subsistence work  suppresses ovarian function, whereas reducing labor and raising women’s energy balance is associated with a bump in fertility.\n  Subsequently, the age at which women in Xculoc first gave birth dropped by two years. And according to my long-term research, women who started childbearing after these machines arrived produced significantly larger families than prior generations. By 2003, women who started reproducing in the 1970s had eight to 12 children.\n Saving women time and energy is central to increasing the population. And humans have developed numerous technological and social ways of accomplishing this that differ from our great ape relatives.\n It’s important to note that scientists must be cautious about drawing direct analogies between contemporary people or apes and our ancient ancestors. But modern humans and primates are our best tools for inferring how the underpinnings of our numerical success may have evolved.\n Somewhere along the evolutionary road, humans started to favor new ways of having and raising their young. Mothers began weaning their infants earlier. In modern societies where infants rely on their mother’s milk and not bottle feeding, babies nurse for two to three years. By contrast, great ape mothers nurse their young for four to six years.\n Breastfeeding is calorically expensive. It takes a mother about 600 extra calories a day to produce milk. So, the sooner she stops nursing, the sooner she can biologically support another pregnancy. In modern societies without contraception, mothers give birth on average every three years. Other great apes may wait as many as six to eight years between births.\n Our ancient ancestors also fed, sheltered, and cared for youngsters who were weaned but still growing. This gave them a better chance at surviving than nonhuman great ape young, which fend for themselves after they’re weaned. Today a child living in a hunter-gatherer society is twice as likely as a wild chimpanzee to survive to age 15.\n Novel ways of parenting, compared to earlier hominins, meant human mothers were in the unique situation of having multiple dependents of different ages to care for at the same time. I cannot underscore enough how much this sets human mothers and children apart from the other great apes.\n Having lots of kids is great for the success of the species. But there’s a hitch. Mothers don’t have enough hours in the day to care for their babies full time while providing for their older offspring. That’s especially true because the unique aspects of the human diet give mothers a lot of tasks to juggle\n When these ancient life history traits were evolving, our ancestors made their living as hunter-gatherers, who typically eat diverse fare, including fruits, nuts, tubers, roots, large and small game, birds, reptiles, eggs,  insects, fish, and shellfish. Cobbling together such a menu requires modern hunter-gatherers to travel, on average, 13 kilometers per day. By contrast, chimpanzees and gorillas roam, on average, 2 kilometers per day.\n What’s more, hunter-gatherers process most of their food to make it more digestible or to boost the bioavailability of nutrients. And as everyone who prepares food knows, that takes a significant amount of time.\n Among the Pumé hunter-gatherers from the savannas of Venezuela, women spend about three hours a day cracking, mashing, grinding, pounding, sifting, winnowing, butchering, and cooking food. The same is true of Efe women—hunter-gatherers living in the Ituri forest of Central Africa.\n That prep time is in addition to the hours the Pumé and Efe spend foraging and then carrying ingredients back to camp. Furthermore, each processing task requires a specialized technology, which means someone has to collect raw materials and make tools. !Kung women and men in the Kalahari Desert of Southern Africa spend about an hour each day making and repairing tools. Savanna Pumé women devote nearly two hours to toolmaking—twice as much as the men.\n  Hunter-gatherers also build shelters and hearths to provide a safe place to process ingredients, to store food and tools, and to leave children who may be too young to accompany others on long foraging trips. Plus, they must haul water, chop firewood, fashion clothing, and maintain the social and information networks needed to access geographically dispersed resources.\n There are simply not enough hours in the day for any one person to accomplish all this. So, our ancestors came up with a solution.\n That solution was cooperation—but not the kind of task-sharing many species engage in. Hunter-gatherers developed a distinct feature called intergenerational cooperation: Parents help kids,  and children help parents.\n This is not a trait we share with the other great apes, who aren’t particularly good at sharing food, helping mothers or offspring who aren’t their own, or even supporting their own children after they reach a certain age. Nonhuman great ape mothers rarely share meals with their juvenile offspring once they’re weaned, and juvenile apes don’t offer food to their moms.\n But among humans, intergenerational cooperation means it really does take a village to raise a child. Across cultures, mothers in hunter-gatherer and agricultural societies offer only about half of the direct care an infant receives. Savanna Pumé infants, for example, have an average of nine caretakers besides their mother. Efe infants have an average of 11.\n Fathers and grandparents certainly play important roles in supporting their families. But it’s not enough. An average Maya mother is 60 by the time her last child leaves home, so she has very few years after that to be a babysitting or food-collecting grandmother.\n My research suggests a much more obvious source of help has been overlooked: kids. Other than mothers, children provide most of the child care in many cultures. And 7- to 10-year-olds do the bulk of the babysitting.\n Children are also responsible for processing much of the food and running the household. A Pumé boy carries home an average of 4.5 kilograms of wild fruit on days he forages. That’s the equivalent of 3,200 calories—enough to feed himself and at least some of his family. (And that’s in addition to any snacking he does in the field.) His sister can bring home more than a kilogram of roots (worth about 4,000 calories)—some of which she will eat, but most of which she shares. Among the Hadza hunter-gatherers of East Africa, children forage for five to six hours a day. By age 5, they can supply about 50 percent of their own calories during some seasons.\n  Children in agricultural communities are also hard workers. Yucatec Maya between the ages of 7 and 14 devote two to five hours a day to domestic and field work. Teens between the ages of 15 and 18 labor about 6.5 hours a day—as much as their parents.\n By the time a Maya mother is 40, she has an average of seven children at home. These children contribute a combined 20 hours of work a day and supply 60 percent of what the family consumes.\n Thanks to this multigenerational help, a woman can spend time doing what only she can do: have more children. So, children increase the population, but their labor is also a built-in engine to fuel their community’s fertility and speed up reproduction.\n With intergenerational cooperation and a diversity of dietary strategies, our ancestors multiplied and weathered population bottlenecks. Just after 1800, the human population hit 1 billion.\n The global population then expanded exponentially, largely due to the enhanced survival of both infants and older people. It reached 2 billion in 1927, 3 billion in 1960, 4 billion in 1974, 5 billion in 1987, 6 billion in 1999, 7 billion in 2011, and today is at over 7.7 billion.   These figures intrigue me as an evolutionary enigma and deeply concern me as a contemporary issue. There is no question, though, that humans have been incredibly successful. The question is: How long can we maintain that success and still be sustainable? The answer, like our secret to growth in the past, stands on the shoulders of cooperation.\n  * Editor’s note: The author derived much of this essay from  her 47th JAR Distinguished Lecture, “How There Got to Be So Many of Us,” which was published in the Winter 2019 issue of the Journal of Anthropological Research .", "posttime": "2020-06-12 07:23:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人类,humans,孩子", "title": "为什么会有这么多人类？", "title_en": "Why Are There So Many Humans?", "transed": 1, "url": "https://www.sapiens.org/evolution/human-population-evolution/", "via": "", "real_tags": ["人类", "humans", "孩子"]}, {"category": "", "categoryclass": "", "imagename": "e8af3eb1278a3c98e68c002d93b289bd.png", "infoid": 1006229, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我接到电话说，在较新的硬件上，一些性能回归测试变慢了。没什么大不了的。通常是Windows中某处的配置不正确，或者某些BIOS设置设置为非最佳值。但这一次，我们找不到一个确实能让性能恢复正常的设置。由于9s与19s的变化不小(蓝色是旧硬件，橙色是新硬件)，我们需要更深入地研究：\n性能从9，1秒下降到19，6秒绝对是非常显著的。我们做了更多的检查，看测试中的软件版本、Windows、BIOS设置是否与旧的基准硬件有所不同。但不是所有的东西都是一样的。唯一的区别是相同的测试在不同的CPU上运行。下面是最新CPU的图片。\nXeon Gold运行在名为Skylake的不同CPU架构上，这是英特尔自2017年年中以来生产的所有CPU通用的架构。*正如评论者指出的那样，消费级Skylake CPU已经于2015年发布。带有SkylakeX的服务器至强CPU于2017年年中发布。所有以后的CPU，卡比湖，…。都有相同的问题。如果您购买的是当前的硬件，您将获得一个采用Skylake CPU架构的CPU。这些都是不错的机器，但正如测试表明的那样，更新和较慢并不是正确的方向。如果所有这些都失败了，那么就得到一个复制品，并使用真正的分析器™来深入挖掘。当您在旧硬件和新硬件上记录相同的测试时，应该会很快到达某个位置：\n请记住，WPA*中的diff视图(Windows Performance Analyzer是免费的评测UI，是Windows SDK的一部分Windows Performance Toolkit的一部分)在表中显示跟踪2(11s)-跟踪1(19s)的增量。因此，表中的负增量表示较慢测试的CPU消耗增加。当我们查看最大的cpu消费者差异时，我们会发现AwareLock：：Configuration、JIT_MonEnterWorker_InlineGetThread_GetThread_PatchLabel和ThreadNative.SpinWait。当线程竞争锁时，一切都指向CPU旋转。但这是假的转移注意力，因为旋转并不是性能降低的根本原因。增加的锁争用意味着我们软件中的某些东西在持有锁时确实变慢了，因此导致更多的CPU旋转。我正在检查锁定时间和其他关键指标，如磁盘等，但我找不到任何相关的东西来解释性能下降的原因。虽然不符合逻辑，但我还是用各种方法重新讨论了增加的CPU消耗。\n找出CPU到底卡在哪里会很有趣。WPA有文件列和行列，但是这些列只适用于私有符号，我们没有这些符号，因为它是.NET Framework代码。其次最好的方法是获取指令所在的DLL地址，该地址称为映像RVA(相对虚拟地址)。当我将相同的DLL加载到调试器中，然后执行。\n然后我应该看到消耗CPU周期最多的指令，它基本上只有一个热地址。\n0：000&gt；u clr.dll+0x195 66B-10clr！AwareLock：：Contention+0x135:00007ff8`0535565b f00f4cc6 lock cmovl eax，esi00007ff8`0535565f 2bf0 subesi，eax00007ff8`05355661 eb01 JMP clr！AwareLock：：争用+0x13f(00007ff8`05355664)00007ff8`05355663 cc int 300007ff。\n0：000&gt；u clr.dll+0x 2801-10clr！JIT_MonEnterWorker_InlineGetThread_GetThread_PatchLabel+0x124:00007ff8`051c27f1 5E POP rsi00007ff8`051c27f2 c3 ret00007ff8`051c27f3 833d0679930001 CMP双字ptr[clr！g_系统信息+0x20(00007ff8`05afa100)]，100007ff8`051c27fa 7e1b jle clr！JIT_MonEnterWorker_InlineGetThread_GetThread_PatchLabel+0x14a(00007ff8`05afa100)\n现在我们有了一个模式。热位置一次是跳转指令，另一次是减法。但是这两个热指令之前都有相同的名为PAUSE的公共指令。由于某些原因，不同的方法执行相同的CPU指令非常耗时。让我们测量一下暂停指令的持续时间，看看我们是否在正确的轨道上。\n暂停在新的Skylake CPU上的速度要慢一个数量级。当然，事情可以变得更快，有时也会慢一点。但是速度要慢10倍以上呢？听起来更像是窃听器。在互联网上搜索一下暂停指令就可以找到英特尔手册，其中明确提到了Skylake微体系结构和暂停指令：\n不，这不是错误，这是一个有文档记录的功能。甚至还存在一个网页，其中包含几乎所有CPU指令的计时。\n这些数字是CPU周期。要计算实际时间，需要将周期数除以CPU频率(通常为GHz)，以得到以ns为单位的时间。\n这意味着当我在最新硬件上的.NET上执行大量多线程应用程序时，速度会变得慢得多。其他人已经在2017年8月注意到了这一点，并为其写了一期：https://github.com/dotnet/coreclr/issues/13388.。该问题已在.NET Core 2.1中修复，.NET Framework 4.8预览也包含该问题的修复。\n改进了几个同步原语中的自旋等待，以便在英特尔Skylake和更新的微体系结构上更好地执行。[495945，mscallib.dll，错误]。\n但是，因为.NET4.8还需要一年时间，所以我已经申请了一个补丁的后端口，以使.NET4.7.2在最新的硬件上恢复速度。由于.NET的许多部分都在使用旋转锁，因此您应该注意Thread.SpinWait和其他旋转方法会增加CPU消耗。\n例如，Task.Result将在内部旋转，我可以在其他测试中看到CPU消耗的显著增加和性能的降低。\n在调用WaitForSingleObject来支付“昂贵的”上下文切换之前，我已经查看了.NET核心代码，当锁没有释放时，CPU将保持旋转多长时间。上下文切换位于微秒范围内，当多个线程都在等待同一内核对象时，上下文切换会变得慢得多。\n.NET Lock将最大旋转持续时间乘以内核数量，这考虑到了完全竞争的情况，即每个内核都有一个线程等待相同的锁，并尝试旋转足够长的时间，以便每个人在支付内核调用费用之前都有机会工作一段时间。在.NET中旋转使用指数回退算法，其中旋转从循环中的50个暂停调用开始，对于每次迭代，旋转数量乘以3，直到下一个旋转计数大于最大旋转持续时间。我已经计算了线程在不同核心数的Pre Skylake CPU和当前Skylake CPU上旋转的总时间：\n/&lt；Summary&gt；/这是.NET在锁争用减去锁获取期间的旋转方式/SwitchToThread/休眠调用/&lt；/Summary&gt；/&lt；param name=&#34；nCores&#34；&gt；&lt；/param&gt；void Spin(Int NCores){const int dwRepltions=10；const int dwInitialDuration=0。i++){int Duration=dwInitialDuration；Do{for(int k=0；k&lt；Do；k++){call_pause()；}Duration*=dwBackOfffactor；}While(Duration&lt；dwMaximumDuration)；}}。\n旧的旋转时间在毫秒范围内(24个内核的旋转时间为19ms)，与总是提到的高成本的上下文切换相比已经相当多了，后者要快一个数量级。但是对于Skylake CPU，争用锁的总CPU旋转时间呈爆炸式增长，我们将在24核或48核计算机上旋转高达246毫秒，这仅仅是因为新的英特尔CPU的延迟将暂停指令增加了14倍。情况真的是这样吗？我已经创建了一个小型测试器来检查完整的CPU旋转，计算出的数字很好地符合我的预期。我有48个线程在一台24核的机器上等待一个锁，在这里我调用Monitor。PulseAll让竞争开始：\n只有一个线程会赢得比赛，但47个线程会旋转，直到放弃。这是一个实验证据，表明我们确实存在CPU消耗的问题，旋转时间过长是一个真正的问题。过度旋转会损害可伸缩性，因为CPU周期会消耗在其他线程可能需要CPU的地方，尽管使用PAUSE指令会在“休眠”时间更长的情况下释放一些共享的CPU资源。旋转的原因是为了在不进入内核的情况下快速获取锁。如果这是真的，增加的CPU消耗在任务管理器中可能看起来不太好，但只要还有内核可供其他任务使用，就不会影响性能。但是测试表明，几乎单线程操作(其中一个线程向工作队列添加一些内容，而工作线程等待工作，然后对工作项执行某些任务)会变慢。\n这其中的原因可以用图表来最好地说明。争用锁的旋转是在每个步骤之后旋转三倍的步骤中进行的。在每次旋转之后，锁再次检查当前线程是否可以获得它。在旋转时，锁试图保持公平，并不时切换到其他线程，以帮助其他线程完成其工作。这增加了我们稍后再次检查时锁被释放的可能性。问题是，只有在一个完整的旋转回合完成锁定之后，才能检查是否可以进行以下操作：\n例如，如果在旋转第五轮期间，锁定在我们开始第五轮之后立即发出信号，我们将等待完整的旋转循环，直到我们可以获得锁定。通过计算最后一轮的旋转持续时间，我们可以估计线程可能出现的最坏延迟情况：\n这是我们可以等待很多毫秒，直到旋转完成。这真的是个问题吗？\n我已经创建了一个简单的测试应用程序，它实现了生产者消费者队列，其中工作线程为每个工作项工作10ms，消费者在发送下一个工作项之前有1-9ms的延迟。这足以看到效果：\n我们看到，对于一些发送者线程延迟为1毫秒和2毫秒，总持续时间为2，2s，而对于其他时间，我们的速度是大约1，2s的两倍。这表明过度的CPU旋转不仅是一个表面上的问题，它只会严重损害多线程应用程序，而且还会影响只涉及两个线程的简单生产者-消费者线程。对于上面的运行，ETW数据本身就说明CPU旋转增加确实是观察到的延迟的原因：\n当我们放大到慢速部分时，我们发现红色的旋转时间为11毫秒，尽管工人(浅蓝色)已经完成了工作，并且很久以前就已经归还了锁。\n快速非退化的情况看起来要好得多，其中只有1ms用于锁的旋转。\n我使用的测试应用程序名为SkylakeXPause，位于https://1drv.ms/u/s！AhcFq7XO98yJgsMDiyTk6ZEt9pDXGA，其中包含一个压缩文件，其中包含.NET Core和.NET4.5的源代码和二进制文件。我实际做的比较是在Skylake机器上安装了.NET4.8Preview，它包含了补丁，以及.NETCore2.0，它仍然实现了旧的旋转行为。该应用程序的目标是.NET Standard 2.0和.NET4.5，它们会生成一个exe和一个DLL。现在我可以并排测试新旧的旋转行为，而不需要修补任何东西，这非常方便。\nreadonly object_LockObject=new object()；int WorkItems；int CompletedWorkItems；Barrier SyncPoint；void RunSlowTest(){const int processingTimeinms=10；const int WorkItemsToSend=100；Console.WriteLine($&#34；Worker线程工作{processingTimeinms}ms，{WorkItemsToSend}次&#34；)；//测试一个发送方和一个接收方线程。确保Worker首先启动Double[]sendDelayTimes={1，2，3，4，5，6，7，8，9}；foreach(Var SendDelay In SendDelayTimes){SyncPoint=new Barrier(2)；//一个发送者一个接收者var sw=Stopwatch.StartNew()；Parallel.Invoke(()=&gt；Sender(workItems：WorkItemsToSend，delayInms：Console.WriteLine($&#34；发送延迟：{sendDelay：f1}毫秒工作在{sw.Elapsed.TotalSeconds：F3}s&#34；)；Thread.Sept(100)；//显示ETW数据中的一些差距，以便我们可以区分测试运行}}/&lt；Summary&gt；/模拟消耗由发送方线程触发的CPU的工作线程/&lt；/Summary&gt；void worker(int maxWorkItemsToWorker。While(CompletedWorkItems！=maxWorkItemsToWork){lock(_LockObject){if(WorkItems==0){Monitor or.Wait(_LockObject)；//等待工作}for(int i=0；i&lt；WorkItems；i++){CompletedWorkItems++；SimulateWork(WorkItemProcessTimeInms)；//消耗此锁下的CPU}WorkItm/在锁下插入工作线程的工作，唤醒工作线程n次/&lt；/Summary&gt；void Sender(int workItems，Double delayInms){CompletedWorkItems=0；//删除前一工作SyncPoint.SignalAndWait()；for(int i=0；i&lt；workItems；i++){lock(_LockObject){WorkItems++；Monitor or.PulseAll(_LockObject)；}SimulateWork(DelayInms)；}}。\n这不是.NET问题。它会影响所有使用暂停指令的自旋锁定实现。我已经对Server2016的Windows内核进行了快速检查，但没有发现类似的问题。看起来英特尔很友好地给了他们一个暗示，需要在旋转策略上做出一些改变。\n当该问题于2017年8月报告给.NET Core时，即2017年9月，该问题已通过.NET Core 2.0.3(https://github.com/dotnet/coreclr/issues/13388).)修复并推出。这不仅是因为.NET核心团队的反应速度令人惊叹，而且这个问题在几天前也已经在Mono分支上得到了解决，关于更多旋转改进的讨论正在进行中。不幸的是，桌面.NET Framework的发展速度没有那么快，但至少我们在.NET Framework4.8预览版中至少有一个概念证明，修复程序在那里也可以工作。现在我正在等待.NET4.7.2的后端口，以便能够在最新的硬件上全速使用.NET。这是我的第一个bug，它与一条CPU指令中的性能变化直接相关。ETW仍然是Windows上的首选评测工具。如果我有一个愿望，我会让微软把ETW基础设施移植到Linux上，因为当前的性能工具在Linux上仍然很糟糕。有一些我\n如果您在2017年年中以后生产的CPU上运行.NET Core 2.0或桌面.NET Framework，如果您因此问题而运行速度较慢，则绝对应该使用分析器检查您的应用程序，并升级到更新的.NET Core，希望很快就能升级到.NET Desktop版本。我的测试应用程序可以告诉您您是否可能遇到问题。\nD：\\SkylakeXPause\\bin\\Release\\netcoreapp2.0&gt；dotnet SkylakeXPause.dll-checkDid调用在3.5990毫秒内暂停1,000,000，处理器：8未检测到SkylakeX问题或D：\\SkylakeXPause\\SkylakeXPause\\bin\\Release\\net45&gt；SkylakeXPause.exe-checkDid调用在3.6195毫秒内暂停1,000,000，处理器：8未检测到SkylakeX问题。\n仅当您在Skylake CPU上运行未修复的.NET Framework时，该工具才会报告问题。我希望你确实和我一样觉得这个问题很吸引人。要真正理解一个问题，您需要创建一个复制器，该复制器允许您进行实验，以找到所有相关的影响因素。剩下的都是枯燥乏味的工作，但是现在我更好地理解了CPU旋转的原因和后果。\n*表示更改，以使事情更清晰，并增加新的见解。这篇文章在黑客新闻(https://news.ycombinator.com/item?id=17336853)和Reddit)(https://www.reddit.com/r/programming/comments/8ry9u6/why_skylake_cpus_are_sometimes_50_slower/).)上获得了相当大的吸引力。它甚至在维基百科(https://en.wikipedia.org/wiki/Skylake_(microarchitecture)).)中被提及。哇。谢谢你的关心。", "note_en": "I got a call that on newer hardware some performance regression tests have become slower. Not a big deal. Usually it is a bad configuration somewhere in Windows or some BIOS settings were set to non optimal values. But this time we were not able to find a setting that did bring performance back to normal. Since the change was not small 9s vs 19s (blue is old hardware orange is new hardware) we needed to drill deeper:\n   A perf drop from 9,1s to 19,6s is definitely significant. We did more checks if the software version under test, Windows, BIOS settings were somehow different from the old baseline hardware. But nope everything was identical. The only difference was that the same tests were running on different CPUs. Below is a picture of the newest CPU\n    The Xeon Gold runs on a different CPU Architecture named Skylake which is common to all CPUs produced by Intel since mid 2017. * As commenters have pointed out the consumer Skylake CPUs were released already 2015. The server Xeon CPUs with SkylakeX were released mid 2017. All later CPUs Kaby Lake, … share the same issue. If you are buying current hardware you will get a CPU with Skylake CPU architecture. These are nice machines but as the tests have shown newer and slower is not the right direction. If all else fails get a repro and use a real profiler ™ to drill deeper. When you record the same test on the old hardware and on the new hardware it should quickly lead to somewhere:\n  Remember the diff view in WPA * (Windows Performance Analyzer is a profiling UI which is free and part of the Windows Performance Toolkit which is part of the Windows SDK) shows in the table the delta of Trace 2 (11s) – Trace 1 (19s). Hence a negative delta in the table indicates a CPU consumption increase of the slower test. When we look at the biggest CPU consumer differences we find  AwareLock::Contention,  JIT_MonEnterWorker_InlineGetThread_GetThread_PatchLabel and  ThreadNative.SpinWait. Everything points towards CPU spinning when threads are competing for locks. But that is a false red herring because spinning is not the root cause of slower performance. Increased lock contention means that something in our software did become slower while holding a lock which as a consequence results in more CPU spinning. I was checking locking times and other key metrics, like disk and alike but I failed to find anything relevant which could explain the performance degradation. Although not logical I turned back to the increased CPU consumption in various methods.\n To find where exactly the CPU was stuck would be interesting. WPA has file and line columns but these work only with private symbols which we do not have because it is .NET Framework code. The next best thing is to get the address of the dll where the instruction is located which is called Image RVA ( Relative  Virtual  Address). When I load the same dll into the debugger and then do\n  then I should see the instruction which was burning most CPU cycles which was basically only one hot address.\n   0:000&gt; u clr.dll+0x195 66B-10clr!AwareLock::Contention+0x135:00007ff8`0535565b f00f4cc6  lock cmovl eax,esi00007ff8`0535565f 2bf0 sub esi,eax00007ff8`05355661 eb01 jmp clr!AwareLock::Contention+0x13f (00007ff8`05355664)00007ff8`05355663 cc  int 300007ff8`05355664 83e801 sub eax,100007ff8`05355667 7405 je clr!AwareLock::Contention+0x144 (00007ff8`0535566e)00007ff8`05355669 f390  pause00007ff8`05355 66b ebf7 jmp clr!AwareLock::Contention+0x13f (00007ff8`05355664)\n  0:000&gt; u clr.dll+0x 2801-10clr!JIT_MonEnterWorker_InlineGetThread_GetThread_PatchLabel+0x124:00007ff8`051c27f1 5e pop rsi00007ff8`051c27f2 c3 ret00007ff8`051c27f3 833d0679930001 cmp dword ptr [clr!g_SystemInfo+0x20 (00007ff8`05afa100)],100007ff8`051c27fa 7e1b jle clr!JIT_MonEnterWorker_InlineGetThread_GetThread_PatchLabel+0x14a (00007ff8`051c2817)00007ff8`051c27fc 418bc2 mov eax,r10d00007ff8`051c27ff f390  pause00007ff8`051c 2801 83e801 sub eax,100007ff8`051c2804 75f9 jne clr!JIT_MonEnterWorker_InlineGetThread_GetThread_PatchLabel+0x132 (00007ff8`051c27ff)\n Now we have a pattern. One time the hot location is a jump instruction and the other time it is a subtraction. But both hot instructions are preceded by the same common instruction named pause. Different methods execute the same CPU instruction which is for some reason very time consuming. Lets measure the duration of the pause instruction to see if we are on the right track.\n   Pause on the new Skylake CPUs is an order of magnitude slower. Sure things can get faster and sometimes a bit slower. But over 10 times slower? That sounds more like a bug. A little internet search about the pause instruction leads to the Intel manuals where the Skylake Microarchitecture and the pause instruction are explicitly mentioned:\n   No this is not a bug, it is a documented feature. There exists even a web page which contains the timings of pretty much all CPU instructions\n   The numbers are CPU cycles. To calculate the actual time you need to divide the cycle counts by the CPU frequency (usually GHz) to get the time in ns.\n That means when I execute heavily multithreaded applications on .NET on latest hardware things can become much slower. Someone else has this noticed already in August 2017 and has written an issue for it:   https://github.com/dotnet/coreclr/issues/13388. The issue has been fixed with .NET Core 2.1 and .NET Framework 4.8 Preview contains also the fixes for it.\n  Improved spin-waits in several synchronization primitives to perform better on Intel Skylake and more recent microarchitectures. [495945, mscorlib.dll, Bug]\n But since .NET 4.8 is still one year away I have requested a backport of the fixes to get .NET 4.7.2 back to speed on latest hardware. Since many parts of .NET are using spinlocks you should look out for increased CPU consumption around Thread.SpinWait and other spinning methods.\n   E.g. Task.Result will internally Spin internally where I could see for other tests also a significant increase in CPU consumption and degraded performance.\n  I have looked at the .NET Core code how long the CPU will keep spinning when the lock is not released before calling into WaitForSingleObject to pay the “expensive” context switch. A context switch is somewhere in the microsecond region and becomes much slower when many threads are waiting on the same kernel object.\n .NET Locks multiply the maximum Spin duration with the number of cores which has the fully contended case in mind where every core has a thread waiting for the same lock and tries to spin long enough to give everyone a chance to work a bit before paying for the kernel call. Spinning inside .NET uses an exponential back off algorithm where spinning starts with 50 pause calls in a loop where for each iteration the number of spins is multiplied by 3 until the next spin count becomes greater than the maximum spin duration. I have calculated the total time how long a thread would spin on pre Skylake CPU and current Skylake CPUs for various core numbers:\n    /// &lt;summary&gt; /// This is how .NET is spinning during lock contention minus the Lock taking/SwitchToThread/Sleep calls /// &lt;/summary&gt; /// &lt;param name=&#34;nCores&#34;&gt;&lt;/param&gt; void  Spin( int nCores){\t const  int dwRepetitions =  10;\t const  int dwInitialDuration =  0x32;\t const  int dwBackOffFactor =  3;\t\t int dwMaximumDuration =  20 *  1000 * nCores;\t for ( int i =  0; i &lt; dwRepetitions; i++)\t{\t\t int duration = dwInitialDuration;\t\t do\t\t{\t\t\t for ( int k =  0; k &lt; duration; k++)\t\t\t{\t\t\t\tCall_PAUSE();\t\t\t}\t\t\tduration *= dwBackOffFactor;\t\t}\t\t while (duration &lt; dwMaximumDuration);\t}}\n The old spinning times were in the millisecond region (19ms for 24 cores) which is already quite a lot compared to the always mentioned high costs of context switches which are an order of magnitude faster. But with Skylake CPUs the total CPU Spinning times for a contended lock have exploded and we will spin up to 246ms on a 24 or 48 core machine only because the latency of the new Intel CPUs has increased the pause instruction by a factor 14. Is this really the case? I have created  a small tester to check full CPU spinning and the calculated numbers nicely match my expectations. I have 48 threads waiting on a 24 core machine for a single lock where I call Monitor.PulseAll to let the race begin:\n  Only one thread will win the race but 47 threads will spin until the give up. This is experimental evidence that we indeed have a real issue with CPU consumption and very long Spin times are a real issue. Excessive spinning hurts scalability because CPU cycles are burned where other threads might need the CPU, although the usage of the pause instruction frees up some of the shared CPU resources while “sleeping” for longer times. The reason for spinning is to acquire the lock fast without going to the kernel. If that is true the increased CPU consumption might not look good in task manager but it should not influence performance at all as long as there are cores left for other tasks. But what the tests did show that nearly single threaded operations where one thread adds something to a worker queue while the worker thread waits for work and then performs some task with the work item are slowed down.\n The reason for that can be shown best with a diagram. Spinning for a contended lock happens in steps where the amount of spinning is tripled after each step. After each Spin Round the lock checks again if the current thread can get it. While spinning the lock tries to be fair and switches over to other threads from time to time to help the other thread/s to complete its work. That increases the chances the lock has been released when we check again later. The problem is that only after a complete Spin Round has completed the lock checks if it can be taken:\n  If e.g. during Spin Round 5 the lock becomes signaled right after we did start Round 5 we wait for the complete Spin Round until we can acquire the lock. By calculating the spin duration for the last round we can estimate the worst case of delay that can happen to our thread:\n  That are many milliseconds we can wait until spinning has completed. Is that a real issue?\n I have created a simple test application that implements a producer consumer queue where the worker thread works for each work item 10ms and the consumer has a delay of 1-9 ms before sending in the next work item. That is sufficient to see the effect:\n  We see for some sender thread delays of one and two ms a total duration of 2,2s whereas the other times we are twice as fast with ca. 1,2s. This shows that excessive CPU spinning is not only a cosmetic issue which only hurts heavily multithreaded applications but also simple producer consumer threading which involves only two threads. For the run above the ETW data speaks on its own that the increased CPU spinning is really the cause for the observed delay:\n  When we zoom into the slow section we find in red the 11ms of spinning although the worker (light blue) has completed its work and has returned the lock a long time ago.\n  The fast non degenerate case looks much better where only 1ms is spent spinning for the the lock.\n  The test application I did use is named   SkylakeXPause and located at  https://1drv.ms/u/s!AhcFq7XO98yJgsMDiyTk6ZEt9pDXGA which contains a zip file with the source code and the binaries for .NET Core and .NET 4.5. What I actually did to compare things was to install on the Skylake machine .NET 4.8 Preview which contains the fixes and .NET Core 2.0 which still implements the old spinning behavior. The application targets .NET Standard 2.0 and .NET 4.5 which produces an exe and a dll. Now I can test the old and new spinning behavior side by side without the need to patch anything which is very convenient.\n  readonly  object _LockObject =  new  object(); int WorkItems; int CompletedWorkItems;Barrier SyncPoint;\t void  RunSlowTest(){\t const  int processingTimeinMs =  10;\t const  int WorkItemsToSend =  100;\tConsole.WriteLine( $ &#34;Worker thread works {processingTimeinMs} ms for {WorkItemsToSend} times&#34;);\t // Test one sender one receiver thread with different timings when the sender wakes up again\t // to send the next work item\t // synchronize worker and sender. Ensure that worker starts first\t double[] sendDelayTimes = {  1,  2,  3,  4,  5,  6,  7,  8,  9 };\t foreach ( var sendDelay  in sendDelayTimes)\t{\t\tSyncPoint =  new Barrier( 2);  // one sender one receiver\t\t var sw = Stopwatch.StartNew();\t\tParallel.Invoke(() =&gt; Sender(workItems: WorkItemsToSend, delayInMs: sendDelay),\t\t\t\t\t\t() =&gt; Worker(maxWorkItemsToWork: WorkItemsToSend, workItemProcessTimeInMs: processingTimeinMs));\t\tsw.Stop();\t\tConsole.WriteLine( $ &#34;Send Delay: {sendDelay:F1} ms Work completed in {sw.Elapsed.TotalSeconds:F3} s&#34;);\t\tThread.Sleep( 100);  // show some gap in ETW data so we can differentiate the test runs\t}} /// &lt;summary&gt; /// Simulate a worker thread which consumes CPU which is triggered by the Sender thread /// &lt;/summary&gt; void  Worker( int maxWorkItemsToWork,  double workItemProcessTimeInMs){\tSyncPoint.SignalAndWait();\t while (CompletedWorkItems != maxWorkItemsToWork)\t{\t\t lock (_LockObject)\t\t{\t\t\t if (WorkItems ==  0)\t\t\t{\t\t\t\tMonitor.Wait(_LockObject);  // wait for work\t\t\t}\t\t\t for ( int i =  0; i &lt; WorkItems; i++)\t\t\t{\t\t\t\tCompletedWorkItems++;\t\t\t\tSimulateWork(workItemProcessTimeInMs);  // consume CPU under this lock\t\t\t}\t\t\tWorkItems =  0;\t\t}\t}} /// &lt;summary&gt; /// Insert work for the Worker thread under a lock and wake up the worker thread n times /// &lt;/summary&gt; void  Sender( int workItems,  double delayInMs){\tCompletedWorkItems =  0;  // delete previous work\tSyncPoint.SignalAndWait();\t for ( int i =  0; i &lt; workItems; i++)\t{\t\t lock (_LockObject)\t\t{\t\t\tWorkItems++;\t\t\tMonitor.PulseAll(_LockObject);\t\t}\t\tSimulateWork(delayInMs);\t}}\n  This is not a .NET issue. It affects all Spinlock implementations which use the pause instruction. I have done a quick check into the Windows Kernel of Server 2016 but there is no issue like that visible. Looks like Intel was kind enough to give them a hint that some changes in the spinning strategy are needed.\n When the issue was reported to .NET Core in August 2017 in September 2017 it was already fixed and pushed out with .NET Core 2.0.3 ( https://github.com/dotnet/coreclr/issues/13388). It is not only that the reaction speed of the .NET Core team is amazing but also that the issue has been fixed on the mono branch a few days ago now as well and discussions about even more Spinning improvements are ongoing. Unfortunately the Desktop .NET Framework is not moving as fast but at least we have with .NET Framework 4.8 Preview at least a proof of concept that the fixes work there as well. Now I am waiting for the backport to .NET 4.7.2 to be able to use .NET at its full speed also on latest hardware. This was my first bug which was directly related to a performance change in one CPU instruction. ETW remains the profiling tool of choice on Windows. If I had a wish I would Microsoft make to port the ETW infrastructure to Linux because the current performance tooling still sucks at Linux. There were some interesting kernel capabilities added recently but an analysis tool like WPA remains yet to be seen there.\n If you are running .NET Core 2.0 or desktop .NET Framework on CPUs which were produced since mid 2017 you should definitely check out your application with a profiler if you are running at reduced speed due to this issue and upgrade to the newer .NET Core and hopefully soon .NET Desktop version. My test application can tell you if you could be having issues\n D:\\SkylakeXPause\\bin\\Release\\netcoreapp2.0&gt;dotnet SkylakeXPause.dll -checkDid call pause 1,000,000  in 3.5990 ms, Processors: 8No SkylakeX problem detectedor D:\\SkylakeXPause\\SkylakeXPause\\bin\\Release\\net45&gt;SkylakeXPause.exe -checkDid call pause 1,000,000  in 3.6195 ms, Processors: 8No SkylakeX problem detected\n The tool will report an issue only if you are running a not fixed .NET Framework on a Skylake CPU. I hope you did find the issue as fascinating as I did. To really understand an issue you need to create a reproducer which allows you to experiment to find all relevant influencing factors. The rest is just boring work but now I understand the reasons and consequences of CPU spinning much better.\n * Denotes changes to make things more clear and add new insights. This article has gained quite some traction at Hacker News ( https://news.ycombinator.com/item?id=17336853) and Reddit  ( https://www.reddit.com/r/programming/comments/8ry9u6/why_skylake_cpus_are_sometimes_50_slower/). It is even mentioned at Wikipedia ( https://en.wikipedia.org/wiki/Skylake_(microarchitecture)). Wow. Thanks for the interest.", "posttime": "2020-06-12 07:22:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,英特尔,skylake,intel,旋转", "title": "为什么Skylake CPU有时会慢50%-英特尔是如何破坏现有代码的", "title_en": "Why Skylake CPUs Are Sometimes 50% Slower – How Intel Has Broken Existing Code", "transed": 1, "url": "https://aloiskraus.wordpress.com/2018/06/16/why-skylakex-cpus-are-sometimes-50-slower-how-intel-has-broken-existing-code/", "via": "", "real_tags": ["代码", "英特尔", "skylake", "intel", "旋转"]}, {"category": "", "categoryclass": "", "imagename": "bc13e9d4e067f88bcc42f1559127f54c.jpg", "infoid": 1006228, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于新冠肺炎疫情造成的延误，美国国家航空航天局的下一代詹姆斯·韦伯太空望远镜离开地球的时间将会更长。\n昨天，美国国家航空航天局(NASA)科学局局长托马斯·祖尔布钦(Thomas Zurbuchen)在美国国家科学院、工程和医学研究院(National Academy of Sciences，Engineering，and Medicine)太空研究委员会的一次虚拟会议上宣布了这一坏消息。\n祖尔布钦指的是此前计划于2021年发射的詹姆斯·韦伯太空望远镜(JWST)，他说：“我们不会在3月发射，绝对不会在3月发射。”在太空政策在线准备的一份抄本中，他说：“这目前还不在纸牌上。”\n对于美国国家航空航天局(NASA)和诺斯罗普·格鲁曼(Northrop Grumman)(航天局该项目的主要承包商)来说，这是一个已经饱受挫折的项目的又一次挫折。推迟发射是看似无穷无尽的成本超支和日程延误列车中的最新一例。然而，这一次，指责的矛头直接指向新冠肺炎和正在进行的全球大流行。\n“这并不是因为[NASA和诺斯罗普·格鲁曼公司]做错了什么，”祖布钦说。“这是不可能的，也不是某种类型的失误或管理不善，”他说，并补充说，该项目最近取得了很大进展，JWST将于2021年3月搭载阿丽亚娜5号火箭发射。事实上，工程师们最近对该系统的可展开塔式组件进行了一次成功的测试。\n祖尔布钦说：“我对这件事在21年离开发射台非常乐观…因为我看到的结果，[但是]还有很多山要爬。”他说，NASA及其合作伙伴将需要学习在大流行条件下工作的“新效率”，修订后的发射时间表要到7月份才能评估。\n考虑到目前正在发生的一切，试探性的发射日期是2021年，这实际上是相当令人鼓舞的，我们迫不及待地想看到这个东西发射升空。JWST是已有30年历史的哈勃太空望远镜的继任者。根据美国宇航局的说法，一旦进入太空，红外望远镜将“看起来更接近时间的起点，寻找第一批未被观测到的星系的形成，以及观察今天恒星和行星系统正在形成的尘埃云内部”。该望远镜还将能够扫描遥远系外行星的大气层，这代表着科学家在寻找宜居世界方面潜在的巨大飞跃。\n像大肠杆菌和酵母这样的单细胞生物可以在像…这样的大气中生长和存活。\n多读。\n但正如太空政策在线今年早些时候报道的那样，JWST被证明是一台建造和测试异常复杂的机器，因为它的特点是不少于300个单点故障。该望远镜目前正处于开发的集成和测试阶段，但大流行迫使NASA和诺斯罗普·格鲁曼公司放慢了速度。据SpaceNews报道，位于南加州的诺斯罗普工厂的工作并没有完全停顿；该公司现在每周有5个8小时的班次，而不是通常的12个10小时的班次。\nJWST应该在大约10年前推出(是的，真的)，初始价格为10亿美元。但正如埃里克·伯杰(Eric Berger)在Ars Technica上报道的那样，目前开发该项目的成本估计已攀升至97亿美元，可能仍偏低。可悲的是，JWST项目使NASA管理旗舰任务的能力受到质疑-这是祖布钦在昨天的会议上热衷于解决的一个问题。\n“NASA需要做旗舰。我们需要学习如何做旗舰店，“他说。“坦率地说，作为太空领导者的一部分意味着我们需要做以前没有人做过的事情。特别是在天体物理学和一些行星科学领域，但在其他领域，这些旗舰产品是推动事情向前发展的唯一工具。“。\n对于这一点，他补充道：“旗舰店的挑战一直是，我们正在为此花费大量的努力和学习，就是以一种它们不会吞噬社区的方式来管理它们。”\n更积极的消息是，美国国家航空航天局(NASA)预计仍将在7月份发射前往火星的毅力月球车，尽管由于一个未披露的问题，日期被推迟了三天。手指仍然牢牢地交叉在一起。", "note_en": "We’re going to have a wait even longer for NASA’s next-generation James Webb Space Telescope to leave Earth, owing to delays caused by the covid-19 pandemic.\n  Thomas Zurbuchen, head of NASA’s science directorate, broke the bad news yesterday during a virtual   meeting for the Space Studies Board of the National Academies of Sciences, Engineering, and Medicine.\n “We will not launch in March, absolutely will not launch in March,” said Zurbuchen in reference to the previously scheduled launch of the James Webb Space Telescope (JWST) in 2021. “That is not in the cards right now,” he said, in a   transcription prepared by Space Policy Online.\n    For NASA and Northrop Grumman (the space agency’s principal contractor for the project), it’s yet another setback for a project already beset by setbacks. The postponed launch is the latest in a seemingly endless train of cost overruns and scheduling delays. This time around, however, the finger of blame is being pointed directly at covid-19 and the ongoing global pandemic.\n  “It’s not because [NASA and Northrop Grumman] did anything wrong,” said Zurbuchen. “It’s just not going to be in the cards, and it’s not a fault or mismanagement of some type,” he said, adding that the program had made great strides recently and the JWST was on course for a March 2021 launch aboard an Ariane 5 rocket. And indeed, engineers recently conducted a   successful test of the system’s   Deployable Tower Assembly.\n   “I’m very optimistic of this thing getting off the launch pad in ’21...because of the results I’m seeing, [but] there still is a lot of mountain to climb,” said Zurbuchen, saying NASA and its partners will need to learn the “new efficiency” of working in pandemic conditions and that a revised launch schedule won’t be assessed until July.\n A tentative launch date in 2021, given everything that’s been going on, is actually quite encouraging, and we cannot wait to see this thing get off the ground. The JWST is the successor observatory to the 30-year-old Hubble Space Telescope. Once in space, the infrared telescope will “look much closer to the beginning of time and to hunt for the unobserved formation of the first galaxies, as well as to look inside dust clouds where stars and planetary systems are forming today,”   according to NASA. The telescope will also be capable of scanning the atmospheres of distant exoplanets, representing a potentially huge leap forward for scientists on the hunt for habitable worlds.\n  Single-celled organisms like Escherichia coli and yeast can grow and survive in an atmosphere like…\n Read more\n But JWST is proving to be an exceptionally complex machine to build and test, as it features no less than 300 single points of failure, as Space Policy Online   reported earlier this year. The telescope is currently in the integration and testing phase of its development, but the pandemic forced NASA and Northrop Grumman to slow things down. As SpaceNews   reports, work did not halt completely at the Northrop facility in southern California; the company is now running five eight-hour shifts each week, as opposed to the usual 12 10-hour shifts.\n  The JWST was supposed to launch around 10 years ago (yes, really), at an initial price tag of $1 billion. But as Eric Berger   reports in Ars Technica, the current cost estimate for its development has creeped up to $9.7 billion, which could still be on the low side. Sadly, the JWST project has cast NASA’s ability to manage flagship missions in doubt—a concern Zurbuchen was keen to address during yesterday’s meeting.\n “NASA needs to do flagships. We need to learn how to do flagships,” he said. “Frankly, part of being a leader in space means that we need to do things that nobody has ever done before. In astrophysics especially, and also in some of the planetary sciences, but there’s other fields where some of these flagships are the only tools to move things forward.”\n  To which he added: “The challenge with flagships has been, and we’re spending a lot of effort and learning on it, is to manage them in a way that they don’t eat the neighborhood.”\n In more positive news, NASA is still expected to launch its Perseverance rover to Mars in July, though the date was   pushed back by three days due to an undisclosed issue. Fingers remain firmly crossed.", "posttime": "2020-06-12 07:22:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "太空,韦伯,delayed,发射", "title": "拖延已久的詹姆斯·韦伯太空望远镜再次延期", "title_en": "Long-Delayed James Webb Space Telescope Is Again Delayed", "transed": 1, "url": "https://gizmodo.com/long-delayed-james-webb-space-telescope-is-again-delaye-1844000246", "via": "", "real_tags": ["太空", "韦伯", "delayed", "发射"]}, {"category": "", "categoryclass": "", "imagename": "2f4888cf88b02298cb57f7fa0129686b.jpg", "infoid": 1006227, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "​Semi是有史以来最安全、最舒适的卡车。四个独立的马达提供最大功率和加速度，并且每英里所需的能源成本最低。\n最快的加速-从0到60英里/小时只需20秒，满载。四台独立电机的即时牵引力控制。把成绩提高得更快。\n增强的自动驾驶有助于避免碰撞，居中的驾驶员位置提供最大的可见性和控制力，较低的重心提供翻车保护。每位驾驶员在使用Autopilot时都有责任保持警觉和活跃，并必须准备好随时采取行动。\n电能成本是柴油的一半。由于需要维护的系统更少，特斯拉Semi节省了20万美元以上的燃料，并有两年的回收期。", "note_en": "​Semi is the safest, most comfortable truck ever. Four independent motors provide maximum power and acceleration and require the lowest energy cost per mile.\n      The quickest acceleration—from 0-60 mph in 20 seconds, fully loaded. Instant traction control with four independent motors. Quickest up the grades.\n  Enhanced Autopilot helps avoid collisions, a centered driver position provides maximum visibility and control, and a low center of gravity offers rollover protection. Every driver is responsible for remaining alert and active when using Autopilot, and must be prepared to take action at any time.\n  Electric energy costs are half those of diesel. With fewer systems to maintain, the Tesla Semi provides $200,000+ in fuel savings and a two-year payback period.", "posttime": "2020-06-12 07:20:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,semi,tesla,成本", "title": "特斯拉Semi", "title_en": "Tesla Semi", "transed": 1, "url": "https://www.tesla.com/semi", "via": "", "real_tags": ["特斯拉", "semi", "tesla", "成本"]}, {"category": "", "categoryclass": "", "imagename": "cf19bbc291b4121f12f9df6a50e46631.jpg", "infoid": 1006226, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "麻省理工学院信守其提供公平和开放的学术机会的承诺，结束了与爱思唯尔就一份新的期刊合同进行的谈判。爱思唯尔未能提交一份符合麻省理工学院出版商合同框架原则的提案。\n麻省理工学院图书馆于2019年10月与麻省理工学院研究开放获取特设工作组和图书馆系统全球委员会合作开发，麻省理工学院框架基于这样的信念，即公开分享研究和教育材料是研究所推进知识并将这些知识应用于世界上最大挑战的使命的关键。它确认了学术及其传播的控制权应该掌握在学者及其机构手中的首要原则，旨在确保学术研究成果能够公开和公平地提供给尽可能广泛的受众，同时也为麻省理工学院社区提供有价值的服务。\n麻省理工学院图书馆馆长克里斯·布尔格(Chris Bourg)表示：“我们未能与爱思唯尔达成遵守麻省理工学院框架原则的合同，我对此感到失望，但我很自豪地知道，麻省理工学院社区--以及全国数百名同事--坚持这些原则对促进公共利益和科学进步的重要性，”麻省理工学院图书馆馆长克里斯·布尔格(Chris Bourg)说。“面对这些史无前例的全球性挑战，公平、开放地获取知识比以往任何时候都更加重要。”\n100多家机构，从多机构财团到大型研究型大学再到文科学院，决定支持麻省理工学院框架，以承认其推动开放学术和公共利益的潜力。\n美国麻省理工学院大脑与认知科学系副教授、图书馆系统委员会(Committee on the Library System，CLS)主席罗杰·利维(Roger Levy)表示：“我们已经看到，麻省理工学院社会各界--教职员工、学生、博士后和教职员工--都广泛支持该框架的核心基础：已发表学术成果的价值来自我们的工作和支持我们的机构，”罗杰·利维(Roger Levy)说。他也是图书馆系统委员会(Committee On The Library System)主席。“CLS在结束谈判的建议上是一致的。我们公开承诺支持麻省理工学院社区成员自由分享我们创建的学术成果的权利，并坚持在我们的建议中阐明的麻省理工学院框架的原则。“。\n“如果爱思唯尔能够提供一份反映我们社区需求和价值观并推进麻省理工学院使命的合同，我们希望能够恢复富有成效的谈判，”Bourg说。“在此期间，我们会继续利用这个架构，寻求新的途径，以达致开放获取知识的目标。”我们与美国计算机械协会、加州大学、卡内基梅隆大学和爱荷华州立大学合作达成的开创性协议就是构建未来商业模式的这样一个例子。“。\n麻省理工学院长期以来一直是开放获取领域的领先者。2009年通过的麻省理工学院开放获取政策倡议是美国首批也是影响最深远的此类倡议之一。自该政策通过以来，发表的教师期刊文章中有47%是免费向世界提供的。2017年，该研究所宣布了一项全新的政策，根据该政策，所有麻省理工学院的作者-包括学生、博士后和工作人员-都可以选择加入开放获取许可证。麻省理工学院研究开放获取特设工作组于2017年首次由教务长马丁·施密特召集，并于2019年10月发布了最终建议。由布尔格领导的一个实施小组正在努力确定特别工作组的建议的优先顺序并予以实施，这些建议的范围从政策到激励，再到国家和全球的倡导。\n麻省理工学院社区有关访问爱思唯尔文章的信息可以在麻省理工学院图书馆的网站上找到。", "note_en": "Standing by its commitment to provide equitable and open access to scholarship, MIT has ended negotiations with Elsevier for a new journals contract. Elsevier was not able to present a proposal that aligned with the principles of the  MIT Framework for Publisher Contracts.\n Developed by the MIT Libraries in collaboration with the  Ad Hoc Task Force on Open Access to MIT’s Research and the  Committee on the Library System in October 2019, the MIT Framework is grounded in the conviction that openly sharing research and educational materials is key to the Institute’s mission of advancing knowledge and bringing that knowledge to bear on the world’s greatest challenges. It affirms the overarching principle that control of scholarship and its dissemination should reside with scholars and their institutions, and aims to ensure that scholarly research outputs are openly and equitably available to the broadest possible audience, while also providing valued services to the MIT community.\n “I am disappointed that we were not able to reach a contract with Elsevier that honors the principles of the MIT Framework, but I am proud knowing that the MIT community — as well as hundreds of colleagues across the country — stand by the importance of these principles for advancing the public good and the progress of science,” said Chris Bourg, director of the MIT Libraries. “In the face of these unprecedented global challenges, equitable and open access to knowledge is more critical than ever.”\n More than 100 institutions, ranging from multi-institution consortia to large research universities to liberal arts colleges, decided to endorse the MIT Framework in recognition of its potential to advance open scholarship and the public good.\n “We&#39;ve seen widespread support in all quarters of the MIT community — faculty, students, postdocs, and staff alike — for the core grounding of the framework: that the value in published scholarship originates in our work and in the institutions that support us,” says Roger Levy, associate professor in the Department of Brain and Cognitive Sciences and chair of the Committee on the Library System (CLS). “CLS was unanimous in its recommendation to end negotiations. We are publicly committed to supporting the rights of MIT community members to freely share the scholarship we create, and stand by the principles articulated in the MIT Framework in our recommendation.”\n “We hope to be able to resume productive negotiations if and when Elsevier is able to provide a contract that reflects our community’s needs and values and advances MIT’s mission,” said Bourg. “In the meantime, we will continue to use the framework to pursue new paths to achieving open access to knowledge. The groundbreaking agreement we reached with the  Association for Computing Machinery in collaboration with the University of California, Carnegie Mellon University, and Iowa State University is one such example of building the business models of the future.”\n MIT has long been a leader in open access. Adopted in 2009, the  MIT Faculty Open Access Policy was one of the first and most far-reaching initiatives of its kind in the United States. Forty-seven percent of faculty journal articles published since the adoption of the policy are freely available to the world. In 2017, the Institute announced a  new policy under which all MIT authors — including students, postdocs, and staff — can opt in to an open access license. The Ad Hoc Task Force on Open Access to MIT’s Research, first convened by Provost Martin Schmidt in 2017,  released its final recommendations in October 2019. An implementation team, led by Bourg, is working to prioritize and enact the task force’s recommendations, which range from policy to incentives to national and global advocacy.\n Information for the MIT community about access to Elsevier articles can be found on the  MIT Libraries’ website.", "posttime": "2020-06-12 07:02:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "结束,ends,麻省理工学院", "title": "麻省理工学院结束爱思唯尔谈判", "title_en": "MIT Ends Elsevier Negotiations", "transed": 1, "url": "http://news.mit.edu/2020/guided-by-open-access-principles-mit-ends-elsevier-negotiations-0611", "via": "", "real_tags": ["结束", "ends", "麻省理工学院"]}, {"category": "", "categoryclass": "", "imagename": "bdce1ac5fcb64570aef3154f860eb199.jpg", "infoid": 1006223, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "索尼终于发布了PlayStation5游戏机。这款圆滑的弧形盒子将有两种口味-一种是带光盘驱动器的，另一种是没有的。\n白色控制台可以水平或垂直定位。这两个版本在前面都有一个USB和USB-C端口。\n还显示了：一个连接两个DualSense衬垫的控制器充电站，一个支持3D音频和降噪麦克风的耳机，以及一个带有内置麦克风的媒体遥控器。\n有时我们会包含指向在线零售店的链接。如果您点击一个并购买，我们可能会收到一小笔佣金。有关更多信息，请访问此处。\n\n当天最受欢迎的10个故事将于英国时间下午5点发布。什么都不要错过。", "note_en": "Sony has finally unveiled its PlayStation 5 console. The sleek and curved box will come in two flavours - one with a disc drive, and one without.\n       The white-coloured console can be orientated horizontally or vertically. Both versions have a USB and USB-C port in the front.\n  Also shown: a controller charging station which docks two DualSense pads, a headset featuring 3D audio support and noise-cancelling microphones and a media remote with built-in microphone.\n  Sometimes we include links to online retail stores. If you click on one and make a purchase we may receive a small commission. For more information, go  here.\n  \n  The 10 most popular stories of the day, delivered at 5pm UK time. Never miss a thing.", "posttime": "2020-06-12 06:37:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,游戏机,console,麦克风", "title": "PlayStation5游戏机亮相", "title_en": "PlayStation 5 Console Revealed", "transed": 1, "url": "https://www.eurogamer.net/articles/2020-06-11-heres-your-first-look-at-the-playstation-5-console", "via": "", "real_tags": ["游戏", "游戏机", "console", "麦克风"]}, {"category": "", "categoryclass": "", "imagename": "fc39097cfce3a90052409f3c5347fad9.jpeg", "infoid": 1006222, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1980年9月18日晚，一枚高耸的火箭将一艘狭窄的航天器推向太空，飞船内有两个人。\n几分钟后，飞船到达了近地轨道，机组人员花了两天时间飞往一个小型空间站，在那里停留了近一周，然后返回地球。\n这项任务创造了人类历史：这是有史以来第一次将黑人或拉丁人送入太空。但美国与这一壮举无关。\n而不是美国-大约十年前曾设法将12人送上月球-这次任务是由现在的前苏联乘坐联盟号宇宙飞船发射的。与苏联宇航员尤里·罗曼年科(Yuri Romanenko)一起进行历史性飞行的是非洲裔古巴公民阿纳尔多·塔马约·门德斯准将(Brigadier Gen.Arnaldo Tamayo Méndez)。\n与此同时，美国国家航空航天局直到1983年才发射黑人宇航员，当时它的航天飞机发射系统已经进入运行的第三个年头。\n历史本不应该是这样的：在美国民权运动中，美国航天局很早就有机会打破太空中一个明显的种族障碍，比它的冷战对手早了很多年。这样的举动甚至可能在阿波罗计划期间促成一次多样化的登月活动，但20世纪60年代的航天局领导人没有做到这两点-据一些人说，他们是自愿这样做的。\n塔马约·门德斯(Tamayo Méndez)1942年1月29日出生于古巴关塔那摩，发射时38岁。(他今天78岁了。)。\n他的成长绝非易事。科林·伯吉斯(Colin Burgess)和伯特·维斯(Bert Vis)合著的“Interkosmos：The East Bloc‘s Early Space Program”一书写道，他出生在古巴东端关塔那摩的一个贫穷家庭，父母在他只有几个月大的时候死于重病，成了孤儿。这本书是科林·伯吉斯(Colin Burgess)和伯特·维斯(Bert Vis)合著的“Interkosmos：The East Bloc’s Early Space Program”一书。\n塔马约·门德斯(Tamayo Méndez)在书中说：我出生在一个贫穷的黑人家庭，虽然我从小就梦想飞行，但那是完全不可想象的。我不得不很早就开始工作，当街头擦鞋男孩--一个穷人的职业--或者卖蔬菜。\n他还送牛奶，在一家家具厂劳动，13岁时成为一名木匠学徒。\n据BlackPast.org报道，塔马约·门德斯(Tamayo Méndez)在20世纪50年代加入了古巴革命，后来在1960年左右参加了青年起义者协会(Association Of Young Rebels)。\n这导致他在古巴学习航空技术员，并在移居苏联继续学习后成为一名飞行员，在那里他学会了驾驶米格-15战斗机。在训练期间，他受到了1961年尤里·加加林(Yuri Gagarin)首次载人航天的启发。\n根据这本书，塔马约·门德斯(Tamayo Méndez)后来在古巴导弹危机期间执行侦察任务，并在多年来的军队晋升过程中继续飞行。当苏联启动Intercosmos计划以帮助其盟友进入太空时，这将他定位为宇航员候选人。\n塔马约·门德斯(Tamayo Méndez)于1978年被选为该项目的成员，在1980年9月发射之前，他与队友罗曼年科(Romanenko)在两年多的时间里进行了大约1500个小时的训练。几天后，两人与不起眼的Salyut-6空间站对接，在上面停留了大约5天，然后回家。\n在太空中，塔马约·门德斯(Tamayo Méndez)帮助进行了20多项实验。在Salyut-6上，他每天花4个小时穿上特殊的鞋子，对脚弓施加压力，希望能减轻太空适应综合症(或称太空病)带来的恶心和迷失方向的影响。太空病影响着大约一半飞向太空的人。(今天的宇航员和宇航员使用抗运动病药物和时间来治疗这种情况。)。\n塔马约·门德斯(Tamayo Méndez)还帮助进行了涉及大脑刺激头盔的实验，以及那些旨在测量压力水平、血液循环、免疫系统细胞健康和分裂酵母细胞的实验。\n出身如此卑微的人能取得如此非凡的成就，这是一种象征。\n在这项名为联盟-38的任务的选拔过程中，塔马约·门德斯击败了一名罗马尼亚人，成为主要机组成员。\n伯吉斯和维斯在他们的书中写道，它认为菲德尔·卡斯特罗(古巴总统)希望门德斯执行苏联-古巴任务，并利用他相当大的影响力确保了这一结果。\n安全返回地球后，塔马约·门德斯接受了来自古巴和苏联的英雄勋章。卡斯特罗在1980年10月发表了一次演讲，强调了这位宇航员作为黑人和拉丁人的地位。\n卡斯特罗说：出身如此卑微的人取得了如此非凡的成就，这是一种象征。他对美国和其他西方国家进行了表面上的民族主义抨击，并补充道：当然，只有革命--而且仅仅是革命--才有可能让塔马约这样的年轻人拥有这种可能性。\n自1958年NASA成立以来，该机构已经挑选了350名有资格飞向太空的宇航员。其中18人是黑人宇航员，其中14人已经进入轨道。美国海军司令维克多·J·格洛弗于2013年被美国国家航空航天局选中，他将于2020年8月左右乘坐S paceX的新船员龙飞船飞向太空，成为第15位。\n1978年被美国国家航空航天局选中的美国空军上校小吉安·S·布鲁福德是第一个进入太空的美国黑人。布鲁福德于1983年8月30日搭乘第八次航天飞机任务发射升空，然后在1985年、1991年和1992年进行了另外三次航天飞机任务。\n在约翰·F·肯尼迪(John F.Kennedy)总统任期的早期，随着白宫推动1970年之前将人送上月球，政府要求五角大楼在其队伍中寻找一名可以成为NASA宇航员的黑人。\n1961年12月8日，五角大楼向约翰·F·肯尼迪总统的民权小组发送了一份备忘录。第三部分，标题为黑人宇航员，强调了找到这样一个人的困难。\n正在努力寻找一名合格的黑人试飞员加入宇航员队伍。国防部在文件中说，人员数据正在获得和审查中，但还没有确定是否有合格的个人可用。\n航空航天研究飞行员学校(ARPS)成立于1961年，目的是为NASA培养未来几代宇航员。正如航天历史学家约翰·洛格斯顿(John Logsdon)在2013年为Quest：The History of Spaceflance Queasly撰写的一篇文章中所写的那样，对进入该校的候选人的筛选非常激烈。ARPS成立于1961年，目的是为NASA培养未来几代宇航员。必备条件包括年龄在35岁以下，至少有1500小时驾驶喷气式飞机的经验，至少拥有理工科学士学位，并连续三次获得军事上级的杰出评价。\n不帮助国防部找到合格的候选人是数百年来对黑人的压迫，特别是缺乏获得高质量教育和职业机会的机会，否则就会产生大量候选人。同样无济于事的还有：一些军事领导人持续藐视已有13年之久的整合军队的行政命令，以及政府和整个社会各个角落弥漫的制度性种族主义。\n因此，搜索只找到了一个人：机长小埃德·德怀特(Ed Dwight Jr.)，当时27岁的他是一名喷气式飞机飞行员。据“史密森”杂志报道，1962年，当他在爱德华兹空军基地训练时，他不顾偏见和鄙视，受邀加入了Arps。\n我做梦也没想到我会成为第一位黑人宇航员，德怀特在史密森频道2月份首播的纪录片“太空中的黑人：打破肤色障碍”中说。我从来没有想到过这一点，因为这是阻碍我前进的一大障碍，我知道这一障碍会有种族因素的影响。但我并不知道它会变得如此复杂和坚定。\n德怀特在纪录片中说，查克·耶格尔是第一个打破音障的人，他指挥了Arps，他不得不整合学校，这让他感到震惊。尽管如此，德怀特于1963年10月以试飞员的身份毕业，这使他有资格参加NASA宇航员选拔--但该机构并没有将他从该校的第一届毕业班中挑选出来。\n德怀特在纪录片中说，[耶格尔]打电话给所有的教官，他向这些人宣布，如果他毕业了，肯尼迪想把这个太空项目变成一个黑色空间项目。(耶格尔多年来一直否认他对德怀特或其他黑人方舟的参与者有偏见。)\n在德怀特没有入选之后，白宫显然对NASA施加了更大的压力，要求他选择德怀特，以至于他将被选为下一届宇航员班的成员。但就在那次事件的前几周，肯尼迪总统被暗杀，林登·B·约翰逊(Lyndon B.Johnson)就任总统后，德怀特再次被忽略。\n我直接下了台，因为约翰逊想要自己的黑人，而他们选择了劳伦斯(Robert Lawrence)。德怀特告诉作家弗兰克·怀特三世，他在1984年2月号的“乌木”杂志上发表了一篇报道，他们向我许诺，如果我不接受媒体采访，他们就会给我一项任务。(劳伦斯于1967年6月被选为第一位非裔美国宇航员，但于同年12月在喷气式飞机训练飞行中去世。)。\n在收到与他继续训练有关的匿名信和恐吓信后，德怀特被重新分配。后来他从空军退役，成为一名雕塑家，就像他在2009年出版的自传“在梦想的翅膀上翱翔”中所写的那样。\n根据Logsdon的说法，Arps的副手托马斯·麦克尔穆里(Thomas McElmurry)后来表示，德怀特完全有能力成为一名优秀的宇航员，但他补充说，在这项运动的这个阶段，这对这个国家的人来说还不够重要，所以他们就选择了不这么做。", "note_en": "On the evening of September 18, 1980, a towering rocket pushed a cramped spacecraft with two people inside toward space.\n The spaceship reached  low-Earth orbit a few minutes later, and the crew spent two days flying toward a small space station, where they stayed for almost a week before returning to Earth.\n The mission made human history: It was the first-ever launch of a Black or Latin person into space. But the US had nothing to do with the feat.\n Instead of America — which had managed to  land 12 people on the moon about a decade prior — the mission was launched aboard a Soyuz spacecraft by the now-former Soviet Union. And it was Brigadier Gen. Arnaldo Tamayo Méndez, a Cuban citizen of African descent, who made the historic flight with Soviet cosmonaut Yuri Romanenko.\n   NASA, meanwhile, wouldn&#39;t launch a Black astronaut until 1983, when its space shuttle launch system was in its third year of operation.\n History needn&#39;t have played out this way: The US space agency had an early opportunity to break down a conspicuous racial barrier in space amid the American civil rights movement, and many years ahead of its Cold War rival. Such a move might have even teed up a diverse moon landing during the Apollo program, but 1960s agency leaders failed to do either — and willingly so, according to some.\n  Tamayo Méndez, who was 38 years old at the time of his launch, was born in Guantanamo, Cuba, on January 29, 1942. (He&#39;s 78 years old today.)\n His upbringing was anything but easy. Born into a poor family on Guantánamo at the eastern tip of Cuba, his parents died from a &#34;serious illness&#34; when he was just a few months old, orphaning him,  according to the book &#34; Interkosmos: The Eastern Bloc&#39;s Early Space Program&#34; by Colin Burgess and Bert Vis.\n &#34;I was born in a poor negro family, and although I dreamed of flying from childhood, that was utterly unthinkable,&#34; Tamayo Méndez said in the book. &#34;I had to start work early, as a street shoe-shine boy — a poor man&#39;s profession — or selling vegetables.&#34;\n   He also delivered milk, labored in a furniture factory, and became an apprentice carpenter at 13 years old.\n Tamayo Méndez joined the Cuban Revolution of the 1950s, and he later attended the Association of Young Rebels around 1960,  according to BlackPast.org.\n That led him to study as an aviation technician in Cuba and become a pilot after moving to the Soviet Union to continue his studies, where he learned to fly a MiG-15 fighter jet. While training, he was inspired by the first-ever human spaceflight by Yuri Gagarin in 1961.\n According to the book, Tamayo Méndez later flew reconnaissance missions during the Cuban Missile Crisis and continued to fly as he ascended the military ranks over the years. This positioned him as a cosmonaut candidate when the Soviet Union launched the Intercosmos program to help its allies reach space.\n   Tamayo Méndez was selected for the program in 1978 and spent roughly 1,500 hours training over more than two years with Romanenko, his crewmate, before their September 1980 launch. The two men docked with the modest Salyut-6 space station a couple days later, stayed aboard for about five days, and then returned home.\n While in space, Tamayo Méndez helped perform more than two dozen experiments. For four hours each day on Salyut-6, he put on special shoes designed to put pressure on foot arches in hopes of lessening the nauseating and disorienting effects of space adaptation syndrome, or &#34;space sickness,&#34; which affects about half of people who fly to space. (Astronauts and cosmonauts today use anti-motion sickness drugs and time to treat the condition.)\n Tamayo Méndez also helped with experiments involving a brain-stimulating helmet, as well as those designed to measure stress levels, blood circulation, immune system cell health, and cellular of division yeast.\n &#39;It is a symbol that a man from such humble origin has attained such extraordinary success&#39;\n  During the selection process for the mission, called Soyuz-38, Tamayo Méndez beat out a Romanian candidate for the prime crew.\n   Burgess and Vis wrote in their book that it&#39;s &#34;believed that Fidel Castro [Cuba&#39;s president] wanted Mendez to fly the Soviet-Cuban mission and used his considerable influence to ensure that this was the outcome.&#34;\n After his safe return to Earth, Tamayo Méndez received hero&#39;s medals from both Cuba and the USSR. Castro gave a speech in October 1980 that highlighted the cosmonaut&#39;s status as a Black and Latin man.\n &#34;It is a symbol that a man from such humble origin has attained such extraordinary success,&#34; Castro said. In a nationalistic and ostensible jab at the US and other western nations, he added: &#34;Of course, only the revolution — and the revolution alone — has made it possible for a youth such as Tamayo to have that possibility.&#34;\n Since NASA formed in 1958, the agency has  selected 350 astronauts who are eligible to fly to space.  Eighteen of them are Black astronauts, of whom 14 have reached orbit. US Navy Commander  Victor J. Glover, selected by NASA in 2013, is slated to become the 15th when he flies to space aboard S paceX&#39;s new Crew Dragon spaceship around August 2020.\n   US Air Force Colonel  Guion S. Bluford, Jr., selected by NASA in 1978, was the first Black American to reach space. Bluford launched aboard the eighth space shuttle mission on August 30, 1983, then went on to fly three other space shuttle missions in 1985, 1991, and 1992.\n   Early in the term of President John F. Kennedy, as the White House pushed to land people on the moon before 1970, the administration asked the Pentagon to find a Black person in its ranks who could become a NASA astronaut.\n On December 8, 1961, the Pentagon  sent a memo to President John F. Kennedy&#39;s Civil Rights Subcabinet Group. The third section, titled &#34;Negro Astronaut,&#34; highlighted the difficulty of locating such a person.\n &#34;An effort is being made to locate a qualified Negro test pilot to join the astronauts. Personnel data is being obtained and reviewed, but no determination as to the availability of a qualified individual as yet has been made,&#34; the DoD said in the document.\n   The filters for candidates into the Aerospace Research Pilot School (ARPS) — established in 1961 to churn out future generations of astronauts for NASA — were intense, as spaceflight historian John Logsdon wrote in  a 2013 article for Quest: The History of Spaceflight Quarterly. The necessities included &#34;being under 35 years of age, having at least 1,500 hours of experience flying jet airplanes, possessing at least a bachelor&#39;s degree in science or engineering, and having three consecutive &#39;outstanding&#39; ratings from his military superiors.&#34;\n Not assisting the DoD in finding a &#34;qualified&#34; candidate was hundreds of years of oppression of Black people, and specifically a lack of access to high-quality education and career opportunities that would&#39;ve otherwise produced a bounty of candidates. Also not helpful: Some military leaders&#39; ongoing defiance of a  13-year-old executive order to integrate the armed services, and the institutional racism thickly permeating all corners of government and society at large.\n Thus the search  yielded just one person: Captain Ed Dwight, Jr., then a 27-year-old jet pilot. He was invited to, and joined ARPS in 1962, withstanding &#34;prejudice and scorn&#34; while he trained on the grounds of Edwards Air Force Base, according  to the Smithsonian Magazine.\n &#34;I did not dream that I was going to become the first Black astronaut,&#34; Dwight said in the documentary film &#34; Black in Space: Breaking the Color Barrier,&#34; which the Smithsonian Channel debuted in February. &#34;That never entered my mind because that was a big obstacle standing in my way, and I knew there was going to be a racial component to that obstacle. But I didn&#39;t know it was going to be as sophisticated and as determined as it was.&#34;\n  Chuck Yeager, who was the first to break the sound barrier, commanded ARPS and was &#34;shocked&#34; that he had to integrate the school, Dwight said in the documentary. Nevertheless, Dwight graduated as a test pilot in October 1963, making him eligible for NASA astronaut selection — but the agency did not pick him from the school&#39;s first graduating class.\n   &#34;[Yeager] called all the instructors and he announced to these people, &#39;If he graduates, Kennedy wants to turn this space program into a Black space program,&#39;&#34; Dwight said in the documentary. (Yeager has over the years denied that he was biased against Dwight or other Black ARPS enrollees.)\n After Dwight&#39;s non-selection, the White House apparently put more pressure on NASA to pick Dwight, to the point he was to be selected for the next astronaut class. But just weeks before that event, President Kennedy was assassinated, and Dwight was again passed over after Lyndon B. Johnson assumed the presidency.\n &#34;I went right down the tube because Johnson wanted his own Black guy, and they chose [Robert] Lawrence. They promised me a mission if I didn&#39;t talk to the press,&#34; Dwight told writer Frank White III for a story in  the February 1984 issue of Ebony magazine. (Lawrence was selected as the first African-American astronaut in June 1967 but  died that December in a jet-training flight.)\n After receiving anonymous and threatening letters related to his continued training, Dwight was reassigned. He later quit the Air Force to become a sculptor, as he chronicled in his 2009 autobiography titled &#34; Soaring on the Wings of a Dream.&#34;\n   Thomas McElmurry, a deputy at ARPS, according to Logsdon, later said Dwight was &#34;perfectly capable of being a good astronaut,&#34; but added &#34;it wasn&#39;t important enough to somebody in this country at this stage of the game to do it, so they just chose not to do it.&#34;", "posttime": "2020-06-12 06:36:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "太空,送入,send,宇航员", "title": "美国没有把第一个黑人送入太空", "title_en": "The US didn't send the first Black person into space", "transed": 1, "url": "https://www.businessinsider.com/arnaldo-tamayo-mendez-first-black-person-astronaut-cosmonaut-reach-orbit-2020-6", "via": "", "real_tags": ["太空", "送入", "send", "宇航员"]}, {"category": "", "categoryclass": "", "imagename": "a584cd97520009d8398ea9dac0555c10.jpg", "infoid": 1006221, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周三，“魔术：海岸奇才队”(Magic：The Gathering Publisher Wizards of the Coast)采取了史无前例的措施，将种族主义卡片从游戏中移除。总共有七张牌，可以追溯到1994年，现在被禁止玩。他们的照片也将从游戏的官方在线数据库中删除。\n奇才在一份声明中说：“过去几周发生的事件，以及关于我们如何更好地支持有色人种的持续对话，促使我们审视自己，审视我们的行动，以及我们的不作为。”“我们感谢大家帮助我们认识到我们的不足之处。我们应该做得更好，我们可以做得更好，我们也会做得更好。“。\n现在被禁止的卡片有：“召唤偏见”、“清洁”、“投掷石魔”、“吉普赛人”、“圣战”、“监禁”和“十字军东征”。\n其中特别有一张卡，Invoke Predicice，被挑出来了。它显示了一个戴头巾的刽子手拿着一把黑色的斧头。“如果对手施放的召唤咒语与你操控的某个生物的颜色不匹配，则该咒语被反击，”牌上写道。它有效地杀死了那些看起来不像已经在餐桌上的生物。\nGatherer是曾经出版过的每一张魔法卡的官方在线数据库，它在一个以“1488”结尾的网页URL上显示这张卡，这是白人至上的同义词。\n\n奇才说：“(援引偏见)卡是种族主义的，不幸的是，它在几年前就被编成了多元宇宙ID，这让情况变得更加糟糕。”“在我们的比赛中没有种族主义的立足之地，其他任何地方也没有。”\n所有卡片都将在网上被一张纸条取代，上面写着他们的种族主义描述、文字或它们的组合。\n“随着我们继续让我们的游戏、社区和公司更具包容性，还有更多的工作要做，”奇才说。“要知道，我们每天都在努力变得更好，我们听到了你们的声音。随着我们游戏和组织的发展，我们期待着与您分享更多的计划。“。\n魔力：这个聚会最近庆祝了它的25周年纪念日。该公司最近还对其卡片目录进行了另一次修改，更改了一张以哥斯拉为主题的促销卡片的名称，删除了人们眼中对小说中被称为新冠肺炎的冠状病毒的提及。", "note_en": "On Wednesday,   Magic: The Gathering publisher Wizards of the Coast took unprecedented measures to remove racist cards from its game. Seven cards in all, dating back to 1994, are now banned from play. Their images will also being removed from the game’s official online database.\n “The events of the past weeks and the ongoing conversation about how we can better support people of color have caused us to examine ourselves, our actions, and our inactions,”  Wizards said in a statement. “We appreciate everyone helping us to recognize when we fall short. We should have been better, we can be better, and we will be better.”\n  The list of now-banned cards is: Invoke Prejudice, Cleanse, Stone-Throwing Devils, Pradesh Gypsies, Jihad, Imprison, and Crusade.\n One card in particular, Invoke Prejudice, was singled out. It shows a hooded executioner with a black axe. “If opponent casts a Summon spell that does not match the color of one of the creatures under your control, that spell is countered,” says the card. It effectively kills off creatures that don’t look like the creatures already on the table.\n Gatherer, the official online database of every  Magic card ever published, displays the card at a web URL ending in “1488,” numbers that are  synonymous with white supremacy.\n \n “The [Invoke Prejudice] card is racist and made even worse by the multiverse ID it was unfortunately codified with years ago,” Wizards said. “There’s no place for racism in our game, nor anywhere else.”\n All cards will be replaced online with a note that calls out their racist depictions, text, or a combination thereof.\n “There’s much more work to be done as we continue to make our games, communities, and company more inclusive,” Wizards said. “Know that we work every day to be better and that we hear you. We look forward to sharing more of our plans with you as our games and organization evolve.”\n Magic: The Gathering recently celebrated its  25th anniversary. It also recently made another alteration to its catalog of cards, changing the name of a Godzilla-themed promotional card to remove  a perceived reference to the novel coronavirus known as COVID-19.", "posttime": "2020-06-12 06:36:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据库,database,卡片,magic,种族主义", "title": "种族主义魔术：出版商禁止收集卡片，并将其从数据库中删除", "title_en": "Racist Magic: The Gathering cards banned, removed from database by publisher", "transed": 1, "url": "https://www.polygon.com/2020/6/10/21287154/racist-magic-the-gathering-cards-banned-removed-from-database-wizards-apology", "via": "", "real_tags": ["数据库", "database", "卡片", "magic", "种族主义"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006220, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CRUX是一种开放源码(MIT许可证)数据库，其体系结构颠倒过来，允许您组合可插入组件并避免跨底层技术锁定。开始使用应用程序中嵌入的基本配置，并在需要使用Apache Kafka和RocksDB在横向扩展群集中存储、索引和查询TB级文档时进行升级。\nCRUX是一个面向文档的数据库，它使您的数据可用于类似图形的Datalog查询，而不需要预先的模式。广泛验证的持久存储技术(如Apache Kafka)用于安全地持久化您的数据，同时提供规模化的ACID事务保证。Datalog为您提供了一种简单的格式来表达有关整个数据库的强大而复杂的问题。您的问题将使用从所有隐含的相互关联和相互关联的文档中提取的事实来回答。\n四个简单的事务操作使您可以将数据作为文档使用：PUT、DELETE、MATCH、EVICT您的文档将自动作为实体图进行索引，以便在查询期间使用。每个操作还支持用于修改文档版本历史的附加时间坐标。不需要架构，并且您的文档只需要ID字段。\n用Datalog表示的声明性查询使您能够高效地分析半结构化文档的图形，支持惰性连接算法和递归规则。这种简单的格式富有表现力，便于撰写有关整个数据库的复杂问题。Datalog是SQL的可靠替代品，具有悠久的行业用法和广泛的学术兴趣。其核心是使用递归规则在事实和谓词数据库上进行模式匹配的逻辑变量的统一。\npublic class Factorial{public static void main(string[]args){final int NUM_FACTS=100；for(int i=0；i&lt；NUM_FACTS；i++)System.out.println(i+&#34；&#34；+factorial(I))；}public static int factorial(Int N){int result=1；for(int i=2；i&lt；=n；i++)result*=i；return result；}}。\n当围绕不可更改的数据设计系统时，法律法规通常会带来挑战，因此，高效地逐出单个文档版本的能力是一个核心功能。全面的审核和数据回收设施可帮助您的组织遵守与保留敏感数据相关的数据保护政策和要求。\nAvisi为Atlassian Marketplace构建企业附加组件。CRUX嵌入到他们的产品中，他们已经发布了`CRUX-XODUS‘这样的模块。\n领先的汽车零部件分销商Oscalo使用Crux将供应商的价格更新关联起来，并在100多万个SKU上维护准确的ERP记录。\nJUXT是一家注册的合流合作伙伴，我们的Kafka Connector for Crux(源和汇)已通过独立验证，并在合流中心发布。", "note_en": "Crux is an open source (MIT License) database with an architecture turned inside out, allowing you to combine pluggable components and  avoid lock-in across the underlying technologies.\t\t\t\t  \t\t\t\tGet started with a basic configuration embedded within your application and upgrade when needed to use Apache Kafka and RocksDB for storing, indexing and querying across terabytes of documents in a scale-out cluster.\n    Crux is a document-oriented database that makes your data available for graph-like Datalog queries without the need for an upfront schema. Widely proven durable storage technologies such as Apache Kafka are used to safely persist your data whilst providing  ACID transaction guarantees at scale.   \t\t\t\tDatalog gives you a simple format to express powerful and complex questions about your entire database. Your questions are answered using facts extracted from all of your implicitly interrelated and interconnected documents.\n  Four simple transaction operations enable you to work with your data as documents:\t\t\t  Put,  Delete,  Match,  Evict   Your documents are automatically indexed as a graph of entities for use during queries. Each operation also supports additional temporal coordinates for modifying the history of document versions. No schema is necessary and your documents only require an ID field.\n  Declarative queries expressed in  Datalog enable you to efficiently analyse your graph of semi-structured documents, powered by a lazy join algorithm and recursive rules. This simple format is expressive and facilitates the composition of complex questions about your entire database.\t\t\t  \t\t\tDatalog is a credible alternative to SQL, with long-established industry usage and broad academic interest. At its core is the unification of logic variables that pattern-match over a database of facts and predicates using recursive rules.\n  public class Factorial { public static void main(String[] args) {\t final int NUM_FACTS = 100;\t for(int i = 0; i &lt; NUM_FACTS; i++)\t System.out.println( i + &#34;&#34; + factorial(i)); } public static int factorial(int n) {\tint result = 1;\t for(int i = 2; i &lt;= n; i++)\t result *= i;\t return result; }}\n  Legal regulations often pose a challenge when designing systems around immutable data, therefore the ability to efficiently &#34;evict&#34; individual document versions is provided as a core feature.\t\t\t  \t\t\tComprehensive auditing and data eviction facilities help you to facilitate your organisation&#39;s compliance with data protection policies and requirements relating to the retention of sensitive data.\n  Avisi build enterprise add-ons for the Atlassian Marketplace. Crux is embedded in their products and they have released modules such as `crux-xodus`.\n  Leading vehicle parts distributor Oscaro use Crux to correlate price updates from suppliers and maintain accurate ERP records across over a million SKUs.\n  JUXT is a registered Confluent partner and our Kafka Connector for Crux (source and sink) has been independently validated and published on Confluent Hub.", "posttime": "2020-06-12 06:29:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据库,database,开放源码,open,文档", "title": "症结：开放源码的文档数据库，支持双时相图查询", "title_en": "Crux: Open-source document database with bi-temporal graph queries", "transed": 1, "url": "https://opencrux.com/", "via": "", "real_tags": ["数据库", "database", "开放源码", "open", "文档"]}, {"category": "", "categoryclass": "", "imagename": "8b0b24b347a720aa9227e4fe3f010dc5.jpg", "infoid": 1006219, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软周三表示，攻击者最近劫持了微软Azure云计算服务内强大的机器学习集群，以便他们可以以牺牲租用这些集群的客户为代价挖掘加密货币。\n这些节点被客户错误配置，成为所谓密码劫持方案的完美目标。机器学习任务通常需要大量的计算资源。通过将它们重新定向到执行挖掘数字硬币所需的计算密集型工作负载，攻击者找到了一种以很少的成本或免费生成大量货币的方法。\n受感染的集群正在运行Kubeflow，Kubeflow是Kubernetes中机器学习应用程序的开源框架，它本身就是一个用于在大量计算机上部署可伸缩应用程序的开源平台。微软表示，它发现的受损集群数量达到了“数十个”。他们中的许多人运行着一个可以从公共存储库获得的映像，表面上是为了省去用户自己创建一个映像的麻烦。经过进一步检查，微软调查人员发现它包含秘密挖掘Monero加密货币的代码。\n在发现受感染的群集后，调查人员将注意力转向机器是如何受到危害的。出于安全考虑，默认情况下，允许管理员控制Kubeflow的仪表板只能通过istio inress访问，istio inress是一个通常位于群集网络边缘的网关。默认设置阻止Internet上的普通用户访问仪表板和对群集进行未经授权的更改。\nAzure安全中心的安全研究软件工程师约西·魏茨曼(Yossi Weizman)在周三发布的一篇帖子中说，一些用户改变了设置。\n魏茨曼写道：“我们相信，一些用户选择这样做是为了方便。”“如果没有此操作，访问仪表板需要通过Kubernetes API服务器进行隧道传输，而不是直接访问。通过将服务公开给Internet，用户可以直接访问仪表板。但是，此操作启用了对Kubeflow仪表板的不安全访问，这使得任何人都可以在Kubeflow中执行操作，包括在集群中部署新容器。“。\n一旦攻击者有权访问仪表板，他们就有了在集群中部署后端容器的多种选择。例如，攻击者可以创建在集群上运行的名为Jupyter Notebook的服务器。然后他们可以在Jupyter笔记本中放置恶意图像。如果已经安装了Jupyter笔记本，则可能会对其进行恶意修改。\n周三的帖子提供了几种方法，让用户可以检查他们的集群是否已经被攻破。\n魏茨曼写道：“Azure安全中心在过去检测到了多个针对Kubernetes集群的攻击活动，这些活动都有类似的访问载体：向互联网公开的服务。”但是，这是我们首次发现专门针对Kubeflow环境的攻击。", "note_en": "Attackers recently hijacked powerful machine-learning clusters inside Microsoft’s Azure cloud-computing service so that they could mine cryptocurrency at the expense of the customers who rented them, the company said Wednesday.\n The nodes, which were misconfigured by customers, made the perfect target for so-called cryptojacking schemes. Machine-learning tasks typically require vast amounts of computing resources. By redirecting them to perform the compute-intensive workloads required to mine digital coins, the attackers found a means to generate large amounts of currency at little or no cost.\n The infected clusters were running Kubeflow, an open source framework for machine-learning applications in  Kubernetes, which is itself an open source platform for deploying scalable applications across large numbers of computers. Microsoft said compromised clusters it discovered numbered in the “tens.” Many of them ran an image available from a public repository, ostensibly to save users the hassle of creating one themselves. Upon further inspection, Microsoft investigators discovered it contained code that surreptitiously mined the Monero cryptocurrency.\n  After finding the infected clusters, investigators turned their attention to how the machines were compromised. For security, the dashboard that allows administrators to control Kubeflow is, by default, accessible only through  istio ingress, a gateway that’s typically located at the edge of the cluster network. The default setting prevents people on the Internet at large from accessing the dashboard and making unauthorized changes to the cluster.\n In a  post published Wednesday, Yossi Weizman, a security-research software engineer in the Azure Security Center, said that some users change the setting.\n “We believe that some users chose to do it for convenience,” Weizman wrote. “Without this action, accessing the dashboard requires tunneling through the Kubernetes API server and isn’t direct. By exposing the Service to the Internet, users can access the dashboard directly. However, this operation enables insecure access to the Kubeflow dashboard, which allows anyone to perform operations in Kubeflow, including deploying new containers in the cluster.”\n Once attackers have access to the dashboard, they have multiple options for deploying backdoored containers in the cluster. For instance, attackers can create what’s known as a  Jupyter Notebook server that runs on the cluster. They can then place a malicious image inside of the Jupyter Notebook. If a Jupyter Notebook is already installed, it can be maliciously modified.\n Wednesday’s post provides several ways that users can check if their cluster has been compromised.\n “Azure Security Center has detected multiple campaigns against Kubernetes clusters in the past that have a similar access vector: an exposed service to the Internet,” Weizman wrote. “However, this is the first time that we have identified an attack that targets Kubeflow environments specifically.”", "posttime": "2020-06-12 06:28:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "密码,微软,microsoft,劫持者,hijack", "title": "密码劫持者劫持了微软Azure中强大的机器学习集群", "title_en": "Cryptojackers hijack powerful machine-learning clusters in Microsoft’s Azure", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/06/machine-learning-clusters-in-azure-hijacked-to-mine-cryptocurrency/", "via": "", "real_tags": ["密码", "微软", "microsoft", "劫持者", "hijack"]}]