[{"category": "", "categoryclass": "", "imagename": "21376bc9b9b767aec1127e3ab41d16f8.jpg", "infoid": 1002278, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "麻省理工学院媒体实验室(MIT‘s Media Lab)本周证实，由于被指向赞助商和公众夸大了该项目的结果，该项目于上月悄悄结束。该项目旨在推广在家中的迷你温室里种植食物。\n麻省理工学院(Massachusetts Institute Of Technology)还宣布，将向国务院环境保护部支付1.5万美元的罚款，因为该项目名为开放农业倡议(Open Agriculture Initiative，简称OpenAg)，将化学物质不当处置到波士顿郊外一个研究中心的一口井里，该研究所在那里进行了一些实验。麻省理工学院承诺关闭油井，因为OpenAg将不再在那里进行研究。\n麻省理工学院的声明包含在一封简短的电子邮件中，其依据是OpenAg的首席研究科学家凯勒布·哈珀(Caleb Harper)已于4月30日停止在该大学的工作。\n“当他在麻省理工学院媒体实验室领导开放农业计划时，麻省理工学院已经关闭了，”一位女发言人在电子邮件中说。该大学以保密为由，不愿详细说明哈珀离开的原因。哈珀没有回复手机上的留言。\nOpenAg项目是哈珀的创意，他提议设计和部署小型高科技温室，以个人食品计算机的形式销售，旨在让农作物在稀薄的空气中茁壮成长，没有土壤或阳光，并在精确控制的条件下生长。该项目还包括在马萨诸塞州米德尔顿(Middleton)的航运集装箱中安置更大的“食品服务器”，那里发生了不当处置。\n这个想法是公众可以使用气候控制设备来发现和跟踪各种作物的最佳条件。哈珀将他的计划描述为拥有“第四次农业革命”的潜力，OpenAg从CBS新闻节目“60分钟”、“华尔街日报”和其他媒体那里获得了积极的媒体关注。\n但在该实验室工作的科学家说，这些设备从来没有像设计的那样工作，哈珀没有向赞助商或采访承认这一点，而是坚称一切都很好。有时，实验室成员被告知在拍照之前在商店购买植物，刷去灰尘，然后把它们放进食物电脑里。\n通过关闭OpenAg，麻省理工学院希望在媒体实验室重整旗鼓，该实验室自9月份以来一直没有领导者。前导演伊藤忠一(Joichi Ito)在与去年在曼哈顿监狱自杀的性犯罪者杰弗里·爱泼斯坦(Jeffrey Epstein)的财务联系被曝光后，迫于压力辞职。今年1月，该大学发布了一份报告，披露了伊藤和爱泼斯坦之间的八次单独的校园会面，爱泼斯坦总共向媒体实验室捐赠了52.5万美元。\n2017年，伊藤和爱泼斯坦的一次会面包括哈珀。根据麻省理工学院的报告，第二年，伊藤努力从爱泼斯坦那里获得了150万美元的捐款，以支持OpenAg的研究。这笔捐款从未兑现。", "note_en": "A high-profile research project at  M.I.T.’s Media Lab that promoted growing food at home in mini-greenhouses was quietly closed last month  amid allegations that its results were exaggerated to sponsors and the public, the university confirmed this week.\n The Massachusetts Institute of Technology also  announced that it would pay a $15,000 fine to the State Department of Environmental Protection because the project, the Open Agricultural Initiative, or OpenAg for short, improperly disposed chemicals into a well at a research center outside Boston where it conducted some experiments. M.I.T. promised to close the well since OpenAg would no longer be conducting research there.\n M.I.T.’s announcement was contained in a brief email and hinged on the fact that the principal research scientist at OpenAg, Caleb Harper, had stopped working at the university as of April 30.\n  “As he led the Open Agriculture Initiative at the M.I.T. Media Lab, it is closed at M.I.T.,” a spokeswoman said in the email. The university wouldn’t elaborate on why Mr. Harper was leaving, citing confidentiality. Mr. Harper did not respond to a message left on his phone.\n The OpenAg project was the brainchild of Mr. Harper, who proposed designing and deploying small high-tech greenhouses, marketed as personal food computers, meant to allow crops to thrive in thin air, without soil or sunlight and under precisely controlled conditions. The project also included larger “food servers” housed in shipping containers in Middleton, Mass., where the improper disposal occurred.\n The idea was that the public could use the climate-controlled devices to discover and track the optimal conditions for various crops. Mr. Harper described his plan as holding the potential for a “fourth agricultural revolution,” and OpenAg received positive media attention from the CBS News program “60 Minutes,” The Wall Street Journal and other outlets.\n But scientists who worked at the lab said that the devices never worked as designed and that, rather than admit this to sponsors or in interviews, Mr. Harper insisted all was well. At times, members of the lab were told to buy plants at a store, brush off the dirt and place them inside the food computers before a photo shoot.\n  By closing OpenAg, M.I.T. is hoping to right the ship at the Media Lab, which has been without a leader since September. The former director, Joichi Ito,  resigned under pressure after revelations of his financial connections to Jeffrey Epstein, the convicted sex offender who killed himself in a Manhattan jail last year. In January, the university issued  a report that disclosed eight separate on-campus meetings between Mr. Ito and Mr. Epstein, who donated a total of $525,000 to the Media Lab.\n One meeting in 2017 between Mr. Ito and Mr. Epstein included Mr. Harper. The next year, according to the M.I.T. report, Mr. Ito worked to obtain a $1.5 million donation from Mr. Epstein to support research at OpenAg. The donation never materialized.", "posttime": "2020-05-16 03:32:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,closes,openag", "title": "麻省理工学院在科学家提出质疑后关闭“食品计算机”项目", "title_en": "MIT Closes ‘Food Computer’ Project After Scientists Raised Doubts", "transed": 1, "url": "https://www.nytimes.com/2020/05/13/business/media/mit-closes-food-computer-project.html", "via": "", "real_tags": ["科学家", "closes", "openag"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002276, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这篇文章的大多数评论中，有人问我为什么选择图形数据库而不是其他东西？这是一个很难回答的问题，因为我目前的经验仅限于图形数据库方面。我猜你也在想同样的事情，所以这是我迄今为止最好的回答。在我职业生涯的这个阶段，如果我在编写金融软件，我只会选择关系型数据库。关系数据库是非常严格的，所以您需要真正确保您事先了解您的数据。更改数据库是一项很大的工作，但如果设计正确，数据库将为您提供非常高级别的完整性，并且您可以获得良好的性能。这些数据库很难分发和扩展，因此最终往往会出现单个实例，这些实例非常大，需要进行复制才能进行备份。云提供商今天拥有应该可以扩展的关系数据库，但我没有使用它们的经验。我花了7年时间在MongoDB(文档数据库)上构建产品。这些数据库带来了分布式可伸缩性和大量数据灵活性的承诺。分布式可伸缩性非常复杂(因为它需要分片)，而且它们从未像关系数据库那样可靠。如果数据完整性不是问题，并且您的数据不断变化，那么这些数据库非常棒。我现在正在学习Dgraph(图形数据库)和GraphQL。我真的很喜欢我看到的东西。Dgraph是一个分布式的、可伸缩的数据库，它在云中工作，并为该环境从头构建。它确实需要一个模式，以便您可以获得数据完整性，但它不那么严格，因此您可以更灵活地进行更改。Dgraph支持事务，但我还没有尝试过这一点。本文旨在帮助您快速掌握Dgraph和GraphQL。我希望这个帖子在我几个月前开始工作时就存在了。GraphQL有很多文档，但是在我理解我将在这篇文章中介绍的材料之前，这些文档对我来说都没有意义。在这篇文章中，我将教您定义GraphQL模式的基础知识，然后向您展示Dgraph从该模式生成的GraphQL CRUD API。之后，我将向您展示如何使用称为GraphQL Playround的漂亮的图形、交互式、浏览器内GraphQL IDE来访问API。在这篇文章的最后，我列出了审查者的问题和Dgraph工程团队的答案。这篇文章的灵感来自于我与Dgraph合作的一个名为“旅行”的项目。Travel项目是一个初学者工具包，类似于我用来教授围棋应用程序开发的Service项目。Travel项目专注于学习如何使用Dgraph和GraphQL在围棋中编写生产应用程序。旅游项目提供了一个城市的信息，在那里收集了四个点的数据并进行了相关。清单1 TYPE City{id：id！#MANDIRED，标量TYPE，Lookup Lat：Float！#MANDIRED，标量类型LNG：FLOAT！#MANDIRED，标量类型名称：String！@Search(by：[Exact])#MANDIRED，标量类型，可搜索咨询：咨询#非强制，自定义类型天气：天气#非强制，自定义类型地点：[Place]#非强制，自定义类型，列表}类型咨询{id：id！#MANDIRED，标量类型，查找大陆：String！#MANDIRED。标量类型COUNTRY_CODE：STRING！#MANDIRED，标量类型LAST_UPDATED：STRING#NOT-MANDIRED，标量类型消息：STRING#NOT-MANDIRED，标量类型SCORE：FLOAT！#MANDIRED，标量类型来源：String#NOT-MANDITY，标量类型}类型位置{id：id！#MANDRED，标量类型查找地址：String#NOT-MANDIRED，标量类型AVG_USER_RATING：FLOAT#NOT-MANDITY，标量类型CITY_NAME：STRING！#。标量类型LNG：FLOAT！#MANDIRED，标量类型LOCATION_TYPE：[string]#NOT-MANDIRED，标量类型，列表名称：STRING！@search(by：[Exact])#MANDIRED，可搜索NO_USER_RATING：INT#NOT-MANDIRED，标量类型PLACE_ID：STRING！#MANDIRED，标量类型PHOTO_ID：String#NOT-MANDIRED，标量类型}类型天气{id：id！#MANDIRED，标量类型，LOOKUP CITY_NAME：STRING！标量类型Feel_Like：FLOAT#非强制，标量类型湿度：INT#非强制，标量类型压力：INT#非强制，标量类型日出：INT#非强制，标量类型日落：INT#非强制，标量类型TEMP：FLOAT#非强制，标量类型TEMP_MIN：FLOAT#非强制，标量类型TEMP_MAX：FLOAT#非强制，标量类型可见性：String#NOT-MAND，标量类型WIND_DIRECTION：INT#NOT。\n清单1显示了应用程序的完整GraphQL模式。我已经添加了注释，这些注释分解了模式定义中的每个字段(谓词)。这应该为您理解SYNT提供了一个很好的起点\n清单12显示了用于启动和运行Dgraph的docker run命令。请注意，此版本的Dgraph不是用于生产的消息。使用此版本进行本地开发和测试。端口8080是为GraphQL公开的端口。Dgraph启动并运行后，下一步是创建模式。创建模式的最快方法是运行curl命令。清单13curl-H&#34；Content-Type：Application/json&#34；http://localhost:8080/admin/schema-XPOST-d$&#39；type City{id：id！咨询：咨询LAT：彩车！液化天然气：漂浮！名称：string！@search(by：[Exact])地点：[place]weet：weet}类型咨询{id：id！大陆：弦！国家：字符串！COUNTRY_CODE：字符串！LAST_UPDATED：String消息：String分数：Float！来源：string}类型Place{id：id！地址：string AVG_USER_RATING：FLOAT CITY_NAME：STRING！gaps_url：string lat：Float！液化天然气：漂浮！location_type：[string]name：string！@search(by：[Exact])no_user_Rating：int place_id：string！Photo_id：String}类型天气{id：id！CITY_NAME：字符串！描述：string Feel_Like：浮动湿度：INT压力：INT日出：INT日落：INT TEMP：FLOAT TEMP_MIN：FLOAT TEMP_MAX：FLOAT可见性：STRING WIND_DIRECTION：INT WIND_SPEED：Float}&#39；OUTPUT{&#34；data&#34；：{&#34；code&#34；：&#34；Success&#34；，&#34；Message&#34；：&#34；Done&#34；}}。\n清单13显示了创建模式的curl命令。复制、粘贴并在终端中运行curl命令。完成后，您应该会看到显示的输出。GraphQL游乐场是一个图形化、交互式、浏览器内的GraphQL IDE，由Prisma创建，基于GraphiQL。这是一个很好的工具，用于验证模式和数据在数据库中是否得到正确管理。该链接提供对三大操作系统的桌面应用程序的访问。下载应用程序并使其运行后，您应该会看到以下内容。图1选择URL端点选项并在文本框中键入http://localhost:8080，如图1所示，然后点击Open按钮。图2假设您让Dgraph在清单12中运行，您应该看到没有连接错误、一个空的工作区和右侧的两个选项卡，如图2所示。由于“暗”主题非常暗，我将把主题更改为“亮”。为此，请选择应用程序右上角的齿轮图标，并将编辑器的主题设置从&#34；暗&#34；更改为&#34；亮&#34；，然后单击保存。清单14更改主题后，GraphQL游乐场应该如下所示。图3图3显示了将主题更改为灯光后GraphQL游乐场应该是什么样子。右侧的两个选项卡DOCS和SCHEMA提供模式信息。DOCS选项卡是CRUD API的交互式超链接视图。模式选项卡提供整个模式的平面视图。图4图4显示了Schema选项卡中平面模式的部分视图。该模式不仅显示您提供的数据定义，还显示由Drgaph生成的所有类型和CRUD API。有两种类型很重要，因为它们表示CRUD API。清单15类型突变{addCity(input：[AddCityInput！]！)：AddCityPayload updateCity(input：UpdateCityInput！)：UpdateCityPayload delete City(filter：CityFilter！)：DeleteCityPayload addConsulting(input：[AddAdvisoryInput！]！)：AddAdvisoryPayload updateConsulting(input：UpdateAdvisoryInput！)：UpdateAdvisoryPput！\n清单15显示了包含基于模式生成的突变API的突变类型。您会注意到，每种类型都有一个添加、更新和删除功能。这是因为ID谓词已添加到架构中的每种类型。清单16type query{getCity(id：id！)：City queryCity(filter：CityFilter Order：CityOrder First：Int Offset：Int)：[City]getConsulting(id：id！)：AdvisoryFilter Order：AdvisoryOrder First：Int Offset：：[AdvisoryOrder First：Int Offset：Int)：[AdvisorygetPlace(id：id！)：Place queryPlace(Filter：PlaceFilter Order：PlaceOrder First：Int Offset：Int)：[。\n清单16显示了包含基于模式生成的查询API的查询类型。您可以看到，每种类型都有一个获取和查询函数。GET函数之所以存在，是因为向架构中的每个类型添加了ID谓词。默认情况下，每种类型都有一个查询功能。不用担心索引，当查询函数第一次在特定谓词上运行时，会创建索引。", "note_en": "In most of the reviews for this post, I was asked why choose a  graph database over something else? This is a hard question to answer since my experience right now is limited on the graph database side. My guess is you’re wondering the same thing, so this is my best answer to date. At this point in my career, I would only choose a  relational database if I was writing financial software. Relational databases are very rigid so you need to really make sure you understand your data upfront. Changing the database is a big effort, but the database when designed correctly will give you very high levels of integrity and you can get good performance. These databases are hard to distribute and scale so you tend to end up with single instances that are very large and require replication for backup. The cloud providers have relational databases today that are supposed to scale, but I have no experience with them. I spent 7 years building products on MongoDB ( document database). These databases come with the promise of distributed scalability and lots of data flexibility. The distributed scalability is very complicated (since it requires sharding) and they have never been as reliable as the relational databases. If data integrity is not an issue and your data is constantly changing, these databases are great. I am now learning Dgraph (graph database) and GraphQL. I am really liking what I see. Dgraph is a distributed scalable database that works in the cloud and built from the ground up for that environment. It does require a schema so you can get the data integrity, but it’s not as rigid so you have more flexibility to make changes. Dgraph supports transactions, but I have not played with that yet.  This post is intended to help you get up and running quickly with Dgraph and GraphQL. I wish this post existed when I started several months ago. There is a world of documentation out there for GraphQL, but none of it made sense to me until I understood the material I will present in this post. In this post, I will teach you the basics of defining a GraphQL schema, and then show you the GraphQL CRUD API that Dgraph generates from that schema. After that, I will show you how to access the API using a nice graphical, interactive, in-browser GraphQL IDE called  GraphQL Playground. At the end of this post, I listed questions reviewers had and answers from the Dgraph engineering team.  The inspiration for this post is a project I’ve been working on with Dgraph called  Travel. The Travel project is a starter kit similar to the  Service project I use to teach application development in  Go. The Travel project is focused on learning how to write production applications in Go using Dgraph and GraphQL. The Travel project provides information for a city where four points of data are gathered and related. Listing 1 type City { id: ID! # mandatory, scalar type, lookup lat: Float! # mandatory, scalar type lng: Float! # mandatory, scalar type name: String! @search(by: [exact]) # mandatory, scalar type, searchable advisory: Advisory # not-mandatory, custom type weather: Weather # not-mandatory, custom type places: [Place] # not-mandatory, custom type, list}type Advisory { id: ID! # mandatory, scalar type, lookup continent: String! # mandatory, scalar type country: String! # mandatory, scalar type country_code: String! # mandatory, scalar type last_updated: String # not-mandatory, scalar type message: String # not-mandatory, scalar type score: Float! # mandatory, scalar type source: String # not-mandatory, scalar type}type Place { id: ID! # mandatory, scalar type, lookup address: String # not-mandatory, scalar type avg_user_rating: Float # not-mandatory, scalar type city_name: String! # mandatory, scalar type gmaps_url: String # not-mandatory, scalar type lat: Float! # mandatory, scalar type lng: Float! # mandatory, scalar type location_type: [String] # not-mandatory, scalar type, list name: String! @search(by: [exact]) # mandatory, scalar type, searchable no_user_rating: Int # not-mandatory, scalar type place_id: String! # mandatory, scalar type photo_id: String # not-mandatory, scalar type}type Weather { id: ID! # mandatory, scalar type, lookup city_name: String! # mandatory, scalar type description: String # not-mandatory, scalar type feels_like: Float # not-mandatory, scalar type humidity: Int # not-mandatory, scalar type pressure: Int # not-mandatory, scalar type sunrise: Int # not-mandatory, scalar type sunset: Int # not-mandatory, scalar type temp: Float # not-mandatory, scalar type temp_min: Float # not-mandatory, scalar type temp_max: Float # not-mandatory, scalar type visibility: String # not-mandatory, scalar type wind_direction: Int # not-mandatory, scalar type wind_speed: Float # not-mandatory, scalar type}\n Listing 1 shows the complete GraphQL schema for the application. I have added comments that break down each field (predicate) in the schema definition. That should give you a good starting point for understanding the syntax you see. I will break down each of the unique aspects of the syntax a bit more. GraphQL has a set of default  scalar types. Listing 2 Int: Signed 32‐bit integer.Float: Signed double-precision floating-point value.String: UTF‐8 character sequence.DateTime: string in RFC3339 formatBoolean: true or false.ID: Auto-generated unique id.\n Listing 2 shows the set of default scalar types provided by GraphQL. These are the basic types provided by any database or programming language. Listing 3  Listing 3 shows the declaration of the  id predicate using the scalar type  ID. This scalar type auto-generates a unique ID for any node of data that is added to the database. Dgraph physically organizes the data based on this ID so a lookup can be performed quickly. This type is also a marker that Dgraph uses to build a full GraphQL CRUD API for the type. Listing 4 type City { id: ID! # mandatory, scalar type, lookup lat: Float! # mandatory, scalar type}type Advisory { continent: String! # mandatory, scalar type}\n Listing 4 shows three predicates in the schema using the exclamation point ( !). This indicates to the database that data for these predicates is required for any add or update operation. When the exclamation point is missing, the predicate is allowed to be null. Listing 5 type City { places: [Place] # not-mandatory, custom type, list}type Place { location_type: [String] # not-mandatory, scalar type, list}\n Listing 5 shows two predicates declared as a list by using square brackets around the type declaration. Listing 6  Listing 6 shows a field declared as searchable by an exact string  search. There are other options to choose from. Listing 7 input StringExactFilter { eq: String # Equal to le: String # Less than or equal lt: String # Less than ge: String # Greater than or equal gt: String # Greater than}input StringTermFilter { allofterms: String # Match all words provided: &#34;sydney melbourne&#34; anyofterms: String # Match any words provided: &#34;sydney melbourne&#34;}input StringFullTextFilter { alloftext: String # Match all words provided: &#34;sydney melbourne&#34; anyoftext: String # Match any words provided: &#34;sydney melbourne&#34;}input StringRegExpFilter { regexp: String # Match any city with ney: &#34;/.*ney.*/&#34;}\n Listing 7 shows the different string-type searches you can choose from based on  input types defined by Dgraph. When a field is searchable, Dgraph builds GraphQL query API’s for the type based on the search filter selected. Listing 8  Listing 8 shows you how to define searchable predicates for some of the other scalar types. Listing 9 input FloatFilter { eq: Float le: Float lt: Float ge: Float gt: Float}input IntFilter { eq: Int le: Int lt: Int ge: Int gt: Int}Boolean doesn’t have a special input filter type.\n Listing 9 shows the other scalar type searches you can choose from based on  input types that are defined by Dgraph. The  Boolean type does not have a special  input type defined.  The best way to run Dgraph on your local machine is to use Docker. If you don’t have Docker installed yet, then please follow this  guide from Docker. As of the writing of this post, version 20.03.1 is the latest release of Dgraph. To download this version of Dgraph, just use the  docker pull command. Listing 10 $ docker pull dgraph/standalone:v20.03.1OUTPUTv20.03.1: Pulling from dgraph/standalone5bed26d33875: Pull completef11b29a9c730: Pull complete930bda195c84: Pull complete78bf9a5ad49e: Pull complete56d14a4dc4d7: Pull completeb2e6192c62a3: Pull complete02dca55cd04c: Pull completeca9eba547da7: Pull completee4c262d6c0b0: Pull completeDigest: sha256:22d2b55b3cb4d23032de2aa8b484ca83bebcfbba102010c259b332a239b676a6Status: Downloaded newer image for dgraph/standalone:v20.03.1docker.io/dgraph/standalone:v20.03.1\n Listing 10 shows the  docker pull command that downloads a standalone version of Dgraph and prepares Dgraph to run inside a container. Once all the different file layers are downloaded, run the  docker images command to validate the pull. Listing 11  Listing 11 shows the call to  docker images and the expected output for the Dgraph image. To validate this image works, spin up a container. Listing 12 $ docker run -it -p 8080:8080 dgraph/standalone:v20.03.1OUTPUTWarning: This standalone version is meant for quickstart purposes only. It is NOT RECOMMENDED for production environments.2020/04/10 14:07:40 Listening on :8000...[Decoder]: Using assembly version of decoder\n Listing 12 shows the  docker run command to use to get Dgraph up and running. Notice the message saying this version of Dgraph is not meant for production use. Use this version for local development and testing. Port  8080 is the port exposed for GraphQL.  With Dgraph up and running, the next step is to create a schema. The quickest way to create the schema is to run a  curl command. Listing 13 curl -H &#34;Content-Type: application/json&#34; http://localhost:8080/admin/schema -XPOST -d $&#39;type City { id: ID! advisory: Advisory lat: Float! lng: Float! name: String! @search(by: [exact]) places: [Place] weather: Weather}type Advisory { id: ID! continent: String! country: String! country_code: String! last_updated: String message: String score: Float! source: String}type Place { id: ID! address: String avg_user_rating: Float city_name: String! gmaps_url: String lat: Float! lng: Float! location_type: [String] name: String! @search(by: [exact]) no_user_rating: Int place_id: String! photo_id: String}type Weather { id: ID! city_name: String! description: String feels_like: Float humidity: Int pressure: Int sunrise: Int sunset: Int temp: Float temp_min: Float temp_max: Float visibility: String wind_direction: Int wind_speed: Float}&#39;OUTPUT{&#34;data&#34;:{&#34;code&#34;:&#34;Success&#34;,&#34;message&#34;:&#34;Done&#34;}}\n Listing 13 shows the  curl command that creates the schema. Copy, paste, and run that  curl command in your terminal. After it completes, you should see the output as presented.  The  GraphQL Playground is a graphical, interactive, in-browser GraphQL IDE, created by  Prisma and based on  GraphiQL. This is a nice tool for verifying that the schema and data are properly managed in the database. The link provides access to desktop apps for the three major operating systems. Once you download the application and get it running, you should see this. Figure 1  Select the  URL ENDPOINT option and type  http://localhost:8080 in the text box as seen in figure 1. Then hit the  OPEN button. Figure 2   Assuming you left Dgraph running at listing 12, you should see no connection errors, an empty workspace, and two tabs on the right as shown in figure 2. Since the “dark” theme is very dark, I am going to change the theme to “light”. To do that, select the gear icon in the top right corner of the application and change the  editor.theme setting from  &#34;dark&#34; to  &#34;light&#34; and hit save. Listing 14  After changing the theme, the GraphQL Playground should look like this. Figure 3   Figure 3 shows how GraphQL Playground should look after changing the theme to  &#34;light&#34;. The two tabs on the right,  DOCS and  SCHEMA provide schema information. The  DOCS tab is an interactive, hyper-linked view of the CRUD API. The  SCHEMA tab provides a flat view of the entire schema. Figure 4   Figure 4 shows you a partial view of the flat schema from the  SCHEMA tab. This schema not only shows the data definitions you provided, but all the types and the CRUD API generated by Drgaph.  There are two types that are important since they represent the CRUD API. Listing 15 type Mutation { addCity(input: [AddCityInput!]!): AddCityPayload updateCity(input: UpdateCityInput!): UpdateCityPayload deleteCity(filter: CityFilter!): DeleteCityPayload addAdvisory(input: [AddAdvisoryInput!]!): AddAdvisoryPayload updateAdvisory(input: UpdateAdvisoryInput!): UpdateAdvisoryPayload deleteAdvisory(filter: AdvisoryFilter!): DeleteAdvisoryPayload addPlace(input: [AddPlaceInput!]!): AddPlacePayload updatePlace(input: UpdatePlaceInput!): UpdatePlacePayload deletePlace(filter: PlaceFilter!): DeletePlacePayload addWeather(input: [AddWeatherInput!]!): AddWeatherPayload updateWeather(input: UpdateWeatherInput!): UpdateWeatherPayload deleteWeather(filter: WeatherFilter!): DeleteWeatherPayload}\n Listing 15 shows the  Mutation type that contains the mutation API that was generated based on the schema. You’ll notice there is an  add,  update, and  delete function for each type. This is because the  ID predicate was added to each type in the schema. Listing 16 type Query { getCity(id: ID!): City queryCity(filter: CityFilter order: CityOrder first: Int offset: Int): [City] getAdvisory(id: ID!): Advisory queryAdvisory(filter: AdvisoryFilter order: AdvisoryOrder first: Int offset: Int): [Advisory] getPlace(id: ID!): Place queryPlace(filter: PlaceFilter order: PlaceOrder first: Int offset: Int): [Place] getWeather(id: ID!): Weather queryWeather(filter: WeatherFilter order: WeatherOrder first: Int offset: Int): [Weather]}\n Listing 16 shows the  Query type that contains the query API that was generated based on the schema. You can see there is a  get and  query function for each type. The  get function exists because the  ID predicate was added to each type in the schema. Each type will get a  query function by default. Don’t worry about indexes, the first time a  query function runs on a specific predicate, an index is created.It’s important to note that all interaction with the database will be through the GraphQL CRUD API. If you don’t have a function that you need, you will need to change the schema to have Dgraph generate it for you or you will need to add a custom function yourself.  Now I will execute the  addCity,  getCity and  queryCity functions from inside the GraphQL Playground to show you how to access this API in a GraphQL format. Listing 17 mutation { addCity(input: [{ name: &#34;sydney&#34; lat: -33.865143 lng: 151.209900 }]) { city { id name lat lng } }}\n Listing 17 shows how to call the  addCity function to add a city to the database. Notice how the API is structured around the type system defined by Dgraph in the schema. Listing 18 type Mutation { addCity(input: [AddCityInput!]!): AddCityPayload}input AddCityInput { advisory: AdvisoryRef lat: Float! lng: Float! name: String! places: [PlaceRef] weather: WeatherRef}type AddCityPayload { city(filter: CityFilter, order: CityOrder, first: Int, offset: Int): [City] numUids: Int}input CityFilter { id: [ID!] name: StringExactFilter and: CityFilter or: CityFilter not: CityFilter}\n Listing 18 shows all the supporting types used to define the  addCity function. Having access to the schema and knowing how the APIs are structured will help you understand how to use the full API generated by Dgraph. Copy and paste the code in listing 17 into GraphQL Playground and click the play button. Figure 5   Figure 5 shows the  addCity function call and the result in the GraphQL Playground. To retrieve the city from the database, there is a lookup function named  getCity, and a query function named  queryCity. Listing 19  Listing 19 shows the  getCity function call. Copy and paste this call into the GraphQL Playground and click the play button. Figure 6   Figure 6 shows the  getCity function call and the result in the GraphQL Playground. Listing 20 query { queryCity(filter: { name: { eq: &#34;sydney&#34; } }) { id name lat lng }}\n Listing 20 shows the  queryCity function call. Copy and paste this call into the GraphQL Playground and hit the play button. Figure 7   Figure 7 shows the  queryCity function call and the result in the GraphQL Playground.  To shutdown the database, find the container id and then use the  docker stop command. Listing 21  Listing 21 shows how to find the id of the running Dgraph container and then stop and remove it. You can also hit  C in the terminal window running Dgraph to perform these same actions.  In this post, I showed you how to run Dgraph locally, the basics of defining a GraphQL schema, how to use the generated GraphQL CRUD API, and how to install and use a tool called GraphQL Playground. All these things are necessary to get up and running with Dgraph for application development. In future posts, I will show you how to leverage Dgraph, GraphQL, and the auto-generated CRUD API to build production based applications in Go. I’ll do that with the  Travel project that is available today. For now, take the time to generate your own schema and look deeper at the  schema documentation provided by Dgraph. There are interfaces, enumerations, and inverse edges that I didn’t cover in this post. There are other interesting types and details in the documentation so do take a look.  Do we need to add an ID predicate on every type we are defining? You aren’t required to add an ID to a type. Types with IDs are provided a  get query function and  update mutation function because they can be identified uniquely. Given a type in the schema named  Product with an ID predicate: Query Functions Provided: - getProduct - queryProduct Mutation Functions Provided: - addProduct - updateProduct - deleteProduct Given a type in the schema named  Product without an ID predicate: Query Functions Provided: - queryProduct Mutation Functions Provided: - addProduct Is there a way to have a user defined ID? You can use  @id on a  String! field for user-defined IDs. See the example in  https://graphql.dgraph.io/docs/walk-through-example/. This ensures that 1) the field is unique and 2) automatically adds the hash index to the field for searching. How would user defined ID’s affect performance and api generation? User-defined IDs’s  get query would take the  String as input for the query. Mutations would require an internal lookup of the user-defined ID to find the node. The GraphQL API would allow you to query and mutate the type based on your user-defined ID instead of a hexadecimal number for the ID. Is the mutation and Query API a standard GraphQL API setup or is this something special in Dgraph? Query and Mutation are standard operations in GraphQL. Do all databases that support GraphQL provide the CRUD api’s like Dgraph? With Dgraph, you’ll define your GraphQL schema and Dgraph automatically generates a full GraphQL API to access the database. With other database systems, GraphQL support is typically done outside the database where you must also set up your own custom resolvers to translate GraphQL queries into the underlying database query language.", "posttime": "2020-05-16 02:16:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "graphql,类型", "title": "Dgraph、GraphQL、Schemas和CRUD-Ardan实验室", "title_en": "Dgraph, GraphQL, Schemas, & CRUD – Ardan Labs", "transed": 1, "url": "https://www.ardanlabs.com/blog/2020/05/dgraph-graphql-schemas-crud.html", "via": "", "real_tags": ["graphql", "类型"]}, {"category": "", "categoryclass": "", "imagename": "197f59c8f156409ce6f6503d7d5fa50d.jpg", "infoid": 1002275, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "提交此表格即表示您确认已阅读并同意我们的隐私政策。\nZeoTap是一个客户智能平台，使品牌能够更好地了解客户并更好地预测他们的行为。它们跨多个社交媒体、广告技术、Martech和CRM平台集成和关联数据。该公司总部设在德国，强调消费者隐私和数据安全，拥有多种认证(如GDPR)，以确保跨市场的端到端合规性。\n在我们的Scylla峰会上，ZeoTap工程副总裁Sathish K S和首席数据工程师Saurabh Verma分享了ZeoTap如何应对身份解析和集成的挑战。他们展示了Saurabh所说的“由Scylla支持的世界上最大的原生JanusGraph数据库”，以满足跟踪和关联200亿个用户及其设备ID的需求。\nZeoTap使用Scylla和JanusGraph作为其Connect产品的一部分，这是一个确定性身份解决方案，可以将离线客户CRM数据与在线数字标识符关联起来。ZeoTAP从80多个合作伙伴那里获取数据，将这些数据分发到40多个目的地。\n作为身份解析的一个例子，Sathish举了一个人的例子，他可能有一到两部手机、一台平板电脑、一台IP电视，并且可能属于任何数量的忠诚度计划或俱乐部。这些设备和程序中的每一个都将为您生成一个标识符，外加您访问的每个站点的所有设备上的Cookie标识符。\n萨蒂什强调，“身份之间的联系，或者说联系，比个人身份更有价值。”这背后的商业案例，匹配测试和导出这些ID的能力，都是ZeoTap可以赚钱的。例如，客户可以提供一组100万个电子邮件地址，并询问其中有多少百分比可以与ZeoTap的已知用户数据进行匹配。他们还可以建立到表示该已知用户的其他标识符的传递链接。然后，用户可以将该数据导出到他们自己的系统。\n最重要的是，ZeoTap维护着完整的报告和合规机制，包括支持选择退出。他们还必须确保身份质量，并将其数据与多个第三方集成，同时保持数据“新鲜度”的短期服务级别协议。“这意味着您需要具有真正快速的接收和真正快速的查询性能。”\n他们最初的MVP实现使用Apache Spark批处理来关联他们所有的合作伙伴数据，并将输出结果存储到S3。然后，用户通过Amazon Athena查询和其他针对Amazon RedShift数据仓库的Apache Spark作业访问数据，以生成匹配测试、导出和报告。但是，当ZeoTap开始跨越30亿ID的规模时，他们看到他们的处理时间超过了一整天(24小时)，而他们的SLA通常在2到6小时的范围内。\nZeoTap查看了他们的要求。他们需要一个同时支持高级别读取和写入的系统。因为即使在分析数据的同时，您仍然可以有更多的数据涌入系统。在他们拥有30亿个ID的时候，他们的SLA最低为每秒50k次写入。他们还在寻找一种能够为数据提供开箱即用的生存时间(TTL)的数据库解决方案。\n对于读取工作负载，ZeoTap需要进行大量分析来匹配ID并检索(导出)链接ID上的数据，通常基于ID类型(Android、iOS、网站cookie)或属性(新近、质量分数或国家)等条件。\n萨蒂什随后谈到了他们的商业模式。ZeoTap不会从他们的合作伙伴那里购买数据。取而代之的是，他们提供了收入分享协议。因此，所有数据都必须标记，以注明是哪个数据合作伙伴提供的。当合作伙伴的数据被访问时，他们将获得ZeoTap赚取的收入的一部分。计数器对于计算合作伙伴从数据利用中获得的收入至关重要。\n深度过滤器是一种计算在结束一条连接线之前遍历图形的距离的方法。因此，他们的客户可以设置限制-在间接深度为4、5或10之后停止扫描。\n“是时候改变了。如果你看看我一直在说的，像“传递性”，“深度”，“联系”，“联系”之类的术语--这些都是你们在大学里学的图论。所以我们想，‘有没有一种ID图可以直接取代我的存储，并提供所有开箱即用的东西？’这就是ZeoTap开始评估图形数据库的过程。\nZeoTap依靠Apache Spark处理来自其合作伙伴的数据，并根据ID集为其客户提供分析以测试匹配，并基于其链接导出。他们的问题是图形数据库是否能够进行扩展以满足其苛刻的工作负载。\nSaurabh随后描述了查找本地图形数据库的过程。他们的解决方案需要提供四个属性：\nSaurabh再次强调，链接(边)比顶点更重要。这些链接有很多元数据。链接多久了？哪个数据合作伙伴向我们提供了此信息？质量分数也是链接属性。这就是为什么他们需要联系才能成为一等公民的原因。\n此外，看看他们的数据分析师团队，他们想要的东西对他们来说是可以理解的。这就是他们关注Apache Gremlin/Tinkerop的原因。在过去，执行SQL查询意味着他们必须进行更复杂的重量级连接，以便更深入地遍历。使用Gremlin，查询非常相似，也更容易理解。\n(SELECT*FROM IDMVP WHERE ID1=&#39；75d630a9-2d34-433e-b05f-2031a0342e42&#39；，IDTYPE1=&#39；id_MID_13&#39；以及ID2=&#39；5c557df3-df47-4603-64bc-5a9a63f22245&#39；，IDTYPE2=&#39；id_MID_4&#39；)//深度=1联合(SELECT*FROM IDMPT1，IDMVP T2 WHERE t1.id1=&#39；75d630a9-2d34-433e-b05f-2031a0342e42&#39；，t1.idtype1=&#39；ID_MID_13&#39；以及t2.id2=&#39；5c557df3-df47-4603-64bc-5a9a63f22245&#39；和t2.idtype2=&#39；id_MID_4&#39；)//Depth=2联合(SELECT*FROM IDMVP T1，IDMVP T2，IDMVP T3，其中t1.id1=&#39；75d630a9-2d34-433e-b05f-2031a0342e42&#39；和t1.idtype1=&#39；id_MID_13&#39；以及t3.id2=&#39；5c557df3-df47-4603-64bc-5a9a63f22245&#39；和t3.idtype2=&#39；ID_MID_4&#39；)//深度=3？\nSQL查询与Gremlin查询的并列比较。SQL查询包含629个字符，而Gremlin查询只有229个字符。如果需要更多级别的查询深度，则SQL查询将显著更长。\nZeoTAP随后从2018年8月开始进行概念验证(POC)，考虑适当的底层AWS EC2服务器群集上的一系列开源数据库：\n对于PoC，所有这些群集的复制系数仅为1。他们还在3x c5.18xLarge实例上创建了客户端群集配置。\n虽然Aerospike不是一个原生图形数据库，但ZeoTap对它很熟悉，并将其作为“B计划”选项，利用Aerospike中的UDF。\n他们的目标是测试代表其当时现有生产工作负载三倍的工作负载，以便能够根据当前的增长预期进行扩展。然而，Saurabh再次提醒观众，自那以后，他们已经增长到超过150亿个ID。\n他们的工作与标签属性图(LPG)模型非常一致，而不是资源描述框架(RDF)模型。(如果您不熟悉其中的区别，可以在此处阅读有关它们的更多信息。)。LPG模式达到了他们的预期，降低了数据的基数。\nZeoTap研究了整个系统的成本。Aerospike解决方案的成本会更高，因为它的内存(RAM)使用率很高。最终，他们决定将ScyllaDB支持的JanusGraph安装在SSD上，因为它价格实惠。\n“图形DB数据模型承诺了两件事：一是模式演化方面的极端灵活性，二是领域的表现力，”Sathish插话说。然后，为了证明这一点，Saurabh分享了ZeoTap数据模型的这个例子：\n每个顶点(白框)代表用户的数字身份，与其属性一起存储在JanusGraph中。它们可以包括设备的操作系统(Android或iOS)、国家(上面有西班牙和意大利的数据点)等等。\n边缘(连接方框的线)表示ZeoTap的合作伙伴提供的链接。在这些文件中，您可以看到共享该特定链接的数据合作伙伴的ID(DP1、DP2等)。在特定时间(T1、T2等)。他们还会给出一个质量分数。\n第一个是及物链。ZeoTap不存储预计算链接。每个查询都是在遍历时处理的。\n第二种是基于存储在顶点和边中的元数据过滤遍历。例如，基于国家/地区的过滤对于维护GDPR合规性至关重要。同样的做法也可以基于质量分数来完成。客户可能只想通过高质量的链接获得结果。\n三是数据模型的可扩展性。他们不能拥有要求他们根据数据模型的更改停止和重新启动数据库的数据库。所有更改都需要能够在运行中完成。在上面的示例中，“linkSource”被添加到其中一条边。如果不是数据合作伙伴，而是ZeoTap自己的启发式方法提供了联系，他们可以使用这一点。\n在生产中，ZeoTap在多个区域的AWS i3.4x大型节点上运行，每个区域有三个或四个节点。\nZeoTap在他们的MVP中开始是一个批量摄取过程，但在首先通过数据的重复数据消除和丰富过程后，变成了混合流和使用Apache Kafka批量摄取到JanusGraph中。这从最初的仅批处理流程中消除了许多令人痛苦的失败，并极大地减少了每天接收数亿个新数据点所需的时间。\n他们还发现，将顶点和边负载拆分成单独的Kafka流对于实现更高级别的每秒查询(QPS)非常重要，因为写入行为是不同的。顶点是单次写入，而边是查找和写入(先读后写)。\nZeoTAP工程师不仅开始测量每个节点的性能，还开始深入研究CPU利用率。他们观察到每个服务器核心每秒处理5k个事务(TPS)。\n对于遍历，Sathish警告用户要注意他们的“超级节点”，他将其分为两类。第一种情况是连接到许多其他节点的节点。第二个是它的深度不断增加的地方。\n萨蒂什提供的另一条建议是玩弄你的压缩策略。使用LevelTiered，ZeoTap每秒能够获得2.5倍以上的查询，并且并发客户端得到了更好的处理。\n他还展示了在服务器端过滤数据可能会如何导致延迟。对某些条件进行查询过滤可能需要2.3秒，而仅提取所有未过滤的数据可能只需要1秒。因此，对于他们来说，基于属性(属性和深度)的过滤是在应用层完成的。\nSaurabh随后谈到了ZeoTap开发的质量评分。它基于他们所谓的“AD评分”，即边缘一致性(A)除以边缘不一致性(D)的比率。它们还根据新近评分，然后通过事件稀有性调整对其进行修改，以得出最终质量分数。\nZeoTap还具有跨图遍历功能。这就是除了他们自己的数据之外，他们还可以搜索存储在单独的图形数据库中的第三方合作伙伴数据的地方。ZeoTap能够将这些第三方数据保存为Scylla中的单独密钥空间。针对这些的查询不是在数据库中链接在一起的，而是在应用层上链接在一起的。\n最后，ZeoTAP运行ID图质量分析，其结果被反馈到他们的OLTP和OLAP系统中，以一致地确保最高质量的数据。\n您可以通过观看下面的完整视频或查看我们技术讲座页面上的幻灯片来了解更多详细信息，以及了解ZeoTap的主要要点。如果您对Scylla上的JanusGraph在您自己的环境中如何工作有更多的问题，我们鼓励您与我们联系，或者加入我们的松弛来询问您在我们在线社区的同行。", "note_en": "By submitting this form, you are confirming you have read and agree to our  privacy policy.\n  Zeotap is a customer intelligence platform that enables brands to better understand their customers and better predict their behavior. They integrate and correlate data across a number of social media, adtech, martech and CRM platforms. Headquartered in Germany, the company emphasizes consumer privacy and data security, with multiple certifications (such as GDPR) to ensure end-to-end compliance across markets.\n At our Scylla Summit, Zeotap’s Vice President of Engineering, Sathish K S, and Principal Data Engineer Saurabh Verma shared how Zeotap addresses the challenge of identity resolution and integration. They presented what Saurabh described as the “world’s largest native JanusGraph database backed by Scylla” to meet the needs of tracking and correlating 20 billion IDs for users and their devices.\n  Zeotap uses Scylla and JanusGraph as part of their  Connect product, a deterministic identity solution that can correlate offline customer CRM data to online digital identifiers. Sourcing data from over 80 partners, Zeotap distributes that data out to over forty destinations.\n As an example of identity resolution, Sathish gave the example of a person who might have one or two mobile phones, a tablet, an IP television, and may belong to any number of loyalty programs or clubs. Each of these devices and each of these programs is going to generate an identifier for you, plus cookie identifiers across all your devices for each of the sites you visit.\n  Sathish emphasized, “The linkages, or the connections, between the identities are more valuable than the individual identities.” The business case behind this, the match test and the ability to export these IDs, are what Zeotap can monetize. For example, a customer can present a set of one million email addresses and ask what percentage of those can be matched against Zeotap’s known user data. They can also make a transitive link to other identifiers that represent that known user. The user can then export that data to their own systems.\n On top of this, Zeotap maintains full reporting and compliance mechanisms, including supporting opt-outs. They also have to ensure identity quality and integrate their data with multiple third parties, all while maintaining a short service level agreement for “freshness” of data. “That means you need to have real quick ingestion as well as real quick query performance.”\n Their original MVP implementation used Apache Spark batch processing to correlate all of their partner data, with output results stored to s3. Users then accessed data via Amazon Athena queries and other Apache Spark jobs against an Amazon Redshift data warehouse to produce match tests, exports and reports. But when Zeotap started crossing the three billion ID scale, they saw their processing going towards greater than a full day (twenty four hours), while their SLAs were often in the two to six hour range.\n Zeotap looked at their requirements. They needed a system that allowed for both high levels of reads and writes simultaneously. Because even as data is being analyzed you can still have more data pouring into the system. Their SLA, back at a time when they had three billion IDs, was 50k writes per second at a minimum. They were also looking for a database solution that provided Time To Live (TTL) for data right out of the box.\n For the read workload, Zeotap needed to do a lot of analytics to match IDs and retrieve (export) data on linked IDs, often based on conditions such as ID types (Android, iOS, website cookies), or properties (recency, quality score, or country).\n Sathish then spoke about their business model. Zeotap doesn’t buy data from their partners. They provide revenue sharing agreements instead. So all data has to be marked to note which data partner provided it. As a partner’s data is accessed they get a portion of the revenue that Zeotap earns. Counters are essential to calculate that partner revenue from data utilization.\n Depth filters are a method to calculate how far to traverse a graph before ending a line of linkage. So their customers can set limits — stop scanning after an indirection depth of four, or five, or ten.\n “It was time to change. If you look at it what I have been talking about, parlances like ‘transitivity,’ ‘depth,’ ‘connections,’ ‘linkages’ — these are all directly what you are studying in college in graph theory. So we thought, ‘is there an ID graph that can directly replace my storage and give all of this out of the box?&#39;” This is where Zeotap began the process of evaluating graph databases.\n  Zeotap relies upon Apache Spark to process data coming in from their partners, as well as to provide analytics for their clients based upon sets of IDs to test for matches, and to export based on its linkages. The question they had was whether a graph database would be able to scale to meet their demanding workloads.\n  Saurabh then described the process to find a native graph database. Their solution needed to provide four properties:\n  Again, Saurabh emphasized that the linkages (edges) were more important than the vertices. The linkages had a lot of metadata. How recent is the link? Which data partner gave us this information? Quality scores are also link attributes. This was why they needed the linkages to be first class citizens.\n Further, looking at their data analysts team, they wanted something that would be understandable to them. This is why they looked at  Apache Gremlin/Tinkerpop. In the past, doing SQL queries meant that they had to do more complex and heavyweight JOINs the deeper they wished to traverse. With Gremlin the queries are much similar and more comprehensible.\n (select * from idmvp\rwhere id1 = &#39;75d630a9-2d34-433e-b05f-2031a0342e42&#39; and idtype1 = &#39;id_mid_13&#39;\rand id2 = &#39;5c557df3-df47-4603-64bc-5a9a63f22245&#39; and idtype2 = &#39;id_mid_4&#39;) // depth = 1\runion\r\r(select * from idmvp t1, idmvp t2\rwhere t1.id1 = &#39;75d630a9-2d34-433e-b05f-2031a0342e42&#39; and t1.idtype1 = &#39;id_mid_13&#39;\rand t2.id2 = &#39;5c557df3-df47-4603-64bc-5a9a63f22245&#39; and t2.idtype2 = &#39;id_mid_4&#39;) // depth = 2\runion\r\r(select * from idmvp t1, idmvp t2, idmvp t3\rwhere t1.id1 = &#39;75d630a9-2d34-433e-b05f-2031a0342e42&#39; and t1.idtype1 = &#39;id_mid_13&#39;\rand t3.id2 = &#39;5c557df3-df47-4603-64bc-5a9a63f22245&#39; and t3.idtype2 = &#39;id_mid_4&#39;) // depth = 3?\n A side-by-side comparison of a SQL query to a Gremlin query. The SQL query weighs in at 629 characters, whereas the Gremlin query is only 229 characters. The SQL query would be significantly longer if more levels of query depth were required.\n Zeotap then began a proof of concept (POC) starting in August 2018 considering a range of open source databases on appropriate underlying AWS EC2 server clusters:\n  For the POC, all of these clusters had a replication factor of only 1. They also created a client cluster configuration on 3x c5.18xlarge instances.\n While Aerospike is not a native graph database, Zeotap was familiar with it, and included it as a “Plan B” option, utilizing UDFs in Aerospike.\n Their aim was to test a workload representative of three times their then-existing production workload, to be able to allow them to scale based on current expectations of growth. However, Saurabh reminded the audience again that they have since grown to over 15 billion IDs.\n Their work aligned well with the Label Property Graph (LPG) model, as opposed to the Resource Description Framework (RDF) model. (If you are not familiar with the difference, you can read more about them here.) The LPG mode met their expectations and lowered the cardinality of data.\n   Zeotap looked at the cost of the entire system. An Aerospike solution would have been more costly because of its high memory (RAM) usage. In the end, they decided upon JanusGraph backed by ScyllaDB on SSD because of its affordability.\n    “A graph DB data model promises two things: one is the extreme flexibility in terms of schema evolution, and another thing is the expressiveness of your domain,” Sathish interjected. Then to prove the point Saurabh shared this example of Zeotap’s data model:\n  Each vertex (white box) represents a user’s digital identity, stored with its properties in JanusGraph. They can include the device’s operating system (android or ios), the country (in the above there are data points both in Spain and Italy), and so on.\n The edges (lines joining the boxes) represent the linkages provided by Zeotap’s partners. In these you can see ids for the data partner that shared that particular linkage (dp1, dp2, etc.) at a particular time (t1, t2, etc.). They also assign a quality score.\n  The first is transitive links. Zeotap does not store pre-computed linkages. Every query is processed at the time of traversal.\n The second is to filter traversals based on metadata stored in the vertices and edges. For example, filtering based on country is vital to maintain GDPR compliance. The same could also be done based on quality score. A customer might want to get results with only high quality linkages.\n The third was extensibility of the data model. They cannot have a database that requires them to stop and restart the database depending on changes to the data model. All changes need to be able to be done on the fly. In the example above, “ linkSource” was added to one of the edges. They could use this in case it was not a data partner, but Zeotap’s own heuristic that provided the linkage.\n  In production, Zeotap runs on AWS i3.4xlarge nodes in multiple regions, with three or four nodes per region.\n Zeotap began with a batch ingestion process in their MVP, but changed to a mixed streaming and batch ingestion into JanusGraph using Apache Kafka after first passing through a de-duplicating and enriching process for their data. This removed a lot of painful failures from their original batch-only processes and cut back dramatically on the time needed to ingest hundreds of millions of new data points per day.\n  They also found splitting the vertex and edge loads into separate Kafka streams was important to achieve a higher level of queries per second (QPS), because write behavior was different. A vertex was a single write, whereas the edge was a lookup as well as a write (read-before-write).\n The Zeotap engineers also began to measure not just per-node performance, but drilled down to see CPU utilization. They observed 5k transactions per second (TPS) per server core.\n For traversals, Sathish warned users to be on the lookout for their “supernodes,” which he broke down into two classes. The first case is a node that is connected to many other nodes. A second is one where its depth keeps increasing.\n Another piece of advice Sathish offered was to play with your compaction strategies. With LevelTiered, Zeotap was able to obtain 2.5x more queries per second, and concurrent clients were better handled.\n He also showed how filtering data on the server side may be causing latencies. A query filtering for certain conditions could take 2.3 seconds, whereas just fetching all of the data unfiltered might take only 1 second. So for them filtering based on attributes (properties and depths) is instead done at the application layer.\n Saurabh then spoke about the quality scoring that Zeotap developed. It is based on what they call “AD scoring,” which is a ratio of edge agreement (A) divided by edge disagreement (D). They also score based on recency, which is then modified by an event rarity adjustment to derive the final quality score.\n    Zeotap also has across-graph traversals. This is where, beyond their own data, they may also search through third party partner data stored in separate graph databases. Zeotap is able to save this 3rd party data as separate keyspaces in Scylla. Queries against these are chained together not in the database, but instead on the application layer.\n Lastly, Zeotap runs ID graph quality analytics, the results of which are fed back into their OLTP and OLAP systems to consistently ensure the highest quality data.\n   You can find out more details, as well as learn Zeotap’s key takeaways, by watching the video in full below or checking out their slides on our  Tech Talks page. If you have more questions about how JanusGraph on Scylla may work in your own environment, we encourage you to  contact us, or to  join our Slack to ask your peers in our online community.", "posttime": "2020-05-16 02:15:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "database,数据库,janusgraph,graph,数据", "title": "基于Scylla和JanusGraph的可伸缩图形数据库", "title_en": "Scalable graph database with Scylla and JanusGraph", "transed": 1, "url": "https://www.scylladb.com/2020/05/14/zeotap-a-graph-of-twenty-billion-ids-built-on-scylla-and-janusgraph/", "via": "", "real_tags": ["database", "数据库", "graph", "数据"]}, {"category": "", "categoryclass": "", "imagename": "15db168c857f62def9909034bfe26c41.jpg", "infoid": 1002273, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当冰岛在2月28日感染首例冠状病毒时，整个设备立即开始行动。\n多亏了当地一家生物技术公司decode genology，该国已经对一些感染病毒的高风险人群进行了测试。一旦疾病的到来得到确认，它就开始在更大范围内迅速开展公开测试。与此同时，政府迅速建立了一支接触追踪器团队，采访那些诊断为阳性的人，并追踪他们曾接触过的人。\n在几周内，冰岛人也有了另一种高科技工具可供他们使用：一款政府支持的自动跟踪应用程序。\n4月初发射的Rakning C-19当时被誉为“更容易追踪传输”的一种方式。它跟踪用户的GPS数据，以汇编他们去过哪里的记录，允许调查人员-在得到许可的情况下-查看那些诊断为阳性的人是否有可能传播疾病。\n它很快就获得了吸引力：根据“麻省理工学院技术评论”的Covid Tracking Tracker，它是世界上所有接触式跟踪器中渗透率最高的，冰岛36.4万人口中有38%的人下载了它。\n但是，尽管这种早期部署和广泛使用，该国冠状病毒应对部门的一名高级人物表示，与电话等人工追踪技术相比，Rakning C-19的实际影响很小。\n“这项技术或多或少是…的。我不会说无用，“正在监督接触者追踪工作的冰岛警察局侦探盖斯图尔·帕尔梅森(Gestur Pálmason)说。“但这两者的结合才能给你带来成果。我想说，(拉克宁)在少数情况下被证明是有用的，但它并没有改变我们的游戏规则。“。\n帕尔梅森在第一起登记的事件发生10天后加入了Covid追查小组，当时该国的病例数量在60多例。他说，有一些实例表明这些数据是有用的，但人们急于找到应对大流行的技术解决方案，夸大了自动追踪的影响。\n“这是可以理解的，因为应用程序是你可以买到的东西，”他说。“但我非常清楚地告诉大家，人工追踪的重要性丝毫不亚于此。”\n这一观点应该对目前正在从事自己的自动接触者追踪服务的其他国家起到警示作用。许多其他国家的政府仍处于推出自己的独立应用程序的早期阶段，或者正在基于苹果和谷歌正在开发的尚未发布的技术构建服务。\n许多人希望，这些硅谷巨头的巨大影响力将克服追踪应用程序面临的一些社会和技术障碍。但是，如果像冰岛这样一个社会凝聚力强、地理上与世隔绝的小国只能实现38%的普及率，这可能表明其他国家的努力将难以达到所需的采用水平。\n尽管如此，冰岛还是设法平坦了冠状病毒曲线，并在很大程度上控制了疫情。今天，它已经有1800多例确诊病例和10例死亡。病例数量几周来基本保持不变，最后一次确认的冠状病毒死亡是在4月19日。\n这一切都是尽管该国没有颁布许多在其他地方看到的更激进的社会政策-这种做法招致了一些批评。虽然活动减少了，集会的规模也受到了限制，但小学甚至一些餐馆仍然开放，使用的是社交距离和“泡沫”策略，即将班级和工作场所分割成相互不互动的独立单元。\n帕尔梅森认为，开始检测、追踪和隔离的早期和积极的行动已经得到了回报。\n“我们一直在与市民合作，”他说。“法律是有的，我们可以罚款，但我们基本上什么都没做：我们相信公民会遵守规定的指导方针--在我看来，这种模式非常管用。”", "note_en": "When Iceland got its first case of covid-19 on February 28, an entire apparatus sprang into action.\n  The country had already been testing some people at high risk of catching the virus, thanks to DeCode genetics, a local biotech company. Once the arrival of the disease was confirmed, it began rapidly rolling out public testing on a much wider scale. The government, meanwhile, quickly built a team of contact tracers to interview those with a positive diagnosis and track down people they’d been in contact with.\n  Within a few weeks, Icelanders had another high-tech tool at their disposal, too: a government-backed automated tracing app.\n  Rakning C-19, which launched in early April, was  hailed as a way to “make the tracing of transmissions easier” at the time. It tracks users’ GPS data to compile a record of where they have been, allowing investigators—with permission—to look at whether those with a positive diagnosis are potentially spreading the disease.\n  And it gained traction quickly:  according to MIT Technology Review’s Covid Tracing Tracker, it has the largest penetration rate of all contact trackers in the world, having been downloaded by 38% of Iceland’s population of 364,000.\n  But despite this early deployment and widespread use, one senior figure in the country’s covid-19 response says the real impact of Rakning C-19 has been small, compared with manual tracing techniques like phone calls.\n  “The technology is more or less … I wouldn’t say useless,” says Gestur Pálmason, a detective inspector with the Icelandic Police Service who is overseeing contact tracing efforts. “But it’s the integration of the two that gives you results. I would say it [Rakning] has proven useful in a few cases, but it wasn’t a game changer for us.”\n    Pálmason joined the covid tracing team 10 days after the first registered incident, when the country’s case numbers were in the 60s. He says there have been instances where the data was useful, but that the impact of automated tracing has been exaggerated by people eager to find technological solutions to the pandemic.\n  “It&#39;s understandable, because an app is stuff that you can buy,” he says. “But I make it super clear to everyone that manual tracing is no less important.”\n  That perspective should be cautionary for other countries currently working on their own automated contact tracing services. Many other governments are still in the  early stages with their own standalone apps, or are building services based on the  as-yet-unreleased technology being developed by Apple and Google.\n  Many are hopeful that the vast reach of these Silicon Valley giants will overcome some of the social and  technical hurdles faced by tracing apps. But if a small, socially- cohesive, and geographically isolated nation like Iceland can only achieve 38% penetration, that could suggest that efforts in other countries will struggle to get the level of adoption required.\n    Still, Iceland has managed to flatten its coronavirus curve and keep its outbreaks largely under control. Today it has had just over 1,800 confirmed cases and 10 deaths. Case numbers have remained more or less static for several weeks, and the last confirmed covid-19 death was on April 19.\n  This is all despite the fact that the country has not enacted many of the more drastic social policies seen elsewhere— an approach that has lead to some criticism. While movement has been curtailed and there have been restrictions on the size of gatherings, primary schools and even some restaurants have remained open, using a mixture of social distancing and a  “bubble” strategy where classes and workplaces are divided into discrete units that do not interact with each other.\n    Pálmason suggests that the early and aggressive action to begin testing, tracing, and isolating has paid off.\n  “We’ve been working in a collaborative model with the citizens,” he says. “There is law, and we can do fines, but we basically haven’t done any: we put our trust on the citizens that they follow the guidelines that are set out—and that model has worked fantastically, in my view.”", "posttime": "2020-05-16 02:13:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,app,应用程序,covid,追踪", "title": "近40%的冰岛人正在使用Covid应用程序-但它没有太大帮助", "title_en": "Nearly 40% of Icelanders are using a Covid app–and it hasn’t helped much", "transed": 1, "url": "https://www.technologyreview.com/2020/05/11/1001541/iceland-rakning-c19-covid-contact-tracing/", "via": "", "real_tags": ["程序", "app", "应用程序", "covid", "追踪"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002272, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "许多团队以每日单口相声中臭名昭著的三个问题开始他们的一天：你昨天做了什么？你今天要做什么？和你被什么阻挡了？\n每天15分钟的循环站立表演是Scrum的基石之一，Scrum是一种流行的产品开发团队管理方式。不幸的是，Scrum-以及日常单口相声-创建于20世纪90年代，当时上班族在小隔间里辛勤工作，共享共同的物理空间和工作日。今天，我们的工作场所看起来非常不同，办公室和团队成员遍布世界各地。这一点现在尤其重要，因为公司在适应冠状病毒危机的过程中被迫接受远程工作。\n虽然每天的单口相声是出于好意创建的，但异步完成时，它们的生产力更高，对团队也更好。以下是一些原因：\n传统的上班族往往会落入将存在等同于生产力的陷阱。站立作为传统办公室和共用团队的支柱，被用作经理从员工那里收集最新信息的拐杖，迫使他们笨拙地报告自己的进展，这样他们就可以放心，每个人都在实际工作。\n远程工作需要新的责任和信任概念。我们将在未来的帖子中介绍我们的意思以及如何在没有实时每日状态会议的情况下构建此功能。😉。\n您的远程团队都驻留在同一位置的可能性很小。相反，你的团队可能分布在美国的不同时区，甚至世界各地……。\n不同的时区意味着每个人都按照不同的时间表运行。当一个人放松一天的时候，另一个人可能才刚刚开始。定期安排的同步会议具有令人难以置信的破坏性，因为它可能会在不方便的时候将人们从他们的流畅状态和日程安排中拉出来。\n在理想的情况下，每天的单口相声都是为了解决问题，帮助团队更快地发货。在现实中，站立表演实际上没有更深入探讨实际问题的空间。一旦你这样做了，其他人就会无视你，你的脱口秀拖得比需要的时间要长得多，而且你的经理会要求你让它离线。\n事实上，最好的球队在问题出现时实际上就会解锁，而不是等待定期安排的单口相声来报告拦网问题。共处一地的团队的一个常见陷阱是，他们倾向于将主题保存到会议上，然后等到那时再提出。\n虽然我们显然坚信你的日常单口相声应该是异步的，但我们更支持你应该做对你的团队有效的事情。至少，我希望这篇文章能让你对日常单口相声的常见陷阱有一个新的理解。\n在未来的帖子中，我将讨论可以用来将您的日常单口相声转换为异步格式的策略。在此之前，我认为最好是引用一篇特别贴切的关于每日单口相声的博客文章来结束：\n很明显，尽管所有的公司都说他们“做敏捷”，但实际上大多数公司都没有这样做；他们只是站着随意开会，这产生了糟糕的结果，我认为这是对开发人员的直接冒犯。", "note_en": "Many teams start their day with the infamous three questions of the daily stand-up: &#34;what did you do yesterday?&#34;, &#34;what are you going to do today?&#34;, and &#34;what are you blocked by?&#34;.\n  The 15-minute round-robin daily stand-up is one of the cornerstones of  Scrum, a popular way to manage product development teams. Unfortunately, Scrum — and the daily stand-up — was created back in the 1990s, when office workers labored away in cubicles and shared a common physical space and work day. Today, our workplaces look very different and have offices and teammates spread across the world. This is especially relevant now as companies are forced to embrace remote work as they adapt to the COVID-19 crisis.\n  While the daily stand-up was created with good intentions, they&#39;re more productive and better for the team when done asynchronously. Here are some reasons why:\n    Traditional office workers tend to fall in the trap of equating presence with productivity. Standups, as mainstays of traditional offices and co-located teams, are used as crutches for managers to collect updates from employees and force them to awkwardly report on their progress so they can reassure themselves that everyone is actually working.\n  Remote work calls for new notions of accountability and trust. We&#39;ll cover what we mean and how to build this without real-time daily status meetings in a future post. 😉\n    It&#39;s highly unlikely that your remote team all resides in the same location. Instead, your team is likely spread across different timezones in the US, or even across the world...\n  Different timezones means that everyone is operating on different schedules. When one person is winding down for the day, another may just have started. Having a regularly scheduled, synchronous meeting is incredibly disruptive, as it pulls people out of their flow states and schedules, likely at inconvenient times.\n    In an ideal world, daily stand-ups are meant to unblock problems and help teams ship product faster. In reality, there&#39;s actually no space in the standup to dive deeper into actual issues. The second you do, everyone else tunes you out, your standup drags on much longer than it needs to, and you&#39;re asked by your manager to &#34;take it offline&#34;.\n  In fact,  the best teams actually unblock problems as they come up, instead of waiting for a regularly scheduled standup to report on a blocker. A common pitfall of co-located teams is that they tend to save topics for the meeting and wait until then to bring it up.\n    While we&#39;re clearly of the strong belief that your daily standups should be asynchronous, we&#39;re even bigger proponents that you should do what works for your team. At the very least, I hope this post gave you a new understanding of the common pitfalls of daily standups.\n  In a future post, I&#39;ll talk about strategies you can use to move your daily standups to an asynchronous format. Until then, I thought it&#39;d be best to close off with a quote from a particularly apt  blog post on daily standups:\n  “It’s clear how even though all companies say they “do agile”, in fact most don’t; they just do random meetings while standing up, which produces bad results that I consider right-out offensive towards developers.&#34;", "posttime": "2020-05-16 01:45:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "站立,standups,团队", "title": "每日站立应为异步", "title_en": "Daily standups should be async", "transed": 1, "url": "https://www.cadencework.com/blog/async-standups.html", "via": "", "real_tags": ["站立", "standups", "团队"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002271, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "DoorDash&amp；GrubHub向餐厅收取广告费，然后用这笔钱向谷歌支付广告，这些广告使用我们餐厅的品牌名称，将顾客从我们的网站转移到我们平台上的竞争对手那里。\n我叫特拉维斯·斯托里克，是密歇根州兰辛市的一家小餐馆老板。在一个小镇上拥有两家小烧烤餐厅是一件令人难以置信的困难的生意。大家都知道，一般来说，拥有一家餐厅是很难的。但当世界上最大的两家公司合谋反对你抢走你的顾客时，事情就更难了。这可能看起来有点夸张。不过，给我一点时间让我解释一下。\n大多数消费者没有意识到这一点，但当你从GrubHub或DoorDash等大型送货合作伙伴那里订购送货服务时，你不仅要支付送货费、服务费和丰厚的小费给司机。但我们餐厅老板也要付钱。虽然快递公司不喜欢我们谈论费用，但据其他地方的报道，这些费用可能是你整个订单的15%到35%。如果你从我们这里订购10美元的食物，那么快递公司通常会收取大约3美元的费用，只给餐厅7美元。对于一个利润微薄的行业来说，这个百分比是痛苦的。这不包括你可能支付的所有送货费、税费、服务费和小费。/对于一个利润微薄的行业来说，这个百分比是痛苦的。这还不包括你可能支付的所有送货费、税费、服务费和小费。\n快递公司给餐厅的理由是，我们为什么会同意这么疯狂的事情，他们称之为“广告费”。他们如何证明这笔巨额成本是合理的，是因为他们说，他们的平台太大了，有这么多人在他们的平台上搜索食物，我们的餐厅受益，因为送货平台给我们带来了从未听说过我们餐厅的新顾客。当然，这也是我们餐厅老板一直在寻找的--新顾客。\n如果是这样的话，这一切听起来都很好，但不幸的是，情况完全不是这样。DoorDash&amp；GrubHub与谷歌的关系就是一个很好的例子。\n我们的小烧烤餐厅(Saddleback BBQ)位于密歇根州的小镇兰辛。如果兰辛的一个人在谷歌搜索上查找我们所在位置的方向，并在谷歌搜索栏(或他们的浏览器)中键入‘Saddleback BBQ Lansing’。谷歌合谋将该顾客带到DoorDash，并将他们引导到DoorDash。你会注意到有关这一点的一些事情。\n“广告”比我们自己的“订购”按钮大得多，人们可以直接从我们的网站订购或获得我们所在位置的方向。\n可能最让人抓狂的是，如果顾客点击链接，就不会把他们带到一个网页上从Saddleback BBQ订购，它会把用户带到一个通用页面，向任何提供BBQ服务的人订购烧烤吗？排在榜首的是谁？苹果蜂。\n总而言之，DoorDash向Google支付广告费，以窃取搜索我们餐厅名称“Saddleback BBBQ”的客户，他们会将他们重定向到自己的页面。从那里，客户可以从兰辛的任何一家烧烤餐厅购买商品，如果客户选择向我们订购，我们必须支付DoorDash为我们带来该客户的费用。\nDoorDash和谷歌正在积极合谋从当地小企业的餐馆中抢走顾客。虽然他们不是通过向搜索“兰辛BBQ”等一般词条的人做广告，而是通过窃取专门搜索我们的商业名称“Saddleback BBBQ”的人来做到这一点。但他们都是在赚钱。\n这不仅仅局限于DoorDash，GrubHub也做同样的事情。如果你在Lansing搜索“Saddleback BBQ Hours”，你会得到来自GrubHub的广告。“如果你搜索”Saddleback BBQ Online Order“，同样会得到来自GrubHub的广告。\n当然，现在我们都是私营企业，这主要是一个合同问题。我们同意为在他们的平台上下的订单支付费用，因为他们向新客户“广告”我们的所谓价值。我想说得很清楚，问题不是我们为他们的服务付钱。问题是，他们正在积极地使用我们的品牌名称向已经在寻找我们的客户做广告。他们将这些客户重定向到他们的平台，在那里他们可以从竞争对手那里购买，或者他们可以向我们收取费用，向同一客户提供食品。而客户可以只需访问我们的网站，直接从我们的在线订购商店订购，我们就不会向GrubHub或DoorDash收取佣金。\n由于我们是DoorDash和GrubHub的合作伙伴，我亲自多次联系他们，我花了几个小时和他们每个人通了几个小时的电话，让他们停止这种做法。*他们停了一段时间，然后又重新开始。最近他们都这么做了。我们唯一的办法就是立即终止与GrubHub和DoorDash的合同，我们正在考虑这样做。\n问题是，如果我们取消，这是否意味着他们实际上将停止窃取寻找我们餐厅的顾客，并将他们引导到我们的竞争对手那里？我们不知道。我对此表示怀疑，但我们会找出答案的。", "note_en": "DoorDash &amp; GrubHub charge restaurants an advertising fee and then use that money to pay Google to run advertisements that use our restaurant’s brand name to divert customers away from our website to our competitors on their platform.\n My name is Travis Stoliker and I’m a small restaurant owner in Lansing Michigan. Owning two small BBQ restaurants in a small town is an incredibly difficult business. Everyone knows that owning a restaurant, in general, is tough.  But it gets even harder when two of the largest companies in the world conspire against you to steal your customers.  This might seem like hyperbole. But give me a moment to let me explain.\n Most consumers don’t realize this, but when you order delivery from one of the large delivery partners like GrubHub or DoorDash - not only do you pay a delivery fee, service fee, and a generous tip to the driver. But we restaurant owners also pay.  The delivery companies don’t like us to talk about the fee’s but it has been well reported elsewhere that these fees can range from 15% to 35% of your entire order.  So if you order $10 of food from us.  The delivery company usually takes about $3 of it and only gives the restaurant $7.  For an industry with notoriously slim profit margins, that percentage is painful.  That does _not_ include all of the delivery fees, taxes, service fees, and tips that you might pay on top of that.\n The justification that the delivery companies give to the restaurant for why we would agree to something this crazy is that they call it an “advertising fee”.  How they justify this huge cost is by saying that their platforms are so large and there are so many people searching for food on their platforms, that our restaurants benefit because the delivery platforms are bringing us new customers that have never heard of our restaurants. And of course, that’s what us Restaurant owners are always looking for -          New Customers         .\n That all sounds good if it were the case, but unfortunately, it is not the case at all.           DoorDash &amp; GrubHub’s relationship with Google is a perfect example.\n Our small BBQ Restaurants (Saddleback BBQ) are located in the small town of Lansing Michigan.  If a person in Lansing goes onto Google search to look for directions to our location and types into the Google search bar (or their browser) ‘Saddleback BBQ Lansing’.  DoorDash &amp; Google conspire to take that customer and direct them to DoorDash.  You’ll notice a few things about this.\n The “Advertisement” is much larger than our own “order” button where someone can order directly from our website or get directions to our location.\n    Possibly the most maddening thing is that if a customer clicks on the link, it does NOT take them to a webpage to order from Saddleback BBQ.  It takes the user to a general page to order BBQ from anyone that serves BBQ.  At the top of the list? Applebees.\n   So to summarize, DoorDash pays Google an advertising fee to steal customers that are searching for our restaurant name “Saddleback BBQ” and they are redirecting them to their own page. From there a customer can purchase from any BBQ restaurant in Lansing or if the customer chooses to order from us we must pay DoorDash a fee for bringing us that customer.\n DoorDash and Google are actively conspiring to steal customers from local small businesses that are restaurants.  They are not doing this by advertising to people that search for general terms like “BBQ in Lansing” - They are doing this by stealing people that are searching specifically for our business name: “Saddleback BBQ”.  They are all getting paid.\n  This isn’t just limited to DoorDash.  GrubHub does the same thing.  If you search for “Saddleback BBQ Hours” in Lansing you will get an advertisement from GrubHub.  If you search for “Saddleback BBQ Online Ordering”, once again, you will get an advertisement from GrubHub.\n  Now, of course, we are all private businesses and this is primarily an issue of contracts.  We agreed to pay them a fee for orders placed on their platform because of the supposed value that they are “advertising” us to new-customers. I want to be very clear, the problem is NOT that we are paying them for their services. The problem is that they are actively using our brand name to advertise to customers that are already looking for us. They are redirecting those customers to their platform where they can purchase from a competitor or they can charge us a fee to provide food to that same customer.  Whereas the customer could have just gone to our website and ordered directly from our online ordering store and we would not be charged a commission to GrubHub or DoorDash.\n Being that we are partners of DoorDash and GrubHub, I have personally reached out to them multiple times.  I’ve spent hours on the phone with each of them to get them to stop this practice.  For a while, they stop, but then, they start up again.  Which they both just did recently.  Our only recourse is to immediately terminate our contract with GrubHub and DoorDash, which we are considering doing.\n The problem is that if we cancel, does that mean they will actually stop stealing customers that are looking for our restaurant and directing them to our competitors? We don’t know.  I doubt it, but we will find out.", "posttime": "2020-05-16 01:45:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,doordash,餐厅", "title": "谷歌、DoorDash和GrubHub如何合谋搞垮当地餐厅", "title_en": "How Google, DoorDash, & GrubHub Conspire to Screw Local Restaurants", "transed": 1, "url": "https://www.saddlebackbbq.com/how-google-doordash-grubhub-conspire-screw-local-restaurants", "via": "", "real_tags": ["谷歌", "google", "doordash", "餐厅"]}, {"category": "", "categoryclass": "", "imagename": "878842da179f9da189876adc3724adab.jpg", "infoid": 1002270, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "董事会在提交的文件中辩称，奖金对于留住管理团队并保持他们的动力是必要的，因为他们目前“在影响零售业的动荡和不确定的环境中”，而且奖金是有附加条件的。根据协议，如果这四名高管在2021年1月31日之前被“因故解雇”或辞职，他们将必须偿还80%的奖金。除非达到特定的业绩目标，否则他们还必须偿还另外20%。\n此外，这些高管被要求放弃本财年所有年度奖金计划和长期激励奖励的权利，以及过去奖励计划中的未偿还股本或期权。但是，正如CNN Business指出的那样，“考虑到公司的财务问题，这些年度奖金可能会在今年内消失，任何JCPenney股权的持有者都可能在破产申请中被抹去。”\nJCPenney在4月初解雇了大部分门店员工和一些公司员工，因为门店在大流行期间暂时关闭。首席执行官索尔陶在一份日期为3月31日的公告中表示：“我们正在做出艰难、谨慎的决定，以保护我们同事的安全和我们公司的未来。”\n当根据破产法第11章进行重组时，JCPenney可能会削减更多的工作岗位。如果是这样的话，新下岗的员工可能会得到较少的遣散费(或者根本没有)，因为破产法要求公司在支付员工之前支付债权人。", "note_en": "The board argued in the filing that the bonuses were necessary to retain the management team and keep them motivated “through the volatile and uncertain environment affecting the retail industry” right now and that they came with strings attached. Under the agreement, the four executives will have to repay 80 percent of the bonuses if they are “fired for cause” or resign before January 31, 2021. They will also have to repay the other 20 percent unless meeting specific performance goals.\n In addition, the executives were required to forfeit the right to all annual bonus plans and long-term incentive awards for the current fiscal year, as well as outstanding equity or options from past award plans. But, as  CNN Business noted, those annual bonuses are likely gone for the year anyway “considering the company’s financial problems, and any holders of JCPenney equity are likely to be wiped out in a bankruptcy filing.”\n  JCPenney furloughed the majority of its store workers and some corporate employees in early April as stores temporarily shuttered amid the pandemic. “We are making tough, prudent decisions to protect both the safety of our associates and the future of our company,” CEO Soltau said  in an announcement dated March 31.\n More jobs are likely to get slashed at JCPenney when Chapter 11 restructuring comes in. If that’s the case, newly laid-off employees may receive smaller severance packages (or none at all) since bankruptcy laws require companies to pay creditors before employees.", "posttime": "2020-05-16 01:44:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "解雇,paid", "title": "JCPenney在解雇工人之前向高管支付了巨额奖金", "title_en": "JCPenney Paid Top Execs Huge Bonuses Before Firing Workers", "transed": 1, "url": "https://observer.com/2020/05/jcpenney-pay-exec-bonus-amid-filing-bankruptcy-coronavirus-layoff/", "via": "", "real_tags": ["解雇", "paid"]}, {"category": "", "categoryclass": "", "imagename": "63800fed327b13517b4aa92582805e07.jpg", "infoid": 1002269, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Zoom几乎在一夜之间从2000万用户扩展到3亿用户。令人难以置信的是，从外表上看，他们几乎没有表现出明显的成长烦恼，尽管在内部，他们很可能会有很多疯狂的事情正在发生。\n诚然，Zoom做出了一些设计决定，作为一家充满活力的小型初创公司，作为一个事实上的标准并没有太大的意义，但这是意料之中的。这并不像许多人所说的那样是糟糕的建筑的标志。它只是现实的产品是如何发展的，特别是当它们必须在几周、几天甚至几个小时内升级的时候。\n突如其来的成功会招致仔细的审查，所以每个人都想知道Zoom是如何工作的。问题是我们知道的不多，但我们确实有一些信息来源：\n关于Zoom数据中心的使用引起了相当大的混乱。结果是，他们从自己的co-lo空间开始，然后随着增长的激增扩展到使用多个云。如何处理突然的增长几乎是教科书般的执行。\n大部分Zoom在AWS上运行，而不是在甲骨文上运行-AWS表示：自从大流行爆发以来，该服务已将大量实时视频会议流量转移到AWS，并在甲骨文云上放置了较少的容量.首席执行官埃里克·袁进一步澄清了这一点，解释说Zoom历史上一直在其自己的数据中心处理实时视频会议流量.我们的实时流量始终停留在我们自己的数据中心内供付费客户使用.在这场大流行危机期间，每天都是。我们自己的现有数据中心确实无法处理这种流量……这意味着AWS每天都会为Zoom开发数千台新服务器……因此，最终，我们自己的数据中心(主要是Amazon，还有Oracle云)和这三家公司一起为所有前所未有的流量提供服务。\n我们对Zoom的架构了解不多，但这段营销视频详细介绍了：“Zoom独特的架构如何支持您的视频优先UC未来”。\nZoom将他们的架构视为竞争优势。“每个人都将使用视频，那么我们如何将规模扩展到每个人呢？”因此，Zoom从视频无处不在的目标开始，让这个目标塑造他们的架构。\n竞争对手通过数据中心的长号流量，将其代码转换为其他所有人的正常视图，然后将混合视频发送给每个参与者。这会引入延迟，占用大量CPU资源，而且很难扩展和部署新的数据中心来满足不断增加的负载。\n缩放选择了SVC(可伸缩视频编解码器)编解码器，而不是AVC。AVC是一种协议，在该协议中，您发送单个流，并且该单个流具有比特率。如果你想发送多个比特率，你必须发送多个流。如果您想要发送多个比特率，这会增加带宽利用率。\nSVC是具有多层的单流。这允许发送具有您可能需要缩减到给定网络条件所需的所有分辨率和比特率的1.2MBS流。在过去，您只能使用ASIC进行SVC。现在，多亏了摩尔定律，SVC可以在软件中完成。\nZOOM创建了多媒体路由，以解决传统供应商使用AVC时遇到的问题。取消转码消除了延迟，增加了规模。\n多媒体路由将用户内容带到他们的云中，当您作为客户端遇到问题时，他们会将不同的视频流切换给您。当您想要不同的分辨率时，您需要订阅此人分辨率的不同层。\nZoom不会对任何内容进行代码转换或混合，也不会形成任何视图。您实际上是从零处理的路由中直接从多个人拉取多个流。这就是为什么您会看到如此出色的用户切换和语音切换体验以及低延迟的原因。\nZoom开发了在云和客户端之间工作的应用层QoS(服务质量)。它的工作是检测网络状况。收集的遥测数据确定将哪个流切换到客户端。该算法考虑CPU、抖动、丢包等。\n客户端与云通信。云知道什么时候它没有收到某些数据包，所以它会做出决定，并将不同的流切换到您那里。\n如果网络环境不好，客户端可以自动缩小您自己发送视频的大小，这样您就不会占用自己的下行带宽。\n客户端和云协同工作，通过正确的网络提供正确的音频流和视频流，因此用户体验尽善尽美。\n网络感知意味着首先尝试最佳体验，这就是UDP。如果UDP不起作用，它会尝试HTTPS。如果HTTPS不起作用，它会退回到HTTP。这是由客户协商的。遥测显示了连接不良的原因。你能做的最糟糕的事情就是给用户带来不一致的体验。\n重点是让一切都尽可能简单直观地工作。强调并重复了这一点，这可能解释了早期的一些设计决策。\nZoom以40分钟的视频和聊天会议颠覆了市场。他们增加了免费拨入会议。他们提供市场上最好的VOIP体验。竞争对手的平均VOIP采用率不到30%，Zoom为89%。每年在音频会议上花费30亿美元，Zoom免费提供。提供基于软件的视频会议室体验。为竞争对手提供一键式服务。赠送数字标牌和房间陈列。\nZoom的竞争对手陷入了他们无法摆脱的收入模式。他们不能创新，因为他们会颠覆他们自己的收入模式。\nZoom扰乱了会议市场，扰乱了全球音频市场，扰乱了会议室市场，现在他们想要颠覆电话业务。虽然这是2019年，但现在随着大流行，这一战略可能会被重新考虑。\nZoom&#39；的目标是创建最大的互联协作网络。他们希望兑现20年前VOIP的承诺，拆除人们相互协作的每一堵付费墙，铺设PSTN连接，在任何网络上以最低的速率跨IP通过聊天会议电话将每个人连接起来。", "note_en": "Zoom scaled from 20 million to 300 million users virtually over night. What&#39;s incredible is from the outside they&#39;ve shown little in the way of apparent growing pains, though on the inside it&#39;s a good bet a lot of craziness is going on.\n Sure, Zoom has made some design decisions that made sense as a small spunky startup that don&#39;t make a lot of sense as a defacto standard, but that&#39;s to be expected. It&#39;s not a sign of bad architecture as many have suggested. It&#39;s just realistically how products evolve, especially when they must uplift over weeks, days, and even hours.\n Sudden success invites scrutiny, so everyone wants to know how Zoom works. The problem is we don&#39;t know much, but we do have a few information sources:\n   There was quite a kerfuffle about Zoom&#39;s datacenter usage. The upshot is they started with their own co-lo spaces and then branched out to use multiple clouds as growth spiked. Almost textbook execution of how to handle sudden growth.\n Most of Zoom runs on AWS, not Oracle - says AWS: the service has moved a large quantity of real-time video-conferencing traffic to AWS since the pandemic struck, and has also placed a lesser amount of capacity on the Oracle Cloud...CEO Eric Yuan clarified this further, explaining that Zoom historically handled real-time video conferencing traffic in &#34;its own data centers&#34;...Our real-time traffic always stayed inside our own data center[s] for our paid customers...During this pandemic crisis, every day is a new record. Our own existing data center[s] really cannot handle this traffic...This meant that AWS spun up thousands of new servers for Zoom every day...So ultimately, our own data center[s], and primarily Amazon, and also the Oracle cloud, those three together to serve all the unprecedented traffic.\n We don&#39;t know a lot about Zoom&#39;s architecture, but this marketing video went into some detail:  How Zoom&#39;s Unique Architecture Powers Your Video First UC Future.\n Zoom sees their architecture as a competitive advantage. Everyone will be using video, so how do we scale to everyone? So Zoom started with the goal of video everywhere and let that goal shape their architecture.\n Competitors trombone traffic through a datacenter, transcode it into a normal view for everybody else, and then send mixed video out to every individual participant. That introduces latency, uses a lot of CPU resources, and it&#39;s hard to scale and deploy new datacenters to meet increased load.\n Zoom chose the SVC (Scalable Video Codec) codec over AVC. AVC is a protocol where you send a single stream and the single stream has a bitrate. If you want to send multiple bitrates you have to send multiple streams. This increases bandwidth utilization if you want to send multiple bitrates.\n SVC is a single stream with multiple layers. That allows sending a 1.2 mbs stream that has every resolution and bitrate you may need to scale down to given network conditions. In the past you could only do SVC with an ASIC. Now, thanks to Moore’s law, SVC can be done in software.\n Zoom created Multimedia Routing to solve the problems traditional vendors have with AVC. Cutting out transcoding got rid of latency and increased scale.\n Multimedia routing takes user content into their cloud and when you as a client run into issues they switch a different video stream to you. When you want a different resolution you subscribe to a different layer of that person’s resolution.\n Zoom does not transcode or mix anything or form any views. You are literally pulling multiple streams from multiple people directly from routing with zero processing. This is why you see such a great user switching and voice switching experience and low latency.\n Zoom developed application layer QoS (Quality of Service) that works between the cloud and the client. Its job is to detect network conditions. Gathered telemetry data determines which stream is switched to a client. The algorithm looks at CPU, jitter, packet loss, etc.\n The client talks to the cloud. The cloud knows when it doesn&#39;t get certain packets back, so it will make decisions and switch a different stream down to you.\n The client can automatically downsize your own send video if there&#39;s a bad network environment, so you&#39;re not killing your own downstream bandwidth.\n The client and the cloud work in tandem to deliver the right audio stream, the right video stream, across the right network, so the user experience is as good as it can be.\n Being network aware means trying for the best experience first, which is UDP. If UDP doesn’t work it tries HTTPS. If HTTPS doesn’t work it falls back to HTTP. The client negotiates that. Telemetry shows why the connection was bad. The worst thing you can do is give the user an inconsistent experience.\n The focus is making everything just work as simply and intuitively as possible. This point was emphasized and repeated, which may explain some of earlier design decisions.\n  Zoom disrupted the market with 40 minute meetings with video and chat. They added free dial-in conferencing. They deliver the best VOIP experience in the market. Competitors average VOIP adoption is less than 30%, Zoom is 89%. $3 billion a year is spent on audio conferencing and Zoom gives it away for free. Delivered software based video conferencing room experience. Delivered one button push for competitors. Gave away digital signage and room displays.\n Zoom&#39;s competitors are sunk in revenue models they can&#39;t get out of. The can&#39;t innovate because they&#39;ll disrupt their own revenue model.\n Zoom disrupted the meetings market, disrupted the audio market, disrupted the rooms market, and now they want to disrupt telephony. Though this was 2019, now with the pandemic that strategy may be being revisited.\n Zooms&#39; goal is to create the largest network of connected collaboration. They want to deliver on the promise of VOIP from twenty years ago, tearing down every pay wall for people to collaborate with each other, rolling out PSTN connectivity, connecting everyone through chat meeting phone all across IP at lowest rate on any network.", "posttime": "2020-05-16 01:44:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "zoom", "title": "关于Zoom工作原理的简短介绍-高可伸缩性", "title_en": "A Short on How Zoom Works – High Scalability", "transed": 1, "url": "http://highscalability.com/blog/2020/5/14/a-short-on-how-zoom-works.html", "via": "", "real_tags": ["zoom"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002268, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "MongoDB是一个分布式文档数据库，它声称提供“当今任何可用的数据库中最强大的数据一致性、正确性和安全性保证”，具有“完整的ACID事务”。Jepsen评估了MongoDB版本4.2.6，发现即使在读写关注度最高的情况下，它也无法保持快照隔离。相反，Jepsen观察到读取偏差、循环信息流、重复写入和内部一致性违规。弱默认值意味着事务可能会丢失写入并允许脏读，甚至会降低数据库和集合级别上请求的安全级别。此外，快照读取关注点不能保证快照，除非与大多数写入关注点配对-即使对于只读事务也是如此。这些设计选择使MongoDB事务的安全使用变得复杂。这项工作是独立进行的，没有报酬，并根据杰普森道德政策进行。本报告中提到的MongoDB、Fauna和YuaByte之前都曾聘请Jepsen进行付费分析。\nMongoDB是流行的分布式文档数据库。它通过自主开发的共识协议提供复制，该协议的灵感来自RAFT，并且可以通过mongos跨分片分发数据。我们之前评估了MongoDB的2.4.3、2.6.7、3.4.0-rc3和3.6.4版本。\n我们关于MongoDB 3.6.4的最新报告集中于分片集合中的因果一致性和线性化。我们发现，分片集群似乎提供了针对单个文档的可线性化的读取、写入和比较并设置操作，只要用户在运行时使用的是可线性化的读取关注点和多数写入关注点。但是，任何较弱的写入关注度都会导致提交的写入丢失。MongoDB的默认写关注级别是(并保持)由单个节点确认，这意味着MongoDB可能会在默认情况下丢失数据。尽管写入问题文档没有明确说明这一点，但回滚文档声明：\n对于默认写入问题，如果主服务器在写入操作复制到任何辅助服务器之前停止，则可能会回滚数据。\n类似地，MongoDB的默认读取关注度允许中止读取：读取器可以观察到未完全提交的状态，并且在将来可能会被丢弃。正如读隔离一致性文档所指出的，“未提交的读操作是默认的隔离级别”。\n我们发现，由于这些弱缺省值，MongoDB的因果会话在缺省情况下不能保持因果一致性：用户需要同时指定写和读关注点多数(或更高)才能实际获得因果一致性。MongoDB解决了这个问题，说它正在按设计工作，并更新了他们的隔离文档，指出即使MongoDB提供了“客户端会话中的因果一致性”，但除非用户小心地同时使用读和写关注点多数，否则这一保证是站不住脚的。现在有一个详细的表显示了较弱的读写关注点提供的属性。\n奇怪的是，MongoDB在他们的MongoDB和Jepsen页面上没有提及这些发现。相反，该页只讨论通过结果，没有提到读取或写入问题，将实际报告隐藏在脚注中，并继续声称：\nMongoDB提供当今任何可用的数据库中最强的数据一致性、正确性和安全性保证。\n我们鼓励MongoDB在上下文中报告Jepsen的发现：虽然MongoDB确实提供了每个文档的线性化和具有最强设置的因果一致性，但它在大多数配置中也无法提供这些属性。我们认为用户可能想要知道，默认情况下，他们的数据库可能会丢失数据，但是MongoDB对我们工作的总结省略了对此行为的任何提及。\n那么，MongoDB是否提供“最强的数据一致性、正确性和安全性保证”呢？过去的工作表明，对于单个文档操作，答案是“是的；MongoDB以最强的设置提供了每个文档的线性化，但不是默认的”。然而，在2018年，MongoDB引入了多文档事务-仅限于一个分片内-并在2019年将这些事务扩展到多个分片。这些交易提供哪些安全属性？\nMongoDB主页自豪地宣传“全ACID交易”。Transaction页面声明MongoDB是“唯一完全结合了文档模型的功能和具有ACID保证的分布式系统架构的数据库”，CosmosDB、DynamoDB、FaunaDB、Oracle NoSQL、OrientDB、RavenDB、SAP HANA、YuaByte DB等公司也声称这一组合。\nmongodb架构指南承诺ACID事务“保持与您在传统数据库…中习惯的数据完整性保证相同的数据完整性保证”。MongoDB提供了“很强的设计一致性”，但没有提供更具体的声明。ACID白皮书澄清了MongoDB事务提供快照隔离：一个相当强大的模型，它构成了PostgreSQL等系统的一致性基准级别。白皮书称：\n…。快照读取隔离可确保在只读事务内执行的查询和聚合将针对跨分片群集的每个主副本的数据库的全局一致快照运行。\nMongoDB反复将快照隔离总结为“事务提供一致的数据视图，并强制执行全有或全无执行以维护数据完整性”。这是对快照隔离的简明而直观的总结，但我们应该注意，快照隔离下的“一致视图”可能仍然令人惊讶：正如Fekete、O‘Neil和O’Neil在2004年所写的那样，只读事务在快照隔离下可以观察到不可序列化的行为。快照隔离也不一定维护数据完整性：在他们1995年的论文Defining Snapshot Isolation中，Berenson、Bernstein等人提供了在快照隔离下其完整性约束可能被违反的应用程序示例-例如，由于写入偏差。\n我们使用Jepsen分布式系统测试库设计了一个测试套件，并使用它对MongoDB 4.2.6中的事务安全性进行了评估。我们的测试在9个Debian 9节点的集群上安装了MongoDB的官方Debian包。我们在LXC和EC2中都进行了测试；两者都表现出相似的行为。根据部署指导原则，我们构建了双分片集群，将分片和configsvr元数据系统都作为三节点副本集运行。所有9个节点都运行一个mongos实例，该实例充当分片MongoDB集群的前端。\n我们的测试工作负载涉及单个MongoDB集合中循环文档池的事务，每个文档包含单个整数数组。每个事务对这些文档执行一到四个操作：要么按primary key_id读取单个文档，要么(使用$PUSH)再次按_id将唯一整数附加到单个文档的值数组。我们按_id对集合进行了分片。\n使用与加州大学圣克鲁斯分校的Peter Alvaro合作开发的新交易分析工具Elle，Jepsen自动推断这些交易之间的依赖关系，并在该图中搜索循环以识别隔离异常。检查中止和中间读取以及其他非循环异常的其他技术。\n在其中一些测试中，我们引入了网络分区，旨在隔离MongoDB主节点。\n我们首先在没有事务的情况下运行测试以获得基线：每个Jepsen“事务”只执行一个读取或追加操作，而不使用会话或事务API。因为我们知道MongoDB会丢失任何设置小于多数的更新，并且在没有读取关注点的情况下表现出陈旧的读取可线性化，所以我们在客户端的数据库句柄上设置了写入关注点多数和读取关注点可线性化。生成的历史记录似乎与快照隔离一致。\n然后，我们将这些单个操作包装在事务中，出现了一个令人惊讶的行为：使用网络分区，事务似乎丢失了确认的写入。例如，考虑以下历史记录，其中在30秒内，对8个文档的更新被成功确认，然后消失。以下是阅读文档555的历史记录：\n客户端观察到一个单调增长的元素列表，直到[1 2 3 4 5 6 7]，此时列表重置为[]，并从[8]重新开始。这可能是MongoDB回滚的一个例子，这是“数据丢失”的一种花哨的说法。\n这很糟糕，但一个更微妙的问题出现了：我们到底为什么能够读取这些值？毕竟，Read Concerns Linizable应该只显示大多数确认(即不可持续)的写入。答案是一个令人惊讶但有文档记录的MongoDB设计选择：\n事务中的操作使用事务级别的读取关注点。也就是说，在集合和数据库级别设置的任何读取关注点在事务内都会被忽略。\n数据库社区的普遍看法是，MongoDB历来拒绝提高读写安全的默认级别，因为这样做会影响已经习惯了更快的、偶尔不安全的默认设置的生产用户，而且数据丢失可能不够严重，不足以保证更强的安全设置带来的延迟、吞吐量和资本支出的增加。MongoDB的研究人员在VLDB上报告说：\n…。当然，用户更喜欢使用readConcern级别的“多数”和writeConcern w：“多数”，因为每个人都想要安全。但是，当用户发现较强的一致性级别太慢时，他们会切换到使用较弱的一致性级别。这些决策通常基于业务需求和SLA，而不是细粒度的开发人员需求。正如我们在整篇文章中所讨论的那样，决定使用较弱的一致性级别在实践中通常是可行的，因为故障转移很少发生，并且故障转移造成的数据丢失通常很小。\n然而，交易是一个全新的功能，用户可能希望牺牲一些速度来换取更好的安全保证。合理的用户可能会期望事务的默认安全级别如承诺的那样提供快照隔离-或者，至少与用户已经从所涉及的数据库或集合请求的读取关注度相同。相反，没有显式读关注点的事务将数据库或集合级别的任何请求的读关注点降级为缺省的本地级别，这“不能保证数据已被写入大多数副本(即可能被回滚)”。\n因此：用户应该小心地对每个需要快照隔离的事务使用快照级别的读关注。文档确认：“Read Concerns‘Snapshot’从大多数提交的Data…的快照返回数据”这是有意义的，然后继续：“如果事务以写关注‘多数’提交”，则不是这样。具体而言：\n如果事务不使用写关注点“多数”进行提交，则“快照”读关注点不能保证读取操作使用了多数提交数据的快照。\n精明的读者可能会问，“拥有不提供快照隔离读取的快照读取关注点有什么意义？”更精明的读者在观察到一种模式后，可能会询问写入关注度的默认级别。\n如果事务级别的写入关注点和会话级别的写入关注点未设置，则事务级别的写入关注默认为客户端级的写入关注点。默认情况下，客户端级写入关注点为w：1。\n为了获得快照隔离，用户不仅必须小心地将每个事务的读关注点设置为快照，还必须将每个事务的写关注点设置为多数。\n令人惊讶的是，这甚至适用于只读事务。在此测试运行中，我们在单操作写事务上设置读关注点快照和写关注点多数，对于单操作读事务，仅设置读关注点快照。发生网络分区时，读取观察到的不同时间线：\n这些更新并没有完全丢失-写入1、5和6的事务超时，但它们对读取的影响既可见又不可见，这意味着这些时间线中至少有一个是中止读取的实例。\n这种行为可能令人惊讶，但是MongoDB值得称赞的是，这种行为的大部分都在事务文档中清楚地列出了。问题是，用户是否仔细阅读了该文档，而不是依赖于市场宣传，或者像“使用Read Concerns Snapshot意味着阅读提交的快照”这样的假设。我们可能还会问，是否可以期望用户记住将这些设置应用于需要这些设置的每个事务。毕竟，MongoDB提供了精确的数据库和集合级安全设置，因此用户可以假定与这些数据库或集合交互的所有操作都使用这些设置；当用户执行(可能)安全关键型操作时，忽略读写相关设置是令人惊讶的！\n在随后的测试中，我们对所有单操作读写使用读关注度可线性化和写关注度多数，对多操作事务使用读关注度快照和写关注度多数。在健康群集(例如，没有故障的群集)中，粗略测试似乎与快照隔离一致。\n然而，我们注意到，虽然MongoDB的主页显著地声称提供“全ACID事务”，但人们可能会认为这意味着事务是完全原子的、隔离的、一致的和持久的。事实并非如此：如前所述，快照隔离下的事务并不是完全隔离的。\n例如，考虑以下测试运行，它使用读关注点快照、写关注点多数，并且不涉及网络分区或其他外部故障。生成的历史似乎没有违反快照隔离，但仍然表现出循环的事务依赖关系，如下所示：\n一个事务将1附加到文档1047，并读取文档1045，发现它是空的。另一个将1附加到文档1045，并读取1047，发现它是空的。标记为RW的行表示这些读写反依赖关系。这些事务不可能是隔离的：如果第一个事务先隔离执行，则其对1047的写入对第二个事务是可见的，反之亦然。由于这些事务没有写入相同的文档，因此允许它们(在快照隔离下)并发执行。\n其他周期则更为复杂。例如，这里是一个由12个事务组成的集群，同样在MongoDB最强的安全设置下执行。这些事务中的每一个都(以各种方式)相互依赖。标记为WW的箭头显示写-写依赖关系，其中一个事务覆盖另一个事务的写入。具有WR的事务表现出写-读依赖关系：一个事务读取另一个事务的写。\n或者考虑一下这个由123个事务组成的集群，所有这些事务似乎都是在每个事务之前执行的，但也是在每个事务之后执行的。这个星团是“全酸”吗？也许吧，但如果是这样的话，我们必须承认，酸性中的“我”只意味着部分隔离，或者“完全”意味着略低于完全。\n这些异常现象并不少见。例如，这个历史记录每秒大约包含100个事务，我们识别出1,461个事务(总共13914个)具有循环依赖关系。大约10%的事务在正常运行期间出现异常，没有故障。\n重要的是要记住，仅仅因为我们可以在这个简单的工作负载中检测到异常，并不意味着这些异常对用户很重要。并发性可能足够低，因此在很大程度上不需要进行并发控制。可以证明某些事务集在快照隔离下可串行执行-例如，当它们的写入集相交时。其他的则表现出不可序列化的异常，但不违反应用程序级一致性约束。还有一些确实违反了约束，但还不够频繁，用户不会注意到或在意。对于这些目的，快照隔离就足够好了！\n当我们在测试中引入网络故障时，我们遇到(正如人们所预期的)各种客户端错误。MongoDB事务文档说：\n当事务中止时，事务中所做的所有数据更改都将被丢弃，而不会变得可见。例如，如果事务中的任何操作失败，事务将中止，事务中所做的所有数据更改都将被丢弃，而不会变得可见。1个。\n然而，反之亦然：一些事务错误消息似乎表明事务已中止，但事实并非如此。例如，TransactionConsulatorSteppingDown异常实际上可能意味着事务已提交。同样，命令失败，出现错误6(HostUnreacable)：&#39；无法初始化集合jepsendb.jepsencoll：：Reduced By：：Connection Rejected&#39；的写操作的目标器。我们在测试中反复遇到这些错误，结果发现它们的写入对于以后的读取是可见的。\n这不一定是错误-在任何分布式系统中，总会有一类错误指示成功或失败。但是，如果清楚地标记这些错误，或者提供文本指导，则会很有帮助。错误6，就像我们遇到的大多数错误一样，没有文档记录；官方文档中只剩下几个代码，谷歌也没什么可说的。完整的错误文档(可能带有代码指示确定故障与不确定故障的表)可以为错误消息提供一种实用的替代方案。\n在正确解释错误的情况下，我们发现网络分区可能会导致MongoDB复制事务的影响。尽管从未两次将相同的值附加到一个数组中，但我们反复观察到具有同一元素的多个副本的数组。例如，以此测试运行为例，它包含以下事务：\n这里，元素6在阅读文档436时出现了两次。这种重复提高了将6写入密钥436的事务发生在其他事务之前和之后的可能性；根据人们选择的解释(如果有的话)，所得到的历史也表现出G-Single和G2反依赖循环。即使在读关注点快照和写关注点占多数的情况下也会出现这种异常，这表明即使在最强的设置下，MongoDB事务也不提供快照隔离。\n此行为可能表明事务重试机制不正确-MongoDB将自动重试作为一项功能进行通告。为了确定重试机制是否有问题，我们尝试禁用它-结果发现MongoDB事务忽略了retryWrites设置，并且不管怎样都重试。我们不确定用户是否可以解决此问题。\n在这种情况下，使用读关注点快照和写关注点多数运行的测试执行了三个事务，具有以下依赖关系图：\n最上面的事务将2附加到文档79，紧随其后的是中间事务的附加5。我们可以推断这些写入按此顺序发生，因为观察到另一个事务(不是此周期的一部分)：\n在这些写入之后，底部事务将5附加到文档77，中间事务的读取77没有观察到这一点。但是，追加5对于最上面的事务是可见的！\n因为这个循环正好包含一个反依赖(RW)边缘，所以它很可能是Adya的G-Single异常(也称为读偏差)的一个例子。本质上，中间事务观察到逻辑上优先事务的部分(但不是全部)影响。快照禁止读取偏差。\n..", "note_en": "MongoDB is a distributed document database which claims to offer “among the strongest data consistency, correctness, and safety guarantees of any database available today”, with “full ACID transactions”. Jepsen evaluated MongoDB version 4.2.6, and found that even at the strongest levels of read and write concern, it failed to preserve snapshot isolation. Instead, Jepsen observed read skew, cyclic information flow, duplicate writes, and internal consistency violations. Weak defaults meant that transactions could lose writes and allow dirty reads, even downgrading requested safety levels at the database and collection level. Moreover, the  snapshot read concern did not guarantee snapshot unless paired with write concern  majority—even for read-only transactions. These design choices complicate the safe use of MongoDB transactions. This work was performed independently, without compensation, and conducted in accordance with the  Jepsen ethics policy. MongoDB, Fauna, and YugaByte, all mentioned in this report, have previously engaged Jepsen for paid analyses.\n MongoDB is a popular distributed document database. It offers  replication via a  homegrown consensus protocol which draws inspiration from  Raft, and can distribute data across shards via  mongos. We previously evaluated MongoDB at versions  2.4.3,  2.6.7,  3.4.0-rc3, and  3.6.4.\n Our most recent report on  MongoDB 3.6.4 focused on causal consistency and linearizability in sharded collections. We found that sharded clusters appeared to offer linearizable reads, writes, and compare-and-set operations against single documents, so long as users ran with  read concern  linearizable and  write concern  majority. However, any weaker level of write concern resulted in the loss of committed writes. MongoDB’s default level of write concern was (and remains) acknowledgement by a single node, which means MongoDB may lose data by default. Although the  write concern documentation does not make this clear, the  rollback documentation states:\n With the default write concern, data may be rolled back if the primary steps down before the write operations have replicated to any of the secondaries.\n Similarly, MongoDB’s default level of read concern allows aborted reads: readers can observe state that is not fully committed, and could be discarded in the future. As the  read isolation consistency docs note, “Read uncommitted is the default isolation level”.\n We found that due to these weak defaults, MongoDB’s causal sessions  did not preserve causal consistency by default: users needed to specify both write and read concern  majority (or higher) to actually get causal consistency. MongoDB  closed the issue, saying it was working as designed, and updated their  isolation documentation to note that even though MongoDB offers “causal consistency in client sessions”, that guarantee does not hold unless users take care to use both read and write concern  majority. A  detailed table now shows the properties offered by weaker read and write concerns.\n Curiously, MongoDB omitted any mention of these findings in their  MongoDB and Jepsen page. Instead, that page discusses only passing results, makes no mention of read or write concern, buries the actual report in a footnote, and goes on to claim:\n MongoDB offers among the strongest data consistency, correctness, and safety guarantees of any database available today.\n We encourage MongoDB to report Jepsen findings in context: while MongoDB  did appear to offer per-document linearizability and causal consistency with the strongest settings, it also  failed to offer those properties in most configurations. We think users might want to be aware that their database could lose data by default, but MongoDB’s summary of our work omits any mention of this behavior.\n  So, does MongoDB offer “among the strongest data consistency, correctness, and safety guarantees”? Past work suggests that for individual document operations, the answer is, “yes; MongoDB offers per-document linearizability with the strongest settings, but not by default”. However in 2018, MongoDB introduced  multi-document transactions—limited to within a shard—and in 2019, extended those transactions across shards. What safety properties do these transactions provide?\n The  MongoDB home page proudly advertises “full ACID transactions”. The  transactions page states that MongoDB is “the only database that fully combines the power of the document model and a distributed systems architecture with ACID guarantees,” a combination also claimed by  CosmosDB,  DynamoDB,  FaunaDB,  Oracle NoSQL,  OrientDB,  RavenDB,  SAP HANA,  YugaByte DB, et al.\n The  MongoDB architecture guide promises ACID transactions “maintain the same data integrity guarantees you are used to in traditional databases…”, and that MongoDB offers “strong consistency by design”, but offers no more specific claims. The  ACID whitepaper clarifies that MongoDB transactions offer  snapshot isolation: a reasonably strong model which constitutes the baseline level of consistency for systems like  PostgreSQL. The whitepaper states:\n … snapshot read isolation ensures queries and aggregations executed within a read-only transaction will operate against a globally consistent snapshot of the database across each primary replica of a sharded cluster.\n MongoDB  repeatedly  summarizes snapshot isolation as “transactions provide a consistent view of data, and enforce all-or-nothing execution to maintain data integrity”. This is a concise and intuitive summary of snapshot isolation, but we should note that a “consistent view” under snapshot isolation may still be surprising: as Fekete, O’Neil, and O’Neil  wrote in 2004, read-only transactions can observe nonserializable behavior under snapshot isolation. Nor does snapshot isolation necessarily maintain data integrity: in their  1995 paper defining snapshot isolation, Berenson, Bernstein, et al. provided examples of applications whose integrity constraints could be violated under snapshot isolation—for instance, due to write skew.\n  We designed a  test suite using the  Jepsen distributed systems testing library, and used it to evaluate transactional safety in MongoDB 4.2.6. Our tests installed MongoDB’s official Debian packages on clusters of nine Debian 9 nodes. We tested both in LXC and EC2; both exhibited similar behavior. As per the  deployment guidelines, we built  two-shard clusters, with both shards and the  configsvr metadata system running as three-node  replica sets. All nine nodes ran  an instance of  mongos, which serves as the frontend to sharded MongoDB clusters.\n Our  test workload involved transactions over a rotating pool of documents in a single MongoDB collection, each document containing a single array of integers. Each transaction  performed one to four operations over those documents: either reading a single document by primary key  _id, or appending (using  $push) a unique integer to a single document’s  value array, again by  _id. We  sharded the collection by  _id.\n Using  Elle, a new transaction analysis tool developed in collaboration with UC Santa Cruz’s  Peter Alvaro, Jepsen automatically inferred dependencies between these transactions, and searched for cycles in that graph to identify isolation anomalies. Additional techniques checked for aborted and intermediate reads, as well as other non-cyclic anomalies.\n During some of these tests, we introduced  network partitions, targeted to isolate MongoDB primary nodes.\n   We began by running our tests without transactions to get a baseline: each Jepsen “transaction” performed only a single read or append operation without using the session or transaction APIs. Since we know MongoDB loses updates with any setting less than  majority, and exhibits stale reads without read concern  linearizable, we set write concern  majority and read concern  linearizable  on the client’s  database handle. The resulting histories appeared consistent with snapshot isolation.\n We then wrapped those single operations in transactions, and a surprising behavior appeared: with network partitions, transactions appeared to lose acknowledged writes. For instance, consider  this history, where in 30 seconds, updates to eight documents were successfully acknowledged, then disappeared. Here is the history of reads for document 555:\n  Clients observed a monotonically growing list of elements until  [1 2 3 4 5 6 7], at which point the list reset to  [], and started afresh with  [8]. This could be an example of MongoDB  rollbacks, which is a fancy way of saying “data loss”.\n This is bad, but a more subtle question arises:  why were we able to read these values at all? After all, read concern  linearizable  is supposed to show only majority-acknowledged (i.e. durable) writes. The answer is a surprising— but documented—MongoDB design choice:\n Operations in a transaction use the transaction-level read concern. That is, any read concern set at the collection and database level is ignored inside the transaction.\n The received wisdom in the database community is that MongoDB has historically resisted raising the default level of read and write safety because doing so would impact production users who have become accustomed to faster, occasionally unsafe defaults, and because data loss might not be significant enough to warrant the increased latency, throughput, and capital expenditure entailed by stronger safety settings. MongoDB’s researchers  reported in VLDB that:\n … users would prefer, of course, to use readConcern level “majority” and writeConcern w:“majority”, since everyone wants safety. However, when users find stronger consistency levels to be too slow, they will switch to using weaker consistency levels. These decisions are often based on business requirements and SLAs rather than granular developer needs. As we argue throughout this paper, the decision to use weaker consistency levels often works in practice because failovers are infrequent and data loss from failovers is usually small.\n However, transactions are an entirely new feature, and users presumably  expect to trade off some speed in exchange for improved safety guarantees. A reasonable user might expect that the default safety levels for transactions provide, as promised, snapshot isolation—or, at the very least, the same level of read concern that the user has already requested from the databases or collections involved. Instead, transactions without an explicit read concern  downgrade any requested read concern at the database or collection level to a default level of  local,  which offers “no guarantee that the data has been written to a majority of replicas (i.e. may be rolled back).”\n So: users should be careful to use the  snapshot level of read concern with every transaction which requires snapshot isolation. The  documentation confirms: “Read concern ‘snapshot’ returns data from a snapshot of majority committed data…” which makes sense, and then continues: “ if the transaction commits with write concern ‘majority’”, which does not. Specifically:\n If the transaction does not use write concern “majority” for the commit, the “snapshot” read concern provides no guarantee that read operations used a snapshot of majority-committed data.\n “What is the point,” an astute reader might ask, “of having a  snapshot read concern which does not provide snapshot isolated reads?” An even more astute reader, having observed a pattern, might inquire about the  default level of write concern.\n If the transaction-level write concern and the session-level write concern are unset, transaction-level write concern defaults to the client-level write concern. By default, client-level write concern is w: 1.\n In order to obtain snapshot isolation, users must be careful not only to set the read concern to  snapshot for each transaction, but  also to set write concern for each transaction to  majority.\n Astonishingly, this applies even to  read-only transactions. In  this test run, we set read concern  snapshot and write concern  majority on single-operation write transactions, and for single-operation read transactions, set only read concern  snapshot. When a network partition occurred, reads observed divergent timelines:\n  These updates weren’t  lost exactly—the transactions which wrote 1, 5, and 6 timed out, but their effects being both visible and not visible to reads implies that at least one of these timelines was an instance of aborted read.\n This behavior might be surprising, but to MongoDB’s credit, most of this behavior is  clearly laid out in the transactions documentation. The question is whether users are closely reading that documentation, versus relying on marketing claims, or assumptions like “using read concern  snapshot means reading a committed snapshot”. We might also ask whether users can be expected to remember to apply these settings to every transaction which requires them. After all, MongoDB offers database and collection-level safety settings precisely so users can  assume all operations interacting with those databases or collections use those settings; ignoring read and write concern settings when users perform (presumably) safety-critical operations is surprising!\n  In subsequent tests, we used read concern  linearizable and write concern  majority for all single-operation reads and writes, and read concern  snapshot and write concern  majority for multi-operation transactions. In healthy clusters (e.g. without faults), cursory testing appeared consistent with snapshot isolation.\n However, we note that while MongoDB’s home page prominently  claims to offer “full ACID transactions”, which one might assume means that transactions are fully atomic, isolated, consistent, and durable. This is not exactly the case: transactions under snapshot isolation are not, as  previously noted, fully isolated.\n For example, consider  this test run, which used read concern  snapshot, write concern  majority, and did not involve network partitions or other exogenous faults. The resulting history does not appear to violate snapshot isolation, but nonetheless exhibits cyclic transaction dependencies, like the following:\n  One transaction appends 1 to document 1047, and reads document 1045, finding it empty. The other appends 1 to document 1045, and reads 1047, finding it empty. Lines marked  rw denote these read-write  anti-dependencies. These transactions cannot possibly be isolated: if the top transaction executed first, in isolation, its write to 1047 would have been visible to the second—and vice-versa. Since these transactions didn’t write to the same documents, they are allowed (under snapshot isolation) to execute concurrently.\n  Other cycles are more complex. Here, for instance, is a cluster of twelve transactions, again executed under MongoDB’s strongest possible safety settings. Each of these transactions depends (in various ways) on every other. Arrows labeled  ww show a write-write dependency, wherein one transaction overwrote another’s write. Those with  wr show a write-read dependency: one transaction read another’s write.\n Or consider this  cluster of 123 transactions, all of which appeared to execute before—but also after!—every other. Is this cluster “full ACID”? Perhaps, but if so, we must accept that the “I” in ACID means only  partial isolation, or “full” means somewhat less than full.\n  These anomalies are not rare.  This history, for example, contains roughly 100 transactions per second, and we identified 1461 transactions (out of 13914 total) with cyclic dependencies. Roughly 10% of transactions exhibited anomalies during normal operation, without faults.\n It’s important to remember that just because we  can detect anomalies in this simple workload doesn’t mean those anomalies  matter to users. Concurrency could be low enough that concurrency control is largely unnecessary. Some sets of transactions can be proven to execute serializably under snapshot isolation—e.g., when their write sets intersect. Others exhibit nonserializable anomalies, but don’t violate application-level consistency constraints. Still others  do violate constraints, but not frequently enough for users to notice or care. For these purposes, snapshot isolation is good enough!\n  When we introduced network failures into our tests, we encountered (as one would expect)  a variety of client errors. The MongoDB  transaction documentation says:\n When a transaction aborts, all data changes made in the transaction are discarded without ever becoming visible. For example, if any operation in the transaction fails, the transaction aborts and all data changes made in the transaction are discarded without ever becoming visible.  1\n However, the converse is not necessarily true:  some transaction error messages seem to indicate a transaction has aborted, but do not. For example, a  TransactionCoordinatorSteppingDown exception may actually mean the transaction has committed. Likewise,  Command failed with error 6 (HostUnreachable): &#39;unable to initialize targeter for write op for collection jepsendb.jepsencoll :: caused by :: Connection refused&#39; also appears to denote an indeterminate failure. We repeatedly encountered these errors in our tests, only to find that their writes were visible to later reads.\n This is not necessarily a  bug—there will always be a class of errors in any distributed system which could indicate either success or failure. However, it  is helpful when those errors are clearly marked, or offer textual guidance. Error 6, like most of the errors we encountered, is  undocumented; only a few codes  remain in the official docs, and Google has  little to say. Complete error documentation, perhaps with a table of which codes indicate determinate vs indeterminate failures, could offer a pragmatic alternative to error message haruspicy.\n  With errors interpreted correctly, we found that network partitions could cause MongoDB to duplicate the effects of transactions. Despite never appending the same value to an array twice, we repeatedly observed arrays with multiple copies of the same element. For example, take  this test run, which contained the following transaction:\n  Here, element 6 appeared twice in a read of document 436. This duplication raises the possibility that the transaction which wrote 6 to key 436 occurred both before  and after other transactions; depending on which (if any) interpretation one chooses, the resulting history also exhibits G-single and G2 anti-dependency cycles. This anomaly occurred even with read concern  snapshot and write concern  majority, which suggests that even at the strongest settings, MongoDB transactions do not provide snapshot isolation.\n This behavior could point to an improper transaction retry mechanism—MongoDB advertises  automatic retries as a feature. To identify whether the retry mechanism might be at fault, we attempted to disable it—only to discover that MongoDB transactions  ignore the  retryWrites setting, and  retry regardless. We are unsure if users can work around this behavior.\n  In  this case, a test running with read concern  snapshot and write concern  majority executed a trio of transactions with the following dependency graph:\n  The topmost transaction appended 2 to document 79, which was followed by the middle transaction’s append of 5. We can infer these writes took place in this order because another transaction (not part of this cycle) observed:\n  Following these writes, the bottom transaction appended 5 to document 77, which was  not observed by the middle transaction’s read of 77. However, that append of 5  was visible to the topmost transaction!\n Because this cycle contains exactly one anti-dependency (rw) edge, it’s likely  2 an example of  Adya’s G-single anomaly, also known as  read skew. In essence, the middle transaction observed some, but not all, effects of logically prior transactions. Read skew is prohibited by snapshot \n......", "posttime": "2020-05-16 01:43:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "mongodb,杰普森,jepsen,事务", "title": "杰普森：MongoDB 4.2.6", "title_en": "Jepsen: MongoDB 4.2.6", "transed": 1, "url": "http://jepsen.io/analyses/mongodb-4.2.6", "via": "", "real_tags": ["mongodb", "杰普森", "jepsen", "事务"]}, {"category": "", "categoryclass": "", "imagename": "74f8e4cb8f0ef2bac855a20b323f0b82.png", "infoid": 1002267, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "🤗自然语言处理是一个轻量级且可扩展的库，可以方便地共享和访问自然语言处理的数据集和评估指标。\n致力于大数据集：NLP自然将用户从RAM内存限制中解放出来，默认情况下，所有数据集都是在驱动器上进行内存映射的。\nNLP目前提供对约100个NLP数据集和约10个评估指标的访问，旨在让社区轻松添加和共享新的数据集和评估指标。\nNLP起源于令人惊叹的TensorFlow数据集的一个分支，HuggingFace团队非常感谢TensorFlow数据集团队构建了这个令人惊叹的库。有关NLP和TFD之间差异的更多详细信息，可以在NLP和TFD之间的主要差异一节中找到。\nNLP可以从PyPI安装，并且必须安装在虚拟环境中(例如venv或conda)。\n更新存储库时，应按如下方式升级NLP安装及其依赖项：\n如果您计划对PyTorch(1.0+)、TensorFlow(2.2+)或熊猫使用NLP，还应该安装PyTorch、TensorFlow或熊猫。\nimport NLP#打印所有可用的数据集打印(数据集。NLP中数据集的ID。list_Datasets())#加载数据集并打印训练集中的第一个示例teanDataset=nlp。LOAD_DATASET(&#39；TEAND&39；)PRINT(LOAD_DATASET[&#39；TEAND&39；][0])#列出所有可用的指标打印(指标。NLP中指标的ID。list_metrics())#加载指标QUAND_METRICS=nlp。Load_Metric(&#39；小队&#39；)\n现在，最好的NLP介绍是按照Google Colab中的教程进行操作，该教程位于以下位置：\n如果您熟悉伟大的TensorFlow数据集，以下是NLP和TFD之间的主要区别：\nNLP中的脚本不在库中提供，而是根据请求进行查询、下载/缓存和动态加载。\nNLP还以与数据集类似的方式提供评估指标，即使用统一API动态安装脚本。这样就可以访问基准数据集和基准指标对，例如，针对班组或胶水之类的基准。\nNLP的后端序列化基于Apache Arrow/Parquet，而不是TF Records，并利用Python数据类获取信息和具有一些不同特性的特性(我们大多不进行编码，并将原始数据尽可能多地存储在后端序列化缓存中)。\nNLP的面向用户的DataSet对象不是tf.data.Dataset，而是一个内置的与框架无关的DataSet类，其方法灵感来自我们在tf.data中的喜好(如map()方法)。它基本上包装了一个内存映射的箭头表缓存。\n与TensorFlow数据集类似，NLP是下载和准备公共数据集的实用程序库。我们不托管或分发这些数据集，不保证它们的质量或公平性，也不声称您拥有使用该数据集的许可证。您有责任确定您是否有权在数据集的许可下使用该数据集。\n如果您是数据集所有者，并且希望更新数据集的任何部分(描述、引用等)，或者不希望您的数据集包含在此库中，请通过GitHub问题联系。感谢您对ML社区的贡献！\n如果你有兴趣了解更多关于负责任的人工智能实践，包括公平，请参见谷歌人工智能负责任的人工智能实践。", "note_en": "🤗  nlp is a lightweight and extensible library to easily share and access datasets and evaluation metrics for Natural Language Processing (NLP).\n  Strive on large datasets:  nlp naturally frees the user from RAM memory limitation, all datasets are memory-mapped on drive by default.\n nlp currently provides access to ~100 NLP datasets and ~10 evaluation metrics and is designed to let the community easily add and share new datasets and evaluation metrics.\n nlp originated from a fork of the awesome   TensorFlow Datasets and the HuggingFace team want to deeply thank the TensorFlow Datasets team for building this amazing library. More details on the differences between  nlp and  tfds can be found in the section  Main differences between  nlp and  tfds.\n   nlp can be installed from PyPi and has to be installed in a virtual environment (venv or conda for instance)\n     When you update the repository, you should upgrade the nlp installation and its dependencies as follows:\n   If you plan to use  nlp with PyTorch (1.0+), TensorFlow (2.2+) or pandas, you should also install PyTorch, Tensorflow or pandas.\n     import  nlp # Print all the available datasets print( dataset. id  for  dataset  in  nlp. list_datasets()) # Load a dataset and print the first examples in the training set squad_dataset  =  nlp. load_dataset( &#39;squad&#39;) print( squad_dataset[ &#39;train&#39;][ 0]) # List all the available metrics print( metric. id  for  metric  in  nlp. list_metrics()) # Load a metric squad_metric  =  nlp. load_metric( &#39;squad&#39;)\n Now the best introduction to  nlp is to follow the tutorial in Google Colab which is here:\n  If you are familiar with the great  Tensorflow Datasets, here are the main differences between  nlp and  tfds:\n the scripts in  nlp are not provided within the library but are queried, downloaded/cached and dynamically loaded upon request\n nlp also provides evaluation metrics in a similar fashion to the datasets, i.e. as dynamically installed scripts with a unified API. This gives access to the pair of a benchmark dataset and a benchmark metric for instance for benchmarks like SQuAD or GLUE.\n the backend serialization of  nlp is based on Apache Arrow/Parquet instead of TF Records and leverage python dataclasses for info and features with some diverging features (we mostly don&#39;t do encoding and store the raw data as much as possible in the backend serialization cache)\n the user-facing dataset object of  nlp is not a  tf.data.Dataset but a built-in framework-agnostic dataset class with methods inspired by what we like in tf.data (like a map() method). It basically wraps a memory-mapped Arrow table cache.\n  Similarly to Tensorflow Dataset,  nlp is a utility library that downloads and prepares public datasets. We do not host or distribute these datasets, vouch for their quality or fairness, or claim that you have license to use the dataset. It is your responsibility to determine whether you have permission to use the dataset under the dataset&#39;s license.\n If you&#39;re a dataset owner and wish to update any part of it (description, citation, etc.), or do not want your dataset to be included in this library, please get in touch through a GitHub issue. Thanks for your contribution to the ML community!\n If you&#39;re interested in learning more about responsible AI practices, including fairness, please see Google AI&#39;s Responsible AI Practices.", "posttime": "2020-05-16 01:42:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "拥抱,datasets,nlp", "title": "NLP：一个来自拥抱脸的新数据集和度量库", "title_en": "NLP: A new datasets and metrics library from Hugging Face", "transed": 1, "url": "https://github.com/huggingface/nlp", "via": "", "real_tags": ["拥抱", "datasets", "nlp"]}, {"category": "", "categoryclass": "", "imagename": "9d0450454c551c74df35396ba197f0fe.jpg", "infoid": 1002266, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在物理世界中，物体经常以有序的方式相互推开。想想看，在磁场的影响下，铁屑形成的对称图案，或者是正在练习社交距离的参观者的均匀间隔。\n当数学家观察数字线时，他们看到的是同一类型的趋势。他们看着表示正负计数的刻度线，感觉到一种将它们保持在相等间距的数值力量。这就好像，就像拥有广阔领地的美洲狮一样，整数之间的距离不能超过1个单位。\n数字线的间距是整个数论领域中发现的现象的最基本的例子。它在研究素数和不同类型方程的解之间的关系时突然出现。数学家可以通过量化它们之间的作用力来更好地理解这些重要的值。\n“具有数论意义的事物往往会相互推开。多伦多大学的雅各布·齐默曼(Jacob Tsimerman)说：“这就是排斥原理。”“我们试图获得排斥原理，并利用它们来获得各种其他结果。”\n数论中的许多重要工作都与排斥原理影响多项式、系数集合和升幂变量的方式有关。几十年来，数学家们一直试图确定在这种情况下斥力的确切大小。\n在12月下旬发布在网上的一份证明中，多伦多大学的韦塞林·迪米特罗夫(Vesselin Dimitrov)最终做到了这一点。\n剑桥大学的Péter Varjú在电子邮件中说：“这真的很壮观。”“Vesselin的想法是全新的，而且很漂亮。”\n迪米特罗夫解决的问题，被称为Schinzel-Zassenhaus猜想，是关于多项式的值的几何的。它预测，当你画出某些值时，它们会以精确的方式展开，看起来就像是在相互推开。迪米特罗夫的工作精确地量化了这种扩散，证明了猜想是正确的。它还提供了对数字似乎遵守的规律的新见解。\n齐默尔曼说：“根据我们对代数数字的理解，这一结果在地面上插上了一面旗帜。”\n在研究多项式时，数学家特别感兴趣的是它们的“根”，即使多项式等于零的变量的值。一个多项式的根和它的次数一样多，也就是它的最大指数的值一样多。因此x 2−4有两个根(2和−2)，而x 5−7 x 3+2 x 2−4 x−9有五个根。\n数学家想知道多项式的根是如何相互联系的。例如，当绘制图形时，某些多项式的根正好落在正多边形的顶点上-它们以精确的几何长度分开。数学家感兴趣的是寻找根之间其他更微妙的几何关系。\n“你能拿到什么样的图案？你能得到一些图案吗，或者这些图案有没有什么限制？“。剑桥大学的伊曼纽尔·布鲁拉德(Emmanuel Breuillard)说。\n迪米特罗夫解决的问题涉及到一族特别重要的表达式的根，称为割圆多项式。这些多项式不能分解成更小的多项式，但你可以用它们来构建其他多项式-它们就像多项式周期表中的元素。第一个也是最简单的割圆多项式是x−1，第二个是x+1，第十个是x4−x3+x2−x+1。然而，与元素周期表不同的是，割圆多项式的列表是永远不变的。\n分圆多项式的根遵循一种非常特殊的几何模式。要查看它，请从空的复平面开始，在该平面中，x轴绘制实数，y轴绘制虚数。然后在原点周围画一个半径为1的圆。这是单位圆。分圆多项式的根都在这个圆上。它们有着一个优雅的名字：“团结之根”。\n但是大多数多项式都是非割圆的，它们的根也不是单位根。这几乎是你能想出的任何系数、变量和指数的组合。\n1965年，Andrzej Schinzel和Hans Zassenhaus预测，割圆多项式和非割圆多项式的根的几何形状有非常特殊的不同。取任何第一个系数为1的非分圆多项式，画出它的根。有些人可能落在单位圈内，有些人就在单位圈内，还有一些人在单位圈外。Schinzel和Zassenhaus预测，每个非割圆多项式必须至少有一个根在单位圆之外，并且至少有一段最小距离。\n或者，用排斥力来表述辛泽尔-扎森豪斯猜想，它预测，非割圆多项式的最小根-可能落在单位圆内-有效地将其他根推到单位圆之外，就像磁铁相互推开一样。\n布鲁亚德说：“你可以把一个多项式的根想象成带负电的粒子，它们相互排斥，随着距离的增加，力会衰减。”\nSchinzel-Zassenhaus猜想甚至精确地定义了排斥力应该有多大。“它说有一种非常精确的、可量化的感觉，即根不可能都离单位圆很近，”齐默尔曼说。\n这个猜想的主要预测有一种物理方程式的感觉。它说，每个非割圆多项式都应该至少有一个根在单位圆之外，距离等于一个常数除以多项式的次数。该常量的精确值不是关键的，所以为了举例，假设它是0.1。如果我们有一个23次的非分圆多项式，这个猜想预测它在单位圆之外至少应该有一个根1/23。\n这是一个强有力的论断，但几十年来，数学家们只设法证实了猜想预测的较弱版本。\nSchinzel和Zassenhaus自己证明了每个非分圆多项式在单位圆外至少有一个1/4的根，提升到多项式的次数(1/4d)。由于分母中指数的存在，这个距离比猜想的距离小得多。\n在接下来的三十年里，数学家们对辛泽尔和扎森豪斯的工作进行了一系列的改进，但进展仍然不完整。数学家认为正确的距离应该是一个尺寸，但他们只能证明它至少是某个较小的尺寸。数学家们根本不知道辛泽尔-扎森豪斯猜想有多难解，他们甚至假设它完全可以解决。\n迪米特罗夫在电子邮件中说：“在找到解决方案之前，人们永远不会在一开始就知道(问题的)解决方案会变得多么简单或复杂。”\n通常，当一个突出的数学问题长期悬而未决时，这是因为数学家只是缺乏解决它所需的技术。尽管你可能梦想着飞向月球，但除非有人发明火箭，否则你是不会到达那里的。\n但事实证明，这个问题是不同的。“这项技术至少已经有40年的历史了，”齐默尔曼说。\n迪米特罗夫把一个关于多项式的根的大小的问题转化为一个关于与一个被称为幂级数的相关但不同类型的数学对象相关的值的大小的问题。幂级数就像一个多项式，只是有无限多项。\n芝加哥大学的弗兰克·卡莱加里(Frank Calegari)在电子邮件中说：“就像数学中经常发生的那样，关键的洞察力/突破是将两个看似不同的问题联系起来。”\n数学家习惯于在多项式和幂级数之间轻松地移动，并利用其中一个的性质来建立另一个的性质-但在迪米特罗夫之前的数学家们并没有想过用这种对应来解决辛泽尔-扎森豪斯猜想(Schinzel-Zassenhaus Conjection)。\n为了证明他想要证明的关于多项式的东西，迪米特罗夫需要相关的幂级数有一个特定的、本质的性质：所有的系数都需要是正整数或负整数(所以没有分数)。当迪米特罗夫开始这项工作时，没有明显的方法来保证这一点会发生。\n但在2019年11月，迪米特罗夫在“浏览代数组合学的几本书和几篇论文”时，意识到有一种方法可以拼凑出几个众所周知的定理，从而在非割圆多项式及其幂级数之间产生正确的关系。他取了一个非割圆多项式，找出它的根，把这些根提升到不同的幂，乘在一起，然后取那个乘积的平方根。然后，最后，基于这个平方根，他可以构造一个具有本质性质的幂级数。\n迪米特罗夫说：“我们取该产品的平方根，这对我来说是一个令人惊讶的把戏。”这一切都是如此出人意料和有益，以至于迪米特罗夫称这一事实是一个“小小的奇迹”。这使得他的证据中的下一步成为可能。\n迪米特罗夫证明了幂级数的系数是整数。它们在某种意义上总是“大”的--它们必须至少是1。正因为如此，与幂级数相关的其他值--它的“汉克尔行列式”--也必须很大。通过一系列仔细的论证，他证明了如果系数是整数，并且Hankel行列式很大，那么他开始的非割圆多项式的根之一也一定是大的。证明的大部分工作都是在严格地证明这种联系。\n“暗示系数不小意味着迪米特罗夫在寻找什么，这是相当微妙的。这不是直接推断出来的，“比萨Scuola Normen Superiore的翁贝托·赞尼尔(Umberto Zannier)说。\n迪米特罗夫证明了所有非分圆多项式的根必须至少是log2除以单位圆外多项式的次数的4倍，即(Log2)/(4d)。迪米特罗夫的结果符合Schinzel和Zassenhaus的预测，即距离是某个常数除以多项式的次数的函数。他找到了一种新颖的方法来组合数学家手头上已经有的工具，从而做到了这一点。\n赞尼尔说：“他发明了完全隐藏的证据模式。”“这些碎片已经被证实了，但这些碎片所依据的理论与辛泽尔-扎森豪斯毫无关系。”\n迪米特罗夫的证明解决了数论中关于多项式中出现的模式的主要问题之一。未来的工作可能会调整迪米特罗夫提出的比率。确切的值可能是分子中的log3，分母中多项式次数的5倍。但是对于数学家来说，常量的精确数值只是一个技术问题。比例是最重要的，从这个意义上说，迪米特罗夫准确地证实了辛泽尔和扎森豪斯的预测。\nBreuillard说：“这个结果非常清脆，这是可能的最好结果。”“不会有比现在更好的了。”\n更正：2020年5月14日，本文的前一个版本错误地陈述了Schinzel-Zassenhaus猜想的一个含义。这篇文章已作了相应的修改。", "note_en": "In the physical world, objects often push each other apart in an orderly way. Think of the symmetric designs formed by iron filings under the influence of a magnetic field, or the even spacing of parkgoers practicing social distancing.\n When mathematicians look at the number line, they see the same type of trend. They look at the tick marks denoting the positive and negative counting numbers and sense a kind of numerical force holding them in that equal spacing. It’s as though, like mountain lions with their wide territories, integers can’t exist any closer together than 1 unit apart.\n The spacing of the number line is the most basic example of a phenomenon found throughout the field of number theory. It crops up in the study of prime numbers and in the relationships between solutions to different types of equations. Mathematicians can better understand these important values by quantifying the force that acts between them.\n “Things with number-theoretic significance tend to push each other apart. The name for this is a repulsion principle,” said  Jacob Tsimerman of the University of Toronto. “We try to obtain repulsion principles and use them to get various other results.”\n A lot of important work in number theory has to do with the way a repulsion principle influences polynomials, collections of coefficients and variables raised to powers. And for decades, mathematicians have been trying to pin down the exact magnitude of the repulsion in this setting.\n In a proof posted  online in late December,  Vesselin Dimitrov of the University of Toronto finally did it.\n “It is truly spectacular,” said  Péter Varjú of the University of Cambridge over email. “Vesselin’s idea is completely new, and it is beautiful.”\n The problem Dimitrov solved, known as the Schinzel-Zassenhaus conjecture, is about the geometry of values of polynomials. It predicts that when you graph certain values, they’ll be spread out in an exact way, looking as if they’re pushing each other apart. Dimitrov’s work exactly quantifies this spreading out, proving the conjecture true. It also provides new insight into the laws that numbers seem to obey.\n “This result plants a flag in the ground in terms of our understanding of algebraic numbers,” Tsimerman said.\n  When studying polynomials, mathematicians are especially interested in their “roots,” the values of a variable that make the polynomial equal zero. A polynomial has as many roots as its degree, or the value of its largest exponent. So  x 2 − 4 has two roots (2 and −2), while  x 5 − 7 x 3 + 2 x 2 − 4 x − 9 has five roots.\n Mathematicians want to know how the roots of a polynomial relate to each other. For example, when graphed, the roots of some polynomials fall exactly on the vertices of regular polygons — they stand apart by an exact geometric length. Mathematicians are interested in finding other, more subtle geometric relationships between roots.\n “What kinds of patterns can you get? Can you get any patterns, or are the patterns somewhat restricted?” said  Emmanuel Breuillard of Cambridge.\n The problem that Dimitrov solved involves the roots of a particularly important family of expressions called the cyclotomic polynomials. These polynomials can’t be factored into smaller ones, but you can use them to build other polynomials — they’re like the elements in a periodic table of polynomials. The first and simplest cyclotomic polynomial is  x − 1, and the second is  x + 1. The tenth is  x 4 −  x 3 +  x 2 −  x + 1. Unlike the periodic table, however, the list of cyclotomic polynomials goes on forever.\n The roots of cyclotomic polynomials follow a very special geometric pattern. To see it, start with the empty complex plane, in which the  x-axis plots real numbers and the  y-axis plots imaginary ones. Then inscribe a circle with a radius of 1 around the origin. This is the unit circle. The roots of cyclotomic polynomials all lie on this circle. They bear an elegant name: “roots of unity.”\n  But most polynomials are non-cyclotomic, and their roots are not roots of unity. This is the case with almost any combination of coefficients, variables and exponents you could come up with.\n In 1965,  Andrzej Schinzel and  Hans Zassenhaus predicted that the geometry of the roots of cyclotomic and non-cyclotomic polynomials differs in a very specific way. Take any non-cyclotomic polynomial whose first coefficient is 1 and graph its roots. Some may fall inside the unit circle, others right on it, and still others outside it. Schinzel and Zassenhaus predicted that every non-cyclotomic polynomial must have at least one root that’s outside the unit circle and at least some minimum distance away.\n Or, to put the Schinzel-Zassenhaus conjecture in terms of repulsion, it predicted that the smallest roots of a non-cyclotomic polynomial — which might fall within the unit circle — effectively push other roots outside the unit circle, like magnets pushing each other away.\n “You can think of the roots of a polynomial as negatively charged particles that repel each other with a force that decays when the distance increases,” Breuillard said.\n The Schinzel-Zassenhaus conjecture even defined exactly how strong that repulsive force should be. “It says there’s a very precise, quantifiable sense in which the roots can’t all be very close to the unit circle,” Tsimerman said.\n  The conjecture’s main prediction has the feel of a physics equation. It says every non-cyclotomic polynomial should have at least one root that is outside the unit circle by a distance equal to a constant number divided by the degree of the polynomial. The exact value of that constant is not critical, so for the sake of an example, say it’s 0.1. If we had a non-cyclotomic polynomial of degree 23, the conjecture predicts that it should have a root at least .1/23 outside the unit circle.\n It’s a powerful statement, but for decades mathematicians only managed to confirm weaker versions of the conjecture’s prediction.\n Schinzel and Zassenhaus themselves proved that every non-cyclotomic polynomial has a root at least 1 over 4 raised to the degree of the polynomial (1/4  d) outside the unit circle. This distance is much smaller than the conjectured one due to the presence of an exponent in the denominator.\n Over the next three decades mathematicians made a series of improvements on Schinzel and Zassenhaus’ work, but the progress remained incomplete. Mathematicians thought the correct distance should be one size, but they could only prove it was at least some smaller size. Mathematicians had no idea how hard the Schinzel-Zassenhaus conjecture would be to solve, assuming it could even be solved at all.\n “One never ultimately knows at the outset how simple or complicated [a problem’s] solution will turn out to be — until that solution is found,” said Dimitrov over email.\n  Often when a prominent math problem remains open for a long time, it’s because mathematicians simply lack the techniques required to solve it. Dream as you might of flying to the moon, you’re not getting there until someone invents a rocket.\n But as it turned out, this problem was different. “The technology has been around for at least 40 years,” Tsimerman said.\n Dimitrov transformed a question about the size of roots of polynomials into a question about the size of values associated to a related but different type of mathematical object called a power series. A power series is like a polynomial, only with infinitely many terms.\n “As often happens in mathematics, the key insight/breakthrough was to connect two seemingly different problems,” said  Frank Calegari of the University of Chicago over email.\n Mathematicians are accustomed to moving easily between polynomials and power series and using properties of one to establish properties of the other — but mathematicians before Dimitrov didn’t think to use this correspondence to address the Schinzel-Zassenhaus conjecture.\n To prove what he wanted to prove about polynomials, Dimitrov needed the related power series to have a specific, essential property: All the coefficients needed to be positive or negative whole numbers (so no fractions). And when Dimitrov started this work, there was no obvious way to guarantee that would happen.\n But in November 2019, while “browsing through a few books and papers in algebraic combinatorics,” Dimitrov realized there was a way to cobble together a few well-known theorems to produce the right relationship between a non-cyclotomic polynomial and its power series. He took a non-cyclotomic polynomial, found its roots, raised those roots to different powers, multiplied them together, then took the square root of that product. Then, finally, based on that square root, he could construct a power series with the essential property.\n “This was a surprising trick to me, that we take the square root of that product,” said Dimitrov. It was all so unexpected and helpful that Dimitrov calls the fact that it works a “small miracle.” This enabled the next steps in his proof.\n Dimitrov proved that the coefficients of the power series are whole number integers. These are always “large” in a sense — they must be at least 1. Because of this, other values related to the power series — its “Hankel determinants” — also have to be large. Through a careful chain of argument, he proved that if coefficients are whole number integers and the Hankel determinants are large, then one of the roots of the non-cyclotomic polynomial he began with must also be large. Much of the work of the proof was in rigorously proving that connection.\n “The implication that the coefficients being not small implies what Dimitrov is seeking is quite subtle. It is not something that’s deduced in a direct way,” said  Umberto Zannier of Scuola Normale Superiore in Pisa.\n Dimitrov proved that all non-cyclotomic polynomials must have a root that’s at least log 2 divided by four times the degree of the polynomial outside the unit circle; that is, (log 2)/(4 d). Dimitrov’s result fulfills Schinzel and Zassenhaus’ prediction that the distance is a function of some constant value divided by the degree of the polynomial. And he did it by finding a novel way to combine tools that mathematicians already had on hand.\n “He invented the pattern of the proof, which was completely hidden,” said Zannier. “The pieces were already proved, but these pieces were lying in theories which a priori had nothing to do with Schinzel-Zassenhaus.”\n  Dimitrov’s proof solves one of the main problems in number theory about the patterns that appear within polynomials. Future work may tweak the ratio Dimitrov came up with. It’s possible that the exact values are, say, log 3 in the numerator and five times the degree of the polynomial in the denominator. But to mathematicians, the exact value of the constants is just a technicality. It’s the proportions that matter most, and in that sense, Dimitrov has precisely confirmed Schinzel and Zassenhaus’ prediction.\n “This result is very crisp and it’s the best possible result,” Breuillard said. “It’s not going to get any better than this.”\n Correction : May 14, 2020  A previous version of this article misstated one of the implications of the Schinzel-Zassenhaus conjecture. The article has been revised accordingly.", "posttime": "2020-05-16 01:12:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "测量,measures,多项式", "title": "数学家测量多项式中的排斥力", "title_en": "Mathematician Measures the Repulsive Force Within Polynomials", "transed": 1, "url": "https://www.quantamagazine.org/new-math-measures-the-repulsive-force-within-polynomials-20200514/", "via": "", "real_tags": ["测量", "measures", "多项式"]}, {"category": "", "categoryclass": "", "imagename": "1aeb07306b3f82b3c21f0c9493a52f9a.jpg", "infoid": 1002265, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "编者按：“经济学人”正在向我们的每日通讯“今日经济学人”的读者免费提供一些关于冠状病毒大流行的最重要的报道。要接收它，请在这里注册。有关我们的冠状病毒跟踪器和更多报道，请参阅我们的中心。\n在危机中速度更快。面对冠状病毒，疫苗制造商正在尽可能安全地偷工减料。抗病毒药物正在仓促进入临床试验。即便如此，还需要几个月的时间才能有任何东西可用。据记录，有29.7万人死亡，等待是痛苦的。但谨慎是至关重要的。医学史上充满了充满希望的治疗方法，经过测试，这些方法都不起作用，甚至造成伤害。\n许多政府希望拯救能更早到来，因为智能手机上有联系人追踪应用程序-尽管苹果和谷歌对这项技术的控制正在酝酿着一场争吵。这些应用程序可以用来自动化追踪与那些被诊断为冠状病毒感染者有过接触的人的艰难过程，这对跟踪病毒至关重要。从巴林和保加利亚到印度尼西亚和冰岛等国都开发了这样的应用程序。\n它们是一个很有吸引力的想法。然而，接触追踪应用程序也是一项未经测试的医学发明，将在没有新药受到的那种保障的情况下推出。不准确的信息可能会误导卫生官员和公民，其危害可能与任何失败的药物一样严重。政府应该谨慎行事。\n覆盖面是一个复杂的问题。流行病学家估计，如果大约60%的人使用应用程序，它们可能会很有用。然而，即使在普及率最高的欧洲，也只有76%的人拥有移动互联网订阅服务。这一数字在老年人中较低，老年人最容易受到冠状病毒的影响。最近的一项调查显示，只有不到一半的美国人会使用接触者追踪应用程序。\n准确性也是一个问题。这类应用程序旨在监听附近的手机，如果另一台设备足够近，就会注册联系人。然而，用来做到这一点的无线电信号的强度除了受距离的影响外，还受各种因素的影响。例如，人体会阻碍传输，这意味着口袋里的手机和手中的手机会有不同的表现。\n这可能会使校准系统变得困难-而一个错误将会产生后果。太敏感了，你就会冒着“假阳性”泛滥的风险：被认为是密切而重要的、实际上是遥远而无关紧要的接触。过于宽容，真正的病毒传播病例将不会被发现。\n此外，这些应用程序本身可能会改变人们的行为。一款过度安心的应用程序可能会刺激人们在安全之前出门。出于医疗原因和公民自由，必须权衡隐私和透明度。韩国公布了其接触追踪器发现的病例的详细摘要。最近病例的跃升与一名光顾同性恋夜总会的男子有关。由此产生的仇视同性恋的谩骂之流可能会阻止其他人与当局合作，无论是电子方式还是其他方式。\n包括英国、法国和德国在内的一些政府的努力因苹果和谷歌而变得复杂，这两家公司共同控制着地球上几乎每一部智能手机。这些公司已经将隐私作为优先事项，认为用户将是匿名的，信息将主要存储在设备上，而不是上传到中央存储库。这激怒了许多官员。他们说，集中化提供了优势。无论如何，硅谷的程序员为什么要否决医学专家和民选官员的决定呢？\n一般来说，政府担心科技巨头不负责任的权力是正确的。不过，在这种情况下，谷歌和苹果的谨慎做法是明智的。在大流行中，实验新的公共卫生应对措施，如大规模监测，应该谨慎行事，以防随后被证明有令人讨厌的副作用。有了高科技软件，谨慎就像药丸和药水一样有价值。。\n深入挖掘：有关冠状病毒大流行的最新报道，请注册我们的每日时事通讯“今日经济学人”，或访问我们的冠状病毒跟踪器和故事中心。\n这篇文章发表在印刷版的领袖栏目，标题为：第一，不伤害；", "note_en": "Editor’s note: The Economist  is making some of its most important coverage of the covid-19 pandemic freely available to readers of The Economist Today , our daily newsletter. To receive it, register  here. For our coronavirus tracker and more coverage, see our  hub\n E  faster in a crisis. Faced with covid-19, vaccine-makers are cutting as many corners as they safely can. Anti-viral drugs are being rushed into clinical trials. Even so, it will be months until anything is available. With 297,000 people recorded dead, the wait is agonising. But caution is crucial. Medicine’s history is full of promising treatments that, when tested, turned out not to work or even to cause harm.\n  Many governments hope salvation can come sooner, with contact-tracing apps on smartphones—even as a row brews over Apple’s and Google’s grip on the technology. These apps can be used to automate the difficult process of tracking down people who have been in contact with those diagnosed with covid-19, which is vital for keeping tabs on the virus. Countries from Bahrain and Bulgaria to Indonesia and Iceland have developed such apps.\n They are an attractive idea. Yet contact-tracing apps are also an untested medical invention that will be introduced without the sort of safeguards that new drugs are subjected to. Inaccurate information can mislead health officials and citizens in ways that can be as harmful as any failed drug. Governments should proceed with care.\n Coverage is one complication. Epidemiologists reckon that apps might be useful if around 60% of people use them. Yet even in Europe, where adoption is highest, only 76% of people have mobile-internet subscriptions. That number is lower among the elderly, the most vulnerable to covid-19. A recent survey suggested less than half of Americans would use a contact-tracing app.\n Accuracy is an issue, too. Such apps are designed to listen out for nearby mobile phones, registering a contact if another device comes close enough. Yet the strength of the radio signals used to do this is affected by all sorts of things besides distance. Human bodies impede transmission, for instance, meaning a phone in a pocket will behave differently from one in a hand.\n That could make it hard to calibrate the system—and a mistake would have consequences. Too sensitive, and you risk a deluge of “false positives”: contacts deemed close and significant that were actually distant and irrelevant. Too forgiving, and genuine cases of viral transmission will go undetected.\n Moreover, the apps themselves might change behaviour. An over-reassuring app could spur people to go out before it is safe. Privacy must be weighed against transparency, for medical reasons as well as for civil liberty. South Korea publishes detailed summaries of cases uncovered by its contact-tracers. A recent jump in cases was linked to a man who visited gay nightclubs. The resulting stream of homophobic invective could deter others from co-operating with the authorities, electronically or otherwise.\n The efforts of some governments, including those of Britain, France and Germany, have been complicated by Apple and Google, which between them hold sway over almost every smartphone on the planet. The firms have made privacy a priority, deeming that users will be anonymous and information stored mostly on devices rather than uploaded to central repositories. That has infuriated many officials. Centralisation offers advantages, they say. And in any case, why should coders in Silicon Valley overrule decisions made by medical experts and elected officials?\n  As a rule, governments are right to worry about the unaccountable power of the tech giants. In this case, though, Google’s and Apple’s cautious approach is sensible. In a pandemic, experimenting with novel public-health responses such as mass surveillance should be done carefully, in case it subsequently turns out to have nasty side-effects. With high-tech software, caution is as valuable as it is with pills and potions.  ■\n Dig deeper: For our latest coverage of the covid-19 pandemic, register for  The Economist Today, our daily  newsletter, or visit our  coronavirus tracker and story hub\n This article appeared in the Leaders section of the print edition under the headline &#34;First, do no harm&#34;", "posttime": "2020-05-16 01:12:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,app,联系人,rely,冠状病毒", "title": "不要依赖联系人跟踪应用程序", "title_en": "Don’t rely on contact-tracing apps", "transed": 1, "url": "https://www.economist.com/leaders/2020/05/16/dont-rely-on-contact-tracing-apps", "via": "", "real_tags": ["程序", "app", "联系人", "rely", "冠状病毒"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002264, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您知道您可以在Makefile中更改shell吗？这是真的。我在尝试通过设置shell来使用bash而不是默认的/bin/sh时发现了这一点。\n.ONESHELL：bash：shell：=bash bash：#注意：需要双美元符号，因为make替换$Variables export greeting=&#34；‘hola&#34；echo&#34；$${greeting}，bash！&#34；\n还有什么是可能的呢？我可以使用其他编程语言作为shell吗？可以在Makefile中编写内联Python吗？\n请注意，正在设置变量.ONESHELL。通常，让willevaluate在单独的shell中计算每个命令的值，这意味着在本例中，问候语将在第二行中未定义。按照姓氏以Davis-*开头的其他人的建议，将.ONESHELL添加到Makefile的顶部，并撰写有关make的博客，会导致make指令中的多行代码在对Python的单个调用中求值。\n将R内联写入Makefile怎么样？请注意添加的.SHELLFLAGS。默认情况下，make运行shell-c&#34；您的\\n脚本，\\n此处&#34；与R不兼容。要从R中的命令内联运行脚本，可以使用-e：\n现在，您可以编写将R和Python语言组合到单个文件🎉中的管道。\n数据分析管道通常具有冒险的用户依赖性。Docker让这一切变得容易得多，但是编写docker run…可能会很麻烦。如果我们可以让Docker也作为解释器和写命令在容器内以内联方式执行，会怎么样？\ndocker：.SHELLFLAGS=run--volume$(Shell Pwd)：/workdir--rm--workdir/workdir--entry point/bin/bash ubuntu-c docker：shell：=docker docker：echo&#34；hello，$$(uname-a)！&#34；\n再说一次，这是可能的。运行make docker将运行ECHO.。在运行Ubuntu的Dockertainer中。请注意--volume标志，它将挂载当前工作目录作为容器的工作目录，这意味着可以在您的本地文件系统和容器的本地文件系统之间读取/创建文件。所以构建构件可以在make指令之间共享。\n您好，Linux 453c728113d6 4.19.76-linuxkit#1 SMP Fri Apr 3 15：53：26 UTC 2020 x86_64 GNU/Linux！\n这是一次实验，目的是看看Make能做些什么。但它的动机是一个现实世界的问题：我经常需要组合跨编程语言和环境的工具来运行数据分析管道。我喜欢把事情自动化，Make是这样做的一个很好的工具。将所有内容内联起来更具可读性，并且将所有内容都放在一个文件中意味着我必须在更少的选项卡之间跳转才能理解管道本身。\n编写在Docker中执行的命令的能力意味着我不必花费更少的时间来弄清楚如何将一堆依赖项安装到单个容器中，这会随着依赖项数量的增加而变得越来越困难(特别是如果你在生物信息学工作的话)。\n注意：其中一些功能只适用于Make 4.+，这是我使用Homebrew安装的。这些示例在使用MacOS Catalina附带的make 3.x时不起作用。\n.ONESHELL：.SILENT：main：\\Python\\ruby\\R\\bash\\docker docker：.SHELLFLAGS=run--rm--entrypoint/bin/bash ubuntu-c docker：shell：=docker docker：echo&#34；hello，$$(uname-a)！&#34；python：shell：=python3 python：greeting=&#34；hello&#34；print(f&#。)ruby：.SHELLFLAGS：=-e ruby：shell：=ruby ruby：greeting=&#34；laba&#34；put&#34；#{greeting}，ruby！&#34；R：.SHELLFLAGS：=-e R：shell：=Rscript R：greeting=&#34；bonjour&#34；message(paste0(greeting，&#34；，R！&#34；))bash：.。*您好&#34；echo&#34；$${greeting}，bash！&#34；", "note_en": "Did you know that you can change the shell in a  Makefile? It’s true. I foundthis out when trying to use bash instead of the default  /bin/sh by setting SHELL.\n .ONESHELL : bash :  SHELL := bash bash :\t # note: the double dollar-sign is required because Make substitues $variables\t export  greeting = &#34;¡hola&#34;\t echo  &#34; $ ${greeting} , bash!&#34;\n  What else is possible? Can I use other programming languages as the shell? Isit possible to write in-line Python in a  Makefile?\n     Notice that there is a variable  .ONESHELL being set. Normally,  make willevaluate each command in a separate shell meaning that, in this example, greeting would be undefined in the second line. Adding  .ONESHELL to the topof your  Makefile, as recommended by  someone else whose last name begins withDavis-* and blogs about  make,causes multi-line code in the Make directive to be evaluated in a single callto Python.\n  What about writing R in-line in a Makefile? Note the addition of  .SHELLFLAGS.By default,  make runs  SHELL -c &#34;your\\nscript\\nhere&#34; which is not compatibleR. To run a script in-line from a command in R, you use  -e:\n   Now you can write a pipeline that combines R and Python in a single file 🎉\n  Data analysis pipelines often have adventurousdependencies. Docker made all of that a lot easier but writing  docker run ...can be cumbersome. What if we could make Docker the interpreter and writecommands to be executed inside the container in-line as well?\n docker :  .SHELLFLAGS = run --volume $(shell pwd):/workdir --rm --workdir /workdir --entrypoint /bin/bash ubuntu -c docker :  SHELL := docker docker :\t echo  &#34;hello,  $$ (uname -a)!&#34;\n Again, this is possible. Running  make docker will run  echo ... in a Dockercontainer running Ubuntu. Note the  --volume flag which will mount the currentworking directory as the container’s working directory meaning that files canbe read/created between your local filesystem and that of the container. Sobuild artifacts can be shared between make directives.\n hello, Linux 453c728113d6 4.19.76-linuxkit #1 SMP Fri Apr 3 15:53:26 UTC 2020 x86_64 x86_64 x86_64 GNU/Linux!\n  This started as an experiment to see what is possible with  make. But it wasmotivated by a real world problem: I often need to combine tools acrossprogramming languages and environments to run data analysis pipelines. I liketo automate things and  make is a great tool for doing so. Having everythingin-line is more readable and having everything in a single file means that Ihave to jump between fewer tabs to understand the pipeline itself.\n The ability to write commands that get executed in Docker means that I have tospend less time figuring out how to get a bunch of dependencies installed in asingle container which becomes increasingly difficult as the number ofdependencies increases (especially if you work in Bioinformatics).\n  note: Some of these features only work on  make 4.+ which I installedusing  Homebrew. These examples do not work using  make 3.xwhich is comes with macOS Catalina.\n .ONESHELL : .SILENT : main : \\ \tpython \\ \truby \\ \tR \\ \tbash \\ \tdocker docker :  .SHELLFLAGS = run --rm --entrypoint /bin/bash ubuntu -c docker :  SHELL := docker docker :\t echo  &#34;hello,  $$ (uname -a)!&#34; python :  SHELL := python3 python :\tgreeting  =  &#34;hello&#34;\tprint (f &#34;{greeting}, python!&#34; ) ruby :  .SHELLFLAGS := -e ruby :  SHELL := ruby ruby :\tgreeting  =  &#34;labas&#34;\tputs  &#34;#{greeting}, ruby!&#34; R :  .SHELLFLAGS := -e R :  SHELL := Rscript R :\tgreeting  =  &#34;bonjour&#34;\tmessage (paste0 (greeting,  &#34;, R!&#34; )) bash :  .SHELLFLAGS := -euo pipefail -c bash :  SHELL := bash bash :\t export  greeting = &#34;¡hola&#34;\t echo  &#34; $ ${greeting} , bash!&#34;", "posttime": "2020-05-16 01:11:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生成,polyglot,shell", "title": "多语言生成文件", "title_en": "Polyglot Makefiles", "transed": 1, "url": "http://agdr.org/2020/05/14/Polyglot-Makefiles.html", "via": "", "real_tags": ["生成", "polyglot", "shell"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002263, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "處理這個邀請時發生問題，我們正盡快修復.", "note_en": "處理這個邀請時發生問題，我們正盡快修復。", "posttime": "2020-05-16 01:11:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "语音,efficient,發生", "title": "部署在CPU上的高效实时文本语音转换系统", "title_en": "A highly efficient, real-time text-to-speech system deployed on CPUs", "transed": 1, "url": "https://ai.facebook.com/blog/a-highly-efficient-real-time-text-to-speech-system-deployed-on-cpus/", "via": "", "real_tags": ["语音", "efficient", "發生"]}, {"category": "", "categoryclass": "", "imagename": "d435bb146262405ab20396b9bba1db4c.png", "infoid": 1002262, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年可能是“桌面Linux”的一年，国内有如此多的工程师希望为开源项目做出贡献。\n让我们先来看看目前前四个发行版的桌面碎片有多深：\n根据上面的列表，我们有四个发行版和十几种桌面环境的总体风格！\n开发人员资源的碎片化是这个问题的核心，这些资源已经受到限制，并依赖于核心工作之外的奉献精神。来自单一实体的整合、重点和方向可以真正以桌面Linux的质量和精致推动发展。\n要让团队发挥作用，开发人员需要感觉自己是英雄。他们想要和用户一样的东西，他们是用户，他们从一开始就是“唯一”的用户。在某个阶段，他们决定参与进来，并开始投入时间、精力和情感来改进我们的项目。他们最需要的是支持和幸福。他们需要反馈和信息来理解错误或功能请求，当他们完成实现时，他们需要感觉到自己是英雄，他们确实是这样做的，这是他们真正在这里的部分原因。\n我可以向他们展示上个月有500人捐款，我可以转发电子邮件给团队，人们告诉我他们有多喜欢Linux Mint，我可以告诉他们他们正在发挥作用，但没有什么比直接与快乐的用户互动，看到第一手的人对你的工作感到高兴更好的了。我们的社区如何与我们的开发人员互动，对于他们的工作、他们的快乐和他们的动力来说都是关键。-克莱门特·勒菲博尔(Clement Lefebvre)，Linux铸币项目负责人。\nFlatpak已经开始向应用程序的单一分发机制这个方向迈进，但有人可能会说，这是碎片化的双重产物。\n在Chromebook和虚拟化/Web应用的世界里，定制和多种口味的需求正在减少-我们很好地保持了浏览器的平稳运行。", "note_en": "This could be the year for “Desktop Linux” with so many engineers at home looking to  contribute to open source projects.\n  Let’s start by looking at how deep the desktop fragmentation goes with  just the  top four distributions at this time:\n  Given the list above we have a four distributions and more than a dozen total flavours of a desktop environment!\n The fragmentation of developer resources which are already  constrained and rely on dedication outside of their core employment is central to this issue. Consolidation, focus and direction from a single entity  could really move the needle with the quality and polish of desktop linux.\n For a team to work, developers need to feel like heroes. They want the same things as users, they are users, they were “only” users to start with. At some stage they decide to get involved and they start investing time, efforts and emotions into improving our project. What they’re looking for the most is support and happiness. They need feedback and information to understand bugs or feature requests and when they’re done implementing something, they need to feel like heroes, they literally do, that’s part of the reason they’re here really.\n I can show them 500 people donated money last month, I can forward emails to the team where people tell me how much they love Linux Mint, I can tell them they’re making a difference but there’s nothing like interacting directly with a happy user, seeing first-hand somebody be delighted with what you worked on. How our community interacts with our developers is key, to their work, to their happiness and to their motivation. — Clement Lefebvre, leader of the Linux Mint project.\n Flatpak have started the initiative to move in this direction of single distribution mechanism for apps, but one could argue this is a biproduct of fragmentation.\n In a world of Chromebooks and virtualized/web apps, the need for customization and multiple flavours is dwindling — we are good with the browser running smoothly.", "posttime": "2020-05-16 01:10:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,桌面", "title": "桌面Linux-单个发行版的情况", "title_en": "Desktop Linux – The Case for a Single Distro", "transed": 1, "url": "https://medium.com/@robsandhu/desktop-linux-the-case-for-a-single-distro-2dac8b2b8c8e", "via": "", "real_tags": ["linux", "桌面"]}]