[{"category": "", "categoryclass": "", "imagename": "1b50e3f80d4a6b587913efaa702b7a13.png", "infoid": 1008043, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "目前对大流行的政策反应可能不足以防止驱逐激增。CARE法案的刺激付款和失业保险-当可以获得时-将为家庭提供一些支持，但在许多情况下不足以维持收支平衡。一些州已经通过了临时暂停驱逐令，驱逐实验室正在新冠肺炎住房政策记分卡中跟踪，全国各地都出台了额外的措施。然而，一旦这些措施到期，数百万租户将欠下大量的欠租。对许多人来说，公共卫生危机之后将出现流离失所和驱逐危机。\n目前没有数据基础设施可以让政策制定者、法律和倡导组织、记者、学者和社区成员实时跟踪流离失所和驱逐情况。驱逐实验室建立了驱逐跟踪系统(ETS)，以填补这一关键空白，并在驱逐热点出现时帮助监测和应对。ETS被设计为一个多站点、开源和可扩展的系统，用于在驱逐申请发生时进行跟踪。\n我们欢迎反馈，并欢迎与希望与我们合作监测和应对新出现的驱逐热点的州和地方建立伙伴关系。确保住房安全，对于缓解新冠肺炎的传播，维护健康、经济安全和家庭稳定至关重要。", "note_en": "Current policy responses to the pandemic may be insufficient to prevent a surge in evictions. CARES Act stimulus payments and unemployment insurance–when accessible–will provide families with some support, but in many cases not enough to make ends meet. Some states have passed temporary eviction moratoria, which the Eviction Lab is tracking in the COVID-19 Housing Policy Scorecard, and localities across the country have introduced additional measures. Once these measures expire, however, millions of renters will owe significant amounts of back rent. For many, a displacement and eviction crisis will follow the public health crisis.\n There is currently no data infrastructure that allows policymakers, legal and advocacy organizations, journalists, academics, and community members to track displacement and evictions in real time. The Eviction Lab has built the Eviction Tracking System (ETS) to fill this critical gap and to help monitor and respond to eviction hotspots as they emerge. The ETS is designed as a multi-site, open-source, and expandable system for tracking eviction filings as they happen.\n We welcome feedback, as well as partnerships with states and localities who wish to work with us in monitoring and responding to emerging eviction hotspots. Ensuring housing security is vital to mitigating the spread of COVID-19 and sustaining health, economic security, and family stability.", "posttime": "2020-06-25 08:30:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,驱逐,eviction", "title": "驱逐跟踪系统：监测美国驱逐案件的数量", "title_en": "The Eviction Tracking System: Monitor the number of U.S. eviction cases", "transed": 1, "url": "https://evictionlab.org/eviction-tracking/", "via": "", "real_tags": ["美国", "驱逐", "eviction"]}, {"category": "", "categoryclass": "", "imagename": "74bf44ec3c0290ed4cc26e2ece926443.jpg", "infoid": 1008042, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊宣布将成立一个新的假冒犯罪小组，这是这家在线零售商在其网站上打击假冒产品的最新努力。据说，新团队由“前联邦检察官、经验丰富的调查人员和数据分析师”组成，他们将致力于主动“发起攻势”打击造假者，而不是仅仅通过试图识别和阻止不良上市来做出反应。\n据亚马逊称，新成立的假冒犯罪部门将使该公司更容易提起民事诉讼，帮助品牌进行自己的调查，并与执法官员合作打击假冒。\n对于这家在线零售商来说，假冒产品是一个大问题，特别是来自试图欺骗客户购买假冒产品的第三方卖家。耐克最近停止了通过亚马逊直接销售产品，理由是无照和冒名顶替的卖家是一个促成因素。即使是亚马逊自己的产品和品牌也不能幸免。\n这个问题已经到了特朗普政府最近将亚马逊的五个外国网站列入白宫年度“臭名昭著的市场”名单的地步。当时，亚马逊声称它之所以成为攻击目标，是因为唐纳德·特朗普总统与亚马逊首席执行官杰夫·贝佐斯之间的“个人恩怨”，贝佐斯对“华盛顿邮报”(The Washington Post)的(单独)所有权导致了两人之间的长期不和。\n值得称赞的是，亚马逊指出，它在2019年花费了超过5亿美元来打击欺诈、滥用和假冒产品，有8000名员工在这些努力中工作。该公司还报告称，在2019年可以进行任何销售之前，屏蔽了250万个疑似不良演员账户，并在去年关闭了60亿个疑似不良上市公司。", "note_en": "Amazon has announced that it’s launching a new Counterfeit Crimes Unit as the latest effort by the online retailer to fight counterfeit products on its website. The new team is said to be made up of “former federal prosecutors, experienced investigators, and data analysts,” who will work to proactively “go on the offensive” against counterfeiters, instead of just reacting by trying to identify and block bad listings.\n According to Amazon, the new Counterfeit Crimes Unit will make it easier for the company to file civil lawsuits, aid brands in their own investigations, and work with law enforcement officials in fighting counterfeiters.\n Counterfeit products are a big issue for the online retailer, especially from third-party sellers that try to dupe customers into buying fake knockoffs.  Nike recently stopped selling direct products through Amazon, citing unlicensed and imposter sellers as a contributing factor. Even  Amazon’s own products and brands aren’t immune.\n  The problem has gotten to the point where the Trump administration  recently placed five of Amazon’s foreign websites on the White House’s  annual “notorious markets” list. At the time, Amazon claimed that it was being targeted due to a “personal vendetta” that President Donald Trump has with Amazon CEO Jeff Bezos, whose (separate) ownership of  The Washington Post has led to a  long-running feud between the two.\n To its credit, Amazon notes that it spent over $500 million in 2019 to fight fraud, abuse, and counterfeit products, with 8,000 employees working on those efforts. The company also reports blocking 2.5 million suspected bad actor accounts in 2019 before any sales could be made and shutting down 6 billion suspected bad listings last year.", "posttime": "2020-06-25 08:12:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,假冒,launches", "title": "亚马逊推出假冒犯罪小组打击其商店上的仿冒品", "title_en": "Amazon Launches Counterfeit Crimes Unit To Fight Knockoffs On Its Store", "transed": 1, "url": "https://www.theverge.com/2020/6/24/21302114/amazon-counterfeit-crimes-unit-knockoffs-store-online-investigators", "via": "", "real_tags": ["amazon", "亚马逊", "假冒", "launches"]}, {"category": "", "categoryclass": "", "imagename": "7cf484ceeae6bc7fc2161eddc603cd15.jpg", "infoid": 1008041, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "想象一下一个干净的鞋柜，所有的鞋子都是按颜色配对和分类的。壁橱的熵是它的鞋子可以有的排列总数。干净壁橱的熵相对较小。可能会有几双灰色或蓝色的鞋子可以调换，但这并不会增加太多的复杂性。在熵较低的壁橱中，根据需要可以很容易地从壁橱中添加或移除鞋子。\n现在想象一下一个凌乱的鞋柜。没有一双鞋是成对的，它们都缠在一大堆里。这些鞋子可以有几种可能的组合？你可以试着拿出你想要的那双，很快就知道了。凌乱的鞋柜比干净的鞋柜熵大得多。\n简而言之，我们通过计算系统可能处于的状态数来测量熵。更多的状态意味着更多的熵。\n在软件中，我们的构建块非常简单，我们可以用一种粗略的方式来测量熵。以此模型为例：\n看起来很简单，这个型号就像我们凌乱的鞋柜。这个模型有很多错误的地方，而不是正确的地方。我们可以通过将它与一个有组织的鞋柜进行比较来看出这一点：\n当`createdAt`是任意字符串时，它可以像有效值“06-23-2020”一样容易地接受无效值“foo”和“bar”。该字段可以处于更多可能的状态，其中大多数都是无效的。这种宽泛数据类型的选择使我们的模型变得混乱。这种不想要的混乱会导致误解、错误和浪费能量。\n当每个模型都强类型化为一组严格的值时，这种混乱就会最小化。DateTime、UserID和Price的类型化使得所有可能的值都是有效的。因此，这些类型更可预测，更易于操作，并且在实践中不会带来太多意外。\n就像在生活中一样，熵也不全是坏事--有些是可取的，有些是不可取的。在软件中，我们在一定程度上需要熵：我们的代码很有价值，因为它支持各种可能的日期、用户和价格。但是，当这种混乱发展到超出它所增加的价值时，我们的软件就会变得使用起来很痛苦，维护起来也很痛苦。\n只有几种可能状态的构造是简单的。布尔值和枚举比字符串简单得多。一个移动件的系统比多个移动件的系统简单得多。\n有时，我们的问题本质上是复杂的。在这些情况下，我们的解决方案需要一些基本的复杂性来匹配。但是，什么时候基本的复杂性变得不必要了呢？在这些情况下，我们可以使用另一个规则：\n如果总共有数千种可能的状态，但只有两种状态是有效的：这是一个混乱的解决方案。这方面的一个简单示例是将布尔值表示为字符串。\n这段代码出错的原因有很多，不仅是在执行过程中，在解释过程中也是如此。保持解决方案的整洁可以提高正确性、可读性和可维护性。在我看来，这是衡量“质量”的主要标准之一。\n有没有什么方法可以通过削减总的可能状态数来使解决方案变得更简单？\n有没有办法通过削减无效可能状态的数量来使解决方案变得更干净呢？\n这个概念的强大之处在于它可以在抽象的阶梯上平滑地上下伸缩。它适用于基本数据类型，就像它适用于解决方案体系结构和产品开发一样。\n我们的解决方案需要多少个移动部件？当一个难以想象的需求飞来，试图将我们的解决方案打倒在地时，还能剩下多少块呢？当意外输入到达时，无效状态是会在整个系统中传播，还是一看到就会被包含和消除？简而言之，我们的解决方案有多干净？\n为了使生活成为可能，我们通过创建支持不同人群及其用例的复杂系统来利用混沌。为了让生活变得可预测，我们通过尽可能保持这些系统的清洁和有序来对抗不受欢迎的混乱。\n在软件领域，我们所处的世界是可以衡量混乱的，可以实现清洁的。我们只需要一组正确的信号和反应来实现这一点。", "note_en": "Imagine a clean shoe closet, where all shoes are paired and sorted by color. The closet’s entropy is the total number of arrangements its shoes can have. A clean closet’s entropy is relatively small. There may be a few pairs of grey or blue shoes that can be switched around – but this doesn’t add much complexity. In a closet with low entropy, it’s easy to add or remove shoes from that closet as needed.\n Now imagine a messy shoe closet. None of the shoes are paired, and they’re all tangled in a big pile. How many possible combinations can these shoes be in? You can quickly find out by trying to pull out the pair you want. The messy shoe closet has a much greater entropy than the clean one.\n In short, we measure entropy by counting the number of possible states a system can be in. More states mean more entropy.\n  In software, our building blocks are simple enough for us to measure entropy in a crude way. Take this model for example:\n  As simple as it seems, this model is like our messy shoe closet. There are many more ways for this model to be wrong than there are for it to be right. We can see that by comparing it to an organized shoe closet:\n  When `createdAt` was an arbitrary string, it could take on invalid values “foo” and “bar” just as easily as a valid value “06-23-2020”. There are many more possible states that the field can be in, and most of them are invalid. This choice of a broad data type allows chaos into our model. This unwanted chaos leads to misunderstandings, bugs, and wasted energy.\n When each model is strongly typed to a strict set of values, this chaos is minimized. DateTime, UserId, and Price are typed such that all possible values are valid. Accordingly, these types are more predictable, easier to manipulate, and lead to less surprises in practice.\n As in life, entropy is not all bad – some of it is desirable and some of it is not. In software, we need entropy to a certain extent: our code is valuable  because it supports a variety of possible dates, users, and prices. But when this chaos grows beyond the value it adds, our software becomes painful to use and painful to maintain.\n    A construct with only a few possible states is simple. Booleans and enums are much simpler than strings. A system with one moving piece is much simpler than a system with many moving pieces.\n Sometimes, our problems are essentially complex. In these cases, our solutions need some essential complexity to match. But how when does essential complexity become unnecessary? In these cases, we can use another rule:\n  If there are thousands of total possible states, but only two of them are valid: it’s a messy solution. A simple example of this is representing a boolean value as a string.\n  There are many ways for this code to go wrong; not just in execution but also in interpretation. Keeping our solutions clean improves correctness, readability, and maintainability. It’s one of the primary measures of “quality” in my view.\n   Is there any way to make the solution simpler, by trimming the number of  total possible states?\n Is there any way to make the solution cleaner, by trimming the number of  invalid possible states?\n The power of this concept is that it smoothly scales up and down the ladder of abstraction. It applies to basic data types just as well as it does to solution architecture and product development.\n How many moving pieces does our solution need? When an unimaginable requirement flies in and tries to blow our solution to the ground, how many pieces can be left standing? When an unexpected input arrives, do invalid states propagate across the system, or are they contained and eliminated on sight? In short, how clean is our solution?\n To make life possible, we utilize chaos by creating complex systems that support a diversity of people and their use cases. To make life predictable, we combat undesirable chaos by keeping those systems as clean and orderly as possible.\n In software, we work in a world where chaos is measurable and cleanliness is achievable. We just need the right set of signals and responses to make it happen.", "posttime": "2020-06-25 08:11:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,software,可能", "title": "软件熵", "title_en": "Software Entropy", "transed": 1, "url": "https://camhashemi.com/2020/06/23/software-entropy/", "via": "", "real_tags": ["软件", "software", "可能"]}, {"category": "", "categoryclass": "", "imagename": "01402a5d8fb4da5560e6d1dba43252a6.jpg", "infoid": 1008039, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国国家公路交通安全管理局(NHTSA)在过去13个月收到11起关于该问题的投诉后，对老式特斯拉Model S汽车的触摸屏故障展开了调查。\n问题出在特斯拉在2012至2015款Model S车型中使用的NVIDIA Tegra 3处理器中的8 GB eMMC NAND闪存芯片。据美国国家公路交通安全管理局(NHTSA)称，该芯片很容易磨损，正如Motherboard去年10月首次报道的那样，这可能会导致“失去触摸屏提供的音频和视觉功能，如信息娱乐、导航和网页浏览”。该机构还指出，这一芯片故障将使其无法使用备用摄像机视图。\n调查的范围是NHTSA所称的“初步评估”，调查人员将试图确定问题发生的频率以及是否对业主造成了任何伤害。该机构表示，它覆盖了约6.3万辆汽车，但它承认，2012年至2018年版的Model S和2016至2018年版的Model X也使用了相同的芯片，约占15.9万辆。特斯拉没有回复记者的置评请求。\n该机构目前还有另外两项针对特斯拉的此类调查正在进行中。其中一个于去年10月开放，内容是特斯拉发布的空中软件更新，旨在限制该公司汽车电池组可能存在的火灾风险。另一家于1月份开业，正在调查有关特斯拉车辆发生“突然意外加速”的指控。\n特斯拉率先提出了在Model S的汽车仪表盘上放置大型触摸屏的想法，这一设计选择在过去十年里在整个汽车行业激增。但这并不是特斯拉在触摸屏上遇到的唯一问题，多年来，这些触摸屏都是从电脑供应商那里采购的，没有达到典型的汽车等级标准。正如Ed Niedermeyer在“荒唐：特斯拉汽车的原汁原味的故事”中所写的那样，老式S型车的屏幕在暴露在高温下时，容易在边缘冒泡。特斯拉在生产中解决了这一问题，导致在暴露在高温下后出现黄色条纹。直到该公司改用全新的触摸屏，问题才平息下来。", "note_en": "The National Highway Traffic Safety Administration (NHTSA) has  launched an investigation into touchscreen failures on older Tesla Model S vehicles, after receiving 11 complaints in the last 13 months about the issue.\n The problem is with the 8GB eMMC NAND flash memory chip in the NVIDIA Tegra 3 processor that Tesla used in the 2012 to 2015 versions of the Model S vehicles. That chip was prone to wearing out,  as  Motherboard first reported last October, which could cause the “loss of audible and visual features provided by the touchscreen, such as infotainment, navigation, and web browsing,” according to the NHTSA. The agency also points out that this chip failure would make it impossible to use the backup camera view.\n  The scope of the probe is what the NHTSA refers to as a “preliminary evaluation,” where the investigators will try to determine how often the problem occurred as well as whether it caused any harm to owners. The agency says it covers about 63,000 cars, though it acknowledges that the same chip was used in the 2012 to 2018 versions of the Model S and the 2016 to 2018 versions of the Model X, accounting for around 159,000 vehicles. Tesla did not respond to a request for comment.\n The agency currently has two other such investigations open into Tesla. One,  opened last October, is about an over-the-air software update Tesla issued that was meant to limit a possible fire risk in the battery packs of the company’s cars. The other, opened in January, is looking into claims of Tesla’s vehicles undergoing “ sudden unintended acceleration.”\n Tesla pioneered the idea of placing large touchscreens in a car’s dashboard with the Model S, a design choice that has proliferated across the automotive industry over the last decade. But this is not the only problem that Tesla has run into with its touchscreens, which, for years, were sourced from computer suppliers and did not stand up to  typical automotive grade standards. As Ed Niedermeyer writes in  Ludicrous: The Unvarnished Story of Tesla Motors, the screens in older Model S vehicles were prone to bubbling at the edges when exposed to high heat. Tesla’s solve for this in production resulted in yellow banding after exposure to high heat. It wasn’t until the company switched to an entirely new touchscreen that the problems subsided.", "posttime": "2020-06-25 07:33:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "故障,touchscreen,汽车", "title": "S型触摸屏故障促使NHTSA调查", "title_en": "Model S Touchscreen Failures Prompts NHTSA Investigation", "transed": 1, "url": "https://www.theverge.com/2020/6/24/21301676/tesla-nhtsa-touchscreen-failure-investigation-model-s", "via": "", "real_tags": ["故障", "汽车"]}, {"category": "", "categoryclass": "", "imagename": "9bd0fec20f8811b919de8785297a606e.jpg", "infoid": 1008038, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我估计在过去的三年里，我总共节省了大约2920个小时的时间，否则这些时间就会被用来无意识地滚动浏览大多数乏味的内容。\n我注意到Facebook基本上只是一个高度过滤的内容流。每个人的快乐想法和生命中的高潮时刻，以一种经过算法策划的形式传递给我。\n我也是问题的一部分。我会发布我引以为豪的事情，或者我生活中的快乐时刻。很少有别的东西。\nFacebook在很大程度上只是一个了解人们生活的狭隘的小窗口。\n我们看到了自己生活的全貌，但最终却把我们所拥有的与他人生活中的这一小块“快乐”滑块进行了比较。\n对于那些没有注意到这种不公平比较的人来说，它可能会导致嫉妒、愤怒甚至沮丧的时刻。\n也不要忘记Facebook上发布的假新闻、议程和其他胡言乱语。每天翻阅这类东西会让人麻木，导致人变得自满，甚至可能完全被误导。\n人们只需看看整个国家是如何被发布在社交媒体平台上的谎言分裂和左右的，就会知道它们的毒性有多大。\n毒药在这些平台上蔓延得又广又深。造成严重破坏的不良行为者很多，从国家资助的，到犯罪分子和诈骗艺术家。他们都有要宣传的议程，或要实现的邪恶目标。\n每次注册任何类型的“免费”账户时，你都要问自己的第一个问题是“为什么这是免费的？”\n一个免费的产品，并不是真正的免费。总会有圈套的。在Facebook的情况下，你是用你自己的数据支付的。\n你自己的私生活、细节、习惯、信息等都会在后台被收集起来，用来为Facebook赚钱。他们卖你的数据，你用你的隐私付钱。\n正如我在这篇文章的开头提到的，删除Facebook的冲动大约在3年前就开始了。我花了一年的时间考虑这件事，然后才投身其中。\n我将我所有的数据导出为.zip文件，并将其上传到某个加密的云存储中进行安全保管。\n然后我登录，进入我的账户设置，要求删除我的账户和数据。\nFacebook会让你的账户处于“待删除”状态。他们说，如果你在下周左右再次登录，它将自动重新启用。这是一种偷偷摸摸的尝试，目的是抓住那些习惯于每天使用Facebook的人。\n我很勤奋，大约一周后，我的账号就被永久删除了。可算摆脱了。\n接下来是Instagram。当然，Facebook拥有一系列产品，Instagram就是其中之一。我的Instagram账户从该产品首次发布时就已经开通并运行，不是Facebook小组的一部分，但现在它属于Facebook，它也必须删除。\nInstagram是最容易删除的一个，我在这个平台上并没有真正的互动，只是在我的账户上保留了一堆有趣的照片。在罕见的情况下，我会浏览别人发布的照片，仅此而已。\n这个账户从我的生活中被清除了，几乎没有大惊小怪，也没有什么顾虑。在接下来的几年里积累更多的时间，让我可以用来做更有用的事情！\nWhatsApp徘徊了很长一段时间。这个更难处理。我在WhatsApp上有我的家人联系人和很多朋友，它已经成为我主要的消息平台。\n到目前为止，Telegram是一款远远优于WhatsApp的产品。我不相信它是完美的，(嘿，它也是免费的)。但至少它没有掌握在Facebook这样的大型实体手中。减少垄断企业的权力是一件好事。\n大约9个月前，我给我的大多数WhatsApp联系人发了一条消息，告诉他们我要删除我的账户，并告诉他们如果他们加入Telegram，在Telegram上哪里可以找到我。\nTelegram提供更高级的群聊选项、更多聊天功能、机器人等等。作为WhatsApp的替代品，我一直非常满意。\n生活中没有了这三款应用，我真的感觉更开心了。Facebook是一个时间沉没，在那里我浪费了本可以更好地直接与家人和朋友互动，或者从事业余爱好的时间。\nInstagram不是太大的问题，但我的数据被出售的问题(和其他人一样)。\nWhatsApp在消息传递方面很有用，但Telegram取代了它，给了我更多有用的功能。\n知道我来自WhatsApp的数据不再出售，我感到更高兴了，尽管它当然只是海量数据中的一个小插曲。\n我估计在过去的三年里，我总共节省了大约2920个小时的时间，否则这些时间就会被用来无意识地滚动浏览大多数乏味的内容。仅仅是因为我删除了我的Facebook、WhatsApp和Instagram账户。\n这是我生命中的121天，我已经可以用来做更好的事情了。\n这就是我如何删除我的Facebook、WhatsApp和Instagram账户的故事。\n我鼓励每一个阅读这篇文章的人冒一次险，尽可能地删除你的社交媒体账户。无论是为了节省你生活中的时间，还是停止允许你的私人数据被出售，你都会为此感到高兴。", "note_en": "I estimate that over the last 3 years, I’ve collectively  saved around 2920 hours of time that would have otherwise been spent mindless scrolling through mostly uninteresting content.\n   I had noticed how Facebook was mostly just a highly filtered stream of content. Everyone’s happy thoughts and high moments in life, delivered to me in an algorithmically curated form.\n I was part of the problem too. I posted things I was proud of, or the happy moments in my life. Very rarely anything else.\n Facebook is for the most part, just a small, narrowly defined window into people’s lives.\n We see the full picture of our own lives, but end up comparing what we have to this small, ‘happy’ slither of other people’s lives.\n For those who don’t notice this unfair comparison, it can lead to moments of envy, anger, or even depression.\n Don’t forget about the fake news, agendas, and other drivel that is posted around Facebook either. Scrolling through this kind of stuff on a daily basis will numb the mind and lead to one becoming complacant and perhaps even completely mislead.\n One only has to look at how entire countries have been divided and swayed by lies posted to social media platforms to see how poisonous they can be.\n The poison runs broad and deep on these platforms. There are many bad actors that wreak havoc, from state sponsored, to criminals and scam artists. They all have agendas to propagate, or nefarious goals to accomplish.\n  The number one question to ask yourself whenever signing up for a ‘free’ account of any type is “ Why is this free?“\n A free product, is  not really free. There is always a catch. In the case of Facebook, you are paying with your own data.\n Your own private life, details, habits, information and more is being collected in the background and used to make money for Facebook. They sell your data, and you pay with your privacy.\n  As I mentioned at the start of this post, the urge to delete Facebook began around 3 years ago. It took me year of thinking about it before I took the plunge.\n I exported all of my data as a .zip file, and uploaded it to some encrypted cloud storage for safe keeping.\n Then I logged in, went to my account settings and requested that my account and data be deleted.\n Facebook leaves your account in a ‘to be deleted’ state. They say that if you login again in the next week or so, it’ll automatically be re-enabled. This is a sneaky attempt at catching people out who have a habit of using Facebook on a daily basis.\n I was diligent, and after a week or so my account was permanently deleted. Good riddance.\n  Next up was  Instagram. Facebook owns a bunch of products of course, Instagram being one of them. My Instagram account had been up and running from when the product had first launched, and was not a part of the Facebook group, but now that it was owned by Facebook, it had to go too.\n  Instagram was the easy one to delete, I didn’t really interact on the platform, and had just kept a bunch of interesting photos on my account. On a rare occasion I would browse through photos that others posted and that was about it.\n The account was purged from my life with little fuss or care. More time cumulated over years to come for me to use on more  useful endeavours!\n  WhatsApp hung around for a long time. This one was more difficult to get rid of. I had my family contacts and many friends on WhatsApp, and it had become my primary messaging platform.\n  Telegram is by far a superior product to WhatsApp. I’m not convinced it’s perfect, (hey it’s free too). But at least it’s not in the hands of a massive entity like Facebook. Less power to monopolies is a good thing.\n About 9 months or so ago, I sent out a message to most of my WhatsApp contacts telling them I was deleting my account and telling them where to find me on Telegram if they joined there.\n  Telegram offers far superior group chat options, more chat features, bots, and more. I’ve been very happy with it as a replacement for WhatsApp.\n  I really feel happier without these three apps in my life. Facebook was a time sink, where I wasted time that could have been better used directly interacting with family and friends, or working on hobbies.\n Instagram wasn’t too much of an issue, but there was (as with the others) the problem with my data being sold off.\n WhatsApp was useful for messaging, but Telegram replaced that and gave me way more useful features.\n I feel happier knowing that my data from WhatsApp is no longer up for sale, even though it was of course just a blip in a massive ocean of data.\n I estimate that over the last 3 years, I’ve collectively  saved around 2920 hours of time that would have otherwise been spent mindless scrolling through mostly uninteresting content. Simply as a result of me having deleted my Facebook, WhatsApp and Instagram accounts.\n That’s 121 days of my life I have had available to use on better things already.\n So that is the story of how I deleted my Facebook, WhatsApp, and Instagram accounts.\n I encourage everyone reading this to take the plunge and delete your social media accounts wherever possible. Whether it be to save time in your lives, or to stop allowing your private data to be sold, you’ll be happier for it.", "posttime": "2020-06-25 07:32:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook", "title": "我删除了我的Facebook，WhatsApp和Instagram账户，感觉很棒，因为", "title_en": "I deleted my Facebook, WhatsApp, and Instagram accounts, and felt great since", "transed": 1, "url": "https://www.shogan.co.uk/life/how-i-deleted-my-facebook-whatsapp-and-instagram-accounts-and-felt-great-since/", "via": "", "real_tags": ["facebook"]}, {"category": "", "categoryclass": "", "imagename": "6c0dfb3f64c522e53fc4abf175baa933.jpg", "infoid": 1008037, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "了解采用苹果硅的Mac将如何使用苹果的系统芯片(SoC)架构提供现代优势。利用用于CPU和GPU任务的统一内存架构，Mac应用程序将从苹果硅调优框架(如Metal和Accelerate)中获得惊人的性能优势。了解引导和安全方面的新功能和更改，以及这些功能和更改可能如何影响您的应用程序。", "note_en": "Discover how Macs with Apple Silicon will deliver modern advantages using Apple&#39;s System-on-Chip (SoC) architecture. Leveraging a unified memory architecture for CPU and GPU tasks, Mac apps will see amazing performance benefits from Apple Silicon tuned frameworks such as Metal and Accelerate. Learn about new features and changes coming to boot and security, and how these may affect your applications.", "posttime": "2020-06-25 07:31:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,silicon,architecture,苹果", "title": "Apple Silicon Mac的新系统架构[视频]", "title_en": "The new system architecture of Apple Silicon Macs [video]", "transed": 1, "url": "https://developer.apple.com/videos/play/wwdc2020/10686/", "via": "", "real_tags": ["apple", "silicon", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "47770183d17df5945dc55c3f3bfd300b.jpg", "infoid": 1008036, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "反对警方不受监管地使用面部识别的运动正在加速，这加剧了许多道德问题。\n最近发生的种族歧视和警察暴行的抗议活动导致IBM停止开发面部识别技术，微软和亚马逊暂停向执法部门出售面部识别技术。\n虽然这是一个很好的起点，但由于公司不仅承认并解决了人脸识别系统中的已知缺陷和偏见，仍有很多工作要做。\n特别是，需要来自公众的持续压力，以确保未来人脸识别技术的道德发展和监管。\n在6月8日致国会议员的一封信中，IBM宣布反对包括面部识别在内的能够实现监控的技术。微软和亚马逊在面部识别方面也纷纷效仿，分别禁止警察使用，并暂停使用一年。其他公司，如Clearview AI，仍向警察部门提供这项技术。正如“华盛顿邮报”报道的那样，IBM决定放弃面部识别技术之前，已经进行了多年的辩论，特别是对2018年一项名为“性别阴影”的研究的回应，该研究发现，行业面部识别系统在深色皮肤的面孔上的错误率要高得多。\n包括算法正义联盟(Algorithic Justice League)和美国公民自由联盟(ACLU)在内的民权和司法团体对IBM和亚马逊的这些行动表示赞赏：\n算法正义联盟称赞这一决定是朝着促进公平和负责任的人工智能的公司方责任迈出的第一步。\n亚马逊花了两年时间才走到这一步，但我们很高兴该公司终于认识到人脸识别对黑人和布朗社区以及更广泛的民权构成的危险。\n面部识别技术能够从数字图像或视频帧中识别出一个人，几十年来一直在开发中。随着过去十年深度学习的重大进展，面部识别也取得了实质性进展。现代人工智能人脸识别系统依赖于大数据集的人脸有两个目的：1)训练可以提取人脸关键特征的神经网络，2)使用这些特征找到长相相似的人脸。收集如此庞大的数据集存在多重隐私和伦理问题，从导致有偏见的预测的有偏见的数据，到如何在没有征得同意的情况下收集这些数据，不一而足。\n最近关于人脸识别的争议特别集中在执法部门的使用上。目前没有联邦法律，也几乎没有地方法律来规范警察和其他政府机构如何以及何时可以使用这种技术。这是尽管商业服务已经存在多年，并被一些警察部门使用。当这些有缺陷的系统被执法部门应用时，由于错误率较高，它们可能会使有色人种面临更高的风险。即使这些系统工作得很完美，它们仍然可以“很容易地被武器化，以对付社区来骚扰他们”。\nVox指出，这样的大公司关于面部识别的公开声明是向前迈出的一步，但也有人担心，像Clearview AI这样的较小公司可能会介入取代他们的位置。一些人也对科技公司最近的举动持怀疑态度，称其为公关噱头：\n“为未来而战”(Fight For The Future)的副主任埃文·格里尔(Evan Greer)称亚马逊的声明是“一场公关噱头”。总部设在纽约的反监视法律组织“监视技术监督项目”称该公司的举动“太少、太迟”。它的负责人阿尔伯特·福克斯·卡恩(Albert Fox Cahn)在一份电子邮件声明中补充说，“亚马逊不应该只是在一年或十年内结束这种做法，它应该永远结束这种做法。”\n福布斯报道，随着谴责和暂停，不同种类的技术之间有了足够的融合，人们不太确定到底放弃了什么。尽管如此，公众对人脸识别系统的关注是一个很好的起点，以确保这项技术在未来的伦理发展。\n然后，这应该得到一套强有力的原则和道德标准的支持，该行业可以遵循这些原则和道德标准。其结果可能会为人工智能奠定更坚实的基础。\n《连线》还认为，面部识别远未走到尽头，它同意Vox的观点，即许多规模较小的公司仍在填补这一空白-这些公司生产的技术，与最初导致IBM等人遭遇反弹的致命缺陷一样，都是致命缺陷的牺牲品。\n一些人，如Jathan Sadowski(莫纳什大学新兴技术实验室的研究员)，认为抵制面部识别的“胜利”仅仅是象征性的，是一个更加努力的机会。\n是的，我认为这与其说是赢得一场战斗，不如说是一个继续进攻、更加努力地推进、真正取得真正和持久胜利的机会。我们都进行了如此艰苦的战斗，只是为了获得足够的阵地进行反击。我终于开始觉得自己站稳了脚跟。\n-Jathan Sadowski(@jathansadowski)2020年6月10日。\n阿尔伯特·福克斯·卡恩将这一举措描述为一个里程碑，但“就像听到纵火犯同意停止向森林大火浇注汽油，却没有采取太多措施扑灭大火一样。”\n我同意这是一个巨大的里程碑，但感觉就像听到一个纵火犯同意停止向森林大火浇注汽油，而没有采取太多措施扑灭大火，我希望许多人认为这是一个迹象，表明通过更多的压力可以取得更大的成就。\n-阿尔伯特·福克斯·卡恩🔯(@foxcahn)2020年6月10日。\n无论如何，这些举措，即使是亚马逊的一年禁令，也被视为朝着正确方向迈出的一步。\n这简直令人难以置信！不间断的行动+时机=亚马逊终于让步了，并朝着正确的方向迈出了一步：对警方使用其面部识别技术Rekognition实施为期一年的暂停！邮箱：h/t@brendakleong https://t.co/W5fWEaHtpY。\n-埃文·塞林格(@EvanSelinger)2020年6月10日\n在IBM、微软和亚马逊宣布这一消息后，微软总裁再次呼吁联邦政府对面部识别技术进行监管：\n史密斯说：“我们需要开始梳理这个问题，以便更好地理解它，超越允许或禁止的二元对话。”“想一想：监管它的正确方式是什么？”\n对于IBM、微软和亚马逊在面部识别方面的举措，人们的热情好坏参半。\n增加担忧的是存在其他兜售面部识别技术的公司，如Clearview AI。\n虽然许多人认为这些声明是在漫长的道路上迈出的一小步，但他们确实认为这是朝着正确方向迈出的一步。\n亚马逊(Amazon)和微软(Microsoft)从事的面部识别营销活动如今正受到抨击。虽然亚马逊的合同已经公之于众，但微软最近被发现早在2017年就向美国药品监督管理局(DEA)推销其面部识别技术。IBM、微软和亚马逊最近的声明是在打击肆无忌惮地使用面部识别技术方面向前迈出的有希望的一步，特别是在警察方面。有强烈的论点认为，由于在执法中公平地实施自动化技术存在固有的困难，应该完全禁止警察使用面部识别。此外，正如约翰·奥利弗(John Oliver)所指出的那样，面部识别的发展本身已经打开了一个潘多拉盒子，即使是硅谷的一些人也不敢碰。\n亚马逊仍在与警方合作进行监控应用-据称Ring已经与美国1000多个警察部门合作。\n即使微软和亚马逊决定在道德意义上走得和IBM一样远，事实仍然是，像Clearview AI和Banjo这样的公司继续提供面部识别服务。只要有人想继续出于任何目的使用面部识别，它的发展就会继续下去。\n如果没有对此类技术的实质性联邦法规，任何一家(或三家)公司都不会对面部识别技术的开发和使用以及相关风险产生太大影响。\n目前对人脸识别技术现有的和潜在的滥用的关注正在向行业领袖和政府施压，要求他们重新评估和重新想象人脸识别的未来。国会目前正在考虑一项警察改革法案，该法案限制执法中的人脸识别。许多人认为这项法案和最近科技公司的回应是有希望的起点。然而，需要更大的压力来确保公平和道德地使用人脸识别和其他具有重大社会影响的人工智能技术。\nIBM、微软和亚马逊采取行动停止(或暂停)人脸识别技术的开发，特别是在执法部门，至少在足够的联邦法规到位之前，这些举措是确保这项技术合乎道德的使用的有希望的起点。尽管多年来的研究揭示了商业人脸识别系统的缺陷，但由于最近的抗议活动和关于种族歧视和警察暴行的全国性对话，公司直到现在才采取行动。这也表明，需要来自消费者、公民自由团体和广大公众的持续压力，以确保人脸识别技术的道德发展和监管取得进展。", "note_en": "Movements against unregulated police use of facial recognition, which compound its many ethical issues, are gaining speed\n      Recent protests in racial discrimination and police brutality led IBM to cease developing facial recognition technology and Microsoft and Amazon to pause selling face recognition technology to law enforcement.\n  While this is a good starting point, as companies are not only acknowledging but addressing known flaws and biases in face recognition systems, much work remains to be done.\n  In particular, continued pressure from the public is needed to ensure ethical developments and regulations of face recognition technology in the future.\n  In a June 8  letter to members of Congress, IBM declared its opposition to technologies that would enable surveillance, including facial recognition. Microsoft and Amazon followed suit on facial recognition, respectively  banning police use and placing a  one-year moratorium on use. Other companies,  such as Clearview AI, still offer the technology to police departments. As  The Washington Post reports, IBM’s decision to drop facial recognition technology has been preceded by years of debate, particularly in response to a 2018 study called  Gender Shades which found that industry facial recognition systems have much higher error rates on darker-skinned faces.\n  Civil rights and justice groups, including the  Algorithmic Justice League and  ACLU, have commended these actions from IBM and Amazon:\n The Algorithmic Justice League commends this decision as a first move forward towards company-side responsibility to promote equitable and accountable AI.\n It took two years for Amazon to get to this point, but we’re glad the company is finally recognizing the dangers face recognition poses to Black and Brown communities and civil rights more broadly.\n Facial recognition technology, capable of identifying a person from a digital image or video frame, has been under development for decades. With the major advances in deep learning over the past decade, facial recognition has also seen substantial progress. Modern AI-powered face recognition systems rely on large datasets of faces for two purposes: 1) training a neural network that can extract key features of human faces and 2) finding similar-looking faces using these features. There are multiple privacy and ethical concerns with collecting such large datasets, ranging from biased data that results in biased predictions to how these data  can be collected without consent.\n The recent controversies regarding face recognition are specifically centered around use by law enforcement. There are currently no federal laws, and few local ones, regulating how and when police and other government agencies can use such technologies. This is despite commercial offerings already being available for years, and  being used by some police departments. When these flawed systems are applied by law enforcement, they can place people of color at higher risk due to the higher error rate. Even if these systems worked perfectly, they can still be  “easily weaponized against communities to harass them.”\n   Vox notes that public statements on facial recognition from such major companies is a step forward, but there are also concerns that smaller companies like Clearview AI may step in to take their place. Some are also skeptical of the recent moves by tech companies, calling them PR stunts:\n Evan Greer, the deputy director of Fight for the Future, called Amazon’s announcement “a public relations stunt.” The Surveillance Technology Oversight Project, a New York-based anti-surveillance legal organization, called the company’s move “too little, too late.” Its director, Albert Fox Cahn, added in an emailed statement, “Amazon shouldn’t just end this practice for one year or one decade; it should end it forever.”\n Forbes reports that with the condemnations and moratoriums, there is enough conflation between the different sorts of technology that people aren’t quite sure what exactly is being renounced. Nonetheless, the public attention on face recognition systems is a good starting point to ensure ethical developments of this technology in the future.\n This should then be backed up with a strong set of principles and ethical standards that the industry can follow. The result will likely be a stronger foundation for AI.\n Wired also believes that we are far from the end with facial recognition, agreeing with Vox that plenty of smaller companies are still there to fill the void–the technology produced by these companies is prey to the same fatal flaws that resulted in the blowback against IBM et al in the first place.\n  Some, such as  Jathan Sadowski (research fellow at Monash U emerging tech lab), see the “victory” of pushback against facial recognition as merely symbolic and an opportunity to push harder.\n Yes, I see this not so much as winning a battle, but as an opportunity to go on the offensive, to push harder, to actually extract real and lasting victories. We&#39;ve all had fight so hard just to gain enough ground to strike back. And I&#39;m finally starting to feel a bit surefooted.\n— Jathan Sadowski (@jathansadowski)  June 10, 2020\n Albert Fox Cahn described the step as a milestone, but “like hearing an arsonist agree to stop pouring gasoline on a forest fire, without doing much to put out the blaze.” \\\n I agree that’s a huge milestone, but it feels like hearing an arsonist agree to stop pouring gasoline on a forest fire, without doing much to put out the blaze, and I hope many see it as a sign of just how much more can be accomplished through even more pressure.\n— Albert Fox Cahn🔯 (@FoxCahn)  June 10, 2020\n Regardless, these steps, even Amazon’s one-year moratorium, are seen as  a step in the right direction.\n This is almost unbelievable! Nonstop activism + timing = Amazon has finally relented and is making a move in the right direction: implementing a one-year moratorium on the police use of its facial recognition tech, Rekognition! h/t  @BrendaKLeong  https://t.co/W5fWEaHtpY\n— Evan Selinger (@EvanSelinger)  June 10, 2020\n  After the announcements from IBM, Microsoft, and Amazon, Microsoft’s president  repeated the call for federal regulation of facial recognition technology:\n “We need to start teasing this issue apart, to understand it better and move just beyond a binary conversation of: permit it or ban it,” Smith said. “And think about: what is the right way to regulate it?”\n  The enthusiasm for IBM’s, Microsoft’s, and Amazon’s moves on facial recognition have been mixed.\n  Adding to the worries are the existence of other companies peddling facial recognition technology, such as Clearview AI.\n  While many see these announcements as a small step down a long road, they do see it as a step in the right direction.\n  Amazon and Microsoft have engaged in the same marketing of facial recognition that is being lambasted today. While Amazon’s contracts are already public knowledge, Microsoft was recently found to have  pitched its facial recognition technology to the Drug Enforcement Administration (DEA) as far back as 2017. The recent announcements from IBM, Microsoft, and Amazon are a promising step forward in the fight against unfettered use of facial recognition technology, particularly in policing. There are strong arguments that due to the inherent difficulties in fairly implementing automation technology in law enforcement,  police should be banned from using facial recognition altogether. In addition, as  John Oliver pointed out, development of facial recognition in and of itself has opened a Pandora’s Box that even some in Silicon Valley were too afraid to touch.\n  Amazon is still engaged with the police in surveillance applications - Ring allegedly  has partnered with over 1000 police departments in the US.\n  Even if Microsoft and Amazon decide to go as far as IBM has in the moral sense, the fact remains that companies like Clearview AI and Banjo continue to offer facial recognition services. As long as there are people who want to continue to use facial recognition for any purpose, its development will go on.\n  Without substantive federal regulations on such technology, no one company (or three companies) will have much of an impact on the development and use of facial recognition technology and the associated risks.\n The current spotlight on the existing and potential abuses of face recognition technology is pressuring both industry leaders and governments to re-evaluate and re-imagine the future of face recognition. Congress is currently considering a police reform bill that limits face recognition in law enforcement. Many see this bill and the recent responses from tech companies as promising starting points. However, more pressure is needed to ensure fair and ethical uses of face recognition and other AI technologies with significant social impacts.\n  The moves by IBM, Microsoft, and Amazon to stop (or pause) development of face recognition technology, especially for law enforcement, at least until adequate federal regulations are in place, are promising starting points to ensure ethical uses of this technology. Although studies have revealed flaws in commercial face recognition systems for years, companies are only now taking action as a result of recent protests and the national conversation on racial discrimination and police brutality. This also suggests that continuous pressure from consumers, civil liberty groups, and the public at large is needed to ensure progress in the ethical development and regulation of face recognition technology.", "posttime": "2020-06-25 07:30:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,微软,microsoft,亚马逊,警方", "title": "IBM、微软和亚马逊停止向警方销售面部识别", "title_en": "IBM, Microsoft, and Amazon Halt Sales of Facial Recognition to Police", "transed": 1, "url": "https://www.skynettoday.com/briefs/face-recog-police", "via": "", "real_tags": ["amazon", "微软", "microsoft", "亚马逊", "警方"]}, {"category": "", "categoryclass": "", "imagename": "267b22b79ace07cb6b7301713a20c42f.jpg", "infoid": 1008032, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周三，J.D.Power刚刚发布了2020年的初步质量调查。这项调查在过去34年里每年进行一次，询问该车型年的新车购买者，看看他们在拥有新车的前90天内遇到了什么问题(如果有的话)。然后根据每100辆车遇到的问题数量对每个品牌进行排名(PP100)。\n2020年是特斯拉第一次被纳入调查，正如我们最近关于Model Y问题的报道的读者可能已经猜到的那样，这家总部位于加州的电动汽车公司的情况看起来并不乐观。与此同时，道奇的情况看起来非常好，它与起亚共同位居榜首。\n根据J.D.Power的调查，特斯拉的初始质量得分为250 PP100，这一壮举使得相比之下，即使是奥迪和路虎也似乎是可靠的。尽管完全准确，特斯拉并没有正式排名最后，因为该品牌不允许J.D.Power在15个州调查其客户，这些州显然需要获得OEM许可。然而，我们从其他35个州的车主那里收集了足够大的调查样本，并在此基础上计算出了特斯拉的得分，J.D.Power汽车事业部总裁道格·贝茨(Doug Betts)说。\n其他国内汽车制造商的情况看起来更好。道奇获得136分PP100，与起亚持平。雪佛兰和公羊并列第三，PP100为141分，别克、GMC和凯迪拉克的得分都高于166 PP100的行业平均水平。而最可靠的个人MY2020车辆是雪佛兰Sonic，得分为103 PP100。\n相反，豪华车进口在这项调查中表现不佳，在今年2月至5月间进行的这项调查中，总共收到了87282名MY2020汽车买家和租车人的回应，只有Genesis(124 PP100)、雷克萨斯(152 PP100)和前述凯迪拉克(162 PP100)好于平均水平，同时，排名倒数前五位(不包括特斯拉)是捷豹(190 PP100)、梅赛德斯-奔驰(202 PP100)、沃尔沃(202 PP100)(Tesla除外)，而排名最后的五位(不包括特斯拉)是捷豹(190 PP100)、梅赛德斯-奔驰(202 PP100)、沃尔沃(202 PP100)。\n尽管如此，整个行业每辆新车平均1.66个问题听起来相当糟糕。但J.D.Power表示，这在更大程度上是今年重新设计的调查的作用，这给了人们一种更细粒度的方式来报告他们的新车遇到的问题。\n它现在提出了223个问题，分为9个类别：包括信息娱乐、功能、控制和显示、外部、内部、动力总成、座椅、驾驶体验、气候和(2020年新增的)驾驶辅助。ARS的读者可能不会惊讶地发现，这些类别中最麻烦的是信息娱乐，它几乎占所有问题的四分之一。这里最大的抱怨是语音识别、Android Auto和Apple CarPlay连接、触摸屏、车载导航和蓝牙问题。", "note_en": "On Wednesday, J.D. Power has just released its Initial Quality Survey for 2020. Conducted annually for the past 34 years, the survey queries buyers of new cars of that model year to find out what, if any, problems they encountered within the first 90 days of ownership. Each brand is then ranked on the number of problems it experienced per 100 vehicles (PP100).\n 2020 is the first year that Tesla has been included in the survey, and as readers of  our recent story on Model Y problems might have guessed, things don&#39;t look great for the California-based electric car company. Meanwhile, things look very good for Dodge, which shares the top spot with Kia.\n According to J.D. Power&#39;s survey, Tesla&#39;s initial quality score is 250 PP100, a feat which makes even Audi and Land Rover seem reliable by comparison. Although to be entirely accurate, Tesla isn&#39;t officially ranked last, because the brand won&#39;t allow J.D. Power to survey its customers in 15 states where OEM permission is apparently required. &#34;However, we were able to collect a large enough sample of surveys from owners in the other 35 states and, from that base, we calculated Tesla&#39;s score,&#34; said Doug Betts, president of the automotive division at J.D. Power.\n  Things look better for the other domestic automakers. Dodge achieved a score of 136 PP100, matching Kia. Chevrolet and Ram are in joint third place, with 141 PP100, and Buick, GMC, and Cadillac all scored better than the industry average of 166 PP100. And the most reliable individual MY2020 vehicle was the Chevrolet Sonic, which scored 103 PP100.\n Conversely, luxury imports fare poorly on this survey, which got responses from a total of 87,282 buyers and leasers of MY2020 vehicles, conducted between February and May of this year. Only Genesis (124 PP100), Lexus (152 PP100), and the aforementioned Cadillac (162 PP100) were better than average. Meanwhile, the bottom five (excluding Tesla) were Jaguar (190 PP100), Mercedes-Benz (202 PP100), Volvo (210 PP100), Audi (225 PP100), and Land Rover (228 PP100).\n Still, an average of 1.66 problems per new car across the industry sounds pretty bad. But J.D. Power says that&#39;s more a function of a redesigned survey this year, which gives people a more granular way to report the issues their new vehicle has experienced.\n It now asks 223 questions, split into nine categories: including infotainment, features, controls and displays, exterior, interior, powertrain, seats, driving experience, climate, and (new for 2020) driving assistance. Ars readers may not be surprised to discover that the most troublesome of these categories was infotainment, which accounted for almost a quarter of all problems. Top complaints here were voice recognition, Android Auto and Apple CarPlay connectivity, touchscreens, onboard navigation, and Bluetooth issues.", "posttime": "2020-06-25 07:09:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,调查,survey", "title": "特斯拉首次被纳入J.D.Power调查，情况很糟糕", "title_en": "Tesla included in J.D. Power survey for the first time, and it’s bad", "transed": 1, "url": "https://arstechnica.com/cars/2020/06/teslas-are-the-most-unreliable-new-cars-in-the-us-survey-finds/", "via": "", "real_tags": ["特斯拉", "调查", "survey"]}, {"category": "", "categoryclass": "", "imagename": "32414d44019390509510bfd6b7faa5a5.jpg", "infoid": 1008031, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周三，波士顿加入旧金山、加利福尼亚州奥克兰和马萨诸塞州剑桥等城市的行列，通过了一项禁止市政使用面部识别技术的投票。它是继旧金山于2019年5月颁布禁令之后，美国第二大禁止面部识别的城市。\n该法令获得一致通过，将阻止首都使用面部识别技术或获取使用该技术进行监控的软件。\n波士顿市议员米歇尔·吴(Michelle Wu)在周三的听证会上表示，波士顿不应该使用种族歧视技术和威胁我们基本权利的技术。\n该法令也有例外，比如允许城市员工使用面部识别进行身份验证，比如解锁自己的设备。市政府官员还可以使用面部识别技术自动编辑图像中的人脸。但他们不能用它来辨认身份。\n投票来自市议员里卡多·阿罗约(Ricardo Arroyo)，他与吴一起发起了这项法案。周三的决定使波士顿成为东海岸禁止面部识别的最大城市。\n总体而言，它阻止波士顿市政府使用面部识别或从面部识别系统获取信息，或者雇佣可以代表波士顿使用面部识别的第三方。\n这项禁令是在全国范围内呼吁警察改革和限制面部识别等监控技术之后出台的。像纽约这样的城市已经通过立法，公开纽约警察局的监控工具，而亚马逊和IBM等公司已经宣布暂停向警察部门出售面部识别。\n在研究人员揭露了这项技术的种族和性别偏见后，面部识别受到了广泛的批评。研究突显了这些算法比白人男性更有可能错误识别有色人种和女性，这引发了人们对政府如何使用这项技术的担忧。\n市议员利兹·布雷登在听证会上说，监视我们的总体人口并进行面部识别并不一定是我们在自由社会中想要的方式。\n美国公民自由联盟(American Civil Liberties Union)周三宣布在底特律提起诉讼，此前警方错误逮捕了被底特律面部识别软件误认的黑人罗伯特·威廉姆斯(Robert Williams)。这是已知的第一起因面部识别不匹配而被捕的案件，但隐私权倡导者担心，如果警方继续使用这项技术，这只是一个开始。\n马萨诸塞州美国公民自由联盟(ACLU)执行主任卡罗尔·罗斯(Carol Rose)表示，对于我们的隐私权，以及像罗伯特·威廉姆斯(Robert Williams)这样的人来说，这是一个至关重要的胜利。他们因为执法部门不应该使用的技术而因没有犯下的罪行而被捕。全国的立法者应该效仿，立即停止执法部门使用这项技术。这种监视技术对的时候是危险的，错的时候也是危险的。\n波士顿警察局目前没有使用面部识别技术，但周三的投票确保了他们在不久的将来不会使用这项技术。\n面部识别本质上是危险的，本质上是压抑的。它不能被改革或监管。数字权利组织“争取未来”(Fight For The Future)的副主任埃文·格里尔(Evan Greer)表示，它必须被废除。波士顿刚刚成为最新一个停止使用这种非同寻常的有毒监控技术的大城市。其他每个城市都应该效仿。\n在6月9日波士顿市议会的听证会上，该市警察局长威廉·格罗斯表示，他对面部识别技术不感兴趣，因为这项技术仍然存在种族偏见。\n尊重他人，保持文明礼貌，不离题。我们删除违反我们政策的评论，我们鼓励您阅读这些评论。我们可以随时关闭讨论线程。", "note_en": "Boston joined cities like San Francisco, Oakland, California, and Cambridge, Massachusetts, on Wednesday in passing a vote to ban facial recognition technology for municipal use. It&#39;s the second largest city in the US to ban facial recognition, after  San Francisco enacted its ban in May 2019.\n The ordinance passed unanimously and will prevent the capital city from using facial recognition technology or obtaining software for conducting surveillance using the technology.\n  &#34;Boston should not be using racially discriminatory technology and technology that threatens our basic rights,&#34; City Councilor Michelle Wu said at the hearing on Wednesday.\n The ordinance comes with exceptions, like allowing city employees to use facial recognition for authentication purposes such as unlocking their own devices. City officials can also use facial recognition technology for automatically redacting faces in images. But they can&#39;t use it for identifying people.\n The vote came from City Councilor Ricardo Arroyo, who sponsored the bill with Wu. The decision on Wednesday makes Boston the largest city on the East Coast to ban facial recognition.\n Overall, it prevents the city of Boston from using facial recognition or obtaining information from a facial recognition system, or hiring a third party that can use facial recognition on the city&#39;s behalf.\n The ban comes after nationwide calls for police reform and limits on surveillance technology like facial recognition. Cities like New York have passed legislation to  disclose the NYPD&#39;s surveillance tools, while companies like  Amazon and  IBM have announced moratoriums on selling facial recognition to police departments.\n Facial recognition has been widely criticized after researchers  exposed the technology&#39;s racial and gender bias. Studies highlight how the  algorithms are much more likely to misidentify people of color and women than white men, raising concerns on how governments are using the technology.\n  &#34;Surveilling our population at large and doing facial identification is not necessarily the way we want to go in a free society,&#34; City Councilor Liz Breadon said at the hearing.\n The  American Civil Liberties Union on Wednesday announced a lawsuit in Detroit after police wrongfully arrested Robert Williams, a Black man misidentified by the city&#39;s facial recognition software. It&#39;s the first known case of an arrest from a facial recognition mismatch, but privacy advocates worry it&#39;s only the beginning if police continue to use the technology.\n &#34;This is a crucial victory for our privacy rights and for people like Robert Williams, who have been arrested for crimes they did not commit because of a technology law enforcement shouldn&#39;t be using,&#34; said Carol Rose, executive director of the ACLU of Massachusetts.&#34;Lawmakers nationwide should follow suit and immediately stop law enforcement use of this technology. This surveillance technology is dangerous when right, and dangerous when wrong.&#34;\n Boston&#39;s police department doesn&#39;t currently use facial recognition, but Wednesday&#39;s vote ensures that it can&#39;t use the technology in the near future.\n &#34;Facial recognition is inherently dangerous and inherently oppressive. It cannot be reformed or regulated. It must be abolished,&#34; said Evan Greer, deputy director of the digital rights group Fight for the Future. &#34;Boston just became the latest major city to stop the use of this extraordinary and toxic surveillance technology. Every other city should follow suit.&#34;\n At a  Boston City Council hearing on June 9, the city&#39;s Police Commissioner William Gross said he&#39;s not interested in facial recognition while the technology is still racially biased.\n  Be respectful, keep it civil and stay on topic. We delete comments that violate  our policy, which we encourage you to read. Discussion threads can be closed at any time at our discretion.", "posttime": "2020-06-25 06:50:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "投票,votes,技术", "title": "波士顿投票禁止政府使用面部识别", "title_en": "Boston Votes To Ban Government Use of Facial Recognition", "transed": 1, "url": "https://www.cnet.com/news/boston-votes-to-ban-government-use-of-facial-recognition/#ftag=CAD590a51e", "via": "", "real_tags": ["投票", "votes", "技术"]}, {"category": "", "categoryclass": "", "imagename": "cd15e26a4ca97515fad57d50cc73dc2c.jpeg", "infoid": 1008030, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Alphabet的Sideway Labs计划将其智能城市的一些想法分拆成独立的公司，首席执行官丹尼尔·多克托罗夫(Daniel Doctoroff)今天在Collision From Home大会上表示。多克托罗夫列举了三家潜在的公司：大规模木材建筑，负担得起的电气化无化石燃料，以及通过机器学习和计算设计优化的规划工具。\n上个月，Sideway Labs扼杀了其多伦多智能城市项目，该项目设想为建筑物、加热路面和物体分类摄像头设计雨衣。隐私权倡导者庆祝谷歌姊妹公司不会获得侵入性权力来监视居民。但正如我在那周的专栏中所说，故事还远未结束。Sideway实验室利用新冠肺炎疫情作为多伦多项目的替罪羊，但该公司不会闲置。\n现在，我们对城市创新公司的计划有了更多的了解，正如多克托罗夫更喜欢描述的那样：\n我们的工作有两种不同的途径，从我们在多伦多所做的工作出发。第一个是基于许多这样的想法创建公司。举个例子，我们对大众木材的潜力深信不疑。更低的建设成本，更短的建设时间，这两者都可以在帮助解决负担能力问题方面发挥重要作用。还有巨大的可持续性效益和美学效益。我们正在创建一家公司，实际上是将大量木材的建造商业化。通过我们在多伦多的努力，我们开发了一种非常不同的方法来大幅减少碳排放。其中一种方法是我们所说的负担得起的电气化，也就是基本上使用所有的电力，无论是在建筑物还是在一个地区，而不使用化石燃料。我们认为，有一家非常重要的公司可能会由此产生。我们开发的计划工具，我们认为可以利用机器学习和计算设计来帮助优化-我们认为那将是一家独立的公司。\n另外，我们还将与使用我们在多伦多计划中描述的一些创新的开发商接触，我们自己将把其中一些创新打造成帮助开发商实现这种生活质量改善的公司。在某些情况下，我们也将是资本合伙人。因此，我们希望在多伦多以外的建筑中发挥作用，只是以一种比在多伦多更多样化的方式做到这一点。我们总是要采用这种策略，这在某种程度上只是加速了它。\n这是有先例的。2019年7月，Sideway Labs参与了针对婴儿潮一代的社区市场Umbrella的一轮融资。Sideway Labs在2019年9月更进一步，它推出了复制品，帮助城市规划者用大数据创建“虚拟人口”。\nVB Transform 2020 Online-7月15-17日。加入领先的人工智能高管：注册免费直播。\nSideway Labs是Alphabet旗下的谷歌姊妹公司。其他Alphabet公司包括Calico、CapitalG、DeepMind、GV、Google Fiber、Jigsaw、Loon、Makani、Verely、Waymo、wing和X。因为没有一家是盈利的，这些登月计划被集中在Alphabet收益中的一个名为“其他押注”的项目下。在Alphabet最新的2020年第一季度收益中，其他博彩收入下降21%，至1.35亿美元，亏损增加29%，至11亿美元。这意味着上个季度，其他赌注消耗的现金是它们产生的现金的8倍。\n去年12月，当谷歌首席执行官也成为Alphabet的首席执行官时，我解释说，我们知道会发生什么：字母表公司要么会变得更加专注，要么会被并入谷歌(就像2018年2月的Nest和2019年6月的Chronicle一样)。在今年的新角色中，桑达尔·皮查伊面临着开始为其他押注辩护的压力。目前还不清楚Sideway Labs是否会重新并入谷歌。很明显，该公司希望确保其智慧城市的想法永存。", "note_en": "Alphabet’s Sidewalk Labs plans to spin out some of its smart city ideas into separate companies, CEO Daniel Doctoroff said today at Collision from Home conference. Doctoroff listed three potential companies: mass timber construction, affordable electrification sans fossil fuels, and planning tools optimized with machine learning and computation design.\n Last month, Sidewalk Labs  killed its Toronto smart city project, which envisioned  raincoats designed for buildings, heated pavement, and object-classifying cameras. Privacy advocates celebrated that the Google sister company would not be getting invasive power to surveil residents. But as I argued  in my column that week, the story was far from over. Sidewalk Labs was using the COVID-19 pandemic as a scapegoat for the Toronto project, but the company wouldn’t stay idle.\n  Now we’re learning a little more about the plan for the urban innovation company, as Doctoroff prefers to describe it:\n There’s two different avenues that our work can take, leading out of the work we did in Toronto. The first is the creation of companies based on a lot of those ideas. As an example, we are huge believers in the potential of mass timber. Lower construction costs, lower construction times, both of which could have a big role in helping to address the affordability issue. There are also massive sustainability benefits and aesthetic benefits as well. We are in the process of creating a company to in effect commercialize the construction of mass timber. Out of our efforts in Toronto we’ve developed a very different approach to dramatically reducing carbon emissions. One of those pieces of that approach is what we call affordable electrification, which is basically to use all electricity, in whether it’s a building or in a district, without using fossil fuels. We think that there is a very important company that potentially could be created out of that. The planning tools that we developed, which we think can help to optimize using machine learning and computational design — we think that’d be a separate company.\n Separately, we will also be engaging with developers using some of those innovations that were described in our plan for Toronto, some of which we ourselves will be building into companies that help developers achieve these sorts of quality of life improvements. In some cases, we will be a capital partner as well. So we expect to play a role in the building out of the places, and just do it in a more diversified way then would have been in Toronto. We were always going to employ that strategy, this just accelerates it in some way.\n There is some precedent here.  Sidewalk Labs participated in a funding round for Umbrella, a community marketplace for boomers, in July 2019. Sidewalk Labs went further in September 2019 when it  spun out Replica to help city planners create “virtual populations” with big data.\n  VB Transform 2020 Online - July 15-17. Join leading AI executives:  Register for the free livestream.\n Sidewalk Labs is a Google sister company under the Alphabet umbrella. Other Alphabet companies include Calico, CapitalG, DeepMind, GV, Google Fiber, Jigsaw, Loon, Makani, Verily, Waymo, Wing, and X. Because none are profitable, these moonshots are lumped together in Alphabet earnings under a line item called “Other Bets.” In Alphabet’s most recent  Q1 2020 earnings, Other Bets revenue was down 21% to $135 million, while losses were up 29% to $1.1 billion. That means last quarter, Other Bets burned eight times more cash than they generated.\n In December, when  Google’s CEO also became Alphabet’s CEO, I explained that  we knew what to expect: Alphabet companies will either become more focused or get folded into Google (like  Nest in February 2018 and  Chronicle in June 2019). In his new role this year, Sundar Pichai is under pressure to start justifying Other Bets. It’s still not clear whether Sidewalk Labs is expecting to be folded back into Google. What is clear is the company wants to ensure its smart city ideas live on.", "posttime": "2020-06-25 06:12:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "城市,labs", "title": "Sideway Labs计划剥离更多智慧城市公司", "title_en": "Sidewalk Labs Plans To Spin Out More Smart City Companies", "transed": 1, "url": "https://venturebeat.com/2020/06/24/sidewalk-labs-plans-to-spin-out-more-smart-city-companies/", "via": "", "real_tags": ["城市", "labs"]}, {"category": "", "categoryclass": "", "imagename": "080e3b0db1f05ffd1aed9f27aaae1e92.png", "infoid": 1008029, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "但你不会同意你的感知能力和计算机熟练程度让你在交易中占了一席之地吗？\n..。我发现很难相信点击一个清晰而明显的菜单会让我在某种程度上比其他人更有洞察力或更熟练。\n它可能会让我更有耐心地解决一个意想不到的问题，而不是草率地将其置之不理或喋喋不休。\n我一直在告诉人们，IRL：良好的技术技能所需的头号品质就是不折不扣的耐心。耐心阅读菜单。耐心地在论坛上发问，等待一个好的答案。耐心地让您的PC完成更新(或释放更新错误)，而不是重新启动，从而导致文件系统错误，使其无法启动。\n对我来说，这只是其中的又一集。不需要额外的智力或熟练程度。", "note_en": "but wouldn’t you agree that your perception skills and computer proficiency give you a leg up in the transaction?\n ... I find it hard to believe clicking through a clearly and obviously presented menu renders me somehow more perceptive or proficient than others.\n What it might make me is more patient to work through an unexpected issue instead of either dismissing it offhand or barreling through it.\n I tell people all the time IRL: the #1 quality necessary for good tech skills is literally patience. Patience to read through menus. Patience to post questions on forums and wait for a good answer. Patience to allow your PC to finish an update (or let the update error out) instead of restarting it thereby causing filesystem errors that make it fail to boot.\n This is just another episode of that to me. There&#39;s no extra &#34;intelligence&#34; or proficiency required.", "posttime": "2020-06-25 06:11:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "微软,microsoft,firefox,火狐,duplicates", "title": "微软未经询问就从火狐复制数据", "title_en": "Microsoft duplicates data from Firefox without asking", "transed": 1, "url": "https://old.reddit.com/r/Windows10/comments/hct0mj/are_we_going_to_get_treated_to_spam_popups/", "via": "", "real_tags": ["微软", "microsoft", "firefox", "火狐"]}, {"category": "", "categoryclass": "", "imagename": "6f7c7abfec3c8ba5107c995f361bc825.jpeg", "infoid": 1008028, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚州奥克兰。(路透社)-Alphabet Inc.的谷歌周三表示，将在18个月后自动删除新用户的一些位置历史记录，使每个人都更容易访问其搜索、地图和YouTube应用程序，而不会被跟踪。\n谷歌隐私控制的更新正值这家全球最大的搜索引擎面临对其数据收集做法的更严格审查。在过去的两年里，加州和欧洲的新隐私法促使互联网公司调整了做法。过去几个月，消费者和美国州总检察长提起的几起诉讼指控谷歌在数据收集方面存在欺诈行为。\n根据谷歌的更新设置，YouTube的新用户观看历史将在36个月后消失，位置跟踪和网络浏览历史将在18个月后消失。用户可以选择更短或更长的时间范围。\n不过，谷歌可能仍可以通过其他方式访问和存储位置详细信息。\n用户只需在搜索、地图或YouTube应用程序的顶部按住自己的头像，就可以更轻松地在谷歌所称的“隐姓埋名模式”下进行搜索。以前，需要在应用程序的菜单中额外单击。\n谷歌没有记录用户隐姓埋名时的活动。\n该公司的大部分收入来自广告，这些广告通常基于有关用户正在观看和阅读的内容以及他们所在位置的数据。Alphabet首席执行长皮查伊(Sundar Pichai)去年承认，该公司收集的数据超过了广告所需，并承诺将收集的数据降至最低。", "note_en": "OAKLAND, Calif. (Reuters) - Alphabet Inc’s Google said on Wednesday it will automatically delete some location history after 18 months for new users and make it easier for everyone to access its search, Maps and YouTube apps without being tracked.\n The updates to Google’s privacy controls arrive as the world’s largest search engine faces heightened scrutiny on its data collection practices. New privacy laws in California and Europe have prompted internet companies to adjust practices over the last two years. Several lawsuits by consumers and U.S. state attorneys general in the last few months have accused Google of deception in data gathering.\n Under Google’s updated settings, YouTube’s viewing history of new users will disappear after 36 months and location tracking and web browsing history will get dropped after 18 months. Users have the option of choosing shorter or longer timeframes.\n However, Google may still be able to access and store location details in other ways.\n Users can more easily search in what Google calls “incognito mode,” by just holding down their profile picture at the top of the search, Maps or YouTube apps. Previously, an additional click in the apps’ menu was required.\n Google does not keep a log of users’ activity when they are in incognito.\n The company derives most of its revenue from ads, which are typically based on data about what users are watching and reading and where they are located. Alphabet Chief Executive Sundar Pichai last year acknowledged that the company gathers more data than necessary for ads and committed to minimize its collection.", "posttime": "2020-06-25 06:10:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,web", "title": "新的谷歌默认在18个月后擦除用户的位置和网络历史", "title_en": "New Google default wipes users' location, web history after 18 months", "transed": 1, "url": "https://www.reuters.com/article/us-alphabet-google-privacy/new-google-default-wipes-users-location-web-history-after-18-months-idUSKBN23V2KX", "via": "", "real_tags": ["google", "谷歌", "web"]}, {"category": "", "categoryclass": "", "imagename": "940dad89a212655340bb742fb7c105a5.jpg", "infoid": 1008027, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "WebAssembly于2019年12月5日加入HTML、CSS和Javascript成为Web标准。这对很多事情都很有用，就性能而言，这在浏览器中是前所未见的。如果你有5分钟的时间，我需要解释一下正在进行的这场小小的革命。\n1995年，Brendan Eich在10天内创建了Javascript。在那个时候，Javascript的设计并不是为了快速。它基本上是用来进行表单验证的，速度非常慢。随着时间的推移，情况变得更好了。\n2008年，谷歌不知从哪里冒出来，推出了它的新浏览器：谷歌Chrome。Chrome内部有一个名为V8的Javascript引擎。而V8的革命是Javascript的即时(JIT)编译。这种从解释代码到JIT编译的改变极大地提高了Javascript的性能，从而也提高了浏览器的整体性能。这样的速度使得像NodeJS或Electron这样的技术诞生，以及Javascript的受欢迎程度爆发式增长。\n2015年，WebAssembly首次发布，并发布了一个在Unity下运行的游戏的小演示。游戏直接在浏览器中运行！\n2019年，W3C将WebAssembly作为新的Web标准。就像V8引擎处于鼎盛时期一样，WebAssembly正在形成新的性能革命。所以WebAssembly已经在这里了，而且它有了一个良好的开端。\nWebAssembly(缩写为wasm)是使用非Javascript代码并在浏览器中运行它的一种方式。此代码可以是C、C++、Rust和许多其他代码。它将在您CPU上以接近本机速度在您的浏览器中编译和运行。此代码采用二进制文件的形式，您可以直接从Javascript中将其作为模块使用。\nWebAssembly不是用来取代Javascript的。相反，这两种技术是协同工作的。通过使用Javascript API，您可以将WebAssembly模块加载到页面中。这意味着您可以利用Javascript的灵活性通过WebAssembly利用编译代码的性能。\nWebAssembly这个名称有点误导。WebAssembly确实适用于Web，但并不局限于此！开发WebAssembly的团队费了很大劲才使其成为通用的，以便可以在任何地方使用。我们开始看到这样的例子。\n此外，还有一种误解一直在出现。WebAssembly不是一种编程语言。WebAssembly是一种中间格式，即字节码，它充当其他语言的编译目标。好的，现在还不清楚，我们来画几张画吧。\n你看到了吗？又一件艺术品。如果我告诉你我用的是Photoshop，你相信我吗？不管怎么说！\n第一步：是您和您的开发人员技能。您可以用C、C++生成源代码(您可以使用其他语言)。此代码用于修复问题或使浏览器中的Javascript无法执行过于密集的进程。\n步骤2：您将使用Emscripten进行翻译。Emscripten是一个工具链，使用LLVM构建，可以将源代码编译成WebAssembly。您可以在几个快速步骤中安装和编译您想要的任何内容，我们稍后将对其进行介绍。在此步骤结束时，您将拥有一个WASM文件。\n步骤3：您将在您的网页上使用WASM文件。如果您来自未来，您可以像加载任何ES6模块一样加载此文件。现在，用法稍微复杂一些，但没什么特别的。\n首先，我们需要一小段C++代码来编译。有些人会在浏览器中向你提供整个暗黑破坏神1游戏作为例子，我会用一个加两位数的函数来保持它的简单性。我们不会用这个来证明C++的速度，这只是个例子。\n然后转到您选择的Linux发行版。我们将从下载和安装Emscripten开始。\n#安装依赖项(可以，您可以使用更新版本的Python)sudo apt-get install python2.7git#gettin Emscripten通过GIT克隆。git克隆https://github.com/emscripten-core/emsdk.git#下载、安装并激活sdkcd emsdk./emsdk安装最新版本。/emsdk激活latestlsource。/emsdk_env.sh#确保安装工作demcc-version#将c++文件编译为Web程序集模板\n这就是海克曼的作风。有一种更简单的方法。\n你可以去这个网站，把你的C++代码放在左边。然后，您将在Wat部件中获得导出函数的名称。使用我之前显示的添加函数代码：“_Z3addi”作为函数名，我们将在后面使用它。您只需单击“下载”，您就会拿回您的WASM文件。放松点！\n现在，我们可以让WebAssembly直接在浏览器中工作，而没有周围所有烦人的噪音。\n&lt；html&gt；&lt；head&gt；&lt；title&gt；WASM test&lt；/title&gt；&lt；link rel=&#34；style heet&#34；href=&#34；/style heets/style.css&34；/&gt；&lt；/head&gt；&lt；body&gt；&lt；script&gt；const getRt；https://012q1.sse.codesandbox.io/wasm/add.wasm&#34；)).Then(obj=&gt；obj.instance.exports._Z3addi).Then(Add=&gt；{document.getElementById(&#34；addTarget&#34；).textContent=Add(getRandomNumber()，getRandomNumber())；})；；&lt；/script&gt；&lt；h1&gt；reésultat du C++&lt；/h1&gt；&lt；p id=&#34；addTarget&#34；&。&lt；/p&gt；&lt；/body&gt；&lt；/html&gt；\n就是这个。此html网页允许您使用C++编译成WebAssembly！我跳过所有HTML和明显的内容，使用InstantiateStreaming函数直接转到第11行。正如Mozilla文档所说，此函数允许您通过简单的FETCH编译和实例化我们的WebAssembly模块。\n然后，我通过前面检索到的函数名使用Add函数，并用它替换一段DOM。瞧啊！C++通过浏览器中的Javascript实现。这有多疯狂？听着，我甚至给你做了一个带工作演示的代码箱。我就把它嵌在这里，玩吧！\n你要告诉我光是这样做就很复杂，你是对的。他们正在努力将实例化javascript位替换为将来的简单导入。所以耐心点，它马上就来了。\n我们已经谈了五分钟了，所以我就到此为止了。如果您想更多地了解WebAssembly，并且您面前还有时间：我推荐这篇优秀的文章更深入地研究这个主题。在接下来的故事中，我期待着Web对其他语言的开放将带来什么。有很大的潜力，我迫不及待地想让网络变得更快！", "note_en": "WebAssembly joined HTML, CSS and Javascript as a web standard on December 5, 2019. This will be useful for many things, and in terms of performance, it’s something never seen before in a browser. If you’ve got five minutes, I need to explain the little revolution that’s going on.\n    In 1995, Javascript was created  within 10 days by  Brendan Eich. And at that time, Javascript was not designed to be fast.  It’s basically for form validation and it’s slow like crazy. As time went by it got better.\n In 2008, Google came out of nowhere and put on the table its new browser: Google Chrome. Inside Chrome was a Javascript engine called V8.  And the revolution of V8 was the Just in Time (JIT) compilation of Javascript. This change from interpreted code to JIT compilation monstrously accelerated the performance of Javascript, and thus of browsers in general. This speed was going to allow the birth of technology like NodeJS or Electron and the explosion of popularity of Javascript.\n      In 2015, WebAssembly is announced for the first time with a  small demo of a game running under Unity. The game runs directly in the browser!\n In 2019, the W3C made WebAssembly a new web standard. Just as the V8 engine was in its day,  WebAssembly is shaping up to be the new performance revolution. So WebAssembly is already here, and it’s off to a flying start.\n    WebAssembly, abbreviated to wasm, is a way to use non-Javascript code and run it in your browser. This code can be C, C++, Rust and many others.  It will be compile and run in your browser at near native speed on your CPU. This code is in the form of a binary file that you can use directly from Javascript as a module.\n WebAssembly is not there to replace Javascript. On the contrary, these two technologies are made to work together. By using the  Javascript API you can load WebAssembly modules into your page. This means that you can take advantage of the performance of compiled code via WebAssembly with the flexibility of Javascript.\n      The name WebAssembly is a bit misleading.  WebAssembly does indeed work for the Web, but it is not limited to it! The team that made WebAssembly has gone to a lot of trouble to make it generic so that it can be used everywhere. We’re starting to see  examples of this.\n Also, there’s a misconception that comes up all the time.  WebAssembly is not a programming language. WebAssembly is an intermediate format, a  bytecode, which acts as a compilation target for other languages. Okay, it’s not clear, let’s make some drawings.\n       Did you see that? Another work of art. Do you believe me if I tell you I use Photoshop? Anyway !\n Step 1 : It’s you and your developer skills.  You produce source code in C, C++ (you can use others languages). This code is supposed to fix a problem or make a process too intensive for Javascript in the browser.\n Step 2 : you will use  Emscripten to do the translation.  Emscripten is a tool chain, built with  LLVM, that will compile your source code into WebAssembly. You can install it and compile whatever you want  in a few quick steps, we’ll look at it later. At the end of this step, you will have a WASM file.\n Step 3 : You will use the WASM file on your web page.  If you come from the future, you can load this file like any ES6 module. Right now, the usage is slightly more complex, but nothing fancy.\n     First of all, we need a small piece of C++ code to compile. Where some people will offer you the whole  Diablo 1 game in the browser as an example,  I’ll keep it simple with a function that adds two digits. We’re not going to prove the speed of C++ with that, it’s for the example.\n      Then go to the Linux distribution of your choice. We will start by downloading and installing emscripten.\n   # installing dependencies (yes, you can use newer version of python)sudo apt-get install python2.7 git# gettin emscripten via a git clone.git clone https://github.com/emscripten-core/emsdk.git# downloading, installing and activating the sdkcd emsdk./emsdk install latest./emsdk activate latestlsource ./emsdk_env.sh# make sure the installation workedemcc --version# compiling the c++ file to a webassembly templateemcc helloWebassembly.cpp -s WASM=1 -o helloWebassembly.html# we serve the HTML and look at the resultemrun helloWebassembly.html\n   That was the hackerman way of doing the wasm. There’s a simpler way.\n You can go to  this site and put your C++ code on the left. Then you get the name of the exported function in the WAT part.  Using the add function code showed before i got : “_Z3addii” as function name, we’ll use that just after. You just have to click on download and you will get your WASM file back. Easy !\n Now we can make WebAssembly work directly in the browser without all the annoying noise around.\n   &lt;html&gt; &lt;head&gt; &lt;title&gt;WASM test&lt;/title&gt; &lt;link rel=&#34;stylesheet&#34; href=&#34;/stylesheets/style.css&#34; /&gt; &lt;/head&gt; &lt;body&gt; &lt;script&gt; const getRandomNumber = () =&gt; Math.floor(Math.random() * 10000); WebAssembly.instantiateStreaming( fetch(&#34;https://012q1.sse.codesandbox.io/wasm/add.wasm&#34;) ) .then(obj =&gt; obj.instance.exports._Z3addii) .then(add =&gt; { document.getElementById(&#34;addTarget&#34;).textContent = add( getRandomNumber(), getRandomNumber() ); }); &lt;/script&gt; &lt;h1&gt;Résultat du C++&lt;/h1&gt; &lt;p id=&#34;addTarget&#34;&gt;&lt;/p&gt; &lt;/body&gt;&lt;/html&gt;\n   This is it. This html web page allows you to use C++ compiled into WebAssembly ! I skip all the HTML and obvious stuff to go directly to line 11 with the  InstantiateStreaming function. As the  Mozilla documentation says, this function allows you to compile and instantiate our WebAssembly module via a simple fetch.\n Then, I use the add function via the function name we retrieved earlier and use it to replace a piece of DOM. And voila !  C++ via Javascript inside your browser. How crazy is that? Look, I even made you a  codesandbox with a working demo. I’m embedding it right here, play with it !\n     You’re gonna tell me it’s complicated just to do this, and you’re right.  They’re working to replace the instantiation javascript bit with a simple import into the future. So be patient, it’s coming.\n       We’ve already been talking for five minutes, so I’ll stop here. If you want to know more about WebAssembly and you have time in front of you : i  recommend this  excellent article to go deeper in the subject. For the rest of the story, I’m looking forward to what this opening of the Web to other languages will bring. There’s a lot of potential and i can’t wait for the web to get even faster !", "posttime": "2020-06-25 06:09:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "webassembly,了解,javascript", "title": "在5分钟内了解WebAssembly", "title_en": "Understand WebAssembly in 5 Minutes", "transed": 1, "url": "https://www.jesuisundev.com/en/understand-webassembly-in-5-minutes/", "via": "", "real_tags": ["了解"]}, {"category": "", "categoryclass": "", "imagename": "8f259699f3a48470220c0df4a294a025.jpg", "infoid": 1008026, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "底特律警方正试图找出是谁从Shinola零售店偷走了5块手表。当局说，小偷带走了估计价值3800美元的商品。\n调查人员调出了一段记录这一事件的安全视频。侦探们放大了模糊的视频，并通过面部识别软件对似乎是嫌疑人的人进行了追踪。\n一个热门人物回来了：罗伯特·朱利安-博尔恰克·威廉姆斯(Robert Julian-Borchak Williams)，42岁，来自密歇根州法明顿山庄，位于底特律西北约25英里处。\n今年1月，警方在威廉姆斯的家中停车逮捕了他，当时他站在自家门前的草坪上，面对着他的妻子和两个2岁和5岁的女儿，他们看着父亲被放进巡逻车时哭了起来。\n罗伯特·威廉姆斯被放在审讯室里，警方在他面前放了三张照片：两张是从商店的监控摄像头拍摄的，还有一张是威廉姆斯国家颁发的驾照。\n当我看着那家伙的照片时，我只看到一个大块头的黑人。我看不出有什么相似之处。我觉得他一点也不像我，威廉姆斯在接受NPR采访时说。\n(侦探)翻了翻第三页说，所以我猜电脑也搞错了。我说，好吧，那就是我，威廉姆斯指着一张我以前驾照的照片说到审问侦探时说。但那个人不是我，他说，指的是其他照片。\n威廉姆斯说：我把它捡起来，当着我的面对他说，我希望你不要认为所有的黑人都长得一样。\n威廉姆斯的律师说，威廉姆斯被拘留了30个小时，然后获得保释，直到法庭就此案举行听证会。\n在听证会上，韦恩县检察官宣布撤销对威廉姆斯的指控。\n民权专家表示，威廉姆斯是已知的第一个基于面部识别技术产生的错误命中而被错误逮捕的美国人的例子。\n根据NPR查阅的指控文件，威廉姆斯案的不同寻常之处在于，警方承认，应底特律警察局的要求，密歇根州警察在犯罪实验室实施的面部识别技术促使了逮捕。\n尽管威廉姆斯和他的律师一再声称人工智能产生的比赛是错误的，但威廉姆斯仍被追查为可能的嫌疑人。\n安全摄像头图像中的嫌犯戴着一顶红色的圣路易斯红衣主教帽子。威廉姆斯是底特律人，他说在任何情况下他都不会戴那顶帽子。\n在逮捕他之前，他们甚至从来没有问过他任何问题。他们从未问过他是否有不在场证明。他们从来没问过他有没有红衣主教的帽子。密歇根美国公民自由联盟的菲尔·马约尔律师说，他们从未问过他那天在哪里。\n周三，密歇根州ACLU对底特律警察局提出申诉，要求警方在调查中停止使用该软件。\n底特律警察局在给NPR的一份声明中表示，威廉姆斯案发生后，该部门制定了新的规定。现在，只有静止的照片，而不是安全录像，才能用于面部识别。现在它只在暴力犯罪案件中使用。\n面部识别软件是一种调查工具，仅用于生成线索。底特律警察局警长Nicole Kirkwood在一份声明中说，在逮捕之前，还需要额外的调查工作、佐证和可能的理由。\n在威廉姆斯的案件中，警方要求没有目击抢劫案的商店保安从根据录像拍摄的照片中挑选出嫌疑人，保安选择了威廉姆斯。\n威廉姆斯律师维多利亚·伯顿·哈里斯(Victoria Burton-Harris)在接受采访时表示，她怀疑调查人员是否只将面部识别软件作为几条可能的线索之一。\n伯顿-哈里斯说，当这项技术挑出我的客户的脸时，它就会从那里框定并告知警官随后所做的一切。\n学术和政府研究表明，面部识别系统比白人更容易误认有色人种。\n麻省理工学院研究员、算法正义联盟创始人乔伊·布朗维尼(Joy Buolamwini)对人脸识别中的偏见进行了领先的研究之一。\nBuolamwini说，这种严重的不匹配只是面部识别技术的危险之一，一项又一项的研究已经表明，面部识别技术会让有色人种失败，一般来说，深色皮肤的人比白人同龄人更失败。\n她说，大规模监控对公民自由构成的威胁代价太高。你不能抹去被拘留30小时的经历，孩子们看到父亲被捕的记忆，或者被贴上罪犯标签的耻辱。\n检察官办公室发言人玛丽亚·米勒(Maria Miller)表示，此案因证据不足而被驳回，包括指控是在没有任何现场证人支持的情况下提出的。\n韦恩县检察官凯姆·沃西(Kym Worthy)表示，任何使用面部识别技术的案件都无法在没有其他支持证据的情况下继续进行。\n沃西在给NPR的一份声明中表示，这起案件不应该基于DPD的调查而发布，我们对此表示歉意。谢天谢地，它是在我们办公室主动提出的情况下被驳回的。这丝毫不能弥补威廉姆斯先生在监狱里度过的时间。\n威廉姆斯：让我们假设这个案子不是零售欺诈。如果是强奸或谋杀呢？\n根据乔治敦法律隐私和技术中心的数据，全国至少四分之一的执法机构可以使用人脸识别工具。\n该中心研究员詹姆森·斯皮瓦克(Jameson Spivack)表示，大多数情况下，使用人脸识别被捕的人不会被告知人脸识别是用来逮捕他们的。\n虽然亚马逊、微软和IBM已经宣布停止向执法部门销售人脸识别技术，但斯皮瓦克表示，这不会产生什么影响，因为大多数与警方签订的主要面部识别软件合同都是与规模较小、更专业的公司签订的，比如总部位于南卡罗来纳州的Dataworks Plus公司，这家公司向底特律警察局提供了面部扫描软件。\nDataworks Plus已经向加州圣巴巴拉、芝加哥和费城的政府机构提供了这项技术。\n面部识别技术每天都被消费者用来解锁他们的智能手机，或者在社交媒体上标记朋友。一些机场使用这项技术在乘客登机前对他们进行扫描。\n然而，政府对它的部署引起了隐私倡导者和研究这一机器学习工具的专家的关注，并强调了它的缺陷。\n斯皮瓦克说，一些机动车部门将使用面部识别来检测驾照欺诈和身份盗窃，但最常见的用途是执法，无论是州、地方还是联邦执法部门。\n六个城市已经禁止政府使用面部识别技术。\n让我们假设这个案子不是零售欺诈。如果是强奸或谋杀呢？威廉姆斯说，我会在个人保释金的情况下出狱吗，或者我会回家吗？\n威廉姆斯和他的妻子梅丽莎(Melissa)担心逮捕将对他们的两个年幼的女儿产生长期影响。\n看到他们的父亲被捕，这是他们与警方的第一次互动。所以这肯定会影响他们对执法的看法，梅丽莎·威廉姆斯说。\n在他的起诉书中，威廉姆斯和他的律师说，如果警察部门没有彻底禁止这项技术，那么至少应该从数据库中删除他的照片，这样这种情况就不会再发生了。\n威廉姆斯说，如果有人想调出我的名字来找我，谁会想被视为小偷呢？", "note_en": "Police in Detroit were trying to figure out who stole five watches from a Shinola retail store. Authorities say the thief took off with an estimated $3,800 worth of merchandise.\n  Investigators pulled a security video that had recorded the incident. Detectives zoomed in on the grainy footage and ran the person who appeared to be the suspect through facial recognition software.\n  A hit came back: Robert Julian-Borchak Williams, 42, of Farmington Hills, Mich., about 25 miles northwest of Detroit.\n  In January, police pulled up to Williams&#39; home and arrested him while he stood on his front lawn in front of his wife and two daughters, ages 2 and 5, who cried as they watched their father being placed in the patrol car.\n      Robert Williams was placed in an interrogation room, and police put three photos in front of him: Two photos taken from the surveillance camera in the store and a photo of Williams&#39; state-issued driver&#39;s license.\n  &#34;When I look at the picture of the guy, I just see a big Black guy. I don&#39;t see a resemblance. I don&#39;t think he looks like me at all,&#34; Williams said in an interview with NPR.\n    &#34;[The detective] flips the third page over and says, &#39;So I guess the computer got it wrong, too.&#39; And I said, &#39;Well, that&#39;s me,&#39; pointing at a picture of my previous driver&#39;s license,&#34; Williams said of the interrogation with detectives. &#34; &#39;But that guy&#39;s not me,&#39; &#34; he said, referring to the other photographs.\n  &#34;I picked it up and held it to my face and told him, &#39;I hope you don&#39;t think all Black people look alike,&#39; &#34; Williams said.\n  Williams was detained for 30 hours and then released on bail until a court hearing on the case, his lawyers say.\n  At the hearing, a Wayne County prosecutor announced that the charges against Williams were being dropped.\n  Civil rights experts say Williams is the first known example of an American wrongfully arrested based on a false hit produced by facial recognition technology.\n    What makes Williams&#39; case extraordinary is that police admitted that facial recognition technology, conducted by Michigan State Police in a crime lab at the request of the Detroit Police Department, prompted the arrest, according to charging documents reviewed by NPR.\n  The pursuit of Williams as a possible suspect came despite repeated claims by him and his lawyers that the match produced by artificial intelligence was faulty.\n  The alleged suspect in the security camera image was wearing a red St. Louis Cardinals hat. Williams, a Detroit native, said he would under no circumstances be wearing that hat.\n  &#34;They never even asked him any questions before arresting him. They never asked him if he had an alibi. They never asked if he had a red Cardinals hat. They never asked him where he was that day,&#34; said lawyer Phil Mayor with the ACLU of Michigan.\n  On Wednesday, the ACLU of Michigan  filed a complaint against the Detroit Police Department asking that police stop using the software in investigations.\n  In a statement to NPR, the Detroit Police Department said after the Williams case, the department enacted new rules. Now, only still photos, not security footage, can be used for facial recognition. And it is now used only in the case of violent crimes.\n  &#34;Facial recognition software is an investigative tool that is used to generate leads only. Additional investigative work, corroborating evidence and probable cause are required before an arrest can be made,&#34; Detroit Police Department Sgt. Nicole Kirkwood said in a statement.\n  In Williams&#39; case, police had asked the store security guard, who had not witnessed the robbery, to pick the suspect out of a photo lineup based on the footage, and the security guard selected Williams.\n  Victoria Burton-Harris, Williams&#39; lawyer, said in an interview that she is skeptical that investigators used the facial recognition software as only one of several possible leads.\n  &#34;When that technology picked my client&#39;s face out, from there, it framed and informed everything that officers did subsequently,&#34; Burton-Harris said.\n  Academic and  government studies have demonstrated that facial recognition systems misidentify people of color more often than white people.\n  One of the  leading studies on bias in face recognition was conducted by Joy Buolamwini, an MIT researcher and founder of the Algorithmic Justice League.\n  &#34;This egregious mismatch shows just one of the dangers of facial recognition technology which has already been shown in study after study to fail people of color, people with dark skin more than white counterparts generally speaking,&#34; Buolamwini said.\n  &#34;The threats to civil liberties posed by mass surveillance are too high a price,&#34; she said. &#34;You cannot erase the experience of 30 hours detained, the memories of children seeing their father arrested, or the stigma of being labeled criminal.&#34;\n  Maria Miller, a spokeswoman for the prosecutor&#39;s office, said the case was dismissed over insufficient evidence, including that the charges were filed without the support of any live witnesses.\n  Wayne County Prosecutor Kym Worthy said any case forwarded to her office that uses facial recognition technology cannot move forward without other supporting evidence.\n  &#34;This case should not have been issued based on the DPD investigation, and for that we apologize,&#34; Worthy said in a statement to NPR. &#34;Thankfully, it was dismissed on our office&#39;s own motion. This does not in any way make up for the hours that Mr. Williams spent in jail.&#34;\n    Williams: &#34;Let&#39;s say that this case wasn&#39;t retail fraud. What if it&#39;s rape or murder?&#34;\n  According to Georgetown Law&#39;s Center on Privacy and Technology,  at least a quarter of the nation&#39;s law enforcement agencies have access to face recognition tools.\n  &#34;Most of the time, people who are arrested using face recognition are not told face recognition was used to arrest them,&#34; said Jameson Spivack, a researcher at the center.\n  While Amazon, Microsoft and IBM have  announced a halt to sales of face recognition technology to law enforcement, Spivack said that will have little effect, since most major facial recognition software contracts with police are with smaller, more specialized companies, like South Carolina-based DataWorks Plus, which is the company that supplied the Detroit Police Department with its face-scanning software.\n    DataWorks Plus has supplied the technology to government agencies in Santa Barbara, Calif., Chicago and Philadelphia.\n  Facial recognition technology is used by consumers every day to  unlock their smartphones or to  tag friends on social media. Some airports  use the technology to scan passengers before they board flights.\n     Its deployment by governments, though, has drawn concern from privacy advocates and experts who study the machine learning tool and have highlighted its flaws.\n  &#34;Some departments of motor vehicles will use facial recognition to detect license fraud, identity theft, but the most common use is law enforcement, whether it&#39;s state, local or federal law enforcement,&#34; Spivack said.\n  The government use of facial recognition technology has been banned in half a dozen cities.\n    &#34;Let&#39;s say that this case wasn&#39;t retail fraud. What if it&#39;s rape or murder?  Would I have gotten out of jail on a personal bond, or would I have ever come home?&#34; Williams said.\n  Williams and his wife, Melissa, worry about the long-term effects the arrest will have on their two young daughters.\n  &#34;Seeing their dad get arrested, that was their first interaction with the police. So it&#39;s definitely going to shape how they perceive law enforcement,&#34; Melissa Williams said.\n  In his complaint, Williams and his lawyers say if the police department won&#39;t ban the technology outright, then at least his photo should be removed from the database, so this doesn&#39;t happen again.\n  &#34;If someone wants to pull my name and look me up,&#34; Williams said, &#34;who wants to be seen as a thief?&#34;", "posttime": "2020-06-25 05:50:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "导致,recognition,技术", "title": "面部识别导致底特律黑人男子被错误逮捕", "title_en": "Facial Recognition Leads To False Arrest Of Black Man In Detroit", "transed": 1, "url": "https://www.npr.org/2020/06/24/882683463/the-computer-got-it-wrong-how-facial-recognition-led-to-a-false-arrest-in-michig", "via": "", "real_tags": ["导致", "技术"]}, {"category": "", "categoryclass": "", "imagename": "e78b3f956cf4cfd6d8ad71a62bf0367d.jpg", "infoid": 1008024, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "联邦调查局(FBI)可能会关注你在推特上发布的内容以及人们聚集的地点。\n联邦执法机构的记录显示，越来越重视利用私营部门的最新工具进行大规模监控，包括最近与监控社交媒体帖子和收集手机位置数据的公司签订的合同。\n5月26日，随着全国各地爆发针对警察杀害乔治·弗洛伊德(George Floyd)的示威活动，联邦调查局(FBI)签署了一项快速协议，延长了与监控社交媒体的公司Datminr的关系。\n几天后，该机构修改了2月份与Venntel，Inc.签署的一项协议，Venntel，Inc.是一家弗吉尼亚州的技术公司，负责绘制和销售数百万美国人的行动图。该公司购买大量位置数据，并将其大部分出售给政府机构。\n长期以来，美国联邦调查局(FBI)一直在追求先进的技术工具，以快速预测犯罪并定位潜在嫌疑人，这些能力引发了人们的担忧，即该机构的目标是合法形式的抗议和自由表达。今年早些时候，该机构发布了一份技术解决方案的投标提案，目的是“通过合法收集/获取的社交媒体数据，及早获得正在进行的国家安全和公共安全相关事件的警报。”\n目前还不清楚2月份的Venntel合同是如何修改的。Venntel总裁克里斯·吉尔迪亚(Chris Gildea)没有回复记者的置评请求。该公司是肉汤分析公司(Gravy Analytics)的子公司，后者是一家主要的数据经纪公司，向广告商和其他客户出售位置跟踪信息。“由于这项工作的保密性”，后者也拒绝置评。联邦调查局的一位发言人也拒绝对这篇文章发表评论。\nDatminr已经与FBI签订了价值超过100万美元的合同，它监控社交媒体上的突发新闻和事件。Datminr的一位发言人在一份声明中指出：“Datminr向FBI提供First Alert，这是一种在自然灾害、火灾、爆炸和枪击等紧急事件时提供突发新闻警报的产品。”\n声明称，该服务“旨在从技术上限制所有形式的监控，并遵守社交媒体平台的用户保护和数据使用政策。”\n美国联邦调查局(FBI)局长克里斯托弗·雷(Christopher Wray)警告说，“今天的恐怖主义以社交媒体的速度移动。”在去年的证词中，雷告诉立法者，来自“从无政府主义组织到出于种族动机的暴力极端组织的一切”的威胁往往“大多是从网上开始的”。\n但该机构的批评者担心，新的覆盖范围可能会侵犯第一修正案保护的言论。\n美国朋友服务委员会的社区反对伊斯兰恐惧症项目协调员玛丽·泽克尔(Mary Zerkel)说：“我们对联邦调查局正在进一步扩大他们的监视能力深感担忧。”\n“几十年来，联邦调查局一直使用监视和种族定性来攻击穆斯林、移民、有色人种、一般活动人士，特别是黑人活动人士。AFSC本身就有大量的FBI档案，“泽克尔补充道。“大量数据收集工具只会进一步将抗议和言论自由定为刑事犯罪，并扩大对穆斯林和有色人种的刑事化。”\n几乎没有法规限制位置跟踪数据的使用，位置跟踪数据是许多普通手机应用程序收集并盈利的一种数据收集形式。最高法院2018年卡彭特诉美国案(2018 Carpenter v.United States)裁定，政府检察官需要搜查令才能从服务提供商那里获取手机位置数据。但许多专家担心，这项裁决可能不适用于Venntel等第三方数据经纪商。\nThe Intercept报道称，自最近的街头示威浪潮以来，联邦调查局(FBI)特工讯问了至少一名个人，因为他只是开玩笑地在推特上说自己是“Antifa”的成员，他指的是在一些极左翼活动人士中流行的一种暴力激进主义风格。联合恐怖主义特别工作组的成员也在家中询问抗议组织者-有时是在社交媒体上发布活动后的几个小时内。\n近年来，联邦调查局还利用了其他著名的监控公司，包括Palantir，该公司开发工具，使用从社交媒体到车牌号的一系列信息来可视化关系。\n但是，通过Venntel这样的公司拥抱强大的海量位置数据代表着该机构潜在的新纪元。\n华尔街日报率先报道，美国国税局(Internal Revenue Service)和美国移民和海关执法局(U.S.Imperation And Customer Execution)等政府机构已分别利用Venntel进行税收和移民执法。最初的报道发布后，据报道，俄勒冈州民主党参议员罗恩·怀登(Ron Wyden)联系了该公司，询问联邦政府使用这项技术的情况--但该公司拒绝回答大多数问题。\n等等！在你继续你的一天之前，问问自己：如果没有“拦截”，你刚刚读到的故事有多大可能是由另一家新闻机构制作的？想想如果没有“拦截”，媒体界会是什么样子。谁会让党内精英对他们宣称的价值观负责？如果我们的记者不在现场，有多少隐蔽的战争、司法不公和反乌托邦的技术还会被隐藏？我们所做的那种报道对民主是必不可少的，但它不容易、不便宜，也不有利可图。The Intercept是一家独立的非营利性新闻机构。我们没有广告，所以我们依赖我们的会员-35000人，而且还在增加-来帮助我们追究有权势的人的责任。加入很简单，而且不需要花很多钱：你只需每月3到5美元就可以成为维系会员。这就是支持你所依赖的新闻业所需要的一切。成为国际货币基金组织的成员", "note_en": "The Federal Bureau of Investigation may be watching what you tweet and where people gather.\n The federal law enforcement agency’s records show a growing focus on harnessing the latest private sector tools for mass surveillance, including recent contracts with companies that monitor social media posts and collect cellphone location data.\n On May 26, as demonstrations around the country erupted over the police killing of George Floyd, the FBI signed an  expedited  agreement to extend its relationship with Dataminr, a company that monitors social media.\n A few days later, the agency  modified an agreement it signed in February with Venntel, Inc., a Virginia technology firm that maps and sells the movements of millions of Americans. The company purchases bulk location data and sells it largely to government agencies.\n  The FBI has long pursued advanced technological tools to rapidly predict crime and locate potential suspects, capabilities that have raised concerns that the agency targets lawful forms of protest and free expression. Earlier this year, the agency  released a bid proposal for technological solutions to “obtain early alerts on ongoing national security and public safety-related events through lawfully collected/acquired social media data.”\n It’s not clear exactly how the February Venntel contract was modified. Chris Gildea, the president of Venntel, did not respond to a request for comment. The company is a subsidiary of Gravy Analytics, a major data broker that sells location-tracking information to advertisers and other clients, which also declined to comment “due to the confidential nature of that work.” A spokesperson for the FBI also declined to comment for this article.\n Dataminr, which already held contracts with the FBI worth over $1 million, monitors social media for breaking news and events. “Dataminr provides the FBI with First Alert, a product that delivers breaking news alerts on emergency events, such as natural disasters, fires, explosions and shootings,” noted a spokesperson for Dataminr in a statement.\n The statement claimed that the service “was designed and built to technologically restrict all forms of surveillance and be compliant with the user protection and data use policies of social media platforms.”\n Christopher Wray, the director of the FBI, has warned that “terrorism today moves at the speed of social media.” During testimony last year, Wray  told lawmakers that threats from “everything from anarchist groups to racially-motivated violent extremist groups” tend to “begin mostly online.”\n But critics of the agency are concerned that the new reach could encroach upon First Amendment-protected speech.\n “We are deeply concerned that the FBI is further expanding their surveillance capacity,” said Mary Zerkel, coordinator of the American Friends Service Committee’s Communities Against Islamophobia program.\n “The FBI has for decades used surveillance and racial profiling to target Muslims, immigrants, people of color, activists in general, and Black activists in particular. AFSC itself has a substantial  FBI file,” added Zerkel. “Mass data collection tools will only serve to further criminalize protests and free speech, and expand the criminalization of Muslims and people of color.”\n Few regulations exist to restrict the use of location-tracking data, a form of data collection that many common phone applications collect and monetize. The Supreme Court’s 2018 Carpenter v. United States ruled that government prosecutors require a warrant to obtain cellphone location data from service providers. But many experts worry that the ruling  may not apply to third-party data brokers such as Venntel.\n The Intercept has  reported that since the recent wave of street demonstrations, FBI agents have questioned at least one individual for simply tweeting in jest that they are members of “antifa,” a reference to a style of violent activism popular among some on the activist far-left. Members of the Joint Terrorism Task Force  have also questioned protest organizers at their homes — sometimes within hours of posting an event on social media.\n The FBI has tapped other notable surveillance firms in recent years, including Palantir, which builds tools to visualize relationships using an array of information, from social media to license plate numbers.\n But the embrace of powerful mass location data through a firm such as Venntel represents a potential new era for the agency.\n The Wall Street Journal was the first to  report that government  agencies such as the Internal Revenue Service and U.S. Immigration and Customs Enforcement had tapped Venntel for tax and immigration enforcement, respectively. After the initial story ran, Sen. Ron Wyden, D-Ore.,  reportedly reached out to the company to inquire about the federal government’s use of the technology — but that the company declined to answer most questions.\n Wait! Before you go  on about your day, ask yourself: How likely is it that the story you just read would have been produced by a different news outlet if The Intercept hadn’t done it?Consider what the world of media would look like without The Intercept. Who would hold party elites accountable to the values they proclaim to have? How many covert wars, miscarriages of justice, and dystopian technologies would remain hidden if our reporters weren’t on the beat?The kind of reporting we do is essential to democracy, but it is not easy, cheap, or profitable. The Intercept is an independent nonprofit news outlet. We don’t have ads, so we depend on our members — 35,000 and counting — to help us hold the powerful to account. Joining is simple and doesn’t need to cost a lot: You can become a sustaining member for as little as $3 or $5 a month. That’s all it takes to support the journalism you rely on.  Become a Member", "posttime": "2020-06-25 05:49:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "手机,扩展,expands", "title": "FBI扩展收集手机位置数据、监控社交媒体的能力", "title_en": "FBI Expands Ability to Collect Cellphone Location Data, Monitor Social Media", "transed": 1, "url": "https://theintercept.com/2020/06/24/fbi-surveillance-social-media-cellphone-dataminr-venntel/", "via": "", "real_tags": ["手机", "扩展", "expands"]}]