[{"category": "", "categoryclass": "", "imagename": "be304daf71949fc6d150cdd49dee6fe6.jpg", "infoid": 1008311, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大型强子对撞机是人类有史以来建造的最强大的粒子对撞机，它位于一条27公里长的巨大隧道中，隧道延伸到瑞士和法国的乡村。人们经常忽略的是，这条隧道是为早期的硬件--大型电子-正电子对撞机(LEP)建造的。LEP是专门为研究Z玻色子提供一种干净的方法而建造的；后来才将其改装成高能质子对撞机，使希格斯玻色子得以发现。\n现在，欧洲正式承诺采取类似的方法：在欧洲核子研究中心(CERN)设施中建造一条巨大的隧道，使粒子相互碰撞，从而能够对希格斯玻色子进行干净的研究。但欧洲保留了将隧道用于未来对撞机的选择，该对撞机的能量可能比大型强子对撞机高出近10倍。\n电子和正电子是基本粒子；据我们所知，它们没有更小的粒子组成它们。这使得它们的碰撞非常干净。相比之下，大型强子对撞机碰撞的质子是由一组夸克和胶子组成的，这使得它们的碰撞成为一组复杂的亚碰撞，很难解释。\n这使得电子和正电子成为粒子详细表征的更好候选者。但它们不太利于发现。当粒子被迫绕着圆形对撞机的弯曲路径移动时，它们会辐射出一些能量，导致它们减速。这限制了碰撞所能达到的能量。这就是为什么欧洲核子研究中心用大型强子对撞机取代了LEP；质子，由于它们的质量较大，在圆形对撞机的曲线上损失的能量较少。因此，它们可以被提升到更高的能量。", "note_en": "The Large Hadron Collider, the most powerful particle collider humanity has ever built, resides in an enormous, 27-kilometer-long tunnel that extends under the Swiss and French countrysides. What&#39;s often overlooked is that the tunnel was built for an earlier piece of hardware, the  Large Electron-Positron collider, or LEP. LEP had been built specifically to provide a clean way to study the Z boson; only later was it converted to a higher-energy proton collider that enabled the discovery of the Higgs boson.\n Now, Europe is  officially committing to taking a similar approach: building a huge tunnel at the CERN facility that will collide particles to enable a clean study of the Higgs boson. But Europe is leaving the option of using the tunnel for a future collider that could reach energies nearly 10 times higher than the LHC.\n  Electrons and positrons are fundamental particles; as far as we know, they have no smaller particles that comprise them. That makes their collisions extremely clean. The protons collided by the LHC, in contrast, are composed of a collection of quarks and gluons, making their collisions a complicated collection of sub-collisions that can be challenging to interpret.\n That makes electrons and positrons better candidates for the detailed characterization of particles. But they&#39;re less good for discovery. As particles are forced to travel around the curved paths of circular colliders, they radiate away some energy, causing them to slow down. This limits the energy that collisions can reach. And that&#39;s why CERN replaced LEP with the Large Hadron Collider; protons, thanks to their larger mass, lose less of their energy in the curves of a circular collider. As such, they can be boosted to much higher energy.", "posttime": "2020-06-26 06:50:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "对撞机,officially", "title": "欧洲正式将目光投向大型大型强子对撞机的继任者", "title_en": "Europe officially sets its sights on a giant LHC successor", "transed": 1, "url": "https://arstechnica.com/science/2020/06/europe-officially-sets-its-sights-on-a-giant-lhc-successor/", "via": "", "real_tags": ["对撞机"]}, {"category": "", "categoryclass": "", "imagename": "1ed6dc6e60bcbb9f2a845239085b72f3.jpeg", "infoid": 1008310, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在副新闻报道了该服务器的存在后，“不和谐”认定该服务器违反了他们“威胁和鼓励暴力”的社区指导方针。", "note_en": "Discord determined the server violates their community guidelines for “threatening and encouraging violence” after VICE News reported its existence.", "posttime": "2020-06-26 06:49:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "服务器,violence", "title": "不和谐刚刚关闭了最大的煽动暴力的‘Boogaloo’服务器|在副新闻报道了该服务器的存在后，不和谐认定该服务器违反了他们“威胁和鼓励暴力”的社区指导方针。", "title_en": "Discord Just Shut Down the Biggest ‘Boogaloo’ Server for Inciting Violence | Discord determined the server violates their community guidelines for “threatening and encouraging violence” after VICE News reported its existence.", "transed": 1, "url": "https://www.vice.com/en_us/article/akzkep/discord-just-shut-down-the-biggest-boogaloo-server-for-inciting-violence", "via": "", "real_tags": ["服务器", "violence"]}, {"category": "", "categoryclass": "", "imagename": "c89d1acbb7fb23b0855f7238b0db505a.jpg", "infoid": 1008309, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家初创公司是加速器Y Combinator 2020年冬季计划的一部分，它还宣布已经从Twitch联合创始人凯文·林、SignalFire、YC、CRV和Coatue那里筹集了460万美元的种子资金。\n联合创始人兼联合首席执行官埃里克·魏非常了解创作者世界，这要归功于他在Instagram Live担任产品经理的时间。(他的联合创始人威尔·金之前是种子基金Lucky Capital的投资者。)。魏告诉我，虽然许多创作者有可观的收入，但银行很少了解他们的业务，或者在他们需要资金的时候给他们提供优惠的条件。\n“传统银行非常关心FICO(信用评分)，”他说，“很多YouTuber，当他们爆炸时，他们没有时间思考：让我确保我的FICO也很棒。”\n与此同时，他辩称，创作者们已经对潜在的欺诈性财务报价产生了怀疑，以至于如果你参加VidCon之前的VidCon，并试图发放3000美元，“好的创作者不会接受，即使你告诉他们没有任何条件。”这句话的意思是：“如果你参加VidCon之前的视频会议，并试图发放3000美元，优秀的创作者也不会接受，即使你告诉他们背后没有任何条件。”\n有了卡拉特黑卡，这家初创公司为创建者提供了一张信用卡，他们可以用来支付与业务相关的费用。当创作者获得批准后，他们将获得250美元的奖金，这笔奖金可以用于未来购买任何电子产品或设备。这张卡还配有定制设计，购买后可返还2%至5%的现金，甚至还提供赞助费预付款。\n魏说，在背后，Karat已经开发出一种为创作者工作的承保模式。Karat关注的不是信用评分，而是创作者的追随者规模、他们目前的收入，以及他们是否“精通商业”。\n“不只是你有多少粉丝，还有什么平台，”魏补充道。“我宁愿在YouTube上拥有10万订户，也不愿在TikTok上拥有100万订户，因为在TikTok上，一切都是由算法驱动的。”\n卡拉特已经向包括The Russian Badger、TierZoo和Nas Daily在内的首批创作者提供了这张卡。张伟表示，到目前为止，这种模式还在运行，没有默认设置。\n目前，这张卡针对的是拥有至少10万粉丝的专业、全职创作者。魏估计，这是100万创作者的潜在客户群。最终，他希望为这些创作者提供的不仅仅是一张黑卡。\n“我们正在建立一种垂直的金融和商业运营经验，”他说。“处于早期阶段的人，我们确实希望最终能接触到他们，但只有在我们觉得我们已经发展了足够的承保模式之后。”", "note_en": "The startup, which was part of accelerator  Y Combinator’s Winter 2020 batch, is also announcing that it has raised $4.6 million in seed funding from Twitch co-founder Kevin Lin, SignalFire, YC, CRV and Coatue.\n Co-founder and co-CEO Eric Wei knows the creator world well, thanks to his time as product manager for Instagram Live. (His co-founder Will Kim was previously an investor with seed fund Lucky Capital.) Wei told me that although many creators have significant incomes, banks rarely understand their business or offer them good terms when they need capital.\n  “Traditional banks care a lot about FICO [credit scores],” he said. “A lot of YouTubers, when they’re blowing up, they don’t have time to think: Let me make sure my FICO is awesome as well.”\n At the same time, he argued that creators have become suspicious of potentially scammy financial offers, to the point that if you were to attend a pre-COVID VidCon and tried to give out $3,000, “The good creators will not take it, even if you tell them there are no strings behind it.”\n  With the Karat Black Card, the startup is giving creators a credit card that they can use for their business-related expenses. When creators are approved, they receive a $250 bonus that can be applied to any future purchases of electronics or equipment. The card also comes with custom designs, 2% to 5% cash back on purchases and it even offers advances on sponsorship payments.\n Underlying it, Wei said Karat has developed an underwriting model that works for creators. Instead of looking at credit scores, Karat focuses on the size of a creator’s following, their current revenue and whether or not they’re “business savvy.”\n “It’s not just the number of followers you have, but what platforms,” Wei added. “I would rather have 100,000 subscribers on YouTube than 1 million on TikTok, because on TikTok, it’s all algorithmically driven.”\n Karat has already provided the card to an initial group of creators, including  TheRussianBadger,  TierZoo and  Nas Daily. Wei said the model is working so far, with no defaults.\n For now, the card is aimed at professional, full-time creators who have at least 100,000 followers. Wei estimated that that’s a potential customer base of 1 million creators. Eventually, he wants to provide those creators with more than a black card.\n “We’re building a vertical financial and biz ops  experience,” he said. “People in earlier stages, we do want to get to them eventually, but only after we feel like we’ve developed enough of an underwriting model.”", "posttime": "2020-06-26 06:49:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推出,launches,创作者", "title": "\nKarat为在线创建者推出信用卡", "title_en": "\n\t\t\t\tKarat launches a credit card for online creators\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/karat-black-card/", "via": "", "real_tags": ["推出", "launches", "创作者"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008308, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转搜索此页面简而言之：我们要求维基媒体基金会暂停或停止其当前的运动重命名活动，原因是当前的品牌重塑过程中持续存在的缺陷。今后的工作只应以确保公平决策的方式重新开始。\n20年来，志愿者已经建立了维基百科作为一个独立的、社区驱动的资源的良好声誉。维基媒体运动项目，包括维基百科，依靠权力下放和共识而蓬勃发展。维基媒体基金会、附属机构和个人贡献者之间的明确区别是至关重要的。任何影响这种平衡的变化都需要社区的知情同意和合作。因此，看到维基百科以组织和运动的名义呈现，尽管社区普遍不满，这是非常令人担忧的。\n由于2030年运动品牌项目的流程缺陷，我们签名人要求立即暂停维基媒体基金会的更名活动。\n项目规划和概念开发过程中的风险评估：[1]成本高，收益不明显。更名构成了一种破坏性的变化，并没有显示出与承诺的结果之间的明确联系。[2]维基百科的分支机构担心在项目范围之外使用“维基百科”的危险，没有找到足够的保证和支持。[3]。\n社区认同感的高风险。在评估命名选项时，这些都被忽略了。2015年，维基媒体基金会(Wikimedia Foundation)指出，维基媒体是一种根深蒂固的社区身份。更名对社区凝聚力和参与度有影响。然而，它未能将这些关注带到整个过程和调查中。\n对维基媒体社区的尊重和包容：误解和混乱。维基媒体基金会(Wikimedia Foundation)的不明确假设导致了人们对品牌过程缺乏信心。[5][6][7]。\n有问题的评估和反馈汇总。指标的选择，特别是在2019年8月的社区审查中，使这一过程的前提和合法性受到质疑。[8][9][10][11]。\n忽视维基媒体社区的观点。正式和非正式渠道，包括征求意见[12]和民意测验[13][14]，都表明这一进程存在明显问题。目前的品牌调查集中在维基媒体基金会的名字上，这个名字在这些社区咨询中遭到了压倒性的反对。\n因此，我们要求董事会和维基媒体基金会暂停或停止更名活动。\n今年，维基媒体运动中的每一项主要活动都被推迟或推迟了-全球维基会议、维基媒体基金会董事会选举、维基媒体峰会和战略工作组。以同样的关注度和关注度对待重命名是合适的。今后的任何工作都应以支持所有利益攸关方公平决策的方式重新开始。[15]。\n签名者：任何同意这封信的人，作为个人或代表附属组织。\n格式：代销商名称(如果代表代销商签名)、名称(用户名)、从属关系或项目。\n俄罗斯西北部维基-历史学家用户组-Nikolai Bulykin(用户：Красный)，Ekaterina Borisova(用户：ЕкатеринаБорисова)。\nEffeietsanders(Talk)2020年6月23日18：15(UTC)-nlwiki，Commons，前理事和前分会董事会成员。\nFerdi 2005[Mail]18：18,2020(UTC)-it.Wikipedia回滚和移动，it.wikinews管理员，元海量消息发送者，维基媒体意大利区域协调员Apulia。\nBlue Rasberry(Talk)2020年6月23日18：25(UTC)-Wiki Medicine，LGBT+，Cascadia，驻留\n协调世界时(Фред-Продавецзвёзд)2020年6月23日18：53-俄罗斯Crossswki社区成员。\n-Anatoliy(Talk)，2020年6月23日18：55(UTC)-乌克兰维基百科编辑，Commons&39；sysop，WMUA成员。\n--Alexander(Talk)，2020年6月23日19：03(UTC)-俄罗斯和英语维基旅行的管理员，维基爱地球/纪念碑的组织者。\n-Base(Talk)19：10,2020(UTC)-乌克兰Wikipedian，乌克兰Wikinewsie，Meta-Wiki sysop，Wikimedia Steward，Wikimedia Commons贡献者和UploadWizard活动编辑，翻译多个Wikimedia项目的管理员，Wikimedia OTRS成员，WMUA董事会成员。\n巴斯蒂克☎呼叫我！2020年6月23日19：11(协调世界时)-老人和长期用户仍在社区投资。\n-马库斯·塞隆(谈话)2020年6月23日19：20(UTC)15年维基解密。2008年的佐德勒·梅德尔和2016年的荣誉维基猫头鹰。项目。这必须结束，去他妈的社区，他们代表WMF关心他们的心态。\n--忍者✮Strikers«☎»2020年6月23日19：26(协调世界时)-缅甸维基解密。\nNAḥum(Talk)2020年6月23日19：34(协调世界时)-he.wikiource.org的高级志愿者和官僚\nTohaomgTohaomg(Talk)，2020年6月23日19：48(UTC)-维基媒体乌克兰董事会成员(但以个人身份签名)，OTRS成员，乌克兰语和英文维基百科编辑，维基数据和维基媒体共享，维基媒体技术社区的积极参与者。\n我并不完全同意这封信的所有观点，但我完全同意整个过程应该改进的主要观点。V IGNERON*剖切。2020年6月23日(协调世界时)20：00。\nAndrew Krizhanovsky(Talk)2020年6月23日20：15(UTC)ruwikt和ruwikUniversity管理员，下议院和ruwiki编辑。\n-Ymbrater(Talk)2020年6月23日20：30(UTC)英文维基百科、维基百科共享、维基数据(也是官僚)和俄语维基旅行的管理员。\nWutsje(Talk)21：17,2020(UTC)--nlwiki、fywiki和Commons上的管理员，前管家。\n--Ehrlich91(Talk)，2020年6月23日21：35(UTC)-马其顿维基百科管理员，公共资源和维基数据编辑，共享知识董事会成员兼财务主管。\n-Jalu(Talk)22：03,2020年6月23日(UTC)Wikipedia eswiki，Wikiquote的sysop，董事会受托人WMA和MLUG。\n维基13 22：21,2020 6月23日(UTC)荷兰语维基百科编辑器&管理员和SWMT的交叉维基\nAmir(Talk)2020年6月23日22：27(UTC)，fawiki&amp；wikidata管理员，全球重命名者，CU，fawiki监督和官僚。\nImzadi，1979-→23：18,2020(协调世界时)恩维基15年编辑，公共资源、维基资源和维基数据的贡献者。\n豪尔赫·阿贝兰(Jorge Abellán，Talk)，2020年6月23日23：54(UTC)，维基新闻(Wikinews)管理员，公共、维基数据(Wikidata)撰稿人，维基新闻(Wikinews)和维基旅行(Wikivoyage)设计师。\n-Ganímedes(Talk)00：32,2020年6月24日(UTC)eswiki编辑，Commons的贡献者，OTRS代理，在150多个其他项目中编辑。\n···🌸Rachmat04·☕02：09,2020年6月24日(协调世界时)，印度尼西亚维基百科，公共资源和维基数据编辑。\n-Pólux(σ)2020年6月24日02：12(协调世界时)eswiki编辑兼前管理员。\n-Hrishikes(Talk)2020年6月24日02：29(UTC)-英文Wikiource管理员，孟加拉语Wikiource编辑，英文维基百科，Wikidata，Wikimedia Commons。\n❙❚❚❙❙JinOy❚❙❚❙❙✉04：41,2020年6月24日(协调世界时)-en，ml-维基百科编辑，维基数据，维基公有媒体\nGangulybiswarup(Talk)，2020年6月24日04：47(UTC)，10年Commons撰稿人，enwiki编辑，bnwiki，西孟加拉邦维基用户组创始成员。\n-Ananth Subray(Talk)，2020年6月24日04：51(UTC)，Kannada Wikipedia编辑器，2020年6月23日17：44(UTC)。\nSEIV(Talk)，Wikidata、英文Wikipedia和Wikimedia Commons的贡献者，Tagalog Wikipedia的官僚。\n.mau.。✉07：52,2020年6月24日(it.wikipedia，it.wikiource，以及其他项目PASSIM)btw，重命名wmf而不重命名章节将导致更多的混乱。\nde Wikichim(Talk)，2020年6月24日08：04(UTC)几个维基媒体项目的编辑和撰稿人，特别是荷兰语项目。\nPavanaja(Talk)2020年6月24日08：09(UTC)Kannada Wikipedia的Sysop和官僚，自2004年以来一直在Tulu Wikipedia的Sysop，Wikipedian，各种Wikimedia项目的贡献者。\nCiv？(Talk)2020年6月24日08：11(UTC)意大利维基百科的SYSOP和官僚，自2004年以来一直是OTR，维基百科的成员，各种维基媒体项目的贡献者。\nStryn(Talk)2020年6月24日09：06(UTC)：芬兰维基百科、维基数据和元维基的管理员。维基媒体管家。\n-Camelia(Talk)，2020年6月24日(UTC)10：56。我作为联属联络员签约，我也以个人身份签约为简单用户。维基百科自2007年以来：itwiki，rowiki，enwiki，wikidata，commons，wikiquote，wikibook。\n-Darwin Ahoy！2020年6月24日(UTC)12：00在Commons的sysop和wiki.pt，Wikidata的定期编辑，OTRS团队的成员。\nRocky Masum(Talk)2020年6月24日14：00(UTC)Wikimedia Commons，孟加拉维基百科管理员，维基媒体孟加拉国EC成员。\n···Peter(Southwood)(Talk)：15：51,2020(UTC)EN上的管理员：维基百科和EN：维基旅行，各种其他项目的贡献者。\nZanaq(Talk)2020年6月24日16：56(UTC)-活跃在荷兰语维基百科和共享区。\nHsarrazin(Talk)2020年6月24日17：19(UTC)-frwikiource上的管理员，公共资源和维基数据的贡献者。\n虽然重新审视品牌可能是有必要的，但这一过程弊大于利。现在是时候退一步，重新评估，带着新的想法和对维基媒体社区更好的理解回到谈判桌上来。AntiCompositeNumber(Talk)17：29,2020(UTC)Enwiki and Commons上的编辑和一名OTRS志愿者。\n-Novak Watchman(Talk)，2020年6月24日17：35(UTC)：一名南斯拉夫跨维基编辑；六个不同塞尔维亚维基媒体项目的管理员、界面管理员和官僚。\n--BradPatrick(Talk)18：48,2020年6月24日(UTC)前WMF临时执行董事兼第一总法律顾问；我签署了PUGLE GLOBE商标申请。\n菲比|2020年6月24日18：54(UTC)(作为个人)；前WMF董事会成员；维基百科指导委员会；en.wp，维基数据。\n-Túrelo(Talk)20：29,2020年6月24日(UTC)--：de编辑自2006年以来，下议院管理自2008年以来。\nLtPower(Talk)21：28,2020(UTC)-英文维基百科，英文维基旅行官僚，维基公有媒体。\n--Ysogo(Talk)21：34,2020年6月24日(UTC)-：IT，自2006年以来使用，Meta-Wiki上的翻译-管理员。\n-Yoggysot(Talk)，2020年6月24日(UTC)it.wiki上的编辑，自2007年以来在Commons上。\n--Phyrexianɸ2020年6月25日05：00(协调世界时)意大利维基百科系统，活跃在公共资源、维基数据、皮德蒙特维基百科等许多网站上。\n--g(Talk)2020年6月25日08：58(UTC)it.wiki sysop，OTRS团队成员，前WMI地区协调员\n-Thibaut(Talk)2020年6月25日10：12(UTC)Wikimedia Commons和法语Wiktionary管理员，也是OTRS成员。\n--C.CRISPUS(Talk)2020年6月25日10：55(UTC)-it.wiki用户，在Commons上活跃，Wikidata在其他地方。\nSimon Villeneuve，11：27,2020年6月25日(UTC)-Wikimedia用户，主要在Wikidata，frwiki，但也在Commons，Wikiquote，Wiktionary，Wikiource，Wikinews，Wikibook上。获取图书馆知识的大门并不只有一扇。\nNosebagbear(谈话)2020年6月25日14：45(UTC)OTRS代理(特别关注)和en-wiki管理员。\n-Daniel Mietchen(Talk)，2020年6月25日16：33(UTC)-策划跨维基媒体项目的研究相关内容。\nDas-g(Talk)16：52,2020 6月25日(UTC)，多个维基媒体项目的用户和断断续续的贡献者。\n-Nitraus(Talk)17：25,2020年6月25日(UTC)，在芬兰维基百科工作14年，在那里担任Sysop 8年，在Fi-Wikiquote担任Sysop，EN-Wikipedia，Wikidata&amp；Commons的撰稿人，其他几个不太频繁的人。\nXANA(Talk)2020年6月25日17：38(UTC)主要活跃在ES-wiki，对其他项目有零星的贡献者。admin en es-wiki。\n--轻拍。(TALK)2020年6月25日18：27(UTC)Long-Time-Wikipedian(自从有WMF之前)-DAB。(谈话)2020年6月25日18：27(UTC)。\n--[[]]21：30，6月25日(UTC)。我童年花了很多时间破坏维基百科。现在偶尔做点贡献吧。\n↑幻灯片：2015年11月品牌团队提交给董事会的文件(2015年至2011年)。在2020-06-20与附属公司的视频通话中，Zack McCune(WMF品牌总监)同意这些标准缺失，应该以某种方式将其纳入诉讼程序。\n↑Meta：请求置评-基金会是否应该称自己为维基百科-我想在这里添加一条评论，为2030年研究和规划社区审查结果中提出的指标道歉。-希瑟·沃尔斯(WMF首席创意官)(2020-02-17)。\n↑Meta：2030年运动品牌项目-执行声明-我承担责任，因为我们没有设法以我们希望和打算的方式带领你们所有人踏上这段旅程，或者没有明确传达基金会的意图。我深感遗憾的是，造成的压力和紧张加剧了基金会和许多社区成员之间的裂痕。&希瑟·沃尔斯(2020-06-18)。\n↑Meta，董事会代理主席Natalia Tymkiv发表的关于品牌塑造的声明(2020年6月22日)我真的很抱歉，整个情况给志愿者和员工带来了所有的挫折，他们参与了表达他们的担忧的讨论，他们一直在工作，不确定这是否真的是董事会准备认真考虑的方向，或者这只是我们的一次练习。\n↑讨论：有缺陷的“知情人士”指标，2019-02-&34；社区反应标准建议除以已知晓的人数。这似乎是一个问题。我看不出你能确定有多少人是通过邮件列表或通过VillagePump帖子得知的，除非有人有通灵能力。\n↑品牌-社区评论#知情人士#0.6%的知情人士反对(9,000名用户中有57人反对)&#34；(2019-09-06)\n↑Meta：品牌-社区评审-结果#响应KPI-调整为#34；40%的社区成员反对&#34；\n↑讨论：品牌-社区评审-结果#这里使用的度量标准令人担忧-&#34；本次咨询中使用的度量标准旨在衡量人们的反应，而不是为提案打分，也不代表任何类型的投票。这是因为这个提议是概念性的，而不是明确的。扎克·麦库恩(Zack McCune)。\n↑：基金会是否应该自称为维基百科，以支持和反对“基金会使用维基百科这个名字来指代自己吗？”这个问题是支持的，反对的是468。", "note_en": "Jump to navigation  Jump to search  This page in a nutshell: We ask the Wikimedia Foundation to pause or stop its  current movement renaming activities, due to persistent shortcomings in the current rebranding process. Future work should be restarted only in a way that ensures equitable decision-making.\n   Volunteers have built up the good name of Wikipedia as an independent, community-driven resource for 20 years. The Wikimedia movement projects, including Wikipedia, thrive on decentralization and consensus. Clear distinctions among the Wikimedia Foundation, affiliates, and individual contributors are essential. Any change that affects this balance demands the informed consent and collaboration of the communities. Therefore, it is of great concern to see &#34;Wikipedia&#34; presented for the name of the organization and movement despite widespread community dissatisfaction.\n We, the undersigned, request an immediate pause to renaming activities by the Wikimedia Foundation, due to process shortcomings of the 2030 Movement Brand Project.\n Assessment of risks during project planning and concept development:  [1] High cost for undemonstrated benefit. Renaming constitutes a disruptive change, and does not show a clear link to the promised outcomes.  [2] Wikimedia affiliates are concerned about the hazards of using “Wikipedia” outside of a project context and have not found adequate assurances and support.  [3]\n High risks to community identity. These have been overlooked in evaluating naming options. In 2015, the Wikimedia Foundation noted that &#34;Wikimedia is a strongly-held community identity. Name changes have implications for community cohesion and participation.&#34;  [4] However, it failed to carry these concerns through the process and the surveys.\n Respect and inclusion of Wikimedia communities: Miscommunication and confusion. Unclear assumptions by the Wikimedia Foundation have led to a lack of confidence in the brand process.  [5]  [6]  [7]\n Problematic evaluation and summary of feedback. The choice of metrics, particularly in the August 2019 community review, have put the premise and legitimacy of the process into question.  [8]  [9]  [10]  [11]\n Neglecting the views of Wikimedia communities. Formal and informal channels, including Requests for Comments  [12] and straw polls  [13]  [14], indicated clear problems with the process. The current brand survey focuses on the very name for the Wikimedia Foundation that was overwhelmingly opposed in these community consultations.\n Therefore, we ask the Board of Trustees and the Wikimedia Foundation to pause or stop renaming activities.\n Every major activity in the Wikimedia movement has been delayed or postponed this year – the global Wikimania conference, Wikimedia Foundation board elections, Wikimedia Summit and Strategy working groups. It is appropriate to treat renaming with the same level of care and concern. Any future work should be restarted only in a way that supports equitable decision-making among all stakeholders.  [15]\n  Who should sign: Anyone who agrees with this letter, as an individual or on behalf of an affiliate group.\n Format: Affiliate name if signing on behalf of an affiliate, Name (username), affiliation or project\n      North-West Russia Wiki-Historians User Group - Nikolai Bulykin ( User:Красный), Ekaterina Borisova ( User:Екатерина Борисова)\n  Effeietsanders ( talk) 18:15, 23 June 2020 (UTC) - nlwiki, commons, former steward and former chapter board member\n Ferdi 2005    [Mail] 18:18, 23 June 2020 (UTC) - it.Wikipedia rollbacker and mover, it.wikinews administrator, meta massmessage sender, Wikimedia Italy regional coordinator Apulia\n Blue Rasberry   (talk) 18:25, 23 June 2020 (UTC) - Wiki Medicine, LGBT+, Cascadia, in Residence\n     Фред-Продавец звёзд ( talk) 18:53, 23 June 2020 (UTC) - Russian crosswiki community member\n  --  Anatoliy (  talk) 18:55, 23 June 2020 (UTC) – Ukrainian Wikipedia editor, Commons&#39; sysop, WMUA member\n  -- Alexander ( talk) 19:03, 23 June 2020 (UTC) – admin at Russian and English Wikivoyage, organizer of Wiki Loves Earth/Monuments\n  -- Base ( talk) 19:10, 23 June 2020 (UTC) — Ukrainian Wikipedian, Ukrainian Wikinewsie, Meta-Wiki sysop, Wikimedia Steward, Wikimedia Commons contributor and UploadWizard campaign editor, translate admin in multiple Wikimedia projects, Wikimedia OTRS member, WMUA board member.\n Bastique   ☎ call me! 19:11, 23 June 2020 (UTC) - old man and longtime user still invested in the community\n   --  Marcus Cyron ( talk) 19:20, 23 June 2020 (UTC) 15 years Wikimedian.  Zedler Medail in 2008 and Honory Wiki Owl in 2016.  Projects. There must be an end with this &#34; Fuck the community, who cares&#34; mentality behalf the WMF.\n   --   Ninja ✮Strikers   « ☎» 19:26, 23 June 2020 (UTC) - Burmese Wikimedian\n  Naḥum ( talk) 19:34, 23 June 2020 (UTC) - senior volunteer &amp; bureaucrat at he.wikisource.org\n  TohaomgTohaomg (  talk) 19:48, 23 June 2020 (UTC) - Wikimedia Ukraine Board member (but signing in personal capacity), member of OTRS, editor of Ukrainian and English Wikipedias, Wikidata and Wikimedia Commons, active participant of technical community of Wikimedia.\n I do not agree with all the point of this letter but I do totally agree with the main idea that the whole process should be improved.  V IGNERON *   discut. 20:00, 23 June 2020 (UTC)\n   Andrew Krizhanovsky ( talk) 20:15, 23 June 2020 (UTC) ruwikt and ruwikiversity administrator, commons and ruwiki editor\n     -- Ymblanter ( talk) 20:30, 23 June 2020 (UTC) administrator on English Wikipedia, Wikimedia Commons, Wikidata (also bureaucrat) and Russian Wikivoyage\n         Wutsje ( talk) 21:17, 23 June 2020 (UTC) -- admin on nlwiki, fywiki, and commons, former steward\n -- Ehrlich91 ( talk) 21:35, 23 June 2020 (UTC) --admin on Macedonian Wikipedia, editor on Commons and Wikidata, Board Member and Treasurer in Shared Knowledge\n -- Jalu ( talk) 22:03, 23 June 2020 (UTC) Wikipedia eswiki, Sysop at Wikiquote, board trustee WMA and MLUG.\n  Wiki 13   22:21, 23 June 2020 (UTC) Dutch Wikipedia Editor &amp; Administrator and cross-wiki for SWMT\n Amir ( talk) 22:27, 23 June 2020 (UTC), Admin on fawiki &amp; Wikidata, Global renamer, CU, oversight and bureaucrat in fawiki.\n    Imzadi 1979    → 23:18, 23 June 2020 (UTC) 15-year editor on enwiki, contributor to Commons, Wikisource and Wikidata\n Jorge Abellán ( talk) 23:54, 23 June 2020 (UTC), Admin on Wikinews (es), contributor to Commons, Wikidata, &#34;designer&#34; on Wikinews (fr) and Wikivoyage (es)\n    -- Ganímedes ( talk) 00:32, 24 June 2020 (UTC) eswiki editor, contributor to commons, OTRS agent, edits in 150+ other projects\n   ···  🌸   Rachmat04  ·   ☕ 02:09, 24 June 2020 (UTC), Indonesian Wikipedia, Commons, and Wikidata editor.\n —  Pólux (  σ) 02:12, 24 June 2020 (UTC) eswiki editor and former admin\n —  Hrishikes ( talk) 02:29, 24 June 2020 (UTC) — admin in English Wikisource, editor in Bengali Wikisource, English Wikipedia, Wikidata, Wikimedia Commons\n    ❙❚❚ ❙❙  JinOy  ❚❙❚ ❙❙  ✉ 04:41, 24 June 2020 (UTC) - en,ml-Wikipedia editor, Wikidata, Wikimedia Commons\n Gangulybiswarup ( talk) 04:47, 24 June 2020 (UTC), 10 years contributor to Commons, editor on enwiki, bnwiki, founder member of the West Bengal Wikimedians User Group.\n -- Ananth subray ( talk) 04:51, 24 June 2020 (UTC) , Kannada Wikipedia editor 17:44, 23 June 2020 (UTC)\n seav ( talk), contributor to Wikidata, English Wikipedia, and Wikimedia Commons, and bureaucrat at the Tagalog Wikipedia\n     .mau. ✉ 07:52, 24 June 2020 (UTC) (it.wikipedia, it.wikisource, and other project passim) BTW, renaming WMF and  not renaming the chapters will lead to even more confusion.\n De Wikischim ( talk) 08:04, 24 June 2020 (UTC) Editor and contributor on several Wikimedia projects, especially those in Dutch.\n Pavanaja ( talk) 08:09, 24 June 2020 (UTC) Sysop and bureaucrat in Kannada Wikipedia, Sysop in Tulu Wikipedia, Wikipedian since 2004, contributor on various Wikimedia projects.\n Civvì ( talk) 08:11, 24 June 2020 (UTC) sysop and bureaucrat on the Italian Wikipedia, member of OTRS, Wikipedian since 2004, contributor on various Wikimedia projects\n    Stryn ( talk) 09:06, 24 June 2020 (UTC) : Admin on Finnish Wikipedia, Wikidata and Meta-Wiki. Wikimedia Steward.\n     -- Camelia ( talk) 10:56, 24 June 2020 (UTC). I signed as affiliate liaison, I sign in a personal capacity as &#34;simple&#34; user too. WIkipedian since 2007: itwiki, rowiki, enwiki, Wikidata, Commons, Wikiquote, Wikibooks\n  --  -  Darwin    Ahoy! 12:00, 24 June 2020 (UTC) sysop at commons and wiki.pt, regular editor at wikidata, member of the OTRS team.\n          Rocky Masum ( talk) 14:00, 24 June 2020 (UTC) Wikimedia Commons, Admin at Bangla Wikipedia, EC member of Wikimedia Bangladesh..\n    · · ·  Peter (Southwood)   (talk): 15:51, 24 June 2020 (UTC) admin on en:Wikipedia and en:Wikivoyage, contributor on various other projects\n      Zanaq ( talk) 16:56, 24 June 2020 (UTC) - active on Dutch language Wikipedia and Commons\n Hsarrazin ( talk) 17:19, 24 June 2020 (UTC) - admin on frwikisource, contributor on Commons and Wikidata.\n While a fresh look at branding may be warranted, this process is causing more harm than good. It is time to take a step back, re-evaluate, and come back to the table with fresh ideas and a better understanding of the Wikimedia community.  AntiCompositeNumber ( talk) 17:29, 24 June 2020 (UTC) editor on enwiki and commons and an OTRS volunteer\n -- Novak Watchmen ( talk) 17:35, 24 June 2020 (UTC): a South Slavic cross-wiki editor; an administrator, interface administrator and bureaucrat on six different Serbian Wikimedia projects.\n  -- BradPatrick ( talk) 18:48, 24 June 2020 (UTC) Former WMF Interim Executive Director and first General Counsel; I signed the puzzle globe trademark application\n phoebe |   18:54, 24 June 2020 (UTC) (as an individual); former WMF Board of Trustees member; Wikimania steering committee; en.wp, wikidata\n  -- Túrelio ( talk) 20:29, 24 June 2020 (UTC) -- :de editor since 2006, Commons admin since 2008\n  LtPowers ( talk) 21:28, 24 June 2020 (UTC) - English Wikipedia, English Wikivoyage bureaucrat, Wikimedia Commons\n -- Ysogo ( talk) 21:34, 24 June 2020 (UTC) - :it, user since 2006, translation-Admin on Meta-Wiki\n  -- Yoggysot ( talk) 22:55, 24 June 2020 (UTC) editor on it.wiki since 2006, on commons since 2007\n        -- Phyrexian  ɸ 05:00, 25 June 2020 (UTC) Italian Wikipedia sysop, active on Commons, Wikidata, Piedmontese Wikipedia and many, many more.\n      -- g ( talk) 08:58, 25 June 2020 (UTC) it.wiki sysop, OTRS Team member, former WMI&#39;s regional coordinator\n      -- Thibaut ( talk) 10:12, 25 June 2020 (UTC) Wikimedia Commons and French Wiktionary admin, also OTRS member\n  -- C. crispus  ( talk) 10:55, 25 June 2020 (UTC) – it.wiki user, active on Commons, Wikidata e somewhere else\n  Simon Villeneuve 11:27, 25 June 2020 (UTC) - WikiMedia user, mainly on Wikidata, frwiki, but also on Commons, Wikiquote, Wiktionary, Wikisource, Wikinews, Wikibooks. There&#39;s not only one door to access  libre knowledge.\n          Nosebagbear ( talk) 14:45, 25 June 2020 (UTC) OTRS agent (a particular concern) and en-wiki admin\n  --   Daniel Mietchen ( talk)  16:33, 25 June 2020 (UTC) — curating research-related content across Wikimedia projects\n das-g ( talk) 16:52, 25 June 2020 (UTC), user of and on-and-off contributor to several WikiMedia projects\n    -- Nitraus ( talk) 17:25, 25 June 2020 (UTC), 14 years in Finnish Wikipedia and 8 years as a sysop there, sysop at Fi-Wikiquote, contributor at en-Wikipedia, Wikidata &amp; Commons, several others less frequently\n Xana ( talk) 17:38, 25 June 2020 (UTC) Active mostly in es-wiki, sporadic contributor to other projects. Admin en es-wiki.\n    -- DaB. ( talk) 18:27, 25 June 2020 (UTC) Long-time-Wikipedian (since before there was an WMF) -- DaB. ( talk) 18:27, 25 June 2020 (UTC)\n            --[[]] 21:30, 25 June (UTC). Spent a lot of my childhood vandalising wikipedia. Now contribute occasionally.\n  ↑  Slides:  November 2015 documents presented to the Board from the branding team, ( 2015-11). In a video call with affiliates on  2020-06-20, Zack McCune (WMF Director of Brand) concurred that these criteria were absent and should be somehow incorporated into the proceedings.\n ↑   Meta:  Requests for comment - Should the Foundation call itself Wikipedia - &#34;I wanted to add a comment here to apologize for the metrics presented in the 2030 research and planning community review results&#34; - Heather Walls, (WMF Chief Creative Officer) (2020-02-17)\n ↑  Meta:  2030 movement brand project - Executive statement - &#34;I take responsibility that we have not managed to bring all of you along on this journey in the way we hoped and intended, or clearly communicated the Foundation’s intentions. I deeply regret causing stress and tension that have increased rifts between the Foundation and many community members.&#34; - Heather Walls (2020-06-18)\n ↑  Meta,  Board Statement on Branding (2020-06-22) from acting board chair Natalia Tymkiv - &#34;I am truly sorry for all the frustration this whole situation has caused to volunteers, who have engaged in discussions expressing their concerns, and to the staff, who have been working and not really sure if that is really the direction the Board is prepared to seriously consider, or if it is just an exercise on our part.&#34;\n ↑  Discussion:  Flawed indicator for ‘informed people’, 2019-02 - &#34;The community response criteria proposes dividing by the number of people who have been informed. That appears to be a problem. I see no way you can determine how many people have been informed via mailing list or informed via VillagePump postings, unless someone has psychic powers.&#34;\n ↑   Brands - Community Review # Informed people &#34;0.6% of informed oppose (57 users oppose of ~9,000 reached)&#34; (2019-09-06)\n ↑   Meta:  Brands - Community Review - Results # Response KPIs - adjusted to &#34;40% of community members oppose&#34;\n ↑  Discussion:  Brands - Community Review - Results # The metrics used here are troubling- &#34;The metrics used in this consultation were meant to gauge response not to offer a score for the proposal or stand in for a vote of any kind. This was because the proposal was conceptual not explicit.&#34; Zack McCune\n ↑   Meta:  RfC: Should the Foundation call itself Wikipedia As of 2020-06-22: 41 in support and 468 against for the question “Is it acceptable for the Foundation to use the name Wikipedia to refer to itself?”", "posttime": "2020-06-26 06:47:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "维基百科,open,talk", "title": "关于将维基百科更名为维基百科的社区公开信", "title_en": "Community open letter on renaming Wikimedia to Wikipedia", "transed": 1, "url": "https://meta.wikimedia.org/wiki/Community_open_letter_on_renaming", "via": "", "real_tags": ["维基百科", "open", "talk"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008307, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "关于本页面，我们的系统检测到来自您的计算机网络的异常流量。该页面检查是否真的是您发送的请求，而不是机器人。为什么会发生这种事？当Google自动检测到来自您的计算机网络的请求似乎违反了服务条款时，会出现此页面。该块将在这些请求停止后不久过期。在此期间，解决上述验证码将让您继续使用我们的服务。此通信量可能是由恶意软件、浏览器插件或发送自动请求的脚本发送的。如果您共享网络连接，请向您的管理员寻求帮助-使用相同IP地址的不同计算机可能会负责。了解更多有时，如果您使用的是已知机器人使用的高级术语，或者发送请求非常迅速，则可能会要求您解决验证码问题。\nIP地址：207.46.138.74时间：2020-06-25T22：46：52Z网址：https://www.youtube.com/watch?v=VAhHkJQ3KgY&amp；feature=youtu.be", "note_en": "About this page  Our systems have detected unusual traffic from your computer network. This page checks to see if it&#39;s really you sending the requests, and not a robot.  Why did this happen?   This page appears when Google automatically detects requests coming from your computer network which appear to be in violation of the  Terms of Service. The block will expire shortly after those requests stop. In the meantime, solving the above CAPTCHA will let you continue to use our services.  This traffic may have been sent by malicious software, a browser plug-in, or a script that sends automated requests. If you share your network connection, ask your administrator for help — a different computer using the same IP address may be responsible.  Learn more  Sometimes you may be asked to solve the CAPTCHA if you are using advanced terms that robots are known to use, or sending requests very quickly.\nIP address: 207.46.138.74 Time: 2020-06-25T22:46:52Z URL: https://www.youtube.com/watch?v=VAhHkJQ3KgY&amp;feature=youtu.be", "posttime": "2020-06-26 06:46:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "堡垒,fortress", "title": "矮人堡垒创造者解释它的复杂性和起源", "title_en": "Dwarf Fortress Creator Explains Its Complexity and Origins", "transed": 1, "url": "https://youtu.be/VAhHkJQ3KgY", "via": "", "real_tags": ["堡垒", "fortress"]}, {"category": "", "categoryclass": "", "imagename": "d28c31fc0fbbb11e1c26f37353004c08.jpg", "infoid": 1008305, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四，美国疾病控制和预防中心更新并扩大了新冠肺炎的严重疾病风险名单-强调患有这种疾病的不仅仅是老年人。\n最值得注意的是，疾控中心取消了65岁及以上的特定年龄门槛，适用于那些被认为有严重新冠肺炎风险的人-即那些需要住院、重症监护、通气或死于这种疾病的人。\n现在，该机构强调，基于年龄的风险存在梯度。换句话说，任何年龄都有一定的风险，但这种风险随着年龄的增长而增加。50岁的人比40岁的人风险更大，60岁的人比50多岁的人风险更高。最大的风险出现在85岁及以上的人身上。\n除了年龄，有某些潜在的健康状况也是增加严重疾病风险的一个明显因素。从大流行开始，公共卫生专家就把重点放在那些患有心血管疾病、糖尿病、慢性呼吸系统疾病和肥胖症的人身上。\n在更新的指南中，疾控中心根据最新数据细化和扩大了导致高风险的健康状况清单。现在的名单是：\n疾控中心在最新指南的公告中指出：“这些变化增加了落入高危人群的人数。”\n而在名单上有多种条件的人风险更高-条件越多，风险就越大。\n最后，该机构明确了可能增加严重新冠肺炎患病风险的条件。这些情况包括：哮喘、高血压、吸烟、1型糖尿病、肝病、妊娠、囊性纤维化、痴呆症等神经疾病和中风等脑血管疾病。\n疾控中心指出，同样在周四发表的一项新研究表明，与患有这种疾病的非孕妇相比，患有新冠肺炎的孕妇住院的风险更高。然而，正如“纽约时报”指出的那样，怀孕和未怀孕的女性住院的门槛是不同的。研究发现，患有新冠肺炎的孕妇和非孕妇的死亡率没有差异。\n疾控中心表示，了解谁面临的风险最大，对于保护他们的健康至关重要，并进一步补充道：\n每个人都应该继续尽自己的一份力量来实施预防策略，比如专注于可以保持社交距离的活动，经常洗手，限制接触经常接触的表面或共享物品并对其进行消毒，当你与不住的人在一起时，特别是当你很难保持6英尺远的距离或人们在室内时，你要戴上布面。通过采取这些步骤，你可以帮助保护你自己、你所爱的人和你周围的人，包括那些最容易患重病的人。", "note_en": "The US Centers for Disease Control and Prevention on Thursday updated and expanded its list of who is at risk of developing severe illness from COVID-19—emphasizing that it’s not just the elderly who suffer from the disease.\n Most noticeably, the CDC removed the specific age threshold of 65 and over for those considered at risk of severe COVID-19—that is, those requiring hospitalization, intensive care, ventilation, or those who die from the disease.\n Now, the agency emphasizes that there is  a gradient of risk based on age. In other words, there is some risk at any age, but that risk increases with age. A 50-year-old will have more risk than a 40-year-old, and a 60-year-old is at higher risk than someone in their 50s. The greatest risk is seen in those aged 85 and over.\n In addition to age, having certain underlying health conditions has also been a clear factor that increases risk of severe illness. From the outset of the pandemic, public health experts have focused on those with cardiovascular disease, diabetes, chronic respiratory disease, and obesity.\n In the updated guidance, the  CDC refined and expanded the list of health conditions that lead to high risk based on the latest data. The list now stands at:\n  “These changes increase the number of people who fall into higher risk groups,” the CDC noted in its announcement of the updated guidance.\n And people who have multiple conditions on the list have even higher risks—the more conditions, the more risk.\n Last, the agency clarified conditions that  might increase a person’s risk for developing severe COVID-19. Those conditions include: asthma, high blood pressure, smoking, Type 1 diabetes, liver disease, pregnancy, cystic fibrosis, neurologic conditions such as dementia, and cerebrovascular diseases such as stroke.\n The CDC noted that  a new study, also published Thursday, suggests that pregnant women with COVID-19 are at an increased risk of hospitalization compared with nonpregnant women with the disease. However,  as The New York Times notes, the threshold for hospitalizing women is different if they’re pregnant versus not pregnant. The study found no differences in death rates between pregnant and nonpregnant women with COVID-19.\n Understanding who is most at risk is critical to protecting their health, the CDC said, adding further:\n Everyone should continue to do their part to implement prevention strategies, such as focusing on activities where social distancing can be maintained, washing your hands frequently, limiting contact with and disinfecting commonly touched surfaces or shared items, and wearing a cloth face covering when you are around people you do not live with, especially when it is difficult to stay 6 feet apart or when people are indoors. By taking these steps, you can help protect yourself, your loved ones, and others around you, including those most vulnerable to severe illness.", "posttime": "2020-06-26 06:27:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "肺炎,latest,疾病", "title": "疾控中心：这是新冠肺炎传染最重的人的最新情况", "title_en": "CDC: Here’s the latest on who gets the sickest from COVID-19", "transed": 1, "url": "https://arstechnica.com/science/2020/06/younger-people-not-immune-from-severe-covid-19-new-cdc-guidance-suggests/", "via": "", "real_tags": ["肺炎", "latest", "疾病"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008304, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创建帐户", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2020-06-26 06:26:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,苹果,体验,arm,创建", "title": "为什么要等苹果公司呢？立即在RasPI上体验原创的ARM桌面体验", "title_en": "Why Wait for Apple? Try Out the Original ARM Desktop Experience Today on a RasPi", "transed": 1, "url": "https://spectrum.ieee.org/tech-talk/consumer-electronics/gadgets/why-wait-for-apple-try-out-the-original-arm-desktop-experience-today-with-a-raspberry-pi", "via": "", "real_tags": ["apple", "苹果", "体验", "arm", "创建"]}, {"category": "", "categoryclass": "", "imagename": "5b74f615a881628bf3a34fde7629f61d.jpg", "infoid": 1008303, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Verizon周四宣布，根据该公司首席媒体官的说法，它将从Facebook和Instagram上撤下广告。\n重要原因：Verizon是加入越来越多抵制这家社交网络内容审查政策的最大公司之一，这些政策包括它如何监管关于黑人生命也是抗议活动的错误信息，以及处理特朗普总统发布的内容。\n威瑞森的首席媒体官约翰·尼蒂在一份声明中告诉Axios，他们的意思是：“我们有严格的内容政策，当这些政策被违反时，我们是零容忍的，我们会采取行动。”在一份声明中，Verizon的首席媒体官约翰·尼蒂(John Nitti)告诉Axios。“我们将暂停我们的广告，直到Facebook能够创造出一个可以接受的解决方案，让我们感到舒服，并且与我们与YouTube和其他合作伙伴的做法一致.”\n快速赶上：包括反诽谤联盟(Anti-Defamation League)和全国有色人种协进会(NAACP)在内的六个民权组织上周开始敦促营销人员停止购买Facebook广告，并使用#stophatefor Profit的标签。\n我们的思想泡沫，来自Axios&39；Ina Fry：虽然Verizon最出名的是提供手机和有线互联网服务，但它拥有美国在线(AOL)和雅虎(Yahoo)，目标是与Facebook争夺数字广告收入。", "note_en": "Verizon announced on Thursday it will pull advertisements from Facebook and Instagram, per the company&#39;s chief media officer.\n Why it matters: Verizon is one of the largest companies to join a growing boycott of the social network over its content moderation policies, including how it polices  misinformation about Black Lives Matter protests, and  handles content posted  by President Trump.\n What they&#39;re saying: “We have strict content policies in place and have zero tolerance when they are breached, we take action,” Verizon’s Chief Media Officer John Nitti told Axios in a statement. “We’re pausing our advertising until Facebook can create an acceptable solution that makes us comfortable and is consistent with what we’ve done with YouTube and other partners.”\n  Catch up quick: Six civil rights groups, including the Anti-Defamation League and NAACP, began urging marketers last week to stop buying Facebook ads, using the hashtag  #stophateforprofit.\n  Our thought bubble, via Axios&#39; Ina Fried: While best known for providing cell and wired internet service, Verizon owns AOL and Yahoo and aims to compete with Facebook for digital ad dollars.", "posttime": "2020-06-26 06:25:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,facebook,pulls", "title": "Verizon从Facebook和Instagram上撤下广告", "title_en": "Verizon Pulls Ads from Facebook and Instagram", "transed": 1, "url": "https://www.axios.com/verizon-facebook-instagram-ads-9e834d5c-1d79-4447-865f-aac1225ba2e7.html", "via": "", "real_tags": ["广告", "facebook", "pulls"]}, {"category": "", "categoryclass": "", "imagename": "a491aa16df7ac6f7cbd66379efb6dc7a.jpg", "infoid": 1008302, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国全国广播公司(NBC)的孔雀流媒体服务将于下月推出，首次公开发行的明珠无疑是根据奥尔德斯·赫胥黎(Aldous Huxley)1932年经典反乌托邦小说改编的雄心勃勃的“美丽新世界”(The Brave New World)。这部“孔雀”原创系列的完整预告片终于出炉了，奥尔登·埃伦瑞奇(Alden Ehrenreich)饰演赫胥黎笔下的反英雄--野人约翰(John The Savage)，当他被推入一个乌托邦社会时，他发现自己很难适应。\n正如我们在四月份报道的那样，“美丽的新世界”的故事背景设定在2540年，在世界之都伦敦，人们出生在人造子宫里，通过睡眠学习接受灌输，以适应他们指定的预先确定的种姓。公民经常服用一种名为SOMA的药物(部分是抗抑郁剂，部分是迷幻剂)，以保持他们的温顺，并帮助他们遵守严格的社会法律。乱交受到鼓励，但怀孕(对女性而言)是令人羞愧的原因。不用说，艺术和科学(尽管程度较小)都受到怀疑。\n西欧常驻世界管理员穆斯塔法·蒙德告诉这部小说的反英雄主人公野人约翰，纯科学领域的每一项发现都有潜在的颠覆性。科学是危险的，我们必须小心翼翼地用铁链锁住它，给它戴上嘴巴。\n约翰是一位高级政府官员的私生子，在萨维奇保留地出生和长大，那里的人仍然在生育，年龄自然，通常代表着世界国家精心控制的理想的对立面。他唯一受过教育的是莎士比亚全集。(小说的标题引用了米兰达在“暴风雨”中的一句话。)。当约翰和他的母亲琳达找到回到世界之州的路时，他最初成为了塞莱布雷的事业，但却在努力适应新的社会习俗。更具体地说，他爱上了一位名叫列尼娜·克劳恩的年轻女子，但他无法应对她的滥交和性行为。他最终将自己与社会隔离开来，希望洗清自己的罪孽。事情对任何人来说都不会有好的结局。\n在4月的预告片中，我们遇到了Beta-Plus Lenina(杰西卡·布朗·芬德利Jessica Brown Findlay饰)，丢下一张索玛的标签，与各种潜在的性伴侣狂欢，偶尔的情妇伯纳德·马克思(亨利·劳埃德饰)嫉妒地看着。我们还看到了Savageland，琳达(黛米·摩尔饰)敦促她的儿子约翰(Ehrenreich饰)和她一起回到新伦敦。我们还看到了变性的威权主义者穆斯塔法·蒙德(Nina Sosanya)向一群追随者讲授提问或欢迎新想法的危险：病毒进入细胞。故事就是这样开始的。同样换了性别：伯纳德的朋友、情绪工程学院教授赫尔姆霍兹·沃森(Helmholtz Watson)现在是汉娜·约翰-卡门(Hannah John-Kamen)饰演的威廉敏娜·赫尔姆·沃森(Wilhelmina Helm&34；Watson)。\n新的预告片为我们提供了更多的细节和即将到来的事情的暗示。它以列尼娜略微提到索玛开场，而伯纳德的声音则向我们介绍了所谓的乌托邦--新伦敦。每个人都很快乐，每个人都知道自己的位置，没有饥饿、暴力或痛苦--你明白的。约翰的母亲琳达告诉他，我一直想为你做这件事。剩下的大部分预告片都是关于约翰在努力适应新伦敦时的反应。他被告知，你所要做的就是连接，这似乎涉及到一种特殊的隐形眼镜，它会连接到你的眼球上。\n每个人都时时刻刻都是相互联系的，这意味着没有人是真正孤独的，这似乎一点也不适合约翰。他在场但不在现场，观察但不吸引人，而且他似乎不喜欢他所看到的。你知道，我一直在关注你们这些人，他一度说。如果这个地方如此完美，为什么一切都颠倒了呢？我们看到伯纳德在这个原本很理想的城市里靠在一具身体上，所以约翰说得有道理。唯一的亮点是莱尼娜，她发现自己被野蛮人所吸引，而他也被她所吸引。约翰显然对新伦敦产生了颠覆性的影响，这一点并不是没有被当权者忽视的。蒙德说：我们需要在这件事走得太远之前阻止它。\n早在4月份，我就写道，虽然孔雀进入流媒体领域相对较晚，但这部电视剧看起来可能会成为这项羽翼未丰的服务的赢家。我坚持这种印象。这部电视剧在视觉上引人注目，演员阵容一流，节目制作人大卫·维纳看起来像是富有想象力地更新了赫胥黎21世纪小说的技术细节。“美丽的新世界”将于2020年7月15日首次亮相，作为孔雀流媒体服务推出的一部分。", "note_en": "NBC&#39;s  Peacock streaming service launches next month, and the jewel in the crown of its initial offerings is undoubtedly   Brave New World, an ambitious adaptation of Aldous Huxley&#39;s classic 1932 dystopian novel. The full trailer for this Peacock original series is finally here, starring Alden Ehrenreich as Huxley&#39;s antihero, John the Savage, who finds himself struggling to adapt when he is thrust into a utopian society.\n  As  we reported in April,  Brave New World is set in the year 2540, in the World State city of London, where people are born in artificial wombs and indoctrinated through &#34;sleep-learning&#34; to fit into their assigned predetermined caste. Citizens regularly consume a drug called soma (part anti-depressant, part hallucinogen) to keep them docile and help them conform to strict social laws. Promiscuity is encouraged, but pregnancy (for women) is a cause for shame. Needless to say, both art and science (albeit to a lesser extent) are viewed with suspicion.\n &#34;Every discovery in pure science is potentially subversive,&#34; Resident World Controller of Western Europe Mustapha Mond tells the novel&#39;s antihero protagonist, John the Savage. &#34;Science is dangerous; we have to keep it most carefully chained and muzzled.&#34;\n John is the illegitimate son of a high-level government official, born and raised on the Savage Reservation, where people still give birth, age naturally, and generally represent the opposite of the World State&#39;s carefully controlled ideals. His only education has been the complete works of Shakespeare. (The novel&#39;s title references a line by Miranda in  The Tempest.) When John and his mother, Linda, find their way back to the World State, he initially becomes a cause célèbre but struggles to adapt to the new social mores. Specifically, he falls in love with a young woman named Lenina Crowne but can&#39;t deal with her promiscuity and sexual forwardness. He ultimately isolates himself from society in hopes of purging himself of &#34;sin.&#34; Things don&#39;t end well for anyone.\n In the April teaser, we met Beta-Plus Lenina (Jessica Brown Findlay), dropping a tab of soma and partying with various potential sexual partners, as occasional paramour Bernard Marx (Henry Lloyd) looked on with jealousy. And we got a glimpse of Savageland, as Linda (Demi Moore) urged her son John (Ehrenreich) to return with her to New London. We also saw gender-swapped authoritarian Mustapha Mond (Nina Sosanya) lecturing a group of acolytes about the danger of asking questions or welcoming new ideas: &#34;A virus enters a cell. That&#39;s how it begins.&#34; Also gender-swapped: Bernard&#39;s friend Helmholtz Watson, a professor at the College of Emotional Engineering, is now Wilhelmina &#34;Helm&#34; Watson, played by Hannah John-Kamen.\n    The new trailer gives us a few more details and hints of things to come. It opens with Lenina dropping a bit of soma, while Bernard&#39;s voice introduces us to the supposed utopia that is New London. Everyone is happy, everyone knows their place, there&#39;s no hunger or violence or pain—you get the idea. &#34;I&#39;ve always wanted that for you,&#34; John&#39;s mother Linda tells him. Much of the remaining trailer is devoted to John&#39;s reaction as he struggles to adapt to New London. &#34;All you have to do is connect,&#34; he is told, which seems to involve a special kind of contact lens that wires into your eyeball.\n Everyone is connected, all the time, which means no one is ever truly alone, which doesn&#39;t seem to suit John at all. He&#39;s present but apart, observing but not engaging, and he doesn&#39;t seem to like what he sees. &#34;You know I&#39;ve been watching you people,&#34; he says at one point. &#34;If this place is so perfect, why is everything upside down?&#34; We see Bernard leaning over a dead body in this otherwise ideal city, so John has a point. The only bright spot is Lenina, who finds herself drawn to the savage, and he to her. John is clearly having a disruptive influence on New London, something that does not go unnoticed by those in power. &#34;We need to stop this before it goes too far,&#34; Mond says.\n Back in April, I wrote that &#34;while Peacock is relatively late to the streaming scene, the series looks like it could be a winner for the fledgling service.&#34; I stand by that impression. The series is visually striking and has a stellar cast, and showrunner David Wiener looks like he has imaginatively updated the technological details of Huxley&#39;s novel for the 21st century.  Brave New World debuts on July 15, 2020 as part of the launch of the Peacock streaming service.", "posttime": "2020-06-26 06:06:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "新世界,brave,伯纳德", "title": "在“美丽新世界”的预告片中，除了野人约翰，每个人都知道自己的位置。", "title_en": "In trailer for Brave New World, everyone but John the Savage knows their place", "transed": 1, "url": "https://arstechnica.com/gaming/2020/06/perfection-isnt-what-it-seems-in-new-trailer-for-peacocks-brave-new-world/", "via": "", "real_tags": ["新世界", "brave", "伯纳德"]}, {"category": "", "categoryclass": "", "imagename": "e36f6a0b0cb6616e16327cc79e59d50a.jpeg", "infoid": 1008301, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "嘿，库比蒂诺的朋友们！当你在Safari中输入Realty.com(我的公司)，然后按GO，就会进入Realtor.com(我的竞争对手)。有人能帮我个忙把这个修好吗？看起来不那么合法。顺便说一句。关闭Safari建议可以解决问题(但最终用户不会这样做)。谢谢！", "note_en": "Hey Cupertino Folks! When you type  Realty.com (my company) into Safari and press go it takes you to  Realtor.com (my competition). Can someone do me a solid and fix this? Seems not that legal. btw... turning off Safari Suggestions resolves the issue (but end users don&#39;t do that). Thx!", "posttime": "2020-06-26 06:05:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "条目,redirect,safari", "title": "为什么Safari会将确切的域条目重定向到他们认为您想要的位置？", "title_en": "Why does Safari redirect exact domain entries to what they think you want?", "transed": 1, "url": "https://m.facebook.com/story.php?story_fbid=10157161487396994&id=501751993", "via": "", "real_tags": ["条目", "redirect", "safari"]}, {"category": "", "categoryclass": "", "imagename": "23dfc28582a2f06387876bd87aec9c39.png", "infoid": 1008300, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在大家都知道，虽然新冠肺炎连很年轻的人都能打，但年纪大的人面临的风险最大。在受重创的富裕国家，约60%的死于该疾病的人年龄在80岁及以上。然而，美国是个例外。疾病控制中心(CDC)6月16日发布的数据显示，该国的死亡人数明显偏年轻。在那里，80多岁的人占新冠肺炎死亡人数的不到一半，与此同时，40多岁、50多岁和60多岁的人占死亡人数的比例要大得多。美国新冠肺炎患者的中位数是48岁，意大利是63岁。\n为什么美国如此离群索居？部分原因当然在于这样一个事实，即美国的人口比欧洲年轻。美国的平均年龄只有38岁；意大利是45岁。另一个原因可能是，美国中年人可能比他们的欧洲同龄人不健康，例如，因为他们往往更肥胖。\n不管是什么原因，美国新冠肺炎受害者的相对年轻意味着冠状病毒正在夺走美国人更多宝贵的生命。一组苏格兰研究人员最近的一项研究将受害者的潜在健康状况考虑在内，估计了新冠肺炎按年龄损失的寿命。研究发现，在意大利，死于50多岁、60多岁和70多岁的人通常分别少活了30岁、21岁和12岁。那些80多岁的人平均损失了5年。\n将这些估计应用于美国疫情的受害者，粗略的计算表明，到目前为止，新冠肺炎已经将美国受害者的寿命平均缩短了11年，而受影响最严重的欧洲国家大约为9年。美国可能还没有达到像英国、西班牙和意大利那样的新冠肺炎死亡率。但在美国的传染远未得到遏制。安东尼·福奇(Anthony Fuci)是负责美国应对的专家之一，他警告说，该国部分地区的新感染人数“令人不安地激增”。当考虑到年龄因素时，美国人更有理由感到不安。", "note_en": "IT IS NOW well-known that, although covid-19 can strike even the very young, older folk face the greatest risk. In hard-hit rich countries, about 60% of all deaths from the disease are among people aged 80 and over. America, however, is an exception.  Data released on June 16th by the Centres for Disease Control (CDC) show that the country’s death toll skews significantly younger. There, people in their 80s account for less than half of all covid-19 deaths; people in their 40s, 50s and 60s, meanwhile, account for a significantly larger share of those who die. The median covid-19 sufferer in America is a 48-year-old; in Italy it is a 63-year-old.\n Why is America such an outlier? Part of the explanation surely lies in the fact that America has a younger population than Europe does. America’s median age is just 38; Italy’s is 45. Another reason, perhaps, is that middle-aged Americans may be less healthy than their European peers, eg, because they tend to be more obese.\n  Whatever the cause, the relative youthfulness of America’s covid-19 victims means that the coronavirus is robbing Americans of more years of precious life. A recent study by a group of Scottish researchers estimated the number of years of life lost to covid-19 by age, taking account of the victims’ underlying health conditions. It found that in Italy, people who died in their 50s, 60s, and 70s typically lost 30, 21, and 12 years, respectively. Those in their 80s lost five years, on average.\n Applying these estimates to the victims of America’s outbreak, a back-of-the-envelope calculation suggests that covid-19 has so far shortened the lives of its American victims by 11 years, on average, compared with about nine years in the hardest-hit European countries. America may not yet have reached the same rate of covid-19 deaths as the likes of Britain, Spain and Italy. But the contagion in America is far from contained. Anthony Fauci, one of the experts in charge of America’s response, has warned of a “disturbing surge” in new infections in parts of the country. And when the age profile is factored in, there is even more reason for Americans to be disturbed.", "posttime": "2020-06-26 06:04:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,肺炎,analysed", "title": "当新冠肺炎的死亡按年龄进行分析时，美国是一个异常值。", "title_en": "When Covid-19 deaths are analysed by age, America is an outlier", "transed": 1, "url": "https://www.economist.com/graphic-detail/2020/06/24/when-covid-19-deaths-are-analysed-by-age-america-is-an-outlier", "via": "", "real_tags": ["美国", "肺炎", "analysed"]}, {"category": "", "categoryclass": "", "imagename": "79fac8fffdba5d840bb9b42b7e2bb947.png", "infoid": 1008299, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "还记得查看器(Viewfinder)吗？马特·斯塔克(Matt Stark)正在开发的那款耗尽小脑精力的独立游戏，其特点是一些酷毙了的递归效果。经过一段时间的拖延，马特仍然在修补它，并添加新的机制--包括上面这个：\n在Viewfinder中，您将能够从墙上捕捉绘画，并将它们变成3D游戏世界中的真实对象。(这里是爱德华·霍珀(Edward Hopper)1929年的油画。)下面是斯塔克是如何做到这一点的：\nBlender有一个工具，可以让你使用相机投影生成UV，马特解释说，这就是我如何将绘画纹理应用到网格上的。\n最棘手的是做一个网格来适应这幅画--起初我以为这很容易，因为这幅画是一堆几何物体，但后来发现这幅画的透视在很多地方都有点摇晃。&#34；(这就是为你准备的Hopper。)。\n捕捉方法类似于他在这里所描述的：&#34；当玩家拍摄照片时，我复制环境，将其灰度化并将网格切片以移除照片之外的任何东西。当他们把它放到这个世界上时，我会把环境中的网格切成一个洞，用来放照片。\n当Viewfinder最终开始阅读播放测试时，请关注Matt以获取更新，不过我肯定也会在这里提到这一点。", "note_en": "Remember Viewfinder,  that cerebellum-straining indie game in development  by Matt Stark featuring  some insanely cool recursion effects? After some delay , Matt is still tinkering away it and adding new mechanics -- including this one above:\n  In Viewfinder, you will be able to &#34;capture&#34; paintings from off a wall, and turn them into real objects in the 3D game world. (A 1929 Edward Hopper painting, in this case.) Here&#39;s roughly how Mr. Stark does this:\n    &#34;Blender has a tool that lets you generate UVs using a camera projection,&#34; Matt explains, &#34;so that&#39;s how I got the painting texture applied to the mesh.\n  &#34;The tricky bit was making a mesh to fit the painting -- at first I thought it would be easy cause the painting&#39;s a bunch of geometric objects, but it turns out the painting&#39;s perspective is a little wonky in a bunch of places.&#34; (That&#39;s Hopper for you.)\n  The capture method is  similar to how he described it here: &#34;When the player takes a photo I duplicate the environment, make it greyscale and slice the meshes to remove anything outside the photo. When they place it into the world I slice the environment&#39;s meshes to make a hole for the photo.&#34;\n  Follow Matt for updates for when Viewfinder will finally be reading for playtesting, though I will surely mention it here too.", "posttime": "2020-06-26 06:04:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,游戏,game,网格", "title": "独立游戏正在开发中，具有很酷的“将2D绘画变成3D现实”的功能", "title_en": "Indie game in development with cool “turn 2D paintings into 3D reality” feature", "transed": 1, "url": "https://nwn.blogs.com/nwn/2020/06/viewfinder-matt-stark-unity-indie-game.html", "via": "", "real_tags": ["开发", "游戏", "game", "网格"]}, {"category": "", "categoryclass": "", "imagename": "7d11af1f91b19a353d70c53e2d178214.jpeg", "infoid": 1008298, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果已经收购了设备管理初创公司Fleetsmith。作为收购的一部分，将加入苹果的技术和人员可能有助于苹果扩大设备注册，并引入更好的方式在组织内设置iPad和Mac等新设备。\nFleetsmith向客户(以及苹果公司)提出的建议似乎完全契合了我们这个时代：该公司为组织提供了一种方法，让远程员工(或其他不在中心办公室的员工)配备设备，一旦这些设备重新启动，就会自动注册和设置，供企业使用。在那之后，Fleetsmith会自动确保设备获得所需的软件更新。它还为IT经理提供了管理车队的仪表盘。\n如果你使用过JAMF，一个更广泛的竞争对手，你就会大致了解。但Fleetsmith已经特别关注苹果设备，它有一种类似苹果的设计敏感性，而且对苹果来说，这可能是一个比JAMF便宜得多的选择。JAMF似乎走上了一条不同的道路，计划进行30亿美元的IPO。\n不过，说到钱，苹果和Fleetsmith都没有透露收购价格。不过，Fleetsmith确实发表了一篇关于此次收购的博客文章。这里是它说的一些内容：\n我们创建了Fleetsmith，以平衡IT的管理和安全需求与用户喜爱的Mac、iPad和iPhone体验。我们为我们建立的才华横溢的团队感到自豪，我们一直忠于我们的使命：让每个人都能获得强大、安全的苹果车队管理。\n我们很高兴能加入苹果公司。我们共同的价值观是以客户为中心，而不牺牲隐私和安全，这意味着我们可以真正履行我们的使命，将Fleetsmith交付给世界各地各种规模的企业和机构。\n该帖子还指出，Fleetsmith将继续为新客户和现有客户提供服务，因此这不是纯粹的知识产权或人力资本收购。据我们所知，它似乎会继续运营。\n苹果不太可能在不久的将来停止与JAMF的合作，但通过收购Fleetsmith，库比蒂诺显然对自己的内部设备管理战略有了一些特殊的计划。我们只能等着看它们是什么了。", "note_en": "Apple has acquired device-management startup Fleetsmith. The technology and personnel that will join Apple as part of the acquisition could help Apple expand upon device enrollment and introduce better ways to set up new devices like iPads and Macs within organizations.\n Fleetsmith&#39;s proposition to customers (and Apple) seems perfectly tailored to our times: the company offers a way for organizations to equip remote workers&#39; (or workers otherwise not located in the central office) devices and have those devices automatically registered and set up for enterprise use as soon as they&#39;re first turned on. After that, Fleetsmith automatically ensures devices get needed software updates. It also provides IT managers with a dashboard for managing the fleet.\n If you&#39;ve used Jamf, a more widespread competitor, you get the general idea. But Fleetsmith already had a special focus on Apple devices, it has an Apple-like design sensibility, and it was likely a much cheaper option for Apple than Jamf, to boot. Jamf appears to be on a different path, with a $3 billion  IPO planned.\n Speaking of money, though, neither Apple nor Fleetsmith has revealed the purchase price. Fleetsmith did publish a  blog post about the acquisition, though. Here&#39;s some of what it says:\n We started Fleetsmith to balance the management and security needs of IT with the experience users love about Mac, iPad, and iPhone. We’re proud of the incredibly talented team we’ve built, and that we’ve stayed true to our mission: to make powerful, secure Apple fleet management available to everyone.\n We’re thrilled to join Apple. Our shared values of putting the customer at the center of everything we do without sacrificing privacy and security, means we can truly meet our mission, delivering Fleetsmith to businesses and institutions of all sizes, around the world.\n The post also notes that Fleetsmith will continue to serve both new and existing customers, so this is not an acquisition purely of intellectual property or human capital. It seems like Fleetsmith as we know it will continue operating.\n It&#39;s unlikely that Apple will stop working with Jamf in the near future, but with this acquisition of Fleetsmith, Cupertino clearly has some special plans for its own in-house device management strategy. We&#39;ll just have to wait and see what they are.", "posttime": "2020-06-26 05:45:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,初创,acquisition", "title": "苹果进行另一笔收购：IT初创公司Fleetsmith", "title_en": "Apple makes another acquisition: IT startup Fleetsmith", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/06/apple-acquires-fleetsmith-a-remote-device-management-startup/", "via": "", "real_tags": ["apple", "苹果", "初创"]}, {"category": "", "categoryclass": "", "imagename": "006e9092229bcbe4ec27e34655392090.jpg", "infoid": 1008297, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尽管苹果公司负责全球营销的高级副总裁菲尔·席勒否认公司正在做出任何改变，但一项新的政策将允许开发者挑战他们被该平台拒绝的规则，这表明改变正在酝酿之中。\n根据其自己的数据，App Store在2019年促成了超过5000亿美元的电子商务交易。作为参考，联邦政府已经向美国企业发放了约5290亿美元的贷款，作为Paycheck保护计划的一部分。\n鉴于其庞大的覆盖范围，现在是苹果改变条款的时候了吗？它是否会允许其收入份额温和地进入那个美好的夜晚，或者它是否有足够的资源来遏制新的立法，并安抚日益直言不讳的软件开发人员社区？为了研究这些问题，TechCrunch的四名员工加入了进来：\n苹果开始意识到，其培养应用程序经济的简单化和家长式做法可能弊大于利。情况并不总是这样：在早先的日子里，仅仅是为了获得参与其快速扩张的市场的特权，就值得付钱给苹果。\n但数字经济已经摆脱了以前推动增长的条件：一开始是新奇的，然后是由社交媒体增压的蓬勃发展的广告市场。钟摆正在向更传统的支付模式摇摆：对严肃的服务进行一次性和订阅支付。想象一下！\n再加上移动平台的出现，不仅是简单的消费和通信工具，而且是严肃的工作和生产力的工具，赌注已经上升。人们开始问，苹果向任何想要使用其平台的人寻求租金，到底提供了什么价值？\n苹果当然应该为它的麻烦付出一些代价，但它只占一家公司收入的四分之一多一点？对于一款99美分的应用程序来说，一对开发人员只是很高兴地卖出了几千份，现在看起来有点过分，但现在看起来确实是敲诈勒索。\n苹果处于强势地位，可能会继续撼动整个行业，但它担心在努力使其平台真正有利于生产率的过程中失去合作伙伴。这个市场更大，更复杂，有跨平台和跨设备的复杂性，其中App Store和iOS可能只是一小部分-但需要令人难以置信的超大份额。\n它会松开把手，但不着急。如果过于宽容，让其新规则被玩弄并仓促修改，那将是一种代价高昂的侮辱。允许开发者反击他们不喜欢的规则给了苹果很多东西可用，但没有承诺。毫无疑问，大玩家将获得更大的话语权，App Store的新常态将反映出金钱利益之间的缓和，而不是苹果慷慨的改变主意。", "note_en": "Although  Apple’s   Senior Vice President of worldwide marketing Phil Schiller  denied the company was making any changes, a new policy will let developers  challenge the very rules by which they were rejected from the platform, which suggests that change is in the air.\n According to its own numbers, the App Store facilitated more than $500 billion in e-commerce transactions in 2019. For reference, the  federal government has given out about $529 billion in loans to U.S. businesses as part of the Paycheck Protection Program.\n Given its massive reach, is it time for Apple to change its terms? Will it allow its revenue share to go gently into that good night, or does it have enough resources to keep new legislation at bay and mollify an increasingly vocal community of software developers? To examine these questions, four TechCrunch staffers weighed in:\n   Apple is starting to see that its simplistic and paternalistic approach to cultivating the app economy may be doing more harm than good. That wasn’t always the case: In earlier days it was worth paying Apple simply for the privilege of taking part in its fast-expanding marketplace.\n But the digital economy has moved on from the conditions that drove growth before: Novelty at first, then a burgeoning ad market supercharged by social media. The pendulum is swinging back to more traditional modes of payment: one-time and subscription payments for no-nonsense services. Imagine that!\n Combined with the emergence of mobile platforms not just as tools for simple consumption and communication but for serious work and productivity, the stakes have risen. People have started asking, what value is Apple really providing in return for the rent it seeks from anyone who wants to use its platform?\n Surely Apple is due something for its troubles, but just over a quarter of a company’s revenue? What seemed merely excessive for a 99-cent app that a pair of developers were just happy to sell a few thousand copies of now seems positively extortionate.\n Apple is in a position of strength and could continue shaking down the industry, but it is wary of losing partners in the effort to make its platform truly conducive to productivity. The market is larger and more complicated, with cross-platform and cross-device complications of which the App Store and iOS may only be a small part — but demanding an incredibly outsized share.\n It will loosen the grip, but there’s no hurry. It would be a costly indignity to be too permissive and have its new rules be gamed and hastily revised. Allowing developers to push back on rules they don’t like gives Apple a lot to work with but no commitment. Big players will get a big voice, no doubt, and the new normal for the App Store will reflect a detente between moneyed interests, not a generous change of heart by Apple.", "posttime": "2020-06-26 05:44:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果", "title": "\n四种观点：苹果会削减App Store费用吗？", "title_en": "\n\t\t\t\tFour perspectives: Will Apple trim App Store fees?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/four-perspectives-will-apple-trim-app-store-fees/", "via": "", "real_tags": ["apple", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "a91fc19bdf754215986181a4bee89fed.png", "infoid": 1008296, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "免费更新将于7月3日到来，这标志着定于夏季发布的两波新内容中的第一波(无论如何，对北半球的玩家来说是如此)。这一更新邀请玩家跳入海洋，四处游泳，收集海葵、海星、鳗鱼和其他海洋动物，然后这些动物可以捐赠给他们的博物馆藏品。神秘的后半部分更新定于8月初发布。\n[公告]进入#AnimalCrossing：New Horizons免费夏季更新-第一波，7/3到来，为这个夏天降温吧！穿上潜水服潜水和在海洋中游泳，甚至可以结识新角色！请继续关注计划于8月初发布的第2波的相关信息。pic.twitter.com/cYd86R7g6D。\n游戏还将增加另一个新角色，帕斯卡，一只可以为你提供新食谱的海獭。任何玩过动物穿越游戏的人都会认出帕斯卡是一个冷静的人，他在漫不经心地踩水的同时，也同样散发着冰冷的智慧珍珠。\n对于一项围绕着熟悉的循环-收集水果、拔草、摇晃树木以找到漂亮的客厅家具-的游戏来说，游泳和跳水的增加实际上是一个相当大的变化。对于那些在大流行初期严厉打击“新地平线”的人来说，这可能是一个很好的理由，因为他们已经没有什么可以做的了，可以重新审视这个游戏。看看任天堂在New Horizons商店里还有什么会很有趣，因为这是游戏时代第一款期待发布后大量可下载内容的游戏，已经在路线图上规划了出来。\n如果像我一样，你的妻子不小心弄坏了你的一个开关控制器，而你已经三个星期没有玩了，这也是一个完美的时间，可以在你的村民中随意漫步，同时表现得好像没有经过任何时间。Lolly，如果你正在读这篇文章，我想让你知道他们是延期订购的，这不会改变我们之间的任何事情。真的。", "note_en": "The free update will arrive on July 3, marking the first of two waves of new content due out in the summer season (for players in the Northern Hemisphere, anyway!). The update invites players to plunge into the ocean and swim around to collect anemones, starfish, eels and other sea-faring creatures, which can then be donated to their museum collection. The mysterious second half of the update is due out in early August.\n [Announcement] Cool off this summer by diving into the  #AnimalCrossing: New Horizons free Summer Update – Wave 1, arriving 7/3! Put on your wet suit to dive &amp; swim in the ocean, and even meet new characters! Stay tuned for info on Wave 2, planned for release in early August.  pic.twitter.com/cYd86R7g6D\n The game will also add another new character, Pascal, a sea otter who you can hit up for new recipes. Anyone who’s played past Animal Crossing titles will recognize Pascal as a chill guy who doles out equally chill pearls of wisdom while casually treading water.\n For a game that revolves around familiar cycles—collecting fruit, pulling weeds, shaking trees to find nice living room furniture—the addition of swimming and diving is actually a pretty big change. And it’s probably a good reason for anyone who went hard on New Horizons in the early days of the pandemic and ran out of things to do to revisit the game. It’ll be interesting to see what else Nintendo has in store New Horizons, since it’s the first Animal Crossing title in in a gaming era that expects of plenty of post-release downloadable content already plotted out on the roadmap.\n It’s also the perfect time to casually stroll out among your villagers while acting like no time passed at all if, like me, your wife accidentally broke one of your Switch controllers and you haven’t played in three weeks. Lolly, if you’re reading this, I want you to know they were back-ordered and this doesn’t change anything between us. Really.", "posttime": "2020-06-26 05:44:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "穿越,crossing,游戏", "title": "\n动物穿越的夏季更新将让你为海洋生物游泳", "title_en": "\n\t\t\t\tAnimal Crossing’s summer update will let you swim for sea critters\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/animal-crossing-swimming-new-horizons/", "via": "", "real_tags": ["穿越", "crossing", "游戏"]}]