[{"category": "", "categoryclass": "", "imagename": "640c8f055f248f635730f4686b5e12e0.jpg", "infoid": 1007673, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "研究人员说，设备固件的网络服务器中的一个未打补丁的漏洞为攻击者提供了root权限。\n他们说，研究人员在Netkit路由器的固件中发现了一个未打补丁的零日漏洞，使79个设备型号面临完全接管的风险。\n根据两份独立的报告，该漏洞是固件的httpd网络服务器中存在的一个内存安全问题，使得攻击者能够绕过受影响的Netkit路由器安装上的身份验证：一份是越南邮电集团一位名为“d4rkn3ss”的研究人员关于零日倡议(ZDI)的；另一篇是网络安全公司Grimm的亚当·尼科尔斯(Adam Nichols)撰写的另一篇博客文章。\n根据ZDI的报告，“特定的缺陷存在于httpd服务中，该服务默认侦听TCP端口80”，该报告涵盖了R6700系列Netkit路由器中存在的漏洞。此问题是由于在将用户提供的数据拷贝到固定长度、基于堆栈的缓冲区之前，没有正确验证其长度造成的。\n根据该报告，利用该漏洞不需要身份验证，攻击者可以利用该漏洞获得root权限。\nZDI表示，它在1月份向Netkit通报了该漏洞，但供应商仍未为受影响的设备提供补丁。供应商曾要求将公开披露延长至6月底，但ZDI拒绝了。Threatpost已经联系Netkit寻求评论和补丁时间表的细节。\n就尼科尔斯而言，他最初在Netkit R7000路由器系列中发现了这个缺陷，但最终发现了79种不同的Netkit设备和758个固件映像，其中包括一个易受攻击的Web服务器副本。\n“这个漏洞早在2007年就会影响固件(WGT624v4，2.0.6版)，”他在他的帖子中说。“考虑到大量的固件映像，手动查找合适的小工具是不可行的。相反，这是实现小工具检测自动化的好机会。“\n尼科尔斯表示，问题在于缺乏对一种名为堆栈Cookie或堆栈金丝雀的功能的支持。堆栈金丝雀指的是“煤矿中的金丝雀”的使用，他解释说，这些功能用于在恶意代码执行之前检测堆栈缓冲区溢出。他说，虽然一些Netkit路由器支持此功能-即D8500固件版本1.0.3.29和R6300v2固件版本1.0.4.12-1.0.4.20-但大多数其他路由器不支持。\nNichols在帖子中解释说：“D8500和R6300v2的更高版本不再使用堆栈cookie，这使得该漏洞再次被利用。”“与其他现代软件相比，这只是SOHO设备安全落后的又一个例子。”\n他说，SOHO设备固件中的Web服务器通常是系统中最易受攻击的方面，因为它们“必须解析来自网络的用户输入，并运行使用该输入的复杂CGI功能”。\n尼科尔斯说：“此外，Web服务器是用C语言编写的，几乎没有经过测试，因此它经常容易受到微不足道的内存损坏错误的攻击。”\n尼科尔斯在他的帖子中解释说，可以通过两种方式利用零日漏洞。一种方法是通过一系列最终导致堆栈缓冲区溢出的步骤来利用Web服务器中的http解析器中使用的Recv函数。\n他解释说，攻击者还可以使用跨站点请求伪造(CSRF)攻击来利用该漏洞，尽管他或她需要知道他们的目标路由器的型号和版本才能成功实现这一点。\n“如果使用易受攻击的路由器的用户浏览到恶意网站，该网站可能会利用用户的路由器…。通过为HTML页面提供服务，该页面向目标设备发送包含利用漏洞的AJAX请求：“Nichols说。但是，由于CSRF网页无法从目标服务器读取任何响应，因此无法远程识别设备。\n根据ZDI的报告，目前该漏洞的唯一缓解措施是将与该服务的交互限制在受信任的计算机上。\n报告称：“只有与该服务有合法程序关系的客户端和服务器才应被允许与其通信。”这可以通过多种方式实现，最明显的是使用防火墙规则/白名单。\n3月份，Netkit修补了一个关键的远程代码执行漏洞，该漏洞可能会使未经验证的攻击者能够控制其运行1.0.2.68之前固件版本的无线AC路由器Nighthawk(R7800)硬件。它还解决了影响夜鹰路由器的两个高度严重的缺陷，21个中等严重的缺陷和一个评级为低的缺陷。\n内部威胁在工作中是不同的-与家庭时代不同。6月24日下午2点。ET，加入Threatpost编辑团队和我们的特邀嘉宾，Gurucul首席执行官Saryu Nayyer，参加一个免费的网络研讨会，主题是“内部的敌人：内部威胁是如何变化的。”获取有用的、真实的信息，了解内部威胁如何随着WFH的变化，新的攻击载体是什么，以及公司可以对此做些什么。请在这里注册参加这个Threatpost网络研讨会。", "note_en": "An unpatched vulnerability in the web server of device firmware gives attackers root privileges, researchers said.\n  Researchers have discovered an unpatched, zero-day vulnerability in firmware for  Netgear routers that put  79 device models at risk for full takeover, they said.\n The flaw, a memory-safety issue present in the firmware’s httpd web server, allows attackers to bypass authentication on affected installations of Netgear routers, according to two separate reports:  One on the Zero Day Initiative (ZDI) by a researcher called “d4rkn3ss” from the Vietnam Posts and Telecommunications Group; and a separate  blog post by Adam Nichols of cybersecurity firm  Grimm.\n “The specific flaw exists within the httpd service, which listens on TCP Port 80 by default,” according to the ZDI report, which covers the bug’s presence in the R6700 series Netgear routers. “The issue results from the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length, stack-based buffer.”\n  Authentication is not required to exploit the vulnerability, which attackers can use to gain root privileges, according to the report.\n ZDI said it informed Netgear of the vulnerability in January, but the vendor still has not delivered a patch for the affected devices. The vendor had asked for an extension until the end of June for public disclosure, which ZDI declined. Threatpost has reached out to Netgear for comment and for details on a patch timeline.\n For his part, Nichols discovered the flaw initially in the Netgear R7000 router series, but eventually identified 79 different Netgear devices and 758 firmware images that included a vulnerable copy of the web server.\n “This vulnerability affects firmwares as early as 2007 (WGT624v4, version 2.0.6),” he said in his post. “Given the large number of firmware images, manually finding the appropriate gadgets is infeasible. Rather, this is a good opportunity to automate gadget detection.”\n Nichols said that the problem lies in lack of support for a feature called  stack cookies, or stack canaries—a reference to the use of a “canary in a coal mine”–which are used to detect a stack buffer overflow before execution of malicious code can occur, he explained. While some Netgear routers support this feature – namely, the D8500 firmware version 1.0.3.29 and the R6300v2 firmware versions 1.0.4.12-1.0.4.20 – most others do not, he said.\n “Later versions of the D8500 and R6300v2 stopped using stack cookies, making this vulnerability once again exploitable,” Nichols explained in the post. “This is just one more example of how SOHO device security has fallen behind as compared to other modern software.”\n Web servers in the firmware of SOHO devices in general are often the most vulnerable aspect of the system as they “must parse user input from the network and run complex CGI functions that use that input,” he said.\n “Furthermore, the web server is written in C and has had very little testing, and thus it is often vulnerable to trivial memory-corruption bugs,” Nichols said.\n  The zero-day vulnerability can be exploited in two ways, Nichols explained in his post. One way to is to exploit the recv function used in the http parser in the web server through a series of steps that eventually lead to a stack-buffer overflow.\n Attackers also can use a cross-site request forgery (CSRF) attack to exploit the vulnerability, though he or she needs to know the model and version of the router they’re targeting to pull this off successfully, he explained.\n “If a user with a vulnerable router browses to a malicious website, that website could exploit the user’s router … by serving an HTML page which sends an AJAX request containing the exploit to the target device:” Nichols said. “However, as the CSRF web page cannot read any responses from the target server, it is not possible to remotely fingerprint the device.”\n The only current mitigation for the vulnerability is to restrict interaction with the service to trusted machines, according to the ZDI report.\n “Only the clients and servers that have a legitimate procedural relationship with the service should be permitted to communicate with it,” according to the report. “This could be accomplished in a number of ways, most notably with firewall rules/whitelisting.”\n  In March,  Netgear patched a critical remote code execution bug that could allow an unauthenticated attacker to take control of its Wireless AC Router Nighthawk (R7800) hardware running firmware versions prior to 1.0.2.68. It also addressed two high-severity bugs impacting Nighthawk routers, 21 medium-severity flaws and one rated low.\n Insider threats are different in the work-from home era. On    June 24 at 2 p.m. ET  , join the Threatpost edit team and our special guest, Gurucul CEO Saryu Nayyer, for a FREE webinar, “  The Enemy Within: How Insider Threats Are Changing.”   Get helpful, real-world information on how insider threats are changing with WFH, what the new attack vectors are and what companies can do about it  .    Please register here   for this Threatpost webinar.", "posttime": "2020-06-23 01:52:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "路由器,day,漏洞", "title": "NETGEAR零日允许完全接管数十个路由器型号", "title_en": "Netgear Zero-Day Allows Full Takeover of Dozens of Router Models", "transed": 1, "url": "https://threatpost.com/netgear-zero-day-takeover-routers/156744/", "via": "", "real_tags": ["路由器", "day", "漏洞"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007671, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ZIG是一种新的通用编程语言，它正在从头开始重新思考语言和相关工具的工作方式。我已经讨论了编译时代码执行，现在我将介绍该语言的另一个创新概念：异步/等待。\n是的，但是Zig中的异步/等待与编译时执行相结合，允许函数隐式地成为异步的，并且整个库以一种非常独特的方式在阻塞和事件I/O模式下透明地工作。\n虽然Zig非常创新，但它试图成为一种小而简单的语言。Zig从C语言的简单性中获得了很多灵感，并保留了元编程杂技，以备您真正需要时使用。一般来说，你应该能够在一个周末使用Zig变得高效。因此，虽然大多数Zig功能会让您立即感到愉快和熟悉，但异步/等待是打破熟悉规则的一个例子，但这是有充分理由的。\n在使用事件I/O时，命令式编程语言往往有两个选择：回调或异步/等待。\n第一种情况的优点是不需要对语言进行任何添加，但缺点是现在一切都必须基于回调和嵌套闭包。第二种情况基本上让编译器将函数分解成不同的“阶段”，使整个翻译对用户透明(即在您看来，它仍然是正常的、顺序的、命令性代码)，但不幸的是，它有引入函数着色的副作用。\n这篇博客文章很好地解释了函数着色的概念，但总而言之：因为你不能从非异步代码调用异步函数，你最终会有很多重复的工作，你需要重新实现你的标准库和所有与网络相关的库的一部分，以解决异步/等待。其中一个例子是Python，在Python3中引入异步/等待产生了像aio-libs这样的项目，其目标是在AsyncIO之上重新实现流行的网络库。\n让我们通过查看几个示例来了解异步/等待在Zig中是如何工作的。要查看以下代码片段的运行情况，请在另一个终端中以侦听模式启动Netcat，如果一切正常，您应该会看到“Hello World！”每次运行后都会打印出来。\n第一个示例是一个写入套接字的简单阻塞程序。这没什么好惊讶的。\nconst net=@import(&#34；std&34；).net；pub FN main()！void{const addr=try net.Address.parseIp(&#34；127.0.0.1&#34；，7000)；try send_message(Addr)；}fn send_message(addr：net.Address)！void{var socket=try net.tcpConnectToAddress(Addr)；defer socket.close()；_=try socket.write(&#34；Hello World！\\n&#34；)；}。\nconst net=@import(&#34；std&#34；).net；pub const io_mode=.evented；pub FN main()！void{const addr=try net.Address.parseIp(&#34；127.0.0.1&#34；，7000)；try send_message(Addr)；}fn send_message(addr：net.Address)！void{var socket=try net.tcpConnectToAddress(Addr)；defer socket.close()；_=try socket.write(&#34；Hello World！\\n&#34；)；}。\n该声明在后台引起了一些更改，其中之一是以非阻塞模式打开套接字。这会导致函数变成异步的，但是正如您可以看到的那样，它的调用方式并没有改变：它看起来仍然像一个普通的函数调用，尽管它不是。\nimport asyncio async def main()：等待send_message(&#34；127.0.0.1&#34；，7000)async def send_message(addr，port)：_，write=等待异步cio.open_connection(addr，port)writer.write(b&#34；Hello World！\\n&#34；)writer.close()asyncio.run(main())。\n现在您已经看到，在Zig中，启动协程并立即等待其完成不需要额外的关键字。那么，你如何开始一个协和程序，然后等待它呢？当然是通过使用异步！\nconst net=@import(&#34；std&#34；).net；pub const io_mode=.evented；pub FN main()！void{const addr=try net.Address.parseIp(&#34；127.0.0.1&#34；，7000)；var sendFrame=异步发送消息(Addr)；//.。在发送邮件时//执行其他操作.。尝试等待sendFrame；}//注意函数定义如何不需要任何静态//`async`标记。编译器可以根据`wait`的用法推断函数何时为//异步。FN SEND_MESSAGE(地址：net.Address)！void{//如果我们在此期间有其他想要做的事情，我们也可以推迟‘等待’要建立的连接。var socket=net.tcpConnectToAddress(Addr)；defer socket.close()；//在同一条语句中同时使用aWait和Async//是不必要的，也不是惯用的，但是它显示了//当`io_mode`//为`.evented`时，幕后正在发生什么。_=尝试等待异步socket.write(&#34；Hello World！\\n&#34；)；}。\n通过使用Async关键字，您可以创建协同例程并运行它，直到它遇到挂起点(粗略地说，它必须等待I/O发生)。返回值是Zig所说的“异步框架”，在某种程度上等同于来自其他语言的Future、Task、Promise或Coroutine对象。\n让我向您展示完成这个难题的最后一个技巧：在阻塞模式下使用异步/等待。要恢复到阻塞I/O，我们所要做的就是删除开头添加的特殊声明(或者使用相应的枚举大小写)。\nconst net=@import(&#34；std&#34；).net；pub const io_mode=.block；pub FN main()！void{const addr=try net.Address.parseIp(&#34；127.0.0.1&#34；，7000)；//是的，var sendFrame=async send_message(Addr)；try await sendFrame；}fn send_message(addr：net.Address)！void{var socket=net.tcpConnectToAddress(Addr)；defer.socket.close()；//this Too_=尝试等待异步socket.write(&#34；Hello World！\\n&#34；)；}。\n是的，该程序可以按照预期进行编译和工作。该函数不再是异步的，实际上这两个关键字基本上都变成了no-ops，但重点是即使您不能利用它，也可以表示并发性。在我们的小示例中，这可能看起来不是什么大事，但这是允许库在单个代码库中提供阻塞和事件I/O功能的原则。\n不久前，我开始开发OkRedis，这是一个用Zig编写的Redis客户端库，它试图在不影响效率的情况下为用户提供尽可能多的细节。除此之外，它还在单个代码库中完全支持阻塞和事件I/O。如果你想了解更多，请看一下GitHub上可用的文档，并观看这个演讲，Andrew Kelley(Zig的创建者)与我合著。在这篇文章中，Andrew解释了Zig中异步/等待的基础知识，在第二部分中，我演示了OkRedis。\n&#34；在Zig&#34；中使用异步I/O建模数据并发虽然编译器非常聪明，并且击败函数着色有许多实际好处，但它不是灵丹妙药，所以让我立即揭开它的神秘面纱。\n不，要使您的程序利用事件I/O，您需要在代码中表示并发性。如果您从未这样做过，启用事件I/O将不会提供任何明显的优势，但是如果您正在使用的某个库被正确地设计为异步/等待，那么您可能会体验到更好的性能。\n也就是说，如果您的代码嵌入到一个使用异步/等待的较大项目中，那么自动转换到事件I/O将在某种程度上使您的代码与周围的上下文配合得很好。\n不需要，有很多应用程序需要事件I/O才能正常运行。切换到阻塞模式，而不引入任何更改，可能会导致它们死锁。例如，可以考虑单个应用程序既充当其自身的服务器，又充当其自身的客户端。\n也就是说，在编译时，可以检查整个程序是否处于事件模式，例如，正确设计的代码可能会在处于阻塞模式时决定移动到线程模型。\n问：所以我甚至不需要考虑我的库中的普通函数和协程？\n不，偶尔你会不得不这么做。例如，如果您允许用户在运行时将函数指针传递给您的库函数，则需要确保根据函数是否是异步的使用正确的调用约定。您通常不必考虑这一点，因为编译器能够在编译时为您完成工作，但对于运行时已知值则不能这样做。\n好的一面是，您可以使用所有工具，以简单而清晰的方式说明所有的可能性。一旦您获得正确的细节，代码将不会比必须的更复杂，并且您的库将很容易使用。\n虽然我在撰写简介时考虑到的是普通开发人员，但您需要知道Zig不是一种动态类型的语言，最重要的是，当涉及到资源管理时，它会给您带来很大的权力(和责任)。例如，如果您知道如何在C#、JavaScript或Python中执行异步/等待操作，您就不能立即知道如何在Zig中执行所有操作。\n具体地说，垃圾收集的语言对您隐藏了内存的来源。这使得程序员的工作变得容易得多，但是这种额外的轻松的代价完全由机器承担。这不是什么新鲜事，这是一个非常值得做的权衡，但是，特别是在异步/等待方面，它是有问题的，因为你失去了对内存消耗的控制，最终会过量使用，并在超负荷时遇到问题(有关更多信息，请参阅这篇博客帖子)。\nZIG的要点之一就是使资源配置始终清晰、可管理。当涉及异步/等待时，这意味着运行协同例程所需的所有内存都由其底层异步帧表示。一旦您有了一个帧(无论是因为它是静态内存还是因为相应的动态分配成功了)，那么您就知道协程将能够顺利运行到完成。例如，在HTTP服务器的上下文中，这意味着您将能够预先知道您是否有足够的资源来接受连接，而不会遇到不可恢复的错误条件。\n到目前为止，我只讨论了实现协程的语言特性。我没有全部提到，但更重要的是，我没有讨论事件循环。在Zig中，事件循环是标准库的一部分，其想法是使其可交换。\n在撰写本文的时候，事件循环还有很多工作要做，但是今天您已经可以尝试所有东西了。如果您想知道，当前的实现已经是多线程的。只需访问ziglang.org，下载最新版本，并查看文档即可。\n啊，是的。事实上，Go-与其他几种语言一起使用-没有函数着色问题。安德鲁在前面的谈话中提到了GO，但我会在这里提出我的两点看法。\n如果你以前看过我的博客，你就知道我喜欢围棋。我认为在应用程序级编程中，Goroutines通常比异步/等待更可取，特别是当涉及服务器端应用程序时，我认为这是Go的主要领域。\n我认为Goroutines在这种情况下更可取，因为异步/等待是一个很容易误用的低级工具，但是当涉及到编写具有正确性和效率的关键要求的代码时，您需要异步/等待，您需要Zig的哲学，即我们都应该努力编写健壮、优化和可重用的软件。\n非常感谢您的阅读！有什么意见吗？发推文：@croloris。另外，我开始定期在Twitch上直播编码，下一次直播时请关注频道通知我！", "note_en": "Zig is a new, general-purpose programming language that is rethinking from the ground up the way languages and related tooling should work. I’ve  already discussed compile-time code execution, and now I’m going to introduce another innovative concept from the language: async/await.\n  Well yes, but async/await in Zig combines with compile-time execution, allowing functions to implicitly become async and whole libraries to work transparently in both blocking and evented I/O mode in a way that’s very much unique to Zig.\n   While Zig is very innovative, it tries to be a small and simple language. Zig takes a lot of inspiration from the simplicity of C and reserves metaprogramming acrobatics for when you really need them. In general, you should be able to become productive with Zig in a weekend. So, while most Zig features will immediately strike you as pleasant and somewhat familiar, async/await is one example of the familiarity-rule being broken, but for good reason.\n  When it comes to making use of evented I/O, you tend to have two options in imperative programming languages: callbacks or async/await.\n The first case has the advantage of not requiring any addition to the language, but the downside is that now everything has to be based on callbacks and nested closures. The second case basically leaves it to the compiler to break down your function into different “stages”, making the whole translation transparent to the user (i.e. to you it still looks like normal, sequential, imperative code) but, unfortunately, it has the side effect of introducing function coloring.\n  The idea of function coloring is nicely explained by  this blog post, but to sum it up: since you can’t call async functions from non-async code, you end up with a lot of duplicated effort, where you need to reimplement parts of your standard library and all networking-related libraries to account for async/await. One example of this is Python, where the introduction of async/await in Python 3 birthed projects like  aio-libs, whose goal is to reimplement popular networking libraries on top of AsyncIO.\n  Let’s walk through how async/await works in Zig by looking at a few examples. To see the following code snippets run, launch Netcat in another terminal in listen mode and, if everything works, you should see “Hello World!” being printed after every run.\n    The first example is a simple blocking program that writes to a socket. Nothing surprising there.\n const  net =  @import ( &#34;std&#34; ).net;    pub   fn  main() ! void  {    const  addr =  try  net.Address.parseIp( &#34;127.0.0.1&#34; ,  7000 );    try  send_message(addr);  }    fn  send_message(addr: net.Address) ! void  {    var  socket =  try  net.tcpConnectToAddress(addr);    defer  socket.close();     _ =  try  socket.write( &#34;Hello World! \\n &#34; );  }\n  const  net =  @import ( &#34;std&#34; ).net;    pub   const  io_mode = .evented;    pub   fn  main() ! void  {    const  addr =  try  net.Address.parseIp( &#34;127.0.0.1&#34; ,  7000 );    try  send_message(addr);  }    fn  send_message(addr: net.Address) ! void  {    var  socket =  try  net.tcpConnectToAddress(addr);    defer  socket.close();     _ =  try  socket.write( &#34;Hello World! \\n &#34; );  }\n That declaration caused a few changes in the background, one of which is opening the socket in non-blocking mode. This causes the function to become async, but as you can see the way it gets called did not change: it still looks like a normal function invocation, even though it’s not.\n  import  asyncio    async   def   main ():    await  send_message( &#34;127.0.0.1&#34; ,  7000 )    async   def   send_message ( addr ,  port ):   _, writer =  await  asyncio.open_connection(addr, port)   writer.write( b &#34;Hello World! \\n &#34; )   writer.close()    asyncio.run(main())\n  You’ve seen now that in Zig there is no extra keyword requirement to launch a coroutine and immediately wait for its completion. So how do you start a coroutine and  await it afterward then? By using  async of course!\n const  net =  @import ( &#34;std&#34; ).net;    pub   const  io_mode = .evented;    pub   fn  main() ! void  {    const  addr =  try  net.Address.parseIp( &#34;127.0.0.1&#34; ,  7000 );      var  sendFrame =  async  send_message(addr);    // ... do something else while    // the message is being sent ...    try   await  sendFrame;  }    // Note how the function definition doesn&#39;t require any static  // `async` marking. The compiler can deduce when a function is  // async based on its usage of `await`.  fn  send_message(addr: net.Address) ! void  {    // We could also delay `await`ing for the connection    // to be established, if we had something else we    // wanted to do in the meantime.    var  socket = net.tcpConnectToAddress(addr);    defer  socket.close();      // Using both await and async in the same statement    // is unnecessary and non-idiomatic, but it shows    // what&#39;s happening behind the scenes when `io_mode`    // is `.evented`.   _ =  try   await   async  socket.write( &#34;Hello World! \\n &#34; );  }\n By using the  async keyword, you’re creating the coroutine and running it until it encounters a suspension point (when it has to wait for I/O to happen, roughly speaking). The return value is what Zig calls an “async frame” and is to some degree equivalent to  Future,  Task,  Promise, or  Coroutine objects from other languages.\n  Let me show you the final trick that completes the puzzle: using async/await in blocking mode.To revert back to blocking I/O, all we have to do is delete the special declaration we added in the beginning (or use the corresponding enum case).\n const  net =  @import ( &#34;std&#34; ).net;    pub   const  io_mode = .blocking;    pub   fn  main() ! void  {    const  addr =  try  net.Address.parseIp( &#34;127.0.0.1&#34; ,  7000 );      // yes, this still works    var  sendFrame =  async  send_message(addr);    try   await  sendFrame;  }    fn  send_message(addr: net.Address) ! void  {    var  socket = net.tcpConnectToAddress(addr);    defer  socket.close();      // this too   _ =  try   await   async  socket.write( &#34;Hello World! \\n &#34; );  }\n Yes, this program compiles and works as expected. The function is no longer async, and in fact both keywords basically become no-ops, but  the point is that you can express concurrency even if you’re not able to take advantage of it. This might not seem such a big deal in our small example, but it’s the principle that allows libraries to offer both blocking and evented I/O capabilities off of a single code base.\n  A while ago I started working on  OkRedis, a Redis client library written in Zig that tries to offer as many niceties it can to the user without compromising in terms of efficiency. Among other things, it features full support for both blocking and evented I/O in a single codebase. If you want to learn more, take a look at the available documentation on GitHub and watch this talk  Andrew Kelley (the creator of Zig) co-authored with me. In it, Andrew explains the basics of async/await in Zig and, in the second part, I demo OkRedis.\n     &#34;Modeling Data Concurrency with Asynchronous I/O in Zig&#34;  While the compiler is very smart and defeating function coloring has many practical benefits, it’s not a magic bullet, so let me immediately demystify some ideas about it.\n  No, to make your program take advantage of evented I/O you need to express concurrency in your code.If you never did that work, enabling evented I/O will not provide any appreciable advantage, but you might experience better performance if one of the libraries you’re using has been properly designed for async/await.\n That said if your code gets embedded in a larger project that does make use of async/await, theautomated translation to evented I/O will make your code play nice with the surrounding context, to some extent.\n  No, there’s plenty of applications that need evented I/O to behave correctly. Switching to blocking mode, without introducing any change, might cause them to deadlock. Think for example of a single application that acts both as server and client to itself.\n That said, during compile-time, it’s possible to inspect if the overall program is in evented mode or not, and properly designed code might decide to move to a threaded model when in blocking mode, for example.\n Q: So I don’t even have to think about normal functions vs coroutines in my library?\n No, occasionally you will have to. As an example, if you’re allowing your users to pass to your library function pointers at runtime, you will need to make sure to use the right calling convention based on whether the function is async or not. You normally don’t have to think about it because the compiler is able to do the work for you at compile-time, but that can’t happen for runtime-known values.\n The silver lining is that you have at your disposal all the tools to account for all the possibilities in a simple and clear way. Once you get the details right, the code will be no more complicated than it has to be, and your library will be easy to use.\n  While I wrote the introduction with the average developer in mind, you need to be aware that Zig is not a dynamically typed language and, on top of that, it puts in your hands a lot of power (and responsibility) when it comes to resource management. If you know how to do async/await in C#, JavaScript, or Python, for example, you won’t be able to immediately know how to do  everything in Zig.\n In particular, garbage-collected languages hide from you where the memory is coming from. This makes things much easier for the programmer, but the price for this extra ease is shouldered entirely by the machine. This is nothing new and it’s a trade-off very often worth doing but, especially when it comes to async/await, it’s problematic because you lose control of how much memory you’re consuming, eventually over-committing and encountering issues when under heavy load (see this blog postfor more info).\n One of the main points of Zig is to make resource allocation always clear and manageable. When it comes to async/await, this means that all the memory required to run a coroutine is represented by its underlying async frame. Once you have a frame (be it because it’s static memory or because the corresponding dynamic allocation succeded), then you know the coroutine will be able to run to completion without problems. In the context of a HTTP server, for example, this means that you will be able to know upfront if you have enough resources to accept a connection or not, without encountering unrecoverable error conditions.\n  Up until now, I’ve only talked about the language features that implement coroutines. I haven’t mentioned all of them but, more importantly, I haven’t talked about the event loop. In Zig, the event loop is part of the standard library and the idea is to make it swappable.\n At the moment of writing, there’s still a lot of work to do on the event loop, but you can already try everything out today. The current implementation is already multi-threaded, in case you were wondering. Just go to  ziglang.org, download the latest version, and take a look a the docs.\n  Ah, yes. Go — alongside a few other languages in fact — doesn’t have function coloring problems. Andrew mentions Go in his part of the aforelinked talk, but I’ll give my two cents here.\n If you’ve read my blog before, you know that I like Go. I think that goroutines are generally preferable to async/await in application-level programming, especially when it comes to server-side applications, which I believe to be Go’s main domain.\n I think goroutines are preferable in that context because async/await is a much lower level tool that is easy to misuse, but when it comes to writing code with critical requirements of correctness and efficiency, you need async/await and you need Zig’s philosophy that we all should strive to write  robust,  optimal, and  reusable software.\n  Thank you very much for reading! Got a comment? Tweet   @croloris.  P.S. I started   live coding regularly on Twitch, follow the channel to be notified when I go live next!", "posttime": "2020-06-23 01:51:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "齐格,colorblind,等待", "title": "齐格的“色盲”异步/等待是什么？", "title_en": "What Is Zig's “Colorblind” Async/Await?", "transed": 1, "url": "https://kristoff.it/blog/zig-colorblind-async-await/", "via": "", "real_tags": ["齐格", "等待"]}, {"category": "", "categoryclass": "", "imagename": "4219bbeb991987db8cb75ac770bd0a1c.png", "infoid": 1007670, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在您的网络上公开Web服务·使用Let加密实现免费SSL·设计时充分考虑了安全性·非常适合家庭网络。\n该界面基于Tabler，使用起来非常方便。配置服务器从来没有这么有趣过。\n内置的“让我们加密”支持允许您免费保护您的Web服务。证书甚至可以自动续订！\n将其他用户配置为查看或管理其自己的主机。提供完全访问权限。\n{&#34；数据库&#34；：{&#34；引擎&#34；：&#34；MySQL&#34；，&#34；主机&#34；：&#34；数据库&#34；，&#34；名称&#34；：&#34；NPM&#34；，&#34；用户&#34；：&#34；NPM&#34；，&#34；密码&#34；：&#34；npm&#34；，&#34；端口&#34；：3306}}。\n版本：&#39；3&#39；服务：APP：image：&#39；jc21/nginx-proxy-manager：最新&#39；端口：-&#39；80：80&#39；-&#39；81：81&#39；-&#39；443：443&#39；卷：-./config.json：/app/config/Production.json-./data：/data-./letscrypt：/etc/letscrypt db：image：&#39；jc21/MariaDB-aria：10.4&#39；环境：mysql_root_password：&#39；npm&#39；mysql_database：&#39；npm&#39；mysql_user：&#39；npm&#39；mysql_。卷：-./data/mysql：/var/lib/mysql。\n当您的停靠容器正在运行时，在端口81上连接到它以用于管理接口。有时，由于密钥的熵，这可能需要一些时间。\n使用此默认用户登录后，系统会立即要求您修改详细信息并更改密码。", "note_en": "Expose web services on your network · Free SSL with Let&#39;s Encrypt · Designed with security in mind · Perfect for home networks\n    Based on Tabler, the interface is a pleasure to use. Configuring a server has never been so fun.\n  Built in Let’s Encrypt support allows you to secure your Web services at no cost to you. The certificates even renew themselves!\n    Configure other users to either view or manage their own hosts. Full access permissions are available.\n          {  &#34;database&#34; :  {  &#34;engine&#34; :  &#34;mysql&#34; ,  &#34;host&#34; :  &#34;db&#34; ,  &#34;name&#34; :  &#34;npm&#34; ,  &#34;user&#34; :  &#34;npm&#34; ,  &#34;password&#34; :  &#34;npm&#34; ,  &#34;port&#34; :  3306  } }\n   version :  &#39;3&#39; services :  app :  image :  &#39;jc21/nginx-proxy-manager:latest&#39;  ports :  -  &#39;80:80&#39;  -  &#39;81:81&#39;  -  &#39;443:443&#39;  volumes :  - ./config.json :/app/config/production.json  - ./data :/data  - ./letsencrypt :/etc/letsencrypt  db :  image :  &#39;jc21/mariadb-aria:10.4&#39;  environment :  MYSQL_ROOT_PASSWORD :  &#39;npm&#39;  MYSQL_DATABASE :  &#39;npm&#39;  MYSQL_USER :  &#39;npm&#39;  MYSQL_PASSWORD :  &#39;npm&#39;  volumes :  - ./data/mysql :/var/lib/mysql\n      When your docker container is running, connect to it on port  81 for the admin interface.Sometimes this can take a little bit because of the entropy of keys.\n       Immediately after logging in with this default user you will be asked to modify your details and change your password.", "posttime": "2020-06-23 01:50:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "proxy,mysql", "title": "Nginx Proxy Manager-用于管理letsEncrypt保护的反向代理的UI", "title_en": "Nginx Proxy Manager – UI to manage letsencrypt-secured reverse proxies", "transed": 1, "url": "https://nginxproxymanager.com", "via": "", "real_tags": ["proxy", "mysql"]}, {"category": "", "categoryclass": "", "imagename": "59de2958006b3d3d2d7996d456ff6c5e.jpg", "infoid": 1007667, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了遏制错误信息在其平台上的传播，谷歌周一表示，将开始对谷歌图片搜索结果进行事实核查。\n重要原因：与误导性的、被篡改的、彻头彻尾的假照片和视频相比，基于文本的错误信息带来的危险可能相形见绌，包括在人工智能的帮助下生成令人信服的深度假照片和视频。\n大局：这一举措在各大搜索引擎中尚属首次，与此同时，科技公司正继续努力解决其平台上继续猖獗的错误信息。\n细节：从周一开始，谷歌将在世界各地的谷歌图片中显示事实核查信息，这与谷歌在其常规搜索和新闻结果中所做的努力类似。\n当用户在Google Images上搜索时，他们可能会在图像缩略图下面看到一个事实核查标签。事实核查可以应用于图像本身，也可以应用于它出现的网站。\n是的，但是：谷歌表示，事实核查不会影响图片搜索的排名，就像它的事实核查不会影响谷歌新闻或谷歌搜索的排名一样。", "note_en": "In an effort to curb the spread of misinformation on its platform, Google  said Monday it would begin to fact-check Google Images search results.\n Why it matters: The danger of text-based misinformation could be dwarfed by that posed by misleading, manipulated and outright fake photos and videos, including convincing &#34;deepfakes&#34; generated with the aid of artificial intelligence.\n The big picture: The move, a first among major search engines, comes as tech firms continue to wrestle with how to address the misinformation that continue to run rampant on their platforms.\n Details: Beginning Monday, Google will surface fact-check information in Google Images around the world, a similar effort to what is does in its regular search and news results.\n When users search on Google Images, they may see a fact-check label under image thumbnails. The fact-check could apply to the image itself or the website it appears on.\n Yes, but: Google says fact checks won&#39;t affect rankings in image search, similar to how its fact checks don&#39;t impact rankings in Google News or Google Search.", "posttime": "2020-06-23 00:57:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌", "title": "谷歌将开始事实核查谷歌图片", "title_en": "Google To Start Fact-Checking Google Images", "transed": 1, "url": "https://www.axios.com/google-to-start-fact-checking-google-images-b33f19f9-afc9-4316-acb8-021fe4a79857.html", "via": "", "real_tags": ["google", "谷歌"]}, {"category": "", "categoryclass": "", "imagename": "db7888b2973862728a57dccb1ca8302c.jpg", "infoid": 1007666, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "全速前进。请与我们一起参加2020年6月22日上午10点举行的Apple特别活动主题演讲。PDT。设置提醒，我们会在演出前发送最新消息。", "note_en": "Full stream ahead. Join us for the Apple Special Event Keynote on June 22, 2020 at 10 a.m. PDT. Set a reminder and we’ll send an update before the show.", "posttime": "2020-06-23 00:56:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,wwdc,主题", "title": "Apple WWDC主题演讲", "title_en": "Apple WWDC Keynote", "transed": 1, "url": "https://youtu.be/GEZhD3J89ZE", "via": "", "real_tags": ["apple", "wwdc", "主题"]}, {"category": "", "categoryclass": "", "imagename": "db7888b2973862728a57dccb1ca8302c.jpg", "infoid": 1007665, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "全速前进。请与我们一起参加2020年6月22日上午10点举行的Apple特别活动主题演讲。PDT。设置提醒，我们会在演出前发送最新消息。", "note_en": "Full stream ahead. Join us for the Apple Special Event Keynote on June 22, 2020 at 10 a.m. PDT. Set a reminder and we’ll send an update before the show.", "posttime": "2020-06-23 00:56:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "主题,special", "title": "WWDC特别活动主题演讲现场", "title_en": "WWDC Special Event Keynote Live", "transed": 1, "url": "https://www.youtube.com/watch?v=GEZhD3J89ZE", "via": "", "real_tags": ["主题", "special"]}, {"category": "", "categoryclass": "", "imagename": "7cf484ceeae6bc7fc2161eddc603cd15.jpg", "infoid": 1007663, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最近读了“识别与生成”。作者提出了一个问题：“读课本和写校样都觉得符合‘学习’的定义，为什么简单的就不能做呢？”答案是：“认可并不一定意味着理解，推动你能产生的东西可以帮助揭露你实际知道的东西。”\n这让人想起杰夫·霍金斯倡导的“记忆预测”框架。该框架说，识别是通过生成来完成的。来自顶级生成模型的预测和来自感官的观察之间存在着持续的对话。差异被记录为从无意识跳跃到有意识水平的意外：\n如果你曾经在一段楼梯上错过了一步，你就会知道你有多快就意识到有什么不对劲。你把脚放低，当它“穿过”预期的楼梯踏板的那一刻，你就知道你有麻烦了。脚没有任何感觉，但是你的大脑做了一个预测，这个预测没有实现。\n“智力论”，第91页。\n乍一看，该框架并不能很好地符合识别和生成之间的不对称。这种不对称性可以通过强调这样一个事实来解决，即大多数预测都是非特定的或“模糊的”。如果一组预期结果中的一个发生了，模糊预测不会导致惊讶。霍金斯承认这一观点：“预测并不总是准确的。相反，我们的大脑会对即将发生的事情做出概率预测。有时我们确切地知道将会发生什么，有时我们的期望分布在几种可能性之间。“。(同上，第92页)霍金斯在书的其余部分没有太多地阐述这一点，但对我来说，这似乎是至关重要的。特别是，它解释了识别和生成之间的不对称性。\n回到学习数学的例子：主观上，当我读到证明的时候，我感觉我知道发生了什么，因为我可以看到下一行紧随其后的是一个有效的逻辑规则的应用。(也就是说，该步骤是与我的预期一致的一组事情之一。)。然后，当我被要求重现这一步时，我惊讶地发现我不知道怎么做-因为我的预测是模糊的，每一步都有多件合理的事情要做，但我不知道到底应该做哪一件。另一方面，如果我知道为什么要采取证明中的每一步，那么我就可以唯一地预测每一步&并且重现证明。\n顺便说一下概率预测的机制：如果你想象“概率预测”意味着计算所有可能的感官体验的概率分布，这听起来很困难。然而，所有需要的是“预测”是抽象的--它越抽象，与之一致的观察集就越大，因此与之隐含关联的概率分布就越广。没有必要将概率分布表示为大脑中低水平感觉区域的模糊激活模式-激活功能等效的单个尖锐的、高水平的抽象标签会更有效。然后，大脑可以懒惰地评估无论发生什么观察到的惊喜程度(即概率)，相对于预期。\n从这个意义上说，一句话抵得上一千张图片：“棕狗”与海量的图片是一致的。这句话可能看起来不像是概率分布-它看起来很具体。然而，从某种角度来看，这是一个空白的分布，涉及狗的形象可能具有的所有可能的属性，事实上，要使其具体化，必须具备这些属性。当我看到一只棕色的狗时，我可能会认出它，但这并不意味着我会画一只，或者我想象中的那只和你想象的很像。\n这实际上与统计物理有关。有一个定义良好的过程，用于构建显式概率分布，表示仅知道高级抽象(在本例中，是随机变量函数的期望值或“矩”)，而分布的所有其他细节是不确定的情况。我怀疑大脑可以完成这样的事情，就像狗可以做微积分一样。(TL；DR：他们当然不会，但他们可以近似地解决一个问题，人们也可以用微积分提出并正式解决这个问题。)。\n关于数学和心理模型的另一个问题是，我一直认为证据或推导就像故事一样：主人公被这个问题困住了--我们的英雄有公理和规则(设置)，她想要得到结果，但不立即知道如何得到结果(冲突)。然后她记起了这个很酷的把戏(比如区分被积函数)，瞧，问题解决了(解决方案)。我怀疑这个框架有助于回忆。它还将重点放在为什么要做每一步(选择步骤的直觉)，而不仅仅是如何做(即证明步骤合理的规则)。", "note_en": "I recently read “ Recognizing vs Generating.” The author poses the question, “both reading the textbook and writing proofs feel like they fit the definition ‘studying’, so why can’t the easier one work?” The answer: “Recognition does not necessarily imply understanding, and pushing for something you can Generate can help expose what you actually know.”\n This brings to mind the “ memory-prediction” framework promoted by Jeff Hawkins. The framework says that recognizing is  accomplished by generating. There is a continual dialogue between predictions coming from top-level generative modeling and observations coming from the senses. Discrepancies are registered as surprises that leap from the unconscious to the conscious level:\n If you have ever missed a step on a flight of stairs, you know how quickly you realize something is wrong. You lower your foot and the moment it “passes through” the anticipated stair tread you know you are in trouble. The foot doesn’t feel anything, but your brain made a prediction and the prediction was not met.\n “On Intelligence”, p91\n At first glance, the framework doesn’t accord well with an asymmetry between recognizing &amp; generating. The asymmetry  can be accommodated, by emphasizing the fact that most predictions are non-specific or ‘fuzzy.’ A fuzzy prediction doesn’t result in surprise if  one of a set of expected outcomes occurs. Hawkins acknowledges this idea: “Prediction is not always exact. Rather, our minds make probabilistic predictions concerning what is about to happen. Sometimes we know exactly what is going to happen, other times our expectations are distributed among several possibilities.” (ibid, p92) Hawkins doesn’t make much of this point in the rest of the book, but it seems crucial to me. In particular, it explains the asymmetry between recognition and generation.\n To return to the illustration of studying math: subjectively, I feel like I know what is going on when I read the proof, because I can see that the next line follows by application of a valid logical rule. (That is, the step is among the set of things consistent with my expectations.) Then, when I am called on to reproduce the step, I am surprised to find that I don’t know how — because my prediction is fuzzy, there are multiple reasonable things to do at each step, but I don’t know exactly which one I should do. If on the other hand, I know  why each particular step in the proof was taken, then I can uniquely predict each one &amp; reproduce the proof.\n An aside about the mechanism of probabilistic predictions: it sounds difficult if you imagine that “probabilistic predictions” means calculating a probability distribution over all possible sensory experiences. However, all that is necessary is for the ‘prediction’ to be abstract — the more abstract it is, the larger the set of observations consistent with it, hence the wider the probability distribution that is  implicitly associated with it. It’s not necessary to represent the probability distribution as a blurry activation pattern in the brain at the low-level sensory areas — it is more efficient to activate a single sharp, high-level abstract label which is functionally equivalent. The brain can then lazily evaluate the degree of surprise (ie, the probability) of whatever observation occurs, with respect to the expectation.\n In this sense, a word is worth a thousand pictures: “brown dog” is consistent with a huge number of images. That phrase may not seem like a probability distribution — it seems pretty specific. However, from a certain perspective, it’s a blank distribution over all the possible attributes that an image of a dog could have, and in fact  would be required to have in order to be made concrete. I may know a brown dog when I see one, but it doesn’t mean I can draw one, or that the one I’m imagining is much like the one you imagine.\n This actually connects to statistical physics. There’s a  well-defined procedure for constructing explicit probability distributions representing the situation where only a high-level abstraction (in this case, the expectation value or ‘moment’ of a function of the random variables) is known, and all other details of the distribution are uncertain. I suspect that the brain can accomplish something like this, in much the same way that  dogs can do calculus. (TL;DR: of course they don’t, but they can approximate the solution to a problem that one could also pose and formally solve using calculus.)\n As another aside about math &amp; mental models, I’ve always thought of proofs or derivations like stories: the protagonist is stuck with this problem — our hero has the axioms and the rules (setup), she wants to get to the result, but doesn’t immediately know how (conflict). Then she remember this cool trick (like differentiating the integrand) and voila, problem solved (resolution). I suspect this framing helps with recall. It also puts the focus on  why each step is done (the intuition for choosing the step), not just  how (ie, the rule that justifies the step).", "posttime": "2020-06-23 00:19:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "记忆,prediction,预测", "title": "记忆预测不对称", "title_en": "Memory-Prediction Asymmetry", "transed": 1, "url": "https://heteroskedasticblog.wordpress.com/2020/06/21/memory-prediction-asymmetry/", "via": "", "real_tags": ["记忆", "预测"]}, {"category": "", "categoryclass": "", "imagename": "7c83256d6ac63694f9a33359e22a432e.jpg", "infoid": 1007661, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "线性规划是数学规划中使用的一组技术，有时也称为数学优化，用于求解线性方程组和不等式系统，同时最大化或最小化某些线性函数。它在科学计算、经济、技术科学、制造、交通、军事、管理、能源等领域都很重要。\nPython生态系统为线性编程提供了几个全面而强大的工具。您可以选择简单和复杂的工具，也可以选择免费的和商业的工具。这完全取决于你的需要。\n您将首先了解线性规划的基础知识。然后，您将探索如何在Python中实现线性编程技术。最后，您将查看资源和库来帮助您进一步了解线性编程之旅。\n免费奖励：关于Python掌握的5点想法，这是一门面向Python开发人员的免费课程，它向您展示了将Python技能提升到更高水平所需的路线图和心态。\n在本节中，您将学习线性编程的基础知识以及相关学科混合整数线性编程。在下一节中，您将看到一些实用的线性编程示例。稍后，您将使用Python解决线性规划和混合整数线性规划问题。\n想象一下，你有一个由线性方程和不等式组成的系统。这样的系统通常有许多可能的解决方案。线性规划是一组数学和计算工具，允许您找到此系统的特定解，该解对应于某个其他线性函数的最大值或最小值。\n混合整数线性规划是线性规划的推广。它处理至少有一个变量取离散整数而不是连续值的问题。虽然混合整数问题乍看起来类似于连续变量问题，但它们在灵活性和精确度方面具有显著的优势。\n整数变量对于正确表示用整数自然表示的数量非常重要，例如生产的飞机数量或服务的客户数量。\n一种特别重要的整数变量是二进制变量。它只能取0或1的值，在做出是或否的决定时很有用，比如是否应该建造一座工厂，或者是否应该打开或关闭一台机器。您还可以使用它们来模拟逻辑约束。\n线性规划是一种基本的优化技术，在科学和数学密集型领域已经使用了几十年。它精确、相对快速，适合于一系列实际应用。\n混合整数线性编程允许您克服线性编程的许多限制。您可以使用分段线性函数近似非线性函数、使用半连续变量、建立逻辑约束模型等。这是一个计算密集的工具，但计算机硬件和软件的进步使它每天都更适用。\n通常，当人们试图描述和解决优化问题时，第一个问题是他们是否可以应用线性规划或混合整数线性规划。\n下面的文章说明了线性规划和混合整数线性规划的一些使用案例：\n随着计算机能力的提高、算法的改进以及用户友好的软件解决方案的出现，线性规划(尤其是混合整数线性规划)的重要性随着时间的推移而增加。\n解决线性规划问题的基本方法称为单纯形法，它有几种变体。另一种流行的方法是内点法。\n混合整数线性规划问题是用更复杂和计算密集的方法来解决的，比如分支定界法，它在引擎盖下使用线性规划。这种方法的一些变体是分支切割法，它涉及到切割平面的使用，以及分支价格法。\n有几个适用且广为人知的Python工具可用于线性编程和混合整数线性编程。其中一些是开源的，而另一些是专有的。您是否需要免费或付费工具取决于问题的大小和复杂程度，以及对速度和灵活性的需求。\n值得一提的是，几乎所有广泛使用的线性编程和混合整数线性编程库都是由Fortran、C或C++原生编写的。这是因为线性规划需要计算密集的矩阵(通常很大)。这样的库称为求解器。Python工具只是解算器的包装器。\nPython适合于围绕本机库构建包装器，因为它可以很好地与C/C++配合使用。本教程不需要任何C/C++(或Fortran)，但是如果您想了解更多关于这一很酷的功能，请查看以下资源：\n基本上，当您定义和求解模型时，您使用Python函数或方法来调用执行实际优化工作并将解决方案返回给Python对象的低级库。\n几个免费的Python库专门用于与线性或混合整数线性规划解算器交互：\n在本教程中，您将使用SciPy和PULT来定义和解决线性规划问题。\n与资源分配相关的实际问题，它说明了现实世界方案中的线性规划概念。\n如果线性规划问题没有解，它就是不可行的。当没有解决方案可以同时满足所有约束时，通常会发生这种情况。\n例如，考虑如果添加约束x+y≤−1会发生什么情况，那么至少有一个决策变量(x或y)必须为负。这与给定的约束x≥0和y≥0冲突。这样的系统没有可行的方案，所以叫不可行。\n另一个示例是添加与绿线平行的第二个相等约束。这两条线没有共同点，因此不会有同时满足两个约束的解决方案。\n一个线性规划问题是无界的，如果它的可行域不是有界的，解也不是有限的。这意味着您的变量中至少有一个是不受约束的，可以达到正无穷大或负无穷大，从而使目标也是无限的。\n例如，假设您采用上面的初始问题，并删除红色和黄色约束。把约束从问题中去掉就叫做放松问题。在这种情况下，x和y不会在正值上有界。您可以将它们增加到正无穷大，从而产生无限大的z值。\n在前面的小节中，您看到了一个抽象的线性规划问题，该问题与任何实际应用程序都不相关。在这一小节中，您将发现一个与制造业资源分配相关的更具体、更实用的优化问题。\n假设一家工厂生产四种不同的产品，第一种产品的日生产量是x₁，第二种产品的日生产量是x₂，依此类推。目标是确定每种产品的利润最大化日生产量，同时牢记以下条件：\n第一个、第二个、第三个和第四个产品的单位产品利润分别为20美元、12美元、40美元和25美元。\n由于人力所限，每天的总产量不能超过50台。\n对于第一个产品的每单位，消耗三个单位的原材料A。第二个产品的每单位需要一个单位的原料A和两个单位的原料B。第三个产品的每个单位需要一个单位的A和两个单位的B。最后，第四个产品的每个单位需要三个单位的B。\n由于运输和储存的限制，工厂每天可以消耗多达100个单位的原材料A和90个单位的B。\n目标函数(利润)在条件1中定义，人力约束来源于条件2，对原材料A和B的约束可以从条件3和条件4通过对每个产品的原材料需求求和得到。\n最后，产品数量不能为负，因此所有决策变量必须大于或等于零。\n与前面的示例不同，您不能方便地可视化这个示例，因为它有四个决策变量。然而，无论问题的维度如何，原则都是一样的。\n在本教程中，您将使用两个Python包来解决上述线性规划问题：\n本网站的设置很简单。一旦您安装了它，您就拥有了启动所需的一切。它的子包scipy.Optimize既可以用于线性优化，也可以用于非线性优化。\n纸浆可以让你选择解算器，并以更自然的方式表达问题。纸浆使用的默认解算器是硬币或分支和切割解算器(CBC)。它连接到用于线性松弛的硬币或线性规划求解器(CLP)和用于切割生成的硬币或切割生成器库(CGL)。\n另一个很棒的开源解算器是GNU线性编程工具包(GLPK)。一些著名且非常强大的商业和专有解决方案有Gurobi、CPLEX和XPRESS。\n除了在定义问题时提供灵活性和运行各种求解器的能力外，与Pyomo或CVXOPT等需要更多时间和精力来掌握的替代方案相比，MPOT使用起来不那么复杂。\n要学习本教程，您需要安装SciPy和PULT。下面的示例使用版本1.4.1的SciPy和版本2.1的MPT。\n您可能需要运行Pulptest或sudo Pulptest才能启用纸浆的默认解算器，特别是在使用Linux或Mac时：\n或者，您可以下载、安装和使用GLPK。它是免费和开源的，可以在Windows、MacOS和Linux上运行。在本教程后面的部分中，您将看到如何对纸浆使用GLPK(除了CBC之外)。\n有关更多信息，请参阅GLPK关于使用Windows可执行文件和Linux包安装的教程。\n在本节中，您将学习如何使用SciPy优化和寻根库进行线性编程。\nlinprog()只解决最小化(而不是最大化)问题，不允许带有大于或等于符号(≥)的不等式约束。要解决这些问题，您需要在开始优化之前修改问题：\n您可以最小化z=x+2y的负值(−z=−x−2y)，而不是最大化z=x+2y。\n可以将黄色不等式乘以−1，得到相反的小于或等于符号(≤)，而不是使用大于或等于符号。\n这个系统等同于原来的系统，并且会有相同的解决方案。应用这些改变的唯一原因是为了克服与问题表述相关的本科学计划的局限性。\n&gt；&gt；obj=[-1，-2]&gt；&gt；&gt；#─┬─┬&gt；&gt；&gt；#y&gt；&gt；&gt；#x&gt；&gt；&gt；#│└┤系数。lhs_ineq=[[2，1]，#红色约束左侧.[-4，5]，#蓝色约束左侧.[1，-2]]#黄色约束左侧&gt；&gt；&gt；rhs_ineq=[20，#红色约束右侧.10，#蓝色约束右侧.2]#黄色约束右侧&gt；&gt；lhs_eq=[[-1，5]]#绿色约束左侧&gt；&gt；&gt；rhs_eq=[15]#绿色约束右侧。\n您可以将上述系统中的值放入相应的列表、元组或NumPy数组中：\n约束左侧和右侧的行顺序必须相同。每行代表一个约束。\n来自目标函数和约束左侧的系数的顺序必须匹配。每列对应于单个决策变量。\n下一步是以与系数相同的顺序定义每个变量的界限。在这种情况下，它们都在零和正无穷大之间：\n&gt；&gt；bnd=[(0，Float(&#34；inf&#34；))，#x的边界.(0，Float(&#34；inf&#34；))]#y的边界。\n该语句是多余的，因为linprog()在缺省情况下接受这些界限(从零到正无穷大)。\n最后，是优化和解决您感兴趣的问题的时候了。您可以使用linprog()执行此操作：\n&gt；&gt；opt=linprog(c=obj，A_ub=lhs_ineq，b_ub=rhs_ineq，.。a_eq=lhs_eq，b_eq=rhs_eq，Bound=Bnd，.。method=&#34；修订单纯形&34；)&gt；&gt；&gt；opt con：array([0.])。FUN：-16.818181818181817消息：&#39；优化已成功终止。&#39；NIT：3 SLACK：ARRAY([0.。，18.18181818，3.36363636])状态：0成功：真x：数组([7.72727273，4.54545455])。\n参数C指的是来自目标函数的系数。a_ub和b_ub分别与不等式约束左侧和右侧的系数相关。类似地，a_eq和b_eq指的是等式约束。您可以使用界限来提供决策变量的下限和上限。\n可以使用参数方法定义要使用的线性规划方法。有三个选项：\n.slack是松弛变量的值，也就是约束的左侧和右侧的值之间的差值。\n.status是一个介于0和4之间的整数，它显示解决方案的状态，例如，0表示找到最佳解决方案的时间。\n这就是您获得优化结果的方式。您还可以以图形方式显示它们：\n如前所述，线性规划问题的最优解位于可行域的顶点。在这种情况下，可行区域就是位于蓝线和红线之间的绿线部分。最佳解决方案是表示绿线和红线交点的绿色正方形。\n如果要排除相等(绿色)约束，只需从linprog()调用中删除参数A_eq和b_eq：\n&gt；&gt；opt=linprog(c=obj，A_ub=lhs_ineq，b_ub=rhs_ineq，bound=bnd，.。method=&#34；修订的单纯形&34；)&gt；&gt；&gt；opt con：array([]，dtype=flat64)FUN：-20.714285714285715消息：&#39；优化已成功终止。&#39；NIT：2 SLACK：Array([0.。，0。，9.85714286])状态：0成功：真x：数组([6.42857143，7.14285714])。\n这个解决方案与上一个案例不同。你可以在图表上看到它：\n在本例中，最佳解决方案是红色和蓝色约束相交的可行(灰色)区域的紫色顶点。其他顶点(如黄色顶点)的目标函数值较高。\n您可以使用SciPy来解决前面部分所述的资源分配问题：\n与上一个示例一样，您需要从上面的问题中提取必要的向量和矩阵，将它们作为参数传递给.linprog()，并获得结果：\n&gt；&gt；obj=[-20，-12，-40，-25]&gt；&gt；&gt；lhs_ineq=[[1，1，1，1]，#人力.[3，2，1，0]，#物料A.[0，1，2，3]]#物料B&gt；&gt；&gt；rhs_ineq=[50，#人力.100，#物料A.90]#物料B&&gt;；&gt；&gt；opt=linprog(c=obj，A_uB=lhs_ineq，b_ub=rhs_ineq，.。method=&#34；修订的单工&34；)&gt；&gt；&gt；opt con：Array([]，dtype=Float64)FUN：-1900.0消息：&#39；优化已成功终止。&#39；NIT：2 SLACK：Array([0.，40.，0.])。状态：0成功：true x：array([5.，0.，45.，0.])。\n结果告诉您，最大利润为1,900，对应于x₁=5和x₃=45。在特定条件下生产第二和第四种产品是无利可图的。您可以在这里得出几个有趣的结论：\n第三种产品带来的单位利润最大，所以工厂将生产最多的产品。\n第一个松弛为0，这意味着人力(第一)约束的左侧和右侧的值相同。这家工厂每天生产50台，已经满负荷了。\n第二个缺口是40个，因为工厂消耗了潜在100个单位中的60个单位的原材料A(第一个产品15个单位，第三个产品45个单位)。\n第三个缺口是0，这意味着工厂消耗了全部90个单位的原材料B。这个全部数量被消耗在第三个产品上。这就是为什么工厂根本不能生产第二个或第四个产品，第三个产品的产量不能超过45个单位。它缺少原料B。\nopt.status为0，opt.Success为True，表示优化问题用最优可行解成功解决。\nSciPy的线性规划功能主要适用于较小的问题。对于更大、更复杂的问题，您可能会发现其他库更适合，原因如下：\nSciPy不提供促进模型构建的类或函数。您必须定义数组和矩阵，对于大型问题，这可能是一项乏味且容易出错的任务。\nSciPy不允许您直接定义最大化问题。您必须将它们转换为最小化问题。\nSciPy不允许您直接使用大于或等于符号来定义约束。您必须使用小于或等于-to。\n幸运的是，Python生态系统为线性编程提供了几种替代解决方案，对于较大的问题非常有用。其中之一是纸浆，你将在下一节看到它的作用。\n纸浆具有比SciPy更方便的线性规划API。您不必对问题进行数学修改，也不必使用向量和矩阵。一切都更干净，更不容易出错。\n您可以使用Sense参数选择是执行最小化(LpMinimize或1，这是默认值)还是执行最大化(LpMaximize或-1)。此选择将影响您问题的结果。\n一旦拥有了模型，您就可以将决策变量定义为LpVariable类的实例：\n您需要为lowBound=0提供一个下限，因为默认值是负无穷大。参数upbound定义了上限，但是您可以在这里省略它，因为它默认为正无穷大。\n可选参数cat定义决策变量的类别。如果您使用的是连续变量，那么您可以使用默认值&#34；连续&#34；。\n可以使用变量x和y创建表示线性表达式和约束的其他纸浆对象：\n&gt；&gt；表达式=2*x+4*y&gt；&gt；&gt；type(表达式)&lt；class&#39；Pulp.Pulp.LpAffineExpression&#39；&gt；&gt；&gt；Constraint=2*x+4*y&gt；=8&gt；&gt；&gt；type(Constraint)&。&gt；\n当您将一个决策变量与标量相乘或构建多个决策变量的线性组合时，您将获得一个表示线性表达式的Pulp.LpAffineExpression实例。\n注意：您可以添加或减去变量或表达式，也可以将它们与常量相乘，因为纸浆类实现了一些Python特殊方法，这些方法模拟数字类型，如__add__()、__sub_()和__mul__()。这些方法用于自定义+、-和*等运算符的行为。\n同样，您可以将线性表达式、变量和标量与操作符==、&lt；=或&gt；=组合在一起，以获得表示模型线性约束的Pulp.LpConstraint实例。\n注意：也可以使用丰富的比较方法构建约束。__eq_。\n..", "note_en": "Linear programming is a set of techniques used in   mathematical programming, sometimes called mathematical optimization, to solve  systems of linear equations and inequalities while maximizing or minimizing some  linear function. It’s important in fields like scientific computing, economics, technical sciences, manufacturing, transportation, military, management, energy, and so on.\n The Python ecosystem offers several comprehensive and powerful tools for linear programming. You can choose between simple and complex tools as well as between free and commercial ones. It all depends on your needs.\n   You’ll first learn about the  fundamentals of linear programming. Then you’ll explore how to implement linear programming techniques in Python. Finally, you’ll look at resources and libraries to help further your linear programming journey.\n Free Bonus:  5 Thoughts On Python Mastery, a free course for Python developers that shows you the roadmap and the mindset you&#39;ll need to take your Python skills to the next level.\n  In this section, you’ll learn the basics of linear programming and a related discipline, mixed-integer linear programming. In the  next section, you’ll see some practical linear programming examples. Later, you’ll solve linear programming and mixed-integer linear programming problems with Python.\n Imagine that you have a system of linear equations and inequalities. Such systems often have many possible solutions. Linear programming is a set of mathematical and computational tools that allows you to find a particular solution to this system that corresponds to the maximum or minimum of some other linear function.\n Mixed-integer linear programming is an extension of linear programming. It handles problems in which at least one variable takes a discrete integer rather than a  continuous value. Although mixed-integer problems look similar to continuous variable problems at first sight, they offer significant advantages in terms of flexibility and precision.\n Integer variables are important for properly representing quantities naturally expressed with integers, like the number of airplanes produced or the number of customers served.\n A particularly important kind of integer variable is the  binary variable. It can take only the values  zero or  one and is useful in making yes-or-no decisions, such as whether a plant should be built or if a machine should be turned on or off. You can also use them to mimic logical constraints.\n Linear programming is a fundamental optimization technique that’s been used for decades in science- and math-intensive fields. It’s precise, relatively fast, and suitable for a range of practical applications.\n Mixed-integer linear programming allows you to overcome many of the limitations of linear programming. You can approximate non-linear functions with  piecewise linear functions, use  semi-continuous variables, model logical constraints, and more. It’s a computationally intensive tool, but the advances in computer hardware and software make it more applicable every day.\n Often, when people try to formulate and solve an optimization problem, the first question is whether they can apply linear programming or mixed-integer linear programming.\n Some use cases of linear programming and mixed-integer linear programming are illustrated in the following articles:\n  The importance of linear programming, and especially mixed-integer linear programming, has increased over time as computers have gotten more capable, algorithms have improved, and more user-friendly software solutions have become available.\n The basic method for solving linear programming problems is called the   simplex method, which has several variants. Another popular approach is the   interior-point method.\n Mixed-integer linear programming problems are solved with more complex and computationally intensive methods like the   branch-and-bound method, which uses linear programming under the hood. Some variants of this method are the   branch-and-cut method, which involves the use of  cutting planes, and the   branch-and-price method.\n There are several suitable and well-known Python tools for linear programming and mixed-integer linear programming. Some of them are open source, while others are proprietary. Whether you need a free or paid tool depends on the size and complexity of your problem as well as on the need for speed and flexibility.\n It’s worth mentioning that almost all widely used linear programming and mixed-integer linear programming libraries are native to and written in Fortran or C or C++. This is because linear programming requires computationally intensive work with (often large) matrices. Such libraries are called  solvers. The Python tools are just wrappers around the solvers.\n Python is suitable for building wrappers around native libraries because it works well with C/C++. You’re not going to need any C/C++ (or Fortran) for this tutorial, but if you want to learn more about this cool feature, then check out the following resources:\n  Basically, when you define and solve a model, you use Python functions or methods to call a low-level library that does the actual optimization job and returns the solution to your Python object.\n Several free Python libraries are specialized to interact with linear or mixed-integer linear programming solvers:\n  In this tutorial, you’ll use  SciPy and  PuLP to define and solve linear programming problems.\n A practical problem related to resource allocation that illustrates linear programming concepts in a real-world scenario\n   A linear programming problem is  infeasible if it doesn’t have a solution. This usually happens when no solution can satisfy all constraints at once.\n For example, consider what would happen if you added the constraint  x +  y ≤ −1. Then at least one of the decision variables ( x or  y) would have to be negative. This is in conflict with the given constraints  x ≥ 0 and  y ≥ 0. Such a system doesn’t have a feasible solution, so it’s called infeasible.\n Another example would be adding a second equality constraint parallel to the green line. These two lines wouldn’t have a point in common, so there wouldn’t be a solution that satisfies both constraints.\n A linear programming problem is  unbounded if its feasible region isn’t bounded and the solution is not finite. This means that at least one of your variables isn’t constrained and can reach to positive or negative infinity, making the objective infinite as well.\n For example, say you take the initial problem above and drop the red and yellow constraints. Dropping constraints out of a problem is called  relaxing the problem. In such a case,  x and  y wouldn’t be bounded on the positive side. You’d be able to increase them toward positive infinity, yielding an infinitely large  z value.\n In the previous sections, you looked at an abstract linear programming problem that wasn’t tied to any real-world application. In this subsection, you’ll find a more concrete and practical optimization problem related to resource allocation in manufacturing.\n Say that a factory produces four different products, and that the daily produced amount of the first product is  x₁, the amount produced of the second product is  x₂, and so on. The goal is to determine the profit-maximizing daily production amount for each product, bearing in mind the following conditions:\n The profit per unit of product is $20, $12, $40, and $25 for the first, second, third, and fourth product, respectively.\n Due to manpower constraints, the total number of units produced per day can’t exceed fifty.\n For each unit of the first product, three units of the raw material A are consumed. Each unit of the second product requires one unit of the raw material A and two units of the raw material B. Each unit of the third product needs one unit of A and two units of B. Finally, each unit of the fourth product requires three units of B.\n Due to the transportation and storage constraints, the factory can consume up to one hundred units of the raw material A and ninety units of B per day.\n   The objective function (profit) is defined in condition 1. The manpower constraint follows from condition 2. The constraints on the raw materials A and B can be derived from conditions 3 and 4 by summing the raw material requirements for each product.\n Finally, the product amounts can’t be negative, so all decision variables must be greater than or equal to zero.\n Unlike the previous example, you can’t conveniently visualize this one because it has four decision variables. However, the principles remain the same regardless of the dimensionality of the problem.\n In this tutorial, you’ll use two Python packages to solve the linear programming problem described above:\n  SciPy is straightforward to set up. Once you install it, you’ll have everything you need to start. Its subpackage    scipy.optimize can be used for both linear and  nonlinear optimization.\n PuLP allows you to choose solvers and formulate problems in a more natural way. The default solver used by PuLP is the  COIN-OR Branch and Cut Solver (CBC). It’s connected to the  COIN-OR Linear Programming Solver (CLP) for linear relaxations and the  COIN-OR Cut Generator Library (CGL) for cuts generation.\n Another great open source solver is the  GNU Linear Programming Kit (GLPK). Some well-known and very powerful commercial and proprietary solutions are  Gurobi,  CPLEX, and  XPRESS.\n Besides offering flexibility when defining problems and the ability to run various solvers, PuLP is less complicated to use than alternatives like Pyomo or CVXOPT, which require more time and effort to master.\n  To follow this tutorial, you’ll need to install SciPy and PuLP. The examples below use version 1.4.1 of SciPy and version 2.1 of PuLP.\n   You might need to run  pulptest or  sudo pulptest to enable the default solvers for PuLP, especially if you’re using Linux or Mac:\n  Optionally, you can download, install, and use GLPK. It’s free and open source and works on Windows, MacOS, and Linux. You’ll see how to use GLPK (in addition to CBC) with PuLP later in this tutorial.\n            See GLPK’s tutorials on installing with  Windows executables and  Linux packages for more information.\n In this section, you’ll learn how to use the SciPy  optimization and root-finding library for linear programming.\n    linprog() solves only minimization (not maximization) problems and doesn’t allow inequality constraints with the greater than or equal to sign (≥). To work around these issues, you need to modify your problem before starting optimization:\n Instead of maximizing  z =  x +  2y, you can minimize its negative(− z = − x −  2y).\n Instead of having the greater than or equal to sign, you can multiply the yellow inequality by −1 and get the opposite less than or equal to sign (≤).\n   This system is equivalent to the original and will have the same solution. The only reason to apply these changes is to overcome the limitations of SciPy related to the problem formulation.\n  &gt;&gt;&gt; &gt;&gt;&gt;  obj  =  [ - 1 ,  - 2 ] &gt;&gt;&gt;  # ─┬ ─┬ &gt;&gt;&gt;  # │ └┤ Coefficient for y &gt;&gt;&gt;  # └────┤ Coefficient for x &gt;&gt;&gt;  lhs_ineq  =  [[  2 ,  1 ],  # Red constraint left side ...   [ - 4 ,  5 ],  # Blue constraint left side ...   [  1 ,  - 2 ]]  # Yellow constraint left side &gt;&gt;&gt;  rhs_ineq  =  [ 20 ,  # Red constraint right side ...   10 ,  # Blue constraint right side ...   2 ]  # Yellow constraint right side &gt;&gt;&gt;  lhs_eq  =  [[ - 1 ,  5 ]]  # Green constraint left side &gt;&gt;&gt;  rhs_eq  =  [ 15 ]  # Green constraint right side\n You put the values from the system above into the appropriate  lists, tuples, or  NumPy arrays:\n  The order of the rows for the left and right sides of the constraints must be the same. Each row represents one constraint.\n The order of the coefficients from the objective function and left sides of the constraints must match. Each column corresponds to a single decision variable.\n The next step is to define the bounds for each variable in the same order as the coefficients. In this case, they’re both between zero and positive infinity:\n &gt;&gt;&gt; &gt;&gt;&gt;  bnd  =  [( 0 ,  float ( &#34;inf&#34; )),  # Bounds of x ...   ( 0 ,  float ( &#34;inf&#34; ))]  # Bounds of y\n This statement is redundant because  linprog() takes these bounds (zero to positive infinity) by default.\n  Finally, it’s time to optimize and solve your problem of interest. You can do that with  linprog():\n &gt;&gt;&gt; &gt;&gt;&gt;  opt  =  linprog ( c = obj ,  A_ub = lhs_ineq ,  b_ub = rhs_ineq , ...   A_eq = lhs_eq ,  b_eq = rhs_eq ,  bounds = bnd , ...   method = &#34;revised simplex&#34; ) &gt;&gt;&gt;  opt  con: array([0.])  fun: -16.818181818181817  message: &#39;Optimization terminated successfully.&#39;  nit: 3  slack: array([ 0. , 18.18181818, 3.36363636])  status: 0  success: True  x: array([7.72727273, 4.54545455])\n The parameter  c refers to the coefficients from the objective function.  A_ub and  b_ub are related to the coefficients from the left and right sides of the inequality constraints, respectively. Similarly,  A_eq and  b_eq refer to equality constraints. You can use  bounds to provide the lower and upper bounds on the decision variables.\n You can use the parameter  method to define the linear programming method that you want to use. There are three options:\n   .slack is the values of the slack variables, or the differences between the values of the left and right sides of the constraints.\n .status is an integer between  0 and  4 that shows the status of the solution, such as  0 for when the optimal solution has been found.\n   That’s how you get the results of optimization. You can also show them graphically:\n  As discussed earlier, the optimal solutions to linear programming problems lie at the vertices of the feasible regions. In this case, the feasible region is just the portion of the green line between the blue and red lines. The optimal solution is the green square that represents the point of intersection between the green and red lines.\n If you want to exclude the equality (green) constraint, just drop the parameters  A_eq and  b_eq from the  linprog() call:\n &gt;&gt;&gt; &gt;&gt;&gt;  opt  =  linprog ( c = obj ,  A_ub = lhs_ineq ,  b_ub = rhs_ineq ,  bounds = bnd , ...   method = &#34;revised simplex&#34; ) &gt;&gt;&gt;  opt  con: array([], dtype=float64)  fun: -20.714285714285715  message: &#39;Optimization terminated successfully.&#39;  nit: 2  slack: array([0. , 0. , 9.85714286])  status: 0  success: True  x: array([6.42857143, 7.14285714]))\n The solution is different from the previous case. You can see it on the chart:\n  In this example, the optimal solution is the purple vertex of the feasible (gray) region where the red and blue constraints intersect. Other vertices, like the yellow one, have higher values for the objective function.\n You can use SciPy to solve the resource allocation problem stated in the  earlier section:\n  As in the previous example, you need to extract the necessary vectors and matrix from the problem above, pass them as the arguments to  .linprog(), and get the results:\n &gt;&gt;&gt; &gt;&gt;&gt;  obj  =  [ - 20 ,  - 12 ,  - 40 ,  - 25 ] &gt;&gt;&gt;  lhs_ineq  =  [[ 1 ,  1 ,  1 ,  1 ],  # Manpower ...   [ 3 ,  2 ,  1 ,  0 ],  # Material A ...   [ 0 ,  1 ,  2 ,  3 ]]  # Material B &gt;&gt;&gt;  rhs_ineq  =  [  50 ,  # Manpower ...   100 ,  # Material A ...   90 ]  # Material B &gt;&gt;&gt;  opt  =  linprog ( c = obj ,  A_ub = lhs_ineq ,  b_ub = rhs_ineq , ...   method = &#34;revised simplex&#34; ) &gt;&gt;&gt;  opt  con: array([], dtype=float64)  fun: -1900.0  message: &#39;Optimization terminated successfully.&#39;  nit: 2  slack: array([ 0., 40., 0.])  status: 0  success: True  x: array([ 5., 0., 45., 0.])\n The result tells you that the maximal profit is  1900 and corresponds to  x₁ = 5 and  x₃ = 45. It’s not profitable to produce the second and fourth products under the given conditions. You can draw several interesting conclusions here:\n The third product brings the largest profit per unit, so the factory will produce it the most.\n The first slack is  0, which means that the values of the left and right sides of the manpower (first) constraint are the same. The factory produces  50 units per day, and that’s its full capacity.\n The second slack is  40 because the factory consumes 60 units of raw material A (15 units for the first product plus 45 for the third) out of a potential  100 units.\n The third slack is  0, which means that the factory consumes all  90 units of the raw material B. This entire amount is consumed for the third product. That’s why the factory can’t produce the second or fourth product at all and can’t produce more than  45 units of the third product. It lacks the raw material B.\n opt.status is  0 and  opt.success is  True, indicating that the optimization problem was successfully solved with the optimal feasible solution.\n SciPy’s linear programming capabilities are useful mainly for smaller problems. For larger and more complex problems, you might find other libraries more suitable for the following reasons:\n SciPy doesn’t provide classes or functions that facilitate model building. You have to define arrays and matrices, which might be a tedious and error-prone task for large problems.\n SciPy doesn’t allow you to define maximization problems directly. You must convert them to minimization problems.\n SciPy doesn’t allow you to define constraints using the greater-than-or-equal-to sign directly. You must use the less-than-or-equal-to instead.\n Fortunately, the Python ecosystem offers several alternative solutions for linear programming that are very useful for larger problems. One of them is PuLP, which you’ll see in action in the next section.\n PuLP has a more convenient linear programming API than SciPy. You don’t have to mathematically modify your problem or use vectors and matrices. Everything is cleaner and less prone to errors.\n    You use the  sense parameter to choose whether to perform minimization (  LpMinimize or  1, which is the default) or maximization (  LpMaximize or  -1). This choice will affect the result of your problem.\n Once that you have the model, you can define the decision variables as instances of the   LpVariable class:\n  You need to provide a lower bound with  lowBound=0 because the default value is negative infinity. The parameter  upBound defines the upper bound, but you can omit it here because it defaults to positive infinity.\n The optional parameter  cat defines the category of a decision variable. If you’re working with continuous variables, then you can use the default value  &#34;Continuous&#34;.\n You can use the variables  x and  y to create other PuLP objects that represent linear expressions and constraints:\n &gt;&gt;&gt; &gt;&gt;&gt;  expression  =  2  *  x  +  4  *  y &gt;&gt;&gt;  type ( expression ) &lt;class &#39;pulp.pulp.LpAffineExpression&#39;&gt; &gt;&gt;&gt;  constraint  =  2  *  x  +  4  *  y  &gt;=  8 &gt;&gt;&gt;  type ( constraint ) &lt;class &#39;pulp.pulp.LpConstraint&#39;&gt;\n When you multiply a decision variable with a scalar or build a linear combination of multiple decision variables, you get an instance of   pulp.LpAffineExpression that represents a linear expression.\n Note: You can add or subtract variables or expressions, and you can multiply them with constants because PuLP classes implement some of the  Python special methods that  emulate numeric types like   __add__(),   __sub__(), and   __mul__(). These methods are used to customize the behavior of operators like  +,  -, and  *.\n Similarly, you can combine linear expressions, variables, and scalars with the  operators  ==,  &lt;=, or  &gt;= to get instances of  pulp.LpConstraint that represent the linear constraints of your model.\n Note: It’s also possible to build constraints with the rich comparison methods   .__eq_\n......", "posttime": "2020-06-22 23:55:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,programming,操作,linear,问题", "title": "实践操作线性规划：使用Python进行优化", "title_en": "Hands-On Linear Programming: Optimization with Python", "transed": 1, "url": "https://realpython.com/linear-programming-python/", "via": "", "real_tags": ["python", "操作", "linear", "问题"]}, {"category": "", "categoryclass": "", "imagename": "5cbd4bf80b11a907d58e721ffb30e192.jpg", "infoid": 1007660, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "安德鲁·杨(Andrew Yang)希望人们为他们在Facebook和谷歌等大型科技平台上创建的数据付费，随着一个新项目于周一启动，他相信自己可以实现这一目标。\n杨的数据红利项目是一个新的项目，任务是在全国范围内根据加州消费者隐私法(CCPA)等隐私法建立数据即财产权。该项目希望在今年年底前动员100多万人，主要集中在加州人身上，如果他们选择与平台共享数据，“为所有美国人都可以声称自己的数据是产权并获得付款的未来铺平道路”。\n今年年初，CCPA生效，赋予消费者对他们在线数据的新控制权，比如删除和选择退出出售他们的个人信息的权利。法律中没有关于科技公司为数据付费(或者更具体地说，付钱让他们不要选择退出)的规定，但杨的新项目希望表明这个想法在选民中很受欢迎。数据红利项目将赌注押在集体行动上，将其作为修改法律和将数据财产权扩展到全国用户的一种手段。如果这一想法成为法律，杨的团队表示，它将代表用户的利益，帮助他们获得报酬。\n杨告诉The Verge：“我们的武器完全被科技公司超过了。”“我们只是收到了这些条款和条件。从来没有人读过它们。你只需点击它们，然后期待最好的结果。不幸的是，最好的情况并没有发生。“。\n像参议员约翰·肯尼迪(R-LA)这样的立法者过去曾提出立法，授予人们对他们在网上产生的数据的财产权，但所有类似的措施都未能在国会获得太多势头。一些人担心，数据所有权是保护在线用户隐私的错误方法，只会激励用户出卖自己的隐私，而不是保护隐私。\n“这是一个我们的立法者基本上缺席的问题，”杨说。“我认为我们应该在立法上推动更好的安排。”\n该项目的注册表要求人们输入他们在网上使用的所有电子邮件地址，以帮助识别目前有多少平台从个人数据中获利。它还要求用户提供他们的贝宝(PayPal)信息，这样最终可能从平台获得的任何资金都可以直接存入用户的账户。\n用户为他们创建的数据付费在一些科技思想家中是一个流行的想法，比如Jaron Lanier，杨说他受到了这个人的影响。Facebook已经向一些用户支付了数据费用，但只有在特定情况下才会如此。去年，该公司推出了自己的学习应用程序，向允许公司监控他们使用的功能和在平台上花费的时间的用户支付费用。今年早些时候，Facebook甚至提出向一些用户支付语音录音费用，以帮助改进其语音识别技术。\n但杨的数据红利项目希望通过将数据支付置于法律之上，而不仅仅是平台偶尔为特定服务做的事情，从而进一步推动数据支付。\n杨说：“这是人们通过DDP For All获得股息的第一天，这将是如此伟大的一天，因为你可以想象数以千计甚至数万美国人通过他们的贝宝(PayPal)或现金应用(Cash App)获得一些东西。”“即使是20美元、50美元或100美元这样的价格，他们也会告诉他们的朋友，我们就可以改变整个行业的做法。”", "note_en": "Andrew Yang wants people to get paid for the data they create on big tech platforms like Facebook and Google, and with a new project launching on Monday, he believes he can make it happen.\n Yang’s  Data Dividend Project is a new program tasked with establishing data-as-property rights under privacy laws like the California Consumer Privacy Act (CCPA) all across the country. The program hopes to mobilize over 1 million people by the end of the year, focusing primarily on Californians, and “pave the way for a future in which all Americans can claim their data as a property right and receive payment” if they choose to share their data with platforms.\n  At the beginning of the year, the CCPA went into effect, granting consumers new control over their data online like the right to delete and opt out of the sale of their personal information. There’s nothing in the law about tech companies paying for data (or, more specifically, paying them not to opt out), but Yang’s new project is looking to show that the idea is popular with voters. The Data Dividend Project is betting on collective action as a means of changing the law and extending data property rights to users across the country. If this idea becomes law, Yang’s team says it will work on behalf of users to help them get paid.\n “We are completely outgunned by tech companies,” Yang told  The Verge. “We’re just presented with these terms and conditions. No one ever reads them. You just click on them and hope for the best. And unfortunately, the best has not happened.”\n Lawmakers like Sen. John Kennedy (R-LA) have introduced legislation in the past that would  grant people property rights over the data they generate online, but all measures like it have failed to gain much momentum in Congress. Some people fear that  data ownership is the wrong approach to protecting user privacy online and only incentivizes users to sell away their privacy instead of protecting it.\n “It’s a question that our lawmakers have been essentially absent from,” Yang said. “I think there are even better arrangements that we should be pushing for legislatively.”\n The project’s signup form asks for people to put in all of the email addresses they use online to help identify how many platforms are currently profiting off of an individual’s data. It also asks for users to provide their PayPal information so any money that could eventually be gained from platforms could be deposited directly into a user’s account.\n Users getting paid for the data they create is a popular idea among some tech thinkers  like Jaron Lanier, someone Yang says he’s been influenced by. Facebook already pays some users for data but only under specific circumstances. Last year, the company  launched its Study app that paid users who allowed the company to monitor the features they used and the time they spent on the platform. Earlier this year, Facebook even offered to pay some users  for voice recordings to help improve its speech recognition technology.\n But Yang’s Data Dividend Project wants to take data payment further by grounding it in the law, not just something platforms occasionally do for specific services.\n “It’s that first day that people get paid their dividend through DDP for All is going to be such a great day because you can imagine thousands and even tens of thousands of Americans getting something in their PayPal or Cash App,” Yang said. “Even something like $20, $50, or $100, and they’ll tell their friends, and we can change practices industry-wide.”", "posttime": "2020-06-22 23:54:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "杨正在,yang,数据", "title": "安德鲁·杨正在推动Big Tech向用户支付数据费用", "title_en": "Andrew Yang is pushing Big Tech to pay users for data", "transed": 1, "url": "https://www.theverge.com/2020/6/22/21298919/andrew-yang-big-tech-data-dividend-project-facebook-google-ubi", "via": "", "real_tags": ["杨正在", "yang", "数据"]}, {"category": "", "categoryclass": "", "imagename": "f7fa3af41cfa5db732abb6cd9de4b074.gif", "infoid": 1007658, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "源文档由SooHee Cho(The Intercept)提供给DocumentCloud。", "note_en": "Source document contributed to DocumentCloud by SooHee Cho (The Intercept).", "posttime": "2020-06-22 23:53:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,战争,wargame,soohee", "title": "五角大楼战争游戏场景：2025年Z世代黑暗网络叛乱", "title_en": "Pentagon Wargame Scenario: 2025 Generation Z Dark Web Rebellion", "transed": 1, "url": "https://www.documentcloud.org/documents/6936805-JLASS-Document.html", "via": "", "real_tags": ["游戏", "战争", "wargame", "soohee"]}, {"category": "", "categoryclass": "", "imagename": "f3597621c1708e6053f4e8484338d3d9.jpg", "infoid": 1007657, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当加拿大的空气开始干燥时，男人们蜂拥到桑迪·斯科特尼基的办公室。男人们都很痒。斯科特尼基在成为多伦多大学皮肤科助理教授之前学习微生物学。她已经练习了23年，总是关注环境-包括我们皮肤上的微生物-是如何影响健康的。“我对他们说，‘你们怎么洗澡？’ ，”她告诉我。“他们拿着橡皮擦的东西，用某种男士沐浴露洗全身。他们一天洗两次澡，因为他们在锻炼。一旦我让他们停止这样做，只洗他们的东西，他们就完全没事了。“。\n“可能是腋下，腹股沟，脚，”她说。“那么当你在淋浴或洗澡的时候，你需要在这里洗澡吗？”她指着她的前臂。“没有”即使只有水，特别是热水，也会慢慢地剥离皮肤外层有助于保持水分的油脂-而且一个人的皮肤越干燥、越多孔，就越容易受到刺激物和过敏原的影响。\n斯科特尼基认为，这是过度清洗促使湿疹在具有疾病遗传易感性的人身上爆发的一种方式。虽然湿疹本身可能会使人虚弱，但它通常不会独自旅行。这似乎是免疫系统失火引起的一系列疾病的一部分。患有湿疹的婴儿在童年时期患过敏性鼻炎或哮喘的风险增加，这是被称为“特应性进行曲”的一系列免疫系统过度反应的一部分。\n“那么，”斯科特尼基推测，“作为一个社会，如果你真的因为过度洗澡而引发湿疹，那又会怎样呢？”\n这是一个更奇怪的时间来质疑洗涤。在过去的三年里，我一直在报道我们对“干净”的概念是如何随着时间的推移而演变的-从基本的卫生习惯到复杂的仪式，涉及到根据性别、年龄和“皮肤类型”针对我们每个人的数十种产品。与此同时，在发达国家，湿疹和牛皮癣等与免疫相关的皮肤病的发病率有所上升，而痤疮一如既往地有害，尽管不断有昂贵的新药和软膏出售来解决它。\n虽然没有人希望以这种方式发生，但这场大流行可能标志着一个机会，让我们重新审视多少清洁对我们有好处，以及没有什么做法会让我们过得更好。让我们从显而易见的事情开始：洗手，每天洗手20秒，多次洗手。这可能是防止冠状病毒传播所能做的最有价值的一件事。\n美国人对这一基本建议的抵触是出了名的，但我们也忽视了生活在我们皮肤上的数以万亿计的微生物的重要性，皮肤是免疫系统中最大的器官。2014年，研究人员在北卡罗来纳州刮了一小群志愿者的脸，发现他们的毛孔里钻了一种名为蠕形螨的微小螨类的DNA证据，公众很早就意识到我们的皮肤上有厚厚的蠕虫。无色蜘蛛的发现登上了全国的头条新闻，引起了广泛的呼声：马上把这些东西从我身上拿下来。但是，尽管半毫米大小的细菌密度异常高，与酒渣鼻有关，但它们几乎肯定会有一些有用的用途。米歇尔·特劳特温(Michelle Trautwein)是加州科学院(California Academy Of Sciences)营养学(对苍蝇的研究)的捐赠主席，也是这项研究的合著者之一。她告诉我，蠕形螨可能会以我们死去的皮肤细胞为食--使它们成为所有脱角剂中最“天然”的。\n像这样的科学发现颠覆了细菌理论的传统观念，即我们必须击退微生物才能避免疾病的想法。微生物和它们的宿主--也就是你和我--之间的关系更多的是与环境和平衡有关。与其说自我和他者是一个二分法，不如说它是一个连续体。\n这一新认识的含义可能会对我们如何护理皮肤产生深远的影响。比如，加州大学圣地亚哥分校皮肤科医生理查德·加洛(Richard Gallo)最近领导的一项研究。他的团队用一种存在于大多数人类皮肤上的叫做表皮葡萄球菌的细菌覆盖了一组小鼠；另一组小鼠沐浴的是同一种细菌的不同菌株。然后，所有的小鼠都被晒黑了-那些涂有一种葡萄球菌表皮的小鼠患皮肤癌的几率较低。盖洛推测，原因是这种菌株产生一种名为6-N-羟基氨基嘌呤的化合物，这种化合物似乎可以阻止肿瘤细胞的复制。\n失去平衡的皮肤微生物群不仅仅是过度使用肥皂和擦洗的结果。我们也接触过具有抗菌特性的防腐剂。其中最重要的是对羟基苯甲酸酯，它已经被用来延长许多卫生和美容产品的保质期-除臭剂、化妆品、牙膏、洗发水-以及包装食品。少量的对羟基苯甲酸酯是无害的；人们的担忧源于数十年来的累积暴露。事实上，现在我们所有人的血液或皮肤上都有对羟基苯甲酸，而且，正如预期的那样，它们可以杀死广泛的细菌和真菌。所以问题不是对羟基苯甲酸酯是否改变了我们的微生物群落，而是它有多重要。例如，美国国家过敏和传染病研究所的研究人员报告称，含有对羟基苯甲酸酯的产品可以阻止粘膜玫瑰单胞菌的生长-一种可以杀死另一种细菌的细菌，这种细菌在湿疹爆发期间增殖，称为金黄色葡萄球菌。\n朱莉·塞格雷(Julie Segre)在2012年发布了第一张人类皮肤细菌和真菌多样性的地形图，当她谈到肠道微生物群比皮肤受到的关注要多得多时，她听起来几乎是在为父母辩护。现在马里兰州贝塞斯达国立卫生研究院微生物基因组部门的负责人塞格雷说：“我不明白为什么人们对生活在肠道中的微生物和对生活在皮肤上的微生物有着如此不同的感觉，”塞格雷现在是位于马里兰州贝塞斯达的美国国立卫生研究院微生物基因组学部的负责人，他说：“我不明白为什么人们对生活在肠道中的微生物的感觉与对皮肤上的微生物的感觉如此不同。”“每个人都想吃Activia酸奶，让自己在细菌中定居，然后他们就想用普瑞利(Purell)。”\n风险资本家正投入数百万美元试图改变这一点-这意味着通过开发一种局部益生菌，可以作为日常护肤程序的重要组成部分出售。与此同时，塞格雷的一些科学同事正在测试“细菌疗法”来治疗现有的疾病。NIAID的研究人员尝试在湿疹患者的内肘喷洒前述的玫瑰单胞菌粘膜。根据首席调查员伊恩·迈尔斯(Ian Myles)的说法，经过每周两次的六周应用，大多数患者的红肿和瘙痒等症状都有所减轻。一些人还报告说，即使在治疗停止后，也需要较少的局部类固醇。\nSegre目前看到的希望不是益生菌(从技术上讲，这是微生物本身)，而是益生菌--各种“喂养我们的微生物花园”的产品。正常和有益的微生物已经存在；我们可能不需要添加它们，而是促进它们，她说。市场上已经上市的一些东西可能是益生菌，比如黏土除臭剂，它可以吸收皮脂，可能会限制产生气味的微生物种群。\n从根本上说，从孩提时代开始，在自然界呆上一段时间，似乎是建立和保持健康皮肤生物群的最好方式之一。我们是在其他人、动物、植物及其携带给我们的所有随之而来的微生物的存在下进化的。当然，大流行限制了我们在户外的时间和彼此的接触。就目前而言，有针对性的卫生-再一次，洗手！-和社会距离相当于关键的、拯救生命的医疗干预。但是，尽可能频繁和积极地消灭所有微生物并不总是合适的。就像任何药物一样，越多并不意味着更好。这场流行病的一个永恒的总体主题是：除了根除坏处，我们还需要寻找好的方面。\n至少，我们开始学会不碰自己的脸。我们的螨类可能会心存感激。\n我们想听听您对这篇文章的看法。向编辑提交一封信，或写信给letters@theatlantic.com。\n医学博士，是“大西洋月刊”的特约撰稿人。他也是耶鲁大学公共卫生学院的讲师，也是即将出版的新书“清洁：皮肤的新科学”(Clean：The New Science of Skin)的作者。", "note_en": "I when the Canadian air starts drying out, the men flock to Sandy Skotnicki’s office. The men are itchy. Skotnicki studied microbiology before becoming an assistant professor of dermatology at the University of Toronto. She has been practicing for 23 years, always with an eye to how the environment—including the microbial one on our skin—affects health. “I say to them, ‘How do you shower?’ ” she told me. “They take the squeegee thing and wash their whole body with some sort of men’s body wash. They’re showering twice a day because they’re working out. As soon as I get them to stop doing that and just wash their bits, they’re totally fine.”\n    “Bits would be underarms, groin, feet,” she said. “So when you’re in the shower or the bath, do you need to wash here?” She pointed to her forearm. “No.” Even water alone, especially hot water, slowly strips away the oils in the outer layers of skin that help preserve moisture—and the drier and more porous someone’s skin, the more susceptible it is to irritants and allergens.\n Skotnicki believes that this is one way overwashing prompts eczema to flare in people with a genetic predisposition to the disease. While eczema itself can be debilitating, it often does not travel alone. It seems to be part of a constellation of conditions caused by immune-system misfires. Infants with eczema have  an increased risk of developing allergic rhinitis or asthma in childhood, part of a cascade of immune-system overreactions  known as the “atopic march.”\n    “And so what if,” Skotnicki speculated, “as a society, you actually triggered eczema by overwashing?”\n a weirder time to question washing. I’ve spent the past three years reporting on how our notions of what it means to be “clean” have evolved over time—from basic hygiene practices to elaborate rituals that involve dozens of products targeted at each of us by gender and age and “skin type.” At the same time, the incidence of immune-related skin conditions such as eczema and psoriasis has risen in the developed world, while acne is as pernicious as ever, despite the constant stream of expensive new medications and unguents sold to address it.\n   Though no one would ever wish it to happen this way, the pandemic could mark a chance to reexamine how much cleanliness is good for us, and what practices we’d be better off without. Let’s start with the obvious: Wash your hands, for 20 seconds, many times a day. It’s possibly the single most valuable thing you can do to prevent the spread of the coronavirus.\n  Americans are notoriously resistant to that basic recommendation, but we’ve also been oblivious to the importance of the trillions of microbes that live on our skin, the largest organ in the immune system. An early jolt of public recognition that our skin was thick with them came in 2014, when researchers scraped the faces of a small group of volunteers in North Carolina and  found DNA evidence of microscopic mites called  Demodex burrowed in their pores. The detection of the colorless arachnids  made headlines nationwide, eliciting a widespread cry along the lines of  Get these things off of me this instant. But although an abnormally high density of the half-millimeter bugs has been linked to rosacea, they’re almost surely serving some useful purposes. Michelle Trautwein, an endowed chair of dipterology (the study of flies) at the California Academy of Sciences and a co-author of the study, told me that  Demodex may feed off our dead skin cells—making them the most “natural” exfoliants of all.\n  Scientific findings like these are upending the traditional conception of germ theory, the idea that we must fight off microbes to avoid disease. The relationship between microbes and their hosts—that would be you and me—is more about context and balance. Self and other is less of a dichotomy than a continuum.\n  The implications of this new understanding are likely to have a far-reaching impact on how we take care of our skin. Consider, for example,  a recent study led by the UC San Diego dermatologist Richard Gallo. His team covered one group of mice with a bacterium that is present on most human skin called  Staphylococcus epidermidis; another group got a bath of a different strain of the same bacterium. Then the mice all got suntans—and those coated with one type of the  Staph epidermidis developed fewer skin cancers. The reason, Gallo theorized, is that this strain produces a compound called 6‑N‑hydroxyaminopurine, which seems to prevent the replication of tumor cells.\n    An out-of-balance skin microbiome isn’t just the result of too much soap and scrubbing. We’ve also exposed ourselves to preservatives with antimicrobial properties. Prime among them are parabens, which have been used for the better part of a century to extend the shelf life of many hygiene and beauty products—deodorant, makeup, toothpaste, shampoo—as well as packaged foods. In small amounts, parabens are harmless; the concern arises from cumulative exposure over decades. Virtually all of us now have parabens in our blood or on our skin, and, as intended, they destroy a wide range of bacteria and fungi. So the question isn’t whether parabens have altered our microbiomes, but how much it matters. Researchers at the National Institute of Allergy and Infectious Diseases reported, for example, that products containing parabens can block the growth of  Roseomonas mucosa—a bacterium that can kill another bacterium, one that proliferates during eczema flares called  Staphylococcus aureus.\n Julie Segre, who published the first topographical maps of human skin’s bacterial and fungal diversity in 2012, sounds almost parentally defensive when she talks about the fact that the gut microbiome has gotten so much more attention than the skin’s. “I don’t understand exactly why it is that people have such a different sense of the microbes that live in their gut than they do about the microbes that live on their skin,” says Segre, who now leads the Microbial Genomics Section at the National Institutes of Health in Bethesda, Maryland. “Everyone wants to eat Activia yogurt and colonize themselves with bacteria, and then they want to use Purell.”\n   Venture capitalists are pouring millions into trying to change that—meaning by developing a topical probiotic that could be sold as an essential part of an everyday skin-care routine. At the same time, some of Segre’s scientific colleagues are testing “bacteriotherapy” to treat existing diseases. Researchers at NIAID tried spraying eczema patients’ inner elbows with the aforementioned  Roseomonas mucosa. After six weeks of twice-weekly applications, symptoms such as redness and itching  diminished in most of the patients, according to Ian Myles, the lead investigator. Some also reported needing fewer topical steroids even after the treatment stopped.\n The promise Segre sees at the moment is not in probiotics (which, technically, are the microbes themselves), but in  prebiotics—the various products that “feed our microbial gardens.” The normal and beneficial microbes are there already; we probably don’t need to add them so much as promote them, she says. Some things already on the market probably work as prebiotics, such as clay-based deodorants, which absorb sebum and may limit the microbial populations that produce odor.\n    At a fundamental level, spending time in the natural world, starting from early childhood, seems to be one of the best ways to build and maintain a healthy skin biome. We evolved in the presence of other people, animals, plants, and all the attendant microbes they carry to us. Of course, the pandemic limits our time outdoors and exposure to one another. For now, targeted hygiene—again, wash your hands!—and social distancing amount to crucial, lifesaving medical interventions. But the obliteration of all microbes as often and aggressively as possible is not always appropriate. As with any medicine, more does not mean better. An abiding overall theme of the pandemic: In addition to eradicating the bad, we need to seek out the good.\n At the very least, we’re starting to learn not to touch our face. Our mites are probably grateful.\n    We want to hear what you think about this article.  Submit a letter to the editor or write to letters@theatlantic.com.\n            , M.D., is a staff writer at  The Atlantic. He is also a lecturer at Yale School of Public Health and author of the forthcoming book   Clean: The New Science of Skin.", "posttime": "2020-06-22 23:53:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "高估,overrated,微生物", "title": "卫生被高估了--你可能太干净了", "title_en": "Hygiene Is Overrated – You Can Be Too Clean", "transed": 1, "url": "https://www.theatlantic.com/magazine/archive/2020/07/hygiene-is-overrated/612235/", "via": "", "real_tags": ["高估", "overrated", "微生物"]}, {"category": "", "categoryclass": "", "imagename": "408fded67255ccd2bd11c6d2368471a4.jpg", "infoid": 1007656, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在上周拒绝更新后，苹果批准了订阅电子邮件应用程序嘿的新版。\n上周，在今天的苹果全球开发者大会(Apple Worldwide Developer Conference)召开之前，苹果批准了这一决定，旨在降低苹果最初拒绝应用程序的温度，此前苹果公司的应用程序遭到了立法者和其他开发者的广泛谴责。但这一批准在精神上也只是暂时的，意在让开发者Basecamp有时间开发一个更符合苹果政策的应用程序版本-Basecamp对这一挑战的态度非常积极，正如今天发布在其网站上的一封信中所述。\n随着美国和欧盟对App Store的监管审查力度加大，苹果通过批准嘿Now，肯定也是希望将焦点重新带回其价值5190亿美元的开发者生态系统的积极方面。\n新版本的嘿符合苹果规则的严格文字，但违背了他们的精神。\n但是大本营还没有结束战斗。苹果公司已经提交了一个新版本的“嘿”，它符合严格的苹果规则，但显然违背了他们的精神：该公司现在将向iOS用户提供一个免费的临时“嘿”电子邮件账户，地址是随机的，这样这款应用在第一次打开时就可以正常使用了。这些刻录机帐户将在14天后过期。嘿现在也可以与企业客户合作，因为苹果最初对这款应用的消费者导向提出了异议。\n嘿没有采用苹果自己的应用内支付系统，也没有允许用户通过iOS应用注册其全面的付费服务。取而代之的是，用户仍然需要通过直接进入嘿的网站进行订阅。\n这些变化是否会让苹果满意还有待观察，但Basecamp显然是在押注苹果将不得不允许这款应用的未来版本，因为它在发布时就做了一些事情。BasecCamp的CTO David Heinemeier Hansson告诉我：“我们会信守菲尔(席勒)的诺言。”“人们的主要抱怨是，‘你下载了这款应用，但它不能工作’，尽管很多应用都是这样工作的。”\n“我们已经看到了大卫的推文，并期待着在前进的道路上与你合作，”苹果的应用程序审查委员会上周给Basecamp写道。“此更新已获得批准。”\n嘿和苹果的背景非常复杂，但简单的版本是这样的：\n苹果应用商店的规则要求付费服务为用户提供使用苹果支付工具在应用中注册和支付的能力。这让开发商付出了30%的不可讨价还价的折扣。\n规则中对Netflix和Spotify等“阅读器”应用程序有一个有争议的划分，但不适用于电子邮件应用程序。\n苹果最初在iOS应用商店批准了嘿应用，但拒绝了错误修复更新，因为它认为嘿违反了规则，不提供应用内订阅。\n苹果告诉Protocol，“客户应用”被允许用于“商业服务”，但不允许用于“消费产品”，这一区别在规则中没有出现，苹果也没有向其他媒体宣传这一区别。\n这一拒绝发生在欧盟委员会宣布对App Store和Apple Pay进行反垄断调查的同一天。(真的。)。\nBasecamp首席技术官David Heinemeier Hansson说，他宁愿“自己烧毁这座房子”，也不愿向苹果支付30%的费用。(也是真的。)。\n海内梅尔·汉森(Heinemeier Hansson)和众议院反垄断委员会主席大卫·西西林(David Cicilline，D-RI)在Vergecast上讨论了这一情况。西西林领导着对App Store等数字市场的反垄断调查。西西林称苹果收取的30%费用是“不合情理的”和“高速公路抢劫”。(再说一遍：真的。)\n苹果营销主管菲尔·席勒(Phil Schiller)在接受TechCrunch采访时正式谈到了这一情况，他说：“他们可以做很多事情来让这款应用在我们现有的规则范围内运行。我们希望他们能做到这一点。“。\n重要的是，席勒还告诉TechCrunch：“你下载了这款应用程序，它就不起作用了，这不是我们想在商店里看到的。”\n苹果再次拒绝了嘿应用程序。它在Basecamp收到拒绝信之前就把它发给了媒体。(再说一次：真的。)。这封拒绝信指出，Basecamp的应用程序“在过去的八年里没有为App Store带来任何收入”，这句话在开发者社区就像一个铅气球一样传开了。\n据本·汤普森专栏报道，开发者非常害怕苹果。据Kara Swisher专栏报道，开发者非常害怕苹果。John Gruber专栏关于Kara Swisher专栏报道开发者害怕苹果。突然之间，每个人都知道了苹果，而App Store吓坏了开发者。\nBasecamp认为，通过最新的更新，它现在已经直接解决了苹果的两个问题-应用程序打开时不会做任何事情，以及消费者而不是企业的关注点。\n苹果方面表示，它一直在努力帮助开发者按照规则获得并保留应用程序，并坚称目标一直是以某种方式解决嘿的问题。该公司表示，它一直在努力帮助开发者按照规则获得并保留应用程序，并坚称其目标一直是以某种方式解决嘿问题。\n真正的问题是，苹果如何看待14天后到期的免费电子邮件应用。\nHeinemeier Hansson告诉我，Basecamp已经为“几个”企业客户提供了“嘿电子邮件”服务，现在它已经为其他客户加速了这项工作。但真正的问题是，苹果如何看待一款提供14天后到期的免费随机电子邮件地址的电子邮件应用。Basecamp说，它的目的是模仿“你旅行时购买的临时SIM卡”，或者允许用户在Craigslist上销售商品，而不需要提供真实的电子邮件地址。\n这看起来确实像是对一个在胁迫下创建的产品的用例改造，但如果这能让嘿团队专注于他们的应用程序，而不是App Store，他们会接受的。Heinemeier Hansson告诉我，已经有25000人收到了嘿邀请，目前还有10万多人在等待，Basecamp已经雇佣了5名临时员工来满足客户支持需求。\nHeinemeier Hansson说：“我们原本希望第一个月就有20000名用户。”“到下周末，我们很有可能会有20万人使用这项服务。这就是我想要关注的问题。“", "note_en": "After rejecting an update last week, Apple has approved a new version of the subscription email app Hey.\n The approval, which came last week, ahead of today’s Apple Worldwide Developer Conference, is meant to lower the temperature after Apple’s initial app rejection drew widespread condemnation from lawmakers and other developers. But the approval is also only temporary in spirit, meant to give Hey developer Basecamp time to develop a version of the app more in line with Apple’s policies — and Basecamp’s approach to that challenge is very aggressive, as  a letter posted to its website today details.\n By approving Hey right now, Apple is also surely hoping to bring the focus back to the positive aspects of its  $519 billion developer ecosystem as regulatory scrutiny of the App Store increases in the United States and European Union.\n The new version of Hey meets the strict letter of Apple’s rules but defies their spirit\n But Basecamp isn’t done with the fight. The company has submitted a new version of Hey that meets the strict letter of Apple’s rules but clearly defies their spirit: the company will now offer iOS users a free temporary Hey email account with a randomized address, just so the app is functional when it is first opened. These burner accounts will expire after 14 days. Hey is also now able to work with enterprise customers, as Apple initially took issue with the app’s consumer focus.\n Hey has not adopted Apple’s own in-app payment system or allowed users to sign up for its full, paid service through the iOS app. Instead, users will still need to subscribe by going directly to Hey’s website.\n It remains to be seen whether these changes will thread the needle to Apple’s satisfaction, but Basecamp is clearly betting that Apple will have to allow future versions of the app now that it does  something on launch. “We’re going to take Phil [Schiller] on his word here,” Basecamp CTO David Heinemeier Hansson tells me. “The chief complaint was that ‘you download the app and it doesn’t work,’ even though  lots of apps work like that.”\n “We’ve  seen David’s tweets and look forward to working with you on a path forward,” Apple’s App Review Board wrote to Basecamp last week. “This update has been approved.”\n The backstory of Hey and Apple is extremely complicated, but the simple version is this:\n Apple’s App Store rules require paid services to offer users the ability to sign up and pay in the app using Apple’s payment tools. That costs developers a nonnegotiable 30 percent cut.\n There is a  controversial carveout in the rules for “reader” apps like Netflix and Spotify but not email apps.\n Apple initially approved the Hey app in the iOS App Store but rejected a bug-fix update because it decided Hey violated the rules by not offering in-app subscriptions.\n Apple told   Protocol that “client apps” are allowed for “business services” but not “consumer products,” a distinction that  appears nowhere in the rules and which Apple did not push with other media outlets.\n This rejection happened on the same day the European Commission announced an  antitrust investigation into the App Store and Apple Pay. (Really.)\n Basecamp CTO David Heinemeier Hansson said he would rather “ burn this house down myself” than pay the 30 percent fee to Apple. (Also really.)\n Heinemeier Hansson and House Antitrust Committee chairman Rep. David Cicilline (D-RI), who is leading an antitrust investigation into digital marketplaces like the App Store, appeared on  The Vergecast to discuss the situation. Cicilline called Apple’s 30 percent fee  “unconscionable” and “highway robbery.” (Again: really.)\n Apple marketing chief  Phil Schiller spoke to  TechCrunch on the record about the situation and said, “There are many things that they could do to make the app work within the rules that we have. We would love for them to do that.”\n Importantly, Schiller also told  TechCrunch: “You download the app and it doesn’t work, that’s not what we want on the store.”\n Apple  rejected the Hey app again. It sent the rejection letter to the press  before Basecamp received it. (Once again: really.) The rejection letter noted that Basecamp’s apps had “have not contributed any revenue to the App Store over the last eight years,” a line that went over in the developer community  like a lead balloon.\n Ben Thompson column reports developers are terrified of Apple.  Kara Swisher column reports developers are terrified of Apple.  John Gruber column about Kara Swisher column reports developers are terrified of Apple. Suddenly, everyone knows Apple and the App Store terrifies developers.\n  Basecamp thinks it has now directly addressed Apple’s two concerns — the app not doing anything when opened, and a consumer rather than enterprise focus — with this latest update.\n For its part, Apple says that it has always tried to help developers get and keep apps in the store in compliance with the rules, and maintains that the goal was always to solve the Hey issue somehow.\n The real question is how Apple views a free email app that expires after 14 days\n Heinemeier Hansson tells me that Basecamp has already onboarded a “couple” of enterprise customers for Hey email and that it’s accelerated that work for other customers now. But the real question is how Apple views an email app that offers free, randomized email addresses that expire after 14 days. Basecamp says it’s meant to mimic “a temporary SIM card you buy when traveling” or allow users to sell things on Craigslist without giving out a real email address.\n That certainly seems like a retrofitting of use cases to a product created under duress, but if that allows the Hey team to focus on their app instead of the App Store, they’ll take it. Heinemeier Hansson tells me 25,000 people have already gotten Hey invites, there’s currently a waitlist of 100,000 more, and that Basecamp has hired five temporary staffers to meet the customer support demand.\n “We’d hoped for 20,000 users in the first month,” Heinemeier Hansson says. “There’s a good chance by the end of next week, we’ll have 200,000 people on the service. That’s what I would like to focus on.”", "posttime": "2020-06-22 23:52:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,批准,approves", "title": "苹果批准嘿电子邮件应用，但斗争还没有结束", "title_en": "Apple approves Hey email app, but the fight’s not over", "transed": 1, "url": "https://www.theverge.com/2020/6/22/21298552/apple-hey-email-app-approval-rules-basecamp-launch", "via": "", "real_tags": ["苹果", "apple", "批准", "approves"]}, {"category": "", "categoryclass": "", "imagename": "ffcd1078994fd5cb31c66e1c73e8c998.jpg", "infoid": 1007654, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于广场恐惧症和焦虑，雅基·肯尼的身体冒险活动受到了限制，但在伦敦的家中，雅基·肯尼已经看到了世界。自2016年以来，她一直在美国西南部天蓝色的天空下漫步，在墨西哥普埃布拉的锥形树木投射的阴影中漫步。她曾在蒙古狂风肆虐的大片土地上看望过马，在吉尔吉斯斯坦的一条积雪覆盖的道路上漫步。她通过谷歌街景做到了这一点，并收集了大约4万张她旅行的快照。\n在她网络漫游的巅峰时期，肯尼每天花18个小时在她的漫游上。她说：“我感觉自己就像是刚跳进这个世界，几年后就出来了。”“我正在经历我生命中的一段时间，我只需要进入另一个世界。”最近，她的漫游减少了，因为她的广场恐惧症有所减轻，但她仍然在她的Instagram上发布数字旅行的快照，她的Instagram是她的广场恐惧症旅行者。\n阿特拉斯·奥布斯库拉(Atlas Obscura)与肯尼谈论了偶然的景象，迷人的风景，以及在隔壁和地球周围寻找奇迹。\n大约25年前，我开始患上恐慌症。随着时间的推移，他们变得越来越糟糕。我开始担心我可能会得恐慌症，特别是在飞机上。我害怕被困住，不能找到出口回家。我发现离家越远，生活就越艰难。当你在3万英尺高空的飞机上，你不可能那么容易跳出飞机回家。然后，(恐慌)越来越频繁地出现，而不是像在飞机上飞行-在火车上，在公交车上-这样的大事。这也不仅仅是交通问题：(我惊慌失措地)在我感到有点迷失的地方，或者如果我不知道如何才能回到家。我可能只是走在几条街道上，有点迷失方向，然后开始惊慌失措。\n我开始注意到我的世界在不断缩小。然后是像开会这样的事情-我不能去开会，因为我觉得我会惊慌失措。我开始管理我的生活，所以我哪儿也不用去。我意识到我需要一些帮助，因为你知道，情况正在逐渐恶化。\n起初，它无处不在，无处不在。我从巴西开始，因为我一直在看一些街头艺术；我忘了是谁画的。我开始环顾四周，决定再走远一点。就在那时，我开始看到，“哦，天哪，这太不可思议了。”巴西很美--那里的颜色、有利位置、街景如何让每个人看起来都很小，就像他们在舞台上一样。这是超现实的。\n我开始四处旅行，看看其他地方，对很多事情感到兴奋。\n然后我意识到这是一种我真的很喜欢的样子。我发现很多都在赤道附近或任何极端温度的地方，特别是沙漠。我意识到我喜欢空间感和孤立感，所以我会离开城市，到小城镇去。\n对于患有广场恐惧症的人来说，这些地方是很难想象身临其境的。你离家那么远，沙漠本身就是我觉得相当可怕的东西-也很吸引人，但也很可怕，因为离开沙漠…的想法。关于广袤的沙漠，有一些东西是相当可怕的。我可能是被我很害怕去的地方所吸引，但我也很喜欢。\n在城市里，真的很难得到一个好的构图，因为总有一些东西挡住了去路。你不能移动任何东西；你不能要求别人做不同的姿势。这是我开始进军城镇的另一个原因，这样我就可以拍到我喜欢的照片。出于实际目的，但是-我真的，真的，真的很投入。“痴迷”可能是个更好的词。\n你可以在任何地方跳伞。你可以身处世界的一端，两秒钟后就到了另一端，而不必担心飞行、边界等问题。\n这与你通常的旅行方式相反。你没有任何行程，你没有计划的假期。你不知道你要去哪里，你也不知道你要降落在哪里。所以，很多时候我会跳进去，然后说，“哦，我的天哪，我在哪里？”然后再对这个地方做些调查。突然间，你对一个你以前一无所知的地方有了一些了解。这有点动摇了你对旅行的想法。尽管这是一个奇怪的、平行的宇宙，但我只是喜欢所有的联系，以及那种“我们都在一起”的感觉。\n由于新冠肺炎的缘故，你有什么建议给那些感觉有旅游欲，但这些天大多呆在家里的人呢？\n我想，每个人现在都会重新审视他们是如何旅行的。在过去的几年里，我发现享受你当地的生活是多么美好。你会惊讶于那些你甚至不知道存在的东西。你不必总想着一定要去度假才能找回自我。\n你是否最终亲自去了你在网上参观过的任何一个地方？\n不是的。我希望如此，但我不确定这是否会发生。尽管我感觉好多了，但那些地方仍然相当偏远和遥远。我要去那些地方要花很多钱。\n除了风景，旅行的一些乐趣还包括气味和声音。你有没有试过在家里重现这些？\n我没那么做过。这一切都在我的脑海里。我会想象一些场景，那么多的小电影。我甚至不记得它和现实世界有什么联系。\n显然，这与身体旅行是如此不同的体验，因为当你正常旅行时，你会使用更多的感官。但我的问题是，因为我太焦虑旅行了，而且已经有很长一段时间了，我从来没有享受过旅行过程中的任何一部分。因此，即使这只是视觉上的，在我的想象中，对我来说-暂时-这是很有意义的。", "note_en": "Her physical adventures have been curtailed by agoraphobia and anxiety, but from her home in London, Jacqui Kenny has seen the world. Since 2016, she has wandered beneath cerulean skies in the American Southwest and among the shadows cast by tapered trees in Puebla, Mexico. She has visited horses on windswept expanses in Mongolia and ambled along a snow-flanked road in Kyrgyzstan. She has done it all through Google Street View, and collected some 40,000 snapshots of her travels.\n At the peak of her web-based wanderlust, Kenny devoted up to 18 hours a day to her wanderings. “I kind of felt like I just jumped into this world, and then came out a couple of years later,” she says. “I was going through a time in my life where I just needed to go into another world.” Her roaming has decreased recently, as her agoraphobia has abated a bit, but she still posts snapshots from her digital travels on her Instagram,  the Agoraphobic Traveller.\n Atlas Obscura talked to Kenny about serendipitous sights, captivating landscapes, and finding wonder next door and around the planet.\n   I started having panic attacks about 25 years ago. Over time, they got progressively worse. I started fearing places that I might get a panic attack, especially flying on planes. I feared being trapped and not being able to get to an exit and go home. I found that the farther away I was from home, the harder it became. When you’re on a plane, 30,000 feet up in the air, there’s no way you can jump out and go home that easily. Then [the panic] came more and more often, and not [from] such big things like flying on a plane—on the train, on a bus. It wasn’t just transportation, either: [I panicked] anywhere I felt a little bit lost, or if I didn’t know exactly how I could get back home again. I could just be walking down a few streets and get a bit disoriented and then start panicking.\n I started noticing that my world was shrinking and shrinking and shrinking. Then it would be things like meetings—I couldn’t go to meetings because I thought that I would have a panic attack. I started managing my life so I didn’t have to go anywhere. I realized that I needed to get some help because you know, it was just progressively getting worse.\n   At first, it was anywhere and everywhere. I started in Brazil, because I’d been looking at some street art; I forget who did it. I started looking around and decided to go a little bit further. And that’s when I started seeing, “Oh, my god, this is incredible.” Brazil is beautiful—the colors, the vantage point, how Street View makes everybody look miniature, like they’re on a stage. It’s surreal.\n I started traveling around and looking at other places and getting excited about lots of things.\n Then I realized that it was a certain look that I really liked. I found a lot of that was around the equator or anywhere with extreme temperatures, especially the desert. I realized that I liked a sense of space and isolation, so I would leave the city and go into small towns.\n  These are places that, for someone with agoraphobia, it’s hard to imagine being there physically. You’re so far away from home, and the desert itself is something that I find quite frightening—fascinating as well, but frightening, because the idea of exiting the desert … There’s something about the vastness of the desert that’s quite scary. I was probably attracted to places I would be quite fearful going to, but also loved.\n In cities, it’s really hard to get a good composition because there’s always something in the way. You can’t move anything; you can’t ask somebody to do a different pose. That’s another reason why I started reaching out into towns, so I could get the shots that I liked. For practical purposes, but—I just got really, really, really into it. Obsessed is probably a better word.\n   You can just parachute anywhere. You can be on one side of the world and then two seconds later be on the other side, and never have to worry about flying, borders, any of that.\n It’s the opposite of how you normally travel. You don’t have any itinerary, you don’t have a planned holiday. You don’t know exactly where you’re going, you don’t know exactly where you’re going to land. So, many times I would jump in and go, “Oh my goodness, where am I?” and then do some research on the place. Then suddenly you know something about a place that you didn’t know anything about before. It kind of shakes up your idea of travel. Even though it’s kind of this strange, parallel universe, I just loved all the connections, and that sense of, “We’re all in it together.”\n  What advice would you have to people who feel a sense of wanderlust but are mostly at home these days, due to COVID-19?\n Everybody’s going to revisit how they travel now, I think. Over the last few years, I’ve discovered how great it can be to enjoy your local area. You’d be amazed at what you don’t even know exists. You don’t have to always be thinking you have to go on a holiday to find yourself.\n Have you wound up going in person to any of the places that you have visited online?\n No. I hope to, but I’m not sure if it’s going to happen. Even though I’m feeling better, those places are still quite remote and far away. It would take quite a lot for me to go to those places.\n  Beyond the sights, some of the joys of travel include the smells and  the sounds. Do you ever try to recreate those at home?\n I haven’t done that. It was just all in my head. I would imagine scenes, so many little films. I can’t even really remember it being connected to the real world.\n Obviously it’s such a different experience from traveling physically, because you use a lot more senses when you’re traveling normally. But the thing with me is that, because I’m so anxious traveling and have been for a really, really, really long time, I was never able to enjoy any part of the process of traveling. So even if it’s just visual, in my imagination, to me—for the time being—that makes a lot of sense.", "posttime": "2020-06-22 23:29:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "恐惧症,traveler,旅行", "title": "一个有广场恐惧症的旅行者在地球上游荡", "title_en": "An Agoraphobic Traveler Wanders the Earth", "transed": 1, "url": "https://www.atlasobscura.com/articles/agoraphobic-travel", "via": "", "real_tags": ["恐惧症", "traveler", "旅行"]}, {"category": "", "categoryclass": "", "imagename": "30dc72b7c995e7d05ca3eb936294d366.jpg", "infoid": 1007653, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几千年来，乌鸦可以识别人类的面孔(和其他身体属性)，这是我们与它们相处的主要体验。这是让他们在我们的文化中占据如此显赫地位的一部分，也是让我们不断地往口袋里装满花生或杂物的原因，我们渴望有机会被认出来，被野生动物看到。如果你像我一样一直致力于这样的关系，你可能会发现自己一直在想他们在说什么。虽然我们的问题还是比答案多，但这并不是因为没有尝试；事实上，解析乌鸦“语言”仍然是Corvidology的热门话题。如果不是我们所有的努力去理解乌鸦经常在说什么，你有没有想过它们是如何理解我们所说的话的？\n询问任何喂食乌鸦的人关于他们的仪式，很有可能开始时不仅仅是让自己看得见。为了引起“它们的”鸟的注意，大约一半的乌鸦喂食者从某种听觉提示开始，比如吹口哨或轻柔地叫名字。²鉴于美国乌鸦(Corvus Brachyrinchos)可以通过它们的叫声单独区分，而且许多乌鸦-包括大嘴乌鸦(Corvus Macrorhynchos)-可以识别熟悉的同种*叫声，所以这种策略似乎一点也不迷信。2，3事实上，以前的研究已经证明乌鸦可以辨别人类的声音。\n当看到看门人或不熟悉的说话者说“嘿”的回放时，手工饲养的腐肉乌鸦(Corvus Corone)对不熟悉的说话者表现出明显更大的反应。他们的反应是不同的，这表明他们可以区别对待，但他们似乎更感兴趣的是他们不认识的人，这一事实很难不引起他们的注意。难道他们不应该对那些通常带着礼物来的人更感兴趣吗？虽然我们对这个问题仍然没有一个非常令人满意的答案，但这可能来自这样一个事实，即新人比可以安全地忽视的熟悉的看门人更难预测，因此更具威胁性。同样，一项新的研究表明，不只是个别人乌鸦可以听出不同语言之间的差异，而是整个语言之间的差异。\n在Schalz和Izawa(2020)最新发布的一项研究中，在日本各地的主要城市捕获了8只野生大嘴乌鸦，随后将它们饲养在庆应义塾大学的鸟类养殖场，由讲流利日语的人照顾它们。5.考虑到它们的生活史和它们在鸟舍的时间，可以有把握地认为这些鸟一生中都听了大量的日本人的话。因此，顺理成章的是，它们也许能够真正认识到这种语言是熟悉的，但到目前为止，还没有人研究乌鸦区分语言的能力。为了测试这个问题，研究人员使用回放来呈现说荷兰语或日语的录音。就像腐烂乌鸦的研究一样，当向这些乌鸦播放更熟悉的声学风格-在这种情况下是说日语的人-它们没有表现出强烈的反应。给他们演奏一种很可能是完全陌生的语言-荷兰语-乌鸦们就全神贯注了。或者至少他们表现得更加警觉，把自己放在离演讲者更近的地方。换句话说，大嘴乌鸦无需任何训练就能辨别人类的语言！\n下一个最明显的问题是，嗯，为什么？在不熟悉的人中区分不同的语言有什么作用呢？一种可能性是，这只是它们成功成为乌鸦所需的听觉感知技能的产物。正如我之前提到的，他们的电话中编码了很多信息，包括个人身份，所以专注于节奏课可能很重要。然而，另一个值得追求的原因是，这可能有助于向游客透露信息，他们可能比当地人更倾向于分享或更容易利用。*幸运的是，这项研究的主要作者Sabrina Schalz将在即将到来的秋天开始她在这个主题上的博士学位。你可以在推特上找到她，地址是@Sabrinaschalz，她承诺会让我们了解她未来的发现。\n因此，下次你在日本闲逛的时候，别忘了在当地乌鸦周围注意你的语言。为了安全起见，我也不会向他们泄露任何秘密。它们被称为大嘴乌鸦不是无缘无故的。\n引用文献1.Marzluff JM和Amp；Miller M.(2014)。乌鸦和乌鸦喂食者：种间符号学的观察。收录于：Witzany，G.ed.，动物的生物通讯。纽约：Springer Science+Business Media Dordrecht。第191-211页。\n3.Kondo N，Izawa Ei，&amp；Watanabe S.(2010)。丛林乌鸦(Corvus Macrorhynchos)声音和个体识别的知觉机制：联系电话签名和辨别。行为147：1051-1072。\n4.洗衣机咖啡馆，Szipka G，Boeckle M，和Wilkinson A.2012。你听起来很熟悉：腐肉乌鸦能区分已知和未知的异种叫声。阿尼姆·科恩15：1015-1019。\n5.Schalz S.&Amp；Izawa E.(2020)。大嘴乌鸦的语言歧视。在Ravignani，A.，Barbieri，C.，Martins，M.，Flaherty，M.，Jadul，Y.，Ltenkamp，E.，Little，H.，Mudd，K.&amp；Verhoef，T.。(编著)：语言的演变：第十三届国际会议论文集(EvoLang13)。10.17617/2.3190925。", "note_en": "That crows can recognize humans faces (and other physical attributes) has been a staple of our experiences with them for thousands of years.  It’s part of what has allowed them to take such a prominent place within our cultures, and it’s what keeps us refilling our pockets with peanuts or kibble, anxious for the chance to be recognized, to be  seen by a wild animal. If, like me, you’ve been committed to such a relationship, you probably found yourself wondering about what it is they’re saying all the time. Although we still have more questions than answers, it’s not for  lack of trying; in fact parsing crow “language” is still a hot topic in corvidology.  But for all our efforts to understand what crows are so often going on about, have you ever thought much about what they make of what  we’re saying?\n  Ask any crow feeder about their ritual and there’s a good chance that it starts with more than just making themselves visible. To get “their” bird’s attention, about half of crow feeders start with some kind of auditory cue, like a whistle or gentle name calling.¹ Given that American crows ( Corvus brachyrhynchos) can be individually distinguished by their calls, and many corvids—including the large-billed crows ( Corvus macrorhynchos)—can recognize familiar conspecific* calls, this strategy seems far from superstitious. 2,3 In fact, previous work has demonstrated that crows can discriminate human voices.\n When presented with playback of their caretakers or unfamiliar speakers saying, “hey,”  hand-reared carrions crows ( Corvus corone) showed significantly more responsiveness towards unfamiliar speakers. 4 That their response is different is what suggests that they can discriminate, but it’s hard to not do a double take at the fact that the thing they seem more interested in is the person they  don’t know.  Shouldn’t they be more interested in the folks that generally come bearing gifts? While we still don’t have a super satisfying answer to this question, it’s possible this comes from the fact that novel humans are less predictable, and therefore more threatening, than a familiar caretaker who can be safely ignored. Likewise, a new study out suggests that it’s not just individual people crows can hear the difference between, but entire languages.\n In a newly released study conducted by  Schalz and Izawa (2020), eight wild  large-billed crows were captured in major cities around Japan and subsequently housed in aviaries at Keio University where they were cared for by fluent Japanese speakers. 5  Given both their life histories and their time in the aviary, it’s safe to assume these birds had listened to a tremendous amount of Japanese throughout their lives. So, it stands to reason they might be able to actually recognize this language as familiar, but to date no one had looked at crows’ ability to discriminate between languages.  To test this question the researchers used playback to present recordings of either Dutch or Japanese speakers.  As with the carrion crow study, when these crows were presented with playback of a more familiar acoustic style—in this case a Japanese speaker—they didn’t show a strong reaction. Play them what was likely a completely unfamiliar language—Dutch—and the crows were rapt. Or at least they acted more vigilant and positioned themselves closer to the speaker. In other words, large-billed crows were able to discriminate between human languages without any prior training!\n  The next most obvious question is, well, why? What purpose would it serve to discriminate between different languages among unfamiliar speakers? One possibility is that it’s just an artifact of the auditory perceptual skills they need to successfully be a crow.  As I mentioned earlier, there’s a lot of information encoded in their calls, including individual identity, so being attentive to rhythmic classes may be important.  Another reason that’s worth pursuing, though, is that it may help tip them off to tourists, who may be more inclined to share or easier to take advantage of, than locals.  Fortunately the lead author on this study, Sabrina Schalz, will be starting her PhD on this topic in the coming fall. You can find her on twitter at @Sabrinaschalz, where she’s promised to keep us abreast of her future discoveries.\n So the next time you’re hanging out in Japan, don’t forget to literally watch your language around the local crows. And to be safe, I wouldn’t divulge any secrets to them either.  They’re not called large-billed crows for nothing.\n  Literature cited 1. Marzluff JM, &amp; Miller M. (2014). Crows and crow feeders: Observations on interspecific semiotics.  In: Witzany, G. ed., Biocommunication of Animals.  New York: Springer Science+Business Media Dordrecht. pp 191-211.\n  3. Kondo N, Izawa EI, &amp; Watanabe S. (2010). Perceptual mechanism for vocal  individual recognition in jungle crows ( Corvus macrorhynchos ): contact call signature and discrimination.  Behaviour 147: 1051–1072.\n 4. Washer CAF, Szipka G, Boeckle M, and Wilkinson A. 2012. You sounds familiar: carrion crows differentiate between the calls of known and unknown heterospecifics.  Anim Cogn 15: 1015-1019.\n 5. Schalz S. &amp; Izawa E. (2020). Language Discrimination by Large-Billed Crows. In Ravignani, A., Barbieri, C., Martins, M., Flaherty, M., Jadoul, Y., Lattenkamp, E., Little, H., Mudd, K. &amp; Verhoef, T. (Eds.): The Evolution of Language: Proceedings of the 13th International Conference (EvoLang13). doi:10.17617/2.3190925.", "posttime": "2020-06-22 23:23:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "字面,watching,乌鸦", "title": "乌鸦在看你的语言，字面意思", "title_en": "Crows are watching your language, literally", "transed": 1, "url": "https://corvidresearch.blog/2020/06/21/the-crows-are-watching-your-language-literally/", "via": "", "real_tags": ["字面", "watching", "乌鸦"]}, {"category": "", "categoryclass": "", "imagename": "eba90020e764d031f80ccd4a1c317709.jpg", "infoid": 1007652, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "3月中旬，当洛杉矶县自然历史博物馆(Natural History Museum)因流感大流行而关闭时，丽莎·冈萨雷斯(Lisa Gonzalez)怀着几周后回来的期望回家。但是，一旦确定她不会很快回来，博物馆的昆虫学收集助理经理冈萨雷斯就把她家的工艺室改造成了一个临时实验室。然后，她开始筛选博物馆之前通过一个公民科学项目收集的数千只昆虫。\n通常，冈萨雷斯和其他生物学家会使用DNA条形码来识别不同的物种。这是一个多步骤的过程，需要几个小时的化学准备，并能产生准确的结果。博物馆的DNA测序仪使用一种名为聚合酶链式反应的方法来放大每种昆虫的遗传物质，然后将其与现有DNA条形码的参照物进行比较。\n随着这个装置回到博物馆，冈萨雷斯转向了自17世纪以来一直为生物学家服务的模拟仪器：显微镜。冈萨雷斯说：“这绝对让我欣赏过去的科学家能够用最基本的工具完成的工作。”“我家里没有符合人体工程学的椅子；我没有花哨的显微镜。我们都对我们认为理所当然的事情表示赞赏。“。\n冈萨雷斯仅用自己的显微镜，通过观察细小的毛发或苍蝇翅膀的形状等特征，识别了数十种昆虫。她还发现了一些不同寻常的昆虫，并将它们交给了她的同事、博物馆昆虫学馆长布莱恩·布朗(Brian Brown)。使用他从办公室拖来的较大的徕卡立体显微镜，以及他在Craigslist上找到的较小的复合显微镜，布朗发现了9种小苍蝇，这些都是科学上新发现的。“发现新事物总是很酷的，这是这份工作最大的乐趣之一，”布朗说。“这不仅仅是发现略有不同的新事物--我们一直都在发现非常不同的东西。”\n这些昆虫主要是小苍蝇、黄蜂和类似黄蜂的苍蝇，是通过BioSCAN项目收集的，该项目始于2012年，在洛杉矶各地的30个地点设置了捕虫器，主要是在后院或公共场所。这对夫妇招募了志愿者，然后他们接受了如何使用“恶心陷阱”的培训，这种陷阱类似于两个人的小狗帐篷，迫使虫子向上飞到收集网中，然后志愿者才能把它们放进瓶子里。\n尽管洛杉矶是来自世界各地的文化混杂之地，但对其城市野生动物，特别是将广阔盆地称为家的昆虫的研究很少。生物扫描项目始于布朗与一名博物馆托管人打赌，称他可以在她位于洛杉矶西部的后院发现一种新的昆虫。他做到了，项目开始了。在最初的三年里，布朗和后院收藏家发现了30种新的昆虫，并发表了他们的结果。博物馆团队在过去两年中又发现了13个新物种，加上他和工作人员自大流行关闭以来又发现了9个新物种。\n尽管生物扫描参与者自去年11月以来没有收集到任何新的昆虫，但在新冠肺炎关闭期间，鉴定数以千计的个体标本的艰苦工作仍在继续。这在科学上等同于清理你的衣柜：单调乏味，但最终是有回报的。\n布朗说：“我们现在不能进入实验室，所以我们又回到了用显微镜识别东西和寻找难以看到的特征上来。”“这些费时费力的工作，面对的都是时间充裕的人。这些昆虫有2毫米长，生殖器很小。用形态学鉴定其中一个样本可能需要10分钟或20分钟。“\n这九个新物种包括幻蝇，其中一些以能够跑过表面和/或进入棺材吃掉身体而闻名。布朗和冈萨雷斯还发现了以前在南加州从未见过的肉蝇、老鼠寄生虫和黄蜂状苍蝇。他们很可能是从中美洲来的，可能搭上了开花的植物或食物的便车。\n在通过BioSCAN项目收集的数万只昆虫的帮助下，多年来，布朗和冈萨雷斯已经将洛杉矶盆地已知的昆虫种类从1993年上次人口普查时的3500种扩大到今天的2万种左右。“我们已经观察了来自洛杉矶地区的10万个样本，”布朗说。“我对我们不断遇到的新物种的数量感到惊讶。”在自家后院的捕虫器里，布朗发现了几种奇怪的昆虫，包括一种被烟雾吸引的苍蝇(很可能来自附近的野火)和另一种喜欢夜间盛开的茉莉花香味的苍蝇。\n冈萨雷斯说，关闭和随后的家庭工作也让人们关注城市社区存在的生态生物多样性。“我们确实有令人难以置信的多样性和新物种生活在我们的眼皮底下，”她说。“这是大多数人没有意识到的。即使是我们惊讶地看到的昆虫，我也不知道洛杉矶有螳螂苍蝇。“。(螳螂苍蝇看起来有点像螳螂和黄蜂的杂交后代，尽管它们实际上两者都不是，而且更常见于热带栖息地。)。\n冈萨雷斯在她5岁的侄子的帮助下继续在家工作，他自己提供了显微镜。她希望将她的昆虫计数实验室归还给她的缝纫空间，在那里她为恐怖和科幻角色扮演活动制作服装，而她和她的伴侣错过了这些活动。\n布朗也已经厌倦了在家工作的世界。重返博物馆藏品和他的实验室的现代科学仪器是不可能很快发生的。布朗说：“当你第一次开始在家工作的时候，你会想，‘这太棒了，因为没有分心的事情，而且我可以迅速写出一打论文。’”“但是，有一个工作的地方能让你集中精力和注意力，这真是令人惊讶。重要的是要有人与之互动和合作，并以昆虫收藏为参考。“。\n👁大脑是人工智能的有用模型吗？另外：获取最新的人工智能新闻。\n🏃🏽‍♀️想要最好的健康工具吗？看看我们Gear团队挑选的最好的健身跟踪器、跑步装备(包括鞋子和袜子)和最好的耳机", "note_en": "When the Natural History Museum of Los Angeles County shut down due to the pandemic in mid-March, Lisa Gonzalez headed home with the expectation that she would be back in a few weeks. But once it became clear that she wouldn’t get back anytime soon, Gonzalez, the museum’s assistant entomology collection manager, converted her home’s craft room into a makeshift lab. Then she began sifting through thousands of insects the museum had previously collected via a citizen science project.\n Normally, Gonzalez and other biologists would use DNA bar-coding to identify different species. It’s a multistep process that takes a few hours of chemical preparation and gives spot-on results. The museum’s DNA sequencer uses a method called polymerase chain reaction to amplify the genetic material from each insect, which then can be compared to a reference of existing DNA barcodes.\n With that device back at the museum, Gonzalez switched to the analog instrument that has served biologists since the 17th century: a microscope. “It definitely makes me appreciate what scientists of the past were able to accomplish with rudimentary tools,” Gonzalez says. “I don’t have an ergonomic chair at home; I don’t have a fancy microscope. We are all feeling appreciation for things we take for granted.”\n  Using just her own microscope, Gonzalez identified dozens of insect species by looking at features like tiny hairs or the shape of a fly’s wings. She also found some unusual insects that she turned over to her colleague, Brian Brown, the museum’s curator of entomology. Using a larger Leica stereoscope that he hauled in from the office, as well as a smaller compound microscope he found on craigslist, Brown discovered nine species of small flies, all new to science. “It’s always cool to find new things, and it is one of the great joys of this job,” says Brown. “It&#39;s not just finding slightly different new things—we find extravagantly different things all the time.”\n   The insects, mostly small flies, wasps, and wasplike flies, had been collected through the  BioSCAN project, which began in 2012 with insect traps set at 30 sites throughout Los Angeles, mostly in backyards or public spaces. The pair recruited volunteers who were then trained in how to use the “Malaise traps,” which resemble two-person pup tents that force bugs to fly upward into collecting nets before the volunteers can put them into vials.\n  Even though Los Angeles is a jumble of cultures from around the world, very little research has been done into its urban wildlife, especially the insects that call the broad basin home. The BioSCAN project started when Brown bet a museum trustee that he could find a new species of insect in her backyard in West LA. He did, and the project took off. In its first three years, Brown and the backyard collector discovered 30 new species of insects and  published their results. The museum team found an additional  13 new species in the past two years, plus he and the staff have discovered nine more since the pandemic shutdown.\n  Although BioSCAN participants haven’t collected any new insects since November, the painstaking work of identifying thousands of individual specimens has continued during the Covid-19 shutdown. It’s the scientific equivalent of cleaning out your closets: tedious but ultimately rewarding.\n “We can’t go into the lab right now, so we are back to identifying things with microscopes and looking for characteristics that are difficult to see,” Brown says. “These time-consuming tasks are confronted with people who have a lot of time. The insects are 2 millimeters long, with minute genitalia. Identifying one of those specimens using morphology can take 10 minutes or 20 minutes.”\n The nine new species include phorid flies, some of which are known for their ability to run across surfaces and or enter coffins to  consume dead bodies. Brown and Gonzalez have also found botflies, parasites of rats and wasplike flies that have never been seen before in Southern California. They likely arrived from Central America, perhaps hitching a ride on a flowering plant or piece of food.\n WIth the help of tens of thousands of insects collected through the BioSCAN project, over the years Brown and Gonzalez have expanded the count of known insect species in the Los Angeles basin from 3,500 during the last census in 1993 to around 20,000 today. “We have looked at 100,000 specimens from the LA area,” Brown says. “I’m surprised at the magnitude of new species we keep running into.” In his own backyard insect trap, Brown has found several weird ones, including one kind of fly that is attracted to smoke (likely sourced from nearby wildfires) and another that likes the scent of night-blooming jasmine.\n Gonzalez says the shutdown and subsequent work at home has also put a spotlight on the ecological biodiversity that exists in urban neighborhoods. “We do have incredible diversity and new species living under our noses,” she says. “That’s something most people don’t realize. Even insects we were surprised to see—I had no idea we have mantis flies in LA.” ( Mantis flies look sort of like a cross between a praying mantis and a wasp, although they are actually neither and are more commonly found in tropical habitats.)\n Gonzalez continues to work from home with some help from her 5-year-old nephew, who has provided his own microscope. She’s hoping to return her insect-counting lab to being her sewing space, where she crafts costumes for horror and sci-fi cosplay events that she and her partner miss attending.\n Brown, too, has grown weary of the work-from-home world. Returning to the museum collection and his lab’s modern scientific instruments can’t happen soon enough. “When you first start this work-at-home thing, you think, ‘This is great because there are no distractions, and I can whip out a dozen papers,’” Brown says. “But it’s amazing how having a place to go to work focuses your efforts and attention. It’s important to have people to interact with and work with, and to have the insect collection as a reference.”\n   👁 Is the brain a  useful model for AI? Plus:  Get the latest AI news\n 🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2020-06-22 23:22:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,home,昆虫", "title": "困在家里，科学家发现9种新昆虫", "title_en": "Stuck at Home, Scientists Discover 9 New Insect Species", "transed": 1, "url": "https://www.wired.com/story/stuck-at-home-scientists-discover-9-new-insect-species/", "via": "", "real_tags": ["科学家", "home", "昆虫"]}]