[{"category": "", "categoryclass": "", "imagename": "274e72c037eb9071209b21da03a4781f.jpg", "infoid": 1003746, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我的贝壳是我的一切。这是我早上开始的第一个节目，也是我晚上结束的最后一个节目。这是我经常调整的程序，以提高我的整体生产力。在我看来，微软发布的Windows终端1.0和WSL2.0将促进壳牌的整体采用。在过去的十年中，我看到许多用户安装和使用不同的shell。然而，投入时间配置shell以提高工作效率的人数只占很小的比例。这太可惜了！\n如果您安装和使用shell而不进行自定义，您也可以坚持使用Finder或Windows资源管理器等工具。像ZSH这样的shell一旦有了单独的配置就会大放异彩：这些配置可以让您--用户--获得超高的工作效率。我写这篇文章是为了获得灵感。它应该演示如何通过简单的事情(如在ZSH中采用5种类型的别名)来提高您的整体工作效率。别名是获得定制shell体验的第一步。别名是一种超级个体的东西。\n我每天都在使用Docker、Kubernetes和Microsoft Azure。也就是说，让别名支持我使用这些工具和环境是有意义的。但是，可能您使用的是不同的云和命令行工具，因此最终会得到不同的别名。关键的要点应该是您创建并使用别名来帮助您完成工作。\n您的所有别名都在~/.zshc中定义。ZSH在启动期间加载配置文件。但是，您始终可以使用source~/.zshc强制重新加载配置文件。\n本文将教您如何创建和使用这四种类型的别名：\n简单别名是一个很好的起点。我使用它们来减少用来启动命令的击键次数。简单别名的定义使用别名my-alias=&#34；command&#34；模式。\n#导航别名别名dev=&#34；cd~/dev/&#34；别名Personal=&#34；cd~/dev/thorstenhans&#34；别名business=&#34；cd~/dev/thinktecture&#34；#kubectl别名别名k=&#34；kubectl&#34；别名kgx=&#34；kubectl config Get-Context&#34；#docker。\n在我的~/.zshc中注册了这些别名后，我可以快速导航到常用目录，只需几次击键就可以启动我经常使用的命令。\n后缀别名是使用-s标志定义的。使用后缀别名，您可以在您喜欢的工具中启动具有特定扩展名(或后缀)的文件。要注册后缀别名，我们使用alias-s tension=name-of-the-tool模式。以下示例假定已安装VisualStudio代码，并且可以从终端使用code命令启动。\necho&#34；#Hello World&#34；&gt；sample.md#现在键入文件名，然后通过ENTERsample.md提交。\n后缀别名将sample.md转换为代码sample.md，您应该看到VisualStudio Code正在启动并显示sample.md的内容。\n有时您希望创建需要一些上下文信息的别名。参数用于描述shell命令的该上下文信息。使用参数注册别名看起来非常类似于常规编程语言中的函数定义。我们使用以下模式定义带参数的别名：\n例如，假设您要优化在Azure订阅中列出Azure Kubernetes Service(AKS)实例的流程。为了实现这一点，Azure CLI提供了azaks list命令。该命令允许通过添加几个参数进行进一步配置。\n以下别名接受两个参数-第一，资源组名称(资源组是Azure中的逻辑容器)。第二个参数指定所需的输出格式。\n现在，我们可以使用带有参数的getaks别名在resource-group-1中查找AKS实例，并使用getaks resource-group-1 jsonc以彩色JSON(Jsonc)格式打印结果。\n全局别名是使用-g标志定义的。全球别名是咄咄逼人的。注册后，它将用指定的命令替换所有出现的别名。该定义遵循模式alias-g aliasName=&#34；command&#34；。\n#我必须经常请求Azure资源ID别名-g qid=&#34；--query id-o tsv&#34；\n将qid注册为全局别名后，我可以在使用Azure CLI请求唯一资源标识符时优化性能。请参阅以下代码片段，将常规命令与使用我的全局别名的优化命令进行比较：\n#查询AKS实例的标识符的正确命令ak show-n myaks2020-g rg-demo--query id-o TSV#查询具有全局别名的AKS实例的标识符的命令akks show-n myaks2020-g rg-demo qid。\n操作系统特定的别名不是真实类型。但是，我认为特定于平台的别名很重要-尤其是在使用多个平台时。我每天都使用MacOS作为驱动程序，所以我的钻机上也有一些别名。\n不过，我喜欢使用Linux作为操作系统的VisualStudio Codespaces。在这两种情况下，我都想使用我的点文件。为此，我使用简单的if语句。\n#MacOS别名如果[[$OSTYPE==达尔文*]]；则别名刷新=#39；dscacheutil-flushcache&#39；#应用程序别名浏览=#34；打开-a/应用程序/谷歌\\Chrome.app&#34；#*浏览Azure门户别名azure=&#34；浏览https://preview.portal.azure.com&#34；文件。\n我的~/.zshc中有两个别名，这两个别名非常高效。我使用EC在我最喜欢的编辑器中打开~/.zshc，并使用sc将其源代码(将~/.zshc的当前状态应用于您的ZSH会话)。两者的别名定义如下所示：\n#使用$EDITOR别名EC=&#34；$EDITOR$HOME/.zshc&#34；#source~/.zshc别名sc=&#34；中指定的默认编辑器打开~/.zshc\n您已经看到了四种不同类型的ZSH别名，它们将提高您的工作效率。使用了四种不同类型的别名来实现shell中的几乎所有功能。\n不用着急。做些调查。确定您每天或经常使用的命令行工具，查找模式，并创建相应的别名，通过减少击键来提高您的工作效率。\n在所有操作系统上都有强大的shell(最后包括使用WSL2.0的Windows)，您应该关心您的shell性能。让ZSH成为你自己的。\n我做了很多会议演讲；如果你也在会议或聚会上发表演讲，你应该从快速解释你在整个演讲过程中将使用的别名来开始你的演讲，以便让你的听众加入到你的演讲中。也许他们用kc而不是k来表示kubectl。😂", "note_en": "My shell means everything to me. It is the first program I start in the morning and the last one I close in the evening. It is the program that I regularly tweak to boost my overall productivity. From my perspective, Microsoft’s release of Windows Terminal 1.0 and WSL 2.0 will boost overall Shell adoption. Over the past decade, I have seen numerous users installing and using different shells. However, the number of people that invest time in configuring their shell to be more productive is just a small percentage. And that is a shame!\n You can also stick with tools like Finder or Windows Explorer if you install and use a shell without customizing it. Shells like ZSH shine once they have individual configurations: configurations that make you - the user - super productive. I wrote this article for inspiration. It should demonstrate how you can increase your overall productivity with simple things like adopting the 5 types of aliases in ZSH. Aliases are the first step towards a tailored shell experience. Aliases are a super individual thing.\n I use Docker, Kubernetes, and Microsoft Azure every day. That said, it makes sense for me to have aliases supporting me with these tools and environments. However, maybe you are using different clouds and command-line tools so that you will end up with different aliases. The key takeaway should be that you create and use aliases to help you get your job done.\n All your aliases are defined in  ~/.zshrc. ZSH loads the configuration file during startup. However, you can always force to reload your configuration file use  source ~/.zshrc.\n This article will teach you how to create and use these four types of aliases:\n   Simple Aliases are a good starting point. I use them to reduce the number of keystrokes to fire up a command. The definition of a simple alias uses the  alias my-alias=&#34;command&#34; pattern.\n # navigation aliases alias  dev = &#34;cd ~/dev/&#34; alias  personal = &#34;cd ~/dev/thorstenhans&#34; alias  business = &#34;cd ~/dev/thinktecture&#34; # kubectl aliases alias  k = &#34;kubectl&#34; alias  kgx = &#34;kubectl config get-contexts&#34; # docker aliases alias  d = &#34;docker&#34; alias  dps = &#34;docker ps&#34;\n Having those aliases registered in my  ~/.zshrc, I can navigate quickly to commonly used directories and to fire-up commands that I use frequently using just a few keystrokes.\n  Suffix Aliases are defined using the  -s flag. With suffix aliases, you can launch files with a specific extension (or suffix) in your favorite tool. To register a suffix alias, we use the  alias -s extension=name-of-the-tool pattern. The following samples assume that VisualStudio Code is installed and can be launched using the  code command from the terminal.\n   echo  &#34;#Hello World&#34;  &gt; sample.md # now type the name of the file and commit via ENTERsample.md\n The suffix alias translates  sample.md into  code sample.md, and you should see VisualStudio Code launching and showing the content of  sample.md.\n  Sometimes you want to create aliases the require some contextual information. Parameters are used to describe this contextual information for shell commands. The registration of aliases with parameters looks pretty similar to a function definition in regular programming languages. We use the following pattern to define aliases with parameters:\n  For example, consider you want to optimize the process of listing Azure Kubernetes Service (AKS) instances in your Azure Subscription. To achieve this, Azure CLI provides the  az aks list command. The command allows further configuration by adding several parameters.\n The following alias accepts two parameters—first, the Resource Group Name (Resource Groups are logical containers in Azure). The second parameter specifies the desired output format.\n  We can now use the  getaks alias with parameters to look for AKS instances in  resource-group-1 and print results in colored JSON ( jsonc) using  getaks resource-group-1 jsonc.\n  Global aliases are defined using the  -g flag. A global alias is aggressive. Once registered, it replaces all occurrences of the alias name with the specified command. The definition follows the pattern  alias -g aliasName=&#34;command&#34;.\n # I have to ask for Azure Resource Ids frequently alias  -g  qId = &#34;--query id -o tsv&#34;\n Having  qId registered as a global alias, I can optimize my performance when asking for unique resource identifiers using Azure CLI. See the following snippet comparing the regular command, to the optimized one using my global alias:\n # proper command to query the identifier of an AKS instanceaz aks show  -n myaks2020  -g rg-demo  --query  id  -o tsv # command to query the identifier of an AKS instance with global aliasaz aks show  -n myaks2020  -g rg-demo qId\n  An operating system specific alias is not a real type. However, I think platform-specific aliases are important—especially when using multiple platforms. I use macOS as a daily driver, so I also have some aliases tied to my rig.\n However, I love VisualStudio Codespaces that are using Linux as an operating system. In both situations, I want to use my dotfiles. To achieve this, I use simple  if-statements.\n # macOS aliasses if  [[  $OSTYPE  == darwin *  ]] ;  then alias  flush = &#39;dscacheutil -flushcache&#39; # Apps alias  browse = &#34;open -a /Applications/Google \\  Chrome.app&#34; # * Browse Azure Portal alias  azure = &#34;browse https://preview.portal.azure.com&#34; fi\n    I have two aliases in my  ~/.zshrc, which are super-efficient. I open my  ~/.zshrc in my favorite editor with  ec and source it (apply the current state of  ~/.zshrc to your ZSH session) with  sc. The alias definition for both looks like this:\n # open ~/.zshrc in using the default editor specified in $EDITOR alias  ec = &#34; $EDITOR   $HOME /.zshrc&#34; # source ~/.zshrc alias  sc = &#34;source  $HOME /.zshrc&#34;\n  You have seen four different types of ZSH aliases that will boost your productivity. Foud different types of aliases used to achieve almost everything in your shell.\n Take your time. Do some research. Identify the command-line tools you are using daily or regularly, find patterns, and create corresponding aliases that increase your productivity by reducing keystrokes.\n Having powerful shells on all operating systems (finally including windows using WSL 2.0), you should care about your shell performance. Make ZSH your own.\n I do a lot of conference speaking; if you are presenting at conferences or meetups too, you should start your presentation by quickly explaining the aliases you will use throughout the talk to onboard your audience. Maybe they are using  kc instead of  k for  kubectl. 😂", "posttime": "2020-05-26 10:36:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "应该,zsh", "title": "你应该知道的5种ZSH别名", "title_en": "5 Types of ZSH aliases you should know", "transed": 1, "url": "https://thns.io/2X3GTtE", "via": "", "real_tags": ["应该", "zsh"]}, {"category": "", "categoryclass": "", "imagename": "0663e09d40f2d4e29c134f544f2b778f.jpg", "infoid": 1003745, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Brume-00：11 2020年5月24日#我喜欢这个演示。只有4KB？哇，令人印象深刻！干得好！", "note_en": "Brume - 00:11 24 May 2020  #  Love this demo. Only 4kb? Wow, impressive! Great job!", "posttime": "2020-05-26 10:20:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "消失,demo,喜欢", "title": "阿什拉的消失：使用GPU进行声音和路径跟踪的4KB演示", "title_en": "The Vanishing Of Ashlar: 4kb demo using GPU for sound and pathtracing", "transed": 1, "url": "https://demozoo.org/productions/278629/", "via": "", "real_tags": ["消失", "demo", "喜欢"]}, {"category": "", "categoryclass": "", "imagename": "a12c356d5b84ff0b094142e86074d346.png", "infoid": 1003744, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几个帖子之前，我们查看了AVX-512面具注册器。具体地说，八个建筑一下的物理语域的数量，以及其他一些行为，如归零习语。最近，一张SKX的高分辨率冲模出现了，我想通过肉眼检查来核实我们的登记数量会很酷。当我试图做到这一点时，我发现了另一件有趣的事情，而不是…。\n我们对这张Fritzchens Fritz最近在Flickr上发布的死亡照片很感兴趣。我们将重点关注突出显示的区域，该区域似乎包含芯片上的所有寄存器堆。如果你想要了解内核的完整细节，你可以在Twitter、RWT和英特尔的论坛(线程)上查看这里的猜测。\n下面是该部分的特写，各种寄存器文件的假定用途标记为1。\n通用寄存器堆具有正确的相对宽度(64位)，并且位于整数执行单元下方的正确位置。\n通过比较SKL 2(无AVX-512)和SKX(具有AVX-512)管芯，并注意SKL中不存在底部文件(SKL中的该点存在较大的空白区域)，可以确定512位ZMM寄存器(特写中标记为ZMM)的上部256位。\n这会将未知块保留为红色。该块位于矢量执行单元下方的主要位置。会不会是掩码寄存器(Kregs)？在第一篇文章中，我们发现掩码既不与标量寄存器共享，也不与SIMD寄存器共享，因此我们希望它们有自己的物理寄存器堆。也许就是这个了？\n让我们将神秘寄存器堆与整数寄存器堆进行比较，因为它们在大小上应该是相似的，并且看起来实现方式也是相似的：\n查看左侧的通用寄存器文件，每个块(其中6个在通用文件上编号)似乎实现了16位，就好像放大您会看到一个由16个元素组成的重复结构，而4个块总共为64位，这是文件的预期宽度。从公布的数字中我们知道整数寄存器堆具有180个条目，并且由于有4个块的6行，我们期望每行实现180/6=30个寄存器。\n现在我们把注意力转向这个神秘的文件，我们认为它可能是Kreg文件。一共有30个街区。查看通用寄存器，我们确定每个块可以保存来自30个寄存器的16位。因此，30个块就是：30个块*30个寄存器/块*16位/64位=225个寄存器。嗯，上次我们计算了一下，大约有142个物理掩码寄存器，所以这个数字似乎太高了。\n还有另一个问题：我们只有三列16位块，总共48位，水平方向。但是，我们知道掩码寄存器必须最多64位(当对完整的512位矢量寄存器使用逐字节时)。此外，虽然我们上面的计算结果是一个整数，但是块的数量(30)不能被4整除，所以即使您假设块的排列无关紧要，也不可能从每个寄存器映射到4个不同的块。相反，我们需要一些奇怪的东西，比如2个块提供15个寄存器(而不是30个)，但是64位宽(而不是32个)。这似乎不太可能。\n现在让我们先看一下左边的两个成对的列。如果我们以SIMD寄存器为例，则寄存器的全宽度不必水平地出现在单行中：SIMD寄存器在一行中具有256位(分成两条128行)，但是512位ZMM寄存器中的其它256位垂直地出现在图中由ZMM构成的寄存器堆中。\n由于掩码寄存器与ZMM寄存器的元素相关联，也许它们是以AME的方式分开的？也就是说，64位掩码寄存器使用来自上半部分的一个2x16(32位)块和来自下半部分的一个块来组成64位？这是总共20个块，按照上面的相同计算给出了150个寄存器。这与我们从实验中发现的142个更接近。\n静止…。那种烦人的感觉。142不等于150，那么第三列块呢？我开始怀疑这到底是不是掩码寄存器堆。那会是什么呢？我意识到有一个寄存器文件没有说明：用于传统x87浮点和MMX的文件。x87浮点和MMX是同一个文件，因为MMX寄存器在架构上别名为x87寄存器3。那么这个文件在哪里呢？我看了看周围的死胡同。没有好的候选人。\n那么也许我们一直在看的东西实际上是X87/MMX寄存器堆？在某种程度上，它更适合：x87FP寄存器堆需要大约80位宽，因此可以解释额外的列：如果我们像以前一样假设每行都是寄存器的一半，那么就是96位。这足以保存80位扩展精度值，剩下的16位可能用于存储ftstw和相关指令访问的FPU状态字。此状态字在每次操作后更新，因此也必须重命名以获得合理的性能5。\n这可能是X87/MMX寄存器堆的其他证据也来自FRITZ：\n请注意，虽然寄存器堆的高256位被屏蔽(此芯片仅支持AVX2，不支持AVX-512，因此没有ZMM寄存器)，但我们考虑的寄存器堆是整体存在的。\n理论上很酷，兄弟，但我们不是又回到了原点吗？如果这是用于x87/MMX寄存器的文件，则屏蔽寄存器位于何处？\n有一种可能性我们还没有讨论，尽管你们中的一些人现在可能已经在显示器上讨论过了：也许X87/MMX和KREG寄存器文件是共享的。即，将物理别名6物理地混叠到竞争共享的相同寄存器堆。\n我们将使用亨利·黄(Henry Wong)最初描述的测试方法，我们在上一篇关于这个主题的帖子中也使用了这种方法。以下是该技术的快速描述，直接从该帖子复制和粘贴。\n我们通过可变数量的填充指令来分隔两个高速缓存未命中加载指令，填充指令数量根据我们探测的CPU资源而有所不同。当填充指令的数量足够少时，两个高速缓存未命中并行执行，并且它们的等待时间重叠，因此&gt；总执行时间大致与单个未命中一样长。\n然而，一旦填充指令的数量达到临界阈值，所有目标资源都会被消耗，并且指令分配会在发出第二次未命中之前停止，因此高速缓存未命中不能再并行运行。这会导致运行时达到约为&gt；基线缓存未命中延迟的两倍。\n最后，我们确保每个填充指令恰好消耗一个我们感兴趣的资源，以便峰值的位置指示底层资源的大小。例如，常规GP指令通常消耗来自GP PRF的一个物理寄存器，因此是测量该资源大小的好选择。\n我们用来查看两个寄存器堆是否共享的诀窍是，首先单独使用每个寄存器堆大小的测试，使用仅针对该寄存器堆的填充符的测试，然后运行第三个测试，该测试的填充符在使用每个寄存器堆的指令之间交替。如果寄存器堆是共享的，我们预计所有测试都会产生相同的结果，因为它们都是从同一池中提取的。如果寄存器堆未共享，则第三次(交替)测试应导致更高的表观资源限制，因为从两个不同的池中提取，因此将需要两倍的填充指令才能达到RF限制。\n说够了，我们开始吧。首先，我们看测试38，它使用MMX指令7来确定x87/MMX寄存器堆的大小：\n我们在128条指令上看到一个明显的峰值，因此推测的8X87/MMX寄存器堆的大小似乎是128个条目。\n接下来，我们有测试43，它遵循与测试38相同的模式，但使用kaddd作为填充指令，因此以掩码(Kreg)寄存器堆为目标：\n这与前面的图表几乎没有区别，我们得出结论，推测掩码寄存器文件的大小也是128。\n让我们看看当替换MMX和另一种指令类型时会发生什么。测试39用整数SIMD指令替换MMX，测试40替换用通用标量指令：\n这两者都显示出相同的效果：有效的资源限制要高得多：大约210条填充指令。这强烈表明x87/MMX寄存器不与SIMD或标量寄存器堆共享。\n最后，我们来到这个故事的结尾，测试41。该测试混合了MMX和掩码寄存器指令9：\n这一次绝对不同于其他几次。我们看到现在的资源限制是128，与单一类型的测试相同。我们可以立即得出结论，这意味着掩码寄存器和MMX寄存器是从相同的资源池中分配的：它们使用相同的物理寄存器文件。\n这解开了丢失寄存器堆的谜团：没有丢失任何东西，而这一个寄存器堆只是起到双重作用。\n通常情况下，共享寄存器堆在性能方面可能需要注意，但很难想象这会对任何非人工示例产生影响。谁将大量使用X87或MMX(两者都已过时)以及AVX-512掩码寄存器(与“过时”截然相反)？这似乎极不可能。在任何情况下，寄存器堆仍然相当大，因此无论如何都不太可能达到限制。\n因此，共享这些文件是降低功耗和面积的一个很酷的技巧：寄存器文件并不都那么大，但它们位于靠近执行单元的黄金地段。\n然而，这一次最酷的是，这是我第一次研究芯片(这对我来说甚至是可能的，这对我来说是非同寻常的)，并提出了关于硬件的理论，我们可以用目标微基准来测试和确认。在这里，事情实际上是这样发生的。我已经意识到寄存器堆共享的可能性(Henry从一开始就在rosize中对这一权利进行了测试)-但是，尽管我考虑了其他共享方案，但我从未考虑过在x87/mmx和掩码寄存器之间共享，直到我尝试识别Franz的骰子上的寄存器堆。\n感谢弗里茨·弗里茨(Fritzchens Fritz)，他创造了这里分析的骰子镜头，并慷慨地将它们放入了公共领域。\nHenry Wong撰写了向我介绍这项技术的原始文章，随后与我分享了他的工具的代码，该工具现在托管在GitHub上。\nNemez做了芯片击穿的细目，指出有问题的寄存器堆是某种类型的整数寄存器堆。\n感谢Daniel Lemire，他提供了访问本文中使用的SKX硬件的权限。\nZMM、YMM和XMM寄存器在体系结构上全部重叠。也就是说，xmm0只是ymm0的底部128位，对于ymm0和zmm0也是如此。从物理上讲，实际上只有ZMM寄存器，其他两个寄存器只是那些较大寄存器的特定位范围。因此，芯片上标记为YMM的区域实际上意味着：不属于相应的XMM寄存器的YMM寄存器的上部。。↩\n事实上，凯比湖，因为我们最好的死亡射击来自那个芯片，但这是一回事。↩。\n我想，这是一个技巧，允许操作系统和其他不知道MMX寄存器存在的代码保存和恢复MMX寄存器。在从SSE到AVX的转换过程中也出现了类似的混乱，不知道AVX的代码可能会意外地使用SSE指令损坏AVX寄存器的上部(如果SSE将高位清零)，因此我们反而会得到传统SSE和肮脏上游的持续问题。-↩。\n这是一个谎言：我并没有真的环顾芯片周围：我在执行单元附近寻找，因为寄存器文件的可能性很高。-↩。\n整数标志(所谓的EFLAGS寄存器)也需要重命名，我相信它们使用了类似的技巧：将它们的结果写入为结果分配的相同物理寄存器：我已经在缩放视图上标记了我认为包含所谓SPAZO组的文件，而C标志可以存储在相同的位置，也可以存储在较薄的位置(单比特？)。位于GP文件右侧的文件。↩。\n我在这里谈论物理别名，是为了将其与逻辑/体系结构别名区分开来。逻辑混叠是软件可见的：YMM和XMM寄存器在逻辑上混叠，因为对xmm0的写入显示在ymm0的低位。类似地，MMX和X87寄存器堆具有别名，因为写入MMX寄存器修改FP寄存器堆栈中的值，尽管规则更为复杂。逻辑混叠通常意味着物理混叠，但不是反过来。因此，物理混叠意味着将两个寄存器集重命名到同一物理寄存器池中，但这通常对软件是不可见的(除非像我们在这里所做的那样进行仔细的性能测试)。↩。\n我使用的是mmx而不是x87，所以我不必处理x87FP堆栈抽象，也不必理解它如何映射到重命名。-↩。\n推测性寄存器堆，因为我们期望一些条目也用于保存架构寄存器的非推测值。稍后我们将回到这一点。--↩。\n具体地说，它混合了我们在单类型测试Test38和Test43中使用的相同的kaddd和por指令。-↩", "note_en": "A  few posts ago we looked at the AVX-512 mask regsiters. Specifically, the number of phyiscal registers underlying the eight architectural ones, and some other behaviors such as zeroing idioms. Recently, a high resolution die shot of  SKX appeared, and I thought it would be cool to verify our register count by visual inspection. While trying to do that, I ran across something else interesting instead…\n We’re interested in this die shot, recently released by  Fritzchens Fritz on  Flickr. We’ll be focusing on the highlighted area, which seems to have all the  register files on the chip. If you want a full breakdown of the core, you can check guesses  here on Twitter,  on RWT and on  Intel’s forums ( thread).\n  Here’s a close-up of that section, with the assumed purpose of the various register files labeled  1.\n   The general purpose register files are the right relative width (64 bits), and are in the right position below the integer execution units.\n    The uppper 256 bits of the 512-bit  zmm registers (labelled ZMM on the closeup) can be determined from comparing the  SKL  2 (no AVX-512) and  SKX (has AVX-512) dies and noting that the bottom file is not present in  SKL (a large empty area is present at that spot in  SKL).\n This leaves the unknown block in red. This block is in a prime spot below the vector execution units. Could it be the mask registers (kregs)? We found in the  first post that the mask aren’t shared with either the scalar or  SIMD registers, so we expect them to have their own physical register file. Maybe this is it?\n Let’s compare the mystery register file to the integer register file, since they should be similar in size and appear to be implemented similarly:\n  Loooking at the general purpose register file on the left, each block (6 of which are numbered on the general purpose file) seems to implement 16 bits, as if you zoom in you see a repeating structure of 16 elements, and 4 blocks makes 64 bits total which is the expected width of the file. We know from published numbers that the integer register file has 180 entries, and since there are 6 rows of 4 blocks, we expect each row to implement 180 / 6 = 30 registers.\n Now we turn our attention to the mystery file, with the idea that it may be the kreg file. There are a total of 30 blocks. Looking at the general purpose registers, we determined each block can hold 16 bites from 30 registers. So 30 blocks gives us: 30 blocks * 30 registers/block * 16 bits / 64 bits = 225 registers. Hmmm, we calculated last time that there are ~142 physical mask registers, so this seems way too high.\n There’s another problem: we only have three columns of 16-bit blocks, for a total of 48 bits, horizontally. However, we know that a mask register must be up to 64 bits (when using a byte-wise for a full 512-bit vector register). Also, while our calculation above worked out to a whole number, the number of blocks (30) is not divisible by 4, so even if you assumed the arrangement of the blocks didn’t matter, there is no posible mapping from each register to 4 distinct blocks. Instead, we’d need something weird like 2 blocks providing 15 registers (instead of 30), but 64 bits wide (instead of 32). That seems very unlikely.\n So let’s look just at the two paired columns on the left for now. If we take the  SIMD registers as an example, it is not necessary that the full width of the register is present horizontally in a single row: the  SIMD registers have 256 bits in a row (split into two 128 lines), but the other 256 bits in a 512-bit zmm register appears vertically below, in the register file maked ZMM in the diagram.\n Since the mask registers are associated with elements of zmm registers, maybe they are split up in the ame way? That is, a 64-bit mask register uses one 2x16 (32-bit) chunk from the top half and one from the bottom half, to make up 64 bits? This is 20 total blocks, giving 150 registers by the same calculation above. This is much closer to the 142 we found from experiment.\n Still… that nagging feeling. 142 is not equal to 150, and what about that third colum of blocks? I started doubting this was the mask register file after all. What could it be then? I realized there was one register file unaccounted for: the file for legacy x87 floating point and MMX. x87 floating point and MMX are the  same file because MMX registers are architecturally aliased onto the x87 registers  3. So where is  this file? I looked all around  4 the die shot. There are no good candidates.\n So maybe  this thing we’ve been looking at is actually the x87/MMX register file? In one way it’s a better fit: the x87 FP register file needs to be ~80 bits wide, so that would explain the extra column: if we assume each row is half of a register as before, that’s 96 bits. That’s enough to hold 80 bit extended precision values, and the 16 bits left over are probably could be used to store the FPU status word accessed by  ftstw and related instructions. This status word is updated after every operation so must  also be renamed for reasonable performance  5.\n Additional evidence that this might be the x87/MMX register file comes from this   KBL die shot also from Fritz:\n  Note that while the high 256 bits of the register file are masked out (this chip supports only AVX2, not AVX-512 so there are no  zmm registers), the register file we are considering is present in its entirety.\n Cool theory bro, but aren’t we back to square zero? If this is the file for the x87/MMX registers, where do the mask registers live?\n There’s one possibility we haven’t discussed although some of you might be scraming it at your monitors by now: maybe the x87/MMX and the kreg register files are  shared. That is, physically aliased  6 to the same register file, shared competitively.\n  We’ll use the test method originally  described by Henry Wong and which we used in the  last post on this topic. Here’s the quick description of the technique, directly copy and pasted from that post.\n We separate two cache miss load instructions by a variable number of  filler instructions which vary based on the CPU resource we are &gt; probing. When the number of filler instructions is small enough, the two cache misses execute in parallel and their latencies are overlapped so the &gt; total execution time is roughly as long as a single miss.\n  However, once the number of filler instructions reaches a critical threshold, all of the targeted resource are consumed and instruction allocation &gt; stalls before the second miss is issued and so the cache misses can no longer run in parallel. This causes the runtime to spike to about twice the &gt; baseline cache miss latency.\n  Finally, we ensure that each filler instruction consumes exactly one of the resource we are interested in, so that the location of the spike indicates the size of the underlying resource. For example, regular  GP instructions usually consume one physical register from the  GP  PRF so are a good choice to measure the size of that resource.\n The trick we use to see if two register files are shared is first to use a test the size of each register file alone, using a test that uses filler that targets only that register file, then to run a third test whose filler  alternates between instructions that use each register file. If the register files are shared, we expect all tests to produce the same results, since they are all drawing from the same pool. If the register files are not shared, the third (alternating) test should result in a much higher apparent resource limit, since two different pools are being drawn from and so it will take twice as many filler instructions to hit the RF limit.\n Enough talk, let’s do this. First, we look at  Test 38, which uses MMX instructions  7 to target the size of the x87/MMX register file:\n  We see a clear spike at 128 instructions, so it seems like the size of the speculative  8 x87/MMX register file is 128 entries.\n Next, we have  Test 43 which follows the same pattern as  Test 38 but using  kaddd as a filler instruction so targets the mask (kreg) register file:\n  This is mostly indistinguishable from the previous chart and we conclude that the size of the speculative mask register file is also 128.\n Let’s see what happens when alternate MMX and another instruction type.  Test 39 alternates MMX with integer  SIMD instructions, and  Test 40 alternatives with general purpose scalar instructions:\n   Both of these show the same effect: the effective resource limitation is much higher: around 210 filler instructions. This indicates strongly that the x87/MMX register is not shared with either the  SIMD or scalar register files.\n Finally, we get to the end of this tale,  Test 41. This test mixes MMX and mask register instructions  9:\n  This one is definitely not like the others. We see that the resource limit is now 128, same as for the single-type tests. We can immediately conclude that this means that mask registers and MMX registers are allocated from the same resouce pool:  they use the same physical register file.\n This resolves the mystery of the missing register file: nothing is missing but rather this one register file simply serves double duty.\n Normally a shared register file might be something to watch out for, performance-wise, but it is hard to imagine this having an impact in any non-artificial example. Who is going to be making heavy use of x87 or MMX (both obsolete) along with AVX-512 mask registers (the opposite end of the spectrum from “obsolete”)? It seems extremely unlikely. In any case, the register file is still quite large so hitting the limit is unlikely in any case.\n So sharing these files is a cool trick to reduce power and area: the register files aren’t all that big, but they live in pretty prime real-estate close to the execution units.\n What’s cool about this one though is that is the first time that I’ve  looked at a chip (that this is even possible is remarkable to me) and come up with a theory about the hardware we can test and confirm with a targeted microbenchmark. Here, it actually happened that way. I was already aware of the possibility of register file sharing (Henry had tests for this right in robsize from the start) – but although I considered other sharing scenarios I never considered sharing between x87/MMX and the mask registers until I tried to identify the register files on Franz’s die shots.\n  Thanks to  Fritzchens Fritz who created the die shots analyzed here, and who graciously put them into the public domain.\n Henry Wong who wrote the  original article which introduced me to this technique and subsequently shared the code for his tool, which is now  hosted on github.\n Nemez who did a breakdown of the die shot, noting the register file in question as some type of integer register file.\n Thanks to  Daniel Lemire who provided access to the  SKX hardware used in this post.\n   The zmm, ymm and xmm registers all overlap, architecturally. That is,  xmm0 is just the bottom 128 bits of  ymm0, and similarly for  ymm0 and  zmm0. Physically, there are really  only  zmm registers and the other two are simply specific ranges of bits of those larger register. So the area marked  YMM on the die shot really means:  the upper parts of the  ymm registers which are not part of the corresponding xmm register.  ↩\n  Actually Kaby Lake, since the best die shots we have are from that chip, but it’s the same thing.  ↩\n  As a trick, I guess, to allow MMX registers to be saved and restored by operating systems and other code that weren’t aware of their presence. A similar mess occurred with the transition from SSE to AVX, where code unaware of AVX could accidentally clobber the upper part of AVX registers using SSE instructions (if SSE zeroed the upper bits), so instead we get the ongoing issue with  legacy SSE and dirty uppers.  ↩\n  This is a lie: I didn’t really look around  all around the die: I looked near by the execution units were the register file would be with very high probability.  ↩\n  The integer flags (so-called  EFLAGS register) also need to be renamed and I believe they pull a similar trick: writing their results to the same physical register allocated for the result: I’ve marked the file that I think holds the so-called  SPAZO group on the zoomed view, and the C flag may be stored in the same place or in the thin (single bit?) file immediately to the right of the  GP file.  ↩\n  I talk of  physical aliasing here, to distinguish it from the logical/architectural aliasing. Logical aliasing is that which is visible to software: the  ymm and  xmm registers are logically aliased in that writes to  xmm0 show up in the low bits of  ymm0. Similarly, the MMX and x87 register files are aliased in that writes to MMX register modify values in the FP register stack, although the rules are more complicated. Logical aliasing usually implies physical aliasing, but not the other way around. Physical aliasing, then, means that two register sets are renamed onto the same pool of physical registers, but this is usually invisible to software (except though careful performance tests, as we do here).  ↩\n  I use MMX rather than x87 so I don’t have to deal with the x87 FP stack abstraction and understand how that maps to renaming.  ↩\n  The  speculative register file because we expect some entries also to be used to hold the non-speculative values of the architectural registers. We’ll return to this point in a moment.  ↩\n  Specifically, it mixes the same  kaddd and  por instructions we used in the single-type tests  Test 38 and  Test 43.  ↩", "posttime": "2020-05-26 10:05:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "掩码,mask,寄存器", "title": "AVX-512掩码寄存器，再一次", "title_en": "AVX-512 Mask Registers, Again", "transed": 1, "url": "https://travisdowns.github.io/blog/2020/05/26/kreg2.html", "via": "", "real_tags": ["掩码", "mask", "寄存器"]}, {"category": "", "categoryclass": "", "imagename": "350b3e6e012afd02f2ec3ca6c7876806.png", "infoid": 1003743, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "部分PowerPoint功能無法於“谷歌簡報”顯示。如果您作出變更，有關內容可能會被移除.", "note_en": "部分 PowerPoint 功能無法於「Google 簡報」顯示。如果您作出變更，有關內容可能會被移除。", "posttime": "2020-05-26 10:04:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "企业,assessment,變更", "title": "初创企业的风险评估和优先级排序", "title_en": "Risk Assessment and Prioritization for Startups", "transed": 1, "url": "https://docs.google.com/presentation/d/1Ox9mwO7aCfwXUw1pllKTKCpiEJi3oIW6KHrXfNtrIXQ/edit#slide=id.p", "via": "", "real_tags": ["企业", "變更"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003742, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我在Twitter上进行了一些关于IPv6的有趣讨论。然后有人问Android是否在11版操作系统中获得DHCPv6支持。\n这在理论上听起来不错，但完全忽略了我们从IPv4中学到的教训。更不用说，根本没有绿地这回事。几乎所有的网络，都是现有的，你不必从头再来。这是非常闪亮的端到端连接视图，/64无处不在，而且只允许SLAAC。我明白这一切，就像在说“我希望没有战争”，但不幸的是，人们是愚蠢的，所以会有战争。有一种天真，就像一个正在成长的青少年。你想改变世界，然后你就会意识到这个世界是由金钱、超级军团和肮脏的政客统治的。\n这整个混乱导致了SLAAC+RDNSS与DHCPv6的圣战。请注意，SLAAC最初甚至没有设置DNS服务器的选项。基本上，这意味着您只有部分实现。拥有一个DNS服务器…是非常有用的。最初，微软操作系统确实支持SLAAC，但不支持RDNSS，Android不想支持DHCPv6。这意味着您不能在同一子网上支持这两个操作系统。\n令我大吃一惊的是，Android在2020年仍然有一个支离破碎的IPv6实现。是故意的。他们不会把它修好的。谷歌和洛伦佐·科利蒂(Lorenzo Colitti)有几个很有说服力的论点，但它们都相当站不住脚。然而，具有讽刺意味的是，人们在要求它，但谷歌不愿意实施它，因为他们认为自己比用户知道得更多。他们会很高兴地监视您、向您投放广告并出售您的数据，但是允许您运行DHCPv6将会对您造成伤害。\n毫无疑问，SLAAC是有效的，并且它可以在相当大的环境中工作，不过，在我看来，DHCPv6是更好的选择。这里的谬误在于，许多IPv6布道者都持这种忽视业务需求的象牙塔观点。有业务要求和法规遵从性要求，您需要跟踪哪些主机在什么时间拥有哪些IP。此外，企业也会做蠢事。这就是事实。谷歌不应该决定你要做什么。\n当然，您可以同时运行SLAAC和DHCPv6，但是为什么呢？如果你阅读上面的Google帖子，你会发现许多人浪费了很多时间，并且有非常合理的商业原因，因为他们为什么想要实现DHCPv6。以下是几个例子：\n我相信有些用例是有解决办法的，但我的观点是：企业需要DHCPv6、Google或其他任何公司，不应该规定您手头有什么选项。因此，可悲的是，即使在2020年，Android仍然有一个支离破碎的IPv6实现。", "note_en": "I got into some interesting discussions about IPv6 on Twitter. Then someone asked if Android is getting DHCPv6 support in version 11 of the OS.\n    This sounds good in theory but ignores completely the lessons we’ve learned from IPv4. Not to mention,  there is no such thing as greenfield. Almost all networks, are existing ones,  you don’t get to start all over again. There was this very shiny view of end to end connectivity, /64 everywhere and only SLAAC allowed. I get all of that, it’s like saying “I wish there were no wars”, but unfortunately, people are stupid, so there will be wars. There’s this naivety, similar to a teenager that is growing up. You want to change the world, then you realize the world is run by money, mega corps, and dirty politicians.\n This whole mess led to the holy wars of SLAAC + RDNSS vs DHCPv6. Please note that SLAAC didn’t even initially have the option of setting a DNS server. Basically, that meant you only had a partial implementation. It’s pretty useful to have a DNS server… Initially, Microsoft operating systems did support SLAAC but not RDNSS, Android  did not want to support DHCPv6. That meant that you couldn’t support these two operating systems on the same subnet.\n Much to my surprise, Android still has a  broken IPv6 implementation in 2020. By design. They are not going to fix it. There are a couple of valid arguments from Google and Lorenzo Colitti, but they are pretty weak. The irony of it all though is that people are asking for it but Google is not willing to implement it, because they  think they know better than their users. They will happily  spy on you, serve you ads, and sell your data, but allowing you to run DHCPv6 would be doing you a disservice.\n There’s no doubt that  SLAAC works, and that it can work in fairly large environments, still, DHCPv6 is in my mind the better option. The fallacy here is that many IPv6 evangelists take this ivory tower view of ignoring business requirements. There are business requirements, and compliance requirements, where you need to track what host had what IP at what time. Also, enterprises do stupid things. That’s just a fact.  Google is not the one that should decide what you get to do.\n You could, of course, run both SLAAC and DHCPv6 simultaneously, but why? If you read the Google thread above, you will see that many people have wasted a lot of time, and have very valid business reasons, for why they want DHCPv6 implemented. Here are a few:\n  I’m sure there are some workarounds for some of the use cases but my point is: Enterprises need DHCPv6, Google, or anyone else for that matter,  should not dictate what options you have at your hand. So, sadly, even in 2020,  Android still has a broken IPv6 implementation.", "posttime": "2020-05-26 10:04:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "android,2020,ipv6,dhcpv6", "title": "现在是2020年了，Android的IPv6仍然是坏的", "title_en": "It’s 2020 and Android’s IPv6 Is Still Broken", "transed": 1, "url": "http://lostintransit.se/2020/05/22/its-2020-and-androids-ipv6-is-still-broken/", "via": "", "real_tags": ["android", "2020", "ipv6", "dhcpv6"]}, {"category": "", "categoryclass": "", "imagename": "cdd40a7a72390f5ccce479ebb173387d.jpg", "infoid": 1003740, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Requests for Startup汇集了来自主要投资者、创始人和运营商的100个伟大的商业想法。然后我们每周发一封10个的电子邮件，因为最好的想法不应该是秘密。\n听听来自领先公司的创始人和投资者认为下一个大企业可能会是什么。\n自从Y Combinator创造了“Requests for Startups”这个词以来，投资者就开始用这个词来指代他们希望形成的想法。问题出在哪里？这些想法通常只与一群精选的企业家分享，或者以博客帖子和推文等非结构化形式发布。这意味着伟大的企业家可能会错失良机，原因很简单，因为他们不是某个群体的一员，或者没有依附于合适的平台。\nRFS100翻转脚本。我们要求慷慨的投资者、创始人和经营者与世界分享他们最好的想法。然后，我们以结构化、一致的格式提供它们，以帮助您在想法迷宫中入门。\n由Aashay和Mario创建和策划。在我们各自的时事通讯中阅读更多我们的文章。", "note_en": "Requests For Startup compiles 100 great business ideas from leading investors, founders, and operators. Then we send out an email with ten a week because the best ideas shouldn&#39;t be a secret.\n   Hear what founders and investors from leading companies think could be the next big business.\n  Ever since Y Combinator coined the term &#34;Requests for Startups,&#34; investors have used it to refer to ideas they hope get built. The problem? Those ideas are often only shared with a select group of entrepreneurs, or delivered in unstructured formats like blog posts and tweets. That means that great entrepreneurs might miss out, simply because they&#39;re not part of a certain group, or glued to the right platform.\n RFS100 flips the script. We ask generous investors, founders and operators to share their best ideas with the world. Then we deliver them in a structured, consistent format to help you get started down the idea maze.\n     Created and curated by Aashay and Mario. Read more of our writing in our respective newsletters.", "posttime": "2020-05-26 09:47:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "创业,ideas,想法", "title": "来自风投和创始人的100个创业想法", "title_en": "100 startup ideas, from VCs and Founders", "transed": 1, "url": "https://www.rfs100.com/", "via": "", "real_tags": ["创业", "ideas", "想法"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003737, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这篇文章中，我将分享我对围棋程序应该如何以一种干净而灵活的方式进行测试的看法。\n日志记录、度量集合以及与某些代码的主要功能无关的任何内容都不得出现在该代码中。取而代之的是可以由用户检测的代码的定义跟踪点。\n让我们假设我们有一个名为lib的包和一些lib.clientstructure，它们在每次执行somquest时都会ping其底层连接。\n包库类型客户端结构{conn net.。conn}函数(c*客户端)请求(CTX上下文。上下文)错误{if err：=c..。ping(Ctx)；err！=nil{return err}//这里有一些逻辑。}func(c*client)ping(CTX上下文。上下文)错误{返回掺杂(CTX，c.。CONN)}。\n如果我们需要在ping发生之前和之后写入一些日志，该怎么办？一种方法是将一些记录器(或记录器接口)注入客户端：\n包库类型客户端结构{Logger Logger Conn Net.。conn}函数(c*客户端)ping(CTX上下文。上下文)(错误){c..。伐木者。信息(&#34；ping开始&#34；)错误=掺杂(CTX，c.。conn)c.。伐木者。信息(&#34；ping已完成(错误为%v)&#34；，错误)返回}。\n包库类型客户端结构{Logger Logger Metrics Registry Conn Net.。conn}函数(c*客户端)ping(CTX上下文。上下文)(错误){开始：=时间。现在()c.。伐木者。信息(&#34；ping开始&#34；)错误=掺杂(CTX，c.。conn)c.。伐木者。信息(&#34；ping已完成(错误为%v)&#34；，err)度量：=c..。指标。获取(&#34；PING_LATHERY&#34；)指标。发送(时间。自(开始))返回错误}。\n如果我们继续向客户端添加检测方法，我们将意识到它的大部分代码都与检测相关，而不是与客户端的主要功能相关(这只是一行带有掺杂()调用的代码)。\n不连贯的(与我们客户的主要目的无关)代码行数只是该方法的第一个问题。\n如果在程序的操作过程中，您意识到度量名称(例如，指标名称)是错误的，并且您应该将其重命名，该怎么办呢？或者您必须使用一些不同的库来记录日志？\n使用上面的方法，您将需要转到客户端的实现(以及其他类似的组件)并对其进行更改。\n这意味着每当与组件的主要功能无关的内容发生更改时，您都要更改代码。换句话说，这样的设计确实违反了SRP原则。\n如果您在多个程序之间共享代码，该怎么办？如果您甚至根本无法控制代码的使用者(老实说，我建议将每个包视为被未知数量的程序重用的包，即使实际上只有一个包是您的)。\n在我看来，正确的方法是定义跟踪点(又名钩子)，然后代码用户可以在运行时使用某个函数(又名探测)初始化这些跟踪点。\n当然，这仍然会增加一些额外的代码行，但也会给用户带来灵活性，让他们可以使用任何适当的方法来测量我们组件的运行时。\n让我们提供几乎相同的机制，但有一个变化。我们不提供OnPingStart()和OnPingDone()挂钩，而是引入单个OnPing()挂钩，该挂钩将在ping之前被调用，并将返回一个回调，后者将在ping之后立即被调用。这样，我们可以将一些变量存储在闭包中，以便在ping完成时访问它们(例如，计算ping延迟)。\n包库类型客户端结构{OnPing func()func(Error)conn net.。conn}函数(c*客户端)ping(CTX上下文。上下文)(错误){完成：=c..。OnPing()Err=掺杂(CTX，c.。conn)完成(错误)返回}。\n看起来很整洁，但除非我们意识到OnPing挂钩和回调它的返回可能都为零：\n函数(c*客户端)ping(CTX上下文。上下文)(错误){如果fn：=c，则变量完成函数(错误)。OnPing；Fn！=nil{Done=Fn()}Err=掺杂(CTX，c.。conn)如果完成！=nil{Done(Err)}return}。\n现在它是正确的，仍然擅长灵活性和SRP原则，但不太擅长代码简单性。\n在简化代码之前，让我们先讨论一下当前钩子实现还存在的另一个问题。\n用户将如何设置多个探测器？因此，前面提到的httptrace包具有ClientTrace.compose()方法，该方法将两个跟踪结构合并到第三个跟踪结构中。因此，result tingtrace中的每个探测函数都将调用先前跟踪中的相应探测(如果设置了它们的话)。\n因此，让我们首先尝试手动执行相同的操作(并且不使用反射)。为此，我们将OnPing挂钩从客户端移至单独的结构ClientTrace：\n包库类型客户端结构{Trace ClientTrace conn net.。conn}type ClientTrace struct{OnPing func()func(Error)}\nfunc(A ClientTrace)Compose(B ClientTrace)(C ClientTrace){Switch{case a.。OnPing==nil：c.。OnPing=b.。安平案件b。OnPing==nil：c.。Onping=a.。OnPing默认值：c.。onPing=func()func(错误){doona：=a.。On Ping()Done B：=b.。onPing()开关{case dona==nil：return donB case donA B==nil：return dona默认值：return func(Err Error){dona(Err)donB(Err)}return c}。\n单钩的代码很多，对吧？现在让我们继续前进，稍后再回来讨论这个问题。\n包主导入(&#34；log&#34；&#34；ome/path/to/lib&#34；)func main(){var trace lib.。ClientTrace//日志挂钩。TRACE=跟踪。作曲(唱词)。ClientTrace{OnPing：func()函数(错误){日志。Println(&#34；ping start&#34；)返回函数(错误){日志。Println(&#34；ping Done&#34；，Err)}}，})//一些指标挂钩。TRACE=跟踪。作曲(唱词)。ClientTrace{OnPing：func()func(错误){start：=time.。NOW()返回函数(错误){METRY：=STATS。获取(&#34；PING_LATHERY&#34；)指标。发送(时间。由于(Start))}}，})c：=lib。客户端{跟踪：跟踪，}}。\n我们还可以为用户提供的一件事是基于上下文的跟踪。也就是说，它与httptrace包中的完全相同-能够将挂钩与传递给Client.Request()的context.Context相关联。\n包库类型clientTraceContextKey struct{}func ClientTrace(CTX上下文。上下文)ClientTrace{t，_：=ctx.。value(clientTraceContextKey{})return t}func WithClientTrace(CTX上下文。上下文，t ClientTrace)上下文。context{prev：=ContextClientTrace(Ctx)返回上下文。WithValue(CTX，clientTraceContextKey{}，Prev.。作曲(T)，)}。\n哈。看起来现在差不多完成了，我们已经准备好为我们组件的用户带来所有最好的跟踪工具。\n但是，为我们想要检测的每个结构编写所有代码不是真的很乏味吗？当然，您可以为此编写一些vim的宏(实际上我以前也是这样做的)，但是让我们看看替代方法。\n好消息是合并钩子和检查nil，以及特定于上下文的函数都是模式化的，所以我们可以在没有宏或反射的情况下为它们生成GO代码。\ngtrace是一个命令行工具，它为上面讨论的tracingmethod生成GO代码。它建议您使用带有钩子字段的结构(用//gtrace：gen标记)，并围绕它们生成帮助器函数，这样您就可以合并这样的结构并调用钩子，而无需任何检查。它还可以生成上下文感知帮助器来调用与上下文相关联的挂钩。\nPackage lib//go：生成gtrace//gtrace：gen//gtrace：设置上下文类型ClientTrace struct{OnPing func()func(Error)}type client struct{Trace ClientTrace conn net。conn}函数(c*客户端)ping(CTX上下文。上下文)(错误){完成：=c..。痕迹。onPing(CTX)ERR=掺杂(CTX，c.。conn)完成(错误)返回}。\n运行Go Generate之后，我们将能够使用在ClientTrace中定义的生成的非导出版本的跟踪挂钩。\n就这样!。gtrace负责样板代码，并允许您将注意力集中在您希望能够由用户检测的跟踪点上。\n克里斯韦隆的极简主义C库。我很久以前读过这篇文章，关于图书馆如何组织的清晰想法给了我灵感。", "note_en": "In this article I will share my thoughts on how Go programs should beinstrumented in a clean and flexible way.\n  Logging, metrics collection and anything that is not related to mainfunctionality of some code, must not appear within that code. Instead, definesome  trace points of the code that can be instrumented by a user.\n    Let’s assume that we have some package called  lib and some  lib.Clientstructure which pings its underlying connection every time while making somerequest.\n package  lib type  Client  struct  {\t conn  net . Conn } func  ( c  * Client )  Request ( ctx  context . Context )  error  {\t if  err  :=  c . ping ( ctx );  err  !=  nil  {\t\t return  err\t }\t // Some logic here.  } func  ( c  * Client )  ping ( ctx  context . Context )  error  {\t return  doPing ( ctx ,  c . conn ) }\n What if we need to write some logs right before and after ping happens? One wayis to inject some logger (or logger interface) into the  Client:\n package  lib type  Client  struct  {\t Logger  Logger\t conn  net . Conn } func  ( c  * Client )  ping ( ctx  context . Context )  ( err  error )  {\t c . Logger . Info ( &#34;ping started&#34; )\t err  =  doPing ( ctx ,  c . conn )\t c . Logger . Info ( &#34;ping done (err is %v)&#34; ,  err )\t return }\n  package  lib type  Client  struct  {\t Logger  Logger\t Metrics  Registry\t conn  net . Conn } func  ( c  * Client )  ping ( ctx  context . Context )  ( err  error )  {\t start  :=  time . Now ()\t c . Logger . Info ( &#34;ping started&#34; )\t err  =  doPing ( ctx ,  c . conn )\t c . Logger . Info ( &#34;ping done (err is %v)&#34; ,  err )\t metric  :=  c . Metrics . Get ( &#34;ping_latency&#34; )\t metric . Send ( time . Since ( start ))\t return  err }\n If we continue to add instrumentation methods to our  Client, we’ll realizesoon that most of its code is related to instrumentation and not to the mainfunctionality of the  Client (which was just a single line with  doPing()call).\n Number of non-coherent (non-related to the main purpose of our  Client) linesof code is just a first problem with that approach.\n What if during operations of your program you realize that the metric name, forexample, is wrong and you should rename it? Or you must use some differentlibrary for logging?\n With approach above you will need to go to the implementation of  Client (andother similar components as well) and change it.\n This means that you are going to change code every time when something that isnot related to component’s  main functionality changes. In other words suchdesign does violate the  SRP principle.\n What if you share your code across multiple programs? What if you even don’tcontrol the consumers of your code at all (and to be honest I suggest treating every package as it reused by unknown number of programs, even if in realityit is only one that yours).\n    In my opinion the right way to do it is to define  trace points (aka  hooks)which user of your code can then initialize with some function (aka  probe)during runtime.\n This still will add some extra code lines for sure, but will also bring theflexibility to users to measure our component’s runtime with any appropriatemethod.\n  Let’s provide almost the same mechanics, but with one change. Instead ofproviding  OnPingStart() and  OnPingDone() hooks, let’s introduce a single OnPing() hook which will be called right before ping and will return acallback, which will be called right after ping. This way we can store somevariables in closure to access them when ping completes (e.g. to calculate pinglatency).\n  package  lib type  Client  struct  {\t OnPing  func ()  func ( error )\t conn  net . Conn } func  ( c  * Client )  ping ( ctx  context . Context )  ( err  error )  {\t done  :=  c . OnPing ()\t err  =  doPing ( ctx ,  c . conn )\t done ( err )\t return }\n Looks neat, but only unless we realize that both  OnPing hook and callback itreturns might be nil:\n func  ( c  * Client )  ping ( ctx  context . Context )  ( err  error )  {\t var  done  func ( error )\t if  fn  :=  c . OnPing ;  fn  !=  nil  {\t\t done  =  fn ()\t }\t err  =  doPing ( ctx ,  c . conn )\t if  done  !=  nil  {\t\t done ( err )\t }\t return }\n Now it is correct and is still good at flexibility and SRP principle, but notso good at code simplicity.\n Before making code simpler let’s cover another problem we have yet withcurrent hooks implementation.\n  How users are going to set up  multiple probes? So, the already mentioned httptrace package has   ClientTrace.compose() method thatmerges two trace structs in third one. So every probe function from resultingtrace will call appropriate probes from previous traces (if they were set).\n So let’s first try to do the same manually (and without  reflect). To do this,we move the  OnPing hook from the  Client to separate structure ClientTrace:\n package  lib type  Client  struct  {\t Trace  ClientTrace\t conn  net . Conn } type  ClientTrace  struct  {\t OnPing  func ()  func ( error ) }\n  func  ( a  ClientTrace )  Compose ( b  ClientTrace )  ( c  ClientTrace )  {\t switch  {\t case  a . OnPing  ==  nil :\t\t c . OnPing  =  b . OnPing\t case  b . OnPing  ==  nil :\t\t c . OnPing  =  a . OnPing\t default :\t\t c . OnPing  =  func ()  func ( error )  {\t\t\t doneA  :=  a . OnPing ()\t\t\t doneB  :=  b . OnPing () \t\t\t switch  {\t\t\t case  doneA  ==  nil :\t\t\t\t return  doneB\t\t\t case  doneB  ==  nil :\t\t\t\t return  doneA\t\t\t default :\t\t\t\t return  func ( err  error )  {\t\t\t\t\t doneA ( err )\t\t\t\t\t doneB ( err )\t\t\t\t }\t\t\t }\t\t }\t }\t return  c }\n Pretty much code for single hook, right? Let’s move forward for now and comeback to this later.\n  package  main import  (\t &#34;log&#34;\t\t &#34;some/path/to/lib&#34; ) func  main ()  {\t var  trace  lib . ClientTrace\t // Logging hooks. \t trace  =  trace . Compose ( lib . ClientTrace {\t\t OnPing :  func ()  func ( error )  {\t\t\t log . Println ( &#34;ping start&#34; )\t\t\t return  func ( err  error )  {\t\t\t\t log . Println ( &#34;ping done&#34; ,  err )\t\t\t }\t\t },\t })\t // Some metrics hooks. \t trace  =  trace . Compose ( lib . ClientTrace {\t\t OnPing :  func ()  func ( error )  {\t\t\t start  :=  time . Now ()\t\t\t return  func ( err  error )  {\t\t\t\t metric  :=  stats . Get ( &#34;ping_latency&#34; )\t\t\t\t metric . Send ( time . Since ( start ))\t\t\t }\t\t },\t })\t c  :=  lib . Client {\t\t Trace :  trace ,\t } }\n  One thing that we also may provide users is context based tracing. That is, theone that is exactly the same as in  httptrace package – the ability toassociate hooks with  context.Context passed to the  Client.Request().\n package  lib type  clientTraceContextKey  struct {} func  ClientTrace ( ctx  context . Context )  ClientTrace  {\t t ,  _  :=  ctx . Value ( clientTraceContextKey {})\t return  t } func  WithClientTrace ( ctx  context . Context ,  t  ClientTrace )  context . Context  {\t prev  :=  ContextClientTrace ( ctx )\t return  context . WithValue ( ctx ,\t\t clientTraceContextKey {},\t\t prev . Compose ( t ),\t ) }\n Huh. Looks like now it’s almost done, and we are ready to bring all the best ofthe tracing facilities for users of our component.\n But isn’t it really tedious to write all that code for every structure we wantto instrument? Of course, you can write some vim’s macros for this (actually Iused to do them before), but let’s look at alternatives.\n The good news is that merging hooks and checking for nil, as well as contextspecific functions are all quite patterned, so we can generate Go code for themwithout macros or reflection.\n  gtrace is a command line tool that generates Go code for the tracingapproach discussed above. It suggests you to use structures (tagged with //gtrace:gen) with hook fields and generates helper functions around them, sothat you can merge such structures and call the hooks without any checks fornil. It also can generate context aware helpers to call hooks associated withcontext.\n   package  lib //go:generate gtrace  //gtrace:gen //gtrace:set context  type  ClientTrace  struct  {\t OnPing  func ()  func ( error ) } type  Client  struct  {\t Trace  ClientTrace\t conn  net . Conn } func  ( c  * Client )  ping ( ctx  context . Context )  ( err  error )  {\t done  :=  c . Trace . onPing ( ctx )\t err  =  doPing ( ctx ,  c . conn )\t done ( err )\t return }\n After run of  go generate we will be able to use the generated  non-exportedversions of trace hooks we defined in  ClientTrace.\n That’s it!  gtrace takes care of boilerplate code and allows you to focus on trace points you wish to make able to be instrumented by users.\n   Minimalistic C libraries by ChrisWellons. I read this article long time ago and was inspired by that clearthoughts on how libraries could be organized.", "posttime": "2020-05-26 08:31:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "围棋,instrumentation,代码", "title": "围棋中的工具", "title_en": "Instrumentation in Go", "transed": 1, "url": "https://gbws.io/articles/instrumentation-in-go/", "via": "", "real_tags": ["围棋", "代码"]}, {"category": "", "categoryclass": "", "imagename": "3d14f27bac3f4521cc870be1e045907a.jpg", "infoid": 1003735, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "让我的耳朵贴近地面，…。史蒂文·K·罗伯茨(Steven K.Roberts)在这艘极客船上的中心主题之一是扩大感官。我一直对各种形式的数据收集着迷…。不仅是揭示系统健康或环境状况的传感器，还包括实时信息，将我的感知转移到一个更大的…中。\n多读。\n把它带到外面去，kitty…。史蒂芬·K·罗伯茨(Steven K.Roberts)在DataWake OK上建造了一个船猫猫砂箱，所以我承认它是…。我喜欢这只猫。伊莎贝尔和我住在一起，她胖乎乎的可爱的令人敬畏的身材在很多方面提高了生活质量。但即使是一只古怪的俄罗斯蓝也会按下所有正确的猫咪按钮，除了…。\n多读。\n多年来，我的痴迷之一是收集数据，探测无线电频谱，感知我有限的视觉和听觉范围之外的信号，以及部署探测器来扩大我对环境的认识。这导致了对模式的识别，更好地理解了事物是如何工作的，以及在技术或人类活动的幕后偷窥的兴奋。跟踪…。\n多读。\n我无法想象在没有猫的情况下生活在船上，伊莎贝尔在游牧者号上呆了三年后和我一起搬到了Datawake。她是一个持续不断的快乐，但仍然有一些猫科动物的现实需要考虑：进餐，淘汰和抓挠。考虑到空间的限制和处理动态条件的需要，所有这些都在船上具有挑战性。告诉一只猫…。\n多读。\n史蒂文·K·罗伯茨游牧研究实验室史蒂文·K·罗伯茨游牧研究实验室对我的浮动实验室/工作室的一个关键要求是船上必须有一架数字钢琴，但有限的空间决定了一个部署系统，它可以让它在不使用时存放起来。我围绕这一点设计了游戏机，并建造了一个可以容纳四分之一吨重的钢琴抽屉。抽屉里的…很重要。\n多读。\n这是手推车沙克托普斯号的航程。她的持续使命…。寻找新的负载和陌生的环境…。在没有人眨眼的地方大胆眨眼。在一艘航行的帆船上，稳定的电力随处可见：一个由隔离的岸上电缆和太阳能电池板充电的巨大电池组，带…的柴油发电机组。\n多读", "note_en": "Keeping my ear to the ground… by Steven K. Roberts One of the central themes aboard this geeky ship is expanding the sensorium. I’ve always been fascinated by data collection in all its forms… not just sensors that reveal system health or the state of the environment, but real-time information that shifts my awareness into a much larger…\n  Read More\n Take it Outside, Kitty… Building a Boat Cat Litter Box by Steven K. Roberts, aboard Datawake OK, so I admit it… I love this cat. Isabelle lives aboard with me, and her tubby cuddly awesomeness increases the quality of life in lots of ways. But even a quirky Russian Blue who pushes all the right feline buttons but…\n  Read More\n One of my obsessions over the years has been collecting data, probing the radio spectrum, sensing outside my limited visual and hearing range, and deploying probes to expand my awareness of the environment. This leads to recognition of patterns, better understanding of how things work, and the voyeuristic thrill of peeking behind the curtains of technology or human activity. Tracking…\n  Read More\n I can’t imagine living aboard without a cat, and Isabelle moved with me to Datawake after three years aboard Nomadness. She’s a constant joy, but there are still feline realities that have to be considered: dining, elimination, and scratching. All are challenging on a boat, given space constraints and the need to handle dynamic conditions. Telling a cat…\n  Read More\n by Steven K. Roberts Nomadic Research Labs A key requirement for my floating lab/studio was to have a digital piano aboard, but limited space dictates a deployment system that lets it stow away when not in use. I designed the console around this, and built a piano drawer that can handle a quarter-ton. It was important that the drawer…\n  Read More\n These are the voyages of the hand truck, Shacktopus. Her continuing mission… to seek out new loads and strange environments… to boldly blink where no one has blinked before. On a voyaging sailboat, stable power goes with the territory: a huge battery bank charged by isolated shore cable and solar panels, diesel genset with a…\n  Read More", "posttime": "2020-05-26 08:30:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科技,library,实验室", "title": "Microship.com：科技图书馆", "title_en": "Microship.com: The Library of Technomadics", "transed": 1, "url": "https://microship.com/", "via": "", "real_tags": ["科技", "library", "实验室"]}, {"category": "", "categoryclass": "", "imagename": "659cc163dc7d7e135bc8c6f11d9e7c44.jpg", "infoid": 1003734, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了捕捉自然景观中女性裸体的图像，安妮·布里格曼有时会在8000英尺高空的内华达山脉扎营数周或数月。“我去的地方很狂野--很难到达。因为在这些地方有生活中的东西需要表达，“她在1916年写信给”名利场“的一名记者。布里格曼会把她沉重的摄影设备装上舞台马车，这些马车穿过萨克拉门托山谷，沿着美国河谷向上移动，然后用骡子完成她的旅程，登上唐纳山口或进入荒凉山谷。她的妹妹伊丽莎白和一些朋友经常陪着她，他们一起露营、徒步旅行、嬉戏和摆姿势看布里格曼的照片。\n布里格曼在这些逗留期间创作的作品使她成为20世纪初一位开创性的摄影师。她是一位帮助塑造美国现代主义、女权主义和风景画摄影传统的艺术家，也是最早拍摄裸体照片的女性之一。1902年，她在旧金山展示了她的第一张照片，一年后，阿尔弗雷德·斯蒂格利茨(Alfred Stieglitz)任命她为他的照片分离运动的成员。她发表了诗歌和艺术评论。然而，她的作品在她于1950年去世后变得默默无闻，享年81岁。今年春天，由内华达艺术博物馆(Nevada Museum Of Art)的安·M·沃尔夫(Ann M.Wolfe)组织的她的摄影展计划前往纽约大学的格雷艺术馆(Grey Art Gallery)。它和纽约市几乎所有的文化活动都被取消了。很难准确衡量一个艺术展的损失在今年展开的恐怖账簿上记录了什么。不过，我承认我很难接受这一点。布里格曼这幅壮观而鲜为人知的作品已经等了太久才能见分晓。\n布里格曼(Née Nott)十几岁时来到加州，当时她的父母是基督教传教士，全家从她的出生地夏威夷搬了过来。1894年，她25岁时嫁给了丹麦船长马丁·布里格曼，并在奥克兰定居。(这对夫妇从未生过孩子，并于1910年分居，尽管从未合法离婚。)。布里格曼最早的照片，通常是用她的姐妹作为模特制作的，是梦幻般的构图，以女性在鲜花中摆姿势或披着薄纱织物的理想化表现为特色。但是，随着她的实践的发展，布里格曼不再描绘女性的纯真。她给她的图像命名具有崇高的象征意义(“源头”、“庇护所”)，但这些图片本身从一种质朴的、具体化的触觉中汲取力量。\n布里格曼的照片中柔软的裸体扭曲着，靠在缠绕在一起的刺柏树干上，这种树干在高西拉斯山脉的恶劣环境中很常见；她捕捉到膝盖沿着粗糙的花岗岩滑动，皮肤暴露在风和寒冷中。作为一名年轻女子，布里格曼在与丈夫一起航海时受伤，导致她的左乳房留下了严重的疤痕。在她的自画像中，她经常通过用石墨和油漆操纵底片或研磨乳剂来掩盖毁容。布里格曼从未公开评论过她的受伤情况。但不难想象，这可能有助于她将女性描绘成凡人，而不是地球上的女神。\n当时的男性边疆摄影师倾向于传达一种无所不知的、对美国风景进行评估的观点，而布里格曼则对人类与自然世界的感官、手势和互动感兴趣。例如，在她的照片“黎明”中，布里格曼把她赤裸的身体放在了标志性的唐纳湖景色的前景中。她的身体压倒了超越她的壮丽辽阔的风景，即使她的曲线在视觉上呼应了环绕湖泊的山脉。\n1910年，在旧金山湾区感到艺术上与世隔绝的布里格曼前往纽约市，计划学习白金印刷，并与阿尔弗雷德·斯蒂格利茨(Alfred Stieglitz)一起参观。多年来，他一直在计划并推迟举办布里格曼作品个展。(斯蒂格利茨称赞她是“极少数做过个人作品的摄影师之一”，但抱怨她缺乏技巧。)。一到纽约，布里格曼很快就对这座城市的严酷以及斯蒂格利茨和他的男性艺术家圈子周围的氛围感到厌烦。斯蒂格利茨当时在他著名的291画廊展出的几乎所有照片都是以女性裸体为中心的。但是，布里格曼发现，在斯蒂格利茨的场景中，男人们经常轻视这个主题，瞪着眼睛，开下流的笑话。这一点，她后来写信给斯蒂格利茨，“令她震惊。”她离开了纽约市，再也没有回来；她的个展从未发生过。\n布里格曼对裸体的承诺既是美学的，也是哲学的；她认为裸体是最好的表达形式，正如她所说(呼应了她最喜欢的作家惠特曼)，“干净、强烈的肉体和灵魂的自由”。在1926年发表的一篇文章中，布里格曼写道，感觉被克服了，p", "note_en": "To capture her images of female nudes in natural landscapes, Anne Brigman sometimes set up camp for weeks or months at a time, eight thousand feet up in the Sierra Nevada. “Where I go is wild—hard to reach . . . because there [are] things in life to be expressed in these places,” she wrote to a  Vanity Fair reporter, in 1916. Brigman would load her heavy camera equipment into stagecoaches that picked their way through the Sacramento Valley and up the American River Canyon, then finish her journey using pack mules to ascend to Donner Pass or into Desolation Valley. Her sister Elizabeth and a selection of friends often accompanied her, and together they would camp, hike, cavort, and pose for Brigman’s pictures.\n  The work Brigman created on those sojourns made her a groundbreaking early-twentieth-century photographer. She was an artist who helped shape American modernist, feminist, and landscape photographic traditions—and was one of the first women to photograph herself in the nude. She showed her first photographs in San Francisco, in 1902, and a year later was anointed by Alfred Stieglitz, who awarded her membership in his Photo-Secession movement. She published poetry and art criticism. Yet her work fell into obscurity after her death at the age of eighty-one in 1950. This spring, an exhibition of her photographs, organized by Ann M. Wolfe of the Nevada Museum of Art, was scheduled to travel to N.Y.U.’s Grey Art Gallery. It was cancelled, along with almost all of New York City’s cultural events. It’s difficult to measure exactly where the loss of a single art exhibition registers on this year’s unfurling ledgers of terror. Yet I confess to taking this one hard. Brigman’s spectacular, little-known work has already waited too long to be seen.\n    Brigman (née Nott) arrived in California as a teen-ager, when her parents, Christian missionaries, moved the family from Hawaii, where she had been born. She married a Danish sea captain, Martin Brigman, in 1894, at the age of twenty-five, and settled in Oakland. (The couple never had children, and separated in 1910, though never legally divorced.) Brigman’s earliest images, often made using her sisters as models, were dreamy compositions featuring idealized representations of women posed amid flowers or draped in gossamer fabrics. But, as her practice developed, Brigman moved away from depictions of feminine innocence. The titles she gave her images are loftily symbolic (“The Source,” “Sanctuary”), but the pictures themselves draw their power from an earthy, embodied touch.\n  The soft nude bodies in Brigman’s photographs twist and contort, pushed up against the trunk of the tangled juniper trees that are common in the harsh environment of the High Sierras; she captures knees sliding along rough granite, skin exposed to wind and cold. As a young woman, Brigman sustained an injury, while sailing with her husband, that resulted in heavy scarring on her left breast. In her self-portraits, she often concealed the disfigurement by manipulating negatives with graphite and paint or abrading the emulsion. Brigman never commented publicly on her injury. But it’s easy to imagine that it could have contributed to her interest in representing women not as earth goddesses but as mortal beings.\n  Where male frontier photographers of the time tended to convey an omniscient, assessing view of the American landscape, Brigman was interested in the sensual, the gestural, the interanimation of human beings and the natural world. In her photograph “Dawn,” for instance, Brigman places her nude body in the foreground of the iconic vista of Donner Lake. Her body overwhelms the sublime vastness of the scenery beyond her, even as her curves visually echo the mountains that surround the lake.\n   In 1910, feeling artistically isolated in the Bay Area, Brigman travelled to New York City, with a plan to learn platinum printing and to visit with Alfred Stieglitz. For years, he had been planning and postponing a solo exhibition of Brigman’s work. (Stieglitz praised her for being “one of the very few photographers who have done any individual work,” but complained that she lacked technique.) Once in New York, Brigman quickly became turned off by the harshness of the city and the atmosphere surrounding Stieglitz and his circle of male artists. Nearly all the photographs Stieglitz was exhibiting at his famous 291 Gallery at the time centered on the female nude. But, Brigman found, the men in Stieglitz’s scene often belittled the subject, ogling and making ribald jokes. This, she would later write to Stieglitz, “staggered her.” She left New York City and never returned; her solo exhibition never happened.\n  Brigman’s commitment to the nude was both aesthetic and philosophical; she believed it to be the greatest form for expressing, as she put it (echoing Whitman, her favorite writer), “the clean, strong freedom of body and soul.” In an essay published in 1926, Brigman wrote of feeling overcome, the previous summer, by a “hunger for the clean, high, silent places, up near the sun and the stars.” To be able to go where you want to go, to enjoy the corners of the world you most enjoy—it’s not an ideologically neutral credo. One could argue that Brigman’s photos participate in a settler fantasy of the “untamed” landscape, perhaps as much as those of any male photographer of her era. But it’s a credo that few women of Brigman’s time would have dared to live by. And it’s one that, from our vantage now, indoors, cramped and unfree, we might realize we’ve taken for granted.", "posttime": "2020-05-26 08:15:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "摄影,二十世纪,twentieth,女性", "title": "一位被遗忘的二十世纪摄影师的自然界女性野性肖像", "title_en": "A Forgotten Twentieth-Century Photographer’s Wild Portraits of Women in Nature", "transed": 1, "url": "https://www.newyorker.com/culture/photo-booth/a-forgotten-twentieth-century-photographers-wild-portraits-of-women-in-nature", "via": "", "real_tags": ["摄影", "二十世纪", "twentieth", "女性"]}, {"category": "", "categoryclass": "", "imagename": "4daf6a287a0cafd33f5109168d7bcf9d.jpeg", "infoid": 1003733, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们已经确认从飞机上干净地放行。然而，任务在飞行中不久就结束了。宇宙女孩和我们的机组人员安全返回基地。\n宇宙女孩在太平洋时间下午12点(美国东部时间下午3点)之前从加利福尼亚州的莫哈韦航空和太空港起飞。这架飞机由首席试飞员凯利·拉蒂默(Kelly Latimer)和她的副驾驶托德·埃里克森(Todd Ericson)驾驶。飞机随后飞往目标释放点，LauncherOne确实按计划在太平洋时间下午12：50左右(美国东部时间下午3：50)从航母上“干净释放”，但维珍航空在几分钟后指出，任务随后“终止”。\n虽然宇宙女孩机组人员和所有其他员工都被公司确认是安全的，但这很可能是一次令人失望的考验。尽管如此，维珍轨道公司的首席执行官丹·哈特和副总裁威尔·波梅兰茨告诫说，许多新发射系统的首次测试任务并没有完全按照计划进行-这就是为什么你毕竟要测试的原因。\n该公司仍有可能从这次任务中收集到大量有价值的数据，这应该会提供对哪里出了问题的洞察。一旦该公司解决了这些问题，它很可能会进行另一次尝试，那可能不会像你想象的那么远，因为维珍一直在非常积极地进行运载火箭流水线，并有几乎准备好飞行的后备飞行器。\n“在从运载火箭上释放后，LauncherOne火箭在提示下成功点燃了助推器发动机-这是该公司首次尝试空中点火，”维珍轨道公司通过一名发言人在谈到今天的任务时表示。“然后在第一阶段飞行早期出现异常，任务安全终止。“宇宙女孩”号航母及其全体机组人员安全降落在莫哈韦航空航天港，结束了任务。“", "note_en": "We&#39;ve confirmed a clean release from the aircraft. However, the mission terminated shortly into the flight. Cosmic Girl and our flight crew are safe and returning to base.\n Cosmic Girl took off just before 12 PM PT (3 PM ET) from Mojave Air and  Spaceport   in California. The aircraft was piloted by Chief Test Pilot Kelly Latimer, along with her co-pilot Todd Ericson. The aircraft then flew to its target release point, where LauncherOne did manage a “clean release” from the carrier craft as planned at around 12:50 PM PT (3:50 PM ET), but Virgin noted just a few minutes later that the mission was subsequently “terminated.”\n While the Cosmic Girl crew and all other employees are confirmed safe by the company, this is likely to be a disappointing test. Still, Virgin Orbit’s CEO Dan Hart and VP Will Pomerantz cautioned that many first test missions for new launch systems don’t go quite as planned – which is why you test, after all.\n  The company will still likely be able to collect a lot of valuable data from this mission, which should provide insight into what went wrong. Once the company addresses the problems, it’s likely to set another attempt, and that might not be as far away as you might expect because Virgin has been very active on its launch vehicle pipeline and has backup craft nearly ready to fly.\n “After being released from the carrier aircraft, the LauncherOne rocket successfully lighted its booster engine on cue — the first time the company had attempted an in-air ignition,” Virgin Orbit said via a spokesperson about today’s mission. “An anomaly then occurred early in first stage flight, and the mission safely terminated. The carrier aircraft Cosmic Girl and all of its crew landed safely at Mojave Air and Space Port, concluding the mission.”", "posttime": "2020-05-26 08:00:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "火箭,轨道,carrier,任务", "title": "维珍轨道公司首次轨道试飞在火箭从运载机上释放后缩短", "title_en": " Virgin Orbit's First Orbital Test Flight Cut Short After Rocket Released from Carrier Aircraft", "transed": 1, "url": "https://techcrunch.com/2020/05/25/virgin-orbits-first-orbital-test-flight-cut-short-after-rocket-released-from-carrier-aircraft/", "via": "", "real_tags": ["火箭", "轨道", "carrier", "任务"]}, {"category": "", "categoryclass": "", "imagename": "032ea2c9c2620613864bc11aeb433c6e.jpeg", "infoid": 1003732, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着越来越多的新型电动汽车出现在地平线上，内燃机的未来似乎一天比一天黯淡。但这种新型的超高效发动机设计可能会让它继续存在一段时间。\n“工程”解释说，“公路与汽车赛道”撰稿人杰森·芬斯克在YouTube频道的一段新视频中分析了这一新设计，该设计由汽车工程师协会(Society Of Automotive Engineers)发布。虽然它使用活塞和燃料，但它的设计不同于今天道路上的任何其他传统内燃机。\n与普通内燃机不同的是，普通内燃机使用相同的燃烧室来压缩、混合和燃烧空气-燃料混合物，入口点火将工作分散在三个不同的燃烧室中。第一个装有活塞，压缩空气以形成压力和热量。然后，它将压缩空气送入储气罐，储气罐注入另一个将压缩空气与燃料混合的空间。然后，这种热的空气-燃料混合物通过滑动阀被强制吸入另一个腔室，在那里，由于气缸内的热量，它被点燃(不使用火花塞)。这就是名字入口点火的由来。\n我们知道，要消化的东西很多。芬斯克在上面的视频中更详细地解释了这一点。由于设计在同一时间完成进气和燃烧冲程(请记住，在不同的气缸)，它在技术上是一个二冲程发动机。该方法允许更高的压缩比和更低的空燃比，允许理论热效率比普通传统内燃机高出63%-14%。\n当然，这并不是说我们很快就会看到入口式点火发动机出现在公路车辆上。该方法未经验证，在冷却、平衡和可靠性方面存在一系列未知因素。尽管如此，这仍然是一个迹象，在燃油发动机的世界里，并不是所有的东西都失去了。\n此内容由第三方创建和维护，并导入到此页面以帮助用户提供其电子邮件地址。您可以在piano.io上找到有关此内容和类似内容的更多信息。\n此评论区由第三方创建和维护，并导入到此页面。你可以在他们的网站上找到更多信息。", "note_en": "With more and more new electric cars on the horizon, the future of internal combustion engines seems darker every day. But this new type of hyper-efficient engine design might keep it around for a bit longer.\n Road &amp; Track contributor  Jason Fenske breaks down the new design,  published by the Society of Automotive Engineers, in a new video for his YouTube channel, Engineering Explained. Though it uses pistons and fuel, the design unlike any other traditional combustion engine on the road today.\n Unlike a normal combustion engine, which uses the same chamber to compress, mix, and combust an air-fuel mixture, entry ignition splits the work between three different chambers. The first, equipped with a piston, compresses the air to build pressure and heat. It then sends the compressed air into a reservoir, which feeds into another space that mixes the compressed air with the fuel. That hot air-fuel mixture is then forced sucked into another chamber using a slider valve, where, because of the heat inside the cylinder, it ignites (without the use of a spark plug). That&#39;s where the name entry ignition comes from.\n It&#39;s a lot to digest, we know. Fenske explains it in more detail in the video above. Since the design completes the intake and combustion strokes at the same time (in different cylinders, remember), it&#39;s technically a two-stroke engine. The method allows for a higher compression ratio and a leaner air-fuel ratio, allowing for a theoretical thermal efficiency of 63 percent—14 percent better than your average traditional internal combustion engine.\n Of course, it&#39;s not like we&#39;re going to be seeing entry ignition engines popping up in road cars any time soon. The method is unproven, and carries a bunch of unknowns regarding cooling, balancing, and reliability. Still, it&#39;s a sign not all is lost in the world of fuel-powered engines.\n  This content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io\n   This commenting section is created and maintained by a third party, and imported onto this page. You may be able to find more information on their web site.", "posttime": "2020-05-26 07:45:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,发动机,engine", "title": "新的二冲程发动机设计可以帮助内燃保持更长时间", "title_en": "New Two-Stroke Engine Design Could Help Keep Internal Combustion Around Longer", "transed": 1, "url": "https://www.roadandtrack.com/new-cars/car-technology/a32612802/entry-ignition-two-stroke-engine-design-explained/", "via": "", "real_tags": ["设计", "发动机", "engine"]}, {"category": "", "categoryclass": "", "imagename": "2a0955f0c448e437cc8f1e49b1c960dc.jpeg", "infoid": 1003731, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作者注1。很抱歉在时事通讯中耽误了时间。忙碌的一周工作意味着我只能在周日2号开始写这篇文章。根据反馈，我们引入了两个功能--阅读时间和更多阅读时间。另外，我知道你们中的许多人可能已经知道风险投资是如何运作的。请随时跳过这篇介绍性文章：)。\n1940年，哈佛商学院(Harvard Business School)教授乔治·多里奥(Georges Doriot)应征入伍参加第二次世界大战。战争结束后，他的计划与在哈佛任教不同。战争教会了他科学技术在一个国家进步中的重要作用。他决定走一条新路。他成立了美国研究与开发公司(ARDC)，以促进私人资金对士兵创办的企业的投资。他从富裕家庭以外的渠道筹集资金(与当时的标准有很大不同)，目的是鼓励技术创新的商业化。\n1957年，ARDC向一家新公司DEC投资了7万美元，该公司计划制造比IBM当时在市场上提供的更小、更实惠的计算机。11年后的1968年，DEC首次公开募股(IPO)，ARDC的股票估值为3500万美元。有趣的是，ARDC刚刚在东海岸波士顿获得了500倍的回报，点燃了现代风险投资业的辉煌。\n但就在1968年，在3000英里外的西海岸硅谷，才华横溢的工程师罗伯特·诺伊斯(Robert(Bob)Noyce)正准备创办一家新公司。他向经营一家投资公司的朋友亚瑟·洛克(Arthur Rock)寻求资金。亚瑟自己投入了1万美元，并说服他的联系人在几乎两个小时内再投入250万美元。鲍勃·诺伊斯将他的公司命名为集成电子公司，就像英特尔一样。三年后，该公司上市，阿瑟将拿回820万美元--130%的回报率或33%的年回报率。10年后，亚瑟也对苹果下了类似的赌注，并获得了23,000%的净回报！\n英特尔的交易将把风险资本投资的中心转移到硅谷，甚至在波士顿开始成名之前。好了，原创故事讲得够多了。\n从上面的故事中，你一定已经猜到了。风险资本是私人资本对私人公司的投资，即不在证券交易所上市的公司。\n它类似于私募股权投资(PE)，但有点不同。风险资本专注于生命周期非常早期的公司，而私募股权投资则投资于稍晚阶段的公司。正是这种对初创公司(风险更高)的关注，才使这家风险投资进入了风投领域。但你说得对，风险投资本质上是私募股权投资的一个子集。\n它的存在是因为银行贷款的缺口。一般来说，如果你想创业，你会去银行。但银行只向拥有硬资产的新企业放贷(例如，一家工厂)。但在当今的科技经济中，许多初创企业几乎没有硬资产，这使得它们很难获得银行贷款。\n此外，新业务的风险非常高。如此之高，以至于即使银行准备放贷，他们也要收取如此高的利率，以至于没有人会接受贷款。\n银行回避的高风险游戏正是风投蓬勃发展的地方。他们准备把钱给非常年轻的没有资产的公司，也可能是没有经验的企业家。为了承担这种风险，他们获得了公司的部分所有权，而不是提供贷款。所以他们可以抓住更多的上行机会，也就是说，他们可以从未来的利润中分得一杯羹。\n另一个不同之处在于，银行=仅仅是钱。但VC=金钱+关于如何创业的建议，哪个对企业家更有用。\n他们是富有的家庭、养老基金、保险公司和其他类似的机构，随身携带着大量现金。他们向风险投资公司提供资金，风险投资公司反过来投资于初创公司。但他们并不经营风险投资公司(因此才有了“有限”这个词)。\n他们准备投资风险投资基金，因为与他们拥有的其他选择(公开股票市场、债务、房地产等)相比，风险投资基金的预期回报很高。但他们也明白，这是一项风险极高的投资，只将一小部分现金分配给风投(一般为5-10%)。\n他们通常是投资专业人士，有经过证实的记录，实际管理该基金。他们必须平衡多份工作：\n融资：他们联系有限合伙人，向他们推销基金创意(实际上，他们也像初创公司创始人一样大张旗鼓)。希望能从他们那里拿到支票。\n投资：他们必须发现初创企业(风投称其为交易流)，对其进行评估(尽职调查)，然后对其进行投资(开支票，胡说八道！)\n成长：既然他们已经投资了这些初创企业，他们就会通过提供一切力所能及的帮助来帮助他们成长。这可能是战略、寻找人才、向潜在合作伙伴介绍，甚至是下一次筹资的投资者。\n退出：全科医生要么试图将公司上市(IPO)，要么将其出售给另一家公司(并购)，或将其出售给另一家投资者(二次出售)。这是他们赚钱然后返还给有限合伙人的步骤。\n让我们通过一个例子来看待这一点。介绍芭拉。巴拉是一名投资专业人士，她认为在印度建立巨大业务的潜力很大。因此，他想成立一只基金，可以投资并帮助建立这样的企业。巴拉(全科医生)现在不得不从有限合伙人那里安排资金，因为他没有钱。那么，他需要为LP安排哪些细节呢？\n基金规模Bala计划募集多少资金？1000万或1亿美元。或者1000亿美元，如果芭拉像孙正义的话。\n门槛利率这是Bala必须承诺为有限责任公司产生的最低年回报率(以IRR计算)。未能达到这一利率意味着该基金失败了(很多风投基金也失败了)。巴拉在Excel中建立了一个财务模型来计算预期收益，并计算出这个门槛比率。投资重点和投资阶段的行业会影响门槛比率。例如，直接面向消费者(D2C)部门产生的回报低于软件即服务(SaaS)，因为它们的成本结构不同，并且门槛比率较低。专注于种子期交易的基金可能比B系列基金有更高的门槛利率。\n基金寿命每个基金都有7-10年的寿命，在寿命结束时，资金必须返还给有限合伙人。巴拉必须在这个时间框架内超过门槛比率。\n过去的2-3年是巴拉试图退出投资并赚钱的时候。\n交易结构虽然有限合伙人明白风险投资是有风险的，但巴拉必须表明他将采取哪些措施来保护这种风险的下行风险。要做到这一点，一种方法是以优先股的形式投资创业公司，而不是普通股。优先股给予风投比普通股更高的优先权，在初创公司倒闭并出售其资产和技术的情况下，由初创公司创始人提供帮助(哎呀，这有点小意思)。巴拉还可以表明，他将包括\n关于出售公司或何时IPO等关键决策投票权的条款。\n反稀释条款-如果创业公司以较低的估值筹集下一轮融资，基金拥有的股份#将进行调整，以便基金继续拥有与融资前相同的%的创业公司股份。\n对于他的努力和基金运营费用，巴拉每年将向有限合伙人收取基金价值的2%至3%左右的管理费。从这笔钱中，巴拉将支付自己、办公室的租金以及他将雇用的分析师和管理人员的工资。\n提成如果费用是基本工资，提成就是基金业绩好的巴拉将带回家的奖金。在承诺的最低回报之外，基金产生的利润由有限合伙人(70-80%)和普通合伙人(一般为20-30%)分享。这是为了确保巴拉受到激励，使他的基金回报最大化。最终将构成芭拉收入的很大一部分就是随身携带。\n重要的是要知道，一家典型的风险投资公司内部有不同的基金。每只基金可以有不同的生命周期、不同的主题和不同的门槛比率。而且每个基金都可能由不同的全科医生管理。当你浏览风投网站上的投资组合公司名单时，请记住，它们可能是来自不同基金的投资，每一只基金都有不同的目标：)。\n高风险带来高回报。风投预计将产生25-35%的年化回报率，而公开股票市场的年化回报率为12-15%，远高于债券市场8-10%的回报率。\n巴拉最终筹集了1000万美元，并将这笔钱投资于25家公司。为了产生25%的年化回报率，芭拉的基金必须至少是其原始规模的10倍，即所有投资的总和必须达到1亿美元(10年内10倍=同比增长25%)。\n现在，如果所有25家初创公司在巴拉投资后的4-5年内都增长了10倍，这就很简单了。但问题是，很少会出现这种情况。事实上，75%的风险投资初创公司都以失败告终。这并不是因为风投的决策技巧不好。无论你有多聪明，要建立一家成功的公司真的很难，更难在其生命周期的早期找到一家公司。\n正如你在下图中看到的，即使打造一家成功公司的所有个人因素都是高概率的(80%)，公司成功的总体机会也只有17%。即使只有一个因素不太可能发生(比方说50%的可能性)，公司成功的总体可能性就会下降到10%。\n风险投资返还了一项名为幂律的工作。这基本上意味着并不是所有的投资都需要成功。只有一两项成功的投资就能为整个基金带来回报，并弥补所有其他投资的损失。\n在巴拉的25项投资中，假设有12项失败(零值)。12个只增长了2倍(这是不够的)。1项投资增长230倍。此外，Bala&#39；的基金也设法实现了10倍的增长，可以说是成功的。\n这就是Oyo给予LightSpeed Ventures和Byju‘s将给予红杉印度基金的那种回报。大多数风投基金不会产生这样的回报。事实上，他们甚至最终赔钱(回报率不到1倍)。\n巴拉必须从他投资的每一家公司的角度来判断，这笔投资在未来4-5年内会增长200倍吗？这就是为什么风投倾向于只选择那些追求大市场(10亿美元以上)且增长率非常高的公司的原因。当然，以技术为中心的公司符合这一特点，因为它们可以非常快地增长。\n今天就到这里吧。事实证明，这是一场讲解员的马拉松比赛。但我希望你对风险投资基金的运作方式有一个公平的理解。\n第一批风险资本家：关于19世纪捕鲸业如何与现代风险资本非常相似的有趣读物。\n风险投资与互联网的影响：本·汤普森(我最喜欢的一篇)写的一篇关于风投如何受到挤压的精彩文章。传统上，风投投资于从创意到首次公开募股(IPO)的各种初创企业。但由于互联网的出现和很少有其他新的动态，天使投资者的投资处于创意阶段，而富达(Fidelity)等公众投资者的投资则处于首次公开募股(IPO)之前的阶段。这使得风投们在两者之间几乎没有什么空间。", "note_en": "Author&#39;s Note   1. Sorry for the delay in the newsletter. A busy week at work meant I could start writing this only on Sunday 2. Based on feedback, we introduced two features - &#34;Read time&#34; and &#34;More reads on the topic&#34; 3. Also, I understand many of you might be already aware of how Venture Capital works. Please feel free to jump out of this introductory piece :)\n    In 1940, Harvard Business School professor Georges Doriot, was drafted into the US Army for World War II. Once the war was over, he had different plans than teaching at Harvard. War had taught him the important role of science and technology in a country&#39;s progress. And he decided to pursue a new path. He set up the American Research &amp; Development Corporation (ARDC) to facilitate the investment of private money into businesses started by soldiers. He raised money from sources other than wealthy families (very different from the norm then) with the aim to &#34;encourage commercialization of technological innovations&#34;.\n In 1957, ARDC invested $70,000 in a new company DEC that planned to make smaller and more affordable computers compared to what IBM was offering in the market at that point in time. 11 years later, in 1968, DEC IPO-ed valuing ARDC&#39;s share at $35M. ARDC had just made a cool 500x return and set the modern venture capital industry ablaze, interestingly in East Coast Boston.\n But exactly in 1968, 3000 miles away in West Coast Silicon Valley, Robert (Bob) Noyce, a brilliant engineer, was readying to start a new company. He reached out to his friend Arthur Rock, who ran an investment firm, for money. Arthur put in $10,000 of his own and convinced his contacts to put in another $2.5M in practically 2 hours. Bob Noyce named his company Integrated Electronics, as in, Intel. The company went public 3 years later and Arthur would get back $8.2M - a 130% return or 33% annual return. 10 years later, Arthur would make a similar bet on Apple and net a 23,000% return!\n Intel&#39;s deal would shift the center of venture capital investments to Silicon Valley, even before Boston could start making its name. Okay, enough of the origin story.\n  From the stories above, you must already have a guess. Venture capital is the investments of  private capital in private companies, ie, companies not listed on the stock exchange.\n It is like Private Equity (PE) but a bit different. Venture capital focuses on companies very early in their lifecycle while PE invests in slightly more late-stage companies. It&#39;s this focus on early-stage companies (more risk) that puts the &#39;venture&#39; in VC. But you will be right in saying  VC is essentially a subset of PE.\n     It exists because of the gaps in bank lending. Generally, if you wanted to start a new business, you would go to a bank. But banks lend only to new businesses that have hard assets against which they can secure the loan (eg, a factory). But in today&#39;s tech economy, many startups have few hard assets making a bank loan difficult for them.\n Also, the risk of new businesses is very high. So high that even if banks are ready to lend, they have to charge such high interest rates that no one will take the loan.\n The high-risk game that banks shy away from is where VC thrives. They are ready to give money to extremely young companies with no assets and probably inexperienced entrepreneurs as well. And for taking that risk, they take part ownership of the company instead of giving a loan. So they can capture more of the upside, meaning, they can take a share of the future profits.\n Another difference is that bank = just money. But  VC = money + advice on how to build businesses which is more useful to entrepreneurs.\n     They are wealthy families, pension funds, insurance companies, and other such institutions who have large amounts of cash lying with them.  They provide the money to the Venture Capital firm which in-turn invests in startups. But they don&#39;t run the VC firm (hence the term &#39;limited&#39;).\n They are ready to invest in a VC fund because of the high returns expected from it compared to other options they have (public equity markets, debt, real estate, etc). But they also understand that it is an extremely risky investment and  allocate only a small percentage of their cash to VC (generally 5-10%).\n  They are generally  investment professionals with proven track records who actually run the fund. And they have to balance multiple jobs:\n Fundraise: They reach out to LPs and pitch the fund idea to them (they also actually make a deck like startup founders do). And hopefully collect cheques from them.\n Invest: They have to discover startups (VCs call it &#34;Deal Flow&#34;), evaluate them (&#34;Due Diligence&#34;) and then invest in them (write the cheque, duh!)\n Grow: Now that they have invested in these startups, they help them grow by providing whatever help they can. It could be strategy, sourcing talent, introductions to potential partners, and even investors for the next fundraise.\n Exit: The GPs either try to take the company public ( IPO) or sell it to another company ( M&amp;A) or sell it to another investor (Secondary sale). This is the step where they make money and then return it to LPs\n  Let&#39;s view this through an example. Introducing Bala. Bala is an investment professional and thinks there is potential to build huge businesses in India. So he wants to start a fund that can invest in and help build such businesses. Bala (the GP) now has to arrange for money from LPs, because well, he doesn&#39;t have any. So what are the details he will have to layout for an LP?\n Fund Size  What is the amount Bala is planning to raise? $10M or $100M. Or $100B if Bala is like Masayoshi Son.\n  Hurdle Rate  This is the minimum yearly return (calculated as  IRR) that Bala has to promise to generate for LPs. A failure to hit this rate means the fund has failed (and a lot of VC funds fail). Bala builds a financial model in Excel to calculate expected returns and figure out this hurdle rate. The sectors in focus and stage of investment will influence the hurdle rate. For eg, the Direct-to-consumer (D2C) sector generates a lower return than Software-as-a-service (SaaS) because of their different cost structures and will have a lower hurdle rate. A fund focused on seed-stage deals might have a higher hurdle rate than a Series B stage fund.\n Fund Life  Each fund has a life of 7-10 years, at the end of which the money has to be returned to LPs. Bala has to beat the hurdle rate within this time frame.\n The last 2-3 years is when Bala tries to &#39;exit&#39; the investments and make money\n Deal Structure  While the LPs understand VC is risky, Bala has to show what steps he&#39;ll take to protect the downside of that risk. One way to do that is to  invest in the startup in the form of preferred equity, not common equity. Preferred equity gives VCs the higher preference over common equity help by startup founders in case the startup shuts down and sells off its assets and technology (eww, that&#39;s a bit mean). Bala can also show that he&#39;ll include\n Clauses for voting rights on key decisions like selling the company or when to IPO\n Anti-dilution clauses - if the startup raises the next round of funding at a lower valuation, the # of shares owned by the fund will be adjusted so that the fund continues to own the same % of the startup as before the round\n Fees  For his effort and for expenses to run the fund, Bala will charge the LPs a &#39;management fee&#39; which is around  2-3% of the fund value every year. From this amount, Bala will pay himself, the rent for the office and salaries to the analysts and admin staff he&#39;ll hire.\n Carry  If Fee is the basic salary, Carry is the bonus that Bala will take home if the fund performs well. The profit generated by the fund over and above the minimum return promised is shared between the LPs (70-80%) and GPs (20-30% generally). This is to ensure Bala is incentivized to maximize the return of his fund. It is &#39;carry &#39;that will eventually form a large portion of Bala&#39;s earnings.\n  It&#39;s important to know that  a typical VC firm has different funds within them. Each fund could have a different lifetime, different theme and different hurdle rate. And a different GP could be managing each fund. When you go through the list of portfolio companies on a VC&#39;s website, remember that they could be investments from different funds, each of which have different goals :)\n   With high risk comes high returns.  VCs are expected to generate a 25-35% annualized return compared to the 12-15% that public equity markets generate and much higher than the 8-10% return that debt markets give.\n    Bala ended up raising $10M and invested that money in 25 companies. To generate a 25% annualized return, Bala&#39;s fund has to at least 10x its original size, ie, the sum total of all the investments has to be at $100M (10x over 10 years = 25% year-on-year growth)\n Now, this would have been simple if all the 25 startups grew 10x in those 4-5 years after Bala invested. But the problem is, that is rarely the case. In fact,  75% of venture-back startups fail. And it is not because VCs have bad decision-making skills. It is just really hard to build a successful company and even tougher to identify one very early in its lifecycle, however smart you are.\n As you can see in the picture below, even if all the individual ingredients to building a successful company are at a high probability (80%), the overall chance of the company succeeding is only 17%. If even one ingredient is less like to happen (say 50% probability), the overall chance of the company succeeding drops to 10%.\n    VC returns work on something called the &#39;Power Law&#39;. It basically means not all investments need to be a success. Just 1 or 2 successful investments can contribute to the return of the entire fund and make up for losses of all the others.\n Out of the 25 investments by Bala, let&#39;s say 12 failed (zero value). And 12 grew only 2x (which is not enough). And 1 investment grew 230x. Then also, Bala&#39;s fund has managed to grow 10x and can be considered a success.\n This is the kind of return that Oyo gave Lightspeed Ventures and Byju&#39;s is going to give Sequoia&#39;s India fund. Most VC funds don&#39;t generate that kind of return. In fact, they even end up losing money (less than 1x return).\n   Bala has to judge every company he&#39;s investing in from the lens of &#34;Will this investment grow 200 times in the next 4-5 years?&#34;. It is this reason why  VCs tend towards only companies that are going after large markets ($1B+) and have really high growth rates. Naturally, tech-centric companies fit the profile since they can grow very fast.\n   That&#39;s it for today. This turned out to be a marathon of an explainer. But I hope you got a fair understanding of how a VC fund works.\n   The First Venture Capitalists: An interesting read on how the whaling industry of the 1800s was very similar to modern-day venture capital\n Venture Capital and the Internet&#39;s Impact: A superb piece by Ben Thompson (a favourite of mine) on how VCs are getting squeezed. Traditionally, VCs invested in startups from idea to IPO. But due to the advent of the internet and few other new dynamics, angel investors are investing at the idea stage and public investors like Fidelity are investing at the just-before-IPO stage. This has left VCs with very little space in between.", "posttime": "2020-05-26 07:14:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "works", "title": "VC如何工作-初学者指南", "title_en": "How VC Works – A Beginner's Guide", "transed": 1, "url": "https://simplanations.substack.com/p/2-how-vc-works-a-beginners-guide", "via": "", "real_tags": ["works"]}, {"category": "", "categoryclass": "", "imagename": "55b49a3ff0ecc220a440d5b16f2edf8b.jpeg", "infoid": 1003729, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "fast_io是一个新的C++20库，用于极快的输入/输出，旨在取代iostream和cstdio。为了便于包含在您的项目中，它是仅用于标题的(仅用于将来的模块)。它需要功能强大的C++20编译器来支持概念。\n编译时打开模式解析。支持C样式打开模式和C++样式打开模式。\n我的目标是将来在C++标准库中实现这一点：)。\n因为C++20还没有发布。没有标准的概念支持库，这意味着很多概念定义都很难看。它将在C++20正式发布后进行更改。\n我对我的fast_io库进行了一些优化。现在没有理由再使用charconv了。它不安全，API也很糟糕。我希望isocpp将来会反对charconv。", "note_en": "fast_io is a new C++20 library for extremely fast input/output and aims to replace iostream and cstdio. It is header-only (module only in the future) for easy inclusion in your project. It requires a capable C++20 compiler supporting concepts.\n             Compilation time open mode parse. Supports C style open mode and C++ style open mode.\n     I&#39;m aiming for this to be in the C++ standard library in the future :)\n       Since C++ 20 has not been released. No standard supporting libraries for concepts, which means a lot of Concepts Definitions are ugly. It will be changed after C++ 20 is officially published.\n                I did some optimizations to my fast_io library. Now there is NO reason to use charconv any more. It is insecure and the APIs are terrible. I hope isocpp would deprecate charconv in the future.", "posttime": "2020-05-26 05:57:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ios,fmt,faster,将来", "title": "I/O库比FMT快6倍，比stdio.h和iostream快10倍", "title_en": "I/O library 6x faster than fmt, 10x faster than stdio.h and iostream", "transed": 1, "url": "https://github.com/expnkx/fast_io", "via": "", "real_tags": ["ios", "fmt", "faster", "将来"]}, {"category": "", "categoryclass": "", "imagename": "8acccf6dbbdf1b15fc0dab42b685aa8c.jpeg", "infoid": 1003728, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，维基媒体基金会理事会投票批准了维基百科和所有其他维基媒体项目的新信任和安全标准。正如一份新的社区文化声明中概述的那样，这些标准为解决维基媒体运动中的骚扰和不文明行为提供了方向和优先事项，并创造了欢迎、包容、无骚扰的空间，人们可以在其中做出富有成效的贡献和建设性的辩论。\n与志愿贡献者社区密切协商，制定并引入一套通用行为守则，这将是所有维基媒体项目中具有约束力的最低标准；\n采取行动禁止、制裁或以其他方式限制不遵守这些政策和使用条款的维基媒体运动参与者的访问；\n与社区工作人员合作，为涉案各方提起的案件建立和完善追溯审查程序，不包括那些构成法律或其他严重风险的案件；以及。\n显著增加对社区工作人员的支持和与社区工作人员的协作，主要是以优先考虑这些工作人员的人身安全的方式强制执行此类合规。\n董事会的声明正式确认了个人志愿者、维基媒体附属机构、基金会工作人员和其他人多年来为制止骚扰和促进维基媒体项目包容性所做的长期努力。\n维基媒体运动中的骚扰、有毒行为和无礼行为违背了我们共同的价值观，损害了我们的愿景和使命。它们对我们收集、分享和传播免费知识的能力产生了负面影响，损害了个人维基媒体人的眼前福祉，并威胁到维基媒体项目的长期健康和成功。董事会认为，我们在创造欢迎的、包容的、无骚扰的空间方面没有取得足够的进展，人们可以在其中做出富有成效的贡献和建设性的辩论。\n认识到这些问题的紧迫性，董事会正在指示维基媒体基金会与我们的社区合作，直接改善这种情况。这应该包括开发可持续的做法和工具，消除骚扰、毒性和不文明行为，促进包容性，培养尊重的话语，减少对参与者的伤害，保护项目不受虚假信息和不良行为的影响，并促进对我们项目的信任。\n制定并引入通用行为准则(UCoC)，该准则将成为所有维基媒体项目中具有约束力的最低标准集。第一阶段涵盖面对面和虚拟活动、技术空间以及所有维基媒体项目和维基网站的政策，并与国际维基媒体社区合作制定，将于2020年8月30日提交董事会批准。\n第二阶段概述了明确的执行途径，并在维基媒体社区的广泛投入下加以完善，将于2020年底提交董事会批准；\n采取行动禁止、制裁或以其他方式限制不遵守这些政策和使用条款的维基媒体运动参与者的访问权限；\n与社区工作人员合作，为有关各方提起的案件创建和完善追溯审查程序，不包括那些构成法律或其他严重风险的案件；以及。\n显著增加对社区工作人员的支持和协作，主要是以优先考虑这些工作人员的人身安全的方式强制执行此类合规。\n在这些指令实施之前，董事会指示基金会采取和实施政策，以减少对我们项目的骚扰和毒性，并在可行的情况下与社区合作，将运动的法律风险降至最低。在UCOC的这两个阶段完成并开始运作之前，社区工作人员参与的中期审查程序将生效。在此过渡期内，董事会的产品委员会还将为信安安全团队提供建议。\n为此，董事会进一步指示基金会与社区合作，在信托与安全能力方面进行更多投资，包括但不限于：开发协助我们的志愿者和工作人员所需的工具，开展研究以支持基于数据的决策，制定衡量成功的明确标准，开发培训工具和材料(包括建设社区关于骚扰意识和解决冲突的能力)，与有关骚扰、社区健康和儿童权利的国际专家进行磋商，以及增聘员工。\n上述努力将与整个运动中的适当合作伙伴协调和协作进行，寻求加强对行为和行为标准的有效社区治理，并减少基金会采取行动的长期需要。董事会和基金会的共同目标是，这些努力推动可持续的维基媒体运动和支持，而不是取代有效的社区治理模式。\n我们敦促维基媒体社区的每一个成员以一种树立开放和包容的维基媒体价值观的方式进行合作，挺身而出，为所有人创造一个安全和欢迎的文化，停止敌对和有毒的行为，支持成为此类行为目标的人，帮助善意的人学习做出贡献，并帮助对所有贡献者设定明确的期望。\n昨天，维基媒体基金会宣布了董事会的新成员和领导任命。沙尼·埃文斯坦·西加洛夫(Shani Evenstein Sigalov)目前是特拉维夫大学医学院的EdTech创新策略师和讲师，他将成为董事会的最新成员。娜塔莉亚·廷科夫将开始她在…董事会的第二个任期。。\n多读。\n总部位于纽约市的管理咨询公司道德风险投资公司(Ethical Ventures)的执行合伙人丽莎·勒温(Lisa Lewin)将成为维基媒体基金会董事会的最新成员。维基媒体基金会的董事会监督维基媒体基金会及其工作，是该组织的最终企业权威。作为即将上任的受托人，丽莎将为…服务。。\n多读。\n作为一家非营利性组织，维基百科和我们的相关免费知识项目主要由捐款提供支持。\n现在捐赠。\n电子邮件地址此邮件列表由MailChimp提供支持。维基媒体基金会将根据本网站的隐私政策处理您的个人信息。\n维基媒体基金会，Inc.是一个非营利性慈善组织，致力于鼓励免费、多语言内容的增长、开发和分发，并免费向公众提供这些基于维基的项目的全部内容。\n除非另有说明，本网站的内容受知识共享署名-共享类似3.0未移植许可的许可。", "note_en": "Today, the Wikimedia Foundation Board of Trustees voted to ratify new trust and safety standards for Wikipedia and all other Wikimedia projects. The standards, as outlined in a new Community Culture Statement, provide direction and priority to address harassment and incivility within the Wikimedia movement and create welcoming, inclusive, harassment-free spaces in which people can contribute productively and debate constructively.\n  Developing and introducing, in close consultation with volunteer contributor communities, a universal code of conduct that will be a binding minimum set of standards across all Wikimedia projects;\n Taking actions to ban, sanction, or otherwise limit the access of Wikimedia movement participants who do not comply with these policies and the Terms of Use;\n Working with community functionaries to create and refine a retroactive review process for cases brought by involved parties, excluding those cases which pose legal or other severe risks; and\n Significantly increasing support for and collaboration with community functionaries primarily enforcing such compliance in a way that prioritizes the personal safety of these functionaries.\n  The Board’s statement formalizes years’ of longstanding efforts by individual volunteers, Wikimedia affiliates, Foundation staff, and others to stop harassment and promote inclusivity on Wikimedia projects.\n   Harassment, toxic behavior, and incivility in the Wikimedia movement are contrary to our shared values and detrimental to our vision and mission. They negatively impact our ability to collect, share, and disseminate free knowledge, harm the immediate well-being of individual Wikimedians, and threaten the long-term health and success of the Wikimedia projects. The Board does not believe we have made enough progress toward creating welcoming, inclusive, harassment-free spaces in which people can contribute productively and debate constructively.\n In recognition of the urgency of these issues, the Board is directing the Wikimedia Foundation to directly improve the situation in collaboration with our communities. This should include developing sustainable practices and tools that eliminate harassment, toxicity, and incivility, promote inclusivity, cultivate respectful discourse, reduce harms to participants, protect the projects from disinformation and bad actors, and promote trust in our projects.\n  Develop and introduce a universal code of conduct (UCoC) that will be a binding minimum set of standards across all Wikimedia projects. The first phase, covering policies for in-person and virtual events, technical spaces, and all Wikimedia projects and wikis, and developed in collaboration with the international Wikimedia communities, will be presented to the Board for ratification by August 30, 2020.\n The second phase, outlining clear enforcement pathways, and refined with broad input from the Wikimedia communities, will be presented to the Board for ratification by the end of 2020;\n Take actions to ban, sanction, or otherwise limit the access of Wikimedia movement participants who do not comply with these policies and the Terms of Use;\n Work with community functionaries to create and refine a retroactive review process for cases brought by involved parties, excluding those cases which pose legal or other severe risks; and\n Significantly increase support for and collaboration with community functionaries primarily enforcing such compliance in a way that prioritizes the personal safety of these functionaries.\n  Until such directives are implemented, the Board instructs the Foundation to adopt and implement policies for reducing harassment and toxicity on our projects and minimizing legal risks for the movement, in collaboration with communities whenever practicable. Until these two phases of the UCoC are complete and operational an interim review process involving community functionaries will be in effect. In this interim period, the Product Committee of the Board of Trustees will also advise the Trust &amp; Safety team.\n To that end, the Board further directs the Foundation, in collaboration with the communities, to make additional investments in Trust &amp; Safety capacity, including but not limited to: development of tools needed to assist our volunteers and staff, research to support data-informed decisions, development of clear metrics to measure success, development of training tools and materials (including building communities’ capacities around harassment awareness and conflict resolution), and consultations with international experts on harassment, community health and children’s rights, as well as additional hiring.\n The above efforts will be undertaken in coordination and collaboration with appropriate partners from across the movement, seek to increase effective community governance of conduct and behavioral standards, and reduce the long-term need of the Foundation to act. It is the shared goal of the Board and Foundation that these efforts advance a sustainable Wikimedia movement and support, rather than substitute, effective models of community governance.\n We urge every member of the Wikimedia communities to collaborate in a way that models the Wikimedia values of openness and inclusivity, step forward to do their part to create a safe and welcoming culture for all, stop hostile and toxic behavior, support people who have been targeted by such behavior, assist good-faith people learning to contribute, and help set clear expectations for all contributors.\n    Yesterday, the Wikimedia Foundation announced a new member and leadership appointments to its Board of Trustees. Shani Evenstein Sigalov, currently an EdTech Innovation Strategist and lecturer at the School of Medicine in Tel Aviv University, will be the newest member of the Board of Trustees. Nataliia Tymkiv will begin her second term on the Board….\n    Read more\n Lisa Lewin, Managing Partner at Ethical Ventures, a New York City based management consulting firm, will be the newest member of the Wikimedia Foundation’s Board of Trustees. The Wikimedia Foundation’s Board of Trustees oversees the Wikimedia Foundation and its work, and serves as the organization’s ultimate corporate authority. As an incoming trustee, Lisa will serve….\n    Read more\n As a nonprofit, Wikipedia and our related free knowledge projects are powered primarily through donations.\n   Donate now\n Email address    This mailing list is powered by MailChimp. The Wikimedia Foundation will handle your personal information in accordance with this site&#39;s privacy policy.\n  The Wikimedia Foundation, Inc is a nonprofit charitable organization dedicated to encouraging the growth, development and distribution of free, multilingual content, and to providing the full content of these wiki-based projects to the public free of charge.\n  Except where otherwise noted, the content of this site is licensed under a  Creative Commons Attribution-ShareAlike 3.0 Unported license.", "posttime": "2020-05-26 05:41:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "解决,enacts,董事会", "title": "维基媒体颁布新标准解决骚扰问题并促进包容性", "title_en": "Wikimedia enacts new standards to address harassment and promote inclusivity", "transed": 1, "url": "https://wikimediafoundation.org/news/2020/05/22/wikimedia-foundation-board-announces-community-culture-statement/", "via": "", "real_tags": ["解决", "enacts", "董事会"]}, {"category": "", "categoryclass": "", "imagename": "5798a0a16208324266d8e4f82b03b719.jpeg", "infoid": 1003727, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当珍妮特·门德斯第一次离开呼吸机时，她根本不知道自己是谁。\n“(医院工作人员)一直叫我玛丽亚，”她告诉“每日野兽报”。“我说，好吧，那是我的名字。”\n除了，当然不是。玛丽亚是她的母亲，自从她33岁的女儿感染冠状病毒住院以来，她每天都在焦急地打电话给曼哈顿上城的西奈山。在路上的某个地方，工作人员把门德斯的身份证弄错了--也许他们根本没给过她--把她的名字和她母亲的弄混了。在重症监护病房待了10天后，门德斯太困惑了，无法改正。\n门德斯是幸运者之一-少数需要机械呼吸的新型冠状病毒患者中的一部分，他们仍然活着离开了医院。她恢复得很快，一位西奈山的医生形容她是“成功的”。但对于许多像她这样的患者来说，走出ICU只是战斗的一半。\n西奈山的重症监护医生梅克莱亚·伊门(Mekeleya Yimen)告诉“每日野兽报”(Daily Beast)：“现在还活着，你的生活正在回归正常。”“这并不总是可能的。”\n几十年的研究表明，许多病情最严重的ICU患者将永远不会回到以前的自己。一种名为重症监护后综合征(PICS)的疾病会导致高达80%的重症监护幸存者出现认知、身体和心理问题。大约三分之一的人永远不会回来工作。\n现在，医生们表示，他们在冠状病毒幸存者身上看到了许多这样的影响，规模之大前所未见。一些人不确定我们是否准备好应对这场危机将带来的ICU幸存者的涌入。\n西奈山康复部门副主席米格尔·埃斯卡隆(Miguel Escalón)表示：“我相信，我的每一个部位都感受到了这一点，就像医院床位需求激增一样，康复床位的需求也将激增。”“问题是，系统将如何应对这一点？”\n在预计将感染冠状病毒的数十万美国人中，一小部分人将需要住院治疗。需要在ICU接受护理的比例甚至更低-通常是因为一种名为急性呼吸窘迫综合征(ARDS)的肺部疾病。他们中的许多人将需要称为呼吸机的机械呼吸装置来维持他们的生命。\n门德斯从呼吸机上感觉到的混乱对于长时间停留在ICU的患者来说是很常见的-如此普遍，以至于有一个名字：“ICU精神错乱”。危重疾病对身体的极度压力，再加上镇静剂和ICU的异国环境，让很多人感到困惑和迷失方向，偶尔还会被从未发生的事情的记忆所困扰。\n门德斯说，她在呼吸机上花了10天的时间，以为自己是Netflix节目“我的街区”中的一个角色。她在“节目”中想象的功绩感觉是真实的，但现实生活中发生的一切都像梦一样。当她终于苏醒过来时，医院的侧翼已经挂满了圣诞装饰品。她以为自己昏迷了将近一年，直到护士告诉她他们只是愚人节恶作剧。\n根据重症监护医学会的数据，30%到80%的ICU幸存者在入住后患有某种认知障碍。出院一年后，三分之一的患者的认知测试分数与遭受创伤性脑损伤(如车祸)的人一致。四分之一的人考试成绩在轻度阿尔茨海默氏症的范围内。\n其他人将遭受持久的心理健康影响。几乎三分之一的ICU幸存者表现出临床上重要的抑郁症症状，四分之一的人表现出创伤后应激障碍的迹象-噩梦、闪回，害怕回到医生那里。对ARDS幸存者的一项研究发现，三分之一的人永远无法重返工作岗位。\n约翰·霍普金斯医院重症监护和康复项目的医疗主任戴尔·李约瑟(Dale Needham)说：“我们谈论的是身体、认知和心理健康，但当你谈到不重返工作岗位和失去的收入时，这对每个人来说都变得非常可以理解。”“这不仅对患者，而且对他们的整个家庭都产生了深远的影响。”\n虽然现在知道冠状病毒对幸存者的持久影响还为时过早，但医生告诉每日野兽，这些患者醒来时经常感到困惑和迷失方向，不知道他们发生了什么。纽约伯克医院(Burke Hospital)的康复医生本杰明·塞德尔(Benjamin Seidel)说，他的一些患者的MRI结果与入院时有明显不同。\n科罗拉多大学医院(University Of Colorado Hospital)的住院急性物理治疗师凯尔·里奇韦(Kyle Ridgeway)说：“我们看到的一些COVID患者，如果我让我的神经学专家治疗师对他们进行评估，他们会说，‘这个人一定是脑损伤。’”对于那些已经在重症监护病房呆了几周的人，他说，“对他们来说，这将是一个改变人生的情况。”\n一般来说，损害的程度取决于患者在进入ICU之前的健康状况，以及他们必须在那里呆多长时间。但根据密歇根大学康复医生肖恩·史密斯(Sean Smith)的说法，一些没有进入ICU的冠状病毒患者仍然表现出严重的精神痛苦迹象。\n他说：“这些病人中的许多人精神上都受到了相当大的震动。”“我认为(最重要的)所有这一切都将成为急诊室和ICU中的患者和医生的创伤后应激障碍的一些因素。”\n对于门德斯来说，幸好认知问题很快就结束了。她是土生土长的纽约人，她说当有人提醒她在哪条街时，她就想起了自己的名字。“他们一告诉我是114街，我就说，‘嘿，我离房子很近了！’”她回忆道。后来，她自娱自乐，通过数、乘、分床上的天花板瓷砖来保持敏锐。\n但恢复她的身体方位则是另一回事。门德斯以前是一个健康的33岁的人，当她第一次醒来时，她甚至不能自己坐起来。她的第一个任务-从床上搬到椅子上-让她感到头晕，需要戴氧气面罩。她花了四天的时间才鼓足力气自己走到洗手间；即使这样，她自己也用不了。她第一次试着睡了三个小时。\n这一经历追踪了许多医生在ICU后冠状病毒患者身上看到的情况。每一位接受“每日野兽”采访的医生都表示，他们的病人表现出明显的肌肉萎缩、肺活量下降和耐力下降。一些最严重的患者遭受了一种暂时性的瘫痪，称为手、脚或四肢的神经病变。\n里奇韦说，与其他ARDS幸存者相比，冠状病毒患者给他留下深刻印象的是他们极度疲惫。他的一些肌肉发达的病人仍然挣扎着站立超过30秒而不感到疲惫。\n他说：“他们中有相当一部分人真的感觉到--即使他们的氧气是稳定的--他们只是觉得呼吸非常急促，特别是当他们试图用力的时候。”“而对于这些患者中的一些人来说，‘努力锻炼’就是坐在床边。”\n虽然大多数需要康复的冠状病毒患者年龄较大，但里奇韦说，他曾治疗过三四十岁的患者，其中一些人在进入他的护理时无法行走。旧金山大学的重症监护理疗师海蒂·恩格尔(Heidi Engel)描述了一名50多岁的男子在积极的户外度假时感染了病毒。这名男子花了一周的时间重新学习如何走路-恩格尔称这一进展令人惊讶地快。\n对于这些患者中的许多人来说，突然醒来时发现自己的身体不能再做过去的事情，这会给他们带来心理负担。恩格尔说，她见过几个病人试图行走和摔倒，忘记了他们的腿不能支撑他们。\n“我花了很多时间向人们解释，‘你继承了这个新的身体，’”她说。“‘你是一个支离破碎的人，你现在需要开始把所有这些支离破碎的片段重新组合在一起。’”\n让这些患者重新回到一起是一件很难的事情，当他们紧跟在一种高度传染性的病毒之后时，更是难上加难。负责任的疾病预防需要限制与患者接触的人数，这意味着治疗师有时根本不会与患者一起进入房间。里奇韦说，他已经开始通过医院的窗户治疗一些病人，房间里有一名护士帮助病人移动。\n在伯克，塞德尔说，他们不再使用跑步机等与COVID阳性患者共享设备，而是使用任何可以留在患者房间的道具。当治疗师进入房间时，他们会穿上从头到脚的个人防护装备，这使得亲手治疗变得困难。“当你基本上穿着防护服时，做一些治疗就会变得有点困难，”他说。\n在疾病的中心纽约市的一些医院，住院康复楼层已经完全被重新用于冠状病毒患者的床位。在西奈山，康复医生正在以全科医生的身份巡视。在纽约大学朗格尼，一名康复医生表示，他将比他希望的更早将患者送回家，原因很简单，因为医院被认为不安全。\n这些限制让一些医生担心他们的病人将如何长期生存。\n密歇根大学的史密斯说：“重点已经从常规护理转移到紧急护理上，这意味着像物理治疗和康复这样的事情正在退居次要地位，这是理所当然的，变成了氧气状态之类的事情。”“但当你这样做的时候，你会受到伤害。有些病人是不会下床的。“。\n尽管如此，大多数医生都认为他们还没有看到危机最严重的时候。这将发生在住院人数激增趋于平缓，更多康复患者开始淹没康复中心和楼层之后。在纽约，住院人数在过去几天里有所下降，这可能会更早而不是更晚。\n该州的长期康复中心接收的患者已经准备好出院，但身体还不够强壮，无法回家，它们已经在与大医院一样的限制下苦苦挣扎。纽约大学朗格尼分校(NYU Langone)康复医生布莱恩·伊姆(Brian Im)表示，一些长期中心的个人防护装备有限，工作人员数量不到平时的一半，这让他在将患者送往哪里时三思而后行。\n他说：“你现在已经有了一个已经捉襟见肘的系统，已经缩减到更远的程度了。”“你可以看到，它的安全性和照顾病人的能力都受到了严重的限制。”\n与此同时，居家保健员不愿在家中探望前冠状病毒患者，许多门诊理疗诊所在可预见的未来都会关闭。即使在大流行结束后，全国家庭护理人员和理疗师的短缺也可能使治疗每一个需要帮助的人变得困难。\n在约翰·霍普金斯大学研究PICS多年的李约瑟说，这些工人中的许多人将不得不接受如何治疗危重疾病幸存者的培训，而不是他们习惯的心脏病发作或脑损伤的幸存者。\n“由于COVID，我们现在有大量的危重病人涌入，”他说。“我们需要考虑我们将要面对的求生浪潮.”\n门德斯似乎正在完全康复的路上。但在医院休养10天后，如果没有助行器，她仍然无法走动。医院不得不用救护车把她送回家，因为她走不动地铁楼梯。\n门德斯说，她计划在可以自己走路的时候回到多米尼斯担任办公室管理员，但不知道什么时候。\n“这对我的身体造成了伤害，”她在谈到病毒时说。“现在，我就像一个新生儿，想重新开始走路。”\n由于某些原因，门德斯仍然没有恢复她的味觉-对于一个热爱意大利食物的厨师的女儿来说，这是一颗苦果。她还在努力解决另一个问题：她的头发。在医院将近一个月没有洗澡后，她在家里花了两个小时才解开卷发。在这一点上，她正在考虑把这一切都砍掉，重新开始。\n不管怎样，我都在隔离中，“她说。“没人会看到我的。”", "note_en": "When Janet Mendez first got off the ventilator, she had no idea who she was.\n “[The hospital staff] kept calling me Maria,” she told The Daily Beast. “I said, OK, that’s my name.’”\n Except, of course, it wasn’t. Maria is her mother, who had been anxiously calling Mount Sinai in upper Manhattan every day since her 33-year-old daughter was hospitalized with COVID-19. Somewhere along the way, the staff had misplaced Mendez’s ID tag—maybe they’d never given her one at all—and mixed up her name with her mother’s. After 10 days in the intensive care unit, Mendez was too confused to correct them.\n Mendez is one of the lucky ones—part of the  minority of novel coronavirus patients who require mechanical breathing and still make it out of the hospital alive. She is recovering quickly, and one Mount Sinai doctor described her as a “success.” But for many patients like her, getting out of the ICU is only half the battle.\n “There’s surviving and there&#39;s returning to your normal life,” Mekeleya Yimen, a critical care physician at Mount Sinai, told The Daily Beast. “That’s not always possible.”\n  Decades of research shows many of the sickest ICU patients will never return to their former selves. An ailment called Post-Intensive Care Syndrome (PICS) causes cognitive, physical, and psychological problems in up to 80 percent of all critical-care survivors. About a third never return to work.\n Now physicians say they are witnessing many of these effects in COVID-19 survivors, at a scale they’ve never seen before. And some are not sure we’re ready for the influx of ICU survivors this crisis will bring.\n “I believe and I feel this with every part of me, that the same way there&#39;s been a surge in need for hospital beds, there&#39;s going to be a surge in need for rehab beds,” said Miguel Escalón, the vice chair of the rehabilitation department at Mount Sinai. “The question is, how will the system step up to meet this?”\n Of the hundreds of thousands of Americans projected to contract the coronavirus, a small percentage will require hospitalization. An even smaller percentage will require care in the ICU—often because of a lung condition called acute respiratory distress syndrome (ARDS). Many of them will require mechanical breathing devices called ventilators to keep them alive.\n   The confusion Mendez felt coming off of the ventilator is common for patients with extended ICU stays—so common it has a name: “ICU delirium.” The extreme stress of critical illness on the body, combined with the sedative drugs and the foreign surroundings of the ICU, leave many people feeling confused and disoriented, occasionally plagued by memories of things that never happened.\n Mendez says she spent 10 days on the ventilator thinking she was a character in the Netflix show  On My Block. Her imagined exploits on the “show” felt real, but everything happening in real life felt like a dream. When she finally came to, the hospital wing was covered in Christmas decorations. She assumed she’d been in a coma for almost a year, until a nurse told her they were only an April Fools prank.\n According to the Society of Critical Care Medicine, between 30 and 80 percent of ICU survivors struggle with some sort of cognitive impairment after their stay. A year after being released from the ICU, a third of patients have cognitive test scores  consistent with someone who suffered a traumatic brain injury, like a car crash. A quarter have test scores in the range of mild Alzheimer’s.\n Others will suffer from lasting mental health effects. Almost a third of all ICU survivors show clinically important symptoms of depression, and a quarter show signs of Post-Traumatic Stress Disorder—nightmares, flashbacks, fear of going back to the doctor. A study of ARDS survivors found that a third were never able to return to work.\n “We talk about physical cognitive and mental health, but it becomes very understandable to everyone when you talk about not returning to work and the lost income,” said Dale Needham, medical director of the critical care and rehabilitation program at Johns Hopkins Hospital. “The impact that this has not just on the patient but their entire family is profound.”\n   While it’s too early to know the lasting effects of COVID-19 on survivors, doctors told The Daily Beast these patients often awoke confused and disoriented, with no idea what happened to them. Benjamin Seidel, a rehabilitation physician at Burke Hospital in New York, said some of his patients had noticeably different MRI results compared to when they were admitted.\n &#34;Some of these COVID patients that we see, if I get my neurologic expert therapist to evaluate them, they say, ‘This person must have had a brain injury,’” said Kyle Ridgeway, an inpatient acute physical therapist at University of Colorado Hospital. For those who have been in the ICU for weeks, he said, “this is going to be a life-altering situation for them.”\n Generally, the level of impairment depends on how healthy the patient was before they entered the ICU and how long they had to stay there. But some coronavirus patients who were not admitted to the ICU still show signs of severe mental distress, according Sean Smith, a rehabilitation physician at the University of Michigan.\n “A lot of these patients are pretty mentally shaken up,” he said. “I think [overarching] all of this is going to be some element of PTSD for the patients—and for the doctors—who were in the emergency rooms and ICUs.”\n For Mendez, the cognitive issues ended mercifully fast. A born-and-bred New Yorker, she said she remembered her name as soon as someone reminded her what street she was on. “The minute they told me it was 114th, I said, ‘Hey I’m close to the house!’” she recalled. Later, she entertained herself and stayed sharp by counting, multiplying and dividing the ceiling tiles above her bed.\n  But regaining her physical bearings was another story. A formerly healthy 33-year-old, Mendez could not even sit up on her own when she first woke up. Her first task—moving from her bed to a chair—made her feel dizzy and required an oxygen mask. It took her four days to muster the strength to walk to the bathroom on her own; even then, using it on her own was beyond her ability. She took a three-hour nap the first time she tried.\n  The experience tracks with what many physicians have seen in their post-ICU coronavirus patients. Every doctor who spoke with The Daily Beast said their patients showed significant muscle loss, reduced lung capacity, and decreased endurance. Some of the most severe patients suffered a temporary paralysis called neuropathy in their hands, feet or limbs.\n Ridgeway said what struck him about COVID-19 patients compared to other ARDS survivors was their profound exhaustion. Some of his more muscular patients still struggled to stand for more than 30 seconds without getting fatigued.\n “Not an insignificant proportion of them really do feel—even if their oxygen is stable—they just feel profoundly short of breath, especially if they&#39;re trying to exert,” he said. “And for some of these patients, ‘trying to exert’ is sitting up to the side of the bed.”\n While most of the coronavirus patients who require rehabilitation are older, Ridgeway said he had treated patients in their thirties and forties, some of whom were unable to walk when they entered his care. Heidi Engel, an intensive care physical therapist at the University of San Francisco, described a man in his fifties who caught the virus while on an active outdoors vacation. It took the man a week to relearn how to walk—a progression Engel described as surprisingly fast.\n  For many of these patients, there is a psychological burden in suddenly waking up with a body that cannot do what it used to. Engel said she’d seen several patients try to walk and fall, forgetting that their legs could not support them.\n “I spend a lot of time explaining to people, ‘You have this new body you’re inheriting,’” she said. “‘You’re a fragmented person, and you need to now start to bring all these fragmented pieces back together.’”\n  Bringing these patients back together is hard to begin with, and even harder when they’re on the heels of a highly contagious virus. Responsible disease prevention requires limiting how many people are exposed to the patient, meaning therapists sometimes don’t get in the room with their patients at all. Ridgeway said he’d started treating some patients through a window in the hospital, with a nurse inside the room to help the patient move.\n At Burke, Seidel said they are no longer using shared equipment like treadmills with COVID-positive patients, instead making due with whatever props can be left in the patient&#39;s room. When a therapist does make it into the room, they are decked out in head-to-toe personal protective equipment, which makes hands-on treatment difficult. “When you’re basically wearing a hazmat suit it becomes a little more difficult to do some of the therapies,” he said.\n At some hospitals in New York City, the epicenter of the disease, inpatient rehab floors have been entirely repurposed into beds for coronavirus patients. At Mount Sinai, rehabilitation doctors are making rounds as general medicine doctors. And at NYU Langone, a rehab physician said he was sending patients home sooner than he’d like, simply because the hospital was not considered safe.\n  The constraints left a number of doctors worried about how their patients would fare long-term.\n “The focus has shifted from usual care to emergency care, meaning things like physical therapy and rehabilitation are taking a back seat, rightfully so, to oxygen status and things like that,” said Smith from the University of Michigan. “But you suffer when you do that. There are patients that aren’t going to get out of bed.”\n Still, most of the doctors agreed they hadn&#39;t seen the worst of the crisis yet. That will come after the surge in hospitalizations has flattened, and more recovered patients start flooding rehabilitation centers and floors. In New York, where hospitalizations have fallen in the last few days, that could be coming sooner rather than later.\n Long-term rehabilitation centers in the state, which take patients who are ready to leave the hospital but not strong enough to go home, are already struggling with the same constraints as major hospitals. Brian Im, a rehabilitation doctor at NYU Langone, said some long-term centers are running with limited personal protective gear and less than half the usual number of staff, making him think twice about where to send his patients.\n “You have an already stretched-thin system now reduced beyond that,” he said. “You can just see the safety and the ability to care for patients is severely limited.”\n At the same time, home health aides are reluctant to visit former coronavirus patients in their houses, and many outpatient physical therapy clinics are closed for the foreseeable future. Even after the pandemic ends, the national shortage in home-care workers and physical therapists could make it difficult to treat everyone who needs help.\n   Needham, who has studied PICS for years at Johns Hopkins, said many of these workers will have to be trained in how to treat critical illness survivors, rather than the survivors of heart attacks or brain injuries they are used to.\n “Because of COVID, we now have this massive influx of critically ill patients,” he said. “We need to think about the survivorship wave we’re going to face.”\n Mendez appears to be on her way to a full recovery. But after 10 days of recuperation in the hospital, she still cannot get around without a walker. The hospital had to send her home in an ambulance because she couldn’t manage the subway stairs.\n Mendez said she  plans to return to work as an office administrator at Dominos when she can walk on her own, but doesn’t know when that will be.\n “It took a toll on my body,” she said of the virus. “Right now, I&#39;m like a newborn trying to walk again.”\n  For some reason, Mendez still hasn’t regained her sense of taste—a bitter pill for the daughter of a chef, who has a passion for Italian food. She’s also struggling with another problem: her hair. After nearly a month of not showering in the hospital, it took her two hours at home to get knots out of her curls. At this point, she’s thinking of cutting it all off and starting again.\n &#34;I&#39;m in quarantine anyway,” she said. “Nobody’s going to see me.”", "posttime": "2020-05-26 05:40:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,app,冠状病毒,coronavirus,噩梦", "title": "下一个冠状病毒噩梦是在ICU之后发生的", "title_en": "The Next Coronavirus Nightmare Is What Happens After the ICU", "transed": 1, "url": "https://www.thedailybeast.com/the-next-coronavirus-nightmare-is-what-happens-after-the-icu", "via": "", "real_tags": ["病毒", "app", "冠状病毒", "噩梦"]}]