[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1000533, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Horizon EDA是一款用于印刷电路板设计的电子设计自动化软件包。借助Horizon EDA，您可以：\n\nHorizon EDA是免费和开源的，构建在现代的、无遗留的代码库之上，运行在Linux和Windows上。", "note_en": "Horizon EDA is an  Electronic Design Automation package for printed circuit board design. With Horizon EDA you can:\n  \n  Horizon EDA is free and open source, built on a modern and legacy-free codebase and runs on Linux and Windows.", "posttime": "2020-05-04 06:21:48", "tags": "免费,软件,开源,设计,free", "title": "Horizon-一个免费开源的电子PCB设计软件包", "title_en": "Horizon – a free and open source electronic PCB design package", "transed": 1, "url": "https://horizon-eda.org/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["免费", "软件", "开源", "设计", "free"]}, {"category": "", "categoryclass": "", "imagename": "e1c493c1e735a91d5e987eb276acdf14.jpg", "infoid": 1000532, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "中断、衰退和衰退使弱者更弱，强者更强。几个世纪前是这样，今天也是这样。\n2001年的经济低迷将电信和有线电视巨头变成了互联网的守门人。微软凭借其IE浏览器大获全胜。在2008年金融危机期间，当现金为王时，大银行-例如摩根大通(JP Morgan Chase)-变得更加突出和普遍。以类似的方式，目前的大流行正在让大型科技公司变得更大。这不仅仅是因为他们的金库满了。他们突然有了更多、更容易接受的观众。\n上周，我们看到了亚马逊、苹果、微软、谷歌和Facebook的中期疫情报告创纪录的结果。剧透提醒：他们并不是真的在受苦。微软本季度的收入增至350亿美元，而2019年同期为305亿美元。亚马逊的收入超过750亿美元。即使关闭，苹果也公布了580亿美元的收益。你明白我的意思了。\n即使在未来一年左右经济状况恶化的情况下，这些公司也可能成为大赢家。然而，结果不仅仅是少数几家公司将成为我们生活中更重要的存在。一般说来，这将适用于技术。当然，可能会有一些公司-例如Airbnb-在短期内受到影响。创业生态系统可能会收缩。但总体而言，这是一个重要的技术时刻，而且只会变得更大。\n如果你活得足够长，你就会经历足够多的低迷，从而至少发展出两种疾病中的一种：精神弹性或创伤后应激障碍。我现在至少需要两只手才能用手指数出我经历过的经济低迷的次数。这些经历在很大程度上支持了我对网络的力量和技术的必然性的盲目信念。这一次也不例外。\n在过去的几个月里，我们经历了以前被认为处于边缘的科技行为的主流。例如，在网上购买食品杂货并让人送货是一种沿海奢侈品。现在，它已经被全国数百万人体验和使用。Insta吹嘘说将再招聘25万名购物者。亚马逊正在额外招聘17.5万名送货人员。食品点播服务正在经历一场前所未有的繁荣-DoorDash…。\n在本周的一次谈话中，“连线”编辑尼古拉斯·汤普森惊叹于远程医疗和在线教育的增长，这两项技术(因为没有更好的术语)已经存在了很长时间，以至于我们经常忽视它们。可汗学院的注册人数是现在的20倍。硅谷投资者将远程工作和分布式公司视为净负面因素，并惩罚那些在自家后院没有实体存在的公司，现在他们成了“在家工作”的大师。\nZoom每天有3亿名参与者(这与用户不同)，而Slake的同步连接用户高达1000万。微软的松弛竞争对手Teams现在拥有超过7500万的日活跃用户。无论如何，大多数公司现在都经历了“在家工作”，他们不太可能只是回到原来的方式。一旦我们习惯了新的行为，我们就很难回去了。\n在技术在日常生活中如此普及之前，它对企业、教育机构和政府来说都是一种奢侈品。服务器、交换机、大型数据库和生产力软件对我们大多数人没有太大影响。个人电脑很棒，但最高峰时只卖出了1亿台，其中很大一部分卖给了上面提到的买家。互联网改变了这一切。技术变成了我们，我们变成了技术。如果有什么不同的话，..。\n正如过去20年来，大公司预期的生产率提高在中型企业中变得司空见惯一样，我们已经看到技术便利性的下降。对公司和组织来说是“生产力”的东西，对我们普通人来说已经变成了“便利”。\n本世纪初的经济低迷见证了宽带连接的出现及其普及。七年后，我们都拥抱了社交网络，然后是移动和应用程序革命。随着大流行肆虐我们的社会结构，我们正在看到一场大规模的数字化转型，在压缩的时间框架内。每一次经济挫折都会产生对便利的渴望，从长远来看，这为技术的广泛采用打开了大门。\n不管我们喜不喜欢，我们现在已经沉迷其中了。我们喜欢在我们想看电影和电视节目的时候，在我们想看的地方，在我们想看的屏幕上看电影和电视节目。我们喜欢订食物和杂货，而且要送货。具有讽刺意味的是，以消费者为中心的服务比接受速度较慢的企业为未来做好了更充分的准备", "note_en": "Disruptions, downturns, and recessions make the weak weaker and the strong stronger. It was true centuries ago, and it is true today.\n The 2001 downturn turned telecom and cable giants into the Internet’s gatekeepers. Microsoft emerged victorious with its Internet Explorer. During the 2008 financial crisis, when cash was king, the big banks — JP Morgan Chase, for example — became more prominent and more pervasive. In a similar fashion, the present pandemic is making big tech bigger. And it is not just that their coffers are overflowing coffers. They suddenly have a much larger and more receptive audience.\n Last week, we saw the mid-pandemic report record results for Amazon, Apple, Microsoft, Google, and Facebook. Spoiler alert: they’re not exactly suffering. Microsoft saw its revenues go up to $35 billion for the quarter, compared to $30.5 billion for the same quarter in 2019. Amazon’s revenues came in over $75 billion. Even with a shutdown, Apple reported earnings of $58 billion. You get the drift.\n Even with worsening economic conditions over the next year or so, these companies are likely to come out big winners. Though, the upshot is not just that a handful of companies will become a more significant presence in our lives. This will be true of technology in general. Sure, there might be some companies — AirBnB, for example —that suffer in the near term. The startup ecosystem might contract. But overall, this is a big moment for technology, and it’s only going to get bigger.\n If you live long enough, you experience enough downturns to develop at least one of two things: mental resilience or post-traumatic stress disorder. I now need at least two hands to count on my fingers the number of downturns I have experienced. These experiences have largely supported my blind faith in the power of the network and the inevitability of technology. This time around is no different.\n Over the past few months, we have experienced the mainstreaming of technology-enabled behavior previously thought of as being on the fringe. Shopping for groceries online and having them delivered, for example, was something of coastal luxury. Now, it has been experienced and used by millions across the country. Instacart has boasted of hiring another 250,000 shoppers. Amazon is hiring an additional 175,000 delivery people. Food-on-demand services are going through a boom like none other —Doordash  ...\n In a conversation this week, Wired editor Nicholas Thompson marveled at the growth in telemedicine and online education, two technologies (for lack of a better term) that have been around for so long that we often overlook them. Khan Academy has seen 20 times as many registrations. The Silicon Valley investors who viewed remote work and the distributed company as a net negative, and penalized companies that didn’t have a physical presence in their backyard, are now “work from home” gurus.\n Zoom has 300 million daily participants (which is not the same as users), while Slack has seen as many as 10 million simultaneously connected users. Microsoft’s Slack competitor, Teams, now has more than 75 million daily active users. No matter what, most companies have now experienced “working from home,” and they are unlikely to just return to their old ways. Once we get accustomed to new behaviors, it is hard for us to go back\n Before technology became so pervasive in the lives of everyday people, it was a luxury for corporations, educational institutions, and governments. Servers, switches, big databases, and productivity software didn ’t impact most of us very much. The personal computers were great, but they only sold a mere hundred million units at their peak, and a big chunk of those went to the buyers mentioned above. The Internet changed all that. Technology became us, and we became technology. If anything,  ...\n Just as the productivity gains that were expected of big companies became commonplace in mid-sized operations over the past two decades, we have seen the convenience-of-technology flow downwards. What was “productivity” for corporations and organizations has morphed into “convenience” for us normals.\n The economic downturn at the beginning of the millennium saw the emergence of broadband connectivity and its pervasiveness. Seven years later, we all embraced the social web, and then the mobile and app revolution. And as the pandemic ravages our social fabric, we are seeing a wholesale digital transformation in a compressed time frame. Each economic setback creates a craving for convenience, and in the long-term, this opens the door for the widespread adoption of technology.\n Whether we like it or not, we are addicted to it now. We like being able to watch movies and television shows when we want, where we want, and on the screen we want. We love ordering food and groceries and want them delivered. Ironically, the consumer-focused services have been much more prepared for the future than the enterprises, which have been slower in embracing the significant shift to cloud, data, and automation.\n But not anymore! Kicking and screaming, they have been brought into the future. “We have seen two years’ worth of digital transformation in two months,” noted Microsoft CEO Satya Nadella in a call with Wall Street analysts after reporting earnings that were just shy of astounding. Box CEO Aaron Levie noted that “years of IT acceleration being compressed into months.”\n Levie also quipped that he had spoken to “multiple Fortune 500 CIOs in the past two days who have been implementing a fundamentally different IT strategy than they would have had a year ago. ”They are all thinking more cloud, more digital, and more automation. Others have observed this shift in perspective. In a call with investors, ServiceNow CEO Bill McDermott noted that the pandemic has been an accelerant for digital transformation, which has now become a business imperative. ServiceNow  ...\n   fOMo aggregates my latest blog posts, essays, and handpicked recommendations and zips them to your inbox. I respect your time and attention, so only when I find stuff that is worth sharing will fOMo take up space in your inbox. And that is why I don’t have a set frequency — just a promise that I won’t be wasting your time.", "posttime": "2020-05-04 06:21:36", "tags": "app,不可避免,malik,technology", "title": "奥姆·马利克：不可避免的事情已经发生了", "title_en": "Om Malik: The Inevitable Has Happened", "transed": 1, "url": "https://om.co/2020/05/03/the-inevitable-has-happened/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["app", "不可避免", "malik"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000530, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "要继续，请单击下面的框，让我们知道您不是机器人。\n请确保您的浏览器支持JavaScript和Cookie，并且您没有阻止它们加载。有关更多信息，您可以查看我们的和。", "note_en": "To continue, please click the box below to let us know you&#39;re not a robot.\n  Please make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our   and  .", "posttime": "2020-05-04 05:59:30", "tags": "股市,stocks,click", "title": "沙特股市暴跌10%，沙特部长警告未来将采取“痛苦的”措施", "title_en": "Saudi Stocks Slump 10% as Minister Warns of ‘Painful’ Measures Ahead", "transed": 1, "url": "https://www.bloomberg.com/news/articles/2020-05-03/saudi-stocks-slump-as-minister-warns-of-painful-measures-ahead", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["股市", "stocks", "click"]}, {"category": "", "categoryclass": "", "imagename": "18b1ee761e444af3614bef44e30b0dad.png", "infoid": 1000529, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为一名创始人，总有一天你需要一份商业计划，包括财务预测、损益表和能给投资者留下深刻印象的花哨图表。\n财务模型允许您以专业的方式轻松、快速地起草财务预测。一个好的模板还会迫使你考虑项目的方方面面，并确保你真正理解了你的业务背后的财务逻辑。\n这篇文章比较了SaaS初创公司财务模式的前12个模板。我亲自测试了每一种型号。我已经在5个类别的40多个项目上对他们进行了排名。我看过电子表格和SaaS应用程序，以及免费和付费的解决方案。\n我比较了5个类别的40点：(A)财务报表，(B)分析能力，(C)收入建模，(D)成本建模，(E)额外功能。下面提供了对每种型号的详细分析。在每种情况下，我都亲自测试了软件/电子表格。\n时间尺度：报表是否超过1年、3年或更长时间？当你与专业投资者交谈时，你通常希望至少有3年的工作时间。\n损益表：模板是否包括损益表？你通常想要一份月度损益表，至少在第一年是这样。\n财务分析：典型财务指标的数量，例如盈亏平衡点、速动比率、平均库存等。\nSaaS分析：包括的典型SaaS指标数量，例如MRR增长、SaaS幻数、CAC/LTV等。\n按损益表类别划分的成本：模板是否将成本分解为损益表类别(齿轮、研发、G&A；A等)。\n按部门划分的成本：模型是否将成本细分为部门(销售、营销、CS、工程等)。\nVS实际值：模板是否允许您根据实际数字运行您的模型？\n新客户获取：如何将新客户输入到模型中？可能的情况包括：手动输入每个月或一年的数字(这很糟糕)；根据基数和增长率自动填充模型(糟糕透顶)；自动填充多个流-每个流代表不同类型的客户端，例如SMB/企业(更好)；甚至对每个采集渠道进行完全建模(最好的，非常罕见)。\n产品：您可以定义多少个产品，您可以对它们建模的精确度有多高？这包括创建一次性优惠、重复优惠或组合的可能性，也包括为特定优惠创建介绍时间和结束时间的可能性。\n定价模型：您可以定义多少定价模型，以及定价模型的精确度：分层(免费、基本、高级)、收入模型(每个座位、每次使用等)，自动增加或降低计划的价格。\n服务收入：您能否在所有其他定价模式和产品之上建立准时服务收入的模型？\n特定于企业：模板是否提供特定功能来模拟复杂的企业销售，如落地/扩展、定制产品开发、各种销售周期等？\n直接人工成本：最好的模板允许您将直接人工成本与相关指标相关联。例如，您的销售人员是根据每位客户主管的预测收入和销售目标计算的。客户成功工资单与每个CS员工的客户数量和工作量目标相同。\n直接非人工成本：就像人工成本一样，最好的模板允许您将一些直接非人工成本与相关指标联系起来。例如，服务器成本可以是MRR的1%。\n间接人工成本：同上。即使是间接成本，一些模板也会找到聪明的方法将它们与业务的某些方面捆绑在一起。\n付款条件：您能与您的供应商和供应商定义付款条件吗？如果您的报价包含硬件组件，则可能会很有用。\n硬件友好：这是对运输成本、库存延迟等进行建模的模板的特别说明。\n文档：模型中和网站上是否有适当的文档？有好的解说员视频吗？模板附带哪种直接支持(聊天、电子邮件)？\n第三方集成：第三方集成可用于随着时间的推移输入或更新数据，或显示高级图形。\nExcel电子表格：您能以Microsoft Excel电子表格的形式访问您的财务数据吗？如果你需要与投资者分享，这是必须的。\nGoogle Sheets：该模型在Google Sheets中可以使用吗？并不是所有在Microsoft Excel中工作的模型都能在Google中工作，所以您可能需要考虑这一点。\n可编辑公式：一些模板不允许您修改公式--这在自定义方面是一个巨大的障碍。\n诚然，这并不是一个完美的方法论。人们可能会永远争论是否应该将上限表包括在初创企业的财务模型中。但这是我能想到的最好的办法了--我自己也不是个金融书呆子。)。\n隶属关系：文章中的一些链接是附属的-这意味着如果您最终通过其中一个链接购买了模板，我将", "note_en": "As a founder, there comes a time when you need a business plan, complete with financial forecasts, income statements, and fancy graphs that will impress your investors.\n  A financial model allows you to draft financial projections easily, fast, and in a professional manner. A great template will also force you to think through all the aspects of your project and make sure you really get the financial logic behind your business.\n  This post compares the top 12 templates of financial models for SaaS startups. I have personally tested each model. I have ranked them on 40+ items along 5 categories. I&#39;ve looked at both spreadsheets and SaaS apps, and both free and paid solutions.\n         I compared 40 points across 5 categories: (a) financial statements, (b) analysis capabilities, (c) revenue modeling, (d) cost modeling, (e) extra features. A detailed analysis of each model is available below. In each case, I tested the software/spreadsheet myself.\n  Time scale: Are the statements over 1 year, 3 years or more? You usually want 3 years as a minimum when you speak with professional investors.\n  Income statement: Does the template include an income statement? You usually want a monthly income statement, at least for year 1.\n  Financial analysis: Number of typical financial metrics included e.g. breakeven point, quick ratio, average inventory, etc.\n  SaaS analysis: Number of typical SaaS metrics included e.g. MRR growth, SaaS magic number, CAC/LTV, etc.\n    Costs by P&amp;L category: Does the template break down costs into P&amp;L categories (CoGS, RD, G&amp;A, etc.)\n  Costs by departments: Does the model break down costs into departments (sales, marketing, CS, engineering, etc)\n      VS Actuals: Does the template allow you to run your model versus your actual numbers?\n  New client acquisition: How do you enter new clients into the model? Possibilities include: entering a number manually for each month or year (it sucks); autofill the model from a base number and a growth rate (sucks a bit less); autofill several streams - each stream represents a different type of client e.g SMB/enterprise (better); or even fully model each acquisition channel (the best, very rare)\n  Offerings: How many offers can you define and how precisely can you model them? This includes the possibility to create one-off offers, recurring offers, or a combo, but also the possibility to create introduction times and end times for specific offers.\n  Pricing model: How many pricing models can you define and how precisely: tiers (free, basic, premium), revenue models (per seat, per usage, etc), automatically increase or decrease the plans price over years.\n      Service revenue: Can you model punctual service revenue on top of all the other pricing models and offerings?\n  Enterprise specific: Does the template offer specific features to model complex enterprise sales, such as landing/expansion, custom product developments, various sales cycles, etc?\n  Direct labor costs: The best templates allow you to correlate direct labor costs with relevant metrics. For example, your sales staff is calculated based on forecasted income and sales target per account executive. Same for customer success payroll with number of customers and workload target per CS staff.\n  Direct non-labor costs: just like with labor costs, the best templates allow you to link some direct non-labor costs with relevant metrics. For instance, server costs can be a % of MRR.\n  Indirect labor costs: same as above. Even for indirect costs, some templates find smart ways to tie them to some aspect of the business.\n    Payment terms: Can you define the payments terms with your vendors and suppliers? May be useful if there is a hardware component to your offer.\n  Hardware-friendly: This is a special mention for templates that model things like shipping costs, inventory delay, etc.\n  Documentation : Is there proper documentation in the model and on the website? Are there good explainer videos? What kind of direct support (chat, email) comes with the template?\n    Third-party integration: Third-party integrations can be useful to input or update data over time, or to display advanced graphs.\n  Excel spreadsheet: Can you access your financials as a Microsoft Excel spreadsheet? This is a must if you need to share it with investors.\n  Google Sheets: Does the model work in Google Sheets? Not all models that work in Microsoft Excel work in Google, so you may want to consider that point.\n  Editable formulas: Some templates do not allow you to modify formulas - which is a massive bummer when it comes to customization.\n Granted, it&#39;s not a perfect methodology. One could argue forever about whether cap tables should be included in a financial model for startups. But it&#39;s the best I could come up with - without being a finance nerd myself :)\n     Affiliation: Some links in the article are affiliated - which means that if you end up buying a template through one of those links, I&#39;ll get a few $$$. This doesn&#39;t cost you anything, and allows me to keep writing useful articles for you.\n  Impartiality: Regardless of whether there is a referral in place or not, I am committed to providing you with an honest opinion. I take great pride in being an independant, honest, and trusted source of information for entrepreneurs.\n  Non finito: This is a non-finite work. I am happy to update the article if you bring new, relevant information to my knowledge. I am also happy to fix any mistake or clarify any confusion that you may find in the article.\n     For years, this template has been the go-to financial model for French entrepreneurs. However, it didn&#39;t age well.\n Analysis capabilities are limited: only a handful of financial metrics, zero SaaS metrics, a couple of graphs, and it&#39;s impossible to categorize costs. Modeling, be it for revenue or costs, is all too basic and requires a lot of manual input. Also, it&#39;s entirely in French.\n Having said that, it remains a free-of-charge, easy-to-use, easy-to-customize template that covers all the basics while including specificities to the French ecosystem such as CIR, JEI, etc.\n This model makes a lot of sense for French entrepreneurs looking for a simple solution. For the others, keep on reading.\n        This template was built by SaaS apostle Christoph Janz, and you can tell. It packs a punch of SaaS knowledge in a sleek, clear spreadsheet. You&#39;ll find lots of good stuff: basic/pro/enterprise plans, churn/upgrade/downgrade, an elegant client acquisition model and a wealth of graphs and charts.\n It&#39;s not all rosy, though. You want a 5 years forecast? No, you only need 2. You want to sell annual pro plans? Too bad, pro plans are monthly and that&#39;s that. Also, no balance sheet.\n This template works great if you are a typical SaaS startup and fits the vision that Christoph put into his financial plan. If not, you may be better off considering templates with broader horizons.\n        This one got updated just before publishing the article, so I have to scratch my old review and write a new one. I&#39;ll take care of that soon enough.\n       This template published by Ben Murray, AKA the SaaS CFO, has a lot in common with Chris Janz&#39;s model: it&#39;s free, it&#39;s SaaS-centric and it&#39;s really good overall.\n  Cost modeling: Janz does a much better job as many costs are tied to activity metrics. With Murray, you have to fill it all manually. Janz 1 - 0 Murray\n  Commitment: Murray allows you to define which plans are annual and which are monthly. Janz does not. Janz 1 - 1 Murray\n  Client acquisition: Murray wants you to manually input new clients each month, where Janz includes 3 acquisition channels. Janz 2 - 1 Murray\n  Murray also allows you to add service revenue and offers up to 5 years of forecasts. Janz 2 - 2 Murray\n  Since its latest update, Murray&#39;s model also allows you to input your actual number and compare them with your forecasts. Janz 2 - 3 Murray\n At the end of the day, Murray&#39;s SaaS template is great - maybe the best amongst the free templates. It is a bit disappointing when it comes to modeling new client acquisition and costs, though.\n        Because you&#39;re paying, you obviously get a lot more in return: balance sheet, cap table, GAAP/IFRS compliance, 161 currencies to choose from, a ton of financial metrics and graphs, and advanced capabilities to model your costs and your revenue, including for hardware startups.\n Now, because we are paying, we are a lot pickier. And I see 3 problems with this SaaS Startup Kit. First, you cannot account for upgrades and downgrades (you can model churn, though). Second, you cannot break down costs by P&amp;L categories or departments. Third, the formulas are &#34;locked &#39; so you cannot edit them. That&#39;s a big problem if, like me, you like looking under the hood. But maybe you don&#39;t care?\n     All in all, I cannot tell you not to look at the SaaS startup kit. It has a lot going for it, and at $99, it&#39;s priced right. But if you can stretch your budget a little more, look at the next model - it may well be the right one.\n     Let me start right off the bat: this &#34;SaaS Financial Model&#34; by Taylor Davidson is one of the best templates out there.\n For $149, you get all the financial statements you may wish for, laid out over 5 years, and GAAP-compliant. Additional tabs are built-in for fundraising (assess needs and uses), valuation (ownership, DCF, waterfall exit, ROI), variants (simplified scenarios), and impact (for purpose-driven startups). Bonus point: the model works in Microsoft Excel and Google Sheets, supports all currencies, and is fully editable.\n In terms of analysis capabilities, the template generates boatloads of financial and SaaS metrics, as well as 20+ beautiful graphs. Costs can be broken down by departments and P&amp;L categories so you can make sense of all that good stuff. SaaS experts will especially appreciate the granularity provided by monthly cohort analysis - a rarity!\n Modeling revenue and costs is extremely versatile. Instead of pre-modeling everything for you, the template provides you with very unique features (Pricing, Pipeline, Drivers) that allow you to customize it to your needs. Here are a few examples of what you can do:\n Contract length is not limited to monthly or annual but can be anything you want.\n  Billings are separate from contract cycles, so can do an annual contract with quarterly billings, or 3-year contract with annual billings, or annual contract with monthly billings\n  All costs, direct and indirect, labor and non-labor, can be tied to relevant activity metrics (revenue, headcount, etc.) which is what you would expect from this kind of template.\n  All costs can also be tied that are *not* tied to an activity metric, say periodic costs that occur quarterly or annually, or costs that increase a % over time, or costs that are a % of salaries, or a % of revenues, for example. This is all built-in within the Drivers sheet and an absolute delight to use.\n  For Enterprise sales, you can model a good old Pipeline in the Pipeline sheet and attribute different numbers of seats and &#34;likelihood to close&#34; to each deal.\n True, it takes a bit of time to wrap your head around the internal logic of that model. But once you master it, there is virtually no limit to what you can do.\n Thankfully, this financial model is well-documented. The website includes a long, detailed &#34;Getting Started&#34; page as well as specific articles and videos for technical points. The highlight is definitely the email support - I&#39;ve consistently received detailed replies within 24 hours - at zero extra cost. Kudos to that.\n Long story short - if you are willing to shell out $149 for a SaaS financial model, Taylor Davidon&#39;s template is arguably one of the absolute best you can get your hands on. The other one is the model built by Alexander Jarvis - read on to learn about it.\n        It&#39;s hard to write a serious review about this template - everything about it is absolutely ridiculous. It is ridiculously rich, ridiculously detailed, ridiculously powerful. It&#39;s the kind of template that you use when you want to make a statement, like impress your investors or make your CFO feel irrelevant. It&#39;s heavy, bold, and over-the-top, in the best way possible. Brace yourselves, let&#39;s dive in.\n This template by Alexander Jarvis comes in 2 versions. The &#34;SaaS: SME &amp; Users&#34; is perfectly fine for most SaaS businesses. It sells at $319. The &#34;SaaS: Enterprise, SME &amp; Users&#34; retails at $1,299 and includes extra logic to model enterprise sales. Because of their complexity, both models only work in Microsoft Excel (no Google Sheets).\n  Each acquisition channel is modeled in great details: paid, organic, blog, social, emailing, and channel partners. Each channel can be assigned its own conversion rate from visitor to user. You can also differentiate between the customers that self-onboard and those who require sales intervention.\n  You can design composite offerings based on usage fee, monthly fee and/or a one-time service fee. The templates allow 3 paid plans - typically basic, premium, pro - as well as a free trial plan, and each of these plans can exist with a monthly or annual commitment.\n  Customers can upgrade, downgrade or churn, and you can even schedule module releases at different points in time, so you create new revenue streams over the years.\n  All costs, direct and indirect, labor and non-labor, are modeled in a clever way i.e. they are tied to relevant activity metrics\n I cannot stress enough how detailed this model is. Here is an example: the &#34;email marketing&#34; tab (yes, there is such a thing) takes into account 12+ inputs including stuff like the % of recipients who will share the newsletter with their friends. I love this kind of detail because it gives actionable points when thinking about execution. It also makes it easier to defend your numbers in front of investors because you can explain the underlying  ...\n If you buy the $1,299 version, you get an extra slew of tabs specifically dedicated to enterprise sales in all its complexity: enterprise-specific products and offerings, geographies, sales cycles, &#34;land and expand&#34;, custom development, etc. If you are building the next Oracle or Palantir, that stuff alone is invaluable.\n Documentation is ok. Instructions and comments are included inside the template, but not much in terms of FAQ/articles on the website. Having said that, I particularly appreciated the tutorial videos: one 28-min overview and 20 shorter videos that each cover a specific tab.\n You want more? Time to talk about analysis capabilities. Alexander Jarvis&#39; model is most lavish when it comes to that point. 50+ graphs are readily available - and that&#39;s without counting the sparklines that are peppered throughout the sheet. Because modeling is so detailed, the template can provide advanced SaaS metrics such as marketing leverage or expansion % of new MRR. Of course, costs can be allocated to P&amp;L categories and departments  ...\n When it comes to financial statements, the $319 version gives you only 3 years of forecasts, with no balance sheet and no cap table. The $1,299 version does a bit better with 5-year forecasts, but still no sign of balance sheet nor cap table. Some would argue that an early-stage startup doesn&#39;t need formal financial statements... However, this template does include a tab to compare your forecasts to your actuals, and another tab listing down industry  ...\n If you want the best spreadsheet ever, it boils down to comparing Taylor Davidson&#39;s and Alexander Jarvis&#39; templates, and picking the one that fits you the most. See the final section &#34;Conclusion&#34; for a side-by-side of both models.\n    However, some prefer using a specialized SaaS app to build your financial model. If that&#39;s your case, check out the last 4 models.\n     The Finance Navigator was developed by Alexander Matthiessen and Wout Bobbink from EY&#39;s Dutch office. It&#39;s a SaaS app: you pay a monthly subscription to access an online tool. It&#39;s a fundamentally different approach from the spreadsheet-based models we&#39;ve explored so far.\n The Finance Navigator costs $30 per month without commitment or $380 over an 18 month period. For that price, you get very exhaustive financial statements: income statements, cash flow statements, and balance sheets over 10 years - no cap table though. All currencies are available and you can export the statements to a clean, well-designed spreadsheet format (only numbers, no formulas).\n Documentation is good, with in-app guidance, website posts, a Q&amp;A, and a 37 min walkthrough video. The tool was clearly thought to be user-friendly and the onboarding is best-in-class. You will have zero difficulties using EY&#39;s Finance Navigator whatsoever.\n Unfortunately, simplicity is a double-edged sword. Revenue and cost modeling is super basic. For example, revenue is defined as a base number for month 1, then a monthly growth rate. No channels, no conversion rate, no pricing plans. The same goes for costs: you cannot tie costs to specific activity metrics, so you have to input them manually. Because it&#39;s a SaaS application, you cannot customize the model by adding fields or modifying  ...\n At the end of the day, EY&#39;s Finance Navigator holds a lot of promises. UX is great and they have a couple of nice features like comparables and scenarios. The product has evolved over the years, adding up features and getting more usable. In my estimation, it&#39;s not quite enough to be used by advanced SaaS entrepreneurs. The product is geared towards traditional businesses - think bakery, restaurant, consulting, who just want clean  ...\n        Liveplan sells its financial modeling SaaS app at $20 per month ($360 over 18 months), which makes it a close competitor to EY Finance Navigator.\n Starting with the strong points, Liveplan offers exhaustive statements over 5 years: income statements, cash flow statements, and balance sheets. Compared with EY&#39;s model, you have a bit more control over revenue modeling: offerings can be defined as recurring fees, billable hours, and a one-time upfront fee can also be added. Pricing can be increased automatically over time, churn can be factored in, and you can model monthly or annual  ...\n When looking at cost modeling, you can adjust payment terms for clients and suppliers. There are also specific variables for hardware products. Documentation is just fine, with a tutorial video per section embedded directly in the app, as well as plenty of instructions. Liveplan exists in 5 languages, and integrates with Quickbooks, which allows importing your actual numbers and comparing them with your forecasts. You can also export your  ...\n Now, although Liveplan&#39;s software has more powerful modeling capacities than EY&#39;s, it remains insufficient in my estimation. Here are just a few examples.\n Direct labor costs can be set as a % of revenue, but do not update the number of employees accordingly.\n  Indirect costs can only be set as a constant, a % of overall revenue, or a % of a specific revenue.\n  New client acquisition is just manual input - as in you manually input &#34;2&#34; clients in March and &#34;4&#34; clients in April. There is no channel modeling whatsoever.\n When modeling is too superficial, it translates into poor analysis capabilities. In Liveplan&#39;s case, you do have a dozen financial metrics available (net cash flow, account payable, cash on hand…) and another dozen graphs. But SaaS metrics are absent, which is a bummer for SaaS entrepreneurs.\n At the end of the day, LivePlan was built for non-tech entrepreneurs. Perfect for a bike shop owner, but not quite there for SaaS people.\n Don&#39;t take my word for it: there is a 60-day trial, so give it a spin for free and make up your own mind.\n        Summit is a young startup (founded 2019) that brings a fresh take on the whole financial modeling thing with a SaaS solution.\n Let&#39;s make it clear - Summit is not meant for fundraising. Forecasts on Summit are made for an 18-month period only. Costs cannot be allocated to P&amp;L categories and departments, nor can you differentiate between labor/non-labor or direct/indirect costs. Therefore, you won&#39;t be able to generate any financial statements that your investors may require . Hell, you can&#39;t even export a spreadsheet!\n So why talk about Summit? Because Summit is pretty awesome when it comes to piloting your SaaS startup with a financial model. Here is how it works. First you connect your live metrics (Stripe, Baremetrics, etc.) to your Summit account. This allows Summit to derive your future growth from the current trends. The next step consists in optimizing that future growth. To do that, you define a baseline scenario around 20+ metrics from  ...\n Summit is still a young product and there is room for improvement: currencies, tax rates, expansion and contraction of existing clients, one-off revenue. In particular, client acquisition would greatly benefit from more granularity and native integrations with social media accounts for instance.\n At the end of the day, Summit is not meant to build financial statements, but to make decisions in a data-driven way. It&#39;s such a refreshing approach in the space that I highly recommend trying it out. Bonus point: it&#39;s 100% free for now, so it&#39;s a no-brainer.\n        At first glance, Causal seemed very similar to Summit. It&#39;s also a SaaS solution, also founded in 2019, also bringing a new approach to modeling. But that&#39;s where the comparison stops because the philosophy behind Causal is quite unique.\n Causal is not just a financial modeling tool for SaaS startups. It&#39;s a modeling tool that aims at replacing Excel for every modeling need you may have. This means that (a) Causal is super versatile and goes much deeper than Summit, and (b) Causal is much more complex with a steeper learning curve than Summit.\n Looking at revenue and cost modeling, you can model anything you want on Causal with an interface that&#39;s 10x more modern and user-friendly than a spreadsheet. The same thing goes for analysis capabilities: you can generate dashboards, tables, and graphs for absolutely anything - including any financial statement your investors may want. You can also connect live data sources (Stripe and Google Sheets for now, more to  ...\n As a SaaS entrepreneur, you don&#39;t have time to build a model from scratch. Lucky you, Causal has built-in templates - including two SaaS models built by Taylor Davidson himself (see template #6). You are then able to augment or fine-tune those models to suit your specific needs.\n In terms of documentation, there are a few videos, a live chat as well as a walkthrough when you start a new model. That&#39;s not much, but Causal assumes that you are a modeling &#34;nerd&#34; and that your usual work environment is massive spreadsheets. If that&#39;s the case, you&#39;ll be just fine. Assuming you have the time and desire to put in the hours to learn a new tool, Causal may very well be the ultimate  ...\n         If you want a &#34;good enough&#34; model but are not willing to pay for it, go for  Ben Murray&#39;s (model #4) or  Chris Janz&#39;s (model #2). Customize them a bit to offset their weaknesses.\n     If you want the best financial model spreadsheet out there and are willing to pay for it, go for  Taylor Davidson&#39;s (model #6) or  Alexander Jarvis&#39; (models #7/#8). They are by far the best stuff on the market today.\n     If you want to experience the future of financial modeling, go for  Summit (model #11) or  Causal (model #12) - while keeping in mind that both are very different.\n    Thanks for reading. Don&#39;t hesitate to leave a question in the comments, I try to reply personally to each one of them.", "posttime": "2020-05-04 05:37:11", "tags": "财务,financial,模型,model", "title": "启动财务模型-与SaaS比较的12个模板", "title_en": "Startup financial models – 12 templates compared for SaaS", "transed": 1, "url": "https://www.stephnass.com/blog/startup-financial-model", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["财务", "financial", "模型", "model"]}, {"category": "", "categoryclass": "", "imagename": "211650deb5c6c130a39e3cb90c1f9964.jpg", "infoid": 1000528, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然投资者可能会将CARE法案视为他们的创业投资组合公司的生命线，但也有某些陷阱需要注意。\n根据虚假申报法，政府可以寻求对以虚假借口获得资金的公司进行民事和刑事处罚。最重要的是，个人举报人(以及他们饥肠辘辘的原告律师)也有资格代表政府提起诉讼。\n承担责任的不仅仅是获得资金的公司。包括董事在内的个人也有可能承担责任。\n许多受欢迎的CARE法案资助计划-如PPP和EIDL计划-要求申请公司进行资格认证。例如，购买力平价贷款需要一份证明，证明“当前经济状况的不确定性使贷款申请成为必要，以支持符合条件的接受者的持续运营。小企业管理局进一步澄清，“借款人必须。。。[考虑到]他们目前的业务活动，以及他们获得其他流动性来源的能力…。\nVB Transform 2020 Online-2020年7月15日至17日：与领先的人工智能高管一起参加VentureBeat&#39；年度人工智能活动。立即注册，可节省30%的数字访问通行证。\n显然，关于资源充足的公司获得购买力平价(PPP)融资的新闻故事层出不穷(例如Ruth‘s Chris，Shake Shack)。但在风投和初创公司社区，客户们质疑一家由风投支持的初创公司是否真的“需要”这笔钱。这不仅仅是一个道德问题。鉴于所描述的认证..。\n如果一家公司为了获得CARE法案刺激资金而进行虚假认证会发生什么？答案在“虚假索赔法案”下找到。\n“虚假索赔法案”规定了“明知”向联邦政府提交虚假索赔--包括申请政府贷款--的民事和刑事责任。\n仅仅提交虚假索赔是不够的。它一定是“明知”是假的。但不一定要有欺诈的具体意图。\n“虚假索赔法”所产生的责任不仅仅是一个理论上的问题。司法部已经发布了一份新闻稿，声称将优先调查与冠状病毒有关的欺诈行为。因此，人们正在投入注意力和资源来调查CARE法案的欺诈行为。\n政府不是唯一可以起诉你虚假索赔的人。\n人们需要担心的不仅仅是政府。公众可以站在政府的立场，根据“虚假索赔法案”提起诉讼。这被称为Qui Tam动作。\n为什么有人会根据虚假索赔法案提出Qui Tam索赔？因为它可能值很多钱。Qui Tam诉讼中的私人原告可以保留诉讼中高达30%的赔偿，外加一笔律师费。其余的复苏资金都归政府所有。\n原告律师事务所已经开始做广告，要求举报人挺身而出，显然是为了根据《关注法》提起一系列Qui Tam诉讼。\n“虚假索赔法案”并没有将责任仅限于申请公司。它可以延伸到董事和投资者。\n记住--很多初创公司现金匮乏。然而，投资者往往并非如此。因此，风投和其他投资者成为寻求提起Qui-tam诉讼的原告律师财力雄厚的有吸引力的目标。\n让我们把重点放在“虚假索赔法”对风投和其他投资者的责任的两个重要方面。\n首先，是“提交”虚假索赔的概念。你可能会认为，考虑到投资者在初创公司寻求CARE法案融资时面临的潜在责任，最好的做法是让自己参与到这个过程中来。这可能不会产生预期的结果。\n根据“虚假索赔法”，您不会因为公司承担责任而自动承担责任。事实上，知道公司提交虚假索赔甚至不足以施加个人责任。相反，个人肯定采取了一些肯定的步骤，使公司提交了…。\n这对风投本身和可能由风投任命的董事有着不同的影响。\n投资者通常不会在决定是否寻求政府资金方面扮演任何角色。因此，从避免责任的角度来看，有很强的理由置身事外。\n对于投资者董事来说，闭上眼睛让公司做它想做的事就更难了。这可能会引发受托责任的担忧。但董事的工作是确保公司有适当的政策和程序，让高级管理人员就政府资金做出决定，而不是.。\n第二，虚假索赔法索赔的知识要素。虚假索赔法案不是严格责任法规，也不寻求惩罚疏忽。要承担责任，政府(或站在政府立场的私人原告)必须证明被告的行为是“知情的”。\n作为投资者董事，y", "note_en": "While investors may see the  CARES Act as a lifeline for their startup portfolio companies, there are certain traps to be aware of.\n Under the False Claims Act, the government can seek both civil and criminal penalties against companies obtaining funding under false pretenses. On top of this, individual whistleblowers (with their hungry plaintiffs’ attorneys) also have standing to  sue on behalf of the government.\n  It’s not just the companies that obtain funding that can be liable. Individuals, including directors, have the potential to become liable, as well.\n  Many popular CARES Act funding programs —like the PPP and EIDL programs —require an applicant company to make eligibility certifications. For example, the PPP loans require a certification that “the uncertainty of current economic conditions makes necessary the loan request to support the ongoing operations of the eligible recipient. ”The SBA further clarified that “Borrowers must . . . [take] into account their current business activity and their ability to access other sources of liquidity  ...\n  VB Transform 2020 Online - July 15-17, 2020: Join leading AI executives at VentureBeat&#39;s AI event of the year.  Register today and save 30% off digital access passes.\n There has obviously been a spate of news stories about well-resourced companies obtaining PPP funding (e.g. Ruth’s Chris, Shake Shack). But in the  VC and startup community, clients are questioning whether a VC-backed startup really “needs ”the money. This isn ’t just a moral question. Given the certification described  ...\n  What happens if a company makes false certifications to obtain CARES Act stimulus funding? The answer is found under the False Claims Act.\n The False Claims Act provides for civil and criminal liability for “knowingly” submitting a false claim to the federal government — including a request for a government loan.\n Merely submitting a false claim is not enough. It must be “knowingly” false. But there need not be a specific intent to defraud.\n False Claims Act liability arising from the CARES Act is not just a theoretical concern. The Department of Justice has already issued  a press release asserting that it will be prioritizing investigations of COVID-19 related fraud. So, attention and resources are being put into ferreting out CARES Act fraud.\n The government isn’t the only one that can sue you for a false claim\n It’s not only the government that one needs to worry about. A member of the public can stand in the government’s shoes and file a suit under the False Claims Act. This is called a  qui tam action.\n Why would someone bring a qui tam claim under the False Claims Act? Because it can be worth a lot of money. A private plaintiff in a qui tam action may be able to keep up to 30% of the recovery in the lawsuit, plus an award of attorneys’ fees. The rest of the recovery goes to the government.\n The plaintiff’s bar has already started advertising for whistleblowers to come forward for the obvious purpose of bringing a slew of qui tam actions under the CARES Act.\n  The False Claims Act doesn’t limit liability to just the applicant company. It can extend to directors as well as investors.\n And remember — lots of startups are cash poor. Investors, however, are often not. Thus, VCs and other investors make attractive targets with big pockets for plaintiffs’ lawyers seeking to file qui tam actions.\n Let’s focus on two important aspects of False Claims Act liability for VCs and other investors.\n First, is the notion of “submitting” a false claim. You might think that given the potential liability an investor faces when a startup seeks CARES Act funding that the best thing to do is to insert yourself in the process. This might not have the desired result.\n You are not automatically liable under the False Claims Act just because the company becomes liable. In fact, knowledge of the company submitting a false claim isn ’t even enough to impose personal liability. Rather, the individual must have taken some affirmative steps to cause the company to submit the  ...\n This has different implications for VCs themselves vs. directors who may be appointed by a VC.\n Investors are not generally expected to have any role in deciding whether to seek government funding. So, from a liability avoidance perspective, there is a strong case to be made to stay out of it.\n For investor directors, it is more difficult to close your eyes and let the company do what it wants to do. That can raise fiduciary duty concerns. But the job of a director is to make sure the company has policies and procedures in place for the officers to make decisions on government funding, not to  ...\n Second, there is the knowledge element of a False Claims Act claim. The False Claims Act is not a strict liability statute, nor does it seek to punish negligence. To be liable, the government (or a private plaintiff in the government’s shoes) must show that the defendant acted “knowingly.”\n As an investor director, you want to make sure you can demonstrate, at a minimum, that you have acted reasonably and in good faith. In that regard, documentation is always recommended.\n In addition, make sure you are consulting with legal counsel in ensuring compliance with federal funding requirements. This is a particularly key when dealing with facing potential False Claims Act litigation. Reliance on advice of counsel can be, in itself, a defense to a claim that you violated the  ...\n  For many investors, this guidance may be seen as coming too late — their portfolio companies already obtained stimulus loans when perhaps they weren’t really eligible. Thankfully, the SBA has provided a solution.\n Any company that has received a PPP loan can return the loan in full by May 7, 2020. This safe harbor will allow companies to avoid liability for having obtained a loan when they were potentially ineligible.\n Mital Makadia and David Siegel are partners at  Grellas Shah LLP, where they counsel tech startups and investors in general corporate, venture financing, M&amp;A, and other transactional matters.", "posttime": "2020-05-04 05:14:51", "tags": "风险投资,企业,firms,government", "title": "如果初创企业错误申请刺激资金，风险投资公司可能会承担责任", "title_en": "VC firms can be liable if startups wrongly claim stimulus funds", "transed": 1, "url": "https://venturebeat.com/2020/05/03/vc-firms-can-be-liable-if-startups-wrongly-claim-stimulus-funds/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["风险投资", "企业", "firms"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000527, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我震惊地得知，美国没有应对大流行的计划，甚至没有做一些基本的事情，比如储备足够的医用口罩或足够的测试设备供应(或者至少是快速生产测试设备的能力)。\n有人说这是“周一早晨的四分卫”。在“没有人能预见到”的事件发生后，人们很容易投掷石块。\n好的，那么今天我想做一些周日上午的四分卫。我想问问你们，我们有没有准备好迎接其他黑天鹅。让我们从太阳耀斑或电磁脉冲攻击导致的电力系统崩溃开始。\n在国会委员会的证词中，有人断言，由于饥饿、疾病和社会崩溃，美国电网的长期崩溃可能导致多达90%的美国人口死亡。\n这引起了我的注意。这听起来比被关在笼子里看很多Netflix电影更糟糕。\n高压变压器是系统中的薄弱环节，联邦能源管理委员会(FERC)已经确定其中30台是关键的。同时损失9个，在不同的组合中，可能会使网络瘫痪，并导致级联故障，导致“从东海岸到西海岸的停电”。\n如果高压变压器损坏到无法修复的地步，能否更换就成了问题。这些单元中的绝大多数都是定制的。国产高压变压器从订购到交货的交货期在12至24 月之间，这是在良性的低需求条件下进行的。\n好的，我想我知道需要做什么了--储备一些不能很快更换的变压器。\n如果今天订购，从海外交付一台设备(占目前美国采购的85%)将需要近3年的时间( )。一台高压变压器的出厂价格可能超过1000万美元-太贵了，不能仅仅作为紧急更换的备件来维持库存。\n是的，3亿美元购买30台高压变压器的库存太贵了，不能防止90%的公众死亡，其余的都沦为自相残杀。对于一个花费数万亿美元的政府来说，花费数万亿美元的关爱程度大约相当于一个醉酒的水手在红灯区花费工资，这太贵了。相反，让我们再买一架F-22喷气式战斗机。\n显然，我在这方面不是专家，我希望评论者会告诉我为什么我错了。也许就是那些告诉我，我愚蠢地认为外科口罩能提供任何保护的评论者。\n顺便说一句，这不是像杀死恐龙的小行星那样的6000万年一遇的事件之一；1859年，一场巨大的太阳耀斑击中了地球。\n更新：我忘了提一下，我对意外核战争、生物恐怖主义和人工智能失控的担忧远远超过对太阳耀斑的担忧。", "note_en": "I was shocked to learn that the US had no plan to deal with a pandemic, and had not even done basic things like stockpile enough surgical masks or an adequate supply of testing equipment (or at least the ability to produce the testing equipment rapidly.)\n Some people say this is “Monday morning quarterbacking”. It’s easy to throw stones after an event that “no one could have foreseen”.\n OK, then today I’d like to do some  Sunday morning quarterbacking. I’d like to ask you guys whether we are prepared for other black swans. Let’s start with a collapse of the electrical system due to solar flares or electromagnetic pulse attacks.\n   In testimony before a Congressional Committee, it has been asserted that a prolonged collapse of this nation’s electrical grid—through starvation, disease, and societal collapse—could result in the death of up to 90% of the American population.\n Well that caught my attention. It sounds worse than being cooped up for a few months watching lots of Netflix films.\n HV transformers are the weak link in the system, and the Federal Energy Regulatory Commission (FERC) has identified 30 of these as being critical. The simultaneous loss of just 9, in various combinations, could cripple the network and lead to a cascading failure, resulting in a “coast-to coast blackout”.\n If the HV transformers are irreparably damaged it is problematic whether they can be replaced. The great majority of these units are custom built. The lead time between order and delivery for a domestically manufactured HV transformer is between 12 and 24 months, and this is under benign, low demand conditions.\n OK, I think I understand what needs to be done—stockpile some of these transformers that cannot be quickly replaced.\n Ordered today, delivery of a unit from overseas (responsible for 85% of current American purchasing) would take nearly 3 years. The factory price for an HV transformer can be in excess of $10 million—too expensive to maintain an inventory solely as spares for emergency replacement.\n Yes, $300 million dollars for a stockpile of 30 HV transformers is far too expensive to prevent 90% of the public dying and the rest reduced to cannibalism.  Too much for a government that spends  trillions of dollars with about as much care as a drunken sailor spending his wages in a red light district.  Instead, let’s buy another    F-22 jet fighter.\n  Obviously I’m no expert here, and I expect commenters will tell me why I’m wrong.  Perhaps the very same commenters who told me that I was foolish to think that surgical masks would provide any protection.\n BTW, this isn’t one of those once in 60 million year events like dinosaur-killing asteroids; a huge solar flare hit Earth in 1859.\n Update:  I forget to mention that I’m far more worried about accidental nuclear war, bioterrorism and AI run amok than I am about solar flares.", "posttime": "2020-05-04 05:14:47", "tags": "电网,electrical,美国,collapse", "title": "美国对电网崩溃毫无准备，但只需3亿美元", "title_en": "US unprepared for an electrical grid collapse, but it costs only $300M", "transed": 1, "url": "https://www.themoneyillusion.com/sunday-morning-quarterbacking/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["电网", "美国", "collapse"]}, {"category": "", "categoryclass": "", "imagename": "a9322584011cab9fab78593511aa64dd.jpeg", "infoid": 1000526, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "过去一周，联合国世界粮食计划署(World Food Program)可怕地宣布，由于冠状病毒的经济影响，多达2.5亿人可能面临饥饿，这应该会永久性地改变人们对冠状病毒大流行的讨论。到目前为止，我们一直在向科学家寻求指导。我们的公共卫生专家告诉我们，为了赢得这场战斗，我们需要关闭社会、社区和经济生活。现在，随着恢复正常生活的压力越来越大，许多人坚持认为我们应该等待专家给我们一个科学的…。\n从1月份开始，流行病学家开始警告一场大流行，如果不加以控制，可能会导致世界各地数百万人死亡。他们是对的，他们的警告是对社会的无价服务。不幸的是，自那以后，这些专家中的许多人都被要求提出远远超出他们专业领域的建议。\n虽然对感染者的隔离长期以来一直是阻止疾病的有效手段，但以这种规模关闭健康机构-以及全球经济-是完全史无前例的。这相当于给所有人开了一种剧毒、未经测试、副作用巨大的药物。流行病学家了解病毒，但在农业、供应链、劳动力市场、财政政策、社会结构、心理健康、教育、家庭关系、国家安全或.。\n极具影响力的帝国理工学院的报告简短地承认了这些明显的局限性。是的，拟议的关闭将带来“巨大的社会和经济代价”，这本身可能会“对健康和福祉产生重大影响”。但由于该报告的作者没有能力衡量这些潜在的压倒性成本，他们忽略了这些成本。科学可能不必担心权衡取舍，但政策和医疗保健总是需要：要拯救这个村庄，我们首先必须小心……。\n3月份，当全世界都在关注冠状病毒对意大利北部的可怕影响时，采取重大行动的压力是不可避免的。但主要经济体的关闭本身就是一场历史性的世界性灾难。教育、社会和文化生活基本上停止了。仅在美国，就有2600万人失去了生计，数百万家庭看到他们脆弱的财务安全受到威胁-这一水平与大萧条(Great Depression)相当。其长期影响.。\n尽管政府停摆带来了巨大的人力成本-而且对病毒的了解即使仍然非常不完整，但公共卫生专家们仍然在最初的战略上加倍努力。几位专家警告说，我们可能需要继续关闭-就像水龙头一样打开和关闭-几年来。\n这很奇怪：当流行病学家担心冠状病毒病死率为2-3%时，这种剧毒药物被认为是不可避免的，但不知何故，这种药物在某种程度上也是不可避免的，尽管现在的范围看起来更像是0.5%-1.0%。最初被认为不切实际的另类针对性缓解想法，如隔离最脆弱的人和集中资源到疗养院，不知何故仍然不切实际，尽管现在很明显死亡人数高度集中，而且社会愿意..。\n我们的新闻媒体-以及社交媒体的回音室-已经完全相信了世界末日的估计，只有一个看似合理的“科学”解决方案。没有一个主播敢提到，这场大流行很可能会使美国2020年的死亡人数增加不到4%。据推测，记者知道健康人死于这种病毒的可能性很小--然而，冷酷的分析人士坚持认为，站在离地只有5英尺的地方，遛狗，或者去投票都是“冒着死亡的风险”。“专家们陶醉于错误的二分法：……。\n事实证明，所有这些都对电视收视率非常有利。但这对于帮助公众了解这场大流行的相对风险来说是可怕的。\n支持者如此沉迷于政府关门，以至于他们似乎已经忘记了它最初的理由。关门的目的是“拉平曲线”，在足够长的时间内传播感染，以防止任何时候对医疗保健系统的需求激增。关闭的目的是推迟大流行的一些痛苦，而不是消除它。另一种鼓励快速群体免疫的战略接受了短期结果更差的风险，希望能更快地结束大流行。根据定义，..。\n事态的发展破坏了关闭的根本前提：通过限制对医疗保健系统激增的需求来拯救冠状病毒患者的生命。我们现在意识到，医疗保健在减少冠状病毒死亡方面的能力有限，这丝毫没有削弱卫生保健专业人员的勇气和承诺。更糟糕的是，关闭正在伤害数千万无法获得非COVID疾病有效治疗的人，并通过大幅削减收入，可能对…造成长期损害。\n在媒体中，停摆不知何故已经从一个临时的、紧急的反应变成了一座持久的桥梁，通向“安全”的好莱坞结局。公共卫生专家认为", "note_en": "This past week ’s horrific announcement from the UN ’s World Food Program that up to 250 million people may be facing starvation from the economic impact of COVID-19 should permanently change the conversation about the pandemic. Up to now, we ’ve looked to scientists for guidance. Our public health experts have told us we need to shut down social, community and economic life to win this battle. Now as the pressure grows to resume normal life, many insist we wait for experts to give us a scientific  ...\n Beginning in January, epidemiologists began warning of a pandemic which, left unchecked, could lead to millions of deaths around the world. They were right and their warning was an invaluable service to society. Unfortunately, many of these experts have been since asked to make recommendations that ranged well beyond their area of expertise.\n While quarantines of the infected have long been an effective means of impeding disease, shutting down the healthy —and the global economy —at this scale is utterly unprecedented. It is the equivalent of prescribing to the entire population a highly toxic untested drug with massive side effects. Epidemiologists know viruses, but have no special expertise in agriculture, supply chains, labor markets, fiscal policy, social fabric, mental health, education, family relations, national security, or  ...\n The highly influential Imperial College’s report — briefly — acknowledged these obvious limitations. Yes, proposed shutdown will entail “ enormoussocial and economic costs ”which may themselves create “significant impact on health and well-being. ”But since the report ’s authors had no capacity to measure these potentially overwhelming costs, they ignored them. Science may not have to worry about trade-offs, but policy —and health care —always does: to save the village, we must first be careful  ...\n As the world watched the terrifying impact of COVID-19 on northern Italy in March, the pressure to do something big was inevitable. But the shutdown of major economies itself has been a worldwide calamity of historic proportions. Education, social, and cultural life have essentially stopped. In the US alone, 26 million people have lost their livelihoods and millions of families are seeing their fragile financial security imperiled —a level in line with the Great Depression. The long-term impact  ...\n Despite the massive human costs of the shutdown — and a better if still very incomplete understanding of the virus — public health experts keep doubling down on their initial strategy. Several experts have warned that we may need to continue shutdowns — turned on and off like a spigot — for years.\n It ’s bizarre: this highly toxic drug that was considered unavoidable when epidemiologists worried about COVID-19 case fatality rates of 2 –3% is somehow equally unavoidable even though the range now looks more like 0.5 –1.0%. Alternative targeted mitigation ideas initially considered impractical —such as quarantining the most vulnerable and focusing resources on nursing homes —are somehow still impractical even though it ’s now clear deaths are heavily concentrated, and that society is willing  ...\n Our news media —and the echo chamber of social media —has been fully bought in to apocalyptic estimates and only one plausible “scientific ”solution. No anchor dares mention that this pandemic is likely to increase US deaths in 2020 by less than 4%. Presumably, reporters know that the chance of a healthy person dying from this virus is very small —yet grim analysts insist that standing only five feet apart, walking your dog, or going to vote is “risking death. ”Pundits revel in false dichotomies:  ...\n All this has proven very good for TV ratings. But it’s been terrible for helping the public understand the relative risks of this pandemic.\n Proponents are so bought into shutdown that they seem to have forgotten its original rationale. Shutdown was designed to “flatten the curve, ”spreading infections over a long enough time period to prevent surge demand at any time on the health care system. Shutdown was intended to defer some of the pain of the pandemic, not eliminate it. An alternative strategy of encouraging rapid herd immunity accepts the risks of worse short-term results in hopes of a quicker end to the pandemic. By definition,  ...\n Developments have undermined the very premise of shutdown: to save the lives of COVID-19 sufferers by limiting surge demand on the health care system. Taking nothing away from the bravery and commitment of health care professionals, we now realize medical care has only limited ability to reduce COVID-19 deaths. Even worse, the shutdown is harming the tens of millions unable to get effective treatment for non-COVID conditions, and by decimating revenue, likely causing long-term damage to  ...\n In the media, shutdown has somehow morphed from a temporary, emergency response into a long-lasting bridge to an “all-clear ”Hollywood ending. Public health experts who should know better haven ’t used their platforms to discourage such magical thinking. Perhaps, if we wait, we ’ll see a medical treatment for those with severe symptoms. Or an effective vaccine. Currently, the hope is that a broader testing regime will allow for a phased re-opening. Any of those would be great developments,  ...\n We will end the shutdown not because the virus is no longer a threat; we will end it because we can ’t continue such toxic treatment. Of course, ending the shutdown will increase risk of infections growing again, but that itself isn ’t a sufficient reason to maintain our current policy. As individuals, we make trade-offs between life and mortality every day, in our eating and exercising habits, our career decisions, our choices of fun. Half of us don ’t get flu shots each year, and that  ...\n It may be years before we can make a judgement on the overall wisdom of shutdown as our initial tool for attacking this virus. But whatever the strategy’s theoretical merits, it is unsustainable and unrealistic among actual human beings.\n So, what should our public health experts do to treat the patient and not just the virus? First, they can encourage us to maintain the many social distancing techniques short of suppression that individuals and communities can use to reduce transmission. Second, as our knowledge of this virus and its transmission evolves, they can be creative about finding more targeted mitigation approaches. This requires opening up debate on alternatives with an eye to finding acceptable trade-offs,  ...\n Most importantly as we end these unsustainable shutdowns, our experts can give us perspective. Even though we don ’t have a way to end this pandemic today, we will almost certainly develop better public health and medical interventions. These innovations take experimentation and time, and we ’re more likely to find them if we don ’t simultaneously burden ourselves with massive economic and social problems. COVID-19 is likely to be with us for a while and it will be painful. And though  ...\n David Goldhill is the author of  Catastrophic Care: Why Everything We Think We Know About Health Care Is Wrong and  The Real Costs of American Health Care.", "posttime": "2020-05-04 05:14:28", "tags": "病毒,治疗,patient,冠状病毒,shutdown", "title": "治疗病人，而不是病毒", "title_en": "Treat the Patient, Not the Virus", "transed": 1, "url": "https://medium.com/p/f8dcd87231e7/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["病毒", "治疗", "patient", "冠状病毒", "shutdown"]}, {"category": "", "categoryclass": "", "imagename": "c8c34e3493c8dc1b71bd37908f8008ec.jpg", "infoid": 1000524, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "哥伦比亚特区的一名美国地区法官周四签署了一项历史性的和解协议，为美国联邦贸易委员会(FTC)和Facebook之间长达8年的诉讼画上了句号。\n联邦贸易委员会早在2012年就就八项侵犯隐私的行为起诉Facebook，称Facebook对用户控制个人数据的能力做出了欺骗性的声明。联邦贸易委员会声称，Facebook误导用户使用默认设置，而这些默认设置并不像用户认为的那样隐私。同样在2012年，Facebook被勒令做出补救改变；然后，它被指控违反了这一命令-这导致了与联邦贸易委员会的更多诉讼。\n为了解决目前的诉讼，Facebook同意不会对数据安全做出虚假陈述，并将实施一项新的隐私计划。和解协议还要求Facebook支付50亿美元的民事罚款；这笔罚款远远高于联邦贸易委员会有史以来第二接近的罚款-最高可达2250万美元。\nFacebook和联邦贸易委员会之间新的最终和解协议是双方长时间激怒的产物-但仍需要法院批准才能生效。与所有类似的和解协议一样，法院必须宣布和解协议是公平、合理的，符合公众利益-这是一个相对较低的门槛。但法官蒂莫西·凯利(Timothy Kelly)在批准和解协议时并不像许多法官那样被动和超然。凯利对Facebook发表了一些严厉的言论，警告这家社交媒体巨头不要…。\n凯利写道：“在最高法院看来，美国指控Facebook同时违反法律和行政命令的肆无忌惮的方式令人震惊。”法官对这些指控的长篇大论对Facebook并不友好：\n起诉书中的指控反映了Facebook据称行为不当的许多方面。其中一些指控是离散的、考虑不周的决定，比如据称鼓励用户提供电话号码以更好地保护他们的账户，但随后在没有事先告知用户的情况下使用这些相同的号码进行广告。其他人似乎反映了Facebook直接欺骗用户的意愿，比如据称告诉公众它不会分享…。\n然后是严厉的警告：“如果各方回到本法院，因为美国再次声称-Facebook违背了承诺，继续违反法律或修改后的行政命令的条款，法院可能不会对拟议的决议的条款适用完全相同的尊重。\n换句话说，这最好是Facebook恶作剧的结束，否则联邦贸易委员会将不会是唯一一个落槌的人。\n但凯利也非常明确地表示，他认为立法部门应该考虑解决更深层次的问题。\n“这些指控，以及一些朋友的简报，让人质疑法律的充分性，这些法律规定了收集美国人个人信息并将其货币化的科技公司必须如何对待这些信息。但这些担忧在很大程度上是国会的问题，在这里无关紧要，“法官写道。", "note_en": "A U.S. district judge in the District of Columbia  signed off on a historic settlement Thursday, putting an end to 8-year-old litigation between the Federal Trade Commission (FTC) and Facebook.\n The FTC  sued Facebook back in 2012 over eight privacy violations, saying that Facebook made deceptive claims about users’ ability to control their personal data. The FTC alleged that Facebook misled its users into using default settings that weren’t nearly as private as users believed they were. Also in 2012, Facebook was ordered to make remedial changes; then, it allegedly violated that order – which resulted in yet more litigation with the FTC.\n To settle the current litigation, Facebook agreed that it would not make misrepresentations about data security and would implement a new privacy program. The settlement also obligates Facebook to pay $5 billion in civil penalties; that penalty is significantly larger than the next-closest penalty the FTC has ever won–which topped out at $22.5 million.\n The new finalized settlement between Facebook and the FTC is the product of lengthy netotiations between the parties – but still required court approval to take effect. As with all similar settlements, the court must declare the settlement fair, reasonable, and in the public interest – a relatively low bar. But Judge  Timothy Kellywasn ’t as passive and detached as many judges are when approving a settlement. Kelly served up some harsh words for Facebook, warning the social media giant not  ...\n ”In the Court’s view, the unscrupulous way in which the United States alleges Facebook violated both the law and the administrative order is stunning,” Kelly wrote. The judge’s recitations of those allegations at length were not kind to Facebook:\n The allegations in the Complaint reflect many ways in which Facebook purportedly acted improperly. Some of these allegations represent discrete and poorly considered decisions, such as allegedly encouraging users to provide phone numbers to better secure their accounts, but then using those same numbers for advertising without telling users beforehand. Others appear to reflect Facebook ’s willingness to deceive its users outright, such as allegedly telling the public that it would not share  ...\n Then came a stern warning: “In the event that the parties return to this Court because the United States alleges—once again—that Facebook has reneged on its promises and continued to violate the law or the terms of the amended administrative order, the Court may not apply quite the same deference to the terms of a proposed resolution.\n In other words, this had better be the end of Facebook’s shenanigans, or the FTC won’t be the only one to drop the hammer.\n But Kelly was also crystal clear that he thinks there are deeper problems that the legislative branch should considering solving.\n “And these allegations, and the briefs of some amici, call into question the adequacy of laws governing how technology companies that collect and monetize Americans’ personal information must treat that information. But those concerns are largely for Congress; they are not relevant here,” the judge wrote.", "posttime": "2020-05-04 04:29:49", "tags": "facebook,法官,judge", "title": "联邦法官对Facebook“肆无忌惮”的违法行为感到震惊", "title_en": "Federal Judge Stunned by Facebook’s ‘Unscrupulous’ Violation of the Law", "transed": 1, "url": "https://lawandcrime.com/lawsuit/federal-judge-stunned-by-facebooks-unscrupulous-violation-of-the-law-warns-of-much-deeper-problems", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["facebook", "法官", "judge"]}, {"category": "", "categoryclass": "", "imagename": "9becbf84d76197bc827f0d1646a96b26.jpg", "infoid": 1000523, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "经营自己的企业14年来，我失败了很多。谢天谢地，我没有统计过，但我可以说，我至少创办了50家企业/想法，其中3家成功了。当我说工作时，我并不是指继续做生意，我的意思是要么在当时给我带来一份像样的收入，要么是一笔对我或其他人有价值的体面资产。作为一名企业家，你要冒这么多风险，我不认为取代你的工作和在家工作是一件很有意义的事。\n初创公司群体喜欢美化失败，但我不喜欢。失败很糟糕。缓慢的失败更让人难受。这就是为什么有时候放弃是可以的，这样你就可以自由地转向一个想法，这个想法可能会给你带来创业社区没有太多谈论的东西：实际的成就感和成功。\n知道什么时候放弃几乎是不可能的，做出放弃的决定所带来的情感包袱是无法承受的。这就是为什么企业家，包括我自己，为了追随“想法无关紧要，只有执行重要”的流行趋势，把自己的生命浪费在永远不会奏效的糟糕想法上。\n想法很重要，如果你的想法很差劲，对你来说，那个时候，以你的资源，几乎肯定会失败。\n这里有一张清单，列出了当事情可能失败时要注意的事情。这些都是基于我的失败和我在我的圈子里看到的失败(大多是自筹资金的在线商人)。\n对于一个创业者来说，愿意去做你一无所知的事情可能是一个很好的品质，但只在一定程度上是这样。有时候创业者做得有些过火，我自己也做过。我开始了一项销售儿童玩具的生意，没有任何零售经验，或者对儿童一无所知，我试图开始制作盆栽摊位的生意，尽管我不是园丁，在制造方面也没有任何经验，我试图为冲浪者建立一个应用程序，尽管我是一个糟糕的冲浪者，而且有……。\n如果我思考那些对我起作用的想法，我就能够利用我现有的很多技能来让它们发挥作用。在我的技能不够的地方，我与其他有技能的人作为合作伙伴一起工作，以实现这一目标。\n多年来，我看到这么多人试图创业，特别是在线企业和应用程序等，但他们对自己在做什么一无所知。成功的软件初创公司几乎总是由人脉深厚、超级聪明的创业者在大型创业中心城市创办的，或者是那些真正伟大的软件工程师。对于一个不是程序员的人来说，想出一个软件创意并将其转变为一家成功的公司是极其罕见的。\n然而，人们一直在尝试(包括我自己)，并想知道为什么它不起作用。如果你坚持做一些你非常熟悉的事情，或者至少有对该领域非常了解、你的技能同样有价值的联合创始人，你的机会就会增加很多。\n我过去经常这样做，一下子冒出四五个点子。很多人都做同样的事情。我想他们听到了一些一般性的建议，说百万富翁平均有7个不同的收入来源，他们认为这意味着他们必须有7个企业。我可以告诉你，1个伟大的生意比7个狗屎生意更有价值的地狱。把你的时间、注意力和奉献分散到多个项目上几乎是不可能的。\n也很难避免这些创业冲动，特别是当一个项目进展不顺利时，一次涉足几个项目是很有诱惑力的。但我宣称，在与这种冲动作斗争方面，至少取得了暂时的成功。我大约3年前就不做了。\n我的上一笔生意因此而蒙受了巨大的损失。在经营公司的同时，我和我的联合创始人都参与了多个项目。最后，我们的副项目都没有做得很好，这种做法对主营业务造成了影响。\n我把这些经验带到了我目前(唯一)的黑啤酒花酿造业务中。一旦我开始在BlackHops全职工作，我就关闭了所有其他的个人项目。其中一家的年收入相对较低，为4-5万美元，比我当时通过黑啤酒花挣的工资还要多。我把它和我所有的项目都关掉了，把重点放在了黑啤酒花上。\n这是一个正确的决定。自从我们开始以来，我没有考虑过任何其他项目，黑啤酒花已经成长为全国增长最快的啤酒厂之一，也是该州最大的独立啤酒厂之一。就规模而言，它已经是我上一项业务收入的6-7倍，不到4年的时间就值8-10倍。\n专注是值得的，特别是如果你真的相信你正在关注的事情。拒绝价值较低的机会，转而选择价值较高的机会，这是伟大的企业家一直在做的事情。\n这可能听起来很苛刻，但你有没有好好想过，在这个特定的时候，你是否是这个特定想法的合适人选？我觉得有时候人们", "note_en": "After 14 years running my own businesses, I ’ve failed a lot. I haven ’t kept count thankfully, but I ’d say I ’ve started at least 50 businesses / ideas and out of those, 3 have worked. And when I say worked I don ’t mean staying in business, I mean resulting in either a decent income for me at the time or a decent asset that ’s worth something to me or someone else. With all the risks you take as an entrepreneur, I don ’t see replacing your job and getting to work from home as a significant  ...\n The startup community likes to glorify failure but I don’t. Failing sucks. Failing slow sucks infinitely more. That’s why it’s OK sometimes to give up, to free you up to move onto an idea that could bring you something that the startup community doesn’t talk about near as much: actual fulfilment and success.\n  Knowing when to give up is near impossible and the emotional baggage that comes with making the decision to give up is unbearable. That’s why entrepreneurs, myself included, waste years of their lives on shitty ideas that will never work, following the popular trend of “ideas don’t matter, only execution matters”.\n  Ideas matter a lot, and if yours is a shitty one, for you, at that time, with the resources you have, it will almost certainly fail.\n Here is a list of things to look out for when things might be set for failure. These are based on my failures and the failures I’ve seen around my circles (mostly self-funded online business folk).\n  Being willing to go into something you are clueless about can be a great trait for an entrepreneur, but only to a point. Sometimes entrepreneurs overshoot, I ’ve done it myself. I started a business selling kids toys without any experience in retail or without knowing anything about kids, I tried to start a business making pot plant stands despite not being a gardener and having zero experience in manufacturing, I tried to build an app for surfers despite being a terrible surfer and having  ...\n If I think about the ideas that have worked for me, I’ve been able to utilise a lot of my existing skills to make them work. And where my skills weren’t enough, I’ve worked with other skilled people as partners to pull it off.\n Over the years, I’ve seen so many people try to start businesses, especially online businesses and apps etc without any clue what they are doing. Successful software startups are almost always started by well connected, super smart entrepreneurs in big startup hub cities, or people who are really great software engineers themselves. It’s extremely rare for an individual who isn’t a programmer to think up a software idea and turn that into a successful company.\n Yet people try all the time (myself included) and wonder why it doesn’t work out. Your chances go up a lot when you stick with something you know extremely well, or at the very least have co-founders who know the field very well and your skills are equally valuable.\n  I used to do this all the time, with 4 or 5 ideas bubbling away at once all the time. Lots of people do the same thing. I think they heard some generic advice that said millionaires have on average 7 different income streams, and they think that means they have to have 7 businesses. I can tell you 1 great business is a hell of a lot more valuable than 7 shit ones. It’s near impossible to split your time, attention and dedication across multiple projects.\n It’s also very hard to avoid those entrepreneurial impulses, particularly when one project isn’t going well, it’s tempting to dabble in a few at once. But I claim at least temporary success at battling this impulse. I stopped doing it about 3 years ago.\n My last business suffered immensely because of this. Both me and my co-founder worked on multiple projects while running the business. In the end, none of our side projects did very well at all, and the approach took a toll on the main business.\n I took these lessons into my current (only) business  Black Hops Brewing. Once I started working full time at Black Hops, I shut down all of my other personal projects. One of them was generating $40-$50k a year in relatively passive income which was more than I was getting as a wage via Black Hops at the time. I switched it, and all of my projects off to focus on Black Hops.\n And it was the right decision. I haven’t thought about any other projects since we started and Black Hops has grown into one of the countries fastest growing breweries and one of the state’s largest independent breweries. Size wise it’s already 6-7 times the revenue of my last business, and it’s worth 8-10 times as much after less than 4 years.\n It pays to focus, especially if you really believe in the thing you are focusing on. Turning down lower value opportunities for higher value ones is something great entrepreneurs do all the time.\n  This might come across as harsh but have you had a really good think about whether you are the right person for this particular idea at this particular time? I think sometimes people look up to these outlier heroes who started amazing outlier companies and think they can do it as well. It’s OK to have some ambition, but it has to be tempered with some level of self awareness.\n Steve Jobs famously said “Life can be much broader once you discover one simple fact: Everything around you that you call life was made up by people that were no smarter than you.” This is a neat inspirational quote, but is it actually true?\n I’m a reasonably smart person, when I went to school I was slightly above average for my school. I got a good enough grade to get into Business at university and went on to start a few of my own businesses. But what about all the kids that were smarter than me at school do?\n When I look around, I see amazing houses that were designed by Architects after acing school, getting through a gruelling 5 years at university, a further 2 years in monitored practice, passing the Architects Accreditation Council of Australia exam then probably worked under an amazing Architect with 20-30 years experience for 5 years at least before they designed the house I ’m looking at. The roads and the bridges and the buildings are the same, built by engineers who were  ...\n Businesses in many ways are not that much different. The successful restaurants are normally started by the industry ’s best and most award-winning chefs, software apps are created by some of the smartest entrepreneurs and software engineers in capital-rich startup hubs like Silicon Valley. Have you ever listened to an interview with any of the founders of any of the major tech giants of our generation? Zuckerberg is a computing genius, an insanely aggressive risk taker, he  ...\n Not to say there’s no place for you and me in a world filled with access and enormous opportunity. But should we be trying to start the next Facebook? Probably not the right people for the job.\n  I ’ve noticed a lot of younger entrepreneurs have a strong social conscience, which is a great thing. But the idea of starting a charity of sorts that ’s also a business is a tricky one to get my head around. There are certainly examples of companies who have been started with a strong social conscience that have also been fantastic businesses. But for every one of those, there ’s way more companies that seem to make a lot of vague claims about donating a “% of profit ”to  ...\n When I think about entrepreneurs who have given large amounts to causes, the ones I think of like Bill Gates, Michael Bloomberg, Jeff Bezos etc were all ridiculously successful business people first, and philanthropists later. Many, like Gates, were well known for being ruthlessly competitive, happily monopolising industries and obliterating competitors. These guys were hard entrepreneurs, driven by creating revolutionary products and making shitloads of money.\n And that ’s completely fine as far as I ’m concerned, that ’s what entrepreneurs are supposed to do. If you can build some good natured help for people in need into your business model (or more importantly your brand), then go for it. But it should be a business first. There is a lot of nobility in starting a business that entrepreneurs often don ’t get credit for. Small businesses power our economies, they support families, they employ tax paying citizens and they pay their  ...\n  Marketing is the biggest problem in business, I should know after failing marketing in Business School and failing at marketing in most of my businesses. Convincing anyone to do something different to what they are currently doing is near impossible. I know you know this, as business owners we know when we have a good product or service or event or app or restaurant, we look around at our competitors and size them up and feel like our offering is just as good if not better.  ...\n In my circles of mainly self funded smaller businesses, we don’t have the big budgets to acquire customers with paid ad spend. Even if we could, we don’t have the analytics to know if the money is well spent or not. Figuring all of that out is expensive and it takes time. So normally what we do is we build a nice brand and a nice story around what we do.\n In my case my last business I had this ongoing (very real) story about an entrepreneur who failed for 7 years and then started a neat little productised service business in 7 days.\n The fact that it was 7 years of failure and 7 days to success was pure luck. The fact that the entrepreneur was me was even luckier.\n The business would offer unlimited WordPress fixes for a fixed monthly fee, the first of its kind with this type of idea. It took off. My failure story turned into a success story, and me and my co-founder used that story and momentum to build a nice business which we sold to GoDaddy less than 3 years later.\n With my current business, it’s a similar story (but way better). 3 guys sat around at a bar discussing brewing ideas, we decided to have a crack at one of the ideas and after realising it was a hit, we took the plunge and built our own brewery (with a lot of other cool shit happening along the way, which we happily accepted into  our story).\n In both causes we took our community and our audience along with us as we built the business, and we built the businesses while spending close to $0 on advertising.\n But this wasn’t about us geniuses thinking up a cool story and using it as a branding exercise. We just happened to find ourselves inside a great story. We were of course very happy to use that and be part of it and make it the centrepiece of our marketing.\n For these 2 businesses I ’ve got enormous amounts of free marketing and publicity over the years. We ’ve had international attention from the likes of Activision (Call of Duty ’s first official beer), TechCrunch, Fox news, Mashable and more. We ’ve had local attention including featuring on an episode of a TV show on Channel 9, being on 9 News and 7 News and the Gold Coast Bulletin and the Courier Mail and more. None of that cost us a cent, and without that kind  ...\n But what if you don’t have that luxury? What if you don’t find yourself inside a great story. I guess you could make it up, an approach that makes me ill to think about, but a lot of companies do it and it works for some. But I like to think most consumers see through it. The more likely outcome is the business won’t gain traction. You’ll miss out on the easiest solution to businesses biggest problems.\n It’s not great, but maybe it means you have to search out for an idea where you will find yourself inside a cool story.\n  One of the biggest traps for new entrepreneurs is they try to change the world too soon. They are inspired by entrepreneurs like Steve Jobs and Elon Musk and they want to be ‘disruptive’ and ‘make a dent in the universe’.\n Being inspired is great and super important, I’m also very inspired by these people and have been over many years. But trying to change too much is a struggle that most entrepreneurs aren’t ready for.\n Can you imagine the gargantuan task of convincing people who have driven petrol cars all their life to no longer buy petrol cars? Can you imagine being a startup car maker and competing against iconic companies that people tie their identities to? Competing against companies who have more than a century of lessons and innovation and brand building to fall back on? You want people to ignore all of that and buy a golf buggy?\n That’s what Elon faced when forming Tesla. It takes a special type of crazy person (meant in the most endearing way), to even think something like that would be possible.\n Elon made it happen with a shitload of money, a very healthy dose of luck, and because he’s a once in a generation entrepreneur.\n Most people don’t make this happen. Most good solid companies are started with a slight point of difference, a cool story, a good brand and a well timed offering. They won’t drastically change people’s buying behavior. This is especially true for underfunded entrepreneurs, who already have an enormous marketing challenge just to make people aware that they exist.\n As far as making people completely change their habits as a consumer? Good luck with that. Much better to provide a solution where customers are already paying for a solution.\n  At the risk of repeating everything I said in  The 7 Day Startup, it’s a very bad idea to make decisions based on assumptions instead of actual customer data. A founder’s only goal in starting a new business should be to get a viable product or service into the customers’ hands as soon as possible.\n This is a roadblock that new entrepreneurs have a huge issue with. It’s so much easier to just post a link in a Facebook group and ask for feedback, or jump on a mastermind call and discuss what hypothetically the customer might want.\n I don ’t want to downplay this mistake because it ’s an excruciatingly difficult challenge. It ’s not as simple as putting out a shit product and hoping for the best. Products have to be good (viable), if they don ’t look good and feel good and solve a proper problem and provide a different enough experience to what people are used to (without changing major behaviours), then they probably aren ’t viable. So how do you create something with all of those  ...\n But the alternative is pissing around for months, or years on ‘potential ’ideas fabricating hypothetical scenarios in your head based on assumptions, that only delay the inevitable. Having customers tell you they hate your idea, or not pay for it, or even worse, not being able to find customers, really sucks. But there ’s something that sucks way harder. Spending months or years of your life on the wrong idea and ultimately having it fail. I ’ve done  ...\n  This one shouldn’t come as a huge surprise, but there does have to be something interesting about your product or service offering. It doesn’t have to be a major change, in fact massive changes could do a lot more harm than good, it just has to be worth talking about. When I look back at my failed ideas, they weren’t particularly interesting. When I look at the few that have gone well, they’ve all had some little point of difference.\n And the thing that is interesting has to be interesting to the customer, not just to you. This is why I think sometimes it’s a bad idea for entrepreneurs to “scratch their own itch”. It’s super easy to be interested in your own shit. It’s way harder to get people to part with their money to purchase something that they were otherwise not planning on purchasing. There has to be something in your idea that is interesting to talk about.\n In my case my WordPress support business was the first of its kind to offer a monthly recurring fixed price service that was traditionally either invoiced hourly or quoted for larger jobs. It’s not a massive change, I was doing WordPress support for years and years before WP Curve. But I’d never done human services for a fixed monthly cost, and others in the industry hadn’t done much of it either, and that idea was interesting.\n In the brewing world I can apply the same methodology. The brewers that have done well all have something interesting about what they are doing. Whether it’s a cool founding story, excellent branding that grabs attention, or just awesome experimental beers that drive people to talk about them. The good ones are all doing something interesting.\n If what you are doing isn ’t especially interesting to your customers, it ’s going to be very difficult. And if you aren ’t sure, look at what your customers are saying about it. And I don ’t mean in reply for a testimonial request. Look at the words they use, how they use the product, how they say it ’s different, how excited about it are they. That will give you some hints, just be wary of people ’s tendency to support their friends and be excited  ...\n  Humans are constantly getting advice from their surroundings, and new entrepreneurs are so easily influenced it really worries me. I see and hear so much awful advice given out to entrepreneurs in Facebook groups, and in mentoring sessions, and from friends and family etc. New entrepreneurs take it all in.\n Fuck advice. You don’t need it. You need awareness, and it’s very difficult to cultivate, especially when you are a new entrepreneur.\n But since you are seeking some kind of advice (otherwise why would you be reading this), here’s my advice on taking advice:\n If you need advice, give a lot of thought to why. Are you not qualified to do this? Do you not have enough expertise in your founding team? Do you not have the courage to make your own decisions? Do you want to seek permission from someone?\n  Try to avoid taking business advice from people who say they are experts. People who are good at business, spend their time running their businesses, not “educating” others on how to run theirs.\n Look for category-specific advice. If you find someone who is epic at email marketing, it makes sense to get some advice on that topic, but don’t hero worship someone into thinking they are a suitable person to give you advice on all topics.\n Don’t take the approach of asking questions and taking the answer as a solution. Instead gather data and be an entrepreneur and make your own decisions. The best places to gather data is to talk with your team or co-founders (if you have them), or talk to or observe your customers interacting with your offering.\n Do what feels right, sorry I can’t do better than that but if it feels right it probably is.\n  Firstly thanks for reading this article. Is your business likely to fail? I don’t know, only you can know that but I hope these thoughts help you with that decision. And while I don’t want to glorify failure, moving from an idea that doesn’t work for you to one that does is a beautiful thing. It’s a scary move, but maybe it’s the right move.", "posttime": "2020-05-04 04:29:34", "tags": "商业,想法,business", "title": "你的商业想法可能会失败的迹象", "title_en": "Signs that your business idea will probably fail", "transed": 1, "url": "https://dannorris.me/9-signs-that-your-business-idea-will-probably-fail/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["商业", "想法", "business"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000522, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一支由反叛植物学家组成的日益崛起的国际力量手持粉笔在街头涂鸦，以突显生长在欧洲各地城镇小径和墙壁裂缝中的多样化但受到压迫的植物群的名称和重要性。从法国开始，给所到之处的野生植物命名的想法已经像病毒一样传播开来，人们用粉笔在社交媒体上分享自己的照片。超过12.7万人点赞了伦敦郊区一张用粉笔写下的树木名称的照片，而一段视频……。\n普雷塞克告诉“卫报”：“我想提高人们对人行道上这些野生植物的存在、知识和尊重的认识。那些从未花时间观察这些植物的人现在告诉我，他们的观点已经改变。从那以后，学校就联系我，与城市里的学生一起研究自然。“。\n法国从2017年起禁止在公园、街道和其他公共场所使用杀虫剂，并从2019年起禁止在花园中使用杀虫剂，导致该国对城市野花的认识激增。\n居住在伦敦的法国植物学家和活动家索菲·勒吉尔(Sophie Lguil)在帮助推广由特拉·博塔尼卡(Tela Botanica)领导的法国Sauvages de ma rue(“我的街道的野生事物”)粉笔运动后，发起了“不止杂草”活动，以改变人们对英国城市植物的看法。她已经获得许可，可以在哈克尼的高速公路上划上粉笔，并开辟粉笔小径，以突出我们脚下被遗忘的植物，并要求其他议会也允许这样做。\n本周，“卫报”(Guardian)的“灭绝时代”(Age Of Extinction)遗址着眼于世界各地城市和城市地区的生物多样性，将人们的目光投向隐藏在高楼大厦和繁忙道路之间、被低估的自然界。\n大约55%的世界人口居住在城市地区，预计到2050年，这一数字将上升到68%。自然在数十亿人的福祉和幸福中的作用将比以往任何时候都更加重要。虽然城市化是生物多样性丧失的主要驱动因素，但许多自然资源保护者和城市规划者正试图让建成区变得更加自然友好。城市绿地的作用甚至已经在一份阻止和扭转生物多样性丧失的联合国协议草案中正式确定，……。\n冠状病毒的爆发导致世界各地的城镇进入封锁状态，这使得野猪、鹿、猴子、狐狸甚至狮子等野生动物得以冒险进入以前由人类主导的领土。它还为我们提供了以前所未有的方式关注和欣赏城市自然世界的机会。\n在这一系列特别报道中，我们将关注动植物如何适应城市生活，现在需要注意什么，以及未来我们如何鼓励更多的野生城市。\n勒吉尔说：“法国的杀虫剂禁令发挥了重要作用，因为它迫使地方当局和人们的心态发生变化，并提高了人们的意识。”\n“我一直想在获得许可的情况下，在更大的范围内进行这项工作，我希望有更多的权威人士对创建步道感兴趣。”我们谈论了很多关于植物失明的问题--如果给植物命名可以让人们以不同的方式看待它们，那该怎么办？我对伦敦变得如此清洁感到绝望。植物可以有不同的管理方式，带来的好处是节约成本、生物多样性、教育。“。\n在英国，未经许可在小路或高速公路上用粉笔涂抹任何东西-跳房子、艺术或植物学名称-都是非法的，即使它能教育、庆祝和培养人们对大自然的兴趣和知识。\n一位匿名的伦敦树名Chalker说：“我每天散步时都会继续贴标签。我认为它真的深入到了人们现在所在的地方。\n“植物粉笔给人一种快速的自然联系，因为这些文字鼓励你抬起头来注意到你头顶上的树，树叶，树皮，昆虫，天空。”这些对心理健康都有好处。我们谁也管不了那么多--生活在一场全球大流行中已经足够让我们和睦相处了。但它给我带来了极大的快乐。“。\n英国植物园发言人特雷弗·迪恩斯表示，该慈善机构不能宽恕违法行为，但他补充说：“人们对涂鸦植物名称的反应令人难以置信，我认为这是某种深刻的东西的一部分。”这就好像植物在我们的世界中宣告了自己的位置。\n“在YouGov最近的一次民意调查中，16到24岁的人中只有6%的人能正确说出一张野生紫罗兰的名字。同一项民意调查显示，近70%的受访者希望能够辨认出更多的野花。\n他建议，随着喷洒和除草的减少，我们可能会在墙上和小路上看到多达400种植物。这是我们野生植物丰富度的10%。\n谢菲尔德的一项人行道调查发现183种不同的植物，剑桥的另一项调查发现墙上有186种植物。所有这些微小的壁龛组成了一幅极其复杂的挂毯，“Dines说。\n“每朵花都会计数，都会成为传粉者的目标--一小片荨麻上可能会长满毛毛虫。”而鸟爪草，一种并不少见的城市边缘植物，是一种更多的食用植物。", "note_en": "A rising international force of rebel botanists armed with chalk has taken up street graffiti to highlight the names and importance of the diverse but downtrodden flora growing in the cracks of paths and walls in towns and cities across Europe.  The idea of naming wild plants wherever they go – which began in France – has gone viral, with people chalking and sharing their images on social media. More than 127,000 people have  liked a photo of chalked-up tree names in a London suburb, while a  video  ...\n  Presseq told the Guardian: “I wanted to raise awareness of the presence, knowledge and respect of these wild plants on sidewalks. People who had never taken the time to observe these plants now tell me their view has changed. Schools have contacted me since to work with students on nature in the city.”\n France banned pesticide use in parks, streets and other public spaces in 2017 and in gardens from 2019, leading to a surge in awareness of urban wild flowers in the country.\n French botanist and campaigner Sophie Leguil, who lives in London, set up the  More Than Weeds campaign to change perceptions of urban plants in the UK after helping to spread the  Sauvages de  ma rue (“wild things of my street”) chalking campaign in France led by  Tela Botanica. She has won permission to chalk up Hackney’s highways and make chalk trails to highlight the forgotten flora at our feet and is asking other councils to allow the same.\n This week, the Guardian&#39;s Age of Extinction site is looking at biodiversity in cities and urban areas around the world, shining a spotlight on the under-appreciated world of nature hidden among the highrises and busy roads.\n Around 55% of the world ’s population live in urban areas and that number is projected to rise to 68% by 2050. Nature ’s role in the wellbeing and happiness of billions of people will be more important than ever. While urbanisation is a major driver of biodiversity loss, many conservationists and town planners are trying to make built-up areas more nature-friendly. The role of green spaces in urban areas has even been formalised in a draft UN agreement to halt and reverse biodiversity loss,  ...\n The Covid-19 outbreak has seen cities and towns across the world go into lockdown which has enabled wildlife such as wild boar, deer, monkeys, foxes and even lions to venture into territory previously dominated by humans. It has also offered us the chance to notice and appreciate the natural world in cities in an unprecedented way.\n In this special series of reports we&#39;ll be looking at how animals and plants adapt to city life, what to look out for right now and how we can encourage more wild cities in the future.\n “The pesticide ban in France has played a major role as it has forced local authorities and mentalities to change, and raised awareness,” said Leguil.\n “I’ve been wanting to do it on a larger scale, with permission, and I hope to get more authorities interested in creating trails. We talk a lot about plant blindness – what if putting names on plants could make people look at them in a different way? I despair at how sanitised London has become.  Plants can be managed differently, with benefits – cost-saving, biodiversity, education.”\n  In the UK it is illegal to chalk anything – hopscotch, art or botanical names – on paths or highways without permission, even if it educates, celebrates and fosters interest and knowledge in nature.\n One anonymous London tree name chalker said: “I’ll keep labelling as I go on my daily walks. I think it’s really tapped into where people are right now.\n “Botanical chalking gives a quick blast of nature connection, as the words encourage you to look up and notice the tree above you, the leaves, the bark, the insects, the sky. And that’s all good for mental health. None of us can manage that much – living through a global pandemic is quite enough to be getting on with. But it’s brought me a great amount of joy.”\n  UK Plantlife spokesman Trevor Dines said the charity could not condone breaking the law, but added: “The incredible response to graffiti plant names is astonishing and I think it’s part of something profound. It’s as if the plant is declaring its own place in  our world.\n “In a recent YouGov poll, just 6% of 16- to 24-year-olds were able to correctly name a picture of a wild violet. The same poll showed nearly 70% of respondents would like to be able to identify more wild flowers.”\n  With less spraying and weeding, we might expect to see up to 400 plant species on walls and paths, he suggests. That is 10% of our wild flora richness.\n “One survey of pavements in Sheffield found 183 different plants, another in Cambridge found 186 species on walls. All these little micro niches build up to a wonderfully complex tapestry,” Dines said.\n “Every flower counts and will be targeted by pollinators – a patch of nettles can be swamped with caterpillars. And bird’s-foot-trefoil, a not uncommon urban verge plant, is a food plant for more than 160 different invertebrates. If we change our perceptions and see the dandelion flower for what it is – an absolute lifeline to our bees in early spring – we might learn to love them more.”\n A  study by pollinator researchersrevealed that many wild urban “weeds ”rank very highly for the quantity of nectar and pollen each flower provides, often much higher than a variety of garden plants. The top trumps among the plants they measured included dandelions and their lookalikes –rough hawkbit, cat ’s-ear and sow-thistles –plus ragwort, viper ’s bugloss, mallows, self-heal, scentless mayweed, love-in-a-mist, wild mignonette, rosebay willowherb, thistles, creeping buttercup and  ...\n  Andrew Whitehouse, of conservation trust Buglife, said path and wall plants are also important as winter food sources when there is less blossom available for insects such as bumblebees. “Below the concrete, the roots create tiny microhabitats that support woodlice, worms, harvestmen, spiders, baby slugs and snails, which in turn become the food for birds and hedgehogs,” he added.\n Cllr Jon Burke, of Hackney Council, which has gone  pesticide-free in some areasand halved its use overall to increase wild flowers and boost insect biodiversity following public concern, said: “It is absurd that this chalking of plant names is criminal. It is something we welcome as an important and inspiring teaching tool for adults and children. How else will a kid ever know these names? The vocabulary of the natural world helps us access it, love it and desire to protect it. ” ...\n Criminal law expert James Gray of Drystone Chambers confirmed that chalking plant names in the UK is illegal without permission or “lawful excuse” and a rebel botanist could be fined up to £2,500 for painting or inscribing any picture, letter, sign, or other mark on a path, highway surface, tree or other structure.\n  Referring to Victor Hugo’s famous fictional police inspector, Gray added: “The Javerts of this world will see great harm in the scribbles of rogue botanists and call for prosecutions, others will see it as entirely harmless and perhaps even a refreshing diversion in our streets.”\n  He added: “Where the threshold lies will depend on the attitude of those charged with enforcing the law; beauty (or derangement) is in the eye of the magistrate.”\n Find more  age of extinction coverage here, and follow biodiversity reporters  Phoebe Weston and  Patrick Greenfield on Twitter for all the latest news and features", "posttime": "2020-05-04 04:07:31", "tags": "植物学家,botanists,植物,wild", "title": "反叛的植物学家正在用涂鸦来命名被遗忘的植物群。", "title_en": "Rebel botanists are using graffiti to name forgotten flora", "transed": 1, "url": "https://www.theguardian.com/environment/2020/may/01/not-just-weeds-how-rebel-botanists-are-using-graffiti-to-name-forgotten-flora-aoe", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["植物学家", "botanists", "植物", "wild"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000520, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "要继续，请单击下面的框，让我们知道您不是机器人。\n请确保您的浏览器支持JavaScript和Cookie，并且您没有阻止它们加载。有关更多信息，您可以查看我们的和。", "note_en": "To continue, please click the box below to let us know you&#39;re not a robot.\n  Please make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our   and  .", "posttime": "2020-05-04 04:05:38", "tags": "合乎,pay,click", "title": "太合乎道德是不值得的", "title_en": "It Doesn’t Pay to Be Too Ethical", "transed": 1, "url": "https://www.bloomberg.com/opinion/articles/2020-05-01/it-doesn-t-pay-to-be-too-ethical", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["合乎", "pay", "click"]}, {"category": "", "categoryclass": "", "imagename": "a6b7dfeae77440bf67ee16612eded030.jpg", "infoid": 1000519, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "包括冠状病毒数据在内的第一个华尔街财报季已经过去两周，大多数运营大型云部门的大型科技公司都公布了业绩。仅从增长率和营收数字来看，云计算似乎很好地经受住了冠状病毒风暴。AWS同比增长33%，季度营收首次突破100亿美元大关。Azure增长了59%，Google Cloud(包括GCP和GSuite)增长了52%，IBM的Cloud&amp；data Platforms类别.。\n但作为一个成熟的行业，云计算相对较新，尽管云计算作为一种形态因素和产品已经存在了20多年。LoudCloud(后来的Opsware)和Rackspace都是在互联网热潮破裂之前成立的。AWS于2006年与S3、SQS(简单队列服务)和EC2一起推出。\n目前冠状病毒引发的经济衰退，如果不是萧条，将是云计算行业首次成为大规模经济低迷的有意义的参与者。\n(注：在本文中，“云”指的是基础设施或平台即服务、IaaS或PaaS。它不包括基于云的SaaS产品，因为这些产品的类型和变体太多。)。\n在我们深入分析之前，让我们先建立一些通用定义和框架。\n华尔街有点技术性的金融定义是任何贝塔系数为负的东西。简而言之，它指的是任何价格走势与股市走势相反的证券；如果市场上涨，该证券就会下跌，反之亦然。黄金和美国国债就是典型的例子。比特币是更前卫、更不被理解的例子。\n还有一种更普通的方式来思考什么是不受衰退影响的。这是人们必须花钱的任何东西，不管经济有多糟糕，他们的个人财务状况有多糟糕。通常，这意味着公用事业(水电)、汽车保险以及食品和牙膏等基本消费品。\n当然，这些都是没有完全反映现实的启发式方法。一个常见的启发式方法是，酒精消费是不受衰退影响的。(当事情好的时候和坏的时候，你都会想喝醉。)。然而，某些学术研究表明，在2008年大衰退期间，酒精消费实际上有所下降。\n那么，我们应该如何评估云的抗衰退能力呢？如果我们想象每个云平台都是一家独立的公司，Investopedia的五个抗衰退公司特征似乎是这个练习的合理框架。如果你有以下特征之一，你就是一家抗衰退的公司：\n让我们看看云平台是否会具有这些特征中的一个或多个。\n不完全是。如果说有什么不同的话，那就是云平台更多地是这些关键维修服务的消费者。鉴于云基础设施对我们社会基本功能的重要性与日俱增，确实服务于云基础设施的业务(例如服务器和网络维护、数据中心的物理安全等)可能比云本身更能抵御衰退。无论哪种云的需求更大，即使整个行业都经历了彻底的.。\n不是的。某些云供应商可能是支持销售消费者必需品的商店的基础设施。显然，AWS本身现在是亚马逊的基础，亚马逊正在销售和交付许多消费者必需品。但大多数消费者并不知道或不关心他们的基本购物是否在云中进行。在整个互联网经济崩溃的世界末日场景中，人们将从实体选择中购买必需品。\n可能是吧。云的客户群广泛多样，从初创企业，到各行各业的大型企业，再到各级和规模的政府，不一而足。虽然其中一些客户在经济衰退期间会受到影响，但其他客户的需求会因为不同的原因而更大。展望当前经济衰退的未来，旅游公司和航空公司将不会使用那么多云，但Zoom、Slake和其他用于远程工作的产品将使用更多。许多初创企业和中小企业。\n不怎么有意思。对于许多企业来说，使用云可能是个好主意，但它不是边境或海关控制、上市公司的财务审计或石油管道检查。这类防衰退服务通常依附于特定的法律或法规，这些法律或法规要求它们定期发生，无论经济发生了什么。使用云是一种商业选择，绝不是要求或强制要求。\n很有可能。这是一个棘手的问题。云平台上发生的事情是由开源和专有技术混合提供支持的。一些数据中心设计是开源的，是开放计算项目的一部分。大多数硬件都是从销售专有技术的供应商那里获得的。M", "note_en": "Two weeks into the first Wall Street earnings season that includes COVID-19 data, most big tech companies that operate a large cloud unit have reported results. Judging from the growth rate and revenue numbers alone, the cloud seems to be weathering the coronavirus storm just fine. AWS grew 33% year-over-year and  hit the $10 billion USD quarterly revenue mark for the first time. Azure  grew by 59%, Google Cloud (includes both GCP and GSuite)  grew by 52%, and IBM ’s Cloud &amp; Data Platforms category  ...\n But as a full-fledged industry, the cloud is relatively new, even though cloud computing as a form factor and product has been around for more than two decades now.  Loudcloud (later Opsware) and  Rackspace were both founded before the dot com boom busted. AWS  was launched in 2006 with S3, SQS (Simple Queue Service), and EC2.\n The current COVID-19-induced recession, if not depression, will be the first time the cloud computing industry is a meaningful participant of a large-scale economic downturn.\n  (NOTE: in this post, “cloud” means either infrastructure or platform-as-a-service, IaaS or PaaS. It does not include cloud-based SaaS products, where there are too many types and variations.)\n  Before we dive into the analysis, let’s establish some common definitions and a framework first.\n  Wall Street&#39;s somewhat technical financial definition is anything that has a negative beta. In plain terms, it means any security whose price movement is opposite of the stock market’s; if the market goes up, that security goes down, and vice-versa. Gold and U.S. Treasury bonds are the classic examples. Bitcoin is the more edgy, less understood example.\n There’s also a more Main Street way to think about what is recession-proof. It’s anything that people must spend money on, regardless of how bad the economy is and how bad their personal financial situation is. Typically, that means things like utilities (electricity and water), car insurance, and essential consumer products like food and toothpaste.\n Of course, these are all heuristics that do not reflect reality completely. One common heuristic is that alcohol consumption is recession-proof. (You’d want to get drunk when things are good and when things are bad.) However, certain academic study has shown that alcohol consumption  actually decreased during the 2008 Great Recession.\n So how should we evaluate the cloud’s recession-proof-ness? Investopedia’s  five characteristics of a recession-resistant company seems to be a reasonable framework for this exercise, if we imagine each cloud platform to be an independent company. You are a recession-resistant company, if you have  one of the following characteristics:\n  Let’s see if a cloud platform would have one or more of these characteristics.\n  Not really.If anything, cloud platforms are more the consumer of these critical repair services. Given the increasing criticality of the cloud infrastructure to the essential functions of our society, the businesses that do serve the cloud infrastructure, e.g. server and network maintenance, physical security of data centers, etc., may be more recession proof than the cloud itself. Regardless of which cloud is more in demand, and even if the whole industry experiences a categorical  ...\n  No. Certain cloud vendors may be the infrastructure that support the stores that  do sell consumer essentials. Obviously, AWS itself is now the foundation to Amazon.com that  is selling and delivering many of the consumer essentials. But most consumers don’t know, or care, if their essential shopping is happening in the cloud or not. And in an apocalyptic scenario where the entire Internet economy collapses, people will adap and buy essential goods from brick and mortar options.\n  Probably yes. The customer base of the cloud is broad and diverse, from startups, to larger enterprises from all industries, to governments of all levels and sizes. While some of those customers will suffer during a recession, others will be more in demand for different reasons. Projecting into the future of our current recession, travel companies and airlines won ’t be using as much cloud, but Zoom, Slack, and other products used for remote work will use more. Many startups and SMBs  ...\n  Not really. Using the cloud may be a good idea for many businesses, but it’s not border or custom control, financial audits of public companies, or oil pipelines inspection. This category of recession proof services are typically attached to specific laws or regulations that require they happen regularly, no matter what’s happening to the economy. Using the cloud is a business choice, by no means a requirement or mandate.\n  Quite possibly. This is a tricky one. What happens on a cloud platform is powered by a mixture of open source and proprietary technology. Some of the data center designs are open sourced as a part of the Open Compute Project. Most of the hardwares is acquired from vendors selling proprietary technologies. Most of the fundamental software components are open sourced at their core, but tied together with proprietary code that works differently in one cloud versus another. The core  ...\n  If you don’t find this analysis unsatisfying, you are not alone. I’m not either. (And if you came to this post looking for recession proof stock picks, I’m sorry to disappoint you.) There isn’t an established category of recession proof businesses that fully captures all dimensions of the cloud industry.\n The cloud is part utilities, part commercial real estate, part railroad, and part something new that warrants its own framework.  (I welcome your input to develop a better analytical framework together.)\n There are also few data points that can help us understand and model how cloud platforms will perform during a recession. This COVID-19 recession will be the first one.\n Lastly, even if we do have a framework and enough information to establish that cloud platforms are indeed recession proof, it’s hard to invest in them in a targeted way. All the big cloud vendors are parts of bigger tech conglomerates. And the financials around their cloud units are inconsistent and convoluted -- Microsoft, Google, IBM, Oracle all have their own definition and “spin” on what should be considered “cloud”, which is  a point of frustration I’ve written about  many  ...\n Until Amazon decides to break AWS away into a separate entity, or when a cloud startup like  Digital Ocean eventually go public, just investing in cloud computing platforms in the public market is difficult. The best you can do is invest in one of the big tech companies with a cloud or a data center colocation company like Equinix.\n All the dissatisfactions aside, how the entire cloud industry will fare during this current crisis is worth watching and learning from, if only to prepare for the next recession. And there will be another recession.\n If you like what you&#39;ve read, please  SUBSCRIBE to the Interconnected email list. New posts will be delivered to your inbox (twice per week). Follow and interact with me on:  Twitter,  LinkedIn.\n     包括疫情数据在内的第一个华尔街财报季已经进行两周了。大多数运营大规模云计算业务的科技巨头都公布了财报。从增长率和收入数字来看，云似乎正在安然度过冠状疫情导致的经济风暴。AWS年同比增长33%， 首次达到100亿美元的季度收入大关。Azure 增长了59%，Google Cloud（包括GCP和GSuite） 增长了52%，IBM的Cloud &amp; Data Platforms类别（包括Red Hat） 增长了32%。阿里巴巴和Oracle尚未公布盈利情况。\n 但作为一个行业，云计算相对还是个新生事物，没有那么成熟，尽管云计算作为一种形式和产品已经存在20多年了。 Loudcloud（后来是Opsware）和 Rackspace都是在互联网泡沫破灭之前成立的。AWS是 2006年正是启动的，当时只有包括S3、SQS和EC2。\n 当前由COVID-19引发的经济衰退，甚至是大萧条，将是云计算行业第一次“参与”一个大规模的经济衰退。\n 既然目前还在不断增长云行业是否能够抵御衰退？\n （声明一下：本文中的“云”指的是IaaS或PaaS，而不包括基于云上的SaaS产品，因为其中种类太多。）\n  在开始分析之前，我们先建立一些通用的定义和思考框架。\n 什么样的企业能避免经济衰退的影响？\n 华尔街有个偏技术性的定义：任何有负beta的公司。简单地说就是任何价格变动与股市相反的东西；如果股市上涨，它就会下跌，反之亦然。黄金和美国国债就是典型的例子。比特币是一个更前卫、更难理解的例子。\n 还有一种更贴近老百姓日常生活的定义。那就是不管经济有多糟糕，个人财务状况有多糟糕，人们都必须买的东西，通常包括水电、汽车保险以及食品和像牙膏这种基本消费品。\n 当然，这些定义和例子都是各种“估算”，不能完全反映现实。一个常被提到的不受经济衰退的消费品就是酒。（日子好过要喝酒庆祝，日子不好过要喝酒解愁。）然而，一些学术研究发现，在2008年经济大萧条期间，在酒水上的 消费其实减少了。\n 那么，我们应该如何评估云的“抗经济衰退”性呢？如果我们把每个云平台都想象为是一家独立的公司，Investopedia 的抗衰退公司的 五大特征算是个合理的框架。只要有以下特征的其中一个，你就是一家能抗经济衰退的公司：\n  让我们看看一个云平台有没有这些特性。\n  Not really. 一个云更像是这些关键维修服务的消费者。鉴于云基础设施对社会基本运作的重要性在日益增加，为云提供服务的业务（如服务器和网络维护、数据中心安全保护等）可能比云本身更能抵御经济衰退。不管那个云厂商对用户更有吸引力，即使整个云行业都经历了一次彻底的衰退， 维护和保护这些云设施的服务应该不会停止。\n  No. 某些云厂商可能是某些卖消费者必需品的电商的基础设施。AWS本身就是Amazon电商的基础设施，也是许多消费者的购买必需品的地方。但大多数消费者不知道，也不关心他们购物的地方是否在用云。就算是世界末日，整个互联网经济崩盘，人们也会适应环境回到实体店购买必需品。\n  Probably yes. 云计算的客户种类多种多样，从初创企业到各行业的大型企业，到各级政府部门。虽然这些客户中的一些公司会在经济衰退期间遭受损失，但其他公司也会有更多的市场需求。如果看看目前的经济衰退，旅游公司和航空公司将不会使用那么多云计算，但Zoom、Slack和其他用于远程办公的产品将使用更多云计算。许多初创企业和中小型企业将被关闭，但医疗行业、疫苗研究和某些政府服务， 如申请失业保险，将需要更多的资源。这种转变可能不是完全成比例的，但云计算提供的资源的长期使用和消耗是不变的。\n  Not really. 对许多企业来说，使用云计算可能是个好主意，但云计算不能和边境或海关监控、对上市公司的财务审计或石油管道检查的必须性相提并论。这类抗经济衰退服务通常于某条法律或法规挂钩，无论经济状况怎么样，都必须继续。用不用云是个商业选择，不是个要求或指令。\n  Quite possibly. 这类产品分析起来有点复杂。在一个云平台上发生的事情是由开源和专有技术的混合驱动的。某些数据中心设计是开源的，是Open Compute Project的一部分。大多数硬件都是从专有技术的供应商买来的。大多数基本的软件组件的核心都是开源的，而把它们链接并运作起来的代码是专有的，之所以每个云平台的运作都有些不同。云为客户提供的核心价值是多维的：有些是技术、有些是运营、有些和财务有关。在经济衰退期间，对每个维度的影响都不同。那么那作为一种产品，云是否具有足够的专有性或专业性，足以让客户在经济低迷时期维持，甚至增加，在云上的支出？很有可能。\n  如果你对这篇分析的结果不满意，我同意。我也不满意。（如果你看这篇文章的目的是寻找不受经济衰退影响的股票，很抱歉我让你失望了。）目前还没有一个不受衰退影响的业务的分析框架能够完全涵盖整个云行业的所有方面。\n 一个云，部分像水电，部分像商业房地产，部分像铁路，部分完全新的事物，需要自己独特的分析框架。 （我欢迎大家的意见，共同想个更好的分析框架。）\n 目前也没有足够的数据能帮助我们理解和模拟云平台在衰退期间的业务表现。这次冠状疫情导致的衰退将是第一次。\n 即使我们有一个靠谱的框架和足够的信息来证明云确实能抵御经济衰退，也很难有针对性地对其进行投资。所有大型云厂商都是一个更大的巨头下的一部分。围绕其云计算部门的财务也不够一致，错综复杂。微软、谷歌、IBM、Oracle对云的定义都有自己“风格”。 对这一点的不满， 我之前多次写过。\n 除非Amazon那天决定将AWS拆分成一个独立的实体，或者Digital Ocean这样的云平台初创 企业那天上市，否则在股市上投资云计算平台是很困难的。能做的顶多就是投资一家有云计算的巨头，或者像Equinix这样的数据中心托管公司。\n 撇开所有的不满不谈，整个云产业在当前危机中将会表现如何，还是非常值得关注和学习。就算是为下一次衰退做准备，因为绝对还会有另一场经济衰退。\n 如果您喜欢所读的内容，请用email 订阅加入“互联”。新文章将会直接送到您的收箱（每周两次）。请在 Twitter、 LinkedIn上给个follow，跟我互动交流！", "posttime": "2020-05-04 03:44:36", "tags": "衰退,recession,cloud", "title": "云衰退是不是不受影响？", "title_en": "Is the Cloud Recession-Proof?", "transed": 1, "url": "https://interconnected.blog/is-the-cloud-recession-proof/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["衰退", "recession", "cloud"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000518, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2x1000 MP/秒4x 4K@60(HEVC)8x 4K@30(HEVC)16x 1080P@60(HEVC)32x 1080P@30(HEVC)。\n2x690 MP/秒2x 4K@60(HEVC)4x 4K@30(HEVC)12x 1080p@60(HEVC)24x 1080p@30(HEVC)16x 1080p@30(H.264)。\n2x1500 MP/秒2x 8K@30(HEVC)6x 4K@60(HEVC)12x 4K@30(HEVC)26x 1080p@60(HEVC)52x 1080p@30(HEVC)30x 1080p@30(H.264)。\n3x USB 3.1、4x USB 2.0 1 x8或1 x4或1 x2或2 x1 PCIe(第3代)。\n3x USB 3.1、4x USB 2.0 1 x8或1 x4或1 x2或2 x1 PCIe(第四代)", "note_en": "2x1000 MP/sec 4x 4K @ 60 (HEVC) 8x 4K @ 30 (HEVC) 16x 1080p @ 60 (HEVC) 32x 1080p @ 30 (HEVC)\n  2x690 MP/sec 2x 4K @ 60 (HEVC) 4x 4K @ 30 (HEVC) 12x 1080p @ 60 (HEVC) 24x 1080p @ 30 (HEVC) 16x 1080p @ 30 (H.264)\n  2x1500 MP/sec 2x 8K @ 30 (HEVC) 6x 4K @ 60 (HEVC) 12x 4K @ 30 (HEVC) 26x 1080p @ 60 (HEVC) 52x 1080p @ 30 (HEVC) 30x 1080p @ 30 (H.264)\n    3x USB 3.1, 4x USB 2.0 \r1 x8 or 1 x4 or 1 x2 or 2 x1 PCIe (Gen3)\n  3x USB 3.1, 4x USB 2.0 \r1 x8 or 1 x4 or 1 x2 or 2 x1 PCIe (Gen4)", "posttime": "2020-05-04 03:44:29", "tags": "nvidia,开发,内存,agx,mp", "title": "NVIDIA AGX Xavier开发套件：更新32 GB内存，售价699美元", "title_en": "Nvidia AGX Xavier Developer Kit: Refreshed with 32GB of RAM, for $699", "transed": 1, "url": "https://www.nvidia.com/en-us/autonomous-machines/embedded-systems/jetson-agx-xavier/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["nvidia", "开发", "内存", "agx", "mp"]}, {"category": "", "categoryclass": "", "imagename": "e1db85aae5d295ff754e6e3cdf7acf9d.jpg", "infoid": 1000517, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据加州房地产经纪人协会(California Association Of Realtors)的数据，2019年旧金山湾区现有独户住宅的价格中值自2011年以来首次出现全年下降。\n房价中值降至92.8万美元，较2018年的95万美元下降了2.3%。\n推高房价的力量-该地区蓬勃发展的经济、长期的住房短缺和备受期待的首次公开募股(IPO)洪流-被负面因素所抵消，包括负担能力紧张、外流到成本更低的地区，以及针对住房拥有者的联邦税收减免缩减。\n该协会的数据不包括未加入多重挂牌服务的共管公寓、新建建筑和住宅。\n在旧金山湾区的九个县中，圣克拉拉的房价跌幅最大，为5.6%。然而，房地产经纪公司Compass的首席市场分析师帕特里克·卡莱尔(Patrick Carlisle)表示，这是前一年最强劲的一年，上涨了13.5%。\n他说，奥克兰-伯克利(Oakland-Berkeley)是去年最强劲的子市场，吸引了寻求比旧金山更低成本的“城市氛围”的买家。\nAbio Properties经纪人香农·普罗库普(Shannon Prokup)上周六和周日在伯克利阿什比大道(Ashby Avenue)挂牌的一套房子吸引了400多人参加开放日，这让她大吃一惊。这栋房子有两间卧室、一间浴室和1100平方英尺(约合223平方米)；售价为82.5万美元(约合人民币217万元)。“我没想到会有这么多人参加，”她说。但是“市场上没有一吨低于一百万美元。而且利率仍然很低。“。\n然而，整个阿拉米达县的价格去年下降了2.1%。马林县、圣马特奥县和索诺马县的价格也有所下降，但孔特拉科斯塔、纳帕县和索拉诺县的价格略有上涨。旧金山的房价中值为160万美元，即使到了2018年也是死气沉沉的。\nCarlisle说，旧金山的中间价在2019年第二季度创下新高，“可能是受IPO炒作的推动”。\n旧金山一系列大型公司上市，从3月份的Levi Strauss和Lyft，4月份的Pinterest，5月份的优步和6月份的Slake开始。这些公司的大多数员工，除了以直接上市方式出售股票的Slake之外，都被禁止在长达六个月的时间内出售股票。\n在3月和4月，“一群人说，‘我现在不打算卖，我会等到百万富翁出来。’然后有买家说，‘我们现在就需要买进，然后才能与所有这些百万富翁竞争，’“Carlisle说。“由于卖家在等待百万富翁，而买家试图抢先百万富翁进入市场，第二季度的情况变得更加糟糕。”\n而且不仅仅是在旧金山。东湾Abio Properties的联合创始人林妮特·爱德华兹(Linnette Edwards)表示：“这股热潮发生在一切都进行首次公开募股(IPO)之前。”“我有一些买家在IPO之前坚决要买房，”其中包括一对夫妇，他们当时正期待着一个孩子。“他们称之为婴儿IPO，”她说。\n旧金山的Compass经纪人杰森·巴托夫(Jason Buttorf)有一个客户，他为Slake工作。他和他的妻子多年来一直在金门高地租房，并看中了那里的房子。今年7月，在Slake上市后不久，他们的“梦想之家”上市，他们以超过250万美元的价格抢购一空。\n然而，到秋天来临时，市场“出奇地平静和平静，”巴托夫说。\n卡莱尔表示同意。“炒作对(市场)的影响可能比现实更大，”他说。\n价格通常在春季和夏季达到峰值，在秋季和冬季下降。房地产经纪人协会(Realtor Association)副首席经济学家乔丹·莱文(Jordan Levine)表示，与去年同期相比，湾区下半年的房价表现好于上半年，主要是因为利率下降。\n但毫无疑问，市场已经降温。旧金山湾区一套独栋现房的价格中值从2006年的72.7万美元下降到2009年的43万美元。2010年上升到50万美元(部分归功于首次购房者的信贷)，然后在2011年再次下降，降至46万美元。在那之后，它开始了一系列平流层的增长，使其在2018年达到95万美元。\nLevine说：“随着经济回暖，旧金山湾区的房价迅速反弹，那里的经济表现优于各州和全国。”“随着物价上涨，可负担性变得更成问题，这限制了一些物价升值.”\n他补充说，2018年生效的联邦税收改革也“与过去相比增加了购房成本”。国会将2017年后发放的贷款的抵押贷款利息扣除从100万美元降至75万美元的利息。它还将之前对所有州和地方税(包括所得税和财产税)的无限制扣除上限定为1万美元。\n“你可以看到这起到了一定作用，特别是在旧金山湾区，那里的大多数房主都将受到这些上限的影响，”Levine说。但是，他补充说，你不能全部归咎于税收变化。“我们已经看到", "note_en": "The median price paid for an existing, single-family home in the Bay Area fell in 2019 for the first full year since 2011, according to data from the California Association of Realtors.\n  The median price, the point at which half of homes sold for more and half for less, fell to $928,000, down 2.3% from $950,000 in 2018.\n  Forces pushing prices up — the region’s booming economy, chronic housing shortage and a hotly anticipated flood of initial public offerings — were offset by negative factors, including strained affordability, outmigration to cheaper locales and shrinking federal tax breaks for homeownership.\n  The association’s numbers do not include condominiums, new construction and homes that were not entered into a multiple listing service.\n  Of the nine Bay Area counties, Santa Clara had the biggest price drop, 5.6%. However, it had been the strongest the year before, rising 13.5%, said Patrick Carlisle, chief market analyst with Compass, a real estate brokerage.\n  Oakland-Berkeley was the strongest submarket last year, attracting buyers seeking an “urban ambience” at a lower cost than San Francisco, he said.\n  Abio Properties agent Shannon Prokup was stunned when a home she listed on Ashby Avenue in Berkeley attracted more than 400 people at open houses last Saturday and Sunday. The home has two bedrooms, one bathroom and 1,100 square feet; it is priced at $825,000. “I was not expecting that kind of turnout,” she said. But “there is not a ton on the market under a million dollars. And interest rates are still low.”\n  Prices in all of Alameda County, however, fell 2.1% last year. Prices were also down in Marin, San Mateo and Sonoma counties but up slightly in Contra Costa, Napa and Solano counties. San Francisco’s median price, $1.6 million, was dead even with 2018.\n  The median price in San Francisco hit a high in the second quarter of 2019, “probably driven by IPO hype,” Carlisle said.\n     A string of large San Francisco companies went public, starting with Levi Strauss and Lyft in March, Pinterest in April, Uber in May and Slack in June. Most employees of these companies, except for Slack, which sold shares in a direct listing, were prohibited from selling their shares for up to six months.\n  In March and April, “A bunch of people said, ‘I’m not going to sell now, I’ll wait until the millionaires come out.’ Then there were buyers who said, ‘We need to buy now before we are competing with all these millionaires,’” Carlisle said. “The second quarter got exacerbated by the sellers waiting for the millionaires and buyers trying to beat millionaires to the market.”\n  And it wasn’t just in San Francisco. “The rush happened before everything went IPO,” said Linnette Edwards, co-founder of Abio Properties in the East Bay. “I had buyers who were adamant about buying before the IPOs,” including one couple that was expecting a baby. “They called it baby IPO,” she said.\n     Jason Buttorf, a Compass agent in San Francisco, had a client who works for Slack. He and his wife had been renting in Golden Gate Heights and eyeing homes there for years. In July, shortly after Slack went public, their “dream home” came on the market and they snapped it up for over $2.5 million.\n  By the time fall rolled around, however, the market “was mysteriously quiet and uneventful,” Buttorf said.\n  Carlisle agreed. “The hype might have affected (the market) more than the reality,” he said.\n  Prices typically peak in the spring and summer and decline in the fall and winter. On a year-over-year basis, Bay Area home prices did better in the second half than the first, largely because interest rates declined, said Jordan Levine, the Realtor association’s deputy chief economist.\n  But there’s no doubt that the market has cooled. The median price paid for a single-family existing home in the Bay Area fell from $727,000 in 2006 to $430,000 in 2009. It rose to $500,000 in 2010 (thanks in part to a first-time home buyer credit), then dropped again in 2011, to $460,000. After that it embarked on a string of stratospheric increases that brought it to $950,000 in 2018.\n  “As the economy picked up, home prices in the Bay Area, where the economy was outperforming the state and nation, bounced back very quickly,” Levine said. “As prices have risen, affordability has become more of a problem, which limits some price appreciation.”\n  Federal tax changes that took effect in 2018 have also “increased the cost of homeownership compared to what it was in the past,” he added. Congress reduced the mortgage interest deduction on loans originated after 2017 to interest on $750,000 in debt, down from $1 million. It also capped the previously unlimited deduction for all state and local taxes combined, including income and property taxes, at $10,000.\n  “You are seeing that play a role, particularly in the Bay Area, where most homeowners are going to be impacted by those caps,” Levine said. But, he added, you can’t blame it all on tax changes. “We have seen the pace of growth slowing for several years.”\n  For the month of December only, the median price paid for a single-family, existing home in the Bay Area was $908,750, down 1.8% from November but up 6.9% from December 2018, according to numbers  released Friday by the Realtors association.\n  “December and January are almost always the lowest prices of the year,” Carlisle said. “The whole market is seasonal but the luxury market is fiercely seasonal.” High-end sellers leave for the holidays and take their homes off the market, assuming high-end buyers have also left. As a result, the market gets dominated by lower-end sales, which pulls down the median price.\n  The median price paid for a single-family home in San Francisco fell to $1.45 million in December, down 10.4% from November and down 3.3% from December 2018. That was the worst showing of any Bay Area county.\n  On a year-over-year basis, the December median price was up 3.7% in Alameda County, 8.6% in Contra Costa, 2.3% in Marin, 5.5% in Napa, 6.5% in Santa Clara, 7.2% in Solano and 1.3% in Sonoma. It fell 0.5% in San Mateo.\n  For the state as a whole, Levine predicts that low interest rates will continue to bolster buyer demand but shrinking inventories will keep sales from rising more than 1% or 2% this year. “We see price growth in the mid-single-digit range.”\n  Whether the Bay Area does better or worse than the state “is a tough call,” he said. The Bay Area “has upward momentum from the demand side,” as job growth keeps unemployment near record lows. But the inventory shortage is even more acute in the Bay Area, “which is spilling over to the demand side,” with people leaving the area in search of cheaper housing.\n  Kathleen Pender writes the Net Worth column in The San Francisco Chronicle. She explains how the big business and economic news of the day affect a household&#39;s net worth. She covers saving, investing, debt, taxes, housing, mortgages, retirement plans, employment and unemployment with a focus on issues specific to California and the Bay Area.\n When it comes to big financial decisions, she believes that the simplest answer is almost always the best and that people would stay out of money trouble if they didn&#39;t get involved in things they can&#39;t understand. Pender welcomes questions from readers and frequently answers them in her column.\n She majored in business journalism at the University of Missouri-Columbia and was a Knight-Bagehot fellow in business journalism at Columbia University.", "posttime": "2020-05-04 03:22:25", "tags": "旧金山,湾区,房价,area,价格", "title": "旧金山湾区房价中值自2011年以来首次年度下降", "title_en": "Bay Area median home price first annual drop since 2011", "transed": 1, "url": "https://www.sfchronicle.com/business/networth/article/Bay-Area-median-home-price-fell-2-3-last-year-14985353.php", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["旧金山", "湾区", "房价", "area", "价格"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000516, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个次要版本是使LibrePCB功能更强大和提高用户界面可用性的又一个重要步骤。\n用户界面进行了许多可用性改进，使创建库和项目更有效率。例如，原理图编辑器和电路板编辑器现在分别允许搜索符号。设备(#671)：\n此外，长度值(线宽、钻孔直径、坐标等)的所有输入字段。现在显示在工作空间设置中配置的单元中(#684)。每个输入域的单位甚至可以单独更改，并自动保存和恢复。现在您可以输入数学表达式，并可以选择附加一个单位(例如“mm”)，然后将对其求值：\n此版本增加了拾取与放置CSV文件导出(#639)，因此LibrePCB现在也适用于设计将由拾取与放置机器组装的PCB：\n此外，原理图和电路板(#656)都实现了SVG导出。这允许在矢量图形工具中为各种目的处理它们。\n±propos文件导出：BOM CSV导出现在用逗号分隔，而不是分号分隔(#678)。这提高了与CSV读取器的兼容性。\nLibrePCB 0.1.4对项目使用的文件格式与所有之前的0.1.x版本完全相同，因此完全兼容。\n然而，以前的版本有一个错误，允许在NetNames中有换行符(#603)。这在0.1.4中已经修复，因为我们预期(或希望…)。没有项目受到此错误的影响，没有实现自动升级机制。如果您仍然遇到无法使用LibrePCB 0.1.4打开项目的问题，则需要手动修复受影响的网络名称。请不要犹豫与我们联系，以获得迁移方面的帮助。\n2020-05-03", "note_en": "This minor release is one more important step to make LibrePCB more powerfuland to improve usability of the user interface.\n   The user interface got many usability improvements to make creating librariesand projects more efficient. For example the schematic- and board editors nowallow searching for symbols resp. devices( #671):\n  Furthermore, all input fields for length values (line width, drill diameter,coordinate etc.) are now displayed in the unit configured in the workspacesettings ( #684). The unit ofeach input field can even be changed individually and gets saved and restoredautomatically. And you can now enter mathematical expressions and optionallyappend a unit (e.g. “mm”) which will then be evaluated:\n   This release adds a pick&amp;place CSV file export( #639) so LibrePCB is nowalso suitable to design PCBs which will be assembled by pick&amp;place machines:\n  In addition, an SVG export has been implemented for both, schematics andboards ( #656). This allows topostprocess them in a vector graphics tool for various purposes.\n À propos file export: The BOM CSV export is now comma-separated instead ofsemicolon-separated ( #678).This improves compatibility with CSV readers.\n  LibrePCB 0.1.4 uses exactly the same file format for projects as all previous0.1.x releases and are thus fully compatible.\n However, previous versions had a bug which allowed to have linebreaks in netnames ( #603). This has beenfixed in 0.1.4, and since we expect (or hope…) no projects to be affected bythis bug, no automatic upgrade mechanism has been implemented. If you stillrun into the issue that a project cannot be opened with LibrePCB 0.1.4, theaffected net names need to be fixed manually. Please don’t hesitate to contact us to get help with the migration.\n                     2020-05-03", "posttime": "2020-05-04 02:16:14", "tags": "发布,librepcb,现在,csv", "title": "LibrePCB 0.1.4发布", "title_en": "LibrePCB 0.1.4 Released", "transed": 1, "url": "https://librepcb.org/blog/2020-05-03_release_0.1.4/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["发布", "librepcb", "现在", "csv"]}]