[{"category": "", "categoryclass": "", "imagename": "e4bc290a41253db0e5d032b846d32d1f.jpeg", "infoid": 1003570, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国疾病控制和预防中心警告称，由于美国各地的餐厅仍在关门以减缓冠状病毒的传播，老鼠在寻找食物的过程中变得越来越咄咄逼人。\n由于许多餐厅现在只提供外卖服务，过去装满残渣和垃圾的垃圾箱已经变得空荡荡的多了-它们正变得绝望。\n一些司法管辖区报告说，随着啮齿动物寻找新的食物来源，啮齿动物的活动有所增加。美国疾病控制与预防中心在上周发布的报告中说，环境健康和啮齿动物控制项目可能会增加与啮齿动物有关的服务请求，以及关于不寻常或攻击性啮齿动物行为的报告。\n它建议封锁进入家庭和企业的通道，清除杂物和茂密的植被，将垃圾放在盖得严密的垃圾箱里，并将宠物和鸟食从院子里移走，以抵御害虫。\n据害虫控制公司Rentokil称，居民区附近啮齿动物活动的增加引起了卫生当局的关注，已知老鼠会传播包括沙门氏菌和韦尔氏病在内的疾病。\n在美国的几个主要城市，有报道称绝望的老鼠成群结队地在街上寻找食物。\n据哥伦比亚广播公司新闻报道，在社交媒体上的视频显示老鼠在通常挤满狂欢者的空荡荡的街道上奔跑后，新奥尔良当局发起了一场诱捕和扑灭啮齿动物的运动。这座城市的市长拉托亚·坎特雷尔(LaToya Canrell)说，这些老鼠快疯了。\n在纽约市，当局承诺加强与老鼠的斗争，有报道称，啮齿动物聚集在第六大道的垃圾中，甚至诉诸杀婴和吃人来生存。\n城市啮齿学家鲍比·科里根告诉“华盛顿邮报”，一位害虫专家在皇后区一场可怕的老鼠大战后给他寄来了一张照片。科里根认为，一群饥饿的老鼠相互攻击。人行道上只剩下一堆老鼠的四肢。", "note_en": "Rats are growing increasingly aggressive in their hunt for food as restaurants across the US remain shuttered to slow the spread of the coronavirus, the Centers for Disease Control and Prevention has warned.\n With many restaurants now only open for takeout services, the bins that used to be filled with scraps and refuse the rodents once feasted on are much emptier — and they are getting desperate.\n &#34;Some jurisdictions have reported an increase in rodent activity as rodents search for new sources of food. Environmental health and rodent control programs may see an increase in service requests related to rodents and reports of unusual or aggressive rodent behavior,&#34;  said the CDC in their release last week.\n   It advises that &#34;sealing up access into homes and businesses, removing debris and heavy vegetation, keeping garbage in tightly covered bins, and removing pet and bird food from their yards&#34; to ward off the pests.\n   The increased rodent activity around residential neighborhoods has health authorities concerned, with rats known to spread illnesses including salmonella and Weil&#39;s disease,  according to pest control firm Rentokil.\n In several major cities in the US, reports have emerged of desperate rats swarming the streets in the search for food.\n Authorities in New Orleans have launched a campaign to trap and kill the rodents,  reported CBS News, after videos on social media showed rats scurrying through empty streets usually thronged with revelers. The city&#39;s mayor, LaToya Cantrell, said the rats were going &#34;crazy.&#34;\n In New York City authorities have pledged to step up the fight against rats, amid reports of rodents swarming garbage on 6th Avenue and even  resorting to infanticide and cannibalism to survive.\n   Urban rodentologist Bobby Corrigan told  The Washington Post that a pest expert sent him a photo after a gruesome rat battle in Queens. A hungry nest of rats had turned on each other, Corrigan believes. A pile of rat limbs on the sidewalk was all that remained.", "posttime": "2020-05-25 05:20:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,食物,rats,啮齿动物", "title": "餐厅食物供应消失，饥饿的老鼠变成食人族", "title_en": "Starving rats turning into cannibals as restaurant food supply disappears", "transed": 1, "url": "https://www.businessinsider.com/coronavirus-hungry-rats-grow-aggressive-as-us-restaurants-remain-shut-2020-5", "via": "", "real_tags": ["app", "食物", "rats", "啮齿动物"]}, {"category": "", "categoryclass": "", "imagename": "de002d08a862da5e5e6bcde2e806c0b9.png", "infoid": 1003569, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于需求大幅下降，在经历了数周的艰难之后，汽车租赁巨头赫兹(Hertz)于周五深夜根据破产法第11章申请破产保护。自从冠状病毒危机开始以来，赫兹一直在努力让自己的头脱离债务，似乎该公司已经坚持了尽可能长的时间。它的二手车车队现在正在投放市场，一家公司的不幸很快就会成为一些购车者的杀手锏。\n据汽车新闻报道，在与债权人进行了紧张的一天谈判后，赫兹申请了破产法第11章的破产保护。虽然破产法第11章允许该公司继续运营，以解决如何偿还债务，并有望扭转业务，但这家汽车租赁公司的情况相当可怕：\n赫兹表示，它有10亿美元的现金来支持其业务，其中包括赫兹、美元、节俭、萤火虫、赫兹汽车销售和唐伦。但赫兹表示，它可能需要筹集更多资金，或许是在破产过程推进的同时通过增加借款来筹集。\n法院的请愿书列出了约258亿美元的资产和244亿美元的债务。文件显示，该公司最大的债权人包括IBM Corp.和Lyft Inc.。\n赫兹传统上一直是底特律3和其他汽车制造商车队汽车的主要买家。根据美国提交的一份文件，去年，赫兹在其美国车队中持有多达56.76万辆汽车，在国际部门持有20.4万辆汽车，在美国的平均持有期为18个月，国际汽车持有期为12个月。\n根据备案文件，其车队车辆的最大供应商是通用汽车(21%)、菲亚特克莱斯勒(18%)、福特(12%)、起亚(10%)、丰田(9%)、日产(7%)和现代(5%)。﻿。\n赫兹通常租赁其车队，而不是与其合作的汽车公司进行回购。通常情况下，赫兹会在需求下降时简单地出售多余的汽车，但随着二手车需求随着旅行的减少而下降(赫兹的大部分业务都是在机场开展的)，该公司无法维持负债。但抛售库存可能还不够。\n在当前的危机中，二手车的价格一直不稳定，但现在似乎他们已经决定选择…\n多读。\n赫兹已经试着卖出足够多的汽车来维持运营，但没有奏效。据美国有线电视新闻网(CNN)报道，3月初，赫兹在美国售出了4.1万辆二手车，但由于回报萎缩和汽车拍卖停止，赫兹踩下了刹车。二手车价格随后在4月份下跌了34.4%。市场上大量的新库存可能会进一步压低价格，使赫兹极难走出困境。\n汽车制造商也担心租车市场的麻烦。去年，汽车租赁车队占美国汽车销量的10%；已经遭受重创的汽车制造商承受不起损失。赫兹还解雇了美国的1.2万名员工，另有约4000名员工被暂时解雇-这一休假可能会被证明是永久性的。\n周一，赫兹在二手车市场上以一笔划算的价格抛售了一堆大黄蜂颜色的克尔维特Z06。在申请公告公布后，周六上午赫兹的网站上涌现出更多的二手车交易。这是一辆2020年的宝马740i，售价52,949美元，里程表上的行驶里程只有8,595英里，例如，比同一地区类似里程的同类汽车整整少了5,000-8,000美元。\n也有很多不那么华丽的车可以买到像样的交易，特别是如果你在市场上寻找一辆旧的租车备用车，比如一辆丰田卡罗拉(Toyota Corolla)或一辆雪佛兰塔霍(Chevy Tahoe)。如果一家成立于1918年的公司不得不倒闭，消费者不妨把骨头挑干净。", "note_en": "After weeks of hardship due to decimated demand, the car rental giant Hertz filed for Chapter 11 Bankruptcy late Friday night.   Hertz has been struggling to keep its head above water since the Covid-19 crisis began, and it seems the company has held out for as long as it could. Its fleet of used cars are now hitting the market, and one company’s misfortune will soon become some car buyer’s killer deal.\n  After a   tense day of talks with creditors, Hertz filed for Chapter 11 Bankruptcy, according to   Automotive News. While Chapter 11 allows the company to continue to operate in order to figure out how to pay debts and hopefully turn the business around, the situation for the car rental company is pretty dire:\n Hertz said it had $1 billion in cash to support its operations, which include Hertz, Dollar, Thrifty, Firefly, Hertz Car Sales, and Donlen. But it might need to raise more, perhaps through added borrowings while the bankruptcy process moves forward, Hertz said.\n The court petition listed about $25.8 billion in assets and $24.4 billion of debts. Its biggest creditors include IBM Corp. and Lyft Inc., according to the document.\n Hertz has traditionally been a leading buyer of fleet cars from the Detroit 3 and other automakers. Last year, Hertz held as many as 567,600 vehicles in its U.S. fleet and 204,000 in its international unit, holding those in the U.S. for an average of 18 months and international vehicles for 12 months, according to a U.S. filing.\n Its biggest suppliers of fleet vehicles were General Motors (21 percent), Fiat Chrysler (18 percent), Ford (12 percent), Kia (10 percent), Toyota (9 percent), Nissan (7 percent) and Hyundai (5 percent), according to the filing.﻿\n    Hertz normally leases its fleet, instead of doing buybacks with the auto companies it works with. Normally, Hertz would simply sell off excessive vehicles when demand dropped, but with the used car demand dropping along with travel (Hertz does most of its business at airports) the company had no way to keep its head above water. But selling off inventory may not be enough.\n Used car prices have been wonky through the current crisis, but it now seems they’ve decided on…\n Read more\n  Hertz already tried selling enough cars to stay afloat, and it didn’t work. In early March Hertz sold 41,000 used cars in the U.S., but pumped the brakes as returns shrank and auto auctions stopped, according to   CNN. Used car prices then fell 34.4 percent in April. A ton of new inventory on the market will likely push prices down even more, making it extremely difficult for Hertz to climb out of the hole it is in.\n  Automakers are also worried about the trouble in the rental car market. Last year car rental fleets accounted for 10 percent of U.S. auto sales; sales already suffering automakers can ill-afford to lose. Hertz also let go of 12,000 employees in the U.S., while some 4,000 were furloughed—a furlough which may prove permanent.\n  On Monday, Hertz dumped a bunch of bumble bee-colored Corvette z06s on to the used car market for a   heck of a good deal. More used car deals were rolling in Saturday morning on Hertz’s website after the filing announcement. Here’s a   2020 BMW 740i for $52,949 and only 8,595 miles on the odometer,   a full $5,000-$8,000 less than similar cars with similar milage in the same area, for instance.\n There are plenty of less flashy cars for decent deals as well, especially if you’re in the market for one of the old rental car standbys, like a Toyota Corolla or a Chevy Tahoe. If a company that has been around since 1918 has to die, consumers might as well pick the bones clean.", "posttime": "2020-05-25 05:04:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "汽车,car,赫兹", "title": "赫兹汽车租赁公司申请破产", "title_en": "Hertz Car Rental Files for Bankruptcy", "transed": 1, "url": "https://jalopnik.com/hertzs-late-night-bankruptcy-filing-sends-ripples-throu-1843628287", "via": "", "real_tags": ["汽车", "car", "赫兹"]}, {"category": "", "categoryclass": "", "imagename": "390eabb8be9c52ede60496f5097d56d3.jpg", "infoid": 1003568, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Microsoft和Altran发布代码缺陷AI，以识别软件开发中的潜在问题并提出修复建议。\nAltran发布了一款新工具，该工具使用人工智能(AI)帮助软件工程师在编码过程中发现错误，而不是在编码结束时发现错误。\n在GitHub上提供的Code Defect AI使用机器学习(ML)来分析现有代码，发现新代码中的潜在问题，并建议测试以诊断和修复错误。\nAltran集团首席创新官Walid Negm说，这个新工具将帮助开发人员快速发布高质量代码。\n他在一份新闻稿中表示，软件发布周期需要能够帮助做出战略判断的算法，特别是在代码变得更加复杂的情况下。\n代码缺陷人工智能使用了几种ML技术，包括随机决策森林、支持向量机、多层感知器(MLP)和Logistic回归。该平台对历史数据进行提取、处理和标注，训练算法，建立可靠的决策模型。开发人员可以使用代码缺陷AI中的置信度分数来预测代码是兼容的还是有错误的。\n对于开放源码的GitHub项目，历史数据是使用RESTful接口和GitCLI收集的。此数据包括完整的提交历史记录和完整的错误历史记录。\n将特征识别、标签编码、一次热编码、数据缩放和归一化等预处理技术应用于收集的历史提交数据。\n对预处理后的数据进行标记。标记过程涉及理解为每个已关闭的问题标记修复提交(错误已被关闭)的模式。在收集修复提交之后，通过回溯修复提交中每个文件的历史更改来识别引入错误的提交。\n如果与干净记录相比，数据集包含的错误数据非常少，则还会生成合成数据，以避免偏向多数类。\n一旦存在具有可接受的精确度和召回值的模型，就部署所选模型以预测新的提交。\n代码缺陷AI支持与第三方分析工具的集成，可以帮助识别给定程序代码中的错误。此外，代码缺陷人工智能工具允许开发人员评估代码中的哪些功能在错误修复方面应该具有更高的优先级。\n微软人工智能市场部总经理大卫·卡莫纳在一份新闻稿中表示，微软和Altran一直在合作改善软件开发周期，由Microsoft Azure提供支持的Code Defect AI是一种创新工具，可以通过使用机器学习来帮助软件开发人员。\n代码缺陷AI可以托管在本地，也可以托管在Microsoft Azure等云计算平台上。该解决方案可以根据需要与其他源代码管理工具集成。\n在一份关于人工智能和软件开发的新报告中，德勤预测，将有越来越多的公司使用人工智能辅助编码工具。从2018年1月到2019年9月，软件供应商推出了数十个致力于这一领域的人工智能软件开发工具和初创企业，并在类似的时间框架内筹集了7.04亿美元。\n德勤(Deloitte)分析师大卫·沙茨基(David Schatsky)和苏拉布·邦布(Sourabh Bumb)表示，这些平台最大的好处是效率。他们著有“人工智能正在帮助制造更好的软件”一书。人工智能辅助编码的好处很多。然而，对公司来说，最主要的好处是效率。许多新的人工智能支持的工具的工作方式类似于拼写和语法检查器，使程序员能够将他们需要键入的击键次数减少约50%。他们还可以在编写代码时发现错误，同时还可以自动化确认软件质量所需的多达一半的测试。随着公司继续依赖开源代码，这一能力变得更加重要。德勤的报告可以显著加快编码过程，将开发人员需要键入的击键次数减少一半，甚至在代码审查或测试之前就能捕获错误，并自动生成质量保证所需的一半测试。\n根据该报告，这些工具最适合软件开发流程的这些要素：\n从最热门的编程语言到薪水最高的工作，获取您需要了解的开发人员新闻和提示。每周。\n今天报名", "note_en": "Microsoft and Altran release Code Defect AI to identify potential problems in software development and suggest fixes.\n  Altran has released a new tool that uses  artificial intelligence (AI) to help software engineers spot bugs during the coding process instead of at the end.\n Available on GitHub,  Code Defect AI uses  machine learning (ML) to analyze existing code, spot potential problems in new code, and suggest tests to diagnose and fix the errors.\n Walid Negm, group chief innovation officer at Altran, said that this new tool will help developers release quality code quickly.\n &#34;The software release cycle needs algorithms that can help make strategic judgments, especially as code gets more complex,&#34; he said in a press release.\n  Code Defect AI uses several ML techniques including random decision forests, support vector machines, multilayer perceptron (MLP) and logistic regression. The platform extracts, processes and labels historical data to train the algorithm and build a reliable decision model. Developers can use a confidence score from Code Defect AI that predicts whether the code is compliant or buggy.\n    For an open source GitHub project, historical data is collected using RESTFul interfaces and Git CLI. This data includes complete commit history and complete bugs history.\n Preprocessing techniques like feature identification, label encoding, one hot encoding, data scaling and normalization are applied to the collected historical commit data.\n Labelling is performed on the preprocessed data. The labelling process involves understanding of the pattern in which the fix commits (where a bug has been closed) are tagged for each of the closed issues. After the fix commits are collected, the commits which introduced the bugs are identified by backtracking on historical changes for each file in a fix commit.\n If a data set contains a very small amount of bug data as compared with clean records, synthetic data is also generated to avoid bias toward the majority class.\n  Once there is a model that has acceptable value of precision and recall, the selected model is deployed for prediction on new commits.\n Code Defect AI supports integration with third-party analysis tools and can help identify bugs in a given program code. Also, the Code Defect AI tool allows developers to assess which features in the code should take higher priority in terms of bug fixes.\n &#34;Microsoft and Altran have been working together to improve the software development cycle, and Code Defect AI, powered by Microsoft Azure, is an innovative tool that can help software developers through the use of machine learning,&#34; said David Carmona, general manager of AI marketing at Microsoft, in a press release.\n  Code Defect AI can be hosted on premises as well as on cloud computing platforms such as  Microsoft Azure. The solution can be integrated with other source-code management tools as needed.\n  In a new report about artificial intelligence and software development, Deloitte predicts that more and more companies will use AI-assisted coding tools. From January 2018 to September 2019, software vendors launched dozens of AI-powered software development tools and startups working in this space, and raised $704 million over a similar timeframe.\n The biggest benefit from these platforms is efficiency, according to Deloitte analysts David Schatsky and Sourabh Bumb, the authors of &#34; AI is helping to make better software:&#34;  &#34;The benefits of AI-assisted coding are numerous. However, the principal benefit for companies is efficiency. Many of the new AI-powered tools work in a similar way to spell- and grammar-checkers, enabling coders to reduce the number of keystrokes they need to type by around 50%. They can also spot bugs while code is being written, while they can also automate as many as half of the tests needed to confirm the quality of software.&#34;  This capability is even more important as companies continue to rely on open-source code.  The Deloitte report can speed up the coding process significantly by &#34;reducing the number of keystrokes developers need to type by half, catching bugs even prior to code review or testing, and automatically generating half of the tests needed for quality assurance.&#34;\n According to the report, these tools are best suited for these elements of the software development process:\n  From the hottest programming languages to the jobs with the highest salaries, get the developer news and tips you need to know. Weekly\n      Sign up today", "posttime": "2020-05-25 04:49:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,代码,ai,软件", "title": "Altran的“代码缺陷人工智能”与人工智能辅助编码工具的兴起", "title_en": "Altran's 'Code Defect AI' and the Rise of AI-Assisted Coding Tools", "transed": 1, "url": "https://www.techrepublic.com/article/machine-learning-tool-trains-on-old-code-to-spot-bugs-in-new-code/", "via": "", "real_tags": ["人工智能", "代码", "ai", "软件"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003567, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2041-8205/895/1/L11生物分子选择了两个结构上的手性体系中的一个，这两个体系通过镜面反射联系在一起。有人提出，这一选择是由宇宙射线做出的，宇宙射线已知在诱变过程中起着重要作用。研究表明，今天在地面上占主导地位的磁极化宇宙射线可以在它们诱导简单的手性单体结构变化的速度上施加微小但持久的手性偏差，而简单的手性单体是生物聚合物的基石。螺旋生物聚合物应该有更大的影响，特别是那些可能是核糖核酸和脱氧核糖核酸前体的聚合物。结果表明，相互作用既可以是静电的，只涉及分子电场的，也可以是电磁的，也可以是磁场的。有人争辩说，这种偏见可能会导致在进化时间尺度上出现单一的手性生命形式。如果这一机制占主导地位，那么生命系统的惯用手应该是普遍的。建议进行实验以评估此过程的有效性。\n有生命的有机体由用特定的惯用手组织起来的分子系统组成。手性-或手性-按照开尔文的原始定义，是一个物体的几何属性，不能叠加在它的镜像上(开尔文1894)。在化学上，同一手性分子的镜像称为对映体。4两者具有相同的化学特性。\n核糖核酸和脱氧核糖核酸(RNA和DNA)负责遗传信息的复制和存储，由具有相同手性的构建块组成的线性序列组成，称为核苷酸，其排列既不是周期性的也不是随机的，包含维持生命所需的遗传信息(Schrödinger 1944；Shannon 1948；Watson&Amp；Crick 1953；Shinitzky等人)。(2007年)。核苷酸的手性赋予了核酸螺旋结构。核酸是非常大的分子，手性单元之间的扭转角有系统地变化，如Ramachandran图(Keting等人)所示。(2011)，这表明即使是柔性生物聚合物也保持手性。因为RNA和DNA是由D-糖组成的(按照人类惯例，右旋)，更稳定的构象是右旋螺旋(见图1)。糖的同源性对螺旋的稳定性有重要影响，因此对遗传密码的保真度或误差控制也有重要影响。所有20个编码的氨基酸都是左撇子(同样是按照人类惯例)。有时，同一分子的两个对映体被活的有机体使用，但数量不同，它们执行不同的任务。\n虽然到目前为止观察到的基于DNA/RNA的生命显然选择了一种功能性手性，我们称之为生活，但另一种选择，我们称之为邪恶，可能已经沿着一条独立的、同步的道路发展起来，做出了类似的进化选择，以应对共同环境的变化，除了非常小的影响，这是这封信的主要主题。然而，考虑到高复制率，在这两个选择之间实现精确的平衡似乎是不太可能的。有一个小的熵代价，但这肯定是由更大的信息存储设施和更高的复制可靠性来支付的(薛定谔1944)。\n对于今天的DNA来说，辐射增加了基因突变的频率；这一点自Muller(1927年)的开创性工作以来就已经知道了，该工作表明突变率与辐射剂量成正比，其中大部分可归因于宇宙射线的电离。µ子成分在100 MeV以上的能量下主导着地面粒子的通量，贡献了宇宙射线辐射剂量的85%(Atri&Amp；Melott 2011)。µ子的能量足以穿透相当深的地方，而且它们平均而言是自旋极化的。自旋极化辐射的电离可以是对映选择性的(Zel&#39；dovich等人)。1977年)。因此，我们认为活的和邪恶的有机体的突变率是不同的。由于最早和最简单的生命形式可能有数十亿甚至数万亿代，突变率的微小差异就可以很容易地维持两种早期手性选择中的一种。\n当巴斯德发现生物的同质性时，他认识到它是自然规律中某些不对称的结果：如果生命的基础是不对称的，因为它的起源是不对称的宇宙力，这是地球上的生命和宇宙之间的联系之一(巴斯德1860)。如果巴斯德还活着一个世纪以后，弱相互作用中奇偶破坏的发现(Lee&Amp；Yang，1956；Wu等人)。1957年)会强化他的观点。当物体的镜像在自然界中不存在时，由于弱相互作用中的宇称破坏，物体表现出物理手性。R\n如果我们寻找一种通用的手性光源，使其始终发出一种偏振而不是另一种偏振，那么为了解释普遍的不对称性，我们再次被弱相互作用所吸引。一种选择是调用自旋极化粒子，它可以通过Čerenkov辐射或韧致辐射辐射一种感觉的圆偏振，并且可以优先光解单手手性分子(Vester等人)。1959年；Lahoti&amp；Takwale 1977；Gusev&amp；Guseva 2019年)。另一种选择是调用超新星中微子(Boyd等人，(2018年)。然而，较小的手性偏向不太可能导致同手性状态，仍然需要一些益生菌扩增机制。这表明，相反，在这两个生命系统的进化过程中，要考虑到对映选择性偏见。\n首先，考虑一个小的手性分子的模型，它是较大的螺旋聚合物的一部分(见图1)，我们将其理想化为一个不相等的三脚架。在原点有一个顶点或目标，以及三个带有位置矢量的可区分的原子或群。这四个点的点电荷存在一个经典的静电场。引入一个伪标量(反射下改变符号)分子手性是有帮助的，它必须在反射时改变符号，并且有一个明确的选择是。\n第二个简单的半经典模型将电荷和电流限制在围绕中心核电荷的球体表面，该中心核电荷被球体上的净电荷抵消。电流允许电磁手性，具有最简单的表达式。这两种模型适用于天然螺旋生物聚合物的小分子或单体。\n我们的第三个简单模型涉及圆柱形的静电势，就像理发杆一样(见瓦格纳等人)。1997)，其中k&gt；为0。在这种情况下，可以选择分子手性作为活(恶)分子的手性。这些定义如图1所示。\n带电的宇宙射线质子，其能量略高于π子产生的阈值，与高层大气中的氮和氧核相撞，产生π+，π−核(Gaisse2012)。π+在几米内衰变成μ+，半衰期约为2μs，半衰期为e+。由于介子没有自旋，衰变很弱，μ+和e+自旋方向优先与它们的运动方向反对齐，以便平衡伴随的中微子的反平行自旋(图2)。相关的磁偶极矩由下式给出。π−会衰变成μ−，e−具有优先对齐的自旋，但磁矩也是反对齐的(见图2和附录A)。\n我们引入了一个伪标量--容积量(在磁石之后)来表示宇宙射线的物理手性。这由以下定义。\n这里我们对所有第一类和动能T的宇宙射线进行平均，远远高于阈值，对于新创建的μ，对于新的e，在π静止框架中(见附录)。会进一步退化，因为宇宙射线通过粗略地散射电子而损失能量。此外，次级电子将大部分是未极化的，并进一步降低照射分子的宇宙射线的容限。\n在今天的海平面上，大多数宇宙射线是平均通量~160m−2 s−1(Lipari 1993)的µ子。然而，通量和大气可能有很大的不同；年轻的太阳和它的风可能要活跃得多。我们称之为喷泉的原生生物场所可能位于岩石、水或冰之下，这可能会改变淋浴的性质和容纳量。\n我们现在转向将宇宙射线的容限与分子手性相耦合的相互作用。我们寻求一种与产物成正比的效应，这种效应将区分暴露在相同宇宙射线通量下的活分子和邪恶分子-手性偏向。这种效应必须转化为最终突变率的差异，这一途径即使在当代生物学中也知之甚少。高能粒子可以局部激发电子(Rosenfeld，1928)。通常，去激励是快速且无辐射的，并且涉及振动和旋转模式。因此，这种内部转换可以引起分子结构的局部变化。宇宙辐射还会诱导电离，这会导致生物分子的电子结构发生变化，并可能导致突变。今天，DNA大概比第一种遗传生物聚合物更不容易出错。修复也可能是生命开始时的一个因素。\n这里假设宇宙射线本身在空间上是均匀的，并且相对于分子是各向同性分布的。它们的宇宙线平均磁矩也被推定为严格反平行，尽管散射过程或外部磁场可以在和之间引入一个角度。这一点很重要，因为静电相互作用的手性部分涉及到一个给定的力，除非速度受到扰动，否则这个力就会消失。手性偏置的详细计算见附录B。\n我们从不相等的三脚架开始(如附录B中的图B1所示)。考虑一条具有电荷Qe、质量Me、亚相对论速度和撞击参数矢量的宇宙线相对于原点处的目标。由于电荷q1e，轨道将受到库仑力的线性摄动。这将导致速度微扰δ，它与来自第二个原子的电场结合在一起产生一个二阶手性力。这会在目标处产生位移，并且位移的梯度等同于粒子通量中的手性变化。然而，在我们平均之后，这种变化就消失了。这是意料之中的，因为我们只涉及到两个原子。我们必须进行三阶微扰才能得到平均手征差。此外，如果两个三脚架腿的长度相等，手性偏置就消失了。这也是意料之中的，因为电荷Qi是乘性的，如果键的长度相等，那么几何结构本身就不是手性的。如果突变的概率是P，而活分子和邪恶分子的这个概率之差是δP，则(在附录B中导出)，其中α=~0.0073是精细结构常数。这太小了，不能引起人们的兴趣，但确实清楚地指出了在更大的影响中重要的因素。\n接下来，考虑具有表面电荷和电流的球体(如附录B中的图B2所示)。最简单和最大的手性效应是电磁的，它来自于电偶极矩和磁偶极矩的结合。在这种情况下。Zel&#39；dovich等人通过完全不同的论证得出了类似的结论。(1977)。然而，似乎没有很好的理由说明为什么应该是非零。\n第三个静电螺旋模型也是手性的(如附录B中的图B3所示)。我们引用一个各向同性的可变性κ，它是通过分子的宇宙射线轨迹的每单位长度的概率，它将导致重大突变。我们假设可变性κ既有径向分量，也有螺旋分量，就像静电势一样。我们发现三阶手征偏置包含两个螺旋因子和一个径向因子的项之和。如果结构与核糖核酸完全相似，那么偏向很可能是由具有轴对称可变性的项κ主导的。原来的宇宙射线正电子数量超过电子，当遇到活分子时，它们会径向向内偏转，而与邪恶分子相遇时，正电子会向外偏转。这意味着与碱基的相互作用必然比与磷酸糖骨架的相互作用引起更多的突变。整体手性偏置由给出。\n最后，我们考虑了一个电磁螺旋模型，在该模型中，我们假设单个单体携带磁偶极子和电偶极子。然后，尽管磁体不像铁磁体那样排成一条直线，但可能有足够的近邻关联，从而产生电磁、手性偏置，这可能是静电偏置的两倍。\n偏置(~10−7的keV电子，乘以理发杆模型中的容积值和正负电荷的分数差)是活体和恶体之间突变率的相对差异。在附录C中，我们使用日志\n需要更多的研究来确定这些过程是否足以解释同性。特别是，有必要研究不同的簇射模型，以了解容积率的演变，并建立碰撞激发的量子力学模型。还有许多其他效应需要探索。例如，研究表明，由于电偶极-电四极相互作用，手性分子在特定表面的吸附可以使光学活性提高几个数量级(Wu等人)。2017年)。所研究的相互作用在生物环境中可能有相似之处。\n天体生物学面临的一个关键问题是评估哪些环境子集是生命出现所必需的。陨石提供的碱基聚合的良好候选环境是小而温暖的池塘，这些池塘是由与地球早期火山活动相关的热液条件产生的(Pearce等人。2017年)。它们的湿循环和干循环已被证明促进核苷酸聚合成长链(Da Silva等人。(2015年)。任何具有活跃地质过程和水的岩石行星都有创造生命的潜力，因为它可能支持相当大的环境多样性，特别是基于表面的地点，包括海滩和海冰界面(STüeken等人)。(2013年)。Lingam&amp；Loeb(2018)概述了潮汐在没有明暗循环的环境中产生干湿循环或提供生物节律的生物学后果。偏振辐射的辐射只能导致少量的对映体过剩，不能解释在陨石中发现的大量过剩(15%)，必须寻求放大机制(Glavin等人)。2019年)。如果在陨石上发现的氨基酸是生物成因的，那么它们在地球上出现生命之前就已经存在很久了。\n未来的太空任务将带着在小行星和火星次表面上收集的样本返回地球(Lauretta等人。2017年；Vago等人。2017年；Yamaguchi等人。(2018年)。这将提供对有机分子的性质和它们的手性的洞察力。由于宇宙射线在弱相互作用和生命系统之间提供了一种天然的联系，我们预测，如果发现了本土生物聚合物(即生命系统的痕迹)，它们将与地球上的生命具有同样的利手。(类似的言论也适用于未来从深层地下地点返回的样本。)。生命最先出现的地方，以及宇宙射线是否在其形成过程中起到了作用。\n..", "note_en": "2041-8205/895/1/L11      Biological molecules chose one of two structurally chiral systems which are related by reflection in a mirror. It is proposed that this choice was made, causally, by cosmic rays, which are known to play a major role in mutagenesis. It is shown that magnetically polarized cosmic rays that dominate at ground level today can impose a small, but persistent, chiral bias in the rate at which they induce structural changes in simple, chiral monomers that are the building blocks of biopolymers. A much larger effect should be present with helical biopolymers, in particular, those that may have been the progenitors of ribonucleic acid and deoxyribonucleic acid. It is shown that the interaction can be both electrostatic, just involving the molecular electric field, and electromagnetic, also involving a magnetic field. It is argued that this bias can lead to the emergence of a single, chiral life form over an evolutionary timescale. If this mechanism dominates, then the handedness of living systems should be universal. Experiments are proposed to assess the efficacy of this process.\n       Living organisms comprise a system of molecules organized with specific handedness. Handedness—or chirality—is, following Kelvin&#39;s original definition, the geometric property of an object that cannot be superimposed on its mirror image (Kelvin  1894). In chemistry, mirror images of the same chiral molecule are called enantiomers.  4 Both share the same chemical characteristics.\n The ribonucleic and deoxyribonucleic acids (RNA and DNA), responsible for the replication and storage of genetic information, are made up of linear sequences of building blocks with the same handedness, called nucleotides, whose arrangement is neither periodic nor random and contains the genetic information needed to sustain life (Schrödinger  1944; Shannon  1948; Watson &amp; Crick  1953; Shinitzky et al.  2007). The chirality of the nucleotides confers helical structure on nucleic acids. Nucleic acids are very large molecules and the torsional angles between the chiral units vary systematically, as exhibited by the Ramachandran plot (Keating et al.  2011), which demonstrates that even a flexible biopolymer retains chirality. As RNA and DNA are made of D-sugars (right-handed, by human convention), the more stable conformation is a right-handed helix (see Figure  1). The homochirality of the sugars has important consequences for the stability of the helix and, hence, on the fidelity or error control of the genetic code. All 20 encoded amino acids are left-handed (again by human convention). Sometimes, both enantiomers of the same molecule are used by living organisms, but not in the same quantity, and they perform different tasks.\n  While DNA/RNA-based life, as observed so far, has clearly chosen one functional chirality, which we call &#34;live,&#34; the alternative choice, which we call &#34;evil,&#34; could have developed along a separate, synchronized path making similar evolutionary choices in response to changes in common environments, except for very small effects which are the main topic of this Letter. However, a precise equilibrium between the two choices seems quite unlikely given the high replication rate. There is a small entropic price, but this is surely paid by the greater facility of storing information and the higher reliability of the replication (Schrödinger  1944).\n For DNA today, radiation increases the fRequency of gene mutations; this has been known since the pioneering work of Muller ( 1927) that showed that the mutation rate is proportional to the radiation dose, much of it attributable to ionization by cosmic rays. The muon component dominates the flux of particles on the ground at energies above 100 MeV, contributing 85% of the radiation dose from cosmic rays (Atri &amp; Melott  2011). Muons have an energy sufficient to penetrate considerable depths, and they are, on average, spin-polarized. Ionization by spin-polarized radiation could be enantioselective (Zel&#39;dovich et al.  1977). Therefore, we argue that the mutation rate of live and evil organisms would be different. As there could be billions or even trillions of generation of the earliest and simplest life forms, a small difference in the mutation rate could easily sustain one of the two early, chiral choices.\n When Pasteur discovered biological homochirality, he recognized it as a consequence of some asymmetry in the laws of nature: &#34;If the foundation of life is dissymmetric because of dissymmetric cosmic forces operating at its origin, this is one of the links between life on earth and the cosmos&#34; (Pasteur  1860). Had Pasteur been alive a century later, the discovery of parity violation in the weak interaction (Lee &amp; Yang  1956; Wu et al.  1957) would have strengthened his view. An object exhibits  physical chirality when its mirror image does not exist in Nature, as a consequence of parity violation in the weak interaction. The result of applying the parity operation on an elementary weak process, such as the decay,     , is not found in Nature because neutrinos are chiral particles. In the language of quantum mechanics, the basic Hamiltonian of a chiral molecule does not commute with the parity operator and, if we include weak neutral currents, there will be a parity-violating energy difference (PVED) between the two enantiomers (Yamagata  1966). However it is extremely small, ~10 −17 kT in water (Salam  1991) and larger consequences of chirality must be sought. While the effectiveness of PVED in generating biological homochirality is still under debate, some authors have attempted to work with this small PVED and shown that it may theoretically suffice to bring strong chiral selectivity (Kondepudi &amp; Nelson  1984). An enantiomeric excess due to neutral weak currents has been reported in crystalline materials (Szabó-Nagy &amp; Keszthelyi  1999).\n In a beautiful paper, Pierre Curie addressed the question of chirality transfer from light to molecules, specifically involving circular polarization (Curie  1894). The sense of rotation of the polarization direction reflects the underlying chirality of the molecules, though the relationship is not simple and depends upon the wavelength of the light (optical rotatory dispersion). This rotation can be accompanied by a difference in the absorption (circular dichroism), consistent with the Kramers–Kronig relations (Kronig  1926; Kramers  1927). On this basis, it has been suggested that a specific source of circularly polarized light (CPL) might favor one set of enantiomers over the other (Bailey et al.  1998).\n Laboratory experiments have demonstrated that it is possible to induce an enantiomeric excess of amino acids by irradiation of interstellar ice analogs with UV CPL (de Marcellus et al.  2011). However, this raises two problems. First, circular dichroism is also wavelength-, pH-, and molecule-specific (D&#39;hendecourt et al.  2019). It is hard to see how one sense of circular polarization can enforce a consistent chiral bias, given the large range of environments in which the molecules are found. Second, it is often supposed that astronomical sources supply the polarization. However, optical polarimetry within the Galaxy reveals no consistent sense of circular polarization and the observed degrees of polarization in the UV are generally quite small (Bailey  2001).\n If we seek a universal, chiral light source that consistently emits one polarization over another, then we are again drawn to the weak interaction in order to account for a universal asymmetry. One option is to invoke spin-polarized particles, which can radiate one sense of circular polarization through Čerenkov radiation or bremsstrahlung and can preferentially photolyze chiral molecules of one handedness (Vester et al.  1959; Lahoti &amp; Takwale  1977; Gusev &amp; Guseva  2019). Another option is to invoke supernova neutrinos (Boyd et al.  2018). However, the small chiral bias is unlikely to lead to a homochiral state and some prebiotic amplification mechanism is still required. This suggests considering, instead, enantioselective bias in the evolution of the two living systems.\n  Consider, first, a model of a small chiral molecule, part of a larger helical polymer (see Figure  1), which we idealize as an unequal tripod. There is a vertex or &#34;target&#34; at the origin and three distinguishable atoms or groups with position vectors     ,     ,     . There is a classical electrostatic field associated with the point charges at these four sites. It is helpful to introduce a pseudoscalar (changes sign under reflection) &#34;molecular chirality,&#34;     , which has to change sign upon reflection and a clear choice is     .\n A second simple, semi-classical model has electrical charge and current confined to the surface of a sphere surrounding a central nuclear charge which is canceled by the net charge on the sphere. The current allows for an electromagnetic chirality, with the simplest expression     . These two models are appropriate for small molecules or monomers that are the constituents of naturally helical biopolymers.\n Our third simple model involves a cylindrical, electrostatic potential, like a &#34;Barber pole&#34; (see Wagner et al.  1997),      with  k &gt; 0. In this case, the molecular chirality      can be chosen as      for a live (evil) molecule. These definitions of      are illustrated in Figure  1.\n  Charged cosmic-ray protons, with energies just above the threshold for pion production, collide with nitrogen and oxygen nuclei in the upper atmosphere to create  π +,  π − (Gaisser  2012). The  π + decay within a few meters into  μ + with half life ~2  μs, which decay, in turn into  e +. As pions are spinless and the decays are weak, the  μ + and  e + spin directions     , are preferentially anti-aligned with their direction of motion,     , in order to balance the antiparallel spins of the accompanying neutrinos (Figure  2). The associated magnetic dipole moments are given by     . The  π − decay into  μ −,  e − with preferentially aligned spins but with magnetic moments also anti-aligned with      (see Figure  2 and Appendix  A).\n  We introduce a pseudoscalar quantity, &#34;lodacity&#34; (after lodestone), to express the physical chirality of the cosmic rays. This is defined by\n  where we average over all cosmic rays of type  i and kinetic energy  T. Well above threshold,      for freshly created  μ, and      for new  e, in the pion rest frame (see the Appendices).      will be further degraded as the cosmic rays lose energy through scattering electrons with      roughly. In addition the secondary electrons will be mostly unpolarized and further diminish the lodacity of the cosmic rays that irradiate the molecules.\n At sea level today, most cosmic rays are muons with an average flux ~160 m −2 s −1 (Lipari  1993). However, the flux and the atmosphere could have been quite different; the young Sun and its wind are likely to have been much more active. The protobiological site, which we call the &#34;fount,&#34; may have been below rock, water, or ice, which can change the shower properties and lodacity.\n  We now turn to the interaction that couples the cosmic-ray lodacity      to the molecular chirality     . We seek an effect that is proportional to the product      which will distinguish live and evil molecules exposed to the same cosmic-ray flux—a chiral bias. This effect must be translated into a difference in the ultimate mutation rate, a pathway that is poorly understood even in contemporary biology. A high-energy particle can excite an electron locally (Rosenfeld  1928). Typically, the de-excitation is fast and radiationless and involves vibrational and rotational modes. This &#34;internal conversion&#34; can therefore cause local structural change in the molecule. Cosmic radiation also induces ionization, which introduces changes in the electronic structure of the biomolecules and can lead to mutations. DNA, today, is presumably a far less error-prone copier than the first genetic biopolymer. Repair may also have been a factor when life began.\n The cosmic rays themselves are supposed here to be spatially homogeneous and isotropically distributed with respect to the molecules. Their cosmic-ray-averaged magnetic moment is also presumed to be strictly antiparallel to      although scattering processes, or an external magnetic field can introduce an angle between      and     . This is important because the chiral part of the electrostatic interaction involves a force given by      which vanishes unless the velocity is perturbed. Details of the calculation of the chiral bias      are presented in Appendix  B.\n We start with the unequal tripod (as illustrated by Figure  B1 in Appendix  B). Consider a cosmic ray with charge  qe, mass  Mm  e, subrelativistic velocity     , and impact parameter vector with respect to the target at the origin given by     . The trajectory will be linearly perturbed by the Coulomb force due to the the charge  Q 1 e at     . This will cause a velocity perturbation  δ    , which creates a second-order chiral force in combination with the electric field from the second atom. This produces a displacement at the target and the gradient of the displacement is equivalent to a chiral change in the particle flux. However, this change vanishes after we average over     . This is expected because we have only involved two of the atoms. We have to go to third-order perturbations to get an average chiral difference. Furthermore, the chiral bias vanishes if two of the tripod legs are of equal length. This is also to be expected because the charges  Q  i are multiplicative, and if the bonds are of equal length then the geometrical structure by itself is not chiral. If the probability of a mutation is  P and the difference between this probability for live and evil molecules is  δP, then      (derived in Appendix  B), where  α ~ 0.0073 is the fine-structure constant. This is too small to be of interest but does bring out clearly the factors that are important in a larger effect.\n Next, consider the sphere with surface charge and current (as illustrated by Figure  B2 in Appendix  B). The simplest and largest chiral effect is electromagnetic and comes from combining its electric and magnetic dipole moments. In this case     . A similar conclusion was reached, through a quite different argument, by Zel&#39;dovich et al. ( 1977). However, there seems to be no good reason why      should be non-zero.\n The third, electrostatic helical, model is also chiral (as illustrated by Figure  B3 in Appendix  B). We invoke an isotropic &#34;mutability,&#34;  κ, which is the probability per unit length of cosmic-ray trajectory through the molecule that a significant mutation will result. We suppose that the mutability  κ has both a radial and a helical component, like the electrostatic potential. We find that the third-order chiral bias comprises a sum of terms that contains two helical factors and one radial factor. If the structure is at all similar to RNA then it is likely that the bias is dominated by terms with an axisymmetric mutability,  κ. It appears that the original cosmic-ray positrons, which outnumber the electrons, are deflected radially inward when encountering a live molecule and outward with an evil molecule. This implies that interactions with the nucleobases must cause more mutations than those with the suger-phosphate backbone. The overall chiral bias is given by     .\n Finally, we consider an electromagnetic helical model where we suppose that the individual monomers carry magnetic dipoles as well as electric dipoles. Then, although the magnets do not line up as in a ferromagnet, there may be enough near-neighbor correlation for there to be an electromagnetic, chiral bias which could be      times the electrostatic bias.\n The bias      (~10 −7 for keV electrons, times the lodacity and the fractional difference between positive and negative charges in the barber pole model) is the relative difference in the mutation rate between live and evil organisms. In Appendix  C, we use the the logistic equations to model the population growth. Starting with a racemic mix the enantiomeric excess is      where  T is the time multiplied by the growth rate. If we add a balanced, live–evil &#34;conflict&#34; then homochiralization is speeded up. Either way, a small bias in the mutation rate could achieve this on an evolutionary timescale.\n  In this paper, we have proposed that homochirality is a deterministic consequence of the weak interaction, expressed by cosmic irradiation of helical biopolymers which may have affected the way they fold or assemble to make the first living organisms. This is a consequence of the coupling      that can lead to symmetry-breaking as anticipated by Pasteur. The choice that was made is then traceable to the preponderance of baryons over antibaryons, established in the early universe and ultimately to the symmetries of fundamental particle interactions presenting requirements (including leptonic charge parity violation) as first elucidated by Sakharov ( 1967). We have also demonstrated how this quite small chiral bias can lead to homochirality after sufficient generations of self-replicating molecules, and shown how conflict can speed up this Manichean struggle.\n Much more study is needed to determine if these processes suffice to account for homochirality. In particular, it will be necessary to investigate different shower models to understand the evolution of the lodacity and to develop a quantum mechanical model of collisional excitation. There are many other effects to explore. For example, it has been shown that the adsorption of chiral molecules on specific surfaces can enhance the optical activity by several orders of magnitude because of the electric dipole–electric quadrupole interaction (Wu et al.  2017). The interaction investigated may have analogs in biological environments.\n A key issue facing astrobiology is assessing what subset of environments are necessary for the emergence of life. Good candidate environments for the polymerization of meteorite-delivered nucleobases are small, warm ponds produced by hydrothermal conditions associated with volcanic activity on the early Earth (Pearce et al.  2017). Their wet and dry cycles have been shown to promote the polymerization of nucleotides into long chains (Da Silva et al.  2015). Any rocky planet, with active geological processes and water, has the potential to create life, because it is likely to support considerable environmental diversity, in particular, surface-based locales, including beaches and sea-ice interfaces (Stüeken et al.  2013). Lingam &amp; Loeb ( 2018) outlined the biological consequences of tides in producing wet–dry cycles or providing biological rhythms in environments where the light–dark cycle is absent. Irradiation by polarized radiation can only lead to small enantiomeric excess, and cannot explain the large excesses (15%) found in meteorites, and amplification mechanisms must be sought (Glavin et al.  2019). Should the amino acids found on meteorites be biogenic, they would have existed long before the appearance of life on Earth.\n Future space missions will return to Earth with samples collected on asteroids and on the Martian sub-surface (Lauretta et al.  2017; Vago et al.  2017; Yamaguchi et al.  2018). This will provide insight on the nature of organic molecules and their chirality. As cosmic rays provide a natural connection between the weak interaction and living systems, we predict that, if ever indigenous biopolymers are found (i.e., traces of living systems), they will have the same handedness as life on Earth. (Similar remarks apply to future samples returned from deep subterranean sites.) Where life appeared first, and whether cosmic rays played a role in its formation, are \n......", "posttime": "2020-05-25 04:47:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "手性,puzzle", "title": "生命的手性之谜", "title_en": "The Chiral Puzzle of Life", "transed": 1, "url": "https://iopscience.iop.org/article/10.3847/2041-8213/ab8dc6", "via": "", "real_tags": ["手性", "puzzle"]}, {"category": "", "categoryclass": "", "imagename": "186aed713d2dab72c02474a3d379fe25.jpeg", "infoid": 1003566, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透旧金山8月23日电-随着Facebook周四采用永久远程工作，首席执行官马克·扎克伯格(Mark Zuckerberg)已将这家硅谷最大的公司之一从孵化它的地方解脱出来。\n但他也让硅谷的一个梦想破灭了：技术工人逃离旧金山湾区压倒性的住房成本、肮脏的人行道和拥挤的道路时，可以随身携带他们丰厚的工资。\n随着停工进入第三个月，在高薪科技工作者中很受欢迎的留言板上，充满了在热带海滩和中西部负担得起的小镇宽敞的房子里长期工作的幻想。\n“这是不是意味着我可以在硅谷申请一份工作，并且可以在加勒比海等地远程工作？”一位用户在Blind上写道，Blind是一款旨在让员工匿名交换信息的应用程序。\n恐怕不会，扎克伯格在他的Facebook页面上向员工发表公开广播的直播流时说。\n该公司是硅谷最大的雇主之一，将给获准远程工作的美国员工在2021年1月1日之前向公司通报他们计划在哪里工作的最新情况，届时他们的工资将进行调整，以反映当地的生活成本。\n扎克伯格说，他预计Facebook一半的员工将在未来5到10年内接受他的提议。\n他说，试图绕过这些薪酬调整的员工将受到“严重后果”的影响，因为公司需要考虑员工的所在地，以避免违反税法。\n扎克伯格表示，Facebook将通过检查员工访问其VPN的位置来监控遵守情况。据CNBC HERE报道，Facebook还使用自己的应用程序来追踪员工的位置，曾有一次使用这些数据来寻找没有出现在工作岗位上的实习生。\n尽管许多科技工作者梦想着在低税收州拥有未来，但留言板上的其他人担心，转向远程工作可能会给所有人的工资带来下行压力，并警告称，远离总部可能会让公司的晋升变得更加陡峭。\n一位20多岁的前Facebook员工表示，这一变化将为留在加州的员工提供机会。他20多岁时住在硅谷郊区，通勤时间很短。\n他说：“25岁的人可能更愿意待在旧金山，而那些想要养家糊口的人可能更愿意搬到城外去。”\nFacebook的一位发言人表示，该公司不打算对选择留在旧金山湾区的员工进行裁员、强制搬迁或工资调整。\n如果实验成功，Facebook的举动可能会促使其他科技巨头通过拥抱远程工作来争夺工程人才-以及其他州争夺加州人。\n“那些温暖、阳光明媚的州，拥有负担得起的住房和零税收，将会看到受过教育的富裕工人涌入。各州将需要减税才能跟上，“风投公司Social Capital首席执行官、Facebook早期高管Chaath Palihapitiya在推特上表示。", "note_en": "SAN FRANCISCO (Reuters) - With Facebook’s adoption of permanent remote work on Thursday, Chief Executive Mark Zuckerberg has untethered one of Silicon Valley’s biggest companies from the place that incubated it.\n But he also dashed a Silicon Valley dream: that tech workers would be able to take their generous salaries with them as they flee the Bay Area’s crushing housing costs, dirty sidewalks and crowded roadways.\n As lockdowns dragged into their third month, message boards popular with well-paid tech workers have lit up with fantasies of working long-term from tropical beaches and spacious houses in affordable small towns in the Midwest.\n “Does that mean I could apply for a job in Silicon Valley and work remotely from, say, the Caribbean? Asking for a friend,” wrote one user on Blind, an app designed to let workers swap information anonymously.\n Afraid not, Zuckerberg said, addressing employees in a publicly broadcast livestream on his Facebook page.\n The company, one of Silicon Valley’s biggest employers, is giving U.S. staffers who are approved to work remotely until Jan. 1, 2021 to update the company on where they plan to base themselves, at which point their salaries will be adjusted to reflect the local cost of living.\n Zuckerberg said he expects half of Facebook’s workforce to take him up on the offer over the next five to 10 years.\n Employees who attempt to wiggle around those compensation adjustments will be subject to “severe ramifications,” he said, as the company needs to account for employee locations to avoid violating tax laws.\n Zuckerberg said Facebook will monitor adherence by checking where employees access its VPN. Facebook also uses its own apps&#39; to track employee locations, according to CNBC  here one time using the data to find interns who failed to show up for work.\n Even as many tech workers dream of a future in low-tax states, others on message boards fret about how the shift to remote work could exert downward pressure on salaries across the board and warn that being far from headquarters could steepen the climb up the corporate ladder.\n One former Facebook employee, who in his 20s lived in Silicon Valley’s suburbs for the short commute, said the change would open up opportunities even for employees who stay in California.\n “A 25-year-old maybe would rather be in San Francisco, while someone looking to raise a family might prefer to move outside the city,” he said.\n A Facebook spokesman said the company was not planning layoffs, compulsory moves or salary adjustments for employees who opt to stay in the Bay Area.\n  If the experiment is successful, Facebook’s move could prompt other tech giants to compete for engineering talent by embracing remote work - and other states to compete for Californians.\n “The warm, sunny states with affordable housing and zero taxes will see an influx of educated, rich workers. States will need to cut taxes to keep up,” Chamath Palihapitiya, the chief executive of venture capital firm Social Capital and an early executive at Facebook, said on Twitter.", "posttime": "2020-05-25 04:47:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,require,员工", "title": "Facebook要求远程员工披露加薪地点", "title_en": "Facebook to require remote workers to disclose location for salary scaling", "transed": 1, "url": "https://mobile.reuters.com/article/idUSKBN22Y1IA", "via": "", "real_tags": ["facebook", "require", "员工"]}, {"category": "", "categoryclass": "", "imagename": "1b005ed9480bccf726582dce8b3af6cb.png", "infoid": 1003565, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我们谈到专利时，我们通常谈论的是“实用”专利。实用专利保护声称具有实际应用或用途的发明。(他们中的许多人仍然声称一些实际上无用的东西，但它们应该是潜在的有用的。)。\n相比之下，“外观设计”专利只保护外观设计的装饰性或装饰性。它们不保护任何类型的功能。如果有功能性的作品需要保护，只有实用专利才行。\n因为外观设计专利只能保护非功能性作品，所以它们有点像视觉作品的版权。专利设计的创造力和原创性的门槛很低--低到即使是标准版本的图形用户界面也能获得专利保护，正如我们本月最新的愚蠢专利所显示的那样。\n以下是西门子医疗集团(Siemens Healthcare GmbH)拥有的一项专利设计，西门子是欧洲最多产的专利申请者西门子的一部分：\n该专利，美国专利号。D872,112是一个相对标准的GUI，标题栏下面显示一排排圆形图标。但这项专利并不能保护图片中的所有内容--重要的是，虚线圈出的部分不是专利设计的一部分。该设计还包括图片中没有的功能，即显示器中使用的颜色。要了解这里的实际专利是什么，公众必须做得更多：他们可以向美国专利局申请并支付一份专利的硬拷贝，或者在PTO(极其笨重)的配对数据库中导航，希望找到最初提交的图像的可下载版本。\n在图像质量差和虚线表示未受保护的特征之间，甚至几乎不可能识别专利设计是什么。是三排圆形图标的具体排列吗？如果是这样的话，为什么某些圆形图标被排除在外？是西门子设计师为表示“用户”和“接收者”之类的东西而创建的图标吗？如果真的这么难说出专利外观设计到底是什么，那就更难确定其他设计是否侵权了。侵权取决于专利外观设计、被指控的外观设计和现有技术之间的比较。但是，在明确外观设计专利保护的内容之前，这种分析甚至是不可能发生的。\n审查标准低、清晰度不高、由此导致的外观设计专利质量低已经构成了一个很大的问题。但情况可能会变得更糟。支持专利的游说者正在推动赋予外观设计专利所有者更多对技术开发者和用户的权力。他们提出了一项法案，赋予海关和边境保护局在边境扣押产品的权力，只需对产品进行评估，并将其与外观设计专利进行比较，这些专利的所有者正在要求这种新型的特殊待遇。\n赋予CBP如此大的权力将对普通技术用户构成真正的危险。想象一下，CBP试图判定像上面这样的专利设计的侵权行为，这是一个医疗软件的GUI。为了评估侵权行为，CBP官员可以检查设备，包括软件应用程序，看看它们是否与注册处的专利设计匹配。当这些应用程序与医疗服务有关时，用户的医疗隐私可能会受到威胁。\n外观设计专利拥有者不需要比现在更多的权力。相反，我们应该问外观设计专利是否应该存在。我们已经拥有版权了。对没有实际应用的作品授予额外的专利权是否会给公众带来任何好处，这一点并不清楚。", "note_en": "When we talk about patents, we’re usually talking about “utility” patents. Utility patents protect inventions that claim to have some practical application or use. (A lot of them still claim things that are actually  useless, but they’re supposed to be potentially useful.)\n “Design” patents, by contrast, protect only the ornamental or decorative aspects of a design. They don’t protect any kind of functionality. If there’s a functional work to protect, only a utility patent will do.\n Because design patents can only protect non-functional works, they’re kind of like copyrights for visual works. And the bar for creativity and originality in a patented design is low—so low that even a standard-issue graphical user interface can get patent protection, as our latest Stupid Patent of the Month shows.\n Shown below is a patented design owned by Siemens Healthcare GmbH, a company that’s part of Siemens,  the most prolific patent-filer in Europe:\n  This patent, U.S. Patent No. D872,112, is a relatively standard GUI, with rows of circular icons displayed beneath a header bar. But the patent doesn’t protect everything in that picture—importantly, the portions circled by broken lines are  not part of the patented design. The design also includes features that are not in the picture—namely, the colors used in the display. To understand what’s actually been patented here, a member of the public must do more: they can request and pay for a hard copy of the patent from the U.S. Patent Office or navigate through the PTO’s (extremely clunky)  PAIR database in the hopes of finding a downloadable version of the originally-filed image.\n Between the image’s poor quality and the broken lines denoting unprotected features, it’s practically to impossible to identify what the patented design even is. Is it the specific arrangement of circular icons in the three rows? If so, then why are certain circular icons excluded? Is it the icons that a Siemens designer created to represent things like “users” and “receivers?” If it’s this hard to say what the patented design actually is, it will be even harder to determine whether other designs are infringing. Infringement turns on the comparison between the patented design, the accused design, and the prior art. But that analysis can’t even happen until it is clear exactly what a design patent protects.\n The low examination standards, lack of clarity, and resulting low quality of design patents already pose a big problem. But it could be about to get worse. Pro-patent lobbyists are pushing to give design patent owners more power over tech developers and users. They’ve  introduced a bill that gives Customs and Border Protection the power to seize products at the border just by sizing them up and comparing them to design patents, whose owners are demanding this new type of special treatment.\n Giving CBP so much power will pose a real danger to ordinary technology users. Imagine CBP trying to determine infringement for a patented design like the one above, which is a GUI for medical software. To assess infringement, CBP officers could examine a device, including software applications, to see if they match patented designs in the registry. When those applications pertain to health services, the medical privacy of users may be at risk.\n Design patents owners don’t need more power than they have today. Instead, we should be asking whether design patents should exist at all. We already have copyright. It’s not clear that granting extra patent rights to works with no practical application provides any benefit to the public at all.", "posttime": "2020-05-25 04:46:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,专利,patents", "title": "为什么设计专利在华盛顿得到了提振？", "title_en": "Why are Design Patents getting a boost in DC?", "transed": 1, "url": "https://www.eff.org/deeplinks/2020/01/design-patents-are-useless-so-why-are-they-getting-boost-dc", "via": "", "real_tags": ["设计", "专利", "patents"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003564, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2013年11月19日第11卷第10期自从第二种编程语言发明以来，语言之间的互操作性一直是个问题。解决方案的范围从独立于语言的对象模型(如COM(组件对象模型)和CORBA(公共对象请求代理体系结构))到为集成语言而设计的VM(虚拟机)，如JVM(Java虚拟机)和CLR(公共语言运行时)。随着软件变得越来越复杂，硬件变得不那么同质化，单一语言成为整个程序的正确工具的可能性比以往任何时候都要低。随着现代编译器变得更加模块化，有可能出现新一代有趣的解决方案。\n1961年，英国公司Stantec发布了一款名为斑马的计算机，这款计算机之所以有趣，原因有很多，尤其是它的基于数据流的指令集。斑马很难使用其本机指令集的完整形式进行编程，因此它还包含了一个更传统的版本，称为简单代码(Simple Code)。该表单附带了一些限制，包括每个程序最多只能有150条指令。这本手册很有帮助地告诉用户，这并不是一个严重的限制，因为不可能有人会编写一个如此复杂的工作程序，以至于需要超过150条指令。\n如今，这种说法似乎很可笑。即使是相对低级语言(如C)中的简单函数在编译后也有150多条指令，而且大多数程序都远远不止一个函数。从编写汇编代码到用高级语言编写的转变极大地增加了可能的程序的复杂性，各种软件工程实践也是如此。\n软件复杂性增加的趋势丝毫没有减弱的迹象，现代硬件带来了新的挑战。20世纪90年代末，程序员不得不瞄准那些抽象型号很像快速PDP-11的低端PC。在高端，他们会遇到像非常快的PDP-11这样的抽象模型，可能有2到4个(相同的)处理器。现在，移动电话开始出现具有相同ISA(指令集体系结构)但速度不同的八个内核，一些针对不同工作负载(DSP、GPU)优化的其他流处理器，以及其他专用内核。\n表示类的高级语言(类似于人类对问题领域的理解)和表示类的低级语言(类似于硬件)之间的传统划分不再适用。没有一种低级语言具有接近可编程数据流处理器、x86CPU、大规模多线程GPU和VLIW(超长指令字)DSP(数字信号处理器)的语义。想要从可用的硬件中获得最后一点性能的程序员不再有一种语言可以用于所有可能的目标。\n类似地，在抽象光谱的另一端，特定于领域的语言正变得越来越流行。高级语言通常以通用性换取高效表示算法子集的能力。更通用的高级语言(如Java)牺牲了直接操作指针的能力，以换取为程序员提供更抽象的内存模型。SQL等专用语言使某些类别的算法无法实现，但使其领域内的常见任务可以用几行代码来表示。\n您不能再期望一个重要的应用程序是用一种语言编写的。高级语言通常调用用低级语言编写的代码作为其标准库的一部分(例如，GUI呈现)，但是添加调用可能很困难。\n特别是，两种非C语言之间的接口通常很难构建。即使是相对简单的示例，如C++和Java之间的桥接，通常也不会自动处理，需要C接口。Kaffe Native Interface4确实提供了这样做的机制，但它没有被广泛采用，而且有局限性。\n在接下来的几年里，语言之间的接口问题对编译器编写人员来说将变得越来越重要。它提出了许多挑战，在这里详细说明。\n面向对象的语言将代码和数据的一些概念绑定在一起。艾伦·凯(Alan Kay)在施乐公司(Xerox Parc)时帮助开发了面向对象的编程，他将对象描述为通过消息传递进行通信的简单计算机。这个定义为不同语言填写细节留下了很大的回旋余地：\n·一个对象是否应该有零个(如GO)、一个(如Smalltalk、Java、JavaScript、Objective-C)或多个(如C++、Self、Simula)超类或原型？\n多重继承问题是最常见的焦点领域之一。单一继承很方便，因为它简化了实现的许多方面。只需追加字段即可扩展对象；对超类型的强制转换只涉及忽略结尾，而对子类型的强制转换仅涉及检查-指针值保持不变。C++中的向下转换需要通过运行时库函数复杂地搜索运行时类型信息中的继承图。\n孤立地说，这两种类型的继承都是可以实现的，但是如果您想要将一个C++对象公开到Java中，该怎么办呢？您也许可以遵循.NET或Kaffe方法，并且仅支持与C++的子集(托管C++或C++/CLI)的直接互操作性，该子集仅支持将在屏障的Java端公开的类的单一继承。\n一般来说，这是一个很好的解决方案：定义一种语言的子集，该子集清晰地映射到另一种语言，但可以理解另一种语言的全部功能。这就是务实的Smalltalk中采用的方法：5允许Objective-C++对象(可以将C++对象作为实例变量并调用它们的方法)直接公开，就像它们是Smalltalk对象一样，共享相同的底层表示。\n然而，这种方法仍然存在认知障碍。如果您想要直接使用C++框架，例如务实的Smalltalk或.NET中的LLVM，那么您将需要编写单继承类来封装该库用于其大部分核心类型的多重继承类。\n另一种可能的方法是避免公开对象中的任何字段，而只将每个C++类公开为接口。然而，如果没有特殊的编译器支持，就不可能从桥接的类继承，从而无法理解某些接口是随实现一起来的。\n虽然复杂，但与在方法查找含义不同的语言之间交互相比，这是一个更简单的系统。例如，Java和Smalltalk具有几乎相同的对象和内存模型，但是Java将方法分派的概念绑定到类层次结构，而在Smalltalk中，如果两个对象实现同名的方法，则它们可以互换使用。\n这是Redline Smalltalk遇到的问题，1它编译Smalltalk以便在JVM上运行。它实现Smalltalk方法分派的机制包括为每个方法生成一个Java接口，然后在分派之前执行接收器到相关接口类型的强制转换。向Java类发送消息需要额外的信息，因为现有的Java类没有实现这一点；因此，Redline Smalltalk必须退回到使用Java的反射API。\nSmalltalk(和Objective-C)的方法查找更为复杂，因为有许多在其他语言中缺失或受限的第二次机会分派机制。在将Objective-C编译为JavaScript时，而不是使用JavaScript方法调用，您必须将发送的每个Objective-C消息包装在一个小函数中，该函数首先检查该方法是否实际存在，如果不存在，则调用一些查找代码。\n这在JavaScript中相对简单，因为它以一种方便的方式处理各种函数：如果调用一个函数或方法时使用的参数比它预期的多，那么它会将剩余的参数作为它可以预期的数组来接收。围棋也会做类似的事情。类C语言只是将它们放在堆栈上，并期望程序员在不进行错误检查的情况下进行写入。\n内存模型中明显的二分法是在自动释放和手动释放之间。一个稍微重要一点的问题是确定性破坏和非确定性破坏之间的区别。\n在许多情况下，使用Boehm-Demers-Weiser垃圾收集器3运行C是没有问题的(除非内存用完并且有很多看起来像指针的整数)。对于C++来说，做同样的事情要困难得多，因为对象释放是一个可观察到的事件。请考虑以下代码：\nLockHolder类定义了一个非常简单的对象；互斥体传入对象，然后在其构造函数中锁定互斥体，并在析构函数中解锁。现在，想象一下在完全垃圾回收的环境中运行相同的代码-析构函数的运行时间没有定义。\n这个例子相对简单，很容易做对。此时需要垃圾收集的C++实现来运行析构函数，但不需要释放对象。这个习惯用法在从一开始就支持垃圾收集的语言中是不可用的。混合它们的基本问题不是确定谁负责释放内存；相反，为一个模型编写的代码需要确定性操作，而为另一个模型编写的代码不需要确定性操作。\n有两种简单的方法来实现C++的垃圾收集：第一种是让删除操作符调用析构函数，但不回收底层存储；另一种是将删除设为无操作，并在检测到对象不可访问时调用析构函数。\n只调用delete的析构函数在这两种情况下是相同的：它们实际上是无操作的。释放其他资源的析构函数是不同的。在第一种情况下，它们可以确定地运行，但如果程序员不显式删除相关对象，它们将无法运行。在第二种情况下，可以保证它们最终会运行，但不一定会在底层资源耗尽时运行。\n此外，在许多语言中，一个相当常见的习惯用法是自有对象，它等待某个事件或执行一个长时间运行的任务，然后触发回调。然后，回调的接收方负责清理通知器。当它处于活动状态时，它与对象图的其余部分断开连接，因此看起来是垃圾。必须明确告诉收集器它不是。这与没有自动垃圾回收的语言中的模式相反，在没有自动垃圾回收的语言中，除非系统另行通知，否则假定对象是活动的。(汉斯·博姆(Hans Boehm)在1996年的一篇论文中更详细地讨论了其中一些问题。2)。\n所有这些问题都出现在苹果将垃圾收集添加到Objective-C的失败(谢天谢地，不再支持)尝试中。很多Objective-C代码依赖于-dealloc方法中的运行代码。另一个问题与互操作性问题密切相关。该实现同时支持跟踪内存和未跟踪内存，但不在类型系统中公开此信息。请考虑以下代码片段：\nvoid allocateSomeObjects(id*buffer，int count){for(int i=0；i&lt；count；i++)for(int i=0；i&lt；count；i++)for(id allocateSomeObjects(id*buffer，int count)){0}{0}。\n在垃圾收集模式下，无法判断此代码是否正确。它的正确与否取决于呼叫者。如果调用方传递使用NSAllocateCollectable()分配的缓冲区、将NSScannedOption作为第二个参数分配的缓冲区，或者使用堆栈上分配的缓冲区或使用垃圾收集支持编译的编译单元中的全局缓冲区分配的缓冲区，则对象将(至少)与缓冲区一样长。如果调用方传递使用malloc()分配的缓冲区，或者作为C或C++编译单元中的全局缓冲区，那么对象将(可能)在缓冲区之前被释放。这句话中的“潜在”使这成为一个更大的问题：因为它是不确定的，所以很难调试。\nObjective-C的ARC(自动引用计数)扩展不提供完整的垃圾收集(它们仍然允许垃圾周期泄漏)，但它们确实扩展了类型系统以定义此类缓冲区的所有权类型。将对象指针复制到C需要插入包含所有权转移的显式强制转换。\n引用计数还解决了非循环数据的确定性问题。此外，它还提供了一种与手动内存管理互操作的有趣方式：通过设置free()来递减引用计数。循环(或潜在循环)数据结构需要添加循环检测器。大卫·F·培根(David F.Bacon)在IBM的团队已经为周期检测器8设计了许多产品，只要指针能够被准确识别，引用计数就可以成为一种完整的垃圾收集机制。\n不幸的是，循环检测涉及从潜在的循环对象遍历整个对象图。可以采取一些简单的步骤来降低这一成本。最明显的一个就是推迟它。如果对象的引用计数递减但未释放，则该对象仅可能是周期的一部分。如果它后来递增，那么它就不是垃圾循环的一部分(它可能仍然是一个循环的一部分，但您现在还不在乎)。如果它稍后被释放，则它是非循环的。\n周期检测延迟的时间越长，得到的不确定性就越大，但是周期检测器要做的工作就越少。\n如今，大多数人认为异常是由C++普及的：大致等同于C中的setjmp()和long jmp()，尽管可能有不同的机制。\n已经提出了一些其他例外机制。在Smalltalk-80中，异常完全在库中实现。该语言提供的唯一原语是，当您显式地从闭包返回时，您将从声明闭包的作用域返回。如果在堆栈中向下传递闭包，则返回将隐式展开堆栈。\n当Smalltalk异常发生时，它会调用堆栈顶部的处理程序块。然后，这可能会返回，迫使堆栈展开，或者它可能会进行一些清理。堆栈本身是激活记录(即对象)的列表，因此可能会执行更复杂的操作。Common Lisp还提供了一组丰富的异常，包括那些支持立即恢复或重新启动的异常。\n即使在具有类似异常模型的语言中，异常互操作性也很困难。例如，C++和Objective-C都有类似的异常概念，但是期望捕捉void*的C++catch块在遇到Objective-C对象指针时应该怎么做呢？在GNUstep Objective-C运行时6中，在决定不模仿Apple的分段错误行为后，我们选择不捕获它。OSX的最新版本都采用了这种行为，但这个决定有点武断。\n即使您确实从C++捕获了对象指针，这也不意味着您可以使用它做任何事情。当它被捕获时，您已经丢失了所有类型信息，并且无法确定它是Objective-C对象。\n当您开始考虑性能时，更微妙的问题就会悄悄出现。VMKit7的早期版本(在LLVM之上实现Java和CLRVM)使用为C++设计的零成本异常模型。这是零成本，因为进入try块不需要任何费用。然而，当抛出异常时，您必须解析一些描述如何展开堆栈的表，然后调用每个堆栈帧的个性函数来决定是否(以及在哪里)应该捕获异常。\n这种机制非常适合C++，因为在C++中很少出现异常，但是Java使用异常来报告大量相当常见的错误情况。在基准测试中，放卷机的性能是一个限制因素。为了避免这种情况，针对可能引发异常的方法修改了调用约定。这些函数将异常作为第二个返回值返回(通常在不同的寄存器中)，每个调用只需检查该寄存器是否包含0，如果不包含，则跳转到异常处理块。\n当您控制每个调用方的代码生成器时，这很好，但在跨语言场景中情况并非如此。您可以通过向C添加另一个反映此行为的调用约定或提供类似于GO中通常用于返回错误条件的多返回值机制来解决此问题，但这将要求每个C调用者都了解外语语义。\n当您开始将函数式语言包括在您希望与之互操作的集合中时，可变性的概念就变得很重要。像Haskell这样的语言没有可变类型。就地修改数据结构是编译器可以作为优化来做的事情，但这并不是在语言中公开的事情。\n这是F#遇到的问题，它作为OCaml的一种方言出售，可以与其他.NET语言集成，使用C#编写的类，等等。C#已经有了可变和不可变类型的概念。这是一个非常强大的抽象，但不可变类只是一个不公开任何非只读字段的类，并且只读字段可以包含对对象的引用(通过任意引用链)，这些对象引用的可变对象的状态可以在函数代码下更改。在其他语言(如C++或Objective-C)中，可变性通常是通过定义一些不可变的类在类系统中实现的，但是没有语言支持，也没有确定对象是否可变的简单方法。\n在语言提供的类型系统中，C和C++具有非常不同的可变性概念：对对象的特定引用可能会修改它，也可能不会修改它，但这并不意味着对象本身不会改变。这一点，再加上深度复制问题，使得函数式语言和面向对象语言的接口成为一个难题。\n单体为界面提供了一些诱人的可能性。单体是计算步骤的有序序列。在面向对象的世界中，这是一系列消息发送或方法调用。具有Const(常量)的C++概念的方法(即，不修改对象的状态)可以在Monad外部调用，因此服从推测性执行和回溯，而其他方法应该按照Monad定义的严格顺序调用。\n可变性和并行性是密切相关的。编写可维护、可伸缩、并行代码的基本规则是，任何对象都不能既是可变的，又是别名的。在纯函数式语言中实施这一点是微不足道的：根本没有对象是可变的。Erlang以流程字典的形式对可变性做出了让步-一个仅可从当前Erlang进程访问的可变字典，因此永远不能共享。\n将具有不同共享内容概念的语言连接起来会带来一些独特的问题。这对于以大规模并行系统或GPU为目标的语言来说很有趣，在这些系统或GPU中，语言的模型与底层硬件密切相关。\n这是试图提取部分C/C++/Fortran程序以转换为OpenCL时遇到的问题。源语言通常将就地修改作为实现算法的最快方式，而OpenCL则鼓励对源缓冲区进行处理以生成输出b的模型。\n..", "note_en": "November 19, 2013   Volume 11, issue 10       Interoperability between languages has been a problem since the second programming language was invented. Solutions have ranged from language-independent object models such as COM (Component Object Model) and CORBA (Common Object Request Broker Architecture) to VMs (virtual machines) designed to integrate languages, such as the JVM (Java Virtual Machine) and CLR (Common Language Runtime). With software becoming ever more complex and hardware less homogeneous, the likelihood of a single language being the correct tool for an entire program is lower than ever. As modern compilers become more modular, there is potential for a new generation of interesting solutions.\n In 1961 the British company Stantec released a computer called the ZEBRA, which was interesting for a number of reasons, not least of which was its data flow-based instruction set. The ZEBRA was quite difficult to program with the full form of its native instruction set, so it also included a more conventional version, called Simple Code. This form came with some restrictions, including a limit of 150 instructions per program. The manual helpfully informs users that this is not a severe limitation, as it is impossible that someone would write a working program so complex that it would need more than 150 instructions.\n Today, this claim seems ludicrous. Even simple functions in a relatively low-level language such as C have more than 150 instructions once they are compiled, and most programs are far more than a single function. The shift from writing assembly code to writing in a higher-level language dramatically increased the complexity of programs that were possible, as did various software engineering practices.\n The trend toward increased complexity in software shows no sign of abating, and modern hardware creates new challenges. Programmers in the late 1990s had to target PCs at the low end that had an abstract model a lot like a fast PDP-11. At the high end, they would have encountered an abstract model like a very fast PDP-11, possibly with two to four (identical) processors. Now, mobile phones are starting to appear with eight cores with the same ISA (instruction set architecture) but different speeds, some other streaming processors optimized for different workloads (DSPs, GPUs), and other specialized cores.\n The traditional division between high-level languages representing the class that is similar to a human&#39;s understanding of the problem domain and low-level languages representing the class similar to the hardware no longer applies. No low-level language has semantics that are close to a programmable data-flow processor, an x86 CPU, a massively multithreaded GPU, and a VLIW (very long instruction word) DSP (digital signal processor). Programmers wanting to get the last bit of performance out of the available hardware no longer have a single language they can use for all probable targets.\n Similarly, at the other end of the abstraction spectrum, domain-specific languages are growing more prevalent. High-level languages typically trade generality for the ability to represent a subset of algorithms efficiently. More general-purpose high-level languages such as Java sacrifice the ability to manipulate pointers directly in exchange for providing the programmer with a more abstract memory model. Specialized languages such as SQL make certain categories of algorithms impossible to implement but make common tasks within their domain possible to express in a few lines.\n You can no longer expect a nontrivial application to be written in a single language. High-level languages typically call code written in lower-level languages as part of their standard libraries (for example, GUI rendering), but adding calls can be difficult.\n In particular, interfaces between two languages that are not C are often difficult to construct. Even relatively simple examples, such as bridging between C++ and Java, are not typically handled automatically and require a C interface. The Kaffe Native Interface 4 did provide a mechanism for doing this, but it was not widely adopted and had limitations.\n The problem of interfacing between languages is going to become increasingly important to compiler writers over the coming years. It presents a number of challenges, detailed here.\n  Object-oriented languages bind some notion of code and data together. Alan Kay, who helped develop object-oriented programming while at Xerox PARC, described objects as &#34;simple computers that communicate via message passing.&#34; This definition leaves a lot of leeway for different languages to fill in the details:\n   • Should there be zero (e.g., Go), one (e.g., Smalltalk, Java, JavaScript, Objective-C), or many (e.g., C++, Self, Simula) superclasses or prototypes for an object?\n    The question of multiple inheritance is one of the most common areas of focus. Single inheritance is convenient, because it simplifies many aspects of the implementation. Objects can be extended just by appending fields; a cast to the supertype just involves ignoring the end, and a cast to a subtype just involves a check—the pointer values remain the same. Downcasting in C++ requires a complex search of the inheritance graph in the run-time type information via a runtime library function.\n In isolation, both types of inheritance are possible to implement, but what happens if you want, for example, to expose a C++ object into Java? You could perhaps follow the .NET or Kaffe approach, and support direct interoperability with only a subset of C++ (Managed C++ or C++/CLI) that supports single inheritance only for classes that will be exposed on the Java side of the barrier.\n This is a good solution in general: define a subset of one language that maps cleanly to the other but can understand the full power of the other. This is the approach taken in Pragmatic Smalltalk: 5 allow Objective-C++ objects (which can have C++ objects as instance variables and invoke their methods) to be exposed directly as if they were Smalltalk objects, sharing the same underlying representation.\n This approach still provides a cognitive barrier, however. If you want to use a C++ framework directly, such as LLVM from Pragmatic Smalltalk or .NET, then you will need to write single-inheritance classes that encapsulate the multiple-inheritance classes that the library uses for most of its core types.\n Another possible approach would be to avoid exposing any fields within the objects and just expose each C++ class as an interface. This would, however, make it impossible to inherit from the bridged classes without special compiler support to understand that some interfaces came along with implementation.\n Although complex, this is a simpler system than interfacing between languages that differ on what method lookup means. For example, Java and Smalltalk have almost identical object and memory models, but Java ties the notion of method dispatch to the class hierarchy, whereas in Smalltalk two objects can be used interchangeably if they implement methods with the same names.\n This is a problem encountered by RedLine Smalltalk, 1 which compiles Smalltalk to run on JVM. Its mechanism for implementing Smalltalk method dispatch involves generating a Java interface for each method and then performing a cast of the receiver to the relevant interface type before dispatch. Sending messages to Java classes requires extra information, because existing Java classes don&#39;t implement this; thus, RedLine Smalltalk must fall back to using Java&#39;s Reflection APIs.\n The method lookup for Smalltalk (and Objective-C) is more complex, because there are a number of second-chance dispatch mechanisms that are either missing or limited in other languages. When compiling Objective-C to JavaScript, rather than using the JavaScript method invocation, you must wrap each Objective-C message send in a small function that first checks if the method actually exists and, if it doesn&#39;t, calls some lookup code.\n This is relatively simple in JavaScript because it handles variadic functions in a convenient way: if a function or method is called with more arguments than it expects, then it receives the remainder as an array that it can expect. Go does something similar. C-like languages just put them on the stack and expect the programmer to do the write with no error checking.\n  The obvious dichotomy in memory models is between automatic and manual deallocation. A slightly more important concern is the difference between deterministic and nondeterministic destruction.\n It is possible to run C with the Boehm-Demers-Weiser garbage collector 3 without problems in many cases (unless you run out of memory and have a lot of integers that look like pointers). It is much harder to do the same for C++, because object deallocation is an observable event. Consider the following code:\n  The  LockHolder class defines a very simple object; a mutex passes into the object, which then locks the mutex in its constructor and unlocks it in the destructor. Now, imagine running this same code in a fully garbage-collected environment—the time at which the destructor runs is not defined.\n This example is relatively simple to get right. A garbage-collected C++ implementation is required to run the destructor at this point but not to deallocate the object. This idiom is not available in languages that were designed to support garbage collection from the start. The fundamental problem with mixing them is not determining who is responsible for releasing memory; rather, it is that code written for one model expects deterministic operation, whereas code written for the other does not.\n There are two trivial approaches to implementing garbage collection for C++: the first is to make the  delete operator invoke destructors but not reclaim the underlying storage; the other is to make  delete a no-op and call destructors when the object is detected as unreachable.\n Destructors that call only  delete are the same in both cases: they are effectively no-ops. Destructors that release other resources are different. In the first case, they run deterministically but will fail to run if the programmer does not explicitly delete the relevant object. In the second case, they are guaranteed to run eventually but not necessarily by the time the underlying resource is exhausted.\n Additionally, a fairly common idiom in many languages is a self-owned object that waits for some event or performs a long-running task and then fires a callback. The receiver of the callback is then responsible for cleaning up the notifier. While it&#39;s live, it is disconnected from the rest of the object graph and so appears to be garbage. The collector must be explicitly told that it is not. This is the opposite of the pattern in languages without automatic garbage collection, where objects are assumed to be live unless the system is told otherwise. (Hans Boehm discussed some of these issues in more detail in a 1996 paper. 2)\n All of these problems were present with Apple&#39;s ill-fated (and, thankfully, no longer supported) attempt to add garbage collection to Objective-C. A lot of Objective-C code relies on running code in the  -dealloc method. Another issue was closely related to the problem of interoperability. The implementation supported both traced and untraced memory but did not expose this information in the type system. Consider the following snippet:\n void allocateSomeObjects (id * buffer, int count)  {        for (int i=0 ; i&lt;count ; i++)        {              buffer [i] = [SomeClass new];        }  }\n In garbage-collected mode, it is impossible to tell if this code is correct. Whether it is correct or not depends on the caller. If the caller passes a buffer allocated with  NSAllocateCollectable(), with  NSScannedOption as the second parameter, or with a buffer allocated on the stack or in a global in a compilation unit compiled with garbage-collection support, then the objects will last (at least) as long as the buffer. If the caller passes a buffer that was allocated with  malloc() or as a global in a C or C++ compilation unit, then the objects will (potentially) be deallocated before the buffer. The  potentially in this sentence makes this a bigger problem: because it&#39;s nondeterministic, it is hard to debug.\n The ARC (Automatic Reference Counting) extensions to Objective-C do not provide complete garbage collection (they still allow garbage cycles to leak), but they do extend the type system to define the ownership type for such buffers. Copying object pointers to C requires the insertion of an explicit cast containing an ownership transfer.\n Reference counting also solves the determinism problem for acyclic data. In addition, it provides an interesting way of interoperating with manual memory management: by making  free() decrement the reference count. Cyclic (or potentially cyclic) data structures require the addition of a cycle detector. David F. Bacon&#39;s team at IBM has produced a number of designs for cycle detectors 8 that allow reference counting to be a full garbage-collection mechanism, as long as pointers can be accurately identified.\n Unfortunately, cycle detection involves walking the entire object graph from a potentially cyclic object. Some simple steps can be taken to lessen this cost. The obvious one is to defer it. An object is only potentially part of a cycle if its reference count is decremented but not deallocated. If it is later incremented, then it is not part of a garbage cycle (it may still be part of a cycle, but you don&#39;t care yet). If it is later deallocated, then it is acyclic.\n The longer you defer cycle detection, the more nondeterminism you get, but the less work the cycle detector has to do.\n  These days, most people think of exceptions in the sense popularized by C++: something that is roughly equivalent to  setjmp() and  longjmp() in C, although possibly with a different mechanism.\n A number of other mechanisms for exceptions have been proposed. In Smalltalk-80, exceptions are implemented entirely in the library. The only primitive that the language provides is that when you explicitly return from a closure, you return from the scope in which the closure was declared. If you pass a closure down the stack, then a return will implicitly unwind the stack.\n When a Smalltalk exception occurs, it invokes a handler block on the top of the stack. This may then return, forcing the stack to unwind, or it may do some cleanup. The stack itself is a list of activation records (which are objects) and therefore may do something more complex. Common Lisp provides a rich set of exceptions too, including those that support resuming or restarting immediately afterward.\n Exception interoperability is difficult even within languages with similar exception models. For example, C++ and Objective-C both have similar notions of an exception, but what should a C++ catch block that expects to catch a  void* do when it encounters an Objective-C object pointer? In the GNUstep Objective-C runtime 6, we chose not to catch it after deciding not to emulate Apple&#39;s behavior of a segmentation fault. Recent versions of OS X have adopted this behavior, but the decision is somewhat arbitrary.\n Even if you do catch the object pointer from C++, that doesn&#39;t mean that you can do anything with it. By the time it&#39;s caught, you&#39;ve lost all of the type information and have no way of determining that it is an Objective-C object.\n Subtler issues creep in when you start to think about performance. Early versions of VMKit 7 (which implements Java and CLR VMs on top of LLVM) used the zero-cost exception model designed for C++. This is  zero cost because entering a try block costs nothing. When throwing an exception, however, you must parse some tables that describe how to unwind the stack, then call into a personality function for each stack frame to decide whether (and where) the exception should be caught.\n This mechanism works very well for C++, where exceptions are rare, but Java uses exceptions to report lots of fairly common error conditions. In benchmarks, the performance of the unwinder was a limiting factor. To avoid this, the calling convention was modified for methods that were likely to throw an exception. These functions returned the exception as a second return value (typically in a different register), and every call just had to check that this register contained 0 or jump to the exception handling block if it did not.\n This is fine when you control the code generator for every caller, but this is not the case in a cross-language scenario. You might address the issue by adding another calling convention to C that mirrors this behavior or that provides something like the multiple-return-values mechanism commonly used in Go for returning error conditions, but that would require every C caller to be aware of the foreign language semantics.\n  When you start to include functional languages in the set with which you wish to interoperate, the notion of mutability becomes important. A language such as Haskell has no mutable types. Modifying a data structure in place is something that the compiler may do as an optimization, but it&#39;s not something exposed in the language.\n This is a problem encountered by F#, which is sold as a dialect of OCaml and can integrate with other .NET languages, use classes written in C#, and so on. C# already has a notion of mutable and immutable types. This is a very powerful abstraction, but an immutable class is simply one that doesn&#39;t expose any fields that are not read only, and a read-only field may contain references to objects that (via an arbitrary chain of references) refer to mutable objects whose state may be changed out from under the functional code. In other languages, such as C++ or Objective-C, mutability is typically implemented within the class system by defining some classes that are immutable, but there is no language support and no easy way of determining whether an object is mutable.\n C and C++ have a very different concept of mutability in the type system provided by the language: a particular reference to an object may or may not modify it, but this doesn&#39;t mean that the object itself won&#39;t change. This, combined with the deep copying problem, makes interfacing functional and object-oriented languages a difficult problem.\n Monads provide some tantalizing possibilities for the interface. A monad is an ordered sequence of computational steps. In an object-oriented world, this is a series of message sends or method invocations. Methods that have the C++ notion of const (i.e., do not modify the state of the object) may be invoked outside of the monad, and so are amenable to speculative execution and backtracking, whereas other methods should be invoked in a strict sequence defined by the monad.\n  Mutability and parallelism are closely related. The cardinal rule for writing maintainable, scalable, parallel code is that no object may be both mutable and aliased. This is trivial to enforce in a purely functional language: no object is mutable at all. Erlang makes one concession to mutability, in the form of a process dictionary—a mutable dictionary that is accessible only from the current Erlang process and so can never be shared.\n Interfacing languages with different notions of what can be shared presents some unique problems. This is interesting for languages intended to target massively parallel systems or GPUs, where the model for the language is intimately tied to the underlying hardware.\n This is the issue encountered when trying to extract portions of C/C++/Fortran programs to turn into OpenCL. The source languages typically have in-place modification as the fastest way of implementing an algorithm, whereas OpenCL encourages a model where a source buffer is processed to generate an output b\n......", "posttime": "2020-05-25 04:15:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "语言,cross,对象", "title": "跨语言互操作性的挑战(2013)", "title_en": "The Challenge of Cross-language Interoperability (2013)", "transed": 1, "url": "https://queue.acm.org/detail.cfm?id=2543971", "via": "", "real_tags": ["语言", "cross", "对象"]}, {"category": "", "categoryclass": "", "imagename": "3445c16f7454e9db6b49393651c4472b.jpg", "infoid": 1003563, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在网络安全领域，总是有很多人谈论培训员工意识到网络钓鱼企图的重要性。培训确实有效，但它不是万能的，现实情况是，总会有员工在接受培训后上当受骗。\n尽管有各种行业估计，但代码库管理公司GitLab Inc.。他们决定对自己的员工进行网络钓鱼，看看会发生什么。结果并不好：五分之一的员工被假电子邮件迷住了。\n周三宣布的演习涉及GitLab模仿针对GitLab员工的网络钓鱼行动，目的是获取GitLab.com凭据。多因素身份验证等防御措施不被认为是测试的一部分，虚假网络钓鱼攻击旨在模仿基本攻击，通过虚假登录页面集中在主要身份验证凭据上。\n这次演习背后的GitLab团队购买了域名gitlab.company，然后使用G Suite来简化钓鱼电子邮件的传递。域名和G Suite服务被设置为看起来合法，并配有SSL证书，以使电子邮件在自动网络钓鱼网站检测和人工检查中看起来不那么可疑。\nGitLab的50名员工收到了一封电子邮件，要求他们点击一个链接接受升级。这个链接将他们带到了假的gitlab.company网站，他们被要求在那里输入他们的登录详细信息。\n积极的一面是，50名目标员工中只有17人点击了提供的链接。然而，这17人中有10人随后试图登录到假网站。那些登录到虚假网站的人随后被重定向至GitLab手册的网络钓鱼测试部分。\n收到这封虚假钓鱼邮件的50名员工中，有6名向GitLab的安全运营团队报告称该邮件可疑。\n20%的数字与更广泛的行业预期大致持平。本周早些时候发布的Verizon 2030数据泄露调查报告发现，近四分之一的入侵涉及网络钓鱼。\n威胁检测公司Red Canary Inc.的联合创始人兼首席产品官克里斯·罗斯(Chris Rothe)告诉SiliconANGLE：“网络钓鱼是无法完全预防的一个很好的例子。”因为电子邮件是一项关键的业务功能，所以在大多数情况下，它必须针对其业务功能而不是安全性进行优化。IT团队可以使用很多策略来减少成功的网络钓鱼攻击者的数量--电子邮件拦截、剥离和分析附件、意识培训--但没有100%的解决方案。“。\n通过一键订阅我们的YouTube频道(如下所示)，显示您对我们使命的支持。我们的订阅用户越多，YouTube向您推荐的相关企业和新兴技术内容就越多。谢谢!。\n…。我们还想告诉您我们的使命，以及您如何帮助我们完成它。SiliconANGLE Media Inc.的商业模式是基于内容的内在价值，而不是广告。与许多在线出版物不同的是，我们没有付费墙或投放横幅广告，因为我们想让我们的新闻保持开放，不受影响，也不需要追逐流量。关于SiliconANGLE的新闻、报道和评论-以及我们的硅谷演播室和CUBE的全球巡回视频团队提供的现场无脚本视频-需要大量的辛勤工作、时间和金钱。要保持高质量，需要赞助商的支持，这些赞助商与我们对无广告新闻内容的愿景保持一致。\n如果您喜欢这里的报道、视频采访等无广告内容，请花点时间查看一下我们赞助商支持的视频内容样本，发推特表示支持，并不断回到SiliconANGLE。", "note_en": "There’s always a lot of talk in cybersecurity about the importance of training employees to be aware of phishing attempts. Training does work but it’s not a panacea, the reality being is that there will always be employees who get tricked even with training.\n Although there are various industry estimates, code repository management firm GitLab Inc. decided to phish their own employees to see what would happen. The result was not good: One in five employees fell for the fake emails.\n The exercise announced Wednesday involved GitLab emulate a phishing campaign against GitLab employees with the intent of capturing GitLab.com credentials. Defenses such as multifactor authentication were not considered part of the test, with the fake phishing attack designed to mimic a basic attack concentrating on primary authentication credentials via a fake login page.\n The GitLab team behind the exercise purchased the domain name gitlab.company, then used G Suite to facilitate the delivery of the phishing email. The domain name and G Suite services were set up to look legitimate, complete with SSL certificates to make the emails look less suspicious to automated phishing site detection and human inspection.\n Fifty GitLab employees were targeted with an email that asked them to click on a link to accept an upgrade. The link took them to the fake gitlab.company website where they were asked to enter their login details.\n On the positive side, only 17 of the 50 targeted employees clicked on the provided link. However, 10 of those 17 then attempted to log in on the fake site. Those who logged in on the fake site were then redirected to the  phishing test section of the GitLab Handbook.\n Six of the 50 employees who received the fake phishing email reported the email as suspicious to GitLab’s security operations team.\n The 20% figure is roughly on par with broader industry expectations. The  Verizon 2030 Data Breach Investigations Report released earlier this week found that phishing was involved in nearly one-quarter of breaches.\n “Phishing is a great example of something that cannot be fully prevented,” Chris Rothe, co-founder and chief product officer at threat detection firm  Red Canary Inc., told SiliconANGLE . “Because email is a critical business function, it has to be optimized for its business function and not security in most cases. There are many strategies IT teams can use to reduce the number of successful phishing attackers — email blocking, stripping and analyzing attachments, awareness training — but there is no 100% solution.”\n  Show your support for our mission with our one-click subscription to our YouTube channel (below). The more subscribers we have, the more YouTube will suggest relevant enterprise and emerging technology content to you. Thanks!\n  … We’d also like to tell you about our mission and how you can help us fulfill it. SiliconANGLE Media Inc.’s business model is based on the intrinsic value of the content, not advertising. Unlike many online publications, we don’t have a paywall or run banner advertising, because we want to keep our journalism open, without influence or the need to chase traffic. The journalism, reporting and commentary on  SiliconANGLE — along with live, unscripted video from our Silicon Valley studio and globe-trotting video teams at   theCUBE — take a lot of hard work, time and money. Keeping the quality high requires the support of sponsors who are aligned with our vision of ad-free journalism content.\n If you like the reporting, video interviews and other ad-free content here, please take a moment to check out a sample of the video content supported by our sponsors,   tweet your support, and keep coming back to   SiliconANGLE.", "posttime": "2020-05-25 03:44:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "员工,employees,钓鱼", "title": "20%的GitLab员工在网络钓鱼测试中交出登录凭据", "title_en": "20% of GitLab Employees Handed Over Login Credentials in Phishing Test", "transed": 1, "url": "https://siliconangle.com/2020/05/21/gitlab-runs-phishing-test-employees-20-handing-credentials/", "via": "", "real_tags": ["员工", "employees", "钓鱼"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003562, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "int解压缩器(Void){static int c，len；crBegin；While(1){c=getchar()；if(c==EOF)Break；if(c==0xFF){len=getchar()；c=getchar()；While(len--)crReturn(C)；}Else crReturn(C)；}crReturn(EOF)；crish；}。\nvoid parser(Int C){crBegin；While(1){/*第一个字符已在c*/if(c==EOF)Break；if(isalpha(C)){do{add_to_Token(C)；crReturn()；}While(isalpha(C))；get_Token(Word)；}add_to_Token(C)；get_Token(PUNCT)；crReturn()；}crish；}。\n我们已经将解压缩器和解析器都重写为被调用者，对于上次我们不得不进行的大规模重构，根本不需要。每个函数的结构都精确地反映了其原始形式的结构。阅读器可以推导出解析器识别的语法，或者说解压器使用的压缩数据格式，这比通过读取模糊的状态机代码容易得多。一旦您理解了新的格式，控制流就会很直观：当解压缩器有一个字符时，它会用crReturn将其传递回调用者，并在需要另一个字符时等待再次调用。当解析器需要另一个字符时，它使用crReturn返回，并等待使用参数c中的新字符再次调用。代码有一个小小的结构变化：parser()现在在循环的末尾有它的getchar()(好吧，对应的crReturn)，而不是在开始处，因为当进入函数时，第一个字符已经在c中了。我们可以接受这种微小的结构变化，或者如果我们真的对它有强烈的感觉，我们可以指定parser()需要一个初始化调用，然后才能开始向它提供字符。当然，和以前一样，我们不必使用协程宏来重写这两个例程。一个就足够了；另一个可以是它的调用者。我们已经实现了我们计划实现的目标：一种可移植的ANSIC方法，可以在生产者和消费者之间传递数据，而无需将其重写为显式状态机。我们通过将C预处理器与switch语句的一个很少使用的特性相结合来创建隐式状态机，从而实现了这一点。当然，这个把戏违反了书中的每一个编码标准。试着在你公司的代码中这样做，你可能会受到严厉的斥责，如果不是纪律处分的话！您在宏中嵌入了无与伦比的花括号，在子块中使用了大小写，对于crReturn宏，其内容具有极大的破坏性。你没有因为这种不负责任的编码行为而被当场解雇，这真是个奇迹。你该为自己害臊。我认为这里的编码标准有问题。我在本文中展示的示例不是很长，也不是很复杂，在重写为状态机时仍然可以理解。但是，随着函数变长，所需的重写程度变得更高，清晰度的损失也会变得非常非常严重。考虑一下。由CASE STATE1：/*执行某些活动*/IF(条件)STATE=STATE2；ELSE STATE=STATE3形式的小块构建的函数；\n对于读者来说，与由小块组成的函数没有太大不同，一个是调用方，另一个是被调用方，是真的，但函数的视觉结构是相同的，它们提供的对其底层算法的洞察力也完全一样小。同样会因为使用mycoroutine宏而解雇您的人，也会因为用goto语句连接的小块构建函数而解雇您！这一次他们是对的，因为这样的函数布局严重地模糊了算法的结构。编码标准旨在清晰明了。通过将开关、返回和用例等重要内容隐藏在混淆宏中，编码标准会声称您模糊了程序的语法结构，违反了清晰度要求。但是您这样做是因为您揭示了程序的算法结构，而这很可能是读者想知道的！任何以牺牲算法清晰度为代价而坚持句法清晰度的编码标准都应该重写。如果你的雇主因为你使用这个把戏而解雇了你，在保安人员把你拖出大楼时，反复告诉他们这一点。在严肃的应用程序中，这个玩具协同程序实现不太可能有用，因为它依赖于静态变量，因此它不是可重入的或多线程的。理想情况下，在实际应用程序中，您可能希望能够在几个不同的上下文中调用相同的函数，并且在给定上下文中的每次调用时，在相同上下文中的最后一次返回之后立即恢复控制。这很容易做到。我们安排一个额外的函数参数，它是指向上下文结构的指针；我们将所有LocalState和协程状态变量声明为该结构的元素。有点难看，因为突然之间你不得不", "note_en": "int decompressor(void) { static int c, len; crBegin; while (1) { c = getchar(); if (c == EOF) break; if (c == 0xFF) { len = getchar(); c = getchar(); while (len--)\t crReturn(c); } else\t crReturn(c); } crReturn(EOF); crFinish;}\n void parser(int c) { crBegin; while (1) { /* first char already in c */ if (c == EOF) break; if (isalpha(c)) { do { add_to_token(c);\t\tcrReturn( ); } while (isalpha(c)); got_token(WORD); } add_to_token(c); got_token(PUNCT);\tcrReturn( ); } crFinish;}\n We have rewritten both decompressor and parser as callees, with noneed at all for the massive restructuring we had to do last time wedid this. The structure of each function exactly mirrors thestructure of its original form. A reader can deduce the grammarrecognised by the parser, or the compressed data format used by thedecompressor, far more easily than by reading the obscurestate-machine code. The control flow is intuitive once you havewrapped your mind around the new format: when the decompressor has acharacter, it passes it back to the caller with crReturn and waits to be called again when anothercharacter is required. When the parser needs another character, itreturns using  crReturn, and waits to be called againwith the new character in the parameter  c. There has been one small structural alteration to the code: parser() now has its  getchar() (well, thecorresponding  crReturn) at the end of the loop insteadof the start, because the first character is already in c when the function is entered. We could accept thissmall change in structure, or if we really felt strongly about it wecould specify that  parser() required an&#34;initialisation&#34; call before you could start feeding it characters. As before, of course, we don&#39;t have to rewrite both routines usingthe coroutine macros. One will suffice; the other can be its caller. We have achieved what we set out to achieve: a portable ANSI C meansof passing data between a producer and a consumer without the needto rewrite one as an explicit state machine. We have done this bycombining the C preprocessor with a little-used feature of the switch statement to create an  implicit statemachine.   Of course, this trick violates every coding standard in the book.Try doing this in your company&#39;s code and you will probably besubject to a stern telling off if not disciplinary action! You haveembedded unmatched braces in macros, used  case withinsub-blocks, and as for the  crReturn macro with itsterrifyingly disruptive contents . . . It&#39;s a wonder youhaven&#39;t been fired on the spot for such irresponsible codingpractice. You should be ashamed of yourself. I would claim that the coding standards are at fault here. Theexamples I&#39;ve shown in this article are not very long, not verycomplicated, and still just about comprehensible when rewritten asstate machines. But as the functions get longer, the degree ofrewriting required becomes greater and the loss of clarity becomesmuch, much worse. Consider. A function built of small blocks of the form case STATE1: /* perform some activity */ if (condition) state = STATE2; else state = STATE3;\n is not very different, to a reader, from a function built of smallblocks of the form One is caller and the other is callee, true, but the visualstructure of the functions are the same, and the insights theyprovide into their underlying algorithms are exactly as small aseach other. The same people who would fire you for using mycoroutine macros would fire you just as loudly for building afunction out of small blocks connected by  gotostatements! And this time they would be right, because laying out afunction like that obscures the structure of the algorithm horribly. Coding standards aim for clarity. By hiding vital things like switch,  return and  casestatements inside &#34;obfuscating&#34; macros, the coding standards wouldclaim you have obscured the syntactic structure of the program, andviolated the requirement for clarity. But you have done so in thecause of revealing the  algorithmic structure of theprogram, which is far more likely to be what the reader wants toknow! Any coding standard which insists on syntactic clarity at theexpense of algorithmic clarity should be rewritten. If your employerfires you for using this trick, tell them that repeatedly as thesecurity staff drag you out of the building.   In a serious application, this toy coroutine implementation isunlikely to be useful, because it relies on  staticvariables and so it fails to be re-entrant or multi-threadable.Ideally, in a real application, you would want to be able to callthe same function in several different contexts, and at each call ina given context, have control resume just after the last return inthe same context. This is easily enough done. We arrange an extra function parameter,which is a pointer to a context structure; we declare all our localstate, and our coroutine state variable, as elements of thatstructure. It&#39;s a little bit ugly, because suddenly you have to use ctx-&gt;i as a loop counter where you would previouslyjust have used  i; virtually all your serious variablesbecome elements of the coroutine context structure. But it removesthe problems with re-entrancy, and still hasn&#39;t impacted the structure of the routine. (Of course, if C only had Pascal&#39;s  with statement, wecould arrange for the macros to make this layer of indirection trulytransparent as well. A pity. Still, at least C++ users can managethis by having their coroutine be a class member, and keeping allits local variables in the class so that the scoping is implicit.) Included here is a C header file that implements this coroutinetrick as a set of pre-defined macros. There are two sets of macrosdefined in the file, prefixed  scr and  ccr.The  scr macros are the simple form of the technique,for when you can get away with using  static variables;the  ccr macros provide the advanced re-entrant form.Full documentation is given in a comment in the header file itself. Note that Visual C++ version 6 doesn&#39;t like this coroutine trick,because its default debug state (Program Database for Edit andContinue) does something strange to the  __LINE__ macro.To compile a coroutine-using program with VC++ 6, you must turn offEdit and Continue. (In the project settings, go to the &#34;C/C++&#34; tab,category &#34;General&#34;, setting &#34;Debug info&#34;. Select any option other than &#34;Program Database for Edit and Continue&#34;.) (The header file is MIT-licensed, so you can use it in anything youlike without restriction. If you do find something the MIT licencedoesn&#39;t permit you to do, mail me,and I&#39;ll probably give you explicit permission to do it anyway.) Follow this link for  coroutine.h. Thanks for reading. Share and enjoy!   Donald Knuth,  The Art of Computer Programming, Volume1. Addison-Wesley, ISBN 0-201-89683-4. Section 1.4.2 describescoroutines in the &#34;pure&#34; form. http://www.lysator.liu.se/c/duffs-device.htmlis Tom Duff&#39;s own discussion of Duff&#39;s device. Note, right at thebottom, a hint that Duff might also have independently invented thiscoroutine trick or something very like it. Update, 2005-03-07: TomDuff confirms this in a blog comment. The &#34;revolting way to useswitches to implement interrupt driven state machines&#34; of which hespeaks in his original email is indeed the same trick as I describehere. PuTTYis a Win32 Telnet and SSH client. The SSH protocol code containsreal-life use of this coroutine trick. As far as I know, this is theworst piece of C hackery ever seen in serious production code.\n  $Id$ Copyright © 2000 Simon Tatham. This document is OpenContent. You may copy and use the text under the terms of the OpenContentLicence. Please send comments and criticism to anakin@pobox.com.", "posttime": "2020-05-25 03:43:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,协程,coroutines", "title": "C语言中的协程程序", "title_en": "Coroutines in C", "transed": 1, "url": "https://www.chiark.greenend.org.uk/~sgtatham/coroutines.html", "via": "", "real_tags": ["程序", "协程"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003560, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "来源：GitHub", "note_en": "Source at GitHub", "posttime": "2020-05-25 03:26:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "音乐,based,来源", "title": "Ansiplay.js-基于Ansiplay.exe的简单ANSI音乐播放器", "title_en": "Ansiplay.js – Simple ANSI Music Player based on Ansiplay.exe", "transed": 1, "url": "https://andyherbert.github.io/ansiplay.js/", "via": "", "real_tags": ["音乐", "based", "来源"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003559, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "⚫️⚪️", "note_en": "⚫️  ⚪️", "posttime": "2020-05-25 03:26:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "lets", "title": "让我们一起画吧", "title_en": "Lets Draw Together", "transed": 1, "url": "https://multiuser-sketchpad.glitch.me/", "via": "", "real_tags": ["lets"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003558, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：流氓基站是一种有效的攻击载体。蜂窝基带是智能手机安全性的关键部分：它们甚至在认证之前就会解析大量数据。因此，它们可以为攻击者提供一种非常隐蔽的方式来收集有关发出的呼叫的信息，甚至可以通过无线方式升级到主操作系统。在本文中，我们讨论了一种新的蜂窝模糊框架，旨在帮助安全研究人员发现蜂窝基带和类似嵌入式系统中的关键缺陷。BaseSAFE允许部分重新托管蜂窝基带，用于快速检测设备外的毛发，即使是闭源固件BLOB。BaseSAFE的清理插件分配器可以快速发现基于堆的缓冲区溢出。使用我们的概念验证工具，我们模糊了基于Nucleus RTOS的联发科蜂窝基带的各种解析器，这些解析器可以从流氓基站访问。仿真器插装是高度优化的，对于我们的复杂测试用例，每个内核每秒的执行次数达到数百次，总共约为每秒15k个测试用例。此外，我们还讨论了基带调制解调器的攻击矢量。据我们所知，这是基于仿真的模糊技术首次用于商业蜂窝基带的安全测试。BaseSAFE的大部分工具和方法也适用于其他低级内核和固件。通过使用BaseSAFE，我们能够在联发科蜂窝基带中使用我们的概念验证模糊线束发现内存损坏，包括堆越界写入。BaseSAFE、Harness和大量LTE信令消息测试用例将在本文发表后开放源码。", "note_en": "Download PDF  Abstract: Rogue base stations are an effective attack vector. Cellular basebandsrepresent a critical part of the smartphone&#39;s security: they parse largeamounts of data even before authentication. They can, therefore, grant anattacker a very stealthy way to gather information about calls placed and evento escalate to the main operating system, over-the-air. In this paper, wediscuss a novel cellular fuzzing framework that aims to help securityresearchers find critical bugs in cellular basebands and similar embeddedsystems. BaseSAFE allows partial rehosting of cellular basebands for fastinstrumented fuzzing off-device, even for closed-source firmware blobs.BaseSAFE&#39;s sanitizing drop-in allocator, enables spotting heap-basedbuffer-overflows quickly. Using our proof-of-concept harness, we fuzzed variousparsers of the Nucleus RTOS-based MediaTek cellular baseband that areaccessible from rogue base stations. The emulator instrumentation is highlyoptimized, reaching hundreds of executions per second on each core for ourcomplex test case, around 15k test-cases per second in total. Furthermore, wediscuss attack vectors for baseband modems. To the best of our knowledge, thisis the first use of emulation-based fuzzing for security testing of commercialcellular basebands. Most of the tooling and approaches of BaseSAFE are alsoapplicable for other low-level kernels and firmware. Using BaseSAFE, we wereable to find memory corruptions including heap out-of-bounds writes using ourproof-of-concept fuzzing harness in the MediaTek cellular baseband. BaseSAFE,the harness, and a large collection of LTE signaling message test cases will bereleased open-source upon publication of this paper.", "posttime": "2020-05-25 03:21:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "基带,baseband", "title": "BaseSAFE：通过仿真实现基带净化模糊", "title_en": "BaseSAFE: Baseband SAnitized Fuzzing Through Emulation", "transed": 1, "url": "https://arxiv.org/abs/2005.07797", "via": "", "real_tags": ["基带", "baseband"]}, {"category": "", "categoryclass": "", "imagename": "4d16095418a953c639be9666b70f5aac.jpg", "infoid": 1003557, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "斯蒂芬·布伦南·2020年5月24日，就像操作系统提供的许多服务一样，多任务处理是一件理所当然的事情，以至于感觉很平凡。有了我们功能强大的智能手机和计算机，一台计算机不能同时处理数百个进程的想法让人感觉很陌生。我认为正是这样的功能让计算机变得非常有用，但也让它们感觉如此复杂和神奇。\n很难玩弄实现多任务的代码，如果不构建一个完整的操作系统，如何自己实现也不是很明显。我坚信，只有自己实现了一些东西，才能真正理解它，所以我想写一篇文章，让人们可以尝试简单的线程实现。在这篇文章中，我们将用普通的C程序(不是操作系统)实现简单的线程。\n此调度程序将严重依赖函数setjmp()和long jmp()。他们感觉有点神奇，所以我想先描述一下他们是做什么的，然后花一点时间来揭开他们是如何做到这一点的。\n函数setjmp()是一种记录有关程序执行位置的信息的方式，以便您稍后可以跳回该点。您为Ita提供了JMP_buf类型的变量，它将在其中存储该信息。setjmp()第一次返回时返回0。\n稍后，您可以使用函数long jmp(jmp_buf，value)从您调用setjmp()的位置立即开始执行。对于您的程序来说，它看起来像是第二次返回setjmp()。这次将返回您传递给long jmp()的值参数，以帮助区分第二轮。这里有一个示例来帮助说明：\n#include&lt；stdio.h&gt；#include&lt；setjmp.h&gt；jmp_buf saved_location；int main(int argc，char**argv){if(setjmp(Save_Location)==0){printf(&#34；我们已成功设置跳转缓冲区！\\n&#34；)；}否则{printf(&#34；我们跳过！\\n&#34；)；返回0；正在准备跳转！\\n&#34；)；long jmp(save_location，1)；printf(&#34；这永远不会执行.。\\n&#34；)；返回0；}。\n狂野！它类似于GOTO语句，但它甚至可以用来跳出函数。它也比goto更难读，因为它看起来像一个常规的函数调用。如果您的代码随意使用setjmp()和long jmp()，那么任何人(包括您自己)阅读起来都会非常困惑。\n与goto一样，常见的建议是避免setjmp()和long jmp()，但是，就像goto一样，有时单独使用并以一致的方式使用它也很有用。调度器需要能够切换上下文，因此我们必须负责任地使用这些功能。最重要的是，我们将对API隐藏这些函数的使用，这样我们的调度器的用户就不必处理这种复杂性。\n然而，setjmp()和long jmp()函数并不是为支持任何类型的跳转而设计的。它们是为一种非常特殊的用例而设计的。假设您正在做一些复杂的事情，比如创建一个HttpRequest。这将涉及一组复杂的函数调用，如果其中任何一个调用失败，您将需要从每个函数返回一个特殊的错误代码。这将导致在您调用函数的任何地方(可能数十次)都会出现如下代码：\nsetjmp()和long jmp()的思想是，您可以在开始一些复杂的操作之前使用setjmp()来保存位置。然后，您可以将所有错误处理集中到一个位置：\nint rv；jmp_buf buf；if((rv=setjmp(Buf))！=0){/*在此处理错误*/return；}do_Complex_task(buf，args.)；\n如果do_Complex_task()中涉及的任何函数失败，它只会是long jmp(buf，error_code)。这意味着do_Complex_task()中的每个函数都可以假定每个函数调用都是成功的，这意味着您可以为每个函数调用去掉错误处理代码。(在实践中，这几乎从来没有做过，但那是一篇单独的博客文章。)。\n这里的重要思想是，long jmp()只允许您跳出深度嵌套函数。您不能跳回以前跳出的深度嵌套函数。下面是跳出函数时堆栈的图示。星号(*)标记setjmp()存储的堆栈指针。\nlong_mp前栈|long jmp后栈|+-+-stack()(*)|Main()增长|do_http_request()|down|send_a_Header()|Write_Bytes()|v|Write()-失败！\n您可以看到，我们只在堆栈中向上移动，因此没有数据损坏的风险。另一方面，想象一下如果您想要在任务之间跳转。如果您调用setjmp()然后返回，执行一些其他操作，然后尝试恢复之前所做的操作，您将遇到一个问题：\n|setjmp()处堆栈|稍后堆栈|long jmp()后堆栈|+-stack()|Main()|Main()增长|do_task_one()|do_task_Two()|do_stack_Two()向下|subtask()。|subtask()|subtask()||foo()|？？V|bar()(*)|(*)|？(*)\nsetjmp()保存的堆栈指针将指向不再存在的堆栈帧，并且可能已在某个点被其他数据覆盖。当您尝试将long jmp()返回到已经返回的函数时，您将开始体验到一些非常奇怪的行为，这可能会使您的程序崩溃。\n这个故事的寓意是，如果您想要使用setjmp()和long jmp()在这样的复杂任务之间跳转，您需要确保每个任务都有自己的单独堆栈。这完全消除了问题，因为当long jmp()重置堆栈指针时，它将为您交换堆栈，并且不会发生堆栈覆盖。\n这有点费时费力，但是有了这些知识，我们应该能够实现用户空间线程。开始时，我发现设计用于初始化、创建和运行线程的API非常有帮助。提前做这件事真的有助于理解我们正在努力构建的是什么！\n这些函数将用于初始化调度器、添加任务，然后最终开始在调度器中运行任务。一旦我们启动Scheduler_Run()，它将一直运行到所有任务完成。对于正在运行的任务，它们将有以下接口：\n第一个函数将退出任务。任务也可以通过返回FROMITS函数退出，所以这只是为了方便。第二个函数是我们的线程将如何告诉调度器让另一个任务运行一段时间。当任务调用Scheduler_RELINISH()时，当其他任务运行时，它可能会暂停一段时间，但最终函数会返回，任务可以继续运行。\n为了给出API的具体示例，下面是此API的假设用法，我们将使用它来测试我们的调度器：\n#include&lt；stdlib.h&gt；#include&lt；stdio.h&gt；#include&#34；Scheduler.h&#34；struct tester_args{char*name；int iters；}；void tester(void*arg){int i；struct tester_args*ta=(struct tester_args*)arg；for(i=0；i&lt；ta-&gt；iters；任务%s：%d\\n&#34；，ta-&&gt;；name，i)；Scheduler_relquiish()；}free(Ta)；}void create_test_task(char*name，int iters){struct tester_args*ta=malloc(sizeof(*ta))；ta-&gt；name=name；ta-&gt；iters=iters；Scheduler_create_task(tester，ta)；}int main(int argc，char**argv){Scheduler_init()；create_test_task(&#34；first&#34；，5)；create_test_task(&#34；Second&#34；，2)；Scheduler_Run()；printf(&#34；已运行完所有任务！\\n&#34；)；return exit_SUCCESS；}。\n在本例中，我们创建了两个运行同一函数的任务，但它们将使用不同的参数，以便我们可以分别跟踪它们的执行情况。每个任务都迭代设定的次数。每次迭代，它都会打印出一条消息，然后让另一个任务运行。我们期望看到类似以下内容的内容作为此程序的输出：\n任务第一：0任务第二：0任务第一：1任务第二：1任务第一：2任务第一：3任务第一：4所有任务运行完毕！\n要实现此API，我们需要某种ATASK的内部表示形式，因此让我们继续将我们需要的字段放在一起：\nstruct task{enum{ST_CREATED，ST_RUNNING，ST_WAITING，}status；int id；jmp_buf buf；void(*func)(void*)；void*arg；struct sc_list_head task_list；void*STACK_Bottom；void*STACK_TOP；INT STACK_SIZE；}；\n让我们把田地一个接一个地看一遍。所有任务在创建后应立即处于“已创建”状态。一旦任务开始执行，它将处于“运行”状态，如果任务需要等待某些异步操作，则可以将其置于“等待”状态。id字段只是任务的唯一标识符。buf包含我们在long jmp()恢复任务时的数据。func和arg被传递给Scheduler_create_task()，它们是启动任务所必需的。TASK_LIST字段是实现所有任务的双向链表所必需的。STACK_BOTTH、STACK_TOP和STACK_SIZE字段都与为此任务分配的单独堆栈相关。“底部”是malloc()返回的地址，但“顶部”指向内存区域正上方的地址。由于x86堆栈向下增长，我们需要将堆栈指针设置为STACK_TOP而不是STACK_BOTLOW。\nvoid Scheduler_CREATE_TASK(void(*func)(void*)，void*arg){static int id=1；struct task*task=malloc(sizeof(*task))；task-&gt；status=ST_Created；task-&gt；func=func；task-&gt；arg=arg；task-&gt；id=id++；task-&gt；stack_size=16*1024；task-&gt；stack。STACK_SIZE)；TASK-&gt；STACK_TOP=TASK-&gt；STACK_Bottom+TASK-&gt；STACK_SIZE；sc_list_insert_end(&amp；pri.。TASK_LIST，&amp；TASK-&gt；TASK_LIST)；}。\n使用静态int可以确保每次调用函数时，idfield都会递增到一个新数字。其他一切都应该不言而喻，除了sc_list_insert_end()，它只是将struct任务添加到全局列表中。全局列表存储在包含所有私有调度器数据的第二结构中。该结构及其初始化功能如下所示：\nstruct Scheduler_Private{jmp_buf buf；struct task*current；struct sc_list_head task_list；}priv；void Scheduler_init(Void){priv.。CURRENT=NULL；sc_list_init(&amp；pri.。TASK_LIST)；}。\nTASK_LIST字段用于引用任务列表(毫不奇怪)，CURRENT字段用于存储当前正在执行的任务(如果当前没有任何任务正在运行，则为NULL)。最重要的是，buf字段将用于跳转到Scheduler_Run()的代码：\nenum{INIT=0，Schedule，exit_task，}；void Scheduler_Run(Void){/*这是调度程序的退出路径！*/switch(setjmp(priv.。buf){case exit_task：SCHEDLER_FREE_CURRENT_TASK()；CASE INIT：CASE Schedule：Schedule()；/*如果返回，则没有其他事情可做，我们退出*/return；默认值：fprintf(stderr，&#34；Uh oh，Scheduler Error\\n&#34；)；return；}}。\n一旦调用Scheduler_run()函数，我们就设置setjmp()缓冲区，这样我们就可以始终返回到此函数。第一次返回0(INIT)，我们立即调用Schedule()。随后，我们可以将调度或EXIT_TASK常量传递给long jmp()，这将触发不同的行为。让我们暂时忽略exit_task案例，直接进入Schedule()的实现：\n静态作废调度(Void){struct task*next=SCHEDLER_CHOOSE_TASK()；如果(！下一步){return；}prv.。CURRENT=NEXT；IF(NEXT-&&gt;；STATUS==ST_CREATED){/**此任务尚未开始。分配一个新的STACK*指针，运行任务，并在结束时退出。*/register void*top=Next-&gt；STACK_TOP；ASM Volatil(&#34；mov%[rs]，%%rsp\\n&#34；：[RS]&#34；+r&#34；(Top)：)；/**运行任务函数*/Next-&gt；status=ST_Running；Next-&gt；func(Next-gt；arg)；/**堆栈指针应回到我们设置它的位置。返回将是一个非常、非常糟糕的主意。让&#39；s改为退出*/Scheduler_Exit_Current_Task()；}否则{long jmp(Next-gt；buf，1)；}/*不返回*/}。\n首先，我们调用一个内部函数来选择应该运行的下一个任务，这将是一个简单的循环调度程序，因此它只选择任务列表中最接近的任务。如果此函数返回NULL，则我们有更多任务要运行，然后返回。否则，我们需要启动任务运行(如果它处于ST_CREATED状态)或继续运行它。\n要启动创建的任务，我们使用x86_64汇编指令将STACK_TOP字段分配给RSP寄存器(堆栈指针)。然后，我们更改任务状态，运行函数，如果函数返回，则退出。请注意，setjmp()和long jmp()存储和交换堆栈指针，因此这是我们唯一需要使用汇编修改堆栈指针的时候。\n如果任务已经启动，那么buf字段应该包含我们需要long jmp()进入以恢复任务的上下文，所以我们就这样做了。接下来，让我们看一下选择下一个要运行的任务的helper函数。这是调度器的核心，就像我前面说的，这是一个循环调度器：\n静态结构TASK*SCHEDLER_CHOOSE_TASK(Void){结构TASK*TASK；sc_list_for_each_entry(TASK，&amp；pri.。TASK_LIST，TASK_LIST，STRUCT TASK){IF(TASK-&&gt;；STATUS==ST_RUNNING||TASK-&&gt;；STATUS==ST_CREATED){sc_LIST_REMOVE(&amp；TASK-&gT；TASK_LIST)；sc_LIST_INSERT_END(&amp；PRIV.。TASK_LIST，&amp；TASK-&gt；TASK_LIST)；return task；}}return null；}。\n如果您不熟悉我的链表实现(取自Linux内核)，也没问题。sc_list_for_each_entry()函数是一个宏，允许我们迭代任务列表中的每个任务。我们找到的第一个符合条件的(Notwaiting)任务将从其当前位置移除，并插入到任务列表的末尾。这确保了下次我们运行调度程序时，我们将得到一个不同的任务(如果有另一个任务)。我们返回第一个符合条件的任务，如果根本没有任务，则返回NULL。\n最后，让我们来看一下Scheduler_RELINISH()的实现，看看任务是如何切换自身的：\n这是我们的调度程序中setjmp()函数的另一个用法。因此，它可能会有点令人困惑。当任务调用此函数时，我们使用setjmp()保存当前上下文(包括当前堆栈指针)。然后，我们使用long jmp()进入调度器(回到Scheduler_Run())，并传递请求调度新任务的调度函数。\n当任务恢复时，setjmp()函数将返回非零值，我们将返回到任务之前正在执行的操作！\n最后，下面是任务退出时发生的情况(通过显式调用exit函数，或者通过从其任务函数返回)：\nvoid Scheduler_Exit_Current_TASK(Void){struct task*task=priv.。当前；sc_list_remove(&amp；task-&gt；task_list)；long jmp(初始。buf，exit_task)；/*不返回*/}static void Scheduler_free_current_task(Void){struct task*task=priv.。当前的；当前的。CURRENT=NULL；FREE(任务-&&gt;；STACK_BOOT)；FREE(任务)；}。\n这个过程分为两个部分：第一个函数由任务直接调用。我们从任务列表中删除该任务的条目，因为它不应该再被调度。然后，我们将long jmp()返回到Scheduler_run()函数。这一次，我们使用exit_task。这向调度器表明，在调度新任务之前，它应该首先调用Scheduler_free_current_task()。如果您向上滚动到Scheduler_run()，您将看到这正是Scheduler_Run()所做的事情。\n我们必须分两部分完成这项工作，因为当调用SCHEDLER_EXIT_CURRENT_TASK()时，它会主动使用任务结构中包含的堆栈。如果您在释放堆栈的同时仍在使用它，则函数仍有可能访问我们刚刚释放的堆栈内存！为了确保这种情况不会发生，我们必须将long jmp()返回到调度器，该调度器使用单独的堆栈。这样我们就可以安全地释放任务的数据。\n到此为止，我们已经介绍了该调度器的整个实现。如果您继续编译这段代码，以及我的链表实现和上面的主程序，您就会有一个工作的调度器！我建议您查看包含所有这些代码的githubrepository，而不是所有那些复制和粘贴操作。\n如果你已经走到这一步了，我想我不需要说服你这很有趣。然而，它可能看起来没有那么有用。毕竟，您可以在C中使用“真正的”线程，它可以并行运行，不需要等待彼此调用Scheduler_RELINISH()。\n然而，我认为这是一系列令人兴奋的有用功能实现的起点。对于I/O繁重的任务，这也可以用来简单地实现单线程异步应用程序，这是Python新的异步实用程序的工作方式。该系统还可以实现生成器和协程。最后，只要付出足够的努力，这个系统甚至可以与“真正的”操作系统线程结合起来，在需要的地方提供更多的并行性。这些想法中的每一个都是一个有趣的项目，我鼓励读者在我开始写一篇关于它们的新文章之前尝试一下！\n我是说，可能不会！使用内联程序集修改堆栈指针可能不安全。不要在您的生产代码中使用它，但是一定要使用它来捣乱和探索！\n这个系统的一个更安全的实现可以构建在“ucontext”API上(参见man getcontext)，它提供了一种在这些类型的用户空间“线程”之间进行交换的方法，而不需要干预内联汇编。不幸的是，API是非标准的(它已从最新的POSIX规范中删除)。但是，您仍然可以使用此API，因为它是glibc的一部分。\n正如当前编写的那样，此调度程序仅在线程显式地将控制权交还给调度程序时才起作用。这对于像操作系统这样的通用实现是不好的，因为行为不佳的线程可能会阻止所有其他线程运行。(当然，这并没有阻止MS-DOS使用协作多任务！)。我不认为这会使协作多任务变得不好，这只是取决于应用程序。\n如果使用非标准的“ucontext”API，那么POSIX信号将实际存储先前执行的代码的上下文。通过设置周期性定时器信号，用户空间调度器实际上可以获得抢占式多任务工作！这是另一个非常酷的项目，我希望尽快试用并撰写。\n如果你已经走到这一步，感谢你的阅读，我希望你有机会在此基础上尝试一个有趣的项目！\n法律·RSS斯蒂芬·布伦南(Stephen Brennan)的博客采用知识共享署名-ShareAlike 4.0国际许可", "note_en": "Stephen Brennan • 24 May 2020 Multitasking, like many services an operating system provides, is something wetake for granted so much that it can feel mundane. With our powerful smartphonesand computers, the idea of a computer  not being able to juggle hundreds ofprocesses feels alien. I think it’s features like this that make computersincredibly useful, but also make them feel so complicated and magical.\n It’s hard to play around with the code that implements multitasking, and it’snot obvious how to implement it yourself without building a whole OS. I’m a firmbeliever that you don’t truly understand something until you’ve implemented ityourself, so I wanted to write an article that lets people play around with asimple thread implementation. In this post, we’ll implement simple threads in anormal C program (not an operating system).\n  This scheduler is going to rely heavily on the functions  setjmp() and longjmp(). They feel a bit magical, so I want to first describe what they do,and spend a little time demystifying how they do it.\n The function  setjmp() is a way of recording information about where a programis in its execution, so that you can later jump back to that point. You give ita variable of type  jmp_buf, in which it will store that information. setjmp() returns 0 the first time it returns.\n Later on, you can use the function  longjmp(jmp_buf, value) to immediatelybegin execution back at the point where you called  setjmp(). To your program,it will look like  setjmp() returned a  second time. The  value argument youpass to  longjmp() will be returned this time, to help differentiate the secondreturn. Here’s an example to help illustrate:\n #include &lt;stdio.h&gt;#include &lt;setjmp.h&gt; jmp_buf  saved_location ; int  main ( int  argc ,  char  ** argv ) {  if  ( setjmp ( saved_location )  ==  0 )  {  printf ( &#34;We have successfully set up our jump buffer! \\n &#34; );  }  else  {  printf ( &#34;We jumped! \\n &#34; );  return  0 ;  }  printf ( &#34;Getting ready to jump! \\n &#34; );  longjmp ( saved_location ,  1 );  printf ( &#34;This will never execute... \\n &#34; );  return  0 ; }\n   Wild! It’s like a goto statement, but it can even be used to jump outside of afunction. It’s also a lot more difficult to read than a goto, since it lookslike a regular function call. If your code used  setjmp() and  longjmp()liberally, it would be incredibly confusing for anyone (including yourself) toread.\n Like with goto, the common advice is to avoid  setjmp() and  longjmp().However, just like with goto, there are some times where it can be useful to usesparingly, and in a consistent way. A scheduler needs to be able to switchcontexts, and so we’ll have to use these functions responsibly. Mostimportantly, we’ll hide the use of these functions from our API, so that usersof our scheduler won’t have to deal with that kind of complexity.\n  The  setjmp() and  longjmp() functions aren’t designed to support just  anykind of jumping around, however. They’re designed for a pretty particular usecase. Imagine that you are doing something complicated, like making an HTTPrequest. This will involve a complicated set of function calls, and if any ofthem fail, you’ll need to return a special error code from each one of them.This leads to code like this, everywhere you call a function (possibly dozens oftimes):\n  The idea of  setjmp() and  longjmp() is that you can use  setjmp() to saveyour place just before starting something complex. Then, you could centralizeall of your error handling into one place:\n int  rv ; jmp_buf  buf ; if  (( rv  =  setjmp ( buf ))  !=  0 )  {  /* handle errors here */  return ; } do_complicated_task ( buf ,  args ...);\n If any function involved in  do_complicated_task() fails, it would just longjmp(buf, error_code). This means that every function within do_complicated_task() can assume that every function call is a success, whichmeans you can get rid of that error handling code for each function call. (Inpractice, this is almost never done, but that’s a separate blog post.)\n The big idea here is that  longjmp() only allows you to jump  out of deeplynested functions. You can’t jump back  into a deeply nested function which youhad formerly jumped out of. Here’s an illustration of the stack when you jumpout of a function. The asterisk  (*) marks the stack pointer which  setjmp()stored.\n | Stack before longjmp | Stack after longjmp +-------------------------+----------------------------stack | main() (*) | main()grows | do_http_request() |down | send_a_header() | | | write_bytes() | v | write() - fails! |\n You can see that we only move back up the stack, and so there is no risk of datacorruption. On the other hand, imagine if you wanted to jump between tasks. Ifyou call  setjmp() and then return, do some other stuff, and then attempt toresume what you were doing before, you’ll have a problem:\n | Stack at setjmp() | Stack later | Stack after longjmp() +-------------------+------------------+----------------------stack | main() | main() | main()grows | do_task_one() | do_task_two() | do_stack_two()down | subtask() | subtask() | subtask() | | foo() | | ??? v | bar() (*) | (*) | ??? (*)\n The stack pointer which  setjmp() saved will point at a stack frame which nolonger exists, and may have been overwritten at some point with other data. Whenyou try to  longjmp() back into the function you have already returned from,you’ll start experiencing some really weird behavior that will probably crashyour program.\n The moral of this story is that, if you want to use setjmp() and longjmp() tojump between complex tasks like this, you need to make sure each task has  itsown separate stack. This completely eliminates the problem, because when longjmp() resets the stack pointer, it will swap stacks for you, and no stackoverwriting will take place.\n  That was a bit of a long diversion, but equipped with this knowledge, we shouldbe able to implement userspace threads. To start out, I found it quite helpfulto design the API which should be used to initialize, create, and run thethreads. Doing this ahead of time really helps understand what we’re trying tobuild!\n  These functions will be used to initialize the scheduler, add tasks, and theneventually begin running tasks in the scheduler. Once we start scheduler_run(), it will run until all tasks are completed. For tasks whichare running, they will have the following APIs:\n  The first function will exit the task. A task could also exit by returning fromits function, so this is simply a convenience. The second function is how ourthreads will tell the scheduler to let another task run for a bit. When a taskcalls  scheduler_relinquish(), it could be suspended a bit for a bit, whileother tasks run, but eventually the function will return and the task cancontinue running.\n To give a concrete example of the API, here’s a hypothetical use of this API,which we’ll use to test our scheduler:\n #include &lt;stdlib.h&gt;#include &lt;stdio.h&gt; #include &#34;scheduler.h&#34; struct  tester_args  {  char  * name ;  int  iters ; }; void  tester ( void  * arg ) {  int  i ;  struct  tester_args  * ta  =  ( struct  tester_args  * ) arg ;  for  ( i  =  0 ;  i  &lt;  ta -&gt; iters ;  i ++ )  {  printf ( &#34;task %s: %d \\n &#34; ,  ta -&gt; name ,  i );  scheduler_relinquish ();  }  free ( ta ); } void  create_test_task ( char  * name ,  int  iters ) {  struct  tester_args  * ta  =  malloc ( sizeof ( * ta ));  ta -&gt; name  =  name ;  ta -&gt; iters  =  iters ;  scheduler_create_task ( tester ,  ta ); } int  main ( int  argc ,  char  ** argv ) {  scheduler_init ();  create_test_task ( &#34;first&#34; ,  5 );  create_test_task ( &#34;second&#34; ,  2 );  scheduler_run ();  printf ( &#34;Finished running all tasks! \\n &#34; );  return  EXIT_SUCCESS ; }\n In this example, we create two tasks which run the same function, but they’lluse different arguments so that we can trace their execution separately. Eachtask iterates a set number of times. Each iteration, it prints out a message andthen lets another task run. We would expect to see something like this as theoutput of this program:\n task first: 0task second: 0task first: 1task second: 1task first: 2task first: 3task first: 4Finished running all tasks!\n  To implement this API, we’ll need some sort of internal representation of atask, so let’s go ahead and put together fields we’ll need:\n struct  task  {  enum  {  ST_CREATED ,  ST_RUNNING ,  ST_WAITING ,  }  status ;  int  id ;  jmp_buf  buf ;  void  ( * func )( void * );  void  * arg ;  struct  sc_list_head  task_list ;  void  * stack_bottom ;  void  * stack_top ;  int  stack_size ; };\n Let’s go through the fields one by one. All tasks should be in the “created”state as soon as they’re created. Once a task starts executing, it will be inthe “running” status, and if a task ever needed to wait for some asynchronousoperation, it could be placed in the “waiting” state. The  id field is just aunique identifier for the task.  buf contains the data for when we  longjmp()to resume the task.  func and  arg are passed to  scheduler_create_task() andare necessary for starting the task. The  task_list field is necessary toimplement a doubly linked list of all tasks. The  stack_bottom,  stack_top,and  stack_size fields all relate to the separate stack allocated for thistask. The “bottom” is the address returned by  malloc(), but the “top” is apointer to the address directly above the region of memory. Since the x86 stackgrows downward, we will need to set the stack pointer to  stack_top rather than stack_bottom.\n  void  scheduler_create_task ( void  ( * func )( void  * ),  void  * arg ) {  static  int  id  =  1 ;  struct  task  * task  =  malloc ( sizeof ( * task ));  task -&gt; status  =  ST_CREATED ;  task -&gt; func  =  func ;  task -&gt; arg  =  arg ;  task -&gt; id  =  id ++ ;  task -&gt; stack_size  =  16  *  1024 ;  task -&gt; stack_bottom  =  malloc ( task -&gt; stack_size );  task -&gt; stack_top  =  task -&gt; stack_bottom  +  task -&gt; stack_size ;  sc_list_insert_end ( &amp; priv . task_list ,  &amp; task -&gt; task_list ); }\n Using a  static int ensures that each time the function is called, the  idfield increments to a new number. Everything else should be self-explanatory,except the  sc_list_insert_end(), which simply adds the  struct task to theglobal list. The global list is stored within a second structure, whichcontains all the private scheduler data. This structure is presented below,along with its initialization function:\n struct  scheduler_private  {  jmp_buf  buf ;  struct  task  * current ;  struct  sc_list_head  task_list ; }  priv ; void  scheduler_init ( void ) {  priv . current  =  NULL ;  sc_list_init ( &amp; priv . task_list ); }\n The  task_list field is used to refer to the list of tasks (unsurprisingly).The  current field is used to store the currently executing task (or null ifnone is curently running). Most importantly, the  buf field will be used tojump into the code of  scheduler_run():\n enum  {  INIT = 0 ,  SCHEDULE ,  EXIT_TASK , }; void  scheduler_run ( void ) {  /* This is the exit path for the scheduler! */  switch  ( setjmp ( priv . buf ))  {  case  EXIT_TASK :  scheduler_free_current_task ();  case  INIT :  case  SCHEDULE :  schedule ();  /* if return, there&#39;s nothing else to do and we exit */  return ;  default:  fprintf ( stderr ,  &#34;Uh oh, scheduler error \\n &#34; );  return ;  } }\n As soon as the  scheduler_run() function is called, we set the  setjmp()buffer so we can always return to this function. The first time, 0 ( INIT) isreturned, and we immediately call  schedule(). Subsequently, we can pass the SCHEDULE or  EXIT_TASK constants into  longjmp(), which will triggerdifferent behaviors. Let’s ignore the  EXIT_TASK case for now, and go directlyinto the implementation of  schedule():\n static  void  schedule ( void ) {  struct  task  * next  =  scheduler_choose_task ();  if  ( ! next )  {  return ;  }  priv . current  =  next ;  if  ( next -&gt; status  ==  ST_CREATED )  {  /* * This task has not been started yet. Assign a new stack * pointer, run the task, and exit it at the end. */  register  void  * top  =  next -&gt; stack_top ;  asm  volatile (  &#34;mov %[rs], %%rsp  \\n &#34;  :  [  rs  ]  &#34;+r&#34;  ( top )  ::  );  /* * Run the task function */  next -&gt; status  =  ST_RUNNING ;  next -&gt; func ( next -&gt; arg );  /* * The stack pointer should be back where we set it. Returning would be * a very, very bad idea. Let&#39;s instead exit */  scheduler_exit_current_task ();  }  else  {  longjmp ( next -&gt; buf ,  1 );  }  /* NO RETURN */ }\n First, we call an internal function to select the next task which should be run.This is going to be a simple round-robin scheduler, so it just chooses the nextready task in the task list. If this function returned NULL, then we have nomore tasks to run, and we return. Otherwise, we need to either start the taskrunning (if it is in the  ST_CREATED state) or resume running it.\n To start a created task, we use an x86_64 assembly instruction to assign the stack_top field to the  rsp register (stack pointer). Then we change the taskstate, run the function, and exit if the function returns. Note that  setjmp()and  longjmp() store and swap stack pointers, so this is the only time wherewe’ll need to use assembly to modify the stack pointer.\n If the task has already been started, then the  buf field should contain thecontext we need to  longjmp() into to resume the task, so we just do that.Next, let’s look at the helper function which selects the next task to run. Thisis the heart of a scheduler, and like I said earlier, this is a round-robinscheduler:\n static  struct  task  * scheduler_choose_task ( void ) {  struct  task  * task ;  sc_list_for_each_entry ( task ,  &amp; priv . task_list ,  task_list ,  struct  task )  {  if  ( task -&gt; status  ==  ST_RUNNING  ||  task -&gt; status  ==  ST_CREATED )  {  sc_list_remove ( &amp; task -&gt; task_list );  sc_list_insert_end ( &amp; priv . task_list ,  &amp; task -&gt; task_list );  return  task ;  }  }  return  NULL ; }\n If you’re unfamiliar with my linked list implementation (which is taken from theLinux kernel), that’s ok. The  sc_list_for_each_entry() function is a macrothat lets us iterate over each task in the task list. The first eligible (notwaiting) task we find is removed from its current position and inserted at theend of the task list. This ensures that next time we run the scheduler, we’llget a different task (if there is another). We return this first eligible task,or NULL if there were no tasks at all.\n Finally, let’s get to the implementation of  scheduler_relinquish() to see howa task can switch itself out:\n  This is the other use of the  setjmp() function in our scheduler. As such itcan be slightly confusing. When a task calls this function, we use  setjmp() tosave our current context (which includes the current stack pointer). Then, weuse  longjmp() to enter into the scheduler (back in  scheduler_run()), and wepass the  SCHEDULE function asking to schedule a new task.\n When the task gets resumed, the  setjmp() function will return non-zero andwe’ll return out to whatever the task was doing before!\n Finally, here’s what happens when a task exits (either by explicitly calling theexit function, or by returning from its task function):\n void  scheduler_exit_current_task ( void ) {  struct  task  * task  =  priv . current ;  sc_list_remove ( &amp; task -&gt; task_list );  longjmp ( priv . buf ,  EXIT_TASK );  /* NO RETURN */ } static  void  scheduler_free_current_task ( void ) {  struct  task  * task  =  priv . current ;  priv . current  =  NULL ;  free ( task -&gt; stack_bottom );  free ( task ); }\n This process comes in two parts: the first function is called directly by thetask. We remove the task’s entry from the task list, since it should no longerbe scheduled. Then, we  longjmp() back to the  scheduler_run() function. Thistime, we use  EXIT_TASK. This indicates to the scheduler that, before itschedules a new task, it should first call  scheduler_free_current_task(). Ifyou scroll back up to  scheduler_run(), you’ll see this is exactly what scheduler_run() does.\n We have to do this in two parts because, when  scheduler_exit_current_task() iscalled, it is actively using the stack contained in the task struct. If you freethe stack while still using it, there’s the chance that the function will stillaccess the very stack memory we just freed! To ensure this doesn’t happen, wehave to  longjmp() back to the scheduler, which is using a separate stack. Thenwe can safely free the task’s data.\n With that, we’ve covered the entire implementation of this scheduler. If youwere to go ahead and compile this, along with my linked list implementation andthe main program above, you would have a working scheduler! Instead of all thatcopying and pasting, I’d encourage you to check out the  githubrepository which contains all this code.\n  If you’ve gotten this far, I assume I don’t need to convince you that this isinteresting. However, it may not seem all that useful. After all, you can use“real” threads in C, which can run in parallel and don’t need to wait for eachother to call  scheduler_relinquish().\n However, I see this as a jumping off point for a whole series of excitingimplementations of useful features. For I/O heavy tasks, this could also be used tosimply implement a single-threaded async application, the way that Python’s newasync utilities work. This system could also implement generators andcoroutines. Finally, with enough effort, this system could even be coupled with“real” operating system threads to provide more parallelism where necessary.Each of these ideas is a fun project which I’d encourage the reader to trybefore I get around to writing a new article about them!\n  I mean, probably not! It’s probably not safe to use inline assembly to modifythe stack pointer. Don’t use it in your production code, but do use it to messaround and explore!\n A safer implementation of this system could be built on the “ucontext” API (see man getcontext), which provides a way to swap between these types of userspace“threads” without needing to meddle with inline assembly. Unfortunately, the APIis non-standard (it was removed from the latest POSIX spec). However, you canstill use this API, as it is part of  glibc.\n  As it is currently written, this scheduler only works if threads explicitly handoff control back to the scheduler. This is bad for a general purposeimplementation like an operating system, because a poorly behaved thread couldprevent all the others from running. (Of course, that didn’t stop MS-DOS fromusing cooperative multitasking!). I don’t think that makes cooperativemultitasking bad, it’s just going to depend on the application.\n If one used the non-standard “ucontext” API, then POSIX signals would actuallystore the context of the previously executing code. By setting a periodic timersignal, a userspace scheduler could actually get preemptive multitaskingworking! This is another really cool project that I hope to try out and writeabout soon.\n If you’ve gotten this far, thanks for reading, and I hope you get the chance totry out a fun project based on this!\n      Legal •  RSS           Stephen Brennan&#39;s Blog is licensed under a  Creative Commons Attribution-ShareAlike 4.0 International License", "posttime": "2020-05-25 03:21:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c++,线程,simple,任务", "title": "用C++实现简单的协作线程", "title_en": "Implementing simple cooperative threads in C", "transed": 1, "url": "https://brennan.io/2020/05/24/userspace-cooperative-multitasking/", "via": "", "real_tags": ["c++", "线程", "simple", "任务"]}, {"category": "", "categoryclass": "", "imagename": "87a011d8610a06105d1ce703aa9b6773.jpg", "infoid": 1003556, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "宜家(Ikea)在其视觉标识中使用Verdana十年后，将其品牌字体换成了Noto，这是Montype和谷歌(Google)的协作型家族。在2009年之前，该公司使用宜家Sans(改编自Futura)已有50年之久，但由于其自有品牌字体不包括亚洲字符，因此搬到了Verdana。\n宜家进军Noto，是让宜家的字体真正融入全球市场的又一步，因为宜家涵盖了世界上每一种书面语言。Noto成立于2016年10月，是谷歌和Monotype五年研发的结果，招募了数百名员工，统一了从西里尔语到切诺基语的800种语言和100种书面文字。通过在许多情况下创建Unicode标准中所有脚本的数字表示，该字体是有史以来第一个服务于特定语言社区的字体。\nNoto是No Tofu的缩写，豆腐是一个术语，经常用来描述计算机不支持某种字体时显示的小方块。\n宜家在2020年的产品目录中公布了这种新字体。在推特上，Montype的于尔根·西伯特(Jürgen Siebert)分享了新旧字体投入使用前后的照片，他评论道：“陷入系统思维：十年后，宜家(Ikea)告别了Verdana，取而代之的是Noto。”", "note_en": "Ikea has swapped its brand typeface to  Noto, a collaborative type family from Monotype and Google, after a decade of using Verdana across its visual identity. Before 2009, the company used Ikea Sans – an adaptation of Futura – for 50 years, but moved to Verdana because its own-brand font didn’t include Asian characters.\n Its move to Noto is a step further in making Ikea’s typeface truly inclusive of its global markets, as the family encompasses every written language in the world.  Noto launched in October 2016 as the result of five years research and development between Google and Monotype, enlisting hundreds of staff and unifying 800 languages and 100 written scripts from Cyrillic to Cherokee. By creating a digital representation of all the scripts in the Unicode standard in many cases, the font was the first ever to serve a particular language community.\n The name Noto is short for No Tofu, where tofu is a term often used to describe the little squares that show when a font is not supported by a computer.\n Ikea has revealed the new typeface in its 2020 catalogue. On Twitter, Monotype’s  Jürgen Siebert shared before-and-after shots of the old and new typefaces in action, commenting: “Trapped in system thinking: After ten years, Ikea says goodbye to Verdana and replaces it with Noto.”", "posttime": "2020-05-25 03:20:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,宜家,谷歌,2020,单体", "title": "宜家2020年产品目录从Verdana切换到Noto(谷歌，单体字)", "title_en": "IKEA switches from Verdana to Noto (Google, Monotype) for 2020 catalogue", "transed": 1, "url": "https://www.itsnicethat.com/news/ikea-changes-typeface-to-noto-monotype-google-graphic-design-210819", "via": "", "real_tags": ["google", "宜家", "谷歌", "2020", "单体"]}, {"category": "", "categoryclass": "", "imagename": "bcf690b02f01cd0060ef1f6b7e3f7cc7.png", "infoid": 1003555, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Google Noto是一种历时五年的字体，跨越了100多种书写系统、800种语言和数十万个字符。Noto字体是谷歌和Montype的合作成果，对于全世界数十亿访问数字内容的人来说，它是一种真正通用的交流方式。", "note_en": "A typeface five years in the making, Google Noto spans more than 100 writing systems, 800 languages, and hundreds of thousands of characters. A collaborative effort between Google and Monotype, the Noto typeface is a truly universal method of communication for billions of people around the world accessing digital content.", "posttime": "2020-05-25 03:20:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,字体,single", "title": "在一种字体中使用800多种语言：为Google创建Noto", "title_en": "More than 800 languages in a single typeface: creating Noto for Google", "transed": 1, "url": "https://www.monotype.com/resources/case-studies/more-than-800-languages-in-a-single-typeface-creating-noto-for-google", "via": "", "real_tags": ["google", "字体", "single"]}]