[{"category": "", "categoryclass": "", "imagename": "570c10d39146de61ff18967ddd14cf3a.jpg", "infoid": 1001558, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这就是伊布卢斯描述的神奇的多腿动物，它被附加在法国版的利奥·非洲人身上，很可能是由Thevet复制的，毫无疑问是由Paré复制的。\n它甚至被被切断的四肢包围--但是别担心，它会修复它们的！\n有人请我(我雇来的人要求)确切地解释一下，像“利维坦”这样的词条是如何最终被误读并腐化成“kuyūtha”甚至“rakaboúna”的。我相信一定会有一些人(想必一只手少了几个手指)对词源、语言以及怪物是如何在这些基础上进化的感兴趣的。\n阿拉伯语很难读懂。为什么？嗯，首先，有不同的书写方式，不同的类型、文本、字体大小(可以这么说)。例如，看看这个。\n漂亮易读的文字，现代的阿尔瓦迪印刷术。简单的农民。然后你会得到更老的版本，比如这个版本的al-Qazwini。\n可读性稍差一些，但仍可读。但是当你看到这个版本的al-Damiri时，你需要看到整个页面才能获得全面的影响。\n你的眼睛没有欺骗你。方框里的文字是al-Damiri。页边空白处的文字是al-Qazwini创作的奇迹。没错，两本书只卖一本，都是用可爱的小螃蟹笔迹写的！\n当然，还有那些漂亮的手稿，上面有华丽的文字，我几乎看不懂。\n下一个问题是语言本身。阿拉伯语的元音字母很少。大多数元音都用变音符号表示。\n你猜怎么着？大多数时候他们甚至不写变音符号！基于此，Kuyutha，Kiyutha，Kayutha，Kuyuthan，Kayuthan，Kiyuthan根据分配的元音都是同等有效的。结尾的“an”可以是字母，也可以是变音符号--如果是字母，它肯定在那里，如果它是变音符号，那么它就在那里，这是有争议的。\n不仅如此，根据写作质量，K和L可以看起来相同，Y和B可以看起来相同(因此Kuyuban)，T和TH和N可以看起来相同…。所以把它和平均元音移动(山楂)结合起来，你就可以拼凑出利维坦是如何被乱码变成kuyūtha的。\n“但是Rakaboúna呢？”我听到你说。“你甚至在参赛作品中用”搞笑但可以理解“来形容它！”\n嗯，是的。是的。这种误读是佩伦独有的，他把他的翻译归功于al-Damiri，你可能记得这是一篇微不足道的文字。我承认我无法理解他是如何从“KuyūTha”中找到“Rakaboúna”的，直到我从上下文中看出来，这一切都是有意义的。以下是实际部分：\n我已经强调了“公牛的名字是kuyūtha”。看到课文有多挤了吗？原来Perron把“Bull”(Thawr)的最后一个字母“Bull”(即R)粘在了公牛的名字上。然后他继续把Y读成B，把TH读成N，给出了“Rakaboúna”。以下是魔术是如何发生的：\n现在你就知道了。这头可怜的宇宙公牛被赋予了越来越离奇的绰号，而实际上，它应该只是被称为庞然大物，可怜的牛。\n我们的想象力一直是我们最大的盟友，也是我们最大的敌人。面对未知，我们用各种形状和大小的生物填充了它，从微小的灵魂到巨大的宇宙怪物。自从我们赢得了好奇的能力以来，这些实体就已经分享了我们的世界。\n官方生物参赛作品上的所有艺术品和文字均为©生物之书。版权所有。\n不是我的图像和文本(通常在旁白中)在适用的情况下或在公共领域中被视为其各自的所有者，并在任何可能的情况下记入贷方。不属于我的图片的使用属于“合理使用”(如果有任何问题，请告诉我！)。\n输入您的电子邮件地址以跟踪此博客，并通过电子邮件接收新帖子的通知。", "note_en": "Here it is, the miraculous multi-legged animal described by Iambulus, appended to a French version of Leo Africanus, and copied probably by Thevet and unquestionably by Paré.\n  It’s even surrounded by severed limbs – but don’t worry, it’ll fix ‘em!\n      I have been requested (by someone who I hire to request) to explain how, exactly, something like “Leviathan” could end up misread and corrupted into “Kuyūtha” or even “Rakaboûna”. And I’m sure there are some people out there (presumably countable on one hand missing several fingers) who are interested in etymology, language, and how monsters evolve based on those.\n  Arabic is tricky to read. Why? Well, for a start there’s different ways of writing it, different types, texts, font sizes (as it were). Look at this, for instance.\n  Nice and legible text, modern printing of al-Wardi. Easy peasy. Then you get older copies like this version of al-Qazwini.\n  Slightly less legible, but still readable. But then you get to this version of al-Damiri, and, well, you need to see the whole page to get the full impact.\n  Your eyes aren’t deceiving you. The text in the box is al-Damiri. The text in the margins is the  Wonders of Creation by al-Qazwini. That’s right, two books for the price of one, all in lovely tiny crabbed handwriting!\n And then of course there’s the lovely manuscripts with the flowery text which I can barely decipher.\n   The next issue is the language itself. There are few vowel letters in Arabic. Most vowel sounds are represented with diacritics.\n And guess what? Most times they don’t even write the diacritics! So just based on that, Kuyutha, Kiyutha, Kayutha, Kuyuthan, Kayuthan, Kiyuthan are all equally valid based on the vowels assigned. The “an” at the end can be either a letter or a diacritic – if it’s a letter it’s definitely there, if it’s a diacritic it’s debatably there.\n Not only that, but based on the quality of the writing, K and L can look identical, Y and B can look identical (hence Kuyuban), T and TH and N can look identical… So combine that with the average vowel movements (haw haw) and you can piece together how Leviathan could get garbled into Kuyūtha.\n  “But what about Rakaboûna?” I hear you say. “You even describe it as “hilarious but understandable” in your entry!”\n Well, yes. Yes it is. This misreading is unique to Perron, and he attributes his translation to al-Damiri, which you may remember as being teeny-tiny-textual. I’ll admit I couldn’t figure out how he got “Rakaboûna” out of “Kuyūtha”, until I saw it in context and it all made sense. Here’s the actual part:\n  I’ve highlighted “and the name of the bull [is] Kuyūtha”. See how cramped the text is? Turns out Perron glued the last letter of “bull” ( thawr), which is an R, to the name of the bull. Then he proceeded to read the Y as B and the TH as N, giving “Rakaboûna”. Here’s how the magic happened:\n  And there you have it. The poor cosmic bull got saddled with increasingly bizarre monikers, when in reality it should have just been called Behemoth, poor bovine.\n  Our imagination has always been our greatest ally, and our worst enemy. In the face of the unknown, we populated it with creatures of all shapes and sizes, from minuscule spirits to gigantic cosmic monsters. These entities have shared our world ever since we earned the capacity to wonder.\n    All artwork and text on the official creature entries are © A Book of Creatures. All rights reserved.\n Images and text not by me (typically in the asides) are © their respective owners where applicable or in the public domain, and are credited whenever possible. The usage of images that are not mine goes under “Fair Use” (if there are any issues let me know!)\n     Enter your email address to follow this blog and receive notifications of new posts by email.", "posttime": "2020-05-11 02:35:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "book,文字", "title": "“生物之书”(The Book Of Creatures)", "title_en": "A Book of Creatures", "transed": 1, "url": "https://abookofcreatures.com/", "via": "", "real_tags": ["book", "文字"]}, {"category": "", "categoryclass": "", "imagename": "5c1b51bd4cef10099b7cf35b0dd67325.png", "infoid": 1001557, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "@Dyras也许应该有关于风险的警告？大多数Signal用户基于对同行评审和使用Signal的开放密语系统的信任。据我所知，OWS的理念是没有强大的用户，让私人交流变得流行的唯一方法是假设大多数用户不了解这些东西是如何工作的。我会假设(我的用户不是开发人员)，既然您把它放在那里，就意味着可以安全地使用它。也许你不知何故把它改成了无名氏之类的。没人料到会有这样的陷阱。至少应该有个警告。", "note_en": "@Dyras maybe there should be a warning about the risk? Most of Signal users base on a trust to peer review and Open Whisper Systems using Signal. As i understood, OWS&#39;s philosophy is that there are no powerusers and the only way to make private communication popular is to assume, that most of users don&#39;t understand how these things work. I&#39;d assume (i&#39;m user not dev), that since you&#39;ve put it there it means that it&#39;s safe to use it. Maybe you somehow anonimized it or whatever. Nobody expect such a trap. There should be at least a warning.", "posttime": "2020-05-11 02:19:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "拼写,spellcheck,假设", "title": "启用拼写检查是隐私风险(2016)", "title_en": "Leaving Spellcheck Enabled Is a Privacy Risk (2016)", "transed": 1, "url": "https://github.com/signalapp/Signal-Desktop/issues/824", "via": "", "real_tags": ["拼写", "假设"]}, {"category": "", "categoryclass": "", "imagename": "342a95b3397cd1f6910fff42ab7c3fc5.png", "infoid": 1001556, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当今计算机体系结构的广泛多样性需要一种新的软件开发方法。OpenMM是一个分子力学模拟框架，允许单个程序在各种硬件平台上高效运行。\n当今的计算机体系结构正处于快速发展和多样化的时期。十年前，大多数程序都运行在传统的单核处理器上，能够一次执行一个线程。在过去的十年里，那些简单的CPU已经被一系列多核CPU、1专用加速器(如Cell Broadband Engine)、2和所谓的图形处理单元(Graphics Processing Unit)所取代，这些处理器实际上能够进行强大的通用计算。3未来这一趋势可能会持续下去。很难预测短短五年后会有哪些架构可用，也很难预测哪些编程模型最适合利用它们。\n这给所有程序员带来了两难境地，尤其是对那些科学和工程领域的程序员来说。一方面，他们的计算需求往往是极端的，涉及只能在巨大的超级计算集群上运行的模拟或其他类型的计算。另一方面，他们用于开发软件的资源通常相当有限。为单一架构编写和优化所有必需的软件是一项挑战。为几个差异很大的体系结构重复该任务是完全不可能的。\n在某些方面，这种情况类似于计算机工业的早期，当时程序是用每台计算机的母语编写的。不同的处理器有不同的指令集，因此将程序移植到新的计算机上需要完全重写它。编译器通过在程序员和硬件之间引入抽象层解决了这个问题：程序可以用高级指令编写，这些指令可以自动转换成任何需要的处理器的机器语言。\n只要所涉及的处理器在功能和操作模式上都是基本相似的，这个方案就能很好地工作。当处理器差异太大时，它就会停止工作。例如，期望针对单核CPU和大规模并行GPU高效编译单个源代码是不合理的。这些体系结构需要完全不同的算法才能有效地执行相同的计算，这超出了任何现有编译器的范围。\n真正需要的是另一个抽象层，将程序员与其代码在其上运行的硬件隔离；不仅是它的指令集，而且是它的基本功能。人们应该能够使用适用于手头问题的高级概念来表达要解决的问题，而不需要指定使用什么特定的算法。然后，抽象层应该自动选择最适合当前可用硬件的那些概念的实现。这种方法已经在许多情况下成功使用，其中两个最突出的例子是用于线性代数的LAPACK4和用于3D图形的OpenGL 5。\n为了在特定的分子模拟领域实现这一目标，我们开发了OpenMM，这是一个在高性能计算体系结构上执行分子力学的库。它允许程序员使用高级的、独立于硬件的API编写他们的程序。然后，这些程序无需修改即可在任何支持API的硬件上运行。原则上，这可以是任何东西，从低端的单个CPU核心，到每个节点上都有多个CPU核心和GPU的大型超级计算集群。\n让我们详细考虑这些需求，看看它们是如何在OpenMM中实现的。\n在任何接口中，选择正确的抽象级别都是至关重要的。目标是确定问题的哪些方面应该由用户确定，哪些应该留给库来确定。太高的抽象级别会使库变得毫无用处：问题描述的某些方面是用户真正关心的，如果接口不允许他们准确地描述这些方面，他们就不能使用它。另一方面，太低的抽象级别限制了库在各种硬件上高效实现问题的能力。如果要求用户指定实际上对他们并不重要的实现细节，例如用于执行计算的特定算法，则不再有自动选择更适合可用硬件的不同算法的选项。\n在分子力学中，用户通常想要用势函数、约束、时间积分、温度耦合方法等来描述要解决的问题。他们应该能够指定这些，而不必描述，例如，使用什么方法来评估势函数。换一种略微不同的方式来表达，用户关心的是方程式，而不是算法。理想的界面应该允许用户指定他们想要建模的数学系统，同时让库以适当的方式自由地对该系统进行数值评估。\n即使接口没有显式定义如何实现计算，它也可以很容易地限制实际实现的范围。需要非常小心地确保API的任何功能都不会不必要地限制可以在其上使用的硬件平台。\nOpenMM中的一个示例是用于访问状态信息的机制。分子力学模拟涉及关于被模拟系统当前状态的各种数据：原子的位置和速度、作用在它们上的力等。传统上，模拟代码将这些值表示为内存中的数组。例如，当程序需要检查原子的位置时，它只需查看适当的数组元素。对于习惯使用这种代码的开发人员来说，访问原子位置的自然而明显的API将是一个获取原子索引并返回“该原子的当前位置”的例程。\n不幸的是，该API不可能在许多架构上有效实现。例如，当在GPU上进行计算时，原子位置存储在设备内存中，将它们传输到主机内存是一项相对昂贵的操作。对于原子位置分布在网络上的许多不同计算机的集群来说，问题甚至更严重。任何假定可以随时快速、随机地访问原子位置的程序，在这些系统上的运行速度都会非常慢。\nOpenMM通过显式地不直接访问状态数据来解决这个问题。相反，用户调用一个例程来创建State对象，预先指定应该存储在该对象中的所有信息。这有两个好处。首先，因为OpenMM事先知道用户将要请求的全套信息，所以它可以通过几个批量操作高效地收集这些信息。其次，用户意识到他们正在执行昂贵的操作，因此将仔细考虑他们何时以及如何访问状态数据。他们不会被看似微不足道的API调用(例如“获得ATOM 5的位置”)所误导，而这些API调用实际上很昂贵。\n如果这类库要想成功，它必须将接口和实现之间的划分作为其设计的一个基本方面。程序的作者应该不需要指定要使用什么实现。当程序运行时，它应该自动选择最适合可用硬件的任何实现。同时，它还应该允许程序查询可用的实现并手动选择要使用的实现。例如，程序的用户有时可能希望在主CPU上执行计算，其他时间则在GPU上执行计算。\n同样重要的是可扩展性。随着新硬件的出现，新的实施将是必要的。不可能枚举所有可能的实现，并且接口不能尝试这样做。它必须是可扩展的，这样就可以独立于主库编写新的实现，并且现有程序无需修改就可以使用它们。\nOpenMM通过插件架构实现了这一点。每个实现(或“平台”)都是作为动态库分发的，只需将其放在特定目录中即可安装。在运行时，将加载该目录中的所有库，并使其可供程序使用。\n它还提供了一种不同类型的可扩展性：插件不仅可以实现新平台，还可以向现有平台添加新功能。重要的是要理解，OpenMM不仅仅是一个用于执行某些计算的库；它还是一个旨在统一整个问题域的体系结构框架。虽然该库内置了特定的功能(例如，特定的潜在功能和集成方法)，但它也允许通过插件添加其他功能。我们的目标是提供一个框架，在这个框架内几乎可以实现任何分子力学计算。\n我们现在考虑如何创建满足这些目标的体系结构。OpenMM基于分层的体系结构，如图1所示。最高级别是公共API，开发人员在自己的应用程序中使用OpenMM时使用该API进行编程。在任何这样的库中，公共API必须以与问题领域(例如分子力学)相关的术语来表达概念，而不涉及这些概念是如何实现的。在OpenMM中，这些概念是粒子、力、时间积分方法等。例如，Force对象指定粒子之间交互的数学形式，但不规定用于计算它的特定算法。\n公共API通过调用较低级别的API来实现，该较低级别的API充当独立于平台的问题描述和依赖于平台的计算内核之间的接口。OpenMM将这个低级API表示为一组抽象的C++类，每个类定义一个要完成的特定计算。请注意这两个接口所扮演的非常不同的角色：公共API由核心OpenMM库实现，由用户调用；低级API由插件实现，由核心OpenMM库调用。\n在体系结构的最低层是计算内核的实际实现。这些代码可以用任何语言编写，并使用适用于它们在其上执行的硬件的任何技术。例如，它们可能使用诸如CUDA或OpenCL之类的技术来实现GPU计算，使用Pthread或OpenMP来实现并行CPU计算，使用MPI来跨集群中的节点分配工作，等等。\n这就留下了选择和调用低级API实现的关键任务。对于OpenMM，这意味着实例化定义每个内核的抽象类的具体子类。此任务由平台对象协调，该对象充当计算内核的工厂。公共API的每个类查询平台以获得它所需的每个内核的具体实例，然后使用该实例执行其计算。因此，选择使用哪种实现完全包括选择使用哪种平台。程序也可以选择不指定平台，在这种情况下，根据可用的硬件自动选择一个平台。\n实际上，安排要稍微复杂一些。平台不直接创建内核，而是将任务委托给一个或多个KernelFactory对象。这就是插件向现有平台添加新功能的方式：它定义一个计算内核，创建一个可以创建内核实例的KernelFactory，并将工厂添加到平台。当平台稍后被要求创建该内核的实例时，它使用新的KernelFactory来执行此操作。\n我们现在考虑一个具体的例子，说明这个体系是如何在实践中工作的：分子系统中原子之间非键相互作用的计算。在大多数模拟中，这占了大部分处理时间，因此对其进行很好的优化是非常重要的。\n在设计用来在CPU上运行的传统代码中，有一些成熟的技术可以有效地做到这一点。7首先建立一个邻居列表，该列表显式地枚举每一对足够接近相互作用的原子。通过使用基于体素的方法，这可以在O(N)时间内完成。然后循环邻居列表中的所有原子对，并计算它们之间的相互作用。OpenMM的参考平台(编写为在单个CPU线程上运行)就是以这种方式工作的。\n不幸的是，由于需要间接内存访问，GPU上的邻居列表效率非常低。对于每个邻居列表条目，必须加载有关所涉及的两个原子的信息(位置、电荷等)。由连续线程处理的原子的索引不需要遵循任何模式，因此不能合并存储器访问。\n因此，我们开发了一种更适合在GPU上运行的替代方法。我们把全套原子分成32个一组的块。然后，如图2所示，这组N2相互作用被分成(N/32)2个平铺，每个平铺都涉及两个原子块之间的相互作用。为了处理瓦片，我们将所涉及的64个原子的数据加载到共享内存中，计算它们之间的所有1024个相互作用，最后将产生的力和能量写出到全局内存。代替传统的邻居列表，我们使用了包含交互的瓦片列表：有效地，指定了32个原子的哪些块交互的邻居列表。其他研究人员也开发了在GPU上计算非绑定交互的算法。-11。\n我们的方法是为在NVIDIA GPU上使用而设计的，每个块(32个原子)的大小被选择为与这些处理器的SIMD宽度相匹配。使其适应其他类型的处理器，甚至其他GPU，都需要对算法进行修改。例如，某些AMD GPU的SIMD宽度为64，因此必须以不同的方式在平铺之间分配线程才能获得最高效率。\n因此，我们需要几种完全不同的算法来在不同的硬件上高效地实现相同的计算。然而，值得注意的是，算法的选择仅取决于硬件，而不取决于所计算的力的精确形式。在分子模拟中，有许多不同的数学形式用于表示非键相互作用，不同的数学形式包括范德华相互作用的建模方式、截止点的平滑、溶剂筛选效应等。这些都是科学家在运行模拟时真正关心的重要区别。理想情况下，程序员应该能够选择交互的函数形式，并且仍然使用可用硬件的最有效算法来计算它们。用户应指定要使用的方程式，库应确定如何最好地评估这些方程式。\nOpenMM通过其CustomNonbondedForce类实现此目标。此类允许用户为原子之间的成对能量指定任意数学函数。该函数可能取决于任意一组原子参数和列表函数，以及各种标准数学函数。例如，以下代码行创建CustomNonbondedForce来计算Lennard-Jones 12-6交互作用：\n第一行指定作为距离r的函数的相互作用的能量：\n其中，使用Lorentz-Bertelot组合规则合并来自两个相互作用原子的参数：σ的算术平均值和ε的几何平均值。接下来的两行指定参数“sigma”和“epsilon”应该与每个原子相关联。\nOpenMM现在的任务是在各种硬件平台上高效地实现这一点。它首先解析用户指定的表达式，然后解析微分能量以确定力的表达式。然后将每个表达式转换为指令序列。为了计算表达式，引用和CUDA实现循环遍历指令并执行每个指令，从而有效地充当内部语言的解释器。\n对于基于OpenCL的实现，更好的解决方案是可能的。因为OpenCL允许在运行时从源代码编译程序，12所以可以使用插入到适当的硬件特定算法中的用户定义的数学表达式来合成内核。然后，内核被编译成设备的机器码，消除了解释表达式的成本，并产生了几乎与整个内核都是手工编写的一样快的性能。\n我们强调，这种方法在我们的代码中允许极大的灵活性，允许快速开发的强大组合(即，可以很容易地更改粒子之间交互的关键底层方程)，同时仍然保持快速执行(因为底层优化，特别是使用OpenCL，允许最小的开销)。这为我们的代码打开了新用途的大门，特别是在模拟粒子相互作用的新方法的快速发展方面，例如用于分子模拟的新的隐式溶剂模型。\n我们实现了与分子模拟中所有最广泛使用的能量项相对应的力类：各种键合力，用于非键相互作用的Lennard-Jones和Coulomb力，用于长程库仑力的Ewald求和和粒子网格Ewald，以及广义Born隐式溶剂模型。OpenMM还包括几种时间整合方法和实施距离约束的能力。这些功能在三个不同的平台上实现：用C++编写的参考平台，用于NVIDIA GPU的基于CUDA的平台，以及用于各种GPU和CPU的基于OpenCL的平台。\n我们之前已经发布了在模拟各种蛋白质时CUDA实现的基准。在显性溶剂(共73,886个原子)中模拟318个残基蛋白质时的速度为5 ns/d，在隐式溶剂中模拟33个残基蛋白质(共544个原子)时的速度为576 ns/d。我们还将其与几个广泛使用的分子动力学软件包在模拟显式溶剂中的80个残基蛋白质时的单CPU核心性能进行了比较。结果发现，它比Gromacs快6.4倍，比NAMD快28倍，比Amber快59倍。(GPU计算在NVIDIA GTX280上运行，CPU计算在3.0 GHz Intel Core 2 Duo上运行。)。\nOpenMM的最新功能是自定义力，它允许用户指定力的形式的任意代数表达式。除了上述CustomNonbondedForce之外，还有一个用于键合相互作用的CustomBondForce，用于独立施加到每个原子的力的CustomExternalForce，以及支持多种隐式溶剂模型的CustomGBForce。这些在OpenCL平台上最有用，因为它允许在性能损失很小的情况下使用它们。在初步测试中，我们发现使用CustomNonbondedForce实现的Coulomb和Lennard-Jones力仅比标准的手工编码实现慢约4%。这意味着，没有GPU编程经验的科学家仍然可以为他们的非绑定交互实现任意函数形式，并获得几乎与手动调整的GPU代码一样好的性能。\n计算机架构的快速、持续变化。\n..", "note_en": "The wide diversity of computer architectures today requires a new approach to software development. OpenMM is a framework for molecular mechanics simulations, allowing a single program to run efficiently on a variety of hardware platforms.\n Computer architectures today are in a period of rapid advancement and diversification. A decade ago, most programs were run on conventional, single core processors capable of executing one thread at a time. In the last ten years, those simple CPUs have been replaced by an array of multi-core CPUs,  1 dedicated accelerators such as the Cell Broadband Engine,  2 and so-called Graphics Processing Units that are actually capable of powerful, general purpose computation.  3 This trend is likely to continue in the future. It is difficult to predict what architectures will be available as little as five years from now, or what programming models will be best suited to exploiting them.\n This creates a dilemma for all programmers, but especially for those in science and engineering. On the one hand, their computing needs are often extreme, involving simulations or other types of calculations that can only be run on enormous supercomputing clusters. On the other hand, their resources for developing software are usually quite limited. Writing and optimizing all the necessary software for a single architecture is a challenge. Repeating the task for several widely differing architectures is completely out of the question.\n In some ways, this situation is analogous to the early days of the computer industry when programs were written in each computer’s native machine language. Different processors had different instruction sets, so porting a program to a new computer required completely rewriting it. Compilers solved this problem by introducing an abstraction layer between the programmer and the hardware: programs could be written in terms of higher level instructions, and those could automatically be transformed into the machine language of any processor desired.\n This scheme works well as long as the processors involved are all fundamentally similar in their capabilities and operating models. When the processors differ too much, it ceases to work. For example, it is unreasonable to expect a single piece of source code to be compiled efficiently for both a single core CPU and a massively parallel GPU. These architectures require fundamentally different algorithms to perform the same calculation efficiently, and that is beyond the scope of any existing compiler.\n What is really required is another abstraction layer to isolate the programmer from the hardware their code is running on; not just its instruction set, but its fundamental capabilities. One should be able to express the problem to solve using high level concepts appropriate to the problem at hand without needing to specify what particular algorithms to use. The abstraction layer should then automatically select an implementation of those concepts most appropriate to the currently available hardware. This approach has been used successfully in a number of cases, two of the most prominent examples being LAPACK  4 for linear algebra and OpenGL  5 for 3D graphics.\n To address this goal within the specific domain of molecular simulation, we have developed OpenMM, a library for performing molecular mechanics on high performance computing architectures.   It allows programmers to write their programs using a high level, hardware independent API. Those programs can then run without modification on any hardware that supports the API. In principle, that could be anything from a single CPU core at the low end, up to a large supercomputing cluster with multiple CPU cores and GPUs on each node.\n    Let us consider each of these requirements in detail, and see how they are implemented in OpenMM.\n In any interface, it is critical to choose the right level of abstraction. The goal is to identify which aspects of the problem should be determined by the user, and which should be left to the library to determine. Too high a level of abstraction will make the library useless: there are certain aspects of the problem description that the user genuinely cares about, and if the interface does not allow them to precisely describe those aspects, they cannot use it. On the other hand, too low a level of abstraction restricts the library’s ability to implement the problem efficiently on a variety of hardware. If the user is required to specify implementation details that are not actually important to them, such as specific algorithms for performing calculations, there is no longer an option to automatically pick a different algorithm better suited to the available hardware.\n In molecular mechanics, the user typically wants to describe the problem to solve in terms of potential functions, constraints, time integrations, temperature coupling methods, etc. They should be able to specify those without having to describe, for example, what method to use for evaluating the potential function. To express it in a slightly different way, the user cares about  equations, not  algorithms. An ideal interface should allow the user to specify the mathematical system they want to model, while leaving the library free to numerically evaluate that system in an appropriate way.\n Even if the interface does not explicitly define how the calculations are to be implemented, it can easily restrict the range of implementations that are practical. Great care is needed to ensure that no feature of the API will unnecessarily restrict the hardware platforms it can be used on.\n An example of this from OpenMM is in the mechanism for accessing state information. A molecular mechanics simulation involves various data about the current state of the system being simulated: the positions and velocities of atoms, the forces acting on them, etc. Traditionally, simulation codes have represented these values as arrays in memory. When a program needs to examine the position of an atom, for example, it simply looks at the appropriate array element. To a developer accustomed to using such a code, a natural and obvious API for accessing atom positions would be a routine that takes an atom index and returns “the current position of that atom”.\n Unfortunately, that API would be impossible to implement efficiently on many architectures. When doing calculations on a GPU, for example, the atom positions are stored in device memory, and transferring them to host memory is a relatively expensive operation. The problem is even worse for a cluster, where atom positions are distributed between many different computers across a network. Any program that assumes it has fast, random access to atom positions at all times is guaranteed to run very slowly on these systems.\n OpenMM addresses this by explicitly  not giving direct access to state data. Instead, the user invokes a routine to create a State object, specifying in advance all information that should be stored in that object. This has two advantages. First, because OpenMM knows in advance the full set of information the user is going to request, it can efficiently collect that information with a few bulk operations. Second, the user is aware they are performing an expensive operation, and therefore will give careful thought to when and how they access state data. They are not misled by seemingly trivial API calls (e.g. “get the position of atom 5”) that actually are expensive.\n If a library of this sort is to be successful, it must incorporate the division between interface and implementation as a fundamental aspect of its design. The author of a program should not need to specify what implementation to use. When the program is run, it should automatically select whatever implementation is most appropriate to the available hardware. At the same time, it should also allow the program to query the available implementations and manually select which one to use. For example, the user of a program might sometimes want to perform calculations on the main CPU and other times on a GPU.\n Equally important is extensibility. As new hardware becomes available, new implementations will be necessary. It is impossible to enumerate all possible implementations, and the interface must not attempt to do so. It must be designed to be extensible, so new implementations can be written independently of the main library and existing programs can use them without modification.\n OpenMM accomplishes this by means of a plugin architecture. Each implementation (or “Platform”) is distributed as a dynamic library and installed simply by placing it in a particular directory. At runtime, all libraries in that directory are loaded and made available to the program.\n It also provides extensibility of a different sort: plugins are able not only to implement new Platforms, but also to add new features to existing Platforms. It is important to understand that OpenMM is not merely a library for performing certain calculations; it is an architectural framework designed to unify an entire problem domain. While the library comes with particular features built in (e.g. particular potential functions and integration methods), it also permits other features to be added by plugins. The goal is to provide a framework within which nearly any molecular mechanics calculation can be implemented.\n We now consider how to create an architecture that meets these goals. OpenMM is based on a layered architecture, as shown in   Figure 1. At the highest level is the public API, which developers program against when using OpenMM in their own applications. In any such library, the public API must express concepts in terms relevant to the problem domain (e.g. molecular mechanics) without reference to how those concepts are implemented. In the case of OpenMM, those concepts are particles, forces, time integration methods, etc. For example, a Force object specifies the mathematical form of an interaction between particles, but does not dictate a particular algorithm for computing it.\n  The public API is implemented through calls to a lower level API that serves as an interface between the platform-independent problem description and platform-dependent computational kernels. OpenMM represents this low level API as a set of abstract C++ classes, each defining a particular computation to be done. Note the very different roles played by these two interfaces: the public API is implemented by the core OpenMM library and is invoked by users; the low level API is implemented by plugins and is invoked by the core OpenMM library.\n At the lowest level of the architecture are the actual implementations of the computational kernels. These may be written in any language and use any technology appropriate for the hardware they execute on. For example, they might use a technology such as CUDA or OpenCL to implement GPU calculations, Pthreads or OpenMP to implement parallel CPU calculations, MPI to distribute work across nodes in a cluster, etc.\n This leaves the critical task of selecting and invoking an implementation of the low level API. In the case of OpenMM, this means instantiating a concrete subclass of the abstract class defining each kernel. This task is coordinated by a Platform object, which acts as a factory for computational kernels. Each class of the public API queries the Platform to get a concrete instance of each kernel it requires, then uses that instance to perform its calculations. The choice of what implementation to use thus consists entirely of choosing which Platform to use. A program may also elect not to specify a Platform, in which case one is chosen automatically based on the available hardware.\n Actually, the arrangement is slightly more complicated. A Platform does not create kernels directly, but instead delegates the task to one or more KernelFactory objects. That is how a plugin can add new features to an existing Platform: it defines a computational kernel, creates a KernelFactory that can create instances of the kernel, and adds the factory to the Platform. When the Platform is later asked to create an instance of that kernel, it uses the new KernelFactory to do so.\n We now consider a concrete example of how this architecture works in practice: the computation of nonbonded interactions between atoms in a molecular system. This accounts for the bulk of the processing time in most simulations, so it is very important that it be well optimized.\n In conventional codes designed to run on CPUs, there are well established techniques for doing this efficiently.  7 One begins by building a neighbor list that explicitly enumerates every pair of atoms that are close enough to interact with each other. By using voxel based methods, this can be done in O(N) time. One then loops over all atom pairs in the neighbor list and computes the interaction between them. OpenMM’s reference Platform, which is written to run on a single CPU thread, works in exactly this way.\n Unfortunately, neighbor lists are very inefficient on a GPU due to the need for indirect memory access. For each neighbor list entry, one must load information about the two atoms involved (position, charge, etc.). The indices of the atoms processed by successive threads need not follow any pattern, so the memory access cannot be coalesced.\n We therefore have developed an alternate method better suited to running on a GPU.   We divide the full set of atoms into blocks of 32. The set of N 2 interactions then divides into (N/32) 2 tiles as shown in   Figure 2, each involving the interactions between two blocks of atoms. To process a tile, we load the data for the 64 atoms involved into shared memory, compute all 1024 interactions between them, and finally write out the resulting forces and energies to global memory. In place of a conventional neighbor list, we use a list of which tiles contain interactions: effectively, a neighbor list specifying which blocks of 32 atoms interact. Other researchers have also developed algorithms for computing nonbonded interactions on GPUs.  – 11\n  Our method was designed for use on Nvidia GPUs, and the size of each block (32 atoms) was chosen to match the SIMD width of those processors. Adapting it to other types of processors, even other GPUs, requires modifications to the algorithm. For example, some AMD GPUs have a SIMD width of 64, so threads must be distributed between tiles in a different way to obtain maximum efficiency.\n We therefore need several fundamentally different algorithms to efficiently implement the same calculation on different hardware. Significantly, however, the choice of algorithm depends only on the hardware, not on the precise form of the force being calculated. Many different mathematical forms are used to represent nonbonded interactions in molecular simulations, differing in how they model van der Waals interactions, smoothing of cutoffs, solvent screening effects, etc. These are important differences that scientists genuinely care about when running simulations. Ideally, programmers should be able to choose the functional forms of the interactions and still have them calculated using the most efficient algorithm for the available hardware. The user should specify the equations to use, and the library should determine how best to evaluate those equations.\n OpenMM accomplishes this goal through its CustomNonbondedForce class. This class allows the user to specify an arbitrary mathematical function for the pairwise energy between atoms. That function may depend on an arbitrary set of atomic parameters and tabulated functions, as well as a variety of standard mathematical functions. For example, the following lines of code create a CustomNonbondedForce to calculate a Lennard-Jones 12-6 interaction:\n   The first line specifies the energy of the interaction as a function of the distance  r:\n  where the parameters from two interacting atoms are merged using Lorentz-Bertelot combining rules: the arithmetic mean of the sigmas and the geometric mean of the epsilons. The next two lines specify that the parameters “sigma” and “epsilon” should be associated with each atom.\n OpenMM now has the task of implementing this efficiently on a variety of hardware platforms. It begins by parsing the user-specified expressions and analytically differentiating the energy to determine an expression for the force. Each expression is then converted to a sequence of instructions. To evaluate an expression, the reference and CUDA implementations loop over the instructions and perform each one, effectively acting as an interpreter for an internal language.\n For the OpenCL based implementation, a better solution is possible. Because OpenCL allows programs to be compiled from source code at run time,  12 it is possible to synthesize a kernel with the user-defined mathematical expression inserted into the appropriate hardware-specific algorithm. That kernel is then compiled down to the device’s machine code, eliminating the cost of interpreting the expression and yielding nearly as fast performance as if the entire kernel had been written by hand.\n We stress that this approach allows for a great deal of flexibility in our code, permitting the powerful combination of rapid development (i.e. one can change the key underlying equations for interactions between particles easily) and yet still retaining rapid execution (since the underlying optimizations, especially with OpenCL, allows for minimal overhead). This opens the door to new uses of our code, especially in terms of the rapid development of novel methods for simulating particle interactions, such as novel implicit solvent models for molecular simulation.\n We have implemented Force classes corresponding to all the most widely used energy terms in molecular simulations: a variety of bonded forces, Lennard-Jones and Coulomb forces for nonbonded interactions, Ewald summation and Particle Mesh Ewald for long range Coulomb forces, and a Generalized Born implicit solvent model. OpenMM also includes several methods of time integration and the ability to enforce distance constraints. These features are implemented in three different Platforms: a reference Platform written in C++, a CUDA based Platform for Nvidia GPUs, and an OpenCL based Platform for a variety of GPUs and CPUs.\n We have previously published benchmarks for the CUDA implementation when simulating a variety of proteins.  ,   Speeds range from 5 ns/day when simulating a 318 residue protein in explicit solvent (73,886 atoms total) up to 576 ns/day when simulating a 33 residue protein in implicit solvent (544 atoms total). We also compared it to the single CPU core performance of several widely used molecular dynamics packages when simulating an 80 residue protein in explicit solvent. It was found to be 6.4 times faster than Gromacs, 28 times faster than NAMD, and 59 times faster than AMBER. (GPU calculations were run on an Nvidia GTX280, and CPU calculations were run on a 3.0 GHz Intel Core 2 Duo.)\n The newest feature of OpenMM is custom forces that let the user specify an arbitrary algebraic expression for the form of their force. In addition to the CustomNonbondedForce described above, there is also a CustomBondForce for bonded interactions, CustomExternalForce for forces applied independently to each atom, and CustomGBForce which supports a wide range of implicit solvent models. These are most useful with the OpenCL platform, since it allows them to be used with very little performance penalty. In preliminary testing, we have found that Coulomb and Lennard-Jones forces implemented with CustomNonbondedForce are only about 4% slower than the standard, hand coded implementations. This means that a scientist with no GPU programming experience can still implement arbitrary functional forms for their nonbonded interactions, and get nearly as good performance as hand tuned GPU code.\n Rapid, ongoing changes to computer archi\n......", "posttime": "2020-05-11 02:19:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "硬件,无关,hardware,实现", "title": "OpenMM：一种与硬件无关的分子模拟框架", "title_en": "OpenMM: A Hardware Independent Framework for Molecular Simulations", "transed": 1, "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4486654/", "via": "", "real_tags": ["硬件", "无关", "hardware", "实现"]}, {"category": "", "categoryclass": "", "imagename": "af2ec602b1efab8453e67ef50f61e4a5.jpg", "infoid": 1001555, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最喜欢的是小型的亲密聚会，我们围坐在研讨会桌旁面对面，谈话很容易进行。中等规模的班级聚集在一个正方形的房间里，一边是窗户。一年中的这个时候，随着春天的阳光倾泻而来，下午变得酷热难耐。我的学生们懒洋洋地坐在那些不舒服的椅子上，椅子上摆放着杂乱无章的书桌，而我则在房间前面踱来踱去，试图唤起他们对一些神秘的人类学学科的兴趣。有时候我很成功。导论课在一个很大的报告厅里进行，从我在教室底部的有利位置，我看到一排排的学生整齐地散布在我的面前。我最近开始戴处方眼镜，这样我就能分辨出他们的脸，由于中年的侵蚀，他们的脸开始变得模糊起来。\n每种类型的教室都带来了不同的挑战和乐趣，但它们都有一个共同点。在这些教室里，学生们表面上是平等的。他们坐在同一把椅子上。\n在我执教了14年的皇后区法拉盛皇后学院校区的大楼入口处，文化评论家钟钩给我一句名言：“学院不是天堂。但是学习是可以创造天堂的地方。“。在这本书中，她继续说：“课堂，尽管有它的局限性，仍然是一个可能的地方。”\n当纽约市立大学关闭校区时，我匆忙开始将我130名学生的文化人类学导论课程的剩余讲座制作成视频。由于日程被彻底打乱，电脑访问受限，Wi-Fi参差不齐，以及其他障碍，这种规模的同步虚拟课堂是不可能的。学生们现在可以在手机上看我的课了。\n在我的小型研讨会课程中，我们使用Zoom尽可能地重现课堂体验。当我们讨论我们的读物时，我观察了装饰我的学生墙壁的海报、照片和挂毯。我看着他们的伴侣和宠物在背景中像影子一样移动。我看到工作区从狭小而笨拙的空间中即兴发挥出来。当学生取消麦克风静音讲话时，我听到令人分心的背景噪音。\n这些Zoom式的亲密关系通常很讨人喜欢，有时我会欢迎这种奇怪的、意想不到的方式，这段时期的强制隔离带来了与他人的新类型的亲密。我喜欢知道这个学生用一个大陶杯喝茶，而那个学生似乎很喜欢用室内植物。但我也意识到，对我学生家中的这些一瞥违反了课堂的隐含契约，在课堂上，学生们可以在一定程度上控制他们校外生活的哪些部分进入视线。\n这并不是说教室曾经与外部世界隔离过--也不应该是这样。当学生将他们不同的生活经历运用到我们的讨论中时，他们建立了有洞察力的联系，并将抽象的想法生动具体地呈现出来。我最喜欢的教学部分之一是看到学生将我教授的概念与他们的生活联系起来。我经常觉得我的主要角色是给他们一个词汇表，让他们思考--并把他们已经知道的东西用语言表达出来。\n有时，他们的个人生活会以不太受欢迎的方式泄露到教室里。一名学生为在课堂上打瞌睡道歉；由于他的父亲被解雇，他增加了作为优步司机的夜间工作时间。另一个人逃课了，后来解释说，他必须在母亲预约医生的时候为她翻译。一名学生抱歉地请求允许她在上课时把手机放在桌子上，这样她就可以看着她生病在家的儿子发来的短信。另一个人哭着来到我的办公室，担心我的课程不及格。自从她的家人被赶出公寓以来，她一直无法学习。\n当你在皇后学院这样的公立通勤学校任教时，这些都是很平常的事情。现在大流行来了，它既揭示了我们城市和国家的不平等，也加剧了我们的不平等，使得低收入有色人种-大多数纽约州立大学的学生-在健康和生计方面更容易受到伤害。我在我的收件箱里清楚地看到了这一点，收件箱里充斥着来自生病或照顾生病的家庭成员的学生的电子邮件。一名学生错过了一次测验，因为他必须赶着把他的祖母送到医院；几天后，他写信告诉我她去世了。一些学生作为“必需品”工作时间更长，而另一些学生则失去了工作。我最担心的是那些我根本没有消息的人。\n课堂上的平等是虚构的，否则的说法将是荒谬的。令人痛苦的是，很明显，我的学生中只有一些人从强大的高中教育中受益。另一些人在大学开始时没有做好基础阅读和写作技能的准备。许多人是移民，他们在学术英语上苦苦挣扎，错过了让我们的阅读更容易理解的文化参考。种族、性别、阶级、性取向、公民身份和其他因素塑造了一个人在课堂上感到自信和害怕说错话的人。\n当我们假装这种不平等不存在时，我们就允许它们不受挑战地存在。但与其他乌托邦梦想一样，平等的虚构-由那些坐着统一椅子的普通房间培养出来的-也有其价值。\n与寄宿大学的许多中上阶层同龄人不同，我的大多数学生都住在家里。校园的关闭和突然转向在线学习对他们来说可能不那么令人震惊，因为大学从来都不是一种远离家庭生活复杂需求和餐桌上食物压力的与世隔绝的经历。\n但这正是教室如此重要的原因。这并不是一个与我们生活的受损和不公平的世界分开的空间，而是一个学生首先作为伙伴学习者彼此相遇的地方。作为一名教师，我不能让一个非常不平等的竞争环境变得公平。但是在教室里，我和我的学生可以尝试建立一个社区，在那里我们相互尊重地倾听，每个人都有权发言，学生们分享他们的经历是因为我们共同建立的信任，而不是因为他们的私生活通过Zoom展示。\n纽约州立大学的学生和教职员工都很有弹性；我们知道如何用比我们应得的更有限的资源过活。目前，我和我的学生们只能勉强在拥挤、有时甚至是混乱的家里授课和学习，这是我们必须做的。但一旦有可能，我们想再次坐在那些不舒服的椅子上，伸手去我们的学习天堂。\n凯伦·斯特拉斯勒(Karen Strassler)是纽约城市大学皇后学院(Queens College)和研究生中心(Graduate Center)的人类学副教授，著有“苛刻的形象：印尼的民主、调解和形象事件”(Required Images：Democratic，Mediation，and the Image-Event in印度尼西亚)一书。", "note_en": "My favorites are the small intimate ones where we face each other around a seminar table and conversation flows easily. Midsize classes meet in a square room with windows along one side. Around this time of year it becomes unbearably hot in the afternoon, as the spring sunshine streams in. My students slouch drowsily in those uncomfortable chairs with built-in desks, arranged in haphazard rows, while I pace at the front of the room, trying to arouse their interest in some arcane anthropological subject. Sometimes I’m successful. Introductory classes are held in a large lecture hall, and from my vantage point at the bottom of the room, I see rows of students fanned out neatly before me. I recently started wearing prescription glasses so I could distinguish their faces, which were beginning to smudge together as a result of encroaching middle age.\n Each type of classroom presents distinct challenges and pleasures, but they all have one thing in common. In these classrooms, students meet one another as apparent equals. They sit in the same chairs.\n At the entrance to the building on the Queens College campus in Flushing, Queens, where I have taught for 14 years, I am greeted with a quote by the cultural critic bell hooks: “The academy is not paradise. But learning is a place where paradise can be created.” In the book from which these words are taken she continues: “The classroom, with all its limitations, remains a location of possibility.”\n When City University of New York campuses shut down, I hastily began turning the remaining lectures for my 130-student Introduction to Cultural Anthropology course into videos. With schedules radically disrupted, limited computer access, spotty Wi-Fi and other obstacles, synchronous virtual classes of this size are impossible. Students can now watch my lectures on their phones.\n In my small seminar course, we use Zoom to recreate the classroom experience as best we can. As we discuss our readings, I observe the posters, photos and tapestries that decorate my students’ walls. I watch their partners and pets moving like shadows in the background. I see work areas improvised out of cramped and awkward spaces. I hear distracting background noises when a student unmutes her microphone to speak.\n  These Zoom intimacies are often endearing, and at times I welcome the strange, unexpected ways this period of enforced isolation brings about new kinds of closeness with others. I like knowing that this student drinks tea from a big ceramic mug, while that one seems to be good with houseplants. But I’m also aware that these glimpses into my students’ homes violate the implicit contract of the classroom, where students have some measure of control over what parts of their lives outside of school come into view.\n It’s not that the classroom is ever sealed off from the outside world — nor should it be. When students bring their divergent life experiences to bear on our discussions, they make insightful connections and render abstract ideas vividly concrete. One of my favorite parts of teaching is seeing students link the concepts I teach to the lives they lead. I often feel that my primary role is to give them a vocabulary to think about — and put into words — what they already know.\n Sometimes their personal lives leak into the classroom in less welcome ways. A student apologizes for falling asleep in class; he has increased his hours working at night as an Uber driver because his father was laid off from his job. Another misses class, explaining later that he had to translate for his mother at her doctor’s appointment. One student apologetically asks permission to keep her phone on her desk during class so she can watch for texts from her son, who is sick at home. Another comes to my office in tears, worried she will fail my course. She has been unable to study since her family was evicted from their apartment.\n These are ordinary occurrences when one teaches at a public, commuter school like Queens College. And now comes the pandemic, which both reveals and worsens the inequities in our city and country, rendering lower-income people of color — the majority of CUNY students — more vulnerable in terms of health and livelihood. I see this clearly in my inbox, which has been flooded with emails from students who are ill or tending to stricken family members. A student misses a quiz because he has to rush his grandmother to the hospital; a few days later he writes to tell me she has died. Some students are working longer hours as “essential workers,” while others have lost their jobs. I worry most about the ones I haven’t heard from at all.\n Equality in the classroom is a fiction — it would be absurd to suggest otherwise. It’s painfully obvious that only some of my students benefited from strong high school educations. Others start college inadequately prepared in foundational reading and writing skills. Many are immigrants who struggle with academic English and miss the cultural references that would make our readings more readily accessible. Race, gender, class, sexuality, citizenship status and other factors shape who feels confident speaking up in class and who feels afraid of saying the wrong thing.\n When we pretend such inequities don’t exist, we allow them to persist unchallenged. But like other utopian dreams, the fiction of equality — cultivated by those generic rooms with their uniform chairs — also has its value.\n Unlike many of their middle and upper-class counterparts at residential colleges, most of my students live at home. The closure of campuses and the sudden shift to online learning is perhaps less of a shock to them, because college has never been a cloistered experience away from the complicated demands of family life and the pressures of putting food on the table.\n But that’s exactly why the classroom is so crucial. It is not a space apart from the damaged and unfair world in which we live, but it is a place where students meet each other, first and foremost, as fellow learners. As a teacher, I cannot level a deeply unequal playing field. But within the classroom, my students and I can try to forge a community where we listen to one another with respect, where everyone has a right to the floor, and where students share their experiences because of the trust we’ve built together, not because their private lives are on display via Zoom.\n CUNY students and faculty are resilient; we know how to get by with more limited resources than we deserve. For now, my students and I make do, as we must, teaching and learning from our crowded and sometimes chaotic homes. But as soon as it becomes possible, we want to be sitting in those uncomfortable chairs again, reaching for our paradise of learning.\n  Karen Strassler, an associate professor of anthropology at Queens College and the Graduate Center, City University of New York, is the author of “ Demanding Images: Democracy, Mediation, and the Image-Event in Indonesia.”", "posttime": "2020-05-11 02:19:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "变焦,classroom,学生", "title": "当我们从教室走到变焦时，我们失去了什么", "title_en": "What We Lose When We Go from the Classroom to Zoom", "transed": 1, "url": "https://www.nytimes.com/2020/05/04/sunday-review/zoom-college-classroom.html", "via": "", "real_tags": ["变焦", "classroom", "学生"]}, {"category": "", "categoryclass": "", "imagename": "83e6d1b179612e11eb631e23d2dbe856.jpg", "infoid": 1001554, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的一年半里，我一直使用Ubuntu作为我的主要家用桌面操作系统，所以我想现在是写下我的经历的好时机。希望目前正在使用Mac或Windows的其他Web开发人员会对此感兴趣，他们可能对Linux很感兴趣。\n注：在这篇文章中，我将主要讨论Ubuntu。我也尝试过其他Linux发行版，但我坚持使用Ubuntu，因为如果我有问题，我可以在谷歌上搜索它，99.9%的时间都能找到答案。\n我第一次改用Linux是在2007年，当时我还在上大学。当时我觉得它比Windows Vista有了很大的进步(速度快多了！)。对程序员来说也更好！)，但它也伴随着很多令人头疼的问题：\nWiFi不能开箱即用。我不得不使用ndiswrapper来包装Windows驱动程序。\n多显示器和演示都很糟糕。每次我使用xrandr，我都知道我会很痛苦。\n对许多消费者应用程序的支持很差。我记得在Wine中的Firefox上运行Netflix是因为这是让它工作的唯一方法。\n大约在2012年，我转而使用Mac--主要是因为我注意到，每一个在会议上演讲的网络开发人员都在使用Mac。然后我在2016年加入微软时成为Windows/Mac双用户，直到2018年离开微软后才再次考虑Linux。\n我很高兴地说，到2020年，我的旧Linux难题将不复存在。在我的Dell XPS 13(预装Ubuntu)上，WiFi和多显示器开箱即用。如今，似乎所有东西都是电子应用程序或网站，所以很少能找到不支持Linux的消费者应用程序。(至少，我关心的那些；我相信您可以找到反例！)。我现在最大的抱怨是字体，这与摆弄WiFi驱动程序大相径庭。\n好了，历史够多了，让我们从Web开发人员的角度来谈谈2020年Linux的好与坏。\n我倾向于在命令行上生活和呼吸，对我来说，Linux上的命令行是首屈一指的。\n主要原因应该很清楚：如果您编写的代码将在某个服务器上运行，则该服务器可能会运行Linux。即使您没有做太多的sysadmin工作，您也可能使用Linux来运行您的测试和CI基础设施。因此，最终您的代码将不得不在Linux上运行。\n使用Linux作为您的台式机只会让事情变得简单得多。我所有的服务器都运行Ubuntu，我的Travis CI测试也是如此，我的桌面也是如此。我知道我的shell脚本将在所有这些环境中完全相同地运行。如果您曾经因为mac和linux shell之间的细微差别而感到头疼(例如，grep、tar和sed的版本与标志略有不同，所以您必须BREW安装coreutil并使用ggrep和gtar…)。那你就知道我在说什么了。\n如果你是Mac用户，切换到Linux终端最困难的部分可能就是你记住的用来打开选项卡和窗格的iTerm键盘快捷键。我发现最简单的解决方案是使用tmux。额外的好处是，tmux也可以在Mac上运行，所以如果你只学了一次键盘快捷键，你就可以在任何地方使用它们。我将终端设置为在启动时自动打开tmux。\n由于命令行是Linux(IMO)的主要卖点，因此将Windows与Linux的Windows子系统一起使用是很有诱惑力的。这绝对是一个可行的选择，而且完全合理，特别是如果有一个你真正需要的Windows程序(或者你是一个PC游戏玩家)。不过，对我来说，我不太玩PC游戏，我使用WSL的经验是，虽然兼容性很好，但性能很差。与同等的Mac或Linux机器相比，在WSL上安装NPM所需的时间要多出几个数量级。(请记住，我早在2016-2018年就在使用WSL，有人告诉我，从那以后它得到了改进。)。\n不过，对我来说，我就是找不到合我口味的Windows。对我来说，UI总是感觉缓慢而笨重，这可能只是我的看法，尽管当我读到布鲁斯·道森(Bruce Dawson)这样的博客帖子时，我觉得有点被证明是正确的。(右键单击任务栏图标速度很慢！为什么？)。无论如何，Ubuntu启动速度很快，系统更新迅速且不引人注目，而且它不会遗漏任何对我来说必不可少的应用程序。所以我运行100%的Ubuntu，甚至没有双引导。\n对于普通的web开发人员来说，您需要的大多数东西在Linux上都能很好地工作。你可以运行Chrome和VS Code(或者WebStorm，我更喜欢)，所有的命令行实用程序，比如node和npm，都会一样工作。您可以使用NVM管理节点版本。到现在为止还好。\n作为一名Web开发人员，我遇到的最大问题是无法快速测试所有三大浏览器引擎--Blink(Chrome)、Gecko(Firefox)和WebKit(Safari)。特别是现在Edge已经没有Chromium了，而且Trident/EdgeHTML的血统正在慢慢消亡，有了Mac，你可以测试所有三个主要的浏览器引擎，而不必切换到另一台机器或使用BrowserStack这样的工具，这真的很吸引人。\n当然，在Linux上我们有Chrome和Firefox，它们和Mac上运行的基本相同，所以它们非常符合要求。对于WebKit，我们甚至有GNOME Web(又名Epiphany浏览器)，但我认为它作为Safari的替身“还可以”。它不支持一些Safari特有的API(如背景滤镜、Apple Pay等)，而且速度非常慢，但这对快速检查一些代码是否能在Safari上很好地运行是有好处的。\n不幸的是，对我来说，我不认为这是“足够好的”，特别是因为绝大多数Safari用户都在iOS上，所以这才是你真正想要测试的平台。从Web开发人员的角度来看，这就是Linux遇到的最大缺点：调试iOS Safari。\n如果你想在Android上调试Chrome或Firefox-没问题。ADB在Linux上运行得很好，你可以在Chrome上运行Chrome：Inspect，或者在Firefox上进行远程调试，它们都运行得很好。不过，对于iOS Safari，您拥有的最佳选择是remotedebug-ios-webkit-Adapter，它在幕后使用iOS-webkit-debug-proxy。\n本质上，这是一套精心设计的工具，可以让iOS Safari看起来有点像Chrome，这样你就可以使用Chrome DevTools来调试它了。最令人惊叹的是…。它真的起作用了！只要您可以正确运行奇怪的依赖项，您就可以将熟悉的Chrome DevTools连接到iOS设备上。\n如果你有一部闲置的iPhone或iPod Touch，这是一个不错的选择。但它仍然与Mac上的简化体验相去甚远，在Mac上，你可以在选择的任何iOS版本上快速运行iOS模拟器，而且Safari调试可以开箱即用。\n对于可访问性测试，情况类似。当然，Firefox和Chrome都有辅助工具，但它们不能替代Mac上的VoiceOver或Windows上的NVDA。Linux确实有Orca屏幕阅读器，但我认为测试它没有多大意义，因为它不能代表实际的屏幕阅读器使用情况。特别是考虑到屏幕阅读器可能会有错误或怪癖，我更喜欢测试真实的内容。因此，我随身带了一台Mac Mini和廉价的Windows台式机，就是出于这个原因。\n因此，简而言之，如果您是一名Web开发人员，使用Linux作为您的桌面环境是非常棒的。你可能不会错过太多，只要你重新连接你的大脑来正确使用键盘快捷键。\n我发现这些天我最怀念的是一些苹果最好的内置应用，比如Preview或Garage Band。我喜欢Preview，因为它可以快速截屏并在上面画箭头和方框(这是我经常做的事情)，而且我还没有在Linux上找到任何好的替代品。(我用的是Pinta，没问题。)。像ImageOptim这样的其他应用程序也没有Linux版本。\n因此，如果你依赖于一些仅在Mac上运行的应用程序，或者如果你需要一流的Safari和iOS调试，那么我不建议使用Linux而不是Mac。如果您的主要关注点是可访问性，那么它可能也不足以满足您的需求(尽管像Assistiv Labs这样的东西可能会改变这一点)。但就其他方面而言，这是一款非常适合网络开发的桌面操作系统。\n感谢Ben Frain询问我的Linux体验并启发了这篇博客文章。", "note_en": "I’ve been using Ubuntu as my primary home desktop OS for the past year and a half, so I thought it would be a good time to write up my experiences. Hopefully this will be interesting to other web developers who are currently using Mac or Windows and may be Linux-curious.\n  Note: in this post, I’m mostly going to be talking about Ubuntu. I’ve played with other Linux distros, but I stick with Ubuntu because if I have a problem, I can Google it and find an answer 99.9% of the time.\n  I first switched to Linux in 2007, when I was at university. At the time I perceived it to be a huge step-up over Windows Vista (so much faster! and better for programmers!), but it also came with plenty of headaches:\n WiFi didn’t work out of the box. I had to use  ndiswrapper to wrap Windows drivers.\n Multi-monitor and presentations were terrible. Every time I used  xrandr I knew I would suffer.\n Poor support for a lot of consumer applications. I recall running Netflix on Firefox in Wine because this was the only way to get it to work.\n Around 2012 I switched to Mac – mostly because I noticed that every web developer giving a conference talk was using one. Then I became a dual Windows/Mac user when I joined Microsoft in 2016, and I didn’t consider Linux again until after I left Microsoft in 2018.\n I’m happy to say that none of my old Linux headaches exist anymore in 2020. On my Dell XPS 13 (which comes with  Ubuntu preinstalled), WiFi and multi-monitor work out-of-the-box. And since it seems everything is either an Electron app or a website these days, it’s rare to find a consumer app that doesn’t support Linux. (At least, the ones I care about; I’m sure you can find a counter-example!) The biggest gripe I have nowadays is with  fonts, which is a far cry from fiddling with WiFi drivers.\n OK so enough history, let’s talk about the good and the bad about Linux in 2020, from a web developer’s perspective.\n  I tend to live and breathe on the command line, and for me the command line on Linux is second-to-none.\n The main reason should be clear: if you’re writing code that’s going to run on a server somewhere, that server is probably going to run Linux. Even if you’re not doing much sysadmin stuff, you’re probably using Linux to run your test and CI infrastructure. So eventually your code is going to have to run on Linux.\n Using Linux as your desktop machine just makes things that much simpler. All my servers run Ubuntu, as do my Travis CI tests, as does my desktop. I know that my shell scripts will run exactly the same on all these environments. If you’ve ever run into headaches with subtle differences between the Mac and Linux shell (e.g. incompatible versions of  grep,  tar, and  sed with slightly different flags, so you have to   brew install coreutils and use  ggrep and  gtar… ugh), then you know what I’m talking about.\n If you’re a Mac user, the hardest part about switching to the Linux terminal is probably just going to be the iTerm keyboard shortcuts you’ve memorized to open tabs and panes. I found the simplest solution was to use  tmux instead. As an added bonus, tmux also runs on Mac, so if you learn the keyboard shortcuts once, you can use them everywhere. I set my terminal to automatically open tmux on startup.\n  Since the command line is the main selling point of Linux (IMO), it’s tempting to just use Windows with the  Windows Subsystem for Linux instead. This is definitely a viable option, and totally reasonable, especially if there’s that one Windows program you really need (or you’re a PC gamer). For me, though, I don’t do much PC gaming, and my experience with WSL is that although compatibility was excellent, the performance was poor.  npm install would take orders of magnitude more time on WSL compared to the equivalent Mac or Linux machine. (Keep in mind I was using WSL back in 2016-2018 though, and I’m told  it’s improved since then.)\n Still, for me, I just don’t find Windows to my taste. The UI has always  felt slow and clunky to me, which may just be my perception, although when I read blog posts like  this one from Bruce Dawson I feel a bit vindicated. (Right-clicking taskbar icons  is slow! Why?) In any case, Ubuntu starts up fast, the system updates are quick and unobtrusive, and it’s not missing any must-have apps for me. So I run 100% Ubuntu, no dual-boot even.\n  For the average web developer, most of the stuff you need is going to work just fine on Linux. You can run Chrome and VS Code (or WebStorm, my preference), and all your command-line utilities like  node and  npm will work the same. You can use   nvm to manage Node versions. So far, so good.\n As a web developer, the biggest issue I’ve run into is not having a quick way to test all three major browser engines – Blink (Chrome), Gecko (Firefox), and WebKit (Safari). Especially now that Edge has gone Chromium and the Trident/EdgeHTML lineage is slowly dying out, it’s really attractive that, with a Mac, you can test all three major browser engines without having to switch to another machine or use a tool like  BrowserStack.\n On Linux of course we have Chrome and Firefox, and those run mostly the same as they do on a Mac, so they fit the bill just fine. For WebKit we even have  GNOME Web (aka Epiphany Browser), but I only consider it “okay” as a stand-in for Safari. It doesn’t support some of the Safari-specific APIs (e.g.  backdrop filter, Apple Pay, etc.), and it’s terribly slow, but it’s good for a quick gut-check to see if some bit of code will run well on Safari or not.\n  Unfortunately for me, I don’t consider that “good enough,” especially since the vast majority of Safari users are on iOS, so that’s the platform you really want to test. And here is where Linux runs into its biggest drawback from a web developer’s perspective: debugging iOS Safari.\n If you want to debug Chrome or Firefox on Android – no problem.  adb runs just fine on Linux, you can run  chrome:inspect on Chrome or Remote Debugging on Firefox, and it all works great. For iOS Safari, though, the best option you have is  remotedebug-ios-webkit-adapter, which uses  ios-webkit-debug-proxy under the hood.\n Essentially this is an elaborate suite of tools that makes iOS Safari kinda-sorta look like Chrome, so that you can use the Chrome DevTools to debug it. The most amazing thing about it is… it actually works! As long as you can get  the odd dependencies running correctly, you’ll have your familiar Chrome DevTools attached to an iOS device.\n  If you have a spare iPhone or iPod Touch laying around, this is not a bad option. But it’s still a far cry from the streamlined experience on a Mac, where you can quickly run an iOS Simulator with any iOS version of your choice, and where Safari debugging works out-of-the-box.\n For accessibility testing, it’s a similar story. Of course Firefox and Chrome have accessibility tools, but they’re no substitute for VoiceOver on Mac or NVDA on Windows. Linux does have the  Orca screen reader, but I don’t see much point in testing it, since it’s not representative of  actual screen reader usage. Especially given that screen readers may have bugs or quirks, I prefer testing the real deal. So I keep a Mac Mini and cheap Windows desktop around for this reason.\n  So in short, using Linux as your desktop environment if you’re a web developer is pretty great. You probably won’t miss much, as soon as you rewire your brain to get the keyboard shortcuts right.\n I find that the main things I miss these days are some of Apple’s best built-in apps, such as Preview or Garage Band. I love Preview for taking a quick screenshot and drawing arrows and boxes on it (something I do surprisingly often), and I haven’t found any good substitutes on Linux. (I use  Pinta, which is okay.) Other apps like  ImageOptim also have no Linux version.\n So if you depend on some Mac-only apps, or if you need best-in-class Safari and iOS debugging, then I wouldn’t recommend Linux over Mac. If your main focus is accessibility, it also might not be sufficient for you (although something like  Assistiv Labs may change this calculus). But for everything else, it’s a great desktop OS for web development.\n Thanks to Ben Frain for asking about my Linux experiences and inspiring this blog post.", "posttime": "2020-05-11 01:57:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,开发,开发人员,desktop", "title": "作为Web开发人员的桌面上的Linux", "title_en": "Linux on the Desktop as a Web Developer", "transed": 1, "url": "https://nolanlawson.com/2020/05/10/linux-on-the-desktop-as-a-web-developer/", "via": "", "real_tags": ["linux", "开发", "开发人员", "desktop"]}, {"category": "", "categoryclass": "", "imagename": "6200a4254cf7f41550ddb0760f041129.jpg", "infoid": 1001553, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正如你可能已经注意到的那样，我已经更新了网站(从opensourceWeekly.org更新到fealtropy.com)，因为维护2个网站对我来说是一个太大的负担。如果您使用的是rss阅读器，请将您的提要更新为：https://fatalentropy.com/feed.xml，否则“开放源码周刊”将照旧继续，如果没有更好的质量：)。\n什么是FEDISTIZE？FEDISTY(“联邦”和“宇宙”的合成词)是一个以发布和内容共享为主要目的的平台网络。\n想象一下，在你的Twitter应用程序中直接关注你最喜欢的YouTube和播客。这是FEDISTIC允许的众多事情之一。\n它主要围绕ActivityPub展开，该协议使许多不同的社交网络能够进行通信。\n根据这一点，FeDISTIC是分散的，而Twitter是集中式的，SSB是分布式的。\n但是为什么呢？这个想法是把对社交数据的控制权还给人们。当你在推特或Instagram上发帖时，内容就会被囚禁在他们的平台上，那就是著名的“有围墙的花园”。然后，您的内容只能根据看门人的善意才能访问。它尊重他们的政策吗？这对他们的广告商有好处吗？例如，Instagram最近推动了一项改变，禁止没有账户的人查看这些帖子(我们的照片！)。谁知道当这个把戏不足以增加他们的“用户参与度”指标时，未来会发生什么呢？\n我真正欣赏的是这里的平静。这个界面不是为上瘾而设计的，订阅源不是按算法分类的，人们不会哭喊着要人关注。这就是我在与人类互动时所期望的。\nPixelFed(AGPL 3.0)是一个由ActivityPub联合会支持的免费且符合道德的照片分享平台。想想2月多元化的Instagram吧。\nFunkwhale(AGPL 3.0)Funkwhale是一个社区驱动的项目，它允许您在一个分散的、开放的网络中收听和共享音乐和音频。想一想二月份的SoundCloud吧。\nWriteFreely(AGPL 3.0)WriteFreely是一款免费的开源软件，用于在网络上构建写作空间--无论是出版物、内部博客，还是多元化的写作社区。在纷繁多样的世界里想一想媒介。\nFedilab(GPL 3.0)Fedilab允许您从一个应用程序与多个不同平台进行交互。想象一下，您来自所有不同社交网络的所有订阅源加在一起。\nWordPress-activitypub(MIT)为您的博客实现ActivityPub协议的插件。您的读者将能够在Mastodon和其他支持ActivityPub的联合平台上关注您的博客帖子。一个插件就足够了，为什么还要从头开始重建一切呢？\nMastoHost(免责声明：我不是为了写这篇文章而付费的，我只是一个非常高兴的客户)。\n例如，您是否希望拥有自己的乳齿象，例如使用自己的虚荣域并在网络上显示为john@smith.com，或者为您的公司拥有自己的内部和私人社交网络？我不能推荐足够多的masto.host，这是一家Mastodon托管服务公司，由一个非常有能力的人运营。客户支持太棒了！\nMakAir(公共领域)可批量生产的开源冠状病毒ARDS呼吸机。旨在帮助医院应对疫情爆发期间可能出现的专业呼吸机短缺问题。这是一项由法国企业家、医生、大学、工程师和公司发起的倡议。他们的目标是制造一种开源的、可重复使用的、符合监管规定的呼吸机，生产成本低于500欧元。\n联邦谬误根据数据，只有3个实例涵盖了50.8%的用户。所以在现实中，分散的系统是集中的。\n我认为作者没有抓住要点：权力下放是关于选择的。选择托管您自己的数据或委托给受信任的一方，而不必遵循单一公司、单一文化和单一管辖范围内的规则(拜物教)。\nActivityPub，联邦快递的秘密武器，协议如何实现平台间的合作并赋予用户权力的方式多种多样。\nPleroma Plemora中的SSH支持是另一个著名的多样化服务器。他们不满足于提供Web接口，还提供SSH接口。这是云流时代的CLI。\n联邦社交网络简介在线社交网络变得更安全、更灵活和更具创新性的最佳方式是将能力和权威分配给世界各地的用户和开发人员，他们的各种需求和想象力所能做的远远超过任何一家公司所能做到的。\nPARTY网站以一种非常用户友好的方式重新组合关于FEDISTIC的数据和信息。\n乳齿象和联邦系统中滥用的挑战去中心化系统的目标之一是防止审查制度。这也是一个陷阱。\n生态系统正在感动另一位联合模型的批评者，这位令人敬畏的信号应用程序的创建者。TL；DR：由于其固有的分布式特性，联邦网络的发展速度太慢，无法适应快速发展的趋势。", "note_en": "As you may have noticed I have updated the website (from  opensourceweekly.org to  fatalentropy.com) because it was too much of a burden for me to maintain 2 websites.  If you use an RSS reader, please update your feed to:  https://fatalentropy.com/feed.xml  Otherwise Open Source Weekly will continue as before, if not with better quality :)\n   What is the Fediverse?  The Fediverse (a portmanteau of “federation” and “universe”) is a network of platforms whose principal purpose is publishing and content sharing.\n Imagine following your favorite youtubers and podcasters directly within your Twitter app. This is one of the many things permitted by the fediverse.\n It mainly revolves around  ActivityPub, the protocol that enables the many different social networks to communicate.\n  According to this, the Fediverse is decentralized, while Twitter is centralized and  SSB is distributed\n But why?  The idea is to give back to people the control of their social data. When you post on Twitter or Instagram, the content is imprisoned on their platform, the famous “walled gardens”. Your content then becomes accessible only depending on the goodwill of the gatekeepers. Does it respect their policies? Is it good for their advertisers? For example, Instagram recently pushed a change that forbade people without an account to see the posts ( our photos!). Who knows what the future holds when this trick won’t be enough to increase their “user engagement” metrics?\n What I really appreciate on the Fediverse is the calm. The interface is not designed for addiction,the feed is not algorithmically sorted, the people are not crying for attention. This is what I expect wheninteracting with humans.\n     Pixelfed (AGPL 3.0)  A free and ethical photo sharing platform, powered by ActivityPub federation.  Think instagram in the Fediverse.\n Funkwhale (AGPL 3.0)  Funkwhale is a community-driven project that lets you listen and share music and audio within a decentralized, open network.  Think SoundCloud in the Fediverse.\n  WriteFreely (AGPL 3.0)  WriteFreely is free and open source software for building a writing space on the web — whether a publication, internal blog, or writing community in the fediverse.  Think Medium in the fediverse.\n Fedilab (GPL 3.0) Fedilab allows you to interact with multiple Fediverse platform from only one app. Imagine all your feeds from all your different social networks combined.\n Wordpress-activitypub (MIT)  A plugin which implements the ActivityPub protocol for your blog. Your readers will be able to follow your blogposts on Mastodon and other federated platforms that support ActivityPub.  Why rebuilding everything from scratch when just a plugin suffices?\n      MastoHost  (disclaimer: I’m not paid to write this, I was just an extremely happy customer)\n Do you want to have your own mastodon instance, for example to use your own vanity domain and appear as  john@smith.com on the network, or to have your own internal and private social network for your company?  I can’t recommend enough  masto.host, a Mastodon hosting service, run by a single, very competent, person. The customer support is awesome!\n   MakAir (Public domain)  Mass-producible open-source Covid-19 ARDS ventilator. Aims at helping hospitals cope with a possible shortage of professional ventilators during the outbreak.  An initiative by french entrepreneurs, doctors, universities, engineers and companies. Their goal is to make an open source, reproductible, regulatory compliant ventilator costing less than 500€ to produce.\n    The Federation Fallacy According to the data, only 3 instances encompass 50.8% of users. So in reality, decentralized systems are centralized.\n I think the author misses the point: decentralization is about choice. Choice to host your own data or delegate to a trusted party, not to have to follow the rules of a single company, with a single culture and within a single jurisdiction (feodalism).\n ActivityPub, the secret weapon of the Fediverse How a protocol enables cooperation between platforms and empowers users.\n SSH Support in Pleroma Plemora is another famous Fediverse server. Not satisfied with providing a web interface, they also provide an SSH interface. This is CLI in the cloud streaming era.\n An Introduction to the Federated Social Network  The best way for online social networking to become safer, more flexible, and more innovative is to distribute the ability and authority to the world’s users and developers, whose various needs and imaginations can do far more than what any single company could achieve.\n Fediverse.party A website regrouping data and information about the Fediverse in a very user friendly way.\n Mastodon and the challenges of abuse in a federated system One of the goals of decentralized systems is to prevent censorship. It’s also a pitfall.\n The ecosystem is moving Another critic of the federated model by the creator of the awesome  Signal app.  TL;DR: due to their intrinsic distributed nature, federated networks are too slow to evolve and adapt to the fast moving trends.", "posttime": "2020-05-11 01:57:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "社交,social,网络", "title": "OpenSourceWeekly#10：联合社交网络(The FeDISTICATION)", "title_en": "OpenSourceWeekly #10: Federated social networks (The Fediverse)", "transed": 1, "url": "https://fatalentropy.com/open-source-weekly/10", "via": "", "real_tags": ["社交", "social", "网络"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001552, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着Ubuntu Studio20.04LTS的发布，我们透露这将是我们使用Xfce桌面的最后一个版本，我们将从20.10开始迁移到KDE等离子桌面。有趣的是，这条消息花了近两周才引起人们的注意。当它发生的时候，它受到了巨大的打击。\n在发布公告中，我们谈到了做出决定的原因。其中之一是资源使用具有可比性。在使用Xfce重新启动20.04LTS Live Image时，Ubuntu Studio使用了大约620MB的RAM。在使用KDE等离子体重新启动20.10Daily Live Image时，Ubuntu Studio使用了大约670MB的RAM。这个~50MB的差异是极其微不足道的，特别是当您运行的计算机具有更高的RAM可用性时更是如此。作为参考，Ubuntu Studio是为功能更强大的计算机创建的，不是为了在低功耗或更老的硬件上运行，也不是为了给旧计算机带来新的生命。因此，从我们的角度来看，两个桌面之间的RAM使用率几乎相同。\n目前，过渡已接近完成，主题选择方面的一些小事仍在进行中。我们停留在相同的主题(Materia，这一个是KDE端口)和相同的图标(Papirus)。\n要做到这一点，还有一些事情需要改进，其中包括安装程序。Qt版本的Ubuntu ubiquity安装程序(安装操作系统的安装程序，不要与Ubuntu Studio安装程序混淆)目前是硬编码的，以显示Kubuntu品牌。要么此问题将被修复，要么我们将移至新的安装程序。正如发布声明中所说，我们将在这次过渡中与Kubuntu团队进行协调，因为这样的情况是可以预料到的。\n我们真的希望这个“新的”Ubuntu Studio会是一次愉快的体验。", "note_en": "With our release announcement for  Ubuntu Studio 20.04 LTS, we revealed that it would be our last version with the Xfce desktop, and that we would be moving to the KDE Plasma desktop starting with 20.10. Interestingly enough, that news took nearly two weeks to get noticed. When it did, it hit big.\n  In the release announcement, we talked about the reason for our decision. One of those was resource usage being comparable. On a fresh boot of the 20.04 LTS Live Image with Xfce, Ubuntu Studio was using approximately 620MB of RAM. On a fresh boot of the 20.10 Daily Live Image with KDE Plasma, Ubuntu Studio was using approximately 670MB of RAM. That ~50MB difference is extremely negligible, especially if you are running a machine with higher RAM availability. For reference, Ubuntu Studio is created for more powerful computers, is not meant to run on low-powered or older hardware, and is not meant to give an old computer new life. For that reason, from our perspective, the RAM usage between the two desktops is nearly the same.\n Right now, the transition is nearly complete, with a few minor things regarding theme selection still in progress. We are staying with the same theme (Materia, this one being the KDE port), and the same icons (Papirus).\n    Among some of the things still needed to be worked-on to get this right include the installer. The Qt version of the Ubuntu Ubiquity installer (the one that installs the operating system, not to be confused with  Ubuntu Studio Installer) is currently hard-coded to show Kubuntu branding. Either this will be fixed or we will be moving to a new installer. As said in the release announcement, we will be coordinating with the Kubuntu team on this transition as situations like this were anticipated.\n We do hope that this “new” Ubuntu Studio will be an enjoyable experience.", "posttime": "2020-05-11 01:56:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ubuntu,studio", "title": "Ubuntu Studio：切换到KDE血浆的进展", "title_en": "Ubuntu Studio: Progress on Switch to KDE Plasma", "transed": 1, "url": "https://ubuntustudio.org/2020/05/progress-on-plasma/", "via": "", "real_tags": ["ubuntu", "studio"]}, {"category": "", "categoryclass": "", "imagename": "338c773fb915ff12458dcd03bfb85d60.jpeg", "infoid": 1001550, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“超越沃尔芬斯坦城堡”是缪斯软件公司1984年推出的一款电脑游戏。它是创新和成功的沃尔芬斯坦城堡的续集，一个原型…", "note_en": "Beyond Castle Wolfenstein is a 1984 computer game by Muse Software. It is the sequel to the innovative and successful Castle Wolfenstein, a prototypical...", "posttime": "2020-05-11 01:56:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,沃尔芬,wolfenstein,城堡", "title": "超越沃尔芬斯坦城堡(源代码)，西拉斯·华纳(Silas Warner)", "title_en": "Beyond Castle Wolfenstein (Source Code) by Silas Warner", "transed": 1, "url": "https://archive.org/details/BeyondCastleWolfenstein_source", "via": "", "real_tags": ["代码", "沃尔芬", "城堡"]}, {"category": "", "categoryclass": "", "imagename": "8fc370b2add560ff9ddc4ce7dc2f45f2.jpg", "infoid": 1001549, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "高可用性、弹性和可扩展性已经成为构建面向用户的应用程序的标准。云计算一直是促成这一点的一个因素。\n以前，拥有多个数据中心是一项主要的前期资本投资-无论是在技术方面还是在硬件方面。今天，多亏了云计算，制定灾难恢复计划需要的工作量更少，而且不需要前期投资。因此，许多面向消费者的应用程序现在都是以地理上分散的方式设置的。在发生重大故障的情况下，用户不受影响，并且减少了全球用户的延迟。\nMotors垂直团队是易趣分类广告集团(ECG)的一部分。作为一家全球性组织，我们在地理上分散的多地区(多数据中心)设置中运行我们的软件。我们会时不时地进行故障转移操作，关闭整个区域，以验证系统对停机的响应情况。我们还具有自动故障转移功能，因此如果服务在一个区域出现问题，我们可以将所有流量转移到另一个区域。我们使用的许多技术使我们能够非常高效、轻松地在多区域设置中运行应用程序，而一小部分技术使我们很难做到这一点。\n我们基础架构中最关键的组件之一是Apache Kafka®。-但是，尽管它在我们的架构中很重要，但运行多群集主动/主动的Kafka设置并不是那么容易。\n虽然最近发布的Kafka 2.4版本大大提升了对多个Kafka集群与MirrorMaker 2.0的支持，但还是可能会让你头疼不已，这取决于你的使用案例。\n在本文中，我将概述一个需要有序事件的技术场景，强调几个挑战，并提供运行多区域Kafka设置的可能解决方案。\n在Motors Vertical(Move)，我们处理产品列表。列表(或“广告”)是一种非个人的促销或销售产品的信息，由想要销售单一商品的个人或以更高数量销售的专业组织发布。列表是大多数分类广告的核心数据结构，我们系统中的所有内容都依赖于它们。\n根据列表是否已创建、更新、删除等，该列表会变得更长。因此，列表所处的每个状态都可能触发不同的操作。\n列表服务有其数据存储，该数据存储存储列表并充当该域的真实源。一旦客户发布了列表，它就会存储在NoSQL数据存储中，并发布给Kafka经纪人。有一组客户端使用这些消息并采取适当的操作。\n如果我们在单个区域运行我们的系统，上面的设置就可以了。如果我们在多个地区运行我们的软件，我们可能会将我们在一个地区运行的所有软件复制到另一个地区，所以如果地区1出现故障，地区2可能会接管。\n这样的设置可以让iOS、Android、Web和API客户端连接到多个地域。根据负载均衡规则将流量路由到不同区域。为简单起见，我们假设这里使用的是最小轮询和负载均衡方法。因此，同一客户端的请求将由多个区域处理。\n在Region-1(区域1)中接收的任何事件都在Region-1(区域-1)中处理。这种方法的问题在于，有些服务需要完整的数据集才能正常运行。例如，要使搜索API提供正确的结果，它必须为所有清单编制索引。搜索索引不是共享的，因此每个区域都必须拥有自己的搜索索引。所有数据都必须可用，才能在两个地区提供相同的结果。\n因为我们依赖于所有的Kafka流，所以对于一些Join操作，我们需要整个数据集。否则，联接将不会发生，并且生成的数据将具有误导性。\n1.取消至少需要从所在区域消费一次数据的服务。\n1.确保事件发生在由本地服务中心处理的区域内(由上面的设计完成)。\n在我们继续之前，值得注意的是，Kafka集群为您提供了以下保证：\n生产者发送到特定主题分区的消息将按照发送的顺序附加。也就是说，如果记录M1与记录M2由同一生产者发送，并且M1首先被发送，则M1将具有比M2更小的偏移量，并且在日志中出现得更早。(见“卡夫卡担保”)。\n值得强调的是，此保证是针对单个群集的，而不是针对多群集设置的。记住这一点很重要，稍后我们将回到这一点，…。\n因此，考虑到我们的使用案例和技术挑战，我们想要回答的问题是：\n当事件排序是必备功能时，如何在多区域设置中运行多集群Kafka？\n虽然运行主动/主动的Kafka集群是可能的，但对于有序的事件来说，这是非常有问题的。在内部，我们在Move这里有我们自己的定制Kafka-Mirror-Service，这是因为MirrorMaker 1.0不能满足我们的需求而产生的。但在本文中，我将重点介绍MirrorMaker 2.0的功能。\n使用MirrorMaker 2.0，可以在集群之间镜像主题。MirrorMaker自己处理主题创建和同步，这非常非常方便。例如，如果“Region-1”和“Region-2”中存在一个名为Listing的主题，MirrorMaker会在这两个Kafka集群上创建新主题，并以定义的名称为前缀：\n现在，来自Region-1的所有列出的项目都将镜像到Region-2，反之亦然。这解决了访问完整数据集的问题，因为需要访问完整数据集的服务现在可以在主题名称中使用正则表达式来消费多个主题，如返回整个数据集的.*\\.listings。\n这看起来像是一个解决方案。我们可以满足这两组服务，包括1)至少消费本地区域内的事件一次，以及2)跨区域消费所有数据。\n我们确实有一些事件顺序无关紧要的用例，这个解决方案可以很好地解决这一问题。但是清单场景要求以正确的顺序使用事件。此外，我们对列表主题使用主题压缩，所以这个解决方案变得相当有问题。\n例如，假设列表客户端正在启动对列表的更新，其中每次更新都与前一次不同，并且包含比以前更多的数据，例如：\n#1代表列表ID，我们将使用它作为Kafka消息键，而有效负载是事件的更新版本。事件由不同的区域处理：v1、v3在区域-1中结束，而v2和v4在区域-2中结束。\n图7-在不同地区使用相同密钥的消息的不同版本。\n我们确实使用日志压缩，因此假设主题变得足够脏，可以在一段时间后进行日志压缩，那么一旦发生日志压缩，系统状态将如下所示：\n图8-日志压缩后，不同区域中具有相同键的消息的不同版本。\n现在Kafka客户端将读取这些主题中的数据，但是Kafka客户端无法保证不同主题之间的排序。\n因此，虽然这种方法很棒，但它解决了无序事件的问题，而不是有序事件。\n当您开始使用逻辑删除时，此设置会出现问题。让我们假设地域2的用户获得了删除请求事件，并且服务请求被路由到本地的Kafka集群。复制事件时，我们在两个区域仍有旧版本(甚至不是最新版本)的副本，如下所示：\n图9-Tombstone事件之后，不同区域中具有相同密钥的消息的不同版本。\n虽然MirrorMaker 2.0完成了繁重的任务，但它不能解决此场景中的有序事件问题。\n这种设置相对简单--事件的顺序很重要的主题被写入单个Kafka集群，而不管它们是在哪个地区产生的。数据将通过MirrorMaker 2.0复制到不同地区的其他群集。它将如下所示：\n不同地区的服务将通过.*\\.Listings消费多个主题，但由于生产者将只连接到一个地区，因此数据在单一地区排序。如果一个Kafka集群出现故障，这很方便-生产者只需要更换代理，消费者不需要做任何事情。\n这会强制对两个区域中的所有事件进行排序，因为事件被写入单个Kafka集群，并且只复制数据。现在所有事件都已排序，但我们还有另外两个问题需要解决：\n1、数据丢失，一些应用程序现在不必要地消费和处理数据。例如，对于WebHook，我们至少消费同一事件两次。至少一次很棒，但至少两次会带来财务后果：我们依赖第三方服务和按呼叫付费的模式，而我们刚刚将这些服务的成本翻了一番。因此，当我们解决排序问题时，我们现在被迫至少处理两次事件。\n2.注意：在集群故障的情况下，存在两种不同场景下的潜在数据丢失。首先，发布消息的应用程序将无法与群集通信，这可能会导致数据丢失。其次，MirrorMaker 2.0数据复制是一个异步过程，因此当群集出现故障时，不能保证在群集出现故障之前所有数据都已复制。这让我们得出结论，从失败中恢复并不像看起来那么容易。\n在此场景中，延迟也是一个大问题。群集之间的数据复制是异步的，这意味着当数据写入区域1时，需要一些时间才能将其复制到区域2。\n因此，此解决方案会导致一个区域中立即可用的数据可能需要更长时间才能在第二个区域中可用的问题。\n这相对容易，解决了一系列问题，但有其他警告。在此解决方案中，生产者和消费者连接到相同的Kafka集群，如下图所示。\n在这种情况下，事件被排序，因为它们没有被写入到同一群集中，消费者可以访问完整的数据集，并且它们至少被使用一次。这相当容易。此方法的注意事项如下：\n整个Kafka集群不得不在空闲状态下等待，这浪费了资源。它仅在出现故障时使用。区域之间有持续的数据流，以防某一天发生故障。\n虽然处于活动状态的Kafka实例在同一地域的应用程序工作正常，但其他应用程序在读写时会受到延迟惩罚。根据区域之间的距离，此问题可能会变大，也可能会变小。\n卡夫卡中的每条记录都被分配了一个偏移量编号，用于标识主题分区中的记录。因此，当消费者导入记录时，Kafka会存储一组偏移量，以指示哪些消息已被消费。这很有帮助，因为下次同一消费者试图读取数据时，Kafka只能发送新记录。这就是所谓的消费者群体补偿。但是，即使通过MirrorMaker 2.0复制数据，主题的偏移量也不能保证相同，这意味着两个群集之间的消费者组偏移量可能不同-即使它们包含100%相同的数据。因此，不直接共享偏移。\n如果出现故障，所有服务现在都必须连接到Region-2的Kafka集群，问题是因为它们一直在消费Region-1的数据，偏移量是Region-1分配的。因此，服务必须从与实际偏移量相差甚远的偏移量开始读取消息。这意味着某些消息可能会被多次消费。\n但是，MirrorMaker 2.0会将使用者组偏移检查点从一个群集发送到另一个群集。MirrorMaker 2.0使用内部检查点主题来存储目标群集的源群集中每个使用者组的偏移量。此外，它使用一个独立的偏移同步主题来存储每个正在复制的主题分区的群集到群集的偏移映射。因此，尽管群集之间的偏移量不同，但MirrorMaker 2.0会跟踪最近的消费者组偏移量。\n此过程不是自动化的，因此服务仍必须负责在连接到不同群集时找到正确的偏移量，以防出现故障。MirrorMaker 2.0提供部分数据，因此服务可以在需要时执行此操作。为此，Kafka 2.4.0提供了RemoteClusterUtils，如KIP-382中所述：\n实用程序类RemoteClusterUtils将利用上述内部主题来帮助计算可达性、群集间延迟和偏移转换。不可能直接转换任何给定的偏移量，因为并非所有偏移量都会在检查点流中捕获。但对于给定的消费群体，将有可能找到消费者不能寻求()的高水位。这对于群集间消费者迁移、故障转移等非常有用。\n您有两个区域。地区-1(或整个地区-1)的一个卡夫卡集群失败。\n所有应用程序现在都必须连接到新群集。最有可能的情况是，服务在引导时加载集群配置，因此当配置更改时，您需要重新启动服务。\n服务必须具有适当的代码-它们必须知道Region-1群集出现故障，并且它们现在正在连接到Region-2群集，并且必须在RemoteClusterUtils的帮助下查找偏移量，以从新的Kafka群集获得适当的偏移量。\n服务应该只需要这样做一次-如果您重新部署服务，它不应该再次执行相同的操作。\n此规则适用于您的所有服务，因此它们都需要知道它们正在连接的区域以及在出现故障时将连接到的区域。这是一个有效的场景(假设您的集群不是每天都出现故障)，但是如果配置不正确，服务最终可能会重新读取队列开头的所有数据。\n我绝对可以看到群集之间同步偏移的用例，所以我相信RemoteClusterUtils对于集成场景和其他挑战将非常有用。但是使用它来处理集群故障需要大量的工作、编码和自动化，而且这样的工作的优点是值得怀疑的。\n这是一个相当昂贵的解决方案，是否真的值得这样做还值得商榷，但为了完整起见，我们将在这里概述它。这是解决方案1的扩展方案，其中消息被写入本地群集。每个本地群集都有一项利用所有Kafka流的服务。该服务的工作是对事件进行排序，并将其写入新主题。\n在此场景中，每个文档都有一个版本。每次更新时，此版本号都会增加。当文档发布到Kafka时，版本号作为Kafka消息头发送(参见KIP-82)。应用程序可以根据标题值对消息进行排序，并将其写入新主题。最初，消息将按下图所示进行分发：\n图13-在不同地区使用相同密钥的消息的不同版本。\n在服务处理和订购消息之后，最新版本将被写入一个名为Listing.ordered的主题。\n标记要删除的项目的墓碑事件也是版本化的，因此最新的消息将是墓碑。\n这乍看起来是个好主意，但来自不同地区的墓碑可能会带来问题。尽管生成的主题会有一段时间的墓碑消息，但最终这些墓碑消息将被删除。\n或者，将其作为一种清理方式删除。政策框架而不是契约框架将是一个合理的决定，因为它解决了墓碑信息问题-甚至可能是一个更好的解决方案。\n它会带来额外的延迟。在理想情况下，发布者发布数据，消费者使用数据。这是相对较快的。但是，将数据复制+数据处理附加到每条消息的管道会增加延迟。例如，MirrorMaker 2.0必须首先将数据复制到另一个区域(这是可以接受的延迟)。但是，Kafka Stream服务必须以正确的顺序消费和发布数据。Kafka Stream应用程序需要对Kafka Stream的工作原理进行一些微调和深入了解，例如数据存储以及如何最大限度地减少任务故障转移的延迟(参见备用副本)。\n在高吞吐量场景下，Kafka Stream需要大量资源才能运行，长期来看可能会比较昂贵。\n一个类似的解决方案可以使用消息时间戳和消息键来实现-但是时间是一个非常棘手的概念，所以我不推荐它(参见“现在没有时间”)。\n在多区域设置中运行Kafka以跨区域共享数据有多种可能性。然而，其中每一个都有应该承认的后果。使其启动和运行的工程工作、测试、基础设施成本、损失的时间等等。我不会争辩说这种努力是不必要的，但它应该经过深思熟虑。\n还可以在单个地区运行单个Kafka集群，并在两个地区之间共享数据。大多数云区域都有三个或更多可用区(AZ)。每个AZ都是隔离和物理隔离的，具有独立的电源和冷却，并通过冗余网络连接。对于某些业务使用情形，这可能是足够高的可用性和可接受的延迟。不过，对于我们的时延敏感型业务来说，多地域架构是更好的选择。\n鉴于此，值得一提的是，MirrorMaker 2.0做得不错。但还需要注意的是，复制是一个异步过程，这意味着如果源群集出现故障，仅靠MirrorMaker不能保证在目标群集中成功复制所有数据。\n卡夫卡是一款很棒的软件。它具有高性能、良好的抽象性、非常便宜(意味着普通硬件每秒可以执行数百万次读/写操作)，并为我们提供了极大的灵活性。卡夫卡的这些特点都是基于简单的设计选择。然而，这些设计选择在多区域主动/主动系统或主动/被动系统设计中并不起到很好的作用，原因非常简单：\n区域间存在明显的数据传输延迟。在区域故障中幸存下来的同时实现低延迟和强一致性并不是一个容易解决的挑战。", "note_en": "High availability, resilience and scalability have become the standard when building user-facing applications. Cloud computing has been a contributing factor to that.\n Previously, having multiple data-centers was a major up-front capital investment — both skill-wise and in terms of hardware. Today, having a disaster recovery plan requires less effort and no up-front investment, thanks to cloud computing. As a result, many consumer-facing applications are now set up in a geographically dispersed fashion. In case of major failure, users are not affected, and latency is reduced for users across the globe.\n The Motors Vertical team is part of the  eBay Classifieds Group (eCG). As a global organization, we run our software in multi-region (multi-datacenter) setup, where regions are geographically dispersed. From time to time, we do failover exercises where we take down a whole region to verify how systems respond to the outage. We also have automatic failover, so if services have problems in one region, we can divert all traffic to another region. Many of the technologies we use enable us to run applications in a multi-region setup very efficiently and easily, while a small set of technologies makes that difficult.\n One of the most critical components in our infrastructure is  Apache Kafka®. — But as important as it is in our architecture, it’s not yet that easy to run a multi-cluster active/active Kafka setup.\n Although the recent release of  Kafka 2.4 has greatly improved support for multiple Kafka clusters with  MirrorMaker 2.0, depending on your use cases it could still give you a headache.\n In this article, I will outline a technical scenario that requires ordered events, highlight several challenges, and present possible solutions for running a multi-region Kafka setup.\n  At Motors Vertical (MoVe), we deal with product listings. A listing (or “ad”) is a non-personal message to promote or sell a product, either by a private individual who wants to sell a single item, or a professional organization who sells at a higher quantity. Listings are the core data structures of most classified ads, and everything in our system depends on them.\n   This list gets longer, based on whether the listing has been created, updated, deleted, etc. So each state that the listing is in could trigger a different action.\n    The listing service has its data storage, which stores listings and serves as the source of truth for that domain. Once a client posts a listing, it is stored in NoSQL data storage, and published to the Kafka brokers. There are a set of clients which consume those messages and take appropriate actions.\n If we were running our system in a single region, the setup above would be fine. If we run our software in multiple regions, we might replicate all the software we run in one region to another, so if region-1 fails, region-2 could take over.\n    A setup like this allows iOS, Android, Web and API clients to connect to multiple regions. Traffic is routed to the different regions based on load balancing rules. For the sake of simplicity, let’s assume that we are using the  round-robin load-balancing method here. So requests will be handled by multiple regions for the same client.\n Any events received in region-1 are processed in region-1. The problem with this approach is that some of the services require a complete data set to function properly. For instance, for the search API to deliver correct results, it has to index all the listings. Search indexes are not shared, so each region has to hold its own search index. All the data must be available to deliver the same result on both regions.\n Since we rely on  Kafka Streams, for some join operations we require the whole data set. Otherwise joins would not take place, and the data that is produced would be misleading.\n  1.     Services that need to consume the data at least once from the region that they are in\n     1.     Make sure events take place in a region processed by local services (which is done by the design above)\n  Before we move on, it’s worth noting that a Kafka cluster gives you the following guarantee:\n Messages sent by a producer to a particular topic partition will be appended in the order they are sent. That is, if a record M1 is sent by the same producer as a record M2, and M1 is sent first, then M1 will have a lower offset than M2 and appear earlier in the log. (See  Kafka Guarantees)\n It’s worth emphasizing that this guarantee is for a single cluster —not for a multi-cluster setup. This is important to keep in mind, and we’ll come back to this point later…\n So with our use case and technical challenges in mind, the question we want to answer is:\n How to run multi-cluster Kafka in a multi-region setup, when event ordering is a must-have feature?\n  While it’s possible to run an active/active Kafka cluster, it’s very problematic with ordered events. Internally, here at MoVe we had our own custom kafka-mirror-service, which was born out of necessity because MirrorMaker 1.0 could not fulfill our needs. But in this article, I will focus on the capabilities of MirrorMaker 2.0.\n With MirrorMaker 2.0, topics can be mirrored between clusters. MirrorMaker handles the topic creation and synchronization on its own, which is very very handy. For instance, if a topic called listing exists in “region-1” and “region-2”, MirrorMaker creates new topics on both Kafka clusters, prefixed by the defined name:\n   Now all the listing items from region-1 will be mirrored to region-2 and vice-versa. This solves the problem of accessing complete data sets, as services that require it can now consume multiple topics with a regular expression in the topic name, like .*\\.listings , which returns the whole data set.\n    This looks like a solution. We can satisfy both groups of services, including those that 1) consume events in the local region at least once, and 2) consume all data across regions.\n We do have use cases where the order of events are irrelevant and this solution will work fine for that. But the listings scenario requires events to be consumed in the correct order. Additionally, we use topic compaction for the listing topic, so this solution becomes quite problematic.\n For instance, let’s assume that the listings client is initiating the update to a listing, where each update is different than the previous one and contains more data than before, such as:\n   #1 represents the listing ID, which we will use as a Kafka message key, while the payload is an updated version of the event. Events are processed by different regions: v1, v3 end up in region-1, whereas v2 and v4 end up in region-2.\n   Figure 7 – Different versions of a message with the same key in different regions\n We do use log compaction, so assuming topics get dirty enough to be eligible for log-compaction after a while, once log compaction takes place, the system state looks something like this:\n  Figure 8 – Different versions of a message with the same key in different regions, after log compaction\n Now Kafka clients will read the data from those topics, but Kafka clients cannot give you the guaranteed ordering between different topics.\n So although this approach is great, it solves the problem of unordered events, but not ordered events.\n This setup gets problematic when you start using tombstones. Let’s assume that region-2 gets the delete event, and the service request is routed to a local Kafka cluster. When events are replicated, we still have the copy of the old version (not even the latest) in both regions, like this:\n  Figure 9 – Different versions of a message with the same key in different regions, after tombstone event\n While MirrorMaker 2.0 does the heavy lifting, it does not solve the ordered event problem in this scenario.\n  This setup is relatively simple — topics where the order of the events matters are written to a single Kafka cluster, regardless of the region in which they are produced. Data will be replicated via MirrorMaker 2.0 to other clusters in different regions. It will look as follows:\n   Services in different regions will consume multiple topics via .*\\.listings, but as a producer will connect to only one region, data is ordered in a single region. This is convenient if one Kafka cluster fails — the producer only has to change the broker and consumers do not need to do anything.\n This forces all events to be ordered, in both regions as events are written to a single Kafka cluster and data is only replicated. Now all the events are ordered, but we have two other problems that we need to solve:\n 1.     Some applications now consume and process the data unnecessarily. For instance, for webhooks, we consume the same event at least twice. At least once is great, but at least twice has financial consequences: we rely on third-party services and cost-per-call models, and we just doubled the cost of those services. So while we solve the ordering, we are now forced to process events at least twice.\n 2.     In the case of cluster failure, there is a potential data loss in two separate scenarios. First, applications that are publishing messages will not be able to communicate with the cluster, which could lead to data loss. Second, MirrorMaker 2.0 data replication is an asynchronous process, so when a cluster fails, there is no guarantee all data has been replicated before the cluster failed. Which brings us to the conclusion that recovering from failure is not easy as it seems.\n Latency is also a big issue in this scenario. Data replication between clusters is asynchronous, which means when data is written to region-1 it will take some time to replicate this to region-2.\n   So this solution causes the problem that data that is immediately available in one region can take longer to be available in the second region.\n  This is relatively easy, and solves a bunch of problems, but has other caveats. In this solution producers &amp; consumers connect to the same Kafka cluster, as shown in the following diagram.\n   In this case, events are ordered as they are not being written to the same cluster, consumers have access to the full set of data, and they are consumed at least once. This rather easy. The caveats of this approach are:\n  The whole Kafka cluster has to wait in an idle state, which wastes resources. It is used only in case of failure. There is a continuous data flow between regions, just in case something fails one day.\n  While applications in the same region with the active Kafka instance work fine, others are punished with latency penalties while reading and writing. This problem can get bigger or smaller based on the distance between regions.\n  Each record in Kafka is assigned an offset number, which is used to identify the record in a partition of the topic. So when consumers import records, Kafka stores a set of offsets that indicates which messages have been consumed. This helps, as the next time the same consumer tries to read the data, Kafka can send only new records. This is called consumer-group offsets. However, offsets of a topic are not guaranteed to be the same, even if data is replicated via MirrorMaker 2.0, which means the consumer-group offset may not be the same between two clusters — even if they hold 100% identical data. For this reason, offsets are not shared directly.\n In case of failure, all the services now have to connect to the Kafka cluster in region-2. The problem is because they’ve been consuming data from region-1, the offsets are those assigned by region-1. So services have to start to read messages from an offset that is nowhere near the real offset. This means some messages may be consumed more than once.\n However, MirrorMaker 2.0 emits consumer-group offset checkpoints from one cluster to another. MirrorMaker 2.0 uses an internal checkpoints topic to store offsets for each consumer-group in the source cluster for the destination cluster. Furthermore, it uses an offset-sync topic to store cluster-to-cluster offset mappings for each topic-partition being replicated. So although offsets are not the same between clusters, MirrorMaker 2.0 tracks the nearest consumer-group offset.\n This process is not automated, so services still have to take the responsibility to find the right offset when connecting to a different cluster in case of failure. MirrorMaker 2.0 provides partial data, so services can do that if they need to. For this purpose, Kafka 2.4.0 offers RemoteClusterUtils, described in  KIP-382:\n A utility class RemoteClusterUtils will leverage the internal topics described above to assist in computing reachability, inter-cluster lag, and offset translation. It won’t be possible to directly translate any given offset, since not all offsets will be captured in the checkpoint stream. But for a given consumer group, it will be possible to find high water marks that consumers can seek() to. This is useful for inter-cluster consumer migration, failover, etc.\n  You have two regions. A Kafka cluster in region-1 (or the entire region-1) has failed.\n All the applications now have to connect to a new cluster. Most likely services load the cluster configuration on bootstrap, so when the configuration changes, you need to restart services.\n Services have to have the appropriate code — they have to be aware that region-1 has failed, and that they are now connecting to region-2 and have to look up the offset with the help of RemoteClusterUtils to get the appropriate offset from the new Kafka cluster.\n Services should only have to do that once — if you re-deploy a service, it should not perform the same operation again.\n This rule applies to all of your services — so they all need to be aware of the regions they were connecting to and the regions to which they will connect in case of failure. This is a valid scenario (assuming your cluster doesn’t fail every day), but if not configured properly, services may end up re-reading all the data from the beginning of the queue.\n I can definitely see use cases for syncing offsets between clusters, so I believe RemoteClusterUtils will be very useful for integration scenarios and other challenges. But using it for cluster failures requires a lot of effort, coding and automation, and the merits of such an effort are questionable.\n  This is a rather expensive solution, and debatable whether it’s really worth it, but for the sake of completeness, we’ll outline it here. This is an extended scenario of Solution 1, in which messages are written to the local cluster. Each local cluster has a service which leverages  Kafka Streams. The job of this service is to order the events and write them to a new topic.\n  In this scenario, each document has a version. Every time there is an update, this version number is increased. When the document is published to Kafka, the version number is sent as a Kafka message header (see  KIP-82). The application can sort the messages based on header value, and write them into a new topic. Initially, messages will be distributed as in the following diagram:\n  Figure 13 – Different versions of a message with the same key in different regions\n After a service processes and orders the messages, the latest version will be written to a topic called listing.ordered.\n    Tombstone events that mark items for deletion are also versioned, so the latest message will be the tombstone.\n This looks like a good idea at first, but tombstones from different regions may cause problems. Although the resulting topic will have a tombstone message for a while, eventually those tombstone messages will be removed.\n Alternatively, delete as a cleanup.policy instead of compact would be a reasonable decision, as it solves the tombstone message issue — and it might even be a better solution.\n  It introduces additional latency. In an ideal scenario, the publisher publishes the data and consumer consumes it. This is relatively fast. However, appending data replication + data processing to a pipeline for every message increases latency. For instance, MirrorMaker 2.0 has to replicate the data to another region first (this is an acceptable lag). But then the Kafka Stream service has to consume and publish the data in the correct order. The Kafka Stream application requires some fine-tuning and a good understanding of how Kafka Stream works, such as data storage and how to minimize the latency of task failover (see  Standby-Replicas).\n In high throughput scenarios, Kafka Stream requires a good deal of resources to run, which may be expensive in the long run.\n A similar solution could be implemented using message timestamps as well as message keys — but time is a very tricky concept, so I wouldn’t recommend it (see  There is No Now).\n  There are several possibilities to run Kafka in a multi-region setup to share data across regions. Each of those, however, has consequences which should be acknowledged. The engineering effort to get it up and running, testing, cost of infrastructure, time that is lost, and so on. I wouldn’t argue that the effort is unnecessary, but it should be well thought out.\n It is also possible to run a single Kafka cluster in a single region and share data between two regions. Most cloud regions have three or more Availability Zones (AZ). Each AZ is isolated and physically separated, with independent power, cooling, and connected via redundant networks. For some business use cases, this could be enough high availability, and acceptable latency. However, for our latency-sensitive business, multi-region architecture is a better choice.\n Given all that, it is worth mentioning that MirrorMaker 2.0 does a decent job. But it should also be noted that replication is an asynchronous process, which means MirrorMaker alone cannot guarantee that all the data is replicated successfully in a target cluster if the source cluster fails.\n Kafka is a great piece of software. It is performant, well-abstracted, very cheap (meaning modest hardware can do millions of read/write operations per second) and it gives us great flexibility. These characteristics of Kafka are based on simple design choices. Those design choices, however, do not play well in multi-region active/active or active/passive system design, for a very simple reason:\n There is an obvious data transfer latency between regions. Achieving low latency, and strong consistency while surviving region failure is not an easy challenge to solve.", "posttime": "2020-05-11 01:55:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "kafka,disaster,主题", "title": "使用Kafka实现弹性和灾难恢复", "title_en": "Resiliency and Disaster Recovery with Kafka", "transed": 1, "url": "https://tech.ebayinc.com/engineering/resiliency-and-disaster-recovery-with-kafka/", "via": "", "real_tags": ["kafka", "disaster", "主题"]}, {"category": "", "categoryclass": "", "imagename": "1d4d2fd1444be1e8add9e10fe8afe618.png", "infoid": 1001548, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "荒岛开发行动于2020年4月30日在游戏“动物穿越：新地平线”中举行。据我所知，这是第一次在动物穿越举行的技术会议，并在Twitch上进行了直播。会议组织者已经发布了个人演讲的视频，我会链接到每个演讲的视频，但你也可以在Twitch上观看整个录制的视频。\n奥斯汀·帕克在推特上发布了一个关于在动物穿越举办会议的笑话，然后它变成了现实。他的推文引发了一场活动，一些非常知名的演讲者在Twitch上有超过7000名观众。TL；DR的意思是，这是一场虚拟的活动，本来可以是噱头，但结果却是非常真实的感觉，同时传达了巨大的信息。参与会议的人似乎很喜欢动物穿越，这就是会议远离潜在的花哨结果的原因，至少对我来说是这样。\n对于许多人来说，“动物穿越：新地平线”(我将称之为ACNH)目前是最完美的视频游戏。由于冠状病毒大流行，人们感到孤立、焦虑和许多其他情绪。ACNH是一款视频游戏，几乎是一款游戏可以做到的最酷的游戏。你在岛上闲逛，进行一些非常禅宗的活动，没有前进的压力。你可以拜访朋友，和他们交换物品，或者干脆做你自己的事。我发现它非常放松，我认为它帮助我控制了我的压力水平。\n会议的实际运作方式令人着迷。演讲者和组织者聚集在ACNH的一个岛屿上。演讲者站在讲台上，手持笔记本电脑玩游戏，但也在Zoom会议上分享幻灯片和音频。所有这些都流向了Twitch。会议还有一个不和谐的服务器，一些人举办了观看派对，人们可以来到他们的ACNH岛，在观看演讲的同时闲逛。这一切都是经过深思熟虑和执行的。我的一个抱怨是，我在尝试处理所有不同的通信平台(包括Twitter)时，设备有些疲劳。最后，我最终缩小了我的关注点，没有太多地关注Twitch聊天或不和谐。但我认为，拥有更多的交流选择可以让参与者使用他们喜欢的选择。\n会议在太平洋时间上午7点开始，老实说，那个时候我的部分大脑对整个概念都有问题：\n嘿，我早上6点半起床去看动物穿越的DevOps大会，我从来没想过会打出这句话。#DIDevOps。\n-Rich Burroughs(@richburroughs)2020年4月30日。\n这一天以奥斯汀和凯蒂·法默的介绍开始。我认识凯蒂有一段时间了，她是个讨人喜欢的人。她作为当天的主持人也做得很好。有一个很大的重点是使活动具有包容性，我对此表示赞赏。这反映了ACNH对我的那种能量。\n开场主旨演讲是由Kubernetes和DevOps社区中我最喜欢的人之一，来自Heroku的Ian Coldwater(点击此处查看视频)。我在后面几排的KubeCon圣地亚哥看到伊恩在一万多人面前做了一个主题演讲，现在我看到他们在一个视频游戏里做了一个主题演讲。两者都是非常不同的经历，但都很有趣。\nIan的演讲是关于在DevOps人员和安全团队之间搭建桥梁，他们很好地解释了人们操作的不同角度。\nDevOps的人想要发布基础设施和应用程序，而安全团队有时被视为NO的团队。\n这场演讲与伊恩在圣地亚哥KubeCon的主题演讲有一个共同点，那就是专注于像攻击者一样思考。DevOps人员通常与攻击者的心态不同，他们可以从安全人员那里学到如何更像攻击者一样思考。\n我们每个人都有要教的东西，也有要学的东西。安全人员可以了解到持续改进。DevOps人员可以了解攻击者的想法，并了解如何开发更好的软件。@IanColdwater#DIDevOps。\n-Rich Burroughs(@richburroughs)2020年4月30日。\n打破孤岛和改善沟通是我们在DevOps中经常谈论的事情，但向安全团队学习的想法几乎没有听人讨论过。很高兴看到这一幕，这次演讲是拉开活动序幕的绝佳方式。我知道伊恩很喜欢ACNH，我想这会让他们的演讲更精彩。白天ACNH的许多参考资料对我来说是超级有趣的，作为一个玩这个游戏的人。\n活动的第二位演讲者是来自新遗迹的NočNica Fee，简称NICA，演讲标题为No Dev is an Island：How to do serverless Together(视频此处)。Nica谈到了这样一个事实，即无服务器对于一个人来说很容易做到，但随着团队规模的扩大，问题会越来越多。人们说出了一些残酷的事实：\nIAM是一个诅咒&#34；--@nocnicafee at#DIDevOps，谈论无服务器的问题。是。谢谢。\n-Avdi Grimm(@avdi)2020年4月30日。\n使用Serverless的测试也出现了，这是我很高兴了解到的更多信息。\n使用FAAS进行测试很困难，您甚至不会在演示中看到它。@NocnicaFee#DIDevOps。\n-Rich Burroughs(@richburroughs)2020年4月30日。\n您必须将基础设施作为代码接受，就像CloudForment一样。也可以做CI。很难模拟对像迪纳摩这样的东西的呼叫。@NocnicaFee#DIDevOps。\n-Rich Burroughs(@richburroughs)2020年4月30日。\n金丝雀很重要，可以让我们进行实验。您可以在AWS上的CloudForment中进行配置。@NocnicaFee@DIDevOps\n-Rich Burroughs(@richburroughs)2020年4月30日。\n接下来是GoSpotCheck的David Sudia，他的演讲标题引起了我的共鸣，如果你能等6个月，你应该等(视频在这里)。大卫在一个为工程师提供工具的团队工作。\n#DIDevops@thedevelopnik：我们是一个小团队，我们试图将其他人的工具粘合在一起，为我们的开发人员提供一个很好的平台。\n-海蒂，贴纸ThoughtLeader(@wiredferret)2020年4月30日。\n大卫给出了一些他使用新工具时感到痛苦的例子，比如特使、林克德和一个名字很棒的工具：\n#DIDevops@thedevelopnik：从YAML的噩梦到对实验有用的一行命令服务网格的两年。@solo_io，向Supergloo大喊&#34；最佳名称&#34；。\n-海蒂，贴纸ThoughtLeader(@wiredferret)2020年4月30日。\n当我在INFRA和SRE工作时，我经常感觉到使用新的闪亮工具的吸引力。与之截然相反的是Etsy的“使用枯燥的技术”模式。对我来说，最佳状态是介于两者之间的某个地方，不同的组织会有所不同。我现在不想运行LAMP堆栈，但是如果运行的工具缺少明显的功能、不稳定或者文档很差，那么运行这些工具也会带来很大的痛苦。这就是大卫在他演讲的标题中所指的。如果您的团队有时间等待使用新工具，他建议您这样做。\n你现在想做的事情在6个月后会容易得多&#34；-@thedevelopnik在#DIDevOps上实现真实性。\n-不收取čNICA费用(@NocnicaFee)2020年4月30日。\n基础设施也是MVP的一部分。我喜欢#DIDevOps上@thedevelopnik的这句话。对可行性来说是如此重要。\n-Johan Abildskov(@RandomSort)2020年5月1日。\n在短暂的休息之后，来自IBM的米娅·摩尔做了一个题为“建立虚拟社区”的演讲(视频点击这里)。\n我喜欢@xoMiaMoore在#DIDevOps上谈论社区建设，特别是幻灯片！！😂对完全在#AnimalCrossing😍pic.twitter.com/giftz2EAGi上举办技术会议的创造力印象深刻。\n--jess(@fink_jess)2020年4月30日。\n这是又一次很棒的演讲，非常及时。越来越多的数字社区如雨后春笋般涌现，有很多实验正在进行。米娅提到的一件事是，你不应该一个人做这件事。\n做你的研究，看看你的社区是否已经存在。与人合作，单枪匹马是非常困难的。协作和迭代。@xoMiaMoore#DIDevOps pic.twitter.com/Bz2iUQw0le。\n-jenn(@geekgalgroks)2020年4月30日。\n我帮助组织了一次会议，并帮助组织了几次会议，这是非常真实的。这不仅是大量的工作，而且如果你是唯一的组织者，你可能是一个单一的失败点。\n#DIDevops@xomiamoore：有很多工具。以下是您在选择时需要考虑的事项。你想做什么？单向通信还是广播？工具的语气或区域性。\n-海蒂，贴纸ThoughtLeader(@wiredferret)2020年4月30日。\n在看工具的时候，要考虑一下语气。松懈(商业)与不和谐(玩耍)的例子就是一个很好的例子。@xoMiaMoore#DIDevOps。\n-Rich Burroughs(@richburroughs)2020年4月30日。\n#DIDevops@xomiamoore：了解您现有的用户群以及他们已经知道的内容。避免平台转换--当我们更换平台时，这会让社区成员付出代价。\n-海蒂，贴纸ThoughtLeader(@wiredferret)2020年4月30日。\n将人们转移到新的工具和平台是非常困难的。当你试图进行这样的迁移时，预计只有一小部分社区成员会一起来搭便车。\n#DIDevops@xomiamoore：我们如何才能成为好的社区公民，无论是作为领导者还是非领导者？遵守规则，假设人是最好的。表现出以社区为中心的努力。庆祝成功，在你能负担得起的情况下，无偿地给予他人。\n-海蒂，贴纸ThoughtLeader(@wiredferret)2020年4月30日。\n午休前的最后一次演讲是一个非常吸引人的关于暴徒编程的演讲，由Nationwide的Tori Chu主持(视频在这里)。我对暴徒编程的概念有点熟悉(我在去年的一次活动上发言，Woody Zuill对此做了一个令人惊叹的演讲)，但我从来没有做过任何真正的暴徒编程。我确信我不是一个人在那里。Tori首先解释了这个概念：\n通过MOB编程，帮助您的整个团队始终如一地学习一件事，并提供真正的业务价值。@f00handle#DIDevOps pic.twitter.com/kO0twWPxNB。\n-詹娜·佩德森(@jennapederson)2020年4月30日。\n托里在一个团队工作，这个团队在他们公司担任顾问，帮助其他团队学习。他们在工作中不使用人为的例子。\n他们致力于将真正的应用程序迁移到云端，因此这不仅仅是一次练习。Tori&#39；的团队与负责迁移的团队进行2-6周的合作。@f00handle#DIDevOps。\n-Rich Burroughs(@richburroughs)2020年4月30日。\n然后，由于冠状病毒，她的团队不得不适应突然在家工作。\n#DIDevops@f00Handle：当我们过渡到在家工作时，我们意识到我们仍然可以进行暴徒编程，因为只有一个司机和一个抄写员，而且有沟通的能力。\n-海蒂，贴纸ThoughtLeader(@wiredferret)2020年4月30日。\n很快，演讲变成了互动的暴徒编程演示，汤姆·努克(Tom Nook)担任司机。\n哇，这是一个现场实践的互动学习会议-在动物穿越的一个技术会议上。一些我从未想过我会说的话..。通过https://t.co/tM7qFE5rg8代码#fooHandle，@f00Handle在她的dockerfile！#didevops pic.twitter.com/sziR1fDjSN！\n-卡斯林·菲尔兹(@kaslinfield)2020年4月30日\nTori解释说，MOB编程允许整个团队一起学习和解决问题。我只听说过它，但我从演示中对它有了更多的感觉，认为它非常耐人寻味。这个演示非常酷，我的推文不能很好地说明这一点。你应该看一下视频，看看你的团队是否想试一试。\n接下来是午休，我花了一些时间跳进ACNH，四处闲逛，这是我在午休时倾向于做的事情。\n午餐后，来自MongoDB的Adrienne Tacke做了一个演讲，题目是“拥抱黄蜂：为什么失败能帮助你的团队”(视频点击这里)。我喜欢关于失败的讨论，这似乎非常适合我们现在所处的时代。我们需要耐心对待自己和队友，因为我们都在应对压力和认知负荷。\nAdrienne在ACNH中使用了黄蜂蜇的比喻，以及它们是如何帮助她了解更多关于这项运动的知识的。她解释说，失败可以帮助我们更好地与团队合作。\n失败是一个合作的机会。我喜欢她在“动物穿越”中的例子，以及她把这些例子和工作例子联系起来的方式。@AdrienneTacke#DIDevOps pic.twitter.com/zSPkwMZ7Th。\n-jenn(@geekgalgroks)2020年4月30日。\n“穿越动物”中连续被蜇两次的处罚刚刚在你家醒来。这很烦人，但游戏还没有结束。失败是安全的。这是不方便的，不是惊天动地的可怕的。为您的组织做同样的事情。@AdrienneTacke#DIDevOps。\n-jenn(@geekgalgroks)2020年4月30日\n“我花了更长的时间才把这个定制的东西做成…。”这次会议确实带来了演讲者的一些下一阶段的努力。这正是我们现在需要的社区欢乐。]@AdrienneTacke#DIDevOps pic.twitter.com/0HYsbZghn9。\n-Aaron Aldrich(@Crayzeigh)2020年4月30日。\n来自JFrog的Kat Cosgrove是下一个演讲者，他的演讲题目是汽车上的蛇(视频在这里)。这是会议中技术含量最高的演讲之一，非常有趣。顺便说一句，我真的很喜欢节目中文化和技术演讲的混合。这让我想起了一个DevOpsDays程序，我认为它非常合适。\n凯特的演讲是关于她的团队为一次活动制作的一个演示，展示如何通过网络更新汽车软件。\n#DIDevOps@dixie3 Flatline：我们通常不认为我们的汽车是物联网或边缘设备，但它们是！\n-海蒂，贴纸ThoughtLeader(@wiredferret)2020年4月30日。\n这是一个我觉得非常有趣的话题。在这一点上，汽车在很大程度上是计算机，更新软件涉及到很多风险。凯特的团队为演示制作了一个赛车模拟器。\n好吧，那太棒了。@Dixie3Flatline测试他们将代码OTA推送到他们的汽车上的POC。他们让开发人员在开车时推送固件，以证明自己的观点。一件需要几个小时和在场的事情，可以远程快速完成。#DIDevOps pic.twitter.com/QmnvypampT\n-Aaron Aldrich(@Crayzeigh)2020年4月30日。\n这是我感兴趣的另一个话题，因为我最近参加了很多F1 2019年的比赛，看着模拟器装备。凯特的团队使用非常受欢迎的罗技G29赛轮制造了一款众所周知的驴车。\n他们甚至可以做一些事情，比如调整罗技G29轮子上的力反馈。太酷了。@Dixie3Flatline#DIDevOps。\n-Rich Burroughs(@richburroughs)2020年4月30日。\n基地本身就是所谓的驴车：≈，价值25万美元的零配件，RC汽车，Ras Pi，Cam，Battery Bank，Train It！比赛吧！@Dixie3Flatline#DIDevOps pic.twitter.com/hqpNhiY9Gc。\n-Aaron Aldrich(@Crayzeigh)2020年4月30日。\n凯特还提到，当他们在这个项目上工作时，存在范围蠕动，如果今天发生，她会做得更好。范围和特性蔓延是每个团队都会在某个时候处理的问题。\n拥有一个好的团队领导和设置好的边界对每个领域的每个人来说都是挑战，到处都需要。@Dixie3Flatline#DIDevOps\n-jenn(@geekgalgroks)2020年4月30日。\n超级有趣的谈话和演示。GitHub上也提供了一些软件。\n来自红帽的马特·斯特拉顿，或者对我们这些爱他的人来说，是马蒂，紧随其后。他的演讲名为“踢Em或保持Em-在我们自己的荒岛上合作”(视频请点击此处)。我最近在另一个虚拟会议Failover Conf上看到了Matty的演讲，他在这里发表了另一个很棒的演讲。有一件事我非常欣赏，那就是荒岛开发行动组织者所做的演讲选择。他们做得很好，找到了与许多人现在正在体验的内容超级相关的内容。\n心理安全意味着人们不会因为直言不讳而受到惩罚或尴尬。@mattstratton#DIDevOps pic.twitter.com/7AoVPs5nff。\n-Rich Burroughs(@richburroughs)2020年4月30日。\n很多人都经历过在工作场所受到羞辱或惩罚，或者亲眼目睹过这样的事情发生在别人身上。我们本能地知道这是有害的，但有数据表明，心理安全预示着生产力。\n来自@nicolefv和团队的@devops_Research报告给了我们实际数据。心理安全很重要，而且会影响公司的底线。@mattstratton#DIDevOps pic.twitter.com/dW9S3NtfoY。\n-Rich Burroughs(@richburroughs)2020年4月30日\n马蒂还谈到了非暴力沟通，这对我来说是一个新领域。\n任何时候只要有人提到马歇尔·罗森伯格博士，我就是他的铁杆粉丝。几年来，我一直在尝试非暴力沟通(NVC)，最初是在KINE上介绍的。@mattstratton#DIDevOps描述了一个很棒的工作表：https://t.co/EZnLFP2SUh。\n-泰勒·巴内特(@Taylor_ATX)2020年4月30日。\n他说，妥协不是目标，因为妥协可能会让每个人都不高兴。\n妥协涉及请求。了解什么是请求可以帮助您进行辩论并得出更成功的结论。你如何看待别人的要求，以富有成效的方式？试试这些提示！#DIDevOps@mattstratton pic.twitter.com/xZjAynP2Ln。\n-卡斯林·菲尔兹(@kaslinfield)2020年4月30日。\n他最后引用了一句非洲谚语：“如果你想走得快，那就自己走吧。”如果你想走得更远，那就一起走吧。“。\n很棒的引语。自己承担项目有很大的好处。但如果你想走得更远，你需要合作。这次演讲中阐述的关于建立心理安全@mattstratton的要点可以帮助你们更好地协作！查看！#didevops pic.twitter.com/uknHM5a98l\n-卡斯林·菲尔兹(@kaslinfield)2020年4月30日。\n这次谈话来得太及时了。在正常情况下，协作可能会很困难，但现在对于许多团队来说，这将是更具挑战性的。人们正在远程工作，这是不正常的，他们压力很大，心烦意乱。我很高兴看到这个话题被报道了，我学到了一些东西。\n接下来是来自Hashicorp的Jquie Grindrod，他的演讲题目是“你今天不会去太空”(视频在这里)。Jquie的团队制作了一个游戏，作为黑客马拉松的一部分。\n#DIDevOps@devopsjquie：我们的灵感来自Jackbox、Nethack、“我的世界”和其他游戏。我们希望支持远程多人游戏，提供振奋人心的体验，并鼓励团队合作。\n-海蒂，贴纸ThoughtLeader(@wiredferret)2020年4月30日。\n#DIDevOps@devopsjquie：我们希望使用一些基本的devops原则，包括可扩展的基础设施、基础设施作为代码，以及一致的构建和部署。\n-海蒂，贴纸ThoughtLeader(@wiredferret)2020年4月30日。\n他们遇到了术语颜色和多人游戏的问题，他们转向了。他们选择了功能性而不是美观性，在黑客马拉松比赛中没有时间两者兼而有之。@devopsjquie#DIDevOps pic.twitter.com/NU8RRvR5E6\n-Rich Burroughs(@richburroughs)2020年4月30日。\n这场演讲的很多内容都是关于团队在项目过程中做出的决定。在开始一个项目后发现有些事情不会按你希望的方式进行，这是很常见的。Jquie的团队不得不对他们的期望做出一些改变。很高兴听到一些坦率的讨论他们的斗争。\n是的，有时候你不得不接受你所处的位置和你拥有的工具，然后继续前进。你不能总是让新的闪亮工作。@devopsjquie#DIDevOps。\n-jenn(@geekgalgroks)2020年4月30日。\n这个演讲非常有趣，Jquie可能是今天看起来最棒的：\n嗨@devopsjquie！👋需要借用您在#DIDevOps演讲时戴的眼镜。🤩pic.twitter.com/xzwxOtYYI6。\n-凯蒂·里斯·ᕕ(ᐛ)ᕗ(@katiereese317)美联社。\n..", "note_en": "Deserted Island DevOps  was held on April 30, 2020, in the game   Animal Crossing: New Horizons . It was the first tech conference held in Animal Crossing, as far as I know, and was streamed live on Twitch. The conference organizers have broken out videos for the individual talks and I’ll be linking to those for each one, but you can also view the entire recorded stream   on Twitch.\n Austin Parker  tweeted a joke about hosting a conference in Animal Crossing, and then it became a reality. His tweet led to an event that featured some very well known speakers and had over 7000 viewers on Twitch. The TL;DR is that this was a virtual event that could have been gimmicky but turned out to be very authentic feeling while conveying great information. The people involved seemed to love Animal Crossing, which is what steered the conference away from the potential gimmicky outcomes, at least for me.\n For many people Animal Crossing: New Horizons (which I’ll be referring to as ACNH) has been the perfect video game for the moment. People have felt isolated, anxious, and a host of other emotions, due to the COVID-19 pandemic. ACNH is a video game that’s about as chill as a game can be. You hang out on an island and perform some very Zen activities, and there’s no pressure to advance. You can visit friends and exchange items with them, or just do your own thing. I find it very relaxing, and I think it has helped me manage my stress levels.\n The way the conference actually worked was fascinating. The speakers and organizers gathered on an island in ACNH. The speakers stood at a podium with a laptop in the game but were also in a Zoom conference where they shared slides and audio. All of that was streamed to Twitch. The conference also had a Discord server, and some people hosted viewing parties where people could come to their ACNH island and hang out while they watched the talks. It was all very well thought out and executed. My one complaint was that I got some device fatigue trying to juggle all of the different communication platforms happening (including Twitter). Eventually, I ended up narrowing my focus and not paying much attention to the Twitch chat or Discord. But I suppose that having more options for communication let the participants use the ones they preferred.\n The conference started at 7 AM Pacific Time, and honestly, part of my brain was having trouble with the whole concept at that hour:\n Hey I got up at 6:30 AM to watch a DevOps conference in Animal Crossing and I never expected to type this sentence.  #DIDevOps\n— Rich Burroughs (@richburroughs)  April 30, 2020\n   The day started with some intro from Austin and   Katy Farmer . I’ve known Katy for a while, and she’s a delightful person. She also did a great job as the MC for the day. There was a big focus on making the event inclusive, which I appreciated. That reflects the kind of energy that’s in ACNH for me.\n The opening keynote was by one of my favorite people in the Kubernetes and DevOps communities,   Ian Coldwater  from Heroku (view the   video here ). I saw Ian do a keynote in front of 10,000+ people at   KubeCon San Diego  from a few rows back, and now I’ve seen them do a keynote inside of a video game. Both were very different experiences, but a lot of fun.\n   Ian’s talk was about building bridges between DevOps folks and security teams, and they did a great job of explaining the different perspectives that people operate from.\n   DevOps people want to ship infra and applications, while security teams are sometimes seen as the team of no.\n      One thing this talk had in common with Ian’s KubeCon San Diego keynote was the focus on thinking like attackers. DevOps people often don’t share the attacker’s mindset, and they can learn how to think more like attackers from security folks.\n All of us have something to teach and something to learn. Security people can learn about Continuous Improvement. DevOps people can learn about how attackers think, and learn how to make better software.  @IanColdwater  #DIDevOps\n— Rich Burroughs (@richburroughs)  April 30, 2020\n  Breaking down silos and improving communication is something we talk a lot about in DevOps, but that idea of learning from the security teams is one I don’t hear discussed nearly as much. It was great to see, and this talk was a fantastic way to kick off the event. I know Ian loves ACNH, and I think that made their presentation even better. The many ACNH references during the day were super fun for me, as someone who plays the game.\n   The second speaker of the event was   Nočnica Fee  from New Relic, or Nica for short, with a talk titled No Dev is an Island: How to do serverless together (  video here ). Nica talked about the fact that serverless is easy for one person to do, but more problematic as teams scale in size. Some hard truths were spoken:\n  &#34;IAM is a curse&#34; -  @nocnicafee at  #DIDevOps, talking about problems in serverless.  YES. THANK YOU.\n— Avdi Grimm (@avdi)  April 30, 2020\n  Testing with serverless also came up, which is something I was happy to learn more about.\n Testing with FaaS is hard, you won&#39;t even see it mentioned in demos.  @NocnicaFee  #DIDevOps\n— Rich Burroughs (@richburroughs)  April 30, 2020\n You must embrace Infrastructure as Code, like CloudFormation. It&#39;s possible to do CI too. It&#39;s hard to simulate calls to things like Dynamo.  @NocnicaFee  #DIDevOps\n— Rich Burroughs (@richburroughs)  April 30, 2020\n      Canaries are important, and allow us to experiment. You can configure that in CloudFormation on AWS.  @NocnicaFee  @DIDevOps\n— Rich Burroughs (@richburroughs)  April 30, 2020\n   Next up was   David Sudia  from GoSpotCheck with a talk title that resonated with me, If You Can Wait 6 Months, You Should (  video here ). David works on a team that provides tools for engineers.\n #DIDevops  @thedevelopnik: We&#39;re a small team, and we try to glue tools from other people together to make a great platform for our developers.\n— Heidi, The Sticker Thoughtleader (@wiredferret)  April 30, 2020\n  David gave some examples of pain he’d felt using new tools, like Envoy, Linkerd, and one with a fantastic name:\n #DIDevops  @thedevelopnik: 2 years from YAML nightmare to a service mesh that is a one-line command that is useful for experimentation.  @solo_io, shoutout to Supergloo for &#34;Best Name&#34;.\n— Heidi, The Sticker Thoughtleader (@wiredferret)  April 30, 2020\n  When I was working in infra and SRE, I often felt the pull to use the new shiny tool. At the opposite end of the spectrum is the Etsy “use boring technologies” model. To me, the sweet spot is somewhere in between, and it will be different from org to org. I wouldn’t want to be running the LAMP stack right now, but there also can be a lot of pain with running tools that are missing obvious features, aren’t stable, or have poor documentation. This is what David was referring to with his talk’s title. If your team has time to wait on using a new tool, he suggests you do it.\n &#34;The thing you want to do now will be a *lot* easier in 6 months&#34; -  @thedevelopnik delivering realness at  #DIDevOps\n— Nočnica Fee (@NocnicaFee)  April 30, 2020\n   &#34;Infrastructure is also part of an MVP&#34;. I love this quote from  @thedevelopnik at  #DIDevOps. So important for feasibility.\n— Johan Abildskov (@RandomSort)  May 1, 2020\n  After a short break,   Mia Moore  from IBM gave a talk titled Building Virtual Community (  video here ).\n I love  @xoMiaMoore talk on communit building on  #DIDevOps esp the slides!! 😂 So impressed by the creativity that goes into holding a tech conf entirely on  #AnimalCrossing 😍😍😍  pic.twitter.com/Gyftz2EAGi\n— Jess (@fink_jess)  April 30, 2020\n  This was another great talk and super timely. A lot more digital communities are cropping up, and there’s a lot of experimentation going on. One thing Mia mentioned is that you shouldn’t try to do this alone.\n Do your research to see if your community already exists. Partner up with people, it is SUPER hard to do by yourself. Collaborate and iterate. @xoMiaMoore  #DIDevOps  pic.twitter.com/Bz2iUQw0le\n— Jenn (@geekgalgroks)  April 30, 2020\n  I’ve helped run a meetup and helped organize a few conferences, and this is very true. Not only is this all a lot of work, but if you’re the only organizer, you’re potentially a single point of failure.\n  #DIDevops  @xomiamoore: There are a lot of tools out there. Here are the things to consider as you choose. What are you trying to do? One-way communication or broadcast? Tone or culture of the tool.\n— Heidi, The Sticker Thoughtleader (@wiredferret)  April 30, 2020\n When looking at tools, think about the tone. The example of Slack (business) vs Discord (play) is a great one.  @xoMiaMoore  #DIDevOps\n— Rich Burroughs (@richburroughs)  April 30, 2020\n   #DIDevops  @xomiamoore: Be aware of your existing user base and what they already know. Avoid platform transitions -- it costs a community membership when we change platforms.\n— Heidi, The Sticker Thoughtleader (@wiredferret)  April 30, 2020\n  Moving people to new tools and platforms is very difficult. When you try to make one of those migrations, expect only a fraction of the community to come along for the ride.\n  #DIDevops  @xomiamoore: How can we be good community citizens, as leaders or not? Follow the rules, assume the best of people. Show effort to be community focused. Celebrate successes, and give to others freely, as much as you can afford.\n— Heidi, The Sticker Thoughtleader (@wiredferret)  April 30, 2020\n   The last talk before the lunch break was a very fascinating talk about   mob programming , by   Tori Chu  from Nationwide (  video here ). I’m a bit familiar with the concept of mob programming (I spoke at an event last year where   Woody Zuill  gave an amazing talk about it), but I’ve never done any actual mob programming. I’m sure I’m not alone there. Tori started by explaining the concept:\n Help your whole team learn a thing, consistently, and deliver real business value with Mob Programming. @f00handle  #DIDevOps  pic.twitter.com/kO0tvWPxNB\n— Jenna Pederson (@jennapederson)  April 30, 2020\n  Tori works on a team that acts as consultants in their company, helping other teams learn. They don’t use contrived examples in their work.\n They work on migrating a real app to the cloud so it&#39;s not just an exercise. Tori&#39;s team does 2-6 week engagements with the team that&#39;s doing the migration.  @f00handle  #DIDevOps\n— Rich Burroughs (@richburroughs)  April 30, 2020\n  And then due to COVID-19 her team had to adjust to suddenly working from home.\n #DIDevops  @f00handle: When we transitioned to working from home, we realized that we could still do mob programming, since there was one driver and one scribe and the ability to communicate.\n— Heidi, The Sticker Thoughtleader (@wiredferret)  April 30, 2020\n  Soon the talk turned into an interactive mob programming demo, with Tom Nook as the driver.\n Wow, this is a live hands on, interactive learning session - in a tech conference in Animal Crossing. Things I never thought I would say... Via  https://t.co/tM7qFE5rg8 code  #foohandle,  @f00handle is taking suggestions for what to do live in her dockerfile!  #didevops  pic.twitter.com/sziR1fDjSN\n— Kaslin Fields (@kaslinfields)  April 30, 2020\n  Tori explained that mob programming allows the entire team to learn and solve problems together. I had only heard about it, but I got much more of a feel for it from the demo and think it’s very intriguing. The demo was super cool, and my tweets won’t do it justice. You should watch the video and see if your team wants to try it out.\n Next was the lunch break, where I took some time to hop into ACNH and mess around, which is something I tend to do on lunch breaks anyway.\n   Up after lunch was   Adrienne Tacke  from MongoDB with a talk titled, Embrace the Wasp Sting: Why Failure Helps Your Team (  video here ). I love discussions about failure, and it seemed super appropriate for the time we’re in. We need to be patient with ourselves and our teammates, as we’re all dealing with stress and cognitive load.\n Adrienne used the metaphor of the wasp stings in ACNH, and how they helped her learn more about the game. And she explained that failure helps us collaborate better with our teams.\n Failure is a chance to collaborate.  I love her examples from Animal Crossing and how she relates them to work examples. @AdrienneTacke  #DIDevOps  pic.twitter.com/zSPkwMZ7Th\n— Jenn (@geekgalgroks)  April 30, 2020\n The penalty in Animal Crossing for getting stung twice in a row, is just waking up at your house. It is annoying but not game over.  It is safe to fail. It is inconvenient not earth shattering horrible.  Do the same for your organization. @AdrienneTacke  #DIDevOps\n— Jenn (@geekgalgroks)  April 30, 2020\n   “It took me way longer to make this custom thing…”  [This conference has really brought forth some next-level effort from speakers. This is exactly the kind of communal joy we need right now.] @AdrienneTacke  #DIDevOps  pic.twitter.com/0HYsbZghn9\n— aaron aldrich (@crayzeigh)  April 30, 2020\n   Kat Cosgrove  from Jfrog was the next speaker, with a talk titled Snakes on a Car (  video here ). This was one of the more technical talks of the conference, and it was very interesting. As an aside, I really enjoyed the mix of culture and technical talks in the program. It reminded me very much of a DevOpsDays program, which I thought was very appropriate.\n Kat’s talk was about a demo her team built for an event to show how you’d do updates on a car’s software over the wire.\n #DIDevOps  @dixie3flatline: We often don’t think of our cars as IoT or Edge devices, but they are!\n— Heidi, The Sticker Thoughtleader (@wiredferret)  April 30, 2020\n  This is a topic I find super interesting. Cars are very much computers at this point, and there’s a lot of risks involved with updating their software. Kat’s team built a racing simulator for the demo.\n Alright, that’s just awesome.  @Dixie3Flatline testing their POC of pushing code OTA to their car. They let devs push firmware while driving to prove a point. A thing that took hours and presence, could be done remotely and quickly.  #DIDevOps  pic.twitter.com/QmnvypampT\n— aaron aldrich (@crayzeigh)  April 30, 2020\n  This is another topic that’s of interest to me, as I’ve been playing a lot of   F1 2019  recently and looking at simulator gear. Kat’s team used the very popular   Logitech G29  racing wheel to build what is known as a  Donkey Car.\n They were even able to do things like adjust the force feedback on the Logitech G29 wheel. Super cool.  @Dixie3Flatline  #DIDevOps\n— Rich Burroughs (@richburroughs)  April 30, 2020\n The base itself is something called a Donkey Car:   ≈$250 in parts RC Car Ras Pi Pi Cam Battery Bank  Train it! Race it! @Dixie3Flatline  #DIDevOps  pic.twitter.com/hqpNhiY9Gc\n— aaron aldrich (@crayzeigh)  April 30, 2020\n  Kat also mentioned that there was scope creep as they worked on this project, and that she would do a better job of pushing back on that if it happened today. Scope and feature creep are things that every team deals with at some point.\n Having a good team lead and setting good boundaries are challenges for everyone in every field and are needed everywhere. @Dixie3Flatline  #DIDevOps\n— Jenn (@geekgalgroks)  April 30, 2020\n  Super fun talk and demo. Some of the software is available on GitHub, as well.\n Matt Stratton  from Red Hat, or Matty to those of us who love him, was up next. His talk was called Kick Em or Keep Em – Collaborating on our own Deserted Islands (  video here ). I saw Matty speak recently at another virtual conference,  Failover Conf, and here he was with another great talk. One thing I very much appreciated was the talk selection that the Deserted Island DevOps organizers did. They did a great job finding content that was super relevant to what many people are experiencing right now.\n  Psychological safety means people will not be punished or embarrassed for speaking up.  @mattstratton  #DIDevOps  pic.twitter.com/7AoVPs5nff\n— Rich Burroughs (@richburroughs)  April 30, 2020\n  Many people have experienced being shamed or punished in the workplace, or have seen it happen to others. We know pretty instinctively that it’s harmful, but there’s data that shows that psychological safety predicts productivity.\n The  @devops_research reports from  @nicolefv and team have given us actual data. Psychological safety matters and impacts the company&#39;s bottom line.  @mattstratton  #DIDevOps  pic.twitter.com/dW9S3NtfoY\n— Rich Burroughs (@richburroughs)  April 30, 2020\n  Matty also talked about Nonviolent Communication, which is a an area that was new to me.\n Anytime there&#39;s a talk with a mention of Marshall Rosenberg, Ph.D., I&#39;m a big fan. I&#39;ve been trying to work on Non-violent Communication (NVC) for a few years now, initially introduce at Keen.  @mattstratton  #DIDevOps   A great worksheet that describes:  https://t.co/EZnLFP2SUh\n— Taylor Barnett (@taylor_atx)  April 30, 2020\n  He said that compromise isn’t the goal, as a compromise can leave everyone unhappy.\n Compromise involves requests. Understanding what a request is can help you debate and arrive at more successful conclusions. How do you think about the requests of others in a productive way? Try these tips!  #DIDevOps  @mattstratton  pic.twitter.com/xZjAynP2Ln\n— Kaslin Fields (@kaslinfields)  April 30, 2020\n  And he ended with an African proverb: “If you want to go fast, go alone. If you want to go far, go together.”\n Great quote. There are great benefits to taking on projects by yourself. But if you want to go far, you&#39;ll need to collaborate. The points about establishing psychological safety  @mattstratton laid out in this talk can help you collaborate better! Check it out!  #didevops  pic.twitter.com/uknHM5a98l\n— Kaslin Fields (@kaslinfields)  April 30, 2020\n  This talk was so timely. Collaboration can be difficult under normal circumstances, but it will be even more challenging for many teams right now. People are working remotely that don’t normally, and they are stressed and distracted. I was pleased to see this topic covered, and I learned some things.\n Up next was   Jacquie Grindrod  from Hashicorp, with a talk titled You Will Not Go To Space Today (video here). Jacquie’s team built a game as part of a hackathon.\n #DIDevOps  @devopsjacquie: We took inspiration from Jackbox, Nethack, Minecraft, and other games. We wanted to support remote multiplayer, provide an uplifting experience, and encourage team work.\n— Heidi, The Sticker Thoughtleader (@wiredferret)  April 30, 2020\n #DIDevOps  @devopsjacquie: We wanted to use some basic devops principles, including scalable infrastructure, infrastructure as code, and build and deploy consistently.\n— Heidi, The Sticker Thoughtleader (@wiredferret)  April 30, 2020\n   They ran into problems with term colors and figuring out multiplayer, to they pivoted. They chose functionality over aesthetics, there wasn&#39;t time to do both in the hackathon.  @devopsjacquie  #DIDevOps  pic.twitter.com/NU8RRvR5E6\n— Rich Burroughs (@richburroughs)  April 30, 2020\n  A lot of this talk was about the decisions that the team made along the way of the project. It’s pretty common to launch into a project and find out some things aren’t going to work the way you want them to. Jacquie’s team had to make some changes to their expectations. It was great to hear some frank discussion of the struggles they had.\n Yes, sometimes you have to accept where you are and the tools you have and move on. You can&#39;t always make the new shiny work. @devopsjacquie  #DIDevOps\n— Jenn (@geekgalgroks)  April 30, 2020\n  This talk was very fun, and Jacquie may have had the best look of the day:\n Hi  @devopsjacquie! 👋 Need to borrow these glasses you are wearing during your  #DIDevOps talk, please. 🤩  pic.twitter.com/xzwxOtYYI6\n— Katie Reese ᕕ( ᐛ )ᕗ (@katiereese317)  Ap\n......", "posttime": "2020-05-11 01:55:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "devops,island,演讲", "title": "荒岛DevOps话后工作", "title_en": "Deserted Island DevOps Wrapup", "transed": 1, "url": "https://www.firehydrant.io/blog/deserted-island-devops-wrapup/", "via": "", "real_tags": ["devops", "island", "演讲"]}, {"category": "", "categoryclass": "", "imagename": "e5c947b7730c1c416fa0ef68131c8242.png", "infoid": 1001547, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "向Rails项目报告错误的门槛可能相当高。您需要仔细诊断问题，最好是提出解决方案，包括详细的复制步骤，以及所有其他的家庭作业，这些作业使Rails这样的项目能够每年处理数百(如果不是数千)个报告。\n虽然这是一个合理的过程来收集可行的报告，一小群贡献者可以合理地进行分类，但对于了解所有让你的旅程变得更加不舒服或花费更长时间的坑坑洼洼、路障和环形交叉路口的信息来说，这根本不是一个很好的过程。这些东西就会被怨恨的深渊吞没(我已经用完这个比喻了吗？！😂)。\n因此，当Avdi在Twitter上表达一些不满时，当你感觉自己的工作受到攻击时，自然而然地发生了一件事：核心贡献者群体变得防御性了！这是一个错误的描述！完成的错误报告在哪里！？你知道演练，如果你曾经做过某件事，倾注你的心，然后在网上看到它受到批评。这是一种立竿见影的下意识反应。但它不一定要刺痛。\n“在刺激和回应之间有一个空间。在这个空间里，我们有能力选择我们的反应。我们的反应就是我们的成长和自由。“--维克多·弗兰克尔。\n我们现在选择的反应不同于对感觉到的轻视的典型反应。我们的反应将是增长，它的本质是，阿夫迪的挫折是广泛的挫折，它们是正当的挫折。它们可能还不是一种可操作的形式，就像我们习惯于完美描述的错误报告一样，但是我们可以把它们变成那样！一起来！\n更重要的是，我们可以接受，阿夫迪的挫折感远远不足以掩盖所有的挫折感。这样我们就可以要求更多了！以一种结构化的方式，在新的查询范式下，我们可以一起使Ruby on rails变得更好。听起来很不错，不是吗？\n这就是我们要做的！我们成立了一个小团体，让Avdi、Betsy和其他表达过不满或对这些不满感兴趣的人一起工作。这个小组的第一个项目是我们所说的WTF五月。这是Ruby on rails论坛上的一个新类别，对于那些您不打算成为正式错误报告的WTF来说，它将是一个安全的空间。时间安排在五月份。它将在贝茜·海贝尔的冠军名下运行。所以我会让她设定订婚条件：\n我们都把时间浪费在“Rails WTF”上。我们的Rails进程出了点问题，我们花了四个小时疯狂阅读Stack Overflow，最后才想到要重新启动Spring。或者我们犯了一个愚蠢的打字错误，这会导致自动加载器失去对完全不同的类的跟踪。\n为WTF编写错误报告可能很困难。当很难理解是什么引发了问题，或者是什么修复了它，确定一个好的复制品似乎是不可能的。当他们刚刚花了几个小时盯着Byebug和咒骂电脑的时候，谁还想去努力呢？\n今年5月，Rails团队将处理其中的一些WTF-这意味着我们需要您告诉我们有关它们的情况！给我们发送你最奇怪的Rails 6个故事，即使你并不真正了解是什么触发了它们，也不记得你是如何修复它的。尽可能多地提供细节-但不要担心你不能提供的细节。我们将仔细查看所有这些内容，以寻找可以让我们为每个人改进Rails(或至少是其错误消息)的模式。\n所以，请和我们一起参加五月的WTF活动吧。帮助Betsy、Avdi和其他所有对将挫折的原始能量转化为文档、错误消息甚至API的闪亮补丁感兴趣的人。我们将WTF作为输入，并产生💖作为输出。", "note_en": "The bar for reporting a bug to the Rails project can be pretty steep. You’re expected to carefully diagnose the problem, preferably propose a solution, include detailed reproduction steps, and all the other homework that makes it possible for a project like Rails to deal with hundreds if not thousands of reports on a yearly basis.\n While this is a reasonable process for collecting actionable reports that a small group of contributors can reasonably triage, it’s not a great process at all for learning about all the the potholes, the roadblocks, and the roundabouts that make your journey that much more uncomfortable or take longer. That stuff just gets swallowed up by the sinkhole of grievances (have I exhausted the metaphor yet?! 😂).\n So when Avdi took to  air some of those grievances on Twitter, the natural thing happened that always happens when you feel your work is attacked: The core contributor group got defensive! That’s a mischaracterization! Where are the completed bug reports!? You know the drill, if you’ve ever worked on something, poured your heart into it, and then seen it criticized online. There’s that immediate, knee-jerk reaction of a sting. But it doesn’t have to sting.\n “Between stimulus and response there is a space. In that space is our powerto choose our response. In our response lies our growth and our freedom” – Victor Frankl\n We’re now choosing that response to be something different than the typical response to a perceived slight. Our response will be that of growth, and its essence is that Avdi’s frustrations are broad frustrations, they’re valid frustrations. They’re perhaps not yet in an actionable form, like we’re used to with perfectly described bug reports, but we can turn them into that! Together!\n And even more, we can accept that Avdi’s frustrations are not anywhere near broad enough to cover all the frustrations. So we can ask for more! In a structured way, under a new paradigm of inquiry, and we can make Ruby on Rails better together. That sounds pretty good, no?\n So that’s what we’re doing! We started a small group to involve  Avdi,  Betsy, and others who’ve expressed grievances or interest in those grievances to work together. And the first project to come out of this group is what we’re calling  A May of WTFs. It’s a new category on the Ruby on Rails discussion forum, and it’s going to be a safe space for those WTFs you weren’t going to turn into formal bug reports. It’s going to be timeboxed to the month of May. And it’s going to run under the championship of Betsy Haibel. So I’ll let her set the terms of engagement:\n We all lose time to “Rails WTFs.” Something goes weird in our Rails process, and we spend four hours frantically reading Stack Overflow before it finallyoccurs to us to restart Spring. Or we make one silly typo and it causes the autoloader to lose track of an entirely different class.\n  It can be hard to write bug reports for a WTF. When it’s difficult to understandwhat triggered it an issue, or what fixed it, nailing down a good reproductionseems impossible. And who wants to go to that effort when they’ve just spent hoursstaring at byebug and cursing computers?\n  This May, the Rails team is going to be tackling some of these WTFs – which means we need you to tell us about them! Send us your strangest Rails 6 stories, even if you don’t really understand what triggered them or remember how you fixed it.Provide as much detail as you can – but don’t worry over what you can’t. We’ll be looking through all of this for patterns that will let us improve Rails(or at least its error messages) for everyone.\n So please, come join us in a  May of WTFs. Help Betsy, Avdi, and everyone else who’s interested in transforming the raw energy of frustrations into gleaming patches to documentation, error messages, or even APIs. We’ll take WTFs as input and produce 💖 as output.", "posttime": "2020-05-11 01:53:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ruby,rails", "title": "Ruby on Rails：WTF的五月", "title_en": "Ruby on Rails: A May of WTFs", "transed": 1, "url": "https://weblog.rubyonrails.org/2020/5/7/A-May-of-WTFs/", "via": "", "real_tags": ["ruby", "rails"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001546, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎来到我的新博客！对我来说，这将是一个小小的实验。我想建立一个博客已经有很长一段时间了，但我从来不想把我的博客放在其他网站上，比如Medium(称其为虚荣心，但我喜欢看到我的名字出现在那个URL中)。我也不想设置像WordPress这样的东西，因为那感觉有点矫枉过正。我本可以设置一个像Jekyll这样的静态站点生成器，但是那样我就必须使用markdown进行比我真正希望的更多的样式。\n这时，一位朋友的想法又出现在我的脑海里。为什么不直接使用谷歌文档作为“CMS”呢？\n这就是这一页的内容。我的第一篇简短的博客帖子是从google docs直接传给你的。设置也不是特别复杂(可以在周末设置)。您可以在这里找到代码：\n我喜欢这种方法的原因有几个。首先，它很容易管理。我在谷歌硬盘上有一个博客文件夹，里面有我所有的帖子。如果我想推迟发布某些内容，我会将其移动到不同的文件夹中。如果我想写一篇文章，但我的伴侣正在使用我们共享的笔记本电脑，我会跳到iPad上。如果我最终决定转向一些实际的CMS，那么我宁愿从文本处理器复制内容，而不是从WordPress之类的东西复制内容(我真的不喜欢WordPress)。\n时间会证明这种方法是否奏效，但我能说的是，它相当酷。", "note_en": "Welcome to my new blog! This is going to be a bit of an experiment for me. I have wanted to set up a blog for quite some time now but I never wanted to host my blog on some other website like medium (call it a vanity thing but I like seeing my name in that URL). I also didn’t really want to set up something like wordpress because that felt a little overkill. I could have set up a static site generator like Jekyll but then I would have had to have done a bit more styling with markdown than I’d really like.\n  That’s when a friend’s idea popped back into my mind. Why not just use Google docs as a “CMS”?\n  So this is what this page is. My first short blog post coming straight to you from Google docs. It’s not particularly complicated to set up either (it can be set up over the weekend). You can find the code over here:\n   There are a few reasons why I like this approach. For one, it’s pretty simple to manage. I have a Blog folder on Google drive for all of my posts. If I want to hold off publishing something I move it into a different folder. If I want to do a write up but my partner is using our shared laptop, I jump on the iPad. And if I do eventually decide to move onto some actual CMS, well I’d rather copy over content from a text processor than from something like wordpress (I really don’t like wordpress).\n  Time will tell if this approach works out but all I can say is it is pretty cool.", "posttime": "2020-05-11 01:33:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,博客,现在,generated", "title": "我的博客现在是由Google Docs生成的", "title_en": "My blog is now generated by Google Docs", "transed": 1, "url": "https://benwiser.com/blog/My-blog-is-now-generated-by-Google-Docs.html", "via": "", "real_tags": ["google", "博客", "现在", "generated"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001545, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我第一次编写一行代码大概是在2007年左右，当时我只有十二三岁。尽管在那之前，我也曾摆弄过FrontPage，并从Word文档中导出HTML。还记得免费的网站生成器和免费的共享主机吗？我和他们中的很多人玩过。在那之后，一切都失控了。\n从第一个代码开始，我就知道我找到了一些很棒的东西，一些有价值的东西，一些有趣的东西。\n甚至在我上高中之前，我每天就已经花了几个小时复制粘贴我在随机网站上找到的代码，并对它们进行调整，使其在一个完全没有有价值内容的网站上变得雪上加霜。\n今天，我作为软件开发人员在戴托工作，与我的堂兄兼联合创始人Oğuzhan一起工作，他负责大部分业务。Dytto的当前和测试版是一个工具，可以创建报价，用漂亮的PDF将报价发送给客户，并跟踪交易情况。我从日常生活中抽出几个晚上，用像Laravel，Tailwind CSS和Alpine这样的现代工具把这个最低限度可行的产品组合在一起。非常感谢创作者，泰勒·奥特维尔，亚当·瓦森，史蒂夫·舒格，卡莱布·波齐奥，以及所有的贡献者。\n回想起我还有一个月就满17岁的时候，我在Facebook上看到了一则招聘广告，招聘一家营销机构的网络开发人员(当时人们称其为网站管理员)。作为一个反社会的内向的人，与陌生人交谈以雇佣我这个完全没有扎实成就的业余人士的焦虑是无法抗拒的。然后，我关闭了战斗或逃跑的本能，打了个电话。在完成了在Facebook内部运行的应用程序使用Facebook API的测试后(这是一件事)，我被接受了这份工作。耶我！\n快进到2018年，我做过几份不同的工作，积累了很多经验和知识，在最初的兴奋过去后，我从来没有对任何一份工作感到快乐。看到我的堂兄试图把自己推入企业家世界，我意识到这也是我想要的。我想为自己工作。我想为自己编写代码。我想建造一些东西，并以此谋生。\n所有这些工作和小时工都是赚点钱的手段，但如果你想出去旅行几天或几周，而你的老板拒绝了，那就不值多少钱了。\n于是我们开始计划创业，但不知道要做什么。当我们在一个美食节上和一些小贩聊天时，灯泡亮了起来。他们说，他们只卖物理广告，互联网广告对他们来说太麻烦了。长话短说，那就是我们开始做一件叫做“手艺”的事情的时候。它在某种程度上是工匠们分享他们的作品并出售它们的市场。那是一场灾难。\n在过去的一年里，我把所有的钱都花在了让Craftt工作上，我放弃了，找到了一份工作。但一次还不够。有人通过一位熟人找到了Oğuzhan，并邀请我们两人作为联合创始人加入他们的初创公司。我们跳上了这股潮流。我们已经在那里工作了6个多月了。与许多客户交谈，看到该领域的工作情况，以及修改已经建立的产品(无论是在软件方面还是目标受众方面)的难度，促使我们构建一些新的东西。\n这就是我们决定建造Dytto的原因。我们于5月3日上线，一周内的访问量令人振奋。下一个目标是接触到一些潜在客户，并在几周内推出。我们喜欢聊天，所以请随时通过Twitter(@hkanaktas，@mroguzhanaktas)或hello[at]dytto[dot]co(我们都查看)给我们发消息。", "note_en": "The first time I&#39;ve ever written a line of code was probably around 2007 when I was 12 or 13. Though even prior to that I&#39;ve fiddled with FrontPage and exporting HTMLs from Word documents. Remember the free website generators and the free shared hostings? I&#39;ve played around with a lot of them. It all spiralled out of control after that.\n Ever since that first code, I knew I found something great, something valueable, something  fun.\n Before I even started highschool, I was already spending hours a day copy-pasting codes I find on random websites and tweaking them to make it snow on a website that had absolutely no valuable content.\n Today I&#39;m working on  Dytto as the software developer, alongside my cousin and co-founder,  Oğuzhan, who handles most of the business side. Dytto, in its current -and beta- version, is a tool to create offers, send them to clients in beautiful PDFs, and keep track of the deals. I took a few nights out of my daily life and put together this minimally viable product using modern tools like Laravel, Tailwind CSS and Alpine. Huge thanks to the creators, Taylor Otwell, Adam Wathan, Steve Schoger, Caleb Porzio, and all the contributors.\n Flashback to when I was a month away to turning 17, I saw a job posting on Facebook for a web developer (people called it  webmaster back then) in a marketing agency. As the antisocial introvert I was, the anxiety of talking to some stranger into employing me, a complete amateur who has no solid accomplishment to show, was overwhelming. Then I shut down my fight-or-flight instincts and made the call. After completing a test to use Facebook APIs for an app that runs inside Facebook (it was a thing), I was accepted to the job. Yay me!\n Fast-forward to 2018, I have worked at a few different jobs, built a lot of experience and knowledge and never been happy at any job after the initial thrill of it passed. Seeing my cousin trying to push himself into the entrepreneurial world made me realize that that&#39;s also what I want. I wanted to work for myself. I wanted to code for myself. I wanted to build something and make a living out of it.\n All these employments and hourly works are means to make some money, but it doesn&#39;t worth much when you want to take a trip for a few days/weeks but your &#34;boss&#34; says no.\n So we began to plan on starting a business but didn&#39;t know what about. The lightbulb switched on when we were at a food festival and talking to some vendor. They said they only sell phsyically and internet ads were too much of an hassle for them. Long story short, that&#39;s when we started something called Craftt. It was sort of a marketplace for craftspeople to share their work and sell them. It was a disaster.\n  Having spent all my money in the past year trying to make Craftt work, I gave up and found a job. But once was not enough. Someone found Oğuzhan through a common acquaintance and asked both of us to join their startup as co-founders. We jumped on the bandwagon. We have been working there for more than 6 months now. Talking to many customers, seeing how things work in that area, and the difficulty of modifying an already established product (both in terms of software, and target audience) pushed us to build something new.\n That&#39;s how we decided to build  Dytto. We went live on May 3rd and had motivating amounts of traffic over the week. Next objective is to reach some potential customers and launching in a few weeks. We love to chat, so feel free to send us a message at Twitter ( @hkanaktas,  @mroguzhanaktas), or at hello[at]dytto[dot]co (We both check it).", "posttime": "2020-05-11 01:33:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,开发,开发人员,proper", "title": "在做了10年的开发人员之后，发布了我的第一个合适的产品", "title_en": "Published my first proper product after working as a developer for 10 years", "transed": 1, "url": "https://dytto.co/blog/how-it-all-began", "via": "", "real_tags": ["发布", "开发", "开发人员", "proper"]}, {"category": "", "categoryclass": "", "imagename": "f655691ffc8266bd5287f2e03913897e.jpeg", "infoid": 1001544, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "NovaStelo的灵感来自StarLogo和Scratch，更确切地说，书中的StarLogo出现在“海龟、白蚁、交通堵塞和Scratch 1.4”中。这两本书都出自雷斯尼克的伟大作品。\nNovaStelo基于Pharo Smalltalk 8.0构建。几乎所有的模型和UI都是使用Spec2重写的。\n您需要在更新前保留脚本文件，因为项目文件与任何以前的版本都不兼容。", "note_en": "NovaStelo is inspired from StarLogo and Scratch, more preciselyStarLogo on the book &#34;Turtles, Termites, and Traffic Jams&#34; and Scratch 1.4.Both are of Resnick&#39;s great works.\n NovaStelo is built on Pharo Smalltalk 8.0. Almost all Model and UI are rewritten using Spec2.\n       You need keep script files before update, because project files are incompatible with any previous versions.", "posttime": "2020-05-11 00:55:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,scratch,style,starlogo", "title": "基于MIT Scratch的多Agent系统块式编程环境", "title_en": "Block-style programming environment for multi agent system, based on MIT Scratch", "transed": 1, "url": "https://github.com/EiichiroIto/NovaStelo", "via": "", "real_tags": ["编程", "scratch", "style", "starlogo"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001541, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当威胁来袭时，在战术、操作和战略层面工作的网络安全专业人员需要快速有效地协同工作，以实现共同的网络安全战略，以防范对手。要以可重复、可扩展的方式做到这一点，取决于组织是否有能力发现和缓解其姿态上的差距，了解对手的交易技巧，以及实施和沟通防御性行动方案。\nUnfinter是一个社区驱动的开源工具套件，利用MITRE ATT&amp；CK™框架，将重点从指示器转移到基于行为的方法。这使您能够更有效地评估风险、提升安全态势，并以系统、可衡量和有意义的方式实施缓解措施。\nUnfinter Discover提供了一个工作流程，可帮助威胁报告人员、分析开发人员和网络防御人员在他们的同行和团队之间创建和共享复杂的网络威胁情报(CTI)数据。\nUnforter Disocover为网络专家构建工具，帮助他们创建、共享和使用复杂的网络威胁情报信息。威胁记者对海量的研究和报道很有意义，Analytic开发人员正在精心设计新的检测，Network Defender正在解决其网络中的差距，需要知道下一步要关注什么。\nUnfinter Analytic是一个原型，它允许开发人员熟悉ATT&CK™框架，以衡量其分析的有效性。编写分析并将其映射到您要检测的MITRE ATT；CK™技术。创建分析事件时，Kibana显示将显示事件周围的上下文。\n了解更多。\nUnstrater是开源的，正在寻找合作伙伴。如果您对新功能或新工作流程有想法，请让我们知道并在GitHub中提交问题。如果您是一名开发人员，并且对如何做出贡献有想法，我们欢迎您的拉取请求。我们很高兴每个人都能参加这个实验。\n无拘无束地下载", "note_en": "When the threat hits, cybersecurity professionals working at the tactical, operational, and strategic levels need to work together quickly and effectively enable a common cybersecurity strategy that protects against the adversary. To do this in a repeatable, scalable way depends on an organization’s ability to discover and mitigate gaps in their posture, understand adversary tradecraft, and implement and communicate defensive courese of action.\n  Unfetter is a community-driven suite of open source tools leveraging the  MITRE ATT&amp;CK™ framework, shifting the focus from indicators to a behavior-based methodology. This allows you to more effectively assess your risk, advance your security posture, and implement mitigations in a systemic, measurable, and meaningful way.\n  Unfetter Discover provides a workflow that helps Threat Reporters, Analytic Developers and Network Defenders create and share complex Cyber Threat Intelligence (CTI) data among their peers and across teams.\n  Unfetter Disocover builds tools for cyber experts to help them create, share and use complex Cyber Threat Intelligence information. Threat Reporters are making sense of the vast amount of research and reporting, Analytic Developers are crafting new detections, and Network Defenders are tackling gaps in their networks and need to know what to focus on next.\n Unfetter Analytic is a prototype that allows developers to gain familiarity with the ATT&amp;CK™ framework to measure the effectiveness of their analytics. Write analytics and map them to the MITRE ATT&amp;CK™ techniques you want to detect. When the analytic event is created, the Kibana display shows the context around the event.\n  Learn More\n  Unfetter is open source and looking for partners. If you have an idea for new functionality or a new workflow, let us know and submit an issue in  GitHub. If you are a developer and have ideas on how to contribute, we welcome a pull request. We’re excited for everyone to join the experiment.\n  Download Unfetter", "posttime": "2020-05-11 00:39:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国国家安全局,cyber,分析", "title": "美国国家安全局网络自由计划", "title_en": "NSA Cyber Unfetter Project", "transed": 1, "url": "https://nsacyber.github.io/unfetter/", "via": "", "real_tags": ["美国国家安全局", "cyber", "分析"]}]