[{"category": "", "categoryclass": "", "imagename": "d2960d74e9bddb39569edccb06aa34c4.jpg", "infoid": 1007900, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有时候，你可能会拥有太多的好东西。Git flow当然是这样，这是一个著名的软件开发工作流，它提供了几个选项，但可能会让用户陷入困境。\n我们开发GitLab Flow作为解决方案，以消除混乱的复杂性并简化开发过程。GitLab Flow为Git工作流程带来了问题跟踪，简化了流程并消除了混乱。\n要理解GitLab Flow是如何工作的，首先看看它试图解决的问题是很有帮助的。在Git flow中，有两个主要的痛点，这两个痛点都涉及不必要的分支切换。\nGit flow强制开发人员使用开发分支，而不是主分支。因为大多数工具默认使用主服务器，所以涉及到大量的分支切换。另一个令人沮丧的方面是Hotfix和Release分支，这对大多数组织来说是矫枉过正的，在实践持续交付的公司中是完全不必要的。\nGitLab Flow将功能驱动开发和功能分支与问题跟踪相结合。GitLab Flow将Git工作流与问题跟踪系统集成在一起，提供了一种简单、透明和有效的方式来使用Git。\nGitLab Flow是一种使代码和问题跟踪器之间的关系更加透明的方法。对代码库的每次更改都始于问题跟踪系统中的一个问题。当您完成编码或想要讨论代码时，可以打开合并请求。当代码准备就绪时，审阅者将把分支合并到主分支中，创建一个合并提交，使此事件在将来很容易看到。使用GitLab flow，团队可以通过将主代码合并到生产分支来部署新版本的代码，从而使他们能够快速识别生产中的代码。在此工作流中，仅向下提交流，以确保所有内容都在所有环境中进行测试。\nGitLab流程是一种从创意阶段转移到生产阶段的方式，同时让每个人都了解情况，提高工作效率。我们确定了软件投入生产所必须经历的开发过程的10个关键阶段。GitLab Flow可以轻松地说明所有问题，同时继续提供对开发生命周期的全面了解。\n一般而言，GitLab流程分为三个主要区域：特性分支、生产分支和发布分支。\n功能分支是重要的开发工作发生的地方。开发人员创建一个特性或错误修复分支，并在那里完成所有工作，而不是在主分支上。一旦工作完成，开发人员就会创建一个合并请求，将工作合并到主分支中。\n生产分支本质上是一个整体-单个长期运行的生产发布分支，而不是单个分支。可以为每个可部署版本创建一个标记，以便轻松跟踪这些细节。\n如果您向客户发布软件，最后一个部分，即发布分支是关键。对于每个新版本，您都会从master创建一个稳定的分支，并决定一个标记。如果您需要发布补丁，请确保首先精挑细选关键的bug修复，并且不要将它们直接提交给稳定分支。\n想要最大限度地利用GitLab流程吗？我们的首席执行官Sid Sijbrdij提出了团队应该始终遵守的11条规则，以实现最高效率。这个博客整体上值得一读，但这里有几条规则可以及时提醒您测试的重要性，即使在CI环境中也是如此：\n测试所有提交：不要等到所有内容都合并到主服务器中才进行测试。测试在此过程中进行提交，以便在流程的早期发现问题。\n并对所有提交运行所有测试，即使您必须并行运行测试。\n代码评审&gt；合并到MASTER中。希德写道：为什么要等呢？不要在周末测试所有东西。当场做，因为你更有可能抓到可能引起问题的东西，其他人也会努力想出解决办法。", "note_en": "Sometimes, you can have too much of a good thing. That’s certainly true with  Git flow, a well-known software development workflow that offers several options but can bog down users.\n We developed GitLab Flow as the solution to eliminate messy complexity and streamline the development process.  GitLab Flow brings issue tracking to the Git workflow, simplifying the process and removing confusion.\n  To understand how GitLab Flow works, it’s helpful to start by looking at the problems it tries to solve. In Git flow, there are two main pain points, both of which involve unnecessary branch switching.\n Git flow forces developers to use the  develop branch rather than the  master. Because most tools default to using the master, there’s a significant amount of branch switching involved. Another frustrating aspect is  hotfix and  release branches, which are overkill for most organizations and completely unnecessary in companies practicing continuous delivery.\n   GitLab Flow combines feature-driven development and feature branches with issue tracking. GitLab Flow integrates the Git workflow with an issue tracking system, offering a simple, transparent, and effective way to work with Git.\n GitLab Flow is a way to make the relationship between the code and the issue tracker more transparent. Each change to the codebase starts with an issue in the issue tracking system. When you’re done coding or want to discuss the code, you can open a merge request. When the code is ready, the reviewer will merge the branch into master, creating a merge commit that makes this event easily visible in the future. Using GitLab Flow, teams can deploy a new version of code by merging master into a  production branch, enabling them to quickly identify what code is in production. In this workflow, commits only flow downstream, ensuring that everything is tested in all environments.\n     GitLab Flow is a way to move from the idea stage to production, all while keeping everyone informed and productive. We identified  10 key stages of the development process that must happen in order for software to get into production. GitLab Flow makes it easy to account for all of them, while continuing to provide full visibility into the development lifecycle.\n Broadly speaking, GitLab Flow is broken down into three main areas:  feature branch,  production branch, and  release branch.\n A  feature branch is where the serious development work occurs. A developer creates a feature or bug fix branch and does all the work there rather than on a master branch. Once the work is complete, the developer creates a merge request to merge the work into the master branch.\n The  production branch is essentially a monolith – a single long-running production  release branch rather than individual branches. It’s possible to create a tag for each deployable version to keep track of those details easily.\n The last piece, the  release branch, is key if you release software to customers. With every new release, you’ll create a stable branch from master and decide on a tag. If you need to do a patch release, be sure to cherry-pick critical bug fixes first, and don’t commit them directly to the stable branch.\n  Want to get the most out of GitLab Flow? Our CEO  Sid Sijbrandij came up with  11 rules teams should always follow to achieve maximum efficiency. The blog is worth a read in its entirety, but here are a few rules are timely reminders of the importance of test, even in a CI environment:\n Test all commits: Don’t wait to test until everything has been merged into  master. Test commits along the way to catch problems earlier in the process.\n And run  all tests on all the commits, even if you have to run tests in parallel.\n Code reviews &gt; merging into  master. Why wait? &#34;Don’t test everything at the end of the week,&#34; Sid writes. &#34;Do it on the spot, because you&#39;ll be more likely to catch things that could cause problems, and others will also be working to come up with solutions.&#34;", "posttime": "2020-06-24 09:26:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "flow,git,分支", "title": "Git Flow的问题", "title_en": "The Problem with Git Flow", "transed": 1, "url": "https://about.gitlab.com/blog/2020/03/05/what-is-gitlab-flow/", "via": "", "real_tags": ["flow", "git", "分支"]}, {"category": "", "categoryclass": "", "imagename": "b1abace0661d79c86e799be8ebeea942.png", "infoid": 1007899, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一家价值数十亿美元的公司。获胜的总统竞选。幸福的婚姻。这三件事有什么共同之处呢？每一项成功的基础都是有效的沟通。\n有效的沟通具有积累财富和创造历史的能力。有了它，政府发生了变化，数十亿人的生活也随之改变。有了它，像亚马逊、苹果和阿里巴巴这样的企业就从默默无闻中崛起了。\n难怪所有成功的企业都需要强大的通信基础设施才能成长和繁荣。但这不是本文要讨论的内容。传播学的主题很广泛，你可以拿到它的博士学位。这篇文章必须是一本书，也许是三本，才能恰当地报道这个主题。\n这篇文章关注的是一个单一的概念，如果掌握了这个概念，就可以推动您的组织朝着正确的方向在数字工作环境中进行有效的沟通。概念是这样的：\n前段时间，我们发表了一篇文章，深入探讨了同步和异步通信。同步通信是实时发生的通信。这是一个在Zoom上的公司会议，或者是一个活跃的聊天室。异步通信是发生在…上的通信。不是实时的。这是你发送给客户的电子邮件，你知道要到几周后才会得到回复，或者是Zoom公司会议上发布的在线公告中的笔记。两者都很重要，因为不同类型的信息在不同的格式下效果最好。\n同步通信具有快速、即时、简洁的特点。信息就像河流一样流动--就像在聊天中一样。此格式最适合不确定和/或紧急的情况。这对一起探讨想法、讨论决策和处理危机情况都有好处。\n异步通信速度较慢，通常考虑得更周到，容量也更大。信息的收集就像水坝一样--就像在Wiki中一样。这种格式最适合于在事件发生后向实时通信添加上下文、组合详细信息以及解释复杂的概念。\n当在组织中适当地使用同步和异步通信时，通信就处于最佳状态，协作就会顺畅和容易。在数字化工作环境中，一些最常见的交流方式是聊天和维基。如前所述，聊天促进了同步通信，而Wiki促进了异步通信。\n增加组织中的有效沟通非常简单，只需让每个人都可以使用聊天和维基，然后明确每种类型的交互使用哪种媒介。换句话说，在数字工作环境中实现有效沟通的方法是：\n提供正确的工具-让所有团队成员都可以使用聊天和维基，让每个人都习惯使用它们。\n确保正确使用工具--通过对管理人员进行关于同步和异步通信概念的培训来做到这一点(或者“聊天就像一条河；Wiki就像一座大坝”。)。让他们以身作则，这样你组织的其他人就会效仿。\n在AirSend中，每个频道都有聊天部分和Wikition。聊天非常适合快速讨论新的发展，交换文章或信息的链接，以及安排进一步讨论的日程安排。Wiki非常适合存储、共享和协作更详细、更复杂的项目。\n将聊天和维基放在一个地方，与以前使用文档链接或附件来回发送电子邮件的模式相比，交流更加顺畅和高效。\n有效的沟通是强大的，而数字环境下有效沟通的关键因素之一就是在同步和异步沟通之间找到平衡。正确结合使用时，Chat和Wiki可以简化通信流程，实现整洁的协作，从而提高工作效率。", "note_en": "A multi-billion dollar company. A winning presidentialcampaign. A happy marriage. What do these three things have in common? Thefoundation of success in each is effective communication.\n Effective communication has the power to amass riches andmake history. With it, governments have been transformed, along with the livesof billions of people. With it, enterprises like Amazon, Apple, and Alibabarise from obscurity.\n It’s no wonder that all successful businesses need strongcommunication infrastructures in order to grow and prosper. But that’s not whatthis article is about. The topic of communication is so vast that you can get aPh.D. in it. This article would have to be a book, maybe three, to properlycover the topic.\n What this article focuses on is a single concept that, ifgrasped, can give your organization a big push in the right direction towardseffective communication in a digital work environment. The concept is this:\n    A while ago, we published an article that dives intosynchronous and asynchronous communication. Synchronous communication is communicationthat happens in real time. It’s a company meeting on Zoom or an active chatroom. Asynchronous communication is communication that happens… not in realtime. It’s that email you send to a client which you know you won’t get aresponse to until weeks later, or notes on that Zoom company meeting posted toan online bulletin. Both are important because different types of informationdo best in different formats.\n Synchronous communication is fast, immediate, brief. Informationflows like a river — as it does in a chat. This format is best for times of uncertaintyand/or urgency. It’s good for exploring ideas together, having discussions tomake decisions, and addressing crisis situations.\n Asynchronous communication is slower, usually moreconsidered and voluminous. Information gathers like a dam — as it does in aWiki. This format is best for adding context to real time communication afterit has happened, putting together detailed information, and explaining complexconcepts.\n    When synchronous and asynchronous communication are usedappropriately in an organization, communication is at its best and collaborationis smooth and easy. In a digital work environment, some of the most common modesof communication are chat and Wiki. As mentioned before, chat facilitatessynchronous communication and a Wiki facilitates asynchronous communication.\n Increasing effective communication in your organization isas simple as having both chat and a Wiki available to everyone and then makingit clear which medium to use for each type of interaction. In other words, theroadmap to achieving effective communication in a digital work environment is:\n Providethe right tools – Have chat and a Wiki available to all team members andget everyone accustomed to using them.\n Ensure the tools are used correctly – Dothis by training management on the concept of synchronous and asynchronouscommunication (or “ Chat is like a river;Wiki is like a dam.”) and have them lead by example so the rest of your organizationfollows.\n  In AirSend, each channel has both a chat section and a Wikisection. The chat is great for quickly discussing new developments, exchanging linksto articles or tidbits of information, and scheduling calls for furtherdiscussion. The Wiki is great for storing, sharing, and collaborating on more detailed,complex items.\n Having the chat and Wiki together in one place makes communicationmuch smoother and more efficient than the previous model of emailing back andforth with document links or attachments.\n   Effective communication is powerful, and one of the key factors of communicating effectively in a digital environment is finding the balance between synchronous and asynchronous communication. When used together correctly, chat and Wiki can streamline the communication process for clutter-free collaboration, resulting in increased productivity.", "posttime": "2020-06-24 09:25:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "communication,通信", "title": "数字化工作环境下如何实现有效沟通", "title_en": "How Effective Communication Can Be Achieved in a Digital Work Environment", "transed": 1, "url": "https://www.airsend.io/blog/index.php/2020/05/24/1-tip-on-how-effective-communication-can-be-achieved-in-a-digital-work-environment/", "via": "", "real_tags": ["通信"]}, {"category": "", "categoryclass": "", "imagename": "7cf484ceeae6bc7fc2161eddc603cd15.jpg", "infoid": 1007898, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "不久前，约翰·普莱斯和我为C语言发明了一个外部模块系统。它对我们很有效，但从未流行起来。也许这会对你们中的一些人有用。\nSloth是一个雄心勃勃的项目(可供2到3个人使用)的一部分，该项目名为Popshop(我在我的软件成功帖子中提到了这一点)。\n这一切开始时都是无害的-为什么我不编写一个Lucid解释器呢？\n一个相反的论点是：我已经有了一个，正如我在之前的帖子中已经提到的那样。这主要是A·福斯蒂尼的作品，他是我的第一个学生，也是博士后。它运行得很好，拥有1985年的Lucid书中使用的所有功能，以及出色的错误处理和UNIX逃逸功能，您还想要什么呢？\n但我有更大的抱负。在Lucid这本书出版后，我突然意识到，同样的原则也可以应用于类似的项目，例如，三维电子表格。\n福斯蒂尼的翻译帮不上忙。它(事实证明是明智的)是一个单一目的的程序，而且引导起来很笨拙。Faustini已经练习了我所说的今天的编程-产生了一些立即有用的东西，如果与明天的项目无关的话。\n我发誓我不会再犯同样的--在我看来--错误。我将为未来编程，并产生通用的可重用代码，这些代码可以用于未来的内涵编程项目；包括一些我甚至还没有想过的代码。\n我不知道那会有多难。我最终不得不实现像Sloth这样的整套工具，这些工具需要的工作量和独创性与我脑海中的任何未来项目一样多。我滑下了过度设计的滑坡路。\n但我就是不能让自己暂时写作，也不能为浮斯蒂尼翻译机写出一个单一目的的继任者。事实证明，这并不是一个好的职业选择。\n我开始计划所有项目之母，很快就明白了软件可以分成许多独立的组件。\n一个统一的主题是，所有未来的“可交付成果”(如电子表格)都将基于POP-2的数据类型和语法，就像plucid(Faustini实现的语言)一样。(这就是“Popshop”这个名字的由来。)。\nPOP-2已经消亡很久了，但加入了一些聪明的想法。它有数字、字符串、单词(原子)和嵌套列表，基本上与LISP相同。但是它使用了用户友好的中缀语法，就像pLucid和(我计划的)其他交付件一样。\n因此，显然我们需要一个实现POP-2数据类型的组件(我们称其为模块)。以及用于输入和输出这些数据类型的单独组件。以及用于POP-2中缀表达式的词汇和句法分析的模块。\n该计划是将表达式编译成在抽象机上运行的中间语言。所以我们需要编译器和抽象机器解释器的模块。\n然后是用于导出(需求驱动评估)、用于仓库(缓存)、用于仓库存储管理、用于…的模块。不胜枚举。\n在某种程度上，我们意识到我们将处理几十个模块。这听起来可能不是很多，但当你们只有三个人(我、约翰·普莱斯和学生马丁·戴维斯)时就是如此。每一个都应该是可单独编译的，并且都有一个.o文件以保持最新。仅Makefile(S)一项就会很大。\n因此，我们决定将该过程自动化，结果是SLOTH。它消除了makefile，允许单独编译，并使.o文件保持最新。它生成并执行复杂的c编译器命令。这对我们来说非常有效。\n基本思想是让模块成为一个目录(扩展名为.m)，内部包含定义模块的各种文件(例如，过程定义或启动代码)。Sloth将使用这些文件生成自己的文件，并将它们存储在.m目录中。特别是，它将生成并维护最新的.o文件。\n然后，要“编译”一个模块，需要使用“link module”命令LKM。如果foo是一个模块，那么LKM foo将更新foo的.o文件以及foo直接或间接依赖的所有模块的.o文件，启动一个大型编译，并生成一个名为foo的可执行文件。\n通常，最大也是最重要的文件是proc.i文件。它包含过程定义和模块外不需要的其他声明(例如类型声明)。\n模块还有一个var.i文件，其中包含其他模块在模块本身外部所需的变量声明。类似地，对于外部需要的宏、typedefs和其他声明，有一个fine.i文件。\n每个模块都有一个初始化代码的文件体.I，在加电时执行一次。\n在某种意义上，大多数模块需要其他更原始的模块可用。因此，每个模块都有一个文件导入，其中列出了这些模块的名称(不带.m扩展名)。模块不能直接或间接导入自身。\n用户通常不会进入.m目录并直接操作这些文件。相反，它们使用简单的命令：例如，vmdfoo在foo.m目录中显示fine.i文件，而mmpfoo调用编辑器来修改foo.m中的proc.i文件。\nsloth提供用于配置应用程序和生成可执行文件的单个命令。这是LKM(链接模块)命令。调用LKM foo将启动幕后精细计算，并在foo.m内创建许多文件。\n但是，这对用户是透明的。暂停后，LKM终止，并在调用它的目录中保留一个可执行文件foo。\n如果出于好奇心，你想知道懒惰是如何工作的，我建议你参考开头链接的那篇论文。在此期间，我将简要介绍一下(如果不完整的话)。\n第一步是生成由foo直接或间接导入的所有模块的列表；生成可执行foo所需的所有模块。换句话说，这是植根于foo的导入关系的传递闭包。该列表存储在SLOTH生成的USELLIST文件中。\n文件在用户列表中的显示顺序至关重要。简而言之，它首先是最原始的。更准确地说，如果模块X直接导入模块Y，那么Y必须出现在模块X之前(某处)。Sloth通过对导入关系执行拓扑排序来生成uselist。sloth直接或间接计算foo导入的每个文件的使用列表，而不仅仅是foo本身的使用列表。\n下一步是安排foo的用法列表上每个模块的.o文件都是最新的(我将跳过一些细节)。一旦最新的.o文件可用，Sloth就会启动编译，生成可执行文件foo。它创建了一个简短的.c文件，其过程main由对foo的用法列表的powerup例程(body.I文件)的调用组成，最原始的首先调用。最后一个被调用的是Foo本身的第一个Body I.。\n请注意，这不一定涉及大量编译。可能是Uselist上的大多数模块已经具有最新的.o文件，因为它们已经在另一个模块栏的Uselist上，并且已经为其调用了LKM栏。有了SLOTH，应用程序可以共享编译后的代码和源代码。\n早些时候，我们遇到了似乎别无选择，只能允许模块相互导入的情况--这是一种不可接受的情况。在这些情况下，模块A调用模块B中的过程以及模块B调用模块A中的过程似乎是不可避免的。\n考虑从空闲列表中存储分配存储的模块。当空闲列表耗尽时，它会执行标记并清除垃圾收集-这是通常的安排。\n如果模块STA需要动态存储，它显然需要导入sto并调用sto中返回新单元的过程。但另一方面，当空闲列表耗尽时，它需要调用sta中的一个过程，该过程标记sta不准备放弃的所有存储。一个圆形。\n解决方案是将对sta的回调设为匿名，这样sto就不必导入sta。我们向sto提供了我们称为jobjar的东西，即一组函数指针，以及一个将函数指针p添加到作业JAR的过程addjob(P)。在sta的powerup代码中，我们调用addjob(P)，其中p是指向标记存储STA要保留的函数的指针。\n然后，当自由列表用完时，sto首先标记它知道的所有信息，然后遍历作业JAR，调用其中的所有过程。这标记了导入sto的所有模块所需的所有存储空间(假设它们在初始化时都根据需要调用了addjob)。\n类似的情况多次出现。例如，假设模块mch实现抽象机。机器的工作原理是将程序与POP-2单词相关联，在表格中将单词与函数指针配对。例如，如果模块MAT执行矩阵命令，则MAT导入mch。但机器必须知道矩阵命令及其名称。\n解决方案是向MCH提供过程NEW COMMAND(W，P)，该过程NEW COMMAND(W，P)接受字W和函数指针P，并将W添加到与P相关联的命令表。MAT中的POWER UP代码将所有MAT命令添加到MCH中的指令表。\n懒惰最初是为了配置Pascal(！)。代码，直到我们意识到没有办法实现可扩展模块，因为Pascal没有等价的函数指针。\n有一个版本的Sloth，称为Lemur，它处理版本控制，但我将在稍后描述它。\n懒惰是可用的，如果你们中的任何人在博客上认为这可能是有用的。它目前没有被使用或维护，但是我们有标准C的源代码(不，我们没有愚蠢到把它结构成Sloth模块)。懒惰模块不如Python模块方便。Python模块具有大多数相同的功能(例如，按正确的顺序导入模块)，没有第三方应用程序带来的不便。开发懒惰换Python是没有意义的。\n另一方面，信不信由你，C语言仍然被广泛使用，如果你正在使用它，你会想要模块化。也许斯劳思可以帮助你把几十年前的技术更新几十年。", "note_en": "A while back John Plaice and I invented an  external module system for C . It worked pretty well for us but never caught on. Maybe it will be of some use to some of you.\n Sloth was part of an insanely ambitious (for 2 or 3 people) project called the  popshop (I mentioned it in my  software success post).\n It all started harmlessly enough – why don’t I write a Lucid interpreter?\n   One counter argument: I already had one, as I already mentioned in previous posts. It was mainly the work of A. Faustini, my first student and postdoc. It ran fine, had all the features used in the 1985 Lucid book, as well as excellent error handling and an escape to UNIX, What more could you want?\n But I had bigger ambitions. After the Lucid book appeared, it  dawned on me that the same principles could be applied to similar projects, for example, a  three dimensional spreadsheet.\n  Faustini’s interpreter would not be a help. It was (wisely, as it turned out) a single purpose program, and unwieldy to boot. Faustini had practiced what I call programming for today  – producing something that is immediately useful if not relevant to tomorrow’s projects.\n I vowed I wouldn’t make the same – in my opinion – mistake. I would program for the future and produce general purpose reusable code that could be used for future intensional programming projects;  including some that I hadn’t even thought of yet.\n I had no idea how hard that would be. I ended up having to implement whole tools like Sloth that required as much work and ingenuity as any of the future projects I had in mind. I slid down the slippery slope of overengineering.\n But I just couldn’t bring myself to write for the present, and produce a single purpose successor to the Faustini interpreter. Not a good career move as it turned out.\n  I started planning the mother of all projects and it immediately became clear that software could be divided up into a number of independent components.\n One unifying theme is that all the future ‘deliverables’ (like the spreadsheet) would be based, like plucid (the language Faustini implemented),  on the data types and syntax of  POP-2. (This is where the name “popshop” came from.)\n POP-2 is long dead but incorporated some clever ideas. It had numbers, strings, words (atoms) and nested lists, basically the same as LISP. But it used user-friendly infix syntax, as did pLucid and (I planned) the other deliverables.\n So obviously we’d need a component (let’s call them modules) that implements the POP-2 data types. And a separate component for inputting and outputting these data types. And modules for lexical and syntactical analysis  of POP-2 infix expressions.\n The plan was to compile expressions into an intermediate language that runs on an abstract machine. So we need modules for the compiler and the abstract machine interpreter.\n Then modules for eduction (demand-driven evaluation), for the warehouse (cache), for the warehouse storage management, for … and on and on.\n  At a certain point we realized we’d be dealing with dozens of modules. That may not sound like much but it is when there are only three of you (me, John Plaice, and student Martin Davis). Every one should be separately compilable, and have a .o file to be kept up to date. The makefile(s) alone would be huge.\n So we decided to automate the process and Sloth was the result. It eliminated makefiles, allowed separate compilation, and kept .o files up to date. It generated and executed the complex c compiler commands. It worked very well for us.\n The basic idea is to have a module be a directory (with a .m extension) and inside have the various files (e.g. procedure definitions or startup code) that define the module. Sloth would use these files to generate its own files and store them in the .m directory. In particular it would produce and maintain an up-to-date .o file.\n Then to ‘compile’ a module there was the ‘link module’ command  lkm. If  foo was a module then  lkm foo would update  foo’s .o files and those of all the modules  foo depended on directly or indirectly, launch a big compile, and produce an executable named simply  foo.\n  Normally the biggest and most important file is the  proc.i file. It contained procedure definitions and other and other declarations (e.g. type declarations) not needed outside the module.\n Modules also have a  var.i file of variable declarations needed outside the module itself, by other modules. Similarly, there is a  define.i file for macros, typedefs and other declarations needed externally.\n Every module has a file  body.i of initialization code to be executed once, at powerup.\n Most modules require other, in a sense more primitive, modules to be available. Every module therefore has a file  import which lists names of those modules (without the .m extension). A module cannot import itself directly or indirectly.\n Users don’t normally enter the .m directory and manipulate these files directly. Instead they use simple commands: for example,  vm d foo displays the  define.i  file in directory  foo.m and  mm p foo invokes the editor to modify the  proc.i file in  foo.m.\n  Sloth provides a single command for configuring an application and producing an executable. This is the  lkm (link module) command. Invoking  lkm foo launches elaborate behind the scenes computations and creates a number of files inside  foo.m.\n However this is transparent to the users. After a pause,  lkm terminates and leaves an executable file  foo in the directory in which it was invoked.\n If out of curiosity you would like to know how Sloth works, I refer you to the paper linked at the beginning. In the meantime I’ll present a brief if incomplete description.\n  The first step is to produce a list of all the modules imported directly or indirectly by  foo; all the modules required to produce the executable  foo. In other words this is the transitive closure of the import relation rooted at  foo. This list is stored in the Sloth-generated  uselist file.\n The order in which files appear in the uselist is crucial. Briefly, it is most primitive first. More precisely, if module X imports module Y directly, then Y must appear (somewhere)  before module X. Sloth produces  uselist by performing a topological sort on the import relation. Sloth computes the  uselist of every file  foo imports directly or indirectly, not just the uselist of  foo itself.\n  The next step is to arrange that the .o file of each module on  foo‘s uselist is present and up to date (I’ll skip some of the details). Once up to date .o files are available, Sloth launches a compile that will produce the executable  foo. It creates a short .c file whose procedure  main  consists of calls to the powerup routines (the  body.i  files) of  foo‘s uselist, most primitive first. The last to be called is the  body.i of  foo itself.\n Note that this does not necessarily involve a large number of compiles. It could be that most of the modules on the uselist already have up to date .o files because they have been on the uselist of another module  bar for which  lkm bar has already been invoked. With Sloth applications share compiled code as well as  source.\n  Early on we encountered situations where it seemed we had no choice but to allow modules to import each other – an unacceptable situation. In these situations it seemed unavoidable that module A call procedures in module B, and that module B call procedures in module A.\n Consider a module  sto that allocated storage from a free list. When the free list is exhausted, it does a mark-and-sweep garbage collection – the usual arrangement.\n If a module  sta needs dynamic storage it obviously needs to import  sto and call a procedure in  sto that returns a new cell. But on the other hand, when the free list is exhausted it needs to call a procedure in  sta that marks all the storage that  sta isn’t ready to relinquish. A circularity.\n The solution is to make the callbacks to  sta anonymous, so that  sto does not have to import  sta. We provide  sto with what we call a  jobjar, a set of function pointers, plus a procedure  addjob(p) which adds function pointer p to the job jar. In the powerup code of  sta we call  addjob(p) with  p a pointer to a function that marks the storage  sta wants to keep.\n Then when the freelist runs out  sto first marks everything it knows about then runs through the job jar calling all the procedures in it. This marks all the storage required by all the modules importing  sto (assuming they all called  addjob on initialization as required).\n Similar situations arose several times. For example, suppose module  mch implements the abstract machine. The machines works by associating procedures with POP-2 words, in a table pairing words with function pointers. If module, say,  mat implements matrix commands,   mat imports  mch. But the machine has to know about the matrix commands and their names.\n The solution is to provide  mch with a procedure  newcommand(w,p) that takes a word  w and a function pointer p and adds w to the command table associated with  p. The powerup code in  mat adds all the  mat commands to the instruction table in  mch.\n Sloth was originally developed to configure Pascal (!) code until we realized that there was no way to implement extensible modules, since Pascal has no equivalent of function pointers.\n  There is a version of Sloth, called Lemur, that handles versioning but I’ll describe it later.\n  Sloth is available if any of you out in blogland think is could be useful. It’s not currently used or maintained but we have the source code in standard C (and no, we weren’t dumb enough to structure it as Sloth modules). Sloth modules are not as convenient as, say, Python modules. Python modules have most of the same features (e.g. modules imported in correct order) without the inconvenience of a third party application. It wouldn’t make sense to develop Sloth-for-Python.\n On the other hand, believe it or not, C  is still very widely used, and if you’re using it, you’ll want to modularize. Perhaps Sloth can help you make decades old technology a few decades more up to date.", "posttime": "2020-06-24 09:24:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c++,sloth,模块", "title": "面向C++语言的外部模块系统--Sin of Sloth", "title_en": "The Sin of Sloth – an external module system for C", "transed": 1, "url": "https://billwadge.wordpress.com/2020/06/23/the-sin-of-sloth-an-external-module-system-for-c/", "via": "", "real_tags": ["c++", "sloth", "模块"]}, {"category": "", "categoryclass": "", "imagename": "518e925d3607f0b115068bc4d7158685.jpeg", "infoid": 1007897, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "MacOS中的一些新API，如低延迟HTTP Live Streaming，目前只对通过Mac应用商店分发的应用程序可用。这不是开放平台的工作方式。在开放平台上，所有客户端API都应该对所有应用程序可用，而不仅仅是那些平台供应商特别认可的应用程序。\n我说的不是苹果云服务的API，比如应用内购买、登录苹果或游戏中心。这些都是服务器端的，对使用它们的任何限制都不会使MacOS成为客户端的封闭平台。\n但是HTTP直播流是一个任何人都可以在他们的服务器上实现的协议，所以客户端API应该对所有应用程序都可用。\n还有许多其他API是拒绝向苹果支付每年99美元的开发者无法使用的：网络扩展，它可以让你的应用连接到VPN，管理Wifi连接，创建内容过滤器，或者代理DNS请求；自定义网络协议，它可以让你的应用在TCP或UDP的基础上构建协议。关联域，允许您的应用程序与您的域关联以访问共享密码或继续您的应用程序中的活动。使用Endpoint Security Extensions，用于防病毒软件等。DriverKit，它允许您编写在内核模式之外运行的驱动程序。除非您向苹果支付年税，否则这些API都不能供您使用。这不是开放平台的工作方式-你不应该向平台所有者支付租金，就像你不需要向W3C支付99美元的费用来构建VPN服务器一样。\n除了API之外，Catalina的系统卷是只读的。您可以将其设置为可写，但在重新启动时它将恢复为只读。开放平台可以有适合99%用户的默认值，并且可以隐藏更改它们的旋钮，例如必须在命令行上运行命令，但是一旦您这样做了，系统就应该尊重您的决定，而不是一直覆盖它。\n总而言之，Mac不再是一个开放的平台。我不会再买自用的了。我是在Windows笔记本电脑上写这篇文章的，这是我使用Mac作为主要平台近十年来购买的第一台笔记本电脑。", "note_en": "Some new APIs in macOS, like low-latency HTTP live streaming, are  available only to apps distributed via the Mac app store. This is not how an open platform works. On an open platform, all client-side APIs are expected to be available to all apps, not just those specifically blessed by the platform vendor.\n I’m not talking about APIs for Apple’s cloud services like in-app purchase, Sign In with Apple or Game Center. These are server-side, and any restrictions for using them don’t make macOS a closed platform on the client-side.\n But HTTP live streaming is a protocol that anyone can implement on their server, so the client-side API should be available to all apps.\n There are many other APIs that are not available to developers who refuse to pay Apple $99 a year:  Network Extensions, which lets your app connect to a VPN, manage Wifi connections, create a content filter, or proxy DNS requests.  Custom Network Protocols, which lets your app build protocols on top of TCP or UDP. Associated Domains, which allow your app to be associated with your domain to access shared passwords or continue an activity in your app.  Endpoint Security Extensions, for things like antivirus software. DriverKit, which lets you write drivers that run outside kernel mode. None of these APIs are available for you to use unless you pay Apple their annual tax. That’s not how an open platform works — you shouldn’t have to pay a rent to the platform owner, any more than you need to pay a $99 fee to the W3C to build a VPN server.\n Moving beyond APIs, Catalina’s system volume is read-only. You can make it writable, but it reverts to read-only on reboot. An open platform can have defaults that are right for 99% of users, and the knobs to change them can be hidden, such as having to run a command on the command-line, but once you do so, the system should respect your decision and not keep overriding it.\n In conclusion, the Mac is no longer an open platform. I won’t buy one anymore for personal use. I’m writing this from a Windows laptop, the first one I bought since using the Mac as my primary platform for almost a decade.", "posttime": "2020-06-24 09:06:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "mac,open", "title": "Mac不再是一个开放平台", "title_en": "The Mac is not an Open Platform anymore", "transed": 1, "url": "https://www.linkedin.com/pulse/mac-longer-open-platform-kartick-vaddadi", "via": "", "real_tags": ["mac", "open"]}, {"category": "", "categoryclass": "", "imagename": "d59627fd015955dd4bb7a2de6c822dd8.png", "infoid": 1007896, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我的第一张反馈画布很艰难。我记得之后的日子。我既生气，又沮丧，又难过，又高兴，又兴奋。这让我意识到我不习惯收到诚实的反馈。它对我的影响如此之大，以至于我真的不知道之后该做什么，也不知道该采取什么行动。\n4个月后，我有了第二张反馈画布。这一次感觉不同。工具没有改变。我做到了。在这4个月里，我学会了如何接收反馈，以及之后应该采取什么策略。我将与你们分享我自己的经验，我的团队给我的反馈，以及我根据这些反馈采取的行动。\n就像任何反馈一样，只有当人们了解你的时候，它才会起作用。我是说，我真的很了解你。真正的你。如果他们不这样做，他们的反馈将是肤浅、空洞和无用的。\n它之所以有效，是因为反馈在你的日常生活中是不变的。如果请求反馈不是一种习惯，那么这个工具就不起作用。\n它之所以有效，是因为你是那个请求反馈的人。你太主动了。你很谦虚，你知道你还有很多需要改进的地方。因为你想提高，对吧？\n基本上，你把一群人放在一个房间里，给你生命中最诚实的反馈。但愿能去。这是一种干预，但这是你自己要求的。这种形式非常类似于回顾，但团队正在分析的主题是您。\n在我目前工作的Creditas，我们给出的反馈分为7类，这些恰好是公司文化的基础：爱我们的客户，诚实无情，学得快，像老板一样思考，真正的团队精神，技术知识，勇士和赢得比赛。我们还会考虑到对您这一角色的人的期望。在这里，您可以找到一个示例，说明对技术主管的期望。将所有这些更改为适合您的上下文。\n在你日常生活中最亲近的人中挑选5到9个。与你真正共事的人。如果你像我一样带领一支队伍，他们一定会在那里。你的经理也应该在那里。\n选择一名协调人，他负责安排活动、保持一切正常、维护结构、解释反馈画布是如何工作的，并主持会议。可以是任何人。\n会议的时间在一到两个小时之间，这取决于你做的频率和你邀请的人的数量。使用倒计时计时器并使其可见。\n如果你想在开始前说点什么，那就说吧。我感谢每个人的光临，并要求他们尽可能诚实和直接，不带任何过滤。\n这是反馈画布的主要活动。这大约需要20分钟，其目的是从团队中的每个成员那里收到详细的反馈，并做出详细而有意识的自我评估。\n我知道回顾可以根据目标以不同的方式组织。但是，在反馈画布中，结构需要保持尽可能简单。将黑板分成3栏：优点、改进点和改进行动。每个人，包括你的团队和你自己，都会私下写下自己的观点，并在完成后填写黑板。有些球队一次填满棋盘一分。两种都试一试，看看哪种效果更好。有几条规则需要遵循：\n对于任何人写的每一点要改进的地方，他们也应该写一份改进行动作为建议。有时很难找到改进行动。当这种情况发生时，可以讨论反馈，你们可以一起找到一些东西。\n用第一人称写反馈：大卫，你很酷，而不是大卫很酷。反馈应该是直接的。\n您可以使用Groupmap或Miro，但任何其他在线板都可以。谷歌表格也可以。\n它大约需要5分钟，它的目的是比较你对自己的看法和别人对你的看法。本练习与规划扑克非常相似。椎间盘突出物。我只是用规划扑克作为一个例子，请不要把它作为一个真正的工具在你的日常生活中。请。请。\n为每个反馈类别做一个从1到5的注释。我们Creditas使用公司的原则和价值观。您应该根据您自己的上下文来调整它。\n3表示与预期一致，1表示大大超出预期，5表示大大低于预期。很少有1，也很少有5。你和你的团队同时私下投票，然后与所有人分享，以比较结果。\n你可以使用Mentieter，但我相信Google Sheet也可以。\n显示类别分数的结果，并将您的结果与您团队的结果进行比较。这个分数应该反映出您和您的团队刚刚在回顾板上放了什么。\n在左边，你可以看到我自己的评估。在右边，你可以看到我的团队给我的加权平均分。我以为我做了预期的事，但我本可以做得更多。然而，我的团队比我更看重我自己。\n从第二列和第三列开始。要改进的每一点都与其相关的改进行动一起阅读。你先把你自己的朗读出来。然后，主持人阅读剩下的内容。组织反馈画布的主要原因是需要改进的地方。在你的日常生活中，更容易收到关于好东西的反馈。这就是能让你进步的东西。\n不要同意或不同意反馈意见。现在既不是做这件事的地方，也不是做这件事的时候。不过，您可以要求澄清或举例说明。您还可以询问谁撰写了反馈。反馈不是匿名的。如果是的话，这整件事就只是个猜谜游戏了。\n以优点结束。你先大声读出你自己的评价。然后，主持人阅读剩下的内容。\n以下是我自己的回顾板上的一段摘录。只是要改进的要点和相关的改进行动。如果你感兴趣，我知道你会感兴趣，你可以在这里找到全部内容。免责声明！你会在那里找到英语、葡萄牙语和西班牙语。使用谷歌翻译。\n老实说--有时候我有伤害别人的感觉。我也不擅长安慰别人。\n老实说--我需要更小心地表达我要说的话。要做到极其诚实，还需要考虑其他人是如何看待反馈的。\n拥有者--有时你无法控制自己的激情。这会产生焦虑和挫折感，而不是领导角色的朋友。\n我要向你推荐几篇关于情商的文章和几本书。\n团队--你在不断进步，但你不能让别人像你一样进步。\n团队-让其他人在技术发现方面处于领先地位。帮助别人在会议上发表演讲。\n虽然没什么好惊讶的，但这需要处理的事情很多。你可以看到，每个人都在相同的观点上达成了一致。很可能你也是这样想的。\n第一步是开始思考每个人刚才说的话，几天后阅读你的反馈画布的结果。\n第二步是把结果带给你的团队领导或经理，并谈论它们。你需要与能帮助你找到正确战略和行动领域的人讨论结果。如果你没有经理，可以和导师谈谈。或者和朋友聊天。你需要帮助。\n因此，我去与我的团队领导和工程经理交谈，他们帮助我确定了4个主要行动领域：\n给别人更多提升的空间，帮助他们成长。我的团队里越早有人接替我的位置，我就能越早向前迈进。这将是我的主要关注点。\n不断提高软技能和情商。我发现当我饥饿、愤怒、孤独和疲倦时，我的软技能会变得更差。这对每个人来说都是正常的，但对于像我这样需要更多自我意识的人来说，这可能会更加激烈。我也会读几本关于这个主题的书。这需要时间。\n让别人有和我一样的热情。这不能直接做。热情和激情在一定程度上是有感染力的。我需要更好地了解我的团队成员的长处、短处和动机是什么。然后我就可以专注于创造合适的环境，让热情自发地出现。这需要耐心。\n向团队中的每一位成员提供诚实、真实的反馈。如果我和我的团队成员没有真正的联系，这是不可能的。建立真正的关系是困难的。我正在发起一项名为“诚实咖啡”的计划，让我更好地了解与我共事的人。老实说，我的反馈画布应该更苛刻，这会提高我的反馈的质量，也会提高我的团队给我的反馈的质量。\n您应该在几个月后再组织一次反馈画布会议。至少3个月后。不是更早。您需要时间来处理您刚刚收到的反馈。在下一次会议上，你的团队会提到你已经进步了。而且，理想情况下，他们会把反馈集中在其他话题上。\n反馈画布是一种工具，与任何工具一样，您需要使其适应您的上下文。在这里你可以找到另一篇以不同方式解释它的帖子，在这里你可以找到它的不同实现。\n第一次会议将是混乱的，你不会立即看到它的价值。可能吧。大多数公司不习惯给予诚实和直接的反馈。一开始，反馈画布会话可能看起来很多。但你需要从某个地方开始。\n非常感谢undra.com的插图。你可以半信半疑地订阅我的时事通讯，也可以不时地收到一封有更新消息的电子邮件。", "note_en": "My first  Feedback Canvas was tough. I remember the days after. I was angry, upset, sad, happy and excited at the same time. It made me realize that I was not used to receive  honest feedback. It affected me so much that I didn’t really know what to do afterwards nor what actions to take.\n 4 months later I had my second  Feedback Canvas. This time it felt different. The tool didn’t change. I did. In these 4 months, I learned how to receive feedback and what strategy to follow afterwards. I’m going to share with you my own experience, the feedback my team has given me and the actions I am taking based on that feedback.\n  As with any feedback, it only works if the people know you. And I mean, really know you.  The real you. If they don’t, their feedback is going to be shallow, empty, and useless.\n It works because feedback is  a constant in your day to day. If requesting feedback is not a habit, this tool doesn’t work.\n It works because you are the one who is requesting the feedback. You are being proactive. You are humble and you understand that you have so much to improve. Because  you want to improve, right?\n   Basically, you put a bunch of people together in a room to give you the most honest feedback of your life. Hopefully. It’s kind of an  Intervention but requested by yourself. The format is very similar to a retrospective but you are the subject the team is analyzing.\n In Creditas, where I currently work, we give feedback grouped in 7 categories, which happen to be the principles on which the company’s culture is built on:  Love our customers,  Brutally Honest,  Learn Fast,  Thinking like Owners,  True Team Players,  Technical Knowledge,  Warriors and Play to Win. We also take into account what is expected from somebody in your role.  Here you can find an example of what is expected from a Tech Lead. Change all this to what suits your context.\n  Pick  between 5 and 9 people you are closest to in your day to day. The people you really work with. If you are leading a team, as I am, they must be there. Your manager should be there too.\n Pick a facilitator who will take care of scheduling the event, keeping everything on track, maintaining the structure, explaining how the  Feedback Canvas works and moderating the session. Can be anyone.\n The session takes  between one and two hours depending on the frequency you do it and the amount of people you invited. Use a countdown timer and keep it visible.\n If you want to say something before starting, do it. I thanked everybody for coming and asked them to be as honest and direct as possible without any filter.\n  This is the main activity of the  Feedback Canvas. It takes around 20 minutes and its purpose is to receive detailed feedback from each member of your team and make a detailed and conscious self assessment.\n I know retrospectives can be  organized in different ways depending on the objective. However, in a  Feedback Canvas, the structure needs to be kept as simple as possible. Divide the board in 3 columns:  Good points,  Points to improve and  Improvement actions. Everybody, your team and yourself, writes their points privately and fill the board when they are finished. Some teams fill the board one point at the time. Try both and see what works better. There are a couple of rules to follow:\n For every  point to improve anybody writes, they should also write an  improvement action as a suggestion. Sometimes it is difficult to find an  improvement action. When that happens, the feedback can be discussed and you can find something together.\n  Write the feedback using the first person:  David, you are cool instead of  David is cool. The feedback should be direct.\n You can use  Groupmap or  Miro but any other online board will do. A Google Sheet would do too.\n   It takes around 5 minutes and its purpose is to compare how you perceive yourself with how others perceive you. The activity is very similar to a  Planning Poker. Disclarimer. I’m just using Planning Poker as an example, please don’t use it as a real tool in your day to day. Please. Please.\n Give a note from 1 to 5 for every feedback category. We in Creditas use the company principles and values. You should adapt it to your own context.\n 3 means  as expected, 1 means  hugely over expected and 5 means  hugely under expected. It’s rare to have a 1 and its rare to have a 5. Yourself and your team vote privately at the same time and then share it with everybody to compare the results.\n You can use  Mentimeter but I’m sure a Google Sheet would do too.\n  Show the results of the category score and compare your results with the ones from your team. This score should reflect what you and your team just put in the retrospective board.\n  At the left you can see my own assessment. At the right you can see the weighted average of the scores my team gave me. I thought I did what was expected but I could’ve done more. However, my team thinks a little bit more of myself than I do.\n  Start with the second and third column. Every  Point to improve is read together with its related  Improvement action. You read your own out loud first. Then, the facilitator reads the rest. The main reason of organizing a  Feedback Canvas are the  Points to improve. In your day to day it is easier to receive feedback about the good stuff. This is the what will make you improve.\n Don’t agree or disagree with the feedback. It’s not the place nor the time to do that. You can ask for clarifications or examples though. You can also ask for who wrote the feedback. The feedback is not anonymous. This whole thing would be just a charade if it were.\n Finish with the  Good points. You read out loud your own assessment first. Then, the facilitator reads the rest.\n Here is an excerpt from my own retrospective board. Just the  Points to improve and related  Improvement actions. If you are interested, and I know you are, you can find the whole thing  here. Disclaimer! You’ll find English, Portuguese and Spanish in there. Use Google Translate.\n HONEST - Sometimes I have the feeling of hurting other people. I’m also not good at comforting others.\n  HONEST - I need to be more careful of how I express what I have to say. Being brutally honest needs to also take into account how others perceive the feedback.\n  OWNER - Sometimes you don’t have control over your passion. That generates anxiety and frustration that are not friends of a leadership role.\n  OWNER - I’m going to recommend you some articles and a couple of books that talk about emotional intelligence.\n  TEAM - You are constantly improving but you don’t make others improve as much as you do.\n  TEAM - Let others take the lead in technical discoveries. Help others give a talk in a meetup.\n  Although nothing should come as a  surprise, this is a lot to process. You can see that everyone kind of agrees on the same points. And probably you do too.\n The first step is to start thinking about what everybody just said and read the results of your  Feedback Canvas a few days later.\n The second step is take the results to your  Team Lead or  Manager and talk about them. You need to talk about the results with somebody that can help you find the right strategy and the areas of action. If you don’t have a  Manager, talk with a mentor. Or talk with a friend. You need help.\n  So I went and talked with my  Team Lead and with my  Engineering Manager and they helped me identify 4 main areas of action:\n Give others more space to improve and help them grow. The sooner I have somebody in my team that can take my place the sooner I can move forward. This will be my main focus.\n  Keep improving soft skills and emotional intelligence. I identified that my soft skills get worse when I’m hungry, angry, lonely and tired. This is normal for everybody but it can be more drastic in people that need to be more self aware, like me. I’ll read a couple of books on this topic too. This will take time.\n  Make others have the same enthusiasm as I do. It can’t be done directly. Enthusiasm and passion are contagious up to a point. I need to understand better which are the strengths, weaknesses and motivations of the people in my team. Then I can focus on creating the proper environment for enthusiasm to appear spontaneously. This will require patience.\n  Give honest and true feedback to every member of the team. That won’t be possible if I don’t have a  real connection with the members of my team. Building true relationships is hard. I’m starting an initiative called  Honest coffee that’ll allow me to get to know better the people I work with. To be honest, my  Feedback Canvas shouldn’ve been harsher.This will improve my feedback’s quality and the quality of the feedback my team gives me.\n You should organize another  Feedback Canvas session some months later. At least 3 months later. Not earlier. You need time to work on the feedback you just received. On the next session your team will mention that you have improved. And, ideally, they will focus their feedback on other topics.\n  Feedback Canvas is a tool and, as any tool, you need to adapt it to your context.  Here you can find another post explaining it differently and  here you can find a different implementation of it.\n The first sessions will be messy and you won’t see its the value immediately. Probably. Most companies are not used to give honest and direct feedback. A  Feedback Canvas session may seem as a lot to begin with. But you need to start somewhere.\n Huge thanks to  undraw.com for the illustrations. You can subscribe to my newsletter  With a grain of salt and receive an email with updates from time to time.", "posttime": "2020-06-24 09:05:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "反馈,feedback", "title": "反馈画布。用于从您的团队接收诚实反馈的工具", "title_en": "Feedback Canvas. A tool for receiving honest feedback from your team", "transed": 1, "url": "https://stanete.com/feedback-canvas", "via": "", "real_tags": ["反馈", "feedback"]}, {"category": "", "categoryclass": "", "imagename": "e113636a761397328865bd16daeb89ae.png", "infoid": 1007895, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-周一，司法部逮捕了弗吉尼亚州原告律师蒂莫西·利岑伯格(Timothy Litzenburg)，在周二晚间公布的一份刑事起诉书中指控利岑堡试图向一家生产孟山都(Monsanto)农达除草剂所含产品的未具名化学制造公司敲诈2亿美元。根据司法部的说法，利岑伯格在10月和11月的几封电子邮件、电话和会议中告诉公司的外部律师，他将对这家化工公司发动大规模侵权攻击，除非他和两名联合律师获得2亿美元的“顾问”报酬。\n美国邮政检查局调查员凯文·托尔斯(Kevin Towers)在一份宣誓书中描述了这一所谓的阴谋。利岑伯格是2018年在加利福尼亚州法院为场地管理员德韦恩·约翰逊(Dewayne Johnson)赢得针对孟山都的里程碑式判决的审判团队的一员，由Gentry Locke的托马斯·邦杜兰特(Thomas Bondurant)和詹妮弗·德格劳(Jennifer DeGraw)代表。邦杜兰特周三晚些时候在一份电子邮件声明中说，我们认为利岑伯格先生没有犯下被指控的罪行。&#34；初步审查表明收费文件中存在错误，这引起了人们的关注。&#34；\n在被指控的阴谋发生时，利岑堡是Kincheloe Litzenburg&amp；Pendleton的名义合伙人。他的合伙人丹尼尔·金切洛(Daniel Kincheloe)是有限责任公司的注册代理人，据称该公司成立的目的是获得据称2亿美元咨询费中的最大份额。Kincheloe没有被指控有任何不当行为。他和合伙人达蒙·彭德尔顿(Damon Pendleton)没有回复我请求置评的电子邮件或电话信息。\n根据美国司法部刑事起诉书附带的宣誓书，利岑伯格涉嫌在10月份提出所谓的咨询费，此前他警告该公司未具名的外部律师，他可能会通过在一场公开提起的诉讼中将该公司列为被告，为该公司引发一场大规模侵权危机。\n根据宣誓书，在10月和11月的几次电话和电子邮件中，利岑堡据称详细说明了咨询安排的细节，要求2亿美元，并据称威胁称，如果公司不同意他的提议，它将面临大量索赔，这些索赔将耗资数十亿美元才能解决。据称，他形容2亿美元是一个“非常合理的价格”。\n该公司的律师于10月29日联系了司法部。此后，邮政检查员办公室记录了辩护律师与利岑堡的互动。据称，在一次电话录音中，利岑伯格表示，他引导客户远离对该公司的索赔是“合法和合乎道德的”。他还建议，在该公司一名毒理学家的诉讼前证词中，他可以“跳下去”，“问错误的问题”。\n据称的敲诈勒索计划发生时，利森伯格与米勒律师事务所的前同事进行了一场恶斗，他在那里开始了农达诉讼。根据Litzenburg在他最终对米勒公司提起的反诉中的描述，他在读到世界卫生组织认定草甘膦为可能的致癌物后，率先提起了农达诉讼。(孟山都坚定地为农达的安全性辩护，否认它与癌症有关。)。2008年毕业于里士满大学法学院(University Of Richmond Law School)的利岑伯格表示，他负责审查早期的农达原告，罢免孟山都的一些高管，并指导公司的发现。\n他还说，他发展并维护了米勒公司与包括Dewayne Johnson在内的Roundup客户的关系。2018年8月，约翰逊是第一个在陪审团审判中获胜的原告，这些原告声称，接触农达导致他患上了非霍奇金淋巴瘤。旧金山高等法院陪审团裁定约翰逊获得2.89亿美元的惩罚性和补偿性损害赔偿，导致孟山都母公司拜耳股价暴跌一天。主审法官后来将判决金额降至7800万美元。拜耳否认约翰逊的指控，已对判决提出上诉。\n根据Miller律师事务所在弗吉尼亚州奥兰治县巡回法院对Litzenburg的失职指控，Littenburg只是一名在高级律师指导下行事的非常初级的律师。该公司表示，到约翰逊案在旧金山受审时，利岑伯格正在从事“反复无常和令人不安的行为，比如发送无稽之谈的电子邮件和短信，以及跳过重要的会议。”\n米勒公司表示，它于2018年8月终止了利岑堡的雇佣关系。该公司在诉讼中声称，他挪用客户联系信息，并通过邀请米勒公司客户叛逃到他的新店，干扰了客户留存协议。利岑堡的反诉指控该公司诽谤和商业阴谋，声称包括约翰逊在内的米勒以前的客户认为利岑堡是他们的律师。\n双方本月早些时候达成协议，放弃对对方的索赔和反索赔。在一份关于对利岑堡的刑事指控的电子邮件声明中，迈克尔·米勒表示，他的公司一年多前就解雇了利岑堡。声明说：“利岑伯格先生与米勒律师事务所没有任何关系，米勒律师事务所与利岑伯格先生也没有任何关系。”\n重要的是要记住，目前，针对利岑堡的刑事案件是未经证实的指控。司法部尚未公开出示利岑堡据称发给该化工公司律师的电子邮件，也没有公布据称利岑堡会议和电话的录音。\n尽管如此，针对利岑堡的刑事起诉书读起来就像是对大规模侵权被告向原告律师抛出的所有丑陋批评的平反。侵权改革者不可能编造一个故事，让原告律师比政府对利岑堡的指控更令人痛心。\n显然，刑事起诉书中指控的那种不当行为是极其罕见的-但正是这些例外助长了人们对原告律师的看法。这里希望大规模侵权案件的律师将利岑堡的控诉解读为一个警示故事。", "note_en": "(Reuters) - The Justice Department arrested Virginia plaintiffs&#39; lawyer Timothy Litzenburg on Monday, alleging in a  criminal complaint unsealed late Tuesday that Litzenburg attempted to extort $200 million from an unnamed chemical manufacturing company that makes a product contained in Monsanto’s Roundup weedkiller. According to the Justice Department, Litzenburg told the company’s outside counsel in several emails, phone calls and meetings in October and November that he would launch a mass torts onslaught against the chemical company unless he and two co-counsel were paid $200 million as “consultants.”\n The alleged scheme was described in an affidavit from U.S. Postal Inspection Service investigator Kevin Towers. Litzenburg, who was part of the trial team that won a  landmark 2018 verdict against Monsanto in California state court for groundskeeper Dewayne Johnson, is represented by Thomas Bondurant and Jennifer DeGraw of Gentry Locke. &#34;We believe Mr. Litzenburg to be not guilty of the charged offenses,&#34; Bondurant said in an email statement late Wednesday. &#34;An initial review indicates inaccuracies in the charging document, which causes concern.&#34;\n  At the time of the alleged scheme, Litzenburg was a name partner of  Kincheloe Litzenburg &amp; Pendleton. His partner  Daniel Kincheloe was the registered agent of the limited liability corporation that was allegedly created to receive the lion’s share of the purported $200 million consulting fee. Kincheloe has not been charged with any wrongdoing. He and partner  Damon Pendleton did not respond to my emails or phone messages requesting comment.\n According to the affidavit accompanying DOJ’s criminal complaint, Litzenburg allegedly floated the purported consulting fee in October, after warning the company’s unnamed outside counsel that he could precipitate a mass torts crisis for the company by naming it as a defendant in a publicly-filed lawsuit.\n In several phone calls and emails in October and November, Litzenburg allegedly elaborated on the details of the consulting arrangement, according to the affidavit, demanding $200 million and allegedly threatening that if the company did not accede to his proposal, it would face an onslaught of claims that would cost billions of dollars to resolve. He allegedly described the $200 million as a “very reasonable price.”\n The company’s lawyers contacted the Justice Department on Oct. 29. Thereafter, the Postal Inspector’s office recorded the defense lawyers’ interactions with Litzenburg. In one recorded phone call, Litzenburg allegedly said it would be “legal and ethical” for him to steer clients away from claims against the company. He also suggested that he could “take a dive” and “ask the wrong questions” in a pre-suit deposition of a toxicologist from the company.\n The alleged extortion scheme took place as Litzenberg engaged in a vicious fight with former colleagues at the  Miller Law Firm, where he got his start in the Roundup litigation. By Litzenburg&#39;s account in  counterclaims he eventually filed against the Miller firm, he pioneered the Roundup litigation after reading that the World Health Organization identified glyphosate as a possible carcinogen. (Monsanto has staunchly defended Roundup&#39;s safety, denying that it is linked to cancer.) Litzenburg, a 2008 graduate of the University of Richmond Law School, said he was responsible for vetting early Roundup plaintiffs, deposing some Monsanto executives and directing discovery from the company.\n He also said that he developed and maintained the Miller firm’s relationships with its Roundup clients, including Dewayne Johnson. In August 2018, Johnson was the first plaintiff to prevail in a jury trial of claims that exposure to Roundup caused him to develop non-Hodgkin’s lymphoma. A San Francisco Superior Court jury awarded Johnson $289 million in punitive and compensatory damages, causing a steep one-day decline in the stock price of Monsanto parent Bayer. The trial judge later reduced the judgment to $78 million. Bayer, which denies Johnson’s allegations, has appealed the judgment.\n According to the Miller firm’s  breach of duty complaint against Litzenburg in Circuit Court in Orange County, Virginia, Liztenburg was just a very junior lawyer acting under the direction of senior attorneys. By the time of the Johnson trial in San Francisco, the firm said, Litzenburg was engaged in “erratic and troubling behavior,&#34; such as sending &#34;nonsensical emails and texts&#34; and skipping important meetings.\n The Miller firm said it terminated Litzenburg’s employment in August 2018. It alleged in its lawsuit that he misappropriated client contact information and interfered with client retention agreements by soliciting Miller firm clients to defect to his new shop. Litzenburg’s countersuit accused the firm of defamation and business conspiracy, asserting that onetime Miller clients, including Johnson, considered Litzenburg to be their counsel.\n The two sides reached an agreement earlier this month to drop claims and counterclaims against each other. In an email statement on the criminal charges against Litzenburg, Michael Miller said that his firm fired Litzenburg more than a year ago. “Mr. Litzenburg has nothing whatsoever to do with The Miller Firm nor The Miller Firm with Mr. Litzenburg,” the statement said.\n It’s important to remember that, at the moment, the criminal case against Litzenburg is unproven accusations. The Justice Department has not yet publicly produced Litzenburg’s alleged emails to the chemical company’s lawyers nor its purported recordings of Litzenburg’s meetings and phone calls.\n That said, the criminal complaint against Litzenburg reads like a vindication of all of the ugly criticisms that mass tort defendants throw at plaintiffs’ lawyers. Tort reformers could not have made up a story that casts plaintiffs’ lawyers in a more damning light than the government’s allegations against Litzenburg.\n Obviously, the sort of misconduct alleged in the criminal complaint is an extreme rarity – but it’s these exceptions that feed perceptions of the plaintiffs’ bar. Here’s hoping that mass torts lawyers read the Litzenburg complaint as a cautionary tale.", "posttime": "2020-06-24 08:47:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,指控,extortion", "title": "美国司法部指控农达原告律师2亿美元涉嫌敲诈勒索", "title_en": "DOJ charges Roundup plaintiffs' lawyer in $200M alleged extortion scheme", "transed": 1, "url": "https://www.reuters.com/article/us-otc-masstorts/doj-charges-roundup-plaintiffs-lawyer-in-200-million-alleged-extortion-scheme-idUSKBN1YM2L9", "via": "", "real_tags": ["美国", "指控", "extortion"]}, {"category": "", "categoryclass": "", "imagename": "c50c45f811a12c701c455340cdc31430.jpeg", "infoid": 1007894, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国医院协会(American Hospital Association)在阻止特朗普政府要求医院披露它们与保险公司谈判的秘密费率的法律申请中落败，这是特朗普总统的一项核心医疗政策倡议的胜利。\n美国哥伦比亚特区地区法院法官卡尔·尼科尔斯(Carl Nichols)周二做出的裁决是即决判决，这意味着该案虽然可以上诉，但没有开庭审理。他是由特朗普任命的。\n..。", "note_en": "The American Hospital Association lost its legal bid to stop the Trump administration from requiring hospitals to disclose secret rates they negotiate with insurance companies, a victory for one of President Trump’s central health-policy initiatives.\n  The ruling Tuesday from Judge Carl Nichols with the U.S. District Court for the District of Columbia was a summary judgment, meaning the case didn’t go to trial although it can be appealed. He was appointed by Mr. Trump.\n...", "posttime": "2020-06-24 08:46:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "政府,administration,特朗普", "title": "特朗普政府维护涵盖医院的价格透明度规则", "title_en": "Trump Administration Price-Transparency Rule Covering Hospitals Upheld", "transed": 1, "url": "https://www.wsj.com/articles/trump-administration-price-transparency-rule-covering-hospitals-upheld-11592945973", "via": "", "real_tags": ["政府", "特朗普"]}, {"category": "", "categoryclass": "", "imagename": "c1a63afe85f8b76143c46502d57860ea.jpg", "infoid": 1007893, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个女人正处于一段不幸福的婚姻中。在经历了巨大的压力和艰苦的工作，以及实验室里健康剂量的性别歧视之后，她还获得了化学博士学位。在以拉丁语荣誉毕业后，这位女士的研究生研究是关于不同化学物质的溶解性，包括汞、铜和其他工业中常用的重要金属。然而，她聪明而传统的丈夫-也是一位对工业感兴趣的初露头角的化学科学家-要求她在完成博士学位后留在家里。或者，如果她真的想用她的博士学位，那么她就必须担任他的翻译和助理，而不是寻找自己的学术职位。最重要的是，她还有一个儿子要照顾，这个儿子是在论文答辩一年后出生的。\n这是克拉拉·伊默瓦尔(Clara Immerwahr)的故事，她是德国第一位女性化学博士获得者，也是现代化学战悲剧中的主要人物。如果这是一部希腊戏剧，人们可以把她比作特洛伊的卡桑德拉-一个才华横溢的女人，她的智慧和所学的技能被忽视，只会带来破坏和悲剧。\n克拉拉·伊默瓦尔于1870年6月21日出生在现在的波兰。伊默瓦尔年轻时就对科学感兴趣，从小就和一位科学家父亲一起长大，父亲利用自己的技能成为了一名富有的农民。他鼓励女儿对自然界的兴趣，包括化学。尽管在德国，女孩们不能进入体育馆，这是当时进入大学所需的一步，但年轻的伊默瓦尔在私人家教的指导下学习，最终获得了相当于高中学位的学位。她于1896年开始在布雷斯劳大学学习，在那里她遇到了她未来的博士导师理查德·阿贝格和她未来的丈夫弗里茨·哈伯。1个。\n作为一名研究生，伊默瓦尔与阿贝格密切合作，这位科学家负责我们对物理化学中冰点的大部分了解。但是她的导师的友谊和她在这方面的天赋并没有阻止她的同事骚扰她。像今天的许多女性一样，伊默瓦尔记录了一份不公平待遇的书面记录，最终为了与同事的轻蔑和粗鲁的行为保持距离，她被转移到了另一个实验室。在为自己的论文辩护后，她嫁给了哈伯，哈伯当时正开始研究有机材料中常见的毒素，如氨和氯化物。\n起初，哈伯似乎是一对理想的搭档。他是一位才华横溢的学者，也是一位皈依基督教的人。哈伯和伊默瓦尔都是热衷于攻读化学学位的学者。哈伯专注于有机化学，最初太专注于与他的化学家同行建立新的关系。但最终，他发现伊默瓦尔相似的背景和智力可能会是很好的搭配，他们于1901年结婚。4.。\n正如任何一位现代学者都会告诉你的那样，既要管理一份要求很高的研究职业，又要管理一个带着年幼孩子的家庭，这可能是极其困难的。哈伯更进一步，他坚持说，在妻子生孩子之前，他是家里的第一位。他规定了Immerwahr可以如何以及在哪里工作，但也规定了她应该如何管理他们的家。他还要求伊默瓦尔不仅要担任他的助手，还要担任他的翻译。这对伊默瓦尔来说是残酷的，她真正的才华和激情在于研究，而不是为丈夫做文书工作。5个。\n虽然读者可能会认为伊默瓦尔职业生涯中的这一转折是战前欧洲学术界对女性的性别歧视的典型表现，但今天的许多女性可能都在阅读这篇文章时经历了类似的事情。即使在21世纪，女性-即使是才华横溢的学者-一旦结婚生子，也应该把家庭放在事业之前。6伊默瓦尔曾对一位朋友苦口婆心地说：“我从(研究)中得到的生命是非常短暂的。。。造成这种情况的主要原因是弗里茨把自己放在家庭和婚姻的第一位的压迫方式，这样一个不那么冷酷、自信的个性就被干脆摧毁了。\n更糟糕的是，世界在全球战争的边缘摇摇欲坠，伊默瓦尔的丈夫试图从中获利。哈伯研究了第一次世界大战前线使用的许多气体，从芥子气到赛克伦。伊默瓦尔是一名终身和平主义者，她对丈夫的研究感到震惊和厌恶，因为这将导致无数人丧生。\n伊默瓦尔不能实践她所接受的训练。她无法研究她擅长的化学。社会告诉她要支持她的丈夫，他的观点和自负与她所相信的一切背道而驰。她做出了激烈的举动，1915年在丈夫的手枪下自杀身亡。她年仅12岁的儿子赫尔曼发现她死在家里的花园里，子弹致命地刺穿了她的心脏。8个。\n她的故事是不幸的，但并不少见的，是了解不幸的婚姻和更不幸福的学者的窗口，也是哈伯作为“化学战之父”留下的残酷遗产的一个注脚。伊默瓦尔的遗产也有一线希望-克拉拉·伊默瓦尔奖表彰年轻的女科学家，如果有机会的话，这可能是伊默瓦尔想要的。\n布雷蒂斯拉夫·弗里德里希(Bretislav Friedrich)和迪特尔·霍夫曼(Dieter Hoffmann)，“克拉拉·伊默瓦尔：弗里茨·哈伯(Fritz Haber)阴影下的生活”，“百年化学战：研究、部署、后果”编辑。首页--期刊主要分类--期刊细介绍--期刊题录与文摘--期刊详细文摘内容。(Springer International Publishing，2017)，第45-67页。返回到文本。\n“Die Valenz and das Peridische System”。Verso einer Theorie der MolekularVerbindungen“[价态与元素周期表]。尝试一种分子化合物理论]。“组织化学报”(德文)39，第1期(1904年)：330-380。返回到文本。\n瑞安·卡蒂，“战争伤亡”，“化学遗产杂志”，第30期，第2期(2010)。检索于2018年3月22日。返回到文本。\nT.M.Heijstra和G.L.Rafnsdottir，“互联网和学者的工作量与工作-家庭平衡”，“互联网和高等教育”第13期，第2期(2010年)：158-163页。返回到文本。", "note_en": "A woman is in an unhappy marriage. After much stress and hard work, and a healthy dose of sexism in her lab, she’s also awarded a doctorate in chemistry. After having graduated with Latin honors, the woman’s graduate research is on the solubility of different chemicals, including mercury, copper, and other important metals commonly used throughout industry. However, her brilliant and traditional husband – also a budding scientist in chemistry with an interest in industry – demands that she stay at home once her doctorate is done. Or, if she really wants to use her PhD, then she has to serve as his translator and assistant, rather than seek out an academic position of her own. On top of this, she has a son to care for, born a year after defending her dissertation.\n This is the story of  Clara Immerwahr, Germany’s first female doctoral recipient in chemistry, and a main character in the tragedy that is modern chemical warfare. If this was a Greek drama, one could compare her to Cassandra of Troy – a brilliant woman whose wisdom and learned skills were ignored, only to bring devastation and tragedy.\n Clara Immerwahr was born on June 21, 1870, in what is now Poland. Immerwahr was interested in science as a young girl, growing up with a scientist father who used his skills to become a wealthy farmer. He encouraged his daughter’s interests in the natural world, including chemistry. Although girls could not attend the gymnasium in Germany, a step required to enter university at the time, the young Immerwahr studied under private tutors and eventually earned the equivalent of a high school degree. She began studying at the University of Breslau in 1896, where she met both Richard Abegg, her future doctoral adviser, and  Fritz Haber, her future husband.  1\n  As a graduate student, Immerwahr worked closely with Abegg, the scientist responsible for much of our understanding of freezing points within physical chemistry.  2 But her adviser’s friendship and her natural talent for the subject did not prevent her colleagues from harassing her. Like many women today, Immerwahr documented a paper trail of unfair treatment, and eventually transferred to a different lab in order to distance herself from her colleague’s dismissive and rude behavior.  3 After defending her dissertation, she married Haber, who was beginning work on common toxins seen in organic material, such as ammonia and chloride.\n At first, Haber seemed an ideal match. He was a brilliant scholar, as well as a fellow convert to Christianity. Both Haber and Immerwahr were passionate scholars pursuing degrees in chemistry. Haber was focused on organic chemistry, and initially was too preoccupied to invest much in a new relationship with his fellow chemist. But eventually, he saw that Immerwahr’s similar background and intellect would perhaps make a good match, and they were married in 1901.  4\n As any modern academic could tell you, it can be extremely difficult to manage both a demanding career in research and running a home with a small child. Haber took it one step further, and insisted that he, before his wife had any children, came first in the household. He dictated how and where Immerwahr could work, but also how she was expected to manage their home. He also demanded that Immerwahr should not only serve as his assistant, but also as his translator. This was brutal for Immerwahr, whose true talent and passion was in research, not than clerical work for her husband.  5\n While readers might recognize this turn of events in Immerwahr’s career as the typical of pre-war Europe’s sexism against women in academia, many women today are probably reading this having experienced something similar. Even in the 21st century, women – even talented academics – are expected to put their families before their careers once they marry and have children.  6 Immerwahr once said bitterly to a friend, “The life I got from (research) was very brief . . . and the main reasons for that was Fritz’s oppressive way of putting himself first in our home and marriage, so that a less ruthlessly self-assertive personality was simply destroyed.”  7\n To make things worse, the world teetered on the brink of global war, which Immerwahr’s husband sought to profit from. Haber worked on many of the gases used in the front lines in World War I, from mustard gas to zyklon. Immerwahr, a lifelong pacifist, was  horrified and disgusted by her husband’s research, which would lead to the loss of countless lives.\n  Immerwahr could not practice the work she had been trained to do. She could not research the chemistry that she excelled in. Society told her to support her husband, whose views and ego stood against everything she believed. She made a drastic move, dying by suicide with her husband’s pistol in 1915. Her son, Hermann, only twelve years old, found her dying in the family garden, the bullet having fatally pierced her heart.  8\n Her story is a tragic, but not uncommon, window into unhappy marriages and even unhappier academics, and remains a footnote in Haber’s own brutal legacy as the  “father of chemical warfare.” Immerwahr’s legacy has a small silver lining – the  Clara Immerwahr Award recognizes young female scientists, something Immerwahr would have perhaps wanted, had the opportunity been there for her.\n Bretislav Friedrich and Dieter Hoffmann, “Clara Immerwahr: A Life in the Shadow of Fritz Haber,” in  One Hundred Years of Chemical Warfare: Research, Deployment, Consequences, ed. Friedrich B., Hoffmann D., Renn J., Schmaltz F., Wolf M. (Springer International Publishing, 2017), 45-67.  Return to text.\n R. Abegg “ Die Valenz und das periodische System. Versuch einer Theorie der Molekularverbindungen” [Valency and the periodic table. Attempt at a theory of molecular compounds].  Zeitschrift für anorganische Chemie (in German) 39, no. 1 (1904): 330–380.  Return to text.\n Ryan Carty, “Casualty of War,”   Chemical Heritage Magazine, 30, no. 2 (2010). Retrieved March 22, 2018.  Return to text.\n   T. M. Heijstra and G. L. Rafnsdottir, “The Internet and Academics’ Workload and Work–Family Balance,”  The Internet and Higher Education 13, no. 2 (2010): 158-163. Return to text.", "posttime": "2020-06-24 08:28:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "immerwahr,研究", "title": "克拉拉·伊默瓦尔(Clara Immerwahr)：科学的悲剧和令人惊讶的现代女英雄", "title_en": "Clara Immerwahr: Science’s Tragic and Surprisingly Modern Heroine", "transed": 1, "url": "https://nursingclio.org/2020/06/16/clara-immerwahr-sciences-tragic-and-surprisingly-modern-heroine/", "via": "", "real_tags": ["immerwahr", "研究"]}, {"category": "", "categoryclass": "", "imagename": "ce65c382b5edeba4dde3fd0ffcd76cfe.jpg", "infoid": 1007892, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "弗吉尼亚州两名有执照的律师今天承认联邦敲诈勒索指控，承认他们在敲诈勒索一家跨国化工公司的计划中所扮演的角色，他们威胁称，如果他们要求伪装成所谓的“咨询协议”的2亿美元付款得不到满足，将对该公司造成重大的财务和声誉损害。\n弗吉尼亚州夏洛茨维尔38岁的蒂莫西·利岑伯格和弗吉尼亚州格伦·艾伦41岁的丹尼尔·金切洛今天在弗吉尼亚州西区的美国地方法官乔尔·C·霍普面前，分别承认了一项传输州际通讯意图敲诈勒索的指控。利岑堡和金切洛将于9月9日被判刑。2020年18日，在美国地区法院法官诺曼·K·穆恩(Norman K.Moon)面前。\n司法部刑事司助理司法部长布莱恩·A·本兹科夫斯基(Brian A.Benczkowski)说，“在这起案件中，两名律师远远越过了咄咄逼人的辩护界限，深入非法敲诈勒索的领域，厚颜无耻地试图通过从一家跨国公司榨取数百万美元来牟取暴利。”“今天的抗辩突显出，当犯罪发生时，律师会像所有公众一样，为自己的行为承担责任。”\n美国邮政稽查局(USPIS)主管督察Delany de Leon-Colon称，“敲诈勒索的后果深远，不仅影响到个人，也影响到美国经济和全球金融市场.”“那些在权力岗位上从事这类滥用职权行为的人应该知道，他们无法逃脱侦查.”他们将被找到，并将被追究其行为的责任。“。\n作为认罪的一部分，Litzenburg和Kincheloe承认，大约在2019年10月，Litzenburg找到一家公司(1号公司)，威胁要发表公开声明，指控1号公司生产用于除草的普通家用产品中使用的一种据称有害的化学物质，负有重大民事责任。Litzenburg和Kincheloe还承认，在描述了对1号公司提起破坏性诉讼的可能性后，Litzenburg总而言之地提议，他和Kincheloe。在Kincheloe知情和同意的情况下，要求1号公司向利岑堡、Kincheloe和其他公司支付据称总计2亿美元的“咨询费”。\nLitzenburg和Kincheloe还承认，在向一号公司提出2亿美元的要求后，他们注册了一家弗吉尼亚州的公司，目的是收取一号公司的钱，他们同意将一号公司的资金在他们自己和他们的同伙之间平分，不会将一号公司支付给他们的任何所谓的“咨询费”分配给现有客户。Litzenburg和Kincheloe承认，在提出2亿美元的要求后，Litzenburg威胁一号公司，他们和其他人会。]，这样的诉讼将花费1号公司及其上市母公司“数十亿美元，撇开相关的股价下跌和声誉损害。”\nLitzenburg和Kincheloe还承认，在Litzenburg写的一封电子邮件中，他们威胁1号公司，除非他们获得2亿美元，否则1号公司将有“数千名未来的原告起诉(1号公司)”，而且“如果没有所谓的‘全球’或与我达成最终协议，这肯定会对[1号公司]构成生死存亡的威胁。”\nLitzenburg和Kincheloe还承认，他们在弗吉尼亚州夏洛茨维尔的一个会议中心亲自会见了代表1公司的律师，在会议期间，Litzenburg再次威胁要损害1号公司及其母公司的财产和声誉，除非根据所谓的“咨询安排”向他们支付2亿美元，而且如果没有这样的交易，1号公司“无法以低于10亿美元的价格脱身”。嗯。不，我的意思是，滋扰价值，呃，辩护律师费，当这件事被立案和送达时，股票受到打击，也许是新闻发布会，无论是什么。“在同一次会议的晚些时候，利岑堡和金切洛承认，利岑堡再次声明，总而言之，部分原因是，如果他们开始诉讼，将对一号公司母公司的股价产生不利影响，利岑堡将其描述为”40%的股票损失来自顶部“。(注1)利岑堡和金切洛承认，如果他们开始诉讼，将对一号公司母公司的股价产生不利影响，利岑堡称其为”40%的股票损失来自顶部“。\nLitzenburg还承认，在与一号公司的其他沟通中，他告诉一号公司，如果他收到2亿美元的“咨询费”，他将不会与目前的客户讨论一号公司或其母公司，并表示他愿意在毒理学专家作证期间“尝试”，以阻止未来可能与针对一号公司的诉讼有关的索赔。\nUSPIS对此案进行了调查。刑事科欺诈科首席助理科长亨利·P·范戴克(Henry P.Van Dyck)和助理科长L·拉什·阿特金森(L.Rush Atkinson)正在起诉此案。\n刑事部门的诈骗科在司法部打击全国白领犯罪的斗争中发挥着关键作用。\n2020年是司法部成立150周年。我们可以在www.Justice.gov/Celebrating150周年网站上了解更多关于我们机构的历史。", "note_en": "Two licensed Virginia attorneys pleaded guilty today to federal extortion charges, admitting their roles in a scheme to extort a multinational chemicals company by threatening to inflict substantial financial and reputational harm on the company if their demands for a $200 million payment disguised as a purported “consulting agreement” were not met.\n Timothy Litzenburg, 38, of Charlottesville, Virginia, and Daniel Kincheloe, 41, of Glen Allen, Virginia, each pleaded guilty today to one count of transmitting interstate communications with the intent to extort, before U.S. Magistrate Judge Joel C. Hoppe of the Western District of Virginia.  Litzenburg and Kincheloe will be sentenced on Sept. 18, 2020, before U.S. District Court Judge Norman K. Moon.\n “This is a case where two attorneys blew well past the line of aggressive advocacy and crossed deep into the territory of illegal extortion, in a brazen attempt to enrich themselves by extracting millions of dollars from a multinational company,” said Assistant Attorney General Brian A. Benczkowski of the Justice Department’s Criminal Division.  “Today’s pleas underscore that when crimes are committed, members of the bar, like all members of the public, will be held accountable for their actions.”\n “The consequences of extortion are far reaching, affecting not only individuals, but also the economy in the United States and the world’s financial markets,” said Inspector in Charge Delany De Leon-Colon of the U.S. Postal Inspection Service (USPIS).  “Those who engage in this type of abuse of power while in positions of authority should know they cannot escape detection. They will be found and they will be held accountable for their actions.”\n As part of their guilty pleas, Litzenburg and Kincheloe admitted that in approximately October 2019, Litzenburg approached a company (Company 1) and threatened to make public statements alleging that Company 1 had significant civil liability for manufacturing a purportedly harmful chemical used in a common household product used to kill weeds.  Litzenburg and Kincheloe also admitted that after describing the possibility of damaging lawsuits against Company 1, Litzenburg proposed, in sum and substance, that he and Kincheloe enter into a “consulting arrangement” with Company 1 that would create a purported conflict-of-interest that would effectively stop them from representing their clients as plaintiffs in litigation against Company 1. Thereafter, Litzenburg and Kincheloe admitted that Litzenburg, with Kincheloe’s knowledge and agreement, demanded that Company 1 pay Litzenburg, Kincheloe, and others, a total of $200 million in purported “consulting fees.”\n Litzenburg and Kincheloe also admitted that after making their demand for $200 million from Company 1, they registered a Virginia corporation for the purpose of receiving monies from Company 1, and that they agreed to split the funds from Company 1 amongst themselves and their associates, and to not distribute any of the monies Company 1 paid them as purported “consulting fees” to their existing clients.  Litzenburg and Kincheloe admitted that after making their demand for $200 million, Litzenburg threatened Company 1 that they and others would commence litigation that would become “an ongoing and exponentially growing problem for [Company 1], particularly when the media inevitably takes notice[,]” and that such litigation would cost Company 1 and its publicly-traded parent company “billions, setting aside the associated drop in stock price and reputation damage.”\n Litzenburg and Kincheloe also admitted that in an email written by Litzenburg, they threatened Company 1 that unless they were paid $200 million, Company 1 would have “thousands of future plaintiffs against [Company 1,]” and that “in the absence of a so-called ‘global’ or final deal with me, this will certainly balloon into an existential threat to [Company 1].”\n Litzenburg and Kincheloe also admitted that they met in person with attorneys representing Company 1 at a conference center in Charlottesville, Virginia, and during that meeting Litzenburg again threatened to injure the property and reputation of Company 1 and its parent company unless they were paid $200 million pursuant to purported “consulting arrangements,” and that without such a deal there was no way Company 1 “gets out of it for less” than “[a] billion. Yeah. No, I mean, nuisance value, uh, defense lawyer fees, a hit in the stock when this gets filed and served, maybe the press conference, whatever.”  Later in the same meeting, Litzenburg and Kincheloe admitted that Litzenburg again stated, in sum and in part, that if they commenced litigation it would have adverse effects on Company 1’s parent’s stock price, which Litzenburg described as “a 40 percent stock loss coming off the top.”\n Litzenburg also admitted that, during other communications with Company 1, he told Company 1 that if he received the $200 million in “consulting fees” he would not discuss Company 1 or its parent company with his current clients, and that he was willing to “take a dive” during a deposition of a toxicology expert to deter potential future claims related to litigation against Company 1.\n The USPIS investigated the case.  Principal Assistant Chief Henry P. Van Dyck and Assistant Chief L. Rush Atkinson of the Criminal Division’s Fraud Section are prosecuting the case.\n The Criminal Division’s Fraud Section plays a pivotal role in the Department of Justice’s fight against white collar crime around the country.\n The year 2020 marks the 150th anniversary of the Department of Justice.  Learn more about the history of our agency at  www.Justice.gov/Celebrating150Years.", "posttime": "2020-06-24 08:28:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "癌症,cancer", "title": "农达癌症律师承认企图敲诈勒索", "title_en": "Roundup cancer attorney pleads guilty to extortion attempt", "transed": 1, "url": "https://www.justice.gov/opa/pr/virginia-attorneys-plead-guilty-orchestrating-200-million-extortion-scheme-targeting", "via": "", "real_tags": ["癌症", "cancer"]}, {"category": "", "categoryclass": "", "imagename": "c4cf73cc26115d93241a71c6abd2fc6d.jpeg", "infoid": 1007890, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "公平地说，我相当怀疑，所以我对人们认为天体的放置和运动对人类生活有任何影响的想法感到恼火。\n起初，我感到一阵烦躁。“哦，天哪，为什么我们要把这些东西都看得这么重呢？”\n然后，我看了一下对我推文的一些回复，@SaigonSyl有点说对了：所有同意我的人都是顺道而来的人。不管怎么说，白人顺从男人。\n今天我想起了这次交流，因为我的朋友瑞秋的超棒的占星术约会应用Strike刚刚在App Store上被禁止了。在几个月的开发过程中，他们所有的辛勤工作基本上都被扔进了垃圾桶。\n“我们遭到了一次又一次的拒绝，”Strike的联合创始人雷切尔·罗(Rachel Lo)说。\n9次拒绝，根据他们的指导方针“4.3设计-垃圾邮件”。\n在攻击性方面，这份指南将占星术(用他们的话说是“算命”)与“打嗝和放屁应用程序”并列在“垃圾邮件”的保护伞下。\n当我们最终按照我们在电话中采访的苹果员工的要求，一件一件地删除了占星术的每一个功能时，我们遇到了一些后退和新的毫无意义的借口。\n最近，我们被告知约会应用程序是不允许的，尽管事实是(1)两名苹果员工口头告诉我们约会应用程序是可以接受的，(2)我们知道在这段时间内有多个约会应用程序被接受，这显然表明了对我们的偏见。“。\n正是在这一点上，我想起了我今年早些时候的推文，以及@SaigonSyl对它的评论。来自Strike的蕾切尔继续说：\n“苹果垄断了应用程序的内容，毫不奇怪，他们禁止了女性、LGBTQ+和BIPOC用户最关注/庆祝的整个类别。”这些群体一直存在于科技世界的边缘，而且看起来他们将继续以这种方式存在。\n正如瑞秋指出的那样，从本质上讲，苹果的占星术禁令对女性领导的企业和开发人员的影响不成比例。\n另一位Strike的粉丝这样说：“Strike有潜力成为BIPOC、同性恋者和女性的真正社区空间-那些最常发现占星术有用/迷人/快乐的人。”\n为了完全透明，我认识瑞秋·洛。我们是朋友，她跟我讲了她买了Strike后不久的想法。\n我只记得我坐在那里说，“这真是个好主意！”\n这个想法很简单：根据人们的星座为他们配对约会。这真是太棒了--梳理了洛杉矶人喜欢的两件事：约会和占星术。\n在我看来，它在很多层面上都很精彩。首先，如果你和某人配对，它会给你这个美好的背景故事，让你了解你们未来的关系。\n想象一下，你在应用程序上遇到某人，你的故事不是“是啊，他们看起来很性感，在他们的个人资料中说了这个古怪的笑话”，你可以说“我们配对是因为我的太阳在摩羯座-第11宫！-他们的月亮在白羊座，所以当然行星在出生时排成一线，我们在这里，相爱了！”(我对占星术一无所知，很抱歉，如果那没有意义的话)。\n最重要的是，如果你找不到火柴，你就有了完美的借口。这并不是因为你的长相和性格让另一个人非常反感，而是因为愚蠢的冥王星在错误的时间出现在了错误的地点！\n瑞秋的应用程序也有一个很棒的名字，Strike-就像“追星族”中的名字一样-它的设计是为了杀手锏。我通过TestFlight加入了测试版，它看起来是这样的：\n我已经测试了几个月了，一直没有找到任何匹配的东西。当然，我归咎于天体-我几乎不知道还有另一个原因：这款应用程序没有获得足够的用户来让我进行潜在的匹配，因为它不允许在商店里使用。所以我对爱的追求从一开始就注定要失败。谢谢，苹果。\n为什么这家看似包容的巨型公司突然回击，反对两名开发了应用程序的有色人种女性(还有一名男性)？我是说，他妈的怎么会在那里联袂主演？\n雷切尔有一个理论：“这项规定在3月份悄悄生效(在我们已经进行了近6个月的开发之后)，所以他们有效地压制了联合主演可能面临的任何竞争。”\n在等待苹果回复的过程中，我决定联系@SaigonSyl(真名让·塞金特)--最初让我重新思考占星学想法的人--看看他们是如何看待这一切的。我给他们发了一封DM，他们很快就给我回了信。\n“我是一名作家、演员和社会学家，我所做的很多事情都是关于神秘主义和性别态度的。我在新西兰也和同性恋孩子一起做青年工作，现在占星术在同性恋圈子里占了很大一部分。“。\n“斯特雷克所经历的一切立即让我印象深刻的是，这完全是荒谬的。电子商务市场饱和度已经很高了，如果没有大型媒体集团的支持，作为一款应用程序出名是非常困难的，“Jean说。\n“Strike的开发者在分析为什么他们的应用很难被应用商店批准时一针见血：把关，以及让当权者的生活变得更容易的算法固有的偏见。”这是一些‘电脑说不’级别的废话！“。\n我问琼她对占星术的看法，并详述了她最初在推特上对我的小打击。\n占星术是一门古老的艺术，在整个人类创新时代，它比任何其他精神实践都更适合。火星，代表战争和男子气概的行星，也是主宰你的车的行星。别问我怎么做到的，我不开车。占星术有实际的日常用途，Co-Star应用程序的500多万用户可以证明这一点。使用占星术需要与无限宇宙的混乱和谐相处。这是一种轻松的方式，让你记住我们什么都不是。\n“女人、有色人种和同性恋都喜欢占星术，所以顺式白人不喜欢占星术。像时间一样古老的故事。当女性成为一种艺术、手工艺或行业的主要实践者时，男性就会成群结队地反对它。\n“男性对占星术的敌意植根于随和、随意的厌女症。对女性利益不屑一顾在社会上是完全可以接受的。整个行业，如时尚和八卦杂志，都是为了让女性感到愚蠢而发明的，让男性在他们的观点中感到舒服，一般来说，你知道我们都同意，她们只是愚蠢的伴侣。\n“受到打击的是一支多元化的企业家团队，他们拥有真正出色的想法，所以难怪这个人希望他们一事无成。”我个人需要一个占星术为基础的约会应用程序尽快人道，谢谢。我是个忙碌的女人，我没有时间和处女座的人偶然约会。我可不想再经历一次了！“\n你可以在这部她参与的纪录片“我们对占星术的热爱是什么？”中看到更多珍的思想。\n我为Rachel Lo和她的小团队所做的一切感到难过，我为苹果的禁令对其他POC和少数族裔开发者意味着什么而感到难过，我也为我感到难过，因为我仍然很悲伤，很孤独，没有任何约会对象。\n我将拭目以待，看看我是否会收到苹果的回音。截至撰写…时。没什么。\n我很好奇你是怎么看这一切的。您有过这样的App开发经验吗？你认为被击倒的球队发生了什么事？请在下面的评论中发声。\n如果你还想知道更多，我决定联系瑞秋，再问她几个关于这一切的问题。她的回答很有洞察力，我决定把它们完整地写在下面。\n这是个骇人听闻的问题，但你从哪里得到这个他妈的好主意的。你是怎么想到的？\n我受够了为大型科技公司工作和经历我生命中感觉像是一次重大的“清算”。随着我对生活、成功、事业和人际关系的看法正在动摇，我开始更多地把占星术作为一种自省的工具，而不是其他任何东西。\n我一直是一个非常注重科学的人(我学的是机械工程和材料科学)，过去我更反对东方的哲学和传统(作为一个在白人社区长大的亚洲孩子，这是一件需要拆开的事情)，但我开始意识到，拥有一种更容易用来用占星术的形式来表达同理心/情感的语言是有好处的。\n在我工作休息的时候，一位朋友提到，她希望能看到那些出生图和她的相吻合的人，然后她就灵机一动了。当然，也有其他应用程序像这样做过这样的事情，但没有一个是以现代、有趣、平易近人的方式做到的(我尊重的一款应用程序Align在它出现之前就出现了，并于2016年关闭)。\n我意识到，那些在占星术中找到价值的人往往更开放，更有同情心，这使得这款应用程序能够进行自我筛选，这是其他约会应用程序所不能做到的。\n你什么时候开始做的？从开始工作到被拒绝需要几个月的时间？\n我从2019年8月独立开始，2019年9月开始添加团队成员。我们在2020年1月开始通过一个私人的TestFlight Beta程序测试我们的应用程序，并在2020年4月初将其开放给公众进行Beta测试。\n我们测试了一段时间，以确保我们的应用程序在5月份提交给App Store进行审查之前得到了完善。然后我们经历了九轮拒绝，在一个多月的时间里，我们一点一滴地剔除了每一个占星术元素。当你开始做这个的时候，你能告诉我你的生活状况吗？比如，我说的对吗？你辞掉了工作，厌倦了科技界的蠢人，然后开始开发这个应用程序？我可能离这里太远了！\n我离开了旧金山的一份工作，因为我对科技行业非常感兴趣，并在这个行业工作了大约6年(大学毕业后直接进入了这个行业)。\n我本以为搬到洛杉矶的一份新的技术工作可以解决我在硅谷看到的一些弊病(性别歧视、种族主义、地位/财富痴迷)，但结果却意外地被我加入的初创公司的一名23岁的年轻人解雇(这完全是另一回事)。\n我决定以此为线索休息一段时间，停止寻找“下一件事”，烘焙一堆，并申请一个竞争过于激烈的烘焙比赛来取乐。\n当这一切结束后，我决定开始这个项目，不是因为我认为自己是一个企业家(这个词/头衔让我感到畏缩)，而是因为我厌倦了为不听我话的男人工作(我整个指挥链中只有一个女人，我一直在科技行业工作)。另一个黑客问题，但它让你有什么感觉，第一次被拒绝，还是暗示有麻烦？\n一开始，我们只是感到很惊讶，说实话。我们一直在担心潜在的商业模式、设计和应用程序的质量，并确保我们已经准备好为用户提供良好的体验。\n我们从来没有认真考虑过苹果本身会成为我们最大的障碍，他们的理由会如此完全有偏见/主观。\n公平地说，应用程序提交指南在2020年3月悄悄地进行了更新，将“算命”列为“垃圾邮件”类别。\n我们确实看到过一篇关于这方面的文章，但因为1)严格来说我们不是算命应用，2)我们几个月前已经在TestFlight上获得批准，没有任何问题，我们认为这条规则不会影响我们。此外，他们甚至在自己的指导方针中规定，基于高质量或独特的应用体验，这些规则也有例外。当你显然不可能获胜的时候，你当时有什么感觉？\n在第九次被拒绝之后，我们感到非常沮丧。我们在提交的每一篇文章中都一块一块地提取了占星术的元素，希望如果我们稍微“分散”一下占星术，他们会更容易接受我们的应用程序。\n到最后，我们几乎没有任何与占星术相关的东西了，他们仍然以同样的理由拒绝了我们。\n当我们回答说我们的应用程序里实际上没有任何占星术时，他们反驳说，这是因为这是一个约会应用程序，所以被认为是“垃圾邮件”。\n(尽管苹果的两名代表在电话中告诉我们，约会应用是可以接受的。我们后来意识到，他们在电话中进行了所有这些争执的谈话，所以没有书面证据来追究他们对自己的承诺的责任。)。\n令我感到格外讽刺的是，几乎就在苹果宣布支持代表性不足的社区的重大举措的同一天，他们给了我们这个武断的拒绝。\n我的呼吁(发布在Instagram上的)说明了为什么称占星术为“垃圾邮件”是对女性、POC和LGBTQ+社区的冒犯，但他们继续声称，这不是他们的哲学决定，而是一个“商业决定”。\n我真的觉得这纯粹是他们的商业决定。\n一款通过TestFlight在两周内产生超过800次下载量的应用程序(大多数人都没有听说过这款应用，如果你不是一个“科技人”，它看起来有点欺骗人/吓人)，再加上来自多个风险投资家的下载，以及对更广泛可用性的有机需求，这看起来绝不是一个“糟糕的商业决定”。\n我们从苹果(或其他方面)收到的反馈中，没有一个与这款应用程序本身的低质量或垃圾信息有关-问题只是它有占星术。\n只要仔细研究一些粗略的数学就行了。我和我的联合创始人亚历克斯自9月份以来一直在全职从事这项工作-这至少是2500个工时，但可能更多。\n我们还有另外4个人在不同的职位上帮助我们设计、开发和咨询，总共至少增加了几百个小时。我们也在开发和建设公司上花费了数万美元。\n亚历克斯·卡尔金斯(Alex Calkins)是我的联合创始人，也是这款应用程序的大部分开发人员。(他也是唯一一个以任何方式、形状或形式真正接触过这款应用的人。)。Octavia Sulea帮助我们开发了一些后端架构和数据处理。艾米·尤索菲是我们的运营经理。纳丁·简(首席戈登)是我们的占星术顾问。这个华丽的界面是谁设计的？\n克里斯蒂娜·奥尔福德(Kristina Alford)是我的好朋友，也是我的前同事，她做了大部分华丽的品牌设计和网站工作。亚历克斯和我随后将其转化为大部分应用程序设计/界面。好吧，我之所以对你的应用程序想了很多，部分原因是我发了一条讨厌占星术的推文，并得到了回复。你到底发生了什么，这看起来很明显，对吧？\n一方面，我发现自己在想，“占星术是一件愚蠢的事情，特别是当现在世界上有如此重大的问题正在发生的时候。”\n但另一方面，令我愤怒的是，这些将女性、POC、同性恋和任何其他不是顺从男性的群体边缘化的体系在我们的生活中运行得如此之深。\n大多数人甚至没有意识到，在库比蒂诺的某个地方，一个白人男子正坐在会议室里，决定哪些类别的应用程序可以下载到你的手机上，甚至不能下载到你的手机上。\n在某个地方，一组男性决定，三四个版本的Word With Friends充斥着令人眼花缭乱的广告是可以的，而试图联系兴趣相似的人的应用程序则不可以。\n即使占星术只是作为更多休闲爱好者的一种娱乐形式，这项政策也是在说，“那些发现占星术在任何方面都有用/娱乐/解放的人都不配拥有这个欢乐的时刻，无论他们多么渺小或卑微。”\n在光谱的另一端，占星术是一种数千年前的做法，深受许多非西方国家的推崇，即使在今天也是如此。苹果有能力完全压制这一类别，这令人担忧。更不用说占星术在这些群体中的受欢迎程度，这意味着这些类型的应用程序更有可能是由那些在科技界最常被忽视的人开发的。\n事情是这样的：亚历克斯和我来自特权家庭。我们受过很好的教育，而且对科技世界的机制非常熟悉，我们在这个领域工作了很多年。我无法想象，对于一个年轻人或新手来说，独自在卧室里从事这样的项目，希望建立一些与他人分享的东西，会是什么样子。带着这个应用程序从这里到哪里去？\n我们会大做文章，我们会毫不留情地评论丽莎·杰克逊(负责环境、政策和社会倡议的副总裁)在Instagram页面上的言论，我们会努力让自己的声音被听到。但除此之外，我们感到相当无能为力。\n老实说，他们可能就是这么喜欢的。“在过去的几周里，由于一款名为嘿的应用被App Store拒绝，苹果违反垄断的行为引起了很多议论，虽然我完全同意这些政策是腐败的，但很少有人提到他们政策的另一个阴险的一面。\n这是不会影响普通“科技人”的一面，因此不太可能引起注意，更有可能被忽视/忽视。和生活在一起呢？我知道你一直在烘焙并把收益捐给blm…。\n我不确定-我目前有很多空闲时间，我一直在关注最新的新闻，试图尽我所能保持活跃，负责任地参加抗议活动，通常不会睡太多觉。\n我一直没有那么多烘焙，但如果我们不能打通苹果，志愿者烘焙肯定会有更多的人。\n谢谢，瑞秋。饶有兴趣地观看和等待。还他妈的定了规矩，顺便说一句。我想在这个世界上看到它。", "note_en": "It’s fair to say I am fairly sceptical, so part of me gets annoyed at the idea of people engaging with the idea that the  placement and  movement of celestial bodies is of any consequence to human life.\n   Initially, I felt a twinge of annoyance. “ Oh God, why do we have to take all this stuff so seriously?”\n Then I looked at some of the replies to my tweet, and  @SaigonSyl was kinda bang on: All the people agreeing with me were cis men. And for what it’s worth, white cis men.\n I was reminded of this exchange today, because my friend Rachel’s fucking great astrology dating app,   Struck, has just been  banned from the App Store. Months and months in development, all their hard work essentially put in the bin.\n “We were met by rejection after rejection,”  says Rachel Lo, Struck’s co-founder.\n   “Nine rejections, on the basis of their guideline “4.3 Design - Spam.”\n Offensively, this guideline groups astrology (“fortune telling” in their words) alongside “burp and fart apps” under the umbrella of “spam.”\n And when we finally stripped out each astrology feature piece by piece as requested by the Apple employees we spoke to on the phone, we were met by backpedaling and new excuses that didn’t make sense.\n Most recently, we were told dating apps aren&#39;t being allowed despite the fact that (1) two Apple employees told us verbally that dating apps were acceptable and (2) we know of multiple dating apps that have been accepted over this timeframe, demonstrating an apparent bias against us specifically.”\n It was at this point that I remembered my tweet earlier this year, and  @SaigonSyl’s comment on it. Rachel from  Struck went on:\n “Apple has a monopoly over app content and it&#39;s no surprise they&#39;ve banned an entire category that&#39;s most observed/celebrated by female, LGBTQ+, and BIPOC users. These groups have always existed on the peripheries of the tech world, and it appears they will continue to exist this way.”\n Essentially, as Rachel points out, Apple’s astrology ban disproportionately affects female-led businesses and developers.\n Another fan of   Struck put it this way: “ Struck has the potential to be a real space of community for BIPOC, Queer People, and women — those who most frequently find astrology useful / fascinating / a source of joy.”\n   For full transparency, I know Rachel Lo. We’re friends, and she told me about her idea for  Struck not long after she’d had it.\n And I just remember sitting there going, “ This is a such a good idea!”\n The idea was simple: Matching people for dating based on their star signs. It was brilliant — combing two things people in LA love: Dating, and astrology.\n In my mind, it was brilliant on so many levels. For one thing, if you matched with someone, it would give you this wonderful backstory to your future relationship.\n Imagine meeting someone on an app, and instead of your story being, “ Yeah, they looked hot and said this quirky joke in their profile lol”, you could say “ we matched because my sun is in Capricorn — the 11th house! — and their moon was in in Aries, so of course the planets aligned at birth and here we are, in love!” (I don’t know anything about astrology so sorry if that makes no sense).\n  On top of this, if you got no matches, you had the perfect excuse. It wasn’t because your looks and personality were absolutely repulsive to another human — it was because stupid Pluto was in the wrong place at the wrong time!\n Rachel also had a great name for her App,  Struck — as in ‘star-struck’ — and the design was to kill for. I joined the beta via  TestFlight, and this is what it looked like:\n   I’d been testing it for a few months, and hadn’t been getting any matches. I blamed the celestial bodies, of course — little did I know there was another reason: The app wasn’t getting enough users for me to potentially match with, because it wasn’t allowed on the store. So my quest for love was doomed from the start.  Thanks, Apple.\n   Why the sudden push back from this giant, seemingly inclusive corporation, against two women of colour (and one dude) who’d made an app? I mean, how the fuck is  co-star on there?\n Rachel has a theory: “The rule quietly went into effect in March (after we had already been in development for almost 6 months), so they’re effectively squashing any competition  co-star might face.”\n  As I waited for Apple to reply, I decided to reach out to  @SaigonSyl (real name Jean Sergent) — the person who originally got me rethinking my thoughts on astrology — to see what they made of all this. I sent them a DM, and they got back to me pretty quickly.\n “ I’m a writer, actor and sociologist, and heaps of what I do is about mysticism and gender attitudes. I also do youth work with queer kids in NZ, and astrology is such a huge part of queer circles now.”\n  “What strikes me immediately about what  Struck is going through is that it is completely ridiculous. E-commerce market saturation is already so heavy, and making a name for yourself as an app is so difficult without the backing of a larger media conglomerate,” said Jean.\n “The developers of  Struck have hit the nail on the head in their analysis of why it&#39;s so hard for them to get their app signed off by the app store: gatekeeping, and the biases built in to algorithms that make life easier for people in power. This is some ‘computer says no’ level bullshit!”\n I asked Jean for her take on astrology, and to expand on the small hit she originally tweeted at me.\n “Astrology is an ancient art, and has adapted throughout the eras of human innovation more than any other spiritual practice. Mars, the planet of war and masculinity, is also the planet that rules over your car. Don’t ask me how, I don’t drive. Astrology has practical, everyday uses, as the over five million users of  Co-Star app could attest to. Using astrology involves living in harmony with the chaos of the infinite universe. It’s a relaxing way to remember that we are nothing.\n “Women, people of colour, and queer people love astrology, and therefore cis white guys don’t like it. Tale as old as time. When women become the dominant practitioners of an art, craft, or industry, then men turn against it in droves.\n “Male hostility towards astrology is rooted in easy going, casual misogyny. It’s totally socially acceptable to be dismissive of women’s interests. Entire industries, like fashion and gossip magazines, have been invented to keep women feeling dumb, and keep men comfortable in their opinions that women are, just generally, and y’know we can all agree,  they&#39;re just dumb mate.\n “ Struck are a diverse team of entrepreneurs with a genuinely brilliant idea, so no wonder the man wants them to go nowhere fast. I personally need an astrology-based dating app as soon as humanly possible, thanks. I’m a busy woman, I haven&#39;t got time to accidentally date a Virgo. I’m not going through that again!”\n You can watch more of Jean’s thoughts in this short documentary she’s a part of - “  What’s With Our Love of Astrology?”.\n   I’m sad for Rachel Lo and what she made with her tiny team, I’m sad for what Apple’s ban means for other POC and minority developers, and I’m sad for me, who is still sad and alone and without any dates.\n I will wait to see if I hear back from Apple. As of writing… nothing.\n And I’m curious what you make of all this. Have you had an experiences like this with App development? What do you think of what’s happened to the  Struck team? Sound off in the comments below.\n And if you want more, I decided to get in touch with Rachel and ask her a few more questions about all this. Her answers were so insightful, I decided to just include them in full below.\n       This is a hack question, but where did you get this great fucking idea. How did it come to you?\n I was fed up with working for big tech companies and going through what felt like a big “reckoning” in my life. As my ideas of life, success, career, and relationships were being shaken up, I started turning more to astrology as a tool for introspection more than anything else.\n I’ve always been a very science-focused person (I studied Mechanical Engineering &amp; Materials Science), and used to be more opposed Eastern philosophies and traditions (which is a whole thing to unpack as an Asian kid growing up in a white community), but I started seeing the benefits to having a more readily available language to express empathy/emotions in the form of astrology.\n During a break I was taking from working, a friend mentioned that she wished she could just see people who had birth charts that meshed with hers, and it clicked. There have of course been other apps that have done things  like this, but none in a modern, fun, approachable way (one app I respect for doing this,  Align, came before its time and shuttered in 2016).\n I realised that the types of people who find value in astrology tend to be more open-minded and empathetic, making the app self-screening in a way that other dating apps aren’t.\n When did you start working on it? And how many months from starting work on it, till rejection?\n I started independently in August 2019, and started adding team members in September 2019. We started testing our app via a private TestFlight beta program in January 2020, and opened it up for public beta testing in early April 2020.\n We tested for a while to make sure our app was polished before submitting it to App Store for review in May. We then went through nine rounds of rejections as we stripped out each astrology element bit by bit over the course of a month+.    Can you fill me in on your life position when you started this? Like, am I kinda right you left your job, sick of stupid men in tech and you started working on this app? I may be way off here!\n I had left a job in San Fransisco after feeling really over the tech industry and working in it for about 6 years (went straight into it after college).\n I thought moving to a new tech job in LA would solve some of the ills I saw in Silicon Valley (sexism, racism, status/wealth obsession) but ended up getting unexpectedly fired by a 23 year old at the startup I joined (which is a whole other story).\n I decided to take that at as a cue to take some time off, stop looking for “the next thing,” bake a bunch, and apply for an overly competitive baking competition for fun.\n Once all that wrapped up, I decided to start on this project not because I saw myself as an entrepreneur (that word/title makes me cringe) but because I was sick of working for men (I’ve had exactly ONE woman in my entire chain of command my entire time working in tech) who didn’t listen to me.    Another hack question but how did it make you feel, the first rejection, or hint at trouble?\n At first we were just surprised to be honest. We had spent all this time worrying about the underlying business model, the quality of the design and app, and making sure we were ready to provide a good experience to our users.\n Never once did we  seriously consider that Apple itself would be our biggest roadblock, and that their rationale would be so totally biased/subjective.\n To be fair, the guidelines for app submissions were *quietly* updated in March 2020 to include “fortune telling” as a “spam” category.\n We did see one article about this, but because 1) we’re not technically a fortune telling app and 2) we were already approved in TestFlight months earlier with no issue, we didn’t think this rule would affect us. Besides, they even state in their own guidelines that there are exceptions to these rules based on a high quality or unique app experience.    And by the time it became clear you could not win, how did you feel then?\n After the ninth rejection we felt totally dejected. We had taken out elements of astrology piece by piece with each of our submissions, hoping that if we “de-centred” astrology a bit, they’d be more amenable to accepting our app.\n By the end, we had practically nothing related to astrology left, and they still rejected us on the same grounds.\n When we replied that we actually did not have any astrology left in our app, they back-pedalled and said that it was because it was a dating app that it was considered “spam.”\n ( And this was despite the fact that two apple representatives actually told us over the phone that dating apps would be acceptable. We later realised that they have all these dispute conversations over the phone so that there’s no paper trail to hold them accountable for their promises.)\n It just struck me as extra ironic that almost on the exact day that Apple announced their big initiatives to support underrepresented communities, they handed us this arbitrary rejection.\n My appeal ( the one posted on Instagram) laid out why calling astrology “spam” was offensive to female, POC, and LGBTQ+ communities, but they continued to claim that this was not a philosophical decision on their part, but rather a “business decision.”\n The argument that this was purely a business decision on their part really gets to me.\n An app that generates over 800 downloads in 2 weeks via TestFlight (an app that most people haven’t heard of and one that looks kind of scammy/intimidating if you’re not a “tech person”), plus downloads from multiple venture capitalists, and organic demand for broader availability, seems in no way like a “bad business decision.”\n None of the feedback we received from Apple (or otherwise) was related to the app being in any way low quality or spammy itself — the issue was simply that it featured astrology.\n  Just crunch some rough maths. Myself and my co-founder Alex have been working on this full-time since September — that’s at least 2500 man hours, but probably many more.\n We’ve also had 4 other people helping us in various capacities with design, development, and consultation, amounting to at least several hundred additional hours. We’ve spent tens of thousands of dollars on development and building the company, too.\n   Alex Calkins is my co-founder and the one who did the bulk of the development for the app. (He’s also the only man who has really touched the app in any way, shape, or form.) Octavia Sulea helped us develop some of the backend architecture and data processing. Amy Yousofi is our operations manager. Nadine Jane (Head-Gordon) is our astrology advisor.    Who designed the gorgeous interface?\n Kristina Alford, my good friend and former colleague, did the bulk of the gorgeous brand design and website work. Alex and I then translated that into much of the app design/interface.    Okay, so part of the reason I thought a lot about your app, is  a tweet I made hating on astrology and a reply I got. And what has happened to you seems this writ out large, right?\n  On one hand, I find myself thinking, “ astrology is a silly thing to get worked up over, especially when there are such big, important issues going on in the world right now.”\n But on the other hand, it angers me how deep these systems that marginalise women, POC, queer people, and any other group that’s not cis men, run in our lives.\n And most people don’t even realise that somewhere in Cupertino, a white man is sitting in a conference room making decisions about what categories of apps can and cannot even exist for you to download onto your phone.\n Somewhere, a team of men has decided that three or four versions of  Words With Friends, littered with a dizzying number of ads, are okay, while an app that’s trying to connect people with similar interests is not.\n Even if astrology is simply being used as a form of entertainment for more casual enthusiasts, this policy is saying “ the people who find astrology useful / entertaining / liberating in any way do not deserve to have this moment of joy, no matter how small or menial.”\n On the other end of the spectrum, astrology is a millennia-old practice deeply respected by many non-Western countries, even today. That Apple has the power to completely squash the category is alarming. Not to mention that astrology’s popularity amongst these groups means it’s more likely that these types of apps are being developed by those very people—the ones who are most often overlooked in the tech world.\n And here’s the thing: Alex and I come from privileged backgrounds. We have great educations and a pretty deep familiarity with the mechanics of the tech world, having worked in it for many years. I can’t imagine what this would be like for a young or novice person working on a project like this alone in their bedroom with hopes of building something to share with others.    Where to from here with the app?\n We’re going to make a fuss, we’re going to comment on  Lisa Jackson’s (vice president of Environment, Policy and Social Initiatives) instagram page relentlessly, and we’re going to try to make ourselves heard. But beyond that, we feel pretty powerless.\n And to be honest, that’s probably how they like it.  A lot of noise has been made over Apple’s anti-trust violations over the past couple of weeks because of an app called Hey being rejected from the App Store, and while I totally agree that these policies are corrupt, little has been said about this other insidious side of their policies.\n This is the side that doesn’t affect the average “tech dude,” and so it’s less likely to get attention and more likely to be dismissed/ignored.    And with life? I know you been baking and donating proceeds to BLM…\n I’m not sure—I have a lot of free time for the time being, which I’ve spent staying up to date on news, trying to stay engaged in whatever activism I can, responsibly attending protests, and generally not sleeping much.\n  I haven’t been baking  as much, but the volunteer baking will definitely pick up more if we can’t get through to Apple.\n Thanks Rachel. Watching and waiting with interest. And  Struck   fucking rules, btw. I want to see it out in the world.", "posttime": "2020-06-24 08:09:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,约会,dating,占星术", "title": "我梦寐以求的约会应用被苹果公司封杀了", "title_en": "My dream dating app has been banned by Apple", "transed": 1, "url": "https://webworm.substack.com/p/my-dream-dating-app-has-been-banned", "via": "", "real_tags": ["苹果", "apple", "约会", "dating", "占星术"]}, {"category": "", "categoryclass": "", "imagename": "43a92ca8ce08497f0bcad97e897526dd.jpg", "infoid": 1007888, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您在2020年是一名软件开发人员，那么您很可能熟悉“大师”这个术语，它是Git中主要开发分支的名称。科技行业最近的一项行动是将默认的Master名称改为另一个名称，如Main。\n这是我们在Kapwing采用的一种方法，在这篇文章中，我们将讨论这一改变的一些想法，以及一个关于如何自己做这件事的简短教程！\n目前的讨论围绕着软件开发中的术语命名，以及如何使其对黑人社区更具包容性。MASTER&34；这个名称很重要，因为它既是默认GIT开发分支的标准名称，也包含对奴隶制的明确引用(例如，主/从)。为了让技术成为一个更具包容性的地方，其中一个举措是将主分支机构重新命名为不同的名称。人们已经提出了许多名字，比如主要的和默认的，但到目前为止，主要的替代方案已经成为最受欢迎的替代方案。\n将MASTER改为Main的主要理由是减少团队代码库中有问题的术语的出现。计算机领域中“主/从”一词的由来存在争议，但Git开发人员的电子邮件记录证实，他们指的是行业标准制定时常见的主/从比喻。从公司白话中删除这种语言是帮助黑人更容易获得和包容技术的一个小方法。大师并不是唯一有问题的词；例如，黑名单、白名单、黑帽和白帽等其他术语也被认为是有问题的术语。\n将MASTER改为Main的另一个论点是提高科技界对微侵略性和黑色问题的认识。这一变化提醒人们，让环境更具包容性所需的意向性。\n为大师术语辩护的开发人员争辩说，它是一个工程标准，工程标准是有用的，不应该无缘无故地破坏。有人说，这一改变破坏了许多代码，并冒着许多不必要的技术难题的风险。其他人争辩说，当新开发人员增加代码库时，不同的做法可能会让他们感到恼火或困惑。\n反对这一改变的另一个有争议的论点是，硕士分校实际上并没有提到奴隶制--相反，它来自不同的起源，类似于硕士学位这样的词。然而，根据Git开发过程中的电子邮件记录，这一说法后来被证明是错误的。\n最后，虽然这并不是反对这一变化本身的理由，但有一种观点认为，将主机改为Main只不过是纸上谈兵的活动人士的工作，他们为了在晚上睡得安稳，只做了最少的工作。一些人声称，将MASTER改为Main只是表演性的盟友关系-分散了对真正问题的注意力，可能会让人们因为做了一些对争取平等的宏伟计划影响甚微的事情而自吹自擂。\n如果您已经通读了讨论并决定更新您的主分支名称，请继续阅读我们在Kapwing用来执行此操作的git命令。\n要做的第一件事是移动主分支或将主分支重命名为Main。\n$git Branch-m master main$git状态在分支main上您的分支是最新的&#39；源/主&#39；。没有要提交的内容，工作树是干净的。\n现在，在我们的本地存储库中，我们有一个设置为与上游主分支相对应的主分支。我们现在可以尝试推送主分支，但我们会遇到以下错误：\n$GIT PUSH FATAL：当前分支的上游分支与当前分支的名称不匹配。要推送到遥控器上的上游分支，请使用git Push Origin Head：master要推送到遥控器上的同名分支，请使用Git Push Origin Head要永久选择任一选项，请参阅&#39；git帮助配置中的pres.default。\n我们已将本地分支重命名为Main，但远程分支仍称为MASTER。因此，Git会抱怨，因为它不知道应该将您当地的分支机构推到哪个分支机构。它为您提供两个选项：\nGit推送来源Head：Master：这会将您的本地主分支推送到现有的远程主分支。\nGit Push Origin Head：这将把您的本地主分支推送到远程上的同名分支，换句话说，这将在远程上创建一个名为Main的新分支。这就是我们想要的！\n$GIT推送原始HEADTotal 0(增量0)，重用0(增量0)Remote：Remote：通过访问Remote：&lt；https://github.com/kapwing/kapwing/pull/new/main&gt；remote：to github.com：kapwing/kapwing.git*[新分支]Head-&gt；Main，为giHub上的&#39；Main&&&gt;创建一个拉取请求。\n现在，我们的远程repo上有两个完全相同的分支，master和main。我们可以导航到GitHub来检查分支是否确实正确。\n现在您已经创建了一个主分支并将其推送到您的遥控器！这是一个很好的中间状态，因为您可以同时运行主分支和主分支一周左右，以确保没有问题。\n请确保更新所有配置项管道以及可能指向主分支的任何其他依赖项。在我们的例子中，我们在Heroku上配置了自动部署，当新的提交被推送到主服务器时，它会自动部署我们的应用程序。\n您的部署管道可能与我们的不同。因为可能有许多不同的服务依赖于主分支，所以最好同时运行主分支和主分支进行几次部署，直到您确信一切都很顺利为止。\n当您确信您的工程团队熟悉Main，并且所有管道都在Main上平稳运行时，最后一步是删除主分支。\n对于我们Kapwing，我们的默认分支已经是dev分支，这意味着我们不必重新配置默认分支。但是，如果MASTER是您的默认分支，则可能需要先将Main设置为默认分支，然后才能删除MASTER。这是特定于Github的设置-换句话说，远程存储库通常需要定义一个默认分支，以便在您查看存储库时知道要呈现哪个分支。在这个堆栈溢出答案中有一个很好的教程。\n最后，删除主分支：首先，签出主分支。然后，运行git Branch-D master。您的输出应该如下所示：\n$GIT结账主目录切换到分支&#39；Main&#39；您的分支机构的&#39；Origin/Main&#39；.$GIT BRANCH-D MASTER已删除分支主目录(版本为5aa0c31e6)。\n现在，我已经删除了本地repo上的主分支，但我仍然需要删除远程主分支。为此，我可以运行以下命令：git push Origin：master。\n#ericlu@erics-mbp in~/site/kapwing on git：main o[10：47：49]$git推送来源：master remote：error：GH006：refs/head/master的受保护分支更新失败。remote：错误：无法删除此受保护分支to github.com：kapwing/kapwing.git！[远程拒绝]主机(受保护的分支挂钩已拒绝)错误：无法将某些引用推送到&#39；[受保护的电子邮件]：kapwing/kapwing.git&#39；\n哦不！像许多组织一样，我们已经将我们的主分支机构设置为受保护。换句话说，在没有特殊访问权限的情况下，不可能从远程存储库中删除分支。\n但是，在许多不受保护的情况下，运行此命令会对您起作用。只需确保您完全确定您已准备好删除主机即可！\n在Github中，我可以在设置→分支中删除受保护的分支。我将使用此UI删除我们的主分支。\n这就对了！现在我们在Kapwing的主要回购业务没有主分支机构。\n虽然每家公司都需要在知情的情况下做出自己的决定，但在Kapwing，我们决定将我们的主分支机构改为Main。\n我们希望努力减少我们代码库中任何带有种族色彩的术语，无论它们是否具有广泛的攻击性。我们希望尽可能具有包容性，这意味着要采取措施消除有问题的术语。\n这很可能是真的，改变我们公司分支机构的名称并不一定会对当今美国的黑人和黑人问题产生很大的直接影响。然而，更名确实有助于提高科技行业黑人的知名度。我们认为，朝着更具包容性的环境迈出任何一步都是正确的，当这一步就像改变分行名称一样小的时候，这是不需要动脑筋的。\n然而，我们也要牢记这样一个事实，争取平等的斗争不会随着把主人变成主人而结束。我们不能仅仅因为我们做了这么小的改变就为解决种族主义问题而沾沾自喜。相反，无论是在科技界还是在其他领域，要帮助实现平等还有很长的路要走。我们还在其他方面采取了行动，首先是将YouTube的收入捐赠给黑人内容创作者，同时花时间将自己作为一个团队，在当今美国的黑人问题上进行教育。但我们意识到，这些只是朝着正确方向迈出的非常小的一步。\n我们认为，作为技术社区的一员，我们有责任思考创造性的方式，为黑人生命也是事业做出贡献。我们支持参加过抗议活动的员工，出版了关于如何使用我们的产品来支持这项事业的内容，在我们的社区中突出了令人惊叹的黑人创造者，向平等正义研究所捐款，并公开表达了我们的立场。我们认识到，要让科技初创公司的世界变得更加公平，还需要取得很多进展，但我们认为，将Master改为Main是我们可以采取的消除代码库偏见的一步。我们希望这篇文章能帮助您更好地理解这个问题，并希望您可以采取行动对您的团队做同样的事情！", "note_en": "If you&#39;re a software developer in 2020, you&#39;re likely familiar with the term &#34;master&#34; as the name of the primary branch of development in Git. One recent movement in the tech industry has been around changing the default &#34;master&#34; name to another name like &#34;main&#34;.\n This move is one that we&#39;ve adopted at  Kapwing, and in this article, we&#39;ll discuss some of the thinking that went into this change as well as a short tutorial on how to do it yourself!\n     The current discussion has been around naming terminology in software development and how to make it more inclusive to the Black community. The name &#34;master&#34; is significant because it has been both the standard name for the default git development branch but also carries clear references to slavery (e.g. master/slave). In the vein of making technology a more inclusive place, one initiative has been to rename the master branch to a different name. Many names have been suggested, like &#34;primary&#34; and &#34;default&#34;, but &#34;main&#34; has so far emerged as the most popular alternative.\n  The main argument for changing &#34;master&#34; to &#34;main&#34; is to reduce the occurrences of problematic terminology in a team&#39;s codebase. The origin of the term &#34;master&#34; in computing is controversial, but  email records from the Git developers confirm that they were referring to the common master/slave metaphor when the industry standard was set. Removing this language from  company vernacular is a small way to help make technology more accessible and inclusive to Black people. &#34;Master&#34; is not the only problematic word; other terms like &#34;blacklist&#34;, &#34;whitelist,&#34; &#34;black hat&#34;, and &#34;white hat&#34;, for example, have also been recognized as problematic terminology.\n   Another argument for changing master to main is to raise awareness in the tech community about micro-aggressions and Black issues. The change is a reminder of the intentionality required to make environments more inclusive.\n  Developers who defend the &#34;Master&#34; terminology argue that it&#39;s an engineering standard, and engineering standards are useful and shouldn&#39;t be broken without reason. Some say that the change break a lot of code and risks a lot of needless technical headache. Others argue that a different practice could annoy or confuse new developers as they ramp up on a codebase.\n Another controversial argument against the change is the idea that the master branch doesn&#39;t actually have references to slavery - instead it came from different beginnings similar to words like Master&#39;s degree. However, this has since proven to be false based on email records from  the development of Git.\n Finally, while this isn&#39;t an argument  against the change per se, there is an argument that changing master to main is simply the work of armchair activists who do the bare minimum in order to sleep easy at night. Some folks claim that changing master to main is just performative allyship - distracting from the real issues, and could allow people to pat themselves on the back for doing something that has very little impact in the grand scheme of  the fight for equality.\n   If you&#39;ve read through the discussion and have decided to update your master branch name, keep reading for the git commands that we used to do this at Kapwing.\n  The first thing to do is to &#34;move&#34; or rename the master branch to main.\n $ git branch -m master main$ git statusOn branch mainYour branch is up to date with &#39;origin/master&#39;.nothing to commit, working tree clean\n Now in our local repository, we have a main branch that is set to correspond with the upstream master branch. We can try to push the main branch right now, but we&#39;ll run into this error:\n $ git pushfatal: The upstream branch of your current branch does not matchthe name of your current branch. To push to the upstream branchon the remote, use git push origin HEAD:masterTo push to the branch of the same name on the remote, use git push origin HEADTo choose either option permanently, see push.default in &#39;git help config&#39;.\n We&#39;ve renamed the local branch to  main, but the remote branch is still called  master. So Git will complain because it doesn&#39;t know which branch to push your local branch to. It gives you two options:\n git push origin HEAD:master: This will push your local  main branch to the existing remote  master branch.\n git push origin HEAD: This will push your local  main branch to the  branch of the same name on the remote, in other words, this will create a new branch on the remote called  main. This is what we want!\n $ git push origin HEADTotal 0 (delta 0), reused 0 (delta 0)remote: remote: Create a pull request for &#39;main&#39; on GitHub by visiting:remote: &lt;https://github.com/kapwing/kapwing/pull/new/main&gt;remote: To github.com:kapwing/kapwing.git * [new branch] HEAD -&gt; main\n Now we have two identical branches on our remote repo,  master and  main. We can navigate to github to check that the branches are indeed correct.\n Now you&#39;ve created a  main branch and pushed it to your remote! This is a good intermediate state because you can run your  main branch as well as your  master branch side by side for a week or so to make sure that there are no issues.\n Be sure to update all of your CI pipelines and any other dependencies that might be pointing to the master branch. In our case, we had an auto-deploy configured on Heroku that automatically deployed our app when new commits were pushed to master.\n  Your deploy pipeline may be different from ours. Because there might be many different services that rely on the master branch, it might be best to run your main and master branches side by side for a few deploys until you feel confident that everything is working smoothly.\n When you feel confident that your engineering team is familiar with main and that all pipelines are running on top of main smoothly, the last step is to remove the master branch.\n For us at Kapwing, our default branch was already the  dev branch, which meant that we didn&#39;t have to reconfigure the default. However, if  master is your default branch, you may need to first set main to be the default branch before master can be deleted. This is a Github specific setting - in other words, the remote repository usually need a default branch defined in order to know which one to render when you view the repository. There is a good tutorial in  this Stack Overflow answer here.\n Finally, to delete the master branch: first, checkout the main branch. Then, run  git branch -D master. Your output should look something like this:\n $ git checkout main Switched to branch &#39;main&#39;Your branch is up to date with &#39;origin/main&#39;.$ git branch -D masterDeleted branch master (was 5aa0c31e6).\n Now I&#39;ve deleted the master branch on my local repo, but I still need to delete the remote master branch. To do that, I can run this command:  git push origin :master.\n # ericlu @ erics-mbp in ~/sites/kapwing on git:main o [10:47:49] $ git push origin :masterremote: error: GH006: Protected branch update failed for refs/heads/master.remote: error: Cannot delete this protected branchTo github.com:kapwing/kapwing.git ! [remote rejected] master (protected branch hook declined)error: failed to push some refs to &#39; [email protected]:kapwing/kapwing.git&#39;\n Oh no! Like many organizations, we&#39;ve set our master branch to be protected. In other words, it&#39;s not possible to delete the branch from the remote repository without special access.\n However, running this command would work for you in many non-protected scenarios. Just make sure that you are completely sure that you are ready to delete master!\n In Github, I can delete protected branches in Settings → Branches. I will use this UI to delete our master branch.\n    There you have it! Now our main repo at Kapwing operates without a master branch.\n  While every company needs to make their own informed decision, at Kapwing we decided to change our master branch to main.\n We want to work to reduce any racially charged terms in our codebase, whether they are broadly offensive or not. We want to be as inclusive as possible, and that means taking steps to eliminate problematic terminology.\n It&#39;s likely true that changing the name of a branch in our company is not necessarily going to make a large direct impact Black people and Black issues in America today. However, changing the name does help raise awareness for Black people in tech. We feel that it is right to take any step we can towards a more inclusive environment, and it&#39;s a no brainer when the step is as small as changing a branch name.\n However, we also are staying mindful of the fact that the fight for equality doesn&#39;t end with changing master to main. We can&#39;t pat ourselves on the back for solving racism just because we made such a small change. On the contrary, there&#39;s a much longer way to help achieve equality, both in the tech community and beyond. We&#39;ve taken action  in other ways too, starting with donating our Youtube revenue to Black content creators, as well as taking time to educate ourselves as a team on Black issues in the US today. But we are aware that these are only very small steps in the right direction.\n    We feel that as members of the tech community that we&#39;re responsible for thinking of creative ways that we can contribute to the Black Lives Matter cause. We&#39;ve supported our employees who have participated in protests, published content about how to use our product to support the cause, spotlighted amazing black creators in our community, donated to the Equal Justice Institute, and publicly expressed our position. We recognize that there&#39;s a lot of progress yet to come to make the tech startup world more equitable, but we saw changing Master to Main as one step we could take to eliminate bias in our codebase. We hope this article helps you understand the issue more and that you might take action to do the same on your team!", "posttime": "2020-06-24 07:50:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "分支机构,master,分支", "title": "如何将您的主分支机构重命名为Main", "title_en": "How to Rename Your Master Branch to Main", "transed": 1, "url": "https://www.kapwing.com/blog/how-to-rename-your-master-branch-to-main-in-git/", "via": "", "real_tags": ["分支机构", "master", "分支"]}, {"category": "", "categoryclass": "", "imagename": "c34a0e9f39d08b3b2649910e3eb3f9e1.jpg", "infoid": 1007885, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软已经开始在Windows10设备上自动推出新的基于Chromium的Microsoft Edge浏览器，不出所料，并不是每个人都喜欢这种方法。\n在火狐用户中，一些人发现，新的默认Windows10浏览器通过Windows Update安装到他们的设备上，有时会从Mozilla的应用程序中导入数据，即使他们没有给予许可。\n其中一些Firefox用户决定终止Microsoft Edge的初始安装过程，结果却发现，尽管向导提前关闭，但浏览器仍然复制了Mozilla浏览器存储的数据。\n一位用户解释说：“我喜欢重启电脑，以获得强制浏览浏览器的待遇。我不会使用我不得不通过任务管理器强制关闭才能逃脱的浏览器，然后发现它一直在未经许可的情况下从火狐复制我的数据，”一名用户解释说，“我不会使用这种浏览器的，我必须通过任务管理器强制关闭才能逃脱，然后发现它一直在未经许可的情况下从火狐复制我的数据。”\n“除非您通过任务管理器关闭它，而不是执行强制设置，否则它无论如何都会复制您的数据，最糟糕的是，大多数人永远不会知道它在做什么，因为他们再也不会打开它了。另一个人解释说：“我之所以重新打开它，是因为我注意到它在关闭时自动让我登录浏览器，并想在不再接触它之前注销，这时我发现它已经复制了我的Firefox数据，尽管我没有完成安装过程。”其他人解释说：“我发现它已经复制了我的Firefox数据，尽管我没有完成安装过程。”\n微软一直对此守口如瓶，所以目前还不知道为什么Edge会导入Firefox数据，尽管最初的向导实际上是被用户手动关闭的。\n不想获得Windows Update上新的Edge的用户可以求助于微软今年早些时候发布的专用工具包，而删除浏览器只需从设备上卸载更新即可。", "note_en": "Microsoft has started the automatic rollout of the new Chromium-based Microsoft Edge browser on Windows 10 devices, and unsurprisingly, not everybody likes this approach.\n In the case of  Firefox users, some discovered that the new default Windows 10 browser, which is shipped to their devices via Windows Update, sometimes imports the data from Mozilla’s application even if they don’t give their permission.\n Some of these Firefox users decided to kill the initial setup process of Microsoft Edge, only to discover that despite the wizard shutting down prematurely, the browser still copied data stored by Mozilla’s browser.\n   “Love rebooting my computer to get treated to a forced tour of a browser I&#39;m not going to use that I have to force close through the task manager to escape, and then finding out it&#39;s been copying over my data from Firefox without permission,” one user explains.\n “Unless you close it via task manager instead of doing the forced setup, in which case it copies your data anyway, and the worst part is most people will never know what it&#39;s doing because they&#39;ll never open it again. I only reopened it because I noticed it automatically signed me into the browser as it was closing and wanted to sign out before not touching it again, at which point I discovered it had already copied my Firefox data over despite the fact I didn&#39;t go through the setup process,” someone else explains.\n Microsoft has remained tight-lipped on this, so for the time being, it’s still not known why Edge imports Firefox data despite the initial wizard actually killed off manually by the user.\n Users who don’t want to be offered the new Edge on Windows Update can turn to the   dedicated toolkit that Microsoft released earlier this year, while removing the browser is possible by just uninstalling the update from the device.", "posttime": "2020-06-24 07:31:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows,microsoft,windows-10,firefox,edge", "title": "Microsoft Edge被控在Windows 10中偷偷导入Firefox数据", "title_en": "Microsoft Edge Accused of Sneakily Importing Firefox Data In Windows 10", "transed": 1, "url": "https://news.softpedia.com/news/microsoft-edge-accused-of-sneakily-importing-firefox-data-on-windows-10-530338.shtml", "via": "", "real_tags": ["windows", "microsoft", "firefox", "edge"]}, {"category": "", "categoryclass": "", "imagename": "bf47f7b72aa26839f751f7e94af82f5d.jpg", "infoid": 1007880, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook被指控试图绕过欧洲强硬的隐私法，通过WHOIS注册处的模糊政策程序获取域名持有者的个人数据。\n本月早些时候，域名注册商Namecheap Richard Kirkendall的首席执行官警告说，“Facebook正在为获取你的信息的全面权利而战”，并详细说明了DNS监督者ICANN在幕后做出的努力，以迫使Facebook通过对隐私法的解释，窃取域名持有者的数据。Facebook表面上想要这些信息，这样它就可以追踪并起诉任何创建了听起来或看起来都很像Facebook的域名或网站的人，包括那些伪装成合法Facebook网站的人，以获取人们的登录信息。\nICANN正在努力将其过时的WHOIS数据库(将域名与其所有者联系起来)替换为一个与欧洲隐私保护GDPR兼容的数据库，这一过程已经持续了近三年。\n进展缓慢，很大程度上是因为商业实体迫切希望获得域名的完整注册数据-包括人们的家庭地址、电话号码和电子邮件地址-并一直在努力寻找绕过隐私保护的方法。\n该项目的第一阶段本应在2月底到位，但至今仍未完成。第二阶段的最后期限为本月，并已于7月份延长。一年多前，美国政府表示，它的耐心即将耗尽。\nKirkendall在一篇博客文章中透露，Facebook最近努力获取堆积如山的Whis域名数据，坚称自己对这些信息有“合法利益”。这个词直接来自GDPR立法，尽管这家社交媒体巨头试图在GDPR的背景之外重新解释这个表达，以允许它不断访问私人数据。\n当ICANN所谓的加速政策制定过程(EPDP)团队试图弄清楚如何授予访问这些数据的权限时，Facebook的代表-前ICANN政策团队成员-一直在推动书呆子们让Facebook看一看，尽管注册商和注册商一再拒绝，他们认为硅谷公司无权获得这些数据，应该使用既定的法律途径获取信息。\n只有执法部门和代表ICANN提供域名解决服务的公司-所谓的统一域名争议解决(UDRP)提供商-才能通过ICANN即将推出的标准化访问/披露系统(SSAD)方法访问完整的域名数据。然而，商业公司声称，他们的权利也必须得到考虑，特别是在商标方面，他们也应该被授予访问权。\nFacebook尤其咄咄逼人，提交了数万份请求，要求提供往往与其商标无关的域名上的数据，并坚称自己的权利受到了侵犯。当这些要求被拒绝时，Facebook随后起诉了人们用来注册名字的公司，声称侵犯了商标，并要求10万美元的赔偿。\nNamecheap的Kirkendall知道这种做法，因为他的公司是被起诉侵权的公司之一。早在3月份，Facebook就提起诉讼，并写了一篇博客文章，抨击注册商允许人们注册“欺骗性”和“辱骂”域名。\n但他坚称，他的公司不会屈服于武力策略：“Facebook最近发起了一场活动，试图将自己推销为一家努力保护互联网用户免受网络犯罪侵害的公司，”他写道。\n“事实上，Namecheap起诉Namecheap时就使用了这一说法，因为Namecheap仅仅因为Facebook的要求就拒绝将其客户的个人信息交给Facebook。这样做是在攻击基本隐私权，因为它试图开创一个危险的先例，可能会暴露任何人的信息。“。\n到目前为止，Namecheap只是被大公司起诉的三家注册商之一。\n本月早些时候，Namecheap申请完全驳回此案，并嘲笑[PDF]Facebook“试图依靠诉状中不存在的指控和误导性论点，克服他们对域名抢注、商标侵权和商标淡化指控中的法律和事实缺陷。”\n也不只是Namecheap厌倦了Facebook的欺凌战术。世界上最大的注册商之一Tucows最近发布的另一篇帖子，在努力简化域名数据索取系统的背景下，给出了“对外行来说明显不侵权的例子”。几乎所有的帖子都来自Facebook。\n“Instantmonogram.com；letsfacethebook.com-在上述每种情况下，域名都包含由附加字符分隔的整个商标(&#39；Insta[…]。GRAME&39；或&#39；FACE[…]。这本书)，但与任何侵权行为无关，“Tucows的帖子指出。\n它给出了facebook的第二类明显错误的请求：“这些不包含完整的商标，而只包含它的一部分或部分拼写错误的…。”其中一个例子？zharfambook.com。\n然后，它有一个完整的部分，用于“使用完整商标的域名[但]表明该域名正在或将被用来与相关公司讨论申诉”。他们中的每一个都来自Facebook：Additedtofacebook.org，By-by-facebook.com，divestfacebook.com，facebookucks.org，prostfacebook.org，saynotoinstagram.com。\nNamecheap和Tucows-以及域名行业的许多其他公司-给Facebook的信息都很明确：后退，我们不会屈服于要求交出数百万人的个人信息的压力。\n但至少到目前为止，这家反社交网络-其整个业务都建立在抓取、存储和货币化这类数据的基础上-决心继续推动其主张，即使它推迟了为其他所有人创建新系统。\n它的代表继续声称，作为注册商标持有者就足以获得进入WHIS数据库的全部权限，所有其他路线都是不适当的负担。\nFacebook代表玛吉·米拉姆(Margie Millam)在最近的一次这样的会议上声称：“在获得WHIS的信息之前，你不知道该起诉谁。”“因此，说你必须提起诉讼，你必须根据诉讼使用你的传票权力才能接触到WHIS，这是倒退的。”\n她接着说：“如果签约方是这么说的，那对我们来说是个大问题。这个SSAD永远解决不了问题…。现实情况是，有些签约方通常不考虑请求。他们只会说，‘去拿传票’，或者‘提交UDP.’这不是对我们管用的答案。“。\n柯肯德尔结束了他的博客帖子，明确了他认为Facebook持续努力背后的原因：“Facebook真的在乎保护你免受网络犯罪，还是他们最近的努力是他们最新的特洛伊木马，目的是获取Facebook无权拥有的个人数据？我们认为是后者。你觉得呢？“\nThe Register-独立于科技界的新闻和观点。情况发布的一部分", "note_en": "Facebook is accused of attempting to bypass Europe&#39;s hard-line privacy legislation and access personal data on domain name holders through an obscure policy process with the Whois registry.\n  Earlier this month, the CEO of domain registrar Namecheap Richard Kirkendall warned “Facebook is fighting for the blanket right to access your information,” and detailed efforts behind the scenes at DNS overseer ICANN to force through Facebook’s interpretation of privacy laws to slurp data on domain holders. Facebook ostensibly wants the info so it can track down and sue anyone who creates a domain or site that even vaguely sounds or looks like Facebook, including those masquerading as legit Facebook web properties to harvest people&#39;s login details.\n  ICANN is engaged in an effort to replace its outdated Whois database, which links domain names to their owners&#39; contact info, with one compatible with Europe’s privacy-protection GDPR, a process that has been going on for nearly three years.\n  Progress has been slow going, in large part because commercial entities desperately want access to the full registration data of domains – which includes people’s home addresses, telephone numbers and email addresses – and have been trying to find ways around the privacy protections.\n  The first phase of the project was supposed to be in place by the end of February, and is still not done. The second phase had a deadline of this month and has already been extended in July. Over a year ago, the US government said its patience was  running out.\n  Kirkendall revealed in a  blog post that, in its latest effort to gain access to the mountain of Whois domain data, Facebook insisted it has a “legitimate interest” in the information. That term comes straight from GDPR legislation, though the social media giant has tried to reinterpret the expression outside of the context of GDPR to grant it constant access to private data.\n    While ICANN’s so-called expedited policy development process (EPDP) team tries to figure out how to grant access to such data, Facebook’s representative – who is a former member of ICANN’s policy team – has been pushing the wonks to grant Facebook a look-see, despite repeat refusals by the registries and registrars who argue that the Silicon Valley corporation has no right to the data and should use established legal avenues to obtain the information.\n    Access to full domain data through ICANN’s upcoming System for Standardized Access/Disclosure ( SSAD) approach will only be allowed for law enforcement and companies that provide domain resolution services on behalf of ICANN – so-called Uniform Domain-Name Dispute-Resolution ( UDRP) providers. However, commercial companies claim that their rights must also be considered, particularly around trademarks, and they should also be granted access.\n  Facebook has been particularly aggressive, filing tens of thousands of requests for data on domains that are often only tangentially related to its trademarks and insisting its rights are being infringed. When those requests have been rebuffed, Facebook has then sued the companies that people used to register the names, claiming trademark infringement and demanding $100,000 in compensation.\n  Namecheap’s Kirkendall is aware of this approach because his company is one of those being  sued [PDF] for infringement. Back in March, Facebook  lodged a lawsuit and wrote a blog post attacking the registrar for allowing people to register “deceptive” and “abusive” domain names.\n  But he insists that his company will not cave to strong-arm tactics: “Facebook recently started a campaign where it seeks to market itself as a company striving to protect internet users against cybercriminals,” he wrote.\n  “In fact, it used this claim when it sued Namecheap because Namecheap refused to hand over its customers’ personal information to Facebook just because Facebook demanded it. In doing so, it is attacking the fundamental right of privacy by attempting to set a dangerous precedent that could expose anyone’s information.”\n  Namecheap is just one of three registrars, so far, that have been sued by the mega corporations.\n    Earlier this month Namecheap filed to have the case dismissed entirely and  mocked [PDF] Facebook’s “attempt to overcome the legal and factual deficiencies in their claims for cybersquatting, trademark infringement, and trademark dilution by relying upon non-existent allegations in the Complaint and misleading arguments.”\n  It’s not just Namecheap that is fed up with Facebook’s bullying tactics, either. Another  recent post by one of the world’s largest registrars, Tucows, gave “examples that are obvious to a layperson as non-infringing” in the context of efforts to streamline the system of asking for domain name data. Almost all of them came from Facebook.\n  “Instantmonogram.com; letsfacethebook.com – in each of these cases, the domain name contains the whole trademark separated by additional characters (&#39;Insta[…]gram&#39; or &#39;Face[…]book&#39;) but bears no relation to any infringement of it,” the Tucows post noted.\n  It gave a second category of obvious wrong requests from Facebook: “These do not contain the full trademark but only portions of it or portions of misspellings…” One of the examples? zharfambook.com\n  And then it has a whole section for “domains that use the full trademark [but] nevertheless evince an indication that the domain is or will be used to discuss grievances with the company in question.” Every one of them comes from Facebook: addictedtofacebook.org, banned-by-facebook.com, divestfacebook.com, facebooksucks.org, protestfacebook.org, saynotoinstagram.com.\n  The message to Facebook from both Namecheap and Tucows – and many others in the domain industry – is clear: back off, we’re not going to cave under pressure to hand over the personal details of millions of people.\n    But so far at least, the antisocial network – whose entire business is built on grabbing, storing and monetizing this kind of data – is determined to keep pushing its claims, even if it delays the creation of a new system for everyone else.\n  Its representative continues to claim that being a registered trademark holder is sufficient to be granted full access to the Whois database, and that all other routes are unduly burdensome.\n  “You don’t know who to sue until you’ve got the Whois information,” claimed Facebook rep Margie Millam at one such recent meeting. “So it’s backwards to say you have to have a lawsuit and you have to use your subpoena power under the lawsuit to get access to Whois.”\n  She went on: “If that’s what the contracted parties are saying, that’s a huge problem for us. This SSAD will never solve the problem… the reality is that there are contracted parties that routinely do not look at requests. All they say is, ‘Go get a subpoena,’ or, ‘File a UDRP.’ That’s not the answer that’s going to work for us.”\n  Kirkendall closed out his blog post by making it plain what he believes is behind Facebook constant efforts: “Does Facebook really care about protecting you from cybercrime or are their recent efforts their newest Trojan Horse to get personal data that Facebook doesn’t have a right to have? We think it is the latter. What do you think?”\n        The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2020-06-24 07:10:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "域名,facebook,被控,accused", "title": "Facebook被控试图绕过GDPR，窃取域名所有者的WHIS信息", "title_en": "Facebook accused of trying to bypass GDPR, slurp domain owners' Whois info", "transed": 1, "url": "https://www.theregister.com/2020/06/23/facebook_gdpr_workaround/", "via": "", "real_tags": ["域名", "facebook", "被控", "accused"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007878, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一系列互动教程，探索在生成艺术中使用的想法和技术。循序渐进地学习用来创作多产艺术的步骤。", "note_en": "A range of interactive tutorials, exploring ideas and techniques used in generative art. Progressively learn the steps used to create generative art.", "posttime": "2020-06-24 06:52:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "艺术,generative", "title": "生成艺术探微", "title_en": "Exploration of Generative Art", "transed": 1, "url": "https://generativeartistry.com", "via": "", "real_tags": ["艺术"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007877, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "所以我走到我的计算器前，计算出他们已经购买的44个域名花费了他们3080美元，外加每年1540美元的维护费！哇，他们有域名预算！因此，我决定根据沃尔弗拉姆博士的净资产来定价(我认为10万美元是一个公平的起步点)，此外，我还决定要求永久使用电子邮件地址Eric@wolfram.org、Eric@wolfram.com以及网址eric.wolfram.com和eric.wolfram.org。我很快就得到了答复。由于某种原因，他们决定停止浪费我们两个人的时间，就像他们所说的那样，并表示Wolfram Research及其相关公司不准备达成您所描述的任何安排……然而，如果您将来决定出售wolfram.org域名，请务必与我联系。&#34；哈！你说得对！让我吃惊的是，当他们第一次联系我的时候，我是一所大学博士的助手，想要开一所新学校，而现在却是沃尔夫兰研究及相关公司(Wolfram Research And Related Company)走到这一步了？！？然而，他们确实寄给了我一本“数学”，我对此表示感谢，并向他们表示感谢！一个强有力的寻找手势。尽管如此，我必须说我有点生气，因为我从来没有和好博士本人交谈过，也没有机会讨论我对21世纪科学将是什么样子的看法。(他本可以把它写进他的书里的！)。他们也没有按我的要求把沃尔夫拉姆先生的签名书寄给我。我等了又等。哦，好吧，没有人意识到这本书实际上要到2002年才能出版--而不是他们计划的1998年。我猜他们现在已经忘了我和我的领地了。我可能也会读他的书..。然而，在另一个世界里，这个网站可能是关于数学的--现在它只是关于我的--埃里克·沃尔弗拉姆(Eric Wolfram)。它不是关于数学软件开发工具包，数学世界，单位划分，统计学，三角恒等式，替换积分或线性有界。", "note_en": "So I went to my calculater and figured that those 44 domains they already bought had cost them $3080 to buy plus $1540 per year to maintain! Wow, they have a domain name budget! So I decided to base the price on Dr. Wolfram&#39;s net worth (I figured $100,000 was a fair point to start), and, in addition, I decided to ask for perpetual use of the email addresses eric@wolfram.org, eric@wolfram.com, and the web domains eric.wolfram.com and eric.wolfram.org. I quickly got a reply. For some reason, they decided to &#34;stop wasting both of our times&#34;, as they put it, and said &#34;Wolfram Research and its related companies are not prepared to enter into any of the arrangements which you describe...however, in the future, if you decide that you would like to sell the wolfram.org domain, please do get in touch with me.&#34; Ha! Ya right! What got me was that when they frist contacted me it was &#34;hey, I&#39;m an assistant from a Dr. at a university who wants to open a new school&#34; and now it&#39;s all &#34;Wolfram Research and Related company&#34; It&#39;s come to this?!? They did, however, sent me a copy of Mathematica and I appreciated that and thanked them! A mighty find gesture. Still, I must say that I was a tad miffed because I never got to speak with the Good Doctor himself, nor did I get to discuss my views on what science will be like in the 21st century. (which he could have put in his book!) And they never sent me the signed copy of Mr. Wolfram&#39;s book, which I requested. I just waited and waited. Oh well, no one realized that the book would actually come out until 2002 -- not 1998 like they were planning. And I guess they forgot about me and my domain by now. And I probably would have read his book too... In an alternate universe, however, this site might have been about math -- now it&#39;s just about me -- Eric Wolfram. It&#39;s not about mathematica sdk, mathworld, partition of unity, statistics, trigonometric identities, substitution integral or a linear bounded either.", "posttime": "2020-06-24 06:52:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "wolfram,决定", "title": "Wolfram.org不是wolfram.com", "title_en": "Wolfram.org Is Not Wolfram.com", "transed": 1, "url": "http://wolfram.org/business/wolframresearch.html", "via": "", "real_tags": ["wolfram", "决定"]}]