[{"category": "", "categoryclass": "", "imagename": "7494cb06630bab362baee6d06e2f6d6f.png", "infoid": 1001311, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们即将向有史以来最糟糕的经济体之一推出SaaS平台。但就像每一家初创公司一样，我们认为我们已经找到了科技的圣杯--有一天，每个企业都会认为这对他们的成功至关重要。为了找出SaaS平台公司目前认为哪些对它们的生存至关重要，哪些科技产品被认为是值得拥有的，我们邀请了50多名创始人来告诉我们。他们总共提到了70多个独特的平台，6种不同的Google，以及几个向免费层级或更便宜的替代品的软件过渡。这是我们了解到的情况。\n最重要的是，SaaS平台对于今天的公司运营至关重要。每家公司都需要一个网站和一个电子邮件地址。这些是每个初创公司使用的第一个订阅。虽然只有18%的受访者提到了网络托管，但这意味着其余的人都在使用某种平台来维持网站的正常运行。\n另一方面，电子邮件是可以在绝对必要的情况下删掉的，尽管没有人提到去掉G Suite或Outlook。它们都很便宜，而且即使不是所有公司，也是大多数公司日常互动的一部分。\n关于通信软件的一个更令人惊讶的发现是，人们购买Slake Pro的可能性是购买Zoom Pro的四倍。据推测，这是由于每个程序中的付费墙点数造成的。一旦你达到10，000条，松弛就会阻止你的旧消息。如果你用过Slake，你就知道过去的对话有多重要，所以你愿意花点钱把它们找回来。Zoom的主要暂停点是通话时间。您有40分钟的时间，然后呼叫自动结束。当然，有一个简单的解决办法，那就是事后开始一个新的电话会议，这意味着你必须关心是否有多个主持人和100多个参与者来费心在Pro上花钱。学到的教训：仔细选择免费增值的瓶颈。如果可以的话，测试一下。\n做对免费增值服务的公司是大赢家。看看电子邮件营销行业就知道了。大量的差异化，大量的竞争，所有这些都被认为是商业的关键。在这一类别中提到的软件中有78%是独一无二的，18%的受访者认为他们的电子邮件营销工具对于事务性电子邮件、废弃购物车提醒、时事通讯，甚至是冷冰冰的外展都太重要了，不能删除。\n三分之一的受访者表示，他们的SEO软件是他们继续生存的主要部分。在今天的数字市场格局中，Covid产生的最大影响是对销售和营销流程的影响。线下获取客户是不可能的，使用销售软件的创始人中仅有8%就证明了这一点。虽然每个人都被困在家里，通勤时间减少了，空闲时间更多了，但他们浏览互联网的频率却更高了。他们还在寻找解决问题的方法，否则这些问题可以通过更传统的方式解决。因此，在搜索引擎优化软件有一个上升。更有趣的是，事实上有一个搜索引擎优化软件来统治它们：Ahrefs。几乎一半的SEO用户使用Ahrefs，一个人从SEMRush切换到Ahrefs，另外三个人完全放弃了SEMRush。有几个人坚持了下来，但什么服务能提供最大的价值是很清楚的。最重要的是，SEO使用率的跃升表明了谷歌对当今经济格局的强大程度。他们控制着网络流量，这意味着他们控制着增长。\n服务中最大的一个节省成本的转变是从Microsoft365到Google Docs，分别被提及了四次。虽然这只是一个相对较小的数字，但它只是出现在总名单上的其他五种谷歌形式的补充：谷歌分析、谷歌应用、G云计算、Google Alerts，当然还有G Suite。这还不包括谷歌域名和谷歌广告，尽管从定义上讲，这两项服务可能不是传统的SaaS平台，但大多数创始人都会不假思索地使用这两项服务。无论哪种方式，谷歌都将继续主导日益数字化的市场。\n大多数SaaS平台适用于许多行业。以设计工具为例。任何需要营销材料的公司--广告、传单、品牌推广、网站设计--都需要Adobe Creative Cloud这样的工具。从电子商务到汽车经销商，所有的公司都需要好的设计。这就是为什么16%的受访者认为他们的设计工具至关重要。现在考虑支付软件、云存储、客户支持、数据分析.。这些都是任何行业的公司都可以使用的工具。这才是SaaS平台真正取得成功的原因。事实上，SaaS平台覆盖面如此之广，以至于8%的受访者需要集成软件才能将他们的所有信息收集到一个地方。\n但这主要是在地方层面上。人们不再试图让他们的业务首先出现在谷歌地图、Yelp或类似的服务上。SEO还主办了Most Cut Platform的获胜者：SEMRUSH。值得注意的是，SEMRush的直接竞争对手Ahrefs获得了最重要的平台(MIP)奖(当然是与Slake并列)。除此之外，社交媒体管理工具和销售工具正在被削减，与发现的第四点保持一致，内容正在超越传统的销售方法。这也支持了第五个结论，即谷歌掌管着互联网。虽然其他社交媒体平台被认为是不必要的工具，但接触谷歌的受众仍然是当务之急。\n我们在过去几周对参与者进行了调查，当时Covid已经对经济造成了影响。虽然许多业务已经受到严重影响，但SaaS公司仍然存在，而且现在很明显，它将继续存在。许多人说，如果有必要，他们会把自己的软件带到公司的坟墓里。此外，被认为至关重要的平台数量是被认为是奢侈品的三倍多。甚至一些被认为不值得付费的服务也被保留在免费版本中，或者将功能转移到更便宜的产品上。这一切都表明SaaS在今天有多么重要。\n这些回应是从Haro收集的-一份记者和博客作者、Slake社区、Reddit等社交媒体网站的名单，以及与创始人的私人对话。因此，SEO工具和Slake是提到的主要平台这一事实并不令人惊讶。话虽如此，目前的经济主要是由SEO倡导者、社交媒体专家和内容制作人组成的。因此，结果仍然可以高度概括为趋势。下面是我们的观众列出的实际平台列表。在它说一般提及，这是指有人说搜索引擎优化工具是至关重要的，但没有命名一个具体的工具。他们没有包括在独特的统计中，但包括在该类别中使用SaaS工具的受访者百分比中。要查看完整评论，请单击页面底部的“源”按钮。\nAirtable x2-电子表格Google x2-免费应用类型表单-调查表单OAuth-安全/身份验证AdEspresso-广告间谍&amp；A/B测试语法-语法更正插件。\nMicrosoft 365-&gt；Google Docs x4 TalkWalker&amp；Social Searcher-&gt；免费+Google Alerts HR、Benefits、薪资软件-&gt；GoCo.io Cloud Server Automation-&gt；Single Server G Cloud Computing-&gt；Firebase Right Signature-&gt；PandaDoc Basecamp 3-&&gt;免费版对讲机-仅Adobe-&&gt;Chatbox；Sketch SEMRush-&。\n现在下载。\n富文本元素允许您在一个位置创建和格式化标题、段落、块引用、图像和视频，而不必单独添加和格式化它们。只需双击即可轻松创建内容。\n富文本元素可以与静态或动态内容一起使用。对于静态内容，只需将其放入任意页面并开始编辑即可。对于动态内容，请将格式文本字段添加到任何集合，然后在设置面板中将格式文本元素连接到该字段。瞧啊！", "note_en": "We&#39;re about to launch a SaaS platform into one of the worst economies of all time. But like every startup, we think we&#39;ve found the holy grail of tech - something that every business will one day consider crucial to their success. To find out what SaaS platforms companies currently find central to their survival and which tech products are considered &#39;nice-to-have&#39;, we asked over 50 founders to tell us. Collectively, they mentioned more than 70 unique platforms, 6 shades of Google, and several software transitions to free tiers or cheaper alternatives.  Here&#39;s what we learned.\n   Above all else, SaaS platforms are essential to running a company today. Every company needs a website and an email address. These are the first subscriptions every startup uses. While only 18% of respondents mentioned web hosting, it&#39;s implied the rest are using some kind of platform to keep their sites up.\n Email on the other hand is something that  can be cut if absolutely necessary, though no one mentioned getting rid of G Suite or Outlook. They&#39;re both cheap and they&#39;re both part of day-to-day interactions for most, if not all companies.\n  A more surprising finding on communications software is that  people are four times more likely to pay for Slack Pro than for Zoom Pro. Speculatively, this is due to the paywall points in each program. Slack blocks your old messages once you hit 10,000. If you&#39;ve ever used Slack, you know how important past conversations are, so you&#39;re willing to spend a bit to get them back. Zoom&#39;s main pause point is amount of time on a call. You get 40 minutes, then the call is automatically ended. Of course, there&#39;s an easy workaround of starting a new call afterwards, which means you&#39;d have to care about having multiple hosts and over 100 participants to bother spending on Pro.  Lesson learned: choose your freemium bottlenecks carefully. Test them if you can.\n  Companies that get freemium right are big winners. Just look at the email marketing industry. Tons of differentiation, lots of competition, and all considered key to business. Seventy-eight percent of softwares mentioned in this category were unique and eighteen percent of respondents considered their email marketing tools for transactional emails, abandoned cart reminders, newsletters, and even cold outreach too important to remove.\n  One in every three respondents said their SEO software is a major part of their continued existence. In today&#39;s digital market landscape, the largest impact Covid has had is on sales and marketing processes. Getting customers is impossible offline as evidenced by the measly 8% of founders using sales software.  While everyone is stuck home, with less commute times and more free time, they&#39;re browsing the internet more frequently. They are also looking for solutions to problems otherwise solved through more traditional means. As a result, there&#39;s an uptick in SEO software. More interesting is the fact that there&#39;s one SEO software to rule them all : Ahrefs. Almost half of all SEO users used Ahrefs, one person switching from SEMRush to Ahrefs, and three others cutting SEMRush altogether. A couple people held on, but it&#39;s clear what service provides the most value. More than anything, the jump in SEO usage indicates how powerful Google is to today&#39;s economic landscape. They control web traffic which means they control growth.\n  The single largest shift in services to save costs is from Microsoft 365 to Google Docs, getting four discrete mentions. While that&#39;s a relatively small number, it only adds to the five other forms of Google that showed up on the master list: Google Analytics, Google Apps, G Cloud Computing, Google Alerts, and of course G Suite. That&#39;s not including Google Domains and Google Ads, two services most founders use without thinking much about, though they may not be traditional SaaS platforms by definition. Either way, Google continues to dominate the increasingly digital marketplace.\n  Most SaaS platforms are applicable across many industries. Take design tools for example. Any company that needs marketing materials - ads, flyers, branding, site design - needs tools like those of Adobe Creative Cloud. From e-com to car dealerships, all companies need good design. That&#39;s why sixteen percent of respondents called their design tools crucial. Now consider payments software, cloud storage, customer support, data analytics... these are all tools that companies across any industry can use. That&#39;s what makes SaaS platforms truly succeed. In fact, SaaS platforms are so wide reaching, eight percent of respondents need integration software to collect all their information in one place.\n  But that&#39;s primarily on the local level. People are no longer trying to get their businesses to show up first on Google Maps, Yelp, or similar services. SEO also hosts the winner of most cut platform: SEMRush. Notably, Ahrefs, SEMRush&#39;s direct competitor, won the Most Important Platform (MIP) Award (tied with Slack of course). Other than that, Social Media Management tools and Sales Tools are getting cut, aligned with Finding #4, content is overcoming traditional sales methods. It also bolsters Finding #5 that Google runs the internet. While other social media platforms are considered non-essential tools, getting to Google&#39;s audience is still imperative.\n  We surveyed participants over the last few weeks, when Covid had already taken its toll on the economy. While lots of businesses have been severely impacted, SaaS companies are still around and its now clear are here to stay. Many people said they&#39;d take their software to their company&#39;s graves if necessary. Moreover, there were more than three times as many platforms considered crucial than were canned as luxury. Even some of those services considered unworthy of paying were kept in free versions or the functionality was transferred to a less expensive product. That all goes to show how relevant SaaS is today.\n  These responses were gleaned from HARO - a list of journalists and bloggers, Slack communities, social media sites like Reddit, and personal conversations with founders. So the fact that SEO tools and Slack were the primary platforms mentioned comes as less of a surprise. That being said, the current economy is made primarily from SEO advocates, social media mavens, and content producers. So the results are still highly generalizable as trends. Below you&#39;ll find the actual list of platforms listed by our audience. Where it says General Mention, this refers to someone saying &#39;SEO tools are crucial&#39;, but not naming a specific tool. They were not included in the unique counts, but they were included in the percentage of respondents who use a SaaS tool in that category. To see full comments, hit the Sources button at the bottom of the page.\n               Airtable x2 - Spreadsheets Google x2 - Free Apps  Typeform - Survey Forms OAuth - Security/Authentication AdEspresso - Ad Spying &amp; A/B Testing Grammarly - Grammar Correction Plugin\n                Microsoft 365 -&gt; Google Docs x4 TalkWalker &amp; Social Searcher -&gt; Free + Google Alerts HR, Benefits, payroll software-&gt;GoCo.io Cloud Server Automation -&gt; Single Server G Cloud Computing -&gt; Firebase Right Signature -&gt; PandaDoc Basecamp 3 -&gt; Free version Intercom -&gt; Chatbox only Adobe -&gt; Sketch SEMRush -&gt; Ahrefs\n      Download Now\n The rich text element allows you to create and format headings, paragraphs, blockquotes, images, and video all in one place instead of having to add and format them individually. Just double-click and easily create content.\n A rich text element can be used with static or dynamic content. For static content, just drop it into any page and begin editing. For dynamic content, add a rich text field to any collection and then connect a rich text element to that field in the settings panel. Voila!", "posttime": "2020-05-09 02:37:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "saas,founders,谷歌", "title": "仍在使用的SaaS平台上的50位创始人", "title_en": "Fifty Founders on SaaS Platforms They Still Use", "transed": 1, "url": "https://www.marpipe.com/blog/saas-platforms-you-do-and-dont-need-right-now", "via": "", "real_tags": ["saas", "founders", "谷歌"]}, {"category": "", "categoryclass": "", "imagename": "ff0287210796737fd34a6056d629fa7a.png", "infoid": 1001310, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果在Chrome中双击英文文本，则会突出显示您单击的以空格分隔的单词。这并不令人惊讶。然而，前几天我在阅读日语文本时点击了一下，注意到有些单词在单词边界处突出显示，尽管日语没有空格。以下是一些示例文本：\nどこで生れたかとんと見当がつかぬ.。何でも薄暗いじめじめした所でニャーニャー泣いていた事だけは記憶している.。\n例如，如果你点击薄暗い，即使它不是一个单一的字符类(这是汉字和平假名的混合)，Chrome也会正确地将其突出显示为一个单词。并不是所有的亮点都是正确的，但它们看起来并不是随机的。\nChrome如何决定在这里突出显示哪些内容？我试着在Chrome源中搜索日语单词，但只找到了一个实验模块的测试，该模块在我的Chrome版本中似乎并不活跃。\n因此，V8有一个非标准的多语言分词程序，它可以处理日语。\n函数tokenizeJA(Text){var it=Intl.v8BreakIterator([&#39；ja-jp&#39；]，{type：&#39；word&#39；})it.adadtText(Text)var words=[]var cur=0，prev=0 while(cur&lt；text.length){prev=cur cur=it.next()words.push(text.substring(prev。何でも薄暗いじめじめした所でニャーニャー泣いていた事だけは記憶している.。&#39；)//[&#34；どこ&#34；，&#34；で&#34；，&#34；生れ&#34；，&#34；たか&#34；，&#34；とんと&#34；，&#34；見当&#34；，&#34；が&#34；，&#34；つ&#34；，&#34；か&#34；，&#34；ぬ&#34；，&#34；。&#34；，&#34；何でも&#34；，&#34；薄暗い&#34；，&#34；じめじめ&#34；，&#34；した&#34；，&#34；所&#34；，&#34；で&#34；，&#34；ニャーニャー&#34；，&#34；泣&#34；，&#34；い&#34；，&#34；て&#34；，&#34；いた事&#34；，&#34；だけ&#34；，&#34；は&#34；，&#34；記憶&#34；，&#34；し&#34；，&#34；て&#34；，&#34；いる&#34；，&#34；。&#34；]。\n点击“发布您的答案”，即表示您同意我们的服务条款、隐私政策和Cookie政策。\n不是你想要的答案吗？浏览标记的其他问题或提出您自己的问题。", "note_en": "If you double-click English text in Chrome, the whitespace-delimited word you clicked on is highlighted. This is not very surprising. However, the other day I was clicking while reading some text in Japanese and noticed that the some words were highlighted at word boundaries, even though Japanese doesn&#39;t have spaces. Here&#39;s some example text:\n どこで生れたかとんと見当がつかぬ。何でも薄暗いじめじめした所でニャーニャー泣いていた事だけは記憶している。\n For example, if you click on 薄暗い, Chrome will correctly highlight it as a single word, even though it&#39;s not a single character class (this is a mix of kanji and hiragana). Not all the highlights are correct but they don&#39;t seem random.\n How does Chrome decide what to highlight here? I tried searching the Chrome source for &#34;japanese word&#34; but only found tests for an  experimental module that doesn&#39;t seem active in my version of Chrome.\n    So it turns out v8 has a non-standard multi-language word segmenter and it handles Japanese.\n function tokenizeJA(text) { var it = Intl.v8BreakIterator([&#39;ja-JP&#39;], {type:&#39;word&#39;}) it.adoptText(text) var words = [] var cur = 0, prev = 0 while (cur &lt; text.length) { prev = cur cur = it.next() words.push(text.substring(prev, cur)) } return words}console.log(tokenizeJA(&#39;どこで生れたかとんと見当がつかぬ。何でも薄暗いじめじめした所でニャーニャー泣いていた事だけは記憶している。&#39;))// [&#34;どこ&#34;, &#34;で&#34;, &#34;生れ&#34;, &#34;たか&#34;, &#34;とんと&#34;, &#34;見当&#34;, &#34;が&#34;, &#34;つ&#34;, &#34;か&#34;, &#34;ぬ&#34;, &#34;。&#34;, &#34;何でも&#34;, &#34;薄暗い&#34;, &#34;じめじめ&#34;, &#34;した&#34;, &#34;所&#34;, &#34;で&#34;, &#34;ニャーニャー&#34;, &#34;泣&#34;, &#34;い&#34;, &#34;て&#34;, &#34;いた事&#34;, &#34;だけ&#34;, &#34;は&#34;, &#34;記憶&#34;, &#34;し&#34;, &#34;て&#34;, &#34;いる&#34;, &#34;。&#34;]\n      By clicking “Post Your Answer”, you agree to our  terms of service,  privacy policy and  cookie policy\n  Not the answer you&#39;re looking for? Browse other questions tagged         or  ask your own question.", "posttime": "2020-05-09 02:37:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chrom,文本,decide,chrome", "title": "当您双击日文文本时，Chrome如何决定突出显示哪些内容？", "title_en": "How does Chrome decide what to highlight when you double-click Japanese text?", "transed": 1, "url": "https://stackoverflow.com/questions/61672829/how-does-chrome-decide-what-to-highlight-when-you-double-click-japanese-text/61673028#61673028", "via": "", "real_tags": ["chrom", "文本", "decide", "chrome"]}, {"category": "", "categoryclass": "", "imagename": "5d5eb80d1cb322e87e26efd544fcfd63.png", "infoid": 1001309, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我在社交媒体上开一个滑稽的笑话时，很容易在末尾加上一个表情符号/表情符号/笑脸。😀。\n但有时我想设定上下文，在一段左右的文章中提出更有道理的论点。我可能会在😛中间放些有趣的东西。我应该把表情符号放在句号的前面还是后面？似乎无论我写哪一圈，在我看来都不对劲。在这里，表情符号让这个时期感觉有点孤单。\n另一种选择是将表情符号放在句号后面。🤔，但当我在后面加上另一句话时，感觉这个表情符号现在附在了后面一句话上，而不是前一句话上。我赢不了。\n当我需要在一个段落😧中放一个以上的表情符号时，我尤其不能获胜。我很容易就会出现矛盾--有些在经期之前，有些在经期之后。🤯。\n是的，在这一点上我可能有点书呆子气，但即使是非正式写作，正确的语法对我来说也很重要。如果弄错了，一个人就可以看起来像个小丑，而不是表现得像个小丑。\n注：我不太清楚这是在这里还是在英语用法上更合适。如果我错了，请有人将其迁移过来；如果我是对的，请删除此评论。\n答案当然很简单。在任何情况下都不应该使用表情符号。--朱迪思。\n如果我使用标点符号，我总是把它放在表情符号之前。我发现它更容易阅读，特别是因为我通常使用不止一个表情符号。看看误读这些有多容易：Wat🤔？&34；和&#34；Wat🤔。--Wat Peilonrayz\n你有没有想过：今天是个好日子。😀。&#34；？当我觉得表情符号传达的意思不是句子的一部分时，我喜欢这样做。否则，我会在表情符号后面加上句号。--卡蒂克·索尼吉(Kartik Soneji)。\n这是一个简单的问题。最难的是，在结束括号之前如何处理未渲染的表情符号。--卢姆肖(Rumtscho)。\n然而，@Peilonrayz将它们误读为什么？你是说误读了什么？是说误读了什么？如果你不想解释，那也没问题。--阿佐尔·阿海(Azor Ahai)。\n对于这一点没有真正的语法规则，而你使用表情符号的事实表明，语法可能不是很负责任。\n话虽如此，从我在社交媒体上看到的情况来看，大多数人使用的表情符号有点像标点符号，而不是文本，把它放在句子的末尾，而不是句号/感叹号。示例：\n在大多数情况下，它的作用与标点符号相同-传达信息的情绪。所以在这些情况下用它来代替标点符号是很自然的。唯一的例外是用表情符号代替单词。但我不喜欢D-DžURI。\nI🤔大多数读者可以根据上下文将表情符号用作句号🙃，而不是用作感叹词或单词替换😁。--谢尔蒂·塞多尔(Kerty Seidohl)。\n@DžURI这似乎是高度主观的。今天的阅读是伟大的一天，😀VS今日是伟大的一天。😀让我的脑海中产生了很大的不同。第一句话似乎不完整，最后一句话有点悬在空中。句号降低了最后一个词的音调并改变了重点。-新的中小型企业管理委员会\n表情符号就是一个大圆点，不是吗？我们真的不知道书上和报纸上写的所有小圆点的心情。我很高兴有人把它们放大了。一些工程师应该去通过显微镜看看过去写的所有小点的心情。--托马斯·韦勒(Thomas Weller)。\n你使用表情符号这一事实本身表明语法可能不是非常负责任的意思？我想这是一句语法很好的话，但我听不懂。-大卫·纳撒尼尔(Nathaniel)。\n我曾经也有过同样的问题，但对于我的母语：法语。我给法国官方语言学院(Académie Française&34；)发了一封信。\n几天后，我得到了一个非常迂腐的回应，告诉我不应该在任何句子中使用表情符号，因为它们表明我缺乏用我糟糕的词汇表达情感的能力。\n谢谢你的这段轶事。他们可能需要很长时间才会让步，但不出所料，官方的答案是错误的。法语有表达情感的词汇，但它没有表达情感的方式(只有像Lojban这样的实验性语言才有)，因此表情符号是必要的。-客户堆栈。\n@stommestack您可以通过文本传达情感，而不必显式地使用符号来表达它们……。几个世纪以来，我们一直在写文字。如果这是书面交流所需要的，为什么几乎每一种书面语言都没有呢？它实际上解决了什么问题？摆出一张愤怒的脸并不能真正表达你有多生气，你不妨直接说我生气了。表情符号仍然是用来表达单一情感的静态面部表情，当你可以用语言来描述同样的情感时，我不认为这有什么必要。-JMAC。\n@JMAC说我很生气。我很高兴。我很难过。另一句话后面加一句话在语法上是正确的，但实际上并不是每个人说话的方式，因为你的面部表情和语气满足了你的需要。表情符号，就像所有的标点符号一样，可以缓解书写时缺少这些符号的问题。保存下来的带有表情符号的最古老的文字是1635年的一封信；没有保存下来的用法更古老。-客户堆栈。\n@stommestack它不是一个特别清楚的标点符号。事实上，他们使用标点符号似乎根本不被接受。标点符号很有用，因为它们很小，易于制作和理解。画面孔根本就不是那么回事。只是笔直的文字是不会说话的。如果我想描绘情感，在文本上有很多选择。对我来说，添加面部表情的图画似乎相当奇怪，特别是如果它是在一种你无法确切验证符号意图代表什么的介质中(不像在计算机上)。-JMAC\n@stommestack你说法语没有表达情感的方式是什么意思？英语中有表示惊讶或惊讶的词，也有表示痛苦的词，法语当然也有这样的词。--唐纳·斯威特(Tanner Swett)。\n表情符号是一个新事物，我相信没有任何与表情符号相关的语法规则。你可以把它放在前面、后面，甚至作为句号。\n如果你问我，我更愿意用它来代替标点符号。然而，我有时会把它放在标点符号之前，表明表情符号仍然是句子的一部分(描述那个句子)。\n天啊，我想念电影院😟我讨厌这个大流行的😡！什么时候才能结束？\n我有时也认为表情符号就像你在括号中使用的短语，但作为图像。\n在随意的交流中，我认为这是可以接受的，但在任何严肃的交流中都不是。(我觉得它们甚至不应该用在Stack Exchange的问题中。)--威尔克。\n我们是一个用尽可能好的英语写问题的网站，其他人会对其进行编辑以使其变得更好。图片不是好英语的一部分。-大卫·威尔克(Willeke)。\n@willeke&34；😱&34；比&#34；？&34；更新，但它们都是图片，没有合理的理由允许其中一幅而不允许另一幅。只有传统。-DžURI\n我已经看到太多的表情符号(或者不管它们是怎么叫的)在电脑甚至手机上都不被接受，这使得原本的意思只是猜测。我也见过许多我(不习惯用它们说话)不明白意思的词被用来代替的情况。习惯了他们的人没有意识到他们在世界上其他地方是多么的鲜为人知。-大卫·威尔克(Willeke)。\n句子是由单词组成的，所以表情符号不应该在其中占有一席之地。把它们放在句号之后是最明智的选择。写出一个句子，然后插入一个表情符号，那么句号就会干扰语法规则，在最后一个单词和句号之间会有一个难看的空格。句子末尾的表情符号不应该被视为句子的一部分，而更像是一个元元素，传达了前面的词在作者身上唤起的一种感觉。\n另一种选择是将表情符号放在句号后面。🤔，但当我在后面加上另一句话时，感觉这个表情符号现在附在了后面一句话上，而不是前一句话上。\n我不同意这一点，它仍然让人感觉依附于第一句话，可能是因为一般来说，表情符号很少放在它们应该描述的单词之前。\n作为一个在表情符号被广泛使用之前使用过表情符号和Kaomoji的人，我倾向于在我会放表情符号或Kaomoji的地方放表情符号。对我来说，这往往不是在标点符号之后，就是在标点符号的位置，我见过很多人这样做，但我也看到很多人在标点符号之前放一个表情符号或文字面孔。^；\n我认为，具有说明性的表情符号应该放在相应的单词旁边(如果表情符号不是直接取代这些单词)，如果这些单词在一个句子的末尾，后面还有另一个句子，那么我认为表情符号应该放在标点符号之前，这样表情符号就不会与它所说明的单词分开。\n对于更像手势的表情符号(比如它们自己的个人信息--竖起大拇指，思考的脸等等)，如果我不完全用它们来代替标点符号，那么我会把我的表情放在标点符号后面，原因有两个：\n如果有标点符号，那么我会延迟我脑海中的结尾声调(当你用英语结束任意语句时的降调)，直到我看到标点符号，我不想让别人读到我的句子有未完成的声调\n我也不认为标点后的表情符号会附在下一句话上，但我肯定能理解为什么其他人会这么看。\n至于进一步阅读，我脑海中浮现的是格雷琴·麦卡洛克(Gretchen McCulloch)的“互联网”(Internet)，这是一本引人入胜的书，其中有一章的标题是“表情符号和其他互联网手势”(Emoji And Other Internet Sigures)。劳伦·高恩(Lauren Gawne)对这一章帮助很大。McCulloch是一位语言学家，Gawne是一位研究手势的语言学家，手势也被称为象征。不过，我没有单独看过高恩的研究；我只读过麦卡洛克的书。\n我将尝试为此制定一些规则，当然，这些规则完全是捏造出来的，注定要被打破。这是一个社区维基：请贡献！\n如果使用的标点符号修改了句子(例如&#34；！&#34；或&#34；？&#34；)，并且句子结束了该行，则表情符号位于标点符号之后：\n但是，如果句子没有结束一行，那么表情符号就会出现在标点符号内：\n这是最酷的👍！但这也不是很酷的😞。\n🐙和🌽表情符号是选项，而不是标点符号，所以它们被算作单词。这里的问号是隐含的。\n其他表情符号不能用来代替标点符号(目前还不清楚🚫是否在回答这个问题)\n如果表情符号是引号的一部分，并且是标点符号，它们就会放在引号内(这与英文中的一些将标点符号放在引号外的准则相比)。然后，您可以在引号之外使用另一个标点符号：\n修好了！而且它是一个社区维基，所以您可以自己添加编辑内容：)-erty Seidohl。\n我认为你在这里提出的想法很有趣，我相信阅读下面的讨论也会很有趣。也就是说，这并不是SE问题的真正用途。首先，这不是一个问题，而是一个讨论。SE应该是为寻求帮助或探索这一主题的人准备的。其次，这是离题的。它不询问现有的规则，而是创建新的规则。我非常感谢你试图引起的讨论，但我觉得聊天比提问更合适。我想请主持人聊聊。-约翰·安吉特(Ankit)。\n@Ankit是的，我同意，这就是为什么我把它做成一个社区维基，我认为这是一个异步聊天：)。不过，如果你愿意的话，我很乐意把它改成不同的格式。--谢尔蒂·塞多尔(Kerty Seidohl)。\n我还根据自己对我和我的朋友如何使用表情符号的观察制定了这些新规则，我希望其他人也能添加他们自己的经历，因为我认为可能没有任何官方规则来做到这一点。--谢尔蒂·塞多尔(Kerty Seidohl)。\n我会说，表情符号不属于段落中间，就像它不属于句子中间一样。你可以在表情符号后换一个新的行来开始你的新句子，这样它就会和你提到的第一个例子一样。\n就词性而言，我认为表情符号最接近感叹词。所以，把它放在你通常会放的任何地方。\n一个If是聊天中孤立的句子中的表情符号。在这种情况下，句号通常被省略，而表情符号正好在句子的末尾。不是在它之前，也不是在它之后，也不是在替换它，因为任何地方都没有一个点。\n第二种情况是在段落中不太常用的表情符号，有完整的句子、停顿和语法。在这种情况下，它们应该放在句号或任何其他标点符号之前。我根据两个括号内问号/感叹号的常用用法回答这个问题：(？)。和(！)。这并不是非常广泛的使用，而且很难看，但它存在并已经做了一段时间了。它们的使用方式类似于表情符号，并且写在标点符号之前。\n受到找到法语答案的MattOnyx的启发，我决定看看荷兰语的建议。幸运的是，答案很容易找到：为荷兰语制定和促进政策的荷兰塔卢尼(荷兰语言工会)有一个网站，名为taaladvies&34；(语言建议)。在这里您可以找到以下文章：https://taaladvies.net/taal/advies/vraag/1716/plaats_van_emoticon_of_smiley_in_een_zin_of_tekst/。\n这里的答案是：如果你在一句话之后贴上表情符号，它就会出现在句号之后。表情符号前后必须有一个空格。这里的示例包括：\n他们明确表示，这些指导方针适用于所有类型的表情符号和笑脸：既有西部的，也有东方的^_^，还有心形❤️表情符号。\n你也可以在笑号后面加一个标点符号，尽管这可能会让人迷惑：\n琳达将在伦敦开始工作：-/，不过幸运的是我们要先去旅行。\n最后但并非最不重要的一点是：他们告诉你，你可以在非正式的书面语言中使用它们，而且它们不属于报纸、杂志或正式的网络文本。\n点击“发布您的答案”，即表示您同意我们的服务条款、隐私政策和Cookie政策", "note_en": "When I make a hilarious joke on social media it&#39;s easy to put an emoji/emoticon/smiley on the end. 😀\n But sometimes I want to set the context and make a more reasoned argument over a paragraph or so. I might put something funny in the middle 😛.  Should I put the emoji before or after the full stop? It seems no matter which way round I write, it just looks wrong to me. Here, the emoji makes the period feel a bit orphaned.\n The alternative is to put the emoji after the full stop. 🤔 But when I follow this with another sentence, it feels like the emoji is now attached to the latter rather than former sentence. I can&#39;t win.\n I particularly can&#39;t win when I need to put more than one emoji in a single paragraph 😧. I easily end up with an inconsistency - some before the period, some after. 🤯\n Yes, I might be being slightly pedantic about this, but getting my grammar right on even informal writing is important to me. Get it wrong, and one can look like a clown rather than act like one.\n Note: I&#39;m slightly unclear whether this sits better here or on  English Language &amp; Usage. Please someone migrate it across if I&#39;m wrong, or remove this comment if I&#39;m right.\n  Surely the answer is simple. There are no circumstances under which emoji should ever be used.\r \r–  Judith\n  If I use punctuation, I always put it before an emoji. I find it easier to read, especially since I normally use more than one emoji. See how easy is it to misread these: &#34;Wat 🤔 🤔 🤔?&#34;, and &#34;Wat 🤔 🤔 🤔.&#34;\r \r–  Peilonrayz\n  Have you considered: &#34;Today is a nice day. 😀.&#34;? I like to do this when I feel that the emoji conveys meaning that is not part of the sentence. Otherwise, I put the full stop after the emoji.\r \r–  Kartik Soneji\n  That&#39;s the simple question. The hard one is, how do you handle unrendered emoji before closing a parenthesis.\r \r–  rumtscho\n  @Peilonrayz Misread them as what, though? Are you saying misread &#34;Wat?&#34; as &#34;Wat.&#34;? If you don&#39;t want to explain, that&#39;s fine though.\r \r–  Azor Ahai\n  There is no real grammatical rule for this and the very fact that you are using emoji shows that grammar probably isn&#39;t very responsible.\n That being said, from what I see on social media, most people use emojis sort of like punctuation, not text, putting it at the end of a sentence instead of a period/exclamation point. Example:\n  In most cases it serves the same role as punctuation does - conveys the mood of the message. So it&#39;s natural to use it instead of punctuation in those cases. The only exception would be if one uses an emoji to replace a word. But I don&#39;t.\r \r–  Džuris\n  I 🤔most readers can figure out when you use an emoji as a full stop 🙃versus as an interjection or a word replacement 😁based on context.\r \r–  Erty Seidohl\n  @Džuris This seems to be highly subjective. Reading  Today was a great day 😀 versus  Today was a great day. 😀 makes a big difference in my head. The first sentence seems incomplete, the end kind of dangling in the air. The full stop lowers the voice and changes emphasis of the last word.\r \r–  smcs\n  An emoji is just a big dot, isn&#39;t it? We really don&#39;t know the mood of all the small dots written in books and newspapers.I&#39;m glad someone magnified them. Some engineers should go and take a look through a microscope to find the mood of all the small dots that were written in the past.\r \r–  Thomas Weller\n  What does &#34;the very fact that you are using emoji shows that grammar probably isn&#39;t very responsible&#34; mean? I guess it&#39;s a grammatically well-formed utterance, but I can&#39;t make any reasonable sense out of it.\r \r–  Nathaniel\n      I once had the very same question, but for my native language: French. I sent a mail to the &#34;Académie française&#34;, which is the french official language institute.\n After some days I got a very pedantic response telling me that I should not use emojis in any sentence as they were a display of my lack of ability to convey my emotions using my poor vocabulary.\n  Thanks for this anecdote. It&#39;ll probably take a long time before they budge, but unsurprisingly, the official answer is wrong. French has words for emotions, but it doesn&#39;t have a way of expressing them (only experimental languages like Lojban do), thus making emoji&#39;s necessary.\r \r–  stommestack\n  @stommestack You can convey emotions through text without having to explicitly have a symbol for expressing them... We&#39;ve been writing text for centuries. If this was required for written communication, why is it lacking from practically every written language? What does it actually solve? Showing an angry face doesn&#39;t actually convey how angry you are, you might as well just say &#34;I&#39;m angry&#34;. Emoji are still static representations of facial expressions to convey a single feeling, I don&#39;t see how it&#39;s necessary when you can describe the same emotions with words.\r \r–  JMac\n  @JMac Putting &#34;I&#39;m angry.&#34;/&#34;I&#39;m happy.&#34;/&#34;I&#39;m sad.&#34; after another sentence is grammatically correct, but it&#39;s not how anyone actually talks, because your facial expressions and tone of voice fill that need. Emoji&#39;s, like all punctuation, alleviate the lack of them in writing. The oldest preserved text with an emoji in it is a letter from 1635; non-preserved usage is older.\r \r–  stommestack\n  @stommestack It&#39;s not a particularly clear &#34;punctuation&#34;. In fact, it doesn&#39;t seem accepted that they are &#34;punctuation&#34; at all. Punctuation is useful because they are small easy to make and understand markings. Drawing faces doesn&#39;t really work like that at all. Text just straight up isn&#39;t talking. If I want to portray emotions, there are plenty of options to do that over text. Adding a drawing of a facial expression seems like a fairly weird one to me, especially if it were in a medium where you can&#39;t verify exactly what the symbol is intended to represent (unlike on computers).\r \r–  JMac\n  @stommestack What do you mean, French &#34;doesn&#39;t have a way of expressing&#34; emotions? English has such words as &#34;Wow!&#34; for expressing surprise or amazement and &#34;Ouch!&#34; for expressing pain, and surely French has such words as well.\r \r–  Tanner Swett\n    Emoji is new and I believe there haven&#39;t any grammar rules related to emojis. You can put it before, after, or even as a full-stop.\n If you ask me, I prefer to put it as a substitute of punctuation marks. However, I sometimes put it before punctuation marks, indicating that the emoji is still part of the sentence (describing that sentence).\n  God, I miss movie theaters 😟 I hate this pandemic 😡! When will it end?\n I also sometimes think emojis are like phrases you use in parentheses, but as images.\n  In casual communication I think it is acceptable but not in anything serious. (I feel they should not even be used in questions on Stack Exchange.)\r \r–  Willeke\n  We are a site where questions are written in as good English as we can and others will edit it to get it better. Pictures are no part of good English.\r \r–  Willeke\n  @Willeke &#34;😱&#34; is newer than &#34;?&#34; but they are both pictures and there is no sensible reason to allow one and not the other. Only tradition.\r \r–  Džuris\n  I have seen too many emoji (or whatever they may be called) not come through on computers and even phones, which makes the intended meaning only guesswork. And I have also seen many used instead of words where I, (not used to talking in them) do not understand what is meant. People who are used to them do not realize how little they are known in the rest of the world.\r \r–  Willeke\n    A sentence is made up of words, hence Emoji should have no place in them. Putting them after a full stop is the most sensible option. Writing out a sentence, then inserting an Emoji, then the full stop interferes with grammar rules, there will be an ugly space between the last word and the full stop. An Emoji at the end of a sentence should not be seen as part of the sentence, but more like a meta element, conveying a feeling that the preceding words evoke in the writer.\n The alternative is to put the emoji after the full stop. 🤔 But when I follow this with another sentence, it feels like the emoji is now attached to the latter rather than former sentence.\n I disagree here, it still feels attached to the first sentence, probably because in general Emoji are rarely placed before the words they are supposed to characterize.\n    As someone who used emoticons and kaomoji before emoji became widely used, I tend to put emojis where I would put an emoticon or kaomoji. For me, that tends to be either after punctuation or in place of punctuation, and I&#39;ve seen many people who did/do the same :D But I&#39;ve also seen many people who put an emoticon or text face before punctuation. ^^;\n I think that emoji that are illustrative should be put next to their corresponding words (if the emoji aren&#39;t outright replacing the words), and if those words are at the end of a sentence  and there&#39;s another sentence afterward, then I think the emoji should go before the punctuation so that the emoji is not separated from the word it&#39;s illustrating.\n For emoji that are more like gestures (like their own individual messages--thumbs up, the thinking face, etc), if I don&#39;t use them to replace punctuation entirely, then I put mine after punctuation for two reasons:\n If punctuation is present, then I delay the finishing tone (the falling tone when you finish an arbitrary statement in English) in my head until I see the punctuation, and I don&#39;t want other people to read my sentences with unfinished tones\n I also don&#39;t see post-punctuation emoji as attached to the next sentence, but I can definitely see why others might see it that way.\n For further reading, something off the top of my head is  Because Internet by Gretchen McCulloch, which is a fascinating read in general and has a chapter titled &#34;Emoji and Other Internet Gestures&#34;. Lauren Gawne helped greatly with this chapter. McCulloch is a linguist and Gawne is a linguist who does research on gestures, which are also called emblems. I haven&#39;t looked at Gawne&#39;s research separately, though; I&#39;ve only read McCulloch&#39;s book.\n    I&#39;m going to take a stab at creating some rules for this which - of course - are completely made up and meant to be broken. This is a community wiki: please contribute!\n    If the punctuation used modifies the sentence (e.g. &#34;!&#34; or &#34;?&#34;), and the sentence  ends the line, then the emoji goes after the punctuation:\n  But if the sentence doesn&#39;t end the line, then the emoji goes inside the punctuation:\n This is the coolest 👍👍👍👍!!!!! But it&#39;s also not cool 😞\n        The 🐙 and 🌽 emoji are choices and not punctuation, so they count as words. The question mark here is implied.\n Other emoji cannot be used to replace punctuation (it&#39;s unclear if the &#34;🚫&#34; is answering the question here)\n    If emoji are part of a quote and are punctuation, they go inside the quote (this is vs some guidelines in English which put the punctuation outside the quote). You can then have another punctuation symbol outside the quote:\n  Fixed! And it&#39;s a community wiki, so feel free to add edits yourself :)\r \r–  Erty Seidohl\n  I think the ideas that you are presenting here are interesting, and i&#39;m sure it will be interesting to read the ensuing discussion as well. That being said, this is not really what SE questions are used for. Firstly, its not a question, it&#39;s a discussion. SE is supposed to be for people asking for help or exploring the subject. Next it is off topic. It does not ask about the current rules in place, it creates new rules. I do appreciate the discussion you are trying to create, but i feel as though a chat would be better suited than a question. I am asking the moderators to make it a chat.\r \r–  Ankit\n  @Ankit Yeah I agree, that&#39;s why I made it a community wiki, which I think of as an async chat :). But happy to move this to a different format if you&#39;d like.\r \r–  Erty Seidohl\n  I also based these &#34;new rules&#34; based on my own observations of how I and my friends use emoji and would love for other people to add their own experiences, since I think there may not be any &#34;offical&#34; rules for this.\r \r–  Erty Seidohl\n    I would say an emoji does not belong in the middle of a paragraph any more than it belongs in the middle of a sentence. You could always start your new sentence on a new line after the emoji so it would always it would be like the first case you mentioned\n In terms of parts of speech I would say an emoji is closest to an interjection. So put it anywhere you would normally put &#39;YAY&#39; or &#39;BOOM&#39;.\n    One if emojis in isolated sentences within a chat. In this case the stop is usually omitted, and the emoji is just at the end of the sentence. Not before, or after, or replacing it, because there is not a point anywhere.\n The second case is the less common use of emojis in a paragraph, with full sentences, stops and grammar. In this case, they should go before the full stop or any other punctuation mark. I am basing this answer in the common usage of the question/exclamation mark inside two parentheses: (?) and (!). This is not very widely used, and is ugly, but it exists and have done for some time. They are used in a way similar to an emoji, and are written before the punctuation mark.\n    Inspired by MattOnyx who found the answer for the French language I decided to look at advice for the Dutch language. Luckily the answer was easy to find: the &#34;Nederlandse Taalunie&#34; (Dutch language union) who develops and stimulates the policies for the Dutch language has a website called &#34;taaladvies&#34; (language advice). Here you can find the following article:   https://taaladvies.net/taal/advies/vraag/1716/plaats_van_emoticon_of_smiley_in_een_zin_of_tekst/\n The answer here is: if you post the emoji after a sentence it comes after the full stop. There has to be a space before and after the emoji. Examples here are:\n    They make it clear the these guidelines are for all types of emoticons and smileys: both the &#39;western&#39; :-) as well as the eastern ^_^ and images such as the heart ❤️ emoji.\n You can also put a punctuation mark after a smiley, although that can be confusing:\n Linda will start a job in London :-/, but luckily we are going on a trip first.\n Last but not least: they tell you that you can use them in informal written language, and that they don&#39;t belong in newspapers, magazines, or formal web texts.\n    By clicking “Post Your Answer”, you agree to our  terms of service,  privacy policy and  cookie policy", "posttime": "2020-05-09 02:37:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "应该,full,表情符号", "title": "表情符号应该出现在句号之前还是之后？", "title_en": "Should an emoji come before or after a full-stop?", "transed": 1, "url": "https://writing.stackexchange.com/questions/51030/should-an-emoji-come-before-or-after-a-full-stop", "via": "", "real_tags": ["应该", "full", "表情符号"]}, {"category": "", "categoryclass": "", "imagename": "8df45469fe43221c21a69da2083c9232.jpg", "infoid": 1001307, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "许多开发人员真的很想学习围棋，这是谷歌(Google)为大型系统创建的一种编程语言，与此同时，大多数开发人员厌倦了参加会议，而大多数在跨国公司工作的人在那里并不开心。\n这是根据HackerEarth对76个国家的16655多名开发人员进行的调查得出的结果。HackerEarth在印度和旧金山设有办事处，为招聘人员提供远程评估开发人员编程技能的工具。\nGo在大多数开发人员想要了解的语言中名列前茅。调查发现，32%的有经验的开发人员选择Go作为他们想要学习的编程语言，远远领先于24%的Python，后者表示他们想学习Python。\n学习围棋的愿望与远程开发者招聘公司HackerRank的一项类似调查的结果一致。谷歌、Netflix、美国运通、Salesforce、IBM、Target、Twitch、Twitter、Uber和Dropbox都在使用Go。\nGo项目2019年的调查发现，大多数开发人员都在使用该语言进行Web开发，其次是数据库开发、网络编程、系统编程和DevOps。微软的Visual Studio Code(VS Code)是围棋开发人员中使用最广泛的代码编辑器。\n其他最受欢迎的语言有Kotlin、JavaScript、Bash/Shell/PowerShell、微软的JavaScript超集TypeScript、Scala和R。\n专业开发人员说他们知道的前两种语言是Go和JavaScript，紧随其后的是Kotlin、C#、Bash/Shell/PowerShell、Python、Swift和Dart。\n根据对GitHub和Stack溢出的分析，开发者分析师RedMonk目前将Go评为第14位最受欢迎的语言。该公司表示，排名第一的语言是JavaScript，紧随其后的是Python和Java。\n新的HackerEarth调查发现了一些关于开发人员工作条件的有趣但可能并不令人惊讶的发现。例如，当被问及什么可以帮助他们最大限度地提高工作效率时，70%的开发人员表示减少了会议。\n提高工作效率的其他首要要求包括拥有多台显示器、耳机中断政策、全天候供应咖啡和食物，以及整洁的工作空间。\nHackerEarth已经尝试为开发人员工作的不同类型的企业创建幸福指数。调查发现，在跨国公司工作的开发人员中，有70%的人对自己的工作不满意，相比之下，在成长期创业公司工作的开发人员中，这一比例为14%。在中小型企业工作的开发人员中，只有7%的人表示对那里不满意。\n开发人员看重的前三大好处是良好的职业道路、技术挑战和有趣的项目，以及薪酬。", "note_en": "Lots of developers really want to learn Go, a programming language for large systems created by Google, meanwhile most developers are sick of attending meetings, and most of those working at multinational corporations aren&#39;t happy there.\n That&#39;s according to the results of a  survey of over 16,655 developers from 76 countries carried out by HackerEarth, a company with offices in India and San Francisco that provides tools for recruiters to remotely assess developer coding skills.\n    Go comes out top of the languages most developers want to know. The survey finds that 32% of experienced developers pick Go as the programming language they want to learn, well ahead of Python, which 24% say they want to learn.\n The desire for learning Go lines up with the results of a  similar survey by remote developer hiring firm HackerRank. Go is used at Google, Netflix, American Express, Salesforce, IBM, Target, Twitch, Twitter, Uber, and Dropbox.\n The Go project&#39;s 2019 survey found that most developers are using the language for web development, followed by database development, network programming, systems programming, and DevOps. Microsoft&#39;s Visual Studio Code (VS Code) is the most widely used code editor among Go developers.\n   Other top desired languages are Kotlin, JavaScript, Bash/Shell/PowerShell, Microsoft&#39;s JavaScript superset Typescript, Scala, and R.\n The top two languages that professional developers say they know are Go and JavaScript, followed by Kotlin, C#, Bash/Shell/PowerShell, Python, Swift, and Dart.\n   Developer analyst RedMonk currently ranks Go as the  14th most popular language based on its analysis of GitHub and Stack Overflow. The firm says the top language is JavaScript, followed by Python and Java.\n The new HackerEarth survey turns up some interesting but perhaps unsurprising findings about developer work conditions. For example, asked what could help them maximize productivity, 70% of developers say fewer meetings.\n Other top requests for improved productivity include having multiple monitors, a headphone interruption policy, around the clock coffee and food supply, and a clutter-free workspace.\n HackerEarth has tried creating a happiness index for the different types of businesses where developers work. It found 70% of developers who work at a multinational corporation aren&#39;t happy with their job compared with 14% who work at a growth stage startup and aren&#39;t happy with their job. Just 7% of developers who work at a small and medium business report being unhappy there.\n The top three benefits developers value are a good career path, technical challenges and interesting projects, and compensation.", "posttime": "2020-05-09 02:17:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,开发,google,谷歌,programming", "title": "开发人员称谷歌围棋是2020年最受欢迎的编程语言", "title_en": "Developers say Google's Go is 'most sought after' programming language of 2020", "transed": 1, "url": "https://www.zdnet.com/article/developers-say-googles-go-is-most-sought-after-programming-language-of-2020/", "via": "", "real_tags": ["2020", "开发", "google", "谷歌"]}, {"category": "", "categoryclass": "", "imagename": "bfb40cb73b9a454c07de95bada2d4de9.jpg", "infoid": 1001306, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "研究发现，在这个国家之前10周患有这种疾病的人已经发现了病例，因为医生说，这种疾病传播缓慢，直到2月下旬才加速。", "note_en": "Study finds person who had the disease 10 weeks before the country had detected cases, as doctor says it spread slowly until late February before accelerating.", "posttime": "2020-05-09 02:17:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,病毒,胸部,analysis,发现", "title": "法国11月16日出现冠状病毒，医院在分析胸部扫描后表示", "title_en": "France had Covid-19 on November 16, hospital says after analysis of chest scans", "transed": 1, "url": "https://www.scmp.com/news/china/society/article/3083599/france-had-covid-19-november-hospital-says-after-analysis-chest", "via": "", "real_tags": ["冠状病毒", "病毒", "胸部", "analysis", "发现"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001304, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿的国会调查人员要求提供有关特朗普集团(Trump Organization)在冠状病毒危机后要求包括英国在内的外国政府提供贷款和其他资金的信息。\n在要求提供信息之前，上月有媒体报道称，特朗普集团(Trump Organization)正在寻求英国和爱尔兰的纾困资金，以支付因疫情而被该公司在欧洲的高尔夫物业暂时解雇的员工的工资。\n众议院监督和改革委员会民主党主席卡罗琳·马洛尼(Carolyn Maloney)在致总统之子、特朗普集团(Trump Organization)副主席埃里克·特朗普(Eric Trump)的一封信中表示，在英国寻求资金的决定存在问题，可能违反了美国宪法，宪法要求总统对美国有绝对的忠诚度。\n美国国会已经通过立法，禁止美国纳税人资金用于唐纳德·特朗普(Donald Trump)持有股份的公司。\n马宏升写道：“除了你的行为在美国造成的严重薪酬条款问题外，英国官员还对使用自己的纳税人资金救助特朗普总统的公司提出了严重关切。”\n她指出，据报道，苏格兰阿伯丁郡(Aberdeenshire)议员马丁·福特(Martin Ford)的言论称，鉴于总统自己的个人财富，他认为英国纳税人不应该帮助特朗普。阿伯丁郡是特朗普在苏格兰的两处豪华房产之一。福特告诉彭博新闻社：“通过提高税收，所有人都将为此付出巨大的代价。”\n在她的要求中，马宏升呼吁埃里克·特朗普在5月21日之前提交“与特朗普集团向包括英国政府在内的任何国内外政府实体申请任何贷款或其他资金有关的所有文件和通讯”。这位女议员还在寻找特朗普集团与任何美国联邦雇员和官员之间与这种新型冠状病毒有关的所有文件和通信。\n彭博新闻社(Bloomberg News)4月份报道称，特朗普集团(Trump Organization)正在寻求救助资金，以帮助支付调酒师、风笛手和其他被暂时解雇的员工的费用。特朗普仍保留该公司的个人股份，在英国和爱尔兰拥有三个高尔夫度假村。\n众议院监督委员会有权传唤文件和调查“任何事情”，其强大的女主席要求提供信息，并不意味着这些文件将自动提交给国会。特朗普政府无视国会权威，拒绝了之前要求提供信息的要求。\n在此前向《今日美国报》发表的声明中，埃里克·特朗普表示，英国政府的留任计划旨在帮助公司留住和支持员工，该计划允许企业寻求政府资金来支付大部分被暂时解雇的员工的工资。\n他说：“英国政府制定的保住工作计划与特朗普集团无关，对企业没有好处--这纯粹是为了保护原本会失业的人和他们的家人。”", "note_en": "Congressional investigators in Washington are demanding information about loans and other funds that the Trump Organization has requested from foreign governments, including Britain, in the wake of the coronavirus crisis.\n The demand for information follows a  media report last month that said the Trump Organization was seeking UK and Irish bailout funds to cover wages of employees who had been furloughed from the company’s golf properties in Europe due to the pandemic.\n In  a letter to Eric Trump, the president’s son and vice president of the Trump Organization, Carolyn Maloney, the Democratic chairwoman of the House oversight and reform committee, suggested the decision to seek funding in the UK was problematic and potentially a violation of the US constitution, which calls for a president to have undivided loyalty to the US.\n  The US Congress has already passed legislation prohibiting US taxpayer funds from being used to benefit companies in which  Donald Trump holds a stake.\n “Apart from the grave emoluments clause problems your actions cause in the United States, officials in the United Kingdom have raised serious concerns about using their own taxpayer funds to bail out President Trump’s companies,” Maloney wrote.\n She pointed to reported remarks by Martin Ford, a councillor in Aberdeenshire, Scotland, where one of Trump’s two Scottish luxury properties is located, who said he did not believe UK taxpayers ought to be helping Trump given the president’s own personal wealth. “The huge tab for this will be borne throughout the whole population through higher taxes,” Ford told Bloomberg News.\n In her request, Maloney called on Eric Trump to deliver by 21 May “all documents and communications relating to the Trump Organization’s application for any loans or other funds from any domestic or foreign government entity, including the British government”. The congresswoman is also seeking all documents and communications between the Trump Organization and any US federal employees and officials that relate to the novel coronavirus.\n Bloomberg News reported in April that the Trump Organization was seeking the bailout money to help pay for bartenders, bagpipers, and other employees who have been furloughed. Trump, who still retains a personal stake in the company, owns three golf resorts in the UK and Ireland.\n The demand for information by the powerful chairwoman of the House oversight committee, which has the power to subpoena documents and investigate “any matter”, does not automatically mean the documents will be delivered to Congress. The Trump administration has refused previous demands for information, in defiance of congressional authority.\n In a previous statement to USA Today, Eric Trump said the British government’s job retention plan, which allows companies to seek government funds to pay for most of furloughed employees’ salaries, was intended to help the company retain and support its staff.\n “The job retention plan created by the UK Government has nothing to do with the Trump Organization and does not benefit the business – it is solely about protecting people and their families who would otherwise be out of work,” he said.", "posttime": "2020-05-09 01:45:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,coronavirus,病毒,demand,特朗普", "title": "民主党人要求特朗普组织提供英国冠状病毒援助的细节", "title_en": "Democrats demand details of Trump Organization requests for UK coronavirus aid", "transed": 1, "url": "https://www.theguardian.com/us-news/2020/may/08/democrats-demand-details-of-trump-organization-requests-for-uk-coronavirus-aid", "via": "", "real_tags": ["冠状病毒", "病毒", "demand", "特朗普"]}, {"category": "", "categoryclass": "", "imagename": "29407a7b91f09db8091f62514cc7aad9.jpg", "infoid": 1001303, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "帮助支持弗兰在PATREON上的Youtube频道：http://www.patreon.com/frantone公民！在令人兴奋的摩擦焊接领域，新的机会正等着您。", "note_en": "Help Support Fran's YouTube Channel on Patreon: http://www.patreon.com/frantone Citizen! New opportunities await you in the exciting field of Friction Weldin...", "posttime": "2020-05-09 01:25:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "摩擦,friction,支持", "title": "建造摩擦焊机(2012)[视频]", "title_en": "Build a Friction Welder (2012) [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=r0zpqhhcmp4", "via": "", "real_tags": ["摩擦", "friction", "支持"]}, {"category": "", "categoryclass": "", "imagename": "c064475a2f550ce096a3264c638ef3d6.jpg", "infoid": 1001302, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "寻找开放的职位，并与400多家经过审查、资助的YC初创公司的创始人和招聘团队建立联系。", "note_en": "Find open roles and connect with founders and hiring teams of over 400 vetted, funded YC startups.", "posttime": "2020-05-09 01:25:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "创业,列出,list,开放", "title": "Y Combinator列出的创业公司中最活跃的招聘公司", "title_en": "Y Combinator's list of most active hiring companies on Work at a Startup", "transed": 1, "url": "https://www.workatastartup.com/job_list?utm_source=hn_jobs", "via": "", "real_tags": ["创业", "列出", "list", "开放"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001299, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一小部分人更容易受到SARS-CoV-2感染引起的严重并发症和死亡的影响。是什么导致了这个漏洞？\n越来越多的证据表明，患有严重冠状病毒的患者通常有一种或多种先前存在的疾病(共病)。为了描述需要住院的冠状病毒患者的共病情况，最近的一个病例系列跟踪了纽约市12家不同医院的5700名患者在五周内的病程。研究显示，住院患者的平均年龄为63岁，其中57%患有高血压，34%患有糖尿病，42%患有肥胖症。有趣的是，绝大多数患者(88%)有两种或两种以上的共病。\n虽然这些潜在的疾病显然是严重冠状病毒的危险因素，但造成受影响患者发病率和死亡率的确切机制尚不清楚。尽管如此，关于这一主题的铺天盖地的文献不断涌现，提供了一些洞察力。\n先天免疫系统的哨兵细胞可以感知到前所未见的病毒的存在，并引发一系列事件，将巨噬细胞、中性粒细胞和树突状细胞等免疫细胞动员到感染部位。一旦到了那里，这些免疫细胞就会产生被称为细胞因子的促炎信号蛋白，然后提示其他反应，并为未来的功能启动适应性T和B细胞。细胞因子的主要波包括I型干扰素，它刺激信号级联，最终限制病毒复制。随着感染的进展和病毒的清除，招募的免疫细胞和由此产生的细胞因子通常会消退，患者也会康复。然而，在某些情况下，免疫反应仍在继续，导致过度的炎症反应，通常被称为“细胞因子风暴”。\n为了确定SARS-CoV-2相关细胞因子风暴中的一些关键因素，法国的一个研究小组分析了50名经历不同疾病严重程度的冠状病毒患者的细胞因子反应。作者发现，患有严重疾病的患者血液中的病毒水平持续较高-这种情况被称为病毒血症，并且I型干扰素反应明显受损。相比之下，轻到中度疾病的患者表现出低病毒血症和高I型干扰素应答。与此同时，严重疾病患者的促炎细胞因子肿瘤坏死因子-⍺和白细胞介素-6(IL-6)水平升高，这两种因子都是发热和其他因细胞因子产生而发生的组织变化的主要促进剂。作者认为，严重冠状病毒患者出现的急性呼吸窘迫综合征可能是由这些促炎细胞因子和受损的I型干扰素反应共同作用引起的。\n作者还指出，危重患者产生的T细胞水平较低，这一效果与观察到的SARS-CoV-2可以感染和杀死T细胞的观察结果一致。由于T细胞对于直接杀死受感染的宿主细胞以及调节和/或抑制免疫反应至关重要，这一发现将进一步解释为什么患有严重疾病的患者会有更多的炎症。\n促炎细胞因子的运输增加也会导致凝血功能障碍。正常的血液凝结通常涉及凝血因子的聚集，以限制过度出血和捕获微生物。SARS-CoV-2感染会导致血栓形成，即在整个肺部形成小凝块，这会限制血液流动，从而限制肺部血液的氧合。有时，血块碎片会破裂，滞留在血管中，并导致危及生命的大脑或其他重要器官的血液流动受阻，从而影响它们的功能。凝块的消化释放出名为D-二聚体的小蛋白片段，它们被用作严重疾病的生物标志物，并与冠状病毒患者死亡风险的增加有关。随着凝块的形成和分解，凝血因子的供应会耗尽，导致血管渗漏和液体进入肺部和其他组织。\n随着我们对SARS-CoV-2发病机制有了更好的了解，可能有必要通过监测肿瘤坏死因子-⍺、IL-6和D-二聚体等生物标志物的存在来跟踪高危患者的疾病进展。与严重冠状病毒相关的共病也可能阻止I型干扰素的产生并加剧炎症。例如，肥胖会导致I型干扰素反应降低。以IL-6或肿瘤坏死因子-⍺为靶点的干扰素和/或抗炎治疗可以减轻合并症患者的病情严重程度。目前正在进行临床试验，以评估在冠状病毒背景下IL-6靶向治疗的益处。一个\n所有因素都考虑到，只有大约95%的严重冠状病毒病例是由老年或上述并存疾病引起的。有一小部分50岁以下的人病情严重，即使没有明显的共病，也会死于SARS-CoV-2感染。专家认为，某些遗传因素可能会使以前健康的年轻人容易患上严重的疾病。为了回顾这个话题，我推荐洛克菲勒大学的Jean-Laurent Casanova的采访。\n[辛迪·莱弗(Cindy Leifer)在“免疫”第30集对SARS-CoV-2感染背景下的血液凝固进行了很好的解释。]", "note_en": "A small subset of people are more vulnerable to severe complications and death resulting from SARS-CoV-2 infection. What causes this vulnerability?\n An increasing body of evidence suggests that patients suffering from severe COVID-19 often have one or more pre-existing conditions (co-morbidities). In an effort to describe the co-morbidities of COVID-19 patients requiring hospitalization, a recent  case series tracked the course of disease in 5,700 patients in 12 different New York City hospitals over a period of five weeks. The study revealed that the median age of the hospitalized patients was 63, and that 57% of these patients had hypertension, 34% had diabetes, and 42% were obese. Interestingly, the vast majority of the patients (88%) had two or more of these co-morbidities.\n While these underlying diseases are clearly risk factors for severe COVID-19, the exact mechanisms responsible for the morbidity and mortality in the affected patients are unclear. Nonetheless, the overwhelming amount of literature continuously emerging on this topic provides some insight.\n Sentinel cells of the innate immune system can sense the presence of viruses never seen before and trigger a cascade of events that mobilizes immune cells such as macrophages, neutrophils, and dendritic cells to the site of infection. Once there, these immune cells produce pro-inflammatory signaling proteins known as cytokines, which then cue other responses and prime adaptive T and B cells for future functions. A primary wave of cytokines includes type I interferons, which stimulate a signaling cascade that ultimately limits viral replication. As the infection progresses and the virus is cleared, the recruited immune cells and resulting cytokines typically recede and the patient recovers. However, in some cases the immune reaction continues, leading to an excessive inflammatory response often referred to as a “cytokine storm.”\n In an effort to define some of the key players in SARS-CoV-2-associated cytokine storms, a group in France  analyzed the cytokine responses in fifty COVID-19 patients experiencing varying disease severity. The authors found that patients with severe disease had persistently high levels of virus in the blood – a condition known as viremia, and a significantly impaired type I interferon response. In contrast, patients with mild to moderate disease exhibited low viremia and a high type I interferon response. In parallel, patients with severe disease had increased levels of the pro-inflammatory cytokines tumor necrosis factor-⍺ and interleukin-6 (IL-6), both of which are major promoters of fever and other tissue changes that occur in response to cytokine production. The authors suggest that the acute respiratory distress syndrome seen in patients with severe COVID-19 may be triggered by a combined effect of these pro-inflammatory cytokines and impaired type I interferon responses.\n The authors also note that critically ill patients produced lower levels of T cells, an effect that aligns with observations that SARS-CoV-2 can infect and kill T cells. Because T cells are crucial for directly killing infected host cells and regulating and/or suppressing the immune response, this finding would further explain why patients with severe disease have more inflammation.\n Increased trafficking of pro-inflammatory cytokines can also lead to dysfunctions in blood clotting. Normal blood clotting typically involves the aggregation of clotting factors to limit excessive bleeding and trap microorganisms. SARS-CoV-2 infection can cause  thrombosis, the formation of small clots throughout the lungs, which can restrict blood flow and thus oxygenation of the blood in the lungs. Sometimes, pieces of the clots can break off, lodge in vessels, and cause life-threatening obstruction of blood flow to the brain or other vital organs, thereby compromising their function. The digestion of clots releases small protein fragments called D-dimers, which are being used as biomarkers of severe disease and are associated with an  increased risk of death in COVID-19 patients. As clots form and break down, the supply of clotting factors is depleted, leading to leaky blood vessels and movement of fluid into the lungs and other tissues.\n As we gain a better understanding of SARS-CoV-2 pathogenesis, it may be necessary to track disease progression in high-risk patients by monitoring the presence of biomarkers like tumor necrosis factor-⍺, IL-6, and D-dimers. It is possible that co-morbidities associated with severe COVID-19 also prevent production of type I interferon and exacerbate inflammation. For example, obesity can lead to reduced type I interferon responses. The severity of disease in patients with comorbidities could be mitigated with administration of interferon and/or anti-inflammatory therapies that target IL-6 or tumor necrosis factor-⍺. Clinical trials are currently underway to evaluate the benefits of IL-6 targeted therapy in the context of COVID-19. Also, if D-dimers are detected in a timely manner, patients can be treated with heparin or other blood thinners to prevent thrombosis, which might improve COVID-19 outcomes. Further studies are needed to identify additional drugs that can be used to target key inflammatory markers in SARS-CoV-2 infection.\n All things considered, only about 95% of severe COVID-19 cases are accounted for by old age or the co-morbidities described above. There is a small subset of individuals under the age of 50 who become very ill and die from SARS-CoV-2 infection even in the absence of obvious co-morbidities. Experts believe that certain genetic factors may predispose younger, previously healthy individuals to severe disease. For a review of this topic, I recommend this  interview with Jean-Laurent Casanova of Rockefeller University.\n [Cindy Leifer provides an excellent explanation of blood clotting in the context of SARS-CoV-2 infection on episode 30 of  Immune.]", "posttime": "2020-05-09 01:24:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,病毒,表明,existing,患者", "title": "有证据表明，那些患有严重冠状病毒的人有相同的先前存在的疾病", "title_en": "Evidence Suggests Those With Severe Covid-19 Have Same Pre-existing Ponditions", "transed": 1, "url": "https://www.virology.ws/2020/05/07/the-perfect-storm/", "via": "", "real_tags": ["冠状病毒", "病毒", "表明", "existing", "患者"]}, {"category": "", "categoryclass": "", "imagename": "79ca2259decd5877572e6df1dfda2e29.jpeg", "infoid": 1001298, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当你面临制定战略或做出重要决定时，你怎么知道你已经考虑了足够多的不同选择，并且能够自信地进行下去？\n如果你和大多数人一样，你可能会依赖直觉，再加上现成的信息--你只是凭直觉行事。这就是所谓的内观：\n内部视图通过关注特定任务和使用近在咫尺的信息来考虑问题，并根据这组狭窄而独特的输入做出预测。这些输入可能包括轶事证据和错误的看法。[1]。\n有时，我们认为唯一重要的信息是那些最重要的或容易获得的信息，而不考虑可能丢失的信息。任何基于内幕观点形成的战略都将从根本上受到限制。\n外界并不认为一个问题是独一无二的，而是想知道其他人是否也面临过类似的问题，如果是的话，发生了什么。外界的观点是一种不自然的思考方式，正是因为它迫使人们把收集到的所有宝贵的信息都放在一边。外部观点通常可以为决策者提供非常有价值的现实检验。[2]。\n显然，外面的景色比里面的景色更令人向往，但这并不总是一个容易接受的视角。那么，你怎样才能抛开你自己珍视的假设，压力测试你的战略，并对你的决定充满信心地前进呢？\n我最近遇到了几种相关的技巧，用于创造性地思考战略问题，并(希望)采用外部观点。它们每一个都涉及到从敌对的角度来考虑你的问题。\n“我们怎么可能成为那个会让我们破产的公司呢？”\n“这种掠食者可能长什么样，为什么它会比我们有优势？”\n安迪·格罗夫(Andy Grove)与戈登·摩尔(Gordon Moore)进行了类似的讨论，询问他们的继任者在80年代中期会在英特尔(Intel)做些什么：\n“如果我们被开除，董事会请来一位新CEO，你认为他会怎么做？”戈登毫不犹豫地回答说：“他会让我们摆脱记忆。”我盯着他，然后说，“为什么你和我不能走出门，回来自己做呢？”[3]。\n他们继续扼杀内存业务，将资源集中在微处理器上，永远改变了这一业务。\n我想到的让一家初创公司变得更强大、更专注的最好方法是告诉他们，如果我是他们的假竞争对手，我会怎么做。竞争对手冷酷无情的视角往往有助于突出重要之处和不重要之处。所以，问问你的聪明朋友他们会怎么做。问你的聪明朋友他们会如何与你竞争比问：“那么，你觉得我的想法怎么样？”比起问：“那么，你觉得我的想法怎么样？”这是一种更吸引人的方式来获得更好的反馈。不是有人可能会伤害你的感情，而是另一个人可以产生很多想法，供你以后使用。\n当你探索你的策略时，问问你自己，你的邪恶双胞胎会怎么做。他们怎么会让你破产呢？他们会推出什么产品，他们会采用什么样的信息传递和定位，他们会雇佣什么样的人？如果你的董事会突然用他们取代了你，他们头90天会是什么样子？\n这类问题将帮助你避开内幕，更全面地探索前进的道路。", "note_en": "When faced with setting your strategy or making an important decision, how do you know you’ve considered enough diverse options and can proceed with confidence?\n If you’re like most folks, you might rely on intuition coupled with readily available information—you just go with your gut. This is called taking the  inside view:\n An inside view considers a problem by focusing on the specific task and by using information that is close at hand, and makes predictions based on that narrow and unique set of inputs. These inputs may include anecdotal evidence and fallacious perceptions. [1]\n Sometimes we think the only information that matters is that which is top-of-mind or easily attainable, without considering what might be missing. Any strategy shaped on the inside view will be fundamentally limited.\n  Rather than seeing a problem as unique, the outside view wants to know if others have faced comparable problems and, if so, what happened. The outside view is an unnatural way to think, precisely because   it forces people to set aside all the cherished information they have gathered . The outside view can often create a very valuable reality check for decision makers. [2]\n Clearly, the outside view is more desirable than the inside view, but it’s not always an easy view to take. So how can you set aside your own cherished assumptions, pressure test your strategy, and move forward with confidence in your decision?\n  I’ve recently come across several related techniques for thinking creatively about strategic questions and (hopefully) adopting the outside view.  They each involve considering your question from an adversarial point of view.\n  “How can we become the company that would put us out of business?”\n “What might this predator look like and why would it have an advantage over us?”\n Andy Grove had a similar discussion with Gordon Moore, asking what their successors would do in their shoes at Intel in the mid-80s:\n “If we got kicked out and the board brought in a new CEO, what do you think he would do?”  Gordon answered without hesitation, “He would get us out of memories.” I stared at him, then said, “Why shouldn’t you and I walk out the door, come back and do it ourselves?” [3]\n They went on to kill their memory business and focus their resources on microprocessors, changing the businesses forever.\n  The best way I’ve thought of to make a startup more formidable and narrowly focused is to tell them what I’d do if I were their faux competitor. The ruthless perspective of a competitor often helps sharpen what’s important &amp; what’s not. So, ask your smart friend what they’d do.  Asking your smart friend how they’d compete with you is a more engaging way to get better feedback than asking: “So, what do you think of my idea?” Instead of someone possibly hurting your feelings, the other person gets to generate many ideas that you can use later.\n As you explore your strategy, ask yourself what your evil twin would do. How would they put you out of business? What product would they launch, what messaging and positioning would they adopt, what hires would they make? What would their first 90 days look like if your board suddenly replaced you with them?\n These kinds of questions will help you avoid the inside view and more fully explore your paths forward.", "posttime": "2020-05-09 01:24:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "策略,twin,信息", "title": "邪恶双胞胎：一种从外部看你的策略的技巧", "title_en": "The Evil Twin: a technique for taking an outside view of your strategy", "transed": 1, "url": "https://medium.com/@patrickjwoods/the-evil-twin-a-technique-for-taking-an-outside-view-of-your-strategy-3038783e2d40", "via": "", "real_tags": ["策略", "twin", "信息"]}, {"category": "", "categoryclass": "", "imagename": "9cefc91cfc66ce91ca71560886c4253b.jpg", "infoid": 1001297, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国有线电视新闻网(CNN)报道，2018年，香港大学的传染病专家偶遇了一名不同寻常的患者。\n这名56岁的男子接受了肝脏移植，在没有明显原因的情况下表现出肝功能异常。\n测试发现，他的免疫系统对戊型肝炎有反应--但他们实际上在他的血液中找不到戊型肝炎病毒(HEV)的人类毒株。\n戊型肝炎是一种肝病，也可能导致发烧、黄疸和肝脏肿大。这种病毒有四种，它们在不同的动物中传播；当时，人们只知道这四种中只有一种会感染人类。\n随着对人类戊型肝炎病毒株的检测呈阴性，研究人员重新设计了诊断测试，再次运行-历史上第一次在人类中发现了老鼠戊型肝炎。\n突然之间，我们有了一种可以从街头老鼠传染给人类的病毒，发现这一发现的香港大学研究人员之一、微生物学家西德哈斯·斯里达尔(Siddharth Sridhar)博士说。这是一种不同寻常的史无前例的感染，研究小组怀疑这是否是一次性事件，一名患者在错误的时间出现在错误的地点。\n自第一项研究以来，又有10名香港居民的鼠戊型肝炎(又称鼠戊型肝炎)检测呈阳性。最近的一例发生在一周前；4月30日，一名61岁的肝功能异常男子检测呈阳性。斯里达尔说，可能还有数百名未确诊的感染者。\n根据世界卫生组织(World Health Organization)的说法，人类戊型肝炎病毒株通常通过饮用水的粪便污染传播。\n但是，老鼠菌株带来了一个新的谜团：没有人确切地知道这些人是如何被感染的。在这一发现后的两年里，研究人员尚未确定从老鼠传染给人类的确切途径。他们有理论--也许病人喝了像通常的人类菌株一样的受污染的水，或者处理了受污染的物品--但没有任何东西得到明确的证明。\n这位61岁的最近的患者让当局特别困惑；他的家里没有老鼠或老鼠粪便，他家其他人都没有表现出症状，他最近也没有旅行史。\n香港卫生防护中心(CHP)在4月30日的一份声明中表示，根据现有的流行病学信息，无法确定感染源和感染途径。这名男子目前仍在医院，卫生防护中心的调查仍在进行中。\n自2018年以来，研究小组和城市当局一直在努力更好地了解这种新的健康威胁。\n他们已经取得了一些进展。他们的诊断测试得到了改进和改进。他们在卫生保健部门传播了意识，让医生知道要检测鼠类戊型肝炎病毒，并发起了提高公众意识的运动。\n科学家们正在全市范围内测试老鼠种群，试图在它们跳到人类身上之前识别集群，这提供了关于城市中有多少啮齿动物携带老鼠HEV以及哪些地区老鼠最多的数据。\n但仍有许多事情是未知的。他们不知道这种病毒的潜伏期有多长--也就是说，患者在接触病毒后需要多长时间才会生病。他们仍在努力寻找一种治疗方法，因为用于治疗人类变异戊型肝炎的药物在老鼠戊型肝炎患者身上的效果好坏参半。\n不知道病毒是如何从老鼠跳到人身上的，这就很难防止进一步的感染--甚至很难理解研究人员收集的所有数据。例如，理论上说，生活在老鼠出没地区的人应该有更高的风险，但一些受感染的患者来自老鼠数量较少的社区。\n我们所知道的是，香港的老鼠携带病毒，我们对人类进行了检测，发现了病毒。但它到底是如何在它们之间跳跃的--是老鼠污染了我们的食物，还是有其他动物参与其中，我们不知道，斯里达尔说。那是缺失的一环。\n一种解决方案可能是消灭香港所有的老鼠，但消灭老鼠是一项漫长而复杂的壮举，不太可行。这将需要减少他们可以避难的地方以及他们获得食物的机会，采取诸如防止食物被丢弃在后巷等措施。\n目前，当局所能做的就是敦促人们采取预防措施，比如饭前洗手，正确储存食物或放在冰箱里，保持家庭清洁，并在最小的啮齿动物巢穴进行消毒。\n专家说，这很可能不仅仅是香港的问题，甚至不是最近的问题。鼠类HEV可能会感染纽约或巴黎的人，我们只是不知道--因为没有人在检测它。\n我的感觉是，这已经持续了很长时间了，斯里达尔说。2017年、2018年绝对不是世界上第一次发生这样的事情了。\n他补充说，在香港，这11例确诊病例可能只是冰山一角。医生之所以能够对他们进行鼠类HEV检测，是因为他们寻求医疗救治以发现症状，或者因为先前存在的疾病或移植而接受检查。\n但他说，社区中可能有数百例感染病例，他们不属于这些类别，也没有被诊断出来。\n许多戊型肝炎患者只有轻微的症状，在某些情况下，他们甚至不知道自己感染了病毒或去了医院。\n但该病毒可能会带来严重的健康后果，特别是对免疫力较弱的患者。年轻、健康、没有既往疾病的人可能能够自行康复，但对于脆弱人群来说，它可能会导致患者无法摆脱的慢性肝炎，以及长期的肝脏损伤和组织疤痕。\n除了香港的11例病例外，全球只有一例确诊病例-一名加拿大男子，他曾去过非洲。根据2019年2月的一份报告，他在经历了麻疹、恶心、严重黄疸和肝脏发炎后去了医院，鼠类HEV检测呈阳性。\n当局发现这起病例的唯一原因是因为他们使用了一种广泛类型的测试，可以检测到戊型肝炎病毒的许多链，研究人员在这份发表在感染性疾病杂志上的报告中说。报告称，否则，诊断可能会被遗漏。\n这就是问题所在--大多数国家都没有检测鼠类戊型肝炎病毒，所以他们很有可能只是漏诊了，斯里达尔说。\n它需要一个专门的测试，就像香港大学设计的那样，在人类身上专门寻找鼠类HEV。这并不是一项困难的测试，但它并没有被广泛采用，因为直到最近还没有人认为鼠类HEV对人类构成威胁。\n例如，欧洲疾病预防和控制中心(ECDC)的Cornelia Adlhoch和德国Paul-Ehrlich-Institut的Sally Bayllis在今年3月发表在“肝病学”杂志上的一封信中说，在欧洲，医生缺乏认识和标准化的诊断导致戊型肝炎病例报告不足。\n这封信说，直到去年，ECDC才最终制定了如何收集戊型肝炎数据和报告信息的指南--但这些新指南专注于人类变种，不包括老鼠戊型肝炎病毒，留下了斯里达尔所说的诊断盲点。\n这一盲点，以及病毒在没有任何控制措施的情况下感染全球人民的可能性，将社会上一些最脆弱的人置于危险之中--老年人、受艾滋病毒影响的社区、有既往疾病的人等等。\n这不应该发生，斯里达尔说。我们需要公众持续保持警惕，以控制这种不同寻常的感染。我真的希望公共卫生当局迈出第一步，看看他们的人口实际上接触了多少老鼠戊型肝炎。", "note_en": "(CNN)In 2018, infectious disease experts at the University of Hong Kong came across an unusual patient.\n The 56-year-old man, who had undergone a liver transplant, was showing abnormal liver functions with no obvious cause.\n Tests found that his immune system was responding to hepatitis E -- but they couldn&#39;t actually find the human strain of the hepatitis E virus (HEV) in his blood.\n   Hepatitis E is a liver disease that can also cause fever, jaundice and an enlarged liver. The virus comes in four species, which circulate in different animals; at the time, only one of these four was known to infect humans.\n With tests for that human strain of HEV negative, the researchers redesigned the diagnostic test, ran it again -- and found, for the first time in history, rat hepatitis E in a human.\n   &#34;Suddenly, we have a virus that can jump from street rats to humans,&#34; said Dr. Siddharth Sridhar, a microbiologist and one of the HKU researchers who made  the discovery. It was such an unusual and unprecedented infection that the team wondered if it was a &#34;one-off incident, one patient who was in the wrong place at the wrong time.&#34;\n  Since that first study, 10 more Hong Kong residents have tested positive with rat hepatitis E, also known as rat HEV. The most recent case came a week ago; a 61-year-old man with abnormal liver function tested positive  on April 30. And there might be hundreds more infected undiagnosed people out there, said Sridhar.\n  The human strain of hepatitis E is typically transmitted through fecal contamination of drinking water, according to the  World Health Organization.\n But the rat strain poses a new mystery:  nobody knows exactly how these people are getting infected. In the two years since the discovery, researchers have yet to identify the exact route of transmission from rats to humans. They have theories -- maybe the patients drank contaminated water like the usual human strain, or handled contaminated objects -- but nothing&#39;s been definitively proven.\n The 61-year-old recent patient has authorities particularly stumped; there were no rats or rat excrement in his home, nobody else in his household has shown symptoms, and he has no recent travel history.\n &#34;Based on the available epidemiological information, the source and the route of infection could not be determined,&#34; said Hong Kong&#39;s Centre for Health Protection (CHP) in a statement on April 30. The man is still in the hospital, and the CHP&#39;s investigation is ongoing.\n  The research team and city authorities have been trying to better understand this new health threat since 2018.\n They&#39;ve made some progress. Their diagnostic tests have been refined and improved. They&#39;ve spread awareness among the health care sector so doctors know to test for rat HEV, and launched public awareness campaigns.\n Scientists are testing rat populations citywide to try to identify clusters before they can jump to humans, which has provided data on how many rodents in the city carry rat HEV and which areas have the most rats.\n  But there is still much that remains unknown. They don&#39;t know how long this virus&#39; incubation period is -- meaning how long it takes for patients to get sick after exposure. They&#39;re still trying to find a treatment, as the medication used to treat the human variant of hepatitis E has had mixed results on patients with rat HEV.\n  Not knowing how the virus jumps from rats to humans makes it very difficult to prevent further infections -- or even to make sense of all the data researchers have collected. For instance, people who live in rat-infested areas should theoretically be at higher risk, yet some infected patients come from neighborhoods with low rat numbers.\n &#34;What we know is the rats in Hong Kong carry the virus, and we test the humans and find the virus. But how exactly it jumps between them -- whether the rats contaminate our food, or there&#39;s another animal involved, we don&#39;t know,&#34; said Sridhar. &#34;That&#39;s the missing link.&#34;\n  One solution could be to just get rid of all the rats in Hong Kong, but rat eradication is a long, complicated feat that isn&#39;t very feasible. It would require reducing places they can shelter as well as their access to food, with measures like preventing food from being discarded in back alleys.\n For now, all authorities can do is urge people to take preventative measures, like washing their hands before eating, storing food properly or in the fridge, and keeping the household clean and disinfected with minimal nesting places for rodents.\n  This likely isn&#39;t just a Hong Kong problem, or even a recent one, experts say. Rat HEV could be infecting people in New York or Paris, and we just don&#39;t know it -- because nobody is testing for it.\n &#34;My feeling is, this has been going on for a long time,&#34; said Sridhar. &#34;2017, 2018 is definitely not the first time it&#39;s happened in the world.&#34;\n Within Hong Kong, the 11 confirmed cases are likely just the tip of the iceberg, he added. Doctors were able to test them for rat HEV because they sought medical attention for symptoms, or were receiving checkups because of pre-existing conditions or transplants.\n But there may be hundreds of infected cases in the community, who don&#39;t fall in these categories and haven&#39;t been diagnosed, he said.\n Many people with hepatitis E only experience mild symptoms, and in some cases don&#39;t even know they&#39;re infected or go to the hospital.\n  But the virus can have serious health consequences, particularly for patients with weakened immunity. Young, healthy people with no pre-existing conditions may be able to recover on their own -- but for vulnerable populations, it could cause chronic hepatitis that patients can&#39;t shake off, as well as long-term liver damage and tissue scarring.\n Apart from the 11 cases in Hong Kong, only one other case has been confirmed globally -- a man in Canada, who had previously traveled to Africa. He went to the hospital after experiencing hives, nausea, severe jaundice and an inflamed liver, and tested positive for rat HEV, according to a report in February 2019.\n The only reason authorities caught this case was because they used  a broad type of test that detects many strands of hepatitis E virus, said researchers in the report, which was  published in the Journal of Infectious Diseases. Otherwise, &#34;the diagnosis might have been missed,&#34; the report said.\n This is the problem -- most countries aren&#39;t testing for rat HEV, so there&#39;s a good chance they&#39;re just missing diagnoses, said Sridhar.\n It takes a specialized test, like the one HKU designed, to specifically look for rat HEV in humans. It&#39;s not a difficult test to make, but it hasn&#39;t been adopted widely because nobody thought until recently that rat HEV was even a threat to humans.\n  For instance, in Europe a &#34;lack of awareness by physicians and poorly standardized diagnostics led to under reporting&#34; in hepatitis E cases,  said Cornelia Adlhoch of the European Centre for Disease Prevention and Control (ECDC) and Sally Baylis of Germany&#39;s Paul-Ehrlich-Institut,  in a letter published this March in the journal Hepatology.\n Only last year did the ECDC finally develop guidelines for how to collect data and report information on hepatitis E, said the letter -- but these new guidelines focused on the human variant and didn&#39;t include rat HEV,  leaving what Sridhar calls &#34;a blind spot in our diagnostics.&#34;\n   This blind spot, and the possibility that the virus is infecting people globally without any control measures, place some of society&#39;s most vulnerable people at risk -- the elderly, HIV-affected communities, those with pre-existing conditions, and more.\n &#34;This should not be happening,&#34; said Sridhar. &#34;We need ongoing vigilance in the public to control this unusual infection. I really hope that public health authorities take the first step and look at how much their populations are actually being exposed to rat hepatitis E.&#34;", "posttime": "2020-05-09 00:44:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "传染给,infecting,老鼠", "title": "老鼠把肝炎传染给人类，没有人知道它是如何传染给人类的。", "title_en": "Rats are infecting humans with hepatitis, and nobody knows how", "transed": 1, "url": "https://edition.cnn.com/2020/05/08/health/hong-kong-rat-hepatitis-intl-hnk-scn/index.html", "via": "", "real_tags": ["传染给", "infecting", "老鼠"]}, {"category": "", "categoryclass": "", "imagename": "847f7665218128c1e97b2d437f3eaea8.jpg", "infoid": 1001296, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "游戏明星PewDiePie在2019年转投竞争对手平台后，签署了在YouTube上直播的独家协议。\nPewDiePie的真名是Felix Kjellberg，是YouTube最大的独立视频制作公司，拥有超过1.04亿订户。\n克尔伯格表示，重返YouTube是一种自然而然的选择，因为他在寻找新的方式与粉丝建立联系。\n几年来，他在玩视频游戏和评论视频方面取得了成功，每天都会发布视频。\n但在2019年，他宣布将不再在YouTube上直播，转而转而使用Dlive，后者承诺为内容创作者提供更好的财务回报。\n2020年1月，PewDiePie暂停了制作YouTube视频的工作，因为他感到非常疲惫，但休息后他继续在YouTube上发布他的常规视频。\n在一份声明中，PewDiePie表示，新功能在他决定重返YouTube直播的过程中发挥了一定作用。\n他说，在2020年及以后，直播是我非常关注的领域，所以能够与YouTube合作，并走在新产品功能的前沿，对未来来说是特别的，也是令人兴奋的。\n这一决定是在他发布的几个视频被发现包含纳粹引用或反犹图像后做出的。\n克尔伯格承认这些材料令人反感，但表示他不支持任何形式的仇恨态度。\n他强调，这些材料是作为笑话包括在内的，这从上下文中应该已经很清楚了。\n他说，虽然这不是我的本意，但我明白这些笑话最终是无礼的。\n凯尔伯格的节目“惊吓PewDiePie”的第二季也从谷歌的订阅视频平台YouTube Red上撤下。\n同年晚些时候，他在一次直播中使用了种族诽谤。PewDiePie为这一事件道歉。\n在评论他重返YouTube直播时，该公司表示，PewDiePie；之前的评论与我们的价值观不符。\n一位公司发言人表示：如果他今天违反了我们的政策，我们将采取相应的行动，就像对待任何其他创造者一样。", "note_en": "Gaming star PewDiePie has signed an exclusive deal to live-stream on YouTube, after switching to a rival platform in 2019.\n PewDiePie, whose real name is Felix Kjellberg, is YouTube&#39;s biggest independent video-maker with more than 104 million subscribers.\n  Mr Kjellberg said returning to YouTube was a &#34;natural fit&#34; as he looked for new ways to connect with fans.\n   He found success playing and commenting on video games, posting daily videos for several years.\n But in 2019, he announced he would  no longer be live-streaming on YouTube and would instead move to Dlive, which promised better financial returns for its content creators.\n  In January 2020, PewDiePie took a short break from making YouTube videos because he was &#34;feeling very tired&#34;, but he continued posting his regular videos on YouTube after his break.\n    In a statement, PewDiePie said new features played a part in his decision to return to live-streaming on YouTube.\n &#34;Live-streaming is something I&#39;m focusing a lot on in 2020 and beyond, so to be able to partner with YouTube and be at the forefront of new product features is special and exciting for the future,&#34; he said.\n    The decision came after several videos he had released were found to contain Nazi references or anti-Semitic imagery.\n Mr Kjellberg accepted the material was offensive, but said he did not support &#34;any kind of hateful attitudes&#34;.\n He stressed that the material was included as a joke, which should have been clear from the context.\n &#34;Though this was not my intention, I understand that these jokes were ultimately offensive,&#34; he said.\n A second series of Mr Kjellberg&#39;s show Scare PewDiePie was also dropped from YouTube Red, Google&#39;s subscription video platform.\n Later that year,  he used a racial slur during a live-stream. PewDiePie apologised for the incident.\n Commenting on his return to live-streaming on YouTube, the company said PewDiePie&#39;s previous comments were &#34;not in line with our values&#34;.\n &#34;Were he to violate our policies today, we&#39;d take action accordingly just as we would with any other creator,&#34; a company spokesperson said.", "posttime": "2020-05-09 00:30:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "youtube,signs,视频", "title": "PewDiePie与YouTube签署独家直播协议", "title_en": "PewDiePie signs exclusive live-streaming deal with YouTube", "transed": 1, "url": "https://www.bbc.com/news/technology-52540437", "via": "", "real_tags": ["youtube", "signs", "视频"]}, {"category": "", "categoryclass": "", "imagename": "84a0cb12cc80f0ae1879c58b29a36b0e.jpg", "infoid": 1001295, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "facebook.com成立于2004年，最初是一个简单的、服务器呈现的PHP网站。随着时间的推移，我们增加了一层又一层的新技术，以提供更多的交互功能。每一项新功能和新技术都会逐渐降低网站的速度，并使其更难维护。这使得引入新体验变得更加困难。像暗模式和在News Feed中保存您的位置这样的功能没有直接的技术实现。我们需要退一步重新思考我们的架构。\n当我们考虑如何构建一款新的网络应用程序时，我们意识到我们现有的技术堆栈不能支持我们需要的类似应用程序的感觉和性能。这款应用程序是为今天的浏览器设计的，具有人们对Facebook的期望功能。完全重写是极其罕见的，但在这种情况下，由于过去十年来网络发生了如此多的变化，我们知道这是我们实现业绩和可持续未来增长目标的唯一途径。今天，我们将分享在使用Reaction(用于构建用户界面的声明性JavaScript库)和Relay(用于Reaction的GraphQL客户端)重新构建Facebook.com时所学到的教训。\n我们知道我们希望Facebook.com快速启动、快速响应，并提供高度互动的体验。虽然服务器驱动的应用程序可以提供快速的启动时间，但我们不相信我们能让它像客户端驱动的应用程序那样具有交互性和愉悦性。然而，我们相信我们可以构建一个客户端驱动的应用程序，启动时间快得有竞争力。\n但从头开始，客户至上的应用程序带来了一系列新的问题。我们需要快速重建网站，同时还要解决速度和其他用户体验问题--我们需要以这样一种方式做到这一点，这样它在未来几年都是可持续的。\n越少越好，越早越好。我们应该只提供我们需要的资源，我们应该努力让它们在我们需要之前就到达。\n服务于用户体验的工程经验。我们发展的最终目标是所有使用我们网站的人。当我们考虑我们网站上的UX挑战时，我们可以调整我们的开发经验来指导工程师在默认情况下做正确的事情。\n我们应用了同样的原则来改进站点的四个主要元素：CSS、JavaScript、数据和导航。\n首先，我们通过改变编写和构建样式的方式，将主页上的CSS减少了80%。在新站点上，我们编写的CSS与发送到浏览器的CSS不同。当我们在与组件相同的文件中编写熟悉的类似CSS的JavaScript时，构建工具会将这些样式拆分成单独的、优化的捆绑包。因此，新网站附带的CSS更少，支持可访问性的深色模式和动态字体大小，并提高了图像渲染性能-所有这些都让工程师更容易使用。\n在我们的老站点上，当加载主页时，我们加载了超过400KB的压缩CSS(2MB未压缩)，但其中只有10%实际用于初始渲染。我们一开始并没有那么多CSS；它只是随着时间的推移而增长，很少会减少。这在一定程度上是因为每个新功能都意味着添加新的CSS。\n我们通过在构建时生成原子CSS来解决这个问题。原子CSS具有对数增长曲线，因为它与唯一样式声明的数量成正比，而不是与我们编写的样式和特性的数量成正比。这使我们可以将从整个站点生成的原子CSS组合成一个小的共享样式表。因此，新主页的下载量不到旧网站下载量的20%。\n我们的CSS随时间增长的另一个原因是，很难确定各种CSS规则是否仍在使用。原子CSS有助于减轻这方面的性能影响，但是独特的样式仍然会增加不必要的字节，并且源代码中未使用的CSS会增加工程开销。现在，我们将样式与组件放在一起，以便可以同时删除它们，并且仅在构建时将它们拆分成单独的捆绑包。\n我们还解决了我们面临的另一个问题：CSS的优先级取决于排序，当使用随时间变化的自动打包时，这一点尤其难以管理。以前，一个文件中的更改可能会在作者没有意识到的情况下中断另一个文件中的样式。取而代之的是，我们现在使用一种受Reaction Native Style API启发的熟悉语法来创作样式：我们保证以稳定的顺序应用样式，并且不支持CSS后代选择器。\n我们还利用离线构建步骤进行了辅助功能更新。在今天的许多网站上，人们使用浏览器的缩放功能来放大文本。这可能会意外地触发平板电脑或移动设备的布局，或者增加他们不需要放大的东西的大小，比如图像。\n通过使用REMS，我们可以尊重用户指定的默认值，并且能够提供用于自定义字体大小的控件，而无需更改样式表。但是，设计通常是使用CSS像素值创建的。手动转换到REMS增加了工程开销和潜在的bug，因此我们让构建工具为我们执行此转换。\n常量样式=样式.create({phasis：{fontWeight：&#39；bold&#39；，}，text：{fontSize：&#39；16px&39；，fontWeight：&#39；Normal&39；，}，})；函数MyComponent(Props){return&lt；span className={style(&#39；text&39；，pros.isEmphasize&amp；&#39；emphasis&。\n.c0{font-weight：粗体；}.c1{font-weight：Normal；}.c2{font-size：0.9rem；}\n函数MyComponent(Props){return&lt；span className={(propss.isEmphasize？&#39；c0&#39；：&#39；c1&#39；)+&#39；c2&#39；}/&gt；；}。\n在旧站点上，我们过去常常尝试通过将类名添加到Body元素，然后使用该类名用具有更高专用性的规则覆盖现有样式来应用主题。这种方法有问题，而且它不再适用于我们新的原子CSS-in-JavaScript方法，所以我们切换到CSS变量进行主题化。\nCSS变量在类下定义，当该类应用于DOM元素时，其值将应用于其DOM子树中的样式。这使我们可以将主题组合到单个样式表中，这意味着切换不同的主题不需要重新加载页面，不同的页面可以具有不同的主题，而无需下载额外的CSS，并且不同的产品可以在同一页面上并排使用不同的主题。\n.light-主题{--card-bg：#eee；}.暗-主题{--card-bg：#111；}.card{背景色：var(--card-bg)；}。\n这使得主题的性能影响与调色板的大小成正比，而不是与组件库的大小或复杂性成正比。单个原子CSS包还包括暗模式实现。\n为了防止图标在其余内容之后出现时闪烁，我们使用REACT将SVG内联到HTML中，而不是将SVG文件传递给&lt；img&gt；标记。因为这些SVG现在实际上是JavaScript，所以可以将它们与其周围的组件捆绑在一起交付，以实现干净的一遍呈现。我们发现，在加载JavaScript的同时加载这些代码的好处要大于SVG绘制性能的代价。通过内联，之后弹出的图标不会闪烁。\n函数MyIcon(Props){return(&lt；svg{.props}className={style({/*.*/})}&gt；&lt；path d=&#34；m17.5.25.479Z&#34；/&gt；&lt；/svg&gt；)；}。\n此外，这些图标可以在运行时平滑地更改颜色，而无需进一步下载。我们可以根据图标的道具设置图标样式，并使用CSS变量为特定类型的图标创建主题，特别是单色图标。\n代码大小是基于JavaScript的单页面应用程序最大的问题之一，因为它对页面加载性能有很大影响。我们知道，如果我们想要一个用于Facebook.com的客户端反应应用程序，我们需要解决这个问题。我们引入了几个新的API，它们与我们的“尽可能少，越早越好”的口号一致。\n当有人在等待页面加载时，我们的目标是通过呈现页面外观的UI“骨架”来提供即时反馈。这个框架需要最少的资源，但是如果我们的代码打包在单个捆绑包中，我们就不能提早呈现它，所以我们需要根据页面的显示顺序将代码拆分成捆绑包。然而，如果我们天真地这样做(即，通过使用在渲染期间获取的动态导入)，我们可能会损害性能，而不是帮助它。这是我们的JavaScript加载层的代码拆分设计的基础：我们使用一个声明性的、可静态分析的API将初始加载所需的JavaScript拆分成三层。\n第1层是显示上述内容(包括初始加载状态的UI骨架)的第一个绘画所需的基本布局。\n第2层包括完全呈现所有上述内容所需的所有JavaScript。在第2层之后，屏幕上的任何内容都应该不会因为代码加载而在视觉上发生变化。\n一旦遇到了portForDisplay，它和它的依赖项就会移到第2层。这会返回一个基于承诺的包装器，以便在模块加载后访问它。\n第3层包括仅在显示后才需要的、不会影响屏幕上当前像素的所有内容，包括日志记录代码和实时更新数据的订阅。\nimport ForAfterDisplay ModuleC从&#39；ModuleC&#39；；//.函数onClick(E){ModuleCDeferred.onReady(ModuleC=&gt；{ModuleC.log(&#39；Click Happed！&#39；，e)；})；}。\n一旦遇到portForAfterDisplay，它和它的依赖项就会移到第3层。这将返回一个基于承诺的包装器，以便在模块加载后访问该模块。\n一个500 KB的JavaScript页面在第一层可以变成50 KB，在第二层可以变成150 KB，在第三层可以变成300 KB。通过减少达到每个里程碑所需下载的代码量，这种拆分代码的方式使我们能够缩短首次绘制和可视化完成的时间。因为第三层不影响屏幕上的像素，所以它并不是真正的渲染，并且最终的绘画完成得更早。最重要的是，加载屏幕能够更早地呈现。\n我们经常需要呈现同一UI的两个变体，例如，在A/B测试中。要做到这一点，最简单的方法是为所有人下载两个版本，但这意味着我们经常下载从未执行过的代码。稍好一点的方法是在渲染时使用动态导入，但这可能会很慢。\n相反，为了与我们的“尽可能少，尽可能早”的口头禅保持一致，我们构建了一个声明性API，它可以提早提醒我们这些决策，并将它们编码到我们的依赖关系图中。当页面加载时，服务器能够检查实验并仅发送所需版本的代码。\n当我们拆分的条件(如A/B测试、区域设置或设备类)在此人的页面加载之间是静态的时，这很有效。\n跨页面加载不是静态的代码分支怎么办？例如，为News Feed帖子发送所有不同类型和组件组合的所有呈现代码会大大增加页面的JavaScript大小。\n这些依赖关系是在运行时根据从后端返回的数据决定的。这允许我们使用Relay的新功能来表示需要哪种呈现代码，具体取决于返回的数据类型。如果帖子有特殊附件，如照片，我们描述需要PhotoComponent才能呈现该照片。\n..。在帖子{.。在PhotoPost{@module(&#39；PhotoComponent.js&39；)PHOTO_DATA}上.。在VideoPost上{@module(&#39；VideoComponent.js&39；)video_data}}。\n我们将呈现每个帖子类型所需的依赖项表示为查询的一部分。\n更棒的是，PhotoComponent本身准确地描述了它需要将照片附件类型上的哪些数据作为片段，这意味着我们甚至可以拆分查询逻辑。\n层和条件依赖关系帮助我们只交付每个阶段所需的代码，但我们还需要确保每个层的大小随着时间的推移保持在可控范围内。为了管理这一点，我们引入了每个产品的JavaScript预算。\n我们根据性能目标、技术限制和产品考虑因素设置预算。我们分配页面级预算，并根据产品边界和团队边界细分页面。共享基础设施被添加到精心策划的列表中，并给出了自己的预算。共享基础设施计入所有页面的预算，但其中的模块供产品团队免费使用。对于延迟、有条件加载或交互加载的代码，我们也有预算。\n依赖关系图工具可以更容易地理解字节的来源，并找出减小代码大小的机会。\n作为这次重建的一部分，我们对我们在网络上获取数据的基础设施进行了现代化改造。虽然旧站点的一些功能使用Relay和GraphQL来获取数据，但大多数获取的数据是作为其服务器端PHP呈现的一部分。有了这个新网站，我们能够标准化我们的移动应用程序，并确保所有数据获取都通过GraphQL。由于Relay和GraphQL已经为我们处理了“尽可能少”的工作，我们只需要做一些更改来支持尽早获得我们需要的数据。\n许多Web应用程序需要等到下载并执行完所有JavaScript后才能从服务器获取数据。使用Relay，我们静态地知道页面需要什么数据。这意味着一旦我们的服务器收到页面请求，它就可以立即开始准备必要的数据，并将其与所需的代码并行下载。我们在此数据变得可用时将其与页面一起流式传输，以便客户端可以避免额外的往返行程，并更快地呈现最终的页面内容。\n在初始加载Facebook.com时，某些内容最初可能会隐藏或渲染到视口之外。例如，大多数屏幕可以容纳一到两个News Feed帖子，但是我们事先不知道有多少可以容纳。此外，用户很可能会滚动，在一次连续往返行程中逐个获取每个故事都需要时间。另一方面，我们在一个查询中提取的故事越多，查询的速度就越慢，这会导致查询时间更长，甚至第一个故事的视觉完成时间也会更长。\n为了解决这个问题，我们使用内部GraphQL扩展@stream将提要连接流式传输到客户端，以便在滚动上进行初始加载和后续分页。这允许我们在每个提要故事准备就绪后立即逐个发送，只需一个查询操作。\n某些查询的不同部分比其他查询需要更长的计算时间。例如，当查看个人资料时，获取人名和个人资料照片相对较快，但获取他们的时间线的内容则需要更长的时间。\n要使用单个查询获取这两种类型的数据，我们使用@Defer，它允许响应的不同部分在准备好后立即流式传输。这使我们可以尽可能快地使用初始数据呈现大部分UI，并呈现其余部分的加载状态。有了反应悬念，这就更容易了，因为我们可以显式地定制我们的加载状态，以确保流畅的、自上而下的页面加载体验。\n快速导航是单页应用程序的重要功能。当导航到新路线时，我们需要从服务器获取各种代码和数据来呈现目标页面。为了减少加载新页面时所需的网络往返次数，客户端需要提前知道每条路由需要哪些资源。我们称其为路由图，每个条目都称为路由定义。\n对于Facebook来说，这张路线图太大了，无法一次发送所有内容。取而代之的是，我们在会话期间动态地将路由定义添加到路由图中，因为呈现了新的链路。路由图和路由器位于应用程序的最顶端，允许当前应用程序和路由器状态的组合推动应用级状态决策，例如基于当前路由的顶部导航栏或聊天选项卡的行为。\n客户端应用程序通常等到Reaction呈现页面后才下载该页面所需的代码和数据。这通常是使用React.lazy或类似的原语来完成的。因为这会使页面导航变慢，所以我们甚至在单击链接之前就开始了对一些必要资源的第一次请求：\n为了提供比在导航时只显示空白屏幕更流畅的体验，我们使用反应悬念转换来继续呈现上一条路线，直到下一条路线完全呈现或挂起到具有下一页UI骨架的“良好”加载状态。这就不那么刺耳了，而且它模仿了标准的浏览器行为。\n我们在新站点上执行了大量延迟加载代码，但是如果我们延迟加载某个路由的代码，并且该路由的数据获取代码位于该代码中，那么我们最终将以串行加载告终。\n为了解决这个问题，我们提出了EntryPoints，它是包装代码拆分点并将输入转换为查询的文件。这些文件非常小，并且对于任何可到达的代码拆分点都会提前下载。\nGraphQL查询仍然与视图并置，但是入口点封装了何时需要该查询以及如何将输入转换为正确的变量。该应用程序使用这些EntryPoint自动决定何时获取资源，确保默认情况下发生正确的事情。这还有一个额外的好处，即创建单个JavaScript函数，该函数包含应用程序中任何给定点的所有数据获取需求，该函数可用于前面讨论的服务器预加载。\n我们在这里讨论的许多变化并不是Facebook所特有的。这些概念和模式可以应用于使用任何框架或库的任何客户端应用程序。通过标准化我们的技术堆栈，我们能够重新思考如何以高性能、可持续的方式引入人们想要的功能-即使我们在工程和产品规模上运营也是如此。\n工程体验的改善和用户体验的改善必须齐头并进，性能和可访问性不能被视为对运输功能的征税。凭借出色的API、工具和自动化，我们可以帮助工程师更快地移动，同时交付更好、更高性能的代码。为提高新的Facebook.com的性能所做的工作是广泛的，我们希望很快就能分享更多关于这项工作的信息。要查看重新设计的内容，请从您的桌面访问facebook.com。它正在逐步推出，很快就会向每个人开放。", "note_en": "Facebook.com launched in 2004 as a simple, server-rendered PHP website. Over time, we’ve added layer upon layer of new technology to deliver more interactive features. Each of these new features and technologies incrementally slowed the site down and made it harder to maintain. This made it harder to introduce new experiences. Features like dark mode and saving your place in News Feed had no straightforward technical implementation. We needed to take a step back to rethink our architecture.\n When we thought about how we would build a new web app — one designed for today’s browsers, with the features people expect from Facebook — we realized that our existing tech stack wasn’t able to support the app-like feel and performance we needed. A complete rewrite is extremely rare, but in this case, since so much has changed on the web over the course of the past decade, we knew it was the only way we’d be able to achieve our goals for performance and sustainable future growth. Today, we’re sharing the lessons we’ve learned while rearchitecting Facebook.com, using  React (a declarative JavaScript library for building user interfaces) and  Relay (a GraphQL client for React).\n  We knew we wanted Facebook.com to start up fast, respond fast, and provide a highly interactive experience. Although a server-driven app could deliver a fast startup time, we weren’t convinced we could make it as interactive and delightful as a client-driven app. However, we believed we could build a client-driven app with a competitively fast startup time.\n But starting from the ground up with a client-first app brought a new set of problems. We needed to rebuild the site quickly while also addressing speed and other user experience issues — and we needed to do it in such a way that it would be sustainable for years to come.\n  As little as possible, as early as possible.  We should deliver only the resources we need, and we should strive to have them arrive right before we need them.\n Engineering experience in service of user experience.  The end goal of our development is all about the people using our website. As we think about the UX challenges on our site, we can adapt our developer experience to guide engineers to do the right thing by default.\n We applied these same principles to improve four main elements of the site: CSS, JavaScript, data, and navigation.\n  First, we reduced the CSS on the homepage by 80 percent by changing how we write and build our styles. On the new site, the CSS we write is different from what gets sent to the browser. While we write familiar CSS-like JavaScript in the same files as our components, a build tool splits these styles into separate, optimized bundles. As a result, the new site ships less CSS, supports dark mode and dynamic font sizes for accessibility, and has improved image rendering performance — all while making it easier for engineers to work with.\n  On our old site, we were loading more than 400 KB of compressed CSS (2 MB uncompressed) when loading the homepage, but only 10 percent of that was actually used for the initial render. We didn’t start out with that much CSS; it just grew over time and rarely decreased. This happened in part because every new feature meant adding new CSS.\n We addressed this by generating atomic CSS at build time. Atomic CSS has a logarithmic growth curve because it’s proportional to the number of unique style declarations rather than to the number of styles and features we write. This lets us combine the generated atomic CSS from across our site into a single, small, shared stylesheet. As a result, the new homepage downloads less than 20 percent of the CSS the old site downloaded.\n  Another reason our CSS grew over time was that it was difficult to identify whether various CSS rules were still in use. Atomic CSS helps mitigate the performance impact of this, but unique styles still add unnecessary bytes, and the unused CSS in our source code adds engineering overhead. Now, we colocate our styles with our components so they can be deleted in tandem, and only split them into separate bundles at build time.\n We also addressed another issue we were facing: CSS precedence depends on ordering, which is especially difficult to manage when using automated packaging that can change over time. It was previously possible for changes in one file to break the styles in another without the author realizing it. Instead, we now author styles using a familiar syntax inspired by   React Native  styling APIs: We guarantee that the styles are applied in a stable order, and we don’t support CSS descendant selectors.\n  We’ve taken advantage of our offline build step to make accessibility updates as well. On many websites today, people enlarge text by using their browser’s zoom function. This can accidentally trigger a tablet or mobile layout or increase the size of things they didn’t need to enlarge, such as images.\n By using   rems , we can respect user-specified defaults and are able to provide controls for customizing font size without requiring changes to the stylesheet. Designs, however, are usually created using CSS pixel values. Manually converting to rems adds engineering overhead and the potential for bugs, so we have our build tool do this conversion for us.\n  const styles = stylex.create({\r emphasis: {\r fontWeight: &#39;bold&#39;,\r },\r text: {\r fontSize: &#39;16px&#39;,\r fontWeight: &#39;normal&#39;,\r },\r});\r \rfunction MyComponent(props) {\r return &lt;span className={styles(&#39;text&#39;, props.isEmphasized &amp;&amp; &#39;emphasis&#39;)} /&gt;;\r}\n  .c0 { font-weight: bold; }\r.c1 { font-weight: normal; }\r.c2 { font-size: 0.9rem; }\n  function MyComponent(props) {\r return &lt;span className={(props.isEmphasized ? &#39;c0 &#39; : &#39;c1 &#39;) + &#39;c2 &#39;} /&gt;;\r}\n   On the old site, we used to attempt to apply themes by adding a class name to the body element and then using that class name to override existing styles with rules that had a higher specificity. This approach has issues, and it no longer works with our new atomic CSS-in-JavaScript approach, so we have switched to   CSS variables  for theming.\n CSS variables are defined under a class, and when that class is applied to a DOM element, its values are applied to the styles within its DOM subtree. This lets us combine the themes into a single stylesheet, meaning toggling different themes doesn’t require reloading the page, different pages can have different themes without downloading additional CSS, and different products can use different themes side by side on the same page.\n .light-theme {\r --card-bg: #eee;\r}\r.dark-theme {\r --card-bg: #111;\r}\r.card {\r background-color: var(--card-bg);\r}\n This made the performance impact of a theme proportional to the size of the color palette rather than to the size or complexity of the component library. A single atomic CSS bundle also includes the dark mode implementation.\n  To prevent flickering as icons come in after the rest of the content, we inline SVGs into the HTML using React rather than passing SVG files to  &lt;img&gt;  tags. Because these SVGs are now effectively JavaScript, they can be bundled and delivered together with their surrounding components for a clean one-pass render. We’ve found that the upside of loading these at the same time as the JavaScript was greater than the cost of SVG painting performance. By inlining, there’s no flickering of icons that pop in afterward.\n function MyIcon(props) {\r return (\r &lt;svg {...props} className={styles({/*...*/})}&gt;\r &lt;path d=&#34;M17.5 ... 25.479Z&#34; /&gt;\r &lt;/svg&gt;\r );\r}\n Additionally, these icons can change colors smoothly at runtime without requiring further downloads. We’re able to style the icon according to its props and use our CSS variables to theme certain types of icons, especially ones that are monochrome.\n    Code size is one of the biggest concerns with a JavaScript-based single-page app because it has a large influence on page load performance. We knew that if we wanted a client-side React app for Facebook.com, we’d need to solve for this. We introduced several new APIs that work in line with our “as little as possible, as early as possible” mantra.\n  When someone is waiting for a page to load, our goal is to give immediate feedback by rendering UI “skeletons” of what the page is going to look like. This skeleton needs minimal resources, but we can’t render it early if our code is packaged in a single bundle, so we need to code-split into bundles based on the order in which the page should be displayed. However, if we do this naively (i.e., by using   dynamic imports  that are fetched during render), we could hurt performance instead of helping it. This is the basis of our code-splitting design of JavaScript Loading Tiers: We split the JavaScript needed for the initial load into three tiers, using a declarative, statically analyzable API.\n Tier 1  is the basic layout needed to display the first paint for the above-the-fold content, including UI skeletons for initial loading states.\n    Tier 2 includes all the JavaScript needed to fully render all above-the-fold content. After Tier 2, nothing on the screen should still be visually changing as a result of code loading.\n   Once an  importForDisplay is encountered, it and its dependencies are moved into Tier 2. This returns a promise-based wrapper to access the module once it’s loaded.\n  Tier 3 includes everything that is only needed after display that doesn’t affect the current pixels on the screen, including logging code and subscriptions for live-updating data.\n importForAfterDisplay ModuleCDeferred from &#39;ModuleC&#39;;\r \r// ...\r \rfunction onClick(e) {\r ModuleCDeferred.onReady(ModuleC =&gt; {\r ModuleC.log(&#39;Click happened! &#39;, e);\r });\r}\n Once an  importForAfterDisplay is encountered, it and its dependencies are moved into Tier 3. This returns a promise-based wrapper to access the module once it’s loaded.\n A 500 KB JavaScript page can become 50 KB in Tier 1, 150 KB in Tier 2, and 300 KB in Tier 3. Splitting our code this way enables us to improve time to first paint and time to visual completion by reducing the amount of code that needs to be downloaded to hit each milestone. Because Tier 3 doesn’t affect the pixels on the screen, it isn’t really a render, and the final paint finishes earlier. Most significantly, the loading screen is able to render much earlier.\n  We often need to render two variations of the same UI, e.g., in an A/B test. The simplest way to do this is to download both versions for all people, but this means we often download code that is never executed. A slightly better approach is to use dynamic imports on render, but this can be slow.\n Instead, in keeping with our “as little as possible, as early as possible” mantra, we built a declarative API that alerts us to these decisions early and encodes them in our dependency graph. As the page is loading, the server is able to check the experiment and send down only the required version of the code.\n  This works well when the conditions we split on are static across page loads for that person, such as A/B tests, locales, or device classes.\n  What about code branches that are not static across page loads? For example, sending down all the rendering code for all the different types and combinations of components for News Feed posts would considerably bloat the page’s JavaScript size.\n These dependencies are decided at runtime, based on which data is returned from the back end. This allows us to use a new feature of   Relay  to express which rendering code is needed, depending on what type of data is returned. If the post has a special attachment, such as a photo, we describe that we need the  PhotoComponent  in order to render that photo.\n ... on Post {\r ... on PhotoPost {\r @module(&#39;PhotoComponent.js&#39;)\r photo_data\r }\r ... on VideoPost {\r @module(&#39;VideoComponent.js&#39;)\r video_data\r }\r}\n We express the dependencies needed to render each post type as part of the query.\n Even better, the  PhotoComponent itself describes exactly which data on the photo attachment type it needs as a fragment, which means we can even split out the query logic.\n  Tiers and conditional dependencies help us deliver just the code necessary for each phase, but we also need to make sure the size of each tier stays under control over time. To manage this, we’ve introduced per-product JavaScript budgets.\n We set budgets based on performance goals, technical constraints, and product considerations. We allocated page-level budgets and subdivide the page based on product boundaries and team boundaries. Shared infra is added to a carefully curated list and given its own budget. Shared infra counts against all pages’ budgets, but modules within it are free for product teams to use. We also have budgets for code that’s deferred, conditionally loaded, or loaded on interaction.\n  A dependency graph tool makes it easier to understand where bytes are coming from and identify opportunities to decrease code size.\n  As part of this rebuild, we modernized our data-fetching infra on the web. While some features of the old site used Relay and   GraphQL  for data-fetching, most fetched data ad-hoc as part of their server-side PHP rendering. With the new site, we were able to standardize with our mobile apps and ensure that all data-fetching goes through GraphQL. Since Relay and GraphQL already handle the “as little as possible” work for us, we just needed to make some changes to support getting the data we needed as early as possible.\n  Many web apps need to wait until all their JavaScript is downloaded and executed before fetching data from the server. With Relay, we know statically what data the page needs. This means that as soon as our server receives the request for a page, it can immediately start preparing the necessary data and download it in parallel with the required code. We stream this data with the page as it becomes available so the client can avoid additional round trips and render the final page content sooner.\n  On the initial load of Facebook.com, some content may initially be hidden or rendered outside of the viewport. For example, most screens fit one or two News Feed posts, but we don’t know in advance how many will fit. Additionally, it’s very likely the user will scroll, and it would take time to fetch each story individually in a serial round trip. On the other hand, the more stories we fetch in one query, the slower that query gets, which leads to longer query times and a longer Visually Complete time for even the first story.\n To solve this, we use an internal GraphQL extension,  @stream, to stream the feed connection to the client both for initial load and subsequent pagination on scroll. This allows us to send each feed story as soon it’s ready, one by one, with just a single query operation.\n    Different parts of certain queries take longer to compute than others. For example, when viewing a profile, it’s relatively quick to fetch a person’s name and profile photo, but it takes a bit longer to fetch the contents of their Timeline.\n To fetch both types of data with a single query, we use  @defer, which enables different sections of the response to be streamed as soon as they’re ready. This lets us render the bulk of the UI with initial data as quickly as possible, and render loading states for the rest. With   React Suspense , this is even easier, as we can explicitly craft our loading states to ensure a smooth, top-down page load experience.\n    Fast navigation is an important feature of single-page applications. When navigating to a new route, we need to fetch various code and data from the server to render the destination page. To reduce the number of network round trips required when loading a new page, the client needs to know which resources will be needed for each route ahead of time. We call this a route map and each entry a route definition.\n  For Facebook, this route map is too large to send all at once. Instead, we dynamically add route definitions to the route map during the session, as new links are rendered. The route map and the router live at the very top of the application, allowing the combination of current application and router state to drive app-level state decisions, such as the behavior of the top navigation bar or chat tabs based on the current route.\n  It’s common for client-side applications to wait until a page is being rendered by React to download the code and data needed for that page. Often this is done using   React.lazy  or a similar primitive. Since this can make page navigation slow, we instead start our first request for some of the necessary resources even before a link is clicked:\n  To provide a more fluid experience than just showing a blank screen when navigating, we use   React Suspense transitions  to continue rendering the previous route until the next route is either fully rendered or suspends into a “good” loading state with UI skeletons for the next page. This is much less jarring, and it mimics standard browser behavior.\n  We do a lot of   lazy loading  of code on the new site, but if we lazy load the code for a route and the data-fetching code for that route lives inside of that code, we end up with a serial load.\n  To solve this problem, we came up with EntryPoints, which are files that wrap a code-split point and transform inputs into queries. These files are very small and are downloaded in advance for any reachable code-split point.\n  The GraphQL query is still colocated with the view, but the EntryPoint encapsulates when that query is needed and how to transform the inputs into the correct variables. The app uses these EntryPoints to automatically decide when to fetch the resources, making sure the right thing happens by default. This has the added benefit of creating a single JavaScript function that contains all the data-fetching needs for any given point in the app, which can be used for the server preloading discussed earlier.\n Many of the changes we’ve discussed here are not specific to Facebook. These concepts and patterns can be applied to any client-side app using any framework or library. By standardizing our tech stack, we have been able to rethink how we introduce functionality that people want in a performant, sustainable way — even as we operate at engineering and product scale.\n Engineering experience improvements and user experience improvements must go hand in hand, and performance and accessibility cannot be viewed as a tax on shipping features. With great APIs, tools, and automation, we can help engineers move faster and ship better, more performant code at the same time. The work done to improve performance for the new Facebook.com was extensive and we expect to share more on this work soon. To check out the redesign, visit  facebook.com from your desktop. It’s rolling out gradually and will be available to everyone soon.", "posttime": "2020-05-09 00:29:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,技术", "title": "Facebook如何为新的Facebook.com网站重建技术堆栈", "title_en": "How Facebook rebuilt the tech stack for the new Facebook.com website", "transed": 1, "url": "https://engineering.fb.com/web/facebook-redesign/", "via": "", "real_tags": ["facebook", "技术"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001294, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "别忘了！FreeBSD日志现在是免费的，并且只在基于浏览器的版本上可用。", "note_en": "Don’t forget! The FreeBSD Journal is now free and available only on the Browser-Based Edition.", "posttime": "2020-05-09 00:29:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "freebsd,journal,日志", "title": "FreeBSD Journal基于浏览器的版本", "title_en": "FreeBSD Journal Browser-Based Edition", "transed": 1, "url": "https://www.freebsdfoundation.org/journal/browser-based-edition/", "via": "", "real_tags": ["freebsd", "journal", "日志"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001293, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转到搜索世界游戏，有时被称为世界和平游戏，是巴克明斯特·富勒在1961年开发的一种教育模拟游戏，旨在帮助创建解决人口过剩和全球资源分配不均的方案。这个战争游戏的替代品使用富勒的Dymaxion地图，需要一组玩家合作解决一系列隐喻场景，从而用更全面的整体世界观挑战占主导地位的民族国家视角。这个想法是通过自发的合作，使世界在尽可能短的时间内为100%的人类服务，而不会对任何人造成生态破坏或不利，从而提高所有人的生活质量。\n富勒在(当时新建的)南伊利诺伊大学爱德华兹维尔首次公开提出将这一概念作为核心课程。1964年，他在加拿大魁北克省蒙特利尔举行的1967年国际和世界博览会上再次提出了这一建议。\n在1970年发布的世界运动会文件的序言中，富勒将其与他的几内亚猪实验和他的全面预期设计科学终身工作紧密地联系在一起。他还声称拥有知识产权，以控制他认为别人对他的想法的误用。他还声称，自1927年以来，他一直在没有电脑帮助的情况下玩手写游戏。[2]。\n1972年，世界游戏学院由富勒、梅达尔·加贝尔、霍华德·J·布朗等人在宾夕法尼亚州费城成立。\n1980年，世界游戏研究所(World Game Institute)和世界资源清单(World Resources Inventory)发布了“世界能源数据表”。世界能源数据表按国家汇总了能源生产、资源和消费情况。这些信息是以表格和地图格式汇编的。该项目由赛斯·斯奈德(Seth Snyder)研究，梅达尔·加贝尔(Medard Gabel)监督。这件作品是在一次世界运动会(费城，1980年夏天)中使用的。\n到1993年，世界游戏研究所开发并销售了一个名为全球召回(Global Recall)的教育软件包，其中包含全球数据、地图、世界问题百科全书，以及开发世界问题解决方案的工具。该软件包是一个基于计算机的模拟游戏，旨在供高中生和大学生用来学习世界问题以及如何解决这些问题。[3]。\n2001年，一家名为O.S.的营利性教育公司。地球公司。购买了世界游戏研究所的主要资产，并提供了一个全球模拟研讨会，这是巴克明斯特·富勒著名的世界游戏的直系后裔。\n迈克尔·维特兹(1993年5月20日)。软件提供了全球化思考的机会世界游戏研究所已经把它的想法放到了计算机磁盘上。“费城问询报”。\n朱孝云和罗伯托·特鲁希略。对R·巴克明斯特·富勒的新看法。(加州斯坦福；斯坦福大学出版社，2009)ISBN电话：0-8047-6279-1", "note_en": "Jump to navigation  Jump to search  World Game, sometimes called the  World Peace Game, is an educational simulation developed by  Buckminster Fuller in 1961 to help create solutions to  overpopulation and the uneven distribution of global resources. This alternative to  war games uses Fuller&#39;s  Dymaxion map and requires a group of players to cooperatively solve a set of metaphorical scenarios, thus challenging the dominant nation-state perspective with a more holistic &#34;total world&#34; view. The idea was to &#34;make the world work for 100% of humanity in the shortest possible time through spontaneous cooperation without ecological damage or disadvantage to anyone,&#34;  [1] thus increasing the  quality of life for all people.\n   Fuller first publicly proposed the concept as the  core curriculum at the (then new)  Southern Illinois University Edwardsville. He proposed it again in 1964 for the 1967  International and Universal Exposition in  Montreal, Quebec, Canada.\n In a preamble to World Game documents released in 1970, Fuller identified it very closely with his &#39;Guinea Pig &#39;B&#39; experiment&#39; and his &#39;Comprehensive Anticipatory Design Science&#39; lifework. He claimed intellectual property rights as well to control what he considered to be misapplication of his idea by others. He also claimed he had been playing it &#39;longhand&#39; without the assistance of computers since 1927.  [2]\n In 1972, the World Game Institute was founded in  Philadelphia, Pennsylvania by Fuller,  Medard Gabel,  Howard J. Brown and others.\n In 1980, the World Game Institute and the World Resources Inventory published the World Energy Data Sheet. The World Energy Data Sheet compiled a nation by nation summary of energy production, resources, and consumption. The information was compiled in tables and map formats. The project was researched by Seth Snyder and overseen by Medard Gabel. The work was used during a World Game (Philadelphia, summer 1980).\n By 1993, the World Game Institute developed and sold an educational software package called Global Recall, which contained global data, maps, an encyclopedia of world problems, and tools for developing solutions to world problems. The package was a computer-based simulation game intended for use by high school and college students in learning about world problems and how to solve them.  [3]\n In 2001, a for-profit educational company named o.s. Earth, Inc. purchased the principal assets of the World Game Institute and has been offering a Global Simulation Workshop that is a &#39;direct descendant of Buckminster Fuller&#39;s famous World Game.&#39;  [4]\n  ^   Vitez, Michael (May 20, 1993).  &#34;Software Provides Opportunity To Think Globally The World Game Institute Has Put Its Ideas On Computer Disk&#34;. The Philadelphia Inquirer .\n    Chu, Hsiao-Yun and Roberto Trujillo.  New Views on R. Buckminster Fuller. (Stanford, CA; Stanford University Press, 2009)   ISBN  0-8047-6279-1", "posttime": "2020-05-09 00:29:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "世界,world", "title": "世界运动会", "title_en": "World Game", "transed": 1, "url": "https://en.wikipedia.org/wiki/World_Game", "via": "", "real_tags": ["世界", "world"]}]