[{"category": "", "categoryclass": "", "imagename": "3186624dac0abea0d4603ae546123547.jpg", "infoid": 1008149, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国食品和药物管理局(FDA)周一建议消费者避免使用九种可能含有甲醇的洗手液，甲醇是一种有毒酒精，如果吞咽会导致失明，如果通过皮肤吸收会产生全身影响。\n所有九种洗手液都是由墨西哥的EskBiochem SA de CV生产的。该机构在其咨询中表示，在测试该公司的两种产品时发现了甲醇。一种名为Lavar Gel的产品含有81%的甲醇-不含乙醇，这是一种用于洗手液的安全酒精。另一种是CleanCare No Germ，含有28%的甲醇。\nFDA写道：“甲醇不是洗手液可以接受的成分。”由于在新冠肺炎大流行期间洗手液的使用量居高不下，该机构建议任何使用过含甲醇产品的人都“寻求立即治疗，这对于潜在扭转甲醇中毒的毒性效应至关重要。”\n甲醇是最简单的酒精，剧毒，如果吞咽、吸入或通过皮肤吸收会造成伤害。它经常与错误蒸馏的酒联系在一起。只喝30毫升-1盎司或2汤匙-对儿童可能是致命的。较小的剂量可能会导致永久性失明。\n在体内，甲醇被代谢成甲醛，然后再代谢成甲酸。这可能会导致代谢性酸中毒，这是一种危险的体内酸积聚，可能会导致器官损伤。甲酸还会在视神经中积聚，造成严重损害，可能导致永久性失明。\n根据安全文件，摄入中毒的症状可能表现为胃肠道刺激-恶心、呕吐和腹泻-以及中枢神经系统抑郁，导致头痛、头晕、嗜睡、恶心和醉酒感觉。这会导致呼吸急促、心率减慢、肾功能障碍、意识丧失、昏迷和死亡。\n吸入后会立即引起头晕、恶心、头痛和呕吐。这之后是一个潜伏期，没有明显的症状，因为代谢性酸中毒的发展。然后全身效应就会出现，包括视力问题。\n甲醇通过皮肤吸收，会引起同样的全身效应和视力问题。长时间暴露在皮肤上会导致皮肤脱脂和刺激。\nFDA指出，“尽管所有在手上使用这些产品的人都有风险，但不小心摄入这些产品的幼儿，以及将这些产品作为酒精(乙醇)替代品饮用的青少年和成年人，甲醇中毒的风险最大。”\nEskBiochem的代表亚历山大·埃斯卡米洛(Alexander Escamillo)在给《纽约时报》的令人费解的评论中表示，该公司没有将产品送到FDA进行测试，也没有在FDA注册。相反，一个被埃斯卡米罗描述为“经纪人”的人注册了公司并寄出了样品。与此同时，EskBiochem的员工甚至不知道如何登录该公司的FDA账户。Escamillo补充说，该公司永远不会“恶意发送有毒化学物质”，但计划对向FDA发送产品的经纪人采取行动。\nFDA建议，如果你有任何产品，你应该立即停止使用，并将它们处理在适当的危险废物容器中。该机构建议：“不要将这些产品冲洗或倒入下水道。”", "note_en": "The US Food and Drug Administration on Monday  advised consumers to avoid nine types of hand sanitizers that may contain methanol, a toxic alcohol that can cause blindness if swallowed and systemic effects if absorbed through the skin.\n All nine hand sanitizers are made by Eskbiochem SA de CV in Mexico. The agency said in its advisory that it discovered methanol while testing two of the company’s products. One, called Lavar Gel, was 81-percent methanol—and no ethanol, a safe alcohol meant to be used in hand sanitizers. Another, CleanCare No Germ, was 28-percent methanol.\n “Methanol is not an acceptable ingredient for hand sanitizers,” the FDA wrote. With use of hand sanitizers at a high amid the COVID-19 pandemic, the agency advised that anyone who has used the methanol-containing products “seek immediate treatment, which is critical for potential reversal of toxic effects of methanol poisoning.”\n     Methanol, the simplest alcohol, is extremely poisonous and can cause harm if swallowed, inhaled, or absorbed through the skin. It’s often associated with incorrectly distilled liquor.  Drinking as little as 30 milliliters—1 ounce or 2 tablespoons—can be fatal to children. Smaller doses can cause permanent blindness.\n Inside the body, methanol is metabolized to formaldehyde, then to formic acid. This can lead to metabolic acidosis, a dangerous buildup of acid in the body that can cause organ damage.  Formic acid can also accumulate in the optic nerve, causing severe damage that can lead to permanent blindness.\n According to safety documents, symptoms of poisoning by ingestion can manifest as gastrointestinal irritation—with nausea, vomiting, and diarrhea—and central nervous system depression, causing headache, dizziness, drowsiness, nausea, and an intoxicated feeling. This can progress to rapid breathing, slowed heart rate, kidney dysfunction, loss of consciousness, coma, and death.\n When inhaled, it can immediately cause dizziness, nausea, headache, and vomiting. This is followed by a latent period with no apparent symptoms as metabolic acidosis develops. Then systemic effects appear, including vision problems.\n Absorbed through the skin, methanol can cause the same systemic effects and vision problems. Prolonged exposure to skin can cause defatting of the skin as well as irritation.\n  The FDA noted that “although all persons using these products on their hands are at risk, young children who accidentally ingest these products and adolescents and adults who drink these products as an alcohol (ethanol) substitute, are most at risk for methanol poisoning.”\n In puzzling comments to The New York Times, a representative of Eskbiochem, Alexander Escamillo, said that the company did not send products to the FDA for testing or register with the agency. Rather, a person Escamillo described as a “broker” registered the company and sent the samples. Meanwhile, employees of Eskbiochem did not even know how to log in to the company’s FDA account. Escamillo added that the company would never “send a toxic chemical maliciously” but that it planned to take action against the broker for sending products to the FDA.\n The FDA recommends that if you have any of the products, you should stop using them immediately and dispose of them in appropriate hazardous waste containers. “Do not flush or pour these products down the drain,” the agency advised.", "posttime": "2020-06-25 18:58:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "警告,methanol,产品", "title": "FDA警告称，洗手液中发现有毒甲醇导致失明", "title_en": "Toxic methanol that causes blindness found in hand sanitizers, FDA warns", "transed": 1, "url": "https://arstechnica.com/science/2020/06/toxic-methanol-that-causes-blindness-found-in-hand-sanitizers-fda-warns/", "via": "", "real_tags": ["警告", "methanol", "产品"]}, {"category": "", "categoryclass": "", "imagename": "2544124b23d43fc286e7a5e0875447b3.jpg", "infoid": 1008148, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一群Twitch流媒体用户和观众呼吁在周三对这家广受欢迎的流媒体网站进行为期一天的抵制，此前他们认为，对最近几天知名流媒体网站滥用职权的广泛指控，他们的反应缓慢而不温不火。\n上周末，包括SayNoToRage、Tom&34；ProSyndicate Cassell和Henry&34；HenryG&34；Greer在内的Twitch热门流媒体都被多名女性公开指控性虐待和性骚扰。这三家公司都是Twitch Partners计划的一部分，使他们能够访问特殊的平台功能，以实现其在线视频展示的货币化和定制化。SayNoToRage为他的行为公开道歉，称他的行为没有任何借口，而卡塞尔则强烈否认对他的指控。\n在这些指控之后，Twitch周日发布了一份简短的声明，称公司极其严肃地对待性骚扰和不当行为的指控。我们正在积极调查与Twitch有关的拖网账户，并将在适用的情况下与执法部门合作。\n不过，这一说法并没有得到普遍接受。例如，Twitch前副总裁贾斯汀·王(Justin Wong)放大了一位未透露姓名的Twitch合作伙伴的报道，该合作伙伴过去曾被指控骚扰，但在未来的Twitch活动和溪流中继续接受VIP治疗。\n这些都是空话，考虑到你，作为一家公司，最小化并驳回了我的性骚扰，继续让捕食者参加你的活动，并在你的官方频道上给他提供了E3的现场片段。https://t.co/qhRFRoFPRb。\n与此同时，Twitch音乐流媒体公司YourStarling分享了一次长达一年的录音全员工会议的报告，据报道，她自己关于Twitch合作伙伴虐待的报告被Twitch首席执行官埃米特·谢尔(Emmett Sher)驳斥了。\n谢尔在发给Twitch员工的一封冗长的电子邮件中回应了这一抱怨，并于周一晚些时候公开分享了这封电子邮件。他写道：如果你在某个时候听到了我的评论，觉得我的评论不屑一顾，或者Twitch不在乎，我对发生的事情感到抱歉，我想让你知道，这绝不是我的本意。\n在全体员工的信息中，谢尔表示，如果我们基于可信的指控和人们在Twitch上的历史行为感到担忧，该平台将考虑禁止、取消合作伙伴关系，或者将人们从促销机会和激活活动中移除。\n谢尔在电子邮件中继续写道，游戏行业与其他不得不面对系统性性别歧视、种族主义和虐待的行业没有什么不同，这些行为奖励了某些人，也奖励了某些人的劣势，甚至伤害了其他人。虽然这是一个全行业的问题，但我们承认，许多人体验过Twitch和那些将我们的服务称为家的人-特别是女性、LGBTQIA社区中的那些人、黑人和其他代表不足的群体-并不是我们所渴望的。\n在社交媒体的争论不休中，一些Twitch用户聚集在一起，试图迫使人们采取行动支持这些言论。Twitch Blackout活动是在Twitter热门标签#TwitchBlackout下组织的，要求流媒体用户和观众在6月24日星期三避开该平台。正如参与者ThirdArtiact所描述的那样，为期一天的抵制活动的目标是让谢尔和特维奇作为一个整体来关注虐待、种族主义、性骚扰、攻击和强奸。\n我们要求所有大小的流媒体不要在周三6/24 12am-11：59 pm播放流媒体。\n随附的一份网上请愿书，在撰写本文时已有1200多人签名，呼吁希尔支持他的声明，并最终对那些利用自己的权力利用他人的人采取行动，反对那些明知权力在继续但却保持沉默或置之不理的人。\nTwitch在回应一些合作伙伴之间存在问题的行为报告方面有不一致的历史。去年，在托马斯·张伯伦(Thomas&#34；Elvine&34；Cheung)因涉嫌贩卖儿童性交易被捕后，该公司切断了与他的联系。但是澳大利亚流媒体歌手Luke&34；Mr DeadMoth&34；Munday最初只被暂时禁止进入该平台，因为他因在流媒体上捕获的一次攻击而被捕。在社区的强烈抗议后，Twitch后来将这一禁令定为永久禁令。\n去年，人气很高的流媒体明星Guy&34；DrDis敬&34；Beahm因为在公共卫生间拍摄Twitch流被踢出E3游戏大会，因此被Twitch停职两周。\n上个月，Twitch公开推出了一个安全咨询委员会，致力于创建新的政策和功能，以改善安全和节制，并保护平台上边缘化群体的利益。这个团队由在线安全专家和Twitch的创建者组成，他们对Twitch、其内容和社区有深刻的了解，正如Twitch所说的那样。", "note_en": "A group of Twitch streamers and viewers is calling for a one-day boycott of the popular streaming site to take place Wednesday, following what they see as a slow and tepid response to widespread allegations in recent days of abuse by prominent streamers.\n Over the weekend, popular Twitch streamers including SayNoToRage, Tom &#34;ProSyndicate&#34; Cassell, and Henry &#34;HenryG&#34; Greer have been  publicly  accused of  sexual abuse and harassment by multiple women. All three are part of the Twitch Partners program, giving them access to special platform features for monetization and customization of their online video presence. SayNoToRage  offered a public apology for his actions, saying there is &#34;no excuse for his behavior,&#34; while Cassell  offered a strong denial of the accusations against him.\n  In the wake of these allegations, Twitch  put out a brief statement Sunday saying the company &#34;take[s] accusations of sexual harassment and misconduct extremely seriously. We are actively looking into the accounts concerning streamers affiliated with Twitch and will work with law enforcement where applicable.&#34;\n That statement wasn&#39;t met with universal acceptance, though. Former Twitch VP Justin Wong, for instance,  amplified reports of an unnamed Twitch partner that had been accused of harassment in the past yet continued to receive VIP treatment in Twitch events and streams going forward.\n These are empty words considering you, as a company, minimized and dismissed my sexual harassment and continued to let the predator attend your events and gave him live segments at E3 on your official channel.  https://t.co/qhRFRoFPRb\n Twitch music streamer YourStarling, meanwhile,  shared reports from a recorded, year-old all-staff meeting where  her own reports of abuse by a Twitch partner were reportedly dismissed by Twitch CEO Emmett Shear.\n Shear addressed that complaint as part of  a lengthy email sent to Twitch staff, which he shared publicly late Monday. &#34;If at some point you&#39;ve heard my comments and felt that they were dismissive or that Twitch doesn&#39;t care, I&#39;m sorry that happened and I want you to know that in no way was that my intent,&#34; he wrote.\n In the all-staff message, Shear says the platform will be considering &#34;banning, removing partnerships, or removing people from promotional opportunities and activations if we have concerns based on credible accusations and their historical behavior on Twitch.\n &#34;The gaming industry is not unlike others that have had to reckon with systemic sexism, racism, and abuse that rewards certain people and disadvantages—even harms—others,&#34; Shear continues in the email. &#34;While this is an industry-wide issue, we acknowledge that many people experience of Twitch and people who call our service home—particularly women, those in the LGBTQIA community, Black people, and other under-represented groups—have not been what we aspire to.&#34;\n  Amid the social media back-and-forth, some Twitch users are gathering together in an attempt to force action to back up those words. The Twitch Blackout effort, as  organized under trending Twitter hashtag #TwitchBlackout, asks streamers and viewers to avoid the platform on Wednesday, June 24. The goal of the one-day boycott, as  characterized by participant ThirdArtifact, is to get Shear and Twitch as a whole &#34;to take note of abuse, racism, sexual harassment, assault and rape.&#34;\n We are asking streamers of all sizes to WITHHOLD FROM STREAMS ON WED 6/24 12am - 11:59pm\n An  accompanying online petition, signed by over 1,200 people as of this writing, calls for Shear to back up his statements and &#34;finally take action against those who use their power to take advantage of others, &amp; against those who enable it by knowing it goes on but stay silent or brush it off.&#34;\n Twitch has an inconsistent history in responding to reports of problematic behavior among some of its partners. Last year, the company cut ties with Thomas &#34;Elvine&#34; Cheung after he was  arrested in a child sex trafficking sting. But Australian streamer Luke &#34;MrDeadMoth&#34; Munday initially  received only a temporary ban from the platform after he was arrested for assault over an attack captured on stream. Twitch later  made that ban permanent after community outcry.\n And last year, popular streamer Guy &#34;DrDisrespect&#34; Beahm  received a two-week suspension from Twitch after being kicked out of the E3 gaming convention for filming a Twitch stream in a public bathroom.\n Last month, Twitch publicly  rolled out a Safety Advisory Council dedicated to creating new policies and features to &#34;improve safety and moderation&#34; and &#34;protect the interests of marginalized groups&#34; on the platform. The group is made up of &#34;online safety experts and Twitch creators who have a deep understanding of Twitch, its content, and its community,&#34; as Twitch puts it.", "posttime": "2020-06-25 18:57:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "face,twitch", "title": "随着流媒体用户面临骚扰指控，Twitch看到了抵制威胁", "title_en": "As streamers face harassment allegations, Twitch sees boycott threat", "transed": 1, "url": "https://arstechnica.com/gaming/2020/06/streamers-call-for-one-day-twitch-boycott-amid-harassment-allegations/", "via": "", "real_tags": ["face", "twitch"]}, {"category": "", "categoryclass": "", "imagename": "8646ce1ed6313b8678f05ea9c42e59ed.jpg", "infoid": 1008147, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天的Dealmaster包括各种关于游戏、充电器和小玩意儿的交易。一些亮点包括Ride：Europe的门票，这是我们最喜欢的家庭棋盘游戏之一的最喜欢的版本，价格降到了30美元，这是我们在2020年看到的最低价格。也有几款iPad在出售，包括128 GB版的10.2英寸iPad，售价为329美元，以及1TB版的第一代(但功能仍然相当强大)的11英寸iPad Pro平板电脑，售价为949美元的新低。除此之外，亚马逊Echo的一些设备仍在销售，包括带时钟的Echo Dot和音质犀利的Echo Studio，这是迄今为止价格最低的产品。除此之外，还有更多，不过，你可以在跳跃之后看看完整的名单。\nDealmaster推出了自己的时事通讯！注册后，就可以收到一份更短的、经过严格管理的网上最佳科技交易清单--不要胡说八道，直接进入你的收件箱，而且通常是在它们进入ARS主页之前。\n注意：ARS Technica可能会通过会员计划从本帖子上的链接中获得销售补偿。\nAnker PowerCore III Fusion 5K USB-C壁式充电器+便携式电池-18W USB-C PD，USB-A，5000 mAH，亚马逊售价29.99美元(通常为40美元)。\nAnker PowerLine+II(3英尺)USB-C到Lightning编织尼龙电缆在亚马逊售价12.99美元(使用代码：AKPLPCTL)-通常为22美元。\n亚马逊Echo Dot配备时钟系统(第三代)智能扬声器，在亚马逊售价34.99美元(通常为50美元)。\n三星EVO Select(256 GB)microSDXC卡-U3，10类在亚马逊售价33.99美元(通常为42美元)。\n联想ThinkCentre M90n迷你台式PC-英特尔酷睿i5-8265U，8 GB内存，512 GB固态硬盘，联想售价399美元(通常为600美元)。\nApple Back to School促销：Apple AirPods真正的无线耳机可以免费购买精选Mac或iPad(必须是高等教育学生、高等教育学生的家长或K-12学校员工才有资格)。\n苹果MacBook Air(2020)笔记本电脑-1.1 GHz英特尔酷睿i5-1030NG7，13.3英寸2560x1600，8 GB RAM，512 GB固态硬盘，魔术键盘，亚马逊售价1199.99美元(通常为1270美元)。\n苹果MacBook Air笔记本电脑(2020年)-1.1 GHz英特尔酷睿i3-1000NG4，13.3英寸2560x1600，8 GB内存，256 GB固态硬盘，魔术键盘，亚马逊售价899.99美元(通常为970万美元)。\nAMD Ryzen 7 3700X 8核/16线程台式机处理器+Wraith Prism LED散热器在亚马逊售价约273.49美元(通常为295美元)。\nNeoGeo Arade Stick Pro和复古游戏机+控制器-包括20款SNK游戏，在亚马逊售价99美元(通常为130美元)。\n龙之旅XI：难以捉摸的时代的回声(PS4)，在亚马逊售价19.99美元(通常为25美元)。\n亚马逊Fire TV Cube 4K HDR媒体流+智能扬声器在亚马逊售价99.99美元(通常为120美元)。\nAnker Soundcore Life Q20在亚马逊以49.99美元的价格出售蓝牙降噪耳机(剪贴10美元的优惠券-通常是60美元)。\n亚马逊Echo Dot(第三代)智能扬声器在Woot售价24.99亿美元(亚马逊售价3000万美元-通常为40美元)。\n亚马逊Echo Dot配备时钟系统(第三代)智能扬声器，在亚马逊售价34.99美元(通常为50美元)。\n亚马逊Echo Studio智能家居音箱+飞利浦色调白色环境智能发光二极管灯泡在亚马逊售价169.99美元(通常为200美元)。\n谷歌Nest Cam户外摄像头(2件装)1080P户外安全摄像头在亚马逊商店售价2.38亿美元(通常为300美元)。\nTP-Link Kasa HS200(3件装)智能灯具开关在亚马逊售价44.99美元(剪贴10美元优惠券-通常为60美元)。\n三星EVO Select(128 GB)microSDXC卡-U3，10类，在亚马逊售价18.99美元(通常为22美元)。\n三星EVO Select(256 GB)microSDXC卡-U3，10类在亚马逊售价33.99美元(通常为42美元)。\nAnker PowerLine+II(3英尺)USB-C到Lightning编织尼龙电缆在亚马逊售价12.99美元(使用代码：AKPLPCTL)-通常为22美元。\nAnker PowerCore III Fusion 5K USB-C壁式充电器+便携式电池-18W USB-C PD，USB-A，5000 mAH，亚马逊售价29.99美元(通常为40美元)。\nRAVPower PD先锋USB-C壁式充电器-61W USB-C，USB-A在亚马逊售价21.99美元(通常为30美元)。\n用于iPad(第七代)和iPad Air(第三代)的苹果智能键盘在亚马逊的售价为99美元(通常为130美元)。\nAnker Powerwave 7.5支架-齐无线充电座-10W Galaxy/7.5W iPhone+AC适配器，在亚马逊售价32.99美元(剪裁34%优惠券-通常为49美元)。", "note_en": "Today&#39;s Dealmaster includes a variety of deals on games, chargers, and gadgets. Some highlights include   Ticket to Ride: Europe, our  favorite iteration of one of our  favorite family board games, down to $30, which is the lowest price we&#39;ve seen in 2020. A handful of iPads are on sale as well, including the  128GB version of the 10.2-inch iPad for a joint-low of $329 and the 1TB version of the first-gen (but  still plenty powerful)  11-inch iPad Pro for a new low of $949. Beyond that, a number of Amazon Echo devices are still on sale, including the lowest prices to date on the  Echo Dot with Clock and the sharp-sounding  Echo Studio. There&#39;s plenty more beyond that, though; you can take a look at the full list after the jump.\n The Dealmaster has launched its very own newsletter! Sign up to receive a shorter, tightly curated list of the very best tech deals on the Web—no nonsense, direct to your inbox, and often before they make it to the Ars homepage.\n Note: Ars Technica may earn compensation for sales from links on this post through  affiliate programs.\n  Anker PowerCore III Fusion 5K USB-C wall charger + portable battery - 18W USB-C PD, USB-A, 5,000mAh for  $29.99 at Amazon (normally $40).\n Anker PowerLine+ II (3ft) USB-C to Lightning braided nylon cable for  $12.99 at Amazon (use code:  AKPLPCTL - normally $22).\n Amazon Echo Dot with Clock (3rd gen) smart speaker for  $34.99 at Amazon (normally $50).\n    Samsung EVO Select (256GB) microSDXC card - U3, Class 10 for  $33.99 at Amazon (normally $42).\n   Lenovo ThinkCentre M90n mini desktop PC - Intel Core i5-8265U, 8GB RAM, 512GB SSD for  $399 at Lenovo (normally $600).\n Apple Back to School sale: Apple AirPods true wireless earbuds for  free with select Mac or iPad purchases ( must be Higher Education student, parent of Higher Education student, or K-12 school employee to be eligible).\n Apple MacBook Air (2020) laptop - 1.1GHz Intel Core i5-1030NG7, 13.3-inch 2560x1600, 8GB RAM, 512GB SSD, Magic Keyboard for  $1,199.99 at Amazon (normally $1,270).\n Apple MacBook Air (2020) laptop - 1.1GHz Intel Core i3-1000NG4, 13.3-inch 2560x1600, 8GB RAM, 256GB SSD, Magic Keyboard for  $899.99 at Amazon (normally $970).\n AMD Ryzen 7 3700X 8-core/16-thread desktop processor + Wraith Prism LED cooler for  $273.49 at Amazon (normally $295).\n   NeoGeo Arcade Stick Pro retro console + controller - includes 20 SNK games for  $99 at Amazon (normally $130).\n   Dragon Quest XI: Echoes of an Elusive Age (PS4) for  $19.99 at Amazon (normally $25).\n   Amazon Fire TV Cube 4K HDR media streamer + smart speaker for  $99.99 at Amazon (normally $120).\n      Anker Soundcore Life Q20 Bluetooth noise-cancelling headphones for  $49.99 at Amazon ( clip $10 coupon - normally $60).\n   Amazon Echo Dot (3rd gen) smart speaker for  $24.99 at Woot (  $30 at Amazon - normally $40).\n Amazon Echo Dot with Clock (3rd gen) smart speaker for  $34.99 at Amazon (normally $50).\n  Amazon Echo Studio smart home speaker + Philips Hue White Ambiance smart LED bulb for  $169.99 at Amazon (normally $200).\n     Google Nest Cam Outdoor (2-pack) 1080p outdoor security camera for  $238 at Amazon (normally $300).\n  TP-Link Kasa HS200 (3-pack) smart light switch for  $44.99 at Amazon ( clip $10 coupon - normally $60).\n   Samsung EVO Select (128GB) microSDXC card - U3, Class 10 for  $18.99 at Amazon (normally $22).\n Samsung EVO Select (256GB) microSDXC card - U3, Class 10 for  $33.99 at Amazon (normally $42).\n Anker PowerLine+ II (3ft) USB-C to Lightning braided nylon cable for  $12.99 at Amazon (use code:  AKPLPCTL - normally $22).\n Anker PowerCore III Fusion 5K USB-C wall charger + portable battery - 18W USB-C PD, USB-A, 5,000mAh for  $29.99 at Amazon (normally $40).\n RavPower PD Pioneer USB-C wall charger - 61W USB-C, USB-A for  $21.99 at Amazon (normally $30).\n Apple Smart Keyboard for iPad (7th gen) and iPad Air (3rd gen) for  $99 at Amazon (normally $130).\n Anker PowerWave 7.5 Stand Qi wireless charging stand - 10W Galaxy/7.5W iPhone + AC adapter for  $32.99 at Amazon ( clip 34% coupon - normally $49).", "posttime": "2020-06-25 18:57:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,microsd,deals,智能", "title": "今天最划算的交易：乘车门票、iPad、microSD卡等", "title_en": "Today’s best deals: Ticket to Ride, iPads, microSD cards, and more", "transed": 1, "url": "https://arstechnica.com/staff/2020/06/todays-best-deals-ticket-to-ride-ipads-microsd-cards-and-more/", "via": "", "real_tags": ["交易", "microsd", "deals", "智能"]}, {"category": "", "categoryclass": "", "imagename": "f7a4bde07106ef7d6382187d35f641b1.jpg", "infoid": 1008146, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "联邦通信委员会(Federal Communications Commission)通过征求公众意见，启动了对上周T-Mobile故障的调查。鼓励政府机构、公共安全实体、企业和个人就他们在13小时停电期间的经历提交评论。\nFCC在今天的一份公告中表示，我们从受影响的公共安全实体以及州和地方政府的角度征求对这些停电影响的评论。&#34；是否估计有多少呼叫(包括911呼叫)失败或受中断影响？停电对全国的公共安全活动和政府服务有何影响？公共安全实体以及州和地方政府所依赖的数据服务是否中断？\nFCC通知称，停电导致客户无法拨打和接听电话，在某些情况下，还无法通过T-Mobile的VoLTE(VoLTE)网络发送短信，社交媒体报告显示911呼叫受到影响。除了政府和公共安全组织，联邦通信委员会还从受影响的个人和企业消费者的角度征求对此次停电影响的评论。\n消费者是如何得知停电的？T-Mobile关于停电的沟通是否恰当、及时和有效？T-Mobile网络的消费者是否能够成功拨打或接听所有电话、一些电话或根本没有电话？其他通信服务提供商的用户是否能够成功完成对T-Mobile网络用户的呼叫？消费者在停机期间是否成功发送或接收文本消息？在停电期间，T-Mobile网络上的消费者是否经历过数据服务中断？在停电期间，消费者是否能够使用其他方法，如FaceTime、iMessage、Google Meet、Google Duo、Zoom、Skype和其他方法来连接，这种沟通方式是否成功和有效？停机对企业和关键服务提供商(如医院)有何影响？停电对消费者的个人活动有什么影响？\nFCC将提交意见的最后期限定为7月8日。可以在线提交评论的摘要可以在这里找到。阅读公共公告，了解如何通过邮件提交评论的说明。\n正如我们上周报道的那样，联邦通信委员会主席阿吉特·派(Ajit Pai)称停电是不可接受的，并表示联邦通信委员会将要求得到答案。这并不意味着T-Mobile将面临任何惩罚。在之前的案例中，派打电话给移动运营商，要求他们对佛罗里达州的迈克尔飓风做出反应，这是完全不可接受的，但没有施加任何惩罚。\nT-Mobile对上周网络故障的解释说，触发事件已知是东南部一家第三方提供商租用的光纤线路故障。移动网络旨在经受住这种故障，但在这种情况下，T-Mobile表示其网络冗余让我们失望，并导致过载情况，然后再加上其他因素。过载随后导致了网络故障。IP流量风暴从东南部蔓延，在支持VoLTE呼叫的IMS(IP多媒体子系统)核心网络上造成严重的容量问题。为了防止再次出现这种情况，T-Mobile表示，它已经与我们的IMS和IP供应商合作，增加了永久性的额外保护措施，以防止这种情况再次发生，我们将继续努力确定最初过载故障的原因。", "note_en": "The Federal Communications Commission is kicking off its investigation of last week&#39;s T-Mobile outage by seeking public comment. Government agencies, public safety entities, businesses, and individuals are encouraged to submit comments about their experiences during the 13-hour outage.\n &#34;We seek comment on the impact of these outages from the perspective of affected public safety entities, as well as state and local governments,&#34; the FCC said in a  public notice today. &#34;Are there estimates of how many calls, including 911 calls, failed or otherwise affected by the outage? What was the effect of the outage on public safety activities and government services across the country? Was there a disruption of data services relied on by public safety entities and state and local governments?&#34;\n The outage &#34;prevented customers from making calls, receiving calls, and in some cases, sending text messages over T-Mobile&#39;s Voice-over LTE (VoLTE) network,&#34; and social media reports indicated that 911 calling was affected, the FCC notice said. Besides government and public safety organizations, the FCC is seeking comment on &#34;this outage&#39;s impact from the perspective of affected individual and enterprise consumers.&#34;\n  How did consumers learn about the outage? Was T-Mobile&#39;s communication about the outage appropriate, timely, and effective? Were consumers of T-Mobile&#39;s network able to successfully make or receive all calls, some calls, or no calls at all? Were consumers of other communications service providers able to successfully complete calls to consumers of T-Mobile&#39;s network? Were consumers&#39; text messages successfully sent or received during the outage? Did consumers on T-Mobile&#39;s network experience a disruption of data services during the outage? Were consumers able to use alternative measures, such as &#34;FaceTime, iMessage, Google Meet, Google Duo, Zoom, Skype and others to connect&#34; during the outage, and was that method of communication successful and effective? What effect did the outage have on businesses and providers of critical services, such as hospitals? What effect did the outage have on consumers&#39; personal activities?\n The FCC set a deadline of July 8 for submitting comments. The docket where comments can be filed online is  available here. Read the  public notice for instructions on how to submit comments by mail.\n FCC Chairman Ajit Pai called the outage &#34;unacceptable&#34; and said the FCC will be &#34;demanding answers,&#34; as we  reported last week. That doesn&#39;t mean T-Mobile will face any punishment. In a previous case, Pai called mobile carriers&#39; response to Hurricane Michael in Florida &#34; completely unacceptable,&#34; but  imposed no punishment.\n T-Mobile&#39;s  explanation of last week&#39;s network failure said &#34;the trigger event is known to be a leased fiber circuit failure from a third-party provider in the Southeast.&#34; Mobile networks are designed to survive such failures, but in this case T-Mobile said its network &#34;redundancy failed us and resulted in an overload situation that was then compounded by other factors.&#34; The overload then caused an &#34;IP traffic storm that spread from the Southeast to create significant capacity issues across the IMS (IP multimedia Subsystem) core network that supports VoLTE calls.&#34; To prevent recurrences, T-Mobile said it has &#34;worked with our IMS and IP vendors to add permanent additional safeguards to prevent this from happening again and we&#39;re continuing to work on determining the cause of the initial overload failure.&#34;", "posttime": "2020-06-25 18:56:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "fcc,giant,mobile", "title": "如果T-Mobile的大停机影响了你，现在是你告诉FCC的机会了", "title_en": "If T-Mobile’s giant outage affected you, now’s your chance to tell the FCC", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/06/if-t-mobiles-giant-outage-affected-you-nows-your-chance-to-tell-the-fcc/", "via": "", "real_tags": ["fcc", "giant", "mobile"]}, {"category": "", "categoryclass": "", "imagename": "310c4b337219a8bb73edac96078f7605.jpg", "infoid": 1008145, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周二，随着Assetto Corsa Composzione的发布，Xbox One和PlayStation4的模拟竞赛选项变得更加多样化。这款游戏与意大利制片厂库诺斯·西穆拉西奥尼(Kunos Simulazioni)开发的久负盛名的PC赛车SIM Assetto Corsa有些类似。ACC于2019年首次在PC上发布，与其老款游戏相比，ACC是一款目标范围更窄的游戏-这款游戏专注于一种名为GT3的单一赛车类别，它使用的是你可能在路上(或在Ars上看到的)的异国情调的修改版本，如兰博基尼(Lamborghini)Huracáns和阿库拉NSX(Acura NSXs)。\nACC也是GT世界挑战赛的官方游戏，GT世界挑战赛是一个名为SRO的组织在世界各地举办的一系列比赛的集合。这种超专门化的人群在个人电脑世界是有意义的，因为大多数铁杆模拟赛车手都生活在这个世界里，但库诺斯的人们已经将他们的游戏移植到了PS4(我们测试过的)和Xbox One上-这两款游戏机传统上更适合使用更容易获得的驾驶游戏。\n这些年来，我听说过关于Assetto Corsa忠诚度的好评，所以我渴望尝试一下这个系列的游戏机首次亮相，看看它的表现如何。\n在上周的一次简报会上，库诺斯表示，它已经在ACC的空气动力学和轮胎建模方面做了大量工作，这款游戏(与之前的游戏不同)是使用虚幻引擎建造的。对于轮胎模型--可以说是所有赛车模拟器中最重要的部分--制片厂与意大利轮胎公司倍耐力(Pirelli)密切合作，倍耐力是SRO&#39；各种GT3锦标赛的官方轮胎供应商。(TURN 10在当天早些时候为Forza MotorSports 4与倍耐力做了类似的事情，但后来放弃了这一点，转而在随后的比赛中进行自己的轮胎测试。)。\n我还没有机会驾驶倍耐力的GT3赛车轮胎，但如果你在毫无戒备的情况下看到一个真正的赛车手，他们通常会对这个意大利橡胶品牌有很多抱怨。这可能就是为什么ACC的汽车对驾驶如此敏感：一旦你开始滑行，你必须以极快的速度纠正它，而不会完全失去控制。这意味着这是一场你需要时刻保持精确的游戏。如果你玩游戏的方法是捣碎控制器按钮，你不会太喜欢ACC。\n事实上，如果您首选(或唯一)在游戏机上玩驾驶游戏的方式是使用控制器，那么ACC也不适合您。库诺斯说，它花了很多时间来确保游戏可以与游戏手柄一起运行，从技术上讲，游戏也可以在这种模式下运行。但是，除非你的名字是雅克·维伦纽夫，并且你赢得了1997年的一级方程式世界锦标赛，否则你真的，真的不应该在没有方向盘的情况下玩这个游戏。(此外，如果您在游戏手柄和轮子之间切换，则可能需要在游戏中重置轮子设置，以避免一些奇怪的操作问题。)。\n在ACC中对赛车和赛道的模拟非常注重细节。每一个真实世界的轨道(有11个，加上今天Xbox玩家的DLC包和PS4玩家的DLC包中的另外4个)都是通过精确的激光雷达扫描，加上动态照明和不同的天气条件建立起来的。24辆不同的赛车内部和外部都进行了精确的渲染，包括2018年和2019年参加SRO&39；GT3系列比赛的每支车队的多个真实世界的赛车。即使是每辆车的方向盘上的多功能显示器也准确地反映了真正的赛车手将会看到的数据(还有多页数据可供滚动浏览)。\n在PS4或PS4 Pro上，游戏运行速度为1080p，但Pro版本改进了绘制距离、抗锯齿和更好的粒子效果，并提供了以3200×1800运行的选项。对于Xbox One，ACC的运行速度为900p，Xbox One X的运行速度为4k，其他功能刚刚为PS4 Pro列出。然而，在这两款游戏机的所有变种上，游戏的帧率都被限制在30fps。库诺斯说，这样做是为了最大限度地提高游戏的音频和物理模拟处理能力，但当PC版可以通过更强大的显卡达到更高的帧率时，这很可能会让游戏机玩家感觉他们错过了机会。\n如果你花时间倾听驾驶GT3赛车的职业车手，你很快就会听到对车手评级的一次又一次的抱怨。因为ACC非常专注于在线多人比赛，所以它也会评判你的驾驶(包括在线多人和单人比赛)，以便将你排在有竞争力的在线比赛中。这个游戏通过跟踪六个不同的属性来做到这一点，它在你玩游戏的前一两个小时开始计算这些属性。(要么是在你开始进入职业模式时，要么是在我的情况下，如果你花几个小时绕着你知道的赛道转一圈，以便掌握轮胎模型的表现。)。\n赛道能力，或者说你对每个赛道的熟悉程度。设置更多干净的圈数，这个数字就会增加。\n汽车控制-相当不言而喻：如果你驾驶干净，而且不打滑，它就会上升。\n速度，它衡量你有多接近每个赛道的排行榜的最快圈速，以及你在特殊事件中的排名。\n安全与否取决于你避免与其他汽车相撞的程度。除非您的安全等级足够高，否则您将无法参加游戏的某些多人会话。\n赛车能力，这取决于你在赛道上能多好地超越或防御其他赛车。\n其中一些分数需要很长时间才能建立起来。例如，经过几个小时的复习，我的赛道能力、赛车控制和一致性分数都在60-70范围内(满分为100分)。但速度和安全性都只有个位数，赛艇还没有得到一个数字的分数。\n像往常一样，Ars在游戏发布前几天就获得了访问权限。这意味着我的大部分游戏都是单人游戏，因为服务器不是很多。单人游戏有几种不同的选择。还有锦标赛模式，它允许你在2018年或2019年赛季中循环，以与现实世界中相同的曲目顺序呈现。还有职业生涯模式，在这种模式下，你从一系列10分钟的测试开始(白天，然后在雨中，然后在晚上)，然后在锦标赛中穿插着其他测试课程。还有一些特殊的赛事经常变化-这些都是挑战，比如热圈跑特定的赛道或完成比赛的一部分。\nACC还提供一些在线多人选项。您可以根据您喜欢的曲目、您愿意或不想经历的天气条件等来加权要快速加入的服务器的首选项。您可以滚动活动服务器列表并选择一个特定的服务器。如果你的车手排名足够高，你还可以进入一些比赛服务器。(私人游说团体在需要及时实施的事项清单上。)。\n作为一个核心SIM卡，ACC复制了你作为一个真正的GT3赛车手所体验到的许多东西。每一场比赛都以滚动起跑开始，所以在绿灯亮起之前，你必须按双列顺序开车，然后你才能开始超车(或超车)。你会想要在每次比赛前参加练习和排位赛，以确定你从哪个位置出发。而比赛的特点是进站，在每场比赛中都必须在特定的窗口内进行。\n为了帮助你，你有一个比赛工程师，他给你提供信息，并充当观察者，告诉你是否有你看不到的近距离赛车。还有一个有用的雷达式显示屏，当你离其他车很近时，它就会出现在屏幕上。这款游戏有一系列不同的驾驶员辅助装置，如自动挡风玻璃刮水器、前大灯和维修站车道限速器，以帮助管理繁忙的工作量，同时还试图以每小时100英里以上的速度比赛。根据我的经验，其中一些是有问题的--自动维修站车道限速器没有参与我至少一半的比赛，这意味着我可以接受在维修站车道超速30秒的处罚，也可以从一开始就重新开始比赛。此外，不是用户界面坏了，就是我太笨了，不知道如何使用屏幕上的菜单给我的维修站工作人员提供指令，而这个菜单在维修站停留期间似乎是冻结的。\n不要害怕使用像牵引力控制系统和ABS这样的辅助驾驶设备--这些都是真正的GT3赛车上的，专为业余人士设计的。就像其他的模拟赛车游戏一样--甚至更多像Gran Turismo Sports这样的SIMADE游戏--你可以而且可能必须在运行中调整它们，所以记住方向盘上的哪个按钮或刻度盘可能是个好主意。库诺斯还可以更好地通知玩家其中的一些内容-例如，每辆车都有不同的引擎设置或地图，如果你需要节省燃料或下雨，你可以在这些设置或地图之间切换。谢天谢地，因为ACC是在PC上出现的，所以其他人已经做了艰苦的工作来弄清楚其中的一些东西。\n虽然ACC现在可以在三个不同的平台(PC，PS4，Xbox)上使用，但没有跨平台的游戏可玩性。希望加入已经在PC上玩这款游戏的朋友的游戏机玩家们运气不佳。这肯定有技术上的原因，但这意味着你的竞争池将受到限制。对于像这款游戏这样一款专注于体育和在线多人游戏的狭隘游戏来说，这似乎是一个问题。\n事实上，我不明白为什么库诺斯要花时间和精力把Assetto Corsa Composzione移植到游戏机上，而不是把更广泛的Assetto Corsa移植到游戏机上。该系列至少提供了更广泛的汽车驾驶范围，这将吸引更多的观众。作为一款游戏机赛车模拟软件，ACC掌握起来很令人满意，但不如Project Cars 2，在我看来，Project Cars 2有更好的轮胎模型，绝对有更多的赛道和赛车可供选择，而且每个平台都有强大的在线社区。而大多数玩家寻找一个核心的SIM卡，无论如何都会直接去PC，在那里你可以选择Project Cars 2，Assetto Corsa，ACC，iracing等等。\n结论：如果你想要一个硬核的游戏机竞速模拟器，并且真的很喜欢GT3赛车，那就试试吧。大多数其他球员可能都应该过关。\n关于倍耐力的轮胎，有什么好处让他们真的很滑是可以接受的交易？低滚动阻力？\n简而言之，轮胎能提供的抓地力是有限度的。如果你超过这个极限，汽车实际转弯的角度(转向不足)的回报就会递减。你可以查打滑角度来了解更多关于这方面的信息。在比赛时，当方向盘开始感觉到轻，车的后部开始从前面滑出来时，你可以感觉到这个极限。在赛车转向不足或偏离赛道之前，你只有少量的时间通过减速或降低转向角来纠正这一点。因此，让比赛轮胎变得敏感的(人们经常说倍耐力)是，峰值抓地力和撞出赛道之间的窗口非常窄。影响这一点的因素有很多，其中最主要的是轮胎温度，人们对倍耐力轮胎的一个普遍抱怨是，他们的工作温度范围很窄。", "note_en": "On Tuesday, sim-racing options for the Xbox One and Playstation 4 just got a little more diverse with the release of  Assetto Corsa Competizione. The game is a companion of sorts to the well-established PC racing sim  Assetto Corsa, developed by Italian studio Kunos Simulazioni. First released on the PC in 2019,  ACC is a much more narrowly targeted game than its older sibling—this game is focused on  a single category of racing, called GT3, which uses  modified versions of exotica you might see on the road (or reviewed here at Ars) like  Lamborghini Huracáns and  Acura NSXs.\n ACC is also the official game of  GT World Challenge, a collection of race series held around the world by an organization called SRO. That kind of hyperspecific demographic makes sense in the PC world, where most hardcore sim racers live, but the people at Kunos have ported their game to both the PS4 (which we tested) and Xbox One—consoles that have traditionally been better served by more accessible driving games.\n I&#39;ve heard good things about the fidelity of  Assetto Corsa over the years, so I was eager to try out the franchise&#39;s console debut to see how it stacks up.\n  In a briefing last week, Kunos said that it&#39;s done a lot of work with both the aerodynamic and tire modeling of  ACC, which (unlike its earlier game) is built using the Unreal Engine. For the tire model—arguably the most important part of any racing sim—the studio worked closely with Italian tire company Pirelli, which is the official tire supplier for SRO&#39;s various GT3 championships. (Turn 10  did something similar with Pirelli for  Forza Motorsport 4 back in the day but then abandoned that in favor of  doing its own tire testing for subsequent games.)\n I haven&#39;t had a chance to drive a car on Pirelli&#39;s GT3 racing tires, but if you catch an actual race car driver in an unguarded moment, they&#39;ll often have plenty of complaints about the Italian rubber brand. That may well be why the cars in  ACC feel so sensitive to drive: once you start to slide, you have to be extremely fast to correct it without losing control completely. That means this is a game where you need to be precise all the time. If your approach to driving games is to mash controller buttons, you will not enjoy  ACC much.\n In fact, if your preferred (or only) way of playing driving games on consoles is with a controller,  ACC isn&#39;t the game for you, either. Kunos said it spent a lot of time making sure the game works with a gamepad, and the game technically works in this mode. But  unless your name is Jacques Villeneueve and you won the 1997 Formula 1 World Championship, you really, really shouldn&#39;t play this without a steering wheel. (Also, if you switch between a gamepad and a wheel, you may need to reset your wheel settings in the game to avoid some weird handling problems.)\n  There&#39;s a good deal of attention to detail in the simulation of the racing cars and tracks in  ACC. Each of the real-world tracks (there are 11, plus another four available in a DLC pack today for Xbox players and in a couple of weeks for PS4 players) has been built up from accurate lidar scans, along with dynamic lighting and different weather conditions. The 24 different race cars are also accurately rendered, inside and out, including multiple real-world liveries for each of the teams that have contested the SRO&#39;s GT3 series in 2018 and 2019. Even the multifunction display on each car&#39;s steering wheel accurately reflects the data that a real racing driver would be presented with (complete with multiple pages of data to scroll through).\n On a PS4 or PS4 Pro, the game runs at 1080p, but the Pro version has improved draw distances, anti-aliasing, and better particle effects, as well as an option to run it at 3200×1800. For the Xbox One,  ACC runs at 900p, with the Xbox One X running at 4k along with the other features just listed for the PS4 Pro. However, the game&#39;s frame rate has been capped at 30 fps on all variants of both consoles. Kunos said this was done to maximize processing power for the game&#39;s audio and physics simulation, but when the PC version can reach higher frame rates with more powerful graphics cards, that may well leave console players feeling like they&#39;re missing out.\n  If you spend any time listening to professional drivers who race GT3 cars, you will quickly hear  complaint after complaint about  driver ratings. Because  ACC is heavily focused on online multiplayer racing, it too judges your driving (both in online multiplayer and single-player races) in order to rank you into competitive online matchups. The game does this by tracking six different attributes, which it begins calculating during your first hour or two of gameplay. (Either as you start in career mode, or in my case, if you spend a couple of hours lapping a track you know in order to get a handle on how the tire model behaves.)\n  Track Competence, or how well you know your way around each circuit. Set more clean laps and this number increases.\n Car control—pretty self-explanatory: it goes up if you drive clean and don&#39;t spin out.\n  Pace, which measures how close you are to the fastest lap times for each circuit&#39;s leaderboards, as well as how you rank in the special events.\n Safety is determined by how well (or poorly) you avoid colliding with other cars. You won&#39;t be able to participate in some of the game&#39;s multiplayer sessions unless your safety ranking is high enough.\n Racecraft, which is determined by how well you can overtake or defend against other cars on track.\n  Some of these scores will take a long time to build up. For example, after a few hours of play for this review, my track competence, car control, and consistency scores are all in the 60-70 range (on a 100-point scale). But pace and safety are only in single digits, and race craft has yet to get a numerical score.\n  As usual, Ars got access to the game a few days before its launch. That means most of my gameplay has been single player because the servers aren&#39;t heavily populated. Single player has a few different options. There&#39;s the championship mode, which lets you cycle through either the 2018 or 2019 seasons, presented in the same order of tracks as they were in the real world. There&#39;s career mode, where you start off with a series of 10-minute test sessions (during the day, then in the rain, then at night) before running through a championship interspersed with other test sessions. And there are some special events which change every so often—these are challenges like hot lapping a particular circuit or completing part of a race.\n ACC also provides some online multiplayer options. You can weight preferences for servers to Quickjoin based on tracks you like, weather conditions you do or don&#39;t want to experience, and so on. You can scroll through a list of active servers and pick a particular one. And if your driver ranking is high enough, you can also enter some of the competition servers. (Private lobbies are on the list of things to be implemented in time.)\n   As a hardcore sim,  ACC replicates many of the things you&#39;d experience as an actual GT3 racing driver. Each race begins with a rolling start, so you have to drive in double-file order before the lights go green and you can begin overtaking (or getting passed). You&#39;ll want to take part in practice and qualifying sessions before each race to determine which position you start from. And races feature pit stops, which have to be performed within a specific window during each race.\n To help you out, you have a race engineer who gives you information and acts as a spotter, telling you if there are cars in close proximity that you can&#39;t see. There&#39;s also a useful radar-like display that appears on the screen when you&#39;re in close proximity to other cars. And the game has a bunch of different driver assists like automatic windshield wipers, headlights, and pit-lane speed limiters to help manage what can be a hectic workload while also trying to race at over 100mph. In my experience, some of these are buggy—the automatic pit-lane speed limiter didn&#39;t engage in at least half my races, which means I could either accept a 30-second penalty for speeding in the pit lane, or I could restart the race from the beginning. Also, either the UI is broken or I&#39;m too dumb to work out how to give my pit crew instructions using a on-screen menu that appears frozen during those pit stops.\n Don&#39;t be afraid to use driver aids like traction control and ABS—these are present on real GT3 race cars, which are designed to be accessible to amateurs. Like other racing sims—and even more &#34;simcade&#34; games like   Gran Turismo Sport—you can and may have to tweak these on the fly, so memorizing which buttons or dials on your steering wheel do what is probably a good idea. Kunos could also have done a better job informing players about some of these—for example, each car has different engine settings or maps, which you&#39;ll switch between if you need to save fuel or it rains. Thankfully, because  ACC came out on the PC, other people have  done the hard work to figure out some of that stuff.\n  Although  ACC is now available on three different platforms (PC, PS4, Xbox), there is no cross-platform gameplay. Console players hoping to join friends who are already playing the game on PC are out of luck. There are bound to be technical reasons for that, but it means your pool of competition is going to be restricted. And for a game as narrowly focused as this one, with as much emphasis on esports and online multiplayer, that seems like a problem.\n In fact, I&#39;m at a loss to understand why Kunos spent the time and effort to port  Assetto Corsa Competizione to consoles rather than the broader  Assetto Corsa. That series at least offers a wider range of cars to drive, which would appeal to a wider audience. As a console racing sim,  ACC is satisfying to master but less so than   Project Cars 2, which in my opinion has a better tire model and definitely has a much bigger array of tracks and cars to choose from, as well as robust online communities for each platform. And most players looking for a hardcore sim will go straight to the PC anyway, where you have your pick of  Project Cars 2,  Assetto Corsa,  ACC,  iRacing, and more.\n       Verdict: Try it if you want a hardcore console race sim and really love GT3 racing. Most other players should probably pass.\n  Regarding the Pirelli tires, what is the up-side that makes them being really slippery an acceptable trade? Low rolling resistance?\n  To put is simply, there is a limit to the amount of grip a tire can offer. If you push beyond this limit, there are diminishing returns to the angle the car will actually turn at (understeer). You can look up slip angle for more info on this.  When racing, you can sense this limit when the steering starts to feel light and the rear of the car begins to slide out from the front. You have a small amount of time to correct this, by slowing down or lowering the steering angle, before the car will understeer or spin off the track.  So what makes a race tire sensitive (and what people often say about Pirelli) is that the window between peak grip and crashing off the track is very narrow. There are a whole load of factors that play into this, the main one being tire temperature, where a common complaint about the Pirelli tires is that their operating temperature bands are narrow.", "posttime": "2020-06-25 18:55:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,赛车,racing", "title": "一个棘手的赛车模拟：Assetto Corsa Composzione现在安装在游戏机上", "title_en": "One tricky racing sim: Assetto Corsa Competizione is now on consoles", "transed": 1, "url": "https://arstechnica.com/gaming/2020/06/one-tricky-racing-sim-assetto-corsa-competizione-is-now-on-consoles/", "via": "", "real_tags": ["游戏", "赛车", "racing"]}, {"category": "", "categoryclass": "", "imagename": "ef67c94d6ad91c977ac2d0d67e4c6829.jpg", "infoid": 1008143, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，苹果在其开发者网站上宣布了一系列面向开发者的新举措、新服务和新工具。该公司列出的大部分内容都是它在正在进行的开发者大会上推广的标准产品的演变，但有一项似乎是对最近Dropbox引发的关于App Store指导方针的争议的直接回应-我们上周对此进行了详细的报道。\n展望未来，这家库比蒂诺公司表示，除非存在法律方面的担忧，否则它将不再因违反指导方针而推迟漏洞修复。苹果还表示，它将为开发者提供新的渠道，让他们挑战自己的判断。\n苹果在拒绝了由Basecamp开发的电子邮件应用程序嘿的错误修复更新后受到了抨击。苹果公司告诉该应用程序的开发者，该应用程序必须集成苹果自己的应用内购买系统，否则将面临被摘牌的风险。苹果还声称，它一开始就应该拒绝这款应用，但它只是在审查错误修复提交时才注意到这个问题。\nBasecamp的首席技术官在推特上发表了一条慷慨激昂的帖子，指责苹果公司坚持削减这款应用程序的收入是犯罪行为。这条推文引发了大量讨论，不仅是关于苹果收取应用程序收入的问题，也是关于该公司未能在App Store指导方针上保持透明和一致的讨论。\n此外，APP审查流程将有两个变化，并将于今年夏天实施。首先，开发者不仅可以就应用程序是否违反App Store审查指南的给定指南提出上诉，而且还将有一种机制来挑战指南本身。其次，对于已经在App Store上的应用程序，除与法律相关的问题外，错误修复将不再因违反指导方针而延迟。取而代之的是，开发人员将能够在他们的下一次提交中解决该问题。\n开发人员肯定会很高兴听到有关由错误修复组成的更新的更改。苹果公司声明的其余部分似乎表明，该公司正在开辟新的途径，与开发者讨论App Store审查指导方针以及苹果根据这些指导方针做出的具体判断。\n不过，这看起来会是什么样子还不清楚。同样不清楚的是，这是否会导致政策或执法方面的任何实际变化。随着这些变化在夏季晚些时候推出，更多细节可能会公布，但目前，苹果主要是告诉开发者，它正在倾听。\n上周，苹果高级副总裁菲尔·席勒接受了TechCrunch的采访，他为苹果的指导方针辩护，并表示实际政策不会改变，以回应对嘿情况的投诉。然而，在Basecamp提交了一个最低限度遵循苹果指导方针的应用版本后，苹果最终还是批准了嘿应用程序。这场争端可能会持续下去。\n苹果在今天的文章中提到的其他新计划、服务和工具包括对剪辑和窗口小部件的解释、访问新的或扩展的API和框架，如ARKit，一个帮助开发人员计划货币化的新StoreKit工具，关于Xcode重新设计的细节，SwiftUI中的新功能，Catalyst的扩展功能，以及关于新的隐私要求的信息。", "note_en": "Apple took to its developer website to  announce a number of new initiatives, services, and tools for developers today. Most of what the company listed are evolutions of the standard offerings it promotes at its ongoing developer conference, but one line item appears to be a direct response to the recent controversy over App Store guidelines raised by Dropbox—which we  wrote about at length last week.\n Moving forward, the Cupertino company says it will no longer hold up bug fixes over guideline violations except where legal concerns are at play. Apple also says that it will offer new channels for developers to challenge its judgments.\n Apple came under fire after it rejected a bug-fix update to email app Hey, which is made by Basecamp. Apple told the app&#39;s developers that the app would have to incorporate Apple&#39;s own system for in-app purchases or risk being delisted. Apple also claimed it should have rejected the app to begin with but that it only noticed the issue when reviewing the bug-fix submission.\n The CTO of Basecamp took to Twitter with an impassioned thread accusing Apple of criminal behavior for insisting on a cut of the app&#39;s revenues. The tweet thread sparked a great deal of discussion, not only about Apple&#39;s take of app revenues but also about the company&#39;s failure to be transparent and consistent about App Store guidelines.\n  Additionally, two changes are coming to the app review process and will be implemented this summer. First, developers will not only be able to appeal decisions about whether an app violates a given guideline of the App Store Review Guidelines, but will also have a mechanism to challenge the guideline itself. Second, for apps that are already on the App Store, bug fixes will no longer be delayed over guideline violations except for those related to legal issues. Developers will instead be able to address the issue in their next submission.\n Developers will surely be glad to hear of the change regarding updates that are composed of bug fixes. The rest of Apple&#39;s statement seems to suggest that the company is opening up new avenues of discussion with developers about App Store review guidelines and specific judgments Apple makes based on them.\n What that will look like is unclear, though. Equally unclear is whether it will lead to any actual changes in policy or enforcement. More details will likely come as the changes roll out later in the summer, but for now, Apple is mainly just telling developers that it&#39;s listening.\n Last week, Apple SVP Phil Schiller  gave an interview to TechCrunch in which he defended Apple&#39;s guidelines and said there would be no changes to the actual policies in response to the complaints about Hey&#39;s situation. However, Apple nonetheless  approved the Hey app after all, after Basecamp submitted a version of the app that followed Apple&#39;s guidelines in a minimal way. The dispute is likely to continue.\n The other new initiatives, services, and tools that Apple  mentioned in its article today include an explanation of Clips and Widgets, access to new or expanded APIs and frameworks like ARKit, a new StoreKit tool for helping developers plan out monetization, details about the Xcode redesign, new capabilities in SwiftUI, expanded features for Catalyst, and information on new privacy requirements.", "posttime": "2020-06-25 18:54:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,程序,changing,开发者", "title": "在嘿争议之后，苹果正在改变其应用程序审查程序的部分内容", "title_en": "Apple is changing parts of its app review process after the Hey controversy", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/06/apple-opens-new-appeals-channel-for-devs-frustrated-by-app-store-guidelines/", "via": "", "real_tags": ["apple", "苹果", "程序", "changing", "开发者"]}, {"category": "", "categoryclass": "", "imagename": "808e324e1237ecca9834bfc566593762.jpg", "infoid": 1008142, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国总统唐纳德·特朗普(Donald Trump)昨天发布命令，暂停发放一系列工作签证，包括允许高技能工人及其家人进入美国为美国科技公司工作的签证，之后科技公司对特朗普政府进行了反击。\n4月和6月的命令都声称，在美国试图从与新冠肺炎相关的大量失业中恢复过来的同时，在这个时候接纳其他国家的工人将使美国处于经济劣势。新命令将现有的对进入美国的移民限制至少延长到今年年底，并另外禁止在2020年下半年发放几类非移民工人签证。目前受到限制的签证包括H-1B类，适用于持有高技能学位的工人；H-2B类，适用于非农业行业的临时工；J类，适用于教育和专业交流访客；以及L类，适用于在他们已经工作的公司内调往美国地点的个人。\n该命令不适用于任何已经持有绿卡的人，是美国公民的配偶或孩子，或者国务院或国土安全部认定其入境将符合国家利益的人，包括参与新冠肺炎研究或治疗的医护人员。临时入境的农业工人也可以免税。该命令只适用于新签证，不影响那些已经获得相关签证批准或已经在美国的人。\nH1-B计划的上限是每年8.5万个签证，美国大型科技公司通过该计划激烈竞争招聘外国工人。根据招聘公司Dice编制的联邦数据，仅谷歌一家就在2019年申请了超过7600个H-1B签证。\n谷歌发言人在回应新行政命令时表示，移民不仅推动了技术突破，创造了新的商业和就业机会，还丰富了美国人的生活。美国的持续成功取决于公司能否从世界各地获得最优秀的人才。尤其是现在，我们需要这些人才来帮助美国的经济复苏。\n科技竞争对手Facebook和亚马逊也呼应了这样的观点，即切断国际人才的渠道将阻碍而不是帮助美国经济复苏。Facebook表示，将高技能人才拒之门外的举措将使我们国家的复苏变得更加困难。高技能的签证持有者在推动创新方面发挥着至关重要的作用-无论是在Facebook还是在全国各地的组织-这是我们应该鼓励的，而不是限制的。\n亚马逊直言不讳地说：我们反对政府的短视行为。高技能签证计划的价值显而易见，我们感谢来自世界各地的众多亚马逊员工来到美国，为我们的客户创新新产品和服务。\n主要的科技行业贸易团体，包括互联网协会和信息技术产业理事会，也谴责了政府的举动。\n尽管美国大公司都使用H-1B客工签证雇佣工人，但该计划并不是没有争议。OneZero 2月份的一份报告发现，许多持H-1B签证为美国公司工作的员工由于移民身份，在工作中感受到额外的压力、歧视或恐惧。一位员工告诉OneZero，我认为H-1B员工往往会容忍更多来自经理的废话，因为他们不能那么容易地跳槽到另一家公司，他们不能就这么愤怒地辞职。", "note_en": "Tech firms are pushing back against the Trump administration after President Donald Trump yesterday issued an order suspending the issuance of a wide range of work visas, including the type that allows high-skilled workers and their families to enter the country and work for American technology companies.\n  Both the April and June orders claim that admitting workers from other nations at this time would put the United States at an economic disadvantage while the nation tries to recover from massive job losses related to COVID-19. The new order extends the existing limitations on immigration into the US through at least the end of the year, and it additionally prohibits several categories of non-immigrant worker visas from being issued in the back half of 2020. The visas now being limited include types H-1B, which applies to high-skilled degree-holding workers; H-2B, which applies to temporary workers in non-agricultural industries; J, which applies to exchange visitors, both educational and professional; and L, which applies to individuals transferring to a US location within the company for which they already work.\n The order does not apply to anyone who already holds a green card, who is the spouse or child of a US citizen, or whose entry &#34;would be in the national interest&#34; as determined by the State Department or the Department of Homeland Security, including health care workers involved in COVID-19 research or treatment. Agricultural workers entering the country temporarily are also exempt. The order applies only to new visas and does not affect those who already have been approved for a relevant visa or are already in the US.\n  The H1-B program is capped at 85,000 visas per year, and large US tech firms compete mightily to hire foreign workers through that program. Google alone filed for more than 7,600 H-1B visas in fiscal year 2019, according to federal data  compiled by recruiting firm Dice.\n &#34;Immigrants have not only fueled technological breakthroughs and created new businesses and jobs but have also enriched American life,&#34; a Google spokesperson said in response to the new executive order. &#34;America&#39;s continued success depends on companies having access to the best talent from around the world. Particularly now, we need that talent to help contribute to America&#39;s economic recovery.&#34;\n Tech rivals Facebook and Amazon also echoed the sentiment that choking off the pipeline for international talent would hinder, rather than help, US economic recovery. &#34;The move to keep highly-skilled talent out of the US will make our country&#39;s recovery even more difficult,&#34; Facebook said. &#34;Highly-skilled visa holders play a critical role in driving innovation—at Facebook and at organizations across the country—and that&#39;s something we should encourage, not restrict.&#34;\n &#34;We oppose the Administration&#39;s short-sighted action,&#34; Amazon said bluntly. &#34;The value of high-skilled visa programs is clear, and we are grateful for the many Amazon employees from around the world that have come to the US to innovate new products and services for our customers.&#34;\n Major tech-industry trade groups, including the Internet Association and the Information Technology Industry Council, also denounced the administration&#39;s move.\n Although major US firms all employ workers on H-1B guest worker visas, the program has not been without controversy. A  February report from OneZero found that many employees working for US firms on H-1B visas experience additional pressure, discrimination, or fear at work due to their immigration status. &#34;I believe that H-1B employees tend to tolerate more bullshit from managers because they cannot move to another company that easily, and they cannot just rage-quit,&#34; one employee told OneZero.", "posttime": "2020-06-25 18:54:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,google,亚马逊,谷歌,工人", "title": "谷歌和亚马逊谴责特朗普下令切断外国工人签证", "title_en": "Google, Amazon condemn Trump order cutting off foreign worker visas", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/06/google-amazon-condemn-trump-order-cutting-off-foreign-worker-visas/", "via": "", "real_tags": ["amazon", "google", "亚马逊", "谷歌", "工人"]}, {"category": "", "categoryclass": "", "imagename": "9c17506c5a5ac50e6cfff902308b255a.jpg", "infoid": 1008141, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自去年推出以来，Oculus一直严格控制无线Quest耳机上的软件库，将该公司所称的质量第一的方法应用于应用审批。今天，Oculus承诺将在明年初推出一条新的应用程序分发路径，以放松这种控制。\n在今天的一篇博客文章中，Oculus表示其针对Quest的类似控制台的管理方法取得了成功，突出了Quest第一年超过1亿美元的内容销售额。同样严格的管理仍然适用于未来的Main Quest商店。\n但Oculus现在表示，它还将在2021年初为开发者增加一种分发Quest应用程序的新方式。该公司写道，这个新的渠道将使开发者能够将他们的应用程序分享给任何有任务的人，而不需要被Oculus商店接受，也不需要额外加载。\n目前，在Quest耳机上添加未经批准的应用程序需要将设备设置为不太安全的开发者模式，并使用SideQuest等基于PC的工具来传输必要的文件。Oculus没有透露其新的应用程序分发方法的太多细节，但对于寻找更广泛虚拟现实软件的最终用户来说，这一过程听起来会更流畅。\n虽然这个新渠道中的Quest应用程序仍必须符合Oculus的一般内容政策(例如，禁止色情、禁止仇恨言论、禁止真金白银赌博等)，但Quest应用程序仍必须遵守Oculus的一般内容政策。Oculus写道，通过这个新渠道分发的应用程序将不会符合与Oculus商店官方应用程序相同的技术标准。这使得它非常适合那些想要尽可能广泛地分享他们的应用程序[或]测试早期应用程序并分发给特定用户的开发者。\nOculus此举正值苹果面临自身的争议和潜在的反垄断调查，原因是苹果对其iOS应用商店的控制过于严格。\n除了Quest软件的扩展，Oculus今天还宣布停止对其较旧的Oculus Go硬件的支持。该公司目前在其官方网站上将围棋耳机列为不再提供，12月4日之后，开发者将不能再向Oculus提交新的围棋应用程序或更新。\n这款独立的Go头戴式耳机是Oculus最后一款不支持手部跟踪控制器或头部跟踪六自由度运动的产品，它本身就是基于手机的Gear VR系列的替代品。对于一家试图与过去功能更有限、功能更差的硬件划清界限的公司来说，反对这种硬件是有一定意义的。\n与此同时，价格低廉的Go(32 GB版本只需149美元)对于那些想要比谷歌纸板(Google Cardboard)之类的虚拟现实体验更上一层楼的用户来说，是一款很棒的入门级耳机。教育、培训和博物馆等注重成本的使用案例可能会被迫投资于400美元的Oculus Quest，即使它们不需要扩展的功能集。", "note_en": "Since  its launch last year, Oculus has kept tight control over the library of software on the wireless Quest headset, applying what the company called  a &#34;quality-first approach&#34; to app approval. Today, Oculus pledged to loosen that control with a new app-distribution path to be rolled out early next year.\n In  a blog post today, Oculus says its console-like curation approach for Quest has been a success, highlighting  over $100 million in Quest content sales in its first year. That same tight curation will still apply for the main Quest store going forward.\n But Oculus now says it will also be adding &#34;a new way for developers to distribute Quest apps&#34; in early 2021. This new channel &#34;will enable developers to share their apps to anyone with a Quest, without having to be accepted into the Oculus Store, and without the need for sideloading,&#34; the company writes.\n Currently, adding unapproved apps to a Quest headset requires setting the device to a less secure &#34;Developer&#34; mode and using  a PC-based tool like SideQuest to transfer the necessary files. Oculus isn&#39;t sharing many details about its new app distribution method, but the process sounds like it will be more streamlined for end users looking for a wider array of VR software.\n While Quest apps in this new channel will still have to conform to  Oculus&#39; general content policies (e.g., no pornography, no hate speech, no real-money gambling, etc.) Oculus writes that &#34;apps distributed through this new channel won&#39;t be held to the same technical standards as official Oculus Store apps.&#34; That makes it ideal for developers who &#34;want to share their apps as broadly as possible [or] test early-stage applications and distribute to specific users.&#34;\n Oculus&#39; move comes as Apple  faces its own controversy and  potential antitrust probes surrounding overly tight control of its iOS App Store.\n     Alongside the expansion for Quest software, Oculus also today announced the end of support for its  older Oculus Go hardware. The company now lists the Go headset as &#34;no longer available&#34;  on its official website, and developers will no longer be able to submit new Go apps or updates to Oculus after December 4.\n The self-contained Go headset—itself built as a replacement for  the mobile phone-based Gear VR line—was the last Oculus product that didn&#39;t feature support for hand-tracking controllers or head-tracking six-degree-of-freedom movement. Deprecating that hardware makes some sense for a company trying to make a clean break from the more limited, less capable hardware of the past.\n At the same time, the budget-priced Go (only $149 for a 32GB version) was a great entry-level headset for users who wanted a VR experience that was still a step up from  something like Google Cardboard. Cost-focused use cases like education, training, and museums will likely be forced to invest in the $400 Oculus Quest instead, even if they don&#39;t need its expanded feature set.", "posttime": "2020-06-25 18:53:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,销售,start,oculus", "title": "Oculus将开始销售Quest软件，无论质量如何", "title_en": "Oculus will start selling Quest software regardless of quality", "transed": 1, "url": "https://arstechnica.com/gaming/2020/06/oculus-will-start-selling-quest-software-regardless-of-quality/", "via": "", "real_tags": ["软件", "销售", "start", "oculus"]}, {"category": "", "categoryclass": "", "imagename": "94729a65cdb5795b1cb9e3c046d8fa51.jpg", "infoid": 1008140, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "NBA Jam是如何克服了一次艰难的发射，成为街机时代有史以来最热门的作品之一？它的开发者是如何走出严重的数字化困境的呢？由迈克尔·乔丹和小肯·格里菲主演的传奇原版在哪里？\n在NBA Jam的最新家庭版前夕--这一次是作为Arcade1Up橱柜(百思买(Best Buy)和沃尔玛(Walmart))推出该系列的前三个街机版本--我们邀请了该系列的首席程序员兼设计师马克·特梅尔(Mark Turmell)从他家和我们一起回答这些问题和更多问题。结果是我们最火的战争故事视频，完整的原创发展镜头由特梅尔本人提供。\n正如他在接受我们采访时所解释的那样，特梅尔的游戏开发历史始于早期的游戏机和家用电脑，直到1989年他在芝加哥街机游戏和弹球制造商Williams公司转行从事投币式游戏业务。(两年后，该公司的拱廊部门更名为Midway，因为威廉姆斯在1988年收购了Bally/Midway。)。特梅尔表示：在他受聘后不久，该公司开始专注于一种趋势，这一趋势最终将定义它的许多热门产品：我们正在数字化图形概念、新技术(如果你愿意的话)上苦苦挣扎。\n但这意味着要想出一种全新的方式来表现视频游戏角色，特梅尔解释了由此带来的一些最大的开发难题。在一个例子中，他描述了一个关键的视频捕捉环节，围绕着演员在蓝屏前打篮球。特梅尔说，制服应该是平淡无奇的灰色，但是制服是蓝色的。我们没有时间重新粉刷。我们为工作室的时间付钱。开发团队必须手工雕刻每一帧，才能将它们导入游戏，而不是干净利落地涂抹出像绿色这样明亮的颜色。\n另一个问题来自这款游戏的早期版本，让测试人员感到困惑，因为有四个相貌相似的NBA球星挤在一个屏幕上。正如特梅尔解释的那样，一名年轻玩家在现场测试时贴在了3号玩家柜子的位置上，尽管他已经按下了2号玩家的开始按钮。开发人员当时正站在一旁检查玩家对游戏开发中版本的反应，他们震惊地发现，即使在被告知他控制了错误的角色后，这名玩家还是转回了P3控件(这实际上并没有影响游戏)。他们震惊地发现，即使在被告知他控制了错误的角色之后，这名玩家还是转回到了P3控件(这实际上并没有影响游戏)。他们震惊地发现，即使在被告知他控制了错误的角色之后，这名玩家还是转回了P3控件(这实际上并没有影响游戏)。特梅尔说，他根本没有与游戏互动，他更喜欢这样，所以这对我们来说是一个很大的危险信号。他最终解释了一些解决方案，包括游戏大头作弊代码，将其作为控制哪位NBA球星的明确指标。\n特梅尔详细介绍了其他开发实验，包括橡皮筋游戏的幕后统计数据，以及开发人员如何获取真实NBA球员的图像。我们试图-再一次-说服特梅尔为我们提供传奇的迈克尔乔丹EPROM，他再次证实，它被用在一些精选的特殊橱柜中，提供给像MJ自己这样的名人。尽管特梅尔说这个稀有的EPROM在野外，但截至发稿时，我们还没有找到它，尽管特梅尔本人声称他在某个地方仍然有它的副本。(相反，我们的视频包括插入了MJ的世嘉创世版本的风扇创建的ROM。)。\n马克，请：我们知道你是底特律活塞的终生粉丝，但是在像娱乐体育节目电视网的“最后的舞蹈”这样一系列令人惊叹的纪录片之后，我们认为是时候把真正的23首歌送给NBA Jam的粉丝了。", "note_en": "How did  NBA Jam overcome a rocky launch and become one of the arcade era&#39;s all-time biggest hits? How did its developers move past a serious &#34;digitization&#34; screw-up? And where&#39;s the legendary original version featuring Michael Jordan and Ken Griffey, Jr?\n On the eve of  NBA Jam&#39;s latest home release—this time as an Arcade1Up cabinet ( Best Buy,  Walmart) featuring the series&#39; first three arcade versions—we asked series lead programmer and designer Mark Turmell to join us from his home to answer these questions and more. The result is our most &#34;on-fire&#34; War Stories video yet, complete with original development footage provided by Turmell himself.\n  As he explains in our interview, Turmell&#39;s game development history began with early consoles and home computers before he &#34;shifted to the coin-op business&#34; in 1989 with Williams, a Chicago arcade game and pinball manufacturer. (Two years later, the company&#39;s arcade division was re-branded &#34;Midway,&#34; since Williams had bought Bally/Midway in 1988.) Shortly after his hire, the company began focusing on a trend that would eventually define many of its hits: &#34;We were geeking out on the digitized graphics concept, the new technology, if you will,&#34; Turmell says.\n But that meant figuring out a whole new way to represent video game characters, and Turmell explains some of the biggest development headaches that came as a result. In one example, he describes a pivotal video-capture session that revolved around actors playing basketball in front of a blue screen. Uniforms were supposed to arrive in a bland, gray color, but &#34;the uniforms came in and they were blue,&#34; Turmell says. &#34;We had no time to repaint. We were paying for studio time.&#34; The development team had to carve &#34;every single frame&#34; by hand to import them into the game, instead of neatly blocking out a bright color like green.\n Another issue came from the game&#39;s early version confusing testers, in terms of having four similar-looking NBA stars cluttering a single screen. As Turmell explains, one young player at a live testing location posted up on the &#34;player 3&#34; position of a cabinet, even though he had pressed start on &#34;player 2.&#34; The developers were standing by to examine how players responded to the game&#39;s in-development version, and they were stunned to learn that this player, even after being told he was controlling the wrong character, shifted back to the P3 controls (which didn&#39;t actually affect the game) because he thought he was playing better that way. &#34;He was not interacting with the game at all and preferred that, so that was a big red flag for us,&#34; Turmell says. He eventually explains some solutions, including the game&#39;s &#34;big head&#34; cheat code as a clear indicator of which NBA star was being controlled.\n Turmell goes into detail about other development experiments, including &#34;rubber-banding&#34; of the game&#39;s under-the-hood stats and how the developers sourced images of real NBA players. We tried— once again—to convince Turmell to provide us with the legendary Michael Jordan EPROM, which he again confirms was used in a select few special cabinets provided to celebs like MJ himself. Though Turmell says that this rare EPROM is in the wild, we haven&#39;t been able to find it as of press time, though Turmell himself has claimed that  he still has a copy of it somewhere. (Our video instead includes fan-created ROMs for the Sega Genesis version with MJ inserted.)\n Mark, please: We know you&#39;re a lifelong Detroit Pistons fan, but after a stunning documentary series like ESPN&#39;s  The Last Dance, we think it&#39;s time to deliver the real 23 to  NBA Jam&#39;s fans.", "posttime": "2020-06-25 18:53:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "最初,original,游戏", "title": "Boomshakalaka：最初的NBA Jam是如何在混乱中起火的", "title_en": "Boomshakalaka: How the original NBA Jam caught fire through chaos", "transed": 1, "url": "https://arstechnica.com/gaming/2020/06/boomshakalaka-how-the-original-nba-jam-caught-fire-through-chaos/", "via": "", "real_tags": ["最初", "original", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "b31c85b9dd945dcbca09448ff55c00d6.jpg", "infoid": 1008139, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每个想要寻找流行病带来的一线希望的人都可以访问作者兼制片人乔治·R·R·马丁(George R.R.Martin)的博客，在那里，这位“冰与火之歌”(The Song of Ice&Amp；Fire)系列丛书的创作者为下一部提供了新的希望。马丁周二坚持认为，“冬季之风”的进展仍在继续，他敢于给出一个充满希望的估计(尽管，很明显，不是一个上映日期)。\n强制与世隔绝帮助我写作，马丁在他有趣的名字“不是博客”上写道。他确认了过去一周取得的一系列进展，“寒风”总共有五章，他指出，在整理这本书的过程中，每天的工作时间都很长。\n马丁随后提到了今年新西兰球迷大会的取消，他承认，在某些方面，这是一个完美的发展。\n他写道：我现在最不需要的就是长时间的打断，这可能会让我失去所有建立起来的动力。明年[2021年]我总是可以去惠灵顿，我希望新冠肺炎和“冬天的风”都能完成。\n当然，这一估计来自于一位作家，他自2011年以来就让Soi&amp；F的爱好者们等待着“与龙共舞”的续集。马丁此前曾告诉粉丝，他会在HBO推进《权力的游戏》第六季之前完成这本未完成的书。2015年，他在接受“娱乐周刊”采访时表示，他将采取哪些步骤来实现这一主张：\n也许我对能多快完成任务过于乐观了。但我取消了两次大会亮相，我拒绝了更多的采访--尽我所能清理我的甲板，把这件事做完。\n这意味着，马丁为了势头而跳过大会的保证，对于这本书系列的其余忠实粉丝来说，可能听起来很空洞。对于那些对HBO电视剧大结局无动于衷的人来说，这些保证可能也是空洞的。这部电视剧是根据“冰与火之歌”改编的。这一声明提醒人们，马丁还有很长的路要走：这并不意味着这本书将于明天完成或下周出版。\n马丁周二的帖子提醒了粉丝们他目前正在旋转的其他盘子。他提到了HBO即将播出的前传电视剧“龙之家”的制作团队取得的进展，然后一口气说出了他想要搬上大大小小银幕的各种作品：根据恩迪·奥科拉(Nnedi Okorafor)的小说改编的电视剧(HBO在2017年选择了这部电视剧)，根据他自己的短篇小说改编的故事片，以及重新推出的“外卡”(Wild Cards)电视项目(该项目在安静之前曾与Hulu联系在一起)。\n有趣的是，马丁庞大的老项目清单中并没有提到HBO早在2015年就选择的“宇宙队长”电视剧。他在项目清单的结尾补充道：“这是我们正在制作的秘密短片……”(编者注：原文为“宇宙队长”，原文为“宇宙船长”)。他说，“这是我们正在制作的秘密短片……”。嗯，不，如果我把它洒了，那就不是秘密了。\n如果你认为这一切听起来足够忙碌，你可以点击马丁博客上的“向后看”，了解有关他在新墨西哥的书店的最新消息，他每年向一位有前途的科幻作家捐赠的捐款，以及他6月初对正义的呼吁(这是以弗雷德里克·道格拉斯(Frederick Douglas)的一句话的形式出现的)。\n至于周二的帖子，粉丝们关注周二冬季特有的评论是情有可原的，其中包括一件关于他关注的地方的轶事：最近我一直在拜访瑟曦、阿莎、提利昂、巴里斯坦爵士和阿雷奥·霍塔。我下周将回布拉沃斯。", "note_en": "Everyone in search of a pandemic-based silver lining can head to author and Producer George R.R. Martin&#39;s blog, where the creator of the  Song of Ice &amp; Fire book series offers new hope for its next installment. Progress continues on  The Winds of Winter,  Martin insisted on Tuesday, and he has dared to offer a hopeful estimate (though, obviously, not a release date).\n &#34;The enforced isolation has helped me write,&#34; Martin wrote on his amusingly named &#34;Not A Blog.&#34; He confirms a flurry of progress in the past week, adding up to five chapters for  Winds of Winter, and he points to &#34;long hours every day&#34; and &#34;steady progress&#34; in putting the book together.\n Martin then mentions the cancellation of a New Zealand fan convention this year, which he admitted was, in some ways, a perfect development.\n &#34;The last thing I need right now is a long interruption that might cost me all the momentum I have built up,&#34; he wrote. &#34;I can always visit Wellington next year [2021], when I hope that both Covid-19 and  The Winds of Winter will be done.&#34;\n  This estimate, of course, comes from an author who has left  SoI&amp;F enthusiasts waiting since 2011 for a followup to  A Dance with Dragons. Martin had previously told fans that he would get the unfinished book done before HBO moved ahead with a sixth season of  Game of Thrones. In 2015, he told Entertainment Weekly  what steps he&#39;d take to make that assertion a reality:\n Maybe I&#39;m being overly optimistic about how quickly I can finish. But I canceled two convention appearances, I&#39;m turning down a lot more interviews—anything I can do to clear my decks and get this done.\n That means Martin&#39;s assurances about skipping a convention for the sake of &#34;momentum&#34; may ring hollow for the remaining devoted fans of the book series. Those assurances may also ring hollow for anyone left unmoved by  the finale of the HBO series based on  A Song of Ice and Fire. And the announcement comes with a reminder that Martin still has a ways to go: &#34;This does not mean that the book will be finished tomorrow or published next week.&#34;\n Martin&#39;s Tuesday post reminds fans of the other plates he&#39;s currently spinning. He mentions progress by the team responsible for  HBO&#39;s upcoming prequel series  The House of the Dragon, then rattles off various productions he is trying to get onto screens big and small: a TV series based on a Nnedi Okorafor novel (which  HBO optioned in 2017), feature films based on his own short stories, and a &#34;relaunch&#34; of the  Wild Cards TV project (which was previously  linked to Hulu before going quiet).\n Interestingly, Martin&#39;s very large list of years-old projects does  not include a mention of a  Captain Cosmos TV series, which  HBO optioned all the way back in 2015. He concludes his list of projects by adding, &#34;there are the secret shorts we&#39;re doing that... well, no, if I spilled that, it wouldn&#39;t be secret.&#34;\n And if you think all of that sounds busy enough, you can click backwards in Martin&#39;s blog for updates about  his New Mexico bookstore, his  annual endowment given to a promising sci-fi writer, and his early-June call for justice (which came in the form of  a Frederick Douglass quote).\n As far as Tuesday&#39;s post, fans would be forgiven for focusing on Tuesday&#39;s  Winds of Winter-specific commentary, which includes this anecdote about where his focus has been: &#34;Of late I have been visiting with Cersei, Asha, Tyrion, Ser Barristan, and Areo Hotah. I will be dropping back into Braavos next week.&#34;", "posttime": "2020-06-25 18:53:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "马丁,thinking", "title": "一厢情愿的想法：乔治·R·R·马丁(George R.R.Martin)提供了一种新的冬季风估计", "title_en": "Wishful thinking: George R. R. Martin offers a new Winds of Winter estimate", "transed": 1, "url": "https://arstechnica.com/gaming/2020/06/george-r-r-martin-hopes-winds-of-winter-will-be-done-by-2021/", "via": "", "real_tags": ["马丁", "thinking"]}, {"category": "", "categoryclass": "", "imagename": "24a8ed8045ab7f9671d2be8e240ece3a.jpg", "infoid": 1008138, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "宏碁最新的Chromebook是Chromebook Spin 713，这是该公司从2018年起取代Spin 13笔记本电脑的产品。这是一款优质的铝制二合一处理器，搭载第10代英特尔处理器，起价629.99美元。\n这些规格包括13.5英寸、宽高比为3：2的2256×1504IPS LCD触摸屏、第10代英特尔处理器、高达16 GB的RAM、高达256 GB的固态硬盘(NVMe或eMMC)存储以及10小时的电池续航时间。以629.99美元的基准价格计算，您将获得英特尔i5-10210U处理器、8 GB内存和128 GB eMMC固态硬盘。\n触摸屏和触摸板都有Gorilla Glass盖，铰链可以360度完全翻转。侧面有两个USB-C端口、一个全尺寸HDMI端口、一个耳机插孔、一个USB3 Type-A端口和一个MicroSD卡读卡器。两个USB-C端口都支持充电、5Gbps传输和USB-C的DisplayPort。这款笔记本电脑有背光键盘、底部立体声扬声器、双频Wi-Fi 6和蓝牙5。笔记本电脑厚16.8毫米，重1.37公斤(3.02磅)。\n宏基承诺，全铝底盘有些耐用，说加固的设计和减震保险杠可以经受住从高达122厘米(48英寸)的高空坠落，并承受高达60公斤(132磅)的下拉力。\n这款笔记本电脑将于7月在北美推出。与此同时，6月份在欧洲、中东和非洲上市的版本售价为699欧元。", "note_en": "Acer&#39;s newest Chromebook is the  Chromebook Spin 713, the company&#39;s replacement for the  Spin 13 laptop from 2018. This is a premium, aluminum two-in-one that sports a 10th-gen Intel processor and starts at $629.99.\n The specs include a 13.5-inch, 2256×1504 IPS LCD touchscreen with a 3:2 aspect ratio, a 10th-gen Intel processor, up to 16GB of RAM, up to 256GB of SSD (NVMe or eMMC) storage, and &#34;10 hours&#34; of battery life. At the baseline $629.99 price, you&#39;ll get an Intel i5-10210U processor, 8GB of RAM, and a 128GB eMMC SSD.\n The touchscreen and trackpad both get Gorilla Glass covers, and the hinge flips a full 360 degrees. On the sides, you get two USB-C ports, a full-size HDMI port, a headphone jack, a USB 3 Type-A port, and a MicroSD card reader. Both USB-C ports support charging, 5Gbps transfers, and DisplayPort of USB-C. There&#39;s a backlit keyboard, bottom stereo speakers, dual-band Wi-Fi 6, and Bluetooth 5. The laptop is 16.8mm thick and weighs 1.37kg (3.02 lbs).\n Acer promises that the all-aluminum chassis is somewhat durable, saying &#34;the reinforced design and shock-absorbing bumper can survive drops from heights of up to 122 cm (48 inches) and withstand up to 60 kg (132 pounds) of downward force.&#34;\n The laptop launches in North America in July. Meanwhile, the version that comes to Europe, the Middle East, and Africa in June will cost €699.", "posttime": "2020-06-25 18:52:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "chrome,新旗舰,flagship,处理器", "title": "宏基新旗舰Chromebook为全铝Spin 713", "title_en": "Acer’s new flagship Chromebook is the all-aluminum Spin 713", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/06/acers-chromebook-spin-713-is-a-premium-aluminum-chromebook-for-630/", "via": "", "real_tags": ["chrome", "新旗舰", "flagship", "处理器"]}, {"category": "", "categoryclass": "", "imagename": "232b8be6530b47b0c0d30ce0bc0c63ae.png", "infoid": 1008137, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "相对论空间公司表示，它已经与铱星公司达成协议，将发射该公司的六颗下一代通信卫星。\n每颗重达850公斤的Iridium Next卫星将分别搭载着相对论的“人族1号”火箭发射。这意味着新的发射服务协议将导致多达6次人族1号任务，不早于2023年开始。\n总部位于加州的相对论公司的联合创始人蒂姆·埃利斯(Tim Ellis)表示，这是该公司的第五份发射服务协议。埃利斯表示，这份协议代表着又一家与相对论签约的蓝筹股公司。他说，这表明人族1号具有1.25吨到近地轨道的潜在升空能力，满足了发射市场上的一个独特需求。\n相对论空间公司目前正在佛罗里达州卡纳维拉尔角空军站为其人族1号火箭发射场开发。该公司签订了一份多年合同，将在发射综合体16建造和运营自己的火箭发射设施。然而，它将需要第二个发射场来容纳铱的卫星。\n埃利斯说，这是因为铱星有66颗卫星组成的星座，在近极地轨道上，分布在6架不同的飞机上，高度780公里。埃利斯说，要到达这个轨道，人族1号火箭需要朝极地发射，因此该公司已经达成协议，将在加利福尼亚州范登堡空军基地建设第二个发射场，这是因为该公司已经达成了一项协议，在加州范登堡空军基地建设第二个发射场，这是因为铱星有一个由66颗卫星组成的星座，分布在780公里的高度上，分布在6架不同的飞机上。该公司将在太空发射综合体6号以南的一个地点进行这项工作。\n铱星公司首席运营官苏齐·麦克布莱德(Suzi McBride)说，该卫星公司已经在轨道上安装了9颗备用卫星。然而，铱在地面上有六个额外的备件，它希望最终根据需要发射到特定的轨道平面。新协议涵盖2023年至2030年。\n铱建造这些卫星主要是为了防止在将其第一批75颗Iridium Next卫星送入轨道的活动中发射失败。从2017年到2019年，所有这些都是通过七次猎鹰9号火箭发射安全送入轨道的。麦克布莱德说，谢天谢地，SpaceX为我们做了一件很棒的工作。\n在发射备件时，铱评估了市场，并确定一些有能力的运载火箭，如猎鹰9号，对于单个卫星来说太大了。而且目前正在飞行的小型卫星火箭，如火箭实验室的电子火箭，都太小了。她说，相对论确实正处于我们的最佳位置。\n虽然相对论公司要完成研发和发射人族1号火箭还有很多工作要做-该公司的目标是在明年年底进行一次试飞-但麦克布莱德说，铱星拥有不需要立即将备用卫星送入轨道的奢侈。她还表示对该公司的团队和迄今取得的进展充满信心。\n大约十年前，相对论公司最近聘用的扎克·邓恩(Zach Dunn)帮助建立了SpaceX在范登堡的发射场。邓恩在铱的整个活动期间担任SpaceX的发射高级副总裁。他现在正在长滩带头开发一家新的火箭工厂。", "note_en": "Relativity Space says it has reached an agreement with Iridium to launch six of the company&#39;s next-generation communications satellites.\n Each of the Iridium NEXT satellites, which weigh 850kg, will be launched individually on Relativity&#39;s Terran 1 rocket. This means the new Launch Services Agreement will lead to as many as six Terran 1 missions, beginning no earlier than 2023.\n This is the fifth launch-service agreement for Relativity, said Tim Ellis, co-founder of the California-based company. &#34;This agreement represents yet another blue chip company to sign up with Relativity,&#34; Ellis said. It demonstrates that the Terran 1, with a potential lift capacity of 1.25 tons to low Earth orbit, fills a &#34;unique&#34; need in the launch market, he said.\n  Relativity Space is presently developing a launch site for its Terran 1 rocket at Cape Canaveral Air Force Station in Florida. The company has a multiyear contract to build and operate its own rocket launch facilities  at Launch Complex 16. However, it will need a second launch site to accommodate Iridium&#39;s satellites.\n That&#39;s because Iridium has a constellation of 66 satellites in a near-polar orbit, spread across six different planes at an altitude of 780km. To reach this orbit, the Terran 1 rocket would need to launch toward a pole, and so the company has reached a &#34;Right of Entry&#34; agreement to build a second launch site at Vandenberg Air Force Base in California, Ellis said. The company will do so at a site south of Space Launch Complex-6.\n  The satellite company already has nine backup satellites in orbit, said Iridium Chief Operations Officer Suzi McBride. However, Iridium has six additional spares on the ground it would like to eventually launch on demand, to specific orbital planes. The new agreement covers a period from 2023 through 2030.\n Iridium built these satellites primarily as insurance against a launch failure during the campaign to put its first 75 Iridium NEXT satellites into orbit. All of those were safely placed into orbits by seven Falcon 9 rocket launches from 2017 through 2019. &#34;Thankfully, SpaceX did a great job for us,&#34; McBride said.\n In launching the spares, Iridium assessed the market and determined that a number of capable vehicles, such as the Falcon 9, were too large for individual satellites. And the smallsat rockets currently flying, such as Rocket Lab&#39;s Electron rocket, were too small. &#34;Relativity is really right in our sweet spot,&#34; she said.\n  Although Relativity has a lot of work to do to finalize development and launch the Terran 1 rocket—the company&#39;s goal is to make a test flight late next year—McBride said Iridium has the luxury of not needing to get its backup satellites into orbit right away. She also expressed confidence in the company&#39;s team and progress made to date.\n A recent hire at Relativity, Zach Dunn, helped establish SpaceX&#39;s launch site at Vandenberg about a decade ago. And Dunn served as senior vice president of Launch for SpaceX during the entirety of the Iridium campaign. He is now spearheading development of a new rocket factory in Long Beach.", "posttime": "2020-06-25 18:52:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "火箭,计划,plans", "title": "铱计划用相对论新火箭发射六颗卫星", "title_en": "Iridium plans to launch six satellites on Relativity’s new rocket", "transed": 1, "url": "https://arstechnica.com/science/2020/06/iridium-plans-to-launch-six-satellites-on-relativitys-new-rocket/", "via": "", "real_tags": ["火箭", "计划", "plans"]}, {"category": "", "categoryclass": "", "imagename": "1c6fda2749b5daaa3479e326fbd82586.jpg", "infoid": 1008136, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周，美国国家航空航天局(NASA)正式要求美国航天业披露其短暂太空飞行计划的细节。实质上，航天局表示，它希望为其宇航员团队和科学家购买进入太空的短暂飞行的游乐设施，但需要更多信息。\n美国宇航局故意含糊其辞地征集亚轨道乘员运输服务。在与记者的讨论中，新任项目经理斯科特·科洛雷多(Scott Colloredo)表示，我们真的很想听听业界有什么要告诉我们的。他表示，此次征集是完全公开的，NASA正在寻求蓝色起源(Blue Origin)和维珍银河(Virgin Galaxy)等老牌公司的意见，而太空透视(Space Vision)等公司希望把人带到地球表面几十公里以上的地方。(编者注：美国国家航空航天局正在征集蓝色起源(Blue Origin)和维珍银河(Virgin Galaxy)等老牌公司的意见，希望把人带到地球表面几十公里以上的太空透视(Space Vision)等公司。\n然而，在接受ARS采访时，NASA局长吉姆·布里登斯廷(Jim Bridenstine)表示，该计划主要是为了增加NASA在微重力上花费的时间。他说：我们试图做的是提供对一种资源的访问，而这种资源在历史上一直非常有限。\n美国国家航空航天局(NASA)设有降落塔，实验人员可以在那里获得几秒钟的微重力。在零重力飞行期间，人类和科学研究人员以20秒为增量体验失重。这些都是安全的，而且成本更低。在光谱的另一端，通过Crew Dragon，NASA宇航员可以体验数月的微重力，每个座位的成本超过5000万美元，并面临更高的风险。\n布里登斯廷说，NASA希望找到介于两者之间的某个地方，那里可能有5到10分钟的不间断微重力。有了这段时间，宇航员可能会接受培训，科学家可能会倾向于实验，工程师可能会对飞行硬件进行鉴定。\n招标的时机正值拥有New Shepard系统的Blue Origin和拥有VSS Unity航天器的维珍银河似乎都在一年或更短的时间内开始商业运营。虽然两家公司拥有不同的系统-New Shepard提供传统的发射，而VSS Unity是一种火箭动力的太空飞机-但它们的设计都是为了提供几分钟的失重。\n美国国家航空航天局(NASA)在预算方面有一个数字，那就是它想要为这些服务买单。但布里登斯廷表示，该机构正在征求业界的反馈，以了解私营提供商预计收取的费用。对于公众，维珍银河已经以25万美元的价格出售了个人门票。Blue Origin没有设定公开价格，尽管每个座位的价格可能会高于这个数字。\n也许该计划最大的问题是NASA愿意承担将其人员送上这些航天器的风险。对于航天飞机计划，美国国家航空航天局(NASA)完全监督了航天器的开发。尽管商业乘员计划是公私合作的，但NASA仍然对SpaceX的Crew Dragon和波音(Boeing)的Starliner航天器的方方面面都有很大的洞察力，因为它支付了大部分开发成本。\n现在美国国家航空航天局(NASA)正试图真正成为一个客户，该机构将如何平衡这一风险？布里登斯廷说，他预计部分通过飞行经验来衡量安全性。这是我们作为一个机构必须解决的问题，他说。当美国国家航空航天局(NASA)乘坐这些亚轨道商用飞行器飞行时，它们已经飞行了无数次。它们不会是未经测试的车辆。美国国家航空航天局(NASA)利用飞行经验作为鉴定和认证每个子部件的替代方案，已经有很长的历史了。\n尽管如此，NASA在征集时确实要求提供有关车辆的详细安全信息。值得注意的是，它寻求有关断裂控制和容错的数据，这表明希望对这些航天系统的结构和边际有一个基本的了解。\n根据其总体记录，航天飞机失去机组人员的概率约为70%。虽然商业乘员计划才刚刚开始，但NASA要求这些飞行器的设计人员损失概率为1/270。当被问及NASA将对亚轨道飞行器设定什么标准时，布里登斯廷说，NASA还没有建立一个严格的数值。\n然而，他说，这种可能性将大大低于航天飞机和商业机组人员。我们不会让它比轨道飞行更危险，他在谈到亚轨道飞行时说。\n当涉及到New Shepard和VSS Unity时，在不大幅增加成本的情况下管理风险似乎是NASA很难平衡的行为。然而，两个私人资助的亚轨道发射系统接近成熟的事实似乎验证了NASA的做法，即试图成为众多太空飞行客户之一，而不是昂贵发射系统的单一客户。", "note_en": "This week, NASA formally asked the US space industry to dish the details on its plans for brief spaceflights. In essence, the space agency said it wants to buy rides for its astronaut corps and scientists for brief hops into space but needs more information.\n The agency was deliberately vague  in its solicitation for &#34;suborbital crew transportation services.&#34; In a discussion with reporters, the new program manager, Scott Colloredo, said, &#34;We really want to hear what industry has to tell us.&#34; He indicated that the solicitation was wide open, with NASA seeking input from established companies such as Blue Origin and Virgin Galactic, to companies such as  Space Perspective that want to take people a few dozen kilometers above the Earth&#39;s surface.\n However, in an interview with Ars, NASA Administrator Jim Bridenstine said the program seeks mostly to increase the time NASA spends in microgravity. &#34;What we’re trying to do is provide access to a resource that historically has been very limited,&#34; he said.\n NASA has drop towers where experiments can access a couple of seconds of microgravity. During a Zero-G flight, humans and scientific research experience weightlessness in 20-second increments. These are safe and have lower costs. On the other end of the spectrum, through Crew Dragon, NASA astronauts can experience months of microgravity at a cost of more than $50 million per seat and higher exposure to risks.\n  Bridenstine said NASA would like to find somewhere in between where there are perhaps 5 to 10 minutes of uninterrupted microgravity. With this amount of time, astronauts might undergo training, scientists could tend to experiments, and engineers could qualify flight hardware.\n The timing of the solicitation comes as both Blue Origin, with its New Shepard system, and Virgin Galactic, with its VSS  Unity spacecraft, appear to be within a year or less of beginning commercial operations. Although the companies have different systems—New Shepard offers a traditional launch, whereas VSS  Unity is a rocket-powered space plane—they both are designed to provide several minutes of weightlessness.\n  NASA has a number in mind, in terms of budget, that it wants to pay for these services. But Bridenstine said the agency is asking industry for feedback first to get a sense of what private providers are expecting to charge. For the public, Virgin Galactic has sold individual tickets for $250,000. Blue Origin has not set a public price, although it is likely to be higher than this per seat.\n Perhaps the biggest question about the program is the risk that NASA is willing to accept in putting its people on these space vehicles. For the space shuttle program, NASA had complete oversight of the vehicle&#39;s development. Although the commercial crew program was a public-private partnership, NASA still had significant insight into every facet of SpaceX&#39;s Crew Dragon and Boeing&#39;s Starliner spacecraft because it paid for most of the development costs.\n  Now that NASA is trying to be truly just a customer, how will the agency balance that risk? Bridenstine said he expects to measure safety partly by flight experience. &#34; It’s something that we’re going to have to work through as an agency,&#34; he said. &#34;By the time NASA flies on these suborbital commercial vehicles, they will have already flown numerous times. They will not be untested vehicles. NASA has a long history of using flight experience as an alternative to qualifying and certifying every sub-component.&#34;\n All the same, NASA does ask for detailed safety information about the vehicles in its solicitation. Notably, it seeks data on &#34;fracture control and fault tolerance,&#34; indicating a desire to have a fundamental understanding of the structure and margin of these spaceflight systems.\n Based upon its overall record, the space shuttle had a loss-of-crew probability of about 1 in 70. Although the commercial crew program is just getting started, NASA required those vehicles to be designed to a loss-of-crew probability of 1 in 270. Asked what standard NASA would hold the suborbital vehicles to, Bridenstine said NASA has not established a stringent value.\n  However, he said, the probability would be &#34;significantly&#34; less than both the shuttle and commercial crew. &#34;W e’re not going to make it more dangerous than orbital flight,&#34; he said of suborbital flight.\n Managing risks without substantially increasing costs would appear to be a difficult balancing act for NASA when it comes to New Shepard and VSS  Unity. However, the fact that two privately funded suborbital launch systems are nearing a state of maturity appears to validate NASA&#39;s approach of trying to become one of many customers in spaceflight, rather than the single customer of an expensive launch system.", "posttime": "2020-06-25 18:51:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,美国,微重力,asks", "title": "美国国家航空航天局要求工业界为其提供更多获得微重力的机会", "title_en": "NASA asks industry to provide it with greater access to microgravity", "transed": 1, "url": "https://arstechnica.com/science/2020/06/nasa-asks-industry-to-provide-it-with-greater-access-to-microgravity/", "via": "", "real_tags": ["nasa", "美国", "微重力", "asks"]}, {"category": "", "categoryclass": "", "imagename": "b35216e26261096727b6656f6d95ec25.jpg", "infoid": 1008135, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2016年，俄亥俄州哥伦布市赢得了全国交通部的挑战，并被命名为美国第一个智能城市。这场比赛不仅仅是为了炫耀自己的权利，就像市政当局的门萨一样；这个奖项来自交通部4000万美元的资金，用于测试更好的交通政策，另外还有来自保罗·G·艾伦家庭基金会(Paul G.Allen Family Foundation)的1000万美元。作为Smart Columbus让出行更安全、更可持续计划的一部分，该基金会要求该市通过电气化计划增加对电池电动车和插电式混合动力车的采用。它成功了。\n我们去年写过的电气化计划，涉及几种不同的方法，让更多的当地居民改用电动汽车。该市组建了一支由12辆BEV和PHEV组成的车队，进行骑乘自驾路演，走访社区和工作场所，让人们有机会试用电动汽车-在两年的时间里，略低于1.2万人这样做了。\n该市创建了一个体验中心，拥有第二支试驾插件车队。这从2018年开始为另外400人提供了试驾，但也从开业时招待了3万多名游客，对他们进行了关于替代动力总成和共享移动性的教育。最重要的是，Smart Columbus开展了一项在线教育活动，并与35家地区汽车经销商合作，培训员工，以便他们可以销售电动汽车。最后，它与当地公用事业公司AEP俄亥俄州合作，在该地区建设了公共2级和DC快速充电基础设施。\n2016年，在拨款发放之前，Bev和PHEV在这个七县地区的销量仅为0.4%。2017年4月电气化计划开始时，目标是到2020年3月将这一比例提高到新车销量的1.8%-即3200辆电动汽车。它奏效了；在这22个月的过程中，3323辆新的BEV和PHEV在该地区找到了家。插件销售额在2018年第四季度实际达到2.4%，在2019年第四季度达到1.6%。(2019年在全国范围内，插件销量令人失望，所以我们可以原谅同比下降。)。斯马特哥伦布估计，该计划将在十年内减少1850吨的碳排放。\n这项外展计划也增加了其他当地人也改用电动总成的可能性。从2017年10月到2020年3月，对BEV和PHEV的好感有所上升(BEV：48%到62%；PHEV：57%到65%)。2017年10月，只有三分之一的受访者表示，他们或多或少或极有可能购买Bev或PHEV；到2020年3月，这一比例已增长到略高于二分之一。\n我们很高兴看到智慧城市项目多年来取得的进步和成功，Vulcan Inc的慈善高级总监保罗·基廷说。Vulcan Inc负责监督已故保罗·艾伦的商业和慈善活动。哥伦布展示了一个地区如何通过创新发展新的运输系统，以减少世界对化石燃料的依赖。通过这样做，哥伦布创造了一个可以在全国范围内复制的模式。", "note_en": "In 2016, the city of Columbus, Ohio, won a nationwide Department of Transportation challenge and was named America&#39;s first smart city. This contest was not just for bragging rights, like some kind of Mensa for municipalities; the award came with $40 million in DOT funding for testing better transportation policies, with an additional $10 million from the Paul G. Allen Family Foundation. As part of Smart Columbus&#39; plans to make moving around more safely more sustainable, the foundation asked the city to increase adoption of battery electric cars and plug-in hybrids through an electrification program. And it succeeded.\n The electrification program,  which we wrote about last year, involved several different approaches to getting more local residents to switch to BEVs. The city assembled a fleet of 12 BEVs and PHEVs for a &#34;ride and drive&#34; roadshow, visiting communities and places of work to give people an opportunity to try out an EV—something that just under 12,000 people did over the course of two years.\n The city created an experience center with a second fleet of test-drive plug-ins. This provided another 400 people with test drives from 2018 but also entertained more than 30,000 visitors from opening, educating them about alternative powertrains as well as shared mobility. On top of that, Smart Columbus conducted an online education campaign and worked with 35 area car dealerships, training staff so they could sell EVs. And finally, it worked with the local utility, AEP Ohio, to build out public level 2 and DC fast charging infrastructure in the region.\n In 2016, before the grant was awarded, BEV and PHEV sales were just 0.4 percent in the seven-county region. When the electrification program began in April 2017, the goal was to boost this to 1.8 percent of new vehicle sales—or 3,200 EVs—by March 2020. And it worked; over the course of those 22 months, 3,323 new BEVs and PHEVs found homes in the region. Plug-in sales actually reached as high as 2.4 percent in Q4 2018 and 1.6 percent in Q4 2019. ( 2019 was a disappointing year nationally for plug-in sales, so we can forgive the year-on-year decrease.) Smart Columbus estimates that the program will cut carbon emissions by 1,850 tonnes over ten years.\n  The outreach program also helped increase the odds that other locals will switch to electric powertrains, too. Favorable perceptions of BEVs and PHEVs rose from October 2017 to March 2020 (BEVs: 48 percent to 62 percent; PHEVs: 57 percent to 65 percent). And in October 2017, only a third of those surveyed said they were somewhat or extremely likely to purchase a BEV or a PHEV; by March 2020, that had grown to just over one-in-two.\n &#34;We’re thrilled to see the progress and success of the smart city program over the years,&#34; said Paul Keating, senior director of Philanthropy at Vulcan Inc, the company that oversees the business and charitable activities of the late Paul Allen. &#34;Columbus has demonstrated how a region can develop new transport systems through innovation to reduce the world’s dependence on fossil fuels. And in doing so, Columbus has created a model that can be replicated nationwide.&#34;", "posttime": "2020-06-25 18:51:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "购买,city,地区", "title": "俄亥俄州这座城市让更多人购买电动汽车的计划奏效了", "title_en": "This Ohio city’s plan to get more people to buy electric cars worked", "transed": 1, "url": "https://arstechnica.com/cars/2020/06/this-ohio-citys-plan-to-get-more-people-to-buy-electric-cars-worked/", "via": "", "real_tags": ["购买", "city", "地区"]}, {"category": "", "categoryclass": "", "imagename": "6c71f16d677be241ddd1550a1c0535fb.jpg", "infoid": 1008134, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在完成对Sprint的收购不到三个月后，T-Mobile已经在努力摆脱加利福尼亚州监管机构施加的合并条件。\nT-Mobile昨日向加州公用事业委员会(CPUC)提交了一份请愿书，要求该机构额外提供两年时间，以满足5G扩建要求，并取消增加1000名新员工的要求。T-Mobile已经同意了联邦政府施加的其他条件，在没有等待加州批准的情况下，于4月1日完成了与Sprint的合并。T-Mobile声称该州对无线交易没有管辖权。CPUC表示，它确实有管辖权，在4月16日批准合并时施加了条件。\nT-Mobile向CPUC提交的请愿书可能是对加州提起诉讼的前奏，如果该运营商得不到它想要的东西的话。在5G方面，T-Mobile的请愿书目标是在2024年底之前要求加州的平均网速达到300 Mbps到93%。T-Mobile要求CPUC再延长两年来遵守，称应该在2026年底之前。T-Mobile声称，2024年的日期是一个错误，因为2024年这一日期是(T-Mobile)在2018年监管审批程序开始时使用的，是截至关闭后6年(当然是在2020年)期间的代理。T-Mobile表示，将截止日期改为2026年，将使这一条件与该公司的网络模型一致，该模型包括从Close开始的3年和6年的覆盖预测。\nT-Mobile还要求CPUC依靠联邦通信委员会(Federal Communications Commission)的驱动测试来确认是否符合网络扩展要求，而不是强加自己的测试要求。T-Mobile写道，CPUC自己进行驾驶测试的计划是重复的，也是没有必要的，这将不可避免地导致监管不确定性和潜在的不一致的测试结果(这将引发联邦政府对抢占问题的担忧)。\nT-Mobile对招聘条件提出了更强烈的反对，称应该修改州命令，取消T-Mobile增加全职T-Mobile员工数量的要求。T-Mobile表示，它采取了史无前例的举措，自愿承诺在交易完成三年后，加州T-Mobile的员工人数至少与Sprint、Assure Wireless和T-Mobile截至交易完成时的人数相同。请愿书称，要求T-Mobile必须在交易完成后的三年内，将其在加州的净全职工作岗位比Sprint、Assure Wireless和T-Mobile目前的全职工作岗位多增加1000个工作岗位，这份请愿书写道，T-Mobile必须在交易完成后的3年内，将其在加州的净全职工作岗位增加1000个，而不是目前的全职工作岗位。\nT-Mobile写道，委员会根本没有权力要求无线运营商在给定的时间段内雇佣特定数量的员工。立法机构从来没有授予过它这样的权力，在该决定发布之前，欧盟委员会也没有试图在任何情况下将这种授权强加给任何其他通信提供商。T-Mobile还表示，考虑到目前的新冠肺炎危机，这一条件特别繁重和不合理。\nCPUC的命令指出，根据州法律，CPUC有权施加条件，以确保合并符合公共利益。根据这项法律，CPUC可以考虑合并是否保持或改善对客户的服务质量，以及由此产生的在该州开展业务的公用事业的管理质量。法律规定，合并也应该在总体上有利于州和州政府。对受影响的公用事业员工公平合理，包括工会和非工会员工。\nT-Mobile可以裁员，但只要最终在全州净增加1000名员工，它就仍然可以遵守订单。T-Mobile已经开始解雇数百名Sprint员工。2019年4月，时任首席执行官约翰·莱杰尔(John Legere)写道，在全国范围内，与合并后的独立公司相比，到2024年，T-Mobile的员工总数将增加11000多人。T-Mobile目前表示，计划在明年招聘5000名新员工。\n华尔街日报上周报道，T-Mobile首席执行官迈克·西弗特(Mike Sievert)表示，5000名新员工将担任零售和工程等职位。华尔街日报的文章称，2019年底，T-Mobile拥有5.3万名员工，而Sprint上一次报告员工为28500人是在2019年初。", "note_en": "T-Mobile is already trying to get out of merger conditions imposed by state regulators in California less than three months after completing its acquisition of Sprint.\n T-Mobile yesterday filed a  petition with the California Public Utilities Commission (CPUC), asking the agency to provide two extra years to meet 5G build-out requirements and to eliminate a requirement to add 1,000 new employees. T-Mobile, which had agreed to  other conditions imposed by the  federal government, completed the Sprint merger on April 1  without waiting for California&#39;s approval. T-Mobile claimed the state has no jurisdiction over wireless transactions. CPUC, which says it does have jurisdiction, imposed conditions when it  approved the merger on April 16.\n T-Mobile&#39;s petition to CPUC could be a prelude to a lawsuit against California if the carrier doesn&#39;t get what it wants. On 5G, T-Mobile&#39;s petition targets a condition requiring average speeds of 300Mbps to 93 percent of California by the end of 2024. T-Mobile asked the CPUC for an extra two years to comply, saying it should have until the end of 2026. T-Mobile claims the 2024 date was a mistake &#34;because the 2024 date was a proxy—used [by T-Mobile] at the beginning of the regulatory approval process in 2018—for the period ending six years after closing (which of course occurred in 2020).&#34; Changing the deadline to 2026 would bring the condition &#34;in line with the company&#39;s network model, which includes coverage projections for three- and six-year periods from close,&#34; T-Mobile said.\n T-Mobile also asked the CPUC to rely on Federal Communications Commission drive testing to confirm compliance with network expansion requirements instead of imposing its own testing requirements. The CPUC&#39;s plan to do its own drive testing &#34;is duplicative and unnecessary, and will inevitably result in regulatory uncertainty and potentially inconsistent testing results (which would raise federal preemption concerns),&#34; T-Mobile wrote.\n  T-Mobile lodged a stronger objection to the hiring condition, saying the state order &#34;should be modified to eliminate the mandate for T-Mobile to increase the number of full-time T-Mobile employees.&#34; T-Mobile said that it &#34;took the unprecedented step of voluntarily committing that there would be at least the same number of T-Mobile employees in California three years after the transaction&#39;s closing as Sprint, Assurance Wireless, and T-Mobile had as of the date of the transaction&#39;s closing.&#34; But the CPUC instead issued a &#34;mandate that T-Mobile must increase, within three years of the transaction&#39;s closing, its net full-time jobs in California by  a thousand jobs more than the current full-time jobs of Sprint, Assurance Wireless, and T-Mobile,&#34; the petition said.\n &#34;The commission simply does not have the authority to require a wireless carrier to hire a particular number of employees in a given time period,&#34; T-Mobile wrote. &#34;The legislature has never granted it such authority and, prior to the issuance of the decision, the Commission has not attempted to impose such a mandate on any other communications provider in any context.&#34; T-Mobile also said the condition is &#34;particularly burdensome and unjustified in light of the current COVID-19 crisis.&#34;\n The CPUC&#39;s order pointed to the commission&#39;s  authority under state law to impose conditions in order to ensure that a merger is &#34;in the public interest.&#34; Under that law, the CPUC can consider whether mergers &#34;maintain or improve&#34; quality of service to customers and &#34;the quality of management of the resulting public utility doing business in the state.&#34; The law says mergers should also be &#34;beneficial on an overall basis to state and local economies,&#34; and &#34;fair and reasonable to affected public utility employees, including both union and nonunion employees.&#34;\n  T-Mobile could cut jobs and still comply with the order as long as it ends up with a net gain of 1,000 employees across the state. T-Mobile has already begun  laying off hundreds of Sprint employees. In April 2019, then-CEO John Legere  wrote that, nationwide, &#34;T-Mobile will have more than 11,000 additional employees on our payroll by 2024 compared to what the combined standalone companies would have.&#34; T-Mobile currently  says it plans to &#34;hire 5,000 new employees over the next year.&#34;\n T-Mobile CEO Mike Sievert said the 5,000 new employees will be in positions such as retail and engineering, The Wall Street Journal  wrote last week. T-Mobile ended 2019 with 53,000 employees, while &#34;Sprint last reported 28,500 employees in early 2019,&#34; the Journal article said.", "posttime": "2020-06-25 18:50:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "5g,方面,merger,mobile", "title": "T-Mobile已经试图在5G和招聘方面摆脱合并条件", "title_en": "T-Mobile already trying to get out of merger conditions on 5G and hiring", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/06/t-mobile-already-trying-to-get-out-of-merger-conditions-on-5g-and-hiring/", "via": "", "real_tags": ["5g", "方面", "merger", "mobile"]}]