[{"category": "", "categoryclass": "", "imagename": "8caf9d527038e627a45af9d507f9c114.png", "infoid": 1000066, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于我们都在采用社交距离和远程工作等实践，开发团队变得更加分散。我们自己的团队一直在面临一些挑战，这些挑战是过渡的一部分，这促使我们加倍努力，帮助开发人员在任何地方保持高效。首先，我们允许用户从其浏览器加入实时共享会话，从而简化了远程协作。今天，我很兴奋能分享更多的消息，这一次是关于Visual Studio.。\n11月，我有幸向全世界宣布了Visual Studio Online的公开预览版。在过去的几个月里，我们从我们的用户那里学到了很多东西，并找到了改进的方法。我们听到的最一致的事情之一是，创建云托管开发环境的能力正在以比我们想象的更多的方式产生积极影响。特别是，我们的用户发现：\n加入新项目(或现有项目中的新任务)所需的时间要短得多。\n他们的云开发环境在很多方面的性能都比他们的本地环境好。\n通过在Visual Studio代码、基于浏览器的编辑器或Visual Studio IDE(私下预览)之间轻松切换的能力，他们几乎可以灵活地在任何设备上工作。\n由于Live Share内置用于共同创作、编辑和调试，因此很容易与他人协作。\n我们了解到，开发人员发现Visual Studio online不仅仅是“浏览器中的编辑器”。他们说“这个云托管的开发环境的功能使它成为我想要编写所有代码的空间”。\n为了更好地与这一观点和服务的真正价值保持一致，我们将Visual Studio Online重命名为Visual Studio Codespaces。(他们说的没错，命名很难！😉)你想要在你的长期项目中有一个很棒的工作体验吗？在代码空间中进行。需要快速制作新功能的原型或执行一些短期任务(如审查Pull请求)？创建代码空间！您的代码空间就是最高效的代码空间。🎉。\n期待这些命名更改在接下来的几周和几个月内开始出现在产品中。\n我们相信Visual Studio Online Codespaces提供了市场上最佳的远程开发体验。我们希望确保尽可能多的人能够访问和使用Codespace，特别是考虑到我们目前都面临的挑战。为了实现这一点，我们将在下周降低价格。\n一如既往，我们将继续只对您使用的时间和资源收费(不会多收一秒！)。当您在CodeSpace中处于活动状态时，它会利用Azure计算资源。每个Active CodeSpace的新定价如下所示：\n这是一个我非常兴奋地能够宣布的变化。完整的定价详细信息将在定价页面和计算器上按版本提供。\n最后，我们今天还宣布了一项新功能。(这是我的“最后一件事”时刻吗？)。虽然开发人员喜欢我们的云托管代码空间的性能，但我们也了解到，有很多场景要么不需要太多的功能，要么开发人员想要运行多个较小的代码空间以便能够灵活地执行多任务。\n为了更好地支持这些场景，并帮助人们首次过渡到远程开发，我们引入了一个基本实例类型，该实例类型附带两个虚拟内核、4 GB RAM和64 GB SSD存储。我们用这种配置做了很多测试，体验和我们的标准和高级实例类型一样棒-但成本更低。目前提供基本实例类型。\n下面是上面的定价表，其中添加了基本实例类型：\n如果我不借此机会让你知道，在过去的几个月里，我们为这项服务增加了其他一些很棒的功能，那我就是玩忽职守了！我个人最喜欢的是我们对自带Dockerfile或图片的支持。使用此功能，可以根据您的确切规范定制CodeSpace，方法是指向诸如Docker Hub之类的注册表中的图像，或者在存储库中放置一个自定义的Dockerfile，Visual Studio Codespaces将运行该文件并将您连接到该存储库中。\n我们最近还发布了一个小而强大的功能，允许用户更改其环境的实例大小。这意味着您可以将大部分时间花在一个低功率、低成本的环境中，然后仅在需要时才“升级马力”-而不会丢失状态或创建新环境。最重要的是，基本实例类型也支持这一点，因此您可以玩金发姑娘游戏，找到适合您的实例类型。👩🏼🐻。\n最近我感到兴奋的最后一个补充是，我们对自托管环境功能进行了巨大的改进。使用自托管引擎", "note_en": "As we’ve all been adopting practices like social distancing and remote working, development teams have become more distributed. Our own team has been facing some of the challenges that are part of this transition, and it has motivated us to double down on our priority to  help developers stay productive from anywhere. First, we made remote collaboration easier by enabling users to  join Live Share sessions from their browser. Today, I ’m excited to share more news, this time related to Visual Studio  ...\n    In November I had the privilege to  announce the public preview of Visual Studio Online to the world. Over the last few months we’ve had a blast learning from our users and finding ways to improve. One of the most consistent things we’ve heard is that the ability to create cloud-hosted dev environments is having a positive impact in more ways than we had thought. In particular, our users are finding that:\n The time it takes to onboard to new projects (or new tasks within an existing project) is  much shorter\n The performance of their cloud dev environment in many ways feels better than their local environment\n The ability to easily switch between Visual Studio Code, the browser-based editor, or the Visual Studio IDE ( in private preview) gives them the flexibility to work from just about any device\n It’s easy to collaborate with others since  Live Share is built-in for co-authoring, editing, and debugging.\n We learned that developers are finding Visual Studio Online to be much more than just an “editor in the browser”. They are saying that “ the capabilities of this cloud-hosted dev environment make it the space where I want to write all my code“.\n To better align with that sentiment, and the true value of the service, we’re renaming Visual Studio Online to Visual Studio Codespaces. (It’s true what they say, naming is hard! 😉) Do you want a great experience working on your long-term project? Do it in a Codespace. Need to quickly prototype a new feature or perform some short-term tasks (like reviewing pull requests)? Create a Codespace! Your Codespaces are simply the most productive space to code. 🎉\n Look for these naming changes to begin appearing in the product in the coming weeks and months.\n  We believe that Visual Studio  Online Codespaces offers the best remote development experience on the market. We want to make sure as many people as possible have access to and use Codespaces, especially given the challenges we all currently face. To make that a reality, we’re lowering our prices over the course of the next week.\n As we always have, we’ll continue to charge only for the time and resources you use (and not one second more!). While you’re active in a Codespace it leverages Azure compute resources. The new pricing for each active Codespace breaks down like this:\n   This is a change that I’m very excited to be able to announce. Full pricing details will be available on  the pricing page and  calculator by Build.\n  Finally, we’re also announcing one new feature today. (Is this my “one more thing” moment!?) While developers love the performance that they are seeing in our cloud-hosted Codespaces, we’ve also learned that there’s lots of scenarios that either don’t require so much power, or where developers want to run multiple smaller Codespaces so that they can flexibly multitask.\n To better enable those scenarios, as well as to help people transitioning to remote development for the first time, we’re introducing a Basic instance type that comes with two virtual cores, four GB RAM, and 64 GB of SSD storage. We did a lot of testing with this configuration, and the experience is just as great as it is on our Standard and Premium instance types – but at a lower cost. Basic instance types are available right now.\n Here’s the above pricing table repeated with the Basic instance type added in:\n    I’d be remiss if I didn’t also take this opportunity to let you know that in the past few months we’ve added some other great features to the service! My personal favorite is  our support for bring-your-own Dockerfiles or images. With this feature, a Codespace can be tailored to your exact specifications, either by pointing at an image from a registry like Docker Hub, or by placing a custom Dockerfile in your repository, which Visual Studio Codespaces will run and connect you to.\n We also recently shipped a small but mighty feature that lets users change the instance size of their environments. This means that you can spend the majority of your time in a lower powered, lower cost environment and then “upgrade the horsepower” only if and when you need to – without losing state or having to create a new environment. To top it off, the Basic instance type also supports this, so you can play Goldilocks and find the instance type that’s just right for you. 👩🏼 🐻🐻🐻\n The last recent addition that I’m excited about is the massive improvement we’ve made to our self-hosted environment capabilities. With self-hosted environments you can register any machine to Visual Studio Codespaces and connect to it from either VS Code or our browser-based editor. Best of all, this is 100% free! My colleague Allison  announced all the details – be sure to check out her post for more info.\n  Between our lowered pricing, spiffy new name, the Basic instance type, and all the other features the team has been shipping, there’s never been a better time to try remote development with Visual Studio Codespaces.  Go give it a try and let us know what you think in the comments.", "posttime": "2020-05-02 17:47:50", "tags": "开发,代码,studio,功能", "title": "Visual Studio代码空间：云托管开发环境", "title_en": "Visual Studio Codespaces: cloud-hosted development environments", "transed": 0, "url": "https://devblogs.microsoft.com/visualstudio/introducing-visual-studio-codespaces/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["开发", "代码", "studio", "功能"]}, {"category": "", "categoryclass": "", "imagename": "84593b5861bbdaaf87833591cd9381de.jpg", "infoid": 1000065, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天你需要知道的10件事今日最好的文章今日最好的漫画一周最好的摄影新闻通讯每日商业简报每日八卦通讯育儿通讯解决COVID通讯。\n当你审视历史上最具创造力的人物的生活时，你立刻会发现一个悖论：他们的生活是围绕着他们的工作安排的，而不是围绕着他们的日子安排的。\n查尔斯·狄更斯(Charles Dkins)、亨利·庞卡莱(Henri Poincaré)和英格玛·伯格曼(Ingmar Bergman)等不同的人物，在不同的时代，在不同的领域工作，都分享了对工作的热情，对成功的极大雄心，以及近乎超人的专注能力。然而，当你仔细观察他们的日常生活时，你会发现他们每天只花几个小时做我们认为是他们最重要的工作。其余的时间，他们去爬山，打盹，和朋友一起散步，或者干脆……。\n他们是怎么做到这一点的呢？如果历史上一些最伟大的人物没有投入极长的时间，也许解开他们创造力秘密的关键不仅在于了解他们是如何劳动的，而且在于了解他们是如何休息的。\n在早上散步和早餐之后，查尔斯·达尔文早上8点就到了他的书房。稳定地工作了一个半小时。在9：30，他会阅读晨报并写信。上午10点半，达尔文回到了更严肃的工作岗位，有时会搬到他的鸟舍或温室进行实验。到了中午，他会宣布：“我一天的工作做得很好，然后就出发走了很长一段路。”当达尔文在一个小时或更长时间后回来时，他吃了午饭，并回复了更多的信件。..。\n在这个时间表上，他写了19本书，包括关于攀缘植物、藤壶和其他主题的技术卷；有争议的“人类起源”；以及“物种起源”，这可能是科学史上最著名的一本书。\n但与此同时，他的日子对我们来说似乎不是很忙。如果他现在是一名大学教授，他就会被剥夺终身教职。如果他在一家公司工作，他会在一周内被解雇。\n这并不是说达尔文粗心大意或缺乏野心。他对时间有着强烈的意识，尽管他是一位有钱的绅士，但他觉得自己没有时间可以浪费了。\n但他做了一些今天看起来越来越陌生的事情。他的生活充实而令人难忘，他的工作令人惊叹，然而他的日子里充满了休息时间。\n达尔文并不是唯一一位将毕生献身于科学与明显短暂的工作时间结合在一起的著名科学家。我们可以在其他许多职业中看到类似的模式，出于几个原因，从科学家的生活开始是值得的。科学是一项竞争激烈、全员消费的事业。科学家们的成就--他们写的文章和书的数量，他们赢得的奖项，他们的作品被引用的速度--都是有据可查的，而且…。\n一个例子是法国数学家庞卡莱(Poincaré)，他在公众中的声望和成就使他达到了与达尔文类似的水平。庞卡莱的30本书和500篇论文涵盖了数论、拓扑学、天文学和天体力学、理论和应用物理学以及哲学；他参与了标准化时区的努力，监督了法国北部的铁路发展，并是索邦大学(Sorbonne)的教授。\n庞卡莱不仅在他的科学家同行中很出名：1895年，他与小说家埃米尔·佐拉、雕塑家奥古斯特·罗丹和朱尔斯·达卢以及作曲家卡米尔·圣萨恩一起，成为法国精神病学家爱德华·图卢兹一项关于天才心理学研究的对象。图卢兹指出，庞卡莱的工作时间非常有规律。他在上午10点之间进行了最艰难的思考。中午，下午5点到7点再来一次。19世纪最高耸的..。\n我们在其他著名数学家中看到了同样的模式。G·H·哈代(G.H.Hardy)是20世纪上半叶英国领先的数学家之一，他会以悠闲的早餐和仔细阅读板球比分开始一天的工作，然后从9点到1点都会沉浸在数学中。午饭后，他又会出去散步，打网球。他告诉他的朋友和同事，一天四个小时的创造性工作几乎是一个数学家的极限……。\n20世纪50年代初对科学家职业生活进行的一项调查得出了类似的结果。伊利诺伊理工学院心理学教授雷蒙德·范·泽尔斯特(Raymond Van Zelst)和威拉德·克尔(Willard Kerr)调查了他们的同事们的工作习惯和时间表，然后将他们在办公室花费的时间与他们撰写的文章数量绘制成图表。你可能会认为结果会是一条直线，表明科学家工作的时间越长，他们的工作时间就越长。\n数据显示为M型曲线。曲线一开始急剧上升，并在每周10至20小时达到顶峰。然后曲线转向下。科学家们花了25个小时", "note_en": "10 things you need to know today   Today&#39;s best articles   Today&#39;s top cartoons   The good news newsletter   The week&#39;s best photojournalism   Daily business briefing   Daily gossip newsletter   Parenting newsletter   Solving COVID newsletter\n               When you examine the lives of history&#39;s most creative figures, you are immediately confronted with a paradox: They organized their lives around their work, but not their days.\n   Figures as different as Charles Dickens, Henri Poincaré, and Ingmar Bergman, working in disparate fields in different times, all shared a passion for their work, a terrific ambition to succeed, and an almost superhuman capacity to focus. Yet when you look closely at their daily lives, they only spent a few hours a day doing what we would recognize as their most important work. The rest of the time, they were hiking mountains, taking naps, going on walks with friends, or just  ...\n How did they manage to be so accomplished? If some of history&#39;s greatest figures didn&#39;t put in immensely long hours, maybe the key to unlocking the secret of their creativity lies in understanding not just how they labored but how they rested.\n After his morning walk and breakfast, Charles Darwin was in his study by 8 a.m. and worked a steady hour and a half. At 9:30 he would read the morning mail and write letters. At 10:30, Darwin returned to more serious work, sometimes moving to his aviary or greenhouse to conduct experiments. By noon, he would declare, &#34;I&#39;ve done a good day&#39;s work,&#34; and set out on a long walk. When he returned after an hour or more, Darwin had lunch and answered more letters.  ...\n On this schedule he wrote 19 books, including technical volumes on climbing plants, barnacles, and other subjects; the controversial  Descent of Man; and  The Origin of Species, probably the single most famous book in the history of science.\n  But at the same time, his days don&#39;t seem very busy to us. If he had been a university professor today, he would have been denied tenure. If he&#39;d been working in a company, he would have been fired within a week.\n It&#39;s not that Darwin was careless or lacked ambition. He was intensely conscious of time and, despite being a gentleman of means, felt that he had none to waste.\n But he managed something that seems increasingly alien today. His life was full and memorable, his work was prodigious, and yet his days were filled with downtime.\n  Darwin is not the only famous scientist who combined a lifelong dedication to science with apparently short working hours. We can see similar patterns in many others&#39; careers, and it&#39;s worth starting with the lives of scientists for several reasons. Science is a competitive, all-consuming enterprise. Scientists&#39; accomplishments —the number of articles and books they write, the awards they win, the rate at which their works are cited —are well-documented and  ...\n One example is Poincaré, the French mathematician whose public eminence and accomplishments placed him on a level similar to Darwin&#39;s. Poincaré&#39;s 30 books and 500 papers spanned number theory, topology, astronomy and celestial mechanics, theoretical and applied physics, and philosophy; he was involved in efforts to standardize time zones, supervised railway development in northern France, and was a professor at the Sorbonne.\n Poincaré wasn&#39;t just famous among his fellow scientists: In 1895 he was, along with the novelist Émile Zola, sculptors Auguste Rodin and Jules Dalou, and composer Camille Saint-Saëns, the subject of a study by French psychiatrist Édouard Toulouse on the psychology of genius. Toulouse noted that Poincaré kept very regular hours. He did his hardest thinking between 10 a.m. and noon, and again between 5 and 7 in the afternoon. The 19th century&#39;s most towering  ...\n We see the same pattern among other noted mathematicians. G.H. Hardy, one of Britain&#39;s leading mathematicians in the first half of the 20th century, would start his day with a leisurely breakfast and close reading of the cricket scores, then from 9 to 1 would be immersed in mathematics. After lunch he would be out again, walking and playing tennis. &#34;Four hours&#39; creative work a day is about the limit for a mathematician,&#34; he told his friend and fellow  ...\n  A survey of scientists&#39; working lives conducted in the early 1950s yielded results in a similar range. Illinois Institute of Technology psychology professors Raymond Van Zelst and Willard Kerr surveyed their colleagues about their work habits and schedules, then graphed the number of hours spent in the office against the number of articles they produced. You might expect that the result would be a straight line showing that the more hours scientists worked, the  ...\n The data revealed an M-shaped curve. The curve rose steeply at first and peaked at between 10 to 20 hours per week. The curve then turned downward. Scientists who spent 25 hours in the workplace were no more productive than those who spent five. Scientists working 35 hours a week were half as productive as their 20-hours-a-week colleagues.\n From there, the curve rose again, but more modestly. Researchers who buckled down and spent 50 hours per week in the lab were able to pull themselves out of the 35-hour valley: They became as productive as colleagues who spent five hours a week in the lab. Van Zelst and Kerr speculated that this 50-hour bump was concentrated in &#34;physical research,&#34; and that most of those 10-hour days were spent tending machines and occasionally taking measurements.\n After that, it was all downhill: The 60-plus-hour-a-week researchers were the least productive of all.\n  Karl Anders Ericsson, Ralf Krampe, and Clemens Tesch-Römer saw a similar pattern in a study of violin students at a conservatory in Berlin in the 1980s. Ericsson, Krampe, and Tesch-Römer were interested in what sets outstanding students apart from merely good ones. After interviewing music students and their teachers and having students keep track of their time, they found that several things separated the best students from the rest.\n First, the great students didn&#39;t just practice more than the average, they practiced more deliberately. During deliberate practice, Ericsson explained, you&#39;re &#34;engaging with full concentration in a special activity to improve [your] performance.&#34; You&#39;re not just doing reps, lobbing balls, or playing scales. Deliberate practice is focused, structured, and offers clear goals and feedback; it requires paying attention to what you&#39;re doing  ...\n Second, you need a reason to keep at it, day after day. Deliberate practice isn&#39;t a lot of fun, and it&#39;s not immediately profitable. It means being in the pool before sunrise, working on your swing or stride when you could be hanging out with friends, spending hours perfecting details that only a few other people will ever notice. There&#39;s little that&#39;s inherently or immediately pleasurable in deliberate practice, so you need a strong sense that  ...\n  Ericsson&#39;s study is a foundation for Malcolm Gladwell&#39;s argument (laid out most fully in his book  Outliers) that 10,000 hours of practice are necessary to become world-class in anything, and that everyone from chess legend Bobby Fischer to Microsoft founder Bill Gates to the Beatles put in their 10,000 hours before anyone heard of them. For coaches, music teachers, and ambitious parents, the number promises a golden road to the NFL or Juilliard or  ...\n But there was something else that Ericsson and his colleagues noted in their study, something that almost everyone has overlooked. &#34;Deliberate practice,&#34; they observed, &#34;is an effortful activity that can be sustained only for a limited time each day.&#34; Practice too little and you never become world-class. Practice too much, though, and you increase the odds of being struck down by injury, draining yourself mentally, or burning out.\n How do students marked for greatness make the most of limited practice time? The rhythm of their practice follows a distinctive pattern. They put in more hours per week, but they don&#39;t do it by making each practice longer. Instead, they have more frequent, shorter sessions, each lasting about 80 to 90 minutes, with half-hour breaks in between.\n Add these several practices up, and what do you get? About four hours a day. About the same amount of time Darwin spent every day doing his hardest work and Hardy and Littlewood spent doing math.\n This upper limit, Ericsson concluded, is defined &#34;not by available time, but by available [mental and physical] resources for effortful practice.&#34; The students weren&#39;t just practicing four hours and calling it a day; lectures, rehearsals, homework, and other things kept them busy the rest of the day. In interviews, the students said &#34;it was primarily their ability to sustain the concentration necessary for deliberate practice that limited  ...\n Ericsson and his colleagues observed another thing, in addition to practicing more, that separated the great students at the Berlin conservatory from the good, something that has been almost completely ignored since: how they rested.\n The top performers actually slept about an hour a day more than the average performers. They didn&#39;t sleep late. They got more sleep because they napped during the day. Of course there was lots of variability, but the best students generally followed a pattern of practicing hardest and longest in the morning, taking a nap in the afternoon, and then having a second practice in the late afternoon or evening.\n For all the attention the Berlin conservatory study has received, this part of the top students&#39; experiences — their sleep patterns, their attention to leisure, their cultivation of deliberate rest as a necessary complement of demanding, deliberate practice — goes unmentioned. In  Outliers, Gladwell focuses on the number of hours exceptional performers practice and says nothing about the fact that those students also slept an hour more, on average,  ...\n This is not to say that Gladwell misread Ericsson&#39;s study; he just glossed over that part. And he has lots of company. Everybody speed-reads through the discussion of sleep and leisure and argues about the 10,000 hours.\n This illustrates a blind spot that scientists, scholars, and almost all of us share: a tendency to fixate on focused work, to assume that the road to greater creativity is paved by life hacks, propped up by eccentric habits, or smoothed by Adderall or LSD. Those who research world-class performance look only at what students do in the gym or practice room. Everybody concentrates on the most obvious, measurable forms of work and tries to make those  ...\n This is how we&#39;ve come to believe that world-class performance comes after 10,000 hours of practice. But that&#39;s wrong. It comes after 10,000 hours of deliberate practice, 12,500 hours of deliberate rest, and 30,000 hours of sleep.\n Adapted excerpt from   Rest:  Why You Get More Done When You Work Less  by Alex Soojung-Kim Pang. Copyright © 2016. Available from Basic Books, an imprint of Perseus Books, LLC, a subsidiary of Hachette Book Group, Inc.", "posttime": "2020-05-02 17:47:46", "tags": "hours,practice", "title": "根据科学研究，每天工作4小时", "title_en": "Work 4 hours a day, according to science", "transed": 0, "url": "https://theweek.com/articles/696644/why-should-work-4-hours-day-according-science", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["hours", "practice"]}, {"category": "", "categoryclass": "", "imagename": "fbd722ae4d8cb93605ee423c7759d22a.jpg", "infoid": 1000064, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无定形的、开放的、无结构的时间，伴随着不祥的暗流，零星的无聊和短暂的平静或重新评估。这就是冠状病毒给许多人带来的--这也是布莱恩·伊诺(Brian Eno)自20世纪70年代首次普及“环境音乐”这个术语以来一直准备好的一种精神状态。漫长的白天和平淡无奇的夜晚的自我隔离提供了一个重温-或熟悉-伊诺的时间扭曲音乐的好时机。\n他确实有其他技能。在20世纪70年代的四张个人专辑中，离开Roxy Music后，Eno彻底掌握了摇滚歌曲的结构，有着狡猾的脑洞歌词和歪曲的器乐声音；所有四张专辑都是宝石，特别是1977年的《科学之前和之后》。在那之后的几十年里，他断断续续地制作了歌曲专辑。1981年，他与大卫·伯恩(David Byrne)合作了“我在幽灵丛林中的生活”(My Life In The Bush Of Ghosts)-将来自国际来源的声音样本塑造成节奏驱动的、俱乐部准备的……。\n但在很大程度上，伊诺已经将他的流行冲动引导到了制作和合作中-与U2、大卫·鲍伊(David Bowie)、Talking Heads、约翰·凯尔(John Cale)以及最近的地下世界(Underworld)的卡尔·海德(Karl Hyde)合作。然而，他自己的大部分录音，以及这里选择的所有录音，都是乐器，无论是旧的还是新的，都特别适合编排这一令人不安的历史时刻。\nEno并不是第一个设计成在避开前景的同时保持潜意识和大气存在的音乐。根据他的说法，医疗环境让他认为音乐只是更大环境中的一个元素。当他在一次车祸后被困住时，一位朋友把音乐放在他够不着的录音机上，音量太低，以至于它与房间里所有的其他声音都融为一体；作为Eno，他最终像约翰·凯奇(John Cage)一样专心地听着。..。\n然而，Eno本人继续以持续的灵活性重新创作环境音乐可能意味着的东西，改变他的方法，不断适应新的技术和环境。在他40年的独唱生涯中，他每年发行多张专辑-包括今年与他的兄弟罗杰·伊诺(Roger Eno)合作的“混色”(Mixed Colors)。很明显，有一些声音被他反复吸引：微微闪烁的回响音色，不可思议的持续和弦和音簇，回避的旋律短语……。\nEno在录音棚里即兴创作，单独或与合作者一起，使用实时录音或进行超现实的编辑。他创作了极短的环境作品-比如6秒的Windows95启动声音-以及可能没完没了的作品。他创作了似乎周期性的音乐和暗示叙事的音乐。几十年来，他创造了创造性的音乐：启动的系统，就像不规则长度的循环或计算机生成的音调的排列，并选择特定的结果……。\n以下是Eno的一些最好的环境作品-通常是长长的轨道，可能会在一个不眠之夜提供半个人听不到的消遣。(还可以在Spotify上收听完整的播放列表。)。\n伊诺和罗伯特·弗里普(“深红之王”的吉他手)在20世纪70年代初试验了循环--在模拟时代，这包括通过两个录音机传送一盘磁带，从第一个开始分层录音，然后从第二个开始回放。在“天堂音乐公司1”(The Heaven Ly Music Corporation 1)中，循环装置了一架脉动的无人机，上面是弗里普(Fripp)的铅吉他独奏，用爪子和连枷弹，然后编成辫子回到无人机上：攻击性被耐心地重新构筑起来。(注：虽然流媒体服务.。\nEno的第一首独奏环境突破的主题曲循环起伏了半个多小时，无休止地反复出现，不知何故乐观的双音符和四音符的主题漂浮在辅音的羊水浴缸中。芦苇般的电子音调让人联想到音乐家演奏的木管，他们从不需要停下来呼吸。\nEno通过“Ambient 1/Music for Airports”正式宣称了“环境”一词，这是一张由四首曲目组成的LP，显示了它们的循环是如何在专辑封面上相交的图表。它的开场曲目，功能性的标题是“1/1”，归功于伊诺、罗伯特·怀亚特(弹钢琴)和瑞德·戴维斯，本可以在前20秒内完成：一个由主音和弦回答的钢琴乐句，所有这些都被整齐地解决了。但在停顿之后，这个短语会反复出现并延伸，并加入其他主题和安慰……。\n在“环境2：镜子的高原”(Ambient 2：The Plateaux of Mirror)中，哈罗德·巴德(Harold Budd)在伊诺用电子设备处理过的钢琴上即兴创作：改变音调，产生特定的共鸣，触发合成器。在“寒冷的空气”中，处理是模糊的残影和期待，当巴德扮演有节制的对位时，微妙地展示出自己，大多一次只有两个音符，踮着脚尖有目的地走着。\n在他1982年的专辑“Ambient 4：On Land”中，Eno通过融入自然声音，将音乐放在录音棚外，唤起了风景的回忆。“迷失的一天”暗示着阵风和远处钟声浮标的叮当声", "note_en": "Amorphous, open-ended, unstructured time, with undercurrents of foreboding, pockets of boredom and fleeting interludes of peace or reassessment. That’s what Covid-19 has brought to many people — and it’s a mental state that Brian Eno’s vast recorded catalog has been prepared for since he first popularized the term “ambient music” in the 1970s. The long days and featureless nights of self-quarantine offer an opportune moment to revisit — or get acquainted with — Eno’s time-warping music.\n He does have other skills. On four solo albums from the 1970s, after he left Roxy Music, Eno thoroughly mastered rock-song structure, with slyly cerebral lyrics and skewed instrumental sounds; all four albums are gems, particularly “Before and After Science” from 1977. He has intermittently made song albums in the decades since. And his 1981 collaboration with David Byrne on “My Life in the Bush of Ghosts” — shaping found-sound sampled vocals from international sources into  rhythm-driven, club-ready  ...\n But for the most part, Eno has channeled his pop impulses into production and collaborations — with U2, David Bowie, Talking Heads, John Cale and lately Karl Hyde of Underworld. Yet the bulk of his own recordings, and all of those selected here, are instrumentals that, old or new, are particularly suited to orchestrate this uneasy historical moment.\n Eno was not the first to make music designed to maintain a subliminal, atmospheric presence while evading the foreground. By his account, medical circumstance led him to thinking about music as just one element in a larger environment. When he was immobilized after an automobile accident, a friend left music playing on a record player he couldn ’t reach, at such low volume that it melded with all the other sounds in the room; Eno being Eno, he ended up listening with John Cage-like attentiveness.  ...\n Yet Eno himself has continued to rework what ambient music might mean with continual flexibility, shifting his approaches and adapting constantly to new technology and circumstances. He has released multiple albums per year throughout a four-decade solo career —including, this year, “Mixing Colours, ”a collaboration with his brother Roger Eno. There are clearly sounds he is drawn to repeatedly: glimmering reverberant timbres, uncannily sustained chords and clusters, melodic phrases that shy away  ...\n Eno has improvised in the studio, alone or with collaborators, using real time recordings or making surreal edits. He has composed extremely short ambient works — like the six-second  Windows 95 start-up sound—and potentially endless ones. He has made music that seems cyclical and music that hints at narrative. For decades, he has created generative music: systems that are set in motion, like loops of irregular length or permutations of computer-generated tones, and chosen particular results  ...\n Here are some of Eno’s best ambient works — long tracks, often, that might provide half-heard diversion through a sleepless night. ( Listen to the full playlist on Spotify, too.)\n   Eno and Robert Fripp (King Crimson ’s guitarist) experimented in the early 1970s with looping —which, back in the analog era, involved routing a tape through two tape recorders, to layer the recording from the first one with the playback from the second. The loop sets up a pulsating drone in “The Heavenly Music Corporation 1, ”topped by lead-guitar solos from Fripp that claw and flail, then braid themselves back into the drone: aggression patiently reframed. (Note: Although streaming services  ...\n   The title track of Eno’s first solo ambient breakthrough loops and undulates for just over half an hour, with endlessly recurring, somehow optimistic two-note and four-note motifs that float in an amniotic bath of consonances. The reedy electronic tones suggest woodwinds played by musicians who never have to pause for breath.\n    Eno officially claimed the term “ambient ”with “Ambient 1/Music for Airports, ”an LP of four tracks that showed diagrams of how their loops intersected on the album cover. Its opening track, functionally titled “1/1 ”and credited to Eno, Robert Wyatt (who played the piano) and Rhett Davies, could have been complete in its first 20 seconds: a piano phrase answered by its tonic chord, all neatly resolved. But after a pause, the phrase recurs and extends, joined by other motifs and consoling  ...\n   For “Ambient 2: The Plateaux of Mirror,” Harold Budd improvised on pianos that Eno had treated with electronics: altering their tone, bringing out certain resonances, triggering synthesizers. In “The Chill Air,” the treatments are faint afterimages and anticipations, subtly revealing themselves as Budd plays measured counterpoint, mostly just two notes at a time, tiptoeing with a purpose.\n   On his 1982 album, “Ambient 4: On Land,” Eno evoked landscapes by incorporating natural sounds, placing the music outside the studio. “The Lost Day” hints at gusty winds and the clanging of distant bell buoys, guidance through a treacherous harbor; dramatic cello-like lines arise and drift away, as if swallowed up by a haze.\n   Much of “Apollo: Atmospheres and Soundtracks” is as sparse as an airless lunar vista. “An Ending (Ascent)” is lush by comparison: slow, breathy-toned, slightly blurred major-key chords that suggest a miniaturized processional, a ritual happening in reduced gravity.\n   Inescapable foreboding and disquiet run all the way through “The Shutov Assembly, ”from 1992, which may well be Eno ’s bleakest, most dissonant album. “Lanzarote ”draws suspense from what might seem, in prospect, to radiate stability. For much of its length, a single note arrives in assorted keyboard tones in different octaves, low and high, from tolling bass to solitary piano to distant cricket-like overtones to hints of organ and orchestra. But other sustained notes waft in to dispute  ...\n   The 57-minute “Neroli” is an exercise in austerity: a fixed bass note tolling irregularly behind a lugubrious keyboard line that stops and starts, wandering fitfully within a small, circumscribed range and in a vaguely Asian-sounding mode. Deep in the background, other sustained tones loom. Eno subtitled it “Music for Thinking IV,” suggesting that it wouldn’t be distracting; it’s monolithically reticent.\n   Eno wrote music for a film about the filmmaker Derek Jarman and decided the tracks weren ’t strong enough on their own for a soundtrack album. So he sent them to Jah Wobble, the bassist from Public Image Ltd., who reworked them by himself in a hands-off collaboration. “Transmitter and Trumpet ”sprouts a brisk six-beat bass line that appears and disappears and beams in a world of influences: orchestras, electronics, Morocco, India, West Africa. And then it obscures them in echoes, static  ...\n   Eno made “Small Craft on a Milk Sea” with Jon Hopkins, a dance-music D.J.-producer, and Leo Abrahams, who plays guitar and other instruments; the album mixed song-length, melodic tracks with far more abstract ones like “Calcium Needles.” The track courts vertigo, following descending bell tones into a bottomless, reverberating abyss.\n   The album “Finding Shore ”is a collaboration with the keyboardist Tom Rogerson, from the band Three Trapped Tigers. Rogerson improvised on piano; Eno manipulated the sounds as Rogerson played and responded. The piano sounds more or less natural through much of the album, but on “Marsh Chorus, ”Eno transforms its tone into a hybrid of harpsichord and carillon and turns some notes into insistently pinging loops. Rogerson plays decisive, declamatory phrases and lets things shimmer in  ...\n   Near-stillness prevails through most of the hourlong “Reflection, ”along with stereo-ricocheting tones that live up to the piece ’s title. It ’s a generative piece, with one form including an iOS app, so the streaming and CD versions of “Reflections ”are only a few of its countless shapes. Its materials are bell tones, endlessly sustained string-like and clarinet-like notes, a shivery undercurrent and elusive, flitting pockets of echo. Although it is generated via software with  ...\n   Eno ’s six-CD collection of “Music for Installations ”gathered music he has written for site-specific works since the 1980s; it includes “Surbahar Sleeping Music ”among its “music for future installations. ”A surbahar is larger, lower-pitched relative of the sitar, and this 18-minute drone piece, with no fixed beat or pulse, sounds like it ’s constructed from notes plucked on the surbahar, on their own and electronically manipulated, richly radiating upward from deep, plangent  ...\n   It was probably inevitable that Eno would eventually collaborate with Kevin Shields of My Bloody Valentine, a fellow wielder of edgeless, untraceable, overwhelming sounds. “Only Once Away My Son ”is the instrumental half of a 2018 single —its lyrics appear in the other track, “The Weight of History ”—and it ’s a speaker-challenging tempest of drone and distortion, lingering to reveal sustained turbulence at every level, overloading even more and then somehow solidifying into a  ...\n   Eno’s latest collaboration with a keyboardist is “Mixing Colours,” an album made with his younger brother, Roger, whose own music tends to be prettier and more straightforwardly melodic than Brian Eno’s work. “Burnt Umber” is a melancholy waltz, a melody unfolding in slightly cracked bell tones over a somber four-note bass vamp, calmly disconsolate.", "posttime": "2020-05-02 17:47:42", "tags": "环境,ambient,音乐,eno", "title": "布莱恩·伊诺的15个基本环境作品", "title_en": "Brian Eno’s 15 Essential Ambient Works", "transed": 0, "url": "https://www.nytimes.com/2020/04/29/arts/music/brian-eno-ambient-songs.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["环境", "ambient", "音乐", "eno"]}, {"category": "", "categoryclass": "", "imagename": "9a404f9cf28e73ae3267ad4f8debf43a.jpg", "infoid": 1000062, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据一项新的研究，一种通常由暴露在阳光下的皮肤细胞产生的维生素可能在防止冠状病毒SARS-CoV-2死亡方面发挥作用。\n伊丽莎白女王医院基金会(Queen Elizabeth Hospital Foundation Trust)和东英吉利大学(University Of East Anglia)的科学家进行了一项尚未经过同行审查的研究，其初步结果表明，低水平的激素维生素D与整个欧洲的冠状病毒死亡率有关。\n作为冠状病毒谜团中潜在的一块，这项研究当然值得关注，它提醒我们，健康和疾病可能是一件复杂的事情，涉及到各种生活方式因素。\n但是，将这样的证据解释为更大的科学对话的一部分也很重要，这意味着现在提出任何建议还为时过早，而且在进一步的证据到来之前，肯定还为时过早。\n研究人员挖掘了现有的健康文献，对20个欧洲国家的公民的维生素D平均水平进行了分类，然后将这些数字与每个国家的冠状病毒死亡的相对数字进行了比较。\n一个简单的统计检验表明，这些数字之间存在相当令人信服的相关性，其中维生素浓度低于平均水平的人群也有更多的人死于SARS-CoV-2。\n研究人员在他们的初步报告中总结道，冠状病毒最脆弱的人群也是维生素D最缺乏的人群。\n像这样的横断面报告并不是没有问题，除了暗示可能存在某种关系外，几乎没有什么作用。例如，倾向于体内维生素D水平较高的人可能正在做其他有助于限制病毒造成的破坏的事情。\n但这一结果也并不令人意外，与之前更有力的研究结果一致，这些研究还表明，健康的维生素D水平可以降低患流感、结核病等呼吸道感染以及儿童哮喘的风险。\n维生素D是一种脂溶性化合物，我们可以从蘑菇或鱼等食物中获取营养物质，也可以在皮肤中产生某种形式的胆固醇对紫外线的反应。\n众所周知，这种维生素在维持骨骼钙水平方面的作用是众所周知的，缺乏这种维生素会导致骨骼畸形，如佝偻病，以及在骨质疏松症等疾病背后增加骨骼退化的风险。\n研究人员正在逐步拼凑维生素在免疫系统中的功能，注意到它与自身免疫状况的关系，以及各种免疫细胞上发现的这种化学物质的受体。\n它如何对抗冠状病毒感染--如果有的话--肯定会是未来研究中的热门话题。\n同时，尽管结果可能没有争议，但同行评审之前的一项研究不应该成为医疗建议的基础。科学只是不支持在阅读血液中健康含量的维生素D和服用补充剂之间做出飞跃。\n2017年，新西兰奥克兰大学(University Of Auckland)的医学研究人员马克·J·博兰(Mark J Bolland)和英国阿伯丁大学(University Of Aberdeen)的艾莉森·埃文内尔(Alison Avenell)认为，在我们如何解释与这项研究类似的研究时，有必要谨慎行事。\n维生素D补充剂是一个热门话题，引发了支持和反对广泛补充剂的激烈争论，他们在一篇社论中写道，在过去十年里，关于这一主题的各种研究成果层出不穷。\n结果可能看起来是积极的，但没有办法把杂乱无章的统计数据变成可以针对个人需求量身定做的精确建议。即使是世界卫生组织也在试探性地使用过去的研究作为具体建议的基础。\n博兰德和艾文内尔写道：我们认为它们只应被视为假说生成，需要在精心设计、动力充足的随机对照试验中得到证实。\n一项研究推测，一种常见的维生素可能会造成生死之间的差异，这似乎就像波涛汹涌的水域中的潜在救生筏，但我们需要更多的研究来告诉我们，这些模式是如何存在的，以及为什么会存在，以平衡维生素补充剂带来的风险。\n在一场每周有可能夺走世界各地数千人生命的大流行中，科学感到极其缓慢。但这总是值得等待的。", "note_en": "A vitamin commonly produced by sun-exposed skin cells might play a role in preventing death by the coronavirus SARS-CoV-2, according to new research.\n Preliminary results from a yet-to-be-peer-reviewed study carried out by scientists from the Queen Elizabeth Hospital Foundation Trust and the University of East Anglia have linked low levels of the hormone vitamin D with COVID-19 mortality rates across Europe.\n   It&#39;s a study that certainly deserves some attention as a potential piece of the coronavirus puzzle, reminding us that health and disease can be a complex affair involving a variety of lifestyle factors.\n But it&#39;s also important to interpret evidence like this as part of a bigger scientific conversation, meaning it would be premature to make any recommendations and  certainly way too premature to hit the supplement aisle before further evidence arrives.\n The researchers dug through existing health literature to catalogue the average levels of vitamin D among the citizens of 20 European countries, and then compared the figures with the relative numbers of COVID-19 deaths in each country.\n A simple statistical test showed there was a pretty convincing correlation between the figures, where populations with lower than average concentrations of the vitamin also featured more deaths from SARS-CoV-2.\n &#34;The most vulnerable group of population for COVID-19 is also the one that has the most deficit in vitamin D,&#34; the researchers conclude in their  preliminary report.\n Cross-sectional reports like these aren&#39;t without their problems, doing little more than suggesting some kind of relationship might exist. People who tend to have higher vitamin D levels in their body might be doing something else that helps limit destruction caused by the virus, for example.\n   But the results aren&#39;t surprising either, falling in line with  previous, more  robust studies that also suggest healthy vitamin D levels can reduce the risk of respiratory infections such as influenza and  tuberculosis, as well as childhood asthma.\n Vitamin D is a fat-soluble compound we can either get as a nutrient from foods like mushrooms or fish, or produced in our skin when a form of cholesterol reacts to UV light.\n Commonly known for its role in maintaining calcium levels in our bones, deficiency in this vitamin is responsible for skeletal deformities  such as rickets as well as an increased risk of bone degeneration behind conditions such as  osteoporosis.\n Researchers are gradually piecing together the vitamin&#39;s functions in the immune system as well, noting its relationship with  autoimmune conditions and the discovery of receptors for the chemical on  various immune cells.\n Just how it might combat coronavirus infections – if at all – is sure to be a popular subject in future studies.\n Meanwhile, as uncontroversial as the results might be, a single study ahead of peer review shouldn&#39;t be the basis for medical advice. Science just doesn&#39;t support making the leap between reading about healthy amounts of vitamin D in the blood and popping a supplement.\n   In 2017, medical researchers Mark J Bolland from the University of Auckland in New Zealand and Alison Avenell from the University of Aberdeen in the UK  argued the need for caution over how we interpret studies not unlike this one.\n &#34;Vitamin D supplementation is a hot topic, provoking passionate arguments for and against widespread supplementation,&#34; they  write in an editorial on the diverse array of  studies on the subject in the past decade.\n Results might look positive, but there&#39;s just no way to turn a jumble of statistics into precise recommendations that can be tailored for individual needs. Even the  World Health Organisation is tentative about using past research as the basis of specific recommendations.\n &#34;We think that they should be viewed as hypothesis generating only, requiring confirmation in well-designed, adequately powered randomised controlled trials,&#34;  Bolland and Avenell write.\n Research that speculates a single, commonly available vitamin might make the difference between life and death can seem like a potential life raft in choppy waters, but we need more research to tell us just how and why these patterns exist for us to balance the  risks that come with vitamin supplements.\n In the midst of a pandemic that has the potential to claim thousands of lives around the world every week, science feels painstakingly slow. But it&#39;s always worth the wait.", "posttime": "2020-05-02 17:47:32", "tags": "维生素,病毒,冠状病毒,死亡,linked", "title": "冠状病毒死亡与维生素D缺乏有关。这就是它的意思", "title_en": "Covid-19 Deaths Are Being Linked to Vitamin D Deficiency. Here's What That Means", "transed": 0, "url": "https://www.sciencealert.com/covid-deaths-are-being-linked-with-vitamin-d-deficiency-here-s-what-that-means", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["维生素", "病毒", "冠状病毒", "死亡", "linked"]}, {"category": "", "categoryclass": "", "imagename": "7579a3a0e1c322b4a3af1768d7d6445e.png", "infoid": 1000061, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "某些专利拥有者就是无法获得足够的专利所赋予的垄断权。这就是为什么他们一直试图让专利更容易获得和起诉，尽管最高法院的裁决指向相反的方向。\n他们最新的努力，名字有误导性的“发明者权利法案”，也被称为H.R.5478，劫持了我们中的许多人与“发明家”的积极联系，从根本上使专利系统向专利所有者倾斜，包括专利流氓。\n专利流氓通过威胁人们的日常活动来赚钱，而不是通过发明、建造或出售任何有价值的东西。在EFF，我们多年来一直在追踪和打击他们。在过去的二十年里，专利局允许数万项措辞含糊的软件专利激增。专利流氓可以使用这些专利长达20年来起诉那些将软件用于日常活动的普通人-比如制作图片菜单，举办在线竞赛，……。\n更多专利权的倡导者坚持-尽管近20年的诉讼记录、研究和其他公布的证据-专利巨魔是一个夸大的问题。今天早些时候，我们已经就这个问题发表了一篇深度文章，讨论了当我们谈论专利巨魔和滥用专利制度时，我们在EFF指的是什么。\nH.R.5478将赋予一批精选的专利所有者巨大的新诉讼权力，其中将包括许多专利流氓。该法案将把他们重新归类为“发明者”，然后授予他们新的权力。特别是，该法案将对最高法院多年来实施的极端和敲诈勒索的专利诉讼进行检查。\n发明者权利法案将撤销维持专利体系平衡的三个主要法律领域。该法案口惠而实不至地支持“发明家”，但它提出的改变是严重有害的--无论这些改变是否仅限于某些类型的实体。实际上，这些赠品将流向数十家，甚至可能是数百家容易提起诉讼的有限责任公司，而不是勤奋的个人。\n首先，H.R.5478将回到对专利案件近乎自动的禁令制度。这将使专利所有者有权关闭其他公司的运营(或威胁这样做)，而不考虑可能给公众带来的伤害。这一变化将从根本上取消2006年具有里程碑意义的专利案件，eBay诉MercExchange案。最高法院就是这样说的，专利所有人必须证明禁制令对于避免无法弥补的伤害是必要的，然后他们才能获得。\n其次，H.R.5478将取消基于TC心脏地带最高法院裁决的关键场馆改革。在TC哈特兰之前，专利流氓可以在任何他们想起诉的地方起诉任何人-他们经常选择德克萨斯州东区。在TC哈特兰之后，专利所有者只能在被告成立公司或犯下所谓的侵权行为并有固定和既定的营业地点的地方起诉被告。这项法案的支持者想要回到最坏的情况.。\n第三，H.R.5478停止了一个称为各方间审查(IPR)的关键专利审查过程。知识产权程序是由国会于2012年创建的，已经成功地让专利局推翻了1500多项错误授予的专利。我们知道知识产权程序有多重要：EFF利用它来挑战Personal Audio LLC拥有的所谓“播客”专利，该专利被用来骚扰和威胁播客公司。如果5478号法案是当时的法律，伊芙.。\n这意味着，如果Personal Audio能够利用“发明者权利法案”授予的法律漏洞，它可能仍然在利用其专利威胁播客公司支付法律和解费用。\n现代专利欺诈的滥用已经持续了20多年。在这段时间里，相当一部分人的职业生涯都是从专利诉讼和诉讼威胁中赚钱的。当他们去游说国会寻求额外特权以延长他们滥用法律制度的时间时，披上“发明者权利”的外衣是很方便的。“但别搞错了--这项法案将赋予一些最糟糕的专利流氓超能力。这些巨魔制造的诉讼。", "note_en": "Certain patent owners just can’t get enough of the monopoly power patents bestow. That’s why they keep trying to make it easier to get and sue over patents, despite Supreme Court rulings that point in the opposite direction.\n Their latest effort, the misleadingly-named “Inventors Rights Act,” also known as  H.R. 5478, hijacks the positive associations many of us have with “inventors” to radically tilt the patent system in favor of patent owners, including patent trolls.\n Patent trolls make money by threatening people over everyday activities, not by inventing, building, or selling anything of value. At EFF, we’ve been tracking and fighting them  for  years. Over the past two decades, the Patent Office has allowed tens of thousands of vaguely-worded software patents to proliferate. Patent trolls can use those patents for up to twenty years to sue regular people who use software for everyday activities —like making a picture menu, running an online contest,  ...\n Advocates for more patent powers insist—despite nearly two decades of litigation records, studies, and other published evidence—that patent trolls are an overblown problem. We published a deep dive on this issue earlier today, discussing  what we mean at EFF when we talk about patent trolls and abuses of the patent system.\n H.R. 5478 will give enormous new litigation powers to a select group of patent owners, which will include many patent trolls. The bill will re-classify them as “inventors” and then grant them new powers. In particular, the bill will throw out the checks against extreme and extortionate patent litigation that have been put in place over the years by the Supreme Court.\n  The Inventors Rights Act would roll back three major areas of law that keep the patent system balanced. The bill pays lip service to “inventors,” but the changes it proposes are seriously harmful—whether they’re limited to certain types of entities or not. Practically speaking, these giveaways will go to dozens, or possibly even hundreds, of litigation-prone limited liability companies, not hardworking individuals.\n First, H.R. 5478 would go back to a system of near-automatic injunctions for patent cases. That would give patent owners the power to shut down other companies ’operations (or threaten to do so) regardless of the harm that might cause the public. This change would essentially undo the 2006 landmark patent case, eBay v. MercExchange. That ’s the case where the Supreme Court said that patent owners have to prove an injunction is necessary to avoid irreparable harm before they can get  ...\n Second, H.R. 5478 would undo  critical venue reform based on a Supreme Court decision in  TC Heartland. Before  TC Heartland, patent trolls could sue anybody just about anywhere they wanted—and  they often chose the Eastern District of Texas. After TC Heartland, patent owners can only sue defendants where they are incorporated or where they have committed supposedly infringing acts and have a regular and established place of business. This bill ’s proponents want to go back to the worst  ...\n Third, H.R. 5478 puts a stop to a critical patent review process called inter partes review, or IPR. The IPR process was created by Congress in 2012 and has been successful in getting the patent office to overturn more than 1,500 wrongly granted patents. We know how important the IPR process is:  EFF used it to challenge the so-called “podcasting” patentowned by Personal Audio LLC, which was using to harass and threaten podcasters. If H.R. 5478 had been the law at that time, EFF  ...\n That means if Personal Audio had access to the legal loopholes granted by the “Inventors Rights Act,” it could still be using its patent to threaten podcasters into paying legal settlements.\n The abuses of modern patent trolling have gone on for more than 20 years now. In that time, a significant group of people have spent their careers making money off patent lawsuits and litigation threats. When they go to lobby Congress seeking extra privileges to extend their abuses of the legal system, it ’s convenient to wear the mantle of “inventors ’rights. ”But make no mistake —this bill will give super-powers to some of the worst patent trolls. The lawsuits these trolls produce  ...", "posttime": "2020-05-02 17:47:28", "tags": "发明人,rights,专利,patent", "title": "“发明人权益法”是对真实发明的攻击", "title_en": "“Inventor Rights Act” Is an Attack on True Invention", "transed": 0, "url": "https://www.eff.org/deeplinks/2020/04/inventor-rights-act-attack-true-invention", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["发明人", "rights", "专利", "patent"]}, {"category": "", "categoryclass": "", "imagename": "13151704a8c02f1072549f43ff279e31.jpg", "infoid": 1000060, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Linus Torvalds在15年前，也就是2005年4月7日首次发布了他的Git版本控制软件，目的是在Linux内核开发中培养更具创造性的精神。从那时起，Git在软件开发中的角色已经远远超出了其作为版本控制系统和软件存储库的根基。它已经成为当今世界各地的分布式团队和开源开发人员如何开发软件的基石。\n在这个新的堆栈制造者播客中，我们采访了三位Git思想领袖，谈到了Git的根源、现状和未来。我们了解到，尽管Git目前取得了成功，但它的未来并不确定。\n对于许多人来说，Git提供的可能性是令人兴奋的，无论是在个人层面还是宏观层面上，当许多各方必须在一个项目上进行协作时，特别是对于CI/CD而言。您可以使用Git上传个人喜爱的项目，比如您是否想要共享一个简单的代码示例，或者只是想要共享与软件无关的文档。对于大型企业，开发团队可以同时协作进行应用程序开发，无论他们是分散在世界各地还是……。\n然而，我们很容易忘记为什么Git和版本控制会如此普遍地被采用。追溯到15年前，Davis描述了Git超越了源代码控制系统的锁定和信任概念的发展。\n“安全固然重要，但我们认为实现安全的方法是通过严格的控制。现在我们有点敞开心扉说，‘嗯，实际上，这两件事是不是？是吗？它们是相互排斥的吗？我真的可以在放松控制的情况下仍然安全吗？“戴维斯说。“我想我们已经证明了答案是‘是的。但我们不可能用旧的源代码控制系统做到这一点，因为那里没有像…这样的原语。拥有完整的..。\n分支功能也是Git大规模采用的一个关键功能。华纳解释了分支的重要性，将其与谷歌文档现在的工作方式联系起来。您可以查看哪些用户以前在不同版本中对文档进行了更改。在不知道以前版本的历史的情况下对文档进行更改的前景令人恐惧。“分支机构和Git对我们15年前的地位真的、真的很重要，廉价、容易的分支机构给我们带来了革命性的变化……。\n然而，Git提供的所有伟大功能及其在开发社区中的流行并不一定意味着它必须锁定以满足未来的所有计算和IT需求。无状态数据管理就是一个很好的例子。\n“版本控制数据仍然是非常非常困难的事情之一。我认为现在随着ML和AI的出现，它变得越来越重要。“Sijbrand dij说。“我们用来训练它的数据是什么？什么是输入和输出数据，什么是输出数据和运行在上面的模型版本？“他说。“我看到了很多工具，但我认为在文件级也有一些基本的东西需要更改…。我们需要更好的数据版本控制.。\n事实上，华纳说，Git上下文中的文件系统必须改变，特别是它的抽象，“以及我们如何看待它”。这不仅仅是数据本身的版本化问题，而是如何应用数据，特别是大规模应用将成为一个真正的问题，“华纳说。“所以，如果这些概念能够被应用，我认为会很有趣。我希望有人能推进这一点，因为这仍然是该行业的一个痛点。“", "note_en": "Linus Torvalds first released his Git version control software 15 years ago, on April 7, 2005, in an effort to foster a more creative spirit in Linux kernel development. Since then, Git’s role in software development has emerged well beyond its roots as a version control system and a software repository. It’s become a cornerstone of how software is developed today by distributed teams and open source developers around the world.\n In this  The New Stack Makers podcast, we spoke with three Git thought leaders about Git’s roots, its present context and its future. We learned that despite its present-day success, Git’s future is not certain.\n   For many, the possibilities that Git offers are exciting, both on an individual and macro level when many parties must collaborate on a project, particularly for CI/CD. You can use Git to upload personal pet projects, such as whether you want to share a simple code sample or just documentation for something not necessarily related to software. For a large enterprise, developer teams can collaborate on application development concurrently whether they are scattered around the world or  ...\n  However, it is easy to forget why Git and version control have become so universally adopted. Tracing back at its beginning 15 years ago, Davis described Git’s evolution beyond concepts of locking and trust for source code control systems.\n “Safety is important, but we thought the way that we could achieve safety was through rigorous control. And now we ’ve kind of opened our minds and said, ‘Well, actually, are those two things? Do we? Are they mutually exclusive? Can I actually loosen the controls and still be safe?&#39; ”Davis said. “I think we ’ve proven that the answer is ‘yes. ’But we couldn ’t have done that with the old source code control systems because the primitives weren ’t there, things like …having the full  ...\n Branching is also a key function that helps explain Git ’s massive adoption. Warner explained the significance of branching by relating it to how Google docs work now. You can see which users have made changes to the document previously in different versions. The prospect of making changes to a document without knowing the history of previous versions is scary. “Branching and Git is really, really important to where we were 15 years ago, and cheap, easy branches revolutionized the  ...\n However, all of the great things Git offers and its prevalence in the development community does not necessarily mean it is necessarily locked in to meet all computing and IT needs of the future. Stateless data management is a good example.\n “Version controlling data is one of those things that is still very, very hard. And I think now with the advent of ML and AI, it ’s getting more and more important, ”Sijbrandij said. “What is the data we use to train it? What is the input and output data and what is the output data and version of the model that ran on it? ”he said. “I see a lot of tooling, but I think there ’s also something fundamental on the file level that needs to change …We need better version control for data  ...\n Indeed, Warner said the file system in a Git context must change, particularly its abstraction, “and how we think of it. It’s not just the versioning of the data itself, but it’s how it’s applied and particularly at scale at large sizes is going to become a real issue,” Warner said. “So, the concepts, if they can be applied, I think are going to be interesting. And I hope somebody does advance it because that is still kind of a pain point for the industry.”", "posttime": "2020-05-02 17:47:23", "tags": "现在,git", "title": "吉特15岁了：现在怎么办？", "title_en": "Git Is 15 Years Old: What Now?", "transed": 0, "url": "https://thenewstack.io/git-is-15-years-old-what-now/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["现在", "git"]}, {"category": "", "categoryclass": "", "imagename": "2c0c97e8cfae933d036ad2dd6ee81c78.jpg", "infoid": 1000059, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数以百万计的人把他们的电子邮件地址给了Quibi，JetBlue，Wish和其他公司-这些电子邮件地址被泄露了。\n周三发布的一份报告显示，这些邮件最终落入谷歌(Google)、Facebook和Twitter等广告和分析公司手中，使得这些人的电子邮件地址更容易成为广告商的目标，而且能够被研究购物行为的公司追踪。\n经营数字战略公司胜利媒体的研究员扎克·爱德华兹(Zach Edwards)表示，这些客户在注册应用程序或点击营销电子邮件中的链接时，无意中暴露了自己的电子邮件地址。在报告中，他将个人数据的泄露描述为“草率和危险的增长黑客”的一部分。\n爱德华兹在一次采访中说，通过让客户的个人数据被第三方被动收集来让他们容易受到跟踪的做法并不新鲜，但尽管努力改善在线隐私保护，这种做法还是获得了吸引力。\n他说：“这种黑客攻击曾经是只有非常小众和老练的开发者才能理解的东西。”“但现在整个广告技术行业都明白了这一点。”\n普林斯顿大学(Princeton University)研究数据挖掘的计算机科学教授阿尔温德·纳拉亚南(Arvind Narayanan)表示，隐私专家十多年来一直对个人信息泄露表示担忧。他说，粗心的网络编程做法导致了一些不小心泄露大量个人信息，但也有一些是故意泄露的。\n纳拉亚南说，“有一个广告定向行业，它试图将人们的线上和线下活动联系起来。”“人们可能不希望他们所有的兴趣、活动和购买都捆绑在一个连接每个点的超级档案中，但这正是正在发生的事情。”这些泄密事件是解开公司如何打造这种包罗万象的形象之谜的一条线索。\n爱德华兹是最近一项研究的撰稿人，该研究考察了Grindr和OkCupid等约会服务可能侵犯隐私的行为。爱德华兹在新报告中写道，“最严重”的泄密事件之一涉及Quibi，这是一个总部位于洛杉矶的短片视频平台，由资深高管杰弗里·卡森伯格(Jeffrey Katzenberg)和梅格·惠特曼(Meg Whitman)运营。\n在欧洲和加利福尼亚州新的数据隐私法规生效很久之后，Quibi于4月6日上线。\n爱德华兹写道，“在2020年，任何新的技术机构都不应该推出将所有新的用户确认电子邮件泄露给广告和分析公司的公司。”“然而，这显然是Quibi决定要做的。”\n下载Quibi应用程序的人被要求提交他们的电子邮件地址。然后他们收到一个确认链接。根据这份报告，点击链接可以让谷歌、Facebook、Twitter和Snapchat访问他们的电子邮件地址。\nQuibi在周三的一份声明中称，数据安全“是重中之重”，“当我们网页上的问题被透露给我们的安全和工程团队时，我们立即修复了这个问题。”\n爱德华兹说，客户可能不知道Wish的泄密事件。Wish是一个电子商务平台，从2018年开始，数亿个电子邮件地址很可能被曝光。他写道，当用户点击该公司营销电子邮件中的链接时，他们的电子邮件地址会与谷歌、Facebook、Pinterest、PayPal和其他公司共享。\n该公司在一份声明中说，Wish在今年收到爱德华兹的来信后，加强了数据保护措施。但它批评他的报告“离题”，指出电子邮件地址是经过编码的，并流向了希望用于广告和销售支持的服务提供商。\nWish的一位发言人补充说，谷歌和其他广告和分析公司“没有理由”破解加密的电子邮件地址。发言人说：“无论如何，向服务供应商提供这类编码资料绝对不是‘违规’行为。”\n根据爱德华兹的报告，捷蓝航空的客户数据也被泄露出去，该公司在一份声明中表示，正在认真对待爱德华兹的担忧，并将审查他的调查结果。\n根据这份报告，包括华盛顿邮报在内的其他公司的泄密情况有限。爱德华兹写道，取消订阅“华盛顿邮报”时事通讯的人的电子邮件地址最终流向了几家分析公司，该刊物在接到通知后不久就解决了这个问题。\n冠状病毒大流行再次引发了人们对隐私保护不力的担忧。许多被用来追踪冠状病毒携带者的跟踪应用程序可能会为更多的监控打开大门。Zoom视频会议服务最近受到滞留在家的人的欢迎，但它一直在为一系列隐私和安全问题而苦苦挣扎。\n爱德华兹敦促各公司联系可能收集客户电子邮件地址的平台，要求清除这些信息。\n“一些最大的公司假装这样做。", "note_en": "Millions of people gave their email addresses to Quibi, JetBlue, Wish and other companies — and those email addresses got away.\n They ended up in the hands of advertising and analytics companies like Google, Facebook and Twitter, leaving the people with those email addresses more easily targeted by advertisers and able to be tracked by companies that study shopping behavior, according to  a report published on Wednesday.\n The customers unwittingly exposed their email addresses when signing up for apps or clicking on links in marketing emails, said the researcher Zach Edwards, who runs the digital strategy firm Victory Medium. In the report, he described the giveaway of personal data as part of a “sloppy and dangerous growth hack.”\n The practice of making customers vulnerable to tracking by allowing their personal data to be passively collected by third parties is nothing new, Mr. Edwards said in an interview, but it has gained traction despite efforts to improve online privacy protections.\n “This hack used to be something that only very niche and sophisticated developers understood,” he said. “But now the entire ad-tech industry understands it.”\n  Privacy experts have  raised concerns about leaks of personal information for  more than a decade, said Arvind Narayanan, a computer science professor at Princeton University who has  studied data mining. Careless web programming practices lead to some accidental giveaways of large hunks of personal information, he said, but other leaks are intentional.\n “There’s an industry of ad targeting that tries to connect people’s online and offline activities,” Mr. Narayanan said. “People may not want all of their interests and activities and purchases to be tied together in one uber-profile that connects every dot, but that’s exactly what’s happening. These leaks are one clue to the puzzle of how companies are able to create that all-encompassing profile.”\n Mr. Edwards, a contributor  to a recent study that examined potential privacy violations by dating services  like Grindr and OkCupid, wrote in the new report that one of the “most egregious” leaks involved  Quibi, a short-form video platform based in Los Angeles that is run by the veteran executives Jeffrey Katzenberg and Meg Whitman.\n Quibi went live on April 6, long after new data privacy regulations went into effect in  Europe and  California.\n “In 2020, no new technology organizations should be launching that leaks all new user-confirmed emails to advertising and analytics companies,” Mr. Edwards wrote. “Yet that’s what Quibi apparently decided to do.”\n People who downloaded the Quibi app were asked to submit their email addresses. Then they received a confirmation link. Clicking on the link made their email addresses available to Google, Facebook, Twitter and Snapchat, according to the report .\n Quibi said in a statement on Wednesday that data security “is of the highest priority” and that “the moment the issue on our webpage was revealed to our security and engineering team, we fixed it immediately.”\n Mr. Edwards said customers were probably unaware of leaks at Wish, an e-commerce platform where hundreds of millions of email addresses were most likely exposed starting in 2018. When users clicked on links in marketing emails from the company, their email addresses were shared with Google, Facebook, Pinterest, PayPal and others, he wrote.\n Wish strengthened its data protection measures after hearing from Mr. Edwards this year, the company said in a statement. But it criticized his report as “off the mark,” noting that the email addresses were encoded and went to service providers that Wish uses for advertising and sales support.\n A spokesman for Wish added that Google and other advertising and analytics companies “had no reason” to crack the encoded email addresses. “In any event,” the spokesman said, “it certainly is not a ‘breach’ to provide a service provider with such encoded information.”\n According to Mr. Edwards’s report, customer data also leaked out of JetBlue, which said in a statement that it was taking Mr. Edwards’s concerns seriously and would review his findings.\n Other companies, including The Washington Post, had limited leaks, according to the report. The email addresses of people who had unsubscribed to newsletters from The Post ended up with several analytics companies, Mr. Edwards wrote, and the publication addressed the issue shortly after it was notified.\n The coronavirus pandemic has reignited concerns over weak privacy protections.  The many tracking apps that have been used to trace carriers of Covid-19 may open the door to  more surveillance. The Zoom videoconferencing service, newly popular with people stuck at home, has struggled with  a slew of privacy and security problems.\n Mr. Edwards urged companies to reach out to platforms that might have collected their customers’ email addresses and ask that the information be scrubbed.\n “Some of the largest companies doing this pretend like it doesn’t happen, so they don’t have to deal with the deletion process,” Mr. Edwards said. “They ignore people who ask.”", "posttime": "2020-05-02 17:47:12", "tags": "电子邮件,jetblue,companies", "title": "报道称，Quibi，JetBlue和其他公司提供了电子邮件地址", "title_en": "Quibi, JetBlue and Others Gave Away Email Addresses, Report Says", "transed": 0, "url": "https://www.nytimes.com/2020/04/29/business/media/quibi-jetblue-email-breach.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["电子邮件", "jetblue", "companies"]}, {"category": "", "categoryclass": "", "imagename": "583645324fb2922c3b5c37f8bc7e30ef.png", "infoid": 1000058, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "快速说明：我们原本计划今天发布一个新的稳定版本，但我们在最终测试中发现了一个崩溃的错误，我们想在发布之前修复这个错误。我们已经在代码库中检查了一个修复，但是我们希望有更多的烘焙时间来确保我们没有引入新的回归。我们现在计划在下周发布稳定版。感谢几个人报告了这个问题，并与我们合作复制了它。\n大约一年前，我们分享了Ffltter对面向网络的支持的第一个技术预览版。我们对Ffltter的愿景是提供一个便携的工具包，用于在任何您想要在屏幕上绘制像素的地方构建美好的体验。考虑到网络的无处不在，这是一个很自然的地方，可以尝试Ffltter，但它的特点与Android和iOS等移动平台不同。\n让颤动代码在Web浏览器中运行会带来一系列有趣的可能性，包括：\n这为开发人员提供了一条便捷的途径，让他们可以将现有的移动应用程序带到网络上，无论是作为成熟的应用程序PWA，还是作为安装体验的低摩擦预览。\n使桌面应用程序开发人员只需构建一次，然后就是否作为高性能安装的桌面应用程序和/或无摩擦的临时Web应用程序发布做出后期决定。\nDartpad和CodePen等工具可让您快速试用DART代码，无需在计算机上本地安装任何内容即可实时查看结果。\nFfltter在其框架和API选择上毫不掩饰地以应用程序为中心。我们相信，它是一个独特的产品，为网络开发的广阔前景做出了贡献。如果我们实现了我们的目标，Ffltter的网络支持将提供一个充分利用网络平台所提供的所有功能的框架，让开发人员能够构建漂亮的、丰富的交互式应用程序，让他们在浏览器中完全感到宾至如归。\n安普斯特就是一个有力的例子。该团队着手构建一个编辑工具，用于构建AMP故事，这是一种帮助内容提供商为移动设备创建视觉叙事的新格式。以下是他们对在网络上使用Ffltter不得不说的话：\n作为一家帮助客户建立高品牌体验的初创公司，我们能够迅速进入市场并根据客户的反馈进行迭代是至关重要的。我们之所以选择Ffltter，是因为它让我们可以自由地专注于产品，而不是平台本身。到目前为止，我们对我们的体验感到高兴，我们的客户喜欢我们开发的应用程序。“。\n我们对Web支持的早期目标是证明Ffltter框架可以移植到Web这一基本假设。去年夏天，我们将web代码重新分解到主框架中，形成了支持移动和网络(以及桌面！)的单一代码库。自那以后，我们的重点已经转移到使用最新的网络平台进步来提供快速、无干扰的性能，提高颤动目标平台之间的行为一致性，以及根除和修复目前还不支持的场景。\n考虑到这一点，以下是该团队自去年12月网络支持登陆测试版以来所做工作的最新情况。\n渐进式Web应用的粉丝们会很高兴地知道，Web应用的默认颤动模板现在包括对可安装的、支持脱机的PWA应用所需的核心功能的支持：\n请注意，这看起来像一个普通的桌面应用程序，但它实际上是一个作为PWA安装到浏览器中的Ffltter Web应用程序。你可以看到标题栏中添加的图标按钮的不同之处，它显示了Chrome功能。基于颤动的PWA的安装方式可以与任何其他基于Web的PWA相同；表示您的颤动应用程序是PWA的设置由由Ffltter Create在web/子文件夹中生成的清单.json提供。\nPWA在主要的移动和桌面浏览器上都受支持，并且只是我们为弥合本机平台和Web功能之间的差距而进行投资的方式之一。\n这仍然是一项正在进行的工作，所以如果您看到一些看起来不正确的地方，请给我们反馈。\n当我们推出测试版时，只有几个插件支持网络。从那时起，我们看到越来越多的插件增加了对Web平台的支持，这要归功于社区做出的一些巨大贡献，例如：\n虽然我们计划自己扩展一些更受欢迎的Google创作的Web插件，但我们在很大程度上依赖于社区来帮助将Web支持带到现有的软件包中。为了帮助您入门，我们发表了几篇文章，解释如何编写Web插件。\n调试是开发过程中的关键步骤，也是为创建更丰富的颤动网络体验而积极开发的领域之一。如果您使用VS代码来开发颤动应用程序，您可能希望可以使用全套调试功能，包括使用监视函数在调试窗口中计算表达式", "note_en": "A quick note: we originally planned to release a new stable release of Flutter today, but we discovered a   crashing bug  in final testing that we wanted to fix before releasing. We have a fix checked into the codebase, but we want to allow a little more bake time to be certain we didn’t introduce a new regression. We now plan to release the stable release next week. Thanks to several folks who reported the issue and worked with us to reproduce it.\n  Almost a year ago, we shared our first technical preview of Flutter’s support for targeting the web. Our vision for Flutter is to provide a portable toolkit for building beautiful experiences wherever you might want to paint pixels on the screen. Given the pervasiveness of the web, it’s a natural place to experiment with Flutter, but its characteristics are different from a mobile platform like Android and iOS.\n Having Flutter code run in a web browser opens up an array of intriguing possibilities, including:\n Providing an easy path for developers to take their existing mobile apps to the web, whether as a fully-fledged app, PWA, or as a low-friction preview of the installed experience.\n Enabling desktop app developers to build once and make a late-bound decision about whether to ship as a high-performance installed desktop app and/or a friction-free ephemeral web app.\n Tools like  DartPad and  CodePen that let you quickly experiment with Dart code, seeing the results in real time without needing to install anything locally on your machine.\n Flutter was built to be unapologetically app-centric in its framework and API choices. We believe it is a distinct offering that contributes to the broad tapestry of web development. If we are successful at our goals, Flutter’s web support will provide a framework that takes full advantage of all that the web platform offers, allowing developers to build beautiful rich interactive applications that feel completely at home in a browser.\n  Ampstor is a powerful example. The team set out to build an editing tool for building  AMP Stories, a new format that helps content providers create visual narratives for mobile devices. Here’s what they had to say about using Flutter on the web:\n “As a startup that helps customers build highly-branded experiences, it’s critical that we can get to market quickly and iterate based on customer feedback. We chose Flutter because it gave us the freedom to focus on the product, not the platform itself. We’re delighted with our experiences so far and our customers love the app we’ve built.”\n Our early goal with web support was to prove the basic hypothesis that the Flutter framework could be ported to the web. Last summer, we unforked the web code back into the main framework, leading to a single codebase that supports mobile and web (as well as desktop!). Our focus has since shifted to delivering fast, jank-free performance using the latest web platform advances, improving behavioral consistency across Flutter target platforms, and rooting out and fixing scenarios that don ’t yet  ...\n With that in mind, here is an update on what the team has been working on since web support landed in the beta channel last December.\n   Fans of  Progressive Web Apps will be delighted to know that the default Flutter template for web apps now includes support for the core features needed for an installable, offline-capable PWA app:\n  Notice that this looks like a normal desktop app, but it’s really a Flutter web app that’s been installed into the browser as a PWA. You can see the difference with the added icon buttons in the title bar, which exposes Chrome functionality. Flutter-based PWAs can be  installed in the same way as any other web-based PWA; the settings signaling that your Flutter app is a PWA are provided by  manifest.json, which is produced by  flutter create in the  web/ subfolder.\n PWAs are supported on major mobile and desktop browsers and are just one of the ways we are investing in  bridging the gap between the capabilities of the native platform and the web.\n This remains a work in progress, so please give us feedback if you see something that doesn’t look right.\n  When we launched beta, only a few plugins supported the web. Since then, we’re seeing  more plugins add support for the web platform, thanks to some great contributions from the community, such as:\n  While we plan on extending a few more popular Google-authored plugins for the web ourselves, we largely depend on the community to help bring web support to existing packages. To help you get started, we have published a couple of articles explaining  how to write a web plugin.\n  Debugging is a crucial step in the development process, and is one of the areas of active development for creating a richer Flutter web experience. If you use VS Code to develop Flutter applications, you’re probably expecting the full set of debug capabilities to be available to you, including evaluating expressions in the debug window, using the watch functionality, or hovering over variables to see their value.\n Until recently, this was only available for debugging mobile Flutter apps. In the last couple of months, we have been working on connecting expression evaluation to Flutter on the web and now have experimental support ready to try out in VSCode. Support for other IDEs, such as  IntelliJ, is still in progress.\n This feature is available on the Flutter dev or master channel. Use the following instructions to set it up for VS Code:\n Configure your project to  run on the web. Within VS Code, enable expression evaluation for web in  launch.json:\n  Set a breakpoint and start debugging. Try expression evaluation in the debug console using the expression evaluation box as shown below. Additionally, you can use the watch window or hover over variables to evaluate your code using expressions.\n     The latest builds of Flutter now support running automated Flutter driver UI tests against your Flutter web apps in just the same way that they work for mobile apps. To enable support for this experimental feature, you can  read the directions on the Flutter wiki.\n  Over the past few months, our focus has been spent on improving the infrastructure, quality and rendering for Flutter’s web support. While we still have a lot to do, we have made significant progress in all three areas.\n  Building test infrastructure is one of those improvements that isn’t always visible to those developing with Flutter but is nonetheless important to building a stable version of Flutter on the web.\n This past quarter we have added automated testing to ensure correctness of the web engine and framework. We added screenshot tests on Chrome to make sure we are rendering consistently and correctly as we make changes to the code. We now run unit and integration testing on Chrome, Firefox and Safari. Running these tests on mobile browsers and Internet Explorer/Edge will be coming online soon. Additionally, we have added performance benchmark tests, enabling us to iterate quickly  ...\n  Speaking of issues, we’ve been busy burning down issues to incrementally improve our quality through optimizations and correctness fixes.\n Recently we landed an optimization in Flutter for web that improves scrolling for static content, meaning content that is not lazily loaded but is rendered all in the same frame. This should bring scrolling performance more in line with traditional web experiences.\n We’ve also fixed several text rendering issues such as text disappearing behind the canvas or cursor problems with multiline text. These text correctness fixes are currently enabled behind the  FLUTTER_WEB_USE_EXPERIMENTAL_CANVAS_TEXT flag; our plan is to make this the platform default soon.\n At  Flutter Interact last year, we announced that our new Gallery sample app runs on the web using Flutter. Since then we’ve made significant performance optimizations in web support as well as the app, so that it runs even faster and smoother. As a result of these changes, initial load time is now three times faster, and the code size has been reduced by 2.7x.\n  Stay tuned for an upcoming blog series that will share more about what we’ve learned, as well as best practices for optimizing your Flutter app for performance. Until then, check out the updated  Flutter Gallery app for yourself.\n  When we started our exploration into the web, we considered a variety of approaches for rendering UI, knowing that our choice would dictate how well we could build, layout, and paint Flutter widgets on the web.\n We originally opted for an HTML DOM-based model that combines HTML, CSS, and the  Canvas API to express output produced by the Flutter framework. We call this implementation our DomCanvas rendering system.\n Over the last year, we have gained a better understanding of the performance and correctness characteristics of the various rendering technologies available on the web, and have been experimenting with a second approach that uses  CanvasKit. CanvasKit brings  Skia to the web using  WebAssembly and  WebGL, enabling a hardware-accelerated drawing surface that improves our ability to render complex and intensive graphics efficiently.\n We believe that both DomCanvas and CanvasKit offer advantages in different scenarios, and so we’re supporting both rendering models.\n DomCanvas offers the greatest compatibility with a wide variety of browsers, with a compact code size. However, repaint performance is poorer, which makes it less suitable for more graphically-intensive applications.\n The CanvasKit backend offers superior performance, fidelity, and correctness, but it has poor initial startup time due to a larger code size.\n By default, Flutter’s web support uses DomCanvas, but you can enable the CanvasKit rendering engine with this command:\n  One word of caution: the CanvasKit engine still has a few rough edges; for early adopters who are putting Flutter into production, the DomCanvas engine offers the greatest stability.\n  While we believe we’re making good progress at building a solid foundation, there are a few other areas we are planning to work on to fill out our web support.\n Desktop-class UX. Supporting Flutter on desktop web browsers requires more than web support: there are typically significant UI differences between mobile and desktop experiences. We’re therefore adding features to support desktop-class experiences, such as  responsive widgets and scrolling physics, that still need to be implemented.\n Autofill is a feature supported in most platforms, and in terms of the web, it means enabling the browser to store data and fill it in where appropriate. We  recently added initial autofill support to the core framework, and now we are working on  adding this feature to Flutter on the web. This effort includes addressing browser differences,  saving fill information for future autofills, and passing auto-fillable elements as a group to the engine.\n URL Routing. It’s a small issue, perhaps, but today Flutter web apps include a  hash marker for routing even on the home page. We’re working to eradicate this and provide more control over URL routing, with  contributions from the community under review at present.\n Code size remains an area of active investigation. Today every Flutter web app downloads the engine code that it needs; we’re looking into possibilities to cache some of this logic to reduce startup time and download size.\n  We hope there are some fun surprises in this article: we’ve made a lot of progress since the December update. However, you should be aware that Flutter’s web support is still in beta, and you should be cautious about deploying it into production environments, since performance and browser compatibility work is still in progress.\n If you are new to developing with Flutter on the web, check out  flutter.dev/web to learn more and try out your code on  dartpad.dev or  codepen.io/flutter.\n For those that are currently developing Flutter web apps, thank you for your support and contributions, we hope you continue experimenting,  filing issues and  updating plugins to support the web!", "posttime": "2020-05-02 17:47:09", "tags": "flutter,web", "title": "颤动Web支持更新", "title_en": "Flutter Web Support Updates", "transed": 0, "url": "https://medium.com/flutter/flutter-web-support-updates-8b14bfe6a908", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["flutter", "web"]}, {"category": "", "categoryclass": "", "imagename": "9a73ec9cd4b5c3d3c6c742868c606178.jpg", "infoid": 1000056, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(CNN)挪威千万富翁汤姆·哈根因涉嫌杀害18个月前失踪的妻子安妮-伊丽莎白·哈根而被捕。\n黑根的律师否认这位财产和能源大亨与此事有关，他还没有被指控犯有任何罪行。\n据挪威公共广播公司NRK报道，现年69岁的安妮-伊丽莎白·黑根于2018年10月失踪，家人表示，释放她已要求赎金，但挪威警方周二逮捕了70岁的黑根，罪名是涉嫌杀害她。\n此案于2019年1月首次报道，在一个犯罪率较低的国家引起了广泛关注。\n警方表示，他们现在相信安妮·伊丽莎白是被杀害的，而不是被绑架的，并有足够的证据怀疑汤姆杀害了安妮。\n奥斯特警察局在一份声明中表示：需要强调的是，尽管我们已经起诉了汤姆·黑根，但案件仍在调查中，还有几个问题没有回答。\n澄清汤姆·黑根所扮演的角色，找到安妮-伊丽莎白·黑根，并确定是否有其他人参与其中，这一点尤为重要。\n正如案件最初出现的那样，我们的主要理论是安妮-伊丽莎白·黑根被一个有经济动机的人绑架了。警方说，2019年6月，我们开始相信她很可能已经被杀了。\n我们现在相信没有绑架事件发生，也从未进行过任何真正的谈判。声明补充说，换句话说，这是一次明确而精心策划的误导警方的企图。\n挪威的法律制度允许警方在正式指控之前拘留涉嫌犯罪的个人。\n据路透社(Reuters)报道，他告诉一群记者，他强烈声称自己与此无关。\n根据声明，警方要求法院还押Hagen四周，并禁止探视和外部交流。\n他们最初对安妮·伊丽莎白的失踪保密，以保护她，但后来在2019年1月将案件公之于众。\n挪威东区警区高级顾问奥伊斯坦·斯塔夫达尔·保尔森当时告诉CNN，我们可以确认有赎金，而且已经发出了严重威胁。\n关于赎金，我们不想确认金额或形式，他补充道。\nNRK当时报道称，在哈根斯的家中发现了多条信息，并表示有人要求用加密货币莫内罗支付赎金。\n据挪威财经杂志“资本论”报道，黑根是一名房地产投资者和电力设施所有者，是挪威最富有的人之一，净资产约为2亿美元。\n据NRK称，安妮-伊丽莎白·黑根在9月份之前一直是她丈夫控股公司的董事会成员。\n据挪威公共广播公司NRK报道，这对夫妇住在奥斯陆东北约12英里处的费尔哈马尔(Fjellhamar)村。报道称，这对夫妇于1979年结婚，有三个成年子女。", "note_en": "(CNN)Norwegian multimillionaire  Tom Hagen has been arrested on suspicion of killing his wife, Anne-Elisabeth Hagen, who disappeared 18 months ago.\n Hagen&#39;s lawyer denies the property and energy mogul was involved, and he has not yet been charged with any crimes.\n Anne-Elisabeth Hagen, 69, disappeared in October 2018 and the family said a ransom had been demanded for her release, but on Tuesday Norwegian police arrested Hagen, 70, on suspicion of killing her, according to public broadcaster NRK.\n    The case was first reported in January 2019, attracting widespread attention in a nation where crime rates are low.\n Police say they now believe Anne-Elisabeth was killed and not abducted, and have enough evidence to &#34;suspect&#34; Tom of her killing.\n  &#34;It is important to emphasize that although we have charged Tom Hagen, the case is still being investigated and there are several unanswered questions,&#34; Øst Police District said in a statement.\n &#34;It will be particularly important to clarify the role played by Tom Hagen, to find Anne-Elisabeth Hagen and to determine whether other people are involved.&#34;\n &#34;As the case initially appeared, our main theory was that Anne-Elisabeth Hagen had been abducted by someone with a financial motive. And in June 2019, we came to believe that she had most likely been killed,&#34; police said.\n  &#34;We now believe there was no abduction and there was never any genuine negotiations. In other words there was a clear and well-planned attempt at misleading the police,&#34; the statement added.\n The Norwegian legal system allows police to hold an individual on suspicion of a crime before formal charges are brought.\n  &#34;He strongly maintains that he has nothing to do with this,&#34; he told a group of reporters, according to Reuters.\n  Police asked the court to remand Hagen in custody for four weeks, with a ban on visits and outside communication, according to the statement.\n  They initially kept Anne-Elisabeth&#39;s disappearance a secret in a bid to protect her but then made the case public in January 2019.\n &#34;We can confirm that there is a ransom, and that serious threats have been issued,&#34; Øystein Stavdal Paulsen, senior adviser of Norway&#39;s East Police District, told CNN at the time.\n &#34;Regarding the ransom, we do not want to confirm what amount or in what form,&#34; he added.\n NRK reported at the time that multiple messages were found inside the Hagens&#39; home and that a ransom had been demanded in the cryptocurrency Monero.\n Hagen, a real estate investor and power facilities owner, is one of Norway&#39;s richest men, with a net worth of around $200 million, according to Norwegian financial magazine Kapital.\n   Anne-Elisabeth Hagen was a board member of her husband&#39;s holding company until September, according to NRK.\n The couple lived in Fjellhamar, a village about 12 miles northeast of Oslo, according to Norwegian public broadcaster NRK. The couple married in 1979 and have three adult children, it said.", "posttime": "2020-05-02 17:46:58", "tags": "妻子,richest,警方,hagen", "title": "挪威最富有的人之一，因涉嫌谋杀妻子而被捕", "title_en": "One of Norway's richest men, arrested on suspicion of murdering his wife", "transed": 0, "url": "https://edition.cnn.com/2020/04/29/europe/norway-tom-hagen-murder-arrest-scli-intl/index.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["妻子", "richest", "警方", "hagen"]}, {"category": "", "categoryclass": "", "imagename": "7333499203f526ae040404db09fe31b1.jpg", "infoid": 1000055, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着加州州长加文·纽瑟姆(Gavin Newsom)预计本周末下令关闭一些海滩而面临阻挠，该州新增冠状病毒病例数量大幅增加，达到大流行开始以来单日有记录的最高新增病例数量。\n根据该新闻机构汇编的数据，全州周三出现2380例新的冠状病毒病例，使加利福尼亚州的病例总数达到48770例。周三的新病例比前一天增加了91%，比4月20日增加了3%，4月20日该州有2312起新闻案件，这是此前有记录的单日新病例数量最高的一天。\n根据该新闻机构的数据，洛杉矶县占新病例的63%，周三报告了1，509例。这也是该县有记录以来单日新增病例最多的一天。前一天，洛杉矶有559例新病例，与加州其他地区一样，自4月20日以来，洛杉矶每天记录的新病例一直在下降，当时该市记录的新病例为1475例，创下当时的最高纪录。\n周三，南加州其他县的新病例大幅增加。其中包括河滨，该州总共有3942例冠状病毒病例，是该州第二高的病例数量。河滨市报告新增病例207例，比前一天增加125%。其他是奥兰治县和圣贝纳迪诺县，各有101例新病例，分别增加了83%和304%。\n该州的死亡人数也继续攀升至1943人。周三报告的新死亡人数只有78人。这比4月22日下降了33%，当时该州报告了188人死亡，是单日死亡人数最高的一天。\n州公共卫生部还报告说，周一全州报告的冠状病毒检测数量已经达到603139例，比前一天增加了4%。\n周三之前，加州每天新增病例的数量已经开始放缓，这是一个令人鼓舞的迹象，表明该州有望满足纽瑟姆的一项要求，即将其从目前的居家订单中转移出来，并允许学校、商业和工作场所逐步重新开放。\n根据该新闻机构的数据，与洛杉矶和该州其他地区相比，旧金山湾区周三的新病例数量继续放缓。它报告了149例新病例，使其病例总数达到8101例。周三的新病例比前一天下降了9%。\n旧金山湾区每天报告的与冠状病毒相关的新死亡人数也继续放缓。周三有7人死亡，使该地区的死亡总数达到283人。但周三报告的死亡人数比4月22日记录的21人减少了66%。\n事实上，圣克拉拉县，曾经是该地区冠状病毒危机的震中，记录了自大流行开始以来单日新增病例的最低数量-仅12例。\n周三，旧金山湾区六个县的公共卫生官员宣布，避难所将持续到5月31日。但圣克拉拉、圣马特奥、旧金山、阿拉米达和康特拉科斯塔等县的官员也开始了推动该地区走向正常化的进程，放松了对一些户外活动和商业(如建筑和高尔夫)以及某些形式的儿童保育的限制。\n周二，纽瑟姆谈到了学校如何可能在7月份重新开学，因为他的办公室制定了一个分四个阶段的计划，让风险较低的企业和工作场所在未来几周内恢复运营-只要社会距离继续压低新病例的数量。\n但纽瑟姆对上周末人们蜂拥至南加州海滩的画面表示失望，尽管社会秩序疏远。据美联社报道，约有8万人涌入洛杉矶南部奥兰治县的新港海滩，另有数千人聚集在洛杉矶北部文图拉县的开放海滩。\n加州警察局长协会主席埃里克·努涅斯(Eric Nuñez)告诉美联社(Associated Press)，周三，纽瑟姆向全州的警察局长发送了一份备忘录，命令他们关闭加州海岸线上下的所有海滩。但在周四，他表示，这项命令将只适用于奥兰治县的海滩。\n大多数旧金山湾区的县已经关闭了海滩，除了圣克鲁斯县，该县允许人们广泛使用海滩进行锻炼，只要他们遵循推荐的社会距离做法。\n但在包括外地游客在内的人们挤满了圣克鲁斯县的沿海地区，并在1号高速公路沿线造成交通危险后，圣克鲁斯县的官员本周重新审视了他们的规定。周三，官员们宣布，他们将从上午11点开始关闭。下午5点。除了冲浪或游泳等水上活动外，其他只对散步或跑步等活动开放。", "note_en": "As California Gov. Gavin Newsom faces pushback for his expected order to close some beaches this weekend, the state saw a dramatic increase in the number of new COVID-19 cases, reaching the highest number of new cases recorded in a single day since the pandemic began.\n Throughout the state, there were 2,380 new coronavirus cases Wednesday, bringing the total number of cases in California to 48,770, according to data compiled by this news organization. The new cases Wednesday represent a 91% increase from the day before and a 3% increase from April 20, when the state had 2,312 news cases, previously the highest recorded number of new cases in a single day.\n Los Angeles County accounted for 63% of the new cases, reporting 1,509 on Wednesday, according to this news organization’s data. That’s also the highest number of new cases ever recorded in a single day in that county. The day before, Los Angeles had 559 new cases, and, like the rest of California, had been on a downward pace in recording new daily cases since April 20, when it recorded a then-high of 1475 new cases.\n Other Southern California counties saw big jumps in new cases Wednesday. They include Riverside, which, with 3,942 total COVID-19 cases, has the second highest number of cases in the state. Riverside reported 207 new cases, a 125% increase from the day before. The others were Orange and San Bernardino counties, which each had 101 new cases, increases of 83% and 304%, respectively.\n  The number of deaths in the state also continued to climb to a total of 1,943. There were only 78 new deaths reported Wednesday. That’s a 33% drop from April 22, when the state reported 188 deaths, the highest number in a single day.\n The state Department of Public Health also reported that the number of COVID-19 tests reported statewide had reached 603,139 on Monday, a 4% increase from the day before.\n Prior to Wednesday, the number of new daily cases had begun to slow in California, offering an encouraging sign that the state was on track to meet one of Newsom’s requirements for moving it out of its current stay-at-home ordering and allowing schools, business and workplaces to gradually reopen.\n The Bay Area, in contrast to Los Angeles and the rest of this state, continued to see the pace slow in the number of new cases Wednesday, according to this news organization’s data. It reported 149 new cases, which brought its total number of cases to 8,101. The new cases Wednesday represent a 9% drop from the day before.\n The number of new COVID-19-related deaths reported daily also continued to slow in the Bay Area. There were seven deaths on Wednesday, bringing the region’s total to 283. But Wednesday’s reported deaths represents a 66% decrease from the 21 deaths recorded on April 22.\n  In fact, Santa Clara County, once the region’s epicenter of its COVID-19 crisis, recorded its lowest number of new cases in a single day — just 12 — since the pandemic began.\n On Wednesday, public health officials in six Bay Area County counties announced that shelter in place would continue through May 31. But the officials — in Santa Clara, San Mateo, San Francisco, Alameda and Contra Costa counties — also began the process of moving the region towards normalization by loosening restrictions on some outdoor activities and businesses such as construction and golf, as well as some forms of childcare.\n On Tuesday, Newsom talked about how schools could possibly reopen in July, as his office laid out a four-stage plan for letting lower-risk businesses and workplaces resume operations in the next few weeks — as long as social distancing continued to push down the number of new cases.\n  But Newsom  expressed dismay at images of people thronging to beaches in Southern California last weekend despite the social distancing order. Some 80,000 people flocked to Newport Beach in Orange County, south of Los Angeles, with additional thousands gathering at open beaches in Ventura County, north of Los Angeles, the Associated Press reported.\n On Wednesday, Newsom sent a memo to police chiefs around the state, ordering them to close all beaches up and down the California coastline, Eric Nuñez, president of the California Police Chiefs Association, told the Associated Press. But on Thursday he said the order would only apply to beaches in Orange County.\n Most Bay Area counties have already closed beaches, with the exception of Santa Cruz County, which had allowed people wide use of beaches for exercise and as long they followed recommended social distancing practices.\n But Santa Cruz County officials revisited their regulations this week after people, including visitors from out of the county, crowded its coastal spots and created traffic hazards along Highway 1. On Wednesday, officials announced they would be closed from 11 a.m. to 5 p.m. except for water-based activities such as surfing or swimming, and otherwise only open for activities like walking or running.", "posttime": "2020-05-02 17:46:53", "tags": "旧金山,湾区,跃升,los,海滩", "title": "加州，洛杉矶新病例跃升，旧金山湾区继续下降", "title_en": "California, Los Angeles see jump in new cases, Bay Area continues down", "transed": 0, "url": "https://www.eastbaytimes.com/2020/04/30/coronavirus-california-los-angeles-see-huge-jump-in-new-cases/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["旧金山", "湾区", "跃升", "los", "海滩"]}, {"category": "", "categoryclass": "", "imagename": "812d36ec4d4d4270b90167fbf5d22793.jpg", "infoid": 1000052, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1230万像素索尼IMX477传感器、7.9 mm对角线图像大小和背光传感器架构，背焦可调，并支持C和CS安装镜头。\n现在就买。\n高品质相机的设计可接受CS安装镜头和附带适配器的C安装镜头。CGL 6 mm CS安装镜头和16 mm C安装镜头是与高品质相机兼容的第三方产品的示例；请参阅安装这些CS安装镜头和C安装镜头的分步说明。\n有关如何启动和运行相机的指南，包括背焦调整、三脚架安装、将相机连接到Raspberry PI计算机，以及在Raspbian中操作相机软件以捕获图像，请参阅我们的在线入门指南。\nSONY IMX477R堆叠式背光传感器，1230万像素，7.9mm传感器对角线，1.55μm×1.55μm像素。\n我们的使命是将计算和数字制造的力量交到世界各地的人们手中。我们这样做是为了让更多的人能够在工作中利用计算和数字技术的力量，解决他们关心的问题，并创造性地表达自己。", "note_en": "12.3 megapixel Sony IMX477 sensor, 7.9mm diagonal image size, and back-illuminated sensor architecture, with adjustable back focus and support for C- and CS-mount lenses\n Buy now\n  The High Quality Camera is designed to accept CS-mount lenses and, with the supplied adapter, C-mount lenses. The CGL 6 mm CS-mount and 16 mm C-mount lenses are examples of third-party products that are compatible with the High Quality Camera; see step-by-step instructions for fitting these  CS-mount and  C-mount lenses.\n     For a guide to getting your camera up and running, including  back focus adjustment,  tripod mounting,  connecting your camera to a Raspberry Pi computer, and operating camera  software in Raspbian to capture images, see our online  Getting started guide.\n Sony IMX477R stacked, back-illuminated sensor, 12.3 megapixels, 7.9 mm sensor diagonal, 1.55 μm × 1.55 μm pixel size\n  Our mission is to put the power of computing and digital making into the hands of people all over the world. We do this so that more people are able to harness the power of computing and digital technologies for work, to solve problems that matter to them, and to express themselves creatively.", "posttime": "2020-05-02 17:46:41", "tags": "相机,raspberry pi,树莓,pi,安装", "title": "树莓派高品质相机", "title_en": "Raspberry Pi High Quality Camera", "transed": 0, "url": "https://www.raspberrypi.org/products/raspberry-pi-high-quality-camera/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["相机", "raspberry", "pi", "树莓", "安装"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000051, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，谢丽尔·多普一直在考虑她手机上的铃声来自一家新的Airbnb公司。预订是她所说的“神奇的钱”的声音。她说，她在Airbnb上租出的一处位于新泽西州泽西城的房产，每月的总收入可能超过8000美元，是长期租户愿意支付的价格的两倍。\n现在，多普将这些订单与取消订单和财务困境联系在一起。这位54岁的信息技术承包商说，她3月份有大约1万美元的预订量在一夜之间蒸发了。她说，她每月有2.2万美元的开支，主要是Airbnb的投资组合，其中包括泽西城的另一套房子和迈阿密的一套房子。\n她说，在她看来，更多租金收入的承诺抵消了不断增长的债务。“我和魔鬼做了个交易。”\n多普是零工经济上层层面的一部分：为了追求Airbnb利润而购买或租赁房地产的房主和投机者。Airbnb催生了一个由经营自己的房地产帝国的房主组成的家庭手工业，将这家初创公司变成了一个没有任何酒店的酒店经营者。\n冠状病毒的传播暴露了美国经济的大片地区，这些地区不适合危机--非常适合快速提供廉价的商品和服务，在经济灾难中非常糟糕。\n事实证明，在这场大流行中，共享经济特别不稳定。硅谷倡导将美国变成一个企业家的土地，利用灵活的工作时间，不受监管或专门培训的阻碍。接受这一想法的人把他们的车变成了优步技术公司(Uber Technologies Inc.)的工作站。和Lyft Inc.。或者成为像DoorDash这样的送餐服务的快递员。\n他们受到了打击，但有了Airbnb，问题就更广泛了。房东带来了清洁服务、室内设计师和帮助建立微型房地产帝国的物业维护工人-所以他们的困境产生的连锁反应远远超出了他们自己的挂牌房源。\n根据市场研究公司AirDNA LLC的数据，由于旅游业冻结，Airbnb房东的预订量在3月中旬消失了15亿美元。AirDNA LLC是一家分析预订量的市场研究公司。Airbnb给客人全额退款，并迫使房东掏腰包或乞求对4月份的贷款和租金宽大处理。\n“房东应该一直为这笔收入的流失做好准备，”为房地产贷款进行信用风险分析的Argua Group Inc.的负责人吉娜·马洛塔(Gina Marotta)说。“取而代之的是，他们以此为食，建立了一种昂贵的生活方式。”\n这家催生了短期租赁经济的初创公司本月正在大幅削减开支，并获得了20亿美元的融资，其中包括一笔10亿美元的高息贷款。华尔街日报上个月报道说，由于大流行，Airbnb已经积累了数亿美元的损失。该公司尚未公开公布数据。\n尽管大多数房地产经济学家说，Airbnb的房产太少，不足以引发房地产危机，但Airbnb经济的崩溃可能会给贷款人带来压力，削弱房地产价值，并验证一些地方政府长期以来的怀疑，即Airbnb是经济适用房危机的罪魁祸首。\nAirbnb发言人尼克·帕帕斯(Nick Papas)表示：“没有人预料到全球大流行会要求该国在适当的地方避难，颠覆经济。”“这是暂时的：旅游将会反弹，Airbnb的房东--他们中的绝大多数只有一个房源--将继续欢迎客人并创造收入。”\n帕帕斯说，该公司只占全球住房存量的一小部分，对更广泛市场的影响微乎其微。他说，Airbnb在全球拥有300多万台主机和700多万套房源。\nAirbnb房东的背景、财务状况和业务各不相同，这使得解决他们的困境具有挑战性。他们在许多城市的灰色市场运营，因为短期租赁法仍在发展中。他们的模式从拥有房产到签署公寓长期租赁协议，不一而足。\nAirDNA估计，Airbnb在美国列出的整个房屋或公寓(不包括共享房间)中，有三分之一是由拥有单一房产的房东提供的。另外三分之一由具有2到24个属性的主机运行。其余三分之一涉及拥有超过25个属性的主机。\n其中一些租住25套以上房产的房东由Sonder Corp.和Lyric Hotitality Inc.等初创公司管理，这些公司支付租金，在Airbnb和其他地方转租了数百套公寓。最近几周，这些公司中的许多公司都进行了休假或裁员。\nAirbnb的帕帕斯说，该公司没有按房产细分数据，也不能对AirDNA数据的准确性发表评论。他说，全球超过70%的房东只有一个房源，而这些房源约占Airbnb房源的一半。他拒绝细分列出整个房屋的房东与转租房间的房东的比例。\n规模较小的参与者每人花费了数十万美元购买房屋进行短期租赁。Jennifer Kelleher-Hazlett of", "note_en": "For years, Cheryl Dopp considered the ding on her phone from a new Airbnb Inc. booking to be the sound of what she called “magical money.” A property she rented out in Jersey City, N.J., on Airbnb could gross more than $8,000 a month, she said, double what long-term tenants would pay.\n Now, Ms. Dopp associates the dings with cancellations and financial misery. The 54-year-old information-technology contractor said she had about $10,000 in bookings evaporate overnight in March. She has $22,000 in monthly expenses for a largely Airbnb portfolio, she said, that included another Jersey City home and a house in Miami.\n In her mind, the promise of more rental income offset the growing debt, she said. “I made a bargain with the devil.”\n  Ms. Dopp is part of an upper-crust dimension of the gig economy: property owners and speculators who bought or leased real estate in pursuit of Airbnb profits. Airbnb spawned a cottage industry of homeowners running their own property empires, turning the startup into a hotelier without any hotels.\n The coronavirus’s spread has exposed swaths of the U.S. economy that were ill-suited for a crisis—great for offering inexpensive goods and services quickly, terrible in an economic disaster.\n  The sharing economy has proven particularly unstable in the pandemic. Silicon Valley championed the concept of turning America into a land of entrepreneurs taking advantage of flexible hours, unimpeded by regulations or specialized training. People who bought into the idea turned their cars into work stations for Uber Technologies Inc. and Lyft Inc. or became couriers for food-delivery services like DoorDash.\n     They have taken a hit, but with Airbnb, the problems are broader. Hosts brought with them cleaning services, interior designers and property-maintenance workers who helped build miniature property empires—so their plight has ripple effects that go far beyond their own listings.\n Airbnb hosts saw $1.5 billion in bookings vanish in mid-March as the travel industry froze, according to market-research firm AirDNA LLC, which analyzes bookings. Airbnb gave guests full refunds and forced hosts to dip into their pockets or beg for leniency on April loans and rent.\n “Hosts should’ve always been prepared for this income to go away,” said Gina Marotta, a principal at Argentia Group Inc., which does credit-risk analysis for real-estate loans. “Instead, they built an expensive lifestyle feeding off of it.”\n The startup that gave rise to the short-term rental economy is slashing expenses and secured $2 billion in financing this month, including a $1 billion loan at a hefty interest rate. The Wall Street Journal reported last month that Airbnb had racked up hundreds of millions in losses due to the pandemic. The company hasn’t publicly reported figures.\n Though most real-estate economists say there are too few Airbnb properties to ignite a housing crisis, the breakdown of the Airbnb economy could strain lenders, undermine property values and validate some local governments’ long-held suspicions that Airbnb contributed to the affordable-housing crisis.\n “No one anticipated that a global pandemic would require the country to shelter in place, upend the economy,” said Airbnb spokesman Nick Papas. “This is temporary: Travel will bounce back and Airbnb hosts—the vast majority of whom have just one listing—will continue to welcome guests and generate income.”\n Mr. Papas said the company accounts for a fraction of the global housing stock and would have minimal effect on the broader market. Airbnb has more than 3 million hosts and more than 7 million listings globally, he said.\n Airbnb hosts’ backgrounds, financial circumstances and businesses vary, which makes addressing their woes challenging. They operate in a gray market in many cities because short-term rental laws are still evolving. Their models range from owning property to signing long-term rental agreements for apartments.\n AirDNA estimates that a third of Airbnb’s U.S. listings for entire homes or apartments—excluding shared rooms—are by hosts with a single property. Another third are run by hosts with between two and 24 properties. The remaining third involve hosts with more than 25 properties.\n Some of those hosts renting 25-plus properties are managed by startups such as Sonder Corp. and Lyric Hospitality Inc., which pay to rent hundreds of apartments they sublease on Airbnb and elsewhere. Many of those companies have furloughed or laid off staff in recent weeks.\n Airbnb’s Mr. Papas said the company doesn’t break down data by properties and can’t comment on the accuracy of AirDNA’s data. He said more than 70% of hosts world-wide have only one listing, and those listings account for about half of Airbnb’s listings. He declined to break down the percentage of hosts listing entire homes versus those subletting rooms.\n Smaller players have spent hundreds of thousands of dollars each buying homes for short-term rentals. Jennifer Kelleher-Hazlett of Clawson, Mich., spent about $380,000 to buy two Michigan properties in 2018. She said she and her husband cashed out their financial investments and borrowed $100,000 from employers to furnish them.\n The 47-year-old expected to net up to $7,000 a month from Airbnb after mortgage payments, supplementing her income as a part-time pharmacist and her husband’s as a schoolteacher. Before the virus struck, the couple was considering buying more homes. Now, they can’t make mortgage payments because no one is booking, she said. “We’re either borrowing more or defaulting.”\n Airbnb let hosts set their own refund policies over canceled stays. Hosts with strict policies would receive half the money on canceled stays. Many factored a steady stream of income when planning for the future.\n Airbnb’s Mr. Papas said the majority of active listings didn’t have strict cancellation policies.\n Hosts’ sense of control disappeared as the crisis took hold and the company stepped in to ameliorate travelers’ panicked cancellations. Airbnb granted guests full refunds for stays between March 14 and May 31, wrenching the finances of those who had used Airbnb income to underwrite and sustain their mini-empires.\n Airbnb has said while it gave hosts the flexibility to set their own cancellation policies, hosts agreed to an “extenuating circumstances policy” that allowed the company to override them—as it did when the pandemic hit.\n Some hosts feel Airbnb hung them out to dry. “I don’t think that hosts ever thought their policies would be overridden,” said Ms. Kelleher-Hazlett. “They’re very guest-centric.”\n Later, Airbnb said it would pay hosts 25% of what they would have received for canceled bookings and created a $17 million fund to help top-rated hosts cover mortgages. Airbnb said it would cap grants at $5,000 per host.\n That sum would provide little relief to hosts such as Jennifer and David Landrum of Atlanta. In 2016, they started a company named Local, spending more than $14,000 to outfit apartments with rugs, throw pillows, art and chandeliers. They grossed about $1.5 million annually, mostly through Airbnb, Ms. Landrum said, renting the 18 apartments they leased and 21 apartments they managed to corporate travelers and film-industry workers.\n They spend about $50,000 annually with cleaning services, about $25,000 on an inspector and $30,000 a year on maintenance staff and landscapers, Ms. Landrum said, not to mention spending on furnishings.\n When Airbnb began refunding guests March 14, the Landrums had nearly $40,000 in cancellations, she said. The couple has been able to pay only a portion of April rent on the 18 apartments they lease and can’t fulfill their obligations to pay three months’ rent unless bookings resume. They have reduced pay to cleaning staff and others. Adding to the stress, Georgia banned short-term rentals through April.\n “It’s scary,” said Ms. Landrum, who said she has discounted some units three times since mid-March. The Landrums have negotiated to get some leniency from apartment owners on their leases. If not, Ms. Landrum said, they would have to sell their house.\n Florida, Pennsylvania, Vermont and Delaware also have clamped down on short-term rentals, instituting temporary bans on Airbnb properties and similar listings. Local governments including California’s Sonoma County and Myrtle Beach, S.C., have enacted similar restrictions. The measures have made it harder for some Airbnb hosts to fill properties with families looking to quarantine outside their homes or near relatives.\n Nearly one in five hosts that Airbnb recently surveyed said hosting on the platform helped them avoid eviction or foreclosure. The company presented these findings to U.S. Congressional leaders and successfully lobbied to have hosts covered under the Coronavirus Aid, Relief, and Economic Security Act—known as the Cares Act—making them potentially eligible for small-business loans and unemployment assistance, among other things.\n That program’s funds ran out but were replenished with Congress’ approval this month of another $484 billion in aid. It wasn’t clear how many hosts would qualify or whether disbursements would be fast enough to cover their losses.\n In March, the Federal Housing Finance Agency said owners of investment properties with loans backed by Fannie Mae or Freddie Mac could seek forbearance if they couldn ’t pay their mortgages due to loss of income related to the coronavirus —a change that could help some Airbnb hosts. The agency later moved to help mortgage companies facing a cash-flow crunch, capping at four months the period the companies are on the hook to make monthly payments on behalf  ...\n The pandemic’s financial hit could cause lenders to re-evaluate their exposure to Airbnb, said Susan Wachter, a real-estate professor at University of Pennsylvania’s Wharton School of business. “There’s no rescue in place for this.”\n Many Airbnb hosts are desperate to sell properties, say real-estate brokers like Greg Hague, who runs a Phoenix real-estate firm and helped state lawmakers draft short-term-rental legislation. “There’s been a flood of people. You have people coming to us saying, ‘I’m a month or two away from foreclosure. What’s it going to take to get it sold now?’ ” he said. That has diminished overall property values, he said.\n Airbnb’s Mr. Papas said there was no statistical evidence suggesting home sales or prices had been affected.\n As short-term-listings bans were passed around the country, Airbnb said it was shifting to focus on long-term stays and encouraged hosts to allow them. Some hosts under pressure to generate income have pursued traditional 12-month leases on Zillow, Craigslist and other sites.\n In Nashville, Tenn., which grants permits to hosts, about a dozen of the city’s 3,600 nonowner-occupied listings—which include Airbnb properties—surfaced in the first days of April as advertisements for one-year leases on Zillow or Craigslist, according to Host Compliance LLC, a software provider tracking permits for the city. City leaders said they feared more would follow.\n One of the apartments is in City View, a development with a swimming pool and rooftop views of downtown. When City View was completed in 2015, councilman Freddie O’Connell, who represents the district and has worked to rein in short-term rentals, hoped it would lure young professionals and families and help ease the city’s housing shortage. Instead, he said, it became a haven for short-term rentals.\n “With Airbnb, magical thinking got out there,” said Mr. O’Connell. “People have taken on a lot of risk, and we’re seeing the consequences of that now.” City View declined to comment.\n Ms. Dopp, the IT contractor, bought two Jersey City properties in 2015 each with multiple apartments. She listed one apartment for $140 a night and generated $4,200 from it that month, she said. She also bought a Miami house that she listed on Airbnb and other short-term rental sites under a pseudonym and used the anticipated revenue from the properties to support a six-figure loan for maintenance, she said.\n When states began locking down, Ms. Dopp said, “I thought, ‘Holy God. We’re about to lose everything.’ ”\n Though some of her properties had long-term tenants, she lost most Airbnb bookings through spring, she said, and can’t cover April’s mortgages, property taxes and insurance. A family rented her Miami home at a discounted rate on Airbnb, she said, providing some relief. She also plans to apply for a small-business loan, seek forbearance from banks, find long-term tenants independently of Airbnb and sell one property.\n She has begun shutting down her Airbnb account, she said. “I don’t want to bargain with the devil anymore.”", "posttime": "2020-05-02 17:46:37", "tags": "魔鬼,devil,airbnb", "title": "“与魔鬼讨价还价”--比尔因Airbnb主机过度扩展而到期", "title_en": "'A Bargain with the Devil'–-Bill Comes Due for Overextended Airbnb Hosts", "transed": 0, "url": "https://www.msn.com/en-us/money/markets/a-bargain-with-the-devil-bill-comes-due-for-overextended-airbnb-hosts/ar-BB13k3T4?li=BBnbfcN", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["魔鬼", "devil", "airbnb"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000050, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2月21日开始的一项涉及1，063名患者的随机对照试验的初步数据分析显示，与接受安慰剂治疗的类似患者相比，接受瑞希韦治疗的晚期冠状病毒和肺部受累的住院患者恢复得更快。这项试验(被称为适应性冠状病毒治疗试验，简称ACTT)，由美国国立卫生研究院下属的国家过敏和传染病研究所(NIAID)赞助，是第一个临床试验。\n监督这项试验的独立数据和安全监测委员会(DSMB)于4月27日召开会议，审查数据，并与研究小组分享他们的中期分析。根据他们对数据的审查，他们注意到，从主要终点恢复时间的角度来看，redesivir比安慰剂更好，这是流感试验中经常使用的一项指标。在这项研究中，康复的定义是足够好，可以出院或恢复正常活动水平。\n初步结果表明，接受瑞希韦治疗的患者比接受安慰剂治疗的患者恢复时间快31%(p&lt；0.001)。具体地说，接受瑞希韦治疗的患者恢复时间的中位数为11天，而接受安慰剂治疗的患者为15天。结果还显示了生存的好处，接受雷米地韦治疗的患者死亡率为8.0%，而服用安慰剂的患者死亡率为11.6%(p=0.059)。\n有关试验结果的更详细信息，包括更全面的数据，将在即将发布的报告中提供。作为美国食品和药物管理局(FDA)加快潜在冠状病毒治疗方法开发和供应的承诺的一部分，该机构一直在与Gilead Sciences进行持续和持续的讨论，以期尽可能快地向患者提供redesivir。审判于4月结束，新的注册人数.。\nACTT试验的第一个试验参与者是一名美国人，他在停靠在日本横滨的钻石公主号游轮上被隔离后被遣返，并于2020年2月在第一个研究地点-内布拉斯加大学医学中心/内布拉斯加医学自愿参与这项研究。最终共有68个地点加入了这项研究-47个在美国，21个在欧洲和亚洲国家。\nRemdesivir由Gilead Sciences Inc.开发，是一种研究用的广谱抗病毒治疗，每天输液10天。它已在动物模型中显示出治疗SARS-CoV-2(导致冠状病毒的病毒)的前景，并已在各种临床试验中进行了检验。", "note_en": "Hospitalized patients with advanced COVID-19 and lung involvement who received remdesivir recovered faster than similar patients who received placebo, according to a preliminary data analysis from a randomized, controlled trial involving 1063 patients, which began on February 21. The trial (known as the  Adaptive COVID-19 Treatment Trial, or ACTT), sponsored by the  National Institute of Allergy and Infectious Diseases (NIAID), part of the National Institutes of Health, is the first clinical  ...\n An independent data and safety monitoring board (DSMB) overseeing the trial met on April 27 to review data and shared their interim analysis with the study team. Based upon their review of the data, they noted that remdesivir was better than placebo from the perspective of the primary endpoint, time to recovery, a metric often used in influenza trials. Recovery in this study was defined as being well enough for hospital discharge or returning to normal activity level.\n Preliminary results indicate that patients who received remdesivir had a 31% faster time to recovery than those who received placebo (p&lt;0.001). Specifically, the median time to recovery was 11 days for patients treated with remdesivir compared with 15 days for those who received placebo. Results also suggested a survival benefit, with a mortality rate of 8.0% for the group receiving remdesivir versus 11.6% for the placebo group (p=0.059).\n More detailed information about the trial results, including more comprehensive data, will be available in a forthcoming report. As part of the U.S. Food and Drug Administration ’s commitment to expediting the development and availability of potential COVID-19 treatments, the agency has been engaged in sustained and ongoing discussions with Gilead Sciences regarding making remdesivir available to patients as quickly as possible, as appropriate. The trial closed to new enrollments on April  ...\n The first trial participant in the ACTT trial was an American who was repatriated after being quarantined on the Diamond Princess cruise ship that docked in Yokohama, Japan, and volunteered to participate in the study at the first study site, the University of Nebraska Medical Center/Nebraska Medicine, in February 2020. A total of 68 sites ultimately joined the study—47 in the United States and 21 in countries in Europe and Asia.\n Remdesivir, developed by Gilead Sciences Inc., is an investigational broad-spectrum antiviral treatment administered via daily infusion for 10 days. It  has shown promise in animal models for treating SARS-CoV-2 (the virus that causes COVID-19) infection and has been examined in various clinical trials.", "posttime": "2020-05-02 17:46:32", "tags": "病毒,冠状病毒,临床试验,clinical,治疗", "title": "NIH临床试验显示Remdevir加速晚期冠状病毒恢复", "title_en": "NIH Clinical Trial Shows Remdesivir Accelerates Recovery from Advanced Covid-19", "transed": 0, "url": "https://www.niaid.nih.gov/news-events/nih-clinical-trial-shows-remdesivir-accelerates-recovery-advanced-covid-19", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["病毒", "冠状病毒", "临床试验", "clinical", "治疗"]}, {"category": "", "categoryclass": "", "imagename": "f6555c3f1b449f625c2934b0596913f1.jpg", "infoid": 1000049, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "咖啡可以是一种有益健康的饮料。如果用滤纸器酿造，可能对你更好。\n挪威研究人员收集了508，747名年龄在20岁至79岁之间的男性和女性的健康数据，并对他们进行了平均20年的跟踪调查。参与者还报告了他们喝的咖啡的类型和数量-用纸过滤或用未过滤的方法(如法式压榨或浓缩咖啡)冲泡。\n在男性和女性中，饮用过滤咖啡与因任何原因过早死亡的风险降低15%相关。但未过滤咖啡的比率较低：喝未过滤咖啡的男性减少了4%，女性减少了9%。\n与未过滤咖啡相比，过滤咖啡死于心血管疾病、缺血性心脏病或中风的风险较低。死亡率最低的是那些每天喝一到四杯的人。这项研究发表在“欧洲预防心脏病学杂志”上，控制了许多其他心血管危险因素。\n与过滤咖啡相比，未过滤咖啡含有更高浓度的二萜类提高胆固醇的植物化学物质，这可能至少部分解释了这种影响。\n主要作者、挪威公共卫生部高级研究员Aage Tverdal表示，与锻炼或控制体重相比，这对心血管健康的影响不大，但仍很显著。\n“不管你喝什么咖啡，”他说，“享受你的咖啡。如果方便的话，可以喝过滤咖啡，特别是如果你胆固醇过高的话。“", "note_en": "Coffee can be a healthful drink. It may be even better for you when brewed with a paper filter.\n Norwegian researchers gathered health data on 508,747 men and women 20 to 79 years old and followed them for an average of 20 years. The participants also reported the type and quantity of coffee they drank — filtered through paper or brewed using unfiltered methods like French press or espresso.\n Drinking filtered coffee was associated with a 15 percent reduction in the risk of dying prematurely from any cause in both men and women. But rates were lower when the coffee was unfiltered: Men who drank unfiltered coffee had a 4 percent reduction, and women a 9 percent reduction.\n Compared with unfiltered coffee, filtered coffee was associated with a lower risk of dying from cardiovascular disease, ischemic heart disease or stroke. The lowest mortality was among those who drank one to four cups a day. The  study, in the European Journal of Preventive Cardiology, controlled for many other cardiovascular risk factors.\n Unfiltered coffee contains much higher concentrations of cholesterol-raising phytochemicals called diterpenes than does filtered coffee, which may explain at least part of the effect.\n The lead author, Aage Tverdal, a senior researcher with the Norwegian Department of Public Health, said that the effect on cardiovascular health is modest compared with that of exercise or weight control, but still significant.\n “Whatever kind of coffee you drink,” he said, “enjoy your coffee. If it’s convenient, drink filtered coffee, especially if you have high cholesterol.”", "posttime": "2020-05-02 17:46:27", "tags": "咖啡,coffee", "title": "过滤咖啡可能对心脏健康特别有好处", "title_en": "Filtered coffee may be especially good for heart health", "transed": 0, "url": "https://www.nytimes.com/2020/04/28/well/eat/filtered-coffee-heart-health-benefits.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["咖啡", "coffee"]}, {"category": "", "categoryclass": "", "imagename": "c6006fedb49feae7d1b231e508d248b6.jpg", "infoid": 1000048, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无论是否关闭新对话，社交距离，广泛的测试，旅行限制，以及携带口罩的人，我的陛下？\n儿童基本上是免疫的，但有现有疾病的老年人是脆弱的。孩子和祖父母之间有密切接触的家庭聚会可能是最危险的。\n如果你需要帮助，新对话给我们发个信号！！BC这不像你。一点也不，我想念关心我们所有人的伊隆，金色伊隆的心。\n我们正在研究呼吸机，尽管我认为当我们能生产足够多的产品时，不会出现短缺。\n恕我直言，新对话，这是不负责任的胡说八道。和病毒学家、流行病学家、任何知道他们在谈论什么的人谈谈。我的家人在意大利。整个国家都处于封锁状态，仍然有人在死去。火葬场跟不上了。427人就在今天去世了。\n如果你让人们相信这会在4月底前烟消云散，死亡人数会比现在更高。问问你自己是否想要这样的责任。伙计，你的车很棒，你的火箭很棒，但你在这方面做得不够深入。请重新考虑。", "note_en": "新对话  With or without closures, social distancing, widespread testing, travel restrictions, and people carrying masks, my liege?\n  Kids are essentially immune, but elderly with existing conditions are vulnerable. Family gatherings with close contact between kids &amp; grandparents probably most risky.\n  新对话  Send us a sign if you need help!!Bc this is not like you. At all.I miss the Elon who cares about us ALL The heart of gold Elon\n  We’re working on ventilators, even though I think there will not be a shortage by the time we can make enough to matter\n  新对话  With all due respect, this is irresponsible bullshit. Talk to a virologist, an epidemiologist, anyone who knows what they&#39;re talking about.My family is in Italy. The entire country is in lockdown and STILL people are dying. The crematoria can&#39;t keep up.427 died just TODAY.\n  If you make people believe this will just blow over by end of April, the death toll will be even higher than it is now. Ask yourself if you want that responsibility.Man, your cars are great, your rockets are fantastic, but you&#39;re out of your depth in this. Please reconsider.", "posttime": "2020-05-02 17:46:23", "tags": "美国,cases,是否,people", "title": "“到4月底，美国可能也几乎没有新病例。”", "title_en": "“probably close to zero new cases in US too by end of April”", "transed": 0, "url": "https://twitter.com/elonmusk/status/1240754657263144960", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["美国", "cases", "是否", "people"]}]