[{"category": "", "categoryclass": "", "imagename": "b3eb19ce4448cdbfec2d85a17c907920.jpg", "infoid": 1003201, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在冠状病毒封锁期间，海滨度假似乎是一个遥远的记忆，但在首尔的江南区，海洋已经来到了这座城市。\n韩国最大的数字广告牌SMTOWN COEX大楼的LED正面出现了巨浪。在撞到屏幕表面之前，变形幻觉就出现了，使二维环绕显示看起来更像一个大水箱。\n这个模拟每小时恰好出现一分钟，如此逼真，看起来就像水要倒在穿过繁忙商业广场的人的头上一样。\n这个名为“波浪”的项目由d&#34；Strict设计，这是一家专门利用沉浸式技术创作公共艺术的公司。该项目从头到尾执行了四个月，其中包括三个月的数字设计工作，以确保达到预期的效果。\n我们希望创造压倒性的体验，d；Strict的业务发展总监李军(Jun Lee)表示。波浪本身是美丽和充满活力的，但我们选择它们作为我们的主题是因为它们唤起了舒适的感觉--这是现在非常需要的。\n社交媒体对这是放松还是压力意见不一。一位用户将它比作洗衣机的内部，而另一位用户沉思着说，它就像一片自我隔离的大海。\n屏幕尺寸为80x20米(262x66英尺)，是品牌广告、韩国流行音乐视频以及最近数字艺术装置的流行平台。\n该创意项目是d&#39；Strict为三星(Samsung)和LG等客户提供的包括商业工作和户外安装在内的产品组合中的最新成员。\n今年夏天，d&#39；Strict预计将在济州岛推出一个以艺术和科技为灵感的室内主题公园，除了其他变形空间外，还将有一个全息剧场。", "note_en": "Beachside vacations may seem like a distant memory during coronavirus lockdowns, but in Seoul&#39;s Gangnam District, the ocean has come to the city.\n  A giant wave has appeared on the LED façade of the city&#39;s SMTown COEX building, South Korea&#39;s biggest digital billboard. The anamorphic illusion rears up before crashing into the surface of the screen, making the two-dimensional wraparound display seem more like a large tank.\n Appearing for exactly one minute every hour, the simulation is so realistic it looks as if water is about to pour over the heads of people who pass through the busy commercial square.\n  Titled &#34;WAVE,&#34; the project was designed by d&#39;strict -- a firm that specializes in using immersive technology to create public art. The project took four months to execute from start to finish, including three months of digital design work to make sure it achieved the desired effect.\n &#34;We want to create overwhelming experiences,&#34; said Jun Lee, Business Development Director at d&#39;strict. &#34;Waves are beautiful and dynamic in themselves but we chose them as our subject because they evoke feelings of comfort -- which is much needed now.&#34;\n Social media split on whether it was relaxing or stressful. One user compared it to the inside of a  washing machine while another mused that it was like a  &#34;self quarantined sea.&#34;\n  The screen, measuring 80 by 20 meters (262 by 66 feet), is a popular platform for brand advertisements, K-pop videos, and more recently, digital art installations.\n The creative project is the latest addition to d&#39;strict&#39;s portfolio, which includes commercial work and outdoor installations, for clients such as Samsung and LG.\n This summer, d&#39;strict is expected to launch an art- and technology-inspired indoor theme park on Jeju Island, featuring a holographic theater among other anamorphic spaces.", "posttime": "2020-05-22 06:51:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "海浪,sweeps,屏幕", "title": "巨大的3D海浪席卷首尔江南区", "title_en": "Giant 3D wave sweeps over Seoul's Gangnam District", "transed": 1, "url": "https://www.cnn.com/style/article/3d-wave-in-seoul/index.html", "via": "", "real_tags": ["海浪", "sweeps", "屏幕"]}, {"category": "", "categoryclass": "", "imagename": "c0362738aabaae0dd047d0da564ce5ae.png", "infoid": 1003200, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇帖子是GitHubbers关于提高生产力、效率等的ProTips系列的一部分。继续阅读，了解莎拉·弗弗斯的建议。\n我每天的大部分工作时间都花在编写代码和拉请求上。我喜欢构建东西，我喜欢你们都使用它们，所以我非常有动力将我的更改带到那里！我想和你们分享一个对我很有效的过程。\n有时，我的拉取请求太大，无法轻松查看，因为我的分支相对于基本分支包含了太多更改。我更喜欢打开较小的请求，而不是强迫我的团队费力地通过一千行代码，同时试图让他们记住所有事情并发现任何问题。较小的Pull请求往往合并得更快，因为它们更容易推理，因此审查者可以轻而易举地通过并充满信心地批准，而且因为它们与基本分支冲突的机会较小。\n然而，我的大脑不会考虑小的拉动请求！我有了一个想法，我想在它溜走之前将我的想法转换成代码-在我的编辑器中以黑绿色显示出来。能够将我的特性或错误修复记录在单个分支中，这有助于我确认它是否如我预期的那样工作，并允许我测试整个系统。我可以根据使用该数据模型的UI和端点是如何组合在一起的，来验证我选择的数据模型是否是一个好的数据模型。不幸的是，这种“一个分支中的一切”的方法与我希望向我的队友提供小的、容易审查的拉请求的愿望不一致，特别是在这些分支往往会变大的情况下。\n如果我试图从一开始就将我的代码拆分成单独的分支，我常常很难知道哪些代码在哪个分支中是有意义的。我发现自己花了太多的时间考虑我是否将承诺放在了正确的分支上，而不是考虑我正在构建的功能。我感觉它也阻碍了编码的创造性过程，不得不担心将代码整齐地划分为连贯的、易于审查的分支，而不是仅仅跟随功能开发的方向。\n我通过同时做这两种方法来协调这两种方法，但要按顺序进行：在单个分支中完成我最初的工作，而不是担心它会变得多大，然后再开设新的分支来梳理出可以单独完成的更小的原子工作。我可以使用Git Cherry-Pick将我的大分支中的一些部分拉到一个非常集中的小分支中，然后从那个小分支打开一个拉回我的存储库的默认分支的请求。随着每个较小的分支被合并，当我使用基分支中的最新代码更新我原来的大分支时，diff会变得越来越小，因为它的更多更改现在已经在基分支中了。我可以根据需要重复这个过程多次，直到原来的大分支不再那么大，以至于复查起来很痛苦。\n假设我想在博客中实现分类。这可能需要：用于添加新表和字段的数据库更改、用于在数据库适配器级别验证数据的逻辑、用于支持读/写/删除类别的新端点、允许您访问这些新端点的用户界面更改，最后是用于改善用户体验的JavaScript。我实现这样一个特性的方法是创建一个类似Add-Categories的分支，并在该分支中获取所有内容。我会添加足够的测试来确认我的方法正在做我期望它们做的事情，并通过在浏览器中签出来手动验证其他所有内容。分支的目的是作为一种尖峰，一个测试平台，用来验证我的实现是否正确。我可以为这个分支打开一个拉式请求，不是请求审查，也不是要合并，而是让我的团队自己尝试，看看我正在考虑的整体方法。\n一旦我对Add-Categories分支感到满意，我将返回到存储库的默认分支并启动一个新分支。我试着考虑在我的功能分支的任何部分落地之前必须发生的最低级别、最早的更改。在本例中，是数据库更改。没有这些，端点、UI和JavaScript就无关紧要了！\n我会打开一个类似CATEGORY-db的分支，并将所有相关工作从Add-Categories拉到其中。理想情况下，当我一直在处理添加类别时，我会进行原子提交，这样我就可以运行git挑剔命令来停止数据库更改。然而，情况并不总是如此，对于那些时候，我倾向于在gihub上打开我的添加类别拉取请求，然后转到“Files Changed”选项卡，在那里我可以很容易地将文本和文件块复制到ategory-db中的新提交中。\n将更改拉到完全专用于该更改的分支中有一个很好的副作用，那就是它会带来更好的测试覆盖率。如果我试图登陆我原来的Add-Categories分支，我需要确保它对数据库验证、端点、用户界面和JavaScript功能进行了良好的测试。我经常得到的测试代码大小至少是测试代码的两倍，所以测试真的会增加拉请求的大小！我不想要那种“这个测试真的值得增加吗，它会让差异变得更大”的精神压力，当我知道整个分支非常专注，不包含完全不同的想法时，那种内部斗争就会消失。\n我把我较小的分支机构视为将由我的团队彻底审查的分支机构，因此它们得到了很多润色。全面的拉取请求描述、测试覆盖范围以及对性能和用户体验的考虑非常重要。在本例中，我最初的Add-Categories分支将作为一个草案拉入请求开始，并保持这种状态，直到我完成了从中筛选出的所有较小分支的登陆。一旦Add-Categories足够小，因为它的足够部分已经落在不同的分支中，我将完成它的测试，更新Pull请求描述以反映分支的剩余内容，最后删除它的Draft状态，这样我的团队就会被ping以供审查。\n有时，以菊花链形式连接我的拉取请求会很有帮助。在创建CATEGORY-db分支之后，我想看看还没有在CATEGORY-db中的Add-Categories中还有哪些更改。查看原来的大分支中剩下的内容将让我决定它是否足够小，可以提交给代码审查，或者是否需要从它中取出另一个小分支。要查看剩余的更改，我将编辑GitHub上的添加类别拉取请求，将其基本分支从存储库的默认分支更改为CATEGORY-db。然后，在将结果推送到gihub之前，我可以检查add-ategories分支和git合并类别-db。这将更新我的Pull请求上显示的diff，以便现在在Category-db中的所有代码不再显示在add-Categories Pull请求中。\n也许添加类别对我来说仍然太大，不能让我的团队进行审查。新的数据验证可能是我拉到他们自己的分支机构的下一个部分。在CATEGORY-DB上，我可以创建一个新分支，比如CATEGORY-VALIDATIONS。我会重复前面的过程，在可能的情况下挑选相关的提交，否则从Add-Categories的Pull Request视图中批量复制代码。一旦将类别验证推送到GitHub，我就可以打开一个拉取请求，将CATEGORY-db作为基础，将CATEGORY-VALIDATIONS作为头分支。然后，我可以再次更新我的添加类别拉入请求，以便它的基本分支现在是类别验证，而不是类别数据库。这导致了菊花链效应，其中我的分支是：Main←CATEGORY-db←CATEGORY-Valiations←Add-Categories。\n%git branchadd-Categories//添加整个类别功能Category-db//添加数据库表*CATEGORY-VALIDATIONS//添加验证逻辑+testsmaster。\n像这样链接拉取请求的另一个好处是它解除了我的阻碍。也许Category-db还不能合并，因为它描述的数据库更改还没有发生，所以我的其他分支也不能合并。通过为单独的小分支机构打开许多拉式请求，我仍然可以专注于让我的团队对每个分支机构进行全面的测试和审查。通过确保测试通过并得到批准，我可以准备好要合并的每组更改，然后当Category-db准备好合并时，我将能够在短时间内获得几个分支，因为依赖于Category-db的分支已经通过了审查过程。\n一旦我的一个较小的分支被合并，我就可以更新基于它的拉取请求，而不是基于我的存储库的默认分支。因此，当我的CATEGORY-DB分支被合并时，我更新了CATEGORY-VALIDATIONS PULL请求，使其基本分支成为主要分支。最终，所有较小的分支都合并了，我剩下的只有一个拉取请求，也就是基于默认分支的原始Add-Categories请求。只是这一次，Add-Categories是一个合理的大小，我可以要求我的团队进行审查。至此，Add-Categories可能已经更改\n通过让我自己专注于用代码表达我的想法，而不是关注如何整洁地组织我的分支的具体细节，我能够更快地开发特性。通过稍后将一个大的特性分支拆分成许多较小的分支，我帮助我的团队确保我们正在合并经过良好审查的代码，并且我能够单独关注每个部分，以确保它经过了充分的测试。通过使用Git的分支和GitHub的Pull请求，我能够将这两种技术结合起来，有望改进为我和我的团队构建特性的过程。\n你在GitHub上有没有让你的日常生活更轻松的小贴士、小窍门或小窍门？请使用#GitHubProTips在社交媒体上与我们分享。", "note_en": "This post is a part of a series featuring protips from GitHubbers for improving productivity, efficiency, and more. Continue reading to learn about Sarah Vessels’s protips.\n  I spend most of my work day in code and pull requests. I like to build things and I like for y’all to use them, so I’m very motivated to get my changes out there! I want to share a process with you that’s worked well for me.\n Sometimes my pull requests get too big to easily review because my branch includes too many changes relative to the base branch. Instead of forcing my team to slog through a thousand lines of code, while trying to keep everything in their head and spot any problems, I prefer to open smaller pull requests. Smaller pull requests tend to merge faster, because they’re easier to reason about, so reviewers can breeze through and approve with confidence, and because they have less chance of conflicting with the base branch.\n However, my brain doesn’t think in terms of small pull requests! I get an idea, and I want to translate my idea to code before it slips away—get it all out in black-and-green in my editor. Being able to get my feature or bug fix written down in a single branch helps me confirm that it works as I expect and allows me to test the system as a whole. I can verify that the data model I’ve chosen is a good one based on how the UI and endpoints that use that data model come together. This everything-in-one-branch approach, unfortunately, is at odds with my desire to present my teammates with small, easily reviewable pull requests, especially as these branches tend to grow large.\n If I try to split my code into separate branches from the beginning, I often struggle with knowing which code makes sense in which branch. I find myself spending too much time thinking about whether I’m putting a commit in the right branch rather than thinking about the feature I’m building. I feel like it hinders the creative process of coding, too, having to worry about neatly dividing code into coherent, easy-to-review branches rather than just going with the flow of where feature development takes me.\n I reconcile the two approaches by doing them both, but sequentially: do my original work in a single branch, not worrying about how large it gets, and later open new branches to tease out smaller, atomic bits of work that can land separately. I can use  git cherry-pick to pull bits of my large branch into a very focused smaller branch, then open a pull request from that smaller branch back to the default branch of my repository. As each smaller branch gets merged, when I update my original large branch with the latest code from the base, the diff gets smaller and smaller, because more of its changes are now already in the base branch. I can repeat this process as many times as necessary until the original large branch is no longer so large that it’s a pain to review.\n  Say I want to implement categories in a blog. That might require: a database change to add a new table and field, logic to validate data at the database-adapter level, new endpoints to support reading/writing/deleting categories, user interface changes to allow you to hit those new endpoints, and finally JavaScript to improve the user experience. My approach to implementing such a feature would be to make a branch like  add-categories and get everything out in that branch. I would add just enough tests to confirm my methods are doing what I expect them to do, and verify everything else manually by checking things out in the browser. The branch would be intended as a kind of spike, a test bed to verify that my implementation is the right one. I could open a pull request for this branch, not to solicit reviews and not to be merged yet, but to let my team try things out themselves, and to see the overall approach that I’m thinking about.\n Once I’m happy with my  add-categories branch, I’ll go back to the default branch of my repository and start a new branch. I try to think about the most low-level, early change that has to happen before any part of my feature branch can land. In this example, it’s the database changes. Without those, the endpoints and the UI and the JavaScript don’t matter!\n I would open a branch like  category-db and pull all the relevant work from  add-categories into it. Ideally, while I had been working in  add-categories, I would have made atomic commits such that I could run  git cherry-pick commands to pull over just the database changes. That’s not always the case, though, and for those times, I tend to open my  add-categories pull request on GitHub and go to the “Files changed” tab, where I can easily copy chunks of text and files to paste into new commits in  category-db.\n One nice side effect of pulling out changes into branches that are dedicated entirely to that change is that it leads to better test coverage. If I were trying to land my original  add-categories branch, I would need to ensure it has good testing for the database validations, endpoints, user interface, and JavaScript functionality. I often end up with test code that is at least double the size of the code it’s testing, so tests really increase the size of a pull request! I don’t want that mental pressure of “is this test really worth adding, it’s going to make the diff so much bigger,” and that internal struggle goes away when I know the entire branch is very focused and doesn’t contain disparate ideas.\n I treat my smaller branches as the ones that are going to be reviewed thoroughly by my team, so they get lots of polish. Thorough pull request description, test coverage, as well as consideration for performance and user experience are important. My original  add-categories branch, in this example, would start as a  draft pull request and stay that way until I finished landing all the smaller branches that I teased out of it. Once  add-categories is small enough, because enough of its parts have landed in separate branches, I would round out its tests, update the pull request description to reflect the remaining contents of the branch, and finally drop its draft status so my team gets pinged for review.\n  Sometimes it can be helpful to “daisy-chain” my pull requests. After creating my  category-db branch, I like to see what changes remain in  add-categories that aren’t already in  category-db. Seeing what’s left in the original big branch will let me decide if it’s sufficiently small to submit it for code review, or if I need to pull out another small branch from it. To view the remaining changes it has, I would edit my  add-categories pull request on GitHub to change its base branch from the default branch of my repository to  category-db instead. Then I can check out the  add-categories branch and  git merge category-db before pushing the result up to GitHub. That updates the diff shown on my pull request such that all the code that’s now in  category-db no longer shows in the  add-categories pull request.\n Maybe  add-categories is still too large for me to be comfortable asking my team for review. The new data validations might be the next part I pull out to their own branch. While on  category-db, I could create a new branch, say  category-validations. I would repeat the process of before, cherry-picking relevant commits where possible, copying code wholesale from the pull request view of  add-categories otherwise. Once  category-validations has been pushed to GitHub, I can open a pull request with  category-db as the base and  category-validations as the head branch. Then I can once again update my  add-categories pull request so that its base branch is now  category-validations instead of  category-db. This results in a daisy-chain effect where my branches are:  main ←  category-db ←  category-validations ←  add-categories.\n % git branchadd-categories // adds the whole categories featurecategory-db // adds database table* category-validations // adds validation logic + testsmaster\n Another benefit of chaining pull requests like this is that it unblocks me. Maybe  category-db can’t be merged yet because the database change it describes hasn’t happened, so none of my other branches can be merged either. By opening many pull requests for separate small branches, I can still focus on getting each branch fully tested and reviewed by my team. I can get each set of changes ready to merge by making sure tests pass and they’ve been approved, then when  category-db is ready to merge, I’ll be able to land several branches in short order since the branches depending on  category-db have already gone through the review process.\n Once one of my smaller branches gets merged, I can update the pull request(s) that are based on it to instead be based on the default branch of my repository. So when my  category-db branch is merged, I update my  category-validations pull request so its base branch is the primary. Eventually, all the smaller branches have merged and all I have left is a single pull request again, the original  add-categories, based on the default branch. Only this time,  add-categories is a reasonable size for me to ask for review from my team. By this point,  add-categories has probably changed its purpose. Instead of adding the entire category feature, it may only be adding the finishing JavaScript touches to improve the user experience. I would update the pull request description to reflect this.\n  By letting myself focus on expressing my ideas in code, and not focusing on the nitty-gritty details of how to neatly organize my branches, I’m able to develop a feature more quickly. By later splitting a large feature branch into many smaller branches, I help my team ensure we’re merging well-reviewed code, and I’m able to give individual attention to each piece to make sure it’s fully tested. Using git’s branches and GitHub’s pull requests, I’m able to marry the two techniques to hopefully improve the process of building out a feature for both myself and my team.\n  Do you have a tip, trick, or hack that makes your daily life easier on GitHub? Share it with us on social media with  #GitHubProtips.", "posttime": "2020-05-22 06:51:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "github,黑客,protips,分支", "title": "GitHub ProTips-来自Sarah Vehicles的提示、技巧、黑客和秘密", "title_en": "GitHub Protips- Tips, tricks, hacks, and secrets from Sarah Vessels", "transed": 1, "url": "https://github.blog/2020-05-21-github-protips-tips-tricks-hacks-and-secrets-from-sarah-vessels/", "via": "", "real_tags": ["github", "黑客", "protips", "分支"]}, {"category": "", "categoryclass": "", "imagename": "28a2033deba6240907277c89059259ed.jpg", "infoid": 1003199, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "昨天T-Mobile开玩笑说它今天将有一个新的非运营商公告，现在我们确切地知道是什么了。\nT-Mobile已经正式推出了Connecting Heroes，这是它去年首次宣布的一项倡议，作为其与Sprint合并的一部分。有了它，T-Mobile承诺在10年内为急救人员提供免费无线服务，T-Mo估计，如果所有的急救机构都签约，这将节省77亿美元。\nConnecting Heroes将为急救人员提供无限的通话、文本和智能手机数据。这包括免费的5G接入，以及1 GB的4G LTE移动热点数据，以及之后的3G速度。包括480p的流媒体视频，以及在美国、加拿大和墨西哥之间提供无限制通话和短信的Mobile Without Borders。\n急救人员可以选择升级他们的计划，每月15美元，获得20 GB的移动热点使用，无限制的短信和210+个国家和目的地的高达256Kbps的数据，外加通过Gogo的免费短信和飞行Wi-Fi。\nT-Mobile的“连接英雄”倡议对每个公共和非营利性组织、州和地方警察、消防和EMS急救人员都是开放的。如果您觉得符合条件，您可以在这里了解更多信息并开始注册过程。\n第一反应人员在正常情况下很重要，但在冠状病毒大流行期间尤其重要。由于我们中的许多人都在原地避难以抗击冠状病毒的传播，急救人员正在世界各地保护我们，冒着感染疾病的风险来保护我们所有人的安全。“连接英雄”计划是对此表示感谢的一种方式，很高兴看到T-Mo将使宣传活动持续10年，而不是更短的时间，比如直到大流行结束或类似的时候。“连接英雄”计划是对他们表示感谢的一种方式，看到T-Mo将把宣传持续10年，而不是更短的时间，比如流行病结束或类似的时候。", "note_en": "Yesterday T-Mobile teased that  it would have a new Un-carrier announcement for today, and now we know exactly what that is.\n T-Mobile has  officially launched Connecting Heroes, the initiative  it first announced last year as part of its merger with Sprint. With it, T-Mobile has pledged to give free wireless service to first responders over 10 years, which T-Mo estimates could save $7.7 billion if all first responder agencies sign up.\n Connecting Heroes will give unlimited talk, text, and smartphone data to first responders. That includes 5G access at no extra charge as well as 1GB of 4G LTE mobile hotspot data plus 3G speeds after that. Streaming video at 480p is included, as is Mobile Without Borders which offers unlimited calling and texting between the US, Canada, and Mexico.\n First responders can choose to upgrade their plan for $15 per month and get 20GB of mobile hotspot usage, unlimited texting and up to 256Kbps data in 210+ countries and destinations, plus free texting and in-flight Wi-Fi through Gogo.\n T-Mobile&#39;s Connecting Heroes initiative is open to every public and non-profit, state and local police, fire, and EMS first responders. If you feel that you qualify,  you can learn more and begin the signup process right here.\n First responders are important during normal times, but they&#39;re especially important during the coronavirus pandemic. As many of us are sheltering in place to fight the spread of COVID-19, first responders are out in the world protecting us and taking a risk that they might catch the disease to keep us all safe. The Connecting Heroes initiative is a way to thank them for that, and it&#39;s good to see that T-Mo will keep the promo running for 10 years rather than a shorter period, like through the end of the pandemic or something like that.", "posttime": "2020-05-22 06:36:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "免费,5g,互联,connecting,mobile", "title": "T-Mobile互联英雄现已上线，首批响应者获得免费5G服务", "title_en": "T-Mobile Connecting Heroes Now Live, First Responders Get Free 5G Service", "transed": 1, "url": "https://www.phonedog.com/2020/05/21/t-mobile-connecting-heroes-free-unlimited-5g-first-responders", "via": "", "real_tags": ["免费", "5g", "互联", "mobile"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003198, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "面向开发人员的实验性搜索引擎。搜索网络的精选子集：官方文档和社区驱动的资源。没有JS、Cookie、跟踪、外部请求或数据收集。", "note_en": "Experimental search engine for developers. Searches a curated subset of the web: official docs and community-driven sources. No JS, cookies, tracking, external requests or data collecting.", "posttime": "2020-05-22 06:17:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,面向,search,数据", "title": "Quickref-面向开发人员的搜索引擎", "title_en": "Quickref – A Search Engine for Developers", "transed": 1, "url": "https://quickref.dev/", "via": "", "real_tags": ["开发", "面向", "search", "数据"]}, {"category": "", "categoryclass": "", "imagename": "45075812a64d7d1f32eee6772c8b7b44.jpg", "infoid": 1003197, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们对下雪有一定的预期。我们通常认为它会是白色的，但在南极洲沿海的部分地区，雪呈现出一种奇怪的亮绿色阴影。随着气候变暖对冰原的影响，我们可能会更多地看到这种颜色。\n南极洲不会变成巨型玛格丽塔。绿色是由微小的雪藻大量繁殖引起的。这些花朵覆盖了如此多的土地，以至于可以被卫星观测到。\n由英国剑桥大学和英国南极调查局的研究人员领导的一个团队利用卫星数据和实地观察绘制了绿藻地图，并预测了令人不安的绿色雪的未来增长。周三，他们在《自然·通讯》杂志上发表了他们的研究成果。\n绿色的雪沿着海岸出现。剑桥大学在周三的一份新闻稿中说，它们生长在较温暖的地区，那里的平均气温在南半球夏季的11月至2月略高于零摄氏度。\n附近的企鹅群似乎对藻类的繁殖起到了推动作用。我们最近了解到企鹅粪便会给科学家带来笑气问题。它还可以滋养藻类的生长。\n气候变化看起来将无意间影响到南极雪地的绿化。这篇论文的主要作者、剑桥大学植物学家安德鲁·格雷说，随着南极洲变暖，我们预测雪藻的总量将会增加，因为向地势更高的地方扩散将大大超过小岛上藻类斑块的损失。\n科学家们不仅仅是看到绿色。南极洲的部分地区看起来像一道彩虹。研究人员打算扩大他们的研究范围，将促成这一多彩景观的红色和橙色藻类水华包括在内。“白雪公主”不是。\n尊重他人，保持文明礼貌，不离题。我们删除违反我们政策的评论，我们鼓励您阅读这些评论。我们可以随时关闭讨论线程。", "note_en": "We have certain expectations of snow. We generally think it will be white, but in parts of coastal Antarctica the snow takes on a bizarre shade of bright green. It&#39;s a color we may be seeing more of as a   warming climate impacts the land of ice.\n Antarctica isn&#39;t turning into a giant margarita. The green is caused by blooms of microscopic snow algae. The blooms cover so much ground they can be observed by satellites.\n  A team led by researchers at the University of Cambridge in the UK and the British Antarctic Survey used satellite data and fieldwork observations to create a map of the green algae and predict future growth of the disconcerting green snow. They  published their work in the journal Nature Communications on Wednesday.\n The green snow appears along the coast. &#34;They grow in &#39;warmer&#39; areas, where average temperatures are just above zero degrees Celsius during the austral summer -- the Southern Hemisphere&#39;s summer months of November to February,&#34;  said the University of Cambridge in a release on Wednesday.\n  Nearby penguin colonies appear to play into the algal blooms. We recently learned   penguin feces can cause laughing-gas problems for scientists. It can also feed the growth of algae.\n Climate change looks like it will play into the inadvertent &#34;greening&#34; of Antarctic snow. &#34;As Antarctica warms, we predict the overall mass of snow algae will increase, as the spread to higher ground will significantly outweigh the loss of small island patches of algae,&#34;  said University of Cambridge plant scientist Andrew Gray, lead author of the paper.\n Scientists aren&#39;t just seeing green. Parts of Antarctica look like a rainbow. The researchers intend to expand their studies to include red and orange algal blooms that contribute to this multi-colored landscape. &#34;Snow white&#34; it isn&#39;t.\n  Be respectful, keep it civil and stay on topic. We delete comments that violate  our policy, which we encourage you to read. Discussion threads can be closed at any time at our discretion.", "posttime": "2020-05-22 06:17:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "南极洲,weird,藻类", "title": "由于气候变化，南极洲奇怪的绿色积雪将蔓延", "title_en": "Antarctica's weird green snow set to spread due to climate change", "transed": 1, "url": "https://www.cnet.com/news/antarcticas-weird-green-snow-set-to-spread-due-to-climate-change/", "via": "", "real_tags": ["南极洲", "weird", "藻类"]}, {"category": "", "categoryclass": "", "imagename": "0a4b49c1642b887877f2d42c17c5e56f.jpg", "infoid": 1003196, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大米可以改变经济，省去一顿乏味的饭菜，还可以阻止冬季的吃水。有一件事它绝对、肯定做不到，那就是拯救一部湿了的手机。事实上，将手机浸泡在大米中会让问题变得更糟，特别是如果手机还在开机的话。\n和我们一起说：大米是一种食物，而不是一种工具。饭吃得好，电话饭吃得不好。\n好的，你还在这里，很好。让我们深入研究一下，为什么在你的手机湿了之后，直接把米饭、猫砂或干衣袋浸泡在水里，对你浸泡的手机没有任何帮助。\n在修复现代电子产品的水损坏方面，没有比iPad Rehab Repair服务公司的所有者杰莎·琼斯(Jessa Jones)更高的权威了。杰莎的整个维修生涯始于一部被幼儿困在马桶里的iPhone，后来被大锤解救出来。这让她下了一长串的兔子洞，到了现在她是水损坏和微焊专家的地方。琼斯在这个网站上写了一个维基指南来解开米饭和水的迷思，这是一个开始破解这个迷思的好地方：\n当手机碰到水时，腐蚀是瞬间发生的。有时腐蚀会击中重要部件，有时不会。如果我们拒绝打开手机，直到它在柜台上、米袋里或其他任何地方都干了，有时我们就会走运。如果我们把手机放在米袋里，我们认为是大米救了手机。但它没有！即使手机看起来正常工作，它也会有氧化的焊点，这些焊点会变得脆弱易碎。腐蚀将继续在手机内部蔓延。我们什么也没做，只是经历了暂时的运气。\n继续往下读，琼斯给出了真正的解决方案：拆卸手机，将其浸泡在酒精中，以置换水并松开少量腐蚀，然后擦洗。我们已经在一份指南中详细介绍了整个水毁修复程序。以下是简短的项目符号版本(如果您现在手持积水的手机，请阅读完整的指南，这是绝对不能依赖的)：\n如果你可以取下手机的电池，并且你可以看到它已经暴露在水中，那么就取下并更换电池。\n卸下逻辑板和其他似乎已腐蚀的部件(相机和显示器除外)，并将其浸泡在90%异丙醇中。\n这不是一个简短、简单的过程。此外，如果您的设备已经以某种方式防水，您可以通过打开它来破坏其密封性。如果你没有办法或时间来完成这个程序，或者付钱给有资质的维修店来做，你可以干脆把手机放在外面晾干，尽可能多地打开和暴露。\n简单地将设备晾晒出来就行了吗？比你想象的要好，而且肯定比米饭好。二手设备经销商Gazelle在2014年进行了一次手机浸泡测试，将一块湿海绵浸入七种材料中，并将其留在户外。\n在我们测试的七种选择中，干的、未煮熟的常规大米是最差的。它在24小时内吸收的水分最少，输给了硅胶、猫砂、粗麦粉、速溶燕麦片、经典燕麦片和方便米饭。\n瞪羚注意到，留在露天的海绵实际上最干燥，因此建议打开手机，在空气中烘干它的部件可能是最好的解决方案。这至少比大米更准确。\n“但你是iFixit，”你可能会说，“所以你偏向于把东西拆开，然后用铲子戳东西。”但我们远不是唯一一家试图反驳神奇大米的连锁电子邮件逻辑的出版物。你可以从“今日美国”、ZDNet、Fast Company和CNET找到最新的大米反驳。\nThe Verge至少追溯到了1946年，当时人们建议将大米、茶叶或牛皮纸作为保持相机设备干燥的一种临时方法，如果硅胶干燥剂不方便的话，可以将大米作为湿气修复神话的历史。“边缘报”(The Verge)至少可以追溯到1946年，当时人们建议用大米、茶叶或牛皮纸作为保持相机设备干燥的临时方法。2007年6月，“华盛顿邮报”的一名记者提出了这个想法，当时他把一部黑莓手机浸泡在马桶里，把它放在大米里，而手机并没有被毁掉(两者之间没有相关性)。他为这篇论文写了这篇文章，然后生产力博客Lifehacker发布了许多很多建议中的第一个，即大米和其他干货可以修复湿式电话。\n为了充分地、直截了当地披露信息，我和两名iFixit撰稿人之前曾为Lifehacker工作。我们中的一些人在帖子中写下了这个神话，或者把它告诉了朋友。我们知道，提出一种新石器时代的谷物作为先进技术问题的解决方案是多么有吸引力。我们很抱歉。\n让我告诉你，自从那些“米饭可能行得通！”以来，我已经走了多远！几天。几个月前，我带了一台Pixel C(一款完全被忽略的安卓平板电脑)去参加一个大会。我把它装进一个背包里，那个背包里还有一个水瓶。水瓶的盖子是一个复杂的锁东西。Pixel C几乎在每一面都有入口：麦克风、充电端口、扬声器。水进了屏幕，导致显示屏熄灭，或者至少是它的背光熄灭了(在明亮的灯光下，你可以非常微弱地看到界面)。\n几天前，我终于通过更换显示器修复了C。在这样做的过程中，我发现了水进入显示器的位置，以及它对显示控制器板造成的损坏。大米是如何从平板电脑内部粘合得很厉害的外部用真空吸回水分的呢？大米能扭转H2O造成的短路和电路损坏吗？\n我意识到，尽管这篇帖子明确反对在大米中放手机，但在某种程度上，我正在为将“湿手机”和“大米”捆绑在一起的网络搜索结果做出贡献。事情就是这样的。我们所能做的就是告诉像你这样的人，大米是一种食物，而不是一种工具，并请你把它传下去。当然，还要主动帮助人们真正修好手机。", "note_en": "Rice can transform an economy,  save a boring meal, and  stop winter drafts. One thing it absolutely, positively cannot do is save a wet cell phone. In fact, submerging your phone in rice makes the problem worse, especially if it’s still powered on.\n Say it with us:  Rice is a food, not a tool. Food rice good, phone rice bad.\n Okay, you’re still here, good. Let us delve into why submerging your phone rice—or kitty litter, or dessicant packets—right after it gets wet can’t do anything for your soaked phone.\n  There is no higher authority on repairing water damage to modern electronics than Jessa Jones, owner of  iPad Rehab repair service. Jessa’s entire repair career started with an iPhone trapped in a toilet by toddlers, freed by a sledgehammer. That led her down a long series of rabbit holes, to where she’s now a water damage and microsoldering expert. Jones wrote a wiki  guide to the rice-fixes-water myth on this very site, and it’s a good place to start busting the myth:\n Corrosion is instant when a phone hits water. Sometimes the corrosion hits important components, sometimes not. If we resist turning the phone on until it dries on the counter, in the rice bag, or anywhere else, sometimes we get lucky. If we had the phone in the rice bag, we  think the rice saved the phone. But it didn’t! Even if the phone seems to be working, it will have oxidized solder joints that are weakened and brittle. Corrosion will continue to spread inside the phone. We have done nothing but experienced temporary luck.\n  Read on and Jones gives the real solution: disassemble the phone, immerse it in alcohol to displace water and loosen bits of corrosion, and scrub. We’ve  detailed the entire water-damage repair procedure in a guide. Here’s the short, bulleted version (that you absolutely cannot rely on if you’re holding a water-logged phone right now, please  read the full guide):\n If you can remove your phone’s battery, and you can see it’s been exposed to water, remove and  replace the battery\n Remove the logic board and other parts that appear corroded (except the camera and display) and immerse them in 90% isopropyl alcohol.\n That’s not a short, easy procedure. Also, if your device is already waterproofed in some way, you can compromise its sealing by opening it up. If you don’t have the means or time to run through this procedure, or pay a qualified repair shop to do it, you can simply leave your phone out to dry, opened up and exposed as much as possible.\n  Will simply airing out the device work? Better than you think, and better than rice, for sure. Used-device reseller  Gazelle ran a phone soak test in 2014, immersing a wet sponge inside seven materials, as well as leaving it out in open air.\n Dry, uncooked conventional rice was the worst of the seven options we tested. It absorbed the least water in 24 hours, losing out to silica gel, cat litter, couscous, instant oatmeal, classic oatmeal and instant rice.\n Gazelle noted that the sponge left in open air actually dried the most, and so suggests that opening up a phone and drying its parts in air might be the best solution. Which is, at least, more correct than rice.\n “But you’re iFixit,” you might say, “so you’re biased in favor of tearing stuff apart and poking things with spudgers.” But we’re far from the only publication out there trying to counter the chain-email logic of magic rice. You can find latter-day rice rebuttals from  USA Today,  ZDNet,  Fast Company, and  CNET.\n The Verge tracked  the history of the rice-as-moisture-fix myth back to at least 1946, when rice, tea, or brown paper were suggested as a make-do way to keep camera equipment dry, if silica dessicant wasn’t handy. The idea was boosted by  a Washington Post reporter in June 2007, when he toilet-dunked a BlackBerry, put it in rice, and (with no correlation between the two) the phone wasn’t ruined. He wrote it up for the paper, and then productivity blog  Lifehacker posted the first of  many, many suggestions that rice and other dry goods could fix a wet phone.\n  In the interest of full, staring-at-the-floor disclosure, I and two iFixit writers previously worked for Lifehacker. Some of us wrote this myth in posts, or told friends about it. We know how appealing it is to suggest  a grain from the Neolithic era as the solution to an advanced technology problem. We’re sorry.\n Let me show you how far I’ve come since those “Rice might work!” days. I brought a Pixel C (an entirely ignored Android tablet) with me on a trip to a convention a few months back. I loaded it into a backpack, and that backpack also had a water bottle in it. The water bottle’s lid was a complicated locking thing. The Pixel C has a means of ingress on nearly every side: microphones, charging ports, speakers. Water got in, and killed the display, or at least its backlight (you could ever-so-faintly see the interface under bright lights).\n I finally got to fixing the C by replacing its display the other day. In doing so, I found where the water had gotten into the display, and the damage it had done to the display controller board. How would rice have been able to vacuum water back from outside the heavily glued insides of a tablet? Would rice have been able to reverse the short-circuiting and circuit damage wreaked by H2O?\n  I realize that, even with this post that is explicitly against putting phones in rice, I am contributing, in some way, to web search results that tie “wet phone” and “rice.” That’s just the way it is. All we can do is tell people like you that  rice is a food, not a tool, and ask you to pass it on. And, of course, offer to help people really fix their phone.", "posttime": "2020-05-22 06:16:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "用来,dinner,手机", "title": "米饭是用来吃饭的，不是用来修理的", "title_en": "Rice Is for Dinner, Not Repair", "transed": 1, "url": "https://www.ifixit.com/News/30047/rice-is-for-dinner-not-repair", "via": "", "real_tags": ["用来", "dinner", "手机"]}, {"category": "", "categoryclass": "", "imagename": "2d4602d5e5607de1290f2fb693d504ee.jpg", "infoid": 1003194, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "运动员、奶牛都有严格的营养要求。“如果你稍微增加了蛋白质，或者减少了碳水化合物，你会看到牛奶产量下降，”基南系统公司的老板罗比·沃克(Robbie Walker)说。基南系统公司是一家生产饲料混合马车的爱尔兰公司。\n出于这个原因，该公司的最新产品已经数字化。在美国大型芯片制造商英特尔的帮助下，基南已经开发出一种可以连接到马车上的计算机。每天，该公司的营养师都会将牛群的饮食需求输入电脑。马车上的传感器称农民放入搅拌机的东西，并将其与食谱要求的东西进行比较。“这有点像做蛋糕，”沃克说。即使你很小心，你通常也会在一种配料中放得稍微多一点，或者另一种配料放得不够。\n收集到的数据通过移动电话网络传输给营养学家，营养学家可以分析任何偏离理想的动物喂养情况。一个大的偏差会触发一条短信给农民。较小的被注意到了，第二天的饲料组合进行了调整，以纠正任何可能悄悄进入的营养不足。\n基南并不是唯一一家试图将养牛电脑化的公司。另一家爱尔兰公司卡恩萨斯是希望利用计算机视觉来提高农家庭院生产率的几家初创公司之一。它使用摄像机跟踪牛舍和田野中的奶牛，依靠机器学习来分析图像。该公司老板大卫·亨特(David Hunt)说，这项技术足够敏感，可以追踪单个动物，如果一头牛没有在应该喂食的时候喂食，或者移动的方式表明它可能生病了，就会提醒农民。\n他说，目前，该公司主要致力于弗里斯安奶牛和荷斯坦奶牛，它们独特的标记“意味着它们基本上是行走的密码”，尽管他希望最终能扩展到其他品种。这项技术运作良好，足以说服嘉吉(Cargill)在2018年收购卡恩萨斯的少数股权。嘉吉是一家专注于农业的企业集团，也是美国最大的私营公司。\n另一种方法是将传感器放入奶牛体内。一家名为sma tec的奥地利公司已经开发出一种可以吞咽的传感器。它安置在网状结构内，这是牛的四个胃之一，在动物的余生中一直呆在那里，监测体温、运动和胃酸，并在牛靠近无线探测器时上传结果。\nsma tec的联合创始人斯特凡罗森克兰兹(Stefan Rosenkranz)说，当输入到机器学习算法中时，这些数据可以用来做各种事情。他们可以检测到动物何时处于发情期，并在产犊发生前15小时发现早期迹象。它们可以在疾病变得对人类观察者明显之前几天就能识别出来，从而可以及早治疗，抗生素的使用量减少了15%-30%。定于明年推出的一款新传感器将增加监测消化的能力。罗森克兰兹表示，销售额每年都在翻一番。世界上有2.78亿头奶牛，客户并不短缺。\n本文发表在印刷版的“技术季刊”栏目，标题为“明天的奶牛”。", "note_en": "L  athletes, dairy cows have exacting nutritional requirements. “If you’re slightly up on protein, or down on carbs, you’ll see a drop in milk production,” says Robbie Walker, the boss of Keenan Systems, an Irish firm which makes feed-mixing wagons.\n For that reason, the firm’s latest products have gone digital. With the help of Intel, a big American chipmaker, Keenan has developed a computer that can be attached to its wagons. Every day the firm’s nutritionists load the computer with the herd’s dietary requirements. Sensors on the wagon weigh what the farmer puts into the mixer and compare it with what the recipe calls for. “It’s a bit like making a cake,” says Mr Walker. “Even if you’re being careful, you usually put in a little too much of one ingredient, or not enough of another.”\n  The collected data are transmitted over the mobile-phone network to the nutritionists, who can analyse any deviations from the ideal in what the animals were fed. A big deviation triggers a text message to the farmer. Smaller ones are noted, and the feed mix for the following day tweaked to correct any nutritional deficits that might have crept in.\n Keenan is not the only firm trying to computerise cattle-farming. Cainthus, another Irish company, is one of several startups hoping to use computer vision to boost farmyard productivity. It uses cameras to track cows in barns and fields, relying on machine learning to analyse the images. The technology is sensitive enough, says David Hunt, the firm’s boss, to track individual animals, and to alert farmers if a cow is not feeding when it should be, or moving in a way that suggests it might be sick.\n For now, he says, the company is working mainly on Friesian and Holstein cows, whose distinctive markings “mean they’re basically walking   codes”, though he hopes to expand to other breeds eventually. The technology works well enough to have persuaded Cargill, an agriculture-focused conglomerate and America’s largest private company, to take a minority stake in Cainthus in 2018.\n An alternative approach is to put the sensors inside the cows themselves. An Austrian firm called sma tec has developed a sensor that can be swallowed. It lodges inside the reticulum, one of a cow’s four stomachs, and stays there for the rest of the animal’s life, monitoring body temperature, movement and stomach acidity, and uploading the results when the cow is near a wireless detector.\n When fed to machine-learning algorithms, says Stefan Rosenkranz, sma tec’s co-founder, those data can be used for all kinds of things. They can detect when animals are in heat, and spot the early signs of calving up to 15 hours before it happens. They can identify diseases several days before they become obvious to human observers, allowing early treatment and a 15-30% drop in antibiotic use. A new sensor, due out next year, will add the ability to monitor digestion. Sales are doubling every year, says Mr Rosenkranz. And with 278m dairy cows in the world, there is no shortage of customers.\n  This article appeared in the Technology Quarterly section of the print edition under the headline &#34;The cow of tomorrow&#34;", "posttime": "2020-05-22 05:48:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,ai", "title": "传感器和人工智能正在寻找进入谷仓的路", "title_en": "Sensors and AI are finding their way into the barnyard", "transed": 1, "url": "https://www.economist.com/technology-quarterly/2019/09/12/sensors-and-ai-are-finding-their-way-into-the-barnyard", "via": "", "real_tags": ["人工智能", "ai"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003193, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "开始30天免费试用", "note_en": "Start 30-day free trial", "posttime": "2020-05-22 05:48:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,自定义,customizable,免费", "title": "Marvin-可自定义的任务管理器和日常计划程序", "title_en": "Marvin – Customizable Task Manager and Daily Planner", "transed": 1, "url": "https://amazingmarvin.com/", "via": "", "real_tags": ["程序", "自定义", "免费"]}, {"category": "", "categoryclass": "", "imagename": "39e7bcf1014cb68868dc5641420a54df.png", "infoid": 1003192, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你刚开始工作或在家上学，远程方法可能会给你做事的方式带来很大的转变。Firefox有许多浏览器扩展，它们可能有助于使#WFH转换更容易、更高效。\n如果您的工作通常意味着要为文档、电子表格、网站等提供大量打开的选项卡，则可以使用选项卡管理器。这三个流行的选项卡扩展提供了重新思考和重组选项卡的独特创意方式：\n树状样式选项卡：收集选项卡并将其嵌套到树状样式的组中，这些组可以进行分支和折叠，以保持浏览器窗口的整洁。\n简单选项卡组：将选项卡分组到您创建的集合中，这些集合将保持隐藏状态，而不是使浏览器窗口变得杂乱无章，直到您需要它们为止。\n猫：轻松管理多个浏览器窗口和选项卡。此扩展可以帮助您在选项卡和窗口上快速打开、关闭、移动、固定和执行许多其他操作。您甚至可以只需单击一下即可保存所有窗口和选项卡以备以后使用。\n书签是指向网页的链接，可以方便地返回到您喜欢的地方。要为页面添加书签，只需单击地址栏中的星号即可。当页面被添加书签时，星号将变为蓝色，并且会弹出一个窗口，以便您可以命名、移动或标记您的书签。[阅读有关Firefox浏览器书签的更多信息。]。这两个Firefox浏览器扩展可以帮助你成为更好的书签。\n默认书签文件夹提供了一种将网页保存到各种书签文件夹的简单方法。方便地将您的工作内容和个人内容分开。\n如果您想要组织对浏览器中敏感信息的快速访问，私有书签将派上用场。\n||如何从Google Chrome切换到Firefox，并随身携带书签。××。\n额外提示：如果你在多台电脑上工作，Firefox账户可以让你在所有设备上同步数据和首选项(如书签、历史记录、密码、打开的标签和已安装的附加组件)。\n当你在家工作时，你自然会通过电子邮件、聊天系统、数字文档和其他在线渠道进行更多的交流。\nLanguageTool会自动检查你在网络上写的任何地方的拼写和语法错误，并建议使用25种以上的语言进行编辑。\n您有没有尝试过定制鼠标手势(您为鼠标定义的特定动作)以获得更高的导航机动性和效率？使用“抓取拖动”和“动量滚动”等强大功能快速浏览页面。以下是三个优秀的鼠标手势扩展-每个扩展都有不同的优势：\nGesturefy：这个带有各种不同命令的可定制鼠标手势扩展通过鼠标手势更快地导航、操作和浏览。\nScrollAnywhere：使用鼠标中键(或右键/左键)拖动滚动条，而不实际接触滚动条。您还可以将行为更改为“抓取并拖动”样式。\nFoxGestures：使用手势库或定义自己的手势库，为鼠标设计动作以处理许多浏览器任务。\n如果电脑屏幕持续明亮的眩光让你的眼睛疲惫不堪，这些扩展可以让你的眼睛休息一下。使用可视化自定义扩展更改整个Internet的配色方案：\n午夜蜥蜴：使用自定义配色方案(如夜间模式、黑暗主题、蓝光滤镜、屏幕着色器、高对比度、灰度等)重新设置网站皮肤。\n深色背景和浅色文本：使每个网页(或只是您想要的页面)在深色背景上显示浅色文本。所有的颜色变化都是完全可定制的。\n额外提示：尝试使用Firefox浏览器主题来改变您的数字装饰。从数以千计的主题中进行选择，给Firefox提供您想要的外观，并随时将其换成新的。\n在家工作需要一定的纪律，否则你可能会模糊专业家务活和家务活之间的界限，更不用说休闲时间了。\n番茄时钟是一个简单的时间管理工具，通过给自己分配严格的工作和休息时间间隔，帮助你保持工作状态。\nImpact Blocker在这里是为了让你远离那些令人分心的、时间链接的网站。只要输入任何让你分心的网站地址，分机就会屏蔽它，直到你自己指定的工作时间之后。\n试试这六个Firefox浏览器扩展，让你的浏览器中的视频和音乐流媒体效果更好。", "note_en": "If you are newly working or going to school from home, the remote approach can be a big shift in how to get things done. Firefox has a number of browser extensions that might help make the #WFH transition a little easier and more productive.\n   If your work typically means having a large number of open tabs for documents, spreadsheets, sites, etc,  tab organizers are here for you. These three popular tab extensions offer uniquely creative ways to re-think and reorganize tabs:\n Tree Style Tab: Collect and nest your tabs into tree-style groups that can be branched and collapsed to keep your browser window tidy.\n Simple Tab Groups: Group your tabs together in collections you create that stay hidden — rather than cluttering your browser window — until you want them.\n Tabby: Manage multiple browser windows and tabs easily. This extension can help you open, close, move, pin, and do many other things on tabs and windows quickly. You can even save all your windows and tabs for later with just one click.\n   Bookmarks are links to web pages that make it easy to get back to your favorite places. To bookmark a page, just click on the star in the address bar. The star will turn blue when the page is bookmarked and a window will pop up so you can name, move or tag your bookmark. [ Read more about Firefox browser bookmarks.] These two Firefox browser extensions can help you be a better bookmark.\n Default Bookmark Folder provides a simple way to save web pages to various bookmark folders. Keep your work and personal content conveniently separated.\n Private Bookmarks comes in handy if you want to organize quick access to sensitive information in your browser.\n ||   How to  switch from Google Chrome to Firefox  and bring your bookmarks along. ||\n Bonus tip: If you work on more than one computer, a  Firefox Account lets you sync your data and preferences (such as your bookmarks, history, passwords, open tabs and installed add-ons) across all your devices.\n  As you work from home, you’ll naturally communicate even more through email, chat systems, digital docs and other online channels.\n LanguageTool automatically checks for spelling and grammar mistakes anywhere you write on the web and suggests edits in 25+ languages.\n  Have you ever tried customizing mouse gestures (which are movements you define for your mouse to do a specific thing) for more navigation mobility and efficiency? Move swiftly through pages using powerful features like “grab ‘n drag” and “momentum scroll.” Here are three excellent mouse gesture extensions—each with distinct strengths:\n Gesturefy: Navigate, operate and browse faster with mouse gestures with this customizable mouse gesture extension with a variety of different commands.\n ScrollAnywhere: Drag your scrollbar with your middle (or right / left) mouse button without actually touching a scrollbar. You can also change the behavior to “grab and drag” style.\n FoxyGestures: Design movements for your mouse to handle many browser tasks using the gesture library or define your own.\n  If the constant bright glare of the computer screen is fatiguing your eyes, these extensions can give them a break. Change the color scheme of the entire internet with visual customization extensions:\n Midnight Lizard: Reskin websites with custom color schemes like night mode, dark themes, blue light filter, screen shader, high contrast, grayscale, etc.\n Dark Background and Light Text: Make every web page (or just the pages you want) display light text on dark backgrounds. All color variations are fully customizable.\n Bonus tip: Try a  Firefox browser theme to change up your digital decor. Choose from thousands of themes to give Firefox just the look you want, and swap it for a new one any time.\n  Working from home requires a certain kind of discipline or you risk blurring the lines between professional and home chores, not to mention leisure time.\n Tomato Clock is a simple time management tool that helps you stay on task by assigning yourself strict work and break intervals.\n Impulse Blocker is here to keep you away from those distracting, timesink websites. Just enter the address of any website that tempts you with unwanted distractions, and the extension will block it until after your self-designated work hours.\n     Try these   six Firefox browser extensions to make video and music streaming even better in your browser.", "posttime": "2020-05-22 05:42:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "远程工作,firefox,扩展,extensions,选项卡", "title": "Firefox扩展使远程工作和学校变得更好", "title_en": "Firefox extensions to make remote work and school a little better", "transed": 1, "url": "https://blog.mozilla.org/firefox/firefox-extensions-work-from-home/", "via": "", "real_tags": ["远程工作", "firefox", "扩展", "选项卡"]}, {"category": "", "categoryclass": "", "imagename": "8aa73e632dd8be3b2953c8440b278af6.jpg", "infoid": 1003191, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，GNU C库(Glibc)中一直隐藏着一个已知的安全漏洞。该库对Linux和许多其他操作系统和程序至关重要，它有一个动态内存管理安全漏洞，可用于拒绝服务(DoS)攻击。现在，安全公司Check Point发布了一个开源补丁，这将使利用此内存分配(Malloc)问题变得更加困难。\nCheck Point再次遇到了这个已知问题，因为它发现所谓的智能灯泡可以通过利用无保护的单链表来侵入网络。此问题的双向链表版本早在2005年就已通过安全解除链接进行了修复。但是，存在于内存原语函数Fast-bins和Thread Cache(TCache)中的单链表版本仍然易受攻击。\n现在，这个问题的解决方案已经到位。这种新的内置安全机制称为安全链接。它通过使用从Linux的地址空间布局随机化(ASLR)功能派生的随机数对其单链接表指针签名来保护malloc。与内存块对齐完整性检查相结合，它可以保护内存指针免受劫持尝试，从而保护系统本身。\n该补丁现在正与最常用的标准C库实现glibc集成。安全链接将于2020年8月在glibc 2.32中发布。它已经在glibc广受欢迎的嵌入式产品uClibc-NG中启动并运行。\n您可能会想，既然这是一个已知问题，为什么花了这么长时间才解决。Check Point的技术负责人埃亚尔·伊特金解释说：\n虽然利用漏洞的开发人员已经意识到这个问题很多年了，但是库的开发人员并没有意识到一个问题--所以什么都没有修复。通过向开发人员提供反馈，以及修复的想法，我们成功地一劳永逸地解决了这个问题。Linux用户应该意识到这一更新，并确保他们在标准库发布后立即切换到使用最新版本的标准库。&#34；\n重要的是要注意，安全链接不是阻止所有针对现代堆实现的攻击尝试的灵丹妙药。然而，这是朝着正确方向又迈出了一步。从我们过去的经验来看，这种特定的缓解措施将阻止我们多年来展示的几个主要漏洞，从而将损坏的软件产品变成无法利用的产品。", "note_en": "For years, there&#39;s been a known security vulnerability hiding in the  GNU C Library (glibc). This library, which is critical for Linux and many other operating systems and programs, had a dynamic memory management security hole that could be used for denial of service (DoS) attacks. Now, the security company,  Check Point, has issued an  open-source patch, which will make it much more difficult to exploit this memory allocation ( malloc) problem.\n Check Point re-encountered this known problem when it discovered that so-called  smart light bulbs could be used to hack into networks by  exploiting unprotected single-linked-lists. The double-linked-list version of this problem had been fixed back in 2005 with  Safe-Unlinking. But, the single-linked-list version, which is present in the memory primitive functions Fast-Bins and Thread Cache (TCache), remained vulnerable.\n Now, the fix is in for this problem. This new built-in security mechanism is called Safe-Linking. It protects malloc by signing its single-linked-list pointers with random numbers derived from Linux&#39;s  Address Space Layout Randomization (ASLR) functionality. Combined with memory chunk alignment integrity checks, it protects the memory pointers from hijacking attempts and thus the system itself.\n The patch is now being integrated with the most common standard C library implementation, glibc. Safe-Linking will be released in glibc 2.32 in August 2020. It&#39;s already up and running in glibc&#39;s popular embedded counterpart:  uClibc-NG.\n You may wonder why it took so long for this to be fixed since it was a known problem. Check Point&#39;s technology lead, Eyal Itkin explained:\n &#34;While exploit developers have been aware of this problem for many years now, the developers of the libraries weren&#39;t aware of a problem --  so nothing got fixed. By giving developers the feedback, along with an idea for a fix, we managed to close this issue once and for all. Linux users should be aware of this update and make sure they switch to using the most updated version of their standard library, once it gets released.&#34;\n    &#34;It is important to note that Safe-Linking is not a magic bullet that will stop all exploit attempts against modern-day heap implementations. However, this is another step in the right direction. From our past experience, this specific mitigation would have blocked several major exploits that we demonstrated throughout the years, thus turning &#39;broken&#39; software products to ones that are &#39;unexploitable.&#39;&#34;", "posttime": "2020-05-22 05:27:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,内存,开源,linux,发布", "title": "Check Point发布常见Linux内存崩溃安全漏洞的开源修复程序", "title_en": "Check Point Releases Open-Source Fix For Common Linux Memory Corruption Security Hole", "transed": 1, "url": "https://www.zdnet.com/article/check-point-released-an-open-source-fix-for-common-linux-memory-corruption-security-hole/", "via": "", "real_tags": ["程序", "内存", "开源", "linux", "发布"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003189, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当你第一次学习复数时，你会发现它们给了你解决以前不可解的方程的方法。经典的例子是方程x^2+1=0，如果你只使用实数，它没有解，但是对于复数，它有解x=i和x=-i。\n作为一个喜欢想象一切事物的物理现实的人，这总是给我带来相当大的困难。方程x^2+1=0可以看作是告诉你方程y=x^2+1的抛物线在哪里与x轴相交的方程。\n只有方程y=x^2+1的抛物线不与x轴相交。如果我们的复数解是可信的，那么它与点(i，0)和(-i，0)中的x轴相交，但我肯定看不到我的图上的这些点。他们在哪里？\n大概有一大堆具有复杂坐标的点，这些点是各种东西相遇的地方，它们看起来不像相遇的地方。这些点一定在某个地方，一定是与我在真实平面上看到的图形有某种关联的某个地方。但是这个地方在哪里呢？\n嗯，大约一周前，我终于找到了复杂的点所在的地方！\n(在这一点上，我需要澄清几件事：这完全是我自己编造的。我不是从别人那里学到的，也不是从阅读别人的作品中学到的。我不会虚荣到相信以前从来没有人想到过这一点，但到目前为止，我还没有在谷歌中找到任何与我相似的搜索词。如果你以前听说过它，我很想知道！)。\n这个想法是这样的：在真实平面的每个点上，都有相当于真实平面的复杂的点连接在一起。连接到实点(a，b)的复点都是形式(a+ci，b+di)。也就是说，两个坐标的实部是(a，b)。我把它们想象成一个平面，x轴表示我们添加到x坐标的虚部，y轴表示我们添加到y坐标的虚部，实点本身在这个平面的中心。\n我将把这个连接到点(a，b)的平面称为“(a，b)处的iPlane”。在上图中，我在(3，2)处的iPlane中显示了几个点。我把它涂成了粉红色，这样你就能看出它不是普通的真飞机，正如你在上面看到的，我通常是涂成白色的。\n当我说“连接”时，我是指字面上的意思--我确实想象iPlane在物理意义上被连接到点上，就像在这里的照片中，它们处于不同程度的扩散：\n当然，真实平面中的每个点都有自己的iPlane，因此复杂平面作为一个整体看起来更像这样：\n这就是复杂的点所在。复点(3+i，5-2i)位于附着于实点(3，5)的iPlane中；复点(2i，-6+7i)位于附着于实点(0，-6)的iPlane中；复点(i，0)和(-i，0)均位于附着于实点(0，0)的iPlane中。\n如果展开适当的iPlane并将其展平，使其位于真实平面的顶部，则更容易看到它们。当然，你不会想做整个平面；你只想要一个足够大的切片，这样你就能看到你想要的点在哪里。此外，我想象iPlane是透明的，这样你就可以透过它看到真实的飞机-因此在所有物理模型的照片中都有玻璃纸。\n在下图中，位于(0，0)处的iPlane切片被展平以显示点(i，0)和(-i，0)。\n这个Geogebra小程序允许你输入一个复杂点的坐标，它会向你显示它所在的iPlane以及iPlane所在的真实位置。试一试，感受一下这里正在发生的事情。\n那么，为什么我会对这个想法如此非常兴奋呢？这一切都与当你计算出复杂的点时会发生什么有关，这些点是一些熟悉的图形的一部分。到目前为止，我已经考虑了很多关于直线和抛物线的问题。我需要一段时间才能把它全部写出来，所以我会把这些话题留到后面的博客文章中去写。\n这篇文章发表在ISN&#39；t Maths Cool？上，是关于数学思维和标记复数、平面、数学的想法。为固定链接添加书签。\n[…]。复杂的点在哪里：iPlane概念简介[…]。\n[…]。复杂的点在哪里：iPlane概念简介[…]。\n[…]。复杂的点在哪里：iPlane概念简介[…]。\n[…]。复杂的点在哪里：iPlane概念简介[…]。\n[…]。代数，我没想到会从他的帖子里分析太多。然而，当我深入研究大卫的作品“复杂之处在哪里”时，我感到很舒服。他的字写得很清楚。我可以遵循他的逻辑，和他一起思考，“[…]。\n当我看到“我有过的最伟大的数学想法”时，我想我没有祈祷去理解它。我所做的证明了你对问题和解决方案的理解，以及你如此清晰地表达出来的能力。\n这篇帖子激发了我很多想法，我试图在这里把它们浓缩成一些连贯的东西。我通过我们在K-12州使用的“数学实践标准”的镜头来看待你的“有史以来最伟大的想法”。更广泛的想法正在观察和对比数学家(比如你！)。以及学校数学经常是什么样子。\n您已经发明了一种可视化R^4的方法，即在R^2的每个点上都附加一个R^2，因此在某种意义上，R^2的切线束就是R^2的切线束。不过，您是如何将其具体化的，这是相当巧妙的！\n理解函数(实变量或复变量)的另一种方法是使用映射图。对于二次函数(具有实数或复数系数)，二次方程的根由从源复平面中的点到目标平面中的点0+0i的箭头可视化。例如，请参阅我使用Geogebra https://www.geogebra.org/m/JZYgq4Mx#material/aYeGJpS4和MD所做的工作，以可视化地解决https://www.geogebra.org/m/CX32kuXG#chapter/274869.中的线性方程和二次方程", "note_en": "When you first learn complex numbers, you find out that they give you ways to solve equations that were previously unsolvable. The classic example is the equation equation x^2 + 1 = 0, which if you’re only using real numbers has no solutions, but with complex numbers has the solutions x=i and x=-i.\n As someone who likes to imagine the physical reality of everything, this has always caused me considerable difficulties. The equation x^2 + 1 = 0 can be thought of as the equation that tells you where the parabola with equation y = x^2 + 1 meets the x-axis.\n Only the parabola with equation y = x^2 +1  doesn’t meet the x-axis. If our complex number solutions are to be believed, then it meets the x-axis in the points (i,0) and (-i,0), but I certainly can’t see those points on my graph. Where  are they?\n  Presumably there are a whole host of points with complex coordinates, which are points where various things meet that don’t look like they meet. These points must be somewhere, and they must be some place that is somehow related to the graphs I see in the real plane. But where is this place?\n Well, about a week ago, I finally found the place where the complex points are!\n (At this point I need to make a few things clear: I have made this up entirely on my own. I have not learned it from anyone else, or from reading anyone else’s work. I am not so vain as to believe that no-one has ever thought of this before, but as yet I can’t find search terms in Google that have shown me anything close. If you have heard of it before I’d love to know!)\n Here’s the idea: at every point in the real plane, there are a real-plane’s-worth of complex points attached. The complex points attached to the real point (a,b) are all of the form (a+ci,b+di). That is, the real parts of the two coordinates are (a,b). I imagine them as a plane, with x-axis showing what imaginary part we’ve added to the x-coordinate, and y-axis showing what imaginary part we’ve added to the y-coordinate.The real point itself is in the centre of this plane.\n  I’m going to call this plane attached to the point (a,b) the “iplane at (a,b)”. In the picture above, I’ve shown a few points in the iplane at (3,2). I’ve coloured it pink so you can tell it’s not the ordinary real plane, which as you saw above, I usually colour in white.\n When I say “attached” I mean it literally — I actually do imagine the iplane being attached to the point in a physical sense, like in the photos here, which are at different levels of spread-out-ness:\n  Of course, every point in the real plane has its own iplane, so the complex plane as a whole looks more like this:\n  And that’s where the complex points are. The complex point (3+i,5-2i) is in the iplane attached to the real point (3,5); the complex point (2i, -6+7i) is in the iplane attached to the real point (0,-6); and the complex points (i,0) and (-i,0) are both in the iplane attached to the real point (0,0).\n It’s easier to see them if you spread the appropriate iplane out and flatten it so it sits on top of the real plane. You don’t want to do the whole plane of course; you just want a big enough slice so that you can see where the point is that you want. Also, I imagine the iplane being transparent so you can see the real plane through it — hence the cellophane in all the photos of the physical models.\n In the below picture, a slice of the iplane at (0,0) is being flattened out to show the points (i,0) and (-i,0).\n  This GeoGebra applet allows you to enter the coordinates of a complex point and it will show you the iplane it’s in and the real point where the iplane is attached. Give it a go to get a feel for what’s happening here.\n  So why am i so very very excited by this idea? Well, it all has to do with what happens when you figure out the complex points that are part of some familiar graphs. So far, I’ve thought a lot about lines and a bit about parabolas. It will take me a while to write about it all, so I’ll save those topics for the subsequent blog posts.\n       This entry was posted in  Isn&#39;t maths cool?,  Thoughts about maths thinking and tagged  complex numbers,  iplanes,  maths. Bookmark the  permalink.\n          […] Where the complex points are: introduction to the iplane concept […]\n  […] Where the complex points are: introduction to the iplane concept […]\n  […] Where the complex points are: introduction to the iplane concept […]\n  […] Where the complex points are: introduction to the iplane concept […]\n  […] algebra, I didn’t expect to parse much from his post. However, as I dug into David’s work “Where the complex points are” I felt comfortable. His writing was clear. I could follow his logic and wonder with him, “where […]\n  When I saw “the biggest maths idea I’ve ever had” I didn’t think I had a prayer of understanding it. That I do is a testament to your understanding of the problem and solution and your ability to articulate it so clearly.\n This post inspired a lot of thoughts that I tried to condense into something coherent here. I look at your “biggest idea ever” through the lens of the Standards for Mathematical Practice we use in the states k-12. The broader ideas are looking at and contrasting what mathematicians (like you!) do and what school mathematics is often like.\n  You’ve invented a way of visualizing R^4 by attaching an R^2 to each point of R^2, so in some sense the tangent bundle of R^2. It’s pretty neat, though, how you’ve made it concrete!\n  An alternative to understanding functions (of either real or complex variable) is to use mapping diagrams. For quadratic functions (with either real or complex coefficients) the roots of the quadratic equations are visualized by arrow(s) from point(s) in the source complex plane to the point 0+0i in the target plane. See for example my work with GeoGebra  https://www.geogebra.org/m/JZYgq4Mx#material/aYeGJpS4 and MD to visualize solving linear and quadratic equations in  https://www.geogebra.org/m/CX32kuXG#chapter/274869.", "posttime": "2020-05-22 05:12:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "complex,iplane", "title": "复杂的点在哪里", "title_en": "Where the complex points are", "transed": 1, "url": "https://blogs.adelaide.edu.au/maths-learning/2016/08/05/where-the-complex-points-are/", "via": "", "real_tags": ["complex", "iplane"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003187, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "天文学家认为，他们可能已经发现了新行星诞生的第一个直接证据。\n在距地球约520光年的一颗名为AB御夫座的年轻恒星周围发现了一个由尘埃和气体组成的致密圆盘。\n利用位于智利的欧洲南方天文台的甚大望远镜(VLT)，研究人员观察到中心附近有一个“扭曲”的螺旋结构，这表明一个新的世界可能正在形成过程中。科学家们说，旋转的圆盘是御夫座恒星系统诞生的迹象之一。\n法国PSL大学巴黎天文台的安东尼·博卡莱蒂博士领导了这项研究，他说：“到目前为止，已经发现了数千颗系外行星，但对它们是如何形成的知之甚少。”\n他补充说：“我们需要观察非常年轻的系统，才能真正捕捉到行星形成的瞬间。”\n到目前为止，天文学家一直无法拍摄年轻圆盘的清晰图像来观察这些扭曲。\nBoccaletti博士和他的天文学家团队使用VLT的Sphere仪器拍摄了AB御夫座的照片，照片显示了这颗试图“踢”气体的幼行星造成的“令人震惊的螺旋状尘埃”。\n2018年，同样的仪器被用来拍摄另一颗被认为只有540万年历史的新生行星的照片。\n法国波尔多天体物理实验室(LAB)的伊曼纽尔·迪·福尔科(Emmanuel Di Folco)是这项研究的作者之一，他表示，这种所谓的踢球现象会引起“圆盘中波浪形式的扰动，有点像湖上的船的尾迹”。\n当这颗新行星围绕AB御夫座旋转时，它会使周围的气体和尘埃形成螺旋臂。螺旋线中心附近非常明亮的黄色区域是扭曲，它与恒星的距离大约与海王星与太阳的距离相同。\n实验室的安妮·杜特里(Anne Dutrey)是这项研究的合著者，她说：“行星形成的一些理论模型预计会出现这种转折。它对应于两个螺旋线的连接-一个向内缠绕在行星轨道内，另一个向外扩展-在行星位置连接。\n“它们让圆盘中的气体和尘埃附着在正在形成的行星上，并使其生长。”", "note_en": "Astronomers believe they may have found the first direct evidence of a new planet being born.\n A dense disc of dust and gas has been spotted surrounding a young star called AB Aurigae, about 520 light years away from Earth.\n Using the European Southern Observatory’s Very Large Telescope (VLT), located in Chile, the researchers observed a spiral structure with a “twist” near the centre, which suggests a new world may be in the process of forming. The swirling disc was one of the telltale signs of the star system being born in the constellation of Auriga, the scientists said.\n  Dr Anthony Boccaletti, who led the study from the Observatoire de Paris at the PSL University, in France, said: “Thousands of  exoplanets have been identified so far, but little is known about how they form.”\n He added: “We need to observe very young systems to really capture the moment when planets form.”\n Until now astronomers had been unable to take clear images of young discs to see these twists.\n Dr Boccaletti and his team of astronomers used VLT’s Sphere instrument to take photos of AB Aurigae, which show “a stunning spiral of dust” caused by the baby planet trying to “kick” the gas.\n The same instrument was used in 2018 to take photos of another infant planet, thought to be just 5.4m years old.\n According to Emmanuel Di Folco, of the Astrophysics Laboratory of Bordeaux (LAB), in France, and one of the study’s authors, this so-called kicking phenomenon causes “disturbances in the disc in the form of a wave, somewhat like the wake of a boat on a lake”.\n As the new planet rotates around AB Aurigae, it causes the surrounding gas and dust to be shaped into a spiral arm. The very bright yellow region near the centre of the spiral is the twist, which lies at about the same distance from the star as Neptune from the sun.\n Anne Dutrey of LAB, a study co-author, said: “The twist is expected from some theoretical models of planet formation. It corresponds to the connection of two spirals – one winding inwards of the planet’s orbit, the other expanding outwards – which join at the planet location.\n “They allow gas and dust from the disc to accrete on to the forming planet and make it grow.”", "posttime": "2020-05-22 04:51:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "天文学家,spot,行星", "title": "天文学家发现新行星诞生的第一个潜在证据", "title_en": "Astronomers Spot Potential First Evidence of New Planet Being Born", "transed": 1, "url": "https://www.theguardian.com/science/2020/may/20/astronomers-spot-likely-first-evidence-of-a-new-planet-being-born-ab-aurigae", "via": "", "real_tags": ["天文学家", "spot", "行星"]}, {"category": "", "categoryclass": "", "imagename": "0b18272a21f2237670bd71bd1f30bcc1.jpeg", "infoid": 1003186, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook首席执行官马克·扎克伯格(Mark Zuckerberg)周四表示，他预计在未来5到10年内，公司50%的员工可能会远程办公。\n扎克伯格表示：我们将成为规模最大的远程办公领域最具前瞻性的公司。\n他说，公司将开始允许某些员工远程全职工作。如果这些员工在2021年1月1日之前搬到其他地点，他们将不得不通知公司。扎克伯格说，因此，这些员工的薪酬可能会根据他们的新地点进行调整。\n扎克伯格说，到时候我们会根据你所在的位置调整工资，并指出这对于税收和会计是必要的。对于那些对此不诚实的人来说，将会有严重的后果。\n扎克伯格宣布，Facebook将积极增加远程员工的招聘，并将采取慎重措施，为现有员工开辟长期的远程工作岗位。\n扎克伯格在每周一次的员工直播中做出了预测，他告诉员工，这一决定应该有助于公司提高员工保留率，并将使Facebook能够从人才库中招聘人才，而这些人才库以前是不会考虑搬到大城市为公司工作的。此外，这一决定将使Facebook能够改善其员工的多样性，并将经济机会传播到更多的地方。\n扎克伯格说，当你将招聘限制在居住在少数大城市或愿意搬到那里的人时，就会排除很多生活在不同社区、不同背景或观点不同的人。\n扎克伯格说，目前，Facebook 95%的员工都在远程办公。扎克伯格说，Facebook进行的一项调查发现，50%的员工表示，他们在家工作的效率与在办公室工作的效率一样高。扎克伯格说，在Facebook员工中，40%的人表示他们对全职远程工作非常、非常或有点感兴趣，在这部分员工中，75%的人表示，如果他们可以远程工作，他们要么非常有信心，要么可能会搬到不同的城市。\n扎克伯格说，人们拥有很多这样的工作，他们不得不搬到少数几个大城市，这在某种程度上是一种不幸和不可持续的安排。\n首先，Facebook将允许现有员工在满足特定标准的情况下请求永久远程工作。扎克伯格说，这包括有经验的员工，最近表现强劲的员工，支持远程工作的团队中的员工，以及获得组长批准的员工。扎克伯格说，这将不包括最近毕业的员工。\nFacebook是最新一家宣布决定继续支持远程工作的公司。在此之前，Twitter、Square和Shopify等公司也做出了类似的决定。\n扎克伯格宣布这一消息的同时，Facebook也宣布了Workplace的新功能，Workplace是该公司的企业通信软件。该公司周四宣布，在冠状病毒大流行的推动下，Workplace的付费用户群已从10月份的300万增加到500万。\n扎克伯格宣布这一消息后，Facebook的股价连续第二天上涨，涨幅接近1%，尽管市场其余部分大多下跌。", "note_en": "Facebook CEO Mark Zuckerberg on Thursday said he predicts that 50% of the company&#39;s employees could be working remotely within the next five to 10 years.\n &#34;We&#39;re going to be the most forward-leaning company on remote work at our scale,&#34; Zuckerberg said.\n  The company will begin allowing certain employees to work remotely full time, he said. Those employees will have to notify the company if they move to a different location by Jan. 1, 2021. As a result, those employees may have their compensations adjusted based on their new locations, Zuckerberg said.\n &#34;We&#39;ll adjust salary to your location at that point,&#34; said Zuckerberg, citing that this is necessary for taxes and accounting. &#34;There&#39;ll be severe ramifications for people who are not honest about this.&#34;\n Zuckerberg announced that Facebook is going to &#34;aggressively&#34; ramp up its hiring of remote workers, and the company is going to take a &#34;measured approach&#34; to opening up permanent remote work positions for existing employees.\n Zuckerberg made his prediction on his weekly live stream with employees, telling them that this decision should help the company improve its employee retention, and it will allow Facebook to hire from talent pools that previously wouldn&#39;t consider moving to big cities to work for the company. Additionally, this decision will allow Facebook to improve the diversity of its workforce and spread economic opportunity across more places.\n &#34;When you limit hiring to people who either live in a small number of big cities or are willing to move there, that cuts out a lot of people who live in different communities, different backgrounds or may have different perspectives,&#34; Zuckerberg said.\n  Currently, 95% of Facebook&#39;s employees are working remotely, Zuckerberg said. A survey conducted by Facebook found that 50% of employees said they were as productive working from home as they were at the office, Zuckerberg said. Among Facebook employees, 40% said they were extremely, very or somewhat interested in full-time remote work, and among that subset of employees, 75% said they were either pretty confident or they might move to a different city if they could work remotely, Zuckerberg said.\n &#34;It&#39;s somewhat of an unfortunate and unsustainable setup for people to have a lot of these jobs they have to move to a small number of big cities,&#34; Zuckerberg said.\n To start, Facebook will allow existing employees to request permanent remote work if they meet specific criteria. This includes experienced employees, those with strong recent performance, employees on teams that support remote work and employees who get approval from their group leaders, Zuckerberg said. This will not include employees who are recent graduates, Zuckerberg said.\n Facebook is the latest company to announce a decision to continue supporting remote work. This follows  similar decisions by companies like  Twitter,  Square and  Shopify.\n Zuckerberg&#39;s announcement comes as Facebook announced new features for Workplace, the company&#39;s enterprise communication software. Boosted by the coronavirus pandemic, Workplace has grown its base from 3 million paid users in October to 5 million, the company  announced on Thursday.\n Following Zuckerberg&#39;s announcements, Facebook&#39;s share price was up for the second day in a row, up nearly 1%, despite the rest of the market being mostly down.", "posttime": "2020-05-22 04:42:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "面临,employees,员工", "title": "扎克伯格称搬出硅谷的员工可能面临减薪", "title_en": "Zuckerberg says employees moving out of Silicon Valley may face pay cuts", "transed": 1, "url": "https://www.cnbc.com/2020/05/21/zuckerberg-50percent-of-facebook-employees-could-be-working-remotely.html", "via": "", "real_tags": ["面临", "employees", "员工"]}, {"category": "", "categoryclass": "", "imagename": "b8f08b73c30efdc2bc0b21f521ffa700.jpeg", "infoid": 1003184, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们最近向您介绍了OWC推出的一款激动人心的新硬盘--4TB Aura P12 M.2 NVMe固态硬盘。固态硬盘之所以如此有趣，是因为它巨大的4TB容量，突破了M.2硬盘的极限。\n好了，各位，4TB的PCIe M.2固态硬盘现在是旧帽子了。你们看，Sabrent有了一个新的驱动器，容量翻了一番！是的，该公司的Rocket Q NVMe PCIe M.2 2280固态硬盘将很快推出令人惊叹的8TB-这是有史以来第一款达到这一容量的消费产品PCIe M.2固态硬盘。\n最新的8TB Rocket Q NVMe PCIe M.2 2280内置固态硬盘高性能固态硬盘(SB-RKTQ-8TB)通过PCIe Gen3 x4接口提供闪存磁盘技术的所有优势，并且完全符合标准的下一代外形规格(NGFF)，也就是通常所说的M.2。萨布伦特说，功耗比传统硬盘低得多，使其成为新系统的最佳嵌入式解决方案。\n支持SMART和TRIM命令。支持ONFI 2.3、ONFI 3.0、ONFI 3.2和ONFI 4.0接口。\n所有SABRENT固态硬盘都配有免费的SABRENT Acronis True Image for SABRENT软件，便于克隆，有关更多信息，请访问我们的网站。\nSabrent没有共享可用性、价格或性能，但它应该既昂贵又快速。例如，Rocket Q NVMe PCIe M.2 2280 SSD的4TB变种(见此处)售价750美元。如果你计算一下，很容易预计8TB的价格会远远超过1,000美元。见鬼，我预计它的价格会接近2000美元！4TB型号的读/写速度分别为3,200 MB/s和2,900 MB/s，而8 TB版本的性能应该非常相似(如果不相同)。", "note_en": "We recently told you about an exciting new drive by OWC -- the  4TB Aura P12 M.2 NVMe solid state drive. What made that SSD so interesting was its massive 4TB capacity, which was pushing the boundaries of what is possible with an M.2 drive.\n Well, folks, a 4TB PCIe M.2 SSD is now &#34;old hat.&#34; You see, Sabrent has a new drive that  doubles that capacity! Yes, the company&#39;s Rocket Q NVMe PCIe M.2 2280 SSD will soon be available in a mind-blowing 8TB -- the first ever such consumer PCIe M.2 SSD to achieve that capacity.\n    &#34;The Sabrent 8TB ROCKET Q NVMe PCIe M.2 2280 Internal SSD High-Performance Solid State Drive (SB-RKTQ-8TB) delivers all the advantages of flash disk technology with PCIe Gen3 x4 interface and it is fully compliant with the standard Next Generation Form Factor (NGFF), commonly-known as M.2. Power consumption is much lower than traditional hard drives, making it the best-embedded solution for new systems,&#34; says Sabrent.\n  Supports SMART and TRIM commands. Supports ONFi 2.3, ONFi 3.0, ONFi 3.2 and ONFi 4.0 interface.\n  All Sabrent SSDs come with FREE Sabrent Acronis True Image for Sabrent Software for easy Cloning, For more information please visit our website.\n Sabrent has not shared availability, pricing, or performance, but it should be both expensive and fast. For example, the 4TB variant of the Rocket Q NVMe PCIe M.2 2280 SSD (seen  here) sells for $750. If you do the math, it is easy to expect the 8TB model to cost well over $1,000. Hell, I expect it to carry a price tag closer to $2,000! The 4TB model has read/write speeds of 3,200 MB/s and 2,900 MB/s, and the 8TB version should have very similar performance (if not identical).", "posttime": "2020-05-22 04:20:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "火箭,固态硬盘,硬盘,揭开,unveils", "title": "Sabrent揭开破纪录的8TB火箭Q NVMe PCIe M.2 2280固态硬盘", "title_en": "Sabrent Unveils Record-Breaking 8TB Rocket Q NVMe PCIe M.2 2280 SSD", "transed": 1, "url": "https://betanews.com/2020/05/21/sabrent-8tb-rocket-q-nvme-pcie-ssd/", "via": "", "real_tags": ["火箭", "固态硬盘", "硬盘", "揭开", "unveils"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003183, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "FPGA可以被视为硬件和软件领域之间的桥梁，因为它们的硬件操作可以使用代码重新编程，从而为开发人员提供了前所未有的灵活性。在AntMicro帮助其客户制造的高级产品中，这种处理并行数据的灵活性通常需要由CPU提供的更标准的顺序处理能力来补充，CPU可以运行控制软件并与用户或其他设备进行接口。\n对异构计算的这种需求一直是Xilinx的Zynq/UltraScale+或英特尔的Cyclone/Stratix等FPGA SoC技术成功的根源，也是世界上第一款支持Linux的RISC-V FPGA SoC PolarFire SoC令人兴奋的原因。即将推出的用于PFSoC的ICICLE开发工具包现在也可以作为我们的模拟框架Renode中的平台使用，但是我们将很快在专门的笔记中讨论这一点。\n向FPGA设计提供标准CPU处理能力的另一种方法涉及构建所谓的软核-在FPGA内部合成的CPU。虽然它们提供了很高的灵活性，但它们通常不能与高性能或软件功能联系在一起，当然不能与“真正的”FPGA SoC中的支持Linux的双核或四核CPU相提并论。\n随着最近在开源ISA、HDL、软SoC框架和FPGA开发流程方面的进步，AntMicro正处于领先地位，这即将发生变化-阅读我们如何增强VexRiscv，一个开放而灵活的32位RISC-V实现，成为一个支持Linux的四核CPU，为完全在FPGA中运行的软件密集型工作负载提供更强的计算能力和多功能性。\n我们越来越多的FPGA项目涉及一种名为Litex的基于Python的软SoC生成器，它可以在FPGA中为各种应用构建高度灵活的SoC。虽然它提供了许多CPU选项(涵盖RISC-V、OpenRISC、LM32或最近才出现的POWER等架构)，但当与VexRiscv等灵活、高性能、支持Linux的FPGA优化CPU配合使用时，效率最高。\nVexRiscv最初由Charles Papon(SpinalHDL的发明者)开发和维护，SpinalHDL是一种基于Scala的高级HDL，类似于Chisel，也用于CPU本身。VexRiscv是一种高性能的32位Linux支持的基于Spinal HDL的软RISC-V内核，针对FPGA进行了优化。它的高度可配置性允许FPGA用作一种定制的硅，使其成为CPU中的瑞士军刀。\n为了进一步提高VexRiscv的能力，我们与Charles合作，为CPU添加了可扩展的多核配置，从而提供了第一个FPGA RISC-V实现，该实现提供了高性能，同时针对FPGA进行了资源优化。在FPGA设计中使用VexRiscv，再加上Litex提供的大量外围IP(如DRAM内存控制器、USB、以太网、PCIe等)，即可实现所谓的“软FPGA SoC”。根据您对I/O和处理能力的需求，以及FPGA中自定义IP和加速器所需的空间大小，这种“软FPGA SoC”可以根据需要进行上下扩展，添加内核或外围设备。\n为了展示一个实际的用例，我们创建了一个运行Linux的成熟的四核SMP系统(当然，如果需要的话，它也可以运行RTOS--我们还为Zephyr添加了对VexRiscv的支持)。为此，我们需要在核心之间实施通信和同步，包括：\n由OS(在这种情况下为Linux)中的调度器使用的处理器间中断实现的处理器间通信，以确保任务的正确调度和中断，\n总线互连，其允许所有核心访问存储器，包括无序访问以最大化CPU和存储器资源的有效性，\nCPU一致性机制，以确保来自不同内核的加载和存储指令的排序。\n我们与Litex和SpinalHDL的创建者合作，在Digilent的ARTYA7板(https://store.digilentinc.com/arty-a7-artix-7-fpga-development-board-for-makers-and-hobbyists/).上实现了一个测试设计。只占用35Klut FPGA的70%-Artix A35T-VexRiscv在大约4秒内启动Linux，并在所有内核上同时运行Dhrystone CPU基准测试，所有内核都通过了测试。机器模式异常由openSBI处理。CPU的多核能力也已经在更大的200T FPGA上进行了测试，它在电路资源中所占的比例要小得多。\n最重要的是，这种实现现在也在Renode-AntMicro的硬件模拟和硬件/软件联合开发框架中得到支持。Renode中的RISC-V支持使您可以使用Verilator将Litex SoC与自定义FPGA设计进行联合仿真，从而为RISC-V SoC原型项目提供完整的开发/调试环境。\nFPGA上的RISC-V已经达到了一个重要的里程碑，VexRiscv成为了广泛的RISC-V核心列表上的第一个具有多核能力的FPGA优化CPU，我们正在帮助维护RISC-V International。AntMicro一直在使用灵活的SoC框架提供FPGA领域的高级客户项目，并改进相关工具和实施工作流程改进，使您的FPGA开发更加便携、以软件为中心和面向未来。如果您正在从事与FPGA相关的项目，请与我们联系，以利用AntMicro在该领域的专业知识。", "note_en": "FPGAs can be seen as a bridge between the domains of hardware and software as their hardware operation can be reprogrammed using code, giving developers unprecedented flexibility. In advanced products that Antmicro helps its customers build, this flexibility to process parallel data often needs to be complemented with a more standard, sequential processing capability provided by a CPU, which can run control software and interface with the user or other devices.\n This need for heterogeneous computing has been at the root of the success of FPGA SoC technologies like Xilinx’ Zynq/UltraScale+ or Intel’s Cyclone/Stratix, and is the reason behind the excitement about  PolarFire SoC, world’s first Linux-capable RISC-V FPGA SoC. The upcoming Icicle Development kit for PFSoC is now also  available as a platform in our simulation framework, Renode, but we’ll discuss this in a dedicated note soon.\n  Another approach to providing standard CPU processing power to an FPGA design involves building a so-called softcore - a CPU synthesized inside an FPGA. While they offer high flexibility, they are not normally associated with high performance or software capability, certainly not on par with the Linux-capable dual or quad core CPUs found in ‘real’ FPGA SoCs.\n With the recent advancements in open source ISAs, HDLs, soft SoC frameworks and FPGA development flows in general that Antmicro is spearheading, that is about to change - read on how we enhanced VexRiscv, an open and flexible 32-bit RISC-V implementation to be a quad-core, Linux capable CPU to offer more computing power and versatility for software-intensive workloads running entirely in an FPGA.\n   A growing number of our FPGA projects involve a  Python-based soft SoC generator called  LiteX, which enables building highly flexible SoCs in FPGAs for a variety of applications. While it offers many CPU options (covering architectures such as RISC-V, OpenRISC, lm32 or - since recently -  POWER, it is most effective when paired with a flexible and high-performance, Linux-capable FPGA-optimized CPU like VexRiscv.\n Originally developed and maintained by Charles Papon (the inventor of SpinalHDL, a high-level Scala-based HDL akin to Chisel, also used for the CPU itself),  VexRiscv is a high-performance 32-bit Linux-capable Spinal HDL-based soft RISC-V core optimized for FPGAs. Its high configurability, which allows FPGAs to be used as a sort of custom silicon, makes it a Swiss army knife among CPUs.\n  In order to increase VexRiscv’s capabilities even further, we have collaborated with Charles to add a scalable multi-core configuration to the CPU, thus delivering the first FPGA RISC-V implementation that offers high performance and is resource optimized for FPGAs at the same time. Using VexRiscv in your FPGA design - together with the multitude of peripheral IPs such as DRAM memory controller, USB, Ethernet, PCIe etc. available in LiteX - results in what could be called a “soft FPGA SoC”. Depending on your need for I/Os and processing power, and how much space you need for custom IP and accelerators in the FPGA, this “soft FPGA SoC” can be scaled up and down adding cores or peripherals as needed.\n To showcase one practical use case, we created a full-blown quad-core SMP system running Linux (of course, it could run an RTOS as well if needed - we have also added VexRiscv support to e.g. Zephyr). To do that, we needed to implement communication and synchronization between the cores, including:\n inter-processor communication, enabled by inter-processor interrupts used by the schedulers in the OS (Linux in this case) to ensure correct scheduling and interrupting of tasks,\n    bus interconnections, which allow all the cores to access the memory, including out of order access to maximize the effectivity of the CPUs and memory resources,\n  cpu consistency mechanisms, to ensure the ordering of load and store instructions from different cores.\n  In collaboration with the creators of LiteX and SpinalHDL, we implemented a  test design on Digilent’s Arty A7 board (https://store.digilentinc.com/arty-a7-artix-7-fpga-development-board-for-makers-and-hobbyists/). Taking only 70% of a 35 KLUT FPGA - the Artix A35T - VexRiscv boots Linux in about 4 seconds, and runs the Dhrystone CPU benchmark on all cores at the same time, with all the cores passing the test. Machine mode exceptions are handled by openSBI. The CPU’s multi-core capability has also been tested on the much bigger 200T FPGA, where it occupies a much smaller chunk of the circuit’s resources.\n On top of that, this implementation is now also  supported in Renode - Antmicro’s framework for hardware simulation and HW/SW co-development. The RISC-V support in Renode gives you the possibility to co-simulate your LiteX SoC with a custom FPGA design using  Verilator, providing a full development / debug environment for RISC-V SoC prototyping projects.\n   RISC-V on FPGA has reached an important milestone with VexRiscv becoming the first multi-core capable FPGA-optimized CPU on the extensive  RISC-V cores list, which we are helping to maintain for the RISC-V International. Antmicro has been delivering advanced customer projects in the FPGA space using the flexible SoC framework as well as refining the relevant tooling and implementing workflow improvements that can make your FPGA development much more portable, software-centric and future-proof. If you are working on an FPGA-related project, reach out to us to take advantage of Antmicro’s expertise in this area.", "posttime": "2020-05-22 04:12:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,支持,quadcore,fpga", "title": "VexRiscv是用于FPGA的四核RISC-V软核，支持Linux", "title_en": "VexRiscv is a quadcore RISC-V softcore for FPGA, Linux-capable", "transed": 1, "url": "https://antmicro.com/blog/2020/05/multicore-vex-in-litex/", "via": "", "real_tags": ["linux", "支持", "quadcore", "fpga"]}]