[{"category": "", "categoryclass": "", "imagename": "3027d46d0eb5a8c0ef6db48f85ece57a.png", "infoid": 1005593, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我在谈论联系人追踪应用程序时犹豫不决，因为有太多人在谈论这个话题，反复重复相同陈词滥调的比例也很高。在这个相当简单的问题上，几乎没有什么有见地的东西可以说。但最近有消息称，一款特定的联系人追踪应用程序正在使用一种方法，这可能会引发一个潜在的争议问题。\nCovid-19接触追踪是一个敏感领域。这不仅关系到数百万用户的健康数据。它还涉及跟踪这些人之间的接近程度和联系方式，以及安装国家提供的应用程序。这个话题太大了，以至于谷歌/苹果更新了他们的操作系统，提供了一个特殊的API。到目前为止，联系人追踪中的大多数争议都围绕着地理位置数据的收集，或架构方法-集中式或分散式。现在又出现了另一个恰当的例子。\n一款特殊的联系人跟踪应用ProtegoSafe(为波兰开发的官方国家支持的应用程序)正在使用Progative Web Application Approach动态加载(如从互联网)其操作的一些逻辑(此处记录：1，2)。\n渐进式Web应用程序(PWA)是一种设计方法，它允许构建丰富的Web应用程序，从用户的角度看，这些应用程序的行为(外观和感觉)就像本地应用程序一样。PWA允许以一种简单的方式更新应用程序。当在移动应用程序中使用时，PWA可以提供比通过官方Android或iPhone应用程序商店更快的更新。\n它的工作方式是，当应用程序使用PWA模型时，它的某些部分必须从远程服务器下载。在使用Web浏览器的情况下，这通常是关于下载一个名为Manifest的文件，其定义描述了应用程序配置(也可以在这里查看我对Progative Web应用程序的隐私分析)。例如，当第一次安装应用程序或动态更新PWA时，就会发生这种情况。实际上，这是对站点的HTTP请求。意思-应用程序用户的IP地址被传送到由权威机构控制的服务器(在此特定应用程序的情况下，即数字事务部)。\n但是，由于该部是一家公共机构，因此它有权将IP地址解析为用户的实际身份，在这种情况下，IP地址可能被视为个人数据，单独挑出个人。\n这意味着在接触追踪应用程序中处理的已经敏感的数据将更加敏感，因为如果发生这种情况，这些数据将属于身份识别的人。这将使该系统的情况变得更加敏感，并形成一个引人入胜的GDPR案例研究。与EDPB的意见一致，这当然应该在隐私影响评估中得到协调(建议将其公之于众，因为到今天为止还没有发生这种情况)。\n公共机构使用渐进式Web应用程序是否符合数据保护，还是侵犯了用户隐私？欧盟法院裁定，在某些情况下，IP地址确实是个人数据。这是有影响力的布雷耶案：\n在线媒体服务提供商在个人访问其向公众开放的网站时注册的IP地址，对于该提供商而言，构成了该规定意义上的个人数据，如果后者具有使其能够利用互联网服务提供商拥有的关于该人的附加数据来识别数据主体的合法手段。\n可以想象，一般情况下，它可能适用于公共机构使用渐进式Web应用程序的特定情况？\n但是，如果在某些情况下使用PWAS带来的某些后果可能与某些本地独立应用程序不同，则必须解决这些问题。一般来说，系统(因此应用程序)应该始终确保数据处理的正确理由存在。在某些情况下，开发团队可能需要考虑本说明中描述的特定点。您喜欢评估和分析吗？有任何问题、意见、投诉或提议吗？请随时联系：me@lukaszolejnik.com", "note_en": "I was hesitant to speak about contact tracing apps because so many people speak on the subject and the ratio of repeating the same cliches over and over is also high. Little insightful things are left to be said in this rather simple problem. But recently it emerged that a particular contact-tracing app is using an approach that triggers a potentially controversial issue.\n Covid-19 contact tracing is a  sensitive area. Not only concerns the health data of millions of users. It is also about tracking proximity and contacts between those people, and about installing state-supplied apps. The topic is so big that Google/Apple updated  operating systems to deliver a special API. Until now most controversies in contact tracing revolved about the collection of geolocation data, or the architectural approach -  centralized or decentralized. Now there is another case in point.\n A particular contact tracing app,  ProtegoSafe (developed for Poland as an official state-supported app) is dynamically loading (like, from the internet) some logic of its operation using Progressive Web Application approach  (documented here:  1,  2 ).\n Progressive Web Applications ( PWA) is a design method that allows building rich web applications that from a user point of view behave (look and feel) just like native apps. PWA allows a simple way of updating the app. When used in mobile apps, PWA could provide faster updates than through the official Android or iPhone app stores.\n The way it works is that when an application is using the PWA model, some of its parts  must be downloaded from remote servers. In case of a web browser this is typically about downloading a file called  Manifest, with definitions describing the app configuration (look also at my privacy analysis of Progressive Web Applications  here). This happens for example when the app is first installed or when PWA is updated dynamically. In practice, this is an HTTP(s) request to the site. Meaning - the IP address of the application user is communicated to the server controlled by authorities (here in the case of this particular app, the  Ministry of Digital Affairs).\n But because the Ministry is  a public institution and so it  has authority over resolving the IP address to the actual identity of the user, IP addresses  in this context may potentially be regarded as personal data, singling out individuals.\n This means that  the already sensitive data processed in contact tracing app would be even more sensitive because they - if so happens - would be of  identified persons. This then would make the case of the system being even more sensitive and forms a fascinating GDPR  case study.  In line with EDPB opinion, this should of course be reconciled in the  privacy impact assessment (which is advised to be made public, as of this day this did not happen).\n   Is the use of Progressive Web Applications by public institutions in line with data protection or does it violate user’s privacy?  Court of Justice of the European Union has ruled that indeed  IP addresses are in some cases personal data. It’s the influential   Breyer case:\n IP address registered by an online media services provider when a person accesses a website that the provider makes accessible to the public constitutes personal data within the meaning of that provision, in relation to that provider, where the latter has the legal means which enable it to identify the data subject with additional data which the internet service provider has about that person.\n Which, one could imagine that it may apply to the particular situation of  using Progressive Web Applications by public institutions, in general?\n But if in some contexts the use of PWAs brings certain consequences that may be different than in some native standalone applications, the issues must be tackled. In general, systems (so apps) should always ensure that the right  grounds for data processing exist. The particular point described in this note may in certain cases need to be taken into consideration by the development teams.   Did you like the assessment and analysis? Any questions, comments, complaints or offers? Feel free to reach out: me@lukaszolejnik.com", "posttime": "2020-06-08 00:45:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,app,web,应用程序", "title": "公共机构使用渐进式Web应用程序是否违反GDPR？", "title_en": "Use of Progressive Web Applications by public institutions violates GDPR?", "transed": 1, "url": "https://blog.lukaszolejnik.com/use-of-progressive-web-apps-in-some-contexts-may-trigger-data-protection-case-study/", "via": "", "real_tags": ["程序", "app", "web", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005589, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此表中的实验条件为男性与女性名称(男/女)和竞争模式与快速比赛(comp/qp)。这些数字是百分比。EST是估计值，P25是25%的ILE估计值，P75是75%的ILE估计值。竞争模式和使用女性名字都与被告知如何打球相关。请看安德鲁·吉尔曼的这篇文章，了解为什么你可能想要看50%的区间，而不是95%的区间。\n对于不熟悉监督的人，在竞争模式下，你会被明确告知你的ELO类评级是什么，你会得到一个反映你评级的徽章。在快速游戏中，您有一个被跟踪的评级，但它从未直接出现在用户面前，您也不会获得徽章。\n人们通常认为，在竞争性游戏中，人们更紧张，更有可能大发雷霆(例如，告诉你应该如何玩)。这些数据与这一普遍信念是一致的。\n根据上面的说明，我不想对消息的语气进行编码以避免偏见，因此此表仅显示人们告诉我演奏不正确或要求我切换到不同字符的比率。这个表格低估了体验中的质的差异。例如，有一次有人让我在男性状态下交换角色，这个请求是一句礼貌的请求(嘿，我们死得太快了，我们能不能从标准的一个初级治疗师/一个关闭治疗者设置)切换到双初级治疗师，或者把我们的坦克换成[可以阻挡更多伤害的坦克]？当使用女性名字时，一个典型的案例是，在比赛的大部分时间里，会有1-4个人称我为人类垃圾，并安慰自己说，我们球队输掉比赛的整个原因是我不会改变角色。\n我们正在使用的简单模型表明，在竞争性和QP之间以及玩一个男性名字和一个女性名字之间可能是有区别的。然而，大多数公布的结果都是假的，所以让我们看看这个结果可能是假的原因，然后你就可以自己决定了。\n最大的问题是，这不是预先注册的试验。我显然不会去正式注册这样的试验，但我也没有非正式地注册，因为我在开始实验的时候就考虑到了这个比较。未预先注册的试验的一个问题是，无论是就我们可以观察的内容而言，还是就我们过去观察事物的方法而言，都有很大的自由度，因此，目前还不清楚结果是真实的，还是寻找看起来有趣的东西的人工制品。一个标准的例子是，如果你寻找100个可能的影响，你很可能会找到1个在p=0.01的统计意义上有意义的结果。\n有一些标准的技术可以修正这个问题(例如，Bonferroni修正)，但我不认为这些有说服力，因为它们通常不能捕捉到统计模型中的所有自由度。一个例子是，将一个变量离散到几个桶中是很常见的。有很多方法可以做到这一点，你通常不会看到论文讨论这一点的影响，也不会以任何方式纠正这一点，尽管改变这些水桶的排列方式会极大地改变一项研究的结果。人们可以用来操纵结果的另一个常见的旋钮是曲线拟合到不合适的曲线(当散点图显示明显不正确时，通常是二次或三次多项式)。处理此问题的另一种方法是使用更复杂的模型，但我希望使其尽可能简单。\n如果我真的想在这一点上被说服，我至少会考虑到这个精确的比较，重新运行这个实验。因此，这个实验需要重复才能提供更多的初步结果，充其量也就是微弱的证据。\n随机对照试验(RCT)的另一大类问题是，尽管是随机化的，但实验的两个方面可能在某些方面是不同的，而不是随机化的。由于Overwatch不允许您不断更改姓名，因此此实验使用了两个不同的帐户，并且这些帐户在竞争模式下具有不同的评级。平均而言，男性账号的评分更高，因为我一开始的评分更高，这意味着我的对手是更强的球员，而男性账号的比赛更差。从长远来看，这会平衡的，但由于这个实验中的大多数游戏都是在QP中进行的，所以没有时间在COMP中平衡。结果，我有了更高的胜率，以及在Comp中与女性账户的比赛通常要好得多。\n在没有其他信息的情况下，我们可能会认为，玩得更差的人会被告知如何更频繁地玩，而玩得更好的人应该会被告知如何更少地玩，这意味着上面的表格低估了实际的差异。\n然而，卡苏莫维奇等人在对“光环3”进行的一项基于性别的随机试验中发现，玩得不好的玩家对女性更负面，尤其是对玩得好的女性(对数据进行了足够的统计处理，以至于这种简明的说法只能大致正确，详情请参阅研究)。如果这一结果成立，我可能会有更少的人告诉我，我是人类垃圾，如果我是普通人，我需要更换角色，而不是在女性环境下主宰我的大部分游戏。\n如果这一结果推广到OW，那将解释一些我认为奇怪的事情，那就是在我与女性账户最好的表演期间，有很多要求更换和普遍的尖酸刻薄。一个典型的例子是这样的游戏，我们有一个2-2-2的团队组成(游戏中三个角色中的每一个都有两个玩家)，在几乎每一次交战中，我的角色相同的对手在战斗开始时都会撞到敌人的队伍，并在战斗开始时死亡。我碰巧度过了美好的一天，并且控制了另一支球队(在10分钟的比分比赛中37胜2负，同时专注于保护我们球队的治疗师)，而我只死了两次，一次是故意作为牺牲，第二次是在犯了一个愚蠢的错误之后。在我死后，立即有人让我交换角色，这样他们就可以接替我，但从来没有人要求我角色中的其他球员转换角色，尽管他们在整个比赛中都很有用(对于OW球员来说，这是一个立即抓住每一个机会冲到敌队中间的球员，在我们球队不可能支持他们的范围内；这是花村2CP，在那里，雷小山很容易设置他们的球队无法帮助他们的情况)。这种表现是典型的比赛，我的球队因为我打得不正确而责备我。这并不是说我没有糟糕的游戏；我有很多糟糕的游戏，但当我玩一场伟大的游戏时，有不成比例的最有害的经历发生了。\n我跟踪了我在游戏中做得有多好，但是这个样本没有足够的火力游戏来对我的表现和被扔进公交车下面的可能性进行有意义的统计分析。\n不同评分的游戏可能环境也不同，得到的评论也不同，但目前还不清楚2000分的负面评论是否比2500分多，或者反之亦然。网上有很多关于这一问题的辩论；除了最低或最高评级以外的任何评级级别，你都能找到很多人表示，他们所在的评级区间含有最多的有毒评论。\n以下是在玩女性名字时发生的一些事情，这些事情在实验期间或实验以外的任何游戏中都没有发生在男性名字上：\n与我没有文字或语言互动的人主动提出的请求(总共发生了7次，没有记录哪些案例在实验中，哪些不在实验中)\n另一个团队中的某个人认为我的团队在保护我方面做得不够好，而我在扮演治疗师的时候，斥责我的团队，然后把游戏扔了，这样我们就赢了(在实验中发生过一次)。\n我的团队里有人和我调情，然后当我没有回应时就发疯了，然后在剩下的游戏中称我为自闭症或中毒(这种情况在实验期间发生了一次，还有一次是在玩一个没有包括在实验中的游戏时)。\n所有这些的比率都很低，以至于我不得不玩更多的游戏来观察一些东西，而不会有很大的不确定性间隔。\n我没有接受任何与我没有互动的人的好友请求。据传闻，一些人报告说，在主动提出好友请求后，人们会发送性评论或斥责他们。如果我接受这些好友请求，表格中显示的效果可能会更大，而且不可能更小。\n我没有试图将评论归类为调情或非调情，因为与我分类的评论不同，这通常有些微妙，你可以很好地证明，任何特定的评论都是或不是调情。在没有回复的情况下(我没有这样做)，许多这样的评论都是模棱两可的。\n另一个不同之处在于恭维的语气。我得到称赞的游戏比率没有太大差别，但在男性状态下的赞美往往是简短而真实的(例如，在一场占主导地位的比赛之后，另一支球队的某人说[我正在玩的角色的名字]没有回答)，而在女性状态下的赞美往往更热情洋溢，有时会有很多人插话说我有多棒。\n在这两种情况下，不包括解释我是如何玩错的或者我如何需要交换角色的游戏中的补充率和侮辱率是相似的。\n其他一些有趣的因素可能是一天中的时间、服务器、单独或在一起玩、特定的角色选择、或多或少的沟通性等，但是当添加更多的变量时，需要更多的数据才能得到正确的估计。暴雪应该拥有进行这类综合分析所需的数据，但他们对数据的保密是出了名的，所以暴雪必须有人做这项工作，然后将其公之于众，而他们并不是真的有这样做的习惯。如果你在暴雪工作，并且对让第三方对匿名数据集做一些分析感兴趣，请告诉我，我很乐意深入研究。\n在这两种情况下，我都避免使用语音聊天，在时间允许的情况下，我会用短信聊天。同样，在这两种情况下，我大多会填写团队最需要的角色类别，尽管我有时会选择DPS(一般来说，DPS的订阅量很大，所以如果你不选择一个，即使在不必要的情况下，你也很少玩DPS)。\n对于快速游戏，回填游戏不计算在内(回填游戏是指游戏开始后，你可以代替离开的玩家加入游戏；Comp不允许回填)。6%的QP游戏是回填的。\n这些游戏来自代言补丁之前，大多数游戏都是在2018年5月左右玩的。所有的游戏都是单人问答进行的(随机有5名队友)。为了避免游戏之间的关联取决于游戏时间的长短，我在游戏之间退出，并等待足够的时间(因为否则你很可能会和一些或许多和以前一样的玩家一起玩游戏)。\n该模型利用博弈中评论发生的概率避免了Kasumovic等人提出的问题。在那里，一个咆哮的人可以歪曲评论的总数。Kasumovic等人。通过删除离群值解决了这个问题，但我真的不喜欢手动进入并删除数据来调整结果。这也可以通过使用更复杂的模型来解决，但更复杂的模型意味着更多的旋钮，这意味着偏见有更多的方式潜入。使用发表评论的玩家数量是缓解这个问题的一种方法，但我认为这仍然不理想，因为这些并不是独立的--当一名玩家开始消极时，这会极大地增加该游戏中另一名玩家消极的几率，但仅仅使用玩家数量就会使四场有一个消极的人的游戏与一个有四个消极的人的游戏相同。这也可以用稍微复杂一点的模型来解释，但这也涉及到在模型中添加更多的旋钮。\n当我写这篇文章时，我得到的最常见的评论之一是，它只有在低评级时才有效，比如Plat，它的评级是50%。如果有人要承认一款游戏的社区在50%的使用率下是有毒的，而你必须比这更好才能避免有毒的玩家，这似乎就是承认游戏的社区是有毒的。\n然而，为了看看这是否准确，我多玩了一点，玩了高达98%的游戏，看看情况是否有所改善。虽然有很小的改善，但98%的员工并没有什么本质上的不同，所以那些认为公司高层的情况要好得多的人，要么与我的经历截然不同，要么就是指的是99%或更高级别的员工。如果是后者，那么我会说之前关于承认这个游戏有一个有毒社区的评论是成立的。如果是前者，也许我只是运气不好，但根据其他人对游戏体验的评论，我不认为我特别倒霉。\n一个常见的抱怨或许是2000 SR以下(约30%)或1500 SR(约10%)以下的人最常见的抱怨是，他们身处地狱，因为队友太差而被压低。根据我的经验，我发现这是极不可能的。\n人们经常把技能分成机械师和游戏感觉两类。我的机械师几乎是我能得到的最差的了。我玩的最后一款游戏是一款90年代的视频游戏，基本上是在线小行星游戏，在此之前我投入的最后一款游戏是原始的SNES超级马里奥卡丁车。正如你所期待的那样，一个没有花大量时间玩90后视频游戏或任何一种FPS游戏的人，我的目标和躲避都是残忍的。最重要的是，我是一个反应迟钝的老头，尽管我的机械技能几乎为零，但通过避免一些基本的谬误和错误，我能够达到2500 SR(在玩竞技游戏的玩家中大约是60%，在所有玩家中可能更高)。如果你也是一个基本上没有FPS经验的老家伙，你可以做同样的事情；如果你有很好的反应能力或足够的FPS经验来实际瞄准或躲避，你基本上不会比我在机械上更差，你可以通过避免一些基本的错误来做得更好。\n我看到的最常见的谬论是，你必须玩DPS才能从铜牌或金牌中移出。人们给出的证据是，当GM Streamer扮演柔道、坦克或治疗师时，他们有时会输掉铜牌。我猜这个想法是，因为确保99.9%铜牌胜率的唯一方法是成为一名GM级别的DPS球员并玩DPS，所以保持55%或60%的胜率的最好方法是玩DPS，但这并不能随之而来。\n治疗师和坦克在低等级时都非常强大。因为低等级的特点是协调性差，目标也相对较差(协调性好或目标好的玩家往往移动得很快)，与高等级相比，杀死时间非常慢。因此，非治疗师可以倾斜1v1(有时甚至是2v1)比赛的结果，而初级治疗师通常可以决定2v1比赛的结果。因为协调性差，大多数比赛最终都是2v1或1v1。缺乏协调的另一面是，你几乎永远得不到队友的帮助。看到一个敌方球员走进我的队伍中间，攻击某人，然后在没有其他人注意到的情况下离开，这是很常见的。如果被攻击的人是你，另一个治疗师通常不会注意到，并会在完全健康的情况下继续治疗某人，而经典的“剥皮”角色都不会帮助，甚至不会注意到正在发生的事情。这意味着你有责任注意你的周围环境，注意侧翼路线，以避免被谋杀。\n如果你能避免不断地被谋杀，并真正尝试治疗(而不是许多级别较低的治疗师，他们会试图杀人或坚持一个角色，并一直在治疗他们，即使他们完全健康)，那么当你扮演非治疗师的时候，你有一半的时间超越了一名初级治疗师，作为一名初级治疗师，你通常每10分钟可以获得10k-12k的治疗，而在Silver，大多数人每10分钟可以获得10k-12k的治疗(如果他们的话有时会更少)。这就像在你的团队里多了一个半个治疗师，基本上就是让游戏从6v6变成6.5v6。你仍然可以输掉一场6.5v6的比赛，而且你会输掉很多比赛，但是如果你持续的治疗量比你这个级别的普通治疗师高出50%，那么即使你犯了很多重大错误(治疗秩序，只养活对方的时候治疗，等等)，你也会倾向于晋升。\n在扮演治疗师时95%必须注意自己的一个必然结果是，作为一个可以剥皮的角色，你实际上可以照顾你的队友，并让你的球队在95%的比赛中处于显著的优势。作为扎里亚或猪，如果你只是无聊地朝你的队伍前面打，你基本上总是可以在团队战斗中至少挽救一名队友的生命，而且你经常可以这样做2到3次。与此同时，你在另一个团队的对应者正在四处走动，寻找1v1的匹配。如果他们找到一个好的，他们很可能会杀人，如果他们没有(如果他们遇到了一个有机动技能的人，或者遇到了像禁闭机或收割机这样的反抗器)，他们也不会。即使他们杀了人，而你没有做很多事情，你仍然提供了和他们一样多的价值，平均来说，你会提供更多价值。类似的事情也适用于许多DPS角色，尽管这取决于角色(例如，McCree作为剥皮者是有效的，至少在我玩过的低级角色中是有效的)。如果你玩的是不适合剥皮的非狙击手DPS，你可以在你的团队中找到一个正在寻找1v1战斗的DPS，并将这些战斗变成2v1战斗(在低级别，这类人在两支队伍中都不缺乏，所以有很多1v1战斗可以通过让它们变成2v1来控制)。\n我提到的所有这些事情实际上都是在帮助你的团队，而不是去做华而不实的POTG设置，或者试图自己主宰整个团队。如果你抽象地说这一点，这似乎是显而易见的，但大多数人认为他们比他们的评级更好。OW的设计是为了让人们在他们不是很好的时候认为他们做得很好，这也无济于事，而获得奖牌或玩这个游戏的最佳方式是以一种严重降低你实际赢得每一场比赛的几率的方式玩。\n除了明显的游戏失误之外，输掉比赛的另一件大事是有人倾斜，要么开始玩得很糟糕，要么发疯了，说了一些激怒团队中其他人的话，然后他们开始玩得很糟糕。我不认为你可以直接做太多事情，但是你永远不可能做到这一点，所以你的团队中有六分之五的人会以某种基本比率这样做，而另一个团队中有六分之六的人会这样做。就像上面所有的一样，t。\n..", "note_en": "The experimental conditions in this table are masculine vs. feminine name (M/F) and competitive mode vs quick play (comp/QP). The numbers are percents.  Est is the estimate,  P25 is the 25%-ile estimate, and  P75 is the 75%-ile estimate. Competitive mode and using a feminine name are both correlated with being told how to play. See  this post by Andrew Gelman for why you might want to look at the 50% interval instead of the 95% interval.\n  For people not familiar with overwatch, in competitive mode, you&#39;re explicitly told what your ELO-like rating is and you get a badge that reflects your rating. In quick play, you have a rating that&#39;s tracked, but it&#39;s never directly surfaced to the user and you don&#39;t get a badge.\n  It&#39;s generally believed that people are more on edge during competitive play and are more likely to lash out (and, for example, tell you how you should play). The data is consistent with this common belief.\n  Per above, I didn&#39;t want to code tone of messages to avoid bias, so this table only indicates the rate at which people told me I was playing incorrectly or asked that I switch to a different character. The qualitative difference in experience is understated by this table. For example, the one time someone asked me to switch characters in the masculine condition, the request was a one sentence, polite, request (&#34;hey, we&#39;re dying too quickly, could we switch [from the standard one primary healer / one off healer setup] to double primary healer or switch our tank to [a tank that can block more damage]?&#34;). When using the feminine name, a typical case would involve 1-4 people calling me human garbage for most of the game and consoling themselves with the idea that the entire reason our team is losing is that I won&#39;t change characters.\n  The simple model we&#39;re using indicates that there&#39;s probably a difference between both competitive and QP and playing with a masculine vs. a feminine name. However, most published results are pretty bogus, so let&#39;s look at reasons this result might be bogus and then you can decide for yourself.\n    The biggest issue is that this wasn&#39;t a  pre-registered trial. I&#39;m obviously not going to go and officially register a trial like this, but I also didn&#39;t informally &#34;register&#34; this by having this comparison in mind when I started the experiment. A problem with non-pre-registered trials is that there are a lot of degrees of freedom, both in terms of what we could look at, and in terms of the methodology we used to look at things, so it&#39;s unclear if the result is &#34;real&#34; or an artifact of fishing for something that looks interesting. A standard example of this is that, if you look for 100 possible effects, you&#39;re likely to find 1 that appears to be statistically significant with p = 0.01.\n  There are standard techniques to correct for this problem (e.g.,  Bonferroni correction), but I don&#39;t find these convincing because they usually don&#39;t capture all of the degrees of freedom that go into a statistical model. An example is that it&#39;s common to take a variable and discretize it into a few buckets. There are many ways to do this and you generally won&#39;t see papers talk about the impact of this or correct for this in any way, although changing how these buckets are arranged can drastically change the results of a study. Another common knob people can use to manipulate results is curve fitting to an inappropriate curve (often a 2nd a 3rd degree polynomial when a scatterplot shows that&#39;s clearly incorrect). Another way to handle this would be to use  a more complex model, but I wanted to keep this as simple as possible.\n  If I wanted to really be convinced on this, I&#39;d want to, at a minimum, re-run this experiment with this exact comparison in mind. As a result, this experiment would need to be replicated to provide more than a preliminary result that is, at best, weak evidence.\n  One other large class of problem with randomized controlled trials (RCTs) is that, despite randomization, the two arms of the experiment might be different in some way that wasn&#39;t randomized. Since Overwatch doesn&#39;t allow you to keep changing your name, this experiment was done with two different accounts and these accounts had different ratings in competitive mode. On average, the masculine account had a higher rating due to starting with a higher rating, which meant that I was playing against stronger players and having worse games on the masculine account. In the long run, this will even out, but since most games in this experiment were in QP, this didn&#39;t have time to even out in comp. As a result, I had a higher win rate as well as just generally much better games with the feminine account in comp.\n  With no other information, we might expect that people who are playing worse get told how to play more frequently and people who are playing better should get told how to play less frequently, which would mean that the table above understates the actual difference.\n  However  Kasumovic et al., in a gender-based randomized trial of Halo 3, found that players who were playing poorly were more negative towards women, especially women who were playing well (there&#39;s enough statistical manipulation of the data that a statement this concise can only be roughly correct, see study for details). If that result holds, it&#39;s possible that I would&#39;ve gotten fewer people telling me that I&#39;m human garbage and need to switch characters if I was average instead of dominating most of my games in the feminine condition.\n  If that result generalizes to OW, that would explain something which I thought was odd, which was that a lot of demands to switch and general vitriol came during my best performances with the feminine account. A typical example of this would be a game where we have a 2-2-2 team composition (2 players playing each of the three roles in the game) where my counterpart in the same role ran into the enemy team and died at the beginning of the fight in almost every engagement. I happened to be having a good day and dominated the other team (37-2 in a ten minute comp game, while focusing on protecting our team&#39;s healers) while only dying twice, once on purpose as a sacrifice and second time after a stupid blunder. Immediately after I died, someone asked me to switch roles so they could take over for me, but at no point did someone ask the other player in my role to switch despite their total uselesses all game (for OW players this was a Rein who immediately charged into the middle of the enemy team at every opportunity, from a range where our team could not possibly support them; this was Hanamura 2CP, where it&#39;s very easy for Rein to set up situations where their team cannot help them). This kind of performance was typical of games where my team jumped on me for playing incorrectly. This isn&#39;t to say I didn&#39;t have bad games; I had plenty of bad games, but a disproportionate number of the most toxic experiences came when I was having a great game.\n  I tracked how well I did in games, but this sample doesn&#39;t have enough ranty games to do a meaningful statistical analysis of my performance vs. probability of getting thrown under the bus.\n  Games at different ratings are probably also generally different environments and get different comments, but it&#39;s not clear if there are more negative comments at 2000 than 2500 or vice versa. There are a lot of online debates about this; for any rating level other than the very lowest or the very highest ratings, you can find a lot of people who say that the rating band they&#39;re in has the highest volume of toxic comments.\n    Here are some things that happened while playing with the feminine name that didn&#39;t happen with the masculine name during this experiment or in any game outside of this experiment:\n  unsolicited &#34;friend&#34; requests from people I had no textual or verbal interaction with (happened 7 times total, didn&#39;t track which cases were in the experiment and which weren&#39;t)\n  someone on the other team deciding that my team wasn&#39;t doing a good enough job of protecting me while I was playing healer, berating my team, and then throwing the game so that we won (happened once during the experiment)\n  someone on my team flirting with me and then flipping out when I don&#39;t respond, who then spends the rest of the game calling me autistic or toxic (this happened once during the experiment, and once while playing in a game not included in the experiment)\n  The rate of all these was low enough that I&#39;d have to play many more games to observe something without a huge uncertainty interval.\n  I didn&#39;t accept any friend requests from people I had no interaction with. Anecdotally, some people report people will send sexual comments or berate them after an unsolicited friend request. It&#39;s possible that the effect show in the table would be larger if I accepted these friend requests and it couldn&#39;t be smaller.\n  I didn&#39;t attempt to classify comments as flirty or not because, unlike the kinds of commments I did classify, this is often somewhat subtle and you could make a good case that any particular comment is or isn&#39;t flirting. Without responding (which I didn&#39;t do), many of these kinds of comments are ambiguous\n  Another difference was in the tone of the compliments. The rate of games where I was complimented wasn&#39;t too different, but compliments under the masculine condition tended to be short and factual (e.g., someone from the other team saying &#34;no answer for [name of character I was playing]&#34; after a dominant game) and compliments under the feminine condition tended to be more effusive and multiple people would sometimes chime in about how great I was.\n    The rate of complements and the rate of insults in games that didn&#39;t include explanations of how I&#39;m playing wrong or how I need to switch characters were similar in both conditions.\n    Some other factors that would be interesting to look at would be time of day, server, playing solo or in a group, specific character choice, being more or less communicative, etc., but it would take a lot more data to be able to get good estimates when adding it more variables. Blizzard should have the data necessary to do analyses like this in aggregate, but they&#39;re notoriously private with their data, so someone at Blizzard would have to do the work and then publish it publicly, and they&#39;re not really in the habit of doing that kind of thing. If you work at Blizzard and are interested in letting a third party do some analysis on an anonymized data set, let me know and I&#39;d be happy to dig in.\n    Under both conditions, I avoided ever using voice chat and would call things out in text chat when time permitted. Also under both conditions, I mostly filled in with whatever character class the team needed most, although I&#39;d sometimes pick DPS (in general, DPS are heavily oversubscribed, so you&#39;ll rarely play DPS if you don&#39;t pick one even when unnecessary).\n  For quickplay, backfill games weren&#39;t counted (backfill games are games where you join after the game started to fill in for a player who left; comp doesn&#39;t allow backfills). 6% of QP games were backfills.\n  These games are from before the &#34;endorsements&#34; patch; most games were played around May 2018. All games were played in &#34;solo q&#34; (with 5 random teammates). In order to avoid correlations between games depending on how long playing sessions were, I quit between games and waited for enough time (since you&#39;re otherwise likely to end up in a game with some or many of the same players as before).\n  The model used probability of a comment happening in a game to avoid the problem that Kasumovic et al. ran into, where a person who&#39;s ranting can skew the total number of comments. Kasumovic et al. addressed this by removing outliers, but I really don&#39;t like manually reaching in and removing data to adjust results. This could also be addressed by using a more sophisticated model, but a more sophisticated model means more knobs which means more ways for bias to sneak in. Using the number of players who made comments instead would be one way to mitigate this problem, but I think this still isn&#39;t ideal because these aren&#39;t independent -- when one player starts being negative, this greatly increases the odds that another player in that game will be negative, but just using the number of players makes four games with one negative person the same as one game with four negative people. This can also be accounted for with a slightly more sophisticated model, but that also involves adding more knobs to the model.\n    One of the more common comments I got when I wrote this post is that it&#39;s only valid at &#34;low&#34; ratings, like Plat, which is 50%-ile. If someone is going to concede that a game&#39;s community is toxic at 50%-ile and you have to be significantly better than that to avoid toxic players, that seems to be conceding that the game&#39;s community is toxic.\n  However, to see if that&#39;s accurate, I played a bit more and play in games as high as 98%-ile to see if things improved. While there was a minor improvement, it&#39;s not fundamentally different at 98%-ile, so people who are saying that things are much better at higher ranks either have very different experiences than I did or are referring to 99%-ile or above. If it&#39;s the latter, then I&#39;d say that the previous comment about conceding that the game has a toxic community holds. If it&#39;s the former, perhaps I just got unlucky, but based on other people&#39;s comments about their experiences with the game, I don&#39;t think I got particularly unlucky.\n    A common complaint, perhaps the most common complaint by people below 2000 SR (roughly  30%-ile) or perhaps 1500 SR (roughly 10%-ile) is that they&#39;re in &#34;ELO hell&#34; and are kept down because their teammates are too bad. Based on my experience, I find this to be extremely unlikely.\n  People often split skill up into &#34;mechanics&#34; and &#34;gamesense&#34;. My mechanics are pretty much as bad as it&#39;s possible to get. The last game I played seriously was a 90s video game that&#39;s basically  online asteroids and the last game before that I put any time into was the original SNES  super mario kart. As you&#39;d expect from someone who hasn&#39;t put significant time into a post-90s video game or any kind of FPS game, my aim and dodging are both atrocious. On top of that, I&#39;m an old dude with slow reflexes and I was able to get to 2500 SR ( roughly 60%-ile among players who play &#34;competitive&#34;, likely higher among all players) by avoiding a few basic fallacies and blunders despite have approximately zero mechanical skill. If you&#39;re also an old dude with basically no FPS experience, you can do the same thing; if you have good reflexes or enough FPS experience to actually aim or dodge, you basically can&#39;t be worse mechnically than I am and you can do much better by avoiding a few basic mistakes.\n  The most common fallacy I see repeated is that you have to play DPS to move out of bronze or gold. The evidence people give for this is that, when a GM streamer plays flex, tank, or healer, they sometimes lose in bronze. I guess the idea is that, because the only way to ensure a 99.9% win rate in bronze is to be a GM level DPS player and play DPS, the best way to maintain a 55% or a 60% win rate is to play DPS, but this doesn&#39;t follow.\n  Healers and tanks are both very powerful in low ranks. Because low ranks feature both poor coordination and relatively poor aim (players with good coordination or aim tend to move up quickly), time-to-kill is very slow compared to higher ranks. As a result, an off healer can tilt the result of a 1v1 (and sometimes even a 2v1) matchup and a primary healer can often determine the result of a 2v1 matchup. Because coordination is poor, most matchups end up being 2v1 or 1v1. The flip side of the lack of coordination is that you&#39;ll almost never get help from teammates. It&#39;s common to see an enemy player walk into the middle of my team, attack someone, and then walk out while literally no one else notices. If the person being attacked is you, the other healer typically won&#39;t notice and will continue healing someone at full health and none of the classic &#34;peel&#34; characters will help or even notice what&#39;s happening. That means it&#39;s on you to pay attention to your surroundings and watching flank routes to avoid getting murdered.\n  If you can avoid getting murdered constantly and actually try to heal (as opposed to many healers at low ranks, who will try to kill people or stick to a single character and continue healing them all the time even if they&#39;re at full health), you outheal a primary healer half the time when playing an off healer and, as a primary healer, you&#39;ll usually be able to get 10k-12k healing per 10 min compared to 6k to 8k for most people in Silver (sometimes less if they&#39;re playing DPS Moira). That&#39;s like having an extra half a healer on your team, which basically makes the game 6.5 v 6 instead of 6v6. You can still lose a 6.5v6 game, and you&#39;ll lose plenty of games, but if you&#39;re consistently healing 50% more than an normal healer at your rank, you&#39;ll tend to move up even if you get a lot of major things wrong (heal order, healing when that only feeds the other team, etc.).\n  A corollary to having to watch out for yourself 95% when playing a healer is that, as a character who can peel, you can actually watch out for your teammates and put your team at a significant advantage in 95% of games. As Zarya or Hog, if you just boringly play towards the front of your team, you can basically always save at least one teammate from death in a team fight, and you can often do this 2 or 3 times. Meanwhile, your counterpart on the other team is walking around looking for 1v1 matchups. If they find a good one, they&#39;ll probably kill someone, and if they don&#39;t (if they run into someone with a mobility skill or a counter like brig or reaper), they won&#39;t. Even in the case where they kill someone and you don&#39;t do a lot, you still provide as much value as them and, on average, you&#39;ll provide more value. A similar thing is true of many DPS characters, although it depends on the character (e.g., McCree is effective as a peeler, at least at the low ranks that I&#39;ve played in). If you play a non-sniper DPS that isn&#39;t suited for peeling, you can find a DPS on your team who&#39;s looking for 1v1 fights and turn those fights into 2v1 fights (at low ranks, there&#39;s no shortage of these folks on both teams, so there are plenty of 1v1 fights you can control by making them 2v1).\n  All of these things I&#39;ve mentioned amount to actually trying to help your team instead of going for flashy PotG setups or trying to dominate the entire team by yourself. If you say this in the abstract, it seems obvious, but most people think they&#39;re better than their rating. It doesn&#39;t help that OW is designed to make people think they&#39;re doing well when they&#39;re not and the best way to get &#34;medals&#34; or &#34;play of the game&#34; is to play in a way that severely reduces your odds of actually winning each game.\n  Outside of obvious gameplay mistakes, the other big thing that loses games is when someone tilts and either starts playing terribly or flips out and says something to enrage someone else on the team, who then starts playing terribly. I don&#39;t think you can actually do much about this directly, but you can never do this, so 5/6th of your team will do this at some base rate, whereas 6/6 of the other team will do this. Like all of the above, t\n......", "posttime": "2020-06-08 00:28:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "守望,trial,游戏", "title": "“守望”中关于性别的随机试验", "title_en": "Randomized Trial on Gender in Overwatch", "transed": 1, "url": "http://danluu.com/overwatch-gender/", "via": "", "real_tags": ["守望", "trial", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005587, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "内容警告：精神疾病、抑郁、虐待、创伤后应激障碍，诸如此类。如果你对这些话题很敏感，你可能想跳过这个话题。星期三我.", "note_en": "Content warning: mental illness, depression, abuse, PTSD, stuff like that. If you're sensitive to these topics you may want to skip this one. On Wednesday I...", "posttime": "2020-06-08 00:11:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器,god,警告", "title": "对上帝机器的愤怒", "title_en": "Rage Against the God Machine", "transed": 1, "url": "https://buttondown.email/hillelwayne/archive/rage-against-the-god-machine/", "via": "", "real_tags": ["机器", "god", "警告"]}, {"category": "", "categoryclass": "", "imagename": "15a36b7cd9873182bb8688f6321a7279.jpeg", "infoid": 1005586, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Tay Zonday这首歌的视频十年前就在网上疯传，但许多人并没有意识到这是一首关于制度性种族主义的强有力的国歌。", "note_en": "The video for Tay Zonday’s song went viral a decade ago, but many people didn't realize it was a powerful anthem about institutional racism.", "posttime": "2020-06-08 00:10:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,互联网,jammed", "title": "黑客用互联网经典“巧克力雨”干扰芝加哥警方的扫描仪", "title_en": "Hackers Jammed Chicago Police Scanners with Internet Classic ‘Chocolate Rain’", "transed": 1, "url": "https://www.vice.com/en_us/article/889nw4/hackers-jammed-chicago-police-scanners-with-internet-classic-chocolate-rain", "via": "", "real_tags": ["黑客", "互联网", "jammed"]}, {"category": "", "categoryclass": "", "imagename": "e4c43ec0ad473549402c1060f6cc2706.jpg", "infoid": 1005585, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国食品和药物管理局(Food and Drug Administration，简称FDA)目前卷入了一场令人惊讶的激烈烹饪对峙-法国奶酪制造商(和美国奶酪爱好者)与监管机构对峙，所有这些都是因为一个非常小的问题：奶酪螨虫。\n奶酪螨是一种微小的小虫子，它们生活在陈年奶酪的表面，咀嚼着生长在那里的微小霉菌。对于许多陈年奶酪来说，它们是一种行业滋扰，轻轻地把奶酪一扫而空。但对于米莫莱特(一种鲜艳的橙色法国奶酪)来说，他们实际上是受到鼓励的。\n螨类在果皮上咀嚼几年，然后在米莫莱特出售之前被清除-通常是用压缩空气和一点刷手。但总有一些人躲在后面。现在FDA正在进行打击。\n根据FDA的Patricia El-Hinnawy的说法，没有官方的限制，但目标是每平方英寸不超过6只螨类。对于米莫莱特来说，这几乎是一个不可能的标准。\nBenoit de Vitton是米莫莱特最大的生产商之一Isigny的北美代表。今年3月，德维顿开始收到与他合作的十几家进口商的来信，称他们的米莫莱特货物已被扣留。\n德维顿估计，他现在新泽西州的FDA仓库里大约有一吨奶酪。他们说这种产品，因为有螨虫，不适合人类食用，德维顿叹了口气。\n具有讽刺意味的是，德维顿指出，据传米莫莱特本身是因为17世纪的进口问题而被创造出来的。当时法国正与荷兰交战，国王不想让更多的荷兰豪达来到法国。所以他要求创造一种同样的奶酪。\n但是在21世纪，我们需要禁止奶酪吗？微生物学家雷切尔·达顿在哈佛大学经营着一家奶酪实验室，我们向她了解了螨类的危险。达顿指出，已经有一些关于螨类过敏的报道，但似乎仅限于接触过大量螨类的人。\n达顿说，虽然我们可能不喜欢考虑虫子，但它们是奶酪如此美味的原因之一。\n奶酪绝对是活的，达顿笑了。所有这些生命--霉菌、细菌、酵母菌和螨虫--都有助于奶酪成为现在的样子。达顿说，米莫莱特上的螨类可以贡献自己的味道(它们有一种有点泥土的气味)，通过蚕食果皮，它们还可以增加曝气量-以及其他微生物可以工作的表面积。\n达顿明白这听起来并不吸引人，但恳请人们认识到这些虫子的好工作。肯定有一些微生物会使食物变质，让你吃起来不舒服，或者有点恶心。但是，每当你吃一块奶酪或一口酸奶，吃一片面包或一杯酒--这些都是由不同类型的微生物发酵的食物的例子。\n在整个法国，奶酪爱好者一直在集会支持米莫莱特。有电台故事，有YouTube视频--当然，甚至还有一项拯救米莫莱特Facebook活动的前同事(Save The Mimolette Facebook Campaign)。\n在美国，人们的反应稍微平淡一些。一些奶酪销售商正在买断有限的供应，但大多数人都满足于对此不屑一顾。波特兰Cyril‘s奶酪/葡萄酒酒吧的萨莎·戴维斯(Sasha Davies)担心，灭螨行动可能会对其他陈年奶酪意味着什么，但通常情况下，拿到陈年的豪达奶酪而不是米莫莱特奶酪是可以的。\n她承认，我发现我可以用很多其他奶酪来挠我对米莫莱特的瘙痒。\n戴维斯说，人们对米莫莱特的热情不仅仅在于它的焦糖味、乳酸味或明亮的橙色。\n她说，有些奶酪--尽管我认为它们味道鲜美，但它们牵动着我的心弦，要么是因为我喜欢做奶酪的人，要么是因为我对身处一个特殊的地方有如此美好的记忆。食物从来不是真正的食物。\n对于许多法国人来说，米莫莱特带来了记忆、家庭和家的味道-还有螨虫。", "note_en": "The Food and Drug Administration is currently embroiled in a surprisingly heated culinary standoff — pitting French cheese-makers (and American cheese-lovers) against regulators, all because of one very small problem: cheese mites.\n  Cheese mites are microscopic little bugs that live on the surfaces of aged cheeses, munching the microscopic molds that grow there. For many aged cheeses, they&#39;re something of an industry nuisance, gently brushed off the cheeses. But for Mimolette, a bright orange French cheese, they&#39;re actually encouraged.\n  The mites munch on the rind for a few years and then are removed — usually with a blast of compressed air and a bit of hand-brushing — before Mimolette is sold. But there are always a few hiding behind. And now the FDA is cracking down.\n  According to the FDA&#39;s Patricia El-Hinnawy, there&#39;s no official limit, but the target is no more than six mites per square inch. For Mimolette, that&#39;s a near impossible standard.\n  Benoit de Vitton is the North American representative for  Isigny, one of the largest producers of Mimolette. In March, de Vitton began receiving letters from each of the dozen importers he works with, saying that their Mimolette shipments had been detained.\n    De Vitton estimates that he now has about a ton of cheese sitting in FDA warehouses in New Jersey. &#34;They say the product, because of the mites, it is not proper for human consumption,&#34; de Vitton sighs.\n  Ironically, de Vitton notes that Mimolette itself is rumored to have been created because of import issues in the 17th century. &#34;The French were at war with Holland, and the king didn&#39;t want any more Dutch Gouda coming to France. So he asked to create kind of the same cheese.&#34;\n  But in the 21st century, do we need a cheese ban? Microbiologist Rachel Dutton runs a  cheese lab at Harvard University, and we checked in with her about the dangers of mites. Dutton notes that there have been some reports of mite allergies, but they seem to be restricted to people who have come into contact with large numbers of mites.\n     And Dutton says that while we may not like to think about bugs, they&#39;re a part of what makes cheese so delicious.\n  &#34;Cheese is absolutely alive,&#34; Dutton laughs. And all of that life — the molds, bacteria, yeasts and mites — help make cheese what it is. Dutton says that the mites on Mimolette can contribute flavors of their own (they have a somewhat earthy smell), and by eating into the rind, they can also increase aeration — and the surface area in which the other microbes can do their work.\n  Dutton understands that this doesn&#39;t sound appealing, but implores people to realize the good work of these bugs. &#34;There definitely are microbes that can spoil food and make either it bad for you to eat or just sort of gross. But any time you eat a piece of cheese or a bite of yogurt, have a piece of bread or a glass of wine — these are all examples of foods fermented by different types of microbes.&#34;\n  Throughout France, cheese lovers have been rallying in support of Mimolette. There are  radio stories,  YouTube videos — there&#39;s even an ex-pat  Save the Mimolette Facebook campaign (of course).\n  In America, the response is a bit more subdued. Some cheesemongers are buying up the limited supply, but most are content to shrug it off. Sasha Davies, of  Cyril&#39;s cheese/wine bar in Portland, is nervous about what the mite crackdown could mean for other aged cheeses, but in general is fine reaching for an aged Gouda instead of Mimolette.\n  &#34;I find I can scratch the itch I feel for Mimolette with a lot of other cheeses,&#34; she admits.\n  Davies says that the fervor for Mimolette isn&#39;t just about its caramel notes or lactic tang or bright orange color.\n  &#34;There are cheeses that — even though I think they taste delicious, they tug at my heartstrings, either because I love the person that makes them, or I have this great memory of being in a special place,&#34; she says. &#34;Food is never really just food.&#34;\n  And for many French people, Mimolette brings a taste of memory, family and home — as well as mites.", "posttime": "2020-06-07 23:53:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "法国,mites,奶酪", "title": "小螨子引发法国奶酪进口大战(2013)", "title_en": "Tiny Mites Spark Big Battle over Imports of French Cheese (2013)", "transed": 1, "url": "https://www.npr.org/sections/thesalt/2013/05/11/180570160/tiny-mites-spark-big-battle-over-imports-of-french-cheese", "via": "", "real_tags": ["法国", "mites", "奶酪"]}, {"category": "", "categoryclass": "", "imagename": "eb0927ea660f1770692199fe85377021.png", "infoid": 1005584, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "接收日期：2012年9月3日/修订日期：2012年10月29日/接受日期：2012年10月30日/发布日期：2012年11月5日。\n在进化生物学中，人们对随机有机体及其随机环境之间的关系的关注已经倾向于有机体的适应性和学习能力，而不是环境的属性。这篇文章致力于环境的算法方面及其与活的有机体的相互作用。我们问，是否可以用生命存在的事实来确定自然界与算法的随机性相差有多远。这篇论文使用了一种新的方法来解决行为进化问题，使用来自信息论、算法复杂性和计算热力学的工具来支持关于物理环境的近乎最优结构的直观假设，这将被证明有利于有机体的进化和生存，并勾勒出这些工具的潜力，这些工具目前与生物学无关，未来可以用来解决不同的、更深层次的问题。我们对自然环境的算法结构的讨论做出了贡献，并提供了统计和计算方面的论点，以支持这样的直觉主张，即生命系统将无法在完全不可预测的环境中生存，即使通过自然选择(大脑记忆或DNA)具有适应性并配备了存储和学习能力。查看全文。\n关键词：行为生态学；算法随机性；计算热力学；Kolmogorov-Chaitin复杂性；信息论行为生态学；算法随机性；计算热力学；Kolmogorov-Chaitin复杂性；信息论。\n►显示数字", "note_en": "Received: 3 September 2012 / Revised: 29 October 2012 / Accepted: 30 October 2012 / Published: 5 November 2012\n In evolutionary biology, attention to the relationship between stochastic organisms and their stochastic environments has leaned towards the adaptability and learning capabilities of the organisms rather than toward the properties of the environment. This article is devoted to the algorithmic aspects of the environment and its interaction with living organisms. We ask whether one may use the fact of the existence of life to establish how far nature is removed from algorithmic randomness. The paper uses a novel approach to behavioral evolutionary questions, using tools drawn from information theory, algorithmic complexity and the thermodynamics of computation to support an intuitive assumption about the near optimal structure of a physical environment that would prove conducive to the evolution and survival of organisms, and sketches the potential of these tools, at present alien to biology, that could be used in the future to address different and deeper questions. We contribute to the discussion of the algorithmic structure of natural environments and provide statistical and computational arguments for the intuitive claim that living systems would not be able to survive in completely unpredictable environments, even if adaptable and equipped with storage and learning capabilities by natural selection (brain memory or DNA). View Full-Text\n Keywords:  behavioral ecology; algorithmic randomness; computational thermodynamics; Kolmogorov–Chaitin complexity; information theory   behavioral ecology;  algorithmic randomness;  computational thermodynamics;  Kolmogorov–Chaitin complexity;  information theory\n  ► ▼Show Figures", "posttime": "2020-06-07 23:53:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,自然界,thermodynamic", "title": "生命作为自然界算法结构的热力学证据(2012)", "title_en": "Life as Thermodynamic Evidence of Algorithmic Structure in Nature (2012)", "transed": 1, "url": "https://www.mdpi.com/1099-4300/14/11/2173", "via": "", "real_tags": ["算法", "自然界"]}, {"category": "", "categoryclass": "", "imagename": "e113636a761397328865bd16daeb89ae.png", "infoid": 1005583, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-根据周四发布的一项研究，长期以来被开发商吹捧为消除道路死亡的一种方式的自动驾驶汽车，可能只能防止三分之一的美国道路撞车事故。\n由美国保险公司资助的研究机构公路安全保险研究所(IIHS)发现，剩余的撞车事故是由错误造成的，即自动驾驶系统没有配备比人类司机更好的处理能力。\n由自动驾驶公司和研究人员组成的联盟自动车辆教育合作伙伴(Partners For Automated Vehicle Education)周四在一份声明中表示，这项研究错误地假设自动驾驶汽车只能防止感知错误和丧失能力导致的撞车。\n该联盟说，根据这项研究的计算，如果包括超速和违反交通法规造成的事故，大约72%的撞车事故是可以避免的。\n交通专家说，大约十分之九的撞车事故是人为错误造成的，据估计，去年有超过3.6万人死于美国的车祸。\n包括传统汽车制造商和科技公司在内的自动驾驶汽车开发商一再将全自动驾驶定位为大幅减少道路死亡的工具。\n但根据IIHS对全国5000多起警方报告的代表性撞车事故的分析，并不是所有的人为错误都可以通过摄像头、雷达和其他基于传感器的技术来消除。\n研究发现，所有撞车事故中有三分之一是感应和感知错误，或司机丧失驾驶能力的唯一结果。\n大多数撞车事故都是由于更复杂的错误造成的，比如对其他道路使用者的行为做出了错误的假设，根据路况开得太快或太慢，或者做出了不正确的回避操作。许多撞车事故都是由多个错误造成的。\n“我们的目标是表明，如果你不处理这些问题，自动驾驶汽车不会带来巨大的安全效益，”IIHS负责研究的副总裁、该研究的合著者杰西卡·西奇诺(Jessica Cicchino)说。", "note_en": "(Reuters) - Self-driving cars, long touted by developers as a way to eliminate road deaths, could likely only prevent a third of all U.S. road crashes, according to a study released on Thursday.\n The Insurance Institute for Highway Safety (IIHS), a research group financed by U.S. insurers, found the remaining crashes were caused by mistakes that self-driving systems are not equipped to handle any better than human drivers.\n Partners for Automated Vehicle Education, a consortium of self-driving companies and researchers, said in a statement on Thursday the study wrongly assumed that automated cars could only prevent crashes caused by perception errors and incapacitation.\n Some 72% of crashes were avoidable, based on the study’s calculations, if accidents caused by speeding and violation of traffic laws were included, the consortium said.\n Traffic experts say roughly nine in 10 crashes result from human error and more than 36,000 people are estimated to have died in U.S. car crashes last year.\n Self-driving vehicle developers, including traditional automakers and technology companies, have repeatedly positioned fully automated driving as a tool to drastically reduce road deaths.\n But not all human mistakes can be eliminated by camera, radar and other sensor-based technology, according to the IIHS analysis of more than 5,000 representative police-reported crashes nationwide.\n One-third of all crashes were the exclusive result of sensing and perception errors, or driver incapacitation, the study found.\n Most crashes were due to more complex errors, such as making wrong assumptions about other road users’ actions, driving too fast or too slow for road conditions, or making incorrect evasive maneuvers. Many crashes resulted from multiple mistakes.\n “Our goal was to show that if you don’t deal with those issues, self-driving cars won’t deliver massive safety benefits,” said Jessica Cicchino, IIHS vice president for research and a coauthor of the study.", "posttime": "2020-06-07 23:37:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发现,cars,研究", "title": "研究发现，自动驾驶汽车只能防止美国三分之一的撞车事故", "title_en": "Self-Driving Cars Would Only Prevent a Third of America's Crashes, Study Finds", "transed": 1, "url": "https://www.reuters.com/article/us-autos-self-driving/self-driving-cars-could-only-prevent-a-third-of-us-crashes-study-idUSKBN23B294", "via": "", "real_tags": ["发现", "cars", "研究"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005582, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "elfutils debuginfod是elfutils 0.178+中的一个客户端/服务器，它通过HTTP自动将ELF/DWARF/源代码从服务器分发到客户端(如调试器)。\n任何人都可以出于其私人目的运行debuginfod服务器。软件发行商被邀请运行公共服务器以供社区使用。见鬼，任何人都可以运行基于来自其他人的可再分发工件的服务器。要配置客户端工具以使用它们，只需将任何服务器URL添加到$DEBUGINFOD_URLS环境变量(以空格分隔)。以下公共服务目前[2020-02]欢迎用户。\n第一个任务与所有其他任务联合，因此仅凭它就可以访问所有任务，并请求基本的进度诊断。\ndebuginfod客户端支持正在构建中，或者已经在各种与二进制相关的实用程序中可用。下面我们总结一下当前的上游状况[2020-02]。请注意，发行版可能会落后于上游开发。", "note_en": "elfutils debuginfod is a client/server in elfutils 0.178+ that automatically distributes elf/dwarf/source-code from servers to clients such as debuggers across HTTP.\n     Anyone may run debuginfod servers for their private purposes. Software publishers are invited to run public servers for use by the community. Heck, anyone may run servers based on redistributable artifacts from others. To configure a client tool to use them, simply add any of the server URLs to your $DEBUGINFOD_URLS environment variable (space-separated). The following public services currently [2020-02] welcome users.\n  The first one federates to all the others, so   alone will get you to all of them, plus request basic progress diagnostics.\n        debuginfod client-side support is under construction or already available in a variety of binary-related utilities. We summarize current upstream status [2020-02] below. Note that distros may lag behind upstream developments.", "posttime": "2020-06-07 23:19:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,下载,download,服务器", "title": "自动下载gdb中的符号和源代码", "title_en": "Automatically download symbols and sources in GDB", "transed": 1, "url": "https://sourceware.org/elfutils/Debuginfod.html", "via": "", "real_tags": ["代码", "下载", "download", "服务器"]}, {"category": "", "categoryclass": "", "imagename": "b9b9291f0e79dd17cead85c21edb8c5e.png", "infoid": 1005580, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英特尔和AMD在处理器市场的唯一合作仍在继续，因为AMD似乎已经取消了对其提供给英特尔的Kaby Lake-G处理器集成显卡的驱动程序更新的支持。三个月前，英特尔向AMD放弃了对图形单元的支持，该图形单元一年来没有收到更新。对于英特尔的客户来说，这来得特别不是时候，因为这也使他们无法获得AMD最新的Windows10版本2004更新驱动程序增强功能。我们联系了英特尔，并收到了对此事的评论，但AMD尚未向我们提供官方声明。\n作为快速更新，英特尔(Intel&39；39；)的Kaby Lake-G处理器搭载了劲敌AMD的Vega图形引擎，这是个人电脑历史上最奇怪的合作之一。这些芯片将一个独立的AMD RADEON RX Vega M显卡单元与英特尔的凯比湖(Kaby Lake)处理核心配对在一个封装中。这一组合已经产生了获奖的性能水平，但英特尔在2019年10月扼杀了该项目，因为它将重点转向了自己的Xe图形架构项目，用于未来的产品。\n尽管取消了，英特尔承诺为其Kaby Lake-G芯片提供五年的驱动程序支持。然而，这些计划遇到了障碍，英特尔让其客户12个月没有驱动程序更新。英特尔通过将支持转到AMD解决了这个问题。新的驱动力包括AMD的主线肾上腺素2020套餐。这些驱动程序允许Kaby Lake-G客户安装AMD的最新驱动程序，从而获得新游戏的重要性能提升以及新驱动程序带来的其他优势。\n但现在，这条升级之路似乎也走到了尽头。在看到用户无法在Hades Canyon NUC的Vega M GH/GL上安装AMD的WDDM 2.7驱动程序(20.5.1)或最新的WHQL(20.4.2)的报告后，我们尝试在Hades Canyon NUC上安装驱动器。正如您在上面的屏幕截图中看到的，两个驱动程序包都安装失败，提供了一条模糊的消息，指出硬件配置不受支持。\n我们联系了英特尔寻求评论，该公司向Tom的硬件提供了以下简短声明：\n我们正在努力将RADEON图形驱动程序支持带回英特尔NUC 8 Extreme Mini PC(以前代号为“哈迪斯峡谷”)。&#34；\n我们也询问了AMD关于此事，但尚未收到官方声明，何时，如果，该公司将再次提供支持的RADEON RX织女星图形单位在凯比湖-G芯片。\n目前，英特尔的Kaby Lake-G客户再次没有及时更新最新的驱动程序。这包括AMD在其针对新的Windows10版本2004的最新驱动程序中提供的增强支持。我们将在了解更多信息时进行更新。", "note_en": "The saga of Intel and AMD&#39;s lone collaboration in the processor market continues as AMD has seemingly pulled support for driver updates for the integrated graphics units it provided to Intel for the Kaby Lake-G processors. The issue comes three months after Intel ceded support for the graphics units, which  hadn&#39;t received an update in a year, to AMD. This comes at a particularly bad time for Intel&#39;s customers, as it also prevents them from getting AMD&#39;s latest driver enhancements for the Windows 10 version 2004 update.  We reached out to Intel and received a comment on the matter, but AMD hasn&#39;t provided us with an official statement yet.\n As a quick refresher, in one of the stranger collaborations in PC history, Intel&#39;s Kaby Lake-G processors came with a Vega graphics engine from its bitter rival AMD. The chips paired a discrete AMD Radeon RX Vega M graphics unit with Intel&#39;s Kaby Lake processing cores in a single package. That combo  yielded award-winning levels of performance, but Intel  killed the project in October 2019 as it switched focus to its own  Xe Graphics Architecture for future products.\n   Despite the cancellation, Intel promised five years of driver support for its Kaby Lake-G chip. Those plans hit a snag, though, and Intel left its customers without driver updates for 12 months. Intel fixed that problem by  turning over support to AMD. The new drivers consisted of AMD&#39;s mainline Adrenalin 2020 package. Those drivers allowed Kaby Lake-G customers to install AMD&#39;s latest drivers, thus receiving important performance boosts for new games and the other advantages that come along with new drivers.\n  But now that upgrade path appears to have come to an end, too. After seeing reports that users couldn&#39;t install AMD’s WDDM 2.7 driver (20.5.1) on the Vega M GH/GL in the Hades Canyon NUC, or the latest WHQL (20.4.2), we attempted to install the drives on the Hades Canyon NUC. As you can see in the screenshot above, both driver packages failed to install, providing a nebulous message that says the hardware configuration isn&#39;t supported.\n We reached out to Intel for comment, and the company provided the following brief statement to  Tom&#39;s Hardware:\n &#34;We are working to bring back Radeon graphics driver support to Intel NUC 8 Extreme Mini PCs (previously codenamed “Hades Canyon”).&#34;\n We&#39;ve inquired with AMD on the matter, too, but have yet to receive an official statement on when, and if, the company will provide support again for the Radeon RX Vega graphics units in the Kaby Lake-G chips.\n For now, Intel&#39;s Kaby Lake-G customers are again left without timely updates from the latest drivers. That includes the enhanced support that AMD wrapped in its latest drivers for the new Windows 10 version 2004. We&#39;ll update as we learn more.", "posttime": "2020-06-07 23:00:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,英特尔,取消,pulls,amd", "title": "AMD取消对英特尔Kaby Lake-G处理器的驱动程序支持", "title_en": "AMD Pulls Driver Support for Intel's Kaby Lake-G Processors", "transed": 1, "url": "https://www.tomshardware.com/news/amd-pulls-driver-support-for-intel-kaby-lake-g", "via": "", "real_tags": ["程序", "英特尔", "取消", "pulls", "amd"]}, {"category": "", "categoryclass": "", "imagename": "afe3f32a81901c375d7927b7dde9424a.png", "infoid": 1005579, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在考虑到目前的危机后，平均千禧一代自进入劳动力市场以来经历了比美国历史上任何一代人都要慢的经济增长。\n千禧一代将在他们的余生中承受这些经济创伤，表现为收入下降，财富减少，以及住房拥有率等里程碑事件的延迟。\n就业方面的损失尤其严重。几个月的残酷冠状病毒让劳动力市场回到了千年之交。\n4月份，经济触底，就业人数与1999年11月差不多。对于比其他任何一代人都更受经济衰退影响的一代人来说，经济回归Y2K时代是一个合适的象征。\n5月份情况有所改善，但这一改善只是意味着我们回到了2000年12月的就业水平。对于当时成年的千禧一代来说，就好像他们同名时代所有缓慢的扩张和就业复苏在几周内就烟消云散了。\n这些损失不仅仅是象征性的。就在千禧一代进入他们的黄金工作年龄段时，这场经济衰退给年轻员工带来了压力-年龄最大的千禧一代接近40岁，而最年轻的人只有25岁左右。我们的计算显示，今年3月和4月，千禧一代的就业率暴跌了16%。这比X世代(12%)或婴儿潮一代(13%)都要快。\n从比例上看，更年轻的一代，也就是所谓的动物园人，遭受的痛苦比他们所有人都要严重。2020年，他们三分之一的工作岗位在两个月内蒸发了，但Z世代才刚刚进入劳动力大军-年龄最大的动物园人才20岁出头-所以他们的损失绝对值并不是那么大。\n2019年初，千禧一代超过了X世代，成为美国全职劳动力中人数最多的一代。但冠状病毒危机对千禧一代的打击如此之大，以至于他们即将把榜首位置还给X世代。\n美国大学(American University)经济学家格雷·金布罗(Gray Kimbough)指出，年龄最大的千禧一代，比如他自己，经历了9/11恐怖袭击，并在大约同一时期遭受的经济衰退中进入劳动力市场。我们之前曾准确地将他称为一名千禧一代的系列破解者，他指出，最年长的千禧一代经历了9/11恐怖袭击，并进入了劳动力市场。他们早年在就业复苏期间努力寻找工作，结果却受到了大衰退和另一次复苏的打击。当然，还有另一场衰退。\n金布罗说：“这里的故事不仅仅是这是一场严重的衰退，而且它对年轻人的影响更大，而且对那些已经受到冲击的人也是如此。”\n莎拉·丹尼尔斯(Sarah Daniels)前景乐观，乐于发笑，但像许多千禧一代一样，她的就业之路是艰难的。\n丹尼尔斯在多拉多县长大，那里的加州中央山谷让位于内华达山脉。现年38岁的她在惨淡的就业市场中进入劳动力市场，与毒品、酒精和赌博作斗争。她被关了两次。\n自2016年获释以来，她作为一名药物滥用顾问建立了帮助他人的职业生涯。但这场危机已经造成了损失。她失去了一份兼职工作，还没有收到退税或刺激计划支票。\n丹尼尔斯说：“我过去做每件事的方式都是错误的。”“这是我人生中的第一次，我在工作，做我应该做的每件事，我感觉每件事都比以前难了10倍。”\n丹尼尔斯再次自食其力，在另一个雇主找到了全职工作，但她仍然和母亲住在一起。她可能永远买不起自己的房子。在这一点上，她会很高兴能得到一套一居室的公寓。\n她说：“你做的每件事都是对的，但你仍然觉得自己无法前进。”\n大衰退使年轻工人在工资阶梯上下降了几级。研究表明，即使年长的同事收复了所有失去的土地，他们也从未恢复过。这种情况再次发生在许多同样的年轻工人身上。\n在2019年的一份工作论文中，人口普查局经济学家凯文·林茨(Kevin Rinz)利用大衰退严重程度的地区差异计算出，虽然千禧一代的就业在十年内从大衰退中复苏，但千禧一代的收入从未恢复。在加州大学伯克利分校(University Of California At Berkeley)的丹尼·亚根(Danny Yagan)早期工作的基础上，林茨基于政府数据库中超过410万人十几年的年度数据得出了他的发现。\n林茨发现，由于大衰退，2005年至2017年间，千禧一代的平均收入损失了约13%。这比X世代遭受的9%的挫折还要糟糕，几乎是婴儿潮一代面临的7%损失的两倍。到这一时期结束时，婴儿潮一代的收入已经回升，尽管千禧一代的收入仍然远远低于他们本应达到的水平。\n千禧一代在经济衰退期间饱受高失业率之苦，最终不太可能为高薪雇主工作，也不太可能像衰退打击不那么严重的地方的工人那样完成那么多的教育。\n他们不得不在职业生涯早期满足于更糟糕的工作，这压低了他们一生的收入潜力。林茨发现，雇主方面也发生了变化。受灾最严重地区的大雇主巩固了对劳动力市场的权力，反过来，为几乎别无选择的年轻工人提供的机会更少。\n圣路易斯联邦储备银行(Federal Reserve Bank of St.Louis)的政策分析师安娜·肯特(Ana Kent)说，“如果人们在经济衰退期间进入劳动力大军，并从事薪酬较低的工作，这将延续他们毕生职业生涯的大部分时间。”“这不仅会影响他们的收入，还会影响他们的财富，影响他们存首付的能力，也会影响他们实现其他人生目标的能力。”\n肯特说，与前几代人在他们这个年龄时相比，千禧一代的经济缓冲要少得多，尽管他们一直在做很多正确的事情。\n金布罗对美联储(Federal Reserve)数据的分析显示，千禧一代结婚和生孩子的时间都较晚，而且，在婴儿潮一代和X世代都在积累资产的年龄，千禧一代没有住房净资产。\n我们谈论千禧一代在家庭财富方面落后，但我不认为人们完全理解他们在积累住房财富方面有多么落后。在2019Q4美联储的DFA数据中，千禧一代持有的房地产净财富几乎为零。pic.twitter.com/w5509e2ygM。\n-Gray&#39；连环千年神话揭穿者Kimbough(@graykimbough)2020年5月22日。\n然而，肯特对美联储(Fed)单独数据的分析显示，千禧一代的支出比X世代或同年龄段的婴儿潮一代更多。也就是说，他们更有可能花的比赚的少，52%的千禧一代在34岁时为退休储蓄。在这个年龄段，只有42%的婴儿潮一代有退休储蓄。\n“这种说法是，‘哦，你应该更加努力地工作，靠自己的努力下沉还是游泳？’它非常美国化，但它忽略了一个事实，那就是现在的潮水要强得多，许多千禧一代都在逆流而上，“肯特说。\n千禧一代是历史上受教育程度最高、最多元化的一代--至少在他们超过千禧一代之前是这样。这些区别随之而来的是负担。\n布鲁金斯学会(Brookings Institution)高级研究员威廉·盖尔(William Gale)表示，千禧一代不断增加的债务负担超过了他们在教育方面取得的成就。他补充说：“与前几代人相比，他们的父母和公共当局为他们的大学教育提供的资金更少。”\n非洲裔美国人和西班牙裔千禧一代的庞大人口更是雪上加霜，因为这些群体继续遭受几代人系统性歧视的影响。盖尔和几位合作者在美国国家经济研究局(National Bureau Of Economic Research)传阅的一篇工作论文中发现，即使在控制了年龄、教育程度、婚姻状况甚至收入方面的差异后，黑人和白人家庭之间的贫富差距仍在继续扩大。\n这是更多边缘化群体落后趋势的一部分。肯特发现，拥有大学学位的千禧一代在财富方面与前几代人相差不远，但根据前几代人的数据，他们受教育程度较低的同龄人拥有的财富略高于他们现阶段预期财富的一半。\n肯特说：“并不是每一个千禧一代都会表现得更差。”这位29岁的女孩以自己为例。她认为自己是西班牙裔，这一类别在经济低迷中受到了不成比例的沉重打击，但她的博士和白领工作让她免受了一场危机的影响，这场危机首先打击了服务业受教育程度较低的工人。\n肯特本周早些时候写道：“一些千禧一代，特别是那些黑人、西班牙裔或女性，或者没有学士学位的人，在进入流感大流行时已经在经济上处于脆弱状态。”\n根据肯特对美联储数据的分析，在全国范围内，大约有12%的员工无法支付400美元的紧急开支-即使是在家庭或信用卡的帮助下也是如此。12%的数字适用于非西班牙裔白人千禧一代，但这一数字跃升至非西班牙裔黑人千禧一代的32%，西班牙裔千禧一代的20%，千禧一代女性的17%。对于所有获得学士学位以下的千禧一代来说，这一数字是25%。\n“即使经过这么多年的经济扩张，他们仍然低于我们的预期，”她告诉我们。\n并非巧合的是，肯特对劳工部数据的分析显示，在大流行期间，女性、西班牙裔工人和受教育程度较低的人在失业的千禧一代中的比例也过高。", "note_en": "After accounting for the present crisis, the average millennial has experienced slower economic growth since entering the workforce than any other generation in U.S. history.\n Millennials will bear these economic scars the rest of their lives, in the form of lower earnings, lower wealth and delayed milestones, such as homeownership.\n  The losses are particularly acute on the jobs front. A few brutal months of the  coronavirus set the labor market back to the turn of the millennium.\n In April, the economy bottomed out with about as many jobs as in November of 1999. The economic regression to the Y2K era is a fitting symbol for a generation that — more than any other — has been shaped by recession.\n Things improved in May, but the improvement just means we’re back to December 2000 levels of employment. For millennials who came of age then, it’s as if all the plodding expansions and job recoveries of their namesake epoch evaporated in weeks.\n  The losses aren’t merely symbolic. This recession steamrolled younger workers just as millennials were entering their prime working years — the oldest millennials are nearing 40 while the youngest are in their mid-20s. Millennial employment plunged by 16 percent in March and April this year, our calculations show. That’s faster than either Gen X (12 percent) or the baby boomers (13 percent).\n    Proportionally, the even younger generation, known as zoomers, suffered worse than all of them. A third of their jobs vaporized in two months in 2020.But Gen Z is only just entering the labor force — the oldest zoomers are in their early 20s — so their losses weren’t as large in absolute terms.\n  At the beginning of 2019, millennials became the largest generation in the United States’ full-time workforce, surpassing Gen X. But the coronavirus crisis walloped millennials so disproportionately that they’re on the precipice of giving the top generational spot back to Gen X.\n  Gray Kimbrough, an economist at American University whom we’ve previously and accurately branded a  serial millennial myth debunker, points out the oldest millennials, such as himself, lived through the 9/11 terrorist attacks and entered the labor market in the recession that hit around the same time. They spent their early years struggling to find work during a job recovery, only to be hit by the Great Recession and another recovery. And, of course, yet another recession.\n  “The story here is not just that it’s a bad recession, and that it’s hitting young people more, but that it’s hitting people who have already been hit,” Kimbrough said.\n   Sarah Daniels has an optimistic outlook and a ready laugh, but like many millennials, her path to the workforce was difficult.\n Daniels grew up in El Dorado County, where California’s Central Valley gives way to the Sierra Nevada. Now 38, she entered the workforce in a dismal job market and struggled with drugs, alcohol and gambling. She was locked up twice.\n Since her release in 2016, she’s built a career helping others as a substance abuse counselor. But the crisis has taken a toll. She lost one of her part-time jobs and has yet to receive her tax refund or her stimulus check.\n “I used to do everything the wrong way,” Daniels said. “For one of the first times in my life, I’m working and doing everything I’m supposed to, and I feel like everything is just 10 times harder.”\n  Daniels landed on her feet yet again, finding full-time work at her other employer, but she still lives with her mother. She might never be able to afford a house of her own. At this point, she’d be happy to get a one-bedroom apartment.\n  “You’re doing everything right and then you still feel you’re still not able to move forward,” she said.\n  The Great Recession pushed young workers a few steps down the wage ladder. Research shows they never recovered, even as their older colleagues regained all the ground they’d lost. It’s happening again, to many of those same young workers.\n In a 2019  working paper, Census Bureau economist Kevin Rinz used regional differences in the Great Recession’s severity to calculate that while millennial employment recovered from the Great Recession within a decade, millennial earnings never did. Building on  earlier work from the University of California at Berkeley’s Danny Yagan, Rinz based his findings on more than a dozen years of annual data for more than 4.1 million people in a government database.\n  Thanks to the Great Recession, the average millennial lost about 13 percent of their earnings between 2005 and 2017, Rinz found. That’s worse than Gen X’s 9 percent setback and almost double the 7 percent loss faced by baby boomers. By the end of the period, baby boomer earnings had recovered, even as millennials remained well below where they should have been.\n   Millennials, suffering through high unemployment during the recession, ended up less likely to work for high-paying employers and less likely to complete as much education as workers in places where the recession didn’t hit as hard.\n  They had to settle for worse jobs early in their careers, depressing their lifetime earnings potential. The employer side changed, too, Rinz finds. Big employers in the hardest-hit areas consolidated power over labor markets and, in turn, offered less to young workers who had few other options.\n “If people enter the labor force during a recession, and they get into lower-paying jobs, that carries forward for much of their lifelong working careers,” said Ana Kent, a policy analyst at the Federal Reserve Bank of St. Louis. “That’s going to have impacts on not only their income but their wealth and also their ability to save for a down payment and their ability to meet other lifetime goals.”\n    Millennials had much less of a financial cushion than previous generations did at their age, Kent said, even though they had been doing many things right.\n  Millennials are getting married later and having children later, and, at an age when boomers and Gen X were building equity, millennials have no housing net worth, Kimbrough’s  analysis of Federal Reserve data shows.\n We talk about millennials lagging behind in household wealth, but I don&#39;t think people fully comprehend how far behind they lag in building up housing wealth in particular.  In 2019Q4 Fed DFA data, the millennial generation holds approximately zero net real estate wealth.  pic.twitter.com/w5509e2ygM\n— Gray &#39;serial millennial myth debunker&#39; Kimbrough (@graykimbrough)  May 22, 2020\n Yet millennials spend within their means more so than Gen X or boomers did at the same age, Kent’s analysis of separate Federal Reserve data shows. That is, they’re more likely to spend less than they earn, and 52 percent of millennials were saving for retirement at age 34. At that age, just 42 percent of boomers had retirement savings.\n   “This narrative of, ‘Oh you should just work harder, sink or swim by your own effort?’ It’s very American, but it ignores the fact that the tide is much stronger now, and many millennials are swimming upstream,” Kent said.\n   Millennials are the most educated, most diverse generation in history — at least until zoomers pass them. Those distinctions come with burdens.\n William Gale, a senior fellow at the Brookings Institution, said millennials’ rising debt burden outstrips gains they have made in education. “Their parents and public authorities funded less of their college education than previous generations,” he added.\n  That’s compounded by the large African American and Hispanic millennial populations, as these groups continue to suffer the effects of generations of systemic discrimination. The wealth gap between black and white households continues to grow, even after controlling for differences in age, education, marital status and even income, Gale and several collaborators found in a working paper  circulated by the National Bureau of Economic Research.\n  It’s part of trend of more marginalized groups falling behind. Millennials with a college degree aren’t far behind previous generations in terms of wealth,  Kent found, but their less-educated peers have a bit more than half of the wealth they’d expect at this stage, based on previous generations.\n  “Not every single millennial is going to be doing more poorly,” Kent said. The 29-year-old points to herself as an example. She identifies as Hispanic, a category that’s been hit disproportionately hard by the downturn, but her PhD and white-collar job insulated her from a crisis that first hammered less-educated workers in the service industry.\n  “Some millennials — particularly those who are black, Hispanic or women, or who have less than a bachelor’s degree — were already financially vulnerable going into the pandemic,” Kent  wrote earlier this week.\n Nationally, about 12 percent of all workers couldn’t cover a $400 emergency expense — even with the help of family or credit cards — according to Kent’s analysis of Federal Reserve data. The 12 percent number holds for non-Hispanic white millennials, but the figure leaps to 32 percent for non-Hispanic black millennials, 20 percent for Hispanic millennials and 17 percent for millennial women. For all millennials with less than a bachelor’s degree, the figure is 25 percent.\n  “Even after so many years of economic expansion, they’re still below where we’d expect them to be,” she told us.\n  Not coincidentally, Kent’s  analysis of Labor Department data shows women, Hispanic workers and the less-educated also are overrepresented among unemployed millennials during the pandemic.", "posttime": "2020-06-07 22:59:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "显示,graphs,千禧", "title": "显示千禧一代经济赔率不佳的数据和图表", "title_en": "Data and graphs showing millenials' bad economic odds", "transed": 1, "url": "https://www.washingtonpost.com/business/2020/05/27/millennial-recession-covid/", "via": "", "real_tags": ["显示", "graphs", "千禧"]}, {"category": "", "categoryclass": "", "imagename": "e1257340140b022fb2bbffa319895165.jpg", "infoid": 1005578, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在1960年开始的一项著名的正在进行的实验中，科学家们通过一代又一代地繁殖最不具攻击性的狐狸，将狐狸变成温顺、像狗一样的狗。这些生物长出了粗短的鼻子，松软的耳朵，甚至开始吠叫。\n现在，英国的一些农村红狐似乎正在自己做这件事。新的研究显示，当这些动物从森林迁移到城市栖息地时，它们开始进化出类似狗的特征，这可能会让自己走上驯化的道路。\n路易斯维尔大学(University Of Louisville)进化生物学家李·杜加特金(Lee Dugatkin)说，“与其说我对这项研究感到惊讶，不如说我对此感到高兴。”杜加特金曾撰写过关于俄罗斯狐狸实验的文章，但并未参与这项新工作。“这是一项‘自然实验’，与俄罗斯的实验发现非常吻合。”\n当凯文·帕森斯(Kevin Parsons)听说苏格兰国家博物馆收藏了大量红狐头骨时，这项著名的西伯利亚研究立即浮现在脑海中。帕森斯是一名土生土长的加拿大人，也是格拉斯哥大学的进化生物学家，他已经被格拉斯哥街头经常看到的狐狸数量所震惊，特别是在清晨。“他们会从我身边走过，盯着我看，好像在问，‘你为什么看着我？’”他回忆说。“他们无所畏惧。”\n帕森斯好奇地想知道这些动物是否以某种方式进化来适应它们的城市生活方式，他检查了苏格兰国家博物馆收藏的狐狸头骨。1971年至1973年，在伦敦和邻近的乡村，大约1500具头骨被收集起来，当时正在进行一场猎狐运动。所有人都标有自己的位置，无论是农村还是城市。城市地区被定义为有建筑，有路灯，没有林区，而农村地区有树木，缺乏人类发展。\n帕森斯拍摄了57个女性和54个男性头骨，并确定了关键特征。一只狐狸的栖息地极大地影响了它的头骨形状，他和他的同事们今天在“皇家学会学报B”上报道。\n最重要的是，与俄罗斯实验中的狐狸一样，城市狐狸的口吻明显比乡村狐狸短而宽，大脑也更小。男性和女性的头骨形状非常相似。所有这些变化都是查尔斯·达尔文所说的驯化综合症的典型表现。\n总体而言，城市狐狸的头骨似乎被设计成比乡村狐狸的咬合力更强，乡村狐狸的头骨的形状取决于速度。帕森斯推测，也许是因为在城市里，一只狐狸可以简单地站在人类垃圾堆前，吃我们扔掉的食物，在那里它们可能会遇到更多的骨头，只有用更强壮的下巴才能压碎。\n尽管如此，他强调，城市红狐并没有被驯化。但史密森学会国家自然历史博物馆的退休考古学家梅林达·泽德说，这项研究确实表明，暴露在人类活动中可以让动物走上这条路。\n像早期的狗一样，城市狐狸需要克服它们对人类的恐惧，才能接近到足够近的地方吃我们的垃圾。这可能是导致许多其他生物变化的火花。\n泽德指出，在世界上的许多地方，狐狸以前也开始走上这种驯化的道路。例如，它们的骨骼出现在早期的农业社区。但与进入这些社区并变身为我们今天所知的毛球的野猫不同，这些狐狸从未完全被驯化。泽德说：“它们在驯化的道路上再也不会走得更远了。”“我们不知道为什么。”\n*更正，6月3日下午1：40：*这篇报道已更新，以反映著名的西伯利亚狐狸实验仍在进行的事实。", "note_en": "In a famous ongoing experiment started in 1960, scientists turned foxes into tame, doglike canines by breeding only the least aggressive ones generation after generation. The creatures developed stubby snouts, floppy ears, and even began to bark.\n Now, it appears that some rural red foxes in the United Kingdom are doing this on their own. When the animals moved from the forest to city habitats, they began to evolve doglike traits, new research reveals, potentially setting themselves on the path to domestication.\n “I’m not so much surprised as delighted,” by this study, says Lee Dugatkin, an evolutionary biologist at the University of Louisville, who has written about  the Russian fox experiment but was not involved with the new work. “This is a ‘natural experiment’ that is very much in line with what the Russian experiment has found.”\n The renowned Siberian study immediately came to mind when Kevin Parsons heard about a large collection of red fox skulls at National Museums Scotland. A native Canadian and evolutionary biologist at the University of Glasgow, Parsons had already been struck by the number of foxes he regularly saw on Glasgow’s streets, particularly in the early morning. “They’d walk by me and stare, as if asking, ‘Why are you looking at me?’” he recalled. “They were fearless.”\n Curious to see whether the animals had somehow evolved to suit their urban lifestyle, Parsons examined National Museums Scotland’s fox skull collection. Some 1500 skulls had been collected from 1971 to 1973 in London and the adjacent countryside, when a fox culling campaign was underway. All were marked with their locations, rural or urban. Urban areas were defined as having buildings, streetlights, and no wooded areas, whereas rural sites were wooded and lacked human development.\n Parsons photographed 57 female and 54 male skulls and identified key features.  A fox’s habitat greatly affected the shape of its skull, he and his colleagues report today in the  Proceedings of the Royal Society B.\n Most significantly, the urban foxes, like those in the Russian experiment, had noticeably shorter and wider muzzles, and smaller brains, than their rural fellows. And males and females had very similar skull shapes. All of these changes are typical of what Charles Darwin labeled  domestication syndrome.\n Overall, urban foxes’ skulls seemed to be designed for a stronger bite than were those of rural foxes, which are shaped for speed. Perhaps that’s because in the city, a fox can simply stand at a human trash pile and feed on the food we’ve tossed out, where they may encounter more bones that can only be crushed with stronger jaws, Parsons speculates.\n Still, he emphasizes that the urban red foxes are not domesticated. But the study does show how exposure to human activity can set an animal down this path, says Melinda Zeder, an emeritus archaeologist at the Smithsonian Institution’s National Museum of Natural History.\n Like early dogs, urban foxes would need to overcome their fear of humans to get close enough to eat our trash. And that may have been the spark that led to a host of other biological changes.\n Foxes have started down this domestication path before in many parts of the world, Zeder notes. Their bones show up in early farming communities, for example. But unlike wildcats, who entered these communities and  transformed into the furballs we know today, these foxes never become fully domesticated. “They never move any farther down the path to domestication,” Zeder says. “We don’t know why.”\n *Correction, 3 June, 1:40 p.m.:  This story has been updated to reflect the fact that the famed Siberian fox experiment is still ongoing.", "posttime": "2020-06-07 22:43:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "狐狸,foxes", "title": "城市狐狸可能在我们中间自我驯化", "title_en": "Urban Foxes May Be Self-Domesticating In Our Midst", "transed": 1, "url": "https://www.sciencemag.org/news/2020/06/urban-foxes-may-be-self-domesticating-our-midst", "via": "", "real_tags": ["狐狸", "foxes"]}, {"category": "", "categoryclass": "", "imagename": "39fdf0007e4715cdad81cc92b3c84e36.jpeg", "infoid": 1005577, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在最近的一次深夜公式跑中，我路过一大堆教孩子编程的书籍。我到处都看过这些书，但从来没有这么大规模的针对小学生的陈列。这些书籍是大量资源的一部分，这些资源包括暑期编程夏令营、课后代码俱乐部、旨在向幼儿园儿童传授JavaScript入门知识的应用程序，这些资源旨在让孩子们具备面向未来的技能。\n很容易理解为什么父母要把编码强加给他们的孩子。要让我们的孩子为软件统治的未来做好准备，还有什么比培训他们如何构建软件更好的方式呢？如果一切都要自动化，那么做自动化的人要安全得多。如果学习编程是好的，那么越早学习越好。但是，虽然这些产品可能会教孩子们特定的编码语言，但它们实际上与创建软件的工作几乎没有什么关系。\n我的一位前同事在一家编码新兵训练营接受培训，培训的座右铭是“编码是新的识字”。这种情绪是所有编程书籍和游戏的核心。一本畅销书中的描述说，及早开始编码“对孩子们为未来做好准备是必不可少的”。这给人的印象是，不教孩子编程在某种程度上等同于不教他们阅读。\n这当然是荒谬的。编码不是新的识字方式。虽然大多数父母都识字，知道给孩子读书，但大多数不是程序员，不知道程序员需要什么样的技能。面向儿童的编码书籍将编码描述为一组具有“正确”解决方案的问题。如果你的孩子能掌握语法，他们就能快速、轻松地做事情。但这不是编程的工作方式。编程是杂乱无章的。编程是创造力和决心的混合体。作为一名开发人员，不仅仅是语法，某些技能只能教给非常年轻的人。\n在我职业生涯的早期，我编写了一些代码来配置和运行一组远程服务器。代码运行得很好。至少我是这么想的，直到大约18小时后，我的手机在半夜叮当作响，告诉我有一组服务器出现了故障。我摇摇晃晃地从床上爬到我的笔记本电脑上，再次运行代码来更换损坏的服务器。几个小时后，另一个小组失败了。\n没有语法问题。如果有的话，服务器从一开始就不会建造。问题要严重得多。隔离和解决这个问题花了几个星期和很多个晚上被打断的睡眠。\n编码就是这样的。试试吧。看看它能不能用。再试试。如果一个问题很简单，那么它将是自动的，或者至少可以通过一些开放源码来解决。剩下的就是创造一些独一无二的东西的艰巨任务了。没有书教你如何解决以前没有人见过的问题。这就是为什么我不想让我的孩子学语法。我希望他们学会解决问题，深入研究问题，富有创造力。那我们该怎么教呢？\n有一天，我儿子担心他的一把椅子摇晃。我们看了看，他帮我隔离了问题：其中一个螺丝松了。我找到了我们许多剩余的六角扳手中的一把，并教他如何拧回它。在那之后，他好奇如果他用另一种方式拧会发生什么，他一直这样做，直到螺丝出来。在他满意工作完成之前，我们最终把椅子完全拆开，再把它放回原处几次，经常是不匹配的碎片。试试吧。看看它是怎么工作的。再试试。\n当然，让某些东西正常工作只是构建软件的第一步。下一步是使代码清晰、可重用和整洁。有一次，在我职业生涯的早期，我写了一个特写，并把它交给了一位资深开发人员进行审查。他看了一眼我草率的间距、不匹配的行和反复无常的命名约定，只是说，“再来一次。”它起作用了。语法有效。这仍然是错误的。优秀的程序员不只是让一些东西工作。他们希望它是好的。\n这种质量感对许多开发人员来说是最难掌握的。设计良好的代码使用起来感觉很好，而丑陋的代码会让开发人员不由自主地退缩。最好的开发人员学会将抽象逻辑与艺术家的敏感度融合在一起。学会相信美感是发展的一部分，就像任何算法或编码模式一样。\n我的妻子和我最近和我们的儿子一起做了糖饼干。每次我们混合一些配料时，我们都会停下来看看面团，谈论一下面团的质地和颜色。很顺利吗？我们把所有的部分都混合均匀了吗？当我们摊开面团时，我儿子摸了摸面团的表面，看着我的妻子教他如何把每样东西都弄得均匀而薄。然而，最困难的部分是裁剪出形状。像所有的孩子一样，他本能地把切割机推到了摊开的面团的中间，每次我们都会试图解释如何将形状挨着放在一起，以最大化每个卷。\n每一步-精确地测量配料，测量混合面团的平滑度和一致性，放置精确的切割以最大限度地减少浪费-都教会了他一些关于质量的知识。很难讲授仅仅执行步骤(如遵循食谱)和做好某件事之间的区别。它只能通过感觉和体验来传递。每次当你让你的孩子参与你重视的事情时，你就是在教他们如何把事情做好。您正在为他们编写代码做准备。\n但你不仅仅是在教他们这一点。你在教他们这个世界充满了有趣的东西等着你去发现。你是在向他们展示如何充满激情，并在他们做的每件事中寻找那种短暂的质量感。最好的部分是，即使他们没有成为程序员-大多数人不应该也不会-同样的技能可以用在几乎任何职业、每种爱好、每一种生活中。当我们强迫孩子们学习句法时，我们强化了这样一种观念，即如果某件事不是一项明显可雇用的技能，它就没有价值。成年人可以学习语法。只有孩子才能学会拥抱好奇心。\n这篇文章最初出现在Slate上，并于2018年12月6日发布。本文经许可在此转载。", "note_en": "On a recent late-night formula run, I passed by a large display of books about teaching children to code. I have seen these books around, but never such a large display directed toward elementary-aged children. These books are part of a flood of resources—summer coding camps, after-school code clubs, apps designed to teach kindergarteners the rudiments of JavaScript—aimed at equipping children with future-proof skills.\n It’s easy to see why parents push coding on their children. What better way to prepare our kids for a future ruled by software than by training them how to build it? If everything is going to be automated, it’s much safer to be the one doing the automating. And if learning to code is good, then learning earlier is better. But while these products may teach kids specific coding languages, they actually have very little to do with the work of creating software.\n A former co-worker of mine was trained at a coding boot camp with the motto “Coding Is the New Literacy.” That sentiment is at the heart of all the programming books and games. The description in one popular book says starting coding early is “essential to prepare kids for the future.” This gives the impression that not teaching kids to code is somehow equivalent to not teaching them to read.\n That is, of course, ridiculous. Coding is not the new literacy. While most parents are literate and know to read to their kids, most are not programmers and have no idea what kind of skills a programmer needs. Coding books for kids present coding as a set of problems with “correct” solutions. And if your children can just master the syntax, they’ll be able to make things quickly and easily. But that is not the way programming works. Programming is messy. Programming is a mix of creativity and determination. Being a developer is about more than syntax, and certain skills can only be taught to the very young.\n Early in my career, I wrote some code to configure and run a group of remote servers. The code worked great. At least that’s what I thought until about 18 hours later, when my phone dinged in the middle of the night telling me a group of the servers had failed. Staggering from bed to my laptop, I ran the code again to replace the broken servers. Hours later, a different group failed.\n There wasn’t a syntax problem. If there had been, the servers would never have been built in the first place. The problem was much deeper. Isolating and solving it took several weeks and many nights of interrupted sleep.\n Coding is like that. Try something. See if it works. Try again. If a problem was straightforward, it would be automated or at least solved with some open-source code. All that’s left is the difficult task of creating something unique. There are no books that teach you how to solve a problem no one has seen before. This is why I don’t want my kids to learn syntax. I want them to learn to solve problems, to dive deep into an issue, to be creative. So how do we teach that?\n One day, my son was concerned that a chair of his was wobbly. We looked at it and he helped me isolate the problem: One of the screws was loose. I found one of our many leftover hex wrenches and showed him how to screw it back in. After that, he was curious what would happen if he screwed the other way, which he did until the screw came out. We ended up taking the chair all the way apart and putting it back together a couple of times, often mismatching pieces, before he was satisfied the job was finished. Try something. See how it works. Try again.\n Of course, getting something working is just the first step of building software. The next step is to make code clear, reusable, and neat. Once, early in my career, I wrote a feature and gave it to a senior developer for review. He took one look at my sloppy spacing, mismatched lines, and erratic naming conventions and just said, “Do it again.” It was working. The syntax was valid. It was still wrong. Good coders don’t just get something to work. They want it to be good.\n That feeling of quality is the hardest thing for many developers to master. Well-designed code feels good to work with, and ugly code will make developers involuntarily cringe. The best developers learn to fuse abstract logic with the sensitivity of an artist. Learning to trust that aesthetic feeling is as much a part of development as any algorithm or coding pattern.\n My wife and I recently made sugar cookies with our son. Every time we mixed some ingredients we would pause and look at the dough and talk about the texture and color. Was it smooth? Did we get all the parts mixed evenly? As we rolled out the dough, my son felt the surface and watched as my wife showed him how to get everything even and thin. The hardest part, though, was cutting out the shapes. Like all kids, he instinctively pushed the cutter right in the middle of the rolled-out dough, and every time we would try to explain how to place shapes next to each other in order to maximize each roll.\n Every step—precisely measuring ingredients, gauging mixed dough for smoothness and consistency, placing precision cuts to minimize waste—taught him something about quality. It’s hard to teach the difference between merely executing steps, such as following a recipe, and doing something well. It can only be passed on through feel and experience. And every time you involve your kids when you work on something you value, you are teaching them how to do things well. You are preparing them to write code.\n But you’re not only teaching them that. You’re teaching them the world is full of interesting things to discover. You’re showing them how to be passionate and look for that ephemeral sense of quality in everything they do. The best part is that even if they don’t become coders—most shouldn’t and won’t—the same skills can be used in nearly any career, in every hobby, in every life. When we force kids to learn syntax, we reinforce the idea that if something is not a blatantly employable skill, it’s not valuable. Adults can learn syntax. Only kids can learn to embrace curiosity.\n This post originally appeared on Slate and was published December 6, 2018. This article is republished here with permission.", "posttime": "2020-06-07 22:42:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,开发,孩子,teach", "title": "我是开发商。我不会教我的孩子编程，你也不应该", "title_en": "I’m a Developer. I Won’t Teach My Kids to Code, and Neither Should You", "transed": 1, "url": "https://getpocket.com/explore/item/i-m-a-developer-i-won-t-teach-my-kids-to-code-and-neither-should-you", "via": "", "real_tags": ["编程", "开发", "孩子", "teach"]}, {"category": "", "categoryclass": "", "imagename": "8099e22eaa947192366fe6bf1769d9f7.jpg", "infoid": 1005576, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(CNN)据我们所知，越来越多的持不同政见者相信美国人可以在没有执法的情况下生存。那些持不同政见者认为，没有它，美国人可能会过得更好。\n支持者说，解决警察暴行和警察中的种族不平等问题的办法很简单：只需取消对警察的资助。\n这听起来很简单：城市预算的相当大一部分不是资助警察局，而是投资于社区，特别是大部分警务工作发生在边缘的社区。这一点听起来很简单：一座城市的预算中，有相当大一部分投资于社区，尤其是那些被边缘化的社区，因为那里发生了大量的警务工作。\n多年来，这个概念一直是众说纷纭，特别是在密苏里州弗格森发生反对警察暴行的抗议活动之后，尽管这在2014年似乎不太可能。\n但这正成为人们的欢呼声。随着乔治·弗洛伊德(George Floyd)和布雷娜·泰勒(Breonna Taylor)死于警察之手，以及要求改革的全国性抗议活动，至少有一个城市正在考虑完全解散警察部队。\n这取决于你问的是谁，耶鲁大学(Yale University)社会学博士生、社区安全与责任资源中心(Community Resource Hub For Safety And Accounability)首席研究和政策助理菲利普·麦克哈里斯(Philip McHarris)说。\n一些撤资的支持者希望将部分(但不是全部)资金从警察部门重新分配到社会服务部门。一些人想要剥夺所有警察的资金并解散部门。\n他说，这个概念存在于不同的光谱上，但两种解释都集中在重新想象公共安全是什么样子。\n这也意味着打破警察是保护社区的公共管家的观念。麦克哈里斯说，许多美国黑人和其他有色人种感觉不到警察的保护。\n麦克哈里斯说，撤资结束了刑事司法系统中的惩罚文化。这也是当地政府在试图结束在警察拘留期间死亡的唯一选择之一。\n麦克哈里斯在一个社区长大，那里有真实的、明显的枪支暴力威胁，他说他从来没有想过要报警--这是为了他自己的安全。取而代之的是，他依赖帮助他驾驭危险威胁的邻居。\n他说，如果这些人能够提供他们全职向他提供的同样的支持，那会怎么样？\n加州大学洛杉矶分校(UCLA)黑人政策中心主任艾萨克·布莱恩(Isaac Bryan)在解释他为什么支持这一想法时，引用了历史：南方的执法始于奴隶巡逻队，这是一支受雇来夺回逃脱奴隶的义务警员队伍。然后，当奴隶制被废除时，警方执行了吉姆·克罗的法律--甚至是最轻微的违规行为。\n今天，警察对黑人使用了不成比例的武力，黑人更有可能被逮捕和判刑。\n黑人生命也是运动的联合创始人帕特里斯·卡洛斯(Patrisse Cullors)表示，取消对警察的资助意味着重新分配这些资金来支持边缘化社区的人和服务。\n库勒斯在接受波士顿WBUR公共电台采访时说，取消对执法部门的资助意味着我们正在降低执法部门拥有危害我们社区的资源的能力。它是关于将这些钱再投资到黑人社区，这些社区已经被深度剥离。\n这些美元可以重新投入精神健康、家庭暴力和无家可归等方面的社会服务。她说，警方往往是这三个人的第一反应者。\n麦克哈里斯说，这些钱也可以用来资助那些社区的学校、医院、住房和食物--我们知道的所有事情都可以提高安全性。\n完全解散警察属于警察撤资范围中更激进的一端，但它正在获得吸引力。\n明尼阿波利斯的社区倡导组织MPD150专注于废除当地警察。自从乔治·弗洛伊德(George Floyd)在明尼阿波利斯警方拘留期间死亡以来，它的工作一直是聚光灯下的焦点。\n该组织说，对我们社区的危机作出反应的人应该是最有能力处理这些危机的人。\n该组织说，第一反应人员应该是精神健康提供者、社会工作者、受害者权益倡导者和其他不太显眼的社区成员，而不是携带枪支的陌生人。\n它辩称，法律和秩序不是由执法部门教唆的，而是通过教育、就业和心理健康服务，而低收入社区往往被剥夺了。MPD150和其他废除警察的组织希望更广泛地接触这三个组织。\n大规模撤资警察以前从未做过，所以很难说。\n但有证据表明，减少警力可以减少犯罪。2017年的一份报告重点关注了2014年至2015年的几周，当时纽约警察局故意取消了主动警务，发现在这段时间里，犯罪投诉减少了2100起。\n这项研究将主动警务定义为系统和积极地执行低级别违规行为，并在预计会发生犯罪的地区加强警察存在。\n对于一个美国城市来说，在没有执法的情况下运作是激进的，但明尼阿波利斯已经在讨论这个问题了。\n市议会成员史蒂夫·弗莱彻(Steve Fletcher)在推特上表示，市议会成员正在讨论如何解散明尼阿波利斯警察局，并以社区为导向的非暴力公共安全和外联能力重新开始。\n他写道：我们完全可以重新想象公共安全意味着什么，我们重新招聘哪些技能，我们做什么和不需要什么工具。我们可以投资于文化能力和心理健康培训、缓和局势和解决冲突。\n不过，撤资比解散要简单，而且至少有一位市长已经采取了这一步骤。在加州人谴责了将洛杉矶警察局预算增加到18.6亿美元的提议后，洛杉矶市长埃里克·加希蒂(Eric Garcetti)同意从拟议的资金中削减1亿至1.5亿美元。\n布莱恩说，这并不是预算上的重大削减，但它证明了官员们正在倾听。\n他说，一周前，以任何身份取消对警察的资助听起来都像是空中楼阁。现在我们正在讨论这件事。从整体上取消对警察的资助听起来可能仍像是天方夜谭，但下周可能会有所不同。", "note_en": "(CNN)There&#39;s a growing group of dissenters who believe Americans can survive without law enforcement as we know it. And Americans, those dissenters believe, may even be better off without it.\n The  solution to police brutality and racial inequalities in policing is simple, supporters say: Just defund police.\n It&#39;s as straightforward as it sounds: Instead of funding a police department, a sizable chunk of a city&#39;s budget is invested in communities, especially marginalized ones where much of the policing occurs.\n   The concept&#39;s been a murmur for years, particularly following the  protests against police brutality in Ferguson, Missouri, though it seemed improbable in 2014.\n But it&#39;s becoming a shout. With the  deaths of George Floyd and Breonna Taylor at the hands of police and  nationwide protests demanding reform, at least one city is considering dissolving its police force altogether.\n  That depends on who you ask, said Philip McHarris, a doctoral candidate in sociology at Yale University and lead research and policy associate at the Community Resource Hub for Safety and Accountability.\n Some supporters of divestment want to reallocate some, but not all, funds away from police departments to social services. Some want to strip all police funding and dissolve departments.\n The concept exists on a spectrum, but both interpretations center on reimagining what public safety looks like, he said.\n It also means dismantling the idea that police are &#34;public stewards&#34; meant to protect communities. Many Black Americans and other people of color don&#39;t feel protected by police, McHarris said.\n   McHarris says divesting funds ends the culture of punishment in the criminal justice system. And it&#39;s one of the only options local governments haven&#39;t tried in their attempts to end deaths in police custody.\n  McHarris grew up in a neighborhood where there were &#34;real, discernible threats of gun violence,&#34; and he said he never thought to call the police -- that was for his own safety. Instead, he relied on neighbors who helped him navigate threats of danger.\n What if, he said, those people could provide the same support they showed him on a full-time basis?\n To explain why he supports the idea, Isaac Bryan, the director of UCLA&#39;s Black Policy Center, points to history:  Law enforcement in the South began as slave patrol, a team of vigilantes hired to recapture escaped slaves. Then, when slavery was abolished, police enforced Jim Crow laws -- even the most minor infractions.\n And today, police disproportionately  use force against black people, and black people are  more likely to be arrested and sentenced.\n    Patrisse Cullors, co-founder of the Black Lives Matter movement, said defunding the police means reallocating those funds to support people and services in marginalized communities.\n Defunding law enforcement &#34;means that we are reducing the ability for law enforcement to have resources that harm our communities,&#34; Cullors said in an interview with  WBUR, Boston&#39;s public radio station. &#34;It&#39;s about reinvesting those dollars into black communities, communities that have been deeply divested from.&#34;\n Those dollars can be put back into social services for mental health, domestic violence and homelessness, among others. Police are often the first responders to all three, she said.\n Those dollars can be used to fund schools, hospitals, housing and food in those communities, too -- &#34;all of the things we know increase safety,&#34; McHarris said.\n   Disbanding police altogether falls on the more radical end of the police divestment spectrum, but it&#39;s gaining traction.\n MPD150, a community advocacy organization in Minneapolis, focuses on abolishing local police. Its work has been spotlighted since the death of George Floyd in Minneapolis Police custody.\n &#34;The people who respond to crises in our community should be the people who are best-equipped to deal with those crises,&#34; the  organization says.\n Rather than &#34;strangers armed with guns,&#34; the organization says, first responders should be mental health providers, social workers, victim advocates and other community members in less visible roles.\n It argues law and order isn&#39;t abetted by law enforcement, but through education, jobs and mental health services that low-income communities are often denied. MPD150 and other police abolition organizations want wider access to all three.\n   Defunding police on a large scale hasn&#39;t been done before, so it&#39;s tough to say.\n But there&#39;s evidence that less policing can lead to less crime. A  2017 report, which focused on several weeks in 2014 through 2015 when the New York Police Department purposely pulled back on &#34;proactive policing,&#34; found that there were 2,100 fewer crime complaints during that time.\n The study defines proactive policing as the &#34;systematic and aggressive enforcement of low-level violations&#34; and heightened police presence in areas where &#34;crime is anticipated.&#34;\n    It&#39;s radical for an American city to operate without law enforcement, but it&#39;s already being discussed in Minneapolis.\n City council member Steve Fletcher,  in a Twitter thread, said council members are discussing &#34;what it would take to disband the Minneapolis Police Department and start fresh with a community-oriented, non-violent public safety and outreach capacity.&#34;\n &#34;We can totally reimagine what public safety means, what skills we&#39;re recruiting for, what tools we do and don&#39;t need,&#34; he wrote. &#34;We can invest in cultural competency and mental health training, de-escalation and conflict resolution.&#34;\n Defunding is simpler than disbanding, though, and at least one mayor&#39;s already taken that step. After Californians decried a proposal to increase the  Los Angeles Police Department budget to $1.86 billion, Los Angeles Mayor Eric Garcetti  agreed to slash between $100 million to $150 million from the proposed funding.\n   It&#39;s not a significant dent in the budget, but it&#39;s proof that officials are listening, Bryan said.\n &#34;A week ago, defunding the police in any capacity would sound like &#39;pie in the sky,&#39;&#34; he said. &#34;Now we&#39;re talking about it. Defunding police in its entirety still might sound like &#39;pie in the sky,&#39; but next week might be different.&#34;", "posttime": "2020-06-07 22:09:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "警方,call,社区", "title": "要求警方撤资的呼声越来越高。它的意思是这样的", "title_en": "There's a growing call to defund the police. Here's what it means", "transed": 1, "url": "https://www.cnn.com/2020/06/06/us/what-is-defund-police-trnd/index.html", "via": "", "real_tags": ["警方", "call", "社区"]}, {"category": "", "categoryclass": "", "imagename": "ace885103629e3cb202ed77283c27255.jpg", "infoid": 1005575, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SpaceX最出名的可能是用其可重复使用的火箭来革命性地发射火箭，包括猎鹰9号，它有一个可重复使用的第一级，几年来一直被用来向国际空间站发射宇航员和货物。现在，欧洲想要加入到这一行动中来。欧洲航天局(ESA)宣布，它正在开发自己的可重复使用的火箭发动机。\n普罗米修斯将用于欧洲火箭，如阿丽亚娜6号及其继任者，目的是使火箭发射变得相当便宜。欧空局将其计划中的发动机描述为“超低成本火箭推进的先驱，这种发动机足够灵活，可以适应任何任务的新运载火箭机队，并且将有可能重复使用。”\n法国国家空间研究中心(CNES)和航空航天公司阿丽亚娜集团(Ariane Group)去年公布了可重复使用火箭的计划。欧空局现在已经选择全额资助普罗米修斯发动机的设计，以创造一个可用的版本，它希望能比目前的选择生产出更便宜的产品-降低到成本的十分之一。\n普罗米修斯公司的前身运行在液氧-甲烷上，这带来了高效率，[并且]允许标准化和操作简单。甲烷推进剂也随处可得，而且易于操作，“欧空局在一篇博客文章中说。该发动机将能够适应不同的需求：“可变推力、多次点火、适用于主要和上级应用，以及在飞行前和飞行后尽量减少地面操作等特点，也使普罗米修斯成为一款高度灵活的发动机，”欧空局补充道。\n欧空局将很快开始在德国兰波德豪森的德国航天局设施测试普罗米修斯发动机的硬件部件。该公司说，它已经制造了包括涡轮泵的涡轮、泵入口和燃气发生器阀门在内的部件，目前正在制造主要子系统。\n目标是在本月完成第一个燃烧室模型，然后在今年年底之前交付这个燃烧室的真实版本，然后在2021年之前组装出发动机的完整演示版本进行测试。", "note_en": "SpaceX may be best known for revolutionizing rocket launches with its reusable rockets, including the Falcon 9, which has a reusable first stage and has been used for launching astronauts and cargo to the International Space Station for several years now. Now, Europe wants to get in on the action. The European Space Agency (ESA) has announced it is developing its own reusable rocket engine.\n The Prometheus would be used in European rockets like the Ariane 6 and its successors, with the aim of making rocket launches considerably cheaper. The ESA described its planned engine as “the precursor of ultra-low-cost rocket propulsion that is flexible enough to fit a fleet of new launch vehicles for any mission and will be potentially reusable.”\n The French space agency CNES, along with the aerospace company Ariane Group,  unveiled its plans for a reusable rocket last year. The ESA has now chosen to fully fund the Prometheus engine design to create a usable version that it hopes can be produced considerably cheaper — down to a tenth of the cost — than current options.\n  “This Prometheus precursor runs on liquid oxygen — methane which brings high efficiency, [and] allows standardization and operational simplicity. Methane propellant is also widely available and easy to handle,” the ESA said in a  blog post. The engine will be able to be adapted to different needs: “Features such as variable thrust, multiple ignitions, suitability for main and upper-stage application, and minimized ground operations before and after flight also make Prometheus a highly flexible engine,” the ESA added.\n The ESA will soon begin testing the hardware components of the Prometheus engine at the German Space Agency facilities in Lampoldshausen, Germany. It says it already has manufactured components including the turbo pump’s turbine, pump inlet, and gas generator valves, and it is currently manufacturing main subsystems.\n The aim is to finish the first combustion chamber model this month, then deliver the real version of this combustion chamber by the end of the year, before assembling a full demonstration version of the engine for testing by 2021.", "posttime": "2020-06-07 21:36:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "火箭,space", "title": "欧洲航天局正在资助自己的可重复使用火箭", "title_en": "The European Space Agency is Funding Its Own Reusable Rocket", "transed": 1, "url": "https://www.digitaltrends.com/news/esa-reusable-rocket-engine-prometheus/", "via": "", "real_tags": ["火箭", "space"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005573, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几年前，乔什“别叫他‘辣手’”，米勒读了拉普拉斯关于概率论的经典著作，注意到这本书预见了过去50年来的许多“启发式和偏见”文献(也称为“认知错觉”或“行为经济学”)。我们写下了我们的想法，几年后，我们的文章发表了，同时还进行了两次讨论和我们的反驳。\n数学家皮埃尔-西蒙·德·拉普拉斯(Pierre-Simon de Laplace)在他从19世纪初开始的著作“哲学与概率论”(Esai Philosophque Sur les Proposités)中预测了认知心理学和行为经济学在过去50年中发展起来的许多观点，解释了人类在存在概率和不确定性时偏离理性规范的倾向。看看拉普拉斯的理论和推理是引人注目的，无论是在它们看起来多么现代，他在没有系统实验的情况下取得了多么大的进步，以及他的一些未被探索的猜想的新颖性。我们认为，这项工作表明，这些理论比我们想象的更基本，对最近的实验结果的依赖性更小。。。。\n早在150年前，拉普拉斯就在20世纪70年代报道了不确定性判断中的认知错觉。我们讨论了米勒和盖尔曼的评论，即拉普拉斯对试探法和偏见法的主要思想的预期“给了我们一个新的视角来看待这些思想，因为这些思想更具普遍性，不那么依赖于(后来)出现的特定发展”。。。\n今天的数理统计的情况类似于19世纪中叶的拉普拉斯概率。关于应该如何使用概率论，提出了强有力的主张。然而，它被广泛滥用，在数据分析中越来越不被使用。也许我们需要一种概率哲学，提出更温和、更现实的主张。。。。\n拉普拉斯在两个世纪前就有了所有这些想法，这有点酷。有道理-拉普拉斯是个聪明人。他之于定量社会科学就像牛顿之于定量物理学；基本上，你可能有任何聪明的想法，都是他先想出来的。我们还讨论了Tversky、Kahneman、Gigerenzer等现代思想如何超越拉普拉斯的直觉。\n另外，碰巧这一期的“统计科学”上有一篇由Reshef等人撰写的文章，题为“公平性、区间估计和统计权力”(Equability，Interval Estiments，and Statistics Power)。这是我们几年前在博客上讨论过的一篇文章(“MC太多，MIC不够，或者在大型多变量数据集中总结二元相关性的尝试应该遵循什么原则？”)。生活还在继续，是吗？", "note_en": "A few years ago, Josh “Don’t call him ‘hot hand&#39;” Miller read Laplace’s classic book on probability theory and noticed that it anticipated much of the “heuristics and biases” literature (also called “cognitive illusions” or “behavioral economics”) of the past fifty years. We  wrote up our ideas and, years later, our article made it into print, along with two discussions and our rejoinder.\n  In his book from the early 1800s, Essai Philosophique sur les Probabilités, the mathematician Pierre-Simon de Laplace anticipated many ideas developed within the past 50 years in cognitive psychology and behavioral economics, explaining human tendencies to deviate from norms of rationality in the presence of probability and uncertainty. A look at Laplace’s theories and reasoning is striking, both in how modern they seem, how much progress he made without the benefit of systematic experimentation, and the novelty of a few of his unexplored conjectures. We argue that this work points to these theories being more fundamental and less contingent on recent experimental findings than we might have thought. . . .\n  Reports in the 1970s of cognitive illusions in judgments of uncertainty had been anticipated by Laplace 150 years earlier. We discuss Miller and Gelman’s remark that Laplace’s anticipation of the main ideas of the heuristics and biases approach “gives us a new perspective on these ideas as more universal and less contingent on particular developments [that came much] later.” . . .\n  The situation of mathematical statistics today resembles the situation of Laplacean probability in the mid-19th century. Strong claims are made about how probability theory should be used. Yet it is widely misused and increasingly not used in the analysis of data. Perhaps we need a philosophy of probability that makes more modest and realistic claims. . . .\n  It’s kinda cool that Laplace had all these ideas, two centuries ago. It makes sense— Laplace was a smart guy. He is to quantitative social science what Newton is to quantitative physics; basically any clever idea you might have, he came up with it first. We also discuss the ways in which the modern ideas of Tversky, Kahneman, Gigerenzer, etc., go beyond Laplace’s intuitions.\n P.S. It just so happens that this same issue of Statistical Science has  an article by Reshef et al., “Equitability, Interval Estimation, and Statistical Power.” This is an article we discussed  several years ago on the blog (“Too many MC’s not enough MIC’s, or What principles should govern attempts to summarize bivariate associations in large multivariate datasets?”). Life goes on, eh?", "posttime": "2020-06-07 21:17:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "认知,错觉,theories,思想", "title": "拉普拉斯的认知错觉、启发式和偏见理论", "title_en": "Laplace’s Theories of Cognitive Illusions, Heuristics and Biases", "transed": 1, "url": "https://statmodeling.stat.columbia.edu/2020/06/05/laplaces-theories-of-cognitive-illusions-heuristics-and-biases/", "via": "", "real_tags": ["认知", "错觉", "theories", "思想"]}]