[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1000831, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我害怕高压锅对吗？如果你在普通厨房里滥用高压锅，最糟糕的事情是什么？\n从某种意义上说，它们可能会爆炸，但不会像你可能害怕(或希望)的那样猛烈。家用炊具内的压力不会超过大约两个大气压--大约是一罐汽水的压力。这些水平可能是危险的，但它们通常不够高，不足以导致金属剧烈破裂。\n想象一下，在一个百事可乐炙手可热的世界里。现在想象一下，有人拿起一罐百事可乐放在你面前。\n这才是高压锅真正的威胁：如果密封失效(或者盖子打开得太早)，它会向各个方向喷出滚烫的炖肉。\n爆炸甚至不能把盖子扔得很远。如果你把杂花筒装在高压锅上，即使在理想的情况下，它发射盖子的速度也不会比你扔它的速度快很多，任何土豆炮(特别是这门)都可以做得更好。\n当然，问题不在于高压锅是否有可能爆炸。这是关于可能发生的最坏的事情是什么。\n如果你关闭安全阀，有很多方法可以产生更危险的压力。你可以完全将它装满水并加热，用德拉诺和铝箔填充它，或者只需从压缩机中泵入空气即可。\n结果将取决于你的高压锅。很有可能它会开始漏水。如果它没有，它不知何故在几个稀少的大气层(潜水水箱的典型压力)中保持在一起，当它最终破裂时，它可能很容易杀死你。\n即便如此，这还远不是你用压力记录器能做的最糟糕的事情。\n坦率地说，有太多的选择，不可能调查所有的选择。但在我看来，你能做的最可怕的事情之一就是：\n在炉子里装满高达5PSI的氧气，然后泵入氟气，直到它开始通过安全阀泄漏。将容器放在明火上，直到达到700°C(即°C，而不是°F)。是的，这可能会触发烟雾警报。现在，将热气泵到液氧冷却的不锈钢表面。\n这里的程序有点棘手，但如果处理得当，气体会凝结成二氟化氧(O2F2)。\nRay Bradbury taughtus说，当暴露在温度高于451华氏度的氧气中时，纸张会燃烧。二氟化氧的挥发性很强，几乎任何有机物质都会在低于零下300华氏度的任何温度下点燃和爆炸。它确实可以让冰着火。\n在一篇关于O2 F2的文章中，化学博客作者Derek Lowe(“管道中的优秀”)使用了“极其可怕”、“令人深感震惊”和“我永远不希望遇到的化学物质”这样的词语。另一篇文章将氟称为“路西法的气体”，并列出了试图处理氟时中毒或爆炸的化学家。\n如果你的房子是由天然气供暖的，而它恰好含有硫化氢，你可以用管道将其中的一些放入你的O2F2容器中。除了巨大的爆炸，这还会产生一团氟化氢气体。氟化氢可以在接触时溶解人体组织，从你的肺部和角膜开始。\n正如洛威指出的那样，这种反应(O2F2和硫化物)的化学性质在很大程度上还没有被探索。\n这给了我们一个问题的答案。在高压锅里能发生的最糟糕的事情是什么？", "note_en": "Am I right to be afraid of pressure cookers? What&#39;s the worst thing that can happen if you misuse a pressure cooker in an ordinary kitchen?\n     They can explode, in a sense, but not as violently as you might fear (orhope). The pressure inside a consumer cooker doesn’t go above about twoatmospheres—about the pressure  inside a can ofsoda. Thoselevels can be dangerous, but they’re generally not high enough to causethe metal to violently rupture.\n  Imagine a world where Pepsi is scalding hot. Now imagine that someoneshakes up a can of Pepsi and sets it in front of you.\n  That’s the real threat from a pressure cooker: If the seal fails (or thelid is opened too early), it can  spray scalding stew in alldirections.\n  The blast couldn’t even fling the lid very far. If you mounted arifle-style barrel on a pressure cooker, even in ideal circumstances itwouldn’t be able to fire the lid much faster than you could throw it.Any potato cannon (especially  thisone)could do better.\n Of course, the question wasn’t about whether a pressure cooker is likelyto explode. It was about what the worst thing that could happen was.\n If you disable the safety valve, there are plenty of ways to producemuch more dangerous pressures. You could completely fill it with waterand heat it,  fill it with Drano and aluminumfoil, or just pump in airfrom a compressor.\n The result would depend on your pressure cooker. Chances are it wouldstart to leak. If it didn’t, and it somehow stayed together up a fewhundred atmospheres (pressures typical of scuba tank), when it finally ruptured it could easilykill you.\n  Even so, that’s far from the  worst thing you could do with a pressurecooker.\n Frankly, there are so many options it would be impossible to survey themall. But for my money, one of the most horrifying things you could do isthis:\n  Fill the cooker with oxygen up to 5 PSI, then pump in fluorine until itstarts escaping through the safety valve. Put the vessel over an openflame until it reaches 700°C (That’s °C, not °F. Yes, this will probablyset off the smoke alarm.) Now, pump the hot gas over aliquid-oxygen-cooled stainless steel surface.\n The procedure here is a little tricky, but if you do things right,the gas will condense into  dioxygen difluoride (O2F2).\n  Ray Bradbury  taughtus that paper burns whenexposed to oxygen at temperatures above 451°F. Dioxygen difluoride is sovolatile that it makes almost any organic substance ignite and explodeat any temperature hotter than 300°F  below zero. It can literally make  ice catch fire.\n In an article aboutO 2 F 2,Chemistry blogger Derek Lowe (of the excellent  In The Pipeline) usedphrases like “violently hideous”, “deeply alarming”, and “chemicals thatI never hope to encounter”.  Anotherarticle refersto fluorine as “the gas of Lucifer”, and lists chemists who werepoisoned or blown up while attempting to work with it.\n If your house is heated by natural gas, and it happens to containhydrogen sulfide, you could pipe some of it into your container of O2F2.In addition to a massive explosion, this will  also produce a cloud ofhydrogen fluoride gas. Hydrogen fluoride can dissolve human tissue oncontact, starting with your lungs and corneas.\n As Lowe points out, the chemistry of this kind of reaction (O2F2 andsulfides) is largely unexplored.\n Which gives us an answer to our question. What’s the worst thing thatcan happen in a pressure cooker?", "posttime": "2020-05-06 04:44:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "pressure,可能", "title": "使用高压锅最糟糕的事情是什么？", "title_en": "What's the worst thing to do with a pressure cooker?", "transed": 1, "url": "https://what-if.xkcd.com/40/", "via": "", "real_tags": ["pressure", "可能"]}, {"category": "", "categoryclass": "", "imagename": "9ae6c7b27ea6d0d7e3fd4282672388ca.jpg", "infoid": 1000830, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Twitter正在试验一种新的审核工具，该工具将在用户发布包含该公司所说的“有害”语言的回复之前发出警告。\n推特称这是一次有限的实验，而且只会向iOS用户展示。Twitter官方支持频道的一条消息称，在某些情况下，现在应该会弹出的提示将给你提供“如果回复使用了可能有害的语言，你可以选择在回复发布之前修改你的回复”。\n当事情变得激烈时，你可能会说一些你不想说的话。为了让你重新考虑回复，我们在iOS上进行了一个有限的实验，如果回复使用了可能有害的语言，我们会给你一个提示，让你选择在回复发布之前修改你的回复。\n-Twitter支持(@TwitterSupport)2020年5月5日。\n这种方法并不新颖。它以前也被很多其他社交平台使用过，其中最著名的是Instagram。Facebook旗下的这款应用现在会在用户发布标题之前发出警告，并附上一条消息称，标题“看起来与报道过的其他标题相似”。在这一变化之前，Instagram在去年夏天推出了评论警告系统。\n目前还不清楚推特是如何给有害语言贴上标签的，但该公司确实有仇恨言论政策和更广泛的推特规则文件，其中概述了它在从暴力和恐怖主义相关内容的威胁到虐待和骚扰等各种问题上的立场。Twitter表示，它不会仅仅因为某些内容具有冒犯性就将其删除：“只要人们没有违反Twitter的规定，就允许他们发布内容，包括潜在的煽动性内容，”该公司表示。但它确实有规则集，允许它为其广泛的言论政策开辟例外。\n这就是说，这个新的实验似乎不太关心限制Twitter通常可能删除、暂停或禁止用户的更极端的内容形式。相反，它似乎更多地是为了轻描淡写地鼓励用户避免不必要和煽动性的语言，这些语言会加剧争执，并可能导致停职。毕竟，你可以简单地忽略Twitter的警告，不管怎样都可以发布回复。但也许稍微推动一下，Twitter认为至少一些用户可能会重新考虑。", "note_en": "Twitter is experimenting with a new moderation tool that will warn users before they post replies that contain what the company says is “harmful” language.\n Twitter describes it as a limited experiment, and it’s only going to show up for iOS users. The prompt that is now supposed to pop up in certain situations will give “you the option to revise your reply before it’s published if it uses language that could be harmful,” reads a message from the official Twitter Support channel.\n When things get heated, you may say things you don&#39;t mean. To let you rethink a reply, we’re running a limited experiment on iOS with a prompt that gives you the option to revise your reply before it’s published if it uses language that could be harmful.\n— Twitter Support (@TwitterSupport)  May 5, 2020\n The approach isn’t a novel one. It’s been used by quite a few other social platforms before,  most prominently Instagram. The Facebook-owned app now warns users before they post a caption with a message that says the caption “looks similar to others that have been reported.” Prior to that change, Instagram  rolled out a warning system for comments last summer.\n It’s not exactly clear how Twitter is labeling harmful language, but the company does have  hate speech policies and a  broader Twitter Rules document that outlines its stances on everything from threats of violence and terrorism-related content to abuse and harassment. Twitter says it won’t remove something simply because it is offensive: “People are allowed to post content, including potentially inflammatory content, as long as they’re not violating the Twitter Rules,” the company says. But it does have the rule sets that allow it to carve out exceptions to its broad speech policies.\n That said, this new experiment seems less concerned with curbing the more extreme forms of content for which Twitter might normally remove, suspend, or ban users. Instead, it seems more designed to lightly encourage users to avoid unnecessary and inflammatory language that escalates feuds and might lead to suspensions. After all, you can simply ignore Twitter’s warning and post the reply anyway. But perhaps with a little nudge, Twitter thinks at least some users might reconsider.", "posttime": "2020-05-06 04:44:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "消息,tests,twitter", "title": "Twitter测试一条警告消息，告诉用户重新考虑攻击性回复", "title_en": "Twitter tests a warning message that tells users to rethink offensive replies", "transed": 1, "url": "https://www.theverge.com/2020/5/5/21248201/twitter-reply-warning-harmful-language-revise-tweet-moderation", "via": "", "real_tags": ["消息", "tests", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "024ece8f05c5dbe317ba5aa3c6df50a3.jpg", "infoid": 1000828, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿邮报-马里兰大学的一项民意调查显示，美国人显然反对餐馆、零售店和其他企业重新开业，尽管州长们为了抗击冠状病毒大流行，开始解除让经济陷入困境的限制。\n相当多的美国人表达的反对反映了调查中揭示的其他警告和担忧，包括大多数人持续担心自己可能会感染冠状病毒，以及认为医疗危机最糟糕的时候还没有结束。\n大约一半的州已经放松了对企业的限制，但美国人对光顾企业的不安是重启经济的一个主要障碍。许多美国人一直在去杂货店购物，56%的人说他们这样做很舒服。但67%的人表示，他们在服装店购物会感到不舒服，78%的人表示，在坐着的餐厅吃饭会不舒服。限制较宽松的州的人们报告的不适程度与规则较严格的州的人相似。\n美国人继续对特朗普总统对疫情的反应给予负面评价，同时对他们的州长给予广泛的正面评价，这一趋势在整个大流行期间都是一致的。\n特朗普的支持率为44%的正面和56%的负面，与两周前的情况一致，仅比一周前略差。州长从75%的美国人那里获得了积极的评价，与一周前大致相同。党派分歧仍然很大，近80%的共和党人对特朗普给予了正面评价，但只有约20%的民主党人对特朗普给予了正面评价。相比之下，州长在各党派都获得了很大的积极多数。\n美国人也压倒性地赞同包括安东尼·S·福奇(Anthony S.Fuci)在内的联邦公共卫生科学家应对冠状病毒挑战的方式。福奇的好评率为74%。他保持着广泛的两党吸引力，赢得了超过三分之二的共和党人和无党派人士的好评，以及近90%的民主党人。联邦政府中的公共卫生科学家总体上被评为71%的正面。\n在宣布放松对企业限制的计划时，州长们强调，他们的行动代表着逐步和谨慎地重新开放经济。尽管如此，当被问及八种不同类型的企业时，大多数美国人表示，他们反对结束对这八种企业的限制。\n后美国时代。马里兰州。Poll询问了以下类型的企业：枪支商店、就餐餐厅、美甲沙龙、理发店和美发沙龙，服装店等零售机构，以及健身房、高尔夫球场和电影院。\n最重要的反对意见是反对重新开放电影院，82%的美国人表示，他们不应该被允许在他们所在的州开张。人们也普遍反对重新开放健身房(78%的人反对)，在餐厅和美甲沙龙用餐(都有74%的人反对)。\n枪支商店紧随其后，70%的人表示不应该重新开张，紧随其后的是理发店和美发沙龙(69%的人反对)，以及服装店(66%的人反对)和高尔夫球场(59%的人反对)等零售店。\n到目前为止，在放松限制的州，反对开业的人与限制更严格的州一样高。在这两个州，大多数居民反对重新开放民调中衡量的所有八种类型的企业。\n重新开业的努力是由特朗普推动的，主要是由共和党州长推动的，民调显示，共和党人比民主党人更支持开业。民主党人和倾向于民主党的无党派人士压倒性地反对开放所有类型的经过测试的企业，而共和党人和倾向于共和党的无党派人士则从大多支持开业(高尔夫球场为61%)到大部分反对(59%为就餐餐厅)不等。\n就像支持开业一样，民调发现，在人们去商店和餐馆的舒适度方面，党派之间存在差异。大多数共和党人和无党派人士表示，他们去杂货店买东西很舒服，但大多数民主党人说他们不舒服。只有10%的民主党人表示，他们会在餐厅外就餐感到舒服，相比之下，22%的无党派人士和36%的共和党人表示。\n无论是哪个政党，个人的担忧在很大程度上决定了人们对重新开放的态度。在大多数至少有点担心会因冠状病毒而重病的人中，大约十分之八的人反对在他们所在的州开设理发店和零售店。在那些不那么担心的人中，较小的多数人认为这两种类型的业务都应该开放。\n性别差距在大多数上市企业重新开业时尤为明显，在大多数情况下，男性比女性更支持。56%的男性反对允许枪支商店开门，82%的女性持这一观点。对于餐厅和美甲沙龙，只有大约五分之一的女性表示应该开门营业，而男性的这一比例约为三分之一。约四分之一的女性表示应该开设零售店、理发店和美发沙龙，而男性的这一比例为40%。\n民调发现，最近几周，对感染的恐惧丝毫没有减弱。在调查中，63%的美国人表示，他们要么非常担心感染病毒并患上重病，要么有点担心，36%的人说他们要么不太担心，要么根本不担心。在后美国时代。马里兰州。两周前的一项民意调查显示，57%的人表示，他们担心因冠状病毒(由冠状病毒引起的疾病)而患上重病，42%的人表示并不担心。\n各州处于病毒周期的不同阶段，一些州似乎已经过了高峰，另一些州的感染速度仍在增长。当被问及他们对自己的社区相对于曲线的看法时，31%的人说最糟糕的时期已经过去。另有30%的人表示，最糟糕的情况正在发生，而38%的人表示，最糟糕的情况还在后面。\n共和党人和那些不担心因冠状病毒而重病的人比其他人更有可能说他们的社区最糟糕的时期已经过去。各年龄段之间的差异尤为显著，18岁至39岁的人中，只有不到四分之一的人表示，最糟糕的时期已经过去，相比之下，65岁及以上的人中这一比例为40%。\n这项民意调查是由“华盛顿邮报”和马里兰大学民主与公民参与中心联合进行的。采访是在4月28日至5月3日期间在全国随机抽样的1005名成年人中进行的，其中70%是通过手机联系到的，30%是通过固定电话联系到的。总体结果的抽样误差幅度为正负3.5个百分点。对于应该开放或关闭企业的结果，误差率为5分，因为它们是基于随机抽样的受访者。\n注册：想了解竞选活动中正在发生的事情吗？注册预告片，一周三天在你的收件箱里获取来自全国各地的见解和新闻。\n显示更多", "note_en": "Americans clearly oppose the reopening of restaurants, retail stores and other businesses, even as governors begin to lift restrictions that have kept the economy locked down in an effort to combat the  coronavirus pandemic, according to a  Washington Post-University of Maryland poll.\n The opposition expressed by sizable majorities of Americans reflects other cautions and concerns revealed in the survey, including continuing fears among most people that they could become infected by the coronavirus, as well as a belief that the worst of the medical crisis is not yet over.\n About half of states have eased restrictions on businesses, but Americans’ unease about patronizing them represents a major hurdle to restarting the economy. Many Americans have been making trips to grocery stores and 56 percent say they are comfortable doing so. But 67 percent say they would be uncomfortable shopping at a retail clothing store, and 78 percent would be uncomfortable eating at a sit-down restaurant. People in states with looser restrictions report similar levels of discomfort as those in states with stricter rules.\n     Americans continue to give President Trump negative marks for his response to the outbreak, while offering widely positive assessments of their state governors, a trend that has been consistent throughout the pandemic.\n Trump’s ratings are 44 percent positive and 56 percent negative, in line with where he was two weeks ago and only slightly worse than  a week ago. Governors earn positive marks from 75 percent of Americans, about the same as a week ago. Partisan differences remain sizable, with nearly 8 in 10 Republicans but just about 2 in 10 Democrats rating Trump positively. In contrast, governors earn big positive majorities across the parties.\n Americans also overwhelmingly approve of the way federal public health scientists, including Anthony S. Fauci, have dealt with the challenges from the coronavirus. Fauci’s positive rating stands at 74 percent. He maintains wide bipartisan appeal, winning positive marks from more than two-thirds of Republicans and independents, and nearly 9 in 10 Democrats. Public health scientists in the federal government overall are rated 71 percent positive.\n    In announcing plans to ease the restrictions on businesses, governors have emphasized that their actions represent a gradual and cautious reopening of their economies. Nonetheless, when asked about eight different types of businesses, majorities of Americans say they oppose ending the restrictions on each of the eight.\n The Post-U. Md. poll asked about the following types of businesses: gun stores, dine-in restaurants, nail salons, barbershops and hair salons, retail establishments such as clothing stores, along with gyms, golf courses and movie theaters.\n The most significant opposition is to reopening movie theaters, with 82 percent of Americans saying they should not be allowed to open up in their state. There is also broad opposition to reopening gyms (78 percent opposed), dine-in restaurants and nail salons (both with 74 percent opposed).\n Gun stores are next, with 70 percent saying they should not be reopened, followed by barbershops and hair salons (69 percent opposed) and retail shops such as clothing stores (66 percent opposed) and golf courses (59 percent opposed).\n  Opposition to opening businesses is just about as high in the states that have loosened restrictions so far as states with stricter restrictions. In both sets of states, majorities of residents oppose reopening all eight types of businesses measured in the poll.\n   The push to reopen has been driven by Trump and largely by Republican governors, and the poll shows Republicans are far more supportive of opening businesses than Democrats. Democrats and Democratic-leaning independents overwhelmingly oppose opening all types of businesses tested, while Republicans and Republican-leaning independents range from mostly in favor of opening (61 percent for golf courses) to mostly opposed (59 percent for dine-in restaurants).\n As with support for opening businesses, the poll finds partisan differences in how comfortable people are going to stores and restaurants. Majorities of Republicans and independents say they are comfortable going to a grocery store, but a majority of Democrats say they are not. Just 10 percent of Democrats say they would be comfortable eating out at a restaurant, compared with 22 percent of independents and 36 percent of Republicans.\n No matter the party, personal worry heavily shapes attitudes on reopening. Among the majority who are at least somewhat worried about becoming seriously ill from the coronavirus, roughly 8 in 10 oppose opening barber shops and retail stores in their state. Among those who are less worried, smaller majorities say both types of business should be open.\n   The gender gap is especially notable on the reopening of most of the businesses listed, with men more supportive than women in most cases. Fifty-six percent of men oppose allowing gun shops to open, a view held by 82 percent of women. For restaurants and nail salons, only about a fifth of women say they should be open, compared with about one-third of men. About a quarter of women say retail shops, barber shops and hair salons should be opened, compared with 4 in 10 men.\n Fear of infection, the poll finds, has not abated at all in recent weeks. In the survey, 63 percent of Americans say they are either very or somewhat worried about getting the virus and becoming seriously ill, with 36 percent saying they are either not too worried or not at all worried. In  a Post-U. Md. poll two  weeks ago, 57 percent said they were worried about becoming seriously ill from covid-19, the disease caused by the coronavirus, and 42 percent said they were not worried.\n States are at different points in the cycle of the virus, with some appearing to be past the peak and others still experiencing growth in the pace of infections. Asked their impressions of where their own communities stand in relation to the curves, 31 percent say the worst is behind them. Another 30 percent say the worst is happening now, while 38 percent say the worst is yet to come.\n Republicans and those who are not worried about becoming seriously ill from the coronavirus are more likely than others to say the worst is behind their communities. Differences among age groups are particularly striking, with less than a quarter of 18- to 39-year-olds saying that the worst is behind their communities, compared with 40 percent of those 65 and older.\n  The  poll was conducted by The Washington Post and the University of Maryland’s Center for Democracy and Civic Engagement. Interviews were conducted April 28 to May 3 among a random national sample of 1,005 adults, 70 percent of whom were reached on cellphones and 30 percent on landlines. Overall results have a margin of sampling error of plus or minus 3.5 percentage points. The error margin is five points for results on which businesses should be open or closed, as they are based on a random half-sample of respondents.\n Sign up: Want to understand what’s happening in the campaign?  Sign up for The Trailer and get insights and news from across the country in your inbox three days a week.\n Show More", "posttime": "2020-05-06 04:31:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,widely,企业,percent", "title": "美国人普遍反对大多数企业重新开张", "title_en": "Americans widely oppose reopening most businesses", "transed": 1, "url": "https://www.washingtonpost.com/politics/americans-widely-oppose-reopening-most-businesses-despite-easing-of-restrictions-in-some-states-post-u-md-poll-finds/2020/05/04/495ddc3a-8e36-11ea-9e23-6914ee410a5f_story.html", "via": "", "real_tags": ["美国", "widely", "企业", "percent"]}, {"category": "", "categoryclass": "", "imagename": "7c6d1f837d9cdafd377b21ce8fe0a34e.jpg", "infoid": 1000827, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然Brave号称拥有超过1300万月度用户，但似乎很少有人利用该平台的加密货币方面。\n虽然拥有广泛的用户基础，但支持加密货币的网络浏览器Brave&#39；的用户似乎并没有利用它的令牌功能。\n在5月5日的Twitter直播中，主要密码交易所Binance的首席执行官赵昌鹏与Brave的首席执行官兼联合创始人布兰登·艾奇(Brendan Eich)进行了交谈。艾奇说，他的加密网络浏览器在4月底达到了1380万月度活跃用户，赵对此表示：\n“老实说，这可能是密码领域最活跃的用户群。”\n尽管如此，Eich承认，大多数人实际上并没有使用其内置的加密货币功能。他说，选择加入基于密码的Brave Rewards系统的用户数量为170万，约占总用户的12.32%。该系统的钱包在过去30天内处于活跃状态。\nEich解释说，当用户浏览互联网时，网络活动被测量和跟踪，所有的数据都被用来向该个人投放广告。他从广告商的角度解释了这个系统是如何运作的：\n广告业的人--为生产我们购买的产品、商品和服务的品牌工作--会花很多钱试图让你购买他们的商品。所以他们把钱投入到这个数字广告系统中，其中一些会让你看到广告或跟踪你，这样他们就可以决定向你展示什么广告，但最终你得不到任何钱，你得到的只是广告和跟踪。“。\nEich解释说，Brave的浏览器屏蔽了传统的广告和跟踪，取而代之的是，用户可以选择参与“干净”的广告和捐赠模式，默认情况下，这种模式是私人的。\n浏览器的基本注意力令牌(BAT)是用户注意力的记帐单位，可以用来支持内容创建者和奖励观看广告的用户。\n由于许多Brave用户都是加密货币的新手，Eich解释说，该公司正试图通过向用户提供免费令牌来换取他们在Brave Rewards计划中的活动。这允许用户参与系统并赚取令牌，他们可以自动捐赠给创建者或设置每月捐款，就像Patreon一样。他接着说：\n“当我们第一次在台式机上发布[Brave Browser]时，它占据了台式机浏览器份额的40%，随着我们增加移动端，我们发现人们不太愿意使用它，但我们正在努力让它更方便，让它更具使用吸引力，让它给用户带来更多回报。”\n在Binance和Brave合作将Exchange与桌面版本的浏览器集成后不久，就出现了现场直播。Brave浏览器桌面版现在有一个Binance小工具，允许用户在交易所进行交易。", "note_en": "While Brave boasts over 13 million monthly users, few of them appear to be utilizing the cryptocurrency aspect of the platform.\n   While enjoying a wide user base, cryptocurrency-enabled web browser Brave&#39;s users do not seem to be taking advantage of its token features.\n During a May 5 Twitter  live stream, the CEO of major crypto exchange Binance, Changpeng Zhao, talked with Brendan Eich, the CEO and co-founder of Brave. Eich said that his crypto-enabled web browser reached 13.8 million monthly active users at the end of April, to which Zhao said:\n “That’s probably the most active user base in crypto, to be honest.”\n Still, Eich admitted that most do not actually use its built-in cryptocurrency features. He said that the number of users who choose to join the crypto-based Brave Rewards system that had their wallets active over the last 30 days is 1.7 million, about 12.32% of total users.\n  Eich explained that, when a user browses the internet, web activity is measured and tracked, and all of the data is used to target advertisements to that individual. He explained how the system works from the advertiser’s standpoint:\n &#34;People in advertising — working for the brands who make the products, goods and services we buy — will spend a lot of money to try to get you to buy their goods. And so they throw money into this digital ad system, and some of it causes you to see an ad or tracks you so they can decide what ad to show you, but at the end of the day you don’t get any of that money, all you get is the ads and the tracking.”\n Eich explained that Brave’s browser blocks traditional advertising and tracking, and instead allows the user to choose to participate in a “clean” ad and donation model which is private by default.\n The browser&#39;s Basic Attention Token ( BAT) is meant to be a unit of account for user attention that can be used to support content creators and award users who view ads.\n Since many Brave users are new to cryptocurrencies, Eich explained that the firm is attempting to onboard users by giving them free tokens in exchange for their activity in the Brave Rewards program. This allows users to participate in the system and earn tokens that they can automatically donate to creators or set up monthly contributions, much like Patreon. He continued:\n “When we first released [Brave Browser] on desktop, it was 40% of the desktop browser share and as we added mobile we found people were less willing to use it, but we are working to make it more attractive to use by making it more convenient, making it reward the user more.”\n The live stream comes shortly after Binance and Brave  partnered to integrate the exchange with the desktop version of the browser. The Brave Browser desktop version now features a Binance widget that allows users to trade on the exchange.", "posttime": "2020-05-06 04:31:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "执行官,browser,users", "title": "首席执行官表示，很少有勇敢的浏览器用户利用加密功能", "title_en": "Few Brave Browser Users Take Advantage of Crypto Features, Says CEO", "transed": 1, "url": "https://cointelegraph.com/news/few-brave-browser-users-take-advantage-of-crypto-features-says-ceo", "via": "", "real_tags": ["执行官", "browser", "users"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000826, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "找到好的编程资源就像大海捞针。它很难找到，而且可能会花很多时间。\n我最近使用了几个值得了解的Python资源。有些是免费的，有些则不是。但是所有的都很棒。\n如果您正在学习或希望更好地使用Python，那么这篇文章就是为您准备的。在其中，我分享了2020年来我使用过的最好的Python资源。\n我用过鲁文·勒纳的几个Python产品。每一个都非常出色。有两件事你需要知道。\n首先，王牌Python采访。这个免费课程包含50个关于Python主题的教学视频，分为三个级别：初学者、中级和高级。\n每个视频都聚焦于勒纳在截屏视频中解决的一个问题。以下是一些例子：\n录像带通常只有5到10分钟长，但里面挤满了信息。即使你熟悉一个主题，你也可能学到一些新东西。\n这是因为勒纳远远超越了事物如何工作的表面层面，深入到了概念或主题的细微差别中。例如，你会发现什么时候以及为什么你会用“Break”而不是“Continue”。您将了解“Else”如何在Python循环中工作，以及何时(以及何时不)使用它。\n他的解释得到了现场代码示例的支持。您将看到他编写函数、类或条件来解释每个概念。\n对于任何希望增强Python知识的人来说，ACE Python访谈都是不费吹灰之力的。\n它充满了50个问题，深入到语言的核心部分：字符串、字典、函数、文件、列表和元组等等。\n这本书练习很重，这就是我为什么这么喜欢它的原因。在简要介绍了一个主题之后，勒纳会给你一个要解决的问题。\n勒纳最出类拔萃的地方是他提供的深思熟虑的解决方案。他不仅给出了答案，还给出了详细的解释。这是一个区别点。\n这也是关于从问题中学习：分解它，使用正确的工具来解决它，并理解每一步。勒纳从头到尾向你介绍了他的思考过程，并解释了其中的关键点。\n因此，您的Python语言上下文将会增长(我的当然会增长)，因为Lerner的解决方案可能会让您接触到Python的新特性或不同的做事方式。你解决问题的能力也会变得更加精湛。\n建立你的知识图书馆是一件很棒的事情。但是你必须不断地把你的知识付诸实践。\n即使资源有练习问题或练习，最好用其他问题来测试自己。\nHogan提供了主要按概念组织的实际问题，如文件、数据结构和函数。\n你可以一遍又一遍地解决同样的问题，每次都能获得新的洞察力。这是因为他为每个问题提供了几个挑战和一个约束。简而言之，他的问题有很多层面有待发现。\n这个编程平台提供了各种难度不同的问题。我最喜欢的是它对测试的关注：每个问题都有一个测试文件。解决Exercism方面的问题是我从测试驱动开发(Test-Driven Development)开始的。\n我报名参加了Interview Cake的“完整课程”，在那里我正在学习和练习算法、数据结构和大O符号。这些问题都是经过精心挑选的，可以帮助你理解概念或主题，比如堆栈。\n一旦你解决了一个问题，它就会一步一步地把它分解。事实上，重点是在这个过程上。您将会很好地理解为什么某种方法在给定的上下文中是有意义的。\n在LeetCode上不乏要解决的问题。但它提供了一个重要的好处。\n通常有多种解决方案，对您解决的每个问题都有详细的解释。因此，您将更好地阅读代码、考虑时间和空间复杂性，并考虑解决相同问题的多种方法。\n本文中列出的许多来源之间有一个共同点。他们不仅提供了解决方案，而且提供了详尽的解释。\n当我第一次开始编程时，我使用的许多资源都没有提供解决方案，更不用说解释了。一方面，这是有价值的：你被迫处理模棱两可的问题，你可以从斗争中成长很多。事实上，Lerner的书“Python Workout”也包含没有解决方案的问题。\n但我现在意识到，为什么还要将提供解决方案并提供解释的资源结合起来，这一点很重要。它对学习非常有用。事实上，它指向了乔治·波利亚数学解题过程中的最后一步，那就是“回头看”。\n波利亚在他的书“如何解决问题”(How To Solve It)中写道：“通过回顾已完成的解决方案，通过重新考虑和重新审视结果和导致它的途径，(学生)可以巩固他们的知识，发展他们解决问题的能力。”\n“回头看”是我们程序员个人应该做的事情。然而，当我们考虑和研究其他人的解决方案以及实现这些解决方案的过程时，这一过程会得到加强。\n找到一个好的编程资源可能很难。所以把这篇文章中提到的资源放在手边。因为当你迫不及待地要学习一些东西时，准备好一些资源是很有帮助的。\n←返回所有帖子", "note_en": "Finding a good programming resource is like looking for a needle in a haystack. It&#39;s hard to find and can take a lot of time.\n I’ve used several Python resources recently that are worth knowing about. Some are free, others are not. But all are excellent.\n If you’re learning—or looking to get better at—Python, then this post is for you. In it, I share the best Python resources I’ve used so far in 2020.\n  I’ve used several of Reuven Lerner’s Python products. Each one has been excellent. There are two you need to know about.\n First, Ace Python Interviews. This  free course contains 50 instructional videos on Python topics organized into three levels: beginner, intermediate, and advanced.\n Each video focuses on a question that Lerner addresses in a screencast. Here are some examples:\n  The screencasts are usually only five to ten minutes long, but they’re packed full of information. Even if you’re familiar with a topic, you’ll likely learn something new.\n That’s because Lerner goes well beyond the surface level of how something works and gets into the nuances of a concept or topic. You’ll find out  when and  why you’d use ‘break’ instead of ‘continue,’ for example. You’ll learn how ‘else’ works in a Python loop and when (and when not) to use it.\n His explanations are supported by live code examples. You’ll see him write functions, classes, or conditionals to explain each concept.\n  Ace Python Interviews is a no-brainer for anyone who’s looking to enhance their Python knowledge.\n   It’s filled with 50 problems that dive into core parts of the language: strings, dictionaries, functions, files, lists and tuples, among others.\n This book is practice-heavy, which is why I like it so much. After a brief introduction to a topic, Lerner gives you a problem to solve.\n Where Lerner excels the most is in the thoughtful solution he provides. He not only provides the answer, but also a detailed explanation. It’s a point of distinction.\n  It’s also about learning from the problem: breaking it down, using the right tools to solve it, and understanding each step. Lerner walks you through his thought process from start to finish and explains key points along the way.\n As a result, your Python language context will grow (mine sure has), since Lerner’s solutions will likely expose you to new features of Python or different ways to do things. Your problem-solving skills will also become more refined.\n  It’s great to build your library of knowledge. But you constantly have to put your knowledge to practice.\n Even if a resource has practice  problems or exercises, it’s a good idea to test yourself with additional ones.\n   Hogan provides practical problems that are organized mostly by concept, such as files, data structures, and functions.\n You can solve the same problem over and over again and gain new insights each time. That’s because he offers several challenges and a constraint for each problem. In short, his problems have many layers to be discovered.\n  This programming platform offers a variety of problems that range in difficulty. What I like best is its focus on tests: there is a file of tests for each problem. Solving problems on Exercism was my start with  Test-Driven Development.\n  I’m enrolled in Interview Cake’s “full course,” where I’m learning about and getting practice with algorithms, data structures, and big O notation. The problems are well-selected to help you understand a concept or topic, like stacks.\n Once you’ve solved a problem, it’ll break it down step-by-step. Indeed, the focus is on the process. You&#39;ll come away with a great understand why a certain approach makes sense in a given context.\n  There’s no shortage of problems to solve on LeetCode. But it offers an important benefit.\n There are usually multiple solutions with detailed explanations for each problem you solve. As a result, you’ll get better at reading code, considering time and space complexity, and thinking about many ways to tackle the same problem.\n  There’s a commonality among many of the sources listed in this article. They not only offer a solution, but a thorough explanation.\n When I first began to program, many of the resources I used didn’t provide the solution let alone an explanation. On the one hand, there’s value to that: you’re forced to deal with ambiguity and you can grow a lot from the struggle. In fact, Lerner’s book,  Python Workout, also contains problems without solutions.\n But I now realize why it’s important to also incorporate resources that  do offer solutions with explanations. It’s incredibly useful for learning purposes. In fact, it points to the last step in George Pólya’s mathematical problem-solving process, which is “looking back.”\n “By looking back at the completed solution, by reconsidering and reexamining the result and the path that led to it, [students] could consolidate their knowledge and develop their ability to solve problems,” writes Pólya in his book,  How to Solve It.\n “Looking back” is something we ought to do individually as programmers. This process is enhanced, however, when we consider and  study solutions of others and the process that got them there.\n Finding a good programming resource can be hard to come by. So keep the resources mentioned in this post handy. Because when you’re pressed to learn something it’s helpful to have a few resources at your ready.\n  ← back to all posts", "posttime": "2020-05-06 04:19:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,2020,learn", "title": "2020年学习Python的资源", "title_en": "Resources to Learn Python in 2020", "transed": 1, "url": "https://amymhaddad.com/the-best-resources-to-learn-python-in-2020", "via": "", "real_tags": ["python", "2020", "learn"]}, {"category": "", "categoryclass": "", "imagename": "072c46e2e31dfe5ad37c6580b0b10df1.png", "infoid": 1000825, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在GitLab，我们认为衡量成功的一部分是有一个你正在努力实现的目标。这还不足以说，我们对增长感兴趣。但明确增长的目标是认为1%的增长就足够了还是表现不佳之间的区别。不仅为增长设定目标，而且设定所有绩效指标都是关于预期管理和协调-确保每个人在应该取得的结果上是一致的。要了解这一点在我们的日常工作中是如何体现的，所有KPI都有目标，所有工作类别都有绩效指标。\n在发展SaaS初创公司时，早期创始人经常会问：我的初创公司应该以多快的速度增长？有很多看似相互矛盾的建议。\n例如，在YC Combinator，我们经常被告知，我们应该在一周内实现10%的增长目标。正如保罗·格雷厄姆(Paul Graham)在增长方面所写的那样，\n在Y Combinator期间，我们衡量每周的增长率，部分原因是离演示日只有很短的时间了，还有一部分原因是早期的初创公司需要经常从用户那里获得反馈，以调整他们正在做的事情。YC期间的好增长率是每周5-7%。如果你能达到每周10%，那你的表现就特别好。如果你只能做到1%，那就说明你还没有搞清楚自己在做什么。\n大多数阶段都围绕着一个我称之为“三倍、三倍、双倍”(简称T2D3)的咒语，指的是一家公司的年化收入增长。\n这里有40法则，神奇的数字，还有很多其他的建议。\n所有这些都表明，在公司发展的不同阶段，可以有很多方法来跟踪增长，但很难理解它们是如何结合在一起的，或者什么是最好的。\nWOW规则是风险投资SaaS公司收入增长的指导原则。这是基于我发展GitLab和作为其他公司投资者的经验。如果你想知道你的SaaS初创公司的收入增长目标应该是什么，请继续阅读。\n月度环比(MOM)增长=6%+(14%/上个月以百万美元为单位)。\n在你达到200万美元的ARR之前，月度增长6%加上14%除以上个月的ARR(百万美元)的目标是什么？\n在第一个月末，你的年利率为0。第二个月末，你的年收入为0.1万英镑，或100K美元。第三个月末，你的年收入为.3万英镑，或300K美元。从第二个月到第三个月，这意味着每月增长106%，每周增长约26.5%。在第12个月末，你的年收入应为2.1马币(约合2.1万美元)，这意味着你的月度增长率为106%，每周增长率约为26.5%。在第12个月末，你的年收入应为2.1百万美元，即300K美元。从第二个月到第三个月，你的月度增长率为106%，每周增长率约为26.5%。\n第一年有非常大的增长目标，但随着牵引力的增加，这些目标变得更容易管理。\n一家公司以210万美元的ARR进入了他们的SaaS冒险的第三阶段，进入了经常推荐的T2D3领域。\n如果我们进一步扩展这一点，仅用一年的视角，第二年到第六年看起来会是这样的：\nT2D3规则概述了它的ARR为200万美元，并设定了两次翻两番和三倍翻一番的目标。在200万美元大关上，这将建议：\n因此，Wow Rule建议在第三年、第四年和第五年略微放缓增长，以便在第六年年底达到几乎相同的数字。\n阅读本文，您可能会对一些重要的里程碑感到好奇，例如100米ARR和1B ARR。\n即使在第五年，母亲的增长仍然在6%以上，我们看到这个趋势从第10年一直持续到第10年，因为我们较早前所订的方程式总是预期每月最少有6%的增长是恒定不变的。\n虽然Wow Rule帮助公司跟踪其增长，但我们可以听到它知道如何花钱才能继续增长。因为我们有超级增长规则，其中包括一个基于现有ARR和百分比增长的计算器。\n我在推特上收到了一些反馈。如果你已经通过了，请在那里加入我们的对话！\n一家风险投资SaaS公司的收入增长指引：月度环比(MOM)增长=6%+(14%/上个月以百万美元为单位)。200万美元应该是妈妈的13%左右，600万美元是8%。T2D3：2、7、16、34、70、144。YC建议10%的WOW，使用这个配方只能持续3个月。\n-Sid Sijbrdij(@sytses)2019年12月24日。\n注册GitLab每月两次的时事通讯，探索即将到来的网络广播、操作博客，并随时了解每月发布的令人兴奋的新功能：\nGitLab不仅仅是源代码管理或CI/CD。它是一个完整的软件开发生命周期&在单个应用程序中的DevOps工具。\n免费试用GitLab", "note_en": "At GitLab, we believe that part of measuring success is having a target that you&#39;re working toward.It&#39;s not enough to say, &#34;we&#39;re interested in growth&#34; but being specific in what the goals for that growth are is the difference between thinking that 1% growth is enough or underperforming.Setting targets not just for growth but all performance indicators is about expectation management and getting alignment- making sure that everyone is on the same page on what results should be.To see how this manifests in our regular work,  all KPIs have targets and all  job families have performance indicators.\n When growing a SaaS startup, early-stage founders often ask: how quickly should my startup be growing?There&#39;s a lot of seemingly conflicting advice out there.\n For example, at YC Combinator, we were often told that we should aim for 10% growth week over week.As  Paul Graham writes on growth,\n During Y Combinator we measure growth rate per week, partly because there is so little time before Demo Day, and partly because startups early on need frequent feedback from their users to tweak what they&#39;re doing.A good growth rate during YC is 5-7% a week.If you can hit 10% a week you&#39;re doing exceptionally well. If you can only manage 1%, it&#39;s a sign you haven&#39;t yet figured out what you&#39;re doing.\n  Most of the phases center around a mantra I call “triple, triple, double, double, double,” (T2D3 for short), referring to a company’s annualized revenue growth.\n There&#39;s  the Rule of 40,  the magic number, and loads of other advice out there.\n All of these suggest that there can be many ways to track growth at different phases in a company&#39;s development, but it can be hard to understand how they fit together or what is best.\n  The WoW Rule is the guideline for the revenue growth of a venture funded SaaS company.This is based on my experience growing  GitLab and as an investor in other companies.If you want to know what your revenue growth targets for your SaaS startup should be, keep reading.\n Month over Month (MoM) growth = 6% + ( 14% / last month ARR in $m )\n  Until you&#39;re at $2 million dollars in ARR, what does aiming for month over month growth of 6% plus 14% divided by last month&#39;s ARR in millions?\n  At the end of the first month, you&#39;re at 0 ARR.At the end of the second month, you&#39;re at .1 M ARR, or $100K.At the end of the third month, you&#39;re at .3 M ARR, or $300K.From the second month to the third month, that means 106% month over month growth, and approximately 26.5% week over week growth.At the end of month 12, you should be at $2.1 M ARR.\n There are very large growth targets in the first year, but these become more manageable as traction is gained.\n  At $2.1M ARR, a company is entering Phase 3 of their  SaaS adventure, moving into the oft-recommended T2D3 territory.\n    If we expand this futher, with just a year view, years 2 through 6 would look like:\n  The T2D3 rule outlines that it kicks in at 2 Million dollars of ARR and sets the goal of tripling twice and doubling 3 times.At the 2 Million dollar mark, that would suggest going to:\n     The Wow Rule, thus, suggests slightly slower growth in years three, four, and five, to achieve almost the exact same number at the end of year 6.\n  Reading this, there are a number of major milestones you may be curious about, such as 100M ARR and 1B ARR.\n      Even in year five, MoM growth is still above 6%.We see this trend through and beyond Year 10.This is because the formula we laid out earlier always expects at least 6% monthly growth as a constant.\n  While the Wow Rule helps a company track its growth, it can be heard to know how to spend in order to continue growth.For that we have the  Hypergrowth rule which includes a calculator based on existing ARR and percent growth.\n  I gotten some feedback on this  on Twitter.If you&#39;ve got throughts, please join the conversation there!\n Guideline for the revenue growth of a venture funded SaaS company: Month over Month (MoM) growth = 6% + ( 14% / last month ARR in  $m ). At $2m it should be about 13% MoM, at $6m it is 8%. T2D3: 2, 7, 16, 34, 70, 144. YC advises 10% WoW which only lasts 3 months with this formula.\n— Sid Sijbrandij (@sytses)  December 24, 2019\n Sign up for GitLab’s twice-monthly newsletter to explore upcoming webcasts, how-to blogs, and stay up-to-date on exciting new features released every month:\n GitLab is more than just source code management or CI/CD. It is a full software development lifecycle &amp; DevOps tool in a single application.\n Try GitLab for Free", "posttime": "2020-05-06 04:19:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "规则,rule,增长,growth", "title": "WOW规则：SaaS初创企业的增长公式", "title_en": "The WoW rule: A formula for growth for SaaS Startups", "transed": 1, "url": "https://about.gitlab.com/blog/2020/05/05/wow-rule/", "via": "", "real_tags": ["规则", "rule", "增长", "growth"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000824, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "高强度间歇训练是保持健康和快速燃烧卡路里的好方法。短时间的努力，然后是恢复期。冲洗并重复。这也是软件开发周期的好节奏。毕竟这叫短跑，不是马拉松！\n对我来说，是一周。日复一日地回来做同样的事情是很难的。一个周末和几瓶啤酒会导致停滞不前，很难恢复。见鬼，在周五晚上喝了几杯啤酒之后，我一直在挠头的任务已经成为遥远的记忆。不要抗拒这种自然的休息。坚持下去。\n既然我们已经设置了持续时间，那么它包含什么内容呢？我们怎样才能决定要做什么呢？嗯，如果你没有删除你的积压工作，你将不得不作为一个团队做出决定。你的脑海中只会有几件真正紧迫的事情。再多了，你就是在自欺欺人。抱歉的。如果下一步处理哪项任务没有明显的选择，我建议一个新的功能框架是一个很好的起点。\n现在我们知道我们在做什么，我们知道这周我们要做什么。我们必须交付。我的目标是在周四结束前释放。这为生活中的曲线球提供了一个很好的缓冲。我们需要将这项任务(希望一开始就很小)降低到一周内就能完成的可交付成果。如果没有，就把它分解，然后减少，直到你有了你都有信心交付的东西。没有计划扑克，没有游戏，没有大惊小怪。如果您已经到了可以编写代码的年龄，那么您就应该知道得更清楚了。\n现在开始工作吧。把重点放在投放上。不要像盲人黑猩猩那样编写代码，但也不要过度关注代码质量。那是晚些时候的事。\n如果周四的发布进展顺利，周五早上和你的同事聊聊他们一天中浪费了大部分时间的事情，看看你是否能很快解决其中的一些问题。一次做一个，不要开始任何耗时超过一个小时的事情。\n一旦你做完了，你应该可以去酒吧了。你的领队正在买进！\n冲刺结束了，但我们不要忘记，您刚刚发布了一些代码，您希望将来的自己永远不会再看到这些代码。这就是问题所在。你会看到的，你只需要等几天。下周是恢复期。是时候治愈代码、治愈团队和治愈公司了。\n现在我们有了一些有用的东西。重构应该花费更少的时间，并且应该是一项协作任务。现在是讨论代码质量的时候了，希望能在这个过程中互相学习。这是团队治疗，不是暗杀。\n最迟在周三或周四之前把自己做完。然后又回到了与人交谈的话题上。是的，请讲！与您的用户交谈。和其他部门谈谈。找个人聊聊！找到他们的痛苦并解决它(留意下一个冲刺功能，因为解决人们的问题不应该是你的重点)。你会让别人很开心的。你要让开发团队拥有一张面孔和个性，并为你的公司文化注入一些燃料。", "note_en": "High Intensity Interval training is a great way to keep fit and burn calories quickly. Short bursts of effort followed by a recovery period. Rinse and repeat. This is also a good rhythm for software development cycles. It is called a Sprint after all, not a marathon!\n   For me, it’s a week. Coming back, day after day, to work on the same thing is hard. A weekend and a few beers causes a stall and it’s hard to recover. Hell, after a few beers on a Friday night, the task I’ve been scratching my head over is a distant memory. Don’t fight this natural break. Adhere to it.\n Now that we’ve set the duration, what goes into it? How can we decide what to work on? Well, if you’ve  deleted your backlog, you will have to decide as a team. There will only ever be a few truly pressing items on your minds. Any more and you’re lying to yourself. Sorry. If there is no obvious choice for which task to tackle next, I suggest a  feature framework is a great place to start.\n Now we know what we’re doing and we know we’re doing it this week. We must deliver. I aim to release by end of day on Thursday. This gives a nice buffer for the curveballs of life. We need to reduce this task (hopefully it’s small to begin with) down to a deliverable that is achievable within a week. If not, break it down and reduce until you have something you are all confident of delivering. No planning poker, no games, no fuss. If you’re old enough to code, you’re old enough to know better.\n Now work. Focus on delivery. Don’t code like a blind chimp but also don’t overly sweat the code quality. That comes later.\n If the release goes well on Thursday, spend Friday morning talking to your work colleagues about the things in their day that waste most of their time and see if you can fix some of them very quickly. Do these one at a time and don’t start anything that’s going to take longer than an hour.\n  Once you are done, you should be able to make your way to the pub. Your team lead is buying!\n  The sprint is over, but let’s not forget that you just released some code that you hope your future self never has to see again. Here’s the rub. You will see it and you’ll only have to wait a couple of days. This next week is the recovery period. Time to heal the code, heal the team and heal the company.\n Now we have something working. A refactor should take far less time and be a collaborative task. This is time to discuss code quality and hopefully teach each other something in the process. This is a team therapy session, not an assassination.\n Get yourselves done by Wednesday, or Thursday at the latest. Then it’s back to speaking to people. Yes, speaking! Talk to your users. Talk to other departments. Talk to someone! Find their pain and fix it (keep an ear out for the next sprint feature as solving peoples problems  should be your focus). You’ll make someone’s day. You’ll put a face and a personality to the dev team and put some fuel in the tank for the culture of your company.", "posttime": "2020-05-06 04:19:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,高强度,intensity,应该,code", "title": "开发人员的高强度间歇训练", "title_en": "High Intensity Interval Training for Devs", "transed": 1, "url": "https://www.linkedin.com/pulse/hiit-developers-david-roberts/", "via": "", "real_tags": ["开发", "高强度", "intensity", "应该", "code"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000823, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "✅灵感来自盖茨比，你可以查询任何数据(Markdown，应用编程接口，数据库，内容管理)与图形QLSSG框架不可知性，与任何框架，有✅支持✅吨插件流行的无头内容管理(还没有，我们需要您的贡献！)。\n模块。exports={webpack(Config){const{mordredWebpack Plugin}=要求(&#39；mordred/webpack)const mordredPlugin=new MordredWebpack Plugin()配置。插件。PUSH(MordredPlugin)返回配置}，}。\n模块。exports={插件：[{Resolve：&#39；Mordred-source-Filessystem&#39；，选项：{//这是您将在其中创建Markdown文件的路径：__dirname+&#39；/content&#39；，}，}，{Resolve：&#39；Mordred-Transformer-markdown&#39；，}，]，}。\n当您运行NEXT或NEXT BUILD时，Mordred将在Mordred/raphql.js中生成一个GraphQL客户端，然后您可以使用生成的客户端来查询数据。\nimport{query，gql}from&#39；../Mordred/GraphQL&#39；export const getStaticProps=async()=&gt；{const{data，error}=等待查询(gql`{allMarkdown{Nodes{id slug createdAt UpdatedAt html FrontMaterial{#.。或任何首页内容#like：title}`)if(Error){掷出错误[0]}return{props：{.data，}，}}导出默认值({allMarkdown})=&gt；{return(&lt；ul&gt；{allMarkdown。节点。map((Post)=&gt；{return(&lt；li key={post.。id}&gt；&lt；Link href={`/post/${post.。slug}`}&gt；{POST。title}&lt；/Link&gt；&lt；/li&gt；)})}&lt；/ul&gt；)}。\n从EXPRESS导入EXPRESS；从EXPRESS-GraphQL&#39；导入GraphqlHTTP；从&#39；../../Mordred/GraphQL&#39；Const app=express()app导入{schema}。使用(raphqlHTTP({schema，raphiql：true，}))导出默认APP。\n我们正在等待Nuxt；的全静态模式，不过已经可以将Mordred与Nuxt#s的异步数据一起使用了。我们将很快对此进行记录。", "note_en": "✅ Inspired by  Gatsby, you can query any data (Markdown, API, database, CMS) with GraphQL  ✅ Framework agnostic, works with any framework that has SSG support  ✅ Tons of plugins for popular headless CMS (not yet, we need your contribution!)\n        module. exports  = {  webpack( config) {  const {  MordredWebpackPlugin }  =  require(  &#39;mordred/webpack &#39;)  const  mordredPlugin  =  new  MordredWebpackPlugin()  config. plugins. push(mordredPlugin)  return config },}\n  module. exports  = { plugins : [ { resolve :   &#39;mordred-source-filesystem &#39;, options : {   // This is where you&#39;ll be creating Markdown files path :  __dirname  +   &#39;/content &#39;, }, }, { resolve :   &#39;mordred-transformer-markdown &#39;, }, ],}\n      When you run  next or  next build, Mordred will generate a GraphQL client at  mordred/graphql.js, then you can use the generated client to query data.\n  import {  query,  gql }  from   &#39;../mordred/graphql &#39; export  const  getStaticProps  =  async ()  =&gt; {  const {  data,  errors }  =  await  query(  gql `  {   allMarkdown {   nodes {   id   slug   createdAt   updatedAt   html   frontmatter {   # ... or any frontmatter   # like:   title  }  }  }  }   `)  if (errors) {  throw errors[ 0] }  return { props : {  ...data, }, }} export  default ({ allMarkdown })  =&gt; {  return (  &lt;ul &gt; { allMarkdown. nodes. map(( post)  =&gt; {  return (  &lt;li key ={ post. id} &gt;  &lt;Link href ={  `/post/  ${ post. slug } `} &gt;{ post. title} &lt; /Link &gt;  &lt; /li &gt; ) })}  &lt; /ul &gt; )}\n   import  express  from   &#39;express &#39; import  graphqlHTTP  from   &#39;express-graphql &#39; import {  schema }  from   &#39;../../mordred/graphql &#39; const  app  =  express() app. use(  graphqlHTTP({ schema, graphiql :  true, })) export  default  app\n  We&#39;re waiting for Nuxt&#39;s full-static mode, it&#39;s already possible to use Mordred with Nuxt&#39;s  asyncData though. We&#39;ll document this soon.", "posttime": "2020-05-06 04:18:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "地方,brings,mordred", "title": "莫德雷德将盖茨比的“来自任何地方的源数据”的想法带给了我们其余的人", "title_en": "Mordred brings Gatsby's “source data from anywhere” idea to the rest of us", "transed": 1, "url": "https://github.com/egoist/mordred", "via": "", "real_tags": ["地方", "brings", "mordred"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000822, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有些地方出了差错，但别担心-让我们再试一次吧。", "note_en": "Something went wrong, but don’t fret — let’s give it another shot.", "posttime": "2020-05-06 04:18:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "化身,ian,担心,don", "title": "两周前，伊恩·科尔德沃特给我指派了一个女性化身来获得“完全效果”。", "title_en": "2 weeks ago, Ian Coldwater assigned me a lady avatar to get the “full effect”", "transed": 1, "url": "https://twitter.com/grhmc/status/1257691144290533377", "via": "", "real_tags": ["化身", "ian", "担心", "don"]}, {"category": "", "categoryclass": "", "imagename": "966994798c60480a535d99883d4576e7.jpg", "infoid": 1000821, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊公司证实，纽约斯塔顿岛履行中心的一名工作人员死于冠状病毒。自3月初以来，名为JFK8的设施的工人们一直在呼吁采取更多的安全预防措施。虽然亚马逊做出了改变，但被诊断出感染该病毒的员工数量仍在继续攀升。根据The Verge查看的警报，至少有29名工人生病。\n管理人员昨天通知了JFK8的几名工人死亡的消息。亚马逊表示，这名员工最后一次在现场是在4月5日，在4月11日被确认感染冠状病毒后被隔离。亚马逊的一位发言人说：“我们对我们在纽约州斯塔滕岛的网站失去了一名同事深感悲痛。”“他的家人和亲人在我们的思念中，我们支持他的同事们。”\nJFK8是亚马逊几家工厂中第一家在3月下旬让工人罢工抗议公司处理冠状病毒的工厂。在那次罢工之后，亚马逊对仓库流程进行了一系列改变，包括强制要求社交距离和对员工发烧进行筛查。在上周发布的季度收益报告中，该公司表示，计划花费40亿美元-相当于预期的营业利润-用于应对冠状病毒。但工人们表示，安全预防措施仍然不足，他们的工作往往要求他们离得很近。\n亚马逊还没有公布有多少设施出现冠状病毒病例或有多少工人生病的统计数据，但根据工人收到的警报估计，设施的数量超过130家-一些设施，比如JFK8，有几十个病例。(亚马逊的一位发言人表示，JFK8的感染率低于周围社区，该公司认为仓库的病例没有关联。)。已知的第一例亚马逊仓库工人死亡事件发生在3月31日，他是亚马逊加州霍桑工厂的一名运营经理。4月1日，位于加利福尼亚州特雷西的亚马逊仓库的一名员工死亡。到目前为止，亚马逊在美国只关闭了一家设施，位于肯塔基州的一个退货处理中心，而且是在州长下令这样做之后。自4月16日以来，亚马逊在法国的仓库一直处于关闭状态，此前一家法国法院裁定，送货应仅限于食品杂货和医疗用品等必需品。\n亚马逊一直在大举招聘，试图满足疫情期间激增的需求。最近几周，它已经雇佣了17.5万名工人，本月，它结束了危机早期开始的一项政策，该政策允许工人无限制地无薪休假。自政策结束以来，JFK8的工人表示，条件比往常更加拥挤。\n亚马逊也对工人的抗议做出了积极回应。它解雇了第一次JFK8罢工的组织者克里斯蒂安·斯莫尔斯(Christian Smalls)，副总统获得的一份备忘录透露了诽谤他的计划。纽约州总检察长办公室在NPR获得的一封信中表示，该仓库的安全预防措施“不足”，该公司可能违反了该州的举报人保护法。亚马逊还解雇了宾夕法尼亚州明尼苏达州提出安全问题的工人，以及JFK8的第二名工人。上个月，该公司解雇了两名用户体验设计师，因为他们的组织亚马逊气候正义员工组织了一次活动，听取仓库工人的意见。\n亚马逊高级工程师兼副总裁蒂姆·布雷因举报人被解雇而辞职，这一最新迹象表明，仓库条件引发的骚乱正在蔓延到公司的白领员工队伍中。他表示，“继续担任亚马逊副总裁实际上意味着批准我所鄙视的行动。”", "note_en": "A worker at Amazon’s Staten Island, New York, fulfillment center has died of COVID-19, the company confirmed. Workers at the facility, called JFK8, have been calling for  greater safety precautions since early March. While Amazon has made changes, the number of workers diagnosed with the virus continues to climb. According to alerts viewed by  The Verge, at least 29 workers have fallen ill.\n Managers notified several workers at JFK8 of the death yesterday. Amazon says the employee was last on site on April 5th and was placed on quarantine after he was confirmed to have COVID-19 on April 11th. “We are deeply saddened by the loss of an associate at our site in Staten Island, NY,” an Amazon spokesperson said. “His family and loved ones are in our thoughts, and we are supporting his fellow colleagues.”\n JFK8 was the first of several Amazon facilities to have workers walk out in protest of the company’s handling of COVID-19, in late March. Following that walkout, Amazon made a series of changes to warehouse processes, including mandating social distancing and screening workers for fevers. In its quarterly earnings release last week, the  company said it planned to spend $4 billion — equivalent to its expected operating profit — on its COVID-19 response. But workers say the safety precautions are still insufficient and that their jobs often require them being in close proximity.\n Amazon hasn’t released statistics on how many facilities have had COVID-19 cases or how many workers have fallen ill, but estimates tallied by workers from alerts they receive put the number of facilities at over 130 — some, like JFK8, with dozens of cases. (An Amazon spokesperson says the rate of infection at JFK8 is below that of the surrounding community and that the company believes the cases at the warehouses are not connected.) The  first known death of an Amazon warehouse worker occurred on March 31st, an operations manager at Amazon’s Hawthorne, California facility. An employee at an Amazon warehouse in Tracy, California, died on  April 1st. So far, Amazon has closed only one facility in the US, a returns-processing center in Kentucky, and only after it was ordered to do so by the governor. Amazon warehouses in France have been  shut since April 16th, after a French court ruled that deliveries should be limited to necessities such as groceries and medical supplies.\n Amazon has been on a hiring spree as it attempts to meet surging demand during the pandemic. It has hired 175,000 workers in recent weeks, and this month, it ended a policy begun early in the crisis allowing workers to take unlimited time off without pay. Since the policy ended, workers at JFK8 say conditions have been even more crowded than usual.\n Amazon has also responded aggressively to worker protests. It fired the organizer of the first JFK8 walkout, Christian Smalls, and a  memo obtained by  Vice revealed plans to smear him. The New York Attorney General’s office said in a letter  obtained by  NPR that safety precautions at the warehouse were “inadequate” and the company may have violated the state’s whistleblower protection laws. Amazon also fired workers who raised safety concerns in Minnesota, Pennsylvania, and a second worker at JFK8. Last month, the company  fired two user experience designers after their group, Amazon Employees for Climate Justice, organized an event to hear from warehouse workers.\n In the latest sign that unrest over warehouse conditions is spreading the company’s white-collar workforce, Amazon senior engineer and vice president  Tim Bray resigned over the firings of whistleblowers, saying that “remaining an Amazon VP would have meant, in effect, signing off on actions I despised.”", "posttime": "2020-05-06 04:18:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,amazon,亚马逊,冠状病毒,工人", "title": "纽约亚马逊仓库工人死于冠状病毒", "title_en": "Amazon warehouse worker in New York has died of Covid-19", "transed": 1, "url": "https://www.theverge.com/2020/5/5/21248427/amazon-warehouse-worker-coronavirus-death-new-york-covid-19", "via": "", "real_tags": ["病毒", "amazon", "亚马逊", "冠状病毒", "工人"]}, {"category": "", "categoryclass": "", "imagename": "bb4b548498b9ff433a090a00f19f0321.jpg", "infoid": 1000820, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人工智能系统按你说的做，很难准确地说出你的意思。让我们来看看现实生活中规范游戏的例子列表！相关视频来自.", "note_en": "AI systems do what you say, and it's hard to say exactly what you mean. Let's look at a list of real life examples of specification gaming! Related Videos fr...", "posttime": "2020-05-06 04:18:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "博弈,specification,视频,systems", "title": "规范博弈示例", "title_en": "Examples of Specification Gaming", "transed": 1, "url": "https://www.youtube.com/watch?v=nKJlF-olKmg", "via": "", "real_tags": ["博弈", "视频", "systems"]}, {"category": "", "categoryclass": "", "imagename": "ea5b155e542b897f3f1054cb9f1c2956.jpg", "infoid": 1000819, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌今天开源了一个机器学习模型，它可以指出自然语言问题的答案(例如，“哪个摔跤手出场次数最多？”)。在电子表格和数据库中。该模型的创建者声称，它甚至能够找到分散在多个细胞中的答案，或者可能需要聚合多个细胞。\nGoogle Research的托马斯·穆勒(Thomas Müller)在一篇博客文章中指出，世界上的大部分信息都是以表格的形式存储的，比如全球金融统计数据和体育结果。但这些表格往往缺乏一种直观的方式来筛选它们-这是谷歌的人工智能模型旨在解决的一个问题。\n回答诸如“前两名摔跤运动员的平均冠军时间？”该模型对问题进行联合编码，并逐行对表内容进行编码。它利用基于Transformer的BERT体系结构-既是双向的(允许它访问来自过去和未来方向的内容)又是无监督的(这意味着它可以接收既没有分类也没有标记的数据)-与称为嵌入的数字表示一起扩展，以编码表结构。\n根据Müller的说法，一个关键的补充是用于编码结构化输入的嵌入。列索引、行索引和一个特殊的等级索引的学习嵌入向模型指示数值列中元素的顺序。\nVB Transform 2020 Online-7月15日至17日：与领先的AI高管一起参加年度AI活动。立即注册，可节省30%的数字访问通行证。\n对于每个表格单元格，模型都会生成一个分数，指示该单元格成为答案一部分的概率。此外，它还输出一个运算(例如，“Average”、“SUM”或“Count”)，指示必须应用哪个运算(如果有的话)才能产生最终答案。\n为了预先训练模型，研究人员从英文维基百科中提取了620万对表格-文本对，作为训练数据集。在预培训期间，模型学习了-以相对较高的准确性-恢复表格和文本中已被删除的单词。事实上，对于培训期间看不到的桌子，71.4%的项目恢复正确。\n在预训后，米勒和他的团队通过弱监督对模型进行了微调，使用有限的源来提供标记训练数据的信号。他们报告说，最好的模型比最先进的顺序回答数据集(Sequential Answer DataSet)高出12个百分点。顺序回答数据集是微软创建的基准，用于探索在桌子上回答问题的任务。它还击败了斯坦福大学WikiTableQuestions之前的顶级模式，后者包含来自维基百科的问题和表格。\n“弱监督方案是有益的，因为它允许非专家提供训练模型所需的数据，并且比强监督花费更少的时间，”Müller说。", "note_en": "Google today  open-sourced a machine learning model that can point to answers to natural language questions (for example, “Which wrestler had the most number of reigns?”) in spreadsheets and databases. The model’s creators claim it’s even capable of finding answers spread across cells or that might require aggregating multiple cells.\n Much of the world’s information is stored in the form of tables, Google Research’s Thomas Müller points out in a blog post, like global financial statistics and sports results. But these tables often lack an intuitive way to sift through them — a problem Google’s AI model aims to fix.\n  To answer questions like “Average time as champion for top 2 wrestlers?” the model jointly encodes the question, as well as the table content row by row. It leverages a  Transformer-based  BERT architecture — one that’s both bidirectional (allowing it to access content from past and future directions) and unsupervised (meaning it can ingest data that’s neither classified nor labeled) — extended along with numerical representations called embeddings to encode the table structure.\n A key addition was the embeddings used to encode the structured input, according to Müller. Learned embeddings for the column index, the row index, and one special rank index indicate to the model the order of elements in numerical columns.\n   VB Transform 2020 Online - July 15-17: Join leading AI executives at the AI event of the year.  Register today and save 30% off digital access passes.\n For each table cell, the model generates a score indicating the probability that the cell will be part of the answer. In addition, it outputs an operation (e.g., “AVERAGE,” “SUM,” or “COUNT”) indicating which operation (if any) must be applied to produce the final answer.\n To pretrain the model, the researchers extracted 6.2 million table-text pairs from English Wikipedia, which served as a training data set. During pretraining, the model learned — with relatively high accuracy — to restore words in both tables and text that had been removed. In fact, 71.4% of items were restored correctly for tables unseen during training.\n After pretraining, Müller and his team fine-tuned the model via weak supervision, using limited sources to provide signals for labeling the training data. They report that the best model outperformed the state-of-the-art for the Sequential Answering Dataset, a Microsoft-created benchmark for exploring the task of answering questions on tables, by 12 points. It also bested the previous top model on Stanford’s WikiTableQuestions, which contains questions and tables sourced from Wikipedia.\n “The weak supervision scenario is beneficial because it allows for non-experts to provide the data needed to train the model and takes less time than strong supervision,” said Müller.", "posttime": "2020-05-06 04:18:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,开源,人工智能,open,模型", "title": "Google开源人工智能，搜索表以回答自然语言问题", "title_en": "Google open-sources AI that searches tables to answer natural language questions", "transed": 1, "url": "https://venturebeat.com/2020/04/30/google-open-sources-ai-that-searches-tables-to-answer-natural-language-questions/", "via": "", "real_tags": ["google", "开源", "人工智能", "open", "模型"]}, {"category": "", "categoryclass": "", "imagename": "ea7ab849988f73249056f6df2d71c178.jpg", "infoid": 1000818, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Airbnb首席执行官布莱恩·切斯基(Brian Chesky)周二告诉员工，Airbnb计划裁员1900人，约占其员工总数的四分之一，因为冠状病毒大流行对旅游业造成了残酷的打击。\n切斯基在一份备忘录中表示，预计今年的营收将不到2019年的一半。该公司去年的营收为48亿美元。切斯基还表示，Airbnb将缩小重点，暂停与交通和电视制作相关的项目，并缩减营销酒店和豪华地产的努力。\nAirbnb首席执行官布莱恩·切斯基(Brian Chesky)周二告诉员工，Airbnb计划裁员1900人，约占其员工总数的四分之一，因为冠状病毒大流行对旅游业造成了残酷的打击。\n切斯基在一份备忘录中表示，预计今年的营收将不到2019年的一半。该公司去年的营收为48亿美元。切斯基还表示，Airbnb将缩小其.", "note_en": "Airbnb is planning to lay off 1,900 employees, or roughly a quarter of its total work force, CEO Brian Chesky told employees Tuesday, as the coronavirus pandemic takes a brutal toll on the travel business.\n Revenue this year is expected to be less than half what it was in 2019, Chesky said in a memo. The company had $4.8 billion in revenue last year. Chesky also said that Airbnb will narrow its focus, suspending projects related to transportation and television production and scaling back efforts to market hotels and luxury properties.\n      Airbnb is planning to lay off 1,900 employees, or roughly a quarter of its total work force, CEO Brian Chesky told employees Tuesday, as the coronavirus pandemic takes a brutal toll on the travel business.\n Revenue this year is expected to be less than half what it was in 2019, Chesky said in a memo. The company had $4.8 billion in revenue last year. Chesky also said that Airbnb will narrow its ...", "posttime": "2020-05-06 04:06:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "airbnb,chesky", "title": "Airbnb将裁员1000至2000名员工", "title_en": "Airbnb to lay off between 1k and 2k employees", "transed": 1, "url": "https://www.theinformation.com/articles/airbnb-plans-significant-layoffs", "via": "", "real_tags": ["airbnb", "chesky"]}, {"category": "", "categoryclass": "", "imagename": "aa329c3e4dd3cedb31706e3c3593ac81.png", "infoid": 1000817, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "网络托管巨头GoPardy刚刚向美国加利福尼亚州提交了一份数据泄露通知。\n现在成为公共记录一部分的违约信只是一个模板，收件人的名字和与他们所在地区相关的电话号码都留有空格，但它列出了到目前为止所知的情况。\n如果你是GoPardy的客户，如果你看到这样的消息，你就会知道你是否在受影响的账户列表中：\n主题：影响您的GoPardy虚拟主机帐户的安全事件[…]。我们需要通知您一起影响您的GoPardy虚拟主机帐户凭据的安全事件。我们最近在我们的服务器子集上发现了可疑活动，并立即开始调查。\n调查发现，一个未经授权的人有权访问您的登录信息，该信息用于连接到您主机帐户上的SSH。我们没有证据表明您的帐户上有任何文件被添加或修改。未经授权的个人已被阻止进入我们的系统，我们将继续调查对整个环境的潜在影响。\n还有更多，包括警告你的账户信息已被重置，以及如何重新进入你的账户，但从技术角度-实际发生了什么，以及如何检测到入侵-只有上面的文本可以继续。\n显然，这不仅仅是一个凭据填充的情况，账户被访问的原因是他们的密码与其他已经被攻破的服务使用的密码相同，否则GoPardy不会提交入侵通知。\n此外，从违约信中不明显的是(尽管它在加利福尼亚州的网站上声明)，违规可以追溯到2019年10月。\n换句话说，尽管在这个阶段重新设置你的账户是GoPardy需要做的事情，但从理论上讲，任何知道你登录细节的骗子都可能已经在翻你的东西超过六个月了。\n这就是为什么GoPardy还“建议你对你的托管账户进行审计”。\n这应该包括查看您的日志中是否有您意想不到的修改，特别是对PHP脚本、HTML页面、JavaScripts和服务器插件等文件的更改或添加。\n(当您出于某种原因进行审计时，您可能还需要注意可能由于其他原因而引发的问题--例如未打补丁的软件或错误配置的服务器选项。)。\n我们不能告诉你的是，上面提到的“未经授权的个人”是如何获得非法数据的，这些“登录信息”实际上涉及到什么，以及他们实际上实现了什么类型的访问(如果有的话)。\n我们假设GoPardy关于没有文件“被添加或修改”的建议是合理的--无论我们对调查的这个阶段知之甚少，我们怀疑，在公司日志中的某个地方，以某种方式可以检测到非法的修改。\n我们不知道入侵者能够翻阅多少文件(如果有的话)，甚至可能可以逃脱，但我们假设GoPardy在未来可能会有更多的发现要披露。\n弄清楚所有可能发生但没有发生的事情往往是任何后续行动中最困难的部分，GoPardy的调查仍在进行中。\nGoPardy向受影响的客户免费提供一些附加服务，即它称为网站安全豪华版和快速恶意软件删除的产品。\n你不妨试一试--如果你最终没有使用它们，你没有损失任何东西，但你可能会发现它们会发现你原本会忽略的问题，比如过时的Web服务器插件或你忘了打补丁的软件。\n点击并拖动下面的声波可以跳到播客中的任意位置。您也可以直接在SoundCloud上收听。", "note_en": "Web hosting behemoth GoDaddy just filed a  data breach notification with the US state of California.\n The  breach letter that’s now part of the public record is just a template, with blanks for the name of the recipient and for a phone number relevant to their region, but it sets out what’s known so far.\n If you’re a GoDaddy customer, you’ll know if you were on the list of affected accounts if you see a message like this:\n Subject: Security Incident Impacting Your GoDaddy Web Hosting Account […] We need to inform you of a security incident impacting your GoDaddy web hosting account credentials. We recently identified suspicious activity on a subset of our servers and immediately began an investigation.\n The investigation found that an unauthorized individual had access to your login information used to connect to SSH on your hosting account. We have no evidence that any files were added or modified on your account. The unauthorized individual has been blocked from our systems, and we continue to investigate potential impact across our environment.\n There’s more, including a warning that your account information was reset and how to get back into your account, but from a technical point of view – what actually happened and how the breach was detected – there is only the above text to go on.\n Clearly this isn’t just a case of  credential stuffing, where accounts were accessed because their passwords were the same as the passwords used on other services that had already been breached, or GoDaddy wouldn’t have filed a breach notification.\n Also, what’s not obvious from the breach letter (though it is stated on the State of California’s website), is that the breach dates back to October 2019.\n In other words, even though resetting your account at this stage was something that GoDaddy needed to do, any crook or crooks who knew your login details could, in theory, have been riffling through your stuff for more than six months.\n That’s why GoDaddy also “recommend[s] you conduct an audit of your hosting account”.\n That should include looking through your logs for modifications you didn’t expect, especially changes to or additions of files such as PHP scripts, HTML pages, JavaScripts and server plugins.\n (When you’re doing an audit for one reason, you might as well be on the lookout for trouble that could have started for other reasons while you’re about it – such as unpatched software or incorrectly configured server options.)\n  What we can’t tell you is how the “unauthorized individual” mentioned above got access to the illicit data, what that “login information” actually entailed, and what sort of access they actually effected, if any.\n We are assuming that GoDaddy’s suggestions that no files “were added or modified” is reasonable – no matter how little else is known as this stage of the investigation, we suspect that unlawful alterations would have been detectable in some way, somwhere in the company’s logs.\n We don’t know how many files, if any, the intruder was able to riffle through and perhaps even to make off with, but we’re assuming that GoDaddy may have more findings to reveal in the future.\n Figuring out all the many things that could have happened but didn’t is often the hardest part of any follow-up, and GoDaddy’s investigation is still going on.\n  GoDaddy is offering affected customers access to some of its add-on services for free, namely the products it calls Website Security Deluxe and Express Malware Removal.\n You might as well try them out – if you end up not using them you have lost nothing, but you might find that they find problems you would otherwise have missed, such as long-outdated web server plugins or software that you forgot to patch.\n   Click-and-drag on the soundwaves below to skip to any point in the podcast. You can also  listen directly on Soundcloud.", "posttime": "2020-05-06 04:06:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "个人,unauthorized,账户,godaddy", "title": "GoPardy-“未经授权的个人”可以访问登录信息", "title_en": "GoDaddy – “unauthorized individual” had access to login info", "transed": 1, "url": "https://nakedsecurity.sophos.com/2020/05/05/godaddy-unauthorized-individual-had-access-to-login-info/", "via": "", "real_tags": ["个人", "账户", "godaddy"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000816, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如今，除了实时流媒体或少数专业应用程序外，人们用来构建互联网应用程序的首选传输层协议是TCP。\n问题是，对于我们正在使用的东西来说，TCP并不是真的那么好。\n除了阐明我的观点所必需的之外，我不会详细说明它是如何工作的，但是让我们来看看应用程序是如何使用TCP的。\n在某个地方，程序希望通过TCP提供服务，因此它告诉网络堆栈它希望侦听选定的TCP端口(例如，Web服务器的端口80或443)。\n一旦发生这种情况，某处的客户端就可以通过指定运行服务器的计算机的地址和端口号来尝试连接到它。当三次握手发生时，会有一个短暂的延迟-客户端向服务器发送请求(称为SYN)，服务器以提供响应(称为SYN/ACK)，客户端回复接受该提供(称为ACK)。客户端使用连接所用的时间是SYN到达服务器和SYN/ACK返回所用的时间，称为连接的往返时间。\n在此之后，服务器上的网络堆栈通知服务器程序有一个新连接，而客户端上的网络堆栈通知客户端程序连接已就绪-如果一切正常。\n但是，如果连接已建立，则两端都可以向对方发送字节流。TCP采用底层网络-它是基于数据包的，这意味着小块数据以消息的形式发送-并创造了类似串行电缆或进程之间的UNIX管道的错觉：仅仅是字节流。在幕后，它处理检测丢失的数据包并重新传输它们，确保无序到达的数据包以正确的顺序传递，而不是随机重新排列字节流的部分，以及流量控制：检测正在发送的流量何时超出了客户端和服务器之间的网络中的某个瓶颈，并降低其发送的速率，以避免浪费资源。\n它通过检测拥塞来执行流量控制，这是在Internet上真正可能的唯一方法：查看它发送的数据包实际到达接收方的速率。有些数据包由于通信链路上的设备故障或噪声而丢失，这是传输中数据包的一种背景致死率，而不管发送了多少数据。但是，当网络中某处的路由器接收数据包的速度超过其沿链路发送数据包的速度时，它们会排队，如果队列太满，它会开始丢弃数据包，而不是在内存中保存太长时间。因此，当发送数据的速率上升时，链路上的丢包率将保持在后台，直到我们达到系统中最弱链路的容量，此时丢包率将上升-在短暂的延迟之后，队列填满，直到它们开始丢弃东西。\nTCP使用一个相对简单的技巧：当它发送的数据包丢失时(它知道这一点，因为另一端没有确认接收到它)，它会稍微降低发送速率。但是，当流量畅通无阻地通过时，发送速率会略有提高。这意味着，只要后台丢包的基本速率不是太高，它就会慢慢增加发送速率，直到它压倒最慢的链路，然后在注意到它之后(队列需要一段时间才会超载，会丢弃一些东西，丢失会被接收方注意到，这一事实会传回发送方)，它就会降低发送速率-使得发送速率将徘徊在最大值附近，稍微推动它，直到它得到一些分组丢失，然后再次移动回来。(#**$$}{##**$$}。(还有一种称为随机早期检测(RED)的技术，用于在链路过载变得严重之前尝试用信号通知链路过载并改善反应时间，还有一种称为显式拥塞通知(ECN)的机制也有帮助，但在撰写本文时ECN尚未得到广泛应用)。\n如果您在进行大型文件传输时查看带宽消耗图表，则有时会在发生此情况时看到图表中的小波动。\n首先，当新的传输开始时，TCP堆栈不知道有多少带宽可用；它必须猜测，然后快速向上或向下调整到实际带宽。在实践中，它开始较低，然后迅速增加，这一过程称为缓慢启动。然而，因为它正在快速提高速率以找到丢失的起始点，任何背景丢失都会使它感到困惑，并导致连接开始变慢，然后只会慢慢提高速度；对于短暂的连接(或流量较短的连接)，它可能永远无法在结束之前找到最高速度。\n其次，此过程针对每个TCP连接独立进行。如果您有两个从一台计算机到另一台计算机的连接，则这两个连接都将独立地增加和降低其发送速率-这两个连接中的任何一个都会使瓶颈链路饱和，但这两个连接都可能会感觉到由此导致的数据包丢失。这意味着，如果一个连接发送得太快，则可能是另一个连接因为丢失了数据包而受到限制。当进出不同计算机的多个连接碰巧聚集在网络中的单个瓶颈处时，也会发生这种情况；在通常情况下，一条链路过载，通过它的所有连接都会丢失一些数据包，并且它们都会同时缩减规模，它们会集体反应过度，因为它们无法相互协调--导致链路未得到充分利用。\nTCP通过标记每个充满字节的数据包及其在流中的位置来确保它按顺序传送它发送的字节。如果接收方接收到字节0-100，然后是字节201-300，然后是字节101-200，它将直接将字节0-100传递给应用程序；位于字节201-300上，因为它们不是下一个字节；一旦字节101-200到达，就传递字节101-200，然后是保存的字节201-300。因此，应用程序按顺序接收每个字节。\n将东西下载到文件中。如果执行下载的应用程序刚被告知此处的字节201-300&34；，它可以将它们保存在文件中的位置201，然后一旦字节101-200出现，就将它们保存在文件中的位置101。将它们缓冲到TCP堆栈中并不能真正帮助任何人，也许只是稍微减轻了从磁盘I/O调度器中避免磁盘寻道的负担……。\n发送离散的请求/响应/消息。通常，应用程序需要发送一条消息。由于TCP只传输字节流，因此应用程序需要标记每条消息的开始和结束。TCP将负责将消息拆分成小到足以装入数据包的块，然后发送它们，然后将它们按顺序放回原处，这在消息中是很棒的；但是，如果应用程序发送了两条消息，并且第一条消息的一部分被延迟(或者在网络中采用了很长的路由，或者它没有到达，必须重新发送)，那么整个第二条消息就会位于TCP堆栈中，而不是提供给应用程序。(=。\n有时应用程序会对此感到高兴--如果这很重要，那么消息是按顺序处理的，当然，它需要等待。但这通常并不重要，事实上，如果消息以任何顺序到达就能得到处理，那么它实际上会更有用。因为TCP不知道应用程序是如何将TCP字节流分解成消息的，所以它不知道是否有完整的消息可以传递-它只知道字节。\n正如前面提到的，大多数TCP应用程序在TCP之上引入了它们自己的消息结构，因为原始字节流对于大多数应用程序的通信需求来说太低了(几乎没有TCP连接只不过是原始字节流；telnet几乎就是这样，但是嵌入了基于消息的控制信号-也许是FTP数据流？)。问题是，这给应用程序带来了一大堆复杂性，每次这一领域的标准化都很差，必须重新发明。\n很多TCP应用程序都采用简单的请求/响应模型。假设建立连接的一端需要来自等待连接的一端的一些服务，因此一旦建立连接，服务提供商就会坐在那里等待请求。客户端将以某种形式发送请求，并以某种方式标记请求的结尾(或者先发送长度，以便另一端知道要读取的字节数，或者为结尾设置特殊的标记-如果出于某种原因需要将该标记作为请求的一部分发送，则具有随之而来的复杂性)。然后，它将等待读回数据，因为返回的数据是对最后发送的请求的响应(同样，还有一些关于如何知道响应何时实际结束的详细信息)。\n这很容易实现-客户端中的代码类似于&#34；发送请求；读取响应；处理响应；而服务器中的代码类似于&#34；While(连接未关闭)：读取请求；处理请求；发送响应&#34；。\n但是，当您想要提升应用程序的性能时，这就成了一个问题。如果您的应用程序启动了一个长时间运行的请求，则其他请求不能同时发生-如果您愿意，您可以发送它们，但即使服务器在处理请求时正在监视其他请求到达(这在服务器实现时会增加复杂性)，它也只能按发送的顺序发送回响应。因此，一些协议向请求添加请求ID，响应可以以任何顺序到达，因为它们包含它们正在响应的请求的ID。现在，客户端和服务器应用程序可以随意发送请求，并在准备好后立即发回响应，代价是需要实现自己的多线程路由逻辑，并锁定对TCP连接的访问，以确保部分请求或响应不会因为尝试同时发送两个请求或响应而相互插入。但是，它仍然不完美-如果客户端请求一个大文件，大小为几GB，并且该文件是作为单个响应发送的(毕竟，它是对单个请求的响应，客户端可能事先不知道该文件有多大)，那么从服务器到客户端的TCP连接将在一段时间内用于发送该大响应，而其他快速响应在该响应完成之前不能被发送。(#**$}{##**$$}}。\n要解决这个问题，需要使协议变得更加复杂--现在可以将请求和响应拆分成更小的块，以及沿TCP连接交错的来自多个请求或响应的块，以便在另一端重新组装。\n而且，有时客户端发起的事情，服务器坐着等待模型是不够的。客户端应用程序可能会请求某些信息，并希望服务器在该信息发生更改时立即更新该信息。如果只有客户端可以发起操作，那么它必须不断询问服务器是否有任何更新以获得响应。理想情况下，两端都应该能够向另一端发送消息或等待响应的请求。在最初简单的请求/响应模型下，这是不可能实现的--但是如果我们已经开始使用分块来实现并发请求和响应，那么要使连接成为对称的，这只是沧海一粟。\n已经有一些尝试在TCP之上标准化有用的协议。在实践中，人们使用HTTP和WebSockets：HTTP作为成帧协议来表示消息的开始和结束，使用并发请求和分块的多路复用，并使用WebSockets来建立反向连接，以便服务器可以随意向客户端发送消息。这是一个实现起来相当复杂的堆栈，而且在网上发送的数据方面也相当浪费，因为要将最初设计为超文本传输协议(Hyper-Text Transport Protocol)的东西改编成适合此任务所需的各种变通方法和兼容性黑客技术，这是相当浪费的。\nBEEP是一种从头开始的尝试；目标看起来相当不错(虽然它是在XML很酷的时候做的，所以有一种讨厌的XML味道)，但它并没有起飞；我从来没有遇到过实现，该项目的网站自撰写本文时的2016年以来就没有更新过。\n与此相关的是，通过连接向下发送消息的应用程序通常具有具有不同需求的各种消息。想象一下一个在线游戏--如果玩家按下游戏中的一系列按钮，那么这些按钮必须以正确的顺序到达服务器。但同时，服务器可能正在用所有其他播放器的最新位置流回消息；如果其中一个丢失，当流中充满包含更新的播放器位置的消息，从而使丢失的消息完全过时时，停止整个流以等待其重新传输是浪费的。但是，同样，由于TCP不知道应用程序的消息边界，所以它不能以不同方式处理不同的消息。\n如果用于打开TCP连接的三次握手的一部分在网络中丢失，客户端会发现，因为它没有在合理的时间范围内取回SYN/ACK，然后重试。它会一直尝试一段时间，然后才会放弃。无论哪种方式，如果网络出现故障或不可靠，网络堆栈可能会有几秒钟的延迟，然后才会向客户端程序报告它有一个工作正常的连接，或者它无法获得连接。\n而且三次握手(以及用于关闭连接的FIN数据包)可能是浪费时间。如果要通过TCP连接发送的整个内容正好可以放在一个数据包中，我们最终将执行以下操作：\n发送六个数据包，发送一个数据包！我们本可以这么做的：\n服务器-客户端：ACK(这样客户端就知道它已到达，不必重新发送)。\n最重要的是，这些短连接将得不到流量控制；TCP的每个连接的流量控制甚至不会启动。\n由于这种小连接代价，HTTP中已经做了大量工作，以使其对多个逻辑HTTP请求重用单个TCP连接，但这有两个缺点：\n它使TCP协议(如HTTP)变得更加复杂，以解决TCP的不足；如果您的应用程序本身只发出单个HTTP请求，它将使用自己的TCP连接，即使您的应用程序的数千个实例可能在同一台计算机上并行运行。\n很多TCP连接很快就会关闭，因为发送的第一位数据有问题-密码不正确，发送的请求消息有错误，或者接收服务器有问题，或者因为接收服务器正忙而重定向到另一台服务器作为响应。这通常会排除任何其他HTTP请求，这些请求可能会在不久的将来到达该服务器；它们要么从未尝试过，要么被重定向到另一台服务器。\nTCP将校验和放在数据包中，因此如果数据包在通过网络传输时损坏，则当数据包到达时，接收方的TCP堆栈可以拒绝该数据包，并将其重新传输。\n然而，校验和相当弱，而且在实践中，TCP无法检测到相当多的错误。TCP之上的应用程序通常假设任何错误都会被捕获和处理，并且会盲目地相信数据到达时没有受到干扰。很难说有多少数据以这种方式被破坏，但值得庆幸的是，TCP之上的加密层，如SSH和TLS，在识别不良数据方面相当出色，因此情况正在改善-但这并不归功于TCP！\n在广域组播中提供有序、可靠的传送是不切实际的。当许多人从YouTube流传输相同的实时视频流时，他们每个人都有自己的TCP连接到最近的节点，并且他们可以传输相同的数据。\n然而，支持可伸缩的广域多播是可行的：IP多播做到了，尽管在公共Internet上对它的支持很差。但是，因为TCP是有序的和可靠的，或者说是失败的，要想获得IP多播，你需要把婴儿和洗澡水一起扔掉，并使用一个完全不同的协议。\n顺便说一句，在这样的多播流环境中进行流量控制是很有趣的。您不能因为接收方或中间链接速度较慢而减慢数据包的发送速度，因此您可以使用丢弃优先级：在质量层中编码视频流，使用包含最低质量流的基本层，然后在下面的层之上添加包含额外数据以提高质量的层。然后，您可以用丢弃优先级标记组成流的不同数据包。当链路过载，或者最终目的地因忙碌而无法处理时，具有较高丢弃优先级的数据包将首先被丢弃-因此您将最低的丢弃优先级放在基本层，然后在不断增加的质量层上增加丢弃优先级。因此，如果您没有足够好的连接或足够快的处理器来处理4k高清数据流，那么网络将丢弃使其成为4k的比特，而仍然保留使其成为1080p流的比特。\n是的，我们可以!。各种网络协议以不同的方式改进了TCP。那些熟悉我的软件设计风格的人无疑不会对我的计划感到惊讶，因为我有一个计划，通过灵活的方式，将他们使用的技巧合并到一个可以满足各种需求的协议中……。让我们来看看我从各种协议中收集到的想法吧！\nRDP和RUDP都是基于消息的协议，处理丢失数据包的重传、有序传送和流量控制。但是由于是基于消息的，即使在相同的逻辑连接中，也可以为不同的消息请求不同类型的服务。\n混沌是一个长期失效的协议，但它有一些有趣的特性值得研究。我在之前的一篇博客文章中讨论过它，但它包括无需任何三次握手即可执行简单请求的能力、在建立连接时包含请求详细信息以便直接拒绝连接而无需等待握手完成的能力，以及在无连接和面向连接的通信之间的选择。\nTCP试图创建单个字节流的假象，而NetBLT则完全是为了移动数据块。这很有用，因为大多数时候，TCP应用程序尝试移动的是数据块，而不是字节流-无论是大块文件上传/下载，还是小请求。\n它不会尝试提供按顺序交付；当数据块到达接收方时，它们会被直接提供给接收应用程序。如果应用程序想要将它们组装到内存的缓冲区中，直到它们都在那里为止，它可以自由地这样做，但是如果它想要在每个片段到达时对它们做一些事情-比如将块写入文件，或者显示图像的某些部分，或者处理随机访问的数据文件的某些部分-无论它们到达的顺序如何，从而释放内存并提供更快的响应，它都可以做到。\n但NetBLT还有一个比TCP更智能的流量控制系统。它不是摆弄滑动窗口大小(亲爱的读者，我为您节省了TCP流量控制的一个可怕细节)，而是选择发送数据包的速率，\n..", "note_en": "The go-to transport-layer protocol for people to build Internet applications on these days, with the exception of real-time streaming media or a few specialist apps, is  TCP.\n The problem is, TCP isn&#39;t really all that great for the things we&#39;re using it for.\n I won&#39;t go into any more detail on how it works than is necessary to make my point, but let&#39;s take a look at how TCP is used by an application.\n Somewhere, a program wants to provide a service via TCP, so it tells the network stack it would like to listen on a chosen TCP port (eg, port 80 or 443 for a Web server).\n Once that has happened, a client somewhere can attempt to connect to it, by specifying the address of the computer running the server and the port number. There is a short delay while the &#34;three-way handshake&#34; occurs - the client sends a request to the server (called SYN), the server responds with an offer (called SYN/ACK) and the client replies to accept that offer (called ACK). The time taken for the connection to be usable by the client is the time taken for the SYN to get to the server and the SYN/ACK to return, known as the round-trip time of the connection.\n After this, the network stack on the server notifies the server program that there&#39;s a new connection, and the network stack on the client notifies the client program that the connection is ready - if all goes well.\n But if the connection is up, then both ends can send each other a stream of bytes. TCP takes the underlying network - which is packet-based, meaning that small chunks of data are sent as &#34;messages&#34; - and creates the illusion of something like a serial cable, or a UNIX pipe between processes: just a stream of bytes. Behind the scenes it handles detecting lost packets and re-transmitting them, ensuring that packets that arrive out-of-order are passed on in the correct order rather than randomly rearranging parts of the byte stream, and &#34;flow control&#34;: detecting when the traffic being sent is overwhelming some bottleneck in the network between client and server and ramping down the rate at which it&#39;s sent to not waste resources.\n  It performs flow control by detecting congestion in the only way really possible across the Internet: looking at the rate at which the packets it sends actually arrive at the recipient. Some packets get lost due to equipment faults or noise on communications links, which is a sort of background &#34;fatality rate&#34; of packets in-flight, regardless of how much data is being sent. But when a router somewhere in the network is receiving packets faster than it can send them down some link, they queue up, and if the queue gets too full, it starts dropping packets rather than keeping them in memory for too long. So the rate of packet loss on a link will stay at the background &#34;fatality rate&#34; as the rate at which data is being sent rises, until we hit the capacity of the weakest link in the system, at which point the packet loss rate will rise - after a short delay as the queues fill up to the point where they start dropping things.\n TCP uses a relatively simple trick: when a packet it sent is lost (which it knows about, because the other end fails to acknowledge receiving it), it decreases the sending rate a bit. But when traffic is getting through without a problem, it increases the sending rate a bit. This means that as long as the basic rate of background packet loss isn&#39;t too high, it will slowly increase the rate of sending until it overwhelms the slowest link, then after it&#39;s noticed (which takes a while for the queue to overload, and something be dropped, and the loss be noticed by the receiver and this fact communicated back to the sender), it will decrease the sending rate - so that the rate of sending will hover around the maximum, pushing it slightly until it gets some packet loss then moving back again. (There&#39;s also a technique called  Random Early Detection (RED) to try to signal link overloads before they become critical and improve the reaction time, and a mechanism called  Explicit Congestion Notification (ECN) that also helps, but ECN isn&#39;t widely used at the time of writing).\n If you watch a bandwidth consumption graph when doing a large file transfer, you can sometimes see small ripples in the graph as this happens.\n  Firstly, when a new transfer starts, the TCP stack has no idea how much bandwidth will be available; it has to take a guess and then rapidly adjust up or down to the actual bandwidth. In practice, it starts low and then rapidly increases, a process known as  Slow Start. However, because it&#39;s ramping the rate up quickly to find the point where loss kicks in, any background loss will confuse it and cause the connection to start slow, then only slowly crank up the speed; and for short-lived connections (or connections with short bursts of traffic) it might never find the top speed before it finishes.\n Secondly, this process happens independently for every TCP connection. If you have two connections from one computer to another, both will be increasing and decreasing their sending rate independently - either of them can saturate the bottleneck link, but the packet loss caused by this might be felt by both connections. This means that if one connection is sending too fast, it might be the  other one that gets throttled back because it lost a packet. This can happen when multiple connections from and to different computers happen to come together at a single bottleneck in the network, too; and in the common case where a link is overloaded and all connections through it suffer some packet loss, and they all scale back at once, they collectively over-react because they can&#39;t coordinate with each other - leaving the link under-utilised.\n  TCP ensures that it delivers the bytes it&#39;s send in order by marking each packet full of bytes with its position in the stream. If the recipient receives bytes 0-100, then bytes 201-300, then bytes 101-200, it will deliver bytes 0-100 directly to the application; sit on bytes 201-300 as they are not the next bytes; deliver bytes 101-200 as soon as they arrive, followed by the saved bytes 201-300. So the application receives every byte in order.\n  Downloading stuff into a file. If the application doing the download was just told &#34;Here&#39;s bytes 201-300&#34;, it could save them at position 201 onwards in the file, then save bytes 101-200 at position 101 onwards in the file, as soon as they appeared. Buffering them in the TCP stack doesn&#39;t really help anybody, except perhaps taking the burden of avoiding disk seeks off of the disk I/O scheduler a little...\n Sending discrete requests/responses/messages. Often, an application has a message to send. Since TCP just transmits a stream of bytes, the application needs to mark the start and end of each message. TCP will do the job of splitting the message into chunks small enough to fit in a packet, sending them, and putting them back together in order, which is great  within the message; but if the application sends two messages, and part of the first message is delayed (either taking a long route through the network, or it didn&#39;t arrive and has to be re-sent), then the entire second message sits there inside the TCP stack, not provided to the application.\n Sometimes the application is glad of this - if it&#39;s important the messages are processed in order, sure, it needs to wait. But often it isn&#39;t important, and it would in fact be more useful if messages could be processed as soon as they arrive in whatever order they arrive. Because TCP doesn&#39;t  know about how the application is breaking the TCP byte stream into messages, it can&#39;t know that there&#39;s a complete message it  could pass on - all it knows about are bytes.\n  As mentioned in the previous point, most TCP applications introduce their own structure for messages on top of TCP, because a raw stream of bytes is too low-level for most applications&#39; communications needs (almost no TCP connections are nothing more than a raw stream of bytes; telnet is almost that, but has message-based control signals embedded - perhaps an FTP data stream?). The thing is, this pushes a bunch of complexity into the app that must be re-invented every time as standardisation in this area has been poor.\n A lot of TCP apps go for a simple request/response model. The end that makes the connection is assumed to want some service from the end that sat there waiting for a connection, so once a connection is made, the service provider sits there waiting for requests. The client will send a request in some form, with some way of marking the end of the request (either sending the length first so the other end knows how many bytes to read, or having a special marker for the end - with attendant complexities if it needs to send that marker as part of the request for some reason). It will then sit waiting to read data back, as the data returned is the response to the last request sent (again, with some detail as to how to know when the response has actually ended).\n This is simple to implement - the code in the client looks like &#34;Send request; Read response; process response&#34;, and the code in the server looks like &#34;while(connection not closed): read request; process request; send response&#34;.\n But it becomes a problem when you want to scale up the performance of your application. If your application starts a long-running request, then other requests can&#39;t happen in the meantime - you can send them, if you wish, but even if the server is watching for additional requests arriving while it&#39;s processing a request (which is additional complexity in the server to implement) it can only send the responses back in the order they were sent. So some protocols add a &#34;request ID&#34; to requests, and responses can arrive in any order because they contain the ID of the request they&#39;re responding to. Now the client and server applications can send requests at will and send responses back as soon as they&#39;re ready, at the cost of needing to implement their own multithreaded routing logic, with locking around access to the TCP connection to ensure that parts of requests or responses don&#39;t get inserted into each other due to trying to send two at the same time. However, it&#39;s still not perfect - if the client requests a large file, several gigabytes in size, and that&#39;s sent as a single response (after all, it is the response to a single request, and the client might not have known how big the file would be in advance), then the TCP connection from server to client is taken up sending that large response for some time, and other, quick, responses can&#39;t be sent until that one has finished.\n To fix that, the protocol needs to be made more complicated - requests and responses can now be split into smaller &#34;chunks&#34;, and chunks from multiple requests or responses interleaved along the TCP connection, to be reassembled at the other end.\n And also, sometimes the &#34;client initiates things, server sits waiting&#34; model isn&#39;t enough. A client application might request some information, and want the server to update it immediately if that information changes. If only the client can initiate things, then it must keep asking the server if there&#39;s been any updates to get a response. Ideally, both ends should be able to send a message, or a request expecting a response, to the other end. Under the original simple request/response model that can&#39;t be done - but if we&#39;ve already gone to the effort of implementing concurrent requests and responses with chunking, it&#39;s a drop in the ocean to make the connection symmetrical...\n There have been a few attempts to standardise a useful protocol on top of TCP. In practice, people use HTTP and Websockets: HTTP as a framing protocol to denote the starts and ends of messages, with multiplexing of concurrent requests and chunking, and Websockets as a way to set up &#34;reverse&#34; connections so that servers can send messages to clients at will. It&#39;s a pretty complicated stack to implement, and fairly wasteful in terms of data sent on the wire because of the various workarounds and compatability hacks required to adapt what was initially designed as a &#34;Hyper-Text Transport Protocol&#34; to this task.\n BEEP is an attempt to start from scratch; the goals look pretty good (although it was worked on back when XML was cool, so has a nasty XML flavour to it), but it&#39;s not taken off; I&#39;ve never encountered an implementation and the  project web site hasn&#39;t been updated  since 2016 at the time of writing.\n  Relatedly, often applications that send messages down a connection have various kinds of messages with different requirements. Imagine an online game - if the player presses a sequence of buttons in the game, then those button presses must arrive at the server, and in the correct order. But at the same time, the server might be streaming back messages with the latest position of all the other players; if one of those goes missing, stopping the entire stream to wait for it to be retransmitted, when the stream is filling up with messages that contain more recent player positions and so make the missing message entirely obsolete, is wasteful. But, again, as TCP doesn&#39;t know about the application&#39;s message boundaries, it can&#39;t handle different messages differently.\n  If part of the three-way handshake used to open a TCP connection gets lost in the network, the client finds out because it doesn&#39;t get the SYN/ACK back in a reasonable timeframe and tries again. It will keep trying for a while before giving up. Either way, if the network is down or unreliable, there can be several seconds&#39; delay before the network stack reports back to the client program that it has a working connection, or that it can&#39;t get one.\n And the three-way handshake (and the FIN packets used to close a connection) can be a waste of time. If the entire thing to be sent down the TCP connection could have just fit in a single packet, we end up doing this:\n  Six packets sent, to send a single packet of data! We could have just done this:\n SERVER -&gt; CLIENT: ACK (so the client knows it arrived and doesn&#39;t have to resend it)\n On top of that, those short connections will get NO flow control; TCP&#39;s per-connection flow control won&#39;t even get off the ground.\n Because of this small-connection penalty, there has been much work in HTTP to make it re-use a single TCP connection for multiple logical HTTP requests, but this has two downsides:\n It pushes more complexity into protocols on top of TCP, such as HTTP, to work around TCP&#39;s deficiencies; and if your application only makes a single HTTP request itself it will use its own TCP connection, even though thousands of instances of your application might be running in parallel on the same computer.\n A lot of TCP connections are closed very quickly because there&#39;s something wrong with the first bit of data sent - an incorrect password, some error with the request message that was sent, or because the receiving server has a problem or is responding with a redirect to another server because it&#39;s busy. This usually precludes any other HTTP requests that might have been going that server&#39;s way in the near future; they&#39;re either never tried, or redirected to another server.\n  TCP puts a checksum in packets, so if the packet is damaged in transit across the network, when it arrives, the TCP stack on the recipient can reject it and it will be re-transmitted.\n However, the checksum is pretty weak, and in practice, quite a lot of errors are not detected by TCP. Applications on top of TCP often assume that any errors will have been caught and handled with, and will blindly trust data to have arrived unmolested. It&#39;s hard to say how much data has been damaged in this way, but thankfully cryptographic layers on top of TCP such as SSH and TLS are pretty good at identifying bad data, so the situation is improving - but no thanks to TCP!\n  It&#39;s not practical to provide ordered, reliable, delivery in a wide-area multicast. When lots of people are streaming the same live video stream from Youtube, they each get their own TCP connection to the nearest node, and they call carry the same data.\n However, it is practical to support scaleable wide-area multicast:  IP multicast does it, although support for it across the public Internet is sadly poor. But because TCP is &#34;ordered and reliable or bust&#34;, to get IP multicast, you need to throw the baby out with the bathwater and use an entirely different protocol.\n As an aside, flow control in such a multicast streaming environment is interesting. You can&#39;t slow down the sending of packets due to slow recipients or intermediate links, so instead you use a &#34;drop priority&#34;: encode your video stream in quality layers, with a base layer containing a minimal-quality stream, then additional layers that contain extra data to increase the quality on top of the layers beneath. You can then mark the different packets that make up the streams with a &#34;drop priority&#34;. When a link is overloaded, or the final destination can&#39;t cope because it&#39;s busy, packets with a higher drop priority are discarded first - so you put the lowest drop priority on the base layer, then increasing drop priority on the increasing quality layers. So if you don&#39;t have a good enough connection, or a fast enough processor, to handle the 4k HD stream, then the network discards the bits of it that make it 4k while still keeping the bits that enable it to be a 1080p stream...\n  Yes, we can! Various network protocols improve on TCP in different ways. Those who are familiar with my style of designing software will no doubt not be surprised that I have a plan to merge the tricks they use into one protocol that can meet a wide variety of needs, by being flexible... Let&#39;s take a tour of ideas I&#39;ve gleaned from various protocols!\n  RDP and  RUDP are both message-based protocols, that handle retransmission of lost packets, ordered delivery and flow control. But being message-based, it is possible to request different types of service for different messages even in the same logical connection.\n  CHAOS is a long-defunct protocol, but it has some interesting features that are worth examining. I&#39;ve discussed it in  an earlier blog post, but it includes the ability to do simple requests without any three-way handshakes, the ability to include request details when setting up a connection so that it can be rejected outright rather than needing to wait for the handshake to complete, and the choice between connectionless and connection-oriented communications under one umbrella.\n  While TCP tries to create the illusion of a single stream of bytes, NetBLT is all about moving a block of data. This is useful, because most of the time, TCP applications  are trying to move a block of data rather than a stream of bytes - be it a chunky file upload/download, or a small request.\n It does not attempt to provide in-order delivery; as chunks of the data arrive at the recipient, they are given straight to the receiving application. If the application wants to assemble them in a buffer in memory until it&#39;s all there, it is free to do so, but if it wants to do something with each piece as it arrives - such as writing chunks to a file, or displaying parts of an image, or processing parts of a random-access data file - in whatever order they arrive, thereby freeing up memory and offering faster responses, it can.\n But NetBLT also has a smarter flow control system than TCP. Rather than fiddling around with  sliding window sizes (an awful detail of TCP&#39;s flow control I have saved you, dear reader, from), it picks a rate to send packets at, sends p\n......", "posttime": "2020-05-06 03:54:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "tcp,连接", "title": "TCP Sucks", "title_en": "TCP Sucks", "transed": 1, "url": "http://www.snell-pym.org.uk/archives/2020/05/05/tcp-sucks/", "via": "", "real_tags": ["tcp", "连接"]}]