[{"category": "", "categoryclass": "", "imagename": "e00dc1f6dc4097af52829fa655b74885.jpg", "infoid": 1001144, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "冠状病毒在娱乐业造成了严重破坏，电影和电视节目的制作被关闭，大片上映被推迟-色情作品也不例外。\n当成人电影表演者和观众都发现自己被困在室内时，制片厂正在关闭，而像OnlyFans和ManyVids这样的自制色情网站已经占据了中心舞台。这可能是致命的传统色情制片厂，它们在大流行之前就已经在苦苦挣扎了。\n3月15日，代表美国和加拿大成人娱乐业的行业协会自由言论联盟(Free Speech Coalition)呼吁关闭所有成人娱乐产品。生产暂停原定于3月31日解除，但在最初宣布8天后，该组织无限期延长了停产。该组织在一份最新报告中写道：“在病毒传播得到控制，州和地方政府允许恢复不必要的业务之前，我们不会解除这一限制。”\n成人制作公司Helix Studios的创始人兼所有者基思·米勒(Keith Miller)表示，他的公司已经停产近一个月了。米勒解释说：“我们有一堆积压的内容，我们正在努力扩展，直到我们可以再次制作。”他补充说，Helix Studios正在努力工作，为重新开始制作时计划新的电影。\n英国成人电影业也面临着类似的关闭，制片厂遵守政府制定的社交疏远指导方针。3月14日，为巴西等国制作内容的英国赫西制作公司(Hussey Productions)宣布，将在两周内停止所有生产，取消拍摄可能会持续到这段时间之后。自那以后，该制片厂再也没有在其Instagram账户上发布过任何内容。贾斯汀·桑托斯(Justin Santos)是英国乔伊熊制片公司的创始人和所有者，他说他的制片厂是英国首批关闭制作的成人电影公司之一。桑托斯说，这是一个艰难的决定，他决定在3月初做出。“我经营这家公司已经17年了，我们从来没有取消过拍摄，”他说。“我们在4月份有一次拍摄，我们不得不取消，随后我们取消了6月份的拍摄，我们正在等待8月份的拍摄能否继续进行。”\n与好莱坞制作公司一样，乔伊熊影业也不得不改变其上映时间表和新电影的上映时间。桑托斯解释说：“如果我们不能长时间投入制作，我们希望确保不会有太大的差距。”他补充说，虽然乔伊熊影业的企业对企业的销售略有放缓，世界各地的电视广播公司在购买内容方面略显试探性，但其电影对发行商和网站的销售一直很强劲。“我们希望确保在很长一段时间内我们不能投入生产，”桑托斯解释说。他补充说，虽然乔伊熊影业在企业对企业方面的销售略有放缓，但其电影对发行商和网站的销售一直很强劲。\n随着越来越多的人困在室内，免费的成人视频分享网站PornHub的流量也出现了激增。该公司透露，该网站在英国的流量从3月24日开始攀升，就在首相鲍里斯·约翰逊(Boris Johnson)宣布英国封锁并随后关闭所有酒吧、俱乐部、健身房和餐厅的第二天。PornHub的最新数据显示，与同期相比，4月10日该网站的访问量增长了22.4%。与大流行前的平均一天相比，每天上传到该网站的数量增加了30%。冠状病毒加速了该行业的长期趋势-像OnlyFans和ManyVids这样的高端剪辑网站的崛起。伯明翰城市大学(Birmingham City University)媒体与文化理论教授奥利弗·卡特(Oliver Carter)表示，自从引入网络摄像机、宽带互联网连接以及最近的智能手机以来，我们想象中的成人电影业及其布景、制片人、导演和摄影师的样子从未像现在这样。\n“对我来说，最有趣的是看到制作手段从以白人为主的中年男性，变成由表演者自己拥有，”研究成人电影产业经济学的卡特解释说，“我最感兴趣的是看到制作手段从以白人为主的中年男性变成了表演者自己”，卡特曾研究成人电影产业的经济学。他说：“那些将获得一次性报酬的人现在是那些真正拥有自己作品的知识产权的人，因为他们在重新拍摄。”他补充说，在制片厂，表演者通常不会因为他们的贡献而获得任何持久的报酬。\n2015年，“经济学人”报道，美国色情电影制片厂的数量已经从200多家减少到只有20家。拥有许多免费成人视频网站如PornHub和YouPorn的科技公司MindGeek，现在也拥有包括布拉泽和花花公子在内的主要成人电影制片厂的很大一部分股份。“这些工作室，那些没有被MindGeek收购的工作室，往往已经消亡或变得相当小众，”卡特说。表演者现在通过平台(如OnlyFans和ManyVids)分发(他们自己的内容)，并从中赚取可观的收入。\n高端剪辑网站，其中最著名的是OnlyFans，允许人们向订阅者收费出售往往下流的视频和自己的照片。多亏了冠状病毒，他们才有了自己的时刻。OnlyFans的一位发言人表示，在2月和3月的几个月里，该网站已经欢迎了超过14万名内容创作者加入OnlyFans。这位发言人表示：“这是2019年同期创作者签约人数的五倍多。”\n表演者80%的收入来自OnlyFans，公司收取剩余的20%。英国成人制片人协会(UK Adult Producers Association)前主席特里·斯蒂芬斯(Terry Stephens)表示，由于利益冲突，制作公司一直非常积极地要求表演者将内容上传到OnlyFans。他说：“一些公司说，他们想从(表演者)得到的东西中分得一杯羹。”制片人说，“如果不是因为我们，你不会赚那么多钱。”\nManyVids是一家视频托管和直播成人网站，该网站表示，3月份上传的视频增加了51%，注册表演者的数量增加了69%。注册观看内容的会员也大幅增加了80%。该公司表示，自3月1日以来，该网站摄像头端的直播节目小费大幅增加，现场表演的用户数量增加了42%。\n杰弗里·塞伦(Geoffrey Celen)经营着互联网成人电影数据库和成人娱乐评论网站The Porn Dude，他说他看到人们对他的网站评论的兴趣发生了转变。他解释说：“自从全球开始实施隔离和居家订单以来，有大量访问者涌入查看我对直播摄像头网站的评论。”“事实上，到目前为止，我的网站唯一受到负面影响的部分就是陪护和交友网站。”\n行业出版物XBIZ的新闻编辑、成人行业记者古斯塔沃·特纳(Gustavo Turner)表示：“那些在‘溢价’上表现良好的表演者现在做得更好了。”“我不会说有太多的表演者在‘转行’，就像‘从现在开始’一样，但他们肯定已经把全职注意力转向了自制内容。”\n成年表演者米歇尔·索恩(Michelle Thorne)在英国成人电影业工作了20年，她同意自己现在做的工作室工作比前几年要少得多。她说，现在她在OnlyFans上的收入比平时多了大约1000到2000 GB，自封锁以来已经获得了100到200个新订户，使她的订户超过了1000个。索恩指出，他们中超过一半的人每月支付12.50 GB的费用。“我不想说太多，”她说，“但这已经足够让我感到舒服了。”\n索恩说，她几乎已经成为粉丝的性治疗师，正在帮助他们度过危机。她早上5点起床与粉丝互动，提供从电话、语音信息到定制视频、自拍，甚至是一个非成人博客的一切。有些人给我发了信息，说我应该成为一名关键员工，“索恩笑着说。“这不仅仅是你的长相。这是你个人的问题，也是你的个性问题。“\n脱颖而出可能很困难。特纳说：“任何尝试过拍摄和制作夹子的人都会告诉你，这实际上不是一件容易的工作。”“在拥挤的人们争相吸引注意力的情况下，被关注并取得成功就更难了。”\n在冠状病毒来袭之前，优质剪辑网站已经在崛起，与PornHub一起，正在共同改变成人色情行业的面貌。现在，随着每个人都呆在家里，摄像头网站和剪辑网站只会变得更加占主导地位。就像斯蒂芬斯说的，“现在每个人都是色情明星。”\n收到来自《连线》的电子邮件，这是您关于技术、商业和科学领域所有重大新闻的严肃简报。在你的收件箱里，每个工作日的中午12点整。\n谢谢。您已经成功订阅了我们的时事通讯。你很快就会收到我们的回音。", "note_en": "Coronavirus has created havoc in the entertainment industry, with production on films and TV shows shut down, and big releases delayed – and pornography is no exception.\n As adult film performers and viewers alike find themselves stuck indoors, studios are shutting down, and homebrewed pornography sites like OnlyFans and ManyVids have taken centre stage. It could be fatal traditional porn studios, which were already struggling before the pandemic.\n  On March 15, the Free Speech Coalition, the trade association that represents the adult entertainment industry in the United States and Canada, called for a shutdown of all adult entertainment productions. The production hold was due to be lifted on March 31, but eight days after the initial announcement, the organisation  extended the shutdown indefinitely. “We will not lift this hold until the spread of the virus is under control and state and local governments allow the resumption of non-essential business,” the organisation wrote in an update.\n Keith Miller, founder and owner of adult production company Helix Studios says that his company has shuttered production for nearly a month now. “We have a backlog of content that we are trying to stretch until we can produce again,” Miller explains, and adds that Helix Studios is working hard, planning new films for when production restarts.\n  The UK adult film industry has faced similar closures, with studios abiding by social distancing guidelines outlined by the government. On March 14, UK-based Hussey Productions, which produces content for Brazzers, amongst others,  announced that it was stopping all production for two weeks, with the cancellation of shoots likely continuing beyond that period. The studio has not posted any content to its Instagram account since that date.   Justin Santos, founder and owner of UK-based studio Joybear Productions says that his studio was one of the first adult film companies in the UK to close down production. It was a difficult decision, Santos says, that he decided to make at the beginning of March. “I&#39;ve been running the company for 17 years, and we&#39;ve never cancelled a shoot,” he says. “We had a shoot in April which we had to cancel, we’ve subsequently cancelled the June shoot and we’re waiting to see if the August shoot can go ahead.”\n As with Hollywood production companies, Joybear Pictures has had to alter its release schedule and the release of new films. “We want to make sure that there isn’t a big gap if it turns out that we cannot go into production for a prolonged period of time,” explains Santos, adding that while sales on the business-to-business side of Joybear Pictures has slowed slightly, with TV broadcasters around the world being a bit more tentative in purchasing content, sales of its films to distributors and websites have been strong.\n  With more people stuck indoors, the free adult video sharing website Pornhub has also seen its traffic spike. The company  revealed that traffic to the site in the UK had begun climbing on March 24, the day after prime minister Boris Johnson announced the UK lockdown and the subsequent closure of all pubs, clubs, gyms and restaurants. The latest Pornhub figures show that traffic to the site was up 22.4 per cent on April 10 compared to a regular day at a similar period. Daily uploads to the site have  increased by 30 per cent compared to an average day before the pandemic.    The coronavirus has accelerated a long-term trend in the industry – the rise of premium clip sites like OnlyFans and ManyVids. Oliver Carter, a professor of media and cultural theory at Birmingham City University, says that what we imagine the adult film industry to look like, with its sets, producers, directors and cameramen, hasn’t looked like that since the introduction of webcams, broadband internet connections and, more recently, smartphones.\n “What’s been most interesting to me is seeing the means of production change from being owned by predominantly white, middle-aged men to being owned by the performers themselves,” explains Carter, who has researched the economics of the adult film industry. “The ones who would receive that one-off payment are now the ones who actually own the intellectual copyright for their own productions because they&#39;re shooting it,” he says, adding that with studios, performers typically don’t receive any lasting payments for their contribution.\n In 2015,  The Economist reported that the number of porn studios in America had  shrunk from over 200 to just 20. Technology company MindGeek, which owns a number of free adult video sites like Pornhub and YouPorn, now also owns a large portion of the major adult film studios, including Brazzers and Playboy. “These studios, the ones that haven&#39;t been bought by MindGeek, tend to have died off or become quite niche,” says Carter. Performers are now distributing [their own content] via platforms [like OnlyFans and ManyVids] and are making a considerable living out of it.”\n  Premium clip sites, the most well-known of which is OnlyFans, let people sell often raunchy videos and photos of themselves to subscribers for a fee. They’ve been having their moment thanks to coronavirus. An OnlyFans spokesperson says that the site has welcomed over 140,000 content creators to OnlyFans during the months of February and March. “This is more than five times the amount of creator sign-ups than during the same period in 2019,” the spokesperson says.\n  Performers take 80 per cent of their earnings through OnlyFans, with the company taking the remaining 20 per cent. Terry Stephens, former chair of the UK Adult Producers Association, says that production companies have been quite aggressive about performers uploading content to OnlyFans because of the conflict of interest. “Some of the companies are saying that they want a percentage of what [the performers] are getting,” he says, with the producers saying that “if it wasn’t for us, you wouldn’t be making that kind of money.”\n ManyVids, a video hosting and livestreaming adult website, says site saw video uploads increase by 51 per cent in the month of March, while the number of performers signing up increased by 69 per cent. Members, those signing up to view content, also increased by a sizeable amount – 80 per cent. The company says that tips have increased significantly for live shows on the webcam side of the site since March 1, and the number of users performing live is up by 42 per cent.\n Geoffrey Celen, who runs the Internet Adult Film Database and adult entertainment review site The Porn Dude says that he has seen a shift in interest to his site’s reviews. “There’s been a massive influx of visitors checking out my reviews of live cam sites since the quarantines and stay-at-home orders began worldwide,” he explains. “In fact, the only sections of my site negatively affected so far are the escort and dating sites.”\n “The performers who were already doing well at ‘premiums’ are now doing even better,” says adult industry journalist Gustavo Turner, news editor at trade publication XBIZ. “I wouldn’t say that too many performers are ‘switching over,’ as in ‘starting now,’ but they have definitely switched their full-time attention to self-produced content.”\n  Adult performer Michelle Thorne, who has been in the British adult film industry for two decades, agrees that she is doing far less studio work than in previous years. She says that she has been making around £1,000 to £2,000 more on OnlyFans now than she normally would, and has gained 100 to 200 new subscribers since the lockdown, taking her to over a thousand subscribers. Thorne notes that over half of them are paying £12.50 a month. “I don’t want to say too much,” she says, “But it’s doing more than enough to keep me comfortable.”\n Thorne says she has almost become a sex therapist for her fans and is helping them get through the crisis. She wakes up at 5am to interact with her fans and provides everything from phone calls and voice messages to custom videos, selfies and even a non-adult blog. Some people have messaged me and have said that I should be a key worker,” Thorne says, laughing. “It&#39;s not just what you look like. It&#39;s you as a person and your personality as well.”\n Standing out can be difficult. “Anyone who has tried camming and making clips can tell you that it is actually not an easy job,” says Turner. “Being noticed and succeeding at it is even harder in a crowded grid of people vying for attention,”\n Before coronavirus hit, premium clip sites had already been on the rise and, along with Pornhub, were jointly changing the landscape of the adult porn industry. Now, with everyone staying at home, cam sites and clip sites are only going to become more dominant. As Stephens says, “Everyone’s a pornstar now.”\n           Get The Email from WIRED, your no-nonsense briefing on all the biggest stories in technology, business and science. In your inbox every weekday at 12pm sharp.\n  Thank You. You have successfully subscribed to our newsletter. You will hear from us shortly.", "posttime": "2020-05-08 02:56:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,news,网站", "title": "冠状病毒对大人物来说是坏消息，但对粉丝来说是好消息", "title_en": "Coronavirus is bad news for Big Porn but great news for OnlyFans", "transed": 1, "url": "https://www.wired.co.uk/article/coronavirus-porn-industry-onlyfans", "via": "", "real_tags": ["病毒", "冠状病毒", "news", "网站"]}, {"category": "", "categoryclass": "", "imagename": "2d7ef791a1a6f1f37367979c42d5f36e.jpg", "infoid": 1001143, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌为其多功能物体识别工具Google Lens增加了一项非常有用的功能。现在，您可以使用Lens将手写笔记从手机复制并粘贴到计算机上，不过只有在手写足够整洁的情况下才能使用。\n为了使用这一新功能，你需要安装最新版本的Google Chrome，以及Android上的独立Google Lens应用程序或iOS上的Google应用程序(可以通过搜索栏旁边的按钮访问Lens)。您还需要在两台设备上登录到相同的Google帐户。\n完成后，只需将相机对准任何手写文本，在屏幕上突出显示，然后选择复制。然后，您可以转到Google Docs中的任何文档，点击编辑，然后粘贴以粘贴文本。瞧，或者，中提琴，取决于你的笔迹。\n在我们的测试中，这个特性不是很成功就是失败了。如果你写得不整齐，肯定会有一些打字错误。但这仍然是一个很酷的功能，在很多人现在都在家工作的时候，它仍然特别有用，依靠没完没了的待办事项清单来给他们的一天带来一些秩序感。\n除了新的复制粘贴功能外，谷歌还推出了一款发音工具。只需在Lens中突出显示一个单词，然后点击“Listen”即可听到该单词的发音。(Android现在可以使用这一功能，很快就会在iOS上使用。)。你现在还可以用Lens查找概念，搜索像“引力波”这样的短语来获得内嵌的谷歌搜索结果。如果你在做功课或者帮你的孩子做作业，这可能会非常方便。\n这些都是谷歌镜头值得欢迎的补充，谷歌镜头总是承诺的比实际实现的要多。拥有一个视觉搜索工具，可以识别你放在手机前的任何东西，是Lens的梦想，但它从来都不够快或足够可靠，无法使其成为现实。这些最新的更新肯定会推动它朝着正确的方向发展。", "note_en": "Google has added a very useful feature to Google Lens, its multipurpose object recognition tool. You can now  copy and paste handwritten notes from your phone to your computer with Lens, though it only works if your handwriting is neat enough.\n In order to use the new feature, you need to have the latest version of Google Chrome as well as the standalone Google Lens app  on Android or the Google app  on iOS (where Lens can be accessed through a button next to the search bar). You’ll also need to be logged in to the same Google account on both devices.\n That done, simply point your camera at any handwritten text, highlight it on-screen, and select copy. You can then go to any document in Google Docs, hit Edit, and then Paste to paste the text. And voila — or, viola, depending on your handwriting.\n   In our tests, the feature was pretty hit or miss. If you don’t write neatly, you’ll definitely get some typos. But it’s still a cool feature that’s especially useful at a time when a lot of people are now working from home  and relying on endless to-do lists to bring some sense of order to their day.\n In addition to the new copy-and-paste feature, Google is also rolling out a pronunciation tool. Just highlight a word in Lens, and tap “Listen” to hear how it’s pronounced. (This is available in Android now and coming to iOS soon.) You can also now look up concepts with Lens, searching for phrases like “gravitational waves” to get in-line Google search results. That’s potentially very handy if you’re doing schoolwork or helping your children with theirs.\n These are welcome additions to Google Lens, which has always promised more than it really delivered. Having a visual search tool that can identify anything you stick in front of your phone is the  dream of Lens, but it’s never quite been fast or reliable enough to make it a reality. These latest updates certainly push it in the right direction.", "posttime": "2020-05-08 02:29:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,lens", "title": "Google Lens现在可以将手写笔记复制并粘贴到您的计算机上", "title_en": "Google Lens Can Now Copy and Paste Handwritten Notes To Your Computer", "transed": 1, "url": "https://www.theverge.com/2020/5/7/21250556/google-lens-copy-paste-handwritten-notes-computer-phone-ios-android", "via": "", "real_tags": ["google", "lens"]}, {"category": "", "categoryclass": "", "imagename": "5553ec8757f36ceba1352e115c8fc3c7.png", "infoid": 1001142, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这篇文章中，我想分享我对SaaS公司如何在拥有坚实的云基础设施安全和过度使用激怒自己的工程师之间进行权衡的观察。\n保安很烦人。如果安全措施不妨碍事情的完成，生活可能会容易得多。如果您是一名正在处理紧急停机的站点可靠性工程师，从陷入困境的数据库管理员那里收到一条“拒绝访问”消息就像医生被他们试图救活的病人一拳打在脸上一样令人恼火！！\n在这篇博客文章中，我们将回顾常见的反模式，建议替代方案，并提供有关如何更好地实现我们推荐的更好实践的较低级别技术资料的参考。\n我们想要立即向房间里的大象发表讲话，并说以牺牲其他一切为代价的“最大”安全并不总是一件好事。每个人都在寻找“摇滚明星黑客”，并试图吸引最优秀的工程师加入他们的团队，但猜猜如果你强迫他们以一种不自然的方式工作，“黑客”会怎么做？\n意图不一定是恶意的。比方说，您有一个专有的SSH连接“堡垒主机”，您强制每个人都通过。堡垒解决方案与ProxyJump设置不兼容，阻止人们直接从他们的计算机运行Ansible脚本或建立交互会话。我看到过另一种形式，堡垒只接受来自VPN的连接，这有点违背了被称为“堡垒”的目的，不是吗？\n通过使SSH访问变得如此复杂，您最终可能会遇到另一个由开发人员在其他地方建立的“秘密”堡垒，原因很简单，因为他们试图提高工作效率。\n或者您可能会注意到，堡垒主机现在正在运行其他服务，如Jenkins，甚至Wordpress，因为工程师发现总是手动“跳转”很麻烦。恭喜您，现在您在这些应用程序中很容易受到潜在的利用漏洞攻击。\n一般来说，复杂性是良好安全性的敌人。复杂的系统不仅很难使用，而且也很难推理。它们提高了您的团队对高素质安全人才的需求。许多安全漏洞可以追溯到人为错误，人类在面对复杂性时往往会犯更多错误。\n如果您使基础设施访问太复杂或太不方便，您最终会处于不太安全的状态。\n另一方面，一些公司犯了与之相反的错误。他们可以轻松地将admin.pem放入Github上的私有存储库，由许多SRE共享。其他人则简单地要求每个人在供应期间将他们的SSH密钥分发到服务器，遗憾的是，这也很常见。\n许多工程师向我承认，他们仍然可以接触到他们以前雇主的生产环境。在我担任一家主要云提供商的产品总监时，我在与客户互动时听过很多次这样的话。\n很明显，如果您以方便为首要目标进行优化，那么您最终也会处于易受攻击的状态。\n没有一种单一的、绝对正确的方法来实现基础设施安全，但我们希望提供一些您可能会发现对您的团队有帮助和适用的选项。\n尽早投资于基于身份的访问是值得的。“身份”这个词已经被糟糕的行业营销劫持并吹到了面目全非的地步。但核心理念在原则上和实施上都很简单。\n不是根据“什么”(秘密)授予访问权限，而是根据“谁”(身份)授予访问权限。\n机密可能会丢失或被盗。即使是第二个因素也不是灵丹妙药，因为它只能将一个秘密一分为二。\n基于身份的访问也更加方便，因为如果您是John Doe，并且您是DevOps工程师，这在工作时间内是不会改变的。你不应该为不断向各种系统提供秘密而烦恼。\n要使用SSH作为示例，请考虑只将生产环境的SSH访问权限授予“SRE”组的成员，而不是拥有admin.pem密钥的任何人。还有一个好办法，就是确保在有限的时间内授予访问权限。\n这消除了对SSH密钥的需要，同时使每个人的生活变得更容易。但最重要的是，如果团队成员离开SRE组(离开公司或转到另一个团队)，访问权限将自动撤销。\nSRE组存储在哪里？随便挑一个最方便的。GitHub、Google Apps、Active Directory等。只需确保您使用的是每个人的单一身份来源-不只是工程师，而是所有员工。\n如何根据组成员身份授予SSH访问权限？您必须留下SSH密钥(即使它们是“自动轮换”的)，并采用基于证书的身份验证。\n我们之前已经在博客中介绍了如何正确使用SSH，在那里我们展示了如何使用事实上的标准OpenSSH进行设置。或者，您也可以通过使用我们的开源远程端口解决方案(将基于身份的访问作为访问基础设施的唯一方法)来走捷径，而不是自己实施“如何正确使用SSH”中的所有技巧。这简化了访问管理，并且基于身份的访问的副作用是极大地改善了用户体验。\n为什么是证书？因为证书具有指定的TTL(生存时间)，这意味着访问凭证自动过期。此外，证书允许注入元数据。元数据之所以有用，原因有几个：\n它允许您使用执行可审核任务的人员的全名、电子邮件地址和职务等附加信息来丰富安全审核日志。\n它允许您实现RBAC(基于角色的访问控制)。HTTP/TLS使用的X.509证书广泛用于实现RBAC。如果您对SSH证书进行标准化，那么至少在理论上，您可以拥有用于SSH的RBAC。\n使用SSH证书的另一个优点是，其他一切都已经是基于证书的。当工程师打开他们的笔记本电脑并通过SSO过程时，他们可能会收到来自同一证书颁发机构的证书，用于他们需要的一切：SSH、Kubernetes和任何支持此形式身份验证的内部Web应用程序。\n访问代理和SSH跳转主机之间存在细微差别。Jumphost只是一个常规的SSH服务器，恰好是暴露在Internet上的服务器。开发人员(手动或使用OpenSSH ProxyJumpSetting或其较早的同级ProxyCommand)连接到跳转主机，然后必须建立从该跳转主机到目的地的另一个SSH会话。这有三个原因：\n开始将跳转主机当作更多东西来对待变得很诱人：构建服务器、个人临时环境等，因为它更方便。\n如果执行手动跳转，端到端加密就会消失，因为每个会话都会在跳转主机上解密并重新加密，也就是说，如果攻击者获得对跳转主机的访问权限，他们将更容易窃听会话，甚至窃取密钥。\n访问代理是一个简单得多的概念。与跳跃主机类似，它是可以通过Internet访问的服务器，但您不能通过SSH进入它。可以把它想象成一个愚蠢的交换机，它只是将您的加密连接代理到目的地：\n没有办法通过SSH进入它，因此不会诱使它承担额外的职责，从而增加攻击面。\n端到端加密始终是强制的，也就是说，即使攻击者获得了访问此框的权限，他们看到的也只是一堆通过代理的加密连接。\n一个访问代理可以支持多个协议，即不仅支持SSH，还可以支持Kubernetes API，甚至可以支持用于Jenkins等Web工具的HTTP/TLS。\n也许更重要的是，它的回报是首先将访问基础设施的需求降至最低。作为软件工程师，我们更愿意只与一台计算机打交道--我自己的。如果测试通过了，并且代码审查很好，那么git提交和推送应该就是故事的结束了！", "note_en": "In this post, I want to share my observations of how SaaS companies approach the trade-off between having solid cloud infrastructure security and pissing off their own engineers by overdoing it.\n Security is annoying. Life could be much easier if security did not get in the way of getting things done. If you are a site reliability engineer in the middle of dealing with an emergency downtime, getting an “access denied” message from a troubled database master can be as infuriating as a doctor getting punched in the face by a patient they are trying to bring back to life!!\n In this blog post we’ll go over the common anti-patterns, suggest alternatives, and will provide references to lower-level technical material for how to better implement better practices that we recommend.\n  We want to address the elephant in the room right away and say that “maximum” security at expense of everything else is not always a good thing. Everyone is looking for ”rockstar hackers” and is trying to attract the best engineers to join their teams, but guess what “hackers” are going to do if you force them to work in an unnatural way?\n  The intent may not necessarily be malicious. Say, you have a proprietary “bastion host” for SSH connections and you are forcing everyone to go through. The bastion solution is not compatible with the  ProxyJump setting, preventing people from running Ansible scripts or establishing interactive sessions directly from their machines. I have seen another variation of this where the bastion was set up to only accept connections originating from the VPN, which kind of defeats the purpose of being called a “bastion”, doesn’t it?\n By making SSH access so complicated, you may end up with another “secret” bastion set up by a developer elsewhere, simply because they are trying to be more productive.\n Or you may notice that the bastion host is now running additional services like Jenkins, or even Wordpress, because an engineer found it cumbersome to manually “jump” all the time. Congratulations, now you are vulnerable to potential exploits in those applications.\n Complexity, in general, is an enemy of good security. Complex systems are not just hard to use, they are also hard to reason about. They raise the need for high quality security talent on your team. Many security breaches can be traced back to human error, and humans tend to make more mistakes when confronted with complexity.\n If you make infrastructure access too complicated or too inconvenient, you will end up in a less secure state.\n  On the other hand, some companies err on the opposite side of the spectrum. They are comfortable with just sticking  admin.pem into a private repository on Github, shared among many SREs. Others simply ask everyone for their SSH key to be distributed to servers during provisioning, which is also, sadly, common.\n Many engineers have confessed to me that they still can access the production environments of their former employers. I’ve heard this many times interacting with customers back in my day as a product director at a major cloud provider.\n It should be obvious, that if you optimize for convenience above all else, you also will end up in a vulnerable state.\n There is not a single, absolutely correct way to implement infrastructure security, but we would like to offer some options that you may find helpful and applicable to your team.\n  It is worth investing in identity-based access as early as possible. The term “identity” has been hijacked and blown to an unrecognizable state by poor industry marketing. But the core concept is simple in principle and to implement.\n Instead of granting access based on “what” (secret), grant access based on “who” (identity).\n Secrets can be lost or stolen. Even the second-factor is not a panacea because it only splits one secret into two.\n Identity-based access is also more convenient, because if you are John Doe and you are a Devops Engineer, this is not going to change during business hours. And you shouldn’t be bothered by constantly providing secrets to various systems.\n  To use SSH as an example, consider granting SSH access to your production environments only to the members of the “SRE” group, instead of anyone who possesses the  admin.pem key. And for a good measure, make sure the access is granted for a limited time.\n This removes the need to juggle SSH keys and makes everyone’s life easier at the same time. But most importantly, if a team member leaves the SRE group (leaves the company or moves to another team), the access will be automatically revoked.\n Where is the SRE group stored? Pick whichever is most convenient. Github, Google Apps, Active Directory, etc. Just make sure you are using a single source of identity for everyone - not just engineers, but all employees.\n  How is SSH access granted based on group membership? You must leave SSH keys behind (even if they’re “automatically rotated”) and adopt certificate-based authentication.\n We have blogged previously about  How to SSH Properly, where we’ve shown how to set this up using the de facto standard, OpenSSH. Or instead of implementing all the tips in “How to SSH Properly” yourself, you can take a shortcut by using our open source Teleport solution, which embraces identity-based access as the  only method of accessing infrastructure. This simplifies access management, and the side-effect of identity-based access is a dramatically better user experience.\n Why certificates? Because certificates have a designated TTL (time to live) and this means that the access credentials expire automatically. Moreover, certificates allow the injection of metadata. Metadata is useful for several reasons:\n It allows you to enrich the security audit log with additional information like full name, email address, and title of a person who performed an auditable task.\n It allows you to implement RBAC (role-based access control). X.509 certificates used by HTTP/TLS are widely used to implement RBAC. And if you standardize on SSH certificates, you can have RBAC for SSH, at least in theory.\n Another advantage of using SSH certificates is that everything else is certificate-based already. When an engineer opens their laptop and goes through the SSO process, they may receive certificates from the same certificate authority for everything they need: for SSH, for Kubernetes, and for any internal web applications that support this form of authentication.\n  There is a subtle difference between access proxies and SSH jump hosts. A jumphost is just a regular SSH server that just happens to be the one exposed tothe Internet. Developers, either manually or by using the OpenSSH  ProxyJumpsetting or its older sibling  ProxyCommand, connect to a jump host, and thenhave to establish another SSH session from the jump host to the destination.This is problematic for three reasons:\n It becomes tempting to start treating a jump host as something more: abuild server, a personal staging environment, etc. Because it’s simply moreconvenient.\n If manual jumping is performed, end-to-end encryption goes out the window,because each session is decrypted on a jump host and re-encrypted again,i.e. if an attacker gains access to a jump host, it will be easier for themto eavesdrop on sessions, or even steal the keys.\n An access proxy is a much simpler concept. Similar to a jump host, it’s aserver that is reachable via the Internet, but you cannot SSH into it. Think ofit as a dumb switch that simply proxies your encrypted connection to thedestination:\n There is no way to SSH  into it, and therefore there’s no temptation toload it with additional duties, increasing the attack surface.\n End to end encryption is always enforced, i.e. even if an attacker gainsaccess to this box, all they’ll see will be a bunch of encrypted connectionsproxied through.\n An access proxy can support multiple protocols, i.e. not just SSH butKubernetes API or even HTTP/TLS for web tools like Jenkins.\n   And perhaps more importantly, it pays off to minimize the need to access infrastructure in the first place. As software engineers, we would much prefer dealing only with one computer - my own. If the tests pass, and the code review is good,  git commit followed by  push should be the end of the story!", "posttime": "2020-05-08 02:28:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,安全,security,ssh", "title": "基础设施安全不会拖累开发人员", "title_en": "Infrastructure Security Without Slowing Down Developers", "transed": 1, "url": "https://gravitational.com/blog/solid-infrastructure-security-without-slowing-down-developers/", "via": "", "real_tags": ["开发", "安全", "security", "ssh"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001140, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我们考虑浏览互联网时，我们往往忽略了浏览器本身。取而代之的是，我们思考我们在网上做的所有事情--我们读的文章，我们发送的电子邮件，我们看的节目。实现这一切的软件，浏览器，是如此无处不在，以至于它被忽视了。\n尽管我们的互联网使用方式发生了变化，但浏览器相对保持不变。虽然我们所有的其他软件工具都在向更好的方向发展--更具协作性的特性、灵活的界面和强大的功能--但浏览器在很大程度上仍然保持着25年前的样子。\n更重要的是，我们将浏览器的缺点归咎于自己。当我们的浏览器有大量的标签时，我们说自己效率低下；当我们在网上分心时，我们告诉自己需要更多的纪律；当我们找不到URL时，我们认为我们杂乱无章。为什么浏览器会获得免费通行证？\n这就是为什么我们正在建造一款新的浏览器--我们相信它可以为我们提供更多的功能。我们正在想象一种浏览器，它可以像我们一样快速思考，从我们的盘子里卸下工作，并推动我们的创造力向前发展。一款为2020年我们使用互联网的方式配备的浏览器，也是我们希望未来如何使用互联网的基础。\n我们五个人从几家初创公司以及Snap、Instagram、Facebook、亚马逊和奥巴马政府的工作中学到了很多。但是我们并不是什么都知道，我们有一大堆事情要做。\n也就是说，我们渴望与富有创造力、善良和热情的人一起工作。尤其是那些来自不同背景的人。如果所有这些都符合您的价值观，并且我们的某个公开角色可能适合您，请打个招呼。\n除了我们的团队，我们还很幸运地得到了我们的家人和朋友的支持，以及多年来在我们最喜欢的一些软件公司(Airtable、DuckDuckGo、Github、Instagram、Slake、Strike)中发挥作用的投资者的支持。虽然我们有财力冲刺我们的雄心壮志，但我们总是感谢新的视角和从经验中分享的经验教训。如果您愿意帮忙，请给我们发个纸条。\n否则，请随时加入我们的朋友和家人时事通讯，我们保证您将成为第一批使用我们新浏览器的用户之一。", "note_en": "When we think about browsing the internet, we often ignore the browser itself. Instead, we think about all the things we do online—the articles we read, the emails we send, the shows we watch. The software that enables it all, the browser, is so ubiquitous that it’s ignored.\n Despite the ways our internet use has evolved, the browser has remained relatively unchanged. While all of our other software tools are changing for the better—with more collaborative features, flexible interfaces, and powerful functionality—the browser largely still does what it did twenty-five years ago.\n What’s more, we blame ourselves for the browser&#39;s shortcomings. When our browser has an overwhelming number of tabs, we call ourselves inefficient; when we get distracted online, we tell ourselves we need more discipline; when we can’t find a url, we think we&#39;re disorganized. Why does the browser get a free pass?\n That’s why we&#39;re building a new browser—we believe it could do so much more to empower us. We’re imagining a browser that can think as quickly as we do, take work off of our plates, and pull our creativity forward. A browser equipped for the way we use the internet in 2020, and foundational for how we hope to use it in the future.\n  The five of us learned a lot from working at a handful of startups, as well as Snap, Instagram, Facebook, Amazon, and the Obama White House. But we don&#39;t know everything, and have a ton to do.\n Which is to say, we&#39;re eager to work with creative, kind, and passionate people. Especially those from diverse backgrounds. If all of this aligns with your values, and one of our open roles feels like it may be a fit, please  say hi.\n Beyond our team, we’re lucky to be supported by our family and friends, as well as investors who played a role in some of our favorite software companies over the years (Airtable, DuckDuckGo, Github, Instagram, Slack, Stripe). While we have the financial resources to sprint at our ambitions, we’re always grateful for new perspectives and shared learnings from experience. If you’d like to lend a hand,  please send us a note.\n Otherwise, feel free to  join our friends and family newsletter, and we promise you’ll be among the first to play with our new browser.", "posttime": "2020-05-08 02:27:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "浏览器,browser", "title": "浏览器公司", "title_en": "The Browser Company", "transed": 1, "url": "https://thebrowser.company", "via": "", "real_tags": ["浏览器", "browser"]}, {"category": "", "categoryclass": "", "imagename": "974a8d0df465c698b64552079847dc6d.gif", "infoid": 1001139, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“特朗普对科学家的警告不屑一顾，这些警告称，全国各地正在放松的限制可能导致数万人死亡”-CNN，5/6/20。\n你好，我是Peter Ludlow，InGen公司的首席执行官，该公司是极为成功的恐龙主题游乐园侏罗纪公园的幕后推手。大家都知道，在一场史无前例的风暴袭击公园后，我们失去了电力，迅猛龙逃离了它们的围栏，杀死了数百名公园游客，导致公园关闭了两个月。嗯，我很高兴地宣布，尽管速度猛禽仍然逍遥法外，我们将重新向公众开放侏罗纪公园！\n现在，我明白了为什么有些人可能会对重新开放游乐园持怀疑态度，因为那里仍然有速度快得令人眼花缭乱、重达180磅的捕食者在四处游荡。但事实是，速度猛禽是聪明、狡猾的生物，不会很快被遏制，所以我们不妨开始习惯它们时不时地杀死几个人。有些人可能会争辩说，我们应该效仿其他成功处理伶盗龙逃逸事件的公园。但是在侏罗纪公园，我们从来不会听取科学家、安全专家或生物伦理学家的建议，那么为什么我们现在就开始呢？\n正如你们中的一些人所知，我们的首席安全顾问伊恩·马尔科姆(Ian Malcolm)博士曾建议我们等到迅猛龙找到并控制好之后再重新开放公园，所以当我们告诉他这个消息时，他并不激动。我相信他的原话是：“你太专注于是否能重新开放公园了，你没有停下来想一想是否应该重新开放。”谈论一个傲慢的人。\n也就是说，你会很高兴地知道，我们没有加倍遏制努力，而是决定完全解散伶盗龙遏制工作组，转而专注于如何让人们尽快回到公园。因此，我们不会专注于所谓的救命措施，比如“待在指定的安全区”或“掩盖你的气味”，而是专注于让我们的顾客真正兴奋的细节，比如有更多有趣的帽子可供选择，乘坐翼龙形状的吊车到达岛顶，以及白垩纪咖啡馆全新的戈登·拉姆齐(Gordon Ramsay)设计的菜单。\n除了让我们的客户满意之外，重新开放公园的决定也是为了让侏罗纪公园的休假员工重返他们热爱的工作岗位。我们能不能继续给他们发几个月的工资，直到我们控制住伶盗龙的局势？一定。毕竟我们是地球上最富有的自然保护区。一些返回工作岗位的员工会不会被砍掉四肢，像玩杂耍的人扔保龄球一样抛向空中？毫无疑问。但我们有信心，通过采取一些安全预防措施，我们将能够将工作场所的伤亡水平控制在会引起广泛愤怒的水平以下。将事情控制在普遍的公众愤怒水平以下是我们在侏罗纪公园做出所有决定的黄金标准。\n说到受伤，我想花点时间感谢我们侏罗纪公园的急救人员。他们才是这里真正的英雄，我说的对吗？在应对伶盗龙攻击的过程中，我们的许多急救人员都会被迅猛龙自己撕裂和肢解。这就是为什么，为了表示感谢，我们将重新粉刷侏罗纪公园的救护车，用大泡泡字母写上“英雄移动”的字样。我们认为这远比他们要求加薪更有意义。\n我知道你们中的许多人会犹豫要不要回到侏罗纪公园，知道那里仍然有速度猛禽在保护区游荡，但请放心，事情迟早会恢复正常。伶盗龙的预期寿命只有15-20年，所以我们相信这些攻击最终会走到尽头。\n在此期间，会不会有更多的游客死亡？是。会有更多的侏罗纪公园工作人员死亡吗？是。但要知道，他们的牺牲永远不会被忘记-我们计划在礼品店最后面的角落里竖起一块小牌匾，纪念所有伶盗龙袭击的遇难者，旁边是写着这句话的T恤。这是我们至少能做的。\n所以，收拾好你的行李箱，准备好重新熟悉刚刚重新开放的侏罗纪公园，它只会稍微危险一点！记住，生活总会有办法的，…。除非你是被伶盗龙攻击的倒霉蛋，否则你很可能就完了。\n每月只有1美元(一年12美元！)。对支持我们的编辑人员和投稿人，同时保持我们没有广告有很大的帮助。今天就成为麦克斯威尼的互联网趋势赞助人吧。", "note_en": "“Trump is shrugging off warnings by scientists that the easing restrictions taking place across the country could cause tens of thousands of deaths” —   CNN, 5/6/20\n  Hello, Peter Ludlow here,  CEO of InGen, the company behind the wildly successful dinosaur-themed amusement park, Jurassic Park. As you’re all aware, after an unprecedented storm hit the park, we lost power and the velociraptors escaped their enclosure and killed hundreds of park visitors, prompting a two-month shutdown of the park. Well, I’m pleased to announce that, even though the velociraptors are still on the loose, we will be opening Jurassic Park back up to the public!\n Now, I understand why some people might be skeptical about reopening an amusement park when there are still blindingly fast, 180-pound predators roaming around. But the fact of the matter is, velociraptors are intelligent, shifty creatures that are not going to be contained any time soon, so we might as well just start getting used to them killing a few people every now and then. Some might argue that we should follow the example of other parks that have successfully dealt with velociraptor escapes. But here at Jurassic Park, we’ve never been ones to listen to the recommendations of scientists, or safety experts, or bioethicists, so why would we start now?\n As some of you know, Dr. Ian Malcolm, our lead safety consultant, had recommended that we wait until the velociraptors have been located and contained before reopening the park, so he wasn’t thrilled when we told him the news. I believe his exact words were “you were so preoccupied with whether you could reopen the park, you didn’t stop to think whether you should.” Talk about a guy on a high horse.\n That said, you’ll be pleased to know that, rather than double down on our containment efforts, we’ve decided to dissolve the velociraptor containment task force altogether, and focus instead on how we can get people back into the park as quickly as possible. So rather than concentrating on so-called life-saving measures like “staying in designated safe areas” or “masking your scent,” we’ll be focusing on the details that will get our customers really excited, like a wider selection of fun hats, a pterodactyl-shaped gondola ride to the top of the island, and a brand new Gordon Ramsay designed menu at the Cretaceous Cafe.\n In addition to satisfying our customers, the decision to reopen the park is also about allowing the furloughed employees of Jurassic Park to get back to the work they love. Could we have continued to pay their salaries for several months until we got the velociraptor situation under control? Definitely. We’re the wealthiest nature preserve on the planet after all. And will some of the employees returning to work have their limbs torn off and tossed into the air like a juggler tossing bowling pins? Undoubtedly. But we’re confident that with a few safety precautions put in place, we’ll be able to keep the level of workplace injuries and deaths just below levels that would elicit widespread public outrage. And keeping things just below widespread public outrage levels is our gold standard for all of the decisions we make here at Jurassic Park.\n And speaking of injuries, I want to take a moment to thank our Jurassic Park EMTs. They’re the real heroes here, am I right? In the process of responding to velociraptor attacks, many of our EMTs get mauled and dismembered by velociraptors themselves. That’s why, as a sign of appreciation, we will be repainting the Jurassic Park ambulance with the words “Hero Mobile” in big bubble letters. We think this is a far more meaningful token of gratitude than the salary increase they requested.\n I know many of you out there are going to be hesitant to return to Jurassic Park knowing there are still velociraptors roaming the preserve, but rest assured things will return to normal sooner rather than later. The life expectancy of a velociraptor is only 15-20 years, so we’re confident that these attacks will eventually run their course.\n In the meantime, will more visitors die? Yes. Will more Jurassic Park staff die? Yes. But know that their sacrifice will not be forgotten — we plan to erect a small plaque dedicated to all of the velociraptor attack victims in the far back corner of the gift shop next to the T-shirts that say  . It’s the least we could do.\n So pack your suitcases, and get ready to be reacquainted with the newly reopened, and only slightly more dangerous, Jurassic Park! And remember, life finds a way… unless you’re one of the unlucky ones that gets attacked by a velociraptor, then you’re probably screwed.\n    As little as $1 a month ($12 a year!) goes a long way towards supporting our editorial staff and contributors while keeping us ad-free. Become a McSweeney’s Internet Tendency patron today.", "posttime": "2020-05-08 02:27:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "侏罗纪,loose,公园", "title": "当然，迅猛龙还在逍遥法外，但我们可以重新开放侏罗纪公园", "title_en": "Sure, the Velociraptors Are Still on the Loose, but We Can Reopen Jurassic Park", "transed": 1, "url": "https://www.mcsweeneys.net/articles/sure-the-velociraptors-are-still-on-the-loose-but-thats-no-reason-not-to-reopen-jurassic-park", "via": "", "real_tags": ["侏罗纪", "loose", "公园"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001138, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "4周内可无限制享受英国“金融时报”值得信赖、屡获殊荣的商业新闻的无限量高级数字访问。\n礼品-每月与家人、朋友和同事分享多达10篇文章。\n英国“金融时报”周一至周六送到你家或办公室，包括英国“金融时报”周末报纸和副刊", "note_en": "For 4 weeks receive unlimited Premium digital access to the FT&#39;s trusted, award-winning business news\n  Gift Article – share up to 10 articles a month with family, friends and colleagues\n  The FT delivered to your home or office Monday to Saturday, including the FT Weekend paper and supplements", "posttime": "2020-05-08 02:13:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英国,drop,金融时报", "title": "英国央行预测英国GDP下降30%，但选择不推出新的刺激措施", "title_en": "BoE predicts 30 percent drop in UK GDP but opts against new stimulus", "transed": 1, "url": "https://www.ft.com/content/734e604b-93d9-43a6-a6ec-19e8b22dad3c", "via": "", "real_tags": ["英国", "drop", "金融时报"]}, {"category": "", "categoryclass": "", "imagename": "7b47899b113a3106a09feb291907a6d9.png", "infoid": 1001137, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我很沮丧。我感到难过。我厌倦了试图在我们称之为网络的混乱和令人迷惑的混乱中导航。这个曾经提供最独特、最美妙体验的地方，正慢慢蜕变成最让人难以忍受的尝试和探索之地。\n你还记得当网络是一些可怕的HTML的时候，有蓝色的链接和高度针对性的、可用的、快速消化的内容吗？那是光辉的日子，不幸的是，它们没有持续足够长的时间。\n也许最近的趋势并没有给你带来太大的困扰。也许你坚持你的书签网站的典型惯例，不会经常迷失在人迹罕至的道路上，但是，哦，天哪，网络是不是一团糟。我特别发现网络在移动设备上是最糟糕的，它已经到了我需要避免的地步，以免我的手机摔在桌子上。\n在谷歌或DuckDuckGo上搜索一些主题(例如：试图查找美味砂锅菜的食谱)。\n尝试在广告弹出窗口中导航站点并将页面向下推，此过程可能需要30秒或更长时间。\n“嘿，我们需要做饼干，你们接受吗？”好的，好的，当然，当然。为什么我不允许Cookie出现在我感兴趣的网站上。\n一个整页的阻挡弹出窗口：“嘿，你对我们的时事通讯感兴趣吗？”绝对-他妈的-不是。关闭它，假设有一个“X”可以点击(有一半的时间页面在移动设备上无法正确呈现，并且到处都找不到“X”)。\n又弹出一则广告。好的，我会滚动过…。。操!。我点击它，一个新的窗口打开，它在20多页之间导航。我的浏览器历史记录现在充满了从一个垃圾网站重定向到另一个网站的页面。操。关闭那个，回到主站点。\n新的弹出窗口，“嘿，想在社交媒体上关注我们吗？”你他妈的从我面前滚开怎么样？按下“X”，关闭。\n“这个网站想知道您的位置，您允许吗？”他妈的什么，不，他们为什么要知道我的位置。\n这太荒谬了，太让人气愤了，对我的精神健康有害。从字面上看，生活中没有什么比试图在网上寻找食谱更令人沮丧的了。来吧，试试看。在谷歌上搜索一份食谱，试着找到说明并打印出来。令人难以置信的是，有这么多网站使用相同的毒流：广告、Cookie、弹出窗口等…。\n首先，也可能是最简单的，是“cookie弹出窗口”。我是说，老实说，他妈的怎么回事？为什么会有这些东西存在呢？谁点击“不，我不接受Cookie，我知道如果我没有Cookie，我就不能使用该站点，因为它们是HTTP请求的RFC标准的一部分。”把那狗屎扔掉。浏览器可以实现Cookie控件，站点没有理由询问用户任何问题。\n第二：广告。哦，广告。你们这些可怕的、可怕的、他妈的毫无意义的内容，我真希望我能完全忽略它。我希望有一个全球浏览器覆盖来禁用广告，由谷歌和苹果提供支持。支付15美元/月以避免网络上的所有广告。向您访问的网站支付费用(例如，中等风格)。\n老实说，我对前两个问题的解决很满意，但我想最后一个大问题是订阅时事通讯。这也可能是一个全球浏览器设置，要求您为时事通讯发送电子邮件，类似于“询问位置”如何变得全球化。如果浏览器可以在全球范围内选择退出“我永远不会与一个随机的站点k.thx共享我的电子邮件地址”，那就太好了。再见。“。\n我不能否认，总的来说，我绝对热爱网络。我喜欢它的开放性，连通性，瞬间的…。\n但是，我们不能让事情失控，现在是难以忍受的。\n目前，网络真正的未来是面向移动应用程序和苹果新闻这样的全球平台。考虑到网络已经变得多么糟糕，这些解决方案都是权宜之计。\n我们需要平台、工具和立法来帮助引导网络走向一个不完全是狗屎的未来。", "note_en": "I’m frustrated. I’m sad. I’m sick and tired of trying to navigate the cluttered and disorienting mess we call the web. The place that used to provide the most unique and wonderful experiences has been slowly transforming into the most insufferable place to try and explore.\n Do you remember when the web was some hideous HTML with blue links and highly targeted, usable, quickly digestible content? Those were the glory days, and unfortunately they didn’t last long enough.\n Perhaps recent trends haven’t bothered you that much. Perhaps you stick to your typical routine of bookmarked sites and don’t often stray to the path less traveled, but,  oh boy, is the web a horrendous mess. I especially find the web is at it’s worst on mobile, and it has gotten to the point where I just need to avoid it, lest I slam my phone on the table.\n  Search for some topic on Google or DuckDuckGo (an example: trying to lookup a recipe for a tasty casserole).\n  Attempt to navigate the site as ads popup and push the page down, this process can take 30 seconds or longer.\n   “Hey, we need to set cookies, do you accept?” Yes, yes, sure, sure. Why would I not allow cookies on a site I’m interested in viewing.\n  A full-page-blocking popup: “Hey, are you interested in our newsletter?”  Absolutely-fucking-not. Close that, assuming there’s an “X” to click (half the time the page doesn’t render properly on mobile and the “X” is nowhere to be found).\n  Another ad pops up. Okay, I’ll just scroll past…. FUCK! I click on it, a new window opens, and it navigates through 20+ pages. My browser history is now filled with pages of redirects from one spam site to another. Fuck. Close that, go back to the main site.\n  New popup, “Hey, want to follow us on social media?” How’s about you get the fuck out of my face? Hit “X”, close.\n  “This site would like to know your location, will you allow?” What the fuck, no, why do they need to know my location.\n  It’s ridiculous, it’s infuriating, it’s toxic to my mental health. Literally nothing else in life is more frustrating than trying to find a recipe online. Go ahead, try it. Google a recipe and try to find the directions and print it. It’s unbelievable how many sites use the same toxic flow: Ads, cookies, popups, etc…\n    First, and probably the easiest, is “cookie popups”. I mean, honestly, what the fuck? Why do these exist? Who clicks “no I don’t accept cookies and I understand I can’t use the site if I don’t have cookies because they are part of the RFC standard for HTTP requests.” Get rid of that shit. Browsers can implement cookie controls, there’s no reason for a site to ask a user anything.\n Second: Ads. Oh, ads. You horrible, horrible little fucking squares of pointless content I wish I could so completely ignore. I wish there was a global browser override to disable ads, powered by Google and Apple. Pay $15/mo to avoid all ads on the web. Payments are made to sites you visit (e.g. Medium style).\n Honestly I’d be happy with the first two problems solved, but I suppose the last big one would be Newsletter Sign-up. That could also potentially be a global browser setting that asks for your email for the newsletter, similar to how “ask for location” has become global. Would be great if browsers had a global opt-out for “I’m never going to share my email address with a random site, k. thx. bye.”\n  I can’t deny that, in general, I absolutely love the web. I love the openness, the connectedness, the instantaneous…\n However, we shouldn’t let things get out of control, and right now they are insufferable.\n Currently, the  real future of the web is being geared towards mobile apps and global platforms like Apple News. Those solutions are stop-gaps given how horrible the web has become.\n We need platforms, tools, and  legislation that help guide the web to a future that isn’t complete shit.", "posttime": "2020-05-08 02:13:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "web,网站", "title": "Web正在变得无法使用", "title_en": "The Web Is Becoming Unusable", "transed": 1, "url": "https://medium.com/@clay.c.edgar/the-web-is-becoming-unusable-e7aec886402f", "via": "", "real_tags": ["web", "网站"]}, {"category": "", "categoryclass": "", "imagename": "e863592e09502daacc0ad95a7876b29e.png", "infoid": 1001136, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个应用程序在后台运行，并使用低能耗蓝牙识别在本地区域内运行该应用程序的其他人。当该应用程序在后台永久运行时，它会定期广播和监听其他支持蓝牙的设备(此时是iOS和Android)，这些设备也会广播相同的唯一标识符。\n我们的唯一标识符也称为我们的服务特性。在蓝牙规范中，设备可以广播服务的可用性。每个服务都可以有多个特征。我们使用一个特征来唯一地标识我们的服务，并将其与所有其他类型的蓝牙设备区分开来。\n对于我们找到的每一台具有匹配特征的设备，我们都会记录我们看到的设备的标识符、时间戳和蓝光信号的RSSI，这将允许一个团队稍后确定谁与感染新型冠状病毒的人关系密切。\n被动收集设备附近的其他应用程序用户的匿名ID(本地存储在设备上)。\n从其他开发人员那里获取一份GoogleService-Info.plist的副本，并将其复制到.ret目录中。\n如果Xcode已打开，请重新启动Xcode。Xcode不能很好地处理从它下面更改出来的配置文件。\n这个应用程序目前依赖于远程(而不是推送)通知，不幸的是，我们还无法在模拟器上触发。推送通知(.apns文件形式)可以拖到模拟器窗口上或传递到simctl中，但远程通知只在设备上传递。\n./bin/pu.sh是从pu.sh派生的脚本，其中有从AppleDeveloper帐户获取凭据的说明。但是，我们已经用完了可用的APNS密钥，因此您需要从其他开发人员那里获得该密钥。使用其中一个示例通知的路径运行脚本，以通过Apple：./bin/pu.sh&#34；示例通知/2_Potential_Diagnosis.apns发送远程通知。您还需要设置以下环境变量来配置脚本：\n构建是从配置项自动生成的。每隔两个小时，我们会将主版本中的任何更改合并到内部版本中，升级版本，并剪切一个上传到Test Flight的构建版本。", "note_en": "This application runs in the background and identifies other people running theapp within the local area by using low energy bluetooth. While the app isrunning permanently in the background, it periodically broadcasts and listensfor other bluetooth-enabled devices (iOS and Android at this time) that alsobroadcast the same unique identifier.\n  Our unique identifier is also known as our sevice characteristic. In thebluetooth spec, devices can broadcast the availability of services. Eachservice can have multiple characteristics. We use a characteristic to uniquelyidentify our service and distinguish from all other sorts of bluetooth devices.\n For every device we find with a matching characteristic, we record anidentifier for the device we saw, the timestamp, and the rssi of the bluetoothsignal, which will allow a team later on to determine who was in closeproximity to individuals infected with the novel coronavirus.\n  Passively collect anonymized ids of other users of the app that the devicehas been in proximity with (stored locally on the device)\n    Get a copy of GoogleService-Info.plist from one of the other developers andcopy that into the  .secret directory.\n If Xcode is open, restart Xcode. Xcode does not handle configurationfiles being changed out from under it gracefully.\n  The app currently relies on  remote (as opposed to  push) notifications,which we unfortunately have not been able to trigger on the Simulator. Pushnotifications (in the form of  .apns files) can be dragged onto a Simulatorwindow or passed into  simctl, but remote notifications are only delivered ondevices.\n  ./bin/pu.sh is a script forked from  pu.sh.There are instructions there for obtaining credentials from an AppleDeveloper account. However, we are out of available APNs keys, so you&#39;ll needto obtain that from another developer. Run the script with the path to one ofthe example notifications to send a remote notification through Apple: ./bin/pu.sh &#34;Example Notifications/2_potential_diagnosis.apns. You willalso need to set the following environment variables to configure the script:\n  Builds are automatically generated from CI. Each two hours, we merge anychanges from  master into  internal, bump the version, and cut a build thatgets uploaded to Test Flight.", "posttime": "2020-05-08 02:12:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,病毒,程序,冠状病毒,nhs", "title": "英国NHS冠状病毒应用程序", "title_en": "UK’s NHS Covid-19 App", "transed": 1, "url": "https://github.com/nhsx/COVID-19-app-iOS-BETA", "via": "", "real_tags": ["app", "病毒", "程序", "冠状病毒", "nhs"]}, {"category": "", "categoryclass": "", "imagename": "223ca1164ff18da0a66de236de13800f.jpg", "infoid": 1001134, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "斯坦福大学的研究人员朝着使电动汽车在驾驶时能够无线充电又近了一步。\n工程师们已经展示了一种实用的方法，利用磁力无线传输电力，为电动汽车、机器人甚至无人机充电。这项技术可以扩大到为行驶在高速公路上的电动汽车、工厂地板上的机器人和在屋顶上空盘旋的无人机提供动力。\n斯坦福大学的工程师们已经迈出了一大步，使电动汽车在未来高速公路上以无线方式为汽车“加油”时实现了充电。", "note_en": "Stanford researchers one step closer toward enabling electric cars to recharge themselves wirelessly as they drive\n  Engineers have demonstrated a practical way to use magnetism to transmit electricity wirelessly to recharge electric cars, robots or even drones. The technology could be scaled up to power electric cars as they drive over highways, robots on factory floors and drones hovering over rooftops.\n  Stanford engineers have taken a big step toward making it practical for electric cars to recharge as they speed along futuristic highways built to “refuel” vehicles wirelessly.", "posttime": "2020-05-08 01:53:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "行驶,charging,电动汽车", "title": "电动汽车行驶时无线充电", "title_en": "Wirelessly charging electric cars as they drive", "transed": 1, "url": "https://news.stanford.edu/2020/05/04/wirelessly-charging-electric-cars-drive/", "via": "", "real_tags": ["行驶", "charging", "电动汽车"]}, {"category": "", "categoryclass": "", "imagename": "98c372d59405b7d3a7993df84f05c26f.jpg", "infoid": 1001133, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "十个月内，地球上将上演一场新的登月竞赛，三个小组将争先恐后地建造半个世纪前将阿波罗项目的宇航员带到那里的月球观光舱()的继任者。\n4月30日公布的参赛者是由备受瞩目的亿万富翁埃隆·马斯克运营的SpaceX公司，以及两个财团。一家由杰夫·贝佐斯经营的Blue Origin公司领导，该公司与马斯克相似，身家数十亿美元；另一家由美国科技公司Leidos的子公司Dynetics领导，该公司并不高调。\n这两架飞机的着陆是肇事逃逸事件。最长的一次是在月球层上呆了三天。这艘船本身有一个下降阶段，有四条细长的腿，这也是上升阶段(如图)的平台，上升阶段将其两名船员带回母船。\n这一次的计划是为了更多的船员和更长的停留时间。因此，候选人要比。不过，在概念上最相似的是蓝色起源的，它有单独的下降和上升阶段。但它有两个后者-一个是低月球轨道，另一个是从那里与将把宇航员带回家的飞船会合。它将由Blue Origin提出的新格伦(New Glenn)火箭或火神(Vulcan)运往月球，火神是由洛克希德·马丁公司(Lockheed Martin)和波音(Boeing)组成的联合发射联盟(United Launch Alliance)计划的一种发射器。\nSpaceX和Dynetics都有完好无损地着陆和起飞的设计。但他们在如何到达月球方面存在差异。“动力人”将在火神上发射。SpaceX的着陆器是其拟议的星际飞船设计的一个版本，将在该公司计划的超重型火箭上实现这一点。\n值得注意的是，波音公司没有出现在名单上。它提供了一个类似于下降和上升阶段的系统，但没有通过。其他人必须在明年2月之前确定他们的设计。\n这篇文章发表在印刷版的科技版上，标题是“新月竞赛”。", "note_en": "T  ten months will see a new race to the Moon played out on Earth, as three groups vie to construct a successor to the Lunar Excursion Module ( ) which took the astronauts of the Apollo project there half a century ago.\n The contestants, announced by   on April 30th, are SpaceX, run by Elon Musk, a high-profile billionaire, and two consortia. One is led by Blue Origin, run by Jeff Bezos, similarly profiled to Mr Musk and laden with even more billions, and the other by a not-at-all-high-profile outfit called Dynetics, a subsidiary of Leidos, an American technology firm.\n  The  ’s landings were hit-and-run affairs. The longest spent three days on the lunar regolith. The   itself had a descent stage, with four spindly legs, that also acted as a platform for the ascent stage (pictured), which took its crew of two back to the mother ship.\n This time around the plan is for larger crews and longer stays. The candidates are thus bigger than the  . The most  -like in concept, though, is Blue Origin’s. It has separate descent and ascent stages. But it has two of the latter—one to low lunar orbit, the other thence to a rendezvous with the craft that will take the astronauts home. It would be carried to the Moon either by Blue Origin’s proposed New Glenn launch rocket, or on Vulcan, a launcher planned by a consortium, the United Launch Alliance, of Lockheed Martin and Boeing.\n SpaceX and Dynetics each have designs that land and take off intact. But they differ in how they will get to the Moon. Dynetics’ will launch on Vulcan. SpaceX’s lander is a version of its proposed Starship design that will do so on the firm’s planned Super Heavy rocket.\n Conspicuous by its absence from the list is Boeing. Its offer of a  -like system of descent and ascent stages did not make the cut. The others have until next February to firm up their designs.\n This article appeared in the Science &amp; technology section of the print edition under the headline &#34;A new Moon race&#34;", "posttime": "2020-05-08 01:52:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "月球,race", "title": "一场新的月球竞赛已经开始", "title_en": "A new Moon race has begun", "transed": 1, "url": "https://www.economist.com/science-and-technology/2020/05/09/another-step-towards-returning-people-to-earths-satellite", "via": "", "real_tags": ["月球", "race"]}, {"category": "", "categoryclass": "", "imagename": "29843bb59d309dedbcd75ed71c6df533.jpg", "infoid": 1001132, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "世界上最有力的关于普遍基本收入的研究得出结论，普遍基本收入有利于接受者的精神和经济健康，以及适度改善就业。\n芬兰在2017年和2018年进行了一项为期两年的普遍基本收入研究，在此期间，政府向2，000名年龄在25岁至58岁之间的失业人员每月发放救济金，不附加任何条件。\n每月560欧元的付款没有经过经济状况调查，而且是无条件的，这意味着如果个人找到工作或后来加薪，这些金额不会减少。这项研究是在全国范围内进行的，选定的接受者无法选择退出，因为这项测试被写入了立法。\n芬兰社会保险机构的Minna Ylikännö今天在赫尔辛基通过直播宣布了这一发现。\n这项研究将基本收入接受者的就业和福祉与17.3万名领取失业救济金的对照组进行了比较。\n2017年11月至2018年10月，领取基本收入的人平均工作78天，比领取失业救济金的人多工作6天。\n有孩子的家庭以及母语不是芬兰语或瑞典语的人的就业率增幅更大，但研究人员还不确定原因。\n在接受调查时，接受全民基本收入而不是定期失业救济金的人报告说，他们的财务状况、心理健康和认知功能更好，对未来的信心也更高。\n当被问及基本收入是否可以帮助人们应对冠状病毒大流行的经济影响时，Ylikännö表示，这可能有助于在不确定的时候缓解压力。\n她说：“我认为，当人们不知道自己是否会有收入时，在非常不安全的情况下，这会给他们带来安全。”\n不过，芬兰政府在2018年初推出的被称为“激活模式”的立法，使得基本收入的影响变得复杂起来。它使获得失业救济金的条件变得更加严格。\nYlikännö说，时机使得很难将基本收入实验的影响与政策变化分开。“我们只能说，我们观察到的就业效应是实验和激活模型共同作用的结果，”她说。\n去年2月发布的初步调查结果此前发现，2017年两组人的工作天数没有差异。\nYlikännö表示：“货币固然重要，但仅凭它还不足以显著促进劳动力供应或需求。”", "note_en": "The world’s most robust study of universal basic income has concluded that it benefits recipients’ mental and financial wellbeing, as well as modestly improving employment.\n Finland ran a two-year  universal basic income study in 2017 and 2018, during which the government gave 2000 unemployed people aged 25 to 58 monthly payments with no strings attached.\n The payments of €560 per month were not means tested and were unconditional, meaning they were not reduced if an individual got a job or later had a pay rise. The study was nationwide and selected recipients were not able to opt out, as the test was written into legislation.\n   Minna Ylikännö at the Social Insurance Institution of Finland announced the findings in Helsinki today via livestream.\n The study compared the employment and wellbeing of basic income recipients to a control group of 173,000 people who were on unemployment benefits.\n Between November 2017 and October 2018, people on basic income worked an average of 78 days, which was six days more than those on unemployment benefits.\n There was a greater increase in employment for people in  families with children, as well as those whose first language was not Finnish or Swedish – but the researchers aren’t yet sure why.\n When surveyed, people who received universal basic income instead of regular unemployment benefits reported better financial wellbeing, mental health and cognitive functioning, as well as higher levels of confidence in the future.\n   When asked whether basic income could help people dealing with situations such as the economic fallout of the  covid-19 pandemic, Ylikännö said that it could help alleviate stress at an uncertain time.\n “I think it would bring people security in very insecure situations when they don’t know whether they’re going to have an income,” she said.\n  However, the effect of basic income was complicated by legislation known as the “activation model”, which the Finnish government introduced at the beginning of 2018. It made the conditions for accessing unemployment benefits stricter.\n The timing made it difficult to separate the effects of the basic income experiment from the policy change, said Ylikännö. “We can only say that the employment effect that we observed was as a joint result of the experiment and activation model,” she said.\n Preliminary findings,  released in February last year, had previously found no difference between the two groups for the number of days worked in 2017.\n “Money matters, but alone it’s not sufficient to significantly promote either labour supply or demand,” said Ylikännö.", "posttime": "2020-05-08 01:52:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "基本,basic,收入", "title": "全民基本收入似乎改善了就业和福祉", "title_en": "Universal basic income seems to improve employment and wellbeing", "transed": 1, "url": "https://www.newscientist.com/article/2242937-universal-basic-income-seems-to-improve-employment-and-wellbeing/", "via": "", "real_tags": ["基本", "basic", "收入"]}, {"category": "", "categoryclass": "", "imagename": "2828b8d9a9f7d41ddf81d60e6aba5c62.jpg", "infoid": 1001131, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌(Google)旗下的多伦多人行道实验室(Toronto Sideway Labs)以其所称的前所未有的经济不确定性为由，放弃了在多伦多海滨建设高科技社区的计划。\n这项名为“码头”(Quayside)的项目仍未获得推进所需的全部政府批准。许多人对该项目对隐私的影响以及该市开发中的海滨人行道实验室想要控制多少区域表示担忧。\n这座所谓的智能城市将采用一系列尖端技术，从木材制成的住宅楼到自动驾驶汽车的使用和加热人行道。\n该公司首席执行官丹·多克托罗夫(Dan Doctoroff)在一份声明中表示，随着全球和多伦多房地产市场出现前所未有的经济不确定性，在不牺牲我们制定的计划核心部分的情况下，让这个12英亩的项目在财务上可行已经变得太难了。\n多伦多市长约翰·托里(John Tory)很快发表声明称，他对公司的决定感到遗憾，但预计会有其他人介入开发该地区。\n他在一封电子邮件中表示：在冠状病毒之后，多伦多的经济将强劲复苏，我们将继续成为吸引聪明人和聪明公司的磁石。\n托里还表示，他计划推动多伦多滨水区以及省政府和联邦政府，以确保该地区的任何新开发项目都能创造新的就业机会，并创造一个碳中性社区，拥有负担得起的住房，以及更好的交通和可持续发展功能。\n他说，人行道体验帮助我们推进了我们的方法，既满足了改善海滨交通的需求，也满足了数字治理的需要。\n库恩。乔·克雷西·李(Joe Cressy)是多伦多海滨委员会的成员。他在一份声明中说，他得知该公司将于周四上午退出该项目。\nCressy说，在过去的两年里，多伦多滨水区在码头的开发上投入了大量的工作。人们对人行道实验室的提议提出了合理的担忧，包括对数据收集和数字治理的担忧。\nCressy说，这导致了审查和重要的公众咨询，以了解该提案的风险和机会。\n他说，虽然这确实意味着多伦多滨水区将再次开始重新规划码头，但所有这些工作都不会白费。我们从居民和社区组织那里获得的参与和反馈给了我们一个坚实的框架，将塑造我们未来的工作。\n码头项目是在2017年10月的一个仪式上正式宣布的，当时英国首相贾斯汀·特鲁多(Justin Trudeau)、州长凯瑟琳·韦恩(Kathleen Wynne)、保守党人，以及多伦多海滨实验室和人行道实验室的代表制定了该地区的计划。\n特鲁多当时表示，拟议中的高科技社区将为新技术创建一个试验台。\n但多年来，人们对该项目的担忧层出不穷。去年，一个顾问小组对该计划提出了一系列问题，称计划抽象得令人沮丧，一些提议的创新无关紧要或没有必要。\n多伦多滨水区(Waterfront)数字战略顾问小组的一份报告对人行道(Sideway)提出的管理数据的方式提出了质疑，这些数据本来是从它想要建设的社区产生的。\n该项目最初设想为约77公顷的土地，但后来缩减至约4.8公顷。\n在宣布该项目终止的声明中，多克托罗夫感谢多伦多的居民、社区团体和公民领袖的支持。\n他说，多伦多人行道实验室被多伦多提供的多样性、成长性和机会所吸引，这一观点在沿途的每一步都得到了肯定和加强。多伦多是世界上最伟大的技术创新中心之一，这一决定不会以任何方式削弱这一点。", "note_en": "Toronto      Sidewalk Labs, a Google-affiliated company, is abandoning its plan to build a high-tech neighbourhood on Toronto&#39;s waterfront, citing what it calls unprecedented economic uncertainty.\n  The project, dubbed Quayside, still didn&#39;t have all of the government approvals it needed to go ahead. Many had raised concerns about the privacy implications of the project and how much of the city&#39;s developing waterfront Sidewalk Labs wanted to control.\n   The so-called &#34;smart city&#34; was set to feature a range of cutting edge technology, from residential towers made of timber to the use of autonomous cars and heated sidewalks.\n  &#34;As unprecedented economic uncertainty has set in around the world and in the Toronto real estate market, it has become too difficult to make the 12-acre project financially viable without sacrificing core parts of the plan we had developed,&#34; company CEO Dan Doctoroff said in a statement.\n  Toronto Mayor John Tory was quick to issue a statement saying he regrets the company&#39;s decision, but anticipates others will step in to develop the area.\n  &#34;Toronto&#39;s economy will come back strong after COVID-19 and we will continue to be a magnet for smart people and smart companies,&#34; he said in an email.\n  Tory also said he plans to push Waterfront Toronto and both the provincial and federal governments to make sure any new development in the area will create new jobs and a &#34;carbon-neutral neighbourhood&#34; with affordable housing units and &#34;better transportation and sustainability features.&#34;\n  &#34;The Sidewalk experience helped us advance our approach both to the need for improved waterfront transportation and digital governance,&#34; he said.\n    Coun. Joe Cressy is a member of the Waterfront Toronto Board. He said in a statement he learned the company was pulling out of the project Thursday morning.\n  &#34;Over the past two years, Waterfront Toronto has invested a considerable amount of work in the development of Quayside,&#34; Cressy said. &#34;Legitimate concerns were raised regarding Sidewalk Labs&#39; proposals, including concerns over data collection and digital governance.&#34;\n    That led to reviews and &#34;significant public consultation,&#34; Cressy said, to understand the &#34;risks and opportunities&#34; of the proposal.\n  &#34;While this does mean that Waterfront Toronto will start again to reimagine Quayside, none of this work will go to waste,&#34; he said. &#34;The engagement and feedback we have received from residents and community organizations has given us a solid framework that will shape our work going forward.&#34;\n    The Quayside project was  formally announced at a ceremony in October 2017, when Prime Minister Justin Trudeau, Premier Kathleen Wynne, Tory, and representatives from Waterfront Toronto and Sidewalk Labs laid out plans for the area.\n  Trudeau said at the time that the proposed high-tech neighbourhood would &#34;create a test bed&#34; for new technologies.\n  But concerns abounded about the project through the years. An advisory panel  raised a range of issues with the plan last year, saying plans were &#34;frustratingly abstract&#34; and that some of the innovations being proposed were &#34;irrelevant or unnecessary.&#34;\n  A report from Waterfront Toronto&#39;s digital strategy advisory panel questioned the way Sidewalk had proposed to manage data that would have been generated from the neighbourhood it wanted to build.\n  The project was originally envisioned as a  77-hectare site, but was later  scaled back to 4.8-hectares.\n    In his statement announcing the project&#39;s demise, Doctoroff thanked Toronto&#39;s residents, community groups and civic leaders for their support.\n  &#34;Sidewalk Labs was attracted to Toronto by the diversity, growth, and opportunity the city has to offer, and that view has been affirmed and strengthened at every step along the way,&#34; he said. &#34;Toronto is one of the world&#39;s great centres of technological innovation, and nothing about this decision will in any way diminish that.&#34;", "posttime": "2020-05-08 01:32:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "病毒,冠状病毒,邻里关系,labs,计划", "title": "人行道实验室取消在冠状病毒中在多伦多建立高科技邻里关系的计划", "title_en": "Sidewalk Labs Cancels Plan To Build High-Tech Neighbourhood in Toronto Amid COVID-19", "transed": 1, "url": "https://www.cbc.ca/news/canada/toronto/sidewalk-labs-cancels-project-1.5559370", "via": "", "real_tags": ["病毒", "冠状病毒", "邻里关系", "labs", "计划"]}, {"category": "", "categoryclass": "", "imagename": "ff4ef5daf074ae692c993009691ed264.jpg", "infoid": 1001130, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "中小型企业主通常想要一个设计紧凑的东西，以便将其拖到商务会议上做必要的笔记，但最终可以通过一个跨数百或数千名员工的中央管理系统进行管理。迎合这一市场的是联想，该公司发布了两款专为中小企业客户设计的新机型，联想ThinkPad E14和E15系列笔记本在设计上有所改进，目前最高可配AMD Ryzen 7 4700U APU。同时发布的还有AMD&39；的ThinkPad T14、T14s、L14、L15和较小的X13机型，这些机型都采用了最新的AMD Ryzen 4000 PRO系列处理器，具有专为专业和商业用户设计的额外安全功能。\n除了其产品组合(包括英特尔第10代移动更新ThinkPad E14系列和E15系列)外，正在寻找的中小企业用户现在拥有基于AMD Ryzen的选项。与之前的E14和E15系列在设计上类似，新的联想ThinkPad E系列将与Ryzen 4000 Mobile一起提供。联想还表示，它已经改进了屏幕与机身的比例，达到85%，尽管它没有提供衡量这一比例的最新指标。\n联想ThinkPad系列配备了八核AMD Ryzen 7 4700U APU，不带SMT，并配备了七个Radeon图形内核来为显示屏供电。虽然联想目前还没有详细说明显示屏或其他重要规格，但它增加了一个触摸指纹识别器和一个可选的由Mirametrix驱动的红外摄像头。他们被引用为拥有凝视跟踪技术的安全和隐私方面的专家。这一点与其集成在内部的Glance软件相结合，增加了额外的安全元素，可以对用户的存在做出反应，并可以在用户离开时自动锁定笔记本电脑。触摸式指纹识别器内置在电源按钮中，允许用户一键打开系统，比传统的电源按钮更安全，更适合不同的商业环境。\n联想还发布了搭载AMD Ryzen PRO 4000系列处理器的新款ThinkPad T、X和L系列机型。联想ThinkPad 14 Gen 1的广告包括预计16小时的电池续航时间，17.9毫米和1.46公斤的轻薄机身，在其升级的T14s机型上，20小时的电池续航时间甚至更长。ThinkPad T14s的外形更薄，厚度为16.1毫米，重量从1.27公斤起。较小的ThinkPad x13机型声称电池续航时间长达17.5小时，厚度为16.9毫米，重量在上升曲线上，起步点仅为1.28公斤。这使得ThinkPadx13在其发布的堆栈中是最轻的。\n在新的联想ThinkPad堆栈中向下移动的是L14和L15机型，这两款机型的尺寸最大，L14的厚度为20.4毫米，而L15的厚度为21毫米，略显厚实。ThinkPad L14的重量将从1.61公斤起，而L15的重量将超过1.98公斤。两者都包括长达14小时的预计电池续航时间，联想声称它使用了MobileMark14基准来获得这一数据。\n所有联想ThinkPad T、X和L系列机型都将搭载AMD最新的Ryzen 4000 PRO移动系列处理器，具备额外的内置安全功能，并搭载联想的Self-Heating BIOS和Lenovo ThinkShield。这些新机型将从6月份开始发售，T14的起价为849美元，T14s的起价为1029美元，x13系列的起价为849美元。6月份开始发售的还有L14和L15系列的ThinkPad机型，起价均为649美元。\n至于联想ThinkPad E14和E15系列，都将从6月份开始发售，起价639美元。\n发表评论没有提到T15？这似乎很奇怪，他们忽略了这一点-无论是在阵容中还是在新闻稿中。无论哪种方式，这都很奇怪。回覆\n看来，虽然这些AMD笔记本电脑将比以前的更好，但原始设备制造商仍然不会在任何组件上走在前列。因此，没有高尼特和/或宽色域显示器，没有迅雷，没有最好的固态硬盘，等等。看起来电池续航时间较长，略高于平均水平的显示器，中档固态硬盘，以及更好的散热效果。然而，令人沮丧的是，很少完全在同一设备中使用。一步一个脚印。回覆。\n我认为我们将不得不等待2021年在AMD设备上使用USB4。我相信已经有几台笔记本电脑将英特尔的迅雷控制器与AMD APU配对，但这些都是例外。尽管如此，这些都是不错的套装，对AMD有好处，对消费者和企业也有好处。回覆。\n好的，我不知道多少年来AMD让我为买笔记本电脑而焦头烂额。但是，所有制造商的名字都把我搞糊涂了。即使是谷歌搜索也没有真正清楚地说明这一点。T和X有什么不同？这两款笔记本似乎都是高质量、超薄、超便携的笔记本。X的质量还会更高吗？此外，这两款LMVE似乎都是预算较低的ThinkPad。我读到L是由ThinkPad团队完成的，而E来自Ideapad团队。但是，这是否意味着向用户显示了不同之处呢？回覆。\n修改我的评论：“两个LMVE”都应该是“L和E”的回答。\nE系列：经济线ThinkPad，缺乏人们与该品牌联系在一起的许多功能。T系列：您默认的ThinkPad。高端中型，适合商务使用。有很好的QOL功能，如内部滚筒和液体排水孔，所以把咖啡洒在键盘上不会毁了笔记本电脑。有14英寸和15英寸两种型号。末尾有s的是超极本版本。通常可伸缩性较差，但更薄、更轻。X系列：高端超便携笔记本。通常提供12英寸和13英寸屏幕。L系列：比T系列低，但比E高，两者的一般尺寸等级相同。回覆。\nE-Economy T-只要得到这个X-poseur Level L-至少它不是E的回复", "note_en": "Small to medium business owners generally want a something in a compact design, to lug it around to a business meeting to take essential notes, but ultimately can be managed from a central administration system across hundreds or thousands of employees. Catering for this market is Lenovo, and it has announced a pair of new models designed for its SMB customers. The Lenovo ThinkPad E14 and E15 series of notebooks have been improved in design and are now available with up to an including an AMD Ryzen 7 4700U APU. Also announced are AMD&#39;s ThinkPad T14, T14s, L14, L15, and smaller X13 models all featuring the latest AMD Ryzen 4000 PRO series processors with extra security features designed for professional and business users.\n  Adding to its portfolio, including its Intel 10th gen mobile refresh ThinkPad E14 and E15 series, SMB users looking now have an AMD Ryzen based option. Similar in design to the previous E14 and E15 series, the new Lenovo ThinkPad E series will be available with Ryzen 4000 Mobile. Lenovo has stated that it has an improved screen to body ratio of 85%, although it doesn&#39;t provide the metric which this is measured against.\n    The Lenovo ThinkPad series is is available with an eight-core AMD Ryzen 7 4700U APU without SMT and has seven Radeon graphics cores to power the display. While Lenovo hasn&#39;t detailed the display or the other vital specifications at this time, it has added a touch fingerprint reader and an optional IR camera powered by Mirametrix. They are quoted as specialists in security and privacy with its gaze tracking technology. This combined with its Glance software which is integrated within adds an extra element of security which respond to a users presence and can automatically lock the laptop when users step away. The touch fingerprint reader is built into the power button and allows users the ability to turn the system on with one touch, which is more secure than conventional power buttons and is suited to business environments.\n    Lenovo has also announced new ThinkPad T, X, and L series models powered by AMD Ryzen PRO 4000 series processors. The Lenovo ThinkPad 14 Gen 1 is advertised to include a projected 16-hour battery life and a thin lightweight frame of 17.9 mm and 1.46 Kg, with an even bigger 20-hour battery life on its uprated T14s model. The ThinkPad T14s has a slimmer profile at 16.1 mm thick, with a weight starting at 1.27 Kg. The smaller ThinkPad X13 model has a claimed battery life of up to 17.5 hours, with a thickness of 16.9 mm and a weight on an upward curve starting at just 1.28 Kg. This makes the ThinkPad X13 the lightest from its announced stack.\n    Moving down the new Lenovo ThinkPad stack are the L14 and L15 models which are the largest in size with a thickness of 20.4 mm on the L14, whereas the L15 is slightly chunkier with a thickness of 21 mm. The ThinkPad L14 will have a weight starting at 1.61 Kg, while the L15 will weigh upwards of 1.98 Kg. Both include a projected battery life of up to 14-hours, which Lenovo claims it has used the MobileMark14 benchmark to get this data.\n  All the Lenovo ThinkPad T, X, and L series models will feature AMD&#39;s newest Ryzen 4000 PRO mobile series processors, with extra layers of built-in security features, and feature Lenovo&#39;s Self-Healing BIOS, and Lenovo ThinkShield.  These new models will be available from June, with prices starting at $849 for the T14, $1029 for the T14s, and $849 for the X13 series. Also available from June will be the L14 and L15 series of ThinkPad models which will both start at $649.\n  As for the Lenovo ThinkPad E14 and E15 series, both will be available from June and come with a price tag starting at $639.\n  POST A COMMENT      No mention of T15? It seems odd they omitted it - either from the lineup or the press release. Either way that is odd.   Reply\n      it appears that while these AMD laptops will be better than the previous ones, OEMs still won’t go top of the line on any component. So, no high nits and/or wide color gamut displays, no Thunderbolt, none of the best SSD’s, etc.  There appear to be some high battery life, somewhat above average displays, mid range SSDs, and better cooling. Frustratingly though, rarely altogether in the same device. Baby steps.  Reply\n  I think we&#39;ll have to wait for USB4 in 2021 on AMD devices.  I believe there are a couple of laptops that have already paired Intel&#39;s thunderbolt controller with an AMD APU, but these are the exception.  Still, these are nice bits of kit, good for AMD, good for consumers and businesses.  Reply\n  OK, AMD has gotten me jonesing for a laptop in I don’t know how many years. But, The names from all the manufacturers are confusing me.  Even Googleing doesn’t make it really clear. What is the difference between the Ts and the X? Both seem to be high build quality slim ultraportable Thinkpads. Is the X even higher quality?  also, both the LMVE seems to be budget ThinkPad. I read that the L was done by the ThinkPad team, whereas the E comes from the Ideapad team. But, does that mean that there are differences that show up to the user?  Reply\n  change in my comment: “both the LMVE” should be “both the L and the E”  Reply\n  E series: budget line thinkpads, lacks many of the features that people associate with the brand.  T series: your default thinkpad. High end mid size meant for business. Has nice QoL features like internal roll cage and liquid drain holes so spilling coffee on the keyboard wont ruin the laptop. Comes in 14 and 15 inch models. The ones with s at the end are ultrabook versions. Generally less expandable but thinner and lighter.  X series: High end ultraportables. Usually offered with 12 and 13 inch screens.  L series: lower end than a T series but higher end than an E, same general size class as both.   Reply\n  E - Economy T - just get this one X - poseur level L - at least it&#39;s not an E  Reply", "posttime": "2020-05-08 01:31:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "mobile,thinkpad,amd", "title": "配备Ryzen 4000和4000 Pro Mobile的新联想ThinkPad系列", "title_en": "New Lenovo ThinkPad Range with Ryzen 4000 and 4000 Pro Mobile", "transed": 1, "url": "https://www.anandtech.com/show/15772/new-lenovo-thinkpad-range-with-ryzen-4000-4000-pro-mobile", "via": "", "real_tags": ["mobile", "thinkpad", "amd"]}, {"category": "", "categoryclass": "", "imagename": "7d75ebbd9b5774e814f9594bdf5975cb.gif", "infoid": 1001129, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这应该会让你不寒而栗：如果在冠状病毒大流行期间，互联网崩溃了怎么办？\n如果就在纽约市、底特律和新奥尔良的医疗危机开始螺旋式上升时，这些地方的互联网已经停止工作-一次一个小时，下午晚些时候几个小时？如果网速降到正常速度的一半会怎么样？如果它只像美国的卫生纸或N-95口罩分销系统那样起作用呢？\n“哦，天哪，”Kentik公司的首席执行官阿维·弗里德曼(Avi Freedman)说，该公司帮助Zoom和Dropbox等大客户最大化互联网性能，“一切都将结束。”\n现在，几乎整个国家似乎都在同时上网，我们中的许多人同时使用两到三个设备-用于紧急工作会议和与母亲交谈，用于大学化学讲座和邻里瑜伽课，用于杂货购物和疯狂观看视频。数字生活急于填补社会疏远造成的空白，允许一些表面上的常态，并保持经济的某些部分对商业开放。事实上，互联网让我们做的事情是人们愿意呆在家里并且能够做到的很大一部分原因。在这场危机中，在一定程度上，任何机构都能将美国社会紧密联系在一起，那就是互联网。\n在美国，美国最大的互联网提供商之一美国电话电报公司(AT&amp；T)的互联网流量从3月中旬开始几乎立即增长了20%。截至4月底，工作日的网络流量比1月和2月典型的周一至周五期间增加了25%，而且没有任何减弱的迹象。这听起来可能不是很多，但想象一下，突然需要立即在美国高速公路上增加20%的长途卡车，或者增加20%的货运列车，或者每天增加20%的航班离开美国的每个机场。事实上，这些基础设施系统都不可能立即提供20%的额外容量-或者在几个月内日复一日地维持这种能力。\n是的，有过打嗝的情况。弗里德曼指出，“我们不仅看到了流量的增加，而且还看到了短期停电的增加。”你的笔记本电脑-或者你试图在上面使用的应用程序-很可能会不时地提醒你，你的互联网连接很弱。但弗里德曼说，这并不令人惊讶，也不令人担忧，因为我们已经将增长“在一两年内发生，并将其压缩到六周内”。\n发生这一事件的故事可能不会涉及我们在新奥尔良或纽约看到的那种危及生命的英雄行为。但是，在美国对冠状病毒的反应中有如此多明显的功能障碍，作为这场流行病的无名英雄，互联网是值得欣赏的。它之所以继续存在，是因为外面的人们一直在保持它。互联网的表现不是偶然的，而是长期规划和适应能力、独创性和辛勤工作的结果-也是一些已经成为互联网本身个性一部分的特征。\nAT&amp；T拥有1810亿美元的收入，是目前为止美国最大的电信公司，也是第三大宽带互联网提供商，仅次于有线电视公司康卡斯特(Comcast)和查特通信公司(Charge Communications)。它也是最大的互联网流量载体之一，它还帮助管理互联网主干-隐藏光缆的关键高速公路，构成了互联网承载能力的主要部分，横跨美国，跨越大洋到达欧洲和亚洲。因此，当我试图理解为什么互联网没有在当前的压力下崩溃时，AT&amp；T似乎是一个很好的起点。\n互联网公司不会例行公事地披露自己的网络表现。但当我伸出援手时，美国电话电报公司(AT&amp；T)同意拉开帷幕，分享数据，并允许我采访关键员工。在某些方面，他们讲述的故事是美国电话电报公司(AT&amp；T)特有的，但在另一些方面，它描绘了整个行业的图景，揭示了这场流行病如何改变了我们对互联网的使用，以及它为保持互联网运行所采取的措施。\n在大流行前的世界里，工作日在互联网上相当平静。大多数正常的工作程序对网络要求不高：电子邮件、松弛消息、加载网站、共享文件。\n美国的网络流量通常会在晚上9点左右回升，因为我们中的数百万人开始使用Hulu或Netflix、迪士尼+或亚马逊Prime Video进行解压。Netflix在美国拥有6000万订户(其中许多是多用户会员)。Hulu拥有3000万订户，迪士尼+3000万，Prime Video 4000万。即使考虑到重叠，超过一半的美国人可以在任何一个特定的周二晚上观看流媒体视频。(一项研究显示，70%的美国家庭订阅了流媒体。)。而流媒体视频占用了大量的互联网带宽。随着人们收看节目，整个网络上的互联网流量每晚都会上升。\n美国电话电报公司(AT&amp；T)技术业务负责人克里斯·桑巴(Chris Sambar)表示：“过去，主干流量的高峰期是周六和周日晚上。”该部门拥有2.2万名员工，负责建设、维护和运营公司的全球网络。星期天晚上，美国人“不出门”。我们呆在家里看录像带和电影。周日晚上一直是交通流量的高潮期。“。至少到2020年3月中旬。\n3月13日(星期五)，美国电话电报公司(AT&amp；T)告诉员工，所有可以在家工作的人都应该开始在家工作。在接下来的周一，该公司超过三分之一的员工(约9万人)开始在厨房餐桌上工作。同一周，许多员工可以在家工作的公司也做了同样的事情。州和地方政府很快就下达了呆在家里的命令。桑巴尔说，很快，“我们开始看到本周中期的峰值。”在通常安静的白天和工作日的晚上，使用量都在急剧上升。“我们开始看到一周中有好几天相当于周日。”\n首先，数千万通常与同事或同学面对面会面的美国人现在通过互联网这样做，使用音频和视频会议、Skype、Zoom、FaceTime和Webex。突然之间，白天的互联网上充斥着高需求的视频流量。\n其次，所有这些联系都是从家里的餐厅桌子和沙发上建立起来的。市中心的大型写字楼，杂乱无章的办公园区-这些都有强大的互联网连接，因为有太多人依赖它们，而且一些工作职能(如股票交易)需要超快、超级响应的连接，而这些连接一点都不慢。住宅区则不会。\n美国电话电报公司(AT&amp；T；)的数据显示，在企业倒闭、人们开始在家工作后的一个月里，我们使用Wi-Fi作为初始连接的电话数量(即所谓的“Wi-Fi通话”)在白天几乎翻了一番。我们在家里跳上手机与同事交谈，通常电话认为蜂窝网络本身太忙了，最好使用Wi-Fi连接电话。\n在这同样的四周里，随着我们习惯了视频会议和背靠背电话会议这一新鲜的日常生活，AT&amp；T表示，在每个平台上，全网音频和视频会议的分钟数增加了5倍--这一惊人的跃升与每个人每天沉浸在Zoom中的情况一致。\n换句话说，我们一下子开始使用更多对数据要求更高的技术，而这些技术恰恰不是为处理这种需求而设计的。“这是一个事件，”桑巴说，“不同于我们所见过的任何事件。”\nA互联网总是说，这不是一个地方，无论你去哪里，都不仅仅有一条路线：众所周知，它是一个连接的网络。美国电话电报公司(AT&amp；T)的网站以一种奇怪的精确度报告说，每次你在其移动网络上拨打电话，都可以通过134条不同的路由进行转接。对于你通过网络进行的任何旅行来说，本质上都是如此。如果最佳路线出现问题，电话、电子邮件、亚马逊订单都会采取另一种方式。\n从这个意义上说，互联网很像美国的高速公路和公路系统。有几条通往家庭和企业的双车道小路。还有更大的次要道路，上面有更大的商业和住宅综合体。还有州际高速公路，那里的交通很长一段时间都很快，没有很多出入口。互联网拥有几乎完全相同的连接网络-跨越大陆、穿越大西洋和太平洋的大型、高速、大容量的连接网络；城市内部的中型连接网络；以及直接连接到个人家庭和企业的“最后一英里”连接。\n拥有通往任何给定目的地的多条路径是互联网原始设计的一部分，随着网络的扩展，这一特点一直被保留下来。这在很大程度上赋予了互联网适应性和弹性。就像关闭一条道路进行维修不会阻止人们开车去他们需要去的地方一样，特定的地方问题或互联网技术的中断通常不会导致交通脱轨。\n但同样的情况是，居民区的设计没有互联网高容量部分的容量和灵活性-就像居民区街道的设计没有I-95的容量一样。\n即使你有一条光纤连接到你的房子，它也和连接到办公楼完全不同。互联网和移动电话网络都仍然依赖于大量的中央交换局-模仿一个世纪前电话系统的中心局-从社区收集电话和互联网流量，并将它们路由到更大的网络中，反之亦然。你家的光纤连接是所谓的互联网“最后一英里”基础设施的一部分-从那些中央办公室到分支机构和小企业。在你自己的社区，“路线灵活性”比你所在的城市或地区要小-就像街道或电网一样。事实证明，最后一英里是今天许多互联网工程师和技术人员关注的问题。\n事实证明，互联网的另一个更新的元素在我们现在所处的时代是不可或缺的：云。我们所依赖的大部分软件和信息--我们的gmail收件箱、松弛频道、各种重要的企业和政府数据库--并没有存放在我们公司办公室24楼一扇锁着的门后面的一系列高柜里。它掌握在亚马逊(Amazon)和微软(Microsoft)、谷歌(Google)和IBM手中，在由专业数据辩论者运营的巨大设施中，他们拥有额外的巨大设施作为后备。当我们坐在键盘前访问数据时，亚马逊和IBM并不关心我们在哪里。这种云基础设施，再加上互联网自身连接网络的弹性，让我们在任何地方都可以自由地工作。\n过去不是这样的-你过去必须在工作和计算机都要做那项工作的大楼里。阿维·弗里德曼(Avi Freedman)说，20年前的互联网很难在类似大流行的危机中帮助我们。“与互联网在20世纪90年代最好的时候相比，我们现在最糟糕的时候表现要好得多。”\n云也有效率和额外的容量作为其操作结构的一部分-点击鼠标就能增加计算能力-因为在某个地方，谷歌和微软都有服务器在等待。事实上，这是他们为快速增长的数字公司提供的一部分：无需这些公司购买和配置自己的计算机，就可以立即增加容量。云意味着我们可以在任何地方做任何事情。\n事实证明，在大流行期间，互联网本身就是在家运行的东西之一。\nA已经在AT&amp；T工作了20年--她从客户服务开始，然后获得了电子工程学位，在过去的13年里，她一直是该公司的网络工程师。\n格雷厄姆可以看透互联网。当出现问题时-当车祸导致设备故障，当交换机或网络路由器出现故障-她可以点击进入不起作用的组件，并获得依赖该路由器或交换机的企业客户的列表，以及谁可能会失去互联网连接。\n这就是她的工作：保持商业客户的联系，如果可能的话，发现问题，并紧急提供维修服务。格雷厄姆没有直接与AT&amp；的客户交谈，但当问题爆发时，她会确保照顾这些客户的人知道发生了什么，通常是在公司IT部门弄清楚并打电话给AT&amp；T之前。\n格雷厄姆在美国电话电报公司(AT&amp；T；)的网络总部--位于荷兰隧道以西40英里的新泽西州贝德明斯特的全球技术运营中心(AT&amp；Ters称之为“Gee-tock”)--花了三年多的时间来做这件事。GTOC有一种任务控制的氛围：安静，昏暗的灯光，三排工作站面对着一堵12英尺高，250英尺宽的弧形视频墙，几乎相当于一个足球场的长度。这面墙由141个屏幕组成，向房间里的人们展示他们可能想要的关于AT&amp；网络和互联网的任何重要迹象。视频墙还显示实时天气数据和24小时新闻频道-因为天气和新闻通常会告诉你互联网即将发生什么事情。GTOC一年中每天都有三班制；在里面，凌晨2点。和下午2点。不要觉得有什么不同(尽管我们对网络的使用是不同的)。\n格雷厄姆最近在达拉斯的GTOC的一个较小的版本中工作，做着她在贝德明斯特所做的同样的工作。从3月16日星期一开始，她开始登录她的常规班次，从早上5：30开始。到下午2点，从她的起居室。\n格雷厄姆可以发现网络中的拥堵-指示器是红色的而不是绿色的，就像你在谷歌地图上的路线在事情放慢时是红色的。但现在，格雷厄姆不再关注她的商业客户聚集的城市、市中心、摩天大楼和办公园区，而是关注郊区-这些客户的员工现在居住和工作的地方。\n“地方层面现在是商业层面，”她说，“这是非常不同的。我们非常清楚人们感受到的压力。“。每个人都需要手机和笔记本电脑来保持联系；我们每个人都成了自己的IT帮助台。“前几天，就在德克萨斯州，我们的U-Verse中断了”--AT&amp；T的住宅互联网服务，相当于Verizon Fios。网络中的以太网卡出现故障。格雷厄姆说：“大约有1000名客户减少了。”“这是非常例行公事的。”当然，如果你是这些客户中的一员，这并不令人愉快，但这与短暂的电力故障没有太大区别。\n互联网现在是如此复杂，流量现在是如此巨大和快速，以至于在美国电话电报公司(AT&amp；T)和其他管理互联网的公司，大部分管理都是自动化的。该网络使用人工智能来提高效率；它在备份和停机时重新路由。所有这一切都由网络工程师监督，但调整的速度比大多数情况下人类所能跟上的速度都要快。\n然而，该网络通常不会被编程为在小区小故障时重新路由流量-部分原因是涉及的用户太少，部分原因是网络的最后一英里部分没有太大的灵活性。\n格雷厄姆说，当这一特殊的本地停电发生在中午时，“我从我们的一名销售代表那里得到了一条消息。”该社区是美国五大银行之一的员工的聚集地-数百名无法连接的家庭用户。通常情况下，AT&amp；T的技术人员需要几个小时才能到达正确的中心局并更换损坏的电路板。在一个典型的工作日，可能有120人在附近的家里，AT&amp；T会认为这是一个合理的维修速度。\n格雷厄姆说：“但现在这是一个更大的问题。”从本质上讲，它是一座虚拟银行办公楼，里面有数百名无法胜任工作的人。“我们不会接受这样的停电，并试图正常改变路线。”但在这种情况下，她和她的团队能够找到一种方法来做到这一点，所以在实际物理修复之前恢复了互联网服务。\n整个互联网和AT&amp；T网络部分的流量激增是非同寻常的，20%的增幅并不能完全捕捉到这一点。美国电话电报公司(AT&amp；)的网络每天额外承载71PB的数据。71拍字节是多少钱？相比之下，2014年底，美国电话电报公司(AT&amp；T)的总网络流量为每天56PB；在短短几周内，美国电话电报公司每天接收的新流量就超过了6年前的总流量。(在大流行期间，AT&amp；T网络每天大约传输426拍字节--1拍字节相当于100万GB。)。\n这给该公司带来了压力，要求其确保在任何给定时间通过网络的路线尽可能多地开放和不拥堵。随着互联网使用的地理位置发生变化，该公司还争先恐后地在需要的地方增加容量。例如，在3月份的某个时候，芝加哥和亚特兰大的流量增长如此之快，以至于这两个城市的数十名技术人员和工程师通宵工作，添加了新的光纤连接和路由器。AT&amp；T网络负责人桑巴(Sambar)表示，AT&amp；T的网络被设计成“有足够的净空空间”。“但我们在全国各地都在玩打地鼠游戏。”\n大流行没有破坏互联网的最简单解释是，互联网从一开始就被设计为牢不可破。(互联网的早期先驱，ARPANET，旨在通过重新路由网络信号来在核攻击中幸存下来。)。\n这一原则仍然影响着它的建造方式，也影响着它的管理和维护方式。美国电话电报公司(AT&amp；T)等网络公司和亚马逊(Amazon)等云公司致力于将中断和减速降至最低，即使在正常环境下也是如此。这一点反映在员工和基础设施等资源的绝对数量上。\n可靠性-“正常运行时间”-是宽带世界的一个关键卖点；互联网服务提供商为确保这一点而配备了工作人员。他们建立了过剩的产能，以便能够有效地应对危机，并远远领先于互联网需求的惊人增长。在这个过程中，互联网近乎完美的正常运行时间已经成为互联网本身的一个操作特征-这一假设内置于我们的各种日常使用中，从管理电网和航空旅行等关键任务系统，到在Slake上发送消息以及流媒体音乐和视频。企业和政府机构-以及我们每个人-都假设了一种无处不在的连接。\n这种设计理念与美国其他经济领域的运作方式截然不同。这场大流行向我们展示了完美优化系统的不利之处--从ICU床位和病毒采样棉签的供应，到面包师酵母的可获得性。我们一直极度缺乏这三样东西，正是因为我们花了数年时间调整供应链，所以我们现在只有我们现在可以使用的量，而不会出现空置的ICU床位或闲置的棉签制作机的“浪费”。通过这种方式，拯救了互联网的东西-冗余、灵活性、过剩容量-不仅反映了一种不同的设计理念，也反映了一种不同的潜在经济理念。\nA代表灾难。去年5月，该公司进行了一场内部战争游戏，内容是大流行将如何影响其保持电话和互联网服务运行的能力。该公司经常进行这些演习，试图做好准备-。\n..", "note_en": "H  that should make you shudder: What if, in the midst of the coronavirus pandemic, the internet had buckled?\n What if, just as the medical-care crisis started to spiral in New York City, in Detroit, in New Orleans, the internet in those places had stopped working—an hour at a time, a couple of hours in the late afternoon? What if the internet had slowed to half its normal speed? What if it had worked only as well as the U.S. distribution system for toilet paper or N-95 masks did?\n   “Oh my God,” says Avi Freedman, the CEO of Kentik, a company that helps big customers such as Zoom and Dropbox maximize internet performance, “it would all be over.”\n Almost the entire nation now seems to be online at the same time, many of us using two or three devices at once—for urgent work meetings and talking with Mom, for college chemistry lectures and neighborhood yoga classes, for grocery shopping and video binge-watching. Digital life has rushed to fill the gaps created by social distancing, allowing some semblance of normalcy and keeping some parts of the economy open for business. Indeed, the things the internet lets us do are a big part of the reason people are comfortable staying confined to home, and are able to. To the degree that any institution is keeping American society knitted together during this crisis, it’s the internet.\n    In the United States, internet traffic carried by AT&amp;T, one of the nation’s largest internet providers, rose almost immediately by 20 percent starting in mid-March. By the end of April, network traffic during the workweek was up 25 percent from typical Monday-to-Friday periods in January and February, and showed no signs of fading. That may not sound like much, but imagine suddenly needing to add 20 percent more long-haul trucks to U.S. highways instantly, or 20 percent more freight trains, or 20 percent more flights every day out of every airport in the country. In fact, none of those infrastructure systems could have provided 20 percent more capacity instantly—or sustained it day after day for months.\n  Yes, there have been hiccups. Freedman notes that “we are seeing an increase not only in traffic, but in short-duration outages.” Your laptop—or the apps you’re trying to use on it—may well be advising you, from time to time, that your internet connection is weak. But that’s hardly surprising, or alarming, Freedman says, given that we’ve taken growth “that would happen over a year or two and compressed it into six weeks.”\n  The story of how that happened may not involve the sort of life-threatening heroics we’ve seen from medical personnel in New Orleans or New York. But amid so much highly visible dysfunction in the American response to the coronavirus, it’s worth appreciating the internet as an unsung hero of the pandemic. It has stayed on because people out there are keeping it on. The internet’s performance is no accident, but rather the result of long-term planning and adaptability, ingenuity and hard work—and also some characteristics that have become part of the personality of the internet itself.\n W and $181 billion in revenue, AT&amp;T is the nation’s largest telecom company by far, and the third-largest broadband-internet provider, after the cable companies Comcast and Charter Communications. It is also one of the largest carriers of internet traffic, and it helps manage the internet backbone—the crucial superhighway of hidden fiber-optic cables that form the bulk of the internet’s carrying capacity, spanning the U.S. and crossing the oceans to Europe and Asia. So as I tried to understand why the internet hasn’t buckled under the current strain, AT&amp;T seemed like a good place to start.\n  Internet companies don’t routinely reveal their own network performance. But when I reached out, AT&amp;T agreed to pull back the curtain, sharing data and allowing me to interview key staff. In some ways, the story they told is particular to AT&amp;T, but in others, it paints a picture of the industry as a whole, revealing how the pandemic has changed our use of the internet, and also what it has taken to keep the internet running.\n    In the pre-pandemic world, weekdays on the internet were pretty placid. Most of the normal routines of work are undemanding for the network: emails, Slack messages, loading websites, sharing files.\n  Web traffic in the U.S. would typically pick up around 9 p.m., as millions of us settled in to decompress with Hulu or Netflix, Disney+ or Amazon Prime Video. Netflix has 60 million U.S. subscribers (and many are multiuser memberships). Hulu has 30 million subscribers, Disney+ 30 million, Prime Video 40 million. Even accounting for overlap, more than half of Americans can watch streaming video on any particular Tuesday night. (One study says that 70 percent of U.S. households have a streaming subscription.) And streaming video takes huge amounts of internet bandwidth. Internet traffic across the network rises each night as people tune in.\n  “The peak in backbone traffic used to be Saturday and Sunday nights,” said Chris Sambar, who runs AT&amp;T’s technology operations, a division with 22,000 employees who build, maintain, and operate the company’s global network. On Sunday nights, Americans “don’t go out. We stay home and watch videos and movies. Sunday night has always been the high-water mark for traffic.” At least until mid-March 2020.\n On Friday, March 13, AT&amp;T told its employees that everyone who could should start working from home, and the following Monday, more than a third of the company’s staff—some 90,000 people—reported to work from their kitchen table. That same week, lots of companies with employees who could work from home did the same. Stay-at-home orders soon followed from state and local governments. Immediately, Sambar said, “we started to see peaks in the middle of the week.” Use was rising sharply during the normally quiet daytime hours, and also on weekday evenings. “We started seeing multiple days during the week equivalent to Sunday.”\n   First, tens of millions of Americans who normally met face-to-face with colleagues or classmates were now doing so over the internet, using audio- and videoconferencing, Skype, Zoom, FaceTime, Webex. All of a sudden, the daytime internet was filling up with high-demand video traffic.\n And second, all those connections were being made from dining-room tables and couches at home. Big downtown office buildings, sprawling office parks—those have robust internet connections because so many people rely on them, and because some work functions (such as stock trading) require superfast, super-responsive connections that don’t slow at all. Residences do not.\n In the month since businesses closed and people started working from home, AT&amp;T data show that the amount of phone calling we did using Wi-Fi as the initial connection (so-called “Wi-Fi calling”) nearly doubled during the day. We were jumping on our cellphones at home to talk with our colleagues, and often the phone was deciding that the cellular network itself was so busy that it was best to use Wi-Fi to connect the call.\n    And in those same four weeks, as we settled in to the fresh daily routine of video meetings and back-to-back conference calls, AT&amp;T says the number of minutes of audio- and videoconferencing across the network, on every platform, went up fivefold—an astonishing jump that squares with everyone’s daily Zoom immersion.\n In other words, we began using much more data-demanding technologies, all at once, in precisely the place not designed to handle that kind of demand. “This is an event,” Sambar said, “unlike anything we’ve ever seen.”\n A  the internet always say, it’s not one place, and no matter where you’re going, there is not just one route: It is, famously, a web of connections. AT&amp;T’s website reports, with an air of odd precision, that every time you make a call on its mobile network, the call can be connected by 134 different routes. The same is essentially true of any journey you take through the web. If something goes wrong on the best route, the call, the email, the Amazon order takes another.\n  In that sense, the internet is very much like the highway-and-road system in the U.S. There are small two-lane roads that lead to homes and businesses. There are larger, secondary roads that have larger businesses and residential complexes on them. And there are interstate highways, where the traffic goes fast for long distances without a lot of entrances and exits. The internet has almost exactly the same network of connections—big, high-speed, high-volume ones that cross continents and pass under the Atlantic and Pacific Oceans; medium-size ones inside cities; and “last mile” connections directly to individual homes and businesses.\n Having many paths to any given destination is part of the internet’s original design, a characteristic that’s been retained as the network has expanded. It’s much of what gives the internet its adaptability and resilience. Just as the closure of a single road for maintenance doesn’t prevent people from driving where they need to go, so specific local problems or outages in internet technology don’t typically derail traffic.\n  But it’s also the case that residential areas aren’t designed with the capacity and flexibility of the higher-capacity sections of the internet—any more than a residential street is designed with the capacity of I-95.\n Even if you have a fiber-optic connection right to your house, it’s nothing like the connection to an office building. The internet and the mobile-phone network both still rely on a huge array of central switching offices—modeled on the central offices of the telephone system from a century ago—that collect calls and internet traffic from neighborhoods and route them into the larger network, and vice versa. Your home’s fiber-optic connection is part of what’s called the “last mile” infrastructure of the internet—leading from those central offices out to subdivisions and small businesses. In your own neighborhood, there’s less “route flexibility” than in your city or region—just as there is with streets or the electric grid. And it’s turned out that the last mile is what’s preoccupying many internet engineers and technicians today.\n    Another, more recent element of the internet has turned out to be indispensable for the moment we’re in: the cloud. Much of the software and information that we rely on—our Gmail inboxes, Slack channels, all kinds of essential corporate and government databases—isn’t stored away in a series of tall cabinets behind a locked door on the 24th floor of our company’s office. It’s in the hands of Amazon and Microsoft, Google and IBM, in enormous facilities run by professional data wranglers, who have additional enormous facilities as backup. Amazon and IBM don’t care where we are when we sit at our keyboards and access the data. This cloud infrastructure, combined with the resilience of the internet’s own web of connections, frees us to do our work wherever we happen to be.\n  It didn’t used to be that way—you used to have to be in the building where both the work and the computers were to do that work. The internet of 20 years ago, Avi Freedman says, would have struggled to help us in a crisis similar to the pandemic. “We are performing right now much better at our worst than the internet did at its best in the 1990s.”\n  The cloud, too, has efficiency and extra capacity built in as part of its operating structure—the ability to add computing capacity at the click of a mouse—because somewhere, Google and Microsoft have servers waiting. That is part of what they offer fast-growing digital companies, in fact: the power to add capacity instantly, without those companies having to buy and configure their own computers. The cloud means that we can do everything from anywhere.\n And it turns out that, during the pandemic, among the things being run from home is the internet itself.\n A  has been at AT&amp;T for two decades—she started in customer service, then got an electrical-engineering degree, and for the past 13 years she’s been a network engineer for the company.\n Graham can see into the internet. When something goes wrong—when a car accident takes out a piece of equipment, when a switch or a network router fails—she can click through to the component that’s not working and get a list of the business customers who are relying on that router or switch, and who might be losing their internet connection.\n  That’s her job: to keep business customers connected, to see the problems coming if she can and scramble repair service. Graham doesn’t talk directly with AT&amp;T’s customers, but when trouble erupts, she makes sure the people who take care of those customers know what’s happening, often before corporate IT departments figure it out and call AT&amp;T.\n Graham spent more than three years doing that at AT&amp;T’s network headquarters, the Global Technology Operations Center (which AT&amp;Ters call the “Gee-tock”) in Bedminster, New Jersey, 40 miles west of the Holland Tunnel. The GTOC has the air of mission control: quiet, dimly lit, with three rows of workstations facing a curved video wall that is 12 feet tall and 250 feet wide, almost the length of a football field. The wall is composed of 141 screens showing the people in the room any kind of vital sign about AT&amp;T’s network, and the internet, that they might want. The video wall also shows real-time weather data and the 24-hour news channels—because the weather and the news often tell you when something is about to happen to the internet. The GTOC has three shifts, every day of the year; inside, 2 a.m. and 2 p.m. don’t feel that different (although our use of the network is).\n    Graham more recently has worked in a smaller version of the GTOC in Dallas, doing the same job she did in Bedminster. Starting Monday, March 16, she began logging on for her regular shift, from 5:30 a.m. to 2 p.m., from her living room.\n Graham can spot congestion in the network—the indicators are red instead of green, just as your route in Google Maps is red when things slow down. But now, instead of watching the cities, the downtowns, the skyscrapers, and the office parks where her business customers are clustered, Graham is watching the suburbs—where the employees of those customers live, and now work.\n “The local level is the business level now,” she said, “which is very different. We’re very aware of the stress that people are feeling.” Everyone needs their phone and laptop to stay connected; each of us has become our own IT help desk. “The other day, right here in Texas, we had an outage of U-verse”—AT&amp;T’s residential internet service, the equivalent of Verizon Fios. An ethernet card in the network had failed. “About 1,000 customers down,” Graham said. “It’s very routine.” It’s not pleasant, of course, if you’re one of those customers, but it’s not much different from a brief electric-power failure.\n  The internet is now so complicated, the traffic is now so enormous and fast-moving, that at AT&amp;T and other companies that manage the internet, much of that management is automated. The network uses artificial intelligence to improve efficiency; it reroutes around backups and outages. All this is watched over by network engineers, but adjusted more quickly than human beings would be able to keep up with in most circumstances.\n  The network isn’t typically programmed to reroute traffic for small neighborhood outages, though—partly because so few users are involved, partly because that last-mile part of the network doesn’t have much flexibility.\n  When this particular local outage happened at midday, Graham said, “I got a message from one of our sales reps.” The neighborhood is home to a huge concentration of employees from one of the five largest banks in the U.S.—hundreds of at-home users who couldn’t connect. It would normally take a couple of hours for an AT&amp;T tech to get to the right central office and swap out the bad circuit board. And on a typical weekday, with maybe 120 people at home in that neighborhood, AT&amp;T would consider that a reasonable pace of repair.\n  “But now that’s a bigger deal,” Graham said. It was, in essence, a virtual bank office building with hundreds of people who couldn’t do their jobs. “We wouldn’t take an outage like that and try to reroute it normally.” But in this case, she and her team were able to find a way to do that, so internet service was restored before the actual physical repair could be made.\n    The surge in traffic, on the internet as a whole and on AT&amp;T’s part of the network, is extraordinary in a way that the phrase  20 percent increase doesn’t quite capture. AT&amp;T’s network is carrying an extra 71 petabytes of data every day. How much is 71 petabytes? One comparison: Back at the end of 2014, AT&amp;T’s  total network traffic was 56 petabytes a day; in just a few weeks, AT&amp;T has accommodated more  new traffic every day than its total daily traffic six years ago. (During the pandemic, the AT&amp;T network has been carrying about 426 petabytes a day—one petabyte is 1 million gigabytes.)\n That puts pressure on the company to ensure that as many routes through the web as possible are open and uncongested at any given time. And the company also has scrambled to add capacity where it’s needed as internet usage has shifted geographically. At one point in March, for instance, traffic was rising so fast in Chicago and Atlanta that dozens of technicians and engineers in those cities worked all night, adding fresh fiber connections and routers. AT&amp;T’s network is designed “to have plenty of headroom,” said Sambar, the network chief. “But we are playing whack-a-mole all over the country.”\n  The simplest explanation for why the pandemic hasn’t broken the internet is that the internet was designed to be unbreakable, at the very beginning. (The early precursor to the internet, ARPANET, was designed to survive a nuclear attack by rerouting network signals.)\n That principle still infuses the way it is built, and also the way it is managed and maintained. And it’s reflected in the sheer number of resources—staff and infrastructure—that network companies such as AT&amp;T and cloud companies such as Amazon devote to minimizing interruptions and slowdowns, even in a normal environment.\n Reliability—“uptime”—is a key selling point in the broadband world; internet-service providers staff up to ensure it. They build in excess capacity to enable an effective response to crises, and to stay well ahead of the astonishing growth of internet demand. In the process, the internet’s near-perfect uptime has become an operating characteristic of the internet itself—an assumption built into all kinds of our daily uses, from managing mission-critical systems such as power grids and air travel to sending messages on Slack and streaming music and video. Businesses and government institutions—and each of us, as well—assume an always-on connection that reaches everywhere.\n   That design philosophy is very different from the way much of the rest of the U.S. economy operates. The pandemic has shown us the downside of perfectly optimized systems—from the supply of ICU beds and virus-sampling swabs to the availability of baker’s yeast. We’ve been desperately short of all three of those things precisely because we’ve spent years tweaking supply chains so we have only exactly the amount we can use right now, without the “waste” of empty ICU beds or idle swab-making machines. In that way, what has saved the internet—redundancy, flexibility, excess capacity—reflects not just a different design philosophy, but a different underlying economic philosophy as well.\n    A  for disaster. Last May, the company ran an internal war game on how a pandemic would affect its ability to keep phone and internet service running. The company does these exercises routinely to try to get ready—\n......", "posttime": "2020-05-08 01:31:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "关闭,running,互联网", "title": "互联网是如何在周围的社会关闭的情况下继续运行的", "title_en": "How the internet kept running even as society closed down around it", "transed": 1, "url": "https://www.theatlantic.com/ideas/archive/2020/05/miracle-internet-not-breaking/611212/", "via": "", "real_tags": ["关闭", "running", "互联网"]}, {"category": "", "categoryclass": "", "imagename": "47fea57b740c7121cf613ca163872d3b.jpeg", "infoid": 1001128, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": ".bigTop__review{不透明度：0；}.bigTop__VideoPlayerBox{位置：绝对；}.bigTop__VideoPlayerBox--被动{宽度：100%；高度：100%；顶部：0；左侧：0；不透明度：0；/*z索引：-1；*/}.bigTop__VideoPlayerBox--回退{位置：相对；z索引：0；}.bigTop__VideoPlayerBox--。不透明度：1；z-index：1；}.bigTop__VideoPlayer{位置：相对；填充-底部：56.25%；}.bigTop__codeholder{显示：无；}.bigTop__幻灯片显示{光标：指针；位置：绝对；底部：0；右侧：0；背景色：#FFF；填充：10px；宽度：300px；}.bigTop__button{边框宽度：2px；边框样式：实心；font。文本转换：大写；字体大小：12px；字母间距：1px；光标：指针；页边距：0；填充：6px 15px；框大小：边框；过渡：颜色300ms，背景颜色300ms；}.bigTop_button--嵌入{背景：透明；颜色：#FFF；边距：30px自动20px；最小宽度：175px；边框颜色：#FFF；}.bigTop_button--嵌入：ho.。边框颜色：#333；背景颜色：#fff；}.bigTop__button--黑色：悬停{color：#fff；back-color：#333；}.bigTop__Button--内联{空边距：15px 0；}.bigTop__Atmotional{填充：0；边距：0；背景大小：1px 1px；背景位置：-1px-1px；}.bigTop__atomalic：空{paddingBottom：0；背景大小：1px 1px；背景位置：-1px-1px；}.bigTop__atumular：空{paddingBottom：}.bigTop__大气视频，.bigTop__大气img{宽度：100%；显示：块；填充：0；页边距：0；}/*终端媒体css*//*caption/credit*/.bigTop__captioncredit{显示：块；字体系列：&#34；视网膜&#34；，Helvetica，宋体，无衬线；颜色：#666；边距：5px auto 0；填充：0 10px；框大小：边框；}.bigTop__Caption{font-size：14px；line-high：20px；font-weight：300；display：inline；}.bigTop_Credit{font-size：14px；line-high：20px；font-weight：300；text-change：uppercase；display：inline；}/*结束字幕/信用*//*视频播放按钮*/.bigTop__play{宽度：50px；高度：50px；光标：指针；边框：1px#999实心；背景颜色：RGBA(0，0，0，0.7)；边框半径：50%；文本缩进：-9999px；显示：块；框大小调整。.bigTop__play，.bigTop__VideoPlayerBox：HOVER+.bigTop__PLAY--独立，.bigTop__PLAY--HOVER{背景颜色：#0080c3；边框颜色：#0080c3；}.bigTop__PLAY：之前{宽度：0；高度：0；边框-顶部：11px纯色透明；边框-底部：12px纯色透明；边框-左边：18px实体#fff；内容：&#34；}.bigTop__VideoTrigger{光标：指针；宽度：100%；高度：100%；位置：绝对；顶部：0；左侧：0；}.bigTop__play--独立{位置：绝对；顶部：50%；左侧：50%；Transform：TranslateY(-50%)TranslateX(-50%)；-webkit-Transform：TranslateY(-50%)TranslateX(-50%)；Pointer-Events：None；}/*视频按钮*//*/.bigTopPage_Grid{padding：0 10px；框大小：边框大小：边框；左页边距：自动；右页边距：自动；}/*结束页面网格**/*/.plitTop.bigTop__rel{背景颜色：#222；}.plitTop.bigTop__text，.plitTop.bigTop__flash，.plitTop.bigTop__flash：link，.plitTop.。}.plitTop.bigTop--lightTheme.bigTop__rel{Background-color：#fff；}.plitTop.bigTop--lightTheme.bigTop__text，.plitTop.bigTop--lightTheme.bigTop_flash，.plitTop.bigTop--lightTheme.bigTop__flash：link，.plitTop.bigTop--lightTheme.bigTop_hed，.plitTop.bigTop。}.拆分顶部.bigTop__overlay--Bottom，.plitTop.bigTop__overlay--顶部{背景：初始；}.拆分顶部.bigTop__media{浮动：右；宽度：50%；}.拆分顶部.bigTop__captionCredit{文本对齐：右；颜色：#666；}.拆分顶部.bigTop__text.bigTop__text--底部，.plitTop.bigTop__text.bigTop_text--变换：平移(-50%，-50%)；-webkit-Transform：翻译(-50%，-50%)；宽度：50%；最小高度：初始；填充：0 30px；}.edit-Japan.plitTop.bigTop__hed，.edit-Japan.plitTop.bigTop__dek{text-align：Left；}/*仅限4个单元*/@媒体(最大宽度：639px){.plitTop.bigTop__rel{paddingTop：15px；}.plititOnly(最大宽度：639px){.plitTop.bigTop__rel{padd-Bottom：15px；}.plititOnly。}.plitTop.bigTop__captionCredit{text-align：Left；color：#f4f4f4；}.plitTop.bigTop--lightTheme.bigTop__captionCredit{color：#666；}.plitTop.bigTop__text.bigTop__text--Bottom，.plitTop.bigTop__text.bigTop__text--Bottom{positi", "note_en": ".bigTop__preview { opacity: 0;}.bigTop__videoPlayerBox { position: absolute;}.bigTop__videoPlayerBox--passive { width: 100%; height: 100%; top: 0; left: 0; opacity: 0; /*z-index: -1;*/}.bigTop__videoPlayerBox--fallback { position: relative; z-index: 0;}.bigTop__videoPlayerBox--fallback .videoHint { display: none !important;}.bigTop__videoPlayerBox--active { width: 100%; height: 100%; top: 0; left: 0; opacity: 1; z-index: 1;}.bigTop__videoPlayer { position: relative; padding-bottom: 56.25%;}.bigTop__codeholder { display: none;}.bigTop__slideshow { cursor: pointer; position: absolute; bottom: 0; right: 0; background-color: #fff; padding: 10px; width: 300px;}.bigTop__button { border-width: 2px; border-style: solid; font-family: &#39;Retina&#39;, Helvetica, Arial, sans-serif; font-weight: 600; text-transform: uppercase; font-size: 12px; letter-spacing: 1px; cursor: pointer; margin: 0; padding: 6px 15px; box-sizing: border-box; transition: color 300ms, background-color 300ms;}.bigTop_button--embedded { background: transparent; color: #fff; margin: 30px auto 20px; min-width: 175px; border-color: #fff;}.bigTop_button--embedded:hover { color: #333; background-color: #fff;}.bigTop__button--black { color: #333; border-color: #333; background-color: #fff;}.bigTop__button--black:hover { color: #fff; background-color: #333;}.bigTop__button--inline { margin: 15px 0 0;}.bigTop__atmospheric { padding: 0; margin: 0; background-size: 1px 1px; background-position: -1px -1px;}.bigTop__atmospheric:empty { padding-bottom: 56.25%; background-color: #000; background-size: cover; background-repeat: no-repeat;}.bigTop__atmospheric video,.bigTop__atmospheric img { width: 100%; display: block; padding: 0; margin: 0;}/******** end media CSS *******//******************caption/credit********************/.bigTop__captioncredit { display: block; font-family: &#34;Retina&#34;, Helvetica, Arial, sans-serif; color: #666; margin: 5px auto 0; padding: 0 10px; box-sizing: border-box;}.bigTop__caption { font-size: 14px; line-height: 20px; font-weight: 300; display: inline;}.bigTop__credit { font-size: 14px; line-height: 20px; font-weight: 300; text-transform: uppercase; display: inline;}/******** end caption/credit ******//******** Video Play Button *********/.bigTop__play { width: 50px; height: 50px; cursor: pointer; border: 1px #999 solid; background-color: rgba(0, 0, 0, 0.7); border-radius: 50%; text-indent: -9999px; display: block; box-sizing: border-box;}.bigTop__videoPlayerBox:hover + .bigTop__text &gt; .bigTop__play,.bigTop__videoPlayerBox:hover + .bigTop__play--standalone,.bigTop__play--hover { background-color: #0080c3; border-color: #0080c3;}.bigTop__play:before { width: 0; height: 0; border-top: 11px solid transparent; border-bottom: 12px solid transparent; border-left: 18px solid #fff; content: &#34; &#34;; position: absolute; display: block; margin-top: 13px; margin-left: 18px;}.bigTop__videoTrigger { cursor: pointer; width: 100%; height: 100%; position: absolute; top: 0; left: 0;}.bigTop__play--standalone { position: absolute; top: 50%; left: 50%; transform: translateY(-50%) translateX(-50%); -webkit-transform: translateY(-50%) translateX(-50%); pointer-events: none;}/***** Video Button *****//********************Make bigTop align to page grid***********************/.bigTopPage__grid { padding: 0 10px; box-sizing: border-box; margin-left: auto; margin-right: auto;}/*** end page grid **//********************splitTop styling***********************/.splitTop .bigTop__rel { background-color: #222;}.splitTop .bigTop__text,.splitTop .bigTop__flash,.splitTop .bigTop__flash:link,.splitTop .bigTop__hed,.splitTop .bigTop__dek { color: #fff;}.splitTop.bigTop--lightTheme .bigTop__rel { background-color: #fff;}.splitTop.bigTop--lightTheme .bigTop__text,.splitTop.bigTop--lightTheme .bigTop__flash,.splitTop.bigTop--lightTheme .bigTop__flash:link,.splitTop.bigTop--lightTheme .bigTop__hed,.splitTop.bigTop--lightTheme .bigTop__dek { color: #000;}.splitTop .bigTop__overlay { background-color: transparent;}.splitTop .bigTop__overlay--bottom,.splitTop .bigTop__overlay--top { background: initial;}.splitTop .bigTop__media { float: right; width: 50%;}.splitTop .bigTop__captioncredit { text-align: right; color: #666;}.splitTop .bigTop__text.bigTop__text--bottom,.splitTop .bigTop__text.bigTop__text--top { position: absolute; top: 50%; bottom: auto; left: 25%; transform: translate(-50%, -50%); -webkit-transform: translate(-50%, -50%); width: 50%; min-height: initial; padding: 0 30px;}.edition-japan .splitTop .bigTop__hed,.edition-japan .splitTop .bigTop__dek { text-align: left;}/* 4 unit only */@media (max-width: 639px) { .splitTop .bigTop__rel { padding-bottom: 15px; } .splitTop .bigTop__media { float: none; width: 100%; } .splitTop .bigTop__captioncredit { text-align: left; color: #f4f4f4; } .splitTop.bigTop--lightTheme .bigTop__captioncredit { color: #666; } .splitTop .bigTop__text.bigTop__text--bottom, .splitTop .bigTop__text.bigTop__text--bottom { position: relative; width: auto; top: auto; left: auto; margin: 40px 20px; padding: 0; transform: none; -webkit-transform: none; } .bigTop__flash.flashlineSVG { margin-left: 0; }}/* 4, 8 unit splitTop font styling */@media (max-width: 979px) { .splitTop .bigTop__text .bigTop__hed { font-size: 32px; line-height: 1.12; } .wsj-modern span.bigTop__flash.flashlineSVG { text-indent: 215px; } .splitTop .bigTop__text .bigTop__dek { font-size: 16px; line-height: 1.38; }}/* 12, 16 unit splitTop font styling */@media (min-width: 980px) { .splitTop .bigTop__text .bigTop__hed { font-size: 52px; line-height: 1; } .splitTop .bigTop__text .bigTop__dek { font-size: 20px; line-height: 1.3; }}/*** end splitTop styling **//*****SECTION SPECIFIC STYLING***/.magazine .bigTop__flash,.magazine .bigTop__flash:link,.magazine .bigTop__flash:visited,.magazine .bigTop__flash:active { font-family: &#39;Retina Wide&#39;, &#39;Retina Narrow&#39;, &#39;Retina&#39;, &#39;Arial&#39;, sans-serif;}.magazine .bigTop__hed { font-weight: 400;}.magazine .bigTop__dek { font-family: &#39;Exchange&#39;, &#39;Chronicle SSm&#39;, Georgia, serif;}/***************Set via media query and not via classesto prevent page jump/rerenderPreviously set via CSS classes, e.g. bigTop__text--static, bigTop__hed-s,but it took too long for the page to &#34;settle&#34;**//* 4 unit only */@media (max-width: 639px) { .bigTopHide--4, .bigTop__flash.bigTopHide--4 { display: none; } .bigTop { margin: 0 0 20px; } .bigTop__overlay { display: none; } .bigTop__media--image { padding-bottom: 66.77%; } .bigTop__text { position: static; margin-top: 15px; text-align: left; margin-left: 10px; margin-right: 10px; width: auto; } .bigTop__overlay { display: none; } .bigTop__flash, .bigTop__flash:link, .bigTop__flash:active, .bigTop__flash:visited { color: #0080c3; text-align: left; } .bigTop__hed { font-size: 32px; line-height: 1.125; color: #000; text-align: left; } .bigTop__dek { font-size: 17px; line-height: 24px; color: #666; text-align: left; } .bigTop__flash + .bigTop__hed { margin-top: 4px; } .bigTop__hed + .bigTop__dek { margin-top: 1px; } .bigTop__dek:last-child { margin-bottom: 15px; } .bigTop__hed:last-child { margin-bottom: 14px; } .bigTop_button--embedded { margin: 15px 0 10px; color: #000; border-color: #000; min-width: 150px; } .bigTop_button--embedded:hover { background-color: #000; color: #fff; } .bigTop__text--flex &gt; .bigTop__play, .bigTop__play--standalone { position: absolute; top: 28vw; /* half of bottom padding of video elem */ left: 50%; transform: translateY(-50%) translateX(-50%); -webkit-transform: translateY(-50%) translateX(-50%); pointer-events: none; } .bigTop__videoTrigger { height: 0; padding-bottom: 56.25%; } .bigTop__flash.flashlineSVG { background-size: contain; } .wsj-modern .bigTop__text span:before { margin-left: 10px; }}/* 8 unit */@media (min-width: 640px) and (max-width: 979px) { .bigTop__captioncredit, .bigTop__text { max-width: 640px; } .wsj-modern .splitTop span.bigTop .bigTop__flash.flashlineSVG { min-width: 282px; } .bigTop__text.bigTop__text--bottom { box-sizing: border-box; min-height: 40%; top: auto; bottom: 0; padding-bottom: 10px; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); box-sizing: border-box; } .wsj-modern .bigTop span.bigTop__flash.flashlineSVG { max-width: 239px; min-height: 15px; max-height: 15px; min-width: 350px; } .wsj-modern .splitTop.bigTop span.bigTop__flash.flashlineSVG { min-width: 279px; } .bigTop__text.bigTop__text--top { top: auto; bottom:60%; max-height: 40%; padding-top: 10px; box-sizing: border-box; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); } .bigTop__hed { font-size: 42px; line-height: 1.095; } .bigTop__hed + .bigTop__dek { margin-top: 9px; } .bigTop__flash + .bigTop__hed { margin-top: 5px; } .bigTop_button--embedded { margin: 20px auto; } .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play { position: static; } .bigTop__text--center.bigTop__text--flex &gt; .bigTop__play { margin-top: 15px; } .bigTop__text--flex &gt; .bigTop__play + .bigTop__flash { margin-top: 15px; } .wsj-modern .splitTop .bigTop__text span:before { margin-left: 10px; }}/* 8, 12, 16 unit */@media (min-width: 640px) { .bigTopHide--8, .bigTopHide--12, .bigTopHide--16, .bigTop__flash.bigTopHide--8, .bigTop__flash.bigTopHide--12, .bigTop__flash.bigTopHide--16 { display: none; } .bigTop__rel { overflow: hidden; /* fix horizontal scroll in IE11 */ } .bigTop__media--image { padding-bottom: 51.3%; } .bigTop__media--image &gt; .bigTop__preview--forceblur { --webkit-filter: blur(20px); filter: blur(20px); } .bigTop__text { position: absolute; top: 50%; left: 50%; transform: translateY(-50%) translateX(-50%); -webkit-transform: translateY(-50%) translateX(-50%); } .bigTop__dek { font-size: 20px; line-height: 28px; } .bigTop__text--static.bigTop__text { color: #000; position: static; transform: none; margin-left: auto; margin-right: auto; } .bigTop__text--inactive.bigTop__text--bottom, .bigTop__text--inactive.bigTop__text--center { opacity: 0; } .bigTop__text.bigTop__text--flex { flex-direction: column; display: flex; justify-content: flex-end; align-items: center; height: 100%; } .bigTop__text--clickthrough { pointer-events: none; } .bigTop__text--clickthrough &gt; .bigTop__flash, .bigTop__text--clickthrough &gt; .bigTop__hed, .bigTop__text--clickthrough &gt; .bigTop__dek { pointer-events: auto; } .bigTop__text.bigTop__text--flex.bigTop__text--center { justify-content: center; } .bigTop__text--center.bigTop__text--flex &gt; .bigTop__play { order: 2; }}/* 12 unit */@media (min-width: 980px) and (max-width: 1299px) { .bigTop__captioncredit { max-width: 960px; } .splitTop .bigTop__captioncredit { max-width: none; } .bigTop__play { width: 70px; height: 70px; } .bigTop__play:before { border-top-width: 16px; border-bottom-width: 17px; border-left-width: 26px; margin-top: 18px; margin-left: 25px; }}/* 12, 16 unit */@media (min-width: 980px) { .splitTop .bigTop__captioncredit { margin: 0; padding: 5px 5px 0 0; width: 50%; float: right; } .bigTop__hed { font-size: 52px; line-height: 1.077; } .edition-japan .bigTop__hed { font-size: 45px; } .bigTop__text { max-width: 960px; } .bigTop__text.bigTop__text--bottom { box-sizing: border-box; min-height: 30%; top: auto; bottom: 0; box-sizing: border-box; padding-bottom: 30px; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); } .bigTop__text.bigTop__text--top { top: auto; bottom: 70%; max-height: 30%; padding-top: 10px; box-sizing: border-box; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); } .bigTop__hed + .bigTop__dek { margin-top: 8px; } .bigTop__flash + .bigTop__hed { margin-top: 5px; } .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play { /* need to do this because of IE11 */ position: absolute; top: 50%; left: 50%; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); } .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play + .bigTop__flash, .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play + .bigTop__hed { margin-top: 50px; } .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play { margin-top: -45px; } .bigTop__text--center.bigTop__text--flex &gt; .bigTop__play { margin-top: 20px; } .bigTop__text--flex &gt; .bigTop__play + .bigTop__flash { margin-top: 15px; }}/* 16 unit */@media (min-width: 1300px) { .bigTop__captioncredit { max-width: 1280px; } .splitTop .bigTop__captioncredit { max-width: none; } .bigTop__play { width: 90px; height: 90px; } .bigTop__play:before { border-top-width: 20px; border-bottom-width: 22px; border-left-width: 33px; margin-top: 24px; margin-left: 33px; }}", "posttime": "2020-05-08 01:31:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,从头到脚,hijacks", "title": "冠状病毒从头到脚劫持身体，令医生困惑", "title_en": "Coronavirus Hijacks the Body from Head to Toe, Perplexing Doctors", "transed": 1, "url": "https://www.wsj.com/articles/coronavirus-hijacks-the-body-from-head-to-toe-perplexing-doctors-11588864248", "via": "", "real_tags": ["病毒", "冠状病毒", "从头到脚", "hijacks"]}]