[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1004833, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几年前，我写过一篇关于我是如何和莉莉一起玩简化版的卡尔卡松的文章。我们停了一段时间，但最近我们玩了简化版的Ticketto Ride，Race for the Galaxy，Guillotin，以及Atan的定居者。我在这里的一般方法是找到游戏的一个核心部分，它本身会很有趣，然后根据莉莉想要的更复杂的情况添加到它上面。虽然这些规则的细节并不是很重要，但我们可以举一些例子来解释一下我们是如何做到这一点的：\n在“银河系竞赛”中，核心技师是打牌。在我们的第一个游戏中，你将通过丢弃其他纸牌来玩牌，既有定居点的，也有发展的。角落里有个2&34；的东西，意思是丢掉两张牌。在每一回合结束时，你会拉回最多5个，这与最初的游戏完全不同。赢家是最终以最大代价打牌的人。\n当她想让事情变得更复杂时，我们开始使用纸牌的胜利点价值，而不是它们的成本，每次你打一张牌，你就会读到六角形盒子里的数字，然后在上面放那么多胜利点筹码。稍后我们可能会停止把筹码放在上面，但是有了物理筹码来操作和计数会让得分变得更容易。\n在“车票”中，核心技工是抽牌和玩火车。我们每个人都拿到了一张相同点数的线路卡，在地图上找到了我们的城市，并用这张卡作了参考，并在它们上做了标记，这样我们就不会丢失它们。我们第一次玩的时候，轮到你了，你坐了一节火车车厢。我们的目标是成为连接你们两个城市的第一个城市。这个过程进行得非常快，刚刚教会了定位和一点点寻路。\n在第二场比赛中，我介绍了火车卡。现在，如果你想摆放一列火车，你需要拿起一张颜色合适的卡片。你没有举起一只手，只需立即挑选和摆放即可。它们确实需要是合适的颜色。如果没有一张牌对你有效，你可以利用轮到你的机会用五张新的换掉可用的牌。我们认为只有孩子才能拿起火车头(外卡)，莉莉对此感到非常兴奋。\n在断头台，核心技工是收集贵族。我们第一次玩的时候，我们每次都会把排在队伍前面的贵族收集起来，这并不是很令人兴奋，但却教会了机械师。接下来，我们添加了卡片，虽然我需要把卡片读给她听，但她很快就能从图片中认出哪些卡片是什么。在添加了几轮东西之后，我们就可以玩到完整的游戏了，尽管它也是这里最简单的游戏。\n我们第一次玩的时候，她对这个主题有点不安，但没有想太久，现在她不介意了。\n当我们想要玩卡坦岛的定居者时，我布置了一个简化的7块棋盘：中间有一块水瓷砖，周围有五块资源瓷砖，还有沙漠。我们掷一个骰子，掷骰子的人得到适当的资源。如果你掷沙漠牌，那就是强盗，如果你的对手有超过七张牌，你就会拿到一半。\n最初，这个游戏只是收集资源和建立东西来换取积分，但你建造的东西实际上并没有做任何事情。当我们想让事情变得更复杂时，我们就这样做了，因为你们建造了定居点和城市，他们开始为他们所在的地方生产商品。这使得它的设置有点复杂，因为如果木头和砖头，或者石头和小麦紧挨着，解决它们的交叉点就太强大了。后来，我们增加了与银行的贸易，我们增加了港口。不过，再说一次，这种需求不能是随机的，因为将端口紧挨着相同类型的资源太强大了。最近我们增加了开发卡和移动强盗。\n总体而言，与专门为孩子设计的游戏相比，我更喜欢这种方法，因为孩子们学得真的很快，任何单人游戏在一开始对他们来说都可能太难，或者很快就会变得太容易。能够不断扩展游戏，使其保持趣味性和挑战性，最终接近完整的游戏。", "note_en": "A few years ago I wrote about how I&#39;d been playing a  simplified version of Carcassonnewith Lily. We stopped for a while, but recently we&#39;ve playedsimplified versions of  Ticketto Ride,  Race for theGalaxy,  Guillotine,and  Settlers ofCatan. My general approach here is to find a core piece of thegame that will be fun on its own, and then add to it as Lily wantsmore complexity. While the particulars of the rules don&#39;t really matter very much, someexamples to explain how we&#39;re approaching it:\n In Race for the Galaxy, the core mechanic is playing cards. In ourfirst game you would play cards, both settlements and developments, bydiscarding other cards. Something with a &#34;2&#34; in the corner meantdiscarding two cards. At the end of each turn you would draw back upto five, which is nothing like the original game. The winner was theperson who ended up having played cards with the greatest cost.\n When she wanted to make it more complicated, we started using thevictory point value of cards instead of their cost, and each time youplayed a card you read the number in the hexagonal box and placed thatmany victory point chips on it. Later we&#39;ll probably be able to stopputting the chips on it, but having physical chips to manipulate andcount makes scoring easier.\n  In Ticket to Ride, the core mechanic is drawing cards and playingtrains. We each got a route card of the same point value, found ourcities on the map, with the card for reference, and marked them so wewouldn&#39;t lose them. The first time we played, on your turn you placeda single train car. The goal was to be the first one to connect yourtwo cities. This went very quickly, and just taught placement and abit of pathfinding.\n For the second game I introduced train cards. Now if you wanted toplace a train you needed to pick up an appropriately colored card.You didn&#39;t build up a hand, just picked and placed right away. Theydid need to be the right color. If no card worked for you, you coulduse your turn to replace the available cards with five new ones. Weplayed that only kids could pick up locomotives (wild cards), whichLily got very excited about.\n  In Guillotine the core mechanic is collecting nobles. Our first timeplaying we would just each collect the noble at the head of the lineevery time, which was not very exciting but taught the mechanic. Nextwe added cards, and while I would need to read the cards to her, shelearned which cards were which pretty quickly from the pictures. Aftera few rounds of adding things we&#39;re up to the full game, though it&#39;salso the simplest of the games here.\n  The first time we played she was a bit unsettled by the theme, butdidn&#39;t think about it very long and now it doesn&#39;t bother her.\n When we wanted to play Settlers of Catan, I laid out a simplified7-piece board: a water tile in the middle, five resource tiles aroundit, and the desert. We would roll a single die, and the person whorolled got the appropriate resource. If you rolled the desert one,that was the robber, and then if your opponent had more than sevencards you got half of them.\n Initially, the game was only collecting resources and building thingsfor points, but the things you built didn&#39;t actually do anything. Whenwe wanted to make it more complicated, we made it so as you builtsettlements and cities they started producing goods for the placesthey were on. This made it so setup was a little bit more complicated,because if wood and brick, or stone and wheat, were next to each other,settling their intersection was just much too powerful. Later we addedtrading with the bank, and we added ports. Though, again, this need isto not be random because having a port right next to the same kind ofresource was too powerful. Most recently we added development cardsand moving the robber.\n  Overall, I like this approach much more than games that are designedspecifically for kids because kids learn really quickly and any singlegame is probably going to be too hard for them at the beginning orquickly become much too easy for them. Being able to keep expandingthe game so that it stays fun and challenging and eventuallyapproaches a full game.", "posttime": "2020-06-02 22:34:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,棋盘,board", "title": "简化棋盘游戏", "title_en": "Simplifying Board Games", "transed": 1, "url": "https://www.jefftk.com/p/simplifying-board-games", "via": "", "real_tags": ["游戏", "棋盘", "board"]}, {"category": "", "categoryclass": "", "imagename": "0498fa6474ad6d2d18227c6c018514cb.png", "infoid": 1004832, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "口袋推荐，包括一些网络上最好的故事，将出现在Firefox的新选项卡上，供我们在英国的用户使用。如果您没有看到它们，您可以在您的新选项卡中打开Pocket文章，请按照以下步骤操作。\nWebRender继续推出更多适用于Windows用户的Firefox，目前在运行NVIDIA GPU(&lt；=3440x1440)和大屏幕(&gt；3440x1440)的Windows 10笔记本电脑上默认可用。", "note_en": "Pocket recommendations, featuring some of the best stories on the web, will appear on the Firefox new tab for our users in the UK. If you don’t see them, you can turn on Pocket articles in your new tab,  follow these steps.\n  WebRender continues its roll out to  more Firefox for Windows users, now available by default on Windows 10 laptops running on Nvidia GPUs with medium (&lt;= 3440x1440) and large screens (&gt; 3440x1440).", "posttime": "2020-06-02 22:34:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "firefox,火狐", "title": "火狐77", "title_en": "Firefox 77", "transed": 1, "url": "https://www.mozilla.org/en-US/firefox/77.0/releasenotes/", "via": "", "real_tags": ["firefox", "火狐"]}, {"category": "", "categoryclass": "", "imagename": "5fd7ad5ff40333e2a7badf483705b2e8.jpeg", "infoid": 1004831, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "不久前，我访问了Mario Wolczko的网站(http://www.wolczko.com/st80))，当时我正在搜索与著名的Smalltalk蓝皮书相对应的原始SmallTalk-80实现(参见http://stephane.ducasse.free.fr/FreeBooks/BlueBook/Bluebook.pdf).I在90年代使用Smalltalk，并与Squeak和Pharo一起使用。但令我惊讶的是，周围没有能够运行原始施乐映像的虚拟机，Mario在此链接上提供了该链接：http://www.wolczko.com/st80/image.tar.gz.。我无法使用上述VM加载此映像，即使经过多次修改，我仍无法使Mario的VM正常工作(它现在可以编译，但在映像完全加载之前崩溃)。\n自从我最近完成了一个基于LuaJIT的OBERON实现(参见https://github.com/rochus-keller/Oberon)I)，我开始关心这样一个问题：使用LuaJIT作为SmallTalk-80的后端是否可行，以及与Cog相比，它将实现什么样的性能(参见https://github.com/OpenSmalltalk/opensmalltalk-vm).There)。Lua和Smalltalk之间有许多相似之处，尽管语法非常不同。我看到了两种实现变体：从Smalltalk源代码运行一切，或者从Smalltalk映像(即蓝皮书字节码)运行它。为了进一步分析施乐的实现并做出决定，我需要一个好的工具，所以我们来了。\n别忘了：Smalltalk-今年(2020年)80岁生日，艾伦·凯(Alan Kay)80岁生日(5月17日)！\n当然，我可以在Smalltalk中实现所有功能，就像他们在最初的Squeak和Cog VM上所做的那样。但是这些年来，我已经习惯了严格/静态类型的编程，二十多年来，C++是我的主要编程语言。还有Qt(参见https://www.qt.io/))，它是(几乎)所有东西的绝佳框架。LuaJIT是用C语言和汇编语言编写的。因此，我认为C++非常适合。\n通常我从EBNF语法开始，然后使用我自己的工具将其转换为LL(1)(参见https://github.com/rochus-keller/EbnfStudio).Smalltalk不同。有可用的语法规范(甚至是ANSI标准)，但是有太多的变体。因此，我只是坐下来编写了一个词法分析器，然后编写了一个解析器，并对其进行了修改，直到它可以解析http://www.wolczko.com/st80/image.tar.gz.中包含的Smalltalk-80源文件。解析器提供一个代码模型，该代码模型执行一些额外的验证并构建交叉引用列表。在我的旧32位HP EliteBook 2530p上，整个Smalltalk-80源文件可以在不到半秒的时间内解析和交叉引用。\n还有一个AST和一个访问器，我将在将来的代码生成器实现中使用它们。\n类浏览器有几个我的分析所需的特殊功能。当然有语法突出显示，但它也标记同一消息的所有关键字和声明的所有使用。如果您单击标识符，会有一个工具提示，其中包含它是临时变量、实例变量还是类变量等信息。如果您在按住CTRL键的同时单击一个类标识符或一个发送到显式类的消息，则它会导航到这个类和方法。还有一个列表，其中包含使用或分配变量的所有类的所有方法；其他列表显示系统中使用的所有消息模式或主要消息，以及它们在哪些类/方法中实现。还有一个浏览历史记录；您可以使用ALT+LEFT和ALT+RIGHT键后退或前进。\n使用图像查看器，用户可以按http://www.wolczko.com/st80/image.tar.gz.提供的交换格式检查原始SmallTalk-80虚拟图像的内容。查看器在树中显示对象表；已知对象(如蓝皮书第4部分中所定义)和类按名称打印；给定OOP处的对象可以展开，以便可以跟随对象指针；当单击对象或其类时，详细信息以html格式显示，并带有可导航的链接；通过按住Ctrl键并单击列表项或链接，将打开以给定对象为根的列表或详细视图。有一个包含在图像中找到的所有类和元类的声明列表，以及一个引用给定OOP的交叉引用列表。方法的详细视图还显示带有描述的字节码。还有一个浏览历史记录；您可以使用ALT+LEFT和ALT+RIGHT键后退或前进。使用CTRL+G导航到给定的OOP，使用CTRL+F在详细视图中查找文本(按F3再次查找)。\n这是一个简单的蓝皮书实现，用于以http://www.wolczko.com/st80/image.tar.gz.提供的交换格式理解和运行原始的SmallTalk-80虚拟映像。重点是功能和对蓝皮书的遵从性，而不是性能(尽管它执行得很好)或富有成效的工作。未实施保存快照。如果可行，我的目标是逐步将虚拟机迁移到LuaJIT后端。解释器会重现http://www.wolczko.com/st80/image.tar.gz.附带的原始施乐trace2和trace3文件。启动后的初始屏幕对应于Smalltalk 80虚拟映像版本2手册第3页上显示的屏幕截图。不过，这项工作仍在进行中；存在一些视图更新问题，不要对零星的崩溃感到惊讶。\n请注意，可以按CTRL+鼠标左键模拟鼠标右键单击，按CTRL+Shift+鼠标左键模拟鼠标中键单击。如果您有两个按钮的鼠标，则还可以使用按住Shift键的同时单击鼠标右键来模拟鼠标中键单击。\n中音键盘上的所有键(例如，除LF之外的https://www.extremetech.com/wp-content/uploads/2011/10/Alto_Mouse_c.jpg))均受支持；只需在本地键盘上键入所需符号的组合键即可。使用左箭头和上箭头键输入左箭头和上箭头字符。\n我似乎不是唯一对蓝皮书Smalltalk-80VM感兴趣的人。今天(2020年5月18日)，我在Reddit上发现了一个非常有趣的帖子：https://www.reddit.com/r/smalltalk/comments/glqbrh/in_honor_of_alans_birthday_by_the_bluebook_c/，它提到了https://github.com/dbanay/Smalltalk.。第一次提交显然是在5月12日，但大多数文件的创建日期是2月或3月，甚至是12月；所以显然这是一项相当大的工作；实现是基于C++11和SDL的，而且似乎工作得很好(甚至比这个VM快一点)；我还在Dan的代码中找到了蓝皮书修复，我在其他任何地方都看不到这些修复(谢谢，Dan！)。他实施了一系列方便的功能，如使用主机进行复制粘贴，以及使用自定义映像访问文件系统/持久快照。因此，如果您准备将其用于高效率的工作，并且不在乎您不能直接加载原始的Xerox虚拟映像，那么最好看看他的实现。\n以下是类浏览器、图像查看器和虚拟机的二进制版本：http://software.rochus-keller.info/St80Tools_win32.zip.Just解压驱动器上某个位置的压缩文件，然后双击St80ClassBrowser.exe或St80ImageViewer.exe；Qt库以及原始的SmallTalk-80Sources和VirtualImage文件也包括在内。\n确保您的系统上安装了与您的C++编译器兼容的Qt 5.x(库和头)版本。\n转到解压缩目录并执行例如QTDIR/bin/qmake StClassBrowser.pro(请参阅有关QTDIR的Qt文档)。\n运行make；几秒钟后，您将在build目录中找到可执行文件。\n或者，您可以使用QtCreator打开PRO文件并在那里构建它。请注意，此项目中有不同的PRO文件。\n如果您需要支持或希望发布问题或功能请求，请使用https://github.com/rochus-keller/Smalltalk/issues上的Github问题列表或向作者发送电子邮件。", "note_en": "Some time ago I came accross Mario Wolczko&#39;s site ( http://www.wolczko.com/st80) when searching for an originalSmalltalk-80 implementation corresponding to the famous Smalltalk &#34;Blue Book&#34; (see  http://stephane.ducasse.free.fr/FreeBooks/BlueBook/Bluebook.pdf).I used Smalltalk in the nineties and also played around with Squeak and Pharo.But I was surprised that there was no VM around capable of running the original Xerox images, whichMario provides on this link:  http://www.wolczko.com/st80/image.tar.gz. I wasn&#39;t able to load this image withthe aforementioned VMs; and even after numerous modifications, I still haven&#39;t managed to get the VM of Mario to work(it now compiles but crashes before the image is fully loaded).\n Since I recently completed an Oberon implementation based on LuaJIT (see  https://github.com/rochus-keller/Oberon)I got interested in the question whether it would be feasible to use LuaJIT as a backend for Smalltalk-80, andwhat performance it would achieve compared to Cog (see  https://github.com/OpenSmalltalk/opensmalltalk-vm).There are many similarities between Lua and Smalltalk, even though the syntax is very different.I see two implementation variants: run everything from the Smalltalk source code, or run it from theSmalltalk image (i.e. Blue Book bytecode). To further analyze the Xerox implementation and make a decisionI needed a good tool, so here we are.\n AND NOT TO FORGET: Smalltalk-80 turns 40 this year (2020), and Alan Kay turns 80 (on May 17)!\n  Of course I could have implemented everything in Smalltalk as they did with the original Squeak and Cog VMs. Butover the years I got used to strictly/statically typed programming and C++ is my main programming language sincemore than twenty years. And there is Qt (see  https://www.qt.io/) which is a fabulous framework for (nearly)everything. And LuaJIT is written in C and Assembler. I therefore consider C++ a good fit.\n Usually I start with an EBNF syntax and transform it to LL(1) using my own tools (see  https://github.com/rochus-keller/EbnfStudio).Smalltalk is different. There are syntax specifications available (even an ANSI standard), but there is a plethoraof variations. So I just sat down and wrote a lexer and then a parser and modified it until it could parse theSmalltalk-80.sources file included with  http://www.wolczko.com/st80/image.tar.gz. The parser feeds a code modelwhich does some additional validations and builds the cross-reference lists. On my old 32 bit HP EliteBook 2530pthe whole Smalltalk-80.sources file is parsed and cross-referenced in less than half a second.\n There is also an AST and a visitor which I will use for future code generator implementations.\n  The Class Browser has a few special features that I need for my analysis. There is syntax highlighting of coursebut it also marks all keywords of the same message and all uses of a declaration. If you click on the identifierthere is a tooltip with information whether it&#39;s a temporary, instance or class variable, etc. If you CTRL+click on aclass identifier or on a message sent to an explicit class then it navigates to this class and method. There is alsoa list with all methods of all classes where a variable is used or assigned to; other lists show all message patternsor primaries used in the system and in which classes/methods they are implemented.There is also a browsing history; you can go back or forward using the ALT+Left and ALT+Right keys.\n       With the Image Viewer one can inspect the contents of the original Smalltalk-80 Virtual Image in theinterchange format provided at  http://www.wolczko.com/st80/image.tar.gz. The viewer presents theobject table in a tree; known objects (as defined in the Blue Book part 4) and classes are printedby name; an object at a given oop can be expanded, so that object pointers can be followed; when clickingon an object or its class the details are presented in html format with navigable links; by CTRL-clicking on a list item or link a list or detail view opens with the given object as root. There is adedicated list with all classes and metaclasses found in the image, as well as a cross-reference listfrom where a given oop is referenced. Detail views of methods also show bytecode with descriptions.There is also a browsing history; you can go back or forward using the ALT+Left and ALT+Right keys.Use CTRL+G to navigate to a given OOP, and CTRL+F to find text in the detail view (F3 to find again).\n    This is a bare bone Blue Book implementation to understand and run the original Smalltalk-80 Virtual Image in the interchange format provided at  http://www.wolczko.com/st80/image.tar.gz. The focus is on functionality and compliance with the Blue Book, not on performance (it performs decently though) or productive work. Saving snapshots is not implemented. My goal is to gradualy migrate the virtual machine to a LuaJIT backend, if feasible. The interpreter reproduces the original Xerox trace2 and trace3 files included with  http://www.wolczko.com/st80/image.tar.gz. The initial screen after startup corresponds to the screenshot shown on page 3 of the &#34;Smalltalk 80 Virtual Image Version 2&#34; manual. This is still work in progress though; there are some view update issues and don&#39;t be surprised by sporadic crashes.\n Note that you can press CTRL+left mouse button to simulate a right mouse button click, and CTRL+SHIFT+left mouse button to simulate a middle mouse button click. If you have a two button mouse, then you can also use SHIFT+right mouse button to simulate a middle mouse button click.\n All keys on the Alto keyboard (see e.g.  https://www.extremetech.com/wp-content/uploads/2011/10/Alto_Mouse_c.jpg) besides LF are supported; just type the key combination for the expected symbol on your local keyboard. Use the left and up arrow keys to enter a left and up arrow character.\n   I don&#39;t seem to be the only one interested in an original Blue Book Smalltalk-80 VM. Today (May 18 2020) I found this very interesting post on Reddit:  https://www.reddit.com/r/smalltalk/comments/glqbrh/in_honor_of_alans_birthday_by_the_bluebook_c/ which refers to  https://github.com/dbanay/Smalltalk. The initial commit was apparently on May 12, but most files have a creation date of February or March, one even of December; so obviously it was quite some work; the implementation is based on C++11 and SDL and seems to work very well (even a bit faster than this VM); I also found Blue Book fixes in Dan&#39;s code which I didn&#39;t see anywhere else (thanks, Dan!). He implemented a bunch of convenience features like copy paste with the host, and file system access/persistent snapshots, with a customized image. So if you&#39;re up to using it for productive work and don&#39;t care that you can&#39;t directly load the original Xerox virtual image, then better take a look at his implementation.\n  Here is a binary version of the Class Browser, the Image Viewer and the Virtual Machine for Windows:  http://software.rochus-keller.info/St80Tools_win32.zip.Just unpack the ZIP somewhere on your drive and double-click St80ClassBrowser.exe or St80ImageViewer.exe; Qt libraries are included as well as theoriginal Smalltalk-80.sources and VirtualImage file.\n   Make sure a Qt 5.x (libraries and headers) version compatible with your C++ compiler is installed on your system.\n  Goto the unpacked directory and execute e.g.  QTDIR/bin/qmake StClassBrowser.pro (see the Qt documentation concerning QTDIR).\n Run make; after a couple of seconds you will find the executable in the build directory.\n Alternatively you can open the pro file using QtCreator and build it there. Note that there are different pro files in this project.\n  If you need support or would like to post issues or feature requests please use the Github issue list at  https://github.com/rochus-keller/Smalltalk/issues or send an email to the author.", "posttime": "2020-06-02 22:33:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c++,xerox,original", "title": "原始Xerox Smalltalk-80虚拟映像(C++/Qt)的解释器", "title_en": "Interpreter for the original Xerox Smalltalk-80 virtual image (C++/Qt)", "transed": 1, "url": "https://github.com/rochus-keller/Smalltalk#a-smalltalk-80-interpreted-virtual-machine", "via": "", "real_tags": ["c++", "xerox", "original"]}, {"category": "", "categoryclass": "", "imagename": "a5fc2099c9f773fa95f35ef8df6ebf26.png", "infoid": 1004830, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "DEB文件是包含数据的存档。它标有.deb扩展名，用于轻松分发和安装Linux Debian及其衍生产品的程序。当您的应用程序需要处理其他依赖项、与桌面集成、运行安装前和安装后脚本等时，deb文件非常方便。\n在这个快速教程中，我想向您展示如何从头开始生成一个Deb包，该包将在目标系统中安装一个二进制可执行文件。让我们从一些理论背景开始吧。\nDeb是一个标准的Unix ar存档，其中包含您的应用程序和其他实用程序文件。最重要的是控制文件，它存储有关deb包及其安装的程序的信息。\n在内部，Deb包包含模拟典型Linux文件系统的文件夹集合，如/usr、/usr/bin、/opt等。在安装过程中，放入其中一个目录中的文件将被复制到实际文件系统中的相同位置。因此，例如，放入&lt；.deb&gt；/usr/local/bin/binaryfile的二进制文件将安装到/usr/local/bin/binaryfile。\n例如，假设您想要发布名为hello的1.0版程序，该程序是为64位ARM处理器构建的。您的deb文件名类似hello_1.0-1_arm64.deb。\n我们现在已经准备好生成包了。确保您的系统中安装了dpkg-deb程序：稍后将使用该程序生成最终存档。\n创建一个临时工作目录以在其中放置您的软件包。遵循我们以前见过的相同命名约定。例如：\n将程序文件放在目标系统上应该安装的位置。例如，假设您希望将程序安装到/usr/local/bin：\nmkdir命令的-p标志将创建嵌套目录。然后将可执行文件复制到其中：\n控制文件位于Debian目录中。注意大写：名为debian(Lowecase)的类似目录用于存储所谓源包的源代码。本教程是关于二进制包的，所以我们不需要它。\n使用您选择的文本编辑器打开先前创建的文件。控制文件只是数据字段的列表。对于二进制包，至少有一组必需的包：\n维护员-包裹维护负责人的姓名和电子邮件地址；\nPackage：helloVersion：1.0体系结构：arm64Maintainer：内部指针&lt；info@intralpointers.com&gt；描述：欢迎您的程序。您可以在此处添加更长的描述。注意这段开头的空白处。\n控制文件可以包含附加的有用字段，例如它所属的部分或依赖项列表。如果您的程序依赖于外部库才能正常工作，那么后者是极其重要的。如果您愿意，您可以手动填写，但是有一些辅助工具可以减轻负担。在接下来的几段中，我将向您展示如何使用。\nroot-owner-group标志使所有deb包内容归root用户所有，这是标准做法。如果没有这样的标志，所有文件和文件夹都将归您的用户所有，而Deb软件包将安装到的系统中可能不存在这些文件和文件夹。\n上面的命令将在工作目录旁边生成一个很好的.deb文件，或者如果包中有错误或缺失，则会打印错误。如果操作成功，您就有一个Deb包可以分发了。继续阅读，寻找更多的好东西！\n这是一个好主意，以测试您的Deb包一旦创建。您可以像安装任何其他常规Deb软件包一样安装它：\ndpkg-l命令列出所有安装的软件包，而grep搜索&lt；appname&gt；。如果应用程序已正确卸载，则输出应为空。\n尤其是在处理安装前/安装后或删除脚本时，这些脚本在某些时候会失败。这是dpkg发出的典型错误消息：\n软件包处于非常糟糕的不一致状态-您应该在尝试删除之前重新安装它。\n这阻碍了任何进展。诀窍是将对损坏的软件包的所有引用移动到安全的地方(例如/tmp目录)，然后强制删除它，如下所示：\n您可以使用dpkg-shlibdeps自动生成它们。它将解析您的二进制文件并查找外部符号。在撰写本文时，该工具似乎无法开箱即用。出于某种(对我来说)未知的原因，它希望debian/control文件出现在工作目录中--这是用于源包的，记得吗？这里的解决方法是创建它，然后移到工作文件夹并运行：\n-O标志将打印标准输出上的依赖项。复制输出并将其粘贴到Debian/control文件的Dependents部分。一旦完成，您就可以删除Debian/control文件。不过，我非常肯定有更好的方法可以做到这一点：一旦我得到关于这一步的更多信息，我会更新这篇文章。\n四个文件：postinst、preinst、postrm和prerm称为维护脚本。这些文件位于Debian目录中，顾名思义，preinst和postinst在安装前后运行，而prerm和poststrm在删除之前和之后运行。它们必须标记为可执行文件。此外，请记住设置权限：必须介于0555和0775之间。", "note_en": "A  deb file is an archive that contains data. Marked with the  .deb extension, it is used to easily distribute and install programs for Linux Debian and derivatives. Deb files are handy when your app needs to take care of additional dependencies, integrate itself with the desktop, run pre and post install scripts and so on.\n In this quick tutorial I want to show you how to generate a deb package from scratch that will install a  binary executable in the target system. Let&#39;s start off with a bit of theoretical background.\n  A deb is a standard Unix  ar archive that contains your application and other utility files. The most important one is the  control file, which stores the information about the deb package and the program it installs.\n Internally, a deb package contains a collection of folders that mimics a typical Linux file system, such as  /usr,  /usr/bin,  /opt and so on. A file put in one of those directories will be copied to the same location in the actual file system during installation. So, for example a binary file put into  &lt;.deb&gt;/usr/local/bin/binaryfile will be installed to  /usr/local/bin/binaryfile.\n     For example, suppose you want to release your program called  hello, version 1.0, built for 64-bit ARM processors. Your deb file name would look something like  hello_1.0-1_arm64.deb.\n  We are now ready to generate the package. Make sure you have the  dpkg-deb program installed in your system: this will be used later on to generate the final archive.\n  Create a temporary working directory to make your package in. Follow the same naming convention we have seen before. For example:\n   Put your program files where they should be installed to on the target system. For example, suppose you want your program to be installed to  /usr/local/bin:\n  The  -p flag to the  mkdir command will create nested directories. Then copy the executable file in there:\n   The  control file lives inside the  DEBIAN directory. Mind the uppercase: a similar directory named  debian (lowecase) is used to store source code for the so-called   source packages. This tutorial is about binary packages, so we don&#39;t need it.\n      Open the file previously created with your text editor of choice. The  control file is just a list of data fields. For binary packages there is a minimum set of mandatory ones:\n Maintainer – the name and the email address of the person in charge of the package maintenance;\n  Package: helloVersion: 1.0Architecture: arm64Maintainer: Internal Pointers &lt;info@internalpointers.com&gt;Description: A program that greets you. You can add a longer description here. Mind the space at the beginning of this paragraph.\n The  control file may contain additional useful fields such as the   section it belongs to or the  dependency list. The latter is extremely important in case your program relies on external libraries to work correctly. You can fill it manually if you wish, but there are helper tools to ease the burden. I will show you how in the next few paragraphs.\n      The  --root-owner-group flag makes all deb package content owned by the root user, which is the standard way to go. Without such flag, all files and folders would be owned by your user, which might not exist in the system the deb package would be installed to.\n The command above will generate a nice  .deb file alongside the working directory or print an error if something is wrong or missing inside the package. If the operation is successful you have a deb package ready for distribution. Keep reading for additional goodies!\n   It&#39;s a good idea to test your deb package once created. You can install it like any other regular deb package:\n        The  dpkg -l command lists all the packages installed, while  grep searches for  &lt;appname&gt;. The output should be blank if the app has been uninstalled correctly.\n  Especially when you are dealing with pre/post install or removal scripts that fail at some point. This is a typical error message by  dpkg:\n Package is in a very bad inconsistent state - you should reinstall it before attempting a removal.\n which prevents any progress. The trick is to move all references to your broken package somewhere safe (e.g. the  /tmp directory) and then force remove it, like so:\n   You can generate them automatically with  dpkg-shlibdeps. It will parse your binary and look for external symbols. At the time of writing, that tool doesn&#39;t seem to work out of the box. For some unknown (to me) reasons it wants the  debian/control file to be present in the working directory – that&#39;s for source packages, remember? The workaround here is to create it, then move into the working folder and run:\n  The  -O flag will print dependencies on the standard output. Copy the output and paste it in the  Depends section of your  DEBIAN/control file. You can get rid of the  debian/control file once done. I&#39;m pretty sure there are better ways for this, though: I will update the article once I get additional information on this step.\n  Four files:  postinst,  preinst,  postrm, and  prerm are called  maintainer scripts. Such files live inside the  DEBIAN directory and, as their names suggest,  preinst and  postinst are run before and after installation, while  prerm and  postrm are run before and after removal. They must be marked as executables. Also, remember to set permissions: must be between  0555 and  0775.", "posttime": "2020-06-02 22:33:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "二进制,binary,文件", "title": "构建二进制Deb包：实用指南", "title_en": "Building binary deb packages: a practical guide", "transed": 1, "url": "https://www.internalpointers.com/post/build-binary-deb-package-practical-guide", "via": "", "real_tags": ["二进制", "binary", "文件"]}, {"category": "", "categoryclass": "", "imagename": "599dfa070263f07b01451492dc4c20ec.jpg", "infoid": 1004829, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "计算机视觉中的GANS：语义图像合成和从单个图像学习生成模型(第6部分)。\n到目前为止，我们已经看到了多个计算机视觉任务，如对象生成、视频合成、未配对的图像到图像的转换。现在，我们已经达到了2019年的出版物，在我们的旅程中，我们总结了从甘斯开始的所有最有影响力的作品。我们关注的是直觉和设计选择，而不是无聊的数字报告。最后，如果结果不吸引人，那么在视觉生成任务中报告的数字的价值是什么？\n在这一部分，我们选择了两种独特的出版物：基于分割图的图像合成和基于单个参考图像的无条件生成。我们提出了在设计GaN时必须考虑的多个角度。我们将在本教程中访问的模型已经从多个角度解决了开箱即用的任务。\n我们已经看到了很多将分割图作为输入并输出图像的作品。当一些事情是好的时候，我脑海中总是浮现的问题是：我们能做得更好吗？\n比方说，我们可以在这个想法上做更多的扩展。假设我们想要在给定分割图和参考图像的情况下生成图像。这项任务被定义为语义图像合成，具有非常重要的意义。我们不仅根据分割图生成不同的图像，而且还进一步约束我们的模型以考虑到我们想要的参考图像。\n这项工作是NVIDIA在Gans中的计算机视觉的缩影。它很大程度上借鉴了之前的Pix2PixHD和StyleGan的作品。实际上，他们借用了Pix2PixHD的多尺度鉴别器。让我们来看看它是如何工作的：\n在此基础上，他们还对StyleGan的发电机进行了检查。该模型的生成器使用自适应实例归一化(ADAIN)对潜在空间表示的风格进行编码。基本上，它接收噪声，这就是建模风格。有趣的是，他们发现adain会丢弃语义内容。让我们来看看为什么：\n[adain(x，y)=\\sigma(Y)(\\frac{x-\\m u(X)}{\\sigma(X)})+\\m u(Y)\\]在这个方程中，我们使用特征映射的统计量来归一化它的值。这意味着格网结构中的所有要素都按相同的量进行了规格化。由于我们要设计一个用于样式和语义解缠的生成器，因此对语义进行编码的一种方法是对层内归一化进行调制。让我们看看如何通过空间自适应反规格化来设计它，或者干脆用铲子！\n我们将从丢弃上一层统计信息开始。因此，对于由索引i表示的网络中的每一层，使用激活\\(h\\)和\\(N\\)样本，我们将像往常一样归一化通道维度。与批量归一化类似，我们将首先使用通道的平均值和标准差进行归一化。\n\\[\\µ_{c}^{i}=\\frac{1}{N H^{i}W^{i}}\\sum_{n，y，x}h_{n，c，y，x}^{i}\\]\\[\\sigma_{c}^{i}=\\sqrt{\\frac{1}{N H^{i}W^{i}}\\sum_{n，y，x}(h_{n，c，y，x}^{i})^2-(\\mu{c}^{i})^2)}\\]\\[val_{c}^{i}=\\frac{h_{n，c，y，x}^{i}-\\mu{c}^{i}}{\\sigma{c}^{i}}\\]\\[\\γ_{c，y，x}^i*val_{c}^{i}+\\beta_{c，y，这类似于批处理规范的第一步。最后一个公式中的val是规格化值，它对于2D栅格中的所有值都是相同的。\n但是，因为我们不想丢失网格结构，所以我们不会相等地重新调整所有值的比例。与现有的规格化方法不同，新的缩放值将是3D张量(而不是向量！)。确切地说，给定具有两个输出(在文献中通常称为头部)的两层卷积网络，我们有：\n\\[\\boldSymbol{\\Gamma}=Conv_{1}(Conv(MASK_{SEGM}))\\]\\[\\boldSymbol{\\beta}=Conv_{2}(Conv(MASK_{SEGM}))\\]\\]\\[两者\\四\\boldSymbol{\\Gamma}，\\boldSymbol{\\beta}\\在R^{C，H，W}\\]由于分段映射不包含连续值，我们通过2卷积将其投影到嵌入空间中。\n基本上，2D栅格(y，x)中的每个位置都有自己的比例参数，根据输入分段图，每个位置都不同。因此，学习到的新缩放(调制)参数自然编码由分段图提供的关于标签布局的信息。在原著的基础上，给出了一幅令人惊叹的插图：\n那么，让我们用这个空间自适应模块来构建一个积木吧！由于从第一步中丢弃了先前的统计数据，因此我们可以包括编码所需布局的不同部分的多个这样的层。请注意，不需要在生成器的输入中包括分段图！\n遵循RESNET块的附加跳跃连接的体系结构，网络可以更快地收敛，并且通常在更好的局部最小值。它由归一化层位置上的两个黑桃层组成。请注意，层内归一化始终在激活函数之前应用。这样做是为了首先在零附近缩放卷积层的范围，然后修剪值。\n由于分段图信息被编码在铲子构建块中，因此生成器不需要具有编码器部分。这大大减少了可训练参数的数量。\n为了匹配在不同空间维度中操作的生成器的每一层，对分段图进行下采样。Spade RES-net块与上采样层相结合。综上所述，基于黑桃的生成器中的分割掩码是通过空间自适应调制馈送的，而不需要额外的归一化。只有来自先前卷积层的激活被规格化。这种方法在不丢失语义信息的情况下以某种方式结合了标准化的优点。他们引入了空间变化的层内归一化的概念，这是该领域一项新颖而重要的长期贡献。为了记录起见，分割图是使用Chen等人2017年训练过的DeepLab版本2模型来推断的。以上所有情况可以说明如下：\n该生成器将语义分割注入到SPADE RES块中。这张照片是照原作拍的。\n同时，由于生成器可以接受随机向量作为输入，因此它实现了基于参考图像的图像合成的自然方式。这通常被称为多模态图像合成。简单地说，我们将潜在空间建模为参考图像的表示。更具体地说，可以添加将真实图像嵌入随机向量的图像编码器。然后将其送入发电机。编码器与生成器耦合形成抽象的变分自动编码器VAE(Kigma等人，2013)。以不同的方式编码两个输入，即真实图像和分割图。编码器尝试捕捉图像的风格，而G通过黑桃组合编码的风格和分割掩码信息以生成新的视觉吸引力的图像。\n在我的拙见中，除了铁锹生成器之外，作者将基准的Pix2PixHD与该领域的所有其他进步一起应用，这一点非常重要，因为它们工作得更好。因此，他们引入了名为Pix2PixHD++的基线。这是非常重要的，因为它可以立即显示建议的层的有效性。有趣的是，基于铁锹的解码器G在参数数量较少的情况下比扩展基线的Pix2PixHD++工作得更好。\n此外，他们还包括一项巨大的消融研究，以加强该方法的有效性。黑桃生成器是第一个语义图像合成模型。它为包括室内、室外和风景场景在内的多个场景产生不同的照片级真实感输出。还有一个你可以亲眼看到的在线演示。相信我，这值得一试。下面是与分割图的真实图像的比较。尽管听起来很疯狂，但这些照片是由高干制作的！\n与原始自然图像进行对比。语义图像合成在行动中，借用原著。\n最后，现在你了解了高干背后的魔力，你就可以享受官方视频了。您也可以访问官方项目页面了解更多结果。\n到目前为止，我们讨论的每一篇论文在某些方面都有其独到之处。在著名的ICCV 2019计算机视觉大会上，这篇论文被评为最佳论文。我们看到，以前的工作是在包含数千或数百万张图像的海量数据集中进行训练的。与我们通常的直觉相反，作者表明，单个自然图像中斑块的内部统计数据可能携带了足够的信息来训练GaN。\n为此，他们将单个图像作为金字塔来处理，获取一组下采样图像，并从粗略到精细探索每个尺度。为了处理不同的输入图像，他们设计了一组完全卷积的GAN。每个特定的网络都旨在捕获不同规模的分布。\n这是因为核大小为K×K的二维卷积层只需要大于K的输入大小。该技术还用于用较小的输入块训练更快的模型，然后在测试时处理更大的分辨率。如果您的体系结构中有完全连接的层，这是不可能的，因为您需要预定义输入大小。\n此外，他们还使用了基于补丁的鉴别器来区分像素2pix。理想情况下，提出的基于补丁的鉴别器层次结构，而每个级别捕获不同尺度的统计信息。类似于渐进式生长GAN的生成器，它们首先从小标尺开始训练，不同的是，当一个标尺被训练时，它们冻结了权重。此外，他们还使用了梯度惩罚Wasserstein GAN，以稳定训练过程。\n图像样本的生成从最粗的比例开始，并顺序地通过所有生成器直到最细的比例。单个比例的典型工作流程如下所示：5conv。块之后进行批归一化，并对上采样图像进行REU激活处理。在将幻觉图像馈送到网络之前，会添加噪声。空间维度在整个块中保持不变，填充为1，内核为3。因此，可以添加一个简短的加性跳跃连接，将上采样的图像融合到块的输出。这个概念极大地帮助模型更快地收敛，正如我们在许多方法中已经看到的那样。以上所有情况可以说明如下：\nSINGAN的一个比例尺的生成器的构建块。图像取自原作。\n重要的是，在其他成功的作品(BigGan，StyleGan)之后，在每个尺度上都注入了噪音。原因是我们不想让发电机记住以前的刻度，因为它的训练已经停止。在同一个方向上，不同的GAN接受范围小，学习能力有限。直观地说，我们不想让补丁记住输入，因为我们只用一张图像进行训练。容量有限是指参数数量较少。\n作为参考，起始层的有效接受场大约是图像高度的50%。因此，它可以生成图像的总体布局(全局结构)。上述块的接收视野为11x11，因此输入图像通常以25像素的比例开始。\n有趣的是，他们选择以这样的方式设计模型：当您为最后一层(Z_FIXED)选择零作为输入噪声和固定噪声时，应该训练网络以重建原始图像。\n\\[l_{rec}=||G_{n}(Noise=0，x_{upsampl}^{rec})-x_{n}^{real}||^2\\]\\[L_{rec}=||G_{last}(Noise=z_{Fixed}，x_{upsampl}^{rec})-\\textbf{i}^{real}||^2\\]。因此，重建图像\\(x_rec\\)确定每个尺度的噪声的标准偏差。\n检查模型的输出，我们观察到生成的图像是逼真的，同时它们保留了原始图像的内容。由于该模型在每个面片中具有有限的感受场(小于整个图像)，因此可以生成输入图像中不存在的面片的新组合。下面您可以看到模型是如何遇到外部注入模型的结构的。我们注意到，SinGan保留粘贴对象的结构，同时调整其外观和纹理。\n基于本工作的大量结果，很容易推断SinGAN模型可以生成逼真的随机图像样本。令人惊讶的是，即使有了新的结构和物体调制。尽管如此，它仍会学习保留图像/补丁分布。\n为了记录起见，作者还探索了用于其他图像处理任务的SinGAN。在给定训练模型的情况下，他们的想法是利用SinGAN学习训练图像的斑块分布这一事实。因此，可以通过将图像注入生成金字塔来实现操作。直观地说，该模型将尝试将其补丁分布与训练图像的补丁分布相匹配。应用包括图像超分辨率，绘画到图像，协调，图像编辑，甚至动画从一个单一的图像行走的潜在空间！\n官方视频总结了我们在本教程中描述的这项工作的前述贡献。\n我们仔细检查了从分割图合成图像方面表现最好的方法，以及从单个图像学习的方法。对于饥肠辘辘的读者，我们总是喜欢留下一个深思熟虑的、强烈推荐的链接。因此，既然您已经了解了很多关于设计和培训GAN的知识，我们建议您探索该领域中尚未解决的问题，Odena等人在本文中对这些问题进行了完美的描述。2019年。您总是可以在这里找到更多可能与您的问题更接近的论文。最后，您不需要自己实现每个体系结构。在Kera和Pytorch中有一个非常棒的gan git存储库，它包含多个实现。请随时查看它们。\n这是本系列目前的最后一篇文章。但请注意，计算机视觉中的甘斯系列将继续开放，以包括未来的新论文，以及我们可能错过的现有论文。我们目前正在准备一本免费的电子书，它总结了我们的结论，并将我们所有的文章连接成一个单一的资源。如果您想表达您的兴趣，请订阅我们的时事通讯，直接将其接收到您的收件箱中。\n@文章{adaloglo2020gans，title=&#34；Gans in computer Vision&#34；，作者：Adaloglou，Nikolas and Karagianakos，Sergios&#34；，Journal=&#34；https://theaisummer.com/&#34；，Year=&#34；2020&#34；，url=&#34；https://theaisummer.com/gan-computer-vision-semantic-synthesis/&#34；}\n朴涛、刘明义、王同昌、朱军云(2019)。空间自适应归一化的语义图像合成。载于IEEE计算机视觉和模式识别会议论文集(第2337-2346页)。\n沙汉姆，T.R.，Dekel，T.，&amp；Michaeli，T.(2019年)。辛根：从单一的自然图像中学习生成模型。载于IEEE国际计算机视觉会议论文集(第4570-4580页)。\n何凯、张霞、任山、孙军杰(2016)。深度残差学习在图像识别中的应用。发表于IEEE计算机视觉和模式识别会议论文集(第770-778页)。\n陈L.C.，Papandreou，G.，Kokkinos，I.，Murphy，K.，&amp；Yuille，A.L.(2017)。Deeplab：基于深度卷积网络、Atrus卷积和完全连通CRF的语义图像分割。“IEEE模式分析与机器智能学报”，40(4)，834-848。", "note_en": "GANs in computer vision: semantic image synthesis and learning a generative model from a single image (part 6)\n So far we have seen multiple computer vision tasks such as  object generation,  video synthesis,  unpaired image to image translation. Now, we have reached publications of 2019 in our journey to summarize all the most influential works from the beginning of GANs. We focus on intuition and design choices, rather than boringly reported numbers. In the end, what is the value of a reported number in a visual generation task, if the results are not appealing?\n In this section, we chose two unique publications:  image synthesis based on a segmentation map and unconditional generation  based on a single reference image. We present multiple perspectives that one has to take into account when designing a GAN. The models that we will visit in this tutorial have tackled the tasks out of the box and from a lot of perspectives.\n     We have already seen a lot of works that receive as input the segmentation map and output an image. When something is good, the question that always comes in my mind is: can we do better?\n Let’s say that we can expand on this idea a bit more. Suppose that we want to generate an image given both a segmentation map and a reference image. This task,  defined as semantic image synthesis, is of great importance. We don’t just generate diverse images based on the segmentation map, but we further constrain our model to account for the reference image that we want.\n This work is the epitome of NVidia in GANs in computer vision. It borrows heavily from previous works of  pix2pixHD and  StyleGAN. Actually, they borrowed the multi-scale discriminator of pix2pixHD. Let’s take a look on how it works:\n  Based on this, they also inspected the generator of StyleGAN. The generator of this model exploits adaptive instance normalization (AdaIN) to encode the style of the latent space representation. Basically it receives noise which is the modeling style. Interestingly, they found out that AdaIN  discards semantic content. Let’s see why:\n\\[AdaIN(x,y) = \\sigma(y)(\\frac{x - \\mu(x)}{\\sigma(x)}) + \\mu(y)\\] In this equation, we use the statistics of the feature map to normalize its values. This means that all the features that are lying in a grid structure are normalized by the same amount. Since we want to design a generator for style and semantics disentanglement, one way to encode the semantics is in the modulation of the in-layer normalizations. Let’s see how we can design this via SPatially-Adaptive DEnormalization, or just  SPADE!\n  We will start by discarding the previous layer statistics. So, for each layer in the network, denoted by the index i, with activations \\(h\\) and \\(N\\) samples,  we will normalize the channel dimension, as usual. Similar to batch normalization, we will first normalize with the  channel wise mean and standard deviation.\n\\[\\mu_{c}^{i} = \\frac{1}{N H^{i} W^{i}} \\sum_{n,y,x} h_{n,c,y,x}^{i}\\]\\[\\sigma_{c}^{i} = \\sqrt{ \\frac{1}{N H^{i} W^{i}} \\sum_{n,y,x} ( ( h_{n,c,y,x}^{i})^2 - (\\mu_{c}^{i})^2 ) }\\]\\[val_{c}^{i} = \\frac{h_{n,c,y,x}^{i} - \\mu_{c}^{i}}{\\sigma{c}^{i}}\\]\\[\\gamma_{c,y,x}^i * val_{c}^{i} + \\beta_{c,y,x}^i\\] As said, this is similar to the first step of the batch norm. Val in the last equation is the normalized value, which is the same for all the values in the 2D grid.\n However, since  we don’t want to lose the grid structure we will not rescale all the values equally. Unlike existing normalization approaches, the new scaled values will be  3D tensors ( not  vectors!). Precisely, given a two-layer convolutional network with two outputs (usually called heads in the literature), we have:\n\\[\\boldsymbol{\\gamma} = Conv_{1}( Conv( mask_{segm} ) )\\]\\[\\boldsymbol{\\beta} = Conv_{2}( Conv( mask_{segm} ) )\\]\\[both \\quad \\boldsymbol{\\gamma}, \\boldsymbol{\\beta} \\in R^{C,H,W}\\] Since segmentation maps do not contain continuous values, we project them in an embedding space via 2 convolutional layers.\n Basically,  each location in the 2D grid (y,x) will have its own scale parameters, different for each location based on the input segmentation map. Hence, the learned new scaling (modulation) parameters naturally encode information about the label layout, provided by the segmentation map. An awesome illustration is presented, based on the original work:\n  So, let’s make a  building block with this spatially adaptive module! Since the previous statistics are discarded from the first step, we can include multiple such layers that encode different parts of the desired layout. Note that, there is no need to include the segmentation map in the input of the generator!\n  Following the architecture of the additive  skip connections of the  resnet block, the network can converge faster and usually in a better local minimum. It consists of two SPADE layers in the position of the normalization layer.  Note that in-layer normalizations are always applied before the activation functions. This is done in order to  first scale the range of the convolutional layers around zero and  then clip the values.\n    Since the segmentation map information is encoded in the SPADE building blocks, the generator does not need to have an encoder-part. This significantly reduced the number of trainable parameters.\n In order to match each layer of the generator that operates in a different spatial dimension, the segmentation map is downsampled. Spade Res-Net block is combined with  Upsampling layers. To summarize,  the segmentation mask in the SPADE-based Generator is fed through spatially adaptive modulation without extra normalization. Only activations from the previous convolutional layers are normalized. This approach somehow combines the advantages of normalization without losing semantic information. They introduce the notion of spatially varying in-layer normalization, which is a novel and significant long term-contribution in the field. For the record, segmentation maps were inferred using a trained  DeepLab Version 2 model by Chen et.al 2017. All the above can be illustrated below:\n The proposed generator, semantic segmentation is injected in the SPADE Res blocks. The image is taken the  original work\n Meanwhile, since the generator can take a random vector as input, it enables a natural way for image synthesis, based on a reference image. This is usually called  multi-modal image synthesis. Simply,  we model the latent space to be a representation of the reference images. More specifically, one can add an image encoder that embeds the real image in a random vector. This is then fed to the generator. The encoder coupled with the generator form an abstract  Variational Autoencoder VAE (Kigma et al 2013). The 2 inputs, namely the real image and segmentation map are encoded in a different manner. The encoder tries to capture the style of the image, while G combines the encoded style and the segmentation mask information via the SPADEs to generate a new visually appealing image.\n  In my humble opinion, it is really important that  the authors applied the baseline pix2pixHD with all the other advancements of the field that found out that worked better, apart from the SPADE generator. Hence, they introduce a baseline called pix2pixHD++. This is of crucial importance as it can immediately show the effectiveness of the proposed layer. Interestingly, the decoder SPADE-based G works better than the extended baseline pix2pixHD++,  with a smaller number of parameters.\n  Furthermore, they included a huge ablation study that enforces the effectiveness of the method. The SPADE generator is the first semantic image synthesis model. It produces diverse photorealistic outputs for multiple scenes including indoor, outdoor, and landscape scenes. There is also an  online demo that you can see with your own eyes. It is worth a try, trust me. Below there is a comparison with the real image of the segmentation map. As crazy as it may sound, these photos are generated by Gau-GAN!\n Comparison with the original natural images. Semantic Image Synthesis in action, borrowed from the  original work\n Finally, now that you understood the magic behind GauGAN, you can enjoy the official video. You can also visit the official project  page for more results.\n  Every paper that we discussed so far has a something unique in some aspect. This paper was voted as the best paper in the famous  ICCV 2019 computer vision conference. We saw that previous works were trained in huge datasets with thousands or millions of images. In opposition to our common intuition, the authors showed that  the internal statistics of patches within a single natural image may carry enough information for training a GAN.\n  To do so, they approach the single image as a pyramid, taking a set of downsampled images, and exploring each scale from coarse to fine. In order to process different input images they designed a  fully convolutional set of GANs. Each particular network aims to capture the distribution at a different scale.\n This is achieved because a 2D convolutional layer with kernel size K x K only requires the input size to be larger than K. This technique is also used to train faster models with smaller inputs patches and then at test time to process bigger resolutions. This is not possible if you have fully connected layers in your architecture since you need to predefine the input size.\n Moreover they used the idea of patch-based discriminator from  pix2pix. Ideally, the proposed hierarchy of patch-based discriminators, whereas each level captures the statistics of a different scale. Similar to the generator of  progressive growing GANs, they start from training the small scales first, with the difference that when one scale is trained they freeze the weights. Furthermore they used the gradient penalty  Wasserstein GAN, to stabilize the training process.\n    The generation of an image sample starts at the coarsest scale and sequentially passes through all generators up to the finest scale. The  typical workflow of a single scale works like this: 5 conv. blocks followed by batch normalization and a ReLU activation process the upsampled image. Before the hallucinated image is fed in the network, noise is added. The spatial dimension is kept throughout the block, with padding of 1 and kernel 3 by 3. Therefore, a short additive skip-connection can be added, fusing the upsampled image to the output of the block. This concept significantly helps the model to converge faster, as we have already seen in a lot of approaches. All the above can be illustrated below:\n Building block of the generator of one scale of SinGAN. Image is taken from the  original work\n Importantly, following other successful works ( BigGAN,  StyleGAN), noise is injected at every scale. The reason is that we don’t want the generator to memorize the previous scale, since it’s training is stopped. In the same direction, the different GANs have  small receptive fields and limited learning capacity. Intuitively, we don’t want the patches to memorize the input, since we only train with a single image. Limited capacity refers to the small number of parameters.\n As a reference, the effective receptive field at the starting level is roughly 50% of the image’s height. Thus, it can generate the general layout of the image (global structure). The pre-described block has a receptive field of 11x11, so usually input images start at the scale of 25 pixels.\n  Interestingly, they chose to design the model in a way that when you choose zero as input noise and a fixed noise for the last layer (z_fixed) the network should be trained to reconstruct the original image.\n\\[L_{rec} = || G_{n}(noise=0,x_{upsampl}^{rec}) - x_{n}^{real} ||^2\\]\\[L_{rec} = || G_{last}(noise = z_{fixed},x_{upsampl}^{rec}) - \\textbf{I}^{real} ||^2\\] If we regard the real image as the zero point of the distribution  the reconstruction loss is a measure of standard deviation. Therefore, the reconstructed image \\(x_rec\\) determines the standard deviation of the noise for each scale.\n  Inspecting the outputs of the model, we observe that the generated images are realistic, while they preserve the original image content. Since the model has a limited receptive field in each patch (smaller than the entire image), it is possible to  generate new combinations of patches that did not exist in the input image. Below you can see how the model encounters the structure of externally injected models. We note that SinGAN preserves the structure of the pasted object, while it adjusts its appearance and texture.\n  Based on the plenty results of this work, it is easy to infer that the SinGAN model can generate realistic random image samples. Surprisingly, even with new structures and object modulations. Still, it learns to preserve the image/patch distribution.\n For the record, the authors have also explored SinGAN for other image manipulation tasks. Given a trained model, their idea was to utilize the fact that SinGAN learns the patch distribution of the training image. Hence, manipulation can be achieved by injecting an image into the generation pyramid. Intuitively, the model will attempt to match its patch distribution to that of the training image. Applications include image super-resolution, paint-to-image, harmonization, image editing, and  even animation from a single image by “walking” the latent space!\n The official video summarizes the aforementioned contributions of this work that we described in this tutorial.\n   We carefully inspected the top performing methods on image synthesis from a segmentation map, as well as learning from just a single image. For the hungry readers we always like to leave a thoughtful highly-recommended link. So, now that you learned a lot of things about what designing and training a GAN looks like, we recommend exploring the open questions on the field, perfectly described in this  article by Odena et al. 2019. You can always find more papers that might be closer to your problem  here. Lastly, you don’t need to implement every architecture by yourself. There is an awesome GAN git repository in  Keras and  Pytorch that contains multiple implementations. Feel free to check them out.\n This is the last article of the series for now. But note that the GANs in computer vision series will remain open to include new papers in the future, as well as existing ones we might have missed. We are currently preparing a free e-book that summarizes our conclusions and concatenates all of our articles into a single resource. If you want to express your interest subscribe to our  newsletter to receive it straight into your inbox.\n   @ article { adaloglou2020gans ,  title  =  &#34;GANs in computer vision&#34; ,  author  =  &#34;Adaloglou, Nikolas and Karagianakos, Sergios&#34; ,  journal  =  &#34;https://theaisummer.com/&#34; ,  year  =  &#34;2020&#34; ,  url  =  &#34;https://theaisummer.com/gan-computer-vision-semantic-synthesis/&#34; }\n  Park, T., Liu, M. Y., Wang, T. C., &amp; Zhu, J. Y. (2019).  Semantic image synthesis with spatially-adaptive normalization. In  Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (pp. 2337-2346).\n  Shaham, T. R., Dekel, T., &amp; Michaeli, T. (2019).  Singan: Learning a generative model from a single natural image. In  Proceedings of the IEEE International Conference on Computer Vision (pp. 4570-4580).\n    He, K., Zhang, X., Ren, S., &amp; Sun, J. (2016). Deep residual learning for image recognition. In  Proceedings of the IEEE conference on computer vision and pattern recognition (pp. 770-778).\n    Chen, L. C., Papandreou, G., Kokkinos, I., Murphy, K., &amp; Yuille, A. L. (2017). Deeplab: Semantic image segmentation with deep convolutional nets, atrous convolution, and fully connected crfs.  IEEE transactions on pattern analysis and machine intelligence,  40(4), 834-848.", "posttime": "2020-06-02 22:32:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "图像,image", "title": "语义图像合成与单幅图像生成模型的学习", "title_en": "Semantic image synthesis and learning a generative model from a single image", "transed": 1, "url": "https://theaisummer.com/gan-computer-vision-semantic-synthesis/", "via": "", "real_tags": ["图像", "image"]}, {"category": "", "categoryclass": "", "imagename": "4d88700a41168dbaefab5e1c8942ab2c.jpg", "infoid": 1004828, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有些人看着方程式，看到的是一堆数字和符号；另一些人看到的是美。多亏了卡内基梅隆大学(Carnegie Mellon University)发明的一种新工具，任何人现在都可以将数学的抽象转化为美丽而有启发性的插图。该工具使用户只需键入一个普通的数学表达式，然后让软件绘制即可创建图表。与图形计算器不同，这些表达式不仅限于基本函数，还可以是任何数学领域的复杂关系。\n研究人员以著名数学家和物理学家罗杰·彭罗斯(Roger Penrose)的名字将其命名为彭罗斯(Penrose)，彭罗斯以使用图表和其他图画交流复杂的数学和科学思想而闻名。\n计算机科学和机器人学助理教授基南·克兰(Keenan Crane)说，一些数学家有用手画漂亮图表的天赋，但黑板一擦掉，他们就消失了。我们想让任何人都能获得这种表现力。\n图表在技术交流中往往没有得到充分利用，因为制作高质量的数字插图超出了许多研究人员的技能，需要大量乏味的工作。\n彭罗斯通过使图表绘制专家能够对他们将如何在系统中进行编码来解决这些挑战。然后，其他用户可以使用熟悉的数学语言访问这一功能，让计算机来做大部分繁琐的工作。\n研究人员将在SIGGRAPH2020计算机图形和交互技术会议上介绍彭罗斯，由于新冠肺炎的流行，该会议实际上将于今年7月举行。\n计算机科学系的博士生凯瑟琳·叶(Katherine Ye)说，我们一开始问的是：人们是如何将数学思想转化为脑海中的图片的？&#34；&34；计算机科学系的博士生凯瑟琳·叶(Katherine Ye)说。我们系统的秘诀是让人们能够很容易地向计算机解释这个翻译过程，这样计算机就可以完成实际制作图片的所有繁重工作。\n一旦计算机了解到用户想要如何可视化--例如，一个用小箭头表示的矢量，或者一个用点表示的点--它就会使用这些规则来绘制几个候选图表。然后，用户可以从各种可能性库中选择和编辑他们想要的图表。\n克兰说，研究小组为此开发了一种特殊的编程语言，数学家应该可以毫不费力地学习。\n他解释说，数学家可能会对记数法非常挑剔。我们让他们定义他们想要的任何符号，这样他们就可以自然地表达自己。\n一个跨学科的团队开发了彭罗斯。除了叶和克兰，该团队还包括尼莫·尼(Nimo Ni)和詹娜·怀斯(Jenna Wise)，他们都是芝加哥大学软件研究所(ISR)的博士生；乔纳森·奥尔德里奇(Jonathan Aldrich)，ISR教授；约书亚·桑夏恩(Joshua Sunsun)，ISR高级研究员；认知科学本科生马克斯·克里格(Max Krieger)；以及多·马·阿扬(Dor Ma&39；Ayan)，他曾是以色列理工学院的硕士学生。\n克莱恩说，我们的愿景是能够从图书馆里翻出一本旧的数学教科书，把它扔进图书馆，然后得到一本插图精美的书--这样更多的人才能理解。他指出彭罗斯是迈向这一目标的第一步。引用：卡内基梅隆大学工具自动将数学转化为图片(2020年6月2日)，从https://techxplore.com/news/2020-06-carnegie-mellon-tool-automatically-math.html检索。\n本文档受版权保护。除为私人学习或研究的目的而进行的任何公平交易外，未经书面许可不得复制任何部分。提供的内容仅供参考。", "note_en": "Some people look at an equation and see a bunch of numbers and symbols; others see beauty. Thanks to a new tool created at Carnegie Mellon University, anyone can now translate the abstractions of mathematics into beautiful and instructive illustrations.    The tool enables users to create diagrams simply by typing an ordinary mathematical expression and letting the software do the drawing. Unlike a graphing calculator, these expressions aren&#39;t limited to basic functions, but can be complex relationships from any area of mathematics.\n  The researchers named it Penrose after the noted mathematician and physicist Roger Penrose, who is famous for using diagrams and other drawings to communicate complicated mathematical and scientific ideas.\n  &#34;Some mathematicians have a talent for drawing beautiful diagrams by hand, but they vanish as soon as the chalkboard is erased,&#34; said Keenan Crane, an assistant professor of computer science and robotics. &#34;We want to make this expressive power available to anyone.&#34;\n  Diagrams are often underused in technical communication, since producing high-quality, digital illustrations is beyond the skill of many researchers and requires a lot of tedious work.\n  Penrose addresses these challenges by enabling diagram-drawing experts to encode how they would do it in the system. Other users can then access this capability using familiar mathematical language, leaving the computer to do most of the grunt work.\n  The researchers will present Penrose at the SIGGRAPH 2020 Conference on Computer Graphics and Interactive Techniques, which will be held virtually this July because of the COVID-19 pandemic.\n   &#34;We started off by asking: &#39;How do people translate mathematical ideas into pictures in their head?&#39;&#34; said Katherine Ye, a Ph.D. student in the Computer Science Department. &#34;The secret sauce of our system is to empower people to easily &#39;explain&#39; this translation process to the computer, so the computer can do all the hard work of actually making the picture.&#34;\n  Once the computer learns how the user wants to see   visualized—a vector represented by a little arrow, for instance, or a point represented as a dot—it uses these rules to draw several candidate diagrams. The user can then select and edit the diagrams they want from a gallery of possibilities.\n     The research team developed a special programming language for this purpose that mathematicians should have no trouble learning, Crane said.\n  &#34;Mathematicians can get very picky about notation,&#34; he explained. &#34;We let them define whatever notation they want, so they can express themselves naturally.&#34;\n  An interdisciplinary team developed Penrose. In addition to Ye and Crane, the team included Nimo Ni and Jenna Wise, both Ph.D students in CMU&#39;s Institute for Software Research (ISR); Jonathan Aldrich, a professor in ISR; Joshua Sunshine, an ISR senior research fellow; cognitive science undergraduate Max Krieger; and Dor Ma&#39;ayan, a former master&#39;s student at the Technion-Israel Institute of Technology.\n  &#34;Our vision is to be able to dust off an old math textbook from the library, drop it into the   and get a beautifully illustrated book—that way more people understand,&#34; Crane said, noting that Penrose is a first step toward this goal.             Citation: Carnegie Mellon tool automatically turns math into pictures (2020, June 2) retrieved 2 June 2020 from https://techxplore.com/news/2020-06-carnegie-mellon-tool-automatically-math.html\n  This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.", "posttime": "2020-06-02 22:32:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大学,梅隆,mellon,数学", "title": "卡内基梅隆大学的工具自动将数学转化为图片", "title_en": "Carnegie Mellon tool automatically turns math into pictures", "transed": 1, "url": "https://techxplore.com/news/2020-06-carnegie-mellon-tool-automatically-math.html", "via": "", "real_tags": ["大学", "梅隆", "mellon", "数学"]}, {"category": "", "categoryclass": "", "imagename": "33f07cd33a81499fb94a88d96a6226d8.jpeg", "infoid": 1004826, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "社交媒体已经成为美国各地抗议活动的中心战场，科技平台放大了紧张局势，同时也提供了骚乱和警方反应的实时记录，否则这些事件可能不会得到广泛关注。\n上周一，旁观者达内拉·弗雷泽(Darnella Frazier)在Facebook上发布了一段导致乔治·弗洛伊德(George Floyd)死亡的暴力逮捕的孤独视频，目前已有5.2万人分享，并在Twitter、Instagram和其他社交平台上传播，扩大了人们对.", "note_en": "Social media has become a central battleground for the protests across the U.S., with tech platforms amplifying tensions while also providing a real-time chronicle of the riots and police responses that might not have otherwise gained widespread attention.\n  A lone video of the violent arrest that led to the death of George Floyd posted last Monday on Facebook by a bystander, Darnella Frazier, has been shared by 52,000 people there and found its way to Twitter, Instagram and other social platforms, widening awareness of the...", "posttime": "2020-06-02 22:14:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "媒体,media,平台", "title": "社交媒体成为持续数日的街头抗议的战场", "title_en": "Social Media Becomes Battleground Over Days of Street Protests", "transed": 1, "url": "https://www.wsj.com/articles/social-media-becomes-battleground-over-days-of-street-protests-11591018647", "via": "", "real_tags": ["媒体", "media", "平台"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004824, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "MLScraping Products API是一个允许您从任何电子商务网站上抓取数据的API。\n它使用深度神经网络从互联网上的任何产品页面自动检测和提取相关产品信息。\n使用MLScrapl的好处是，您不再需要为许多不同的网站构建和维护抓取规则，而是可以使用一个API从各种各样的网站提取数据。\n这个原型仍在进行中，但我想在这个阶段获得一些反馈，以便在进一步开发API时决定优先考虑哪些功能。", "note_en": "MLScrape Products API is an API that allows you to scrape data from  any e-commerce website.\n  It uses  deep neural networks to automatically detect and extract relevant product information from any product page on the internet.\n  The benefit of using MLScrape is that you no longer need to build and maintain scraping rules for lots of different websites, but can instead use  one API to extract data from a wide variety of websites.\n  This prototype is still a work in progress but I wanted to get some feedback on it at this stage in order to decide what features to priorities as I further develop the API.", "posttime": "2020-06-02 22:12:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "神经网络,neural,api", "title": "使用神经网络抓取产品数据的API", "title_en": "API that uses neural networks to scrape product data", "transed": 1, "url": "https://mlscrapedemo.herokuapp.com/", "via": "", "real_tags": ["神经网络", "neural", "api"]}, {"category": "", "categoryclass": "", "imagename": "f9363e519ec5716ac5ff584047cba0a7.jpeg", "infoid": 1004823, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "让人们收听警用扫描仪的应用程序已经飙升至应用程序商店的榜首。", "note_en": "Apps that let people listen to police scanners have skyrocketed to the top of the App Store.", "posttime": "2020-06-02 21:55:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "监控,monitoring,应用程序", "title": "在乔治·弗洛伊德抗议期间，数千人在监控警方的扫描仪", "title_en": "Thousands Are Monitoring Police Scanners During the George Floyd Protests", "transed": 1, "url": "https://www.vice.com/en_us/article/pkybn8/police-radio-scanner-apps-george-floyd-protests", "via": "", "real_tags": ["监控", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "8dacff15c4e386de80219b03cdf25c94.jpg", "infoid": 1004822, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ProPublica是一个调查滥用权力的非营利性新闻编辑室。注册后即可收到我们最重要的新闻。\n美联储主席杰罗姆·鲍威尔和财政部长史蒂文·姆努钦已经成为3万亿美元联邦冠状病毒救助计划的公众面孔。然而，在幕后，财政部的责任主要落在了42岁的副部长贾斯汀·穆齐尼奇(Justin Muzinich)身上。\n到目前为止，这笔救助的主要受益者是Muzinich&amp；Co.，这家由他父亲创立的资产管理公司，贾斯汀在加入政府之前曾在该公司担任总裁。他报告称，在2017年进入政府时，他拥有至少价值6000万美元的股份。\n今天，穆齐尼奇通过一笔不透明的交易保持着与公司的财务联系，在交易中，他将自己在私人持股公司的股份转让给了他的父亲。伦理专家说，这一安排令人担忧，因为他的父亲没有预先拿到股份，而且穆齐尼奇似乎可以在离开政府后简单地拿回他的股份。", "note_en": "ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive  our biggest stories as soon as they’re published.\n  Federal Reserve Chairman Jerome Powell and Treasury Secretary Steven Mnuchin have become the public faces of the  $3 trillion federal coronavirus bailout. Behind the scenes, however, the Treasury’s responsibilities have fallen largely to the 42-year-old deputy secretary, Justin Muzinich.\n  A major beneficiary of that bailout so far: Muzinich &amp; Co., the asset manager founded by his father where Justin served as president before joining the administration. He reported owning a stake worth at least $60 million when he entered government in 2017.\n  Today, Muzinich retains financial ties to the firm through an opaque transaction in which he transferred his shares in the privately held company to his father. Ethics experts say the arrangement is troubling because his father received the shares for no money up front, and it appears possible that Muzinich can simply get his stake back after leaving government.", "posttime": "2020-06-02 21:55:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "救助,official", "title": "财政部官员正在实施救助计划。这对他的家人来说是件好事", "title_en": "Treasury official is running the bailout.  It’s been great for his family", "transed": 1, "url": "https://www.propublica.org/article/this-treasury-official-is-running-the-bailout-its-been-great-for-his-family", "via": "", "real_tags": ["救助", "official"]}, {"category": "", "categoryclass": "", "imagename": "a49e4dcb3140c9746886213bda32aca2.jpeg", "infoid": 1004821, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着乔治·弗洛伊德被谋杀后美国各地爆发骚乱，种族关系再次成为美国的中心舞台。尽管人们非常关注美国发生的社会不平等，但我们也应该更深入地关注经济不平等。\n因为我相信，如果美国有色人种拥有更多的经济实力，他们所经历的许多社会问题都会得到极大的缓解。在我们开始讨论之前，让我们先看看种族贫富差距的大小，看看目前的情况。\n为了弄清楚种族造成的财富不平等有多严重，我将使用消费者财务调查(SCF)提供的净值数据。作为快速复习，净值定义为：\n其中资产是您拥有的一切(即房子、汽车、银行账户、证券、租赁物业等)。而负债是指你欠他人的一切(如信用卡债务、学生贷款债务、抵押贷款等)。\n当我们看一下按种族划分的净资产中值时，我们可以看到，2016年白人家庭和黑人家庭之间的种族贫富差距是10倍：\n这可能很难相信，但在美国，典型的白人家庭拥有的财富(171,000美元)是典型的黑人家庭(17,000美元)的10倍。\n我之所以说“典型”，是因为中位数衡量的是特定群体中的中等家庭。与平均水平相比，中位数是一个更有用的衡量标准，因为它排除了离群值(即以白人为主的超级富豪家庭)的影响。\n但是，如果你是一个优秀的小统计学家，那么你可能会争辩说，这个比较是不公平的，因为它没有考虑到太多其他影响财富积累的因素。\n例如，如果我们知道黑人家庭的教育程度普遍低于白人家庭，那么种族贫富差距可能只是说明了教育对获得财富的影响，而不是种族本身的影响。\n我之前已经讨论过教育对净资产的影响，但控制教育能解决种族贫富差距吗？\n不幸的是，即使我们控制一个家庭的教育水平，白人和非白人家庭之间的贫富差距仍然存在，事实上，拥有大学学历的中位黑人家庭的净资产与没有高中文凭的中位白人家庭的净资产相当。\n是的，你没看错。在白人家庭没有高中教育的过去，大学学位几乎不能让黑人家庭获得学位。\n在下面的图表中，你可以更清楚地看到这一点，该图表按种族和教育水平划分了净资产的中位数(注：每个子图的y轴各不相同，以强调种族之间的差异，而不是教育程度的差异)：\n正如你所看到的，拥有大学学位的典型黑人家庭的净资产为6.8万美元，而典型的没有高中文凭的白人家庭的净资产为6.2万美元。在我在这个博客上制作的数千张图表中，这一张可能是最令人震惊的。不幸的是，这一发现可能只是贫富差距冰山一角。\n波士顿联邦储备银行的一份报告发现，波士顿美国出生的黑人家庭的净资产中值只有8美元，而加勒比海出生的黑人家庭的净资产为12,000美元，同一地区的白人家庭的净资产为247,500美元。*再一次，你没有读错…。8美元，而不是247,500美元！\n然而，更重要的是，波士顿出生的黑人家庭和出生在美国的黑人家庭之间的差距表明，SCF(上图)的黑人净值数据可能会因为美国出生的外国黑人家庭而略有上升。\n这意味着，尽管财富不平等对美国黑人家庭总体来说是糟糕的，但对于那些在美国出生的黑人家庭来说，情况可能更糟。\n不过，我不希望你将上述数据解读为“教育对缩小种族贫富差距毫无作用”，但事实并非如此。\n还记得我早些时候说过，白人家庭的净资产中位数(171,000美元)是黑人家庭净资产中位数(17,000美元)的10倍吗？那么，在受过大学教育的家庭中，白人家庭的净资产中位数只是黑人家庭(399,000美元对68,000美元)的6倍。\n这是大学学位有助于缩小种族贫富差距的一些证据，但这并不足以完全解释这一点。\n在前面的部分中，我们试图通过控制家庭的教育水平来调整种族贫富差距。然而，我们并不真正关心家庭的教育水平，而是教育如何影响家庭的收入。因此，通过将家庭划分为收入群体，然后比较他们的财富，直接调整收入可能更有意义。\n使用2016年SCF的数据，我发现的四个收入四分位数是&lt；$25,000到$5万，$50,000到$100,000+，这意味着四分之一的美国家庭的收入是&lt；$25,000美元，四分之一是$25,000到$50,000，以此类推。\n在以这种方式计算家庭收入，然后按种族计算净资产中位数后，贫富差距缩小得更多：\n如你所见，白人家庭的净资产中位数现在只比黑人家庭的净资产中位数高出三到四倍，除了一个收入群体外，直接控制收入已经将种族财富差距从10倍缩小到了3到4倍。\n然而，这一差距仍未接近于零，因此正在发生其他事情。\n作为过去几年每周都在写关于投资的人，我理解复利对制度的影响。当我审视种族贫富差距时，我看到的只是几个世纪以来发挥作用的负复利。\n我看到了大大小小的歧视行为，几十年来累积起来，美国典型的黑人家庭的起点远远比典型的白人家庭差得多。\n例如，假设某人因为种族原因被阻止在某个地区买房。我想像一下这可能会如何影响他们孩子的教育质量和孩子一生的收入。*正如我之前写过的那样，即使是初始条件的微小变化也会影响你最终的生活方式。而这只是一次种族主义行为。\n如果这些孩子非但没有失去更好的教育，反而失去了父母？我们可以想象一下，如果没有父母的经济支持，他们的境况会变得多么糟糕。你一遍又一遍地运行这个逻辑，很容易看出种族贫富差距是如何产生的。\n这不只是一次的劣势。正是歧视的累积效应对个人、他们的社区，以及最终对他们创造财富的能力产生了负面影响。\n例如，当奴隶制在1865年结束时，大多数黑人家庭一开始就没有经济基础。他们得到的任何经济基础，就免费土地而言，通常都会在几年后被收回。*当你一开始就没有任何财富时，很难复合财富。克利夫兰联邦储备银行的研究人员在研究种族贫富差距时也得出了类似的结论。研究人员在分析了之前关注贫富差距的研究后表示：\n因为在这些研究中，可观察到的特征和财富之间的关系是在很短的时间内估计的，所以他们可能低估了初始条件和收入差距对未来财富的重要性。\n你猜怎么着？SCF净值数据也支持这一断言。让我解释一下。\n到目前为止，我们已经按种族、教育程度和收入对净资产进行了细分，但我们还没有研究任何涉及时间对财富积累的影响的因素。从技术上讲，我们没有能力跟踪SCF数据中的每一个家庭随着时间的推移，但我们确实有每个家庭的年龄。\n那么，如果我们试着将年轻的白人家庭与处境相似的年轻的黑人家庭进行比较，然后看看这些家庭未来的表现会怎么样？\n基本上，这个想法是控制黑人和白人家庭之间相似的起始财富水平，看看这是否预示着未来的财富。\n以下是按种族划分的所有35岁以下美国家庭净资产中位数的图表：\n如你所见，35岁以下的黑人家庭的净资产中位数为2,000美元，而白人家庭的净资产中位数为20,000美元。\n如果你想找到一个35岁以下的黑人家庭可以与35岁以下的白人家庭的中位数相媲美，那么黑人家庭需要处于第80个百分位数(约合2.3万美元)。这意味着35岁以下的黑人家庭必须跻身前20%，才能拥有与35岁以下的典型白人家庭类似的财富。\n好的，现在这里就是戏法出现的地方。我想象一下这些家庭(中位数白人和第80%黑人)30年后他们65-74岁的时候。\n当然，我们没有未来的净资产数据，但我们确实有今天65-74岁的白人和第80个百分位数的黑人家庭的净资产中位数数据，而这个数据显示，65-74岁的白人家庭的净资产中位数为30.2万美元，而65-74岁的黑人家庭的净资产中位数为26.7万美元。\n302,000美元对267,000美元！这是到目前为止我们离“缩小”种族差距最近的一次。我们之所以能够做到这一点，是因为我们控制了初始条件(即开始财富)。\n请注意，这并不意味着向年轻的黑人家庭转移现金就能解决这个问题，因为让这些家庭过得更好的不是钱本身，而是让他们一开始就能积累这笔钱的潜在因素。\n例如，这些年轻家庭可能有更高的收入，更强大的支持网络，或者更好的财务习惯。我不知道。但是通过控制起家财富，你就可以获得那些可以预测未来财富的东西。\n无论如何，这个思维实验没有抓住要点。“因为典型的黑人家庭和典型的白人家庭之间的实际贫富差距是10倍。”我们不应该为了解释这个问题而根据教育或收入进行调整。但这本身就是失败。\n相反，我们应该问问自己，为什么黑人家庭和白人家庭在教育和收入方面会有如此巨大的差距，这是我们必须从这里开始的。\n在这一点上，很明显，对于美国黑人家庭来说，经济不平等和社会不平等一样是一个大问题。正如我在本文开头所建议的那样，如果我们想要减少社会不平等，我们就必须减少经济不平等。\n不相信我？我想一想小马丁·路德·金。1968年2月在“今夜秀”上说：\n经济问题可能是黑人社区面临的最严重的问题，我可以说，也是穷人普遍面临的最严重的问题。\n他为什么这么说？可能是因为他认识到金钱在我们社会中的至高无上的重要性。\n钱驱动着世界。如果每个人都理解它，它是我们可以用来影响变革的主要工具。无论这意味着创业，帮助有需要的人，还是支持支持我们事业的政客，钱都是一切的中心。\n去拿他妈的钱。我是认真的，…。得到它。它将被制造。它将被分配。而且你有道德上的义务来确保，如果你有一个重要的观点，并且你想要反映它，你就会得到它。\n我去拿。其他人也会去拿。然后就会是一场关于观点的竞争…。在没有资本的情况下，你是无关紧要的。有了资本，你就是强大的。然后你再做决定。\n我完全同意。当然，“拿到他妈的钱”说起来容易做起来难。那我们怎么才能确保每个人都有更公平的机会拿到钱呢？\n这是否意味着基本收入？为所有人提供更多的社会安全网？增加对幼儿教育的投资？\n我不知道。但我们需要尽早为尽可能多的人创造公平的竞争环境。我们需要真正的机会平等，而不仅仅是机会平等的形象。\n因为这真的不是关于黑人或白人，而是关于成为我们所说的我们是谁。我们这么长时间以来一直说我们是谁。\n如果我们是美利坚合众国，每个人都应该有多少相似的机会做到这一点，那么我们就应该证明这一点。我们应该把钱放在嘴边，最终让美国梦成为现实。…。对每个人来说。\n这里是188班次。我与这篇文章相关的任何代码都可以在这里找到，编号相同：https://github.com/nmaggiulli/of-dollars-and-data", "note_en": "As riots erupt across America following  the murder of George Floyd, race relations have once again taken center stage in the United States.  Though there is a lot of focus on the  social inequalities occurring in the U.S., we should also take a deeper look at the  economic inequalities as well.\n Because it is my belief that many of the social issues experienced by people of color throughout America would be greatly mitigated if they had more economic power.  Before we get to that discussion, let’s examine the size of the racial wealth gap to see where things stand currently.\n  To figure out just how stark wealth inequality is by race, I will be using the net worth data provided by the  Survey of Consumer Finances (“SCF”).  As a quick refresher, net worth is defined as:\n  Where assets are everything that you  own (i.e. house, car, bank accounts, securities, rental properties, etc.) while liabilities are everything that you  owe to others (i.e. credit card debt, student loan debt, mortgage, etc.)\n When we look at the  median net worth by race we can see that racial wealth gap between White households and Black households was a factor of 10 in 2016:\n   It might be hard to believe, but  the typical White household has 10 times as much wealth ($171,000) as the typical Black household ($17,000) in the U.S.\n I say “typical” because the median measures the middle household within a particular group.  In comparison to the average, the median is a far more useful metric because it excludes the effects of outliers (i.e. superrich households that are mostly White).\n But if you are a good little statistician then you might argue that this comparison isn’t fair because it doesn’t adjust for so many other factors that influence wealth accumulation.\n For example, if we know that Black households generally have lower educational attainment than White households, then the racial wealth gap might just be illustrating the influence of education on acquiring wealth and not the influence of race itself.\n I have previously discussed the impact of education on net worth generally, but will controlling for education fix the racial wealth gap?\n  Unfortunately, even when we control for a household’s education level, the wealth gap still exists between White and non-White households.  In fact,  the median Black household  with  a college degree has a net worth similar to the median White household  without  a high school diploma.\n Yes, you read that right.  A college degree barely gets a Black household past where a White household is with no high school education.\n You can see this more clearly in the plot below which breaks out the median net worth by race and education level (note: the y-axis varies in each subplot to emphasize the difference between races rather than the differences in educational attainment):\n   As you can see, the typical Black household  with a college degree has a net worth of $68,000 while the typical White household  with no high school diploma has a net worth of $62,000.  Of the thousands of charts that I have produced on this blog, this one might be the most shocking.  Unfortunately, this finding may just be the tip of the wealth gap iceberg.\n A report from the Federal Reserve Bank of Boston found that U.S. born Black households in Boston only had a median net worth of $8 compared to $12,000 for Caribbean-born Black households and $247,500 for White households in the same area.  Once again, you did read that correctly…$8 compared to $247,500!\n More importantly though, the gap found between U.S. born Black households and foreign-born Black households in Boston suggests that the Black net worth data from the SCF (the image above) might be slightly  skewed upward because of foreign-born Black households in the U.S.\n This implies that, as bad as wealth inequality is for Black households in the U.S. generally, it is likely worse for those U.S. born Black households.\n However, I don’t want you to interpret the above data as “education does nothing to close the racial wealth gap.”  This isn’t true.\n Remember earlier when I said that the median net worth of White households ($171,000) was 10 times that of the median net worth of Black households ($17,000)?  Well, among the college-educated, White households only have a median net worth  six times greater than Black households ($399,000 vs. $68,000).\n This is some evidence that a college degree can help to reduce the racial wealth gap, but it isn’t enough to fully explain it away.\n  In the prior section, we tried to adjust for the racial wealth gap by controlling for the education level of a household.   However, we don’t  really care about the education level of households, but how that education affects a household’s income.  Therefore, it probably makes more sense to adjust for income directly by bucketing households into income groups and then comparing their wealth.\n Using the 2016 SCF data, the four income quartiles I found were &lt;$25,000, $25,000 to $50,000, $50,000 to $100,000, and $100,000+.  This means that 1/4 of U.S. households have an income &lt;$25,000, 1/4 have an income of $25,000 to $50,000, and so forth.\n After bucketing household income in this way and  then looking at the median net worth by race, the wealth gap closes considerably more:\n   As you can see, the median net worth of White households is now only three to four times more than the median net worth for Black households in all but one of the income groups.  Controlling for income directly has shrunk the racial wealth gap from a factor of 10 to a factor of three to four.\n However, the gap still isn’t close to zero, so something else is going on.\n  As someone who has  written about investing every week for the past few years, I understand the effects of compounding on systems.  And when I look at the racial wealth gap, all I see is centuries worth of  negative compounding at work.\n I see discriminatory acts both large and small that have added up over decades and decades to leave the typical Black household in the U.S. at a far worse  starting point than the typical White household.\n For example, say someone is prevented from buying a home in a certain area because of their race.  Imagine how that might affect the quality of their children’s education and their children’s lifetime income.  As  I have written about before,  even a small change in initial conditions can affect where you end up in life.  And that is just one racist act one time.\n What if instead of losing a better education, those children lost a parent?  Imagine how much worse off they would be without the economic support of their mother or father.  You run this logic over and over and it’s easy to see how the racial wealth gap can come about.\n It’s not just one disadvantage one time. It is the  cumulative effect of discrimination that negatively compounds on individuals, their communities, and, ultimately, their ability to build wealth.\n For example, when slavery ended in 1865, most Black families had  no economic base to start from.  And whatever economic base they were offered, in terms of free land,  was typically taken back years later.  It’s hard to compound wealth when you don’t have any in the first place. Researchers at the Federal Reserve Bank of Cleveland  came to a similar conclusion when they studied the racial wealth gap as well.  After analyzing prior studies that looked at the gap, the researchers stated:\n  Because the relationships between observable characteristics and wealth are estimated over short periods of time in those studies, they are likely underestimating the importance of initial conditions and income disparities for future wealth.\n And guess what?  The SCF net worth data supports this assertion as well.  Let me explain.\n So far we have broken out net worth by race, education, and income, but we haven’t looked at anything that involves time’s impact on wealth accumulation.  We technically don’t have the ability to follow each of the households in the SCF data over time, but we do have the age of each household.\n So what if we try to compare young White households to  similarly situated young Black households and then see how these households do in the future?\n Basically, the idea is to control for similar levels of  starting  wealth between Black and White households and see if this is predictive of  future wealth.\n Below is a plot of the median net worth of all U.S. households under age 35 by race:\n   As you can see, Black households under 35 have a median net worth of $2,000 compared to $20,000 for their White counterparts.\n If you wanted to find a Black household under 35 comparable to the median White household under 35, the Black household would need to be at the 80th percentile (~$23,000).   This means that a Black household under age 35 has to be in the top 20% to have similar wealth to a typical White household under age 35.\n Okay, now here is where the trick occurs.  Imagine these households (the median White and the 80th percentile Black) three decades in the future when they are age 65-74.\n Of course, we don’t have future net worth data, but we do have net worth data for the median White and 80th percentile Black households aged 65-74 today.  And this data shows that the median net worth of a White household aged 65-74 is $302,000 while the 80th percentile net worth of a Black household 65-74 is $267,000.\n $302,000 vs. $267,000!  That’s the closest we have been to “closing” the racial gap thus far.  And we were only able to do it because we controlled for initial conditions (i.e. starting wealth).\n Note that this doesn’t imply that a cash transfer to young Black households will fix this problem.  Because it isn’t the money itself that makes these households better off, but  the underlying factors that allowed them to accumulate that money in the first place.\n For example, these young households may have higher income, a stronger support network, or better financial habits. I don’t know.  But by controlling for starting wealth, you pick up those things that are predictive of future wealth.\n Regardless, this thought experiment misses the point.  Because the  actual wealth gap between a typical Black household and a typical White household is a factor of 10.  We shouldn’t have to adjust for education or income to explain it away.  This, in itself, is defeat.\n Instead, we should ask ourselves why there is a massive gap in education and income between Black households and White households in the first place.  This is where we must start.\n  At this point it should be evident that economic inequality is as big of an issue as social inequality for Black households in the U.S.  And, as I suggested at the beginning of this piece, if we want to reduce social inequality, we  must reduce economic inequality.\n Don’t believe me?  Consider what Martin Luther King Jr.  said on the Tonight Show in February 1968:\n The economic problem is probably the most serious problem confronting the Negro community, and, I might say, the most serious problem confronting poor people generally.\n Why did he say this?  Probably because he recognized the utmost importance of money in our society.\n Money drives the world.  Everyone understands it and it is the primary tool that we can use to affect change.  Whether that means starting a business, helping the needy, or supporting politicians that champion our causes, money is at the center of it all.\n  Get the fuckin’ money.  I’m serious…Get it.  It is going to be made.  It is going to be allocated.  And you have a moral imperative to make sure that, if you have a point of that matters and you wanna reflect it, you get it.\n I’m gonna go get it.  Other people are gonna go get it.  Then it will be about a competition of views…In the absence of capital you’re irrelevant.  With capital, you’re powerful.  And then you decide.\n And I couldn’t agree more.  Of course “get the fuckin’ money” is easier said than done.  So how might we ensure that everyone has a fairer chance of getting it?\n  Does that mean a basic income?  More social safety nets for all?  Higher investment in early childhood education?\n I don’t know.  But we need to even the playing field for as many people as possible as early as possible.  We need true equality of opportunity not just  the image of equality of opportunity.\n Because this isn’t really about black or white.  It’s about being who we say we are.  Who we’ve said we were for so long.\n And if we are the United States of America, where everyone is supposed to have a somewhat similar chance of making it, then we should prove it.  We should put our money where our mouth is, and finally make the American dream into a reality…for everyone.\n   This is post 188. Any code I have related to this post can be found here with the same numbering:  https://github.com/nmaggiulli/of-dollars-and-data", "posttime": "2020-06-02 21:54:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "财富,racial,家庭", "title": "种族财富差距有多大？", "title_en": "How Big Is the Racial Wealth Gap?", "transed": 1, "url": "https://ofdollarsanddata.com/racial-wealth-gap/", "via": "", "real_tags": ["财富", "racial", "家庭"]}, {"category": "", "categoryclass": "", "imagename": "97b28a89dc9da4888a020b7ad9b6b103.jpg", "infoid": 1004820, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们的冠状病毒保险在头24小时内是免费的。有关最新信息，请访问tampabay.com/coronavirus。请考虑认购或捐赠。\n乔·奇遇的臭名昭著的私人动物园将很快成为坦帕虎保护区的财产。\n俄克拉荷马州的一名联邦法官周一裁定，包含Greater Wynnewood外来动物公园的16英亩土地必须在120天内移交给Big Cat Rescue Corp.。判决中包括动物园员工居住的几座建筑和一支车队。\n这家私人动物园，前身为G.W.动物园，曾在Netflix的虎王节目中大肆亮相。该系列记录了古怪的动物园饲养员约瑟夫·马尔多纳多·帕萨奇(Joseph Maldonado-Passage)的生活，他更为人所知的名字是乔·异国情调，以及他与坦帕保护区大猫救援公司首席执行官兼创始人卡罗尔·巴斯金(Carole Baskin)的长期不和。\n2013年，在针对异域风情的商标侵权诉讼中，大猫救援公司获得了100万美元的赔偿。动物园的财产后来转移到了异国情调的母亲雪莉·施雷布沃格尔(Shirley Schreibvogel)手中，她在2016年被大猫救援组织(Big Cat Rescue)起诉。\n在一份简易判决中，法官斯科特·L·帕克(Scott L.Palk)裁定，转移给Schreibvogel是欺诈性的，目的是让她儿子的债权人无法接触到财产，包括Big Cat Rescue。\n周一的裁决还要求拥有动物园业务和租赁物业的大温纽伍德外来动物公园的经营者离开并移走所有动物。该动物园目前的主人是杰夫和劳伦·洛，他们从异国情调手中接管了动物园，也是虎王的主角。\n帕克是审理“异域风情”刑事案件的同一名法官。今年1月，这名动物园管理员因向一名杀手支付3000美元杀死巴斯金，以及在俄克拉何马州动物园射杀5只老虎而被判处22年监禁。那次袭击从未实施过。\n巴斯金和她的避难所多年来一直在与私人动物园和外来猫等买卖和繁殖外来猫的动物园饲养员进行斗争。\n由于担心冠状病毒而关闭的大温纽伍德外来动物公园最近重新向公众开放。媒体报道显示，游客与杰夫·洛(Jeff Lowe)和动物园员工艾伦·格洛弗(Allen Goverer)摆姿势拍照，后者因雇佣杀害巴斯金而被判有罪。", "note_en": "Our coronavirus coverage is free for the first 24 hours. Find the latest information at  tampabay.com/coronavirus. Please consider  subscribing or  donating.\n  Joe Exotic’s infamous private zoo will soon become the property of a Tampa tiger sanctuary.\n A federal judge in Oklahoma on Monday ruled the 16 acres containing the Greater Wynnewood Exotic Animal Park must be surrendered to Big Cat Rescue Corp. within 120 days. Several buildings where zoo employees live and a fleet of vehicles were included in the judgement.\n The private zoo, formerly known as the G.W. Zoo, was featured heavily in Netflix’s  Tiger King. The series documented the life of eccentric zookeeper Joseph Maldonado-Passage, better known as Joe Exotic, and his long feud with Carole Baskin, CEO and founder of Tampa sanctuary Big Cat Rescue.\n  Big Cat Rescue was awarded $1 million in a trademark infringement lawsuit against Exotic in 2013. The zoo property was later transferred to Exotic’s mother Shirley Schreibvogel, who was sued by Big Cat Rescue in 2016.\n  In a  summary judgement, Judge Scott L. Palk ruled the transfer to Schreibvogel was fraudulent and intended to keep the property out of reach of her son’s creditors, including Big Cat Rescue.\n Monday’s ruling also requires the operators of the Greater Wynnewood Exotic Animal Park, who own the zoo business and lease the property, to leave and remove all of the animals. The zoo’s current owners are Jeff and Lauren Lowe, who took over the zoo from Exotic and were also featured in  Tiger King.\n Palk was the same judge who presided over Exotic’s criminal case. The zookeeper was sentenced in January to 22 years in prison for paying a hitman $3,000 to kill Baskin, and for shooting five tigers at the Oklahoma zoo. The hit was never carried out.\n  Baskin and her sanctuary have for years crusaded against private zoos and zookeepers like Exotic who buy, sell and breed exotic cats.\n The Greater Wynnewood Exotic Animal Park  recently reopened to the public after closing due to concerns over the coronavirus. Media reports showed visitors posing for photos with Jeff Lowe and zoo employee Allen Glover, the man who Exotic was convicted of hiring to kill Baskin.", "posttime": "2020-06-02 21:37:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "获得,exotic,动物园", "title": "乔·奇特的最大敌人获得了他的动物园的所有权", "title_en": "Joe Exotic's biggest enemy awarded ownership of his zoo", "transed": 1, "url": "https://www.tampabay.com/arts-entertainment/2020/06/02/tampas-big-cat-rescue-granted-ownership-of-joe-exotics-zoo/", "via": "", "real_tags": ["获得", "exotic", "动物园"]}, {"category": "", "categoryclass": "", "imagename": "bf205fa66e50bf35e8d221976d9ddc98.jpg", "infoid": 1004819, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在互联网从实验室逃出来、连接地球并重新定义使用计算机的意义之前很久……就有一群勇敢而开拓性的……", "note_en": "Long before the Internet escaped from the lab, connected the planet and redefined what it meant to use a computer...there was a brave and pioneering band of ...", "posttime": "2020-06-02 21:19:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "bbs", "title": "BBS：纪录片", "title_en": "BBS: The Documentary", "transed": 1, "url": "https://www.youtube.com/playlist?list=PL7nj3G6Jpv2G6Gp6NvN1kUtQuW8QshBWE", "via": "", "real_tags": ["bbs"]}, {"category": "", "categoryclass": "", "imagename": "080e3b0db1f05ffd1aed9f27aaae1e92.png", "infoid": 1004818, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您是否允许用户使用您不需要的其他帐户登录OAuth提供商？\n目前没有，已经有一些关于不同项目的统一登录讨论和建议，如果有一天真的成为统一登录的标准，我们愿意效仿其他不同的项目，但就目前而言，出于隐私和不可链接的目的，最好的做法是创建一个驻留在您注册的实例上的帐户。\n你们会不会提供一个与Reddit兼容的API，以便移植Foss reddit应用程序来支持Lemmy？\n我们这里确实有一个开放的websocket/http API，经过重新布线，它可能会与当前的reddit应用程序一起工作。我实际上认为Slide for Reddit会是个不错的选择，但是幻灯片开发人员建议不要这么做，因为他们的代码库有点乱。\n维持Reddit生存的最大因素是网络的影响，莱米如何才能克服这一点呢？\n先发效应相当难以克服。而且，即使有乳齿象这样的势头，它仍然没有Twitter那样的用户群。Matrix/Riot也是如此，它试图克服Whatsapp和Facebook Messenger等服务。但我确实认为，就可伸缩性和开放的开发生态系统而言，联合对这些服务构成了最大的威胁。Twitter已经严重封锁了应用程序，Reddit可能最终也会如此。\n一些Reddit的克隆是为了迎合另类右翼和/或邪教45，Lemmy将如何避免变得相似(或者我猜我的意思是Lemmy将如何继续适用于那些不想要的人)？\n我能感觉到，每当我听到Reddit Alternative这个词时，我几乎都会畏缩，因为这些Alternative变得如此偏执。至少在我们控制的情况下，我们有一套非常严格的行为准则，反对各种形式的偏见，我们永远不会允许纳粹出现在我们控制的情况下。但不幸的是，它是开源软件，我们无法阻止人们启动偏执的实例。我们能做的最好的事情(目前我们的联邦版本中也有这一点)就是确保联邦有白名单和阻止这些实例的黑名单。\n对于大的次级Reddits的适度并不是真的有效(太多的权力掌握在太少的人手中，没有透明度)，Lemmy的联合方法似乎会让情况变得更糟，因为本质上大的次级Reddits将在一台服务器上，MOD甚至有更多的控制权，这是什么让你担心的事情？\n当然，这是一个很大的问题。上个月有一篇帖子甚至显示Reddit的所有主要主页都由大约10名超级版主主持。\n我基本上复制了Reddits的审核系统，创建者控制社区，管理内容，并通过ADDED_TIME指定管理员在层次结构中提供帮助，而实例管理员拥有对所有内容的最终控制权。从某种意义上说，联邦减轻了这一影响：Lemmy的资源非常少，每个人只需移动到另一个更好的实例即可。但复制它的主要原因是，民主温和的提议非常新，制定得不太好。具体地说，如果有MODS选举，你如何防止投票队？或者，如果这是一个社区投票删除评论，是什么阻止了一个旅的所有社区行动？\n我们在这里有一条讨论更民主温和派的线索。当然，我并不反对它，它只需要做得很好就行了。\n您是否考虑过分布式方法而不是联合方法？如果是这样的话，你是如何应对节制的呢？", "note_en": "Will/Do you allow people to login with oauth providers you don&#39;t need yet another account?\n Currently no, there have been some unified login discussions and proposals for fediverse projects, and we would like to follow the rest of the fediverse if there ever does become a standard for unified login, but as it stands, the best for privacy-purposes and unlinkablitiy, is to create an account that resides on the instance you signed up at.\n Will/Do you provider a reddit compatibile API so FOSS reddit apps can be ported to support lemmy?\n We do have an open  websocket / http API here, and with some re-wiring, it could potentially work with current reddit apps. I actually imagined  Slide for Reddit would be a good option, but the slide devs advised against it because their codebase is a bit messy.\n The biggest thing keeping reddit alive is the network affect, how can Lemmy get past that?\n The first-mover effect is pretty difficult to overcome. And even with all of mastodon&#39;s momentum, it still doesn&#39;t have anywhere near the userbase that twitter has. Same with Matrix / Riot, trying to overcome services like Whatsapp and Facebook messenger. But I do think federation poses the best threat to these services, in terms of scalability, and the open eco-system of development. Twitter has already heavily locked-down apps, and reddit probably will eventually too.\n A few reddit clones have been made to cater for the alt-right and/or Cult45, how will Lemmy avoid becoming similar (or i guess what I mean is how will Lemmy remain usable for those that don&#39;t want that)?\n I feel ya, I almost cringe whenever I hear the term &#34;reddit alternative&#34; because of how infested with bigots these alternatives become. On the instances we control at least, we have a very strict  code of conduct against bigotry of all forms, and we will never allow nazis on the ones we control. But unfortunately, its open-source software, and we can&#39;t prevent people from starting bigoted instances. The best we can do (and we currently have this in our federation builds), is to make sure federation has whitelist and a blacklist for blocking these instances.\n Moderation for large subreddits doesn&#39;t really work (too much power in the hands of too few, with no transparency), the federated approach of Lemmy seems like it will make this worse as essentially big subreddits will be on a single server, that the mods have even more control over, is this something that conerns you?\n It is a huge problem for sure. There was that post last month even that showed that all reddit&#39;s main subs are moderated by about 10 super-moderators.\n I&#39;ve basically replicated reddits moderation system, where the creator controls the community, curates the content, and appoints moderators to help in a hierarchy by added_time, and instance admins have ultimate control over all. In a sense this is mitigated by federation: lemmy is very light on resources, and everyone can just move to another better-moderated instance. But the main reason for replicating it, is the proposals for democratic moderation are very new and not-too-well worked out. Specifically, if there is an election of mods, how do you prevent a vote brigade? Or if its a community voting to remove a comment, what prevents a brigade on all community actions?\n We have a thread for discussion around more  democratic moderation here. I&#39;m not opposed to it of course, it just needs to be something well worked out.\n Have you considered a distributed approach instead of a federated one? If so how do you deal with moderation?", "posttime": "2020-06-02 21:02:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,lemmy,reddit", "title": "AMA关于Lemmy，这是Reddit的开源联合替代方案", "title_en": "AMA about Lemmy, an open source, Federated alternative to Reddit", "transed": 1, "url": "https://old.reddit.com/r/linux/comments/guklhr/we_are_the_devs_behind_lemmy_an_open_source/", "via": "", "real_tags": ["开源", "lemmy", "reddit"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004817, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "目的：探讨老年新冠肺炎患者接受脱氧核糖核酸治疗与未接受治疗的临床转归。我们假设服用DMB的患者比没有服用DMB的患者需要氧疗和/或重症监护支持的患者更少。方法：对在三级学院医院连续住院的所有50岁及以上的新冠肺炎患者进行队列观察研究，并与最近没有接受二甲双胍的队列进行比较。如果患者不需要氧疗，入院时给予口服维生素D3 1000IU OD、镁150 mg OD和维生素B12 500mcg OD(DMB)。结果：在2020年1月15日至4月15日期间，连续43例≥为50岁的新冠肺炎患者入选。17例接受DMB治疗，26例未接受治疗。两组之间的基线人口学特征相似。与对照组相比，糖尿病患者在整个住院期间需要开始氧疗的人数明显减少(17.6%比61.5%，P=0.006)。单因素和多因素分析显示，氧疗需求和/或重症监护支持的OR值分别为0.13(95%CI：0.0 3−0.5 9)和0.15(95%CI：0.0 3−0.93)。结论：老年新冠肺炎患者联合应用DMB可显著降低需要氧支持和/或重症监护支持的临床恶化患者的比例。这项研究支持进一步的更大规模的随机对照试验，以确定二甲双胍在改善新冠肺炎严重程度方面的全部益处。\n我确认已遵守所有相关的道德准则，并已获得任何必要的IRB和/或道德委员会的批准。\n为所述研究提供批准或豁免的IRB/监督机构的详细情况如下：\n这项研究得到了我们的机构伦理委员会的批准，并给予了放弃同意的权利(参考号：2020/2344)。\n已获得所有必要的患者/参与者同意，并已将适当的机构表格存档。\n我理解所有临床试验和任何其他预期干预研究必须在ICMJE批准的注册机构注册，如ClinicalTrials.gov。我确认手稿中报告的任何此类研究都已注册，并提供了试验注册ID(注意：如果张贴追溯注册的前瞻性研究，请在试验ID字段中提供一份声明，说明为什么没有提前注册该研究)。\n我已遵循所有适当的研究报告指南，并上传了相关的赤道网络研究报告核对表和其他相关材料作为补充文件(如果适用)。", "note_en": "Objective: To determine the clinical outcomes of older COVID-19 patients who received DMB compared to those who did not. We hypothesized that fewer patients administered DMB would require oxygen therapy and/or intensive care support than those who did not. Methodology: Cohort observational study of all consecutive hospitalized COVID-19 patients aged 50 and above in a tertiary academic hospital who received DMB compared to a recent cohort who did not. Patients were administered oral vitamin D3 1000 IU OD, magnesium 150mg OD and vitamin B12 500mcg OD (DMB) upon admission if they did not require oxygen therapy. Primary outcome was deterioration post-DMB administration leading to any form of oxygen therapy and/or intensive care support.Results: Between 15 January and 15 April 2020, 43 consecutive COVID-19 patients aged ≥50 were identified. 17 patients received DMB and 26 patients did not. Baseline demographic characteristics between the two groups were similar. Significantly fewer DMB patients than controls required initiation of oxygen therapy subsequently throughout their hospitalization (17.6% vs 61.5%, P=0.006). DMB exposure was associated with odds ratios of 0.13 (95% CI: 0.03 − 0.59) and 0.15 (95% CI: 0.03 − 0.93) for oxygen therapy need and/or intensive care support on univariate and multivariate analyses respectively. Conclusions: DMB combination in older COVID-19 patients was associated with a significant reduction in proportion of patients with clinical deterioration requiring oxygen support and/or intensive care support. This study supports further larger randomized control trials to ascertain the full benefit of DMB in ameliorating COVID-19 severity.\n        I confirm all relevant ethical guidelines have been followed, and any necessary IRB and/or ethics committee approvals have been obtained.\n  The details of the IRB/oversight body that provided approval or exemption for the research described are given below:\n This study was approved by our institutional ethics committee with waiver of consent granted (Ref No:2020/2344).\n All necessary patient/participant consent has been obtained and the appropriate institutional forms have been archived.\n  I understand that all clinical trials and any other prospective interventional studies must be registered with an ICMJE-approved registry, such as ClinicalTrials.gov. I confirm that any such study reported in the manuscript has been registered and the trial registration ID is provided (note: if posting a prospective study registered retrospectively, please provide a statement in the trial ID field explaining why the study was not registered in advance).\n  I have followed all appropriate research reporting guidelines and uploaded the relevant EQUATOR Network research reporting checklist(s) and other pertinent material as supplementary files, if applicable.", "posttime": "2020-06-02 20:45:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "维生素,vitamin,患者", "title": "维生素D、镁、维生素B12对新冠肺炎患者影响的研究", "title_en": "Study of the effect of Vitamin D, Magnesium and Vitamin B12 on Covid-19 patients", "transed": 1, "url": "https://www.medrxiv.org/content/10.1101/2020.06.01.20112334v1", "via": "", "real_tags": ["维生素", "vitamin", "患者"]}]