[{"category": "", "categoryclass": "", "imagename": "94c8d00e13387101db1ff2d0c52c6caa.jpeg", "infoid": 1008257, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在反复无常地决定是否批准Basecamp的嘿电子邮件应用程序后，苹果已经“明确批准”嘿用于App Store。Basecamp首席技术官和联合创始人大卫·海内迈尔·汉森今天在推特上发布了这一消息。\n嘿将不包括任何应用内购买(IAP)，因此苹果将不会获得标准的30%佣金。起初，苹果反对用户从App Store下载应用程序，但必须通过网络注册。苹果的政策要求开发者使用IAP解锁应用程序中的付费特性或功能。嘿，通过提供免费试用选项，成功地绕过了这些规则。\n苹果已经明确批准在App Store中使用嘿！没有IAP，没有30%的提成，但我们已经打开了免费临时地址服务的大门，并对工作账户使用相同的应用程序。我真是松了一口气！现在嘿对每个人都开放了！不需要邀请代码https://t.co/J7OCCTFX2Z🎉❤️。\n-dhh(@dhh)2020年6月25日。\n嘿现在对所有人开放，不需要邀请码。这款应用承诺以更有条理的方式收发电子邮件，每年收费99美元。但也许更重要的是，嘿是开发者如何避免向苹果支付30%的IAP和订阅费的一个例子。\n“希望这也能为批准其他多平台SAAS应用程序铺平一条光明的道路。仍然有一长串的反垄断问题需要回答，但情况理所当然地有所改善。新政策，新优先。苹果向前迈进了一大步，“汉森在推特上写道。\n欧盟委员会(European Commission)最近就App Store和Apple Pay要求开发者使用自己的支付和应用内购买系统的规定展开了双重调查。这项调查是由Spotify的投诉引发的，但关于App Store是否公平的争论并不新鲜。苹果可能会安抚一些开发者，如果它允许他们效仿Basecamp，提供免费试用，而不是IAP。", "note_en": "After flip flopping on whether it would approve Basecamp’s Hey email app, Apple has “definitively approved” Hey for the App Store. Basecamp CTO and co-founder David Heinemeier Hansson  tweeted the news today.\n Hey will not include any in-app purchases (IAP), so Apple will not get its standard 30 percent commission. At first,  Apple objected to the fact that users would download the app from the App Store but have to sign up via the web. Apple’s policies require that developers use IAP to unlock paid features or functionality in an app. Hey managed to skirt around those rules by  offering a free trial option.\n  Apple has definitively approved HEY in the App Store!! No IAP, no 30% cut, but we’ve opened the door to a free temp address service, and use same app for work accounts. I’m so incredibly relieved! And now HEY is open to EVERYONE! No invite code needed 🎉❤️  https://t.co/J7OCCTFX2Z\n— DHH (@dhh)  June 25, 2020\n  Hey is now open to everyone, and it does not require an invite code. The app promises a more organized approach to email, for $99 per year. But perhaps more importantly, Hey is an example of how developers can avoid paying Apple 30 percent of IAP and subscription fees.\n “Hopefully this paves an illuminated path for approval for other multi-platform SAAS applications as well. There are still a litany of antitrust questions to answer, but things legitimately got a little better. New policies, new precedence. Apple took a great step forward,” Hansson tweeted.\n The European Commission recently  opened dual investigations into the App Store and Apple Pay over its rules requiring developers to use its own payment and in-app purchase system. That investigation was spurred by  Spotify’s complaint, but the debate over  whether the App Store is fair is not new. Apple may appease some developers if it allows them to follow Basecamp’s lead and offer free trials instead of IAP.", "posttime": "2020-06-26 03:01:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,应用,email", "title": "嘿，电子邮件应用在苹果“最终”批准后向所有人开放", "title_en": "Hey Email App Open To All After Apple 'Definitively' Approves It", "transed": 1, "url": "https://www.engadget.com/apple-basecamp-hey-email-app-store-154225649.html", "via": "", "real_tags": ["apple", "苹果", "应用", "email"]}, {"category": "", "categoryclass": "", "imagename": "99194f67e5542018f2c1c325832cade0.png", "infoid": 1008256, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎回来，感谢你加入我们的阅读笔记…。关于ELF文件的系列文章的第13部分介绍了它们是什么，它们可以做什么，动态链接器对它们做了什么，以及我们自己如何做到这一点。\n到目前为止，我一直很成功地避免谈论TLS(不，不是那个)，但我想我们已经到了不能再拖延的地步了，所以。\n我们从艰难地阅读文件的经历中知道，作为一个用户端应用程序，我们是计算机上的客人。\n当然，我们可能会执行一些指令，我们甚至可能会礼貌地要求某些设备符合我们的需求，但最终调用这些指令的是内核。我们在这里是被容忍的。老实说，内核根本不会执行任何东西。\n不过，内核偶尔会让非内核代码执行。再说一次，它负责这种情况的确切发生方式和时间-以及持续多长时间。\n到目前为止，我们已经对进程是如何加载到内存中形成了一个相当好的想法：内核本身解析我们想要执行的文件，如果它解析了它(尽管它对几乎不像我们感兴趣的事情那么多)，映射一些东西，然后“不插手”控制它。\n但是交接是什么意思呢？具体来说，会发生什么呢？好吧，今天不是我们进入内核调试的日子(虽然…。不。除非？没有)，但我们肯定能大致知道发生了什么事。\n计算机是什么？一堆可怜的登记簿。这是正确的，因为所有的全局变量都是向下的。\n以下是一些CPU寄存器的值，恰好是echidna的主要函数开始执行时的值：\n就这些吗？不要啊！这里有128位寄存器(SSE)、256位寄存器(AVX)、512位寄存器(AVX-512)-当然，我们还有x87/FPU寄存器，当您需要一个协处理器来处理这些寄存器时。\n这简直是一团糟。关键是，我们有一堆全局变量，读写速度非常快。因此，优化编译器倾向于在任何可能的情况下使用它们。\n这里的“他们”指的是从%rax到%r15这一系列中的通用型。有时，如果您的优化器感到特别头晕目眩，一些%xmmN寄存器也会出现(正如我们在上一篇文章中痛苦地了解到的那样)。\n还有一些特殊用途的寄存器，如cs、ss、ds、es等等，我们并不特别关心这四个寄存器，因为在64位Linux上，我们的内存模型要简单一些。\n事实上，我们一直都在使用寄存器来发送内核LoveLetters--例如，在echidna的Write函数中：\n发布不安全的FN写入(fd：u32，buf：*const U8，count：usize){ASM！(&#34；mov rax，1 SysCall&#34；：：&#34；{rdi}&#34；(Fd)，&#34；{rsi}&#34；(Buf)，&#34；{rdx}&#34；(Count)：&#34；rax&#34；，&#34；rr。英特尔(34；))}。\n因此，内核应用程序和用户应用程序都使用寄存器。我最喜欢的寄存器之一--我正在写一系列关于ELF文件的文章--是%rip，指令指针。\n我被告知它并不总是那么简单，但在64位Linux上，它只是指向我们当前正在执行的代码的(虚拟)地址。当程序执行向前移动时，%rip-by不管编码刚执行的指令需要多少字节，都会向前移动：(#*_)。\n因此，这回答了我们问题的一部分-内核如何将控制权“移交”给程序：它只是改变了%rip！处理器做的是最好的。井。有点像。比方说，“在其他事情中”。\n(请注意，在x86上，您不能直接写入%rip寄存器-您必须使用jmp、call或ret等指令。)。\n公平地说，它也从环0切换到环3--这也是我们在“艰难阅读文件”第2部分中简要讨论过的。并且它从“内核虚拟地址空间”切换到“用户地虚拟地址空间”。\n重点是--这也是进程间切换的工作原理。对于用户而言，进程是并行执行的，但是对于内核而言，它的调度器分配的是时间片。每当它让process“foo”执行一段时间时，它：\n从环0切换到环3，也跳转到上次中断进程“foo”时的地址%Riphad。\n最终，系统计时器中断关闭，执行立即跳回内核的中断处理程序-在这一点上，内核决定进程是淘气的还是好的，以及它是否值得更多的时间。\n如果不是-例如，如果内核决定我们下一步真的应该给进程“bar”更多时间，那么内核将保存“foo”的状态(大多数注册器)，重置一组CPU状态(主要是内存缓存)，并按照我们刚才描述的方式切换到“bar”。\n这是非常遥远的事情概观。它也不完全正确。但就我们的目的而言，它是足够正确的。\n这是针对流程的。但是线程呢？线程也是“抢占多任务”的--它们的执行可以被暴力中断，而不是显式地放弃控制(即。“抢占”)，以便可以执行其他线程。\n“另一个”多任务是协作性的多任务--你不需要内核的帮助就可以做到这一点。这就是协同程序的工作方式--只是在决定轮到谁的时候，一些用户州的人都在一起玩得很好。\n不过，线程之间的切换更简单。因为代理进程的所有线程共享相同的地址空间。因此，当从一个切换到另一个时，需要保存和恢复的状态较少。\n但是…。问题出现了：如何区分线程？如果使用相同的入口点启动了几个线程，您如何知道哪个线程是哪个线程呢？这是CPU处理的事情吗？还是内核？\n//在`elk/sample/twothread/twothreads.c`#include&lt；unistd.h&gt；#include&lt；pthread.h&gt；void*in_thread(void*unuse){while(1){睡眠(1)；}}int main(){pthread_t1，t2；pthread_create(&amp；t1，null，in_thread，null)；pthread_create(&amp；t2，null，in_thread，\n$cd elk/sample/twothread$GCC twothreads.c-pthread-o twothreads.c-pthread-o twothread$./twothread(程序不打印任何内容，并且永远不会退出)。\n$gdb-quiet./twothread正在读取符号./twothreads.(Gdb)在0x1175处插入_threadBreakpoint 1：文件twothreads.c，第6行。(Gdb)运行启动程序：/home/amos/ftl/elk/samples/twothreads/twothreads[Thread调试使用libthreaddb已启用]使用主机libthreaddb库&#34；/usr/lib/libthreaddb.so.1&#34；。[新线程0x7ff7da5700(lwp 14253。在两个线程处命中断点1，in_thread(未使用=0x0)。c：66休眠(1)；\n到目前为止一切都说得通。我们有三个线程--主线程和我们创建的另外两个线程。所以说真的，这个节目应该叫“三读”。\n(Gdb)位于/usr/lib/libpthread.so.0克隆()中的/usr/lib/libpthread.so.0#2 0x00007ff7ea83d3中的bt#0 in_thread(未使用=0x0)。c：6#1 0x00007ffff7f7846f in start_thread()from/usr/lib/libc.so.6。\n就像INFO寄存器一样，GDB有INFO线程，这让我们知道它们都在发生什么：\n(Gdb)信息线程ID目标ID帧1线程0x7ffff7da6740(Lwp 14249)&#34；两个线程&#34；0x00007ffff7f79a67位于/usr/lib/libpthread.so.0*2线程0x7ff7da5700(Lwp 14253)&#34；两个线程&#34；in_thread(未使用=0xxthread.so.0*2线程中(未使用=0xpthread.so.0*2线程0x7ff7da5700(Lwp 14253)&#34；两个线程&#34；in_thread(未使用=0xxthread.so.0*2线程。\n我们可以将“当前gdb线程”设置为我们想要的任何值，例如，如果我们想要查看主线程在做什么：\n(Gdb)线程1[切换到线程1(线程0x7ffff7da6740(Lwp 14249))]#0 0x00007ff7f79a67 in__pthread_clockjoin_ex()from/usr/lib/libpthread.so.0(Gdb)bt#0x00007ff7f79a67 in__pthread_clockjoin_ex()from/usr/lib/libpthread.so.0(Gdb)bt#0x00007ff7f79a67 in__pthread_clockjoin_ex()from/usr/lib/libpthread.so.0。\n(Gdb)main()中的帧1#1 0x000055555551e3，位于两个线程。c：1414pthread_Join(t1，NULL)；(Gdb)info localst1=140737351669504t2=140737343276800(Gdb)p/x t1$1=0x7ff7da5700(Gdb)p/x t2$2=0x7ff75a4700。\n看起来像是指针。好吧。现在，我们知道了如何检查各种线程的状态，让我们来看看我们的两个线程是怎么回事--它们是背靠背的：\n事情看起来相似得令人毛骨悚然。它们应该-两个线程都在做完全相同的事情-等待时间耗尽，一次一秒。\n当然，有些寄存器值关闭了0x1000(%RBP到%R10)，但是，例如，%RIP对于这两个寄存器来说是完全相同的。老实说，这让人安心。并非我们所有的假设都是错误的。\n但一定有办法把它们区分开来。对于初学者来说，“pthread”(POSIXthread)被实现为一个用户地库：\n从到系统读取共享对象库0x00007ffff7fd3100 0x00007ffff7ff2b14是(*)/lib64/ld-linux-x86-64.so.20x00007ff7f76ad0 0x00007ff7f858c5是(*)/usr/lib/libpthread.so.00x00007ff7dce630 0x00007ff7f18e。\n…。并且它公开了像pthreadself()这样的函数，该函数返回调用线程的ID。所以它必须知道我们当前在哪个线程中。我们所要做的就是…。寄存器。\n让我们做一些我希望在几个月前就想明白的事情，当时我还在研究“滚动自己的动态链接器”是否是一件不太合理的事情。\n(Gdb)disas pthread_self：0x00007ffff7e2efa0&lt；+0&gt；函数的汇编代码的pthread_selfDump：endbr64 0x00007ff7e2efa4&lt；+4&gt；：MOV rax，QWORD PTR fs：0x10 0x00007ff7e2efad&lt；+13&gt；：retEnd of Assembly。\n额外分段。指向额外数据的指针(‘E’代表‘Extra’)。\nF段(FS)。指向更多额外数据的指针(‘F’在‘E’之后)。\nG段(GS)。指向更多额外数据的指针(‘G’在‘F’之后)。\n太棒了。因此，“s”代表“段”，“f”代表“fxtra data”。\n不过，等一下。我非常肯定每次我们看它的时候%fs都是0x0。让我们仔细检查一下：\n(Gdb)t a i r fsThread 3(线程0x7ffff75a4700(Lwp 14475))：fs 0x00线程2(线程0x7ffff7da5700(Lwp 14474))：fs 0x00线程1(线程0x7ff7da6740(Lwp 14473))：fs 0x0。\nt a a i r fs只是线程应用所有信息寄存器fs的模糊方式。\n这是对的-只要它不含糊，gdb就可以让您缩短任何命令或选项名称。事实上，如果您看到正在使用快捷键，并且不确定它的作用，您可以询问gdb，因为它的help命令也接受快捷键形式。\n(Gdb)help NISTEP一条指令，但通过子例程调用继续。用法：nexti[N]参数N表示第N步(或直到程序因其他原因停止)。\n这是在撒谎吗？是。如果是这样的话，pthreadself将尝试从内存地址0x0+0x10读取，并且肯定是Segerror。\n(Gdb)print(void*)pthread_self()[切换到线程0x7ffff7da5700(Lwp 14474)]从gdb调用函数时，程序在另一个线程中停止。包含函数(Pthreadself)的表达式的求值将被放弃。函数执行完成后，gdb将静默停止。\n调度程序锁定是gdb的一个特性，它会礼貌地要求Linux内核不要抢占当前线程，因为我们正在查看它。\n因此，广发银行在撒谎。但这并不完全令人惊讶--%fs寄存器是线程本地的(在Linux 64位！请记住，寄存器的用途完全在ABI中定义，它由内核决定(ITSO)，并且GDB本身运行自己的线程，与次要的线程不同。\n我们已经有一段时间没有讨论过奇怪的gdb术语了，所以，以防万一，“次要的”就是“正在调试的进程”。我知道呀。怪怪的。继续前进。\n是否有其他方法可以获取%fs寄存器的内容？当然有！我们可以通过arcprctl syscall礼貌地询问内核。我们将使用它的包装器：\n#include&lt；asm/prctl.h&gt；#include&lt；sys/prctl.h&gt；int arch_prctl(int code，无符号长地址)；int arch_prctl(int code，unsign long*addr)；#定义ARCH_SET_GS 0x1001#DEFINE ARCH_SET_FS 0x1002#DEFINE ARCH_GET_FS 0x1003#DEFINE ARCH_GET_GS 0x1004。\n这就对了。同一函数一次定义为获取uint64_t，第二次定义为获取指向uint64_t的指针。您知道，因为它既可以获取内容，也可以设置内容。\n这就是libc的运作方式，宝贝。告诉你C有类型系统的人不是在妄想就是在调皮捣蛋。\n为什么要举行这个仪式？嗯，%fs和%gs不是通用寄存器-它们是段寄存器。在64位时代之前，段寄存器要重要得多。\n那一年是1976年。自从8位Intel8008发布以来，已经过去了四年，其他公司也在陆续发布16位微处理器。\n数字设备公司(DEC)、飞兆半导体和国家半导体都发布了某种形式的16位微处理器。一年前，National甚至发布了Pace，这是一款松散地基于自己的IMP-16设计的单片机。\n与此同时，英特尔的iAPX432项目已经进行了一年，这..。确实可以保证至少有一整篇文章。Ada是处理器的目标编程语言，它支持面向对象的编程和基于能力的寻址。\n然而，iAPX432项目却举步维艰--事实证明，这些抽象的东西并不是免费的。它们不仅需要明显更多的晶体管，而且与竞争对手的微处理器相比，同等程序的性能也会受到影响。\n因此，在1976年5月，英特尔的同事们说“好吧，让我们在iAPX432烹饪完成之前发布一些16位芯片吧。”现在距离德州仪器(TI)发布另一款单船16位微处理器TMS9900还有一个月，压力是实实在在的。\n但是“16位芯片”到底是什么意思呢？嗯，实际上是…。这要视情况而定。\n例如，我曾将英特尔8008称为“8位芯片”--但它没那么简单。\n当然，8008的寄存器是8位的。每个位都可以打开或关闭：\n每一位也对应于2的幂-通过将每个“开”位中的两位的幂相加，我们得到一个无符号整数的值：\n有符号整数涉及的比较多，而浮点数涉及的甚至更多。但是我们不要太分心了。\n如果你只用8位来编码内存地址，那么你只能寻址256字节的内存。\n因此，即使是8位芯片通常也有更大的“地址总线”。8008有一条14位的地址总线，这意味着它的PC寄存器(程序计数器，我们在x86-64上称之为指令指针)的宽度是..14位。\n如何使用8位通用寄存器操作14位地址？使用其中两个寄存器！为什么是14位而不是16位？嗯，当你在做开心果的时候，每根大头针都很重要：\n该芯片具有8位宽的数据总线和14位宽的地址总线，可寻址16KB的内存。由于英特尔在1972年只能生产18针DIP封装，总线必须进行三倍多路复用。因此，该芯片的性能是非常有限的，它需要大量的外部逻辑来解码所有的信号。\n因此，多亏了引脚复用，8008可以寻址16KiB的内存，这仍然不是很多。回到70年代，英特尔是一家致力于制造内存芯片的初创公司。不难理解，他们希望人们使用能够寻址更多内存的微处理器。\n8086&#39；的设计更大。它采用40针封装，因此他们能够将数据引脚的数量减少到20个--而且还带有一些多路复用功能。通过20位地址总线，8086能够提供高达1MIB的物理地址空间。\n但就像以前一样，8086的通用寄存器更小--它们只有16位。单个寄存器仍然不足以引用物理存储器地址。\n怎么办呢？使用分段！8086引入了四个段寄存器：从中读取指令的代码段(CS)、通用内存的数据段(DS)、堆栈段(SS)和额外段(ES)，当您需要从内存的一个区域复制到另一个区域时，这些寄存器可用作临时存储空间。\n指令通常采用16位偏移量参数，根据指令的性质，它会将该偏移量与相关的段寄存器相加。每个段寄存器都是…寄存器。也是16位。16+16=20，一切正常。\n这意味着，对于8086，每个单独的存储器地址可以由4096个不同的段：偏移量对引用。\n这也意味着，只要您的整个程序(代码和数据)适合单个64K段，您就可以拥有从0开始的不错的偏移量(对于您的段)。\n如果它不能容纳在一个64K的段中，那么你的偏移量就不再是16位的了，你必须开始在不同的段之间来回切换，并处理时髦的指针大小。\n如果要引用同一段中的内存，可以使用NEAR指针：\n如果要引用另一个段中的内存，可以使用远指针。\n如果您想引用另一个段中的内存，并且您的指针算法可能会更改指针的值以引用另一个段，则可以使用一个巨大的指针：\n1982年，英特尔推出了80286，我们将称之为286型，它引入了几个新奇的东西。首先，数据引脚不再是多路复用的-芯片有68个引脚，其中16个引脚专用于地址总线。\n第二：286引入了“保护虚拟地址模式”。然而，在8086上，代码、堆栈和数据段可以(并且做到了！)。重叠，286号可以避免这种情况。还可以为段分配“特权级别”-具有较低权限级别的段不能访问具有较高权限级别的段。\n还记得保护环吗？我们在“艰难的阅读文件”(第2部分)中谈到了环0和环3--仅此而已！\n“环”是特权级别，当前特权级别存储在CS寄存器的较低两位中。您知道吗，我们的示例程序运行的是…。\n…。在3号环！这是理所当然的，因为它是一个常规的用户程序，而不是内核代码。\n然而，286&#39；的保护模式使用起来有点烦人--首先，它破坏了与旧的8086应用程序的兼容性。更糟糕的是，一旦您将其从“真实”模式切换到“保护”模式，您就无法在不执行硬重置的情况下切换回来。\n但是，少数使用286保护模式的应用程序能够使用完整的24位物理地址空间：16MiB。理论上。实际上，286主板只支持高达4MiB的RAM-即使那样，购买这么多内存也是昂贵得令人望而却步。\n快进到1985年。日美半导体大战正如火如荼。英特尔最终决定停止生产DRAM，目前专注于微处理器。\n1985年10月，英特尔发布了80386(我们称之为“386”)，这是对80286体系结构进行32位扩展的第一个实现。最后，数据宽度和地址宽度是相同的：32位。\n这意味着-从理论上讲-386能够寻址4GiB的RAM。\n然而，在实践中，让你拥有那么多内存的板--或者任何接近它的地方--都是不存在的。即使只有几兆字节的RAM也会让您望而却步。\nTall Tree Systems推出了Jram系列的最新成员Jram-3，JRAM-3是第四代多功能存储板，是备受赞誉的Jram-2的继任者。JRAM-3专为满足主要电子表格供应商正在实施的最新扩展内存规范标准而设计，可访问高达8兆字节的内存，以实现更大、更高效的电子表格。JRAM-3还可用于DOS存储器、电子芯片。\n..", "note_en": "Welcome back and thanks for joining us for the  reads notes…the thirteenth installment of our series on ELF files, what they are,what they can do, what does the dynamic linker do to them, and how canwe do it ourselves.\n I&#39;ve been pretty successfully avoiding talking about TLS so far (no,  notthatone)but I guess we&#39;ve reached a point where it cannot be delayed any further, so.\n  We know from our adventures in  reading files the hardway that, as a userlandapplication, we are a  guest on the computer.\n Sure, we may execute some instructions, we may even politely request thatcertain devices tend to our needs but ultimately the one who&#39;s calling theshots is the kernel. We are  tolerated here. Honestly, the kernel wouldrather nothing execute at all.\n  Occasionally though, the kernel will let non-kernel code execute. And again,it&#39;s in charge of exactly how and when that happens - and for how long.\n By now we&#39;ve formed a fairly good idea of how processes are loaded intomemory: the kernel itself parses the file we want to execute, if it&#39;s ELF itparses it (it&#39;s not interested in nearly as many things as we are, though),maps a few things, then “hands off” control to it.\n But what does  hand off mean? In concrete terms, what happens? Well, today&#39;snot the day we get into kernel debugging (although… nah. unless? no.), butwe sure can get a rough idea what&#39;s going on.\n What is a computer? A miserable little pile of registers. That&#39;s right - it&#39;sglobal variables all the way down.\n Here&#39;s the value of  some of the CPU registers just as  echidna&#39;s main functionstarts executing:\n  Is that all of them? Nope! There&#39;s 128-bit registers (SSE), 256-bit registers(AVX), 512-bit registers (AVX-512) - and of course we still have the x87/FPUregisters, from back when  you needed a co-processor forthat.\n TL;DR - it&#39;s a  whole mess. The point is, we have a bunch of globalvariables that are, like,  really fast to read from and write to. Sooptimizing compilers tend to want to use them whenever possible.\n And by “them” I mean the general-purpose ones in the bunch - from  %rax to %r15. And sometimes, if your optimizer feels particularly giddy, some ofthe  %xmmN registers as well (as we have painfully learned in the  lastarticle).\n And then there&#39;s special-purpose registers, like  cs,  ss,  ds,  es, etc.We&#39;re not overly concerned with those four in particular, because on we&#39;re on64-bit Linux and our memory model is somewhat simpler.\n In fact, we&#39;ve been using registers all this time to send the kernel loveletters - in  echidna&#39;s  write function for example:\n pub unsafe fn write(fd: u32, buf: *const u8, count: usize) { asm!( &#34; mov rax, 1 syscall &#34; :: &#34;{rdi}&#34;(fd), &#34;{rsi}&#34;(buf), &#34;{rdx}&#34;(count) : &#34;rax&#34;, &#34;rcx&#34;, &#34;r11&#34; : &#34;intel&#34; )}\n So both the kernel and userland applications use registers. One of myfavorite registers - seeing as I&#39;m in the middle of writing a seriesabout ELF files - is  %rip, the instruction pointer.\n I&#39;m being told that it wasn&#39;t always that simple, but on 64-bit Linux, itjust points to the (virtual) address of the code we&#39;re currently executing.Whenever program execution moves forward, so does  %rip - by however manybytes it took to encode the instruction that was just executed:\n  So, this answers part of our question - how does the kernel “hand off”control to a program: it just changes  %rip! And the processor does therest. Well. Sorta kinda. “Among other things”, let&#39;s say.\n (Note that, on x86, you can&#39;t write to the  %rip register directly - youhave to use instructions like  jmp,  call, or  ret.)\n To be fair, it also switches from ring 0 to ring 3 - again, something we&#39;vebriefly discussed in  Reading files the hard way Part2. And it switches from the“kernel virtual address space” to the “userland virtual address space”.\n  Point is - that&#39;s also how switching  between processes works. As far as theuser is concerned, processes execute in parallel, but as far as the kernel isconcerned, its scheduler is handing out slices of time. Whenever it letsprocess “foo” execute for a bit, it:\n Switches from Ring 0 to Ring 3, also jumping to whatever address  %riphad when process “foo” was last interrupted\n Eventually, the system timer interrupt goes off, and execution immediatelyjumps back to the kernel&#39;s interrupt handler - at which point the kerneldecides whether the process has been naughty or nice and whether it meritsmore time.\n If not - for example, if it decides we really should be giving process “bar”more time next, then the kernel saves the state of “foo”, (most of theregisters), resets a bunch of CPU state (mostly memory caches), and switchesto “bar” the way we&#39;ve just described.\n That&#39;s the  very distant overview of things. It&#39;s also not entirely correct.But for our purposes, it&#39;s correct enough.\n That&#39;s for processes. But what about threads? Threads are also “preemptivemultitasking” - instead of explicitly relinquishing control, their executioncan be violently interrupted (ie. “preempted”) so that other threads can beexecuted.\n The “other” multitasking is cooperative multitasking - which you don&#39;t needthe kernel&#39;s help to do. That&#39;s how coroutines work - just bits of userlandstate that all play nice together when it comes to deciding whose turn is it.\n Switching between threads is simpler though. Because of all threads of agiven process share the same address space. So there&#39;s less state to saveand restore when switching from one to the other.\n But then… the question arises: how do you tell threads apart? If severalthreads are started with the same entry point, how do you know which iswhich? Is that something the CPU handles? or the kernel?\n    // in `elk/samples/twothreads/twothreads.c`#include &lt;unistd.h&gt;#include &lt;pthread.h&gt;void *in_thread(void *unused) { while (1) { sleep(1); }}int main() { pthread_t t1, t2; pthread_create(&amp;t1, NULL, in_thread, NULL); pthread_create(&amp;t2, NULL, in_thread, NULL); pthread_join(t1, NULL); pthread_join(t2, NULL);}\n  $ cd elk/samples/twothreads$ gcc twothreads.c -pthread -o twothreads$ ./twothreads(program doesn&#39;t print anything and never exits)\n  $ gdb -quiet ./twothreadsReading symbols from ./twothreads...(gdb) break in_threadBreakpoint 1 at 0x1175: file twothreads.c, line 6.(gdb) runStarting program: /home/amos/ftl/elk/samples/twothreads/twothreads[Thread debugging using libthread_db enabled]Using host libthread_db library &#34;/usr/lib/libthread_db.so.1&#34;.[New Thread 0x7ffff7da5700 (LWP 14253)][New Thread 0x7ffff75a4700 (LWP 14254)][Switching to Thread 0x7ffff7da5700 (LWP 14253)]Thread 2 &#34;twothreads&#34; hit Breakpoint 1, in_thread (unused=0x0) at twothreads.c:66 sleep(1);\n Everything makes sense so far. We&#39;ve got three threads - the main thread, andthe two other we created. So really, the program should be named “threethreads”.\n  (gdb) bt#0 in_thread (unused=0x0) at twothreads.c:6#1 0x00007ffff7f7846f in start_thread () from /usr/lib/libpthread.so.0#2 0x00007ffff7ea83d3 in clone () from /usr/lib/libc.so.6\n Just like  info registers, GDB has  info threads, which lets us knowwhat&#39;s going on with all of them:\n (gdb) info threads Id Target Id Frame 1 Thread 0x7ffff7da6740 (LWP 14249) &#34;twothreads&#34; 0x00007ffff7f79a67 in __pthread_clockjoin_ex () from /usr/lib/libpthread.so.0* 2 Thread 0x7ffff7da5700 (LWP 14253) &#34;twothreads&#34; in_thread (unused=0x0) at twothreads.c:6 3 Thread 0x7ffff75a4700 (LWP 14254) &#34;twothreads&#34; in_thread (unused=0x0) at twothreads.c:6\n We can set the “current GDB thread” to whatever we want, for example if wewant to see what the main thread is up to:\n (gdb) thread 1[Switching to thread 1 (Thread 0x7ffff7da6740 (LWP 14249))]#0 0x00007ffff7f79a67 in __pthread_clockjoin_ex () from /usr/lib/libpthread.so.0(gdb) bt#0 0x00007ffff7f79a67 in __pthread_clockjoin_ex () from /usr/lib/libpthread.so.0#1 0x00005555555551e3 in main () at twothreads.c:14\n  (gdb) frame 1#1 0x00005555555551e3 in main () at twothreads.c:1414 pthread_join(t1, NULL);(gdb) info localst1 = 140737351669504t2 = 140737343276800(gdb) p/x t1$1 = 0x7ffff7da5700(gdb) p/x t2$2 = 0x7ffff75a4700\n Looks like pointers. Okay. So, now that we know how to inspect the state ofvarious threads, let&#39;s see what&#39;s going on with our two threads - here they areback-to-back:\n   Things look  eerily similar. And they should - both threads are doingexactly the same thing - waiting for time to run out, one second at a time.\n Sure, some register values are off by  0x1000 ( %rbp through  %r10), but,for example,  %rip is exactly the same for both. Which is reassuring, to behonest. Not  all our assumptions are wrong.\n But there has to be a way to tell them apart. For starters, “pthreads” (POSIXthreads) are implemented as a userland library:\n From To Syms Read Shared Object Library0x00007ffff7fd3100 0x00007ffff7ff2b14 Yes (*) /lib64/ld-linux-x86-64.so.20x00007ffff7f76ad0 0x00007ffff7f858c5 Yes (*) /usr/lib/libpthread.so.00x00007ffff7dce630 0x00007ffff7f18e2f Yes (*) /usr/lib/libc.so.6(*): Shared library is missing debugging information.\n …and it exposes functions like  pthread_self() - which returns the ID of thecalling thread. So it  must know which thread we&#39;re currently in. And  allwe have to go by are… registers.\n  Let&#39;s do something I  wish I had figured out months ago, when I was stillresearching whether “rolling your own dynamic linker” was even a halfwayreasonable thing to do.\n  (gdb) disas pthread_selfDump of assembler code for function pthread_self: 0x00007ffff7e2efa0 &lt;+0&gt;: endbr64 0x00007ffff7e2efa4 &lt;+4&gt;: mov rax,QWORD PTR fs:0x10 0x00007ffff7e2efad &lt;+13&gt;: retEnd of assembler dump.\n   Extra Segment (ES). Pointer to extra data (‘E’ stands for ‘Extra’).\n F Segment (FS). Pointer to more extra data (‘F’ comes after ‘E’).\n G Segment (GS). Pointer to still more extra data (‘G’ comes after ‘F’).\n Great. So the “s” stands for “segment” and the “f” stands for “fxtra data”.\n  But hold on a second. I&#39;m pretty sure  %fs was 0x0 every time we looked atit. Let&#39;s double check:\n (gdb) t a a i r fsThread 3 (Thread 0x7ffff75a4700 (LWP 14475)):fs 0x0 0Thread 2 (Thread 0x7ffff7da5700 (LWP 14474)):fs 0x0 0Thread 1 (Thread 0x7ffff7da6740 (LWP 14473)):fs 0x0 0\n t a a i r fs is just the obscure way of saying  thread apply all info register fs.\n That&#39;s right - whenever it&#39;s not ambiguous, GDB lets you shorten  any command oroption name. In fact, if you see a shortcut being used and you&#39;re not sure what it does,you can ask gdb, since its  help command also accepts the shortcut form.\n  (gdb) help niStep one instruction, but proceed through subroutine calls.Usage: nexti [N]Argument N means step N times (or till program stops for another reason).\n  Is this a lie? Yes. If that was the case,  pthread_self would try to readfrom memory address  0x0+0x10 and  definitely segfault.\n  (gdb) print (void*) pthread_self()[Switching to Thread 0x7ffff7da5700 (LWP 14474)]The program stopped in another thread while making a function call from GDB.Evaluation of the expression containing the function(pthread_self) will be abandoned.When the function is done executing, GDB will silently stop.\n    scheduler-locking is a feature of GDB that politely asks the Linux kernelto, like, not preempt the current thread, because we&#39;re looking at it.\n So GDB is lying. But it&#39;s not entirely surprising - the  %fs register is thread-local (on Linux 64-bit! remember that whatever a register isused for is entirely defined in the ABI and it&#39;s up to the kernel to make itso), and GDB itself is running its own threads distinct from the inferior&#39;sthreads.\n It&#39;s been a while since we&#39;ve been over weird GDB terminology, so, just incase, the “inferior” is the “process being debugged”. I know. Weird. Moving on.\n Is there another way to grab the contents of the  %fs register? Sure thereis! We can ask the kernel politely via the  arch_prctl syscall. We&#39;ll uselibc&#39;s wrapper for it:\n #include &lt;asm/prctl.h&gt;#include &lt;sys/prctl.h&gt;int arch_prctl(int code, unsigned long addr);int arch_prctl(int code, unsigned long *addr);#define ARCH_SET_GS\t\t0x1001#define ARCH_SET_FS\t\t0x1002#define ARCH_GET_FS\t\t0x1003#define ARCH_GET_GS\t\t0x1004\n That&#39;s right. The same function is defined once as taking an  uint64_t, anda second time as taking a  pointer to an  uint64_t. You know, since it canboth get and set things.\n That&#39;s just how libc rolls, baby. Whoever tells you C has a type system iseither delusional or mischievous.\n   Why the ceremony? Well,  %fs and  %gs aren&#39;t general-purpose registers -they&#39;re segment registers. Segment registers were a lot more relevant beforethe 64-bit era.\n   The year is 1976. Four years have passed since the released of the 8-bit Intel 8008, and other companiesare releasing 16-bit microprocessors left and right.\n  Digital Equipment Corporation (DEC), Fairchild Semiconductor and NationalSemiconductor have all released some form of 16-bit microprocessor. One yearprior, National even released the PACE, a singlechip based loosely on its own IMP-16 design.\n Meanwhile, Intel is one year into the  iAPX432 project, which.. reallywarrants at least one entire article. Ada was the intended programming languagefor the processor, and it supported object-oriented programming and  capability-based addressing.\n The iAPX 432 project was struggling though - turns out those abstractionsweren&#39;t free. Not only did they require significantly more transistors,performance of equivalent programs suffered compared to competingmicroprocessors.\n So, in May of 1976, the folks at Intel go “okay let&#39;s work on  some 16-bitchip that we can release before iAPX 432 is done cooking. This is one monthbefore Texas Instruments (TI) releases the TMS9900, anothersingle-ship 16-bit microprocessor - the pressure is real.\n But what does “a 16-bit chip” really mean? Well actually… it all depends.\n For example, I&#39;ve referred to the  Intel8008 as an “8-bit chip” - but it&#39;snot that simple.\n Sure, the registers of the 8008 were eight bits. Each bit can be on or off:\n  Each bit also corresponds to a power of two - by adding the power of twoof each of the “on” bits, we get the value as an unsigned integer:\n  Signed integers are a bit more involved - and floating-point numbers are evenmove involved. But let&#39;s not get too distracted.\n If you only used eight bits to encode memory addresses, then you could onlyaddress, well, 256 bytes of memory.\n  So, even eight-bit chips usually had a larger “address bus”. The 8008had a 14-bit address bus - which means the width of its  PC register(program counter, which we call instruction pointer on x86-64) was..14 bits.\n How do you manipulate 14-bit addresses with 8-bit general-purpose registers?With two of them! Why 14-bit and not 16-bit? Well, when you&#39;re making achip, every pin counts:\n The chip has a 8 bit wide data bus and 14 bit wide address bus, which canaddress 16 KB of memory. Since Intel could only manufacture 18 pin DIPpackages at 1972, the bus has to be three times multiplexed. Therefore thechip&#39;s performance is very limited and it requires a lot external logic todecode all signals.\n So, thanks to pin multiplexing, the 8008 could address 16KiB of memory.Which is  still not a lot. And back in the 70s,  Intel was a startupdevoted to making memory chips. Itstands to reason they&#39;d like people to use microprocessors that allowaddressing a lot more memory.\n The 8086&#39;s design is bigger. It ships in a 40-pin package, so they&#39;re able tobump the number of data pins to 20 - still with some multiplexing. And with a20-bit address bus, the 8086 is able to provide a whopping  1 MiB physicaladdress space.\n  But just as before, the 8086&#39;s general-purpose registers are smaller -they&#39;re only 16 bits. A single register is still not enough to refer to aphysical memory address.\n What to do? Use segments! The 8086 introduces four segment registers:the code segment ( CS), from which instructions are read, the data segment( DS) for general memory, the stack segment ( SS), and the extra segment( ES), useful as a temporary storage space when you need to copy from onearea of memory to another.\n Instructions would typically take 16-bit offset arguments, and depending onthe nature of the instruction, it would add up that offset with the relevantsegment register. Each of the 8086&#39;s segment registers were… also 16 bits.16 + 16 = 20, all is well.\n     That means that, for the 8086, each single memory address can be referred toby 4096 different  segment:offset pairs.\n This also means that - as long as your entire program (code and data) fits withina single 64K segment, you can have nice offsets that start at 0 (for your segment).\n If it  doesn&#39;t fit in a single 64K segment, well then your offsets don&#39;t fitin 16 bits anymore, and you have to start juggling between different segments,and deal with funky pointer sizes.\n If you want to refer to memory in the same segment, you can use a  near pointer:\n  If you want to refer to memory in another segment, you can use a  far pointer\n  If you want to refer to memory in another segment  and you may have pointer arithmetic that changes the pointer&#39;s value to refer to yet  another segment, you can use a  huge pointer:\n    In 1982, Intel launches the  80286, which we&#39;ll just call the  286, whichintroduce several novelties. First off, the data pins are no longermultiplexed - the chip has 68 pins, 16 of which are dedicated to the addressbus.\n   Second: the 286 introduces “protected virtual-address mode”. Whereas, on the8086, code, stack and data segment could (and did!) overlap, the 286 preventsthat. Segments can also be assigned “privilege levels” - segments with lowerprivilege levels cannot access segments with higher privilege levels.\n Remember protection rings? We talked about ring 0 and ring 3 in  Readingfiles the hard way part 2 - those are it!\n A “ring” is a privilege level, and the current privilege level is storedin the lower two bits of the CS register. And what do you know, our sample programis running…\n  …in Ring 3! As it should, since it&#39;s a regular userland program, not kernel code.\n However the 286&#39;s protected mode is kind of annoying to use - for starters,it breaks compatibility with old 8086 applications. And to make things worse,once you switch it from “real” mode to “protected” mode, you can&#39;t switchback without performing a hard reset.\n But, the few applications that  do make use of the 286&#39;s protected mode areable to use the full 24-bit physical address space: 16 MiB. In theory. Inpractice, 286 motherboards only support up to 4 MiB of RAM - and even then,buying that much memory is prohibitively expensive.\n Fast forward to 1985. The  Japan-US semiconductor war is raging. Intel eventually decides to stop producing DRAM, now focusing on microprocessors.\n  In October of 1985, Intel releases the  80386 (which we&#39;ll call “the 386”) -the first implementation of the 32-bit extension to the  80286 architecture.Finally,  finally, the data width and the address width are the same: 32bits.\n  Which means - in theory - the 386 is able to address 4 GiB of RAM.\n  In practice though, boards that let you have that much memory - or anywhereclose to it - do not exist. Even a couple megabytes of RAM will set you back.\n  Tall Tree Systems presents JRAM-3, the newest member of the JRAM family.JRAM-3 is a fourth generation multifunction memory board and the successor ofthe highly praised JRAM-2. Designed to meet the latest expanded memoryspecification standard being implemented by the major spreadsheet vendors,JRAM-3 can access up to eight megabytes of memory for larger, more efficientspreadsheets. JRAM-3 can also be used for DOS memory, electronic di\n......", "posttime": "2020-06-26 02:59:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "线程,程序,执行,local,寄存器", "title": "制作我们自己的可执行打包程序，第13部分，线程本地存储", "title_en": "Making our own executable packer, part 13, Thread-local storage", "transed": 1, "url": "https://fasterthanli.me/blog/2020/thread-local-storage/", "via": "", "real_tags": ["线程", "程序", "执行", "local", "寄存器"]}, {"category": "", "categoryclass": "", "imagename": "b2ce936850c390ff53a37eacb94373c7.jpeg", "infoid": 1008255, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "10.0.0版已经到了！这是一个跨越整个平台的主要版本，包括框架、角度材质和CLI。这个版本比典型的版本要小；从我们发布9.0版的ANGLE到现在只有4个月的时间。\n我们尝试每年发布两个主要版本，以与JavaScript生态系统的其余部分保持角度同步，并拥有可预测的时间表。我们计划在今年秋天发布版本11。\n要使用新的日期范围选取器，可以使用MAT-DATE-RAME-INPUT和MAT-DATE-RANGE-PICTER组件。\n当您使用与CommonJS一起打包的依赖项时，它可能会导致较大的较慢的应用程序。\n从版本10开始，当您的构建拉入这些捆绑包之一时，我们现在会警告您。如果您已经开始看到这些关于依赖项的警告，请让您的依赖项知道您更喜欢ECMAScript模块(ESM)包。\n当您使用ng new创建新的工作区时，版本10提供了更严格的项目设置。\n启用此标志会使用一些新设置来初始化您的新项目，这些设置可提高可维护性，帮助您提前捕获错误，并允许CLI对您的应用程序执行高级优化。具体地说，Strict标志执行以下操作：\n像往常一样，我们对ANGLE的依赖项进行了一些更新，以与JavaScript生态系统保持同步。\n我们还更新了项目布局。从版本10开始，您将看到一个新的tsconfig.base.json。这个额外的tsconfig.json文件更好地支持IDE和构建工具解析类型和包配置的方式。\n我们已经更新了新项目的浏览器配置，以排除较旧和较少使用的浏览器。\n这有一个副作用，即默认情况下为新项目禁用ES5构建。要为需要ES5构建和差异加载的浏览器(如IE或UC浏览器)启用ES5构建和差异加载，只需在.Browserlistrc文件中添加您需要支持的浏览器即可。\n我们大幅增加了与社区合作的投资。在过去的三周里，我们的待定问题数量减少了700多个问题，涉及框架、工具和组件。我们已经触及了2000多个问题，我们计划在接下来的几个月里进行大笔投资，与社区合作做更多的事情。\nANGLE软件包格式不再包括ESM5或FESM5捆绑包，在为ANGLE软件包和库运行纱线或NPM安装时，可以节省119MB的下载和安装时间。不再需要这些格式，因为支持ES5的任何降级都是在构建过程结束时完成的。\n基于与社区的广泛协商，我们不建议支持较旧的浏览器，包括IE9、10和Internet Explorer Mobile。\n有关详细信息和指导，请访问update.angular.io。为了获得最佳的更新体验，我们建议您始终一次升级一个主要版本。", "note_en": "Version 10.0.0 is here! This is a  major release that spans the entire platform, including the framework, Angular Material, and the CLI. This release is smaller than typical; it has only been 4 months since we released version 9.0 of Angular.\n  We try to release two major versions each year to keep Angular synchronized with the rest of the JavaScript ecosystem and to have a predictable schedule. We plan to release version 11 this fall.\n     To use the new date range picker, you can use the  mat-date-range-input and  mat-date-range-picker components.\n    When you use a dependency that is packaged with CommonJS, it can result in  larger slower applications.\n Starting with version 10, we now warn you when your build pulls in one of these bundles. If you’ve started seeing these warnings for your dependencies, let your dependency know that you’d prefer an ECMAScript module (ESM) bundle.\n   Version 10 offers a more strict project setup when you create a new workspace with  ng new.\n  Enabling this flag initializes your new project with a few new settings that improve maintainability, help you catch bugs ahead of time, and allow the CLI to perform advanced optimizations on your app. Specifically, the  strict flag does the following:\n   As usual, we have made a few updates to the dependencies of Angular to stay synchronized with the JavaScript ecosystem.\n  We’ve also updated our project layout. Starting with version 10 you will see a new  tsconfig.base.json. This additional   tsconfig.json  file better supports the way that IDEs and build tooling resolve type and package configurations.\n  We’ve updated the browser configuration for new projects to exclude older and less used browsers.\n     This has the side effect of disabling ES5 builds by default for new projects. To enable ES5 builds and differential loading for browsers that require it (such as IE or UC Browser), simply  add the browsers you need to support in the  .browserslistrc file.\n  We’ve dramatically increased our investment in working with the community. In the last three weeks our open issue count has decreased by over 700 issues across  framework,  tooling, and  components. We’ve touched over 2,000 issues, and we plan to make large investments over the next few months, working with the community to do even more.\n   The  Angular Package Format no longer includes ESM5 or FESM5 bundles, saving you 119MB of download and install time when running  yarn or  npm install for Angular packages and libraries. These formats are no longer needed as any downleveling to support ES5 is done at the end of the build process.\n Based on heavy consultation with the community, we are deprecating support for older browsers including IE 9, 10, and  Internet Explorer Mobile.\n   Visit  update.angular.io for detailed information and guidance. To have the best update experience, we recommend always upgrading one major release at a time.", "posttime": "2020-06-26 02:59:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "角度,angular,浏览器", "title": "角度10现已可用", "title_en": "Angular 10 Now Available", "transed": 1, "url": "https://blog.angular.io/version-10-of-angular-now-available-78960babd41", "via": "", "real_tags": ["角度", "angular", "浏览器"]}, {"category": "", "categoryclass": "", "imagename": "46c1530b6d5bcfa7d236c27d6e2e9b88.png", "infoid": 1008254, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我正在比较Hey.com和我目前的邮件系统Gmail的功能。我意识到Hey.com也有隐私方面的好处，但我在这里只关注功能。所有这些声明都是我个人的观点，并不意味着以任何方式忽视大本营人民的努力。\n我在6月17日收到了Hey.com的邀请，并立即将我从Gmail账户收到的所有邮件都转发到了我的新的嘿账户。\n你注意到的第一件事是你的邮箱有多空。我完全理解不允许导入旧电子邮件的决定，因为它并不真正符合功能，但这导致在查找旧电子邮件时，无论是你想要重新阅读的一些信息，还是某人的联系方式或地址，都会在嘿和Gmail之间进行大量切换。\n我想随着时间的推移，切换到你的旧邮箱的次数会减少，但这仍然是一个问题。两位创始人都建议Twitter上的用户将他们的旧邮箱导出为Mbox格式，并将其存储在某个地方，但这只给了你一个备份，并不能存储整个搜索失败。现在是2020年，我希望能够从我拥有的任何设备上搜索我的旧邮件，而不必等待。\n让我们来关注一下这一创新的新功能：“The Screener”。虽然它背后的想法绝对很酷，但我很快就觉得它带来了一些问题，因为某些原因我无法克服。\n首先，接收电子邮件变成了一件主动的事情，而不是一件被动的事情。以前，我会收到一封电子邮件，阅读它，将它移动到任何文件夹，存档它，阻止发件人，或者任何你期望能够对电子邮件执行的操作。但是现在，您将进入一个新的决策过程：您是否希望从此地址接收电子邮件？如果是，您希望将电子邮件发送到何处？(可选择收件箱、进纸或纸迹)。\n问题是，这个决定并不像看起来那么简单。由于嘿的目标文件夹基于发送电子邮件地址(而不是像Gmail那样基于内容)，这意味着当企业从info@business.com向您发送时事通讯时，您的第一反应可能是将时事通讯(以及发送地址)分配给Feed。但是，同样的企业可能会从相同的电子邮件地址向您发送订单确认，然后最终会出现在Feed中，而不是Paper Trail！更糟糕的是，你可以通过他们网站上的联系人表格向他们发送问题，他们可能会再次从同一个地址回答你，但这一次你想把它放在你的收件箱里。\nGoogle非常擅长根据发送地址和内容(可能还有更多参数)将邮件分类为主要的、社交的或促销的邮件。由于只看发送地址，Hey.com在这里的竞争中处于劣势。\n当决定阻止电子邮件地址在筛选器中发送时，同样的决定过程也是一个问题。我从一个我有时会访问的网站收到一份时事通讯，但在那里我绝对对时事通讯不感兴趣。在Gmail中，这份时事通讯要么会出现在“促销”中，我可以忽略它；要么会出现在我的收件箱里，在那里我会被触发取消订阅这份时事通讯。\n在Hey.com中，你可能只想点击“否”，然后就完事了。再也没有时事通讯了，太好了，对吧？不，再猜一次。你刚刚拒绝了所有来自这个地址的电子邮件。如果同一家公司现在想给您发送一封您想要接收的电子邮件(例如，“我们的数据库已被攻破，请重新设置您的密码”)，您也可以直接拒绝该电子邮件。\n这会让你要么对太多邮件说“是”(因为你不想冒险错过来自同一地址的重要邮件)，要么说“不”，但有一种感觉是，你可能会后悔将来会说“不”。\nHey.com有一个比Gmail严格得多的垃圾邮件过滤器。当然，我们可以讨论什么是垃圾邮件，但我个人觉得Gmail在这方面做得很好，特别是在误报的情况下。我宁愿在我的收件箱里多放一封垃圾邮件，也不愿在我的垃圾邮件箱里错过一封重要的邮件。尽管我在试用期间只使用了Hey.com，但我仍然有几封邮件变成了垃圾邮件，而我本想在我的收件箱里收到这些邮件。\n我一开户就在我的手机(Android)上安装了Hey.com移动应用。你注意到的第一件事是：没有通知！hey.com在这里解释了这一点：https://hey.com/features/notifications/。这款应用程序为你提供了以线程或发件人为基础打开通知的选项，但这对用户来说感觉像是一种负担。如果同事在我离开办公室后给我发了一封电子邮件，我仍然希望在我的电话上收到有关它的通知。要求我主动将所有同事(以及任何其他我希望收到通知的人)列入白名单似乎很烦人。我的手机有完美的通知设置(禁用每个应用程序，请勿打扰模式等)。Hey.com至少应该为你的收件箱中的每封电子邮件提供接收通知的选项。我已经是成年人了，我可以自己决定如何处理我的通知，特别是如果你每年收取99美元的服务费。\n除了通知，我注意到这款应用在几个场合加载内容都很慢，无论是在打开电子邮件还是切换到屏幕视图时都是如此。我在4G和Wifi上都观察到了这一点，我的普通Gmail应用程序从来没有遇到过这个问题。我想他们可以在未来的版本中修复这个问题，但这肯定很烦人。\n不幸的是，我不会切换到Hey.com作为我的主要电子邮件客户端。虽然我对一种全新的、改进的电子邮件体验感到兴奋，但我觉得Hey.com不适合我。虽然他们确实给电子邮件列表带来了一些新的、很酷的东西(稍后回复，搁置一边)，但一些功能的实现让人感觉非常固执己见，即使他们增加了关闭屏幕并在全球范围内打开通知的可能性(这是我最大的两个抱怨)，我仍然觉得它没有战胜Gmail(日历集成、更好的内容和垃圾邮件过滤等)。", "note_en": "I’m comparing the functionality of Hey.com vs my current mail system, Gmail. I realise that Hey.com also has a privacy upside to it, but I’m only focusing on functionality here. All of the statements are my own opinion, and not meant to disregard the efforts of the people at Basecamp in any way.\n  I received my Hey.com invite on June 17th, and immediately forwarded all my incoming mails from my Gmail account to my new Hey account.\n The first thing that you notice is how empty your mailbox is. I can totally understand the decision to not allow the importing of old e-mails because it doesn’t really fit with the functionality, but this leads to a lot of switching between Hey and Gmail when looking for an old e-mail, be it some information you want to re-read or someone’s contact details or address.\n I assume the switching to your old mailbox will reduce over time, but it’s still a problem. Both founders suggest users on twitter to export their old mailbox to mbox format and store it somewhere, but that only gives you a backup, it doesn’t store the whole search debacle. It’s 2020, I want to be able to search my old mails from any device I have, and not have to wait for it either.\n   Let’s focus on the new and innovative feature: “The Screener”. While the idea behind it is definitely cool, I quickly felt it posed some problems which I could not get over for some reason.\n First of all, receiving e-mail becomes an active thing instead of a passive thing. Before, I would receive an e-mail, read it, move it to any folder, archive it, block the sender, or any action you’d expect to be able to do with an e-mail. But now, you’re thrown into a new decision making process: Do you want to receive e-mail from this address, and if so, where do you want the e-mail to go? (Imbox, Feed or Paper Trail being the options).\n The problem is that this decision isn’t as simple as it seems. Since Hey bases their destination folder on the sending e-mail address (as opposed to on the content like Gmail does), this means that when a business sends you a newsletter coming from info@business.com, your first reaction might be to assign the newsletter (and thus the sending address) to The Feed. However, the same business might be sending you an order confirmation from the same e-mail address, which would then end up in The Feed instead of the Paper Trail! Even worse, you could send them a question through a contact form on their website and they might answer you from the same address again, but this time you’d like to have it in your Imbox instead.\n Google is very good at classifying mails into Primary, Social or Promotions, both based on sending address and content (and probably many more parameters). By only looking at the sending address, Hey.com is falling short of the competition here.\n The same decision process is a problem when deciding to block an email address from sending in The Screener. I receive a newsletter from a website which I sometimes visit but where I’m definitely not interested in the newsletter. In Gmail, this newsletter would either end up in Promotions, where I could just ignore it, or in my Inbox, where I would be triggered to go unsubscribe from this newsletter.\n In Hey.com, you might be tempted to just click No, and be done with it. No more newsletters, great, right? Nope, guess again. You just said no to ALL emails coming from this address. If the same company now wants to send you an e-mail which you wanted to receive (say, “Our database has been breached, please reset your password”), you just said no to that e-mail too.\n This leaves you with either saying Yes to too many mails (because you don’t want to risk missing an important mail from the same address), or saying No but having the feeling that you might regret having said No in the future.\n  Hey.com has a spam filter which is way stricter than Gmail’s. Sure, we can discuss about what actually is counted as spam, but I personally feel Gmail is doing a pretty good job at it, especially in the case of false positives. I’d rather have one spam mail more in my inbox than missing one important mail in my spam box. Even though I only used Hey.com during the trial, I still had several mails go into spam which I wanted to have received in my Imbox instead.\n  I also installed the Hey.com mobile app on my phone (Android) as soon as I made an account. The first thing you notice: No notifications! Hey.com explains it themselves here:  https://hey.com/features/notifications/ . The app offers you the option of turning on notifications on a thread or sender basis, but that feels like a burden to the user. If a colleague sends me an e-mail after I have left the office, I still want to receive a notification about it on my phone. Asking me to proactively whitelist all my colleagues (and any other person I would want to receive notifications from) seems annoying. My phone has perfect notifications settings (disable per app, do not disturb mode, etc). Hey.com should at least give the option to receive a notification for every e-mail in your Imbox. I’m a grown up, I can decide how I handle my notifications myself, especially if you’re charging 99$/year for your service.\n Apart from the notifications, I noticed on several occasions the app was slow in loading content, both when opening an e-mail or switching to The Screener view. I observed this both on 4G and Wifi, and have never had this issue with my normal Gmail app. I assume they can fix this in future versions, but it was annoying for sure.\n  I won’t be switching to Hey.com as my main email client unfortunately. As excited as I was for a new and improved e-mail experience, I feel like Hey.com isn’t it for me. While they definitely bring some new and cool stuff to the email table (Reply Later, Set Aside), the implementation of some features feels very opinionated, and even if they added the possibility to turn off The Screener and turn on notifications globally (which are my 2 biggest gripes), I still feel like it doesn’t win out vs Gmail (calendar integration, better content and spam filtering, etc).", "posttime": "2020-06-26 02:57:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "不会,won,电子邮件", "title": "Hey.com：一篇评论(也是为什么我不会换的原因)", "title_en": "Hey.com: a review (and why I won't be switching)", "transed": 1, "url": "https://medium.com/@jonathan.goyvaerts/hey-com-a-review-and-why-i-wont-be-switching-8de2ee6b311e", "via": "", "real_tags": ["不会", "won", "电子邮件"]}, {"category": "", "categoryclass": "", "imagename": "b7fba3610c0acb9e33f6e9eda4243af1.jpg", "infoid": 1008253, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最新版的Arcore是谷歌针对Android手机的增强现实开发平台，现在包含了深度API。这个API早在12月份就发布了，但是现在它在Arcore1.18中对每个人都是实况转播。\n以前，Arcore会绘制墙壁和地板，并相应地缩放AR对象，但Depth API支持遮挡等功能-让AR演员看起来像在现实世界中的对象后面。深度感应实现的另一个重要功能是模拟物理的能力，比如将虚拟物体扔下现实生活中的楼梯，并让它真实地反弹。\n虽然苹果正在为其用于增强现实的设备构建更先进的硬件，即iPad Pro中的激光雷达传感器，但Arcore通常被设计为在相机硬件中的最低公分母上工作。在过去，这意味着Arcore只使用一个摄像头，即使大多数Android手机，甚至是便宜的~100美元的Android手机，都配备了多个摄像头，可以帮助进行3D传感。(高通在这方面应该受到一些指责，因为它的SoC通常一次只支持运行一个摄像头。)。\n在1.18版本中，Arcore有史以来第一次可以使用一些额外的相机硬件来帮助进行3D传感。虽然Depth API可以在单摄像头模式下运行，使用运动来确定深度值，但它也可以从手机的飞行时间传感器获取数据，以提高深度质量。三星是在Note10+和Galaxy S20 Ultra中被称为明确支持这一点的公司之一。请注意，这两个都是这些设备的最高端SKU。很多手机都有多个摄像头，比如广角和长焦，但很多手机都有ToF摄像头。\n要猜测Arcore的未来，一个好主意是隔着过道看看ArKit，这是苹果的增强现实平台。ARKit中一个很大的深度功能似乎没有在Google的博客文章中被提及，那就是人物遮挡，即移动物体来隐藏虚拟物体的能力。谷歌的演示只展示了隐藏虚拟物体的静止物体。\n深度API提供Android和Unity SDK两个版本。对于用户来说，你需要一部与Arcore兼容的手机。谷歌在这里维护着一个很大的名单。", "note_en": "The latest version of ARCore, Google&#39;s augmented reality developer platform for Android phones, now  includes a depth API. The API was released as a preview back in December, but now it&#39;s live for everyone in ARCore 1.18.\n Previously, ARCore would map out walls and floors and scale AR objects accordingly, but the Depth API enables things like occlusion—letting AR actors appear to be behind objects in the real world. The other big feature enabled by depth sensing is the ability to simulate physics, like the ability to toss a virtual object down the real-life stairs and have it bounce around realistically.\n  While Apple is building more advanced hardware into its devices for augmented reality, namely the lidar sensor in the iPad Pro, ARCore has typically been designed to work on the lowest common denominator in camera hardware. In the past that has meant ARCore only uses a single camera, even when most Android phones, even  cheap ~$100 Android phones, come with multiple cameras that could help with 3D sensing. (Qualcomm&#39;s deserves some of the blame here, since its SoCs have often only supported running  a single camera at a time.)\n In version 1.18, for the first time ever, ARCore can use some of this extra camera hardware to help with 3D sensing. While the Depth API can run in a single-camera mode that uses motion to determine depth values, it can also pull in data from a phone&#39;s time-of-flight sensor to improve the depth quality. Samsung was one of the companies that was called out as specifically supporting this in the Note10+ and Galaxy S20 Ultra. Note that both of these are the highest-end skus for these devices. Tons of phones have multiple cameras like wide-angle and telephoto, but many phones have ToF cameras.\n For a guess at the future of ARCore, a good idea would be a look across the aisle to ARKit, Apple&#39;s augmented reality platform. A big depth feature in ARKit that doesn&#39;t seem to be mentioned in Google&#39;s blog post is &#34;people occlusion,&#34; or the ability for  moving objects to hide virtual objects. Google&#39;s demos only show stationary objects hiding virtual objects.\n The Depth API is available in Android and Unity SDKs. For users, you&#39;ll need an ARCore-compatible phone. Google maintains a big list  here.", "posttime": "2020-06-26 02:39:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "android,google,提供,arcore", "title": "Google在Arcore 1.18中提供Android深度感知和对象遮挡功能", "title_en": "Google gives Android depth sensing and object occlusion with ARCore 1.18", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/06/google-gives-android-depth-sensing-and-object-occlusion-with-arcore-1-18/", "via": "", "real_tags": ["android", "google", "提供", "arcore"]}, {"category": "", "categoryclass": "", "imagename": "567191c2d787d45f7ad74a3c88c60442.png", "infoid": 1008252, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据新提交的文件，Lemonade预计其IPO定价为每股23美元至26美元。由于该公司打算在上市首日出售1100万股票，这家专注于租赁和家庭保险的独角兽公司将以这样的价格筹集2.53亿至2.86亿美元的资金。\n加上将向承销银行提供的另外165万股，该公司的筹资规模增至2.91亿至3.289亿美元。考虑到IPO价格区间，包括向承销商发行的股票在内，Lemonade的隐含估值从13.亿美元到14.7亿美元不等。\n这就是新闻。现在，这个预期估值区间是否强劲，如果不是，它对其他保险科技初创公司可能预示着什么？我们来谈谈这件事吧。\nTechCrunch今天晚些时候将与河马(房主保险)和Root(汽车保险)的首席执行官们交谈，所以我们将快速了解他们关于Lemonade的IPO进展情况，以及他们是否对其定价目标感到惊讶。\n但即使没有外部评论，Lemonade至少最初瞄准的定价区间也不是特别令人印象深刻。这就是说，它比我预期的要强。", "note_en": "According to  its new filing, Lemonade expects its IPO to price at $23 to $26 per share. As the company intends to sell 11 million shares in its debut, the rental and home insurance-focused unicorn would raise between $253 million and $286 million at those prices.\n Counting an additional 1.65 million shares that it will make available to its underwriting banks, the company’s fundraise grows to $291 million to $328.9 million. Including shares offered to underwriters, Lemonade’s implied valuation given its IPO price range runs from $1.30 billion to $1.47 billion.\n  That’s the news. Now, is that expected valuation interval strong, and, if not, what might it portend for other insurtech startups? Let’s talk about it.\n  TechCrunch is speaking with the CEOs of  Hippo (homeowner’s insurance) and  Root (car insurance) later today, so we’ll get their notes in quick order regarding how Lemonade’s IPO is shaping up, and if they are surprised by its pricing targets.\n But even without external commentary, the pricing range that Lemonade is at least initially targeting is not terribly impressive. That said, it’s stronger than I anticipated.", "posttime": "2020-06-26 02:38:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ipo,targets,lemonade", "title": "\n柠檬水在即将到来的IPO中瞄准下一轮定价", "title_en": "\n\t\t\t\tLemonade targets down-round pricing in impending IPO\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/lemonade-targets-down-round-pricing-in-impending-ipo/", "via": "", "real_tags": ["ipo", "targets", "lemonade"]}, {"category": "", "categoryclass": "", "imagename": "899b350581ad3635b4e522ce25ad8576.jpg", "infoid": 1008249, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，Dealmaster的头条新闻是推荐的USB-C充电配件的几笔交易。其中最显著的折扣是Aukey&39；的PB-Y13，这是我们在最佳USB-C配件指南中强调的一种便携式电池，在结账时代号为WD3S7ONL&34；的价格降至19美元。这是一款纤薄的电源库，有一个18W的USB-C电源传输端口，功能强大到足以为最新的智能手机以最高速度充电，还有两个USB-A端口，其中一个端口支持高通的Quick Charge 3.0标准。它的零售价通常为30美元。\n除此之外，RavPower的RP-PC105是一款小巧的壁式充电器，配有一个61W的USB-C PD端口(还有一个标准的USB-A端口)；它便于旅行，但仍然足够坚固，可以通过适当的电缆为许多13英寸笔记本电脑充电。使用代码4P3W38GE&#34；可以将价格从通常的30美元降到20美元。如果您需要一根结实的USB-C线，我们可以担保Anker的电源线，结账时代码为0S2GVA7N&34；的电源线价格从通常的12美元降到了9美元。它可以提供高达60W的功率，并提供终身保修。\n不过，如果你已经准备好了USB-C充电前线，我们还可以提供电子控制、欧洲之旅的门票、Sonos扬声器、降噪耳机等等。下面你自己看看吧。\nDealmaster推出了自己的时事通讯！注册后，就可以收到一份更短的、经过严格管理的网上最佳科技交易清单--不要胡说八道，直接进入你的收件箱，而且通常是在它们进入ARS主页之前。\n注意：ARS Technica可能会通过会员计划从本帖子上的链接中获得销售补偿。\nAukey PB-Y13 USB-C便携式电池-18W USB-C PD，2x USB-A，QC 3.0,10000mAh/37Wh，亚马逊售价18.89美元(使用代码：EWD3S7ONL，通常为30美元)。\nAnker PowerLine(3英尺)USB-C到USB-C Gen 3.1代电缆在亚马逊售价8.99美元(使用代码：0S2GVA7N-通常为12美元)。\nRAVPower RP-PC105/USB-C壁式充电器-61W USB-C、USB-A在亚马逊售价19.99美元(使用代码：64P3W38GE-通常为30美元)。\nDaTronics TT-BH090无线降噪耳机在亚马逊售价39.99美元(夹10美元优惠券，使用代码：AEDZL2QY-通常为70美元)。\n亚马逊Echo Dot配备时钟系统(第三代)智能扬声器，在亚马逊售价34.99美元(通常为50美元)。\n联想ThinkPad X1碳(第七代)笔记本电脑-英特尔酷睿i5-10210U，14英寸1080P，8 GB内存，256 GB固态硬盘，在联想通过eBay售价约949.99美元(通常为1,100美元)。\n联想ThinkCentre M90n迷你台式PC-英特尔酷睿i5-8265U，8 GB内存，512 GB固态硬盘，联想售价399美元(通常为600美元)。\nApple Back to School促销：Apple AirPods真正的无线耳机可以免费购买精选Mac或iPad(必须是高等教育学生、高等教育学生的家长或K-12学校员工才有资格)。\n苹果MacBook Air(2020)笔记本电脑-1.1 GHz英特尔酷睿i5-1030NG7，13.3英寸2560x1600，8 GB RAM，512 GB固态硬盘，魔术键盘，亚马逊售价1199.99美元(通常为1270美元)。\n苹果MacBook Air笔记本电脑(2020年)-1.1 GHz英特尔酷睿i3-1000NG4，13.3英寸2560x1600，8 GB内存，256 GB固态硬盘，魔术键盘，亚马逊售价899.99美元(通常为970万美元)。\nAMD Ryzen 7 3700X 8核/16线程台式机处理器+Wraith Prism LED散热器在亚马逊售价约273.47美元(通常为295美元)。\n龙之旅XI：难以捉摸的时代的回声(PS4)，在亚马逊售价19.99美元(通常为25美元)。\nNeoGeo Arade Stick Pro和复古游戏机+控制器-包括20款SNK游戏，在亚马逊售价99美元(通常为130美元)。\nDaTronics TT-BH090无线降噪耳机在亚马逊售价39.99美元(夹10美元优惠券，使用代码：AEDZL2QY-通常为70美元)。\nAnker Soundcore Life Q20在亚马逊以49.99美元的价格出售蓝牙降噪耳机(剪贴10美元的优惠券-通常是60美元)。\n亚马逊Fire TV Cube 4K HDR媒体流+智能扬声器在亚马逊售价99.99美元(通常为120美元)。\n谷歌Nest Cam户外摄像头(2件装)1080P户外安全摄像头在亚马逊商店售价2.38亿美元(通常为300美元)。\n亚马逊Echo Dot(第三代)智能扬声器在Woot售价24.99亿美元(亚马逊售价3000万美元-通常为40美元)。\n亚马逊Echo Dot配备时钟系统(第三代)智能扬声器，在亚马逊售价34.99美元(通常为50美元)。\n亚马逊Echo Studio智能家居音箱+飞利浦色调白色环境智能发光二极管灯泡在亚马逊售价169.99美元(通常为200美元)。\nTP-Link Kasa HS200(3件装)智能灯具开关在亚马逊售价44.99美元(剪贴10美元优惠券-通常为60美元)。\n用于iPad(第七代)和iPad Air(第三代)的苹果智能键盘在亚马逊的售价为99美元(通常为130美元)。\nAukey PB-Y13 USB-C便携式电池-18W USB-C PD，2x USB-A，QC 3.0,10000mAh/37Wh，亚马逊售价18.89美元(使用代码：EWD3S7ONL，通常为30美元)。\nRAVPower RP-PC105/USB-C壁式充电器-61W USB-C、USB-A在亚马逊售价19.99美元(使用代码：64P3W38GE-通常为30美元)。\nAnker PowerLine(3英尺)USB-C到USB-C Gen 3.1代电缆在亚马逊售价8.99美元(使用代码：0S2GVA7N-通常为12美元)。\nAnker PowerLine+II将(3英尺)USB-C转换为Lightning编织尼龙电缆，在亚马逊售价12.99美元(使用代码：AKPLPCTL)，通常为22美元。\nAnker PowerLine+II(3英尺，2件装)USB-C到闪电电缆在亚马逊售价21.99美元(使用代码：AKPLPCT2-通常为36美元)。\nAnker PowerCore III Fusion 5K，USB-C壁式充电器+便携式电池-18W USB-C PD，USB-A，5000 mAH，在亚马逊售价29.99美元(通常为40美元)。\nAnker Powerwave 7.5支架-齐无线充电座-10W Galaxy/7.5W iPhone+AC适配器，在亚马逊售价32.99美元(剪裁34%优惠券-通常为49美元)。", "note_en": "Today&#39;s Dealmaster is headlined by a handful of deals on recommended USB-C charging accessories. The most notable discount of the bunch is  Aukey&#39;s PB-Y13—a portable battery we&#39;ve highlighted in our  guide to the best USB-C accessories—down to $19 with the code &#34;WD3S7ONL&#34; at checkout. This is a slim power bank with an 18W USB-C Power Delivery port that&#39;s powerful enough to charge  most recent smartphones at maximum speeds, as well as two USB-A ports, one of which supports Qualcomm&#39;s Quick Charge 3.0 standard. It normally retails for $30.\n Beyond that,  RavPower&#39;s RP-PC105 is a compact wall charger with a 61W USB-C PD port (alongside a standard USB-A port); it&#39;s travel-friendly but still strong enough to charge many 13-inch laptops with the appropriate cable. Using the code &#34;4P3W38GE&#34; brings it down to $20 from its usual $30. And if you need a sturdy USB-C cable, we can vouch for  Anker&#39;s PowerLine, which is down to $9 from its usual $12 with the code &#34;  0S2GVA7N&#34; at checkout. It can deliver up to 60W of power and comes with a lifetime warranty.\n If you&#39;re all set on the USB-C charging front, though, we also have deals on  Control,  Ticket to Ride: Europe, Sonos speakers, noise-cancelling headphones, and more. Have a look for yourself below.\n The Dealmaster has launched its very own newsletter! Sign up to receive a shorter, tightly curated list of the very best tech deals on the Web—no nonsense, direct to your inbox, and often before they make it to the Ars homepage.\n Note: Ars Technica may earn compensation for sales from links on this post through  affiliate programs.\n  Aukey PB-Y13 USB-C portable battery - 18W USB-C PD, 2x USB-A, QC 3.0, 10,000mAh/37Wh for  $18.89 at Amazon (use code:  WD3S7ONL - normally $30).\n Anker PowerLine (3ft) USB-C to USB-C Gen 3.1 cable for  $8.99 at Amazon (use code:     0S2GVA7N - normally $12).\n RavPower RP-PC105 USB-C wall charger - 61W USB-C, USB-A for  $19.99 at Amazon (use code:  4P3W38GE - normally $30).\n  TaoTronics TT-BH090 wireless noise-cancelling headphones for  $39.99 at Amazon ( clip $10 coupon and use code:  AEDZL2QY - normally $70).\n     Amazon Echo Dot with Clock (3rd gen) smart speaker for  $34.99 at Amazon (normally $50).\n   Lenovo ThinkPad X1 Carbon (7th gen) laptop - Intel Core i5-10210U, 14-inch 1080p, 8GB RAM, 256GB SSD for  $949.99 at Lenovo via eBay (normally $1,100).\n Lenovo ThinkCentre M90n mini desktop PC - Intel Core i5-8265U, 8GB RAM, 512GB SSD for  $399 at Lenovo (normally $600).\n Apple Back to School sale: Apple AirPods true wireless earbuds for  free with select Mac or iPad purchases ( must be Higher Education student, parent of Higher Education student, or K-12 school employee to be eligible).\n Apple MacBook Air (2020) laptop - 1.1GHz Intel Core i5-1030NG7, 13.3-inch 2560x1600, 8GB RAM, 512GB SSD, Magic Keyboard for  $1,199.99 at Amazon (normally $1,270).\n Apple MacBook Air (2020) laptop - 1.1GHz Intel Core i3-1000NG4, 13.3-inch 2560x1600, 8GB RAM, 256GB SSD, Magic Keyboard for  $899.99 at Amazon (normally $970).\n AMD Ryzen 7 3700X 8-core/16-thread desktop processor + Wraith Prism LED cooler for  $273.47 at Amazon (normally $295).\n   Dragon Quest XI: Echoes of an Elusive Age (PS4) for  $19.99 at Amazon (normally $25).\n   NeoGeo Arcade Stick Pro retro console + controller - includes 20 SNK games for  $99 at Amazon (normally $130).\n   TaoTronics TT-BH090 wireless noise-cancelling headphones for  $39.99 at Amazon ( clip $10 coupon and use code:  AEDZL2QY - normally $70).\n Anker Soundcore Life Q20 Bluetooth noise-cancelling headphones for  $49.99 at Amazon ( clip $10 coupon - normally $60).\n      Amazon Fire TV Cube 4K HDR media streamer + smart speaker for  $99.99 at Amazon (normally $120).\n   Google Nest Cam Outdoor (2-pack) 1080p outdoor security camera for  $238 at Amazon (normally $300).\n Amazon Echo Dot (3rd gen) smart speaker for  $24.99 at Woot (  $30 at Amazon - normally $40).\n Amazon Echo Dot with Clock (3rd gen) smart speaker for  $34.99 at Amazon (normally $50).\n  Amazon Echo Studio smart home speaker + Philips Hue White Ambiance smart LED bulb for  $169.99 at Amazon (normally $200).\n     TP-Link Kasa HS200 (3-pack) smart light switch for  $44.99 at Amazon ( clip $10 coupon - normally $60).\n   Apple Smart Keyboard for iPad (7th gen) and iPad Air (3rd gen) for  $99 at Amazon (normally $130).\n Aukey PB-Y13 USB-C portable battery - 18W USB-C PD, 2x USB-A, QC 3.0, 10,000mAh/37Wh for  $18.89 at Amazon (use code:  WD3S7ONL - normally $30).\n RavPower RP-PC105 USB-C wall charger - 61W USB-C, USB-A for  $19.99 at Amazon (use code:  4P3W38GE - normally $30).\n Anker PowerLine (3ft) USB-C to USB-C Gen 3.1 cable for  $8.99 at Amazon (use code:     0S2GVA7N - normally $12).\n Anker PowerLine+ II (3ft) USB-C to Lightning braided nylon cable for  $12.99 at Amazon (use code:  AKPLPCTL - normally $22).\n Anker PowerLine+ II (3ft, 2-pack) USB-C to Lightning cable for  $21.99 at Amazon (use code:  AKPLPCT2 - normally $36).\n Anker PowerCore III Fusion 5K USB-C wall charger + portable battery - 18W USB-C PD, USB-A, 5,000mAh for  $29.99 at Amazon (normally $40).\n Anker PowerWave 7.5 Stand Qi wireless charging stand - 10W Galaxy/7.5W iPhone + AC adapter for  $32.99 at Amazon ( clip 34% coupon - normally $49).", "posttime": "2020-06-26 02:16:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "购买,recommended,usb", "title": "今天购买我们推荐的USB-C PD便携式电池，售价19美元", "title_en": "Grab one of our recommended USB-C PD portable batteries for $19 today", "transed": 1, "url": "https://arstechnica.com/staff/2020/06/grab-one-of-our-recommended-usb-c-pd-portable-batteries-for-19-today/", "via": "", "real_tags": ["购买", "usb"]}, {"category": "", "categoryclass": "", "imagename": "1c420b282649defbedc48bbac68692b4.jpg", "infoid": 1008247, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "推出UV手机消毒剂的最佳时机应该是大约五个月前。然而，第二个可能的最佳时机就是现在。当新冠肺炎大流行真正开始真正冲击全球社会时，这些曾经相当小众的产品遭到了像PhoneSoap这样的公司的抢购。\n事实上，当许多人第一次开始意识到智能手机可能在多大程度上成为疾病媒介时，现有的型号就开始在各地销售一空。考虑到这一切，对于Zagg伞下的许多配饰品牌来说，这一类别是相当合乎逻辑的下一步。\n今天，莫菲和隐形盾推出了他们对这一类别的看法。这两款产品的价格分别为80美元和60美元，这里的关键区别在于包括了一个10W的无线充电板。虽然这实际上是在产品的盖子上。这意味着你只能在手机离开消毒床后才能用它给手机充电。\n这两款产品都能使用UV-C光对手机进行长达6.9英寸的消毒，承诺能杀死99.9%的细菌。当然值得注意的是，像PhoneSoap一样，这些品牌并没有声称他们的产品可以杀死这种新型冠状病毒。对于他们在这方面的效力，陪审团仍然没有定论。事实上，新冠肺炎显然没有出现在新闻材料中。即使有了这些，我还是强烈建议你随身携带一包抗菌湿巾，如果你还能找到的话。", "note_en": "The best possible time to launch a UV phone sanitizer would have been about five months ago. The second best possible time, however, is right now. When the COVID-19 pandemic really started hitting the global community in earnest, there was a run on these once fairly niche products from companies with names like PhoneSoap.\n In fact, available models started selling out all over the place, when many people began to recognize for the first time just how much of a disease vector the smartphone could truly be. All of that in mind, the category is a pretty logical next step for the many accessory brands underneath the Zagg umbrella.\n  Today  Mophie and  InvisibleShield launched their takes on the category. The products are priced at $80 and $60, respectively, with the key differentiator here being the inclusion of a 10W wireless charging pad. Though that’s actually on the lid of the product. Meaning you can use it to charge the handset only once it’s out of the disinfecting bed.\n  Both sanitize phones up to 6.9 inches, using UV-C light, promising to kill up to 99.9% of bacteria. It’s certainly worth noting that, like PhoneSoap, these brands are not making claims that their products can kill the novel coronavirus. The jury is still out on their efficacy on that front. In fact, COVID-19 is conspicuously absent from the press material. And even with one of these, I’d still strongly recommend carrying around a pack of antibacterial wipes, if you can still find any.", "posttime": "2020-06-26 02:15:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "charging,手机", "title": "\n莫菲正在销售一款售价80美元的无线充电UV电话消毒剂", "title_en": "\n\t\t\t\tMophie is selling an $80 wireless-charging UV phone sanitizer\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/mophie-is-selling-an-80-wireless-charging-uv-phone-sanitizer/", "via": "", "real_tags": ["charging", "手机"]}, {"category": "", "categoryclass": "", "imagename": "02e3dd043802c045452e2d54a373f96c.jpg", "infoid": 1008245, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "视频聊天长期以来一直是智能屏幕的主要卖点之一，比如亚马逊回声秀(Amazon Echo Show)和谷歌(Google)的Nest Hub Max(记住，普通的Hub仍然没有摄像头)。但直到今天，后者只为用户提供一对一通话的选择。这在很大程度上是好的，但由于我们中的许多人发现自己与朋友和家人隔绝了，群聊已经成为一条生命线。\n这对Zoom这样的会议应用程序来说意味着大生意。这类服务曾经几乎是商务会议的专属领域，如今在休闲聊天中变得越来越受欢迎。毫无疑问，谷歌已经发现了潜力，今天宣布它终于通过Duo将群聊带到了Hub Max上。\n这一新功能允许最多32次聊天，并利用智能屏幕的自动取景功能(类似于Facebook竞争对手的显示屏中的功能)将主题保留在图片中。它还将出现在一些第三方谷歌智能屏幕上，包括LG、JBL和联想的智能屏幕。该功能要求用户通过连接的移动应用程序在Duo上创建群。一旦完成，就可以通过语音触发。\n这也有一个更专业的重点元素。这些公司长期以来一直在探索智能屏幕在工作场所的潜力，但现在这么多人在家里办公，就这些产品举行商务会议是有意义的。那些注册了G Suite with Google Assistant测试版计划的人将能够通过Google Meet参加商务会议。", "note_en": "Video chat has long been one of the chief selling points of smart screens like the Amazon Echo Show and Google’s Nest Hub Max (the regular Hub is still lacking a camera, mind). But until today, the latter only offered users the option for one-on-one calls. That’s all well and good for the most part, but as so many of us have found ourselves cut off from our friends and families, group chat has become something of a lifeline.\n  That’s meant big business for conferencing apps like Zoom. Once almost exclusively the domain of business meetings, these sorts of services have become increasingly popular for casual chats. Google has, no doubt, spotted potential, and today announced that it’s finally bringing group chats to the Hub Max through Duo.\n  The new feature allows for chats of up to 32 and utilizes the smart screen’s auto-framing capabilities (similar to those found in Facebook’s competing displays) to keep the subject in the picture. It also will be arriving on a number of third-party Google-ready smart screens, including those by LG, JBL and Lenovo. The feature requires the user to create a group on Duo through a connected mobile app. Once that’s done, it can be triggered via voice.\n There’s a more professionally focused element to this as well. These companies have long explored the potential of smart screens in the workplace, but now that home is the office for so many, it makes sense to offer business meetings on these products. Those enrolled in the G Suite with Google Assistant beta program will be able to join business meetings through Google Meet.", "posttime": "2020-06-26 02:14:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,呼叫,finally", "title": "\n谷歌终于将团队呼叫带到了Nest Hub Max", "title_en": "\n\t\t\t\tGoogle finally brings group calling to the Nest Hub Max\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/google-finally-brings-group-calling-to-the-nest-hub-max/", "via": "", "real_tags": ["google", "谷歌", "呼叫", "finally"]}, {"category": "", "categoryclass": "", "imagename": "b5fbbf543e7f9d0c0f4aafc90a3cc49e.jpg", "infoid": 1008244, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这似乎就是迈克·肯尼迪(Mike Kennedy)对考拉(Koala)所做的事情。考拉是一家年轻的公司，决心更新乏味的物业分时度假管理世界。在考拉，人们在一个分时度假胜地获得积分或以其他方式付费购买一个他们打算定期使用、交换或出租(或者三者兼而有之)的单元。\n这是一个巨大且不断增长的市场。根据安永(EY)去年发布的数据，2017年至2018年间，美国分时度假行业增长了近7%，销售额达到102亿美元。\n这是肯尼迪在纽约希尔顿俱乐部(Hilton Club)担任销售主管时第一手熟悉的市场，至少在2018年，希尔顿俱乐部是启动并运营的1580家分时度假胜地之一，代表着大约204,100套公寓，其中大多数都有两间卧室或更多。\n尽管有这样的增长，分时度假并不像酒店房间或Airbnb住宿那样容易跳入旅行者的脑海，其中蕴藏着机会。\n肯尼迪认为，部分问题是分时度假比应有的更难出租。例如，如果分时度假的所有者想要预订他或她购买的一周以外的一周，那么这个人必须通过过时的交换系统，比如RCI(Wynden拥有)或Interval International(Marriott拥有)。在希尔顿工作了10年的肯尼迪说，他看到他的一些客户随着时间的推移变得沮丧，因为他们无法更好地控制公寓的使用。", "note_en": "That’s what Mike Kennedy appears to be doing with  Koala, a young outfit determined to update the stodgy world of property time-share management, wherein people acquire points or otherwise pay for a unit at a timeshare resort that they intend to regularly use or swap or rent out (or all three).\n It’s a big and growing market. According to data published last year by EY, the U.S. timeshare industry grew nearly 7% between 2017 and 2018 to hit $10.2 billion in sales volume.\n It’s a market that Kennedy became acquainted with first-hand as a sales executive at the Hilton Club in New York, which, at least in 2018, was among 1,580 timeshare resorts up and running, representing approximately 204,100 units, most of them with two bedrooms or more.\n Despite this growth, timeshares don’t jump to travelers’ minds as readily as hotel rooms or Airbnb stays, and therein lies the opportunity.\n Part of the problem, as Kennedy see it, is that timeshares are harder to rent out than they should be. If a timeshare owner wants to reserve a week outside of the week that he or she purchased, for example, that person has to go through an antiquated exchange system like  RCI (owned by Wyndam) or  Interval International (owned by Marriott). Kennedy, who spent 10 years with Hilton, says he saw a number of his customers grow frustrated over time with their inability to better control their units’ usage.", "posttime": "2020-06-26 02:14:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "初创,newly,肯尼迪", "title": "\n即使在大流行期间，这家新投资的旅游初创公司仍在应对乏善可陈的分时度假市场。", "title_en": "\n\t\t\t\tEven amid the pandemic, this newly funded travel startup is tackling the stodgy timeshare market\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/even-amid-the-pandemic-this-newly-funded-travel-startup-is-tackling-the-stodgy-timeshare-market/", "via": "", "real_tags": ["初创", "newly", "肯尼迪"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008243, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "其中，它将标志着Boot Camp作为在Mac上安装和运行Windows的一种方式的结束。\n苹果公司已经证实，切换到自己的基于ARM的苹果硅片将标志着Boot Camp支持的结束。\n苹果将于今年晚些时候开始将其Mac电脑更换为基于ARM的处理器，但你将无法在它们的Boot Camp模式下运行Windows。微软只授权PC制造商在新硬件上预装ARM上的Windows10，而且该公司还没有向任何人提供该操作系统的副本，供任何人许可或免费安装。\n在给The Verge的一份声明中，微软表示，它只向原始设备制造商授权ARM上的Windows10，目前没有进一步的信息可供分享。\n然后，在约翰·格鲁伯(John Gruber)的WWDC脱口秀节目中，克雷格·费德里吉(Craig Federighi)证实，苹果不会在ARM Mac电脑上支持Boot Camp：\n我们不会直接启动备用操作系统。纯粹的虚拟化才是解决之道。这些虚拟机管理程序可能非常高效，因此是否需要直接引导并不是真正需要考虑的问题。\n这里唯一的问题是，苹果的Rosetta软件将被用来帮助翻译软件，使其与苹果的ARM Mac兼容，它不会像Parallels那样支持本地的虚拟化软件。这意味着，如果公司想要在苹果的下一代Mac电脑上使用ARM虚拟化软件，他们将不得不重新构建该软件。这是因为Rosetta不能使用虚拟化X86_64平台的虚拟机应用程序。\n到目前为止，未来几年唯一可行的解决方案可能是坚持使用基于英特尔的Mac。不过，苹果和微软在此期间总有可能达成某种协议。", "note_en": "Amongst other things, it will signal the end of Boot Camp as a way to install and run Windows on Mac.\n Apple has confirmed that switching to its own, ARM-based Apple silicon will signal the end of Boot Camp support.\n  Apple will start switching its Macs to its own ARM-based processors later this year, but you won&#39;t be able to run Windows in Boot Camp mode on them. Microsoft only licenses Windows 10 on ARM to PC makers to preinstall on new hardware, and the company hasn&#39;t made copies of the operating system available for anyone to license or freely install.\n In a statement to The Verge, Microsoft said it only licenses Windows 10 on ARM to OEMs, and that it had nothing further to share at this time.\n Then, on John Gruber&#39;s WWDC Talk Show, Craig Federighi confirmed that Apple would not support Boot Camp on ARM Macs:\n &#34;We&#39;re not direct booting an alternate operating system. Purely virtualization is the route. These hypervisors can be very efficient, so the need to direct boot shouldn&#39;t really be the concern.&#34;\n The only wrinkle here is that Apple&#39;s Rosetta software, which will be used to help translate software to make it compatible with Apple&#39;s ARM Macs will not support virtualization software like Parallels natively. That means companies will have to rebuild their virtualization software for ARM if they want it to be used on Apple&#39;s next generation of Macs. This is because Rosetta will not work with Virtual Machine apps that virtualize X86_64 platforms.\n  As of right now, the only viable solution over the next couple of years will likely be to stick to Intel-based Macs. There is always a chance that Apple and Microsoft might come to some sort of agreement in the meantime though.", "posttime": "2020-06-26 02:14:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,arm", "title": "苹果的ARM开关将是Boot Camp的终结", "title_en": "Apple's ARM Switch Will Be the End of Boot Camp", "transed": 1, "url": "https://www.imore.com/apples-arm-switch-will-be-end-boot-camp", "via": "", "real_tags": ["apple", "苹果", "arm"]}, {"category": "", "categoryclass": "", "imagename": "cc913af2e24e0d5d45110d4e8c7df8fb.png", "infoid": 1008242, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据2020年1月1日生效的加州一项法律，所有执法培训材料都必须在加州和平官员标准与培训委员会(POST)网站上“显眼地”公布。\n然而，如果你访问POST的开放数据中心，并试图下载与人脸识别技术或自动车牌阅读器(ALPR)相关的军官培训材料，或者加州和平军官协会(California Peace Offers Association)关于使用武力的课程，你将只会收到一个包含一句话的Word文档：\n这是非法的，也是不可接受的，EFF在今天提交的一封信中告诉邮报。根据加州新法律SB 978，POST必须在网上发布执法培训材料，才能根据加州公共记录法案向公众提供这些材料。受版权保护的材料根据加州公共记录法案向公众开放-事实上，EFF就在去年通过记录请求获得了POST的ALPR培训的完整、未经编辑的副本。\n创建波斯特的ALPR和人脸识别课程的公司就是销售这项技术的同一家公司：Vigilant Solutions(现在是摩托罗拉解决方案公司的子公司)。这家公司在与执法部门的合同中包括非出版条款，作为控制其知识产权的一种手段，已经有很长的历史了。但是，正如我们在信中解释的那样，SB978很清楚：版权法不是POST逃避其透明度义务的有效借口。\n同样糟糕的是，即使版权不是问题，波斯特也只发布了培训课程大纲，而不是培训材料本身。事实上，波斯特没有提供关于使用武力的培训材料，只分享了大纲。由于警察使用武力目前在全州和全国范围内是一个激烈辩论的问题，更令人担忧的是，邮报非法隐藏了这一材料。\nSB 978由加利福尼亚州参议员史蒂文·布拉德福德(Steven Bradford)发起，并得到EFF和一些民权团体的支持，目的是创造一个新的透明度和公共问责水平。\n当EFF去年获得ALPR培训时，我们发现Vigilant Solutions的培训严重过时，包含不正确的信息，并引发了人们的疑问，即演示文稿是否更符合公司的商业利益，而不是公众的利益。EFF在帖子中呼吁暂停该课程。不过，由於邮政局并没有印制现时的培训教材，市民仍不知道这些问题是否得到足够的解决。\n我们的民选官员可以通过监管警察的法律，监督机构可以审查执法政策，但如果培训材料保密，这就为监控技术制造商和私人组织提供了一个后门，在没有监督或问责的情况下影响警察的做法。\n如果加州邮政要制定和维护警察标准，那么它就不能无视法律。POST必须立即在线提供培训材料。", "note_en": "Under   a California law  that went into effect on January 1, 2020, all law enforcement training materials must be “conspicuously” published on the California Commission on Peace Officer Standards and Training (POST) website.\n However, if you visit   POST’s Open Data hub  and try to download the officer training materials relating to   face recognition  technology or   automated license plate readers  (ALPRs), or the California Peace Officers Association’s course on use of force, you will receive only a Word document with a single sentence:\n  This is unlawful, and unacceptable,  EFF told POST in a letter submitted today. Under the new California law, SB 978, POST must post law enforcement training materials online if the materials would be available to the public under the California Public Records Act. Copyrighted material is available to the public under the California Public Records Act—in fact, EFF obtained a   full, unredacted copy  of POST’s ALPR training through a records request just last year.\n The company that creates POST’s courses on ALPR and face recognition is the   same company that sells the technology : Vigilant Solutions (now a subsidiary of Motorola Solutions). This company has a   long history  of including   non-publication clauses  in its contracts with law enforcement as a means to control its intellectual property. But, as we explain in our letter, SB 978 is clear: copyright law is not a valid excuse for POST to evade its transparency obligations.\n And what’s just as bad is that even when copyright isn’t an issue, POST has only released training course outlines, and not the training materials themselves. Indeed, POST has made   no  training materials about the use of force available, sharing only the outlines. With police use of force currently a hotly debated issue throughout the state and nation, it is all the more concerning that POST is unlawfully hiding this material.\n SB 978 was sponsored by California State Senator Steven Bradford and   supported by EFF and a number of civil rights groups  in order to create a new level of transparency and public accountability.\n When EFF obtained the ALPR training last year, we found that Vigilant Solutions’ training was gravely outdated, included incorrect information, and raised questions about whether the presentation served the company’s commercial interests more than the public’s. EFF   called on POST to suspend the course . However, since POST has not published the current training materials, the public does not yet know whether these problems have been adequately addressed.\n Our elected officials can pass laws regulating the police, and watchdog bodies can review law enforcement policies, but if training materials are kept secret, it provides a back door for manufacturers of surveillance technology and private organizations to influence police practices without oversight or accountability.\n If California POST is going to set and uphold police standards, then it cannot ignore the law. POST must make its training materials available online immediately.", "posttime": "2020-06-26 02:13:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机构,agency,培训", "title": "加州机构阻止释放警察使用武力，监视训练", "title_en": "California Agency Blocks Release of Police Use of Force, Surveillance Training", "transed": 1, "url": "https://www.eff.org/deeplinks/2020/06/california-agency-blocks-release-police-use-force-and-surveillance-training", "via": "", "real_tags": ["机构", "agency", "培训"]}, {"category": "", "categoryclass": "", "imagename": "bc629a23011557d66a3933240f53ec4c.jpg", "infoid": 1008241, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "H​一直被认为是神奇的。它们长长的四肢颤抖的美丽，被认为是会走路、会呼吸的爱情药水。菲罗斯特拉特斯警告他的三世纪读者，那里有一些肆无忌惮的人，他们在野兔身上发现了一种“产生爱的某种力量，并试图通过魔术艺术的强迫来获得他们喜爱的对象”。普林尼建议说，吃野兔可以增加你的魅力：“人们认为，如果你吃了野兔，你的身体就会获得9天的性吸引力，这是一种粗俗的迷信，然而，这种迷信肯定有一定的道理，因为人们对它的信仰是如此普遍。”…在给他的Gellia的信中相当尖刻地写道：“每当你送我一只兔子，Gellia，你就对我说，”你将美丽七天。“。亲爱的，如果你说的是真的，格利亚，你从来没有吃过一只野兔。兔子是爱情女神阿佛洛狄特的圣物，爱神可以在成群的希腊花瓶上找到，他们绕着圈子追逐着兔子，或者把兔子抱在怀里。\n这种认为野兔属于性和欲望竞技场的感觉，部分源于对其惊人繁殖力的信念。亚里士多德在他的“历史动物”中提出，野兔可以怀孕两次：它们“在任何季节繁殖和生育，在怀孕期间超胎(即再次怀孕)”。亚里士多德还提出，鳗鱼是从泥浆中自发产生的，但实际上他对野兔的看法是正确的：它们可以在已经怀孕的情况下怀孕。雄性野兔可以在雌性怀孕后期使其受精：胚胎在输卵管中等待，直到第一次怀孕，然后一旦子宫释放，就会开始发育。节省的时间意味着它们在一个繁殖季节可以多产大约30%的后代。长期以来，人们一直认为野兔部分可以起到避孕药的作用。埃提乌斯在君士坦丁堡的宫廷中写道，建议女性“取下鸡尾草(一种通常被称为恶臭的茄子的植物)的种子，将母驴的奶、一点桃金娘和一颗黑常春藤…的浆果混合在一起。裹上野兔皮后再穿。(正是这名男子建议将儿童乳牙插入女性的肛门内，作为另一种避孕方式，我深切希望没有人采纳这一建议。)。\n兔子的部分魔力是相信它是雌雄同体的，是一个随意的开关。多纳特斯写道：“摩多·马斯，摩多·菲米娜”(有时是男性，有时是女性)。正因为如此，在古代，它成了表达同性恋爱情的一种方式：在特伦斯的一部喜剧中，大胆的年轻人尤努库斯被告知：“Quid Ais，Inquam，Homo Imudens？”Lepus tute es，et Pulpamentum quariis.。“”你在说什么，厚颜无耻的家伙？你当然是一只野兔，你在寻找肉皮。“。一个500年的陶罐展示了一名男子将一只活野兔献给一名年轻男子。这是一种能召唤爱情的东西，既有异性恋的，也有同性恋的；放在你脚下的东西，以其精美的可爱，要么会哄骗你，要么会魔术般地打消你的疑虑。\n有些野兔也是巫婆，或者是仙女。伊丽莎白·古奇在1946年写了一本令人惊叹的儿童读物“小白马”，这本书是在战争结束时写的，书中陶醉于糖饼干和精致的美人，而野兔是所有美人中最漂亮的之一。一个男孩解释说，它们不像兔子：“现在，这完全是另一回事了。”野兔不是宠物，而是人。野兔聪明、勇敢、有爱心，它们身上有仙女的血统。“。凯尔特人的一个传说是，战士兼诗人奥辛狩猎一只野兔，他的腿受伤了。他顺着它走进了茂密的荆棘丛，发现有一扇门通向地面，走进了一个大厅，一个可爱的女人坐在那里，腿上的伤口在流血。这个故事类似于1663年对一位名叫朱利安·考克斯(Julian Cox)的老妇人进行的真实巫术审判。庭审中的一名证人说：\n一个猎人发誓他带着一群猎犬出去猎兔，在离朱利安·考克斯家不远的地方，他终于抓到了一只野兔。狗非常近地追赶她…。直到最后，猎人发现野兔快死了，就朝一个大灌木丛跑去，跑到灌木丛的另一边去把她抱起来，使她免受狗的伤害。但他一碰到她，就发现那是朱利安·考克斯·…。他认识她，吓得头发都竖起来了，但他还是对她说，问她是怎么回事，但她上气不接下气，不能回答他…。猎人和他的狗很快就悲哀地惊恐地回家了。\n所以它们既是美丽的，也是危险的。1875年的一本关于民间传说的书说，野兔的活动与灾难密切相关--有人建议，传给野兔时，你应该背诵：“野兔在前，麻烦在后：改变你，十字架，释放我。”中古英语的一首诗给出了兔子的77个名字，如果你路过一个名字来驱除厄运，你应该列出这些名字(很少是恭维的)。谢默斯·希恩\n他们也被认为是神圣的。远东、欧洲和英国各地的教堂、寺庙和犹太教堂都出现了“三只兔子”的主题：三只兔子围成一圈跑，耳朵缠绕在一起。长期以来，野兔在她的肖像中一直与处女配对(我们反常地认为它们既是性的缩影，也是处女的缩影：有一段时间人们认为它们非常有生育能力，可以在没有配偶的情况下繁殖)。他们的运行机构，架设在教堂的屋顶上，呼唤着神圣的三位一体：三分之一，三合一，不断运动的原动机。\n如果美貌足以值得爱--我们在历史上就是这么认为的--那么我们应该爱野兔胜过几乎任何其他生物。你越靠近，它们就变得越漂亮：在这32个物种中，有些是红灰色的，比如缅甸野兔，是银色的；另一些，比如西藏羊毛，是刚割下的稻草的颜色。印度野兔的脖子后面有一块黑色的带子，就像一条发带。英国北部的山野兔在冬天变得赤裸裸的白色-真正的白色，只持续一个季节，而不是大多数习惯性的白色生物的肮脏的白色。它们的腿有着奥运选手的宏伟气势，它们的耳朵，黑色的尖端，排列着粉色天鹅绒，在光线下半透明，使兔子的耳朵相形见绌。在飞行中看到，他们的耳朵是横跨战场的横幅。“森林中的猫，”希尼称他们为“森林中的猫”。“卷心菜里的雄鹿。”如果这个世界上有魔力，那一定是属于他们的。所以，如果你正在读这篇文章，我的爱人，我不需要鲜花或珠宝。请给我拿一只野兔来。", "note_en": "H ​ have always been thought magical. In their long-limbed quivering beauty, they were believed to be walking, breathing love potions. Philostratus warned his third-century readers that there were unscrupulous men out there who had found in the hare ‘a certain power to produce love and try to secure the objects of their affection by the compulsion of magic art’. Pliny suggested eating hares would increase your glamour: ‘The people think that if you eat a hare your body acquires sexual attractiveness for nine days, a vulgar superstition, which, however, must have some truth in it since the belief in it is so widespread.’ Martial writes to his Gellia, rather acidly: ‘Whenever you send me a hare, Gellia, you say to me, “You will be beautiful for seven days” … my love, if you mean what you say,  you, Gellia, have never had a hare to eat.’ The hare was sacred to Aphrodite, goddess of love, and Eros can be found on droves of Greek vases, pursuing the hare in circles, or cradling one in his arms.\n  This sense of the hare as belonging to the arena of sex and desire stems in part from a belief in its astonishing fertility. Aristotle suggested in his  Historia Animalium that the hare could get pregnant twice: they ‘breed and bear at all seasons,  superfoetate (i.e. conceive again) during pregnancy’. Aristotle also suggested, it’s true, that eels spontaneously generate from the mud, but in fact he was right about hares: they can get pregnant while already pregnant. A male hare can fertilise a female during the later part of her pregnancy: the embryos will begin to develop while they wait in the oviduct until the delivery of the first pregnancy, and then, as soon as the uterus is freed up, move in. The time saved means they’re able to deliver around 30 per cent more offspring during a breeding season. It was long thought that hare parts could act as contraceptives. Aetius, writing in the imperial court in Constantinople, suggested that women ‘take seeds of henbane [a plant known more commonly as stinking nightshade], mix the milk of a she ass, a little myrtle and a berry of black ivy … to be worn after having been wrapped in the skin of a hare.’ (This was the same man who advised inserting children’s milk teeth inside a woman’s anus as an alternative form of contraception, advice I profoundly hope nobody took.)\n Part of the hare’s magic was in the belief that it was hermaphrodite, a switcher-at-will. It was, Donatus writes: ‘modo mas, modo femina’ (sometimes male, sometimes female). Because of this, it became in antiquity a way to express homosexual love: in one of Terence’s comedies,  Eunuchus, a bold young man, is told: ‘Quid ais, inquam, homo impudens? Lepus tute es, et pulpamentum quaeris.’ ‘What are you saying, impudent creature? You’re surely a hare and you seek flesh.’ A clay pot from 500   shows a man offering a live hare to a younger man. It was a thing to conjure love, both heterosexual and homosexual; a thing which, laid at your feet in its fine-featured loveliness, would either coax or magic away your doubts.\n Some hares were also witches, or fairy-folk. Elizabeth Goudge’s astonishing children’s book of 1946,  The Little White Horse, written just as the war ended, revels in sugar biscuits and exquisite beauties, and the hare is one the finest beauties of all. They are not, a boy explains, like rabbits: ‘A hare, now, that is a different thing altogether. A hare is not a pet but a person. Hares are clever and brave and loving, and they have fairy blood in them.’ One Celtic legend has the warrior-poet Oisín hunting a hare, which he injures in the leg. He follows it into thick brambles and, finding a door opening down into the ground, comes into a large hall, where a lovely woman sits, bleeding from a leg wound. The story is similar to the real-life trial for witchcraft in 1663 of an old woman called Julian Cox. A witness at the trial stated:\n A huntsman swore that he went out with a pack of hounds to hunt a hare, and not far from Julian Cox’s house he at last started a hare. The dogs hunted her very close … till at last the huntsman perceiving the hare almost spent and making towards a great bush, he ran on the other side of the bush to take her up and preserve her from the dogs; but as soon as he laid hands on her it proved to be Julian Cox … He knowing her, was so affrighted that his hair on his head stood on end; and yet he spake to her and ask’d her what brought her there; but she was so far out of breath that she could not make him any answer … the huntsman and his dogs went home presently sadly affrighted.\n So they were dangerous, as well as beautiful. A book on folklore from 1875 told that the hare moved in close association with calamity – it was recommended that, passing a hare, you should recite: ‘Hare before, Trouble behind: Change ye, Cross, and free me.’ A Middle English poem gives the hare’s 77 names, which you should list if you pass one to ward off ill luck (few are complimentary). Seamus Heaney’s translation has, among others:\n The creep-along, the sitter-still, the pintail, the ring-the-hill, the sudden start, the shake-the-heart, ​​​​the belly-white, the lambs-in-flight. The gobshite, the gum-sucker, the scare-the-man, the faith-breaker, the snuff-the-ground, the baldy skull, (his chief name is scoundrel).\n The hare’s actual name,  lepus, came, the ancient Roman scholars said, from Latin  levipes, ‘light foot’, and my God they deserve it. Brown hares can run at fifty miles an hour and jump ten feet: five times their own length in a single bound. To see a hare outrun a fox, zig-zagging to disrupt its momentum, is to know you are in the presence of the marvellous. Leverets are born with eyes open and fur on, ready to sprint: they live largely alone, do not make burrows, but rest in shallow indentations in the ground, never halting, always moving. ‘To kiss the hare’s foot’ is to be too late for dinner, according to  Brewer’s Dictionary: ‘The hare has run away, and you are only in time to “kiss” the print of his foot.’ But they are not fast enough, of course, to outrun us. The number of hares in Britain has declined by 80 per cent in the last hundred years, in part because our relentless destruction of hedgerows killed their cover: between 1985 and 1997 alone, 184,000 km of the 640,000 km of hedgerows that ran through England and Wales were torn out and burned. And hares are the only game you can legally hunt all year round. We hunt them even in their mating season, when the females are boxing at would-be suitors in the fields, and shoot them in their thousands, as many as 300,000 a year. We might remind one another that we are slaughtering the Easter bunny. He was a hare long before he was a rabbit; the hare was sacred to Eostre, the Saxon goddess of spring – no rabidly cute bundle of fluff.\n They have been thought holy, too. The ‘three hare’ motif appears in churches, temples and synagogues across the Far East and Europe, and throughout Britain: three hares running in a circle, their ears entwined. Hares have long been paired with the Virgin in her portraits (we have, perversely, considered them the epitome of both sex and virginity: it was for a while thought that they were so fertile they could reproduce without a mate). Their running bodies, set up on the roof bosses of churches, call up the Holy Trinity: one in three, three in one, prime mover in constant motion.\n If beauty is enough to merit love – and we have historically reckoned that it is – then we should love the hare more than almost any other creature. The closer you get, the more beautiful they become: of the 32 species, some, such as the Burmese hare, are reddish-grey shading to silver; others, like the Tibetan Woolly, the colour of just-cut straw. The Indian Hare wears a patch of black at the back of its neck like a hair ribbon. The mountain hares in the north of Britain turn stark white in winter – real white, which only lasts a season, not the grubby white of most habitually white creatures. Their legs have the grandeur of Olympians, and their ears, black-tipped, lined in pink velvet and semi-translucent in the light, dwarf those of a rabbit. Seen in flight, their ears are banners streaming across a battleground. ‘The cat of the wood,’ Heaney calls them. ‘The stag of the cabbages.’ If there is magic in this world, some part of it lies with them. So if you are reading this, my love, I don’t need flowers, or jewels. Please, bring me a hare.", "posttime": "2020-06-26 02:12:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "想想,hare,野兔", "title": "想想野兔吧", "title_en": "Consider the Hare", "transed": 1, "url": "https://www.lrb.co.uk/the-paper/v42/n13/katherine-rundell/consider-the-hare", "via": "", "real_tags": ["想想", "hare", "野兔"]}, {"category": "", "categoryclass": "", "imagename": "4e999e3309589cb91aed826d33ed39c7.png", "infoid": 1008240, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通常，当人们考虑建立和启动一家初创公司时，他们会提前几周进行计划。在我做软件咨询的经验中，我见过并参与过一些项目，创始人需要2-3个月的时间才能推出他们产品的第一个版本。在一个可能不会奏效的项目上投入了太多的时间和精力。\n问题是，大多数人对推出最低限度可行的产品感到不舒服。创始人通常都是富有创造力的人，他们喜欢探索和潜心于“如果不是很酷”的问题上。这个习惯可能会导致不断增加功能，甚至在你的产品的第一个版本发布之前就是如此。\n完美主义往往会阻碍执行，我已经多次落入这个陷阱。我的第一个产品(SideQuest)花了我四个月的时间来构建和发布。坦率地说，继续开发未经测试的产品是傲慢的。原因如下：它假定您正在制作的产品对您的客户至关重要。它假设您知道什么对您的用户最好。你没有。\n没有创始人知道，直到他们启动了自己的初创公司，并从人们那里获得了反馈。你的第一个版本可能会很糟糕；它甚至可能会偏离目标，或者与市场完全无关。你需要尽快从你的目标市场得到任何积极和消极的信号。\n这就是我们试图用MeetButter做的。我们团队中的每个人都有过浪费时间、跑道、精力和情感建设产品或功能的经历，这些产品或功能在更大的图景中是无关紧要的。\n下面是我们如何在三周内成功制造并发货MeetButter的故事。\nMeetButter的第一个火花是一条Slake帖子，讨论教师和教育工作者从线下课堂过渡到在线课堂所面临的痛苦。我们发现，在线视频会议存在一个非常人性化的问题--他们一次只允许将焦点放在一个发言者身上。打断演讲者是很尴尬的，这导致一些与会者不愿参与。随着更多的轶事和来自我们朋友和家人的反馈，讨论的主题越来越多。\n确定问题是第一步。找出面临同样问题的人群并从他们那里收集反馈是至关重要的。\n我们决定进行这次异步讨论，并组织一次同步的头脑风暴会议。在这次特别会议期间，我们讨论了我们已经确定并有兴趣解决的三个重要问题。名单上有前面提到的“视频会议”--它最终变成了MeetButter。\n团队中的每个人都提出了一些要点，我们发现这些是我们每个人在进行在线视频会议时都面临的问题：\n很难表示有兴趣发言，回复当前的对话，或加入讨论而不觉得打断了当前的演讲者。\n在一个演讲者和另一个演讲者之间平稳地转换是不可能的。有时，句子中间的停顿会遇到几个发言者试图同时进入对话。再加上滞后，这可能会变得相当尴尬。\n当您的整个团队被限制在屏幕上的小窗口中，并且只能从肩膀以上看到社交提示时，社交提示几乎是不存在的。\n这次集思广益的目的不是为了缩小解决方案的范围，而是要深入到问题中去。\n集思广益后，我们讨论了一些如何解决这个问题的想法。解决方案可能看起来相当模糊，通常情况下，会出现几个关键字被抛来抛去的情况。对我们来说，它是“排队”、“覆盖”和“投票”。值得注意的是，人们经常以不同的方式看待关键字，在他们的头脑中形成非常不同的概念。\n一张图片胜过千言万语。对于任何创始人来说，素描都是一项必备的技能，因为它是以低信噪比传达想法的最佳媒介。人们经常误解你的话。如果你不擅长画画，最好学习如何使用像Figma这样的免费工具以数字方式绘制出一个原型。我甚至曾经用谷歌幻灯片为一个客户做过一个低保真的原型！有时，我甚至截图其他应用程序的某些部分，并将它们组合成一个图像的科学怪人-任何有助于弥合你的愿景和他们的想象力之间的鸿沟的事情。\n根据团队的反馈和想法，这是我使用Figma构建的MeetButter的第一个草图。在我们的团队Slake上分享了它之后，我们召开了一次会议，讨论下一步的工作。我们决定去掉一些功能，而将重点放在排队功能上，因为我们能够在日常站立电话期间对其进行内部测试。\n关于我们是如何建造原型的，我不会透露太多细节。这一步骤对于每个团队来说都是不同的：一些团队将选择使用AirTable和Google Forms等工具进行无代码原型；一些团队将选择使用Figma或Zeplin进行“模拟”原型；一些团队将选择使用代码构建功能齐全但最小的原型。我们决定采用后者，因为这是我快速编写代码的最快方法。\n如果核心假设成立的话。在这种情况下，我们想测试允许参与者排队是否会帮助会议更好地流畅。\n如果我们能造出技术。创始人往往低估了创建他们愿景所需的技术工作。构建原型允许您进行小型可行性测试。\n一旦您有了原型，您需要将其放在一些测试用户面前。寻找测试用户可能很棘手。理想情况下，测试用户应该来自您的团队；我们的MeetButter就是这种情况。这意味着我们正在为自己制造产品，我们是我们目标市场的一部分。构建一个产品来解决您的问题有一些明显的好处：\n如果你正在构建一个不适合你自己的产品，我建议在你的网络中至少找十个可以成为你忠实测试用户的人。\nMeetButter也非常容易集成到我们的日常工作流程中。我们所要做的就是在我们的常规站立电话中打开网络应用程序。建立某种反馈回路是必不可少的。会议一结束，我就给与会者发了一份谷歌表格，收集初步反馈--最好趁热打铁。我们还有几个Slake主题讨论在我们继续测试时出现的其他想法。\n在测试了我们的原型之后，我们收集了反馈，然后回到了绘图板上。在这一点上，你必须用你的原型做出一个明确的决定--你是继续重申，还是扼杀这个项目？我们发现我们的原型工作得很好，尽管我们持怀疑态度，但我们有一种感觉，我们正在做一些事情。我们开始在每次会议中使用原型，所以很难否认我们的团队在内部发现它很有用。\n我们重复了几次设计、重申和接收反馈的过程。我们的测试团队从内部的五人团队发展到社交圈里的朋友。\n经过几轮迭代，我们的原型慢慢地摆脱了它的碎片，演变成了类似于产品的东西。一旦我们耗尽了现有的网络，我们就知道下一步是在内部测试用户之外推出MeetButter。\n我开始为能够成长为可伸缩项目的代码库奠定基础。我们的技术堆栈最终如下所示：\n后端-混合使用Firebase和由Apollo GraphQL和Sequelize提供支持的Express服务器。\n首先，我们很幸运拥有快速执行的经验和技能。我们没有遇到太多的技术限制，因为我们每个人都填补了所需的重要角色。这些角色包括设计/UI用户体验、软件开发和营销/网络。\n其次，我们试图遵循创意生成的最佳实践。促成MeetButter的头脑风暴并不是我们第一次在一起。这可能是我们在凤凰计划作为一个团队聚在一起后的第五次头脑风暴会议。通过大量的实践，我们能够建立一套最佳实践来进行富有成效的集思广益会议、获得反馈和重申。\n第三，我们接近了我们的目标市场，这使得我们可以快速测试，并慢慢扩大我们的测试用户群。\n第四，我们把完美抛到了窗外。我们的原型在100%的情况下都不能工作，有一大堆错误，并且是用最小的UI构建的。尽管如此，我们仍然每天都使用它进行视频通话。它对于测试功能已经足够好了，这是您应该针对原型所做的基本工作。\n这就是我们如何在短短三周内构建和交付MeetButter的故事！\nMeetButter是一款帮助你协调会议的应用程序，比如日常站立会议，或者八人以上的重要电话会议。我们刚刚推出了由JITSI支持的视频功能！在MeetBut.io尝试一下，让我知道你的真实想法。\n和我分享你的“从零到原型”的故事吧！我很乐意听听你的创业之旅！", "note_en": "Usually, when people think about building and launching a startup, they plan it out a few weeks in advance. In my experience doing software consulting, I’ve seen and worked on some projects where the founders take 2 - 3 months to launch the first version of their product. That’s too much time and effort sunk into a project that may not work.\n  The problem is that most people are not comfortable with launching a minimum viable product. Founders are often creative people who love to explore and dive into “wouldn’t it be cool if”s. This habit can result in a continuous loop of adding features, even before the first version of your product is released.\n Perfectionism can often get in the way of execution, and I’ve fallen for this trap many times. My first product (SideQuest) took me four months to build and launch. To continue developing an untested product is, to put it bluntly, arrogant. Here’s why: it assumes that what you are making is vital for your customer. It assumes that you know what’s best for your user. You don’t.\n  No founder knows until they launch their startup and get feedback from people. Your first version is likely going to suck; it might even miss the mark or be utterly irrelevant to the market. You need to get any negative and positive signals from your target market as soon as possible.\n That was what we tried to do with MeetButter. Everyone on our team has had experience getting burnt by wasting time, runway, effort, and emotion building products or features that were inconsequential in the larger picture.\n Here’s the story of how we managed to build and ship MeetButter in three weeks.\n   The first spark for MeetButter was a Slack thread discussing the pains teachers and educators were dealing with transitioning their classrooms from offline to online. We found that there was a very human problem with online video conferencing - they only allowed the focus to one speaker at a time. It was awkward interrupting the speaker, and this caused some participants to feel reluctant to engage. The discussion thread grew, with more anecdotes and feedback from our friends and family.\n Identifying the problem is the first step. It’s crucial to figure out the groups of people that are facing the same issues and gathering feedback from them.\n  We decided to take this asynchronous discussion and organize a synchronous brainstorm session. During this particular session, we discussed three significant problems that we had identified and were interested in solving. On the list was the aforementioned “video conferencing” - which eventually became MeetButter.\n  Some significant points were brought up by everyone on the team, and we found that these were problems that each one of us had faced while doing online video conferencing:\n It’s difficult to indicate an interest in speaking, reply to the current conversation, or add to the discussion without feeling like you’re interrupting the current speaker.\n It’s impossible to transition smoothly between one speaker to the next. Sometimes mid-sentence pauses are met with several speakers trying to enter into the conversation at once. Combined with lag, this can get quite awkward.\n   Social cues are almost non-existent when your entire team gets boxed into tiny windows on-screen and are only visible from their shoulder up.\n The purpose of this brainstorm was not to narrow down into solutions, but it was to dive deep into the problems.\n   After the brainstorm session, we discussed some ideas on how to tackle the problem. Solutions can seem pretty vague, and usually, what happens is that several keywords get thrown around. For us, it was “queue,” “overlay,” and “polls.” It’s good to note that people often visualize keywords differently and form very different concepts in their heads.\n A picture is worth a thousand words. Sketching is an essential skill to learn for any founder, as it’s the best medium to transfer your ideas with a low signal-noise ratio. People often misunderstand your words. If you’re not good at drawing, it’s good to learn how to sketch out a prototype digitally using free tools like Figma. I have even used Google Slides to build a low fidelity prototype for a client once! Sometimes I even screenshot parts of other apps and combine them into a Frankenstein of an image - anything to help bridge the gap between your vision and their imagination.\n  Based on the feedback and ideas from the team, this was the very first sketch for MeetButter that I built using Figma. After sharing it on our team Slack, we held a meeting to discuss the steps moving forward. We decided to cut out some features and instead focus on the queuing functionality as we were able to test it internally during our daily standup calls.\n  I won’t go into too much detail about how we built the prototype. This step will be different for every team: some teams will opt to do a no-code prototype using tools like AirTable and Google Forms; some will choose to do a “simulated” prototype using Figma or Zeplin; some will opt to build a fully functioning albeit minimal prototype using code. We decided to do the latter as it was the fastest for me to code something quickly.\n   If the core hypothesis works. In this case, we wanted to test if allowing participants to queue would help meetings flow better.\n If we could build the tech. Founders often underestimate the technical work that goes into creating their vision. Building a prototype allows you to do a mini feasibility test.\n    Once you have your prototype, you need to get it in front of some test users. Finding test users can be tricky. Ideally, the test users should be from within your team; this was the case for us with MeetButter. It meant that we were building a product for ourselves, that we were part of our target market. Building a product to solve your problems has some apparent benefits:\n  If you are building a product that’s not for yourself, I’d suggest finding at least ten people within your networks who can become your loyal test users.\n MeetButter was also super easy to integrate into our daily workflow. All we had to do was open up the web app during our regular standup calls. It’s essential to build some sort of feedback loop. I sent a Google Form to the participants of the meeting to gather initial feedback as soon as the meeting ended - it’s best to strike while the iron is hot. We also had several Slack threads discussing additional ideas that came up as we continued testing.\n  After testing our prototype, we collected the feedback and went back to the drawing board. At this point, you have to make a clear decision with your prototype - do you continue to reiterate, or do you kill the project? We found that our prototype worked quite well, and although we were skeptical, there was a sense that we were onto something. We started using the prototype in every meeting, so it was hard to deny that our team internally found it useful.\n  We repeated the process of designing, reiterating, and receiving feedback several times. Our testing group grew from our internal team of five people out to our friends within our social circles.\n  After a few rounds of iterations, our prototype slowly shed its pieces and morphed into something resembling a product. As soon as we exhausted our immediate networks, we knew that the next step was to launch MeetButter beyond internal test users.\n I began to lay the groundwork for a codebase that could grow into a scalable project. Our tech stack ended up being the following:\n Backend - A mix of Firebase and an Express server that’s powered by Apollo GraphQL and Sequelize\n    Firstly, we were fortunate to have had the experience and the skills to execute quickly. We didn’t run into many technical limitations, as each one of us had filled the significant roles that were needed. These roles include design/UI UX, software development, and marketing/networking.\n Secondly, we tried to follow the best practices for idea generation. The brainstorm that led to MeetButter wasn’t the first one that we had together. It was probably our fifth brainstorm session after getting together as a team as Project Phoenix. With a lot of practice, we were able to build a set of best practices to have productive brainstorm sessions, get feedback, and reiterate.\n Thirdly, we were close to our target market, which allowed us to test fast and slowly expand our test userbase.\n Fourth, we threw perfection out the window. Our prototype didn’t work 100% of the time, had a bunch of bugs, and built with the bare minimum UI. Despite this, we still used it every single day for our video calls. It was good enough for testing the functionality, which is the base level of effort you should aim at for your prototype.\n So that’s the story of how we built and shipped MeetButter in only three weeks!\n   MeetButter is an app that helps you with coordinating meetings, such as daily standups, or significant conference calls of more than eight people. We just launched video functionality powered by Jitsi! Try it out at  meetbutter.io and let me know what you  really think.\n Share me your “zero to prototype” stories! I&#39;d love to hear your startup journey!", "posttime": "2020-06-26 02:11:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推出,mvp,产品", "title": "我们在3周内推出了我们的MVP(+我们学到的小贴士)", "title_en": "We launched our MVP in 3 weeks (+ tips that we learnt)", "transed": 1, "url": "https://adamthewan.com/blog/meetbutter/how-we-built-meetbutter-three-weeks/", "via": "", "real_tags": ["推出", "mvp", "产品"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008238, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是关于将泛文化思想应用到计算机世界的随机想法的集合。\nKentBeck短暂的永久编程思想)，但这些主要集中在用园艺中的一些想法来加强软件工程实践。我对文化和生态的永恒性更感兴趣。也就是说，如何让计算机在人类文明中有一个有意义和可持续的位置，而这个文明在行星生物圈中有一个有意义和可持续的位置。在过去几百年的人类文明中，人工生产的能源消耗急剧增加。在最重要的故事中，这通常等同于进步。\n在计算机世界里，这种现象会成倍增加：进步促进了越来越高的数据存储密度和数字逻辑，从而戏剧性地爆炸了计算资源的可用性。然而，这种丰富也造成了同样的爆炸式的浪费，这表现在一些事情上，比如令人印象深刻的荒谬的硬件要求，即使是非常琐碎的任务也需要这样的东西。\n。他们非但没有放大用户的智力，反而放大了他们的愚蠢。它们非但没有减少物质世界的资源需求，反而成了问题的主要部分。它们非但没有让世界变得更容易理解，反而增加了它的不可理解性。他们甚至经常设法变得更慢，尽管他们变得更快了。无论是在计算机领域还是在农业领域，一个主要问题都是通过提高可控性和资源利用率来解决问题。Permacultures采取另一种方式，提倡让自然来完成这项工作的方法，从而最大限度地减少对人工能源投入的依赖。地方性和分散性也是这一思想的重要主题。\n泛文化哲学之所以(对我)特别有吸引力，是因为它并不提倡时光倒流，尽管它提倡戏剧性地减少人工能源的使用。取而代之的是，它相信人类的聪明才智，能够找到巧妙的办法，将问题转化为解决方案，将竞争转化为合作，将浪费转化为资源。与我欣赏的电脑黑客的创造性思维非常相似。\n生态系统中智能生命的存在可以通过它的强化效应来证明是合理的。理想情况下，人类可以让生态系统变得更灵活、更有弹性，因为他们有能力跨越非智能的自然过程难以实现或不可能实现的跨越。计算机在人类文明中的存在可以通过它们增强这一潜力的能力来证明是合理的。\n永久文化强调资源敏感性。计算机主要使用电力，因此对他们来说，对资源敏感主要意味着1)适应能源条件的变化，2)明智地利用可用能源。如今的计算机，即使是移动计算机，在这方面也出人意料地糟糕。这在一定程度上要归功于他们遗留下来的计算工厂，这些工厂不断地保证他们需要的所有资源。\n只有在产生大量剩余能量或需要电到热转换时，才会进行密集的非紧急计算(例如长时间的机器学习批次)。这要求计算机了解周围能源系统的状态。\n在能耗较低的时候，硬件和软件都倾向于缩减规模：后台进程将冻结，用户界面将变得更加简陋，时钟频率将降低，不需要的处理器和内存库将关闭电源。在这个时候，人们宁愿做别的事情，也不愿与电脑互动。\n是化学电池的潜在替代品。它们具有相似的能量密度(MJ/kg)，但不需要稀土材料，可以使用几十年或几个世纪，而不是仅仅几年。IC的制造需要大量的能量、高度精细的机械设备和有毒物质。由于这种牺牲，由此产生的微芯片应该像宝石或稀有的异国香料一样被珍藏起来。它们的有效使用寿命将最大化，除非它们完全不可用，否则它们永远不会减少到它们的原材料。\n损坏的设备将会被修复。如果社区需要一种不存在的设备，它最好是用现有的已经淘汰的部件来建造。芯片的设计应该是开放的和灵活的，这样它们就可以被重新利用，即使是为了它们从未打算过的目的。\n复杂的芯片应该有足够的冗余和旁路机制，以使它们即使在一些内部部件磨损后也能继续工作。(例如，在多核CPU中，许多部分功能的内核可以组合成一个功能单一的内核。)。\n芯片可以工作，但其实际使用是不合理的，可以找到艺术和其他心理上有意义的用途。它们也可能被储存起来，直到再次需要它们(特别是如果制造质量和储存条件允许数十年或数百年的保质期)。\n使用可用的资源。如果垃圾填埋场里堆满了邪恶的东西，那么即使是做坏事的芯片也是值得考虑的。破解他们的DRM锁，反向工程他们的黑匣子，解构他们的哲学。它甚至有可能重新利用像比特币挖掘ASIC这样的东西来做一些艺术上有趣的甚至有用的事情。\n最小化的片上功能尺寸使得用更少的能量进行更多的计算成为可能，但这通常也意味着增加的脆弱性和更短的使用寿命。因此，最密集的芯片应该主要用于计算越多实际上产生越多的目的。(例如，在娱乐用途中，大量使用资源只不过是一种颓废的审美偏好。)。\n应该积极研究。在未来的某个时候，活细胞或许能够在某些任务中取代微芯片。一旦可以使用完全清洁的生产微芯片等价物的方法，对垃圾拜物教的需求可能会减少。\n只要有明亮的外部光线，显示器就应该能够利用它，而不是用自己的背光与之竞争。(请参阅：TransflectiveLCD。\n个人拥有的计算机主要是为那些致力于这项技术并因此花费大量时间在这项技术上的人准备的。大多数其他人会对共享硬件感到非常满意，即使文化和社会接受计算机胜过其他任何东西，要求每个人都拥有一台计算机也是矫枉过正的。\n在许多永久文化原则清单中，第一项是观察和互动。我认为这主要是指与自然系统的双向合作关系：你不应该期望你的花园像军队一样容易自上而下地控制，而是接受它的扭曲并适应它。观察是计算机可以增强的最重要的人类技能之一，人类难以或不可能观察到的东西可以通过各种计算过程提高人类的认知能力。收集到的信息可以可视化，强调细微的变化和模式偏差，加快缓慢的过程，计算预测。在比尔·莫里森的剑中，信息是关键的潜在资源。只有在获得并付诸行动时，它才会成为一种资源。&#34；\n计算机系统也应该使它们自己的内部工作尽可能地可见。如果计算机产生视觉输出，它就会使用它的一小部分资源来可视化它自己的内观和外观。例如，一台与无线电波通信的计算机可以将自己对周围无线电景观的看法可视化。\n当前以消费者为导向的计算系统经常不遗余力地实际阻止用户知道正在发生的事情。Evenerror信息已经变得不时髦了；许多网站和应用程序只是假装一切都很好，即使事实并非如此。这种极端的不可察觉是计算机用户对技术疏远的一个主要来源。\n意在随意和被动观察的可视化将是愉快和宁静的，同时使人更容易看到大的画面和注意到小的变化。在设计可视化工具时，利用人类与生俱来的观察自然环境的倾向可能是一个好主意。然而，当用户想要更仔细地观察某件事时，只要观察者喜欢这样，展示可以是多么华丽、技术性和非自然的，没有限制。\n传统的计算机黑客行为往往非常猖獗。对目标系统的全面理解和控制是很有价值的。改变一个系统的行为通常本身就是一个目的。系统被推向一些预先定义的目标。优化往往集中在单个可测量的参数上，找出一个系统的绝对极限比找出它的个别优势或本质更重要。\n相比之下，黑客接受超出理性控制和理解的方面。理性得到直觉的支持。与系统的关系更多的是双向的，强调实验和观察。与可测量的规格相比，源于系统特定特性的个性更受关注，了解何时入侵以及何时只观察而不黑客也越来越重要。\n阴阳黑客之间的区别类似于永久养殖和工厂化农业之间的区别。在后者中，一块自然(田野)被强迫(通过巨大的能源投入)进入一种尽可能可预测和可控制的过于简单化的状态，而永久文化则强调与自然系统的合作(观察和互动)关系。\n杨黑客对于计算来说是相当重要的。毕竟，计算机是建立在可理解的、确定性的模型基础上的，这些模型是自然界中的一小部分被迫遵循的。然而，在许多类型的系统中，这种方式更有意义(例如，神经网络的行为往往很难理性地分析)。\n。此外，将阳型优化发挥到极致(就像在亚千字节的demosene类别中一样)，人们经常会遇到阴路是唯一前进道路的情况。智力上的懒惰有时可能会导致计算过于盲目，例如，在分析一个问题之前，就试图使用机器学习系统来解决它。\n计算过程有很多种。有些会产生最终确定的结果，有些会逐渐改善他们的结果。有些见效很快，有些需要更多时间。\n计算机世界仍然倾向于使用经典的、大型机式的一次性有限的处理过程。与以前的结果相比没有任何改进，只需从头开始运行整个批次。即使一个过程是自然的、缓慢的、渐进的和开放式的-就像在许多类型的机器学习中一样-计算机人也经常强迫它进入大型机控制怪胎的框架。肯定需要更多阴式的态度。\n线性进步的化石工业故事让许多人相信，计算机创新的主要驱动力将是计算能力的不断增加。我强烈反对。实际上，我认为更准确的说法是，尽管硬件的快速增长带来了阻碍，但一些创新已经成为可能(尽管这也不是特别准确的说法)。\n技术可能性的空间不是一条路，甚至不是一棵树：新的发明不需要往前走，也不需要在顶端有树枝，但通常甚至可以从非常原始的元素中创造出来。搜索空间可以更好地被认为是一个多维的根茎迷宫：未被发现的区域可以在任何地方找到，而不仅仅是在边境线上。在科技高速公路上快速前进的能力往往会让人们对根茎的多样性视而不见：同样的边缘人物会被更高的规格重新创造，而真正的新想法会被淡化。\n技术过时的线性进步主义观点可能源于乌托邦的比喻：一次可能只有一个国王。这种想法很容易导致一种贫穷的、单一文化的技术观，一次只能容纳少数几个想法。\n我们应该考虑扩大思想的多样性和丰富性，而不是技术进步(这意味着不断抛弃旧的)。不同的技术应该被视为相互支持，而不是相互争夺统治地位。\n在自然界中，一切都是相互依赖的，而这些相互依赖往往会加强整体。然而，在技术上，大型的依赖网络和多样化的选择往往会使系统更加脆弱。因此，文明应该设法使技术依赖更像自然界中的技术依赖，以及以卓有成效的方式拥抱技术多样性。\n可编程性是计算的核心，也是计算机素养的本质。因此，用户不能刻意疏远它，相反，计算机系统和用户文化应该使编程尽可能地相关、有用和容易获得。\n任何使用计算机的社区都有能力创建自己的软件。本地软件将比通用的一刀切的解决方案更好地解决本地需求。\n不是可以根据不同需求重新配置的庞大复杂引擎，而是可以用来创建仅具有满足其特定目的所需功能的程序的构建块集。\n今天的大多数软件工程实践和工具都是为摩尔的法律界发明的，在那里积累、通用性和产品化比简单性和资源敏感度更重要。未来世界将不再赞成浪费资源，因此需要新的实践和工具。\n优化/重构是极其重要的，应该由人类和AI编解码器在所有级别的抽象中进行。\n理想情况下，可以发明并应用深奥的技巧，而不会危及主代码的清晰度或正确性(例如，通过将问题定义与实现细节分开)。明智的做法是维护问题解决方案、优化/重构技巧和约简规则的数据库，并开发(半)自动查找和应用它们的方法。\n软件的种类很多，很少有原则适用于所有的软件。有些程序就像手持工具，有些程序就像智能问题解决程序，有些程序就像引擎中的齿轮，而有些程序则完全不同。\n一个旨在像工具一样的程序应该是可理解的、可预测的和易用的。它应该足够简单，以便熟练的用户能够对它做什么(以及如何做)进行明确而完整的自然语言描述。理想情况下，实际的可执行程序不会超过此描述。\n理想的易用性可以与乐器的易用性相提并论。用户将形成对程序功能的肌肉记忆水平的掌握，这将使程序像用户身体的延伸一样工作(无论输入硬件的类型如何)。想象和表达之间几乎没有障碍。\n功能的绝对数量并不重要，重要的是组合它们的灵活性。理想情况下，这种灵活性将大大超出程序原始作者的意图。\n除了通常被认为的人工智能之外，视频压缩和软件编译等任务也需要智能。任何人/任何想要完美地完成这些任务的人/任何人都需要知道各种各样的技巧和技术，其中一些可能很难发现，或者非常特定于某些条件。\n如果一个聪明的程序是可理解的，并且/或者使用最少的资源，这永远是一个很好的奖励，但这些属性绝不是优先考虑的。结果是最重要的。\n要证明智能程序的大量资源消耗是合理的，一种方法是估计它的智能在其他地方节省了多少资源。预计在资源和生态系统规划等领域节省的资金最多，因此相当大的人工大脑在那里是合理的。任务是优化/重构大型大脑的大脑也可能很大。\n当用Smartness扩展一个类似于工具的程序时，它不应该降低核心工具的可理解性和易用性。还应该可以随时关闭智能。\n人工智能不应该被认为是与拇指人在类似于人类的术语上竞争。它们最大的价值在于它们不同于人类的思想，因此能够扩大世界的知识多样性。人工智能可能会想出人类大脑很难构思的想法、设计和解决方案。它们还可以减轻人类在某些智力任务中的负担，特别是那些不太适合人类的任务。\n由于我们目前正处于一场全球环境危机之中，需要对文明进行快速而彻底的重新设计，我们应该尽可能多地与人工智能技术合作。\n人工智能也可能是重要的人为差异性。为了避免人类学上的一种奇点，即所有的意义都是由人的头脑创造的，我们应该学会拥抱我们能找到的任何非人类的他者。野生自然是异质的传统来源，而与外星生命形式的接触将提供另一种来源。一般说来，与人工智能的互动将帮助人类丰富他们与他人的关系。\n永久文化希望开发这样的系统，在这个系统中，大自然做了大部分工作，而人类做的主要是维护、设计和建造等工作。因此，计算机化自动化的一个好地方应该是介于自然过程和人工之间的某个地方。\n仅仅是懒惰并不能证明自动化是合理的：现代家庭中充斥着节省相对较少时间但浪费大量能量的设备。自动化在需要人类大量时间和/或精力的连续和重复性任务中表现最好，但从可编程设备中只需忽略不计的资源量。\n由于不断变化的需求和环境，许多程序需要长期维护。这是一个园艺智慧可以派上用场的领域。一个主要的不同之处在于，软件程序比花园更容易从头开始创建。\n程序的大多数更改往往会增加其大小/复杂性。这种效果应该与重构(降低大小/复杂性)相平衡。在当今的世界里，重构的必要性经常被忽视，在这个世界里，不断的硬件升级证明了软件膨胀的合理性。然而，在理想的世界里，经常维护一个程序更有可能使它变得更小、更快，而不是使它变得臃肿。\n功能不变的程序不需要维护，只需要保留。为了消除会使旧软件无法正常工作的平台腐烂，需要兼容定义明确、完全静态(冻结)且易于仿真/虚拟化的平台。\n为它干杯。这项技术将被允许自由连接和扎根于人类和非人类生活的所有领域，而不是被框定为特定的应用。没有什么只是一个工具，或者只是一个玩具，没有人只是一个使用者。对这项技术的每一个方面都会有当地的理解。不仅仅是。\n..", "note_en": "This is a collection of random thoughts regarding the application ofpermacultural ideas to the computer world.\n;  KentBeck&#39;s short-lived idea of  Permaprogramming),but these have mostly concentrated on enhancing software engineeringpractices with some ideas from gardening. I am more interested in the aspectof cultural and ecological permanence. That is, how to give computers ameaningful and sustainable place in a human civilization that has ameaningful and sustainable place in the planetary biosphere.  Over the last few hundred years of human civilization, there has been adramatic increase in the consumption of artificially produced energy. In theoverarching story, this is often equated with &#34;progress&#34;.\n In the computer world, this phenomenon gets multiplied by itself:&#34;progress&#34; facilitates ever greater densities of data storage and digitallogic, thus dramatically exploding the availability of computing resources.However, the abundance has also caused an equivalent explosion inwastefulness, which shows in things like mindblowingly ridiculous hardwarerequirements for even quite trivial tasks.\n . Instead of amplifying the users&#39; intelligence, they ratheramplify their stupidity. Instead of making it possible to scale down theresource requirements of the material world, they have instead become amajor part of the problem. Instead of making the world more comprehensible,they rather add to its incomprehensibility. And they often even manage tobecome slower despite becoming faster. In both computing and agriculture, a major issue is that problems are toooften &#34;solved&#34; by increasing controllability and resource use. Permaculturetakes another way, advocating methods that &#34;let nature do the work&#34; and thusminimize the dependence on artificial energy input. Localness anddecentralization are also major themes in the thought.\n What makes permacultural philosophy particularly appealing (to me) isthat it does not advocate &#34;going back in time&#34; despite advocating a dramaticdecrease in use of artificial energy. Instead, it trusts in human ingenunityin finding clever hacks for turning problems into solutions, competitioninto co-operation, waste into resources. Very much the same kind of creativethinking I appreciate in computer hacking.\n The presence of intelligent life in an ecosystem can be justified by itsstrengthening effect. Ideally, humans could make ecosystems more flexibleand more resilient because of their ability to take leaps that are difficultor impossible for &#34;unintelligent&#34; natural processes. The existence ofcomputers in a human civilization can be justified by their ability toaugment this potential.\n   Permaculture emphasizes resource-sensitivity. Computers primarily useelectricity, so to them resource-sensitivity primarily means 1) adapting tochanges in energy conditions and 2) using the available energy wisely.Today&#39;s computers, even mobile ones, are surprisingly bad at this. This ispartially due to their legacy as &#34;calculation factories&#34; that are constantlyguaranteed all the resources they &#34;need&#34;.\n Intense non-urgent computation (such as long machine learning batches)would take place only when a lot of surplus energy is being produced orthere is a need for electricity-to-heat conversion. This requires that thecomputer is aware of the state of the surrounding energy system.\n At times of low energy, both hardware and software would prefer to scaledown: background processes would freeze, user interfaces would become morerudimentary, clock frequencies would decrease, unneeded processors andmemory banks would power off. At these times, people would prefer to dosomething else than interact with computers.\n are a potential alternative to chemical batteries. They have similar  energy densities(MJ/kg) but require no rare-earth materials and last for decades orcenturies instead of mere years.  IC fabrication requires large amounts of energy, highly refined machineryand poisonous substances. Because of this sacrifice, the resultingmicrochips should be treasured like gems or rare exotic spices. Their activelifespans would be maximized, and they would never be reduced to their rawmaterials until they are thoroughly unusable.\n  Broken devices would be repaired. If the community needs a kind of devicethat does not exist, it should preferrably be built from existing componentsthat have fallen out of use. Chips should be designed open and flexible, sothat they can be reappropriated even for purposes they were never intendedfor.\n Complex chips should have enough redundancy and bypass mechanisms to keepthem working even after some of their internals wear out. (In a multicoreCPU, for instance, many partially functioning cores could combine into onefully functioning one.)\n Chips that work but whose practical use cannot be justified can findartistic and other psychologically meaningful use. They may also be storedaway until they are needed again (especially if the fabrication quality andthe storage conditions allow for decades or centuries of &#34;shelf life&#34;).\n Use what is available. Even chips that do &#34;evil&#34; things are worthconsidering if there&#39;s a landfill full of them. Crack their DRM locks,reverse-engineer their black boxes, deconstruct their philosophies. It mighteven be possible to reappropriate something like Bitcoin-mining ASICs forsomething artistically interesting or even useful.\n Minimized on-chip feature size makes it possible to do more computationwith less energy but it often also means increased fragility and shorterlifespans. Therefore, the densest chips should be primarily used forpurposes where more computation actually yields more. (In entertainment use,for example, a large use of resources is nothing more than a decadentesthetic preference.)\n  should be actively researched.  Livingcells might be able to replace microchips in some tasks sometime in thefuture. Once perfectly clean ways of producing microchip equivalents have beentaken to use, the need for &#34;junk fetishism&#34; will probably diminish.\n  Whenever bright external light is available, displays should be able touse it instead of competing against it with their own backlight. (See:  TransflectiveLCD\n) Personally-owned computers are primarily for those who dedicatethemselves to the technology and thus spend considerable amounts of timewith it. Most other people would be perfectly happy with shared hardware.Even if the culture and society embraced computers more than anything else,requiring everyone to own one would be an overkill.\n  The first item in many lists of permacultural principles is &#34;Observe andinteract.&#34; I interpret this as primarily referring to a bidirectional andco-operative relationship with natural systems: you should not expect yourgarden to be easily top-down controllable like an army unit but accept itsquirkiness and adapt to it. Observation is among the most important human skills computers can augment.Things that are difficult or impossible for humans to observe can be broughtwithin human cognitive capacity by various computational processes. Gatheredinformation can be visualized, slight changes and pattern deviancesemphasized, slow processes sped up, forecasts calculated. In Bill Mollison&#39;swords, &#34;Information is  the critical potential resource. It becomesa resource only when obtained and acted upon.&#34;\n Computer systems should also make their own inner workings as observable aspossible. If the computer produces visual output, it would use a fraction ofits resources to visualize its own intro- and extrospection. A computer thatcommunicates with radio waves, for example, would visualize its own view ofthe surrounding radio landscape.\n Current consumer-oriented computing systems often go to ridiculouslengths to actually prevent the user from knowing what is going on. Evenerror messages have become unfashionable; many websites and apps justpretend everything is fine even if it isn&#39;t. This kind of extremeunobservability is a major source of technological alienation among computerusers.\n The visualizations intended for casual and passive observation would bepleasant and tranquil while making it easy to see the big picture and noticethe small changes. Tapping into the inborn human tendency to observe thenatural environment may be a good idea when designing visualizers. When theuser wants to observe something more closely, however, there is no limit inhow flashy, technical and &#34;non-natural&#34; the presentation can be, as long asthe observer prefers it that way.\n  Traditional computer hacking is often very &#34;yang&#34;. A total understanding andcontrol of the target system is valued. Changing a system&#39;s behavior isoften an end in itself. There are predefined goals the system is pushedtowards. Optimization tends to focus on a single measurable parameter.Finding a system&#39;s absolute limits is more important than finding itsindividual strengths or essence.\n In contrast, &#34;yin&#34; hacking accepts the aspects that are beyond rationalcontrol and comprehension. Rationality gets supported by intuition. Therelationship with the system is more bidirectional, emphasizingexperimentation and observation. The &#34;personality&#34; that stems fromsystem-specific peculiarities gets more attention than the measurable specs.It is also increasingly important to understand when to hack and when justto observe without hacking.\n The difference between yin and yang hacking is similar to the differencebetween permaculture and industrial agriculture. In the latter, a piece ofnature (the field) is forced (via a huge energy investment) into anoversimplified state that is as predictable and controllable as possible.Permaculture, on the other hand, emphasizes a co-operative (observing andinteracting) relationship with the natural system.\n Yang hacking is quite essential to computing. After all, computers arebased on comprehensible and deterministic models that tiny pieces of natureare &#34;forced&#34; to follow. However, there are many kinds of systems where theyin way makes much more sense (e.g. the behavior of neural networks is oftenvery difficult to analyze rationally).\n. Also, taking the yang type of optimization tothe extreme (like in the sub-kilobyte demoscene categories), one often bumpsinto situations where the yin way is the only way forward. Intellectual laziness may sometimes result in computing that is too yin.An example would be trying to use a machine learning system to solve aproblem before even considering it analytically.\n  There are many kinds of computational processes. Some produce a finaldefinitive result, some improve their result gradually. Some yield resultsvery quickly, some need more time.\n Computing world still tends to prefer classic, mainframe-style processesthat are one-shot and finite. No improvement over previous results, justrerun the entire batch from scratch. Even when a process is naturalistic,slow, gradual and open-ended – as in many types of machine learning –computer people often force it into the mainframeishly control-freakyframework. Some more &#34;yin-type&#34; attitude would be definitely needed.\n  The fossil-industrial story of linear progress has made many peoplebelieve that the main driver for computer innovation would be the constantincrease of computing capacity. I strongly disagree. I actually think itwould be more accurate to state that some innovation has been possibledespite the stunting effect of rapid hardware growth (although this is not aparticularly accurate statement either).\n The space of technological possibilities is not a road or even a tree:new inventions do not require &#34;going forward&#34; or &#34;branching on the top&#34; butcan often be made from even quite &#34;primitive&#34; elements. The search spacecould be better thought about as a multidimensional rhizomatic maze:undiscovered areas can be expected to be found anywhere, not merely at the&#34;frontier&#34;. The ability to speed fast &#34;forward&#34; on a &#34;highway of technology&#34;tends to make people blind to the diversity of the rhizome: the same boringideas get reinvented with ever higher specs, and genuinely new ideas getdownplayed.\n The linear-progressivist idea of technological obsolescence may stem fromauthoritarian metaphors: there may only be one king at a time. This ideaeasily leads to an impoverished and monocultural view of technology wherethere is room for only a handful of ideas at a time.\n Instead of technological &#34;progress&#34; (that implies constant abandoning ofthe old), we should consider expanding the diversity and abundance of ideas.Different kinds of technology should be seen as supporting each other ratherthan competing against each other for domination.\n In nature, everything is interdependent, and these interdependencies tendto strengthen the whole. In technology, however, large dependency networksand &#34;diversity of options&#34; often make the system more fragile. Civilizationshould therefore try to find ways of making technological dependencies workmore like those in nature, as well as ways of embracing technologicaldiversity in fruitful ways.\n  Programmability is the core of computing and the essence of computerliteracy. Therefore, users must not be deliberately distanced from it.Instead, computer systems and user cultures should make programming asrelevant, useful and accessible as possible.\n Any community that uses computers would have the ability to create itsown software. A local software would address local needs better than thegeneric &#34;one size fits all&#34; solutions would.\n Rather than huge complex &#34;engines&#34; that can be reconfigured for differentrequirements, there would be sets of building blocks that could be used tocreate programs that only have the features necessary to fill their givenpurposes.\n Most of today&#39;s software engineering practices and tools were inventedfor a &#34;Moore&#39;s law world&#34; where accumulation, genericity and productizationare more important than simplicity and resource-sensitivity. New practicesand tools will be needed for a future world that will no longer approvewasteful use of resources.\n Optimization/refactoring is vitally important and should take place onall levels of abstraction, by both human and AI codecrafters.\n Ideally, it would be possible to invent and apply esoteric tricks withoutendangering the clarity or correctness of the main code (by separating theproblem definition from implementation details, for example). It might bewise to maintain databases for problem solutions, optimization/refactoringtricks and reduction rules and develop ways to (semi)automatically find andapply them.\n  There are many kinds of software, and very few principles apply to all ofthem. Some programs are like handheld tools, some programs are likeintelligent problem-solvers, some programs are like gears in an engine, andsome programs are nothing like any of those.\n  A program that is intended to be like a tool should be understandable,predictable and wieldy. It should be simple enough that a proficient usercan produce an unambiguous and complete natural-language description of whatit does (and how). Ideally, the actual executable program would not belarger than this description.\n The ideal wieldiness may be compared to that of a musical instrument. Theuser would develop a muscle-memory-level grasp of the program features,which would make the program work like an extension of the user&#39;s body(regardless of the type of input hardware). There would be very fewobstacles between imagination and expression.\n The absolute number of features is not as important as the flexibility ofcombining them. Ideally, this flexibility would greatly exceed theintentions of the original author of the program.\n  In addition to what is commonly thought as artificial intelligence,smartness is also required in tasks such as video compression and softwarecompilation. Anybody/anything intending to perform these tasks perfectlywill need to know a large variety of tricks and techniques, some of whichmight be hard to discover or very specific to certain conditions.\n It is always a nice bonus if a smart program is comprehensible and/oruses  minimal resources, butthese attributes are by no means a priority. The results are the mostimportant.\n One way to justify the large resource consumption of a smart program isto estimate how much resources its smartness saves elsewhere. The largestsavings could be expected in areas such as resource and ecosystem planning,so quite large artificial brains could be justified there. Brains whose taskis to optimize/refactor large brains may also be large.\n When expanding a &#34;dumb&#34; tool-like program with smartness, it should neverreduce the comprehensibility and wieldiness of the core tool. It should alsobe possible to switch off the smartness at any time.\n  Artificial intellects should not be thought about as competing againsthumans in human-like terms. Their greatest value is that they are differentfrom human minds and thus able to expand the intellectual diversity of theworld. AIs may be able to come up with ideas, designs and solutions that arevery difficult for human minds to conceive. They may also lessen the humanburden in some intellectual tasks, especially the ones that are notparticularly suitable for humans.\n Since we are currently in the middle of a global environmental crisisthat needs a rapid and complete redesign of the civilization, we shouldco-operate with AI technology as much as we can.\n AI may also be important as artificial otherness. In order to avoid akind of &#34;anthropological singularity&#34; where all meaning is created by humanminds, we should learn to embrace any non-human otherness we can find. Wildnature is the traditional source of otherness, and a contact withextraterrestrial lifeforms would provide another. Interactions withartificial intelligence would help humans enrich their relationships withotherness in general.\n  Permaculture wants to develop systems where nature does most of the work,and humans mostly do things like maintenance, design and building. A goodplace for computerized automation would therefore be somewhere betweennatural processes and human labor.\n Mere laziness does not justify automation: modern households are full ofdevices that save relatively little time but waste a lot of energy.Automation is at its best at continuous and repetitive tasks that require alot of time and/or effort from humans but only a neglectable amount ofresources from a programmable device.\n  Many programs require long-term maintenance due to changing requirementsand environments. This is an area where gardening wisdom can be useful. Amajor difference is that a software program is much easier to (re)createfrom scratch than a garden.\n Most changes to a program tend to grow its size/complexity. This effectshould be balanced with refactoring (that reduces the size/complexity). Theneed for refactoring is often disregarded in today&#39;s &#34;Moorean&#34; world wheresoftware bloat is justified by constant hardware upgrades. In an idealworld, however, the constant maintenance of a program would be more likelyto make it smaller and faster than to bloat it up.\n Programs whose functionality does not change should not requiremaintenance other than preservation. In order to eliminate &#34;platform rot&#34;that would stop old software from working, there would be compatibilityplatforms that are unambiguously defined, completely static (frozen) andeasy to emulate/virtualize.\n    to it. Instead of being framed for specific applications,the technology would be allowed to freely connect and grow roots to allkinds of areas of human and non-human life. Nothing is &#34;just a tool&#34; or&#34;just a toy&#34;, nobody is &#34;just a user&#34;. There would be local understanding of each aspect of the technology. Notmerely th\n......", "posttime": "2020-06-26 02:10:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "个人,permacomputing,计算机", "title": "个人计算机", "title_en": "Permacomputing", "transed": 1, "url": "http://viznut.fi/texts-en/permacomputing.html", "via": "", "real_tags": ["个人", "计算机"]}]