[{"category": "", "categoryclass": "", "imagename": "d6113dc444af5092a529a685e39dafdb.png", "infoid": 1000198, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "没有规则。没有装载机。没有正则表达式。将您的文档与几个超级简单的声明一起发送。\n支持传统和现代框架。非常适合从AngularJS迁移到Vue或Reaction的公司。\nSetup Pitsby基于两种类型的文件。选择一种技术，看看它们有多简单。\nPitsby配置应在您希望为其创建网站的项目的根目录中创建。它负责告诉Pitsby*.doc.js文件在哪里，等等。\n您应该为每个引擎的每个组件创建一个*.doc.js文件。如果您的项目使组件可用于多种技术，则每个组件都需要有自己的*doc.js文件。\n构建设置配置文件和至少一个文档文件后，您可以轻松地生成运行以下各项的网站：\nPitsby构建，您可以看到使用http-server或您喜欢的任何其他lib为其提供服务的结果：\nHTTP-server./Pitsby。\n监视要保持Pitsby监视您对配置文件中列出的任何文件所做的更改，请运行以下命令：\n皮茨比建筑--看着。\nPitsby绝对是令人敬畏和简单的-在记录组件时没有更多的痛苦，特别是香草！", "note_en": "No rules. No loaders. No regex. Ship your docs with a couple of super simple declarations.\n Support for legacy and modern frameworks. Perfect for companies migrating from AngularJS to Vue or React.\n Setup Pitsby is based on two types of file. Choose a technology to see how simple they are.\n Pitsby configuration should be created in the root directory of the project which you want the website will be created for. It’s responsible to tell Pitsby where  *.doc.js files are, among other things.\n You should create one  *.doc.js file per component per engine. If your project makes components available for more than one technology, each of them needs to have its own  *doc.js file.\n Build Once you have set up a  configuration file and, at least, one  documentation file, you can easily generate the website running:\n pitsby build You can see the result serving it with    http-server or any other lib that you prefer:\n http-server ./pitsby\n Watch To keep Pitsby watching the changes that you make on any file listed on on the  configuration file, run:\n pitsby build --watch\n Pitsby is utterly awesome and easy - no more pain while documentating components, specially Vanilla!", "posttime": "2020-05-02 17:57:56", "tags": "记录,nice,pitsby,file", "title": "Pitsby-愉快地记录组件", "title_en": "Pitsby – Have a nice time documenting components", "transed": 0, "url": "https://pitsby.com/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["记录", "nice", "pitsby", "file"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000196, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如今，在GPU上运行计算工作负载主要有两种方式。一个是CUDA，它有一个非常棒的生态系统，包括高度调优的库，但(实际上)与NVIDIA硬件捆绑在一起。另一种是主要用于游戏的图形API，它们在各种各样的硬件上运行，但在历史上提供的能力比CUDA小得多。此外，那个空间的计算工具也很糟糕。从历史上看，使用OpenCL也做了很多计算，但是它的未来是阴云密布的，因为它已经被正式.。\nVulkan在其原始功能方面一直在快速追赶，最近的扩展支持更高级的GPU计算功能，如子组、指针和内存模型。它是否已经到了可以运行严重计算工作负载的地步？\n在这篇博客文章中，我们对在最近的Vulkan上实现前缀SUM进行了一些初步的探索。我有一个粗略的实现初稿，它表明Vulkan对于一个足够坚持不懈的实现者来说可能是一个可行的平台。\n正如Hacker News用户Flffything在我的GPU计算演讲品味HN线程中指出的那样，前缀总和是评估GPU计算语言和运行时的一个很好的基准。\n首先，它本身是有用的。我在font-rs中使用它来集成精确面积计算的片段，以得出字体呈现的总面积覆盖率。它还被用作更多操作中的原语，包括GPU端动态分配和压缩。\n第二，这很简单。顺序版本可以仅用几行代码来表示：\ndef prefix_sum(A)：a：s+=x结果中x的def prefix_sum(A)：s=0 result=[]。追加返回结果。\n对于三个人来说，在GPU上高效实现是具有挑战性的，但也是可能的。上面的代码具有严格的顺序依赖关系，但是因为加法是关联的，所以可以利用大量的并行性，这方面的文献可以追溯到几十年前。即便如此，在GPU上高效地利用这种并行性需要调用之间的通信(更常见的GPU术语中的“线程”)，并且需要仔细注意内存层次结构。\n前缀SUM的泛化称为“扫描”，适用于任何关联操作，而不仅仅是加法。它甚至不必是可交换的；示例包括正则表达式和IIR过滤。更准确地说，可以使用任何么半群、具有标识元素的结构以及关联操作进行扫描；标识元素是扫描的“独占”变体所必需的，因为它是输出的第一个元素。\n最先进的技术是解耦的回顾。我不打算在这里总结算法，但建议您阅读这篇论文。结果令人印象深刻-对于大型数据集，他们报告达到了memcpy的速度，这意味着不可能再有进一步的加速。\n这项工作是对NVIDIA的GPU Gems3中的CUDA并行前缀求和(SCAN)的改进。产品级的开源实现是CUB。另一个设计为更易于访问但并未优化的实现是现代GPU扫描。\n我自己的实现在很大程度上是一种研究质量的概念证明。它作为Piet-gpupository的前缀分支存在。基本上，我想确定是否有可能使用Vulkan计算内核来实现与memcpy性能近在咫尺的性能。它是解耦回顾论文的一个相当简单的实现，并没有实现所有的技巧。例如，回顾是完全按顺序进行的；我没有按照建议将回顾并行化。\n这个实现已经够粗糙的了，我还不想做仔细的性能评估，但初步结果是令人鼓舞的：在GTX 1080上计算64-32位无符号整数的前缀和需要2.05ms的GPU时间，速度为312亿个元素/秒。由于每个元素涉及读取和写入4个字节，这对应于大约262GiB/s的原始内存带宽。理论内存带宽列出为320 GB/s，因此很明显代码能够.。\n“现代C++”的成就之一是C++11内存模型。在过去，C和C++中的无锁编程模式的机制是Volatil限定符和各种非标准的障碍内部函数。人们从操作上对此进行了推论--Volatile的主要功能是禁用某些优化，而屏障内部函数会编译成内存围栏指令，这通常会导致硬件刷新缓存。\n今天，大多数无锁爱好者认为那个时代是野蛮的。为了多线程的目的，从来没有清楚地定义易失性的语义(尽管人们还是使用它，因为它看起来很有用)，并且屏障指令具有特定于硬件的令人不安的属性。因为x86有“总存储顺序”，所以发布安全通常不需要屏障指令。然而，同样的代码在，", "note_en": "Today, there are two main ways to run compute workloads on GPU. One is CUDA, which has a fantastic ecosystem including highly tuned libraries, but is (in practice) tied to Nvidia hardware. The other is graphics APIs used primarily for gaming, which run on a wide variety of hardware, but historically offer much less power than CUDA. Also, the tooling for compute in that space is terrible. Historically, a lot of compute has also been done with OpenCL, but its future is cloudy as it ’s been officially  ...\n Vulkan has been catching up fast in its raw capabilities, with recent extensions supporting more advanced GPU compute features such as subgroups, pointers, and a memory model. Is it getting to the point where it can run serious compute workloads?\n In this blog post are some initial explorations into implementing  prefix sum on recent Vulkan. I have a rough first draft implementation which suggests that Vulkan might be a viable platform, for a sufficiently persistent implementor.\n  As Hacker News user fluffything points out in  this HN thread on my  Taste of GPU compute talk, prefix sum is an excellent benchmark for evaluating GPU compute languages and runtimes.\n For one, it is useful in and of itself. I use it in  font-rs to integrate fragments of exact-area computations to arrive at the total area coverage for font rendering. It is also used as a primitive in many more operations, including GPU-side dynamic allocation and  compaction.\n For two, it is simple. The sequential version can be expressed in just a handful of lines of code:\n def  prefix_sum ( a ):  s  =  0  result  =  []  for  x  in  a :  s  +=  x  result . append ( s )  return  result\n For three, it is challenging but possible to implement efficiently on GPU. The above code has a strictly sequential dependency, but because addition is associative, it is possible to exploit a great deal of parallelism, and there is literature on that going back decades. Even so, efficiently exploiting that parallelism on GPU requires communication between invocations (“threads” in more common GPU lingo) and careful attention to the memory hierarchy.\n The generalization of prefix sum is called “scan,” and works with any associative operation, not just addition. It doesn’t even have to be commutative; examples of that include  regular expressions and  IIR filtering. More precisely, a scan can be done with any  monoid, a structure with an identity element as well as the associative operation; the identity element is required for the “exclusive” variant of scan, as it is the first element of the output.\n  The state of the art is  decoupled look-back. I’m not going to try to summarize the algorithm here, but recommend reading the paper. The results are impressive — for large data sets, they report reaching memcpy speeds, meaning that no further speedup is possible.\n That work is a refinement of  Parallel Prefix Sum (Scan) with CUDA from Nvidia’s GPU Gems 3 book. A production-quality, open source implementation is  CUB. Another implementation, designed to be more accessible but not as optimized, is  ModernGPU scan.\n My own  implementation is very much a research-quality proof of concept. It exists as the  prefix branch of the  piet-gpurepository. Basically, I wanted to determine whether it was possible to come within a stone ’s throw of memcpy performance using Vulkan compute kernels. It ’s a fairly straightforward implementation of the decoupled look-back paper, and doesn ’t implement all the tricks. For example, the look-back is entirely sequential; I didn ’t parallelize the look-back as suggested  ...\n The implementation is enough of a rough prototype I don ’t yet want to do careful performance evaluation, but initial results are encouraging: it takes 2.05ms of GPU time to compute the prefix sum of 64Mi 32-bit unsigned integers on a GTX 1080, a rate of 31.2 billion elements/second. Since each element involves reading and writing 4 bytes, that corresponds to a raw memory bandwidth of around 262GiB/s. The theoretical memory bandwidth is listed as 320GB/s, so clearly the code is able  ...\n  One of the achievements of “modern C++” is the C++11 memory model. In the olden days, the mechanism for lock-free programming patterns in C and C++ was the  volatile qualifier and various nonstandard barrier intrinsics. People reasoned about these operationally — the primary function of  volatile was to disable certain optimizations, and the barrier intrinsics compile to a memory fence instruction, which generally cause hardware to flush caches.\n Today, most lock-free aficionados consider those times to be barbaric. The semantics of  volatile were never clearly defined for the purpose of multithreading (though people used it anyway, because it appeared to be useful), and the barrier instructions had the disturbing property of being hardware specific. Because x86 has “total store order,” barrier instructions are generally not needed for  publication safety. However, the same code on, say, ARM, which has more weakly ordered memory  ...\n With the C++11 memory model, the programmer specifies the needed ordering constraints precisely. The compiler can then optimize the program very aggressively, as long as it meets those constraints. For example, acquire and release semantics (the basis of publication safety) will compile to explicit memory fence instructions on ARM, but to nothing on x86. A good writeup is the blog post  C++ atomics and memory ordering.\n The new  Vulkan memory modelbrings the same idea to GPU compute. I used it in my code, in large part because I wanted to experiment with it. I ’ve done a fair amount of lock-free code using the C++ memory model. And lock-free code, while fairly rare on the CPU (my main motivation is to avoid priority inversion for real time audio), is more or less required on the GPU, because mutex is not available in kernel code. Even if it were, it would create a lot of problems, as it would block  ...\n Is a memory model absolutely required to run this code? If you replace the atomic loads and stores with simple array accesses, it deadlocks. However, at least on my hardware, correct operation can be recovered by adding the  volatile qualifier to the  WorkBuf array. As with older style C++, there are two risks. Though it seems to work reliably and efficiently on my hardware, it’s possible the  volatilequalifier and explicit fences cause more cache flushing than is needed, or suppress  ...\n We’re already seeing variation in hardware that requires different levels of vigilance for memory semantics. On most GPU hardware, the invocations (threads) within a subgroup (warp) execute in lock-step, and thus don’t require any synchronization. However, as of Nvidia Volta, the hardware is capable of  independent thread scheduling. Correct code will add explicit memory semantics even within a subgroup, which will, as in total store order on x86, compile to nothing on hardware  ...\n In my research for this blog post, I did not come across any evidence of people actually using the Vulkan memory model, i.e. no search hits for the relevant identifiers other than work associated with the spec. Thus, one contribution of this blog post is to show a concrete example of code that uses it.\n  On GPU, it’s easiest to run workloads that use static allocation, for example a fixed size buffer per workgroup, and workgroups arranged in a 2D grid (“dispatch” operations support 1D and 3D as well). But dynamic allocation is possible, with care.\n The two major approaches to dynamic allocation are prefix sum and atomic bump allocation. The main reason for one over the other is whether you care about the ordering. Let’s take a simple problem of computing some function on an array of input values, where the output is variable sized.\n Using a prefix-sum approach, you run a first pass of computing the size of the output. The prefix sum of that result yields an offset into an output buffer. The second pass (after the prefix sum) computes the function and writes it into the output buffer, using the offset provided by the prefix sum. [Also note that if we ’re getting really fancy, it might be possible to fuse either or both of these passes with the prefix sum itself, decreasing the amount of global memory  ...\n An atomic bump allocation approach simply does   atomicAdd on each output, using a bump allocation index (effectively a pointer) as the first argument and the size of the allocation as the second. This yields results broadly similar to the prefix sum approach, but with the outputs in arbitrary order. Perhaps the order is not important, or, alternatively, a sort pass can be applied afterwards (sorting on GPU is another topic with a rich literature).\n The two can be combined. For example, it makes sense to do a prefix sum of the sizes of items within a workgroup, and a single atomic bump allocation for the per-workgroup total.\n One problem that might benefit from prefix sum for dynamic allocation is  flattening Bézier curves to polylines. Each Bézier segment can be computed in parallel, but you generally want to preserve the order of segments within the full path. The flattening algorithm I presented in that blog post (and its  generalization to cubics) fits nicely into this framework —it ’s already in two passes, where the first computes the number of segments required, and the second can compute  ...\n  High performance prefix sum requires coordination between threads — it’s possible to extract some parallelism by running O(log n) tree reduction passes, each of which pulls only from the previous pass, but this would be considerably slower than state of the art. Coordination must be at all levels of the hierarchy. GPU compute has always made threadgroup shared memory available for such coordination. An even faster but newer capability is  subgroups, not yet universally  ...\n My prototype code uses subgroups extensively. One serious limitation is that it assumes a subgroup size of 32, which is true for some hardware. However, other hardware has different size subgroups, and then Intel is special.\n By default, when compiling a compute kernel, the Intel drivers use a  heuristicto determine the subgroup size, which can then be 8, 16, or 32. It actually makes sense they use a heuristic, as there ’s a complex tradeoff. A bigger subgroup means bigger chunks of work, which means less per-chunk overhead, but also fewer registers available per thread, and potentially more wasted work due to divergence. Again, that depends on workloads. For low-probability, expensive conditional  ...\n It might be  possible to write a kernel that adapts to subgroup size, but there are a number of considerations that make this tricky. One is whether the number of items processed by a workgroup adapts to subgroup size. If so, then the size of the dispatch must be adapted as well. There is an  extensionfor the CPU side to query subgroup size of a pipeline, but, sadly, it doesn ’t seem to be implemented on Intel drivers on Windows, where it would be most useful. (It is,  ...\n Another problem is querying the subgroup size from inside the kernel, which has a surprising gotcha. By default, the  gl_SubgroupSize variable is defined to have the value from  VkPhysicalDeviceSubgroupProperties, which in my experiment is always 32 on Intel no matter the actual subgroup size.\n Newer (Vulkan 1.2) Intel drivers offer the ability to both accurately query and control over the subgroup size, with the  VK_EXT_subgroup_size_control extension. With that extension, setting the  VK_PIPELINE_SHADER_STAGE_CREATE_ALLOW_VARYING_SUBGROUP_SIZE_BIT_EXT at pipeline creation time makes  gl_subgroupSizebehave as expected. Also, I can set the subgroup size to 32, and the kernel works fine. Note though that in general, setting a too-large subgroup size can actually  ...\n On RDNA-based AMD cards, the subgroup size extension lets you get subgroups of 32 on RDNA-based AMD cards, though the default is 64.\n In practice, the programmer will write multiple versions of the kernel, each tuned for a different subgroup size, then on CPU side the code will query the hardware for supported subgroup sizes and choose the best one that can run on the hardware. Note that, in general, querying the range of supported subgroup sizes requires the subgroup size extension to be reliable, though you do string-matching on the device name to come up with a good guess. Note that the  specialization  ...\n Brian Merchant has done more exploration into the tradeoff between subgroups and threadgroup shared memory, for a different primitive operation, transpose of 32x32 boolean matrices. That  transpose timing writeup contains measurements on a variety of hardware, and is recommended to the interested reader.\n  The  subgroupInclusiveAdd function seems like it’s doing a lot — it’s performing a prefix sum operation on an entire subgroup’s worth of data. Does hardware contain an assembly instruction that directly implements it? What if you want to do an operation other than addition, where there isn’t an intrinsic available?\n Obviously different hardware will be different, but looking at the Radeon GPU Analyzer output on  Shader Playground tells us a lot. It generates a tree reduction (the Hillis-Steele algorithm as presented in the  prefix sum Wikipedia page) with lg(n) stages of subgroup shuffle + add. Since subgroup shuffle is available in Vulkan (but see below), if you were to write out such a reduction you’d be able to get similar results.\n On AMD hardware there is one additional twist:  AMD has an additional level of hierarchy between subgroup (64 invocations, 1 wavefront) and invocation (thread). Internally, the hardware is organized around a  row of 16 elements. Access to elements within a row uses a different instruction modifier ( row_shr) than across the entire wave ( row_bcast or  wave_ror, for two examples), and is likely lower latency in the chip. The Vulkan subgroup extensions provide a powerful  ...\n  It is tempting to use a portability layer such as gfx-hal to run compute workloads on a variety of graphics APIs. (Other such portability layers include MoltenVK for running Vulkan on top of Metal, and similar work for running  OpenCL on DX12). But such an approach is limited to the lowest common denominator — it can’t provide capabilities that are missing in the underlying layer.\n   Also note that gfx-hal currently doesn’t give access to Shader Model 6 intrinsics (subgroup operations), but there’s an  issue and hopefully that will be fixed.\n  Metal is closer to Vulkan in capabilities (especially newer versions), but still lacks subgroup size control and a memory model.\n  I covered a fair number of GPU compute infrastructure projects in my talk and the associated  GPU resources list. Since then I’ve learned of quite a few more:\n vuda, which runs (SPIR-V) compute workloads using an API similar to the CUDA host API.\n    OpenCL 3.0 is announced, with a number of strategies to rescue OpenCL from a fate of irrelevance.\n I am also optimistic about  WebGPU becoming a viable platform for compute workloads, both delivered over the web and in native implementations such as  wgpu.\n Echoing fluffything’s comment, I propose adopting prefix sum as something of a “hello world” benchmark of GPU compute. It’s simple enough it should be practical to implement without too much effort (and if not, that’s also an important data point), it exercises “advanced” features such as subgroup shuffles, and it’s reasonably easy to quantify. When looking at these potential infrastructure projects, ask these questions:\n  The result of my explorations on Vulkan suggest (but do not yet prove) good answers to these questions, but at the expense of doing a lot of the low-level legwork yourself, and programming the kernel in a very low-level style (in GLSL). I think there’s a huge opportunity for more sophisticated tools.\n Also, I think it’s a great benchmark for the emerging field of GPU-friendly languages. Is it possible to express the algorithm in a reasonably high-level manner? If so, does it compile to code with competitive performance? Can we write a high-performance abstraction as a library that can be consumed easily? Can that abstraction offer portability across hardware but hide the complexity from its users? Can you provide your own monoid?\n  I ’ve showed that Vulkan can do prefix sum with near state of the art performance. However, I ’ve also outlined some of the challenges involved in writing Vulkan compute kernels that run portably and with high performance. The lower levels of the stack are becoming solid, enabling a determined programmer to ship high performance compute across a wide range of the hardware, but there is also an opportunity for much better tooling at the higher levels.  ...\n Thanks to Brian Merchant, Matt Keeter, and msiglreith for discussions on these topics, and Jason Ekstrand for setting me straight on subgroup size concerns on Intel.", "posttime": "2020-05-02 17:57:47", "tags": "前缀,sum,gpu,subgroup", "title": "关于Vulkan的前缀SUM", "title_en": "Prefix Sum on Vulkan", "transed": 0, "url": "https://raphlinus.github.io/gpu/2020/04/30/prefix-sum.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["前缀", "sum", "gpu", "subgroup"]}, {"category": "", "categoryclass": "", "imagename": "1557bf7ef06d1c345fbdce966c599d57.jpg", "infoid": 1000195, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "唐纳德·特朗普总统今天签署了一项行政命令，禁止美国电网实体购买和安装在美国境外制造的电气设备。\n特朗普说，外国对手越来越多地制造和利用美国大规模电力系统中的漏洞。\n美国总统表示，对美国电网的成功攻击将给我们的经济、人类健康和安全带来重大风险，并将降低美国采取行动保卫自己及其盟友的能力。\n白宫辩称，在美国以外制造的设备可能会被外国对手操纵，插入并随后利用电气设备中的漏洞，带来潜在的灾难性影响。\n除了禁止电网运营商购买和安装新的外国设备外，该命令还授权能源部长启动程序，识别目前在美国以外制造的电气设备，并与政府机构和私营部门制定战略，将其隔离、监控，并最终在未来更换。\n尽管特朗普总统称黑客威胁是签署新命令的主要原因，但到目前为止，美国还没有看到任何来自外国黑客的破坏性攻击。\n相反，美国电网生态系统一直是外国黑客持续侦察行动的目标，俄罗斯威胁因素是最持久的。\n2018年，美国国土安全部(Department Of Homeland Security)发布了一份安全建议，内容是俄罗斯增加了针对美国能源部门的网络行动。\n2019年，不明身份的黑客利用一个简单的拒绝服务(DoS)漏洞，在几个小时内重启了一家电网运营商的防火墙，但他们没有侵入运营商的内部网络来改变电网参数。\n今年早些时候，美国联邦调查局(Federal Bureau Of Investigations)在1月份向电网运营商发送了关于黑客攻击其软件供应链的私人通知。攻击中使用的恶意软件与已知的伊朗国家支持的黑客之前使用的恶意软件有相似之处。", "note_en": "President Donald Trump signed today  an executive order barring US power grid entities from buying and installing electrical equipment that has been manufactured outside the US.\n Trump said that &#34;foreign adversaries are increasingly creating and exploiting vulnerabilities in the United States bulk-power system.&#34;\n The US president said that successful attacks against the US power grid would &#34;present significant risks to our economy, human health and safety, and would render the United States less capable of acting in defense of itself and its allies.&#34;\n The White House argued that equipment made outside the US could be manipulated by foreign adversaries to insert and later exploit vulnerabilities in electrical equipment &#34;with potentially catastrophic effects.&#34;\n Besides barring power grid operators from buying and installing new foreign equipment, the order also authorizes the Secretary of Energy to start procedures to identify current electrical equipment manufactured outside the US and develop strategies with government agencies and the private sector to have it isolated, monitored, and eventually replaced in the future.\n    Despite President Trump citing hacking threats as a primary reason for signing the new order, the US has not seen any destructive attacks from foreign hackers until now.\n   Instead, the US power grid ecosystem has been the target of constant reconnaissance operations from foreign hackers, with Russian threat actors being the most persistent.\n In 2018, the Department of Homeland Security issued a security advisory about increased  Russian cyber-operations targeting the US energy sector.\n In 2019, unknown hackers  used a simple denial of service (DoS) flaw to reboot firewalls at an electric power grid operator for hours, but they did not breach the operator&#39;s internal network to alter power grid parameters.\n Earlier this year, in January, the Federal Bureau of Investigations sent private notifications to power grid operators about  hackers targeting their software supply chain. The malware used in the attacks contained similarities to malware previously used by known Iranian state-sponsored hackers.", "posttime": "2020-05-02 17:57:42", "tags": "黑客,bans,美国,power", "title": "特朗普以黑客威胁为由禁止收购外国电网设备", "title_en": "Trump bans acquisition of foreign power grid equipment, citing hacking threats", "transed": 0, "url": "https://www.zdnet.com/article/trump-bans-acquisition-of-foreign-power-grid-equipment-citing-hacking-threats/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["黑客", "bans", "美国", "power"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000194, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇博文披露了MacOS上的一个沙盒转义。我在2019年12月19日，也就是苹果安全赏金计划最终开放的那一天，向苹果产品安全部门报告了这个问题。(我在2019年8月发现了这个问题。)。今天我收到苹果产品安全部门的一封电子邮件，说我们没有看到任何实际的安全隐患。我以前听过这样的回复-他们没有看到任何安全隐患…。直到他们这么做--但无论如何，我显然是不会收到赏金的。\n附件是一个示例Xcode项目，它演示了沙箱Mac应用程序如何通过一次点击就可以逃离沙箱。此沙盒转义适用于当前的公开发布版本MacOS 10.15.2。我还在MacOS10.14.6上测试过。\n要复制、构建和运行示例应用程序，请执行以下操作。然后，当系统对话框询问示例应用程序是否可以通过Apple事件控制TextEdit时，单击以允许。这将允许样例应用程序在沙箱外的目录&#34；/Users/Shared&#34；中创建一个名为&#34；ESCRIFE&#34；的文件。你还会听到应用程序说“嗨”，表示它已成功逃离沙盒。示例应用程序实际上启动了一个shell脚本&#34；test.sh&#34；，该脚本可以在沙箱之外运行任意代码。\n通过TextEdit拥有的授权&#34；com.apple.security.files.user-selected.executable&#34；，沙箱转义成为可能。它也被一些Mac应用商店的应用程序所拥有，比如BBEdit。(请注意，虽然TextEdit和BBEdit本身是沙箱，但此权限也允许它们脱离自己的沙箱。因此，任何具有&#34；com.apple.security.files.user-selected.executable&#34；权限的应用程序都只是名义上被沙箱保护，实际上并没有被沙箱保护。)。\n通常，当沙箱应用程序写入文件时，该文件会被隔离。如果文件是shell脚本，则隔离扩展属性将阻止该脚本运行。但是，当具有&#34；com.apple.security.files.user-selected.executable&#34；权限的应用程序(如TextEdit)保存文件时，它会删除隔离扩展属性！\n我的示例应用程序在TextEdit中打开一个shell脚本，然后它使用Apple Events权限告诉TextEdit保存文件，从而移除隔离并允许脚本在应用程序的沙箱之外执行。\n这对用户来说应该是非常无害的，因为没有人认为TextEdit是危险的，所以人们会认为允许控制TextEdit没有太大风险。\n请注意，我选择/Users/Shared目录是为了避免MacOS隐私保护，这些隐私保护会阻止与各种其他目录(如桌面、文档和下载)交互。另请注意，此问题(如果您认为它是一个问题)在最新版本的MacOS 10.15.4上仍然存在。\n我写了一篇新的博客文章，试图澄清这里提出的一些问题。", "note_en": "This blog post discloses a sandbox escape on macOS. I reported the issue to Apple Product Security on December 19 2019, the day the Apple Security Bounty program finally opened. (I discovered the issue in August 2019.) Today I received an email from Apple Product Security saying &#34;we do not see any actual security implications.&#34; I&#39;ve heard this kind of response  before—they don&#39;t see any security implications …until they do —but in any case I obviously won&#39;t be receiving a bounty  ...\n Attached is a sample Xcode project that demonstrates how a sandboxed Mac app can escape the sandbox with one click. This sandbox escape works on the current public shipping version macOS 10.15.2. I&#39;ve also tested on macOS 10.14.6.\n To reproduce, build and run the sample app. Then click to allow when the system dialog asks if the sample app can control TextEdit via Apple Events. This will allow the sample app to create a file named &#34;escaped&#34; in the directory &#34;/Users/Shared&#34;, outside the sandbox. You&#39;ll also hear the app say &#34;hi&#34; to signal that it&#39;s successfully escaped the sandbox. The sample app has actually launched a shell script, &#34;test.sh&#34;, which can run any arbitrary code outside the sandbox.\n The sandbox escape is made possible by the entitlement &#34;com.apple.security.files.user-selected.executable&#34; possessed by TextEdit. It&#39;s also possessed by some Mac App Store apps such as BBEdit. (Note that while TextEdit and BBEdit are themselves sandboxed, this entitlement would also allow them to escape their own sandbox. Thus, any app with the &#34;com.apple.security.files.user-selected.executable&#34; entitlement is only nominally sandboxed, effectively not sandboxed.)\n Normally, when a sandboxed app writes to a file, the file is quarantined. If the file is a shell script, then the quarantine extended attribute would prevent the script from running. However, when an app such as TextEdit with the &#34;com.apple.security.files.user-selected.executable&#34; entitlement saves a file, it removes the quarantine extended attribute!\n My sample app opens a shell script in TextEdit, and then it uses the Apple Events permission to tell TextEdit to save the file, thus removing the quarantine and allowing the script to be executed outside the app&#39;s sandbox.\n This should appear very innocuous to the user, because nobody thinks that TextEdit is dangerous, so one would think it&#39;s not much of a risk to allow TextEdit to be controlled.\n Note that I chose the directory  /Users/Shared to avoid macOS &#34;privacy protections&#34; that prevent interaction with various other directories such as Desktop, Documents, and Downloads. Note also that this issue (if you consider it an issue) still exists on the latest version 10.15.4 of macOS.\n  I&#39;ve written a  new blog post that attempts to clarify a number of issues raised here.", "posttime": "2020-05-02 17:57:37", "tags": "mac,沙盒,sandbox,应用程序,textedit", "title": "MAC沙盒转义", "title_en": "Mac sandbox escape", "transed": 0, "url": "https://lapcatsoftware.com/articles/sandbox-escape.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["mac", "沙盒", "sandbox", "应用程序", "textedit"]}, {"category": "", "categoryclass": "", "imagename": "97fa4bf6b4e282d59ce882942ce8bf6d.jpg", "infoid": 1000191, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "3月23日，美国股市在连续数周暴跌近30%后第二天收盘。这一下降恰逢全国范围内的一波封锁浪潮，以及整个欧洲、拉丁美洲和南亚的类似举措。从那时起，美国经济一直处于自由落体状态，超过2600万人申请失业，一波又一波的零售店濒临破产，能源和石油公司摇摇欲坠，旅行停飞，第一季度国内生产总值(GDP)下降4.8%…。\n怎么一回事？怎么可能在经济崩溃的时候，股市却在飙升呢？市场走势往往令人摸不着头脑，但在这种情况下，答案可能相对简单：因为美联储(Federal Reserve)的举措，金融市场充斥着大量的资金，大量的水龙带供应。自3月份以来，美联储承诺借出或购买数万亿美元的金融资产，据一些人估计，到一切都说完和做完的时候，这些资产可能最终会超过8万亿美元。没有人..。\n而且不仅仅是美联储。国会分配了近3万亿美元的经济援助；日本央行对全球第三大经济体的做法与美联储大致相同；欧洲央行紧随其后，全球多个国家的政府也在效仿。\n其结果是，即使现实世界的经济在短期内冻结并内爆，金融市场仍受到流动性海啸的提振。\n这让许多投资者感到不安，他们认为要么通胀大幅飙升，要么股票和债券面临可怕的清算。最具影响力的债券经理之一、受人尊敬的投资者杰弗里·冈拉克(Jeffery Gundlach)本周警告称，市场很快就会迅速南下，人们应该更加“警惕万能药”。美国银行(Bank America)的分析师认为，最近的市场强势只是一次死猫反弹，就像2008年发生的那样，然后在当年晚些时候发生了更激烈的崩盘。其他人相信所有的..。\n然而，还有其他一些事情正在发生，这应该会让人们暂停一下这样的信念，即市场实力是假的。如果这仅仅是一片让一切都漂浮起来的资金海洋，那么你就会认为股市会全面上涨。事实并非如此。\n事实上，个别公司的表现有很大的不同，这反映了对它们在大流行世界中的表现的冷眼评估。那些被视为特别脆弱的公司，比如遍布商场的零售店，股价下跌了50%，自3月23日以来只略有回升。盖普百货(Gap)、梅西百货(Macy‘s)、迈克尔·科尔斯(Michael Kors)都面临着令人望而生畏的前景，金融市场的流动性再多也掩盖不了这一点。能源公司，..。\n另一方面，当前动荡的明显受益者做得很好。仅亚马逊(Amazon)、苹果(Apple)、微软(Microsoft)、Facebook和谷歌(Google)这五家大型科技公司的市值就达到了5万亿美元，尤其是亚马逊的股价自3月中旬以来上涨了30%以上。好市多(Costco)和高乐氏(Clorox)与沃尔玛(Walmart)一起业务蓬勃发展，视频会议公司Zoom也是如此。\n因此，虽然市场没有根据实时的经济基本面行事，但它们是基于对未来基本面的合理判断，并区分哪些行业看起来受到的打击最严重，哪些行业甚至可能受益于冠状病毒应对措施正在造成的戏剧性经济混乱。如果一切都在不分青红皂白地上涨，那将表明市场完全超然。没有。\n对于那些-可以理解的-可能会将所有这一切视为进一步证明，金融界将再次以数千万真人为代价而获救，数百万小公司将被牺牲的人来说，这一次不同了。例如，美联储承诺以优惠的利率购买数千亿美元的市政债券，这将意味着资金紧张的州政府应该能够留住教师和警察…。\n因此，尽管在世界经济崩溃的情况下，市场表现相对良好看起来很疯狂，但有一种方法可以解决这种疯狂，它反映了一个否则就很可怕的时期的一些潜在的积极现实。就目前而言，这可能只是一个小小的安慰，但它清楚地提醒人们，尽管目前的情况很糟糕，但实际上它们可能会变得相当糟糕。\n如果您不希望通过电子邮件从Time接收促销优惠，请选中此框。\n你可以随时退订。注册即表示您同意我们的使用条款和隐私政策。\n为了您的安全，我们已向您输入的地址发送了确认电子邮件。点击链接确认您的订阅并开始接收我们的时事通讯。如果您在10分钟内没有得到确认，请检查您的垃圾邮件文件夹。\nTime Ideas主持世界领先的声音，提供对新闻、社会和文化事件的评论。我们欢迎外部捐款。不需要发表意见", "note_en": "On March 23, U.S. stock markets closed the day after a multi-week plunge of nearly 30%. This drop coincided with a wave of lockdowns across the country, as well as similar moves throughout Europe, Latin America and South Asia. Since then, the U.S. economy has been in free-fall, with more than 26 million people filing for unemployment, waves of retail stores on the edge of bankruptcy, energy and oil companies teetering on the brink, travel grounded, and the GDP was down 4.8% in the first quarter  ...\n  What is going on? How can it be that stocks are soaring when the economy is crashing? Market movements are often head-scratching, but in this case, the answer may be relatively simple: because of moves by the Federal Reserve, financial markets are awash in money, vast, water-hose supplies of money. Since March, the Fed has committed to lend or buy trillions of dollars of financial assets, which by  some estimatesmight end up exceeding $8 trillion dollars by the time all is said and done. No one  ...\n      And it’s not just the Fed. Congress has allocated almost $3 trillion in economic aid; the Bank of Japan is doing much the same as the Fed for the world’s third largest economy; the European Central Bank is not far behind, and multiple governments around the world are following suit.\n  The result is that even as real-world economies freeze and implode in the short-term, financial markets are buoyed by a tsunami of liquidity.\n  That troubles many investors, who see either sharp spikes of inflation or dire reckoning ahead for stocks and bonds. Respected investor Jeffery Gundlach, one of the most influential bond managers,  warned this week that markets will soon head south fast and the people should be more “wary of panaceas.” Analysts at Bank America  positthat the recent market strength is simply a dead-cat bounce like what happened in 2008 before a more intense crash later that year. Others believe that all  ...\n    And yet, there is something else going on that should give pause to the belief that market strength is a head fake. If it were only about a sea of money floating everything, then you would think that stocks across the board would be going up. That is not the case.\n  In fact, there is a dramatic difference in how individual companies are faring that reflects a cold-eyed assessments of how they will do in a pandemic world. Companies that are seen as especially vulnerable, such as retail stores spread across malls, are seeing stock declines of 50% and have only recovered marginally since March 23. The Gap, Macy ’s, Michael Kors, all face daunting prospects, and no amount of liquidity in financial markets will paper that over. Energy companies,  ...\n      On the flip side, clear beneficiaries of the current upheaval are doing well. Five mega-tech companies – Amazon, Apple, Microsoft, Facebook and Google – alone make up $5 trillion of market cap, and Amazon in particular has seen its stock go  up more than 30% since mid-March. Costco and Clorox have seen booming business along with Walmart, as has the video conference company Zoom.\n    So while markets are not moving on real-time economic fundamentals, they are moving on reasonable judgements of fundamentals going forward and distinguishing between industries that look to be hardest hits from those that might even benefit from the dramatic economic dislocations that COVID-19 responses are creating. If everything were going up indiscriminately, that would indicate markets were fully detached. There are not.\n  And for those who –understandably –might see all of this as yet further proof that once again, the financial world will get saved at the expense of tens of millions of real people and millions of small companies will get sacrificed, this time it is different. The Fed, for instance, is committed to purchasing hundreds of billions of dollars of municipal bonds at favorable rates, which will mean that cash-strapped state governments should be able to retain teachers and policemen  ...\n  So while it appears crazy that markets are doing relatively well as the world economy burns down, there is a method to the madness that reflects some potentially positive realities of an otherwise dire time. That may be small comfort just now, but it is a clear reminder that as bad as things are just now, they actually could be considerably worse.\n      Check the box if you do not wish to receive promotional offers via email from TIME.\n  You can unsubscribe at any time. By signing up you are agreeing to our  Terms of Use and  Privacy Policy\n    For your security, we&#39;ve sent a confirmation email to the address you entered. Click the link to confirm your subscription and begin receiving our newsletters. If you don&#39;t get the confirmation within 10 minutes, please check your spam folder.\n    TIME Ideas hosts the world&#39;s leading voices, providing commentary on events in news, society, and culture. We welcome outside contributions. Opinions expressed do not necessarily reflect the views of TIME editors.", "posttime": "2020-05-02 17:57:24", "tags": "股市,崩溃,recovering,markets", "title": "在经济崩溃的同时，股市正在复苏", "title_en": "Stocks Are Recovering While the Economy Collapses", "transed": 0, "url": "https://time.com/5828898/stocks-recovering-economy-collapses-makes-sense/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["股市", "崩溃", "markets"]}, {"category": "", "categoryclass": "", "imagename": "ea2a51b4ba4a7682e6fd838f4ba9ad3f.jpg", "infoid": 1000190, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在4月20日反对田纳西州封锁的抗议活动中，一块标语上写着“S”，尽管拿着标语的人是否在拖拽其他抗议者还不得而知。一些人声称社交距离是没有意义的，因为冠状病毒的老年受害者很快就会死于其他原因。在英国，许多权威人士表示，该国三分之二的死者在去世一年内就已经去世了。他们引用了伦敦帝国理工学院流行病学家尼尔·弗格森(Neil Ferguson)在3月份做出的一项估计，他建议.。\n弗格森指出，三分之二是他估计的上限，而实际比例可能要低得多。他说，“很难”衡量冠状病毒的受害者在感染前的病情有多严重，以及如果不是这样，他们可能会活多久。然而，一项由一组苏格兰大学的研究人员进行的研究试图做到这一点。他们发现，去世的英国人或意大利人的平均寿命可能在11年左右，这意味着冠状病毒的受害者中很少有人死于冠状病毒。\n首先，作者分析了6801名意大利受害者的数据，为了保密，按年龄和性别分组。约40%的男性年龄在80岁以上，60%的女性也是如此。(该病毒导致女性死亡的人数比男性少，可能是因为他们的免疫反应不同。)。作者排除了50岁以下1%的受害者。然后，他们计算出这些队列通常还能活多久。老年人的预期寿命令人惊讶地高，即使他们有潜在的条件，因为许多。\n然后，作者解释了受害者患有的其他疾病，以防他们相对于他们的年龄来说异常虚弱。对于710名意大利人，他们可以看到有多少人患有特定的长期疾病，如高血压或癌症。作者使用了一个较小的苏格兰样本来估计每种疾病组合在冠状病毒受害者中发生的频率。最后，他们分析了85万威尔士人的数据，以预测具有给定年龄和一系列条件的人通常能活多久。\n引人注目的是，研究表明，在这种混合的欧洲模式中，死于冠状病毒的人潜在疾病的发病率只比他们同龄人中的其他人略高。当作者对先前存在的疾病进行调整，然后使用正常的意大利预期寿命模拟死亡时，s仅略有下降，男性为11.1，女性为10.2。(英国人的工资略低。)。整整20%的死者都是相当健康的人，年龄在50多岁和60多岁之间，他们预计会活下来……。\n研究人员警告说，他们的数据不包括死于疗养院的人，他们可能病得特别重。它们也不能说明潜在疾病的严重程度。例如，冠状病毒受害者可能患有特别急性的肺病或心脏病。更完整的数据可能会产生更低的s估计值。弗格森还指出，全因死亡率的统计将包含线索。如果大流行只是加速了迫在眉睫的死亡，那么一次应该比往常少一次…。\n尽管如此，现有的证据表明，许多冠状病毒受害者以前离死亡之门很远，至少比他们的死亡时间早了十年。允许病毒自由传播将牺牲强者和弱者。。\n资料来源：冠状病毒-探索长期条件类型和多发病程度对寿命损失年数的影响：建模研究，由P Hanlon，F Chadwick，A Shah等人，2020年；Istituto Superiore di Sanità(意大利)；SAIL数据库(威尔士)；苏格兰公共卫生。\n这篇文章出现在印刷版的图片细节部分，标题下，在他们的时间&#34；；", "note_en": "“S   ”, urged a sign at a protest against Tennessee ’s lockdown on April 20th —though whether the person holding it was trolling the other protesters is unknown. Some claim social distancing is pointless, since covid-19 ’s elderly victims would soon have died of other causes. In Britain many pundits have said that two-thirds of the country ’s dead were already within a year of passing away. They cite an estimate made in March by Neil Ferguson, an epidemiologist at Imperial College London who advises  ...\n Mr Ferguson notes that two-thirds was the upper bound of his estimate, and that the real fraction could be much lower. He says it is “very hard” to measure how ill covid-19’s victims were before catching it, and how long they might have lived otherwise. However, a study by researchers from a group of Scottish universities has attempted to do so. They found that the years of life lost ( s) for the average Briton or Italian who passed away was probably around 11, meaning that few of covid-19 ’s victims  ...\n First the authors analysed data for 6,801 Italian victims, grouped by age and sex for confidentiality. About 40% of men were older than 80, as were 60% of women. (The virus has killed fewer women than men, perhaps because they have different immune responses.) The authors excluded the 1% of victims under 50. Then they calculated how much longer these cohorts would normally survive. Life expectancies for old people are surprisingly high, even when they have underlying conditions, because many of  ...\n Then the authors accounted for other illnesses the victims had, in case they were unusually frail for their age. For 710 Italians, they could see how many had a specific long-term condition, such as hypertension or cancer. The authors used a smaller Scottish sample to estimate how often each combination of diseases occurs among covid-19 victims. Finally, they analysed data for 850,000 Welsh people, to predict how long somebody with a given age and set of conditions would normally live.\n    Strikingly, the study shows that in this hybrid European model, people killed by covid-19 had only slightly higher rates of underlying illness than everyone else their age. When the authors adjusted for pre-existing conditions and then simulated deaths using normal Italian life expectancies, the  s dropped just a little, to 11.1 for men and 10.2 for women. (They were slightly lower for Britons.) Fully 20% of the dead were reasonably healthy people in their 50s and 60s, who were expected to live  ...\n The researchers warn that their data exclude people who died in care homes, who might have been especially sickly. Nor can they account for the severity of underlying illnesses. For example, covid-19 victims might have had particularly acute lung or heart conditions. More complete data could produce a lower estimate of  s. Mr Ferguson also points out that tallies of all-cause mortality will contain clues. If the pandemic has merely hastened imminent deaths, there should be fewer than usual once  ...\n Still, the available evidence suggests that many covid-19 victims were far from death’s door previously, and cut down at least a decade before their time. Allowing the virus to spread freely would sacrifice the strong as well as the weak.  ■\n Sources: &#34;Covid-19 – exploring the implications of long-term condition type and extent of multimorbidity on years of life lost: a modelling study&#34;, by P Hanlon, F Chadwick, A Shah et al., 2020; Istituto Superiore di Sanità (Italy); SAIL Databank (Wales); Public Health Scotland\n  This article appeared in the Graphic detail section of the print edition under the headline &#34;Before their time&#34;", "posttime": "2020-05-02 17:57:19", "tags": "病毒,冠状病毒,受害者,died,victims", "title": "如果没有这种病毒，大多数冠状病毒受害者会很快死亡吗？", "title_en": "Would most Covid-19 victims have died soon, without the virus?", "transed": 0, "url": "https://www.economist.com/graphic-detail/2020/05/02/would-most-covid-19-victims-have-died-soon-without-the-virus", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["病毒", "冠状病毒", "受害者", "died", "victims"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000189, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "想象一下软件开发人员、制造商和计算机科学专业人员使用计算机作为发现和创造工具的操作系统。欢迎来到Pop！_OS。", "note_en": "Imagine an OS for the software developer, maker and computer science professional who uses their computer as a tool to discover and create. Welcome to Pop!_OS.", "posttime": "2020-05-02 17:57:17", "tags": "pop,来到,computer", "title": "POP OS 20.04 LTS", "title_en": "Pop OS 20.04 LTS", "transed": 0, "url": "https://pop.system76.com/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["pop", "来到", "computer"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000188, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "用CNC将塑料包装上的样品拆封、铣模，然后用104%的沸腾发烟硫酸进行蚀刻。\n对原Verilog HDL模型进行仿真调试，在模型上运行PDP-11出厂测试软件。\n计划在以下开发工具包上运行同步模型(以及要包括在repo中的适当示例项目)：", "note_en": "sample decapsulating, milling die from the plastic package with CNC, then etching with 104 percents boiling oleum\n           simulating and debug the original Verilog HDL model, running PDP-11 factory test software on the model\n    The synchronous models are planned to be run (and appropriate sample projects to be included in repo) on the following Development Kits:", "posttime": "2020-05-02 17:57:14", "tags": "设计,古代,ancient,模型,model", "title": "重新设计的古代PDP-11 CPU、原件和克隆", "title_en": "Revengineered ancient PDP-11 CPUs, originals and clones", "transed": 0, "url": "https://github.com/1801BM1/cpu11", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["设计", "古代", "ancient", "模型", "model"]}, {"category": "", "categoryclass": "", "imagename": "ad8420e2a080114430cd053434547946.jpg", "infoid": 1000187, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本世纪初，布兰登·桑德迈尔(Brandon Sandmaier)在加拿大阿尔伯塔省北部的世界上最大的工业项目--沥青砂厂担任重型机械师。他修建了管道，修理了400吨的卡车，这些卡车在露天矿中运送厚厚的油性沥青。但在石油和天然气行业工作了10多年后，桑德迈尔在2014年重返学校学习替代能源。他知道他最终想要开始自己的生意，他看到了太阳能行业的增长潜力。他现在..。\n杰克·库比斯基(Jack Kubiski)2015年去哥斯达黎加度假时，在艾伯塔省的石油行业担任电工，目睹了那里可再生能源的蓬勃发展。回到家乡后，他决定在艾伯塔省开始一项清洁能源业务，那里的清洁能源行业还处于萌芽状态。现在是埃德蒙顿太阳能承包商Kuby Renewable Energy的所有者和首席执行官，他已经雇佣了大约10名在化石燃料行业有工作经验的员工。“艾伯塔省的油气田员工训练有素，……。\n桑德迈尔和库比斯基的业务是艾伯塔省不断增长的可再生能源部门的一部分-在这个被描述为石油国家的省份，这不太可能是生命的萌芽。几十年来，艾伯塔省的经济主要是开采其巨大的沥青砂中的粘性沥青，这些沥青砂拥有仅次于沙特阿拉伯和委内瑞拉的世界第三大石油储量。但自2014年油价暴跌以来，艾伯塔省的沥青砂已经失去了大约3.5万个工作岗位，很可能是永久性的。现在，加拿大人..。\n随着艾伯塔省的石油和天然气行业陷入长期低迷，石油行业的工人开始将目光投向可再生能源行业，以弥补沥青砂正在减少的工作岗位。一些非营利性和经济发展机构正在开始再培训计划，为前油田员工在太阳能和风能领域工作做准备。安德里亚·维瑟说：“大多数向我们伸出援手的员工都经历过一次、两次、三次繁荣-萧条周期。”\n桑德迈尔说，越来越多的石油工人联系他，探索在可再生能源领域工作。“如果有机会，”他说，“他们会抓住的。”\n代表艾伯塔省许多石油和天然气工人的工会Unifor的全国代表罗德·伍德(Rod Wood)表示，尽管能源行业中有一些有远见的人，但许多人仍然抵制变革。但他表示，随着沥青砂行业继续受到打击，减缓气候变化的斗争愈演愈烈，能源转型是不可避免的。“过渡将会发生，”伍德说，不管艾伯塔省人是否做好了准备。“我想……。\n根据加拿大能源监管机构的数据，艾伯塔省目前约10%的发电量来自可再生能源。然而，可再生能源增长迅速：从2005年到2018年，艾伯塔省的可再生电力装机容量几乎翻了一番，从1484兆瓦增加到2825兆瓦。该省目前正在建设1300多兆瓦的可再生能源项目。\n艾伯塔省政府表示，该省有8100人担任太阳能安装工，3200人担任风力涡轮机技术人员。据估计，艾伯塔省可再生能源部门的直接和间接就业总数为2.6万个就业岗位，两家咨询公司索拉斯能源咨询公司(Solas Energy Consulting)和德尔福集团(Delphi Group)预测，到2030年，艾伯塔省可再生能源部门可能会创造多达2万个新的就业机会。截至2018年，艾伯塔省的石油和天然气行业雇佣了153，000人，这个数字…。\n石油和天然气工人的再培训计划正在进行中，尽管速度很慢。非营利公司卡尔加里经济发展公司(Calgary Economic Development)最近启动了一项耗资110万美元的计划，将失业的石油和天然气专业人员转变为数字技术工作，如软件开发和编程，这些工作可用于各种能源行业。铁电地球公司将在今年晚些时候推出三个项目，对石油和天然气工人进行太阳能和风能方面的培训。这群人..。\n长期以来，石油一直是艾伯塔省经济的命脉。2018年，油砂的日产量为290万桶，约占加拿大总产量的三分之二。本世纪初，来自全国各地的人们蜂拥至油砂繁荣的震中麦克默里堡，赚取六位数的工资。沥青砂公司找不到足够的工人。然后，油价在2014年崩盘并保持在低位，部分原因是美国边境以南的水力压裂热潮。更多的..。\n撰写这份报告的帕克兰研究所(Parkland Institute)研究经理伊恩·赫西(Ian Hussey)表示，这些工作岗位可能不会回来了。面对紧缩的预算，石油公司已经改变了运营方式，以降低成本。2018年，油砂开采公司森科尔(Suncor)淘汰了所有在其一个矿山操作重型卡车的司机，取而代之的是无人驾驶卡车。该公司现在是复制品", "note_en": "In the early 2000s, Brandon Sandmaier worked as a heavy-duty mechanic in Canada ’s tar sands, the world ’s largest industrial project, located in northern Alberta. He built pipelines and repaired 400-ton trucks that haul thick, oily bitumen through the open-pit mines. But after more than 10 years in the oil and gas industry, Sandmaier went back to school to study alternative energy in 2014. He knew he wanted to eventually start his own business and he saw potential for growth in solar. He now  ...\n Jake Kubiski was working as an electrician in Alberta ’s oil industry when he went on vacation to Costa Rica in 2015 and saw how renewable energy was booming there. Returning home, he decided to start a clean energy business in Alberta, where the industry was still nascent. Now the owner and CEO of Kuby Renewable Energy, an Edmonton-based solar contractor, he has hired about 10 staff with work experience in the fossil fuel industry. “Alberta oil and gas field employees are extremely well-trained,  ...\n Sandmaier and Kubiski’s businesses are part of a growing renewable energy sector in Alberta — unlikely shoots of life in a province that has been described as a petrostate. For decades, Alberta’s economy was dominated by the exploitation of viscous bitumen in its vast tar sands, which hold the world’s  third-largest oil reservesbehind Saudi Arabia and Venezuela. But since oil prices crashed in 2014, about 35,000 jobs in Alberta ’s tar sands have been lost, likely for good. Now, the Canadian  ...\n    As Alberta ’s oil and gas industry comes to grips with a long-lasting downturn, workers in the oil industry are beginning to look to the renewable energy sector to make up for the jobs being shed in the tar sands. A handful of nonprofit and economic development agencies are starting retraining programs to prepare former oilfield hands to work in solar and wind power. “Most of the workers that reach out to us have been through boom-bust cycles once, twice, three times, ”says Andrea Visser,  ...\n Sandmaier says more oil workers are reaching out to him to explore working in renewables. “If presented with an opportunity,” he says, “they would take it.”\n Rod Wood, national representative for the labor union, Unifor, which represents many oil and gas workers in Alberta, says that although there are a few forward-looking people in the energy industry, many remain resistant to change. But he says that as the tar sands industry continues to be buffeted and as the fight to slow climate change gathers momentum, an energy transition is inevitable. “The transition is going to occur, ”says Wood, whether Albertans are ready for it or not. “I think  ...\n Around 10 percent of Alberta’s electricity generation currently comes from renewable energy sources, according to the  Canada Energy Regulator. However, renewables are growing fast: From 2005 to 2018, Alberta’s installed renewable electricity capacity  nearly doubled, from 1,484 megawatts to 2,825 megawatts. More than 1,300 megawatts of renewable energy projects are now under construction in the province.\n     The Alberta government says that  8,100 people in the province work as solar installers and  3,200 people as wind turbine technicians. By one estimate, direct and indirect employment in Alberta’s renewable energy sector totals  26,000 jobs, and two consulting firms,  Solas Energy Consulting and  the Delphi Group, forecast that as many as 20,000 new jobs may be created in Alberta’s renewable energy sector by 2030. As of 2018, Alberta’s oil and gas industry employed  153,000 people, a number that  ...\n Programs to retrain oil and gas workers are getting underway, albeit slowly. A non-profit corporation, Calgary Economic Development, recently started a U.S. $1.1 million program to transition unemployed oil and gas professionals to jobs in digital technology, such as software development and programming, which can be used in a variety of energy industries. And Iron &amp; Earth is rolling out three programs to train oil and gas workers in solar and wind energy later this year. The group  ...\n     Oil has long been the lifeblood of Alberta’s economy. In 2018, the oil sands produced  2.9 million barrels per day, about two-thirds of Canada ’s total production. In the early 2000s, people from across the country flocked to Fort McMurray, the epicenter of the oil sands boom, to make six-figure salaries. Tar sands companies could not find enough workers. Then, oil prices crashed in 2014 and stayed low, in part because of the fracking boom south of the border in the United States. More  ...\n Those jobs are likely not coming back, according to Ian Hussey, research manager at the Parkland Institute, who wrote the report. Facing tighter budgets, oil companies have changed the way they operate to reduce costs. Suncor, an oil sands mining company, eliminated all drivers that operate massive haul trucks in one of its mines in 2018 and replaced them with driverless trucks. The company is now replicating that model at its other mines and is expecting to cut 400 drivers by 2023.  ...\n    As pressure grows to reduce greenhouse gas emissions, forces from outside Alberta are also threatening the oil sands, whose thick bitumen requires an extraction and refining process that produces more greenhouse gases than conventional oil. In recent months, major financial institutions — from Sweden’s central bank to the world’s largest asset manager, Blackrock — have  shifted away from investing in Alberta’s fossil fuel industrydue to its climate impacts. And in February, Teck  ...\n The global economic recession created by the coronavirus has further darkened the outlook for the tar sands industry. As companies slash their spending and delay projects, Alberta’s oil and gas sector is seeing hundreds of layoffs and thousands of jobs put on hold.\n While the majority of oil workers are not eager to switch careers, many see the writing on the wall. “There’s a recognition that they work in an industry that’s part of the problem,” says Jamie Kirkpatrick, program manager at  Blue Green Canada, an alliance among labor unions, environmental groups, and civil society organizations that advocates for working people and the environment. However, he says, switching to other sectors can be unappealing since it often means taking a sizeable  ...\n While acknowledging the contribution of fossil fuels to people ’s livelihoods, Iron &amp; Earth is heading campaigns asking for federal and provincial government support to retrain fossil fuel workers and create more jobs in renewable energy. More than 5,000 people have signed the organization ’s pledge to “stand with fossil fuel workers calling for training in renewable energy. ”Iron &amp; Earth has already retrained a small number of fossil fuel workers and members of the Louis  ...\n     The Calgary Economic Development project is aimed at transitioning displaced oil and gas professionals, such as engineers and geoscientists, into the technology sector. The federally funded project is focused on Calgary, a hub for major oil companies that has been hit hard by the oil downturn. The program, which offers six months of free training, accepted 50 students in its first round, although 500 people applied. Another 50 students will take part in a second round of training  ...\n The previous left-of-center Alberta government bolstered clean-energy growth by pledging to generate 30 percent of the province’s electricity from renewables by 2030. The province provided incentives to homeowners and businesses for solar installation and held three auctions for renewable power projects in 2017 and 2018, leading to the ongoing construction of 1,360 megawatts of renewable energy capacity.\n However, the current conservative government scrapped these programs when it came to power last year. Estimates now are that by 2030 renewables are likely to provide 19 percent of the province’s electricity, doubling current generation, according to  one forecast.\n    Market forces are increasingly driving renewables growth in the province. Several major projects have secured funding from private investors despite the lack of support by the provincial government. A 400-megawatt  solar project, the largest in the country, received $500 million in backing from a Danish investment group earlier this year, and a North American energy company, TC Energy, agreed to buy more than half of the electricity generated by a 130-megawatt solar project  ...\n The recovery period that follows the current coronavirus-related swoon in the oil industry could be an opportunity to pivot to a new energy future in Alberta, Wood, the labor official, says. In March, the federal government said it was preparing a multibillion-dollar bailout for the struggling oil and gas industry. In response, 256 academics across Canada signed  a letterto Prime Minister Justin Trudeau urging the government to “support an economic recovery plan that encompasses  ...\n     For now, oil is still king. Less than two miles from Sandmaier’s solar company, refineries continue to process more than 300,000 barrels a day. “We cannot just continue to prop up [the fossil fuel] industry,” he says. “We have to look at what industries do have hope.”", "posttime": "2020-05-02 17:57:08", "tags": "寻找,industry,艾伯塔省,oil", "title": "随着石油行业的低迷，沥青砂工人将目光投向可再生能源以寻找就业机会", "title_en": "As oil industry swoons, tar sands workers look to renewables for jobs", "transed": 0, "url": "https://e360.yale.edu/features/as-oil-industry-swoons-tar-sands-workers-look-to-renewables-for-jobs", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["寻找", "industry", "艾伯塔省", "oil"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000186, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "威廉·莎士比亚被广泛认为是有史以来最伟大的作家之一，也是有史以来最重要、最有影响力的人物之一。他的作品(戏剧、十四行诗和诗歌)已被翻译成100多种语言，并在世界各地演出。\n人们也有一种持久的愿望，想要更多地了解这个人自己。关于莎士比亚生平的书籍和文章不计其数。这些主要是基于对他的作品的学术分析以及与他和他的家庭相关的官方记录。尽管莎士比亚的生平故事和围绕他的作者和身份的争论存在不确定性，但他的受欢迎程度和遗产仍然存在。\n威廉·莎士比亚和他的家人的生平和时代最近也通过尖端的考古方法和跨学科技术在New Place(他长期被拆除的家庭住宅)和他在斯特拉特福德河畔圣三一教堂的墓地都得到了了解。斯塔福德郡大学考古中心从这些调查中收集的证据为他的兴趣、态度和动机-以及他的家人的兴趣、态度和动机提供了新的见解，并显示出.。\n考古学有能力通过与之相关的地点和物体与个人建立直接联系。过去对伦敦莎士比亚时代剧院的发掘提供了他工作和度过大部分时间的地方的证据。\n很难将物品归因于莎士比亚，我们当然有他的书面作品，他的肖像和半身像-但他所有已知的财产，就像他遗嘱中提到的那样，都不复存在了。一枚刻有W S首字母的金色印章戒指，被一些人认为是诗人拥有和使用的最重要的物品，尽管它的来源值得怀疑。\n莎士比亚最伟大和最昂贵的财产是他的房子“新地方”。通过最近对其基础的考古调查获得的证据，给了我们对莎士比亚的思想过程、个人生活和商业成功的量化洞察力。\n这座建筑本身在18世纪就消失了，但遗址和遗迹被保存在一个花园下面。它建在埃文河畔斯特拉特福德的中心，早在1597年莎士比亚购买它的一个多世纪之前，从它开始的时候，它的建筑就很引人注目。这是斯特拉特福德最大的住宅之一，也是镇上唯一的庭院式露天大厅住宅。\n这种类型的房子是商人和精英阶层的典型代表，莎士比亚按照自己的愿景购买和翻新房子的过程中，继承了他祖先的传统，同时拥抱了最新的时尚。所用的建筑材料、主要结构和后来的重建，都可以证明他和他的家人做出了深思熟虑和深思熟虑的选择。\n莎士比亚把重点放在房子的外观上，安装了一个长廊和其他时髦的建筑装饰品，这是当时富裕、有抱负的绅士所期待的。许多其他的中世纪特色被保留了下来，这个大厅很可能被保留下来作为他的家的展示品，一个宣布他的繁荣和地位上升的地方。\n它为他和他的直系亲属和大家庭提供了一个生活、工作和娱乐的地方。但它也是一个具有地方意义和象征性联想的地方。有趣的是，它的外观也类似于伦敦和其他地方莎士比亚非常熟悉的四合院客栈剧院，提供了举办私人表演的机会。\n在考古调查中发现了莎士比亚、他的家人和新广场居民个人财产、饮食和休闲活动的广泛证据，彻底改变了我们对他日常生活的理解。\n定于2020年5月初推出的一个在线展览，展示了在New Place遗址发现的3D扫描文物。这些文物，其中一些可能属于莎士比亚，已经被选择来描述在该遗址进行的时间发展和活动的特征。\n对这些虚拟物体的开放访问将使这些重要成果得以传播，并使其他人有可能继续这项研究。\n在莎士比亚墓地进行的非侵入性调查中发现的考古证据也被用来提供他个人和家庭信仰的进一步证据。利用多频探地雷达(GPR)对圣三一教堂下摆下的莎士比亚家族坟墓进行了调查。\n许多传说围绕着莎士比亚的墓地。其中包括对坟墓的存在及其内容的怀疑，盗墓的故事，以及关于大型家族墓穴的建议。这项工作证实了墓碑下存在着个别的浅坟墓，沙族的各个成员", "note_en": "William Shakespeare is widely regarded as one of the greatest authors of all time and one of the most important and influential people who has ever lived. His written works (plays, sonnets and poems) have been translated into more than 100 languages and these are performed around the world.\n There is also an enduring desire to learn more about the man himself. Countless books and articles have been written about Shakespeare’s life. These have been based primarily on the scholarly analysis of his works and the official record associated with him and his family. Shakespeare’s popularity and legacy endures, despite  uncertainties in his life story and debate surrounding  his authorship and identity.\n The life and times of William Shakespeare and his family have also recently been informed by cutting-edge archaeological methods and interdisciplinary technologies at both New Place (his long-since demolished family home) and his burial place at Holy Trinity Church, Stratford-upon-Avon. The  evidence gathered from these investigationsby the Centre of Archaeology at Staffordshire University provides new insights into his interests, attitudes and motivations –and those of his family –and shows  ...\n Archaeology has the ability to provide a direct connection to an individual through the places and objects associated with them. Past excavations of the  Shakespearean-era theatres in London have provided evidence of the  places he worked and spent much of his time.\n Attributing objects to Shakespeare is difficult, we have his written work of course,  his portrait(s) and  memorial bust – but all of his known possessions, like those  mentioned in his will, no longer exist. A single gold signet ring, inscribed with the initials W S, is thought by some to be the most significant object owned and used by the poet, despite its  questionable provenance.\n  Shakespeare’s greatest and most expensive possession was his house, New Place. Evidence, obtained through  recent archaeological investigations of its foundations, give us quantifiable insights into Shakespeare’s thought processes, personal life and business success.\n The building itself was lost in the 18th century, but the site and its remains were preserved beneath a garden. Erected in the centre of Stratford-upon-Avon more than a century prior to Shakespeare’s purchase in 1597, from its inception, it was architecturally striking. One of the largest domestic residences in Stratford, it was the only courtyard-style, open-hall house within the town.\n  This type of house typified the merchant and elite classes and in purchasing and renovating it to his own vision, Shakespeare inherited the traditions of his ancestors while embracing the latest fashions. The building materials used, its primary structure and later redevelopment can all be used as evidence of the  deliberate and carefully considered choices made by him and his family.\n Shakespeare focused on the outward appearance of the house, installing a long gallery and other fashionable architectural embellishments as was expected of a well-to-do, aspiring gentleman of the time. Many other  medieval features were retained and the hall was likely retained as the showpiece of his home, a place to announce his prosperity, and his rise in status.\n It provided a place for him and his immediate and extended family to live, work and entertain. But it was also a place which held local significance and symbolic associations. Intriguingly, its appearance also resembled the courtyard inn theatres of London and elsewhere with which Shakespeare was so familiar, presenting the opportunity to host private performances.\n   Extensive evidence of the personal possessions, diet and the leisure activities of Shakespeare, his family and the inhabitants of New Place were recovered during the archaeological investigations, revolutionising what we understand about his day-to-day life.\n An  online exhibition, due to be made available in early May 2020, presents 3D-scanned artefacts recovered at the site of New Place. These objects, some of which may have belonged to Shakespeare, have been chosen to characterise the chronological development and activities undertaken at the site.\n  Open access to these virtual objects will enable the dissemination of these important results and the potential for others to continue the research.\n  Archaeological evidence recovered from non-invasive investigations at Shakespeare’s burial place has also been used to provide further evidence of his personal and family belief. Multi-frequency Ground Penetrating Radar (GPR) was  used to investigate the Shakespeare family graves below the chancel of Holy Trinity Church.\n A  number of legendssurrounded Shakespeare ’s burial place. Among these were doubts over the presence of a grave, its contents, tales of grave robbing and suggestions of a large family crypt. The work confirmed that individual shallow graves exist beneath the tombstones and that the various members of Shakespeare ’s family were not buried in coffins, but in simple shrouds. Analysis concluded that Shakespeare ’s grave had been disturbed in the past and that it was likely that his  ...\n  These family graves occupy a significant (and expensive) location in Holy Trinity Church. Despite this, the simple nature of Shakespeare’s grave, with no elite trappings or finery and no large family crypt, coupled with his belief that he should not be disturbed, confirm a simple regional practice based on pious religious observance and an affinity with his hometown.\n    There is still so much we don’t know about Shakespeare’s life, so it’s a safe bet that researchers will continue to investigate what evidence there is. Archaeological techniques can provide quantifiable information that isn’t available through traditional Shakespearean research. But just like other disciplines, interpretation – based on the evidence – will be key to unlocking the mysteries surrounding the life (and death) of the English language’s greatest writer.", "posttime": "2020-05-02 17:57:03", "tags": "revealing,莎士比亚,shakespeare", "title": "考古学正在揭示有关莎士比亚生死的新线索", "title_en": "Archaeology is revealing new clues about Shakespeare's life and death", "transed": 0, "url": "https://theconversation.com/william-shakespeare-archaeology-is-revealing-new-clues-about-the-bards-life-and-death-136803", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["revealing", "莎士比亚"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000184, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然这是一本关于Hy Lisp语言的书，但我们在这里有一个更广泛的主题。在一个人工智能(AI)是最大的公司和政府机构的驱动力的时代，问题是考虑到规模小的缺点，个人和小组织如何利用人工智能技术。我选择在这里写的材料是为了帮助你，亲爱的读者，像一条健康的小鱼在大纽带中生存下来。\n除了作为使用Hy语言的教程和食谱之外，更长的示例还将探索各种不同的应用程序和工具。这本书目前的结构是：\n马克·沃森(Mark Watson)是一名顾问，专门从事深度学习、机器学习和通用人工智能软件开发。他使用Python、Common Lisp、Java、Clojure、Haskell和Ruby进行开发。\n他出版了23本关于人工智能、深度学习、Java、Ruby、机器学习、Common LISP、Clojure、JavaScript、语义Web、NLP、C++、Linux和Scheme的书籍。\n马克的咨询客户名单包括：谷歌、Capital One、CompassLabs、迪士尼、Sitescout.com、Embed.ly和WebMind公司。\n序言这本书如何反映我对人工智能和社会和技术的未来的看法。\nHy语言加分简介：用于在Hy REPL和Shell中以内联方式生成绘图的MacOS和ITerm2的配置。\n为什么是里斯普？我讨厌20世纪70年代的瀑布方法，但我学会了喜欢自下而上的编程风格。\n基于LSTM递归神经网络的深度学习生成类似哲学家尼采著作的英文文本。\n作者在Leanpub上写作、出版和销售的收入为8，827，455美元，版税占80%，同时节省了多达2500万磅的二氧化碳和多达4.6万棵树。了解更多关于在Leanpub上写作的信息。\n在购买后45天内，您只需点击两次即可获得任何Leanpub购买的100%退款。请参阅完整条款。\n如果你买了一本Leanpub的书，只要作者更新了这本书，你就可以获得免费的更新！许多作者在写作时使用Leanpub出版他们正在出版的书籍。所有读者都会得到免费的更新，无论他们是什么时候买的这本书，也不管他们花了多少钱(包括免费)。大多数Leanpub图书都有PDF格式(适用于电脑)、EPUB格式(适用于手机和平板电脑)和MOBI格式(适用于Kindle)。图书包含的格式显示在此页面的右上角。最后，Leanpub..。", "note_en": "While this is a book on the Hy Lisp language, we have a wider theme here. In an age where artificial intelligence (AI) is a driver of the largest corporations and government agencies, the question is how do individuals and small organizations take advantage of AI technologies given disadvantages of small scale. The material I choose to write about here is selected to help you, dear reader, survive as a healthy small fish in a big bond.\n  In addition to being a tutorial and cookbook on using the Hy language, longer examples explore a variety of different applications and tools. The current structure of the book is:\n Mark Watson a consultant specializing in deep learning, machine learning, and general artificial intelligence software development. He uses Python, Common Lisp, Java, Clojure, Haskell, and Ruby for development.\n He is the author of 23 published books on Artificial Intelligence, Deep Learning, Java, Ruby, Machine Learning, Common LISP, Clojure, JavaScript, Semantic Web, NLP, C++, Linux, and Scheme.\n Mark&#39;s consulting customer list includes: Google, Capital One, CompassLabs, Disney, Sitescout.com, Embed.ly, and Webmind Corporation.\n   Preface  How This Book Reflects My Views on Artificial Intelligence and the Future of Society and Technology\n  Introduction to the Hy Language  Bonus Points: Configuration for macOS and ITerm2 for Generating Plots Inline in a Hy REPL and Shell\n  Why Lisp?  I Hated the Waterfall Method in the 1970s but Learned to Love a Bottom-Up Programming Style\n      Deep Learning  Using a LSTM Recurrent Neural Network to Generate English Text Similar to the Philosopher Nietzsche’s writing\n Authors have earned  $8,827,455writing, publishing and selling on Leanpub, earning   80% royalties while saving up to   25 million pounds of CO2 and up to   46,000 trees.     Learn more about writing on Leanpub\n Within  45 days of purchase you can get a  100% refund on any Leanpub purchase, in  two clicks.    See full terms\n If you buy a Leanpub book, you get free updates for as long as the author updates the book! Many authors use Leanpub to publish their books in-progress, while they are writing them. All readers get free updates, regardless of when they bought the book or how much they paid (including free).  Most Leanpub books are available in PDF (for computers), EPUB (for phones and tablets) and MOBI (for Kindle). The formats that a book includes are shown at the top right corner of this page.  Finally, Leanpub  ...", "posttime": "2020-05-02 17:56:55", "tags": "程序,编程,programming language,python,programmer", "title": "生活在Python王国的Lisp程序员：Hy编程语言", "title_en": "A Lisp Programmer Living in Python-Land: The Hy Programming Language", "transed": 0, "url": "https://leanpub.com/hy-lisp-python", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["程序", "编程", "language", "python"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000183, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最新消息：I/O引擎现已推出！我们已经部分发布了这项工作中使用的源代码。您可以在此处找到英特尔82598/82599网卡的用户级数据包I/O引擎。到目前为止，我们还没有一个明确的发布计划来发布PacketShader代码的其他部分，这些代码还没有在网络上提供。\nPacketShader是一款基于PC的高性能软件路由器平台，可通过图形处理单元(GPU)加速核心数据包处理。基于CPU是高速软件路由器中典型的性能瓶颈的观察，我们使用大规模并行GPU以经济高效的方式扩展计算能力。PacketShader将计算和内存密集型路由器应用程序卸载到GPU，同时优化Linux上的数据包接收和传输路径。..。\n众所周知，GPU是显卡的中央芯片。GPU通过支持数万个硬件线程和充足的内存带宽，实现了高水平的处理并行性。除了快速的图形渲染，最新的GPU被广泛用于高性能并行应用程序，这些应用程序的工作负载需要巨大的计算周期和/或内存带宽。GPU的数据并行执行模型很好地符合大多数路由器应用程序固有的并行性。\n我们为用户级应用实现了高性能的包I/O引擎。该项目正在单独维护，源代码现已公开。当前可用的Linux网络堆栈没有针对高性能IP数据包处理进行优化，例如，对于多10G网络。为了实现高速软件路由器和更好地利用GPU，我们通过以下方法优化了Linux中的数据包I/O路径。\n巨大的数据包缓冲区：PacketShader没有为每个数据包接收分配元数据(SK_BUFF或SKB)和数据包数据，而是预先分配了两个循环缓冲区，可以容纳大量的元数据和数据包数据。这大大降低了高速分组接收的存储器分配/释放开销。\n批处理：PacketShader在硬件、设备驱动程序甚至应用层一次批处理一组数据包。这会摊销每个数据包的处理开销。\n支持NUMA的数据放置：PacketShader在非一致内存访问(NUMA)系统中最大限度地减少了本地和远程内存之间的数据包移动。NIC接收的数据包由其本地CPU和内存处理。\n多核CPU可伸缩性：PacketShader利用接收端伸缩(RSS)来消除访问NIC队列时的锁定争用。它还通过将RX队列的起始地址与缓存行边界对齐来消除与CPU缓存的虚假共享问题。最后，它去掉了全局的.。\n通过我们的数据包I/O优化，我们能够在用户级别运行数据包处理，即使是在多个10G路由器工作负载的情况下也是如此。\n图1显示了我们优化的数据包I/O引擎的性能。RX+TX条形图表示无操作转发的情况，即在不进行进一步处理的情况下将数据包从一个端口传输到另一个端口。\n我们基于数据包I/O引擎实现了四个路由器应用程序：IPv4转发、IPv6转发、OpenFlow交换机和IPsec隧道。以下四个图表比较了纯CPU实施和GPU加速实施的吞吐量。表演结果清楚地表明..。\n对于IP转发，我们将最长前缀匹配卸载到GPU。转发表查找占用大量内存，GPU可以同时提高延迟隐藏能力和带宽。\n在我们的工作中，OpenFlow和IPsec代表了软件路由器的计算密集型工作负载。我们已经确认计算密集型应用程序可以从GPU和内存密集型应用程序中获益。\n我们的原型实施使用两个四核Intel Nehalem CPU(2.66 GHz)、四个双端口10GbE Intel网卡和两个NVIDIA GTX 480卡。因为我们使用很多PCI-e设备，所以我们的机器采用两个IOH(以前称为Northbridge)。有趣的是，我们的系统性能受到双IOH…。\nPacketShader：GPU加速的软件路由器(幻灯片)韩相进、张启恩、朴永洙和苏文。2010年ACM SIGCOMM会议论文集，印度德里。2010年9月。\n建设单盒100Gbps软件路由器韩相进、张基恩、朴英秀和苏文。第17届IEEE局域网和城域网研讨会(LANMAN)邀请论文，2010年5月，新泽西州Long Branch。\nPacketShader：使用GPU进行大规模并行数据包处理，以加速软件路由器Sangjin han、Keon Jang、Kyoung gSoo Park和Sue Moon。Usenix NSDI海报，加利福尼亚州圣何塞。2010年4月。\n学生：韩相进和张基恩学院：朴金秀和苏文我们是通过我们的邮寄名单集体联系到的：tengig at an.kaist.ac.kr", "note_en": "New: The I/O engine is now available!   We have partially released the source code used in this work. You can find the user-level packet I/O engine for Intel 82598/82599 NICs  here. We do not have a definite release plan for other parts of the PacketShader code not made available on the web as of today.\n    PacketShader is a high-performance PC-based software router platform that accelerates the core packet processing with Graphics Processing Units (GPUs). Based on our observation that the CPU is the typical performance bottleneck in high-speed sofware routers, we scale the computing power in a cost-effective manner with massively-parallel GPU. PacketShader offloads computation and memory-intensive router applications to GPUs while optimizing the packet reception and transmission path on Linux.  ...\n    As you all know, GPU is a central chip in your graphics card. GPUs expose a high level of processing parallelism by supporting tens of thousands of hardware threads and ample memory bandwidth. Beyond fast graphics rendering, recent GPUs are widely used for high-performance parallel applications whose workloads require enormous computation cycles and/or memory bandwidth. The data-parallel execution model of GPU fits nicely with inherent parallelism in most router applications.\n    We implemented high-performance packet I/O engine for user-level application.  This project is being maintained separately, and the source code is publicly available now.  Currently-available Linux network stack is not optimized for high-performance IP packet processing, say, for multi-10G networks. For high-speed software routers and better utilization of GPUs, we optimize the packet I/O path in Linux with the following approach.\n  Huge packet buffer: Instead of allocating metadata (sk_buff or skb) and packet data for each packet reception, PacketShader pre-allocates two circular buffers that can hold a large array of metadata and packet data. This greatly reduces the memory allocation/deallocation overhead for high-speed packet reception.\n  Batch processing: PacketShader batch processes a group of packets at a time in the hardware, device driver, and even in the application layer. This amortize per-packet processing overhead.\n  NUMA-aware data placement: PacketShader minimizes packet movement between local and remote memory in a Non-Uniform Memory Access (NUMA) system. Packets received by NICs are processed by its local CPU and memory.\n  Multi-core CPU scalability: PacketShader takes advantage of receive-side scaling (RSS) to eliminate the lock contention in accessing the NIC queues. It also removes the false sharing problem with the CPU cache by aligning the start address of RX queue to the cacheline boundary. Finally, it removes the global  ...\n  With our packet I/O optimization, we are able to run the packet processing in  the user level even for multi-10G router workloads.\n    Figure 1 shows the performance of our optimized packet I/O engine. RX+TX bars represent the case of no-op forwarding, which transmits a packet from a port to another port without further processing.\n    We have implemented four &#34;router applications&#34; based on the packet I/O engine: IPv4 forwarding, IPv6 forwarding, OpenFlow switch, and IPsec tunneling. The below four graphs compare the throughput of the CPU-only implementation and the GPU-accelerated implementation. The performance results clearly show  ...\n    For the IP forwarding, we offloaded longest prefix matching to GPU. Forwarding table lookup is highly memory-intensive, and GPU can acclerate it with both latency hiding capability and bandwidth.\n    OpenFlow and IPsec represent compute-intensive workloads of software routers in our work. We have confirmed that compute-intensive applications can benefit from GPU as well as memory-intensive applications.\n    Our prototype implementation uses two four-core Intel Nehalem CPUs (2.66GHz), four dual-port 10GbE Intel NICs, and two NVIDIA GTX 480 cards. Since we use many PCI-e devices, our machine adopts two IOHs (formerly called Northbridge). Interestingly, the performance of our system is limited by the dual-IOH  ...\n        PacketShader: a GPU-accelerated Software Router ( slides)    Sangjin Han, Keon Jang, KyoungSoo Park and Sue Moon.   In proceedings of ACM SIGCOMM 2010, Delhi, India. September 2010.\n  Buildling a Single-Box 100 Gbps Software Router    Sangjin Han, Keon Jang, KyoungSoo Park and Sue Moon.   The 17th IEEE Workshop on Local and Metropolitan Area Networks (LANMAN) invited paper, Long Branch, New Jersey, May 2010.\n  PacketShader: Massively Parallel Packet Processing with GPUs to Accelerate Software Routers    Sangjin Han, Keon Jang, KyoungSoo Park and Sue Moon.   USENIX NSDI poster, San Jose, California. April 2010.\n    Students:  Sangjin Han and  Keon Jang   Faculty:  KyoungSoo Park and   Sue Moon    We are collectively reached by our mailing list: tengig at an.kaist.ac.kr", "posttime": "2020-05-02 17:56:50", "tags": "软件,gpu,packet", "title": "PacketShader-GPU加速的软件路由器(2011)", "title_en": "PacketShader – GPU-Accelerated Software Router (2011)", "transed": 0, "url": "https://shader.kaist.edu/packetshader/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["软件", "gpu", "packet"]}, {"category": "", "categoryclass": "", "imagename": "1adc6e9fe9b85c584c9243da2a4e771a.png", "infoid": 1000182, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "软件开发团队发现，如果他们尽可能频繁地集成他们的工作，他们的生活会容易得多。他们还发现频繁发布到生产中是有价值的。但是团队不想向他们的用户公开半开发的特性。处理这种紧张关系的一个有用的技术是构建所有的后端代码，进行集成，但不要构建用户界面。该功能可以集成和测试，但用户界面会一直保留到最后，直到它像基石一样被添加到……。\n此技术的一个简单示例可能是为客户提供紧急订单的选项。这样的订单需要定价，这取决于客户的居住地和在那里运营的快递公司。所涉货物的性质会影响仓库中使用的拣货方式。某些客户可能有资格获得紧急订单，这也可能取决于送货地点、一年中的时间和订购的商品类型。\n总而言之，这是一个相当不错的业务逻辑，特别是因为它将涉及到与各种仓储、目录和客户服务系统的粗暴集成。这样做可能需要几周的时间，而其他功能需要每隔几天发布一次。但对于用户而言，紧急订单只是订单上的一个复选框。\n为了使用复选框作为基石来构建它，团队在几个生产版本的过程中对底层业务逻辑和内部系统的接口进行开发工作。用户不知道所有这些潜在的代码。只有在最后一步中，才需要使Keystone复选框可见，这可以在相对较短的时间内完成。通过这种方式，所有潜在的代码都可以集成在一起，并成为投入生产的系统的一部分，从而减少了长生命周期带来的问题……。\n潜伏的代码确实需要以与其处于活动状态时相同的置信度进行测试。如果设置了系统的体系结构，以便大多数测试不通过用户界面完成，则可以做到这一点。单元测试和测试金字塔的其他较低层应该很容易以这种方式运行。即使是广泛的堆栈测试也可以运行，只要有一种机制可以使它们成为皮下测试。在某些情况下，UI本身会有大量的行为，.。\n并不是所有的应用程序都是这样构建的，它们可以通过皮下方式进行广泛的测试-但即使没有使用Keystone的能力，这样做所需的努力也是值得的。通过UI运行的测试设置起来总是比较麻烦，即使使用最好的自动化工具也是如此。将更多的测试转移到皮下和更低级别的测试，特别是单元测试，可以极大地加快部署管道并实现持续交付。\n当然，大多数UI不仅仅是一个复选框，尽管它们通常对Keystone来说并不是太多的工作。在Web应用程序中，一个复杂的功能通常是一个独立的网页，可以完整地构建和测试，而Keystone只是一个链接。桌面可能有几个屏幕，其中Keystone是使它们可见的菜单项。\n也就是说，在某些情况下，UI不能打包成一个简单的Keystone。如果是这种情况，那么就是使用功能切换的时候了。然而，即使在这种情况下，通过确保功能切换仅适用于UI，考虑Keystone也是有用的。这避免了在后端代码中散布大量的切换点，降低了应用切换的复杂性，允许使用简单的切换机制，并且在时机成熟时更容易删除。\n最后开发UI有一个普遍的危险，即后端代码的设计方式可能一旦构建就不能与UI一起工作，或者UI直到很晚才得到它所需的关注，从而导致缺乏迭代和糟糕的用户体验。出于这些原因，Keystone方法在鼓励通过薄薄的垂直切片构建产品的整体方法中工作得最好，这将导致快速发布小但完全有效的特性。\n我在这里使用了用户界面的例子，当然，同样的方法也可以用于任何其他界面，比如API。通过最后构建消费者的界面，并保持它的简单性，我们可以在小块中构建和集成甚至大的功能。\n黑暗启动是一种变体，新功能一旦构建就会被调用，但不会向用户显示任何结果。这样做是为了衡量对后端系统的影响，这对某些更改很有用。一旦一切正常，我们就可以添加拱心石了。\n我第一次看到这项技术的基石的比喻是在肯特·贝克的“极限编程解释”第二版中。皮特·霍奇森、布兰登·达夫和斯特凡·史密斯提醒我，我忘了这一点。", "note_en": "Software development teams find life can be much easier if they integrate their work as often as they can. They also find it valuable to release frequently into production. But teams don&#39;t want to expose half-developed features to their users. A useful technique to deal with this tension is to build all the back-end code, integrate, but don&#39;t build the user-interface. The feature can be integrated and tested, but the UI is held back until the end until, like a keystone, it&#39;s added to  ...\n A simple example of this technique might be to give a customer the option of a rush order. Such an order needs to be priced, depending on where the customer lives and what delivery companies operate there. The nature of the goods involved affects the picking approach used in the warehouse. Certain customers may qualify to have rush orders available to them, which may also depend on the delivery location, the time of year, and the kind of goods ordered.\n All in all that&#39;s a fair bit of business logic, particularly since it will involve gnarly integration with various warehousing, catalog, and customer service systems. Doing this could take several weeks, while other features, need to be released every few days. But as far as the user is concerned, a rush order is just a check-box on the order form.\n To build this using the check-box as the keystone, the team does development work on the underlying business logic and interfaces to internal systems over the course of several production releases. The user is unaware of all this latent code. Only with the last step does the keystone check-box need to be made visible, which can be done in a relatively short time. This way all latent code can be integrated and be part of the system going into production, reducing the problems that come with a long-lived  ...\n  The latent code does need to be tested to the same degree of confidence that it would be if it were active. This can be done providing the architecture of the system is setup so that most testing isn&#39;t done through the user interface.  Unit Tests and other lower layers of the  Test Pyramid should be easy to run this way. Even  Broad Stack Tests can be run providing there is a mechanism to make them  Subcutaneous Tests. In some cases there will a significant amount of behavior within the UI itself,  ...\n Not all applications are built in such a way that they can be extensively tested in a subcutaneous manner - but the effort required to do this is worthwhile even without the capability to use a keystone. Tests running through the UI are always more trouble to setup, even with the best tools to automate the process. Moving more tests to subcutaneous and lower level tests, especially unit tests, can dramatically speed up  Deployment Pipelines and enable  Continuous Delivery.\n Of course, most UIs will be more than a check-box, although often they aren&#39;t that much more work to keystone. In a web app, a complex feature will often be an independent web page, that can be built and tested in full, and the keystone is merely a link. A desktop may have several screens where the keystone is the menu-item to make them visible.\n That said, there are cases when the UI can&#39;t be packaged into a simple keystone. When that&#39;s the case then it&#39;s time to use  Feature Toggles. Even in this case, however, thinking of a keystone can be useful by ensuring that the feature toggle only applies to the UI. This avoids scattering lots of toggle points through the back end code, reduces the complexity of applying the toggle, allows the use of  simple toggle mechanisms, and makes it easier to remove when the time comes.\n There is a general danger with developing a UI last, in that the back-end code may be designed in a way that doesn&#39;t work with the UI once it&#39;s built, or the UI isn&#39;t given the attention it needs until late, leading to a lack of iteration and a poor user experience. For those reasons a keystone approach works best within an overall approach that encourages building a product through thin vertical slices that lead to releasing small but fully working features rapidly.\n I&#39;ve used the example of a user-interface here, but of course the same approach can be used with any other interface, such as an API. By building the consumer&#39;s interface last, and keeping it simple, we can build and integrate even large features in small chunks.\n Dark Launching is a variation where the new feature is called once its built, but no results are shown to the user. This is done to measure the impact on the back-end systems, which is useful for some changes. Once all is good, we can add the keystone.\n I first came across the metaphor of a keystone for this technique in the second edition of Kent Beck&#39;s  Extreme Programming Explained . Pete Hodgson, Brandon Duff, and Stefan Smith reminded me that I&#39;d forgotten this.", "posttime": "2020-05-02 17:56:46", "tags": "keystone,构建", "title": "Keystone接口", "title_en": "Keystone Interface", "transed": 0, "url": "https://martinfowler.com/bliki/KeystoneInterface.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["keystone", "构建"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000181, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "要继续，请单击下面的框，让我们知道您不是机器人。\n请确保您的浏览器支持JavaScript和Cookie，并且您没有阻止它们加载。有关更多信息，您可以查看我们的和。", "note_en": "To continue, please click the box below to let us know you&#39;re not a robot.\n  Please make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our   and  .", "posttime": "2020-05-02 17:56:43", "tags": "asks,click", "title": "Grab要求员工无薪休假以削减成本", "title_en": "Grab Asks Staff to Take No-Pay Leave to Cut Costs", "transed": 0, "url": "https://www.bloomberg.com/news/articles/2020-04-30/softbank-backed-grab-asks-staff-to-take-no-pay-leave-to-cut-cost", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["asks", "click"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000179, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这些天来，我被问得最多的问题之一是，世界什么时候能够回到冠状病毒大流行之前的12月的样子。我的答案总是一样的：当我们有一种近乎完美的治疗冠状病毒的药物时，或者当地球上几乎每个人都接种了冠状病毒疫苗的时候。\n前者不太可能在短期内发生。我们需要一种至少95%有效的神奇疗法来阻止疫情爆发。现在大多数候选药物远没有那么强大。他们可以拯救很多人的生命，但还不足以让我们恢复正常。\n人类从未有过比创造对冠状病毒的广泛免疫力更紧迫的任务。现实地说，如果我们要恢复正常，我们需要开发一种安全有效的疫苗。我们需要制造数十亿剂，我们需要把它们送到世界的每一个地方，我们需要所有这些都尽快发生。\n这听起来令人望而生畏，因为事实的确如此。我们的基金会是世界上最大的疫苗资助者，这一努力使我们以前所做的任何努力都相形见绌。这将需要前所未有的全球合作努力。但我知道会有结果的。根本没有其他选择。\n以下是你需要知道的关于创造冠状病毒疫苗的竞赛。\n安东尼·福奇博士表示，他认为研发冠状病毒疫苗需要大约18个月的时间。我同意他的观点，虽然可能短到9个月，也可能长到两年。\n尽管18个月听起来可能很长，但这将是科学家创造的最快的新疫苗。开发通常需要五年左右的时间。一旦你选择了一种疾病作为靶点，你就必须制造疫苗，并在动物身上进行测试。然后你开始在人体上测试安全性和有效性。\n安全性和有效性是每种疫苗最重要的两个目标。安全性就像它听起来的那样：给人接种疫苗安全吗？一些轻微的副作用(如轻微发烧或注射部位疼痛)是可以接受的，但你不想给人们接种会让他们生病的疫苗。\n效力衡量疫苗保护你不生病的效果。虽然理想情况下你希望疫苗100%有效，但很多人不是。例如，今年的流感疫苗大约45%有效。\n第一阶段是安全试验。一小群健康的志愿者获得候选疫苗。你可以尝试不同的剂量，以最低的有效剂量产生最强的免疫反应，而不会产生严重的副作用。\n一旦你确定了一个配方，你就进入第二阶段，它告诉你疫苗在打算接种的人身上效果如何。这一次，数百人接种了疫苗。这个队列应该包括不同年龄和健康状况的人。\n然后，在第三阶段，你把它给成千上万的人。这通常是最长的阶段，因为它发生在所谓的“自然疾病条件”。你把它介绍给一大群可能已经有被目标病原体感染风险的人，然后等着看疫苗是否减少了多少人生病。\n在疫苗通过所有三个试验阶段后，你开始建造生产它的工厂，然后它被提交给世界卫生组织和各种政府机构进行批准。\n这一过程对大多数疫苗都很有效，但目前正常的开发时间表还不够好。在拯救生命和减少数万亿美元的经济损失方面，我们能够削减这一进程的每一天都将给世界带来巨大的不同。\n因此，为了加快这一过程，疫苗研发人员正在压缩时间表。此图显示了如何执行以下操作：\n在传统流程中，解决关键问题和未知问题的步骤是按顺序进行的。这可以帮助减轻财务风险，因为制造一种新的疫苗是昂贵的。许多候选人都失败了，这就是为什么公司要等到知道上一步成功后才投资下一步。\n对于冠状病毒来说，资助发展不是问题。各国政府和其他组织(包括我们的基金会和一个名为“防疫创新联盟”的令人惊叹的联盟)已经明确表示，他们将不惜一切代价支持寻找疫苗。因此，科学家可以通过一次完成几个开发步骤来节省时间。例如，私营部门、政府和我们的基金会将开始确定生产设施……。\n幸运的是，压缩试验时间表并不是通常需要5年的过程在18个月内完成的唯一方法。我们要做的另一种方式是同时测试许多不同的方法。\n截至4月9日，有115种不同的冠状病毒候选疫苗正在开发中。我认为其中八到十个看起来特别有希望。(我们的基金会将保持一个", "note_en": "One of the questions I get asked the most these days is when the world will be able to go back to the way things were in December before the coronavirus pandemic. My answer is always the same: when we have an almost perfect drug to treat COVID-19, or when almost every person on the planet has been vaccinated against coronavirus.\n The former is unlikely to happen anytime soon. We’d need a miracle treatment that was at least 95 percent effective to stop the outbreak. Most of the  drug candidates right now are nowhere near that powerful. They could save a lot of lives, but they aren’t enough to get us back to normal.\n  Humankind has never had a more urgent task than creating broad immunity for coronavirus. Realistically, if we’re going to return to normal, we need to develop a safe, effective vaccine. We need to make billions of doses, we need to get them out to every part of the world, and we need all of this to happen as quickly as possible.\n That sounds daunting, because it is. Our foundation is the biggest funder of vaccines in the world, and this effort dwarfs anything we’ve ever worked on before. It’s going to require a global cooperative effort like the world has never seen. But I know it’ll get done. There’s simply no alternative.\n Here’s what you need to know about the race to create a COVID-19 vaccine.\n  Dr. Anthony Fauci has said he thinks it’ll take around eighteen months to develop a coronavirus vaccine. I agree with him, though it could be as little as 9 months or as long as two years.\n Although eighteen months might sound like a long time, this would be the fastest scientists have created a new vaccine. Development usually takes around five years. Once you pick a disease to target, you have to create the vaccine and test it on animals. Then you begin testing for safety and efficacy in humans.\n Safety and efficacy are the two most important goals for every vaccine.  Safety is exactly what it sounds like: is the vaccine safe to give to people? Some minor side effects (like a mild fever or injection site pain) can be acceptable, but you don’t want to inoculate people with something that makes them sick.\n Efficacy measures how well the vaccine protects you from getting sick. Although you’d ideally want a vaccine to have 100 percent efficacy, many don’t. For example, this year’s flu vaccine is  around 45 percent effective.\n  Phase one is the safety trial. A small group of healthy volunteers gets the vaccine candidate. You try out different dosages to create the strongest immune response at the lowest effective dose without serious side effects.\n  Once you’ve settled on a formula, you move onto  phase two, which tells you how well the vaccine works in the people who are intended to get it. This time, hundreds of people get the vaccine. This cohort should include people of different ages and health statuses.\n  Then, in  phase three, you give it to thousands of people. This is usually the longest phase, because it occurs in what’s called “natural disease conditions.” You introduce it to a large group of people who are likely already at the risk of infection by the target pathogen, and then wait and see if the vaccine reduces how many people get sick.\n After the vaccine passes all three trial phases, you start building the factories to manufacture it, and it gets submitted to the WHO and various government agencies for approval.\n This process works well for most vaccines, but the normal development timeline isn’t good enough right now. Every day we can cut from this process will make a huge difference to the world in terms of saving lives and reducing trillions of dollars in economic damage.\n So, to speed up the process, vaccine developers are compressing the timeline. This graphic shows how:\n       In the traditional process, the steps are sequential to address key questions and unknowns. This can help mitigate financial risk, since creating a new vaccine is expensive. Many candidates fail, which is why companies wait to invest in the next step until they know the previous step was successful.\n For COVID-19, financing development is not an issue. Governments and other organizations (including our foundation and an amazing alliance called the  Coalition for Epidemic Preparedness Innovations) have made it clear they will support whatever it takes to find a vaccine. So, scientists are able to save time by doing several of the development steps at once. For example, the private sector, governments, and our foundation are going to start identifying facilities to manufacture  ...\n Fortunately, compressing the trial timeline isn’t the only way to take a process that usually takes five years and get it done in 18 months. Another way we’re going to do that is by testing lots of different approaches at the same time.\n  As of April 9, there are  115 different COVID-19 vaccine candidates in the development pipeline. I think that eight to ten of those look particularly promising. (Our foundation is going to keep an eye on all the others to see if we missed any that have some positive characteristics, though.)\n     The most promising candidates take a variety of approaches to protecting the body against COVID-19. To understand what exactly that means, it’s helpful to remember how the human immune system works.\n When a disease pathogen gets into your system, your immune system responds by producing antibodies. These antibodies attach themselves to substances called  antigens on the surface of the microbe, which sends a signal to your body to attack. Your immune system keeps a record of every microbe it has ever defeated, so that it can quickly recognize and destroy invaders before they make you ill.\n Vaccines circumvent this whole process by teaching your body how to defeat a pathogen without ever getting sick. The two most common types—and the ones you’re probably most familiar with—are inactivated and live  vaccines. Inactivated vaccines contain pathogens that have been killed. Live vaccines, on the other hand, are made of living pathogens that have been weakened (or “attenuated ”). They ’re highly effective but more prone to side effects than their inactivated  ...\n Inactivated and live vaccines are what we consider “traditional” approaches. There are a number of COVID-19 vaccine candidates of both types, and for good reason: they’re well-established. We know how to test and manufacture them.\n The downside is that they’re time-consuming to make. There’s a ton of material in each dose of a vaccine. Most of that material is biological, which means you have to grow it. That takes time, unfortunately.\n That’s why I’m particularly excited by two new approaches that some of the candidates are taking:  RNA and DNA vaccines. If one of these new approaches pans out, we’ll likely be able to get vaccines out to the whole world much faster. (For the sake of simplicity, I’m only going to explain RNA vaccines. DNA vaccines are similar, just with a different type of genetic material and method of administration.)\n Our foundation—both through our own funding and through  CEPI—has been supporting the development of an RNA vaccine platform for nearly a decade. We were planning to use it to make vaccines for diseases that affect the poor like malaria, but now it’s looking like one of the most promising options for COVID. The first candidate to start human trials was an RNA vaccine created by a company called Moderna.\n Here’s how an RNA vaccine works: rather than injecting a pathogen’s antigen into your body, you instead give the body the genetic code needed to produce that antigen itself. When the antigens appear on the outside of your cells, your immune system attacks them—and learns how to defeat future intruders in the process. You essentially turn your body into its own vaccine manufacturing unit.\n Because RNA vaccines let your body do most of the work, they don ’t require much material. That makes them much faster to manufacture. There ’s a catch, though: we don ’t know for sure yet if RNA is a viable platform for vaccines. Since COVID would be the first RNA vaccine out of the gate, we have to prove both that the platform itself works and that it creates immunity. It ’s a bit like building your computer system and your first piece of software at the same  ...\n Even if an RNA vaccine continues to show promise, we still must continue pursuing the other options. We don’t know yet what the COVID-19 vaccine will look like. Until we do, we have to go full steam ahead on as many approaches as possible.\n  The smallpox vaccine is the only vaccine that’s wiped an entire disease off the face of the earth, but it’s also pretty brutal to receive. It left a scar on the arm of anyone who got it. One out of every three people had side effects bad enough to keep them home from school or work. A small—but not insignificant—number developed more serious reactions.\n The smallpox vaccine was far from perfect, but it got the job done. The COVID-19 vaccine might be similar.\n If we were designing the perfect vaccine, we’d want it to be completely safe and 100 percent effective. It should be a single dose that gives you lifelong protection, and it should be easy to store and transport. I hope the COVID-19 vaccine has all of those qualities, but given the timeline we’re on, it may not.\n The two priorities, as I mentioned earlier, are  safety and  efficacy. Since we might not have time to do multi-year studies, we will have to conduct robust phase 1 safety trials and make sure we have good real-world evidence that the vaccine is completely safe to use.\n We have a bit more wiggle room with efficacy. I suspect a vaccine that is at least 70 percent effective will be enough to stop the outbreak. A 60 percent effective vaccine is useable, but we might still see some localized outbreaks. Anything under 60 percent is unlikely to create enough herd immunity to stop the virus.\n The big challenge will be making sure the vaccine works well in older people. The older you are, the less effective vaccines are. Your immune system—like the rest of your body—ages and is slower to recognize and attack invaders. That’s a big issue for a COVID-19 vaccine, since older people are the most vulnerable. We need to make sure they’re protected.\n The shingles vaccine—which is also targeted to older people—combats this by amping up the strength of the vaccine. It’s possible we do something similar for COVID, although it might come with more side effects. Health authorities could also ask people over a certain age to get an additional dose.\n  How many doses will it be? A vaccine you only get once is easier and quicker to deliver. But we may need a multi-dose vaccine to get enough efficacy.\n  How long does it last? Ideally, the vaccine will give you long-lasting protection. But we might end up with one that only stops you from getting sick for a couple months (like the seasonal flu vaccine, which protects you for about six months). If that happens, the short-term vaccine might be used while we work on a more durable one.\n  How do you store it? Many common vaccines are kept at 4 degrees C. That’s around the temperature of your average refrigerator, so storage and transportation is easy. But RNA vaccines need to be stored at much colder temperature—as low as -80 degrees C—which will make reaching certain parts of the world more difficult.\n My hope is that the vaccine we have 18 months from now is as close to “perfect” as possible. Even if it isn’t, we will continue working to improve it. After that happens, I suspect the COVID-19 vaccine will become part of the routine newborn immunization schedule.\n Once we have a vaccine, though, we still have huge problems to solve. That’s because…\n  In order to stop the pandemic, we need to make the vaccine available to almost every person on the planet. We’ve never delivered something to every corner of the world before. And, as I mentioned earlier, vaccines are particularly difficult to make and store.\n There’s a lot we can’t figure out about manufacturing and distributing the vaccine until we know what exactly we’re working with. For example, will we be able to use existing vaccine factories to make the COVID-19 vaccine?\n What we can do now is build different kinds of vaccine factories to prepare. Each vaccine type requires a different kind of factory. We need to be ready with facilities that can make each type, so that we can start manufacturing the final vaccine (or vaccines) as soon as we can. This will cost billions of dollars. Governments need to quickly find a mechanism for making the funding for this available. Our foundation is currently working with CEPI,  ...\n Part of those discussions center on who will get the vaccine when. The reality is that not everyone will be able to get the vaccine at the same time. It’ll take months—or even years—to create 7 billion doses (or possibly 14 billion, if it’s a multi-dose vaccine), and we should start distributing them as soon as the first batch is ready to go.\n Most people agree that health workers should get the vaccine first. But who gets it next? Older people? Teachers? Workers in essential jobs?\n I think that low-income countries should be some of the first to receive it, because people will be at a much higher risk of dying in those places. COVID-19 will spread much quicker in poor countries because measures like physical distancing are harder to enact. More people have poor underlying health that makes them more vulnerable to complications, and weak health systems will make it harder for them to receive the care they need. Getting the  ...\n With most vaccines, manufacturers sign a deal with the country where their factories are located, so that country gets first crack at the vaccines. It’s unclear if that’s what will happen here. I hope we find a way to get it out on an equitable basis to the whole world. The WHO and national health authorities will need to develop a distribution plan once we have a better understanding of what we’re working with.\n Eventually, though, we’re going to scale this thing up so that the vaccine is available to everyone. And then, we’ll be able to get back to normal—and to hopefully make decisions that prevent us from being in this situation ever again.\n It might be a bit hard to see right now, but there is a light at the end of the tunnel. We’re doing the right things to get a vaccine as quickly as possible. In the meantime, I urge you to continue following the guidelines set by your local authorities. Our ability to get through this outbreak will depend on everyone doing their part to keep each other safe.", "posttime": "2020-05-02 17:56:34", "tags": "病毒,冠状病毒,疫苗,covid,vaccine", "title": "关于冠状病毒疫苗你需要知道的是", "title_en": "What you need to know about the Covid-19 vaccine", "transed": 0, "url": "https://www.gatesnotes.com/Health/What-you-need-to-know-about-the-COVID-19-vaccine?WT.mc_id=20200430100000_COVID-19-vaccine_BG-EM_&WT.tsrc=BGEM", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["病毒", "冠状病毒", "疫苗", "covid", "vaccine"]}]