[{"category": "", "categoryclass": "", "imagename": "8f1c49a21c8939273e52b227e4f9ccf4.jpg", "infoid": 1005212, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Sack正在与亚马逊合作达成一项多年协议，这意味着亚马逊的所有员工都将开始使用Sack。这笔交易达成之际，Slake正面临来自微软团队的日益激烈的竞争，它还将看到Slake将其语音和视频通话功能迁移到亚马逊的Chime平台，同时更广泛地采用亚马逊网络服务(AWS)。\n亚马逊向所有员工推出Slake是这笔交易的重要组成部分，这要归功于一项企业范围的协议。不过，目前还不清楚亚马逊的840，000名员工中有多少人会使用Slake。到目前为止，Slake最大的客户是IBM，该公司正在向其35万名员工推出Slake。\n虽然Slake长期以来一直使用AWS来支持其聊天应用程序的部分功能，但现在它正致力于将亚马逊的云服务作为其在存储、计算、数据库、安全、分析、机器学习和未来协作功能方面的首选合作伙伴。这笔交易意味着，在可预见的未来，我们不太可能看到Slake转向微软的Azure云服务或Google Cloud来为其部分服务提供支持。\n“我们还没有使用Azure，”Slake负责商业和企业发展的副总裁布拉德·阿姆斯特朗(Brad Armstrong)在接受The Verge采访时说。“我们的绝大多数服务一直在AWS上运行。”阿姆斯特朗说，Slake“不太可能”在未来寻求使用Azure。\n转移到Amazon Chime进行松弛语音和视频通话也是这笔交易的重要组成部分。与微软团队相比，语音和视频会议是Slake的一个特别的弱点，但这种新的集成应该意味着它在未来将得到极大的改进。Sack已经开始迁移，并且正在研究新功能。“目前，我们只专注于支撑后端，”阿姆斯特朗说。由于Chime有其他功能，我们正在考虑将移动体验包括视频，但目前还没有。我们还在研究转录情况。“。\nSack和亚马逊还承诺为AWS Chatbot等功能提供更好的产品集成和互操作性，这是一项为AWS实例推送Slake频道警报的服务。在接下来的几个月里，Slake和AWS将改进其Amazon AppFlow集成，以支持AWS服务和Slake渠道之间的双向数据传输。\n所有这些集成点和Slake对亚马逊的拥抱都是为了让聊天应用程序对企业客户更具吸引力。SLACK一直在稳步增长其企业业务，尽管微软最近大力推动团队发展。这是首席执行官斯图尔特·巴特菲尔德(Stewart Butterfield)在最近的采访中热衷于强调的一点，即使他认为微软“不健康地全神贯注于杀死”斯莱克。\n“企业软件的未来将由云服务和工作流协作工具的结合来推动，”巴特菲尔德在今天的一份声明中说。与AWS的战略合作使两家公司都能够扩大规模，以满足需求，并向我们的客户提供企业级产品。“\n这是一笔对亚马逊和Slake都有利的交易。亚马逊为AWS及其Chime平台获得了一个重要的合作伙伴，而Slake凭借更好的语音和视频呼叫服务作为其服务的基础，获得了AWS的可靠性和安全性。\n这一合作伙伴关系也谈到了Slake如何设法赢得业务的核心。Sack选择了与各种竞争对手软件和云提供商的合作和集成，而且并不总是试图将这些功能构建到自己的应用程序中。Sack首席执行官斯图尔特·巴特菲尔德上个月在Vergecast上接受了一次内容广泛的采访，谈到了这种整合的价值。\nSack的主要竞争对手微软(Microsoft)也在努力吸引开发人员，并改善微软团队中的应用程序支持，但该公司最紧密的集成仍然是Outlook、Word、Excel、PowerPoint等Office套件。微软也一直在将团队捆绑在一起，作为Office 365订阅的一部分，吸引企业使用这款通信软件，而不是Slake和其他竞争对手。微软团队最近达到了7500万日活跃用户，比起大流行开始时的增长，这是一个巨大的跃升。\n斯拉克的方法似乎正在奏效，特别是对于那些不太依赖微软生产力应用程序的企业。Sack今天公布了收益，披露了超过12.2万名付费客户，同比增长28%。目前有超过75万家组织使用免费或付费订阅计划，高于上一季度末的66万家。\n巴特菲尔德将Slake最近的季度描述为“非凡的”，收入同比增长了50%。早在3月份，Sack就打破了用户纪录，当时许多企业在冠状病毒大流行期间开始命令员工在家工作。巴特菲尔德说：“我们相信，三个月的在家工作和在家工作的次数将对我们的工作方式产生代际影响。”这将继续促进对我们创建的基于渠道的信息传送平台这一新类别的采用，我们仍然是这类平台的唯一企业级产品。“", "note_en": "Slack is partnering with Amazon in a multi-year agreement that means all Amazon employees will start to use Slack. The deal comes just as Slack faces increased competition from Microsoft Teams, and it will also see Slack migrate its voice and video calling features over to  Amazon’s Chime platform alongside a broader adoption of Amazon Web Services (AWS).\n Amazon’s roll out of Slack to all of its employees is a big part of the deal, thanks to an enterprise-wide agreement. It’s not immediately clear how many of Amazon’s 840,000 employees will be using Slack, though. Up until today,  Slack’s biggest customer has been IBM, which is rolling out Slack to its 350,000 employees.\n While Slack has long used AWS to power parts of its chat app, it’s now committing to using Amazon’s cloud services as its preferred partner for storage, compute, database, security, analytics, machine learning, and future collaboration features. The deal means it’s unlikely we’ll see Slack turn to Microsoft’s Azure cloud services or Google Cloud to power parts of its service in the foreseeable future.\n “We have not used Azure,” says Brad Armstrong, vice president of business and corporate development at Slack, in an interview with  The Verge. “The vast majority of our service has always run on AWS.” Armstrong says it’s “not likely” that Slack will be looking to use Azure in the future.\n   The move to Amazon Chime for Slack voice and video calls is also a significant part of the deal. Voice and video conferencing is a particular weak point of Slack compared to Microsoft Teams, but this new integration should mean it will be vastly improved in the future. Slack has already started the migration, and it’s looking into new features. “For now, we’re just focused on shoring up the back end,” says Armstrong. “As Chime has additional features, we’re looking at bringing the mobile experience to include video, which it doesn’t today. We’re also looking at transcription.”\n Slack and Amazon are also promising better product integration and interoperability for features like AWS Chatbot, a service that pushes out Slack channel alerts for AWS instances. In the coming months, Slack and AWS will improve its Amazon AppFlow integration to support bi-directional transfer of data between AWS services and Slack channels.\n All of these integration points and Slack’s embrace of Amazon are designed to make the chat app far more appealing to enterprise customers. Slack has been steadily growing its enterprise business, despite Microsoft’s big push with Teams recently. It’s a point that CEO Stewart Butterfield has been keen to stress in recent interviews, even if he thinks Microsoft is “ unhealthily preoccupied with killing” Slack.\n “The future of enterprise software will be driven by the combination of cloud services and workstream collaboration tools,” says Butterfield in a statement today. “Strategically partnering with AWS allows both companies to scale to meet demand and deliver enterprise-grade offerings to our customers.”\n It’s a deal that will benefit both Amazon and Slack. Amazon gets an important partner for AWS and its Chime platform, and Slack gets the reliability and security of AWS with a better voice and video calling service underpinning its service.\n  The partnership also speaks to the core of how Slack has managed to win businesses over. Slack has opted for partnerships and integrations with a variety of rival software and cloud providers, and hasn’t always attempted to build those features into its own app. Slack CEO Stewart Butterfield touched on the value of that integration in a  wide-ranging interview on  The Vergecast last month.\n Slack’s main rival, Microsoft, is also trying to entice developers and improve app support in Microsoft Teams, but the company’s tightest integrations are still the Office suite of Outlook, Word, Excel, PowerPoint, and more. Microsoft has also been bundling Teams as part of its Office 365 subscription, tempting businesses to use the communications software over Slack and other rivals. Microsoft Teams hit  75 million daily active users recently, a huge jump from even the  bump at the beginning of the pandemic.\n Slack’s approach seems to be working, especially for businesses that aren’t as reliant on Microsoft’s productivity apps. Slack  reported its earnings today, revealing more than 122,000 paid customers, an increase of 28 percent year over year. Over 750,000 organizations are now using a free or paid subscription plan, up from 660,000 at the end of the last quarter.\n Butterfield describes Slack’s recent quarter as “phenomenal,” with 50 percent revenue growth year over year.  Slack broke a user record back in March, just as many businesses started to order employees to work from home amid the ongoing coronavirus pandemic. “We believe the long-term impact the three months and counting of working from home will have on the way we work is of generational magnitude,” says Butterfield. “This will continue to catalyze adoption for the new category of channel-based messaging platforms we created and for which we are still the only enterprise-grade offering.”", "posttime": "2020-06-05 06:32:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "微软,亚马逊,amazon,microsoft,展开", "title": "松散的合作伙伴亚马逊将与微软团队展开竞争", "title_en": "Slack partners with Amazon to take on Microsoft Teams", "transed": 1, "url": "https://www.theverge.com/2020/6/4/21280829/slack-amazon-aws-partnership-amazon-chime-voice-video-calls", "via": "", "real_tags": ["微软", "亚马逊", "amazon", "microsoft", "展开"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005211, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据几家新闻媒体报道，特朗普总统预计将签署一项行政命令，加快批准新的基础设施和能源项目，以此作为应对新冠肺炎疫情引发的经济低迷的一种方式。据华盛顿邮报报道，该命令将放弃几项长期存在的环境法，以允许更快的批准，包括濒危物种法案和国家环境政策法案(NEPA)。\n根据这项命令，在美国经济陷入危机并从冠状病毒中恢复期间，各机构将不再被要求就拟议中的项目征求公众意见，或分析其对环境的影响。这将适用于管道、石油和天然气钻探以及高速公路等项目。\n据“国会山”报道，在此之前的上个月，一项命令指示联邦机构负责人“确定可能抑制经济复苏的监管标准”。而且这也是特朗普政府废除美国环境法规的长期努力的一部分，包括要求对重大基础设施项目进行环境评估的《国家环境政策法》。环保人士表示，这项法律是再次打击有色人种社区环境不公正的关键工具之一。\n南方环境法中心(Southern Environmental Law Center)高级律师凯姆·亨特(Kym Hunter)在一份声明中说，“一周多来，人们包围白宫，要求听到他们的声音，因为在太长的时间里，当局忽视了他们，或者将他们边缘化。”“特朗普政府会利用这一时刻进一步压制这些声音，这绝对令人叹为观止。我们不会让这件事继续下去的。没有人可以凌驾于法律之上。“", "note_en": "President Trump is expected to sign an executive order to expedite the permitting of new infrastructure and energy projects as a way to address the economic downturn driven by the Covid-19 pandemic, several news outlets report. The order will waive several long-standing environmental laws to allow for the faster approval, including the Endangered Species Act and the National Environmental Policy Act (NEPA),  according to  The Washington Post.\n Under the order, agencies will no longer be required to solicit public comments on proposed projects, or analyze their environmental impacts while the U.S. economy is in crisis and recovering from the coronavirus. This would apply to projects such as pipelines, oil and gas drilling, and highways.\n This follows a previous order last month that directed federal agency heads to “identify regulatory standards that may inhibit economic recovery,”  The Hill reported. And it is part of the Trump administration’s long-standing efforts to dismantle U.S. environmental regulations., including NEPA, which requires environmental assessments of major infrastructure projects. Environmentalists say this law is one of the key tools in the fight again environmental injustice in communities of color.\n “For more than a week now, people have encircled the White House to demand their voices be heard because, for too long, authorities have ignored them or marginalized them,” Kym Hunter, a senior attorney with the Southern Environmental Law Center,  said in a statement. “It is absolutely breathtaking that the Trump administration would use this moment to further squelch these voices. We won’t let this stand. No one is above the law.”", "posttime": "2020-06-05 06:14:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "签署,sign,环境", "title": "特朗普将签署放弃关键环境法的行政命令", "title_en": "Trump to Sign Executive Order Waiving Key Environmental Laws", "transed": 1, "url": "https://e360.yale.edu/digest/president-trump-to-sign-executive-order-waiving-key-environmental-laws", "via": "", "real_tags": ["签署", "sign", "环境"]}, {"category": "", "categoryclass": "", "imagename": "99b98b9490146d7b28c8e287b67e7c31.jpeg", "infoid": 1005210, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Sack将利用亚马逊网络服务Chime视频通话服务的底层技术，为数百万Slake用户提供更好的视频通话。\n亚马逊是美国最大的雇主之一，如果他们愿意，他们可以使用Slake。\n这一联盟帮助两家公司与微软展开斗争，在冠状病毒大流行期间，微软的团队通信服务与Slake一起变得越来越受欢迎。\nSack和亚马逊正在深化他们的合作伙伴关系。根据周四宣布的一项新协议，亚马逊的所有员工都将可以使用Slake的工作场所协作工具。此外，Slake将加深对AWS的依赖，改进其视频通话功能，以利用一项名为Chime的AWS服务。\n这一联盟帮助两家公司与微软(Microsoft)展开斗争。近几个月来，随着公司和学校寻求能够让人们在冠状病毒大流行期间远程会面的软件，微软的团队通信服务与Slake一起变得越来越受欢迎。\nSack&39；公司在周四早些时候的第一财季收益报告中透露，在冠状病毒大流行期间，该公司的增长保持稳定，但并未加速，尽管许多公司采取行动让员工留在家里。几个小时后，该公司的股价下跌了15%以上。\n亚马逊和Slake有着悠久的历史。SLACK自2014年推出以来，一直在亚马逊网络服务基础设施上运行其服务，并继续依赖AWS来满足大流行期间的额外需求。根据斯拉克最新的年度报告，2018年，斯拉克同意在五年内向AWS支付至少2.5亿美元，以使用各种服务。\n两家公司表示，新协议是与Slake的云合同分开谈判达成的，但拒绝透露具体条款。\n亚马逊内部的一些团队已经使用了Slake，但这笔交易将把它带给所有员工。亚马逊是美国第二大私营部门雇主，第一季度拥有超过84万名全职和兼职员工。\n亚马逊的员工已经能够使用一种名为Chime的内部视频通话工具，该公司也向客户提供这种工具。\nAWS负责销售和营销的副总裁马特·加尔曼(Matt Garman)说，它很不错，但不是松懈。\n加曼承认，AWS没有投入足够的资金来确保Chime&#39；的用户体验与其他在线视频会议服务相竞争。\n我越来越多地看到顾客想要使用同类中最好的协同工作的产品。加尔曼说，他们不必使用单一的整体式堆栈。\n但是，尽管Chime用户体验可能缺乏，Slake正在拥抱亚马逊为其构建的底层基础设施。作为新交易的一部分，Slake将使用Chime基础设施在其应用程序内提供语音和视频通话，而不是依赖自己的系统，该系统建立在2015年收购初创企业ScreenHero时获得的技术之上。\nSlake负责业务发展和企业发展的副总裁约翰·布拉德·阿姆斯特朗(Brad Armstrong)表示，转向Chime基础设施可以使Slake视频通话更可靠，并提供额外的功能。\n阿姆斯特朗说，Sack打算在移动设备上启用视频通话，并添加可以自动放入Sack文本对话中供人们阅读的通话记录。", "note_en": "Slack will draw on the underlying technology for Amazon Web Services&#39; Chime video-calling service to deliver better video calls for millions of Slack users.\n Employees of Amazon, one of the largest employers in the U.S., will be able to use Slack if they wish.\n The alliance helps both companies battle Microsoft, whose Teams communications service has grown in popularity alongside Slack during the coronavirus pandemic.\n Slack and  Amazon are deepening their partnership. Under a new deal announced Thursday, all Amazon employees will have access to Slack&#39;s workplace collaboration tools. In addition, Slack will deepen its reliance on AWS, revamping its video-calling feature to take advantage of an AWS service called Chime.\n The alliance helps both companies battle  Microsoft, whose Teams communications service has  grown in popularity alongside Slack in recent months as companies and schools have reached for software that can enable people to meet remotely during the coronavirus pandemic.\n  Slack&#39;s growth has remained steady during the coronavirus pandemic, but has not accelerated, despite many companies moving to keep employees home, the company revealed in its fiscal first quarter  earnings report earlier on Thursday. The company&#39;s shares dropped more than 15% after hours.\n Amazon and Slack have a long history. Slack has run its service on Amazon Web Services infrastructure since launching in 2014, and it has continued to lean on AWS to accommodate additional demand during the pandemic. In 2018 Slack agreed to pay AWS at least $250 million over five years to use various services, according to  Slack&#39;s most recent annual report.\n The new deal was negotiated separately from Slack&#39;s cloud contract, the companies said, declining to disclose exact terms.\n Some teams within Amazon had already used Slack, but this deal will bring it to all employees. Amazon is  the second-largest private-sector employer in the U.S., with  over 840,000 full-time and part-time employees in the first quarter.\n Amazon employees have been able to use an in-house video-calling tool called Chime, which the company also offers to its customers.\n  &#34;It&#39;s nice, but it&#39;s not Slack,&#34; said Matt Garman, AWS&#39; vice president for sales and marketing.\n Garman admitted that AWS has not invested enough to make sure Chime&#39;s user experience is competitive with other services for online video meetings.\n &#34;Increasingly I see customers wanting to use best-of-breed products that work together. They don&#39;t have to use a single monolithic stack,&#34; Garman said.\n But while the Chime user experience may be lacking, Slack is embracing the underlying infrastructure Amazon built to power it. As part of the new deal, Slack will use Chime infrastructure to deliver voice and video calling within its application, rather than relying on its own system, which is built on technology gained in the 2015  acquisition of start-up Screenhero.\n Moving to Chime infrastructure could make Slack video calls more reliable, as well as offering additional features, said Brad Armstrong, vice president of business development and corporate development at Slack.\n Slack intends to enable video calling on mobile devices and add transcriptions of calls that can automatically be dropped into Slack text conversations for people to read, Armstrong said.", "posttime": "2020-06-05 06:13:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "亚马逊,amazon,slake,slack", "title": "亚马逊为员工发放Slake许可证，因为Slake采用了AWS视频呼叫技术", "title_en": "Amazon licenses Slack for workers as Slack adopts AWS video-call tech", "transed": 1, "url": "https://www.cnbc.com/2020/06/04/amazon-licenses-slack-for-workers-as-slack-adopts-aws-video-call-tech.html", "via": "", "real_tags": ["亚马逊", "amazon", "slake", "slack"]}, {"category": "", "categoryclass": "", "imagename": "5595a3255b51d3a76a4a82287a603656.jpg", "infoid": 1005208, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "获取突发新闻警报和特别报道。重要的新闻和故事会在工作日早上发布。\n订阅。\n华盛顿--最近针对警察暴行的抗议活动出现了一些极不寻常的情况：执法官员穿着没有标记的防暴装备出现，隐藏了自己的名字，也没有提供他们为哪个机构工作的迹象。\n弗吉尼亚州民主党众议员唐·拜尔(Don Beyer)和康涅狄格州民主党参议员克里斯·墨菲(Chris Murphy)正在制定立法，要求身穿制服的联邦官员在响应第一修正案(First Amendment)大会时将他们的机构和姓名明显地标记出来。\n拜尔说，当一名选民打电话告诉他，他们看到警察的徽章和名字上贴着黑色胶带时，他第一次注意到这个问题。\n拜尔在接受NBC新闻采访时表示：“我以前从未见过这样的事情。”“我吓坏了。”\n“这些人可能是任何人。由于难以辨认，他们几乎被允许做任何他们愿意做的事情而不受惩罚。“拜尔说。“如果我们想要执法部门，甚至是一支失控的军队，只要确保你不能让他们承担责任就行了。”\n这场辩论发生时，该国首都的居民目睹了大量警察的存在，其中包括各种执法实体。随着警方使用催泪瓦斯和胡椒喷雾控制人群，与要求为黑人乔治·弗洛伊德(George Floyd)伸张正义的抗议者的冲突有时会变得激烈。弗洛伊德是一名黑人男子，在明尼阿波利斯的一名警察按住他的脖子后在拘留期间死亡。\n周三气温徘徊在华氏90度左右，数十名戴着黑色头盔的武装人员站在防暴盾牌上，面无表情地盯着高喊口号的抗议者，其中包括你在保护谁？\n让我们的新闻与您的收件箱见面。重要的新闻和故事，在工作日的早上递送。\n这个问题并不完全是修辞学的。这些人没有对抗议者或记者讲话。他们没有佩戴军衔或部队徽章。他们没有佩带徽章，他们的黑色战术背心上也没有铭牌。一些人穿着灰色的工装裤，另一些人穿着黑色的。一些人穿着肩膀上印有德克萨斯州国旗的绿色T恤。其他人则穿着黑色衣服，缩写SORT部分可见-这是表明这些人是联邦特工的唯一线索，他们是监狱管理局特种作战反应小组(Bureau Of Prisons Special Operations Response Team)的成员。\n周四，加利福尼亚州民主党众议院议长南希·佩洛西(Nancy Pelosi)写了一封信给唐纳德·特朗普(Donald Trump)总统，表达了对身份不明的官员的存在可能导致混乱的担忧，从而加剧了这一问题。\n她写道，我写信是为了要求提供一份涉及的机构的完整名单，并澄清在该市运作的部队和联邦执法资源的角色和责任。她写道，美国人必须知道谁负责，指挥链是什么，任务是什么。\n在周四的媒体吹风会上，司法部长威廉·巴尔(William Barr)表示，他不知道有任何监狱管理局(Bureau Of Prisons)的工作人员被告知不要透露自己的身份，并表示，由于他们通常不会在监狱外活动，他们不需要透露自己的身份。\n“我可能应该做得更好，在全国范围内将他们标记为该机构，”他承认。\n拜尔说，民主党领导的众议院可能会在本月晚些时候讨论一揽子警察改革方案，并补充说，他将推动佩洛西将他的提案包括在内，他预计最早将于下周与共同发起人发布该提案。它需要在参议院获得通过，参议院由唐纳德·特朗普(Donald Trump)总统的共和党盟友控制。\n众议院少数党领袖、加利福尼亚州共和党人凯文·麦卡锡(Kevin McCarthy)表示，这个问题绝对是我们可以研究的问题，并指出过去有人冒充过警察。\n我想确保警官们在外面的时候受到保护。周四，他告诉记者，我还想确保这些警察--我们知道他们也是警察，他们受到保护，我们知道我们在和谁打交道，没有虚假陈述。\n但他接着表示，考虑到目前的情况，“外面会有穿着不同衣服的警察，他们不会表明自己的身份来保护和收集信息，他们完全有权这样做，这是合适的。”\n周四，伊利诺伊州众议员拉贾·克里希纳莫奥蒂(Raja Krishnamoorei)给巴尔写了一封信，询问特工们接到了什么命令，导致他们的制服上没有身份证明。他问是什么命令让他们只说他们是司法部和联邦政府的。他还询问了监狱管理局(Bureau Of Prisons)部署了多少部队以及从哪里部署的细节。\n这封信由众议院民主党会议主席纽约州民主党人哈基姆·杰弗里斯(Hakeem Jeffries)、马萨诸塞州民主党参议员伊丽莎白·沃伦(Elizabeth Warren)和新泽西州民主党参议员科里·布克(Cory Booker)共同签署。\n回到白宫外面。今天，警戒线又向后推了半个街区。某种联邦执法部门，但他们不愿透露身份，所有的徽章和铭牌都已被移除。pic.twitter.com/q5dmdMgkLV。\n-加勒特·哈克(@garretthaake)2020年6月3日。\n墨菲说，允许未标记的警察监督示威活动是不安全的，并且“允许真正危险的潜在恶作剧”。\n那么，怎样才能阻止一些平民右翼民兵在抗议活动中镇压民众，并声称他们是联邦安全部门，就像其他身份不明的制服安全官员一样？他问道。我们需要确保联邦政府参与安全事务的每一个人的身份。\n参议员办公室表示，计划于周四晚些时候向纽约州民主党参议院少数党领袖查克·舒默(Chuck Schumer)介绍他的法案。\n他呼吁特朗普政府立即结束这种做法，并暗示他可以找到共和党人的支持来迫使这个问题。\n墨菲说：我不认为共和党人对有身份不明的执法人员在这个国家的街道上巡逻感到非常兴奋。所以我认为这是我们可以找到两党合作的东西。", "note_en": "Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\n SUBSCRIBE\n  WASHINGTON — Recent  protests against police brutality have featured something highly unusual: Law enforcement officials are showing up in riot gear unmarked, hiding their names and offering no indication of which agency they work for.\n    Rep. Don Beyer, D-Va., and Sen. Chris Murphy, D-Conn., are working on legislation to require that federal officers in uniform responding to First Amendment assemblies have their agency and name visibly marked.\n Beyer said he was first alerted to the issue when a constituent called to tell him they saw police officers with black tape over their badges and names.\n “I have not seen anything like this before,” Beyer told NBC News in an interview. “I was horrified.”\n  “These people could be anybody. They were almost granted impunity from anything they would do because of the difficulty of identifying,” Beyer said. “And if we wanted law enforcement and even a military that was out of control, just make sure you couldn’t hold them accountable.”\n  The debate comes as residents of the nation&#39;s capital witnessed a massive police presence that includes an assortment of law enforcement entities. Clashes with protesters demanding justice for George Floyd, a black man who died in custody after a Minneapolis police officer held a knee on his neck, have at times grown heated as police use tear gas and pepper spray to control crowds.\n  As temperatures on Wednesday hovered around 90 degrees, a line of several dozen armed men in black helmets leaned on riot shields and stared stone-faced at protesters chanting slogans, including &#34;Who are you protecting?&#34;\n Let our news meet your inbox. The news and stories that matters, delivered weekday mornings.\n The question wasn&#39;t entirely rhetorical. The men did not speak, either to protesters or reporters. They wore no insignia of rank or unit. They carried no badges, and their black tactical vests bore no name plate. Some wore grey cargo pants, others black. Some wore green T-shirts with a Texas flag visible on the shoulder. Others wore black, with the acronym SORT partially visible — the only clue that these men were federal agents, members of the Bureau of Prisons Special Operations Response Team.\n  House Speaker Nancy Pelosi, D-Calif., escalated the issue Thursday by writing a  letter to President Donald Trump expressing concern that the presence of unidentified officers could lead to &#34;chaos.&#34;\n &#34;I am writing to request a full list of the agencies involved and clarifications of the roles and responsibilities of the troops and federal law enforcement resources operating in the city,&#34; she wrote, saying Americans must know &#34;who is in charge, what is the chain of command, what is the mission.&#34;\n At a media briefing on Thursday, Attorney General William Barr said that he was not aware of any Bureau of Prisons personnel being told not to identify themselves and said since they normally don’t operate outside of prisons, they don’t need to identify themselves.\n  “I probably should’ve done a better job of marking them nationally as the agency,” he conceded.\n  The Democratic-led House is likely to take up a package of police reforms later this month, Beyer said, adding that he would push Pelosi to include his proposal, which he expects to release with cosponsors as early as next week. It would need to get through the Senate, which is controlled by Republican allies of President Donald Trump.\n House Minority Leader Kevin McCarthy, R-Calif., said the issue is &#34;something that definitely we can look at&#34; and noted that people have impersonated officers in the past.\n &#34;I want to make sure the officers are protected when they are out there. And I also want to make sure the officers — that we know they are officers too and that they are protected, that we know who we are dealing with and there isn’t a false representation,&#34; he told reporters Thursday.\n But he went on to say that given the current situation, “there are going to be officers in different dress out there and they are not going to identify themselves to protect and gather information, they have all the right to do it, and that’s appropriate.”\n   Rep. Raja Krishnamoorthi of Illinois wrote Barr a letter Thursday asking what orders the agents were given that led to their lack of identification on their uniforms. He asked what orders led them to say only that they were with the &#34;Department of Justice&#34; and &#34;the federal government.&#34; And he asked for the details of how many Bureau of Prisons forces were deployed and from where.\n The letter was co-signed by House Democratic Conference Chair Hakeem Jeffries, D-N.Y., Sen. Elizabeth Warren, D-Mass., a potential vice presidential prospect, and Sen. Cory Booker, D-N.J.\n Back outside the White House. Today the perimeter has been pushed back another half block. Federal law enforcement of some kind, but they won’t identify themselves, and all insignias and name plates have been removed.  pic.twitter.com/q5dmdMgkLV\n— Garrett Haake (@GarrettHaake)  June 3, 2020\n Murphy said allowing unmarked officers to police a demonstration is unsafe and “allows for really dangerous potential mischief.”\n  &#34;What would then stop some civilian right-wing militia from putting people down inside a protest and claiming that they’re Federal Security just like these other unidentified uniformed security officers?&#34; he asked. &#34;We need to make sure that every single person that is involved in security from the federal government is identified.&#34;\n The senator&#39;s office said plans to introduce his bill with Senate Minority Leader Chuck Schumer, D-N.Y., later Thursday.\n He called on the Trump administration to end the practice immediately and suggested he could find Republican support to force the issue.\n &#34;I don&#39;t think Republicans are terribly excited about having unmarked unidentified law enforcement officers patrolling the streets of this country,&#34; Murphy said. &#34;And so I think this is something that we could find bipartisan cooperation with.&#34;", "posttime": "2020-06-05 06:12:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "寻求,seek,警察", "title": "民主党人寻求取缔无标志警察在华盛顿特区抗议活动中巡逻", "title_en": "Democrats seek to outlaw unmarked police as they patrol D.C. protests", "transed": 1, "url": "https://www.nbcnews.com/politics/white-house/i-was-horrified-democrats-seek-outlaw-unmarked-police-they-patrol-n1225016", "via": "", "real_tags": ["寻求", "seek", "警察"]}, {"category": "", "categoryclass": "", "imagename": "a49ac348ef2f0c278b405a9a5da96f7f.jpg", "infoid": 1005206, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，我一直在我自己的内部部署和共享服务器上使用Nextcloud，这是一个很棒的开源基础设施即服务(IaaS)云。它运行良好，设置简单，主要工作是取代公共云存储服务，如Google Drive、Microsoft OneDrive和Dropbox。在这个最新版本中，Nextcloud Hub 19还对其内置的办公软件即服务(SaaS)程序进行了改进。\nNextcloud首席执行官弗兰克·卡利切克(Frank Karlitschek)解释说，此次发布之所以命名为Home Office，是因为COVID加速了许多企业已经出现的趋势，迫使他们为员工提供安全的远程协作解决方案。我们将我们的版本命名为Home Office，因为它为雇佣大量家庭办公室员工的组织提供了极大的生产力提升，就像我们自己一样。\n新的Nextcloud Hub功能将文档协作添加到视频聊天中，大大简化了身份验证，并极大地提高了性能。\n有多大？到处都是。这里有三个例子。如果你正在使用ftp，你读取文件的速度最多可以提高500%。您还可以将扫描文件的速度提高2.5倍。而且，在LibreOffice OpenDocument文件和Krita Paint文件中，您可以将缩略图的成像速度提高25%-50%。\nNextcloud也在从密码安全转向WebAuthn。这是一种新兴的无密码安全登录标准。有了它，你可以使用Nitrokey开源的、兼容FIDO2的、硬件安全密钥、Windows Hello和其他硬件密钥。它还提供了其他身份验证选项可供选择，比通常的用户名/密码组合具有更强的帐户安全性(因此经常被破解)。\nNextcloud也有自己的内置视频会议和小组会议服务：Nextcloud Talk。在这里，最有趣的新功能是您现在可以在视频通话期间或在聊天室中编辑office Collabora文档。Collabora是流行的开源LibreOffice办公套件的SaaS版本。\n虽然Nextcloud和Collabora长期以来一直携手合作，但Nextcloud Hub 19是第一个将Collabora Online与其一起准备运行的公司。这是一个特殊的社区服务器版本，极大地简化了它的安装。我自己做了这件事，这真是一件好事。手动将它们安装在一起绝非易事。\n不幸的是，正如Nextcloud承认的那样，这个版本牺牲了可伸缩性，以此来简化安装，并且不适合私人使用以外的地方。为此，我们推荐现有的Collabora Office解决方案，为小型办公室提供坞站映像，并通过NextCloud为企业提供更具可扩展性的解决方案。\n我发现它在个人使用上效果很好，但我不会再进一步推动了。虽然它在那里很好，但遗憾的是它没有走得更远。即使是可以处理5个用户的小企业、即插即用版本，对微型企业来说也是非常有用的。\n另一个有趣的Talk迷你功能是，它现在可以根据用户带宽自动调整通话质量。该程序还获得了性能和可伸缩性方面的改进，最终结果是，通过有限的互联网连接进行通话的人仍然可以成功地参与群组对话。\nNextcloud Hub的用户界面也得到了改进，使查找、共享和协作工作文件变得更容易、更快。在幕后，此版本还引入了几个重大改进：\n能够在Amazon S3存储中使用fSeek。例如，这允许您在不先下载整个文件的情况下开始播放视频文件。\n通过启用流文件，将OpenStack SWIFT的性能提升到与S3相同的水平。这意味着Nextcloud服务器不会先从SWIFT存储下载文件，然后再将其发送给用户，而是在接收数据的同时开始向前发送数据。SWIFT还进行了更新，能够处理大于5 GB的对象。\nWindows和Samba服务器消息块(SMB)存储通过更好的ACL支持得到了增强，从而隐藏了用户无权访问的文件夹，从而减少了浏览器负载和用户可能必须搜索以查找其文件的文件夹数量。\n将这一切放在一起，您就可以获得目前市面上最好的一体式私有云包。当然，还有更复杂的开源云，它们可以在特定领域做更多事情，比如OpenStack和Cloud Foundry。但是，如果您想要的是由您而不是某个供应商控制的直截了当的业务云，那么Nextcloud就是您想要的。", "note_en": "I&#39;ve used  Nextcloud, a great open-source Infrastructure-as-a-Service (IaaS) cloud, for years on both my own on-premise and shared servers. It works well, it&#39;s simple to set up, and it does the main job of replacing  public cloud storage services such as  Google Drive,  Microsoft OneDrive, and  DropBox flawlessly. With this latest edition,  Nextcloud Hub 19 is also adding improvements to its built-in, office Software-as-a-Service (SaaS) programs.\n    Frank Karlitschek, Nextcloud&#39;s CEO, explained this release is named &#34;home office,&#34; because &#34; COVID has accelerated a trend already visible in many businesses, forcing them to provide a secure remote collaboration solution to their employees. We named our release &#34;home office&#34; as it provides a large productivity boost for organizations employing many home office workers, like we do ourselves.&#34;\n New Nextcloud Hub features add document collaboration to video chats, massively simplify authentication, and greatly improve performances.\n How &#34;greatly?&#34; It&#39;s everywhere. Here are three examples. If you&#39;re using ftp, you can read files up to 500% faster. You can also scan files up to 2.5x faster. And, you can image thumbnails from 25-50% faster in  LibreOffice OpenDocument files and  Krita paint files.\n Nextcloud is also moving on from password security to  WebAuthn. This is an emerging password-less secure-login standard. With it, you can use  Nitrokey open-source,  FIDO2 compliant, hardware security keys,  Windows Hello, and other hardware keys. It also offers a choice of other authentication options with stronger account security than the usual -- and so often busted -- username/password combination.\n     Nextcloud also has its own built-in video-conferencing and group meeting service:  Nextcloud Talk. Here, the most interesting new feature is you can now edit office  Collabora documents during video calls or from within a chat room. Collabora is a SaaS version of the popular open-source  LibreOffice office suite.\n   While Nextcloud and Collabora have long worked hand-in-hand together, Nextcloud Hub 19  is the first in which Collabora Online is shipped with it ready to run. This is a special community server version, which dramatically eases its installation. Having done it myself, this is a real blessing. Installing them together manually isn&#39;t trivial.\n Unfortunately, as Nextcloud admits, &#34;This version however sacrifices scalability for this ease of installation and is not suitable beyond private use. We recommend the existing Collabora Office solutions for that, with docker images for small offices and more scalable solutions available for enterprises through Nextcloud.&#34;\n I found it worked well for personal use, but I wouldn&#39;t push it much further than that. While it&#39;s nice that it&#39;s there, it&#39;s a shame it doesn&#39;t go any farther. Even a small-business, plug-and-play version, which could handle say five users, would be really useful for micro-businesses.\n Another interesting Talk mini-feature is it now automatically scales call quality depending on users&#39; bandwidth. The program has also gotten its share of performance and scalability improvements The net result is people on Talk with limited internet connections can still participate successfully in a group conversation\n The Nextcloud Hub user interface has also been improved to make it much easier and faster to find, share, and co-operate on work files. Under the hood, this release also introduced several significant improvements:\n Ability to use &#39;fseek&#39; in Amazon  S3 storage. This allows you, for example, to start playing a video file without first downloading the entire file.\n Brought  OpenStack Swift performance to the same level of S3 by enabling the &#39;streaming&#39; file. This means the Nextcloud server doesn&#39;t first download the file from the Swift storage and then send it to the user, but starts sending the data onward while receiving. Swift was also updated to be able to deal with larger objects than 5Gb.\n Windows and Samba Server Message Block (SMB) storage was enhanced with better ACL support, hiding folders that users have no access to, reducing both the browser load and the number of folders users might have to search through to find their files.\n Put it all together and you get the best all-in-one private cloud package available today. Sure, there are more complex open-source clouds, which can do more in particular areas, such as  OpenStack and  Cloud Foundry. But, if what you want is a straight-forward business cloud, which you, and not some vendor, controls, then Nextcloud is what you want.", "posttime": "2020-06-05 05:46:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nextcloud", "title": "借助NextCloud Hub 19，NextCloud变得更大更好", "title_en": "NextCloud gets bigger and better with Nextcloud Hub 19", "transed": 1, "url": "https://www.zdnet.com/article/nextcloud-gets-bigger-and-better-with-nextcloud-hub-19/", "via": "", "real_tags": ["nextcloud"]}, {"category": "", "categoryclass": "", "imagename": "2e5cb147f9a750a6b5edcba98e4b5421.jpeg", "infoid": 1005205, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透法兰克福8月23日电-德国表示，将要求所有加油站提供电动汽车充电，以帮助消除对加油的担忧，并提振消费者对电动汽车的需求，这是其1,300亿欧元(1,460亿美元)经济复苏计划的一部分.。\n此举可能会大幅提振电动汽车需求，以及更广泛的刺激计划，其中包括对污染严重的大型内燃机运动型多功能车(SUV)车主征税，以及为电动汽车的成本提供6000欧元的补贴。\n在德国宣布这一消息之前，法国总统马克龙上周宣布了一项促进电动汽车销售的计划。\n“这是对电池驱动汽车的非常明确的承诺，并将电动机动性确立为未来的一项技术，”能源储存专家The Mobility House表示，该公司的投资者包括戴姆勒(Daimler)(DAIGn.DE)和雷诺-日产-三菱联盟(Renault-Nissan-Mitsubishi)。\n“在国际上，这使德国跻身于电池电动汽车支持的领头羊行列。”\n作为政府刺激计划的一部分，25亿欧元将用于电池生产和充电基础设施，包括壳牌(Shell)、恩吉(ENGIE.PA)和特斯拉(TSLA.O)在内的石油巨头、公用事业公司和汽车制造商都在这个领域争夺主导地位。\n由于对车辆行驶里程有限的担忧，客户对电动汽车的需求一直受到限制。在德国，去年电动汽车仅占新乘用车注册量的1.8%，其中柴油车和汽油车分别占32%和59.2%。\n根据德国汽车机构KBA的数据，在5月份168,148辆新登记中，只有5,578辆(3.3%)是电动汽车。\nQuercus Real Assets董事长兼联合创始人迭戈·比亚西(Diego Biasi)表示，德国的计划将显著推动电动汽车的采用。\n“我们知道他们不买电动车的97%原因是里程焦虑。德国的举措是试图解决这种里程焦虑的一种方式，因为这意味着你知道加油站总是开放的。“。\n根据德国能源和水行业协会BDEW的数据，截至2020年3月，德国有27,730个电动汽车充电站。\n根据BDEW的数据，要实现电动汽车的大众市场，至少需要7万个充电站和7000个快速充电站。\n由于电池组设计和电池化学的改进，电动汽车的性能在过去十年中提高了约40%。\n汽油动力汽车的燃油效率也有类似的提高，导致加油站的数量减少。根据路边援助协会ADAC的数据，加油站的数量已经从1965年的40，640个减少到2020年的14，118个。", "note_en": "FRANKFURT (Reuters) - Germany said it will oblige all petrol stations to offer electric car charging to help remove refuelling concerns and boost consumer demand for the vehicles as part of its 130 billion euro ($146 billion) economic recovery plan.\n  The move could provide a significant boost to electric vehicle demand along with the broader stimulus plan which included taxes to penalise ownership of large polluting combustion-engined sports utility vehicles and a 6,000 euro subsidy towards the cost of an electric vehicle.\n Germany’s announcement follows a French plan to boost electric car sales announced last week by President Macron.\n “It’s a very clear commitment to battery-powered vehicles and establishes electric mobility as a technology of the future,” energy storage specialist The Mobility House, whose investors include Daimler (  DAIGn.DE) and the Renault-Nissan-Mitsubishi alliance, said.\n “Internationally this puts Germany in the leading group of battery electric vehicle support.”\n As part of the government stimulus, 2.5 billion euros will be spent on battery cell production and charging infrastructure, a field where oil majors, utilities and carmakers, including Shell (  RDSa.L), Engie (  ENGIE.PA) and Tesla (  TSLA.O), are vying for dominance.\n Customer demand for electric cars has been constrained by concerns about the limited operating range of vehicles. In Germany, electric cars made up only 1.8% of new passenger car registrations last year, with diesel and petrol cars accounting for 32% and 59.2% respectively.\n Of the 168,148 new registrations in May, only 5,578 or 3.3% were electric cars according to German vehicle agency KBA.\n Diego Biasi, chairman and co-founder in Quercus Real Assets said the German plan would provide a significant boost to electric vehicle adoption.\n “We know that 97% of the reason why they’re not buying electric cars is range anxiety. The German move is a way to try and fix this range anxiety since it means you know a petrol station is always open.”\n As of March 2020, Germany had 27,730 electric car charging stations according to BDEW, Germany’s association for the energy and water industry.\n  To achieve a mass market for electric cars, at least 70,000 charging stations and 7,000 fast charging stations are required, according to BDEW.\n Electric vehicle performance has improved by around 40% in the past decade, thanks to improvements in battery pack design and cell chemistry.\n A similar improvement in fuel efficiency of gasoline powered cars has led to a reduction in the number of petrol stations. According to roadside assistance association ADAC, the number of petrol stations has fallen to 14,118 in 2020 from 40,640 in 1965.", "posttime": "2020-06-05 05:23:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "提供,require,电动汽车", "title": "德国将要求所有加油站提供电动汽车充电", "title_en": "Germany Will Require All Petrol Stations To Provide Electric Car Charging", "transed": 1, "url": "https://www.reuters.com/article/us-health-coronavirus-germany-autos-idUSKBN23B1WU", "via": "", "real_tags": ["提供", "require", "电动汽车"]}, {"category": "", "categoryclass": "", "imagename": "9b0e421b7b86efbd66012e0b06b0d1b7.png", "infoid": 1005204, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "网站仍然有能力检测访问者何时在使用Chrome的隐名(私人浏览)模式，尽管谷歌去年努力打破了这一做法。\n例如，一些用户使用隐名模式绕过内容付费墙和各种内容过滤器/限制器。此外，目前大多数浏览器中的隐姓埋名(私人浏览)模式还带有积极的反跟踪功能，这些功能可以阻止网站跟踪其流量并将其完全货币化。\n这两个问题--以及私人浏览的固有用途--都给网站造成了直接的经济损失，也是近年来检测隐姓埋名模式的脚本变得流行的主要原因。\n2019年初，谷歌决定对这类脚本采取立场。2019年7月发布的Chrome 76包含了一项更新，可以阻止网站使用文件系统API来检测用户使用的是Chrome的正常浏览模式还是隐姓埋名模式。\n在Chrome76之前，文件系统API在隐名模式下是不可用的，网站操作员只需查询此API就可以找出用户是否在使用隐名模式。在Chrome76中，谷歌激活了隐名模式窗口的文件系统API，使得之前的检测脚本变得毫无用处。然而，这一更新并不是万无一失的。谷歌并没有完全激活文件系统API，只是将匿名模式窗口可以访问的存储空间硬性限制为120MB。\n在Chrome 76发布后，程序员花了不到一周的时间才发现发生了什么，并开发了探测文件系统API的脚本，以确定网站可以访问的存储空间量，并间接检测用户是否正在使用隐名模式。\n2019年8月发布了两个不同的剧本[1，2]，其中一个甚至登上了《纽约时报》的网站，证实了这些剧本在许多在线内容出版商中是多么受欢迎。\n在回答科技新闻网站嘟嘟电脑的一个问题时，谷歌在2019年8月承诺修复旁路并阻止隐姓埋名模式检测。\n然而，9个月后，在Chrome和所有其他基于Chromium的浏览器(如Edge、Opera、Vivaldi和Brave)中仍然可以检测到隐名模式，所有这些浏览器都共享Chrome代码库的核心。\n此外，开发人员采用了去年共享的脚本，并将对非Chrome浏览器的支持扩展到非Chrome浏览器，如Firefox和Safari，允许网站全面屏蔽匿名模式的用户。\n目前，新的Chrome更新阻止隐姓埋名模式检测没有最后期限，然而，今天，谷歌可能比以往任何时候都更有兴趣解决这个问题。\n周二，该公司在一起集体诉讼中被点名，其广告部门被控秘密跟踪用户，即使他们是在匿名模式下浏览网络。\n像谷歌这样的广告商都有一系列指标来跟踪正常模式和隐姓埋名模式的用户。屏蔽隐姓埋名模式检测不会阻止广告商在隐姓埋名模式下跟踪用户，因为网站运营商和广告商仍将看到IP地址和其他流量数据等信息。然而，这将帮助谷歌赢得一些用户的信任，他们中的许多人关心自己的隐私，不喜欢因为他们处于隐姓埋名模式而被网站拒绝提供服务。", "note_en": "Websites are still capable of detecting when a visitor is using Chrome&#39;s incognito (private browsing) mode, despite Google&#39;s efforts last year to disrupt the practice.\n  For example, some users employ incognito mode to bypass content paywalls and various content filters/limiters. In addition, current incognito (private browsing) modes in most browsers today also ship with aggressive anti-tracking features that block websites from tracking and fully monetizing their traffic.\n Both issues -- and the inherent use of private browsing -- result in direct financial losses to websites and the primary reasons why scripts that detect incognito modes have become popular in recent years.\n  In early 2019, Google decided to  take a stance against such scripts. Chrome 76, released in July 2019, included an update that blocked websites from using the FileSystem API to detect if a user was using Chrome&#39;s normal browsing mode or its incognito mode.\n   Before Chrome 76, the FileSystem API was simply not available in incognito mode, and website operators only had to query this API to find out if a user was using incognito mode. With Chrome 76, Google activated the FileSystem API for incognito mode windows making previous detection scripts useless. However, this update wasn&#39;t foolproof. Google didn&#39;t fully activate the FileSystem API, but merely set up a hard limit to the amount of storage space that incognito mode windows could access, at 120 MB.\n It took programmers under a week after the Chrome 76 release to discover what was happening, and develop scripts that probed the FileSystem API to determine the amount of storage space a website could access, and indirectly detect if the user was using incognito mode or not.\n   Two different scripts were released in August 2019 [ 1,  2], and one of them even  made its way into the New York Times&#39; website, confirming how popular these scripts are with many online content publishers.\n  Answering a question from tech news site  Bleeping Computer, Google promised in August 2019 to fix the bypass and block incognito mode detections.\n However, nine months later, it is still possible to detect incognito mode in Chrome, and all the other Chromium-based browsers, such as Edge, Opera, Vivaldi, and Brave, all of which share the core of Chrome&#39;s codebase.\n Furthermore, developers have taken the scripts shared last year and have  expanded support to non-Chrome browsers, such as Firefox and Safari, allowing sites to block users in incognito mode across the board.\n Currently, there is no deadline for a new Chrome update to block incognito mode detections, however, today, Google might be interested more than ever in fixing this issue.\n On Tuesday, the company has been  named in a class-action lawsuit where its ad division has been accused of secretly tracking users even if they were navigating the web in incognito mode.\n Advertisers like Google have a bevy of indicators to track users in both normal and incognito mode alike. Blocking incognito mode detection won&#39;t stop advertisers from tracking users in incognito mode, as both website operators and advertisers will still see information such as IP addresses and other traffic data. However, it will help Google earn some good faith with its users, many of which care about their privacy and don&#39;t like to be denied service by websites just because they&#39;re in incognito mode.", "posttime": "2020-06-05 05:22:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "chrome,模式,mode,网站", "title": "隐身模式检测在Chrome中仍然有效，尽管承诺修复", "title_en": "Incognito Mode Detection Still Works in Chrome Despite Promise To Fix", "transed": 1, "url": "https://www.zdnet.com/article/incognito-mode-detection-still-works-in-chrome-despite-promise-to-fix/", "via": "", "real_tags": ["chrome", "模式", "mode", "网站"]}, {"category": "", "categoryclass": "", "imagename": "7c27e0a3e1ba29183af76ea17d293660.jpg", "infoid": 1005203, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "NSS在执行DSA签名时显示出时间差异，这是可攻击的，最终可能会泄露私钥。\n浏览恶意页面时，可能会发生SharedWorkerService中的争用条件，并导致潜在的可利用漏洞崩溃。\nMozilla开发人员Iain爱尔兰在移除未装箱的对象时发现缺少类型检查，导致崩溃。我们假设只要付出足够的努力，就可以利用它来运行任意代码。\nMozilla开发人员汤姆·董和卡尔·汤姆林森报告了Firefox68.8中存在的内存安全错误。其中一些错误显示了内存损坏的证据，我们推测，只要付出足够的努力，其中一些错误就可以被利用来运行任意代码。\n如果Thunderbird配置为对IMAP服务器使用STARTTLS，并且服务器发送PREAUTH响应，则Thunderbird将继续使用未加密的连接，从而导致电子邮件数据在没有保护的情况下发送。", "note_en": "NSS has shown timing differences when performing DSA signatures, which was exploitable and could eventually leak private keys.\n When browsing a malicious page, a race condition in our SharedWorkerService could occur and lead to a potentially exploitable crash.\n Mozilla developer Iain Ireland discovered a missing type check during unboxed objects removal, resulting in a crash. We presume that with enough effort that it could be exploited to run arbitrary code.\n Mozilla developers Tom Tung and Karl Tomlinson reported memory safety bugs present in Firefox 68.8. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code.\n If Thunderbird is configured to use STARTTLS for an IMAPserver, and the server sends a PREAUTH response, thenThunderbird will continue with an unencrypted connection,causing email data to be sent without protection.", "posttime": "2020-06-05 05:21:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,信息,information,导致", "title": "CVE-2020-12398：IMAP STARTTLS安全降级导致信息泄露", "title_en": "CVE-2020-12398: Security downgrade with IMAP STARTTLS leads to information leaka", "transed": 1, "url": "https://www.mozilla.org/en-US/security/advisories/mfsa2020-22/#CVE-2020-12398", "via": "", "real_tags": ["2020", "信息", "导致"]}, {"category": "", "categoryclass": "", "imagename": "9d9520022451e61a3cb2a9abdb03a924.png", "infoid": 1005202, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在2020年6月4日上午，我们的警报系统开始通知团队访问GitBook内容时出现问题。我们监测到，所有的GitBook内容都逐渐且迅速地变得不可用。到了中午，我们的大部分内容都无法访问，甚至到了无法使用@gitbook.com邮件收发电子邮件的地步。\n这份报告旨在解释发生了什么，我们是如何行动的，以及我们正在做些什么来防止这种情况再次发生。\nGoogle域名暂停了我们的域名，因为我们已经暂停了一个网站上的钓鱼活动。\n我们减轻了自定义域的影响，并与他们的支持团队进行了一天的零星交流，直到他们最终解除暂停。\n展望未来，我们将提高恶意内容检测和暂停账户的速度。\n由于我们的服务本身报告正常，我们很快意识到问题要么出在我们的DNS提供商，要么出在GitBook域。\n在格林尼治标准时间06：48，我们收到了来自Google域名团队的第一次通信，通知我们所有的GitBook域名都因为钓鱼活动的报告而被暂停。\nGitBook是一个内容创作平台。我们允许任何人编写内容并将其发布给他们的团队或公众。\n我们的绝大多数用户都在使用GitBook来编写更好的内容和分享知识。然而，少数用户(通常是机器人用户)滥用GitBook平台创建垃圾内容或试图冒充他人的内容，以便从访问者那里钓鱼信息。\n从第一天起，我们就一直在处理此类滥用行为。我们要求用户使用电子邮件和电话号码验证他们的帐户，以便我们知道他们是真实的，我们有能力在看到用户滥用平台时立即删除内容并将其禁止，我们的支持团队会尽职尽责地响应这类请求。\n在过去的几周里，我们看到GitBook平台上的钓鱼内容有所增加。在一些勤奋的用户的帮助下，我们识别了这些内容，并禁止了所有涉及的账户。谷歌也在内部识别了这些内容，并将其标记为针对我们，这最终导致了我们所有域名的全面禁止。\n我们积极设计我们的整个系统，以便能够处理失败的事情。我们尽可能使用无服务器架构，并在需要部署我们自己的服务器时采用多节点故障转移策略。\n不幸的是，域名注册商是您无法减轻的单一故障点。如果您的注册商决定停止处理gitbook.com&34；，您将完全受他们的摆布。DNS和域处理是导致大量中断的原因，尤其是在最近几年。\n我们立即全力以赴，让一切恢复正常。我们最初的反应是与Google域名支持团队开通一条沟通渠道，了解报告了哪些内容，以及我们可以做些什么来让事情恢复正常。\n在格林尼治标准时间08：06，我们收到一封电子邮件，通知我们已经报告的特定域名(特别是，我们已经在GitBook上禁用了)，以及解锁我们的域名所需的步骤(这包括对内容的第三方扫描和GitBook整体的漏洞报告-显然在短期内无法实现)。\n由于是我们的整个域名被暂停，GitBook域名除了拼命寻找谷歌支持团队的人来处理我们的案件之外，没有任何解决方案。\n我们的许多用户都连接了他们的自定义域，以指向他们的GitBook内容。对于这些用户，我们设置了一个临时工作域，并要求我们的用户将他们的CNAME条目修改为我们的新域。我们设法启动了CloudFlare Worker，并在UTC时间09：30左右开始运行，并开始让我们的自定义域客户端了解如何使用变通方法。\n大约在格林尼治标准时间11点左右，我们设法通过实时聊天与Google域名支持团队的某个人取得了联系。他们告诉我们，此案已升级到合规团队，我们将在24-48小时内通过电子邮件收到他们的回复……。发送到他们刚挂起的域中的电子邮件地址.。\n随着压力上升到无法克服的程度，我们疯狂地将时间分成两部分，一是试图与任何可以看到我们案例的人联系，二是在Twitter和对讲机上向我们的客户做出回应，二是试图集思广益，在不依赖谷歌回应的情况下解决问题。\n我们的内容筛选器会检测到恶意GitBook，并且帐户会因网络钓鱼活动而被暂停。\n世界标准时间06：48-我们收到一封来自谷歌的电子邮件，告诉我们我们的域名已被暂停。\n格林尼治标准时间08：06-我们收到一封来自谷歌的后续电子邮件，告诉我们是哪些内容导致了暂停。\n11：00 UTC-我们设法通过实时聊天与Google域名支持人员取得联系。\n停机期间没有客户数据丢失。屏蔽我们的域名意味着我们的服务无法访问，但它们仍然在关起门来正常工作。\n我们承担对Gitbook上的内容进行审核的全部责任。这种情况突显了我们需要更好地处理这一问题。我们最初的步骤包括：\n检测和阻止发布的恶意内容。在过去的几周里，我们检测垃圾邮件的能力有了很大的提高，但我们仍然只是被动地做这件事。我们会让所有GitBook网站在重新发布时通过我们的内容过滤器。\n最终，我们觉得原来是钓鱼问题的问题变成了一场彻底的灾难，这是因为它在域级上的处理方式。对于允许用户生成内容的产品来说，恶意内容是一个问题，而且永远都是一个问题。我们需要找到一个域名提供商谁理解这一点，并与我们合作，而不是反对我们，所以我们打算离开谷歌域名。以下是我们的理由：\n我们从谷歌收到的第一封电子邮件是告诉我们，他们已经暂停了我们的域名。我们没有收到任何关于他们已收到报告或正在调查的警告。\n最初被报道的GitBook网站是一个钓鱼账户，我们现在已经知道这个账户一个多星期了。这些内容已被扫描，被识别为恶意内容，并立即被禁止。\n这意味着我们在6月4日收到的停职是基于谷歌至少一周前收到的信息。在这种情况下，我们的行动是正确的，并暂停了我们这边的账户，但谷歌在他们发布禁令的那一刻并没有再次检查(甚至没有告诉我们已经做出了报告)。\n谷歌域名不适合托管用户内容的网站。一旦检测到站点上的单个URL是恶意的，整个域就会被禁止。与谷歌域名团队比较有趣的交流之一(尽管当时肯定不是)是关于谷歌自己是否会将他们的域名服务用于自己的产品。想象一下，由于一条垃圾内容，整个博客或YouTube都会崩溃。\n总体而言，与支持团队的沟通很差。我们从他们那里收到的信息很少，我们收到的信息很少，也没有什么帮助。我们一度非常需要一个联系点，以至于我们求助于使用我们的人才经理来尝试在LinkedIn上寻找Google域名工程师。\n作为一家产品公司，最令人沮丧的感觉之一是，当你知道某件事正在伤害你的用户时，你却无力修复它。许多GitBook客户都在使用我们的产品向他们自己的用户提供内容，今天我们把他们放在和我们一样的情况下。\n我们要感谢我们的用户在我们工作期间的耐心和理解。尽管每个人都处于困难的境地，但我们的大多数用户都普遍表示支持。请放心，我们将尽我们所能从错误中吸取教训，并确保这一系列事件不会重演。", "note_en": "During the morning of the 4th June 2020, our alerting system started notifying the team that there were problems accessing GitBook content. We monitored that all GitBook content was gradually and rapidly becoming unavailable. By midday, the majority of our content was inaccessible even to the point where we couldn&#39;t send or receive emails using our @gitbook.com mails.\n This port-mortem aims to explain what happened, how we acted, and what we&#39;re doing to prevent it happening again.\n  Google Domains suspended our domains due to phishing activity on a site we had already suspended.\n We mitigated custom domains, and had a day of sporadic communication with their support team until they eventually lifted the suspension.\n Moving forward, we will be improving our malicious content detection &amp; the speed at which we suspend accounts.\n  With our services themselves reporting OK, we realised quite quickly that the problem was either with our DNS provider or the GitBook domains.\n At 06:48 UTC, we received our first communication from the Google Domains team    telling us that   all GitBook domains had been suspended due to reports of phishing activities.\n  GitBook is a content creation platform. We allow anyone to write content and publish it to their team or to the public.\n The vast majority of our users are using GitBook to write better content and share knowledge. However, a minority of (typically robotic) users abuse the GitBook platform to create spam content or content that attempts to impersonate others in order to phish information from visitors.\n We&#39;ve been dealing with this kind of abuse since day 1. We ask users to verify their accounts with an e-mail and a phone number so that we know they&#39;re genuine, we have the ability to remove content and ban users the moment we see they&#39;re abusing the platform, and our support team are diligent in responding to these kind of requests.\n Over the past few weeks, we&#39;ve seen an increase in phishing content on the GitBook platform. With the help of some of our diligent users, we identified the content and banned all accounts involved. Google had also identified this content internally and flagged it against us, which eventually led to a blanket ban across all our domains.\n  We actively design our entire system to be able to handle things failing. We use a serverless architecture where possible, and employ a multi-node failover strategy whenever we need to deploy our own servers.\n Unfortunately, a domain registrar is a single point-of-failure you can&#39;t mitigate against. If your registrar decides to stop handling &#34;gitbook.com&#34;, you&#39;re completely at their mercy. DNS and domain handling is the cause of a huge number of outages, particularly in recent years.\n  We were immediately all hands on deck to get things back up and running. Our initial response was to open up a line of communication with the Google Domains support team to find out what content had been reported and what we can do to get things back to normal.\n At 08:06 UTC, we received an email informing us of the specific domain that had been reported (and notably, that we had already banned from GitBook) and the steps necessary to unblock our domain (which involved a third-party scan of the content and a vulnerability report of GitBook as a whole - clearly nothing something attainable in the short-term).\n  As it was our entire domain that has been suspended, there was no solution for the GitBook domains besides trying desperately to find someone on the Google support team to handle our case.\n Many of our users have connected their custom domains to point to their GitBook content. For these users, we put in place a temporary working domain and asked our users to modify their CNAME entries to our new domain. We managed to spin up a CloudFlare worker and get things running around 09:30 UTC, and started letting our custom domain clients know how to use the workaround.\n  Around 11:00 UTC, we managed to get in touch with someone from the Google Domains support team via Live Chat. They told us that the case had been escalated to the compliance team and that we&#39;d have their response via e-mail in 24h-48h... sent to an e-mail address on a domain they had just suspended...\n With stress rising to insurmountable levels, we split our time frantically between trying to get in touch with literally anyone who could look at our case, responding on Twitter and Intercom to our customers, and trying to brainstorm ways of fixing the problem without relying on Google&#39;s response.\n     The malicious GitBook is detected by our content filter and the account suspended for phishing activity\n 06:48 UTC - we receive an e-mail from Google telling us our domains have been suspended.\n 08:06 UTC - we receive a follow-up e-mail from Google telling us which content caused the suspension.\n  11:00 UTC - we manage to get in touch with someone from Google Domains support via Live Chat.\n   No customer data was lost during the downtime. Blocking our domains meant that our services were inaccessible, but they were still working correctly behind closed doors.\n  We accept full responsibility for moderating the content on GitBook. This situation has highlighted we need to be better at dealing with this. Our initial steps include:\n Detecting &amp; blocking malicious content as it&#39;s published. Over the past few weeks our ability to detect spam has improved drastically, but we&#39;re still only doing it reactively. We&#39;ll be passing all GitBook sites through our content filter as they&#39;re published.\n  Ultimately, we feel that a problem what was originally a problem with phishing was turned into a complete disaster by how it was handled at the domain level. Malicious content is, and will always be, a problem for products that allow user-generated content. We need to find a domain provider who understands this and works with us rather than against us, so   we intend to move away from Google Domains.  Here are our reasons why:\n  The first e-mail we received from Google was to tell us that they had suspended our domains. We didn&#39;t receive a single warning that they had received a report or that they were investigating.\n  The GitBook site that was originally reported is a phishing account that&#39;s been known to us for over a week now. The content had been scanned, identified as malicious, and immediately banned.\n That means that the suspension we received on the 4th June was based on information received by Google   at least  a week earlier. In this case, we had acted correctly and suspended the account from our side, but Google didn&#39;t check again the moment they gave the ban (or even tell us that a report had been made).\n  Google Domains isn&#39;t suitable for sites hosting user content. As soon as a single URL on the site is detected as malicious, the entire domain is banned. One of the funnier (although certainly not at the time) exchanges with the Google Domains team was around whether Google themselves would use their domain service for their own products. Imagine the entirety of Blogger or YouTube going down due to a single piece of spam content.\n    Overall the communication with the support team was poor. We received very little communication from their side and what little we did receive was poor and unhelpful. At one point we were so desperate for a point of contact that we resorted to using our Talent Manager to try and source Google Domain engineers on LinkedIn.\n  As a product company, one of the most frustrating feelings is being powerless to fix something when you know it&#39;s harming your users. Many GitBook clients are using our product to provide content to their own users, and today we put them in the same situation as we were in.\n We want to thank our users for their patience and understanding whilst we worked through this. There was a general feeling of support from the majority of our users despite everyone being in a difficult situation. Rest assured we&#39;re going to do everything we can to learn from our mistakes and ensure this series of events doesn&#39;t repeat itself.", "posttime": "2020-06-05 05:20:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "域名,google,domains,内容", "title": "Google域名屏蔽所有Gitbook URL：事后分析", "title_en": "Google Domains blocking all Gitbook URLS: post-mortem", "transed": 1, "url": "https://blog.gitbook.com/tech/post-mortems/06-20-gitbook-domains-blocked-by-registrar", "via": "", "real_tags": ["域名", "google", "domains", "内容"]}, {"category": "", "categoryclass": "", "imagename": "4886d1fb90b9f0e66a09ba58e8c63fd0.jpg", "infoid": 1005201, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们希望帮助人们更好地了解他们在Facebook上看到的新闻背后的幕后黑手。几个月前，我们宣布了为完全或部分处于政府编辑控制下的媒体贴标签的计划，今天我们开始给这些国家控制的媒体贴上标签。我们为这些出版商提供了更高的透明度，因为他们将媒体组织的影响力与国家的战略支持结合在一起，我们认为人们应该知道他们阅读的新闻是否来自可能受到政府影响的出版物。\n为了确保我们在涉及这些出版商的付费内容时同样透明，我们将在今年晚些时候开始为这些出版商的广告贴标签。\n国家控制的媒体很少在美国做广告。然而，今年夏天晚些时候，出于高度谨慎，我们将开始屏蔽美国这些媒体的广告，以在2020年11月美国大选之前的公开辩论中提供额外的一层保护，以抵御各种类型的外国影响。\n标签将全局显示在广告库页面视图、页面上和页面透明度部分。在美国，这个标签也将在下周开始出现在News Feed的帖子上。\n今年夏天晚些时候，我们将对来自国家控制的媒体的广告贴上这个标签，从几个媒体开始，随着时间的推移增加更多的媒体。\n为了给我们的政策标准提供信息，我们咨询了世界各地超过65名专门从事媒体、治理、人权和发展方面的专家。我们从这些组织得到的意见对于理解政府对媒体实体施加编辑控制的不同方式和程度至关重要。我们知道各国政府继续使用资金机制来控制媒体，但单凭这一点并不能说明问题的全部。这就是为什么我们对国家控制的媒体的定义不仅仅是评估财务控制或所有权，还包括对政府实施的编辑控制的评估。\n基于这些咨询和研究，我们制定了自己的政策标准，以确定出版商是完全还是部分处于政府的编辑控制之下。\n关于组织如何定义和完成其新闻使命的使命声明、任务和/或公开报道\n所有权结构，如所有者、利益相关者、董事会成员、管理层、政府任命的领导职位的信息，以及担任民选职位的实体或个人直接或间接所有权的披露。\n编辑准则，如内容来源的透明度和来源的独立性和多样性。\n治理和问责机制，如惩戒政策、投诉程序、外部评估和监督委员会。\n如果我们确定有足够的保护措施来确保编辑独立性，我们将不会贴上标签。希望证明其独立性的出版商必须至少能够证明：\n东道国的法规，明确保护该组织的编辑独立性。\n由独立的、可信的外部组织进行的评估，发现法规实际上已得到遵守，并遵循了既定的程序。\n我们还考虑具体国家的因素，包括新闻自由，并咨询由学者和领先专家进行的开源研究。\n如果组织认为我们错误地贴上了标签，他们可以提出上诉。通过上诉，他们可以提供额外的文件，我们将根据我们的定义进行审查。\n随着时间的推移，随着我们将这些标签推出给更多的出版商，我们欢迎反馈，并将继续咨询专家并改进我们的方法。", "note_en": "We want to help people better understand who’s behind the news they see on Facebook. Several months ago,   we announced  our plan to label media outlets that are wholly or partially under the editorial control of their government, and today we’re starting to apply labels to those state-controlled media outlets. We’re providing greater transparency into these publishers because they combine the influence of a media organization with the strategic backing of a state, and we believe people should know if the news they read is coming from a publication that may be under the influence of a government.\n And to ensure we’re equally transparent when it comes to paid content from these publishers, we will begin labeling ads from these publishers later this year.\n State-controlled media outlets rarely advertise in the US. Nevertheless, later this summer we will begin blocking ads from these outlets in the US out of an abundance of caution to provide an extra layer of protection against various types of foreign influence in the public debate ahead of the November 2020 election in the US.\n  The labels will appear globally in the Ad Library Page view, on Pages, and in the Page Transparency section. In the US, the label will also start to appear on posts in News Feed over the course of the next week.\n Later this summer, we’ll apply the label to ads from state-controlled media outlets, starting with a few outlets and adding more over time.\n    To inform our policy criteria, we consulted more than 65 experts around the world specializing in media, governance, and human rights and development. The input we received from these organizations was crucial to understanding the different ways and degrees to which governments exert editorial control over media entities. We know that governments continue to use funding mechanisms to control media, but this alone doesn’t tell the full story. That’s why our definition of state-controlled media extends beyond just assessing financial control or ownership and includes an assessment of editorial control exerted by a government.\n Based on these consultations and research, we developed our own policy criteria to determine whether a publisher is wholly or partially under the editorial control of a government.\n  Mission statement, mandate, and/or public reporting on how the organization defines and accomplishes its journalistic mission\n Ownership structure such as information on owners, stakeholders, board members, management, government appointees in leadership positions, and disclosure of direct or indirect ownership by entities or individuals holding elected office\n Editorial guidelines such as transparency around sources of content and independence and diversity of sources\n   Governance and accountability mechanisms such as correctional policies, procedure for complaints, external assessments and oversight boards\n If we determine that there are enough protections in place to ensure editorial independence, we will not apply the label. Publishers looking to prove their independence must be able to demonstrate at least:\n A statute in the host country that clearly protects the editorial independence of the organization\n  An assessment by an independent, credible, external organization finding that the statute has in fact been complied with and established procedures have been followed\n We also consider country-specific factors, including press freedom and we consult open-source research conducted by academics and leading experts.\n If an organization believes we have applied the label in error, they can   submit an appeal.  Through the appeal, they can provide additional documentation, which we will review against our definition.\n As we roll these labels out to more publishers over time, we welcome feedback and will continue to consult with experts and refine our approach.", "posttime": "2020-06-05 05:20:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,来自,label,媒体", "title": "Facebook将为来自国家控制的媒体的内容贴标签", "title_en": "Facebook Will Label Content From State-Controlled Media", "transed": 1, "url": "https://about.fb.com/news/2020/06/labeling-state-controlled-media/", "via": "", "real_tags": ["facebook", "来自", "label", "媒体"]}, {"category": "", "categoryclass": "", "imagename": "2a5621d2b0748b90e1e29aec1f053cd8.png", "infoid": 1005199, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几年里，Emacs的电子邮件是一种我一直很感激的超能力。下面我将描述一个简单的设置，它适用于我，更重要的是，它是我喜欢的东西。这种设置让我几乎想要写描述性的电子邮件，因为它把写电子邮件的痛苦转移到了同样的生态系统中，就像我喜欢写长篇文章、程序、设计文档和其他涉及“放下我的想法”的工件一样。每当我看到一封用富文写的电子邮件，粗线条超过150个字符时，我都会毛骨悚然。\n很多时候，这让我觉得回复邮件非常详细的人在思考和回复详细邮件之间几乎不会遇到任何阻力。考虑以下问题：\n嗯，我想这不是最好的演示，但是如果你想从电子邮件中捕捉一些东西以备将来参考，那该怎么办呢？也许，你想从电子邮件中隐藏一个重要的TODO项目，并为自己做笔记。此外，自动捕获电子邮件的所有元字段(如From：、To：、Sent_Time：)不是很好吗？\n举个例子，很明显，我正在用Emacs撰写这篇文章，但我会阅读LKML并捕捉一些重要的笔记，以便稍后访问。为了不让Emacs的新用户不知所措，我不会在这篇文章中详细介绍所使用的特定软件包及其配置等。这只是为了激励合适的读者考虑使用Emacs作为他们的电子邮件客户端来提高您的工作效率，至少可以达到您不讨厌阅读/撰写电子邮件的程度。\n如果你想最大限度地减少分心(通过避免不合时宜的电子邮件弹出)，那么在离线地图上使用mu4e是非常有效的，你可以随心所欲地查看电子邮件。是的，你可以关闭通知或想出几种方法来避免分心。但由此得出的结论是，这个选项更适合我，也就是说，当我回复一封电子邮件时，我会尽量给予适当的关注。\n同样，书签对于跨文件夹保存查询筛选器特别有用。外汇：“跳转到3周前来自XYZ的邮件”\n如果您在Emacs上使用org-mode，那么您很幸运，您只需从org-capturetemplate中选择正确的关键字即可。\n好吧，我承认这些年来我花了很多不健康的时间来调整我的Emacsconfig。如果您喜欢所看到的内容，那么您可以简单地按原样使用我的配置，方法是将配置片段复制到您的.emacs中并试一试。\n希望这能刺激您的胃口，让您开始使用Emacs作为电子邮件客户端(在其他方面)配置详细信息将在另一篇…帖子中介绍。\n如果你喜欢这样的话题，请考虑订阅我的播客。我与一些科技界的铁杆人物交谈，问他们最喜欢的提高工作效率的技巧是什么：\n访问iTunes Podcast门户网站上的void Star Podcast页面。请点击“订阅”，请留言。", "note_en": "Emailing in Emacs is a super power that I have been grateful for over the pastseveral years. Below I will describe a simple setup that works for me and moreimportantly for me, it’s something I like. This setup makes me almost want towrite descriptive emails simply because it moves the pain of writing emails intothe same ecosystem that I feel comfortable writing long form articles, programs,design documents and other artifacts that involve “putting my thoughts down”. Icringe everytime I see an email written in rich text with broad lines going wellover 150 characters.\n A lot of the times it makes me think that people with very detailed emailresponses tend to almost face no resistance between thinking and putting theirthoughts in a detailed email response. Consider the following:\n   Well it’s not the best demo I guess, but what if you want to capture somethingfrom the email for future reference? Maybe, you want to stash an important TODOitem from the email and keep notes for yourself. Furthermore, won’t it nice toautomatically capture all the meta fields of the email, such as  from:,  to:, sent_time:\n Take this for example, I am composing this post, obviously, in Emacs but I willread LKML and capture some important notes that I can later access. In order tonot overwhelm an new Emacs user I won’t go into the weeds with the specificpackages used and their configurations etc in this post. This is just tomotivate the right reader to think of using Emacs as their email client to boostyour productivity, well at least to get to a point where you don’t hatereading/writing emails.\n   If you want to minimize distractions (by avoiding an untimely email pop-up) thenusing  mu4e on top of  offlineimap is very effective, you get to check emailsat your wish. Yes, you can turn off notifications or come up with several waysto avoid distractions. But the corollary of this is what makes this option moresuitable for me, i.e., when I respond to an email I try to give it properattention.\n     Similarly, bookmarking is particularly useful to save your query filters across folders. Forex: “Jump to Mails From XYZ from 3 weeks ago”\n If you use  org-mode on Emacs then you arein luck, you simply select the right keyword from  org-capturetemplate.\n OK, I will admit that I have spent unhealthy amounts of time tweaking my Emacsconfig over the years. If you like what you see then you can simply start byusing my config as-is, by copying pieces of config in to your  .emacs andgiving it a whirr.\n Hope that whets your appetite to start using Emacs as an email client (amongother things) Config details coming up in a separate post…\n      If you like topics such as this then please consider subscribing to mypodcast. I talk to some of the stalwarts in tech and ask them what theirfavorite productivity hacks are:\n  Visit Void Star Podcast’s page on iTunes Podcast Portal. Please Click ‘Subscribe’, leave a comment.", "posttime": "2020-06-05 04:59:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "emacs,客户端,email,电子邮件", "title": "作为电子邮件客户端的Emacs-第一部分", "title_en": "Emacs as Email Client – Part I", "transed": 1, "url": "http://www.mycpu.org/read-email-in-emacs/", "via": "", "real_tags": ["emacs", "客户端", "email", "电子邮件"]}, {"category": "", "categoryclass": "", "imagename": "be0893e502534a8b306e95f7ce683919.jpeg", "infoid": 1005198, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据“华盛顿邮报”获得的房地产研究公司Datex Property Solutions的数据，由于冠状病毒关闭导致收入大幅下降，美国超过一半的零售商在4月和5月没有支付租金。\n据“华盛顿邮报”的希瑟·朗(Heather Long)报道，Bed Bath&amp；Beyond、著名鞋业、H&amp；M、Gap、AMC和Regal电影院，以及24小时健身房都拖欠了款项，危及它们的物业管理公司和依赖物业税的市政府的稳定。\n许多零售商向他们的房东寻求帮助，但都无济于事。对于一些企业来说，甚至很难确定要问谁，因为大多数商业地产属于房地产投资信托基金和商业抵押贷款支持证券(MBS)的投资者。\n立法者通过立法，要求房东同意付款计划，但房东告诉Long，他们也在苦苦挣扎。", "note_en": "More than half of America&#39;s retailers didn&#39;t pay their rent in April and May as coronavirus closures decimated their revenues, according to data from real estate research firm Datex Property Solutions obtained by  The Washington Post.\n Bed Bath &amp; Beyond, Famous Footwear, H&amp;M, and the Gap, AMC and Regal movie theaters, and 24 Hour Fitness gyms have all missed payments, jeopardizing the stability of their property management companies and municipal governments that rely on property taxes,  The Post&#39;s Heather Long reported.\n Many retailers have asked for assistance from their landlords to no avail. For some businesses, even pinpointing who to ask can be difficult as the majority of commercial properties are owned by real estate investment trusts and investors in commercial mortgage-backed securities.\n Lawmakers passed legislation requiring landlords to agree to payment plans, but landlords told  Long that they are also struggling.", "posttime": "2020-06-05 04:59:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "支付,retailers,房东", "title": "超过一半的美国零售商在4月和5月没有支付租金", "title_en": "More than half of American retailers didn't pay their rent in April and May", "transed": 1, "url": "https://www.businessinsider.com/retailers-didnt-pay-rent-may-upset-the-entire-economy-2020-6", "via": "", "real_tags": ["支付", "retailers", "房东"]}, {"category": "", "categoryclass": "", "imagename": "ca137f8b1df814fb050b2cd4982d640e.png", "infoid": 1005196, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "..。还有无数没有列在这里的名字，他们的生命是被暴力和残暴夺走的。\n我们列出了自2009年以来在美国被警察暴行杀害的黑人的名字，这既是因为美国是黑人生命也是运动的发源地，也是目前抵抗运动的核心。\n话虽如此，我们完全认识到白人至上和警察暴行是一个全球性问题。虽然我们没有列出所有在全球范围内死于警察谋杀的黑人，但他们的生命很重要。\n我们忽视Node.js中存在的不劳而获的特权是错误的：大部分项目领导层是白人，大多数是男性。我们现在是，而且一直是系统地共谋，使导致我们今天所处位置的问题永久化。到目前为止，我们不能改变我们建立项目领导力的方式，但我们可以改变我们未来建立它的方式。我们致力于成为解决方案的一部分，积极以黑人社区为中心，以我们的集体平台提升黑人的声音，分享由黑人社区成员创建和建设的项目，并积极履行我们的承诺，并根据需要做出改变。虽然追究我们的责任是我们的责任，而不是社区的工作，但我们欢迎您分享我们可以通过电子邮件(受保护的电子邮件)或单独联系我们的任何项目负责人来做得更好的方法。\n打破白人至上地位的劳动不是落在黑人社区身上，而是落在我们其余的人身上。如果有黑人寻求合作、放大、指导、指导或任何形式的支持，我们都会在这里为你服务(见下文)。\n从我们即将到来的合作者峰会活动开始，并延伸到更远的地方，我们将为社区中希望成为Node.js项目贡献者的黑人成员提供指导。如果您对此感兴趣，请发送电子邮件至[受保护的电子邮件]或在Twitter上直接发送消息至@NodeJS。我们将公布更多关于我们将如何推进这一努力的信息，因为我们最终敲定了合作者峰会期间和单一活动之后的细节。\n欢迎您通过链接中分别列出的电子邮件地址联系Node.js TSC成员和Node.js社区委员会成员，或通过Twitter DM联系项目中的以下人员：\n如果您正在寻找文档，它们仍然可用。如果您正在寻找有关最新安全版本的信息，请参阅安全版本的博客文章。", "note_en": "...  and  countless  more  names not listed here whose lives were taken by violence and brutality.\n  We&#39;ve listed the names of the Black folks who have been murdered by police brutality in the U.S. dating back to 2009, both because the U.S. is the origin of the Black Lives Matter movement and currently the heart of the resistance.\n  With that said, we fully recognize that white supremacy and police brutality is a global problem. While we have not listed all of Black people who have lost their lives to police murder globally here, their lives mattered.\n    It would be wrong for us to ignore the unearned privilege that exists in Node.js: much of the project leadership is white, and a majority are men. We are and have been systematically complicit in perpetuating the issues that led to where we are now. We can&#39;t change how we&#39;ve built out the project&#39;s leadership to date, but we can change how we build it moving forward. We are dedicated to being a part of the solution by actively centering the Black community with our collective platforms to uplift Black voices, share projects founded and built by Black community members, and actively hold ourselves accountable to our promises and make changes as needed. While it is our responsibility and it is not the work of the community to hold us accountable, we welcome you to share ways that we can do better by emailing   [email protected] or reaching out individually to any of our project leaders.\n  The labor to dismantle white supremacy does not fall on Black community; it falls on the rest of us. If there are Black folks looking for collaboration, amplification, mentorship, guidance, or any sort of support, we&#39;re here for you (see below).\n  Beginning with our upcoming Collaborator Summit event, and extending beyond, we will be offering mentorship to Black members of the community who wish to become contributors to the Node.js project. If you are interested in this, please send us an email at   [email protected] or direct message us at  @nodejs on Twitter. We will post more information on how we will be proceeding with this effort as we finalize the details both for the period of the Collaborator summit and beyond that single event.\n  Please feel welcome to reach out to the  Node.js TSC members and  Node.js Community Committee members via our email addresses listed in the links, respectively, or via Twitter DMs to the following folks in the project:\n  If you&#39;re looking for docs, they&#39;re  still available. If you&#39;re looking for information on the most recent security release, please see  the security release blog post.", "posttime": "2020-06-05 04:56:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "js,黑人", "title": "Node.js主页", "title_en": "Node.js homepage", "transed": 1, "url": "https://nodejs.org/en/", "via": "", "real_tags": ["js", "黑人"]}, {"category": "", "categoryclass": "", "imagename": "a44ea441862a6a13a922ab99d8dcae27.png", "infoid": 1005193, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Dropbox刚刚在Play Store上无礼地丢弃了一款全新的应用程序，没有大张旗鼓，也没有正式宣布。据报道，新的Dropbox密码应用程序", "note_en": "Dropbox just unceremoniously dumped a brand new app on the Play Store with no fanfare or formal announcement. The new Dropbox Passwords app, according to", "posttime": "2020-06-05 04:05:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "密码,开发,working,store", "title": "Dropbox正在开发自己的密码管理器", "title_en": "Dropbox is Working On Its Own Password Manager", "transed": 1, "url": "https://www.androidpolice.com/2020/06/04/dropbox-is-working-on-its-own-password-manager/", "via": "", "real_tags": ["密码", "开发", "working", "store"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005191, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Unix理念强调构建简单和可扩展的软件。每个软件必须做一件事并且做好它。而且该软件应该能够通过一个公共界面--文本流--与其他程序协同工作。这是Unix的核心理念之一，它使ITSO功能强大、使用直观。\n尽管UNIX系统引入了许多创新的程序和技术，但没有一个单一的程序或想法能让它很好地工作。相反，让SIT变得有效的是编程方法，一种使用计算机的哲学。虽然这一哲学不能用一句话写下来，但其核心是这样一种观点，即系统的力量更多地来自于程序之间的关系，而不是来自程序本身。许多UNIX程序孤立地做一些相当琐碎的事情，但与其他程序结合在一起，就会成为通用而有用的工具。\n我想这很好地解释了这一点。此外，请观看BrianKernighan成为一名彻头彻尾的Chad，并解释UNIX OS的基本原理，在那里他还介绍了一个使用管道的示例。\n不过，在这篇文章中，我想展示一些实践这一理念的例子--人们如何将不同的Unix工具结合在一起来完成一些强大的工作。\n让我们从一个简单的列表开始-根据提交次数显示gitrepo的作者/贡献者列表，并按降序对列表进行排序(大多数提交位于顶部)。这是一项简单的任务，当你从管线的角度来考虑它的时候。Git日志用于显示提交日志。我们可以将--format=&lt；format&gt；选项传递给它，并说明我们希望以什么格式显示提交。--format=&#39；%an&#39；只打印每次提交的作者姓名。\n$git日志--格式=&#39；%an&#39；|排序|uniq-c 4 Alice 1 Bob 1 Candice 3 Denise。\n因此，uniq会打印出重复的行，但只打印彼此相邻的行。这就是我们必须首先传递输出进行排序的原因。c标志根据出现的次数为每行添加前缀。\n您可以看到输出仍然按字母顺序排序。所以现在剩下的就是按数字排序了。在排序中有一个标志，-n标志。它根据数字的数值来考虑数字。\n$git日志--格式=&#39；%an&#39；|SORT|uniq-c|SORT-nr 4 Alice 3 Denise 1 Candice 1 Bob。\n还包括了-r标志，以便以相反的顺序打印列表。默认情况下，按升序对其进行排序。他们的“你有”--根据提交次数排序的作者列表。\n您知道吗？您只需将“.json”附加到reddit url即可获得jsonresponse，而不是通常的html。这就提供了一个可能的世界！其中之一就是直接从命令行浏览表情包(并不完全是这样，因为实际的图像将显示在GUI程序上)。我们可以简单地将URL-https://reddit.com/r/memes.json。\n$wget-O--Q&#39；https://reddit.com/r/memes.json&#39；&#39；{&#34；Kind&#34；：&#34；Listing&#34；，&#34；Data&#34；：{&#34；modhash&#34；：&#34；xyloiccqgm649f320569f4efb427cdcbd89e68aeceeda8fe1a&#34；，&#34；dist&#34；：27，&#34；子项&#34；：[{&#34；Kind&#34；：&#34；T3&#34；，&#34；数据&#34；：{&#34；Approved_at_UTC&#34；：NULL，&#34；subreddit&#34；：&#34；Memes&#34；，&#34；selftext&#34；：&#34；有关更多信息，请访问.&#39；.更多行.。\n我在这里使用wget是因为似乎Curl用户代理得到了不同的对待。显然，您可以通过简单地更改“User-Agent”头来绕过这个问题，但我只使用了wget。Wget有一个-O来提供输出文件名。大多数采用这种选项的程序也允许valueOf-它表示标准输出或输入，具体取决于上下文。-q选项只告诉wget保持安静，而不是打印诸如Progress sstatus之类的内容。现在我们可以使用一个大型的JSON结构。现在，要在命令行上有意义地解析和使用此JSON数据，我们可以使用JQ。JQ可以被认为是JSON的sed/尴尬。它有一种简单直观的语言，您可以参考FROMIT的手册页。\n{&#34；Kind&#34；：&#34；Listing&#34；，&#34；Data&#34；：{&#34；modhash&#34；：&#34；awe40m26lde06517c260e2071117e208f8c9b5b29e1da12bf7&#34；，&#34；dist&#34；：27，&#34；子项&#34；：[]，&#34；之后&#34；：&#34；T3_gi892x&#34；，&#34；之前&#34；：NULL}}。\n所以这里我们有一些“Listing”类型的响应，我们可以看到我们有一个“Child”数组。该数组的每个元素都是一个帖子。\n这是“Child”数组中的一个元素：\n{&#34；Kind&#34；：&#34；T3&#34；，&#34；Data&#34；：{&#34；subreddit&#34；：&#34；memes&#34；，&#34；selftext&#34；：&#34；&#34；，&#34；创建&#34；：1589309289，&#34；Author_Fullname&#34；：&#34；T2_4amma5w&#34；，：0，&#34；Title&#34；：&#34；，&#34；subreddit_name_prefix&#34；：&#34；r/memes&#34；，&#34；down&#34；：0，&#34；Hide_Score&#34；：false，&#34；name&#34；：&#34；T3_gi8wkj&#34；，&#34；隔离&#。：FALSE，&#34；permalink&#34；：&#34；/r/memes/comments/gi8wkj/its_hard_to_argue_with_his_assessment/&#34；，&#34；url&#34；：&#34；https://i.redd.it/6vi05eobdby41.jpg&#34；，&#34；upVote_Ratio&#34；：0.9，&#34；subreddit_type&#34；：&#34；PUBLIC&#34；，&#34；&#34；https://b.thumbs.redditmedia.com/QZt8_SBJDdKLVnXK8P4Wr_02ALEhGoGFEeNhpsyIfvw.jpg&#34；，&#34；：11367，&#34；TOTAL_ARMARDS_RECEIVED&#34；：0，&#34；分数&#34；：11367，&#34；作者_高级&#34；：FALSE，&#34；缩略图&#34；：UPS&#34；镀金&#34；：{}，&#34；POST_HINT&#34；：&#34；image&#34；，&#34；.&#34；&#34；&#34；&#34；.&#34；}}。\n我已经减少了数据中键值对的数量。总共有105个项目。如您所见，您可以从帖子中获取许多有趣的数据属性。我们感兴趣的是帖子的url。这不是真正的reddit帖子的url，而是帖子内容的url。如果帖子的url是您想要的，那么它就是永久链接。因此，在本例中，url字段是meme图像的url。\n我们可以使用以下命令简单地获取每个帖子的所有URL的列表：\n忽略前两个链接，它们基本上是MODS发布的粘性帖子，它们的‘url’与‘permalink’是一样的。\nJQ从标准输入读取，并提供给我们前面看到的JSON。.data.Children指的是我前面提到的帖子数组。而-.data.Children[]|.data.url的意思是“遍历数组中的每个元素，并打印每个元素的‘data’字段中的‘url’字段”。\n所以我们得到了/r/memes“热门”帖子的所有URL列表。如果你想获得本周最热门的帖子，那么你可以点击https://reddit.com/r/memes/top.json?t=week.。史上最高职位？t=全部，年份？T=年份，依此类推。\n一旦我们有了所有URL的列表，我们现在就可以将其通过管道传输到xarg.xargs是一个从标准输入构建命令行的非常有用的实用程序。下面是xarg的手册页所说的内容：\nxargs从标准输入中读取由空格(可以用双引号或单引号或反斜杠来保护)或换行符分隔的项，并使用任何初始参数后跟从标准输入读取的项来执行命令(缺省值为/bin/echo)一次或多次。标准输入上的空行将被忽略\n现在，我们只需将URL列表传递给图像查看器，比如接受URL作为有效参数的feh或eogh。\n现在，feh弹出了表情包，我可以像在本地磁盘上一样，用箭头键浏览它们。\n或者，我可以简单地使用wget下载所有图像，将feh替换为上面的wget。\n可能性是无穷无尽的。此reddit JSON数据的另一个很好的用途是将桌面的墙纸设置为“热门”部分中/r/Earth porn的顶部向上的图像。\n$wget-O--q reddit.com/r/Earth porn.json|jq&#39；.data.Children[]|.data.url&-|head-1|xargs feh--bg-ill。\n然后，如果您愿意，可以将其设置为每小时运行一次的cron-job。我在这里使用head命令只打印第一行，这将是顶部向上的帖子。就其本身而言，Head似乎做了一些非常琐碎和无用的事情，但在这种情况下，与其他程序一起工作，它就成了重要的一部分。\n你看到Unix管道的威力了吗？从获取JSON数据，解析并从中获取相关数据，然后再次从URL获取图像，最后将其设置为墙纸，这一行完成了所有操作。\n我用它做的另一件蠢事是每两个小时从/r/memes下载meme。这在我的机器上设置为cron作业。现在我的磁盘上大约有19566个表情包，占据了4.5G的空间。我为什么要那么做？别问我…\n让我们用一个简单的例子来结束它。IMDb有一个功能，可以让你列出名单。您还可以查找其他用户创建的列表。例如，吹爆你的脑海中的电影。如果您向URL追加/导出，您将获得.csv格式的列表。\n$cURL https://www.imdb.com/list/ls020046354/exportPosition，const，创建，修改，描述，标题类型，IMDB评级，运行时间(分钟)，年份，流派，票数，发行日期，导演1，tt0137523,2017-07-30,2017-07-30,2017-07-30，搏击俱乐部，https://www.imdb.com/title/tt0137523/，电影，8.8,139,1999，戏剧，1780706,1999-09-10，David Fincher2，t0945513,2017-07-30,2017-07-30,2017-07-30,2017-07-30,2017-07-30,1780706,1999-09-10，david fincher2，t0945513,2017-07-30,2017-07-30,2017-07-30,2017-07-30电影，7.5，93,2011，#34；动作，戏剧，神秘，科幻，颤栗#34；，471234,2011-03-11，邓肯·琼斯3，tt0482571,2017-07-30,2017-07-30，The Prestige，https://www.imdb.com/title/tt0482571/，电影，8.5,130,2006，&34；戏剧，神秘，科幻，颤栗&#34；，1133548,2006-10-17，克里斯托弗·诺兰4，t020.。神秘，颤栗&34；，1081848,2000-09-05，克里斯托弗·诺兰5，tt0144084,2018-01-16,2018-01-16，美国精神病，https://www.imdb.com/title/tt0144084/，电影，7.6,101,2000，&34；喜剧，犯罪，戏剧&#34；，462984,2000-01-21，玛丽·哈龙6，t0364569,2018-01-16,2018-01-16，Oldeuboi，https://www.imdb.com/title/tt0364569/，，491476,2003-11-21，赞宇公园7，tt1130884,2018-10-08，禁闭岛，https://www.imdb.com/title/tt1130884/，电影，8.1,138,2010，&34；神秘，颤栗&#34；，1075524,2010-02-13，马丁·斯科塞斯8，tt8772262,2019-12-27,2019年-12-27，米德索玛，https://www.imdb.com/title/tt8772262/，电影，7.1,148。\nd选项用于指定每个字段的分隔符。田野之间用什么隔开？在本例中是逗号(，)。f选项是要打印的字段编号。在本例中，第六个字段是电影的标题。这还会打印CSV头“title”，因此要删除它，我们只需使用sed&#39；1d&#39；，意思就是从输入流中删除一行。\n然后我们可以将电影列表通过管道传送到Shuf。Shuf只是随机地洗牌它的输入行，然后把它吐出来。\n$curl https://www.imdb.com/list/ls020046354/export|Cut-d&39；，&#39；-f 6|sed&#39；1 d&#39；|ShufAmerican Mental MidSomm源码Oldeuboi飞行俱乐部MementoShutter岛的威望。\n现在只需通过管道将其输入head-1或sed&#39；1q&#39；，这将只打印第一行。每次运行此命令时，您都会得到一个随机选择。\n$cURL https://www.imdb.com/list/ls020046354/export|CUT-d&#39；，&#39；-f 6|sed&#39；1 d&#39；|Shuf|Head-1源代码。\n现在假设您还希望将URL与标题一起打印，无问题，剪切允许您使用--field=list指定要打印的多个字段\n$cURL https://www.imdb.com/list/ls020046354/export|Cut-d&39；，&#39；--FIELD=6，7|sed&#39；1 d&#39；|Shuf|Head-1Shutter Island，https://www.imdb.com/title/tt1130884/。\n但是这有一个问题，如果电影标题中有逗号，那么你会得到一个完全不同的字段值。克服此问题的一种方法是使用如下所示的python一行程序：\n$curl-s https://www.imdb.com/list/ls020046354/export|\\python-c&#39；导入csv，sys；[为csv.DictReader(sys.stdin)中的打印(a[&#34；标题&#34；]，a[&#34；url&#34；])]&#39；|\\Shuf|Head-1Oldeuboi https://www.imdb.com/title/tt0364569/。\n这些只是几个例子，你可以用管道在单行的外壳上完成很多事情。", "note_en": "The Unix philosophy lays emphasis on building software that is simple andextensible. Each piece of software must do one thing and do it well. And thatsoftware should be able to work with other programs through a common interface– a text stream. This is one of the core philosophies of Unix which makes itso powerful and intuitive to use.\n  Even though the UNIX system introduces a number of innovative programs andtechniques, no single program or idea makes it work well. Instead, what makesit effective is the approach to programming, a philosophy of using thecomputer. Although that philosophy can’t be written down in a single sentence,at its heart is the idea that the power of a system comes more from therelationships among programs than from the programs themselves. Many UNIXprograms do quite trivial things in isolation, but, combined with otherprograms, become general and useful tools.\n I think that explains it pretty well. Also,  watch BrianKernighan being a complete chad andexplaining fundamentals of the UNIX OS where he also goes through an example ofusing pipes.\n In this post though, I would like to show some examples of thisphilosophy in action – of how one can use different unix tools together toaccomplish something powerful.\n    Let’s start with a simple one – display a list of authors/contributors of a gitrepo sorted based on the number of commits and sort the list in descendingorder (most commits contributed at the top). This is a simple task when youthink of it in terms of piplines.  git log is used to display commit logs. Wecan pass the  --format=&lt;format&gt; option to it and mention what format we wantthe commits to be displayed in.  --format=&#39;%an&#39; just prints the author’s namefor each commit.\n     $ git log --format = &#39;%an&#39; | sort | uniq -c  4 Alice  1 Bob  1 Candice  3 Denise\n   So  uniq prints out repeated lines, but only those that appear  adjacent toeachother. That is why we had to pass the output first to  sort. The  -c flagprefixes each line by the number of occurrences.\n You can see the output is still sorted alphabetically. So now all that isremaining is sort it numerically. There’s a flag for that in  sort, the -n flag. It considers the numbers based on their numerical value.\n $ git log --format = &#39;%an&#39; | sort | uniq -c | sort -nr  4 Alice  3 Denise  1 Candice  1 Bob\n The  -r flag was also included to print the list in reverse order. By defaultit sorts it in the ascending order. And their you have it – A list of authorssorted according to number of commits.\n  Did you know that you can just append “ .json” to a reddit url to get a jsonresponse instead of the usual html? This allows for a world of possibilities!One such is browsing memes right from the command line (well not entirely,because the actual image will be displayed on a GUI program). We can simply curlor wget the url –  https://reddit.com/r/memes.json\n $ wget -O - -q  &#39;https://reddit.com/r/memes.json&#39; &#39;{&#34;kind&#34;: &#34;Listing&#34;, &#34;data&#34;: {&#34;modhash&#34;: &#34;xyloiccqgm649f320569f4efb427cdcbd89e68aeceeda8fe1a&#34;, &#34;dist&#34;: 27, &#34;children&#34;: [{&#34;kind&#34;: &#34;t3&#34;, &#34;data&#34;: {&#34;approved_at_utc&#34;: null, &#34;subreddit&#34;: &#34;memes&#34;, &#34;selftext&#34;: &#34;More info available at....&#39;......More lines......\n I use wget here because it seems like the Curl User-Agent gets treateddifferently. Obviously, you can get around this by simply changing the‘User-Agent’ header, but I just went with  wget. Wget has a  -O to providethe output filename. Most programs that take such an option also allow a valueof  - which represents the standard output or input depending on the context.The  -q option just tells wget to be quite and not print things like progressstatus. Now we get a big JSON structure to work with. Now, to parse and use thisJSON data meaningfully on the command line, we can use  jq.  jq can be thought of as  sed/ awkfor JSON. It has a simple intuitive language of it’s own you can refer fromit’s man page.\n  {  &#34;kind&#34;:  &#34;Listing&#34;,  &#34;data&#34;: {  &#34;modhash&#34;:  &#34;awe40m26lde06517c260e2071117e208f8c9b5b29e1da12bf7&#34;,  &#34;dist&#34;:  27,  &#34;children&#34;: [],  &#34;after&#34;:  &#34;t3_gi892x&#34;,  &#34;before&#34;:  null }}\n So here we have some response of the type “Listing” and we can see we have anarray of “children”. Each element of that array is a post.\n This is what one of the elements of the ‘children’ array looks like:\n {  &#34;kind&#34;:  &#34;t3&#34;,  &#34;data&#34;: {  &#34;subreddit&#34;:  &#34;memes&#34;,  &#34;selftext&#34;:  &#34;&#34;,  &#34;created&#34;:  1589309289,  &#34;author_fullname&#34;:  &#34;t2_4amm4a5w&#34;,  &#34;gilded&#34;:  0,  &#34;title&#34;:  &#34;Its hard to argue with his assessment&#34;,  &#34;subreddit_name_prefixed&#34;:  &#34;r/memes&#34;,  &#34;downs&#34;:  0,  &#34;hide_score&#34;:  false,  &#34;name&#34;:  &#34;t3_gi8wkj&#34;,  &#34;quarantine&#34;:  false,  &#34;permalink&#34;:  &#34;/r/memes/comments/gi8wkj/its_hard_to_argue_with_his_assessment/&#34;,  &#34;url&#34;:  &#34;https://i.redd.it/6vi05eobdby41.jpg&#34;,  &#34;upvote_ratio&#34;:  0.93,  &#34;subreddit_type&#34;:  &#34;public&#34;,  &#34;ups&#34;:  11367,  &#34;total_awards_received&#34;:  0,  &#34;score&#34;:  11367,  &#34;author_premium&#34;:  false,  &#34;thumbnail&#34;:  &#34;https://b.thumbs.redditmedia.com/QZt8_SBJDdKLVnXK8P4Wr_02ALEhGoGFEeNhpsyIfvw.jpg&#34;,  &#34;gildings&#34;: {},  &#34;post_hint&#34;:  &#34;image&#34;,  &#34;..................&#34;  &#34;more lines skipped&#34;  &#34;..................&#34; }}\n I have reduced the number of key value pairs in  data. In total there were 105items. As you can see there are many interesting data attributes you can fetchabout a post. The one of our interest is  url of the post. This isn’t the urlof the actual reddit post but rather it’s the url of the content of the post.If the post url is what you want then that’s  permalink. So in this case, the url field is the url to the meme’s image.\n We can simply get the list of of all the urls of of every post using:\n  Ignore the first two links, those are basically sticky posts that the mods put,whose ‘url’ is same as the ‘permalink’.\n jq reads from the standard input and it’s fed the JSON we saw earlier. .data.children is referring to the array of posts I mentioned earlier. And–  .data.children[] | .data.url means, “iterate through every element in thearray and print the ‘url’ field which is in the ‘data’ field of every element”.\n So we get a list of all the urls of the “hot” posts of /r/memes. If you wanted to get the “top” posts ofthe this week then you can hit  https://reddit.com/r/memes/top.json?t=week. Fortop posts of all time?  t=all, year?  t=year and so on.\n Once we have a list of all the URLs, we can now just pipe it into  xargs.Xargs is a really useful utility to build command lines from standard input.This is what xarg’s man page says:\n xargs reads items from the standard input, delimited by blanks (which can beprotected with double or single quotes or a backslash) or newlines, andexecutes the command (default is /bin/echo) one or more times with anyinitial-arguments followed by items read from standard input. Blank lines onthe standard input are ignored\n     Now, we can just pass the list of URLs to an image viewer, like  feh or  eogthat accept a URL as a valid argument.\n  Now, feh pops up with the memes and I can just browse through them using thearrow keys like they were on my local disk.\n  Or I could simply just download all of the images using wget, by replacing feh with  wget above.\n And the possibilities are endless. Another good use of this reddit JSON data is setting the wallpaper of your desktop to the top upvoted image of /r/earthporn from the “hot” section.\n $ wget -O - -q reddit.com/r/earthporn.json | jq  &#39;.data.children[] |.data.url&#39; | head -1 | xargs feh --bg-fill\n You can then, if you want, set this up as a cron-job that runs every hour orso. I use the  head command here to just print the first line, which would bethe top upvoted post. By it’s own,  head seems to do something very trivialand unuseful, but in this case, working with other programs, it becomes animportant part.\n You see the power of Unix pipelines? That one single line does everything fromfetching JSON data, parsing and getting the relevant data out of it and thenagain fetching the image from the URL and finally setting it as the wallpaper.\n Another silly thing I used this for was for just downloading memes off of/r/memes every two hours. This is set up as a cron job on my machine. Now Ihave around 19566 memes taking up 4.5G on my disk. Why did I do that? Don’t askme…\n  Let’s end it with a simple one. IMDb has a feature where they allow you to makelists. You can also find lists made by other users. For example -  Blow YourMind Movies. If you append  /export tothe url you get the list in a  .csv format.\n $ curl https://www.imdb.com/list/ls020046354/exportPosition,Const,Created,Modified,Description,Title,URL,Title Type,IMDb Rating,Runtime  (mins ),Year,Genres,Num Votes,Release Date,Directors1,tt0137523,2017-07-30,2017-07-30,,Fight Club,https://www.imdb.com/title/tt0137523/,movie,8.8,139,1999,Drama,1780706,1999-09-10,David Fincher2,tt0945513,2017-07-30,2017-07-30,,Source Code,https://www.imdb.com/title/tt0945513/,movie,7.5,93,2011, &#34;Action, Drama, Mystery, Sci-Fi, Thriller&#34;,471234,2011-03-11,Duncan Jones3,tt0482571,2017-07-30,2017-07-30,,The Prestige,https://www.imdb.com/title/tt0482571/,movie,8.5,130,2006, &#34;Drama, Mystery, Sci-Fi, Thriller&#34;,1133548,2006-10-17,Christopher Nolan4,tt0209144,2018-01-16,2018-01-16,,Memento,https://www.imdb.com/title/tt0209144/,movie,8.4,113,2000, &#34;Mystery, Thriller&#34;,1081848,2000-09-05,Christopher Nolan5,tt0144084,2018-01-16,2018-01-16,,American Psycho,https://www.imdb.com/title/tt0144084/,movie,7.6,101,2000, &#34;Comedy, Crime, Drama&#34;,462984,2000-01-21,Mary Harron6,tt0364569,2018-01-16,2018-01-16,,Oldeuboi,https://www.imdb.com/title/tt0364569/,movie,8.4,120,2003, &#34;Action, Drama, Mystery, Thriller&#34;,491476,2003-11-21,Chan-wook Park7,tt1130884,2018-10-08,2018-10-08,,Shutter Island,https://www.imdb.com/title/tt1130884/,movie,8.1,138,2010, &#34;Mystery, Thriller&#34;,1075524,2010-02-13,Martin Scorsese8,tt8772262,2019-12-27,2019-12-27,,Midsommar,https://www.imdb.com/title/tt8772262/,movie,7.1,148,2019, &#34;Drama, Horror, Mystery, Thriller&#34;,150798,2019-06-24,Ari Aster\n   The  -d option is to specify the delimiter for each field. What are the fieldsseparated with? In this case it’s a comma ( ,). The  -f option is the fieldnumber you want to print. In this case the sixth field is the Title of themovie. This also prints the csv header “Title” so to remove it we can just use sed &#39;1 d&#39;, which just means,  delete  1 line from the input stream.\n We can then pipe the list of movies into  shuf. Shuf just shuffles it’s inputlines randomly and spits it out.\n $ curl https://www.imdb.com/list/ls020046354/export | cut -d  &#39;,&#39; -f  6 | sed  &#39;1 d&#39; | shufAmerican PsychoMidsommarSource CodeOldeuboiFight ClubMementoShutter IslandThe Prestige\n Now just pipe it into  head -1 or  sed &#39;1 q&#39; which would print only the firstline. Every time you run this, you should get a random selection.\n $ curl https://www.imdb.com/list/ls020046354/export | cut -d  &#39;,&#39; -f  6 | sed  &#39;1 d&#39; | shuf | head -1Source Code\n Now let’s say you would also like the URL to be printed along with title, noproblem,  cut allows you to specify multiple fields to print using  --field=LIST\n $ curl https://www.imdb.com/list/ls020046354/export | cut -d  &#39;,&#39; --field =6,7 | sed  &#39;1 d&#39; | shuf | head -1Shutter Island,https://www.imdb.com/title/tt1130884/\n There is a problem with this though, if the Movie title has a comma in it, thenyou would get a totally different field value. One way to overcome this is byusing a python one-liner like this:\n  $ curl -s https://www.imdb.com/list/ls020046354/export | \\  python -c  &#39;import csv,sys;[print (a[&#34;Title&#34;],a[&#34;URL&#34;]) for a in csv.DictReader(sys.stdin)]&#39;| \\  shuf | head -1Oldeuboi https://www.imdb.com/title/tt0364569/\n These were just a few examples, there are so many things you can accomplish ina single line of shell using pipes.", "posttime": "2020-06-05 04:03:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "管道,unix", "title": "Unix管道之美", "title_en": "The Beauty of Unix Pipelines", "transed": 1, "url": "https://prithu.xyz/posts/unix-pipeline/", "via": "", "real_tags": ["管道", "unix"]}]