[{"category": "", "categoryclass": "", "imagename": "ac8695242d898b3189205955829e24c8.jpeg", "infoid": 1006363, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们都必须处理数据，我们试图学习机器学习并将其应用到我们的项目中。但每个人似乎都忘记了一件事……。这远不是完美的，还有很多事情要做！别担心，我们会从头到尾讨论👀的每一个小步骤。\n我们都是从脑海中的数据集或目标开始的。一旦我们发现、收集或搜集了我们的数据，我们就会把它拉出来，然后目睹无情的数字细胞、更多的数字、类别，也许还有一些单词😨！一个天真的想法掠过我们的脑海，用我们的机器学习能力来处理这种错综复杂的混乱……。但是，快速搜索一下就会发现，在培训😱模型之前，我们需要考虑的任务有很多。\n一旦我们克服了不守规矩的数据带来的冲击，我们就会想方设法与我们强大的克星🤔作战。我们首先试图将我们的数据输入Python。纸面上相对简单，但这个过程可能会稍微有点……。全力以赴。不管怎样，只需要一点点努力(我们很幸运)。\n我们没有浪费任何时间就开始清理数据，以去除虚假的东西，揭露美丽的东西。我们的方法开始很简单-观察和删除。它起了几次作用，但后来我们意识到。它真的没有公平对待我们！不过，为了处理混乱，我们找到了一个强大的工具来增加我们的武器库：图表！通过我们的图表，我们可以感觉到我们的数据，其中的模式和缺失的地方。我们可以插入(填充)或删除丢失的数据。\n最后，我们将面对备受期待的😎挑战--数据建模！通过一点研究，我们会发现哪些策略和模型是最常用的。要破译我们应该使用哪种策略和模型有点困难，但我们还是设法度过了这一关，并弄清楚了一切！\n如果不做一些令人印象深刻的事情，我们就无法完成一个项目。所以，最终的产品、网站、应用程序甚至是一份报告都会带我们走得更远！我们知道第一印象很重要，所以我们修复了gihub存储库，并确保每件事都得到了很好的记录和解释。现在我们终于可以向世界其他地方炫耀我们的辛勤工作了！😎！\n数据有各种形状和大小，因此我们用来将所有内容放入代码中的过程往往各不相同。\n数据清理最难的部分不是编码或理论，而是我们的准备工作！当我们第一次开始一个新项目并下载我们的数据集时，打开代码编辑器并开始键入……是很诱人的。但这对我们没有任何好处。如果我们想要抢占先机，我们需要为数据中最好和最坏的部分做好准备。要做到这一点，我们需要从BASIC开始，通过手动检查电子表格。一旦我们了解了数据的基本格式(文件类型以及任何细节)，我们就可以开始将其全部导入Python。\n当我们幸运地只有一个电子表格时，我们可以使用Pandas Read_CSV函数(让它知道我们的数据放在哪里)：\n虽然我们正在讨论一系列的场景，但我们通常一次只处理几个场景。\n我们的前几个问题(导入数据的特定部分/重命名列)很容易使用几个参数来处理，比如要跳过的行数、要导入的特定列和我们的列名：\n每当我们的数据分布在多个文件中时，我们都可以使用Pandas Concat函数将它们组合在一起。Concat函数将DataFrame列表组合在一起：\n我们解析以连接电子表格列表(我们像以前一样导入)。当然，列表可以以任何方式获得(因此，花哨的列表理解或每个文件的随意列表都同样有效)，但请记住，我们需要的是数据帧，而不是文件名/路径！\n如果我们没有CSV文件，Pandas仍然可以工作！我们可以只用READ_CSV替换READ_EXCEL、READ_SQL或其他选项。\n在所有数据都在Pandas数据框中之后，我们需要仔细检查我们的数据格式是否正确。实际上，这意味着检查每个系列数据类型，并确保它们不是泛型对象。这样做是为了确保我们可以利用Pandas内置的数字、类别和日期/时间值功能。要查看这一点，只需运行DataFrame.dtype。如果输出看起来合理(即数字是数字，类别是类别等)，那么我们应该可以移动。当我们需要更改我们的数据类型时！这可以使用Pandas DataFrame.astype.如果这不是这样的话&#39；如果不工作，则应该有另一个更多Pandas函数用于特定转换：\n如果我们需要分析单独的数据组(即，我们的数据可能按国家/地区划分)，我们可以使用Pandas GROUPBY。我们可以使用GROUPBY选择特定数据，并分别对每个组运行函数：\n其他更小众的技巧，如多层次索引，在特定场景中也会很有帮助，但是，理解和使用起来更加棘手。\n数据是有用的，数据是必要的，然而，它需要干净和切中要害！如果我们的数据无处不在，它对我们的机器学习模型根本没有任何用处。\n每个人都被丢失的数据弄得发疯，但隧道的尽头总是有一道亮光。\n我们所说的最终目标，是指我们致力于预测、分类或分析的任何变量，这样做的目的是缩小我们的范围，而不是陷入无用的信息之中。\n一旦我们知道我们的主要客观特征是什么，我们就可以尝试找到模式、关系、丢失的数据等等。一个简单而直观的方法是绘制图表！快速使用熊猫绘制出数据集中的每个变量，并尝试查看每个变量的位置。\n一旦我们确定了数据中的潜在问题或趋势，我们就可以尝试修复它们。通常，我们有以下选项：\n要从识别丢失的数据到选择如何处理它，我们需要考虑它如何影响我们的最终目标。对于丢失的数据，我们删除任何似乎对最终结果没有重大影响的东西(即，我们找不到有意义的模式)，或者缺少太多数据而无法得出价值的地方。有时，我们还决定删除非常少量的丢失数据(因为这比填充它更容易)。\n如果我们已决定删除信息，则可以使用Pandas DataFrame.drop。它可以从数据帧中删除列或行。它非常易于使用，但请记住，默认情况下，Pandas不会修改/删除源数据帧中的数据，因此必须指定inplace=True。注意，Axis参数指定是否要删除行或列，这可能很有用。\n当不删除完整的列，或者特别针对丢失的数据时，依赖几个漂亮的Pandas函数通常很有用。要删除空值，可以使用DataFrame.dropna。但请记住，默认情况下，dropna会完全删除所有缺少的值。但是，设置参数HOW TO ALL或设置阈值(阈值，表示需要多少空值才能删除)可以弥补这一点。\n如果我们有少量不规则的缺失值，我们可以用几种方法来填充它们。最简单的是DataFrame.fulna，它将缺失值设置为某个预设值。更复杂但灵活的选项是使用DataFrame.interpolate进行插值。插值基本上允许任何人简单地设置他们想要用来替换每个空值的方法。这些方法包括上一个/下一个值、线性和时间(最后两个是根据数据推断的)。当使用时间时，时间是一个自然的选择，并且。\n如上所述，Interpolate需要传递到纯粹包含缺少数据的列的DataFrame中(否则将抛出错误)。\n每当我们看到经常丢失的数据或具有使用不同时间尺度的多个数据源时，重采样都很有用(例如，确保以分钟和小时为单位的度量可以合并)。直观地理解重采样可能有些困难，但当您对特定时间范围内的测量值进行平均时，重采样是必不可少的。例如，我们可以通过指定要获取每个月的平均值来获得月值：\n#34；M&34；代表月份，可以替换为表示年份和其他选项的&#34；Y&34；。\n尽管数据清理过程可能相当具有挑战性，但如果我们记得最初的意图，它将成为一项更符合逻辑、更直接的任务！如果我们仍然没有所需的数据，我们可能需要回到第一阶段并收集更多数据。请注意，丢失数据表明数据收集有问题，因此仔细考虑并记下发生的位置是很有用的。\n完成时，Pandas Unique和VALUE_COUNTS函数对于决定直接删除哪些特性以及绘制/研究哪些特性非常有用。\n视觉化听起来很简单，确实如此，但很难……。不是太复杂。对于我们来说，把情节看作是一件琐碎的事情太容易了。然而，这些坏家伙做了一件非常非常好的事情-直观地展示了我们数据的内部运作！只需记住：\n因此，当被困在想法中，或者不太确定要做什么时，我们的基础知识总是可以依赖于识别有用的模式和有意义的关系。这看起来可能有点🥶，但它确实很有用。\n我们的目标不是画花哨的六边形图，而是描绘正在发生的事情，所以任何人都可以简单地解释一个复杂的系统！\n要开始绘图，只需在任何系列或数据帧上使用Pandas.lot()！当我们需要更多时，我们可以深入研究MatPlotLib、Seborn或交互式绘图库。\ndata.lot(x=&#34；Column 1 Name&#34；，y=&#34；Column 2 Name&#34；，Kind=&#34；bar&#34；，figsize=(10，10))data.lot(x=&#34；Column 1 Name&#34；，y=&&#34；Column 3 Name&#34；，Sub_y=True)data.hist()data.groupby(&#34；group&#34；).boxlot()。\n在90%的情况下，这些基本功能就足够了(更多信息请点击这里)，搜索一下就会发现如何绘制特别有异国情调的图形😏。\n现在终于到了有趣的东西派生的结果了。训练一个科学工具包学习模型似乎是如此简单，但没有人深入到细节！所以，让我们在这里诚实地说，不是每个数据集，也不是每个模型都是相等的。\n根据我们的数据，我们的建模方法会有很大的不同。有三个特别重要的因素：\n我们的问题类型归结为，我们是试图预测一个类别/标签(称为分类)、一个值(称为回归)，还是对数据进行分组(称为聚类)。如果我们试图在一个数据集上训练一个模型，其中我们已经有了我们正在尝试预测的示例，我们称我们的模型是有监督的，如果没有监督的话。可用的数据量以及它的复杂程度预示着一个模型将会多么简单。具有更多特征(即列)的数据往往更复杂。\n解释复杂性的意义在于了解哪些模型对我们的数据来说太好或太差。\n模型的拟合优劣告诉我们这一点！如果一个模型很难解释我们的数据(太简单)，我们可以说它不符合，如果它完全过度(太复杂)，我们可以说它过度拟合。我们可以把它看作是从什么都不学到记住所有东西的一个光谱。我们需要取得平衡，以确保我们的模型能够将我们的结论概括为新的信息。这通常被称为偏差-方差权衡。请注意，复杂性也会影响模型的可解释性。\n复杂的模型需要更多的时间来训练，特别是在大数据集的情况下。所以，升级计算机，通宵运行模型，然后暂停一段时间😁！\n在训练模型之前，重要的是要注意到我们将需要一些数据集来测试它(这样我们就知道它的表现有多好)。因此，我们经常将我们的数据集划分为单独的训练集和测试集。这允许我们测试我们的模型对新的未知数据的泛化能力有多好。这通常是有效的，因为我们知道我们的数据很好地代表了现实世界。\n实际的测试数据量并不太重要，但是经常使用80%的训练和20%的测试。\n交叉验证是指将数据集拆分成几个文件夹(即原始数据集的子集或部分)。这往往比使用单个测试/验证集更健壮，抗过度拟合！几个SkLearning函数有助于交叉验证，但通常直接通过网格或随机搜索(下面讨论)来完成。\n有些因素我们的模型无法解释，因此我们设置了某些超参数。这些参数因模型而异，但我们可以通过手动试错或网格或随机搜索等简单算法找到最佳值。对于网格搜索，我们尝试所有可能的值(蛮力😇)，并从某些分布/选择中随机搜索随机值。这两种方法通常都使用交叉验证。\nSkLearning中的网格搜索通过参数字典工作。每个条目键代表要调优的超参数，值(列表或元组)是要从中选择的值：\n创建网格后，我们可以使用它来训练模型，并提取分数：\n这里重要的是要记住，我们需要的是训练数据，而不是测试数据。即使使用交叉验证来测试模型，我们最终也会尝试在训练数据上获得最佳匹配，然后在测试集上继续测试每个模型：\nSkLearning中的随机搜索的工作原理与此类似，但稍微复杂一些，因为我们需要知道每个超参数所处的分布类型。虽然从理论上讲，它可以更快地产生相同或更好的结果，但情况不同，情况也会有所不同。为简单起见，最好坚持网格搜索。\n使用SkLearning，它就像找到我们想要的型号名称，然后只需为它创建一个变量一样简单。有关详细信息，请查看文档链接！例如。\n线性回归是用直线来拟合我们的数据，它是最基本、最基本的模型。线性回归有几种变种，如套索和岭回归(这是防止过拟合的正则化方法)。多项式回归可以用来拟合高次曲线(如抛物线和其他曲线)。Logistic回归是另一种可以用于分类的变种。\n就像线性/逻辑回归一样，支持向量机(SVM)试图将直线或曲线拟合到数据点。然而，SVM的目标是最大化边界与每个点之间的距离(而不是让直线/曲线穿过每个点)。\n支持向量机的主要优点是能够使用不同的核。核是一个计算相似度的函数。这些核允许线性和非线性数据，同时保持良好的效率。核将输入映射到更高维空间，从而形成边界。这个过程对于大量的特征通常是不可行的。那么神经网络或另一个模型可能会是更好的选择！\n所有的话题都是关于深度学习和神经网络的，它们是复杂的、缓慢的和资源密集型的模型，可以用于复杂的数据，但是当遇到大型的非结构化数据集时，它们是非常有用的。\n使用神经网络时，一定要注意过度拟合，一种简单的方法是跟踪误差随时间的变化(称为学习曲线)。\n深度学习是一个非常丰富的领域，所以这里要讨论的内容实在太多了。实际上，Scikit Learning是一个机器学习库，几乎没有深度学习能力(与PyTorch或TensorFlow相比)。\n决策树是一种简单快捷的关系建模方法。它们基本上是一棵决策树，帮助确定数据点属于哪个类或标签。决策树也可以用于回归问题。虽然简单，但为了避免过度拟合，必须选择几个超参数。所有这些通常都与树的深度和要做出的决策有关。\n我们可以使用k-均值将未标记的数据分组到几个簇中，通常，存在的簇的数量是一个选择的超参数。\nK-Means的工作原理是试图优化(减少)一些称为惯性的准则(即函数)，它可以看作是试图最小化从一组质心到每个数据点的距离。\n随机森林是在数据的随机子集(自举)上训练的多个决策树的组合，这一过程被称为装袋，允许随机森林与复杂数据获得良好的拟合(低偏差和低方差)。\n一名选民可能会投票给一个糟糕的候选人，但我们希望大多数选民在知情的情况下做出积极的决定。\n对于回归问题，我们平均每个决策树的输出，而对于分类，我们选择最受欢迎的一个。这可能不总是有效的，但我们假设它通常会有效(特别是对于具有多列的大型数据集)。\n随机森林的另一个优点是，不重要的功能不应该因为民主-ESC自举过程而对性能产生负面影响！\n超参数选择与决策树相同，但也与决策树的数量相同。基于上述原因，树越多，过度拟合就越少！\n像AdaBoost或XGBoost这样的集成模型是通过将一个模型叠加到另一个模型上来工作的。这里的假设是，每个后续的弱学习者都会纠正前一个模型的缺陷(因此称为Boosting)。因此，模型的组合应该提供每个模型的优势而不存在潜在的陷阱。\n迭代方法意味着以前的模型性能影响当前模型，较好的模型优先考虑；Boosted模型的性能略好于袋装模型(也称为随机森林)，但也略有可能过度拟合；SkLearning提供AdaBoost进行分类和回归。\n这是流程🧐的最后但可能是最重要的部分。我们已经投入了所有这些工作，所以我们需要不遗余力地创造一些令人印象深刻的东西！\n有多种选择。Streamlight对于面向数据的网站来说是一个令人兴奋的选择，Kotlin、Swift和DART等工具可用于Android/iOS开发。带有VueJS等框架的JavaScript也可用于额外的灵活性。\n在尝试了其中的大部分之后，老实说，我会推荐坚持使用Streamlight，因为它比其他的容易得多！\n在这里，重要的是从一个愿景(越简单越好)开始，试着找出哪些部分是最重要的。然后尝试具体地工作。继续到完成！对于网站，将需要像Heroku这样的主机服务，这样世界其他地方就可以看到我们所有辛勤工作的🤯😱令人惊叹的最终产品。\n即使上面的选项都不适合这个场景，一份包含我们所做的工作、我们所学到的知识以及任何建议/经验教训的报告或文章，以及一个文档齐全的GitHub存储库也是必不可少的！确保自述文件是最新的。\n如果您喜欢这本书，您可能还会喜欢“完整的编码实践者手册”，它介绍了您需要了解的每一个实用的编码工具。如果您在考虑要承担哪个项目时迷失了方向，请考虑查看我的“从零到英雄”的指南，该指南介绍了如何通过网络抓取来选择项目和收集您自己的数据集。\n国家癌症研究所，Dane Deaner，ThisisEngineering RAEng，Adam Nowakowski和Guilherme Caetano在Unspash上的照片。拟合优度图表是SkLearning文档的修改版本", "note_en": "We all have to deal with data, and we try to learn about and implement machine learning into our projects.But everyone seems to forget one thing... it&#39;s far from perfect, and there is  so much to go through!Don&#39;t worry, we&#39;ll discuss every little step, from start to finish 👀.\n   We all start with either a dataset or a goal in mind.Once  we&#39;ve found, collected or scraped our data, we pull it up, and witness the overwhelming sight of merciless cells of numbers, more numbers, categories, and maybe some words 😨!A naive thought crosses our mind, to use our machine learning prowess to deal with this tangled mess... but a quick search reveals the host of tasks we&#39;ll need to consider before  training a model 😱!\n Once we overcome the shock of our unruly data we look for ways to battle our formidable nemesis 🤔.We start with trying to get our data into Python.It is relatively simple on paper, but the process can be slightly...  involved.Nonetheless, a little effort was all that was needed (lucky us).\n Without wasting any time we begin  data cleaning to get rid of the bogus and expose the beautiful.Our methods start simple - observe and remove.It works a few times, but then we realise... it really doesn&#39;t do us justice!To deal with the mess though, we find a powerful tool to add to our arsenal: charts!With our graphs, we can get a feel for our data, the patterns within it and where things are missing.We can  interpolating (fill in) or removing missing data.\n Finally, we approach our highly anticipated 😎 challenge, data modelling!With a little research, we find out which tactics and models are commonly used.It is a little difficult to decipher which one we should use, but we still manage to get through it and figure it all out!\n We can&#39;t finish a project without doing something impressive though.So, a final product, website, app or even a report will take us far!We know first impressions are important so we fix up the GitHub repository and make sure everything&#39;s well documented and explained.Now we are  finally able to show off our hard work to the rest of the world 😎!\n   Data comes in all kinds of shapes and sizes and so the process we use to get everything into code often varies.\n  The hard part about data cleaning isn&#39;t the coding or theory, but instead our preparation!When we first start a new project and download our dataset, it can be tempting to open up a code editor and start typing... but this won&#39;t do us any good.If we want to get a head start we need to prepare ourselves for the best and worst parts of our data.To do this we&#39;ll need to start basic, by manually inspecting our spreadsheet/s.Once we understand the basic format of the data (filetype along with any particularities) we can move onto getting it all into Python.\n When we&#39;re lucky and just have one spreadsheet we can use the Pandas   read_csv function (letting it know where our data lies):\n    Although we&#39;re discussing a range of scenarios, we normally only deal with a few at a time.\n Our first few problems (importing specific parts of our data/renaming columns) are easy enough to deal with using a few parameters, like the number of rows to skip, the specific columns to import and our column names:\n  Whenever our data is spread across multiple files, we can combine them using Pandas   concat function.The   concat function combines a list of   DataFrame&#39;s together:\n  We parse to   concat a list of spreadsheets (which we import just like before).The list can, of course, be attained in any way (so a fancy list comprehension or a casual list of every file both work just as well), but just remember that  we need dataframes, not filenames/paths!\n If we don&#39;t have a CSV file Pandas still works!We can just  swap out   read_csv for   read_excel,   read_sql or another  option.\n After all the data is inside a Pandas dataframe, we need to double-check that our data is  formatted correctly.In practice, this means checking each series datatype, and making sure they are not generic objects.We do this to ensure that we can utilize Pandas inbuilt functionality for numeric, categorical and date/time values.To look at this just run  DataFrame.dtypes.If the output seems reasonable (i.e. numbers are numeric, categories are categorical, ect), then we should be fine to move on.However, this normally is not the case, and as we need to change our datatypes!This can be done with Pandas   DataFrame.astype.If this doesn&#39;t work, there should be another more Pandas function for that specific conversion:\n  If we need to analyse separate groups of data (i.e. maybe our data is divided by country), we can use Pandas  groupby.We can use  groupby to select particular data, and to run functions on each group separately:\n  Other more niche tricks like multi/hierarchical indices can also be helpful in specific scenarios, however, are more tricky to understand and use.\n  Data is useful, data is necessary, however, it  needs to be clean and to the point!If our data is everywhere, it simply won&#39;t be of any use to our machine learning model.\n Everyone is driven insane by missing data, but there&#39;s always a light at the end of the tunnel.\n   By end-goal, we mean whatever variable we are working towards predicting, categorising or analysing.The point of this is to narrow our scope and not get bogged down in useless information.\n  Once we know what our primary objective features are, we can try to find patterns, relations, missing data and more.An easy and intuitive way to do this is graphing!Quickly use Pandas to sketch out each variable in the dataset, and try to see where everything fits into place.\n Once we have identified potential problems, or trends in the data we can try and fix them.In general, we have the following options:\n  To go from identifying missing data to choosing what to do with it we need to consider how it affects our end-goal.With missing data we remove anything which doesn&#39;t seem to have a major influence on the end result (i.e. we couldn&#39;t find a meaningful pattern), or where there just seems  too much missing to derive value.Sometimes we also decide to remove very small amounts of missing data (since it&#39;s easier than filling it in).\n If we&#39;ve decided to get rid of information, Pandas   DataFrame.drop can be used.It removes columns or rows from a dataframe.It is quite easy to use, but remember that  Pandas does not modify/remove data from the source dataframe by default, so  inplace=True must be specified.It may be useful to note that the  axis parameter specifies whether rows or columns are being removed.\n When not removing a full column, or particularly targeting missing data, it can often be useful to rely on a few nifty Pandas functions.For removing null values,  DataFrame.dropna can be utilized.Do keep in mind though that by default,  dropna completely removes all missing values.However, setting either the parameter  how to  all or setting a threshold ( thresh, representing how many null values are required for it to delete) can compensate for this.\n If we&#39;ve got small amounts of irregular missing values, we can fill them in several ways.The simplest is  DataFrame.fillna which sets the missing values to some preset value.The more complex, but flexible option is interpolation using  DataFrame.interpolate.Interpolation essentially allows anyone to simply set the  method they would like to replace each null value with.These include the previous/next value, linear and time (the last two deduce based on the data).Whenever working with time, time is a natural choice, and otherwise make a reasonable choice based on how much data is being interpolated and how complex it is.\n  As seen above, interpolate needs to be passed in a dataframe purely containing the columns with missing data (otherwise an error will be thrown).\n Resampling is useful can whenever we see regularly missing data or have multiple sources of data using different timescales (like ensuring measurements in minutes and hours can be combined).It can be slightly difficult to intuitively understand resampling, but it is essential when you average measurements over a certain timeframe.For example, we can get monthly values by specifying that we want to get the mean of each month&#39;s values:\n  The  &#34;M&#34; stands for month and can be replaced with  &#34;Y&#34; for year and other options.\n Although the data cleaning process can be quite challenging, if we remember our initial intent, it becomes a far more logical and straight forward task!If we still don&#39;t have the needed data, we may need to go back to phase one and collect some more. Note that missing data indicates a problem with data collection, so it&#39;s useful to carefully consider, and note down where occurs.\n For completion, the Pandas   unique and   value_counts functions are useful to decide which features to straight-up remove and which to graph/research.\n  Visualisation sounds simple and it is, but it&#39;s hard to...  not overcomplicate.It&#39;s far too easy for us to consider plots as a chore to create.Yet, these bad boys do one thing very, very well - intuitively demonstrate the inner workings of our data!Just remember:\n  Hence, when stuck for ideas, or not quite sure what to do, we basics can always fall back on  identifying useful patterns and meaningful relationships.It may seem iffy 🥶, but it is really useful.\n Our goal isn&#39;t to draw fancy hexagon plots, but instead to picture what is going on, so  absolutely anyone can simply interpret a complex system!\n   To get started graphing, simply use Pandas  .plot() on any series or dataframe!When we need more, we can delve into MatPlotLib, Seaborn or an interactive plotting library.\n data.plot(x= &#34;column 1 name&#34;, y= &#34;column 2 name&#34;, kind= &#34;bar&#34;, figsize=( 10,  10)) data.plot(x= &#34;column 1 name&#34;, y= &#34;column 3 name&#34;, secondary_y=True) data.hist() data.groupby( &#34;group&#34;).boxplot()\n 90% of the time, this basic functionality will suffice ( more info here), and where it doesn&#39;t a search should reveal how to  draw particularly exotic graphs 😏.\n    Now finally for the fun stuff - deriving results.It seems  so simple to train a scikit learn model, but no one goes into the details!So, let&#39;s be honest here, not every dataset, nor model are equal.\n Our approach to modelling will vary widely based on our data.There are three especially important factors:\n  Our type of problem comes down to whether we are trying to predict a class/label (called  classification), a value (called  regression), or to group data (called  clustering).If we are trying to train a model on a dataset where we already have examples of what we&#39;re trying to predict we call our model  supervised, if not,  unsupervised.The amount of available data, and how complex it is foreshadows how simple a model will suffice. Data with more features (i.e. columns) tends to be more complex.\n The point of interpreting complexity is to understand which models are  too good or too bad for our data\n Models  goodness of fit informs us on this!If a model struggles to interpret our data (too simple) we can say it  underfits, and if it is completely overkill (too complex) we say it  overfits.We can think of it as a spectrum from learning nothing to memorising everything.We need to  strike balance, to ensure our model is  able to  generalise our conclusions to new information.This is typically known as the bias-variance tradeoff. Note that complexity also affects model interpretability.\n  Complex models take a substantially greater time to train, especially with large datasets.So, upgrade that computer, run the model overnight, and chill for a while 😁!\n   Before training a model it is important to note that we will need some dataset to test it on (so we know how well it performs).Hence, we often divide our dataset into  separate training and testing sets.This allows us to test  how well our model can generalise to new unseen data.This normally works because we know our data is decently representative of the real world.\n The actual amount of test data doesn&#39;t matter too much, but 80% train and 20% test is often used.\n   Cross-validation is where a dataset is split into several folds (i.e. subsets or portions of the original dataset).This tends to be more robust and  resistant to overfitting than using a single test/validation set!Several Sklearn functions help with  cross-validation, however, it&#39;s normally done straight through a grid or random search (discussed below).\n   There are some factors our model cannot account for, and so we  set certain hyperparameters.These vary model to model, but we can either find optimal values through manual trial and error or a simple algorithm like grid or random search.With grid search, we try all possible values (brute force 😇) and with random search random values from within some distribution/selection.Both approaches typically use cross-validation.\n Grid search in Sklearn works through a  parameters dictionary.Each entries key represents the hyperparameter to tune, and the value (a list or tuple) is the selection of values to chose from:\n  After we&#39;ve created the grid, we can use it to train the models, and extract the scores:\n  The important thing here is to remember that we need to  train on the training and not testing data.Even though cross-validation is used to test the models, we&#39;re ultimately trying to get the best fit on the training data and will proceed to test each model on the testing set afterwards:\n  Random search in Sklearn works similarly but is slightly more complex as we need to know what type of distribution each hyperparameter takes in.Although it, in theory,  can yield the same or better results faster, that changes from situation to situation. For simplicity it is likely best to stick to a grid search.\n   With Sklearn, it&#39;s as simple as finding our desired model name and then just creating a variable for it.Check the links to the documentation for further details!For example\n    Linear regression is trying to  fit a straight line to our data.It is the most basic and fundamental model.There are several variants of linear regression, like lasso and ridge regression (which are regularisation methods to prevent overfitting).Polynomial regression can be used to fit curves of higher degrees (like parabolas and other curves).Logistic regression is another variant which can be used for classification.\n  Just like with linear/logistic regression,  support vector machines (SVM&#39;s) try to fit a line or curve to data points.However, with SVM&#39;s the aim is to maximise the distance between a boundary and each point (instead of getting the line/curve to go through each point).\n The main advantage of support vector machines is their ability to  use different kernels.A kernel is a function which calculates similarity.These kernels allow for both linear and non-linear data, whilst staying decently efficient.The kernels map the input into a higher dimensional space so a boundary becomes present.This process is typically not feasible for large numbers of features.A neural network or another model will then likely be a better choice!\n  All the buzz is always about deep learning and  neural networks.They are complex, slow and resource-intensive models which can be used for complex data.Yet, they are extremely useful when encountering large unstructured datasets.\n When using a neural net, make sure to watch out for overfitting.An easy way is through tracking changes in error with time (known as learning curves).\n Deep learning is an extremely rich field, so there is far too much to discuss here.In fact, Scikit learn is a machine learning library, with little deep learning abilities (compared to  PyTorch or  TensorFlow).\n  Decision trees are simple and quick ways to model relationships.They are basically a  tree of decisions which help to decide on what class or label a datapoint belongs too.Decision trees can be used for regression problems too.Although simple, to avoid overfitting, several hyperparameters must be chosen.These all, in general, relate to how deep the tree is and how many decisions are to be made.\n  We can group unlabeled data into several  clusters using  k-means.Normally the number of clusters present is a chosen hyperparameter.\n K-means works by trying to optimize (reduce) some criterion (i.e. function) called inertia.It can be thought of like trying to minimize the distance from a set of  centroids to each data point.\n   Random forests are combinations of multiple decision trees trained on random subsets of the data (bootstrapping).This process is called bagging and allows random forests to obtain a good fit (low bias and low variance) with complex data.\n  One voter may vote for a bad candidate, but we&#39;d hope that the majority of voters make informed, positive decisions\n For  regression problems, we average each decision tree&#39;s outputs, and for  classification, we choose the most popular one.This  might not always work, but we assume it in general will (especially with large datasets with multiple columns).\n Another advantage with random forests is that insignificant features shouldn&#39;t negatively impact performance because of the democratic-esc bootstrapping process!\n Hyperparameter choices are the same as those for decision trees but with the number of decision trees as well.For the aforementioned reasons, more trees equal less overfitting!\n    Ensemble models like AdaBoost or  XGBoost work by stacking one model on top of another.The assumption here is that each successive weak learner will correct for the flaws of the previous one (hence called boosting).Hence, the combination of models should provide the advantages of each model without its potential pitfalls.\n The iterative approach means previous models performances effects current models, and better models are given a higher priority.Boosted models perform slightly better than bagging models (a.k.a random forests), but are also slightly more likely to overfit.Sklearn provides AdaBoost for  classification and  regression.\n  This is the last but potentially most important part of the process 🧐.We&#39;ve put in all this work, and so we need to go the distance and  create something impressive!\n There are a variety of options. Streamlit is an exciting option for data-oriented websites, and tools like Kotlin, Swift and Dart can be used for Android/IOS development.JavaScript with frameworks like VueJS can also be used for extra flexibility.\n After trying most of these I honestly would recommend sticking to  Streamlit, since it is so much easier than the others!\n Here it is important to start with a vision (simpler the better) and try to find out which parts are most important.Then try and specifically work on those.Continue till completion!For websites, a hosting service like  Heroku will be needed, so the rest of the world can see the amazing end-product of all our hard work 🤯😱.\n Even if none of the above options above suite the scenario, a report or article covering what we&#39;ve done, what we&#39;ve learnt and any suggestions/lessons learnt along with a well documented GitHub repository are indispensable! Make sure that readme file is up to date.\n    If you enjoyed this, you may also like  The Complete Coding Practitioners Handbook which goes through each and every practical coding tool you&#39;ll need to know.If you&#39;re lost considering what project to take on, consider checkout out my zero-to-hero guide on  choosing a project and  collecting your own dataset through webscraping.\n Photos by  National Cancer Institute,  Dane Deaner,  ThisisEngineering RAEng,  Adam Nowakowski and  Guilherme Caetano on Unsplash.The goodness of fit graph is a modified version of the  Sklearn documentation", "posttime": "2020-06-13 09:42:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "学习,learning,数据", "title": "机器学习现场指南", "title_en": "Machine Learning Field Guide", "transed": 1, "url": "https://www.kamwithk.com/machine-learning-field-guide-ckbbqt0iv025u5ks1a7kgjckx", "via": "", "real_tags": ["学习", "learning", "数据"]}, {"category": "", "categoryclass": "", "imagename": "dbf80d5d9869331fefafde7a78932e3d.jpg", "infoid": 1006362, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "然后，天文学家转向了之前已知的来源：一种被称为磁星的超高密度、快速旋转和高度磁化的恒星核心灰烬。凭借一项幸运的发现，快速射电爆发来自何处的谜团似乎已经解开。荷兰射电天文研究所和阿姆斯特丹大学的杰森·赫塞尔斯说：“你很少会得到一个如此惊人的线索，以至于它似乎突然解开了很大一部分谜团。”“通常情况下，我们在某种程度上是在逐步解决问题，而不是做出如此巨大的飞跃。”\n有了罪魁祸首，天文学家现在可以专注于查明正在发挥作用的具体物理问题。在过去的一个月里，随着理论家们猜测磁星如何发射如此耀眼的无线电波，涌现出大量的论文。磁星很可能是通过在强大的耀斑中爆炸带电粒子而开始这一过程的。但是天体物理学家们正在争论这种耀斑究竟是如何产生无线电波爆发的。Hessels说，这类似于辨认一个魔术师，然后试图破译他们戏法背后的秘密。\n天文学家已经收集了大约50种不同的理论来解释快速射电爆发-直到最近，这个数字还超过了事件的数量。这些想法包括各种狂野的场景，包括蒸发黑洞、折断宇宙弦，甚至是外星文明的推进系统。\n但随着探测数量的增加，科学家们开始倾向于一种解释，而不是其他解释：磁星。哥伦比亚大学的天体物理学家布莱恩·梅茨格(Brian Metzger)说：“它们的一些性质确实表明它们来自某种磁化的中子星。”例如，快速射电爆发的电波是高度极化的，这表明它们来自强磁场。它们的持续时间短意味着它们来自一个相对较小的天体。它们必须由一个巨大的能量储备库提供动力。\n然而，持怀疑态度的人争辩说，如果磁星是源，我们应该在我们自己的星系内看到快速的射电爆发。有了这次爆发，我们就有了。“在某种程度上，这是一个巨大的解脱，”梅茨格说，他一直致力于磁星模型的研究。“这意味着我没有扔掉几年的工作。”\n现在的任务是精确定位磁星是如何产生短暂的无线电波爆发的。许多想法都是从磁星爆发出能量耀斑开始的，通常是以电子和正电子对的形式。然后，这些耀斑可以通过两种广泛的机制之一产生无线电波-一种发生在磁层(围绕磁星的强磁场)内，另一种发生在遥远的地方。在第一种情况下，能量耀斑仍然通过磁力线锚定在恒星的外壳上。当地壳不断地碰撞时，这些磁场就会扭曲和转动，直到它们突然变成一种更简单的状态，立即释放出激光般的无线电波。\n在梅茨格和他的同事们去年发表的第二种情况下，能量耀斑逃离磁层，传播了很长一段距离-最高可达磁星半径的100万倍。在这里，它撞上了围绕磁星的较老的碎片，并产生了冲击波。这个冲击波向外移动，压缩它前面的磁化等离子体，并在它后面建立一个磁场。然后，当电子被激波锋面卷起时，它们开始绕着磁场旋转--这种舞蹈会发出另一束激光般的无线电波。这个模型做出了一个至关重要的预测。产生无线电发射的同样的冲击波也应该加热电子，使它们发射X射线。事实上，这次爆发释放的X射线能量应该是无线电波的100,000倍。\n但是，当唯一快速的射电爆发来自遥远的星系时，就不可能验证这一预测。原因很简单吗？X射线望远镜没有射电望远镜那么灵敏。即使所有的X射线能量对我们来说也是看不见的。\n当爆炸发生在我们宇宙的后院时就不是这样了。对这一新爆发的全面X射线分析发现，它释放了大量的X射线辐射--与梅泽尔的预测完全相符。梅茨格说：“我很惊讶这个模型的效果如此之好。”“它会给你一个小小的打击，并说，‘也许这值得我花时间。’”\n虽然单个事件不能证明所有快速射电爆发都来自磁星，但加州理工学院的天文学家维克拉姆·拉维(Vikram Ravi)认为没有任何理由援引其他物体来解释各种可能的爆发行为。梅茨格指出，考虑到早在这一发现之前就有大量证据指向磁星，我们有理由认为不同类型的磁星可以解释我们所看到的多种类型的快速射电爆发。例如，重复出现的快速射电爆发可能来自年轻的、活跃的磁星，它们的磁场比我们银河系中的磁场强得多。\n这种联系意味着我们可以使用快速的射电爆发来识别遥远宇宙中的磁星，使科学家能够对这些极端物体进行普查，并更好地解释它们的起源。在我们的星系中，我们怀疑磁星是在明亮的超新星爆炸中形成的。但是，如果我们开始在没有大质量恒星的星系中看到它们，那可能会指向更奇异的方式来创造磁星，比如两颗中子星的碰撞。\n但首先，科学家们将密切关注附近的磁星，希望看到另一次令人震惊的近距离爆发。虽然磁星联系并不完全令人惊讶，但他们希望看到更多的例子来证实这一点。“从‘哦，天哪，这真的是真的’的意义上来说，这仍然令人震惊，”海瑟斯说。“在一张纸上写下一些方程式，然后面对它实际上是真实的，我们刚刚证明了这一点，这两者之间存在巨大的差异。”", "note_en": "The astronomers then turned toward the  previously known source: an ultra-dense, rapidly spinning and highly magnetized cinder of a stellar core called a magnetar. With a  single lucky discovery, the mystery of where fast radio bursts come from appeared to have been solved. “It’s not so often that you get a clue that is so striking that it seems to suddenly solve a big chunk of the puzzle,” said  Jason Hessels of the Netherlands Institute for Radio Astronomy and the University of Amsterdam. “Normally we’re kind of chipping away at the problem as opposed to making such a giant leap forward.”\n With the culprit in hand, astronomers can now focus on pinpointing the nitty-gritty physics at play. Over the past month, a  flood of papers has appeared as theorists have speculated how magnetars might launch such brilliant flashes of radio waves. It’s likely that the magnetar starts the process by blasting charged particles in a powerful flare. But astrophysicists are debating exactly how that flare produces the burst of radio waves. It’s similar to identifying a magician, Hessels said, and then trying to decipher the secrets behind their trick.\n  Astronomers have racked up roughly  50 separate theories to explain fast radio bursts — a tally that until recently outnumbered the events. The ideas include a variety of wild scenarios involving evaporating black holes, snapping cosmic strings, and even the propulsion systems of alien civilizations.\n But as the number of detections increased, scientists began to favor one explanation above the rest: magnetars. “There were just a number of their properties that really screamed out that they were coming from some kind of magnetized neutron star,” said  Brian Metzger, an astrophysicist at Columbia University. For example, a fast radio burst’s waves are highly polarized, which suggests that they come from an intense magnetic field. Their short duration implies that they come from a relatively small astrophysical object. And they must be powered by a substantial reservoir of energy.\n  Skeptics, however, have argued that if magnetars were the source, we should see fast radio bursts within our own galaxy. With this burst, we have. “In some ways, it’s a great relief,” said Metzger, who has worked on magnetar models. “It means I haven’t thrown away several years of work.”\n The task now is to pinpoint exactly how a magnetar creates the brief burst of radio waves. Many ideas begin with a magnetar blasting out a flare of energy, often in the form of electron and positron pairs. These flares can then produce radio waves via one of two broad mechanisms — one that occurs within the magnetosphere (the intense magnetic field that surrounds the magnetar) and one that occurs well beyond. In the first scenario, the flare of energy remains anchored to the crust of the star via magnetic field lines. As the crust continuously jostles about, these magnetic fields twist and turn until they snap to a simpler state, immediately releasing a laserlike flash of radio waves.\n In the second scenario, which Metzger and his colleagues  published last year, the flare of energy escapes the magnetosphere and travels a large distance — up to 1 million times the radius of the magnetar. Here it plows into the older debris surrounding the magnetar and generates a shock wave. That shock moves outward, compressing the magnetized plasma ahead of it and building a magnetic field behind it. Then, as electrons are swept up by the shock front, they begin to gyrate around the magnetic field — a dance that emits another laserlike flash of radio waves. This model makes a crucial prediction. The same shock that generates the radio emission should also heat the electrons, causing them to emit X-rays. In fact, the burst should release 100,000 times more energy in X-rays than in radio waves.\n  But when the only fast radio bursts have come from distant galaxies, it’s impossible to check this prediction. The simple reason? X-ray telescopes aren’t as sensitive as radio telescopes. Even all that X-ray energy would still be invisible to us.\n Not so when the burst is in our cosmic backyard. A  full X-ray analysis of this new burst found that it released a colossal amount of X-ray radiation — perfectly matching Metzger’s prediction. “I’m amazed how well the model works,” Metzger said. “It gives you a little kick and says, ‘Maybe this is worth my time.’”\n  While a single event can’t prove that all fast radio bursts come from magnetars,  Vikram Ravi, an astronomer at Caltech, doesn’t see any reason to invoke other objects to explain the variety of possible burst behavior. And given the amount of evidence that pointed to magnetars even before this discovery, Metzger notes that it’s plausible to assume that different types of magnetars can explain the many types of fast radio bursts we see. For example,  fast radio bursts that repeat could come from young, active magnetars whose magnetic fields are much stronger than the ones in our galaxy.\n  The link means that we can use fast radio bursts to identify magnetars in the distant universe, allowing scientists to build a census of these extreme objects and better explain their origins. In our galaxy, we suspect that magnetars form in brilliant supernova explosions. But if we begin to see them in galaxies without massive stars, that might point toward more exotic ways to create a magnetar, such as the collision of two neutron stars.\n But first, scientists will keep an eye on nearby magnetars in the hope of seeing another shockingly close burst. Though the magnetar connection wasn’t a total surprise, they’d like to see it confirmed by many more examples. “It still comes as a shock in the sense of ‘oh my God, it’s really true,’” Hessels said. “There’s a huge difference between some equations on a piece of paper and then being confronted that it’s actually real, that we just proved it.”", "posttime": "2020-06-13 09:41:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "爆发,discovery,磁星", "title": "一项令人惊讶的发现指出了快速射电爆发的根源", "title_en": "A Surprise Discovery Points to the Source of Fast Radio Bursts", "transed": 1, "url": "https://www.quantamagazine.org/a-surprise-discovery-shows-magnetars-create-fast-radio-bursts-20200611/", "via": "", "real_tags": ["爆发", "discovery", "磁星"]}, {"category": "", "categoryclass": "", "imagename": "78a97967654669288a08ce3bd275365e.jpg", "infoid": 1006361, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Dobsonian望远镜的一步一步制作。", "note_en": "Step-by-step making of A Dobsonian telescope.", "posttime": "2020-06-13 09:41:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "望远镜,building,dobsonian", "title": "约翰·多布森的望远镜大楼[视频]", "title_en": "Telescope Building with John Dobson [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=snz7JJlSZvw", "via": "", "real_tags": ["望远镜", "building", "dobsonian"]}, {"category": "", "categoryclass": "", "imagename": "24849c1a9435ffa46fefb79ad22bdedb.jpg", "infoid": 1006360, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加入我们的行列，参加首个全球性的全在线WWDC20。即将于6月22日。", "note_en": "Join us for the first global, all-online WWDC20. Coming June 22.", "posttime": "2020-06-13 09:24:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,app,apple,行列", "title": "苹果WWDC20", "title_en": "Apple WWDC20", "transed": 1, "url": "https://developer.apple.com/wwdc20/", "via": "", "real_tags": ["苹果", "app", "apple", "行列"]}, {"category": "", "categoryclass": "", "imagename": "453a23172fdd867f4f3807dfc17fd548.jpg", "infoid": 1006359, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "HBO Max推出仅几周后，就增加了HBO、HBO Go和HBO Now本已令人困惑的HBO产品阵容，WarnerMedia正在做出一些改变，试图减少对哪款应用程序用途的一些困惑。\n在我进一步介绍HBO Max之前，先简单介绍一下：HBO Max是AT&amp；T的新流媒体服务，可以让你访问整个HBO资料库，以及卡通电视网节目和吉卜力工作室(Studio Ghibli)电影等附加内容。你可以每月14.99美元的费用直接订阅HBO Max，但如果你订阅HBO，许多有线电视提供商也会免费提供，而且作为AT&amp；T的一些无线、互联网或电视套餐的一部分，它也是免费的。我们已经编写了一份指南，您可以通过订阅访问此处。\n需要知道的一件关键事情是，HBO Max实际上是HBO Now的扩展和更名版本，HBO Now是该公司之前仅提供流媒体服务的版本。在大多数平台上，如苹果电视，HBO Now应用程序直接更新为HBO Max。\n在HBO Max出现之前，有线电视订户可以使用一款名为HBO Go的应用程序流式播放HBO节目。从7月31日起，WarnerMedia将从“主要平台”中去掉这款应用(用WarnerMedia的话说就是“日落”)。如果你之前依赖HBO Go，很多有线电视提供商已经让你登录HBO MAX了。你可以在这里看到完整的名单。\n这种“主要平台”的语言很重要，因为WarnerMedia还没有达成协议，将HBO Max带到Roku或亚马逊的流媒体设备上。在这些平台上，WarnerMedia不会将HBO Now应用程序升级为HBO Max。相反，它只是简单地更名为“HBO”，价格仍为14.99美元，尽管你只能在上面观看HBO内容，而不是扩展后的HBO Max目录。根据WarnerMedia的说法，这种品牌转变将在未来几个月发生。\n这一切都是HBO Max首席执行官托尼·冈卡尔维斯上周在Vergecast上告诉我们的戏剧性加速，当时他表示，有线电视订户可以在“一段时间内”继续使用HBO Go，事情将在“三到六个月”后变得更加明朗。实际上，它花了10天的时间。但从美国电话电报公司(AT&amp；T)全面推出HBO Max来看，这种仓促是理所当然的。\n总而言之，最终只有两个选择：Roku和亚马逊的用户可以获得HBO应用程序，它只允许你观看HBO内容，可以通过现有的有线电视订阅访问，或者只需支付14.99美元的月费即可。这是HBO需要解决的问题-Roku控制着近45%的联网设备视频流媒体分钟数。但就目前而言，这就是我们要做的。\n其他人都可以获得HBO Max，你可以通过一些现有的有线电视订阅或支付14.99美元的月费来观看HBO内容和更多内容。\n所以这就更清楚了。但这一切仍然让人相当困惑。", "note_en": "Just weeks after the launch of HBO Max, which added to the already confusing HBO product lineup of HBO, HBO Go, and HBO Now, WarnerMedia is making some changes in an attempt to reduce some of the confusion about which app is for which purpose.\n A short primer on HBO Max, before I go further: HBO Max is AT&amp;T’s new streaming service that lets you access the entire HBO library plus additional content like Cartoon Network shows and the Studio Ghibli movies. You can subscribe to HBO Max directly for a $14.99 monthly fee, but it’s also offered for free from many cable providers if you subscribe to HBO, and it’s free as part of some AT&amp;T wireless, internet, or TV plans. We’ve compiled a guide for which subscriptions give you access  here.\n  A key thing to know is that HBO Max is really an expanded and rebranded version of HBO Now, the company’s previous streaming-only service. On most platforms, like Apple TV, the HBO Now app was directly updated to become HBO Max.\n Before HBO Max existed, cable subscribers could stream HBO shows using an app called HBO Go. WarnerMedia will be getting rid of that app (or “sunsetting” it, in WarnerMedia’s language) from “primary platforms” as of July 31st. If you previously relied on HBO Go, many cable providers will already let you log in to HBO Max. You can see that  full list here.\n That “primary platforms” language is important, because WarnerMedia still hasn’t struck deals to bring HBO Max to Roku or Amazon streaming devices. On those platforms, WarnerMedia is  not upgrading the HBO Now app to become HBO Max. Instead, it’s rebranding to simply be “HBO,” where it will still cost $14.99, even though you’ll only be able to watch HBO content on it and  not the expanded HBO Max catalog. This branding switch will be happening over the coming months, according to WarnerMedia.\n This all is a dramatic acceleration of what HBO Max chief Tony Goncalves told us on   The Vergecast just last week, when he said cable subscribers could continue to use HBO Go for a “period of time,” and that things would be clearer in “three to six months.” In reality, it took 10 days. But based on AT&amp;T’s general rollout of HBO Max, the rush is par for the course.\n In summary, there will eventually just be two options: Roku and Amazon users get the HBO app, which only lets you watch HBO content, that’s accessible with an existing cable subscription or by paying a $14.99 monthly fee. This is  a problem that HBO needs to resolve — Roku controls nearly 45 percent of connected device video streaming minutes. But for now, this is what’s there.\n Everyone else gets HBO Max, which lets you watch HBO content and a lot more with some existing cable subscriptions or by paying a $14.99 monthly fee.\n So it’s a little clearer. But it’s all still pretty confusing.", "posttime": "2020-06-13 08:51:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,app,rid,hbo", "title": "WarnerMedia正在淘汰HBO Go应用程序", "title_en": "WarnerMedia Is Getting Rid of the HBO Go App", "transed": 1, "url": "https://www.theverge.com/2020/6/12/21289536/hbo-go-app-now-max-warnermedia-att", "via": "", "real_tags": ["程序", "app", "rid", "hbo"]}, {"category": "", "categoryclass": "", "imagename": "0b005ce1ea9b6c0b5d2d824b56b88e47.jpeg", "infoid": 1006357, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Travis CI使用PostgreSQL 13、12、11和10的官方扩展坞图像进行了测试。需要libNa&gt；=1.0.18。除了libNa库和它的开发头文件之外，您可能还需要PostgreSQL头文件(通常位于&#39；-dev；包中)来构建扩展。\npgTAP测试可以使用&#39；sudo-u postgres pg_proven test.sql&39；运行，也可以在独立的Docker映像中运行。如果您安装了docker来运行所有测试，则运行./test.sh。请注意，这将针对四个不同主要版本的PostgreSQL运行测试和下载docker映像，因此它需要一段时间，并且在您第一次运行它时需要大量的网络带宽。\npgNa参数以及内容和键的返回值都是byteA类型。如果您希望对一般内容使用文本或varchar值，则必须确保它们的编码正确。ENCODE()和DECODE()和CONVERT_TO()/CONVERT_FROM()二进制字符串函数可以从文本转换为字节。没有转义或Unicode字符的简单的文本字符串将由数据库隐式转换，这就是测试中如何完成的，以节省时间，但是如果您希望使用pgNa而不出现转换错误，那么您确实应该显式转换您的文本内容。\n大多数libnataAPI都可以作为SQL函数使用。成对生成的密钥作为记录类型返回，例如：\npgNa小心地使用内存清理回调将释放时使用的所有已分配内存清零。一般说来，将机密存储在数据库本身是一个坏主意，虽然这样做可以小心，但风险更高。为了帮助解决此问题，pgsodium有一个可选的服务器密钥管理功能，可以在引导时加载服务器密钥。\n如果您将pgNa添加到您的shared_preload_library配置中，并在您的postgres共享扩展目录中放置一个特殊的脚本，则服务器可以在serverstart上预加载一个libNa密钥。无法从SQL访问密钥。使用服务器秘密密钥的唯一方法是使用下一节中所示的pgnatrave()从它派生其他密钥。\n服务器管理的密钥是完全可选的，pgNa仍然可以在不将其放入Shared_PRELOAD_LIBRARY中的情况下使用，您只需提供您自己的密钥管理即可。如果选择不使用服务器管理的密钥，请跳到API用法部分。\n有关返回libNa密钥的示例脚本，请参见文件pgnatagetkey.sample。脚本必须在一行上发出十六进制编码的32字节(64个字符)字符串。请勿在不替换您自己的密钥的情况下使用此文件。编辑文件以添加您自己的密钥，删除退出行，删除.sample后缀，并使文件成为可执行文件(在unixen chmod+x pgnatagetkey上)。\n接下来，将pgNa放在您的共享预加载库中。对于dockertainers，您可以在运行之后附加以下内容：\n您可以根据需要编辑脚本以获取或生成密钥。pgNa可用于生成具有SELECT编码的新随机密钥(随机字节_buf(32)，#39；十六进制)。其他常见模式包括在引导时提示输入密钥，从sshserver或托管云秘密系统获取密钥，或者使用命令行工具从硬件安全模块获取密钥。\n使用libNa key DerivationFunctions通过id和可选上下文从主服务器秘密密钥导出新密钥。密钥ID只是大整数。如果您知道密钥ID、密钥长度(默认为32字节)和上下文(默认为pgNa&39；)，您就可以确定地生成派生密钥。\n派生密钥可用于加密数据或用作种子，以便使用crypto_sign_Seed_keypair()或crypto_box_Seed_keypair()确定地生成密钥对。明智的做法是不存储这些秘密，而只存储或推断密钥ID、长度和上下文。如果攻击者窃取了您的数据库映像，即使他们知道密钥ID、长度和上下文，也无法生成密钥，因为他们没有服务器密钥。\n密钥ID、密钥长度和上下文可以是秘密的，如果您存储了它们，那么如果登录的数据库用户有权调用pgNa_Derate()函数，那么他们可能会生成密钥。向客户端保密密钥ID和/或长度上下文可以避免这种可能性，并确保正确设置数据库安全模型，以便只向与加密API交互的用户提供可能的最低权限。\n密钥轮换由您决定，无论您想要从一个密钥转到下一个密钥。一个简单的策略是递增密钥ID并重新加密，从N到N+1。较新的密钥将具有递增的ID，您总是可以知道密钥被取代的顺序。\n派生上下文是一个8字节的字节。相同的密钥ID在不同的上下文中生成不同的密钥。缺省上下文是ASCII编码字节PGNa。您可以自由使用任何8字节上下文来确定键的范围，但请记住，它必须是有效的8字节字节，可以自动正确转换为简单的ASCII字符串。有关其他字符的编码信息，请参阅encode()和decode()以及Convert_to()/Convert_from()二进制字符串函数。给定每个上下文一个大整数键空间和2^64个上下文，可派生的键空间非常大。\n#SELECT PgNa_Derate(1)；pgsodium_derive--\\x84fa0487750d27386ad6235fc0c4bf3a9aa2c3ccb0e32b405b66e69d5021247b#SELECT PgNa_Derate(1，64)；pgsodium_derive--。-\\xc58cbe0522ac4875707722251e53c0f0cfd8e8b76b133f399e2c64c9999f01cb1216d2ccfe9448ed8c225c8ba5db9b093ff5c1beb2d1fd612a38f40e362073fb#SELECT PGNa_DRIVE(1，32，&#39；__auth__&#39；)；pgsodium_derive--\\xa9aadb2331324f399fb58576c69f51727901c651c970f3ef6cff47066ea92e95\n派生密钥可以在用于对称加密的crypto_Secretbox_*函数中直接使用，或者用作使用例如crypto_box_Seed_new_keypair()和crypto_sign_Seed_new_keypair()生成其他密钥对的种子。\n下面是一个示例脚本，它加密表中的一列，并提供执行动态解密的视图。每行存储用于派生加密密钥的随机数和密钥ID。\nCREATE SCHEMA pgNa；使用SCHEMA pgNa创建扩展pgNa；CREATE TABLE TEST(id bigSerial主键，key_id bigint NOT NULL DEFAULT 1，NONCE BYTEA NOT NULL，DATA BYTEA)；CREATE VIEW TEST_VIEW AS SELECT ID，CONVERT_FROM(pgsodium.crypto_secubox_open(data，nonce，pgsodium.pgNa_Derate(Key_Id))，&#39；utf8&39；)作为test中的数据；CREATE OR REPLACE。BEGIN INSERT INSERT INTO TEST(NONCE)VALUES(New_Nonce)将id返回test_id；更新测试集data=pgsodium.crypto_Secretbox(CONVERT_TO(new.data，&#39；utf8&#39；)，new_nonce，pgsodium.pgNa_派生(Key_Id))WHERE id=test_id；return new；end；$$；CREATE TRIGGER TEST_ENCRYPT_TRIGGER INSTEAD OF INSERT ON TEST_VIEW执行函数test_。\n将视图当作普通表使用，但是下面的表是加密的。请注意，在下面的示例中，没有存储的、向SQL公开的或能够记录的密钥，只使用了基于密钥ID的派生密钥。\n触发TEST_ENCRYPT_TRIGGER代替包装器TEST_VIEW上的INSERT，新插入的行用从存储的KEY_ID派生的密钥加密，该密钥默认为1。\n#INSERT INSERT INTO TEST_VIEW(DATA)值(&#39；这是一个&#39；)，(&#39；这是两个&#39；)；#SELECT*FROM TEST；id|Key_id|Nonce|data-+-+--+。-3|1|\\xa6b9c4bfbfe194541faa21f2d31565babff1a250a010fa79|\\xb1d0432b173eb7fbef315ba5dd961454a4e2eef1332f9847eaef68 4|1|\\x0ad82e537d5422966c110ed65f60c6bada57c0be73476950|\\x8c29b12778b6bb5873c9f7fa123c4f105d6eb16e0c54dfae93da10#SELECT*FROM TEST_VIEW；ID|DATA-+-3|这是1个4|这是2个。\n可以使用轮换函数来完成密钥轮换，该轮换函数将使用新的密钥ID重新加密行：\nCREATE OR REPLACE函数Rotate_Key(test_id bigint，new_key bigint)返回空语言plpgsql为$$DECLARE NEW_Nonce BYTEA；BEGIN NEW_Nonce=pgsodium.crypto_Secretbox_Noncegen()；更新测试集NONCE=new_nonce，key_id=new_key，data=pgsodium.crypto_secbox(pgsodium.crypto_Secretbox_open(test.data，test.nonce，\n通过传递行ID和新的密钥ID来调用旋转函数。旧的行将用旧的派生密钥解密，然后用新的派生密钥加密。\n#SELECT ROTATE_KEY(3，2)；ROTATE_KEY-#SELECT*FROM TEST；id|Key_id|Nonce|data-+-+--+。-4|1|\\x0ad82e537d5422966c110ed65f60c6bada57c0be73476950|\\x8c29b12778b6bb5873c9f7fa123c4f105d6eb16e0c54dfae93da10 3|2|\\x775f6b2fb01195f8646656d7588e581856ea44353332068e|\\x27da7b96f4eb611a0c8ad8e4cee0988714d14e830a9aaf8f282c2a#SELECT*FROM TEST_VIEW；ID|数据-+-4|这是2|这是1。\n如果攻击者获取表或数据库的转储，他们将无法派生用于加密数据的密钥，因为他们将没有根服务器管理的密钥，该密钥永远不会泄露给SQL。有关详细信息，请参阅示例文件。\n下面是test.sql中的一个用法示例，它使用命令行psql客户端命令(以反斜杠开头)创建从Alice到Bob的密钥对和加密消息。\n--为bob和alice生成公钥和私钥对--\\gset[前缀]是一个psql命令，它将创建本地脚本变量SELECT public，secrefrom crypto_box_new_keypair()\\gset bob_select public，secret from crypto_box_new_keypair()\\gset alice_--创建boxnonceSELECT crypto_box_noncegen()boxnonce\\gset--alice加密。，：&#39；bob_public&#39；，：：&#39；)box\\gset--Bob使用他的密钥、随机数和Alice&#39；的公钥SELECT CRYPTO_BOX_OPEN(：&#39；box&#39；，：&#39；boxnonce&#39；，：&#39；alice_public&#39；，：&#39；bob_ret&#39；)。\n注意：在上面的示例中，数据库中没有存储任何机密，但是它们是由发送到服务器的psql客户端插入到SQL中的，因此它们可能会显示在数据库日志中。您可以通过使用派生密钥来避免这种情况。\n如果您选择使用自己的密钥，一种更偏执的方法是将密钥保存在外部存储中，并禁用日志记录，同时使用set local将密钥注入局部变量。如果数据库的图像被黑客攻击或窃取，攻击者将无法获得密钥。\n要禁用键注入的日志记录，还可以使用set local禁用LOG_STATEMENT，然后重新启用正常日志记录。如下所示。设置LOG_STATEMENT需要超级用户权限：\n--必须在事务块BEGIN中设置LOCAL；--为Bob和Alice生成boxnonce以及公钥和私钥对--这将创建发送回客户端但不存储的秘密--或记录秘密。请确保您正在使用加密的数据库连接！SELECT CRYPTO_BOX_NONCEGEN()boxnonce\\gsetSELECT public，Secret from crypto_box_new_keypair()\\gset bob_select public，secret from crypto_box_new_keypair()\\gset Alice_--关闭日志记录并将密码注入SET LOCAL会话，然后继续记录。Set local log_Statement=&#39；None&#39；；ALICE_SECRET&#39；；RESET LOG_STATEMENT；--现在调用`Current_Setting()`函数来获取密钥，这些密钥不会--存储在数据库中，而只存储在会话内存中，当会话关闭时，它们将不再可访问。--Alice使用她的密钥和他的公钥为Bob加密盒SELECT CRYPTO_BOX(&#39；Bob是您的叔叔&39；：&#39；boxnonce&39；，：&#39；bob。app.alice_secret&39；)：：bytea)BOX\\gset--Bob使用他的密钥和爱丽丝的公钥解密BOX。SELECT CRYPTO_BOX_OPEN(：&#39；BOX&#39；，：&#39；BOXNONCE&#39；，：&#39；ALICE_PUBLIC&39；，current_setting(&#39；app.bob_secret&#39；)：：bytea)；COMMIT；\n对于额外的偏执，您可以使用一个函数来检查正在使用的连接是安全的还是Unix域套接字。\nCREATE Function IS_SSL_OR_DOMAIN_SOCKET()将boolLANGUAGE plpgsql返回为$$DECLARE ADDR TEXT；SSL TEXT；BEGIN SELECT inet_CLIENT_ADDR()INTO ADDR；SELECT CURRENT_SETTING(&#39；SSL&#39；，TRUE)INTO SSL；如果找不到OR((SSL IS NULL或SSL！=&#39；ON&#39；)AND(addr IS NOT NULL OR Length(Addr)！=0))，则返回FALSE；END IF；RETURN。\n当然，这并不能保证秘密不会以某种方式泄露出去，但如果您从不存储秘密，而只通过安全通道将其发送回客户端，例如使用上面所示的psql client\\gset命令，或者只存储添加的密钥ID和上下文，则它会很有用。\n下面的参考文献改编自并使用了一些与libNa C APIDocumentation相同的语言。有关算法和其他LibNa特定细节的详细信息，请参阅这些文档。\n该库提供了一组函数来生成不可预测的数据，适用于创建密钥。\n函数的作用是：返回一个介于0和上限(不包括在内)之间的不可预知的值。与随机字节_随机()%UPPER_BIND不同，它保证可能输出值的均匀分布，即使当UPPER_BIND不是2的幂时也是如此。请注意，UPERBIND&lt；2只留下一个元素可供选择，即0。\n随机字节_buf_defiristic()返回一个大小字节，该字节包含在不知道种子的情况下与随机字节无法区分的字节。对于给定的种子，此函数将始终输出相同的序列。大小最大可达2^38(256 GB)。\ncrypto_Secretbox_keygen()--&gt；byta crypto_Secretbox_Noncegen()-&gt；bytecrypto_secto box(message byteA，nonce bytea，key bytea)-&gt；bytecrypto_Secretbox_open(密文byteA，nonce bytea，key bytea)-&gt；byteA。\ncrypto_Secretbox_noncegen()生成一个随机随机数，该随机数将在加密消息时使用。为了安全起见，每个随机数只能使用一次，尽管它不是秘密。随机数的目的是增加消息的随机性，以便用相同密钥多次加密的同一消息将产生不同的密文。\ncrypto_Secretbox()使用先前生成的随机数和密钥对消息进行加密。可以使用crypto_Secretbox_open()对加密的消息进行解密。请注意，要解密消息，需要原始的随机数。\ncrypto_auth_keygen()-&gt；byta crypto_auth(message byteA，key byteA)-&gt；byTea crypto_auth_ify(mac byteA，message byteA，key bytea)-&gt；布尔值。\ncrypto_auth()生成用于组合消息和密钥的身份验证标记(Mac)。这不会加密消息；它只是提供了一种证明消息没有被篡改的方法。要验证以这种方式标记的消息，请使用crypto_auth_ify()。此函数是确定性的：对于给定的消息和密钥，生成的MAC将始终相同。\n请注意，这需要访问密钥，这通常不应该共享。如果许多用户需要验证消息，使用公钥签名通常比共享私钥要好。\ncrypto_auth_ify()验证给定的mac(Authationtag)是否与提供的消息和密钥匹配。这告诉我们原始消息没有被篡改。\ncrypto_box_new_keypair()--&gt；crypto_box_keypair crypto_box_Noncegen()-&gt；bytecrypto_box(message bytea，nonce byTea，public bytee，secrebytee)-&gt；bytecrypto_box_open(密文byteA，nonce byTea，public bytea，secreybytee)-&gt；byTea\ncrypto_box_new_keypair()返回用于公钥加密的新的、随机生成的密钥对。公钥可以与任何人共享。绝对不能共享密钥。\ncrypto_box_noncegen()生成将在加密消息时使用的随机随机数。为了安全起见，每个随机数只能使用一次，尽管这不是秘密。随机数的目的是增加消息的随机性，使得用相同密钥多次加密的同一消息将产生不同的密文。\ncrypto_box()使用随机数、意向接收方的公钥和发送方的私钥对消息进行加密。所得到的密文只能由预期的接收者使用他们的密钥来解密。现时值必须与密文一起发送。\ncrypto_box_open()解密使用crypto_box()加密的密文。它以密文、随机数、发送者的公钥和接收者的秘密密钥为参数，并返回原始消息。请注意，接收方应确保公钥属于发送方。\ncrypto_sign_new_keypair()-&gt；crypto_sign_keypair组合模式函数：crypto_sign(message byteA，key byteA)-&gt；byta crypto_sign_open(sign_message byteA，key byteA)-&gt；byta分离模式函数：crypto_sign_disached(message byteA，key byteA)-&gt；byta crypto_sign_ify_disached(sig byteA，message byteA，BYTEA CRYPTO_SIGN_UPDATE(状态BYTEA，消息BYTEA)-&gt；BYTEA CRYPTO_SIGN_FINAL_CREATE(状态BYTEA，密钥BYTEA)-&gt；BYTEA CRYPTO_SIGN_FINAL_VERIFY(状态BYTEA，签名BYTEA，密钥BYTEA)-&gt；布尔。\n这些函数用于验证消息来自特定的发起者(您拥有其公钥的秘密密钥的持有者)，并且没有被篡改。\ncrypto_sign_new_keypair()返回新的、随机生成的公钥签名密钥对。公钥可以与任何人共享。绝对不能共享密钥。\nCRYPTO_SIGN()和CRYTO_SIGN_VERIFY()在组合模式下运行。在此模式下，正在签名的消息与其签名合并为一个单元。\ncrypto_sign()使用签名者的密钥创建签名，并将该密钥添加到消息前面。可以使用crypto_sign_open()对结果进行身份验证。\ncrypto_sign_open()接受由crypto_sign()创建的签名消息，使用发送方的公钥检查其有效性，如果有效则返回原始消息，否则引发数据异常。\nCRYPTO_SIGN_DETACHED()和CRYPTO_SIGN_VERIFY_DETACHED()在分离模式下运行。在这种模式下，消息与签名保持独立。当希望对已存储的对象进行签名时，或者在一个对象需要多个签名的情况下，这会很有用。\ncrypto_sign_disached()使用签名者的密钥为消息生成签名。结果是独立于消息而存在的签名，可以使用crypto_sign_Verify_Detached()进行验证。\nCRYPTO_SIGN_VERIFY_DETACHED()用于验证由CRYPTO_SIGN_DETACHED()重新生成的签名。它采用生成的签名、原始消息和签名者的公钥，如果签名与消息和密钥匹配，则返回TRUE，否则返回FALSE。\nCRYPTO_SIGN_INIT()、CRYPTO_SIGN_UPDATE()、CRYPTO_SIGN_FINAL_CREATE()、CRYPTO_SIGN_FINAL_VERIFY()和聚合CRYPTO_SIGN_UPDATE_AGG()多部分消息的句柄签名。要创建或验证多方消息的签名，请使用crypto_sign_init()来启动该过程，然后每条消息。\n..", "note_en": "Travis CI tested withthe  official docker images forPostgreSQL 13, 12, 11, and 10. Requires libsodium &gt;= 1.0.18. Inaddition to the libsodium library and it&#39;s development headers, youmay also need the PostgreSQL header files typically in the &#39;-dev&#39;packages to build the extension.\n  pgTAP tests can be run with &#39;sudo -u postgres pg_prove test.sql&#39; orthey can be run in a self-contained Docker image. Run  ./test.sh ifyou have docker installed to run all tests. Note that this will runthe tests against and download docker images for four different majorversions of PostgreSQL, so it takes a while and requires a lot ofnetwork bandwidth the first time you run it.\n  pgsodium arguments and return values for content and keys are of type bytea. If you wish to use  text or  varchar values for generalcontent, you must make sure they are encoded correctly. The  encode() and decode() and convert_to()/convert_from()binary string functions can convert from  text to  bytea.Simpleascii  text strings without escape or unicode characters will be castby the database implicitly, and this is how it is done in the tests tosave time, but you should really be explicitly converting your  textcontent if you wish to use pgsodium without conversion errors.\n Most of the libsodium API is available as SQL functions. Keys thatare generated in pairs are returned as a record type, for example:\n  pgsodium is careful to use memory cleanup callbacks to zero out allallocated memory used by the when freed. In general it is a bad ideato store secrets in the database itself, although this can be donecarefully it has a higher risk. To help with this problem, pgsodiumhas an optional Server Key Management function that can load a serverkey at boot.\n  If you add pgsodium to your  shared_preload_librariesconfiguration and place a special script in your postgres sharedextension directory, the server can preload a libsodium key on serverstart.  The secret key cannot be accessed from SQL. The only wayto use the server secret key is to  derive other keys from it using pgsodium_derive() shown in the next section.\n Server managed keys are completely optional, pgsodium can still beused without putting it in  shared_preload_libraries, you will simplyneed to provide your own key management. Skip ahead to the API usagesection if you choose not to use server managed keys.\n See the file   pgsodium_getkey.sample foran example script that returns a libsodium key. The script must emita hex encoded 32 byte (64 character) string on a single line. DO NOTUSE THIS FILE WITHOUT SUBSTITUTING YOUR OWN KEY. Edit the file to addyour own key and remove the  exit line, remove the  .sample suffixand make the file executable (on unixen  chmod +x pgsodium_getkey).\n Next place  pgsodium in your  shared_preload_libraries. For dockercontainers, you can append this after the run:\n    It is up to you to edit the script to get or generate the key howeveryou want. pgsodium can be used to generate a new random key with select encode(randombytes_buf(32), &#39;hex&#39;). Other common patternsincluding prompting for the key on boot, fetching it from an sshserver or managed cloud secret system, or using a command line tool toget it from a hardware security module.\n  New keys are derived from the master server secret key by id and anoptional context using the  libsodium Key DerivationFunctions. Key id are just bigint integers. If you know the key id, key length (default 32bytes) and the context (default &#39;pgsodium&#39;), you can deterministiclygenerate a derived key.\n Derived keys can be used to encrypt data or as a seed fordeterministicly generating keypairs using  crypto_sign_seed_keypair()or  crypto_box_seed_keypair(). It is wise not to store these secretsbut only store or infer the key id, length and context. If anattacker steals your database image, they cannot generate the key evenif they know the key id, length and context because they will not havethe server secret key.\n The key id, key length and context can be secret or not, if you storethem then possibly logged in database users can generate the key ifthey have permission to call the  pgsodium_derive() function.Keeping the key id and/or length context secret to a client avoid thispossibility and make sure to set your  database securitymodel correctly sothat only the minimum permission possible is given to users thatinteract with the encryption API.\n Key rotation is up to you, whatever strategy you want to go from onekey to the next. A simple strategy is incrementing the key id andre-encrypting from N to N+1. Newer keys will have increasing ids, youcan always tell the order in which keys are superceded.\n A derivation context is an 8 byte  bytea. The same key id indifferent contexts generate different keys. The default context isthe ascii encoded bytes  pgsodium. You are free to use any 8 bytecontext to scope your keys, but remember it must be a valid 8 byte bytea which automatically cast correctly for simple ascii string.For encoding other characters, see the   encode() and decode() and convert_to()/convert_from()binary string functions. The derivable keyspace is huge given one bigint keyspace per context and 2^64 contexts.\n  # select pgsodium_derive(1); pgsodium_derive-------------------------------------------------------------------- \\x84fa0487750d27386ad6235fc0c4bf3a9aa2c3ccb0e32b405b66e69d5021247b# select pgsodium_derive(1, 64); pgsodium_derive------------------------------------------------------------------------------------------------------------------------------------ \\xc58cbe0522ac4875707722251e53c0f0cfd8e8b76b133f399e2c64c9999f01cb1216d2ccfe9448ed8c225c8ba5db9b093ff5c1beb2d1fd612a38f40e362073fb# select pgsodium_derive(1, 32, &#39;__auth__&#39;); pgsodium_derive-------------------------------------------------------------------- \\xa9aadb2331324f399fb58576c69f51727901c651c970f3ef6cff47066ea92e95\n  Derived keys can be used either directy in  crypto_secretbox_*functions for &#34;symmetric&#34; encryption or as seeds for generating otherkeypairs using for example  crypto_box_seed_new_keypair() and crypto_sign_seed_new_keypair().\n   Here&#39;s an example script that encrypts a column in a table andprovides a view that does on the fly decryption. Each row&#39;s storesthe nonce and key id used to derive the encryption key.\n CREATE SCHEMA pgsodium;CREATE EXTENSION pgsodium WITH SCHEMA pgsodium;CREATE TABLE test ( id bigserial primary key, key_id bigint not null default 1, nonce bytea not null, data bytea );CREATE VIEW test_view AS SELECT id, convert_from(pgsodium.crypto_secretbox_open( data, nonce, pgsodium.pgsodium_derive(key_id)), &#39;utf8&#39;) AS data FROM test;CREATE OR REPLACE FUNCTION test_encrypt() RETURNS trigger language plpgsql AS$$DECLARE new_nonce bytea = pgsodium.crypto_secretbox_noncegen(); test_id bigint;BEGIN insert into test (nonce) values (new_nonce) returning id into test_id; update test set data = pgsodium.crypto_secretbox( convert_to(new.data, &#39;utf8&#39;), new_nonce, pgsodium.pgsodium_derive(key_id)) where id = test_id; RETURN new;END;$$;CREATE TRIGGER test_encrypt_trigger INSTEAD OF INSERT ON test_view FOR EACH ROW EXECUTE FUNCTION test_encrypt();\n Use the view as if it were a normal table, but the underying table isencrypted. Note how in the following example, there are  no keysstored, exposed to SQL or able to be logged, only  derivedkeys based on a key id are used.\n The trigger  test_encrypt_trigger is fired  INSTEAD OF INSERT ON thewrapper  test_view, newly inserted rows are encrypted with a keyderived from the stored key_id which defaults to 1.\n # insert into test_view (data) values (&#39;this is one&#39;), (&#39;this is two&#39;);# select * from test; id | key_id | nonce | data----+--------+----------------------------------------------------+---------------------------------------------------------- 3 | 1 | \\xa6b9c4bfbfe194541faa21f2d31565babff1a250a010fa79 | \\xb1d0432b173eb7fbef315ba5dd961454a4e2eef1332f9847eaef68 4 | 1 | \\x0ad82e537d5422966c110ed65f60c6bada57c0be73476950 | \\x8c29b12778b6bb5873c9f7fa123c4f105d6eb16e0c54dfae93da10# select * from test_view; id | data----+------------- 3 | this is one 4 | this is two\n Key rotation can be done with a rotation function that will re-encrypta row with a new key id:\n CREATE OR REPLACE FUNCTION rotate_key(test_id bigint, new_key bigint) RETURNS void LANGUAGE plpgsql AS $$DECLARE new_nonce bytea;BEGIN new_nonce = pgsodium.crypto_secretbox_noncegen(); UPDATE test SET nonce = new_nonce, key_id = new_key, data = pgsodium.crypto_secretbox( pgsodium.crypto_secretbox_open( test.data, test.nonce, pgsodium.pgsodium_derive(test.key_id)), new_nonce, pgsodium.pgsodium_derive(new_key)) WHERE test.id = test_id; RETURN;END;$$;\n Call the rotation function by passing a row id and a new key id. Theold row will be decrypted with the old derived key, then encryptedwith the new derived key.\n # select rotate_key(3, 2); rotate_key------------# select * from test; id | key_id | nonce | data----+--------+----------------------------------------------------+---------------------------------------------------------- 4 | 1 | \\x0ad82e537d5422966c110ed65f60c6bada57c0be73476950 | \\x8c29b12778b6bb5873c9f7fa123c4f105d6eb16e0c54dfae93da10 3 | 2 | \\x775f6b2fb01195f8646656d7588e581856ea44353332068e | \\x27da7b96f4eb611a0c8ad8e4cee0988714d14e830a9aaf8f282c2a# select * from test_view; id | data----+------------- 4 | this is two 3 | this is one\n If an attacker acquires a dump of the table or database, they will notbe able to derive the keys used encrypt the data since they will nothave the root server managed key, which is never revealed to SQL Seethe  example file for more details.\n  Here&#39;s an example usage from the test.sql that uses command-line  psql clientcommands (which begin with a backslash) to create keypairs and encrypta message from Alice to Bob.\n -- Generate public and secret keypairs for bob and alice-- \\gset [prefix] is a psql command that will create local-- script variablesSELECT public, secret FROM crypto_box_new_keypair() \\gset bob_SELECT public, secret FROM crypto_box_new_keypair() \\gset alice_-- Create a boxnonceSELECT crypto_box_noncegen() boxnonce \\gset-- Alice encrypts the box for bob using her secret key, the nonce and his public keySELECT crypto_box(&#39;bob is your uncle&#39;, :&#39;boxnonce&#39;, :&#39;bob_public&#39;, :&#39;alice_secret&#39;) box \\gset-- Bob decrypts the box using his secret key, the nonce, and Alice&#39;s public keySELECT crypto_box_open(:&#39;box&#39;, :&#39;boxnonce&#39;, :&#39;alice_public&#39;, :&#39;bob_secret&#39;);\n Note in the above example, no secrets are  stored in the db, but theyare  interpolated into the sql by the psql client that is sent to theserver, so it&#39;s possible they can show up in the database logs. Youcan avoid this by using derived keys.\n  If you choose to work with your own keys a more paranoid approach isto keep keys in an external storage and disables logging whileinjecting the keys into local variables with   SET LOCAL. If theimages of database are hacked or stolen, the keys will not beavailable to the attacker.\n To disable logging of the key injections,  SET LOCAL is also used todisable  log_statementsand then re-enable normal logging afterwards. as shown below. Setting log_statement requires superuser privledges:\n -- SET LOCAL must be done in a transaction blockBEGIN;-- Generate a boxnonce, and public and secret keypairs for bob and alice-- This creates secrets that are sent back to the client but not stored-- or logged. Make sure you&#39;re using an encrypted database connection!SELECT crypto_box_noncegen() boxnonce \\gsetSELECT public, secret FROM crypto_box_new_keypair() \\gset bob_SELECT public, secret FROM crypto_box_new_keypair() \\gset alice_-- Turn off logging and inject secrets-- into session with set local, then resume logging.SET LOCAL log_statement = &#39;none&#39;;SET LOCAL app.bob_secret = :&#39;bob_secret&#39;;SET LOCAL app.alice_secret = :&#39;alice_secret&#39;;RESET log_statement;-- Now call the `current_setting()` function to get the secrets, these are not-- stored in the db but only in session memory, when the session is closed they are no longer-- accessible.-- Alice encrypts the box for bob using her secret key and his public keySELECT crypto_box(&#39;bob is your uncle&#39;, :&#39;boxnonce&#39;, :&#39;bob_public&#39;, current_setting(&#39;app.alice_secret&#39;)::bytea) box \\gset-- Bob decrypts the box using his secret key and Alice&#39;s public key.SELECT crypto_box_open(:&#39;box&#39;, :&#39;boxnonce&#39;, :&#39;alice_public&#39;, current_setting(&#39;app.bob_secret&#39;)::bytea);COMMIT;\n For additional paranoia you can use a function to check that theconnection being used is secure or a unix domain socket.\n CREATE FUNCTION is_ssl_or_domain_socket() RETURNS boolLANGUAGE plpgsql AS $$DECLARE addr text; ssl text;BEGIN SELECT inet_client_addr() INTO addr; SELECT current_setting(&#39;ssl&#39;, true) INTO ssl; IF NOT FOUND OR ((ssl IS NULL OR ssl != &#39;on&#39;) AND (addr IS NOT NULL OR length(addr) != 0)) THEN RETURN false; END IF; RETURN true;END;$$;\n This doesn&#39;t guarantee the secret won&#39;t leak out in some way ofcourse, but it can useful if you never store secrets and send themonly through secure channels back to the client, for example using the psql client  \\gset command shown above, or by only storing aderived key id and context.\n  The reference below is adapted from and uses some of the same languagefound at the  libsodium C APIDocumentation. Refer to those documentsfor details on algorithms and other libsodium specific details.\n     The library provides a set of functions to generate unpredictabledata, suitable for creating secret keys.\n    The  randombytes_uniform() function returns an unpredictable valuebetween  0 and  upper_bound (excluded). Unlike  randombytes_random() % upper_bound, it guarantees a uniform distribution of the possibleoutput values even when  upper_bound is not a power of 2. Note that an upper_bound &lt; 2 leaves only a single element to be chosen, namely 0.\n    The  randombytes_buf_deterministic() returns a  size byteacontaining bytes indistinguishable from random bytes without knowingthe seed. For a given seed, this function will always output the samesequence. size can be up to 2^38 (256 GB).\n      crypto_secretbox_keygen() -&gt; bytea crypto_secretbox_noncegen() -&gt; bytea crypto_secretbox(message bytea, nonce bytea, key bytea) -&gt; bytea crypto_secretbox_open(ciphertext bytea, nonce bytea, key bytea) -&gt; bytea\n  crypto_secretbox_noncegen() generates a random nonce which will beused when encrypting messages. For security, each nonce must be usedonly once, though it is not a secret. The purpose of the nonce is toadd randomness to the message so that the same message encryptedmultiple times with the same key will produce different ciphertexts.\n crypto_secretbox() encrypts a message using a previously generatednonce and secret key. The encrypted message can be decrypted using crypto_secretbox_open() Note that in order to decrypt the message,the original nonce will be needed.\n     crypto_auth_keygen() -&gt; bytea crypto_auth(message bytea, key bytea) -&gt; bytea crypto_auth_verify(mac bytea, message bytea, key bytea) -&gt; boolean\n  crypto_auth() generates an authentication tag (mac) for acombination of message and secret key. This does not encrypt themessage; it simply provides a means to prove that the message has notbeen tampered with. To verify a message tagged in this way, use crypto_auth_verify(). This function is deterministic: for a givenmessage and key, the generated mac will always be the same.\n Note that this requires access to the secretkey, which is not something that should normally be shared. Ifmany users need to verify message it is usually better to use Public Key Signatures ratherthan sharing secret keys.\n crypto_auth_verify() verifies that the given mac (authenticationtag) matches the supplied message and key. This tells us that theoriginal message has not been tampered with.\n      crypto_box_new_keypair() -&gt; crypto_box_keypair crypto_box_noncegen() -&gt; bytea crypto_box(message bytea, nonce bytea, public bytea, secret bytea) -&gt; bytea crypto_box_open(ciphertext bytea, nonce bytea, public bytea, secret bytea) -&gt; bytea\n crypto_box_new_keypair() returns a new, randomly generated, pair ofkeys for public key encryption. The public key can be shared withanyone. The secret key must never be shared.\n crypto_box_noncegen() generates a random nonce which will be usedwhen encrypting messages. For security, each nonce must be used onlyonce, though it is not a secret. The purpose of the nonce is to addrandomness to the message so that the same message encrypted multipletimes with the same key will produce different ciphertexts.\n crypto_box() encrypts a message using a nonce, the intendedrecipient&#39;s public key and the sender&#39;s secret key. The resultingciphertext can only be decrypted by the intended recipient using theirsecret key. The nonce must be sent along with the ciphertext.\n crypto_box_open() descrypts a ciphertext encrypted using crypto_box(). It takes the ciphertext, nonce, the sender&#39;s publickey and the recipeient&#39;s secret key as parameters, and returns theoriginal message. Note that the recipient should ensure that thepublic key belongs to the sender.\n    crypto_sign_new_keypair() -&gt; crypto_sign_keypair combined mode functions: crypto_sign(message bytea, key bytea) -&gt; bytea crypto_sign_open(signed_message bytea, key bytea) -&gt; bytea detached mode functions: crypto_sign_detached(message bytea, key bytea) -&gt; bytea crypto_sign_verify_detached(sig bytea, message bytea, key bytea) -&gt; boolean multi-part message functions: crypto_sign_init() -&gt; bytea crypto_sign_update(state bytea, message bytea) -&gt; bytea crypto_sign_final_create(state bytea, key bytea) -&gt; bytea crypto_sign_final_verify(state bytea, signature bytea, key bytea) -&gt; boolean\n   These functions are used to authenticate that messages have have comefrom a specific originator (the holder of the secret key for which youhave the public key), and have not been tampered with.\n crypto_sign_new_keypair() returns a new, randomly generated, pair ofkeys for public key signatures. The public key can be shared withanyone. The secret key must never be shared.\n crypto_sign() and  crypto_sign_verify() operate in combined mode.In this mode the message that is being signed is combined with itssignature as a single unit.\n crypto_sign() creates a signature, using the signer&#39;s secret key,which it prepends to the message. The result can be authenticatedusing  crypto_sign_open().\n crypto_sign_open() takes a signed message created by crypto_sign(), checks its validity using the sender&#39;s public key andreturns the original message if it is valid, otherwise raises a dataexception.\n crypto_sign_detached() and  crypto_sign_verify_detached() operatein detached mode. In this mode the message is kept independent fromits signature. This can be useful when wishing to sign objects thathave already been stored, or where multiple signatures are desired foran object.\n crypto_sign_detached() generates a signature for message using thesigner&#39;s secret key. The result is a signature which existsindependently of the message, which can be verified using crypto_sign_verify_detached().\n crypto_sign_verify_detached() is used to verify a signaturegenerated by  crypto_sign_detached(). It takes the generatedsignature, the original message, and the signer&#39;s public key andreturns true if the signature matches the message and key, and falseotherwise.\n crypto_sign_init(),  crypto_sign_update(), crypto_sign_final_create(),  crypto_sign_final_verify(), and theaggregates  crypto_sign_update_agg() handle signatures formulti-part messages. To create or verify a signature for a multi-partmessage  crypto_sign_init() is used to start the process, and then eachmessage\n......", "posttime": "2020-06-13 08:50:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "postgresql,密码,modern,密钥", "title": "PgNa：使用LibNa实现PostgreSQL的现代密码学", "title_en": "Pgsodium: Modern cryptography for PostgreSQL using libsodium", "transed": 1, "url": "https://github.com/michelp/pgsodium", "via": "", "real_tags": ["密码", "modern", "密钥"]}, {"category": "", "categoryclass": "", "imagename": "d4923d230d10a14be6c66b3c3d6d7000.png", "infoid": 1006355, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对顾客的痴迷是我们文化的基础。只有当我们的所有客户都一致和可持续地取胜时，我们才是成功的。\n我们加强了我们自己、我们的团队和外部世界之间的反馈循环。我们寻求了解真相，并诚实地进行交流。\n从一端到另一端的思考放大了我们的影响力。我们专注于大局和更广泛的目标，同时又不失远见。\n我们深入了解每一个细节，积极学习、记录和分享知识。我们是日常工作以及如何连接Flexport更大系统的专家。\n我们观察世界，在适当的背景下引导信息，做出正确的决定，并对自己的果断行动负责。这就是我们如何以比我们的竞争对手更快的速度--朝着正确的方向--前进。\n没有捷径可走。我们寻求通过做最艰难的事情来创造最大的价值，从长远来看，最好地服务于每个利益相关者。", "note_en": "Customer obsession is the foundation of our culture. We are successful only when all of our customers are winning, consistently and sustainably.\n We strengthen feedback loops between ourselves, our teams, and the world beyond. We seek to understand the truth and communicate it honestly.\n Thinking from end to end amplifies our impact. We specialize without losing perspective on the big picture and broader goals.\n We dive deep to understand every detail, actively learning, documenting, and sharing knowledge. We are experts in our daily work and how it connects to Flexport’s larger systems.\n We observe the world, orient that information in proper context, make good decisions, and hold ourselves accountable for decisive action. This is how we move with more velocity—speed in the right direction—than our competitors.\n There are no shortcuts. We seek to create the most value by doing the hardest things that best serve every stakeholder over the long term.", "posttime": "2020-06-13 08:32:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英国,hiring,取胜", "title": "Flexport正在招聘希望帮助公司在伦敦顺利度过英国退欧的人", "title_en": "Flexport is hiring people who want to help companies navigate Brexit in London", "transed": 1, "url": "https://www.flexport.com/careers", "via": "", "real_tags": ["英国", "hiring", "取胜"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006354, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了帮助支持我们的社区在新冠肺炎期间远程工作，我们将在2020年6月30日之前免费提供ACM在我们数字图书馆中发布的所有作品。了解更多。\n我们使用饼干，以确保我们给你最好的经验，在我们的网站。\n您的浏览器似乎不支持它们，这会影响网站功能。", "note_en": "To help support our community working remotely during COVID-19, we are making all work published by ACM in our Digital Library freely accessible through June 30, 2020.  Learn more\n   We use cookies to ensure that we give you the best experience on our website.\n  It seems your browser doesn&#39;t support them and this affects the site functionality.", "posttime": "2020-06-13 08:32:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "历史,history,网站", "title": "F#的早期历史[pdf]", "title_en": "The Early History of F# [pdf]", "transed": 1, "url": "https://dl.acm.org/doi/pdf/10.1145/3386325", "via": "", "real_tags": ["历史", "history", "网站"]}, {"category": "", "categoryclass": "", "imagename": "972e2b55fb034abdf257282e82a6eec8.jpg", "infoid": 1006353, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "克里斯，我同意，我仍然很惊讶助熔剂没有被冲走。电路板被拍摄下来，因为它已经安装并运行了40年。这篇帖子更多的是欣赏人们在那个时代是如何设计电路和印制板的。印刷电路板的艺术品简直是完美无瑕，制作这些东西所付出的努力之大令人难以置信。", "note_en": "Chris, I agree, I was still very surprised the flux was not washed off. The board is photographed, as it was installed and running for 4 decades. The post is more about appreciation how people designed circuits and printed boards during that era. The PCB artwork is simply perfect, the amount of effort which went into making these things is mind boggling.", "posttime": "2020-06-13 08:31:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "制造,high,电路板", "title": "欧洲核子研究中心如何在20世纪70年代制造高质量的电子产品", "title_en": "How CERN Made High Quality Electronics in the 1970s", "transed": 1, "url": "https://hackaday.com/2020/06/12/how-cern-made-high-quality-electronics-in-the-1970s/", "via": "", "real_tags": ["制造", "high", "电路板"]}, {"category": "", "categoryclass": "", "imagename": "e6d32a0fbf5f47feda8d01e6f5cd8cb6.jpg", "infoid": 1006352, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，尖端窃听技术的清单稳步增长：窃听、窃听电话、墙上的窃听器-甚至从建筑物的玻璃上弹射激光来窃听里面的对话。现在添加另一个用于音频间谍的工具：房间里从窗户可以看到的任何灯泡。\n以色列内盖夫本古里安大学和魏茨曼科学研究所的研究人员今天公布了一项新的远程窃听技术，他们称之为喇叭。他们说，只要有一台笔记本电脑和不到1000美元的设备--只需一台望远镜和一个400美元的光电传感器--任何人都可以通过观察这些微小的振动，实时监听数百英尺外的房间里的任何声音。通过测量这些振动引起的灯泡光输出的微小变化，研究人员表明，间谍可以获得足够清晰的声音，足以辨别对话的内容，甚至可以识别一段音乐。\n本·纳西(Ben Nassi)说，房间里的任何声音都可以从房间里恢复出来，不需要侵入房间里的任何东西，也不需要侵入房间里的任何设备。本·纳西是本-古里安公司的安全研究员，他与同事雅伦·皮鲁廷(Yaron Pirutin)和鲍里斯·扎多夫(Boris Zadov)共同开发了这项技术，并计划在8月份的黑帽安全会议上公布他们的发现。你只需要把一个悬挂的灯泡对准视线，就是这个。\n在他们的实验中，研究人员在距离目标办公室灯泡约80英尺的地方放置了一系列望远镜，并将每个望远镜的目镜放在Thorlabs PDA100A2光电传感器的前面。然后，他们使用模数转换器将来自该传感器的电信号转换为数字信息。当他们在遥远的房间里播放音乐和语音录音时，他们将他们的设置收集的信息输入笔记本电脑，笔记本电脑分析读数。\n研究人员发现，灯泡对声音的微小振动-他们测量到的移动幅度只有几百微米-登记为他们的传感器通过每个望远镜接收到的光的可测量变化。在通过软件处理信号以滤除噪音后，他们能够以惊人的保真度重建房间内的声音录音：例如，他们展示了，他们可以足够好地再现唐纳德·特朗普(Donald Trump)总统的一段演讲的可听片段，足以被谷歌的云语音API(Cloud Speech API)转录。他们还制作了一张甲壳虫乐队的录音，让它足够清晰，以至于名字调子应用Shazam可以立即识别出来。\n尽管如此，这项技术还是有一些局限性。在他们的测试中，研究人员使用了一个悬挂的灯泡，目前还不清楚安装在固定灯或天花板灯具上的灯泡是否会振动到足以产生相同类型的音频信号。他们在演示中使用的语音和音乐录音也比普通人类对话的声音更大，演讲者将音量调到了最大。但研究小组指出，他们也使用了相对便宜的光电传感器和模数转换器，本来可以升级到更昂贵的，以获得更安静的对话。LED灯泡的信噪比大约是白炽灯泡的6.3倍，是荧光灯的70倍。\n尽管有这些警告，斯坦福大学的计算机科学家和密码学家丹·博内赫(Dan Boneh)认为，研究人员的技术仍然代表着一种重要的、具有潜在实用价值的新形式，他称之为旁路攻击--一种利用无意中的信息泄露来窃取机密的攻击。Boneh说，这是侧向通道的一种很好的应用。即使这需要一个悬挂的灯泡和高分贝，它仍然是超级有趣的。这仍然是第一次证明这是可能的。攻击只会变得更好，未来的研究只会随着时间的推移而改进这一点。\n在北卡罗来纳州立大学的尤瓦尔·埃洛维奇(Yuval Elovici)和无处不在的RSA加密系统的共同发明人阿迪·沙米尔(Adi Shamir)的建议下，该研究小组并不是第一个证明意外的声波现象可以导致窃听的人。研究人员多年来一直知道，激光从目标的窗户上反弹可以让间谍接收到里面的声音。2014年，另一组研究人员表明，即使恶意软件无法访问智能手机的麦克风，受攻击智能手机的陀螺仪也可以接收到声音。之前最接近Lamphone的技术是麻省理工学院、微软和Adobe的研究人员在2014年所说的视觉麦克风：通过分析通过望远镜拍摄的视频，房间里的一个物体会产生振动，比如一袋薯片或一株室内植物，这些研究人员能够重建语音和音乐。这项技术在2014年被麻省理工学院(MIT)、微软(Microsoft)和Adobe的研究人员称为视觉麦克风：通过分析通过望远镜拍摄的视频，房间里的物体会产生振动，比如一袋薯片或一株室内植物。\n但纳西指出，这项基于视频的技术虽然用途更广，因为它不需要在房间里看到灯泡，但它需要在录制视频后使用软件对其进行分析，以便将在物体上观察到的微妙振动转换为它所拾取的声音。相比之下，Lamphone可以实现实时间谍活动。由于振动物体本身就是光源，光电传感器可以用简单得多的视觉数据来捕捉振动。\n纳西认为，这可能会使喇叭在间谍活动中的使用比以前的技术更实用。他说，当你真正实时使用它时，你可以实时回应，而不是失去机会。\n尽管如此，纳西说，研究人员公布他们的发现并不是为了让间谍或执法部门受益，而是为了让监视双方都清楚地知道什么是可能的。他表示：我们希望提高人们对这种攻击媒介的认识。我们不是在玩提供工具的游戏。\n虽然不太可能成为这项技术的目标，但它也很容易预防。只需盖上任何悬挂的灯泡，或者更好的做法是，拉上窗帘。如果你疑神疑鬼地担心这类间谍游戏，希望你已经在那些窗户上安装了防震装置，以防止用激光麦克风窃听。并清扫了你的房子寻找窃听器。并从你的手机和电脑上取下了麦克风。毕竟，在一个连灯泡都有耳朵的时代，偏执狂的工作永远不会完成。\n不能出去抗议吗？以下是如何在家中提供帮助的方法。\n👁大脑是人工智能的有用模型吗？另外：获取最新的人工智能新闻。\n🎧事情听起来不太对劲？查看我们最喜欢的无线耳机、音棒和蓝牙扬声器", "note_en": "The list of sophisticated eavesdropping techniques has grown steadily over years: wiretaps, hacked phones, bugs in the wall—even  bouncing lasers off of a building&#39;s glass to pick up conversations inside. Now add another tool for audio spies: Any light bulb in a room that might be visible from a window.\n Researchers from Israeli&#39;s Ben-Gurion University of the Negev and the Weizmann Institute of Science today revealed a new technique for long-distance eavesdropping they call &#34; lamphone.&#34; They say it allows anyone with a laptop and less than a thousand dollars of equipment—just a telescope and a $400 electro-optical sensor—to listen in on any sounds in a room that&#39;s hundreds of feet away in real-time, simply by observing the minuscule vibrations those sounds create on the glass surface of a light bulb inside. By measuring the tiny changes in light output from the bulb that those vibrations cause, the researchers show that a spy can pick up sound clearly enough to discern the contents of conversations or even recognize a piece of music.\n &#34;Any sound in the room can be recovered from the room with no requirement to hack anything and no device in the room,&#34; says Ben Nassi, a security researcher at Ben-Gurion who developed the technique with fellow researchers Yaron Pirutin and Boris Zadov, and who plans to present their findings at the Black Hat security conference in August. &#34;You just need line of sight to a hanging bulb, and this is it.&#34;\n  In their experiments, the researchers placed a series of telescopes around 80 feet away from a target office&#39;s light bulb, and put each telescope&#39;s eyepiece in front of a Thorlabs PDA100A2 electro-optical sensor. They then used an analog-to-digital converter to convert the electrical signals from that sensor to digital information. While they played music and speech recordings in the faraway room, they fed the information picked up by their set-up to a laptop, which analyzed the readings.\n   The researchers found that the tiny vibrations of the light bulb in response to sound—movements that they measured at as little as a few hundred microns—registered as a measurable changes in the light their sensor picked up through each telescope. After processing the signal through software to filter out noise, they were able to reconstruct recordings of the sounds inside the room with remarkable fidelity: They showed, for instance, that they could reproduce an audible snippet of a speech from President Donald Trump well enough for it to be transcribed by Google&#39;s Cloud Speech API. They also generated a recording of the Beatles&#39; &#34;Let It Be&#34; clear enough that the name-that-tune app Shazam could instantly recognize it.\n  The technique nonetheless has some limitations. In their tests, the researchers used a hanging bulb, and it&#39;s not clear if a bulb mounted in a fixed lamp or a ceiling fixture would vibrate enough to derive the same sort of audio signal. The voice and music recordings they used in their demonstrations were also louder than the average human conversation, with speakers turned to their maximum volume. But the team points out that they also used a relatively cheap electro-optical sensor and analog-to-digital converter, and could have upgraded to a more expensive one to pick up quieter conversations. LED bulbs also offer a signal-to-noise ratio that&#39;s about 6.3 times that of an incandescent bulb and 70 times a fluorescent one.\n  Regardless of those caveats, Stanford computer scientist and cryptographer Dan Boneh argues that the researchers&#39; technique still represents a significant and potentially practical new form of what he calls a &#34;side channel&#34; attack—one that takes advantage of unintended leakage of information to steal secrets. &#34;It&#39;s a beautiful application of side channels,&#34; Boneh says. &#34;Even if this requires a hanging bulb and high decibels, it’s still super interesting. And it’s still just the first time this has been shown to be possible. Attacks only get better, and future research will only improve this over time.&#34;\n  The research team, which was advised by BGU&#39;s Yuval Elovici and Adi Shamir, the coinventor of the ubiquitous RSA encryption system, isn&#39;t the first to show that unexpected sonic phenomena can enable eavesdropping. Researchers have known for years that a laser bounced off a target&#39;s window can allow spies to pick up the sounds inside. Another group of researchers showed in 2014 that the  gyroscope of a compromised smartphone can pick up sounds even if the malware can&#39;t access its microphone. The closest previous technique to lamphone is what MIT, Microsoft, and Adobe researchers in 2014 called a  &#34;visual microphone&#34;: By analyzing video recorded via telescope of an object in a room that picks up vibrations—a bag of potato chips or a houseplant, for instance—those researchers were able to reconstruct speech and music.\n  But Nassi points out that the video-based technique, while far more versatile since it doesn&#39;t require a bulb to be visible in the room, requires analysis of the video with software after it&#39;s recorded to convert the subtle vibrations observed in an object into the sounds it picked up. Lamphone, by contrast, enables real-time spying. Since the vibrating object is itself a light source, the electro-optical sensor can pick up vibrations in far simpler visual data.\n That could make lamphone significantly more practical for use in espionage than previous techniques, Nassi argues. &#34;When you actually use it in real time you can respond in real time rather than losing the opportunity,&#34; he says.\n  Still, Nassi says the researchers are publishing their findings not to enable spies or law enforcement, but to make clear to those on both sides of surveillance what&#39;s possible. &#34;We want to raise the awareness of this kind of attack vector,&#34; he says. &#34;We’re not in the game of providing tools.&#34;\n As unlikely as being targeted by this technique is, it&#39;s also easy to forestall. Just cover any hanging bulbs, or better yet, close the curtains. And if you&#39;re paranoid enough to be concerned about this sort of spy game, hopefully you&#39;ve already used  anti-vibration devices on those windows to prevent eavesdropping with a laser microphone. And  swept your house for bugs. And  removed the microphones from your phone and computer. After all, in an era when even the light bulbs have ears, a paranoiac&#39;s work is never done.\n   Can’t go out and protest?  Here’s how to help from home\n    👁 Is the brain a  useful model for AI? Plus:  Get the latest AI news\n 🎧 Things not sounding right? Check out our favorite  wireless headphones,  soundbars, and  Bluetooth speakers", "posttime": "2020-06-13 08:15:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "通过观察,eavesdrop,灯泡", "title": "间谍可以通过观察灯泡的振动来窃听", "title_en": "Spies Can Eavesdrop By Watching a Light Bulb's Vibrations", "transed": 1, "url": "https://www.wired.com/story/lamphone-light-bulb-vibration-spying/", "via": "", "real_tags": ["通过观察", "eavesdrop", "灯泡"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006349, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我正在改进API用户使用SourceHut API进行身份验证的方法。今天，我为了这个目的阅读RFC6749(OAuth2)，这让我想起了最初的OAuth规范。我隐约记得api客户端实际上签署了每个请求，而…。是的，确实是这样。这也让我思考：还有什么签署请求？TLS！\nOAuth非常复杂。RFC有76页长，单独的持有者令牌RFC(6750)又是18页，而且从来没有人读过它们中的任何一个。还可以添加JSON WebToken(RFC7519，30页)。这个过程很复杂，每个人都会自己实现它--这肯定会在安全关键组件中出错。并不是所有的数据都经过身份验证，任何步骤都不涉及密码学，任何一方都很容易以意外状态结束。服务器必须自己处理撤销和生成安全令牌的问题。你见过对OAuth持肯定态度的人吗？\n现在，请坐。喝杯咖啡吧。我想谈谈客户端认证。他们为什么不起飞？让我们草拟一个假设的基于TLS的协议作为OAuth的替代方案。想象一下下面的…。\n您是API客户端开发人员，生成证书颁发机构和中间人，并将您的CA证书上载到服务提供商，作为您注册为用户代理的一部分。\n当您希望用户授权您访问他们的帐户时，您可以为他们生成证书，然后将他们重定向到服务提供商的授权页面，并附带一个CSR。您的证书包括您希望被授予访问权限的授权作用域的列表等。它已经使用您的客户端CA密钥或其中间产品之一进行了签名。\n客户端查看所需的访问权限，并同意。它们与签名证书一起被重定向回您的API客户端应用程序。\nTLS基本上是互联网上单一的最坚固的、经过战斗考验的安全机制，每个平台都有成熟的实现，每个人都实现了OAuth，但往往很差。\n客户端证书是无状态的。它们包含证明客户有权访问所需的所有信息。\n如果您使用nginx、haproxy等处理SSL终止，您甚至可以在应用程序后端看到授权请求之前拒绝它们。\n如果客户端的CA是恶意的或丢失了私钥，服务提供商可以在单个吊销中取消信任。\nAPI客户端和服务提供商都始终确定该进程是由API客户端故意启动的。不需要像OAuth那样使用奇怪的状态令牌来完成此过程！\n有很多免费的特性：任何您喜欢的元数据、内置的过期、API客户端可以根据自己的判断自组织成中间产品，等等。\n有安全意识的最终用户可以在他们的帐户中切换一个标志，作为同意过程的一部分，在签名的证书返回给API客户端之前，要求他们自己签署API客户端的证书。因此，授权给该用户帐户的任何API请求都必须由API客户端、服务提供商和用户签名才能有效。\n这里还有另一个示例：假设您的组织有几个服务，每个服务都代表其用户与Acme Co的API的子集交互。您的组织生成单个根CA，并使用它注册Acme Co的API，然后向您的每个服务颁发中间CA，这些服务只被允许为它们需要的范围子集颁发CSR。如果任何服务被破坏，它不能用于获得比它已经拥有的更多的访问权限，并且您可以只撤销一个中间服务，而不会影响其余的服务。\n甚至一些著名的缺点，如CRLS和OCSP，也在这里得到缓解，因为系统更加集中。您可以控制所有要验证证书的端点，只要它们一进来，您就可以直接将撤销分发给它们。\n好处显然不胜枚举。让我们把它包装成一个可爱的、支持Google的名称，为它编写一些不错的工具库和帮助库，然后发布它！\n或者，也许不是。我有一种喋喋不休的感觉，觉得我漏掉了什么。几十年来，每个人都把这样一个显而易见的解决方案留在桌面上，这似乎是不对的。也许这只是整个证书签名舞蹈在每个人的嘴里留下了一个不好的味道-我们中的许多人都没有那么愉快的记忆，那就是使用可怕的OpenSSL CLI来生成ACSR。但是，如果我们有动力的话，我们没有理由不能做得更好，更精简。\n还有更多客户端证书的用例，这些用例看起来并不那么引人注目，比如用户密码的替代方案。Web浏览器对强制端证书的支持非常糟糕，但这是一个可以解决的问题。\n郑重声明，我无意对SourceHutAPI使用此方法。我只是突然想到了这个想法，我想听听你的想法。为什么我们不使用客户端证书？\n对我的一篇帖子有什么评论吗？通过发送电子邮件至~sircmpwn/public-inbox@lists.sr.ht，在我的公共收件箱中开始讨论。\n您是一名自由软件维护员吗？在您的工作过程中，您是否正在与压力、苛刻的用户、超负荷工作或任何其他社会问题作斗争？请给我发电子邮件-我知道你的感受，我可以倾听你的同情心，分享一些经验丰富的建议。", "note_en": "I’m working on improving the means by which API users authenticate with theSourceHut API. Today, I was reading  RFC 6749 (OAuth2) for this purpose,and it got me thinking about the original OAuth spec. I recalled vaguely that ithad the API clients actually  sign every request, and…  yep, indeed itdoes. This also got me thinking: what else signs requests? TLS!\n OAuth is very complicated. The RFC is 76 pages long, the separate bearer tokenRFC (6750) is another 18, and no one has ever read either of them. Add JSON WebTokens (RFC 7519, 30 pages), too. The process is complicated and everyoneimplements it themselves — a sure way to make mistakes in asecurity-critical component. Not all of the data is authenticated, nocryptography is involved at any step, and it’s easy for either party to end upin an unexpected state. The server has to deal with problems of revocation andgenerating a secure token itself. Have you ever met anyone who feels positivelyabout OAuth?\n Now, take a seat. Have a cup of coffee. I want to talk about client-sidecertificates. Why didn’t they take off? Let’s sketch up a hypothetical TLS-basedprotocol as an alternative to OAuth. Picture the following…\n You, an API client developer, generate a certificate authority andintermediate, and you upload your CA certificate to the Service Provider aspart of your registration as a user agent.\n  When you want a user to authorize you to access their account, you generate acertificate for them, and redirect them to the Service Provider’sauthorization page with a  CSRin tow. Your certificate includes, among other things, the list of authorizedscopes for which you want to be granted access. It is already signed withyour client CA key, or one of its intermediates.\n  The client reviews the desired access, and consents. They are redirected backto your API client application, along with the signed certificate.\n  TLS is basically the single most ironclad, battle-tested security mechanism onthe internet, and mature implementations are available for every platform.Everyone implements OAuth themselves, and often poorly.\n  Client-side certificates are stateless. They contain all of the informationnecessary to prove that the client is entitled to access.\n  If you handle SSL termination with nginx, haproxy, etc, you can rejectunauthorized requests before your application backend ever even sees them.\n  The service provider can untrust the client’s CA in a single revocation, ifthey are malicious or lose their private keys.\n  The API client and service provider are both always certain that the processwas deliberately initiated by the API client. No weird state tokens to carrythrough the process like OAuth uses!\n  Lots of free features: any metadata you like, built-in expirations, APIclients can self-organize into intermediates at their discretion, and so on.\n  Security-concious end users can toggle a flag in their account which would, aspart of the consent process, ask them to sign the API client’s certificatethemselves, before the signed certificate is returned to the API client. Thenany API request authorized for that user’s account has to be signed by the APIclient, the service provider,  and the user to be valid.\n Here’s another example: say your organization has several services, each ofwhich interacts with a subset of Acme Co’s API on behalf of their users. Yourorganization generates a single root CA, and signs up for Acme Co’s API with it.Then you issue intermediate CAs to each of your services, which are  onlyallowed to issue CSRs for the subset of scopes they require. If any service iscompromised, it can’t be used to get more access than it already had, and youcan revoke just that one intermediate without affecting the rest.\n Even some famous downsides, such as  CRLs and  OCSP, are mitigated here, because the system is much morecentralized. You control all of the endpoints which will be validatingcertificates, you can just distribute revocations directly to them as soon asthey come in.\n The advantages are clearly numerous. Let’s wrap it up in a cute, Google-ablename, write some nice tooling and helper libraries for it, and ship it!\n Or, maybe not. I have a nagging feeling that I’m missing something here. Itdoesn’t seem right that such an obvious solution would have been left on thetable, by everyone, for decades. Maybe it’s just that the whole certificatesigning dance has left a bad taste in everyone’s mouth — many of us havenot-so-fond memories of futzing around with the awful OpenSSL CLI to generate aCSR. But, there’s no reason why we couldn’t do it better, and more streamlined,if we had the motivation to.\n There are also more use-cases for client-side certificates that seem rathercompelling, such as an alternative to user passwords. Web browser support forclient-side certificates totally sucks, but that is a solvable problem.\n For the record, I have no intention of using this approach for the SourceHutAPI. This thought simply occurred to me, and I want to hear what you think. Whyaren’t we using client-side certificates?\n Have a comment on one of my posts? Start a discussion in my  public inbox by sending an email to   ~sircmpwn/public-inbox@lists.sr.ht\n Are you a free software maintainer who is struggling with stress, demanding users, overwork, or any other social problems in the course of your work? Please  email me — I know how you feel, and I can lend a sympathetic ear and share some veteran advice.", "posttime": "2020-06-13 07:22:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "客户端,client,证书", "title": "我们可以谈谈客户端证书吗？", "title_en": "Can we talk about client-side certificates?", "transed": 1, "url": "https://drewdevault.com/tls/security/oauth/2020/06/12/Can-we-talk-about-client-side-certs.html", "via": "", "real_tags": ["客户端", "client", "证书"]}, {"category": "", "categoryclass": "", "imagename": "76418fdeeb49df0364209970112cd398.jpeg", "infoid": 1006348, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "旧金山(路透社)-Facebook Inc.的一名员工批评首席执行官马克·扎克伯格(Mark Zuckerberg)本月决定不对美国总统唐纳德·特朗普(Donald Trump)的煽动性帖子采取行动，他周五表示，这家社交媒体公司解雇了他。\n布兰登·戴尔(Brandon Dail)的社交媒体个人资料显示，他是西雅图的一名用户界面工程师。他在Twitter上写道，他被解雇是因为公开挑战一名同事对引发Facebook罕见员工抗议的争议保持沉默。\n包括Dail在内的数十名员工放弃了办公桌，在推特上反对扎克伯格处理特朗普帖子的方式。特朗普的帖子中包含了一句带有种族色彩的短语“当抢劫开始，枪击就开始了”，他指的是5月25日在明尼阿波利斯警方拘留期间死亡的黑人乔治·弗洛伊德(George Floyd)被杀后举行的反对种族主义和警察暴行的抗议活动。\n推特在同一篇帖子上贴上了警告标签，称这美化了暴力。Facebook选择原封不动地发布这篇帖子。\n扎克伯格在当周与员工举行的紧张的全体会议上坚持自己的决定。在会议期间，Dail在推特上说，“今天，领导层拒绝与我们站在一起，这一点非常清楚。”\n本周，在Facebook和Twitter都拒绝对特朗普的一篇帖子采取行动后，戴尔再次表达了反对意见。特朗普的一篇帖子含有未经证实的关于马丁·古吉诺(Martin Gugino)的阴谋论。古吉诺是一名75岁的抗议者，在纽约布法罗被警方重伤。\n“特朗普对马丁·古吉诺的攻击是卑鄙的，明显违反了Facebook的反骚扰规定。我们(和Twitter)没有删除它，这再次让人非常失望。“他说。", "note_en": "SAN FRANCISCO (Reuters) - A Facebook Inc employee who criticized Chief Executive Mark Zuckerberg’s decision not to take action against inflammatory posts by U.S. President Donald Trump this month said on Friday that the social media company had fired him.\n Brandon Dail, whose social media profiles describe him as a user interface engineer in Seattle, wrote on Twitter that he was dismissed for publicly challenging a colleague’s silence on the controversy that prompted a rare staff protest at Facebook.\n Dozens of employees, including Dail, abandoned their desks and tweeted objections to Zuckerberg’s handling of Trump’s posts. Trump’s posts included the racially charged phrase “when the looting starts, the shooting starts” in reference to protests against racism and police brutality held after the May 25 killing of George Floyd, a black man who died in police custody in Minneapolis.\n Twitter affixed a warning label to the same post, saying it glorified violence. Facebook opted to leave the post untouched.\n Zuckerberg stood by his decision at a tense all-hands meeting with employees that week. During the meeting, Dail tweeted that it was “crystal clear today that leadership refuses to stand with us.”\n Dail again voiced objections this week after both Facebook and Twitter declined to take action against a Trump post that contained an unsubstantiated conspiracy theory about Martin Gugino, a 75-year-old protester who was critically injured by police in Buffalo, New York.\n “Trump’s attack on Martin Gugino is despicable and a clear violation [of] Facebook’s anti-harassment rules. It’s again extremely disappointing that we (and Twitter) haven’t removed it,” he said.", "posttime": "2020-06-13 07:05:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,特朗普,fires", "title": "Facebook解雇了一名抗议其在特朗普推文上不作为的员工", "title_en": "Facebook fires employee who protested its inaction on Trump tweets", "transed": 1, "url": "https://www.reuters.com/article/us-facebook-protests-firing/facebook-fires-employee-who-protested-its-inaction-on-trump-tweets-idUSKBN23J35Y", "via": "", "real_tags": ["facebook", "特朗普", "fires"]}, {"category": "", "categoryclass": "", "imagename": "944ac8cc1677e71c54711d07d5e01649.jpg", "infoid": 1006347, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周早些时候，Windows10收到了每月一批的安全补丁，最新的累积更新导致打印机出现严重问题-特别是理光设备，但也有其他型号。\n本周早些时候发布的所谓“补丁星期二”修复程序造成了混乱，它们是KB4557957和KB4560960，分别用于2020年5月的更新和2019年11月的更新。(请注意，在一种情况下，还提到了2018年10月更新的KB4561608)。\n正如Windows最新报道的那样，根据Reddit和包括微软自己的Answers.com支持网站在内的各种其他在线论坛的报道，这些累积的更新对一些打印机来说是很麻烦的。\n正如理光的一位所有者在Reddit上评论的那样：“今天有没有人对打印和最新的Windows更新有问题[KB4560960]？我们看到以前稳定的理光打印机出现了问题。更改打印驱动程序似乎有帮助，但如果我必须将其推出给太多客户，这将是一项痛苦的工作。“。\n其他使用理光打印机的人也有类似的问题，比如完全破坏打印机功能，或其中的一些因素，例如导致无线打印失败。\n关于打印机故障的进一步报道包括Brother和佳能设备，以及一些京瓷、惠普、东芝和松下型号。理光主要经销店的一名网络技术人员也参与了Reddit的讨论，他指出：“在过去两天的大量服务电话之后，我可以自信地说，PCL5[驱动程序]根本不起作用，不管驱动程序的年龄如何。\n“安装最新版本的PCL6通用驱动程序*似乎*确实有效。服务数百个客户端不是一个现实的方法，但至少在新补丁之前设置新客户端应该是可以的。“。\n除了更改打印机驱动程序之外，唯一的解决办法是显而易见的--只需卸载累积更新，同样明显的缺点是，您不会从其中的安全补丁中受益。\n更好的消息是，正如前面提到的网络技术人员Groka-NT在Reddit上发现的那样，根据一位独立社区顾问在Answers.com上的回应，微软已经在进行修复工作：“我感谢您花时间报告这个错误，这是社区的巨大帮助，他们也经历了同样的错误。微软工程师已经意识到了这个问题，并正在研究将在下一次更新中部署的补丁程序。“。\n现在您已经知道了，这些打印机问题应该在下一次更新时得到修复；不管怎么说，祈祷吧。同时，如果您的设备遇到问题，并且您希望避免任何问题，您将不得不在没有最新安全补丁的情况下生活-要么这样，要么切换您的打印机驱动程序。\n据报道，其他小精灵被归因于微软在Answers.com上的最新补丁，包括在一个案例中明显丢失的文件，或者在另一个案例中微型HDMI端口停止运行(以及Office 365的有效订阅，称Office套件是即将结束的试用版本)。不过，这些都是比较零散的轶事报道。", "note_en": "Windows 10 received its monthly host of security patches earlier this week, and the latest cumulative updates are causing serious problems with  printers – particularly Ricoh devices, but also other models.\n The so-called ‘Patch Tuesday’ fixes released earlier in the week which are causing chaos are KB4557957 and KB4560960, which are for the  May 2020 Update and the November 2019 Update. (Note that in one case, KB4561608, for the October 2018 Update, is also mentioned).\n    As  Windows Latest reports, these cumulative updates are proving troublesome for some printers going by reports on Reddit, and various other online forums including Microsoft’s own  Answers.com support site.\n As one Ricoh owner observed on  Reddit: “Has anyone had issues today with printing and the latest Windows update [KB4560960]? We’re seeing problems with Ricoh printers that were previously stable. Changing the print driver seems to help but that’s going to be a pain if I have to roll it out to too many clients.”\n Other folks with Ricoh printers have chimed in on that thread with similar issues in terms of breaking printer functionality completely, or elements of it, such as causing wireless printing to fail.\n Further reports of printer failures include Brother and Canon devices, as well as some Kyocera, HP, Toshiba and Panasonic models. A network technician for a mainly Ricoh dealership also contributed to that Reddit thread, and noted: “After an abundance of service calls these last 2 days, I can confidently say PCL5 [driver] does not work at all, regardless of driver age.\n “Installing the newest version of the PCL6 universal driver *does* seem to work. Not a realistic approach to servicing hundreds of clients, but at least new clients setup before the new patch should be okay.”\n  Aside from changing the printer driver, the only other cure is the obvious one – simply uninstall the cumulative update, with the equally obvious downside that you won’t benefit from the security patches therein.\n The better news is that as spotted by the aforementioned network technician, Groka-NT on Reddit, Microsoft is already working on a fix according to a response given on  Answers.com by an independent community advisor: “I appreciate your time reporting this bug, this is a great help from the community who [are] also experiencing the same bug. Microsoft engineers [are] already aware of this issue and working [on] a patch to be deployed in the next update.”\n So there you have it, these printer bugbears should be fixed with the next update; fingers crossed at any rate. Meanwhile, you’ll have to live without the latest security patches – either that, or switch your printer driver – if you’re encountering trouble with your device, and you want to avoid any issues.\n Other gremlins have reportedly been attributed to Microsoft’s latest patches on Answers.com, including files apparently going missing in one case, or a micro-HDMI port stopping functioning in another (and a working subscription to Office 365 saying that the office suite is a trial version about to end). These are more scattered anecdotal reports, though.", "posttime": "2020-06-13 06:49:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "打印,windows,windows-10,windows10,最新更新", "title": "Windows10的最新更新对打印机造成了严重破坏", "title_en": "Windows 10's Latest Updates Are Causing Havoc On Printers", "transed": 1, "url": "https://www.techradar.com/in/news/windows-10s-latest-updates-are-causing-havoc-with-printers", "via": "", "real_tags": ["打印", "windows", "windows10", "最新更新"]}, {"category": "", "categoryclass": "", "imagename": "66d49d213e9c6e2cc832e890d0dad843.png", "infoid": 1006346, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "濒临倒闭的汽车租赁公司赫兹(Hertz)最新推出的“万岁玛丽”(Hail Mary)可能是该公司迄今最卑鄙的一次：利用罗宾汉交易员新发现的人气，出售价值10亿美元的潜在一文不值的股票。\n美国第二大汽车租赁公司赫兹(Hertz)于5月22日申请破产保护，理由是全球租车需求崩溃。\n无论出于何种原因，这引发了一轮市场反弹，诡异地让人想起2017年加密货币和区块链繁荣时期最黑暗的日子。5月26日，赫兹的股票价值仅为0.56亿美元-到周一，它已经翻了9倍多，达到5.54美元。\n据“华尔街日报”(The Wall Street Journal)报道，赫兹律师周四表示：“赫兹普通股最近的市场价格和交易量可能提供了一个独特的机会。”\n对于赫兹来说，这个想法是在申请破产后出售2.468亿股票，而不是接受相对昂贵的贷款。据报道，这项罕见的计划目前陷入了悬而未决的境地，等待法官的批准。\n多家媒体报道将赫兹抽水股票与罗宾汉交易员联系起来，罗宾汉交易员现在以短期投机性交易而臭名昭著。\n事实上，像赫兹这样的“破产股票”实际上在罗宾汉的用户群中非常流行，尽管投资于已经申请破产保护的公司存在风险。\n在赫兹宣布破产之前的几天里，略高于4万名罗宾汉用户持有赫兹的股票。今天，这个数字超过了15.9万。\n罗宾汉交易员持有其他最近破产的公司JCPenney、怀廷石油(Whiting Petroleum)和切萨皮克能源(Chesapeake Energy)的股票的数量也随着股价飙升，在申请破产后不久，股价上涨了数百倍。\n即使是倒闭的健身房老鼠品牌GNC，今年第一季度也公布了价值2亿美元的亏损，仅在过去的几个月里就找到了数万名新的“投资者”，尽管它背负着难以逾越的债务。\n虽然纽约证券交易所(New York Stock Exchange)已经采取行动将赫兹摘牌，以更好地保护投资者，但罗宾汉仍在继续支持该公司股票的交易。\n虽然渴求金钱的日间交易者的投机本质并不完全是一个启示，但赫兹希望吸引他们贪婪的方式肯定是严峻的。\n“赫兹看了看市场，发现有一群非理性的交易员在买入股票，对此的反应是寻求向这些人出售股票，希望筹集一些资金为他们的重组提供资金，”加州大学法学教授Jared Ellias告诉记者.。\n最令人不安的是，赫兹在申请破产前向340名公司高管发放了1600多万美元，以防止他们在重组期间跳槽。\n令人不安的是，赫兹在发放奖金前的一个月里解雇了近一半的员工-超过1万人。更糟糕的是，据报道，赫兹的10名不同高管在最近的价格上涨中出售了价值数十万美元的公司股票，其中一些人很可能最终成为了罗宾汉的用户。\n但是，无论你是罗宾汉时期的交易员，押注于赫兹这样的破产公司，还是仅仅是一个感兴趣的人在一旁观望，你都应该感到幸运，因为你不是直到最近还是该公司最大股东的亿万富翁卡尔·伊坎(Carl Icahn)。\n面对完全亏损，伊坎在该公司股价飙升至5美元以上之前，以仅74美分的平均价格出售了他们在该公司39%的股份(约5500万股)。\n事实上，据报道，伊坎不仅在他长达六年的赫兹投资中亏损了16亿美元，而且最终错过了今年最疯狂的股市之一-无论这可能有多不理性。", "note_en": "Failing rental car company Hertz‘s latest Hail Mary might be its most dastardly yet: Exploit newly-found popularity among Robinhood traders to sell $1 billion worth of potentially worthless stock.\n Hertz, the second-largest car rental firm in the US, filed for  Chapter 11 bankruptcy on May 22 citing a global collapse in demand for hire cars.\n For whatever reason, this sparked a market rally eerily reminiscent of the darkest days of 2017’s cryptocurrency and blockchain boom. On May 26, Hertz stock was worth just $0.56  — by Monday it had multiplied by more than 9-times over to reach $5.54.\n “The recent market prices of and the trading volumes in Hertz’s common stock potentially present a unique opportunity,” said Hertz lawyers on Thursday, according to  the Wall Street Journal.\n For Hertz, the idea is to sell 246.8 million shares over accepting the relatively expensive loans available to it after filing for bankruptcy. The plan, reportedly rarely seen, is currently stuck in limbo pending a judge’s approval.\n   Multiple media reports have  linked Hertz pumping stock to Robinhood traders, a group  now notorious for short-term, speculative trading.\n In fact, ‘bankrupt stocks‘ like Hertz are  actually all the rage with Robinhood’s user-base despite the  risks associated with investing in companies that’ve filed Chapter 11s.\n A little over 40,000 Robinhood users held Hertz shares in the days leading into its bankruptcy filing announcement. Today, that number exceeds 159,000.\n  The amount of Robinhood traders holding stocks in other recently-bankrupt companies JCPenney, Whiting Petroleum, Chesapeake Energy also soared alongside their share prices, which multiplied by hundreds of percent shortly after filing for bankruptcy.\n   Even failed gym-rat brand GNC, which posted $200 million worth of losses in the first quarter of this year, found tens of thousands of new “investors” in the past few months alone, despite  its insurmountable debt.\n While the New York Stock Exchange  has already moved to delist Hertz to better protect investors, Robinhood continues to support trade for the company’s shares.\n  While the speculative nature of money-hungry day traders isn’t exactly a revelation, the way Hertz is looking to appeal to their greed is definitely grim.\n “Hertz looks at the market and sees there is a group of irrational traders who are buying the stock, and the response to that is to seek to sell stock to these people in hopes of raising some amounts of money to fund their restructuring,” University of California law professor  Jared Ellias told reporters.\n What’s most unsettling is that Hertz  dished out more than $16 million to 340 company execs just before its bankruptcy filing in an attempt to keep them from jumping ship while it restructures.\n  Uncomfortably, Hertz fired nearly half of its workforce  —  more than 10,000 people  — in the month leading up to those bonuses. To make matters worse, 10 different Hertz execs  reportedly sold hundreds of thousands of dollars worth of company stock during its recent price rallies, and some were likely to have ended up with Robinhood users.\n But whether you’re a Robinhood trader gambling on bankrupt firms like Hertz or just an interested party watching from the sidelines, consider yourself lucky that you’re  not billionaire Carl Icahn, the company‘s largest shareholder until recently.\n Facing complete loss, Icahn sold their entire 39% stake in the company (some 55 million shares) for an average price of just 74 cents  just before its stock price skyrocketed beyond $5.\n Indeed, not only did Icahn reportedly lose $1.6 billion on his six-year Hertz investment, he ultimately missed one of the wildest stock market pumps of the year  — however irrational it may have been.", "posttime": "2020-06-13 06:47:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "交易,密谋,plot,赫兹", "title": "破产的赫兹瞄准罗宾汉交易员密谋抛售10亿美元股票", "title_en": "Bankrupt Hertz targets Robinhood traders in plot to dump $1B in stock", "transed": 1, "url": "https://whatsnew2day.com/bankrupt-hertz-targets-robinhood-traders-in-plot-to-dump-1-billion-in-stock/", "via": "", "real_tags": ["交易", "密谋", "plot", "赫兹"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006345, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每年我都会填写苹果公司为苹果开发人员做的这份调查。每年都没有什么变化。不要在App Store搜索结果中为竞争对手投放广告。根本不要投放付费广告！他们就是不应该存在。现在，如果客户按确切的名称搜索我的iOS应用程序，首先出现的结果是一个为广告付费的竞争对手(大致在同一空间)。这很疯狂，因为我的iOS应用程序是MacOS应用程序的免费插件，所以竞争对手的产品不会帮助客户。您正在给您的客户带来巨大的伤害，并且您正在让开发人员相互竞争。我们已经向App Store支付了近1%的利润，作为回报，我们还必须购买广告，才能让我们的应用程序出现在搜索结果的顶部，这是荒谬的。去掉广告。\n允许我们象征性地对我们的应用程序进行重大升级收取费用。现在，新的版本要么必须被制作成全新的应用程序，*要么*我们必须免费提供所有的新版本。没有办法免费收取升级费用。如果我从苹果公司买了一台Mac或iPhone，我可以在升级时把它换成新的，但用户不能对软件做同样的事情。我认识的所有开发者现在都很痛苦，因为苹果阻止我们提供特殊的升级价格。要求开发者继续支持他们的应用程序，同时又禁止他们对升级收费，这是完全不可持续的。\n苹果目前的系统创造了一个“铲子”取胜的环境-那些快速开发大量有限实用程序、投放丑陋广告、不支持该应用的公司可以赚钱，但花费数年时间编写真正伟大的东西的公司无法生存。只有最成功的应用程序才能继续受支持，App Store上的所有其他应用程序都将永远停留在1.0版中。这伤害了每个人。如果你在App Store上搜索几乎任何类别的应用程序，你都会看到结果-大量的山寨应用程序充满了广告或欺诈性订阅，好像有人想要那样。\n不要告诉开发人员订阅是我们前进的方向。虽然大公司的一些应用程序每年都能无故障地更新，但我们中的大多数人做不到。而且，我们中的大多数人都不能强迫客户订阅Adobe或Quicken这样的应用程序--我们没有知名度。我几乎从来没有遇到过这样的人，他们喜欢订阅软件，但一旦停止付费就无法使用它。支付软件租金和支付公寓租金一样有趣。\n把提成从30%降到20%。其他网店已经在这么做了。苹果写出了很棒的软件，但苹果不可能是唯一的创新者。让数以千计的第三方开发者提出伟大的想法是苹果蓬勃发展的方式。现在，优秀的第三方开发者正在消亡。是的，App Store中有10亿个糟糕的应用程序，所以很容易说，“哦，我们有开发人员。”这就是微软多年来告诉自己的，“我们有成堆的(坏的)软件！没问题！“。苹果正在效仿20世纪80年代微软的模式，毒死他们优秀的开发人员，希望纯粹的铲子数量能弥补这一点。\n苹果目前最大的竞争对手是网络。越来越多的“应用程序”只是网站顶部的薄薄的、非原生的单板(参见Zoom、Slake、Steam等)。苹果的问题是，如果所有设备上都有完全相同的应用程序，为什么还会有人选择苹果设备呢？苹果应该尽其所能支持优秀的第三方开发者，让真正的苹果应用程序让苹果设备独一无二，并提供酷的苹果独有体验。但是，再说一次，由于App Store的政策，我认识的所有做这件事的开发人员都在死去。就连欧姆尼集团(Omni Group)也在几个月前进行了裁员。\n多年来，我们都一直在要求这些改变。我以前填过三四份这样的调查。我知道菲尔明确表示，他不想再听到升级定价的消息，但菲尔也在为世界上最富有的公司工作，该公司销售硬件并免费赠送软件。我们这些只卖软件的人是不能把它送人的。", "note_en": "Every year I fill out this survey from Apple, for Apple developers. Every year nothing changes.  Don’t run ads for competitors in App Store search results. Don’t run paid ads at all! They just shouldn’t exist. Right now if a customer searches for my iOS app by exact name, the FIRST result to come up is a competitor (roughly in the same space) who paid for an ad. Which is bonkers because my iOS app is a free add-on to my macOS app, so the competitor’s product wouldn’t hep the customer. You’re doing a huge disservice to your customers, and you’re pitting developers against each other. We already pay almost 1% of our profits to the App Store, it’s ridiculous that in return for that we have to also buy ads just to have our apps appear at the top of searches for them. Get rid of ads.\n Allow us to charge a nominal fee to for major upgrades to our apps. Right now new versions either have to be made into all-new apps, *or* we have to give away all new versions for free. There’s no way to charge an upgrade free. If I buy a Mac or iPhone from Apple I can trade it in towards a new one when I upgrade, but users can’t do the same thing for software. All the developers I know are suffering right now because Apple has prevented us from offering special upgrade pricing. It’s completely unsustainable to ask developers to continue supporting their apps but also to forbid them from charging for upgrades.\n Apple’s current system creates an environment where “shovelware” wins — companies that make tons of limited-utility apps quickly and throw in ugly ads and don’t support the app can make money, but companies that spend years writing something truly great can’t survive. Only the very most successful apps can continue to be supported, everything else on the App Store will be stuck in version 1.0 forever. This hurts everyone. If you do a search on the App Store for almost any category of app you’ll see the results — tons of knock-off apps full of ads or scammy subscriptions, as if anyone wants that.\n Stop telling developers subscriptions are our way forward. While some apps from huge companies can afford to rev every year without fail, most of us can’t. Also, most of us can’t force customers into subscriptions like Adobe or Quicken can — we don’t have the name recognition. I’ve literally never met one person who has enjoyed subscribing to software and losing access to it once they stop paying. Paying rent on software is as fun as paying rent on an apartment.\n Lower the cut you take from 30% to 20%. Other online stores are already doing this. Apple writes great software, but Apple can’t be the only innovator. Having thousands of third-party developers coming up with great ideas is the way Apple thrives. Right now *GOOD* third-party developers are dying out. Yes, there are a billion terrible apps in the App Store, so it’s easy to say, “Oh, we have developers.” That’s what Microsoft told themselves for years, “We have tons of (bad) software! There’s no problem!” Apple is following the 1980s Microsoft model of poisoning off their good developers and hoping the sheer volume of shovelware will make up for it.\n Apple’s biggest competition right now is the web. More and more “apps” are just thin, non-native veneers on top of web sites (cf Zoom, Slack, Steam, etc). The issue for Apple is, why would anyone choose Apple devices if the exact same apps are available on all devices? Apple should be doing everything it can to support good third-party developers that make the real Apple apps that make Apple devices unique, and provide cool Apple-only experiences. But, again, all the developers I know who do this are dying off, because of the App Store’s policies. Even Omni Group had layoffs a couple months ago.\n We have all been asking for years now for these changes. I’ve filled out three or four of these surveys before. I know Phil specifically says he doesn’t want to hear about upgrade pricing any more, but Phil also is working for the world’s richest company, which sells hardware and gives software away. Those of us who only sell software can’t afford to give it away.", "posttime": "2020-06-13 06:47:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,开发,app,apple,开发人员", "title": "Wil Shipley：每年我都会填写苹果公司为苹果开发人员做的这份调查", "title_en": "Wil Shipley: Every year I fill out this survey from Apple, for Apple developers", "transed": 1, "url": "https://medianatives.blogspot.com/2020/06/wil-shipley-every-year-i-fill-out-this.html", "via": "", "real_tags": ["苹果", "开发", "app", "apple", "开发人员"]}]