[{"category": "", "categoryclass": "", "imagename": "6db290e4dc564b3336e28373abedf0fd.jpg", "infoid": 1006743, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "马萨诸塞州博克斯伯勒。-根据联邦检察官周一提出的指控，eBay的六名员工发起了一场网络跟踪活动-包括发送一箱箱活蟑螂和一个血淋淋的猪脸万圣节面具-对付一对经营在线电子商务时事通讯的夫妇。\n马萨诸塞州联邦检察官安德鲁·E·莱林(Andrew E.Lling)在周一的新闻发布会上说，这些员工对时事通讯对eBay的报道感到不满，纷纷向这对夫妇发送恐吓性电子邮件，并发送了令人不安的快递，包括一个葬礼花圈和一本关于如何在配偶去世后幸存下来的书。目前，这些员工都没有在该公司工作。他说，几名员工驱车前往这对夫妇的家中监视他们。\n“他们不仅不高兴，而且很愤怒，”莱林说。他描述了eBay的一名前高管在短信中告诉一名高管，他想“碾压”这对夫妇中的那个女人，他们住在马萨诸塞州波士顿郊区的纳蒂克(Natick)。莱林说，其结果是“在一家财富500强公司资源的推动下，开展了一场系统性的运动，在情感和心理上恐吓纳蒂克的这对中年夫妇，目的是阻止他们在网上写关于eBay的坏话。”\n检察官指控这六人合谋进行网络跟踪和合谋篡改证人。其中，两名前eBay高管--该公司前高级安全与安保总监James Baugh和该公司前全球弹性总监David Harville--周一上午被捕。\n根据起诉书，在此案中受到指控的还有一名前eBay全球安全团队特别行动高级经理，他曾是一名警长。\n在周一的一篇公司帖子中，eBay表示，去年已经解雇了所有相关员工，其中包括该公司的前首席公关官。eBay还表示，一项内部调查已经检查了该公司当时的首席执行官德文·维尼格(Devin Venig)是否在网络跟踪活动中扮演了任何角色。\n声明称，“内部调查发现，虽然韦尼格先生的通讯不恰当，但没有证据表明他事先知道或授权了后来针对博客作者和她丈夫的行动。”该公司补充称：“然而，正如该公司此前宣布的那样，导致他离开eBay的原因是多方面的。”\n在通过电子邮件发送给“纽约时报”的一份声明中，维尼格说：“公司经过彻底、独立的调查后证实，我对在波士顿受到指控的行为一无所知。”我的职业生涯一直在捍卫新闻自由。这些指控是不合情理的。“\n包和哈维尔的代理律师没有立即回复记者的置评请求。\n检察官说，跟踪行动始于2019年夏天，此前时事通讯发表了一篇关于涉及eBay的诉讼的文章。起诉书称，eBay高管密切关注时事通讯的帖子，经常“对内容提出异议”，以及匿名读者评论，贬低eBay高管是“骗子”和“妄想症”。\n作为回应，一位公司高管写信给另一位高管说，这位时事通讯编辑“发表了一篇关于诉讼的热门文章。如果你想扳倒她，…。根据起诉书中包含的短信，现在是时候了。另一位高管回答说：“让我问你这个问题。我们需要关闭她的整个网站吗？“。\n几条信息过后，第一位高管评论道：“她是个有偏见的巨魔，需要被烧死。”\n检察官说，这些信息背后的高管-他们在案件中没有被点名或指控-向其他员工施压，要求他们对时事通讯的编辑做些什么。案件中被指控的人随后开始了一场三管齐下的运动。起诉书称，eBay的几名员工向这对夫妇的家中发送了“不受欢迎和令人不安的快递”，包括一头保存好的胎猪、苍蝇幼虫、活蜘蛛、一个同情的葬礼花圈--以及写给这对夫妇名字的色情物品，但寄给了他们的两个邻居。\n起诉书称，这些员工还在Twitter上发出了一系列越来越咄咄逼人的直接信息，询问时事通讯编辑她对eBay有什么问题。法庭文件说，他们随后发出了威胁信息，最终公布了这对夫妇的家庭地址。\n起诉书称，为了在家里偷偷监视这对夫妇，两名员工还登记参加了8月份在波士顿举行的一次软件会议，为了避免被警方拦截，他们去了这对夫妇的家，他们拿着虚假的文件，声称他们正在调查出版商威胁eBay高管的行为。\n然而，这对夫妇发现eBay的员工在监视他们的房子，于是报了警，警察联系了eBay寻求帮助。\n检察官说，随着警方和eBay开始调查，参与网络跟踪活动的员工对警方和eBay的律师撒谎，并删除了他们参与调查的证据，阻碍了联邦调查。", "note_en": "BOXBOROUGH, Mass. — Six eBay employees mounted a cyberstalking campaign — including sending boxes of live cockroaches and a Halloween mask of a bloody pig’s face — against a couple who ran an online e-commerce newsletter, according to charges filed by federal prosecutors on Monday.\n Unhappy with the newsletter’s coverage of eBay, the employees, none of whom now work at the company, barraged the couple with threatening emails and sent disturbing deliveries, including a funeral wreath and a book on how to survive the death of a spouse, said Andrew E. Lelling, the United States attorney for Massachusetts, in a news conference on Monday. Several of the employees drove to the couple’s home to spy on them, he said.\n “They were not merely unhappy, they were enraged,” Mr. Lelling said, describing how one former eBay executive told a fellow executive in a text message that he wanted to “crush” the woman in the couple, who live in Natick, Mass., a Boston suburb. The result, Mr. Lelling said, “was a systematic campaign, fueled by the resources of a Fortune 500 company, to emotionally and psychologically terrorize this middle-aged couple in Natick with the goal of deterring them from writing bad things online about eBay.”\n Prosecutors charged the six people with conspiracy to commit cyberstalking and conspiracy to tamper with witnesses. Among them, two former eBay officers — James Baugh, the company’s former senior director of safety and security, and David Harville, the company’s former director of global resiliency — were arrested on Monday morning.\n Also charged in the case was a former senior manager of special operations for eBay’s global security team, who is a former police captain, according to the complaint.\n In a company post on Monday, eBay said it had fired all the involved employees last year, including the company’s former chief communications officer. EBay also said that an internal investigation had examined whether the company’s chief executive at the time, Devin Wenig, had played any role in the cyberstalking campaign.\n “The internal investigation found that, while Mr. Wenig’s communications were inappropriate, there was no evidence that he knew in advance about or authorized the actions that were later directed toward the blogger and her husband,”  the statement said. It added: “However, as the company previously announced, there were a number of considerations leading to his departure” from eBay.\n In a statement emailed to The New York Times, Mr. Wenig said: “As confirmed by the company following a thorough, independent investigation, I did not direct or know anything about the acts that have been charged in Boston. I have spent my career defending press freedoms. What these charges allege is unconscionable.”\n Lawyers representing Mr. Baugh and Mr. Harville did not immediately respond to requests for comment.\n The stalking campaign began in the summer of 2019 after the newsletter published an article about  a lawsuit involving eBay, prosecutors said. EBay executives followed the newsletter’s posts closely, often “taking issue with the content” as well as anonymous reader comments disparaging eBay executives as “liars” and “delusional,” the complaint said.\n  In response, one company executive wrote to another saying the newsletter editor was “out with a hot piece on the litigation. If you are ever going to take her down … now is the time,” according to text messages included in the complaint. The other executive responded: “Let me ask you this. Do we need to shut her entire site down?”\n A few messages later, the first executive commented: “She is biased troll who needs to get BURNED DOWN.”\n Prosecutors said the executives behind those messages — who were not named or charged in the case — pressured other employees to do something about the newsletter’s editor. The people charged in the case then began a three-pronged campaign. Several eBay employees sent “unwanted and disturbing deliveries” to the couple’s home, the complaint said, including a preserved fetal pig, fly larvae, live spiders, a sympathy funeral wreath — and pornography that was addressed to the couple by name, but sent to two of their neighbors.\n The employees also sent a series of increasingly aggressive direct messages on Twitter, asking the newsletter editor what her problem was with eBay, the complaint said. The court filing said they followed up with threatening messages, culminating with publishing the couple’s home address.\n As an excuse to covertly surveil the couple in the home, the complaint said, two employees also registered for a software conference in Boston in August, and, lest they were stopped by the police, went to the couple’s house carrying false documents purporting to show that they were investigating the publishers for threatening eBay executives.\n The couple spotted the eBay employees spying on their house, however, and called the police, who contacted eBay for assistance.\n As the police and eBay began to investigate, employees involved in the cyberstalking campaign lied to the police, as well as to eBay’s lawyers, and deleted evidence of their involvement, prosecutors said, obstructing the federal investigation.", "posttime": "2020-06-16 07:25:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "工作人员,workers,ebay", "title": "eBay工作人员跟踪，威胁批评时事通讯的作者", "title_en": "eBay workers stalked, threatened authors of critical newsletter", "transed": 1, "url": "https://www.nytimes.com/2020/06/15/technology/ebay-cyberstalking-with-cockroaches-and-bloody-pig-face.html", "via": "", "real_tags": ["工作人员", "workers", "ebay"]}, {"category": "", "categoryclass": "", "imagename": "80986531c0e0a5a31c17526e7c474c96.jpeg", "infoid": 1006741, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "餐厅评论披露了令人苦恼的家庭动态。脸书上的帖子重提了一次尴尬的遭遇。这条推文揭示了一种鲜为人知的恐惧症。\n在我们的智能手机上，我们很快就能向不知名的陌生人透露私人情感和高度个人化的经历。", "note_en": "The restaurant review that divulges distressing family dynamics. The Facebook post that rehashes an embarrassing encounter. The tweet that reveals a phobia few people know about.\n  On our smartphones, we are quick to reveal private emotions and highly personal experiences to faceless strangers.", "posttime": "2020-06-16 06:51:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "手机,人们,honest,评论", "title": "为什么人们在智能手机上写字时更诚实", "title_en": "Why People Are More Honest When Writing on Their Smartphones", "transed": 1, "url": "https://www.wsj.com/articles/why-people-are-more-honest-when-writing-on-their-smartphones-11591999279", "via": "", "real_tags": ["手机", "人们", "honest", "评论"]}, {"category": "", "categoryclass": "", "imagename": "2653f8a35dab24130d9f1602cf84b6a0.png", "infoid": 1006740, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇文章总结了我对处理复制和粘贴问题的研究：浏览器、流行的所见即所得编辑器和网站。其主要目标是提高人们对以下情况可能使用户面临攻击的认识：\n在接下来的几节中，我将解释如何识别和利用这些问题。\n我不是第一个承保与复制和粘贴相关的安全风险的人。2015年，伟大的马里奥·海德里奇(Mario Heiderich)就这个话题做了一场名为“复制与害虫”(Copy&amp；Pest)的演讲。Mario专注于从非浏览器应用程序(如LibreOffice或MS Word)复制数据和在浏览器中粘贴数据，并展示了这可能导致XSS。\nXSS不是处理剪贴板数据的唯一问题；渗出是另一个风险，\n即使浏览器不会出现此类错误，JavaScript WYSIWYG编辑器仍可能引入安全问题。\n最后，我认为包括在两个浏览器选项卡之间复制和粘贴的攻击方案比从外部应用程序复制并粘贴到浏览器中更有可能被利用。\n在这篇文章中，我将解释浏览器中的4个安全问题和富编辑器中的5个漏洞，我总共获得了超过3万美元的赏金。\n复制和粘贴是在两个应用程序之间共享数据的最常见的用户交互之一。剪贴板可以包含各种类型的数据，例如：\n在本文中，我将重点介绍格式化文本，因为它等同于浏览器世界中的HTML标记。这意味着如果您复制以下文本：“hello here”，则剪贴板将包含HTML内容：Hello&lt；b&gt；here&lt；/b。\n有趣的是，浏览器公开了允许您从JavaScript代码设置任意剪贴板内容的API。考虑以下示例：\n为了确保阻止浏览器复制的标准行为，并且剪贴板只用clipboardData.setData的第二个参数填充，需要调用event.prevenentDefault()。\n这里明显的攻击载体是将XSS有效负载放到剪贴板中的能力：\n浏览器供应商完全了解此攻击场景。作为一种预防方法，他们在粘贴时引入了内容清理；即删除被认为有害的元素和属性。\n我已经创建了一个名为“Copy&amp；Paste Playround”的简单网站，以简化在浏览器中查找清理错误的过程。\n在左侧，您可以输入HTML标记，并查看浏览器生成的DOM树。然后，单击“复制为HTML”后，您输入的确切HTML将复制到剪贴板。\n另一方面，右侧包含一个丰富的编辑器(或所见即所得编辑器)，您可以在其中从剪贴板粘贴。编辑器的内容还显示了DOM树，这样就可以很容易地与左侧进行比较，找出浏览器是如何清理HTML的。\n在图1的示例中：首先，我在HTML输入字段中输入了以下XSS有效负载：&lt；img src=1onerror=alert(1)&gt；；其次，我单击“copy as HTML”；最后，我将其粘贴到粘贴目标中。通过DOM树的视图，可以很容易地看到浏览器在粘贴之后去掉了onerror属性。您还可以使用“复制和粘贴操场”通过复制和粘贴外部页面来测试XSS问题；首先从操场复制任意HTML，然后将其粘贴到外部页面(甚至外部应用程序)。\n考虑到浏览器在决定是否应该清理任何HTML元素或属性之后必须采用一些逻辑，我决定看一看它们，并尝试找到旁路。结果，我发现在所有主流浏览器中至少有一个绕过了杀菌器：Chrome、Firefox、Safari和经典的Edge。\n在本节中，我将详细描述我确定的一些剪贴板消毒器问题。\n我发现的第一个bug是一个通用的xss，修复于Chromium 79(crbug.com/1011950)。在粘贴带有&lt；div&gt；元素的HTML代码时，我注意到一个有趣的特性。粘贴后创建的DOM树取决于粘贴发生的确切位置。考虑一下简单的HTML代码片段：\n这是意料之中的，因为生成的HTML与复制到剪贴板的HTML相同。但是，如果将代码段粘贴到1234的中间，则会呈现不同的HTML：\n这种行为似乎不同寻常：粘贴的内容中完全省略了&lt；div&gt；元素，而在&lt；div&gt；通常应该结束的位置，出现了&lt；br&gt；标记。对于任何具有CSS RULE：DISPLAY：BLOCK的HTML元素，都会观察到相同的行为。这看起来真的很有希望，因为我们看到的是一种突变。如果说浏览器的历史告诉我们什么的话，那就是突变往往会导致漏洞。\n经过一些调查，&lt；数学&gt；元素被证明是有用的。它通常可以方便地绕过各种杀毒程序，因为它引入了所谓的“外来内容”，并且当它是&lt；ath&gt；元素的后代时，某些标记的解析方式与HTML的任何其他部分都不同。\n让我们来看一个简单的例子。在&lt；style&gt；元素的HTML分析中，不能生成除文本节点以外的任何子元素。例如，以下标记：\n结论是&lt；style&gt；中的内容被视为文本。但是，如果&lt；style&gt；元素成为&lt；数学&gt；元素的后代，则解析会发生巨大变化。以下代码。\n在这种情况下，&lt；style&gt；元素可以具有子元素。在某些情况下，这种差异可能会导致跨站点脚本(例如绕过我的DOMPurify)。\nDOM树看起来很安全：&lt；img&gt；元素在title属性中，因此不会呈现它。尽管如此，在删除&lt；ath&gt；元素之后，解析HTML代码会产生一个不同的DOM树：\nXSS有效负载作为&lt；/style&gt；结束标记(最初放在title属性中)执行，现在关闭&lt；style&gt；元素，因为没有引入外来内容。\n回到Copy&amp；Paste，我想知道当剪贴板内容包含一个&lt；Math&gt；元素(该元素包含style=display：block的子元素)时，会发生什么情况，因为我知道后者会导致粘贴时发生变化。我创建了以下代码片段：\n(附注：所有元素都有一个文本节点，因为如果没有文本，Chromium往往会在粘贴后完全省略HTML元素)。\n然后，我将其粘贴到一个富编辑器的中间，该编辑器只包含一个内容为：&#34；1234&#34；的文本节点。粘贴后的DOM树为：\n请注意，&#34；test&34；字符串最初位于&lt；XSS&&gt;元素内(扩展为&lt；MATH&&gt;元素)，在突变后放在&lt；MATH&&gt;；之外。\n在将其粘贴到富编辑器的中间之后，它创建了以下DOM树：\n突变后，&lt；img&gt；元素从title属性中“逃脱”并被放入DOM树中，而不进行任何清理。为了证明Chromium安全团队利用该漏洞有效，我向他们提供了以下视频，显示我可以在Gmail、维基百科和博客上触发XSS。\n当我向Chromium报告通用XSS时，我附带提到了滥用剪贴板的另一种方式是注入&lt；style&gt；元素以泄露页面数据(例如：CSRF令牌或用户的个人信息)。对原始问题的修复并不能解决这个问题，因此谷歌员工创建了另一个问题(crbug/1017871)来确定注入css是否存在安全风险。\n滥用样式表从网站泄露数据并不是什么新鲜事。例如，2018年Pepe Vila展示了一个单一的注射点就足以从CSS泄露数据，同样的技巧后来在2019年被d0ut重新发现。今年年初，我还写了一篇关于通过单一注入点在Firefox中渗出CSS数据的文章(尽管文章标题明确提到了Firefox，但同样的代码也适用于Chromium)。\n因此，我的工作是说服Chromium安全人员，通过复制和粘贴注入样式确实有安全隐患。我用下面的视频证明了Gmail中当前登录用户的电子邮件地址是可以泄露的。\n如果您希望弄清利用漏洞的确切工作原理，请参阅有关通过单个注入点的数据外泄的文章。对于这个漏洞，谷歌决定悬赏1万美元。\n我向Chromium报告了另外两个复制和粘贴错误(crbug/1040755和crbug/1065761)，一个是Safari，另一个是经典的Edge。然而，所有这些错误都非常相似，考虑到并不是所有的错误都得到了修复或解除限制，我决定暂时不透露它们。\n然而，我完全可以透露另外两个bug，它们发生在Firefox中：CVE-2019-17016和CVE-2019-17022。这两个版本都在2020年1月7日发布的Firefox72中得到了修复。\nFirefox允许从剪贴板粘贴样式表。例如，如果我们复制以下HTML：\n然后，在粘贴时，Firefox不会更改它；也就是说，背景立即变为黄色。请务必注意，粘贴的内容中不允许使用某些CSS规则，因此会将其删除。@import就是一个例子，它对于任何实际的CSS泄漏攻击都是必需的。\n我们再一次处理突变，但这一次是样式表突变。Firefox CSS Saniizer检查样式表是否包含任何需要清理的规则。如果是，则删除有问题的规则并重写整个样式表。否则，样式表将被逐字粘贴。这创建了一个新的攻击面，因为重写样式表可能会引入新的、意想不到的规则。\n我注意到Firefox错误地处理了相当模糊的CSS特性，即@Namespace at-Rule。根据MDN的说法：“@NAMESPACE规则通常只在处理包含多个名称空间的文档时才有用--比如具有内联SVG或MathML的HTML5，或者混合了多个词汇表的XML”。\n从剪贴板复制并粘贴后，它被变形为以下形式：\n因为单引号被双引号取代，所以很自然地会检查当您将双引号放入URL中时会发生什么。\nFirefox错误地重写了这个样式表，并且没有正确地转义双引号字符：\n这使得在样式表中包含任意规则成为可能。证明我可以在样式表中包含我自己的@import规则的最终有效负载如下：\n乍一看，@import似乎会被忽略，因为它不是样式表中的第一个规则(CSS规范要求)，但它会被处理，因为@NAMESPACE规则无效(因为多余的x)并且被解析器忽略。\n为了向Mozilla证明利用漏洞确实有效，我创建了一个视频，该视频泄漏了一个示例页面中的CSRF令牌。请参考关于通过Firefox中的单个注入点使用CSS窃取数据的文章，了解利用漏洞的确切情况。\n此外，我向火狐报告了另一个问题，跟踪为cve-2019-17022，它向火狐引入了一个突变的xss。\n这个问题的根本原因与上一个问题完全相同，但这一次被利用的方式有所不同。\n请注意&lt；\\/style&gt；如何转换为&lt；/style&gt；。这本身不会引入安全问题，因为样式表的文本节点是直接修改的，因此内部的&lt；/style&gt；不会结束标记。但是，如果该网站执行类似以下操作：\n那么它就容易受到XSS的攻击，因为&lt；img&gt；元素会离开&lt；style&gt；元素。我假设某些所见即所得编辑器可能会这样做，因为本质上将一个元素的innerHTML分配给另一个元素应该是无害的。此外，某些所见即所得编辑器允许浏览器处理剪贴板内容，然后在对其进行预清理后对其执行一些转换。\n我查看了名为awawed-wysiwyg的gihub repo，看看Firefox的行为是否让任何编辑器容易受到攻击。搜索时间并不长，因为自上而下的第一个编辑：Aloha Editor碰巧易受攻击。粘贴上述有效负载后，XSS立即触发。\n粘贴时，剪贴板内容将粘贴到元素中，然后通过删除某些元素的handleContent函数进行处理：\nhandleContent：function(Content){var$content；if(typeof content=&#39；string&#39；){$content=$(&#39；&lt；div&gt；&#39；+content+&#39；&lt；/div&gt；&#39；)；}false if(content instanceof$){$content=$(&#39；&lt；div&gt；&#39；).append。}return$content.html()；}。\n当内容变量(包含浏览器预先清理的HTML)用作jQuery$函数中的参数时，会触发突变XSS。此时，内容包含：\nAloha Editor并不是唯一可能触发突变XSS的编辑器。我把它作为一种练习留给读者去寻找其他人。\n现在，让我们假设我们生活在一个完美的世界中，在这个世界中，浏览器修复了所有的消毒器绕过，并且不再存在。这是否意味着当我们从不受信任的网站粘贴数据时，我们是安全的？简短的答案是：不。\nJavaScript代码可以完全忽略浏览器的清理过程，并手动处理它。这种方法需要监听Paste事件，例如：\naddEventListener(&#39；粘贴&#39；，Event=&gt；{Event.PrevenentDefault()；const html=event.clipboardData.getData(&#39；text/html&#39；)；//处理HTML.。//.。例如，某些Element.innerHTML=html；//😱})；\n在代码片段中，剪贴板内容被分配给html变量，而html变量又被分配给元素的innerHTML，从而导致XSS。\n基本上每个流行的WYSIWYG编辑器都会自己处理Paste事件。这样做有几个原因：\n在接下来的几节中，我将介绍几个网站和流行的所见即所得编辑器错误处理剪贴板内容的真实示例。\nTinyMCE自称是“最先进的所见即所得HTML编辑器”，根据我的经验，它确实是最受欢迎的编辑器之一(如果不是最受欢迎的)。\n在粘贴时，TinyMCE通过解析HTML、应用一些转换，然后将其序列化为HTML来处理内容。TinyMCE不使用JavaScript中提供的任何HTML解析器(如DOMParser)，但采用了自己的解决方案。\n作为TinyMCE清理的示例，请考虑从剪贴板粘贴以下HTML代码段：\n然后，它决定&lt；b&gt；元素应该替换为&lt；strong&gt；，并且注释应该保持不变。然后将DOM树序列化为：\n到目前一切尚好。TinyMCE的解析器的问题在于它无法识别HTML5中--！&gt；是有效的注释结尾。因此，以下HTML：\n由于编辑器假设树是无害的，因此将其序列化为相同的形式：\n并将其分配给outterHTML。赋值之后，轮到浏览器解析HTML，并且它的操作方式有所不同：\n我向TinyMCE报告了这个漏洞(以及其他几个漏洞)，他们发布了两个安全建议：\n如果您是使用TinyMCE的应用程序开发人员，请确保将其更新到版本5.2.2或更高版本。\nCKEditor 4是另一个非常受欢迎的WYSIWYG编辑器，它将自己标榜为“功能最多的排名第一的富文本编辑器”。\nCKEditor有一个有趣的概念，即在复制时“保护”某些数据，以便粘贴完全相同的标记。例如，如果CKEditor中的HTML包含注释：\n然后，如果从编辑器复制，剪贴板将包含以下HTML：\n其想法是，CKEditor希望确保评论按原样粘贴，而不会出现任何乱七八糟的情况。问题(又一次出现了！)。CKEditor没有意识到--！&gt；关闭了HTML注释，从而允许隐藏任意标记。因此，以下有效负载触发了XSS：\nCKEditor假定--！&gt；&lt；img src=1 onerror=alert(1)&gt；是注释的文本并逐字粘贴，而浏览器在--！&gt；关闭它并呈现&lt；img&gt；元素。\n据其官方网站介绍，Froala是一个所见即所得的编辑器，“在考虑到更好的开发人员和用户体验的情况下，为快速开发而构建编辑软件”。\n我描述的bug是0天的，截至2020年6月4日，它仍然在当前的稳定版本中工作。我在2020年1月22日报告了这个错误，我得到的唯一答案是：“我已经将这个问题提交给开发人员，但还没有确定修复的时间表”。在此期间，我就这个问题问了三次，都没有结果。\nFroala使用正则表达式和字符串处理执行大量HTML处理。下面我展示的只是一个由此产生的问题，但我相信还会有更多的问题。\n从剪贴板粘贴后，Froala获取HTML并(除其他操作外)执行以下操作：\n将regex：/(？：(？！&lt；\\/noscript&gt；)&lt；[^&lt；])*&lt；\\/noscript&gt；/gi的所有匹配项替换为[FROALA.EDITOR.NOSCRIPT0](如果找到更多&lt；noscript&gt；标记，则该数字会递增)。正则表达式的目标是匹配所有&lt；noscript&gt；元素及其内容。\n标记是安全的，因为XSS有效负载包含在title属性中。但是，在第一步之后，Froala将其更改为：\n请注意单引号是如何替换为双引号的。之后，[FROALA.EDITOR.NOSCRIPT 0]将替换为原始&lt；noscript&gt；元素：\n这会触发XSS。另一个很好的例子是，将HTML作为字符串处理几乎总是一个坏主意！\nGmail使用Google自己的Close Library消毒器对剪贴板内容进行消毒化。处理Paste事件的代码大致相当于以下代码片段：\n虽然乍一看它可能是安全的，但有一个警告：如果sanitiseWithClosure抛出异常，则从不调用event.prevenentDefault()，这意味着完全忽略了闭包消毒器，而使用了浏览器的消毒器。当我向谷歌报告这个错误时，Chromium#1的问题还没有修复，因此退回到浏览器的杀菌剂可能会导致XSS。\n剩下的问题是：我们如何才能使闭包抛出异常？我发现了一种触发异常的方法：需要向消毒器提供以下代码：\n这似乎是一个封闭的错误(实际上很容易识别某个网站是否在使用它)，但谷歌并没有修复它。如果您想要自己修补的话，我已经在https://jsbin.com/mahinanuru/edit?html，Output创建了一个闭合游乐场。只要您在&lt；ath&gt；元素中有一个带有style属性的元素，就会触发该错误。\n利用此问题的有效负载与Chromium中的有效负载相同(因为有效负载已经具有&lt；Math&gt；内部具有style属性的元素)：\n尽管利用该问题需要浏览器中存在漏洞，但谷歌支付了5000美元的全额赏金。\n在这篇文章的前几节中，我只提到了text/html在粘贴时可能会有危险。但是，一些网站定义了它们自己的非HTML内容类型。\n谷歌文档(Google Docs)就是这种情况。如果您从Google Docs复制任何东西，那么它会用Content-Type：application/x-vnd.google-docs-document-slice-clip+wrapped设置数据，这只是一个很大的JSON对象：\n此JSON的某些部分反映在HTML中。我注意到JSON有一个键hclr_color，它包含文档中元素的颜色。对这个问题的利用非常简单，只需将其设置为：\n&lt；！doctype html&gt；&lt；meta charset=utf-8&gt；&lt；script id=data type=application/json&gt；{&#34；已解析&#34；：\n..", "note_en": "This writeup is a summary of my research on issues in handling copying and pasting in: browsers, popular WYSIWYG editors, and websites. Its main goal is to raise awareness that the following scenario can make users exposed to attacks:\n    In subsequent sections, I’ll explain how such issues can be identified and exploited.\n I am not the first person to cover security risks associated with copying and pasting. In 2015, the great Mario Heiderich had a presentation called  Copy &amp; Pest about this very topic. Mario focused on copying data from non-browser applications (like LibreOffice or MS Word) and pasting in browsers and showed that this could lead to XSS.\n  XSS is not the only issue in handling the clipboard data; exfiltration being the other risk,\n Even if browsers are safe from this type of bugs, JavaScript WYSIWYG editors can still introduce security issues.\n Finally, I believe that an attack scenario that includes copying and pasting between two browser tabs is more likely to be exploited than copying from an external application and pasting in the browser.\n In this paper, I’ll explain 4 security issues in browsers and 5 vulnerabilities in rich editors, for which I got a combined bounty of over $30,000.\n  Copy and paste is one of the most common user interactions to share data between two applications. The clipboard can contain various types of data, for instance:\n  In this writeup, I’ll focus on formatted text since it is equivalent to HTML markup in the world of browsers. This means that if you copy the following text: “hello  there“, then the clipboard will contain HTML content:  hello &lt;b&gt;there&lt;/b.\n Interestingly, browsers expose API that lets you set arbitrary clipboard content from JavaScript code. Consider the following example:\n     The call  event.preventDefault() is needed to ensure that the browser’s standard behavior on copying is blocked, and the clipboard is filled only with the second argument to  clipboardData.setData.\n The obvious attack vector here is the ability to put XSS payload in the clipboard:\n     Browser vendors are fully aware of this attack scenario. As a prevention method, they introduced content sanitization on pasting; that is, removing elements and attributes that are considered harmful.\n I’ve created a simple website called “ Copy &amp; Paste Playground” to simplify the process of looking for sanitization bugs in browsers.\n   On the left, you can enter the HTML markup, and watch the DOM tree generated by the browser. Then, after clicking “Copy as HTML”, the exact HTML you entered is copied to clipboard.\n The right side, on the other hand, contains a rich editor (or WYSIWYG editor) in which you can paste from the clipboard. DOM tree is also shown for the contents of the editor so that it’s easy to compare with the left side to find out how the browser sanitized the HTML.\n In the example in figure 1: firstly, I entered the following XSS payload in the HTML input field:  &lt;img src=1 onerror=alert(1)&gt;; secondly, I clicked “Copy as HTML”; finally, I pasted it in the paste target. The view of DOM trees makes it easy to see that the browser stripped the  onerror attribute after pasting. You can also use “ Copy &amp; Paste playground” to test for XSS issues via copy&amp;paste in external pages; first copy arbitrary HTML from the playground and then paste it on an external page (or even an external application).\n Considering that browsers must employ some logic behind deciding whether any HTML element or attribute should be sanitized or not, I decided to give them a look, and try to find bypasses. As a result, I found at least one sanitizer bypass in all major browsers: Chromium, Firefox, Safari, and the classic Edge.\n  In this section I’ll describe in detail a selection of clipboard sanitizer issues I identified.\n  The first bug I identified is a universal XSS, fixed in Chromium 79 ( crbug.com/1011950). I noticed an interesting peculiarity when pasting an HTML code with a  &lt;div&gt; element. DOM tree created after pasting depended on the exact place in which the paste occurred. Consider the simple HTML snippet:\n               This is expected as the resulting HTML is the same as the HTML copied to the clipboard. However, if the snippet is pasted in the middle of  1234, then a different HTML is rendered:\n      The behavior seems unusual: the  &lt;div&gt; element is completely omitted from pasted content, while in the point in which  &lt;div&gt; should normally end, a  &lt;br&gt; tag appeared. The same behavior is observed with any HTML element that has a CSS rule:  display: block. This looked really promising because what we’re witnessing is a  mutation. And if history of browsers teaches us anything, it is that mutations often lead to vulnerabilities.\n After some investigation,  &lt;math&gt; element proved to be useful. It is often handy in bypassing various sanitizers as it introduces the so-called “foreign content” and some markup is parsed differently when it’s a descendent of a  &lt;math&gt; element than in any other part of HTML.\n Let’s have a look at a simple example. In HTML parsing of  &lt;style&gt; element cannot yield any child elements other than text nodes. For instance, the following markup:\n       The conclusion is that content inside the  &lt;style&gt; is treated as text. However, if  &lt;style&gt; element becomes a descendent of  &lt;math&gt; element, parsing changes drastically. The following code\n       In this case, the  &lt;style&gt; element can have child elements. This difference may lead to Cross-Site Scripting in certain cases (an example being  my DOMPurify bypass).\n        The DOM tree looks safe: the  &lt;img&gt; element is within the  title attribute so it is not rendered. Nonetheless, after removing  &lt;math&gt; element, parsing of the HTML code yields a different DOM tree:\n  The XSS payload executes as the  &lt;/style&gt; closing tag, which originally was placed in the  title attribute, now closes the  &lt;style&gt; element since no foreign content was introduced.\n Going back to copy&amp;paste, I wondered what happens to the clipboard content when it contains a  &lt;math&gt; element containing a child element with  style=display:block knowing that the latter leads to a mutation on pasting. I created the following snippet:\n      (Side-note: all elements have a text node because Chromium tends to omit HTML elements completely after pasting if they have no text)\n Then I pasted it in the middle of a rich editor containing only a text node with content:  &#34;1234&#34;. The DOM tree after pasting was:\n  Note that the  &#34;TEST&#34; string which initially was inside the  &lt;xss&gt; element (and, by extension, the  &lt;math&gt; element) is placed outside of  &lt;math&gt; after mutation.\n       And after pasting it in the middle of a rich editor, it created the following DOM tree:\n  After mutation, the  &lt;img&gt; element “escaped” from  title attribute and was placed in the DOM tree without any sanitization whatsoever. To prove that the exploit works to Chromium Security Team, I provided them with the following video, showing I can trigger XSS on GMail, Wikipedia, and Blogger.\n    When I reported the universal XSS to Chromium, I mentioned as a side-note that another way to abuse the clipboard is to inject  &lt;style&gt; elements to leak data from the page (for instance: CSRF tokens, or user’s personal information). A fix to the original issue didn’t cover it, hence Google staff created another issue ( crbug/1017871) to work out whether the injection of CSS has a security risk.\n Abusing stylesheets to leak data from websites is nothing new. For instance, in 2018  Pepe Vila showed that  a single injection point is enough to leak data from CSS, the  same trick was later rediscovered by  d0nut in 2019. I also wrote an article about  CSS data exfiltration in Firefox via a single injection point at the beginning of this year (even though the title of the post explicitly mentions Firefox, the same code works also for Chromium).\n So my job was to convince Chromium security folks that injecting styles via copy&amp;paste indeed has security implications. And I did it with the following video that proves that you can leak the email address of currently logged in user in Gmail.\n  If you wish to work out how the exploit exactly works, please refer to the article about  data exfiltration via a single injection point. For this bug, Google decided to issue a reward of $10,000.\n I reported two more copy&amp;paste bugs to Chromium ( crbug/1040755 and  crbug/1065761), one to Safari and one to the classic Edge. However, all these bugs are very similar, and considering that not all are fixed or de-restricted, I decided to refrain from disclosing them for now.\n  However, there are two other bugs I’m perfectly fine to disclose, which happened in Firefox:  CVE-2019-17016 and  CVE-2019-17022. Both were fixed in Firefox 72, released on 7th January 2020.\n Firefox allowed pasting stylesheets from the clipboard. For instance, if we copy the following HTML:\n     Then on pasting, Firefox doesn’t change it; that is, the background immediately turns  yellow. It is important to note that certain CSS rules are not allowed in pasted content and are deleted. One example is  @import, which is necessary for any real-world exploitation of CSS leaks.\n           Once again we are dealing with mutation, but this time it is a stylesheet mutation. Firefox CSS sanitizer checked if the stylesheet contains any rules needing sanitization. If so, then the offending rules are removed and the whole stylesheet is rewritten. Otherwise, the stylesheet is pasted verbatim. This creates a new attack surface, since rewriting stylesheet might introduce new, unexpected rules.\n I noticed that Firefox mishandles the rather obscure CSS feature that is the  @namespace at-rule. According to MDN: “the  @namespace rule is generally only useful when dealing with documents containing multiple namespaces – such as HTML5 with inline SVG or MathML or XML that mixes multiple vocabularies”.\n      After copying and pasting it from the clipboard, it was mutated to the following form:\n     Because single quotes were substituted with double quotes, it was natural to check what happens when you put the double-quote within the URL.\n     And Firefox mishandled rewriting this stylesheet and didn’t escape the double-quote character properly:\n     This made it possible to include arbitrary rules in the stylesheet. The ultimate payload proving that I could include my own  @import rule in the stylesheet is the following:\n          While at first sight, it might seem that the  @import will be ignored because it is not the first rule in the stylesheet (which is required by CSS spec), it gets processed as the  @namespace rule is invalid (because of the redundant  x) and ignored by the parser.\n In order to prove to Mozilla that the exploit actually works, I created a video that leaks a CSRF token from an example page. Refer to the article about  stealing data with CSS via a single injection point in Firefox to find out how exactly the exploit looked like.\n   Furthermore, I reported another issue to Firefox, tracked as CVE-2019-17022, that introduced a mutation XSS to Firefox.\n The root cause of this issue was exactly the same as in the previous one, but this time it is exploited differently.\n           Please note how  &lt;\\/style&gt; was transformed to  &lt;/style&gt;. This doesn’t introduce a security issue by itself because the text node of the stylesheet is modified directly, hence the  &lt;/style&gt; inside doesn’t close the tag. However, if the website does something akin to:\n     then it is vulnerable to XSS, because the  &lt;img&gt; element would leave the  &lt;style&gt; element. I assumed that certain WYSIWYG editors might do that because essentially assigning innerHTML of one element to another element should be harmless. Moreover, certain WYSIWYG editors let browsers handle the clipboard content and then perform some transformation on it after it was pre-sanitized.\n I had a look at GitHub repo called  awesome-wysiwyg to see if the behavior of Firefox makes any editor vulnerable. And the search wasn’t too long because the first editor from the top:  Aloha Editor happened to be vulnerable. After pasting the aforementioned payload, the XSS immediately triggers.\n        On pasting, the clipboard content is pasted into the element, and then handled via  handleContent function that removes certain elements :\n  handleContent: function (content) {\tvar $content;\tif (typeof content === &#39;string&#39;) {\t\t$content = $(&#39;&lt;div&gt;&#39; + content + &#39;&lt;/div&gt;&#39;);\t} else if (content instanceof $) {\t\t$content = $(&#39;&lt;div&gt;&#39;).append(content);\t}\tif (this.enabled) {\t\tremoveFormatting($content, this.strippedElements);\t}\treturn $content.html();}\n   The mutation XSS triggers when the  content variable (containing HTML pre-sanitized by the browser) is used as an argument in jQuery  $ function. At this point  content contains:\n      Aloha Editor wasn’t the only editor in which it was possible to trigger the mutation XSS. I leave it as an exercise to the reader to find others.\n  Now let’s assume that we live in a perfect world in which browsers fixed all sanitizer bypasses and no more exist. Does this mean that we are safe when we are pasting data from untrusted websites? The short answer is: no.\n  A JavaScript code can completely ignore the browser’s sanitization process and handle it manually. This approach requires listening to  paste event, for instance:\n  document.addEventListener(&#39;paste&#39;, event =&gt; { event.preventDefault(); const html = event.clipboardData.getData(&#39;text/html&#39;); // handle the html... // ... for instance someElement.innerHTML = html; // 😱});\n   In the snippet, the clipboard content is assigned to  html variable, which, in turn, is assigned to  innerHTML of an element, leading to XSS.\n Basically every popular WYSIWYG editor handles the paste event by itself. There are several reasons to do it:\n  In the subsequent sections, I’ll walk through a few real-world examples of mishandling clipboard content by websites and popular WYSIWYG editors.\n  TinyMCE is self-proclaimed “the most advanced WYSIWYG HTML editor” and, from my experience, is indeed one of the most popular editors (if not the most).\n On pasting, TinyMCE handles the content by parsing HTML, applying some transformations, and then serializing it back to HTML. TinyMCE doesn’t use any HTML parsers provided in JavaScript (like  DOMParser) but employs its own solution.\n As an example of TinyMCE sanitization, consider the following HTML snippet to be pasted from clipboard:\n       Then it decides that  &lt;b&gt; element should be replaced with  &lt;strong&gt; and the comment should be left intact. The DOM tree is then serialized into:\n      So far so good. The problem with TinyMCE’s parser was that it failed to recognize that in HTML5  --!&gt; is a valid comment ending. Thus, the following HTML:\n       Since the editor assumes the tree is harmless, it is serialized back to the same form:\n     And it is assigned to the  outerHTML. After the assignment, it’s the browser’s turn to parse the HTML and it does it differently:\n   I reported the bug (and a few others) to TinyMCE and they released two security advisories:\n  If you’re a developer of an application using TinyMCE, make sure to update it to version 5.2.2 or higher.\n  CKEditor 4 is another highly popular WYSIWYG editor, which advertises itself as “number #1 rich text editor with the most features”.\n CKEditor has an interesting notion of “protecting” some data on copying so that exactly the same markup is pasted. For example, if the HTML within CKEditor has a comment:\n     Then if you copy it from the editor, the clipboard will contain the following HTML:\n     The idea is that CKEditor wants to make sure that the comment is pasted as-is, without any scrambling. The problem (once again!) is that CKEditor was unaware that  --!&gt; closes the HTML comment, allowing to sneak arbitrary markup. Hence, the following payload triggered the XSS:\n     CKEditor assumed that  --!&gt;&lt;img src=1 onerror=alert(1)&gt; is the text of the comment and pasted it verbatim, while browser closed it on  --!&gt; and rendered the  &lt;img&gt; element.\n   Froala, according to its official website, is a WYSIWYG editor that “builds editing software for fast development with better developer and user experience in mind”.\n The bug I’m describing is a 0-day and, as of 4th June 2020, it still works in the current stable version. I reported the bug on 22nd January 2020, and the only answer I got was that: “I have submitted this issue to development, but a timeline has not yet been established for a fix”. I asked about the issue three times in the meantime to no avail.\n Froala is guilty of carrying out extensive HTML processing using regular expressions and string processing. What I’m showing below is just one issue that stems from it but I’m sure there will be more.\n After pasting from the clipboard, Froala takes the HTML and (among others) perform the following operations:\n Replace all matches of regex:  /(?:(?!&lt;\\/noscript&gt;)&lt;[^&lt;])*&lt;\\/noscript&gt;/gi with  [FROALA.EDITOR.NOSCRIPT 0] (the number is incremented if more  &lt;noscript&gt; tags are found). The goal of the regex is to match all  &lt;noscript&gt; elements along with their content.\n       The markup is safe, as the XSS payload is contained in the  title attribute. However, after first step, Froala changes it to:\n          Notice how single quotes were replaced with double-quotes. Afterward,  [FROALA.EDITOR.NOSCRIPT 0] is replaced with the original  &lt;noscript&gt; element:\n       And this triggers the XSS. Another fine example that processing HTML as strings is almost always a bad idea!\n  Gmail sanitizes the clipboard content with Google’s own  Closure Library sanitizer. The code that handled  paste event was roughly equivalent to the following snippet:\n     While it may look safe at first sight, there is one caveat: if  sanitizeWithClosure throws an exception, then  event.preventDefault() is never called, meaning that the Closure sanitizer is completely ignored and the browser’s sanitizer used. When I reported the bug to Google, the Chromium #1 issue was not fixed yet, hence fallback to browser’s sanitizer could lead to XSS.\n The question that remains is: how can we make Closure throws an exception? I found one way to trigger an exception: the sanitizer needs to be fed with the following code:\n       This appears to be a bug in Closure (and actually makes it easy to identify if a given website uses it) but Google didn’t fix it. I have created a Closure playground at  https://jsbin.com/mahinanuru/edit?html,output if you wish to tinker with it by yourself. The bug is triggered whenever you have an element with  style attribute inside  &lt;math&gt; element.\n The payload exploiting this issue was identical to the payload in Chromium (as the payload already has an element with a  style attribute inside  &lt;math&gt;):\n     Even though exploitation of the issue requires a bug in a browser, Google paid the full bounty of $5,000.\n  In previous sections of this writeup, I’ve only mentioned that  text/html may be dangerous on pasting. However, some websites define their own, non-HTML content types.\n           This was the case in Google Docs. If you copy anything from Google Docs, then it sets data with content-type:  application/x-vnd.google-docs-document-slice-clip+wrapped that is just a big JSON object:\n     Some parts of this JSON are reflected in HTML. I noticed that the JSON had a key  hclr_color that contained the color of an element in the document. And the exploitation of the issue was as simple as setting it to:\n       &lt;!doctype html&gt;&lt;meta charset=utf-8&gt;&lt;script id=data type=application/json&gt; { &#34;resolved&#34;:\n......", "posttime": "2020-06-16 06:49:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "复制粘贴,case,html", "title": "复制粘贴的奇妙案例", "title_en": "The Curious Case of Copy and Paste", "transed": 1, "url": "https://research.securitum.com/the-curious-case-of-copy-paste/", "via": "", "real_tags": ["复制粘贴", "case", "html"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006739, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我经常听到有人说，AWS是亚马逊盈利的主要贡献者。多大？以下是过去九个季度的图表，并简要介绍了方法：\n我认为随着时间的推移，这是一个值得观察的有用数字，如果我们就如何计算它达成一致，那将是一件好事。我是这样做的。\n从ir.amazon.com的季度业绩页面开始。它只有2018年前的数据，这似乎有足够的历史来实现这一目的。例如，让我们来看看2020年第一季度的数字。\n请注意：我对这些数字背后的事实一无所知。这里的每一个词都是基于公开的数据。\n很容易识别AWS的编号；在季度中搜索“细分信息”，结果是：净销售额102.19亿美元，运营费用71.44亿美元，运营收入30.75亿美元。因此，如果我们想知道亚马逊利润中来自AWS的比例，那就是分子。\n那么分母是什么呢？由于AWS的结果不含税，因此亚马逊号码也应该不含税。搜索“合并经营报表”，有两个候选者：“营业收入”和“所得税前收入”。第一个与AWS系列同名，因此它是一个看似合理的候选者。但它不包括净利息费用和2.39亿美元未指明的“其他收入”。\n这有点奇怪，因为利息是做生意的常规成本。可能的情况是，利息支出主要是为AWS的计算机和数据中心提供资金，或者主要是为新的履约中心、卡车和飞机以及批量购买卫生纸提供资金。然后是“其他收入”。\n如果我们假设“其他收入”和净利息损益平均分布在AWS和亚马逊的其余部分，那么您应该使用“运营”这一行。我对这一断言不是百分之百满意，所以我用两条线都画了一张图，我认为这可能是对AWS在亚马逊收入中所占比例的最好估计，在这两条线之间。\n因此，如果这个图表是正确的，那么在过去的几年里，亚马逊50%到80%的利润来自于AWS。看一眼图表，你可能会认为趋势是上升的，但这近乎推断，我想再等几个季度才能得出结论。\n由于我不是金融专业人士，我可能以某种愚蠢的明显方式脱轨了。下面是我用来生成图形的.xlsx文件。我用的是谷歌表格，所以我希望它不会破坏你的Excel。\n2020年6月14日·世界(117个片段)··科技分崩离析(1个以上)·商业(115个以上)", "note_en": "I’ve often heard it said that AWS is a major contributor to Amazon’s profitability. How major? Here’s a graph covering the last nine quarters, with a brief methodology discussion:\n  I think this is a useful number to observe as time goes by, and it would be good if we generally agree on how to compute it. So here’s how I did it.\n Start at the  Quarterly Results page at  ir.amazon.com. It only has data back through 2018 which seems like enough history for this purpose. Let’s take a walk through, for example, the  Q1 2020 numbers.\n Please note: I have zero inside knowledge about the facts behind these numbers. Every word here is based on publicly available data.\n It’s easy to identify the AWS number; search in the quarterly for “Segment Information” and there it is: Net sales $10,219M, Operating expenses $7,144M, Operating Income $3,075M. So if we want to know the proportion of Amazon profits that are due to AWS, that’d be the numerator.\n So what’s the denominator? Since the AWS results exclude tax, so should the Amazon number. Search for “Consolidated Statements of Operations” and there are two candidates: “Operating Income” and “Income before income taxes”. The first has the same name as the AWS line, so it’s a plausible candidate. But it excludes net interest charges and $239M of unspecified “Other income”.\n This is a little weird, since interest is a regular cost of doing business. It might be the case that the interest expense is mostly due to financing computers and data centers for AWS, or alternatively that it’s mostly financing new fulfillment centers and trucks and planes and bulk buys of toilet paper. And then there’s the “Other income”.\n If we assume that the “Other income” and net interest gain/loss is distributed evenly across AWS and the rest of Amazon, then you should use the “Operating” line. I’m not 100% comfy with that assertion, so I made a graph with both lines, and I think it’s likely the best estimate of AWS’s proportion of Amazon’s income falls in the space between them.\n So, if this graph is right, then over the last couple of years, somewhere between 50% and 80% of Amazon’s profit has been due to AWS. Glancing at the graph, you might think the trend is up, but that verges on extrapolation, I’d want to wait a couple more quarters before having an opinion.\n Since I’m not a finance professional, I may have gone off the rails in some stupidly obvious way. So  here’s the .xlsx I used to generate the graph. I used Google Sheets, so I hope it doesn’t break your Excel.\n June  14,  2020  ·  The World  (117 fragments)  · ·  Tech Breakup  (1 more)  ·  Business  (115 more)", "posttime": "2020-06-16 06:32:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "亚马逊,amazon,aws,share", "title": "AWS在亚马逊利润中的份额", "title_en": "AWS’s Share of Amazon’s Profit", "transed": 1, "url": "https://www.tbray.org/ongoing/When/202x/2020/06/14/Amazon-profit-from-AWS", "via": "", "real_tags": ["亚马逊", "amazon", "aws", "share"]}, {"category": "", "categoryclass": "", "imagename": "be6d9a95638d46a7c0456ae316dbb6ee.png", "infoid": 1006738, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数字攻击地图-全球范围内的DDoS攻击", "note_en": "Digital Attack Map - DDoS attacks around the globe", "posttime": "2020-06-16 06:08:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "攻击,attack", "title": "DDoS攻击导致美国主要航空公司瘫痪", "title_en": "DDoS attack takes down major US carriers", "transed": 1, "url": "https://www.digitalattackmap.com/#anim=1&color=0&country=ALL&list=0&time=18427&view=map", "via": "", "real_tags": ["攻击", "attack"]}, {"category": "", "categoryclass": "", "imagename": "7b462e7093c3e6a4f64e253e6966c5c8.jpg", "infoid": 1006737, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大多数公司错误地将价值复制原则应用于发现", "note_en": "Most companies mistakenly apply value replication principles to discovery", "posttime": "2020-06-16 06:08:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "team,错误", "title": "你们中有多少人知道团队正在做一些没人想要的事情？", "title_en": "How many of you know that the team is working on something that no-one wants?", "transed": 1, "url": "https://iism.org/article/how-many-of-you-know-deep-down-that-the-team-is-working-on-something-that-no-customer-wants-54", "via": "", "real_tags": ["team", "错误"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006736, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这篇文章的顶部，我链接了我的论文，分析电影“攻壳机动队”(Akira)和“攻壳机动队”(Ghost In The Shell)。这两部开创性的电影都极大地影响了现代恐怖/惊悚片/未来主义电影，因此，它们被无数的评论家和分析家挑了出来。\n然而，我分析这些电影的方法与传统的方法有很大的不同。我使用数据分析工具对电影中的“宏观”趋势进行观察，并试图通过场景和剪辑使这些观察合理化。如果没有什么，你应该喜欢第6页和第12页上的漂亮图片，这构成了我大部分的数据可视化工作。\n使用这种方法得到的反馈好坏参半。当我们处理动漫电影时，它会给出相当好的结果(就像我选择看的电影一样)。我认为这一成功可以归功于艺术家在这样的媒介中对灯光和色彩的严格控制。处理现实生活环境几乎不允许创造性的实验，对于大多数现实电影来说，颜色苍白更类似于物理环境的副作用，而不是故意策划的创造性视觉。\n与标准的电影评论/分析相比，这种方法耗费的时间要多得多，对于标准的电影评论/分析来说，最耗时的任务可能只是看几次电影。相比之下，忽略实际的可视化效果，在我2012年的笔记本电脑上，仅处理一部电影的所有帧就需要4-5个小时。在一个速度为王的世界里，特别是在媒体领域，这些扭亏为盈的时间对于独立记者来说根本不可行。也许，当您拥有一个由大量数据科学家和软件工程师组成的团队时，这种方法会变得更加可行。\n话虽如此，我仍然希望我的项目能启发观众重新思考他们是如何看待阿基拉和攻壳机动队这两部电影的(顺便说一句，这两部电影在马尔身上都被刑事低估了)，甚至可能会和我一起重新想象电影分析的整个方法。由于电脑是我们的“头脑自行车”，电影部门肯定还有很多工作要做，我希望我的分析能让我们一窥这一潜力。", "note_en": "At the top of this post, I’ve linked my paper analysing the films  Akira and  Ghost in the Shell. These are both seminal films that have greatly influenced modern horror/thriller/futuristic films, and as a result, they have been picked over by numerous reviewers and analysts.\n However, my approach to analysing these films is quite different from the conventional methods. I use data analysis tools to make observations about “macro” trends in the films, and try to rationalise these observations using scenes and clips. If nothing, you should enjoy the pretty pictures on Page 6 and Page 12, which constitute the bulk of my data visualisation work.\n  The feedback from the use of this method is mixed. It gives reasonably good results when we are dealing with anime films (as it did for the films I chose to look at). I suppose this success can be attributed to the tight control on lighting and colors the artists can exert in such a medium. Dealing with real life environments allows for little creative experimentation, and for most real-life films, color palletes are more akin to side effects of physical circumstances, not intentionally curated creative visions.\n This method is much, much more time consuming compared to a standard movie review/analysis, for which the most time consuming task is probably just watching the film a couple times. In comparison, neglecting the actual visualisations, simply processing all the frames of a film takes over 4-5 hours on my 2012 laptop. In a world where speed is king, especially in media, these turnaround times are simply not viable for independent journalists. Perhaps, this method becomes much more viable when you have a large team of data scientists and software engineers at your disposal.\n With that said, I still hope my project inspires audiences to reconsider how they’ve looked at the particular films Akira and Ghost in the Shell (both of which, by the way, are  criminally  underrated on MAL) and perhaps, even reimagine the entire methodology of film analyses with me. With computers as our “bicycles for the mind”, there is definitely a lot left to be done in the film department, and I hope that my analysis functions as a glimpse of that potential.", "posttime": "2020-06-16 06:08:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "幽灵,statistical,电影", "title": "“贝壳里的阿基拉与幽灵”探索性统计分析", "title_en": "An exploratory statistical analysis of Akira and Ghost in the Shell", "transed": 1, "url": "https://nibnalin.me/dust-nib/shadows-of-stained-glass.html", "via": "", "real_tags": ["幽灵", "电影"]}, {"category": "", "categoryclass": "", "imagename": "a213a1fd17e5359d4743f23e4ce3c43d.jpeg", "infoid": 1006735, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦(路透社)-伦敦帝国理工学院的科学家本周将在英国政府和慈善捐赠者的支持下，开始一种潜在的新冠肺炎疫苗的首次临床试验。\n这些试验是对一项新技术的首次人体测试，研究人员表示，这项技术可以通过对新出现的疾病(如由新型冠状病毒引起的新冠肺炎感染)做出快速反应，从而改变疫苗开发。\n领导这项工作的帝国理工学院传染病系教授罗宾·沙托克(Robin Shattock)表示，这种潜在的疫苗不像许多疫苗那样使用病毒的一部分，而是使用病毒遗传物质的合成链-RNA-包装在微小的脂肪滴中。\n当注射时，它会指示肌肉细胞产生病毒蛋白，以防止未来的感染。沙托克的团队在一份声明中说，在动物试验中，疫苗被证明是安全的，并显示出“令人鼓舞的有效免疫反应的迹象”。\n在最初的人体试验中，约300000名健康志愿者将接种两剂疫苗，以测试其对人体是否安全，以及是否对新冠肺炎产生有效的免疫反应。如果它显示出希望，今年晚些时候将计划有大约6000人参加的更大规模的试验。\n全球100多种潜在的新冠肺炎疫苗正在开发中，其中包括阿斯利康(AstraZeneca)、辉瑞(Pfizer)、生物科技(BioNtech)、强生、默克(Merck)、现代、赛诺菲(Sanofi)和嘉信生物(CanChina Biologics)的几种已经处于人体试验阶段的疫苗。\n在帝国审判之前，该团队从英国政府获得了4100万英镑的资金，外加500万英镑的慈善捐款。\n商务大臣阿洛克·夏尔马(Alok Sharma)表示，帝国百货是“世界上的领跑者之一”，并得到了英国的全力支持。", "note_en": "LONDON (Reuters) - Scientists at Imperial College London will start the first clinical trials of a potential COVID-19 vaccine this week with more than 45 million pounds ($56.50 million) in backing from the UK government and philanthropic donors.\n The trials are the first human tests of a new technology which the researchers say could transform vaccine development by enabling rapid responses to emerging diseases such as the COVID-19 infection caused by the new coronavirus.\n Robin Shattock, a professor at Imperial’s department of infectious disease who is leading this work, said that rather than using a part of the virus, as many vaccines do, this potential vaccine uses synthetic strands of the virus’ genetic material - RNA - which are packaged inside tiny fat droplets.\n When injected, it instructs muscle cells to produce virus proteins to protect against future infection. In animal tests, the vaccine was shown to be safe and showed “encouraging signs of an effective immune response”, Shattock’s team said in a statement.\n Around 300 healthy volunteers will receive two doses of the vaccine in the initial human trials to test whether it is safe in people and whether it produces an effective immune response against COVID-19. If it shows promise, larger trials with around 6,000 people would be planned for later this year.\n More than 100 potential COVID-19 vaccines are in development around the world, including several already in human trials from AstraZeneca, Pfizer, BioNtech, Johnson &amp; Johnson, Merck, Moderna, Sanofi and CanSino Biologics.\n The Imperial trials come after the team won £41 million pounds in funding from the UK government plus £5 million in philanthropic donations.\n Business secretary Alok Sharma, said Imperial’s was “one of the world’s front-runners” and had Britain’s full backing.", "posttime": "2020-06-16 05:50:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "资助,funds,疫苗", "title": "英国资助帝国理工学院潜在新冠肺炎疫苗的人体试验", "title_en": "UK funds human trials of potential Covid-19 vaccine from Imperial", "transed": 1, "url": "https://www.reuters.com/article/us-health-coronavirus-vaccine-imperial/uk-funds-human-trials-of-potential-covid-19-vaccine-from-imperial-idUSKBN23M2YE", "via": "", "real_tags": ["资助", "funds", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "bc4f772b299aa91eb211c34e734df6a3.jpg", "infoid": 1006734, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "贝佐斯是全球首富，也是“华盛顿邮报”(The Washington Post)的所有者，他将成为近年来一系列知名科技高管中的最新一位，这些高管将在国会调查涉嫌滥用反垄断和其他围绕该行业的问题的小组面前亮相。\n司法领导人在5月份威胁要传唤这位首席执行官就亚马逊对待第三方供应商的方式作证，这标志着该小组对科技行业的反垄断调查出现了重大升级。这项于去年6月启动的全面调查，越来越多地将矛头对准亚马逊(Amazon)、谷歌(Google)、Facebook和苹果(Apple)不公平地压制竞争对手的指控。该公司后来回应称，愿意提供一位“合适的”高管作证，但没有承诺让贝佐斯作证。\n根据Axios的一份报告，众议院议员最近加大了对亚马逊、Facebook、苹果和谷歌母公司Alphabet的压力，要求它们承诺让首席执行官作证，要求这些公司在周日之前做出回应。目前还没有宣布计划中的听证会的日期。\n虽然亚马逊在周日同意满足这一特殊要求，但该公司的律师对满足其他要求表示担忧，包括提供委员会要求的某些文件。\n亚马逊仍然深感担忧，因为你不能保证，反映商业战略和其他竞争敏感信息的最敏感的公司文件将向其许多竞争对手隐瞒，科文顿&伯林公司(Covington&amp；Burling)的罗伯特·凯尔纳(Robert Kelner)写道。\n民主党众议员大卫·西西林(David Cicilline)周一在一份声明中表示，首席执行官的证词和内部文件的出示对于完成这项针对数字市场竞争状况的两党调查至关重要。他重申，该小组委员会将继续使用我们掌握的工具，确保我们收集工作所需的任何信息。他所在的反垄断小组委员会正在带头调查司法部的这项调查。他在周一的一份声明中表示，首席执行官的证词和内部文件的出具对于完成这项针对数字市场竞争状况的两党调查至关重要。他重申，该小组委员会将继续使用我们掌握的工具，确保我们收集工作所需的任何信息。\n其他大公司尚未公开表示是否会遵守首席执行官的要求。但西西林表示，他预计在调查结束之前，将听取所有四家科技巨头的首席执行官的意见。西西林上个月告诉Politico，贝佐斯是“唯一对露面持保留态度的CEO”。\n司法立法者在他们的信中还提出了一种担忧，即亚马逊的一名律师去年在作证时就该公司的数据做法误导了委员会，该公司否认了这一指控。\n亚马逊副法律顾问内特·萨顿在7月份向众议院作证称，该公司不会利用个人卖家数据与他们直接竞争。\n但在“华尔街日报”报道亚马逊员工利用从第三方卖家那里收集的信息来推出与之竞争的产品--这与该公司过去的言论相矛盾--之后，立法者要求得到答案。\n亚马逊质疑“华尔街日报”报道的准确性，并表示该公司没有故意提供误导性证词，但表示将对该报道进行内部调查。", "note_en": "Bezos, the world&#39;s richest person and owner of The Washington Post, would become the latest in a series of prominent tech executives paraded in recent years before congressional panels investigating alleged antitrust abuses and other questions surrounding the industry.\n Judiciary leaders in May threatened to subpoena the CEO’s testimony  on Amazon’s treatment of third-party vendors, marking a major escalation in the panel’s antitrust investigation into the tech sector. The sweeping probe, launched last June, has increasingly zeroed in on allegations Amazon, Google, Facebook and Apple have unfairly squelched competitors. The company later said in response it was willing to offer an “appropriate” executive to testify, but did not commit to have Bezos testify.\n House lawmakers recently dialed up pressure for Amazon, Facebook, Apple and Google&#39;s parent Alphabet to commit to having their CEOs testify, giving the companies until Sunday to respond, according to an Axios report. No date has been announced for the planned hearing.\n While Amazon agreed to meet that particular demand on Sunday, the company&#39;s lawyer expressed concern about fulfilling other requests, including producing certain documents sought by the committee.\n &#34;Amazon remains deeply concerned that you cannot assure that the most sensitive corporate documents reflecting business strategy and other competitively sensitive information would be withheld from its many competitors,&#34; Robert Kelner of the firm Covington &amp; Burling wrote.\n Rep. David Cicilline (D-R.I.), whose antitrust subcommittee is spearheading Judiciary&#39;s investigation, said in a statement Monday that &#34;testimony of CEOs and the production of internal documents is essential to complete this bipartisan investigation into the state of competition in the digital marketplace.&#34; And he reiterated that the subcommittee will &#34;continue to use the tools at our disposal to ensure we gather whatever information is necessary for our work.”\n The other major companies have yet to publicly say whether they will comply with the CEO request.  But Cicilline has said he expects to hear from the chiefs of all four of the tech giants before the probe wraps. Bezos had been the “only CEO who has expressed reservation about appearing,” Cicilline told POLITICO last month.\n Judiciary lawmakers in their letter also raised the specter that one of Amazon&#39;s lawyers misled the committee about the company&#39;s data practices in his testimony last year, a charge the company has denied.\n Amazon associate counsel Nate Sutton testified to the House in July that the company does not &#34;use individual seller data to directly compete with them.”\n But after The Wall Street Journal reported that Amazon employees have used information collected from third-party sellers to launch competing products — contradicting the company&#39;s past remarks — lawmakers demanded answers.\n Amazon disputed the accuracy of the Journal&#39;s account and said the company did not offer &#34;intentionally misleading&#34; testimony, but said it would conduct an internal investigation into the report.", "posttime": "2020-06-16 05:34:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "贝佐斯,亚马逊,amazon,愿意,jeff", "title": "亚马逊称杰夫·贝佐斯愿意在国会作证", "title_en": "Amazon Says Jeff Bezos Is Willing To Testify Before Congress", "transed": 1, "url": "https://www.politico.com/news/2020/06/15/jeff-bezos-to-testify-before-congress-319798", "via": "", "real_tags": ["贝佐斯", "亚马逊", "amazon", "愿意", "jeff"]}, {"category": "", "categoryclass": "", "imagename": "a423cd52b290dd813484cf9c7cb8f6a5.jpg", "infoid": 1006733, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它不会等待某人被“冒犯”。这是关于为什么任何人都会对基于可怕的不人道的事情而坚持可怕的条款持辩护态度。最后，让我们来解决这个问题。\n是的，当你只需要清晰、枯燥的技术术语时，现在似乎是停止使用奴隶制提法的好时机。这并不是说修复一些像语言这样的小东西就会有更大的不同。那就是，即使是从一些小事情开始考虑改变，也可能是一种很好的做法。\n这是特定于语言的，意义重大(见下文)，但不是任何一个地区所独有的-即使是美国，尽管它与非洲奴隶制的关系特别长和密切。\n我知道抗拒改变很容易。所以，让我解释一下为什么我认为这是一件特别不需要动脑筋的事情--这是可以立即做的事情。它引发辩论的事实是说，然后我们采取了一些关键术语，并准确地评估了它们的意思。任何这样做的过程都会改进语言，而任何改进语言的过程也会让我们更有效地交流技术。因此，这可能引发的任何辩论都远不是毫无意义的-相反，它证明了语言的重要性。\n一个重要的免责声明：我是以美国英语为母语的人。这种语言的问题源于英语中的这些词。正如一位讲意大利语的评论者所观察到的那样，将它们翻译成其他语言是另一回事。我们这里的英语有一个问题，两个主要的英语国家-美国和英国-在奴隶制和帝国主义方面有着特别丑陋的历史。这也是为什么整个对话都是用这种语言进行的，这本身就是有问题的，但-这是一个困难得多的解决办法。所以我会谈谈英语的问题和解决办法，但我很高兴听到人们如何理解你们语言中的“领导者”和“追随者”等术语，以及我们是否可以更好地学习您的单词并使用翻译，而不是简单地强加英语单词。我的感觉仍然是，这可能比使用你语言中的母语术语来表示主人和奴隶，或者直接采用英语术语要好，就像在技术术语中经常发生的那样。\n主要/次要可能是我们需要的默认技术替代，原因很简单，它们以相同的首字母开头。这意味着规格表和原理图上已经缩写为M和S的缩写不需要更改。而且它仍然是明确和通用的，特别是适合的情况(如数据库主要/次要)，其中强调的只是优先顺序，而不一定是分层或控制器关系/。\n导体/跟随器或先导/跟随器在时钟或源向接收器发送控制信号的其他情况下工作良好，但在定时场景中最具描述性。对于这些情况，它对最终用户来说也是最有意义的。(正如一些读者指出的那样，将“领导者/追随者”直接翻译成德语不是您想做的事情。)。\n作为一名教师和作家，我个人发现自己对这些术语有偏见，因为我认为它们是最容易传达给初学者的，而且我做了很多初学者的教学工作。然而，有充分的理由反对使用任何拟人化的术语，如果你直接翻译成德语，这对特殊的人会有一些令人不快的联想(尽管在德语中已经有了非奴隶制的选择)。\n源/宿可能是物理硬件插头和插座以及软件连接的最佳单一解决方案。改编自德国的Quelle和Senke，我注意到它也被用在像Jack这样的软件中(它使用单一的范例，直观地适合软件和想象的物理连接)。可能它唯一的弱点是，非技术英语使用者不习惯以这种方式使用术语“Sink”，尽管它是在语言中使用的。\n主机/客户端或主机/来宾在网络环境中工作，因为它们已经被理解和广泛使用(这意味着突然将它们替换为主和从也没有意义)。\n发送器/接收器适用于描述信号传输的词语(我也参见“控制器”/接收器，这在MIDI中通常用于发送参数)/。\n这些也不是委婉的说法；它们承载着不同的微妙含义。对我来说，这说明我们一开始就不需要他们。\n这并不是一个新的想法。如果音乐科技行业现在抛弃“主人”和“奴隶”，那就已经晚了。这并不是说批评没有提出来，而是它没有转化为行动。(例如，我相信罗伯塔·兰姆(Roberta Lamb)在1994年对音乐教育的女权主义批评中提出了这一点-有人手头有JSTOR订阅吗？)。\n科技已经逐渐采取行动，并提高了国际媒体的知名度。早在2003年，洛杉矶县就采取了法律行动，废除了这些条款。IBM、Microsoft、Amazon和Python平台在数据库等应用程序中使用术语“主要”和“次要”已经有一段时间了。GitHub现在正在做这件事--就实现和文档而言，这可以说比我们在音乐领域的任何东西都要复杂得多。\n说到这一点，对数据库使用“主要”和“次要”更清楚地描述了它们要描述的内容。(辅助数据库将主副本称为权威副本，这比说它们是该数据库的“奴隶”更有意义。)。\n但通常情况就是这样-放弃防御意味着让事情变得更好，你知道的。音乐也是如此-\n领头人和跟随者是时钟的简单、明确的替代品。“领导者”和“跟随者”在MIDI和其他用途的上下文中更准确地表达了时钟发生了什么。领导者开始和停止，并传递节奏，而跟随者，嗯，跟随。相比之下，“主”和“从”立即失败，因为节点可以接收和发送MIDI时钟信号-例如，许多DAW也是如此。(这是如何运作的-奴隶们有自己的奴隶？只有…。不是。)。\n是的，这指的是奴隶制。把主人和奴隶放在一起，你肯定是在谈论奴隶制，或者回到奴隶制，这样人们就知道你的意思了。\n你不用担心学期硕士这个词本身。它与掌握、大师班、大师复制品、主卧室、称年轻人为“大师”的陈旧做法、硕士学位、呃…联系在一起。万事达卡。这些术语中没有一个起源于奴隶制的实践。(我查过了。)。如果你掌握了巴松管，你就没有奴役你的巴松管。所以人们仍然会得到这个意思。\n不过，事情是这样的。虽然“主人”在英语中通常不会单独与奴隶制联系在一起，但“奴隶”这个词从来都与单词…联系在一起。奴隶。(是啊，给你个惊喜。)。永远都是奴隶制。\n提醒人们，这也不能被认为是“仅仅是美国的事情”，就像在美国有着深厚的奴隶贸易历史的美国一样，奴隶这个词来自斯拉夫。当这个词出现时，斯拉夫人是欧洲最常见的奴隶。这就是这个术语带给它的几个世纪的包袱-从不人道的做法已经背负了许多个世纪的包袱。\n雪上加霜的是，至少据我所知，在技术上使用主从的起源是在机车链条和液压缸之类的东西上。所以，是的，奴隶制在英语世界中仍然是一种广泛的法律实践，当这些术语跳到技术上时，奴隶制仍然是一种普遍的法律实践。只有当人们理解奴隶制中的主/奴关系时，它们才是可教的。\n在这一点上，你们应该都在运行以解决如何更改文档的问题，但是如果我需要指出显而易见的-。\n奴隶制是可怕的。我们不要随便提及这件事。让我们非常非常清楚地说。与某些词源不同，这不是历史上的好奇。今天，奴隶制在世界许多地方仍然是一种威胁，是一种积极而可怕的现实做法。在几乎每个主要的音乐技术市场，目前都在讨论，特别是黑人(几乎在全世界范围内)-以及土著人民和其他少数民族(在许多地方)-仍然不得不忍受普遍存在的奴隶制贸易的遗产。\n给一些平凡而技术性的东西命名--一些需要明确的东西--用一些对特定人群来说可怕的东西来命名，这是随意种族主义的本质所在。\n当然，我们所有人在谈论音乐技术、教授音乐技术或写作音乐技术时--就像我一样--都不得不使用这个词，因为它还没有被取代。从技术上讲，这样做是正确的。所以这很简单--我们换个标签。\n这种变化已经开始了。许多软件开发人员已经悄悄地开始改变他们的术语。(Ableton和Propellerhead是我见过的两个例子；我相信还有更多的例子。如果您这样做了，请让我们知道-特别是您选择了哪些术语，以及原因。)。\n有趣的是，我甚至没有注意到它在Ableton Live中没有出现，或者还有谁已经做出了改变。但我认为这就是现实-因为替代方案更加明确，甚至没有人会真正错过条款。\n我们只需要明确这一更改，使其成为事实上的标准。\n旧的标准和文档也不应该成为障碍。听着，是的，你上世纪80年代的合成器在手册中总是有“主”和“从”；硬件会把它埋在菜单里。我相信MIDI制造协会将需要一些过程来改变MIDI标准。\n但问题是，我们是否会描述它们的含义，然后解释它们的新替代品，以及我们为什么要进行这种转变？\n或者，我们是否会描述主人和奴隶在音乐技术中的意义，然后感到尴尬，为什么我们在地狱里还在使用它们？\n现在不采取行动会造成损害。这并不是说这将修复甚至帮助打击音乐技术行业的种族主义。就是现在，在现在的讨论中，如果我们不采取行动，那就是一个问题。如果我们现在错过这个机会，真的会伤害这个行业和它的用户社区。我们应该直接去做。\n可以把它想象成在跑马拉松之前伸展双腿。这只是个延伸。你哪儿也不能去。但这是很好的第一步，以确保你已经准备好参加真正的比赛。这才是最具挑战性的部分。\n对于变化：新的术语更清晰、更精确，其他科技行业已经在这么做了，音乐技术工具已经这么做了，大多数人甚至没有注意到这没什么大不了的，奴隶制是可怕的，不做任何事情，也不给少数族裔发防御性电报，他们在这个行业里不受欢迎，很可能不一定是这样的。\n这不是思想文章、讨论话题或点击诱饵--我们现在就开始吧。\n因为我知道标准最常被优柔寡断所阻碍，不过，我想再次投票给领导者和追随者，至少在描述时钟方面是这样。这似乎是一笔不错的违约。就像我说的，如果你有其他术语更清晰的情况，或者有理由让其他东西成为一个普遍的标准，那就大声说出来。(我只记得那一次，我们都未能就迷你插孔MIDI…的引脚分配达成一致)。\n不过，正如我的工程团队MeeBlip的詹姆斯(James)所指出的那样，电子产品和硬件应该使用主设备和辅助设备。这些也很清楚，它们比领导者/追随者涵盖的应用范围更广，而且因为它们以相同的首字母开头，所以您不必更改规格表等。这一点尤其重要，因为从字面上看，蚀刻到硬件中的东西并不容易改变。主/次适用于更一般的硬件情况-与从存储到其他电子互连的各种应用程序一样。\n通常情况下，我支持简单、单一的解决方案。但是，如果不同的选项增加了清晰度，那么它们也是可以的。只要我们走到一起扔掉奴隶制的标签。我怀疑未来会有一大堆充满挑战、令人不安的变化。所以让我们先来看愚蠢而简单的那个。如果我们不能做到这一点，我会非常担心的。\n现在我把这些都说出来了，让我去弄清楚为什么这个合成器仍然落后于鼓机的时钟。让我知道你们修复的进展如何。\n(如果最近几天其他人一直在这么说-很可能-让我知道，我会在这里加入你们的声音)。\n额外的脚注-男的和女的？切换到“插头”和“插座”。不过，这种更改更难，因为对于更难更改的文本，没有简单的“m”和“f”缩写。但条款更清楚了，而且…。你知道的，不那么恶心。", "note_en": "It’s not waiting for someone to be “offended.” It’s about why anyone would be  defensive about clinging to terrible terms based on horrific inhumane things. Let’s just fix this, finally.\n And yeah, right now seems like as good a time as any to stop using slavery references when you just need clear, boring technical terms. It’s not that fixing something small like language will make a larger difference. It’s that it might be good practice to begin thinking about change even with something small.\n This is language-specific, significantly (see below), but not exclusive to any one region – not even the USA, despite its particularly long and intense relationship to African slavery.\n I know it’s easy to resist change. So let me explain why I think this one is especially a no-brainer – something that could be done immediately. The fact that it triggers debate is to say, then we are taking some critical terms and evaluating exactly what they mean. Any process that does that improves the language, and whatever improves the language also makes us more effective at communicating the technology. So any debate this may trigger is far from pointless – on the contrary, it proves that language matters.\n A major disclaimer: I am a native speaker of American English. The issues with this language originate in these words  in English. As an Italian-speaking commenter observes, translating them to other languages is another matter. We have a problem here in English, and the two dominant countries speaking English – the USA and UK – have an especially ugly history in slavery and imperialism. That’s also why this whole conversation is happening in this language, which is itself problematic, but – that’s a much tougher fix. So I’ll talk about the English problem and solution, but I’d be happy to hear how people understand terminologies like “leader” and “follower” in your language, and whether we might be better learning your words and using the translation rather than simply imposing the English ones. My sense is still that this is probably better than using your language’s native terms for master and slave, or adopting the English terms directly as often happens in technological terms.\n  Main/secondary is likely the default technical replacement we need, for the simple reason that they start with the same initial letter. That means abbreviations on spec sheets and schematics, already abbreviated M and S, don’t need to be changed. And it’s still clear and generic, especially fitting cases (as with database primary/secondary) where what’s emphasized is just prioritization, not necessarily hierarchical or controller relationships/\n Conductor/follower or leader/follower works well for clock or other situations where a source sends control signal to a receiver, but most descriptive in timing scenarios. It also makes the most sense to end users for those cases. (As some readers note, directly translating “leader/follower” into German is  not something you want to do.)\n I personally find myself biased toward these terms as a teacher and writer because I think they’re the easiest to convey to beginners, and I’ve done a lot of teaching of beginners. There are good arguments  against using any anthropomorphic terms, though, and this particular pair has some unpleasant associations if you translate directly into German (though in German there are already non-slavery alternatives).\n Source / sink may be the best single solution for both physical hardware plugs and outlets and software connections. Adapted from German  Quelle and  Senke, I notice it’s also used in software like JACK (which uses a single paradigm that intuitively fits both software and imagined physical connections). Probably its only weakness is that non-technical English speakers aren’t as accustomed to using the term “sink” in this manner, though it is in the language.\n Host/client or host/guest work in networking situations, since they’re already understood and widely used (meaning it also makes no sense to suddenly swap them out for master and slave).\n Sender/receiver fits when the words describe the transmission of signal (I also see “controller”/receiver which is commonly used in MIDI for sending parameters)/\n These aren’t euphemisms, either; they carry different nuances of meaning. That says to me we didn’t need them in the first place.\n  This is not a new idea. The music tech industry, if it were to dump “master” and “slave” now, would be already late to the party. It’s not that the critique hasn’t come up – but it hasn’t translated into action. (For instance, Roberta Lamb I believe raised it in her  feminist critique of music education back in 1994, among others – someone got a JSTOR subscription handy?)\n Tech has gradually taken action, and raise international press visibility. Los Angeles County took legal action to rid itself of the terms  back in 2003. IBM, Microsoft, Amazon, and the Python platform have all used the terms “primary” and “secondary” for some time in applications like databases.  GitHub is doing it now – and that’s arguably a heck of a lot more complicated in terms of implementation and documentation than anything we have in music.\n Speaking of that, using “primary” and “secondary” for databases more clearly describes what they’re meant to describe. (The secondary databases refer to the primary copy as the authoritative one, which makes way more sense than saying they’re “slaves” of that database.)\n But that’s often the case – letting go of defensiveness means making things, you know, better. That’s true for music, too —\n Leader and  follower are easy, clear replacements for clock.  “Leader” and “follower” more accurately articulate what happens with clock in the context of MIDI and other uses. The leader initiates start and stop and transmits tempo, and the follower, well, follows. “Master” and “slave” immediately fail by contrast, because a node could both receive and transmit MIDI clock signal – as do many DAWs, for example. (How would that work – the slaves have their own slaves? Just… no.)\n Yes, this refers to slavery. Put master and slave together, and you’re definitely talking about slavery, or referring back to slavery so that people know what you mean.\n The term master on its own you don’t have to worry about. It’s associated with mastery, master classes, master copies, master bedrooms, the antiquated practice of calling young men “masters,” Masters’ degrees, uh… MasterCard. Not one of those terms originated in the practice of slavery. (I checked.) If you master the bassoon, you did not  enslave your bassoon. So people will still get this meaning.\n Here’s the thing, though. While “master” usually  isn’t associated with slavery in English when seen on its own, the word “slave” is never  not associated with the word… slave. (Yeah, surprise.) It’s always slavery.\n In a reminder that this also can’t be dismissed as “just an American thing,” as in the United States’ of America’s deep history with the slave trade, the term slave comes from Slav. The Slavs were the ones being most commonly enslaved in Europe when the word arose. That’s how many centuries of baggage this term has on it – from the many centuries of baggage the inhumane practice has.\n Adding to the trouble here, the origins of the use of master and slave in technology, at least as I could find, was in things like locomotive chaining and hydraulic cylinders. So yeah – slavery was still a widespread legal practice in the English-speaking world when the terms jumped over to technology. And they’re teachable only in reference to people understanding the master/slave relationship in slavery.\n  At this point, you should all be running to work out how to change documentation, but in case I need to point out the obvious —\n Slavery is terrible. Let’s not refer to it casually. Let’s be very, very clear. This is not a historical curiosity, as with some etymologies. Slavery is still a threat today in many places in the world, an active and horrifying real practice. And in virtually every major market in music technology, there are very present discussions about how, especially, black people (nearly worldwide) — but also indigenous people and other minorities (in many localities) — are still having to live with the legacy of widespread trade in slavery.\n Naming something mundane and technical – something that demands clarity – with something horrifically awful to a specific group of people is the very essence of casual racism.\n Of course, all of us talking about music technology or teaching it or writing about it – like me – had to use the term because it hadn’t been replaced. It was technically correct to do so. So this is easy – we change the label.\n This change has already started. Quietly, a lot of  software developers already started shifting their terminology. (Ableton and Propellerhead are two examples I’ve seen; I’m sure there are more. If you’ve done so, let us know – and in particular which terms you chose, and why.)\n The funny thing is, I didn’t even notice it wasn’t there in Ableton Live or who else had already made the change. But I think that’s the reality – because the replacements are clearer, no one will really even miss the terms.\n We just need to make this change explicit so that it becomes a de-facto standard.\n Old standards and documentation shouldn’t be an obstacle, either. Look, yeah, your 1980s synth will always have “master” and “slave” in the manual; hardware will have it buried in menus. I am sure the MIDI Manufacturing Association will have to have some process to change the MIDI standard.\n But the question is, will we describe what they mean and then explain their newer replacements and why we made the shift?\n Or will we describe what master and slave mean in music tech, then feel awkward about  why in the Hell are we still using them?\n Not acting now causes damage. It’s not that this will fix or even help fight racism in the music tech industry. It’s that right now, with the discussion this present, if we  fail to act, that’s a problem. It really would hurt the industry and its user community if we missed the chance now. We should just go do it.\n Think of it as stretching your legs before running a marathon. It’s just a stretch. You don’t go anywhere. But it’s a good first step to make sure you’re ready to get onto the actual race. And that’s the bit that will be challenging.\n   For the change: New terms are clearer and more precise, other tech sectors are doing it already, music tech tools have done it already and most people didn’t even notice meaning it’s no big deal, and  slavery is horrible, and  not doing anything or getting defensive telegraphs to minorities that they’re not really welcome in the industry, very much not necessarily in that order.\n    This is not meant to be a think piece or a discussion topic or clickbait –  let’s just do this right now, please.\n Because I know standards are most often held up by indecision, though, I want to put in my vote again for  leader and follower, at least in describing clock. It seems a good default. As I said, if you have another situation where other terms are clearer or a reason to make something else a widespread standard, sound off. (I’m just remembering that time where we all failed to agree on the pinouts for minijack MIDI…)\n As my engineering cohort James of MeeBlip points out, though, electronics and hardware should use  main and secondary. These are clear, too, they cover a broader range of applications than leader/follower, and because they conveniently start with the same initial letter, you don’t have to change spec sheets and the like. That is especially important because things literally etched into hardware are not easy to change. Main / secondary fit a more generic hardware case – as with applications ranging from storage to other electronic interconnects.\n Normally I’m for a simple, single solution. But different options are okay if they add clarity. Just so long as we come together and dump the slavery labels. I suspect there’s a whole lot of challenging, uncomfortable change ahead. So let’s get on with the stupidly easy one first. If we can’t do that, I’d be deeply worried.\n Now that all that’s off my chest, let me go figure out why this synth is still lagging behind the drum machine clock. Let me know how you all fare with the fixes.\n (if other folks have been saying this in recent days – which is likely – let me know and I’ll add your voices here)\n Bonus footnote –  male and female? Switch to “plug” and “socket.” This change is tougher, though, because there’s no easy abbreviation to ‘m’ and ‘f’ for text that is tougher to change. But the terms are clearer and … you know, less gross.", "posttime": "2020-06-16 05:32:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "音乐,case,奴隶制", "title": "观点：从音乐制作工具中删除主从术语的案例", "title_en": "Opinion: Case for removing master-slave terminology from music production tools", "transed": 1, "url": "https://cdm.link/2020/06/lets-dump-master-slave-terms/", "via": "", "real_tags": ["音乐", "case", "奴隶制"]}, {"category": "", "categoryclass": "", "imagename": "9c7a3a5804bc106e1ffdb06a9c93c866.jpeg", "infoid": 1006732, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "房屋-船-三轮车或小型两栖房屋/露营车，让您可以在陆上和水上旅行。无论是环游世界的探险，还是娱乐-深入大自然的周末出游，都是完美的选择。配备了电子辅助，这是一个轻松和有趣的乘坐，无论是在陆地上还是水上。\n《明镜周刊》设计吊杆", "note_en": "House-boat-trike or a tiny amphibious home / camper that allows you to travel over land and water. Perfect for either expeditions around the world or for recreation - a weekend getaway deep in the nature. Equipped with electric assistance it&#39;s an easy and fun ride both on land and water.\n  DESIGNBOOM  DER SPIEGEL", "posttime": "2020-06-16 05:32:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "zeltini,电子", "title": "Zeltini Z-Triton", "title_en": "Zeltini Z-Triton", "transed": 1, "url": "https://zeltini.com/en/product/z-triton/", "via": "", "real_tags": ["zeltini", "电子"]}, {"category": "", "categoryclass": "", "imagename": "6bb580b260007fb3e620dc983a37922b.jpeg", "infoid": 1006731, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国司法部和马萨诸塞州检察官办公室今天宣布，6名eBay前雇员被控领导了一场针对时事通讯编辑和出版商的网络跟踪运动，其中包括匿名向这对夫妇发送威胁信息，干扰递送-包括一盒活蟑螂，一个葬礼花圈和一个血淋淋的猪面具-以及对受害者进行秘密监视。\n45岁的詹姆斯·鲍格(James Baugh)是eBay的前高级安全与安保总监，48岁的大卫·哈维尔(David Harville)是eBay的前全球复原总监。两人均于今日被捕，并被控合谋实施网络跟踪和合谋篡改证人。美国司法部表示，卡尔的每一项指控都将被判处最高5年监禁，3年监督释放，最高25万美元罚款和恢复原状。\n一份法庭文件称，血淋淋的猪面具是万圣节面具，通过亚马逊发货。文件称，就在面具抵达受害者家中的同一天，其中一名受害者收到了一封电子邮件，报告称网上已下令将一头保存下来的胎儿猪送到受害者的家中。几天后，受害者收到了一盒蟑螂，这是从一名蟑螂饲养员和卖家那里购买的。\n美国司法部表示，被指控的目标是马萨诸塞州纳蒂克的一对夫妇，他们发布了一份在线时事通讯，涵盖电商公司，eBay高管认为这些公司对该公司持批评态度。一名据称的受害者是时事通讯的记者和编辑，而她的丈夫是出版商。在提交给美国马萨诸塞州地区法院的指控文件中，被指控的受害者的名字和他们经营的新闻网站的身份没有被确认。\n美国司法部表示，eBay的执行领导团队成员关注时事通讯的帖子，经常对时事通讯的内容和编辑报道下的匿名评论提出异议。\n据指控，这六名@eBay员工发起的大规模骚扰活动包括向纳蒂克夫妇的家中发送令人尴尬和令人不安的快递，包括一个血淋淋的猪面具、同情花圈、一本关于如何在失去配偶的情况下生存的书，以及一本活着的昆虫。pic.twitter.com/U2d1fgsLJD。\n被指控的罪行发生在2019年8月和9月。另外四名eBay前雇员今天没有被捕，但面临同样的指控。他们是32岁的斯蒂芬妮·波普(Stephanie Popp)，eBay前全球情报高级经理；26岁的斯蒂芬妮·斯托克韦尔(Stephanie Stockwell)，前eBay全球情报中心(GIC)经理；26岁的维罗妮卡·泽亚(Veronica Zea)，前eBay合同工，曾在GIC担任情报分析师；以及布莱恩·吉尔伯特(Brian Gilbert)，51岁，曾任eBay全球安全团队特别行动高级经理。哈维尔来自纽约市，而其他五名被告来自加利福尼亚州。\n司法部的公告称，2019年8月，在时事通讯发表了一篇关于eBay诉讼的文章后，eBay的两名高管领导班子成员发送或转发了短信，暗示是时候撤下时事通讯的编辑了。根据指控文件，一位未透露姓名的eBay高管发给另一位高管的另一条信息称，我们将粉碎这位女士。\n司法部表示，在这条“拿下”的信息之后，六名被告发起了一场由三部分组成的骚扰运动。第一阶段包括匿名投递，比如一个血淋淋的猪万圣节面具，一个葬礼花圈，一本关于在失去配偶后幸存下来的书，以及色情作品--最后一批寄给时事通讯的出版商，但寄给了他的邻居家。\n作为第二阶段运动的一部分，据称一些被告在Twitter上私下发布消息和公开推文，批评时事通讯的内容，并威胁要探望纳蒂克的受害者。(指控)文件称，鲍格、吉尔伯特、波普和另一名eBay安全员工计划将这些信息变得越来越令人不安，最终导致受害者(即公布他们的家庭地址)。据称，正是同一个组织当时打算让前圣克拉拉警长吉尔伯特与受害者接洽，提出帮助阻止被告秘密造成的骚扰，以努力促进对eBay的善意，在时事通讯中产生更有利的报道，并查明匿名评论背后的个人。\n第三，被告涉嫌对编辑/出版商夫妇进行监视。司法部表示，在以参加软件开发会议为借口前往波士顿后，鲍威、哈维尔和泽亚(后来的波普)据称多次驱车前往受害者位于纳蒂克的家中，哈维尔和鲍曾一度打算闯入受害者的车库，并在他们的汽车上安装GPS跟踪装置。为了以防万一被当地警方拦截，包和哈维尔据称携带了虚假文件，声称他们正在调查受害者，因为他们是威胁eBay高管的相关人员。然而，受害者发现了监控，并通知了纳蒂克警方，后者开始调查。警方得知Zea租用了被告的一辆车，并向eBay寻求帮助。\n在指控文件中引用的私人信息中，鲍据称称时事通讯记者是这样一个婊子，并写道这些人都是人渣。\neBay今天发表声明称，接到执法部门通知后，立即展开全面调查。eBay表示，作为调查的结果，eBay于2019年9月解雇了所有涉案员工，其中包括该公司的前首席公关官。\neBay进一步表示，它不容忍这种行为，并向受影响的个人道歉，并对他们遭受的这种行为表示遗憾。\n事件发生时，德文·维尼格是eBay的首席执行官，并于2019年9月离开公司。eBay说，其内部调查发现，虽然维尼格的通信内容不恰当，但没有证据表明他事先知道或授权了后来针对这位博客作者和她丈夫的行动。然而，正如该公司之前宣布的那样，导致他离开公司的原因是多方面的。\n9月份，eBay的CEO变动公告称，德文和董事会都认为，此时新的CEO对公司最有利。“洛杉矶时报”(The Los Angeles Times)当时报道称，维尼格在未能发展eBay的市场平台后被解雇，并与董事会就不想出售分类广告业务发生了冲突。在此之前，“洛杉矶时报”(Los Angeles Times)报道称，维尼格在未能发展eBay的市场平台后被解雇，并与董事会就不想出售分类广告业务发生了冲突。", "note_en": "Six former eBay employees were &#34;charged with leading a cyberstalking campaign&#34; against a newsletter editor and publisher, which &#34;included sending the couple anonymous, threatening messages, disturbing deliveries—including a box of live cockroaches, a funeral wreath, and a bloody pig mask—and conducting covert surveillance of the victims,&#34; the US Department of Justice and US Attorney&#39;s Office in Massachusetts  announced today.\n James Baugh, 45, is eBay&#39;s former senior director of safety and security, and David Harville, 48, is eBay&#39;s former director of global resiliency—both were arrested today and charged with conspiracy to commit cyberstalking and conspiracy to tamper with witnesses. Each charge &#34;carr[ies] a sentence of up to five years in prison, three years of supervised release, a fine of up to $250,000 and restitution,&#34; the DOJ said.\n The bloody pig mask was a Halloween mask and shipped via Amazon.com, a court document said. The mask arrived at the victims&#39; home the same day one of the victims &#34;received an email reporting that a &#39;Preserved Fetal Pig&#39; had been ordered online to be sent to the Victims&#39; house,&#34; the document said. A few days later, the victims &#34;received a box of cockroaches&#34; that was purchased from a roach breeder and seller.\n The alleged targets were a couple in Natick, Massachusetts, who publish an online newsletter that covers e-commerce companies and which &#34;eBay executives viewed as critical of the company,&#34; the DOJ said. One alleged victim is a reporter and editor for the newsletter, while her husband is the publisher. The alleged victims&#39; names and the news website they operate are not identified in the  charging documents filed in US District Court for the District of Massachusetts.\n &#34;Members of the executive leadership team at eBay followed the newsletter&#39;s posts, often taking issue with its content and the anonymous comments underneath the editor&#39;s stories,&#34; the DOJ said.\n As alleged, the extensive harassment campaign launched by these six @eBayemployees included sending embarrassing &amp; disturbing deliveries to the Natick couple&#39;s home, including a bloody pig mask, sympathy wreath, a book on how to survive the loss of a spouse, &amp; live insects.  pic.twitter.com/U2d1fgsLJD\n  The alleged crimes took place in August and September 2019. Four other former eBay employees weren&#39;t arrested today but face the same charges. They are Stephanie Popp, 32, eBay&#39;s former senior manager of global intelligence; Stephanie Stockwell, 26, former manager of eBay&#39;s Global Intelligence Center (GIC); Veronica Zea, 26, a former eBay contractor who worked as an intelligence analyst in the GIC; and Brian Gilbert, 51, a former senior manager of special operations for eBay&#39;s Global Security Team. Harville is from New York City while the other five defendants are from California.\n &#34;It is alleged that in August 2019, after the newsletter published an article about litigation involving eBay, two members of eBay&#39;s executive leadership team sent or forwarded text messages suggesting that it was time to &#39;take down&#39; the newsletter&#39;s editor,&#34; the DOJ announcement said. Another message from one unnamed eBay executive to another said &#34;we are going to crush this lady,&#34; according to the charging document.\n The &#34;take down&#34; message was followed by a three-part harassment campaign by the six defendants, the DOJ said. The first phase included anonymous deliveries such as &#34;a bloody pig Halloween mask, a funeral wreath, a book on surviving the loss of a spouse, and pornography—the last of these addressed to the newsletter&#39;s publisher but sent to his neighbors&#39; homes.&#34;\n  As part of the second phase of the campaign, some of the defendants allegedly sent private Twitter messages and public tweets criticizing the newsletter&#39;s content and threatening to visit the victims in Natick. The [charging] documents allege that Baugh, Gilbert, Popp and another eBay security employee planned these messages to become increasingly disturbing, culminating with &#34;doxing&#34; the victims (i.e., publishing their home address). It is alleged that the very same group intended then to have Gilbert, a former Santa Clara police captain, approach the victims with an offer to help stop the harassment that the defendants were secretly causing, in an effort to promote good will towards eBay, generate more favorable coverage in the newsletter, and identify the individuals behind the anonymous comments.\n Thirdly, the defendants allegedly conducted surveillance of the editor/publisher couple. After registering for a software-development conference as a pretext to go to Boston, &#34;Baugh, Harville, and Zea (and later Popp) allegedly drove to the victims&#39; home in Natick several times, with Harville and Baugh intending at one point to break into the victims&#39; garage and install a GPS tracking device on their car,&#34; the DOJ said. &#34;As protection in the event they were stopped by local police, Baugh and Harville allegedly carried false documents purporting to show that they were investigating the victims as &#39;Persons of Interest&#39; who had threatened eBay executives. The victims spotted the surveillance, however, and notified the Natick police, who began to investigate. The police learned that Zea had rented one of the cars used by the defendants and reached out to eBay for assistance.&#34;\n In private messages cited in the charging documents, Baugh allegedly called the newsletter reporter &#34;such a cunt&#34; and wrote that &#34;these people are scum.&#34;\n  eBay issued a  statement today saying that it &#34;immediately launched a comprehensive investigation&#34; upon being notified by law enforcement. &#34;As a result of the investigation, eBay terminated all involved employees, including the company&#39;s former Chief Communications Officer, in September 2019,&#34; eBay said.\n eBay further said that it &#34;does not tolerate this kind of behavior&#34; and &#34;apologizes to the affected individuals and is sorry that they were subjected to this.&#34;\n Devin Wenig was the CEO of eBay at the time of the incidents and left the company in September 2019. eBay said that its &#34;internal investigation found that, while Mr. Wenig&#39;s communications were inappropriate, there was no evidence that he knew in advance about or authorized the actions that were later directed toward the blogger and her husband. However, as the company previously announced, there were a number of considerations leading to his departure from the company.&#34;\n In September, eBay&#39;s CEO-change  announcement said that &#34;both Devin and the Board believe that a new CEO is best for the company at this time.&#34; The Los Angeles Times  reported then that &#34;Wenig was fired after he failed to grow eBay&#39;s marketplace platform and clashed with the board about not wanting to sell the classifieds business.&#34;", "posttime": "2020-06-16 05:31:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "面具,execs,ebay", "title": "联邦政府称，eBay高管送来蟑螂和“血淋淋的猪面具”骚扰记者", "title_en": "eBay execs sent roaches and “bloody pig mask” to harass journalists, feds say", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/06/ebay-execs-sent-cockroaches-and-bloody-pig-mask-to-harass-journalists-feds/", "via": "", "real_tags": ["面具", "execs", "ebay"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006730, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们已与Jefferies LLC或Jefferies签订了公开市场销售协议SM或销售协议，日期为2020年6月15日，与出售本招股说明书附录提供的普通股有关。根据销售协议的条款，根据本招股说明书补充条款，我们可以通过杰富瑞作为我们的代理，不时提供和出售我们的普通股，每股面值0.01美元，总发行价高达500.0美元。\n根据本招股说明书附录出售我们的普通股(如果有的话)将按照1933年“证券法”(经修订)或“证券法”下第415(A)(4)条规定的“按市场发售”的任何允许的方式进行，包括直接或通过纽约证券交易所(NYSE)或我们普通股的任何其他现有交易市场进行的销售。杰富瑞不需要销售任何具体金额，但将作为我们的销售代理，使用与其正常交易和销售实践一致的商业合理努力。不存在以任何第三方托管、信托或类似安排接收资金的安排。\nJefferies将有权获得佣金，佣金率最高为根据销售协议出售的每股销售总价的3.0%。有关支付给Jefferies的赔偿的更多信息，请参阅S-14页开始的“分配计划”。\n在代表我们出售普通股方面，Jefferies可能被视为证券法意义上的“承销商”，Jefferies的补偿可能被视为承销佣金或折扣。我们还同意就某些责任(包括证券法下的责任)向杰富瑞提供赔偿和贡献。\n我们的普通股在纽约证券交易所交易，代码是“HTZ”。2020年6月12日，据纽约证券交易所报道，我们普通股的最后售价为每股2.83美元。\n我们正在根据“美国法典”第11章、“美国法典”第11章或“破产法”第11章进行重组，这已经并可能继续导致我们的普通股价值下降，或者可能使我们的普通股一文不值。\n投资我们的普通股涉及很高的风险。请参阅本招股说明书增刊S-4页开始的“风险因素”。\n美国证券交易委员会和任何国家证券委员会均未批准或不批准本招股说明书副刊或随附的招股说明书提供的证券，也未确定本招股说明书副刊或随附的招股说明书是否真实或完整。任何与此相反的陈述都是刑事犯罪。\n本文档由两部分组成。第一部分是本次招股说明书副刊，介绍了本次发行的具体条款。第二部分是随附的招股说明书，这是我们向SEC提交的注册声明的一部分，我们使用的是“搁置”注册过程。随附的招股说明书描述了更多一般性信息，其中一些可能不适用于此次发行。根据这一搁置登记程序，我们可以根据本招股说明书补充条款不时出售总发行价高达500.0美元的普通股，价格和条款将由发售时的市场条件决定。\n在购买我们提供的任何普通股之前，我们敦促您仔细阅读本招股说明书附录和随附的招股说明书，以及通过引用结合在此的所有信息，以及在“在哪里可以找到更多信息”和“通过引用合并”标题下描述的附加信息。这些文件包含您在做出投资决策时应考虑的重要信息。\n一方面，本招股说明书附录中包含的信息与随附的招股说明书或通过引用并入本招股说明书附录中的任何文档中包含的信息之间存在冲突，另一方面，您应依赖本招股说明书附录中的信息，前提是如果其中一个文档中的任何陈述与另一个日期较晚的文档中的陈述不一致，例如，通过引用并入本招股说明书附录 - 中的文档中的陈述将修改或取代较晚日期的文档中的陈述。\n我们没有授权任何人提供本招股说明书和我们提交给证券交易委员会的任何相关免费写作招股说明书中包含或通过引用并入的任何信息。我们没有授权任何人向您提供不同的信息，Jefferies也没有授权。我们对他人可能提供给您的任何其他信息的可靠性不承担任何责任，也不能提供任何保证。在任何情况下，本招股说明书附录不构成出售或邀约购买本招股说明书附录所述证券以外的任何证券的要约，也不构成出售或邀约购买此类证券的要约。您应假设本招股说明书附录中的信息、以引用方式并入的文件以及任何相关的自由写作招股说明书中的信息仅在其各自的日期是准确的。自那些日期以来，我们的业务、财务状况、运营结果和前景可能发生了重大变化。\n您还应阅读并考虑我们在本招股说明书附录标题为“您可以找到更多信息的地方”和“通过引用合并”部分向您推荐的文件中的信息。\n除非另有说明或上下文另有要求，否则本招股说明书附录中提及的“公司”、“我们”或类似术语均指特拉华州赫兹全球控股公司(不包括其子公司)，除非上下文另有要求或指示。\n在本招股说明书附录和随附的招股说明书以及我们随后向证券交易委员会提交的10-K和10-Q表格以及8-K表格中提交或提供的报告中，以及我们管理层的相关评论中包含或引用的某些陈述包括“前瞻性陈述”。前瞻性陈述包括有关我们的流动性和我们未来可能或假设的经营结果的信息，包括对我们业务战略的描述。这些陈述通常包括诸如“相信”、“预期”、“项目”、“潜在”、“预期”、“打算”、“计划”、“估计”、“寻求”、“将会”、“可能”、“将会”、“应该”、“可能”、“可能”、“预测”或类似的表达方式。这些陈述是基于我们根据我们在该行业的经验以及我们对历史趋势、当前状况、预期未来发展的看法以及我们认为在这些情况下合适的其他因素而做出的某些假设。我们相信这些判断是合理的，但您应该明白，这些陈述并不是对业绩或结果的保证，由于各种积极和消极的重要因素，我们的实际结果可能与前瞻性陈述中表达的结果大不相同。\n可能影响我们的实际结果并导致它们与前瞻性陈述中表达的结果大不相同的重要因素包括，除其他外，可能在随后提交给证券交易委员会的报告中不时披露的那些DES\n第十一章重组的效果和一般诉讼结果；\n旅行需求水平，特别是美国和全球市场的商务和休闲旅行；\n新冠肺炎病毒性疾病(“新冠肺炎”)大流行的持续时间和严重程度，以及旅行限制和业务关闭或中断对我们的汽车租赁业造成的影响；\n新冠肺炎大流行对全球和区域经济及经济因素的影响，以及为应对大流行所采取的行动；\n当新冠肺炎疫情消退时，总体经济不确定性和经济复苏的步伐，包括主要的全球市场；\n我们有能力成功重组我们的巨额债务，获得进一步的豁免或容忍，或筹集额外资本；\n我们有能力在二手车市场上处置车辆，利用这类销售的收益购买新车，并减少剩余风险的风险敞口；\n债权人对出租汽车经营活动中使用的车辆可以采取的行动；\n竞争环境的重大变化，以及市场竞争对租赁量和定价的影响，包括对我们的定价政策或激励措施的使用的影响；\n我们有能力准确估计未来的租赁活动水平，并相应地调整租赁业务中使用的车辆数量和组合；\n我们有能力维持充足的流动资金，为我们的创收工具提供额外或持续的融资来源，并为我们现有的债务进行再融资；\n与我们的债务有关的风险，包括我们的巨额债务、我们承担更多债务的能力、我们几乎所有的综合资产都保证了我们的某些未偿债务以及利率或借款利润率的增加；\n我们有能力履行我们的高级信贷安排和信用证安排、我们的未偿还无担保优先票据、我们尚未偿还的高级第二优先担保票据以及某些资产支持和基于资产的安排中所载的财务和其他契诺；\n我们进入金融市场的能力，包括通过发行资产支持证券为我们的车队融资；\n我们在不利的经济周期和不利的外部事件(包括战争、恐怖主义行为、自然灾害和流行病)期间维持运营的能力；\n我们有能力防止我们拥有的信息被滥用或窃取，包括由于网络安全漏洞和其他安全威胁而造成的滥用或窃取；\n我们有能力购买足够的有竞争力的车辆供应，以及与我们购买的车辆成本增加有关的风险；\n我们车辆制造商的财务不稳定，这可能会影响他们履行回购或保证折旧计划下的义务的能力；\n车辆成本增加或租赁活动中断，特别是在我们的高峰期，原因是我们的车辆制造商进行了安全召回；\n与在许多不同国家开展业务相关的风险，包括违反或涉嫌违反适用的反腐败或反贿赂法律的风险，我们从非美国分支机构汇回现金而不会产生不利税收后果的能力，我们对外币汇率波动的风险敞口，以及我们在英国退出欧盟后有效管理我们国际业务的能力；\n与诉讼和调查相关的成本和风险，或任何未能或无法遵守法律法规或法律法规环境的任何变化，包括与环境问题、消费者隐私和数据安全相关的法律法规；\n我们有能力维持我们在美国和国际机场的租赁和车辆租赁优惠网络；\n我们有能力保持有效的员工留任和人才管理战略，以及由此导致的人事和员工关系的变化；\n改变或采纳政府、机构和类似组织的现有法律、法规、政策或其他活动，这些行动可能影响我们的运营、成本或适用税率；\n与我们的递延税项资产有关的风险，包括根据修订后的1986年“国税法”“所有权变更”的风险；\n会计原则的改变，或其应用或诠释，以及我们作出准确估计的能力，以及估计背后的假设，这可能会影响经营业绩；以及。\n我们在提交给证券交易委员会的定期和当前报告中不时描述的其他风险和不确定性。\n你不应该过分依赖前瞻性陈述。所有归因于我们或代表我们行事的人的前瞻性陈述都明确地受到前述警告性声明的限制。\n所有这些陈述仅在作出之日发表，除法律要求外，我们没有义务公开更新或修改任何前瞻性陈述，无论是由于新信息、未来事件或其他原因。\n本摘要重点介绍了本招股说明书附录和随附的招股说明书以及我们通过引用并入的文件中包含的精选信息。此摘要不包含您在做出投资决策之前应考虑的所有信息。阁下应仔细阅读本招股说明书增刊，尤其是本招股说明书增刊S-4页开始的“风险因素”一节所讨论的与本次发售相关的风险，以及其他风险因素、我们的合并财务报表和该等合并财务报表的附注，以及本招股说明书增刊中引用的其他信息。\n我们于2015年在特拉华州注册成立，作为租车中级控股公司(Rental Car Intermediate Holdings，LLC)的顶级控股公司，该公司全资拥有我们的主要运营公司赫兹公司(Hertz Corporation)。赫兹公司于1967年在特拉华州成立，是自1918年以来一直从事车辆租赁和租赁业务的公司的继任者。\n我们主要通过赫兹、美元和节俭品牌在全球经营我们的车辆租赁业务，这些品牌来自美国、非洲、亚洲、澳大利亚、加拿大、加勒比海地区、欧洲、拉丁美洲、中东和新西兰的公司所有、被许可人和特许经营商。通过我们的多伦子公司，我们提供车辆租赁和车队管理服务。\n我们根据我们的运营部门提供的产品和服务以及我们的运营部门开展业务的地理区域确定了三个可报告的部门，如下所示：\n美国RAC - 汽车租赁，以及增值服务在美国的销售；\n国际RAC - 汽车租赁和租赁，以及增值服务的国际销售；以及。\n所有其他业务 - 主要由我们的多伦业务组成，该业务提供车辆租赁和车队管理服务，以及其他业务活动。\n除了上述可报告的部门外，我们还有公司业务。我们根据运营部门的财务信息评估业绩并分配资源。\n于2020年5月22日，我们、赫兹公司以及我们在美国和加拿大的若干直接和间接子公司(但不包括但不限于：(I)赫兹国际有限公司、赫兹控股荷兰公司(“赫兹荷兰”)以及位于美国和加拿大以外的直接和间接子公司(“国际子公司”)和(Ii)赫兹车辆融资有限责任公司、赫兹车辆融资II LP、赫兹船队租赁融资有限公司和某些其他车辆融资子公司(统称“非。根据“破产法”第11章向特拉华州地区的美国破产法院(“破产法院”)提出的“请愿书”，从而启动了破产管理人的第11章案件。债务人破产法第11章的案件(“破产法第11章案件”)是在“在赫兹公司等人案中，案件编号20-11218(MFW)”的标题下为程序目的而共同管理的。\n债务人继续在破产法院的管辖下，按照破产法的适用条款和破产法院的命令，以“占有债务人”的身份经营业务。债务人已获得多项“首日”动议的批准，这些动议载有惯常的济助，目的是确保债务人有能力继续其正常运作。除其他事项外，将于2020年6月25日举行听证会，最终批准债务人的“第一天”动议。\n提交请愿书构成违约事件，加速了债务人在某些债务工具下的义务，并触发了非债务人融资子公司和其他债务的某些义务下的违约、终止事件和摊销事件，该等事件导致某些其他债务工具(包括某些Debtor‘International子公司的某些债务工具)下的违约、摊销事件和加速(视情况而定)。在提交请愿书后，债务人立即开始将破产申请通知所有已知的现有或潜在债权人。尽管我们的某些债务工具下发生了这些事件，但破产法第11章的案件导致的自动中止阻止了债务人的车队租赁的终止，债务人不需要清算其车队，他们可以在其运营中继续使用现有的车队，并在符合破产法适用条款的情况下保持对该等车辆的处置的控制。\n2020年5月26日，我们收到了纽约证券交易所法规公司工作人员的一封信。(“纽约证券交易所规则”)声明，它已决定启动程序，将我们的普通股从纽约证券交易所退市。纽约证券交易所监管部门在我们于2020年5月22日披露我们已根据破产法第11章开始自愿申请重组后，根据纽约证券交易所上市公司手册第802.01D节做出了不再适合上市的决定。我们已及时对裁决提出上诉，并要求在纽约证券交易所举行听证会。目前，我们的普通股将继续在纽约证券交易所上市和交易，等待此类上诉的解决。我们不能对上诉的最终解决提供任何保证。\n我们的主要执行办公室位于佛罗里达州埃斯特罗市威廉姆斯大道8501号，邮编为33928，电话号码是(239301-7000000)。我们的网址是www.hertz.com。本公司网站所载或可透过本公司网站查阅的资料并非本招股章程增刊的一部分，亦不会以引用方式并入本招股章程增刊内，阁下不应将其视为本招股章程增刊的一部分。\n最多318,972,555股普通股，假设本次发售中出售176,678,445股我们的普通股，发行价为每股2.83美元，这是我们的普通股在。\n..", "note_en": "We have entered into an Open Market Sale Agreement SM , or sales agreement, with Jefferies LLC, or Jefferies, dated June 15, 2020, relating to the sale of our common stock offered by this prospectus supplement. In accordance with the terms of the sales agreement, under this prospectus supplement we may offer and sell our common stock, par value $0.01 per share, having an aggregate offering price of up to $500.0 million from time to time through Jefferies, acting as our agent.\n  Sales of our common stock, if any, under this prospectus supplement will be made by any method permitted that is deemed an “at the market offering” as defined in Rule 415(a)(4) under the Securities Act of 1933, as amended, or the Securities Act, including sales made directly on or through The New York Stock Exchange, or NYSE, or any other existing trading market for our common stock. Jefferies is not required to sell any specific amount, but will act as our sales agent using commercially reasonable efforts consistent with its normal trading and sales practices. There is no arrangement for funds to be received in any escrow, trust or similar arrangement.\n  Jefferies will be entitled to compensation at a commission rate of up to 3.0% of the gross sales price per share sold under the sales agreement. See “Plan of Distribution” beginning on page    S-14  for additional information regarding the compensation to be paid to Jefferies.\n  In connection with the sale of the common stock on our behalf, Jefferies may be deemed to be an “underwriter” within the meaning of the Securities Act and the compensation of Jefferies may be deemed to be underwriting commissions or discounts. We have also agreed to provide indemnification and contribution to Jefferies with respect to certain liabilities, including liabilities under the Securities Act.\n  Our common stock trade on the NYSE under the symbol “HTZ.” On June 12, 2020, the last sale price of our common stock as reported on the NYSE was $2.83 per share.\n  We are in the process of a reorganization under chapter 11 of title 11, or Chapter 11, of the United States Code, or Bankruptcy Code, which has caused and may continue to cause our common stock to decrease in value, or may render our common stock worthless.\n  Investing in our common stock involves a high degree of risk. See “Risk Factors” beginning on page    S-4  of this prospectus supplement.\n    Neither the Securities and Exchange Commission nor any state securities commission has approved or disapproved of the securities being offered by this prospectus supplement or accompanying prospectus, or determined if this prospectus supplement or accompanying prospectus is truthful or complete. Any representation to the contrary is a criminal offense.\n    This document consists of two parts. The first part is this prospectus supplement, which describes the specific terms of this offering. The second part is the accompanying prospectus, which is part of a registration statement that we filed with the SEC using a “shelf” registration process. The accompanying prospectus describes more general information, some of which may not apply to this offering. Under this shelf registration process, we may from time to time sell our common stock having an aggregate offering price of up to $500.0 million under this prospectus supplement at prices and on terms to be determined by market conditions at the time of the offering.\n  Before buying any of the common stock that we are offering, we urge you to carefully read both this prospectus supplement and the accompanying prospectus together with all of the information incorporated by reference herein, as well as the additional information described under the headings “Where You Can Find More Information” and “Incorporation by Reference.” These documents contain important information that you should consider when making your investment decision.\n  To the extent there is a conflict between the information contained in this prospectus supplement, on the one hand, and the information contained in the accompanying prospectus or in any document incorporated by reference in this prospectus supplement, on the other hand, you should rely on the information in this prospectus supplement, provided that if any statement in one of these documents is inconsistent with a statement in another document having a later date — for example, a document incorporated by reference in this prospectus supplement — the statement in the document having the later date modifies or supersedes the earlier statement.\n  We have not authorized anyone to provide any information other than that contained in or incorporated by reference in this prospectus and any related free writing prospectus filed by us with the SEC. We have not, and Jefferies has not, authorized anyone to provide you with different information. We take no responsibility for, and can provide no assurance as to the reliability of any other information that others may give you. This prospectus supplement does not constitute an offer to sell or the solicitation of an offer to buy any securities other than the securities described in this prospectus supplement or an offer to sell or the solicitation of an offer to buy such securities in any circumstances in which such offer or solicitation is unlawful. You should assume that the information appearing in this prospectus supplement, the documents incorporated by reference and any related free writing prospectus is accurate only as of their respective dates. Our business, financial condition, results of operations and prospects may have changed materially since those dates.\n  You should also read and consider the information in the documents to which we have referred you in the sections entitled “Where You Can Find More Information” and “Incorporation by Reference” in this prospectus supplement.\n  Unless otherwise indicated or the context otherwise requires, all references in this prospectus supplement to the “Company,” “we,” “our,” “ours,” “us” or similar terms refer to Hertz Global Holdings, Inc., a Delaware corporation, excluding its subsidiaries, unless the context otherwise requires or indicates.\n    Certain statements contained or incorporated by reference in this prospectus supplement and the accompanying prospectus and in reports we subsequently file with the SEC on Forms 10-K and 10-Q and file or furnish on Form 8-K, and in related comments by our management, include “forward-looking statements.” Forward-looking statements include information concerning our liquidity and our possible or assumed future results of operations, including descriptions of our business strategies. These statements often include words such as “believe,” “expect,” “project,” “potential,” “anticipate,” “intend,” “plan,” “estimate,” “seek,” “will,” “may,” “would,” “should,” “could,” “forecasts” or similar expressions. These statements are based on certain assumptions that we have made in light of our experience in the industry as well as our perceptions of historical trends, current conditions, expected future developments and other factors we believe are appropriate in these circumstances. We believe these judgments are reasonable, but you should understand that these statements are not guarantees of performance or results, and our actual results could differ materially from those expressed in the forward-looking statements due to a variety of important factors, both positive and negative.\n  Important factors that could affect our actual results and cause them to differ materially from those expressed in forward-looking statements include, among others, those that may be disclosed from time to time in subsequent reports filed with or furnished to the SEC, those described under “Item 1A — Risk Factors” included in our 2019 Form 10-K and the Quarterly Report on Form 10-Q for the quarter ended March 31, 2020 and the following, which were derived in part from the risks set forth in “Item 1A — Risk Factors” of our 2019 Form 10-K and our Quarterly Report on Form 10-Q for the quarter ended March 31, 2020:\n    the effects of the Chapter 11 reorganization and the outcome of the proceedings in general;\n            levels of travel demand, particularly with respect to business and leisure travel in the United States and in global markets;\n      the length and severity of the COVID-19 viral disease (“COVID-19”) pandemic and the impact on our vehicle rental business as a result of travel restrictions and business closures or disruptions;\n      the impact of the COVID-19 pandemic and actions taken in response to the pandemic on global and regional economies and economic factors;\n      general economic uncertainty and the pace of economic recovery, including in key global markets, when the COVID-19 pandemic subsides;\n      our ability to successfully restructure our substantial indebtedness, obtain further waivers or forbearance or raise additional capital;\n            our ability to dispose of vehicles in the used-vehicle market, use the proceeds of such sales to acquire new vehicles and to reduce exposure to residual risk;\n      actions creditors may take with respect to the vehicles used in the rental car operations;\n      significant changes in the competitive environment and the effect of competition in our markets on rental volume and pricing, including on our pricing policies or use of incentives;\n            our ability to accurately estimate future levels of rental activity and adjust the number and mix of vehicles used in our rental operations accordingly;\n            our ability to maintain sufficient liquidity and the availability to us of additional or continued sources of financing for our revenue earning vehicles and to refinance our existing indebtedness;\n      risks related to our indebtedness, including our substantial amount of debt, our ability to incur substantially more debt, the fact that substantially all of our consolidated assets secure certain of our outstanding indebtedness and increases in interest rates or in our borrowing margins;\n      our ability to meet the financial and other covenants contained in our senior credit facilities and letter of credit facilities, our outstanding unsecured senior notes, our outstanding senior second priority secured notes and certain asset-backed and asset-based arrangements;\n      our ability to access financial markets, including the financing of our vehicle fleet through the issuance of asset-backed securities;\n            our ability to sustain operations during adverse economic cycles and unfavorable external events (including war, terrorist acts, natural disasters and epidemic disease);\n      our ability to prevent the misuse or theft of information we possess, including as a result of cyber security breaches and other security threats;\n  our ability to purchase adequate supplies of competitively priced vehicles and risks relating to increases in the cost of the vehicles we purchase;\n            financial instability of the manufacturers of our vehicles, which could impact their ability to fulfill obligations under repurchase or guaranteed depreciation programs;\n      an increase in our vehicle costs or disruption to our rental activity, particularly during our peak periods, due to safety recalls by the manufacturers of our vehicles;\n                        risks associated with operating in many different countries, including the risk of a violation or alleged violation of applicable anticorruption or antibribery laws, our ability to repatriate cash from non-U.S. affiliates without adverse tax consequences, our exposure to fluctuations in foreign currency exchange rates and our ability to effectively manage our international operations after the United Kingdom’s withdrawal from the European Union;\n                  costs and risks associated with litigation and investigations or any failure or inability to comply with laws and regulations or any changes in the legal and regulatory environment, including laws and regulations relating to environmental matters and consumer privacy and data security;\n      our ability to maintain our network of leases and vehicle rental concessions at airports in the U.S. and internationally;\n            our ability to maintain an effective employee retention and talent management strategy and resulting changes in personnel and employee relations;\n      changes in the existing, or the adoption of new laws, regulations, policies or other activities of governments, agencies and similar organizations, where such actions may affect our operations, the cost thereof or applicable tax rates;\n      risks relating to our deferred tax assets, including the risk of an “ownership change” under the Internal Revenue Code of 1986, as amended;\n                        changes in accounting principles, or their application or interpretation, and our ability to make accurate estimates and the assumptions underlying the estimates, which could have an effect on operating results; and\n      other risks and uncertainties described from time to time in periodic and current reports that we file with the SEC.\n    You should not place undue reliance on forward-looking statements. All forward-looking statements attributable to us or persons acting on our behalf are expressly qualified in their entirety by the foregoing cautionary statements.\n  All such statements speak only as of the date made, and, except as required by law, we undertake no obligation to update or revise publicly any forward-looking statements, whether as a result of new information, future events or otherwise.\n  This summary highlights selected information contained elsewhere in this prospectus supplement and the accompanying prospectus and in the documents we incorporate by reference. This summary does not contain all of the information you should consider before making an investment decision. You should read this entire prospectus supplement carefully, especially the risks related to this offering discussed under “Risk Factors” beginning on page    S-4  of this prospectus supplement, along with the other risk factors, our consolidated financial statements and notes to those consolidated financial statements and the other information incorporated by reference in this prospectus supplement.\n    We were incorporated in Delaware in 2015 to serve as the top-level holding company for Rental Car Intermediate Holdings, LLC, which wholly owns The Hertz Corporation, our primary operating company. The Hertz Corporation was incorporated in Delaware in 1967 and is a successor to corporations that have been engaged in the vehicle rental and leasing business since 1918.\n  We operate our vehicle rental business globally primarily through the Hertz, Dollar and Thrifty brands from company-owned, licensee and franchisee locations in the United States (“U.S.”), Africa, Asia, Australia, Canada, the Caribbean, Europe, Latin America, the Middle East and New Zealand. Through our Donlen subsidiary, we provide vehicle leasing and fleet management services.\n    We have identified three reportable segments, which are organized based on the products and services provided by our operating segments and the geographic areas in which our operating segments conduct business, as follows:\n    U.S. RAC — Rental of vehicles, as well as sales of value-added services, in the U.S.;\n      International RAC — Rental and leasing of vehicles, as well as sales of value-added services, internationally; and\n      All Other Operations — Comprised primarily of our Donlen business, which provides vehicle leasing and fleet management services, and other business activities.\n    In addition to the above reportable segments, we have corporate operations. We assess performance and allocate resources based upon the financial information for our operating segments.\n    On May 22, 2020, we, The Hertz Corporation and certain of our direct and indirect subsidiaries in the United States and Canada (but excluding, without limitation, (i) Hertz International Limited, Hertz Holdings Netherlands BV (“Hertz Netherlands”) and the direct and indirect subsidiary companies located outside of the United States and Canada (the “International Subsidiaries”) and (ii) Hertz Vehicle Financing LLC, Hertz Vehicle Financing II LP, Hertz Fleet Lease Funding LP and certain other vehicle financing subsidiaries (collectively the “Non-Debtor Financing Subsidiaries”)) (collectively, the “Debtors”), filed voluntary petitions for relief (collectively, the “Petitions”) under Chapter 11 of the Bankruptcy Code in the United States Bankruptcy Court for the District of Delaware (the “Bankruptcy Court”), thereby commencing Chapter 11 cases for the Debtors. The Debtors’ Chapter 11 cases (the “Chapter 11 Cases”) are being jointly administrated for procedural purposes under the caption “In re The Hertz Corporation, et al., Case No. 20-11218 MFW).”\n  The Debtors continue to operate their business as “debtors-in-possession” under the jurisdiction of the Bankruptcy Court and in accordance with the applicable provisions of the Bankruptcy Code and orders of the Bankruptcy Court. The Debtors have obtained approval of a variety of “first day” motions containing customary relief intended to assure the Debtors’ ability to continue their ordinary course operations. A hearing to consider, among other things, final approval of the Debtors’ “first day” motions has been scheduled for June 25, 2020.\n  The filing of the Petitions constituted an event of default that accelerated the Debtors’ obligations under certain debt instruments and triggered defaults, termination events and amortization events under certain obligations of the Non-Debtor Financing Subsidiaries and other indebtedness, and such events caused defaults, amortization events and accelerations, as applicable, under certain other debt instruments, including under certain debt instruments of certain of the Debtors’ International Subsidiaries. Promptly after filing the Petitions, the Debtors commenced notifying all of their known current or potential creditors of the bankruptcy filings. Notwithstanding these events under certain of our debt instruments, the automatic stay as a result of the Chapter 11 Cases prevents termination of the Debtors’ fleet leases and the Debtors are not required to liquidate their vehicle fleet, and they may continue to utilize the current vehicle fleet in their operations and maintain control over the disposition of those vehicles, subject to the applicable provisions of the Bankruptcy Code.\n  On May 26, 2020, we received a letter from the staff of NYSE Regulation, Inc. (“NYSE Regulation”) stating that it had determined to commence proceedings to delist our common stock from the NYSE. NYSE Regulation reached its decision that we are no longer suitable for listing pursuant to NYSE Listed Company Manual Section 802.01D after our disclosure on May 22, 2020 that we have commenced voluntary petitions for reorganization under Chapter 11 of the Bankruptcy Code. We have appealed the determination in a timely manner and requested a hearing before the NYSE. At this time, our common stock will continue to be listed and trade on the NYSE pending resolution of such appeal. We cannot provide any assurance as to the ultimate resolution of the appeal.\n    We maintain our principal executive offices at 8501 Williams Road, Estero, Florida 33928, and our telephone number is (239) 301-7000. Our website address is www.hertz.com. The information contained on our website or that can be accessed through our website is not part of, and is not incorporated by reference into, this prospectus supplement, and you should not consider it part of this prospectus supplement.\n  Up to 318,972,555 shares of common stock, assuming sales of 176,678,445 shares of our common stock in this offering at an offering price of $2.83 per share, which was the last reported sale price of our common stock on the\n......", "posttime": "2020-06-16 05:14:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "交易,sec,包括", "title": "赫兹美国证券交易委员会(Hertz SEC)备案：最高5亿美元普通股", "title_en": "Hertz SEC Filing: Up to $500M Common Stock", "transed": 1, "url": "https://www.sec.gov/Archives/edgar/data/1657853/000110465920073132/tm2022223-1_424b5.htm", "via": "", "real_tags": ["交易", "sec", "包括"]}, {"category": "", "categoryclass": "", "imagename": "82e11a13ce061c00699a6b5052469465.jpg", "infoid": 1006729, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据美国交通部的数据，2019年美国人的驾车里程比1994年增加了40%。更多的驾驶意味着更拥堵的交通。因此，为了减少拥堵，修建更多的高速公路车道是有意义的，这样就可以容纳更多的汽车。对吗？事实上，没有。来自政策组织“美国交通运输”的一份新报告显示，这根本行不通。\n研究人员发现，1993年至2017年间，美国最大的城市地区增加了30511条新车道-英里-道路-增长了42%。这比同期这些城市人口增长32%的人口增长速度要快。\n但在这24年的时间里，交通拥堵丝毫没有减少。事实上，尽管各州在城市化地区的高速公路资本投资上花费了超过5000亿美元，其中相当大一部分用于高速公路扩建，但这一数字还是上升了144%。这意味着政府花费了数十亿美元，最终结果是美国人在高速公路上沮丧地浪费了更多的时间，坐在喷出气候变暖和污染社区的排放的汽车里。\n由于新冠肺炎的影响，预计每年的石油需求将出现十年来的首次下降。\n多读。\n这是因为当你修建更多的高速公路时，人们开始在几年内开更多的车，填满车道。从1993年到2017年，人均驾车里程增加了20%。这份报告研究了联邦和州的交通和高速公路增长数据，报告称，高速公路加宽后，交通确实会加快，司机们会利用这一点，“改变其他路线，开更远的车，或者在一天中最繁忙的时间出行”。该报告研究了联邦和州政府关于交通和高速公路增长的数据。“以前避免拥堵的人--无论是通过搭乘交通工具、拼车、在一天中不那么拥挤的时段出行，还是干脆放弃出行--开始更多地在这条路线上开车，因为这条路线变得更方便了。”\n人们甚至开始远离市中心的大都市区，因为越来越多的道路使它成为一个更有吸引力、更便宜的选择。但随着城市的扩张，这就产生了更多驾车的需求，这反过来又创造了更多的交通。在高速公路扩建后的几年内(耗资数百万美元的公共资金)，交通增加到足以使道路再次拥堵的地步。司机们变得沮丧，而民选官员则出其不意地做出了回应！-推动扩建高速公路以减少拥堵。然后，整个循环又重新开始。\n分析显示，从圣地亚哥和纳什维尔到彭萨科拉和布法罗，这种模式在全国各地都有发生。即使是人口增长相对较低的城市也没有通过扩大高速公路网来缓解交通拥堵。密西西比州杰克逊的人口在1993年至2017年间仅增长了9%，而该地区的高速公路扩建了60%以上。最终结果是什么？该地区的交通量仍面临317%的增长。\n对于司机来说，这意味着要处理巨大的时间浪费。交通分析公司INRIX周一发布的另一项研究显示，去年司机平均交通时间为99小时，比2017年增加了两个小时。\n所有这些交通也都会产生污染。平均每辆汽车每年排放约4.6吨二氧化碳，运输部门排放的温室气体占美国温室气体排放量的29%。所有这些排放使气候变暖，而其他类型的排放污染空气，造成各种健康问题。对于那些生活在较贫穷的有色人种社区的人来说尤其如此，他们更有可能从汽车和其他来源呼吸污染的空气。\n正如研究人员所表明的那样，事情不必是这样的。美国能够而且应该从根本上改变其运输方式。\n报告称：“专注于缓解拥堵错过了更大的图景。”“我们应该根据人们与工作和服务的联系程度，而不是汽车在某段高速公路上行驶的速度，来确定投资的优先顺序。”\n报告说，为了真正减少交通，官员们必须改善工作、教育、医疗保健、食品杂货、娱乐和其他日常需求。这意味着衡量目的地之间的可达性，而不是公路延误，优先考虑公路维护，而不是扩建。这也意味着让城市对行人来说更安全，这样居民就不必开车去短途旅行了。\n重要的是，美国的城市也迫切需要改善公共交通，这将改善到达目的地的途径，降低汽车排放。正如“副”杂志的亚伦·戈登指出的那样，美国在建设公共交通方面确实做得很糟糕。但今年，我们有机会改变这一点。目前对联邦交通支出的授权将在2020年重新谈判。一旦通过，它将在未来五年内设定联邦交通资金水平。\n报告称：“随着关于下一项联邦交通立法的讨论正在进行中-这一过程每五年才会发生一次-现在是做出改变的关键时刻，在我们向一个不起作用的解决方案再投入数十亿美元之前，现在是做出改变的关键时刻。”“我们不能继续依赖同样昂贵而无效的方法。”", "note_en": "Americans drove 40 percent more miles in 2019 than they did in 1994,   according to the U.S. Department of Transportation. More driving means more congested traffic. So to reduce congestion, it makes sense to build more highway lanes so that more cars can fit. Right? Actually, no. A   new report from the policy organization Transportation for America shows that doesn’t work at all.\n  Between 1993 and 2017, the researchers found that the largest urban areas in the U.S. added 30,511 new lane-miles of roads—a 42 percent increase. That’s a faster rate of growth than population growth, which rose by 32 percent in those cities over the same time period.\n But in that 24 year period, traffic congestion didn’t drop at all. In fact, it rose by 144 percent even as states spent more than $500 billion on highway capital investments in urbanized areas, and a sizable portion of which went toward highway expansion. That means governments spent billions, and the end result was Americans wasting more time frustrated on the highway, sitting in cars that spew out climate-warming and neighborhood-polluting emissions.\n    Yearly Oil Demand Is Now Projected to Drop for the First Time in a Decade Due to COVID-19\n  Read more\n That’s because when you build more highways, people start driving more and filling up the lanes in a matter of years. From 1993 to 2017, the average person drove 20 percent more miles. Right after a highway is widened, traffic  does speed up, and drivers take advantage of that by “switching from other routes, driving further distances or traveling during the busiest time of the day,” the report, which looked at federal and state data on traffic and freeway growth, says. “People who had previously avoided congestion—whether by riding transit, carpooling, traveling during less congested times of day, or foregoing the trip altogether—start driving on that route more because it has become more convenient.”\n   People even start moving further away from central metro areas because the increasing number of roads makes it a more appealing, cheaper option. But as cities sprawl out, that creates the need to drive more, which in turn creates more traffic. Within a few years of a highway expansion (which costs millions of dollars of public money), traffic increases enough that the roads become congested again. Drivers become frustrated, and elected officials respond by—surprise!—pushing to expand highways to reduce congestion. Then, the whole cycle starts over again.\n The analysis shows this pattern occurs all over the country, from San Diego and Nashville to Pensacola and Buffalo. Even cities that saw relatively low population growth didn’t decrease traffic congestion by expanding freeway networks. Jackson, Mississippi’s population grew by just nine percent between 1993 and 2017 while the region expanded its freeways by over 60 percent. Th end result? The region still faced a 317 percent increase in traffic.\n  For drivers, this means dealing with a colossal waste of time. A separate study released by the transportation analytics firm INRIX on Monday   shows that drivers on average spent an average of 99 hours in traffic last year, up two hours compared to 2017.\n All this traffic also   produces pollution. The average car   emits about 4.6 metric tons of carbon dioxide per year, and the transportation sector is responsible for   29 percent of U.S. greenhouse gas emissions. All those emissions warm the climate while other types of emissions pollute the air, creating all sorts of health problems. That’s especially true for those in poorer neighborhoods of color, who are far   more likely to breathe polluted air from cars and other sources.\n  As the researchers show, it doesn’t have to be this way. The U.S. can and should fundamentally change how it approaches transportation.\n “Focusing on congestion mitigation misses the bigger picture,” the report says. “We should be prioritizing investments based on how well they connect people to jobs and services, not how much more quickly cars will be able to travel on a certain segment of highway.”\n  To truly reduce traffic, the report says, officials must improve access to work, education, healthcare, groceries, recreation, and other daily needs. That means measuring accessibility between destinations instead of highway delays, and prioritizing highway maintenance instead of expansion. It also means making cities safer for pedestrians, so that residents don’t have to drive to take short trips.\n Importantly, Americans cities also desperately need to improve public transit, which would improve access to destinations and   lower car emissions. As   Aaron Gordon at Vice points out, the U.S. has been truly awful at building public transportation. But this year, we’ve got a chance to change that. The current authorization for federal transportation spending is set to be renegotiated in 2020. Once passed, it will set federal funding levels for transportation for another five years.\n  “With discussions underway about the next federal transportation legislation—a process that only happens every five years—now is the critical time to make changes before we pour billions more into a solution that doesn’t work,” the report says. “We cannot keep relying on the same expensive and ineffective approach.”", "posttime": "2020-06-16 04:57:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "高速公路,highways", "title": "为什么扩建高速公路会让交通状况变得更糟", "title_en": "Why Expanding Highways Makes Traffic Worse", "transed": 1, "url": "https://earther.gizmodo.com/why-expanding-highways-makes-traffic-worse-1842220595?utm_campaign=Gizmodo&utm_content=&utm_medium=SocialMarketing&utm_source=twitter", "via": "", "real_tags": ["高速公路", "highways"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006727, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "斯坦福Javascript加密库(托管在GitHub上)是斯坦福计算机安全实验室的一个项目，旨在构建一个安全、强大、快速、小巧、易于使用的跨浏览器Javascript密码库。\nSJCL易于使用：只需运行sjcl.crypt(&#34；password&#34；，&#34；data&#34；)加密数据，或运行sjcl.deccrypt(&#34；password&#34；，&#34；Encrypted-data&#34；)进行解密。对于具有更复杂安全需求的用户，有一个功能更强大的API，如文档中所述，并在此演示页面中进行了说明。\nSJCL规模虽小，但实力雄厚。该库的缩小版压缩不到6.4KB，但它发布了令人印象深刻的速度结果。(TODO：创建一个基准页面。)。\nSJCL是安全的。它使用128位、192位或256位的行业标准AES算法；SHA256哈希函数；HMAC验证码；PBKDF2密码加强器；CCM和OCB认证加密模式。同样重要的是，默认参数是合理的：SJCL会将您的密码加强1000倍，并对其进行加密以防止彩虹表，并且它会对其发送的每条消息进行身份验证以防止其被修改。我们相信SJCL提供了在Javascript中实际可用的最好的安全性。(不幸的是，这不像在桌面应用程序中那样强大，因为完全防止代码注入、恶意服务器和旁路攻击是不可行的。)。\nSJCL是跨浏览器的。我们希望如此。我们已经在安全实验室电脑上的所有安装浏览器(包括Mac、Linux和Windows上的各种版本的Internet Explorer、Chrome、Firefox、Safari和Opera)以及Rhino引擎上对它进行了测试，但仍需要进行更全面的测试。我们在此站点上有一个测试页；如果它报告任何故障，请报告问题。\nSJCL开业了。您可以在BSD许可证或GNU GPL 2.0版或更高版本下使用、修改和重新分发它。\nSJCL还支持椭圆曲线加密(ECDH公钥加密和ECDSA签名)。如果要使用它，则必须编译您自己版本的sjcl.js。\n“SJCL”的作者是斯坦福大学的艾米丽·斯塔克、迈克·汉堡和丹·博尼。特别感谢Aldo Cortesi和Roy Nicholson报告了SJCL早期版本中的错误。一份关于SJCL的白皮书(也是由Emily Stark、Mike Hamburg和Dan Boneh撰写)在2009年年度计算机安全应用会议上发表。", "note_en": "The Stanford Javascript Crypto Library (hosted  here on GitHub) is a project by the Stanford Computer Security Lab to build a secure, powerful, fast, small, easy-to-use, cross-browser library for cryptography in Javascript.\n  SJCL is easy to use: simply run  sjcl.encrypt(&#34;password&#34;, &#34;data&#34;) to encrypt data, or  sjcl.decrypt(&#34;password&#34;, &#34;encrypted-data&#34;) to decrypt it. For users with more complex security requirements, there is a much more powerful API, described in the  documentation and illustrated in this  demo page.\n  SJCL is small but powerful. The  minified version of the library is under 6.4KB compressed, and yet it posts impressive speed results. (TODO: put up a benchmarks page.)\n  SJCL is secure. It uses the industry-standard AES algorithm at 128, 192 or 256 bits; the SHA256 hash function; the HMAC authentication code; the PBKDF2 password strengthener; and the CCM and OCB authenticated-encryption modes. Just as importantly, the default parameters are sensible: SJCL strengthens your passwords by a factor of 1000 and salts them to protect against rainbow tables, and it authenticates every message it sends to prevent it from being modified. We believe that SJCL provides the best security which is practically available in Javascript. (Unforunately, this is not as great as in desktop applications because it is not feasible to completely protect against code injection, malicious servers and side-channel attacks.)\n  SJCL is cross-browser. We hope. We&#39;ve tested it on all the install browsers on the security lab computers (including various versions of Internet Explorer, Chrome, Firefox, Safari and Opera on Mac, Linux and Windows) and on the rhino engine, but still need to do more comprehensive testing. We have a  test page up on this site; if it reports any failures, please  report an issue.\n  SJCL is open. You can use, modify and redistribute it under a BSD license or under the GNU GPL, version 2.0 or higher.\n  SJCL also supports elliptic curve cryptography (ECDH public key encryption and ECDSA signatures). If you want to use it, you will have to compile your own version of sjcl.js\n  SJCL was written by Emily Stark, Mike Hamburg and Dan Boneh at Stanford University. Special thanks to Aldo Cortesi and Roy Nicholson for reporting bugs in earlier versions of SJCL. A  whitepaper on SJCL (also by Emily Stark, Mike Hamburg and Dan Boneh) was published in the 2009  Annual Computer Security Applications Conference.", "posttime": "2020-06-16 04:56:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,javascript,sjcl", "title": "斯坦福JavaScript加密库", "title_en": "Stanford JavaScript Crypto Library", "transed": 1, "url": "http://bitwiseshiftleft.github.io/sjcl/", "via": "", "real_tags": ["java", "sjcl"]}]