[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1003003, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通过智能手机应用程序追踪接触者被广泛吹捧为控制和限制冠状病毒疫情传播的重要方式。然而，基于手机应用的联系人跟踪有几个限制。以下是使用Raspberry Pi Zero-W构建接触追踪设备原型的说明。所构建的设备与Apple/Google蓝牙联系人追踪规范兼容。它运行基于DP3T#34；不可链接设计的Epidose软件。\n单个SPST瞬间按钮；用户按下此按钮可授权将其联系人上传到卫生局。\n此构造的目标是为Raspberry PI提供授权联系人上传的开关和指示用户处于风险中的LED。上面的电路图显示了这种设置。\n将电阻器的一端(不管是哪一端)焊接到LED的阴极(LED的两根导线中较短的一条)，以获得17 mm长的连接。连接的组件应该能够装入覆盆子PI的插针20和40。\n在电阻器周围切下17毫米的最小热收缩管，滑动它以覆盖整个LED-电阻器连接。把它加热到收缩。\n将树莓PI连接到电源。电源库可以使此设置便携。\n您可以通过运行命令sudo venv/bin/python expose/device/device_io.py-t来测试硬件的操作。这允许您通过按下按钮来切换LED。按Control-C，然后按按钮终止程序。\n阅读并发布评论，或通过", "note_en": "Contact tracing via smartphone apps has been widely touted as an important way to control and limit the spread of the COVID-19 epidemic. However, basing contact-tracing on phone apps has several limitations. Here are instructions for constructing a contact tracing device prototype with a  Raspberry Pi Zero-W. The constructed device is compatible with the Apple/Google Bluetooth contact tracing specification. It runs the  Epidose software, which is based on the  DP3T &#34;unlinkable&#34; design.\n        Single SPST momentary push button; users press this to authorize the upload of their contacts to the Health Authority.\n    The objective of this construction is to provide the Raspberry Pi with a switch to authorize the contact upload and a LED to indicate that a user is at risk. The circuit diagram above shows this setup.\n      Solder one end of the resistor (it doesn&#39;t matter which) to the LED&#39;s  cathode (the shorter of the LED&#39;s two wires) to obtain a 17mm long connection. The connected assembly should be able to fit in  pins 20 and 40 of the Raspberry Pi.\n      Cut 17mm of the smallest heat-shrink tube that can fit around the resistor and slide it to cover the entire LED-resistor connection. Heat it to shrink.\n          Connect the Raspberry Pi to a power source. A power bank can make this setup portable.\n    You can test the hardware&#39;s operation by running the command  sudo venv/bin/python epidose/device/device_io.py -t. This allows you to toggle the LED by pressing the button. Press Control-C and press the button to terminate the program.\n    Read and post comments, or share through", "posttime": "2020-05-21 02:35:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "raspberry-pi,追踪,standalone,pi", "title": "用覆盆子猪构建独立的COVID19接触追踪装置", "title_en": "Construct a standalone COVID19 contact tracing device with a Raspberry Pi", "transed": 1, "url": "https://www.spinellis.gr/blog/20200520/", "via": "", "real_tags": ["追踪", "pi"]}, {"category": "", "categoryclass": "", "imagename": "f21c0f78e87b0ad3d26d6b3318febcab.png", "infoid": 1003002, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从Remastered Collection宣布以来，社区最热门的问题之一就是这款游戏是否会提供Mod支持。考虑到过去20年来令人难以置信的C&A；C社区项目，我们意识到这对Remastered Collection来说是多么重要。现在终于到了回答关于Mod支持的问题的时候了，但这首先需要向社区展示一个特别的惊喜。\n今天，我们自豪地宣布，在推出Remastered Collection的同时，艺电将在GPL 3.0版许可下发布TiberianDawn.dll和RedAlert.dll以及相应的源代码。对于艺电、C&C社区和游戏行业来说，这是一个关键时刻，因为我们相信这将是第一批根据GPL开放源代码的主要RTS特许经营权之一。值得注意的是，这个计划是一些社区委员会成员和我们EA团队合作的直接结果。在与理事会成员讨论后，我们决定使用GPL许可证，以确保与CnCNet和Open RA等项目的兼容性。我们的目标是以一种对社区真正有益的方式交付源代码，我们希望这将在未来几年实现令人惊叹的社区项目。\n那么，这对于Remastered Collection中的Mod支持意味着什么呢？随着新地图编辑器的加入，这些开源DLL应该可以帮助用户设计地图、创建自定义单位、替换图片、更改游戏逻辑和编辑数据。社区委员会已经在玩源代码，并在我们的不和谐频道上发布了一些有趣的实验。但是为了展示你可以用这个软件做什么的具体例子，Petroglyph实际上已经创建了一个新的改装单位来玩。所以我们问了一个有趣的问题--“如果诺德兄弟会俘虏猛犸象坦克，他们会怎么做？”嗯，一种猜测是，他们会用一门巨型大炮取代炮塔，让它发射战术核武器！于是，核坦克诞生了。这是一个完全可以通过MOD在游戏中玩的单位(见上面的截图)，我们希望当游戏启动时，它可以准备好玩，并作为一个学习榜样。\n除了对Mod的支持，我还希望保持透明，并解决你们中的许多人也一直热衷于的一个功能，那就是LAN Play。今年早些时候，我们曾打算在游戏的发布版本中加入LAN Play，但遗憾的是这一功能没有及时推出。不幸的是，LAN Play成为冠状病毒情况的关键影响因素，因为我们意识到在社交疏远的工作场所开发/测试“局域网”功能的挑战。我们知道这个功能是至关重要的，既是在多人游戏中玩MOD的一个途径，也是在在线系统出现故障的情况下的备份。我们对这一次逃脱感到失望，并将继续把这一点放在我们的优先事项清单上。\n现在，在发现用户内容方面，我们希望充分利用PC平台来简化这一过程。对于蒸汽玩家，我们正在利用蒸汽工作坊来分享地图和MODS。玩家可以直接在Steam内的游戏社区中心订阅地图和MOD，或者利用游戏中的菜单浏览/下载内容。原始玩家可以使用相同的游戏内流程来下载地图，但需要在游戏外手动将MOD安装到各自的文件夹中。对于这两个版本，一旦你进入游戏，你可以导航到选项/模式标签，在那里你可以激活模式。我们的目标是围绕发布窗口，整理出更多关于上传内容和整个UGC过程的文档。\n总体而言，我们非常兴奋地看到社区在接下来的几个月里创造了什么。我们期待Remastered Collection本身会有一些精彩的内容，在当前的社区项目中会有一些很棒的更新，因为它们合并了源代码，也许我们甚至会看到一些新的RTS项目现在可以使用GPL下的源代码来实现。最后我们想强调的一点是，我们已经尽了最大努力修复错误，并为这些UGC系统的推出做好了准备，但我们毫不怀疑，一旦成千上万的人开始创建和分享内容，就会发现一些怪异之处。请在游戏发布后继续分享您的经验，并让我们知道如何继续改进这些工具以使您受益。\n我们期待着在不到三周的时间内在战场上见到你们所有人，同时请保持健康、安全，并感谢您的所有支持和反馈。", "note_en": "Since the announcement of the Remastered Collection, one of the top questions from the community has been if the game would provide Mod Support. Given the incredible C&amp;C community projects over the past two decades, we appreciated how important this was going to be for the Remastered Collection. It’s time to finally answer the question around Mod Support, but it first requires the reveal of a special surprise for the community.\n Today we are proud to announce that alongside the launch of the Remastered Collection, Electronic Arts will be releasing the TiberianDawn.dll and RedAlert.dll and their corresponding source code under the GPL version 3.0 license. This is a key moment for Electronic Arts, the C&amp;C community, and the gaming industry, as we believe this will be one of the first major RTS franchises to open source their source code under the GPL. It’s worth noting this initiative is the direct result of a collaboration between some of the community council members and our teams at EA. After discussing with the council members, we made the decision to go with the GPL license to ensure compatibility with projects like CnCNet and Open RA. Our goal was to deliver the source code in a way that would be truly beneficial for the community, and we hope this will enable amazing community projects for years to come.\n So, what does it mean for Mod Support within the Remastered Collection? Along with the inclusion of a new Map Editor, these open-source DLLs should assist users to design maps, create custom units, replace art, alter gameplay logic, and edit data. The community council has already been playing with the source code and are posting some fun experiments in our Discord channel. But to showcase a tangible example of what you can do with the software, Petroglyph has actually created a new modded unit to play with. So we asked a fun question - “What would the Brotherhood of Nod do if they captured the Mammoth Tank?” Well, one guess is they’d replace the turret with a giant artillery cannon and have it fire tactical nukes! Thus the Nuke Tank was born. This is a unit which is fully playable in the game via a mod (seen in the screenshot above), and we hope to have it ready to play and serve as a learning example when the game launches.\n Alongside Mod Support, I wanted to be transparent and address a feature which many of you have also been passionate about, which is LAN Play. Earlier this year, we had every intention of including LAN Play in the launch version of the game, but sadly this feature did not make it in time. Unfortunately LAN Play became the key impact of the Covid-19 situation as we realized the challenge of developing / testing a “local area network” feature in a workplace time of social distancing. We understand this feature is vital as both an avenue to play mods in multiplayer, and also to serve as a backup in case the online systems are ever down. We’re bummed this one got away, and will continue to keep this on our priority list going forward.\n Now in terms of discovering user content, we wanted to take full advantage of the PC platforms to streamline this process. For Steam players, we’re utilizing the Steam Workshop for sharing both maps and mods. Players can subscribe to maps and mods directly in the game’s Community Hub within Steam, or utilize in-game menus to browse / download content as well. Origin players can use the same in-game process for downloading maps but will need to manually install mods into their respective folders outside the game. For both versions, once you’re in the game, you may navigate to the Options / Mods tab where you can then activate the mod. We’re aiming to put together further documentation on uploading content and the entire UGC process around the launch window.\n Overall, we are incredibly excited to see what the community creates over the coming months. We anticipate some fantastic content for the Remastered Collection itself, some great updates in current community projects as they incorporate the source code, and perhaps we’ll even see some new RTS projects now made possible with the source code under the GPL. One final note we want to emphasize - we’ve done our best to bug fix and prepare these UGC systems for launch, but we have no doubt that once thousands of you begin creating and sharing content, some quirks will be discovered. Please continue to share your experience once the game launches, and let us know how we can continue to improve these tools for your benefit.\n We look forward to seeing all of you on the battlefield in less than three weeks, and in the meantime please stay healthy, safe, and thanks for all your support and feedback.", "posttime": "2020-05-21 02:34:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,代码,gpl3,releasing,游戏", "title": "EA将在GPL3下发布C&C泰伯利亚黎明和红色警报源代码", "title_en": "EA will be releasing the C&C Tiberian Dawn and Red Alert source code under GPL3", "transed": 1, "url": "https://www.reddit.com/r/commandandconquer/comments/gnevp8/remaster_update_and_open_source_mod_support/fr97x9x/", "via": "", "real_tags": ["发布", "代码", "gpl3", "releasing", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "96767644bdb5b5aac101a28562549399.png", "infoid": 1003001, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大约两周前，利亚姆·布莱特(Liam Bright)发布了以下推文：自由派技术官僚让我们完全没有理由认为他们的利益与绝大多数人是一致的，但当他们作为执政阶层受到攻击时，他们强调自己的资历和能力。但是，如果他们高效地做坏事，情况会更糟！[1]。\n布莱特用很少的话概括了我对支持精英制度的论点的问题。例如，纳撒尼尔·吉文斯(Nathaniel Givens)最近发表的一篇支持真正的精英管理的帖子：今天，当人们谈到精英管理时，几乎总是指常春藤盟校(Ivy League)，然后-向前和向后-指为孩子们进入常春藤盟校做准备的支线学校和项目，以及常春藤盟校学生毕业后要从事的高权力工作类型(以及围绕他们的文化)。我的基本点很简单：常春藤盟校没有任人唯贤的东西。旧的WASP-y精英并没有像杜塔特所说的那样“解散”。它只是躲起来了。美国人喜欢假装我们是一个没有阶级的社会，但这是虚构的。我们确实有课。在美国，班级的纽带是常春藤盟校。如果常春藤盟校的录取真的是任人唯贤的，它将尽可能多地基于客观的录取标准。这很难做到，因为即使你选择了某种意义上的目标，比如SAT成绩，你也无法克服这样一个事实，即富有的父母可以并愿意聘请家教来训练他们的孩子人为地夸大自己的分数，而不需要所有昂贵的辅导和练习考试，而同样聪明、勤奋的下层学生也可以获得这样的分数。尽管如此，与大学招生的其他一切-特别是一连串的奖项、俱乐部和活动-相比，这算不了什么，游戏向父母(1)知道游戏潜规则，(2)有钱可烧的孩子倾斜。我以前听过的一个说法是，常春藤联盟基本上就是特权洗钱。它表面上是任人唯贤的，但这个游戏被操纵了，以至于它真正做的一切就是让社会阶层永久化。“遗产”招生只是这方面的冰山一角。比常春藤盟校(或其他精英私立学校)精英录取的虚构更离谱的是，拥有常春藤盟校学位的学生已经学到了一些客观可量化的技能，而比如公立学校的学生却没有。没有证据证明这一点。因此，来自社会精英以外的学生面临双重歧视：一是因为他们没有平等的机会进入常春藤联盟，二是因为他们无法在就业市场上与常春藤联盟的毕业生竞争。不管你工作多么努力，学到了多少东西，你的州立大学学位永远不会像哈佛或耶鲁那样在简历上脱颖而出。这一点都不是任人唯贤的。这就是关键所在。常春藤联盟的精英体制是个谎言。所以我同情对美国精英制度的批评，但他们实际上并不是在批评精英制度。这是一种虚假的精英制度，事实上，这只是一种隐蔽的阶级制度。[2]。\n现在，我和其他人一样鄙视常春藤联盟的污染问题(可能比其他人更鄙视)，但我认为吉文斯夸大了常春藤联盟毕业生缺乏优点。常春藤盟校招生系统旨在挑选世界上最聪明、最勤奋的学生。即使有传统的招生和相关的丑闻，常春藤盟校在这方面基本上是成功的。他们的候选人才库是全球性的；即使他们五分之一的位置被给予了不应得的遗产，被接受的人中最优秀的人和被拒绝的人中最优秀的人之间的差异如此之小，以至于他们之间的选择完全是任意的，但这个人才库的规模确保了卓越。有没有比现在美国顶尖的15所大学(以及少数几个有选择地退出它们的行业)更集中的原始智力和勤奋的行业呢？我什么也想不出来。如果这就是精英管理的意思，那么我们就有了。但这就是精英管理应该是什么意思吗？“美德之书”中的条目比通过智商分数和收集的学习时数来估算的条目要多。信仰、勇气、胆识、足智多谋、无私、耐心、同情心、善良、谦逊、温文尔雅、节制、力量、美丽、魅力、洞察人心并判断内心深处的能力--有一千种美德，每种美德都有其拥护者和批评者。任人唯贤的制度不能选择所有人；对一些人的积极追求会阻碍另一些人的成长。必须做出选择。我们选对了吗？安德鲁·杨(Andrew Yang)-是的，总统候选人安德鲁·杨(Andrew Yang)-不确定我们已经做到了。我很惊讶地发现杨致远在他的书中用了一章的篇幅来讨论这个问题。", "note_en": "Two weeks or so ago Liam Bright posted  the following tweet:  Liberal technocrats give us literally no reason at all to think their interests are aligned with the great majority of people, yet when they are attacked as a governing class they stress their credentials and competency. But it&#39;d be worse if they&#39;re doing bad stuff efficiently!  [1]\nIn very few words Bright has summarized my problem with arguments in favor of meritocracy. Take, for example, a  recent post by Nathaniel Givens in favor of &#34;real meritocracy:&#34;  When people talk about meritocracy today, they’re almost always referring to the Ivy League and then–working forward and backward–to the kinds of feeder schools and programs that prepare kids to make it into the Ivy League and the types of high-powered jobs (and the culture surrounding them) that Ivy League students go onto after they graduate.  My basic point is a pretty simple one: there’s nothing meritocratic about the Ivy League. The old WASP-y elite did not, as Douthat put it, “dissolve.” It just went into hiding. Americans like to pretend that we’re a classless society, but it’s a fiction. We do have class. And the nexus for class in the United States is the Ivy League.  If Ivy League admission were really meritocratic, it would be based as much as possible on objective admission criteria. This is hard to do, because even when you pick something that is in a sense objective–like SAT scores–you can’t overcome the fact that wealthy parents can and will hire tutors to train their kids to artificially inflate their scores relative to the scores an equally bright, hard-working lower-class student can attain without all expensive tutoring and practice tests.  Still, that’s nothing compared to the way that everything else that goes into college admissions–especially the litany of awards, clubs, and activities–tilts the game in favor of kids with parents who (1) know the unspoken rules of the game and (2) have cash to burn playing it. An expression I’ve heard before is that the Ivy League is basically privilege laundering racket. It has a facade of being meritocratic, but the game is rigged so that all it really does is perpetuate social class. “Legacy” admissions are just the tip of the iceberg in that regard.  What’s even more outrageous than the fiction of meritocratic admission to the Ivy League (or other elite, private schools) is the equally absurd fiction that students with Ivy League degrees have learned some objectively quantifiable skillset that students from, say, state schools have not. There’s no evidence for this.  So students from outside the social elite face double discrimination: first, because they don’t have an equal chance to get into the Ivy Leagues and second, because then they can’t compete with Ivy League graduates on the job market. It doesn’t matter how hard you work or how much you learn, your Statue U degree is never going to stand out on a resume the way Harvard or Yale does.  There’s nothing meritocratic about that. And that’s the point. The Ivy League-based meritocracy is a lie.    So I empathize with criticisms of American meritocracy, but it’s not actually a meritocracy they’re criticizing. It’s a sham meritocracy that is, in fact, just a covert class system. [2]\nNow I despise the Ivy League&#39;s polluted issue as much as the next guy (probably  more than the next guy), but I think Givens overstates the lack of merit in Ivy League grads. The Ivy League admissions system is designed to select the most intelligent and studious students in the world. Even with legacy admissions and related scandals, the Ivy League has largely been successful in this. Their candidate pool is global; even if one in five of their spots were given to undeserving legacies  and the differences between the best of the accepted and the best of the rejected are so small that the choice between them is utterly arbitrary, the scale of this pool ensures excellence. Has there ever been a higher concentration of raw intelligence and studious industry than exists right now in America&#39;s top 15 universities (and the few industries that selectively pull from them)? I can think of none. If that is what meritocracy means, then we have one.  But is that what meritocracy  should mean? There are more entries in the book of virtues than those approximated by IQ scores and collected study hours. Faith, courage, daring, resourcefulness, selflessness, patience, compassion, kindness, humility, gentility, temperance, strength, beauty, charisma, the ability to peer into the hearts of men and judge what lies therein—there are a thousand virtues, each with their champions and detractors. No meritocratic system can select for all of them; the vigorous pursuit of some arrests the growth of others. Choices must be made. Have we chosen right?  Andrew Yang—yes, the presidential candidate Andrew Yang—is not sure we have. I was surprised to find that Yang   devotes a chapter of his book to this problem. In retrospect it should not be so surprising: Yang built a business that recruits Ivy League graduates and throws them across the country to build their own businesses. He has reflected long on this problem. Yang&#39;s picture of the meritocratic class is not flattering:  In the bubble, the market governs all. Character is a set of ideas that comes up in the books we read to our children before sending them to test for the gifted and talented program, or a means of doing right by our bosses and reports, or a good way to burnish one’s   personal network. On some level, most of us recognize that we are servants to the tide of innovation and efficiency. A s the water rises, we will protest as we clamber to higher ground. We will be sure to stay out of the way and keep ourselves pliant and marketable to the extent possible. Our specialty is light-commitment benevolence. We will do something to help but not enough to hurt us or threaten our own standing. We know better than to do that....  We say success in America is about hard work and character. It’s not really. Most of success today is about how good you are at certain tests and what kind of family background you have, with some exceptions sprinkled in to try to make it all seem fair.  Intellect as narrowly defined by academics and test scores is now the proxy for human worth. Efficiency is close behind. Our system rewards specific talents more than anything. I got pushed forward for having certain capacities. Others had their horizons systematically lowered for having capacities that our academic system had no use for. I’ve seen countless people lose heart and feel like they should settle for less, that they don’t deserve abundance....  Intelligence and character aren’t the same things at all. Pretending that they are will lead us to ruin. The market is about to turn on many of us with little care for what separates us from each other. I’ve worked with and grown up alongside hundreds of very highly educated people for the past several decades, and trust me when I say that they are not uniformly awesome.  People in the bubble think that the world is more orderly than it is. They overplan. They mistake smarts for judgment. They mistake smarts for character. They overvalue credentials. Head not heart. They need status and reassurance. They see risk as a bad thing. They optimize for the wrong things. They think in two years, not 20. They need other bubble people around. They get pissed off when others succeed. They think their smarts should determine their place in the world. They think ideas supersede action. They get agitated if they’re not making clear progress. They’re unhappy. They fear being wrong and looking silly. They don’t like to sell. They talk themselves out of having guts. They worship the market. They worry too much. Bubble people have their pluses and minuses like anyone else.   ( emphasis added)[3]\n This is not Yang&#39;s only problem with the existing system; though he is polite about it, he paints a damning portrait of how the &#34;winners&#34; of the meritocratic gauntlet end up using in their victory: they work in one of six industries (consulting, law, finance, tech, medicine, or academia) in one of five places (Boston, New York City, Washington DC, the Bay Area, or Los Angeles). The remarkable thing about these numbers (and Yang provides lots of them) is that four of the six industries (consulting, law, finance, and academia) are easily described as parasitic or predatory, secondary adornments to the actual business of human activity on the Earth. We have not only engineered a system that trades wealth and honor for an incredibly narrow range of human attributes; once the trade is made, we ship the winners off to careers that provide only marginal benefit to country writ large. (&#34; But it&#39;d be worse if they&#39;re doing bad stuff efficiently!,&#34; Liam whispers).  However, I do not think this quite grapples with the underlying case for meritocracy. Givens and the pro-meritocrats might respond with something like this: &#34;Well, let&#39;s say we were able to design a meritocratic system that selected for the exact virtues you value most. That system will ensure the wealth and glory it bestows would be given only to those whose position allows them to benefit the broader public. If the system was  genuinely meritocratic, and the merits selected for perfectly aligned with the positions given, what objections could you have?&#34; Or as Scott Alexander  put it a few years ago:  If your life depends on a difficult surgery, would you prefer the hospital hire a surgeon who aced medical school, or a surgeon who had to complete remedial training to barely scrape by with a C-? If you prefer the former, you’re a meritocrat with respect to surgeons. Generalize a little, and you have the argument for being a meritocrat everywhere else.  [4]\nThe problem with these arguments is that they focus on the wrong side of the equation.  The problem with meritocracy is not the &#34;merit&#34; —it is the &#34;ocracy!&#34;  Who governs—and for whom?  Yang is worried about this as well:  In coming years it’s going to be even harder to forge a sense of common identity across different walks of life.  A lot of people who now live in the bubble grew up in other parts of the country. They still visit their families for holidays and special occasions. They were brought up middle-class in normal suburbs like I was and retain a deep familiarity with the experiences of different types of people. They loved the mall, too.       In another generation this will become less and less true. There will be an army of slender, highly cultivated products of Mountain View and the Upper East Side and Bethesda heading to elite schools that has been groomed since birth in the most competitive and rarefied environments with very limited exposure to the rest of the country.     When I was growing up, there was something of an inverse relationship between being smart and being good-looking. The smart kids were bookish and awkward and the social kids were attractive and popular. Rarely were the two sets of qualities found together in the same people. The nerd camps I went to looked the part.     Today, thanks to assortative mating in a handful of cities, intellect, attractiveness, education, and wealth are all converging in the same families and neighborhoods.  I look at my friends’ children, and many of them resemble unicorns: brilliant, beautiful, socially precocious creatures who have gotten the best of all possible resources since the day they were born. I imagine them in 10 or 15 years traveling to other parts of the country, and I know that they are going to feel like, and be received as, strangers in a strange land. They will have thriving online lives and not even remember a car that didn’t drive itself. They may feel they have nothing in common with the people before them. Their ties to the greater national fabric will be minimal. Their empathy and desire to subsidize and address the distress of the general public will likely be lower and lower. [5]\nThe American system of government was built on the assumption that the most salient political divides would reflect geography, not ideology or class. The senator from Massachusetts would share bonds in common with the lay citizenry of Boston that he did not share with a senator from South Carolina. On the national sphere this would allow him to represent the interests of his constituents as if they were his own. This has proven more true at some times in American history than others; yet because of the way American politicians are elected, this sense of representing the interests of a geographically bounded group of people is more true in the political arena than in most others.  Things have not always been this way.  Though commentators sometimes speak of the old WASP gentry as an earlier era&#39;s national elite, they were not really so: they were the business, cultural, and political elites of one  region of America. They ruled the roost in New England and the Mid-Atlantic states. During the WASP heyday these states had greater economic and demographic heft than other regions in the nation, and so families with names like Roosevelt, Adams, and Lodge had an outsized influence on national politics and culture. But those families were not competing against the best and brightest of the entire nation: they were competing with each other. Texas&#39; best and brightest did not strive to get into Harvard—they strove to get into Baylor. They were generally satisfied to be  Texas elites, and if they operated on the national stage they tended to think of themselves as such.  Perhaps the old upper crust of South Dakota lacked the merit of today&#39;s globe-trotting elites. Perhaps the current bunch are more intelligent politicians and more efficient administrators.  Maybe they are the better neurosurgeons. But here is what they are not: more committed to the interests, culture, and people of South Dakota. A pure meritocracy undistorted by existing class cleavages will distort the nation it is inflicted upon. Deciding who rules and who is ruled through a system which selects on a narrow field of virtues inevitably leads to one outcome: an aristocracy of the meritorious few who do not have the experience or the inclination to act in the interests of masses less virtuous than they.     If you would like to read some of my other jottings on elites and American democracy, you may find the posts &#34; Pining for Democracy,&#34; &#34; Despots Near and Despots Far,&#34; &#34; America 3.0,&#34; and &#34; Economies of Scale Killed the American  Dream&#34; of interest. To get updates on new posts published at the Scholar&#39;s Stage, you can join the Scholar&#39;s Stage mailing list,  follow my twitter feed, or  support my writing through Patreon. Your support makes this blog possible.\n    [1] Liam Bright, tweet on 16 December 2019, 1:30 AM, accessed at  https://twitter.com/lastpositivist/status/1206506964735479808     [2] Nathaniel Givens, &#34; In Favor of Real Meritocracy,&#34;  Difficult Run, 6 November 2019.     [3] Andrew Yang,   The War On Normal People: The Truth About America&#39;s Disappearing Jobs and Why Universal Basic Income Is Our Future (New York: Hachette Books, 2018),  111-114      [4] Scott Alexander, &#34; Targeting Meritocracy,&#34;  Slate Star Codex, 24 July 2017.     [5] Yang,   War on Normal People, 114.", "posttime": "2020-05-21 02:34:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "优点,isn,精英", "title": "问题不是“优点”，而是“统治”", "title_en": "The Problem Isn't The 'Merit' It's the 'Ocracy'", "transed": 1, "url": "https://scholars-stage.blogspot.com/2019/12/the-problem-isnt-merit-its-ocracy.html", "via": "", "real_tags": ["优点", "isn", "精英"]}, {"category": "", "categoryclass": "", "imagename": "900e4aca9b5febc5acadab2f1d23df82.jpg", "infoid": 1003000, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "到3月底，群组视频聊天应用Houseparty的情况看起来很好，因为被隔离的年轻人可能是因为Zoom无情的安全故障而望而却步，他们正在寻找一个看起来不那么企业化的平台，以便与朋友和家人保持联系。随着史诗运动会旗下的这款应用在苹果应用商店的日下载量接近15万次，Vogue滔滔不绝地说这是“你需要立即下载的隔离应用”。\n但很快，事情变得很奇怪。一个接一个地，用户开始在社交媒体上声称，在下载这款广受欢迎的应用程序后，他们在银行对账单上发现了奇怪的购买行为，或者他们的电子邮件被黑客入侵了。一条推文写道：“所有人现在就删除家庭派对应用程序，侵入我的账户，把钱花在Bet365、Dominos和Porn Hub Premium上，简直是彻底崩溃了。”\nEPIC游戏公司做出了有力而不同寻常的回应，声称这些谣言相当于对Houseparty的有偿商业诽谤，并在他们的Twitter账户上宣布，将向“第一个提供此类活动证据的人”提供100万美元的赏金。\n由于没有确凿的证据证实窃听传言，媒体基本上忘记了这一离奇的事件。然而，分析公司胜利媒体的创始人扎克·爱德华兹的一份新报告可能会揭示实际发生的事情。报告称，这些黑客攻击不是企业破坏，而是Houseparty自己制造的-疏忽导致了一个漏洞，让数十万人暴露在试图获取凭证和信用卡信息的骗子面前。\n在Medium上的一篇详细帖子中，爱德华兹讲述了一个全球黑客组织的故事，该组织据称征用了数十个属于Houseparty的域名，利用这些域名托管数十个恶意PDF文件，如果这些文件被访问，会将毫无戒备的Houseparty用户重定向到试图提取他们信用卡信息和凭据的虚假服务。\n根据爱德华兹的说法，史诗游戏淡化了在其子域名背后发现的恶意PDF的存在，声称爱德华兹的担忧纯粹是“理论上的”。然而，毫无疑问，这几十个恶意PDF确实存在，仍然出现在缓存的谷歌搜索结果中，供任何有互联网连接的人查找。\n爱德华兹通过史诗游戏的黑客一号漏洞赏金项目提交了他的发现。爱德华兹表示，作为回应，该公司否认“我们的环境受到了损害”。相反，该公司表示，根据爱德华兹的说法，“有问题的子域指向被遗弃的DNS记录，而这些记录又被托管电子书的第三方自动继承。”换句话说，由于该公司不再使用诈骗者劫持的IP地址，这实际上不是HouseParty的问题-也不是该公司所说的“有针对性的妥协”。\nGizmodo联系了Houseparty，目前正在等待评论。一位发言人告诉“纪事报”：“世界相信家庭党会在他们最需要的时候联系他们，我们不会让他们失望的。我们收到了这名个人试图索要赏金的信件，并彻底检查了这封信，以确认这封信不是成立的。个人没有为他的理论错误提供概念证明，这是所有错误赏金计划都需要的。HouseParty应用程序在任何移动设备上使用都是安全的，并且受到行业可信加密的保护，因此您的数据和体验都得到了保护。“\n黑客使用的方案被称为子域劫持-理论上，它是这样运作的：在某个时候，Houseparty注册了数十个可能供内部使用的子域名(例如；subdomain.thehouse partyapp.com)，以托管某种普通的基于网络的服务。当这些服务运行时，子域被注册到Etic Games从主机提供商那里租用的虚拟服务器的IP地址。一旦HouseParty不再需要这些服务，他们就停止在此虚拟服务器上租用空间。然而，根据爱德华兹的说法，因为他们的子域仍然绑定到这个现在已经解放的IP地址，黑客能够出于自己的目的机会主义地夺取它，在这种情况下，托管恶意PDF旨在诱使用户用他们的信用卡注册虚假服务。\n根据爱德华兹的说法，家庭聚会用户可能被重定向到的网站网络主要是承诺“免费媒体/下载/图书/电影等”的网站。他们的设计和复制虽然非常简单，但很容易就能骗过技术不那么精通的Houseparty用户，他们可能在寻找电子书时，偶然发现了这些看似与HouseParty有关联的网站。\n爱德华兹将对这次黑客攻击负责的组织称为“Pickaflick.com Crew”，这是一个多产的信用卡诈骗者，与互联网上超过8400个被破坏的PDF文件有关。\n爱德华兹声称，一旦他通知了EpicGames这个漏洞，他们立即取消了被劫持的子域的配置，告诉他他们正在“实施进一步的工具来解决退役的子域问题”，并再次强调，有问题的子域并没有托管EpicGame的内容。尽管如此，似乎在这些黑客指控流传的同时，Houseparty的数十个子域名连接到了该公司不控制的服务器，使得毫无戒备的用户容易受到信用卡盗窃的影响。", "note_en": "By the end of March, things were looking good for the group video chat app Houseparty as quarantined young people, perhaps put off by Zoom’s relentless security failures, were looking for a less corporate-seeming platform to keep in touch with friends and family. Vogue   gushed that it was “the quarantine app you need to download immediately,” as daily downloads for the Epic Games-owned app approached 150,000 on Apple’s App Store.\n  But very quickly, things got weird. One by one, users started   claiming on social media that after downloading the popular app, they had found bizarre purchases on their bank statements, or that their email had been hacked. “Everyone delete the houseparty app now”, one tweet   reads, “hacked into my account and spent money on Bet365, Dominos and Porn Hub Premium, absolutely devastated.”\n Epic Games responded forcefully and unusually, alleging that these rumors amounted to a paid commercial smear to harm Houseparty,   announcing on their Twitter account, that a million-dollar bounty was being offered to “the first individual to provide proof of such a campaign.”\n  With no hard evidence to corroborate the hacking rumors, the media largely forgot about this bizarre episode. However, a   new report by Zach Edwards, the founder of the analytics firm Victory Medium, may shed some light on what actually occurred. The report alleges that rather than corporate sabotage, the hacks were of Houseparty’s own making—negligence that resulted in a vulnerability that left hundreds of thousands of people exposed to scammers trying to harvest credentials and credit card information.\n In a detailed post on Medium, Edwards tells the story of a global hacking group that allegedly commandeered dozens of domain names belonging to Houseparty, using them to host dozens of malicious PDF files, that, if visited, would redirect unsuspecting Houseparty users to fake services that attempted to extract their credit card information and credentials.\n   According to Edwards, Epic Games played down the presence of the malicious PDFs found behind their subdomains, claiming that Edwards’s concerns were purely “theoretical.” Yet, there is no question that these dozens of malicious PDFs existed, still appearing in cached Google Search results for anyone with an internet connection to find.\n Edwards submitted his findings through Epic Games’ HackerOne bug bounty program. In response, Edwards said, the company denied that “our environment was compromised.” Instead, the company said, according to Edwards, that “that the subdomains in question were pointing to abandoned DNS records, which in turn were automatically inherited by a third-party which was hosting eBooks.” In other words, because the company was no longer using the IP addresses the scammers hijacked, it wasn’t really Houseparty’s problem—and not a “targeted compromise,” as the company reportedly put it.\n  Gizmodo reached out to Houseparty and is awaiting comment. A spokesperson told   the Register, “The world trusts Houseparty to connect them when they need it most and we won’t let them down. We received the individual’s correspondence attempting to claim the bounty and thoroughly reviewed it to confirm that it was not founded. The individual has not provided a proof of concept for his theoretical bug, which is required by all bug bounty programs. The Houseparty app is safe for use on any mobile device and is protected by industry trusted encryption, so your data and your experience are protected.”\n The scheme employed by the hackers is known as subdomain hijacking—and in theory, it worked like this: At some point, Houseparty registered dozens of subdomains ( eg; subdomain.thehousepartyapp.com ), likely for internal use, to host some kind of mundane web-based services. While the services were in operation, the subdomains were registered to the IP addresses of virtual servers that Epic Games leased from a hosting provider. Once Houseparty no longer needed these services, they stopped leasing space on this virtual server. However, because their subdomain continued to be tied to this now-liberated IP address, hackers were able to opportunistically seize it for their own purposes, in this case hosting malicious PDFs meant to entice users to sign up for fake services with their credit cards, according to Edwards.\n  The network of sites that Houseparty users could have been redirected to were largely websites promising “Free Media / Downloads / Books / Movies etc,” according to Edwards. Their design and copy, though quite basic, could easily have fooled less technologically savvy Houseparty users, who perhaps while looking for an e-book, stumbled upon these seemingly Houseparty-affiliated sites.\n Edwards refers to the group responsible for the hack as the “Pickaflick.com Crew,” prolific credit card scammers associated with more than 8,400 sabotaged PDFs across the internet.\n  Edwards claims that once he notified Epic Games of the vulnerability, they promptly deprovisioned the hijacked subdomains, telling him that they were “implementing further tooling to address retired subdomains,” stressing, again, that the subdomains in question were not hosting Epic Game’s content. Even still, it appears that as these hacking allegations were circulating, dozens of Houseparty’s subdomains were linked to servers that the company didn’t control, leaving unsuspecting users vulnerable to credit card theft.", "posttime": "2020-05-21 02:34:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "漏洞,拒绝,refuses,houseparty", "title": "EPIC拒绝支付承诺的100万美元漏洞赏金，以发现漏洞", "title_en": "Epic refuses to pay out $1M bug bounty promised for discovering exploit", "transed": 1, "url": "https://gizmodo.com/the-mystery-of-hacked-houseparty-users-may-have-been-so-1843566890", "via": "", "real_tags": ["漏洞", "拒绝", "refuses"]}, {"category": "", "categoryclass": "", "imagename": "43c33cc1267ef5a2d48e42cad4d91514.jpg", "infoid": 1002999, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "20世纪60年代初，尼古拉·费德亚金(Nikolai Fedyakin)在一个死水般的苏联实验室里辛勤地进行他的研究。Fedyakin在莫斯科东北200英里处伏尔加河畔的古城科斯特罗马的技术学院工作。有人会说这个昔日的亚麻业中心很迷人，也有人会说它很原始。在很多方面，苏联这个安静、朴实无华的角落是费德亚金所追求的不起眼的研究的完美环境。当其他俄罗斯科学家将宇航员推进太空时，费德亚金研究的是水。\n费德亚金正在探索一个古老的理论。早在19世纪，威廉·汤姆森(今天更为人所知的名字是开尔文勋爵)发现，单个水滴的蒸发速度比碗里的水更快。凯尔文还注意到玻璃管中的水蒸发得更慢。他推测，水表面的曲率影响着它蒸发的速度。为了验证开尔文的理论，费德亚金小心翼翼地将几滴纯净水放入不同形状的容器中。在一次实验中，他将水蒸气冷凝在一根直径为人头发的玻璃管中，密封后直立储存。几周后，当他检查试管里的东西时，他看到了一些奇怪的东西。在显微镜下，液体柱被分成两部分，像醋和油一样被分开。\n费德亚金想知道，为什么水会分成两部分，这两部分的行为方式是一样的吗？在干净的实验室条件下重复他的几次实验后，费德亚金设法创造出比一滴露水相当的样本大小。他的观察受到显微镜分辨率的限制，但他可以看到足够多的东西，从而意识到玻璃管底部的液体比普通水更稠密。费德亚金在一份俄罗斯科学期刊上发表了他的研究结果，希望其他人也会对他的水感到好奇。只有一个人这么做了。\n鲍里斯·德里亚金是国际知名的莫斯科物理化学研究所所长。他身材高大，表情永远痛苦，他已经达到了苏联科学的最高水平，现在正在寻找一个可以将他推入诺贝尔奖轨道的研究问题。一位不知名的化学家在俄罗斯一个被遗忘的地方发现了奇怪的水，这可能正是他需要的动力。\n德雷亚金与费德亚金建立了合作关系，然后稳步地将这位鲜为人知的科学家的研究投入到自己的工作中。Deryagin的研究小组证实，玻璃管底部的物质比普通水更稠密、更厚。他们还发现，与普通水相比，它的结冰温度要低得多(-40华氏度)，沸腾温度要高得多(接近400华氏度)。使用光学显微镜，研究人员还可以看到这种新型水在受热和弯曲光线不同时比普通水膨胀得更多。随着每一次新的观察，德里亚金越来越确信，这种他称之为“改性水”的水是热力学上最稳定的水形式，这意味着任何接触到改性水的水最终也会变成改性水。但是德里亚金需要更多的证据来证明水的新奇性。一旦他有了证据，他就可以吸引苏联以外的科学家的注意。\n1966年，经过近四年的工作，德雷亚金在苏联当局允许他在英国诺丁汉大学的一个会议上发表讲话后，实现了他的愿望。会议的大部分演讲都引发了激烈的辩论，但当德里亚金结束演讲时，只有几个礼貌的问题被问了出来。他的演讲干脆取名为“亲冻表面对边界液膜性质的影响”，太含糊了，没有引起任何通常由科学突破引起的兴趣。他想要的关注，他期待的问题，以及他希望的人群从未到来。只有一位英国科学家表示对他的工作感兴趣：布莱恩·佩西卡(Brian Pethica)，英国柴郡联合利华研究实验室(Unilever Research Laboratory)的主任。\n佩西卡回到他的团队的实验室，按照德里亚金的指示制造改良水。三年后，佩西卡和他的团队证实了德里亚金的发现。但除了在普通水中发现的氢和氧之外，他们也无法确定流体的化学组成：修改后的水的量低于他们的仪器可以检测到的量。然而，使用与苏联相同的工具，他们验证了这种液体比普通水膨胀得更多，并发现它具有稠密的凝胶状稠度。他们谨慎地猜测，这种新物质是由玻璃管中的硅酸盐淋滤而成的。但他们也对这一理论持怀疑态度，因为德里亚金用石英管创造了水，而石英管中不太可能发生浸出。尽管他们心存疑虑，他们还是给这种奇怪的液体起了个新名字--反常水--并在拥有强大国际影响力的科学期刊“自然”上发表了一篇关于它的论文。\n许多不太出名的科学家怀疑异常水的真实性，在科学期刊的评论部分对此不屑一顾。这些怀疑者说，如果反常水是最稳定的水形式，那么所有与之接触的水都应该变成反常水。对一些人来说，异常水的存在似乎是不可能的。对于其他人来说，有足够的数据来点燃想象力。\n像人类一样，化学物质有独特的指纹，被称为光谱仪的仪器可以从化学指纹或光谱中识别元素和分子。然而，成功取决于样本的大小，样本越大越好。在已发表的论文中，异常水的信徒们哀叹说，水中的水就是不够，肯定不足以识别它的分子组成。科学家们用极少量的可用异常水测量了他们所能测量的东西，主要是物理性质，如沸点、外观、热膨胀和粘度。这些观察支持了他们的信念，即异常水是真实存在的，但对于每个信徒来说，都有更多的怀疑者大声驳斥了这一结果。只有用灵敏度足以确定流体化学成分和结构的光谱仪进行明确的化学分析，才能解决这个问题。\n这些数据是在1969年6月27日到达的。发表在美国著名科学杂志“科学”上的一篇论文为怀疑科学家提供了缺失的证据-明确的光谱证据，证明了这种水是不同的。让数据更具说服力的是领导团队的马里兰大学(University Of Marland)的埃利斯·利平科特(Ellis Lippincott)，他是一位著名的化学家和光谱学专家，建造了美国最好的两台光谱仪之一。利平科特与美国国家标准局的聚合物化学家罗伯特·斯特龙伯格(Robert Stromberg)和沃伦·格兰特(Warren Grant)合作，证明了这种液体的光谱“不是”。。。任何已知的物质。“。当科学家们试图对这种液体进行化学分析时，他们发现了微量的硅和钠，数量太小，不足以被认为是重要的。利用这些光谱仪的数据，研究人员还试图解释这种液体的独特之处：他们认为，水的分子排列在蜂窝状的网络中，形成了水的聚合物。他们给它起了个绰号叫“多水”。\n科学家-即使是最持怀疑态度的人-也注意到了这一点。Polywater也引起了媒体和公众的注意，其中一些人想起了库尔特·冯内古特(Kurt Vonnegut)的怪物冰-几年前出版的小说“猫的摇篮”(Cat‘s Cradle)中的九块冰。冰九冰冻结了它接触到的任何液体水，从湖泊和河流到血液和汗水。就像感染一样，现实生活中怪异的水是否也会改变它所接触到的水呢？如果多水被冲下马桶怎么办？它能将污水处理厂的普通水转化为人们可以饮用的水吗？物理学家弗兰克·多纳霍(Frank Donahoe)也对多水的威胁感到震惊和愤怒。1969年10月，他在“自然”杂志上写道：“我认为聚合物是地球上最危险的材料。”“把它当作最致命的病毒，直到它的安全性确定为止。”\n一旦媒体报道了Polywater的故事，Stromberg就开始收到信件，数量很多。“人们写信给我，说我在毁灭世界，”他说。\n波利沃特的苏联血统并没有帮助解决问题。到1969年，中央情报局正在监测冷战对手的多水研究，“华尔街日报”报道说，五角大楼正在“为推动美国多水技术领先于苏联的努力提供资金”。\n到了1970年，每个人都有关于多水的问题，宾夕法尼亚州伯利恒的一次科学会议被广告宣传为有答案。\n1970年4月，美国化学学会在钢铁重镇伯利恒的利哈伊大学举行了一次研讨会。整个会议都聚焦于水，包括异常水。随后安排了一场新闻发布会。记者和300名与会者都想更好地了解多水的本质。怀疑者和信徒的情绪都很高：一场斗争正在酝酿之中。\nPolywater的教父Deryagin有幸致开幕词。演讲结束后，他被问了一大堆问题。一名观众询问其他实验室在多水中发现杂质的证据。Deryagin回答说：“我不能对糟糕的结果负责，这不是我们造成的。”他说，如果他们的设备中存在杂质，它们也会出现在异常的水中。\n但是，领养了多水的美国父亲利平科特说，杂质是他实验室的一个问题，他很难重复他早先的发现。斯特龙伯格支持里平科特叛逃。“根据我们掌握的证据，我们一开始就相信水会形成聚合物，”他说。“新证据令人严重怀疑。”\n丹尼斯·卢梭(Denis Rousseau)是新泽西州默里山贝尔实验室(Bell Labs)的一名29岁的博士后科学家，他是更直言不讳、更有激情的不信仰者之一。他告诉身边的重量级人物，在与擅长检测微量化合物的化学家合作时，他们发现“多水样本显示这种物质受到了高度污染。”结果显示“高浓度的钠、钾、碳、氧和氯化物”以及其他化合物。卢梭确信杂质在多水中起作用：在他将激光对准多水样本的一次实验中，多水燃烧并变成深棕色，这是一个迹象，表明样本中包含的不仅仅是新构型的H2O分子。“我不相信有足够的证据证明水的聚合体是合理的，”他说。德里亚金仍然坚定不移。\n来自世界各地的科学家前往利哈伊谷寻找答案，但他们沮丧地离开了。当Polywater的支持者重新开始制作足够大的样本进行测试时，现状又回来了，而它的怀疑者则继续谴责整个事情是胡说八道。\n卢梭决心证明多水的不存在，为了证明他的观点，他去了健身房，在那里他相信他可以找到杂质的来源。在一场激烈的手球比赛后，卢梭从他的T恤上拧出汗液，并将其样本放入光谱仪。这台机器吐出的化学光谱与早先的一份多聚水样本的化学光谱相匹配。1971年1月，“科学”发表了一篇关于卢梭发现的论文。他在信中写道，每个人，就像花生角色猪圈一样，都被一层雾包围着，雾中包含着这个人本质的细雾。当这种薄雾或气溶胶落在含有微量水的玻璃管的内部时，就产生了具有奇怪行为的流体。多聚水被证明是1%的灵感和99%的汗水。换句话说，多水只是一种肮脏的水。\n最后，波尔沃特的追随者失去了他们的信仰。科学家们回到了未完成的工作中，因为多水消耗了他们和数百万的研究资金。现在一切都过去了。两年后，即使是固执的德雷亚金也承认了这一点。“这些实验并不支持反常水或聚合水的假说，”他说。", "note_en": "In a backwater Soviet laboratory in the early 1960s, Nikolai Fedyakin toiled away at his research. Fedyakin worked at the technological institute in Kostroma, an old city on the Volga River 200 miles northeast of Moscow. Some would say this bygone hub of the linen industry was charming, others that it was primitive. In many ways this quiet, unadorned corner of the Soviet Union was the perfect setting for the unremarkable research Fedyakin pursued. While other Russian scientists propelled cosmonauts into space, Fedyakin studied water.\n Fedyakin was probing an old theory. Back in the 19th century William Thomson, better known today as Lord Kelvin, found that individual water droplets evaporate faster than water in a bowl. Kelvin also noticed water in a glass tube evaporates even more slowly. He surmised that the curvature of the water’s surface affected how quickly it evaporated. To test Kelvin’s theory Fedyakin carefully placed drops of purified water in containers of different shapes. In one experiment he condensed water vapor in a glass tube the diameter of a human hair, sealed it, and stored it upright. When he examined the contents of the tube a few weeks later, he saw something strange. Under the microscope the column of liquid was divided into two parts, separated like vinegar and oil.\n Why would water split into two parts, Fedyakin wondered, and did these parts behave in the same way? After repeating his experiments several times under clean laboratory conditions, Fedyakin managed to create a sample size smaller than the equivalent of a drop of dew. His observations were limited by the resolution of his microscope, but he could see enough to realize the liquid at the bottom of the glass tube was denser than ordinary water. Fedyakin published his results in a Russian scientific journal in hopes that others would also find his water curious. Only one man did.\n Boris Deryagin was the internationally renowned director of the Institute of Physical Chemistry in Moscow. A tall man with a perpetually pained expression, he had already reached the most rarefied level of Soviet science and was now seeking a research problem that could thrust him into the orbit of a Nobel Prize. The strange water found by an unknown chemist in a forgotten part of Russia was possibly just the boost he needed.\n Deryagin struck up a collaboration with Fedyakin and then steadily absorbed the research of the little-known scientist into his own work. Deryagin’s team confirmed the substance at the bottom of the glass tube was denser and thicker than ordinary water. They also discovered that compared with ordinary water it froze at a far lower temperature (–40°F) and boiled at a much higher one (near 400°F). Using an optical microscope the researchers could also see this new type of water expanded more than ordinary water when heated and bent light differently. With every new observation Deryagin grew more convinced that this “modified water,” as he called it, was the most thermodynamically stable form of water, meaning any water coming into contact with the modified water would eventually become modified as well. But Deryagin needed more evidence to prove the water’s newness and strangeness. Once he had that proof, he could catch the attention of scientists outside the Soviet Union.\n  In 1966, after nearly four years of work, Deryagin got his wish after Soviet authorities permitted him to speak at a conference at the University of Nottingham in England. Most of the conference’s talks elicited contentious debate, but when Deryagin finished speaking, only a few polite questions were asked. His talk, dryly titled “Effects of Lyophile Surfaces on the Properties of Boundary Liquid Films,” was too vague to draw any of the interest usually generated by a scientific breakthrough. The attention he desired, the questions he expected, and the crowds he hoped for never came. Only one British scientist expressed interest in his work: Brian Pethica, the director of the Unilever Research Laboratory in Cheshire, England.\n Pethica went back to his group’s laboratory and followed Deryagin’s directions for creating modified water. Three years later Pethica and his team confirmed Deryagin’s findings. But they too were unable to determine the fluid’s chemical makeup apart from the hydrogen combined with oxygen found in ordinary water: the amount of the modified water was below what their instruments could detect. However, using the same tools as the Soviets, they verified the liquid expanded more than ordinary water and found it had a thick, gel-like consistency. They made a cautious guess that this new substance was created by silicates leaching from the glass tube. But they also had their doubts about this theory, as Deryagin had created the water using quartz tubes in which leaching was unlikely. Despite their misgivings they gave the odd liquid a new name—anomalous water—and published a paper about it in  Nature, a science journal with a strong international reputation, which alerted American scientists to the discovery.\n As Americans devoured the details of this possibly stunning breakthrough, Deryagin finally began to see his Nobel dreams materialize. J. D. Bernal, one of Britain’s most celebrated scientists, told Deryagin that “this is the most important physical-chemical discovery of the century.”\n Many less-famous scientists doubted the reality of anomalous water, dismissing it in commentary sections of science periodicals. If anomalous water was the most stable form of water, said these doubters, then  all water coming into contact with it should turn anomalous. For some the existence of anomalous water seemed impossible. For others there were data enough to ignite the imagination.\n  Chemicals, like humans, have unique fingerprints, and instruments called spectrometers can identify the elements and molecules from a chemical fingerprint, or spectrum. Yet success hinges on the size of the sample, where bigger is better. In published papers anomalous-water believers lamented there just wasn’t enough of it, certainly not enough to identify its molecular makeup. Scientists measured what they could with the tiny amounts of anomalous water available, largely physical properties, such as boiling point, appearance, thermal expansion, and viscosity. These observations bolstered their conviction that anomalous water was real, but for every believer there were many more skeptics who loudly dismissed the results. The matter would only be settled by a definitive chemical analysis from a spectrometer sensitive enough to determine the fluid’s chemical composition and structure.\n That data arrived on June 27, 1969. A paper published in  Science, a prestigious American scientific journal, provided the missing evidence for doubting scientists—definitive spectroscopic proof that this water was different. What made the data even more convincing was the person who led the team, Ellis Lippincott of the University of Maryland, a well-known chemist and an expert in spectroscopy who had built one of the two best spectrometers in the country. Working with polymer chemists from the National Bureau of Standards, Robert Stromberg and Warren Grant, Lippincott showed the liquid’s spectrum was “not . . . of any known substance.” When the scientists tried to chemically analyze the liquid, they found trace quantities of silicon and sodium, in amounts too small to be considered significant. Using the data from these spectrometers the researchers also took a stab at explaining what made the liquid unique: the molecules of H 2O, they suggested, were arranged in a honeycomb-shaped network, making a polymer of water. They dubbed it polywater.\n Scientists—even the most skeptical—took notice. Polywater also caught the attention of the press and public, some of whom were reminded of Kurt Vonnegut’s monstrous ice-nine from the novel  Cat’s Cradle, published a few years earlier. Ice-nine froze whatever liquid H 2O it touched, from lakes and rivers to blood and sweat. Like an infection, might the real-life weird water also change any water it came into contact with? And what if polywater were flushed down the toilet? Could it transform ordinary water in a treatment plant, water people might then drink? Physicist Frank Donahoe was also alarmed and vehement about polywater’s threat. “I regard the polymer as the most dangerous material on earth,” he wrote in  Nature in October 1969. “Treat it as the most deadly virus until its safety is established.”\n  Once the press picked up the polywater story, Stromberg started receiving letters, lots of them. “People were writing me that I am destroying the world,” he said.\n Polywater’s Soviet origins didn’t help matters. By 1969 the CIA was monitoring polywater research by its Cold War rival, and the  Wall Street Journal reported the Pentagon was “bankrolling efforts to push U.S. polywater technology ahead of the Soviet Union’s.”\n By 1970 everyone had questions about polywater, and a scientific conference in Bethlehem, Pennsylvania, was advertised to have the answers.\n  In April 1970 the American Chemical Society held a symposium at Lehigh University, in the steel town of Bethlehem. An entire session focused on water, including anomalous water. A news conference was scheduled to follow. Reporters and the 300 attendees all wanted to better understand the nature of polywater. Passions were high among both skeptics and believers: a fight was simmering.\n Deryagin, the godfather of polywater, had the honor of giving the opening talk. After his presentation he was pummeled with questions. One audience member asked about evidence of impurities found in polywater by other labs. “I can’t be responsible for the results that are bad and not by us,” Deryagin replied. If the impurities are present in their equipment, he said, they will turn up in the anomalous water, too.\n But Lippincott, the adoptive American father of polywater, said impurities were a problem in his lab and he had had difficulty repeating his earlier findings. Stromberg supported Lippincott’s defection. “With the evidence we had, we started out believing that water forms a polymer,” he said. “New evidence casts serious doubt.”\n Denis Rousseau, a 29-year-old postdoctoral scientist at Bell Labs in Murray Hill, New Jersey, was one of the more vocal and passionate disbelievers. He told the heavyweights around him that in working with chemists skilled in detecting trace amounts of compounds, they found the “polywater samples show the material to be highly contaminated.” Results showed “high concentrations of sodium, potassium, carbon, oxygen, and chloride” as well as other compounds. Rousseau was confident impurities were at play in polywater: in one experiment in which he aimed a laser at a sample of polywater, the polywater burned and turned dark brown, a sign the sample contained more than just H 2O molecules in a new configuration. “I do not believe there is sufficient evidence to justify a polymer of water,” he said. Deryagin remained unswayed.\n Scientists from all over the world had traveled to the Lehigh Valley for an answer, but they left frustrated. The status quo returned as polywater’s supporters got back to the business of making a sample large enough to test, while its skeptics continued to denounce the whole thing as drivel.\n   Rousseau was determined to prove the nonexistence of polywater, and to make his point he went to the gym, where he believed he could get to the source of the impurities. After an intense game of handball Rousseau wrung out the perspiration from his T-shirt and put a sample of it into his spectrometer. The machine spat out the chemical spectrum, which matched that of an earlier sample of polywater. In January 1971  Science published a paper with Rousseau’s findings. In it he wrote that each person, like the  Peanuts character Pigpen, is surrounded by a fog containing a fine mist of that person’s essence. This mist, or aerosol, when it landed on the inside of a glass tube containing a microscopic amount of water, created the fluid with the odd behavior. Polywater turned out to be 1% inspiration and 99% perspiration. Put another way, polywater was merely dirty water.\n Finally polywater’s adherents lost their faith. Scientists got back to work left undone while polywater had consumed them along with millions of research dollars. It was all water under the bridge now. Two years later even the stubborn Deryagin conceded. “These experiments do not support the hypothesis of anomalous or polymeric water,” he said.", "posttime": "2020-05-21 02:33:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "复水,fall,研究", "title": "复水的兴衰", "title_en": "The Rise and Fall of Polywater", "transed": 1, "url": "https://www.sciencehistory.org/distillations/the-rise-and-fall-of-polywater", "via": "", "real_tags": ["复水", "fall", "研究"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002998, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从2015年见到Ruby以来，我并不经常对编程语言感到兴奋。\n早在那之前，沉浸在用Java编写大学课程作品的痛苦中，让我远离了开发。Ruby的自由和表现力是吸引我回来的原因，它的风格让我留在了里面。\n我正在寻找另一种语言来扩展我的工具，结果遇到了几种语言，比如Crystal、Phyton、Elixir。但是我想，仅仅使用另一种面向对象的语言有什么意义呢？\n因此，选择Elixir是不费吹灰之力的，我最终将用函数代码库体验一些有趣的并发功能。\n我可以说，一周过去了，我已经对我的决定感到满意了。然而，原因并不主要与我对可能性的理解有关，更多的是因为欢迎这种语言的方式与以下最佳实践并驾齐驱。\n从Ruby开始，我所关心的就是以快速和时尚的方式完成一些事情。\n从长生不老药开始，我采取了一种不同的方法，不是因为我选择了，而是因为我接受了指导。\n让我们来了解一下ELEXIR是如何欢迎新手使用这门语言的。\n作为一门相当新的语言，我没有想到长生不老药有如此多的优质资源。官方文件本身就是黄金。这一点，加上药剂学校，就是我学习这门语言所需要的全部。\n我再怎么强调记录代码库的重要性也不为过。然而，在大多数语言中，你会觉得它是一件可选的事情，因此大多被忽略了，或者没有始终如一地遵循。\n由于内置了工具，编写和生成文档在Elixir中轻而易举。您甚至可以编写文档，这些文档将自动添加到您的测试套件中&&amp；mldr。\n并不是所有的代码库都按时实现静态分析器，因此追赶起来就成了一件痛苦的事情。(我写了一篇关于如何在稍后阶段将静态代码分析引入Ruby项目的小文章。)。\n有很多代码库甚至不知道一致格式的存在。\n虽然看似琐碎，但它绝对不是。一致的样式不是可选的，而Elixir为我们提供了内置的代码格式化程序，从而帮助我们避免了这一点。\n哈，我没想到有一天我还想再写一次。然而，主要是用金融工具/金钱工作，我宁愿在需要的时候更安全。\n@doc&#34；&#34；&#34；使用OAuth进行身份验证。如果成功，则返回{：OK，%Client{}}，否则返回{：Error，%ApiError{}}。&#34；&#34；&#34；&#34；@spec Authenticate(String.t()，String.t())：：{ATOM，Client.t()|ApiError.t()}def Authenticate(GRANT_TYPE\\\\&#34；PASSWORD&#34；，Scope\\\\&#34；for Integration&#34；)do params=%{Grant_type：Grant_type，Scope：Scope，UserName：Application.get_env(：Banco_bs2，：account).user，password：Application.get_env(：Banco_bs2，：account).pass}case HTTPoison.post(&#34；#{@base_url&lt；&gt；@auth_endpoint}&#34；，url_encode(Params)，Headers())do{：OK，%Response{status_code：200，Body：Body}}-&gt；HANDLE_SUCCESS(Jason.decode！(Body)){：OK，Response}-&gt；Handle_Error(Response){：Error，%Error{Reason：Reason}}-&gt；{：Error，%ApiError{message：&#34；发生连接错误：#{Reason}&#34；}}end\n您的代码仍然可以编译，因为Elixir不是一种静态类型语言，但是，它将帮助您在编写代码时更加清晰。\n能够在Elixir中访问成熟的Erlang生态库是一件很棒的事情，尽管不鼓励使用它。\n我很惊讶，仅仅一周后，即使作为一个初学者，我也可以开始用一种新的语言和范例编写可维护的可读代码。\n让我们看看这一切都会走向何方。决不是说我会少写Ruby，而是多写一些灵丹妙药。", "note_en": "It’s not often I get excited about programming languagessince meeting  Ruby in 2015.\n Way before that, drowning in misery of writing university course works in  Java,has pushed me away from development. Ruby’s freedom and expressivenesswas what pulled me back, and it’s style has kept me in.\n I was on the lookout for another language to expand my tooling, and came acrossa few, such as  Crystal,  Phyton,  Elixir. But what’s the point with just anotherObject Oriented language I thought.\n So, choosing Elixir was a no-brainer, and I will finally taste some of thatjuicy concurrent abilities with functional code base.\n I can say that a week in, I am already happy with my decision. However, the reasonis not mostly associated with my understanding of possibilities, but more because howwelcoming the language is alongside following best practices.\n Starting with  Ruby, all I cared was to get something done in fast and stylish way.\n Starting with  Elixir, I took a different approach, not because I chose, butbecause I have been instructed.\n Let’s go through a few points on how Elixir welcomes newcomers to the language.\n  Being a fairly new language, I did not expect that there was such huge amount ofquality resources for Elixir. Official documentation itself is gold. This, alongside with Elixir School was all I needed to get going with the language.\n  I can not stress the importance of documenting code base enough. However, in mostlanguages you get a feeling of it being an optional thing, thus mostly ignored, ornot followed consistently.\n Writing and generating documentation is a breeze in Elixir due to built in tooling. Youcan even write docs which will be automatically added to your  test suite&amp;mldr\n  Not all code bases implement static analyzers on time, and then it justbecomes a pain to catch up. (I wrote a  little post about how you can bringstatic code analysis at a later stage to your Ruby projects.)\n There are loads of code bases that don’t even know about the existence of consistent formatting.\n As trivial as it may seem, it absolutely isn’t. Consistent styling is not optional, andElixir helps us to avoid that by providing us with built in code formatter.\n  Hahaha, I didn’t imagine that one day that I would like to write typespecs again. However,working with mostly financial tools/money, I would rather prefer extra safetywhen I need it.\n  @doc  &#34;&#34;&#34;  Authenticates using OAuth.   If succesful, returns {:ok, %Client{}}, else {:error, %ApiError{}}.  &#34;&#34;&#34;  @spec authenticate(String.t(), String.t()) :: {atom, Client.t() | ApiError.t()} def authenticate(grant_type \\\\  &#34;password&#34;, scope \\\\  &#34;forintegration&#34;) do params = %{  grant_type: grant_type,  scope: scope,  username: Application.get_env( :banco_bs2,  :account).user,  password: Application.get_env( :banco_bs2,  :account).pass } case HTTPoison.post( &#34; #{ @base_url &lt;&gt;  @auth_endpoint } &#34;, url_encoded(params), headers()) do { :ok, %Response{ status_code:  200,  body: body}} -&gt; handle_success(Jason.decode!(body)) { :ok, response} -&gt; handle_error(response) { :error, %Error{ reason: reason}} -&gt; { :error, %ApiError{ message:  &#34;Connection error occured:  #{reason } &#34;}} end end\n Your code will still compile as Elixir is not a statically type language, however, it willhelp you to have more clarity when writing code.\n   It’s great to have access to mature Erlang ecosystem libraries within Elixir, eventhough it’s use is discouraged.\n  I am amazed how after a single week, even as a beginner, I can start to write maintainablereadable code in a new language and paradigm.\n Let’s see where this all goes. In no means, I will be writing less Ruby, but more Elixiralongside it.", "posttime": "2020-05-21 02:32:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "长生不老,week,代码", "title": "与长生不老药共度美好的一周", "title_en": "Lovely Week with Elixir", "transed": 1, "url": "https://www.ramblingcode.dev/posts/lovely_week_with_elixir/", "via": "", "real_tags": ["长生不老", "week", "代码"]}, {"category": "", "categoryclass": "", "imagename": "dd52356794549053ac692d9fbc506476.jpeg", "infoid": 1002997, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "能源部(DoE)的一项新计划承诺为两个先进的核反应堆设计提供1.6亿美元，并为进一步开发提供7000万美元。\n预计第一个获奖者是俄勒冈州的初创公司NuScale，该公司与大学研究人员合作开发其小型反应堆。\n先进的反应堆来自第三代和第四代，寻求更统一和模块化的核电站。\n能源部(DoE)已经启动了一个新的核能办公室项目，名为先进反应堆示范计划(ARDP)。这项2.3亿美元的计划将向从事两个反应堆设计的科学家提供1.6亿美元，这两个反应堆设计“可以在不久的将来投入使用”。\nARDP的“先进”部分是一个行业术语，指的是我们今天拥有的反应堆的生成。世界核协会解释说：\n“第一代反应堆是在1950-60年代发展起来的。第二代反应堆以目前的美国和法国船队为代表，大多数在其他地方运行。所谓的第三代(和第三代+)是先进的反应堆，尽管与第二代的区别是随意的。第一批已在日本投入运营，其他正在几个国家建设中。“。\n第四代-超级先进反应堆？-正处于研究阶段，但ARDP的声明提到发展到本世纪30年代中期，可能包括第四代。\n因此，技术上的差异可能是任意的，但先进的反应堆通常更安全，整体外形更小，而且更标准化，以便更容易安装和扩大规模。大多数现有的发电厂都是独一无二的，根据具体情况建造，以适应个别社区或使用案例。更统一的流程意味着工厂更容易保护、支持和监管。\n美国核能办公室助理部长丽塔·巴兰瓦尔(Rita Baranwal)在能源部的一份声明中表示：“先进的核能系统在降低排放、创造新的就业机会和建设强大的经济方面拥有巨大的潜力。”\n核能研究所(NEI)提到的主要项目之一可能听起来很耳熟：“NuScale Power LLC预计将在今年晚些时候获得美国核管理委员会(US Nuclear Regulatory Commission)的第一个小型模块化反应堆设计认证，”NEI报道。NuScale的微型模块化反应堆设计用于电力需求较低的小型社区，体现了先进的反应堆价值。\n能源部正在将ARDP的声明与最近的“恢复美国核能领导地位的战略”联系起来，该战略的建议包括“立即采取大胆行动，加强铀矿开采和转换行业”，以及“支持美国核能行业出口民用核技术”。(也许埃隆·马斯克最终能制造出1万枚核导弹。)。\n政府推动核能主要是因为它有能力减少碳排放，但NEI强调，先进的反应堆比这更灵活。NEI解释说：\n一旦建成，今天正在设计的先进反应堆将与我们目前的反应堆在大小上有所不同，并可能用于其他目的，如海水淡化、生产工业用蒸汽，以及为工业和运输需要生产氢气。\n通过这项计划，组织可以通过三条“途径”申请资金。能源部解释说：“在美国失去关键基础设施和供应链能力之前，迅速展示先进的反应堆设计对于提供清洁能源和扩大市场机会是必要的。”\n第一条途径是展示一种新的光反应堆设计，该设计必须在7年内完全发挥作用，才能获得资金。第二个是最多五个小组将工作中的反应堆设计转变为更具商业可行性和监管准备的版本。最后，该项目资助的研究在2020年严格处于想象的领域，但将在“本世纪30年代中期”为跑道做好准备。\n此内容由第三方创建和维护，并导入到此页面以帮助用户提供其电子邮件地址。您可以在piano.io上找到有关此内容和类似内容的更多信息", "note_en": "A  new Department of Energy (DoE) program promises $160 million for two advanced  nuclear reactor designs and $70 million for further development.\n The expected first recipient is  NuScale, the Oregon startup that partners with university researchers on its small reactor.\n Advanced reactors are from generation III and IV, seeking more uniform and modular nuclear plants.\n   The Department of Energy (DoE) has started a new Office of Nuclear Energy project called the   Advanced Reactor Demonstration Program (ARDP). The $230 million program will give $160 million to scientists working on two reactor designs that “can be operational” in the very near future.\n The “Advanced” part of ARDP is an industry term for the generation of reactors we have today. The World Nuclear Association   explains:\n “Generation I reactors were developed in 1950-60s. Generation II reactors are typified by the present US and French fleets and most in operation elsewhere. So-called Generation III (and III+) are the advanced reactors, though the distinction from Generation II is arbitrary. The first ones are in operation in Japan and others are under construction in several countries.”\n Generation IV—the  super advanced reactors?—are in the research phase, but the ARDP statements mention development into the mid 2030s and likely includes generation IV.\n So the technical difference may be arbitrary, but the advanced reactors are often safer, smaller in overall form factor, and more standardized in order to be easier to install and scale. Most existing power plants are idiosyncratic, built on a case-by-case basis to suit individual communities or use cases. A more uniform process means plants that are easier to secure, support, and regulate.\n  “Advanced nuclear energy systems hold enormous potential to lower emissions, create new jobs, and build a strong economy,” Rita Baranwal, Assistant Secretary for the Office of Nuclear Energy, said in a   DoE statement.\n One of the leading projects the Nuclear Energy Institute (NEI) mentions   may sound familiar: “NuScale Power LLC is expected to receive the first small modular reactor design certification from the U.S. Nuclear Regulatory Commission later this year,” the NEI   reports. NuScale’s  tiny modular reactor is designed to be deployed for small communities with lower power needs and embodies advanced reactor values.\n  The DoE is linking the ARDP announcement with the recent Strategy To Restore American Nuclear Energy Leadership, whose   recommendations include “taking immediate and bold action to strengthen the uranium mining and conversion industries” and “supporting the U.S. nuclear energy industry in exporting civil nuclear technology.” (Maybe  Elon Musk will be able to  manufacture those 10,000 nuclear missiles after all.)\n Nuclear energy is pushed by the government primarily for its ability to reduce carbon emissions, but the NEI stresses that advanced reactors are more flexible than just that. The NEI   explains:\n “Once built, the advanced reactors being designed today will vary in size from our current reactors and may be used for additional purposes such as desalination, producing steam for industrial uses, and hydrogen generation for industrial and transportation needs.”\n Organizations can apply to three “pathways” for funding through this program. “Rapidly demonstrating advanced reactor designs [are] necessary to provide clean energy and expand market opportunities before access to key infrastructure and supply chain capabilities in the United States is lost,” the DoE   explains.\n The first pathway is to demonstrate a new light reactor design that must be fully functional within 7 years in order to receive the funding. The second is for up to five groups to turn working reactor designs into more commercially viable and regulation-ready versions. And finally, the project funds research that is strictly in the realm of the imagination in 2020, but will be ready for the runway by the “mid-2030s.”\n      This content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io", "posttime": "2020-05-21 02:32:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "核电,investment,反应堆", "title": "美国刚刚对下一代核电进行了投资", "title_en": "America Just Made an Investment in Next-Gen Nuclear Power", "transed": 1, "url": "https://www.popularmechanics.com/science/a32598099/advanced-nuclear-power-tiny-reactors/", "via": "", "real_tags": ["核电", "反应堆"]}, {"category": "", "categoryclass": "", "imagename": "54c0552ac11105775d05e5c9f4f0c7f4.jpg", "infoid": 1002994, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Twitter今天承认，它已经开始测试一项新的设置，该设置允许用户限制谁可以回复推文。这个背景在今年早些时候首次被注意到。与Facebook的帖子视图设置类似，当前的实现在角落里有一个小的手套图标。点击它会弹出一个“谁能回复？”窗户。\n从那里，用户可以从三个选项中选择一个：每个人，你关注的人，以及只有你提到的人。如果您选择后者中的任何一个，所有不符合描述的人的回复函数都将灰显。他们可以查看、点赞和转发，但不能直接回复发件人。线程本身也会确认回复是有限的。\n目前，只有“有限的群体”可以使用测试功能，但任何拥有Twitter账户的人都可以查看对话。由于它还处于测试阶段，不能保证这会成为一项通用功能，但Twitter表示，推出这一功能的目的是“让人们有更多机会发表意见，同时仍然让人们控制他们开始的对话。”\n产品管理总监苏珊娜·谢(Suzanne Xie)在宣布这一功能的帖子中提到了“回复男生”的现象。Twitter最大的优点和缺点之一是它相对于Facebook这样的平台是开放的。任何人和每个人都可以直接回复推特--这对发送者来说并不总是理想的。无论主题如何，回复往往会演变成辱骂回复的海洋。到目前为止，限制它们的唯一方法是锁定一个账户。\n在此之前，最近还试图修改回复，包括串连回复。很明显，近年来，这个问题已经成为该服务的首要任务。到目前为止的反应是…。好坏参半。至少从对宣布这一新功能的推文的回复来看是这样的。", "note_en": "Twitter today  acknowledged that it’s begun testing a new setting that let users limit who can reply to tweets. The setting was first noted  earlier this year.  Similar to Facebook’s post view settings, the current implementation features a small glove icon in the corner. Tapping on it brings up a “Who Can Reply?” window.\n  From there, users can pick from one of three options: Everyone, People You Follow and Only People You Mention. If you opt for either of the latter, the reply function will greyed out for all who don’t fit the description. They can view, like and retweet the thing, but they won’t be able to reply directly to the sender. The thread itself will also acknowledge that replies are limited.\n  Only a “limited group” can use the test feature right now, though anyone with a Twitter account can view the conversations. Since it’s in testing mode, there’s no guarantee that this will become a universal feature, but Twitter says the roll out is designed to “give people more opportunities to weigh in while still giving people control over the conversations they start.”\n Director of Product Management Suzanne Xie mentions the phenomenon of “ Reply   Guys” in a post announcing the feature. One of Twitter’s greatest benefits and downsides is its openness relative to platforms like Facebook. Anyone and everyone can reply directly to a tweet — and that’s not always ideal for the sender. Replies can often devolving into a sea of abusive responses, regardless of subject matter. Until now, the only way to limit them was to lock an account.\n  The move follows other recent attempts to revamp replies, including threaded responses. It’s clear the issue has become a top priority for the service in recent years. Reaction so far is…mixed. At least judging from the replies to the tweet announcing the new feature.", "posttime": "2020-05-21 01:51:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推特,testing,回复", "title": "推特正在测试一项限制谁可以回复你的推文的功能", "title_en": "Twitter is Testing a Feature That Limits Who Can Reply To Your Tweets", "transed": 1, "url": "https://techcrunch.com/2020/05/20/twitter-is-testing-a-feature-that-limits-who-can-reply-to-your-tweets/", "via": "", "real_tags": ["推特", "testing", "回复"]}, {"category": "", "categoryclass": "", "imagename": "9e62b936a141e39fbdf5eb53cc783c82.png", "infoid": 1002993, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每隔10年，JavaScript领域就会有一次更迭。我认为我们刚刚开始了一个加速变革的时期，未来可以被视为JavaScript的第三个时代。\nJS的第一个时代，从1997年到2007年，以一声巨响开始，以一声呜咽结束。你们都知道Brendan Eich的故事，也许大家不太了解ES4是如何在来自Flash/ActionScript等封闭生态系统的激烈竞争中步履蹒跚的。\nJS的第二个时代，从2009-2019年开始，从2009年的奇异之年开始，NPM、Node.js和ES6就是在那里诞生的。道格·克罗克福德(Doug Crockford)向我们展示了它的优点，用户构建了一整套JS构建工具和库，并将JS&39；的触角伸向了台式机和新款奇特的智能手机。到了2019年，我们甚至看到JS在Facebook的Hermes等手机上以及Svelte 3等编译器第一前端框架上出现了专门的运行时。JS的完整起源故事更好地由其主要作者布兰登·艾奇(Brendan Eich)和艾伦·沃夫斯-布罗克(Allen Wirfs-Brock)在“JavaScript：前20年”(JavaScript：The Firfs 20年)一书中讲述。\n2020年感觉就像是一个新时代的开始。如果说第一个时代是关于构建一种语言，第二个时代是关于用户探索和扩展语言，那么第三个时代是关于清除遗留的假设和折叠工具层。\n被清除的主要遗留假设是JS生态系统对CommonJS的依赖，这是一系列妥协的结果。它的替代者ES Modules已经等待了一段时间，但缺乏真正实现飞跃的动力，因为现有的工具速度很慢，但足够好。在前端，现代浏览器也配备了少量处理这些内容的功能，但是重要的细节还没有解决。Pika/Snowpack项目的定位是通过提供一个可以随着ES模块的制定而消失的门面来加速这一未来。\n各层也在以有趣的方式坍塌。Deno采取了一种激进的方法，编写了一个全新的运行时，将一系列执行测试、格式化、linting和捆绑等任务的常用工具压缩到一个二进制文件中，说出打字脚本，甚至包括一个标准库。罗马采取了不同的策略，折叠了Node.js上的所有这些层(据我所知，我离它不太近)。\n即使在前端框架中，正在进行的活动也是令人着迷的。Svelte将从动画到状态管理的一切都压缩到编译器中。Reaction正在探索metaframeworks和客户端-服务器集成。Vue正在开发一个名为Vite的unbundler开发服务器项目。\n所有这些工作的结果既是更好的开发体验(更快的构建)，也是更好的用户体验(更小的捆绑包，更快的功能交付)。\n2030年JavaScript第三时代的终结会是什么样子？让我知道你的猜测，👇", "note_en": "Every 10 years there is a changing of the guard in JavaScript. I think we have just started a period of accelerated change that could in future be regarded as the  Third Age of JavaScript.\n    The first age of JS, from 1997-2007, started with a bang and ended with a whimper. You all know Brendan Eich&#39;s story, and perhaps it is less known how the ES4 effort faltered amidst strong competition from closed ecosystems like Flash/Actionscript.\n  The second age of JS, from 2009-2019, started with the  annus mirabilis of 2009, where npm, Node.js, and ES6 were born. With Doug Crockford showing us  its good parts, users built a whole host of  JS Build Tools and libraries, and extended JS&#39; reach to both desktop and new fangled smart phones. Towards 2019 we even saw the emergence of specialized runtimes for JS on phones like  Facebook&#39;s Hermes as well as compiler first frontend frameworks like  Svelte 3. The full origin story of JS is better told by its principal authors, Brendan Eich and Allen Wirfs-Brock, in  JavaScript: The First 20 Years.\n    2020 feels like the start of a new Age. If the First Age was about building out a language, and the Second Age was about users exploring and expanding the language, the Third Age is about clearing away legacy assumptions and collapsing layers of tooling.\n    The main legacy assumption being cleared away is the JS ecosystem&#39;s reliance on CommonJS, which evolved as a series of compromises. Its replacement, ES Modules, has been waiting in the wings for a while, but lacked the momentum to truly take a leap because existing tooling was slow but &#34;good enough&#34;. On the frontend, modern browsers are equipped to handle these in small amounts too, but  important details haven&#39;t yet been resolved. The  Pika/Snowpack project is positioned to accelerate this future by providing a facade that can disappear as ES Modules get worked out.\n  Layers are also collapsing in interesting ways. Deno takes a radical approach of writing a whole new runtime, collapsing a bunch of common tools doing tasks like testing, formatting, linting and bundling into one binary, speaking TypeScript, and even including a  standard lib. Rome takes a different tack, collapsing all those layers atop of Node.js (as far as I know, I&#39;m not too close to it).\n  Even in frontend frameworks, the activity going on is fascinating. Svelte  collapsed everything from animations to state management into a compiler. React is exploring  metaframeworks and  client-server integration. And Vue is  working on an &#34;unbundler&#34; dev server project named Vite.\n  The result of all of this work is  both a better developer experience (faster builds) and  user experience (smaller bundles, faster feature delivery).\n  What will the end of JavaScript&#39;s Third Age in 2030 look like? Let me know your guess 👇", "posttime": "2020-05-21 01:50:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,javascript,age,js", "title": "JavaScript的第三个时代", "title_en": "The Third Age of JavaScript", "transed": 1, "url": "https://www.swyx.io/writing/js-third-age/", "via": "", "real_tags": ["java", "age", "js"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002992, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伊利诺伊州香槟。-大约公元前4000年，玉米种植从中美洲传播到现在的美国西南部，但这种作物是如何以及何时到达北美其他地区的，仍然是一个有争议的话题。在一项新的研究中，科学家们报告说，古代大都市卡霍基亚直到公元900年到1000年之间才开始种植玉米，这是一个相对较晚的日期，对应着这座城市快速扩张的开始。\n研究小组确定了在卡霍基亚及其周围的房屋、神殿和其他考古背景中发现的烧焦的玉米粒的年龄。研究人员还观察了埋在附近的108名人类和15只狗的牙齿和骨骼中的碳同位素。不同食物来源的碳同位素比率不同，玉米的同位素比率明显高于该地区几乎所有其他本土植物物种。通过分析牙齿和骨骼中碳12和碳13的比例，研究小组确定了卡霍基亚人在不同时期吃的不同类型食物的相对比例。\n玉米残留物和同位素分析显示，玉米消费始于900至1000年间的卡霍基亚(Cahokia)。这是在这座城市成长为大都市之前。\n领导这项研究的退休州立考古学家托马斯·爱默生(Thomas Emerson)说，“有一种观点认为，大约在基督时代，玉米出现在密西西比河流域中部，而玉米在世界这一地区的进化非常非常缓慢。”“但是卡霍基亚的数据显示，实际上玉米运抵这里的时间很晚。而事实上，玉米可能是这座城市的根基。“。\n研究小组包括伊利诺伊州考古调查局考古学家玛丽·西蒙、生物考古学家克里斯汀·海德曼、放射性碳年代测定分析师马修·福特和前研究生凯尔西·维特，她现在是布朗大学的博士后研究员。\n爱默生说，从大约1050年开始，卡霍基亚“在考古瞬间从一个只有几百人的小村庄发展成为拥有5000到10000人的城市的一部分”。人口最终扩大到至少4万人。然而，这种早期的城市生活实验是短暂的。到1350年，在经历了一段时间的干旱和内乱之后，这座城市的大部分人口已经散去。\n西蒙说，那些推测玉米是在公元一世纪初来到密西西比河流域中部的科学家们忽略了一个事实，即玉米必须适应完全不同的光温制度，才能在更高的纬度地区种植。西蒙对卡霍基亚和中西部其他地方发现的玉米粒进行了详尽的分析，他说，这些科学家忽视了一个事实，即这种植物必须适应完全不同的光温制度，才能在更高的纬度地区种植。他对卡霍基亚和中西部其他地方发现的玉米粒进行了详尽的分析。\n“玉米最初是在中美洲种植的，”她说。他说：“它的开花时间和生产时间受日照的多少所控制。当它进入这个地区时，它的开花不再与可用的日光相对应。如果春天种，八月才开花，冬天还没来得及收割。“\n她说：“公元0年前，它可能只是略微适应了现在美国西南部的高纬度地区。”因此，中西部地区在这么早的时候成功种植的潜力是非常有问题的。\nHedman说，当他们分析了埋在Cahokia的108个人的牙齿和骨骼中的碳同位素时，他们发现了一个与950到1000年间突然开始消费玉米一致的特征。埋葬在卡霍基亚及其附近的狗的数据也符合这一时间线。\n海德曼说：“这就是你在饮食中看到玉米的出现大幅增加的地方。”“这与玛丽·西蒙在玉米上发现的日期密切相关。”\n“在900到1000年之间，你也会开始看到卡霍基亚文化的真正转变，”爱默生说。“这是土堆建设的开始。随着生育图像的出现，人口大量增长，意识形态发生了戏剧性的转变。“。\n从Cahokia出土的文物包括从事农业活动的妇女的火石粘土雕像和标有水和肥力象征的器皿。其中一些物品描绘了玉米到来之前的作物，如向日葵和南瓜。\n西蒙说：“当玉米到达现场时，卡霍金人并不是没有农业基地。”“他们已经预先适应了整个耕作理念。”\n爱默生说，这座城市的文物中没有玉米肖像，这反映了在卡霍基亚第一次蓬勃发展的时候，玉米作为该地区相对较新的参与者的地位。\n伊利诺伊州交通部和ISAS支持这项研究。ISAS是伊利诺伊大学厄巴纳-香槟分校草原研究所的一个部门。\n编者按：如需联系托马斯·爱默生，请发送电子邮件至teee@illinois.edu。要联系克里斯汀·海德曼(Kristin Hedman)，请发送电子邮件至khedman@illinois.edu。要联系玛丽·西蒙，请发送电子邮件至msimon1@illinois.edu。要联系马修堡，请发送电子邮件至fort1@illinois.edu。\n论文“大卡霍基亚玉米消费时间和强度的同位素确认”可以在网上和I.新闻局的美国大学获得。doi：10.1017/aaq.2020.7", "note_en": "CHAMPAIGN, Ill. — Corn cultivation spread from Mesoamerica to what is now the American Southwest by about 4000 B.C., but how and when the crop made it to other parts of North America is still a subject of debate. In a new study, scientists report that corn was not grown in the ancient metropolis of Cahokia until sometime between A.D. 900 and 1000, a relatively late date that corresponds to the start of the city’s rapid expansion.\n    The research team determined the age of charred corn kernels found in homes, shrines and other archaeological contexts in and around Cahokia. The researchers also looked at carbon isotopes in the teeth and bones of 108 humans and 15 dogs buried in the vicinity. Carbon-isotope ratios differ among food sources, with isotope ratios of corn being significantly higher than those of almost all other native plant species in the region. By analyzing the ratio of carbon 12 to carbon 13 in teeth and bones, the team determined the relative proportion of different types of foods the people of Cahokia ate in different time periods.\n The corn remnants and isotope analyses revealed that corn consumption began in Cahokia between 900 and 1000. This was just before the city grew into a major metropolis.\n   “There’s been an idea that corn came to the central Mississippi River valley at about the time of Christ, and the evolution of maize in this part of the world was really, really slow,” said retired state archaeologist  Thomas Emerson, who led the study. “But this Cahokia data is saying that no, actually, corn arrived here very late. And in fact, corn may be the foundation of the city.”\n The research team included  Illinois State Archaeological Survey archaeobotanist  Mary Simon; bioarchaeologist  Kristin Hedman; radiocarbon dating analyst  Matthew Fort; and former graduate student Kelsey Witt, now a postdoctoral researcher at Brown University.\n Beginning in about 1050, Cahokia grew from “a little village of a few hundred people to part of a city with 5,000 to 10,000 people in an archaeological instant,” Emerson said. The population eventually expanded to at least 40,000. This early experiment in urban living was short-lived, however. By 1350, after a period of drought and civil strife, most of the city’s population had dispersed.\n Scientists who theorize that corn came to the central Mississippi River valley early in the first millennium A.D. are overlooking the fact that the plant had to adapt to a completely different light and temperature regime before it could be cultivated in the higher latitudes, said Simon, who conducted an exhaustive analysis of corn kernels found at Cahokia and elsewhere in the Midwest.\n “Corn was originally cultivated in Mesoamerica,” she said. “Its flowering time and production time are controlled by the amount of sunlight it gets. When it got up into this region, its flowering was no longer corresponding to the available daylight. If you planted it in the spring, it wouldn’t even start to flower until August, and winter would set in before you could harvest your crop.”\n  “It was probably only marginally adapted to high latitudes in what is now the southwestern United States by 0 A.D.,” she said. “So, the potential for successful cultivation in the Midwest at this early date is highly problematic.”\n   When they analyzed the carbon isotopes in the teeth and bones of 108 individuals buried in Cahokia between 600 and 1400, researchers saw a signature consistent with corn consumption beginning abruptly between 950 and 1000, Hedman said. The data from dogs buried at and near Cahokia also corresponded to this timeline.\n “That’s where you see this big jump in the appearance of corn in the diet,” Hedman said. “This correlates very closely with what Mary Simon is finding with the dates on the maize.”\n   “Between 900 and 1000 is also when you start to see a real shift in the culture of Cahokia,” Emerson said. “This was the beginning of mound construction. There was a massive growth of population and a dramatic shift in ideology with the appearance of fertility iconography.”\n Artifacts uncovered from Cahokia include flint-clay figurines of women engaged in agricultural activities and vessels marked with symbols of water and fertility. Some of the items depict crops such as sunflowers and squash that predated the arrival of corn.\n “It wasn’t like the Cahokians didn’t already have an agricultural base when corn arrived on the scene,” Simon said. “They were preadapted to the whole idea of cultivation.”\n The absence of corn iconography in artifacts from the city reflects corn’s status as a relative newcomer to the region at the time Cahokia first flourished, Emerson said.\n The Illinois Department of Transportation and ISAS supported this research. ISAS is a division of the  Prairie Research Institute at the University of Illinois at Urbana-Champaign.\n Editor’s notes:  To reach Thomas Emerson, email  teee@illinois.edu. To reach Kristin Hedman, email  khedman@illinois.edu. To reach Mary Simon, email  msimon1@illinois.edu. To reach Matthew Fort, email  fort1@illinois.edu.\n The paper “Isotopic confirmation of the timing and intensity of maize consumption in Greater Cahokia” is available  online and from the  U. of I. News Bureau. DOI:  10.1017/aaq.2020.7", "posttime": "2020-05-21 01:49:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "崛起,rise,玉米", "title": "Cahokia的崛起与玉米农业的开始平行", "title_en": "Cahokia's rise parallels onset of corn agriculture", "transed": 1, "url": "https://news.illinois.edu/view/6367/808689", "via": "", "real_tags": ["崛起", "rise", "玉米"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002991, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "$sudo apt-get install git htopread软件包列表.。正在创建依赖关系树正在读取状态信息.。do将安装以下额外软件包：git-man Liberror-perl建议软件包s：git-daemon-run git-daemon-sysvinit git-doc git-el git-email git-gui gitk gitweb git-arch git-bzr git-cvs git-mediawiki git-svn将安装以下新软件包：git git-man HTOP Liberror-perl 0升级，4个新安装。[是/否]。\n当您正在安装新的或不熟悉的软件时，询问是否继续并显示所有这些信息是很有用的，但当您第一百次安装时，则完全没有必要。\n向命令添加-y或--yes标志将删除确认消息：\n$sudo apt-get install git HTOP-y阅读包列表.。正在创建依赖关系树正在读取状态信息.。do将安装以下额外软件包：git-man Liberror-perl建议软件包：git-daemon-run git-daemon-sysvinit git-doc git-el git-email git-gui gitk gitweb git-arch git-bzr git-cvs git-mediawiki git-svn将安装以下新软件包：git git-man HTOP Liberror-perl 0升级，4新安装，将使用21.8 MB的额外磁盘空间。Get：1 http：//us.archive ve.ubuntu.com/ubuntu/trusted/main Liberror-perl all 0.17-1.1[21.1kB]GET：2 http：//us.archive ve.ubuntu.com/ubuntu/trusted-update/main git-man all 1：1.9.1-1ubuntu0.1[698 kB]GET：3 http：//us.archive ve.ubuntu.com/。1.9.1-1ubuntu0.1[2627kB]取3，346 kB in 0s(4，224kB/s)正在选择以前未选择的软件包Liberror-perl。(正在读取数据库.当前安装的60994个文件和目录。)正在准备解包./Liberror-perl_0.17-1.1_all.deb.正在解包Liberror-perl(0.17-1.1).正在选择以前未选择的软件包git-man.正在准备解包./git-man_1%3a1.9.1.1-1ubuntu0.1_all.deb.正在解压git-man(1：1.9.。1ubuntu0.1).正在选择以前未选择的包git。正在准备解包./git_1%3a1.9.1-1ubuntu0.1_amd64.deb.正在解包git(1：1.9.1-1ubuntu0.1).正在选择以前未选择的包htop.正在准备解包./HTOP_1.0.2-3_amd64.deb.正在解包HTOP(1.0.2-3).man-db(2.6)的处理触发器。).正在处理MIME支持的触发器(3.54ubuntu1).正在设置Liberror-Perl(0.17-1.1).正在设置git-man(1：1.9.1-1ubuntu0.1).正在设置git(1：1.9.1-1ubuntu0.1).正在设置HTOP(1.0.2-3).。\n但是仍然有太多的信息。通常情况下，您只想知道安装失败的时间。幸运的是，有一个--Q或--安静标志：\n$sudo apt-get install git htop-y-q读取软件包列表.正在生成依赖关系树.正在读取状态信息.建议的软件包：git-daemon-run git-daemon-sysvinit git-doc git-el git-email git-gui gitk gitweb git-arch git-bzr git-cvs git-mediawiki git-svn将安装以下新软件包：git HTOP 0升级，2新安装，0到。将使用20.4MB的额外磁盘空间。选择以前未选择的程序包GIT。(正在读取数据库.当前安装的61166个文件和目录。)正在准备解包./GIT_1%3a1.9..1-1ubuntu0.1_amd64.deb.正在解包GIT(1：1.9.1-1ubuntu0.1).正在选择以前未选择的程序包Htop.正在准备解包./HTOP_1.0.2-3_amd64.deb.。.正在处理MIME支持的触发器(3.54ubuntu1).正在处理man-db的触发器(2.6.7.1-1).正在设置GIT(1：1.9.1-1ubuntu0.1).正在设置HTOP(1.0.2-3).。\n让我们使用-qq标志将安静级别增加一倍(这是最大值)。这样做时，您可以省略-y，因为-qq暗示了这一点。\n$sudo apt-get install git htop-qq正在选择以前未选择的程序包git。(正在读取数据库.当前安装的61166个文件和目录。)正在准备解包./git_1%3a1.9..1-1ubuntu0.1_amd64.deb.正在解包git(1：1.9.1-1ubuntu0.1).正在选择以前未选择的程序包htop.正在准备解包./htop_1.0.2-3_amd64.deb.。正在处理MIME支持的触发器(3.54ubuntu1).正在处理man-db的触发器(2.6.7.1-1).正在设置GIT(1：1.9.1-1ubuntu0.1).正在设置HTOP(1.0.2-3).\n等等，什么？即使我们要求APT-GET安静下来，它也不会闭嘴！\n这实际上是dpkg(由apt-get派生的)的输出，而不是apt-get本身，这就是为什么我们会看到它。\n-o Dpkg：：use-pty=0如果有效，那就更好了，因为这样您仍然可以使用-q并查看一些有用的输出。\n$sudo apt--q-y-o Dpkg：：=0安装git htop正在读取软件包列表.正在生成依赖关系树.正在读取状态信息.建议的软件包：git-daemon-git-daemon-sysvinit git-doc git-el git-email git-gui gitk gitweb git-arch git-cvs git-mediawiki git-svn将安装以下新软件包：git htop0升级，2新安装，0。\n它将只安装git，因为只执行第一行。这是因为apt-get吞噬了第二行。\n将您自己添加到sudoers列表中，这样您就不必一遍又一遍地输入密码：", "note_en": "$ sudo apt- get install git htopReading package lists... DoneBuilding dependency treeReading state information... DoneThe following extra packages will  be installed: git-man liberror- perlSuggested package s: git-daemon-run git-daemon-sysvinit git-doc git- el git-email git- gui gitk gitweb git-arch git-bzr git-cvs git-mediawiki git-svnThe following NEW packages will  be installed: git git-man htop liberror- perl 0 upgraded,  4 newly installed,  0  to  remove  and  210 not upgraded.Need  to  get  3, 346 kB/ 3, 414 kB of archives.After this operation,  21.8 MB of additional disk space will  be used.Do you want  to  continue? [Y/n]\n Asking whether to continue and displaying all this information is useful to know when you&#39;re installing new or unfamiliar softwarebut completely unnecessary when you&#39;re doing it for the hundredth time.\n Adding a  -y or  --yes flag to the command will get rid of the confirmation message:\n $ sudo apt- get install git htop -yReading package lists... DoneBuilding dependency treeReading state information... DoneThe following extra packages will be installed: git-man liberror-perlSuggested packages: git-daemon-run git-daemon-sysvinit git-doc git-el git-email git-gui gitk gitweb git-arch git-bzr git-cvs git-mediawiki git-svnThe following NEW packages will be installed: git git-man htop liberror-perl 0 upgraded,  4 newly installed,  0 to remove  and  210  not upgraded.Need to  get  3, 346 kB/ 3, 414 kB of archives.After  this operation,  21.8 MB of additional disk space will be used.Get: 1 http: //us.archive.ubuntu.com/ubuntu/ trusty/main liberror-perl all 0.17-1.1 [21.1 kB]Get: 2 http: //us.archive.ubuntu.com/ubuntu/ trusty-updates/main git-man all 1:1.9.1-1ubuntu0.1 [698 kB]Get: 3 http: //us.archive.ubuntu.com/ubuntu/ trusty-updates/main git amd64 1:1.9.1-1ubuntu0.1 [2,627 kB]Fetched  3, 346 kB  in  0s ( 4, 224 kB/s)Selecting previously unselected package liberror-perl.(Reading database ...  60994 files  and directories currently installed.)Preparing to unpack .../liberror-perl_0 .17 -1.1_all.deb ...Unpacking liberror-perl ( 0.17 -1.1) ...Selecting previously unselected package git-man.Preparing to unpack .../git-man_1% 3a1 .9 .1 -1ubuntu0 .1_all.deb ...Unpacking git-man ( 1: 1.9 .1 -1ubuntu0 .1) ...Selecting previously unselected package git.Preparing to unpack .../git_1% 3a1 .9 .1 -1ubuntu0 .1_amd64.deb ...Unpacking git ( 1: 1.9 .1 -1ubuntu0 .1) ...Selecting previously unselected package htop.Preparing to unpack .../htop_1 .0 .2 -3_amd64.deb ...Unpacking htop ( 1.0 .2 -3) ...Processing triggers  for man-db ( 2.6 .7 .1 -1) ...Processing triggers  for mime-support ( 3.54ubuntu1) ...Setting up liberror-perl ( 0.17 -1.1) ...Setting up git-man ( 1: 1.9 .1 -1ubuntu0 .1) ...Setting up git ( 1: 1.9 .1 -1ubuntu0 .1) ...Setting up htop ( 1.0 .2 -3) ...\n But there&#39;s still way too much information. Normally you&#39;d only want to know when the installation fails.Luckily there&#39;s a  -q or  --quiet flag:\n $ sudo apt- get install git htop -y -qReading package lists...Building dependency tree...Reading state information...Suggested packages: git-daemon-run git-daemon-sysvinit git-doc git-el git-email git-gui gitk gitweb git-arch git-bzr git-cvs git-mediawiki git-svnThe following NEW packages will be installed: git htop 0 upgraded,  2 newly installed,  0 to remove  and  210  not upgraded.Need to  get  0 B/ 2, 695 kB of archives.After  this operation,  20.4 MB of additional disk space will be used.Selecting previously unselected package git.(Reading database ...  61166 files  and directories currently installed.)Preparing to unpack .../git_1% 3a1 .9 .1 -1ubuntu0 .1_amd64.deb ...Unpacking git ( 1: 1.9 .1 -1ubuntu0 .1) ...Selecting previously unselected package htop.Preparing to unpack .../htop_1 .0 .2 -3_amd64.deb ...Unpacking htop ( 1.0 .2 -3) ...Processing triggers  for mime-support ( 3.54ubuntu1) ...Processing triggers  for man-db ( 2.6 .7 .1 -1) ...Setting up git ( 1: 1.9 .1 -1ubuntu0 .1) ...Setting up htop ( 1.0 .2 -3) ...\n  Let&#39;s double the quiet level (which is the maximum) by using the  -qq flag.When doing that you can omit  -y since  -qq implies it.\n $ sudo apt- get install git htop -qqSelecting previously unselected package git.(Reading database ...  61166 files  and directories currently installed.)Preparing to unpack .../git_1% 3a1 .9 .1 -1ubuntu0 .1_amd64.deb ...Unpacking git ( 1: 1.9 .1 -1ubuntu0 .1) ...Selecting previously unselected package htop.Preparing to unpack .../htop_1 .0 .2 -3_amd64.deb ...Unpacking htop ( 1.0 .2 -3) ...Processing triggers  for mime-support ( 3.54ubuntu1) ...Processing triggers  for man-db ( 2.6 .7 .1 -1) ...Setting up git ( 1: 1.9 .1 -1ubuntu0 .1) ...Setting up htop ( 1.0 .2 -3) ...\n Wait, what? Even though we asked  apt-get to be quiet it still would not shut up!\n That&#39;s actually the output of  dpkg (which was forked by  apt-get) not  apt-get itself and that is why we&#39;re seeing it.\n        -o Dpkg::Use-Pty=0 would be great if it worked because then you could still use  -q and see some useful output\n $ sudo apt-  -q -y -o Dpkg:: =0 install git htopReading package lists ...Building dependency tree ...Reading state information ...Suggested packages: git-daemon-  git-daemon-sysvinit git-doc git-el git-email git-gui gitk gitweb git-arch git-cvs git-mediawiki git-svnThe following NEW packages will be installed: git htop0 upgraded, 2 newly installed, 0  to    and 2  not upgraded.Need  to   0 B/2,861 kB of archives.After this operation, 21.5 MB of additional disk space will be used.Selecting previously unselected package git.\n    It&#39;ll only install  git since only the first line is executed. That&#39;s because  apt-get swallows the second line.\n         Add yourself to the  sudoers list so that you don&#39;t have to enter your password over and over again:", "posttime": "2020-05-21 01:49:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apt,unattended,git", "title": "使用apt-get进行安静且无人值守的安装(2015)", "title_en": "Quiet and unattended installation with apt-get (2015)", "transed": 1, "url": "https://peteris.rocks/blog/quiet-and-unattended-installation-with-apt-get/", "via": "", "real_tags": ["apt", "git"]}, {"category": "", "categoryclass": "", "imagename": "4d8f7fb3aa7a46aaaf49c2063aca8438.png", "infoid": 1002990, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "C#9.0正在成型，我想与您分享我们对该语言下一版本中添加的一些主要特性的看法。\n对于每个新版本的C#，我们都努力在常见的编码场景中实现更高的清晰度和简单性，C#9.0也不例外。这一次的一个特别焦点是支持数据形状的简洁和不可变的表示形式。\n对象初始化器非常棒。它们为某种类型的客户端提供了一种非常灵活且可读的格式来创建对象，尤其适用于一次性创建整个对象树的嵌套对象创建。这里有一个简单的例子：\n对象初始化器还将类型作者从编写大量构造样板中解放出来-他们所要做的就是编写一些属性！\n公共类Person{public String FirstName{get；Set；}公共字符串LastName{get；Set；}}。\n目前的一大限制是属性必须是可变的，对象初始化器才能工作：它们的功能是首先调用对象的构造函数(在本例中是缺省的、无参数的构造函数)，然后将其分配给属性设置器。\n仅初始化属性解决了这个问题！它们引入了一个初始化访问器，它是set访问器的变体，只能在对象初始化期间调用：\n公共类Person{public String FirstName{get；init；}公共字符串LastName{get；init；}}\n使用此声明，上面的客户端代码仍然是合法的，但是任何后续对FirstName和LastName属性的赋值都是错误的。\n因为初始化访问器只能在初始化期间调用，所以允许它们改变封闭类的只读字段，就像您在构造函数中可以做的那样。\n公共类Person{private readonly string firstName；private readonly string lastName；public string firstName{get=&gt；firstName；init=&gt；firstName=(value？？抛出新的ArgumentNullException(nameof(FirstName))；}公共字符串LastName{get=&gt；lastName；init=&gt；lastName=(value？？抛出新的ArgumentNullException(nameof(LastName))；}}。\n如果您希望使各个属性不可变，则仅初始化属性非常有用。如果您希望整个对象是不可变的，并且行为类似于一个值，那么您应该考虑将其声明为记录：\n公共数据类Person{public String FirstName{get；init；}公共String LastName{get；init；}}。\n类声明上的DATA关键字将其标记为记录。这给它注入了几个额外的类似值的行为，我们将在下面深入研究这些行为。一般来说，记录更多地被视为“值”--数据！--而不是对象。它们不应该具有可变的封装状态。相反，您可以通过创建表示新状态的新记录来表示随时间的变化。它们不是由它们的身份来定义的，而是由它们的内容来定义的。\n在处理不可变数据时，一种常见的模式是从现有值创建新值来表示新状态。例如，如果我们的人要更改他们的姓氏，我们会将其表示为一个新对象，该对象是旧对象的副本，只是使用了不同的姓氏。这种技术通常被称为非破坏性突变。记录代表的不是人在一段时间内的状态，而是人在给定时间的状态。\n为了帮助实现这种编程风格，记录允许使用一种新的表达式；with-表达式：\nwith-表达式使用对象初始值设定项语法来声明新对象与旧对象的不同之处。您可以指定多个属性。\n记录隐式定义了受保护的“复制构造函数”-该构造函数接受现有记录对象并将其逐个字段复制到新的记录对象中：\nWith表达式导致调用复制构造函数，然后在顶部应用对象初始值设定项以相应地更改属性。\n如果您不喜欢生成的复制构造函数的默认行为，您可以定义自己的行为，这将由with表达式选择。\n所有对象都从Object类继承一个虚拟的equals(Object)方法。当两个参数都非空时，这用作Object.Equals(Object，Object)静态方法的基础。\n结构将其覆盖为具有“基于值的相等”，通过递归调用结构的每个字段上的equals来比较它们。唱片也是这样做的。\n这意味着根据它们的“价值性”，两个记录对象可以彼此相等，而不是相同的对象。例如，如果我们再次修改修改后的人员的姓氏：\n我们现在的ReferenceEquals(Person，OriginalPerson)=false(它们不是同一个对象)，但是equals(Person，OriginalPerson)=true(它们具有相同的值)。\n如果您不喜欢生成的equals重写的默认逐字段比较行为，您可以编写自己的行为。您只需要小心理解基于值的相等在记录中是如何工作的，特别是当涉及到继承时，我们将在下面讨论这一点。\n除了基于值的equals之外，还有一个基于值的GetHashCode()覆盖。\n绝大多数记录都是不可变的，只有init-only的公共属性可以通过with-expression进行非破坏性修改。为了针对这种常见情况进行优化，记录会更改表单字符串FirstName的简单成员声明的默认值。与其他类和结构声明中的隐式私有字段不同，在记录中，这被认为是公共的、仅限初始化的自动属性的简写！因此，宣言：\n公共数据类Person{public String FirstName{get；init；}公共String LastName{get；init；}}。\n我们认为这使得声明变得漂亮而清晰。如果您确实需要私有字段，只需显式添加private修饰符即可：\n有时，对记录采用更多的位置方法很有用，因为它的内容是通过构造函数参数给出的，并且可以通过位置解构来提取。\n完全可以在记录中指定您自己的构造函数和解构函数：\n公共数据类Person{String FirstName；String LastName；public Person(String FirstName，String LastName)=&&gt;；(FirstName，LastName)=(FirstName，LastName)=(FirstName，LastName)；public void deconstruct(out String FirstName，out String LastName)=&gt；(FirstName，LastName)=(FirstName，LastName)；}\n但是有一个更短的语法来表达完全相同的内容(参数名模大小写)：\n这将声明公共的仅初始化自动属性以及构造函数和解构函数，以便您可以编写：\nvar Person=新的人(&#34；Scott&34；，&#34；Hunter&34；)；//位置结构var(f，l)=Person；//位置解构。\n如果您不喜欢生成的自动属性，您可以定义您自己的同名属性，生成的构造函数和解构函数将只使用该属性。\n记录的基于值的语义与可变状态不能很好地结合。想象一下将一个记录对象放入字典中。再次找到它取决于EQUALS和(有时)GethashCode。但是如果记录改变了它的状态，它也会改变它等于的内容！我们可能再也找不到了！在哈希表实现中，它甚至可能损坏数据结构，因为放置是基于它“到达时”的哈希代码！\n在记录中可能有一些可变状态的有效高级用法，特别是用于缓存。但是，覆盖默认行为以忽略此类状态所涉及的手动工作可能会相当繁重。\n基于值的平等和非破坏性突变在与继承相结合时是出了名的具有挑战性。让我们将派生记录类Study添加到我们的运行示例中：\n公共数据类Person{String FirstName；String LastName；}公共数据类学生：Person{int ID；}\n让我们从-expression示例开始，实际创建一个Student，但将其存储在Person变量中：\nPerson Person=新学生{FirstName=&#34；Scott&#34；，LastName=&#34；Hunter&#34；，ID=GetNewId()}；其他Person=具有{LastName=&#34；Hanselman&#34；}；\n在最后一行的with-expression处，编译器并不知道该Person实际上包含了一名学生。然而，如果新的人实际上不是一个学生对象，并且与第一个复制过来的人具有相同的ID，那么它就不是一个正确的副本。\nC#实现了这一点。记录有一个隐藏的虚拟方法，委托它“克隆”整个对象。每个派生记录类型重写此方法以调用该类型的复制构造函数，并将派生记录的复制构造函数链到基记录的复制构造函数。with-expression只调用隐藏的“clone”方法，并将对象初始值设定项应用于结果。\n与With-Expression支持类似，基于值的等式也必须是“虚拟的”，因为学生需要比较所有的学生字段，即使在比较时静态已知的类型是像Person这样的基类型。这很容易通过重写已经有效的equals方法来实现。\n然而，平等还有一个额外的挑战：如果你比较两种不同的人会怎么样？我们真的不能让他们中的一个来决定应用哪一个相等：相等应该是对称的，所以无论两个对象中哪一个先出现，结果都应该是相同的。换句话说，他们必须就适用的平等达成一致！\n人员Person1=新人员{FirstName=&#34；Scott&#34；，LastName=&#34；Hunter&#34；}；人员Pers2=新学生{FirstName=&#34；Scott&#34；，LastName=&#34；Hunter&#34；，ID=GetNewId()}；\n这两个物体是否相等？角色1可能是这样认为的，因为角色2拥有所有人的权利，但是角色2却不敢苟同！我们需要确保他们都同意他们是不同的对象。\n同样，C#会自动为您处理此问题。它的实现方式是记录有一个名为EqualityContract的虚拟受保护属性。每个派生记录都会覆盖它，为了比较相等，这两个对象必须具有相同的EqualityContract。\n这不仅会让语言初学者不堪重负，而且会使代码变得混乱，并增加缩进级别。\n在C#9.0中，您可以选择在顶层编写主程序：\n允许任何语句。该程序必须在使用之后、文件中的任何类型或名称空间声明之前进行，并且您只能在一个文件中执行此操作，就像您现在只能有一个main方法一样。\n如果要返回状态代码，可以这样做。如果你想等事情，你可以那样做。如果您想访问命令行参数，可以使用args作为“神奇”参数。\n局部函数是语句的一种形式，在顶级程序中也是允许的。从顶层语句节之外的任何位置调用它们都是错误的。\nC#9.0中添加了几种新的模式。让我们在模式匹配教程中的这段代码片段的上下文中查看它们：\n公共静态小数计算通行费(目标车辆)=&gt；车辆开关{.。DeliveryTruck t当t.GrossWeightClass&gt；5000=&gt；10.00m+5.00m时，DeliveryTruck t当t.GrossWeightClass&lt；3000=&gt；10.00m-2.00m时，DeliveryTruck_=&gt；10.00m，_=&gt；抛出新的ArgumentException(&#34；不是已知的车辆类型&#34；，名称为(Vehicle))}；\n目前，类型模式需要在类型匹配时声明标识符-即使该标识符是Discard_，就像上面的DeliveryTruck_那样。但现在您只需编写类型：\nC#9.0引入了与关系运算符&lt；、&lt；=等相对应的模式。因此，您现在可以将上述模式的DeliveryTruck部分编写为嵌套开关表达式：\nDeliveryTruck t当t.GrossWeightClass交换机{&gt；5000=&gt；10.00m+5.00m，&lt；3000=&gt；10.00m-2.00m，_=&gt；10.00m，}，\n最后，您可以将模式与逻辑运算符AND、OR和NOT组合为单词，以避免与表达式中使用的运算符混淆。例如，上面嵌套开关的情况可以按升序排列，如下所示：\nDeliveryTruck t当t.GrossWeightClass开关{&lt；3000=&gt；10.00M-2.00M，&lt；=3000且&lt；=5000=&gt；10.00M，&gt；5000=&gt；10.00M+5.00M，}，\n中间的情况使用AND组合两个关系模式，形成一个表示间隔的模式。\nNOT模式的常见用法是将其应用于NULL常量模式，如NOT NULL。例如，我们可以根据未知案例是否为空来划分未知案例的处理：\nNOT NULL=&gT；抛出新的ArgumentException($&#34；不是已知的车辆类型：{Vehicle}&#34；，nameof(Vehicle))，NULL=&gt；抛出新的ArgumentNullException(nameof(Vehicle))\nAlso Not在包含is表达式的if条件中会很方便，而不是使用笨拙的双圆括号：\n“目标类型”是我们用来表示表达式从其使用位置的上下文中获取其类型时使用的术语。例如，null和lambda表达式总是目标类型的。\n在C#9.0中，一些以前不是目标类型的表达式变得能够由它们的上下文来引导。\nC#中的新表达式始终要求指定类型(隐式类型数组表达式除外)。现在，如果有明确的类型为表达式赋值，则可以省略该类型。\n有时是有条件的？？AND？：表达式在分支之间没有明显的共享类型。这样的情况现在失败了，但是如果有两个分支都转换成的目标类型，C#9.0将允许它们：\n人人=学生？？客户；//共享库类型？result=b？0：空；//可以为空的值类型。\n有时，表示派生类中的方法重写具有比基类型中的声明更具体的返回类型是很有用的。C#9.0允许：\n抽象类Animal{public抽象Food GetFood()；.}类Tiger：Animal{public Override Meat GetFood()=&gt；.；}\n查看C#9.0即将推出的全套特性并跟踪其完成情况的最佳位置是Roslyn(C#/VB编译器)GitHub Repo上的语言特性状态。", "note_en": "C# 9.0 is taking shape, and I’d like to share our thinking on some of the major features we’re adding to this next version of the language.\n With every new version of C# we strive for greater clarity and simplicity in common coding scenarios, and C# 9.0 is no exception. One particular focus this time is supporting terse and immutable representation of data shapes.\n   Object initializers are pretty awesome. They give the client of a type a very flexible and readable format for creating an object, and they are especially great for nested object creation where a whole tree of objects is created in one go. Here’s a simple one:\n  Object initializers also free the type author from writing a lot of construction boilerplate – all they have to do is write some properties!\n public class Person{ public string FirstName { get; set; } public string LastName { get; set; }}\n The one big limitation today is that the properties have to be  mutable for object initializers to work: They function by first calling the object’s constructor (the default, parameterless one in this case) and then assigning to the property setters.\n Init-only properties fix that! They introduce an  init accessor that is a variant of the  set accessor which can only be called during object initialization:\n public class Person{ public string FirstName { get; init; } public string LastName { get; init; }}\n With this declaration, the client code above is still legal, but any subsequent assignment to the  FirstName and  LastName properties is an error.\n  Because  init accessors can only be called during initialization, they are allowed to mutate  readonly fields of the enclosing class, just like you can in a constructor.\n public class Person{ private readonly string firstName; private readonly string lastName; public string FirstName { get =&gt; firstName; init =&gt; firstName = (value ?? throw new ArgumentNullException(nameof(FirstName))); } public string LastName { get =&gt; lastName; init =&gt; lastName = (value ?? throw new ArgumentNullException(nameof(LastName))); }}\n  Init-only properties are great if you want to make individual properties immutable. If you want the whole object to be immutable and behave like a value, then you should consider declaring it as a  record:\n public data class Person{ public string FirstName { get; init; } public string LastName { get; init; }}\n The  data keyword on the class declaration marks it as a record. This imbues it with several additional value-like behaviors, which we’ll dig into in the following. Generally speaking, records are meant to be seen more as “values” – data! – and less as objects. They aren’t meant to have mutable encapsulated state. Instead you represent change over time by creating new records representing the new state. They are defined not by their identity, but by their contents.\n  When working with immutable data, a common pattern is to create new values from existing ones to represent a new state. For instance, if our person were to change their last name we would represent it as a new object that’s a copy of the old one, except with a different last name. This technique is often referred to as  non-destructive mutation. Instead of representing the person  over time, the record represents the person’s state  at a given time.\n To help with this style of programming, records allow for a new kind of expression; the  with-expression:\n  With-expressions use object initializer syntax to state what’s different in the new object from the old object. You can specify multiple properties.\n A record implicitly defines a  protected “copy constructor” – a constructor that takes an existing record object and copies it field by field to the new one:\n  The  with expression causes the copy constructor to get called, and then applies the object initializer on top to change the properties accordingly.\n If you don’t like the default behavior of the generated copy constructor you can define your own instead, and that will be picked up by the  with expression.\n  All objects inherit a virtual  Equals(object) method from the  object class. This is used as the basis for the  Object.Equals(object, object) static method when both parameters are non-null.\n Structs override this to have “value-based equality”, comparing each field of the struct by calling  Equals on them recursively. Records do the same.\n This means that in accordance with their “value-ness” two record objects can be equal to one another without being the  same object. For instance if we modify the last name of the modified person back again:\n  We would now have  ReferenceEquals(person, originalPerson) = false (they aren’t the same object) but  Equals(person, originalPerson) = true (they have the same value).\n If you don’t like the default field-by-field comparison behavior of the generated  Equals override, you can write your own instead. You just need to be careful that you understand how value-based equality works in records, especially when inheritance is involved, which we’ll come back to below.\n Along with the value-based  Equals there’s also a value-based  GetHashCode() override to go along with it.\n  Records are overwhelmingly intended to be immutable, with init-only public properties that can be non-destructively modified through  with-expressions. In order to optimize for that common case, records change the defaults of what a simple member declaration of the form  string FirstName means. Instead of an implicitly private field, as in other class and struct declarations, in records this is taken to be shorthand for a public, init-only auto-property! Thus, the declaration:\n   public data class Person{ public string FirstName { get; init; } public string LastName { get; init; }}\n We think this makes for beautiful and clear record declarations. If you really want a private field, you can just add the  private modifier explicitly:\n   Sometimes it’s useful to have a more positional approach to a record, where its contents are given via constructor arguments, and can be extracted with positional deconstruction.\n It’s perfectly possible to specify your own constructor and deconstructor in a record:\n public data class Person { string FirstName; string LastName; public Person(string firstName, string lastName) =&gt; (FirstName, LastName) = (firstName, lastName); public void Deconstruct(out string firstName, out string lastName) =&gt; (firstName, lastName) = (FirstName, LastName);}\n But there’s a much shorter syntax for expressing exactly the same thing (modulo casing of parameter names):\n  This declares the public init-only auto-properties  and the constructor  and the deconstructor, so that you can write:\n var person = new Person(&#34;Scott&#34;, &#34;Hunter&#34;); // positional constructionvar (f, l) = person; // positional deconstruction\n If you don’t like the generated auto-property you can define your own property of the same name instead, and the generated constructor and deconstructor will just use that one.\n  The value-based semantics of a record don’t gel well with mutable state. Imagine putting a record object into a dictionary. Finding it again depends on  Equals and (sometimes)  GethashCode. But if the record changes its state, it will also change what it’s equal to! We might not be able to find it again! In a hash table implementation it might even corrupt the data structure, since placement is based on the hash code it has “on arrival”!\n There are probably some valid advanced uses of mutable state inside of records, notably for caching. But the manual work involved in overriding the default behaviors to ignore such state is likely to be considerable.\n  Value-based equality and non-destructive mutation are notoriously challenging when combined with inheritance. Let’s add a derived record class  Student to our running example:\n public data class Person { string FirstName; string LastName; }public data class Student : Person { int ID; }\n And let’s start our  with-expression example by actually creating a  Student, but storing it in a  Person variable:\n Person person = new Student { FirstName = &#34;Scott&#34;, LastName = &#34;Hunter&#34;, ID = GetNewId() };otherPerson = person with { LastName = &#34;Hanselman&#34; };\n At the point of that  with-expression on the last line the compiler has no idea that  person actually contains a  Student. Yet, the new person wouldn’t be a proper copy if it wasn’t  actually a  Student object, complete with the same  ID as the first one copied over.\n C# makes this work. Records have a hidden virtual method that is entrusted with “cloning” the  whole object. Every derived record type overrides this method to call the copy constructor of that type, and the copy constructor of a derived record chains to the copy constructor of the base record. A  with-expression simply calls the hidden “clone” method and applies the object initializer to the result.\n  Similarly to the  with-expression support, value-based equality also has to be “virtual”, in the sense that  Students need to compare all the  Student fields, even if the statically known type at the point of comparison is a base type like  Person. That is easily achieved by overriding the already virtual  Equals method.\n However, there is an additional challenge with equality: What if you compare two  different kinds of  Person? We can’t really just let one of them decide which equality to apply: Equality is supposed to be symmetric, so the result should be the same regardless of which of the two objects come first. In other words, they have to  agree on the equality being applied!\n  Person person1 = new Person { FirstName = &#34;Scott&#34;, LastName = &#34;Hunter&#34; };Person person2 = new Student { FirstName = &#34;Scott&#34;, LastName = &#34;Hunter&#34;, ID = GetNewId() };\n Are the two objects equal to one another?  person1 might think so, since  person2 has all the  Person things right, but  person2 would beg to differ! We need to make sure that they both agree that they are different objects.\n Once again, C# takes care of this for you automatically. The way it’s done is that records have a virtual protected property called  EqualityContract. Every derived record overrides it, and in order to compare equal, the two objects musts have the same  EqualityContract.\n    This is not only overwhelming for language beginners, but clutters up the code and adds levels of indentation.\n In C# 9.0 you can just choose to write your main program at the top level instead:\n  Any statement is allowed. The program has to occur after the  usings and before any type or namespace declarations in the file, and you can only do this in one file, just as you can have only one  Main method today.\n If you want to return a status code you can do that. If you want to  await things you can do that. And if you want to access command line arguments,  args is available as a “magic” parameter.\n Local functions are a form of statement and are also allowed in the top level program. It is an error to call them from anywhere outside of the top level statement section.\n  Several new kinds of patterns have been added in C# 9.0. Let’s look at them in the context of this code snippet from the  pattern matching tutorial:\n public static decimal CalculateToll(object vehicle) =&gt; vehicle switch { ... DeliveryTruck t when t.GrossWeightClass &gt; 5000 =&gt; 10.00m + 5.00m, DeliveryTruck t when t.GrossWeightClass &lt; 3000 =&gt; 10.00m - 2.00m, DeliveryTruck _ =&gt; 10.00m, _ =&gt; throw new ArgumentException(&#34;Not a known vehicle type&#34;, nameof(vehicle)) };\n  Currently, a type pattern needs to declare an identifier when the type matches – even if that identifier is a discard  _, as in  DeliveryTruck _ above. But now you can just write the type:\n   C# 9.0 introduces patterns corresponding to the relational operators  &lt;,  &lt;= and so on. So you can now write the  DeliveryTruck part of the above pattern as a nested switch expression:\n DeliveryTruck t when t.GrossWeightClass switch{ &gt; 5000 =&gt; 10.00m + 5.00m, &lt; 3000 =&gt; 10.00m - 2.00m, _ =&gt; 10.00m,},\n   Finally you can combine patterns with logical operators  and,  or and  not, spelled out as words to avoid confusion with the operators used in expressions. For instance, the cases of the nested switch above could be put into ascending order like this:\n DeliveryTruck t when t.GrossWeightClass switch{ &lt; 3000 =&gt; 10.00m - 2.00m, &gt;= 3000 and &lt;= 5000 =&gt; 10.00m, &gt; 5000 =&gt; 10.00m + 5.00m,},\n The middle case there uses  and to combine two relational patterns and form a pattern representing an interval.\n A common use of the  not pattern will be applying it to the  null constant pattern, as in  not null. For instance we can split the handling of unknown cases depending on whether they are null:\n not null =&gt; throw new ArgumentException($&#34;Not a known vehicle type: {vehicle}&#34;, nameof(vehicle)),null =&gt; throw new ArgumentNullException(nameof(vehicle))\n Also  not is going to be convenient in if-conditions containing is-expressions where, instead of unwieldy double parentheses:\n     “Target typing” is a term we use for when an expression gets its type from the context of where it’s being used. For instance  null and lambda expressions are always target typed.\n In C# 9.0 some expressions that weren’t previously target typed become able to be guided by their context.\n  new expressions in C# have always required a type to be specified (except for implicitly typed array expressions). Now you can leave out the type if there’s a clear type that the expressions is being assigned to.\n   Sometimes conditional  ?? and  ?: expressions don’t have an obvious shared type between the branches. Such cases fail today, but C# 9.0 will allow them if there’s a target type that both branches convert to:\n Person person = student ?? customer; // Shared base typeint? result = b ? 0 : null; // nullable value type\n  It’s sometimes useful to express that a method override in a derived class has a more specific return type than the declaration in the base type. C# 9.0 allows that:\n abstract class Animal{ public abstract Food GetFood(); ...}class Tiger : Animal{ public override Meat GetFood() =&gt; ...;}\n  The best place to check out the full set of upcoming features for C# 9.0 and follow their completion is the  Language Feature Status on the Roslyn (C#/VB Compiler) GitHub repo.", "posttime": "2020-05-21 01:48:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c#,类型", "title": "欢迎使用C#9.0", "title_en": "Welcome to C# 9.0", "transed": 1, "url": "https://devblogs.microsoft.com/dotnet/welcome-to-c-9-0/", "via": "", "real_tags": ["c#", "类型"]}, {"category": "", "categoryclass": "", "imagename": "a0f7faed7997cedd5f7295caa328f496.jpeg", "infoid": 1002989, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "非官方API库的集合。旨在激励你下周五晚上的黑客活动。您可以自行决定是否使用。\n如果有兴趣添加您自己的API库，请提交拉取请求。说明可在Contributing.md中找到", "note_en": "A collection of unofficial api libraries. Designed to inspire your next Friday night hack. Use at your own discretion.\n Interested in adding your own API library, submit a pull request. Instructions can be found in  Contributing.md", "posttime": "2020-05-21 01:08:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "提供,apis,是否", "title": "非官方API：为您的下一次攻击提供的库的集合列表", "title_en": "Unofficial APIs: A collective list of libraries for your next hack", "transed": 1, "url": "https://github.com/Rolstenhouse/unofficial-apis", "via": "", "real_tags": ["提供", "apis", "是否"]}, {"category": "", "categoryclass": "", "imagename": "6a2eff0d3b8c35e93dff816f9cca4fca.jpg", "infoid": 1002988, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "20年来，布鲁斯·坎贝尔(Bruce Campbell)一直住在波特兰郊外的一架波音727飞机上，他认为更多的人应该考虑将退休的喷气式客机作为家。就像.。", "note_en": "For 20 years, Bruce Campbell has lived on a Boeing 727 in the woods outside Portland and he thinks more people should consider retired jetliners as homes. As...", "posttime": "2020-05-21 01:07:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "建筑,living,应该", "title": "独自住在一辆727露营车里，作为倒塌的建筑-基尔斯滕·德克森(Kirsten Dirksen)", "title_en": "Solo living in a camper 727 as architecture of collapse – Kirsten Dirksen", "transed": 1, "url": "https://www.youtube.com/watch?v=oquV0vvhjh0", "via": "", "real_tags": ["建筑", "living", "应该"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002987, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在旧西部，早在佩戴大手帕的抢劫犯撞倒舞台马车和戴滑雪面具的土匪抢劫银行之前，口罩就让犯罪分子站得很远，现在他们可以像忧心忡忡的会计师、护士和商店店员一样混入其中，试图避免一种致命的病毒。宾夕法尼亚州弗莱克维尔小社区的警察局长理查德·贝尔(Richard Bell)表示，罪犯们很聪明，这是他们隐藏自己、融入其中的绝佳机会。他说，他知道该地区最近发生了七起武装抢劫事件，每个嫌疑人都戴着面具。\n到底有多少罪犯利用大流行实施犯罪是无法估计的，但执法官员毫无疑问，这个数字正在攀升。美国和世界其他地区的犯罪报告开始如雨后春笋般涌现，这在很大程度上是因为我们中的许多人现在都戴着口罩。\n今年3月，两名男子戴着与那里许多赛车迷相同的外科口罩走进纽约的渡槽赛马场，用枪指着三名工人，抢走了他们从游戏机搬到保险箱的25万美元。最近几周，北卡罗来纳州、华盛顿特区和其他地方也发生了其他涉及戴外科口罩的嫌疑人的抢劫案。\n这篇文章全是轶事，没有真实数据。但这可能是一种趋势。\n政客们通常会将非犯罪行为定为刑事犯罪，因为这有时有助于识别真正的罪犯--但这也会将许多无辜的人归入不公正的、人为的犯罪类别。\n在美国，政客们没有宪法权力将戴面具定为犯罪(就像许多地方一样)，但政客们很少受到这种古怪观念的限制。\n此外，如果犯罪率上升，人们必须问一问，这实际上是与感知到的机会有关，还是仅仅是因为不断恶化的经济状况带来的压力？\n这必须有一个或多个限制因素。早在冠状病毒大流行之前，戴口罩在东亚就很常见，但戴口罩的恶棍并没有特别的趋势。\n欧文，你落伍了--现在被推定为罪犯(或者至少是被认为是罪犯)的是不戴口罩的人。\n美联社为了一个故事去找执法部门，执法部门的主要重点是解决犯罪，而不是预防犯罪。我个人更关心的是避免犯罪。也就是说，如果要发生犯罪，我想去别的地方。\n在3月中旬之前，如果我看到一个戴口罩的人走进一家商店，那就是一个多注意的标志。快速计算一下-商店在哪里(东京或巴尔的摩)，人们的行为如何等等，可能会告诉我放松，但它可能会告诉我离开，或者至少站在离门更近的地方。面具不会是唯一可能触发计算的标记，但它将是一个重要的信息。\n商店里的每个人都戴着口罩，那个记号笔就不见了。不是世界末日，但需要一些时间来适应。\n在过去的几周里，我一直在读杰夫·马诺的“城市入室行窃指南”，觉得非常棒。当孩子们使用可汗学院的两台主要电脑时，有一本纸质书是件好事，而且对像建筑这样无处不在的东西有一个新的视角几乎总是有好处的。\n至于口罩，作为一个白人，我觉得戴口罩没什么大不了的(我的粉丝外出时也会戴口罩)，但如果是POC，我会觉得相当恶心，因为黑人仍然经常在街上被枪杀，而且C19似乎比其他地方对美国少数族裔社区的打击要严重得多。\n归根结底，面具问题实际上是在表明，相对于科学，我们的同胞中有哪些人他妈的在乎其他人。也就是说，除了使用这种新的21世纪伪装的罪犯。这是一个实时的社会学实验；-)在美国，无知的人群肯定在竖起他们丑陋的白头，并为此感到自豪。\n我非常期待戴着口罩走进我的银行，但在他们关闭大厅之前，我没有到达那里。这使我很失望。\n我从亚马逊网上巡游中注意到，五颜六色的时尚面具现在很流行。必须承认，N95会让我鼻子发痒，还会把眼镜弄湿。我想面部识别安全系统肯定不高兴。\n带有排气阀的N95口罩(我的术语，不知道官方术语是什么)在很大程度上有助于缓解眼镜的雾化，但它们也让人们戴口罩的目的失去了一半。一般来说，它们是为了保护佩戴者不受外界的影响，所以过滤入口处是最重要的。过滤出口是外科口罩的工作(通常用弹性头带打褶)，旨在保护其他人免受佩戴者的伤害。这是一个轻重缓急的问题。\n自从危机开始以来，我再也看不到垃圾邮件了。没有比特币垃圾邮件。没有伟哥垃圾食品。好吧.。我们每天卖一只口罩.。但没别的了。\n允许的HTML：&lt；a href=&#34；URL&34；&gt；·&lt；em&gt；&lt；cite&gt；&lt；i&gt；·&lt；strong&gt；&lt；b&lt；·&lt；sub&gt；sup&gt；·&lt；ul&gt；&lt；ol&gt；ol&lt；li&gt；", "note_en": "Masks that have made criminals stand apart long before bandanna-wearing robbers knocked over stagecoaches in the Old West and ski-masked bandits held up banks now allow them to blend in like concerned accountants, nurses and store clerks trying to avoid a deadly virus. &#34;Criminals, they&#39;re smart and this is a perfect opportunity for them to conceal themselves and blend right in,&#34; said Richard Bell, police chief in the tiny Pennsylvania community of Frackville. He said he knows of seven recent armed robberies in the region where every suspect wore a mask.\n  Just how many criminals are taking advantage of the pandemic to commit crimes is impossible to estimate, but law enforcement officials have no doubt the numbers are climbing. Reports are starting to pop up across the United States and in other parts of the world of crimes pulled off in no small part because so many of us are now wearing masks.\n In March, two men walked into  Aqueduct Racetrack in New York wearing the same kind of surgical masks as many racing fans there and, at gunpoint, robbed three workers of a quarter-million dollars they were moving from gaming machines to a safe. Other robberies involving suspects wearing surgical masks have occurred in North Carolina, and Washington, D.C, and elsewhere in recent weeks.\n The article is all anecdote and no real data. But this is probably a trend.\n   Politicians routinely criminalize non-criminal behaviors because it sometimes helps identify actual criminals -- but that also lumps many innocent persons into an unjust, artificial category of &#34;crime&#34;.\n In the U.S., politicians have no constitutional authority to criminalize mask-wearing (as many locales do) -- but politicians are rarely constrained by such quaint notions.\n Also, if crime is increasing one must ask if it is infact related to a perceived opportunity or simply due to pressure from worsening economic conditions?\n There has to be one or more limiting factors on this. Mask-wearing is common in East Asia well before the COVID-19 pandemic, yet there is no particular trend of mask-wearing miscreants.\n  You&#39;re behind the curve, Erwin -- it&#39;s the non-mask wearers who are the presumptive criminals (or at least thought criminals) now.\n AP goes to law enforcement for a story, and law enforcement&#39;s primary focus is on crime solving, not crime prevention. I personally am more concerned with crime avoidance. That is to say, if a crime is going to occur, I&#39;d like to be somewhere else.\n Before mid-March, if I saw a person wearing a mask walk into a store, that would be a marker to pay more attention. A quick calculation - where is the store (Tokyo or Baltimore), how is the person behaving, etc. would likely tell me to relax, but it might tell me to leave or at least stand closer to the door. A mask wouldn&#39;t be the only marker that might trigger the calculation, but it would be a significant &#34;tell&#34;.\n With everyone in the store wearing a mask, that marker is gone. Not the end of the world, but it&#39;ll take some getting used to.\n I&#39;ve been reading Geoff Manaugh&#39;s &#34;A Burglar&#39;s Guide to the City&#34; these past couple of weeks and find it rather excellent. It&#39;s good to have a paper book while the kids are using the two primary computers for Khan Academy, and it&#39;s almost always good to get a fresh perspective on something as ubiquitous as architecture.\n Regarding masks, being a white guy I find it&#39;s no big deal to wear one (and my fam does when out), but I&#39;d feel rather queasy about wearing one if was a PoC, due to the combination of black people still being regularly gunned down in the street with the fact that C19 seems to be hitting minority communities here in America much harder than others.\n Ultimately, the masks issue is really showing which of our fellow citizens give a shit about other human beings vis a vis science. That is, except for the criminals using this new 21st Century camouflage. It&#39;s a real-time sociological experiment ;-) And here in America, the ignorant hordes sure are rearing their ugly white heads, and proudly at that.\n I was so looking forward to going into my bank wearing a mask, but I didn&#39;t get there before they closed their lobby... colour me disappointed.\n I note from cruising Amazon.com colorful fashion masks are all the rage now. Must admit the n95 makes my nose itch and steams up the glasses. I suppose facial ID security sys-ads are not happy.\n The N95 masks with an &#34;exit valve&#34; (my term, no idea what the official term is) help a lot to alleviate fogging of glasses, but they also defeat half the purpose for which people might wear a mask. In general, they are to protect the wearer from the outside world, so filtering ingress is most important. Filtering egress is the job of the &#34;Surgical mask&#34; (pleated with typically an elastic headband), and is designed to protect others from the wearer. It&#39;s a matter of priorities.\n What I don&#39;t see any more since the crisis has started is spam. No bitcoin spam. No Viagra spam. Well... ...one &#34;we sell masks&#34; per day. But nothing else.\n   Allowed HTML: &lt;a href=&#34;URL&#34;&gt; • &lt;em&gt; &lt;cite&gt; &lt;i&gt; • &lt;strong&gt; &lt;b&gt; • &lt;sub&gt; &lt;sup&gt; • &lt;ul&gt; &lt;ol&gt; &lt;li&gt; • &lt;blockquote&gt; &lt;pre&gt;", "posttime": "2020-05-21 01:07:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "罪犯,normalization,口罩", "title": "罪犯与面具的正规化", "title_en": "Criminals and the Normalization of Masks", "transed": 1, "url": "https://www.schneier.com/blog/archives/2020/05/criminals_and_t.html", "via": "", "real_tags": ["罪犯", "口罩"]}]