[{"category": "", "categoryclass": "", "imagename": "68eaf7cbc24c7a945ffc310e105698cf.jpg", "infoid": 1008350, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当然，这些都不是真正重要的。这一切都是关于福特为改进其阵容中最重要、最有利可图的汽车所做的一切。距离上次重新设计已经六年了。这款全新的F-150提供了福特卡车车主所期待的性能和丰富的选择。例如，福特提供了11种不同的格栅选择。\n但这一次脱颖而出的是技术以及推动轻度混合动力车进入全混合动力总成领域的努力。\n这是新F-150的所有技术，从内饰开始，特别是信息娱乐系统。\n基础XL版本的卡车将标配一个8英寸的中央触摸屏显示器。然而，在更高的装饰-XLT及以上-F-150将有一个可以拆分的12屏，这样用户就可以同时控制多种功能，包括导航、音乐或卡车功能。\n如果显示器没有支持大量功能的底层连接，谁会在乎它是否很大呢？值得注意的重要方面是，F-150有一个新的同步4系统和嵌入式4G LTE调制解调器，可以为多达10个设备提供Wi-Fi接入。同步4的计算能力是上一代的两倍，将成为F-150所有型号的标准，并将具有自然的语音控制和实时映射功能。还将提供通过SiriusXM提供的必要点播音频内容。\n这里的关键新部分是，系统是在福特内部建造的，而不是外包的，可以支持空中软件更新。这意味着该系统推出了对车辆的升级，例如增加或改进驾驶员辅助功能，以及保持地图最新。Sync 4将通过其AppLink系统提供第三方应用，包括Waze和亚马逊Alexa的一个名为Ford+Alexa的版本。\n福特显然瞄准了那些花大量时间在卡车上工作的人。新的F-150将在中控台区域配备一个可选的工作面。表面被设计成一个方便的地方，用来签署文件，安装15英寸大小的笔记本电脑，或者停放三明治。最妙的是，福特设法保住了控制台移位器。司机按下按钮，它就会折叠成一个隔间，为笔记本电脑工作区腾出空间。\n后门外面是另一个工作面，包括集成尺子、移动设备支架、杯架和铅笔架。\n回到驾驶室的是卧铺座椅，在大揭幕之前得到了一些报道。这些“最大倾斜式”座椅有国王牧场(King Ranch)、白金(Platinum)和限量型(Limited)等高端车型可供选择，而且可以像广告中说的那样：平放到近180度。\n福特正在提供其“动力助推”系统，这是指全混合动力总成，在装饰水平上从F-150XL到有限。该系统将福特3.5升V6发动机和10速变速器与35千瓦电动机相结合。这款电动马达将使用再生制动能量捕获器，帮助位于卡车下方的1.5千瓦时锂离子电池充电。\n福特表示，其目标是EPA估计的单箱汽油行驶里程约700英里，并将提供至少12000磅的最大可用拖曳能力。\n卡车还将提供一种名为Pro Power Onboard的车载发电机。该功能在可选的汽油发动机上提供2.0千瓦的输出。混合动力F-150将标配2.4千瓦的输出或可选的7.2千瓦的输出。\n车主可以通过机舱内的插座以及货舱内最多四个120伏20安培插座使用此电源。7.2千瓦的电源选项将包括一个240伏30安培的插座。该系统将允许工具上的电池在车辆移动时充电。\n这里太多了，很难保持整齐。驾驶员辅助功能是福特品牌的Co-Pilot 360 2.0系统的一部分。重要的细节是，更多这些先进的驾驶员辅助功能是基础XL内饰的标准配置，包括具有自动紧急制动和行人检测功能的碰撞前辅助功能、具有动态搭载辅助功能的后视摄像头、自动远光前大灯和自动开/关前大灯。\n福特增加了(查看笔记)10个新的驾驶员辅助功能。其中最值得注意的是Active Drive Assist，这是福特计划通过对特定车辆进行软件更新而推出的免提驾驶功能，包括2021年第三季度推出的全电动野马马赫-E(Mustang Mach-E)。\n免提功能将在美国和加拿大预先绘制的、分隔的高速公路上运行约10万英里。监控系统将包括一个先进的面向司机的红外摄像头，它将跟踪眼睛凝视和头部位置，以确保司机注意道路。DMS将在免提模式下使用，并在司机选择车道居中模式时使用，该模式适用于任何有车道线的道路。不向前看的司机将通过仪表盘上的视觉提示进行通知。\n还有“交叉口辅助”和“主动停车辅助2.0”，前者在司机试图左转时检测迎面而来的车辆，后者在司机按住按钮的平行或垂直停车动作中处理所有转向、换档、刹车和油门控制。\n最后，还有“拖车反向引导”和“专业拖车后备辅助”。这两个都不是新功能，但它们对于拖车用户来说都是重要的功能。", "note_en": "Of course, none of that really matters. It’s all about what Ford has done to improve the most important and profitable vehicle in its lineup. It’s been six years since the last redesign. This all-new F-150 offers kind of performance and abundance options that Ford truck owners have come to expect. Ford is offering 11 different grille options, for instance.\n But what stands out this time is the tech as well as a push beyond mild hybrids into the realm of a full hybrid powertrain.\n Here’s all the technology in the new F-150, starting with the interior and specifically the infotainment system.\n  The base XL version of the truck will come standard with an 8-inch center touchscreen display. However, on higher trims — XLT and above — the F-150 will have a 12-screen that can be split so that users can control multiple functions simultaneously, including navigation, music or truck features.\n   Who cares if the display is big if it doesn’t have the underlying connectivity to support a host of features? The important aspect to note is the F-150 has a new SYNC 4 system and embedded 4G LTE modem, which can provide Wi Fi access for up to 10 devices. SYNC 4, which has twice the computing power or the previous generation, is going to be standard in all models of the F-150 and will feature natural voice control and real-time mapping. The requisite on-demand audio content offered via SiriusXM will also be available.\n  The critical new piece here is that system, which was built within Ford instead of outsourced, can support over-the-air software updates. That means the system roll out upgrades to the vehicle such as adding or improving driver assistance features and keeping maps up to date. SYNC 4 will offer third-party apps through its AppLink system, including Waze and a version of Amazon’s Alexa called Ford+Alexa.\n  Ford is clearly aiming for people who spend a lot of time working out of their truck. The new F-150 will come with an optional work surface in the center console area. The surface is designed to be used as a convenient place to sign documents, set up a laptop up to 15-inches in size or park that sandwich. The nifty part is that Ford managed to keep the console shifter. The driver hits the button, it folds into a compartment and makes room for the laptop work area.\n  Out on the tailgate is another work surface that includes integrated rulers, a mobile device holder, cupholder and pencil holder.\n  Back inside the cab are the sleeper seats, which got a bit of coverage before the big reveal. These “max recline” seats are available in the higher end models like King Ranch, Platinum and Limited and do as advertised: fold flat to nearly 180 degrees.\n  Ford is offering its “PowerBoost” system, which refers to the full hybrid powertrain, on trim levels from the F-150 XL to the Limited. The system combines Ford’s 3.5-liter V6 engine and 10-speed transmission with a 35-kilowatt electric motor. This electric motor will use regenerative braking energy capture to help recharge the 1.5-kilowatt-hour lithium-ion battery, which is located underneath the truck..\n Ford said it’s targeting an EPA-estimated range of about 700 miles on a single tank of gas and will deliver at least 12,000 pounds of available maximum towing.\n  The truck will also offer an onboard generator called Pro Power Onboard. The feature is available with a 2.0-kilowatt output on optional gas engines. The hybrid F-150 will come standard with 2.4 kilowatts of output or an optional 7.2 kilowatts of output.\n Owners can access this power source through outlets located in the cabin as well as up to four 120-volt 20-amp outlets in the cargo. The 7.2 kw power option will include a 240-volt 30-amp outlet. The system will allow for the batteries on tool to charge while the vehicle is moving.\n  There are so many in here, it’s hard to keep them straight. The driver assistance features are part of Ford’s branded Co-Pilot 360 2.0 system. The important details are that more of these advanced driver assistance features are standard on the base XL trim, including a pre-collision assist with automatic emergency braking and pedestrian detection, rearview camera with dynamic hitch assist and auto high-beam headlamps and auto on/off headlamps.\n Ford has added (checks notes) 10 new driver-assist features. The most notable one is Active Drive Assist, the hands-free driving feature that Ford plans to roll out via software updates to specific vehicles, including the all-electric Mustang Mach-E in the third quarter of 2021.\n The hands-free feature will work on about 100,000 miles of pre-mapped, divided highways in the U.S. and Canada. The monitoring system will include an advanced infrared driver-facing camera that will track eye gaze and head position to ensure drivers are paying attention to the road. The DMS will be used in the hands-free mode and when drivers opt for lane-centering mode, which works on any road with lane lines. Drivers who don’t keep their eyes forward will be notified by visual prompts on their instrument cluster.\n Then there’s “Intersection Assist,” which detects oncoming traffic while the driver is attempting a left turn, and “Active Park Assist 2.0,” which handles all steering, shifting, braking and accelerator controls during a parallel or perpendicular parking maneuver while the driver holds down a button.\n Finally, there is “Trailer Reverse Guidance” and “Pro Trailer Backup Assist.” Neither are new, but they’re important features for users who haul trailers.", "posttime": "2020-06-26 11:48:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "福特,ford,功能", "title": "\n福特最重要的汽车中的所有技术：2021年的F-150卡车", "title_en": "\n\t\t\t\tAll the tech in Ford’s most important vehicle: the 2021 F-150 truck\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/all-the-tech-in-fords-most-important-vehicle-the-2021-f-150-truck/", "via": "", "real_tags": ["福特", "ford", "功能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008349, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我很高兴向Python-dev社区提交一个新的PEP以供审查。这是与勃兰特·布赫、托拜厄斯·科恩、伊万·列夫基夫斯基和塔林的合作。\n很多人都想用一种类似于Scala、Rust、F#、Haskell和其他具有函数风格的语言中的模式匹配形式来扩展Python。这个话题经常出现在Python-Ideas上(最近一次是昨天：-)。", "note_en": "I&#39;m happy to present a new PEP for the python-dev community to review. Thisis joint work with Brandt Bucher, Tobias Kohn, Ivan Levkivskyi and Talin.\n Many people have thought about extending Python with a form of patternmatching similar to that found in Scala, Rust, F#, Haskell and otherlanguages with a functional flavor. The topic has come up regularly onpython-ideas (most recently yesterday :-).", "posttime": "2020-06-26 11:46:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "结构化,pattern,python", "title": "PEP 622：结构化模式匹配", "title_en": "PEP 622: Structural Pattern Matching", "transed": 1, "url": "https://mail.python.org/archives/list/python-dev@python.org/thread/RFW56R7LTSC3QSNIZPNZ26FZ3ZEUCZ3C/", "via": "", "real_tags": ["结构化", "pattern", "python"]}, {"category": "", "categoryclass": "", "imagename": "6b071139b1975d1dd1312b84d6a00b66.jpeg", "infoid": 1008348, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“纽约时报”(New York Times)的员工在另一项敏感的编辑决定上意见不一，这标志着这家有记录的报纸内部最近一次爆发冲突，过去几个月来，该报一直受到内部冲突的困扰。\n周一晚些时候，这位创立了博客Slate Star Codex的科学和哲学作家宣布，他将关闭这个阅读量很大的网站，因为他说时报即将发表一篇报道，分享他的真实身份。\n执掌该博客的精神病学家斯科特·亚历山大(Scott Alexander)用自己的名字和中间名撰写文章，他说，由于过去曾有过针对他的死亡威胁，他不想透露自己的全名，也担心这会让他的精神科诊所和病人处于危险之中。取而代之的是，他要求他的读者给“纽约时报”发垃圾邮件，要求该报不要刊登他的全名。\n“在考虑了我的选择后，我决定选择你们现在看到的那个，”他在这个被清理的网站上唯一的一篇帖子中写道。“如果没有博客，就没有故事。或者，这篇报道至少要讨论一下《纽约时报》为了获得点击量而将随机博客作者拒之门外的策略。\n这位博主的支持者立即跟进，猛烈抨击“纽约时报”，并声称该出版物是在不必要地“欺骗”这位精神病学家和作家。在该报的队伍中，亚历山大有一些明显的盟友-特别是在非编辑人员中。\nSlate Star Codex事件在“纽约时报”的“新闻编辑室-反馈”松弛频道引发了一场紧张的对话，这是一个内部留言板，员工们越来越有勇气对该报以及不可避免地对自己同事的工作提出批评和质疑。\n在亚历山大的博客帖子之后，该报技术和产品团队的几名编辑部非编辑人员询问他为什么被“解雇”，并指出这位博客作者的事业在计算机科学网站黑客新闻(Hacker News)上获得了吸引力。另一名非编辑人员说，他们为该报的客户服务部门标记了这篇尚未发表的报道，“以防这场雪球般的取消数量激增。”\n一名员工写道：“我们的一名开发人员正在询问一位科技博客作者，他关闭了他们的博客，而不是被我们欺骗了。”“这是因为我们的标准造成的吗？技术部门的人能提供一些见解吗？“\n“我真诚地希望，记者们不打算刊登某人的全名，这个人似乎有几个该死的充分理由用假名写博客，”另一名非编辑时报员工怒气冲冲地写道，这呼应了其他技术和产品员工的情绪。\n“纽约时报”的几名员工予以回击，指出该报并不是在“抛弃”亚历山大，因为这个词被广泛用来描述揭露一个人的身份的目的明确是为了鼓励骚扰的情况。\n这场纷争只是最近几周扰乱《纽约时报》的一系列内部紧张局势中的最新一起。本月早些时候，该报的观点版发表了共和党参议员汤姆·科顿(Tom Cotton)的一篇专栏文章，呼吁唐纳德·特朗普(Donald Trump)总统“出兵”，以回应全国范围内反对警察暴行的抗议活动，之后，许多编辑人员公开表示反抗。数十名员工在社交媒体上公开告诫该报，称这篇评论文章将黑色时报的员工置于危险境地。那次内部起义导致了市政厅，该报的高管轮流向愤怒的员工道歉，因为他们经营了参议员的专栏；这导致了观点编辑詹姆斯·班内特(James Bennet)的下台，他承认在这篇文章发表前没有对其进行审查。\n最近发生的其他事件进一步暴露了该报的裂痕，松弛频道经常是冲突的东道主。\n内部人士告诉每日野兽报，在过去的几周里，时报的一些非编辑人员越来越积极地在编辑部回馈室提出问题，这是一个拥有2000多名时报员工的频道，已经为反馈提供了一个方便的论坛，但也引发了争议和内部头疼。虽然一些编辑人员欣赏并接受了这些批评，但编辑部的其他记者和编辑对非编辑部工作人员对新闻采集、报道和编辑过程的热情入侵感到愤怒。\n本月早些时候，“纽约时报”媒体专栏作家本·史密斯(Ben Smith)指出，贝内特离职后，两名员工立即在Slake上发了一个“断头台”的表情符号，引发了内部投诉和时报发言人的公开谴责。这些表情符号最初是在新闻编辑室-回馈室分享的。\n许多泰晤士报的牛肉已经连续几周在房间里上演了。虽然一些员工周二就Slate Star Codex的决定进行了辩论，但一名员工也对观点编辑巴里·韦斯(Bari Weiss)提出了质疑，称当她在Twitter上发帖称自己对科顿专栏的愤怒感到沮丧时，她“直截了当地撒了谎，说纽约时报内部不存在一场战斗，因为她知道这会是一条更有趣的推文。”\n一些员工似乎厌倦了渠道中持续不断的来来回回，特别是在没有直接参与正在辩论的特定决策的员工中。\n周二，一位人士插话提醒员工，他们的评论广泛可供数千人查看。这位员工写道：“我想温和地提醒大家，这个闲置的渠道有2000人，我们应该注意这一点。”", "note_en": "New York Times employees are at odds over another sensitive editorial decision, marking the latest flare-up within the paper of record that has been roiled by internal strife over the past several months.\n Late on Monday, the science and philosophy writer who founded the blog Slate Star Codex announced that he was shutting down his widely read site over what he said was a forthcoming story in the  Times that would share his real identity.\n Scott Alexander, the psychiatrist who helms the blog and writes under his first and middle name, said that he did not want to reveal his full name because of past death threats made against him, as well as fear that it would put his psychiatric clinic and patients at risk. Instead, he asked his readers to spam  The  New York Times demanding the paper not publish his full name.\n “After considering my options, I decided on the one you see now,” he wrote in the only post now atop the scrubbed website. “If there’s no blog, there’s no story. Or at least the story will have to include some discussion of NYT’s strategy of doxxing random bloggers for clicks.”\n  The blogger’s supporters immediately followed through, slamming the  Times and claiming the publication was unnecessarily “doxxing” the psychiatrist and writer. And within the paper’s ranks, Alexander has some apparent allies—particularly among non-editorial staffers.\n The Slate Star Codex incident set off a tense conversation in the  Times’ “newsroom-feedback” Slack channel, an internal message board in which staff have felt increasingly emboldened to criticize and raise questions about the paper and, inevitably, the work of their own colleagues.\n Following Alexander’s blog post, several non-editorial newsroom staffers from the paper’s tech and product teams asked why he was being “doxxed,” and pointed out that the blogger’s cause was gaining traction on the computer-science site Hacker News. Another non-editorial staffer said they flagged the not-yet-published story for the paper’s customer care department “in case this snowballs into a spike in cancellations.”\n “One of our developers is asking about a tech blogger who took their blog down rather than be doxed by us,” one employee wrote. “Is this something arising because of our standards? Can someone from the technology desk provide some insight?”\n “I sincerely hope that the reporters did not intend to print the full name of someone who seems to have several damned good reasons to blog with a pseudonym,” fumed another non-editorial  Times staffer, echoing a sentiment reflected by other tech and product staffers.\n Several  Times staffers pushed back, noting that the paper was not “doxxing” Alexander, as that term is widely used to describe situations where the goal of revealing a person’s identity is specifically to encourage harassment.\n The dust-up is just the latest in a series of internal tensions that have roiled the  Times in recent weeks. Many editorial staffers  openly revolted earlier this month after the paper’s opinion page published a column from Republican Sen. Tom Cotton calling for President Donald Trump to “send in the troops” in response to nationwide protests against police brutality. Dozens of employees openly admonished the paper on social media, saying the op-ed put Black  Times staffers in danger. That internal uprising led to a town hall in which the paper’s  executives took turns apologizing to irate staffers for running the senator’s column; and it resulted in  the ouster of opinions editor James Bennet, who admitted to having not reviewed the piece before its publication.\n Other recent incidents have further exposed fissures at the paper, with Slack channels often playing host to the conflicts.\n Insiders told The Daily Beast that over the past few weeks, some non-editorial staffers at the  Times have become increasingly active in raising issues in the newsroom-feedback room, a channel with more than 2,000  Times staffers that has already provided a convenient forum for feedback but has sparked controversy and internal headaches as well. While some editorial staffers have appreciated and accepted the criticism, other reporters and editors in the newsroom have bristled at the zealous incursion by non-newsroom staff into the newsgathering, reporting, and editing process.\n  Earlier this month,  New York Times media columnist Ben Smith noted that immediately following Bennet’s departure, two employees reacted in Slack with an emoji of the word “guillotine,” prompting internal complaints and a public reprimand from a  Times spokesperson. The emojis were initially shared in the newsroom-feedback room.\n Many of the  Times beefs have played out in the room for weeks on end. While some employees debated the Slate Star Codex decision on Tuesday, one staffer also raised issues about opinion staff editor Bari Weiss, saying that when she posted on Twitter about her dismay over the anger about Cotton’s column, she “straight up lied about a nonexistent battle within the new york times because she knew it would be a juicier tweet.”\n Some employees have appeared to tire of the constant back-and-forth in the channel, particularly among employees with no direct involvement in particular decisions being debated.\n On Tuesday, one person chimed in to remind staff that their comments were widely available for thousands of people to see. “I’d like to gently remind people that there are two thousand people in this slack channel and we should be mindful of that,” the employee wrote.", "posttime": "2020-06-26 11:26:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,开发商,times,员工", "title": "《纽约时报》开发商就让斯科特·亚历山大昏迷的决定争论不休", "title_en": "New York Times developers squabble over decision to doxx Scott Alexander", "transed": 1, "url": "https://www.thedailybeast.com/the-slate-star-codex-doxxing-is-the-latest-squabble-inside-new-york-times", "via": "", "real_tags": ["开发", "开发商", "times", "员工"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008347, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我有一台安装了LXD的专用服务器，在其中我运行了一系列系统容器来托管我的许多游乐场服务，要访问这些LXC容器的操作系统，我需要通过SSH连接到LXD主机，然后执行或ssh连接到该LXC容器。\n这变得单调乏味，并且想要一种直接ssh到它们的方式，因为它们没有公共IP地址，这是不可能的，但是发现使用代理跳转来访问它们是可能的。\n添加虚拟机管理程序上创建的公钥(~/.ssh/id_rsa.pub)和目标VM的~/.ssh/Authorized_Key文件。\nHost*StrictHostKeyChecking no UserKnownHostsFile=/dev/null主机虚拟机管理程序主机名hv.domain.com用户myuser IdentityFile~/.ssh/id_rsa主机CTR1主机名10.37.117.132用户根标识符File~/.ssh/id_rsa ProxyJump虚拟机管理程序。\n$ssh CTR1警告：将&#39；x，x&#39；(ECDSA)永久添加到已知主机列表。警告：将&#39；10.37.117.132&#39；(ECDSA)永久添加到已知主机列表。root@CTR1~$。\n我叫阮，我是一名来自南非开普敦的DevOps工程师。我热衷于AWS、开源、容器、Linux、自动化，并与世界分享我的发现。在我的网站ruan.dev上有更多关于我的信息。关注@ruanbekker", "note_en": "I have a dedicated server with LXD installed where I have a bunch of system containers running to host a lot of my playground services, and to access the operating system of those lxc containers, I need to SSH to the LXD host, then exec or ssh into that LXC container.\n This became tedious and wanted a way to directly ssh to them, as they don’t have public ip addresses, it’s not possible but found its possible to access them using proxyjump.\n    Add the created public key ( ~/.ssh/id_rsa.pub) on the hypervisor and the target vm’s  ~/.ssh/authorized_key files.\n  Host *  StrictHostKeyChecking no  UserKnownHostsFile=/dev/null  Host hypervisor  Hostname hv.domain.com  User myuser  IdentityFile ~/.ssh/id_rsa  Host ctr1  Hostname 10.37.117.132  User root  IdentityFile ~/.ssh/id_rsa  ProxyJump hypervisor\n  $ ssh ctr1 Warning: Permanently added &#39;x,x&#39; (ECDSA) to the list of known hosts. Warning: Permanently added &#39;10.37.117.132&#39; (ECDSA) to the list of known hosts. root@ctr1~ $\n  My name is  Ruan, i&#39;m a DevOps Engineer from Cape Town, South Africa. I&#39;m passionate about AWS, OpenSource, Containers, Linux, Automation and sharing my findings with the world. More info about me on my website,  ruan.dev.      Follow @ruanbekker", "posttime": "2020-06-26 11:25:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "虚拟机,公网,ssh", "title": "对没有公网IP的虚拟机使用带SSH的ProxyJump", "title_en": "Use ProxyJump with SSH for VMs with No Public IPs", "transed": 1, "url": "https://blog.ruanbekker.com/blog/2020/06/13/using-proxyjump-with-ssh-for-vms-with-no-public-ips/", "via": "", "real_tags": ["虚拟机", "公网", "ssh"]}, {"category": "", "categoryclass": "", "imagename": "8862d47d534f32e4940df69cb9065b30.png", "infoid": 1008346, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你本周观看了苹果公司一年一度的WWDC活动，或者甚至一直在随意地观察公司发布的一些声明，你可能会注意到一些新的东西-一些有点刺耳的东西。\n昨天，苹果推出了全新的MacOS版本，超越了X的名称，进入了新的版本号：11。MacOS11(被称为Big Sur)拥有大量新功能，使其更接近iPhone和iPad上的iOS同行，但有一个领域似乎存在分歧，那就是…。它的图标和用户界面设计。你可以把它归咎于一种叫做新形态主义的东西，不管你喜欢还是讨厌它，它都将是UI设计的下一波浪潮。\n新形态主义已经在Design Twitter上流传了一段时间了，大多数人对它的反应都是负面的。有很多有效的批评，主要是早期的设计实验侧重于设计差异，而不是实际的可用性。但是，如果你超越我们到目前为止已经看到的具体实现-通常是由专注于形式主义而不是可用性的设计师创建的-到基本概念，你会发现有些东西实际上是相当令人兴奋和可持续的；一些东西还没有完全实现。\n归根结底，气体同形是对光如何在三维空间中运动的关注。它的前身skeumogism通过模拟表面的纹理，如扑克桌上的毛毡或磁带录音机的刷子金属，在数字界面上创造了真实感。这种设计风格的一个附属(虽然不发达)方面是照明，它与所表现的材料进行了逼真的互动；这就是为什么阴影和黑暗在早期的界面中如此普遍。\n归根结底，气体同形是对光如何在三维空间中运动的关注。\n但为这些设计进行的照明和纹理模拟仍然相对简单：哪些物体是有光泽的，哪些是粗糙的？哪些对象是透明的，哪些是不透明的？这些最终都是功利性的、有点武断的选择。气形与其前身的不同之处在于，焦点是光本身，以及它如何与纯数字空间中的各种物体相互作用。气体变形中的灯光模拟更为复杂，主要集中在一个对象的灯光如何影响另一个对象，或对象本身的功能。\n最早招致如此多批评的例子通常是在白色背景上显示白色UI元素，这种差异完全是由元素与光的相互作用、从顶部反射的光线和从底部投射的阴影造成的，这表明它们是从表面升起的。在此样式能够广泛应用之前，需要进行可用性改进，但它展示了偏态形态主义所没有的东西-超越单个对象并规定多个对象如何在一个世界中交互的全局照明方案的概念。\n在2010年代初，放弃了偏向形态主义，转而采用平面设计，这使得颜色和设计元素的工具包变得更加广泛和更具表现力。从物理物体的基础上解脱出来，物体可以变成任何颜色，空间可以得到更好的利用。通过去掉仅仅是为了表示元素是为了表示三维对象而存在的不必要的修饰，设计师可以自由探索。\n在平面设计近十年的统治期间，在可用性和用户体验领域取得了许多重要的发展。但是随着时间的推移，以物理为基础的二维设计变得越来越不常见，重新引入物理总是会吸引人们回到并进一步研究。当你考虑把从平面设计中学到的东西带回更具体的背景中的可能性时，这一点就加倍正确了。于是钟摆开始往回摆动。\n撇开批评不谈，气体变形有一个不可否认的特点，使它如此吸引人。看起来是新的。平面设计的核心“数字原生”外观，以及它对堆栈、页面和层等概念的实现，在过去的8年多里已经变得无处不在。新形态主义与用户已经习惯的东西相去甚远，它确实让人感觉像是一种新的语言。这种差异化是有价值的，特别是对于像苹果这样试图将其操作系统19年来首次迁移到新的编号版本的公司来说。\niPhone于2007年发布，iOS7的扁平化设计于2013年推出。它的基本外观和感觉比最初的歪曲变形的iPhone UI存在的时间更长，只做了很小的改动。Neumogism提供了一种保持事物运转的方法，而不需要对设计语言进行认真的检查(老实说，“实现气流”最基本的就是添加投影、外部发光和偶尔出现的3D对象；非常简单)。但是，当系统超越了简单的视觉效果，当它探索和利用这些数字空间，使用户界面更容易理解、更容易接近和更美观时，气体形态真正变得有趣起来。\n那么为什么苹果在这件事上看起来..。有点糟糕吗？如前所述，气体同形的概念框架相对较新，并且在很多设计界都存在阻力。UI设计长期受到设计师的困扰，他们喜欢创造不受实际可用性或用户体验需求束缚的假想设计，这纯粹是一种正式的练习，这导致了内斗。一方面，概念设计探索就是那样的探索。另一方面，UI/UX设计与某些设计规程不同，因为对成功和失败有非常具体的定义(有些人会争辩说，所有的设计规程都需要严格的解释，这只是Design™的本质，但那些人是书呆子，是错误的)。\n设计者可以“探索”用户需要点击的按钮是否应该是不可见的，但是由于用户因此不能前进，在此应用程序中，设计被认为是失败的。在界面设计领域，表单试验总是很难与可用性取得平衡，但这并不意味着它应该被完全抛弃。铁杆的UX/UI设计者贬低几乎所有形式的正式实验都是不必要的和投机性的；几乎不可能存在于现实世界中。\n一些对同形的否定源于这种分歧，早期的深入探索集中在将新风格的最可识别的方面应用到用户界面的最可识别的方面，导致它被用于这样做会破坏UX设计必要原则的地方。为了发展到应有的形态，我们需要把它们分开一点，独立地发展它们。在某种程度上，苹果针对OS11的新设计系统似乎是这种脱钩实际发生的第一个高调实例。有一些变形风格的迹象，特别是在这些图标中，所有这些图标都关注于在非UI元素上使用的灯光的复杂交互。\n与往常一样，第三方将以比苹果更快和更大胆的速度推进球。\n在一些地方，它比其他地方执行得更成功。在从二维图标到三维灵感的变形风格转换明显的地方，图标更成功。例如，查看消息图标，语音气泡的概念是明确定义的，因此该对象在这些照明条件下的行为方式是已知的。然而，还有其他更抽象的实例，其中到三维、光交互对象的平移不太清楚。这就是风格开始崩溃的地方。\n照片图标就是一个很好的例子。为了让它容易辨认，设计几乎没有改变，但为了让它在这个充气的世界里舒服地坐着，一些阴影和外部光芒被应用到了一个原本平坦的图标上。这增加了复杂性，而不会将实际对象解析为与套件中的其他图标一起存在于共享空间中的对象。App Store图标的表现略好于Photos图标，但同样的原理也适用于此，将专为二维设计的线条图标转化为有效的3D数字面条。要让这样的东西真正属于设计者正在走向的对象套件，它需要经历更重要的重新思考，这就为用户的困惑打开了大门。\n显然，这些设计将随着时间的推移逐渐修改，直到它们开始形成一个更有凝聚力的整体。当你回顾iOS7平板设计的第一次裁剪时，有很多边缘粗糙的地方。Helvetica Neue太淡了，整体外观的颜色太甜了。一点一点地，它进化了，变得更精致了。苹果进军同形现象无疑也是如此。事实上，它迈向这一设计流派的举动为这一概念赋予了一种合法性的气氛，现在任何希望融入公司新哲学的设计师都会很好地利用这一概念。\n现在整个设计界将被迫面对同形现象，围绕系统的可能性将会有一个爆炸性的发展，在这个新的数字空间的哲学如何合法地适用于用户界面设计和功能方面将取得更大的进展。与往常一样，第三方将以苹果无法召集的更快和更大胆的速度向前推进--这是我们真正开始释放气体同形的力量的时候。\nJack Koloskus是输入和大纲的首席设计者。他喜欢植物、蘑菇(不是植物)、3D软件和设计网站。你可以在这里跟他打个招呼。", "note_en": "If you watched Apple’s annual  WWDC event this week, or have been even casually observing some of the announcements the company made, you may have noticed something new — something a bit jarring.\n Yesterday saw the introduction of a  whole new version of macOS, moving beyond the X designation into a new version number: 11. macOS 11 (known as Big Sur) boasts loads of new features that bring it closer to parity with its  iOS counterparts on iPhones and iPads, but one area where there seems to be a divergent path is… its icon and  user interface design. You can blame that on a little something called Neumorphism, and like or hate it, it’s the next wave in UI design.\n Neumorphism has been making the rounds on Design Twitter for a little while now, and most of the response to it has been negative. There are plenty of valid criticisms out there, primarily that early design experiments were focused on design differentiation and not actual usability. But if you look beyond specific implementations we’ve seen thus far — usually created by designers whose focus is formalism as opposed to usability — to the base concepts, there is something that&#39;s actually quite exciting and sustainable; something that has yet to be fully realized.\n  When you boil it down, neumorphism is a focus on how light moves in three-dimensional space. Its predecessor, skeumorphism, created realism in digital interfaces by simulating textures on surfaces like felt on a poker table or the brushed metal of a tape recorder. An ancillary — though under-developed — aspect of this design style was lighting that interacted realistically with the materials that were being represented; this is why shadows and darkness were so prevalent in those early interfaces.\n When you boil it down,  neumorphism is a focus on  how light moves in three-dimensional space.\n But the lighting and texture simulations being done for those designs were still relatively simple: which objects are shiny and which are rough? Which objects are transparent and which opaque? These were ultimately utilitarian and somewhat arbitrary choices. What sets neumorphism apart from its progenitor is that the focus is on the light itself and how it interacts with a variety of objects in a purely digital space. The light simulations in neumorphism are more complex, and are focused on how light from one object could affect another, or the function of the object itself.\n  The earliest examples that drew so much criticism often show white UI elements on white backdrops, with the differentiation created solely by the interaction of the elements with light, the reflection of the light from the top and shadows cast from the bottom, suggesting they were raised from the surface. There are usability improvements that would need to happen before this style could be widely applied, but it demonstrated something that skeumorphism had not — a concept of a global lighting schema that transcends one individual object and dictates how multiple objects interact in one world.\n   Abandoning skeumorphism in favor of flat design in the early 2010s allowed for a much wider and more expressive toolkit of colors and design elements. Untethered from a basis in physical objects, objects could become any color and space could be better used. By removing unnecessary embellishments that only existed to indicate an element was intended to represent a three-dimensional object, designers were free to explore.\n During the near-decade reign of flat design a lot of important developments were made in the realms of usability and user experience. But as time wore on and physically-based, two-dimensional design became less common, the reintroduction of physicality was always going to be appealing to return to and investigate further. This is doubly true when you consider the possibility of bringing the learnings from flat design back into a more tangible context. And so the pendulum began to swing back.\n  Criticisms aside, there is one undeniable feature to neumorphism that makes it so appealing. It looks  new. Flat design’s core “digitally native” look, and its implementation of ideas like stacks, pages, and layers have become familiar to the point of ubiquity over the last 8+ years. Neumorphism is far enough away from what users have become accustomed to that it genuinely does feel like a new language. That differentiation is valuable, especially to a company like Apple trying to move its operating system to a new numbered version for the first time in 19 years.\n The iPhone was released in 2007, and the flat-design of iOS 7 was introduced in 2013. Its basic look and feel has existed for longer than the original skeumorphic iPhone UI and has undergone only minor alterations. Neumorphism provides a way to keep things moving without committing to a serious overhaul of the design language (let’s be honest, “implementing neumorphism” at its most basic is just adding drop shadows, outer glows, and the occasional 3D object; pretty easy). But where neumorphism really gets interesting is when the system goes beyond simple visuals, when it explores and exploits those digital spaces to make user interfaces more understandable, approachable, and beautiful.\n   So why does Apple’s take on it look... kinda bad? As mentioned earlier, the conceptual framework of neumorphism is relatively new, and there has been a resistance to it in much of the design world. UI design has been plagued for the longest time by designers who love to create hypothetical designs untethered to actual usability or user experience needs as a purely formal exercise, and this has led to infighting. On one hand, conceptual design explorations are just that — explorations. On the other, UI/UX design is unique from some design disciplines in that there are very concrete definitions of success and failure (some would argue that  all design disciplines require a rigid interpretation and that this is simply the nature of Design™ but those people are nerds and are wrong).\n  A designer could “explore” whether a button that a user needs to tap should be invisible, but since the user is thus not able to progress, in this application the design is considered a failure. Experimentation with form will always be difficult to balance with usability in the field of interface design, but it doesn’t mean it should be dismissed outright. Hardcore UX/UI designers disparage almost all forms of formal experimentation as unnecessary and speculative; hardly something that could exist in the real world.\n Some of the dismissals of neumorphism stem from this divide, the early in-depth explorations centered around applying the most identifiable aspects of the new style to the most identifiable aspects of user Interfaces, resulting in it being utilized in places where doing so would break the necessary tenets of UX design. In order to develop neumorphism to what it should be, we need to separate them a little and develop them independently. In a way, Apple’s new design system for OS 11 seems to be the first high-profile instance of this decoupling actually happening. There are signs of neumorphic style, particularly a focus on the complex interactions of light being used on non-UI elements all throughout these icons.\n As always,  third-parties will move the ball forward  faster and with more  daring than  Apple can muster\n In some places it’s executed more successfully than others. In places where the translation from two-dimensional icons to three-dimensional-inspired neumorphic style was obvious, the icons are more successful. Looking at the Messages icon, for example, the concept of a speech bubble is well-defined, and so the way that this object would behave in these lighting conditions is known. There are other, more abstract instances, however, where the translation to a three-dimensional, light-interacting object is less clear. This is where the style starts to break down.\n  The Photos icon is a great example. In an effort to keep it recognizable, the design was barely altered, but to allow it to sit comfortably in this neumorphic world, some drop shadows and outer glows were applied to an otherwise flat icon. This adds complexity without resolving the actual object into something that exists in shared space alongside other icons in the suite. The App Store icon fared a little better than the Photos icon did, but the same principle applies, translating a line-art icon designed for two-dimensions into what is effectively 3D digital noodles. To have something like this truly belong in the suite of objects designers are moving towards, it would need to undergo a more significant rethink, which then opens the door for user confusion.\n Obviously, these designs will be gradually modified over time until they begin to form a more cohesive whole. When you look back at the very first cut of flat design in iOS 7, there were many places that were  rough around the edges. The Helvetica Neue was too light, the overall appearance of the colors too saccharine. Little by little, it evolved and became more refined. The same will be undoubtedly true of Apple’s foray into neumorphism. In fact, its move towards this school of design confers an air of legitimacy to the concept that will now be well exploited by any designer hoping to fit within the company’s new philosophy.\n  Now that the design world at large will be forced to reckon with neumorphism, there will be an explosion of development around the possibilities of the system, and far more headway made on how the philosophy of this new digital space is legitimately applicable to user interface design and functionality. As always, third-parties will move the ball forward faster and with more daring than Apple can muster — and this is when we will truly begin to unlock the power of neumorphism.\n  Jack Koloskus is the lead designer for Input and The Outline. He likes plants, mushrooms (which are not plants), 3D software, and designing websites. You can say hello to him  here.", "posttime": "2020-06-26 11:04:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,苹果,新形态,big,设计", "title": "苹果、大苏尔与新形态主义的兴起", "title_en": "Apple, Big Sur, and the Rise of Neumorphism", "transed": 1, "url": "https://www.inputmag.com/design/apple-macos-big-sur-the-rise-of-neumorphism", "via": "", "real_tags": ["apple", "苹果", "新形态", "big", "设计"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008345, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "邮政信箱22400坦佩，亚利桑那州，邮编：85285(480)9677979*传真：(480)8942028年。\nGPO信箱982斯普林希尔，QLD 4127(07)3891 1191*传真(07)3891 1194", "note_en": "P.O. Box 22400 Tempe, AZ 85285  (480) 967-7979 * fax (480) 894-2028\n  GPO Box 982 Springhill, QLD 4127  (07) 3891 1191 * fax (07) 3891 1194", "posttime": "2020-06-26 11:04:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,邮寄,mail,亚利桑那州", "title": "邮寄游戏", "title_en": "Play-by-Mail Games", "transed": 1, "url": "http://reality.com/", "via": "", "real_tags": ["游戏", "邮寄", "mail", "亚利桑那州"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008344, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你是新来的，你可能想订阅我的RSS订阅源，或者把我的帖子放到你的收件箱里。谢谢光临！\n如果有一条建议，我希望我能在山上向所有的云工程师喊话，那就是这条。\n运营，特别是规模化运营，是一个难题。边缘案例变得司空见惯。失败比比皆是。自动化和标准化至关重要。拥有如此规模的软件和硬件运营经验的人往往是稀有和昂贵的。他们所犯的错误和他们从中学到的情况并不容易接受。\n当您使用某家主要云供应商提供的托管服务时，您可以以较低的软件价格获得其团队的全部智慧以及自动化和系统的强大功能。\n托管服务是一种服务，如AWS关系数据库服务、Google Cloud SQL或Azure SQL数据库。使用所有这三项服务，您将获得最佳的关系数据库系统配置和管理。您需要进行配置，但是设置复制或备份等困难或乏味的任务可以快速而轻松地完成(这一点可以从多年来养育和照料MySQL复制系统的人那里学到)。根据您的云供应商和需求，您可以获得针对现代软件系统关键组件的托管服务，例如：\n(请注意，这些都是您的应用程序的组件，开发人员仍需要时间才能将它们线程在一起。)。\n它会运行得很好的。云提供商可以提供的专业知识和他们能够负担得起的自动化很可能会超越您的能力，特别是跨多种服务。\n会更便宜的。特别是当你考虑到员工成本的时候。最昂贵的AWS RDS实例约为10万美元/年(全价)。这不是苹果与苹果的比较，但在许多国家，您无法以那样的薪水获得数据库架构师。\n开发起来会更快。开发人员可以专注于连接这些基础设施，而不是学习如何设置和运行它们。\n托管服务并不适用于所有人。如果您需要能够调整每个设置，托管服务不会允许您这样做。您可能具有托管服务无法满足的严格性能或安全要求。您也可以从托管服务开始，然后逐渐发展壮大。(恭喜！)。\n另一个重要的考虑因素是锁定。一些托管服务与备选方案兼容(Kubernetes服务就是一个很好的例子)。如果是这样的话，你可以移动云层。其他是专有的，如果您需要迁移，则需要对您的应用程序进行大量修改。\n如果您在云中工作，并且您的应用程序需要构建块(如关系数据库或消息队列)，请从托管服务开始(如果不满足您的需要，请自行托管)。利用云供应商的卓越运营优势，您将能够构建更多、更快的产品。", "note_en": "If you&#39;re new here, you may want to subscribe to my  RSS feed or  get my posts in your inbox. Thanks for visiting!\n  If there was one piece of advice I wish I could shout from the mountains to all cloud engineers, this would be it.\n Operations, especially operations at scale, are a hard problem. Edge cases become commonplace. Failure is rampant. Automation and standardization are crucial. People with experience running software and hardware at this scale tend to be rare and expensive. The mistakes they’ve made and situations they’ve learned from aren’t easy to pick up.\n When you use a managed service from one of the major cloud vendors, you’re getting access to all the wisdom of their teams and the power of their automation and systems, for the low price of their software.\n A managed service is a service like AWS relational database service, Google Cloud SQL or Azure SQL Database. With all three of these services, you’re getting best of breed configuration and management for a relational database system. There’s configuration needed on your part, but hard or tedious tasks like setting up replication or backups can be done quickly and easily (take this from someone who fed and cared for a mysql replication system for years). Depending on your cloud vendor and needs, you can get managed services for key components of modern software systems like:\n  (Note that these are all components of your application, and will still require developer time to thread together.)\n  It’s going to be operated well. The expertise that the cloud providers can provide and the automation they can afford to implement will likely surpass what you can do, especially across multiple services.\n It’s going to be cheaper. Especially when you consider employee costs. The most expensive AWS RDS instance is approximately $100k/year (full price). It’s not an apples to apples comparison, but in many countries you can’t get a database architect for that salary.\n It’s going to be faster for development. Developers can focus on connecting these pieces of infrastructure rather than learning how to set them up and run them.\n A managed service doesn’t work for everyone. If you need to be able to tweak every setting, a managed service won’t let you. You may have stringent performance or security requirements that a managed service can’t meet. You may also start out with a managed service and grow out of it. (Congrats!)\n Another important consideration is lock-in. Some managed services are compatible with alternatives (kubernetes services are a good example). If that is the case, you can move clouds. Others are proprietary and will require substantial reworking of your application if you need to migrate.\n If you are working in the cloud and you need a building block for your application like a relational database or a message queue, start with a managed service (and self host if it doesn’t meet your needs). Leverage the operational excellence of the cloud vendors, and you’ll be able to build more, faster.", "posttime": "2020-06-26 11:02:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "托管,managed,服务", "title": "使用托管服务。请", "title_en": "Use Managed Services. Please", "transed": 1, "url": "http://www.mooreds.com/wordpress/archives/3358", "via": "", "real_tags": ["托管", "managed", "服务"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008341, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "杰森·戴维斯→地图→球面沃罗诺伊图数据：自然地球，1：10M文化矢量：人口稠密的地方(行政-0首都)。世界领土被重新划分，因此一个地区由最近的首都决定。这是使用球面Voronoi图计算的，该图在计算距离时考虑了地球的曲率。", "note_en": "Jason Davies →  Maps →  Spherical Voronoi Diagrams   Data:  Natural Earth, 1:10m Cultural Vectors: Populated Places (Admin-0 capitals).  World territories have been redrawn so that a region is determined by the closest capital city. This is calculated using a  spherical Voronoi diagram, which takes into account the curvature of the Earth when computing distances.", "posttime": "2020-06-26 10:21:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "沃罗诺,capitals,球面", "title": "世界首都沃罗诺伊", "title_en": "World Capitals Voronoi", "transed": 1, "url": "https://www.jasondavies.com/maps/voronoi/capitals/", "via": "", "real_tags": ["沃罗诺", "capitals", "球面"]}, {"category": "", "categoryclass": "", "imagename": "30e146e22a68b1374bba16e02b608e98.gif", "infoid": 1008340, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上瘾是指尽管一种化学物质正在造成伤害，但它无法停止消费或从事某种活动。\n我几乎接触到了所有与上瘾有关的物质或行为：酒精、毒品、咖啡、色情、性、赌博、工作、消费、设备和社交媒体。我都滥用过，但别以为我上瘾了。在平衡记分卡上，这些物质和行为，包括虐待和所有，在我的生活中都是净积极的，甚至@Twitter。\n我们物种的大多数疾病和困难都是由稀缺造成的-盐、糖、脂肪太少，认可太少，安全，交配机会太少。因此，当我们发现这些东西时，我们的大脑就会产生终极的奖赏--愉悦荷尔蒙多巴胺。这是有道理的。大自然奖励那些确保物种繁殖的行为。\n流水线、处理能力和亚马逊Prime不仅达到了生存的最低门槛，而且给我们的物种带来了新的威胁：超多。糖尿病、收入不平等和假新闻都是我们相信越多越好的结果。杰夫·贝佐斯捕获和囤积挪威的GDP对这个物种来说没有意义，但他的本能(害怕饥饿，挥舞着权力)占据着至高无上的地位。\n生存、繁殖和消费应该使下一代变得更聪明、更快、更强大。事情脱轨的地方是我们的创新经济比我们的本能发展得更快的一个功能。从历史上看，人类从事的活动都有自然的停止提示-章节的结尾，结尾的字幕。Facebook、Instagram和Netflix等平台已经系统地消除了停车提示。甚至赌场的布局也刻意没有硬角，所以这都是一个连续的空间，你会一直穿过它，继续到下一场比赛。\n技术进步，对我们本能的校准，在无穷无尽的卷轴中达到顶峰。我们找不到开关。与我们的父母和祖父母不同，对我们来说，多巴胺的释放不再依赖于牺牲、承诺或毅力，而是静静地坐着，就像在15秒、14秒、13秒之后，第五集就要开始了。过滤过的照片更多了，色情作品更多了，股票更多了，利润更多了，多巴也更多了，更多的时间没有了需要从事生活的麻烦。\n最近的顶级交易商是在线交易平台(OTP)。在交易平台上，无穷无尽的卷轴是什么样子的？\n游戏化：用户每天最多可以点击1000次，以提高自己在罗宾汉现金管理功能(本质上是应用程序上的一个高收益支票账户)等待名单上的位置。\n我们的机构(法院、国会、证券交易委员会)应该放慢我们的思考速度，这样我们的本能就会得到遏制，我们就可以决定不歧视，不往河里倒汞，不让一家破产的汽车租赁公司(Hertz)发行注定一文不值的股票。你输了，他们就赢了。\n技术变革的速度远远超过了我们人类适应无穷无尽的刺激的能力。这种调制方式上的差异爆发了我们青少年抑郁和社会混乱的程度。我们正处在一场超级海洋喷火中，每天都在加速，希望机身能在接近音障时保持一致--播放“辛普森一家”31季，栩栩如生的视频游戏，无处不在的日益极端的色情内容，高清实时记录你15岁的女儿没有被邀请参加的派对，社交媒体算法推动情绪与真实性的对比，以及立即批准“公牛扩散”的保证金。\n昨天，在得知20岁的亚历山大·卡恩斯(Alexander Kearns)自杀的消息后，我简直是一团糟。卡恩斯来自伊利诺伊州内珀维尔，对市场感兴趣，开始交易股票。卡恩斯错误地认为，在罗宾汉应用程序上交易期权后，他下跌了73万美元，并结束了自己的生命。我们不知道还有什么因素在这里起作用，年轻人在市场上赔钱后自杀并不是什么新现象。\nFacebook和Twitter做了CNN和福克斯几十年来一直在做的事情，但做得更好。我担心罗宾汉可能会成为一个让人上瘾的交易平台--Instagram。罗宾汉的用户年龄偏小(32%的访问者年龄在25-34岁之间)。该公司报告称，2020年第一季度新增客户300万。一半是首次交易。此外，随着拉斯维加斯和体育博彩几乎关闭，OTPS已经成为新兴赌博成瘾扎根的地方和/或你的赞助商是经销商的康复设施。\n学习投资和了解市场是件好事，与在线朋友…联系也是如此。在某种程度上。社交媒体和赌博有相同的上瘾心理机制：可变奖励(当你不断执行一个动作，希望获得可能但不太可能的奖励)。这是一种“最容易上瘾、最难戒掉”的行为。罗宾汉的管理层和投资者已经从大技术公司得到了启示，并做出了一个有意识的决定，为了个人财富而无视我们年轻人的福祉。\n12%的交易活动来自日内交易者，而日内交易者只占所有有利可图的交易者的1.6%。\n投资者在其投资组合中持有风险较高的股票，他们目前的经济状况与他们的抱负水平之间存在很大差异。\n大多数文章将集中在我们美国人认为的新手在线交易员…激增带来的深刻风险上。市场可能会下跌。大多数市场高点都与散户投资者入场不谋而合。据我所知，我们还没有见过20多岁的人投资政府救援基金，通过智能手机的预先批准来杠杆化，导致市场崩盘的规模。\n我们的民选官员以及对金钱和创新者的粗暴崇拜已经淹没了那些负责减缓我们思维速度和保护我们孩子安全的机构。乔·斯卡伯勒(Joe Scarborough)说得好：“马克、谢丽尔和杰克，你们暴露了自己是平淡无奇的庸俗之徒，将美国人的健康、种族正义、公平选举和基本真理置于危险境地。”\n我们在哪里转弯？保护孩子免受设备成瘾的压力主要落在父母身上--限制(严重)使用，并让学校的其他家长也限制使用，这样孩子们就不会觉得自己是一个例外。这很困难，而且需要完成。“电子速食”，也许对整个家庭来说，可以让神经系统重新启动。降低你的多巴胺阈值会让你获得更少的快感。\n上瘾的威胁一直在拖累我们的家庭。我们的一个儿子表现出了与设备成瘾一致的行为。太可怕了。他做的、说的和努力的每一件事，都是为了追求在他的iPad上等待着的多巴热销。他妈妈和我正在做大多数父母都会做的事情--阅读，寻求外界帮助，限制使用。但最重要的是，我们在试着放慢脚步。花时间陪他，尤其是在户外或看书。和他一起上床的时间到了，给他讲他祖父成为皇家海军蛙人的故事。让一切都慢下来。它似乎在起作用。\n我看到了亚历克斯·卡恩斯，也看到了我的大儿子。一个笑容满面的书呆子，对市场着迷，寻找多巴安非他明。我无法想象那个家庭的痛苦。我无法想象我们如何失去了剧本，让有意义的-创新和金钱-压倒了深刻的东西：我们的孩子。青少年自杀率在十年间增加了56%。2009年至2015年间，10岁至14岁的女孩自残事件增加了两倍。每天使用社交媒体超过五个小时的青少年患抑郁症的可能性是那些每天使用社交媒体不到一小时的青少年的两倍。\n难怪蒂姆·库克不想让他的侄子出现在社交媒体上？如果他不是蒂姆·库克，他还会说，我也不想让他有iPad吗？\n武器是我们的手机和平板电脑，子弹是由反社会的寡头领导的社交媒体公司。现在，我们可能有一个新的威胁在捕食年轻人：在线交易平台。\n我们是一个病毒肆虐的国家，宵禁警报会发送到我们的手机上。创新已成为剥削的代名词。我们在市场中找到了慰藉，但市场并不是经济或进步的反映，而是越来越多地反映出少数公司利用技术与监管之间的差距进行套利的能力。这真让人沮丧。怎么办呢？我会查一下我的点赞、提及和股票。\n另外，通过报名参加由您真心教授的七月战略冲刺活动，加入一个由全球近3000名校友组成的网络。我们G教授节目的嘉宾是进化心理学家杰弗里·米勒，他认为美德信号实际上可能是一股巨大的向善的力量。", "note_en": "Addiction is the inability to stop consuming a chemical or pursuing an activity although it’s causing harm.\n I engage with almost every substance or behavior associated with addiction: alcohol, drugs, coffee, porn, sex, gambling, work, spending, devices, and social media. I’ve abused all of them, but don’t think I’m addicted. On a balanced scorecard, these substances and behaviors, abuse and all, have been a net positive in my life, even @twitter.\n Most disease and hardship for our species has been a function of scarcity — too little salt, sugar, fat, approval, safety, opportunities to mate. As a result, when we find these things, our brain produces the ultimate reward, the pleasure hormone dopamine. And it makes sense. Nature rewards behaviors that ensure the propagation of the species.\n  The assembly line, processing power, and Amazon Prime have not only met the minimum thresholds for survival but created a new threat to our species: superabundance. Diabetes, income inequality, and fake news all are a function of our belief that more is better. Jeff Bezos capturing and hoarding the GDP of Norway doesn’t make sense for the species, but his instincts (fear of starvation, wielding power) reign supreme.\n Survival, propagation, and consumption should result in the next generation being smarter, faster, and stronger. Where things have come off the rails is a function of our innovation economy moving faster than our instincts. Historically, humans have engaged in activities that have natural stopping cues — the end of a chapter, the end credits. Platforms like Facebook, Instagram, and Netflix have systematically  eradicated stopping cues. Even casinos are deliberately laid out without hard angles, so it’s all one continuous space and you keep moving through it, on to the next game.\n Technological progress lapping the calibration of our instincts culminates in an endless scroll. We’re unable to find the off switch. Unlike our parents and grandparents, for us, dopamine release no longer depends on sacrifice, engagement, or grit, but on sitting still, as in 15, 14, 13 seconds until episode five of  Killing Eve will begin. There are more filtered photos, more porn, more equities, more margin, more dopa, and more time without the nuisance of needing to engage in life.\n The most recent crack dealers are online trading platforms (OTPs). What does an endless scroll look like on a trading platform?\n Gamification: Users can tap up to  1,000x per day to improve their position on the waitlist for Robinhood’s cash management feature (essentially a high-yield checking account on the app).\n  Our institutions (courts, Congress, the SEC) are supposed to  slow our thinking so our reflexive instincts are checked and we can decide not to discriminate, not to pour  mercury into the rivers, and not to let a bankrupt car rental firm ( Hertz) issue shares bound to be worthless. You lose, they win.\n Technological change is vastly outpacing our species’ ability to adapt to an endless barrage of stimuli. This discrepancy in modulation has exploded our levels of teen  depression and social chaos. We are in a Supermarine Spitfire, accelerating every day, hoping the fuselage holds together as we approach the sound barrier — streaming 31 seasons of  The Simpsons, lifelike video games, ubiquitous porn of increasing extremes, high-def documentation in real time of the party your 15-year-old daughter wasn’t invited to, social media algorithms fueled on emotion vs. veracity, and immediate approval of margin for a “bull put spread.”\n  I was a fucking mess yesterday after learning of the suicide of Alexander Kearns, a 20-year-old from Naperville, Illinois, who was interested in the markets and began trading stocks. Kearns mistakenly believed he was down $730,000 after trading options on the Robinhood app and took his own life. We don’t know what other factors were at play here, and young men taking their own lives after losing money in the market is not a new phenomenon.\n  Facebook and Twitter do what CNN and Fox have been doing for decades, but better. I’m afraid Robinhood might become an addictive platform — Instagram for trading. Robinhood users skew young (32% of visitors are between 25–34). The firm reported 3 million new accounts in Q1 2020.  Half were first-time traders. In addition, with Vegas and sports wagering all but shut down, OTPs have become the place where emerging gambling addiction can take root and/or a rehab facility where your sponsor is a dealer.\n Learning to invest and understanding the markets are good things, as is connecting with friends online… to a point. Social media and gambling have the same addictive psychological mechanism: variable rewards (when you keep performing an action in hopes of getting a possible but unlikely reward). This is the type of behavior that’s the “most addictive and  hardest to stop.” Robinhood management and investors have taken cues from Big Tech and made a conscious decision to disregard the well-being of our youth for personal enrichment.\n   12% of all trading  activity is from day-traders, yet day-traders are only 1.6% of all profitable traders.\n   Investors with a large differential between their existing economic conditions and their aspiration levels hold riskier stocks in their portfolios.\n Most articles will focus on what we, Americans, view as the profound risk with the surge in rookie online traders… that the  markets might go down. Most market tops coincide with retail investors entering. We haven’t, to my knowledge, seen the scale of a market crash driven by twentysomethings  investing government rescue funds, levered up via preapproval on their smartphones.\n Our elected officials and gross idolatry of money and innovators have overrun the institutions charged with slowing our thinking and keeping our kids safe. Joe Scarborough  put it well: “Mark, Sheryl, and Jack, you have revealed yourselves to be vapid vulgarians who put at risk Americans’ health, racial justice, fair elections, and basic truths.”\n Where do we turn? The bulk of the pressure to protect kids from device addiction falls on parents — limiting use (severely) and getting other parents at school to limit use as well, so kids don’t feel they are an exception. It’s difficult, and it needs to be done. An “electronics fast,” perhaps for the whole family, can allow the nervous system to  reset. Lowering your  dopamine threshold allows a smaller amount of pleasure to be satisfying.\n The threat of addiction has been slowing our household down. One of our sons demonstrates behavior consistent with device addiction. It’s terrifying. Everything he does, says, and works toward, is in pursuit of the dopa hit waiting on his iPad. His mom and I are doing what most parents would do — reading, seeking outside help, limiting use. But more than anything, we’re trying to slow things down. Time with him, especially outdoors or with books. Time in bed with him telling him stories about his grandfather becoming a frogman in the Royal Navy. Slowing everything down. It appears to be working.\n I see Alex Kearns, and I see my oldest son. A nerd, with a big smile, fascinated by the markets and seeking dopa hits. I can’t imagine the pain of that family. I can’t imagine how we’ve lost the script, letting the meaningful—innovation and money—trump the profound: our kids. The youth suicide rate has increased by  56% in a decade. Girls between 10 and 14 had a  tripling of self-harm episodes between 2009 and 2015. Teens who are on social media for more than five hours a day are  twice more likely to be depressed than those who are on for less than an hour.\n  Is it any wonder Tim Cook  doesn’t want his nephew on social media? If he wasn’t Tim Cook, would he also say, I don’t want him to have an iPad either?\n The weapons are our phones and tablets, and the bullets are social media  firms headed by sociopathic oligarchs. And now, we may have a new menace preying on young men: online trading platforms.\n We are a virus-ravaged nation where curfew alerts are sent to our phones. Innovation has become synonymous with exploitation. We find solace in the market being high, but the market is not a reflection of the economy or progress, but increasingly of the ability of a few firms to arbitrage the gap between the pace of technology and regulation. It’s depressing. What to do? I’ll check my likes, mentions, and stocks.\n  P.S. Join a network of nearly 3,000 alumni worldwide by signing up for the  July Strategy Sprint, taught by yours truly. And our guest on the   Prof G Show is evolutionary psychologist Geoffrey Miller, who thinks virtue signaling could actually be a huge force for good.", "posttime": "2020-06-26 10:20:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "交易,gamified,市场", "title": "罗宾汉把在线交易变成了一种瘾", "title_en": "Robinhood Has Gamified Online Trading into an Addiction", "transed": 1, "url": "https://marker.medium.com/robinhood-has-gamified-online-trading-into-an-addiction-cc1d7d989b0c", "via": "", "real_tags": ["交易", "gamified", "市场"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008339, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当黑洞碰撞时，考虑到这两个物体都是看不见的，随之而来的宇宙戏剧被认为是在黑暗的斗篷下上演的。但现在天文学家相信他们已经完成了这种合并的第一次光学观测，其标志是一道比太阳亮一万亿倍的火焰。\n这场耀斑与去年由引力波天文台LIGO探测到的已知黑洞合并有关，LIGO接收到了通过空间结构发出的涟漪。最新的观测表明，当这些灾难性事件发生在一个更巨大的黑洞的吸积盘内时，它们会被周围的尘埃和气体照亮，使它们也能被光学望远镜看到。\n“这个超大质量黑洞在这次突如其来的耀斑之前已经存在多年了，”这项工作的主要作者、加州理工学院天文学研究教授马修·格雷厄姆(Matthew Graham)说。“我们的结论是，耀斑很可能是黑洞合并的结果。”\n作者并未完全排除其他来源，但纽约城市大学(City University Of New York)的合著者萨维克·福特(Saavik Ford)表示，怀疑的窗口很窄。“我们有99.9%的把握，”她说。\n伯明翰大学引力波天文学研究所所长Alberto Vecchio教授表示，专家们现在将密切关注最新的观测结果与LIGO科学家将在未来几个月发表的对同一事件的详细分析。“如果两个独立的观察结果与…一致。这真的会是相当壮观的事情，“他说。\n在观察之前，福特和她的同事巴里·麦克南(Barry McKernan)从理论上预测，如果黑洞合并发生在第三个超大质量黑洞的吸积盘的背景下，黑洞合并将是可见的，这与预期相反。\n福特和麦科南与兹维基瞬变设施(ZTF)的项目科学家格雷厄姆合作，ZTF是一台全天巡天望远镜，旨在发现明亮的事件。福特说：“事实证明，它对这样的东西来说是完美的。”\n科学家们仔细研究了Zwicky的数据，寻找与LIGO检测到的已知碰撞在时间和地点上重合的任何耀斑，LIGO在每次检测到耀斑时都会发布公共警报。有一件事格外引人注目：LIGO在去年5月检测到一项名为S190521g的合并。\n格雷厄姆说：“这肯定不是我们三年前开始调查时预测到的事情之一。”\n更仔细的分析表明，合并发生在一个名为J1249+3449的遥远的超大质量黑洞附近，其直径相当于地球绕太阳的轨道。这对较小的黑洞位于吸积盘的外部，一个由恒星、尘埃和气体组成的光环围绕着巨大的中央天坑旋转。福特说：“这些物体就像愤怒的蜜蜂一样聚集在中心那只可怕的蜂后周围。”\n由于这对黑洞的大小约为怀特岛大小，总质量为150个太阳，向内螺旋并合并，引力波在太空中发出，新的合并后的物体受到相反方向的踢，使其穿过圆盘的尘埃和气体，向外飞入周围空间。\n麦科南说：“正是气体对这颗飞驰的子弹的反应，产生了用望远镜可以看到的明亮耀斑。”\n如果得到证实，这些观测可能有助于解决黑洞天文学中的一个核心问题：重量级黑洞的数量远远超过了应有的数量。黑洞是由坍塌的古老恒星形成的。当它们合并时会形成更大的黑洞，但一些黑洞太大了，从理论上说，它们滚雪球达到观测到的大小需要比宇宙年龄更长的时间。\n一个潜在的解释是，如果黑洞在吸积盘中聚集在一起，那么多轮合并的可能性就会大得多。Vecchio说：“如果你有一个地方可以把这些黑洞保留在一个地方，那么你就可以有效地将它们配对。”“气体是把它们粘在一起的粘合剂。”\nLIGO的观测并不容易解决这个问题，因为引力波天文学不能准确地定位合并发生在天空中的什么地方，但如果用传统望远镜也能看到同样的事件，答案可能很快就会出来。这项研究结果发表在“物理评论快报”杂志上。", "note_en": "When black holes collide, the ensuing cosmic drama was assumed to play out under the cloak of darkness, given that both objects are invisible. But now astronomers believe they have made the first optical observations of such a merger, marked by a blaze of light a trillion times brighter than the sun.\n The flare was linked to a known black hole merger detected last year by the gravitational wave observatory, Ligo, which picked up ripples sent out through the fabric of space. The latest observations suggest that when these cataclysmic events occur within the accretion disk of an even more gigantic black hole, they are brilliantly illuminated by the surrounding dust and gas, making them also visible to optical telescopes.\n “This supermassive black hole was burbling along for years before this more abrupt flare,” said Matthew Graham, a research professor of astronomy at the California Institute of Technology and lead author of the work. “We conclude that the flare is likely the result of a black hole merger.”\n  The authors have not entirely ruled out other sources, but Saavik Ford, a co-author based at the City University of New York, said the window of doubt was narrow. “We are 99.9% sure,” she said.\n Prof Alberto Vecchio, the director of the Institute of Gravitational Wave  Astronomy at the University of Birmingham, said experts would now be watching closely to see how the latest observations align with a detailed analysis of the same event due to be published in the coming months by Ligo scientists. “If the two independent observations line up … this would really be something rather spectacular,” he said.\n The observations came after Ford and her colleague, Barry McKernan, made theoretical predictions that black hole mergers would be visible, contrary to expectations, if they occurred against the backdrop of the accretion disk of a third supermassive black hole.\n Ford and McKernan teamed up with Graham, a project scientist for the Zwicky Transient Facility (ZTF), an all-sky survey telescope designed to spot bright events. “It turns out to be perfect for something like this,” said Ford.\n  The scientists trawled through the Zwicky data looking for any flares that coincided in place and time with known collisions that had been detected by Ligo, which releases public alerts each time a detection is made. One event stood out: a merger referred to as S190521g that Ligo detected in May last year.\n “It’s certainly not one of the things you would have predicted three years ago when we started the survey,” said Graham.\n Closer analysis suggested the merger had taken place in the vicinity of a distant supermassive black hole called J1249+3449, with a diameter equivalent to Earth’s orbit around the sun. The pair of smaller black holes sat at the outer reaches of the accretion disk, a halo of stars, dust and gas swirling around the vast central sinkhole. “These objects swarm like angry bees around the monstrous queen bee at the centre,” said Ford.\n As the pair of black holes, each around the size of the Isle of Wight and with a combined mass of 150 suns, spiral inwards and coalesce, gravitational waves are sent out across space and the new, merged object experiences a kick in the opposite direction, sending it ploughing through the dust and gas of the disk and out into surrounding space.\n  “It’s the reaction of the gas to this speeding bullet that creates a bright flare, visible with telescopes,” said McKernan.\n If confirmed, the observations could help to resolve a central problem in black hole astronomy: that there are far more heavyweight black holes than there ought to be.  Black holes form from collapsed ancient stars. Bigger black holes form when these merge, but some black holes are so big that in theory it ought to have taken longer than the age of the universe for them to snowball to their observed size.\n A potential explanation is that if black holes cluster together in accretion disks then multiple rounds of mergers become far more likely. “If you have a place where you can retain these black holes in one place, then you can pair them up efficiently,” said Vecchio. “The gas is the glue that keeps them all together.”\n Ligo observations are not easily able to resolve this question, because gravitational wave astronomy is not able to pinpoint exactly where in the sky a merger has taken place, but if the same events could be seen using conventional telescopes, an answer could be imminent. The findings are published in the journal  Physical Review Letters", "posttime": "2020-06-26 10:18:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,黑洞,holes", "title": "科学家说，黑洞可能与一万亿个太阳的光融合。", "title_en": "Black holes may merge with light of a trillion suns, scientists say", "transed": 1, "url": "https://www.theguardian.com/science/2020/jun/25/black-holes-may-merge-with-light-of-a-trillion-suns-scientists-say", "via": "", "real_tags": ["科学家", "黑洞", "holes"]}, {"category": "", "categoryclass": "", "imagename": "c72a91408e7830be28fd2ddf7f6ec5a1.jpg", "infoid": 1008338, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "共和党参议员周二提出了非法合法访问加密数据(LAED)法案，该法案如果获得通过，将要求科技公司允许执法部门访问加密数据，以执行搜查令。\n南卡罗来纳州参议院司法委员会主席林赛·格雷厄姆(Lindsey Graham)在与共和党同僚田纳西州参议员玛莎·布莱克本(Marsha Blackburn)和阿肯色州参议员汤姆·科顿(Tom Cotton)介绍这项立法时，在一份声明中表示，恐怖分子和犯罪分子经常使用技术，无论是智能手机、应用程序还是其他手段，来协调和沟通他们的日常活动。在他声称发生过恐怖主义案件和其他涉及严重犯罪活动的事件后，执法受到了阻碍。在这份声明中，参议院司法委员会主席林赛·格雷厄姆(Lindsey Graham)与田纳西州参议员玛莎·布莱克本(Marsha Blackburn)和阿肯色州参议员汤姆·科顿(Tom Cotton)一起介绍了这项立法。\n格雷厄姆在他的声明中说：我的立场很明确：在执法部门获得必要的法院授权后，他们应该能够检索信息来帮助他们的调查。我们的立法尊重和保护守法的美国人的隐私权。这也让恐怖分子和罪犯注意到，他们再也不能躲在科技的背后来掩盖他们的踪迹了。\n这项立法实质上是要求公司通过解密或通过某些其他机制，确保直接访问加密内容。\n沙龙采访了网络安全专家，他们都认为拟议中的立法威胁到公民自由，可能会产生意想不到的后果。\n这样做的问题在于它从根本上不了解加密是如何工作的。美国公民自由联盟(American Civil Liberties Union)高级立法顾问尼玛·辛格·古利亚尼(Neema Singh Guliani)告诉沙龙，你不能只为好人创建后门。任何时候你削弱加密，你就在系统本身和产品本身的网络安全方面削弱了它。该提案与我们过去看到的类似，也类似于过去那些也被认为存在根本缺陷而被拒绝的议定书。同样，这并不能反映出公司不仅清楚了解加密的价值，而且还不清楚公司会如何做法案声称要求的事情。(工业和信息化部电子科学技术情报研究所陈皓)。\n前华盛顿邮报记者布赖恩·克雷布斯(Brian Krebs)专门报道牟利的网络罪犯，目前经营着krebsonsecurity.com网站，他也有类似的观察。\n克雷布斯告诉沙龙，我认为确实想要这种能力的政府派别真的需要小心他们的愿望。他们想要这种神奇的能力，法院命令他们可以窥视任何上了锁的数字盒子的内部，看看里面有什么。但这些雄心壮志--顺便说一句，这并不是什么新鲜事，政府某些部门几十年来一直在推动--只是误导了，因为任何沿着这些路线进行的努力都将不可避免地带来相当大的不确定性和意想不到的后果。\n他补充说，我认为你可以认为这是在要求授权检查任何数字锁的盒子。很有可能，我们会打开潘多拉的盒子。也就是说，如果授予当局同样的能力，我们的对手，无论是民族国家、有组织犯罪还是其他人，基本上都会利用或滥用同样的能力来对付我们。\n古利亚尼认为，普通美国人应该害怕这种潜在的政府越权，特别是那些出国旅行或在国内从事抗议活动的人。\n古里亚尼说，他们应该害怕，因为每个人都依赖强加密，特别是当我们这些天回到家的时候。如果人们依赖互联网和数字通信，你就需要依靠强加密来保护你免受黑客攻击，特别是当你正在抗议或在国外保护自己免受政府攻击的时候。甚至在我们在美国看到的抗议活动中，我们也看到活动人士鼓励使用强加密来确保人们的隐私。\n新美国开放技术研究所(New America‘s Open Technology Institute)高级政策分析师安迪·威尔逊·汤普森(Andi Wilson Thompson)也认为，拟议中的立法是不祥的。\n汤普森解释说：我认为这真的很危险。考虑到它试图修改的法规种类繁多，我认为这是对加密的更全面的攻击，这一事实确实令人担忧。我认为这比我们最近看到的许多事情更令人担忧，因为他们试图解决这个问题的时间和方式都是如此。\n像克雷布斯一样，她指出政府寻求这种权力已经有一段时间了。\n汤普森指出，政府，特别是司法部，几十年来一直在推动这一点，但特别是在过去的五年里，为执法人员进入市场提供后门腐败。每当发生任何类型的恐怖袭击或公共犯罪情况时，他们都可以说加密阻止了信息的访问，因为加密的电话或通信或其他东西，每次发生这种情况时，他们都会想出一个借口。\n马修·罗兹萨(Matthew Rozsa)是沙龙的特约撰稿人。他拥有罗格斯大学纽瓦克分校的历史学硕士学位，并在利哈伊大学攻读历史学博士学位。他的作品曾出现在Mic、Quartz和MSNBC上。\n更多信息来自", "note_en": "Republican senators on Tuesday introduced the Lawful Access to Encrypted Data (LAED) Act, a bill that if passed would require technology companies to allow law enforcement to access encrypted data in order to carry out their warrants.\n &#34;Terrorists and criminals routinely use technology, whether smartphones, apps, or other means, to coordinate and communicate their daily activities,&#34; Senate Judiciary Committee Chairman  Lindsey Graham of South Carolina said in a  statement while introducing the legislation with his Republican colleagues, Sens. Marsha Blackburn of Tennessee and  Tom Cotton of Arkansas. After claiming that there have been terrorism cases and other incidents involving &#34;serious criminal activity&#34; in which law enforcement was  hindered by not being able to access encrypted information, Graham accused technology companies of not honoring court orders.\n  &#34;My position is clear: After law enforcement obtains the necessary court authorizations, they should be able to retrieve information to assist in their investigations,&#34; Graham said in his statement. &#34;Our legislation respects and protects the privacy rights of law-abiding Americans. It also puts the terrorists and criminals on notice that they will no longer be able to hide behind technology to cover their tracks.&#34;\n &#34;What this legislation would do is essentially require companies to ensure access to encrypted content right there, by decrypting it or through some other mechanisms.&#34;\n Salon spoke with cybersecurity experts, all of whom agreed that the proposed legislation threatens civil liberties and could have unintended consequences.\n  &#34;The problem with that is that it fundamentally doesn&#39;t understand how encryption works. You can&#39;t create a backdoor just for &#39;good guys,&#39;&#34; Neema Singh Guliani, Senior Legislative Counsel of the American Civil Liberties Union, told Salon. &#34;Anytime you weaken encryption, you weaken it in terms of the cybersecurity of the system itself and the product itself. The proposal is similar to what we&#39;ve seen in the past and similar to those past protocols that were also rejected as fundamentally flawed. This similarly doesn&#39;t reflect a clear understanding of not only the value of encryption, but how companies would even do what the bill purports to require.&#34;\n Brian Krebs, a former Washington Post journalist who specializes in covering profit-seeking cybercriminals and runs the website  krebsonsecurity.com, had a similar observation.\n &#34;I think the factions of government that did want this capability really need to be careful what they wish for,&#34; Krebs told Salon. &#34;They want this magical ability with a court order to peer inside of any locked digital box and see what&#39;s there. But these kinds of ambitions — which are not new by the way, certain parts of the government have been pushing for this for decades — it&#39;s just misguided, because any effort along these lines is invariably going to introduce a fair amount of uncertainty and unintended consequences.&#34;\n  He added, &#34;I think you could think of it as asking for the authority to look inside any digitally locked box. In all likelihood, we&#39;ll open Pandora&#39;s box. That is to say, the same ability, if granted to the authorities, will essentially be used or abused against us by our adversaries, whether they be nation-states, organized crime or others.&#34;\n Guliani argued that ordinary Americans should be frightened of this potential government overreach, especially those who travel abroad or engage in protest activity at home.\n  &#34;They should be scared as everybody relies on strong encryption, especially when we&#39;re home these days,&#34; Guliani said. &#34;If people are relying on the internet and digital communications, you rely on strong encryption to protect you from hackers, especially if you&#39;re protesting or are abroad to protect your yourself from the government. Even in the protest we&#39;ve seen in the U S we&#39;ve seen activists encourage the use of strong encryption to make sure that people have their privacy.&#34;\n Andi Wilson Thompson, Senior Policy Analyst at New America&#39;s Open Technology Institute, also argued that the proposed legislation is ominous.\n &#34;I think it&#39;s really dangerous,&#34; Thompson explained. &#34;I think that the fact that it&#39;s a more comprehensive assault on encryption is really concerning, given the wide variety of statutes that it is trying to amend. And I think that is much more concerning than a lot of things we&#39;ve seen recently, because of both the time and the way that they&#39;re attempting to address this.&#34;\n  Like Krebs, she noted that the government has sought this kind of power for a while.\n &#34;The government, especially the Justice Department, have been pushing for this for decades, but especially for the past five years, to have backdoor corruption for law enforcement access,&#34; Thompson pointed out. &#34;Every time there was any sort of terrorist attack or public criminal situation where they can say that encryption has prevented access to information because of the encrypted phone or communications or something, every time that happens, they come up with an excuse.&#34;\n  Matthew Rozsa is a staff writer for Salon. He holds an MA in History from Rutgers University-Newark and is ABD in his PhD program in History at Lehigh University. His work has appeared in Mic, Quartz and MSNBC.\n MORE FROM", "posttime": "2020-06-26 09:59:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "加密,encryption", "title": "告别隐私：林赛·格雷厄姆(Lindsay Graham)公布了一项法案，该法案将使加密无用。一位专家说，该法案“(错误地)理解了加密的工作原理。你不能只为‘好人’创建后门。”", "title_en": "Farewell to privacy: Lindsay Graham unveils a bill that would make encryption useless. The bill \"[mis]understands how encryption works. You can't create a backdoor just for 'good guys,'\" one expert says", "transed": 1, "url": "https://www.salon.com/2020/06/25/farewell-to-privacy-lindsay-graham-unveils-a-bill-that-would-make-encryption-useless/", "via": "", "real_tags": ["加密"]}, {"category": "", "categoryclass": "", "imagename": "e76f80a3a728909b6ee5bc24d33b2964.png", "infoid": 1008337, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Commodore Basic(Cbmbasic)是Commodore 64上提供的Microsoft Basic 6502版本的100%兼容版本。您可以在交互模式下使用它，也可以将基本文件作为命令行参数传递。\n此源代码不模拟6502代码；所有代码都完全是本机代码。在1 GHz的CPU上，与1 MHz的6502相比，您可以获得1000倍的速度。\n您可以在交互模式下使用cbmbasic，只需运行不带参数的二进制文件，也可以在命令行上指定一个ASCII编码的BASIC程序。您还可以将cbmbasic用作UNIX脚本语言，方法是向Basic程序添加hashbang行并使其可执行。\n$ls-l hello.bas-rwxr-xr-x 1薄雾员工40 7 4月21：30你好。bas$cat hello.bas#！/usr/bin/cbmbasicPRINT&#34；Hello World！&#34；$./hello.bas Hello world！\ncbmbasic实现了一个小插件系统，允许开发人员添加额外的语句、函数等。现在，您可以用&#34；SYS 1&#34；打开它(用&#34；SYS 0&#34；关闭)，然后使用新的语句locate y，x(设置光标位置)，系统字符串(运行命令行命令)和扩展的等待端口MASK，它实现了比尔·盖茨的复活节彩蛋。\nBASIC解释器的核心在cbmbasic.c文件中，该文件与平台、字节顺序和位无关。对于所有I/O，它都调用到runtime.c中，因此只需更改runtime.c就可以使该项目适应任何操作系统。\n核心解释器无法处理的所有函数调用都会在runtime.c中的kernaldispatch()中结束，在那里，switch语句会将这些调用分派给C函数。对于Commodore Basic，runtime.c必须支持几个Commodore内核库例程。其中一些非常重要(Chrin、CHROUT)，而另一些仅用于某些基本语句(LOAD、SAVE、OPEN、SETTIM)。runtime.c还没有实现所有函数。\n您可以随意将此项目用于任何目的，如果您愿意，可以给予表扬，如果您愿意，还可以将改进反馈给作者，这样其他人就可以从中受益。有关许可证详细信息，请参阅来源。", "note_en": "&#34;Commodore BASIC&#34; (cbmbasic) is a 100% compatible version of Commodore&#39;s version of Microsoft BASIC 6502 as found on the Commodore 64. You can use it in interactive mode or pass a BASIC file as a command line parameter.\n This source does not emulate 6502 code; all code is completely native. On a 1 GHz CPU you get about 1000x speed compared to a 1 MHz 6502.\n       You can use cbmbasic in interactive mode by just running the binary without parameters, or you can specify an ASCII-encoded BASIC program on the command line. You can also use cbmbasic as a UNIX scripting language by adding a hashbang line to your BASIC program and making it executable.\n $ ls -l hello.bas -rwxr-xr-x 1 mist staff 40 7 Apr 21:30 hello.bas$ cat hello.bas #!/usr/bin/cbmbasicPRINT&#34;HELLO WORLD!&#34;$ ./hello.bas HELLO WORLD!\n cbmbasic implements a small plugin system that lets developers add additional statements, functions etc. Right now, you can turn this on with &#34;SYS 1&#34; (turn off with &#34;SYS 0&#34;), and use the new statements LOCATE  y,  x (set cursor position), SYSTEM  string (run command line command) and the extended WAIT  port,  mask, which implements the  Bill Gates easter egg.\n  The core of the BASIC interpreter is in the file  cbmbasic.c, which is platform, endianness and bitness independent. For all I/O, it calls out into  runtime.c, so it should be possible to adapt this project for any OS by just changing  runtime.c.\n All function calls that the core interpreter can&#39;t handle end up in kernal_dispatch() in  runtime.c, where a switch statement dispatches these to C functions. For Commodore BASIC,  runtime.c has to support several Commodore KERNAL library routines. Some of them are very important (CHRIN, CHROUT) and some are only used for certain BASIC statements (LOAD, SAVE, OPEN, SETTIM).  runtime.c does not implement all functions yet.\n  Feel free to use this project for any purpose, give credit if you like, and send back improvements to the authors, if you like, so that others can benefit from it. See source for license details.", "posttime": "2020-06-26 09:58:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "commodore,basic", "title": "作为脚本语言的Commodore BASIC", "title_en": "Commodore Basic as a Scripting Language", "transed": 1, "url": "https://github.com/mist64/cbmbasic", "via": "", "real_tags": ["commodore", "basic"]}, {"category": "", "categoryclass": "", "imagename": "73b9e21509039d3d6b080567c37e0a09.png", "infoid": 1008336, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "in是一个面向控制台的天气预报服务，它支持各种信息表示方法，如控制台HTTP客户端(cURL、HTTPI或wget)的面向终端的ANSI序列、Web浏览器的HTML或图形查看器的PNG。\n您可以通过Shell或Web浏览器访问该服务，如下所示：\n$curl wttr.in城市天气：法国巴黎\\/晴朗。-.10-11°C-()-↑11公里/小时`-‘10公里/\\0.0毫米。\n(这不是你的实际位置--GitHub的CDN用自己的IP地址隐藏了你的真实IP地址，但它仍然是用你的语言发布的实时天气预报。)。\n想要获取特定位置的天气信息吗？您可以将所需位置添加到请求中的URL，如下所示：\n如果省略位置名称，您将获得基于您的IP地址的当前位置报告。\n使用3个字母的机场代码获取某机场的天气信息：\n$curl wttr.in/muc#国际航空运输协会的天气：德国慕尼黑国际机场MUC$curl wttr.in/ham#国际航空运输协会的天气：火腿，德国汉堡机场\n比方说，你想要了解一个城镇或城市以外的地理位置的天气--也许是一个城市、一个山名或某个特殊地点的一个吸引人的地方。在名称前添加字符~，以便在随后检索天气之前查找该指定分配名称：\n对于这些示例，您将在天气预报输出下面看到一条线，它显示了查找位置的地理位置结果：\n位置：станцияВосток，AAT，南极洲沃斯托克站[-78.4642714,106.8364678]地点：法国阿纳托尔大道5号，格罗斯-凯洛，7E，巴黎，法兰西岛，75007，法国[48.8582602，2.29449905432]地点：坦桑尼亚北部乞力马扎罗[-3.4762789，37.3872648]。\n您还可以使用IP地址(直接)或域名(前缀为@)指定位置：\n默认情况下，USCS单位用于来自美国的查询和世界其他地区的公制查询。您可以通过向URL添加“U”或“M”来覆盖此行为，如下所示：\n根据User-Agent字符串选择ANSI和HTML格式。可以通过在查询末尾添加.png来强制使用PNG格式：\n您可以将所有选项与png格式一起使用，就像在URL中一样，但是您必须用_而不是？分隔它们。和&amp；：\n当使用天气PNG向图片添加天气数据时，透明度是一个有用的功能：\n您可以使用wtr-switcher将一个特殊的wttr.in小部件嵌入到HTML页面中，该小部件显示当前或选定位置的天气状况。这就是它看起来的样子：wtr-Switcher-示例或在现实世界的网站上：https://feuerwehr-eisolzried.de/.。\n可用的预配置格式：1、2、3、4和使用百分比表示法的自定义格式(见下文)。\n$curl-s&39；wttr.in/{纽伦堡，汉堡，柏林}？格式=3&#39；纽伦堡：🌦+11⁰昌堡：🌦+8⁰C柏林：🌦+8⁰C。\nc天气条件，C天气条件文字名称，h湿度，t温度(实际)，f温度(感觉像)，w风，l位置，m月相🌑🌒🌓🌔🌕🌖🌗🌘，M月日，p降水量(Mm)，o降水概率，P气压(百帕)，D黎明*，S日出*，z天顶*，s日落*，d黄昏*。(时间显示在当地时区)。\n$curl wttr.in/London？Format=3伦敦：⛅️+7⁰C$curl wttr.in/London？Format=&#34；%l：+%c+%t&#34；伦敦：⛅️+7⁰C。\n请记住，在tmux.conf中使用时，必须将%转义为%，即在那里写入%%而不是%。\n在自动查询服务的程序(如tmux)中，最好使用一些合理的更新间隔。在tmux中，您可以使用status-interval对其进行配置。\n如果在查询中指定了几个、：分隔的位置，请将更新周期指定为附加查询参数PERIOD=：\n对于Emoji字体，我们推荐Noto Color Emoji，一个很好的选择是Emoji One字体；这两种字体都支持所有必要的Emoji字形。\n$cat~/.config/fonts.cong/fonts.conf&lt；？xml版本=&#34；1.0&#34；编码=&#34；UTF-8&#34；？&gt；&lt；！DOCTYPE字体配置系统&#34；fonts.dtd&34；&gt；&lt；fontconfig&gt；&lt；别名&gt；&lt；family&gt；serif&。/首选&gt；&lt；/alias&gt；&lt；alias&gt；&lt；family&gt；sans-serif&lt；/family&gt；&lt；首选&gt；&lt；家族&gt；Noto Color Emoji&lt；/family&gt；&lt；/首选&gt；&lt；/alias&gt；&lt；/alias&gt；&lt；别名&gt；&lt；Noto Color Emoji&lt；/Family&gt；&lt；/Preference&gt；&lt；/alias&gt；&lt；/fontconfig&gt；\n在视图代码v2下提供的实验数据丰富的输出格式中，可以获得大量额外的天气和天文信息：\n根据您的配置，您可能采取所有步骤，也可能只采取几个步骤。目前URXVT不支持与表情符号相关的字体，但我们可以使用Font-Symbola获得几乎相同的效果。因此，将以下行添加到您的.Xresources文件：\n您可以将其添加到首选字体之后，只有在需要时才会显示。然后，如果您看到或感觉自己遇到了间距问题，请添加以下内容：URxvt.letterSpace：0出于某种原因，URXVT有时会停止决定正确的单词间距，我们需要强制执行此操作。\nJSON格式是一种功能，它通过易于解析的格式提供对wttr.in数据的访问，而不需要用户创建复杂的脚本来重新解释wttr.in的图形输出。\n这将以JSON格式获取有关底特律地区的信息。J1格式代码用于允许将其他布局用于JSON输出。\n{&#34；Current_Condition&#34；：[{&#34；FeelsLikeC&#34；：&#34；25&#34；，&#34；FeelsLikeF&#34；：&#34；76&#34；，&#34；Cloudcover&#34；：&#34；100&#34；，&#34；湿度&#34；：&#34；76&#34；，&#34；观察时间&#34；：&。，&#34；沉淀MM&#34；：&#34；0.2&#34；，&#34；压力&#34；：&#34；1019&#34；，&#34；温度_C&#34；：&#34；22&#34；，&#34；温度_F&#34；：&#34；72&#34；，&#34；uvIndex&#34；：5，&#34；可见性&#34；：&#34；16&##。，&#34；weatherCode&#34；：&#34；122&#34；，&#34；weatherDesc&#34；：[{&#34；value&#34；：&#34；overcast&#34；}]，&#34；weatherIconUrl&#34；：[{&#34；value&#34；：&#34；&#34；}]，&#34；windir16Point&#34；：&#34；nne&#。windirDegree&#34；：&#34；20&#34；，&#34；winspeedKmph&#34；：&#34；7&#34；，&#34；winspeedMiles&#34；：&#34；4&#34；}]，.\n除了weatherCode之外，这些值中的大多数都是不言而喻的。weatherCode是一个枚举，您可以在WorldWeatherOnline网站或wttr.in源代码中找到它。\nPrometheus Metrics格式是一种功能，可通过易于解析的格式为监控系统提供对WTR.IN数据的访问，而无需用户创建复杂的脚本来重新解释WTTR.IN的图形输出。\n这将以普罗米修斯指标格式获取有关底特律地区的信息。p1格式代码用于允许使用普罗米修斯公制输出的其他布局。\n#Help Temperature_Feel_Like_摄氏度感觉像Celsiustemperature_feels_like_celsius{forecast=&#34；current&#34；}7中的温度#Help Temperature_Feel_Like_Fahrenheit感觉像Fahrenheittemperature_feels_like_fahrenheit{forecast=&#34；current&#34；}45中的温度[截断]。\nwttr.in还可以用来检查月相。此示例说明如何在完全输出模式下查看当前月相：\n对于某些字体，🌘的表示是模棱两可的，因为它看起来要么几乎是阴影的，要么几乎是亮的，这取决于你的终端是亮模式还是暗模式。依靠彩色字体(如Noto-Fonts)可以解决此问题。\n代表🌘也是模棱两可的，因为它在北半球的意思是最后一个季度，但在南半球是第一季度的意思。在热带地区，它也不意味着什么。这是Unicode知道的一个限制，但是在wttr.in中还没有解决这个问题。\n有关相应的跟踪问题，请参见#247、#364，有关Pyphoon的信息，请参阅Pyphoon#1。欢迎任何帮助。\nin支持可以用世界上任何语言指定的多语言地点名称(这可能令人惊讶，但世界上许多地点都没有英文名称)。\n查询字符串应以Unicode(十六进制编码或非十六进制编码)指定。查询字符串中的空格必须替换为+：\n$curl wttr.in/станция+Восток天气报告：станцияВосток阴天。-65--47°C。-()。↑23公里/小时(_.__)__)15公里0.0毫米。\n用于输出的语言(位置名称除外)不依赖于输入语言，它要么是英语(默认情况下)，要么是在查询标头中指定的浏览器的首选语言(如果查询是从浏览器发出的)(Accept-Language)。\n使用Console客户端时，可以使用如下命令行选项显式设置语言：\n第三个选项是使用查询中使用的DNS名称选择语言：\nwttr.in目前被翻译成54种语言，而且支持的语言数量还在不断增加。\n请参阅/：翻译以了解有关翻译过程的更多信息，查看支持的语言和贡献者列表，或了解如何帮助将wttr.in翻译为您的语言。\n当前存在两个与Windows相关的问题，它们会阻止本页上的示例开箱即用，无法完全按照预期工作。在微软解决这些问题之前，有几个解决办法。要绕过这两个问题，您可以在Windows Subsystem for Linux(WSL)上使用诸如bash之类的shell，或者继续阅读其他解决方案。\n当前的Win32版本的cURL是有限制的。在未来的Windows版本中解决并推出Win32 cURL问题之前，建议您改用Powershell的Invoke-Web-Request命令：\n第二个问题与某些Windows终端应用程序(如默认的conhost.exe)使用的对角箭头图示符的宽度有关。在撰写本文时，ConEmu.exe、ConEmu64.exe和构建在ConEmu之上的终端应用程序(如Cmder(cmder.exe))默认使用这些双宽字形。所有这些程序的结果都是一样的，要么是某些风向缺少字符，要么是输出中的表格损坏，或者两者兼而有之。某些第三方终端应用程序已经解决了风向图示符问题，但修复方法取决于您使用的字体和终端应用程序。在终端应用程序中显示对角线风向图示符的一种方法是使用当前在Microsoft应用商店中提供的Windows终端。Windows终端目前是一个预览版，将在即将发布的版本中作为默认终端应用程序推出。如果使用Windows终端后输出仍有偏差，请尝试最大化终端窗口。另一种显示对角线风向的方法是使用正斜杠和反斜杠替换有问题的字符，如下所示。\n如果您想以PNG文件格式获取天气报告，您还需要安装：\n此外，您还需要安装Geoip2数据库。您可以使用可从(http://dev.maxmind.com/geoip/geoip2/geolite2/).)下载的免费数据库GeoLite2。\n如果要对GeoLite2未覆盖的IP地址使用IP2Location服务，则必须获取该服务的API密钥，然后保存到~/.ip2location.key文件中：\n如果您没有这个文件，该服务将被自动跳过(这不是一个大问题，因为MaxMind数据库非常好)。\n拥有WorldWeatherOnline密钥后，可以将其保存到WWO密钥文件中：~/.wwo.key\n配置以下环境变量，它们定义本地wttr.ininstall、GeoLite数据库和Wego安装的路径。例如：\n建议您还配置将用于访问该服务的Web服务器：\nserver{Listen[：：]：80；server_name wttr.in*.wttr.in；access_log/var/log/nginx/wttr.in-access.log main；error_log/var/log/nginx/wttr.in-error.log；Location/{Proxy_Pass http://127.0.0.1:8002；Proxy_Set_Header Host$HOST；Proxy_Set_Header X-Real-IP$Remote_Addr；Proxy_Set_Header X-Forwarded-for$Remote_addr。CLIENT_BODY_BUFFER_SIZE 128k；PROXY_CONNECT_TIMEOUT 90；PROXY_SEND_TIMEOUT 90；PROXY_READ_TIMEOUT 90；PROXY_BUFFER_SIZE 4K；Proxy_Buffers 4 32k；PROXY_BUSY_BUFFER_SIZE 64k", "note_en": "wttr.in is a console-oriented weather forecast service that supports various informationrepresentation methods like terminal-oriented ANSI-sequences for console HTTP clients(curl, httpie, or wget), HTML for web browsers, or PNG for graphical viewers.\n    You can access the service from a shell or from a Web browser like this:\n $ curl wttr.inWeather for City: Paris, France \\ / Clear .-. 10 – 11 °C ― ( ) ― ↑ 11 km/h `-’ 10 km / \\ 0.0 mm\n   (It&#39;s not your actual location - GitHub&#39;s CDN hides your real IP address with its own IP address,but it&#39;s still a live weather report in your language.)\n   Want to get the weather information for a specific location? You can add the desired location to the URL in yourrequest like this:\n  If you omit the location name, you will get the report for your current location based on your IP address.\n Use 3-letter airport codes in order to get the weather information at a certain airport:\n $ curl wttr.in/muc # Weather for IATA: muc, Munich International Airport, Germany$ curl wttr.in/ham # Weather for IATA: ham, Hamburg Airport, Germany\n Let&#39;s say you&#39;d like to get the weather for a geographical location other than a town or city - maybe an attractionin a city, a mountain name, or some special location. Add the character  ~ before the name to look up that speciallocation name before the weather is then retrieved:\n  For these examples, you&#39;ll see a line below the weather forecast output that shows the geolocationresults of looking up the location:\n Location: Vostok Station, станция Восток, AAT, Antarctica [-78.4642714,106.8364678]Location: Tour Eiffel, 5, Avenue Anatole France, Gros-Caillou, 7e, Paris, Île-de-France, 75007, France [48.8582602,2.29449905432]Location: Kilimanjaro, Northern, Tanzania [-3.4762789,37.3872648]\n You can also use IP-addresses (direct) or domain names (prefixed with  @) to specify a location:\n     By default the USCS units are used for the queries from the USA and the metric system for the rest of the world.You can override this behavior by adding  ?u or  ?m to a URL like this:\n     The ANSI and HTML formats are selected basing on the User-Agent string.The PNG format can be forced by adding  .png to the end of the query:\n  You can use all of the options with the PNG-format like in an URL, but you haveto separate them with  _ instead of  ? and  &amp;:\n    Transparency is a useful feature when weather PNGs are used to add weather data to pictures:\n     You can embed a special wttr.in widget, that displays the weather condition for the current or a selected location, into a HTML page using the  wttr-switcher. That is how it looks like:  wttr-switcher-example or on a real world web site:  https://feuerwehr-eisolzried.de/.\n     Available preconfigured formats: 1, 2, 3, 4 and the custom format using the percent notation (see below).\n    $ curl -s &#39;wttr.in/{Nuremberg,Hamburg,Berlin}?format=3&#39;Nuremberg: 🌦 +11⁰CHamburg: 🌦 +8⁰CBerlin: 🌦 +8⁰C\n  c Weather condition, C Weather condition textual name, h Humidity, t Temperature (Actual), f Temperature (Feels Like), w Wind, l Location, m Moonphase 🌑🌒🌓🌔🌕🌖🌗🌘, M Moonday, p precipitation (mm), o Probability of Precipitation, P pressure (hPa), D Dawn*, S Sunrise*, z Zenith*, s Sunset*, d Dusk*.(times are shown in the local timezone)\n  $ curl wttr.in/London?format=3 London: ⛅️ +7⁰C $ curl wttr.in/London?format=&#34;%l:+%c+%t&#34; London: ⛅️ +7⁰C\n Keep in mind, that when using in  tmux.conf, you have to escape  % with  %, i.e. write there  %% instead of  %.\n In programs, that are querying the service automatically (such as tmux), it is better to use some reasonable update interval. In tmux, you can configure it with  status-interval.\n If several,  : separated locations, are specified in the query, specify update periodas an additional query parameter  period=:\n     For the Emoji font, we recommend  Noto Color Emoji, and a good alternative option would be the  Emoji One font;both of them support all necessary emoji glyphs.\n  $ cat ~/.config/fontconfig/fonts.conf&lt;?xml version=&#34;1.0&#34; encoding=&#34;UTF-8&#34;?&gt;&lt;!DOCTYPE fontconfig SYSTEM &#34;fonts.dtd&#34;&gt;&lt;fontconfig&gt; &lt;alias&gt; &lt;family&gt;serif&lt;/family&gt; &lt;prefer&gt; &lt;family&gt;Noto Color Emoji&lt;/family&gt; &lt;/prefer&gt; &lt;/alias&gt; &lt;alias&gt; &lt;family&gt;sans-serif&lt;/family&gt; &lt;prefer&gt; &lt;family&gt;Noto Color Emoji&lt;/family&gt; &lt;/prefer&gt; &lt;/alias&gt; &lt;alias&gt; &lt;family&gt;monospace&lt;/family&gt; &lt;prefer&gt; &lt;family&gt;Noto Color Emoji&lt;/family&gt; &lt;/prefer&gt; &lt;/alias&gt;&lt;/fontconfig&gt;\n   In the experimental data-rich output format, that is available under the view code  v2,a lot of additional weather and astronomical information is available:\n            Depending on your configuration you might be taking all steps, or only a few. URXVT currenly doesn&#39;t support emoji related fonts, but we can get almost the same effect using  Font-Symbola. So add to your  .Xresources file the following line:\n  You can add it  after your preferred font and it will only show up when required.Then, if you see or feel like you&#39;re having spacing issues, add this:  URxvt.letterSpace: 0For some reason URXVT sometimes stops deciding right the word spacing and we need to force it this way.\n     The JSON format is a feature providing access to  wttr.in data through an easy-to-parse format, without requiring the user to create a complex script to reinterpret wttr.in&#39;s graphical output.\n   This will fetch information on the Detroit region in JSON format. The j1 format code is used to allow for the use of other layouts for the JSON output.\n  {&#34;current_condition&#34;: [ { &#34;FeelsLikeC&#34;: &#34;25&#34;, &#34;FeelsLikeF&#34;: &#34;76&#34;, &#34;cloudcover&#34;: &#34;100&#34;, &#34;humidity&#34;: &#34;76&#34;, &#34;observation_time&#34;: &#34;04:08 PM&#34;, &#34;precipMM&#34;: &#34;0.2&#34;, &#34;pressure&#34;: &#34;1019&#34;, &#34;temp_C&#34;: &#34;22&#34;, &#34;temp_F&#34;: &#34;72&#34;, &#34;uvIndex&#34;: 5, &#34;visibility&#34;: &#34;16&#34;, &#34;weatherCode&#34;: &#34;122&#34;, &#34;weatherDesc&#34;: [ { &#34;value&#34;: &#34;Overcast&#34; } ], &#34;weatherIconUrl&#34;: [ { &#34;value&#34;: &#34;&#34; } ], &#34;winddir16Point&#34;: &#34;NNE&#34;, &#34;winddirDegree&#34;: &#34;20&#34;, &#34;windspeedKmph&#34;: &#34;7&#34;, &#34;windspeedMiles&#34;: &#34;4&#34; }],...\n Most of these values are self-explanatory, aside from  weatherCode. The  weatherCode is an enumeration which you can find at either  the WorldWeatherOnline website or  in the wttr.in source code.\n  The  Prometheus Metrics format is a feature providing access to  wttr.in data through an easy-to-parse format for monitoring systems, without requiring the user to create a complex script to reinterpret wttr.in&#39;s graphical output.\n   This will fetch information on the Detroit region in Prometheus Metrics format. The  p1 format code is used to allow for the use of other layouts for the Prometheus Metrics output.\n    # HELP temperature_feels_like_celsius Feels Like Temperature in Celsiustemperature_feels_like_celsius{forecast=&#34;current&#34;} 7# HELP temperature_feels_like_fahrenheit Feels Like Temperature in Fahrenheittemperature_feels_like_fahrenheit{forecast=&#34;current&#34;} 45[truncated]\n   wttr.in can also be used to check the phase of the Moon. This example shows how to see the current Moon phasein the full-output mode:\n        With some fonts, the representation  🌘 is ambiguous, for it either seemalmost-shadowed or almost-lit, depedending on whether your terminal is inlight mode or dark mode. Relying on colored fonts like  noto-fonts worksaround this problem.\n The representation  🌘 is also ambiguous, for it means &#34;last quarter&#34; innorthern hemisphere, but &#34;first quarter&#34; in souther hemisphere. It also meansnothing in tropical zones. This is a limitation that Unicode is aware about.But it has not been worked around at  wttr.in yet.\n See #247, #364 for the corresponding tracking issues,and  pyphoon#1 for pyphoon. Any help is welcome.\n  wttr.in supports multilingual locations names that can be specified in any language in the world(it may be surprising, but many locations in the world don&#39;t have an English name).\n The query string should be specified in Unicode (hex-encoded or not). Spaces in the query stringmust be replaced with  +:\n $ curl wttr.in/станция+ВостокWeather report: станция Восток Overcast .--. -65 – -47 °C .-( ). ↑ 23 km/h (___.__)__) 15 km 0.0 mm\n The language used for the output (except the location name) does not depend on the input languageand it is either English (by default) or the preferred language of the browser (if the querywas issued from a browser) that is specified in the query headers ( Accept-Language).\n The language can be set explicitly when using console clients by using command-line options like this:\n    The third option is to choose the language using the DNS name used in the query:\n  wttr.in is currently translated into 54 languages, and the number of supported languages is constantly growing.\n See  /:translation to learn more about the translation process,to see the list of supported languages and contributors, or to know how you can help to translate wttr.inin your language.\n   There are currently two Windows related issues that prevent the examples found on this page from working exactly as expected out of the box. Until Microsoft fixes the issues, there are a few workarounds. To circumvent both issues you may use a shell such as  bash on the  Windows Subsystem for Linux (WSL) or read on for alternative solutions.\n  There is a limitation of the current Win32 version of  curl. Until the  Win32 curl issue is resolved and rolled out in a future Windows release, it is recommended that you use Powershell’s  Invoke-Web-Request command instead:\n   The second issue is regarding the width of the diagonal arrow glyphs that some Windows Terminal Applications such as the default  conhost.exe use. At the time of writing this,  ConEmu.exe,  ConEmu64.exe and Terminal Applications built on top of ConEmu such as Cmder ( cmder.exe) use these double-wide glyphs by default. The result is the same with all of these programs, either a missing character for certain wind directions or a broken table in the output or both. Some third-party Terminal Applications have addressed the wind direction glyph issue but that fix depends on the font and the Terminal Application you are using.One way to display the diagonal wind direction glyphs in your Terminal Application is to use  Windows Terminal which is currently available in the  Microsoft Store. Windows Terminal is currently a preview release and will be rolled out as the default Terminal Application in an upcoming release. If your output is still skewed after using Windows Terminal then try maximizing the terminal window.Another way you can display the diagonal wind direction is to swap out the problematic characters with forward and backward slashes as shown  here.\n            If you want to get weather reports as PNG files, you&#39;ll also need to install:\n       Also, you need to install the geoip2 database.You can use a free database GeoLite2 that can be downloaded from ( http://dev.maxmind.com/geoip/geoip2/geolite2/).\n  If you want to use the IP2location service for IP-addresses that are not covered by GeoLite2,you have to obtain a API key of that service, and after that save into the  ~/.ip2location.key file:\n  If you don&#39;t have this file, the service will be silently skipped (it is not a big problem,because the MaxMind database is pretty good).\n    After you have a WorldWeatherOnline key, you can save it into theWWO key file:  ~/.wwo.key\n     Configure the following environment variables that define the path to the local  wttr.ininstallation, to the GeoLite database, and to the  wego installation. For example:\n   It&#39;s recommended that you also configure the web server that will be used to access the service:\n server { listen [::]:80; server_name wttr.in *.wttr.in; access_log /var/log/nginx/wttr.in-access.log main; error_log /var/log/nginx/wttr.in-error.log; location / { proxy_pass http://127.0.0.1:8002; proxy_set_header Host $host; proxy_set_header X-Real-IP $remote_addr; proxy_set_header X-Forwarded-For $remote_addr; client_max_body_size 10m; client_body_buffer_size 128k; proxy_connect_timeout 90; proxy_send_timeout 90; proxy_read_timeout 90; proxy_buffer_size 4k; proxy_buffers 4 32k; proxy_busy_buffers_size 64k; proxy_temp_file_write_size 64k; expires off; }}", "posttime": "2020-06-26 09:56:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "卷曲,curl", "title": "卷曲Wttr.in", "title_en": "Curl Wttr.in", "transed": 1, "url": "https://github.com/chubin/wttr.in", "via": "", "real_tags": ["卷曲", "curl"]}, {"category": "", "categoryclass": "", "imagename": "f009ed3be9fa0fa52d888112d4df4382.jpg", "infoid": 1008335, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人脑利用成对的眼睛和耳朵的输入之间的细微差异来构建三维体验和导航环境。尽管人类也有两个独立的鼻道，同时从太空中不重叠的区域取样，但它是否以及如何影响嗅觉尚不清楚。在这里，我们证明，鼻孔间气味强度的适度差异始终会使受试者感知到的自我运动方向偏向浓度较高的一侧，尽管他们无法报告哪个鼻孔的气味更强烈。这些发现表明，人类有一种潜意识中引导导航的立体嗅觉。人类导航依赖于我们成对的眼睛和耳朵的输入。虽然我们也有两个鼻道，但几乎没有经验表明鼻孔间的差异会导致人类嗅觉的方向性，而不涉及三叉神经系统。通过使用光流捕捉视觉场景中表面元素的表观运动模式，我们通过正式的心理物理测试证明，非三叉神经气味的适度二线浓度差异始终会使受试者感知到的自我运动方向偏向浓度较高的一侧，尽管他们无法用语言表达哪个鼻孔气味更强烈。我们进一步表明，这种影响取决于鼻孔间气味浓度的比率，而不是两个鼻孔之间浓度的数值差异。综上所述，我们的发现提供了行为证据，证明人类通过立体嗅觉嗅觉，并在空间导航中下意识地利用立体嗅觉线索。", "note_en": "The human brain exploits subtle differences between the inputs to the paired eyes and ears to construct three-dimensional experiences and navigate the environment. Whether and how it does so for olfaction is unclear, although humans also have two separate nasal passages that simultaneously sample from nonoverlapping regions in space. Here, we demonstrate that a moderate internostril difference in odor intensity consistently biases recipients’ perceived direction of self-motion toward the higher-concentration side, despite that they cannot report which nostril smells a stronger odor. The findings indicate that humans have a stereo sense of smell that subconsciously guides navigation.Human navigation relies on inputs to our paired eyes and ears. Although we also have two nasal passages, there has been little empirical indication that internostril differences yield directionality in human olfaction without involving the trigeminal system. By using optic flow that captures the pattern of apparent motion of surface elements in a visual scene, we demonstrate through formal psychophysical testing that a moderate binaral concentration disparity of a nontrigeminal odorant consistently biases recipients’ perceived direction of self-motion toward the higher-concentration side, despite that they cannot verbalize which nostril smells a stronger odor. We further show that the effect depends on the internostril ratio of odor concentrations and not the numeric difference in concentration between the two nostrils. Taken together, our findings provide behavioral evidence that humans smell in stereo and subconsciously utilize stereo olfactory cues in spatial navigation.", "posttime": "2020-06-26 09:36:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "立体,navigate,导航", "title": "人类用立体嗅觉导航", "title_en": "Humans Navigate with Stereo Olfaction", "transed": 1, "url": "https://www.pnas.org/content/early/2020/06/17/2004642117", "via": "", "real_tags": ["立体", "navigate", "导航"]}, {"category": "", "categoryclass": "", "imagename": "efb9fc988104764d487cb1e8880168db.jpeg", "infoid": 1008334, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着官员们考虑采取措施解决警察的暴行和种族主义问题，加利福尼亚州的圣克鲁斯成为美国第一个禁止预测性警务的城市，数字权利专家表示，这可能会在全美范围内引发类似的行动。市长贾斯汀·卡明斯(Justin Cummings)周三表示，在理解预测性警务和面部识别如何对有色人种存在严重偏见之后，我们正式禁止在圣克鲁斯市使用这些技术。尽管他的政府将与警方合作，“帮助消除警务中的种族主义”，但市长贾斯汀·卡明斯(Justin Cummings)周三表示，我们已经正式禁止在圣克鲁斯市使用这些技术。他的政府将与警方合作，“帮助消除警务中的种族主义”，市长贾斯汀·卡明斯(Justin Cummings)周三表示。经过周二晚上的投票。美国各地的警方已经使用了近十年的预测性警务，它依靠算法来解读警方记录，分析逮捕或假释数据，派遣警察瞄准慢犯，或者识别可能发生犯罪的地方。但批评人士表示，它强化了种族主义的警务模式-低收入的少数族裔社区历史上一直被过度警戒，所以数据显示它们是犯罪热点，导致向这些地区部署更多警察。“正如圣克鲁斯正确认识到的那样，预测性警务是正确的。”美国公民自由联盟的一名律师。\n总部位于圣克鲁斯的PredPol公司是这项技术的先驱，该公司表示，它支持城市决议的要求，即预测性警务“不会使偏见永久化”，以及其他标准。\n“鉴于美国种族不平等的制度化状态，这是一个合法的过滤器，适用于公共实体获得的任何新技术，无论是否用于公共安全，”该公司周二在Twitter上表示。\n波士顿市议会周三投票禁止人脸监控技术，此举也受到数字维权人士的欢迎。", "note_en": "As officials mull steps to tackle police brutality and racism, California’s Santa Cruz has become the first U.S. city to ban predictive policing, which digital rights experts said could spark similar moves across the country.   “Understanding how predictive policing and facial recognition can be disportionately biased against people of color, we officially banned the use of these technologies in the city of Santa Cruz,” Mayor Justin Cummings said on Wednesday.   His administration will work with the police to “help eliminate racism in policing”, the seaside city’s first male African-American mayor said on his Facebook page, following a vote on Tuesday evening.   Used by police across the United States for almost a decade, predictive policing relies on algorithms to interpret police records, analyzing arrest or parole data to send officers to target chronic offenders, or identifying places where crime may occur.   But critics says it reinforces racist patterns of policing - low-income, ethnic minority neighbourhoods have historically been overpoliced so the data shows them as crime hotspots, leading to the deployment of more police to those areas.   “As Santa Cruz rightly recognized, predictive policing and facial recognition are dangerous, racially biased technologies that should never be used by our government,” said Matt Cagle, a lawyer with the ACLU.\n PredPol Inc, the Santa Cruz-headquartered firm that pioneered the technology, said that it supported the city resolution’s requirement that predictive policing “will not perpetuate bias”, among other criteria.\n “Given the institutionalized state of racial inequality in America, this is a legitimate filter to be applied to any new technology acquired by a public entity, whether used for public safety or not,” it said on Twitter on Tuesday.\n Boston’s city council on Wednesday voted to ban face surveillance technology, a move also welcomed by digital rights activists.", "posttime": "2020-06-26 09:17:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "禁止,cruz,表示", "title": "圣克鲁斯禁止预测性警务", "title_en": "Santa Cruz bans predictive policing", "transed": 1, "url": "https://www.santacruzworks.org/news/santa-cruz-is-the-first-city-to-city-ban-predictive-policing", "via": "", "real_tags": ["禁止", "cruz", "表示"]}]