[{"category": "", "categoryclass": "", "imagename": "f482424411f17843178f13b28e904eaa.jpg", "infoid": 1002862, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "推特不在办公室。上周，这家社交媒体公司的首席执行官杰克·多尔西(Jack Dorsey)通知员工，他们中的许多人将被允许永久在家工作，即使在冠状病毒大流行消退之后也是如此。包括谷歌和Facebook在内的其他科技巨头到目前为止还没有走得太远，但他们也表示，他们计划至少在2020年底之前继续远程工作。\n这可能是一个迹象，表明其他白领行业在工作场所的设计和文化方面受到硅谷的启发。对于一个靠颠覆而蓬勃发展的行业来说，这可能是它迄今最具颠覆性的举措。\n向远程工作的转变之所以如此引人注目，部分原因是科技行业长期以来一直在抵制它。从本世纪中叶的现代宫殿到今天的科技巨头嬉戏的校园，该行业在“知识工作”依赖于精心设计的办公环境这一理念上投入了大量资金。\n一些设施强调与世隔绝，比如新泽西州默里希尔的优雅校园，这是埃罗·萨里宁(Eero Saarinen)1962年为美国电话电报公司(AT&amp；T；)贝尔实验室(Bell Labs)设计的。北加州成立的科技公司采取了不同的策略，设计了更自由流动的办公室，模仿工程实验室的协作环境。这些办公室的布局鼓励了惠普创始人比尔·休利特(Bill Hewlett)和大卫·帕卡德(David Packard)所说的“走来走去的管理”。\n随着硅谷在20世纪80年代的发展，它的办公室往往是仓促建造的，令人自豪的丑陋的混凝土“倾斜”。但这些公司的领导人仍想让它们脱颖而出。Tandem Computers有一个现场游泳池，并举办每周一次的“啤酒半身像”活动。英特尔构建了慢跑路径。这些便利设施帮助招聘了员工，并向他们传达了一个信息：有这么好的办公室，你为什么还要回家呢？\n多亏了史蒂夫·乔布斯(Steve Jobs)，人们相信办公室里的偶然相遇会激发创造力，这种信念变成了福音。当他在2000年担任皮克斯(Pixar)首席执行官时，他领导了一座新总部大楼的设计，这座大楼将使人与人之间的互动最大化。在某个阶段，他为整个校园推荐了一组单独的卫生间。(仁慈的是，这个想法被摒弃了。)。\n其他的想法变得更有影响力了。随着谷歌在全球范围内的扩张，它寻找足迹较大的地点。在同一楼层有尽可能多的员工被认为会增加随机相遇的机会，因此应该避免楼梯。Facebook在门洛帕克的总部设计也遵循了同样的原则。\n随着最大的公司变得越来越富有，他们的设施也变得更加宏伟。亚马逊在其西雅图总部建造了球形温室，员工可以聚集在一起思考和交谈。微软在附近的雷德蒙德为员工建造了“树屋”。即使是IBM，在向咨询服务领域扩张时曾鼓励远程办公，在2010年代也吸引了数千人回到办公室，提供了以“休息室”和“创意停车场”为特色的设施。\n具有讽刺意味的是，正是在过去十年里-随着移动和基于云的产品使远程工作变得容易得多-公司投资于越来越奢华的办公室，并加倍承诺让员工在这些办公室工作，而不是远程工作。玛丽莎·梅耶尔(Marissa Mayer)在2012年在严格审查下接手雅虎领导权后，禁止远程办公，这是她就任硅谷新任首席执行官后的首批举措之一。该公司的人力资源总监告诉员工：“当我们在家工作时，速度和质量往往会被牺牲。”\n这些来自硅谷的想法-关于空间、邻近和公司文化-树立了其他行业效仿的步伐。免费的零食和乒乓球桌在各种白领工作场所变得司空见惯。开放式办公室--史蒂夫·乔布斯(Steve Jobs)对偶然相遇信念的终极表达--已经变得无处不在，尽管越来越多的证据表明，这种肆无忌惮的喧嚣阻碍了合作，而不是鼓励了合作。\n那么现在会发生什么呢？如果哪怕只有一小部分美国公司效仿Twitter，将在家工作常态化，其影响将波及许多其他行业，并波及所有科技公司拥有公司总部的城市。商业地产将受到影响，还有维持高科技校园运转的看门人、班车司机和保安。\n旧金山已经是最大的输家之一。2011年，该市为Twitter和其他公司提供了工资税减免，估计价值7000万美元，让它们位于一个苦苦挣扎的社区，结果发现员工很少冒险走出豪华的总部来支持当地的企业。“推特减税”于去年到期，但现在推特也消失了。\n同时，远程工作环境对员工来说可能是一个可喜的变化。硅谷和其他领先科技中心的生活变得如此昂贵，以至于难以为继，即使是那些工资达到六位数的人也是如此。科技公司无时无刻不在的工作场所和充斥着便利设施的办公室可能会吸引年轻人和无拘无束的人。但公司规范-不鼓励兼职工作和远程办公-导致了女性成为父母后的自然流失。\n技术领导者担心远程工作会损失什么，这是理所当然的。“倦怠是什么样子的？”微软首席执行官萨蒂亚·纳德拉(Satya Nadella)上周沉思了一下。“心理健康是什么样子的？这种连通性和社区建设是什么样子的？“。远程环境将需要不同的方法来指导、团队合作和培养共同的使命感。但冠状病毒实验表明，硅谷可以依靠它为自己和其他人创造的工具生存下来。\n玛格丽特·奥玛拉(Margaret O‘Mara)是华盛顿大学(University Of Washington)历史学教授，著有“密码：硅谷与美国的重塑”(The Code：Silicon Valley and the Remaging of America)一书。\n“泰晤士报”致力于向编辑发表各种信件。我们想听听您对这篇文章或我们的任何一篇文章的看法。这里有一些小贴士。这是我们的电子邮件：Letters@nytimes.com。", "note_en": "Twitter is out of the office. Last week, the social media company’s chief executive, Jack Dorsey, informed employees that many of them would be allowed to  work from home permanently, even after the Covid-19 pandemic subsides. Other tech giants, including  Google and Facebook, have not gone quite so far but have also said that they plan to continue working remotely at least through the end of 2020.\n This may be a sign of where things are headed for the other white-collar industries that take their cues from Silicon Valley in the design and culture of their workplaces. For an industry that thrives on disruption, this might be its most disruptive move yet.\n Part of what makes the move to remote work so remarkable is that the technology industry has resisted it for so long. From the midcentury-modern palaces to the playful campuses of today’s tech giants, the industry has invested heavily in the idea that “knowledge work” depends on carefully designed office environments.\n Some facilities emphasized cloistered isolation, such as the elegant campus in Murray Hill, N.J.,  that  Eero Saarinen designed for AT&amp;T’s Bell Labs in 1962. Tech companies founded in Northern California took a different tack, designing more free-flowing offices that mimicked the collaborative environment of the engineering lab. The layout of these offices encouraged what Bill Hewlett and David Packard, the founders of Hewlett-Packard, called  “management by walking around.”\n As Silicon Valley grew in the 1980s, its offices were often hastily constructed,  proudly ugly concrete “tilt-ups.” But leaders of those companies still wanted to set them apart. Tandem Computers had an on-site swimming pool and hosted weekly “beer busts.” Intel built jogging paths. These amenities helped recruit employees and delivered a message to them: With an office this great, why would you ever go home?\n  Thanks to Steve Jobs, the belief that serendipitous office encounters fueled creativity became gospel. When he was the chief executive of Pixar in 2000, he led a design for a new headquarters building that would maximize human interaction. At one stage, he recommended a single group of bathrooms for the entire campus. (That notion was mercifully dropped.)\n Other ideas became more influential. As Google expanded around the globe, it looked for locations with large footprints. Having as many employees as possible on the same floor was thought to increase  the chance of random encounters, so staircases were to be avoided.  Facebook designed its headquarters in Menlo Park along the same principle.\n  As the largest companies grew richer, their facilities become grander. Amazon created  spherical greenhouses at its Seattle headquarters where employees could gather to think and talk. Microsoft built “tree houses” for employees in nearby Redmond. Even IBM, which had once encouraged telecommuting as it expanded into consulting services,  pulled thousands back to the office in the 2010s with facilities featuring “huddle rooms” and “idea parking lots.”\n Ironically, it has been over the past decade — as mobile and cloud-based products made it far easier to work remotely — that companies invested in ever more lavish offices and doubled down on their commitment to having employees work in those offices, not remotely. After taking over the leadership of Yahoo in 2012 under intense scrutiny, Marissa Mayer banned telecommuting in one of her first moves as a new Silicon Valley chief executive. “Speed and quality are often  sacrificed when we work from home,” the company’s human resources director told employees.\n These ideas from Silicon Valley — about space, proximity and company culture — set a pace that other industries followed. Free snacks and Ping-Pong tables became common in all kinds of white-collar workplaces. The open office — the ultimate expression of Steve Jobs’s belief in serendipitous encounters — has become ubiquitous, despite mounting evidence that such unrestrained  hubbub dampens collaboration rather than encourages it.\n  So what will happen now? If even a fraction of American companies follow Twitter’s lead and make working from home permanent, the effects will ripple through many other sectors and into all the cities where tech companies have corporate homes. Commercial real estate will suffer, along with the janitors, shuttle drivers and security guards who keep high-tech campuses going.\n One of the biggest losers already is San Francisco. In 2011 the city gave Twitter and other companies a payroll-tax break worth  an estimated $70 million to locate in a struggling neighborhood, only to find that employees rarely ventured outside their luxurious headquarters to support the local businesses. The “Twitter tax break” expired last year, but now Twitter is gone as well.\n At the same time, a remote work environment could be a welcome change for employees. Life in Silicon Valley and other leading tech hubs was becoming so expensive as to be unsustainable, even for those earning six-figure salaries. Tech’s always-on, always-present workplaces and the offices filled with amenities may have appealed to the young and untethered. But the corporate norms — which discouraged part-time work and telecommuting — contributed to the attrition of women after becoming parents.\n Tech leaders rightly worry about what will be lost when working remotely. “ What does burnout look like?” the chief executive of Microsoft, Satya Nadella, mused last week. “What does mental health look like? What does that connectivity and the community building look like?” Remote environments will demand different approaches to mentorship, teamwork and fostering a shared sense of purpose. But the Covid-19 experiment has shown that Silicon Valley can survive on the tools it created for itself and others.\n Margaret O’Mara ( @margaretomara) is a professor of history at the University of Washington and the author of  “The Code: Silicon Valley and the Remaking of America.”\n The Times is committed to publishing   a diversity of letters  to the editor. We’d like to hear what you think about this or any of our articles. Here are some   tips . And here’s our email:   letters@nytimes.com .", "posttime": "2020-05-20 03:54:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,所知,twitter", "title": "推特可能会终结我们所知的办公室", "title_en": "Twitter Could End the Office as We Know It", "transed": 1, "url": "https://www.nytimes.com/2020/05/19/opinion/twitter-work-from-home.html", "via": "", "real_tags": ["推特", "所知", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "aa76dc007ff73a3c4e6df70304f5297f.jpg", "infoid": 1002861, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Algolia正在构建一个搜索引擎API。该公司不想打造下一个谷歌。相反，它希望为你的网站或应用程序上的搜索框提供即时的逐个字母搜索结果。\n该公司正在管理松弛、条纹、Under Armour、Twitch和其他9000家公司的搜索功能。按照目前的运行速度，Algolia每年处理1.2万亿次搜索。该公司表示，它每天接触的网民比例为六分之一。\nDessaigne告诉我：“故事开始于C系列赛之后。”Algolia在2019年底筹集了1.1亿美元的C系列融资。“我非常兴奋，但对我来说最令人兴奋的是公司的潜力。”\n“拥有更多市场经验的人可能更善于实现这一潜力，”他继续说。\n我更直接地问，接替他担任首席执行官的决定是否来自公司董事会。“这真的是从我这边开始的。董事会支持这一决定，但这不是他们的决定，“他说。\n尼克松之前是Alfresh co的首席执行官，该公司开发了一家开源企业内容管理初创公司，于2018年被私募股权公司Thomas H.Lee Partners收购。过去，她曾在不同的软件公司担任过各种职位，包括首席营收官、销售执行副总裁和企业销售高级副总裁。\n如你所见，尼克松在销售和运营方面总体上有丰富的经验。在扩大创业规模方面，她的经验将是很有价值的。\n尼克松告诉我：“我很高兴现在成为Algolia团队的一员，并从今天起领导公司。”领导阿尔戈利亚C轮融资的风险投资公司Accel也是Alfresh co的投资者。\n过渡将需要几个月的时间，Dessaigne将坚持到7月份。他说他对下一步要做什么没有任何具体的计划。\n在过去的一年里，Algolia一直在增加高管招聘。让-路易斯·巴菲尔(Jean-Louis Baffier)担任首席营收官，阿什利·斯特鲁普(Ashley Stirrup)担任首席营销官，克里斯蒂·罗登布什(Kristie RodenBush)担任首席人事官，伊恩·哈索尔(Iain Hassall。换句话说，Algolia正在成长，并为下一阶段做准备。现在，让我们看看这是否会导致IPO或被更大的参与者收购。", "note_en": "Algolia   is building a search engine API. The company doesn’t want to build the next Google. Instead, it wants to power the search box on your website or app with instant letter-by-letter search results.\n The company is managing the search feature on Slack, Stripe, Under Armour, Twitch and 9,000 other companies. At its current run rate, Algolia processes 1.2 trillion searches a year. The company says it touches 1 in 6 web users each day.\n  “The story started right after the Series C,” Dessaigne told me. Algolia raised  a $110 million Series C round at the end of 2019. “I was super excited but what was most exciting for me was the potential of the company.”\n “Someone with more go-to-market experience would probably be a better person at achieving that potential,” he continued.\n I asked more directly whether the decision to replace him as CEO came from the board of the company or not. “It really started on my side. The board was supportive of the decision but it didn’t come from them,” he said.\n  Nixon was previously the CEO of  Alfresco, the company that developed an open source enterprise content-management startup that was acquired by private equity firm Thomas H. Lee Partners  in 2018. In the past, she held various positions as chief revenue officer, executive vice president of sales and senior vice president of corporate sales in different software companies.\n As you can see, Nixon has a ton of experience when it comes to sales and operations in general. Her experience will be valuable when it comes to scaling the startup.\n “I’m excited to be now part of the Algolia team and to be leading the company as of today,” Nixon told me. Accel, the VC firm that led the Series C round in Algolia, was also an investor in Alfresco.\n The transition is going to take a couple of months and Dessaigne will stick around until July. He says that he doesn’t have any concrete plan about what he’s going to do next.\n Over the past year, Algolia has been ramping up executive hires. Jean-Louis Baffier joined as chief revenue officer, Ashley Stirrup joined as chief marketing officer, Kristie Rodenbush joined as chief people officer and Iain Hassall joined as chief financial officer. In other words, Algolia is growing up and preparing for the next phase. Now let’s see if it leads to an IPO or an acquisition by a bigger player.", "posttime": "2020-05-20 03:54:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "创始人,ceo", "title": "Algolia创始人下台，新CEO上任", "title_en": "Algolia gets a new CEO as founder steps down", "transed": 1, "url": "https://techcrunch.com/2020/05/19/algolia-gets-a-new-ceo-as-founder-steps-down/", "via": "", "real_tags": ["创始人", "ceo"]}, {"category": "", "categoryclass": "", "imagename": "0fbbad8e1c06d7265ec2740451ce1254.jpg", "infoid": 1002860, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“体验”是播客播出时间最长、最受欢迎的节目之一，将于今年独家上线。\n这部由罗根主持的喜剧脱口秀系列将于9月9日在Spotify首播。1,2020，在非独家的基础上-在2020年晚些时候根据多年许可协议成为该平台的独家。\n与罗根合作，Spotify获得了播客行业的一头鲸鱼。根据Podcast Insight，它目前在苹果播客上排名第二(仅次于Barstool Sports的“叫她爸爸”)。一位熟悉这笔交易的消息人士称，罗根最初拒绝在Spotify平台上分发播客，因为他认为Spotify主要是一项音乐服务，因此对Spotify在全球建立受众的能力很感兴趣。\n除了播客，JRE还制作了相应的视频集，这些视频集也将在Spotify上以应用内“Vodcast”的形式提供。\n罗根周二在社交媒体上宣布了这笔交易，吹捧Spotify是“世界上最大的音频平台”。\n“播客要转到@Spotify了！”他在Instagram上写道。“它将保持免费，它将是完全相同的节目。这只是一项授权协议，因此Spotify不会对该节目进行任何创意控制。他们想让我继续做我现在做的事情。“。\n罗根说，仍然会有该节目的片段分享到YouTube上，“但完整版的节目只有在今年年底之后才会在Spotify上发布。我很高兴能得到世界上最大的音频平台的支持，我希望当我们进行转换时，你们能在场！“。\n自2009年开播以来，“The”已经建立了一个庞大、忠诚和投入的粉丝基础，可以收听他与一系列嘉宾的讨论，这些嘉宾包括喜剧演员、演员、音乐家、MMA拳击手、作家、艺术家等等。\n根据与Spotify的分销协议，“乔·罗根体验”(The Joe Rogan Experience)将向Spotify的2.86亿活跃月度用户免费提供广告(不含针对付费订户的广告)。根据Spotify的数据，“乔·罗根经历”(The Joe Rogan Experience)长期以来一直是其服务上搜索量最高的播客。“JRE”的加入将加速Spotify的远程播客雄心，其中包括收购Gimlet Media，比尔·西蒙斯(Bill Simmons)的“铃声与主播”(The Ringer And Anchor)。\n罗根是一名脱口秀喜剧演员，此前最出名的是在21世纪初主持NBC真人秀节目“恐惧因素”(2011-12年他重演了这档节目)。这位土生土长的波士顿人还出现在NBC情景喜剧“新闻广播”(NewsRadio)中。目前，他在Netflix上有两个单口相声节目：2018年的“奇异时报”(Strange Times)和2016年的“触发式”(TRIGGED)。\n罗根的代表是杰夫·苏斯曼管理公司的钱德拉·凯斯和杰夫·苏斯曼，四级商业管理公司的马特·利希滕伯格，以及施雷克·罗斯·达佩罗·亚当斯·柏林和邓纳姆律师事务所的塞斯·霍维茨。", "note_en": "“The   Experience,” one of podcasting’s longest-running and most popular shows, will be launching on   exclusively this year.\n The Rogan-hosted comedy talk-show series will debut on Spotify on Sept. 1, 2020, on a nonexclusive basis — before becoming exclusive to the platform later later in 2020 under the multiyear licensing deal.\n With Rogan, Spotify has landed one of the podcasting biz’s whales. It currently ranks as the No. 2 most popular show on Apple Podcasts (after Barstool Sports’ “Call Her Daddy”), per Podcast Insights. A source familiar with the deal said Rogan became sold on Spotify’s ability to build his audience worldwide, after initially resisting distributing the podcast on the platform because he saw it as primarily a music service.\n In addition to the podcast, JRE also produces corresponding video episodes, which will also be available on Spotify as in-app “vodcasts.”\n Rogan announced the deal on social media Tuesday,  touting Spotify as “the largest audio platform in the world.”\n  “The podcast is moving to @spotify!” he wrote on  Instagram. “It will remain FREE, and it will be the exact same show. It’s just a licensing deal, so Spotify won’t have any creative control over the show. They want me to just continue doing it the way I’m doing it right now.”\n Rogan said there will still be clips from the show shared on YouTube “but full versions of the show will only be on Spotify after the end of the year. I’m excited to have the support of the largest audio platform in the world and I hope you folks are there when we make the switch!”\n Since its launch in 2009, “The  ” has built a large, loyal and engaged fanbase tuning in to hear his discussions with a range of guests, including comedians, actors, musicians, MMA fighters, authors, artists and more.\n Under the distribution deal with Spotify, “The Joe Rogan Experience” will be available to Spotify’s 286 million active monthly users free with ads (and without ads for premium subscribers). According to Spotify, “The Joe Rogan Experience” has long been the most-searched-for podcast on its service. The addition of “JRE” stands to accelerate Spotify’s long-range podcast ambitions, which has included  acquisitions of Gimlet Media,  Bill Simmons’ The Ringer and Anchor.\n Rogan, a stand-up comedian and actor, was previously best known for hosting NBC reality competition show “Fear Factor” in the early 2000s (which he reprised in 2011-12). The Boston native also appeared in NBC sitcom “NewsRadio.” Currently, he has two stand-up specials on Netflix: 2018’s “Strange Times” and 2016’s “Triggered.”\n Rogan is repped by Chandra Keyes and Jeff Sussman at Jeff Sussman Management, Matt Lichtenberg at Level Four Business Management, and attorney Seth Horwitz at Schreck Rose Dapello Adams Berlin &amp; Dunham.", "posttime": "2020-05-20 03:40:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "播客,rogan,spotify", "title": "乔·罗根(Joe Rogan)正在将他的播客(Podcast)--世界上最受欢迎的播客之一--独家转移到Spotify", "title_en": "Joe Rogan is Moving His Podcast, One of the World's Most Popular Podcasts, Exclusively To Spotify", "transed": 1, "url": "https://variety.com/2020/digital/news/joe-rogan-experience-spotify-podcast-exclusive-1234610885/", "via": "", "real_tags": ["播客", "rogan", "spotify"]}, {"category": "", "categoryclass": "", "imagename": "a04b46e0c67259a2500417f063b68970.jpg", "infoid": 1002859, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几千年前，人们正在进行一种名为“钻孔”的手术，这种手术是在人的头骨上钻孔。\n在人类史前的很大一部分时间里，世界各地的人们都在练习钻孔：一种粗糙的外科手术，通过用锋利的工具钻、切或刮掉一层层的骨头，在活人的头骨上形成一个洞。\n到目前为止，在世界各地的考古遗址已经出土了数千具带有钻孔迹象的头骨。\n但是，尽管它看起来很重要，科学家们对于我们的祖先为什么要进行钻孔仍然没有完全达成一致。\n对20世纪非洲和波利尼西亚钻孔的人类学描述表明，至少在这些情况下，钻孔是为了治疗疼痛-例如，头骨创伤或神经疾病造成的疼痛。\n在史前时期，钻孔可能也有类似的目的。许多钻孔的头骨显示出颅骨损伤或神经疾病的迹象，通常位于颅骨上钻孔的同一区域。\n但是，除了被用来治疗疾病外，研究人员长期以来一直怀疑古人类进行钻孔有一个完全不同的原因：仪式。\n最早的明确证据可以追溯到大约7000年前。它在古希腊、北美和南美、非洲、波利尼西亚和远东等不同的地方都有实践。人们可能在几个地方独立地发展了这种做法。\n到中世纪末，大多数文化已经放弃了钻孔，但直到20世纪初，这种做法仍在非洲和波利尼西亚的少数与世隔绝的地区进行。\n自从19世纪第一批关于钻孔的科学研究发表以来，学者们一直在争辩说，古人类有时会进行钻孔，以允许灵魂进出身体，或者作为入会仪式的一部分。\n然而，令人信服的证据很难获得。几乎不可能完全排除由于医学原因进行钻孔的可能性，因为有些大脑状况在头骨上没有留下任何痕迹。\n然而，在俄罗斯的一个小角落里，考古学家发现了一些迄今发现的仪式惊恐的最好证据。\n故事开始于1997年。考古学家正在挖掘靠近俄罗斯南部顿河畔罗斯托夫市的一个史前墓地，靠近黑海的北部。\n该遗址有35具人类的骨骼遗骸，分布在20个不同的坟墓中。根据墓葬的风格，考古学家知道它们的年代大约在公元前5000到3000年之间，这一时期被称为胆石时代或铜器时代。\n其中一个坟墓里有五个成年人的骨骼-两个女人和三个男人-还有一个一到两岁的婴儿和一个十几岁的女孩。\n在同一个史前墓穴中发现多具骨骼并不是特别罕见。但他们的头骨所做的是：两个女人，两个男人和那个十几岁的女孩都被钻了个耳洞。\n他们的每个头骨都有一个洞，几厘米宽，形状大致为椭圆形，边缘有擦伤的迹象。第三名男子的头骨上有一个凹陷，也显示有雕刻的证据，但不是真正的洞。只有婴儿的头骨完好无损。\n分析坟墓内容物的工作落到了埃琳娜·巴蒂耶娃(Elena Batieva)身上，她是一名人类学家，现供职于俄罗斯顿河畔罗斯托夫的南方联邦大学(Southern Federal University)。她立刻认出这些洞是钻孔，她很快就意识到这些钻孔是不寻常的。\n它们都是在几乎完全相同的位置制作的：头骨上的一个点，叫做方尖碑。方尖碑位于头骨顶部，朝向后方，大致就是可能聚集高马尾辫的地方。\n在所有有记录的钻孔中，只有不到1%位于方尖点以上。更重要的是，巴蒂耶娃知道这样的颤音在古代俄罗斯更不常见。据她当时所知，只有另一个有记录的方尖碑钻孔案例：1974年在离她正在挖掘的考古遗址非常近的一个考古地点出土的一个头骨。\n显然，即使只发现一个方尖石钻孔也是值得注意的。但巴蒂耶娃看到的是五个人，他们都埋在同一个坟墓里。这曾经是，现在也是史无前例的。\n方尖点位于上矢状窦的正上方，血液从大脑汇聚到那里，然后流入大脑的主要流出静脉。在这个位置打开头骨可能会有大出血和死亡的风险。\n这表明，俄罗斯铜器时代的居民一定有很好的理由进行这样的钻孔手术。然而，在钻孔之前或之后，没有一个头骨显示出任何受伤或疾病的迹象。\n换句话说，似乎所有这些人在完全健康的时候都被打了耳环。他们的钻孔是某种仪式的证据吗？\n这是一种耐人寻味的可能性。然而，巴蒂耶娃不得不放弃了这条路。她有更多来自俄罗斯南部各地的骷髅需要分析，她不能因为几个头骨而分心，不管这些头骨多么神秘。\n在她放弃之前，巴蒂耶娃决定搜索俄罗斯未出版的考古记录，以防发现更多奇怪的方尖碑，但没有报道。\n令人惊讶的是，她得到了两个匹配。早在几年前就有两名年轻女性的头骨被发现，其中一名是在1980年，另一名是在1992年。每一个都是在距离顿河畔罗斯托夫不到31英里(50公里)的地方出土的，没有任何迹象表明他们是因为医学原因而被钻孔的。\n这给了巴蒂耶娃总共八个不同寻常的头骨，所有这些头骨都聚集在俄罗斯南部的一个小区域，可能所有人的年龄都差不多。十年后，更多的问题浮出水面。\n2011年，一个国际考古学家团队正在分析137具人类骨骼。它们最近是在顿河畔罗斯托夫东南约310英里(500公里)的三个单独的铜器时代埋葬地点被挖掘出来的，位于俄罗斯斯塔夫罗波尔Krai地区，靠近现代与格鲁吉亚的边界。\n考古学家们还没有开始去发现钻孔。他们去那里是为了了解该地区史前居民的总体健康状况。但在137个头骨中，他们发现有9个有明显的洞。\n其中5例是钻孔的标准例子。这些洞是在头骨正面和侧面周围的不同位置打出的，所有的头骨都显示出遭受过身体创伤的迹象，这表明钻孔是为了治疗伤害的影响而进行的。\n但其他四个钻孔的头骨都没有显示出任何损伤或疾病的迹象。更重要的是，所有四个人都被钉在方尖点的正上方。\n非常偶然的是，其中一位研究人员--德国考古研究所(DAI)的人类学家朱莉娅·格雷斯基(Julia Gresky)--已经阅读了巴蒂耶娃的论文，该论文描述了顿河畔罗斯托夫地区的不同寻常的恐慌。\n现在，格雷斯基、巴蒂耶娃和其他考古学家已经联手描述了来自俄罗斯南部的所有12个方尖碑。他们的研究发表在2016年4月的“美国物理人类学杂志”上。\n这12个头骨无论在哪里被发现，都会是一项了不起的发现。但事实是，他们都是在俄罗斯的同一个小角落被发现的，这意味着似乎有可能存在联系。如果没有联系，一批这种罕见的钻孔只出现在俄罗斯南部的可能性会非常低。\n格雷斯基、巴特瓦和他们的同事认为，虽然这一观点很难证明，但这些不寻常的颤音的聚集表明，俄罗斯南部可能是仪式颤音的中心。\n莫斯科俄罗斯科学院的玛丽亚·梅德尼科娃(Maria Mednikova)是俄罗斯颤音方面的专家。她认为，在特定的、危险的颅骨区域进行钻孔可能是为了实现某种形式的转变。她建议，通过在这些地方钻探，人们认为他们可以获得普通社会成员没有的独特技能。\n我们只能推测，为何这12名表面上健康的人会以如此不寻常和危险的方式被套牢。但多亏了钻孔本身，我们可以推断出人们在接受钻孔后的命运，这一点令人惊讶。\n12个头骨中有一个属于一名25岁以下的妇女，她被埋葬在顿河畔罗斯托夫附近的一个地点。没有愈合的迹象，这表明她是在钻孔期间或之后不久死亡的。\n然而，其他头骨的主人似乎在手术中幸存了下来。他们的头骨显示出钻孔边缘的骨头正在愈合-尽管骨头从未完全在钻孔上重新生长。\n12个头骨中有3个在钻孔周围只有轻微愈合的迹象，这表明它们的主人在手术后只存活了两到八周。这些人中有两人是年龄在20岁到35岁之间的女性。第三名是一名年龄在50岁到70岁之间的老人，性别无法确定。\n其他八个头骨显示出更高级的愈合。根据我们今天对骨骼愈合的了解，这些人在手术后可能至少存活了四年。\n似乎所有这些人都是在完全健康的时候被钻孔的。\n这8名幸存者包括顿河畔罗斯托夫附近集体墓地里的所有5个人，大约20年前，他们奇特的钻孔头骨首次引起了巴蒂耶娃的注意。\n这两名男子、两名女子和一名少女都带着他们的方尖孔存活了多年。根据她的骨骼，这名女孩的年龄在14到16岁之间，她肯定是在不到12岁的时候被钻孔的，而且可能要年轻得多。\n这12个人仍然有可能患有疾病或头部受伤。在这种情况下，钻孔手术可能至少对其中八人有效。\n但也有可能巴蒂耶娃和她的同事是对的，这些人是出于仪式目的而被挖孔的。如果这是真的，我们只能猜测他们在余生中获得了什么福利-或者说相信他们已经获得了什么福利。\n在Facebook上为我们点赞，或者在Twitter和Instagram上关注我们，就可以加入500多万BBC地球粉丝的行列。\n如果你喜欢这个故事，如果你这周只读了6件事，那就注册bbc.com每周一次的专题时事通讯，名为#34；。精选BBC“未来”、“地球”、“文化”、“资本”、“旅行”和“汽车”中的故事，每周五送到您的收件箱。", "note_en": "Thousands of years ago, people were performing a form of surgery called &#34;trepanation&#34; that involves boring holes through a person&#39;s skull\n        For a large part of human prehistory, people around the world practised trepanation: a crude surgical procedure that involves forming a hole in the skull of a living person by either drilling, cutting or scraping away layers of bone with a sharp implement.\n To date, thousands of skulls bearing signs of trepanation have been unearthed at archaeological sites across the world.\n But despite its apparent importance, scientists are still not completely agreed on why our ancestors performed trepanation.\n Anthropological accounts of 20th-Century trepanations in Africa and Polynesia suggest that, in these cases at least, trepanation was performed to treat pain – for instance, the pain caused by skull trauma or neurological disease.\n Trepanation may also have had a similar purpose in prehistory. Many trepanned skulls show signs of cranial injuries or neurological diseases, often in the same region of the skull where the trepanation hole was made.\n But as well as being used to treat medical conditions, researchers have long suspected that ancient humans performed trepanation for a quite different reason: ritual.\n  The earliest clear evidence of trepanation dates to approximately 7,000 years ago. It was practised in places as diverse as Ancient Greece, North and South America, Africa, Polynesia and the Far East. People probably developed the practice independently in several locations.\n  Trepanation had been abandoned by most cultures by the end of the Middle Ages, but the practice was still being carried out in a few isolated parts of Africa and Polynesia until the early 1900s.\n Since the very first scientific studies on trepanation were published in the 19th Century, scholars have continued to argue that ancient humans sometimes performed trepanation to allow the passage of spirits into or out of the body, or as part of an initiation rite.\n However, convincing evidence is hard to come by. It is almost impossible to completely rule out the possibility that a trepanation was carried out for medical reasons, because some brain conditions leave no trace on the skull.\n However, in a small corner of Russia archaeologists have turned up some of the best evidence for ritual trepanation ever discovered.\n  The story begins in 1997. Archaeologists were excavating a prehistoric burial site close to the city of Rostov-on-Don in the far south of Russia, near the northern reaches of the Black Sea.\n The site contained the skeletal remains of 35 humans, distributed among 20 separate graves. Based on the style of the burials, the archaeologists knew that they dated to between approximately 5,000 and 3,000 BC, a period known as the Chalcolithic or &#34;Copper Age&#34;.\n  One of the graves contained the skeletons of five adults – two women and three men – together with an infant aged between one and two years, and a girl in her mid-teens.\n Finding multiple skeletons in the same prehistoric grave is not particularly unusual. But what had been done to their skulls was: the two women, two of the men and the teenage girl had all been trepanned.\n Each of their skulls contained a single hole, several centimetres wide and roughly ellipsoidal in shape, with signs of scraping around the edges. The skull of the third man contained a depression which also showed evidence of having been carved, but not an actual hole. Only the infant&#39;s skull was unblemished.\n The job of analysing the contents of the grave fell to  Elena Batieva, an anthropologist now at the Southern Federal University in Rostov-on-Don, Russia. She immediately recognised the holes as trepanations, and she soon realised that these trepanations were unusual.\n  They had all been made in almost exactly the same location: a point on the skull called the &#34;obelion&#34;. The obelion is on the top of the skull and towards the rear, roughly where a high ponytail might be gathered.\n  Less than 1% of all recorded trepanations are located above the obelion point. What&#39;s more, Batieva knew that such trepanations were even less common in ancient Russia. As far as she was aware at the time, there was just one other recorded case of an obelion trepanation: a skull unearthed in 1974 at an archaeological site remarkably close to the one she was excavating.\n Clearly, finding even one obelion trepanation is remarkable. But Batieva was looking at five, all of them buried in the same grave. This was, and is, unprecedented.\n   The obelion point is located directly above the superior sagittal sinus, where blood from the brain collects before flowing into the brain&#39;s main outgoing veins. Opening the skull in this location would have risked major haemorrhage and death.\n This suggests the Copper Age inhabitants of Russia must have had good reason to perform such trepanation procedures. Yet none of the skulls showed any signs of having suffered any injury or illness, before or after the trepanation had been performed.\n  In other words, it appeared as if all of these people were trepanned while they were completely healthy. Was their trepanation evidence of some sort of ritual?\n It was an intriguing possibility. However, Batieva had to give up the trail. She had many more skeletons to analyse from all over southern Russia, and could not afford to get sidetracked by just a few skulls, however enigmatic.\n Before she gave up, Batieva decided to search through Russia&#39;s unpublished archaeological records, in case any more strange obelion trepanations had been discovered but not reported.\n Surprisingly, she got two hits. The skulls of two young women with obelion trepanations had been discovered years earlier: one in 1980 and another in 1992. Each one had been unearthed less than 31 miles (50km) from Rostov-on-Don, and neither showed any signs of having been trepanned for a medical reason.\n This gave Batieva a grand total of eight unusual skulls, all clustered in a small region of southern Russia and potentially all of about the same age. A decade later, even more came to light.\n  In 2011, an international team of archaeologists was analysing 137 human skeletons. They had recently been excavated from three separate Copper Age burial sites around 310 miles (500km) south-east of Rostov-on-Don, in the Stavropol Krai region of Russia, close to the modern-day border with Georgia.\n The archaeologists had not set out to discover trepanations. They were there to learn about the general health of the prehistoric inhabitants of the region. But among the 137 skulls, they found nine with conspicuous holes.\n  Five of them were standard examples of trepanation. The holes had been made in a variety of different locations around the front and side of the skull, and all of the skulls showed signs of having suffered a physical trauma, suggesting that the trepanations had been performed to treat the effects of the injuries.\n But none of the other four trepanned skulls showed any signs of damage or disease. What&#39;s more, all four had been trepanned exactly above the obelion point.\n Quite by chance one of the researchers –  Julia Gresky, an anthropologist at the German Archaeological Institute (DAI) – had already read Batieva&#39;s paper describing the unusual trepanations from the Rostov-on-Don region.\n Now Gresky, Batieva and other archaeologists have teamed up to describe all 12 of the obelion trepanations from Southern Russia.  Their study was published in April 2016 in the  American Journal of Physical Anthropology.\n  The 12 skulls would have been remarkable discoveries wherever they had been found. But the fact that they were all discovered in the same tiny corner of Russia meant that a connection seemed likely. If there was no link, the odds that a batch of such rare trepanations would turn up exclusively in southern Russia would have been exceedingly low.\n Gresky, Bateiva and their colleagues argue that, while this idea is difficult to prove, the clustering of these unusual trepanations suggests that southern Russia may have been a centre for ritual trepanation.\n  Maria Mednikova of the Russian Academy of Sciences in Moscow is an expert on Russian trepanation. She believes that trepanations in specific, dangerous areas of the cranium may have been performed to achieve &#34;transformations&#34; of some kind. She suggests that, by trepanning in these places, people thought they could acquire unique skills that ordinary members of society did not have.\n We can only speculate as to why these 12 apparently healthy people were trepanned in such an unusual and dangerous way. But thanks to the trepanation holes themselves, we can infer a surprising amount about the fate of the people after they received their trepanation.\n One of the 12 skulls belonged to a woman under the age of 25, who had been buried at one of the sites near Rostov-on-Don. It showed no signs of healing, suggesting that she died during her trepanation or shortly afterwards.\n However, the owners of the other skulls seem to have survived their operations. Their skulls showed bone healing around the edges of the trepanation holes – although the bone never completely re-grew over the holes.\n  Three of the 12 skulls showed only slight signs of healing around the trepanation hole, suggesting that their owners only survived between two and eight weeks after the operation. Two of these individuals were women between 20 and 35 years of age. The third was an elderly person between 50 and 70 years old, whose sex could not be determined.\n The other eight skulls showed more advanced healing. Based on what we know about bone healing today, these individuals probably survived for at least four years after their operations.\n It appeared as if all of these people were trepanned while they were completely healthy\n These eight survivors included all five of the people from the mass grave near Rostov-on-Don, whose bizarrely-trepanned skulls first attracted Batieva&#39;s attention almost 20 years ago.\n The two men, two women and one adolescent girl had all survived with their obelion holes for years. The girl, who based on her skeleton was between 14 and 16 years old, must have been trepanned when she was no older than 12, and possibly much younger.\n It is still possible that these 12 people were suffering from diseases or head injuries. In that case, the trepanning operation may have worked for at least eight of them.\n But it is also possible that Batieva and her colleagues are right, and these people were trepanned for a ritual purpose. If that is true, we can only guess at what benefits they received – or believed they had received – throughout the rest of their lives.\n Join over five million BBC Earth fans by liking us on  Facebook, or follow us on  Twitter and  Instagram.\n If you liked this story,  sign up for the weekly bbc.com features newsletter called &#34;If You Only Read 6 Things This Week&#34;. A handpicked selection of stories from BBC Future, Earth, Culture, Capital, Travel and Autos, delivered to your inbox every Friday.", "posttime": "2020-05-20 03:38:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "祖先,drilled,钻孔", "title": "我们的祖先为什么要在彼此的头骨上钻孔(2016)", "title_en": "Why our ancestors drilled holes in each other's skulls (2016)", "transed": 1, "url": "http://www.bbc.com/earth/story/20160826-why-our-ancestors-drilled-holes-in-each-others-skulls", "via": "", "real_tags": ["祖先", "drilled", "钻孔"]}, {"category": "", "categoryclass": "", "imagename": "62100ef786fb909acd07f127c8fc8dfc.jpg", "infoid": 1002858, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国联邦检察官正在寻求将Hobby Lobby艺术和手工艺品连锁店购买的一块大约有3500年历史的泥板送回伊拉克，以便在华盛顿特区的圣经博物馆展出。在周一提交的一份民事诉状中，这块楔形石碑被描述为被盗的伊拉克财产。\n起诉书详细描述了这段已知最古老的创世故事的部分旅程-从古代美索不达米亚的宫殿图书馆到现在位于纽约皇后区国土安全部仓库的位置。\n它声称，一家在起诉书中未透露姓名的大型国际拍卖行在2014年将这款平板电脑出售给霍比·洛比(Hobby Lobby)时，掩盖了这款平板电脑的来源，这款平板电脑被称为Gilgamesh Dream平板电脑。\n美国移民和海关执法局国土安全调查局的特工去年从圣经博物馆查获了这块石碑，并称该博物馆配合了调查。业余爱好大厅的所有者是圣经博物馆的创建者。\n检察官表示，霍比·洛比(Hobby Lobby)花了160多万美元买下的这块5x6英寸的平板电脑被认为是伊拉克政府的财产，应该归还。\n纽约东区联邦检察官理查德·多诺霍(Richard Donoghue)在一份声明中表示，无论何时在这个国家发现被掠夺的文化财产，美国政府都会尽其所能保护遗产，将这些文物送回应有的地方。在这种情况下，一家大型拍卖行未能履行其义务，因为它最大限度地减少了对一件重要伊拉克文物的出处是捏造的担忧，并向买家隐瞒了破坏出处可靠性的信息。\n吉尔伽美什史诗是一首苏美尔诗，据信写于至少4000年前。它的一些部分反映了“旧约”中大洪水和伊甸园故事的细节，这要早于“旧约”。在今天伊拉克摩苏尔尼尼微宫殿的图书馆废墟中发现了这首用阿卡迪亚语写成的12块碑文版的诗歌。\n吉尔伽美什梦牌讲述了这位英雄向他的母亲描述他的梦，他的母亲说他们预测了一位新朋友的到来。你会看到他，你的心会笑，她告诉他。\n起诉书称，这块石碑是在2001年或之前浮出水面的，当时一位未透露姓名的美国古董商检查了它，与其他物品一起摆放在一位已知直接从中东购买的约旦古董商伦敦公寓的地板上。两年后，这位美国商人带着一位楔形文字的专家回来了，这位专家断定，尽管盐渍让人很难阅读，但这块石碑很可能是一件古代文献-潜在的稀有和有价值的-而不是一份更常见的商业和法律文件。\n它在2007年重新浮出水面，当时它被卖给了另外两名买家，其中一人将其列入销售目录，声称这款平板电脑在过去25年里一直与一个美国所有者在一起。目录上的要价是45万美元。根据美国的起诉书，它附带了一封虚假的出处信，声称它是在1981年旧金山的一次拍卖会上用一盒青铜碎片获得的。\n起诉书称，2013年，这款平板电脑的新主人联系了这家国际拍卖行的伦敦办事处，希望将其出售。但这位美国文物交易商告诉拍卖行文物部门负责人，这件物品的出处经不起审查，也不适合公开拍卖。\n第二年，Hobby Lobby在伦敦的一位Hobby Lobby代表看了这款平板电脑后，在一次私人拍卖会上买下了这款平板电脑。根据检察官的说法，拍卖行将平板电脑运到其纽约办事处，然后从那里用手把它带到霍比位于俄克拉何马城的总部，这样霍比就可以避免在纽约招致销售税。\n2017年，Hobby Lobby因未能进行尽职调查而被罚款300万美元，此前联邦当局表示，该公司购买了数千件从伊拉克走私出来的文物。圣经博物馆展出的一些物品是从以前不为人知的考古遗址抢走的。\n在3月份的一份声明中，博物馆董事会主席史蒂夫·格林(Steve Green)表示，博物馆已经确认了另外5000份纸莎草纸碎片和6500件来源不足的粘土物品，这些碎片将被送回埃及和伊拉克。\n在2017年与联邦当局达成的和解协议中，格林承诺博物馆将行使更多监督。同年晚些时候，圣经博物馆联系了拍卖行，以核实关于吉尔伽美什石碑来源的信息。美国检察官说，拍卖行隐瞒了信息。\n伊拉克文物部告诉NPR，他们正在试图确定吉尔伽美什石碑是否是1991年从其一个地区博物馆被盗的数千件物品中的一件。前一年萨达姆·侯赛因入侵科威特后，该政权失去了对伊拉克某些地区的控制。该国13家地区性博物馆中至少有9家在骚乱中遭到洗劫。", "note_en": "U.S. federal prosecutors are seeking the return to Iraq of a roughly 3,500-year-old clay tablet purchased by the Hobby Lobby arts and crafts store chain for display in the Washington, D.C.-based Museum of the Bible. The cuneiform tablet is described as &#34;stolen Iraqi property&#34; in a civil complaint filed Monday.\n  The  complaint details part of the journey of this fragment of the oldest known creation tale — from a palace library in ancient Mesopotamia to its present location in a Department of Homeland Security warehouse in Queens, New York.\n  It alleges that a major international auction house, unnamed in the complaint, obscured the provenance of the tablet, known as the Gilgamesh Dream Tablet, when it sold the tablet to Hobby Lobby in 2014.\n  Agents from U.S. Immigration and Customs Enforcement&#39;s Homeland Security Investigations seized the tablet last year from the Museum of the Bible, which, it said, cooperated with the investigation. Hobby Lobby&#39;s owners are the founders of the Museum of the Bible.\n  The prosecutors said the 5-by-6-inch tablet, which Hobby Lobby purchased for more than $1.6 million, is considered the property of the Iraqi government and should be returned.\n    &#34;Whenever looted cultural property is found in this country, the United States government will do all it can to preserve heritage by returning such artifacts where they belong,&#34; Richard Donoghue, U.S. attorney for the Eastern District of New York,  said in a statement. &#34;In this case, a major auction house failed to meet its obligations by minimizing its concerns that the provenance of an important Iraqi artifact was fabricated, and withheld from the buyer information that undermined the provenance&#39;s reliability.&#34;\n  The Gilgamesh epic is a Sumerian poem believed to have been written at least 4,000 years ago. Sections of it mirror details of the Great Flood and the Garden of Eden stories from the Old Testament, which it predates. A 12-tablet version of the poem, written in the Akkadian language, was discovered in the ruins of the library in a palace of Nineveh in present-day Mosul, Iraq.\n     The Gilgamesh Dream Tablet recounts the hero describing his dreams to his mother, who says they predict the arrival of a new friend. &#34;You will see him and your heart will laugh,&#34; she tells him.\n  According to the complaint, the tablet surfaced in or before 2001, when an unnamed U.S. antiquities dealer examined it, laid out with other pieces on the floor of the London apartment of a Jordanian antiquities dealer known to acquire directly from the Middle East. Two years later, the U.S. dealer returned with a cuneiform expert, who determined that, despite the salt encrustations that made it difficult to read, the tablet was likely a piece of ancient literature — &#34;potentially rare and valuable&#34; — rather than a more common commercial and legal document.\n    It resurfaced in 2007, when it was sold to two other buyers, one of whom included it in a sales  catalog, claiming the tablet had been with a single U.S. owner for the previous 25 years. The asking price in the catalog was $450,000. It came with a false letter of provenance, claiming it had been acquired at a 1981 San Francisco auction in a box of bronze fragments, according to the U.S. complaint.\n  In 2013, the complaint says, a new owner of the tablet contacted the London office of the international auction house, wanting to sell it. But the U.S. antiquities dealer told the auction house&#39;s antiquities department head that the object&#39;s provenance would not stand up to scrutiny and it would not be suitable for public auction.\n  The following year, Hobby Lobby bought the tablet in a private sale, after a Hobby Lobby representative viewed the tablet in London. The auction house shipped the tablet to its New York office and, from there, hand-carried it to Hobby Lobby&#39;s headquarters in Oklahoma City, &#34;so that Hobby Lobby could avoid incurring a New York sales tax,&#34; according to prosecutors.\n     Hobby Lobby was  fined $3 million in 2017 for failing to conduct due diligence after federal authorities said it bought thousands of artifacts that had been smuggled out of Iraq. Some of the items on display at the Museum of the Bible had been looted from  previously unknown archaeological sites.\n  In a  statement in March, museum board chairman Steve Green said the institution had identified a further 5,000 papyrus fragments and 6,500 clay objects with insufficient provenance that would be returned to Egypt and Iraq.\n  In the 2017 settlement with federal authorities, Green committed to the museum exercising more oversight. Later that same year, the Museum of the Bible contacted the auction house to verify information about the origins of the Gilgamesh tablet. U.S. prosecutors say the auction house withheld information.\n  Iraq&#39;s ministry of antiquities told NPR that it is trying to determine whether the Gilgamesh tablet was among thousands of items stolen from one of its regional museums in 1991. After Saddam Hussein&#39;s invasion of Kuwait the previous year, the regime lost control of certain parts of Iraq. At least nine of the country&#39;s 13 regional museums were looted in the turmoil.", "posttime": "2020-05-20 03:37:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电脑,当局,hobby,博物馆", "title": "美国当局说，Hobby Lobby的Gilgamesh平板电脑被“偷走”MustGoBackto伊拉克", "title_en": "U.S. Authorities Say Hobby Lobby's Gilgamesh Tablet Is 'Stolen' MustGoBackToIraq", "transed": 1, "url": "https://www.npr.org/2020/05/19/858605788/u-s-authorities-say-hobby-lobbys-gilgamesh-tablet-is-stolen-must-go-back-to-iraq", "via": "", "real_tags": ["电脑", "当局", "hobby", "博物馆"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002857, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "%3CLINGO-SUB%20id%3D%22lingo-sub-1372233%22%20slang%3D%22en-US%22%3EAnnouncing%20Microsoft%20Lists%20-%20Your%20smart%20information%20tracking%20app%20in%20Microsoft%20365%3C%2FLINGO-SUB%3E%3CLINGO-BODY%20id%3D%22lingo-body-1372233%22%20slang%3D%22en-US%22%3E%3CP%3EBuild%202020%20brought%20a%20lot%20of%20%3CA%20href%3D%22https%3A%2F%2Faka.ms%。2FMSLists%2Fblog%2FM365BuildNews%22%20target%3D%22_blank%22%20rel%3D%22noopener%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%22%3EMicrosoft%20365%20news%20and%20announcements%3C%2FA%3E%20for%20businesses%20and%20developers%20%E2%80%。93%20including%20the%20first%20disclosure%20of%20%3CSTRONG%3EMicrosoft%20Lists%3C%2FSTRONG%3E.%20We%20are%20pleased%20to%20share%20our%20vision%20for%20Lists%20%E2%80%93%20to%20highlight%20how%20you%20use%20it%20to%20track%20issues%2C%20manage%20inventory%2C%20build%20out%20event%20agendas%2C%20report%20status%2C%20manage%20FAQs%2C%20and%20more.%3C%2FP%3E%0A%3CP%3E%26nbsp%。3B%3C%2FP%3E%0A%3CP%3EMicrosoft%20Lists%20is%20a%20Microsoft%20365%20app%20that%20helps%20you%20track%20information%20and%20organize%20your%20work.%20Lists%20are%20simple%2C%20smart%2C%20and%20flexible%2C%20so%20you%20can%20stay%20on%20top%20of%20what%20matters%20most%20to%20your%20team.%20Track%20issues%2C%20assets%2C%20routines%2C%20contacts%2C%20inventory%20and%20more%20using%20customizable%20views%。20and%20smart%20rules%20and%20alerts%20to%20keep%20everyone%20in%20sync.%20With%20ready-made%20templates%2C%20you%20can%20quickly%20start%20lists%20online%2C%20on%20our%20new%20mobile%20app%2C%20and%20directly%20from%20within%20Microsoft%20Teams.%20And%20because%20it%20is%20part%20of%20Microsoft%20365%2C%20you%20can%20rely%20on%20enterprise-grade%20security%20and%20compliance.%3C%2FP%3E%0A%3CP%3E%26nbsp。%3B%3C%2FP%3E%0A%3CP%3E%3C%2FP%3E%3CDIV%20class%3D%22video-embed-center%20video-embed%22%3E%3CIFRAME%20class%3D%22embedly-embed%22%20src%3D%22https%3A%2F%2Fcdn.embedly.com%2Fwidgets%2Fmedia.html%3Fsrc%3Dhttps%253A%252F%252Fwww.youtube.com%252Fembed%252FU5E7N4l5FzA%253Ffeature%253Doembed%26amp%3Bdisplay_name%3DYouTube%26amp%3Burl%3Dhttps%253A%252F%252Fwww.youtube.com。%252Fwatch%253Fv%253DU5E7N4l5FzA%26amp%3Bimage%3Dhttps%253A%252F%252Fi.ytimg.com%252Fvi%252FU5E7N4l5FzA%252Fhqdefault.jpg%26amp%3Bkey%3Db0d40caa4f094c68be7c29880b16f56e%26amp%3Btype%3Dtext%252Fhtml%26amp%3Bschema%3Dyoutube%22%20width%3D%22600%22%20height%3D%22337%22%20scrolling%3D%22no%22%20title%3D%22YouTube%20embed%22%20frameborder%3D%220%22%20allow%3D%22autoplay%3B%20fullscreen%22%20allowfullscreen%3D%22true%22%3E%3C%2FIFRAME。%3E%3C%2FDIV%3E%3CP%3E%3C%2FP%3E%0A%3CP%3E%26nbsp%3B%3C%2FP%3E%0A%3CP%3ESummary%20of%20what%20was%20shared%20today%20at%20Build%20(more%20details%20below)%3A%3C%2FP%3E%0A%3CUL%3E%0A%3CLI%3E%3CSTRONG%3EMicrosoft%20Lists%20home%20(web)%20and%20mobile%20app%3C%2FSTRONG%3E%20%E2%80%93%20Create%20new。%20lists%2C%20share%20and%20access%20recent%20and%20favorite%20lists%20in%20one%20location%3C%2FLI%3E%0A%3CLI%3E%3CSTRONG%3EMicrosoft%20Teams%20%3C%2FSTRONG%3E%E2%99%A5%3CSTRONG%3E%20Microsoft%20Lists%20%3C%2FSTRONG%3E%E2%80%93%20Create%20a%20new%20list%20or%20embed%20an%20existing%20list%20directly%20in%20a%20Teams%20channel%20-%20combining%20lists%20with%20side-by-。side%20conversation%3C%2FLI%3E%0A%3CLI%3E%3CSTRONG%3EReady-made%20templates%20help%20you%20get%20started%20quickly%3C%2FSTRONG%3E%20%E2%80%93%20Jumpstart%20common%20scenarios%20with%20preconfigured%20structure%2C%20forms%2C%20views%2C%20and%20formatting%3C%2FLI%3E%0A%3CLI%3E%3CSTRONG%3ECustomizable%20views%2C%20smart%20rules%2C%20and%20sharing%20keep%20everyone%20in%20sync%20%3C%2FSTRONG%3E%。E2%80%93%20Visualize%20your%20information%2C%20build%20if%2Fthen%20rules%2C%20and%20share%20with%20confidence%3C%2FLI%3E%0A%3C%2FUL%3E%0A%3CP%3E%3CSPAN%20class%3D%22lia-inline-image-display-wrapper%20lia-image-align-inline%22%20image-alt%3D%22MSLists_M365_001_Create-a-list-collage.jpg%22%20style%3D%22width%3A%20999px%3B%22%3E%3CIMG%。20src%3D%22https%3A%2F%2Fgxcuf89792.i.lithium.com%2Ft5%2Fimage%2Fserverpage%2Fimage-id%2F192994iFA469EC57A66D7F4%2Fimage-size%2Flarge%3Fv%3D1.0%26amp%3Bpx%3D999%22%20title%3D%22MSLists_M365_001_Create-a-list-collage.jpg%22%20alt%3D%22Create%20a%20list%20from%20the%20Lists%20home%20page%20in%20Microsoft%20365%20(top%20left)%20or%20from%20within%20Microsoft%20Teams%20(bottom%20left。).%20Use%20the%20list%20across%20team%20members%20in%20SharePoint%20(top%20right)%20or%20continue%20in%20Microsoft%20Teams%20(bottom%20right).%22%20%2F%3E%3CSPAN%20class%3D%22lia-inline-image-caption%22%20onclick%3D%22event.preventDefault()%3B%22%3ECreate%20a%20list%20from%20the%20Lists%20home%20page%20in%20Microsoft%20365", "note_en": "%3CLINGO-SUB%20id%3D%22lingo-sub-1372233%22%20slang%3D%22en-US%22%3EAnnouncing%20Microsoft%20Lists%20-%20Your%20smart%20information%20tracking%20app%20in%20Microsoft%20365%3C%2FLINGO-SUB%3E%3CLINGO-BODY%20id%3D%22lingo-body-1372233%22%20slang%3D%22en-US%22%3E%3CP%3EBuild%202020%20brought%20a%20lot%20of%20%3CA%20href%3D%22https%3A%2F%2Faka.ms%2FMSLists%2Fblog%2FM365BuildNews%22%20target%3D%22_blank%22%20rel%3D%22noopener%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%22%3EMicrosoft%20365%20news%20and%20announcements%3C%2FA%3E%20for%20businesses%20and%20developers%20%E2%80%93%20including%20the%20first%20disclosure%20of%20%3CSTRONG%3EMicrosoft%20Lists%3C%2FSTRONG%3E.%20We%20are%20pleased%20to%20share%20our%20vision%20for%20Lists%20%E2%80%93%20to%20highlight%20how%20you%20use%20it%20to%20track%20issues%2C%20manage%20inventory%2C%20build%20out%20event%20agendas%2C%20report%20status%2C%20manage%20FAQs%2C%20and%20more.%3C%2FP%3E%0A%3CP%3E%26nbsp%3B%3C%2FP%3E%0A%3CP%3EMicrosoft%20Lists%20is%20a%20Microsoft%20365%20app%20that%20helps%20you%20track%20information%20and%20organize%20your%20work.%20Lists%20are%20simple%2C%20smart%2C%20and%20flexible%2C%20so%20you%20can%20stay%20on%20top%20of%20what%20matters%20most%20to%20your%20team.%20Track%20issues%2C%20assets%2C%20routines%2C%20contacts%2C%20inventory%20and%20more%20using%20customizable%20views%20and%20smart%20rules%20and%20alerts%20to%20keep%20everyone%20in%20sync.%20With%20ready-made%20templates%2C%20you%20can%20quickly%20start%20lists%20online%2C%20on%20our%20new%20mobile%20app%2C%20and%20directly%20from%20within%20Microsoft%20Teams.%20And%20because%20it%20is%20part%20of%20Microsoft%20365%2C%20you%20can%20rely%20on%20enterprise-grade%20security%20and%20compliance.%3C%2FP%3E%0A%3CP%3E%26nbsp%3B%3C%2FP%3E%0A%3CP%3E%3C%2FP%3E%3CDIV%20class%3D%22video-embed-center%20video-embed%22%3E%3CIFRAME%20class%3D%22embedly-embed%22%20src%3D%22https%3A%2F%2Fcdn.embedly.com%2Fwidgets%2Fmedia.html%3Fsrc%3Dhttps%253A%252F%252Fwww.youtube.com%252Fembed%252FU5E7N4l5FzA%253Ffeature%253Doembed%26amp%3Bdisplay_name%3DYouTube%26amp%3Burl%3Dhttps%253A%252F%252Fwww.youtube.com%252Fwatch%253Fv%253DU5E7N4l5FzA%26amp%3Bimage%3Dhttps%253A%252F%252Fi.ytimg.com%252Fvi%252FU5E7N4l5FzA%252Fhqdefault.jpg%26amp%3Bkey%3Db0d40caa4f094c68be7c29880b16f56e%26amp%3Btype%3Dtext%252Fhtml%26amp%3Bschema%3Dyoutube%22%20width%3D%22600%22%20height%3D%22337%22%20scrolling%3D%22no%22%20title%3D%22YouTube%20embed%22%20frameborder%3D%220%22%20allow%3D%22autoplay%3B%20fullscreen%22%20allowfullscreen%3D%22true%22%3E%3C%2FIFRAME%3E%3C%2FDIV%3E%3CP%3E%3C%2FP%3E%0A%3CP%3E%26nbsp%3B%3C%2FP%3E%0A%3CP%3ESummary%20of%20what%20was%20shared%20today%20at%20Build%20(more%20details%20below)%3A%3C%2FP%3E%0A%3CUL%3E%0A%3CLI%3E%3CSTRONG%3EMicrosoft%20Lists%20home%20(web)%20and%20mobile%20app%3C%2FSTRONG%3E%20%E2%80%93%20Create%20new%20lists%2C%20share%20and%20access%20recent%20and%20favorite%20lists%20in%20one%20location%3C%2FLI%3E%0A%3CLI%3E%3CSTRONG%3EMicrosoft%20Teams%20%3C%2FSTRONG%3E%E2%99%A5%3CSTRONG%3E%20Microsoft%20Lists%20%3C%2FSTRONG%3E%E2%80%93%20Create%20a%20new%20list%20or%20embed%20an%20existing%20list%20directly%20in%20a%20Teams%20channel%20-%20combining%20lists%20with%20side-by-side%20conversation%3C%2FLI%3E%0A%3CLI%3E%3CSTRONG%3EReady-made%20templates%20help%20you%20get%20started%20quickly%3C%2FSTRONG%3E%20%E2%80%93%20Jumpstart%20common%20scenarios%20with%20preconfigured%20structure%2C%20forms%2C%20views%2C%20and%20formatting%3C%2FLI%3E%0A%3CLI%3E%3CSTRONG%3ECustomizable%20views%2C%20smart%20rules%2C%20and%20sharing%20keep%20everyone%20in%20sync%20%3C%2FSTRONG%3E%E2%80%93%20Visualize%20your%20information%2C%20build%20if%2Fthen%20rules%2C%20and%20share%20with%20confidence%3C%2FLI%3E%0A%3C%2FUL%3E%0A%3CP%3E%3CSPAN%20class%3D%22lia-inline-image-display-wrapper%20lia-image-align-inline%22%20image-alt%3D%22MSLists_M365_001_Create-a-list-collage.jpg%22%20style%3D%22width%3A%20999px%3B%22%3E%3CIMG%20src%3D%22https%3A%2F%2Fgxcuf89792.i.lithium.com%2Ft5%2Fimage%2Fserverpage%2Fimage-id%2F192994iFA469EC57A66D7F4%2Fimage-size%2Flarge%3Fv%3D1.0%26amp%3Bpx%3D999%22%20title%3D%22MSLists_M365_001_Create-a-list-collage.jpg%22%20alt%3D%22Create%20a%20list%20from%20the%20Lists%20home%20page%20in%20Microsoft%20365%20(top%20left)%20or%20from%20within%20Microsoft%20Teams%20(bottom%20left).%20Use%20the%20list%20across%20team%20members%20in%20SharePoint%20(top%20right)%20or%20continue%20in%20Microsoft%20Teams%20(bottom%20right).%22%20%2F%3E%3CSPAN%20class%3D%22lia-inline-image-caption%22%20onclick%3D%22event.preventDefault()%3B%22%3ECreate%20a%20list%20from%20the%20Lists%20home%20page%20in%20Microsoft%20365%20(top%20left)%20or%20from%20within%20Microsoft%20Teams%20(bottom%20left).%20Use%20the%20list%20across%20team%20members%20in%20SharePoint%20(top%20right)%20or%20continue%20in%20Microsoft%20Teams%20(bottom%20right).%3C%2FSPAN%3E%3C%2FSPAN%3E%3C%2FP%3E%0A%3CP%3EWriting%20something%20down%20is%20one%20thing.%20Tracking%20it%20and%20thousands%20of%20other%20related%20items%20%E2%80%93%20across%20geographies%2C%20keeping%20in%20sync%20with%20team%20members%20as%20status%20and%20details%20fluctuate%20%E2%80%93%20well%2C%20that%E2%80%99s%20Lists%3B%20an%20app%20to%20track%20your%20information%20and%20get%20to%20work.%3C%2FP%3E%0A%3CP%3E%26nbsp%3B%3C%2FP%3E%0A%3CP%20class%3D%22lia-indent-padding-left-30px%22%3E%3CIMG%20class%3D%22lia-deferred-image%20lia-image-emoji%22%20src%3D%22https%3A%2F%2Fgxcuf89792.i.lithium.com%2Fhtml%2Fimages%2Femoticons%2Fcool_40x40.gif%22%20alt%3D%22%3Acool%3A%22%20title%3D%22%3Acool%3A%22%20%2F%3E%20Take%20a%20moment%20to%20%3CSTRONG%3Esee%20Lists%20in%20action%3C%2FSTRONG%3E...%26nbsp%3B%3CBR%20%2F%3EWatch%26nbsp%3B%3CA%20href%3D%22https%3A%2F%2Ftechcommunity.microsoft.com%2Ft5%2Fuser%2Fviewprofilepage%2Fuser-id%2F32817%22%20target%3D%22_blank%22%3E%40Miceile%20Barrett%3C%2FA%3E%26nbsp%3B(Lists%20program%20manager)%20share%20a%20%3CA%20href%3D%22https%3A%2F%2Faka.ms%2FMSLists%2Fdemo-video%22%20target%3D%22_blank%22%20rel%3D%22noopener%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%22%3EFirst%20look%20at%20Microsoft%20Lists%3C%2FA%3E%20(demo%20video).%26nbsp%3B%3C%2FP%3E%0A%3CP%3E%26nbsp%3B%3C%2FP%3E%0A%3CP%3EAnd%20now%2C%20let%E2%80%99s%20dive%20into%20the%20details.%3C%2FP%3E%0A%3CP%3E%26nbsp%3B%3C%2FP%3E%0A%3CP%3E%3CFONT%20size%3D%225%22%3EMicrosoft%20Lists%20home%20(web)%20and%20mobile%20app%3C%2FFONT%3E%3C%2FP%3E%0A%3CP%3EIt%20all%20starts%20with%20Lists%20Home%2C%20a%20single%20place%20to%20see%20and%20manage%20all%20your%20lists.%20To%20get%20there%2C%20click%20the%20%3CSTRONG%3ELists%3C%2FSTRONG%3E%20icon%20within%20the%20Microsoft%20365%20app%20launcher%20(aka%2C%20the%20%E2%80%9Cwaffle%E2%80%9D).%20Here%2C%20you%20can%20start%20a%20list%20in%20several%20ways%20-%20easily%20from%20scratch%20or%20with%20ready-made%20templates.%20In%20addition%2C%20you%20can%20create%20new%20lists%20from%20existing%20lists%20or%20by%20importing%20Excel%20table%20data%20to%20jumpstart.%20Beyond%20creation%2C%20you%20will%20see%20all%20your%20favorited%20and%20recent%20lists%20%E2%80%93%20ones%20you%20own%20or%20that%20have%20been%20shared%20with%20you.%20You%20will%20be%20able%20to%20create%20both%20personal%20lists%20you%20own%20and%20can%20share%2C%20and%20team%20lists%20owned%20by%20members%20of%20your%20teams.%3C%2FP%3E%0A%3CP%3E%26nbsp%3B%3C%2FP%3E%0A%3CP%3ELists%20home%20brings%20all%20your%20lists%20at%20your%20fingertips%2C%20on%20the%20web%20and%20on%20the%20go%20via%20the%20Lists%20mobile%20app.%3C%2FP%3E%0A%3CP%3E%26nbsp%3B%3C%2FP%3E%0A%3CP%3E%3CSPAN%20class%3D%22lia-inline-image-display-wrapper%20lia-image-align-inline%22%20image-alt%3D%22MSLists_M365_002_Lists-home-mobile.jpg%22%20style%3D%22width%3A%20803px%3B%22%3E%3CIMG%20src%3D%22https%3A%2F%2Fgxcuf89792.i.lithium.com%2Ft5%2Fimage%2Fserverpage%2Fimage-id%2F192315iBBB85457F7E89EDF%2Fimage-size%2Flarge%3Fv%3D1.0%26amp%3Bpx%3D999%22%20title%3D%22MSLists_M365_002_Lists-home-mobile.jpg%22%20alt%3D%22Left-to-right%3A%20Microsoft%20Lists%20home%20page%20in%20Microsoft%20365%20and%20the%20mobile%20app%20-%20both%20access%20to%20all%20your%20lists%20in%20one%20place.%22%20%2F%3E%3CSPAN%20class%3D%22lia-inline-image-caption%22%20onclick%3D%22event.preventDefault()%3B%22%3ELeft-to-right%3A%20Microsoft%20Lists%20home%20page%20in%20Microsoft%20365%20and%20the%20mobile%20app%20-%20both%20access%20to%20all%20your%20lists%20in%20one%20place.%3C%2FSPAN%3E%3C%2FSPAN%3E%3C%2FP%3E%0A%3CP%3ENever%20miss%20out%20on%20a%20list%20that%20is%20important%20to%20you%2C%20just%20favorite%20it%20and%20you%20will%20always%20be%20able%20to%20access%20it%20from%20the%20%22Favorites%22%20section.%3C%2FP%3E%0A%3CP%3E%3CSPAN%20class%3D%22lia-inline-image-display-wrapper%20lia-image-align-inline%22%20image-alt%3D%22MSLists_M365_003_Lists-mobile-animated.gif%22%20style%3D%22width%3A%20999px%3B%22%3E%3CIMG%20src%3D%22https%3A%2F%2Fgxcuf89792.i.lithium.com%2Ft5%2Fimage%2Fserverpage%2Fimage-id%2F192316iCDBA1CE58E2CFFF8%2Fimage-size%2Flarge%3Fv%3D1.0%26amp%3Bpx%3D999%22%20title%3D%22MSLists_M365_003_Lists-mobile-animated.gif%22%20alt%3D%22MSLists_M365_003_Lists-mobile-animated.gif%22%20%2F%3E%3C%2FSPAN%3E%3C%2FP%3E%0A%3CP%3EYou%20can%20expect%20to%20see%20Lists%20home%20later%20this%20summer%20on%20the%20web%20and%20the%20Lists%20mobile%20app%20later%20this%20year.%20Both%20provide%20access%20to%20all%20your%20lists%20in%20one%20place.%3C%2FP%3E%0A%3CP%3E%26nbsp%3B%3C%2FP%3E%0A%3CP%3ESee%20more%20about%20getting%20started%20with%20Microsoft%20Lists%20in%20this%20new%20%3CA%20href%3D%22https%3A%2F%2Fdemobuilderwebcpptxz.blob.core.windows.net%2Fmicrosoft-lists-create-a-list%2Fstartdemo.html%22%20target%3D%22_blank%22%20rel%3D%22noopener%20nofollow%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%22%3E%E2%80%9CCreate%20a%20list%E2%80%9D%20click-thru%20demo%3C%2FA%3E.%3C%2FP%3E%0A%3CP%20class%3D%22lia-indent-padding-left-30px%22%3E%3CFONT%20color%3D%22%23808080%22%3E%3CSTRONG%3ERoadmap%20IDs%3C%2FSTRONG%3E%3C%2FFONT%3E%20%7C%20Lists%20home%20(ID%20%23%20%3CA%20href%3D%22https%3A%2F%2Fwww.microsoft.com%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26amp%3Bsearchterms%3D64160%22%20target%3D%22_blank%22%20rel%3D%22noopener%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%22%3E64160%3C%2FA%3E)%20and%20Lists%20mobile%20app%20(ID%20%23%20%3CA%20href%3D%22https%3A%2F%2Fwww.microsoft.com%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26amp%3Bsearchterms%3D64161%22%20target%3D%22_blank%22%20rel%3D%22noopener%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%22%3E64161%3C%2FA%3E).%3C%2FP%3E%0A%3CP%3E%26nbsp%3B%3C%2FP%3E%0A%3CP%3E%3CFONT%20size%3D%225%22%3EMicrosoft%20Teams%20%E2%99%A5%20Microsoft%20Lists%3C%2FFONT%3E%3C%2FP%3E%0A%3CP%3EMicrosoft%20Lists%20is%20for%20people%20who%20get%20things%20done%20-%20together.%20Use%20Microsoft%20Teams%20to%20collaborate%20on%20lists%2C%20using%20flexible%20views%20like%20grids%2C%20cards%2C%20and%20calendar.%20This%20brings%20content%20and%20conversation%20side-by-side%20in%20one%20integrated%20experience.%20You%20can%20either%20add%20an%20existing%20list%20to%20a%20Teams%20channel%20or%20create%20a%20new%20list%20directly%20in%20Teams%20and%20chat%20on%20individual%20list%20items.%3C%2FP%3E%0A%3CP%3E%26nbsp%3B%3C%2FP%3E%0A%3CP%3E%3CSPAN%20class%3D%22lia-inline-image-display-wrapper%20lia-image-align-inline%22%20image-alt%3D%22MSLists_M365_004_Lists-plus-Teams_pt1-event-itinerary.jpg%22%20style%3D%22width%3A%20999px%3B%22%3E%3CIMG%20src%3D%22https%3A%2F%2Fgxcuf89792.i.lithium.com%2Ft5%2Fimage%2Fserverpage%2Fimage-id%2F192317i58BCA8AC166C5722%2Fimage-size%2Flarge%3Fv%3D1.0%26amp%3Bpx%3D999%22%20title%3D%22MSLists_M365_004_Lists-plus-Teams_pt1-event-itinerary.jpg%22%20alt%3D%22Create%2C%20share%2C%20and%20track%20list%20all%20from%20within%20Microsoft%20Teams.%22%20%2F%3E%3CSPAN%20class%3D%22lia-inline-image-caption%22%20onclick%3D%22event.preventDefault()%3B%22%3ECreate%2C%20share%2C%20and%20track%20list%20all%20from%20within%20Microsoft%20Teams.%3C%2FSPAN%3E%3C%2FSPAN%3E%3C%2FP%3E%0A%3CP%3EWhen%20you%20click%20%E2%80%9C%2B%E2%80%9D%20to%20add%20a%20new%20tab%20to%20a%20Teams%20channel%2C%20select%20the%20Lists%20app%20to%20begin.%20The%20Lists%20app%20is%20used%20to%20both%20create%20new%20and%20embed%20existing%20lists%20%E2%80%93%20all%20within%20Teams.%20Further%20refine%20your%20list%20by%20adding%20new%20columns%2C%20defining%20choices%20in%20a%20drop-down%20menu%2C%20create%20view%20or%20edit%20share%20links%2C%20create%20custom%20views%20and%20filters%20and%20set%20up%20rules%20%E2%80%93%20all%20to%20ensure%20the%20list%20works%20for%20you%20and%20your%20team.%20No%20compromises.%20You%20get%20the%20full%20power%20to%20configure%20what%20your%20list%20looks%20like%20and%20how%20it%20works%20for%20you%20%E2%80%93%20all%20from%20inside%20Teams.%3C%2FP%3E%0A%3CP%3E%26nbsp%3B%3C%2FP%3E%0A%3CP%3E%3CSPAN%20class%3D%22lia-inline-image-display-wrapper%20lia-image-align-inline%22%20image-alt%3D%22MSLists_M365_005_Lists-plus-Teams_pt2-create-in-Teams.jpg%22%20style%3D%22width%3A%20999px%3B%22%3E%3CIMG%20src%3D%22https%3A%2F%2Fgxcuf89792.i.lithium.com%2Ft5%2Fimage%2Fserverpage%2Fimage-id%2F192318i48972C7176732F6B%2Fimage-size%2Flarge%3Fv%3D1.0%26amp%3Bpx%3D999%22%20title%3D%22MSLists_M365_005_Lists-plus-Teams_pt2-create-in-Teams.jpg%22%20alt%3D%22Create%20a%20new%20list%20directly%20inside%20Teams%20or%20bring%20in%20one%20that%20already%20exists%20in%20Microsoft%20365.%22%20%2F%3E%3CSPAN%20class%3D%22lia-inline-image-caption%22%20onclick%3D%22event.preventDefault()%3B%22%3ECreate%20a%20new%20list%20directly%20inside%20Teams%20or%20bring%20in%20one%20that%20already%20exists%20in%20Microsoft%20365.%3C%2FSPAN%3E%3C%2FSPAN%3E%3C%2FP%3E%0A%3CP%3E%3CSPAN%20class%3D%22lia-inline-image-display-wrapper%20lia-image-align-inline%22%20image-alt%3D%22MSLists_M365_006_Lists-plus-Teams_pt3-list-item-plus-chat.jpg%22%20style%3D%22width%3A%20999px%3B%22%3E%3CIMG%20src%3D%22https%3A%2F%2Fgxcuf89792.i.lithium.com%2Ft5%2Fimage%2Fserverpage%2Fimage-id%2F192319iDA28EEBA5526FDBE%2Fimage-size%2Flarge%3Fv%3D1.0%26amp%3Bpx%3D999%22%20title%3D%22MSLists_M365_006_Lists-plus-Teams_pt3-list-item-plus-chat.jpg%22%20alt%3D%22Viewing%20an%20individual%20list%20item%20inside%20of%20Microsoft%20Teams%20alongside%20chat.%22%20%2F%3E%3CSPAN%20class%3D%22lia-inline-image-caption%22%20onclick%3D%22event.preventDefault()%3B%22%3EViewing%20an%20individual%20list%20item%20inside%20of%20Microsoft%20Teams%20alongside%20chat.%3C%2FSPAN%3E%3C%2FSPAN%3E%3C%2FP%3E%0A%3CP%20class%3D%22lia-indent-padding-left-30px%22%3E%3CSTRONG%3E%3CFONT%20color%3D%22%23808080%22%3ERoadmap%20ID%3C%2FFONT%3E%3C%2FSTRONG%3E%20%7C%20Lists%20app%20in%20Microsoft%20Teams%20(ID%20%23%20%3CA%20href%3D%22https%3A%2F%2Fwww.microsoft.com%2Fmicrosoft-365%2Froadmap%3Ffilters%3D%26amp%3Bsearchterms%3D64162%22%20target%3D%22_blank%22%20rel%3D%22noopener%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%22%3E64162%3C%2FA%3E).%3C%2FP%3E%0A%3CP%3E%26nbsp%3B%3C%2FP%3E%0A%3CP%3E%3CFONT%20size%3D%225%22%3EReady-made%20templates%20help%20you%20get%20started%20quickly%3C%2FFONT%3E%20%26nbsp%3B%3C%2FP%3E%0A%3CP%3EWe&#39;ve%20designed%20templates%20tailored%20to%20specific%20use%20cases%20like%20tracking%20issues%2C%20onboarding%20new%20hires%2C%20handling%20an%20event&#39;s%20itinerary%2C%20managing%20assets%2C%20and%20many%20more.%20These%20templates%20come%20with%20a%20base%20structure%2C%20formatting%2C%20forms%2C%20conditional%20formatting%2C%20and%20everything%20you%20will%20need%20to%20get%20a%20quick%20start%20on%20the%20work%20that%20matters%20to%20you.%20Find%20inspiration%20in%20them%20or%20modify%20them%20to%20bring%20your%20vision%20to%20life.%3C%2FP%3E%0A%3CP%3E%26nbsp%3B%3C%2FP%3E%0A%3CP%3E%3CSPAN%20class%3D%22lia-inline-image-display-wrapper%20lia-image-align-inline%22%20image-alt%3D%22MSLists_M365_007_Templates.jpg%22%20style%3D%22width%3A%20999px%3B%22%3E%3CIMG%20src%3D%22https%3A%2F%2Fgxcuf89792.i.lithium.com%2Ft5%2Fimage%2Fserverpage%2Fimage-id%2F192320i2FECA0CD5BC2E915%2Fimage-size%2Flarge%3Fv%3D1.0%26amp%3Bpx%3D999%22%20title%3D%22MSLists_M365_007_Templates.jpg%22%20alt%3D%22Get%20started%20quickly%20with%20ready-to-use%20list%20templates%20%E2%80%93%20above%20shows%20the%20%E2%80%9CEvent%20itinerary%E2%80%9D%20template.%22%20%2F%3E%3CSPAN%20class%3D%22lia-inline-image-caption%22%20onclick%3D%22event.preventDefault()%3B%22%3EGet%20started%20quickly%20with%20ready-to-use%20list%20templates%20%E2%80%93%20above%20shows%20the%20%E2%80%9CEvent%20itinerary%E2%80%9D%20template.%3C%2FSPAN%3E%3C%2FSPAN%3E%3C%2FP%3E%0A%3CP%3EIn%20addition%20to%20the%20ready-made%20templates%2C%20there%20are%20two%20other%20time-saving%20ways%20to%20create%20lists.%20You%20can%20%3CA%20href%3D%22https%3A%2F%2Fsupport.office.com%2Farticle%2F0D397414-D95F-41EB-ADDD-5E6EFF41B083%22%20target%3D%22_blank%22%20rel%3D%22noopener%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%22%3Ecreate%20a%20list%20from%20an%20existing%20list%3C%2FA%3E%20%E2%80%93%20inheriting%20structure%20and%20formatting.%20And%20you%20can%20%3CA%20href%3D%22https%3A%2F%2Fsupport.office.com%2Fen-us%2Farticle%2FCreate-a-list-based-on-a-spreadsheet-380CFEB5-6E14-438E-988A-C2B9BEA574FA%22%20target%3D%22_blank%22%20rel%3D%22noopener%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%20noopener%20noreferrer%22%3Ecreate%20a%20l\n......", "posttime": "2020-05-20 03:37:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,microsoft,发布,app,微软", "title": "微软发布列表，这是一款新的类似Airtable的应用程序", "title_en": "Microsoft announces Lists, a new Airtable-like app", "transed": 1, "url": "https://techcommunity.microsoft.com/t5/microsoft-365-blog/announcing-microsoft-lists-your-smart-information-tracking-app/ba-p/1372233", "via": "", "real_tags": ["程序", "microsoft", "发布", "app", "微软"]}, {"category": "", "categoryclass": "", "imagename": "35d71b0c78e4c58320efd02045ee7807.png", "infoid": 1002856, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几天前，Shopify在Twitter上大张旗鼓地推出了他们“有史以来最重要的产品”之一：一款面向消费者的购物应用，简称Shop。\n许多人将此解读为Shopify战略的巨大转变，以更直接地与亚马逊竞争。\n受到Shop推出的启发，我决定写一篇关于电子商务的两部分文章。第一部分--你现在正在阅读的这篇文章--着眼于网购的现状。它解释了Shopify(和亚马逊)背后的商业模式，以及Shop如何适应这一战略。\n第二部分--我将在下周发布--是对电子商务未来的展望。它描述了我认为目前购物体验中缺少的东西，以及Shopify下一步应该建立什么。\n首先，让我们先来看看Shopify和亚马逊是如何运营的-因为虽然这两家公司都是电子商务公司，但他们的战略实际上是根本不同的。\n(免责声明：这一部分本质上是本·汤普森对同一主题的出色分析的傲慢副本摘要)。\nShopify首先是一家基础设施公司。它提供了一个平台，商家可以在这个平台上建立自己的商店，与最终客户建立直接关系。这就是为什么Shopify支持的业务类型通常被称为“直接面向消费者”(D2C)。\n另一方面，亚马逊更像是一个聚合器。除了自己的供应，亚马逊还允许任何商家在Amazon.com网站上销售他们的产品。但拥有客户关系的总是亚马逊，而不是商家。供应方变得商品化。\n不只是这两家公司的战略不同-他们还服务于两种完全不同类型的购物行为。\n任何互联网服务都可以根据两种类型的用户动作大致分类：拉和推。\n谷歌是拉服务的完美例子。用户正在积极地寻找特定的信息或特定问题的答案(例如，“如何制作煎饼？”或者“考拉是熊吗？”)。谷歌的搜索引擎可以让你提取这些信息。\n另一方面，Facebook是一种典型的推送服务。用户行为要被动得多，因为您不必主动询问信息。相反，Facebook会自动将最相关的内容推送到您的新闻提要中。\n亚马逊本质上是电商领域的谷歌。它主要是一个搜索引擎，当你已经有了你想买的东西的想法时，它的效果最好。不过，亚马逊在发现方面并不出色。它不会向你展示你甚至不知道你感兴趣的东西。\n这个问题有点难，因为没有一个明确的答案。我们看到Instagram和Pinterest等社交网络慢慢演变为产品发现渠道，而不是一个专门的产品发现平台。事实上，它们不是纯粹的电子商务应用，而是在有机内容之间插入产品，这可能正是它们表现如此出色的原因。\n在Instagram上运行得特别好的产品类型都是视觉上有吸引力的东西。你在Instagram上看不到HDMI电缆或挡风玻璃手机支架的广告-这些都是典型的亚马逊产品。\n相反，在Instagram上表现良好的是珠宝、化妆品、时尚或家居配饰等产品-这些都是经典的Shopify D2C品牌。\nShopify正在为“电商Facebook”的基础设施提供动力，但它并不拥有或控制整个渠道。这是有风险的。\n虽然Instagram的一些流量可能是有机的，但最重要的客户群体来自基于拍卖的广告(由于Instagram的无链接政策)。这意味着，随着竞争的加剧(一旦某一特定细分市场的D2C品牌取得了一定的成功，就会出现这种情况，因为没有任何真正的进入壁垒)，广告价格就会上涨。\n因此，Shopify的许多商家并不是真正直接面向消费者的品牌，他们更像是direct-to-consumer-but-with-Instagram-in-the-middle-eating-all-of-their-margin品牌。\nInstagram捕捉到了大部分价值，这是一个完美的例子，说明了为什么需求聚合总是比供应聚合更强大。过度依赖像Instagram这样强大的看门人对Shopify及其商家来说是一种风险。\n首先要注意的是，Instagram并不是推动Shopify商店流量的唯一产品发现渠道。如前所述，“电商脸书”这一角色并没有一位领跑者参与角逐。Pinterest、YouTube和Twitter也是产品发现引擎(以及其他许多试图做到这一点的服务)。\n因此，Shopify的选择之一是使其商家可以使用的用户获取渠道组合多样化。这就是为什么我觉得过去几周Shopify的Pinterest和Google Shopping的合作声明比Shop的发布有趣得多。\nShop被吹捧为Shopify自己的产品发现渠道-这将是解决其目前对其他平台依赖的另一种方式。Shopify可以简单地开始聚合需求方本身，变得更像亚马逊那样的市场，而不是依赖Instagram流量。\n但是如果你安装并打开Shop，你会注意到这个应用程序并不是这样做的。Shop将您与您过去购买过的商家联系起来，而不是带有产品推荐的Feed。\n保护Shopify商家免受不断增加的客户获取成本(阅读Instagram广告)的另一个选择是同时增加客户终身价值。这正是Shop应该做的事情。\n通过将您与您以前购买的商家联系起来，Shop将向您推荐您可能感兴趣的来自相同卖家的其他产品。其结果是更高的购买后忠诚度，从而更高的LTV，这使得通过Instagram更容易证明高昂的初始收购成本是合理的。\n话虽如此，不难想象，未来Shopify也会开始推荐其他商家的产品。这到底应该是什么样子，这是这篇文章的第二部分的主题，我将在下周发表这篇文章。敬请关注。\n你对这篇文章有什么反馈或想法吗？如果是这样的话，我很想听听！", "note_en": "With much fanfare and many hot takes on Twitter, Shopify launched one of their  “most significant products ever” a few days ago:  a consumer-facing shopping app, simply called  Shop.\n Many have been interpreting this as a massive shift in Shopify’s strategy to compete more directly with Amazon.\n  Inspired by the launch of Shop, I decided to write a two-part essay on ecommerce. The first part – the article you’re reading right now – looks at the current state of online shopping. It explains the business model behind Shopify (and Amazon) and how Shop fits into that strategy.\n The second part – which I’ll release next week – is an outlook on the future of ecommerce. It describes what I believe is currently missing in the shopping experience and what Shopify should build next.\n   To start things off, let’s first take a look at how Shopify and Amazon operate – because while both of them are ecommerce companies, their strategies are actually fundamentally different.\n (Disclaimer: This section is essentially a   brash copy summary of  Ben Thompson’s excellent analysis on the same topic)\n Shopify is first and foremost an infrastructure company. It provides a platform on which merchants can build their own stores to have a  direct relationship with their end customers. This is why the type of business Shopify enables is often referred to as “direct to consumer” (D2C).\n  Amazon, on the other hand, is more of an aggregator. Alongside its own supply, Amazon lets any merchant sell their products on the Amazon.com website. But it is always Amazon which owns the customer relationship – never the merchant. The supply side becomes commoditized.\n  It’s not just the two companies’ strategies that are different – they also serve two completely different types of shopping behavior.\n  Any internet service can broadly be categorized based on two types of user actions:  Pull and push.\n Google is the perfect example of a Pull service. Users are actively looking for a particular piece of information or an answer to a specific question  (e.g. “ how to make pancakes?” or “ are koalas bears?“). Google’s search engine lets you  pull that information.\n Facebook, on the other hand, is a typical Push service. The user behavior is a lot more passive since you don’t have to actively ask for information. Instead, Facebook automatically  pushes the most relevant content into your newsfeed.\n Amazon is essentially the Google of ecommerce. It’s primarily a search engine and works best when you already have an idea of what you want to buy. Amazon is not great at discovery though. It doesn’t show you things you didn’t even know you were interested in.\n  That question is a little more difficult because there’s not one clear answer. Instead of one dedicated platform for product discovery, we have seen social networks like Instagram and Pinterest slowly morph into product discovery channels. And the fact that they are not pure ecommerce apps, but insert products between organic content, is probably exactly why they perform so well.\n The types of products that work particularly well on Instagram are things that are visually appealing. You don’t see ads for HDMI cables or windshield phone mounts on Instagram – those are typical Amazon products.\n Instead, it’s products like jewelry, cosmetics, fashion or home accessories that do well on Instagram – and those are classic Shopify D2C brands.\n Shopify is powering the infrastructure of the “Facebook for ecommerce”, but it doesn’t own or control the entire channel. And that’s a risk.\n    While some of that Instagram traffic might be organic, the most significant chunk of customers is coming from auction-based ads (due to Instagram’s no-link-policy). This means that as competition increases  (and it always does once one D2C brand in a particular segment sees some success, because there aren’t any real barriers to entry), ad prices go up.\n As a result, many of Shopify’s merchants aren’t really direct-to-consumer brands, they are more like direct-to-consumer-but-with-Instagram-in-the-middle-eating-all-of-their-margin brands.\n Instagram capturing most of the value is a perfect example of  why demand aggregation is always more powerful than supply aggregation. Too much reliance on a powerful gatekeeper like Instagram is a risk for Shopify and its merchants.\n   The first thing to note is that Instagram isn’t the only product discovery channel driving traffic to Shopify stores. As mentioned earlier, there is not one leading contestant for the role of “Facebook for Ecommerce”. Pinterest, YouTube and Twitter are also product discovery engines (among many other services trying to do the same).\n One of Shopify’s options is therefore to diversify the portfolio of user acquisition channels its merchants can use. This is why I find Shopify’s  Pinterest and  Google Shopping partnership announcements from the last few weeks way more interesting than the launch of Shop.\n Shop has been touted as Shopify’s own product discovery channel – which would be another way to tackle its current dependence on other platforms. Instead of relying on Instagram traffic, Shopify could simply start aggregating the demand side itself and become more of a marketplace like Amazon.\n But if you install and open Shop, you’ll notice that that’s not really what the app does. Instead of a feed with product recommendations, Shop connects you with merchants you have purchased from in the past.\n   Another option to defend Shopify merchants against ever increasing customer acquisition costs (read Instagram ads) is to simultaneously increase customer lifetime value. This is exactly what Shop is supposed to do.\n By connecting you with merchants you have bought from before, Shop will recommend you  additional products that you might be interested in from the same sellers. The result is higher post-purchase loyalty and thus higher LTV which makes it easier to justify high initial acquisition costs via Instagram.\n That being said, it’s not difficult to imagine a future where Shopify also starts recommending products from other merchants. What exactly this should look like is the topic of part two of this essay, which I’ll publish next week. Stay tuned.\n  Do you have feedback or thoughts on this post? If so,  I’d love to hear them!", "posttime": "2020-05-20 03:36:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "思考,ecommerce,shopify", "title": "关于电子商务的思考：现状", "title_en": "Thoughts on Ecommerce: The Status Quo", "transed": 1, "url": "https://julian.digital/2020/05/17/thoughts-on-ecommerce-the-status-quo-shopify-shop-amazon/", "via": "", "real_tags": ["思考", "ecommerce", "shopify"]}, {"category": "", "categoryclass": "", "imagename": "714ce6567c4845d4f2edc1bf7892cc5f.jpg", "infoid": 1002854, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "https://spoti.fi/JoeRogan", "note_en": "https://spoti.fi/JoeRogan", "posttime": "2020-05-20 03:35:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "播客,体验,rogan,https", "title": "乔·罗根体验播客将转向Spotify", "title_en": "The Joe Rogan Experience Podcast Is Moving to Spotify", "transed": 1, "url": "https://youtu.be/X8bVqI2j8o4", "via": "", "real_tags": ["播客", "体验", "rogan", "https"]}, {"category": "", "categoryclass": "", "imagename": "2be1fa220d0e1f49155961475dbad32b.jpg", "infoid": 1002853, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几天里，在第一个Deno版本之后，出现了一场关于Node.js的新讨论。在社交媒体和技术论坛上，许多开发者现在都在谈论Node.js的命运。甚至有人猜测Node.js很快就会消亡。或者最终会的。虽然我不是预言家，但我有一些见解要与大家分享。我特别想回答“Node.js会死吗”这个问题。我介绍了目前对Node.js死亡的恐慌是如何无关紧要的，尽管有支持它的证据。\n每当一种语言或技术诞生时，许多人立即开始谈论它的消亡。你不相信我吗？只需打开Google并键入。\n从字面上讲，对于任何技术，你都可以找到一堆文章，其中许多毫无疑问都是垃圾。即使是库伯内斯这样的新技术也是如此。js也不例外。但引发“Node.js死亡”话题的是Deno的首次发布。\n如果您不知道Deno是什么，只需阅读下一节即可对其有所了解。这有助于你理解当前恐慌的气氛。\nDeno是由Node.js创建者Ryan Dahl编写的Javascript运行时。这个名字是单词“Node”🙂的自然类型。\n该项目由Dahl于2018年在他的演讲“我对Node.js的十件遗憾”中宣布。Deno是用Rust编写的，与用C/C++编写的Node.js形成对比。\n在撰写本文时，Deno有一个压缩大小约为15MB的执行文件。\n此外，它没有像NPM一样的或单独的外部包管理器。它是内置的。\nDeno以沙盒模式运行(表示不能直接访问文件、网络和其他IO)，因此应该显式授予任何权限。\n突然开始认为Node.js正在消亡的主要原因是因为Deno的1.0版本于2020年5月13日发布。尽管这个项目已经有两年多的历史了，但是这个版本还是在社交媒体上引起了Node开发者的恐慌。\n不用说，Deno和Node.js之间有很多不同之处。而且Deno不一定是Node.js的替代品(到目前为止)，但许多人无论如何都惊慌失措。我对恐惧的原因进行了分类，并分别对每种原因进行了分析。\n造成这种情况的一个主要原因是因为这两款产品的创作者都是一样的。很多人认为瑞安·达尔不会花时间在诺德身上。因此，Node.js正在消亡。\n虽然这是一个合理的假设，但它从根本上说是错误的。js有一个巨大的社区，这个社区比许多其他社区要大得多。因此，它不是一个人的项目。\n在相反的论点上，一些人将Dahl的存在比作Node.js，将Linus Torvalds的存在比作Linux。我告诉你，这根本不是一个正确的比较。\n首先，Dahl自2012年以来就没有参与过Node.js。但在过去的30年里，托瓦尔兹一直在以这样或那样的形式致力于Linux的研究。\n其次，不能保证即使Torvalds离开内核社区，Linux也会消亡。此外，不要将2018年9月Linux社区的混乱与托瓦尔兹事件相提并论。2018年的混乱是一个黑暗而可怕的事件，其中一部分是关于托瓦尔兹的言论。\n最后，托瓦尔兹也创建了Git，但没有对其进行维护。他刚刚完全交出了。吉特死了吗？\njs社区被誉为无人维护的库的坟墓。无意冒犯，每天诞生或死亡的图书馆数量超过了任何人的细胞数量。\n每隔一天就会创建一个新的框架，它有时会成为社区的事实，然后突然之间，它就不需要维护了。通过快速搜索，你可以在GitHub中找到几十个没有人维护的星星。\n有人可能会说，如果这是社区的现状，是什么让我们认为同样的事情不会发生在Node.js身上呢？\n答案是这要视情况而定。这取决于社区和企业的支持。不一定要通过货币资助，但更多的贡献和支持是明智的。如果广泛使用Node.js的公司雇佣一些人积极为项目做出贡献，那么Node.js的死亡几乎是不可能的。让我给你举个例子。爪哇已经存在了25年了。除了在几乎所有设备上大量使用之外，Java长寿的原因之一是企业的支持。不仅甲骨文公司支持，亚马逊、IBM和许多其他公司也支持。\n但我们不要忘记，许多使用Node.js的公司大多是生命周期短、预算紧张的初创公司。我们不能说明那些公司的贡献。它需要一家像Facebook或谷歌这样的大而富有的公司。\n如果社区分道扬镳和/或大公司不支持Node，这是一个合理的担忧，可能会使Node走下坡路。\n当然了。那是真的。通过构建Node.js获得了丰富的经验和知识。所以如果德诺更好也就不足为奇了。但是，一项技术不仅仅是根据它的能力来评估的。这只是其中一个因素。使用和支持是更重要的角色。而德诺并不完全在那里，因为它还很年轻。所以node.js不会立即死亡。\n但我们还是做最坏的打算吧。然后会发生什么呢？阅读该😀的下一节。\n在我的研究中，我发现有些人讨论Node.js的死亡就像一个人刚刚去世一样。嗯，一种语言或技术的消亡并不等同于一个过关的人。这不是一天之内发生的。\n技术的改变通常需要数年时间，因为公司不可能在一夜之间或一个月内更换他们的产品，然后再切换到新的产品。节点在这里也不例外。js库不能与Deno一起工作，构建它需要时间。此外，不要忘记专业知识的可用性。目前，没有多少人熟悉德诺来打造生产规模的产品。所有这一切至少需要几年时间。\n即使Node比预期更早死亡，它也会有就业市场。当然不同于COBOL。但至少在接下来的5年里，它会有工作机会。这应该会为节点开发人员提供足够的缓冲区来进行切换。另外，因为Deno和Node都与JS世界相关，所以从一个切换到另一个不会很乏味。\nNode.js至少在未来五年内不会消亡，目前社交媒体上关于其消亡的争论是毫无意义的。虽然有一些关于其衰落的猜测，但到目前为止还没有一个是确定的。即使假设对Node.js不利，而对Deno有利，公司仍然需要时间切换到新技术，并且需要构建库。如果你很担心甚至好奇，我强烈建议你开始玩弄迪诺。\n最后，我想澄清一下，我对德诺没有意见。这是一个很有前途的好项目。我写这篇文章的目的不是贬低Node.js开发人员的压力，而是减轻他们的压力。", "note_en": "In the last couple of days, a new discussion about Node.js has surfaced after the first Deno release. In social media and technical forums, many developers are now talking about the destiny of the Node.js. And even some speculating that Node.js is going to die soon. Or eventually will. While I am not a foreteller, I have some insights to share with you. I particularly try to answer the “Is Node.js dying” question. I cover how the current panic over the death of Node.js is irrelevant even though there is supporting evidence for it.\n  Whenever a language or technology is born, many immediately start to talk about its death. You don’t believe me? Just open Google and type\n  Literally, for any technology, you can find a bunch of articles that unarguably many are trash. Even for new technologies such as Kubernetes. Node.js is not an exception, either. But what heated the “Node.js death” topic is the first release of Deno.\n If you don’t know what Deno is, just read the next section to have an idea about it. That helps you understand the atmosphere over the current panic.\n  Deno is a Javascript runtime written by the Node.js creator,  Ryan Dahl. The name is the natural sort of the word “Node” 🙂\n The project was announced by Dahl in 2018 during his talk “10 Things I Regret About Node.js”. The Deno is written in Rust, by the contrast of Node.js that is written in C/C++.\n Deno has a single execution file with the zipped size of ~15 MB, at the time writing this article.\n  Additionally, it does not have an NPM like or a separate external package manager. It’s built-in.\n Deno runs in a sandbox mode (means no direct access to file, network, and other IOs), so any permission should be explicitly given.\n   The main reason that suddenly start to think that Node.js is dying because version 1.0 of Deno released on 13th May 2020. Even though the project is been around for over two years, this release caused panic for Node developers in social media.\n Needless to say, there are lots of differences between Deno and Node.js. And Deno is not necessary a Node.js replacement (as of now), but many panicked anyway. I categorize the fear reasons and go through each separately.\n  One of the main reasons for the current situation is because both products have the same creator. And many think that Ryan Dahl won’t spend any time over Node. Thus, Node.js is dying.\n While this is a valid assumption, it is fundamentally wrong. Node.js has a gigantic community that is much larger than many others. Thus, it is not a single person project.\n On the counter-argument, some compare Dahl’s existence to Node.js with Linus Torvalds’s existence to Linux. I tell you, that’s not a correct comparison at all.\n First of all, Dahl has not been involved with Node.js since 2012. But Torvalds’s been working on Linux over the last 30 years in one form or another.\n Second of all, there’s no guarantee that even if Torvalds leaves the Kernel community, Linux will die. And also don’t equalize the September 2018 mayhem in the Linux community with the Torvalds exit. The 2018 chaos was a dark monstrous event that a part of it was about Torvalds qutting.\n Lastly, Torvalds also created Git but is not maintaining it. He just handed over entirely. Has Git died?\n  Node.js community has a reputation for being a graveyard of unmaintained libraries. With no offense, the number of libraries that are born or die everyday outnumbers any person’s cells.\n Every other day a new framework is created that becomes the community defacto for sometimes and then out of the blue, it goes unmaintained. With a quick search, you can find dozens of them in GitHub with many stars that no one is maintaining them.\n One may say if this is the current situation in the community what makes us think the same won’t happen to Node.js?\n The answer is it depends. It depends on the community and corporations’ supports. Not necessary through monetary funding, but more contribution and support wise. If the companies that are extensively using Node.js hire some people to actively contribute to the project, then the death of Node.js is almost impossible. Let me give you an example. Java’s been around for 25 years. Besides its massive use on almost all devices, one of the reasons that Java longevity is due to corporations’ support. Not only the Oracle’s but also Amazon’s, IBM’s, and many other companies’ support.\n But let’s not forget that many companies use Node.js are startups that mostly have short lifespans and are on tight budgets. We can’t account for those companies’ contributions. It requires a big, wealthy company like Facebook or Google.\n If the community diverge and/or big corporations do not support Node, this is a valid concern that can put Node to the decline path\n  Of course. That’s true. Wealth of experience and knowledge gained over building Node.js. So there’s no surprise if Deno is better. But a technology is not only evaluated by its capabilities. That’s just one of the factors. Usage and support are more important players. And Deno is not quite there because it is young. So node.js won’t be dying immediately.\n But let’s assume the worst. Then what happens? Read the next section for that 😀\n  In my research, I’ve found that some people discuss the death of Node.js as if a person has just died. Well, the death of a language or technology is not the same as a person passing. It doesn’t happen in a day.\n Change of technology usually takes years because companies can’t replace their products overnight or in a month and then switch to a new one. Node is not an exception here. Node.js libraries don’t work with Deno and it takes time to build. Also, don’t forget about expertise availability. Currently, not many people are familiar with Deno to built production scale products. All of these will take a few years at least.\n  Even if the Node dies sooner than anticipated, there would be a job market for it. Of course not similar to COBOL. But at least for the next 5 years, there are jobs for it. That should provide enough buffer to Node developers to switch. Also since both Deno and Node are related to the JS world, switching from one to another won’t be tedious.\n  Node.js is not dying at least for the next five years and the current argument over its death in social media is meaningless. While there are some speculations over its decline, none of them so far are definitive. Even assuming the worst against Node.js and in favor of Deno, companies still need time to switch to the new technology and libraries need to be built. If you are worry or even curious, I highly recommend you start to toy around with Deno.\n In the end, I want to clarify that I have no issue with Deno. It is a good project with a bright future. My intention in writing this article is not to diss Deno but to alleviate Node.js developers’ stress.", "posttime": "2020-05-20 03:34:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "node,js", "title": "Node.js快要死了吗？", "title_en": "Is Node.js Dying?", "transed": 1, "url": "https://www.geekyhacker.com/2020/05/19/is-node-js-dying/", "via": "", "real_tags": ["node", "js"]}, {"category": "", "categoryclass": "", "imagename": "a37d053edd8cb37a6c884a7d0eb6deff.jpg", "infoid": 1002852, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着全球旅行限制的实施，我们推出了一个新的系列，通过镜头的世界，在这个系列中，摄影记者帮助你虚拟地把你带到我们星球上一些最美丽、最有趣的地方。本周，苏珊·赖特(Susan Wright)分享了意大利阿布鲁佐地区收获藏红花的照片集。\n意大利的阿布鲁佐地区虽然偏远，但也未能幸免于冠状病毒大流行的破坏。该地区已报告数千例病例，数百人死亡。\n然而，几年前，在比较愉快的时候，我去了意大利亚平宁山脉以东的这个与世隔绝的角落，拍摄一年一度的秋季藏红花收获。\n这是我第一次穿越这个国家崎岖的中部山脉-去荒野的一边，远离受欢迎的旅游景点，那里的地形原始，沉睡的中世纪村庄散布在美丽的山麓。\n我在澳大利亚的农村环境中长大，对意大利农业社区着迷：他们与悠久的传统有着深厚的联系，并以富有感染力的爱和激情将他们的土地和文化融入其中。\n意大利各地的这些乡村社区聚集在一起参加他们一年一度的节日，也就是众所周知的Sagre，这是多么美妙啊，这个节日通常致力于一种特定的当地食物。\n乔瓦尼娜·萨拉(Giovannina Sarra，通常被称为藏红花女王)和她的家人在家里招待了我和其他几个人。清晨，在纳维利高原，我们在雾蒙蒙、紫罗兰色的田野中散开扇形，参与收割。\n藏红花取自藏红花的柱头，是一种有利可图的作物。也被称为oro roso，或红金，大约在13世纪左右首次引入该地区-从西班牙进口。它被誉为一种充满异国情调的香料，在米兰和威尼斯等较富裕的地区和城市销售，在法国、德国和奥地利也有销售。\n藏红花是在日出前几个小时收获的，而藏红花的花瓣仍然关闭；这使得花更容易采摘，并有助于保护它们珍贵的深红色柱头。精致的花蕾是手工采摘的，放在篮子里。\n稍后，在同一天，柱头-每朵花三根细丝-从潮湿的花瓣上分离出来。这是一个微妙的过程，需要几个小时的熟练和耐心的手。\n晚上，在明火上，明亮的丝状柱头在铁丝篮中烘干，这一过程增加了颜色和味道的丰富性。\n制造一盎司藏红花粉大约需要4000朵花-这意味着在出售香料的微小容器中包装着惊人的劳动力。\n不久前，当我坐下来端着一盘令人垂涎的米兰调味饭(一道注入了藏红花的菜肴)时，我回忆起与吉娜·萨拉(Gina Sarra)和她的家人度过的那个雾蒙蒙的清晨。\n得知萨拉女士于2018年去世，我感到很难过。她和她的家人在20世纪70年代初帮助组织的藏红花合作社现在正在与市场关闭作斗争。意大利是欧洲冠状病毒爆发的中心，几周来，意大利的生活还需要很长时间才能恢复正常。\n但毫无疑问，像萨拉这样的家庭总有一天会恢复他们的萨格雷的力量-以及在纳维利高原和更远的田野上世世代代延续的许多传统。\n苏珊·赖特(Susan Wright)是一名居住在意大利的澳大利亚摄影师，她自2003年以来一直生活在意大利。你可以在Instagram上关注她的工作。", "note_en": "With travel restrictions in place worldwide, we’ve launched a new series,   The World Through a Lens , in which photojournalists help transport you, virtually, to some of our planet’s most beautiful and intriguing places. This week, Susan Wright shares a collection of photographs from a saffron harvest in the Abruzzo region of Italy.\n  Italy’s Abruzzo region, although remote, has not been spared from the devastation of the coronavirus pandemic. The area has reported  thousands of cases and  hundreds of deaths.\n A few years ago, though, in happier times, I traveled to this isolated corner of Italy, east of the Apennine Mountains, to photograph the annual autumn saffron harvest.\n  It was my first adventure across the country’s rugged central mountains — to the wilder side, away from the popular tourist spots, where the terrain is pristine and sleepy medieval villages are scattered throughout the pretty foothills.\n  Having grown up in a rural setting in Australia, I was fascinated by the Italian agricultural communities: their deep connection to centuries-old traditions, and the infusion of their land and culture with an infectious love and passion.\n How wonderful that these rural communities throughout Italy come together for their annual festivals, known as sagre, which are often dedicated to a specific local food.\n Giovannina Sarra (often called the  Saffron Queen) and her family hosted me and a handful of others at their home. Early in the morning, in the Navelli plateau, we fanned out among the misty, violet-tinged fields and participated in the harvest.\n  Saffron, which is taken from the stigmas of the saffron crocus, is a lucrative crop. Also called oro rosso, or red gold, it was first introduced into the region around the 13th century — an import from Spain. Prized as an exotic spice, it was sold in the wealthier regions and cities of Milan and Venice, and abroad in France, Germany and Austria.\n  Saffron is harvested in the hours just before sunrise, while the crocus petals remain closed; this makes the flowers easier to pick and helps protect their precious crimson-red stigmas. The delicate buds are handpicked and placed into baskets.\n  Later, on the same day, the stigmas — three tiny threads per flower — are separated from the moist petals. It’s a delicate process that takes hours with a skilled and patient hand.\n   In the evening, over an open wood fire, the bright threadlike stigmas are dried in wire baskets, a process that adds to the richness of both the color and the flavor.\n  It takes roughly 4,000 flowers to make one ounce of saffron powder — which means there’s a staggering amount of labor packed into the tiny containers in which the spice is sold.\n  Not long ago, when I sat down to a mouthwatering plate of  Risotto alla Milanese (a dish that’s infused with saffron), I recalled the early misty morning I spent with Gina Sarra and her family.\n Ms. Sarra, I was saddened to learn,  died in 2018. The  saffron cooperative she and her family helped organize in the early 1970s is struggling now with market closures. And it will be a long time before life in Italy — for many weeks the  epicenter of the coronavirus outbreak in Europe — returns to normal.\n  But there’s no doubt that families like the Sarras will one day return to the restorative power of their sagre — and to the many traditions that have endured for generations in the fields of the Navelli plateau and beyond.\n Susan Wright  is an Australian photographer based in Italy, where she has lived since 2003. You can follow her work on   Instagram .", "posttime": "2020-05-20 03:19:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "观看,italy,藏红花", "title": "近距离观看意大利的藏红花丰收", "title_en": "An Intimate Look at Italy’s Saffron Harvest", "transed": 1, "url": "https://www.nytimes.com/2020/05/12/travel/italy-saffron.html", "via": "", "real_tags": ["观看", "italy", "藏红花"]}, {"category": "", "categoryclass": "", "imagename": "2a22454be31d9434f9cefeed301808b5.png", "infoid": 1002850, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年，在一个全虚拟构建会议上，我们发布了许多关于Windows Subsystem for Linux(WSL)的令人兴奋的消息！这篇博客为您提供了所有WSL新闻的摘要，包括现在可用的和未来可以期待的。\n对Windows Subsystem for Linux 2(WSL 2)发行版的支持将于本月在Windows 10 2020年5月更新中提供。\n4年前，在Build 2016上，微软宣布了Windows Subsystem for Linux-WSL(当时也称为“Bash on Ubuntu on Windows”)，这让世界大吃一惊。WSL使Windows用户可以直接在Windows中运行原生的、未经修改的Linux命令行工具和应用程序，以及他们喜欢的所有Windows应用程序和工具。WSL的使用量已经从最初只有几千人下载第一个预览版，发展到今天超过350万台月度活跃设备！\n然而，我们希望WSL能做得更多--运行所有的Linux应用程序和工具，并更快地运行应用程序和工具。在Build 2019上，WSL团队发布了WSL 2的第一个预览版，它利用Windows的Hypervisor平台中的新功能在容器中运行发行版和工具，该容器位于真正的Linux内核映像之上，该映像由Microsoft构建和交付，托管在一个轻量级VM中，从冷启动不到2秒！这意味着WSL2提供了与真正的Linux内核的完全系统调用兼容性，并且比WSL的早期版本快3-6倍。您可以使用以下命令轻松地将任何WSL发行版的版本设置为使用WSL2：wsl.exe--set-version&lt；DistroName&gt；2。\n社区的反应是巨大的，坦率地说，是积极压倒性的-最诚挚地感谢运行WSL2、提交问题和要求特性的每个人，您帮助我们使WSL2比我们希望的更好！\n在WSL 2宣布后不久，Docker Inc.。决定在WSL 2上托管Docker Desktop for Windows！经过一段成功的预览期后，Docker宣布Docker Desktop for Windows在2020年5月10日的Windows更新上安装时，将默认在WSL 2上运行，这也将把Docker Desktop带给Windows Home用户。\n对WSL 2上的主机Docker的这一更改将导致Containers更快地启动，同时由于WSL 2与完整的虚拟机相比占用更少的资源，因此在主机上消耗的资源更少。\n您很快就可以使用单个命令安装WSL。只需打开Windows终端并输入`wsl.exe-install`\n关于WSL的一个常见抱怨是它不容易找到并启用。我们同意这一点，这就是为什么我们正在对wsl.exe命令行工具进行一些改进，以帮助您安装WSL。很快，您就可以通过在命令行中输入：wsl.exe--install来简单地安装WSL了！\n此命令将添加到每台Windows计算机上，因此您只需打开一个以管理员权限提升的终端窗口，然后运行wsl.exe--install。从那里将启用WSL可选组件，并且您指定的发行版将在重启时自动下载和安装。\n在接下来的几个月里，你可以在Windows Insiers Fast Ring中看到这个功能的初始版本。\n我们还将在首次安装WSL时引入更改，使WSL2成为新的默认分发类型。WSL2带来了重大改进，我们发现我们的Insider分支机构上的大多数用户都在使用WSL2发行版。在开发wsl.exe--install时，将其默认为人们正在使用的WSL 2是有意义的，当启用‘Windows Subsystem for Linux’可选组件时，我们也将其包括在任何新安装的WSL中。在接下来的几个月里，您将在wsl.exe(安装改进)的同时，在Insiers Fast Ring中看到这些更改。\n从我们的第一个版本开始，将CUDA和/或GPU计算支持添加到WSL一直是我们最受欢迎的功能！在过去3年多的时间里，WSL、虚拟化、DirectX、Windows驱动程序团队和我们的芯片合作伙伴一直在努力进行复杂的工程壮举，以交付此功能。\n这就是为什么我们很高兴地宣布，我们将在未来几个月内开始在Windows10Insider版本中预览对WSL的GPU计算支持！\nDirectML团队将发布带有DirectML后端的TensorFlow预览包，支持跨各种Windows硬件的AI&amp；ML工作负载的硬件无关加速-DirectML还将支持本机Windows，包括Windows上的TensorFlow！\n此预览版发布后，您只需确保安装了最新的Windows Insider Fast Build，安装了WSL 2，并从硬件供应商为您的GPU安装了正确的驱动程序，然后您就可以开始在WSL中开发、培训和测试您的机器学习和AI模型了！\n这一变化将在接下来的几个月内发布给Windows Inside Fast Ring。有关此更改的所有详细信息以及它是如何实现的，请阅读DirectX开发人员的博客文章。\n我们另一个最多产的请求之一是不仅要支持命令行应用程序，还要支持Linux GUI应用程序。例如，一些用户希望在Linux环境中运行他们首选的Linux GUI文本编辑器或IDE，并处理本地存储在发行版文件系统中的代码，或者简单地在他们的Windows机器上开发Linux GUI应用程序。\n我们的目标是让您能够与Windows应用程序一起在桌面上无缝运行Linux GUI应用程序。这将使您能够使用Linux应用程序编辑、构建和运行代码，在Python中可视化数据绘图，甚至使用针对Linux环境优化的应用程序。\n在Build中，我们演示了这项工作的早期版本，直接从WSL运行了几个GUI示例应用程序，比如Eye of Gnome、Gedit和MPV媒体播放器。这些应用程序连接到在WSL内部运行的Wayland服务器，该服务器与Windows主机上的RDP客户端通信。您可以在下面的屏幕截图中看到这一点，其中我们同时在WSL和Outlook中运行GNOME文件管理器。\n这些变化都在WSL的团队路线图上，您可以期待在2020年假期之前听到更多关于这项工作的信息。\n总而言之，一旦您更新到2020年5月10日的Windows 10更新，您将完全支持WSL 2发行版！如果你加入了Windows Insiders Fast Ring，你将在接下来的几个月内准备好开始接收最新的WSL功能，包括新的安装体验和GPU计算。\nWSL有很多令人兴奋的新闻和功能，所以请继续关注这个博客，了解任何重大公告的细节。你可以在Twitter@Craigaloewen上关注我，也可以在Twitter上关注WSL团队的成员，了解那里的任何新闻。请查看Kevin Gallo的博客文章，了解Build中所有针对Windows开发人员的新闻。感谢您对WSL的支持！", "note_en": "This year at an all virtual BUILD conference we had many exciting announcements for the Windows Subsystem for Linux (WSL)! This blog post gives you a summary of all the WSL news, including what’s available now and what you can expect in the future.\n     Support for Windows Subsystem for Linux 2 (WSL 2) distros is coming this month in the Windows 10 May 2020 Update\n 4 years ago, at Build 2016, Microsoft surprised the world by announcing Windows Subsystem for Linux – WSL (also known at the time as “Bash on Ubuntu on Windows”). WSL enables Windows users to run native, unmodified Linux command-line tools and apps directly in Windows, alongside all their favorite Windows apps and tools. WSL usage has grown enormously from initially just a few thousand people downloading the first preview build to more than 3.5 million monthly active devices today!\n However, we wanted WSL to do more – to run all Linux apps and tools, and to run apps and tools faster. At Build 2019, the WSL team unveiled the first preview of WSL 2, which utilizes new capabilities in Windows’ Hypervisor Platform to run distros and tools in containers,  atop a real Linux kernel image that is built and delivered by Microsoft, hosted in a lightweight VM, which boots from cold in less than 2s! This means that WSL 2 delivers full system call compatibility with a real Linux kernel and is 3-6x faster compared to earlier versions of WSL. You can easily set the version of any WSL distro to be using WSL 2 with the command:  wsl.exe --set-version &lt;distroName&gt; 2.\n The response from the community has been huge and, frankly, positively overwhelming – sincerest thanks to everyone who ran WSL 2, filed issues, and asked for features, you’ve helped us make WSL2 even better than we hoped it could be!\n   Shortly after WSL 2 was announced, Docker Inc.  decided to host Docker Desktop for Windows atop WSL 2! Following a successful preview period, Docker has announced that Docker Desktop for Windows will now default to run atop WSL 2 when installed on the Windows 10 May 2020 update, which will bring  Docker Desktop to Windows Home users as well.\n This change to host Docker on WSL 2 will result in containers booting up faster, while consuming fewer resources on the host machine due to WSL 2’s more lightweight footprint vs. full VMs.\n   You’ll soon be able to install WSL with a single command. Just open a Windows Terminal and enter `wsl.exe –install`\n One common complaint about WSL is that it’s not easy to find and enable. We agree, which is why we’re working on some improvements to the wsl.exe command-line tool to help you install WSL. Soon you will be able to simply install WSL by entering:  wsl.exe --install in your command-line!\n  This command will be added to every Windows machine so that all you need to do is open a Terminal window elevated with administrator privileges and run  wsl.exe --install. From there the WSL optional components will be enabled, and your specified distro will be downloaded and installed for you automatically upon restart.\n You can expect to see initial releases of this feature in the next few months in the Windows Insiders Fast Ring.\n  We’re also introducing the change to make WSL 2 the new default distribution type when installing WSL for the first time. WSL 2 brings significant improvements and we found that the majority of our users on Insider branches are using WSL 2 distros. When developing  wsl.exe --install it made sense for it to default to what people are using: WSL 2, and we’ve included this as well for any new installations of WSL when enabling the ‘Windows Subsystem for Linux’ optional component. You’ll see these changes in the Insiders Fast ring in the next few months alongside the  wsl.exe --install improvement.\n  Adding  CUDA and/or  GPU Compute support to WSL has been our #1 most requested feature since our first release! Over the last 3+ years, the WSL, Virtualization, DirectX, Windows Driver teams, and our silicon partners have been working hard on a complex engineering feat to deliver this capability.\n This is why we’re thrilled to announce that we will start previewing GPU compute support for WSL in Windows 10 Insider builds within the next few months!\n  DirectML The team will be releasing a preview package of TensorFlow with a DirectML backend enabling hardware agnostic acceleration of AI &amp; ML workloads across the breadth of Windows hardware – DirectML will also support native Windows too, including TensorFlow on Windows!\n Once this preview is released, you will simply need to ensure that you have the latest Windows Insider Fast build, WSL 2 installed, install the correct driver for your GPU from the hardware vendor, and then you’ll be ready to start developing, training and testing your machine learning and AI models inside of WSL!\n  This change will be released to the Windows Insiders Fast ring in the next few months. For all the details of what this change means and how it was made possible, please read  the DirectX Developer blog post.\n  One of our other most prolific requests is to support not just command-line apps, but Linux GUI apps as well. For example, some users want to run their preferred Linux GUI text editor or IDE in a Linux environment and work on their code stored locally within their distro’s filesystem, or simply develop Linux GUI apps on their Windows machine.\n Our goal is for you to be able to run Linux GUI apps on your desktop seamlessly alongside your Windows apps. This will enable you to use Linux apps to edit, build, and run your code, visualize data plots in Python, or even use applications that are optimized for a Linux environment.\n At BUILD we demonstrated an early version of this work, running a few GUI sample apps directly from WSL such as  Eye of Gnome,  gedit and the  mpv media player. These apps connected to a wayland server running inside of WSL, which communicated with a RDP client on the Windows host. You can see a screenshot of this in action below where we’re running the GNOME file manager in WSL and Outlook side by side.\n  These changes are on the WSL’s team roadmap and you can expect to hear more about this work by holiday 2020.\n  To summarize, once you update to the Windows 10 May 2020 Update you’ll have full support for WSL 2 distros! If you join the Windows Insiders Fast Ring you’ll be ready to start receiving the latest WSL features including the new install experience and GPU compute within the next few months.\n There’s lots of exciting news and features coming to WSL, so please stay tuned to this blog for the details of any big announcements. You can follow me on Twitter  @craigaloewen or  members of the WSL team that are on Twitter for any news there as well. Please check out  Kevin Gallo’s blog post for all of the Windows developer focused news from BUILD. Thank you for supporting WSL!", "posttime": "2020-05-20 03:18:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,windows,linux,app,支持", "title": "Windows将开始支持Linux GUI应用程序", "title_en": "Windows will start supporting Linux GUI apps", "transed": 1, "url": "https://devblogs.microsoft.com/commandline/the-windows-subsystem-for-linux-build-2020-summary/#wsl-gui", "via": "", "real_tags": ["程序", "windows", "linux", "app", "支持"]}, {"category": "", "categoryclass": "", "imagename": "4123f79b90fcb63d8fc7b2cf8c0c5bb1.jpg", "infoid": 1002849, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软在Windows10中增加了一个内置的软件包管理器。该公司今天宣布Windows Package Manager将在Build 2020中发布，这是一个新的本机软件包管理器，将被内置到Windows10中。\n对于那些不熟悉的人来说，软件包管理器允许用户在他们的机器上快速安装软件，而不必手动转到每个应用程序的网站或通过Microsoft Store。\nWindows软件包管理器是一个新工具，用户可以使用它来实现这一点。使用新的“Winget”命令，Windows软件包管理器会自动获取您要下载的应用程序的最新版本，验证其真实性，并将其安装在您的计算机上。例如，要安装最新版本的Windows终端(顺便说一下，它刚刚升级到1.0)，您只需运行“Winget install Terminal”即可安装最新版本的Windows终端，而无需前往微软商店。您也可以使用“Winget Search”来搜索应用程序。以下是其他可用命令：\n微软将提供自己的第一方存储库，其中包括流行的Windows10应用程序，你也可以提交一个拉取请求来添加新的应用程序(带有清单文件)。该公司还将允许用户从第三方存储库下载应用程序，因此你也可以从第三方来源下载应用程序。\n微软表示，该公司制作自己的软件包管理器而不是为现有的软件包管理器做出贡献的主要原因是安全。“我们关心的一个关键问题是如何建立一个受信任的应用程序存储库。我们会自动检查每一份舱单。我们利用SmartScreen、静态分析、SHA256散列验证和一些其他过程来降低恶意软件进入存储库和进入您的机器的可能性，“微软高级程序经理Demitrius Nelon说。\n“如果您对当前的包管理器感到满意，请继续使用它。我们的目标是让在Windows上安装软件对每个人都更好，“Nelon补充说。\nWindows Package Manager支持Windows10版本1709及更新版本，一旦版本达到1.0，它将预装Windows10的桌面应用安装程序。目前，用户可以使用Windows软件包管理器，方法是通过Windows Insider程序从此处的GitHub存储库下载Windows软件包管理器，或者通过将其Microsoft帐户电子邮件地址发送到[受保护的电子邮件]来加入Windows软件包管理器Insider计划。\n高级会员对新闻帖子的评论将以提升状态为特色，从而提高他们的可见性。此选项卡允许您与其他高级会员一起参与高级评论。注册以加入其他高级会员提升对话！\n注册或订阅。\n您没有登录但想要加入对话吗？成为瑟罗特高级或基本用户参与。\n登记簿", "note_en": "Microsoft is adding a built-in package manager to Windows 10. The company today announced Windows Package Manager at Build 2020, and it’s a new, native package manager that is going to be built into Windows 10.\n A package manager, for those unfamiliar, allows users to quickly install software on their machine without having to manually go to every application’s website or through the Microsoft Store.\n  Windows Package Manager is a new tool that will allow users to do exactly that. With the new “winget” command, Windows Package Manager automatically gets the latest version of an app you want to download, validates its authenticity, and installs it on your machine. For example, to install the latest version of Windows Terminal ( which just hit 1.0 by the way), you can simply run “winget install terminal” and install the latest version of the Windows Terminal without having to go to the Microsoft Store. You can also use “winget search” to search for an app. Here are the other available commands:\n  Microsoft will offer its own first-party repository that includes popular Windows 10 apps, and you can also submit a pull request to add new apps (with manifest files). The company will also allow users to download apps  from third-party repositories, so you will be able to pull apps from a third-party source as well.\n Microsoft says the main reason behind the company making its own package manager instead of contributing to existing ones was security. “One critical concern we had was how to build a repository of trusted applications. We are automatically checking each manifest. We leverage SmartScreen, static analysis, SHA256 hash validation and a few other processes to reduce the likelihood of malicious software making its way into the repository and onto your machine,” said Demitrius Nelon, a senior program manager at Microsoft.\n “If you are happy with your current package manager, keep using it. Our goal is to make installing software on Windows better for everyone,” Nelon added.\n Windows Package Manager supports Windows 10 version 1709 and newer and it will come pre-installed with Windows 10’s Desktop App Installer once it reaches version 1.0. For now, users will be able to use the Windows Package Manager by downloading it  from the GitHub repository here, via the Windows Insider program, or by joining the Windows Package Manager Insider program by sending their Microsoft Account email address to   [email protected].\n Premium member comments on news posts will feature an elevated status that increases their visibility.This tab would allow you to participate in Premium comments with other premium members.Register to join the other Premium members in elevating the conversation!\n  Register or Subscribe\n  Don&#39;t have a login but want to join the conversation? Become a Thurrott Premium or Basic User to participate\n  Register", "posttime": "2020-05-20 03:17:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,微软,cli,offer,windows", "title": "微软将提供其自己的CLI包管理器，可选择第三方回购", "title_en": "Microsoft will offer its own CLI Package Manager with option of 3rd party repos", "transed": 1, "url": "https://www.thurrott.com/windows/windows-10/236301/windows-10-is-getting-its-own-built-in-package-manager", "via": "", "real_tags": ["microsoft", "微软", "cli", "offer", "windows"]}, {"category": "", "categoryclass": "", "imagename": "be543a5b2ef2bf5c03fc3e62fc6bc13a.jpg", "infoid": 1002848, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "二月的一个晚上，我去巴尔的摩地下科学空间听讲座，这是一个社区实验室，以前是瓶盖工厂。就像全国其他几十个“生物空间”一样，这个实验室被称为“生物空间”，是由一种颠覆性的业余精神激发起来的。任何人都可以去那里学习，然后做那种尖端的板凳科学-基因编辑，合成生物学-通常仅限于资金雄厚的学术机构和私营公司。里面有一块黑板，上面画着一个微生物和一个双螺旋的卡通图画，欢迎新来者，但实验室区域已经装修得很整齐了。有一台实时PCR机器，科学家们可以用它复制数百万份特定的DNA链，以便研究和操作它。实验室执行主任丽莎·谢菲尔(Lisa Scheifele)告诉我：“我们没有太多超级花哨的东西，”不过，这可能取决于你对层流引擎盖(根据实验室网站，“用于处理你真的不想被污染的细胞和培养物”)、Alpha Innotech凝胶成像仪或负70度储存冰柜等物品的想象力有多高。“我们有我们需要的东西，”Scheifele说。“你可以在这里做大部分的遗传学研究。你可以做微生物学。“。\n那天晚上，20多人鱼贯而入，聆听33岁的扬恩·洪·德·克马德克(Yann Huon De Kermadec)谈论开放胰岛素项目(Open Insulin Project)，他希望为该项目招募当地志愿者。他今年33岁，拥有格勒诺布尔大学(University Of Grioble)蛋白质生物化学博士学位。该项目于2015年在奥克兰的生物空间柜台文化实验室(BioSpace Counter Culture Labs)发起，针对美国医疗体系中的一个彻头彻尾的失败提出了一个“生物黑客”方案：胰岛素的成本不断上涨。胰岛素是一种合成形式的荷尔蒙，750万糖尿病患者必须每天注射这种荷尔蒙才能生存。它的目标是复制由礼来公司、诺和诺德和赛诺菲三家制药公司在美国制造和销售的胰岛素，并公布一项安全生产胰岛素的协议。这三家美国制造商最近的要价都在每瓶300美元以上。最终，该项目希望推出一个由患者和工人拥有的合作药物网络，该网络将生产小批量胰岛素，并向糖尿病患者提供每瓶约7美元的价格。至少，Open Insulin想要证明这样的药物密码破译是可以做到的，希望它能揭开药物生产过程的神秘面纱。\n巴尔的摩的讲座是在19年危机需要社会疏远的几周前举行的，所以我们紧紧地坐在半圆形里。Pepperidge农场的饼干和混合坚果摆在桌子上，旁边是一本出售的书，书名为“零到遗传工程英雄：在Makerspace的家庭、学校和学校编程细菌的初学者指南”(Zero to Genetic Engineering Hero：The初级指南to Programming in Home，School&Amp；in the Makerspace)。一张传单宣传了一项名为“生物打印突破”的活动，承诺将“向新的受众和应用介绍3D组织工程”。在人群中，有一些看起来很时髦的年轻夫妇，一个穿着大衣的中年非裔美国人，还有一个61岁的常客，他在计算机安全部门工作，喜欢社区实验室的场景，因为他告诉我，你可以想说多少就说多少科学，而在“正常的社交情况下，人们开始逃跑”。\nHuon de Kermadec戴着克拉克·肯特(Clark Kent)的眼镜，穿着牛仔裤和灰色连帽衫，他自我介绍说自己是“一个拥有我博士学位的法国人，当我妻子找到工作时，他就跟着她。”(他与也在Open Insulin工作的路易丝·拉萨勒(Louise Lassalle)结婚，并来到美国劳伦斯·伯克利国家实验室(Lawrence Berkeley National Laboratory)攻读生物化学博士后学位。)。Huon de Kermadec最初被Open Insulin吸引是因为他认为实验室的工作会很有趣-他热爱生物学工艺，但对发表论文的学术压力感到恼火。他向听众指出，近一半的美国成年人患有糖尿病或高血糖水平，但目前美国还没有胰岛素的仿制药，也没有任何机制来控制价格，就像加拿大和欧洲一样。他说，“如果三大公司中有一家涨价，他们都会涨价.”“因为他们能做到。”他展示了一张图表的幻灯片，该图表描绘了胰岛素价格的指数曲线。1996年，礼来公司推出了这种荷尔蒙的合成版Humalog，每瓶10毫升，售价21美元；在接下来的20年里，零售价上涨了10倍。赛诺菲的Lantus和诺和诺德的Novolog的成本也同样飙升。(礼来公司最近宣布，在-19疫情期间，它将把每月自掏腰包购买胰岛素的成本降低到35美元，但这种药物是该公司重要的收入来源，价格可能会反弹。)。1型糖尿病患者通常每月需要两到三瓶胰岛素。即使他们有保险，也不一定能支付全部费用。宾夕法尼亚大学研究人员于2018年进行的一项研究\nHuon de Kermadec叹了口气。“你可以找到黑市的方法，”他说。“但谁能接触到这一点呢？你不能改变体制。“。他在房间前面踱来踱去，接着说：“我们的目标是更多地改变这件事的制作方式。这不一定是大制药公司利用人们的痛苦的情况。我们可以设计出更好的系统。“。\nOpen Insulin有它的批评者，而不仅仅是制药业的游说者。耶鲁大学公共卫生学院(Yale School Of Public Health)流行病学教授格雷格·贡萨尔维斯(Gregg Gonsalves)是该组织的前成员，该组织在危机期间对药物开发采取了对抗性、反制度主义的立场。然而，贡萨尔维斯告诉我，DIY医学“就像GoFundMe的基本医疗保健活动--这是系统崩溃的标志。”他继续说，DIY运动“正在走向绝望的死胡同，当所有的精力和愤怒可能更好地集中在与政客打交道时”，并为普及医疗保健而战。\n然而，考虑到美国医疗保健体系的严重缺陷，Open Insulin的方法还是有希望的。该集团正在考虑与当地医院和药店合作，这将有助于将其方法与主流机构的方法相结合。凯利·希尔斯(Kelly Hills)是一家名为“流氓生物伦理学”的咨询公司的生物伦理学家，她赞赏Open Insulin的努力，这种感觉在冠状病毒危机期间只会加深。她告诉我，在小型社区实验室分散生产标准药物可能是一种方式，可以确保当传统的供应线中断时，我们不会遇到短缺。希尔斯说，药品短缺经常发生，即使我们不是在应对大流行，而且“如果你依赖药物维持生命，那就非常可怕”。“但是，如果你有一个社区实验室，你就可以跳过生产延误和边境停顿。如果你知道只要花几美元就可以去社区实验室给你开一个月的胰岛素处方，这将是一种巨大的压力缓解。“。她说，最大的问题是开放式胰岛素是否能满足食品和药物管理局(Food And Drug Administration)规定的严格安全要求。\n约翰·威尔班克斯是研究非营利组织Sage Bionetworks的卫生技术专家，他告诉我，DIY医学，尽管其所有激进的方面，都可以被视为典型的美国项目。他指出：“我们有一种争先恐后的文化，在这种文化中，你应该找到自己的个人解决方案。”“嗯，他们就是这么做的。”\nDIY-Bio运动出现在两千年的早期，似乎几乎是在进化上适应了它的历史时刻。它呼应了创业文化的方方面面，特别是个人电脑的早期，它以车库为基础的起源故事。先是硬件，然后是软件，现在连生活的湿器都可以在人们家里创造了。DIY.Bio反映了大众对职业权威和把关的怀疑，但它对学习或专业知识并不怀疑。“我”是麻省理工学院2004年开始的一项针对本科生的合成生物学竞赛，现已扩大到包括社区实验室的工作人员和其他机构外的科学家。DIY-Bio运动还滋生了侧面喧嚣的概念和Maker Fire活动的兴起，这给业余爱好者带来了一种很酷的新合法性。对于一些想要改变世界的初出茅庐的科学家来说，气候变化和大流行性疾病的挑战使生物学比计算机科学更有说服力。\n近年来，人们相对容易获得精密的实验室仪器，如PCR机器、原子力显微镜和环境传感器。例如，当新的生物技术公司倒闭时，他们倾向于以折扣价出售设备，而社区实验室和生物黑客则将其抢购一空。威尔班克斯告诉我，“DIY.Bio与硅谷70年代末的家庭酿造、黑客俱乐部文化非常相似。如果你还没有在eBay上购买他们可以在24小时内发货给你的DNA测序仪，那就去看看吧--那里有一个巨大的二级市场。“。\nDIY-Bio生态系统包含了很多做好事的人，他们中的许多人都受到了19年危机的鼓舞。艾伦·乔根森(Ellen Jorgensen)是一名分子生物学家，也是美国第一个社区实验室Genspace的创始人，该实验室于2010年在布鲁克林开业。她现在是一名生物技术高管，但她仍然相信DIY Bio的可能性。在巴黎成立的合作网络Only One Giant Lab的赞助下，约根森正在领导一项诊断-19测试的研究，该测试将消除对PCR机器的需求，尽管PCR机器在美国已经变得很常见，但在世界上较贫穷的地区很难买到。Jorgensen的团队正在开发一种基于环介导的等温扩增的-19测试协议，这是一种复制病毒遗传物质的低成本方法，最初由研究人员在\nDIY生物谱包括无政府主义自由主义者。让约根森和犬类这样的人沮丧的是，这种兄弟般的元素往往会吸引媒体的注意，因为他们喜欢直播特技。2018年，在奥斯汀的一次会议上，28岁的生物黑客亚伦·特雷威克(Aaron Traywick)直播了自己注射DIY治疗生殖器疱疹的过程。(目前还不清楚它是否有效；那年晚些时候，特雷威克在使用感官剥夺坦克时在华盛顿特区去世。)。这项运动的这一部分包括戈佐自我实验者，寻求延长寿命的跨舒马主义者，以及渴望成为半机械人的人-比方说，通过在手臂上植入包含他们医疗记录的微芯片。与我交谈过的一个人称这群人为“你做了什么？”人群。另一个人说，这样的人遵循“因为它很酷，因为我们可以”的信条。\n其中最著名的也许是乔西亚·泽纳(Josiah Zayner)，他是一名生物黑客企业家，拥有芝加哥大学(University Of Chicago)生物物理学博士学位，是一个厚颜无耻的公众形象，与监管机构的关系也很狡猾。2017年，泽纳直播了他自己注射的基因编辑技术，这是为了增强他的肌肉。(它没有起作用。)。他还记录了一个自我实验，在这个实验中，他将朋友捐赠的粪便中的物质移植到他的肠道中，从而改变了他的微生物群。他现在有一家名为奥丁(Odin)的公司，该公司销售邮购套件，让你可以尝试，制造黑暗中发光的酵母，并对树蛙进行基因工程。泽纳似乎接受了这样一种观点，即唯一有趣的科学家是一个疯狂的科学家。\n去年8月，在拉斯维加斯举行的一场名为“生物黑客星球”的会议上，泽纳发表了一次演讲，他在演讲中指出，在多米尼加共和国这样的邻国，有许多绝望的患者愿意尝试任何一种实验性的基因疗法，即使它很有可能会杀死他们。他建议，DIY激进分子应该对这群人进行测试。“当你可以飞上几个小时，而不需要与任何政府作战时，为什么要与美国政府作战呢？”他说。\n对于一些生物黑客挑衅者来说，大型制药公司是一个诱人的目标。在生物黑客大会上，一个名叫加布里埃尔·利奇纳(Gabriel Licina)的人坐在舞台边缘，就他和两个朋友--奥地利的生物技术专家安德烈亚斯·施特尔默(Andreas Stürmer)和密西西比州的石油工人、自学成才的生物学家和狗饲养员大卫·伊希(David Ishee)--启动的一个项目进行了激烈的讨论。他宣布，他们已经对基因治疗药物Glybera进行了反向工程，这种药物治疗一种名为脂蛋白脂肪酶缺乏症的罕见疾病，这种疾病会导致甘油三酯在血液中危险的积聚。\n利希纳在生物黑客社区中很出名，因为他在2015年进行了一次自我实验，用自己设计的眼药水创造了“夜视”。(这些药水含有氯素e6，一种与海洋生物中发现的类似的光敏物质。)如果你在谷歌上搜索他的名字，你会发现他的照片，他的瞳孔放大，眼皮肿胀，剃光头，看起来像个外星人。他说，他在晚上看了几个小时的更远的地方，没有受到持久的损害。\n当荷兰公司UniQure在2015年推出Glybera时，它是世界上最昂贵的药物，每剂大约100万美元。两年后，UniQure将Glybera撤出市场，因为只有一家德国的保险公司会为一名患者承保。(大约每百万人中就有一人患有脂蛋白脂肪酶缺乏症。)。在拉斯维加斯，李奇纳说，他和他的同事们已经确定了相关的DNA，将他们的发现发送到了外部的遗传学实验室，并对大肠杆菌进行了改造，以生产出患有这种疾病的人所缺少的蛋白质。(这个过程类似于胰岛素的制造过程。)。利希纳宣布，他带了40瓶改良过的细菌来参加会议，他不时地在头顶上挥舞一瓶，咯咯地笑着。他邀请科学家来培养、提纯和测试他的发明。但是，知道他的观众喜欢自我实验，他说，“不要给自己注射这种东西。看在上帝的份上，别再刺伤自己了。“。\n二月份，我和利奇娜通了电话。他当时在印第安纳州的南本德，在那里他在家里经营着一个社区实验室，科学之家。“这听起来会很轻率，”他说。“但是我和我的朋友们决定做Glybera的事情，因为我们认为这会很有趣。我是说，这是一种价值百万美元的毒品。“。然而，他声称，即使是它的秘密也相对容易地解开了。(保留该药专利的uniQure表示，被Licina的“山寨产品”搞得措手不及，但尚未提起诉讼。)。利希纳说，他不希望任何人将他的创作用于治疗。他只是想让像他这样的生物黑客停止生产在黑暗中发光的啤酒-是的，这是一件事-并专注于他们的刺激\nDIY生物运动最早出现在生物技术蓬勃发展的地方，如马萨诸塞州剑桥和旧金山湾区。一些缺乏在学术和企业实验室从事生物研究所需的资金或资质的人开始装备自己。其他人想要证明高级医疗信息和技术可以共享。2008年，凯·奥尔刚刚从。\n..", "note_en": "One evening in February, I went to hear a lecture at the Baltimore Underground Science Space, a community lab in a former bottle-top factory. Like several dozen other “biospaces” around the country,  , as the lab is known, is animated by a spirit of subversive amateurism. Anybody can go there to learn about, and then do, the kind of cutting-edge bench science—gene editing, synthetic biology—that is generally confined to well-funded academic institutions and private corporations. Inside, a chalkboard with cartoon drawings of a microbe and a double helix welcomes newcomers, but the lab areas are seriously kitted out.   has a real-time PCR machine, the gadget that allows scientists to make millions of copies of a particular strand of DNA, in order to study and manipulate it. “We don’t have a lot else that’s  super fancy,” Lisa Scheifele, the lab’s executive director, told me, though that might depend on how fancy you consider such items as a laminar-flow hood (“for working with cells and cultures that you really don’t want contaminated,” according to  the lab’s Web site), an Alpha Innotech gel imager, or a negative-seventy–degree storage freezer. “We have what we need,” Scheifele said. “You can do most genetics here. You can do microbiology.”\n  That night, two dozen people had filed in to hear Yann Huon de Kermadec—a low-key thirty-three-year-old with a Ph.D. in protein biochemistry from the University of Grenoble—talk about the Open Insulin Project, for which he hoped to recruit local volunteers. The project, which originated in 2015, at the biospace Counter Culture Labs, in Oakland, proposes a “biohack” for a stark failing in the American health-care system: the rising cost of insulin, the synthetic form of the hormone that 7.5 million diabetics must inject daily in order to live. Its goal is to replicate the insulin that is manufactured and sold in this country by three pharmaceutical companies—Eli Lilly, Novo Nordisk, and Sanofi—and to publish a protocol for safely producing it. The three U.S. manufacturers have lately been charging upward of three hundred dollars a vial. Eventually, the project hopes to launch a network of patient-and-worker-owned coöperatives that will produce small batches of insulin and offer vials to diabetics for about seven dollars each. At the very least, Open Insulin wants to show that such pharmaceutical code-breaking can be done, in the hope that it will demystify the drug-production process.\n  The Baltimore lecture took place a few weeks before the  -19 crisis necessitated social distancing, so we sat in tight semicircles. Pepperidge Farm cookies and mixed nuts were set out on a table, near a book for sale called “ Zero to Genetic Engineering Hero: The Beginner’s Guide to Programming Bacteria at Home, School &amp; in the Makerspace.” A flyer advertised an event, BioPrinting Breakout, which promised to introduce “3D tissue engineering to new audiences and applications.” In the crowd, there were some hip-looking young couples, a middle-aged African-American man in a parka, and a sixty-one-year-old regular who works in computer security and loves the community-lab scene because, he told me, you can talk science as much as you want, whereas in “normal social situations people start running away.”\n Huon de Kermadec, who wore Clark Kent glasses, jeans, and a gray hoodie, introduced himself as “a French guy having my Ph.D. who followed my wife when she found a position.” (He is married to Louise Lassalle, who also works with Open Insulin, and came to the U.S. to do a postdoc in biochemistry at the Lawrence Berkeley National Laboratory.) Huon de Kermadec was originally attracted to Open Insulin because he thought the lab work would be fun—he loves the craft of biology but is annoyed by the academic pressure to publish. He noted to the audience that nearly half of American adults have diabetes or high blood-sugar levels, yet there are currently no generic forms of insulin available in the U.S., nor are there any mechanisms in place for controlling the price, as there are in Canada and in Europe. “If one of the three big companies increases the price, they all increase the price,” he said. “Because they can.” He showed a slide of a chart depicting an exponential curve for insulin prices. In 1996, Eli Lilly introduced Humalog, its synthetic version of the hormone, at twenty-one dollars for a ten-millilitre vial; during the next two decades, the retail price increased tenfold. Sanofi’s Lantus and Novo Nordisk’s Novolog have similarly soared in cost. (Eli Lilly recently announced that, during the  -19 epidemic, it would lower the monthly out-of-pocket cost of insulin to thirty-five dollars, but the drug is a crucial source of revenue for the company, and the price will likely rebound.) Patients with Type 1 diabetes typically require two to three vials of insulin a month. Even if they have insurance, it doesn’t necessarily cover the entire expense. A  2018 study conducted by researchers at the Yale School of Medicine found that one in four diabetes patients scrimped on insulin usage—not filling prescriptions regularly, using less than prescribed—risking kidney failure, blindness, and death.\n Jean Peccoud, a professor of chemical and biological engineering at Colorado State University and the founder of the journal  Synthetic Biology, told me, “The price of insulin is something for which there is no technical justification, no justification other than greed. It’s simple to make, with a large market. It should be as cheap as Tylenol.”\n  The scientist who discovered that injections of insulin could save diabetics from a painful death wanted to see the drug affordable and widely available. In 1921, Frederick Banting, a Canadian orthopedist, derived insulin from the pancreases of dogs; he sold the patent to the University of Toronto for one dollar, clearing the way for it to be mass-produced. “Insulin does not belong to me,” he declared. “It belongs to the world.”\n Open Insulin plans to use protocols laid out in published papers to perform genetic engineering on two organisms—yeast and  E. coli—causing them to produce insulin. This is how pharmaceutical factories generally make the drug. Last spring, the group announced that preliminary results indicated the successful insertion of a target gene into  E. coli cells, and the subsequent production of a protein that converts into insulin. The next step was to assess the samples, using mass spectrometry and other technologies.\n When Huon de Kermadec mentioned this development, a guy with a close-shaved head and a Russian accent interjected to say that he ran a drug-testing lab, and wouldn’t mind vetting some of Open Insulin’s samples. The project was a “fascinating testament to the prospect of citizens doing science,” the man said. Still, he noted, maybe it would be simpler for people who needed expensive medications to get hold of them on the black market, or in other countries.\n Huon de Kermadec sighed. “You  could find a way with a black market,” he said. “But who will have access to that? You don’t change the system.” Pacing the front of the room, he went on, “What  we aim for is more changing the way this is produced. It doesn’t  have to be a situation where Big Pharma exploits people’s misery. We can design a better system.”\n  Open Insulin has its critics, and not only lobbyists for the pharmaceutical industry. Gregg Gonsalves, a professor of epidemiology at the Yale School of Public Health, is a former member of  , which took a confrontational, anti-institutionalist stance to drug development during the   crisis. Yet Gonsalves told me that D.I.Y. medicine is “like GoFundMe campaigns for basic health care—a sign of a broken system.” The D.I.Y. movement, he continued, “is going down a dead end of desperation, when all that energy and anger might be better focussed on dealing with politicians” and fighting for universal access to health care.\n  Yet, given the profound flaws of the American health-care system, there is something hopeful about Open Insulin’s approach. The group is considering teaming up with local hospitals and pharmacies, which would help integrate its methods with those of mainstream institutions. Kelly Hills, a bioethicist at a consulting firm called Rogue Bioethics, appreciates Open Insulin’s efforts, a feeling that has only deepened during the coronavirus crisis. She told me that the decentralized production of standard drugs in small community labs might be a way of insuring that we don’t run into shortages when traditional supply lines are disrupted. Drug shortages occur fairly often, even when we’re not dealing with a pandemic, and they are “very scary if you are life-dependent on a medication,” Hills said. “But, if you have a community lab, you’re skipping manufacturing delays and pauses at borders. It would be a huge stress relief if you knew you could go to a community lab and fill your insulin prescription for a month for a few bucks.” The big question, she said, is whether Open Insulin can meet the exacting safety requirements mandated by the Food and Drug Administration.\n John Wilbanks, a health technologist at the research nonprofit Sage Bionetworks, told me that D.I.Y. medicine, for all its radical aspects, can be viewed as a quintessentially American project. “We have this whole culture of hustle and grind, in which you’re supposed to find your own individual solutions,” he pointed out. “Well, that’s what they’re doing.”\n The D.I.Y.-bio movement, which emerged in the early two-thousands, seems almost evolutionarily adapted to its historical moment. It echoes aspects of startup culture, especially the early days of personal computing, with its garage-based origin stories. First came the hardware, then the software; now even the wetware of life can be created in people’s homes. D.I.Y. bio reflects popular skepticism about professional authority and gatekeeping, but it is not skeptical about learning or expertise. i , a synthetic-biology competition for undergraduates which started at M.I.T. in 2004, has expanded to include people working in community labs and other extra-institutional scientists. The D.I.Y.-bio movement also feeds off the notion of the side hustle and the rise of Maker Faire events, which have lent hobbyists a cool new legitimacy. To some budding scientists who want to make a difference in the world, the challenges of climate change and pandemic disease have made biology more compelling than, say, computer science.\n  In recent years, it has become relatively easy for people to acquire sophisticated lab instruments such as PCR machines, atomic-force microscopes, and environmental sensors. For example, when new biotech companies fail, they tend to sell off their equipment for a discount, and community labs and biohackers scoop it up. Wilbanks told me, “D.I.Y. bio is very similar to the home-brew, hacker-club culture of the late seventies in Silicon Valley. If you’ve not gone on eBay to shop for a DNA sequencer that they can ship to you in twenty-four hours, check it out—there’s a massive secondary market.”\n The D.I.Y.-bio ecosystem includes a lot of do-gooders, and many of them have been galvanized by the  -19 crisis. Ellen Jorgensen is a molecular biologist and a founder of GenSpace, the country’s first community lab, which opened in Brooklyn in 2010. She is now a biotech executive, but she continues to believe in the possibilities of D.I.Y. bio. Under the auspices of Just One Giant Lab, a collaborative network founded in Paris, Jorgensen is leading research on a diagnostic  -19 test that would eliminate the need for PCR machines, which, as commonplace as they have become in the U.S., are hard to come by in poorer parts of the world. Jorgensen’s team is developing a  -19 testing protocol based on loop-mediated isothermal amplification, a low-cost method of replicating a virus’s genetic material, initially developed by researchers in Japan; according to  Just One Giant Lab’s Web page, the process “can be done in a cup of hot water.”\n Another veteran of GenSpace, Will Canine, co-founded a company that makes open-source robots. The machines allow labs to automate a tedious task required in a lot of modern biological research: dispensing precise amounts of liquids, over and over again. When the coronavirus emerged, a hundred and seventy of Canine’s machines were repurposed by a public-private partnership, the Covichain Robots Initiative, and shipped, at no cost, to hospitals in Spain. The robots can make testing for  -19 speedier and cheaper, and help eliminate humans from labs at a time when social distancing is crucial. Canine told me that D.I.Y. bio has a lot to teach our pandemic world. The movement has learned to use accessible language without dumbing down science, and it has also learned what  not to do: “speculate about scientifically invalid and dangerous things in public forums”; “hoard protocols, data, equipment, reagents, or anything else that could be broadly useful to others.” Canine added that “D.I.Y. bio should not be concerned with doing the most bleeding-edge experiments but, rather, with making the most relevant scientific knowledge and tools available to those otherwise excluded from them.”\n The D.I.Y.-bio spectrum includes anarcho-libertarians. To the frustration of people like Jorgensen and Canine, this bro-ish element tends to attract media attention, because of a predilection for live-streaming stunts. In 2018, at a conference in Austin, the twenty-eight-year-old biohacker Aaron Traywick live-streamed his self-injection of a D.I.Y. treatment for genital herpes. (It’s unclear if it worked; Traywick died later that year, in Washington, D.C., while using a sensory-deprivation tank.) This part of the movement includes gonzo self-experimenters, transhumanists seeking to extend their life spans, and people eager to become cyborgs—by, say, implanting microchips in their arms which contain their medical records. One person I spoke to called this cohort the “You did  what?” crowd. Another said that such people followed a credo of “because it’s cool, and because we can.”\n Perhaps the best known of these edgier types is Josiah Zayner, a biohacking entrepreneur with a Ph.D. in biophysics from the University of Chicago, a cheeky public persona, and a slyly contentious relationship with regulatory authorities. In 2017, Zayner live-streamed his self-injection of   gene-editing technology, which was an attempt to enhance his muscles. (It didn’t work.) He also documented a self-experiment in which he transplanted matter from a friend’s donated stool into his gut, thus altering his microbiome. He now has a company, the Odin, which sells mail-order kits that allow you to try your hand at  , make glow-in-the-dark yeast, and genetically engineer tree frogs. Zayner seems to embrace the idea that the only interesting scientist is a mad one.\n  Last August, at a conference in Las Vegas called Biohack the Planet, Zayner gave a speech in which he noted that, in such nearby countries as the Dominican Republic, there were many desperate patients who’d be willing to try any kind of experimental gene therapy, even if there was a good chance that it would kill them. D.I.Y. radicals, he suggested, should perform tests on this population. “Why fight against the U.S. government when you can just, you know, fly a couple hours, and you don’t have to fight against  any government?” he said.\n Big Pharma makes a tempting target for some biohacking provocateurs. At the Biohack the Planet conference, a man named Gabriel Licina sat on the edge of the stage and gave a pugnacious talk about a project that he and two friends—Andreas Stürmer, a biotechnologist in Austria, and David Ishee, an oil worker, self-taught biologist, and dog breeder in Mississippi—had embarked on. They had, he announced, reverse engineered the gene-therapy drug Glybera, which treats a rare disease, called lipoprotein-lipase deficiency, that results in a dangerous buildup of triglycerides in the blood.\n Licina is famous in the biohacking community for a self-experiment he undertook in 2015, with eye drops of his own devising, to create “night vision.” (The drops contained Chlorin e6, a light-sensitive substance similar to one found in sea creatures.) If you Google his name, you’ll discover photographs of him with his pupils dilated, his eyelids swollen, and his head shaved, looking like an extraterrestrial. He says that he saw farther at night for a few hours and suffered no lasting damage.\n  When the Dutch firm UniQure introduced Glybera, in 2015, it was the most expensive medication in the world, at about a million dollars a dose. Two years later, UniQure pulled Glybera from the market, because only one insurer, in Germany, would cover it—for one patient. (Approximately one in a million people have lipoprotein-lipase deficiency.) In Las Vegas, Licina said that he and his colleagues had identified the relevant DNA, sent their findings to an outside genetics lab, and engineered  E. coli to produce the protein that is missing in people who suffer from the disease. (The process is similar to how insulin is made.) Licina announced that he had brought forty vials of the modified bacteria to the conference, and he periodically waved one above his head, chuckling. He invited scientists to culture, purify, and test his creation. But, knowing his audience’s penchant for self-experimentation, he said, “Do  not inject yourself with this thing. For the love of God, stop stabbing yourselves.”\n In February, I spoke to Licina on the phone. He was in South Bend, Indiana, where he runs a community lab, Scihouse, out of his home. “This is going to sound so flippant,” he said. “But my friends and I decided to do the Glybera thing because we thought it would be  funny. I mean, this was a million-dollar drug.” Yet even its secrets were unlocked with relative ease, he claimed. (UniQure, which retains a patent on the drug, said that it was blindsided by Licina’s “knockoff” but has not sued.) Licina said that he doesn’t want anyone to use his creation therapeutically. He just wanted biohackers like him to stop making glow-in-the-dark beer—yes, that’s a thing—and focus their thrill-seeking minds on more substantive projects. He was pleased when two Stanford undergraduates, Alec Luiz Lourenco and Cooper Veit, volunteered to test his version of Glybera at a university lab. Lourenco and Veit are part of  , a student group that takes inspiration from the D.I.Y. movement and pursues what Lourenco calls “independent-type” biological research. (The   project is pending, having been delayed by the pandemic shutdown.)\n In many ways, the earnest, democratizing amateurism of community labs feels nothing like the snarky, performative energy projected by biohackers. The people I spoke with at Open Insulin are modest, serious, and, in some cases, steeped in social-justice activism. Still, there is overlap between members of the two factions—they know one another, attend some of the same conferences, and share a belief that real science can be conducted outside institutional settings. And they are similarly committed to making their protocols and findings transparent. One of Open Insulin’s founders, Anthony Di Franco—a computer scientist who lives in Berkeley and is himself a Type 1 diabetic—told me that, though he thinks of Open Insulin as belonging to the “lineage of mutual-aid societies,” he also sees the group as “definitely part of the biohacking community.”\n The D.I.Y.-bio movement first emerged in places where biotech was booming, like Cambridge, Massachusetts, and the Bay Area. Some people who lacked the funding or the credentials required to work on biological research at the academic and corporate labs where it was being done began to equip themselves. Others wanted to demonstrate that high-level medical information and techniques  could be shared. In 2008, Kay Aull had just graduated fr\n......", "posttime": "2020-05-20 03:02:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "流氓,rogue,实验室", "title": "“流氓实验者”", "title_en": "The Rogue Experimenters", "transed": 1, "url": "https://www.newyorker.com/magazine/2020/05/25/the-rogue-experimenters", "via": "", "real_tags": ["流氓", "rogue", "实验室"]}, {"category": "", "categoryclass": "", "imagename": "9fa5e4031f58114a7e8e8b8c3299cbab.jpg", "infoid": 1002846, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "喜剧演员、世界上最受欢迎的播客之一的主持人乔·罗根(Joe Rogan)将他的节目带到了Spotify上。乔·罗根的体验很快就会成为Spotify的独家节目，这意味着从今年晚些时候开始，剧集的完整音频和视频只能通过该平台提供。到目前为止，罗根的节目从未在Spotify上观看过，更不用说在任何平台上独家提供了。\n该节目将于9月1日开始在Spotify全球播出，之后将成为独家节目。听众不需要付费观看剧集，但他们必须成为Spotify用户。Spotify在一份新闻稿中表示，罗根保留了对他的节目的创意控制权。该公司没有透露在这笔交易上花费了多少钱。该公司还将与一家广告代理公司合作，联合销售针对该计划的广告。罗根说，去年他的节目每月下载量约为1.9亿次。\n罗根的YouTube频道将继续直播，但不会包含全集。可能有一些片段或其他补充内容可以受益于YouTube的搜索算法，并推动人们在Spotify上收听整集。\n这对Spotify来说是一个巨大的收获，它已经将播客作为核心关注点。它去年收购了Gimlet Media、Anchor和Parcast，最初是这样做的，然后又签署了更多Spotify独家协议。它与奥巴马夫妇的制作公司独家合作，并致力于与乔·巴登(Joe Budden)和艾米·舒默(Amy Schumer)等其他大牌公司进行交易，并收购了The Ringer。\n尽管独家交易似乎是该公司获取听众的主要策略，但Spotify并没有立即将Gimlet节目转向独家模式。取而代之的是，它制作了辅助的独家内容，如Gimlet Academy和额外回复所有剧集，同时保持现有节目的广泛可用。在这种情况下，该公司似乎会相对较快地采取行动，让Rogan成为仅限Spotify使用的产品。\nSpotify的播客野心总是直接针对苹果，到目前为止，苹果一直是播客播放器中最大的名字。但随着与罗根的交易，Spotify还有另一个新目标：YouTube。本月早些时候，当它开始测试其视频播客功能时，它得到了两个广受欢迎的YouTuber的支持。罗根是最受欢迎的YouTube播客之一，通常每集都有数百万人观看，所以在这个平台上失声对YouTube来说是一大成功，对Spotify来说也是一大收获。", "note_en": "Joe Rogan, comedian and host of one of the most popular podcasts in the world, is taking his show to Spotify.  The Joe Rogan Experience will soon become  a Spotify exclusive, meaning episodes’ full audio and video will only be available through the platform starting later this year. Up until now, Rogan’s show has never been available on Spotify, let alone exclusive to any platform.\n The show will become available on Spotify globally starting on September 1st, and it’ll become an exclusive sometime after that point. Listeners won’t have to pay to access the episodes, but they will have to become Spotify users. Spotify said in a press release that Rogan retains creative control over his show. It didn’t disclose how much it spent on the deal. The company will also work with an ad agency to jointly sell ads against the program. Rogan  said last year his show reached about 190 million downloads a month.\n Rogan’s YouTube channel will remain live, but it won’t contain full episodes. There might be clips or other supplementary content which could benefit from YouTube’s search algorithm and push people to listen to full episodes on Spotify.\n  This is a massive get for Spotify, which has made podcasting a core focus. It acquired Gimlet Media, Anchor, and Parcast last year, to start, and then signed more Spotify-exclusive deals. It’s working with  the Obamas’ production company exclusively and committed to deals with other big names, like Joe Budden and Amy Schumer, and acquired The Ringer.\n Although exclusive deals seem to be the company’s main listener acquisition strategy, Spotify didn’t immediately move Gimlet shows to an exclusive model. Instead, it produced ancillary, exclusive content like  Gimlet Academy and extra  Reply All episodes while keeping existing shows widely available. In this case, the company will seemingly move relatively quickly to make Rogan a Spotify-only offering.\n  Spotify’s podcast ambitions always directly targeted Apple, which, up until now, has been the biggest name in podcast players. But with the Rogan deal, Spotify also has another new target: YouTube. When it  began testing its video podcasting feature earlier this month, it did so with the backing of two popular YouTubers. Rogan is one of the  most popular YouTube podcasters, often with millions of people watching each episode, so losing his voice on the platform is a major hit to YouTube and a big gain for Spotify.", "posttime": "2020-05-20 02:45:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "播客,rogan,spotify", "title": "乔·罗根的播客正在成为Spotify的独家节目", "title_en": "Joe Rogan’s podcast is becoming a Spotify exclusive", "transed": 1, "url": "https://www.theverge.com/2020/5/19/21263927/joe-rogan-spotify-experience-exclusive-content-episodes-youtube", "via": "", "real_tags": ["播客", "rogan", "spotify"]}, {"category": "", "categoryclass": "", "imagename": "d4c22fc52cc7edc4b788f9d16d23ace2.png", "infoid": 1002845, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "H&Co为印刷、网络和移动环境设计字体。", "note_en": "H&Co designs fonts for print, web, and mobile environments.", "posttime": "2020-05-20 02:45:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "字体,proofing,网络", "title": "校对字体的文本：告别快速棕色狐狸", "title_en": "Text for Proofing Fonts: A Farewell to the Quick Brown Fox", "transed": 1, "url": "https://www.typography.com/blog/text-for-proofing-fonts", "via": "", "real_tags": ["字体", "proofing", "网络"]}]