[{"category": "", "categoryclass": "", "imagename": "c8ccc4c50ad2a6dcae4247df965c9cc5.jpg", "infoid": 1001668, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "冠状病毒病-19(COVID19)是由严重急性呼吸综合征冠状病毒2型(SARS-CoV-2)引起的一种新的呼吸系统疾病，具有严重的发病率和死亡率。诊断检测在美国的推出速度很慢，导致许多病例在2020年2月和3月没有进行SARS-CoV-2检测，因此有必要使用血清学检测来确定过去的感染情况。在这里，我们通过检测3个不同的患者群体来评价雅培公司的SARS-CoV-2IgG检测方法对抗SARS-CoV-2IgG抗体的检测。我们检测了在美国SARS-CoV-2传播前收集的1020份血清样本，发现一份假阳性，特异性为99.90%。我们对125例RT-PCR检测SARS-CoV-2阳性的患者进行了检测，其中有689份超额血清样本，发现在症状出现后第17天和PCR阳性后第13天，敏感性均达到100%。在这个队列中，阳性的替代指标值阈值导致了100%的敏感性和100%的特异性。作为粉碎曲线计划的一部分，我们测试了2020年4月在爱达荷州博伊西一周内收集的4856个人，检测到87个阳性，阳性率为1.79%。这些数据表明雅培SARS-CoV-2 IgG检测的出色分析性能，以及病毒在美国西部的有限传播。我们预计，高质量血清学检测的可用性将是抗击SARS-CoV-2的关键工具。", "note_en": "Coronavirus disease-19 (COVID19), the novel respiratory illness caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2), is associated with severe morbidity and mortality. The rollout of diagnostic testing in the United States was slow, leading to numerous cases that were not tested for SARS-CoV-2 in February and March 2020, necessitating the use of serological testing to determine past infections. Here, we evaluated the Abbott SARS-CoV-2 IgG test for detection of anti-SARS-CoV-2 IgG antibodies by testing 3 distinct patient populations. We tested 1,020 serum specimens collected prior to SARS-CoV-2 circulation in the United States and found one false positive, indicating a specificity of 99.90%. We tested 125 patients who tested RT-PCR positive for SARS-CoV-2 for which 689 excess serum specimens were available and found sensitivity reached 100% at day 17 after symptom onset and day 13 after PCR positivity. Alternative index value thresholds for positivity resulted in 100% sensitivity and 100% specificity in this cohort. We tested 4,856 individuals from Boise, Idaho collected over one week in April 2020 as part of the Crush the Curve initiative and detected 87 positives for a positivity rate of 1.79%. These data demonstrate excellent analytical performance of the Abbott SARS-CoV-2 IgG test as well as the limited circulation of the virus in the western United States. We expect the availability of high-quality serological testing will be a key tool in the fight against SARS-CoV-2.", "posttime": "2020-05-12 00:04:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "检测,sars", "title": "新的雅培SARS-CoV-2抗体检测具有99.90%的特异性和100%的敏感性", "title_en": "New Abbott SARS-CoV-2 antibody test has 99.90% specificity and 100% sensitivity", "transed": 1, "url": "https://jcm.asm.org/content/early/2020/05/07/JCM.00941-20", "via": "", "real_tags": ["检测", "sars"]}, {"category": "", "categoryclass": "", "imagename": "51d762c59cfc8e1db971248236840e48.jpg", "infoid": 1001667, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "四年前，当乔治奥斯·莫斯奇迪斯还是普林斯顿大学的研究生时，他遇到了一个可能不会成功的问题。他的顾问要求他从数学上证明某种特定的时空结构是不稳定的，换言之，证明对它的任何微小改变最终都会导致时空本身的崩溃。\n他的导师，数学家米哈利斯·达费尔莫斯(Mihalis Dafermos)知道这项任务有多艰巨。Dafermos说：“你可能会花很多时间用头撞墙，但什么也得不到。”Dafermos和古斯塔夫·霍尔泽格尔(Gustav Holzegel)在2006年提出了不稳定猜想。“我认为这是无法证明的。”但他鼓励目前在加州大学伯克利分校(University of California，Berkeley)做博士后的莫奇迪斯无论如何都要看看它。Moschidis已经做了足够多的工作来获得博士学位，所以为什么不尝试一些大的东西呢？\n达费尔莫斯对莫斯奇迪斯的信仰恰到好处。在从2017年开始并持续到今天的一系列进展中，莫斯奇迪斯已经表明，爱因斯坦时空的某种规范配置称为反德西特(ADS)空间是不稳定的。把一点点物质扔进广告空间，最终会出现一个黑洞。\n斯坦福大学数学家Jonathan Luk形容Moschidis的工作“令人惊叹”。…。他发现的是一种相当普遍的不稳定机制“--一种可以应用于其他与广告无关的环境中的机制，在这些环境中，物质或能量被封闭在一个没有逃生口的物理系统中。Dafermos称他以前学生的工作是“壮观的”，“肯定是我在过去几年里在广义相对论数学中看到的最具原创性的东西。”\n尽管我们没有生活在一个反德西特的宇宙中(谢天谢地，因为我们不会存在)，但这项工作也对我们理解从湍流到引力理论和量子力学之间的神秘联系的一切都有影响。\n不稳定性猜想--甚至是它产生的整个思想流派--可以追溯到爱因斯坦的广义相对论方程，该方程准确地阐明了质量和能量是如何影响时空曲率的。在真空中，根本没有物质，时空仍然可以弯曲，引力仍然可以存在，这要归功于真空本身的能量密度，这可以用一个“宇宙常数”来描述。事实证明，空白空间并不是真正的空白。\n爱因斯坦真空方程的三个最简单的解是最对称的--在这些解中，时空的曲率在任何地方都是相同的。在Minkowski时空中，宇宙常数为零，宇宙是完全平坦的。在德锡特时空中，宇宙常数为正值，宇宙的形状就像一个球体。当宇宙学常数为负值时，你会得到ADS时空，它有一个马鞍形。在宇宙学的早期，科学家们想知道这三个时空中的哪一个描述了我们的宇宙。\n另一方面，数学家倾向于怀疑这些时空是否真的、真的是稳定的。也就是说，如果你以任何方式扰乱真空时空--比方说，通过向系统注入一些物质或发出一些引力波--它最终会稳定下来，形成接近原始状态的东西吗？或者它会演变成截然不同的东西吗？这在宇宙中相当于把一块石头扔进池塘：海浪会逐渐减弱，还是会形成海啸？\n1986年，一位数学家证明了de Sitter时空是稳定的。1993年，两位数学家对Minkowski时空做了同样的研究。广告问题花了更长的时间。普遍的共识是，与其他两种配置不同的是，ADS是不稳定的，这意味着数学家将不得不采取一种全新的方法。Dafermos说：“已经开发了很多数学工具来解决稳定性问题。”“但不稳定是一个完全不同的领域--特别是这种类型的不稳定”，它本质上是非线性的，造成了一个本质上复杂的情况，相应地计算起来也很棘手。\nDafermos解释说，研究人员怀疑ADS时空可能是不稳定的，因为他们相信它的边界会是反射的，从而导致它“像一面镜子一样运作，这样任何击中它的波都会回来”。\n新泽西州普林斯顿高等研究院的物理学家胡安·马尔达塞纳(Juan Maldacena)说，“从物理角度看，边界上的反射是有意义的。”这在一定程度上是因为广告空间的曲率，但还有一个更简单的解释：前提是坚持能量守恒原则。\n如果边界实际上是反射的，那么任何东西都不能从广告时空中泄漏出来。因此，放入该系统的任何物质或能量都有可能被集中起来--可能达到形成黑洞的程度。问题是：这真的会发生吗？如果是的话，什么机制会导致物质和能量聚集到这样的程度，而不是保持分散？\nMoschidis想象站在广告时空的中间，这就像站在一个巨大的球里，这个球的边缘或边界是无限的。如果你从那里发出一个光信号，它会在有限的时间内传播出去并到达边界。这种旅行之所以可能是因为众所周知的相对论效应：虽然到边界的空间距离确实是无限的，但对于以光速或接近光速旅行的波或物体来说，时间会变慢。因此，站在ADS时空中间的观察者会看到一条光线在有限的时间内到达边界(尽管需要一些耐心)。\nMoschidis没有使用光线，而是将广义相对论模型中常用的一种物质形式-即所谓的爱因斯坦-弗拉索夫粒子-投放到ADS空间。这些粒子在时空中产生同心的物质波，类似于池塘中出现的水波。\n在物质突然坠入这个时空时产生的许多同心波中，前两个将是最大的。因为它们含有最多的物质和能量，所以我们将重点放在它们身上。第一波-称为波1-将向外扩展，直到它到达边界，反弹，并在向中心撤退时收缩。第二波，也就是第二波，将紧随其后。\n当第一浪从边界反弹并开始向中心收缩时，它将击中仍在扩张的第二浪。Moschidis确定的爱因斯坦方程的一个结果是，在这样的相互作用中，膨胀波(在这种情况下是波2)总是将能量传递给收缩波(波1)。\n在第一浪到达中心后，它将再次开始扩张，与现在正在收缩的第二浪相遇。这一次，第一波将把能量传递给第二波。这个循环可以重复很多很多次。\n莫斯奇迪斯意识到了另一件事：在中心附近，海浪占据的空间更小，它们携带的能量更集中。正因为如此，波在中心附近的相互作用过程中比在边界附近的相互作用过程中交换更多的能量。净结果是，波1给予中心的波2的能量比波2给予边界处的波1的能量多。\n经过无数次迭代，第二波变得越来越大，吸收了第一波的能量。因此，第二波的能量密度继续增加。在某一时刻，当第二波向中心收缩时，它的能量将变得如此集中，以至于将形成一个黑洞。\n这就是不稳定性的证据：莫斯奇迪斯证明，当他在ADS时空中添加哪怕是极少量的物质时，黑洞(或多个黑洞)就会无情地形成。然而，根据定义，ADS时空到处都有均匀的曲率，这意味着它不能容纳像黑洞这样扭曲空间的物体。“如果你扰乱广告时空并等待足够的时间，”莫斯奇迪斯说，“你最终会得到一个不同的几何体--一个包含黑洞的几何体--而它不再是广告。”这就是我们所说的不稳定。“。\nMoschidis最近证明了一种不同类型的物质扰动-所谓的无质量标量场-的不稳定性，在几次学术演讲中展示了这项尚未发表的工作。“因为标量场产生的波是引力波的代表，”Dafermos说，这让Moschidis离最终目标更近了一步-证明了ADS在真正真空中的不稳定性，在真空中，时空完全受到重力的扰动，没有引入任何物质。\nADS时空的不稳定性对我们如何理解我们自己的宇宙有着重大的影响。莫斯奇迪斯说，首先，由于广告时空是不稳定的，它是“你在自然界中看不到的东西”。\n但是“即使广告不是真实的，”他说，“它仍然可以引导我们发现和研究真实的现象。”\n例如，当能量从大尺度集中到小尺度时，就会产生湍流--Moschidis表明，当ADS时空被扰动时，就会发生这种情况。但是湍流是一种普遍存在(且知之甚少)的现象，它出现在各种流体系统中。ADS时空--至少对像Moschidis这样的技能和爱好的人来说--是一个“干净”且相对简单的系统，这就是为什么他认为它是研究湍流的“一个很好的理论试验台”。在ADS的背景下，湍流是由重力引起的，但Moschidis相信他正在开发的数学工具也可以帮助分析流体力学中突然出现的湍流。\nADS也在所谓的ADS/CFT通信中占有突出地位-这是如何将量子力学与引力结合在一个包罗万象的量子引力理论中的关键线索。对应关系表明，ADS空间中的引力系统可以等价于一个少一维的非引力量子系统。马尔达塞纳在1997年发现了这种对应关系，他说：“我们可以用一个不含重力的量子力学系统，用引力理论来描述它--不是我们宇宙中的引力理论，而是ADS宇宙中的引力理论。”他进一步指出，正如Moschidis最近证明的那样，ADS的不稳定性并不影响信件的有效性。\n当与ADS/CFT通信相结合时，Moschidis的工作也可能有助于阐明更熟悉的相互作用粒子领域。例如，Moschidis利用ADS时空的微小扰动来创造黑洞。通过对应，这个过程与量子系统达到平衡的热化过程相关--这是一种几乎无处不在的现实世界现象。\n“证明广告是不稳定的，”莫斯奇迪斯总结道，“并不意味着它不有趣。”", "note_en": "Four years ago, while still a graduate student at Princeton University,  Georgios Moschidis took on a problem that likely wasn’t going to pan out. His adviser asked him to mathematically prove that a certain configuration of space-time is unstable — to show, in other words, that any small change to it would ultimately lead to a breakdown in the space-time itself.\n His adviser, the mathematician  Mihalis Dafermos, knew how difficult the task would be. “You could spend a lot of time banging your head against the wall without getting anywhere,” said Dafermos, who (along with  Gustav Holzegel) posed the instability conjecture in 2006. “I didn’t think it could ever be proven.” But he encouraged Moschidis, now a postdoc at the University of California, Berkeley, to take a look at it anyway. Moschidis had already done enough work to earn a doctorate, so why not try for something big?\n Dafermos’ faith in Moschidis was well placed. In a series of advances that  began in 2017 and continue to this day, Moschidis has shown that a certain canonical configuration of Einsteinian space-time called anti-de Sitter (AdS) space is unstable. Throw a tiny bit of matter into AdS space, and eventually a black hole will emerge.\n The Stanford mathematician  Jonathan Luk describes Moschidis’ work as “amazing. … What he’s discovered is a rather general instability mechanism” — one that could apply to other settings, unrelated to AdS, in which matter or energy is cooped up within a physical system that has no escape hatches. Dafermos calls his former student’s work “spectacular” and “certainly the most original thing I’ve seen in the mathematics of general relativity in the last few years.”\n And although we do not live in an anti-de Sitter universe (thank goodness for that, as we wouldn’t exist), the work also has implications for our understanding of everything from turbulence to the mysterious connections between theories of gravity and quantum mechanics.\n  The instability conjecture — and indeed the whole school of thought from which it sprang — goes back to Einstein’s equations of general relativity, which spell out exactly how mass and energy affect the curvature of space-time. In a vacuum, where there’s no matter at all, space-time can still be curved and gravity can still be present, due to the energy density of the vacuum itself, described by a “cosmological constant.” Empty space, it turns out, is not really empty at all.\n The three simplest solutions to Einstein’s vacuum equations are the most symmetric ones — those in which the curvature of space-time is the same everywhere. In Minkowski space-time, where the cosmological constant is zero, the universe is perfectly flat. In de Sitter space-time, where the cosmological constant has a positive value, the universe is shaped like a sphere. And when the cosmological constant is negative, you get AdS space-time, which has a saddle shape. In the early days of cosmology, scientists wondered which one of these three space-times describes our universe.\n Mathematicians, on the other hand, tended to wonder if these space-times were really, truly stable. That is, if you disturbed a vacuum space-time in any way — say, by injecting some matter into the system or sending in some gravitational waves — would it eventually settle down into something close to the original state? Or would it evolve into something wildly different? It’s the cosmic equivalent of dropping a rock into a pond: Will the waves gradually diminish, or will they build into a tsunami?\n In 1986, a mathematician  proved that de Sitter space-time is stable. A pair of mathematicians  did the same for Minkowski space-time in 1993. The AdS problem has taken longer. The general consensus was that AdS, unlike the other two configurations, is unstable, which meant that mathematicians would have to take an entirely new approach. “A lot of tools in mathematics have been developed for stability problems,” said Dafermos. “But instability is a completely different arena — especially this type of instability,” which is nonlinear in nature, making for an inherently complicated situation, with correspondingly tricky calculations.\n Researchers suspected that AdS space-time might be unstable because they believed its boundary would be reflective, thereby causing it “to act like a mirror so that any waves hitting it will come back,” Dafermos explained.\n “Reflection at the boundary makes sense from a physical point of view,” said  Juan Maldacena, a physicist at the Institute for Advanced Study in Princeton, New Jersey. This is partly due to the curvature of AdS space, but there’s an even simpler explanation: The premise upholds the principle of energy conservation.\n If the boundary is, in fact, reflective, nothing can leak out of AdS space-time. So any matter or energy put into the system could potentially get concentrated — perhaps to such an extent that a black hole would form. The question was: Would that really happen, and, if so, what mechanism would cause matter and energy to cluster together to such a degree rather than staying spread out?\n  Moschidis imagined standing in the middle of AdS space-time, which would be like standing inside a giant ball whose edge or boundary lies at infinity. If you sent a light signal from there, it would travel out and reach the boundary in a finite amount of time. That kind of travel is only possible because of a well-known relativistic effect: Although the spatial distance to the boundary is indeed infinite, time slows down for a wave or object traveling at or near the speed of light. So an observer standing in the middle of AdS space-time would see a light ray reach the boundary in a finite amount of time (though some patience would be required).\n Instead of using a light ray, Moschidis dropped into AdS space a form of matter that is commonly used in general relativity models — so-called Einstein-Vlasov particles. These particles create concentric waves of matter in space-time, similar to the water waves that appear in a pond.\n Of the many concentric waves created when matter is suddenly plopped into this space-time, the first two will be the biggest. Since they contain the most matter and energy, we’ll focus on them. The first wave — call it wave 1 — will expand outward until it hits the boundary, bounces back, and contracts as it retreats toward the center. The second wave, wave 2, will follow.\n When wave 1 rebounds off the boundary and starts contracting toward the center, it will hit wave 2, which is still expanding. One consequence of the Einstein equations, Moschidis determined, is that in an interaction like this, the expanding wave (wave 2 in this case) will always transfer energy to the contracting wave (wave 1).\n After wave 1 reaches the center, it will start expanding again, meeting up with wave 2, which is now contracting. This time, wave 1 will impart energy to wave 2. This cycle can repeat many, many times.\n Moschidis realized something else: Near the center, the waves occupy less space, and the energy they carry is more concentrated. Because of this, the waves exchange more energy during the interaction near the center than during the interaction near the boundary. The net result is that wave 1 gives more energy to wave 2 at the center than wave 2 gives to wave 1 at the boundary.\n Over numerous iterations, wave 2 grows larger and larger, taking energy from wave 1. Consequently, the energy density of wave 2 continues to build. At some point, as wave 2 contracts toward the center, its energy will become so concentrated that a black hole will form.\n Here’s the proof of instability: Moschidis  showed that when he adds even a minuscule amount of matter to an AdS space-time, a black hole (or black holes) will inexorably form. However, AdS space-time has, by definition, uniform curvature everywhere, which means it cannot harbor space-contorting objects like black holes. “If you perturb AdS space-time and wait a sufficient time,” Moschidis said, “you’ll end up with a different geometry — one that contains black holes — and it’s no longer AdS. That’s what we mean by unstable.”\n Moschidis has recently proved AdS instability for a different kind of matter perturbation — a so-called massless scalar field — presenting this not-yet-published work in several academic talks. “Because the waves generated by a scalar field are a proxy for gravitational waves,” Dafermos said, this brings Moschidis one step closer to the ultimate goal — proving AdS instability in a true vacuum, where the space-time is perturbed strictly by gravity without the introduction of any matter.\n  The instability of AdS space-time has major implications for how we understand our own universe. First, since AdS space-time is unstable, it’s “something you will not see in nature,” Moschidis said.\n But “even though AdS is not real,” he said, “it can still lead us to the discovery and study of real phenomena.”\n For example, turbulence arises when energy gets concentrated from large scales to small scales — something that Moschidis showed can occur when AdS space-time is perturbed. But turbulence is a widespread (and poorly understood) phenomenon that appears in all kinds of fluid systems. AdS space-time — at least to someone with Moschidis’ skills and inclinations — is a “clean” and relatively simple system to work with, which is why he considers it “a good theoretical test bed” for studying turbulence. In the AdS setting, turbulence is caused by gravity, but Moschidis believes that the mathematical tools he is developing could aid the analysis of the turbulence that crops up in fluid mechanics as well.\n  AdS also features prominently in the so-called AdS/CFT correspondence — a key clue for how to unite quantum mechanics with gravity in an all-encompassing theory of quantum gravity. The correspondence states that a gravitational system in AdS space can be equivalent to a nongravitational quantum system in one fewer dimension. “We can take a quantum mechanical system that does not contain gravity and describe it instead by a theory of gravity — not a theory of gravity in our universe but a theory of gravity in an AdS universe,” said Maldacena, who uncovered the correspondence in 1997. He further noted that the instability of AdS — as recently proved by Moschidis — does not affect the validity of the correspondence.\n Moschidis’ work, when combined with the AdS/CFT correspondence, could also help illuminate the more familiar domain of interacting particles. For example, Moschidis used small perturbations of AdS space-time to create black holes. This process correlates, via the correspondence, to the process of thermalization whereby quantum systems achieve equilibrium — an almost ubiquitous real-world phenomenon.\n “Proving that AdS is unstable,” Moschidis concluded, “doesn’t mean it is uninteresting.”", "posttime": "2020-05-12 00:03:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数学,proves,时空", "title": "新数学证明一类特殊的时空是不稳定的", "title_en": "New Math Proves That a Special Kind of Space-Time Is Unstable", "transed": 1, "url": "https://www.quantamagazine.org/black-holes-prove-that-anti-de-sitter-space-time-is-unstable-20200511/", "via": "", "real_tags": ["数学", "proves", "时空"]}, {"category": "", "categoryclass": "", "imagename": "9891ade6215844c7073b62c4e07c8a64.png", "infoid": 1001666, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上面的图表是一个很酷的视觉表现，但我们的最终目标实际上只是一个可能的航程列表-类似于TSF-&gt；sxf-&gt；mla-&gt；tsf。完整的列表在这里：我想看看我们是否能在图中找到哈密尔顿循环会很有趣。不幸的是，由于有242个机场和4000多条航线，这个数字几乎不可能计算出来。不过，在下面的最终图中找到它实际上并不是那么糟糕-尽管它是NP-完全的，当一个图与上面一样多的边相连时，实际上并不难找到它。我还编写了下面的工具来计算最多4个机场的周期，从一个设定的机场开始和结束。这是我第一次在非学术背景下使用图形算法，这很酷。这是一项有趣的努力，创造了一个有望对某些人有用的工具。如果你正在计划一个超便宜的欧洲度假，你可以用这个来增加你的瑞安航空航班的所有行程！未来一个不错的补充是以某种方式获得每个飞行计划的价格数据。我找到了他们的API，而且非常简单：如果我发现我们的N长旅行变得太贵了，我可能会谈到这一点。如果这个网页很慢或者很笨重，我也很抱歉--通常我是网页优化的超级粉丝，但是这篇博客需要比平均速度慢得多的库来显示我想要展示的东西2。\n这张图实际上是这个问题的一个更有限的版本-因为每个机场都飞往TSF，我们正在人为地限制航线的数量。假设A、B和C在飞往TSF的图中。机场D不飞往tsf，但它确实飞往机场A，而机场B飞往d。此图不会向我们显示tsf-&&gt;；B-&&gt;；D-&&gt;；A-&&gt;；tsf的(更长)路线，因为它要求所有机场都飞往tsf。↩实际上说它们比平均速度慢既是对的，也不是对的-它们比大多数其他图书馆慢得多，但这也是因为它们所做的工作比大多数前端图书馆通常所做的工作要复杂得多。*iShares实际上说它们比平均速度慢是对的，也不是真的-它们比大多数其他图书馆慢得多，但这也是因为它们所做的工作比大多数前端图书馆通常所做的工作要复杂得多。我并不是说cytoscape没有优化(远非如此，它是一段令人惊叹的代码)，它只是在做一些你在javascript中通常不会做的事情。“↩", "note_en": "The graphs above are a cool visual representation but our end goal is really just a list of possible voyages - something like  TSF -&gt; SXF -&gt; MLA -&gt; TSF. The full list is here:   I thought it would be fun to see if we could actually find a Hamiltonian Cycle in the graph. Unfortunately, with 242 airports and over 4000 routes this would be nearly impossible to compute. It’s actually not that bad to find it in the final graph below, though - although it  is NP-Complete, when a graph is as connected with as many edges as above it’s actually not that difficult to find. I also wrote the tool below to compute cycles up to 4 airports in length, starting and ending from a set airport.   End    This was the first time I’ve used a graph algorithm in a non-academic context, which is pretty cool. It was a fun endeavour that created a tool that will hopefully be useful to some. If you’re looking to plan a super cheap European vacation you can just use this to add all the legs of your Ryanair flights! A nice future addition would be to somehow get price data for each flight plan. I found their API and it’s pretty straight forward:  I might get to that if I find that our N-length trip gets too expensive. Also I apologize if this webpage was slow or clunky - normally I’m a  huge fan of web optimizations, but this blog post needed libraries that are significantly slower than average to show what I wanted to show  2.\n  This graph is actually a more limited version of the problem - since every airport flies to TSF, we are artificially limiting the number of routes. Let’s say that A, B, and C are in the graph that fly to TSF. Airport D does not fly to TSF, but it does fly to airport A, and airport B flies to D. This graph would not show us the (longer) route of TSF -&gt; B -&gt; D -&gt; A -&gt; TSF, as it requires that  all airports fly to TSF.  ↩ Actually saying they’re slower than average is both true and not true - they  are significantly slower than most other libraries, but it’s also because they’re doing work that is significantly more complicated than most front end libraries normally do. I’m not saying Cytoscape isn’t optimized (far from that, it’s an amazing piece of code), it’s just doing things that you would not normally do in JavaScript.  ↩", "posttime": "2020-05-12 00:03:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hamiltonian,tsf", "title": "瑞安航空，哈密尔顿循环，以及使用图论寻找廉价航班(2018年)", "title_en": "Ryanair, Hamiltonian Cycles, and using graph theory to find cheap flights (2018)", "transed": 1, "url": "https://blog.jldc.me/posts/ryan-air?ref=hnm20", "via": "", "real_tags": ["tsf"]}, {"category": "", "categoryclass": "", "imagename": "3e6a2c00e43c6f3b5d10b3e893bff687.png", "infoid": 1001665, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软的Outlook for the Web面临着与占主导地位的Gmail竞争的艰巨任务，而Gmail的竞争优势很大程度上要归功于文本预测等ML驱动的功能。但微软正在采取措施，直接面对与现代Gmail相关的功能之一-文本预测和完成。\n在过去的一周里，该公司更新了其公开可见的Microsoft 365功能路线图，将Outlook on the Web-文本预测纳入其中。该功能的描述是：使用智能技术，Outlook将在您键入时预测文本。只需使用Tab键就可以接受文本预测。&#34；这表明该功能的工作方式与Gmail非常相似。\n微软还计划引入“稍后发送”功能，用于安排发出的电子邮件；能够查看任务类别并为其分配类别；支持可能影响工作日历可用性的个人日历；能够回复消息列表中的会议；重新设计移动Web；全面重新设计任务界面；以及新的编辑器，该编辑器具有Microsoft 365支持的功能。在众多功能中，微软还计划推出一项新的编辑器，其中包括对消息列表中的会议进行回复的功能、移动Web重新设计、任务界面的整体重新设计，以及具有Microsoft 365、Microsoft 365和Microsoft 365所支持的功能的新编辑器，这些功能都会影响到工作日历的可用性、移动Web重新设计、任务界面的整体重新设计，以及由Microsoft 365支持的新编辑器等。\n从整体上看，我们的目标显然是更接近Gmail的功能对等-尽管基于Web的Outlook有几个积极的方面，但距离这一目标还有很长一段路要走。\nOutlook for Web是微软Office 365生产力订阅服务的一部分。这家科技巨头最近将Office 365的家庭和个人版本重新命名为微软365，这让人想起了类似亚马逊Prime的模式，它包括的不仅仅是核心的传统产品。福利仍在充实中，但最初包括供个人使用的微软团队，新的类似Grammarly的Word编辑器工具，以及从Adobe和冥想和正念应用Headspace等合作伙伴那里获得的福利。\n在过去的几年里，微软的许多产品都转向了订阅模式。从最新的季度收益报告来看--这份报告赢得了投资者的高度评价--这似乎对该公司目前的业务非常有效。至少就投资者的兴趣而言，该公司最近的表现是多年来最好的。\n尽管如此，来自谷歌(和亚马逊，在某些服务方面)的竞争依然激烈。就功能而言，这意味着一场持续的军备竞赛，就像这个预测文本示例一样--这对这些服务或工具的用户来说可能是一件好事。", "note_en": "Microsoft Outlook for the Web has the unenviable task of competing with a dominant Gmail—and much of Gmail&#39;s competitive advantage is thanks to ML-driven features like text prediction. But Microsoft is taking a step to face off directly with one of the features associated with modern Gmail—text prediction and completion.\n In the past week, the company updated its  publicly visible roadmap for Microsoft 365 features to include &#34;Outlook on the Web - text predictions.&#34; The feature&#39;s description reads: &#34;Using smart technology, Outlook will predict text while you type. Just use the Tab key to accept the text prediction.&#34; This suggests the feature would work very similarly to the way it does in Gmail.\n Microsoft also plans to introduce a &#34;send later&#34; feature for scheduling outgoing emails, the &#34;ability to view and assign categories to tasks,&#34; support for personal calendars that can affect work calendar availability, the ability to RSVP to meetings from the messages list, a mobile Web redesign, an overall redesign of the tasks interface, and a new editor with &#34;capabilities powered by Microsoft 365,&#34; among many other things.\n Looking at the roadmap as a whole, the goal is clearly to get much closer to Gmail feature parity—which is many steps away, despite several positives about Web-based Outlook.\n Outlook for the Web is part of Microsoft&#39;s Office 365 line of productivity subscription services. The tech giant recently rebranded the family and personal version of Office 365 to  Microsoft 365, evoking an Amazon Prime-like model of including much more than just the core traditional offerings. Benefits are still being fleshed out, but they initially include Microsoft Teams for personal use, the new Grammarly-like Editor tool for Word, and perks from partners like Adobe and meditation and mindfulness app Headspace.\n Over the past several years, Microsoft has pivoted to a subscriptions model for many of its products. Judging by the  most recent quarterly earnings report—which earned high marks from investors—that seems to be working very well for the company&#39;s business for the time being. At least in terms of investor interest, the company has lately had its best run in many years.\n Still, competition from Google (and Amazon, for some services) remains fierce. That means a continued arms race of sorts in terms of features, like this predicting text example—and that&#39;s probably a good thing for users of any of these services or tools.", "posttime": "2020-05-12 00:03:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,微软,web,reveals,功能", "title": "微软公布了基于Web的Outlook新功能计划", "title_en": "Microsoft reveals plans for new Web-based Outlook features", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/05/microsoft-plans-to-add-gmail-like-predictive-text-to-outlook-for-the-web/", "via": "", "real_tags": ["microsoft", "微软", "web", "reveals", "功能"]}, {"category": "", "categoryclass": "", "imagename": "828f07a14cbc194434883331229d4de9.jpg", "infoid": 1001664, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你避免夸张，并长期坚持，在一个华丽的霓虹灯世界中保持低调的纪律，当你宣布一个不同寻常的消息时，你可能会得到些许信任。没有人有权两次享受这种礼遇。如果你对月亮吹嘘的消息不起作用，你的读者有理由相信你之后说的每一句话。\n我相信哺乳动物已经实现了重大的复兴，使用了一种相对良性的干预措施，显示了扩大到人类的希望。我要拿我的名誉打赌。\n在实现实质性、全系统复兴的竞赛中，哈罗德·卡彻(Harold Katcher)是一匹黑马。他有合适的学历和扎实的研究历史。事实上，在他早年的生活中，他是发现乳腺癌基因BRCA1的团队的一员。我向哈罗德要了一份传记素描，并把它印在了这篇帖子末尾的一个盒子里。\n但卡彻没有研究拨款，也没有大学实验室或风险投资基金，也没有研究生团队在后面的房间里挖掘数据库和筛选化学品。\n卡彻有一件事对他有利，那就是正确的理论。老龄化研究的大多数爆炸性增长(以及几乎所有的风险投资初创公司)都在寻求从细胞层面治疗衰老。他们的范式是，衰老是分子损伤的积累，他们认为自己的工作是设计适当的修复机制。\n正如卡彻所理解的那样，事实是，在很大程度上，衰老是通过血液中的信号分子在整个系统范围内进行协调的。十多年前，正是我们对这一愿景的共同认识让卡彻和我走到了一起。卡彻在下面简要描述了他2009年的顿悟。这是他2013年发表的一篇文章的来源(花了几年时间才付印)，主题是异种共生实验对老龄化科学未来的意义。\n当然，卡彻并不是唯一一个了解到血液中的信号分子将组织重新编程为全身更年轻状态的人。问题是，血浆中有数以千计的微小浓度的成分，但它们传递的信息是细胞读取的。这些中的哪些是导致衰老的原因呢？一小部分实验室，包括伯克利的康博伊实验室、哈佛的艾米·瓦格实验室和斯坦福大学的托尼·怀斯-科雷实验室，在过去的十多年里一直在寻找答案。\n卡彻已经能够猜测、直觉或通过实验确定这个问题的答案。两年前，在阿克沙伊·桑哈维(Akshay Sanghavi)的种子资金支持下，他在孟买建立了一个实验室，并试图使用从年轻老鼠血液中提取的一部分，让老年实验室的老鼠恢复活力。第一轮实验令人鼓舞，一年前发表在这个领域。他从这篇博客的一位读者那里获得了下一轮资金，并有足够的老鼠通过实验滴定剂量，并看看随着时间的推移再次老化的经过治疗的老鼠是否能成功地重新治疗。\n这个故事有一个漏洞，等待知识产权的解决。卡彻和桑格维还没有申请专利，也还没有找到合适的合作伙伴为人体试验提供资金。他们没有透露治疗的任何细节，除了这样一个事实，即它分四次静脉注射，而且它是从一小部分血浆中提取的。卡彻认为，所涉及的分子不会很难制造，这样当产品最终商业化时，就不需要从活体受试者的血液中提取，无论是啮齿动物还是人类。\n我们还在等待这些经过治疗的老鼠的寿命曲线。与此同时，最好的年龄替代指标来自加州大学洛杉矶分校(UCLA)的史蒂夫·霍瓦特(Steve Horvath)和其他科学家开发的甲基化时钟。至关重要的是，卡彻在霍瓦特身上找到了一个盟友，他不仅测试了他恢复活力的老鼠，还进行了必要的统计分析，开发了一套专门针对老鼠的六个甲基化时钟。其中五个时钟针对不同的组织进行了优化，其中一个是跨物种校准的，这样它就可以测量人类的年龄以及相应的“老鼠年”(大约1/40人年)的年龄。这种双物种时钟是一项重大的创新，是将动物模型的结果转化为人类可能的等价物的第一座桥梁。\n在周五发表在BioRxiv上的一篇论文中，Katcher和Horvath报告了恢复活力的大鼠的甲基化测量结果。“至关重要的是，对老年大鼠进行的血浆治疗[109周]大大降低了血液、肝脏和心脏的表观遗传年龄，达到了与年轻大鼠[30周]…相当的水平。”根据表观遗传时钟的最终版本，四个组织的平均返老率为54.2%。换言之，这种治疗使表观遗传年龄减少了一半以上。“。\n除了甲基化时钟之外，这篇论文还提供了通过许多其他方法恢复活力的证据。例如：\n在认知功能测试(巴恩斯迷宫)中，经治疗的大鼠得分高于老年大鼠，但不如年轻大鼠。\n血浆返老还童实验中的一个主要问题是必须多久进行一次治疗。血浆中的许多成分都是短暂的，会分泌到血液中，并在一天中持续吸收。卡彻的研究结果带来的好消息是，似乎只需要注射四针就能恢复活力。\n这些实验解决的第二个问题是，返老还童是否需要同时添加和去除血浆中的分子物种。例如，在老年血液中发现的促炎细胞因子水平要高得多。伊琳娜和迈克·康博伊，我认为他们是该领域最可信的人，他们说过，把坏演员从血液中剔除可能比恢复年轻水平的有益信号更重要。他们是15年前斯坦福大学的研究生，当时异种寄生虫科学的现代浪潮开始了，从那时起，他们就一直在追求这个课题。卡彻的实验只通过添加血液成分，而不是移除或甚至中和其他成分就取得了结果，这表明他已经找到了重新编程表观遗传学的必要公式，从而降低了不良行为者的水平。但如果去除一些等离子体成分，是否能取得更好的效果还有待观察。\n一个悬而未决的问题是关于老化时钟的位置和机制。多年来，我一直在两款车型之间犹豫不决：\n也许在下丘脑中有一个中央衰老时钟，它保持自己的时间，并将协调分散组织甲基化状态的信号传送到全身。\n关于表观遗传年龄的信息散布在身体各处，生物钟是一个反馈环，它不断地更新局部甲基化年龄，以响应收到的关于全球甲基化年龄的信号。\n数据中有一种暗示，下丘脑可能比其他组织更难恢复活力。在协调整个身体的年龄方面，它是否比其他组织起到更重要的作用？霍瓦特(个人交流)建议，在测量得到证实并进行更多实验之前，在得出这一推论时要谨慎。\n这些结果将过去十年来一直在获得可信度的三条线索汇聚在一起。相辅相成的是，这三个国家都有一种它们都无法单独提供的力量。\n衰老的根本原因是表观遗传进程，即一生中基因表达的变化。\n核DNA中的甲基化模式不仅是衰老的标志，而且是衰老的主要来源。因此，衰老可以通过重新编程DNA甲基化来逆转。\n有关身体年龄状态的信息通过血液中的信号分子在整个系统内传递。在局部，组织对这些信号作出反应，并按照它们的指示采用年轻或年老的细胞表型。\n所以，你可能会认为我是一个大器晚成的人。虽然我在文献中有数千条引用，发表的出版物从发现人类“乳腺癌基因”，到蛋白质结构、细菌学、生物技术、生物信息学和生物化学，我的工作没有中心或方向，因为我已经放弃了解决/治愈衰老的个人目标，当我得知“磨损”是导致衰老的原因时。然而，1985年，当我在加利福尼亚州与迈克尔·沃特曼(Michael Waterman)和坦普尔·史密斯(Temple Smith)(生物信息学之父)一起工作时，发生了一件令人费解的事情：我发现自己在重症监护病房，气管里插入了一根管子，知道我可能活不下去了。然后我做了一个梦：我梦见不知何故在遥远的未来(以及在另一个世界)，我被宴请为“给人类带来不朽”。显然，我在那次事件中幸存了下来(从一颗感染的牙齿开始)。但我过着美好的生活-成为一名计算机程序员(这是我喜欢的)，离开了马里兰大学的亚洲分部，成为一名全职教授，然后是日本东京的理科学术主任。2004年我离开日本时(我的女儿莎莎(Sasha)是日本学校系统的一名四年级学生，(Yonensei))，我在密歇根大学在线教书--有点退休了，并期待着写计算机。然而，我从未忘记那个梦。这显然是不可能的；我没有实验室-真的，没有办法修复所有受损的细胞-这就像扫回大海一样。然后，在2009年，我读了一篇2005年的旧论文，一篇由康博伊斯夫妇(迈克尔和伊琳娜)，汤姆·兰多和其他人写的论文，来自欧夫·魏斯曼的实验室，它彻底改变了我的生活；它告诉我，我认为关于衰老的一切都是错误的-衰老发生在组织层面，而不是细胞层面，而且是可以逆转的。故事的其余部分是关于坚持不懈和阿克沙伊·桑赫维(Akshay Sanghvi)的祝福干预的，他也看到了另一种方式，并提供了结构、金钱和情感上的支持(以及一些好的想法)，让我在72岁的时候在印度孟买开始了新的职业生涯。虽然我感觉比三年前年轻了20岁，但我想这是另一个关于衰老的暗示。现在是“神秘”的梦想吗？这不会是历史上第一次发生这样的事情-把它作为一个数据。", "note_en": "If you eschew hyperbole and hang in for the long haul, maintaining a discipline of understatement in the midst of a flashy neon world, you may be offered a modicum of credence when you make an extraordinary announcement. No one is entitled to this courtesy twice. If the news that you trumpet to the moon does not pan out, your readers will be justified in discounting everything you say thereafter.\n  I believe major rejuvenation has been achieved in a mammal, using a relatively benign intervention that shows promise of scaling up to humans. I’m going to stake my reputation on it.\n  In the race to effect substantial, system-wide rejuvenation, Harold Katcher is a dark horse. He has the right academic credentials and a solid history of research. In fact, in earlier life he was part of a team that  discovered the breast cancer gene,  brca1. I asked Harold for a biographical sketch, and have printed it in a box at the end of this posting.\n But Katcher has no research grants or university lab or venture capital funding, no team of grad students mining databases and screening chemicals in the back room.\n One thing Katcher has going for him is the correct theory. Most of the explosion in aging research (and virtually all the venture capital startups) are looking to treat aging at the cellular level. Their paradigm is that aging is an accumulation of molecular damage, and they see their job as engineering of appropriate repair mechanisms.\n The truth, as Katcher understands it, is that, to a large extent, aging is coordinated system-wide via signal molecules in the blood. It was our common realization of this vision that brought Katcher and me together more than a decade ago. Katcher briefly describes his 2009 epiphany below. It was the source of his  2013 essay (it took a few years to get it into print) on the significance of parabiosis experiments for the future of aging science.\n Of course, Katcher was not the only one to get the message about the power of signal molecules in the blood to reprogram tissues to a younger state throughout the body. The problem is that there are thousands of constituents represented in tiny concentrations in blood plasma, but conveying messages that cells read. Which of these are responsible for aging? A small number of labs, including the Conboys at Berkeley, Amy Wager at Harvard, and Tony Wyss-Coray at Stanford have been searching for the answer over the last decade and more.\n Katcher has been able to guess or intuit or experimentally determine the answer to this question. With seed funding from Akshay Sanghavi, he set up a lab in Mumbai two years ago, and tried to rejuvenate old lab rats, using a fraction extracted from the blood of younger rats. The first round of experiments were encouraging, published  in this space a year ago. He obtained the next round of funding from a reader of this blog, and had enough rats to titrate dosages experimentally, and to see if treated rats who aged again over time could be re-treated successfully.\n There is a hole in this story that awaits the resolution of intellectual property rights. Katcher and Sanghvi have not applied for patents and have not yet found a suitable partner to provide financing for human trials. They have not revealed any details of the treatment, besides the fact that it is in four intravenous doses, and that it is derived from a fraction of blood plasma. Katcher thinks that the molecules involved will not be difficult to manufacture, so that when a product is eventually commercialized, it will not require extraction from the blood of live subjects, rodent or human.\n We’re still waiting for longevity curves of these treated rats. In the meantime, the best available surrogate measure of age comes from methylation clocks, as developed by Steve Horvath at UCLA, and other scientists as well. Crucially, Katcher found an ally in Horvath, who didn’t just test his rejuvenated rats, but did the needed statistical analysis to develop a set of six methylation clocks specialized to rats. FIve of the clocks are optimized for different tissues, and one is calibrated across species, so that it can measure age in humans as well as corresponding age in “rat years” (about 1/40 human year). The two-species clock was a significant innovation, a first bridge for translating results from an animal model into their probable equivalent in humans.\n  In a  paper posted to BioRxiv on Friday, Katcher and Horvath report results of the methylation measurements in rejuvenated rats. “Crucially, plasma treatment of the old rats [109 weeks] reduced the epigenetic ages of blood, liver and heart by a very large and significant margin, to levels that are comparable with the young rats [30 weeks]….According to the final version of the epigenetic clocks, the average rejuvenation across four tissues was 54.2%. In other words, the treatment more than halved the epigenetic age.”\n  Besides the methylation clock, the paper presents evidence of rejuvenation by many other measures. For example:\n In tests of cognitive function (Barnes maze), treated rats scored better than old rats, but not as well as young rats.\n A major question in blood plasma rejuvenation experiments has been how often the cure must be administered. Many of the components of blood plasma are short-lived, secreted into the blood and absorbed continuously throughout the day. The good news from Katcher’s results is that it seems only four injections are needed in order to achieve rejuvenation.\n A second question which these experiments resolve is whether rejuvenation requires both adding and removing molecular species from the blood plasma. For example, pro-inflammatory cytokines are found in old blood at much higher levels. Irina and Mike Conboy, people who I regard as most credible in the field, have said that removing bad actors from the blood is probably more important than restoring youthful levels of beneficial signals. They were grad students at Stanford 15 years ago, when the modern wave of parabiosis science was initiated, and have pursued the subject continuously ever since. Katcher’s experiments have achieved their results only by adding blood components, not by removing or even neutralizing others.  This suggests that he has found the necessary formula for re-programming epigenetics, so that lower levels of the bad actors occur as a result. But i t remains to be seen whether even better results can be obtained if some plasma constituents are removed.\n A question that remains unresolved concerns the location and mechanism of the aging clock. I have been undecided over the years between two models:\n There is a central aging clock, perhaps in the hypothalamus, which keeps its own time and transmits signals throughout the body that coordinate methylation state of dispersed tissues\n Information about epigenetic age is dispersed through the body, and the body’s clock is a feedback loop that is continually updating methylation age locally in response to signals received about the methylation age globally.\n There is a suggestion in the data that the hypothalamus may be more difficult to rejuvenate than other tissues. Does it play a more important role than other tissues in coordinating the age of the entire body? Horvath (personal communication) counsels caution in drawing this inference until measurements are corroborated and more experiments are done.\n  These results bring together three threads that have been gaining credibility over the last decade. Mutually reinforcing, the three have a strength that none of them could offer separately.\n The root cause of aging is epigenetic progression = changes in gene expression over a lifetime.\n Methylation patterns in nuclear DNA are not merely a marker of aging, but its primary source. Thus aging can be reversed by reprogramming DNA methylation.\n Information about the body’s age state is transmitted system-wide via signal molecules in the blood. Locally, tissues respond to these signals and adopt a young or an old cellular phenotype as they are directed.\n  So, you might consider me a late bloomer.  While I have thousands of citations in the literature, with publications ranging from the discovery of the human ‘breast cancer gene’, to protein structure, bacteriology, biotechnology, bioinformatics, and biochemistry, there was no center or direction to my work as I had given up my personal goal of solving/curing aging when I learned that ‘wear and tear’ was the cause of it.  Yet something happened in year 1985 when I was in California working with Michael Waterman and Temple Smith (fathers of bioinformatics) that is inexplicable: I found myself in Intensive Care with a tube inserted into my trachea and the knowledge that I might not live.   And then I had a dream: I dreamed that somehow in the far future (and on another world), I was being feted for ‘bringing immortality to mankind’. Clearly, I survived that incident (started with an infected tooth).    I lived a wonderful life – becoming a computer programmer (which I loved), leaving that for the University of Maryland’s Asian division, becoming a full professor and then the Academic Director for the Sciences, in Tokyo, Japan.  By the time I left Japan in 2004, (my daughter Sasha was a fourth-grader, (yonensei), in the Japanese school system), I was teaching for U of M online – somewhat retired, and looking forwards to writing computer programs for fun and profit. Yet I never ever forgot that dream. It was clearly impossible; I had no lab – and really, there was no way to repair all damaged cells – it’d be like sweeping back the ocean. And then, in 2009, I read an old paper from 2005, a paper written by the Conboys, (Michael and Irina), Tom Rando and others, coming from Irv Weisman’s lab, that completely changed my life; that showed me that everything I believed about aging was wrong – that aging occurred at the organismic level, not at the cellular level and could be reversed. Well, the rest of the story is about persistence and the blessed intervention of Akshay Sanghvi who too saw there was another way and provided the structural, monetary, and emotional support (and some good ideas) that had me start a new career at age 72 in Mumbai, India.  I feel twenty years younger than I did three years ago, I guess that’s another hint about aging. Now the ‘mystical’ dream?  It wouldn’t be the first time in history that that happened – take that as a datum.", "posttime": "2020-05-11 23:48:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "减龄,reduction,实验室", "title": "减龄突破", "title_en": "Age Reduction Breakthrough", "transed": 1, "url": "https://joshmitteldorf.scienceblog.com/2020/05/11/age-reduction-breakthrough/", "via": "", "real_tags": ["减龄", "reduction", "实验室"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001663, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "⇦我有一个理论，认为1995年犯了一个严重的错误--决定不用一种整洁、简洁和声明的方式来表示JavaScript中的HTML元素。\n在这篇文章中，我将描述事情的现状，展示几个对javascript语法的非常小的补充，它们可能已经产生了很大的不同，然后再谈一谈它带来的影响。在这篇文章中，我将描述目前的状况，展示几个对javascript语法的非常小的补充，它们可能会带来很大的不同，然后再谈论其影响。\nconst myLi=Name=&gt；`&lt；li&gt；我的名字是&lt；em&gt；${name}&lt；/em&gt；&lt；/li&gt；`const Myul=Names=&gt；`&lt；ul class=&#34；my-ul&#34；&gt；${names.map(myLi).join(&#39；&#39；)}&lt；/ul&gt；`。\n这是垃圾，原因很明显--编写字符串很容易出错，没有输入/打印等等。然后我们必须将它们转换为不太优雅的元素：\n当然，也有各种各样的库，从字符串模板库(如把手)到可编译的库(如.jsx)。\n类型HtmlNode={Tag：String，Attributes：{[Key：String]：String|Function}，子项：(HtmlNode|String)[]}。\n{Tag：&#34；Button&#34；，Attributes：{&#34；id&#34；：&#34；Baz&#34；，&#34；class&#34；：&#34；Foo bar&#34；，&#34；data&#34；：&#34；1&#34；，&#34；onclick&#34；：F，}，Children：[&#34；Hello&#34；，{tag：&#34；em&#34；，属性：{}，子项：[&#34；here&#34；]，}]}。\nHTML(lang=&#34；EN&#34；)head title=pageTitle body h1.一些类Jade-node模板引擎#CONTAIN-如果(YouAreUsingJade)你很棒\n这看起来不错，主要问题是我们在编程构造上有点局限，例如，我们如何使&lt；h1&gt；在某些条件下隐藏额外的类？Jade通过3种不同的方式指定类来绕过这个问题。与其想出一种特殊的模板语言，不如稍微扩展一下普通的js语法。\n好的，让我们来看看上面的例子。我不会过多地强调这一点的正确性，因为我并不是建议我们更改所有代码，而只是更改可能的代码。\n因此，下面是允许现有js对象语法以相当简洁的方式表示html节点的事项清单：\n除了键：值对之外，对象还允许拖尾值。我想可以用foo.~或一些特殊的构造来访问它们。\n它们获得一个可选标签(在本例中为按钮)。如果您做过很多JSON反序列化工作，那么标记似乎是个好主意(它们可以帮助您将数据映射到类型)，看看它们在edn-nices中是如何使用的(通过自定义命名空间)。\n就是这样。我们的javascript将使用它作为主数据类型(其他所有内容都将保持不变)。也许，我们会开始(重新)编写所有类似XML的html，以便也使用这种语法。\nConst Names=[&#34；Barry&34；，&#34；Lynette&34；]Const myLi=name=&gt；li{&#39；我的名字是&#39；em{name}}const Myul=Names=&gt；ul{class：[&#39；my-ul&#39；].names.map(MyLi)}app.get(&#39；/&#39；，(req，res)=&gt；res.。\n正文{class：&#34；language-javascript&#34；a{href：&#34；index.html&#34；img{style：&#34；Height：2EM&#34；src：&#34；pic.png&#34；}&#34；⇦&#34；}H1{&#34；如果我们最好使用代码{&#34；html&#34；}&#34；-in-&##。}句法一直？p我有一个理论，1995年犯了一个严重的错误.&#34；}}。\nJSON和HTML之间没有区别。(API设计的下游后果会是什么？)。\n我们的html只是结构化的数据，这会不断地让我们目不转睛地看着我们。\n我们就不会有像淘汰赛(还记得那一次吗？)那样在html中使用奇怪逻辑的年代了。\n我们在1996年可能会有类似的反应，而那只会是废话，很明显，我们会像诅咒一样做这件事。(这句话的意思是：“如果是在1996年，我们可能会有类似的反应，而那只会是废话，显然我们会像诅咒一样做这件事)。”\n我们本可以拥有一个可组合的库，用于日期选择器、情态函数等，而不必使用这个庞大的库。\n没有人会使用handlebar/jinsa/twig string munging库来制作html(至少在节点世界中是这样)。\nhtml&lt；form&gt；-&gt；json阻抗不匹配(尝试将嵌套数据描述为表单)现在可能已经正确排序。\n本世纪初，每个人的一切都是XML的计划可能会更成功。(这会是件好事吗？)\n我认为这是一个足够好的解决方案，但是它与您的标准js对象的语法不同这一事实鼓励人们将VDOM对象视为不是普通数据，但事实并非如此。记谱法本身就是一种思维工具。\n我们的另类历史从未发生过，我更喜欢无聊的超级脚本风格，一切都是代码。", "note_en": "⇦    I have a theory that a grave mistake was made in 1995 - the decision not to have a neat, succinct and declarative way of representing html elements in javascript.\n  In this post, I&#39;m going to describe the current state of affairs, show a couple of very small additions to javascript&#39;s syntax that might&#39;ve made all the difference, then talk about the repercussions.\n          const myLi = name =&gt; `&lt;li&gt;My name is &lt;em&gt;${name}&lt;/em&gt;&lt;/li&gt;`const myUl = names =&gt; `&lt;ul class=&#34;my-ul&#34;&gt;${names.map(myLi).join(&#39;&#39;)}&lt;/ul&gt;`\n  This is rubbish for obvious reasons - composing the strings is bug-prone, no typing/linting etc etc. We then have to turn them into elements with the  less than elegant:\n              Of course, there are also various libraries, ranging from string templating ones (like  handlebars) through to compile-away ones like  .jsx.\n      type HtmlNode = { tag: string, attributes: {[key: string]: string | Function}, children: (HtmlNode | string)[]}\n        { tag: &#34;button&#34;, attributes: { &#34;id&#34;: &#34;baz&#34;, &#34;class&#34;: &#34;foo bar&#34;, &#34;data&#34;: &#34;1&#34;, &#34;onclick&#34;: f, }, children: [ &#34;Hello&#34;, { tag: &#34;em&#34;, attributes: {}, children: [&#34;there&#34;], } ]}\n      html(lang=&#34;en&#34;) head title= pageTitle body h1.some-class Jade - node template engine #container - if (youAreUsingJade) You are amazing\n  This seems nice, the main problem is we are a bit confined in our programming constructs, for example, how would we make the  &lt;h1&gt; have the additional class  hidden on some condition? Jade gets around this by having 3 different ways of specifying classes. Rather than come up with a special templating language, let&#39;s just slightly extend vanilla  js syntax.\n    Right, let&#39;s have a go with the example from above. I&#39;m not going to put too much weight on the correctness of this as I&#39;m not suggesting we change all our code, only a &#34;what might&#39;ve been&#34;.\n            So, a checklist of things to allow existing  js object syntax to represent html nodes in a reasonably succinct way:\n  As well as  key: value pairs, objects allow trailing  values. I guess these would be accessible with  foo.~ or some special construct.\n  They get an optional tag (in this case  button). If you&#39;ve done much JSON deserialisation, tags seem like a good idea (they can help you map data to types), take a look at how they&#39;re used (with custom namespacing) in  edn - nice.\n  That&#39;s it. Our javascript would use this as the main data type (everything else would remain the same). Probably, we&#39;d start (re)writing all our XML-ish html to also use this syntax.\n          const names = [&#34;Barry&#34;, &#34;Lynette&#34;]const myLi = name =&gt; li{&#39;My name is &#39; em{name}}const myUl = names =&gt; ul{class: [&#39;my-ul&#39;] ...names.map(myLi)}app.get(&#39;/&#39;, (req, res) =&gt; res.send(myUl().asHTMLStr())\n    body{class: &#34;language-javascript&#34; a{href: &#34;index.html&#34; img{style: &#34;height:2em&#34; src: &#34;pic.png&#34;} &#34;⇦&#34;} h1{&#34;What if we&#39;d had better &#34; code{&#34;html&#34;} &#34;-in-&#34; code{&#34;js&#34;} syntax all along?&#34;} p{&#34;I have a theory that a grave mistake was made in 1995 ...&#34;} ...\n    There would be no distinction between  JSON and  html.  (What would have been the downstream consequences to API design?)\n  It would be constantly staring us in the face that our html is  just structured data.\n  We wouldn&#39;t have had the years of weird logic-in-html stuff like in  knockout (remember that one?)\n  We might&#39;ve had a React-a-like in 1996, and it would have just been &#34;duh, obviously we&#39;ll just do it like  curses&#34;.\n  We would have had a composable libraries for date selectors, modals, etc. without having to use said big-hairy-library.\n  No one would be using handlebars/Jinja/twig string munging libraries to make html (in the node world at least).\n  The html  &lt;form&gt; &lt;-&gt;  json impedence mismatch (try describing nested data as a form) would probably have been properly sorted by now.\n  Everyones&#39; early noughties plans for  everything to be  XML might&#39;ve been more successful.  (Would that have been good?)\n    I think it&#39;s a fine enough solution, but the fact that it&#39;s a different syntax from your standard  js objects encourages people to consider the VDOM objects as &#34;not normal data&#34;, but they  are.  Notation as a tool of thought innit.\n      Our alternative history having never happened, I  prefer the boring hyperscript style, everything is &#34;just code&#34;.", "posttime": "2020-05-11 23:34:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "js,html", "title": "如果我们一直有更好的HTML-in-JS语法会怎么样？", "title_en": "What if we'd had better HTML-in-JS syntax all along?", "transed": 1, "url": "https://leontrolski.github.io/dom-syntax.html", "via": "", "real_tags": ["js", "html"]}, {"category": "", "categoryclass": "", "imagename": "ca4507e2d1c91c190852680f7710f010.png", "infoid": 1001661, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚当·马格亚尔走红了。他最近拍摄的“不锈钢”系列以超慢动作播放地铁站台的视频，这一系列作品在网络上引起了轩然大波。Magyar首先从一列快速到达的火车上拍摄站台上的人，然后放慢镜头，突出经常被遗漏的细节和很少被记住的表情。无论是柏林的亚历山大广场、东京的新宿还是纽约市的中央车站，Magyar的视频片段都显示了拥挤的地铁站台，这些站台有时让人难以忘怀，有时又很优雅。等待下一班火车看起来从未如此令人信服。\n这段两分钟的片段是中央车站视频的一小段；整个视频长达11分钟，实时显示的一幕只持续了大约12秒。如果你在马扎尔拍摄每一个场景时站在他旁边，以接近每小时30英里的速度冲进车站，你可能不会再考虑两个男人因为某个共同的笑话而大笑，或者一对女孩在Alexanderplatz的站台上跑来跑去。就没有足够的时间了。但通过马扎尔的镜头，这些行动实际上已经被冻结，并变得有意义。\n马扎尔的项目之所以能引起如此强烈的共鸣，部分原因是他捕捉到了精细的细节，比如嘴巴周围的皱纹，某人的一缕头发。他把重点放在最有趣的人群上，比如亚历山大广场(见下图)，在那里，两个女孩在背景中奔跑-他说这是一份“礼物”-决定了一群服务员和另一群服务员的不同之处。最终的产品很大程度上要归功于他充分的准备。“我总是花更多的时间在计划上，而不是捕捉上，”他最近通过电子邮件告诉我。“你做你的计算和测试…。然后图像就像你想象的那样发生了。这是一种非常奇妙的感觉。“。\n马扎尔说，如果他在一个地点找到了合适的能量，他真的不必在车站等很长时间就能捕捉到合适的序列，尽管如果他去一个城市拍摄，他几乎所有的时间都花在地铁系统里。在新宿的情况下，他在东京车站闲逛了几个星期后，只拍了两个镜头。但是，正确的设备与正确的时机同样重要。\nMagyar通过使用相机捕捉运动图像的帧，速度快于我们的肉眼所能感知的速度，然后以更慢的速度播放它们，从而产生了这种效果。Magyar以每秒约1300帧的速度拍摄了这群人，是电影中标准每秒24帧的54倍。一些研究表明，我们的眼睛和大脑可以在短短13毫秒内识别出一张图像-眨眼的时间大约相当于每秒75帧，仅为不锈钢胶片速度的1/17。(Magyar使用的是改装后的Optronis相机，实际上每秒可以拍摄10万帧，这将使运动速度减慢到正常速度的近1/4000。)。\n本文是鹦鹉螺长达一个月的时间科学与艺术探索的一部分。在录音棚里，时间不会流逝--只有“永恒的现在”。来自工作室的艺术是一种结晶形式的.。多读。\n在几年的时间里，马扎尔捕捉到了这段视频，并用他创建的软件和他修改的硬件对其进行了处理。他的DIY伦理延伸到他工作的方方面面，从他用来校正原始数据的计算机程序，到他改装的相机，再到他发明的小玩意儿，比如寻呼机大小的传感器，它可以测量经常潮湿的地铁系统地下世界中的灯光闪烁。\n马扎尔并不是第一个创作这种视觉作品的人。业余摄影师格雷姆·泰勒(Graeme Taylor)捕捉到了英国巴斯一列火车通过站台的场景。特雷·拉特克利夫减缓了东京各条街道上的城市运动。“从技术上讲，我没有做任何还没有做过的事情。在公共场所也做了相当多的慢动作项目。但据我所知，还没有人像这样用这种质量扫描过地铁列车，“Magyar说。\n尽管最近人们对他的作品兴趣高涨，但他以前在他的静止全景照片中玩弄过时间，最有趣的是，我会争辩说。\n在他的Urban flow系列中，Magyar在上海、香港、伦敦和纽约创造了拥挤的空间和经过的地铁列车的全景。这里的环境是城市的，所以人群和过往的火车都很容易到达。这些图像的独特之处在于，马贾尔应用了一种名为狭缝扫描的技术，顾名思义，这种技术就是摄像机在狭缝前面移动时捕捉场景。如果拍摄对象的移动速度与感光胶片通过缝隙的速度相同，则运动中的拍摄对象看起来很清晰；如果它们的移动速度比胶片快或慢，则记录的内容是模糊的。\n到了20世纪初，足智多谋的摄影师发现，他们可以通过手动或自动将相机内的胶片移过狭缝来制作狭缝扫描照片。这项技术对拍摄比赛的终点线非常有效，因为比赛的第一名和第二名可以通过鼻子的不同来确定。你只需对车内的机械部件进行编程，使其移动速度与赛车手的移动速度一样快即可。Magyar的Optronis相机以数字方式进行计算和成像，扫描的空间狭长只有1个像素宽，大约相当于一个红细胞的长度。\n马扎尔说，他并不满足于仅仅是能够利用数字技术的一个功能，比如高速扫描场景的碎片或以超高帧率拍摄视频。“除了所有的技巧，结果需要提供一些洞察力-否则，它只会很有趣，而不是动人，”他说。因此，他花了数年时间为他的一些系列做准备，策划如何描绘城市人的风景，最后将人们的注意力吸引到他所说的“不重要的、被忽视的时刻”上。在去年的一次PopTech会议上，他说，“我总是对剩下的感兴趣。”现在我们也感兴趣了。", "note_en": "Adam Magyar’s gone viral. His recent series   Stainless, in which video recordings of subway platforms are played out in super-slow-motion, has been  rippling across the web. Magyar first films people on the platform from a speedily arriving train and then slows the footage down, highlighting details and expressions that are often missed and rarely remembered. Regardless of station—Berlin’s Alexanderplatz, Tokyo’s Shinjuku, or New York City’s Grand Central—Magyar’s video excerpts show crowded subway platforms that are at some times haunting, at others elegant. Waiting for the next train never looked so compelling.\n    This two-minute excerpt is one small piece of the Grand Central clip; the entire video runs almost 11 minutes, showing a scene that only lasted about a dozen seconds in real time. If you were standing next to Magyar when he shot each scene, rushing into a station at close to 30 miles per hour, you probably wouldn’t have given a second thought to two guys laughing at some shared joke, or a pair of girls running across the platform at Alexanderplatz. There wouldn’t have been enough time. But through Magyar’s lens, these actions have been practically frozen, and made meaningful.\n  Part of the reason Magyar’s project has struck such a chord is the fine details he’s captured, like the crease around a mouth, the wisps of someone’s hair. And he’s focused on the most interesting sets of crowds, like that on the Alexanderplatz (below), where the two girls running in the background—a “gift,” he says—make all the difference between one group of waiters and another. Much of the final product can be attributed to his ample preparation. “I always spend more time with planning than capturing,” he told me recently over email. “You make your calculations and tests … and then the image happens just as you imagined. It’s a pretty amazing feeling.”\n    Magyar says that if he finds the right energy in a spot, he doesn’t really have to wait long at a station to capture the right sequence, though he spends nearly all his time in a subway system if he visits a city to shoot it. In the case of Shinjuku, he only ended up shooting two sequences after hanging out at the Tokyo station for a couple of weeks. But the right equipment is just as important as good timing.\n  Magyar creates this effect by using a camera to capture frames of a moving image faster than our eyes can perceive them, and then playing them back much more slowly. Magyar filmed the throng of people at about 1,300 frames per second, 54 times the 24 frames per second used as a standard in movies.  Some research shows that our eyes, and brain, can identify an image in as little as 13 milliseconds—a blink of time that would correspond to approximately 75 frames per second, only 1/17th as fast as the footage in  Stainless. (Magyar used a modified Optronis camera that can actually shoot up to 100,000 frames per second, which would slow down motion to almost 1/4,000th of its usual speed.)\n This article is part of Nautilus’ month-long exploration of the science and art of time. Read the introduction here.In the studio, time does not pass—there is only an “eternal now.” The art coming from the studio is a crystallized form of...  READ MORE\n  Over the span of a couple of years, Magyar captured the footage, and processed it with software he created and hardware he modified. His DIY ethic stretches across all aspects of his work, from the computer programs he uses to correct raw data, to his modified camera, to gadgets he invents, like a beeper-sized sensor that measures light flickering in the often dank netherworld of subway systems.\n    Magyar isn’t the first to create this type of visual piece. One amateur photographer, Graeme Taylor, captured the scene of  a train passing a platform in Bath, England. Trey Ratcliff slowed down  urban motion on various streets across Tokyo. “In a technical sense, I’m not doing anything that hasn’t been done yet. Quite a few slow-motion projects have been done in public spaces, too. But as far as I know, no one has scanned subway trains like this, and [with] this quality,” Magyar says.\n  Although interest in his work spiked quite recently, he’s played with time before, and most interestingly I’d argue, in his still panoramic photographs.\n    In his  Urban Flow series, Magyar creates panoramas of crowded spaces and passing subway trains in Shanghai, Hong Kong, London, and New York. The settings are urban, so both crowds and passing trains are easy to come by. What’s unique in these images is Magyar’s application of a technique called slit-scan, in which, as the name suggests, a camera captures a scene as it moves in front of a thin slit. If the subject is moving at the same rate as the photosensitive film moving past the slit, the subject in motion looks crisp; if they move faster or slower than the film, what you’ll record is a blur.\n  By the early 20th century, resourceful photographers found that they could make slit-scan pictures by manually or automatically moving film within the camera past the slit. This technology worked—and still works—perfectly for  photographing the finish line of a race, where first and second place can be determined by the difference of a nose. You just have to program the mechanical parts inside to move as quickly as the racer will be moving. Magyar’s Optronis camera does the calculations and imaging digitally, scanning a sliver of space only 1 pixel wide—just about the length of a red blood cell.\n  Magyar says he isn’t satisfied with just being able to utilize a feature of digital technology, like scanning slivers of a scene at high speed or shooting video at super-high frame rates. “Beyond all the tricks, the outcome needs to provide some insight—otherwise, it’ll only be interesting, rather than moving,” he says. So he invests years into preparation for some of his series, plotting ways to portray a landscape of urban people, and finally drawing attention to what he has called “the unimportant, the ignored moments.” In a PopTech conference last year, he said, “I was always interested in the rest.” Now we’re interested too.", "posttime": "2020-05-11 23:25:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "摄影,叮当作响,tinkers,速度", "title": "“与时间叮当作响的摄影师”(2015)", "title_en": "A Photographer Who Tinkers with Time (2015)", "transed": 1, "url": "http://nautil.us/issue/22/slow/a-photographer-who-tinkers-with-time", "via": "", "real_tags": ["摄影", "叮当作响", "tinkers", "速度"]}, {"category": "", "categoryclass": "", "imagename": "6ad35de01359df1b430106d0e8053c66.jpg", "infoid": 1001660, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "包括YouTube、Vimeo和Facebook在内的社交媒体公司正在删除一段病毒式阴谋论视频，因为该视频声称是关于冠状病毒大流行的。\n这段大约26分钟的视频被作为一部名为“Plandhemic”的全长电影的极长“预告片”呈现，并对朱迪·米科维茨(Judy Mikovits)进行了长时间的采访。朱迪是反疫苗运动中的知名人物，曾就疫苗的效果发表过各种不可信的说法。\nYouTube的一位发言人说，该公司删除了“包括未经医学证实的冠状病毒诊断建议的内容”，其中包括“Plandhemic”视频。Facebook的一名代表说，“暗示戴口罩会让你生病，可能会导致迫在眉睫的伤害，所以我们删除了这段视频。”\nVimeo的一位发言人说，该公司“坚定不移地保护我们的平台不受传播有害和误导性健康信息的内容的影响。由于违反了这些政策，我们的信任与安全团队已经删除了相关视频。“。\n推特对“华盛顿邮报”的回应是，米科维茨发布的一条推文分享了她的另一段视频采访，这并不违反其冠状病毒政策，但该公司已经从搜索和趋势部分删除了#腐败瘟疫和#PlandemicMovie标签。\n这段视频错误地声称，亿万富翁帮助传播了冠状病毒，以进一步传播疫苗。它还使用了安东尼·S·福奇(Anthony S.Fuci)在白宫新闻发布会上发言的断章取义的镜头，攻击了国家过敏和传染病研究所所长安东尼·S·福奇(Anthony S.Fuci)的可信度。最后，它提出了毫无根据和危险的说法，即戴口罩是有害的。\n据Digital Trends报道，到它从Facebook上删除时，它已经获得了“180万点击量，包括1.7万条评论和近15万条分享”。\n据邮报采访的多位专家称，阴谋论在全球大流行期间蓬勃发展，部分原因是人类对不确定性感到基本不适。\n心理学家、阴谋论信仰专家迈克·伍德(Mike Wood)说，很多时候，“这些都是从早期的阴谋论中回收来的。”他研究了2016年寨卡病毒爆发期间错误信息的传播。“在大流行中，马上就会有阴谋论说，病毒要么是无害的，要么是会杀死所有人的生物武器，要么是政府提供疫苗会杀死所有人的借口。”\n“Facebook表示，它已经给这些不准确的信息贴上了标签，并降低了它们在用户日常馈送中的排名，”“华盛顿邮报”的托尼·罗姆(Tony Romm)写道，并补充说，Twitter已经“开始引导美国用户搜索与冠状病毒相关的标签，指向疾病控制和预防中心。”\n正如“麻省理工技术评论”(MIT Technology Review)的艾比·奥尔海瑟(Abby Ohlheiser)所写：“随着冠状病毒的流行，YouTube引入了具体的政策，禁止质疑疾病传播或存在的视频，宣传未经证实的治疗方法，或鼓励人们无视官方指导。”", "note_en": "Social media companies including YouTube, Vimeo and Facebook are removing a viral conspiracy theory video because of its claims regarding the  coronavirus pandemic.\n The approximately 26-minute video was presented as an extremely long “trailer” for a full-length film titled “Plandemic” and features an extended interview with  Judy Mikovits, a well-known figure in the anti-vaccination movement who has made  various discredited claims about the effects of vaccines.\n A YouTube spokesperson said the company removes “content that includes medically unsubstantiated diagnostic advice for covid-19,” which includes the “Plandemic” video. A representative for Facebook said, “Suggesting that wearing a mask can make you sick could lead to imminent harm, so we’re removing the video.”\n  A Vimeo spokesperson said the company “stands firm in keeping our platform safe from content that spreads harmful and misleading health information. The video in question has been removed by our Trust &amp; Safety team for violating these very policies.”\n  Twitter responded to The Washington Post by stating that a tweet from Mikovits sharing a different video interview of hers does not violate its covid-19 policy but that the company has removed the hashtags #PlagueofCorruption and #PlandemicMovie from its searches and trends sections.\n The video makes the false claim that billionaires aided in the spread of the coronavirus to further the spread of vaccines. It also attacks the credibility of Anthony S. Fauci, director of the National Institute of Allergy and Infectious Diseases, by using out-of-context footage of him speaking at White House news briefings. Finally, it makes the baseless and dangerous claim that wearings masks is harmful.\n   By the time it was removed from Facebook, it had racked up “1.8 million views, including 17,000 comments and nearly 150,000 shares,” Digital Trends  reported.\n  Conspiracy theories have flourished during the global pandemic, partially because of basic human discomfort with uncertainty, according to  various experts interviewed by The Post.\n  Many times, “these are recycled from earlier conspiracy theories,” said Mike Wood, a psychologist and expert on belief in conspiracy theories, who studied the spread of misinformation during the Zika outbreak in 2016. “In a pandemic, there’s immediately going to be conspiracy theories that the virus is either harmless, a bioweapon that’s going to kill everybody or an excuse for the government to give a vaccine that is going to kill everybody.”\n   “Facebook said it has labeled the inaccuracies and lowered their rank in users’ daily feeds,”  wrote The Post’s Tony Romm, adding that Twitter has “started steering U.S. users searching for coronavirus-related hashtags to the  Centers for Disease Control and Prevention.”\n  And as MIT Technology Review’s Abby Ohlheiser  wrote: “As covid-19 took hold, YouTube introduced specific policies prohibiting videos that question the transmission or existence of the disease, promote unsubstantiated cures, or encourage people to ignore official guidance.”", "posttime": "2020-05-11 23:24:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,病毒,阴谋,companies,冠状病毒", "title": "Facebook和其他公司正在删除病毒式的“Plandhemic”阴谋视频", "title_en": "Facebook and other companies are removing viral ‘Plandemic’ conspiracy video", "transed": 1, "url": "https://www.washingtonpost.com/technology/2020/05/07/plandemic-youtube-facebook-vimeo-remove/", "via": "", "real_tags": ["facebook", "病毒", "阴谋", "companies", "冠状病毒"]}, {"category": "", "categoryclass": "", "imagename": "603b7d33f61318b4f8a40a72f3fadf67.jpg", "infoid": 1001659, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英特尔公司迅雷端口发现的一组新漏洞使数百万台机器面临本地黑客攻击的风险。英国埃因霍温大学的比约恩·鲁伊滕贝格教授的这项新研究表明，如果黑客只获得了5分钟的机器访问权限，他们就可以绕过登录方法，获得完全的数据访问权限。\n装有Windows、Linux和MacOS的计算机中存在Thunderbolt端口。因此，这涵盖了很多电脑。鲁伊滕贝格表示，2011至2020年间出货的所有迅雷版本和系统都受到了影响，没有软件补丁可以修复这些漏洞。因此，英特尔需要重新设计硅来修复这些缺陷。\n在这里你无能为力。然而，使用由Ruytenberg和他们的团队开发的名为Thunderspy的开源软件，你可以检查你是否受到Thunderboltbug的影响。\n这些工具可用于Windows和Linux系统。不幸的是，MacOS用户没有可用的工具。\n通过桌面浏览器进入Thunderspy网站，点击“Thunderspy for Windows”下载该工具。\n然后，迅雷间谍工具将尝试检测您系统上的迅雷控制器。在此过程中，该工具可能会要求您安装其他自定义驱动程序或进入省电模式。\n检查结束后，迅雷将提交分析总结。您可以点击“报告”获得更详细的报告。\n通过桌面浏览器进入Thunderspy网站，点击“Thunderspy for Linux”下载该工具。\n请注意，要运行此命令，您将需要root权限。要在没有root用户的情况下运行该工具，只需从上面的命令中删除‘sudo’即可。\n运行该命令后，Spycheck将向您显示详细报告。您可以通过“-o FILE.json”命令将报告导出到JSON。\n虽然你不能做任何事情来修补这些漏洞，但你不应该使用未知的迅雷设备，或者把你的电脑留在公共场所无人看管。当您离开系统时休眠或关闭系统电源，而不是将其置于睡眠模式。\n如果你是高级用户，或者想为Thunderspy工具做贡献，你可以在GitHub这里查看它的代码。你可以在这里阅读鲁滕贝格的完整研究。\n阅读我们关于科技行业如何应对冠状病毒的每日报道，并订阅我们的每周时事通讯“冠状病毒”(CoronaVirus)。\n有关远程工作的提示和诀窍，请在此处查看我们的增长季度文章或在Twitter上关注我们。", "note_en": "A new set of flaws discovered in the Intel Thunderbolt port has put millions of machines at risk of local hacking. This new research by   Eindhoven University‘s Björn Ruytenberg suggests that if a hacker gains access to a machine for just five minutes, they could bypass login methods to gain full data access.\n Thunderbolt ports are present in machines with Windows, Linux, and macOS. So, that covers a lot of computers. Ruytenberg said all Thunderbolt versions and systems shipped between 2011 to 2020 are affected and no software patch can fix these vulnerabilities. So, Intel would need to redesign silicon in order to fix these flaws.\n      There’s not much you can do here. However, with open-source software called Thunderspy, developed by Ruytenberg and their team, you can check if you’re affected by the Thunderbolt bug.\n These tools are available for Windows and Linux systems. Unfortunately, there’s no tool available for macOS users.\n  Go to  the Thunderspy website through your desktop browser and click on “Thunderspy for Windows” to download the tool.\n    Thunderspy tool will then try to detect the Thunderbolt controller on your system. During the process, the tool might ask you to install additional custom drivers or enter in power saving mode.\n After the inspection, Thunderspy will present an analysis summary. You can click on “Report” to get a more detailed report.\n   Go to  the Thunderspy website through your desktop browser and click on “Thunderspy for Linux” to download the tool.\n  Please note that to run this command, you will need root privileges. To run the tool without root, simply remove ‘sudo’ from the above command.\n After you run the command, Spycheck will show you a detailed report. You can export the report to JSON through “-o FILE.json” command.\n While you can’t do anything to patch these vulnerabilities, you shouldn’t use unknown Thunderbolt devices, or leave your computer unattended in public places. Hibernate or power off your system when you’re stepping away from it rather than putting it in sleep mode.\n If you’re an advanced user or want to contribute to the Thunderspy tool, you can check its code on GitHub  here. You can read Ruytenberg’s full research  here.\n    Read our  daily coverage on how the tech industry is responding to the coronavirus and subscribe to our weekly newsletter  Coronavirus in Context.\n  For tips and tricks on working remotely, check out our Growth Quarters articles  here or follow us on  Twitter.", "posttime": "2020-05-11 15:14:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,漏洞,bug,迅雷", "title": "迅雷漏洞让黑客在“五分钟”内窃取你的数据", "title_en": "Thunderbolt Bug Lets Hackers Steal Your Data in 'Five Minutes'", "transed": 1, "url": "https://thenextweb.com/security/2020/05/11/theres-a-new-thunderbolt-bug-check-if-your-computer-is-affected/", "via": "", "real_tags": ["黑客", "漏洞", "bug", "迅雷"]}, {"category": "", "categoryclass": "", "imagename": "76feb1d65211e897e82b2e193b6f31ab.jpg", "infoid": 1001658, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从喜欢吃糖的孩子到发誓只需要再吃一口巧克力的祖父母，人类绝对喜欢吃糖。从进化的角度来看，这是有意义的。糖过去是比较难买到的，而且它富含宝贵的卡路里。然而，至少可以说，最近我们与糖的关系变得复杂了。\n在美国，我们平均每天消费2.5罐汽水，远远超过任何营养指南。当我们继续研究为什么我们的大脑如此喜欢糖的时候，一组科学家证明，从技术上讲，这甚至可能不是我们的错。\n来自哥伦比亚大学的研究小组发现，肠道-脑轴(肠道细菌和大脑之间的连接)在老鼠的糖分偏好中是必不可少的。科学家们直接将葡萄糖或人工甜味剂注射到老鼠的肠道中，发现当葡萄糖存在时，大脑的不同区域都会激活，但没有人工甜味剂。\n接下来，他们用基因沉默了那个特定的大脑区域，这完全消除了老鼠对糖的偏好。他们还能够改变这一区域，以诱导老鼠享受新的口味。\n这项研究的关键之一是，所有的动作都发生在舌头之外。这表明，除了我们对甜味的喜爱之外，还有一些回路诱导我们对糖的喜爱。这也有助于解释为什么人工甜味剂没有改变我们对糖的消耗，因为它们不能激活这个新的肠脑回路。虽然我们需要验证这是如何转化到人类身上的，但这个新的电路提供了新的令人兴奋的见解。\n为了让研究人员跟踪动物的数量，不仅需要知道它们的数量，而且还需要知道它们的健康程度。这通常需要组织或血液样本，但对于鲸鱼等大型动物来说，收集样本非常困难，这可能会干扰它们的自然行为。座头鲸一年四季都会经历特别极端的身体状况变化。它们从极地捕食区迁徙到更温暖的繁殖地，在这段时间里，成虫几个月都不进食。\n研究人员通过检查鲸脂脂层的脂质含量来测量迁徙鲸鱼身体状况的变化。鲸脂脂层是一层储备能量，使它们保持温暖，使它们能够长时间不进食。他们还可以使用配备小型摄像头的无人机从航空图像中测量身体长度和体积等东西。然而，为了找出不同的测量方法是否可靠，他们需要对它们进行比较。\n因此，澳大利亚西南部海岸的一组研究人员在繁殖季节开始和结束时从同样的座头鲸个体收集了无人机图像和鲸脂样本，以找出外部(身体形状)和内部(通过组织活检测量的鲸脂)测量是否存在相关性。\n他们发现，在整个繁殖季节，鲸鱼的身体体积都在减少。这是意料之中的，因为在这段时间里，成虫在禁食，雌性在哺乳它们的小牛。然而，他们发现在同一时期，鲸脂层的脂肪成分没有大的变化。这些结果与其他种类的鲸鱼不同，它表明对于座头鲸来说，监测它们的身体大小比组织样本更准确，侵入性更小，可以检查种群是否能够很好地摄食和繁殖。\n在病毒世界里，天花和其他天花病毒令人毛骨悚然。尽管天花在20世纪70年代被成功根除，但整个天花病毒家族仍然让科学家们感到恐惧。\n但是如果你是一只寄生蜂，痘病毒是必不可少的。寄生蜂对被遗弃并不陌生。这些黄蜂通过在其他昆虫体内产卵为生，这样它们的幼虫就可以慢慢吞噬宿主，释放完全喂养并准备繁殖的成熟昆虫。害怕了吗？情况变得更糟了。\n这些黄蜂在它们的毒腺中携带一种痘病毒，Diachasmimoga long icaudata Enomopoxvirus(DIEPV)。这种病毒与它们一起进化，现在已经植入它们的基因中，并将传递给下一代寄生蜂。但是为什么这种进化趋势对黄蜂来说是件好事呢？\n新的研究从黄蜂本身的角度揭示了为什么会发生这种趋同进化。事实证明，DIEPV对苍蝇和其他小昆虫特别致命。这意味着当寄生蜂在不情愿的宿主体内产卵时，DIEPV病毒会随蛹一起生长，杀死宿主的速度更快，释放组织和破坏器官以供蛹消化的速度比自然过程更快。因此，寄生蜂的后代成熟，被释放，繁殖更快，更成功，因为DIEPV帮助它们杀死宿主。在这个现实生活中的恐怖故事之后，这个循环再次重复，这样这些年轻的黄蜂就可以自己制造新的黄蜂了。\n因此，下次当你拍打一只黄蜂，感觉到你的心跳在避免被蜇的时候，想象一下，如果你是一只昆虫面对一只寄生蜂，你将面临多么不幸的命运。这可真吓人。\n互联网上充斥着有助于提高记忆力的补充剂和大脑训练游戏的广告，其中大部分的效果都值得怀疑。现在，魁北克康科迪亚大学的研究人员的一项新研究为人们改善记忆的方式提供了科学证据。最棒的是，它是完全免费的。秘诀是：锻炼身体，然后打个盹。\n科学家首先将参与者随机分为四组：锻炼和打盹的人，只锻炼的人，只打盹的人，以及既不锻炼又不打盹的人。早上，参与者被随机分为两个运动组之一，进行了40分钟的中等强度自行车运动。然后在下午早些时候，所有的小组都看到了45张不同的照片。然后，一半的参与者被允许午睡一个小时。傍晚早些时候，所有参与者都被展示了90张照片，并被要求确定哪些照片是他们在白天之前看过的。\n在这项陈述性记忆任务中，无论是锻炼还是打盹都不能提高记忆性能。然而，与只锻炼或只午睡的组相比，学习前锻炼并在学习后打盹的组在任务上的准确性要高得多。这表明锻炼和睡眠在改善记忆力方面有协同作用。未来的研究可能会检验这一发现是否适用于其他类型的记忆任务，或者人们锻炼的时间是否会影响锻炼对记忆的影响。\n帝王蝶是一种关键的传粉者，作为它们生命周期的一部分，它们完成了一次艰难的迁徙。环保人士担心它们的数量迅速下降，因为蝴蝶正在与气候变化和杀虫剂作斗争。为了解决这一问题，人们将它们圈养繁殖，并在它们完全长大后释放它们。\n在外行人看来，圈养蝴蝶和野生蝴蝶一样漂亮。科学家们知道，它们的迁徙技能没有野生蝴蝶那么好-这是蝴蝶成功产卵的关键过程。为了理解其中的原因，乔治亚大学的研究人员对一些圈养的蝴蝶进行了测试，看看它们的美貌和肌肉是否能与它们的野生表亲相提并论。\n圈养蝴蝶和野生蝴蝶都进行了握力测试。通过测量蝴蝶松开对树枝的抓握所需的力量，研究人员发现，圈养的蝴蝶的力量没有达到野生标准。圈养蝴蝶的翅膀也比野生蝴蝶苍白和短得多。\n这三个特征对于成功的迁徙至关重要。特别值得一提的是，当蝴蝶休息或风力变得太大时，它们需要抓住树枝和树木。\n在囚禁中，没有“优胜劣汰”。这些蝴蝶是被饲养和培育的，它们中的大多数都存活了下来。如果这些圈养的蝴蝶与野生种群交配，它们的后代可能会处于很大的劣势。除此之外，论文的作者指出，他们的发现解释了人工饲养的帝王蝶迁徙成功率下降的趋势。\n抗生素自20世纪40年代问世以来改变了医学的面貌。在抗生素广泛使用之前，如果一个人不小心擦伤了手，伤口受到感染，他们失去肢体的可能性为十分之一。抗生素改变了这一点。\n然而，抗生素的过度使用和误用已经导致几种细菌病原体对它们产生了臭名昭著的抗药性。因此，科学家们一直在寻找治疗细菌感染的替代方法。其中一种方法是噬菌体疗法。\n噬菌体是以细菌为食的病毒。它们感染目标细菌，繁殖，并将其打开，从而杀死它。那么，我们能不能派这些鬼鬼祟祟的病毒猎人去杀死那些抗生素无法杀死的细菌呢？\n去年，韩国的研究人员表明，他们从医院污水中分离出的一种新型噬菌体(是的，你没看错)对他们测试的40种鲍曼不动杆菌中的17种具有活性。这些研究人员用具有抗药性的鲍曼不动杆菌感染蜡蛾幼虫和小鼠，然后用噬菌体进行治疗。被给予噬菌体的蛾子幼虫和老鼠比那些被感染但没有治疗的幼虫和老鼠存活的时间要长得多。事实上，感染鲍曼不动杆菌并接受噬菌体治疗的小鼠100%存活，而没有接受噬菌体治疗的小鼠在感染后五天内死亡。\n上个月，澳大利亚的研究人员招募了14名由抗药性金黄色葡萄球菌引起的细菌性脓毒症的危重患者参加噬菌体治疗的安全性试验。这些患者被给予一种具有抗药性金黄色葡萄球菌菌株活性的噬菌体鸡尾酒，以及标准的抗生素方案来治疗感染。噬菌体疗法在这些患者中没有引起任何不良反应，并且与细菌负荷的减少和炎症的减少有关。\n在噬菌体疗法成为人类的主流之前，还有很多工作要做。然而，这项研究在理解噬菌体疗法是否会成为我们对抗抗药性细菌的盟友方面向前迈出了重要的一步。\n许多科学家和其他人一样遵循着同样的社会孤立规则。世界各地的大学实验室已经关闭，我们正转向在家工作，讲课，在线监督学生，并暂时搁置我们的研究。\n其他科学家已经完全改变了他们的研究计划，开始为对抗冠状病毒做出贡献。这包括开发新的感染筛查、新的抗体分析和快速新的血液测试的英勇努力。一个非常不同的项目已经在许多城市启动，包括我的第二故乡瑞典斯德哥尔摩。\n世界各地的研究人员现在认为，因为大多数受感染的人在粪便中排出了导致冠状病毒(SARS-CoV-2)的病毒，所以有可能在污水(废水)中检测到病毒，从而追踪其在城市中的传播。\n污水处理厂是理想的测试地点，因为它们通常服务于一个市政当局，在那里，公民也得到相同的医疗中心的服务。即使在很低的水平上也能检测到病毒，这表明废水检测可能是一种强大的监测工具，可以监测病毒在当地的传播，或许还能对病例的死灰复燃发出早期警告。\n荷兰的KWR水研究所、斯德哥尔摩的生命科学实验室和皇家理工学院以及西班牙和土耳其的研究所正在开展项目，全球对其成果的兴趣与日俱增。\n这些努力将补充正在进行的推出抗体检测的工作，该检测将告诉地方当局大致有多大比例的公民被感染，而不会出现症状-这些知识可能会让一些人比预期更早开始重返工作岗位。\n植物根是复杂而脆弱的结构，为地上茎和叶提供营养和水分。研究它们可以告诉我们很多关于植物的生存策略以及它与土壤、真菌和细菌的关系。在我们的脚下有很多我们看不见的事情在发生。\n这就是问题的一部分：根很难研究，因为它们隐藏在土层下面。为了测量和观察根系，植物生物学家必须要么把植物挖出来(这种方法被恰当地称为破坏性取样)，要么安装一个名为根加速器的透视室。根加速器有点像蚂蚁农场：它允许你通过一个清晰的面板观察土壤中发生的事情。但是根式加速器可能很昂贵，而且，根据科学家的研究目标，不值得花那么多精力来建造它们。\n现在，匹兹堡大学的一组生物学家利用一个现已不复存在的家用物品：塑料CD盒，研制出了一种廉价而简单的迷你根式加速器。他们的方法发表在四月份的“植物科学应用”上。箱子本身装满了泥土，正在生长的植物从铰链上伸出。因为植物可以感知并沿着重力方向生长，所以以一定的角度存放CD盒会迫使树根在盒子的透明边生长，这样就很容易看到和测量，而不会干扰植物。\n这种方法只适用于研究小植物-没有大到足以生长热带树的CD盒！但这是一种巧妙的方法，可以满足科学需求，作者希望，无论教师、生态学家、农业科学家和其他研究人员有什么可用的财政资源，他们都可以获得根研究。\n本周，在特朗普政府的鼓励下，美国疾病控制中心(CDC)发布了一套指导文件，以帮助美国企业重新开业。\n该指南附带了一个“决策工具”，用于重新开放公共空间、企业、学校和家庭，并对其进行消毒。在指导开始时，疾控中心提出了一个关键点：“如果你使用正确的产品，导致冠状病毒的病毒可以被杀死。”\n许多清洁和消毒指南详细说明了如何安全使用“正确的产品”。根据疾控中心的说法，第一步是用肥皂和水进行常规清洁。值得一提的是，普通的肥皂和水就行了--不需要滋生抗药性细菌的抗菌物质，而且不管你可能听说过什么，它都无助于杀死病毒。\n对于较大的机构，疾控中心还建议使用经环境保护局(EPA)批准的表面消毒剂，以降低冠状病毒的风险。根据疾控中心的说法，当这些消毒剂不可用时，漂白剂或酒精就可以了。\n当然，这个信息并不完全是新的-疾控中心几个月来一直在倡导肥皂和水。\n新的背景是：一个国家争先恐后地遏制错误信息，同时还要处理每天数以万计的新病例，希望结束最有效的防御。联邦、州和地方政府正朝着不同的方向和不同的速度前进。\n一直以来，疾控中心在很大程度上都缺席了。有了新的指导方针，以及发给CNN的一份17页的文件草案，CDC似乎已经准备好让美国人“重返工作岗位”。该草案为酒吧和托儿项目等机构提供了临时重新开业的方向。\n重要的是要继续遵循联邦、州、部落、领土和地方的指导来重新开放美国。\n我们的许多读者和朋友都是各自领域的科学家和专家。这会阻止男性施虐者对他们说三道四吗？我们问他们有没有被训斥的故事，他们没有让我们失望。这里有几个我们最喜欢的。如果你有想要贡献的故事，请给我发电子邮件到Dan@massivesci.com，或者在Twitter上给我发DM邮件(@d_samorodnitsky)。保证匿名。以下所有受访者都要求匿名。为了清楚起见，这些引语经过了轻微的编辑。\n有一次，我要去一个很受欢迎的电台节目，谈论一个新的科学故事。有人来护送我去演播室，我道歉说，在我们散步的路上，我必须看新闻发布会，这样我才能在直播中提供最新情况。陪同我的那个人接着向我解释了记者招待会的主题--这正是我正要去电台节目上解释的主题。\n我在瑞典度过了一个休假学期(我曾认为瑞典是性别平等的中心，但事实并非如此)。这里的普遍假设是，我是一名年轻的外国研究生，而不是一名教授。我只有说服级别更高的人相信我想做的事情，然后让他说这是他的主意，才能把事情做好，然后它就会发生。\n最糟糕的情况是一个IT人员试图向我解释视频会议的工作原理。我打断他说我在这方面做过研究，所以，是的，我知道。他一直在做，所以我打开主页向他展示：a)这就是我，b)我是一名教授，c)我从事基于技术的远程教育研究。哦，他说。然后他道歉了。但是我必须亲自说服每个人我知道我在说什么。\n这里是研究大麻和精神病的博士生。我曾经告诉一个人我在研究什么，他接着向我解释大麻是如何治愈癌症的。也有很多男人在网上向我解释说，大麻绝对没有负面影响，我引用一下，你对科学一窍不通。\n最快浮现在我脑海中的是我开始攻读博士学位的时候。我带着一位硕士走进来，我的一个新同事开始向我解释关于我研究物种的狗屎。他读博士生的时间比我长六个月，没有硕士学位。我是一名超级专家，我们处于平等的地位，但他完全无视我在这一主题上获得的学位，而他没有。\n我是一名化学家，我已经记不清自己被训斥过多少次了，但我想我最喜欢的是我的那位经理，他向我解释了脱吗啡是什么。我的论文题目是去吗啡，krokodil(街头合成版本)及其衍生物。这是在我的采访中写的。我经常谈到这件事。“如果可待因是可卡因，那基本上就是可待因，”我被告知，信心十足。\n在某些方面，他并没有错，只是以一种非常居高临下的方式过于简单化了。可待因是用来在街道合成中制造脱吗啡的，所以这并不可怕。而街头形式的去吗啡(Krokodil)非常容易上瘾，寿命很短-这种快感不会持续很长时间。可卡因在这方面是相似的。问题是，它在结构上与可卡因相差甚远，在我们所做的工作中(在人体生物液中进行LC-MS/MS检测)，在数据读数上寻找接近可卡因的地方是没有意义的。\n因此，基本上，他做的相当于告诉一位写了一篇关于座头鲸的论文的海洋生物学家，鲸鱼就像一条真正的大鱼。从技术上讲，这是正确的，但非常简单化，居高临下，毫无帮助。\n在显微镜下，大脑看起来就像一片被砍伐的森林，上面有许多树桩和黑色的年轮。&#34；环&#\n..", "note_en": "From kids with sugar rushes to grandparents who swear they just need one more bite of chocolate, humans absolutely  love sugar. In an   evolutionary way, it makes sense. Sugar used to be relatively hard to come by, and it is packed with valuable calories. Recently, however, our relationship with sugar has been complicated, to say the least.\n In the US, we consume an average of   2.5 cans of soda everyday, far exceeding any nutritional guidelines. While we continue to study why our brains love sugar so much, a group of scientists showed that it might not even be, technically, our fault.\n The team from Columbia University found that the gut-brain axis (the connection between bacteria in your gut and your brain),   is essential in the sugar preference of mice. The scientists directly injected either glucose or an artificial sweetener to the guts of mice, and saw an activation of different regions of the brain when glucose was present, but not with the artificial sweetener.\n Next, they genetically silenced that specific brain region, which completely took away the mice’s preference for sugar. They were also able to modify that region to induce the mice to enjoy new flavors.\n One of the key things in the study is that all of the action is happening away from the tongue. This shows that there are circuits inducing our love for sugar, beyond our love for sweet tastes. This also helps explain why artificial sweeteners have not changed our consumption of sugar, since they fail to activate this new gut-brain circuit. Although we need to verify how this translates to humans, this new circuit offers new exciting insights.\n In order for researchers to keep track of animal populations, it is necessary not only to know how many there are but also how healthy they are. This often requires tissue or blood samples, but for large animals such as whales, collecting samples is very difficult and it can interfere with their natural behavior. Humpback whales go through especially extreme body condition changes throughout the year. They migrate from their polar feeding areas to warmer breeding grounds, during which time adults spend months without eating.\n Researchers measure changes in body conditions of migrating whales by checking the lipid content of their blubber layer – a layer of reserve energy that keeps them warm and allows them to go without eating for long periods of time. They can also use drones equipped with small cameras to measure things such as  body length and volume from aerial images. However, in order to find out if the different measurement methodologies are reliable, they need to compare them.\n So, a group of researchers in the coast of south-west Australia  collected drone images and blubber samples from the same individuals of Humpback whales at the beginning and end of the breeding season to find out if the external (body shape) and internal (blubber fat, measured by tissue biopsy) measurements correlate.\n They found that the body volume of the whales decreased through the breeding season. This was expected since the adults are fasting and females are nursing their calves during this time. However, they found no big changes in the fat composition of the blubber layer during the same period. These results differ from other species of whales and it signals that for humpback whales, monitoring their body sizes is a more accurate and less invasive metric than tissue samples for checking if the populations are being able to feed well and reproduce.\n  In the virus world, smallpox and  other poxviruses are horrifying. Despite the fact that smallpox was   successfully eradicated in the 1970s, the entire family of poxviruses  still strike fear into the heart of scientists.\n But if you&#39;re a  parasitoid wasp, poxviruses are essential. Parasitoid wasps are no stranger to being outcasts. These  wasps make their living by laying their eggs inside other insects so their larvae can slowly eat away the host and release the mature insects fully fed and ready to reproduce. Frightened yet? It gets worse.\n  These wasps carry a type of poxvirus,  Diachasmimorpha longicaudata entomopoxvirus (DIEPV) in their venom glands. This virus has   evolved with them, and is now built right into their genes, to be passed on to the next generation of parasitoid wasps. But why would this trend of evolution be a good thing for the wasps?\n  New research sheds some light on why this convergent evolution has occurred from the perspective of the wasps themselves. It turns out that DIEPV is particularly deadly for flies, and other small insects. This means that when the parasitoid wasp lays its eggs inside the unwilling host, the DIEPV virus grows along with the pupa, and kills the host even faster, releasing tissues and destroying organs for pupal digestion faster than the natural process. Thus, parasitoid wasp offspring mature, are released, and reproduce faster with greater success because DIEPV helps them kill the host. After this true-life horror story, the cycle repeats again so that these young wasps can make new wasps of their own.\n So next time you swat a wasp and feel your heart beat a little faster as you avoid being stung, imagine the unfortunate fate you would be facing if you were an insect confronting a parasitoid wasp. Now that is pretty scary.\n  The internet is full of advertisements for supplements and brain-training games to help improve your memory, most of which are of  questionable efficacy. Now, a   new study from researchers at Concordia University in Quebec provides scientific evidence for a way that people can improve memory. Best of all, it’s completely free. Here’s the secret: exercise and then take a nap.\n  Scientists first randomized participants into one of four groups: those who exercised and napped, those who only exercised, those who only napped, and those who didn’t do either. In the morning, participants randomized into one of the two exercise groups did 40 minutes of moderate-intensity cycling. Then in the early afternoon, all of the groups were shown 45 different pictures. Half the participants were then allowed to nap for one hour. In the early evening, all of the participants were shown 90 pictures and asked to identify which ones they had seen earlier than day.\n  On this  declarative memory task, neither exercise nor napping alone increased memory performance. However, the group that exercised before learning and napped afterwards had significantly better accuracy on the task compared to groups that only exercised or only napped. This suggests that exercise and sleep act  synergistically to improve memory. Future research could examine whether this finding holds true for other types of memory tasks or whether the time of day that people exercise influences the effects of exercise on memory.\n  Monarch butterflies are a key pollinator and complete an arduous migration as part of their life cycle.   Conservationists worry about their rapidly declining numbers, as the butterflies battle against climate change and pesticides. To tackle this, people are breeding them in captivity, and releasing them when they are fully grown.\n To the untrained eye, captive butterflies are just as beautiful as wild ones. Scientists know that their   migration skills aren’t as fine tuned as their wild counterparts – a process which is essential for the butterflies to successfully lay their eggs. To understand why,    Researchers from the University of Georgia put some captive raised butterflies through their paces, to see if their beauty and brawn&#39;s lives up to that of their wild cousins.\n Both captive and wild butterflies performed a grip test. By measuring the force needed for the butterflies to release their grip on a branch, researchers discovered that the captive butterflies strength was not up to wild standard. Captive butterflies also have much paler and shorter  wings than wild butterflies.\n These three traits are essential for successful migration. Grip strength, in particular, is what the butterflies need to latch onto branches and trees when resting or if winds become too severe.\n In captivity, there is no “survival of the fittest.” The butterflies are reared and nurtured, and most of them survive. If these captive butterflies mate with the wild population, their offspring might be at a big disadvantage. Beyond that, the authors of the paper note that their findings explain a trend of decreased migratory success in captive-reared monarch butterflies.\n  Antibiotics changed the face of medicine since their introduction in the 1940s. Before antibiotics came into widespread use, if a person accidentally scraped their hand and the wound became infected, there would have been a 1 in 10 chance that they would lose the limb. Antibiotics changed that.\n However, the overuse and misuse of antibiotics have led to several bacterial pathogens becoming notoriously resistant to them. Therefore, scientists have been looking for alternate ways to treat bacterial infections. One such approach is bacteriophage therapy.\n  Bacteriophages are viruses that prey on bacteria. They infect their target bacterium, multiply, and break it open, thereby killing it. So, can we send in these sneaky viral hunters to kill bacteria that can&#39;t be killed by antibiotics?\n Last year, researchers in South Korea showed that a novel bacteriophage they isolated from hospital sewage water (yes, you read that right) was active against 17 out of 40 antibiotic-resistant strains of  A. baumannii that they tested. These researchers infected wax moth larvae and mice with antibiotic-resistant  A. baumannii followed by treatment with the bacteriophage. The moth larvae and mice that were given the bacteriophage survived much longer than the ones that were infected but not treated. In fact, 100% of the mice infected with  A. baumannii and treated with the bacteriophage survived, whereas mice that did not receive bacteriophage treatment died within five days of infection.\n  Last month, researchers in Australia enrolled 14 critically ill patients with bacterial sepsis caused by drug-resistant  S. aureus bacteria into a safety trial for bacteriophage therapy. These patients were given a cocktail of phages with activity against drug-resistant  S. aureus strains, along with the standard regimen of antibiotics to treat the infection. Phage therapy did not cause any adverse reaction in these patients and was associated with a reduction in bacterial burden and less inflammation.\n Much needs to be done before bacteriophage therapy can become mainstream in humans. However, this study is an important step forward in understanding if bacteriophage therapy will be our ally in the war against drug-resistant bacteria.\n  Many scientists are following the same rules of social isolation as everyone else. University labs around the world have closed, and we are pivoting to working from home, delivering lectures, supervising students online, and putting our research on ice for now.\n Other scientists have completely turned their research programs around to start contributing to the fight against COVID-19. This includes heroic efforts to develop new screens for infection, new antibody assays, and rapid new blood tests. A very different kind of project has been started in many cities, including my adopted home of Stockholm, Sweden.\n  Researchers around the world now believe that, because most infected individuals shed the virus that causes COVID-19 (SARS-CoV-2) in their feces, it is possible to   detect the virus in sewage (wastewater) and thereby track its spread through a city.\n Wastewater treatment plants are the ideal testing site, as they typically serve one municipality where the citizens are also served by the same healthcare centers. The virus can be detected   even at low levels, suggesting that wastewater testing could be a powerful surveillance tool to monitor circulation of the virus in a local area, and perhaps give an early warning of a resurgence in cases.\n Projects are ongoing in the   Netherlands at the KWR Water Research Institute, in Stockholm at the   Science for Life Laboratory and the   Royal Institute of Technology, and at institutes in Spain and Turkey, and there is growing   global interest in the results.\n These efforts will complement the ongoing work to   roll out antibody testing that will tell local authorities roughly what proportion of their citizens have been infected without showing symptoms – knowledge that might let some people start returning to work earlier than anticipated.\n  Plant roots are complex and delicate structures that provide the aboveground stem and leaves with nutrients and water. Studying them can tell us a lot about a plant&#39;s survival strategy and its associations with soil fungi and bacteria. There&#39;s a lot going on beneath our feet that we just can&#39;t see.\n And that&#39;s part of the problem: roots are very difficult to study because they are hidden below layers of soil. To  measure and observe roots, plant biologists must either dig up the plant, an approach aptly referred to as &#34;destructive sampling,&#34; or install a see-through chamber called a rhizotron. A rhizotron is kind of like an ant farm: it allows you to observe what is going on in the soil though a clear panel. But rhizotrons can be  expensive and, depending on a scientist&#39;s research goals, not worth the effort it takes to construct them.\n  Now, a group of biologists from the University of Pittsburgh have developed an inexpensive and simple mini-rhizotron from a now-defunct household object: a plastic CD case. Their method was  published in April in  Applications in Plant Sciences. The case itself is filled with soil, and the growing plants protrude from the hinge. Because  plants can sense and grow in the direction of gravity, storing the CD cases at an angle forces the roots to grow up against the see-through sides of the cases, making them easy to see and measure without disturbing the plant.\n This method only works for studying small plants — there is no CD case large enough to grow a tropical tree! But it&#39;s a clever method that fills a scientific need, and one that the authors hope will make root research accessible to teachers, ecologists, agricultural scientists, and other researchers no matter what financial resources they have available.\n  This week, the US Centers for Disease Control (CDC) has released a suite of guidance documents to help US businesses reopen,  as encouraged by the Trump administration.\n The  guidance comes with a  “decision tool” for reopening and disinfecting public spaces, businesses, schools, and homes. Towards the start of the guidance, the CDC makes a key point: “The virus that causes COVID-19 can be killed if you use the right products.”\n  Much of the cleaning and disinfection guidance elaborates on using “right products” safely. The first step, according to the CDC, is routine cleaning with soap and water. It’s worth pointing out that  regular soap and water will do just fine – no need for the antibacterial stuff that breeds drug-resistant bacteria and doesn’t help kill viruses, despite  what you may have heard.\n  For larger establishments, the CDC also recommends using  surface disinfectants approved by the Environmental Protection Agency (EPA) to reduce COVID-19 risks. When those disinfectants are unavailable, according to the CDC, bleach or alcohol will do.\n Of course, this information isn’t exactly new – the CDC has been  championing soap and water for months.\n What  is  new is the context: a country  scrambling to contain misinformation while juggling  tens of thousands of new daily cases with a desire to end its  most effective defense. Federal, state, and local governments are moving in different directions and at different speeds.\n All the while, the CDC has been  largely absent. With the new guidance, and a  17-page draft document sent  to CNN that gives interim reopening direction to establishments like bars and childcare programs, the CDC appears poised for Americans to “return to work.”\n   It’s important to continue to follow federal, state, tribal, territorial, and local guidance for reopening America.\n  Many of our readers and friends are scientists and experts in their fields. Would that stop mansplainers from talking down to them? We asked if they had any stories of being mansplained to, and they did not disappoint. Here are a few of our favorites. If you have stories you&#39;d like to contribute, please email me at dan@massivesci.com, or DM me on Twitter (@d_samorodnitsky). Anonymity guaranteed. All the below respondents asked to remain anonymous. These quotes have been lightly edited for clarity.\n  &#34;Once I was going to a popular radio show to talk about a new science story. Someone came to escort me up to the studio and I apologized that, on our walk, I would have to watch a press conference so I could give an update from it on the air. The guy escorting me then proceeded to explain the topic of the press conference to me — the very topic I was on my way to explain on the radio show.&#34;\n    &#34;I spent a sabbatical semester in Sweden (which I had believed to be the center of gender equality — it&#39;s not). Here the general assumption was that I was a young, foreign grad student, not a professor. I could only get things done by convincing a higher-ranking man about what I wanted to have done, and have  him state that this was his idea, then it would happen.\n &#34;The worst situation was an IT guy who was trying to explain to me how video conferencing worked. I interrupted him to say that I did research in this area, so yes, I knew. He kept at it, so I pulled up my home page to show him a) This is me b) I am a professor and c) I do research on technology-based distance education. Oh, he said. And then he apologized. But I had to convince every man personally that I knew what I was talking about.&#34;\n  &#34;PhD candidate studying cannabis and psychosis here. I once told a man what I was researching and he proceeded to explain to me how cannabis can cure cancer. Also had plenty of men online explain to me that there are absolutely no negative effects of cannabis and I quote, &#34;you know nothing of science.&#34;\n      &#34;The one that pops to mind most quickly is when I started my PhD. I came in with a Masters and one of my new labmates started explaining shit about my study species to me. He had been a PhD student six months longer than me, with no Masters. I was a super expert, and we were in equal footing but he completely disregarded the degree I had earned in that topic that he didn&#39;t have.&#34;\n  &#34;I’m a chemist and I’ve lost count of times I’ve been mansplained to, but I think my favorite was the manager I had who explained to me what desomorphine was. I did my thesis on desomorphine, krokodil (the street synthesized version), and its derivatives. It was in my interview. I commonly spoke about it. “It’s basically codeine if codeine were crack,” I was told, with utter confidence.\n &#34;In some ways he wasn’t wrong, just drastically oversimplifying in a very patronising way. Codeine is used to  make desomorphine in the street synthesis, so that’s not terrible. And desomorphine in street form (krokodil) is terrifically addictive with a very short lifespan — the high doesn’t last long. Cocaine is similar in that respect. The issue is that it’s nothing close in structure to cocaine, and in the job we were doing (LC-MS/MS detection in human bio fluids) it would have been pointless to look for it anywhere near cocaine on the data readouts.\n &#34;So basically, he did the equivalent of telling a marine biologist who wrote a paper on humpback whales, &#39;A whale is like a really big fish.&#39; Technically not wrong, but very oversimplified, patronizing, and unhelpful.&#34;\n  Under a microscope, the brain looks like a cutdown forest of many tree stumps with dark tree rings. The &#34;rings&#\n......", "posttime": "2020-05-11 15:12:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "细菌,bacteria,研究", "title": "喜欢吃甜食吗？你的肠道细菌需要一些糖", "title_en": "Got a sweet tooth? Your gut bacteria are asking for some sugar", "transed": 1, "url": "https://massivesci.com/notes/gut-brain-axis-sugar-microbiome/", "via": "", "real_tags": ["细菌", "bacteria", "研究"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001657, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上图来自2019年11月美联储(Federal Reserve)关于美国最大银行状况的报告，显示近一半的银行被评为不满意。自去年11月的报告以来，一直没有任何报告，直到美联储上周发布的日期为2020年5月的最新报告。这份新报告的标题是：“银行业在进入2020年时财务状况良好。”这是美联储战略的一部分，目的是将其监管华尔街巨型银行的严重失败归咎于冠状病毒大流行的大门。\n今天，在美国的电视屏幕上很容易看到一个完全虚假的标题，一个完全建立在魔法思维基础上的标题。正如下面的照片所示，上周五，CNBC的史蒂夫·利斯曼(Steve Liesman)在电视屏幕上重复了美联储的这一神奇想法，并配上了一个醒目的标题。利斯曼一反常态地没有挑战美联储这一荒谬的断言。\n当地的事实如下：从2019年9月17日开始-距离世界上任何地方报道第一例冠状病毒病例还有三个月-华尔街最大银行的流动性如此糟糕，以至于美联储不得不干预隔夜贷款市场(回购贷款)，并开始每周发放数千亿美元的贷款。这是自2007-2010年金融崩盘以来，美联储首次不得不干预回购贷款市场。\n截至2020年1月27日，美联储已累计向这些华尔街巨头银行的交易部门挹注6.6万亿美元紧急贷款，而且资金源源不断，到3月14日达到逾9万亿美元。(回购贷款仍在流动，美联储已经建立了一份其他紧急贷款计划的字母汤花名册，以帮助华尔街最大的银行摆脱困境。)。\n10月7日，华尔街On Parade再次报道了以下内容，几个月后世界上任何地方都爆发了冠状病毒：美联储表示，随着Mega Banks计划裁员6.8万多人，它将向华尔街再提供3100亿美元的定期贷款。\n10月10日，明尼阿波利斯联邦储备银行行长尼尔·卡什卡利接受了雅虎财经的采访，他在采访中讨论了大银行的流动性危机。卡什卡里说：(见下面的视频剪辑)。\n“归根结底，这是银行的工作，以确保他们为自己提供适当的资金来满足自己的需求。因此，当银行发现他们缺乏流动性时，他们会说，“哦，我的天哪，美联储要跑到哪里去安慰我们呢？”\n“有一种叫做贴现窗口的东西，美联储为银行提供后盾资金。它就在那里。它是可以使用的。银行不喜欢使用它，因为他们担心这可能会让他们看起来有点软弱。\n“所以，我对一群银行说的‘你们为我提供了后备流动性来源，但我不想使用这一来源’并不是很有同情心。每当我犯错误的时候，我需要你为我提供另一个流动资金的后盾。我不赞同这种说法。“。\n卡什卡利是美联储内部人士。在这场2019年10月10日的采访中，他承认了以下几点：“银行发现自己缺乏流动性”，银行犯了某种“错误”，造成了流动性危机。\n尽管现实如此，联邦储备委员会(Federal Reserve)5月份的报告对银行业发表了这样一句荒谬的言论：“该行业的特点是更好的资本和流动性规划，以及各种规模银行更好的风险管理能力。因此，银行业进入当前危机时处于有利地位，能够支持继续放贷。“。\n至于“改进的风险管理能力”，考虑一下这一点。摩根大通是美国最大的银行。在同一位董事长兼首席执行官杰米·戴蒙(Jamie Dimon)的领导下，发生了以下情况：2012年，该行被迫承认，它允许伦敦的交易员利用其在美国联邦保险银行的客户存款，疯狂押注于奇异的衍生品，并损失了62亿美元的客户存款。联邦调查局开始调查，但没有提出刑事指控。该银行支付了超过10亿美元的罚款和和解。2014年，该银行承认了两项刑事重罪指控，原因是该行处理庞氏阴谋者伯尼·马多夫(Bernie Madoff)的商业银行账户的方式。2015年，该行因参与操纵汇率而对另一项刑事重罪指控认罪。\n就在去年，摩根大通(JPMorgan Chase)的多名交易员被美国司法部(US Department Of Justice)刑事指控，罪名是将该行的贵金属部门变成敲诈勒索企业。他们是根据RICO法规被起诉的，该法规通常是为指控有组织犯罪的成员而保留的。自那以后，彭博新闻社(Bloomberg News)报道称，该行本身正就此事接受刑事调查。\n尽管有这段令人震惊的历史，但美联储允许戴蒙继续执掌该行，并允许该行开设更多银行分行，并使其资产膨胀。看，摩根大通在表外项目上的敞口为2.9万亿美元，而其资产负债表上的敞口为2.3万亿美元。\n在这一点上，所有参与其中的美国人都应该清楚，必须剥夺美联储对华尔街大型银行的监管角色；必须剥夺美联储救助华尔街交易公司的能力；国会必须恢复格拉斯-斯蒂格尔法案(Glass-Steagall Act)，将华尔街赌场与联邦保险银行的所有权永久分离。", "note_en": "The chart above from the November 2019 Federal Reserve report on the condition of the biggest banks in the U.S. shows that almost half were rated unsatisfactory. There have not been any reports since that November report until the  latest one from the Fed which was released last week and dated May 2020. The new report carries this headline: “The banking industry came into 2020 in a healthy financial position.” This is part of the Fed’s strategy to lay its abysmal failure to supervise the mega Wall Street banks at the door of the coronavirus pandemic.\n It’s very easy today to get a totally bogus headline, one that is built completely on magical thinking, flashed across a TV screen in America. As the photo below illustrates, last Friday Steve Liesman of CNBC repeated this magical thinking from the Fed accompanied by a bold headline on the TV screen. Liesman, uncharacteristically, did not challenge this preposterous assertion by the Fed.\n  The facts on the ground are the following: beginning on September 17, 2019 – three months before the first coronavirus case was reported anywhere in the world – the liquidity at the biggest banks on Wall Street was so bad that the Fed had to intervene in the overnight loan market (repo loans) and begin making hundreds of billions of dollars in loans each week. This was the first time the Fed had to intervene in the repo loan market since the financial crash of 2007 to 2010.\n By January 27, 2020, the Fed  had pumped $6.6  trillion in cumulative emergency loans to the trading units of these giant Wall Street banks.  And the money kept flowing, reaching  more than $9 trillion by March 14. (The repo loans are still flowing and the Fed has set up an alphabet soup roster of other emergency lending programs to bail out Wall Street’s biggest banks.)\n On October 7 Wall Street On Parade reported the following, again, months before any outbreak of coronavirus anywhere in the world:  Fed Says It Will Offer $310 Billion More in Term Loans to Wall Street as Over 68,000 Job Cuts Planned at Mega Banks.\n On October 10, the President of the Federal Reserve Bank of Minneapolis, Neel Kashkari, gave an interview to Yahoo Finance in which he discussed the liquidity crisis at the big banks. Kashkari said this: (See video clip below.)\n “At the end of the day it’s banks jobs to make sure they’re funding themselves appropriately to meet their needs. So then when banks found that they were short of liquidity they said ‘oh my gosh, where’s the Fed to run and comfort us.’\n “There’s something called the discount window that the Fed provides backstop funding to banks. It’s there. It’s available to be used. Banks don’t like to use it because they fear it might make them look a little bit weak.\n “So I’m not very sympathetic with a bunch of banks saying ‘well you provided me with a backstop source of liquidity but I didn’t want to use that one. I need you to provide me another backstop source of liquidity whenever I make a mistake. I’m not sympathetic with that argument.”\n Kashkari is a Fed insider. In this October 10, 2019 interview he acknowledges the following: “banks found that they were short of liquidity” and that the banks had made some kind of “mistake” that created the liquidity crisis.\n Notwithstanding that reality on the ground, the Federal Reserve’s May report carries this nonsensical statement about the banking industry: “The industry is characterized by better capital and liquidity planning and improved risk-management capabilities at banks of all sizes. As a result, the banking industry entered the current crisis well positioned to support continued lending.”\n As for “improved risk-management capabilities,” consider this. JPMorgan Chase is the largest bank in the United States. Under the same Chairman and CEO, Jamie Dimon, the following has occurred: in 2012 the bank was forced to admit that it had allowed its traders in London to use customer deposits at its federally-insured bank in the U.S. to make wild bets in exotic derivatives and lose $6.2 billion of customer deposits. The FBI commenced an investigation but no criminal charges were filed. The bank paid over $1 billion in fines and settlements. In 2014 the bank pleaded guilty to two criminal felony counts for the way it handled the business bank account for Ponzi schemer Bernie Madoff. In 2015 the bank pleaded guilty to one more criminal felony count for its involvement in rigging foreign exchange rates.\n Just last year, multiple traders at JPMorgan Chase  were criminally charged by the U.S. Department of Justice with turning the precious metals desk at the bank into a racketeering enterprise. They were charged under the RICO statute, one that is typically reserved for charging members of organized crime. Bloomberg News has since reported that the bank itself is under a criminal investigation in that matter.\n Despite this outrageous history, the Fed has allowed Dimon to remain at the helm of the bank and it has also allowed the bank to open more bank branches and balloon its assets. See  JPMorgan Chase Has $2.9 Trillion Exposure in Off-Balance Sheet Items Vs $2.3 Trillion on Its Balance Sheet.\n It should be clear to all engaged Americans at this point that the Fed must be stripped of its supervisory role over the Wall Street mega banks; that it must be stripped of its ability to bail out the trading firms on Wall Street; and Congress must restore the Glass-Steagall Act to permanently separate the Wall Street casino from ownership of federally-insured banks.", "posttime": "2020-05-11 15:10:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "报告,report,银行", "title": "美联储报告显示对华尔街银行安全的神奇思考", "title_en": "Fed Report Shows Magical Thinking on Safety of Wall Street’s Banks", "transed": 1, "url": "https://wallstreetonparade.com/2020/05/fed-report-shows-magical-thinking-on-safety-of-wall-streets-banks/", "via": "", "real_tags": ["报告", "report", "银行"]}, {"category": "", "categoryclass": "", "imagename": "142fe3929f7a616905eb56c574dae1ff.jpg", "infoid": 1001656, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Redfin RDFN，是最新一家在冠状病毒相关关门后重返iBuying游戏的房地产公司。\n这家总部位于西雅图的经纪公司周四表示，其RedfinNow部门将恢复购房活动。RedfinNow部门为卖房者提供购买房产的即时报价。通过这样做，Redfin加入了iBuyers OpenDoor和Offerpad的行列，重新进入房地产市场。Zillow周四还表示，将在未来几周缓慢重新推出iBuying子公司Zillow Offers。\n所谓的iBuyers在整个房地产市场中只占很小的份额，但仍在不断增长。根据Redfin去年12月的一份报告，2019年第三季度罗利售出的房屋中，有近7%是由iBuyers购买的，超过了全国其他任何市场。\n尽管冠状病毒爆发导致3月和4月的房屋销售和上市活动低迷，但Redfin的第一季度收益超出预期，该公司公布净亏损6000万美元。相比之下，一年前，Redfin报告的净亏损更大，为6700万美元。\n该公司首席执行官格伦·凯尔曼(Glenn Kelman)表示，该公司的技术产品-包括虚拟房屋旅游和开放参观-将帮助它度过这场流行病。但是，尽管美国人可能开始重新进入房地产市场的迹象开始显现，但复苏的速度还远未确定。房利美FNMA，+0.29%报告称，消费者对住房的信心降至2011年11月以来最低。\nMarketWatch在Redfin发布财报之前与Kelman进行了交谈，讨论了疫情对美国房地产市场的影响，以及冠状病毒之后iBuying将发生哪些变化。\n市场观察：Redfin宣布，在冠状病毒相关的暂停之后，该公司的iBuying部门RedfinNow将恢复运营。是什么推动了这一决定？\n格伦·凯尔曼：我们重新开业的原因是我们认为现在是拥有一套房子的好时机。库存同比下降25%，购房需求几乎回到大流行前的水平。所以我们愿意再次冒险。我想我们会降低买房的价格，只是为了让自己有更大的容错余地。\n那是令人痛心的几个月。我们必须确保我们在大流行之前购买的房屋在大流行开始后仍然可以出售，这是你不能轻易忘记的。所以取而代之的是，你只要稍微降低你的出价，这就给了你一些回旋余地。\n凯尔曼：我觉得我们在iBuying上的做法发生了很大变化，更多的是关于利润率。你总是知道你必须有犯错误的余地-有可能出现低迷，你提出的每一个报价都必须考虑到这一点。但要真正经历那是另一回事。所以我认为会有更多的容错余地，但对一个真正的项目也会有更少的容忍度。如果这是一件作品，需要六个月的时间才能重新投放市场，你就不能等那么长时间才能弄清楚你是否给了房主合适的价格。市场可能会发生变化。\n如果你投篮了，六个月后有人告诉你它是否进了篮筐，你永远不会成为一名更好的篮球运动员，对吗？因此，我认为我们只是对我们购买的房屋类型更加自律。如果你买错了5套房子，你就不应该买5000套。\nMW：你认为这场大流行会让iBuying变得更受欢迎吗，因为它消除了很多购房过程中通常需要的面对面互动？\n凯尔曼：那不是我的猜测。那些可能更急于出售房屋的房主，我们将在接下来的几周里看看是否有更多的人接受了报价。但是你必须考虑的另一个部分是钱人。为iBuyers提供资金的人可能对另一边的风险有不同的偏好。如果iBuyers以与两三个月前完全相同的利润率进入市场，我认为我们的接受率将会非常高。\n但我的猜测是，他们会将风险计入报价中。我不知道消费者会有什么反应。当我们提出报价时，如果我们给自己多一点空间来承担我们正在承担的所有风险，人们还会接受吗？\n韦伯：你之前提到买房需求回升了--是什么在推动着这一点？\n凯尔曼：可能是美国梦的分叉。过去，工薪阶层可以合理地渴望买房。现在我认为买房真的成了一种特权，特权阶层在这场流行病中比在餐馆工作和提供其他面对面服务的人做得更好。因此，失业对美国一部分人来说是不好的，但对另一部分人来说，情况就没那么糟糕了。所以这就是买房子的部分。\n也许这件事的另一个方面是，长期以来一直存在可负担性危机。美国没有足够的住房来容纳足够的住房，这是结构性的原因。只有一大批人两年、三年、四年都在努力买房，特别是在非常昂贵的市场。如果这场流行病是一个机会，在竞争较少的情况下做到这一点，你就会抓住机会。\n你对现在二级市场和度假市场的状况有什么看法？\n凯尔曼：干杯。它们的状况会很糟糕。有一个完整的经济是建立在Airbnb提供的流动性基础上的。你可能债台高筑，但仍然有人每月为你支付抵押贷款，因为Airbnb和其他旅游网站非常善于找到人将其出租。我不认为这些人中的许多人拥有万豪酒店(Marriott Mar)-4.97%或希尔顿酒店(Hilton HLT)-3.28%的储备。\n拥有Airbnb房产的投资者正在寻找即时的流动性。在某种程度上，它是Redfin，Zillow Z，+3.13%，OpenDoor在Airbnb停止的地方重整旗鼓。如果他们不能通过一个网站获得现金流，他们就必须通过另一个网站进行销售。\nMW：一些人认为冠状病毒大流行可能会导致大城市的移民，特别是像纽约这样受到疫情重创的城市。你对此有何看法？\n凯尔曼：它上演得就像“驴子金刚”。将会有一项重大举措。正是因为支付能力危机，这一点已经在进行中。人们离开纽约前往费城，离开旧金山前往萨克拉门托，甚至凤凰城。西雅图的人口开始流失到塔科马，塔科马就在这条街的尽头。\n我认为其中一些原因是消费者的警惕，因为我们与其他人生活在亲密的距离内。但这主要是关于雇主的灵活性。那些真正被困在是否让人们在家工作的雇主已经完全解脱了。如果你可以为高盛(Goldman Sachs GS)工作，但不能在纽约工作，如果你可以为亚马逊(Amazon AMZN)工作，但不能在西雅图工作，那么，你为什么要支付溢价呢？", "note_en": "Redfin  RDFN,  -0.61% is the latest real-estate company to jump back into the iBuying game after a  coronavirus-related shutdown.\n  The Seattle-based brokerage said Thursday that its RedfinNow segment, which provides instant offers to home sellers to purchase their properties, would resume home-buying activities. In doing so, Redfin joins fellow iBuyers Opendoor and Offerpad  in re-entering the housing market. Zillow  ZG,  +2.46% also said Thursday that it would slowly relaunch its iBuying arm, Zillow Offers, in the coming weeks.\n  So-called iBuyers represent a small but growing share of the overall real-estate market. Nearly 7% of homes sold in Raleigh in the third quarter of 2019 were bought by iBuyers,  according to a December report from Redfin, more than any other market nationwide.\n  Despite the coronavirus outbreak causing a  downturn in home sales and listing activity through March and April, Redfin managed to beat expectations with its first quarter earnings as the company posted a net loss of $60 million. A year ago, Redfin had reported a larger net loss of $67 million, for comparison.\n      The company’s CEO, Glenn Kelman, has said that the company’s tech offerings — including virtual home tours and open houses — will help it weather the pandemic. But while signs are starting to emerge that Americans may begin to re-enter the housing market, the speed of the recovery is far from certain. Fannie Mae  FNMA,  +0.29%  reported that consumer confidence in housing had fallen to the lowest level since November 2011.\n  MarketWatch spoke with Kelman ahead of Redfin’s earnings release to discuss how the pandemic has affected the U.S. housing market and what will change about iBuying in the wake of COVID-19.\n  MarketWatch: Redfin has announced that the company’s iBuying division, RedfinNow, will resume operations following the coronavirus-related pause. What drove that decision?\n  Glenn Kelman: The reason we’re reopening it is because we think it’s a reasonably good time to own a house. Inventory is down 25% year-over-year, and home-buying demand is almost back to pre-pandemic levels. So we’re willing to take a risk again. I think we’ll lower the amount we’re willing to pay for a house, just to give ourselves more margin for error.\n  It was a harrowing couple of months. We had to ensure that the homes we had bought before the pandemic could still be sold once the pandemic had started, and you just can’t forget that easily. So instead, you just lower your offers a little bit, and that gives you some leeway.\n      Kelman: I feel like what’s changed about our approach in iBuying specifically is just more about margin. You always knew that you had to have a margin for error — that there was a possibility of a downturn and that every offer you made had to account for that. But it’s another thing to actually go through that. So I think there will be more margin for error, but also less tolerance for a real project. If it’s a piece of work and it’s going to take six months to get it back on the market, you just can’t wait that long to figure out if you offered the right price to the homeowner. The market could change.\n  If you took a basketball shot, and six months later somebody told you whether it went into the hoop, you’d never get to be a better basketball player, right? So I think we’re just being more disciplined about the kinds of homes we buy. If you make a mistake on five houses, you should not buy 5,000.\n  MW: Do you think that the pandemic could make iBuying more popular, since it eliminates a lot of the in-person interactions the home-buying process typically requires?\n  Kelman: That wouldn’t be my guess. The homeowner who might be more anxious to sell their home, we’re going to find out whether more of them take offers in the next few weeks. But the other part you have to consider is the money man. The people who are providing capital for iBuyers may have a different appetite for risk on the other side of this. If iBuyers all come into the market at the exact same margin they were at two or three months ago, I think our acceptance rates are going to be really high.\n  But my guess is that they’re going to price the risk into their offers. And I don’t know how consumers are going to react. When we make offers, if we give ourselves just a little more room for all the risks that we’re taking, will people still accept it?\n    MW: You mentioned earlier that there’s been a resurgence in home-buying demand — what is driving that?\n  Kelman: Probably the bifurcation of the American dream. It used to be that working-class folks could reasonably aspire to buy a house. And now I think buying a house has really become a privilege, and the privileged class is doing better in this pandemic than the people who work in restaurants and perform other in-person services. So unemployment is going to be bad for one part of America; for another part, it isn’t as bad. And so that’s the part that’s buying a house.\n  And maybe the other dimension of this is just that there’s been an affordability crisis for so long. There’s structural reasons that there aren’t enough homes for enough homes in America. There is just a large number of people who have been trying to buy a house for two, three, four years, especially in really expensive markets. And if this pandemic is an opportunity to do that, with less competition, you’re going to take it.\n    MW: What’s your take on the state of secondary markets and vacation markets right now?\n  Kelman: Toast. Those are going to be in tough shape. There’s a whole economy that was built around the liquidity there that Airbnb provided. You could get pretty deep into debt and still have somebody pay your mortgage every month because Airbnb and other travel websites were so good at finding someone to rent it out. And I don’t think many of those folks have the reserves that Marriott  MAR,  -4.97% or that Hilton  HLT,  -3.28% does.\n  Investors who own Airbnb properties are looking for immediate liquidity. At some level it’s Redfin, Zillow  Z,  +3.13% and Opendoor picking up where Airbnb left off. If they can’t get cash flow through one website, they’ve got to sell it through the other.\n    MW: Some have suggested that the coronavirus pandemic could lead to a migration out of major cities, especially ones like New York that were hit hard by the outbreak. What’s your take on this?\n  Kelman: It’s on like Donkey Kong. There’s going to be a major move. That was already underway just because of the affordability crisis. People are leaving New York for Philadelphia and are leaving San Francisco for Sacramento and even Phoenix. Seattle was starting to lose people to Tacoma, which is just down the street.\n  I think some of it is about consumer wariness where we’re living in close quarters with other people. But most of it’s about employer flexibility. Employers that were really stuck on whether to let people work from home have gotten completely unstuck. And if you can work for Goldman Sachs  GS,  -1.34% , but not in New York, if you can work for Amazon  AMZN,  +1.05% , but not in Seattle, well, why would you pay the premium?", "posttime": "2020-05-11 14:35:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "airbnb,vacation,redfin", "title": "Redfin：随着Airbnb房主争先恐后地抛售房屋，度假房地产“祝酒”", "title_en": "Redfin: Vacation real-estate ‘toast’ as Airbnb owners rush to offload homes", "transed": 1, "url": "https://www.marketwatch.com/story/vacation-real-estate-markets-are-toast-because-of-the-pandemic-as-airbnb-owners-rush-to-offload-their-homes-redfin-ceo-says-2020-05-11?mod=home-page", "via": "", "real_tags": ["airbnb", "vacation", "redfin"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001655, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "史蒂夫·赖奇的“钢琴阶段”(特别是这里讨论的第一乐章)是早期极简主义的开创性作品之一。它由五个音高组成，以十二个音符的模式排列，并在两种乐器上演奏，它展示了当使用正确的系统操纵最少量的音乐材料时所能产生的音乐影响(请参阅处理音乐)。\n为了演奏这部作品，赖克指挥两位钢琴家重复演奏上述数字，同时开始演奏。然而，其中一名表演者开始加速，因此他们与另一名表演者步调不一致(造成类似轻微回声/混响的效果)。当速度较快的表演者继续演奏时，他们开始与其他表演者同时开始演奏音符，只是在模式中领先一个音符。在这一点上，表演者同步节奏并及时演奏，直到表演者的阶段性决定再次加速。这一过程一直持续到阶段性回绕以使图案从其开始位置同步，并且演奏者再次同时演奏相同的音符。\n因为发生在钢琴阶段的过程相当简单，所以在超级对撞机上重现这项工作也相当简单。它仅依赖于几个关键方面才能正确执行：\n使用单个SynthDef以便准确地重建由相同仪器类型上的定相引起的合并效果，\n最重要的是，在与图案中的下一个音符对齐后，正确地进行异相和返回同步。\n至于SynthDef，我决定简单地使用一个具有快速攻击和释放包络的正弦波振荡器，以便放大相位效果并保持干净的声音。我还提供了一个平移机制，这样乐器就可以在立体声领域中灵活地表现出来。\nsynthDef(\\piano，{arg freq=200，pan=0；var sig，env；sig=SinOsc.ar(Freq)*0.2；env=envGen.kr(env.new([0.01，1，0.01]，[0.005，0.25]，\\exp)，donAction：2)；sig=sig*env；out.ar(0，pan2.ar(sig，Pan)；}).add；\n我通过定义一个全局变量开始我的程序，该变量通过收集MIDI数字列表并将这些数字(使用方便的下划线快捷键)转换为每秒循环数来存储模式中音符的频率。我还定义了另一个全局变量，用于存储要由执行阶段化的工具使用和修改的音符的时间。为了更好地衡量，我两个音符之间的间隔是0.25秒。\n这些存储的音符都是由我称为~STRATE的例程在四分之一秒内执行的。通过计算mod 12的迭代次数从~freqs数组中获取下一个频率，例程使用我之前定义的\\钢琴合成器播放音符，并将其放在立体声场的左侧。\n为了同步和不同步，除了在第二种乐器上演奏音符之外，我还需要一种机制来决定开始加速，并在两种乐器在图案的下一部分对齐时重新同步。正如前面的仪器包含在名为~STRATE的例程中一样，此仪器包含在名为~PASSING的例程中。\n为了演奏音符，我重用了~STRATE中的代码。为了不同步，例程在演奏完每个音符后询问0到80之间的随机数是否等于0。如果是，它将计时间隔设置为0.24秒，而不是0.25秒，后者相对于~STRATE加速~相位。这导致一个阶段大约每隔20秒发生一次。\n新的0.24间隔需要6秒(25次迭代)才能与下一个0.25间隔对齐，因此我创建了一个标记，方法是在仪器加速时将变量相位设置为迭代编号，以便在超过标记的迭代计数达到25时，将计时间隔重置为0.25，以便仪器再次同步。\n~相位=例程({var i=0，相位=0；{var间距=~freqs[i%12]；synth(\\钢琴，[freq：音高，摇摄：0.4])；i=i+1；if(rand(0，80)==0，{~time=0.24；相位=i；})；if(i相=25，{相位=0；~time=0.25；})；~time.wait；}.loop；})；\n建立SynthDef和两个例程后，可以通过同时调用~steady.play；和~phasing.play；来执行工作。或者，可以通过创建两个以上的乐器来执行工作来扩展工作，这样图案可以同时进行多次相位，并创建更多的音景。\n我仅仅使用0.25等待和~time.wait作为我的相位机制时遇到的一个问题是，即使在应该同步的时候，这些仪器似乎最终似乎仍然处于不同步状态。一种更好的实现方式可能包括一种锁相环，其中时钟可以跟踪~STRATE的精确定时，并且当~相位尝试在6秒之后回落到位时，它在与~STRATE的时钟同步的同时这样做。\n此外，当使用两个以上的乐器表演时，更灵活地实现摇摄效果(而不仅仅是在两个例程中定义摇摄)可以将不同的乐器均匀地分布在立体声领域中。\n进一步探讨相位和钢琴相位材料的影响可以包括在模式的不同点启动多个乐器，以便通过相同的相位机制产生新的和声材料。或者，可以修改分相机构，使得不同的仪器以不同的速率(即，不仅是兰德(0，80)，而且也是兰德(0，40)和兰德(0，20))通过该图案(即，不仅兰特(0，80)，而且兰德(0，40)和兰德(0，20))。这也可以完全用新的谐波材料来代替赖克在他的作品中使用的音符。\n史蒂夫·赖奇的“钢琴阶段”是音乐极简主义的一个很好的例子，以及正确的过程如何将少量的音乐材料转化为更大、更复杂的作品。超级对撞机为探索这些相位效应提供了一个很好的平台，因为它比最初用于极简实验的磁带机更灵活，比人类表演者更准确(也更有效)。只要稍微修改一下可以演奏钢琴阶段的代码，新的音乐材料就可以很容易地用于进一步的阶段性探索。", "note_en": "Steve Reich’s   Piano Phase (specifically the first movement as under discussion here) is one of the seminal works of early Minimalism. Built from five pitches arranged in a twelve-note pattern and performed on two instruments, it demonstrates the musical impact that a minimal amount of musical material can have when manipulated using the right system (see  Process music).\n  To perform this work, Reich directs two pianists to play the above figure repeatedly, starting at the same time. However, one of the performers starts speeding up so they fall out of phase with the other performer (causing an effect like a slight echo/reverb). As the faster performer continues, they begin to start playing notes at the same time as the other performer, just one note ahead in the pattern. At this point, the performers sync tempos and play in time until the performer phasing decides to speed up again. This process continues until the phasing wraps around to sync up the pattern from its starting position and the performers are again playing the same notes at the same time.\n   Because the process taking place in  Piano Phase is quite simple, recreating this work in  SuperCollider is also fairly simple. It relies on just a few crucial aspects in order to perform correctly:\n Using a single  SynthDef in order to accurately recreate the merging effect that arises from phasing on the same instrument type,\n  And most importantly, coming out of phase and coming back into sync correctly after aligning to the next note in the pattern.\n  As far as the  SynthDef goes, I decided to simply use a sine wave oscillator with a quick attack and release envelope in order to amplify the phasing effect and maintain a clean sound. I also provided a panning mechanism so the instruments could be flexibly represented in the stereo field.\n SynthDef(\\piano, {\targ freq=200, pan=0;\tvar sig, env;\tsig=SinOsc.ar(freq)*0.2;\tenv=EnvGen.kr(Env.new([0.01, 1, 0.01], [0.005, 0.25], \\exp), doneAction:2);\tsig=sig*env;\tOut.ar(0, Pan2.ar(sig, pan));}).add;\n  I began my program by defining a global variable that stores the frequencies of the notes in the pattern by collecting over a list of midi numbers and converting those (using the handy underscore shortcut) into cycles per second. I also defined another global variable that stores the timing of the notes to be utilized and modified by the instrument that does the phasing. For good measure, I went with 0.25 seconds between notes.\n  These stored notes are performed in even quarter-seconds by a routine I called  ~steady. Getting the next frequency from the  ~freqs array by counting the iterations mod 12, the routine plays the note using the  \\piano synth I had previously defined and places it in the left of the stereo field.\n   In order to come in and out of phase, on top of just playing the notes on a second instrument, I needed a mechanism to decide to start speeding up as well as to sync the two instruments back up when it was aligned at the next part of the pattern. Just as the previous instrument was enclosed in a routine called  ~steady, this instrument is enclosed in a routine called  ~phasing.\n To play the notes, I reused the code from  ~steady. To come out of phase, the routine asks after playing each note if a random number between 0 and 80 is equal to 0. If so, it sets the timing interval to be 0.24 seconds instead of 0.25 which speeds  ~phasing up in relation to  ~steady. This results in a phase taking place roughly every twenty seconds.\n It takes six seconds (25 iterations) for the new 0.24 interval to align with the next 0.25 interval so I created a marker by setting a variable  phase to the iteration number when the instrument speeds up so that when the iteration count reaches 25 past the marker, it resets the timing interval to 0.25 so the instruments are again in phase.\n ~phasing=Routine({\tvar i=0, phase=0;\t{\t\tvar pitch=~freqs[i%12];\t\tSynth(\\piano, [freq:pitch, pan:0.4]);\t\ti=i+1;\t\tif (rrand(0, 80)==0, {\t\t\t~time=0.24;\t\t\tphase=i;\t\t});\t\tif (i-phase==25, {\t\t\tphase=0;\t\t\t~time=0.25;\t\t});\t\t~time.wait;\t}.loop;});\n  With the  SynthDef and the two routines established, the work can be performed by calling  ~steady.play; and  ~phasing.play; together. Alternatively, the work can be extended by creating more than two instruments to perform the work so that the pattern can phase multiple times simultaneously and create much more of a soundscape.\n   One issue I encountered by just using  0.25.wait and  ~time.wait as my phasing mechanism was that the instruments seemed to still eventually fall out of phase even when they were supposed to sync up. A better implementation might include a sort of  phase-locked loop where a clock might track the exact timing of  ~steady and when  ~phasing attempts to fall back into place after the six seconds, it does so while synced to  ~steady‘s clock.\n Also, while performing with more than two instruments, a more flexible implementation of the panning effect (not just defining the pan in the two routines) could evenly spread the different instruments through the stereo field.\n A further exploration of the effects of phasing and the material of  Piano Phase could include starting multiple instruments at different points in the pattern so that new harmonic material arises through the same phasing mechanism. Alternatively, the phasing mechanism could be modified so that different instruments proceed through the pattern at different rates (i.e. not just  rrand(0, 80) but also  rrand(0, 40) and  rrand(0, 20)). This could also be extended with new harmonic material completely instead of the notes that Reich used in his work.\n  Steve Reich’s  Piano Phase is a great example of musical Minimalism and how the right process can transform a small amount of musical material into a larger and more complex work. And SuperCollider provides a great platform for exploring these phasing effects as it is more flexible than the tape machines originally used in Minimalistic experiments and more accurate (and available) than human performers. With slight modifications to the code that can perform  Piano Phase, new musical material is readily available for further phasing explorations.", "posttime": "2020-05-11 14:35:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "programming,编程,steve,相位", "title": "在超级对撞机上编程Steve Reich的钢琴阶段", "title_en": "Programming Steve Reich’s Piano Phase in SuperCollider", "transed": 1, "url": "https://www.ezralafleur.com/programming-steve-reichs-piano-phase-in-supercollider/", "via": "", "real_tags": ["编程", "steve", "相位"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001654, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当试图构建一个高度可伸缩的系统时，可伸缩性的最大限制是让多个写入器争夺任何数据或资源。当然，算法可能不好，但让我们假设它们有一个合理的大O符号，所以我们将重点放在系统设计的可扩展性限制上。我一直看到人们只是接受拥有多个写入器作为标准。计算机科学中有很多研究来管理这种争用，归根结底是两种基本方法。一种是在变异的同时，对争用的资源提供互斥。另一种是采取乐观策略，如果在创建新副本时底层资源没有更改，则交换更改。互斥互斥是一种一次只有一个编写器可以访问受保护资源的方法，通常使用锁定策略来实现。锁定策略需要仲裁器(通常是操作系统内核)在竞争发生时介入，以决定谁获得访问权限以及以什么顺序。这可能是一个非常昂贵的过程，通常需要比实际事务应用于业务逻辑的CPU周期多得多的CPU周期。这可能是一个非常昂贵的过程，通常需要比实际事务应用于业务逻辑的CPU周期多得多的CPU周期。这可能是一个非常昂贵的过程，通常需要比实际事务应用于业务逻辑的CPU周期多得多的CPU周期。在执行变异之前必须排队，而这种排队效应(Little&#39；S定律)会导致延迟变得不可预测，并最终限制吞吐量。乐观并发控制乐观策略包括获取数据的副本，对其进行修改，如果在此期间数据没有发生变化，则将更改复制回来。如果在此期间发生了更改，则重复此过程，直到成功为止。此过程的重复会随着争用而增加，因此会导致排队效应，就像互斥一样。如果您使用的是源代码控制系统，如Subversion或CVS，然后你每天都在使用这个算法。乐观的策略可以处理数据，但不能很好地处理硬件等资源，因为你不能复制硬件！*通过硬件提供的CAS指令来自动执行数据更改的能力是可能的。大多数锁定策略由更改锁定状态或互斥原语的乐观策略组成。管理争用与进行实际工作CPU通常可以在每个周期处理一条或多条指令。例如，现代英特尔CPU核心每个都有6个执行单元，它们可以并行地执行算术、分支逻辑、字处理和存储器加载/存储的组合。如果在进行工作时CPU核心导致高速缓存未命中，并且必须转到主存储器，它将停滞数百个周期，直到内存请求的结果返回。为了尝试和改进，CPU将猜测内存请求将返回什么以继续处理。*如果发生第二次未命中，CPU将不再推测，而只是等待内存请求返回，因为它通常不能将推测执行的状态保持在2个高速缓存未命中以上。管理高速缓存未命中是扩展我们当前一代CPU性能的最大限制。现在，这与管理争用有什么关系？很好，如果两个或更多线程使用锁来提供互斥，则它们最多将前往L3高速缓存，或通过套接字互连，以使用CAS操作来访问锁的共享状态。在最好的情况下，当无争用时，这些锁/CAS指令耗费10秒的周期，此外，它们导致CPU的无序执行被挂起并且加载/存储缓冲器被刷新。在最坏的情况下，冲突会发生，内核将需要介入并使一个或多个线程处于休眠状态，直到锁被释放。*对阻塞线程的重新调度将导致高速缓存污染。如果线程在另一个具有冷高速缓存的内核上重新调度，导致许多高速缓存未命中，情况可能会更糟。*对于争用很多的数据，很容易陷入这样一种情况，即系统在管理争用上花费的时间比实际工作多得多。下表给出了在程序中管理争用的基本成本的概念。对于高度争用的数据，很容易陷入这样一种情况：系统在管理争用上花费的时间比实际工作多得多。下表给出了在程序中管理争用的基本成本的概念。别管主内存了。这张表说明了在2.4 Ghz的韦斯特米尔处理器上使用各种技术将64位计数器递增5亿次的成本。我可以听到人们回来说，“但这只是一个微不足道的例子，现实世界的应用程序并不是那么争用的”。这是真的，但请记住，现实世界的应用程序有更多的状态，当上下文切换发生时，您认为高速缓存中所有的热状态会发生什么？通过测量基本的争用成本，可以推断出争用的基本成本，这是可能的，但请记住，现实世界的应用程序有更多的状态，当上下文切换发生时，您认为高速缓存中所有的热状态会发生什么？通过测量基本的争用成本，可以推断出争用的基本成本", "note_en": "When trying to build a highly scalable system the single biggest limitation on scalability is having multiple writers contend for any item of data or resource.  Sure, algorithms can be bad, but let’s assume they have a reasonable  Big O notation so we&#39;ll focus on the scalability limitations of the systems design.    I keep seeing people just accept having multiple writers as the norm.  There is a lot of research in computer science for managing this contention that boils down to 2 basic approaches.  One is to provide mutual exclusion to the contended resource while the mutation takes place; the other is to take an optimistic strategy and swap in the changes if the underlying resource has not changed while you created the new copy.      Mutual Exclusion   Mutual exclusion is the means by which only one writer can have access to a protected resource at a time, and is usually implemented with a locking strategy.  Locking strategies require an arbitrator, usually the operating system kernel, to get involved when the contention occurs to decide who gains access and in what order.  This can be a very expensive process often requiring many more CPU cycles than the actual transaction to be applied to the business logic would use.  Those waiting to enter the  critical section, in advance of performing the mutation must queue, and this queuing effect ( Little&#39;s Law) causes latency to become unpredictable and ultimately restricts throughput.    Optimistic Concurrency Control  Optimistic strategies involve taking a copy of the data, modifying it, then copying back the changes if data has not mutated in the meantime.  If a change has happened in the meantime you repeat the process until successful.  This repeating of the process increases with contention and therefore causes a queuing effect just like with mutual exclusion.  If you work with a source code control system, such as Subversion or CVS, then you are using this algorithm every day.  Optimistic strategies can work with data but do not work so well with resources such as hardware because you cannot take a copy of the hardware!  The ability to perform the changes atomically to data is made possible by  CAS instructions offered by the hardware.  Most locking strategies are composed from optimistic strategies for changing the lock state or mutual exclusion primitive.    Managing Contention vs. Doing Real Work  CPUs can typically process one or more instructions per cycle.  For example, modern Intel CPU cores each have 6 execution units that can be doing a combination of arithmetic, branch logic, word manipulation and memory loads/stores in parallel.  If while doing work the CPU core incurs a cache miss, and has to go to main memory, it will stall for hundreds of cycles until the result of that memory request returns.  To try and improve things the CPU will make some speculative guesses as to what a memory request will return to continue processing.  If a second miss occurs the CPU will no longer speculate and simply wait for the memory request to return because it cannot typically keep the state for speculative execution beyond 2 cache misses.  Managing cache misses is the single largest limitation to scaling the performance of our current generation of CPUs.  Now what does this have to do with managing contention?  Well if two or more threads are using locks to provide mutual exclusion, at best they will be going to the L3 cache, or over a socket interconnect, to access share state of the lock using CAS operations.  These lock/CAS instructions cost 10s of cycles in the best case when un-contended, plus they cause out-of-order execution for the CPU to be suspended and load/store buffers to be flushed.  At worst, collisions occur and the kernel will need to get involved and put one or more of the threads to sleep until the lock is released.  This rescheduling of the blocked thread will result in cache pollution.  The situation can be even worse when the thread is re-scheduled on another core with a cold cache resulting in many cache misses.    For highly contended data it is very easy to get into a situation whereby the system spends significantly more time managing contention than doing real work.  The table below gives an idea of basic costs for managing contention when the program state is very small and easy to reload from the L2/L3 cache, never mind main memory.      This table illustrates the costs of incrementing a 64-bit counter 500 million times using a variety of techniques on a 2.4Ghz Westmere processor.   I can hear people coming back with “but this is a trivial example and real-world applications are not that contended”.  This is true but remember real-world applications have way more state, and what do you think happens to all that state which is warm in cache when the context switch occurs???  By measuring the basic cost of contention it is possible to extrapolate the scalability limits of a system which has contention points.  As multi-core becomes ever more significant another approach is required.  My last  post illustrates the micro level effects of CAS operations on modern CPUs, whereby Sandybridge can be worse for CAS and locks.    Single Writer Designs  Now, what if you could design a system whereby any item of data, or resource, is only mutated by a single writer/thread?  It is actually easier than you think in my experience.  It is OK if multiple threads, or other execution contexts, read the same data.  CPUs can broadcast read only copies of data to other cores via the cache coherency sub-system.  This has a cost but it scales very well.  If you have a system that can honour this single writer principle then each execution context can spend all its time and resources processing the logic for its purpose, and not be wasting cycles and resource on dealing with the contention problem.  You can also scale up without limitation until the hardware is saturated.  There is also a really nice benefit in that when working on architectures, such as x86/x64, where at a hardware level they have a  memory model, whereby load/store memory operations have preserved order, thus  memory barriers are not required if you adhere strictly to the single writer principle.  On x86/x64 &#34; loads can be re-ordered with older stores&#34; according to the memory model so memory barriers are required when multiple threads mutate the same data across cores.  The single writer principle avoids this issue because it never has to deal with writing the latest version of a data item that may have been written by another thread and currently in the store buffer of another core.  So how can we drive towards single writer designs?  I’ve found it is a very natural thing.  Consider how humans, or any other autonomous creatures of nature, operate with their model of the world.  We all have our own model of the world contained in our own heads, i.e. We have a copy of the world state for our own use.  We mutate the state in our heads based on inputs (events/messages) we receive via our senses.  As we process these inputs and apply them to our model we may take action that produces outputs, which others can take as their own inputs.  None of us reach directly into each other’s heads and mess with the neurons.  If we did this it would be a serious breach of encapsulation!  Originally, Object Oriented (OO) design was all about message passing, and somehow along the way we bastardised the message passing to be method calls and even allowed direct field manipulation – Yuk!  Who&#39;s bright idea was it to allow public access to fields of an object?  You deserve your own special hell.    At university I studied  transputers and interesting languages like  Occam.  I thought very elegant designs appeared by having the nodes collaborate via message passing rather than mutating shared state.  I’m sure some of this has inspired the  Disruptor.  My experience with the Disruptor has shown that is it possible to build systems with one or more orders of magnitude better throughput than locking or contended state based approaches.  It also gives much more predictable latency that stays constant until the hardware is saturated rather than the traditional J-curve latency profile.  It is interesting to see the emergence of numerous approaches that lend themselves to single writer solutions such as Node.js, Erlang, Actor patterns, and SEDA to name a few.  Unfortunately most use queue based implementations underneath, which breaks the single writer principle, whereas the Disruptor strives to separate the concerns so that the single writer principle can be preserved for the common cases.  Now I’m not saying locks and optimistic strategies are bad and should not be used.  They are excellent for many problems.  For example, bootstrapping a concurrent system or making major state stages in configuration or reference data.  However if the main flow of transactions act on contended data, and locks or optimistic strategies have to be employed, then the scalability is fundamentally limited.      The Principle at Scale  This principle works at all levels of scale.   Mandelbrot got this so right.  CPU cores are just nodes of execution and the cache system provides message passing for communication.  The same patterns apply if the processing node is a server and the communication system is a local network.  If a service, in  SOA architecture parlance, is the only service that can write to its data store it can be made to scale and perform much better.  Let’s say that underlying data is stored in a database and other services can go directly to that data, without sending a message to the service that owns the data, then the data is contended and requires the database to manage the contention and coherence of that data.  This prevents the service from caching copies of the data for faster response to the clients and restricts how the data can be sharded.  Encapsulation has just been broken at a more macro level when multiple different services write to the same data store.    Summary  If a system is decomposed into components that keep their own relevant state model, without a central shared model, and all communication is achieved via message passing then you have a system without contention naturally.  This type of system obeys the single writer principle if the messaging passing sub-system is not implemented as queues.  If you cannot move straight to a model like this, but are finding scalability issues related to contention, then start by asking the question, “How do I change this code to preserve the  Single Writer Principle and thus avoid the contention?”  The  Single Writer Principle is that for any item of data, or resource, that item of data should be owned by a single execution context for all mutations.", "posttime": "2020-05-11 14:35:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "作者,writer,争用", "title": "单一作者原则(2011)", "title_en": "Single Writer Principle (2011)", "transed": 1, "url": "https://mechanical-sympathy.blogspot.com/2011/09/single-writer-principle.html", "via": "", "real_tags": ["作者", "writer", "争用"]}, {"category": "", "categoryclass": "", "imagename": "265b520ea533e60d499e12262ce0c233.jpeg", "infoid": 1001653, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加入这个频道，了解更多关于现代PROLOG编程的知识！", "note_en": "Join this channel to learn more about modern Prolog programming!", "posttime": "2020-05-11 14:35:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "力量,prolog,频道", "title": "序言的力量[视频]", "title_en": "The Power of Prolog [video]", "transed": 1, "url": "https://www.youtube.com/channel/UCFFeNyzCEQDS4KCecugmotg/videos", "via": "", "real_tags": ["力量", "prolog", "频道"]}]