[{"category": "", "categoryclass": "", "imagename": "8582797d42ab151f4cc93566a3922615.png", "infoid": 1008516, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年世界发展大会已经结束，这意味着现在是时候从苹果发布的所有文件、会议和其他材料中收集一些见解了。在接下来的几周里，我们将就几个主题展开讨论，但首先，我们将关注苹果为iOS、iPadOS、TVOS和MacOS平台上的游戏开发者宣布的新举措和新功能。\n我们之所以从这里开始，部分原因是这是苹果平台上游戏的重要一周(也因为苹果的一些以游戏为中心的会议是这一周安排的首批会议之一)。一些巨大的变化即将到来，未来在苹果设备上玩游戏将看起来截然不同。\n我们要讨论的第一个变化是：Mac从以PC为中心的游戏平台转变为以移动为中心的平台。\n运行Apple Silicon的Mac将能够运行iOS和iPadOS游戏，这对Mac平台来说是一个巨大的变化。开发者将可以选择他们的iOS或iPadOS游戏是否在Mac App Store上列出，但如果他们选择这样做，游戏将在本地运行，所需的额外工作最少。\n对于Mac上的游戏来说，这是一个翻天覆地的转变，它可能代表着苹果放弃了一项自Mac转向英特尔CPU以来15年来从未真正奏效的战略。Mac游戏通常是Windows游戏的端口。并不是所有的游戏都能移植，而且那些能移植的往往表现不佳。\n业绩不佳并不是因为任何一个问题。这是苹果对视频驱动程序的重视、苹果Mac中使用的移动GPU相对于PC游戏GPU直到最近还相对薄弱、Mac对OpenGL的支持不佳、现代游戏对DirectX特定技术和框架的依赖，以及PC游戏开发人员在苹果专有金属图形API方面缺乏广泛的专业知识等因素综合在一起的结果。这是苹果对视频驱动程序的重视、苹果Mac使用的移动GPU与PC游戏GPU相比一直相对薄弱、Mac对OpenGL的支持不佳、现代游戏对DirectX特定技术和框架的依赖，以及PC游戏开发商在苹果专有金属图形API方面缺乏广泛的专业知识等因素综合在一起的结果。\n此外，移植AAA级游戏的费用极其昂贵，而且Mac上的AAA级游戏的市场一直相对较小。对于许多开发人员来说，很难证明其成本和努力是合理的。苹果似乎已经决定，用这一战略尝试并不再值得失败，因此Mac的游戏重心正从Windows PC转移到iPhone。\n从苹果的角度来看，这似乎是一场全面的胜利。iPhone应用商店在许多指标上都让PC游戏相形见绌，Apple Silicon Shift的性质意味着，与旧生态系统中相比，苹果通常可以向游戏开发商索要更多的收入分成，而且与在MacOS中将Windows中的AAA、DirectX游戏移植到MacOS中的Metal相比，让iPhone游戏在配备Apple Silicon的Mac上运行良好所需的努力和费用相形见绌。\n不过，我们对此仍有许多问题。苹果将如何处理Mac App Store上列出的鼠标和键盘界面不佳的游戏？开发者是选择他们的iPhone应用程序加入Mac App Store，还是选择退出呢？看来，我们要等到今年秋天才能看到其中许多问题的答案。\n但不管是哪种情况，这都是Mac与游戏关系的根本性变化--从一种游戏生态系统和文化完全叛逃到另一种游戏生态系统和文化。\n2018年，我们与游戏开发商讨论了苹果需要对Apple TV做些什么，我们听到的第一件事是引入更好的控制器支持。为此，苹果去年宣布，其各种平台将能够与索尼(Sony)出名的PlayStation4控制器DualShock 4和微软(Microsoft)的Xbox One控制器无线配合使用。\n这种实现对于玩家来说是无缝工作的，而且对于开发人员来说，它几乎没有什么花哨的东西可以引导。现在，苹果正在以一些重要的方式扩展这一功能--而不仅仅是在TVOS上。首先，将支持两款新控制器：微软昂贵的高端Xbox One Elite Series 2控制器和微软面向辅助功能的Xbox Adaptive Controller。\n支持的控制器正在获得对各种特殊功能的支持。游戏现在可以访问DualShock 4中的陀螺仪、加速计、触摸板和灯条，以及Xbox Elite控制器上的后桨按钮。所有支持的控制器都将支持触觉(又名隆隆)，游戏将能够读取和报告控制器的电池充电状态。\n此外，苹果将在iOS 14中提供一个新的设置面板，允许完整用户重新映射他们的控制器的控件-无论是全局的还是基于每个应用的-前提是开发者已经在App Store中将他们的游戏或应用标记为支持控制器。\n苹果还在GCController上增加了用于iPad的GCKeyboard和GCMouse。这意味着运行新版iPadOS的iPad将完全支持鼠标和键盘进行游戏输入。苹果为开发者提供了鼠标/键盘行为何时应该使用GCKeyboard/GCMouse以及何时应该像大多数应用程序的标准那样使用UIKit的指导方针。\n通常情况下，UIKit更倾向于让游戏在多任务处理和iPad的其他功能上玩得很好。但如果开发人员想要通过直接键盘和鼠标字符控制器获得全屏、专注的体验-比如第一人称射击游戏-这是可能的。", "note_en": "WWDC 2020 has concluded, and that means it&#39;s time to glean some insights from all the documentation, sessions, and other materials that Apple released. We&#39;re going to do this on a few topics in the coming weeks, but to start, we&#39;re looking at the new initiatives and features Apple has announced for game developers on the iOS, iPadOS, tvOS, and macOS platforms.\n We&#39;re starting here in part because this was a red-letter week for gaming on Apple platforms (and also because some of Apple&#39;s gaming centric-sessions were among the first scheduled during the week). Some enormous changes are coming, and playing games on Apple devices is going to look markedly different going forward.\n The first change we&#39;ll go over is a doozy: the transition of the Mac from a  PC-centric gaming platform to a mobile-centric one.\n  In a hugely consequential change for the Mac platform, Macs running Apple Silicon will be able to run iOS and iPadOS games. Developers will be able to choose whether their iOS or iPadOS games are listed on the Mac App Store, but if they choose that, the games will run natively, with minimal additional work required.\n This is a seismic shift for gaming on the Mac, and it may represent Apple giving up on a strategy that has never really worked that well in the 15 years since Macs moved to Intel CPUs. Mac games have generally been ports of Windows games. Not all games get ported, and those that do often don&#39;t perform well.\n The poor performance hasn&#39;t been because of any one problem. It&#39;s a combination of Apple&#39;s emphasis with its video drivers, the comparative weakness of the mobile GPUs used in Apple&#39;s Macs versus PC gaming GPUs up until very recently, bad OpenGL support in Macs, a reliance on DirectX-specific technologies and frameworks in modern games, and a lack of widespread expertise in Apple&#39;s proprietary Metal graphics API among PC game developers, among other things.\n Plus, porting triple-A games is extremely expensive, and the market for them on Macs has always been relatively small. It&#39;s been hard for a lot of developers to justify the cost and effort. It seems like Apple has decided that trying and failing to win with that strategy is no longer worth it, so the Mac&#39;s center of gaming gravity is moving from Windows PCs to the iPhone.\n From Apple&#39;s perspective, this seems like an all-around win. The iPhone app store dwarfs PC gaming by many metrics, the nature of the Apple Silicon shift means Apple will usually be able to ask for more of a cut of revenue from developers who make the games than they would in the old ecosystem, and the effort and expense required to make an iPhone game work well on an Apple Silicon-equipped Mac pales in comparison to that required to port a triple-A, DirectX game in Windows to Metal in macOS.\n We still have a number of questions about this, though. How will Apple handle games listed on the Mac App Store that have suboptimal interfaces for the mouse and keyboard? Do developers opt their iPhone apps  in to the Mac App Store, or opt out of it? We&#39;ll have to wait until this fall to see the answers for many of these, it seems.\n But whatever the case, this is a foundational change to the Mac&#39;s relationship to gaming—a total defection from one gaming ecosystem and culture to another.\n  In 2018 we talked to game developers about what Apple needed to do with the Apple TV, and the number one thing we heard was &#34;introduce better controller support.&#34; To that end, Apple announced last year that its various platforms would be able to work wirelessly with both Sony&#39;s DualShock 4 controller of PlayStation 4 fame and Microsoft&#39;s Xbox One controller.\n That implementation worked seamlessly for players, and it was pretty no-frills for developers to boot. Now Apple is expanding on this feature in some significant ways—and not just on tvOS. First off, two new controllers are being supported: Microsoft&#39;s pricey, high-end Xbox One Elite Series 2 controller and Microsoft&#39;s accessibility-oriented  Xbox Adaptive Controller.\n    Supported controllers are getting support for all kinds of special functionality. Games can now access the gyroscope, accelerometer, touchpad, and lightbar in the DualShock 4, as well as the rear paddle buttons on the Xbox Elite controller. All supported controllers will get support for haptics (aka rumble), and games will be able to read and report a controller&#39;s battery charge state.\n Further, Apple will offer a new settings panel in iOS 14 that will allow complete users to remap controls for their controllers—either globally or on a per-app basis—provided developers have flagged their games or apps as supporting controllers in the App Store.\n Apple is also adding to GCController with GCKeyboard and GCMouse for iPads. That means iPads running the new version of iPadOS will fully support mouse and keyboard for game input. Apple gave developers guidelines about when mouse/keyboard behavior should use GCKeyboard/GCMouse, and when it should use UIKit as is standard for most apps.\n Usually, UIKit is preferred to make the game play nicely with multitasking and other iPad features. But if developers want a full-screen, focused experience with direct keyboard and mouse character controller—as in a first-person shooter, for example—that will be possible.", "posttime": "2020-06-27 04:37:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,游戏,苹果", "title": "苹果平台上的游戏将会有一些重大变化-这里有几个", "title_en": "Gaming on Apple platforms is set for some big changes—here are a few", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/06/gaming-on-apple-platforms-is-set-for-some-big-changes-here-are-a-few/", "via": "", "real_tags": ["apple", "游戏", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "7e482741effcbd58c559a3f1bcfb60d0.jpg", "infoid": 1008515, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着游戏行业的蓬勃发展，越来越多的企业家正在评估将他们的新创业公司设在哪里，或者为他们现有的公司开设新的办公室。美国政府对H1-B和L-1签证的封锁将鼓励美国游戏初创公司比其他情况下更快地在海外设立办事处。但是在哪呢？今年春天，我[…]", "note_en": "With the game industry booming, more entrepreneurs are evaluating where to base their new startup or open a new office for their existing company. The U.S. government’s block on H1-B and L-1 visas will encourage American game startups to add an office abroad much sooner than they otherwise would have. But where? This spring, I […]", "posttime": "2020-06-27 04:37:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,game", "title": "\n在哪里开游戏工作室？", "title_en": "\n\t\t\t\tWhere to open a game studio\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/where-to-open-a-game-studio/", "via": "", "real_tags": ["游戏", "game"]}, {"category": "", "categoryclass": "", "imagename": "4ed0f0b3ad321dc7b640d343499fb29c.png", "infoid": 1008512, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "黑客新闻搜索，数百万篇文章和评论触手可及。", "note_en": "Hacker News Search, millions articles and comments at your fingertips.", "posttime": "2020-06-27 04:35:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,index,新闻", "title": "Algolia的黑客新闻指数下降", "title_en": "Algolia's Index of Hacker News Is Down", "transed": 1, "url": "https://hn.algolia.com/", "via": "", "real_tags": ["黑客", "index", "新闻"]}, {"category": "", "categoryclass": "", "imagename": "a0d86942fa64c14820ef0706183bf5f6.png", "infoid": 1008511, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本课程关注的问题是：如何以可接受的速度和精度进行矩阵计算？\n这门课程于2017年夏季在旧金山大学的分析科学硕士项目中授课(面向正在学习成为数据科学家的研究生)。本课程使用Python和Jupyter笔记本讲授，在大多数课程中使用了诸如Scikit-Learning和Numpy这样的库，以及在一些课程中使用Numba(一个将Python编译为C以获得更快性能的库)和PyTorch(用于GPU的Numpy的替代)。\n与笔记本一起提供的是YouTube上的讲座视频播放列表。如果你曾经被一堂课搞糊涂了，或者它讲得太快了，请看下一段视频的开头，在那里我复习了上一节课的概念，经常从新的角度或用不同的插图解释事情，并回答问题。\n您可以在我们的ast.ai论坛上使用计算线性代数类别提出问题或分享您的想法和资源。\n下面的清单链接到此存储库中通过nbviewer服务呈现的笔记本。涵盖的主题：\n我们首先对数值线性代数中的一些基本概念进行高层次的概述。\n我们将使用新闻组数据集来尝试识别不同帖子的主题。我们使用术语-文档矩阵来表示文档中词汇的频率。我们先用NMF分解，然后用奇异值分解(SVD)。\n奇异值分解的另一个应用是识别人物并去除监控视频的背景。我们将介绍使用随机奇异值分解的鲁棒PCA。随机奇异值分解使用LU因式分解。\n压缩感知对于以较低的辐射进行CT扫描至关重要--可以用较少的数据重建图像。在这里，我们将学习这项技术，并将其应用于CT图像。\n我们已经将奇异值分解应用于主题建模、背景去除和线性回归。奇异值分解与特征分解密切相关，因此我们现在将学习如何计算大型矩阵的特征值。我们将使用DBpedia数据，这是维基百科链接的大型数据集，因为这里的主要特征向量给出了不同维基百科页面的相对重要性(这是Google的PageRank算法的基本思想)。我们将看三种不同的计算特征向量的方法，它们的复杂度越来越高(有用性也越来越高！)。\n本课程采用自上而下的教学方法，这与大多数数学课程的操作方式不同。通常，在自下而上的方法中，您首先了解要使用的所有独立组件，然后逐渐将它们构建成更复杂的结构。这样做的问题是，学生经常失去动力，没有大局意识，也不知道他们需要什么。\n哈佛大学教授大卫·珀金斯(David Perkins)有一本书，名为“让学习变得完整”，他在书中用棒球作为类比。我们不要求孩子们在让他们玩棒球之前记住所有的棒球规则，了解所有的技术细节。相反，他们开始只是玩一般意义上的游戏，然后随着时间的推移逐渐学习更多的规则/细节。\n如果你上了Fast.ai深度学习课程，那就是我们用的。你可以在这篇博客文章或我在旧金山机器学习会议上的演讲中听到更多关于我的教学理念的内容。\n总而言之，如果你一开始没有完全理解，不要担心！你不应该这样做。我们将开始使用一些尚未解释的黑盒或矩阵分解，然后我们将在稍后深入研究较低级别的细节。", "note_en": "This course is focused on the question:  How do we do matrix computations with acceptable speed and acceptable accuracy?\n This course was taught in the  University of San Francisco&#39;s Masters of Science in Analytics program, summer 2017 (for graduate students studying to become data scientists). The course is taught in Python with Jupyter Notebooks, using libraries such as Scikit-Learn and Numpy for most lessons, as well as Numba (a library that compiles Python to C for faster performance) and PyTorch (an alternative to Numpy for the GPU) in a few lessons.\n Accompanying the notebooks is a  playlist of lecture videos, available on YouTube. If you are ever confused by a lecture or it goes too quickly, check out the beginning of the next video, where I review concepts from the previous lecture, often explaining things from a new perspective or with different illustrations, and answer questions.\n  You can ask questions or share your thoughts and resources using the   Computational Linear Algebra category on our fast.ai discussion forums.\n  The following listing links to the notebooks in this repository, rendered through the  nbviewer service. Topics Covered:\n    We start with a high level overview of some foundational concepts in numerical linear algebra.\n   We will use the newsgroups dataset to try to identify the topics of different posts. We use a term-document matrix that represents the frequency of the vocabulary in the documents. We factor it using NMF, and then with SVD.\n   Another application of SVD is to identify the people and remove the background of a surveillance video. We will cover robust PCA, which uses randomized SVD. And Randomized SVD uses the LU factorization.\n   Compressed sensing is critical to allowing CT scans with lower radiation-- the image can be reconstructed with less data. Here we will learn the technique and apply it to CT images.\n       We have applied SVD to topic modeling, background removal, and linear regression. SVD is intimately connected to the eigen decomposition, so we will now learn how to calculate eigenvalues for a large matrix. We will use DBpedia data, a large dataset of Wikipedia links, because here the principal eigenvector gives the relative importance of different Wikipedia pages (this is the basic idea of Google&#39;s PageRank algorithm). We will look at 3 different methods for calculating eigenvectors, of increasing complexity (and increasing usefulness!).\n      This course is structured with a  top-down teaching method, which is different from how most math courses operate. Typically, in a  bottom-up approach, you first learn all the separate components you will be using, and then you gradually build them up into more complex structures. The problems with this are that students often lose motivation, don&#39;t have a sense of the &#34;big picture&#34;, and don&#39;t know what they&#39;ll need.\n Harvard Professor David Perkins has a book,  Making Learning Whole in which he uses baseball as an analogy. We don&#39;t require kids to memorize all the rules of baseball and understand all the technical details before we let them play the game. Rather, they start playing with a just general sense of it, and then gradually learn more rules/details as time goes on.\n If you took the fast.ai deep learning course, that is what we used. You can hear more about my teaching philosophy  in this blog post or  this talk I gave at the San Francisco Machine Learning meetup.\n All that to say, don&#39;t worry if you don&#39;t understand everything at first! You&#39;re not supposed to. We will start using some &#34;black boxes&#34; or matrix decompositions that haven&#39;t yet been explained, and then we&#39;ll dig into the lower level details later.", "posttime": "2020-06-27 04:34:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,程序员,linear", "title": "面向程序员的计算线性代数(2017)", "title_en": "Computational Linear Algebra for Programmers (2017)", "transed": 1, "url": "https://github.com/fastai/numerical-linear-algebra/", "via": "", "real_tags": ["程序", "程序员", "linear"]}, {"category": "", "categoryclass": "", "imagename": "0c2fbf87370d23dc85c938be3bd612b7.jpg", "infoid": 1008509, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "物理学家安吉洛·巴西(Angelo Bassi)说：“让我吃惊的是，量子力学只有100年的历史。”在萨格勒布一个单调的苏联时代校园里，我们隔着一张野餐桌交谈，初秋的微风吹过附近一些树木泛黄的树叶。“这只是个婴儿，没什么大不了的--在科学史上有100年的历史了。你怎么能就这么停下来呢？你怎么看都说不通。“。我们坐在一座锈迹斑斑的米色建筑的阴影下，在那里，巴西即将在一个专门研究这一百年课题的物理学家的研讨会上发表演讲。\n尽管这一理论已经年事已高，但即使是受过大学教育的成年人也往往对量子力学的内容知之甚少。这是有充分理由的。尽管物理学家用它来预测基本粒子的行为，比如组成原子的电子和组成光的光子，尽管它是20世纪的许多标志性技术(包括核能、激光和计算机)的基础，但从20世纪20年代开始，这个理论甚至让行家们都感到困惑。这是因为，虽然它在做出预测方面很壮观，但它并没有描述自然界幕后实际发生的事情，从而实现了这些结果。承认科学可能永远不能解释，比方说，解释人类思维的主观体验，这是一回事。但量子力学的标准观点暗示了一些更令人惊讶的事情：即使是对客观的物理世界的完全理解也超出了科学的能力范围，因为不可能将理论的数学与我们生活的世界之间的关系转化为语言。\n47岁的巴西是意大利东北部的里雅斯特大学的一名理论物理学家，他在该学科极少数反对这一结论的叛逆者中名列前茅。“我坚信，从某种意义上讲，物理学就是文字，”他隔着野餐桌说。尽管研讨会上的所有其他演讲都集中在量子力学的经验含义上，但巴西的演讲将为他的绝大多数同事认为非常不可信的想法提供理由：几乎所有现代物理学所依赖的理论肯定有问题-正是因为它无法用语言来表达。\n当然，量子力学的很多知识都可以用语言来表达。比如粒子未来的行踪不能用理论来说明，只能用概率来预测。根据1925年欧文·薛定谔(Erwin Schrödinger)设计的方程，这些概率来自每个粒子的“波函数”，即一组随时间变化的数字。但由于波函数的数字没有明显的意义，该理论只预测了科学家在观测瞬间可能看到的东西-当波函数的所有潜在可能性似乎崩溃成一个确定的结果-而根本没有提供任何关于粒子在那之前或之后实际做什么的叙述，甚至没有提供任何关于粒子这个词在多大程度上适用于未被观测的世界的描述。事实上，该理论认为，粒子在没有被观测到的情况下，其行为更像波--这一事实被称为“波粒二元性”，这与所有这些潜在的可能性似乎表明一个未被观测到的粒子可以同时存在于多个地方有关。然后，观察行为本身被假定为以某种方式将这种无意义的情况转变为我们所看到的具有特定位置和其他属性的物体的世界。这使得人类，毕竟是进行观察的人，在本质上负责召唤出我们从量子力学所暗示的黑暗的地下世界中经历的现实，这是根本不可知的。\n关于量子理论的争论有一种趋势，那就是变成无法检验的哲学推测。但让巴西与众不同的是，即使在叛乱者中，他也坚信，实验很快就会证明量子力学实际上只是大致正确的，这只是一个更深层次、更基本的理论的一小部分，该理论将描述让基本粒子以它们的方式运行的物体和机制，而不会提到人类观察的作用。而更让他出类拔萃的是他成功地启动了这样的研究。巴西的研究集中在量子力学的一种可能的替代方案上，这类理论被称为“客观塌陷模型”，它不依赖于人的观察来将波函数的可能性塌陷成单一的结果，而是调用一个客观的物理过程来完成这项工作，无论是否有人在看。巴西现在正在领导迄今为止最雄心勃勃的实验，该实验可能表明客观崩溃确实发生了。\n如果他被证明是正确的，对物理、技术甚至哲学的影响将是巨大的。这样的结果将说明我们可以希望了解世界的问题，反之亦然，\n然后，巴西在黑板上写下薛定谔方程--量子理论升级为“F=ma”，这是一个比较复杂的字母和数字的组合，仍然适用于棒球和其他东西，但也适用于分子和原子。薛定谔本人和任何人一样，对量子理论的缺乏描述感到不安，他认为量子理论只是不完整--他的同代人阿尔伯特·爱因斯坦(Albert Einstein)也得出了这个结论，他尖锐地问一位同事，他是否真的相信，当没有人在看的时候，月球并不在那里。但对于量子力学的大多数其他创始人，特别是极具影响力的尼尔斯·玻尔(Niels Bohr)来说，该理论的局限性只是表明物理学已经走到了死胡同，它不能再进一步揭示自然的真实本质，它将不得不满足于做出预测的基本生计。一位理论家曾经打趣地总结道，“闭嘴，计算”，这一立场或多或少已经成为今天的物理正统观念，也是大多数教科书和大学里教授这门学科的方式。\n尽管如此，物理学家和哲学家多年来一直在猜测量子力学可能真正意味着什么，这是一个名副其实的猜想动物园，其中一些人假设平行宇宙，另一些人认为人类大脑处于特殊地位。该理论的完整性仍然受到少数怀疑论者的质疑，其中包括诺贝尔奖获得者史蒂文·温伯格(Steven Weinberg)，他自己的教科书表达了他希望会出现更好的理论，并揭示量子力学拒绝讲述的故事。\n薛定谔创造了一个术语-“纠缠”-因为量子力学本身可能解释了它的不情愿：任何两个相互作用的物体的波函数，包括观察者和被观察者，都交织成一个。这使得研究亚原子世界的研究人员处于一个类似于一个水滴的位置，试图通过触摸水滴来推断另一个水滴的尺寸：由于最终结果是一个大水滴，观察到的水滴可以计算出被观测物体的体积(通过从大水滴的体积中减去自己的初始体积)，但无法收集到它的原始形状。纠缠可能负责将客观现实隐藏在面纱后面。\n尽管如此，薛定谔也提出了他著名的猫悖论，认为量子力学不可能是整个故事的全部。\n他想象一只猫被锁在一个盒子里，里面装着一瓶毒药和一种放射性物质，他的方程式预测，在研究人员计划查看内部之前，有50%的可能性会释放出一种粒子，打破瓶子，杀死猫。现在，在这一观察之前，量子力学用一个波函数来表示粒子，该波函数封装了粒子的两个潜在命运(发射或不发射)，这表明粒子没有实现这两个目标。同时，纠缠将波函数与小瓶和猫的波函数交织在一起，将它们的命运联系在一起。这导致了对盒子打开前情况的一种明显荒谬的描述：粒子既没有发射也没有发射；瓶子既没有破碎也没有破裂；猫既没有死也没有活着。薛定谔总结道，显然，这幅图景缺少一些东西。\n但是，正统学说说，缺少的是对物理学真正意义的理解。“物理学，”玻尔写道，“与其说是对先验给定事物的研究，不如说是对人类经验排序和测量方法的发展。”\n如果我们对物理学的要求只是描述人类的经验，那么悖论就不复存在了。量子力学正确地预测，研究人员在打开盒子后，发现快乐结果的可能性与替代方案一样大。就是这样。在此之前询问猫的情况，从正统的角度来看，就像问北极的北方是哪条路一样不合适。\n在量子力学的所有怪异之处中，这种对可知物的限制是最怪异、最深刻的。这表明，科学家最精确的世界模型不能描述我们观察背后发生的任何事情，甚至不能具体说明“观察”到底是什么，以及它们的影响是什么。它们会影响猫吗？或者它们只发生在观察者的脑海中？尽管今天的大多数物理学家已经放弃了回答这样的问题的希望，薛定谔和爱因斯坦一样，从来没有这样做过。他称缺乏对它的描述是他帮助发明的理论的“被高估的暂时性的一面”，他相信，这是因为他的物理学家同行们非常人性化的愿望，认为他们在量子力学中发现了一个持久的真理。\n温伯格写了一本名为“最终理论的梦想”(Dreams Of A Final They)的书，他在电话中与我沉思着量子力学可能真的是真理，这样物理学家梦想的终极理论只会涉及人类的经验，而不会对自然界说更多的话。“对我来说，那将是可怕的，”他说。“事实上，我几乎可以得出这样的结论：如果真是这样，那就让它见鬼去吧。”\n尽管如此，很大程度上是因为量子力学已经通过了如此多非常精确的测试，当考虑到塌缩模型时，通常都不会考虑，而且很少有物理学家认为巴西会成功。就连温伯格在电话中也将他的探索描述为“有趣”，但“在某种程度上是在黑暗中吹口哨”。\n在的里雅斯特演讲后的第二天，巴西开着他那辆蓝色的、饱经风霜的标致开车送我去他的家乡科洛雷多·迪·普拉托(Colloredo Di Prato)。当锯齿状的阿尔卑斯山从乘客车窗上划过天空时，我问他成长的时候是什么样子。\n他说，“工作有道德的一面，现在从某种意义上说，这一点已经消失了。”他说，现在的年轻人太在乎“成功”和“出名”了。\n“成功不算什么，”他父亲教导他。“正确的工作才是最重要的。”\n虽然科洛雷多·迪·普拉托和的里雅斯特只有一个小时的车程，但他告诉我，它们“实际上是两个不同的世界”。的里雅斯特是一个临时创建的港口，是一个商人之城，买卖之城。他的家乡更内陆，历史更悠久，相反，那里是工匠和农民的聚集地，是制造和种植的地方。关于巴西的早期童年，你也可以说“真的是两个不同的时代”，那几乎是前工业化时代。他的第一个家是一座两层的砖石公寓楼-就是他父亲长大的地方-几个家庭住在那里，共享一个庭院，养着他们的马、猪和牛。今天，那里仍然矗立着一座石砌的户外厕所，尽管巴西出生时室内管道已经铺设完毕，但电视还没有。他最初的记忆是和母亲一起跑老式的差事，去当地的谷物磨坊和奶酪制造商那里。他最早的朋友之一是一只鸡。巴西的姐姐伊凡娜深情地回忆起小安吉洛坐在乡间街道中央“宠爱他心爱的母鸡”的样子。\n他的父亲是铁匠，他的母亲是护士。他的父亲四年前去世了，但巴西每天都给母亲打电话，他们像往常一样说弗留兰语，这是该地区曾经占主导地位的语言，现在正迅速被意大利语取代。\n站在巴西童年时的庭院里，周围是空荡荡的干草棚和废弃的公寓，周围是打着石膏补丁的石墙，人们很容易在巴西的旧世界教育和他不合时宜的物理观之间划清界限。更不用说不到100码外的教堂了，教堂的钟楼仍然笼罩着整个迷人但衰败的景象。巴西是一名虔诚的天主教徒，也是上帝的信徒，他说这在他的大学同事中是“不寻常的”，但“并不罕见”。爱因斯坦把他自己认为现实可以理解的信仰称为“宗教”，我想知道巴西的宗教信仰与物理学中本质上处于极右翼地位的宗教信仰之间是否有联系。我在萨格勒布的野餐桌上问他。\n“是的，就是这样，”他说。“如果你愿意，你可以将现象背后有真理和简单的想法与对上帝的信仰直接联系在一起，上帝是产生一切的统一体。”\n“但这也是一种亲密的感觉，”他补充说。“我没有必要把这两件事联系起来。”\n“生活中简单的事情才是更真实的，”他解释说。“当一个人很简单的时候，他就是一个更好的人。”\n物理学的进步，从牛顿到爱因斯坦甚至更多，用越来越少的方程解释了越来越多的现象，这支持了宇宙比表面看起来更简单的观点。但康奈尔大学(Cornell University)物理学家N·大卫·默明(N.David Mermin)在18世纪哲学家大卫·休谟(David Hume)的帮助下辩称，历史先例和归纳推理无法证明任何事情，尤其是现实的真实情况。默明是正统学说的主要倡导者，也可能是“闭嘴计算”这句话背后的机智人物，他曾宣称，当没有人在看的时候，月球显然不在那里。我欣赏这一论点的谦逊，并对桌子对面的巴西说了这番话。\n他反驳说，在正统学说关于量子力学是正确的假设中，实际上存在着“傲慢”。\n“归根结底，这种态度阻碍了研究，”他说。“即使世界最终无法理解，我们也没有理由相信量子力学已经触底。”\n巴西告诉我，他开始学习物理学时，更感兴趣的是理论提供的启示，而不是它们的实用性。许多满怀幻想的学生也是这样开始的，但量子力学有一种给他们的梦想泼水的方法。(作为一个完成了物理博士学位，但在启蒙和就业似乎遥不可及的情况下转行到金融行业的人，我在这里写下这篇文章是基于经验。)。\n慕尼黑路德维希·马克西米利安大学的数学物理学家、巴西的导师德特尔夫·迪尔说：“当你是学生的时候，你当然会相信老师。”“你对自己说，好吧，自然界中有某种东西，某种东西真的超出了我们的理解。”\n尽管如此，一个有质疑正统倾向的新生在20世纪90年代再也找不到比的里雅斯特大学更好的地点和时间了。吉安卡洛·吉拉迪(Giancarlo Ghirardi)教过巴西的第一节量子力学课，后来成为他的博士导师，于2018年去世。吉安卡洛·吉拉迪在大学里被认为是一位敬业而有才华的老师。但在的里雅斯特之外，吉拉迪最出名的是客观塌陷模型的设计师之一，该模型有可能解决关于量子力学含义的争论。\n大体上，对这个问题有两种看法。一种是正统学说，也被称为反实在论(尽管通常只有非正统派才这么认为；物理学家往往不愿被贴上某种版本的现实主义的标签。例如，Mermin更喜欢使用“参与式现实主义者”这个词)。反实在论者是玻尔的智力继承者，他们认为物理学只能描述人类对现实的体验，量子理论的悖论是由于误导地试图利用它来辨别现实本身的本质。\n然后是现实主义者(他们高兴地自称为自己)，他们大致上是薛定谔和爱因斯坦的后裔，他们相信物理学可以也应该描述脱离我们而存在的世界-例如，通过解释盒子里的那只猫发生了什么。两种调和量子理论与现实主义的方法获得了吸引力。一种通常被称为“许多世界”的观点认为，波函数中编码的所有可能性实际上都发生了，所以薛定谔的猫既活着，也死了(更广泛地说，一切可能发生的事情都会发生)，尽管它们位于广阔且不断增长的宇宙的不同分支中。另一种被称为波米亚力学，挽救了牛顿的“粒子受力”的图景，并赋予猫一个单一的命运，但只是通过赋予粒子看似超自然的力量，比如能够瞬间影响彼此在宇宙距离上的运动，并有效地从实验中隐藏许多这样的运动。\n这两种选择都很奇怪，都有永远不可见的尴尬特征物理学家在想象与量子理论奇怪的预测相一致的现实时必须做出这样的扭曲，但这两种选择都说明了量子力学可能描述和预测的可能方式。真正的问题是，这些不同的现实彼此不一致，也与其他相互竞争的解释相抵触。而且，由于仅仅是对量子理论的解释并不能做出新的预测，所以实验不能在它们之间做出选择，所以一个人喜欢哪一个很大程度上是一个品味问题。\n“我一直认为这是一场相当空洞的游戏，”普林斯顿高等研究院的物理学家斯蒂芬·阿德勒(Stephen Adler)说，他也是巴西的另一位导师和合作者。“物理是一门实验学科。如果他们不能从实验上区分出来，我不在乎你怎么解释。“。\nGhirardi和他的同事们通过进行精细的概念移植，去掉了量子理论对观察的引用，并用在薛定谔方程中添加了一个新的数学术语来取而代之，从而得出了客观的塌缩模型。通过导致客观崩溃，这个新术语将理论从描述观察者所见的东西转变为描述世界的本来面目(当然，假设该理论是正确的)。困难的部分是找到一种方法来做到这一点，而不会导致新的。\n..", "note_en": "‘The thing that amazes me is that quantum mechanics is only 100 years old,” the physicist Angelo Bassi said. We were in conversation across a picnic table on a drab Soviet-era campus in Zagreb, an early-autumn breeze swishing through the yellowing leaves of some nearby trees. “It’s a baby, it’s nothing — 100 years in the history of science. How can you just stop there? It doesn’t make sense any way you look at it.” We sat in the shadow of a rust-stained beige building where Bassi was about to speak at a workshop for physicists who specialize in the century-old subject.\n Despite the theory’s advancing years, even college-educated adults tend to have only a hazy sense of what quantum mechanics says. And for good reason. Although physicists use it to predict the behavior of the fundamental particles, like electrons, that make up atoms and the photons that make up light, and in spite of its having been the basis of many of the 20th century’s signature technologies (including nuclear power, lasers and computers), the theory has confounded even the cognoscenti from its beginnings in the 1920s. That’s because, while it’s spectacular at making predictions, it doesn’t describe what’s actually happening underneath nature’s hood to make those results come about. It would be one thing to concede that science may never be able to explain, say, the subjective experiences of the human mind. But the standard take on quantum mechanics suggests something far more surprising: that a complete understanding of even the objective, physical world is beyond science’s reach, since it’s impossible to translate into words how the theory’s math relates to the world we live in.\n Bassi, a 47-year-old theoretical physicist at the University of Trieste, in northeastern Italy, is prominent among a tiny minority of rebels in the discipline who reject this conclusion. “I strongly believe that physics  is words, in a sense,” he said across the picnic table. And whereas all the other talks at the workshop focused on the empirical implications of quantum mechanics, Bassi’s would make a case for what a vast majority of his colleagues consider a highly implausible idea: that the theory upon which nearly all of modern physics rests must have something wrong with it — precisely because it can’t be put into words.\n Of course, much about quantum mechanics  can be said with words. Like the fact that a particle’s future whereabouts can’t be specified by the theory, only predicted with probabilities. And that those probabilities derive from each particle’s “wave function,” a set of numbers that varies over time, as per an equation devised by Erwin Schrödinger in 1925. But because the wave function’s numbers have no obvious meaning, the theory only predicts what scientists may see at the instant of observation — when all the wave function’s latent possibilities appear to collapse to one definitive outcome — and provides no narrative at all for what particles actually do before or after that, or even how much the word “particle” is apropos to the unobserved world. The theory, in fact, suggests that particles, while they’re not being observed, behave more like waves — a fact called “wave-particle duality” that’s related to how all those latent possibilities seem to indicate that an unobserved particle can exist in several places at once. The act of observation itself is then posited to somehow convert this nonsensical situation into the world we see, of objects having definite locations and other properties. This makes human beings, who are after all the ones making the observations, in essence responsible for conjuring the reality we experience out of a murky netherworld that quantum mechanics implies is simply unknowable.\n Arguments about quantum theory have a tendency to turn into untestable philosophical speculation. But what makes Bassi exceptional, even among the rebels, is his conviction that experiments will soon show that quantum mechanics is in fact only approximately correct, the mere tip of a deeper and more fundamental theory that will describe the objects and mechanisms that make fundamental particles act the way they do, without any reference to the role of human observation. And what makes him even more exceptional is his success in getting such studies off the ground. Bassi’s research is focused on a possible alternative to quantum mechanics, a class of theories called “objective collapse models” that doesn’t rely on human observation to collapse a wave function’s possibilities to a single outcome, but that invokes instead an objective, physical process to do the job whether anyone’s looking or not. And Bassi is now leading the most ambitious experiment to date that could show that objective collapse actually happens.\n If he is proved right, the implications for physics, technology and, yes, even philosophy, would be immense. Such an outcome would speak to questions of what we can hope to understand about the world, and conversely, which questions are destined to remain forever off-limits.\n A few days before Bassi’s talk in Zagreb, I attended the first class of his quantum mechanics course on the University of Trieste campus, which crowns a high hill overlooking the crescent-shaped city and the Adriatic Sea. Bassi wore a long-sleeved black T-shirt and skinny jeans that, with his lanky frame and large hands, gave him, as he paced and gestured at the front of the room, the aspect of an ungainly mime.\n He was speaking Italian. I don’t speak Italian, but when he chalked “F = ma” onto the blackboard, I could see he was reviewing Newton’s laws of motion, also known as classical mechanics. Classical mechanics does a fine job explaining the movements of things much larger than atoms, like bacteria, baseballs and planets. And even though making such predictions requires math, understanding the theory’s meaning doesn’t. Bassi drew a dot on the board, and then a curvy line with an arrow at its end: a particle moved by a force through space. Add to that picture the premise that baseballs and the rest are just collections of such particles and you can say in four words, as Bassi repeatedly did to me, how classical mechanics says the world works: “particles subject to forces.”\n Bassi then wrote Schrödinger’s equation on the board — quantum theory’s upgrade to “F = ma,” a moderately more complicated combination of letters and numbers that still applies to baseballs and the rest, but also to molecules and atoms. Schrödinger himself, as disconcerted as anyone by quantum theory’s lack of description, figured that it was simply incomplete — a conclusion his contemporary Albert Einstein shared, pointedly asking one colleague if he truly believed that the moon wasn’t there when no one was looking. But to most of the other founders of quantum mechanics, in particular the highly influential Niels Bohr, the theory’s limitations simply signaled that physics had reached a dead end, that it could go no further in revealing the true nature of nature, and that it would have to content itself instead with its bread and butter of making predictions. “Shut up and calculate,” a theorist once quipped to sum up this stance, which has become, more or less, physics orthodoxy today and the way the subject is taught in most textbooks and universities.\n Still, a veritable zoo of conjectures for what quantum mechanics might really imply about the world has been floated by physicists and philosophers over the years, including some that postulate parallel universes and others a special status for the human mind. And the theory’s completeness is still questioned by a handful of skeptics, including the Nobel laureate Steven Weinberg, whose own textbook on the subject expresses his hope that a better theory will emerge and reveal the story quantum mechanics refuses to tell.\n Schrödinger coined a term — “entanglement” — for the way quantum mechanics itself may account for its reluctance: the wave functions of any two interacting objects, including observer and observed, get wove into one. This puts a researcher probing the subatomic world into a position similar to that of one water droplet trying to deduce the dimensions of another by touching it: Since the end result is one big droplet, the observing droplet can work out the volume of the observed (by subtracting its own initial volume from that of the big droplet) but can’t glean its original shape. Entanglement could be responsible for keeping objective reality behind a veil.\n Nonetheless, Schrödinger also came up with his famous cat paradox to argue that quantum mechanics can’t be the whole story.\n He imagined a cat locked in a box with a vial of poison and a radioactive substance that, his equation predicts, has a 50 percent chance of emitting a particle that breaks the vial and kills the cat in the time before a researcher is scheduled to look inside. Now, before that observation, quantum mechanics represents the particle with a wave function that encapsulates its two potential destinies (emitted or not) and that suggests that the particle has realized neither. At the same time, entanglement interweaves that wave function with those of the vial and cat, uniting their fates. This leads to a patently absurd description of the situation in the box before it’s opened: The particle is neither emitted nor not; the vial is neither broken nor not; and the cat is neither dead nor alive. Clearly, concluded Schrödinger, something is missing in this picture.\n But what’s missing, says the orthodoxy, is an understanding of what physics is really about. “Physics,” Bohr wrote, “is to be regarded not so much as the study of something a priori given, but as the development of methods for ordering and surveying human experience.”\n If all we ask of physics is that it describe human experience, then the paradox goes away. Quantum mechanics predicts, correctly, that the researcher, upon opening the box, is as likely to find the happy outcome as the alternative. And that’s it. To ask the cat’s condition before that is, from the orthodoxy’s perspective, as inappropriate as asking which way is north from the North Pole.\n Of all the weird things about quantum mechanics, this limitation on the knowable is the weirdest, and the most profound. It suggests that scientists’ most accurate model of the world can’t describe whatever goings-on underlie our observations — or even be specific about what “observations” actually are, and what their effects are. Do they affect the cat? Or do they only happen in the observer’s mind? And although most physicists today have given up hope of answering such questions, Schrödinger, like Einstein, never did. He called its lack of description a “much overrated provisional aspect” of the theory he helped invent, one that resulted, he believed, from an all-too-human desire of his fellow physicists to believe they had found in quantum mechanics a lasting truth.\n Weinberg, who wrote a book titled “Dreams of a Final Theory,” mused by phone with me about the possibility that quantum mechanics really is the truth, such that the ultimate theory that physicists dream of would only address human experience and say nothing about nature beyond that. “That would, to me, be horrible,” he said. “In fact, I might almost conclude that if that’s what it is, the hell with it.”\n Still, largely because quantum mechanics has passed so many extraordinarily precise tests, collapse models are generally dismissed when considered at all, and few physicists think Bassi will succeed. Even Weinberg, on the phone, characterized his quest as “interesting” but “to some extent whistling in the dark.”\n The day after his lecture in Trieste, Bassi was driving me in his blue, weather-beaten Peugeot to his hometown, Colloredo di Prato. As the saw-toothed Alps sliced by in the sky out the passenger window, I asked what things were like when he was growing up.\n “There was this moral aspect of working,” he said, “which now in a sense is lost.” Young people now, he said, are too concerned with “success” and “being known.”\n “Success is nothing,” his father taught him. “Proper work is what counts.”\n Although Colloredo di Prato and Trieste are just an hour’s drive apart, they are, he told me, “really two different worlds.” Trieste, created ad hoc as a port, is a city of merchants, of buying and selling. His home region, farther inland and with a longer history, is instead a place of artisans and farmers, of making and growing. And you could just as well say “really two different times” about Bassi’s early childhood, which was practically preindustrial. His first home was a two-story brick-and-fieldstone apartment block — the same his father grew up in — where a handful of families lived and shared a courtyard for their horses, pigs and cows. A stone outhouse still stands there today, and although indoor plumbing had come by the time Bassi was born, television hadn’t. His first memories include running old-fashioned errands with his mother, to the local grain mill and cheesemaker. One of his first friends was a chicken. Bassi’s older sister, Ivana, fondly recalls the way little Angelo would sit in the middle of their country street and “pamper his beloved hen.”\n His father was a blacksmith, his mother a nurse. His father died four years ago, but Bassi calls his mother every day, and they speak, as they always have, in Friulan, the once-dominant language of the area that is now fast being displaced by Italian.\n Standing in his childhood courtyard, surrounded by the plaster-patched stone walls of empty haylofts and abandoned apartments, it is tempting to draw a line between Bassi’s Old World upbringing and his unfashionable views on physics. Not to mention the church, not a hundred yards away, whose bell tower still looms over the whole charming but decaying scene. Bassi is a practicing Catholic and a believer in God, something he says is “unusual” but “not rare” among his colleagues at the university. Einstein called his own belief that reality could be understood “religion,” and I wondered if there’s a connection between Bassi’s religious faith and that in what has become essentially a far-right position in physics. I asked him at the picnic table in Zagreb.\n “Yes, it is like that,” he said. “The idea that there is truth and simplicity behind phenomena, if you wish, you can relate it directly to a faith in God that is a unity that gives rise to everything.”\n  “But it is also an intimate feeling,” he added. “It is not necessary that I want to link the two things.”\n  “The simple things in life are the more genuine ones,” he explained. “When a person is simple, he’s a better person.”\n The idea that the universe is simpler than it appears is supported by the way advances in physics, from Newton’s to Einstein’s and beyond, have accounted for more and more phenomena with fewer and fewer equations. But as the Cornell University physicist N. David Mermin — an arch advocate for the orthodoxy and likely the wit behind the phrase “shut up and calculate,” who has avowed that the moon is demonstrably  not there when no one is looking — argues, taking an assist from the 18th-century philosopher David Hume, historical precedents and inductive reasoning can’t prove anything, not least what reality is really like. I appreciate this argument’s humility, and said so to Bassi across the table.\n There is actually “arrogance,” he countered, in the orthodoxy’s assumption that quantum mechanics is correct.\n “That attitude blocks research, at the end of the day,” he said. “Even if the world is ultimately not understandable, there is no reason to believe we have hit the bottom with quantum mechanics.”\n Bassi told me he started in physics with far more interest in the enlightenment that theories provide than in their utility. Many starry-eyed students start off the same way, but quantum mechanics has a way of dumping water on their dreams. (As someone who finished his physics Ph.D. only to switch to a career in finance once both enlightenment and employment seemed out of reach, I write here from experience.)\n “When you are a student, of course, you believe the teacher,” says Detleff Dürr, a mathematical physicist at the Ludwig Maximilian University of Munich and a mentor to Bassi. “You think to yourself, OK, there is something in nature, something which is really beyond our understanding.”\n Nonetheless, an incoming student with an inclination to question the orthodoxy could not have picked a much better place and time than the University of Trieste in the 1990s. Giancarlo Ghirardi, who taught Bassi’s first class in quantum mechanics and later became his Ph.D. adviser, and who died in 2018, is remembered at the university as a dedicated and talented teacher. But outside Trieste, Ghirardi is best known for being one of the architects of objective collapse models, which have the potential to settle the debate over what quantum mechanics means.\n Broadly, there are two takes on that question. One is the orthodoxy, also called antirealism (although generally only by the nonorthodox; physicists tend to recoil at being labeled anything other than some version of realist. Mermin, for example, prefers the term “participatory realist”). The antirealists are the intellectual heirs of Bohr who believe that physics can only describe the human experience of reality, and that quantum theory’s paradoxes result from misguided attempts to use it to discern the nature of reality itself.\n Then there are the realists (as they happily call themselves), who are, loosely, the scions of Schrödinger and Einstein, and who believe that physics can and should describe the world as it exists apart from us — by explaining, for example, what’s going on with that cat in the box. Two ways of reconciling quantum theory with realism have gained traction. One, popularly known as “many worlds,” argues that all the possibilities encoded in wave functions actually happen, so that Schrödinger’s cat both lives and dies (and, more generally, that everything that can happen does), albeit in different branches of a vast and ever-growing multitude of universes. The other, called Bohmian mechanics, salvages Newton’s “particles subject to forces” picture, and assigns the cat a single fate, but only by giving particles seemingly supernatural powers, such as the ability to influence one another’s movements across cosmic distances instantaneously and to effectively conceal many of those movements from experiments.\n  Both of these options are strange and both have the embarrassment of forever-invisible features — such are the contortions physicists must make when imagining realities consistent with quantum theory’s bizarre predictions — but both also illustrate possible ways that quantum mechanics might actually describe as well as predict. The real problem is that these alternative realities are at odds with each other and with those of other competing interpretations. And that, since mere interpretations of quantum theory make no new predictions, experiments can’t choose between them, so that which a person favors is pretty much a matter of taste.\n “I always considered it rather an empty game,” says Stephen Adler, a physicist at the Institute for Advanced Study in Princeton, and another Bassi mentor and collaborator. “Physics is an experimental subject. If they can’t be distinguished experimentally, I don’t care what your interpretation is.”\n Ghirardi and his colleagues arrived at objective collapse models by performing a delicate conceptual transplant that excised quantum theory’s references to observation and replaced them with a new mathematical term added to Schrödinger’s equation. By inducing objective collapse, the new term transformed the theory from one that describes what observers  see into one that describes the world as it  is (assuming, of course, that the theory is right). The hard part was finding a way to do this that didn’t cause the new\n......", "posttime": "2020-06-27 04:07:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "修正,physicist,理论", "title": "一位试图修正量子力学的叛逆物理学家", "title_en": "A Rebel Physicist Trying to Fix Quantum Mechanics", "transed": 1, "url": "https://www.nytimes.com/2020/06/25/magazine/angelo-bassi-quantum-mechanic.html", "via": "", "real_tags": ["修正", "physicist", "理论"]}, {"category": "", "categoryclass": "", "imagename": "ac4fd3f3aa4f7d6c2891a9fe3bca5143.jpg", "infoid": 1008507, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两家公司周五宣布，资金最雄厚的独立自动驾驶初创公司之一Zoox已被亚马逊收购。\n渴望在大肆炒作的自动驾驶行业中分得一杯羹的风险资本家，在2016年至2019年期间向Zoox投入了数亿美元。但由于自动驾驶公司在过去几年未能达到自我设定的里程碑，投资者的热情已经降温。\nZoox自己的计划雄心勃勃，令人叹为观止。该公司不仅计划开发自动驾驶软件，还计划制造自己的车辆，并创建叫车服务。就在2018年，该公司的目标是到2020年推出全自动驾驶出租车服务。\n但与大多数其他自动驾驶公司一样，Zoox也被迫推迟了时间表。Zoox于2018年解雇了首席执行官兼联合创始人蒂姆·肯特利-克莱(Tim Kentley-Klay)。对于一家离推出第一款产品还有很多年的初创公司来说，这可不是个好兆头。Zoox在2019年聘请了英特尔前高管艾查·埃文斯(Aicha Evans)接替他。\n今年4月，在冠状病毒大流行期间，Zoox解雇了100多名安全司机-尽管该公司表示，希望在大流行结束后将他们召回。随着现金的减少和风险资本家的胃口不大，Zoox开始寻找买家。\n搜索显然进行得不太顺利。在2018年的一轮融资中，该公司的估值为32亿美元。据报道，亚马逊以12亿美元的价格收购了这家公司。\n在周五的新闻稿中，亚马逊几乎没有提供有关Zoox计划的细节。目前，该公司将作为一家独立公司由其目前的领导团队-埃文斯和联合创始人杰西·莱文森(Jesse Levinson)运营。显然，Zoox将继续专注于出租车市场。据亚马逊称，Zoox的全新产品专注于网约车客户，其紧密整合的功能旨在提供革命性的乘客体验。\n但很容易想象，Zoox最终会转向提供快递服务--与UPS和联邦快递(FedEx)以及NURO等初创公司竞争--或者提供长途卡车运输服务。作为世界上最大的在线零售商，亚马逊是这两种服务的最大客户之一。\n对Zoox的收购延续了自动驾驶项目成为大公司子公司的趋势。市场领头羊Waymo是Alphabet的一部分，而Cruise和Argo分别属于通用汽车和福特。所有这些公司-就像Zoox一样-都被授予了从母公司手中获得很大程度的自治权。\n与此同时，独立的自动驾驶公司一直举步维艰。苹果去年收购了自动驾驶初创公司Drive.ai-尽管这似乎主要是为了获得人才。专注于卡车运输的初创公司Starsky Robotics于3月份关闭。\n普遍的经济不确定性加上自动驾驶技术进展缓慢，可能会使剩下的独立自动驾驶公司-包括NURO、Aurora和Voyage-作为独立公司继续存在的难度越来越大。如果他们不能找到方法推出有利可图的商业服务，他们可能会被迫出售，以追随Zoox的领导，并将其出售给一家现金储备充足的更大的公司。", "note_en": "Zoox, one of the most lavishly funded independent self-driving startups, has been acquired by Amazon, the companies  announced on Friday.\n Venture capitalists, hungry for a stake in the much-hyped self-driving industry, poured hundreds of millions of dollars into Zoox between 2016 and 2019. But as self-driving companies have failed to hit self-imposed milestones over the last couple of years, investor enthusiasm has cooled.\n Zoox&#39;s own plans were breathtakingly ambitious. The company planned to not only develop self-driving software, but to build its own vehicles and create a ride-hailing service. As recently as 2018, the company was aiming to launch a fully self-driving taxi service by 2020.\n But like most other self-driving companies, Zoox has been forced to push back its timetable. Zoox  fired CEO and co-founder Tim Kentley-Klay in 2018. That&#39;s never a good sign for a startup that&#39;s still years away from launching its first product. Zoox hired former Intel executive Aicha Evans to replace him in 2019.\n In April, in the midst of the coronavirus pandemic, Zoox  laid off more than 100 safety drivers—though it said it hoped to bring them back once the pandemic was over. With cash dwindling and little appetite from venture capitalists, Zoox began looking for a buyer.\n The search evidently didn&#39;t go well. A  2018 fundraising round had valued the company at $3.2 billion. Amazon scooped the company up for a reported $1.2 billion.\n  In Friday&#39;s press release, Amazon offered few details about its plans for Zoox. For now, the company will be operated as an independent company by its current leadership team—Evans and co-founder Jesse Levinson. Zoox will apparently continue focusing on the taxi market. According to Amazon, &#34;Zoox&#39;s ground-up vehicle focuses on the ride-hailing customer, with tightly integrated features designed to provide a revolutionary passenger experience.&#34;\n But it&#39;s easy to imagine Zoox eventually pivoting to provide either delivery services—competing with UPS and FedEx as well as startups like Nuro—or long-distance trucking services. As the world&#39;s largest online retailer, Amazon is one of the biggest customers for both types of services.\n The Zoox acquisition continues a trend of self-driving projects becoming subsidiaries of larger firms. Market leader Waymo is part of Alphabet, while Cruise and Argo are owned by GM and Ford, respectively. All of those companies have—like Zoox—been granted a significant level of autonomy from their parent companies.\n Meanwhile, independent self-driving companies have struggled. Apple  acquired self-driving startup Drive.ai last year—though that appears to have been mostly a talent acquisition effort. Starsky Robotics, a startup focused on trucking,  shut down in March.\n The combination of general economic uncertainty and slow progress for self-driving technology could make it increasingly hard for the remaining independent self-driving companies—including  Nuro,  Aurora, and  Voyage—to continue as independent companies. If they can&#39;t find ways to launch profitable commercial service, they may be forced to sell to follow Zoox&#39;s lead and sell to a bigger company with ample cash reserves.", "posttime": "2020-06-27 03:42:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,自动,driving", "title": "亚马逊斥资12亿美元收购自动驾驶初创公司Zoox", "title_en": "Amazon pays $1.2 billion for self-driving startup Zoox", "transed": 1, "url": "https://arstechnica.com/cars/2020/06/amazon-pays-1-2-billion-for-self-driving-startup-zoox/", "via": "", "real_tags": ["amazon", "亚马逊", "自动", "driving"]}, {"category": "", "categoryclass": "", "imagename": "360f49be1f275a5813f33e309b1c4c0c.jpg", "infoid": 1008506, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国有线电视新闻网商业新闻网(CNN Business)Facebook和Twitter股价周五午盘双双下跌逾7%，此前联合利华表示，将在今年剩余时间内从这两家社交媒体公司撤下广告。\n该公司在一份声明中表示，考虑到我们的责任框架和美国两极分化的氛围，我们决定从现在开始至少到今年年底，我们将不在美国的社交媒体新闻馈送平台Facebook、Instagram和Twitter上投放品牌广告。在这个时候继续在这些平台上做广告不会给人们和社会增加价值。我们将持续监测，并将在必要时重新审视我们目前的状况。\n该公司表示，这家大型家居用品公司的决定是出于对平台上仇恨言论和分裂内容的担忧。“华尔街日报”率先报道了这一消息。\n联合利华负责全球媒体的执行副总裁路易斯·迪·科莫(Luis Di Como)在接受“华尔街日报”采访时表示：基于目前的两极分化和美国正在进行的选举，在仇恨言论领域需要更多的执法。\n联合利华的承诺标志着迄今反对Facebook的公司中范围最广，也可能是最具破坏性的公司。据广告情报公司Pathmatics估计，该公司是2019年Facebook广告支出排名第30位的公司，向该平台投入了超过4200万美元。\n大多数已宣布抵制Facebook的其他品牌都表示，他们将在7月份暂停广告，或至少暂停广告至7月底。\n据报道，在联合利华宣布这一消息后不久，另一家全球最大的广告商宝洁公司(Procter&amp；Gamble)表示，将从托管令人憎恨或歧视性内容的平台上撤下广告。在联合利华宣布这一消息后不久，全球另一家最大的广告商宝洁公司(Procter&amp；Gamble)表示，将从托管仇恨内容或歧视性内容的平台上撤下广告。宝洁没有立即回复记者的置评请求。\nFacebook没有立即回复记者的置评请求。Twitter全球客户解决方案副总裁萨拉·佩尔索内特在一份声明中表示，该公司致力于建立一个安全的平台，同时放大来自代表性不足的社区和边缘化群体的声音。\n我们尊重我们的合作伙伴的决定，并将在此期间继续与他们密切合作和沟通，Personette说。", "note_en": "(CNN Business)Shares of both Facebook and Twitter were down more than 7% in mid-day trading Friday after Unilever said it would pull its advertising from the social media companies for the rest of the year.\n &#34;Given our Responsibility Framework and the polarized atmosphere in the U.S., we have decided that starting now through at least the end of the year, we will not run brand advertising in social media newsfeed platforms Facebook, Instagram and Twitter in the U.S.,&#34; the company said in a statement. &#34;Continuing to advertise on these platforms at this time would not add value to people and society. We will be monitoring ongoing and will revisit our current position if necessary.&#34;\n The massive household goods company&#39;s decision was driven by concerns over hate speech and divisive content on the platforms, it said. The  Wall Street Journal was the first to report the news.\n   &#34;Based on the current polarization and the election that we are having in the US, there needs to be much more enforcement in the area of hate speech,&#34; Luis Di Como, Unilever&#39;s executive vice president of global media, told the Journal in an interview.\n  Unilever&#39;s commitment marks the broadest and potentially most damaging yet of companies that have taken a stand against Facebook. The company was the 30th-highest spender on Facebook advertising in 2019, pouring more than $42 million into the platform, according to estimates by the advertising intelligence company Pathmatics.\n  Most other brands that have announced boycotts of Facebook have said they will suspend advertising for the month of July, or &#34;at least&#34; through the end of July.\n Not long after Unilever&#39;s announcement, Procter &amp; Gamble — another of the world&#39;s biggest advertisers —  reportedly said it would pull advertising from platforms that hosted &#34;hateful&#34; or &#34;discriminatory&#34; content. P&amp;G didn&#39;t immediately respond to request for comment\n   Facebook did not immediately respond to a request for comment. In a statement, Twitter&#39;s VP of global client solutions, Sarah Personette, said the company is committed to building a safe platform that also amplifies &#34;voices from underrepresented communities and marginalized groups.&#34;\n &#34;We are respectful of our partners&#39; decisions and will continue to work and communicate closely with them during this time,&#34; Personette said.", "posttime": "2020-06-27 03:41:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,facebook,twitter", "title": "Facebook和Twitter股价暴跌，联合利华停止广告", "title_en": "Facebook and Twitter stocks dive as Unilever halts advertising", "transed": 1, "url": "https://www.cnn.com/2020/06/26/tech/facebook-twitter-stock-unilever/index.html", "via": "", "real_tags": ["广告", "facebook", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "42139351e46d7d7a3620c182be235fb5.png", "infoid": 1008505, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "第一种情况是，YC初创公司的标准交易规模将从7%的15万美元(融资后估值约为210万美元)降至同等股本的12.5万美元(融资后估值约为179万美元)。这笔交易将继续使用保险箱提供，与可转换票据相比，YC和其他一群人首创的保险箱是一种更简单的投资选择。\n有趣的是，该公司总是在其条款中写道，它只会按比例收取下一轮融资规模的4%，这显然低于该公司在融资中购买的7%的所有权。4%的数字是一个上限-在加速器的所有权低于4%的情况下，适用较小的百分比。Y Combinator交易的完整条款可在其网站上查阅。\n新协议将适用于2021年冬季加入Y Combinator的初创公司，不包括当前夏季一批的初创公司(估计已经获得资金)。\n多年来，YC的交易多种多样。十多年前，当它第一次推出时，它提供了6%的2万美元的条款。\nY Combinator的一位女发言人表示，这一变化符合加速器未来的筹款和预算现实。她说：“经济的未来是不可预测的，我们觉得在这些时期转向更精简的模式是谨慎的。”“就我们而言，我们希望为尽可能多的伟大创始人提供资金-特别是在消费者和商业行为正在发生前所未有的变化的时候；这些变化为初创公司带来了无穷无尽的机会。”通过对我们的标准交易进行修改，我们可以再为多达3000家公司提供资金。“。\n在预算之外，至少有几个因素在这里潜在地发挥作用。其一是随时随地增加对工作的使用，这大概可以帮助降低初创公司的一些运营成本，特别是在初创公司的早期(即不需要支付WeWork flex办公桌的费用)。\nY Combinator还将更多资金投资于新兴市场初创企业，考虑到当地市场人才的普遍工资，这些初创企业的发展成本可以大幅降低。\n然而，这一削减也是一个迹象，表明在新冠肺炎之后，近年来涌入硅谷的资本洪流已经消退-如果有轻微的话。估值令人沮丧，虽然考虑到后来的风险融资规模，25,000美元并不是一个巨大的损失，但16%的估值缩水与我们最近几周在硅谷看到的其他数字是一致的。", "note_en": "The first would see the size of the standard deal for YC startups decline from $150,000 for 7% (roughly a $2.1 million post-money valuation) to $125,000 for the same equity (or roughly a $1.79 million post-money valuation). The deal will continue to be offered using a SAFE, which YC and a group of others pioneered as a simpler investment option compared to convertible notes.\n Interestingly, the firm is always writing into its terms that it will only take pro rata up to 4% of a subsequent round’s size, which is obviously smaller than the 7% ownership that the company is buying in its financing. That 4% number is a ceiling — in cases where the accelerator has less ownership than 4%, the smaller percentage applies. Full terms of  Y Combinator’s    deal are available on its website.\n  The new deal will apply to startups who join Y Combinator in the Winter 2021 batch, and doesn’t include startups in the current summer batch (who have already presumably been funded)\n YC’s deal has varied over the years. When it first launched more than a decade ago, it offered terms of $20,000 for 6%.\n A Y Combinator spokeswoman said that the change was in line with the fundraising and budget realties of the accelerator going forward. “The future of the economy is unpredictable, and we feel it is prudent during these times to switch to a leaner model,” she said. “In our case, we want to be set up to fund as many great founders as possible — especially during a time that is creating an unprecedented change to consumer and business behavior; with these changes comes endless opportunities for startups. And with the changes made to our standard deal, we can fund as many as 3000 more companies.”\n Outside of budget, at least a couple of factors are potentially at work here. One is the increased use of  Work From Anywhere, which presumably can help lower some of the running costs of a startup, particularly in its earliest days (i.e. no need to pay for that WeWork flex desk).\n  Y Combinator has also invested more of its funds into emerging markets startups, which can have dramatically lower costs of development given prevailing wages for talent in local markets.\n Yet, the cutback is also a sign that the flood of capital entering the Valley in recent years has receded — if ever so slightly — in the wake of COVID-19. Valuations are depressing, and while $25,000 is not a massive loss considering the scale of later venture financings, the 16% valuation haircut is inline with other numbers we have seen in the Valley in recent weeks.", "posttime": "2020-06-27 03:41:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "yc,初创", "title": "\nYC将削减对未来YC初创企业的投资规模", "title_en": "\n\t\t\t\tYC to cut the size of its investment in future YC startups\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/yc-to-cut-the-size-of-its-investment-in-future-yc-startups/", "via": "", "real_tags": ["yc", "初创"]}, {"category": "", "categoryclass": "", "imagename": "f41fc67951a5286d1e948ee308c4355f.png", "infoid": 1008504, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着数百万人寻找重新进入劳动力大军的方法，问题出现了：谁真正受益于重新杀戮技术？\n这取决于你怎么看，牛仔风险投资公司的高级合伙人乔梅拉·赫雷拉(Jomayra Herrera)说。对于一个人脉深厚的经理来说，重新招聘看起来与对一个没有那么多筹码的人来说有很大的不同，而且绝大多数人都属于后者。并不是每个人都有一个在谷歌或推特的朋友来帮助他们跳过在线申请，直接联系到决策者。\n除了在线直播课程提供的可访问性之外，她还指出了资产和机会之间的区别。\n赫雷拉说：“你可以让某人接触到一些东西，但除非他们拥有真正参与其中的工具和结构，否则这不是真正的接触。”换句话说，如果公司不支持培训后的就业安置，那么关于重新招聘的内容又有多大用处。\nHerrera说，公司必须给个人提供机会，让他们用实际工作来测试技能，并在职业道路上导航。她的母亲没有上过大学，把英语作为第二语言，正在寻求在线培训。然而，在她可以继续工作之前，她必须克服语言支持、简历创建、求职和其他挑战等障碍。\n突然之间，内容感觉就像一种商品，不管它是否有活跃的和社交的学习成分。这也是MOOC(大型在线公开课)感觉如此陈旧的部分原因。\n例如，据《纽约时报》报道，Udacity在2018年几乎没有现金，在过去两年里裁员超过一半。现在，和其他科技公司一样，它也面临着使用量激增的问题。", "note_en": "As millions look for a way to reenter the workforce, the question arises: Who really benefits from reskilling technology?\n That depends on how you look at it, said  Jomayra Herrera, a senior associate at  Cowboy Ventures. Reskilling for a well-networked manager looks a lot different than it does for someone who doesn’t have as much leverage, and the vast majority of people fall into the latter. Not everyone has a friend at Google or Twitter to help them skip the online application and get right to the decision-makers.\n Beyond the accessibility offered by live online classes, she pointed to the difference between assets and opportunities.\n “You can give someone access to something, but it’s not true access unless they have the tools and structure to really engage with it,” Herrera said. In other words, how useful is content around reskilling if the company doesn’t support job placement post-training.\n Herrera said companies must give individuals opportunities to test skills with real work and navigate the career path. Her mother, who did not go to college and speaks English as a second language, is looking to pursue training online. Before she can proceed, however, she has to surmount hurdles like language support, resume creation, job search and other challenges.\n All of a sudden, content feels like a commodity, regardless of if it has active and social learning components. It’s part of the reason that MOOCs (massive open online courses) feel so stale.\n Udacity, for example, was almost out of cash in 2018 and laid off more than half of its team in the past two years, according to  The New York Times. Now, like other edtech companies, it is facing surges in usage.", "posttime": "2020-06-27 03:41:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "获益,benefits,提供", "title": "\n谁是真正从重新杀戮中获益的人？", "title_en": "\n\t\t\t\tWho really benefits from reskilling?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/reskilling-upskilling-future-of-edtech/", "via": "", "real_tags": ["获益", "benefits", "提供"]}, {"category": "", "categoryclass": "", "imagename": "a508cc3988424f33e77ef34874c768bd.jpg", "infoid": 1008503, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Tatmadaw的一位发言人表示，有关军事行动和阵地的敏感信息泄露，是阿拉坎邦部分地区上周末进入第二个年头的互联网禁令的主要原因之一。\nTatmadaw True News新闻组秘书Zaw Min Tun准将于6月23日在Nay Pyi Taw举行的新闻发布会上发表讲话。\n他解释说：“军事信息，比如哪个军事纵队正在从什么位置移动到哪个地区，这些信息都上传到了社交媒体上。”“而且有一些信息让国内外的人误解了鞑靼人。因此，出于安全原因，我们不得不关闭该地区的互联网。“。\n佐敏敦称，互联网禁运也是为了阻止极端主义言论、仇恨言论和误导性信息的传播。他说，缅甸政府军目前还没有计划向政府建议解除禁令。\n6月21日是七个阿拉坎州乡镇和钦邦帕莱特瓦镇实施互联网封锁一周年。\n在过去的一年里，长期剥夺互联网接入的做法招致了很多批评，本周Pyithu Hluttaw议员U Pe Than又进行了抨击。\n“在其他国家，互联网没有被关闭，以避免仇恨言论和(泄露)军事事务。如果(在其他国家)采取这样的行动，禁令很快就会解除。我们国家已经实施互联网禁令一年了。这不应该发生，“代表Myebon镇的U Pe Than说。\n他建议，政府应该使用其他方法解决问题，并应该解除互联网禁令。\n言论自由倡导组织Athan的研究经理Ko Ye Wai表示，民主政府有责任充分保护人民的言论自由权利。\n他补充说，对于容易受到潜在人权侵犯的饱受战争蹂躏的人来说，互联网接入是一个重要的问责机制。\n“有必要结束互联网禁令。来自受战争影响地区的人们是这场战争的受害者。如果他们没有互联网接入，他们可能面临更大的生命、财产和繁荣损失的风险。居民的主要希望是有互联网接入，“柯业伟说。\n2019年6月21日，政府对阿拉坎州的Buthidaung、Maungdaw、Rathedaung、Ponnagyun、Kyauktaw、Myebon、Mrauk-U和Minbya镇以及Paletwa镇实施了互联网禁令。这项禁令于9月1日在一些乡镇解除，但在2月3日重新实施。孟都镇于5月2日第二次恢复互联网接入。\n阿拉干和钦邦受影响的八个乡镇仍有100多万人没有互联网接入。", "note_en": "A Tatmadaw spokesperson said the leaking of sensitive information about military operations and positions was one of the primary reasons for an internet ban in parts of Arakan State that entered its second year over the weekend.\n The secretary of the Tatmadaw True News Information Team, Brigadier-General Zaw Min Tun, was speaking at a news conference in Nay Pyi Taw on June 23.\n “Military information such as which military column is moving from what location to which area is uploaded on social media,” he explained. “And there is some information that makes people in the country and abroad misunderstand the Tatmadaw. So, we have to shut down the internet in the region for security reasons.”\n Zaw Min Tun described the internet embargo as also intended to put a stop to the dissemination of extremist rhetoric, hate speech and misleading information, saying the Tatmadaw had no plan as yet to recommend a lifting of the ban to the government.\n June 21 marked the one-year anniversary of the internet blackout, imposed in seven Arakan State townships and Chin State’s Paletwa Township.\n The long-running deprivation of internet access has drawn much criticism over the past year, and this week Pyithu Hluttaw lawmaker U Pe Than piled on.\n  “In other countries, the internet is not shut down to avoid hate speech and [leaking of] military affairs. If such action is imposed [in other countries], the ban is lifted in short order. Our country has imposed the internet ban for a year. It should not happen,” said U Pe Than, who represents Myebon Township.\n The government should resolve its issues using other approaches and should lift the internet ban, he suggested.\n Ko Ye Wai, research manager of the free speech advocacy group Athan, said a democratic government is responsible for fully protecting people’s right to freedom of expression.\n He added that internet access was an important accountability mechanism for a war-ravaged people vulnerable to potential human rights abuses.\n “It is necessary to end the internet ban. People from war-affected areas are victims of the war. If they do not have internet access, they might face greater risk of losing their lives, property and prosperity. The main hope for the residents is to have internet access,” Ko Ye Wai said.\n The government imposed its internet ban on Buthidaung, Maungdaw, Rathedaung, Ponnagyun, Kyauktaw, Myebon, Mrauk-U and Minbya townships in Arakan State, and Paletwa Township, on June 21, 2019. The ban was lifted in some of the townships on September 1, only to be reimposed on February 3. Maungdaw Township saw its internet access restored for a second time  on May 2.\n More than 1 million people across the eight affected townships in Arakan and Chin states remain without internet access.", "posttime": "2020-06-27 03:40:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "坚定不移,stands,互联网", "title": "军方坚定不移地捍卫缅甸西部的互联网封锁", "title_en": "Military Stands Firm In Defense Of Western Myanmar's Internet Blackout", "transed": 1, "url": "https://www.eurasiareview.com/25062020-military-stands-firm-in-defense-of-western-myanmars-internet-blackout/", "via": "", "real_tags": ["坚定不移", "stands", "互联网"]}, {"category": "", "categoryclass": "", "imagename": "c64846c0abc19b54a0ee625cbfc258ad.jpeg", "infoid": 1008502, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "三周前，我承诺在2020年选举之前审查我们的政策。这项工作正在进行中，但今天我想分享一些新的政策来.", "note_en": "Three weeks ago, I committed to reviewing our policies ahead of the 2020 elections. That work is ongoing, but today I want to share some new policies to...", "posttime": "2020-06-27 03:39:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,facebook,政策,announces", "title": "Facebook在2020年大选前宣布政策变化", "title_en": "Facebook announces policy changes ahead of 2020 elections", "transed": 1, "url": "https://www.facebook.com/zuck/posts/10112048980882521", "via": "", "real_tags": ["2020", "facebook", "政策", "announces"]}, {"category": "", "categoryclass": "", "imagename": "6200ae8f9d96698a6139db7379acd934.jpg", "infoid": 1008500, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果系统管理员在宣布收购消息的当天上午开始在社交媒体上抱怨，称公司不再允许他们连接第三方应用程序。\n“主要是Fleetsmith维护了一个第三方应用程序目录，这样你就可以在你的Mac上部署Chrome或Zoom之类的东西，Fleetsmith会维护这些应用程序的安全更新。这是我们购买Fleetsmith的主要原因，“一位Fleetsmith客户告诉TechCrunch。\n这位客户补充说，该公司在一篇博客文章中将此功能描述为一项主要功能：\nFleetsmith会自动为您处理这一切。一旦强制执行该版本，就会立即在整个设备群中下载并排队等待安装。大多数应用程序在重启后都会自动静默更新，但用户也可以选择手动更新。我们的代理将定期提醒用户更新，一旦实施日期到来，他们将有机会保存工作，然后自行运行更新。\n事实证明，苹果在给Fleetsmith客户的一封电子邮件中明确表示，它将在过渡当天停止使用这一功能。这封电子邮件包含了几篇帮助文章的链接，这些文章本应帮助管理员完成过渡。(电子邮件全文包括在文章末尾)。\n与我交谈过的管理员的普遍共识是，这些文章没有太大的帮助。虽然他们描述了一种解决问题的方法，但他们表示，苹果已经将原本高度自动化的体验变成了高度手动的体验，有效地消除了一开始就拥有更新功能的速度和易用性优势。\n苹果确实证实，在本周的变化之后，它已经对一些帮助票证请求做出了回应，称它将很快恢复目录应用程序的一些配置，并正在根据需要与受影响的客户合作。然而，该公司没有明确说明为什么他们一开始就删除了这一功能。\nFleetsmith提供了几个吸引Mac系统管理员的关键功能。首先，它让他们可以开箱即用地自动设置新的Mac电脑。这允许他们发货新的Mac或其他苹果设备，一旦员工开机并连接到WiFi，它就会连接到Fleetsmith，系统管理员可以在那里跟踪使用情况和更新。此外，它还允许系统管理员在公司设备上强制执行Apple安全和操作系统更新。\n更重要的是，它还可以对Google Chrome、Zoom或其他许多第三方应用程序做同样的事情。当这些公司推出新的更新时，系统管理员可以确保所有用户的计算机上都运行了最新版本。这是本周删除的关键功能。\n目前尚不清楚苹果为什么选择剥离给客户的电子邮件中概述的这些功能，但除了恢复Catalog应用程序的一些配置外，这些功能中的大部分似乎都不会回来了。\n收购当天发给Fleetsmith客户的电子邮件概述了这些变化：\n记者试图联系到Fleetsmith创始人请其置评，但均未成功。如果有变化，我们将更新这篇文章。", "note_en": "Apple   systems administrators began complaining on social media on the morning of the acquisition announcement that the company was no longer allowing them to connect to third-party applications.\n “Primarily  Fleetsmith   maintained a third party app catalog, so you could deploy things like Chrome or Zoom to your Macs, and Fleetsmith would maintain security updates for those apps. This was the main reason we purchased Fleetsmith,” a Fleetsmith customer told TechCrunch.\n  The customer added that the company described this functionality as a major feature in  a company blog post:\n Fleetsmith handles this all for you automatically. Once the version is enforced, it is downloaded and queued for install immediately across the device fleet. Most apps will update silently and automatically once they’re restarted, but users can also choose to do the update manually. Our agent will remind users about the update periodically, and then once the enforcement date hits, it will give them an opportunity to save work and then run the update itself.\n  As it turned out, Apple had made it clear that it was discontinuing this feature in an email to Fleetsmith customers on the day of the transition. The email included links to several help articles that were supposed to assist admins with the transition. (The email is included in full at the end of the article).\n The general consensus among admins that I spoke to was that these articles were not terribly helpful. While they described a way to fix the issues, they said that Apple has turned what was a highly automated experience into a highly manual one, effectively eliminating the speed and ease of use advantage of having then update feature in the first place.\n Apple did confirm that it had responded to some help ticket requests after the changes this week, saying that it would soon restore some configurations for Catalog apps, and were working with impacted customers as needed. The company did not make clear, however, why they removed this functionality in the first place.\n Fleetsmith offered a couple of key features that appealed to Mac system administrators. For starters, it let them set up new Macs automatically out of the box. This allows them to ship a new Mac or other Apple device, and as soon as the employee powers it up and connects to WiFi, it connects to Fleetsmith where systems administrators can track usage and updates. In addition, it allowed System Administrators to enforce Apple security and OS updates on company devices.\n What’s more, it could also do the same thing with third-party applications like Google Chrome, Zoom or many others. When these companies pushed a new update, system administrators could make sure all users had the most recent version running on their machines. This is the key functionality that was removed this week.\n It’s not clear why Apple chose to strip out these features outlined in the email to customers, but it seems likely that most of this functionality  isn’t coming back, other than restoring some configurations for Catalog apps.\n Email that went out to Fleetsmith customers the day of the acquisition outlining the changes:\n   Attempts to reach Fleetsmith founders for comment were unsuccessful. Should that change we will update the article.", "posttime": "2020-06-27 03:13:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,程序,支持,customers", "title": "\nFleetsmith客户对苹果收购后失去第三方应用程序支持感到不满", "title_en": "\n\t\t\t\tFleetsmith customers unhappy with loss of third-party app support after Apple acquisition\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/fleetsmith-customers-unhappy-with-loss-of-third-party-app-support-after-apple-acquisition/", "via": "", "real_tags": ["apple", "苹果", "程序", "支持", "customers"]}, {"category": "", "categoryclass": "", "imagename": "26c3490b8f28f3af421d7fce594c65c8.jpg", "infoid": 1008499, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你不会找到更大的发射台，这个非同寻常的机会之窗将于6月26日晚上11点59分(太平洋时间)砰的一声关闭。申请“创业战场”，就在这里，就在现在。\n今年的传奇投球比赛是虚拟的，但竞争带来的好处和机会是非常真实的，而且往往会改变生活-对于所有参与者来说，不仅仅是最终的获胜者。让我们更深入地探讨一下这一点。\n最高奖金-10万美元股权自由现金-将为您的底线带来奇迹。TechCrunch专题文章-带您走进英雄联盟。随着胜利而来的颠覆杯和赞誉，好吧，谁不喜欢吹嘘自己的权利呢？但正是在全球范围内，对寻求收购有前途的初创公司的媒体、投资者、潜在客户和大型科技公司的巨大敞口，才能将战场竞争对手带上一个全新的轨道。\n下面快速浏览一下Startup Battlefield是如何工作的。我们接受来自任何背景、地域和行业的创始人的申请，只要你的公司处于初创阶段，拥有带有技术组件(软件、硬件或平台)的MVP，并且没有得到太多主要媒体的报道。\n我们的编辑会筛选每一份申请，并只会选择他们认为拥有某些特定条件的初创公司。这场史诗般的较量发生在Disrupt2020期间，从9月1日开始。14-18。注：这个机会是百分之百免费的。TechCrunch不收取任何申请费或参与费，也不收取任何股权。\n你将接受TC编辑为期六周的自由投球指导，让你进入最佳格斗状态。外加与行业专家的虚拟网络研讨会系列。你只有6分钟的时间向评委--由专家风投、企业家和TechCrunch编辑组成的小组--进行推介和演示。然后你要回答他们的问题--他们会有很多问题。\n在第一轮中幸存下来的创始人将在Disrupt的最后一天进入决赛。当你向一组新的评委推销时，这是起泡-冲洗-重复。接下来是大揭晓的时候了：一家初创公司获得了头衔、颠覆杯和10万美元的奖金。\n您点击申请链接了吗？没有吗？这里有更多申请的理由。如果你在比赛中获得一席之地，你就可以获得一张颠覆数字专业通行证，你还可以在数字创业巷向世界各地的人们免费展示。\n您将与我们的人工智能平台CrunchMatch建立网络，与投资者、媒体、潜在客户和渴望与战场竞争对手见面的人群建立虚拟的1：1会议。\n获得领先声音网络研讨会：听取顶尖行业人士分享他们在大流行期间和之后适应和蓬勃发展的战略。\n这个免费的、福利丰厚的机会在短短12小时内就消失了。不惜一切代价让你的初创企业继续前进。在截止日期6月26日晚上11点59分(太平洋时间)之前申请参加Startup Battlefield的比赛。\n贵公司是否有兴趣赞助或参展Disrupt2020？请填写此表格与我们的赞助销售团队联系。", "note_en": "You won’t find a bigger launching pad, and this window of extraordinary opportunity slams shut on June 26 at 11:59 pm (PT).  Apply to Startup Battlefield right here, right now.\n This year’s legendary pitch competition is virtual, but the benefits and opportunity that comes from competing are very real and often life changing — for all participants not just the ultimate winner. Let’s explore that a bit more.\n  The top prize — $100,000 equity free cash — will do wonders for your bottom line. The TechCrunch feature article – brings you into the league of legends. The Disrupt cup and the acclaim that comes with winning, well, who doesn’t love bragging rights? But it’s the huge exposure — on a global scale — to media, investors, potential customers and big tech players looking to acquire promising startups, that can take Battlefield competitors on a whole new trajectory.\n Here’s a quick look at how Startup Battlefield works. We accept applications from founders of any background, geography and industry as long as your company is early stage, has an MVP with a tech component (software, hardware or platform) and hasn’t received much major media coverage.\n Our editors screen every application and will choose only startups they feel possess that certain je ne sais quoi. The epic pitch-off takes place during Disrupt 2020, which runs from Sept. 14 – 18.  Note: This opportunity is 100 percent free. TechCrunch does not charge any application or participation fees or take any equity.\n You’ll receive six weeks of free pitch coaching from TC editors to whip you into prime fighting trim. Plus a virtual webinar series with industry experts. You’ll have just 6 minutes to pitch and demo to the judges — a panel of expert VCs, entrepreneurs and TechCrunch editors. Then you’ll answer their questions — and they’ll have plenty.\n Founders who survive the first round move to the finals on the last day of Disrupt. It’s lather-rinse-repeat as you pitch to a fresh set of judges. Then it’s time for the big reveal: one startup takes the title, the Disrupt cup and the $100,000.\n Have you clicked the application link yet? No? Here are more reasons to apply. If you earn a spot in the competition, you get a  Disrupt Digital Pro pass and you get to exhibit to people around the world in  Digital Startup Alley — for free.\n You’ll network with CrunchMatch, our AI-powered platform, to set up virtual 1:1 meetings with investors, media, potential customers and the throngs of folks eager to meet a Battlefield competitor.\n  Access to Leading Voices Webinars: Hear top industry minds share their strategies for adapting and thriving during and after the pandemic\n This no-cost, perk-packed opportunity disappears in just 12 hours. Do whatever it takes to keep your startup moving forward.  Apply to compete in Startup Battlefield before the deadline expires on  June 26 at 11:59 pm (PT).\n Is your company interested in sponsoring or exhibiting at Disrupt 2020? Contact our sponsorship sales team by   filling out this form.", "posttime": "2020-06-27 03:13:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "创业,2020,申请,left", "title": "\n在Disrupt2020申请创业战场只剩下12个小时了", "title_en": "\n\t\t\t\tOnly 12 hours left to apply for Startup Battlefield at Disrupt 2020\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/only-12-hours-left-to-apply-for-startup-battlefield-at-disrupt-2020/", "via": "", "real_tags": ["创业", "2020", "申请", "left"]}, {"category": "", "categoryclass": "", "imagename": "32f90ab46e0b3b31c793338caaf261f2.jpg", "infoid": 1008497, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "克雷格·费德里吉(Craig Federighi)对iOS14和更具争议性的2020年发布的一些见解！WVFRM全集：http://bit.ly/WaveformMKBHD感谢.", "note_en": "Some insight with Craig Federighi about the iOS 14 and the more controversial 2020 announcements! Full WVFRM episode: http://bit.ly/WaveformMKBHD Thanks for ...", "posttime": "2020-06-27 03:11:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,苹果,回应,responds,waveformmkbhd", "title": "苹果回应你的评论[采访克雷格·费德勒]", "title_en": "Apple Responds to Your Comments [Interview with Craig Federigh]", "transed": 1, "url": "https://www.youtube.com/watch?v=Q2aaCDNjWEg", "via": "", "real_tags": ["apple", "苹果", "回应", "responds"]}, {"category": "", "categoryclass": "", "imagename": "d5e73fa06a7cdce222d81bdaccdccc46.jpg", "infoid": 1008496, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "分析表明，英国医院里的冠状病毒患者现在的死亡速度比疫情高峰期要慢。\n牛津大学的研究人员发现，在4月至6月期间，英国每天死亡的冠状病毒患者的比例从6%下降到1.5%。\n治疗的改进、患者数量的变化和季节性影响都可能起到作用。\n在4月8日疫情最严重的时候，英格兰有15468名冠状病毒携带者住院，其中899人死亡(6%)。\n根据牛津大学循证医学中心汇编的最新数据，截至6月21日，有2698名冠状病毒患者住院治疗，其中30人死亡(1%)。\n医院病死率是自疫情爆发以来使用的一种衡量标准，提供了一致的数字，并使研究人员能够寻找趋势。\n虽然住院人数和住院死亡人数都在下降，但死亡人数下降的速度更快。\n与新冠肺炎一起住院的人数每29天减少一半，而死亡人数每16天减少一半。\n进行这项分析的卡尔·赫内根教授表示，包括意大利在内的其他国家也出现了医院死亡率下降的模式，\n如果死亡率是1%而不是6%，这是一种截然不同的疾病。\n他说，这意味着在疾病最严重的4月份，每天有500人死亡。\n他的合著者杰森·奥克(Jason Oke)说，这是一个令人鼓舞的趋势，但需要更多的工作来理解原因。\n尽管研究人员无法确定这一趋势背后的确切原因，但他们提出了一些原因。\n其一是，随着对这种疾病的了解越来越多，医护人员已经能够更好地使用现有药物治疗它，即使在新的治疗方法上没有任何重大突破。\n例如，医生现在已经准备好期待血液凝固和免疫反应过度的患者，而在早期，他们希望治疗主要被视为呼吸道疾病的症状。\n在重症监护患者中，常见的类固醇地塞米松现在被用来抑制可能导致器官损伤的失控免疫反应。\n根据赫内根教授的说法，这可能是一个关键因素，但不太可能完全解释死亡率下降的原因。\n这也可能归因于住院患者类型的变化。\n研究人员表示，随着NHS的压力有所缓解，有可能会有空间接纳那些在疫情高峰期没有达到更严格的医院护理门槛的患者。这些患者可能会稍微不那么脆弱，因此死亡的可能性也更小。\n更令人沮丧的是，这种病毒也有可能已经撕裂了最脆弱的人群，留下了一开始风险较低的人。\n另一种可能性是，可能有一群患者长期住院，他们既没有出院，也没有死于病毒。\n夏天也可能起到保护作用：循环中危害人们免疫系统的其他疾病较少，而更多的阳光意味着更多的维生素D。", "note_en": "Coronavirus patients in hospital in England are dying at a slower rate now than they were at the peak of the epidemic, analysis suggests.\n University of Oxford researchers found the proportion of coronavirus patients dying each day in England fell from 6% to 1.5% between April and June.\n Improvements in treatments, changes in the patient population and seasonal effects could all play a role.\n  Around the height of the outbreak, on 8 April, there were 15,468 people in hospital in England with coronavirus of whom 899 died (6%).\n  By 21 June there were 2,698 hospitalised coronavirus patients, 30 of whom died (1%), according to the most recent data compiled University of Oxford&#39;s Centre for Evidence-Based Medicine.\n Hospital case fatality is a measure used since the beginning of the outbreak, providing consistent figures and enabling researchers to look for trends.\n  While both the number of people in hospital and the number of hospitalised people dying are falling, deaths are falling at a faster rate.\n The number of people in hospital with Covid-19 is halving every 29 days, while deaths are halving every 16 days.\n Prof Carl Heneghan, who carried out the analysis, said the pattern of falling death rates in hospitals was also being seen in other countries, including Italy,\n  &#34;It&#39;s a radically different disease we&#39;re looking at if the death rate is 1% rather than 6%&#34;.\n He said that translated to a difference of 500 deaths a day in April when the disease was at its height.\n &#34;This is an encouraging trend but one that needs more work to understand the cause,&#34; his co-author Jason Oke said.\n Although the researchers were unable to determine exactly what was behind the trend, they put forward a number of reasons.\n  One is that, as more is understood about the disease, healthcare staff have been better able to treat it using existing drugs, even without any major breakthrough in new treatments.\n For example, doctors are now primed to expect patients with blood clotting and overactive immune responses, whereas in the early days they were looking to treat the symptoms of what was seen as primarily a respiratory disease.\n And in critical care patients, the common steroid  dexamethasone is now being used to dampen down the out-of-control immune reactions that can cause organ damage.\n This is likely to be a key factor, but is unlikely to completely explain the falling death rate, according to Prof Heneghan.\n  It may also be down to changes in the types of patients admitted to hospital.\n  As strain on the NHS has eased, the researchers say it is possible that there is room to admit patients who would not have met the stricter threshold for hospital care at the height of the epidemic. And these patients may be slightly less vulnerable and therefore less likely to die.\n More sombrely, it&#39;s also possible that the virus, having torn through the most vulnerable populations, has left behind people who were at lower risk to start with.\n A further possibility is that there could be a group of patients in hospital for long periods, not being discharged but also not succumbing to the virus.\n Summer might also be playing a protective role: there are fewer other illnesses in circulation to compromise people&#39;s immune systems, and more sunlight means more  Vitamin D.", "posttime": "2020-06-27 03:05:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,death,患者", "title": "医院冠状病毒死亡率下降", "title_en": "Coronavirus death rate falling in hospitals", "transed": 1, "url": "https://www.bbc.com/news/health-53192532", "via": "", "real_tags": ["病毒", "冠状病毒", "death", "患者"]}]