[{"category": "", "categoryclass": "", "imagename": "fc80536ae67615466e276913a1ff1384.jpg", "infoid": 1008574, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在本周的“蜂巢内幕”节目中，尼克·比尔顿回来谈论新冠肺炎和“黑人生命也是命”运动期间的社交媒体，马克·扎克伯格将如何被载入史册，以及为什么我们不应该相信最新的民意调查。另外，比尔顿还展示了他的牵线搭桥能力。\niTunes用户？只需点击此处，即可在您方便的时候收听“蜂巢内幕”节目。别忘了订阅。\n-美国分离的公主伊万卡·特朗普(Ivanka Trump)的平行宇宙-“不，我不好”：一名黑人记者向他的白人朋友们发表讲话-为什么破产的赫兹是大流行的僵尸-明尼阿波利斯抗议活动中愤怒和哀悼的场景-民权倡导者布兰迪·柯林斯-德克斯特(Brandi Collins-Dexter)谈为什么Facebook选择特朗普而不是民主-民主党人的蓝色德克萨斯州发烧梦想可能最终成为现实-来自档案：盘点毫无准备的梅拉尼娅·特朗普(Melania Trump)-。\n还想要更多吗？注册我们的每日蜂巢时事通讯，决不会错过任何故事。", "note_en": "On this week’s episode of  Inside the Hive,  Nick Bilton comes back to talk about social media during COVID-19 and the Black Lives Matter movement; how  Mark Zuckerberg will be remembered in history books; and why we shouldn’t trust the newest polls. Plus, Bilton reveals his matchmaking abilities.\n  iTunes user? Just tap  here to listen to Inside the Hive  at your convenience. And don’t forget to subscribe.\n   — The Parallel Universe of Ivanka Trump, America’s  Dissociated Princess —  “No, I Am Not Okay”: A Black Journalist Addresses His White Friends — Why Bankrupt Hertz Is a  Pandemic Zombie — Scenes of  Fury and Mourning at the Minneapolis Protests —  Civil Rights Advocate Brandi Collins-Dexter on Why Facebook Chooses Trump Over Democracy — Democrats’ Blue-Texas  Fever Dream May Finally Become a Reality — From the Archive: Taking Stock of Melania Trump, the  Unprepared—And Lonely—FLOTUS\n  Looking for more?  Sign up for our daily Hive newsletter and never miss a story.", "posttime": "2020-06-27 16:53:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,福克斯,fox,蜂巢", "title": "Facebook是福克斯新闻吗？", "title_en": "Is Facebook the New Fox News?", "transed": 1, "url": "https://www.vanityfair.com/news/2020/06/is-facebook-the-new-fox-news", "via": "", "real_tags": ["facebook", "福克斯", "fox", "蜂巢"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008573, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这个节目中，Zig社区的成员分享代码和想法。", "note_en": "The show where members of the Zig community share code and ideas.", "posttime": "2020-06-27 16:51:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "zig,社区", "title": "Zig Showtime", "title_en": "Zig Showtime", "transed": 1, "url": "https://zig.show/", "via": "", "real_tags": ["zig", "社区"]}, {"category": "", "categoryclass": "", "imagename": "9fcaba7ad711eb399454a307680606ac.jpeg", "infoid": 1008572, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇报道在Business Insider Prime上独家提供。加入BI Prime，现在就开始阅读吧。\n据三名知情人士透露，以及Business Insider看到的内部文件，特斯拉在2012年6月知道其Model S汽车配备了一个有缺陷的电池冷却系统，因为这些汽车开始交付给客户。但不管怎样，公司还是把车卖了。\n设计上的缺陷使冷却系统容易漏水。行业专家告诉Business Insider，一旦冷却剂泄漏到电池组中，就会使电池短路或引发火灾。\n根据Business Insider查看的内部电子邮件和文件，这个设计缺陷在2012年春季成为公司内部一个紧迫的话题。事实上，2012年，随着汽车从生产线上下来并交付给客户，电子邮件显示，特斯拉的员工仍对生产线上发现的泄漏部件感到担忧。\n首先，根据第三方公司IMR Test Lab在2012年夏天所做的测试，特斯拉选择用于冷却线圈端部配件的铝制特斯拉容易出现裂缝和针孔。Business Insider审查了这些测试结果。\n其次，根据Business Insider看到的电子邮件，冷却系统的端接件的设计不完善，以至于即使在部件钎焊在一起后，冷却线圈及其连接到汽车的端接件之间也存在间隙。“商业内幕”(Business Insider)和一名前特斯拉员工看到的特斯拉内部文件显示，有时，员工不得不用锤子把碎片拼在一起，以缩小差距。\n这两个设计缺陷都有可能导致冷却系统泄漏，这意味着电池冷却液可能会溢出到汽车的电池组中。“商业内幕”(Business Insider)查看的特斯拉内部文件显示，截至2012年底，特斯拉继续在其生产线上发现泄漏的冷却部件--称为带子或冷却线圈。目前尚不清楚特斯拉是何时改变设计以防止泄漏的。\n美国国家公路运输局(National Highway Transportation Agency)正在调查2012至2019年期间生产的特斯拉Model S和Model X汽车是否存在电池缺陷，这可能会导致非撞车火灾。此前，许多特斯拉客户提交了一份请愿书，抱怨特斯拉软件更新限制了他们的汽车一次充电的行驶里程。特斯拉是在2019年发生一系列火灾后做出这一更新的。\n消费者律师爱德华·陈(Edward Chen)在去年向美国国家公路交通安全管理局(National Highway Traffic Safety Administration)提交的请愿书中称，特斯拉正在使用空中软件更新来掩盖和掩盖其车辆电池存在的一个潜在的广泛而危险的问题。\n多年来，特斯拉一直在处理有关其电池安全性的问题。这在一定程度上是因为这项技术是新的，电动汽车起火不同于传统内燃机的起火。因为大火是由化学反应引发的，所以有时需要几天时间才能扑灭，在紧急救援人员离开现场几个小时后又会重新点燃。一旦电池烧毁，几乎不可能找到起火点。火灾也可以自发开始。2019年，旧金山、香港和上海的车库里停放的特斯拉随机起火。\n里卡多战略咨询公司(Ricardo Strategic Consulting)副总裁杰森·舒格(Jason Schug)在接受“商业内幕”(Business Insider)采访时表示，他已经拆卸了特斯拉的Model S和Model X，以及它的Model 3。他告诉“商业内幕”，如果冷却液泄漏到电池模块中，可能会导致电池无法使用。舒格曾在通用汽车和福特汽车公司度过了部分工程生涯。\n舒格说，当我们拆卸特斯拉Model X时，一名技术人员不小心将冷却液洒在电池组中，电池组在那里停留了很长时间。没有直接的危险，但当我们拆下电池模块时，很长一段时间后，我们发现电池有很大的腐蚀，有些电池泄漏电解液，这已经够糟糕的了。如果这件事发生在野外而没有引起注意，可能会导致电池爆裂。\n特斯拉没有回应Business Insider关于其冷却系统、电池或任何泄漏液体的可能性或影响的问题。\n舒格还说，虽然电池冷却剂本身不可燃，但一旦蒸发后留下的残留物可能是可燃的。这不仅适用于特斯拉，也适用于全电动汽车。2017年，宝马因火灾风险召回100万辆汽车。\n舒格说，与另一家制造商发生了一起事故，一辆正在进行碰撞测试的车辆在几周后自燃。在坠机过程中，冷却剂溢出到电池中，当它蒸发时，留下的残留物将电流传导到短路，从而使电池过热并引发火灾。\n所有这些都是说，电池的设计必须尽一切可能确保冷却剂不会泄漏到电池组中-至少不是在没有通知的情况下。如果是这样的话，后果可能是煽动性的。特斯拉没有回应“商业内幕”关于如何防止泄漏的问题。\n特斯拉的承诺不仅是让电动汽车变得性感，而且要以硅谷的方式做到这一点-比其他任何人都更快、更便宜。\n因此，当特斯拉为Model S设计电池时，它看起来使用了已经存在的部件，这样就可以让事情变得简单。它选择了18-650电池-一个可以从货架上买到的电池，因为它已经在笔记本电脑等日常使用的东西上生产了。\n为了制造电池组，数千个这样的电池被分成十几个模块--数量取决于电池的续航能力。\n但电池中有这么多电池有一个问题：如果一个电池过热，可能会引发一种称为热失控的化学反应，其他电池也会过热并起火，引发交感爆炸。这就是为什么-就像2019年特斯拉S型车停在上海的一个车库里起火的情况一样-只需要一个过热的电池或模块就能启动连锁反应，导致电池失火。这就是为什么-就像2019年特斯拉S型车停在上海的一个车库里时一样-只需要一个过热的电池或模块就能启动连锁反应，导致。\n自动救援和火灾救援专家布罗克·阿切尔(Brock Archer)去年告诉“商业内幕”(Business Insider)，锂离子电池着火的原因真的只有几个。他说，这些原因是液体的，死气沉沉的，或者说，每10亿个电池中就有一个是自燃的。\n特斯拉敏锐地意识到了电池化学方面的这些问题，在2009年提交的一项电池专利中详细解释了其设计正在采取的措施，以减轻这一风险。据“商业内幕”(Business Insider)一位参与电池设计的前高级员工表示，这就是为什么电池化学和电池结构是该公司的主要设计顾虑(撇开成本不谈)。由于担心遭到报复，此人要求匿名。\n电池的电池化学成分必须精确，才能使汽车达到远距离和高速度。而且汽车本身的设计必须不惜一切代价在发生撞车时保护电池。这是因为即使是电池的少量损坏也有可能引发这种连锁反应，也就是所谓的细胞繁殖，当其中一个电池的温度升高引起连锁反应时。\n一名于2018年离开公司的前员工表示，由于特斯拉正在进行制造过程的速度，它有时会要求第三方供应商为公司做研发。三名前特斯拉员工和两家供应商告诉“商业内幕”，这一安排并非没有摩擦。根据他们的说法，特斯拉有时对第三方的建议不屑一顾，要求的工作比支付的更多，并推动供应商以惊人的速度提高产量。这些人的身份得到了Business Insider的验证，由于担心报复，他们要求匿名。\n随着特斯拉对电池模块的需求增长，它对冷却线圈的需求也在增长。在最初的S型电池设计中，铝冷却线圈缠绕在电池模块上，并使用末端配件连接到汽车上。\n2014年离职的一名前员工表示：当你要发布一个新的组件时，在第一次发布的过程中，上线总是会遇到困难和问题，特别是当你重新启动特斯拉，而你又要求你的供应商进行有限的研发时。我们确实遇到过漏水的问题。\n当特斯拉开始解决S型车的冷却线圈问题时，这款车的发布已经落后于计划。在“埃隆·马斯克：特斯拉、SpaceX和追求美好未来”一书中，阿什利·万斯说，为了让汽车尽快出厂，马斯克从企业的各个部门--从招聘到设计工作室--召集员工，以尽可能快的速度卖出更多的汽车。(注：特斯拉、SpaceX和“追求美好未来”)阿什利·万斯在书中说，为了让汽车尽快出厂，马斯克从企业的各个部门--从招聘到设计工作室--召集了员工，以尽可能快的速度销售汽车。\n根据Business Insider查看的文件，2012年7月，一些冷却线圈被送往纽约州北部一家名为IMR测试实验室的实验室。\n根据商业内幕(Business Insider)审阅的IMR报告，冷却线圈上的末端配件不符合法规强度铝合金的化学要求。一位知情人士说，结果与特斯拉分享，但Model S汽车不断出厂。根据特斯拉2012年第三季度收益报告，该公司交付了250多辆Model S轿车。\n2012年8月，该部件再次进行了测试。特斯拉将部件寄给了工程和科学咨询公司Exponent。根据Business Insider查看的内部电子邮件，特斯拉感到担忧，因为冷却线圈上的末端配件没有固定在一起，因此是泄漏的来源。“商业内幕”(Business Insider)查看的一封内部电子邮件显示，2012年8月，一名特斯拉员工形容他们悬于一线。\n在Exponent处理这件事的工程师是一位名叫斯科特·利伯曼(Scott Lieberman)的人。他现在LPI Inc.工作。利伯曼拒绝接受“商业内幕”(Business Insider)的采访。然而，在“商业内幕”(Business Insider)看到的他与特斯拉之间的内部电子邮件中，他对这个角色的看法是明确的。他在有限的测试后发现了测试材料上的缺陷-特别是导致泄漏的微小针孔。\n根据Business Insider查阅的文件，直到2012年底，特斯拉在生产的各个阶段继续发现泄漏的线圈。“商业内幕”(Business Insider)看到的2012年10月发送的内部电子邮件显示，其中一些在生产线上被发现得很晚，被描述为严重的质量问题，或者被发现电池组泄漏了液体。“商业内幕”(Business Insider)查看了这些电子邮件。文件显示，在这一点上，问题已经被标记给高级管理层。\n在2012年9月发送的另一封电子邮件中，员工们提到，生产线上的工人有时不得不用锤子将末端配件固定在一起。\n2014年离开特斯拉的这名员工表示，按照特斯拉的标准，这些问题被认为是正常的。与传统汽车制造商不同，特斯拉没有等待新车型重新设计零部件。这位员工说，取而代之的是，零部件不断地重新设计，并部署到车辆上。另一方面，这位前雇员还表示，公司已经进行了大量的调查和对策，试图减少泄密。\n特斯拉没有回应Business Insider关于其设计过程或用于减少这一部分泄密的对策的问题。\n这位于2014年离开公司的前员工表示，铝材的弯曲使其更加脆弱，而且在匆忙制定生产目标时，端部配件有时仍被强行拼装在一起，导致泄漏。“。\n我们确实发现了几辆车，这位前雇员在谈到有泄漏的汽车时说。我不知道确切的数量，但对于一家决定推出有限研发的公司来说，我同样认为这是正常的，希望：我们将以这种方式推出，我们将进行检查，确保在工厂发现这种情况。\n密歇根大学(University Of Michigan)工业与运营工程教授杰弗里·利克(Jeffrey Liker)表示，这根本不是像丰田这样的传统汽车制造商如何处理设计缺陷的。他是“丰田之道：来自世界上最大的制造商的14条管理原则”一书的作者。\nLiker说，像丰田这样的汽车制造商提前加载了他们的制造过程。他们投入了大量资源进行准备，为新部件创建和压力测试原型，然后有一个试生产阶段，在认真开始制造过程之前捕捉任何缺陷。当然，大多数丰田汽车80%的零部件都来自以前的设计。另一方面，特斯拉正在设计一款全新的汽车--这一过程在制造业被称为“无纸设计”。\n利克说，当你从零开始，你就有了更多的空间来展示特斯拉带来的创新，但也有更高的设计缺陷或生产问题的风险。\n利克说，这款车的每一个部件都是突破性的创新，所以几乎可以肯定会出现严重的生产问题。这是一种权衡，马斯克本可以更保守一些，但他的竞争优势会是什么呢？\n为了试图了解自2012年以来该公司的生产流程发生了怎样的变化，Business Insider联系了三名曾在特斯拉工作过不同时间的员工。\n虽然他们都不能确认冷却线圈问题的程度，但他们都表示，特斯拉仍然是一个节奏快得令人难以置信的工作场所，设计也在不断变化。\n特斯拉总是由生产驱动的，所以有时如果问题不是出现在客户面前，他们就会继续推出汽车。事情就是这么简单，一位2018年离开公司的工程师告诉“商业内幕”(Business Insider)，他指的是他在公司的一般经历。\n另一名为NUMMI(特斯拉收购的丰田和通用汽车(General Motors)共同拥有的工厂)工作了十多年并为特斯拉工作了四年的员工告诉“商业内幕”(Business Insider)，他在特斯拉的经历与他在NUMMI的经历非常不同。\n这位2017年离职的员工表示，丰田没有像特斯拉那样仓促行事。这名员工还表示，尽管零部件经过了严格的测试，但测试这些零部件的工人没有接受到他们将在NUMMI接受的广泛培训。这位前员工说，当时根本没有时间，特斯拉的硅谷工程师也不想听太多关于NUMMI是如何做事情的。\n当我被录用时，他们说他们不想听有关NUMMI或丰田的事。“我们是一家高科技公司，不是汽车公司，”他们告诉我，这位前雇员说。\n这位前雇员说，设计上的频繁变化造成了特斯拉供应链的中断-让供应商感到不安-并浪费了资金和材料。\n他们说，工程师们会做一些修改或改变，然后他们就会切换到这一点上来。那样的话，特斯拉就会有一卡车老式的产品，他们会浪费掉……。这就是他们的运作方式。\n这三名前员工都表示，供应链的中断对公司来说是浪费。一位在Model S发布期间曾在特斯拉工作的员工表示，特斯拉内部的一个笑话是，如果你排好前一万辆S型货车，每一辆都会不同。\n这位前雇员说：我认为，每一家汽车公司发布的车辆都存在设计缺陷，这是很常见的。这叫做运行设计更改。&#34；\n这位前雇员说，正是这些设计缺陷为特斯拉以惊人的速度不断创新腾出了空间。此外，这位知情人士说，特斯拉的早期用户并不是真的买车。\n我的理解是，2012年的每一位顾客都在购买特斯拉的信任。这位前雇员说，他们并不期待一辆完美的车。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。", "note_en": "This story is available exclusively on Business Insider Prime.  Join BI Prime and start reading now.\n  Tesla knew its Model S cars were equipped with a battery-cooling system that had a flawed design in June 2012, as those cars started being delivered to customers, according to three people familiar with the matter and internal documents viewed by Business Insider. But the company sold the cars anyway.\n The flaw in the design made the cooling system susceptible to leakage. Once coolant leaks into a battery pack, it can short a battery or cause a fire, industry experts told Business Insider.\n This design flaw became a topic of urgent concern within the company in spring 2012, according to internal emails and documents viewed by Business Insider. And indeed, as cars were rolling off the production line and being delivered to customers in 2012, emails showed that Tesla employees were still concerned about the parts found leaking on the production line.\n  First, the aluminum Tesla chose to use for the end fitting of the cooling coil was susceptible to cracks and pinholes, according to tests done by the third-party firm IMR Test Lab in summer 2012. Business Insider reviewed these test results.\n Second, the design of the end-fitting piece in the cooling system was imperfect, such that even after the part was brazed together, there were gaps between the cooling coil and its end-fitting piece that connected it to the car, according to emails viewed by Business Insider. Sometimes, employees would have to force pieces together with a hammer to close gaps, according to internal Tesla documents viewed by Business Insider and a former Tesla employee.\n   Both of these design flaws had the potential to cause leaks in the cooling system, meaning that the battery coolant could spill into a car&#39;s battery pack. Tesla continued to find leaking cooling parts — referred to as bandoliers or cooling coils — on its production line through the end of 2012, according to internal Tesla documents viewed by Business Insider. It is unclear when Tesla changed the design to prevent leakage.\n The National Highway Transportation Agency is investigating whether Tesla Model S and Model X vehicles made between 2012 and 2019 had battery defects that could cause &#34;non-crash fires.&#34; This came after a number of Tesla customers filed a petition complaining about a Tesla software update that limited the range their cars could drive on a single charge. Tesla made the update after a series of fires in 2019.\n   &#34;Tesla is using over-the-air software updates to mask and cover-up a potentially widespread and dangerous issue with the batteries in their vehicles,&#34;  consumer attorney Edward Chen alleged in a petition he filed to the National Highway Traffic Safety Administration last year.\n Tesla has been dealing with  questions about the safety of its batteries for years. This is partly because the technology is new, and electric-vehicle fires are different from fires in traditional combustion engines. Because they&#39;re sparked by a chemical reaction, the fires can sometimes take  days to put out, re-sparking hours after emergency responders have left a scene. It&#39;s almost impossible to find the source of a fire once the battery has been destroyed. The fires can also start spontaneously. In 2019, fires randomly started in parked Teslas in garages in  San Francisco,  Hong Kong, and  Shanghai.\n Jason Schug, a vice president at Ricardo Strategic Consulting who spent part of his engineering career at GM and Ford, told Business Insider he&#39;s done teardowns of Tesla&#39;s Model S and Model X vehicles, which share the same battery, as well as its Model 3. He told Business Insider that if coolant leaked into a battery module, it could render the battery useless.\n &#34;When we disassembled the Tesla Model X, a technician accidentally spilled coolant in the battery pack, and it sat there for a long time,&#34; Schug said. &#34;There was no immediate danger, but when we removed the battery modules, quite a while later we found a lot of corrosion on the battery cells, and it was bad enough that some of the cells were leaking electrolyte. If this were to happen in the field and go unnoticed, it could result in bricking the battery.&#34;\n  Tesla did not respond to Business Insider&#39;s questions about its cooling system, batteries, or any possibility or impact of leaking fluid.\n Schug also said that while the battery coolant itself is not flammable, the residue it leaves behind once it evaporates can be. This doesn&#39;t go for just Tesla but for all-electric vehicles. In 2017,  BMW recalled 1 million vehicles for fire risk.\n &#34;There was an incident with another manufacturer that a vehicle that had been in a crash test spontaneously combusted weeks later,&#34; Schug said. &#34;Coolant had spilled in the battery during the crash, and when it evaporated, it left a residue which conducted electricity into a short circuit, which overheated the battery and triggered a fire.&#34;\n   All of this is to say that an electric battery&#39;s design must do everything possible to ensure coolant doesn&#39;t leak into the battery pack — at least not without notice. If it does, consequences can be incendiary. Tesla did not respond to Business Insider&#39;s questions about how it prevents leakage.\n  The promise of Tesla has been not only to make electric vehicles sexy but also to do so the Silicon Valley way — faster and cheaper than everyone else.\n So when it came time for Tesla to design the battery for the Model S, it looked to use parts that already existed so it could keep things simple. It settled on the 18-650 battery cell — a cell that it could buy off the shelf because it was already being manufactured for everyday use in things like laptops.\n To make a battery pack, thousands of these cells are grouped into over a dozen modules — the number depends on the battery&#39;s range.\n But there is an issue with having so many cells in the battery: If a single cell overheats, it can set off a chemical reaction called &#34;thermal runaway,&#34; in which other cells also then overheat and catch fire in an act of &#34;sympathetic detonation.&#34; This is why — as with the  case of the Tesla Model S that caught  fire while it was parked in a garage in Shanghai in 2019 — it takes only one overheated cell or module to start the chain reaction that leads to a fire.\n &#34;There are really only a few reasons why a lithium-ion battery catches on fire,&#34; Brock Archer, an auto-extrication and fire-rescue expert,  told Business Insider last year. Those reasons are &#34;liquid, dead short,&#34; or, for every one battery cell in 1 billion, &#34;spontaneous combustion,&#34; he said.\n Tesla was keenly aware of these issues with electric-battery chemistry, explaining in detail the steps its design was taking to mitigate this risk in a  battery patent filed in 2009. That is why — according to one former senior employee involved with the battery&#39;s design who spoke with Business Insider on the condition of anonymity for fear of retaliation — cell chemistry and battery structure were the company&#39;s main design concerns, cost aside.\n  The cell chemistry of the battery had to be precise to enable the car to reach long range and high speeds. And the car itself had to be designed to protect the battery at all costs in the event of a crash. This is because even a small amount of damage to a battery cell has the potential to set off this chain reaction, also known as &#34;cellular propagation,&#34; when a temperature surge in one causes a chain reaction.\n   Because of the speed with which Tesla was going through the manufacturing process, it sometimes asked third-party suppliers to do research and development for the company, a former employee who left the company in 2018 said. Three former Tesla employees and two suppliers told Business Insider that this arrangement was not without friction. According to them, Tesla was sometimes dismissive of third-party suggestions, asked for more work than it paid for, and pushed suppliers to ramp up production volume at breakneck speed. These people, whose identities Business Insider verified, spoke on the condition of anonymity for fear of retaliation.\n As Tesla&#39;s need for battery modules grew, so did its need for cooling coils. In the initial Model S battery design, the aluminum cooling coils wound around the battery modules and connected to the car using end fittings.\n &#34;When you&#39;re launching a new component, there&#39;s always going to be difficulties and issues on line during first launch and especially when you&#39;re Tesla and you&#39;re asking your vendors to launch with a limited R&amp;D,&#34; a former employee who left in 2014 said. &#34;We did have problems with it leaking.&#34;\n  By the time Tesla started workshopping issues with the Model S&#39;s cooling coils, the car&#39;s launch was already behind schedule. In his book &#34; Elon Musk: Tesla, SpaceX, and the Quest for a Fantastic Future,&#34; Ashlee Vance said that in an effort to get cars out of the factory as quickly as possible, Musk pulled employees from all parts of the business — from recruiting to the design studio — to sell as many cars as possible as fast as possible.\n  According to documents viewed by Business Insider, a few cooling coils were sent to a lab called IMR Test Labs in upstate New York in July 2012.\n  According to the IMR report, which was reviewed by Business Insider, the end fittings on the cooling coils did not meet chemical requirements for a regulation-strength aluminum alloy. A source close to the matter said the results were shared with Tesla, but the Model S cars kept rolling out of the factory. According to  Tesla&#39;s 2012 third-quarter earnings report, the company delivered more than 250 Model S sedans.\n   In August 2012, the part was tested again. Tesla sent the part to Exponent, an engineering and scientific consulting firm. According to internal emails reviewed by Business Insider,  Tesla was concerned because the end fittings on the cooling coils were just not staying together and as such were a source of leakage. One Tesla employee described them as &#34;hanging by a thread&#34; in August 2012, according to internal emails viewed by Business Insider.\n The engineer who handled this at Exponent was a man named Scott Lieberman. He is now at LPI Inc. Lieberman declined to speak with Business Insider about this story. In internal emails between him and Tesla viewed by Business Insider, however, his opinion of the part was clear. He found defects — specifically, tiny pinholes that caused the leaks — on the tested materials after limited testing.\n Tesla continued to find leaking coils in various stages of production through the end of 2012, according to documents reviewed by Business Insider. Some were found late enough on the production line to be described as a &#34;critical quality issue,&#34; or were found to have leaked liquid into the battery pack, according to internal emails sent in October 2012, which were viewed by Business Insider. At this point, the problem had been flagged for senior management, documents indicate.\n In another email sent in September 2012, employees mentioned that workers on the production line sometimes had to use a hammer to get the end fittings to stay together.\n  The employee who left Tesla in 2014 said these issues were considered normal by Tesla standards. Unlike traditional automakers, Tesla didn&#39;t wait for new models to redesign parts. Instead, parts were constantly redesigned and deployed into vehicles, the employee said. On the other hand, the former employee also said the company had &#34;plenty of investigations and countermeasures&#34; to try to reduce leaks.\n Tesla did not respond to Business Insider&#39;s questions about its design process or the countermeasures it used to reduce leaks in this part.\n The former employee who left the company in 2014 said the bends in the aluminum &#34;made it more fragile&#34; and that the end fittings were still sometimes forced together as they rushed to make production goals, causing leaks.\n   &#34;We did find a few vehicles,&#34; the former employee said of cars that had leaks. &#34;I don&#39;t know exactly how many, but again that is what I would consider normal for a company that decides to launch with a limited amount of R&amp;D in the hopes of: &#39;We will launch with this, and we will put inspections in place that we catch it at the plant.&#39;&#34;\n  It is not at all how a design flaw would be dealt with at a traditional automaker, like Toyota, according to Jeffrey Liker, a professor of industrial and operations engineering at the University of Michigan. He&#39;s the author of &#34; The Toyota Way: 14 Management Principles from the World&#39;s Greatest Manufacturer.&#34;\n Liker said automakers like Toyota front-load their manufacturing process. They put a lot of resources in preparation by creating and stress testing prototypes for new parts and then having a pilot production period to catch any flaws before the manufacturing process begins in earnest. Of course, 80% of the parts in most Toyota vehicles are from previous designs. Tesla, on the other hand, was designing an entirely new car — a process referred to in the manufacturing world as &#34;clean-sheet design.&#34;\n And when you start with a clean sheet, you have a lot more room for the innovation Tesla has brought to the table, but also a much higher risk of design flaws or production problems, Liker said.\n &#34;Every part of the vehicle was breakthrough innovation, so it was almost guaranteed there would be serious production problems,&#34; Liker said. &#34;It&#39;s a trade-off, Musk could&#39;ve been more conservative, but then what would be his competitive advantage?&#34;\n  To try and understand how the company&#39;s production processes had changed since 2012, Business Insider reached out to three former Tesla employees who worked at the automaker at different times.\n While none of them were able to confirm the extent of issues with the cooling coil, they all said Tesla was still an incredibly fast-paced place to work and that designs were in constant flux.\n   &#34;Tesla is always driven by production, so sometimes if the issue isn&#39;t appearing for a customer, they&#39;ll just continue rolling out cars. It&#39;s as simple as that,&#34; an engineer who left the company in 2018 told Business Insider, referring to his general experience with the company.\n Another employee who spent over a decade working for NUMMI (the Fremont, California, factory jointly owned by Toyota and General Motors that Tesla purchased) and four years working for Tesla told Business Insider that his experience at Tesla was very different from his time at NUMMI.\n &#34;Toyota did not rush through things like Tesla did,&#34; the employee who left in 2017 said. The same employee also said that though parts were tested rigorously, the workers testing them did not receive the same extensive training they would receive at NUMMI. There simply wasn&#39;t time, and Tesla&#39;s Silicon Valley engineers didn&#39;t want to hear much about how things were done at NUMMI, the former employee said.\n &#34;When I was hired they said they didn&#39;t want to hear about NUMMI or Toyota. &#39;We&#39;re a high-tech company, not an auto company,&#39; they told me,&#34; the former employee said.\n The former employee said the frequent changes in design created disruptions in Tesla&#39;s supply chain — upsetting suppliers — and wasted money and materials.\n &#34;Engineers would make a modification or change or something, and they would switch over to that,&#34; they said. &#34;Then Tesla would have a truckload of products from the old style that they would waste ... that&#39;s how they run.&#34;\n All three former employees said disruptions in the supply chain were wasteful for the company. One employee who worked at Tesla during the Model S launch said the joke inside Tesla was &#34;that if you lined up the first maybe 10,000 Models S VINs, every single one would be different.&#34;\n    &#34;I think it&#39;s common in every auto company that vehicles are released with design flaws,&#34; the former employee said. &#34;It&#39;s called running design changes.&#34;\n Those design flaws, the former employee said, were what made room for Tesla&#39;s constant innovation at breakneck speed. Besides, the person said, Tesla&#39;s early adopters weren&#39;t really buying a car.\n &#34;It&#39;s my understanding that every customer back in 2012 was buying faith in Tesla. They weren&#39;t expecting a perfect car,&#34; the former employee said.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.", "posttime": "2020-06-27 16:44:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,设计,model,knew,电池", "title": "特斯拉知道其Model S电池存在可能导致火灾的设计缺陷", "title_en": "Tesla knew its Model S battery had a design flaw that could lead to fires", "transed": 1, "url": "https://www.businessinsider.com/tesla-faulty-battery-cooling-systems-design-model-s-2012-2019-6", "via": "", "real_tags": ["特斯拉", "设计", "model", "knew", "电池"]}, {"category": "", "categoryclass": "", "imagename": "c179a58af21f5c2eee9f7a133e01a061.jpg", "infoid": 1008571, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "汽水巨头可口可乐公司(Coca-Cola Company)周五晚间宣布，从7月1日开始，该公司将暂停全球社交媒体平台上的所有数字广告至少30天。\n此举是反诽谤联盟、全国有色人种协进会(NAACP)和其他组织组织的对Facebook和Instagram的更广泛抵制活动的一部分，该活动被称为“为利润而停止仇恨”运动。可口可乐(Coca-Cola)比其中一些公司走得更远，在全球范围内禁止社交媒体平台上的所有广告，而不仅仅是Facebook和Instagram。这表明抵制活动也将冲击Twitter、YouTube和其他平台。\n“我们将让他们知道，我们希望他们有更大的责任感、行动和透明度。”\n“从7月1日开始，可口可乐公司将暂停全球所有社交媒体平台上的付费广告至少30天，”可口可乐公司首席执行官詹姆斯·昆西在该品牌网站上发布的一份声明中写道。“我们将利用这段时间重新评估我们的广告标准和政策，以确定是否需要在内部修改，以及我们应该对我们的社交媒体合作伙伴有什么更多的期望，以消除平台上的仇恨、暴力和不恰当的内容。我们将让他们知道，我们希望他们有更大的责任感、行动和透明度。“。\n今天早些时候，联合利华加入了Verizon的行列，成为参与抵制活动的两家最大的公司，在可口可乐介入之前，Facebook首席执行官马克·扎克伯格也宣布了一系列政策变化，虽然没有明确回应抵制活动，但似乎是为了试图解决该公司最近面临的许多批评，这些批评包括缺乏节制的暴力威胁、仇恨言论，以及唐纳德·特朗普总统发布的错误信息和其他有争议的账户和页面。\n“这延续了包括联合利华(Unilever)和威瑞森(Verizon)在内的大品牌承诺至少在7月份暂停Facebook广告的显著趋势，”抵制活动的组织者之一、进步非营利性组织“改变的颜色”(Color Of Change)在一份声明中写道。自从Color of Change及其合作伙伴，包括ADL和NAACP于6月17日发起这项活动以来，已有100多个品牌签署了这项活动。“。Change of Change总裁拉沙德·罗宾逊(Rashad Robinson)周五表示，巧克力品牌好时(Hershey‘s)也将加入抵制行动。\n还有一条--@Hersheys加入了#StopHateForProfit的行列。@Facebook可以实施民权基础设施，也可以牺牲他们的底线。https://t.co/KmUAKstnSl。\n-Rashad Robinson(@rashadrobinson)2020年6月26日\n然而，尽管抵制活动可能会给Facebook和Instagram带来一波负面新闻，但即使是主要广告商暂停广告支出一个月也不太可能对Facebook的利润产生实质性影响，因为该公司的大部分广告收入来自中小企业的直接回应广告。\n“我们每年投入数十亿美元来维护我们社区的安全，并不断与外部专家合作，审查和更新我们的政策，”Facebook的一位发言人今天早些时候在回应联合利华的声明时告诉NBC新闻。“我们知道我们还有更多的工作要做，我们将继续与民权组织、GARM和其他专家合作，开发更多的工具、技术和政策来继续这场斗争。”\nFacebook没有立即回复就可口可乐决定置评的请求。\n上周发起的停止仇恨牟利活动，从北脸(North Face)和巴塔哥尼亚(Patagonia)等流行的运动和户外生活方式品牌开始。在获得冰淇淋品牌本&杰瑞和电影发行商木兰花影业的支持后，它在美国主流企业中获得了推动力。在昨天发布的一封公开信中，ADL提供了更具体的细节，说明抵制活动试图改变Facebook的政策，以及它对温和的态度。\n“今天，我们要求所有企业与我们最根深蒂固的自由、平等和正义的美国价值观站在一起，不要在7月份在Facebook的服务上做广告，”本周早些时候在“洛杉矶时报”(Los Angeles Times)刊登的一则停止仇恨牟利运动的广告中写道。“让我们向Facebook发出一个强有力的信息：你的利润永远不值得宣扬仇恨、偏执、种族主义、反犹太主义和暴力。”", "note_en": "The Coca-Cola Company is pausing all digital advertising on social media platforms globally for at least 30 days starting July 1st, the soda giant announced on Friday evening.\n The move is part of a broader boycott of Facebook and Instagram organized by the Anti-Defamation League, the NAACP, and other organizations called the  “Stop Hate For Profit” campaign. Coca-Cola is going one step further than some of those companies and banning all ads globally on social media platforms, not just Facebook and Instagram. That would suggest the boycott will hit Twitter, YouTube, and other platforms as well.\n “We will let them know we expect greater accountability, action and transparency from them.”\n “Starting on July 1, The Coca-Cola Company will pause paid advertising on all social media platforms globally for at least 30 days,” reads a  statement from Coca-Cola Company CEO James Quincey posted to the brand’s website. “We will take this time to reassess our advertising standards and policies to determine whether revisions are needed internally, and what more we should expect of our social media partners to rid the platforms of hate, violence and inappropriate content. We will let them know we expect greater accountability, action and transparency from them.”\n Earlier today,  Unilever joined Verizon as the  two largest companies participating in the boycott prior to Coca-Cola’s involvement Facebook CEO Mark Zuckerberg also announced a series of policy changes that, while not explicitly in response to the boycott,  appear designed to try and address many of the criticisms the company has faced of late regarding its lack of moderation of violent threats, hate speech, and misinformation posted by President Donald Trump and other controversial accounts and pages.\n “This continues a significant trend of major brands — including Unilever and Verizon — committing to pause Facebook ads for at least the month of July,” reads a statement from progressive nonprofit Color of Change, one of the organizers of the boycott. “Since Color Of Change and its partners, including the ADL and NAACP, launched the campaign on June 17, over 100 brands have signed on.” Color of Change President Rashad Robinson said on Friday that chocolate brand Hershey’s is also joining the boycott.\n And another one -  @Hersheys is joining the push to  #StopHateForProfit.  @Facebook can either implement a civil rights infrastructure or sacrifice their bottom line.  https://t.co/KmUAKstnSl\n— Rashad Robinson (@rashadrobinson)  June 26, 2020\n Yet while the boycott may be creating a wave of bad press for Facebook and Instagram, it’s unlikely even major advertisers pausing ad spending for one month will have a substantial effect on Facebook’s bottom line, as a majority of the company’s ad revenue comes from direct-response ads from small and medium-sized businesses.\n “We invest billions of dollars each year to keep our community safe and continuously work with outside experts to review and update our policies,” a Facebook spokesperson told NBC News earlier today in response to Unilever’s announcement. “We know we have more work to do, and we’ll continue to work with civil rights groups, GARM, and other experts to develop even more tools, technology and policies to continue this fight.”\n  Facebook did not immediately respond to a request for comment regarding Coca-Cola’s decision.\n The Stop Hate For Profit campaign launched last week, starting with popular sports and outdoor lifestyle brands like The North Face and Patagonia. It has since gained steam with mainstream corporate America after picking up support from ice cream brand Ben &amp; Jerry’s and film distributor Magnolia Pictures. In an  open letter posted yesterday, the ADL provides more concrete details regarding the changes the boycott seeks to produce in Facebook’s policies and its approach to moderation.\n “Today, we are asking all businesses to stand in solidarity with our most deeply held American values of freedom, equality and justice and not advertise on Facebook’s services in July,” read an ad the Stop Hate For Profit campaign ran in the  Los Angeles Times earlier this week. “Let’s send Facebook a powerful message: Your profits will never be worth promoting hate, bigotry, racism, antisemitism and violence.”", "posttime": "2020-06-27 16:44:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网络平台,cola,facebook", "title": "可口可乐刚刚威胁网络平台要“除掉……。不恰当的内容“", "title_en": "Coca-Cola just threatened online platforms to “rid ... inappropriate content”", "transed": 1, "url": "https://www.theverge.com/2020/6/26/21305065/coca-cola-pause-ads-facebook-social-platforms-july-boycott", "via": "", "real_tags": ["网络平台", "cola", "facebook"]}, {"category": "", "categoryclass": "", "imagename": "739de31e2a020d0f2e88e26e19d71346.jpg", "infoid": 1008570, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英格兰、苏格兰和波兰的科学家说，DNA和RNA是支撑所有地球生物的两种主要现代遗传密码形式，在这里出现生命之前，它们可能在我们的星球上以严格的配对共存。研究人员利用一种基于氰化氢的化学系统来模拟地球早期历史的条件，制造了四个碱基，即遗传字母表的分子“字母”。这些碱基串在一起，形成基因序列，细胞可以将其翻译成蛋白质。但令人惊讶的是，研究小组发现，在他们的实验一贯制造的四个碱基中，有两个是在DNA中发现的形式，而另外两个是在RNA中发现的那种形式。\n这项研究发表在“自然”杂志上，由英国剑桥医学研究理事会分子生物学实验室的约翰·萨瑟兰(John Sutherland)和他的同事进行，进一步削弱了所谓的RNA世界假说。这一观点长期以来一直是生命起源研究中最突出的观点之一，它认为早在DNA和其他对生命重要的分子出现之前，RNA就已经形成了地球生物圈的基础。然而，到目前为止，几乎没有证据表明该想法的僵化版本所采用的RNA排斥系统或可能导致DNA的化学途径。“人们倾向于认为RNA是DNA的母体，”萨瑟兰说。“这(论文)表明他们是分子兄弟姐妹。”\n然而，其他没有参与这项研究的科学家质疑这条以氰化氢为基础的路线使用的条件是否可信。法国国家科学研究中心位于奥尔良的分子生物物理中心的外部生物学小组主任弗朗西丝·韦斯特尔(Frances Westall)指出，形成这些基地需要非常特殊的条件。混合物需要干燥并暴露在紫外线下-这两个障碍在陆地上最容易克服，在40亿多年前我们星球被海洋覆盖的早期，陆地上的陆地供不应求。“这些条件在早期的地球上肯定存在，”韦斯特尔说。“它们不会那么常见，因为没有那么多裸露的陆地。”尽管她补充说，这项研究“很聪明”，“并不是完全不可能的”，但她总结说，“关于生命和益生菌分子出现的地点，还有其他更好的假设。”\n自20世纪50年代初美国研究人员斯坦利·米勒(Stanley Miller)和哈罗德·尤里(Harold Urey)进行了一项里程碑式的实验以来，关于合理性的争论一直困扰着这项以化学为基础的探索，以了解地球上生命的起源。这两个人通过在装有氢、水、氨和甲烷的烧瓶中触发放电，模拟了早期地球大气和海洋中闪电的影响。尽管他们的实验产生了对生物化学至关重要的相当大的有机分子，但几十年来，其他研究人员一直在争论其条件的似是而非。然而，米勒和尤里的工作表明，制造重要物质相对简单，比如连接在一起形成蛋白质的氨基酸，这些蛋白质在活细胞内执行多种功能。与生命起源研究特别相关的是，蛋白质可以充当催化剂，增强和加速其他化学反应，否则这些化学反应可能会太慢或太低而不可能发生。但蛋白质并不是地球上生命兴起背后唯一可能的催化剂。\n在最终获得1989年诺贝尔化学奖的工作中，分子生物学家西德尼·奥尔特曼(Sidney Altman)和生物化学家托马斯·切赫(Thomas Cech)发现，RNA-长期以来一直被认为只是遗传信息的中间载体，仅次于DNA-也可以起到催化剂的作用。RNA世界假说表明，这些分子可以自我复制，使DNA和蛋白质出现之前的早期进化成为可能。然而，萨瑟兰说，这个想法“是对一项辉煌发现的过度热情、过度热情的回应”。\n这种反应可能部分是因为，对于一个天真的化学家来说，从RNA跳到DNA看起来很容易。为了创造我们经常看到的缠绕成DNA标志性双螺旋的长链，碱基首先连接到糖分子的“主干”上。这些组合组成了核苷：DNA中的脱氧核糖核苷酸和RNA中的核糖核苷-与它的DNA表亲不同，RNA形成一个单一的螺旋。核苷不使用食糖或蔗糖，而是RNA中的核糖和DNA中的脱氧核糖(不同的糖赋予每种物质第一个字母)。这两种糖之间的区别很小：只有一个氧原子和一个氢原子。然而，这种差异足以让DNA和RNA具有不同的生物学作用。生物化学去除原子远比简单地擦除笔记本上代表它们的字母要难得多。\nRNA世界想法的另一个缺陷是，在可能存在于地球早期的条件下制造核糖，然后将其连接到碱基上是困难的。因此萨瑟兰和他的同事们寻求\n萨瑟兰说，这种安排“表明制造RNA和DNA的化学成分并不像人们想象的那样不同”。“人们倾向于认为RNA出现在DNA之前，然后以某种方式被接管。对我来说，这表明你有可能拥有RNA-DNA杂交体，然后可能产生两个不同的分子。“。然而，萨瑟兰的团队尚未将单个核苷和核糖核苷组装成更长的链。这样做很重要，因为证明杂交链可以真正形成并结合到伙伴链上，这对于推动这个想法超越猜测是至关重要的。\n对于没有参与这项研究的佐治亚理工学院生命起源研究员尼古拉斯·胡德(Nicholas Hud)来说，这是一个关键问题。他称这是一本关于水基核苷合成的“极好的有机化学研究汇编”。但胡德并不相信这篇论文解决了这些核苷是否真的出现在生物之前。他自己的研究表明，在RNA之前，氨基酸可能已经连接起来携带信息并充当催化剂。HUD认为，进化将在很长一段地质时间内逐渐产生目前的遗传系统。他说：“如果一个分子从化学的角度看起来很难制造，但它在生物学中的功能却很精致，那么它很可能是随着时间的推移而进化出来的。”出于同样的原因，他也对RNA世界假说持怀疑态度。\n此外，胡德认为这项新研究依赖于严格的增量步骤，每个步骤都是在严格的顺序和严格控制的条件下进行的，这是一个重大的弱点。胡德说，如果步骤的顺序改变了，或者某些产品没有被分离出来，萨瑟兰和他的同事们就会少制造他们感兴趣的物质。这一警告降低了在早期地球混乱的环境中发生这种情况的可能性。\n萨瑟兰承认，如果没有时光机让我们回到地球上生命的真正起源，在这个稀有的研究领域，“似是而非就是一切”。即便如此，他还是坚定地支持他的团队在建立通往生命基石的化学路线方面所做的工作。萨瑟兰断言：“有很多很多的手指指向氰化氢。”“这能证明这一切都是氰化氢造成的吗？这并不能证明这一点。但对我来说已经足够好了。“", "note_en": "DNA and RNA, the two major modern forms of genetic code underpinning all of earthly biology, could have coexisted in strict pairings on our planet before life arose here, scientists in England, Scotland and Poland say. Using a hydrogen cyanide–based chemical system intended to mimic conditions in Earth’s early history, the researchers made four bases, the molecular “letters” of the genetic alphabet. Strung together, these bases form gene sequences that cells translate into proteins. But surprisingly, the team found that of the four bases their experiments consistently made, two were in a form found in DNA, whereas the other two were of a kind seen in RNA.\n  The study, published in  Nature and  conducted by John Sutherland of the Medical Research Council Laboratory of Molecular Biology in Cambridge, England, and his colleagues, further undermines the so-called RNA world hypothesis. This idea, long one of the most prominent in origins-of-life research, posits that RNA formed the basis of Earth’s biosphere long before DNA and other molecules important to life  emerged. Yet to date, scant evidence has been found of chemical pathways to make the RNA-exclusive system that rigid versions of the idea adopt or that could lead to DNA. “People have tended to think of RNA as the parent of DNA,” Sutherland says. “This [paper] suggests that they are molecular siblings.”\n  Other scientists who were not involved with the study question the plausibility of the conditions used in this hydrogen cyanide-based route, however. Frances Westall, director of the exobiology group at the French National Center for Scientific Research’s Center for Molecular Biophysics in Orléans,  notes that forming the bases requires very specific conditions. Mixtures would need to dry out and be exposed to ultraviolet light—two hurdles most easily surmounted on dry land, which was in short supply during our planet’s ocean-covered early days more than four billion years ago. “These conditions certainly existed on the early Earth,” Westall says. “They would not have been that common because there was not that much exposed landmass.” Although she adds that the study is “clever” and “not completely impossible,” she concludes that “there are other, better hypotheses as to locations for the emergence of life and prebiotic molecules.”\n  Arguments about plausibility have plagued the chemistry-based quest to understand life’s beginnings on Earth since the early 1950s, when American researchers Stanley Miller and Harold Urey performed a landmark experiment. The pair simulated the effects of lightning in the early Earth’s atmosphere and ocean by triggering electrical discharges in flasks containing hydrogen, water, ammonia and methane. Although their experiment famously produced sizable organic molecules vital for biochemistry, for decades other researchers have debated the plausibility of its conditions. Nevertheless, Miller and Urey’s work showed that it was relatively simple to make important substances, such as the amino acids that link up to form proteins that perform myriad functions within living cells. Of particular relevance to origins-of-life studies, proteins can act as catalysts, enhancing and speeding up other chemical reactions that would otherwise be too slow or inefficient to plausibly occur. But proteins are not the only possible catalysts behind the rise of life on Earth.\n  In work that would ultimately net the 1989 Nobel Prize in Chemistry, molecular biologist Sidney Altman and biochemist Thomas Cech found that RNA—long considered merely an intermediate carrier of genetic information that is subservient to DNA—can also behave as a catalyst. The RNA world hypothesis suggests that such molecules could self-replicate, enabling early evolution before the existence of DNA and proteins. The idea, however, “was an overzealous, overenthusiastic response to a brilliant discovery,” Sutherland says.\n  That response might have come partly because, to a naive chemist, it looks easy to leap from RNA to DNA. To create the long chains we often see coiled up into the DNA’s iconic double helix, the bases are first connected to a “backbone” of sugar molecules. These combinations make up nucleosides: deoxyribonucleotides in DNA and ribonucleosides in RNA—which, unlike its DNA cousin, forms a single helix. The nucleosides do not use table sugar, or sucrose, but rather ribose in RNA and deoxyribose in DNA (the different sugars give each material its first initial). The distinction between the two sugar types is tiny: just one oxygen and one hydrogen atom. Yet that difference is enough for DNA and RNA to have distinct biological roles. And biochemically removing the atoms is far harder than simply erasing the letters representing them  in a notebook.\n  Another flaw in the RNA world idea has been the difficulty of making ribose in the conditions that probably existed on the early Earth—and to then connect it to a base. Sutherland and his colleagues therefore sought more likely ways to make ribose sugars and ribonucleosides. One of their most promising approaches relied on two gases thought to have been relatively abundant in the planet’s early atmosphere: hydrogen sulfide and hydrogen cyanide. When dissolved in water, bathed in ultraviolet light and subjected to cycles of drying, these simple compounds have produced many more complex molecules. They include amino acids and glycerol, the backbones of fatty molecules that can form cells’ outer wall.\n  Sutherland took this approach a step further last year. Working with Ramanarayanan Krishnamurthy’s team at the Scripps Research Institute in La Jolla, Calif., he and his colleagues showed that the ribonucleosides cytidine and uridine could be transformed into deoxyribose and the nucleoside and deoxyadenosine. Now—primarily via the efforts of team members Jianfeng Xu and Václav Chmela, both then at the  Laboratory of Molecular Biology—the researchers have made even more progress. They mixed some of the intermediate molecules from the team’s previous studies with salts such as sodium nitrite and magnesium chloride that could have been prevalent on the primordial Earth, then subjected them to acidic conditions and heat, respectively. Through these steps, the scientists found two possible routes to add a fourth base, the less common nucleoside inosine, to their preexisting collection. The addition was enough to make a four-letter genetic alphabet  in which each base in a strand would exclusively pair with one of the other three letters in a second strand  That base-pairing complementarity is how modern RNA and DNA works. But in the experiment, two letters came from RNA, and two came from DNA.\n  The arrangement “suggests that the chemistry to make RNA and DNA isn’t as different as people have thought,” Sutherland says. “People have tended to think of RNA coming before DNA and somehow then being taken over. This, to me, is suggesting that it’s possible that you could have had an RNA-DNA hybrid, which could then give rise to the two separate molecules.” Sutherland’s team has not yet assembled the individual nucleosides and ribonucleosides into longer chains, however. Doing so is important, because showing that hybrid strands can really form and bind to a partner strand is crucial for moving the idea beyond speculation.\n  This is a key issue for Nicholas Hud, an origins-of-life researcher at the Georgia Institute of Technology, who was not involved in the study. He calls it an “excellent compilation of organic chemistry research” on water-based nucleoside synthesis. But Hud is not convinced that the paper resolves whether these nucleosides actually arose before living creatures. His own research suggests amino acids could have linked up to carry information and act as a catalyst before RNA. Hud thinks evolution would then have gradually produced the current genetic system over long stretches of geologic time. “If a molecule looks very difficult, from a chemical perspective, to make, yet it functions exquisitely in biology, then it’s probably the case that it has been evolved over time,” he says. For the same reasons, he is also skeptical about the RNA world hypothesis.\n  Furthermore, Hud sees the new study’s reliance on rigid incremental steps, each performed in strict order and under carefully controlled conditions, as a significant weakness. If the order of the steps changed or certain products were not isolated, Sutherland and his colleagues would have made much less of the substances they are interested in, Hud says. That caveat reduces the chances of the scenario unfolding in the chaotic environs of the early Earth.\n  Sutherland admits that, absent a time machine to travel back to life’s true origins on our planet, “plausibility is everything” in this rarefied field of research. Even so, he firmly backs his team’s work on establishing chemical routes to life’s building blocks. “There are many, many fingers pointing at hydrogen cyanide,” Sutherland asserts. “Does it prove that it all happened from hydrogen cyanide? It doesn’t prove it. But it’s good enough for me.”", "posttime": "2020-06-27 16:23:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "可能,earth,dna", "title": "地球上的第一个基因可能是杂交种", "title_en": "The First Gene on Earth May Have Been a Hybrid", "transed": 1, "url": "https://www.scientificamerican.com/article/the-first-gene-on-earth-may-have-been-a-hybrid/", "via": "", "real_tags": ["可能", "earth", "dna"]}, {"category": "", "categoryclass": "", "imagename": "a0b6066d06e281252766d0e769c77f30.jpg", "infoid": 1008569, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周四，美国在全国范围内记录了近40,000例新的新冠肺炎病例-这是流感大流行期间最高的单日总数-许多州继续看到疾病传播的惊人上升。\n据“纽约时报”的新冠肺炎追踪报道，30个州的病例一直在增加。据华盛顿邮报报道，周五，11个州创下了过去七天内报告的平均新病例数量的自己的纪录。\n尽管病例数量的上升有时会反映出总体检测的上升，但许多州也看到阳性检测的比例很高，而且还在不断增加-即检测结果呈阳性的比例，这被认为是评估疾病传播是否真的在增加的一个更有用的衡量标准。如果各州增加检测，而新冠肺炎的传播保持不变或下降，检测结果呈阳性的比例将逐渐下降。\n在周五的新闻发布会上，副总统迈克·彭斯(Mike Pence)指出，现在有16个州的新病例每天都在增加，阳性检测率也在增加。\n目前，21个州和波多黎各的7天平均阳性率超过5%-世界卫生组织建议这个门槛来确定何时开始重新开放是安全的。受影响最严重的州包括亚利桑那州，阳性率为23%，德克萨斯州和佛罗里达州，阳性率约为13%。\n周五，佛罗里达州报告了创纪录的近9000例病例，而德克萨斯州周四报告了近6000例。这两个州都重新实施了封锁措施，包括限制酒吧和餐馆。随着住院率飙升，德克萨斯州的一些地区正在努力照顾新冠肺炎患者。\n尽管有严峻的数字和趋势，彭斯在周五的新闻发布会上采取了乐观的语气。作为一个国家，副总统说，“我们减缓了扩散，我们拉平了曲线，我们拯救了生命。”\n虽然他承认一些州正在与飙升的病例作斗争，但他强调了在检测能力、治疗和医护人员防护装备供应方面的改进。\n彭斯说：“当我们看到新的病例在上升，我们正在非常仔细地跟踪它们时，美国人民可能会有一种倾向，认为我们回到了两个月前的那个地方，我们正处于美国人民遭受巨大损失和巨大困难的时期。”“现实情况是，我们的处境要好得多。”\n彭斯还指出，虽然病例在增加，但死亡人数在减少。他指出，对重病患者的治疗和护理已经有所改善，许多新病例出现在35岁以下的人身上-他们患严重疾病和死亡的风险较低。\n但传染病专家表示，现在庆祝还为时过早，许多人预计未来几周死亡人数将会攀升。其中包括传染病专家安东尼·福奇博士，他是联邦冠状病毒工作组的成员。\n在周二的国会证词中，福奇回答了一个问题，即死亡人数的下降是否可以归因于这种疾病现在主要在更年轻、更健康的人中传播。\n他回答说：“我认为现在就把它联系起来还为时过早。”“死亡总是远远落后于病例。”他补充说，即使病例发生在可能没有感染这种疾病的年轻人身上，它们也可能会继续感染更多的脆弱人群，这些人可能会继续死于感染。\n到目前为止，美国已有240多万例新冠肺炎病例，近125,000人死亡。", "note_en": "The US logged nearly 40,000 new cases of COVID-19 nationwide Thursday—the highest daily total yet in the course of the pandemic—and many states continue to see an alarming rise in the spread of disease.\n Cases have been increasing in 30 states, according to the New York Times’ COVID-19 tracking effort. On Friday,  11 states set their own records for the average number of new cases reported in the past seven days, according to the Washington Post.\n Though the rising case counts can sometimes reflect a rise in overall testing, many states are also seeing high and increasing percentages of positive tests—that is, the fraction of test results that come back positive, which is considered a more useful metric for assessing if disease spread is actually increasing. If states increase testing while the spread of COVID-19 stays the same or declines, the fraction of tests coming back positive would gradually decline.\n In a press briefing Friday, Vice President Mike Pence noted that there are now 16 states that are seeing both a rising number of new cases each day and increasing rates of positive tests.\n Currently 21 states and Puerto Rico have a 7-day average  positive rate above 5 percent—a threshold that the World Health Organization has recommended to determine when it’s safe to begin reopening. The hardest hit states include Arizona, which has a 23 percent positive rate, and Texas and Florida, which have about a 13 percent positive rate.\n Florida reported a record of nearly 9,000 cases Friday while Texas reported nearly 6,000 on Thursday. Both states have reinstituted lockdown measures, including restrictions on bars and restaurants.  Some areas of Texas are struggling to care for COVID-19 patients as hospitalization rates surge.\n  Despite the grim figures and trends, Pence took an upbeat tone in the press conference Friday. As a country, the vice president said, “We slowed the spread, we flattened the curve, we saved lives.”\n Though he acknowledged that some states were struggling with skyrocketing cases, he highlighted improvements in testing capacity, treatments, and supplies of protective gear for healthcare workers.\n “As we see the new cases rising—and we’re tracking them very carefully—there may be a tendency among the American people to think that we are back to that place that we were two months ago, that we’re in a time of great losses and great hardship on the American people,” Pence said. “The reality is we’re in a much better place.”\n Pence also noted that though cases are increasing, deaths are decreasing. He noted that treatment and care have improved for severely ill patients and many new cases are seen in people under 35—who are at less risk of developing severe disease and dying.\n But infectious disease experts say it’s too early to celebrate and many expect the deaths will climb in the weeks to come. That includes infectious disease expert, Dr. Anthony Fauci, who is a member of the federal coronavirus task force.\n In Congressional testimony Tuesday, Fauci fielded a question about whether the decline in deaths could be attributed to the disease mainly spreading in younger, healthier people now.\n “ I think it’s too early to make that kind of link,” he replied. “Deaths always lag considerably behind cases.” He added that even if the cases are in younger people who may not suffer with the disease, they may go on to infect more vulnerable people, who may go on to die from the infection.\n So far, there have been  more than 2.4 million cases of COVID-19 in the US and nearly 125,000 deaths.", "posttime": "2020-06-27 16:22:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,肺炎,rise,病例", "title": "美国日志一天内记录4万例新冠肺炎病例，专家准备迎接死亡人数上升", "title_en": "US logs record 40K COVID-19 cases in a day as experts brace for rise in deaths", "transed": 1, "url": "https://arstechnica.com/science/2020/06/us-logs-record-40k-covid-19-cases-in-a-day-as-experts-brace-for-rise-in-deaths/", "via": "", "real_tags": ["美国", "肺炎", "rise", "病例"]}, {"category": "", "categoryclass": "", "imagename": "8a7316ea3ea72bc0c234e87de47be8ca.jpg", "infoid": 1008566, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "其中一家-一家成立两年、有13人的洛杉矶初创公司，名为Airvet-不出所料地认为自己是其中最好的，而且它已经说服了投资者同样多的东西。今天，该公司将宣布1400万美元的首轮融资，由Canvas Ventures牵头，E.Ventures、Burst Capital、Starting Line、TrueSight Ventures、Hawke Ventures和Branket Capital以及个人投资者参与。\n普通合伙人丽贝卡·林恩(Rebecca Lynn)表示，大流行对Canvas的决定起到了一定作用，一个聪明的模式也是如此。她说，在过去11年里，她研究过许多远程医疗初创公司，在为生活在自己小农场的动物使用这项服务后，她爱上了AirVet。另外，“COVID已经成为采用的巨大推动剂。”\n我们要求Airvet的创始人兼首席执行官布兰登·沃伯(Brandon Werber)单独向我们阐述公司的情况。\nBW：我爸爸是美国最知名的兽医之一--杰夫·沃伯博士。我们看到了远程医疗对人类世界的影响，并希望为我们的宠物带来同样的机会和水平的护理。自从我在宠物领域长大以来，我非常了解这一点，并认识到在提供护理方面存在许多效率低下的问题，以及兽医如何无法满足宠物主人不断变化的期望。\nBW：我们有两个应用程序。一种是供宠物主人下载以与兽医交谈，另一种是供兽医下载以组织工作流程和与客户交谈。我们不篡改任何现有的兽医关系。取而代之的是，我们与兽医诊所合作，使他们能够进行远程医疗访问，同时使宠物主人能够全天候接触兽医，即使他们不住在兽医医院附近。\n在美国，很大一部分宠物主人甚至没有初级兽医。对于像手术这样严重的健康问题，动物仍然需要亲自去，网络兽医甚至可以推荐它们。我们还看到Airvet被用作路边签到，宠物主人可以在那里通过停车场的直播视频聊天，并跟踪他们宠物的面对面兽医预约。\nTC：我知道每次参观最低收费是30美元。你如何让这种模式在经济上为退伍军人服务？\nBW：兽医们认为我们是他们基本收入之外的额外创收工具。我们不雇兽医。我们的2600多名退伍军人网络在很大程度上是在他们自己的医院内使用Airvet的退伍军人。他们可以像优步司机一样随意决定在线刷卡，成为点播网络的一部分，并接听全国任何地方宠物父母的电话，以创造额外的收入。\nBW：在我们之前出现的所有初创公司都不是消费者至上的，只专注于为兽医开发工具，所以他们的平台并不是每个宠物主人都能使用的。取而代之的是，它们只能由自己的兽医使用该特定平台的宠物主人使用，而这只是兽医的一小部分，因此也是宠物父母的一小部分。\nTC：你们有附属业务吗？除了这些兽医拜访之外，你们还卖别的什么吗？\nBW：目前，根据兽医和专业的不同，只有兽医就诊，最低30美元，最高30美元。随着时间的推移，我们已经有了扩展到其他宠物健康垂直市场的计划和合作伙伴关系。\n预计到2020年，仅在美国，就将在宠物身上花费990亿美元，而对我们来说，远程医疗只是个开始。\nBW：没有。我们提供了工作流层，使兽医能够安排虚拟预约，很快就可以与他们现有的系统和工作流完全集成。\nBW：没有时间限制，病例通常会开放整整三天，所以宠物父母可以继续通过聊天联系兽医，询问任何后续问题或担忧。\nBW：我们的目标是与医院并肩工作，而不是与它们竞争或取代它们。你不能虚拟采血，感觉不到肿瘤，也不能做牙科检查。人们总是需要去看兽医。\n我们想要做的是帮助(宠物主人)了解什么时候(进来)。宠物父母平均每年只去看兽医1.5次。在AirVET上，有很大一部分用户已经与兽医建立了6倍以上的联系，这样做可以节省时间和压力。\n这不是为了我们而竞争，而是在办公室访问期间(并帮助)使用过我们服务的宠物父母最终避免不必要的紧急访问。", "note_en": "One of these — a two-year-old, 13-person, LA-based startup called  Airvet — unsurprisingly thinks it is the best among the bunch, and it has persuaded investors of as much. Today, the company is announcing $14 million in Series A funding led by Canvas Ventures, with participation by e.ventures, Burst Capital, Starting Line, TrueSight Ventures, Hawke Ventures and Bracket Capital, as well as individual investors.\n The pandemic played a role in Canvas’s decision, as did a smart model, suggests general partner Rebecca Lynn, who says she has looked at many telemedicine startups over the last 11 years and that she fell for Airvet after using the service for the animals that live on her own small farm. Plus, “COVID has been a massive accelerant to adoption.”\n  We asked Airvet’s founder and CEO, Brandon Werber, to make the company’s case to us separately.\n  BW: My dad is one of the most well-known vets in the U.S. — celebrity vet Dr. Jeff Werber. We saw the impact that telehealth was making in the human world and wanted to bring the same access and level of care we get for ourselves to our pets. Since I grew up in the pet space, I know it intimately and recognized a lot of inefficiencies in the delivery of care and how vets have been unable to meet the evolving expectations of pet owners.\n  BW: We have two apps. One is for pet-owners to download to talk with a vet, and one is for vets to download to organize workflows and talk to their clients. We do not usurp any existing vet relationships. Instead, we partner with vet clinics and enable them to conduct telehealth visits and simultaneously enable pet-owners to have access to vets 24/7, even if they don’t live nearby a vet hospital.\n A huge portion of pet owners in the U.S. don’t even have a primary vet. For serious health issues like surgery, animals still need to go in-person, and network vets can even refer them. We’ve also seen Airvet used as curbside check-in, where pet-owners can chat and follow their pet’s in-person vet appointment via live video from the parking lot.\n TC: I see there is a minimum charge of $30 per visit. How do you make this model work financially for vets?\n BW: Vets view us as an additional revenue-generating tool on top of their base income. We don’t hire vets. Our network of 2,600+ vets are largely the same vets who use Airvet within their own hospital. They can decide at will, like an Uber driver, to swipe online to be part of the on-demand network and take calls from pet parents anywhere in the country to generate additional income.\n  BW: All the startups that came before us are not consumer-first and are just focused on building tools for vets, so their platforms cannot be used by every pet owner. Instead, they can only be used by pet owners whose own vets use that specific platform, which is a tiny fraction of vets and therefore a tiny fraction of pet parents.\n TC: Do you have ancillary businesses? Beyond these vet visits, are you selling anything else?\n BW: For now, just the vet visits, which range from a $30 minimum to higher, based on the vet and specialty. Over time, we have plans and partnerships lined up to expand into other pet health verticals.\n A projected $99 billion will be spent on pets in the U.S. alone in 2020, and for us, telemedicine is only the beginning.\n  BW: No. We provide the workflow layer enabling vets to schedule virtual appointments, which will soon be able to be fully integrated with their existing systems and workflows.\n  BW: There is no time limit and cases will usually stay open for three full days, so pet parents can continue to access the vet via chat for any follow-up questions or concerns.\n  BW: Our goal is to work alongside the hospitals, not to compete with them or replace them. You can’t take blood virtually or feel a tumor or do a dental. People always will need to go to the vet.\n What we want to do is help [pet owners] understand when [to come in]. The average pet parent only goes to the vet 1.5 times a year. A huge segment of users on Airvet have already connected with a vet six times more than that and save time and stress in doing so.\n It’s not about competing for us, it’s about being the provider of care in between office visits [and helping] pet parents who have used our service ultimately avoid an unnecessary emergency visit.", "posttime": "2020-06-27 16:21:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "医疗,telehealth,兽医", "title": "\n远程医疗兽医平台AirVET刚刚争取到了1400万美元的首轮融资", "title_en": "\n\t\t\t\tAirvet, a telehealth veterinary platform, just clawed its way to a $14 million Series A round\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/airvet-a-telehealth-veterinary-platform-just-clawed-its-way-to-a-14-million-series-a-round/", "via": "", "real_tags": ["医疗", "兽医"]}, {"category": "", "categoryclass": "", "imagename": "9a5d31d2a3b85fb1e30ad92a50f28932.jpg", "infoid": 1008565, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "昨日，Agora将1750万股票定价为每股20美元，高于每股16至18美元的目标区间。该公司在上市首日筹集了350美元，约为2020年第一季度营收的10倍，目前资本充足，鉴于其适度的现金消耗是一个持续的问题，该公司实际上已经永远走上了跑道。\n但是，尽管首次亮相取得了成功，但看到Agora的股价上涨得如此之快，并不是所有人都喜欢。比尔·格利(Bill Gurley)是一名风险资本家，经常批评传统的IPO过程，因此与这一特定策略有利害关系的人也加入了进来：\n非常令人惊讶的是，这个星球上有一个涉及数亿美元的财务演习，甚至可以不达到实际最终结果的50%。在这一点上，这一过程是如此受到操纵/破坏。他们错过的比最初的猜测还多。#market定价pic.twitter.com/MqmmYRum3ZM。\n让我来翻译一下。Gurley感到恼火--至少在某种程度上是正确的--因为Agora以每股45美元的价格开盘，该公司的首次公开募股(IPO)定价太高了。我们的意思是，该公司不应该以20美元的价格出售其IPO股票，而应该是以45美元的价格出售，这是市场迅速重新定价的价值。\n由于45美元是20美元的两倍多，它的银行家们“错过的比他们最初的猜测还要多。”考虑到该公司出售的股票数量，错误定价可能价值高达4.375亿美元！\n这一论点有其可取之处，但它并不像看起来那样完美无缺。与上市公司的首席执行官们聊天，他们会告诉你拥有稳定、稳定、长期的股权股东是多么重要。比方说，你可能会在路演中遇到这些人，然后投资于你的首次公开募股(IPO)股票。\n这些群体-科技人士声称非常喜欢的长期投资者-可能比交易员急于在最近的首次公开募股中找到上行空间的势头更有价格意识。也就是说，人们更有可能持有股票的时间更短。\n因此，如果你想要长期股东，你可能不得不将IPO的价格定在交易开始后市场最初可能承受的价格之下。\n尽管如此，见鬼的每股20美元还没有接近45美元。格利说得有道理。\n变革可能即将到来。Agora新闻又回到了纽约证券交易所(一家美国交易所)正在做的事情上。即试图想出一种让公司直接上市的方法(只需开始交易，不定价或筹集新资本)，并筹集资金。这消除了Gurley上面强调的问题。至少在理论上是这样。\n显然，如果这种模式成为可能，而且长期投资者愿意以略有不同的方式购买股票，那么对于伟大的公司来说，新方法将远远优于旧方法。什么样的公司在上市第一天就被烧毁的最多？我认为它是最有吸引力的，或者说被炒作的公司。\n那些将进行最具吸引力的IPO的公司将使用新的方法，留下-什么？让碎屑走老式的路吗？信号问题比比皆是！", "note_en": "Yesterday  Agora priced 17.5 million shares at $20 apiece, up from its target range of $16 to $18 per share. The firm raised $350 in its debut, or around 10 times its Q1 2020 revenue and is now amply capitalized and has runway for effectively forever, given its modest cash consumption as an ongoing concern.\n But while the debut was a success, seeing Agora’s share price rise as quickly as it did was not universally popular. Regular critic of the traditional IPO process  Bill Gurley — a venture capitalist, so someone with a stake in this particular gambit — weighed in:\n  Pretty amazing that there is a financial exercise on this planet involving hundreds of millions of dollars where its OK to not even get to 50% of the actual end result. The process is so rigged/broken at this point. They missed by more than the original guess.  #marketpricing  pic.twitter.com/MqmmYRw3ZM\n Let me translate. Gurley is irked — rightly, to at least some degree — that as Agora opened at $45 per share, the company’s IPO was awfully priced. By that we mean that the company  should have sold its IPO shares not at $20, but at $45, the value at which the market quickly repriced them.\n As $45 is more than twice $20, its bankers “missed by more than [their] original guess.” Given the number of shares the company sold, the mis-pricing could be worth up to $437.5 million!\n There’s merit to this argument, but it’s not as complete a slam dunk as it might appear. Chat with CEOs of public companies and they will tell you about how important it is to have steady, stable, long-term shareholders of their equity. Those you might, say, meet on a roadshow and get to invest in your IPO shares.\n Those groups — the long-term investors that tech folks claim to love so dearly — are likely a bit more price conscious than the momentum traders eager to find upside in recent debuts. That is, folks more likely to hold onto shares for a shorter period of time.\n So, if you want long-term shareholders, you may have to price you IPO under the price the market may initially bear once trading begins.\n   Still, holy  shit $20 per share is not close to $45. Gurley has a point.\n  Change may be coming. The Agora news rotates back to what the NYSE, an American exchange,  is doing. Namely trying to come up with a way to let companies direct list (to just start trading, sans pricing or raising new capital), and raise capital. This gets rid of the issues that Gurley highlighted above. At least in theory.\n Obviously, if that model becomes possible and long-term investors are willing to pay for shares in a slightly different manner, the new method will be far superior than the old  for companies that are great. What sort of companies get burned from first-day pops the most? I reckon it’s the most attractive, or hyped companies.\n The companies that would make the most attractive IPOs would use the new method, leaving — what? The detritus to go out the old-fashioned way? Signaling issues abound!", "posttime": "2020-06-27 16:20:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "agora,starts,可能", "title": "\nAgora上市之初股价上涨了一倍多，达到每股50美元。", "title_en": "\n\t\t\t\tAgora starts life as a public company by more than doubling to $50 a share\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/agora-starts-life-as-a-public-company-by-more-than-doubling-to-50-a-share/", "via": "", "real_tags": ["agora", "starts", "可能"]}, {"category": "", "categoryclass": "", "imagename": "9fd6286abe7526a3b5300e46203f7c88.jpg", "infoid": 1008564, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据Crunchbase的数据，上周全球有23轮融资，价值5000万美元。这几轮融资总额为37.2亿美元，中位数为8000万美元，平均规模为1.619亿美元。因此，如果你认为后期资金受到威胁，那就不是了。\n不难看出其中的原因；随着公开市场逼近历史新高，后期初创公司能够在强劲的竞争对手的支持下筹集资金。较高的公开估值有助于后期初创企业捍卫自己的价格，就像不断上涨的股票可以帮助风险投资引导风险投资到初创企业的早期阶段的某些行业一样。\n这也是一种可能导致大量IPO的情况，我们即将看到这种情况。随着Agora本周大获全胜，加上柠檬水(Lemonade)与Acolade、nCino和GoHealth并驾齐驱，一切都在升温。\n本周，交易所和TechCrunch试图更广泛地处理此事，询问有关Lemonade即将进行的公开募股的问题，尽最大努力研究nCino和GoHealth(两家IPO不是来自加州和纽约)的S-1文件，分析Acolade重新启动公开市场后提出的IPO估值，并努力摸索Agora相当稳健的IPO定价。\n但还有更多的事情在发生。在本周的Extra Crunch和TechCrunch节目中，我们还讨论了Lemonade首次公开募股(IPO)的定价(低于之前的估值)和好处(比我们预期的要好)，并讨论了我们很高兴看到未来几个季度和几年上市的众多公司。\n有理由预计，在IPO密度方面，未来会出现更多相同的情况。展望第三季度-现在只有几天了-一些风投预计会有一波软件IPO浪潮，因为许多独角兽公司试图在大选前上市，而估值却超级火爆。\n买方正在为SaaS铺开红地毯！如果第三季度SaaS IPO如潮水般涌现，我不会感到震惊。ZoomInfo是今年的第一次发行，而且只发生在6月份。疯狂地看到6个月的中断(https://t.co/Bg1I3WxgBa是在Zi之前的最后一次)很多被压抑的需求！\n你可以认为今天的公开市场是对去年应该上市、但推迟了的独角兽公司的重做。或者用赛车的术语来说，这是对犯了错误的汽车的免费进站。但是，如果你不出去的时候，得到的是这么好，你还在等什么该死的？这是一个价值数十亿美元的问题。\n让我们来了解一下本周最大的市场消息以及我们对此的感受。一如既往，我们将倾向于私募市场，但当上市科技公司对初创公司至关重要时，我们会谈论它们。\n本周晚些时候，在Snap、Facebook和Twitter交易结束后，社交公司受到了打击，宝洁、联合利华(Unilever)和Verizon*等主要广告商决定，他们实际上可能会关心他们的广告针对的是哪种内容。请记住，这种靠广告赚钱的做法并不新鲜；出版商与这种事情打交道已经有很长一段时间了。然而，随着时间的推移，社交科技公司并没有受到如此多的打击。欢迎来到现实世界，各位。对于初创企业？Facebook和Twitter受到非常公开的打击，这对社交初创公司来说并不是件好事。如果他们这些初创公司想要筹集新的资本，那就是。\nSaaS初创公司-无论是早期还是后期-应该振作起来，因为最近上市的SaaS收益相当不错。有一些失火，但情况本可以更糟。随着SaaS股价再次上涨，现在是成为一家SaaS公司的好时机。对它进行衡量，你可以找到十几家上市的SaaS公司，它们的价值超过了下一年销售额的25倍。这太疯狂了。\n我们正在跟踪的是2020年SaaS投资的速度。到目前为止，从2020年到2020年6月26日，Crunchbase已经为标记为SaaS的公司进行了648轮融资。再看去年同期，是一千一百三十五点。美元从去年同期的121.5亿美元下降到今年的93.6亿美元。现在，那里的风险数据确实滞后了，但尽管如此，这并不完全是我们预期的。也许中端SaaS初创公司正在苦苦挣扎？\nZoox与亚马逊的交易表明，私募市场的自动驾驶在多大程度上超越了现实，对初创企业进行了估值。自动驾驶工程师一度是劳动力市场的摇篮。现在，我们想知道。不过，10亿美元的交易对任何一家公司来说都不是世界末日。对于自动驾驶初创公司来说，这可能标志着该行业繁荣时期的结束，如果我们还没有跨过顶峰，开始长途跋涉走向最低点的话。\n网络安全仍然是炙手可热的热门话题，因为本周Salesforce向安全初创公司Tatil投入了大量资金。钛矿现在价值90亿美元。2019年IPO CrowdStrike作为一家上市公司一直表现优异，同时也让其行业看起来很乐观。其中一些善举可能在这里发挥作用。\n金融科技是个硬汉。优步似乎正在退出金融科技的努力。当然，每家公司迟早都会成为金融科技的公司，但显然不是这样的。CHINE等人，放心吧，优步从之前疯狂的金融科技之战中减速，表明并不是每一家大公司都能在这块特殊的消费者蛋糕上分得一杯羹。\n最后，优秀的凯特·克拉克谈到了初创公司的估值趋势：“根据研究公司PitchBook向The Information提供的数据，今年上半年，C系列或后期融资的估值中值从2019年的8,000万美元升至1.2亿美元的新高。”我们想，现在仍然是个好日子。\n在初创企业、资金和市场领域，有太多可以谈论的东西，但我们不得不到此为止。一旦我们把所有的管道连接起来，这份时事通讯将在每周五出版。所以，继续在这里订阅(100%免费)，这样你就正好错过了零个条目。快点聊吧！", "note_en": "In the last week there were 23 rounds worth $50 million in the world, according to  Crunchbase data. The rounds were worth a total of $3.72 billion, with a median value of $80 million and an average size of $161.9 million. So in case you were under the impression that late-stage money was under threat, it’s not.\n And it’s not hard to see why; with the public markets flirting with new record highs, late-stage startups are able to raise on the back of strong comps. High public valuations help late-stage startups defend their own prices as much as rising stocks can help direct venture investment to certain sectors at the earlier-stages of startup land.\n  It’s also a situation that  can lead to a rash of IPOs, which we’re on the cusp of seeing. With Agora out this week to good effect, and Lemonade in the wings alongside Accolade, nCino, and GoHealth, things are heating up.\n This week The Exchange and TechCrunch more broadly tried to take on the matter,  asking questions about Lemonade’s impending public offering, trying our best  to explore the S-1 filings of nCino and GoHealth (two IPOs  not from California or New York), parsing  Accolade’s proposed IPO valuation after it reignited its march to the public markets, and working to grok Agora’s pretty solid IPO pricing.\n But there was still more going on. Over on Extra Crunch and TechCrunch this week, we also chewed over Lemonade’s first whack at IPO pricing (down from its prior valuation) and what’s good about it (better than we’d expected), and  talked about the host of companies that we are excited about seeing go public over the next few quarters and years.\n  There are reasons to expect more of the same going forward in terms of IPO density. Looking into Q3 — now just days away — there are some VCs who anticipate a tide of software IPOs as many unicorns try to get public before the election, and while valuations are super hot.\n  Buy side is rolling out the red carpet for SaaS! Wouldn&#39;t shock me to see a flood of SaaS IPOs in Q3. Zoominfo was the first offering of the year and it only happened in June. Crazy to see a 6 month hiatus ( https://t.co/Bg1I3WxgBa was last before ZI) Lots of pent up demand!\n You can think of today’s public markets as a do-over for unicorns that should have gone public last year, but put it off. Or in racing terms, it’s a free pit stop for cars that made an error. But if you don’t get out while the getting is this good, what the hell were you waiting for? That’s the multi-billion-dollar question.\n  Let’s catch up on the week’s biggest market news and how we feel about it. As always, we’ll lean toward the private markets but talk about public tech companies when they matter to the startup world.\n Social companies took a hit late in the week after Snap, Facebook, and Twitter fell sharply was trading came to a close, after  major advertisers like P&amp;G, Unilever, and Verizon* decided that they might actually care what sort of content their ads are shown against. Bear in mind that this sort of ad-dollar yanking is  not new; publishers have dealt with this sort of thing for ages. However, social tech companies haven’t taken as many hits from this as they might have over time. Welcome to reality, y’all.  For startups? It’s not great for social startups that Facebook and Twitter are taking very public knocks. If they the startups wanted to raise new capital, that is.\n SaaS startups — early and late-stage alike — should take heart that the  recent spate of public SaaS earnings went pretty ok. There were some misfires, but it could have been worse. And with SaaS shares on the rise again, it’s a lovely time to be a SaaS company. Putting metrics on it, you can find over a dozen public SaaS companies that are worth more than 25x their next year’s sales. That’s insane.\n Something we’re tracking is the pace of SaaS investing in 2020. So far,  Crunchbase has 648 rounds for companies tagged as SaaS in 2020 through June 26, 2020. Looking at the same interval last year, it was 1,135. Dollars are down from $12.15 billion in the year-ago period, to $9.36 billion this year. Now, there  is venture data lag there, but, all the same, it’s not precisely what we expected to see. Perhaps middle-tier SaaS startups are struggling?\n The  Zoox deal with Amazon shows how far private-market self-driving rounds valued startups ahead of reality. At one point self-driving engineers were the unobtanium of the labor market. Now, we wonder.  Still, a $1 billion deal isn’t the end of the world for any company. For self-driving startups, it could mark the end of the good times in the sector, if we hadn’t already crossed the zenith and began a trudge towards its nadir.\n Cybersecurity is still hot hot hot, as this week  Salesforce poured capital into security startup Tanium.  Tanium is now worth $9 billion. 2019 IPO CrowdStrike has been outperforming as a public company, making its sector look rosy at the same time. Some of that beneficence could be at play here.\n Fintech is hard. Uber is  backing out of its fintech push, it appears. Sure, every company is going to be a fintech company of sorts in time, but not, apparently, like this. Chime et al, rest easy,  Uber’s downshift from its formerly frenetic fintech fight indicates that not every major company is going to be able to take a slice of this particular consumer pie.\n And, finally,  the excellent Kate Clark has notes on startup valuation trends: “ The median valuation for Series C or later-stage financings increased to a new high of $120 million in the first half of this year, from $80 million for 2019, according to data provided to The Information by research firm PitchBook.” It’s still good times, we suppose.\n There’s so much more to talk about in the worlds of startups, money and markets, but we have to stop here. This newsletter will come out every Friday once we get all the pipes linked up. So,  go ahead and subscribe here (it’s 100% free) so that you miss precisely zero entries. Chat soon!", "posttime": "2020-06-27 16:20:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,科技,ipo", "title": "\n交易所：首次公开募股季、自动驾驶失火和金融科技的失望", "title_en": "\n\t\t\t\tThe Exchange: IPO season, self-driving misfires and a fintech letdown\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/the-exchange-ipo-season-self-driving-misfires-and-a-fintech-letdown/", "via": "", "real_tags": ["交易", "科技", "ipo"]}, {"category": "", "categoryclass": "", "imagename": "56c30e539bcea85801f02cd3a9512684.jpg", "infoid": 1008562, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "重要的是，这些数据不包括游戏内广告收入(根据Unity的数据，在新冠肺炎停摆期间，游戏广告收入飙升了59%)和消费者之间交易的游戏数字资产市场。对于许多手机游戏公司来说，游戏内的广告是一个有意义的收入来源。根据eMarketer的数据，仅在美国，游戏内广告去年就为行业带来了约30亿美元的收入。\n音乐：2017年620亿美元(300亿美元唱片，60亿美元音乐出版，260亿美元现场音乐)。\n播客：2020年广告收入8.63亿美元(没有关于播客订阅和现场活动收入的良好数据，但可以公平地估计它只占总广告收入的一小部分)。\n在地球上78亿人中，有42亿人(53.6%)有互联网连接，今年将有26.9亿人玩视频游戏，Newzoo预测这一数字将在2023年达到30亿。它将目前游戏玩家的地理分布细分为：", "note_en": "Importantly, the data excludes in-game advertising revenue (which  surged +59% during COVID-19 lockdowns, according to Unity) and the market of gaming digital assets traded between consumers. Advertising within games is a meaningful source of revenue for many mobile gaming companies. In-game ads in just the U.S. drove roughly  $3 billion in industry revenue last year, according to eMarketer.\n  Music:  $62 billion in 2017 ($30 billion recorded music, $6 billion music publishing, $26 billion live music)\n  Podcasting:  $863 million 2020 advertising revenue (there is no good data on subscription and live events revenue in podcasting, but it is fair to estimate it at a fraction of the total ad revenue figure)\n  Of  7.8 billion people on the planet, 4.2 billion ( 53.6%) of whom have internet connectivity, 2.69 billion will play video games this year, and Newzoo predicts that number to reach three billion in 2023. It broke down the current geographic distribution of gamers as:", "posttime": "2020-06-27 16:19:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,游戏,games", "title": "\nNewzoo预测2020年全球游戏产业将达到1590亿美元", "title_en": "\n\t\t\t\tNewzoo forecasts 2020 global games industry will reach $159 billion\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/newzoo-forecasts-2020-global-games-industry-will-reach-159-billion/", "via": "", "real_tags": ["2020", "游戏", "games"]}, {"category": "", "categoryclass": "", "imagename": "ea067ff2db6ee6aee1e84e3322219b07.jpg", "infoid": 1008561, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "首席执行官兼联合创始人纳达夫·肖瓦尔(Nadav Shoval)告诉我，新名称反映的愿景比公司最初的产品-基于位置的消息服务-要宏伟得多，也更雄心勃勃。\n肖瓦尔说：“我们都觉得，现在是为我们实际做的事情感到自豪的时候了。”“这关系到拯救开放的网络。”\n具体地说，Shoval希望将更多的在线对话从Facebook等大型社交平台转移回独立出版商。为了说明这一点，他指出了最近关于重新审查或修改通信正当法第230条的讨论，这是对大型在线平台的关键法律保护。\n虽然你不必把唐纳德·特朗普(Donald Trump)总统对Twitter审查制度的抱怨当真，但肖瓦尔表示，关键是“任何一家大型科技公司都不应该控制对话。”\n为此，该公司还推出了其平台的升级版，包括对特定出版商的整体对话质量进行评分，通过允许用户赚取声誉积分来激励高质量的评论，甚至在评论似乎违反出版商的标准时要求用户重新考虑-openWeb将这些警告描述为“轻推”，因此如果你愿意，你仍然可以继续发布评论。\nOpenWeb产品高级副总裁伊多·戈德伯格(Ido Goldberg)说：“我们不再只专注于算法来识别不良行为，这是我们多年来一直在做的，已经成为商品。”“我们在这里做的是，我们花了很多时间来理解我们应该如何看待数百万次对话的质量和规模。”\n我们谈话和演示的一个重要主题是礼貌--例如，Goldberg向我展示了openWeb的轻推是如何说服一些用户采用不那么煽动性的语言的。但我认为，礼貌并不总是能带来高质量的对话。毕竟，种族主义(以及性别歧视、仇视同性恋和其他令人憎恶的)思想可以用表面上礼貌的语言表达出来。\n“对我们来说，礼貌是底线，”戈德伯格回答说。“当事情变得不文明时，那些想要(进行富有成效的对话)的人就不想去那里了。”\n肖瓦尔补充说，“高质量的对话没有灵丹妙药。”他辩称，openWeb正试图鼓励高质量的对话，而不是被视为“东海岸的左撇子在审查互联网”-它试图通过与每一家出版商合作，并意识到不同地区的不同标准来找到一种平衡。“我们想做的是一段永无止境的旅程。”", "note_en": "CEO and co-founder Nadav Shoval told me that the new name reflects a vision that’s far grander and more ambitious than the company’s initial product, a location-based messaging service.\n “We all felt that this is the time to be proud of what we actually do,” Shoval said. “It’s about saving the open web.”\n  Specifically, Shoval is hoping to move more online conversations away from the big social platforms like Facebook and back to independent publishers. To illustrate this, he pointed to  recent discussions about reexamining or revising Section 230 of the Communications Decency Act, a crucial legal protection for the big online platforms.\n While you don’t have to take  President Donald Trump’s complaints of Twitter censorship at face value, Shoval said the key is that “no one big tech company should control the conversation.”\n To that end, the company has also unveiled an upgraded version of its platform, which includes features like scoring the overall quality of conversation for a specific publisher, incentivizing quality comments by allowing users to earn reputation points and even asking users to reconsider their comment if it appears to violate a publisher’s standards —  OpenWeb   describes these warnings as “nudges,” so you can still go ahead and post that comment if you want.\n  “We stopped focusing only on algorithms to identify bad behavior, which we’ve done for years and have become commodity,” said Ido Goldberg,  OpenWeb’s   senior vice president of product. “What we did here is, we put a lot of time into understanding how we should look at quality and scale in millions of conversations.”\n A big theme in our conversation and demonstration was civility — for example, Goldberg showed me how OpenWeb’s nudges had convinced some users to adopt less incendiary language. But I argued that civility doesn’t always lead to quality conversations. After all, racist (and sexist and homophobic and otherwise hateful) ideas can be  expressed in ostensibly polite language.\n “For us, civility is the baseline,” Goldberg replied. “When things become incivil folks that want to [have a productive conversation] don’t want to be there.”\n Shoval added, “There is no silver bullet for quality conversations.” He argued that OpenWeb is trying to encourage quality conversations without being seen as “East Coast lefties who are censoring the internet” — a balance it tries to find by working with each of its publishers and being aware of different standards in different geographies. “What we want to do is a never-ending journey.”", "posttime": "2020-06-27 16:19:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "平台,platform,对话", "title": "\n评论平台Spot.IM成为OpenWeb", "title_en": "\n\t\t\t\tCommenting platform Spot.IM becomes OpenWeb\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/spot-im-openweb/", "via": "", "real_tags": ["平台", "platform", "对话"]}, {"category": "", "categoryclass": "", "imagename": "5e0a4c47096812912eded55efede5500.png", "infoid": 1008559, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这项和解协议结束了该公司与监管机构之间长达数月的法律战。2019年10月，SEC对Telegram提起诉讼，指控该公司通过出售29亿克筹集资金，为其业务提供资金。SEC试图禁止Telegram交付其出售的克，监管机构声称这些克是证券。今年3月，美国纽约南区地区法院同意SEC的观点，并发布了初步禁令。\n在结束这篇文章时，我想祝所有那些在世界上为权力下放、平衡和平等而奋斗的人好运。你打的是对的仗。这场战斗很可能是我们这一代人中最重要的一场战斗。我们希望你在我们失败的地方取得成功。\n在自己宣布的和解协议中，SEC与杜罗夫对其行动的评估不同。\nSEC执法部网络部门负责人克里斯蒂娜·利特曼(Kristina Littman)在一份声明中表示：“欢迎新的和创新的企业参与我们的资本市场，但它们不能违反联邦证券法的注册要求。”这项和解协议要求Telegram将资金返还给投资者，并施加重大处罚，并要求Telegram就未来的数字发行发出通知。“。\n监管机构的论点是Telegram没有遵守规则。SEC表示，如果它与监管机构合作，而不是在没有任何监督的情况下推出象征性发行，结果可能会有所不同。\n纽约地区办事处(New York Region Office)副地区主任拉拉·沙洛夫·梅拉班(Lara Shalov Mehraban)表示：“我们的紧急行动保护了散户投资者，使其免受Telegram试图在没有提供有关他们项目的全面披露的情况下，以未经注册的方式向市场出售证券的企图。”我们获得的补救措施大大减轻了投资者的负担，并保护散户投资者不受Telegram公司未来非法发售的影响。“", "note_en": "The settlement ends a months long legal battle between the company and the regulator. In October 2019 the SEC  filed a complaint against Telegram alleging the company had raised capital through the sale of 2.9 billion Grams to finance its business. The SEC sought to enjoin Telegram from delivering the Grams it sold, which the regulator alleged were securities. In March, the U.S. District Court for the Southern District of New York agreed with the SEC and issued a preliminary injunction.\n     I want to conclude this post by wishing luck to all those striving for decentralization, balance and equality in the world. You are fighting the right battle. This battle may well be the most important battle of our generation. We hope that you succeed where we have failed.\n In its own announcement of the settlement, the SEC differed with Durov’s assessment of its actions.\n “New and innovative businesses are welcome to participate in our capital markets but they cannot do so in violation of the registration requirements of the federal securities laws,” said Kristina Littman, chief of the SEC Enforcement Division’s Cyber Unit, in a statement. “This settlement requires Telegram to return funds to investors, imposes a significant penalty, and requires Telegram to give notice of future digital offerings.”\n The argument from the regulator is that Telegram didn’t follow the rules. Had it worked with the regulator instead of launching the token offering without any oversight, the outcome might have been different, according to the SEC.\n “Our emergency action protected retail investors from Telegram’s attempt to flood the markets with securities sold in an unregistered offering without providing full disclosures concerning their project,” said Lara Shalov Mehraban, associate regional director of the New York Regional Office. “The remedies we obtained provide significant relief to investors and protect retail investors from future illegal offerings by Telegram.”", "posttime": "2020-06-27 16:18:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "sec,pay,telegram", "title": "\nTelegram将向SEC支付1850万美元的罚款，并在解散Ton时向投资者返还12亿美元", "title_en": "\n\t\t\t\tTelegram to pay SEC fine of $18.5 million and return $1.2 billion to investors as it dissolves TON\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/telegram-to-pay-sec-fine-of-18-5-million-and-return-1-2-billion-to-investors-as-it-dissolves-ton/", "via": "", "real_tags": ["sec", "pay", "telegram"]}, {"category": "", "categoryclass": "", "imagename": "f47d28de4471475e1151d7c12a90157c.jpg", "infoid": 1008558, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ohanian早在2011年就推出了Initialized Capital，当时有一个700万美元的投资工具。从那时起，这家总部位于旧金山的公司发展迅速，并对Flexport、Insta、Cruise、Coinbase和Codecademy等公司进行了早期押注。最近，它在2018年关闭了一只2.25亿美元的投资工具，这是它迄今的第四只基金。\nOhanian在给TechCrunch的一份声明中表示，Ohanian将离开Initialized Capital，从事“一个新项目，该项目将支持科技界和其他领域的一代创始人”。根据Axios的报道，Ohanian将离开Initialized，以便在种子前的工作中更紧密地合作。在其网站上，初始化了细节，许多与其交谈的团队已经推出了产品，并有赚取收入的计划。\n该公司写道：“我们理解产品和商业模式的演变，但以非常具体的方式看到团队如何能够发货和合作是件好事。”如果奥哈尼安募集到一个预种子基金，看看他将如何改变这一方法将是一件有趣的事情。\n值得一提的是，风险投资领域的合伙人离职很少是明目张胆的分手。正如初始确认的那样，由于法律关系，Ohanian将继续参与公司现有的投资工具和投资组合公司。目前还不清楚奥哈尼安是否会继续留在他所在的任何董事会。Ohanian拥有董事会席位的Ro公司没有立即回复记者的置评请求。\n一个大问题是，奥哈尼安的离开是否会触发该公司有限合伙协议中的关键人物条款。“关键人”条款是有限合伙人协议中的典型条款，它要求某些指定的人(通常是公司的主要合伙人)必须继续受雇于公司，并成为活跃的投资者。当触发关键人条款时，有限合伙人通常有各种工具，从控制新招聘到彻底结束对基金的投资，以保护他们对基金的投资。\n在这种情况下，如果亚历克西斯·奥哈尼安(Alexis Ohanian)不是关键人物，那就太令人惊讶了，因为他是公司的主要普通合伙人之一，也是公司的创始人之一。\n奥哈尼安在2018年放弃了参与Reddit的日常工作，最近在抗议警察暴行后辞去了他在该公司的董事会席位。这位联合创始人敦促Reddit用一名黑人董事会成员填补这个席位。Reddit最终选择了Y Combinator首席执行官迈克尔·塞贝尔来填补这一职位。\n谭恩美是Initialized的另一位创始合伙人，他帮助YC在早期成长，并帮助建立了这家著名的加速器的内部软件系统和后期融资计划。该公司在给TechCrunch的一份声明中写道：“(谭恩美)将继续领导Initialized Capital走向未来，寻找并资助伟大的企业家，就像他近十年来所做的那样。”加里和亚历克西斯作为长期的朋友和商业伙伴保持着彼此的忠诚。公司全力支持亚历克西斯未来的追求。“\nInitialized Capital目前管理着5亿美元的资产，到目前为止已经投资了200多家公司。", "note_en": "Ohanian launched  Initialized Capital   back in 2011 with a $7 million investment vehicle. Since then, the San Francisco-based firm has grown immensely and made early-stage bets in companies like Flexport, Instacart, Cruise, Coinbase and Codecademy. Most recently, it closed a  $225 million investment vehicle in 2018, its fourth fund to date.\n Ohanian is leaving Initialized Capital to work on “a new project that will support a generation of founders in tech and beyond,” the firm said in a statement to TechCrunch. According to the  Axios story, Ohanian is leaving Initialized to work more closely on pre-seed efforts. On its website, Initialized details that many teams it talks to already have launched products and have a plan to earn revenue.\n  “We understand that products and business models evolve, but it’s good to see in a very concrete way how teams are able to ship products and work together,”  the firm wrote. If Ohanian raises a pre-seed fund, it will be interesting to see how he changes this methodology.\n  It’s worth mentioning that partner departures in venture capital are rarely crystal clear break-ups. As Initialized confirmed, Ohanian will remain involved in the firm’s existing investment vehicles and portfolio companies due to legal ties. It is unclear if Ohanian will remain on any board he is on.  Ro,   a company in which Ohanian has a board seat, did not immediately respond to a request for comment.\n One big question is whether Ohanian’s departure would trigger a key-man clause in the firm’s limited partnership agreement. “Key-man” clauses, which are typical in limited partner agreements, require that certain designated people (typically the main partners in a firm) must stay continuously employed at a firm and be active investors. When a key-man clause is triggered, limited partners often have a variety of tools, ranging from control over new hiring to outright ending the investing at a fund, in order to protect their investment in a fund.\n In this case, it would be surprising if  Alexis Ohanian   wasn’t a key man, as he is one of the leading general partners and a founder of the firm.\n Ohanian stepped away from being involved in the day to day of Reddit in 2018, and recently left his board seat at the company following protests against police brutality. The co-founder urged Reddit to fill the seat with a Black board member. Reddit ultimately selected  Y Combinator   CEO Michael Seibel to fill the position.\n Tan, the other founding partner of Initialized, helped YC grow in its early days and helped build the famed accelerator’s internal software system and late-stage funding program. “[Tan] will continue to lead Initialized Capital into the future, finding and funding great entrepreneurs as he has done for nearly a decade,” the firm wrote in a statement to TechCrunch. “Garry and Alexis remain committed to each other as long-standing friends and business partners. The firm fully supports Alexis in his future pursuits.”\n Initialized Capital currently has $500 million assets under management and has backed over 200 companies to date.", "posttime": "2020-06-27 16:18:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "西斯,ohanian", "title": "\n亚历克西斯·奥哈尼安将离开初始化的首都", "title_en": "\n\t\t\t\tAlexis Ohanian is leaving Initialized Capital\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/alexis-ohanian-reddit-co-founder-is-leaving-initialized-capital/", "via": "", "real_tags": ["西斯", "ohanian"]}, {"category": "", "categoryclass": "", "imagename": "f40c997d66ced4bb501d9b8a1fb42c1e.jpg", "infoid": 1008557, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国有线电视新闻网(CNN)众议院民主党人周五批准了一项法案，承认华盛顿特区为一个州，这标志着国会参众两院首次提出了华盛顿特区州地位的措施。\n这项法案是由华盛顿的无投票权的众议院议员德尔提出的。埃莉诺·霍姆斯·诺顿(Eleanor Holmes Norton)将把联邦首都缩小到一小块区域，包括白宫、国会大厦、最高法院和国家广场沿线的其他联邦建筑。这座城市的其余部分将成为第51个州，以废奴主义者弗雷德里克·道格拉斯(Frederick Douglas)的名字命名为华盛顿道格拉斯联邦(Washington，Douglas Federal)。\n该法案以232票对180票获得通过。明尼苏达州众议员科林·彼得森(Collin Peterson)是唯一与共和党人一起投票反对该法案的民主党人。密歇根州独立众议员贾斯汀·阿玛什(Justin Amash)也投了反对票。\n该法案将授予华盛顿两名参议员，并使现有的唯一众议院代表成为有投票权的成员。\n然而，这不太可能在共和党控制的参议院获得支持，白宫本周表示，如果该法案提交给唐纳德·特朗普(Donald Trump)总统，他将否决该法案。\n特朗普在上个月接受“纽约邮报”采访时表示，除非我们有一些非常、非常愚蠢的共和党人，否则华盛顿特区的州地位永远不会发生。\n特朗普在采访中说，华盛顿永远不会是一个州。你是说哥伦比亚特区，一个州？为什么？所以我们可以再有两名民主党参议员和五名国会议员？不用了谢谢。这永远不会发生。\n最近几周，民主党人辩称，在特朗普政府动员联邦执法部门回应有关警察系统种族主义的抗议活动后，建州的必要性从未像现在这样明确。他们对本月早些时候强行驱赶白宫外和平抗议者的决定表示愤怒，这是为了让特朗普在圣约翰教堂拍照。\n华盛顿市长穆里尔·鲍瑟(Muriel Bowser)周四表示，我们不仅没有有投票权的参议员，我们的女众议员也没有投票权，联邦政府的突发奇想甚至可以侵犯我们有限的自治权，而且它可以通过威胁美国各州和所有美国人民的方式做到这一点。让我们反击这样的呼声：我们太自由了，或者我们太黑人了，或者民主党人太多了。我们选谁是我们的事，美国的事是确保每个人在美利坚合众国的众议院和参议院都有充分的代表。\n华盛顿特区成为一个州的支持者还指出，该地区人口众多，超过了怀俄明州和佛蒙特州的人口。据美国人口普查局估计，截至2019年6月，华盛顿有超过70.5万居民。\n该法案的支持者认为，要成为法律，它只需国会参众两院以简单多数通过，然后由总统签署即可。他们说，这项立法调整首都地区大小的战略将绕过宪法关于将华盛顿其他地区变成一个州的问题。但反对华盛顿特区建州的共和党人坚持认为，将该地区添加为一个州将需要修改宪法。\n在众议院就该法案进行辩论期间，北卡罗来纳州共和党众议员格雷戈里·墨菲(Gregory Murphy)主张国会将土地割让回马里兰州，而不是让华盛顿成为自己的州。\n墨菲说，当把华盛顿特区割让回马里兰州是一个可行的、具有成本效益的常识选择时，这一举动根本没有必要。\n佐治亚州共和党众议员乔迪·海斯(Jody Hice)表示，华盛顿特区的建州与公众舆论和宪法背道而驰。\n他声称，这一切实际上都是为了试图再争取两名民主党参议员。\n众议院议长南希·佩洛西(Nancy Pelosi)在她的发言中予以回击：她表示，该地区的州地位关乎对我们民主的尊重。这不仅仅是关于这个地区。它关系到美国人民的民主和我们的美国宪法。", "note_en": "(CNN)House Democrats approved a bill to admit Washington, DC, as a state on Friday, marking the first time either chamber of Congress has advanced a DC statehood measure.\n The bill, introduced by DC&#39;s nonvoting House member, Del. Eleanor Holmes Norton, would shrink the federal capital to a small area encompassing the White House, Capitol building, Supreme Court, and other federal buildings along the National Mall. The rest of the city would become the 51st state, named the Washington, Douglass Commonwealth after abolitionist Frederick Douglass.\n The bill passed with a vote of 232-180. Rep. Collin Peterson of Minnesota was the only Democrat to join Republicans in voting against it. Independent Rep. Justin Amash of Michigan also voted no.\n   The bill would grant DC two senators and make the existing sole House representative a voting member.\n It is unlikely to gain traction in the Republican-held Senate, however, and the White House  said this week that President Donald Trump would veto the bill if it came to his desk.\n  Trump told the New York Post  in an interview last month that DC statehood will &#34;never happen unless we have some very, very stupid Republicans.&#34;\n &#34;DC will never be a state,&#34; Trump said in the interview. &#34;You mean District of Columbia, a state? Why? So we can have two more Democratic -- Democrat senators and five more congressmen? No thank you. That&#39;ll never happen.&#34;\n Democrats in recent weeks have argued the necessity for statehood has never been clearer, after the Trump administration mobilized federal law enforcement to respond to protests about systemic racism in policing. They expressed outrage with the decision to forcibly clear peaceful protesters from outside the White House earlier this month, which was done to allow Trump&#39;s  photo op at St. John&#39;s church.\n &#34;Not only do we not have voting senators and our congresswoman not have the right to vote, the whims of the federal government can encroach on our even limited autonomy, and it can do so in ways that are threats to all of the American states and all of the American people,&#34; Washington Mayor Muriel Bowser said Thursday. &#34;Let&#39;s fight back against the cries that we&#39;re too liberal or we&#39;re too black or there are too many Democrats. Who we elect is our business, and the business of America is to make sure that each person is represented fully in this House and in the Senate of the United States of America.&#34;\n Proponents of making DC a state also point to the area&#39;s large population, which surpasses the populations of Wyoming and Vermont. As of June 2019, DC had more than 705,000 residents, according to estimates from the US  Census Bureau.\n To become law, the bill&#39;s supporters argue it would only have to pass both chambers of Congress with a simple majority and then be signed by the President. They say the legislation&#39;s strategy of resizing the capital area would sidestep constitutional questions about making the rest of DC a state. But Republicans who oppose DC statehood maintain that adding the district as a state would require a constitutional amendment.\n During House floor debate on the bill, Republican Rep. Gregory Murphy of North Carolina argued for Congress to cede the land back to Maryland instead of making DC its own state.\n &#34;The move is simply unnecessary when ceding DC back to Maryland is a viable, cost-effective and common sense option,&#34; Murphy said.\n And Georgia Republican Rep. Jody Hice said DC statehood goes against public opinion and the Constitution.\n &#34;What this is really all about is an attempt to get two more Democratic senators,&#34; he claimed.\n   House Speaker Nancy Pelosi pushed back in her floor remarks: &#34;Statehood for the district is about showing respect for our democracy,&#34; she said. &#34;It&#39;s not just about the district. It&#39;s about democracy for the American people and for our US Constitution.&#34;", "posttime": "2020-06-27 16:17:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "民主党人,democrats,华盛顿", "title": "众议院民主党人通过华盛顿特区建州法案", "title_en": "House Democrats Pass DC Statehood Bill", "transed": 1, "url": "https://www.cnn.com/2020/06/26/politics/dc-statehood-vote-house/index.html", "via": "", "real_tags": ["民主党人", "democrats", "华盛顿"]}, {"category": "", "categoryclass": "", "imagename": "77a6c985df1f5c32d1f56bf832335513.jpeg", "infoid": 1008556, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Lyft已经与司法部就该公司歧视残疾客户的诉讼达成和解。现在，司机将被要求帮助客户折叠和存放轮椅和助行器。拼车公司还被勒令教育司机，并向投诉人支付费用，并处以4万美元的民事罚款。\n司法部的一份声明称，在一名使用可折叠轮椅的原告J.H.报告受到洛杉矶地区Lyft司机的歧视后，司法部开始了调查。J.H.在2015年至2017年期间向Lyft提出了12起投诉，原因是司机拒绝他搭车，称他们要么无法或不愿容纳他的轮椅。和解协议中列出的另外三名投诉人报告了类似的经历。\nLyft将向投诉人支付各种金额的损害赔偿金，其中包括向J.H.支付的3万美元。Lyft已被勒令修改其轮椅政策，规定“司机必须协助存放残疾人使用的可折叠或可折叠的移动设备，如轮椅、滑板车和助行器。”该公司将做出一些改变，以更好地教育司机有关轮椅政策的知识，比如每季度向司机发送有关该政策的提醒，并制作一段关于该政策的新教育视频。在接下来的三年里，Lyft将向司法部提交一年两次的书面报告，说明它为遵守“美国残疾人法案”所做的工作。\n拼车的可及性一直是一个持续关注的问题，也是许多法律斗争的主题。优步因未能容纳残疾乘客而多次被起诉。纽约公共利益律师会(New York Lawers For Public Interest)在2018年进行的一项研究发现，在70%的情况下，优步和Lyft未能在纽约市提供轮椅上可以到达的车辆。", "note_en": "Lyft has  settled with the Justice Department in a lawsuit alleging the company discriminated against customers with disabilities. Now, drivers will be required to help fold and stow wheelchairs and walkers for customers. The rideshare company has also been ordered to educate its drivers as well as pay complainants and a $40,000 civil penalty.\n The Justice Department began an investigation after a complainant identified as J.H. who uses a collapsible wheelchair reported discrimination from Los Angeles-area Lyft drivers, according to a Justice Department  statement. J.H. filed 12 complaints with Lyft between 2015 and 2017 after drivers refused him rides, saying they either could not or would not accommodate his wheelchair. Three other complainants listed in the settlement reported similar experiences.\n  Lyft will pay various amounts in damages to the complainants, including $30,000 to J.H. It’s been ordered to modify its wheelchair policy to specify that “drivers are required to assist with the stowing of foldable or collapsible mobility devices used by individuals with disabilities, such as wheelchairs, scooters, and walkers.” The company will make a few changes to better educate drivers on the wheelchair policy, like sending quarterly reminders of the policy to drivers and creating a new educational video about the policy. For the next three years, Lyft will give the Justice Department biannual written reports on what it’s doing to comply with the Americans with Disabilities Act.\n Accessibility of rideshares has been an ongoing concern and the subject of many legal battles. Uber has been  sued  multiple times for failing to accommodate passengers with disabilities. A 2018  study conducted by the New York Lawyers for Public Interest found that 70 percent of the time, Uber and Lyft failed to provide wheelchair accessible vehicles in New York City.", "posttime": "2020-06-27 16:17:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "司法部,settles,司机", "title": "Lyft与司法部就残疾诉讼达成和解", "title_en": "Lyft Settles With Justice Department Over Disability Lawsuit", "transed": 1, "url": "https://www.engadget.com/lyft-settles-justice-department-disability-lawsuit-172555790.html", "via": "", "real_tags": ["司法部", "settles", "司机"]}]