[{"category": "", "categoryclass": "", "imagename": "35cf687efbe7eeb2592c3e54f78c36b8.jpg", "infoid": 1005423, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "佛兰德斯一名65岁的老人说，他“失眠”，因为他已经收到近十年来从未订过的披萨，有时一天要吃好几次。\n在过去的九年里，他从未要求过的披萨已经送到了让·范兰德亨在安特卫普省特恩胡特的家中。“这一切始于九年前，”范兰德亨告诉Het Laatste Nieuws。“突然，一位披萨送货员递给我一大堆披萨。但我什么都没点，“他补充说。\n起初，他认为这只是送货地址上的一个简单错误，但他从未点过的披萨、烤肉串、皮塔饼和其他食物的订单源源不断地涌入。\n“它可以在工作日，也可以在周末，也可以在一天中的任何时候。[订单来自]特恩胡特的送货服务，但也来自周边地区。我甚至在凌晨2点接到了订单。“范·兰德亨说。\n“我再也睡不着了。每当我在街上听到滑板车的声音时，我就开始发抖。我担心下次还会有人来送热披萨。“。\n范兰德亨说，2019年1月的一天，十名不同的送货员出现在他的房子里，其中一人带着14个披萨。\n“我一直拒绝送货，所以我从来没有付过钱，”他说，并补充说，骚扰不仅让他恼火，对餐馆也是如此。\n“这花了他们的钱，他们不得不把食物扔掉。在10个快递出现的那天，我计算了一下：它花费了€450英镑，“范·兰德赫姆说。\n“我只从科鲁伊特或阿尔迪买冷冻披萨。我从来没有要求把它们送到我家，“他补充说。\n“我的一位住在赫伦图特的朋友正经历着和我完全一样的事情。她也收到了9年没订过的披萨了。“范·兰德亨说。\n“有时候我们两个都是在同一天收到的。当这种情况发生时，我们相互警告对方要期待送货，“他说，并补充说很可能是他们都认识的人。\n他说，他多次向警方报告了虚假送货的情况，但他仍然不知道骚扰他的人是谁。“我再也受不了了。当我发现是谁在过去九年里一直困扰着我时，这不会是他们最好的一天，“他说。", "note_en": "A 65-year-old man in Flanders says he is “losing sleep” because he has been receiving pizzas he never ordered for nearly a decade, sometimes several times a day.\n Over the past nine years, pizzas he never asked for have been delivered to Jean Van Landeghem’s home in Turnhout, in the Antwerp province. “It started nine years ago,” Van Landeghem told  Het Laatste Nieuws. “Suddenly, a pizza delivery man handed me a whole load of pizzas. But I hadn’t ordered anything,” he added.\n   At first, he thought it was a simple mistake in the delivery address, but orders of pizzas, kebabs, pittas and other food that he never ordered kept flowing in.\n “It can be on a weekday or during weekends, and at any time of day. [The orders come from] delivery services in Turnhout, but also from the surrounding area. I have even had orders delivered to me at 2:00 AM,” Van Landeghem said.\n “I cannot sleep anymore. I start shaking every time I hear a scooter on the street. I dread that someone will come to drop off hot pizzas yet another time,” he added.\n One day in January 2019, Van Landeghem said, ten different delivery men showed up at his house, one of which had 14 pizzas with him.\n   “I have always refused the deliveries, so I have never paid for anything,” he said, adding that the harassment is not only annoying for him, but also for restaurants.\n “It costs them money and they have to throw the food away. On the day that ten deliveries showed up, I did the math: it cost €450,” Van Landeghem said.\n “I only buy frozen pizzas from Colruyt or Aldi. I have never asked for them to be delivered to my house,” he added.\n “A friend of mine who lives in Herenthout is going through exactly the same thing as I am. She has been receiving pizza she has not ordered for nine years, too,” Van Landeghem said.\n   “Sometimes we both get them on the same day. When that happens, we warn each other to expect a delivery,” he said, adding that it is likely someone they both know.\n He reported the false deliveries to the police several times, he said, but he still has no idea who the person harassing him is. “I cannot take it anymore. When I find out whoever has been bothering me for the past nine years, it will not be their best day,” he said.", "posttime": "2020-06-06 18:17:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "比利时,man,送货", "title": "一名比利时男子多年来一直收到他从未订购过的披萨", "title_en": "Belgian man has been receiving pizzas he never ordered for years", "transed": 1, "url": "https://www.brusselstimes.com/all-news/belgium-all-news/114806/belgian-man-has-been-receiving-pizzas-he-never-ordered-for-years/", "via": "", "real_tags": ["比利时", "man", "送货"]}, {"category": "", "categoryclass": "", "imagename": "c33efa1719f6fe3b3c05c1ecc94254fc.jpeg", "infoid": 1005422, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GitHub是5000多万开发人员的家园，他们一起工作，共同托管和审查代码、管理项目和构建软件。\n报名。\ncingulata(发音为tchingulata&34；)是一个编译器工具链和RTE，用于通过完全同态加密技术在加密数据上运行C++程序。\ncingulata(发音为tchingulata&34；)是一个编译器工具链和RTE，用于通过完全同态加密技术在加密数据上运行C++程序。", "note_en": "GitHub is home to over 50 million developers working together to host and review code, manage projects, and build software together.\n  Sign up\n   Cingulata (pronounced &#34;tchingulata&#34;) is a compiler toolchain and RTE for running C++ programs over encrypted data by means of fully homomorphic encryption techniques.\n               Cingulata (pronounced &#34;tchingulata&#34;) is a compiler toolchain and RTE for running C++ programs over encrypted data by means of fully homomorphic encryption techniques.", "posttime": "2020-06-06 18:16:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,c++,加密,run,发音", "title": "cingulata：在具有完全同态加密的加密数据上运行C++代码", "title_en": "Cingulata: Run C++ code over encrypted data with fully homomorphic encryption", "transed": 1, "url": "https://github.com/CEA-LIST/Cingulata", "via": "", "real_tags": ["代码", "c++", "加密", "run", "发音"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005421, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我的朋友帕特昨天写了一篇题为“很多关于一点”的文章，在文章中他谈到了他目前是如何努力避免开始新事物的。他说，如果他专注于掌握几件事，他会更快乐，会有更多的成功。\n他还谈到大多数人有一件事是出名的，以及他是如何担心被困在特定的职业或努力中的。他举了以高尔夫闻名的老虎伍兹为例。老虎伍兹所做的一切都是关于高尔夫的。他打高尔夫球，设计高尔夫球场，写关于高尔夫的文章。\n我认为未言明的问题是：“如果泰格·伍兹失去了对高尔夫球的热爱怎么办？他还能继续因其他事情而出名吗？“。\n就我个人而言，我认为我们不必局限于一次努力。对我来说，最有趣的人是那些做一些新的、“出格的”的人，完全与他们以前做的事情无关。我喜欢读一些完全打破传统的人的故事。我喜欢想“哇，我没想到你会这么做”，这给他们增添了更多的深度。这让我不禁要问：“他们下一步会做什么？”\n就像皇后乐队的首席吉他手布莱恩·梅(Brian May)是如何成为一名天体物理学家的。这与他成名的原因完全不同，这让他变得独特而有趣。他不再是“另一个音乐家”了。\n还有更多的例子。如果我回到本世纪头十年，告诉某人乔·罗根每天都会有数百万人收听，他们可能会说“什么，UFC评论员？”，或者“什么，单口相声演员？”，甚至“什么，恐惧因素的家伙？”如果他停留在这些事情中的任何一件，他可能永远也找不到播客。但他没有，现在他有了这个星球上最成功的播客之一。他不愿意满足于只做一件事。\n当大多数人想到Pieter Level时，他们可能会想到世界旅行者自力更生的初创公司。如果你对他有更多的了解，你会发现他以前的职业生涯非常成功，创作电子音乐，导演音乐录像带，并经营自己的品牌。即使在他有了自己的创业项目后，他仍然尝试学习3D建模，并尝试虚拟现实的开发。在此之前，我敢肯定他也经营过一些技术评论网站。\n有些人可能只知道皮特的DJ名字(‘熊猫’)。那些人对他现在的所作所为一无所知。对他们来说，他的“事情”是他是一名DJ。所以，当那些人今天去找他，看看他从那以后都做了些什么，他们会感到震惊，想要更多地了解他。\n就个人而言，尽管他取得了所有成就，但我最喜欢的是他的写作；我绝对喜欢他的博客帖子，并定期重读。这里有几个我最喜欢的。对我来说，他是一个“思想家”和一个鼓舞人心的人。事实上，他涉足了这么多事情，这使他比只做过其中一件事情有趣得多，而且他探索这些事情的事实让他找到了自己擅长的东西。\n当我在我的大学学习智能代理模块时，我被介绍给了探索和开发的概念。探索是当你有目的地选择不采取你认为最有回报的行动，而是尝试一些新的东西来获得新的信息。利用就是利用你在探索中发现的最好的策略。\n在强化学习中，代理(即智能程序)在做正确的事情时会得到奖励(给分)，而在做对的事情时会受到惩罚(得到点数惩罚)。其想法是，代理人将学习要做的那种行动，以最大化回报。\n如果代理找到第一个有效的策略，然后一遍又一遍地做，他们可能会错过更优的策略，并得到更糟糕的总体结果。所以取而代之的是，代理遵循一段时间的探索，在那里它试图确定最优策略，然后一旦确定了最优策略，它就会通过重复遵循最优策略来利用它。如果环境可以改变，代理可能会偶尔尝试一些新的东西，看看是否有更好的选择。\n作为人类，尝试新事物是我们探索世界的方式。作为成年人，这通常意味着从事一项新的爱好或学习一项新的技能。也许我们可以去当地社区中心的品尝班，不管怎样。一旦我们进行了足够的探索，找到了我们喜欢和/或认为可以赚钱的东西，我们就会转向开发战略，并试图利用我们的知识和技能来赚钱/成名/提高我们的声誉/改善我们的健康。\n帕特还是个年轻人，所以我认为他不太可能已经探索了足够多的东西来真正知道他喜欢什么和不喜欢什么，也不太可能完全知道他擅长什么。事实上，我不确定任何人的寿命是否足够长。世界上有太多的事情需要我们去尝试，即使我们尝试了，我们也不知道我们在这些事情上的最终潜力。\n在帕特提到他想开始学习音乐制作。很多专业人士也把创作音乐作为业余爱好。艾登是一名开发人员，他制作自己的音乐。Cam是一名演讲者和倡导者，但在Twitch上扮演DJ的角色。\n如果你被吸引去做某事，我认为考虑去做是个好主意。如果你一遍又一遍地重复开始一件新的事情，而没有看透之前的项目(甚至放弃现有的项目！)，这是有很大区别的，但我不认为这里是这样的。我认为追求你感兴趣的东西是避免因一件“事”而出名的好方法。\n比如大卫·海内梅尔·汉森。在职业上，他是一名开发人员，他也写下了他从职业生涯中学到的东西。但他也根据自己的爱好和个人生活来定义自己。\n帕特今年一直在做的一件我最喜欢的事情就是尝试学习一项新技能，或者在一年中的每个月做一些不同的事情。这是当我达到金融稳定的水平时，我肯定会考虑做的事情，以允许这样做。\n一月份，帕特学会了烹饪，这是一个巨大的成功。然后，他决定想读更多的小说，虽然他承认自己至少失败了，但至少他现在知道这不适合他。3月份，他学习了设计和UI/UX，4月份，他想发起一个病毒式的项目。据我所知，帕特只推出了How to Say No，但他成功地让它像病毒一样传播开来，我看到了无数关于它的推文。做得好!。\n帕特在5月份似乎没有学到一项新技能，相反，他在这个月的大部分时间里休了一段时间的“思考周”，因为他处于恐惧之中。在他的思考周结束后，帕特现在说他正在努力避免做新的事情，这似乎与他在年初设定的目标背道而驰。\n我认为，从长远来看，压抑他从事新项目的愿望实际上可能会伤害到他。在“12个月，12项新技能”一书中，他说“这就是我的个性--我发现了一些新的东西，并对它着迷。”我真的很喜欢学习新事物。“。在我看来，通过试图压制这种倾向，他并没有真实地面对自己，这很可能会引起不满。\n在帕特的帖子里有很多问题；对生活剧本、他的身份和他的未来的恐惧。他不想把生命浪费在肤浅的探索上，但他似乎也害怕致力于一件具体的事情。如果我们老实说，我可能会说帕特似乎正在经历四分之一人生危机，特别是考虑到一个月前他还感觉不清楚和不确定。\n做真实的自己。不要仅仅因为你想让别人以某种方式看你，或者因为你看到别人以某种方式做某事，就去做某事。不要因为你的生活和你的同龄人不一样而感到困惑。\n一定要找到你可以奉献一生的东西，但要确保你不是一见钟情。确保你已经探索了所有的选择，并且对你所走的道路感到满意。\n并不是每件事都必须以盈利为目的。并不是每件事都要始终如一地去做。把几天时间浪费在永远见不到光的事情上，仅仅是为了从你的系统中释放出一种冲动，这是可以接受的。你甚至可以从这个过程中学到一些东西，可以应用到你的主要事业中。\n另外，我参加聚会迟到了，不过我最近有一个推特账号，你可以在这里关注。", "note_en": "My friend  Pat wrote an article yesterday titled ‘A lot about a little’, in which he talks about how he is currently trying to  avoid starting new things. He says that if he focuses on mastering just a few things, he would be happier, and have more success.\n He also talks about how most people have one thing that they are known for, and how he has apprehensions about being locked into a specific career or endeavour. He gives the example of Tiger Woods, who is known for golf. Everything Tiger Woods does is about Golf. He plays golf, designs golf courses, and writes about golf.\n I think the unstated question there is this: “What if Tiger Woods lost the love for golfing? Could he go on to be known for something else?”\n  Personally, I don’t think that we have to be constrained to just one endeavour. To me, the most interesting people are those who do something new and ‘out of left field’, completely unrelated to what they had been doing before. I love reading about someone who completely breaks the mould. I love thinking “Wow, I didn’t expect this from you”, and it adds a lot more depth to them. It makes me ask “What will they do next?”\n Like how Brian May, lead guitarist for Queen,  became an astrophysicist. That’s completely different from what he became famous for, and it makes him unique and interesting to talk about. He isn’t “just another musician” any more.\n There are more examples. If I time travelled back to the 2000s and told someone that Joe Rogan would be listened to by millions of people every day, they might say “What, the UFC Commentator?”, or “What, the stand-up comedian?”, or even “What, the fear factor guy?”. If he stopped at any one of those things, he might never have found podcasting. But he didn’t, and now he has one of the most successful podcasts on the planet. He wasn’t happy to settle for just one thing.\n When most people think about  Pieter Levels, they probably think about the world traveller bootstrapped startup guy. If you learn more about him, you will see that he previously had a very successful career  creating electronic music,  directing music videos, and  running his own label. Even after he had his start-up thing, he still tried out learning  3D modelling, and  experimenting with VR development. Before all that, I’m pretty sure he ran some tech review websites, too.\n Some people might only know Pieter by his DJ name (‘Panda’). Those people know nothing about what he’s doing now. For them, his “thing” was that he was a DJ. So when those people look him up today, and go to see what he has done since, they will be shocked and want to learn more about him.\n Personally, despite all of his achievements, my favourite thing that he has done is his writing; I absolutely love his  blog posts and regularly re-read them.  Here  are  a  few  of  my  favourites. For me, he’s a “thinker” and an inspiration. The fact that he has dabbled in so many things make him much more interesting than if he had done just one of those things, and the fact that he explored them allowed him to find things that he was good at.\n  Whilst studying the Intelligent Agents module at my university, I was introduced to the concepts of Exploration and Exploitation. Exploration is when you purposefully choose not to take the action that you think will be most rewarding, but to try something new to gain new information. Exploitation is when you take advantage of the best strategies that you have discovered through exploration.\n In Reinforcement Learning, agents (ie intelligent programs) are rewarded (given points) when they do something right, and punished (receive a point penalty) when they do something right. The idea is that the agent will learn the kind of action to do to maximize reward.\n If the agent finds the first strategy that works and then does it over and over again, they risk missing out on a more optimal strategy and get a worse outcome overall. So instead, the agent follows a period of exploration, where it tries to determine the optimal strategy, and then once the optimal strategy is identified, it exploits it by following the optimal strategy repeatedly. If the environment can change, the agent might occasionally try something new to see if a better option has come into existence.\n As humans, trying new things is our way of exploration of the world. As adults, that usually means taking up a new hobby or learning a new skill. Maybe we go to a taster class at the local community center, whatever. Once we’ve explored enough and found something that we enjoy and/or think we can make money from, we switch to an exploitation strategy and try to use our knowledge and skills to make money / become famous / improve our reputation / improve our health.\n Pat is still a young guy, so I’d argue that it is very unlikely that he has explored everything enough to really know for sure what he likes and dislikes, nor fully know what he’s good at. I’m not sure that any human life span is long enough for that, actually. There are just too many things in the world for us to try all of them, and even if we did, we don’t know our final potential at any of those things.\n  In Pat’s mentioned that he had wanted to start learning music production. A lot of professionals also create music as a hobby.  Aiden, is a developer and  makes his own music.  Cam is a speaker and advocate, but is playing with being a  DJ on Twitch.\n If you’re drawn to do something, I think it’s a good idea to consider doing it. There’s a big difference if you’re repeatedly starting a new thing over and over without seeing through the previous ones (or even abandoning established projects!), but I don’t think that’s the case here. I think that pursuing something you’re interested in is a good way to avoid being known for just one “thing”.\n Like with  David Heinemeier Hansson. Professionally, he’s a developer, and he writes about the things he learned from his career, too. But he also defines himself based on his hobbies and his personal life.\n One of my favourite things that Pat had been doing this year was  trying to learn a new skill or do something different for each month of the year. It’s something that I would certainly consider doing when I reach a level of financial stability to allow for it.\n In January, Pat learned  to cook, which was a great success. Then, he decided that he wanted to read more fiction books, and whilst  he admits he failed at, at least he now knows that it isn’t for him. In March he  learned about design and UI/UX, and in April he wanted to  launch a viral project(s). As far as I know, Pat only launched  How To Say No, but he succeeded in getting it to become viral and I saw endless tweets about it. Good job!\n  Pat didn’t seem to learn a new skill in May, but instead took a good chunk of the month off for a ‘ think week’ because he was in a funk. After his think week, Pat now says that he is trying to avoid doing new things, which seems counter to the goal he set at the start of the year.\n I think that suppressing his desire to work on new projects might actually hurt him in the long run. In “ 12 months, 12 new skills”, he says that “This is my personality - I find something new and get obsessed with it. I really enjoy learning about new things”. It seems to me that by trying to suppress this inclination, he isn’t being true to himself, which is likely to cause dissatisfaction.\n  There are a lot of issues wrapped up in Pat’s post; fears about the script of life, his identity, and his future. He doesn’t want to waste his life on shallowly exploring many things, but he’s also seems afraid of committing to a specific thing. If were being honest, I might say that Pat seems like he is going through a Quarter Life Crisis, especially given that he had been feeling  unclear and uncertain just a month earlier.\n  Be true to who you are inside. Don’t do something just because you want other people to see you in a certain way, or because you see others doing something a certain way. Don’t feel confused just because your life doesn’t look like your peers.\n By all means, find something that you can dedicate your life to, but make sure that you’re not just  falling into place. Make sure you’ve explored all of your options and that you’re happy with the path you’re taking.\n Not everything has to be for profit. Not everything has to be worked on consistently. It’s okay to waste a few days on something that will never see the light of day just to get an urge out of your system. You might even learn something from the process that you can apply to your main endeavour.\n P.S. I&#39;m late to the party, but I recently got  a twitter account that you can follow  here.", "posttime": "2020-06-06 17:43:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "事情,starting", "title": "开始做很多事情", "title_en": "Starting Many Things", "transed": 1, "url": "https://jetholt.com/micro/starting-many-things/", "via": "", "real_tags": ["事情", "starting"]}, {"category": "", "categoryclass": "", "imagename": "6ada99c343773d74345a012ccd388a5e.jpg", "infoid": 1005419, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这个周末和本周早些时候的几个晚上，我创建了一个相当简单的虚拟机，命名为“Sol”，取自瑞典语中“太阳”的意思。我读了很多关于VM设计的书，我对操作系统设计、编程语言和其他围绕计算机作为通用工具的概念的难懂和书呆子的东西很感兴趣。\n虚拟机(VM)是像物理机一样执行程序的机器(即计算机)的软件实现。-维基百科。\nSOL是在操作系统进程内部运行的进程虚拟机。但是，SOL内部有多个任务(就像大多数操作系统都有进程一样)，因此对于在SOL中运行的程序来说，外部世界是什么样子并不重要。我们甚至可以让Sol直接从硬件启动，但那将是疯狂的。请相信我。我以前也走过那条路。\n索尔的目的是学习。当我们定义我们的世界时，我们拥有极高的自由度。虚拟机的一个主要组件是提供的指令集。指令是程序可以执行的最简单的操作类型，因此虚拟机提供给在其中运行的程序的指令集需要是通用的和高效的。\n在SOLVM中有一个或多个调度器，每个调度器在一个CPU核心上运行(在撰写本文时尚未实现)。\n每个调度器维护要运行的任务列表。该列表称为运行队列。调度器还维护I/O监视器、计时器、处理操作系统中断等。调度器在SOL中完成大部分工作，因为它不仅执行我刚才描述的所有那些奇妙的事情，而且还执行程序代码。\n运行队列是按任务调度方式排序的任务列表。\n如果任务以“End”或“Error”状态结束，则任务将从运行队列…中删除\n如果有任何I/O监视器或计时器，请检查计时器是否超时，并可能调用主机操作系统内核来检查挂起的“异步”I/O事件。如果发生了事件(如计时器超时或触发)，则相关任务将添加到运行队列中，以便该任务可以读取它正在等待的事件。\n调度器重复该过程(例如，从点1开始)。只要运行队列中有任何任务。\n正如我们所看到的，任务主要是抽象的，并且只包含一个重要的组件：激活记录。它们包括任务的调用堆栈，并且每个激活记录对应于一个(活动的)函数调用。激活记录包含对它正在执行的函数原型的引用(稍后详细介绍)、程序计数器(通常称为PC)，它是当前执行的程序指令的游标，最后是值的注册表。\n函数原型是函数的常量和指令，但没有上下文(或“函数闭包”)和局部变量等。函数原型有点像没有任何人或家具的建筑。尽管名称如此，但它并不能真正与蓝图相提并论，因为功能原型不是复制或实现的，而是实际按原样使用的。\n程序计数器只是一个数字，它对应于函数原型程序中的偏移量(指令的有序列表)。当执行激活记录(我们可以将其视为一段运行代码)时，程序计数器(PC)随着每条指令的执行而递增。有时，当程序向后跳转(例如，执行循环时)时，PC会递减。PC在基于指令的程序中扮演着中心角色(就像您的计算机或手机的硬件，它现在很可能正在递增PC)。\n注册表本质上是执行程序可以用来存储变量数据的临时存储器区域。想象一下这个简单的函数：\ndef foo(x，y)：x=x*5 x=x*y返回x。\n在这里，程序需要一种方法来存储由x*5创建的值，然后它可以将该值传递给x*y，x*y也需要在使用返回之前将其结果值存储在某个地方。所有局部变量都存储在寄存器中，因此访问非常高效。执行“foo”函数(“R(X)”表示“寄存器x”)时会发生如下情况：\n自变量0和1已经在R(0)中，R(1)将常量&#34；5&34；加载到R(2)中，将结果放入R(0)乘以R(0)的值-与R(2)的值-，将结果放入R(0)乘以R(0)的值-，将结果放入R(0)返回R(0)。\nSOL是基于寄存器的虚拟机。操作数和结果是从编号寄存器读取和存储到编号寄存器的，而不是从堆栈“推入”和“弹出”的(与基于堆栈的虚拟机一样)。基于寄存器的虚拟机避免了通常围绕其他指令的推入和弹出操作，从而减少了代码大小，但在某些情况下也提高了执行速度(与基于堆栈的虚拟机相比)。\n在最优秀的论文“Lua 5.0的实现”Roberto中，Luiz和Waldemar描述了代码大小和解码开销的问题(不是真正的问题)：\n通常与基于寄存器的机器相关的问题有两个：代码大小和解码开销。寄存器机器中的指令需要指定其操作数，因此它通常比堆栈机器中的相应指令大。(例如，Lua的虚拟机中的指令大小为4字节，而几个典型的堆栈机器(包括Lua以前使用的机器)中的指令大小为1或2字节。)。另一方面，寄存器机器生成的操作码比堆栈机器少，因此总代码大小不会太大。\n0-3个操作数(例如“寄存器a和寄存器b，结果为寄存器c”)。\n因为虚拟机有…的缺点。虚拟，我们必须尽我们所能确保良好的性能，这样这些指令中的一条就可以放在一个机器字中。今天的大多数硬件都能够非常高效地处理32位长的数据块，因此受Lua5的启发，我选择了32位表示法来表示SOL的指令。\n每条指令及其操作数都以三种布局中的一种进行编码(看，棒极了的ASCII艺术！)。\n0 5|6 13|14 22|23 31 Bit-|-OP|A|B|C字段-|。-6 8 9 9位[0..63][0..255][0..511][0..511]范围\n有些操作只需要两个操作数，如果其中一个操作数足够大，则可以提高效率。为满足此需要，我们定义了指令的备用布局：\n0 5|6 13|14 31 Bit-|-|-OP|A|Bs/Bu字段-|。-6 8 18位[0..63][0..255]Bu：[0..255]范围Bu：[-131071..131072]。\n第三类操作仅使用一个大小与效率相关的操作数，因此我们定义了指令的第三个替换布局，其中三个操作数有效地折叠成一个26位整数值：\n0 5|6 31 Bit-|-OP|bss/buu Field-|。-6 26位[0..63]BUU：[0..67108863]范围bss：[-33554431..33554432]。\nA、B、C、Bu和Buu表示无符号整数，而B和Bss表示有符号整数。如上所述，这种配置有64个操作和256个寄存器(OP=6位，A=8位)的空间。超出我们的需要：)。\n在SOL中，更改和维护指令(操作+操作数)非常简单。我故意使出浑身解数，以使操作指导组变得容易。文件instr.h包含指令列表：\n/*控制流*/\\_(Year，ABC)/*暂停并重新计划*/\\_(JUMP，BSS)/*PC+=BSS*/\\_(Call，ABC)/*R(A)，.，R(A+C-1)：=R(A)(R(A+1)，.，R(A+B))*/\\_(RETURN，AB_)/*RETURN R(A)，.，R(A+B-1)*/\\/*DATA*/\\_(LOADK，ABU)/*R(A)=K(Bu)*/\\_(MOVE，AB_)/*R(A)=R(B)*/\\_(DBGREG，ABC)/*特殊：调试转储寄存器值*/\\/*算术*/\\_(ADD，ABC)/*R(A)=RK(B)+RK(C)*/\\_(SUB，ABC)/*R(A)=RK(B)-RK(C)*/\\_(MUL，ABC)/*R(A)=RK(B)*RK(C)*/\\.。\nSOL的源代码设置方式是，除了每条指令的实际实现之外，只需更改此列表即可。添加或重命名指令会自动使方便符号和功能可用。假设我们添加了一条Ding指令，它在每次执行时都会播放一点声音：\n_(MUL，ABC)/*R(A)=RK(B)*RK(C)*/\\_(DING，BUU)/*A=要播放的声音号码*/\\.。\n现在有了一个名为S_OP_Ding的新操作标识符，以及用于编码Ding指令的构造函数：\n现在运行包含Ding操作的程序将在VM中导致错误：“意外操作”。我们还没有实现丁行为！操作(在编写本文时)在sched_exec.h中实现，它是虚拟机的核心，因为它读取和执行SOL程序的指令。可以这样概括：\nvoid Execute(Instr*Instructions){Instr*PC=指令；而(1){Switch(*++PC){CASE S_OP_LOADK：//从指令*PC读取操作数A和B。//将B处的常量放入寄存器A。Break；案例S_OP_MOVE：//从指令*PC读取操作数A和B。//将寄存器B的值放入寄存器A。Break；.}//Switch}//While}。\n差不多是个不错的旧开关环路。当用CLANG或GCC这样的现代编译器编译这段C代码时，它将相当高效，因为我们的每个虚拟操作实际上只对应于几条机器指令。这就是我们需要添加丁丁的地方。\n..。案例S_OP_DING：//从指令*PC读取操作数BUU。uint32_t SOUND_INDEX=SInstrGetBuu(*PC)；//找到SOUND_INDEX的备注并播放SoundNote*NOTE=SoundGetNote(SOUND_INDEX)；SoundPlay(备注)；Break；.。\n这里的Sound类型以及SoundGet和SoundPlay表示您提供的某种声音播放函数。现在我们可以编写播放音乐的SOL程序：\n定义旋律0条目：丁0#播放音符0丁1#播放音符1丁1#播放音符1丁2#播放音符2丁0#播放音符0 RETURN 0 0#RETURN\n除非能够同时执行多个任务、同时执行多个任务，或者至少给程序员一种并发的错觉，否则任何玩具VM都不可能毫无羞耻地呈现出来。\nSOL有一个名为“Year”的操作，它能够暂停处于任何状态的任务，并在稍后使该任务在完全相同的状态下恢复。\n从任务的角度来看，它从不知道它被暂停和恢复。这是一个强大的原语，因为我们可以在此基础上实现许多功能。在编写本文时，SOL已经有两种不同类型的让步：让步于其他任务(以便它们可以从I/O等事件运行或调度)，以及让步于计时器超时。在本文的末尾有几个示例程序，它们都使用了Year。\n产出量用于实现协作多任务，其中所有任务协作使用处理资源。当一个任务执行了一系列计算并解除对另一个任务的控制时，会发生以下三种情况之一：\n该任务发起外部(“阻塞”)操作，如从文件中读取或等待特定时间发生，\n大多数与其环境和国外通信的系统，如网络服务器或文本编辑器，花费其大部分时间(相对于实时的CPU时间)等待环境响应；例如，在网络插座上产生数据、将内容写入文件或返回步进电机位置。这些系统通常受益于协作多任务处理，特别是连贯的专用系统(与本质上通用的操作系统不同)。\nSOL提供的本质上是用于并发的协程。协程程序(又名“绿色线程”，又名“用户线程”)的一个很好的特性是它们能够在并发系统中运行顺序代码。像这样的任务：\n涉及对环境的三个“阻塞”调用，这会导致任务产生：\n打开要求操作系统按名称打开文件。该文件可能会在将来的某个时候打开。调度程序注意到任务正在等待这种情况发生，暂时将其从运行队列中删除。\n操作系统告诉调度器“您想让我打开的那个文件，这是文件描述符”，因此调度器再次将任务放到运行队列中。\n任务再次调用环境，这一次请求读取f的内容。\n和以前一样，调度器告诉操作系统，记下笔记，取消对任务的调度，然后继续执行其他任务。\n操作系统告诉调度器“我已经读了您要我读的那个文件，这是数据”(实际上这稍微复杂一些，但原理是一样的)。\ndef read_file(name，callback)：open(name，def(error，f)：if(Error)：callback(Error)：false：read(f，def(read_error，data)：close(f，def(Error)：callback(error，data)#在打开文件之前返回此处。\n显然很难跟上。SOL中的任务可以派生新任务，以便同时执行几项任务，例如在通过网络回复时写入文件。\n定义WRITE_AND_REPLY(Destination_id，message)：Writer=write_file(Destination_id+&#34；.msg&#34；，message)send_message(Destination_id，message)while(recv(Writer)！=TaskEnd)noop#等待WRITE_FILE结束\n因为协作式多任务系统依赖于每个进程有规律地将时间让给系统上的其他进程，所以一个设计不佳的程序可能会独占所有的CPU时间，或者导致整个系统挂起。\n当程序执行一组非常长的计算时，可能会发生这种情况，并可能导致各种问题，特别是对于其他依赖计时器的任务。由于SOL调度程序仅在任务执行之间检查计时器过期，因此计时器可能会在其应该触发很长时间之后才有效地触发。想象一下，控制一个玩具四旋翼飞机，其中一个任务需要每50毫秒更新一个转子的角度，而另一个任务需要整整200毫秒，那么你的四旋翼飞机可能会崩溃和燃烧。\n为了解决这个问题，SOL采用了操作成本计数器。每次执行迭代(当调度器运行任务的程序时)，每个任务都被赋予预定数量的“操作值”。当操作成本计数器达到其极限时，该任务将被简单地强制让给其他任务。在源代码中，查找S_VM_EXEC_LIMIT。\n下面的代码是用简化的汇编语言表示的，它与C API几乎是1：1，用于以编程方式定义这些程序，因此除了解释执行的指令之外，汇编语言本身应该被认为是无关紧要的。\n在输出中，如下所示的行：[VM]_.。表示计划程序在运行任务且任务返回或放弃后重新获得控制的时间。这是一个“执行迭代”。当运行多个任务时，您通常会看到这些“执行迭代”标记行之间的任务以循环顺序交织在一起。\n在输出中，以“…”开头的行。是注释和/或简化，不是实际输出的一部分。\n在汇编注释中，R(X)表示“寄存器x”，Rk(X)表示“如果x小于k，则寄存器x为常量(x-k)”，其中k是特定值，K(X)表示“常量x”。\n在汇编注释中，PC表示“程序计数器”，它在某种程度上是指向程序指令的光标。每执行一条指令，它就加1。一些指令将进一步修改该计数器，例如跳转指令。\n当变量x大于0时，将x减1，并让位给调度程序，让其他任务运行。最终会回来。\ndef main()：x=5，而(x&gt；0)：x=x-1收益率。\n是否定义主0常量5#K(0)=5常量0#K(1)=0常量1#K(2)=1条目：LOADK 0 0#R(0)=K(0)LE 0 0 256#(0==RK(k+1)&lt；RK(0))？继续，否则PC++JUMP 3#PC+=3返回SUB 0 0 257#R(0)=R(0)-RK(k+1)收益率0 0 0#收益率A=TYPE=预定跳转-5#PC-=5到LE返回0 0#RETURN。\n$build/debug/bin/solSol 0.1.0 x64[VM]_[VM]任务函数PC操作值[VM]0x7fdf28c03c00 0x7fdf28c000e0 LOADK。0,257[VM]0x7fdf28c03c00 0x7fdf28c000e0 4产量abc：0，0，0[VM]_[VM]任务函数PC操作值[VM]0x7。256[VM]0x7fdf28c03c00 0x7fdf28c000e0 3子abc：0，0,257[VM]0x7fdf28c03c00 0x7fdf28c000e0 4产量abc：0，0，0[VM]_.与上述块相同的另外三个执行迭代.[VM]_。_[VM]任务函数PC操作值[VM]0x7fdf28c03c00 0x7fdf28c000e0 5 Jump bss：-5[VM]0x7fdf28c03c00 0x7fdf28c000e0 1 le abc：0，0，256[VM]0x7fdf28c03c00 0x7fdf28c000e0 2跳转bss：3[VM]0x7fdf28c03c00 0x7fdf28c000e0 6 Return AB：0，0计划程序运行循环退出。\n该程序使用两个函数。入口点是主函数，它只使用一个参数‘500’调用kitten函数。kitten函数在传递给它的毫秒数内“休眠”(作为第一个参数)。然后，kitten函数将数字“123”返回给调用者(主函数)，调用者转储寄存器值并最终返回，导致任务退出，随后调度程序和VM也退出。\n定义Kitten 1#参数：(r(0)=睡眠_ms)const 123#K(0)=123 Entry：Year 1 0#Year A=type=Timer，RK(B)=R(0)=arg0 LOADK 0 0#R(0)=K(0)=123 return 0 1#return R(0)..R(0)=R(0)=123定义主要0#参数：()const@kitten#K(0)=&lt；函数。const 500#K(1)=500条目：LOADK 0 0#R(0)=K(0)=小猫函数LOADK 1 1#R(1)=K(1)=500 CALL 0 1 1#R(0)..R(0)=R(0)(R(1)..R(1))=a(R(1))DBGREG 0 1 0#转储寄存器值的VM调试函数RETURN 0 0#RETURN。\n$time生成/调试/bin/solSol 0.1.0 x64[VM]_[VM]任务函数PC操作值[VM]0x7f8c9bc03bf0 0x7f8c9bc03910。1[VM]0x7f8c9bc03bf0 0x7f8c9bc000e0 1产量abc：1，0，计划在500.000000毫秒之后触发的0D计时器(调度.c：81)#.时间已过，在这种情况下调度程序正在空闲.D计时器已触发--调度任务(调度.c：57)[VM]_。_[VM]任务函数PC操作值[VM]0x7f8c9bc03bf0 0x7f8c9bc000e0 2 LOADK AB：0，0[VM]0x7f8c9bc03bf0 0x7f8c9bc000e0 3返回AB：0，1[VM]0x7f8c9bc03bf0 0x7f8c9bc03910 3 DBGREG[VM]R(0)=123.000000(sched_exec.h：214)D[VM]R(1)=500.000000(sched_exec.h：215)D[VM]R(0。\n$build/debug/bin/solSol 0.1.0 x64[sched 0x7fc219403930]运行队列：[任务0x7fc219403c00]-&gt；[任务0x7fc219403cd0]-&gt；[任务0x7fc219403da0][VM]_[VM]任务函数PC操作值[VM]0x7fc219403c00 0x7fc2194000e0 LOADK AB：0。257[VM]0x7fc219403c00 0x7fc2194000e0 4产量abc：0，0，0[VM]_\n..", "note_en": "During this weekend, together with a few evenings earlier this week, I created a rather simple  virtual machine dubbed  “Sol”, after the Swedish word for “sun”. I’ve read a lot about VM design and I’m into stuff like OS design, programming languages and other seeminlgy obscure and nerdy stuff surrounding the concept of a computer as a generic tool.\n A virtual machine (VM) is a software implementation of a machine (i.e. a computer) that executes programs like a physical machine. —  Wikipedia\n Sol is a process virtual machine that runs inside an operating system process. However, inside Sol there are multiple tasks (just like most operating systems have processes) and so for a program running in Sol it does not matter what the world looks like on the outside. We could even make Sol boot directly from hardware, but that would just be crazytown. Trust me. I’ve been down that road before.\n The purpose of Sol is learning. As we are defining our world, we have an extremely high degree of freedom. One major component of a virtual machine is the provided  instruction set. An  instruction is the simplest type of operation that a program can perform, and so the set of instructions provided by the virtual machine to programs running in it need to be universal and efficient.\n   In the Sol VM there are one or more  schedulers, each running on one CPU core (not yet implemented at the time of writing this).\n  Each  scheduler maintains a list of  tasks to be run. This list is called the  run queue. A scheduler also maintains I/O watchers, timers, handles OS interrupts, etc. The scheduler does most of the work in Sol as it not only does all those fancy things I just described, but it also executes program code.\n The  run queue is a list of tasks ordered in the way they are scheduled.\n If the task ended with an “end” or “error” status, the task is removed from the run queue…\n    If there are any I/O watchers or timers, check timers for expiry and possibly call the host OS kernel to check on pending “asynchronous” I/O events.  If an event has happened, like a timer expired or fired, the correlating task is added to the run queue so that the task can read the event it is waiting for.\n  The scheduler repeats this process (e.g. starting from point 1.) as long as there are any tasks in the run queue.\n   As we can see, a  task is mostly an abstraction and contains only one significant component:   Activation records. These comprise a task’s call stack and each  activation record corresponds to one (active) function call. An activation record contains a reference to the function prototype (more on this in just a second) it’s executing, a  program counter (usually called  PC) which is a cursor for the currently executing program instruction and finally a registry for values.\n A  function prototype is the constants and the instruction of a function, but without a context (or “function closure”) with local variables etc. A  function prototype is kind of like a building without any people or furniture. Albeit the name, it’s not really comparable to a blueprint as a  function prototype is not copied or implemented, but is actually used as-is.\n The  program counter is simply a number that corresponds to an offset into the function prototype’s program (ordered list of instructions). As an activation record (we can think about this as a piece of running code) is executed, the  program counter (PC) is incremented as each instruction is executed. Sometimes the PC is decremented, when a program jumps backwards (e.g. when performing a loop). The PC plays a central role in an instruction-based program (like your computer or phone’s hardware which is most likely incrementing a PC right now).\n The  registry is essentially a region of temporary memory that the executing program can use to store variable data. Imagine this simple function:\n def foo(x, y): x = x * 5 x = x * y return x\n Here the program needs a way to store the value created by  x * 5 that it can then pass to  x * y which also needs to store its resulting value somewhere before using it with  return. All local variables are stored in registers and thus access is very efficient. Something like this happens when executing the “foo” function (“R(x)” means “register x”):\n argument 0 and 1 are already in R(0) and R(1)load constant &#34;5&#34; into R(2)multiply value-of R(0) with value-of R(2), put the result in R(0)multiply value-of R(0) with value-of R(1), put the result in R(0)return R(0)\n Sol is a register-based virtual machine. Operands and results are read and stored from and to numbered registers, rather than “pushed” and “popped” to and from a stack (as with  stack-based virtual machines). Register-based virtual machines avoid the push and pop operations usually surrounding other instructions, reducing code size, but in several cases also increases speed of execution (compared to stack-based virtual machines).\n In the most excellent paper  “The Implementation of Lua 5.0” Roberto, Luiz and Waldemar describes the (not really a) problem with code size and decoding overhead:\n There are two problems usually associated with register-based machines: code size and decoding overhead. An instruction in a register machine needs to specify its operands, and so it is typically larger than a corresponding instruction in a stack machine. (For instance, the size of an instruction in Lua’s virtual machine is four bytes, while the size of an instruction in several typical stack machines, including the ones previously used by Lua, is one or two bytes.) On the other hand, register machines generate less opcodes than stack machines, so the total code size is not much larger.\n    0-3 operands (e.g. “register a and register b, results in register c”)\n As a virtual machine has the disadvantage of being …virtual, we must do whatever we can in terms of assuring good performance, so one of these instructions fit into one  machine word. Most hardware today is able to deal with 32-bit long chunks of data very efficiently, so inspired by  Lua 5 I chose a 32-bit representation for Sol’s instructions.\n Each instruction and its operands is encoded in one of three layouts (Behold, awesome ASCII art!.)\n  0 5 | 6 13 | 14 22 | 23 31 Bit------------|---------------|-----------------|----------------- OP | A | B | C Field------------|---------------|----------------------------------- 6 8 9 9 Bits [0..63] [0..255] [0..511] [0..511] Range\n Some operations only need two operands and can be made more efficient if one of those operands is large enough for common values. For this need we define an alternate layout of an instruction:\n  0 5 | 6 13 | 14 31 Bit------------|---------------|----------------------------------- OP | A | Bs/Bu Field------------|---------------|----------------------------------- 6 8 18 Bits [0..63] [0..255] Bu: [0..262143] Range Bu: [-131071..131072]\n A third class of operations only use one operand which size has a correlation with efficiency, so we define a third alternate layout of an instruction where the three operands are effectively collapsed into one 26-bit integer value:\n  0 5 | 6 31 Bit------------|--------------------------------------------------- OP | Bss/Buu Field------------|--------------------------------------------------- 6 26 Bits [0..63] Buu: [0..67108863] Range Bss: [-33554431..33554432]\n A, B, C, Bu and Buu signify unsigned integers whilst Bs and Bss signify signed integers. As we can read above, there’s room for 64 operations and 256 registers (OP=6 bits, A=8 bits) with this configuration. More than we need :)\n Changing and maintaining instructions (operations + operands) is simple in Sol. I’ve intentionally gone to great lengths in order to make playing around with the instuction set easy. The file  instr.h contains a list of instructions:\n /* Control flow */ \\ _(YIELD, ABC) /* suspend and reschedule */\\ _(JUMP, Bss) /* PC += Bss */\\ _(CALL, ABC) /* R(A), ... ,R(A+C-1) := R(A)(R(A+1), ... ,R(A+B)) */\\ _(RETURN, AB_) /* return R(A), ... ,R(A+B-1) */\\ /* Data */ \\ _(LOADK, ABu) /* R(A) = K(Bu) */\\ _(MOVE, AB_) /* R(A) = R(B) */\\ _(DBGREG, ABC) /* special: Debug dump register values */\\ /* Arithmetic */ \\ _(ADD, ABC) /* R(A) = RK(B) + RK(C) */\\ _(SUB, ABC) /* R(A) = RK(B) - RK(C) */\\ _(MUL, ABC) /* R(A) = RK(B) * RK(C) */\\ ...\n Sol’s source code is setup in such a way that changing this list is all that is required, apart from the actual implementation of each instruction. Adding or renaming an instruction automatically makes convenience symbols and functions available. Say that we add a  DING instruction which plays a little sound every time it’s executed:\n _(MUL, ABC) /* R(A) = RK(B) * RK(C) */\\ _(DING, Buu) /* A = sound number to play */\\ ...\n There’s now a new operation identifier available called  S_OP_DING as well as constructor function for encoding DING instructions:\n  Running a program now that includes a DING operation will cause an error in the VM: “unexpected operation”. We haven’t implemented the DING behavior yet! Operations are (at the time of writing this) implemented in  sched_exec.h which is the core of the virtual machine as this is what reads and performs the instructions of a Sol program. It can be summed up like this:\n void Execute(Instr* instructions) { Instr* pc = instructions; while (1) { switch (*++pc) { case S_OP_LOADK: // Read operands A and B from instruction *pc. // Put constant at B into register A. break; case S_OP_MOVE: // Read operands A and B from instruction *pc. // Put value of register B in register A. break; ... } // switch } // while}\n Pretty much a good old switch loop. When this C code is compiled with a modern compiler like Clang or GCC, it will be rather efficient as each of our virtual operations effectively corresponds to only a few machine instructions. This is where we need to add DING.\n ... case S_OP_DING: // Read operand Buu from instruction *pc. uint32_t sound_index = SInstrGetBuu(*pc); // Find note for sound_index and play it SoundNote* note = SoundGetNote(sound_index); SoundPlay(note); break; ...\n Here the type  Sound as well as  SoundGet and  SoundPlay represents some kind of sound playing function that you provide. Now we can write Sol programs that play music:\n define melody 0 entry: DING 0 # play note 0 DING 1 # play note 1 DING 1 # play note 1 DING 2 # play note 2 DING 0 # play note 0 RETURN 0 0 # return\n   No toy VM can be presented without shame unless it’s able to  multitask; perform multiple things at once, or at least give the programmer the illusion of concurrency.\n Sol has an operation called “yield” which is able to pause a task in any state and later have that task resume at the exact same state.\n  From the task’s perspective it never knew it was paused and resumed. This is a powerful primitive as we can implement many features on top of this. At the time of writing, Sol already has two different types of  yield: Yielding for other tasks (so they can run or be scheduled from I/O etc events), and yielding for a timer to expire. At the end of this article there are a few example programs, all of them making use of yield.\n Yield is used to implement   cooperative multitasking where all tasks cooperate for the use of processing resources. When a task has performed a series of computations and relieves control to another task, one of three things has happened:\n The task initiated an external (“blocking”) operation, like reading from a file or waiting for a certain time to occur,\n Most systems that communicate with its environment and abroad, like a web server or a text editor, spend most of its time (CPU time relative to real time) waiting for the environment to respond; e.g. producing data on a network socket, writing contents to a file or returning a stepper motors position. These systems often benefit from cooperative multitasking, in particular coherent, specialized systems (unlike operating systems which are general by nature).\n What Sol provides is essentially  coroutines for concurrency. A nice feature with coroutines (aka “green threads” aka “user threads”) is their ability to run sequential code in a concurrent system. A task like this:\n  Involves three “blocking” calls to the environment which causes the task to yield:\n open asks the operating system to open a file by  name. The file might get opened sometime in the future. The scheduler takes a note that the task is waiting for this to happen, removes it from the  run queue for the time being.\n  The OS tells the scheduler that “that file you wanted me to open, well here’s the file descriptor” and thus the scheduler places the task on the  run queue again.\n    The task again calls to the environment, this time asking to  read the contents of  f.\n  Same thing as before, the scheduler tells the OS, takes a note, unschedules the task and continue with executing other tasks.\n  The OS tells the scheulder “I’ve read that file you asked me to read, here’s the data” (in reality this is slightly more complicated, but the principles are the same)\n   def read_file(name, callback): open(name, def (error, f): if (error): callback(error) else: read(f, def (read_error, data): close(f, def (error): callback(error, data) ) ) ) # returns here before the file has been opened\n Clearly harder to follow. A task in Sol can spawn new tasks in order to perform several things at the same time, like writing a file while replying over the network.\n def write_and_reply(destination_id, message): writer = write_file(destination_id + &#34;.msg&#34;, message) send_message(destination_id, message) while (recv(writer) != TaskEnd) noop # wait for write_file to end\n  Because a cooperatively multitasked system relies on each process regularly giving up time to other processes on the system, one poorly designed program can consume all of the CPU time for itself or cause the whole system to hang.\n This can happen when a program performs a very lengthy set of computations and can cause all kinds of problems, especially for other tasks relying on timers. As the Sol scheduler checks for timer expiration only between execution of tasks, a timer might effectively fire long after it was supposed to. Imagine controlling a toy  quadrotor where one task needs to update one rotor’s angle each 50 milliseconds, and another task consumes a wholesome 200 milliseconds, then your quadrotor might just crash and burn.\n To address this Sol employs an  operation cost counter. Each task is given a predefined amount of “operation value” per execution iteration (when the scheduler runs a task’s program). When the  operation cost counter reaches its limit, the task is simply forced to yield to other tasks. In the source code, look for  S_VM_EXEC_LIMIT.\n  The code below is expressed in a simplified assembly language that is almost 1:1 with the C API for defining these programs programatically, and so the assembly language itself should be considered irrelevant beyond explaining the instructions executed.\n In the output, lines like these:  [vm] ______________ ... denote when the scheduler regains control after running a task and the task either returned or yielded. This is one “execution iteration”. When running multiple tasks, you will usually see tasks interleved in round-robin order between these “execution iteration” marker lines.\n  In the output, lines starting with “…” are comments and/or simplifications and not part of the actual output.\n  In assembly comments,  R(x) means “Register x”,  RK(x) means “Register x if x is less than k else Constant (x-k)” where k is a special value,  K(x) means “Constant x”.\n  In assembly comments,  PC signifies the “program counter” which is sort of a cursor to the instructions of a program. It is incremented by one for each instruction executed. Some instructions will further modify this counter, like for instance the  JUMP instruction.\n  While the variable x is greater than zero, decrement  x by one and yield to thescheduler, letting other tasks run. Eventually return.\n def main(): x = 5 while (x &gt; 0): x = x - 1 yield return\n  define main 0 CONST 5 # K(0) = 5 CONST 0 # K(1) = 0 CONST 1 # K(2) = 1 entry: LOADK 0 0 # R(0) = K(0) LE 0 0 256 # (0 == RK(k+1) &lt; RK(0)) ? continue else PC++ JUMP 3 # PC += 3 to RETURN SUB 0 0 257 # R(0) = R(0) - RK(k+1) YIELD 0 0 0 # yield A=type=sched JUMP -5 # PC -= 5 to LE RETURN 0 0 # return\n  $ build/debug/bin/solSol 0.1.0 x64[vm] ______________ ______________ __________ _______ ____ ______________[vm] Task Function PC Op Values[vm] 0x7fdf28c03c00 0x7fdf28c000e0 0 LOADK AB: 0, 0[vm] 0x7fdf28c03c00 0x7fdf28c000e0 1 LE ABC: 0, 0, 256[vm] 0x7fdf28c03c00 0x7fdf28c000e0 3 SUB ABC: 0, 0, 257[vm] 0x7fdf28c03c00 0x7fdf28c000e0 4 YIELD ABC: 0, 0, 0[vm] ______________ ______________ __________ _______ ____ ______________[vm] Task Function PC Op Values[vm] 0x7fdf28c03c00 0x7fdf28c000e0 5 JUMP Bss: -5[vm] 0x7fdf28c03c00 0x7fdf28c000e0 1 LE ABC: 0, 0, 256[vm] 0x7fdf28c03c00 0x7fdf28c000e0 3 SUB ABC: 0, 0, 257[vm] 0x7fdf28c03c00 0x7fdf28c000e0 4 YIELD ABC: 0, 0, 0[vm] ______________ ______________ __________ _______ ____ ______________...three more execution iterations identical to the above block...[vm] ______________ ______________ __________ _______ ____ ______________[vm] Task Function PC Op Values[vm] 0x7fdf28c03c00 0x7fdf28c000e0 5 JUMP Bss: -5[vm] 0x7fdf28c03c00 0x7fdf28c000e0 1 LE ABC: 0, 0, 256[vm] 0x7fdf28c03c00 0x7fdf28c000e0 2 JUMP Bss: 3[vm] 0x7fdf28c03c00 0x7fdf28c000e0 6 RETURN AB: 0, 0Scheduler runloop exited.\n  This program uses two functions. The entry point is the  main function which simplycalls the  kitten function with one argument ‘500’. The  kitten function “sleeps” forthe number of milliseconds passed to it (as the first argument.) The  kitten functionthen returns the number “123” to the caller—the  main function—which dumps register values andfinally returns, causing the task to exit and subsequently the scheduler and the VM too to exit.\n  define kitten 1 # Arguments: (R(0)=sleep_ms) CONST 123 # K(0) = 123 entry: YIELD 1 0 0 # yield A=type=timer, RK(B)=R(0)=arg0 LOADK 0 0 # R(0) = K(0) = 123 RETURN 0 1 # return R(0)..R(0) = R(0) = 123define main 0 # Arguments: () CONST @kitten # K(0) = &lt;func kitten&gt; CONST 500 # K(1) = 500 entry: LOADK 0 0 # R(0) = K(0) = the kitten function LOADK 1 1 # R(1) = K(1) = 500 CALL 0 1 1 # R(0)..R(0) = R(0)(R(1)..R(1)) = a(R(1)) DBGREG 0 1 0 # VM debug function that dumps register values RETURN 0 0 # return\n  $ time build/debug/bin/solSol 0.1.0 x64[vm] ______________ ______________ __________ _______ ____ ______________[vm] Task Function PC Op Values[vm] 0x7f8c9bc03bf0 0x7f8c9bc03910 0 LOADK AB: 0, 0[vm] 0x7f8c9bc03bf0 0x7f8c9bc03910 1 LOADK AB: 1, 1[vm] 0x7f8c9bc03bf0 0x7f8c9bc03910 2 CALL ABC: 0, 1, 1[vm] 0x7f8c9bc03bf0 0x7f8c9bc000e0 1 YIELD ABC: 1, 0, 0D Timer scheduled to trigger after 500.000000 ms (sched.c:81)# ...time passes and in this case the scheduler is idling...D Timer triggered -- scheduling task (sched.c:57)[vm] ______________ ______________ __________ _______ ____ ______________[vm] Task Function PC Op Values[vm] 0x7f8c9bc03bf0 0x7f8c9bc000e0 2 LOADK AB: 0, 0[vm] 0x7f8c9bc03bf0 0x7f8c9bc000e0 3 RETURN AB: 0, 1[vm] 0x7f8c9bc03bf0 0x7f8c9bc03910 3 DBGREG D [vm] R(0) = 123.000000 (sched_exec.h:214)D [vm] R(1) = 500.000000 (sched_exec.h:215)D [vm] R(0) = 123.000000 (sched_exec.h:216)[vm] 0x7f8c9bc03bf0 0x7f8c9bc03910 4 RETURN AB: 0, 0Scheduler runloop exited.real 0m0.504suser 0m0.001ssys 0m0.001s\n   $ build/debug/bin/solSol 0.1.0 x64[sched 0x7fc219403930] run queue: [task 0x7fc219403c00] -&gt; [task 0x7fc219403cd0] -&gt; [task 0x7fc219403da0][vm] ______________ ______________ __________ _______ ____ ______________[vm] Task Function PC Op Values[vm] 0x7fc219403c00 0x7fc2194000e0 0 LOADK AB: 0, 0[vm] 0x7fc219403c00 0x7fc2194000e0 1 LE ABC: 0, 0, 256[vm] 0x7fc219403c00 0x7fc2194000e0 3 SUB ABC: 0, 0, 257[vm] 0x7fc219403c00 0x7fc2194000e0 4 YIELD ABC: 0, 0, 0[vm] ______________ ______________ _________\n......", "posttime": "2020-06-06 17:42:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "虚拟机,阳光灿烂,sunny,任务", "title": "Solâ€“一个阳光灿烂的小虚拟机", "title_en": "Sol â€“ a sunny little virtual machine", "transed": 1, "url": "https://rsms.me/sol-a-sunny-little-virtual-machine", "via": "", "real_tags": ["虚拟机", "阳光灿烂", "sunny", "任务"]}, {"category": "", "categoryclass": "", "imagename": "8122e745ceae3935cb742a74c1b8bac6.png", "infoid": 1005417, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ward是一个简单而简约的服务器监控工具，它只显示主要信息，如果你想看到好看的仪表板而不是一堆数字和图形，可以使用它。Ward在所有流行的操作系统上都能很好地工作，因为它使用OSHI。\n此块包含正常运行时间和图表模块。正常运行时间表示自Linux上次启动以来的时间，以及Windows上两次硬重置之间的时间。图表显示最近15秒的服务器利用率。(处理器、RAM、存储器)您可以通过单击图表模块右上角的矩形来隐藏独立的数据集。", "note_en": "Ward is a simple and and minimalistic server monitoring tool.It shows only principal information and can be used, if you want to see nice looking dashboard instead bunch of numbers and graphs.Ward works nice on all popular operating systems, because it uses  OSHI.\n           This block contain uptime and chart modules. Uptime represent time since last boot on Linux, and time between hard resets on Windows. Chart display last fifteen seconds of server utilization. (Proccesor, ram, storage) You can hide separated datasets by clicking on rectangles on re top right corner of chart module.", "posttime": "2020-06-06 17:08:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "服务器,minimalistic,时间", "title": "简单、简约的服务器仪表板", "title_en": "Simple and Minimalistic Server Dashboard", "transed": 1, "url": "https://github.com/B-Software/Ward", "via": "", "real_tags": ["服务器", "时间"]}, {"category": "", "categoryclass": "", "imagename": "a67109b06c9dd112877ffbc0c9c3d916.jpg", "infoid": 1005416, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "EPFL的研究人员已经对该国采取的减缓冠状病毒传播的措施的影响进行了建模。根据他们的估计，污染率下降了53%至92%，具体取决于各州，人员流动减少了30%至80%。\n瑞士政府的封锁措施在阻止大流行方面是否有效？这是一个EPFL研究小组开始通过分析2月28日的数据来回答这个问题，2月28日是瑞士政府禁止1000人以上的团体的那一天。这一最初的限制之后是一系列其他的限制，最终在3月20日开始实施，禁止5人以上的团体。该研究的合著者雅克·费莱(Jacques Fellay)表示：“政策制定者必须能够量化这些措施在减缓SARS-CoV-2传播方面的效果，这样他们才能为这次大流行和未来的大流行做出正确的决定。”费莱是欧洲足球联合会生命科学学院的一名医学研究员，也是瑞士联邦政府新冠肺炎科学顾问委员会的成员。该研究小组的发现刚刚发表在“瑞士医学周刊”上。\n他们的方法包括使用流行病学模型来计算病毒在全国和州一级大流行过程中的“基本复制数”，即R0。该模型使用了沃德1,000多名新冠肺炎住院患者的详细数据，以及有关新冠肺炎在瑞士住院和死亡的公开信息。“我们很幸运地获得了关键数据，如住院时间-包括在重症监护病房-这在这种类型的研究中并不总是如此。这使得我们可以根据瑞士的具体临床条件定制我们的模型，“EPFL生态水文学实验室的博士生、该研究的主要作者Joseph Lemaitre说。\n研究小组发现，在国家层面上，R0从大流行开始时的2.8%下降到4月初的0.4%-下降了86%。从各个州来看，R0下降了53%(在汝拉)到92%(在巴塞尔-斯塔特)。人们行动的减少是通过智能手机的数据来衡量的：全国范围内工作、购物和娱乐活动的出行减少了50%到75%，州一级减少了30%到80%。研究人员还发现，人们活动的减少和R0的下降之间存在很强的相关性，尽管这一比率实际上在人们开始改变习惯的几天前就开始下降了。\n描述：由研究人员模型计算的R0时间序列。中位数=虚线；四分位数范围=深灰色；95%置信区间=浅灰色。1=禁止1000人以上的团体；2=关闭学校；3=关闭所有非必要的企业；4=禁止5人以上的团体。/J.Lemaitre等人，SMW，2020。\n根据这项研究，R0从3月6日开始下降，至少在瑞士学校正式停课前一周。瑞士联邦公共卫生局于2月28日开展了新冠肺炎宣传活动，并于3月2日更新，更加注重个人卫生措施。这场运动提高了人们对形势严重性的认识，并促使人们遵循政府的个人卫生和社会距离建议。因此，R0在建议变得强制性之前就开始下降。“当政府禁止5人以上的团体，并要求所有人都呆在家里时，R0已经接近1。当然，这在一定程度上可能是因为人们看到了这些要求的到来，并相应地改变了自己的行为-例如，采取了社交疏远措施-甚至在官方宣布之前，就像互联网搜索数据所显示的那样，Lemaitre说。\n研究人员的模型表明，3.9%的瑞士人口已经感染了这种新的冠状病毒(截至4月24日)，该州的感染率从伯尔尼的1.9%到提契诺的16%不等。\n描述：截至4月24日，瑞士感染SARS-CoV-2病毒的人数百分比。对有足够数据的12个州进行了估计。未建模的州以灰色显示，点表示国家级估计发病率比例为3%。/J.Lemaitre等人，SMW，2020\n现在，封锁措施正在逐步解除，研究小组计划每天公布他们的R0估计。密切跟踪这一指标将是至关重要的，因为病毒的传播只能通过人的行为来减缓，而不是等到我们实现群体免疫-这还很遥远。“既然餐馆和商店重新开张，我们会看到感染人数上升吗？能否通过更积极的测试和追踪战略来遏制这种上升？而口罩又有多大帮助呢？“。费利说。“我们仍然没有这些问题的答案--这就是为什么我们必须密切跟踪流行病学指标的原因。每日R0数字将是未来几个月公共卫生政策制定者的有用指南。研究人员可以通过用新的数据不断增强他们的模型来提供帮助，例如正在进行的血清学测试的结果，或者我们现在掌握的有关COVID-19在临床患者中如何发展的更详细的信息。“。\n参考文献“评估非药物干预对瑞士SARS-CoV-2传播的影响”。约瑟夫。Lemaitre，Javier Perez-Saez，Andrew S.Azman，Andrea Rinaldo和Jacques Fellay。《瑞士医学周刊》，2020年版。--https://smw.ch/article/doi/smw.2020.20295", "note_en": "EPFL researchers have modeled the effects of measures taken in the country to slow the spread of coronavirus. According to their estimates, the contamination rate has fallen by between 53% and 92%, depending on the canton, and people’s movements have been reduced by 30% to 80%.\n Have the Swiss government’s lockdown measures been effective in stemming the pandemic? That’s the question a team of EPFL researchers set out to answer by analyzing data dating back to 28 February, the day the Swiss government banned groupings of over 1,000 people. This initial restriction was followed by a series of others that culminated in a ban on groupings of over five people, introduced on 20 March. “It’s essential for policymakers to be able to quantify how effective these measures are in slowing the spread of SARS-CoV-2, so that they can make the right decisions for both this pandemic and future ones,” says Jacques Fellay, the study’s coauthor. Fellay, a medical researcher at EPFL’s School of Life Sciences, also sits on the Swiss federal government’s COVID-19 scientific advisory board. The team’s findings  have just been published in  Swiss Medical Weekly.\n Their method involves using an epidemiological model to calculate the virus’s “basic reproduction number,” or R 0, over the course of the pandemic on both a national and cantonal level. The model uses detailed data on over 1,000 hospitalized COVID-19 patients in Vaud as well as publicly available information on COVID-19 hospitalizations and deaths in Switzerland. “We were fortunate to have access to key data such as the length of hospital stays – including in intensive care units – which isn’t always the case in this type of study. That allowed us to tailor our model to the specific clinical conditions in Switzerland,” says Joseph Lemaitre, a PhD student at EPFL’s Laboratory of Ecohydrology and the study’s lead author.\n The research team found that on a national level, R 0 fell from 2.8 at the start of the pandemic to 0.4 in early April – a decrease of 86%. Looking at individual cantons, R 0 dropped between 53% (in Jura) and 92% (in Basel-Stadt). The reduction in people’s movements was measured using smartphone data: trips for work, shopping and recreational activities fell between 50% and 75% on a national level and between 30% and 80% on a cantonal level. The researchers also found a strong correlation between a reduction in people’s movements and a decrease in R 0, even though this rate actually started declining a few days before people began changing their habits.\n  Caption: R 0 time series calculated by the researchers’ model. Median = dashed line; interquartile range = dark grey; 95% confidence interval = light grey. 1 = ban on groupings of more than 1,000 people; 2 = closure of schools; 3 = closure of all non-essential businesses; 4 = ban on groupings of more than 5 people. / J. Lemaitre et al., SMW, 2020\n According to the study, R 0 began falling on 6 March – at least one week before Swiss schools were officially closed. The Swiss Federal Office of Public Health rolled out its COVID-19 information campaign on 28 February and updated it on 2 March with a heightened focus on personal hygiene measures. This campaign raised awareness about the gravity of the situation and prompted people to follow the government’s personal hygiene and social distancing recommendations. As a result, R 0 started falling before the recommendations became mandatory. “R 0 was already close to 1 when the government banned groupings of more than five people and asked that everyone stay at home. Of course, that may be partly due to the fact that people saw those requirements coming and changed their behavior accordingly – by adopting social distancing measures, for example – even before the official announcement, as suggested by data on internet searches,” says Lemaitre.\n The researchers’ model indicates that 3.9% of the Swiss population has been infected by the new coronavirus (as of 24 April), with cantonal rates ranging from 1.9% in Bern to 16% in Ticino.\n  Caption: Percentage of people infected with SARS-CoV-2 in Switzerland up to 24 April. Estimates were produced for the 12 cantons for which enough data were available. Unmodeled cantons are shown in grey with points indicating the national-level estimated incidence proportion of 3%. / J. Lemaitre et al., SMW, 2020\n Now that the lockdown measures are gradually being lifted, the research team plans to publish their R 0 estimate daily. Tracking this metric closely will be essential since the spread of the virus can only be slowed through people’s behaviors, and not by waiting until we achieve herd immunity – which is still far off. “Will we see a rise in infections now that restaurants and shops are opening back up? Could that rise be contained through a more aggressive testing and tracing strategy? And how helpful are masks?” says Fellay. “We still don’t have the answers to those questions – which is why we must track epidemiological indicators closely. Daily R 0 figures will be a useful guide for public-health policymakers in the coming months. Researchers can help by continually enhancing their models with new data, such as the results of the serological tests that are being carried out or the more detailed information we now have on how COVID-19 develops in clinical patients.”\n References “Assessing the impact of non-pharmaceutical interventions on SARS-CoV-2 transmission in Switzerland.” Joseph. C. Lemaitre, Javier Perez-Saez, Andrew S. Azman, Andrea Rinaldo and Jacques Fellay. Swiss Medical Weekly, 2020.  https://smw.ch/article/doi/smw.2020.20295", "posttime": "2020-06-06 16:51:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "封锁,lockdown,r0", "title": "瑞士的封锁使新冠肺炎的案件大幅减少", "title_en": "Switzerland's lockdown has sharply reduced the cases of Covid-19", "transed": 1, "url": "https://actu.epfl.ch/news/switzerland-s-lockdown-has-sharply-reduced-the-cas/", "via": "", "real_tags": ["封锁", "lockdown", "r0"]}, {"category": "", "categoryclass": "", "imagename": "e44a0c6ec182018aface067a38d88035.png", "infoid": 1005414, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "解决一个困难的物理问题可能会出人意料地类似于组装一个连锁式的机械拼图。在这两种情况下，颗粒或碎片看起来都很相似，但可以排列成一个漂亮的结构，这取决于每个组件的精确位置(图1)。1983年，物理学家罗伯特·劳克林(Robert Laughlin)在一种名为霍尔棒1(Hall Bar 1)的设备中解释了电子相互作用形成的结构，从而解开了谜团。尽管这些电子的奇怪行为仍然让物理学家们着迷，但模拟这样的系统或精确测量粒子的超短时间和长度尺度是不可能的。克拉克等人在“自然”杂志上撰文。2报道了一种由复合物质-轻粒子组成的非电子Laughlin态的产生，这种粒子被称为极化子，比电子更容易追踪和操纵。\n为了描绘拉夫林状态，请考虑霍尔棒，在其中通常可以观察到这样的状态(图2A)。在这些器件中，可以在二维平面上自由运动的电子受到垂直于平面的强磁场的影响。在经典物理中，任何位置的电子都会开始沿着被称为回旋轨道的圆形轨道运动，回旋轨道的半径取决于粒子的动能。在量子力学中，电子的位置仍然是自由的，但它的轨道半径--因此，它的动能--只能以离散的步骤增加或减少。这一特征导致大量等能量(能量简并)的状态被称为朗道能级。添加到最低能级的非相互作用电子可以许多不同的方式分布在能级的能量简并态之间。\n增加电子之间的排斥相互作用限制了粒子在最低朗道能级上的分布，有利于任何两个电子在同一地点的几率为零的构型。Laughlin描述的状态正是具有这一性质，并解释了分数量子霍尔效应的主要特征，即强磁场中的电子共同作用，表现为具有分数电荷的粒子。这项工作为劳克林赢得了1998年诺贝尔物理学奖的一部分。Laughlin态是真正的多体状态，不能用典型的近似来描述，例如平均场近似。相反，每个粒子的状态取决于所有其他粒子的精确状态，就像在连锁拼图中一样。\n为了获得由偏振子组成的Laughlin态，克拉克和他的同事需要在光子系统中添加两个元素。第一种是相当于会导致光子态能量简并的磁场。第二种是光子相互作用的方式，这将迫使系统形成拉夫林状态，而不是任何其他简并的最低能量状态的组合。在一组开创性的实验中，作者的研究小组先前已经独立地演示了每种元素3、4。在目前的工作中，这些元素被组合在一起。\n克拉克和他的同事使用了一种称为光学腔的光子系统，它由四面镜子组成(图2B)。这种设置导致不同的拉盖尔-高斯模式(具有甜甜圈形状的光模式)彼此具有相同的能量，形成类似朗道能级。在腔中传播的光与铷原子云相互作用，将这些原子提升到高度激发(里德堡)态，这些态相对较大，相互作用很强。相互作用的腔体光子和原子形成了研究人员研究的极化子。这些极化子既继承了其光子部分的能量简并，又继承了其原子部分的相互作用，因此可以进入Laughlin态。\n作者们观察到了可能最小的Laughlin态--一个由两个极化子组成的态。他们通过仔细研究腔体发出的光，展示了这种量子态的特性。因为这个系统中的时标比电子系统中的时标要长得多，Clark等人说。可以测量每种光模式下的光子数量，以及光子的时间和空间相关性，证明了这种长期寻找的状态的形成。\n这项工作是量子模拟领域的里程碑5，6。该领域的物理学家建立实验来模拟发生在难以操纵和不可能用计算建模的系统中的现象。仿真系统与原始现象完全不同，但具有相同数量的控制参数，可以用来尝试再现和理解现象的基本原理。\n克拉克和他的同事的结果进一步验证了研究强关联系统的量子模拟方法。此方法是查找具有出处的材料的关键\n这项工作的主要成就是观察到了由极化子组成的尽可能最小的Laughlin态，并对其进行了仔细的表征。未来的研究可能会产生更大的状态，这些状态在计算上是难以处理的，并可以探索这个系统的激发。这样的进步将测试该平台容纳两个以上极化子的能力，并构建更大的物质和光的谜题。", "note_en": "Solving a difficult physics problem can be surprisingly similar to assembling an interlocking mechanical puzzle. In both cases, the particles or pieces look alike, but can be arranged into a beautiful structure that relies on the precise position of each component (Fig. 1). In 1983, the physicist Robert Laughlin made a puzzle-solving breakthrough by explaining the structure formed by interacting electrons in a device known as a Hall bar  1. Although the strange behaviour of these electrons still fascinates physicists, it is not possible to simulate such a system or accurately measure the particles’ ultrashort time and length scales.  Writing in  Nature, Clark  et al.  2 report the creation of a non-electronic Laughlin state made of composite matter–light particles called polaritons, which are easier to track and manipulate than are electrons.\n To picture a Laughlin state, consider a Hall bar, in which such states are usually observed (Fig. 2a). In these devices, electrons that are free to move in a two-dimensional plane are subjected to a strong magnetic field perpendicular to the plane. In classical physics, an electron at any position will start moving along a circular trajectory known as a cyclotron orbit, the radius of which depends on the particle’s kinetic energy. In quantum mechanics, the electron’s position will still be free, but its orbital radius — and, therefore, its kinetic energy — can be increased or decreased only in discrete steps. This feature leads to large sets of equal-energy (energy-degenerate) states called Landau levels. Non-interacting electrons added to the lowest-energy Landau level can be distributed between the level’s energy-degenerate states in many different ways.\n  Adding repulsive interactions between the electrons constrains the particles’ distribution over the states of the lowest Landau level, favouring configurations in which any two electrons have zero probability of being at the same spot. The states described by Laughlin have exactly this property and explain the main features of the fractional quantum Hall effect, whereby electrons in a strong magnetic field act together to behave like particles that have fractional electric charge. This work earned Laughlin a share of the 1998 Nobel Prize in Physics. Laughlin states are truly many-body states that cannot be described by typical approximations, such as the mean-field approximation. Instead, the state of each particle depends on the precise state of all the others, just as in an interlocking puzzle.\n To obtain a Laughlin state composed of polaritons, Clark and co-workers needed to add two elements to a photonic system. The first was an equivalent of the magnetic field that would cause photonic states to become energy degenerate. The second was a way for photons to interact with one other, which would force the system to form a Laughlin state, rather than any other combination of degenerate lowest-energy states. In a pioneering set of experiments, the authors’ research group had previously demonstrated each element independently  3 ,  4. In the current work, these elements were combined.\n  Clark and colleagues used a photonic system called an optical cavity that consisted of four mirrors (Fig. 2b). This set-up caused different Laguerre–Gauss modes (modes of light that have doughnut-shaped intensity profiles) to have the same energy as each other, forming analogues of Landau levels. Light propagating in the cavity interacted with a cloud of rubidium atoms to promote these atoms to highly excited (Rydberg) states, which are relatively large and interact strongly with one another. The interacting cavity photons and atoms formed the polaritons that the researchers investigated. These polaritons inherited both the energy degeneracy of their photonic part and the interaction of their atomic part, and could, therefore, enter a Laughlin state.\n The authors observed the smallest possible Laughlin state — one made of two polaritons. They demonstrated the properties of this quantum state by carefully studying the light emitted from the cavity. Because the timescales in this system are much longer than those in electronic systems, Clark  et al. could measure the number of photons in each light mode, as well as the photons’ temporal and spatial correlations, proving the formation of this long-sought state.\n  This work is a milestone for the field of quantum simulation  5 ,  6. Physicists in this field build experiments to simulate phenomena occurring in systems that are difficult to manipulate and impossible to model computationally. The simulation system is completely different from that of the original phenomenon, but has the same number of control parameters, and can be used to try to reproduce and understand the underlying principles of the phenomenon.\n Clark and colleagues’ results further validate the quantum-simulation approach to studying strongly correlated systems. This approach is key to finding materials that have exotic properties and excitations that could revolutionize electronics or quantum computing. The work was implemented on a platform pioneered by the authors’ research group, clearing hurdles at which others had stumbled. For instance, the experiment subtly managed to enforce energy degeneracy, which is difficult to attain when the system is not intrinsically symmetric  7, as was the case here.\n The main achievement of this work was to observe the smallest possible Laughlin state made of polaritons, and to carefully characterize it. Future studies could produce larger states that are computationally intractable and probe the excitations of this system. Such advances would test the ability of the platform to accommodate more than two polaritons and to build bigger puzzles of matter and light.", "posttime": "2020-06-06 16:34:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "变成,turned,状态", "title": "光变成了奇异的拉夫林物质", "title_en": "Light turned into exotic Laughlin matter", "transed": 1, "url": "https://www.nature.com/articles/d41586-020-01567-3", "via": "", "real_tags": ["变成", "turned", "状态"]}, {"category": "", "categoryclass": "", "imagename": "534a4237d4050b0c6c176582f297c9f3.jpg", "infoid": 1005413, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "级别1是的，当我登录谷歌做任何事情时，我都会得到这个信息。如果能有个变通的办法就好了。\n级别2我启用了两步验证并在会话之间删除cookie，因此我几乎每天都会收到此消息。如果您保留这些cookie，您将不需要再次登录并完全避免看到这些内容。\n现在，如果您只是在谈论Chrome广告，唯一可能的方法可能是更改浏览器的用户代理，使其看起来像您正在使用Chrome xD。\n当您在Bing中键入Chrome时，级别1 Microsoft也在执行同样的操作.。他们都是同一个人，不要偏袒任何人。", "note_en": "level 1  Yeah I&#39;m getting that when I log into google for anything. It would be nice to get a workaround.\n level 2  i have 2-step verification enabled and delete cookies between sessions, so i&#39;m used to getting this message practically every day. if you keep the cookies, you won&#39;t need to log in again and avoid seeing this entirely.\n now, if you&#39;re talking just about the chrome ad, the only possible way is probably changing the browser&#39;s user agent to look like you&#39;re using chrome xD\n  level 1  Microsoft is doing the same when you type chrome in bing... They are all the same guys, don&#39;t take anyone&#39;s side.", "posttime": "2020-06-06 16:17:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,google,chrome,登录,login", "title": "Gmail登录安全警报消息现在嵌入了Google Chrome的广告", "title_en": "Gmail login security alert messages now embed an ad for Google Chrome", "transed": 1, "url": "https://www.reddit.com/r/MicrosoftEdge/comments/gvfhj8/gmail_login_security_alert_messages_now_embed_an/", "via": "", "real_tags": ["广告", "google", "chrome", "登录", "login"]}, {"category": "", "categoryclass": "", "imagename": "89b1e388465ae04381196940f872cd3c.png", "infoid": 1005412, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您喜欢本教程，请给它一个💓，🦄或🔖，并考虑：\nSPARTIER是一个支持各种语言的固执己见的代码格式化器。当应用于支持的文件类型时，SPARTIER将自动格式化该文件中的代码。\n目前，Prettier本身支持一系列不同的语言/框架，也有其他语言的社区插件。\n将代码编辑器/IDE设置为自动格式化文件(例如，在保存文件时)。\n我更喜欢在保存时自动格式化，因为它会立即给你反馈。它给你的最重要的反馈之一是，如果你有语法错误，它的格式是不正确的！这实际上是令人难以置信的强大。当你在编程的时候，有不同类型的即时反馈让你知道你什么时候犯了错，这样你就能快速改正方向，这一点很重要。“漂亮”提供了现存最快的反馈循环之一。\n好了，我滔滔不绝地谈论更漂亮的伟大之处已经足够了，让我们开始用它来举例吧。\n您可以在全球范围内安装更漂亮的软件，但建议您将其作为开发依赖项安装在本地项目中。这样，所有开发人员都将拥有相同的版本。\n此示例假设您正在使用VS代码，这就是我们将如何在保存功能上配置格式。其他开发环境可能有类似的功能，您可能只需要查找一下！\n让我们为我们的新项目创建一个项目目录。我正在bash中运行这些命令，但是您可以使用您熟悉的任何方法创建新文件和文件夹。\n现在我们安装更漂亮的。一定要将更漂亮的补丁版本固定到一个准确的补丁版本上！Pretier可以在不同的补丁版本之间更新其格式首选项，因此固定到特定的补丁版本可以防止不同开发人员之间的格式差异。\n此外，请确保将Prettier安装为开发依赖项，因为它是开发工具，而不是生产中使用的工具。\n让我们还在我们的目录中创建一个空的更漂亮的配置文件。创建.paytierrc.json并在其中放置一个空对象：\n确保为VS代码安装更漂亮的插件。说明可以在这里找到。\n让我们创建一个格式不佳的文件。在项目目录中创建index.js，并将以下代码放入其中：\n转到VS代码中的设置。您可以在文件&gt；首选项&gt；设置下找到它，也可以只使用ctrl+逗号快捷键(在Mac上是cmd+逗号)。找到编辑器：保存时格式化选项，并确保选中该选项。\n注意：其他编辑器也应该能够在保存时格式化，如果您不使用VS代码，您只需找到一些特定于编辑器的说明即可。\n请注意，我们的间距看起来是正确的。此外，Pretier增加了尾随分号，并将我们的单引号改为双引号。如果您不喜欢其中的一些更改，则可以在我们的.compettierrc.json文件中配置其中的许多内容！\n让我们将index.js文件更改为一些非常粗糙的代码。尝试将其更改为以下内容：\nconst navBarProps={name：[&#34；John Doe&#34；，null]，displayMode：[&#34；Dark&#34；，&#34；light&#34；]，时区：[&#34；et&#34；，&#34；CT&#34；，&#34；MT&#34；，&#34；PT&#34；]，}；function allCombinations(Obj){let combos=[{}]；对象的for(const[key，Values])。条目(Obj)){combos=combos。flatMap((Como)=&gt；值。MAP((值)=&gt；({.。COMBO，[KEY]：Value})；}返回COMBOS；}控制台。log(allCombinations(NavBarProps))；\nconst navBarProps={name：[&#34；John Doe&#34；，null]，displayMode：[&#34；Dark&#34；，&#34；light&#34；]，时区：[&#34；et&#34；，&#34；CT&#34；，&#34；MT&#34；，&#34；PT&#34；]，}；function allCombinations(Obj){let combos=[{}]；对象的for(const[key，Values])。条目(Obj)){combos=combos。flatMap((Como)=&gt；值。MAP((值)=&gt；({.。COMBO，[KEY]：Value})；}返回COMBOS；}控制台。log(allCombinations(NavBarProps))；\n更漂亮的帮助您编写更一致的代码。当您的代码格式正确时，您可以更好地看到模式。当您的代码在保存时没有格式化时，当您的代码有错误时，您会立即开始识别。", "note_en": "If you enjoy this tutorial, please give it a 💓, 🦄, or 🔖 and consider:\n    Prettier is an opinionated code formatter that supports various languages. When applied to a supported file type, Prettier will automatically format the code in that file.\n  Currently, Prettier supports a bunch of different languages/frameworks on its own and also has community plugins for other languages.\n       Setting up your code editor/IDE to format files automatically (e.g., when you save a file).\n I prefer automatically formatting on save because it  immediately gives you feedback. One of the most important pieces of feedback it gives you is  it won&#39;t format if you have a syntax error! This is actually incredibly powerful. When you&#39;re in the flow of programming, it&#39;s critical to have different types of immediate feedback to let you know when you&#39;ve made a mistake so you can quickly correct course. Prettier offers one of the quickest feedback loops that exists.\n  Okay, enough of me gushing about the greatness of Prettier, let&#39;s start using it in an example.\n   You  can install Prettier globally, but it&#39;s advised to install it locally in your project as a development dependency. That way, all developers will have it at the same version.\n  This example assumes you&#39;re using VS Code, which is how we&#39;ll configure our &#34;Format on Save&#34; functionality. Other development environments likely have similar functionality, you just might have to look it up!\n   Let&#39;s create a project directory for our new project. I&#39;m running these commands in bash but you can create new files and folders using whatever method you&#39;re comfortable with.\n        Now we install Prettier.  Make sure to pin Prettier to an exact patch version! Prettier can update their formatting preferences between patch versions, so pinning to a specific patch version prevents formatting differences between different developers.\n Also, make sure to install Prettier as a dev dependency since it&#39;s a dev tool rather than something used in production.\n     Let&#39;s also create an empty prettier configuration file in our directory. Create  .prettierrc.json and just put an empty object in there:\n    Make sure to install the Prettier plugin for VS Code. Instructions can be found  here.\n  Let&#39;s create a poorly formatted file. Make  index.js in your project directory and put the following code in it:\n    Go to  Settings in VS Code. You can find this under File &gt; Preferences &gt; Settings or you can just use the ctrl+comma shortcut (cmd+comma on Mac). Find the  Editor: Format On Save option and make sure it&#39;s checked.\n  Note: Other editors should be able to format on save as well, you will just have to find some editor-specific instructions if you&#39;re not using VS Code.\n    Note that our spacing looks correct. Additionally, Prettier added trailing semi-colons and changed our single quotes to double quotes. A lot of this is  configurable in our  .prettierrc.json file if you don&#39;t like some of the changes!\n  Let&#39;s change our  index.js file to have some really gnarly code. Try changing it to this:\n const  navBarProps  =  { name :[ &#34; John Doe &#34; ,  null ], displayMode :  [ &#34; dark &#34; ,  &#34; light &#34; ], timezone :  [ &#34; ET &#34; ,  &#34; CT &#34; ,  &#34; MT &#34; ,  &#34; PT &#34; ], }; function  allCombinations ( obj )  { let  combos = [{}]; for ( const [ key ,  values ]  of  Object . entries ( obj ))  { combos  =  combos . flatMap (( combo )  =&gt; values . map (( value )  =&gt;  ({  ... combo ,  [ key ]:  value  })));} return  combos ;} console . log ( allCombinations ( navBarProps ));\n  const  navBarProps  =  {  name :  [ &#34; John Doe &#34; ,  null ],  displayMode :  [ &#34; dark &#34; ,  &#34; light &#34; ],  timezone :  [ &#34; ET &#34; ,  &#34; CT &#34; ,  &#34; MT &#34; ,  &#34; PT &#34; ], }; function  allCombinations ( obj )  {  let  combos  =  [{}];  for  ( const  [ key ,  values ]  of  Object . entries ( obj ))  {  combos  =  combos . flatMap (( combo )  =&gt;  values . map (( value )  =&gt;  ({  ... combo ,  [ key ]:  value  }))  );  }  return  combos ; } console . log ( allCombinations ( navBarProps ));\n   Prettier helps you write more consistent code. You see patterns better when your code is formatted correctly. When your code  doesn&#39;t format on save, you start immediately recognizing when your code has errors.", "posttime": "2020-06-06 15:43:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,improve", "title": "要毫不费力地提高代码质量，可能没有比使用更好的方法了；", "title_en": "There May Not Be a Better Way to Effortlessly Improve Code Quality Than Using;", "transed": 1, "url": "https://dev.to/nas5w/there-may-not-be-a-better-way-to-effortlessly-improve-code-quality-than-using-prettier-code-formatting-25je", "via": "", "real_tags": ["代码", "improve"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005411, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Stratus Vos(虚拟操作系统)是在Stratus Technologies容错计算机系统上运行的专有操作系统。VOS可在Stratus的ftServer和Continuum平台上使用。[1]VOS客户使用它来支持需要连续可用性的大容量事务处理应用。值得注意的是，VOS是为数不多的在完全锁定的硬件上运行的操作系统之一。\n在20世纪80年代，出现了一个IBM版本的Stratus Vos，被称为System/88操作系统。[2]。\nVOS从一开始就被设计为专为容错硬件量身定做的高安全性事务处理环境。[3]它结合了麻省理工学院/贝尔实验室/通用电气(后来的霍尼韦尔)Multics项目的大部分设计经验。\n在1984年，Stratus向VOS添加了一个称为Unix System Facilities(USF)的UNIX system V实现，在内核级别集成了Unix和VOS。[4]。\n最近几年，[什么时候？]。Stratus增加了POSIX兼容，许多开放源码包可以在VOS上运行。[5]。\n与竞争对手的专有操作系统一样，Vos的市场份额在20世纪90年代和21世纪初稳步萎缩。[6]。\nVOS为PL/I、COBOL、PASCAL、FORTRAN、C(带有VosC和GCC编译器)和C++(也包括GCC)提供编译器。[7]这些编程语言中的每一种都可以进行VOS系统调用(例如，从文件中读取记录的s$seq_read)，并具有支持PL/I样式的可变长度字符串的扩展。开发人员通常在系统上编译之前，在他们最喜欢的Vos文本编辑器中或脱机编写代码；没有Vos IDE应用程序。\n在其历史上，Stratus曾提供基于摩托罗拉68000微处理器系列(&#34；FT&34；和&#34；XA&34；系列)、英特尔i860微处理器系列(&#34；XA/R&34；系列)、HP PA-RISC处理器系列(&#34；Continuum&34；系列)和英特尔至强x86处理器系列(&#34；V系列&34；)的硬件平台。所有版本的VOS都提供以本机指令集为目标的编译器，有些版本的VOS提供交叉编译器。\nStratus在Vos版本14.3(在Continuum上)中添加了对POSIX API的支持，在Vos版本14.4中添加了对GNU C/C++编译器、GNU GDB调试器和许多POSIX命令的支持。每一个额外的VOS版本都添加了更多的POSIX.1功能，以至于现在可以成功构建许多用户模式开放源码包。出于这个原因，从版本17.0开始，Stratus将VOS重命名为OpenVOS。\nStratus提供受支持的端口，包括Samba、OpenSSL、OpenSSH、GNU Privacy Guard、OpenLDAP、Berkeley DB、MySQL Community Server、Apache、IBM WebSphere MQ和Java社区版。\n无论底层硬件平台的字节顺序如何，VOS中的数字值始终采用高字节顺序。在使用x86处理器的小端服务器上，编译器在向内存读取或写入值之前进行字节交换，以便将数据转换为本机小端格式或将数据从本机小端格式转换为小端格式。\nVOS具有相当完整的命令宏语言，可用于创建菜单系统、自动执行任务等。VOS命令宏在命令行上或通过用户界面接受参数。参数在&#34；PARAMETERS&34；部分中命令宏的开头定义。该语言支持一系列语句，包括IF/THEN/ELSE、布尔运算、WHILE&#34；循环、&#34；GOTO&#34；和出色的错误报告。命令宏语言可在交互和非交互(批处理或启动进程)模式下执行。它可用于自动化程序、捕获提示并发送适当的响应。这导致Stratus限制了命令宏语言的功能。[8]。\n宏语言缺乏对用户定义函数的支持，并且不容易支持包含文件。[需要引用]字符串处理容易出错，尤其是使用嵌入的控制字符时。[需要引用]。\nVOS在移植到ftServer系列之前，主要用PL/I编写，少量用汇编语言编写。[需要引用]截至1991年，该系统是用PL/I和C编写的，汇编中只有3%。这一点，再加上Stratus的高级编译器，使得VOS比同时代的VMS或Domain/OS更具可移植性。[9]。\n它的整体结构与Multics有许多共同之处，而且该系统的许多功能都可以在不同程度上追溯到Multics。该系统向软件设计人员或程序员公开了许多基本抽象，其中最值得注意的是。\n进程是VOS中的调度实体，每个进程都有一组属性来控制系统如何操作它。例如，进程有用户名和进程名。前者由VOS用来确定进程对外部设备和文件系统项的访问权限。最重要的是进程的特权标志，它是一个二进制属性。特权进程可以执行特权操作。此机制用于限制某些可能具有系统范围后果的潜在强大操作(例如，关闭系统、卸下硬盘等)。\nVOS仅由Stratus Technologies分销。分发介质是用于Continuum的3.5 mm DAT磁带和用于早期V系列平台的SDLT磁带。从OpenVOS版本17.0开始，Stratus支持在DVD上分发OpenVOS或通过下载发布文件。软件安装可由Stratus现场工程师或客户的系统管理员完成。\n命令行界面是VOS系统的主要用户界面，也是功能最强大的用户界面。\n如果需要，用户可以通过命令宏脚本[10]锁定到基于表单[10]的子系统，尽管熟练的用户可以突破这一限制并获得命令行访问权限。(事实上，Stratus系统管理员可以设置用户的帐户，以便尝试从FMS(Stratus表单管理系统)进入命令行时会导致用户注销。)。\n可以使用参数调用命令宏和程序，以显示列出所有可用参数的表单，用户可以使用&#34；tab&#34；键导航该表单。每个参数通常被限制为控制用户可以输入的内容。这包括有效值列表、纯数字、纯文本等。也可以使用&#34；secret&#34；标签隐藏参数，或将其设置为必填项。\nVOS中的所有命令都是完整定义的，并用下划线分隔单词。例如，change_current_dir更改工作目录。Vos帮助系统使用此约定来帮助正在查找可能命令子集的用户；例如，通过help-match change可以找到那些引用&#34；change&#34；的命令。\n用户可以通过包含命令缩写的文件来自定义他们的命令界面。命令缩写通常以它们表示的命令的第一个字母命名，因此ccd可以扩展为change_current_dir foodir。\nVOS在Continuum和ftServer系统上使用，这两个系统都设计为高度容错。因此，这些系统通常用于安全关键型或任务关键型应用程序，通常是银行、医院、电信和交易处理公司。[11]。\nVOS的旧版本实现了称为操作系统TCP/IP(操作系统TCP/IP)的非OSI标准TCP/IP。从版本14.x开始，VOS已经实现了与OSI兼容的STREAMS-TCP。必须移植使用操作系统TCP/IP的旧应用程序才能使用STCP。[12]这可能意味着功能的丧失，因为操作系统TCP/IP支持多个不符合OSI的功能，因此已被放弃。运行V系列的ftServer硬件仅支持TCP/IP和X.25(仅当配备可选NIO时才支持X.25。)。WebSphere MQ 6.0(也称为。MQ系列)是基于TCP/IP的；因此，ftServer硬件也支持这一点。支持传统协议的设备在Continuum硬件上运行，并且可以通过Open StrataLINK[13]网络从当前硬件访问。\nVOS自下而上内置了容错功能。在硬件级别上，主要设备在锁步双工模式下运行，这意味着有两个相同的设备同时执行相同的操作。(此外，每个设备或电路板也是双工的，以便在硬件级别识别内部电路板故障，这就是为什么可以将Stratus硬件定义为锁定阶跃。)。这些主板由操作系统主动监控，可以纠正任何细微的不一致(例如坏的磁盘写入或读取)。系统会将报告不可接受故障数量的任何主板从服务中移除；双工主板将继续运行，直到通过热修复解决问题为止。这包括CPU、磁盘驱动器和任何其他在逻辑上可以双工的设备(根据定义，这不包括通信设备)。系统将继续正常处理，并通过RSN(远程服务网络)自动向Stratus客户服务部门发出故障罚单。然后，Stratus客户服务将使用RSN拨入系统以调查问题并派单更换部件。\n流文件：二进制数据流，与其他操作系统上的文件概念直接对应。\nVos API允许为每个文件创建多个索引，根据记录、外部键、内部键或一组定义明确的多个键的内容进行排序。具有一个或多个索引的VOS文件可以用作C-ISAM数据库表。\nVOS使用专有的文件命名语法，其中包括系统名、模块名、磁盘号和目录，组件之间用&#34；&gt；&#34；符号分隔。通常，系统盘将与CPU位于相同的模块中，#m1，因此Vos集群的系统文件将被引用为。\nVOS磁盘分配和内存被组织在&#34；块&#34；中，每个块为4096字节。内存采用RAM或分页的形式。VOS系统支持分页分区和分页文件。在VOS的现代版本中，分页文件可以由sysadmin动态创建(但不能在不重新启动的情况下删除)。理论上，这些分页文件可以由一个以上的区段(内核将其视为小型分页分区)组成，这些区段可能是连续的，也可能不是。但是，不建议使用非连续区段，因为它们会极大地增加磁盘活动。管理员应在系统引导后尽早为分页文件创建尽可能大的范围。[14]。\nVOS支持对所有文件、目录和设备的写、读、执行和空(无)访问(尽管目录和文件的访问列表略有不同)。可以将访问权限分配给用户、组或世界。如果用户对程序所在的目录具有状态访问权限，则运行可执行程序只需要读取访问权限。\nVOS继承了Multics的访问控制列表，还实现了目录访问控制列表。如果文件没有访问控制列表，则应用包含目录的默认访问控制列表。\n对设备的访问通常通过创建由管理员链接到设备的文件来控制。(在OpenVOS中可能是这样，但不适用于原始操作系统。)。然后授予对该文件的访问权限，这将设置对设备的访问权限。\nVOS一直是一个网络感知的操作系统。实际上，本机API中的每个系统调用都有一个参数，用于确定操作影响的计算机。[15][验证失败][验证失败]如果操作不是本地的，则通过远程子例程调用将其重定向到目标计算机。例如，解析文件名以指示文件驻留在哪台计算机上。\nStrataLINK网络模型具有用于命名计算机的两级层次结构：每台计算机称为一个模块，模块被聚合到系统中。每个系统都作为一个单元进行管理。换句话说，系统中的所有模块都知道该系统上的所有磁盘和硬件设备。这样做的结果是，以系统名称开头的文件名指的是其他计算机上的文件，无需任何特殊网络即可打开。设备也是如此。其他系统实体(如进程)使用%SYSTEM#MODULE写成的模块名称进行引用。VOS系统和模块名称与IP地址或域名没有明确的关系-Vos API是在1980年末开发的-在互联网被广泛采用之前，甚至在URL发明之前很久。\n从历史上看，StrataLINK是专有的10Mb CSMA/CD环网，允许以非常低的内存开销和CPU利用率实现高性能(暂时)。它的发展从未超过10Mb，而是放弃了使用TCP/IP，因为以太网成为占主导地位的网络标准，而且内存和CPU处理变得更便宜。\nOpen StrataLINK还可以使用X.25进行广域通信。使用Open StrataLINK协议进行广域通信也称为StrataNET。\n罗伯特·C·西科德；丹尼尔·普拉科什；刘易斯，格雷斯·A(2003)。使遗留系统现代化：软件技术、工程流程和业务实践。艾迪森-韦斯利。第11页。\n^a b&#34；存档副本&#34；。2011年9月27日从原件存档。CS1维护：作为标题的存档副本(链接)。\n^Johnson，Maryfran(1991年4月1日)。&#34；Stratus编译器拼写迁移Boost&#34；。计算机世界。第25页，第32页。\n^&#34；存档副本&#34；。2007年7月3日从原件存档。CS1维护：作为标题的存档副本(链接)", "note_en": "Stratus VOS ( Virtual Operating System) is a proprietary  operating system running on  Stratus Technologies  fault-tolerant computer systems. VOS is available on Stratus&#39;s ftServer and Continuum platforms.  [1] VOS customers use it to support high-volume transaction processing applications which require continuous availability. VOS is notable for being one of the few operating systems which run on fully  lockstepped hardware.\n During the 1980s, an  IBM version of Stratus VOS existed and was called the  System/88 Operating System.  [2]\n   VOS was designed from its inception as a high-security transaction-processing environment tailored to fault-tolerant hardware.  [3] It incorporates much of the design experience that came out of the MIT/Bell-Laboratories/General-Electric (later Honeywell)  Multics project.\n In 1984, Stratus added a  UNIX System V implementation called Unix System Facilities (USF) to VOS, integrating Unix and VOS at the  kernel level.  [4]\n In recent years, [   when?] Stratus has added  POSIX-compliance, and many open source packages can run on VOS.  [5]\n Like competing proprietary operating systems, VOS has seen its market share shrink steadily in the 1990s and early 2000s.  [6]\n   VOS provides compilers for  PL/I,  COBOL,  Pascal,  FORTRAN,  C (with the  VOS C and  GCC compilers), and  C++ (also  GCC).  [7] Each of these programming languages can make VOS system calls (e.g.  s$seq_read to read a record from a file), and has extensions to support varying-length strings in PL/I style. Developers typically code in their favourite VOS text editor, or offline, before compiling on the system; there are no VOS IDE applications.\n In its history, Stratus has offered hardware platforms based on the  Motorola 68000 microprocessor family (&#34;FT&#34; and &#34;XA&#34; series), the  Intel i860 microprocessor family (&#34;XA/R&#34; series), the  HP PA-RISC processor family (&#34;Continuum&#34; series), and the  Intel Xeon  x86 processor family (&#34;V Series&#34;). All versions of VOS offer compilers targeted at the native instruction set, and some versions of VOS offer cross-compilers.\n Stratus added support for the  POSIX API in VOS Release 14.3 (on Continuum), and added support for the GNU C/C++ compiler, GNU gdb debugger, and many POSIX commands in VOS Release 14.4. Each additional release of VOS has added more POSIX.1 capabilities, to the point where many user-mode open-source packages can now be successfully built. For this reason, beginning with Release 17.0, Stratus renamed VOS to OpenVOS.\n Stratus offers supported ports of Samba, OpenSSL, OpenSSH, GNU Privacy Guard, OpenLDAP, Berkeley DB, MySQL Community Server, Apache, IBM WebSphere MQ, and the community edition of Java.\n Numeric values in VOS are always  big endian, regardless of the endianness of the underlying hardware platform. On  little endian servers with x86 processors, the compilers do a byte swap before reading or writing values to memory to transform the data to or from the native little endian format.\n  VOS has a fairly complete command macro language which can be used to create menu systems, automate tasks etc. VOS command macros accept arguments on the command-line or via a user interface &#34;form&#34;. Arguments are defined at the beginning of the command macro in a &#34;parameters&#34; section. The language supports a range of statements, including if/then/else, boolean operations, &#34;while&#34; loops, &#34;goto&#34; and excellent error reporting. The command macro language can be executed in interactive and non-interactive (batch or started process) modes. It can be used to automate programs, capturing prompts and sending appropriate responses. This has led Stratus to limit the capabilities of the command macro language.  [8]\n The macro language lacks support for user-defined functions and does not easily support include files. [   citation needed] The string handling is prone to errors, especially with embedded control characters. [   citation needed]\n  VOS was coded mainly in  PL/I with a small amount of  assembly language before it was migrated to ftServer series. [   citation needed] As of 1991, the system was written in PL/I and C, with only 3% in assembly. This, and Stratus&#39;s advanced compilers, made VOS more portable than contemporaries such as  VMS or  Domain/OS.  [9]\n Its overall structure has much in common with Multics, and many of the system&#39;s features can be traced back to Multics to varying degrees. The system exposes a number of fundamental abstractions to the software designer or programmer, most notable being\n  A process is the scheduled entity in VOS and each process has a set of attributes that govern how it is manipulated by the system. For example, processes have a  user name and  process name. The former is used by VOS to determine the process&#39;s access rights to external devices and items with the file system. Of fundamental significance is a process&#39;s privileged flag, which is a binary attribute. Privileged processes may perform privileged operations. This mechanism is used to restrict certain potentially powerful operations that can have system wide consequences (e.g. shutting down the system, dismounting a hard disk etc.).\n  VOS is distributed only by  Stratus Technologies. The distribution media is a 3.5 mm  DAT tape for Continuum, and an  SDLT tape for early V Series platforms. As of OpenVOS Release 17.0, Stratus offers support for distributing OpenVOS on a  DVD or by downloading a release file. Software installations may be done by the Stratus Field Engineer or by the customer&#39;s system administrator.\n  The  command-line interface is the main, and most powerful, user interface for a VOS system.\n Users may be locked into &#34;form&#34; based sub-system by command macro scripts  [10] if required, although a skilled user would be able to break out of this and get command-line access. (It is, in fact, possible for a Stratus system administrator to set up a user&#39;s account such that an attempt to break out of FMS—the Stratus Forms Management System—to the command line results in the user being logged out.)\n Command macros and programs can be invoked with an argument to display a form listing all the available parameters, which the user can navigate using the &#34;tab&#34; key. Each parameter is generally restricted to control what the user can input. This includes lists of valid values, numeric-only, text-only, etc. Parameters can also be hidden using a &#34;secret&#34; tag, or made mandatory.\n All commands in VOS are defined in full with underbars to separate words. For example,  change_current_dir changes the  working directory. The VOS help system uses this convention to assist users who are looking for a subset of possible commands; for instance, those referring to &#34;change&#34; are found by    help -match change.\n Users may customize their command interface by means of a file that contains abbreviations for commands. Command abbreviations are conventionally named after the first letters of the command they represent, so   ccd may be expanded to   change_current_dir foodir.\n   VOS is used on Continuum and ftServer systems, both of which are designed to be highly fault-tolerant. As such, these systems are typically used in safety-critical or mission-critical applications, typically banks, hospitals, telecommunications and transaction processing companies.  [11]\n    Older versions of VOS implemented a non-OSI standard TCP/IP known as OS TCP/IP (Operating System TCP/IP.) VOS since version 14.x has implemented OSI-compliant Streams-TCP. Older applications using OS TCP/IP have to be ported in order to use STCP.  [12] This can mean a loss of functionality as OS TCP/IP supported several functions that are not OSI-compliant and have therefore been abandoned. The ftServer hardware that V Series runs on only supports TCP/IP and X.25 (X.25 only when equipped with the optional NIO.) Websphere MQ 6.0 (a.k.a. MQ Series) is TCP/IP based; so, that is also supported by ftServer hardware. Devices supporting the legacy protocols run on the Continuum hardware and may be accessed from current hardware over the Open StrataLINK  [13] network.\n   Fault tolerance is built into VOS from the bottom up. On a hardware level, major devices are run in  lockstepped duplex mode, meaning that there are two identical devices performing the same action at the same time. (In addition, each device, or board, is also duplexed in order to identify internal board failures at a hardware level, which is why Stratus hardware can be defined as &#34;lock stepped&#34;.) These boards are actively monitored by the operating system which can correct any minor inconsistencies (such as bad disk-writes or reads). Any boards which report an unacceptable number of faults are removed from service by the system; the duplexed board will continue operation until the problem is resolved via a hot-fix. This includes CPUs, disk drives, and any other device that can logically be duplexed (which by definition, excludes communications devices). The system will continue processing as normal and will automatically raise a fault ticket with Stratus Customer Service via RSN (the Remote Service Network). Stratus Customer Service will then dial into the system using RSN to investigate the problem and dispatch replacement parts.\n    Stream files: a stream of binary data, corresponding directly with the concept of a file on other operating systems.\n The VOS API allows the creation of multiple indexes per file, sorting according to the contents of a record, or an external key, or an internal key, or a well-defined set of multiple keys. A VOS file with one or more indexes can be used as a C-ISAM database table.\n VOS uses a proprietary file naming syntax which includes the system name, module name, disk number, and directory, with components separated by the &#34;&gt;&#34; symbol. Typically the system disk will be housed in the same module as the CPU,  #m1, so a system file for a VOS cluster would be referenced as\n  VOS disk allocation and memory is organised in &#34;blocks&#34;, each block being 4,096 bytes. Memory takes the form of RAM or paging. VOS systems support paging partitions and paging files. In modern versions of VOS, paging files can be created dynamically by the SysAdmin (but not removed without a reboot). These paging files can in theory consist of more than one extent (which is viewed by the kernel as a mini-paging partition) which may or may not be contiguous. However, non-contiguous extents are NOT recommended as they greatly increase disk activity. Admin should create the largest possible extent for the paging files as early as possible after the system has been booted.  [14]\n  VOS supports write, read, execute, and null (no) access to all files, directories and devices (although directories and files have slightly different access lists). Access can be assigned to users, groups, or the world. Only read access is required to run an executable program, provided that the user has &#34;status&#34; access for the directory in which that program resides.\n VOS inherited access control lists from  Multics and also implements directory access control lists. If a file does not have an access control list, the containing directory&#39;s default access control list applies.\n Access to devices is typically controlled by creating a file which is linked to the device by the administrator. (This may be true in OpenVOS, but does not apply to the original operating system.) Access is then given to this file, and this sets the access on the device.\n  VOS has always been a network-aware operating system. Virtually every system call in the native API has a parameter that determines what computer the operation affects.  [15] [   failed verification]  [16] [   failed verification] If the operation isn&#39;t local, it is redirected to the target computer via  remote subroutine call. For example, file names are parsed to indicate which computer the file resides on.\n The StrataLINK networking model has a two level hierarchy for naming computers: Each computer is called a  module and  modules are aggregated into  systems. Each  system is administered as a unit. In other words, all of the modules in a system are aware of all the disks and hardware devices on that system. The result of this is that a file name that begins with the system name refers to files on other computers and can be opened without the need for any special networking. The same is true for devices. Other system entities, such as processes, are referenced using  module names which are written % system# module. The VOS system and module names have no defined relationship with IP addresses or domain names—The VOS API was developed in late 1980—before the Internet was widely adopted and long before URLs were even invented.\n Historically, StrataLINK was a proprietary 10Mb CSMA/CD ring network which allowed high performance (for the time) with very low memory overhead and CPU utilization. This was never developed beyond 10Mb and was dropped in favor of using TCP/IP because Ethernet became the dominant networking standard and because memory and CPU processing got cheaper.\n Open StrataLINK can also use X.25 for wide area communications. Using the Open StrataLINK protocols for wide area communications is also referred to as StrataNET.\n    ^   Seacord, Robert C.; Plakosh, Daniel; Lewis, Grace A. (2003).   Modernizing Legacy Systems: Software Technologies, Engineering Processes, and Business Practices. Addison-Wesley. p. 11.\n ^     a     b    &#34;Archived copy&#34;. Archived from  the original on September 27, 2011 .  CS1 maint: archived copy as title ( link)\n  ^   Johnson, Maryfran (1 April 1991).  &#34;Stratus compiler spells migration boost&#34;.  Computerworld. pp. 25, 32.\n  ^    &#34;Archived copy&#34;. Archived from  the original on July 3, 2007 .  CS1 maint: archived copy as title ( link)", "posttime": "2020-06-06 15:22:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "stratus,vos", "title": "层状物沃斯(Stratus Vos)", "title_en": "Stratus VOS", "transed": 1, "url": "https://en.wikipedia.org/wiki/Stratus_VOS", "via": "", "real_tags": ["stratus", "vos"]}, {"category": "", "categoryclass": "", "imagename": "569a50a7ab33e61b2fbf3839d393269d.png", "infoid": 1005410, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "哈米德·汗(Hamid Khan)在洛杉矶担任社区组织者超过35年，一贯关注警察暴力和人权。2020年4月3日，他在即将播出的关于人工智能和警务的播客节目中接受了我们的采访。随着世界将注意力转向警察的暴行和制度性种族主义，我们认为我们与他的对话--他认为技术是如何使警察中的种族主义成为可能的--现在应该发表。\n可汗是Stop LAPD间谍联盟的创始人，该联盟代表其争取的少数族裔社区赢得了许多里程碑式的法庭案件。它的工作可能最出名的是倡导反对预见性警察。4月21日，也就是这次采访后的几周，洛杉矶警察局宣布结束所有预测性警务计划。\n可汗是一个有争议的人物，他拒绝了与电子前沿基金会(EFF)等组织的合作伙伴关系，因为EFF强调改革。他不相信改革会奏效。为了篇幅和清晰度，采访经过了编辑。\n我们所做的工作，特别是在洛杉矶警察局的工作，着眼于监视、信息收集、存储和共享在历史上是如何被用来真正造成伤害的，来追踪、跟踪、监视和跟踪特定的社区：贫穷的社区，黑人和棕色的社区，被认为可疑的社区，以及同性恋变性人。所以在各个层面上，监督是一个社会控制的过程。\n阻止洛杉矶警察局间谍联盟有一些指导性的价值。第一，我们看到的不是时间的一瞬间，而是历史的延续。监视已经使用了几百年了。一些最早的监控过程可以追溯到18世纪初纽约市的灯笼法。如果你是一个被奴役的人，一个黑人或原住民，如果你在没有主人的情况下走进公共场所，你必须带着一个真正的字面灯笼，带着烛芯和其他东西，基本上是自我认同为嫌疑人，作为“他者”。\n另一个指导价值是总有一个“他者”。从历史上看，总是有“对系统的威胁”。总有一个人、一个人或一群人被认为是危险的。他们被认为是可疑的。\n第三个价值是，我们一直在寻求去耸人听闻的国家安全言论。为了保持简单明了，(我们试图展示)信息收集和信息共享环境是如何运行的，以及这是一个如何监视每个人的过程。\n我们最后的指导价值之一是，我们的斗争植根于人权。我们是一个强烈的废奴主义团体，所以我们的目标是废除这个制度。我们不搞改革派的工作。我们还认为，任何围绕透明度、问责制和监督的政策发展都是任务潜移默化的模板。任何时候监视合法化，那么它就有可能随着时间的推移而扩大。目前，我们正在努力让无人机停在洛杉矶，我们能够让它们停飞几年。3月下旬，圣地亚哥的丘拉维斯塔警察局宣布，他们将为无人机配备扬声器，以监控无人居住的人的行动。\n你能解释一下阻止洛杉矶警察局间谍联盟在预测治安方面所做的工作吗？从你的角度来看，它有什么问题？\nPredPol是一种基于位置的预测警务，其中500*500平方英尺的位置被确定为热点。另一个配套项目“激光行动”是以人为本的预测性警务。\n2010年，我们研究了这些(洛杉矶警察局的监视)项目的各种实施方式。预测性警务是一个关键项目。我们在2016年正式发起了一项活动，以了解洛杉矶预测性警务的影响，目标是废除该项目，将这些信息带给社区，并予以反击。\n以人为本的预测警务声称，对于那些被称为“相关人员”或“惯犯”的个人，他们可能在过去有过一些历史，我们可以使用风险评估工具来确定他们将再次犯罪。所以这是一个数字游戏。如果他们过去有任何枪支持有，他们会被分配5分。如果他们在假释或缓刑期间，他们会被分配5分。如果他们与帮派有关联，他们会被分配5分。如果他们像截停搜身一样与警方互动，他们会被分配一分。这就是那些正在假释或缓刑或关心自己的事情并重建生活的人被安置在后来被称为慢性罪犯计划的地方，而许多人并不知道这一点。\n然后，根据帕兰提尔正在处理所有数据的风险评估，洛杉矶警察局创建了一份名单。他们已经开始发布公告，就像一张头号通缉海报，上面还有这些人的照片、地址和历史，并把他们放进巡逻车里。他们开始部署车牌阅读器、黄貂鱼、IMSI-Catcher、闭路电视和各种其他技术来追踪他们的行动，然后在地面上创造条件来阻止和骚扰和恐吓他们。我们建设了很多基层电力，2019年4月正式解散了激光行动。它已经停产了。\n现在我们正在追查PredPol，并要求也拆除PredPol。[洛杉矶警察局于2020年4月21日宣布结束PredPol。]。我们废除和废除这个项目的目标不仅仅是垃圾输入，垃圾输出；种族主义数据输入和种族主义数据输出。我们的工作真正植根于它最终服务于父权制、资本主义、白人至上和殖民者殖民主义的整个意识形态框架。\n2018年5月，我们发布了一份关于洛杉矶预测性警务的报告，名为“子弹击中身体之前”，这导致洛杉矶市就数据驱动的警务举行了公开听证会，这在全国尚属首次。我们要求监察长对PredPol进行法医审计。2019年3月，监察长发布了审计报告，称我们甚至不能审计PredPol，因为这是不可能的。这太，太复杂了。\n算法在警务中没有立足之地。我认为我们明白生命危在旦夕是至关重要的。这种基于位置的警务语言本身就是种族主义的代言人。他们不是来监管坑洞和树木的。他们在那里是为了监管该地点的人。所以地点被定为犯罪，人们被定为犯罪，再过几秒钟，枪就出来了，有人被枪杀。\n公共记录是获取信息的一个非常好的工具。这个节目的由来是什么？我们想知道：我们的愿景是什么？它是如何表达的？这笔资金的用途是什么？他们使用的词汇是什么？他们向资助者提交的结果是什么？\n他们(洛杉矶警察局)会认为一个地区，一座公寓楼，是热点和区域。在那里，人们被拦下的速度要快得多。每次你拦住某人，这些信息都会进入数据库。它成为一个主要的数据收集计划。\n我们要求他们公布他们掌握的这些人的秘密名单。洛杉矶警方进行了反击，我们确实赢得了公共记录诉讼。所以现在我们有了一份679人的秘密名单，我们现在正在寻求联系。这些都是年轻的个体，主要是大约90%到95%的黑色和棕色。\n该地区的红线为更多的发展，更多的士绅化，更多的驱逐，更多的人流离失所创造了条件。因此，警察成了私有财产的保护者和特权的保护者。\n你对那些相信技术可以帮助缓解警察中的一些问题的人说些什么，比如偏见，因为技术可以是客观的？\n首先，技术不是自己运作的，从设计到生产，再到部署，再到结果，不断地存在着固有的偏见。这不仅仅是人民本身的偏见，而是体制内固有的偏见。\n影响点如此之多，坦率地说，我们的斗争不是为了清理数据。我们的斗争不是为了一个不偏不倚的算法，因为我们根本不相信，即使从数学上讲，也不可能有一个不偏不倚的算法来维持治安。\n第一项人权将是停止实验。我是一个人类，我不是在这里，你只是拆开我的包装，开始在我身上做实验，然后把我打包。我们生活中发生了如此之多的数据通信。从种植园资本主义到种族主义资本主义，再到现在的监督资本主义，我们很容易被买卖。我们的思想和思想已经商品化了。作为人类，作为自然宇宙的一部分，它也会影响我们的创造力。同意是从我们身上制造出来的。\n对于冠状病毒这样的东西，我们当然看到一些人愿意放弃他们的一些数据和一些隐私。您如何看待效用和隐私之间的选择或权衡？\n我们必须真正从更宽广的角度来看待它。回到我们的指导价值观之一：不是一瞬间，而是历史的延续。因此，我们必须审视过去的危机，既有真实的，也有捏造的。\n让我们来看看1984年在洛杉矶举行的奥运会。这导致了洛杉矶警察局和治安部门在公共安全的幌子下最大规模的警察权力扩张和军事化。事情是这样的：“嗯，我们想保证一切安全。”但这不仅成为一种永久的特征和新常态，而且战术也得到了发展。因为街道必须清理，可疑的身体，无人居住的人，被强行移走。据说帮派扫荡已经开始了。因此，年轻的黑人和棕色青年被集体逮捕。这就像1983年，通向1984年。\n到1986-1987年，在洛杉矶，帮派禁令成为一个永久性的特征。这导致了大量的帮派数据库，9个月大的儿童都进入了这些帮派数据库。这就是锤子行动，在那里他们得到了坦克和装甲车，被特种部队用来运送低级别的毒品犯罪，并倒塌和拆毁人们的房屋。\n现在我们又在这一刻了。这不仅仅是警察权力的结构性扩张；我们必须看到警察现在越来越多地扮演社会工作者的角色。过去10年来，这一角色一直在建立。还有大量的医疗和公共服务资金与此相关。例如，在洛杉矶，大约五年前，城市管理者进行了一项审计，他们审查了该市提供的无家可归者服务的1亿美元。你猜怎么着？其中8700万美元给了洛杉矶警察局。\n你能提供一个具体的例子，说明警察使用技术是如何影响社区成员的吗？\n情报主导的警务是一个概念，它起源于英国，来自肯特警察局，大约30年前在美国开始。以情报为主导的警务的中心主题是行为监控。人们的行为需要被监控，然后被处理，这些信息需要共享。人们需要被追踪和追踪。\n一个名为可疑活动报告的程序产生于9/11事件，在这个程序中，几个完全受宪法保护的活动被列为潜在可疑活动。例如，在公共场合拍照，在公共场合使用摄像机，走进基础设施，询问运营时间。它是观察到的行为，合理地表明了犯罪和/或恐怖活动的行动前计划。所以你在观察某人的行为，这合理地表明没有可能的原因。它创造的不是事实，而是一种担忧。投机性和基于直觉的警察是真实存在的。\n我们可以从洛杉矶警局的“看见什么，说什么”节目里拿到号码。我们发现，这对黑人社区的影响是3：1完全不同的。其中约70%的人看到了一些东西，比如一些报道来自洛杉矶以白人为主的社区。因此，现在一个项目正在被武器化，并成为种族形象的许可证。\n我们的目标始终是朝着废除这些计划的方向发展力量，因为你无法对它们进行改革。没有更仁慈、更温和的种族主义，这些计划必须被废除。\n那么，你真的认为改革不会允许在警务中使用这些技术吗？\n我只能谈谈我自己在洛杉矶组织工作35年的历史。这不是变好的问题，而是变得更糟的问题。我认为技术正在推动这一点。当你回顾改革的历史时，我们不断地把头撞到墙上，它就一直回到同样的老一套。我们不能真的假设心灵可以改变，特别是当某人有杀人执照的时候。\n我不是技术专家。我们的谨慎是给技术专家的：你知道的，不要乱跑。跟随社区，遵循他们的指导。", "note_en": "Hamid Khan has been a community organizer in Los Angeles for over 35 years, with a consistent focus on police violence and human rights. He talked to us on April 3, 2020, for a forthcoming podcast episode about artificial intelligence and policing. As the world turns its attention to police brutality and institutional racism, we thought our conversation with him about how he believes technology enables racism in policing should be published now.\n  Khan is the founder of the Stop LAPD Spying Coalition, which has won many   landmark court cases  on behalf of the minority communities it fights for. Its work is perhaps best known for advocacy against predictive policing. On April 21, a few weeks after this interview, the LAPD   announced an end to all predictive policing programs .\n  Khan is   a controversial figure  who has turned down partnerships with groups like the Electronic Frontier Foundation (EFF) because of its emphasis on reform. He doesn’t believe reform will work. The interview has been edited for length and clarity.\n    The work that we do, particularly looking at the Los Angeles Police Department, looks at how surveillance, information gathering, storing, and sharing has historically been used to really cause harm, to trace, track, monitor, stalk particular communities: communities who are poor, who are black and brown, communities who would be considered suspect, and queer trans bodies. So on various levels, surveillance is a process of social control.\n    The Stop LAPD Spying Coalition has a few guiding values. The first one is that what we are looking at is not a moment in time but a continuation of history. Surveillance has been used for hundreds of years. Some of the earliest surveillance processes go back to lantern laws in New York City in the early 1700s. If you were an enslaved person, a black or an indigenous person, and if you were walking out into the public area without your master, you had to walk with an actual literal lantern, with the candle wick and everything, to basically self-identify yourself as a suspect, as the “other.”\n  Another guiding value is that there’s always an “other.” Historically speaking, there’s always a “threat to the system.” There&#39;s always a body, an individual, or groups of people that are deemed dangerous. They are deemed suspect.\n  The third value is that we are always looking to de-sensationalize the rhetoric of national security. To keep it very simple and straightforward, [we try to show] how the information-gathering and information-sharing environment moves and how it’s a process of keeping an eye on everybody.\n    And one of our last guiding values is that our fight is rooted in human rights. We are fiercely an abolitionist group, so our goal is to dismantle the system. We don’t engage in reformist work. We also consider any policy development around transparency, accountability, and oversight a template for mission creep. Any time surveillance gets legitimized, then it is open to be expanded over time. Right now, we are fighting to keep the drones grounded in Los Angeles, and we were able to keep them grounded for a few years. And in late March, the Chula Vista Police Department in San Diego announced that they are going to  equip their drones with loudspeakers to monitor the movement of unhoused people.\n  Can you explain the work the Stop LAPD Spying Coalition has been doing on predictive policing? What are the issues with it from your perspective?\n  PredPol was location-based predictive policing in which a 500-by-500-square-foot location was identified as a hot spot. The other companion program, Operation Laser, was person-based predictive policing.\n  In 2010, we looked at the various ways that these [LAPD surveillance] programs were being instituted. Predictive policing was a key program. We formally launched a campaign in 2016 to understand the impact of predictive policing in Los Angeles with the goal to dismantle the program, to bring this information to the community and to fight back.\n  Person-based predictive policing claimed that for individuals who are called “persons of interest” or “habitual offenders,” who may have had some history in the past, we could use a risk assessment tool to establish that they were going to recidivate. So it was a numbers game. If they had any gun possession in the past, they were assigned five points. If they were on parole or probation, they were assigned five points. If they were gang-affiliated, they were assigned five points. If they’d had interactions with the police like a stop-and-frisk, they would be assigned one point. And this became where individuals who were on parole or probation or minding their own business and rebuilding their lives were then placed in what became known as a Chronic Offender Program, unbeknownst to many people.\n    Then, based on this risk assessment, where  Palantir is processing all the data, the LAPD created a list. They  started releasing bulletins, which were like a Most Wanted poster with these individuals’ photos, addresses, and history as well, and put them in patrol cars. [They] started deploying license plate readers, the stingray, the IMSI-Catcher, CCTV, and various other tech to track their movements, and then creating conditions on the ground to stop and to harass and intimidate them. We built a lot of grassroots power, and in April 2019 Operation Laser was formally dismantled. It was discontinued.\n  And right now we are going after PredPol and demanding that PredPol be dismantled as well. [LAPD  announced an end to PredPol on April 21, 2020.] Our goal for the abolition and dismantlement of this program is not just rooted in garbage in, garbage out; racist data in and racist data out. Our work is really rooted in that it ultimately serves the whole ideological framework of patriarchy and capitalism and white supremacy and settler colonialism.\n  We released a report,  “Before the Bullet Hits the Body,” in May 2018 on predictive policing in Los Angeles, which led to the city of Los Angeles holding public hearings on data-driven policing, which were the first of their kind in the country. We demanded a forensic audit of PredPol by the inspector general. In March 2019, the inspector general released the audit and it said that we cannot even audit PredPol because it’s just not possible. It’s so, so complicated.\n  Algorithms have no place in policing. I think it’s crucial that we understand that there are lives at stake. This language of location-based policing is by itself a proxy for racism. They’re not there to police potholes and trees. They are there to police people in the location. So location gets criminalized, people get criminalized, and it’s only a few seconds away before the gun comes out and somebody gets shot and killed.\n      Public records are a really good tool to get information. What is the origin of this program? We want to know: What was the vision? How was it being articulated? What is the purpose for the funding? What is the vocabulary that they’re using? What are the outcomes that they’re presenting to the funder?\n    They [the LAPD] would deem an area, an apartment building, as hot spots and zones. And people were being stopped at a much faster pace [there]. Every time you stop somebody, that information goes into a database. It became a major data collection program.\n  We demanded that they release the secret list that they had of these individuals. LAPD fought back, and we did win that public records lawsuit. So now we have a secret list of 679 individuals, which we’re now looking to reach out to. And these are all young individuals, predominantly about 90% to 95% black and brown.\n  Redlining the area creates conditions on the ground for more development, more gentrification, more eviction, more displacement of people. So the police became protectors of private property and protectors of privilege.\n  What do you say to people who believe technology can help mitigate some of these issues in policing, such as biases, because technology can be objective?\n  First of all, technology is not operating by itself.  From the design to the production to the deployment to the outcome, there is constantly bias built in. It’s not just the biases of the people themselves; it’s  the inherent bias  within the system.\n  There’s so many points of influence that, quite frankly, our fight is not for cleaning up the data. Our fight is not for an unbiased algorithm, because we don’t believe that even mathematically, there could be an unbiased algorithm for policing at all.\n    The first human right would be to stop being experimented on. I’m a human, and I am not here that you just unpack me and just start experimenting on me and then package me. There’s so much datafication of our lives that has happened. From plantation capitalism to racialized capitalism to now surveillance capitalism as well, we are subject to being bought and sold. Our minds and our thoughts have been commodified. It has a dumbing-down effect as well on our creativity as human beings, as a part of a natural universe. Consent is being manufactured out of us.\n  With something like coronavirus, we certainly are seeing that some people are willing to give up some of their data and some of their privacy. What do you think about the choice or trade-off between utility and privacy?\n  We have to really look at it through a much broader lens.  Going back to one of our guiding values: not a moment in time but a continuation of history. So we have to look at crises in the past, both real and concocted.\n  Let&#39;s look at the 1984 Olympics in Los Angeles. That led to the most massive expansion of police powers and militarization of the Los Angeles Police Department and the sheriff’s department under the guise of public safety. The thing was “Well, we want to keep everything safe.” But not only [did] it become a permanent feature and the new normal, but tactics were developed as well. Because streets had to be cleaned up, suspect bodies, unhoused folks, were forcibly removed. Gang sweeps supposedly started happening. So young black and brown youth were being arrested en masse. This is like 1983, leading to 1984.\n  By 1986-1987 in Los Angeles, gang injunctions became a permanent feature. This resulted in massive gang databases, and children as young as nine months old going into these gang databases. That became Operation Hammer, where they had gotten tanks and armored vehicles, used by SWAT, for delivering low-level drug offenses, and going down and breaking down people’s homes.\n  Now we are again at a moment. It’s not just the structural expansion of police powers; we have to look at police now increasingly taking on roles as social workers.  It’s been building over the last 10 years. There’s a lot of health and human services dollars attached to that too. For example, in Los Angeles, the city controller  came out with an audit about five years ago, and they looked at $100 million for homeless services that the city provides. Well, guess what? Out of that, $87 million was going to LAPD.\n  Can you provide a specific example of how police use of technology is impacting community members?\n  Intelligence-led policing is a concept that comes out of England, out of the Kent Constabulary, and started about 30 years ago in the US. The central theme of intelligence-led policing is behavioral surveillance.  People’s behavior needs to be monitored, and then be processed, and that information needs to be shared. People need to be traced and tracked.\n    One program called Suspicious Activity Reporting came out of 9/11, in which several activities which are completely constitutionally protected are listed as potentially suspicious. For example, taking photographs in public, using video cameras in public, walking into infrastructure and asking about hours of operations. It’s observed behavior reasonably indicative of preoperational planning of criminal and/or terrorist activity. So you’re observing somebody’s behavior, which reasonably indicates there is no probable cause. It creates not a fact, but a concern. That speculative and hunch-based policing is real.\n  We were able to get numbers from LAPD’s See Something, Say Something program. And what we found was that there was a 3:1 disparate impact on the black community. About 70% of these See Something, Say Something reports came from predominantly white communities in Los Angeles. So now a program is being weaponized and becomes a license to racially profile.\n  The goal is always to be building power toward abolition of these programs, because you can’t reform them. There is no such thing as kinder, gentler racism, and these programs have to be dismantled.\n  So, you really think that reform won’t allow for use of these technologies in policing?\n  I can only speak about my own history of 35 years of organizing in LA. It’s not a matter of getting better, it’s a matter of getting worse. And I think technology is furthering that. When you look at the history of reform, we keep on hitting our head against the wall, and it just keeps on coming back to the same old thing. We can’t really operate under the assumption that hearts and minds can change, particularly when somebody has a license to kill.\n  I’m not a technologist. Our caution is for the technologists: you know, stay in your lane. Follow the community and follow their guidance.", "posttime": "2020-06-06 15:21:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,algorithms,种族主义,dismantling,洛杉矶", "title": "废除种族主义警察算法的活动家", "title_en": "The activist dismantling racist police algorithms", "transed": 1, "url": "https://www.technologyreview.com/2020/06/05/1002709/the-activist-dismantling-racist-police-algorithms/", "via": "", "real_tags": ["算法", "种族主义", "洛杉矶"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005409, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正如您可以想象的那样，我在QuestDB的新工作非常忙碌，所以花费的时间比我希望的要长，但我们到了这里。如果你了解我，你就会知道，我对待新事物的第一件事就是，嗯，把事物与它们联系起来！因此，我立即将一台物联网设备连接到QuestDB，看看进展如何。不出所料，它进行得相当顺利。所以事情是这样进行的，从头到尾。\n我必须做的第一件事是启动并运行QuestDB。幸运的是，这非常简单。我想我可以走Docker路线，但正如你可能知道的那样，我并不是Docker的超级粉丝(这在很大程度上是因为它会从字面上吸走MacOS笔记本电脑的生命)。还有(针对MacOS用户的)`BREW install questdb`，但是由于我在这里工作，并且我想测试最新最棒的Web控制台，我决定从源代码开始构建：\n由于缺少外部依赖，它构建得非常快，所以这很棒！那我要做的就是启动它：\n这就是构建和运行QuestDB所要做的全部工作。但这只是第一部分。现在是时候用它做些稍微有用的事情了。首先，我需要在QuestDB中创建一个表来存储我的物联网数据(稍后将对此稍作介绍，因此存储一个指向此的指针)。\n记住，我们在这里做SQL，所以没有新的语言或语法需要学习。这是我正在建造的一张非常简单的桌子，因为我将使用一台ESP8266，上面有一个(非常糟糕的)DHT11温度和湿度传感器。\n为此，我将使用基于ESP8266的WEMOS D1 Mini，因为我周围恰好有一大堆。我批量购买它们，因为它们每件1美元或2美元，使用方便，如果我炸毁一个，大部分都是一次性的(我经常这样做)。该电路非常简单：\n我使用的是带有DHT11的真实Wemos盾，所以我不需要给它加面包板，但是这个示意图让你了解布线有多简单。它的字面意思是3根电线。\n这里就是魔术发生的地方。我实际上是如何将传感器数据发送到数据库的。Adafruit DHT统一传感器库中包含一个简单的示例程序，我建议您从该程序开始，这样做会更容易一些。它已经有了可以从传感器读取的所有部件，所以您不必从头开始写入这些部件。记住：好的开发人员会复制，但优秀的开发人员会粘贴！\n由于我使用的是8266，而且我需要互联网连接，所以我需要所有的WiFi位：\n实际上，您所要做的就是进入“草图”菜单，选择“包含库”，然后选择“ESP8266WiFi”库，您就可以为您导入所有这些内容。\n以下是一些样板代码，您可以随时使用它们将ESP8266安装到您的WiFi上：\n这就完成了基本的设置。运行该命令应该会获得WiFi连接和完全配置的DHT11传感器。我们几乎准备好开始向数据库发送数据了。\n如果您注意了，并阅读了代码，您就会注意到我偷偷溜进去的UDP内容。这是因为我们将使这件事变得超级简单，并使用UDP来发送我们的数据。这其中有一个非常好的原因：InfluxDB线路协议。您可以看到，QuestDB有一个内置的InfluxDB Line Protocol侦听器，但是(目前)它只侦听UDP端口。所以我们要利用这一点。\n是啊，那里发生了很多事。所以让我们把它分解一下。首先，我创建一个缓冲区来保存我要发送的数据，然后我将读取传感器。我将`temp`和`hum`变量设置为我知道传感器永远不会返回的值，以便稍后可以检查我是否获得了有效的读数，以避免向数据库发送胡言乱语。\n我不得不对里面的温度和湿度值做一些恶作剧，因为Arduinos的一个缺点是他们没有对双打的“冲刺”支持。我知道呀。所以我只是把它们变成弦，然后继续前进。一旦他们到达数据库，他们就被解释为替身，生活就很好了。不值得为之争吵。然后，我可以使用直线协议构建一个缓冲区，并通过UDP将其发送到QuestDB。\n还记得我之前告诉过您要设置创建数据库的指针吗？好了，这就是我要回到这一点的地方。实际上，您不必提前创建数据库，除非您想做一些事情，如设置索引等。如果您想做的只是在其中有直接的值，那么猜猜会怎样呢？在这里，写入时模式是一件事。您只需开始将数据写入数据库，它就会很高兴地为您存储这些数据。很酷的东西。\n然后，您可以使用QuestDB控制台查询数据，以确保获得预期的结果：\n现在是开始在此基础上构建一些仪表板等的时候了。我目前正在努力将这一切与Node Red联系起来，所以这可能是我的下一篇帖子。我们也在致力于对Grafana的支持，这将是巨大的，所以请继续关注。如果您喜欢这里看到的内容，请在GitHub上给我们打一颗星，如果您想获得最新消息，请关注该项目！", "note_en": "As you can well imagine, I’ve been super busy in my hew job at QuestDB so this has taken me longer than I would have liked, but here we are. If you know me at all, you know that one of the first things I always do with new things is, well, connect things to them! So I immediately went to connect an IoT device to QuestDB to see how it went. Unsurprisingly, it went quite well. So here’s how it went, from start to finish.\n  The first thing I had to do was a to get QuestDB up and running. Luckily, this is very straightforward. I guess I could have gone the Docker route, but as you’re probably aware, I’m not a huge fan of Docker (in no small part due to the fact that it will literally suck the life out of a MacOS laptop). There’s also (for you MacOS users) `brew install questdb` but since I work here, and I wanted to test out the latest and greatest web console, I decided to build from source:\n  It builds really quickly due to the lack of external dependencies, so that is great! Then all I have to do is start it:\n  That is literally all there is to getting QuestDB built and running. But that’s just the first part. Now it’s time to do something mildly useful with it. First, I’ll need to create a table in QuestDB to store my IoT Data (A bit more on this later, so store a pointer to this).\n  Remember, we’re doing SQL here, so it there’s no new language or syntax to learn. This is a really simple table that I’m building because I’m going to be using an ESP8266 with a (really awful) DHT11 temperature and humidity sensor on it.\n  For this I’m going to use an ESP8266-based WEMOS D1 Mini only because I happen to have a giant pile of them lying around. I buy them in bulk because they are a dollar or 2 each, easy to use, and largely disposable if I blow one up (which I do with alarming regularity.). The circuit is extremely simple to do:\n  I used an actual WEMOS Shield with the DHT11 on it, so I didn’t have to breadboard it, but this schematic gives you an idea of how simple the wiring is. It’s literally 3 wires.\n  Here is where the magic happens. How I actually send the sensor data to the database. There is a simple example program included with the Adafruit DHT Unified Sensor Library that I recommend starting with in order to make this a bit easier. It already has all the parts to read from the sensor so you don’t have to write those from scratch. Remember: Good developers copy, but great developers paste!\n Since I’m using the 8266, and I’ll need internet connectivity, I’ll need all the WiFi bits:\n  Really all you have to do is go to the ‘Sketch’ Menu, Choose ‘Include Library’ and select the ‘ESP8266WiFi’ library and you get all this stuff imported for you.\n Here’s some boiler-plate code you can always use to get your ESP8266 on your WiFi:\n  That gets the basics set up. Running that should get you a WiFi connection and a fully configured DHT11 sensor. We’re almost ready to start sending data to the database.\n If you were paying attention, and read the code, you’ll have noticed the UDP stuff I snuck in there. That’s because we’re going to make this super easy and use UDP to send our data. And there’s a  really good reason for that: InfluxDB Line Protocol. You see, QuestDB has a built-in InfluxDB Line Protocol listener, but (for now) it’s only listening on a UDP port. So we’re going to use that.\n    Yeah, there’s a lot going on in there. So let’s break it down. First, I’m creating a buffer to hold the data I’m going to send, and then I’ll do a read of the sensor. I set the `temp` and `hum` variables to values that I know the sensor will never return so that I can check that I got valid readings later, to avoid sending gibberish to the database.\n I have to do some shenanigans with the temperature and humidity values in there because one of the shortcomings of Arduinos is that they don’t have `sprintf` support for doubles. I know. So I simply turn them into strings and move on. Once they arrive at the database, they are interpreted as doubles and life is good. Not worth fighting about. I can then construct a buffer with straight line protocol and ship it off to QuestDB over UDP.\n   Remember I told you to set a pointer earlier about creating the database? Well, here’s where I come back to that. You don’t  actually have to create the database ahead of time  unless you want to do things like set indexes, etc. If all you want to do is have straight values in there, then guess what? Schema-on-write is a thing here. You can just start writing data to the database, and it will happily store them for you. Pretty cool stuff.\n  Using the QuestDB Console, you can then query the data to make sure you’re getting what you expect:\n    Now it’s time to start building some dashboards, etc. on top of this. I’m currently working on connecting this all up with Node Red, so that may be my next post. We’re also working on support for Grafana, which will be huge, so stay tuned for that. If you like what you see here, pleases go give us a star on  GitHub, and follow the project if you’d like to get updates!", "posttime": "2020-06-06 14:32:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "物联网,联网,iot,questdb", "title": "QuestDB上的物联网", "title_en": "IoT on QuestDB", "transed": 1, "url": "https://davidgs.com/2020/iot-on-questdb/", "via": "", "real_tags": ["物联网", "联网", "iot", "questdb"]}, {"category": "", "categoryclass": "", "imagename": "276d593ca089e26a3581647e6f177894.png", "infoid": 1005408, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "互联网上流传着一则关于eBay端口在没有任何许可甚至没有迹象的情况下扫描访问者的故事(没有深入研究浏览器的开发工具)-这绝对是真的。但是他们为什么要这么做，eBay在用它收集的数据做什么呢？我瞥了一眼代码找出了答案(改编自这个帖子)，我确信我找到的只是整个故事的一小部分。\n和许多人一样，这一传奇故事始于推特(Twitter)为了低俗的笑声而在一个品牌上扣篮。VPN提供商NordVPN分享了博客作者查理·贝尔默(Charlie Belmer)的网站NullSweep发布的一篇帖子，题为“为什么这个wbesite端口扫描我？”诺德还声称浏览器扩展(大概是他们的)可以防止“非法”端口扫描(它们不是非法的)。每天都有数以万计的人在世界各地的港口扫描互联网，既有合法的研究原因，也有支持恶意目的的人。从表面上看，这种说法是荒谬的，因为来自互联网的典型端口扫描直接瞄准了将网络连接到互联网的任何路由器、防火墙和网关(以及通过它们设置的服务器和PC机)-浏览器根本没有办法坐在中间，更不用说浏览器扩展了，它根本没有办法坐在中间挡住端口扫描器。\n实际上，NullSweep实际上是在讨论一种不同类型的端口扫描，一种由目标在其浏览器中加载的网站直接发起的端口扫描。这是一种巧妙的技术，如果不是阴险的话，它允许潜在的端口扫描器直接进入内部网络，并在浏览器上下文中使用Javascript进行扫描。\n顺便说一句，这是浏览器扩展可以屏蔽的东西，然而，端口扫描背后的公司使用技术来阻止他们的跟踪器的广泛屏蔽，正如我们稍后将看到的那样。\n虽然现代浏览器允许Javascript向您当前访问的域名(如www.ebay.com)以外的其他域名发出请求，但它们会添加安全控件，以确保目标数据允许调用网站访问。例如，这可以防止恶意网站向您的银行网站请求帐户详细信息。但是，即使不知道远程站点的内容，也可以使用有关连接本身的详细信息(如连接所需的时间或超时)来推断给定主机和端口上是否存在网站。一小段Javascript代码就可以将其打包到一个包中，并允许任何站点扫描用户的内部网络，从而确定哪些IP地址和端口正在运行服务。此外，由于许多众所周知的服务通常在同一端口上可用(有一个注册页面，但它更多的是一条指导方针，而不是一条严格的规则)，因此还可以根据端口是否打开来推断用户可能在其网络上运行某些程序。\n正如NullSweep的文章中指出的，eBay只扫描用户的本地PC(IP地址为127.0.0.1)，并寻找远程桌面软件常用的一小部分端口。有趣的是，查理试着安装了其中一个应用程序，却没有注意到eBay的运行方式有什么不同，那么他们在用它做什么呢？我决定加载这个网站并找出答案。\n就在这个时候，我发现了“黑暗日记”播客主持人杰克·莱西德(Jack Rhysider)在Twitter上发布的一篇关于同一话题的帖子，他从理论上分析了eBay可能会这么做的一系列原因，这进一步激起了我的兴趣。在尝试本地加载eBay时，我发现即使在欺骗了Windows用户代理并禁用了所有扩展之后，我也无法在Linux中复制该行为。一定有一些支票隐藏在Javascript中，但到目前为止我还没有找到。在那之后，我加载了WindowsVM，安装了最新的Edge，启动了https://www.ebay.com，，最后我复制了端口扫描行为。然而，我在可靠地复制该行为时遇到了一些问题，经过反复试验，我发现https://signin.ebay.com/was触发端口扫描的可靠性要高得多。\n在浏览器开发工具中，我能够跟踪启动到127.0.0.1的连接的代码，追溯到执行Blob URL的服务工作人员。Blob URL是链接到由Javascript生成的任意文件的特殊URL，但也可以在HTML元素href中使用，就像它是到静态图像或视频的链接一样。根据我的经验，这些通常被用作DRM模式的一个组件，以使从网页上抓取音乐或视频等内容变得不方便(但并非不可能)。我不知道这是否是这里的目的，但这肯定会给调试过程带来挫折，因为这意味着每个扫描源都来自一个随机生成的Blob URL，并且每次我加载页面时都是不同的。\n最终，我追踪到了一个新的Blob(.)。构造函数，并有机会设置断点。正如您在下面的屏幕截图中看到的，代码被严重混淆。TD_L1、TD_1D等，所有这些都是为了使代码难以调试并找出实际发生的事情。此外，您在屏幕截图中看不到它，但是所有这些Javascript在每次页面加载时都会被重新混淆。名为TD_L1的变量下一次可能被命名为TD_9I，这使得在不小心刷新页面时很难回溯您的步骤，因为所有的变量名称都是乱七八糟的。\n尽管存在混淆，但代码并没有什么真正的“魔力”-它执行的指令与消除混淆的代码执行的指令相同-因此，通过访问调试器和明智地放置断点，您可以在某个时间点停止代码并检查程序的整个状态。浏览器调试工具真是令人难以置信。\n我的第一个任务是查看这个Blob的代码是如何生成的，因为搜索源代码中的单个位没有给出任何结果。上面的屏幕截图显示了对td_z5.join(&#34；&#34；)的调用，该调用将字符数组转换为单个字符串。现在，我不是反向工程或恶意软件猎人，甚至也不是业余的，但我以前看过打包的Javascript，这种技术似乎是保护代码不受反向工程影响的常用方法(通常没有很好的理由)。再说一次，所有这些都不是非法的，但当我知道公司会不遗余力地向客户隐瞒跟踪和扫描数据时，我仍然感到有点怀疑。\n在进一步的代码中，您可以看到证据表明，是的，这是一个专用的端口扫描器，而不是eBay访问本地主机上的服务的其他(有争议的)合法理由(是的，您可以使用本地Web服务器做一些很酷的事情，但通常当出现问题时，您只会在新闻中看到它)。\n所有这些Javascript都来自URL中的脚本文件，如下所示：\n会话ID似乎是在每个页面加载时随机生成的，但是不要松一口气-我不太希望这意味着您的数据是匿名的。\n在遍历代码时，我最终得出结论，扫描的结果与所有扫描结束后加载的一张奇怪的图像相关联。url、https://src.ebay-us.com/fp/clear.png，链接到与扫描脚本相同的域。这个域不用于加载任何其他脚本图像，因此它似乎是一个可遵循的线索。\n对URL一无所知，“clear.png”让我觉得它可能是像素，通常是1x1的透明图像，用来触发有人查看该图像的信号，但在下面的开发工具屏幕截图中，你可以看到一些奇怪的东西。响应代码是“204No content”。指向此PNG的URL没有返回图像-它根本没有返回任何内容！\n如果这个特定的扫描被用来检测欺诈，我本以为eBay会收到某种欺诈分数来回应这个请求，但看起来这些数据只是被扔到母船上供以后使用。或者他们可能是从这个俄罗斯黑客组织那里得到了启示，这个组织使用HTTP状态码作为控制协议本身(只是开玩笑)。\n现在我们知道收集的数据正在做什么，我想知道到底是什么，被发送到远程服务器？完整的png url如下所示：\n很多字母和数字，数据能被加密吗？是的，事实上，进一步的研究使我找到了一个传入了两个变量的Javascript函数：\n在仔细检查了一下代码之后，我能够确定它使用了位移位和XOR将整个有效负载加密成16进制字母表(是的，XOR是一种很差的加密方法，但是明文与密钥进行XOR是加密的)。我将加密方法转换为Python，然后反转以构建解密器。遵循完整加密/解密实现的要点URL。该脚本还可以从Python3中的终端运行，以解密加密的clear.png URL并打印清除文本有效负载。\ndef deccrypt(encr，key)：alpha=&#34；0123456789abcdef&#34；message=[]last=None for IDX，(char，keychar)in Enumererate(zip(ENCR，Cycle_Two(Key)：如果IDX%2==0：last=char继续加密=alpha。索引(最后)&lt；&lt；4|alpha。索引(字符)消息。append(chr(crypt^order(Keychar)&amp；10))CONCAT=&#39；&#39；。Join(Message)Length，Sep，msg=CONCAT。分区(&#39；&amp；&#39；)if len(Length)==0：如果len(Msg)！=int(Length)：提高值错误(&#34；错误解码消息&#34；)返回msg。\n有了一个解密渗出的数据的工具，我开始检查有多少数据被发送到src.ebay-us.com域。易趣签到页面的一次加载总共有七张图片，而且所有图片都发送了不同的数据。\n这些数据包括一些个人信息(欧盟读者可能想检查一下他们是否受到了影响，以及它是否符合GDPR的规定)。\n这些数据会被发送到易趣域名，但似乎不会以其他方式使用\n如果eBay没有用它来决定是否应该允许你在那里登录，它对这些数据做了什么？在这一点上，我熬夜了，而且相当疲惫，所以我完全错过了一个非常可疑的指标-数据被泄露的域名不是ebay.com的子域名-它是eBay-us.com。尽管如此，快速检查一下就会发现它属于易趣的某个人，所以至少它不是钓鱼恶意软件。推特用户“扶手椅IR”指出，Facebook也看到了类似的行为，并追踪到一家名为ThreatMetrix的公司，这是一家身份跟踪/反欺诈公司。查看src.ebay-us.com的DNS记录，肯定是ThreatMetrix公司拥有的域名h-ebay.online-metrix.net的CNAME。\n搜索“online-metrix.net”域名显示，有些人和AdBlock扩展试图禁止此域，这可能是为什么ThreatMetrix设置了一个特定于客户的端点，并让他们的客户通过与ThreatMetrix无关的他们自己的端点清洗(这可能不是正确的术语LOL)域。\ncrt.sh关于这个域名的最早记录可以追溯到2013年，所以eBay可能已经扫描客户的电脑将近七年了，而没有太多的人注意到这一点。Online-metrix.net使用通配符证书，所以不幸的是，列举他们的客户并不那么容易，但还有进一步调查的空间。\n新闻报道称，LexisNexis于2018年收购了ThreatMetrix，他们的新主页笼统地讲述了他们的数据将如何被用来打击欺诈。他们声称，他们“分析了来自全球3万多个网站的1.5亿多笔日交易量”，因此似乎有理由相信，他们收集的所有数据都会直接进入一个与所有客户共享的大型数据库。\nLexID Digital结合了唯一标识符、置信度分数和平均曲线图，真正了解用户在所有渠道和接触点的独特数字身份。\n设计隐私：我们独一无二地解决了通过使用标记化在维护数据隐私的同时提供身份动态风险评估的挑战。\n僵尸和恶意软件威胁情报：针对恶意软件、远程访问特洛伊木马(RAT)、自动僵尸攻击、会话劫持和网络钓鱼账户的可行威胁检测，结合已知诈骗者和僵尸网络参与等全球威胁信息。\n最后，他们有一个名为“真实位置”的声明，听起来有点像他们试图让使用VPN的人去匿名化。\n真实位置和行为分析：检测位置伪装或IP欺骗、代理、VPN、ToR浏览器和行为模式的变化，如异常交易量。\n这不仅仅是eBay扫描你的端口，据说还有一个由3万个网站组成的网络，所有这些网站都在为共同的目标工作，即收集开放的端口，收集IP地址，以及用户代理，试图跟踪整个网络上的用户。这并不是eBay内部的一些流氓团队想要绕过法律，你可以打赌，LexisNexis的律师在将这项服务扩展到他们的客户(至少在美国)时已经完全覆盖了他们的基础。", "note_en": "There’s a story going around the internet about Ebay port scanning its visitorswithout any permission or even indication that it’s happening (without digginginto the browser’s developer tools) - it’s absolutely true. But why are theydoing it, and what is Ebay doing with the data it collects? I took a peek intothe code to find out (adapted from  this thread),and I’m sure what I found is only a small part of the full story.\n The saga began, like many do, with Twitterlings dunking on a brand for cheap laughs.VPN provider NordVPN  shared a postfrom blogger Charlie Belmer’s site, NullSweep, entitled  “Why is this wbesite portscanning me?”. Nordalso claimed that browser extensions (presumably theirs), could protect against“illegal” port scans (they are not illegal). There are tons of people across theworld port scanning the internet daily, both for legitimate research reasons andto support malicious aims. On the face of it, the claim is absurd, because typicalport scans coming from the internet at large are aimed squarely at any routers,firewalls, and gateways that join a network to the internet (and servers and PCsexposed through them) - there simply is no way for a browser, let alone a browserextension, to sit in the middle and fend off port scanners.\n In reality, NullSweep was actually discussing a different type of port scanning,one initiated directly by a website the target loads in their browser. It’s aningenius, if not insidious, technique that allows would-be port scanners toparadrop straight into an internal network and scan it using Javascript fromwithin the browser context.\n As an aside, this  is something that a browser extension could block, howeverthe company behind the port scanning uses techniques to prevent widespreadblocking of their trackers, as we’ll see later.\n  While modern browsers allow Javascript to make requests to other domain namesthan the one you’re currently visiting (e.g.  www.ebay.com), they layer onsecurity controls to ensure the target data allows the calling website to accessit. This prevents, for example, a malicious website from requesting the accountdetails from you bank’s website. However, even without knowing the  contentsof the remote site, details about the connection itself (such as the time ittakes to connect or time out) can be used to infer whether or not a websiteexists at the given host and port. A bit of Javascript code can wrap that intoa package and allow any site to scan a user’s internal network, determiningwhich IP addresses and ports have services running. Further, because manywell-known services are commonly available on the same port (there is a registration page,but it’s more of a guideline than a hard and fast rule), it’s possible to alsoinfer some programs that a user  may be running on their network depending onwhether the port is open or not.\n  As noted in NullSweep’s article, Ebay is scanning only the user’s local PC,IP address 127.0.0.1, and looking for a small selection of ports commonly usedby remote desktop software. Interestingly, Charlie tried installing one of thoseapplications and didn’t notice anything different about how Ebay behaved, sowhat  are they doing with it? I decided to load the site and find out.\n  It was at about this time that I found a  Twitter postfrom Jack Rhysider, host of the Darknet Diaries podcast, on the same topic.He theorized a number of reasons why Ebay might be doing this, and it piqued myinterest even further. In trying to load Ebay locally I found that I couldn’treplicate the behavior in Linux even after spoofing a Windows User Agent anddisabling all of my extensions. There must be some check hidden in the Javascript,but as of yet I haven’t found one. After that, I loaded a Windows VM, installedthe latest Edge, fired up  https://www.ebay.com, and I finally replicatedthe port scanning behavior. However, I had some trouble replicating thebehavior reliably, and after some trial and error I found that  https://signin.ebay.com/was far more reliable for triggering the port scanning.\n In the browser developer tools I was able to trace the code that launchedthe connection to 127.0.0.1 back to a service worker executing a Blob URL.Blob URLs are a special URL linking to an arbitrary file generated by Javascript,yet can be used in HTML element hrefs as if it were a link to a static image orvideo. In my experience, these are commonly used as a component of DRM schemesto make it inconvenient (but not impossible) to scrape content like music orvideos from a web page. I don’t know if this was the intention here, but itcertainly added frustration to the debugging process because it meant each scanorigin came from a Blob URL that was randomly generated and different each timeI loaded the page.\n  Eventually, I traced the calls to a  new Blob(...) constructor and had theopportunity to set a breakpoint. As you can see in the screenshot below, thecode is heavily obfuscated.  td_L1,  td_1D, etc. it’s all meant to makethe code difficult to debug and find what’s really happening. Additionally,and you can’t see it in the screenshot, but all of this Javascript is  re-obfuscatedon  every page load. A variable named  td_L1 now may be named  td_9I next time.This makes it very difficult to retrace your steps if you accidentally refreshthe page because all of the variable names are shuffled around.\n  Despite the obfuscation, there is nothing truly “magic” about code - it executesthe same instructions that the deobfuscated code would - so with access to a debuggerand judiciously placed breakpoints, you can stop the code at a point in time andinspect the entire state of the program. Browser debugging tools are truly incredible.\n My first order of business was to see how the code for this Blob was generated,because searching for individual bits in the source did not yield me any results.The screenshot above shows a call to  td_z5.join(&#34;&#34;), which turns an array ofcharacters into a single string. Now, I’m not a reverse engineer or a malwarehunter, not even an amateur, but I have looked at packed Javascript beforeand this technique seems to be a common way to protect code from reverseengineering (and usually not for good reasons). Again, none of this is illegal,but it still makes me feel a bit suspicious to know companies are going to suchlengths to hide tracking and scanning data from its customers.\n  Further on in the code you can see evidence that yes, this is a dedicated portscanner and not some other (debatably) legitimate reason for Ebay to be accessing aservice on localhost (yes, there are cool things you can do with local webservers, but usually you just see it in the news when something goes wrong).\n    All of this Javascript comes from a script file at a URL like this one:\n  The session ID seems to be randomly generated on each page load, but don’t breathea sigh of relief yet - I don’t have high hopes that this means your data is anonymized.\n When stepping through the code, I eventually concluded that the results of thescan were linked to an odd image that was being loaded after all of the scanningdied down. The URL,  https://src.ebay-us.com/fp/clear.png, links to the samedomain as the scanning script. This domain isn’t used to load any other scriptsor images, so it seemed like a lead to follow.\n  Knowing nothing else about the URL, “clear.png” makes me think it might be atracking pixel, which are often 1x1 transparent images used to trigger asignal that someone has viewed the image, yet in the dev tools screenshotbelow you can see something kind of odd. The response code is “204 No Content”.The URL to this PNG isn’t returning an image - it’s returning nothing at all!\n  If this specific scan was being used for fraud detection, I would have expectedthat Ebay would receive some sort of fraud score in response to this request,but it seems the data is simply being tossed to the mother ship for later use.Or maybe they’re taking a cue from  this Russian hacker group,which uses HTTP status codes as the control protocol itself (just kidding).\n Now that we know what’s being done with the collected data, I wondered what,exactly  was being sent to a remote server? The full PNG url looks somethinglike this:\n  Lots of letters and numbers, could the data be encrypted? Yes, in factfurther research led me to a Javascript function with two variablespassed in:\n    After stepping through the code a bit, I was able to identify that it uses bitshifting and XOR to encrypt the entire payload into a base-16 alphabet (yes,XOR is a poor encryption method, but plaintext XORed with a key is encryptionnonetheless). I translated the encryption method into Python and thenreversed it to build a decryptor. Follow the gist URL for the fullencryption/decryption implementation. The script can also be run fromthe terminal in Python3 to decrypt an encrypted  clear.png URL and print thecleartext payload.\n   def  decrypt ( encr ,  key ):  alpha  =  &#34;0123456789abcdef&#34;  message  =  []  last  =  None  for  idx ,  ( char ,  keychar )  in  enumerate ( zip ( encr ,  cycle_twice ( key ))):  if  idx  %  2  ==  0 :  last  =  char  continue  crypt  =  alpha . index ( last )  &lt;&lt;  4  |  alpha . index ( char )  message . append ( chr ( crypt  ^  ord ( keychar )  &amp;  10 ))  concat  =  &#39;&#39; . join ( message )  length ,  sep ,  msg  =  concat . partition ( &#39;&amp;&#39; )  if  len ( length )  ==  0 :  return  concat  if  len ( msg )  !=  int ( length ):  raise  ValueError ( &#34;Error decoding message&#34; )  return  msg\n With a tool for decrypting the exfiltrated data, I set about checking how muchdata was being sent out to the  src.ebay-us.com domain. There were seven imagesin all for one load of the Ebay sign in page, and all of them sent differentdata.\n  The data included some personal bits (EU readers may want to check whether they’reaffected and whether or not it adheres to GDPR regulations)\n    This data is shipped to an Ebay domain, but does not seem to be used otherwise\n If Ebay isn’t using it to decide whether you should be allowed to log in rightthere, what  is it doing with the data? At this point, I’d stayed up lateand was pretty tired, so I totally missed one hugely suspicious indicator - the domain where data is exfiltrated is  not a subdomain of  ebay.com - it’s ebay-us.com. Still, a quick check shows that it’s owned by somebody atEbay, so at the very least it isn’t phishing malware. Twitter user Armchair IR pointed out that similarbehavior has been seen by Facebook and it traced to a company called ThreatMetrix,an identity tracking/anti-fraud company. Checking the DNS recordsfor  src.ebay-us.com, sure enough it’s a CNAME to  h-ebay.online-metrix.net,a domain  owned by ThreatMetrix Inc.\n A search for the domain “online-metrix.net” shows that some people and adblock extensions have tried banning this domain, which is likely why ThreatMetrix setsup a customer-specific endpoint and has their customers launder (this is probablynot the correct terminology lol) the domain through one of their own that isn’tassociated with ThreatMetrix.\n The earliest record at crt.sh for this domain dates back all the way to 2013, so it’s possible that Ebay has beenscanning customers’ computers for almost seven years without too many peoplenoticing.  online-metrix.net uses wildcard certificates, so unfortunatelyit’s not so easy to enumerate their clients, but there is room for furtherinvestigation.\n News reports say that  LexisNexis acquired ThreatMetrix in 2018,and  their new homepagetalks in general terms about how their data will be used to fight fraud.They claim that they “analyze more than 150 million daily transactions from more than 30,000 websites worldwide”, so it seems fair to believe that all ofthis data they’re collecting goes straight into one massive database sharedwith all of their customers.\n  LexID Digital combines a unique identifier, a confidence score and avisualization graph to genuinely understand a user’s unique digital identityacross all channels and touchpoints.\n Privacy by Design: We uniquely solve the challenge of providing dynamic riskassessment of identities while maintaining data privacy through the use oftokenization.\n   Bot and Malware Threat Intelligence: Actionable threat detection for Malware,Remote Access Trojans (RATs), automated bot attacks, session hijacking andphished accounts, combined with global threat information such as knownfraudsters and botnet participation.\n And, finally, they have a claim called “True Location” which sounds a bit likethey attempt to de-anonymize people using people using VPNs.\n True Location and Behavior Analysis: Detection of location cloaking or IPspoofing, proxies, VPNs, Tor browsers and changes in behavior patterns, such asunusual transaction volumes.\n It’s not just Ebay scanning your ports, there is allegedly a network of 30,000websites out there all working for the common aim of harvesting open ports,collecting IP addresses, and User Agents in an attempt to track users all acrossthe web. And this isn’t some rogue team within Ebay setting out to skirt the law,you can bet that LexisNexis lawyers have thoroughly covered their bases whenextending this service to their customers (at least in the U.S.).", "posttime": "2020-06-06 14:15:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "port,数据", "title": "eBay正在对其网站的访问者进行端口扫描", "title_en": "eBay is port scanning visitors to their website", "transed": 1, "url": "https://blog.nem.ec/2020/05/24/ebay-port-scanning/", "via": "", "real_tags": ["port", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005407, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "鱼就像思想和预感", "note_en": "fish are like thoughts and premonitions", "posttime": "2020-06-06 13:58:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "special,思想", "title": "Special.fish", "title_en": "Special.fish", "transed": 1, "url": "https://special.fish/", "via": "", "real_tags": ["special", "思想"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005406, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "不用去商店就能制造或修理东西通常很有帮助：也许事情紧急，也许你没有车，也许大流行，也许你有一个想法，想在兴趣消退之前先试一试。在烹饪中，你手头的食物通常被称为食品储藏室主食；DIY项目值得储备的等值消耗品是什么？2x4s：1.5；×3.5；通常是8&39；，非常坚固，但不是无限坚固，有大量的木头可以放入紧固件中。(编者注：在烹饪过程中，你手头的食物通常被称为食品储藏室主食)；在DIY项目中，同样值得储备的消耗品是什么？通常是8&39；，非常坚固，但不是无限坚固。如果你需要发帖的话，可以加倍。买一些2x3s也是值得的(更便宜；当2x4超出你的需要时很有用)和2x6s(更结实，可以跨越更远的距离，可能恰好是一个有用的厚度)。我不会储备2x8或更大的，因为如果我需要这些东西，我可能正在做一个足够大的项目，不管怎样，我会得到更多的材料。\n胶合板：有4x8张床单，但是这些床单太大，放不下我的地下室楼梯，所以我通常会先把床单剪成三张16；34；或两条24&34；条放在商店的面板锯上。我通常会买到AB(一面不错，一面像样)软体，因为它相当便宜，易于操作，而且在砂纸打磨时足够吸引人，所以我不介意它在室内。有一些胶合板可以用来做较轻的东西和调整间距。\n螺丝：你需要一些方法将它们连接在一起，螺丝是一个很好的默认选择。传统的标准紧固件是钉子，但我发现螺钉更适合小型项目。我喜欢这里没有锤子击打的东西，也没有需要支撑的东西。从历史上看，人们更喜欢钉子，因为钉子的剪切强度更高，但在这里螺丝实际上非常好。星形(环型)螺丝比十字(加型)螺丝要美观得多，因为钻头更容易固定在螺丝上。你至少需要3&34；(把两个2x4)、2/4；(在2x4的平板上贴上胶合板)和1/5&34；(在更多的胶合板上贴上胶合板)，不过我也发现了1/3；、3/4；和3/5&34；的尺寸足够有用，可以放在手边。\n胶水：木胶，也可以直接用白胶。在把两块木头拼在一起之前，考虑加一点胶水。您将得到一个更坚固的关节，螺丝提供灯不需要额外的努力。由于螺丝在那里，你通常不需要等待胶水干了再继续，这消除了使用胶水的正常缺点。\n废料：当你完成一个项目时，保留你的废料，特别是那些不寻常材料的废料。这一系列怪异的形状可以提供灵感，让你重新寻找怪异的东西，或者让你不需要切割更大的一块。\n如果您正在重新订购某些特殊用途的物品，但您不想同时订购订书机，或者在获得新部件之前不知道您到底想要什么，那么手头备有这些订书机也是不错的选择：\n我用这种方式做的每件事都有一点自制的样子，但我真的很喜欢我能很快做出各种坚固的东西。", "note_en": "It&#39;s often helpful to be able to build or fix things without needingto go to the store: perhaps it&#39;s urgent, perhaps you don&#39;t have a car,perhaps there&#39;s a pandemic on, perhaps you have an idea that you wantto try out before your interest fades. In cooking, the foods that youkeep on hand are often called &#34;pantry staples&#34;; what are theequivalent consumables worth stocking for DIY projects?   2x4s: 1½&#34; by 3½&#34; by generally 8&#39;, very strongthough not infinitely so, lots of wood to sink a fastener into. Canbe doubled up if you need to make a post. It can be worth gettingsome 2x3s as well (cheaper; useful when a 2x4 is more than you need)and 2x6s (stronger; can span a wider distance; might happen to be auseful thickness). I wouldn&#39;t stock 2x8s or bigger since if I needthose I&#39;m probably working on a big enough project that I&#39;m gettingmore materials anyway.\n ¾&#34; plywood: comes in 4x8 sheets, but these areunwieldy and too big to fit down my basement stairs so I usually havethe sheets cut into three 16&#34; or two 24&#34; strips on the store&#39;s panelsaw first. I usually get AB (one nice side, one decent side) softwoodsince it&#39;s reasonably cheap, easy to work with, and attractive enoughwhen sanded that I don&#39;t mind it indoors. Having some ¼&#34; plywoodcan be useful for lighter things and spacing adjustments.\n screws: you need some way to attach these together, andscrews are a good default. Traditionally the standardfastener would be nails, but I find screws are a better fit for smallprojects. I like that there&#39;s no hammer blow to knock things out ofalignment or need to be braced against. Historically people havepreferred nails because of higher shear strength, but screws areactually  verygood here. Star-drive (torx) screws are a lot more pleasant thanPhillips (plus-shaped) because the bit stays on the screw moreeasily. You want at least 3&#34; (attaching two 2x4s), 2¼&#34; (attaching¾&#34; plywood to the flat side of a 2x4), and 1½&#34; (attaching ¾&#34;plywood to more ¾&#34; plywood) though I&#39;ve also found ½&#34;, ¾&#34;, 1¼&#34;, and 3½&#34; sizes useful enough to keep on hand.\n glue: wood glue, or you can just use white glue. Beforescrewing two pieces of wood together consider putting in a bit ofglue. You&#39;ll get a much stronger joint, and the screws provideclamping with no extra effort. Since the screws are there yougenerally don&#39;t need to wait for the glue to dry before continuing,which removes the normal downside of using glue.\n scraps: when you finish a project, keep your scraps,especially the ones of more unusual materials. This collection ofweird shapes can provide inspiration, have the weird thing you&#39;relooking for, or keep you from needing to cut up a larger piece.\n          These are also good to have on hand for projects where you&#39;re orderingsomething special-purpose, but either don&#39;t want to order staples aswell or won&#39;t know exactly what you want until you have the new part:\n       Everything I do this way does have a bit of a homemade look, but Ireally like how quickly I can make all sorts of sturdy things.", "posttime": "2020-06-06 13:41:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "diy,staples,需要", "title": "用于DIY的食品储藏室订书机", "title_en": "Pantry Staples for DIY", "transed": 1, "url": "https://www.jefftk.com/p/pantry-staples-for-diy", "via": "", "real_tags": ["diy", "staples", "需要"]}]