[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1001100, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "jakub jelinek jakub@redhat.com清华5月7日12：59：59格林尼治标准时间2020距离上一个主要的GCC版本发布已经过去了一年时间，距离GCC的第一个公开版本和GCC开发人员今年早些时候从svn到git的存储库转换已经过去了33年。今天，我们很高兴地宣布另一个重要的GCC版本10.1。这个版本在编译器和库方面对C++20语言的支持方面取得了很大的进展[1]，一些C2X。甚至还有一个新的实验性静态分析通道[2]。一些用较早的GCC版本编译成功的代码可能会要求更改资源，有关详细信息，请参阅http://gcc.gnu.org/gcc-10/porting_to.html。有关GCC 10.1的更改的更多信息，请参见https://gcc.gnu.org/gcc-10/changes.htmlfor。此版本可从此处列出的http://www.gnu.org/order/ftp.htmlThe服务器获得：http://www.gnu.org/order/ftp.htmlThe版本位于GCC/GCC-10.1.0/子目录中。如果您在使用GCC 10.1时遇到困难，请不要直接联系我。相反，请访问http://gcc.gnu.org获取有关获得帮助的信息。如果没有许多贡献者的支持，驱动一个领先的自由软件项目(如GNU编译器集合)是不可能的。更不用说它的开发人员，特别是它的定期测试人员和用户，他们对它的高质量做出了贡献。个人名单太长，无法单独感谢！请考虑向GNU工具链基金捐款，以支持GCC的持续发展！[3]-[1]请参阅https://gcc.gnu.org/projects/cxx-status.html，和https://gcc.gnu.org/onlinedocs/libstdc++/manual/status.html#status.iso.2020[2]请参阅https://developers.redhat.com/blog/2020/03/26/static-analysis-in-gcc-10[3]请参阅https://my.fsf.org/civicrm/contribute/transact?reset=1&amp；ID=57", "note_en": "Jakub Jelinek  jakub@redhat.com    Thu May 7 12:59:59 GMT 2020  A year has lapsed away since the release of last majorGCC release, more than 33 years passed since the firstpublic GCC release and the GCC developers survivedrepository conversion from SVN to GIT earlier this year.Today, we are glad to announce another major GCC release, 10.1.This release makes great progress in the C++20 language support,both on the compiler and library sides [1], some C2X enhancements,various optimization enhancements and bug fixes, several newhardware enablement changes and enhancements to the compiler back-endsand many other changes. There is even a new experimental staticanalysis pass [2].Some code that compiled successfully with older GCC versions might requiresource changes, see  http://gcc.gnu.org/gcc-10/porting_to.html fordetails.See  https://gcc.gnu.org/gcc-10/changes.htmlfor more information about changes in GCC 10.1.This release is available from the FTP servers listed here:  http://www.gnu.org/order/ftp.htmlThe release is in gcc/gcc-10.1.0/ subdirectory.If you encounter difficulties using GCC 10.1, please do not contact medirectly. Instead, please visit  http://gcc.gnu.org for information aboutgetting help.Driving a leading free software project such as GNU Compiler Collectionwould not be possible without support from its many contributors.Not to only mention its developers but especially its regular testersand users which contribute to its high quality. The list of individualsis too large to thank individually!Please consider a donation to the GNU Toolchain Fund to support thecontinued development of GCC! [3]----[1] See  https://gcc.gnu.org/projects/cxx-status.html, and  https://gcc.gnu.org/onlinedocs/libstdc++/manual/status.html#status.iso.2020[2] See  https://developers.redhat.com/blog/2020/03/26/static-analysis-in-gcc-10[3] See  https://my.fsf.org/civicrm/contribute/transact?reset=1&amp;id=57", "posttime": "2020-05-07 23:32:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,gcc", "title": "GCC 10.1发布", "title_en": "GCC 10.1 Released", "transed": 1, "url": "https://gcc.gnu.org/pipermail/gcc-announce/2020/000163.html", "via": "", "real_tags": ["发布", "gcc"]}, {"category": "", "categoryclass": "", "imagename": "4d6ebfd7fa31dc5f88fadd07a75f5f5f.png", "infoid": 1001098, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "关于NPM收购的一些思考-总体来说，这是一个令人悲伤的故事。除了极少数例外，每个人都输了。它可能以一笔交易结束，但这对任何人来说都不是胜利(除了一个人)。完全披露-我投资了钱，但输了。", "note_en": "Some thoughts on the npm acquisition - Overall, it is a sad story. With very few exceptions, everyone lost. It might have ended with a deal, but it wasn't a win for anyone (except one person). Full disclosure - I invested money and lost.", "posttime": "2020-05-07 23:31:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hammer,投资", "title": "Eran Hammer谈NPM", "title_en": "Eran Hammer on NPM", "transed": 1, "url": "https://threader.app/thread/1258080677464956929", "via": "", "real_tags": ["hammer", "投资"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001097, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欧洲首个国家、政府支持的基本收入实验在鼓励受助者就业方面没有起到太大作用，但确实改善了他们的心理健康、信心和生活满意度，这是对芬兰一项计划的首项大型研究，该计划吸引了人们对冠状病毒爆发的新兴趣。\n赫尔辛基大学的研究人员总结道：“与对照组相比，领取基本收入的人对自己的生活更满意，精神压力更小。”“他们对自己的经济福利也有更积极的看法。”\n这项研究发布之际，冠状病毒危机带来的毁灭性经济后果-包括全球失业率飙升-引发了人们对基本收入计划的新兴趣。教皇在复活节讲话中建议，“现在可能是考虑普遍基本工资的时候了”。\n西班牙政府上月表示，其目标是“尽快”向该国约100万户最贫困的家庭提供基本收入，经济部长纳迪亚·卡尔维诺(Nadia Calviño)表示，社会党领导的政府希望普遍的基本收入能成为“一种永久性的工具”。\n苏格兰首席部长尼古拉·斯特金(Nicola Sturjo)本周表示，病毒及其经济后果“让我更加强烈地认为，(全民基本收入)是一个时机已经到来的想法”。\n芬兰在2017年和2018年实施了这项为期两年的计划，吸引了国际社会的广泛兴趣，该计划向全国随机选择的2000名失业人员支付了560欧元(GB 490)的固定月收入，没有义务寻找工作，如果他们接受了工作，也不会减少他们的工资。\n该计划的主要目的是看看有保障的收入是否会鼓励人们从事往往是低薪或临时工作，而不担心失去福利，严格来说，该计划并不是一个普遍的基本收入试验，因为受助人来自一个受限制的群体，而且这些款项不足以维持生活。\n但它受到了其他政府的密切关注，他们认为基本收入不仅是让更多人从事某种形式工作的一种方式，也是减少对国家的依赖和削减福利成本的一种途径。有预测称，自动化可能会威胁到目前高达三分之一的工作岗位，这一想法已经获得了支持。\n研究人员对该计划的参与者进行了81次深入采访，得出的结论是，虽然他们的经历存在显著的多样性，但他们通常对自己的生活更满意，经历的精神压力、抑郁、悲伤和孤独比对照组要少。\n研究人员还注意到，这对就业有轻微的积极影响，特别是在某些类别，比如有孩子的家庭，并补充说，参与者在其他幸福感指标上也往往得分更高，包括更大的自主感、经济安全感和对未来的信心。\n领导这项研究的海伦娜·布隆伯格-克罗尔教授说：“一些人说，基本收入对他们的生产力没有任何影响，因为在他们接受培训的地区仍然没有工作岗位。”“但其他人说，有了基本收入，他们准备接受低薪工作，否则他们就会避免。\n“一些人说，基本收入让他们可以回到失业前的生活，而另一些人则说，这让他们有能力对低薪、没有保障的工作说不，从而增加了他们的自主感。”\n布隆伯格-克罗尔说，该计划还给了一些参与者“尝试实现梦想的可能性”。“自由职业者、艺术家和企业家对基本收入的影响有更积极的看法，一些人认为这为他们创造了创业的机会。”\n它还鼓励一些参与者更多地参与社会，例如通过从事志愿工作。研究人员之一克里斯蒂安·克罗尔(Christian Kroll)说：“一些人发现，有保障的收入增加了他们做一些事情的可能性，比如为家人或邻居提供非正式护理。”\n“基本收入的保障让他们可以做更有意义的事情，因为他们觉得这使这种护理工作合法化。”在这两年的时间里，许多从事这种无偿活动的人将其称为工作。\nKroll说，研究结果可以支持支持和反对基本收入的论点。“但正如我们都在2020年初认识到的那样，没有安全感并不是一种好的生活方式，”他说。\n“虽然基本收入不能解决我们所有的健康和社会问题，但人们肯定会讨论，在经济困难时期，它可能是解决方案的一部分。”", "note_en": "Europe’s first national, government-backed basic income experiment did not do much to encourage recipients into work but did improve their mental wellbeing, confidence and life satisfaction, according to the first big study of a Finnish scheme that has attracted fresh interest in the coronavirus outbreak.\n “The basic income recipients were more satisfied with their lives and experienced less mental strain than the control group,”  the study, by researchers at Helsinki University, concluded. “They also had a more positive perception of their economic welfare.”\n The study comes as the devastating economic fallout from the coronavirus crisis - including soaring unemployment worldwide - sparks renewed interest in basic income schemes. The pope suggested in his Easter address that “this may be the time to consider a universal basic wage”.\n The  Spanish government said last month it aimed to roll out a basic income “as soon as possible” to about a million of the country’s poorest households, with the economic affairs minister, Nadia Calviño, saying the Socialist-led government hoped a universal basic income would become “a permanent instrument”.\n Scotland’s first minister, Nicola Sturgeon, said this week the virus and its economic consequences had “made me much, much more strongly of the view that [universal basic income] is an idea that’s time has come”.\n Finland’s two-year scheme, which ran in 2017 and 2018 and attracted widespread international interest, paid 2,000 randomly selected unemployed people across the country a regular monthly income of €560 (£490), with no obligation to seek a job and no reduction in their payment if they accepted one.\n Aimed primarily at seeing whether a guaranteed income might encourage people to take up often low-paid or temporary work without fear of losing benefits, the scheme was not strictly speaking a universal basic income trial because the recipients came from a restricted group and the payments were not enough to live on.\n But it was watched closely by other governments who see a basic income not only as a way to get more people into some form of work, but also as a route to reducing dependence on the state and cutting welfare costs. The idea has gained traction amid predictions that  automation could threaten up to a third of current jobs.\n The researchers, who conducted 81 in-depth interviews with participants in the scheme, concluded that while there was significant diversity in their experiences, they were generally more satisfied with their lives and experienced less mental strain, depression, sadness and loneliness than the control group.\n The researchers also noted a mild positive effect on employment, particularly in certain categories, such as families with children, adding that participants also tended to score better on other measures of wellbeing, including greater feelings of autonomy, financial security, and confidence in the future.\n “Some people said the basic income had zero effect on their productivity, as there were still no jobs in the area they were trained for,” said Prof Helena Blomberg-Kroll, who led the study. “But others said that with the basic income they were prepared to take low-paying jobs they would otherwise have avoided.\n “Some said the basic income allowed them to go back to the life they had before they became unemployed, while others said it gave them the power to say no to low-paid insecure jobs, and thus increased their sense of autonomy.”\n The scheme also gave some participants “the possibility to try and live their dreams”, Blomberg-Kroll said. “Freelancers and artists and entrepreneurs had more positive views on the effects of the basic income, which some felt had created opportunities for them to start businesses.”\n It also encouraged some participants to get more involved in society, by undertaking voluntary work, for example. “Some found the guaranteed income increased the possibility for them to do things like providing informal care for their family or their neighbours,” said one of the researchers, Christian Kroll.\n “The security of the basic income allowed them to do more meaningful things, as they felt it legitimised this kind of care work. Many of the people who performed such unpaid activities during the two-year period referred to it as work.”\n Kroll said the results of the study could support arguments both for and against basic income. “But as we’ve all learned in the early part of 2020, insecurity is not a good way to live,” he said.\n “While basic income can’t solve all our health and societal problems, there is certainly a discussion to be had that it could be part of the solution in times of economic hardship.”", "posttime": "2020-05-07 22:49:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发现,basic,收入", "title": "研究发现，芬兰基本收入试点改善了福祉", "title_en": "Finnish basic income pilot improved wellbeing, study finds", "transed": 1, "url": "https://www.theguardian.com/society/2020/may/07/finnish-basic-income-pilot-improved-wellbeing-study-finds-coronavirus", "via": "", "real_tags": ["发现", "basic", "收入"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001096, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "视频游戏行业一直在努力为非玩家角色(NPC)找到可访问和实用的方法，以便快速有效地做出智能决策。这导致了一系列创新，从帮助角色在3D环境中移动的导航网格，到游戏中的有限状态机，比如角色行为的半条命(Half Life For Character Behavior)。自2000年中期以来，由Halo2推广的行为树可以说是AAA视频游戏行业中最常用的技术。但在这篇文章中，我们将看看同时获得流行的另一种技术。让我们来看看目标导向的行动计划和推广它的游戏：第一次遭遇攻击侦察。\n要理解以目标为导向的行动计划--以及它在F.E.A.R和其他许多游戏中是如何使用的--我们需要看看它的理论来源：一种被称为自动计划的现有人工智能技术。自动化或人工智能规划是一个过程，通过这个过程，系统试图找出一系列行动，以实现设计者设定的遥远目标：这被称为计划。要做到这一点，我们用某种语言或编码对问题进行建模，这些语言或编码告诉我们关于当时世界的所有信息都是真实的。这些称为事实或谓词。一个简单的事实告诉我们一些我们以后可能需要知道的事情。我们存储了我们拥有的所有谓词，这些谓词都是关于世界在所谓的状态内的任何时间点的样子。\n例如，考虑一扇关闭的门，我们将其标记为“Door1”。我可能希望非玩家角色打开Door1，所以我需要在谓词中知道它是打开的还是关闭的。因此，我们当前的世界状态是一扇关闭的大门。现在，有了这些信息，我可以构建一个允许我打开它的操作。\n现在，每个动作通常分为三个部分：动作中涉及的对象(在本例中是一扇门)，动作前提条件-意味着在我可以应用动作之前，世界上的哪些事实必须为真-以及效果-它们表示由于完成动作、向世界状态添加新信息或删除不再为真的现有事实，世界将如何变化。比方说，我想让我的非玩家角色打开Door1，一些有效的开门动作的前提条件是门是关着的，并且NPC与门站在同一个房间里。一旦操作完成，效果就是门现在打开了。现在假设我们想从A房间走到B房间，但是他们之间的门是关着的。我们需要确保在我们的规划模型中解释门将房间A和B彼此连接，并且如果有一扇紧闭的门，您不能在房间之间走动。在这一点上，系统将创建一个计划，即打开门，然后从A房间走到B房间。将世界状态更改为全国人大现在在B房间的位置。\n简而言之，这就是计划的全部内容：弄清楚要做什么，按什么顺序做。这种编码问题并允许计划系统解决问题的过程就是为什么几十年来它一直是一个活跃和发展中的研究领域。虽然F.E.A.R在2005年帮助将规划带到了游戏中，但早在20世纪70年代，规划就已经被用于各种现实世界的物流问题。这包括机器人技术-从较小的家用设备到月球和火星漫游者之类的设备，对风力涡轮机、发电站和制造等大型机械系统的控制，以及搜救行动、军事规划和救灾等复杂空间问题。\n但这隐藏了一些更令人讨厌的细节。这些规划编码依赖于我们能够将我们正在解决的问题抽象为简单的东西，供规划者解决。回到开门的问题，我说全国人大需要在A房间，Door1连接这两个房间。这在计划模型中工作得很好，但是模型和现实生活中的工作方式之间有很多不同之处。例如，A房间通向B房间的门在哪里？人大需要朝着什么方向走向大门？事实上，在规划模型中，如果全国人大是在门相连的房间里，他们就可以打开门。这意味着这个小家伙现在显然是心灵感应的，可以从很远的地方用他们的思想打开大门？而不是更现实的解释，那就是NPC不仅需要在RoomA里，而且需要站在Door1旁边才能打开它。因此，虽然计划对于解决在给定情况下要做什么这一更大的问题很重要，但在世界上执行行动计划-无论是在现实世界中还是在视频游戏之类的模拟中-要困难得多。\n现在我们已经了解了什么是计划以及它是如何工作的，让我们来看看面向目标的行动P\n正如Orkin 2006年在麻省理工学院媒体实验室攻读博士学位时在游戏开发者大会上发表的文章中详细描述的那样，GOAP系统是由有限状态机驱动的。有限状态机是这样一个系统，在这个系统中，人工智能存在于一种行为状态中，然后根据发生的事件转换到另一种状态。然而，在Half Life中采用的FSM，在代码库中存在80多个独特的状态。尽管该状态是否可用由状态机控制的字符类型来确定。然而，在GOAP中，有限状态机只有三种状态：\n与所谓的智能对象互动：世界上人工智能角色可以与之互动的物品。\n现在你可能会有点困惑，但这一切都是基于对非玩家角色AI是如何工作的一个非常聪明的观察。如果你认为游戏中的敌人是敌人，他们所做的一切就是在某些情况下播放动画。当动画在正确的时间在正确的位置播放时，它就显得聪明，而当几个聪明的动画在一个序列中播放时，它就显得聪明。因此，这三个状态中的每一个最终都在播放动画。\n后藤：正在播放运动动画(无论是行走、跑步、跳跃、跳水还是攀登)，但它也在朝一个特定的位置前进。\n动画：就是简单地播放一个动画，这可以是承认玩家的存在，来射击他们的武器或者任何简单的闲置动画，这让NPC更有特色。\n最后使用智能对象：这是一种情况，比如让NPC按下开关，或者打开门，或者坐在椅子上，或者打翻桌子。在每种情况下，动画都直接与对象捆绑在一起，而且经常在游戏中-比如我在关于BioShock Infinition的AI的一集中找到的-对象会告诉角色的动画系统它需要做什么。\n因此，不是将每个可能的行为都枚举为单独的状态，而是在一个小得多、高度数据驱动的实现中执行整个事情，而不是更加扎实的状态机。它将执行传递到系统中的特定移动动作和动画，如果以正确的顺序执行几个移动、动画和使用智能对象状态，我们将获得一些智能外观行为。\n但是它如何知道处于什么状态，以什么顺序，以及向每个状态传递什么信息呢？这就是GOAP的计划部分发挥作用的地方。使用我们前面讨论过的计划编码，系统创建解决计划编码中的特定问题的计划，并使用A*搜索来查找解决问题时要采取的最佳行动。然后，生成的计划中的动作被转换为特定的FSM状态，其中传递的数据包括要移动的位置、要播放的动画和要与之交互的智能对象。\n为了更好地理解这在实践中是如何工作的，让我们揭开恐惧的面罩，探索GOAP是如何在游戏中被采用的。\n因此，让我们更深入地看看GOAP是如何应用于恐惧的。游戏C++代码库的部分内容已经公开发布了好几年。首先是Monolith发布了最初的恐惧SDK，然后是恐惧公共工具，因为建模人员一直在支持它。只需很少的努力，您就可以在Visual Studio中将其打开并通读AI源代码。因此，让我们来看看GOAP是如何在代码库中应用的，对于那些想亲自尝试的人，我在描述中留下了链接，供您查看。\n每个恐惧中的人工智能角色如果拥有任何类型的人工智能，都需要有指定的目标。这些目标是规划者将在动作空间中运行搜索，以便为该角色找到要执行的动作计划的目标。这适用于游戏中所有活跃的非玩家角色，从士兵和刺客到游戏结束时的噩梦幽灵，甚至是在地面上四处奔跑的老鼠，这是一个非常重要的问题，我会马上回来讨论。这意味着其他角色，如金善权和扬科夫斯基，甚至阿尔玛本人都是由设计师编写的。\n没有目标，AI角色实际上什么也做不了。他们需要被赋予要实现的目标，然后规划系统将致力于解决这些目标。游戏文件中仅编码了不到70个进球。在每种情况下，这些目标都可以被初始化、更新和终止，更关键的是，这些目标具有允许它们在游戏中的该时间点计算其总体优先级的功能。例如，如果一个士兵被分配了巡逻和杀死敌人的目标，但它不知道玩家在附近，那么杀死敌人的优先级将为0，而巡逻的优先级要高得多，因为有一个巡逻节点已经分配给了该角色。然而，如果它知道附近有一名球员，巡逻队的球门优先级要低得多，因为它认识到该球员现在对它构成了威胁。\n现在，为了让策划者解决这个目标，角色将拥有一个可供其搜索的动作集合。游戏中有120个动作，从简单的动画到不同的攻击变体，移动到不同的位置，使用智能对象节点，重新装填武器或只是闲置。它们都有自己对应的C++类。这些操作是在代码中设置的，但并非所有NPC都有权访问所有操作。设计者使用单独的数据库编辑器为每种敌人类型分配特定的动作，允许他们定制每个角色在解决他们的目标时的多才多艺。\n有了分配给给定角色的目标，它将等待机会访问规划器，并找到解决其当前情况的方法。这就是我早些时候暗示的更大的问题浮出水面的地方。系统需要找到这个特定角色可以执行的动作，在状态空间中搜索可能的动作，找到达到目标的计划，但所有这些都需要在执行期间根据游戏重新验证。这是因为在计划期间或在执行计划时可能会发生一些事情，而这些事情可能会破坏计划。回到前面的My Door示例，如果您正在生成打开门并在房间之间移动的计划，但在计划过程中或在执行该计划时，门被其他人或某事打开，则计划将无效。\n这是绝大多数计划系统面临的问题，因为它们本质上是相当存在主义的，并假设只有规划者才能改变世界。所以它不能容纳其他角色作为计划的一部分在世界上做事情。恐惧中的敌人人工智能都不知道彼此的存在，而合作行为只是两个人工智能角色被赋予的目标，它们很好地排列在一起，在执行时创造出看起来像是协调一致的行为。他们不仅不能走到世界上其他角色所站的导航点，而且对那个角色的存在一无所知。因此，如果另一个角色做了会破坏提议的计划的事情，那么每个角色都需要能够认识到这一点，这样它就会停止正在做的事情，并要求另一个计划。或者在必要时改变目标。\n这可以通过三种不同的方式来处理：首先，一旦制定了计划，系统将运行快速验证检查，该检查将获取世界状态的副本，在该副本上执行计划，并确保它将按预期实现目标，并且每个行动的前提条件和效果都按预期工作。其次，每个目标都可以覆盖ReplanRequired函数，该函数不断检查是否应该放弃当前计划并从计划器检索替换计划。一次很好的考试\n但是，如果该操作将按预期工作，则该操作在代码库中被“激活”。当发生这种情况时，它会告诉有限状态机要转换到这三个状态中的哪一个状态。并传递完成状态执行所需的所有数据。例如，假设一名士兵需要重新装弹，然后它转换到动画状态，并传递所需的特定动画参数，以便角色重新装弹。\n一旦人工智能角色成功地完成了他们设计的计划。然后，它将被分配一个新的，并可以重新计划。通过管理计划成功和失败的时间，这有助于保持游戏的节奏，确保人工智能总是知道该做什么，而不是无所事事地站在那里等着被慢动作击中脸部。事实上，恐惧中的计划长度通常相当短，通常是1-2个动作，只有少数几个达到3或4个动作的长度。考虑到游戏的整体节奏，这在很大程度上是有意义的。\n这就是说，这个目标管理和计划过程确实产生了一个问题，即使是Monolith的开发人员也多年来都不知道这个问题。正如Eric[Jacopin，2014]教授在2014年的一篇研究论文中详细描述的那样，他在论文中分析了GOAP策划者在恐惧中的表现，结果发现，由于老鼠的存在，这种持续的重新规划过程在游戏的某些层面上产生了很小的性能开销。正如我提到的，恐惧中的老鼠使用与士兵和其他战斗人工智能相同的系统。通常情况下，他们的计划非常简单，搬到世界上的另一个地方，如果他们在附近，最好远离玩家。老鼠重新计划的需要没有考虑玩家是否在附近。因此，你可以在关卡的开始几秒钟内遇到几只老鼠，20分钟后，当你在地图的另一边时，它们仍然在四处奔跑，计划新的行动。\n这远远不是对代码库的详尽概述，我确实鼓励任何能够使用C++的人通读一下代码，这对于游戏开发人员来说是非常有洞察力和价值的。\n恐惧对目标导向行动计划的使用至今仍被认为是现代视频游戏中一些最令人兴奋和有趣的敌人对手。虽然现在距离游戏发布已经将近15年了，但GOAP仍然在视频游戏行业产生着持久的影响。虽然远不是一个详尽的清单，但也有许多非常受欢迎的或邪教经典采用了这种方法或类似的方法。\n其中包括“被谴责的犯罪起源”、“S.T.A.L.K.E.R.：切尔诺贝利的影子”、“正义的原因2”、“Deus Ex Human Revine 2”、“古墓丽影”2013年的重启，以及Monolith最近推出的“中土：魔多的影子”和“战争的影子”。还有其他几集“人工智能与游戏”探索了它的应用，例如第14集的“变形金刚：为塞伯坦而战”，以及第22集的“帝国与拿破仑：全面战争”中的大幅修改的混合方法。在电子游戏中，规划仍然是一种流行的技术--尽管可以说并不像行为树那样普遍。但随着时间的推移，GOAP及其条带式方法现在不那么频繁地被采用，更多的当代游戏采用了另一种被称为分层任务网络(Hierarchical Task Network)或HTN计划的计划技术，这种技术已经在Killzone 2、Max Payne 3和Dying Light等游戏中使用。我将在未来的片段中专门介绍HTN的规划，但我已经在第14集的“变形金刚：塞贝特龙的倒下”和第37集的“地平线零点黎明”的视频中介绍了这种规划方法的实施。\n但就目前而言，我希望这能帮助每个人更好地理解为什么人们继续称赞恐惧的人工智能，以及正在采用的底层技术。我在下面列出了一些关于GOAP的其他有用资源，供您查看。", "note_en": "The video game industry has strived to find accessible and pragmatic approaches for non-player characters (NPCs) to make intelligent decisions quickly and effectively. This has led to innovations ranging from navigation meshes for helping a character move around a 3D environment to Finite State Machines in games such as  Half Life for character behaviour. Since the mid-2000’s Behaviour Trees, which were popularised by Halo 2, are arguably the most commonly applied technique in the AAA video game industry. But in this piece we’re going to take a look at the  other technique that achieved popularity at the same time. Let’s take a look at  Goal Oriented Action Planning and the game that popularised it: First Encounter Assault Recon.\n    To understand Goal Oriented Action Planning – and in-turn how it is used in F.E.A.R. and many other games – we need to take a look at the theory from which it derives from: an existing AI technology known as automated planning. Automated or AI Planning is a process whereby a system attempts to figure out a sequence of actions that will achieve a distant goal set upon it by a designer: this is called a plan. To do this, we model the problem in some sort of language or encoding that tells us all the information that can be true about the world at that time. These are known as facts or  predicates. Where a simple fact tells us something we might need to know at a later point in time. We store all of the predicates we have about how the world looks like at any point in time within what’s known as a  state.\n For example, consider a closed Door we label as  ‘Door1’. I might want a non-player character to open Door1, so I need to know in a predicate whether it’s open or closed. So the current state of our world is one closed door. Now given I have this information I can build an  action that allows me to open it.\n  Now each action is usually broken into three parts:  the objects that are involved in the action (in this case a door),  the actions preconditions – meaning what facts of the world must be true before I can apply the action – and  the effects – which represent how the world changes as a result of completing the action, adding new information to the world state or deleting existing facts that are no longer true. So say I want my non-player character to open Door1, some valid preconditions for an open-door action would be that the door is closed and that the NPC is standing in the same room as the door. Once the action is completed, the effect would be that the door is now open. Now say we wanted to walk from room A to room B, but the door between them is closed. We’d need to make sure in our planning model that we explain that the door connects room A and B to each other and that you cannot walk between rooms if there is a closed door. At which point the system will create a plan, which is to open the door, and then walk from room A to B. Changing the state of the world to where the NPC is now in Room B.\n In a nutshell this is what planning is all about: figuring out what to do and in what order to do it. This process of encoding problems and allowing for planning systems to solve them is why it has been an active and developing research field for several decades. While F.E.A.R. helped bring planning to games in 2005, planning has previously been used in a variety of real-world logistics problems since as far back as the 1970s. This includes problems such as robotics – ranging from smaller home-based devices to the likes of the Lunar and Mars Rovers, control of largescale mechanical systems such as wind turbines, power stations and manufacturing and in complex spatial problems such as search and rescue operations, military planning and disaster relief.\n But this hides some of the nastier details underneath. These planning encodings rely on us being able to abstract the problem we’re solving into something simple for a planner to solve. Returning to that door opening problem, I said that the NPC needs to be in room A and that Door1 connects the two rooms. This works fine in a planning model, but there’s a bunch of discrepancies between the model and how it works in real life. For example, where in room A is the door to room B? What direction does the NPC need to move towards the door? In fact, in the planning model the NPC can open the door if they’re in a room that the door connects. Meaning this wee fella is now apparently telekinetic and can open doors with their mind from very far away? Rather than the more realistic interpretation which is that not only does the NPC need to be in RoomA, but also needs to be standing right next to Door1 in order to open it. Hence while planning is great for solving the larger problem of what to do in a given situation, executing the plan of action in the world – be it in the real world or in a simulation like a video game – is a lot harder.\n So now that we know what planning is and how it works, let’s take a look at Goal Oriented Action Planning and how it brings AI planning to video games.\n  Goal Oriented Action Planning – or GOAP for short – adapts STRIPS planning – the Stanford Research Institute Problem Solver planning system from 1971 – for use in games. Leading development on this project was Dr Jeff Orkin, the AI lead for Monolith Productions on both 2002’s  No One Lives Forever 2 and  F.E.A.R., where GOAP was first implemented.\n As detailed in Orkin’s 2006 publication at the Game Developers Conference whilst studying his PhD at MIT Media Lab, the GOAP system is driven by a Finite State Machine. A Finite State Machine is a system whereby an AI exists within one state of behaviour and then based on an event occurring will transition into another one. However, the FSMs adopted in Half Life, have over 80 unique states exist in the codebase. Although whether that state was available was determined by the type of character that the state machine was controlling. However here in GOAP, the Finite State Machine has only three states:\n  Interacting with what is known as a smart object: an item in the world that AI characters can interact with.\n Now you might be a little confused how this works, but it’s all based on a really clever observation of how non-player character AI works. If you consider an enemy in a game, all they do is play animations in certain circumstances. It’s when that animation is played in the right place at the right time it appears clever and when several clever animations are played in a sequence, it appears intelligent. Hence each of these three states is ultimately playing an animation.\n GoTo: is playing a movement animation (be it walking, running, jumping, diving or climbing) but it’s also heading to a specific location.\n Animate: is simply playing an animation, this could be acknowledging the players presence, to shooting their weapon or any simple idle animation which this NPC a bit more character.\n And lastly  Use Smart Object: which is a situation such as having a NPC hit a switch, or open a door, or sit in a chair, or knock a table over. In each case, the animation is tied directly to the object and quite often in games – such as that found in my episode on the AI of BioShock Infinite – the object will tell the character’s animation system what it needs to do.\n So, instead of a more grounded state machine where each possible behaviour is enumerated as a separate state, the whole thing is executed in a much smaller and highly data-driven implementation. It will execute specific movement actions and animations that are passed into the system and if several movement, animation and use smart object states are executed in the correct sequence, we’ll get some smart looking behaviour.\n But how does it know what states to be in, in what order and what information to pass into each state? Well, that’s where the planning part of GOAP kicks in. Using a planning encoding like we talked about before, the system creates plans that solves specific problems in the planning encoding and uses A* search to find the best actions to take in solving the problem. The actions within the resulting plan are then translated into specific FSM states, with data being passed of locations to move towards, animations to play and smart objects to ineract with.\n To better understand how this is works in practice, let’s go crack open the hood of FEAR and explore how GOAP is adopted within the game.\n   So let’s take a deeper look at how GOAP is applied in FEAR. Portions of the games C++ codebase have been publically available for some years now. First with the original FEAR SDK being released by Monolith, followed by the FEAR public tools as modders have continued support for it. And with very little effort you can crack it open in Visual Studio and read through the AI source code. So let’s walk through how GOAP is applied within the codebase and for those wanting to try their hand themselves I’ve left links in the description for you to check it out.\n Each AI character in FEAR that has any sort of AI, needs to have goals assigned to it. These goals are ones that the planner will run a search through the action space in order to find a plan of action for that character to execute. This applies to all active non-player characters in the game, from the soldiers and assassins to the nightmare spectres at the end of the games and even the rats that are running around on the ground, which is a super important point I’ll come back to in a minute. This means that the other characters, such as Jin Sun-Kwon and Jankowski, and even Alma herself are all scripted by designers.\n Without a goal, the AI characters will do literally nothing. They need to be given goals to accomplish, which the planning system will then aim to resolve. There are just shy of 70 goals encoded within the game files. In each case, these goals can be initialised, updated and terminated and more critically, have functions that allow for them to calculate their overall priority at that point of time in the game. So for example, if a soldier has been assigned the Patrol and KillEnemy goals, but it has no knowledge of the player being nearby, then KillEnemy will have a priority of 0, while Patrol has a much higher priority given there is a patrol node that’s been assigned to that character. However, in the event that it has knowledge of a player being nearby, the Patrol goal has a much lower priority, given it recognises that the player is now a threat to it.\n Now in order for the planner to solve that goal, the character will have a collection of actions available to it that it can search through. There are 120 actions in the game, ranging from simple animations to different attack variants, moving to locations, using smart object nodes, reloading weapons or just standing idle. All of which have their own corresponding C++ classes. The actions are setup in code, but not all NPCs have access to all actions. Designers use a separate database editor to assign specific actions to each enemy type, allowing them to customise just how versatile each character is when solving their goals.\n With a goal assigned to a given character, it will await a chance to access the planner and find a solution to its current situation. This is where the larger issues I hinted at earlier come to light. The system needs to find actions that this particular character can execute, search through the possible actions within the state space, find a plan that reaches the goal, but all of this needs to be revalidated against the game during execution. This is because something can happen either during planning time or when executing the plan that can break it. Returning to my door example from earlier, if you’re generating a plan to open the door and move between rooms, but during the planning process or as you’re executing it, the door is opened by someone or something else, it invalidates the plan.\n This is an issue that the vast majority of planning systems face, in that they’re rather existential in nature, and assume that only the planner can change the world. So it can’t accomodate for other characters doing stuff in the world as part of the plan. None of the enemy AI in FEAR know that each other exists and co-operative behaviours are simply two AI characters being given goals that line up nicely to create what look like coordinated behaviours when executed. Not only are they unable to walk towards navigation points in the world where other characters are standing, but have zero knowledge of that characters existence. Hence if another character does something that would break the proposed plan, then each character needs to be able to recognise that so it stops what it’s doing and asks for another plan. Or change the goal if necessary.\n This is handled in three different ways: firstly once a plan is devised, the system will then run a quick validation check, that takes a copy of the world state, executes the plan on that copy and ensures it will satisfy the goals as intended, with each actions preconditions and effects working as intended. Secondly, each goal can override the ReplanRequired function, which continually checks whether the current plan should be abandoned and a replacement one be retrieved from the planner. A good example of this is when an enemy character is shot, while executing a plan to satisfy the KillEnemy goal. However, this is only allowed in the event the character is not executing an animation that cannot be interrupted. Lastly, each action in the plan needs to be validated again during execution, with preconditions and effects being checked. In the event they’re not satisfied as intended, the system will bail out of the plan and force a re-plan to occur.\n  However, if that action is going to work as intended, the action is ‘Activated’ in the code base. When that happens, it tells the Finite State Machine which of the three states to transition into. And passes over all of the data it needs to complete the states execution. So say for example a soldier needs to reload, then it transitions into the Animate state and passes in the specific animation parameters that are needed to so that the character will reload their gun.\n Once an AI character completes their devised plan successfully. It will then be assigned a new one and can plan again. By managing both when plans succeed as well as when they fail, this helps maintain the pace of the game, ensures the AI always knows what to do and don’t stand around idle waiting to be slow-mo shot in the face. In truth the length of plans in FEAR are often rather short, typically 1-2 actions long, with only a handful ever reaching 3 or 4 actions in length. This largely makes sense given the overall pacing of the game.\n That said, this goal management and planning process does create a problem, one that even the developers at Monolith didn’t know about for many years. As detailed in a 2014 research paper by Professor Eric [Jacopin, 2014] in which he analyses the performance of the GOAP planner in FEAR, it’s discovered that this process of continually replanning creates a small performance overhead in some levels of the game, thanks to the rats. The rats in FEAR are – as I mentioned – using the same system as the soldiers and other combat AI. Typically their plans are pretty simple, move to another location in the world and preferably away from the player if they’re nearby. The need for the rats to replan doesn’t take into consideration whether the player is nearby. Hence you can meet a couple rats in the opening seconds of the level and they’ll still be running around planing for new actions 20 minutes later while you’re on the other side of the map.\n This far from an exhaustive overview of the codebase and I do encourage anyone who can work their way around C++ to have a read through the code, it’s really insightful and rewarding for game developers to read through.\n  FEAR’s use of Goal Oriented Action Planning is still held to this day as some of the most exciting and fun enemy opponents to come across in modern video games. And while it’s now been almost 15 years since the games release, GOAP has continued to have a lasting impact within the video games industry. While far from an exhaustive list, there are many highly popular or cult classics that have adopted the methodology or something similar to it.\n This includes the likes of  Condemned Criminal Origins,  S.T.A.L.K.E.R.: Shadow of Chernobyl,  Just Cause 2,  Deus Ex Human Revolution, the 2013 reboot of  Tomb Raider and more recent titles by Monolith such as  Middle-Earth: Shadow of Mordor and  Shadow of War. There are other episodes of AI and Games that explore its applications, such as  Transformer: War for Cybertron in episode 14 as well as a heavily modified hybrid approach in  Empire and  Napoleon: Total War back in episode 22. Planning is still a popular technique in video games – though arguably not as common as say behaviour trees. But over time GOAP and its STRIPs-style approach is now being adopted less frequently, with more contemporary titles adopting another planning technology known as Hierarchical Task Network or HTN planning, which has been used in titles such as  Killzone 2,  Max Payne 3 and  Dying Light. I’ll be dedicating a future segment of to HTN planning, but I’ve already covered the implementation of this planning method in videos for  Transformers: Fall of Cybetron in episode 14 and  Horizon Zero Dawn in episode 37.\n But for now I hope this help everyone better understand not only why people continue to laud the AI of FEAR, but also the underlying technology being adopted. I’ve listed some other useful resources on GOAP in the below for you to check out.", "posttime": "2020-05-07 22:48:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,导向,oriented,计划", "title": "以目标为导向的行动计划构建F.E.A.R.的人工智能", "title_en": "Building the AI of F.E.A.R. With Goal Oriented Action Planning", "transed": 1, "url": "https://www.aiandgames.com/2020/05/06/ai-101-goap-fear/", "via": "", "real_tags": ["人工智能", "导向", "oriented", "计划"]}, {"category": "", "categoryclass": "", "imagename": "657eb2ed72ceb99edb70e8cee131343e.jpg", "infoid": 1001095, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在2020年3月至4月期间，Windows7的用户市场份额从26.23%下降到25.59%。当人们最终升级到Windows10时，对于一个有10年历史、不受支持的操作系统来说，这并不令人惊讶。对吗？尽管有这种传统的想法，微软的Windows10实际上经历了罕见的市场份额下降(从2020年3月的57.34%下降到4月份的56.08%)。与此同时，流行的Linux发行版Ubuntu享受着爆炸性的增长。\n有多爆炸性？Ubuntu在操作系统使用中的总份额从3月份的0.27%激增到4月份的1.89%。客观地说，这是599%的增长。\nCanonical的Ubuntu的提升导致Linux使用率从1.36%攀升至2.87%。为了对抗苹果一个有趣的数据点，NetMarketShare衡量MacOS Catalina-它在4月份也获得了4.15%的用户份额。\n需要注意的一点是：Ubuntu的新增用户并没有增加599%。这一跃升表明其操作系统的整体市场份额逐月增加。但这仍然是一个惊人的数字。\nNetMarketShare只衡量其受监控网站网络中的活跃用户会话，但这些网站的数量在上千个，因此这是一个相当可观的样本规模。你可以在这里阅读更多关于它的数据收集方法的信息。\n那么，为什么在Ubuntu快速增长的同时，微软的整体市场份额却在流失呢？正如WindowsLatest指出的那样，其中一个原因可能是冠状病毒的流行和公司拥有的个人电脑在办公室使用的显著减少。\n我更愿意相信另一个因素是Ubuntu--进而是Linux--正稳步获得主流和专业技术媒体的更多报道。在过去的两年里，桌面Linux在游戏、易用性以及无缝系统更新和尊重隐私功能的结合方面得到了复兴。", "note_en": "Between the months of March and April 2020, Windows 7 saw a drop in user market share from 26.23 percent to 25.59 percent. That’s hardly surprising for a 10-year-old, unsupported OS as people finally upgrade to Windows 10. Right? Despite that conventional thinking, Microsoft’s Windows 10 actually experienced a rare  drop in market share (down to 56.08 percent in April from its March 2020 share of 57.34 percent). Meanwhile, popular  Linux distribution Ubuntu enjoyed an explosive  increase.\n    How explosive? Ubuntu’s overall share of operating system usage ballooned from 0.27% in March to 1.89% in April. To put that in perspective, that’s an increase of  599 percent.\n  The lift for Canonical’s Ubuntu resulted in Linux usage climbing from 1.36 percent to 2.87 percent. And to frame that up against an interesting Apple data point,  NetMarketShare measures macOS Catalina — which also gained user share in April — at 4.15 percent.\n  One key thing to note: Ubuntu isn’t seeing a 599 percent increase in  additional users. That jump represents its increase in overall operating system market share from month to month. But it’s still an astonishing number.\n       NetMarketShare only measures active user sessions within its network of monitored websites, but those websites number in the 1000s so it’s a respectable sample size. You can read more about its data collection methodology  here.\n    So why is Microsoft bleeding overall market share while Ubuntu is gaining so rapidly? One reason, as  WindowsLatest points out, could be the COVID-19 pandemic and a significant decrease in company-owned PCs being used at the office.\n    I like to believe another contributing factor is that Ubuntu — and by extension Linux — is steadily gaining more coverage from mainstream and specialty tech press. Over the past two years desktop Linux has enjoyed a renaissance when it comes to gaming, ease-of-use and its combination of seamless system updates and privacy-respecting features.", "posttime": "2020-05-07 22:48:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows-10,linux,ubuntu,windows,windows10", "title": "Windows10用户流失，而Ubuntu Linux用户增长惊人", "title_en": "Windows 10 Bleeds Users While Ubuntu Linux Enjoys an Astonishing Increase", "transed": 1, "url": "https://www.forbes.com/sites/jasonevangelho/2020/05/06/windows-10-is-bleeding-users-while-ubuntu-linux-enjoys-an-astonishing-increase/", "via": "", "real_tags": ["linux", "ubuntu", "windows", "windows10"]}, {"category": "", "categoryclass": "", "imagename": "1e51293629dee9850a5d6d5358aed98f.jpg", "infoid": 1001092, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几年来，Keybase一直在开发加密产品，包括安全的文件共享和协作工具，在经历大流行需求增长的痛苦时，Keybase应该会给Zoom带来一些安全可信度。\n在过去的几个月里，随着需求的飙升，该公司面临着一系列安全问题，并暴露了该平台的一些安全漏洞。随着公司采取行动解决这些问题，拥有一支加密专家团队应该会帮助公司打造更安全的产品。\n在宣布这笔交易的一篇博客文章中，首席执行官埃里克·袁表示，他们收购KeyBase是为了给客户提供更高级别的安全，这对企业客户来说越来越重要，因为越来越多的业务依赖于该平台，在疫情爆发期间在家工作。\n袁写道：“这次收购标志着Zoom迈出了关键的一步，因为我们试图完成一个真正私人的视频通信平台的创建，这个平台可以扩展到数亿参与者，同时也可以灵活地支持Zoom的各种用途。”\n他补充说，一旦将这些工具整合到产品中，所有付费客户都可以使用这些工具。“Zoom将为所有付费账户提供端到端加密会议模式。登录的用户将生成公共加密身份，这些身份存储在Zoom网络的存储库中，可用于在与会者之间建立信任关系，“他写道。\n根据交易条款，密钥库将成为Zoom的子公司，联合创始人兼Max Krohn将领导Zoom安全工程团队，直接向袁汇报，帮助构建安全产品。其他近24名员工将成为Zoom的员工。绝大多数是安全工程师。\n目前还不清楚Keybase的产品会发生什么，但该公司确实表示，Zoom正在与Keybase合作解决这一问题。\n根据Crunchbase的数据，Keybase成立于2014年，已经筹集了近1100万美元。", "note_en": "Keybase, which has been  building encryption products for several years including secure file sharing and collaboration tools, should give Zoom some security credibility as it goes through pandemic  demand growing pains.\n The company has faced a number of security issues in the last couple of months as demand as soared and exposed some security weaknesses in the platform. As the company has moved to address these issues, having a team of encryption experts on staff should help the company build a more secure product.\n  In a blog post announcing the deal, CEO  Eric Yuan   said they acquired Keybase to give customers a higher level of security, something that’s increasingly important to enterprise customers as more operations are relying on the platform, working from home during the pandemic.\n “This acquisition marks a key step for  Zoom   as we attempt to accomplish the creation of a truly private video communications platform that can scale to hundreds of millions of participants, while also having the flexibility to support Zoom’s wide variety of uses,” Yuan wrote.\n He added that that tools will be available for all paying customers as soon as it is incorporated into the product. “Zoom will offer an end-to-end encrypted meeting mode to all paid accounts. Logged-in users will generate public cryptographic identities that are stored in a repository on Zoom’s network and can be used to establish trust relationships between meeting attendees,” he wrote.\n Under the terms of the deal, the  Keybase   will become a subsidiary of Zoom and co-founder and Max Krohn will lead the Zoom security engineering team, reporting directly to Yuan to help build the security product. The other almost two dozen employees will become Zoom employees. The vast majority are security engineers.\n It’s not clear what will happen to Keybase’s products, but the company did say Zoom is working with Keybase to figure that out.\n Keybase was founded in 2014 and has raised almost $11 million according to Crunchbase data.", "posttime": "2020-05-07 22:19:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "收购,acquires,zoom", "title": "ZOOM收购密钥库以获得端到端加密专业知识", "title_en": "Zoom Acquires Keybase To Get End-to-End Encryption Expertise", "transed": 1, "url": "https://techcrunch.com/2020/05/07/zoom-acquires-keybase-to-get-end-to-end-encryption-expertise/", "via": "", "real_tags": ["收购", "acquires", "zoom"]}, {"category": "", "categoryclass": "", "imagename": "b56c8ecfb4225e07a0288d6f8aab3727.jpg", "infoid": 1001091, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "世界上最大的媒体集团之一维亚康姆(Viacom)的总裁梅尔·卡尔马津(Mel Karmazin)走进了谷歌位于加利福尼亚州山景城的办公室。谷歌是一家时髦、年轻的科技公司，从互联网上赚到了钱--真正的钱！卡尔马津在那里是为了找出是怎么回事。\n当联合创始人谢尔盖·布林上气不接下气地走进来时，谷歌创始人拉里·佩奇(Larry Page)和首席执行官埃里克·施密特(Eric Schmidt)已经坐在会议室里。他穿着短裤。还有旱冰鞋。\n谷歌的人告诉卡尔马津，搜索引擎的收入来自销售广告。公司可以购买网站的付费链接，这些网站将出现在用户搜索结果的顶部。谷歌则扮演着中间人的角色，将有广告空间的网站与渴望让他们的横幅被看到的广告商联系起来。\n施密特接着说：我们的业务是高度可衡量的。我们知道，如果你在广告上花费X美元，你将获得Y美元的收入。施密特坚持认为，在谷歌，你只为有效的东西付费。\n卡尔马津吓坏了。他是一个老派的广告人，在他的家乡，一个超级碗的广告花费了300万美元。为什么？因为这就是它的价格。它能产生什么呢？谁知道呢。\n卡尔马津说：我每年卖出250亿美元的广告。&#34；为什么我要让任何人知道什么管用，什么不管用？&#34；\n他双手交叉靠在桌子上，凝视着他的主人，告诉他们：你们在玩弄魔术。\n一个多世纪以来，广告是一门艺术，而不是一门科学。硬数据并不存在。一位这类的广告大师宣称：你们所说的爱情是像我这样的人为了推销而发明的--广告商只能希望这是真的。你把你的商业广告放在电视上，把你的品牌放在报纸上，然后你开始祈祷。有人会看到这则广告吗？有人会为此采取行动吗？没人知道。\n20世纪90年代初，互联网为那个广告时代敲响了丧钟。今天，我们不再生活在广告狂人的时代，而是生活在数学人的时代。\n寻找客户、点击、转换？谷歌和Facebook知道在哪里可以找到它们。以前所未有的精确度，这些数据巨头将在正确的时间将正确的消息传递给正确的人。低调的网民被引诱进入网店，犹豫不决的选民被告知美国总统候选人伊丽莎白·沃伦(Elizabeth Warren)的邪恶，潜在买家的屏幕上飞驰而过的汽车-试驾只需点击一下即可。\n但这些都是真的吗？关于数字广告的有效性，我们真正了解多少？广告平台擅长操纵我们吗？\n如果你认为最后一个问题的答案是：是的，非常好，这是情有可原的。毕竟，市场是巨大的。花在互联网广告上的钱每年都在增加。根据研究公司eMarketer的数据，2018年，全球数字广告支出超过2730亿美元。其中大部分广告是从两家公司购买的：谷歌(2018年为1160亿美元)和Facebook(2018年为545亿美元)。\n报纸上充斥着关于这些科技巨头的秘密活动的论文。根据这位以色列思想家的说法，大数据系统“比我们自己更了解人类”只是个时间问题。\n哈佛大学教授肖莎娜·祖博夫(Shoshana Zuboff)预测将出现“第七次灭绝浪潮”，届时人类将失去“意志的意志”。狡猾的营销者可以预测和操纵我们的行为。Facebook了解你的灵魂。谷歌正在侵入你的大脑。\n我也曾经相信这些科技巨头是无所不知的实体。但在写这篇文章的过程中，我开始意识到，这种观点既是错误的，也是流行的。\n一位前Facebook工程师曾经说过(他的话被引用了一千多次)：我们这一代人中最聪明的人正在考虑如何让人们点击广告。我采访了其中一些最优秀的人：曾受雇于硅谷最强大公司的经济学家：雅虎(Yahoo！)、谷歌(Google)、微软(Microsoft)、eBay、Facebook、Netflix、潘多拉(Pandora)和亚马逊(Amazon)。\n这个故事是关于组织，以及为什么它们如此难以改变。这是关于我们，以及我们是多么容易被操纵。\n它们并不总是那么容易拿到。我会在10月下旬发送一封电子邮件，也许他们会在1月份有一个小时的时间，在欧洲的某个不虔诚的时间。然后是语言障碍。这些家伙不会说英语，但流利的我的经济并不全是糟糕的，但两个小时的豪斯曼测试，增量投标和外源变化太多了，即使对我这样的狂热分子来说也是如此。\n尽管如此，在行话中夹杂着足够多的轶事，让你头晕目眩。他们会用通俗易懂的英语说出一句话，让我在这一天剩下的时间里都在琢磨。\n从这些对话中出现的故事不仅仅是关于在线广告的。这是一个受非理性支配的25万亿美元的市场。它是关于可知的，关于为什么即使是最大的数据集也不总是提供洞察力。这是关于组织，以及为什么它们如此难以改变。这是关于我们，以及我们是多么容易被操纵。\n有一件事逐渐变得清晰起来：这些家伙在玩弄魔法。而且没有人知道这一点。或者正如曾在雅虎工作的加勒特·约翰逊(Garrett Johnson)告诉我的那样：我没有人敲开我的门，告诉我我他妈的篡改了他们的魔力，因为…。嗯，他们甚至都不知道我是谁。\n史蒂夫·塔德利斯是这群人中最平易近人的。他立即回复了我的电子邮件：我很乐意与你交谈。\n这一切都始于给一位数据顾问打了一个超现实的电话。2011年8月，塔德利斯去eBay工作了一年，当时他是加州大学伯克利分校(University of California，Berkeley)的经济学教授。\n在他与eBay营销团队的第一次谈话中，他们邀请他与他们的顾问坐下来。顾问们可以告诉他eBay的每一次广告活动都有多大的利润。既然塔德利斯是一名经济学家，也许他想问问他们他们的方法。\n当Tadelis联系到他时，一位顾问在电话中说，他拥有专有的转换功能。他们使用专有的转换功能，拥有25年的经验，并拥有一长串知名客户。\n当Tadelis追问他们时，他意识到“专有的转换函数”只不过是对普通统计数据的巧妙掩饰。你把每周的广告支出和每周的销售额结合起来，就是这样！把混合物折成散点图，看看会发生什么。\n相关性，就像任何统计基础课程都会告诉你的那样，不是因果关系。如果看到你广告的人和本来打算使用eBay的人完全一样，那么这些令人印象深刻的数字意味着什么呢？易趣可不是小菜一碟。当然，许多寻找鞋子的人最终都会自己出现在在线拍卖网站上，无论他们是否看到广告？\n想象一下这个。路易吉的披萨店雇佣了三名青少年向路人发放优惠券。经过几周的飞行，三个人中的一个被证明是营销天才。顾客总是拿着这个孩子分发的优惠券出现。另外两个人完全搞不懂：他是怎么做到的？当他们问他时，他解释说：我站在披萨店的等候区。\n很明显，那个少年不是营销高手。披萨店不会通过向已经计划在五分钟后订购Quattro Stagioni的人提供优惠券来吸引更多的顾客。\n经济学家将此称为选择效应。对于广告商来说，将这种选择效应(人们看到你的广告，但我们已经打算点击、购买、注册或下载)与广告效应(人们看到你的广告，这就是他们开始点击、购买、注册、下载的原因)区分开来是至关重要的。Tadelis问顾问们到底是如何做出这种区分的。\n我们使用拉格朗日乘数，其中一人说。有那么一秒钟，塔德利斯大吃一惊。什么？拉格朗日乘数？但拉格朗日乘数与……没有任何关系……然后我突然想到，塔德利斯回忆道。这家伙想用行话胜过我！\n我忍住了说：“对不起，你完蛋了，这是我教的。”&取而代之的是，塔德利斯决定继续用经济术语交谈。\n“拉格朗日乘数，太有意思了，”他回答说。现在我知道你们有一个有约束的优化模型，我们都知道，拉格朗日乘数是目标函数中约束的影子。我们都知道这一点，对吧？\n史蒂夫，你在用手机吗？因为你们要分手了，我听不见你们说话。\n两周后，塔德利斯亲自会见了营销顾问。顾问们整理了一份圆滑的演示文稿，展示了eBay如何通过其出色的广告宣传活动赚取了大量现金。塔德利斯回忆说：我环顾房间四周，看到的都是点头的人。\n演示告诉他，品牌关键词广告是eBay最成功的广告方式。有人在谷歌上搜索eBay，谷歌收取费用，在搜索结果的顶部放置了一个指向eBay的链接。显然，很多人点击了这个付费链接。根据顾问们的说法，如此多的人，以至于拍卖网站在品牌关键词广告上每花费一美元至少能赚取12.28美元-这是一个丰厚的利润！\n塔德利斯不买帐。我认为它太棒了，我不是说它特别好或特别吸引人。我的意思是富有想象力的、幻想的、远离现实的。&#34；他的理论基础是什么？人们确实经常点击eBay.com的付费链接。但如果那里没有这个链接，他们大概会点击它正下方的链接：eBay.com的免费链接。数据咨询公司的利润计算是基于他们无论如何都会获得的点击量。\nTadelis建议进行一个实验：暂时停止广告，让我们看看品牌关键词广告是否真的奏效。顾问们抱怨道。\n几周后，当Tadelis就后续会议联系顾问时，他被告知后续会议来来去去。他没有被邀请。\n不过，在那次尴尬的演讲几个月后，塔德利斯终于有机会进行他的实验。eBay的市场部和MSN网络(必应和雅虎！)之间发生了冲突。eBay想要协商更低的价格，为了获得筹码，决定停止关键字“eBay”的广告。\n塔德利斯直截了当地谈到了正事。他和他的团队一起仔细分析了停播广告的影响。三个月后，结果很明显：以前所有来自付费链接的流量现在都是通过普通链接进入的。塔德利斯一直以来都是对的。每年，eBay在针对关键词“eBay”的广告上花费了2000万美元。\n当Tadelis向公司提交他的发现时，eBay的财务部门终于醒悟了。\n这位经济学家被放手了：他被允许在全美三分之一的地区暂停eBay在谷歌上的所有广告三个月。不仅是品牌自己的名字，还包括那些与简单关键词匹配的关键词，比如鞋子、衬衫和玻璃器皿等简单的关键字样。(#34；Shoes&34；，&#34；T恤&#34；，&#34；Glassware&#34；，&#34；Shoes&34；，&#34；)。\n营销部预料到了一场灾难：他们认为，销售额肯定会下降至少5%。\n实验又持续了八周。撤下广告的效果如何？几乎没有。根据Tadelis的计算，eBay在搜索广告上每花一美元，他们就会得到回报。\n对于营销部来说，一切都进行得非常顺利。高薪顾问曾认为，损失最大的广告活动最有利可图：他们认为品牌关键词广告不是2000万美元的支出，而是2.456亿美元的回报。\n对于塔德利斯来说，这让他大开眼界。我有一种大多数经济学家都有的信念：企业都在做广告，所以肯定是好的。因为不然的话，他们为什么要这么做呢？他补充道：但在我在eBay的经历之后，这一切都不存在了。\n我和塔德利斯一样感到惊讶。愤世嫉俗的广告界是我可以想通的东西，但又是天真的吗？但我与这些经济学家交谈得越多，我就越意识到eBay并不是唯一犯下这个错误的人。\n我采访了兰德尔·刘易斯(Randall Lewis)，他曾在雅虎、谷歌和Netflix工作，现在是广告平台Nanigans的研究主管。对于这类人来说，刘易斯在某种程度上是一位无与伦比的艺术家。(曾在谷歌与刘易斯共事的约翰逊后来向我坦言：我带到谈判桌上的一个优势是，我擅长将兰德尔的天才转化为我们其他人都能理解的东西。)。\n刘易斯是这一点的一部分，这意味着他有八年多让广告商失望的经验。他告诉我，这总是很尴尬。他们认为一切都很美好。但是当你在做这些实验的时候，…。嗯，当事情看起来好得令人难以置信时，它们通常是真的。\n刘易斯解释说，整件事是梨形的，因为在很大程度上，这个行业受到了同样错误的统计思路的支配。在线营销界与路易吉的披萨店和处理传单的青少年有着相同的战略。这就是eBay在搜索广告方面出了问题的地方。但横幅广告、Instagram视频和Facebook广告也会发生同样的情况。\n广告公司使用的基准-旨在衡量广告被观看后的点击量、销售额和下载量-从根本上是具有误导性的。这些基准都没有区分选择效应(点击、购买和下载无论如何都在发生)和广告效果(没有广告就不会发生的点击、购买和下载)。\n更糟糕的是：这一代人中最聪明的人正在创造算法，这些算法只会增加选择的效果。\n考虑以下几点：如果亚马逊从Facebook和谷歌购买点击量，广告平台的算法将寻找亚马逊点击量。谁最有可能点击亚马逊呢？大概是亚马逊的常客吧。在这种情况下，算法会生成点击，但不一定会产生额外的点击。\n不只是广告平台容易受到这种有缺陷的思维方式的影响。广告商也犯了同样的错误。他们针对的是已经很有可能购买他们产品的受众，投放个性化广告。你看了雷诺的广告，然后你的屏幕就被Twingos占据了。你把一件衣服放在网上购物篮里，然后它就会在互联网上跟踪你。你喜欢，现在你的时间表里满是活动(《2019兽人节：带上你的战斧！》)。\n但谁知道呢，也许你真的会买下那条裙子，也许你已经看中Twingo好几个月了，也许你刚刚订购了一把战斧。\n大多数广告公司向其复杂的算法竖井提供满满的数据，即使这种做法从未交付预期的结果。\n我从来没有真正想过这一点。算法定向可能在技术上很巧妙，但如果你瞄准的是错误的东西，那么它对广告商来说是没有用的。大多数广告平台无法告诉客户，他们的算法是将全自动青少年放在等候区(增加了选择效果)，还是引入了本来不会进来的人(增加了广告效果)。\n我们目前的假设是，广告公司总是从更多的数据中受益。当然，现场游戏更有可能吸引玩家。但是，大多数广告公司向其复杂的算法竖井提供满满的数据，即使这种做法从未产生预期的结果。在最坏的情况下，所有这些侵犯隐私的行为甚至可能导致针对错误的人群。\n这一见解在有关在线隐私的辩论中明显缺失。目前，我们甚至不知道所有这些侵犯隐私的行为是否如广告所说的那样奏效。\n幸运的是，有一种方法可以衡量广告的纯粹效果：做个实验。事先将目标群体随机分成两组：一组看到广告，另一组不看。这样，设计实验就排除了选择的影响。\n大型零售商Facebook的经济学家发起了一场Facebook运动。最初的假设是，零售商的广告只需在一个人面前播放1490次，但实验显示，这些人中的许多人无论如何都会在那里购物；只有14300人中有一人因为广告而找到了这家网店。换言之，选拔效果几乎比单独的广告效果强10倍！\n这也不例外。在大多数Facebook实验中，选择效应大大超过了广告效应。\n在Facebook的15个实验中，有7个没有选择效应的广告效果非常小，以至于\n现在，我们来到了也许是最基本的问题：广告到底有什么真正需要知道的？广告商如何才能确切地知道他们的广告带来了什么？\n谷歌首席执行官埃里克·施密特(Eric Schmidt)告诉他的电视同事梅尔·卡尔马津(Mel Karmazin)，当谈到在线广告时，这个问题很容易回答。刘易斯继续为施密特工作，但他为雅虎！2011年揭穿了这一说法。他论文的标题是：\n失望一直是这项研究的驱动力。在雅虎，刘易斯做了25个巨大的广告实验。尽管如此，他对广告的实际效果仍有很大的不确定性。\n约翰逊回忆说，人们认为，在一百万人的实验之后，我们可以走开，确切地知道广告是如何运作的。他补充说，如果你有一百万，你应该可以数到天使在大头针上跳舞。\n那么到底出了什么问题呢？如果你想量小的东西，你就得量大。比方说，我想知道有多少人患有罕见的囊性纤维化。囊性纤维化影响每3400人中就有一人(0.03%)。但假设我不知道这一点。\n于是我打开电话簿，拨打了一万个人的电话。外加另外一万美元。再来一万。然后再来一万。\n所以你看，我的民调结果到处都是。10，000个样本实在太小了，无法得到可靠的估计。我们最好给一百万人打电话。再加一百万。再加一百万。现在我们有进展了。\n想象一下，如果我想知道去年有多少人感染了流感(每20人中就有一人)。一万个电话就足以得到可靠的估计。更多的人感染流感，所以流感研究可以有更小的测试小组。\n关键是，广告就像囊性纤维化，而不是流感。即便如此，这对囊性纤维化也是极其不公平的，因为人们因为看到广告而买东西，甚至比囊性纤维化还要罕见。\n约翰逊叹了口气：给人们看他们不想看的照片和电影，很难改变他们的行为。\n为了说明这一点，请看史蒂夫·塔德利斯(Steve Tadelis)对eBay的研究。eBay在谷歌搜索广告上每投入一美元，就会损失63美分，但这实际上是一个不准确的估计。如果这个实验无限重复(又一次广告停止，又一次广告停止，又一次广告停止…)，在所有广告停止中，95%的真实亏损将落在负1.24美元到负0.03美元的范围内。这就是统计学家所说的置信区间。在广告研究中，置信区间往往很大。\neBay的表现如此低劣，以至于唯一合乎逻辑的结论是：停止购买搜索广告！但是，如果eBay的营销稍微有效一点--比如说他们每投资一美元只损失10美分--那么他们的实验就会显示出这一点。\n..", "note_en": "Mel Karmazin, the president of Viacom, one of the largest media conglomerates in the world, walked into the Google offices in Mountain View, California. Google was a hip, young tech company that made money – actual money! – off the internet. Karmazin was there to find out how.\n Larry Page and Eric Schmidt, Google’s founder and its CEO respectively, were already seated in the conference room when co-founder Sergey Brin came in, out of breath. He was wearing shorts. And roller skates.\n   The Google guys told Karmazin that the search engine’s earnings came from selling advertisements. Companies could buy paid links to websites that would appear at the top of users’ search results. And Google worked as a middleman, connecting websites with ad space to advertisers eager to get their banners seen.\n Schmidt continued: &#34;Our business is highly measurable. We know that if you spend X dollars on ads, you’ll get Y dollars in revenues.&#34; At Google, Schmidt maintained, you pay only for what works.\n Karmazin was horrified. He was an old fashioned advertising man, and where he came from, a Super Bowl ad cost three million dollars. Why? Because that’s how much it cost. What does it yield? Who knows.\n &#34;I’m selling $25bn of advertising a year,&#34; Karmazin said. &#34;Why would I want anyone to know what works and what doesn’t?&#34;\n Leaning on the table, hands folded, he gazed at his hosts and told them: &#34;You’re fucking with the magic.&#34;\n  For more than a century, advertising was an art, not a science. Hard data didn’t exist. An advertising guru of the   type proclaimed: &#34;What you call love was invented by guys like me to sell   – and advertisers could only hope it was true. You put your commercials on the air, you put your brand in the paper, and you started praying. Would anyone see the ad? Would anyone act on it? Nobody knew.\n In the early 1990s, the internet sounded the death knell for that era of advertising. Today, we no longer live in the age of Mad Men, but of Math Men.\n Looking for customers, clicks, conversions? Google and Facebook know where to find them. With unprecedented precision, these data giants will get the right message delivered to the right people at the right time. Unassuming internet users are lured into online shops, undecided voters are informed about the evils of US presidential candidate Elizabeth Warren, and cars zip by on the screens of potential buyers – a test drive is only a click away.\n But is any of it real? What do we really know about the effectiveness of digital advertising? Are advertising platforms any good at manipulating us?\n You’d be forgiven for thinking the answer to that last question is: yes, extremely good. After all, the market is huge. The amount of money spent on internet ads goes up each year. In 2018, more than $273bn dollars was spent on digital ads globally, according to research firm eMarketer. Most of those ads were purchased from two companies: Google ($116bn in 2018) and Facebook ($54.5bn in 2018).\n   Newspapers are teeming with treatises about these tech giants’ saturnine activities. \t\t  according to the Israeli thinker, it’s only a matter of time before big data systems “understand humans much better than we understand ourselves.&#34;\n Harvard professor Shoshana Zuboff predicts a “seventh extinction wave”, where human beings lose “the will to will”. Cunning marketers can predict and manipulate our behaviour. Facebook knows your soul. Google is hacking your brain.\n  I too used to believe that these tech giants were all-knowing entities. But while writing this story, I have come to realise that this belief is as wrong as it is popular.\n A former Facebook engineer once said (and he’s been quoted a thousand times over): &#34;The best minds of my generation are thinking about how to make people click on ads.&#34; I spoke to some of those best minds: economists employed and formerly employed by the most powerful companies in Silicon Valley: Yahoo!, Google, Microsoft, eBay, Facebook, Netflix, Pandora and Amazon.\n This story is about organisations and why they are so hard to change. And it’s about us, and how easy we are to manipulate.\n They weren’t always easy to get hold of. I’d send an email in late October, and perhaps they would have an hour in January, at some ungodly hour in Europe. And then there was the language barrier. These guys did not speak English, but fluent   My Economese is not all bad, but two hours of Hausman tests, incremental bidding, and exogenous variation is too much, even for an enthusiast such as myself.\n Still, mixed in with the jargon, there were enough anecdotes to make your head spin. They would utter one line in plain English that I’d end up mulling over the rest of the day.\n The story that emerged from these conversations is about much more than just online advertising. It’s about a market of a quarter of a trillion dollars governed by irrationality. It’s about knowables, about how even the biggest data sets don’t always provide insight. It’s about organisations and why they are so hard to change. And it’s about us, and how easy we are to manipulate.\n One thing was gradually becoming clear: these guys are fucking with the magic. And nobody knows it. Or as Garrett Johnson, who used to work for Yahoo!, told me: &#34;I don’t have anybody pounding down my door telling me I’m fucking with their magic, because … well, they don’t even know who I am.&#34;\n   Steve Tadelis was the most accessible of the bunch. He instantly replied to my email: &#34;I would be delighted to talk.&#34;\n  It all started with a surrealistic phone call to a data consultant. Tadelis was a professor of economics at the University of California, Berkeley when he went and spent a year at eBay in August 2011.\n During one of his first conversations with eBay’s marketing team, they invited him to sit down with their consultants. The consultants could tell him how profitable each of eBay’s ad campaigns had been. And since Tadelis was an economist, maybe he’d like to quiz them about their methods.\n &#34;Proprietary transformation functions,&#34; one of the consultants had said on the phone when Tadelis reached out. They used proprietary transformation functions, had 25 years of experience, and a long list of prominent clients.\n When Tadelis pressed them he realised that “proprietary transformation functions” was only a clever disguise for your garden-variety statistics. You take the weekly expenditure on ads, combine it with the weekly sales, and voila! Fold the mixture into a scatter plot and see what happens.\n    Correlation, as any Statistics 101 class will inform you, is not causation. What do these impressive numbers mean if the people who see your ad are the exact same people who were going to use eBay anyway? eBay is no small fry. Surely lots of people looking for shoes end up on the online auction site all by themselves, whether they see an ad or not?\n Picture this. Luigi’s Pizzeria hires three teenagers to hand out coupons to passersby. After a few weeks of flyering, one of the three turns out to be a marketing genius. Customers keep showing up with coupons distributed by this particular kid. The other two can’t make any sense of it: how does he do it? When they ask him, he explains: &#34;I stand in the waiting area of the pizzeria.&#34;\n It’s plain to see that junior’s no marketing whiz. Pizzerias do not attract more customers by giving coupons to people already planning to order a quattro stagioni five minutes from now.\n  Economists refer to this as a &#34;selection effect.&#34; It is crucial for advertisers to distinguish such a selection effect (people see your ad, but were already going to click, buy, register, or download) from the advertising effect (people see your ad, and that’s why they start clicking, buying, registering, downloading). Tadelis asked how exactly the consultants made this distinction.\n &#34;We use Lagrange multipliers,&#34; one of them said. And for a second, Tadelis was astounded. What? Lagrange multipliers? But Lagrange multipliers don’t have anything to do with ...&#34;Then it hit me,&#34; Tadelis recalled. &#34;This guy is trying to out-jargon me!&#34;\n &#34;I resisted the temptation to say: ‘I’m sorry, you’re fucked, I actually teach this stuff.’&#34; Instead, Tadelis decided to continue the conversation in Economese.\n &#34;Lagrange multipliers, that’s fascinating,&#34; he replied. &#34;So now I know you have a constrained optimisation model, and as we all know the Lagrange multipliers are the shadow values of the constraints in the objective function. We all know this, right?&#34;\n    &#34;Steve, are you on a cell phone? Because you’re breaking up and I can’t hear you.&#34;\n  Two weeks later, Tadelis met the marketing consultants in the flesh. The advisers had put together a slick presentation demonstrating how eBay was raking in piles of cash with its brilliant ad campaigns. Tadelis recalled: &#34;I looked around the room, and all I saw were people nodding their heads.&#34;\n   Brand keyword advertising, the presentation informed him, was eBay’s most successful advertising method. Somebody googles &#34;eBay&#34; and for a fee, Google places a link to eBay at the top of the search results. Lots of people, apparently, click on this paid link. So many people, according to the consultants, that the auction website earns at least $12.28 for every dollar it spends on brand keyword advertising – a hefty profit!\n Tadelis didn’t buy it. &#34;I thought it was fantastic, and I don’t mean extraordinarily good or attractive. I mean imaginative, fanciful, remote from reality.&#34; His rationale? People really do click on the paid-link to eBay.com an awful lot. But if that link weren’t there, presumably they would click on the link just below it: the free link to eBay.com. The data consultants were basing their profit calculations on clicks they would be getting anyway.\n Tadelis suggested an experiment: stop advertising for a while, and let’s see whether brand keyword advertising really works. The consultants grumbled.\n When, a few weeks later, Tadelis contacted the consultants about a follow-up meeting, he was told the follow-up had come and gone. He hadn’t been invited.\n A few months after the awkward presentation, though, Tadelis got the chance to conduct his experiment after all. There was a clash going on between the marketing department at eBay and the MSN network (Bing and Yahoo!). Ebay wanted to negotiate lower prices, and to get leverage decided to stop ads for the keyword ‘eBay’.\n Tadelis got right down to business. Together with his team, he carefully analysed the effects of the ad stop. Three months later, the results were clear: all the traffic that had previously come from paid links was now coming in through ordinary links. Tadelis had been right all along. Annually, eBay was burning a good $20m on ads targeting the keyword ‘eBay’.\n   When Tadelis presented his findings to the company, eBay’s financial department finally woke up.\n The economist was given a free hand: he was permitted to halt all of eBay’s ads on Google for three months throughout a third of the United States. Not just those for the brand’s own name, but also those targeted to match simple keywords like &#34;shoes&#34;, &#34;shirts&#34; and &#34;glassware&#34;.\n The marketing department anticipated a disaster: sales, they thought, were certain to drop at least 5%.\n    The experiment continued for another eight weeks. What was the effect of pulling the ads? Almost none. For every dollar eBay spent on search advertising, they   according to Tadelis’s calculations.\n  To the marketing department everything had been going brilliantly. The high-paid consultants had believed that the campaigns that incurred the biggest losses were the most profitable: they saw brand keyword advertising not as a $20m expense, but a $245.6m return.\n For Tadelis, it was an eye-opener. &#34;I kind of had the belief that most economists have: businesses are advertising, so it must be good. Because otherwise why would they do it?&#34; He added: &#34;But after my experience at eBay that’s all out of the window.&#34;\n   I felt just as surprised as Tadelis had been. A cynical advertising world is something I can get my head around, but a naive one? But the more I talked to these economists, the more I realised that eBay was not alone in making this mistake.\n I spoke to Randall Lewis, who used to work for Yahoo!, Google and Netflix, and is currently head of research for the ad platform Nanigans. For the type, Lewis was something of an unparalleled virtuoso. (Johnson, who worked with Lewis at Google, later confessed to me: &#34;One of the strengths that I bring to the table is that I’m good at translating Randall’s genius into something the rest of us can understand.&#34;)\n  Lewis had been part     This meant that he had more than eight years of experience disappointing advertisers. &#34;It’s always awkward,&#34; he told me. &#34;They think everything is rosy. But when you’re running these experiments … well, when things look too good to be true, they usually are.&#34;\n Lewis explained that the whole thing is pear-shaped because for the most part, the industry is in the sway of the same wrong-headed statistical line of thought. The online marketing world has the same strategy as Luigi’s Pizzeria and the flyer-handling teens. That’s where eBay had gone wrong with search advertising. But the same thing happens with banner advertising, Instagram videos and Facebook ads.\n The benchmarks that advertising companies use – intended to measure the number of clicks, sales and downloads that occur after an ad is viewed – are fundamentally misleading. None of these benchmarks distinguish between the selection effect (clicks, purchases and downloads that are happening anyway) and the advertising effect (clicks, purchases and downloads that would not have happened without ads).\n It gets worse: the brightest minds of this generation are creating algorithms which only increase the effects of selection.\n   Consider the following: if Amazon buys clicks from Facebook and Google, the advertising platforms’ algorithms will seek out Amazon clickers. And who is most likely to click on Amazon? Presumably Amazon’s regular customers. In that case the algorithms are generating clicks, but not necessarily extra clicks.\n Advertising platforms are not the only ones susceptible to this flawed way of thinking. Advertisers make the same error. They’re targeting personalised ads at an audience that is already very likely to buy their product. You watch a Renault commercial, and then your screen is taken over by Twingos. You put a dress in an online shopping basket, then it’s stalking you across the internet. You liked  , and now your timeline is full of   events (“OrcFest 2019: bring your battle axe!”).\n But who knows, maybe you really would have bought that dress anyway, maybe you’ve had your eye on a Twingo for months, and perhaps you’ve just ordered a battle axe.\n The majority of advertising companies feed their complex algorithms silos full of data even though the practice never delivers the desired result.\n I had never really thought about this. Algorithmic targeting may be technologically ingenious, but if you’re targeting the wrong thing then it’s of no use to advertisers. Most advertising platforms can’t tell clients whether their algorithms are just putting fully-automated teenagers in the waiting area (increasing the selection effect) or whether they’re bringing in people who wouldn’t have come in otherwise (increasing the advertising effect).\n  We currently assume that advertising companies always benefit from more data. And certainly, live-gaming is more likely to appeal to gamers. But the majority of advertising companies feed their complex algorithms silos full of data even though the practice never delivers the desired result. In the worst case, all that invasion of privacy can even lead to targeting the wrong group of people.\n This insight is conspicuously absent from the debate about online privacy. At the moment, we don’t even know whether all this privacy violation works as advertised.\n  Luckily there is a way to measure the unadulterated effect of ads: do an experiment. Divide the target group into two random cohorts in advance: one group sees the ad, the other does not. Designing the experiment thus excludes the effects of selection.\n Economists at Facebook \t\t  A large retailer launched a Facebook campaign. Initially it was assumed that the retailer’s ad would only have to be shown 1,490 times before one person   But the experiment revealed that many of those people would have shopped there anyway; only one in 14,300 found the webshop because of the ad. In other words, the selection effects were almost 10 times stronger than the advertising effect alone!\n And this was no exception. Selection effects substantially outweighed advertising effects in most of these Facebook experiments.\n   In seven of the 15 Facebook experiments, advertising effects without selection effects were so small as to be\n   Now we arrive at perhaps the most fundamental question: what, in the end, is there really to know in advertising? Can advertisers ever know exactly what their ad brings in?\n Google CEO Eric Schmidt told his TV colleague Mel Karmazin that when it comes to online advertising, that question was easy to answer. Lewis went on to work for Schmidt, but research he conducted for Yahoo! in 2011 puts the lie to that claim. The title of his paper:\n Disappointment had been the study’s driving force. At Yahoo!, Lewis had run 25 gigantic ad-experiments. And still, he was left with a lot of uncertainty about the actual effects of advertising.\n &#34;People thought that after a one-million-person experiment, we could walk away, and know exactly how advertising works,&#34; Johnson recalled. He added, &#34;if you’ve got a million you should be able to count angels dancing on pins.&#34;\n    So what went wrong? If you want to measure something small, you have to go big. Let’s say I want to know how many people have the rare disease cystic fibrosis. Cystic fibrosis affects one in 3,400 people (0.03%). But let’s say I don’t know that.\n    So I open the phone book and I call 10,000 people. Plus another 10,000. And another 10,000. Then another 10,000.\n      So you see, the results of my poll are all over the place. 10,000 is simply too small a sample to get reliable estimates. We’d better call a million people. And another million. And another million. Now we’re getting somewhere.\n      Imagine, then, that I had wanted to know how many people had contracted the flu last year (one in 20). Ten thousand calls would have been enough to get reliable estimates. More people get the flu, so a flu study can have smaller test groups.\n   The point is, advertising is like cystic fibrosis, not the flu. And even that’s extremely unfair to cystic fibrosis, since people buying things because they saw an ad is even rarer than cystic fibrosis.\n    Johnson sighs: &#34;It’s very hard to change behaviour by showing people pictures and movies that they don’t want to look at.&#34;\n To illustrate, consider Steve Tadelis’s eBay research. Ebay lost 63 cents on every dollar they put into Google search advertising, but that’s actually an imprecise estimate. If the experiment were to be replicated infinitely (and another ad stop, and another ad stop, and another ad stop...), in 95% of all ad stops the true loss would fall in the range of negative $1.24 and negative $0.03. This is what statisticians call the confidence interval. In advertising research, the confidence interval tends to be huge.\n EBay’s performance was so shoddy that the only logical conclusion would have been: stop buying search ads! But if eBay’s marketing had been just a tiny bit more effective – say they only lost 10 cents on every dollar they invested – then their experiment would have shown that t\n......", "posttime": "2020-05-07 22:18:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,泡沫,bubble", "title": "新的网络泡沫出现了：它被称为在线广告", "title_en": "The new dot com bubble is here: it’s called online advertising", "transed": 1, "url": "https://thecorrespondent.com/100/the-new-dot-com-bubble-is-here-its-called-online-advertising/", "via": "", "real_tags": ["广告", "泡沫", "bubble"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001090, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们对这场比赛很兴奋，我们也很兴奋能在影响到我们认识的每个人的安全方面工作。\n几周来，地球上的每个人都面临着同样的问题：如果我们不能亲自见面，我们如何让生活继续前进？教师、小企业、大企业、地方政府，甚至我们的家人：他们都转向了视频通信。多亏了屏幕和摄像头，全世界的联系都没有中断，Zoom已经从一个企业应用程序爆炸式地变成了一个家庭名称，帮助保持了经济活力和家庭团聚。\n数以亿计的参与者(免费和付费)每天都在使用它。我的邻居，一位出色的艺术家，雕刻并绘制了这个：", "note_en": "We&#39;re thrilled with the match, and we&#39;re excited to be working on security that affects everyone we know.\n  For many weeks, everyone on earth has faced the same question:  &#34;How do we keep life moving forward if we can&#39;t meet in person?&#34; Teachers, small businesses, big businesses, local governments, and even our families: they&#39;ve all turned to video communications. The world&#39;s connections areunbroken thanks to screens and cameras, and Zoom has exploded from an enterprise application to a householdname, helping to keep the economy alive andfamilies together.\n Hundreds of millions of participants (free and paid) are using it every day. My neighbor, awoodworking artist, carved and painted this:", "posttime": "2020-05-07 22:03:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "加入,joins,家庭", "title": "密钥库加入缩放", "title_en": "Keybase Joins Zoom", "transed": 1, "url": "https://keybase.io/blog/keybase-joins-zoom", "via": "", "real_tags": ["加入", "joins", "家庭"]}, {"category": "", "categoryclass": "", "imagename": "a8ee8a30e3c9107f0f9e82b4270b0d05.jpg", "infoid": 1001089, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Bleepingcomputer获悉，一名黑客声称从微软的私人GitHub存储库窃取了超过500 GB的数据。\n今天晚上，一位名为“闪亮的猎人”的黑客联系了BleepingComputer，告诉我们他们已经侵入了微软GitHub的账户，获得了对软件巨头私人存储库的完全访问权限。\n这位人士告诉我们，他们随后下载了500 GB的私人项目，最初计划出售，但现在决定免费泄露。\n根据泄露文件中的文件印章，泄密事件可能发生在2020年3月28日。\n作为一个预告片，黑客在一个黑客论坛上提供了1 GB的文件，供注册成员使用网站信用来访问泄露的数据。\n由于一些泄露的文件包含中文文本或对latelee.org或中文文本的引用，论坛上的其他威胁行为者并不认为这些数据是真实的。\n在发送到beepingcomputer的目录列表和其他私人存储库的样本中，被盗数据似乎主要是代码样本、测试项目、一本电子书和其他通用项目。\n一些私有存储库看起来更有趣一些，比如名为Some&#39；wssd cloud agent的存储库、一个Rust/WinRT语言投影项目和一个PowerSweep&39；PowerShell项目。(译者注：有些私有存储库看起来更有趣，比如名为Some&#39；wssd cloud agent的存储库、一个Rust/WinRT语言投影项目和一个PowerShell项目)。\n总体而言，从分享的内容来看，似乎没有什么值得微软担心的重大问题，比如Windows或Microsoft Office源代码。\n遭到入侵的网络情报公司在黑客论坛上看到了泄密事件，也认为没有什么可担心的。\n他们确实表达了担忧，认为私有API密钥或密码可能会像其他开发人员过去所做的那样，意外地落在一些私人储存库中。\n微软员工山姆·史密斯根据泄密事件回复推特称，他认为泄密是假的，因为微软有一条“规定”，GitHub的回购必须在30天内公开。\nBleepingcomputer已联系Microsoft确认这些文件是否真的是合法文件，但尚未收到答复。", "note_en": "A hacker claims to have stolen over 500GB of data from Microsoft&#39;s private GitHub repositories, BleepingComputer has learned.\n This evening, a hacker going by the name Shiny Hunters contacted BleepingComputer to tell us they had hacked into the Microsoft GitHub account, gaining full access to the software giant&#39;s &#39;Private&#39; repositories.\n  The individual told us that they then downloaded 500GB of private projects and initially planned on selling it, but has now decided to leak it for free\n Based on the file stamps in the leaked files, the breach may have occurred on March 28th, 2020.\n    As a teaser, the hacker offered 1GB of files on a hacker forum for registered members to use site &#39;credits&#39; to gain access to the leaked data.\n As some of the leaked files contain Chinese text or references to latelee.org or Chinese text, other threat actors on the forum do not feel that the data is real.\n In a directory listing and samples of other private repositories sent to BleepingComputer, the stolen data appears to be mostly code samples, test projects, an eBook, and other generic items.\n Some private repositories look a bit more interesting such as ones named some &#39;wssd cloud agent&#39;, a The Rust/WinRT language projection&#39;, and a &#39;PowerSweep&#39; PowerShell project.\n Overall, from what was shared, there does not appear to be anything significant for Microsoft to worry about, such as Windows or Office source code.\n Cyber intelligence firm Under the Breach, who saw the leak on the hacker forum, also does not think there is much to worry about.\n They did express concern that private API keys or passwords could have accidentally been left behind in some of the private repositories like other developers have done in the past.\n  Microsoft employee Sam Smith  replied to Under the Breach&#39;s tweet stating that he thought the leak was fake as &#34;Msft has a “rule” that GitHub repos must be public within 30 days.&#34;\n BleepingComputer has contacted Microsoft to confirm if these are indeed legitimate files but have not received a reply.", "posttime": "2020-05-07 21:48:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,microsoft,github,微软,账户", "title": "微软GitHub账户涉嫌被黑客入侵，500 GB被盗", "title_en": "Microsoft's GitHub account allegedly hacked, 500GB stolen", "transed": 1, "url": "https://www.bleepingcomputer.com/news/security/microsofts-github-account-allegedly-hacked-500gb-stolen/", "via": "", "real_tags": ["黑客", "microsoft", "github", "微软", "账户"]}, {"category": "", "categoryclass": "", "imagename": "2825e09ac4ebe7e0746533b1b61c9eb6.jpg", "infoid": 1001088, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "js是一个构建在Vue.js之上的前端框架，它提供了很棒的开发功能，比如服务器端渲染、自动生成的路由、改进的元标签管理和SEO改进。\n我们的前端团队并没有真正考虑使用Nuxt.js作为客户端的主要技术，直到我们最近收到了一个具有许多非常具体功能的独特项目的请求。因为这也是我们团队中的几个成员第一次使用Nuxt.js，所以我决定写这个博客来解释它是如何为我们工作的。\njs为前端开发人员提供了很多好处，但是有一个关键特性让我们最终决定使用这个框架-SEO改进。我们的应用程序需要此功能，因为它不是典型的内部SPA(单页应用程序)。这是一个包含社交分享功能和管理的公共网络应用程序。\n说到社交分享，Nuxt.js有很好的元标签管理，因此我们可以根据从后端接收的数据轻松地创建特定的、可定制的社交分享窗口。这是其中一个例子。\n为了提高SEO，Nuxt.js使用SSR(服务器端呈现)。SSR正在获取Ajax数据，并在服务器(Node.js)上将Vue.js组件呈现为HTML字符串。当所有异步逻辑完成后，它会将它们直接发送到浏览器，然后最终将静态标记提供给客户端上的一个完全交互的应用程序。该特性允许使用Google SEO解析器对DOM元素进行很好的解析。当加载网站DOM时，SEO解析器立即以极快的速度解析DOM元素。\n另一方面，使用Vue.js、Reaction、Angel等框架构建的典型SPA应用程序在加载DOM之后使用Ajax从后端获取数据，因此SEO解析器无法解析所有的DOM元素，因为还没有呈现。Ajax抓取是异步的，而SEO解析不是。\njs和Vue.js处理逻辑的方式非常不同。主要区别在于Vue总是在客户端运行，而Nuxt不是，这在某些情况下可能会导致重大问题。例如，如果您想要在加载应用程序之后立即选择DOM元素，则应用程序可能正在Node.js端运行，当然，Node.js中没有DOM元素。\n访问浏览器的本地存储时也会发生同样的情况。这就是Nuxt使用cookie而不是本地存储的主要原因-因为它们总是可以访问的。\n使用VUE，我们没有这些问题，因为它总是在客户机上运行，因此我们不必担心那些潜在的问题。\n让我们看看如何在Vue中处理这种类型的潜在问题，以及如何在Nuxt中做到这一点-通过实际的代码示例。\n这张图中最重要的是“Created”方法的提前返回。Nuxt有一个全局可访问的对象“进程”，它向我们显示我们当前是在服务器端还是在客户端运行。我们看到的代码背后的逻辑侧重于管理套接字连接，如果我们在服务器上运行，显然我们不想在接收套接字事件时更新DOM，因为服务器端没有DOM。如果这是一个Vue.js应用程序，代码将是相同的，除了早期返回部分-因为进程将始终在客户机上运行，并且永远不需要检查该特定语句。\nNuxt.js根据文件夹结构生成自己的路由器，而使用Vue.js则必须手动完成-但请记住，这两种原则各有优缺点。自动生成的路由器的优点是创建它更容易、更快。您只需创建目录和文件，Nuxt就可以完成所有工作。但缺点是，与手动编写的相比，它的可控性和可管理性较差。\n使用Vue.js，您可以轻松地将自己的逻辑添加到路由器、导入服务，并且比手动生成的路由器拥有更多的路由管理控制权。这个原则更耗时、更复杂，但这并不总是意味着它会变得更糟。\n当我们处于项目的研究阶段时(大约6个月前)，还没有值得冒险使用的可靠的打字入门工具包或配置。有很多的皮棉错误和丢失的类型，所以我们决定使用香草JS(ES6+)。同时，对Nuxt.js的TypeScript支持有了很大的改进，现在有了新的入门工具包和配置，可以随时使用，而不用担心与TypeScript相关的问题。\n糟糕的服务器端错误处理是我们在开发Nuxt.js应用程序时必须处理的最大、最苛刻的问题。当代码在Nuxt.js服务器(Node.js)端执行时，应用程序抛出非常无关的错误消息，调试和修复同样的错误非常困难和复杂。为了简化调试，有必要以特定方式处理Node.js端的错误。\n现在，有了更好的类型脚本支持和对SSR更深入的理解，我可以可靠地说Nuxt.js已经为中型和企业级应用程序做好了准备，但是仍然有改进的空间-比如Nuxt的Node.js端的更好的错误处理和Ajax管理。\nNuxt根据页面的目录和文件结构生成路由器逻辑及其路由。例如，如果我们创建一个目录和文件“about/index.vue”，Nuxt.js会自动为该页面创建路由“/about”。不需要在应用程序中的任何其他位置定义或配置路由。\n对于嵌套路由，只需在父目录内创建一个目录-“about/me/index.vue”将生成“about/me”路由。要创建动态嵌套路由或嵌套路由参数，所有需要做的就是命名带有LOCASH前缀的子目录-“user/_id/index.vue”将根据用户的id为用户创建动态嵌套路由。\njs还有一个非常有趣的与结构相关的特性-布局。js应用程序有主App.vue文件，它是所有应用程序组件的主根组件包装器。js使用布局，其中每个布局都充当应用程序组件的单独包装器。例如，如果我们希望某些特定的页面使用不同的UI库、全局CSS样式、字体系列、设计系统、元标签或其他元素，我们可以定义使用什么布局作为其父根组件。默认情况下，所有Nuxt.js页面都使用default.vue布局。\nNuxt.js中的Vuex的结构与通常的Vue.js环境几乎相同-带有存储模块。这种类型的结构是可选的，但强烈建议您进行更好的结构和代码维护。每个商店都应该根据应用程序逻辑和数据流进行结构化和模块化。例如，如果应用程序包含授权逻辑，我们必须创建授权存储模块来管理所有授权数据和逻辑，如登录、注销、cookie、令牌、用户数据等。\n开发您的第一个Nuxt.js项目一开始肯定会令人困惑和复杂，特别是如果您有Vue.js背景而没有SSR知识的话。但就像任何其他技术一样，要真正理解Nuxt.js框架的功能和好处，需要时间、错误和大量代码。对我来说，我热切地期待着我的下一个Nuxt.js项目，在那里我可以使用我学到的知识(希望还有打字脚本)，而不会遇到我之前参与的Nuxt.js+TypeScript项目的任何障碍。\n如果您有兴趣了解有关Nuxt.js的更多信息，我强烈建议您查看以下来源：\njs是一个非常强大的框架，具有许多有用的特性，使前端应用程序的开发变得更容易、更有趣。但请记住，它并不是所有类型的客户端应用程序和网站的最佳选择。\n那么，回答主要问题-Nuxt.js还是Vue.js？答案是，您必须了解每种方法的优点和缺点，还需要根据项目类型、目标和要求知道何时使用一种方法而不是另一种方法。\nNuxt通过其服务器端渲染功能提供了更好的SEO改进，通过自动通用路由器加快了开发速度，通过出色的配置选项和meta标签方法提供了公共共享功能和管理，通过预先渲染的页面自动拆分代码-所有这些都是Vue.js不可能或极其复杂的。如果您的下一个项目需要这些功能，我向您保证Nuxt.js将是一个很好的选择。\n另一方面，如果您的目标是内部产品、扩展的代码管理和覆盖范围、典型的客户端SPA、不需要SEO速率和性能，以及手动代码逻辑胜过通用解决方案，那么显而易见的选择是Vue.js，因为在处理所有这些方面，Vue.js远远优于Nuxt.js。\n_。如果您有什么想法想要讨论，请与我们的团队分享！", "note_en": "Nuxt.js is a frontend framework built upon Vue.js that offers great development features such as server side rendering, automatically generated routes, improved meta tags managing and SEO improvement.\n Our Front-end team didn’t really consider using Nuxt.js as a main technology on the client side until we recently received a request for a unique project with a number of very specific features. As this was also the first time a couple of members in our team used Nuxt.js, I decided to write this blog to explain how it worked for us.\n  Nuxt.js offers many benefits to front-end developers, but there was one key feature that made our decision to use this framework final – SEO improvement. Our application needs this feature because it is not a typical internal SPA (single-page application). It’s a public web application that includes social sharing features and management.\n Speaking of social sharing, Nuxt.js has great meta tags managing, so we could easily make specific and customisable social share windows depending on the data received from back-end. Here’s one of the examples.\n   To improve SEO, Nuxt.js uses SSR (Server Side Rendering). SSR is fetching AJAX data and rendering Vue.js components into HTML strings on the server (Node.js). It sends them directly to the browser when all asynchronous logic is done, and then finally serves the static markup into a fully interactive app on the client. This feature allows for great parsing through DOM elements with the Google SEO parser. SEO parser is parsing through DOM elements with enormous speed immediately when the website DOM is loaded.\n On the other hand, typical SPA applications built with frameworks like Vue.js, React, Angular and similar are fetching data from backend with AJAX after DOM is loaded, and therefore SEO parser is not able to parse all of the DOM elements, because there are not yet rendered. AJAX fetching is asynchronous, while SEO parsing is not.\n    Nuxt.js and Vue.js handle logic very differently. The main difference is that Vue is always running on the client side, while Nuxt is not, and that can cause major problems in some cases. For example – if you want to select a DOM element right after the application is loaded, there is a possibility that the app is running on the Node.js side, and of course, there are no DOM elements in Node.js.\n The same would happen when accessing a browser’s local storage. That is the main reason why Nuxt is using cookies over local storage – because they are always accessible.\n With Vue, we don’t have those kinds of problems because it is always running on the client, and therefore we do not have to bother with those kind of potential problems.\n Let’s see how to handle this types of potential problems in Vue and how to do it in Nuxt – with actual code examples.\n  The most important thing in this picture is the early return in the “created” method. Nuxt has a globally accessible object “process” that shows us are we currently running on the server side or the client side. The logic behind the code we see is focused on managing socket connection, and obviously we do not want to update the DOM on receiving socket events if we are running on server, because there is no DOM on the server side. If this was a Vue.js application, the code would be identical, except for the early return part – because the process would always be running on client and there would never be a need to check that particular statement.\n  Nuxt.js generates its own router based on the folder structure, while with Vue.js, it must be done manually – but keep in mind that there are pros and cons to both principles. Automatically generated router’s pros are that it is easier and faster to create one. You just create the directory and files, and Nuxt does all of the work. But the cons are that it is less controllable and manageable than a manually written one.\n  With Vue.js you can easily add your own logic to the router, import services and have more control managing routes than with a manually generated router. This principle is more time consuming and more complex, but that doesn’t always mean it is worse because of it.\n    While we were in the research phase of our project (some 6 months ago), there were no reliable Typescript start-kits or configurations whose usage was worth the risk. There were plenty of linting errors and missing types, so we decided to go with vanilla JS (ES6+). In the meantime, Typescript support for Nuxt.js has drastically improved and now there are new start-kits and configurations ready to be used without worrying about Typescript-related issues.\n Bad server-side error handling was the biggest and the most demanding issue we had to deal with while developing a Nuxt.js application. While code was executing on the Nuxt.js server (Node.js) side, the application was throwing very unrelated error messages, and it was really hard and complex to debug and fix those same errors. It was necessary to handle errors on the Node.js side in a specific way in order to make debugging simpler.\n Now, with better Typescript support and a deeper understanding of SSR, I can reliably say that Nuxt.js is ready for mid-scale and enterprise-scale applications, but there is still room for improvement – like better error handling and AJAX managing on the Node.js side of Nuxt.\n    Nuxt generates router logic and its routes based on the directory and file structure for pages. For example, if we create a directory and file  “about/index.vue”, Nuxt.js automatically creates the route  “/about” for that page. There is no need to define or configure routes anywhere else in application.\n For nested routes, creating a directory inside the parent directory is all that is necessary –  “about/me/index.vue” will generate the  “about/me” route. And for creating dynamic nested routes or nested route parameters, all that is required is to name the subdirectory with the lodash prefix –  “user/_id/index.vue” will create a dynamic nested route for users based on their id.\n  Nuxt.js has one more structure-related feature that is very interesting – layouts. Vue.js applications have the main App.vue file, which is the main root component wrapper for all application components. Nuxt.js uses layouts, where every layout serves as an individual wrapper for application components. For example, if we want some specific pages to use different UI libraries, global CSS styles, font families, design systems, meta tags or other elements, we can define what layout to use as its parent root component. By default, all Nuxt.js pages are using the default.vue layout.\n Vuex in Nuxt.js is structured almost identically to the usual Vue.js environment – with store modules. This type of structuring is optional, but highly recommended for better structure and code maintenance. Every store should be structured and modularized based on the application logic and data flow. For instance, if the application contains authorization logic, we must create the authorization store module for managing all authorization data and logic, such as log in, log out, cookies, tokens, user data, etc.\n    Developing your first Nuxt.js project will surely be confusing and complex at first, especially if you have Vue.js background without SSR knowledge. But just like any other technology, it takes time, mistakes and a lot of lines of code to truly understand the power and the benefits of the Nuxt.js framework. As for me, I’m eagerly awaiting my next Nuxt.js project where I’ll get to use my acquired knowledge (and hopefully Typescript) without encountering any obstacles from the previous Nuxt.js + Typescript project I worked on.\n If you’re interested in learning more about Nuxt.js, I highly recommend you check out these sources:\n  Nuxt.js is a very powerful framework with many useful features that make developing front-end applications easier and more entertaining. But keep in mind that it is not the best choice for all types of client-side applications and websites.\n So, to answer the main question – Nuxt.js or Vue.js? The answer is that you have to know the strengths and weaknesses of each, and you also need to know when to use one over the other based on the project type, goals and requirements.\n Nuxt offers better SEO improvement with its server-side rendering feature, faster development with auto-generic router, public share features and management with great configuration options and meta tags methods, automatic code splitting with pre-rendered pages – all of this is impossible or extremely complex to achieve with Vue.js. If these features are required for your next project, I assure you that Nuxt.js will be an excellent choice.\n On the other hand, if your goals are internal product, expanded code managing and coverage, typical client-side SPA, no need for SEO rate and performance, and manual code logic over generic solutions, then the obvious choice is Vue.js, as it’s far superior to Nuxt.js when it comes to handling all that.\n __________ We’re available for partnerships and open for new projects. If you have an idea you’d like to discuss,  share it with our team!", "posttime": "2020-05-07 21:47:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "胜过,js", "title": "Nuxt.js胜过Vue.js：您应该在什么时候使用它，为什么使用它", "title_en": "Nuxt.js over Vue.js: when should you use it and why", "transed": 1, "url": "https://www.bornfight.com/blog/nuxt-js-over-vue-js-when-should-you-use-it-and-why/", "via": "", "real_tags": ["胜过", "js"]}, {"category": "", "categoryclass": "", "imagename": "f8523826e80a8fd528211e2a589f93e3.png", "infoid": 1001087, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们非常高兴能展示Riot有史以来最大的变化：从过去24小时起，我们将对所有新的非公开对话启用默认的端到端加密，同时完全重写Riot围绕E2E加密的用户体验，由Matrix中的一整套全新加密功能提供支持。我们已经在网络、桌面、iOS和RiotX Android！🎉🍾🎊🔐🛡上同时发布了这个版本。\n这已经是很长一段时间了-交叉签名的第一次设计始于2018年11月，Nad的用户体验预览用于端到端加密，在2019年的大部分时间里，Uhoreg都在自己努力迭代规范并编写核心实现。然后，自2019年10月下旬以来，Riot团队的其他成员一直在加紧将其投入生产-从2020年2月FOSDEM 2020的初步实施开始，现在是今天的全面上线。那么，让我们来看看有什么大惊小怪的！\n每个过去在Riot中使用过E2E加密的人都会熟悉这样一个事实，即每当任何用户在您的任何房间登录新设备时，它都会警告您-这会变得非常无聊，非常快。其基本原理是，如果您不知道您是否真的在与您认为自己是谁交谈，那么E2EE是非常无用的，就像没有证书的SSL/TLS是无用的一样。此外，有人试图破解Matrix中的加密的最有可能的方式之一是访问目标的帐户并添加一个“幽灵”设备，以便监视他们的对话。因此，当意外设备突然出现时，您应该向用户发出警告，以便他们可以进行验证。但在实践中，我们转向过度了，这最终只会让人恼火。\n因此，为了解决这个问题，我们引入了用户在登录时验证自己的设备的功能-确认他们是合法的所有者，从而让所有验证过他们的人自动信任新的登录。这使我们能够自动警告用户有关其帐户的意外登录，并提供一种双因素身份验证形式以完成登录(假设用户需要以某种方式担保新登录)。我们称之为交叉签名，因为用户通过对其身份签名，将信任从一个设备转移到另一个设备。\n在升级到今天的Riot版本时，您会注意到的第一件事是系统会提示您“设置加密”以使交叉签名生效：\n这是因为我们需要设置恢复密码，以允许您在没有其他登录设备可用时验证您的新登录。当您在服务器上备份加密邮件密钥时，此密码短语可保护您在服务器上的交叉签名数据，并替换用于在新设备上检索历史记录的旧密码短语。因此，您现在只需使用一个密码就可以在登录和检索历史记录时验证您的设备(如果您已经使用下面屏幕截图中的切换设置了备份)。\nRiot iOS还没有这个安装阶段--目前，要升级你的账户以支持交叉签名，你需要使用Riot Web、Riot Desktop或RiotX Android。(提醒一下，Riot Android很快就会被RiotX Android取代，我们还没有在旧应用程序上实现任何新的E2EE工作。)。\n然后，在您的帐户上设置交叉签名后，系统将提示您检查当前会话并将其验证为您自己的会话-这意味着随后验证您的每个人都将自动信任它们。\n现在是清理帐户上仍然存在的陈旧会话的好时机-这些会话存在安全隐患(您无法通过交叉签名来证明您拥有这些会话，因此您将始终看起来不受信任)，而且它们会降低对其他所有人的加密速度。您可以在设置&gt；安全&amp；隐私部分中删除它们。\n.这意味着您可以通过从现有会话验证新登录(应该会弹出一个“未经验证的登录”提示)来为新登录提供担保-或者您可以输入恢复密码或恢复密钥来证明您对设备的所有权。？注意：只有当您的其他骚乱已升级到最新版本以支持交叉签名时，此功能才有效。\n这里的另一项新功能是，如果您正在将加密密钥备份到服务器，则验证自己的行为(通过验证现有设备或输入恢复密码/密钥)将神奇地使您的加密历史记录在新登录名上可用！✨。\n登录后，只需进行一次验证即可永久信任其他用户及其所有当前和未来的设备(除非他们将其撤销)-查看由一次成功验证产生的所有绿色复选框。\n请注意，交叉签名不仅仅适用于Riot：如果您交叉签名Riot的任何支持E2EE的Matrix客户端，那么验证将被记录下来，其他人也会信任它。因此，如果我在我的账户上登录Weechat(说E2EE，但还不做交叉签名)，只要我从Riot验证它，所有其他说交叉签名的人都会自动信任Weechat。\n交叉签名第一次合并到Riot的开发分支是在2月份的FOSDEM 2020上(我们从那以后一直在迭代它，以解决一些想法和错误)，我们的Talk Making and Breaking Encryption in Matrix为感兴趣的人提供了更多的技术细节。\n超级偏执狂用户需要注意的一点是：目前，用来给自己的设备签名的私钥和用来给其他用户签名的私钥都是由您的恢复密码/密钥加密的，并存储在服务器上，以便在您丢失所有设备的情况下进行恢复。我们还允许在设备之间共享(八卦)签名密钥，但目前该实现也将它们加密存储在服务器上。“此限制将在将来修复，但目前如果您不信任您的服务器具有加密密钥，您可能希望暂缓使用交叉签名。\n最后，在技术细节方面：在内部，您的恢复密码/密钥称为SSSS(Secure Secret Storage and Sharing，又名Quad-S)密钥-它加密任意秘密数据(例如签名密钥和备份密钥)，然后将这些数据存储在服务器上的个人帐户数据中。如果您在帐户数据中查找m.ret_storage.default_key，则可以通过/DevTools斜杠命令在Riot Web/Desktop中查看它的运行情况，然后它加密的各种秘密位于m.Cross_signing.master、m.Cross_signing.self_sign、m.Cross_signing.user_sign和m.megolm_backup.v1。(它们分别处理如何整体保护您的交叉签名数据；如何对您自己的设备进行交叉签名；如何对其他用户进行交叉签名；以及如何加密您的邮件备份(如果您使用它们)。SSSS既支持将数据存储在帐户数据中(以便您可以在丢失所有设备的情况下恢复数据)，也支持定义如何在设备之间安全地共享/八卦数据(如果您不想将其存储在服务器上的account_data中)。\n交叉签名的另一个方面是，我们已经极大地改进了验证的工作方式，使您更容易信任您正在与之交谈的人。\n第一个大变化是：我们现在支持扫描二维码进行验证！*如果你登录RiotX Android或Riot iOS，你现在可以通过扫描Riot Web(或任何其他Riot)上的二维码进行验证，你进入了💥：D我们甚至做了一些魔术，这样你刚刚扫描的设备也会回报并自动信任你。别担心，如果你不想扫描二维码，你仍然可以选择比较表情符号(如果你感到怀旧或受虐，甚至可以比较公共指纹)。\n第二个重大变化是：验证现在使用DM！，而不是验证是短暂的东西，如果您错过它们，它们就会永远消失，我们现在会在它们出现时显示弹出窗口，并在Direct Message历史记录中与验证您的人一起跟踪它们。\n第三个大变化是：验证现在发生在侧面板中！以前的验证是丑陋的模式弹出窗口，它会阻止您正在做的事情，直到您处理它们(特别恼人的是，因为您无法恢复它们)。现在您可以根据需要进出它们，同时执行多个操作，再也不会受制于邪恶的模式弹出窗口。\n关于Riot Web、RiotX Android和Riot iOS上交叉签名和验证的完整过程，有一段来自Valère的精彩视频，它完整地展示了上周的Open Tech Will Save Us Meetup：\n最后，既然验证用户通常是一次性的活动，我们强烈建议使用交叉签名方！\n曾几何时，当面做这件事可能是一件非常愚蠢和有趣的事情(想象一下，一屋子人互相喊表情符号，疯狂地跑来跑去扫描彼此的二维码)-但在我们勇敢的新反乌托邦未来，我们能做的最好的事情就是在吉西身上做这件事。(显然，1：1验证效率更高，但集体验证更有趣--事实证明，你可以通过Jitsi成功验证至少3个重叠的表情符号！)戴夫(Riot Web的原著作者、交叉签名开发冠军)为后人录制了上周新矢量交叉签名派对编辑后的亮点……。：D。\n希望从前面的章节中可以清楚地看出，Nad-Riot的首席设计师已经在改进UI和UX方面付出了巨大的努力。任何对我们一直在工作的全部设计资产感兴趣的人都可以在Figma上查看它们。\n我们应该强调的主要改进之一是，我们现在终于有了一种一致的方式来表示加密房间和使用屏蔽的UI中的信任级别：\n有了新的防护罩，我们不再在用户的对话中添加新设备时骚扰他们-相反，我们希望他们看到，如果添加了不可信的设备，房间的防护罩会到处闪烁红色。\n挂锁现在被用来显示私密的房间(类似于其他消息应用程序)，而不是加密的-尽管在我们这个新的E2EE默认世界中，实际上几乎所有的私密房间都应该加密。我们现在还将您的活动应用程序登录称为“会话”，而不是我们以前使用的相当隐晦的“设备”。\n最后，即使对话中出现未经验证的会话，我们也不再喋喋不休并阻止消息-用户的盾牌变红是警告您可能正在发生坏事的提示。\n阻止我们进行默认加密的所有私人对话的另一个主要原因是，不想突然破坏Matrix社区多年来想出的所有客户端、机器人和网桥。安全地实现E2EE是很困难的，而且认为每个随机的Matrix项目都必须自己弄清楚这一点是疯狂的。\n因此，我们创建了Pantalaimon-这是一个为您完成所有E2EE繁重任务的小应用程序；让任何现有的Matrix客户端/机器人/网桥都可以参与加密的私人房间，而不必实际使用E2EE。潘(他是这么称呼他的朋友的)工作得非常好--例如，我们在生产中使用它在加密房间里使用Mjolnir。最初是由poljar使用他的Matrix-nio库用Python编写的，目前正在使用我们新的Matrix-rust-sdk库向Rust进行移植-提供了一个真正轻量级的守护进程来处理Matrix中最复杂的部分。我们的FOSDEM演讲为感兴趣的人提供了演示和更多信息。\n值得一提的是，虽然Pantalaimon非常有用，但越来越多的客户端现在确实拥有原生E2EE支持--这是由越来越多的独立E2EE实现提供支持的。*目前的名单包括：\n另一项艰巨的任务是支持在E2EE房间中进行搜索。从Riot Desktop 1.6开始，我们默认完全支持在E2EE房间中进行搜索-现在您甚至可以在右侧面板中列出E2EE房间中的所有文件。\n这要归功于Seshat-Poljar的另一个项目，它提供E2EE房间的客户端全文搜索索引，安全地加密和存储索引，以便Riot Desktop可以实现搜索。Seshat是用Rust编写的，在未来，我们希望看到它也集成到Riot Mobile(和Pantalaimon)中-在桌面和移动之间八卦加密的搜索索引，这样无论你在什么平台上，你都可以快速搜索你的房间。\n值得注意的是，这也是Riot Desktop第一次偏离Riot Web的功能-我们现在拥有了完整的构建基础设施，可以在Riot Desktop中为Linux、MacOS和Windows提供更丰富的本机功能(如Seshat)。关注这个空间，了解更多原生功能--例如，我们最终将能够实现即按即说！\n默认情况下阻止E2EE的最后一件事是，我们需要追踪客户端最终没有解密收到的消息所需的密钥的剩余场景。这被证明是一个真正的痛苦，因为在某些情况下，您可能合法地无法解密(例如，发送者不知道您的存在，因为当他们发送消息时，他们的服务器还没有看到您在房间里-或者可能发送者已经将您列入黑名单-或者发送消息时您不在房间？)。相反，在客户端之间传输密钥时的任何错误都可能导致相同的症状(例如，如果客户端或服务器未能正确跟踪房间中的哪些设备，或者如果用户从备份中克隆了他们的设备，并且加密无法处理由此产生的分裂大脑)。在症状完全相同的情况下区分细菌和合法行为有点像噩梦。\n最后，我们解决了这个问题，既找到了剩余的漏洞，又改善了用户体验，以便Riot告诉您“为什么”它无法解密给定的消息(例如，“您被列入黑名单”或“发送者不知道您在房间里”等)。这是一个巨大的改进，除非发生了一些奇怪的事情，否则很少会出现这样的错误。我们也得到了一些安慰，因为WhatsApp也有同样的问题，而且它们甚至没有去中心化！\n虽然我们已经可以放心地在默认情况下打开加密，但我们还可以做大量的工作来进一步改进加密。快速浏览剩余的主要项目：\n根据用户反馈，不可避免地需要对UI/UX进行更多的润色。感谢使用我们在过去两周发布的候选版本的每个人进行的令人惊叹的测试，我们相信我们抓住了剩下的精彩，但总会有更多的微调。有关更多详细信息，请参阅本文末尾仪表板中的“阶段4”。\n目前，交叉签名要求您将加密的交叉签名密钥存储在服务器上，这意味着服务器上猜测您的恢复密码/密钥的攻击者可能会对恶意设备进行交叉签名，以监视您的帐户。一般来说，这很好，因为如果您丢失了所有设备，这是恢复帐户交叉签名状态的唯一方法。然而，如果您是超级偏执狂，您可能希望在设备之间共享(八卦)密钥，而不是将它们加密存储在服务器上。协议支持这一点--我们只是还没有把它连接起来。\n现在有两个密码很麻烦-一个用于您的帐户，另一个用于您的加密状态。我们可以扩展您的加密密码，也可以解锁您的帐户--但这将意味着完全重写Riot的登录过程和密码重置逻辑(并迁移每个人的密码)。我们本可以在这个版本中做到这一点，但我们已经迟到了，所以我们决定推迟到未来。\n目前，我们没有办法在不显式验证用户密钥的情况下将其标记为受信任。我们计划在“第一次使用时就信任”(豆腐)的地方隐含地信任用户，但这让用户界面变得更加复杂--虽然我们已经设计了它，但它被推到了未来的版本中。\n你不能在Riot iOS上设置交叉签名；相反，你会被路由到Riot Web上进行排序。如果你唯一的设备是在iOS上，那就太可惜了--我们只需要把它移植过来就行了。\n目前只有Riot Desktop支持通过Seshat进行加密搜索。我们需要在RiotX Android和Riot iOS中实现它，可能还需要在Riot Web上实现，然后在这些设备之间共享加密的搜索索引。\n我们没有办法有选择地导出/导入房间的密钥，以便有意识地修复丢失历史的用户的历史。显然，这避开了E2EE，但有时拥有它确实是一件非常有用的事情。有第三方工具可以提供这一点，但是Riot有本机支持就太好了。\n在协议层，没有什么可以阻止您通过签署受信任的用户来委派信任。例如，系统管理员可以为加入团队的每个新用户签名，然后他们会自动信任团队中的其他每个人。不过，我们还没有在“暴动”里接上这个。\n最后但并非最不重要的一点是：自从Olm和Megolm从NCC集团获得最初的公开审计以来，已经有几年了。虽然核心加密棘轮从那时起没有显著变化，但所有这些密钥管理工作当然都是新的-一旦我们确信我们有一个值得验证的长期稳定版本，我们将对整个堆栈进行另一次审核。\n虽然在过去的6个月里，默认的E2EE一直是我们的主要项目，当然也有很多其他的事情在发生--但是我们太专注于E2EE了，以至于我们忘记了正确地告诉任何人这件事。所以，迟到总比不到好，这里有一些亮点！\n早在2015年，当我们第一次将视频会议添加到Matrix中时，我们的目的总是让人们连接到本地会议服务器，而不是我们在matrix.org上运行的默认会议服务器-但由此产生的额外复杂性意味着它的待办事项列表…不断减少。直到现在！\nRiot Web现在支持直接实例化Jitsi视频/语音会议，通过Riot Web直接集成Jitsi，而不必使用自定义集成管理器。这意味着要将Riot部署配置为默认指向自定义JITSI，现在只有一个配置行：https://github.com/vector-im/riot-web/blob/develop/docs/jitsi.md有详细信息。您还可以在Matrix博客上看到设置此功能的完整教程。值得注意的是，到目前为止，只有Riot Web和Desktop有能力使用这一功能，但Riot iOS和RiotX Android应该很快就会跟进。(事实上，今天的iOS版本支持加入自托管的Jitsis，并将很快支持创建它们)。\n我们从Mozilla那里反复听到的反馈之一是，Riot需要更好的键盘快捷键-既记录了我们已经拥有的快捷键，也引入了新的快捷键，比如“跳到上一个/下一个房间”和“跳到上一个/下一个未读的房间”。嗯，我们很高兴地说，由于t3chGuy的努力，终于有了这些快捷键！你可以通过点击Cmd/Ctrl+/或点击用户设置的帮助选项卡中的‘键盘快捷键’按钮来查看所有新的快捷键。看起来是这样的！\nRiot Web多年来UI/UX中最糟糕的部分之一是房间目录-特别是如何查看其他服务器上的目录。再一次，我们很高兴地宣布，这个问题现在已经通过大幅改进的UI得到了修复-现在可以轻松地将新服务器添加到您的房间目录中，并查看由服务器上的网桥公开的房间目录。看起来是这样的！\n希望每个人都注意到了新的邀请对话框--根据你最近与谁交谈提供建议，并简化了旧的设计，从而极大地改善了邀请人们参加对话的过程。我们在这里仍在解决一些美观和可访问性问题，但它是明确的。\n..", "note_en": "We are incredibly excited to present the biggest change in Riot ever: as of the last 24 hours we are  enabling end-to-end encryption by default for all new non-public conversations, together with a complete rework of Riot’s user experience around E2E encryption, powered by a whole new suite of encryption features in Matrix. We have released this simultaneously on  Web,  Desktop,  iOS and  RiotX Android! 🎉🍾🎊🔐🛡\n     This has been a long time coming - the first designs for cross-signing started in Nov 2018 with Nad’s  User Experience Preview for End-to-end encryption, and for much of 2019 Uhoreg was plugging away by himself iterating on the specification and writing the core implementations. Then, since late Oct 2019 the rest of the Riot team has piled on to bring it to production - starting with the initial implementation in Feb 2020 for FOSDEM 2020, and now the full go-live today. So, let’s see what all the fuss is about!\n    Everyone who’s used E2E encryption in Riot in the past will be familiar with the fact it warns you whenever any user logs in on a new device in any of your rooms - and that this gets very boring, very fast. The rationale was that E2EE is pretty useless if you don’t know if you’re actually talking to the person you think you are, just as SSL / TLS would be useless without certificates. Moreover, one of the most likely ways for someone to try to compromise encryption in Matrix is to gain access to the target’s account and add a ‘ghost’ device in order to spy on their conversations. Therefore you should warn users when unexpected devices suddenly appear so they can verify them. But in practice, we oversteered and this just ends up being annoying.\n So to fix this, we’ve introduced the ability for users to  verify their own devices at login - confirming that they are the rightful owners and so letting everyone who has verified them automagically trust the new login. This then gives us the ability to automatically warn users about unexpected logins on their account - and provides a form of two factor authentication in order to complete login (given the user needs to vouch for the new login somehow). We call this cross-signing, because the user is crossing over the trust of one device to another by signing its identity.\n The first thing you’ll notice on upgrading to today’s Riot releases is that you’ll be prompted to “set up encryption” in order for cross-signing to work:\n  This is because we need to set up a recovery passphrase to allow you to verify your new logins when you have no other logged in devices available.  This passphrase secures your cross-signing data on the server, and replaces the old passphrase used to retrieve your history on new devices, when you backed up your encrypted message keys on the server. So you now have one single passphrase to both verify your devices when you log in and retrieve your history (if you have set up the backup with the toggle in the screenshot below).\n  Riot iOS does not have this setup phase yet - for now, to upgrade your account to support cross-signing you’ll need to use Riot Web, Riot Desktop or RiotX Android. (Heads up that Riot Android is shortly to be replaced by RiotX Android, and we haven’t implemented any of the new E2EE work on the old app.)\n Then, having set up cross-signing on your account, you will be prompted to review your current sessions and verify them as your own - meaning that everyone who subsequently verifies you will automatically trust them.\n  Now is a great time to clear up your stale old sessions still present on your account - these are a security hazard (you can&#39;t prove that you own them by cross-signing them, so you will always appear untrusted) plus they slow down encryption for everyone else. You can remove them in the Settings &gt; Security &amp; Privacy section.\n   ...meaning you can either vouch for the new login by verifying it from one of your existing sessions (which should be helpfully prompting you with an “Unverified login” popup) - or you can enter your recovery passphrase or recovery key to prove your ownership of the device.  N.B. this only works if your other Riots have been upgraded to the latest version in order to support cross-signing.\n Another nice new thing here is that if you are backing up your encryption keys to the server, the act of verifying yourself (either by verifying an existing device or entering the recovery passphrase/key) will magically make your encrypted history available on your new login! ✨\n Once you’ve logged in, then all it takes is a single verification to trust other users and all of their current and future devices forever (unless they revoke it) - see all the green checkboxes resulting from a single successful verification.\n  Please note that cross-signing isn’t just for Riot: if you cross-sign any E2EE-capable Matrix client from Riot, then the verification will be recorded and others will trust it. So, if I logged into weechat on my account (speaks E2EE but doesn’t do cross-signing yet),  as long as I verify it from Riot, everyone else who speaks cross-signing will automatically trust the weechat.\n Cross-signing first merged to the develop branches of Riot back in February at FOSDEM 2020 (we’ve been iterating on it since to iron out some thinkos and bugs) and our talk  Making and Breaking Encryption in Matrix provides a lot more technical detail for those interested.\n   One point for super-paranoid users: currently the private key used to sign your own devices and the private key used to sign other users are encrypted by your recovery passphrase/key and stored on the server to allow recovery if you lose all your devices. We also allow signing keys to be shared (gossiped) between devices, but right now the implementation also stores them encrypted on the server too.  This restriction will be fixed in future, but for now if you don’t trust your server with encrypted keys, you may want to hold off on using cross-signing.\n Finally, in terms of technical details: internally, your recovery passphrase/key is referred to as your  SSSS (Secure Secret Storage and Sharing, aka  Quad-S) key - it encrypts arbitrary secret data (e.g. signing keys and backup keys) which are then stored in your personal account data on the server. You can see it in action in Riot Web/Desktop via the /devtools slash command if you look for the m.secret_storage.default_key in account data, and then the various secrets it encrypts are at m.cross_signing.master, m.cross_signing.self_signing, m.cross_signing.user_signing and m.megolm_backup.v1. (These respectively handle how you secure your cross-signing data overall; how you cross-sign your own devices; how you cross-sign other users; and how you encrypt your message backups if you use them). SSSS supports both storing data in account data (so you can recover it if you lose all your devices) as well as defining how to securely share/gossip it between device (if you don&#39;t want to store it on the server in account_data).\n  The other side of cross-signing is that we’ve massively improved how verification works, to make it even easier to trust who you’re talking to.\n The first big change is:  we now support scanning QR codes for verification!  If you’re logging in on RiotX Android or Riot iOS, you can now verify by scanning a QR code on Riot Web (or any other Riot for that matter) and 💥, you’re in :D  We even do some magic so the device you just scanned will reciprocate and automatically trust you too. And don’t worry, if you don’t want to scan QR codes you can still choose to compare emoji (or even compare public fingerprints if you’re feeling nostalgic or masochistic).\n  The second big change is that:  verifications now use DMs!  Rather than verifications being transient things which if you miss them are gone forever, we now show a popup when they appear and also track them in the Direct Message history with whoever is verifying you.\n  The third big change is:  verifications now happen in the side panel!  Previously verifications were ugly modal popups which blocked what you were doing until you dealt with them (particularly annoying given you couldn’t resume them). Now you can hop in and out of them as needed, do multiple ones at the same time, and never be beholden to the evil modal popup again.\n  For a full run-through of cross-signing and verification on Riot Web, RiotX Android and Riot iOS, there’s a  great video from Valère giving a full run through from last week’s  Open Tech Will Save Us meetup:\n   Finally, now that verifying users is generally a once-off activity, we highly recommend having cross-signing parties!\n Once upon a time this might have been a very silly fun thing to do in person (imagine a room of people yelling emoji at each other and frantically running around scanning each other&#39;s QR codes) - but in our brave new dystopian future the best we can do is to do it over Jitsi. (Obviously it&#39;s more efficient to do it via 1:1, but it&#39;s more fun to do it en masse - turns out that you can successfully do at least 3 overlapping emoji verifications via Jitsi!)  Dave (original author of Riot Web and cross-signing dev champion) recorded the edited highlights of the New Vector cross-signing party last week for posterity... :D\n  Hopefully it’s clear from the previous sections that a huge amount of effort has gone into refining the UI and UX here by Nad - Riot’s lead designer. Anyone interested in the full design assets we&#39;ve been working from can  check them out at Figma.\n One of the main improvements we should call out is that we finally have a consistent way now of representing encrypted rooms and trust level in the UI using shields:\n    With the new shields, we no longer nag the user whenever a new device is added in their conversations - instead we expect them to see the room&#39;s shields flash red everywhere if an untrustworthy device is added.\n Padlocks are now used to show rooms which are private (similar to other messaging apps) rather than encrypted - although in practice almost all private rooms should be encrypted in our new E2EE-by-default world. We also now refer to your active app logins as ‘sessions’ as opposed to the rather cryptic ‘devices’ we used before.\n Finally, we no longer nag and block messages even when an unverified session appears in a conversation - the user’s shield going red is your cue to warn you that badness may be happening.\n  One of the other major things that has been stopping us making all private conversations encrypted by default is not wanting to suddenly sabotage all the clients, bots and bridges which the Matrix community has come up with over the years. Implementing E2EE securely is Hard, and it’s crazy to think that each and every random Matrix project would have to figure it out themselves.\n So, we created  Pantalaimon - a little application which does all the E2EE heavy lifting for you; letting any existing Matrix client/bot/bridge participate in encrypted private rooms without having to actually speak E2EE. Pan (as he’s called to his friends) works incredibly well - we use it in production to use  Mjolnir from encrypted rooms, for instance. Originally written in Python by  poljar using his matrix-nio library, there’s currently a porting to Rust in progress using our new  matrix-rust-sdk library - providing a truly lightweight daemon to handle the most complicated bits of Matrix. Our  FOSDEM talk has a demo and a lot more information for those interested.\n It&#39;s worth noting that while Pantalaimon is super useful, an increasing number of clients do now have native E2EE support - powered by an ever increasing number of independent E2EE implementations.  The current list includes:\n   Another huge task has been supporting search in E2EE rooms. As of Riot Desktop 1.6 we have full support by default for search in E2EE rooms - and you can now even list all the files in E2EE rooms in the right-hand panel.\n This is thanks to  Seshat - another project from poljar, which provides client-side full text search indexing of E2EE rooms, securely encrypting and storing the indexes so that Riot Desktop can implement search. Seshat is written in Rust, and in future we expect to see it integrated into Riot Mobile (and Pantalaimon) too - gossipping the encrypted search indexes between desktop and mobile, so you can quickly search your rooms no matter what platform you’re on.\n It’s worth noting this is also the first time that Riot Desktop has deviated in functionality from Riot Web - and we now have the full build infrastructure in place to ship much richer native functionality (like Seshat) for Linux, macOS and Windows in Riot Desktop. Watch this space for more native functionality - we’ll be finally able to implement  push to talk, for instance!\n  The final thing which has kept E2EE off by default is that we’ve needed to chase down the remaining scenarios where clients end up not having the keys they need to decrypt received messages. This turns out to be a real pain, because there are some scenarios where you may legitimately be unable to decrypt (e.g. the sender doesn’t know you exist, because when they sent the the message their server hadn’t yet seen you were in the room - or perhaps the sender has blacklisted you - or perhaps you weren’t in the room when the messages were sent?). Conversely, any bug when transporting keys between clients could result in the same symptoms (e.g. if a client or server has failed to correctly track which devices are in a room, or if a user clones their device from a backup and the encryption fails to handle the resulting split brain). Distinguishing bugs from legitimate behaviour when the symptoms are all the same is a bit of a nightmare.\n In the end, we’ve solved this both by hunting down the remaining bugs, but also improving the user experience so that Riot tells you *why* it couldn’t decrypt a given message (e.g. “you were blacklisted” or “the sender didn’t know you were in the room” etc). It’s a huge improvement, and it’s pretty rare to see one of these errors unless something strange is going on. We’ve also taken some solace in the fact that WhatsApp  has the same problem, and they’re not even decentralised!\n  While we’ve got to the point where we feel comfortable turning on encryption by default, there’s still an extensive roadmap of work we can do to improve encryption further. Quickly going through the main remaining items:\n There’s inevitably going to be more UI/UX polishing needed based on user feedback. Thanks to the amazing testing from everyone who used the release candidates we shipped over the last two weeks we believe we caught the remaining showstoppers, but there’s always going to be more fine-tuning. See “Phase 4” in  the dashboard at the end of this post for more details.\n Currently cross-signing requires that you store your encrypted cross-signing keys on the server, meaning that an attacker on the server who guesses your recovery passphrase/key could cross-sign a malicious device to spy on your account. Generally this is fine, as if you lose all your devices it’s the only way to recover your account’s cross-signing state. However, if you are super paranoid, you may wish to share (gossip) the keys between devices instead rather than storing them encrypted on the server. The protocol supports that - we just haven’t hooked it up yet.\n It’s clunky to have two passwords now - one for your account, and one for your encryption state. We could extend your encryption password to also unlock your account too - but it’d mean completely rewriting Riot’s login process and password reset logic (and migrating everyone’s passwords over). We could have done it in this release, but we’re already late and so we decided to defer it in future.\n Currently we don’t have a way to mark a user as trusted without explicitly verifying their keys. We have plans for implicitly trusting users where we ‘trust on first use’ (TOFU), but this complicates the UI further - and while we’ve designed it, it got punted to a future release.\n You can’t set up cross-signing on Riot iOS; you get routed to sort it out on Riot Web instead. This is a real shame if your only device is on iOS - we just need to port this over.\n Encrypted search via Seshat is only supported on Riot Desktop today. We need to implement it in RiotX Android and Riot iOS and possibly Riot Web too, and then share the encrypted search indexes between the devices.\n We don’t have a way to selectively export / import keys for a room in order to consciously fix the history for a user who’s missing history. Obviously this sidesteps E2EE, but sometimes it’s a really useful thing to have. There are third party tools which provide this, but it’d be great for Riot to have native support.\n At the protocol layer, there’s nothing stopping you delegating trust by signing a trusted user. For instance, a sysadmin could sign every new user joining a team, and they would then automatically trust everyone else in the team. We haven’t hooked this up in Riot yet though.\n Finally, last but not least: it’s been a few years since Olm and Megolm got their  original public audits from NCC Group. Whilst the core cryptographic ratchets haven’t changed significantly since then, all this key management work is of course new - and we will be doing another audit covering the whole stack once we are confident we have a long-term stable release worthy of validation.\n  While E2EE-by-default has been our primary project for the last 6 months, there’s of course been lots of other stuff happening too - but we’ve been so engrossed in E2EE that we forgot to properly tell anyone about it. So, better late than never, here’s some of the highlights!\n  Back when we first added video conferencing into Matrix in 2015, the intention was always to let folks hook up to a local conferencing server rather than the default we ran at matrix.org - but the resulting additional complexity meant that it kept getting bumped down the todo list… until now!\n Riot Web now has support to directly instantiate Jitsi video/voice conferences, integrating Jitsi directly via Riot Web rather than by having to use a custom integration manager. This means that to configure your Riot deployment to point by default to a custom Jitsi is now a single configuration line:  https://github.com/vector-im/riot-web/blob/develop/docs/jitsi.md has the details. You can also see a full tutorial for setting this up over on the  Matrix blog. It’s worth noting that so far only Riot Web and Desktop have the ability to use this feature, but Riot iOS and RiotX Android should follow shortly.  (In fact, today&#39;s iOS release supports joining self-hosted Jitsis, and will support creating them too shortly).\n  One of the recurring bits of feedback we’ve heard from Mozilla has been the need for better keyboard shortcuts in Riot - both documenting the ones we have already, as well as introducing new ones like “jump to previous/next rooms” and “jump to previous/next unread rooms”. Well, we’re happy to say this is finally here thanks to t3chguy’s efforts!  You can see all the new shortcuts by hitting Cmd/Ctrl + / or hitting the ‘Keyboard Shortcuts’ button in the Help tab of User Settings. It looks like this!\n   One of the worst bits of UI/UX in Riot Web for many years has been the Room Directory - particularly how you go about viewing the directories on other servers. Again, we’re happy to announce that this is now fixed with a massively improved UI - it’s now trivial to add new servers to your room directory, and view the room directories exposed by bridges on your server. It looks like this!\n   Hopefully everyone has also spotted the new Invite dialog - hugely improving the process of inviting people to conversations by providing suggestions based on who you’ve been talking to recently, and streamlining the old design. There’s are a few cosmetic and accessibility issues we’re still working through here, but it’s definit\n......", "posttime": "2020-05-07 21:46:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "matrix,riot", "title": "默认情况下，Riot/Matrix启用交叉签名验证和E2E加密", "title_en": "Riot/Matrix enables cross-signed verification and E2E encryption by default", "transed": 1, "url": "https://blog.riot.im/e2e-encryption-by-default-cross-signing-is-here/", "via": "", "real_tags": ["matrix", "riot"]}, {"category": "", "categoryclass": "", "imagename": "590fe48239937b6dcfbe760e3bd08c84.png", "infoid": 1001086, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们是一群充满激情的有趣的企业家，他们建造了我们自己的革命性软件，旨在使运输变得简单。EasyPost最初是一家工程第一公司，我们为拥有务实的软件开发方法而感到自豪。我们的团队拥有丰富的不同经验和不同的背景，从初创公司到大型科技公司。\n我们给我们的员工以他们想要的方式工作的自主权。我们相信在正确的时间使用正确的工具来解决正确的问题。我们通过公开、协作、深思熟虑和负责任地工作来赋予员工权力。", "note_en": "We&#39;re a fun group of passionate entrepreneurs who built our own revolutionary software designed to make shipping simple. EasyPost started as an Engineering first company and we are proud to have a pragmatic approach to software development. Our team has a wealth of diverse experience and different backgrounds ranging from startups to large technology companies.\n We give our employees the autonomy to work the way they want to get the job done. We believe in using the right tools to solve the right problems at the right times. We empower employees by working openly, collaboratively, thoughtfully, and with responsibility.", "posttime": "2020-05-07 21:31:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "便士,easypost", "title": "EasyPost仍在增长100便士-加入我们", "title_en": "EasyPost Still Growing 100p – Join Us", "transed": 1, "url": "https://www.easypost.com/careers", "via": "", "real_tags": ["便士", "easypost"]}, {"category": "", "categoryclass": "", "imagename": "46c91505620af0a7b47e68b562f8819d.png", "infoid": 1001085, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们很自豪地宣布收购KeyBase，这是Zoom进一步加强我们视频通信平台安全的90天计划中的又一个里程碑。自2014年推出以来，Keybase的杰出工程师团队利用他们深厚的加密和安全专业知识构建了安全的消息传递和文件共享服务。我们很高兴能将Keybase的团队整合到Zoom系列中，帮助我们构建能够达到当前Zoom可伸缩性的端到端加密。\n此次收购标志着Zoom迈出了关键的一步，因为我们试图创建一个真正私人的视频通信平台，该平台可以扩展到数亿参与者，同时还可以灵活地支持Zoom的各种用途。我们的目标是为每个使用案例提供尽可能多的隐私，同时平衡我们用户的需求和我们防止平台上有害行为的承诺。Keybase的经验丰富的团队将是这项任务的关键部分。\n今天，在Zoom客户端(例如，Zoom房间、膝上型计算机和运行Zoom应用程序的智能手机)之间流动的音频和视频内容在每个发送客户端设备上都是加密的。直到它到达接收方的设备时才会解密。在最近的Zoom 5.0版本中，Zoom客户端现在支持使用具有256位密钥的行业标准AES-GCM加密内容。但是，每次会议的加密密钥都是由Zoom的服务器生成的。此外，Zoom客户端广泛使用的一些功能，如支持与会者呼叫电话桥或使用其他公司提供的室内会议系统，将始终要求Zoom在云中保留一些加密密钥。但是，对于那些将隐私置于兼容性之上的主机，我们将创建一个新的解决方案。\nZoom将为所有付费账户提供端到端加密会议模式。登录用户将生成公共加密身份，这些身份存储在Zoom网络的存储库中，可用于在与会者之间建立信任关系。会议主持人将生成临时的每次会议对称密钥。此密钥将在客户端之间分发，使用非对称密钥对进行封装，并在与会者列表发生重大更改时轮换。加密秘密将在主持人的控制下，主持人的客户端软件将决定允许哪些设备接收会议密钥，从而加入会议。我们还在研究允许企业用户提供额外身份验证级别的机制。\n这些端到端加密会议将不支持电话桥、云录音或非Zoom会议室系统。如果主持人明确允许，缩放房间和缩放电话参与者将能够参加。加密密钥将由主持人严格控制，主持人将允许与会者参加。我们相信，这将提供与现有消费者端到端加密信息平台同等或更好的安全性，但视频质量和规模使Zoom成为3亿多名每日会议参与者的选择，其中包括一些世界上最大的企业的与会者。\n在我们做这项工作以进一步保护我们用户的隐私的同时，我们也意识到我们希望防止使用Zoom的产品造成伤害。为此，我们会采取以下步骤：\n我们将继续与用户合作，以增强会议主持人可用的报告机制，以报告不想要的和破坏性的与会者。\nZoom不会也不会主动监控会议内容，但我们的信任和安全团队将继续使用自动化工具，根据其他可用的数据寻找滥用用户的证据。\nZoom没有也不会为合法拦截目的建立解密现场会议的机制。\n我们也没有办法将我们的员工或其他人插入到会议中，而不会在参与者列表中反映出来。我们不会建立任何加密后门来允许秘密监视会议。\n我们致力于在构建我们的端到端加密产品时保持透明和开放。我们计划在5月22日(星期五)公布详细的密码设计草案。然后，我们将主持与公民社会、密码专家和客户的讨论部分，以分享更多细节并征求反馈。一旦我们评估了集成到最终设计中的反馈，我们将宣布我们的工程里程碑和部署给Zoom用户的目标。\n我们期待着欢迎Keybase团队的到来，并对我们可以共同构建的可能性感到兴奋。\n本新闻稿包含1995年“私人证券诉讼改革法”中与Zoom收购Keybase有关的明示和暗示的“前瞻性陈述”，这些陈述涉及重大风险、不确定性和假设，可能导致实际结果与此类陈述明示或暗示的结果大不相同。本通讯中的前瞻性陈述包括有关交易的潜在利益、我们的端到端加密产品的开发、我们整合密钥库团队的能力以及潜在增长机会等方面的陈述。在某些情况下，您可以通过诸如“预期”、“相信”、“估计”、“预期”、“打算”、“可能”、“可能”、“计划”、“项目”、“将”、“将”、“应该”等术语来识别前瞻性陈述。在某些情况下，您可以通过“预期”、“相信”、“估计”、“预期”、“打算”、“可能”、“计划”、“项目”、“将会”、“将会”、“应该”等术语来识别前瞻性陈述。“”可以“，”“可以”“预测”、“潜在”、“目标”、“探索”、“继续”或这些术语的否定，以及旨在识别前瞻性陈述的类似表达。然而，并不是所有的前瞻性陈述都包含这些标识性的词语。就其性质而言，这些陈述会受到许多不确定因素和风险的影响，包括我们无法控制的因素，这些因素可能会导致实际结果、业绩或成就与陈述中预期或暗示的大不相同。这些假设、不确定性和风险包括，除其他外，交易的预期收益没有按预期实现的可能性，或者根本没有实现，管理层的注意力从正在进行的业务运营和机会中分散，对业务或员工关系的潜在不利反应或变化，成功整合Keybase的能力，以及可能影响Zoom未来结果的其他因素。可能导致实际结果和结果与前瞻性陈述预期的结果大不相同的其他风险和不确定因素包括在“风险因素”标题下以及我们最近提交给美国证券交易委员会的文件中的其他部分。这些风险和不确定因素可能导致实际结果和结果与前瞻性陈述中预期的结果大不相同，这些风险和不确定因素包括在我们提交给美国证券交易委员会的最新文件中的“风险因素”和其他地方。包括我们截至2020年1月31日的Form 10-K年度报告。前瞻性陈述只在陈述发表之日发表，并基于陈述发表时Zoom可获得的信息和/或管理层截至那时对未来事件的善意信念。除非法律要求，否则Zoom没有义务更新前瞻性陈述，以反映它们发表后的事件或情况。", "note_en": "We are proud to announce the acquisition of Keybase, another milestone in Zoom’s 90-day plan to further strengthen the security of our video communications platform. Since its launch in 2014, Keybase’s team of exceptional engineers has built a secure messaging and file-sharing service leveraging their deep encryption and security expertise.  We are excited to integrate Keybase’s team into the Zoom family to help us build end-to-end encryption that can reach current Zoom scalability.\n This acquisition marks a key step for Zoom as we attempt to accomplish the creation of a truly private video communications platform that can scale to hundreds of millions of participants, while also having the flexibility to support Zoom’s wide variety of uses. Our goal is to provide the most privacy possible for every use case, while also balancing the needs of our users and our commitment to preventing harmful behavior on our platform. Keybase’s experienced team will be a critical part of this mission.\n  Today, audio and video content flowing between Zoom clients (e.g., Zoom Rooms, laptop computers, and smartphones running the Zoom app) is encrypted at each sending client device.  It is not decrypted until it reaches the recipients’ devices. With the recent Zoom 5.0 release, Zoom clients now support encrypting content using industry-standard AES-GCM with 256-bit keys. However, the encryption keys for each meeting are generated by Zoom’s servers. Additionally, some features that are widely used by Zoom clients, such as support for attendees to call into a phone bridge or use in-room meeting systems offered by other companies, will always require Zoom to keep some encryption keys in the cloud. However, for hosts who seek to prioritize privacy over compatibility, we will create a new solution.\n  Zoom will offer an end-to-end encrypted meeting mode to all paid accounts. Logged-in users will generate public cryptographic identities that are stored in a repository on Zoom’s network and can be used to establish trust relationships between meeting attendees. An ephemeral per-meeting symmetric key will be generated by the meeting host. This key will be distributed between clients, enveloped with the asymmetric keypairs and rotated when there are significant changes to the list of attendees. The cryptographic secrets will be under the control of the host, and the host’s client software will decide what devices are allowed to receive meeting keys, and thereby join the meeting. We are also investigating mechanisms that would allow enterprise users to provide additional levels of authentication.\n These end-to-end encrypted meetings will not support phone bridges, cloud recording, or non-Zoom conference room systems. Zoom Rooms and Zoom Phone participants will be able to attend if explicitly allowed by the host. Encryption keys will be tightly controlled by the host, who will admit attendees.  We believe this will provide equivalent or better security than existing consumer end-to-end encrypted messaging platforms, but with the video quality and scale that has made Zoom the choice of over 300 million daily meeting participants, including those at some of the world’s largest enterprises.\n As we do this work to further protect our users’ privacy, we are also cognizant of our desire to prevent the use of Zoom’s products to cause harm. To that end, we will be taking the following steps:\n We will continue to work with users to enhance the reporting mechanisms available to meeting hosts to report unwanted and disruptive attendees.\n Zoom does not and will not proactively monitor meeting contents, but our trust and safety team will continue to use automated tools to look for evidence of abusive users based upon other available data.\n Zoom has not  and will not  build a mechanism to decrypt live meetings for lawful intercept purposes.\n We also do not have a means to insert our employees or others into meetings without being reflected in the participant list. We  will not build any cryptographic backdoors to allow for the secret monitoring of meetings.\n  We are committed to remaining transparent and open as we build our end-to-end encryption offering. We plan to publish a detailed draft cryptographic design on Friday, May 22. We will then host discussion sections with civil society, cryptographic experts, and customers to share more details and solicit feedback. Once we have assessed this feedback for integration into a final design, we will announce our engineering milestones and goals for deploying to Zoom users.\n We look forward to welcoming the Keybase team and are excited for the possibilities of what we can build together.\n  This communication contains express and implied “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995 related to Zoom’s acquisition of Keybase that involves substantial risks, uncertainties and assumptions that could cause actual results to differ materially from those expressed or implied by such statements. Forward-looking statements in this communication include, among other things, statements about the potential benefits of the transaction, our development of our end-to-end encryption offering, our ability to integrate the Keybase team, and potential growth opportunities.  In some cases, you can identify forward-looking statements by terms such as “anticipate,” “believe,” “estimate,” “expect,” “intend,” “may,” “might,” “plan,” “project,” “will,” “would,” “should,” “could,” “can,” “predict,” “potential,” “target,” “explore,” “continue,” or the negative of these terms, and similar expressions intended to identify forward-looking statements. However, not all forward-looking statements contain these identifying words. By their nature, these statements are subject to numerous uncertainties and risks, including factors beyond our control, that could cause actual results, performance or achievement to differ materially and adversely from those anticipated or implied in the statements. These assumptions, uncertainties and risks include that, among others, the possibility that the anticipated benefits of the transaction are not realized when expected or at all, division of management’s attention from ongoing business operations and opportunities, potential adverse reactions or changes to business or employee relationships, the ability to integrate Keybase successfully, and other factors that may affect future results of Zoom.  Additional risks and uncertainties that could cause actual outcomes and results to differ materially from those contemplated by the forward-looking statements are included under the caption “Risk Factors” and elsewhere in our most recent filings with the Securities and Exchange Commission (the “SEC”), including our annual report on Form 10-K for the year ended January 31, 2020. Forward-looking statements speak only as of the date the statements are made and are based on information available to Zoom at the time those statements are made and/or management’s good faith belief as of that time with respect to future events.  Zoom assumes no obligation to update forward-looking statements to reflect events or circumstances after the date they were made, except as required by law.", "posttime": "2020-05-07 21:16:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "需要,acquires,zoom", "title": "缩放需要密钥库", "title_en": "Zoom Acquires Keybase", "transed": 1, "url": "https://blog.zoom.us/wordpress/2020/05/07/zoom-acquires-keybase-and-announces-goal-of-developing-the-most-broadly-used-enterprise-end-to-end-encryption-offering/", "via": "", "real_tags": ["需要", "acquires", "zoom"]}, {"category": "", "categoryclass": "", "imagename": "ba3cffb1522c44bf1e389cbd55d8a819.jpg", "infoid": 1001084, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司遭遇集体诉讼，声称该公司隐瞒了一些2016年MacBook Pro用户遇到的所谓舞台灯光问题。由于受影响的MacBook Pro显示屏底部发出异常的背光图案，被称为舞台照明，问题与笔记本电脑盖子反复打开和关闭时的线缆应力或撕裂有关。苹果最终在2019年启动了该问题的修复计划，并悄悄修复了下一代MacBook的罪魁祸首。周三，洛杉矶居民Mahan Taleshour向加利福尼亚州北区美国地区法院提出申诉，称苹果意识到其产品存在缺陷，没有向消费者披露这一问题。原告声称，他的2016款15英寸MacBook Pro在2020年1月经历了舞台灯光效果，但由于维修计划仅涵盖2016年发布的13英寸MacBook Pro机型，显示屏维修的全部费用由他负责。他补充说，修理显示器的费用报价为850美元，并补充说，自从冠状病毒爆发以来，他一直无法修理设备。舞台灯光效果被描述为显示屏底部的明暗交替斑块，起诉书指出，一些MacBook Pro机型在背光线严重损坏后出现了完全的显示屏故障。维修显示电缆通常是一项昂贵的服务，因为它需要更换整个显示单元。在对苹果推销有缺陷的产品并未能实施质量控制的投诉中，诉讼还声称该公司在这件事上的行为是非法的，违反了消费者法律补救法案和宋比弗利消费者保证法(Song-Beverly Consumer Warranty Act)。原告还指控苹果隐瞒显示屏线缆问题是恶意的、压抑的、蓄意的，意在欺诈。原告要求官方披露显示屏线缆的缺陷、MacBook Pro维修费用或经济损失的赔偿、将AppleCare和Repair计划服务扩展到15英寸机型以及律师费的问题，并要求官方披露这些显示线缆的缺陷性质、赔偿MacBook Pro维修费用或经济损失、将AppleCare和Repair计划服务扩展到15英寸机型以及法律费用等方面的信息，并指控苹果公司对显示屏电缆问题的隐瞒是恶意的、压抑的、蓄意的。原告要求官方披露显示屏电缆的缺陷性质、MacBook Pro维修费用或经济损失赔偿、将AppleCare和Repair计划服务扩展到15英寸机型，以及法律费用。", "note_en": "Apple has been hit with a class-action lawsuit claiming that the company concealed the so-called &#34;stage lighting&#34; issue experienced by some 2016 MacBook Pro owners.     Dubbed &#34;stage lighting&#34; due to abnormal backlighting patterns emanating from the bottom of an impacted MacBook Pro&#39;s display, the  problem was tied to stress or tearing on the laptop&#39;s cable when the lid was opened and closed repeatedly. Apple eventually launched a  repair program for the issue in 2019 and  quietly fixed the underlying culprit in the next generation of MacBook.  On Wednesday, Los Angeles resident Mahan Taleshpour lodged a complaint in the U.S. District Court of the Northern District of California alleging that Apple was aware of the defect in its product and failed to disclose the issue to consumers.   The plaintiff claims that his 2016 15-inch MacBook Pro experienced stage lighting effects in January 2020, but he was left responsible for the full cost of the display repair due to the fact that the repair program only covers 13-inch MacBook Pro models released in 2016. He added that the cost to repair the display was quoted as $850, adding that he&#39;s been unable to repair the device since the  COVID-19 outbreak.   The &#34;stage lighting&#34; effect is described as alternating patches of light and darkness at the bottom of the display, and the complaint points out that some MacBook Pro models experience complete display failure after significant backlight cable damage. Repairing the display cable is often a costly service, since it requires the entire display unit to be replaced.   Among complaints that Apple promoted a defective product and failed to exercise quality control, the lawsuit also claims that the company&#39;s conduct in the matter was unlawful and violated the Consumers Legal Remedies Act and the Song-Beverly Consumer Warranty Act.  It also levies allegations that Apple&#39;s &#34;concealment&#34; of the display cable issue was &#34;malicious, oppressive, deliberate&#34; and &#34;intended to defraud.&#34;  The plaintiff is seeking an official disclosure about the &#34;defective nature&#34; of the display cables, restitutions for MacBook Pro repair costs or economic losses, an expansion of AppleCare and repair program service to 15-inch models, and legal fees.", "posttime": "2020-05-07 21:02:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "macbook-pro,苹果,apple,macbook,app", "title": "苹果就2016 MacBook Pro“Stage Lighting”问题提起诉讼", "title_en": "Apple Sued Over 2016 MacBook Pro 'Stage Lighting' Issue", "transed": 1, "url": "https://appleinsider.com/articles/20/05/06/apple-sued-over-2016-macbook-pro-stage-lighting-issue", "via": "", "real_tags": ["苹果", "apple", "macbook", "app"]}, {"category": "", "categoryclass": "", "imagename": "b5225fe00f12a24f7cd2ad854f2b71d5.jpg", "infoid": 1001083, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "3月27日，当我听说一名同事死于冠状病毒时-这是大都会运输局的第一例-时，我想，“事情开始了。”更多的死亡接踵而至，经常是一天不止一次。一些我过去每天都会见到的人和拳头碰在一起。\n在Facebook上，当坏消息传来时，我和同事们都会表达悲痛，并向家属表示哀悼。但我们的自发反应是旁观者麻木的好奇心。我们知道这会发生的。我们知道我们中的许多人无法挺过这场大流行。\n每天，我都会看到MTA工人小组页面上的帖子，语气欢快：“哦，上帝，我们开始了。我有症状了，14天后见。或者不会。“。\n我们在震中工作，死亡率大大高于急救人员。常识告诉你，地铁列车和站台是这种病毒的巨大载体。我们把它和钢尘一起吸入。作为一名列车员，当我把头伸出车厢外进行所需的站台观察时，许多车站的乘客都站在离我脸10英寸的地方。在其他时候，他们会靠在出租车里问问题。公交车司机的情况更糟，他们的乘客就在他们前面进入。\n我的同事想锁上机组人员乘坐的两节车厢的车门。公共汽车司机想让乘客从后门进入。我们想要危险津贴和照看孩子的家庭假。\n3月中旬，一份公告发布，要求列车长每15分钟发布一次公告。洗手，肥皂和水，消毒液，肘部打喷嚏。“共同努力，我们可以帮助维护纽约的安全。”\n具有讽刺意味的是，我们没有肥皂和水。在我当时的航站楼，卫生间在自来水管道中断后关闭了三天。大多数员工洗手间的状况也同样糟糕。船员房间都挤得水泄不通。\nMTA对没有戴护目镜或棉织安全手套的工人采取严厉的行动。然而，我们不得不在没有防范冠状病毒的情况下工作。\n起初我们被警告不要戴口罩。MTA表示，这会让公众感到恐慌。上面说口罩对我们来说很危险。后来，它说我们可以戴上我们自己买的口罩。但到那时，几乎没有口罩可供出售。\n疫情宣布一周后，TWU Local 100的一位副总裁来到我的航站楼做报告。我义愤填膺地站起来，问为什么我们没有收到口罩。我被告知健康人不需要口罩，医生更需要口罩。医生不是很健康吗？没人接。橡胶手套和洗手液怎么样？没人接。\n最后，MTA同意向我们提供个人防护装备。签到时，我们会得到一个N95口罩和三小包湿巾，大小相当于在医生办公室打针前使用的那些。这将持续三天。我们还从调度员办公室的瓶子里拿了一个小容器来装满洗手液。\n这些面具的制作很便宜。我的同事抱怨说，口罩捏住了他们的鼻子。带子很容易折断。许多口罩必须用管道胶带固定。\n或者说我是这么听说的。副总统来访两天后，我出现严重的身体疼痛、寒战和干咳。3月27日，我早上6点醒来。去洗手间然后晕倒了。我给一位密友打了个简短的电话，然后拨打了911。一辆救护车把我送到纽约大学朗格尼医疗中心，在那里我接受了治疗并出院了。我与世隔绝了14天，之后我感觉好多了。我的同事告诉我有一个地方可以让我做测试。4月15日，我的检测呈阳性。进一步隔离。我的直接存款对账单显示692美元：不到我第一个支付期工资的一半，此后就什么都没有了。(我已经用完了所有的病假)。\n我听说的第三个死亡案例是我每天都会见到的一位黑人同事，他曾经看过我读米歇尔·亚历山大的“新吉姆·克罗”(The New Jim Crow)。他想知道为什么一位来自印度的妇女会对黑人的状况感兴趣。从那时起，每当我们相遇时，我们就拥抱和亲吻对方的脸颊。\n当我的N次列车和我的R次列车到达大西洋大道时，我经常和站台对面的另一位同事交谈。他是参与快速运输行动的仅有的两名东正教犹太人之一。作为一名火车爱好者，他有一次注意到连接一节车厢和另一节车厢的电缆松动了，危险地挂在第三根铁轨附近。他那天可能救了很多人的命。现在他也死了。\n我们偶然发现了身体。我知道有两个案子。一名火车操作员在两节车厢之间行走时，差点被一辆车绊倒。另一个人笔直地坐在售票员窗外的长凳上，直到8小时轮班结束时，我的同事们才发现他在每次旅行中都会注意到这个人，然后才发现自己已经死了。\n大流行创造的条件让人们清楚地认识到，我们基本工人-一般工人-是那些防止社会秩序陷入混乱的人。然而，我们却被极不尊重地对待，好像我们是可有可无的牺牲品。自3月27日以来，至少有98名纽约运输工人死于冠状病毒。我的同事苦口婆心地说：“我们不是必需的。我们是牺牲品。“。\n这可能是个人的情况，但不是在我们的人数中。希望这次经历能让我们清楚地看到我们在维持社会运行中所起的关键作用，这样我们才能捍卫我们的利益，捍卫我们的生命。比如匹兹堡的环卫工人罢工，要求提供防护设备。就像通用电气的工人呼吁公司改变工厂用途，生产通风机，而不是喷气式发动机。\n我在4月30日参加了第二次考试。结果是阴性的。明天，我会回去工作。\n苏雅塔·吉德拉(Sujatha Gidla)是一名MTA指挥家，著有“大象中的蚂蚁：贱民家庭和现代印度的形成”一书。\n“泰晤士报”致力于向编辑发表各种信件。我们想听听您对这篇文章或我们的任何一篇文章的看法。这里有一些小贴士。这是我们的电子邮件：Letters@nytimes.com。", "note_en": "When I heard that a co-worker had died from Covid-19 — the first in the Metropolitan Transportation Authority — on March 27, I thought, “It’s starting.” More deaths followed in quick succession, frequently more than once a day. Some of those people I used to see every day and fist bump.\n On Facebook, when bad news comes, my co-workers and I express grief and offer condolences to the families. But our spontaneous response is the numb curiosity of an onlooker. We knew this was coming. We knew many among us wouldn’t make it through the pandemic.\n Every day I see posts on the M.T.A. workers’ group pages striking a jaunty tone: “Oh Lord, here we go. I got the symptoms, see you all in 14 days. Or not.”\n We work at the epicenter of the epicenter, with a mortality rate  substantially higher than that of first responders. Common sense tells you that subway trains and platforms are giant vectors of this virus. We breathe it in along with steel dust. As a conductor, when I stick my head out of the car to perform the required platform observation, passengers in many stations are standing 10 inches from my face. At other times, they lean into the cab to ask questions. Bus drivers, whose passengers enter right in front of them, are even worse off.\n My co-workers want doors locked on the two cars where the crew rides. Bus drivers want to let passengers enter through the back doors. We want hazard pay and family leave for child care.\n  In mid-March, a bulletin came out mandating that conductors make an announcement every 15 minutes. Wash hands, soap and water, sanitizer, elbow-sneeze. “Together we can help keep New York safe.”\n The irony was that we didn’t have soap and water. At my terminal at that time, the restrooms were closed for three days after a water main break. Most employee restrooms are in similarly bad shape. Crew rooms are packed.\n The M.T.A. takes stern action against workers seen without goggles or cotton knit safety gloves. Yet we had to work without protection against the coronavirus.\n At first we were warned not to wear masks. The M.T.A. said it would panic the public.  It said masks were dangerous for us. Later it said we could wear masks we bought ourselves. But by then there were few masks for sale.\n One week after the pandemic was declared, a vice president of TWU Local 100 came to my terminal to give a talk. I rose to my feet in outrage and asked why we weren’t receiving masks. I was told healthy people didn’t need masks and that doctors needed them more. Aren’t doctors healthy? No answer. How about rubber gloves and hand sanitizer? No answer.\n Finally, the M.T.A.  agreed to supply us with personal protective equipment. When signing in, we get an N95 mask and three small packets of wipes the size of those used before a shot at the doctor’s office. This is meant to last three days. We also get a small container to fill with hand sanitizer from a bottle in the dispatcher’s office.\n The masks are cheaply made. My co-workers complain that the masks pinch their noses. The straps break easily. Many masks must be secured with duct tape.\n Or so I have heard. Two days after the vice president’s visit, I developed severe body aches, chills and a dry cough. On March 27, I woke up at 6 a.m. to go to the bathroom and collapsed. I made a quick call to a close friend and then dialed 911. An ambulance took me to NYU Langone Medical Center, where I was treated and discharged. I stayed isolated for 14 days, after which I felt better. My co-workers told me about a place where I could get tested. On April 15, I tested positive. Further quarantine. My direct-deposit statement shows $692: less than half my wages for the first pay period and nothing thereafter. (I had used up all of my sick days).\n The third death I heard about was a black co-worker I used to see every day who once saw me reading Michelle Alexander’s “The New Jim Crow.” He wanted to know why a woman from India was interested in the condition of black people. From then on, whenever we ran into each other we hugged and cheek-kissed.\n I used to talk to another co-worker across the platform when his N train and my R train reached Atlantic Avenue. He was one of only two Orthodox Jews in the rapid transit operation. A train buff, he once noticed that a cable that connects one car to another had come loose and was hanging dangerously near the third rail. He may have saved lives that day. Now he’s dead, too.\n We are stumbling upon dead bodies. I know of two cases. A train operator nearly tripped over one while walking between cars. The other person was sitting upright on a bench right outside the conductor’s window and discovered to be dead only at the end of an eight-hour shift after my co-workers kept noticing the person on each trip.\n The conditions created by the pandemic drive home the fact that we essential workers — workers in general — are the ones who keep the social order from sinking into chaos. Yet we are treated with the utmost disrespect, as though we’re expendable. Since March 27, at least 98 New York transit workers have died of Covid-19. My co-workers say bitterly: “We are not essential. We are sacrificial.”\n That may be true individually, but not in our numbers. Hopefully this experience will make us see clearly the crucial role we play in keeping society running so that we can stand up for our interests, for our lives. Like the Pittsburgh sanitation workers walking out to demand protective equipment. Like the G.E. workers calling on the company to repurpose plants to make ventilators instead of jet engines.\n I took my second test on April 30. It was negative. Tomorrow, I will go back to work.\n Sujatha Gidla, an M.T.A. conductor, is the author of “ Ants Among Elephants: An Untouchable Family and the Making of Modern India.”\n The Times is committed to publishing   a diversity of letters  to the editor. We’d like to hear what you think about this or any of our articles. Here are some   tips . And here’s our email:   letters@nytimes.com .", "posttime": "2020-05-07 21:01:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "必需,essential,口罩", "title": "他说，我们不是必需的。我们是牺牲品。", "title_en": "‘We Are Not Essential. We Are Sacrificial.’", "transed": 1, "url": "https://www.nytimes.com/2020/05/05/opinion/coronavirus-nyc-subway.html", "via": "", "real_tags": ["必需", "essential", "口罩"]}]