[{"category": "", "categoryclass": "", "imagename": "e5c947b7730c1c416fa0ef68131c8242.png", "infoid": 1001547, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "向Rails项目报告错误的门槛可能相当高。您需要仔细诊断问题，最好是提出解决方案，包括详细的复制步骤，以及所有其他的家庭作业，这些作业使Rails这样的项目能够每年处理数百(如果不是数千)个报告。\n虽然这是一个合理的过程来收集可行的报告，一小群贡献者可以合理地进行分类，但对于了解所有让你的旅程变得更加不舒服或花费更长时间的坑坑洼洼、路障和环形交叉路口的信息来说，这根本不是一个很好的过程。这些东西就会被怨恨的深渊吞没(我已经用完这个比喻了吗？！😂)。\n因此，当Avdi在Twitter上表达一些不满时，当你感觉自己的工作受到攻击时，自然而然地发生了一件事：核心贡献者群体变得防御性了！这是一个错误的描述！完成的错误报告在哪里！？你知道演练，如果你曾经做过某件事，倾注你的心，然后在网上看到它受到批评。这是一种立竿见影的下意识反应。但它不一定要刺痛。\n“在刺激和回应之间有一个空间。在这个空间里，我们有能力选择我们的反应。我们的反应就是我们的成长和自由。“--维克多·弗兰克尔。\n我们现在选择的反应不同于对感觉到的轻视的典型反应。我们的反应将是增长，它的本质是，阿夫迪的挫折是广泛的挫折，它们是正当的挫折。它们可能还不是一种可操作的形式，就像我们习惯于完美描述的错误报告一样，但是我们可以把它们变成那样！一起来！\n更重要的是，我们可以接受，阿夫迪的挫折感远远不足以掩盖所有的挫折感。这样我们就可以要求更多了！以一种结构化的方式，在新的查询范式下，我们可以一起使Ruby on rails变得更好。听起来很不错，不是吗？\n这就是我们要做的！我们成立了一个小团体，让Avdi、Betsy和其他表达过不满或对这些不满感兴趣的人一起工作。这个小组的第一个项目是我们所说的WTF五月。这是Ruby on rails论坛上的一个新类别，对于那些您不打算成为正式错误报告的WTF来说，它将是一个安全的空间。时间安排在五月份。它将在贝茜·海贝尔的冠军名下运行。所以我会让她设定订婚条件：\n我们都把时间浪费在“Rails WTF”上。我们的Rails进程出了点问题，我们花了四个小时疯狂阅读Stack Overflow，最后才想到要重新启动Spring。或者我们犯了一个愚蠢的打字错误，这会导致自动加载器失去对完全不同的类的跟踪。\n为WTF编写错误报告可能很困难。当很难理解是什么引发了问题，或者是什么修复了它，确定一个好的复制品似乎是不可能的。当他们刚刚花了几个小时盯着Byebug和咒骂电脑的时候，谁还想去努力呢？\n今年5月，Rails团队将处理其中的一些WTF-这意味着我们需要您告诉我们有关它们的情况！给我们发送你最奇怪的Rails 6个故事，即使你并不真正了解是什么触发了它们，也不记得你是如何修复它的。尽可能多地提供细节-但不要担心你不能提供的细节。我们将仔细查看所有这些内容，以寻找可以让我们为每个人改进Rails(或至少是其错误消息)的模式。\n所以，请和我们一起参加五月的WTF活动吧。帮助Betsy、Avdi和其他所有对将挫折的原始能量转化为文档、错误消息甚至API的闪亮补丁感兴趣的人。我们将WTF作为输入，并产生💖作为输出。", "note_en": "The bar for reporting a bug to the Rails project can be pretty steep. You’re expected to carefully diagnose the problem, preferably propose a solution, include detailed reproduction steps, and all the other homework that makes it possible for a project like Rails to deal with hundreds if not thousands of reports on a yearly basis.\n While this is a reasonable process for collecting actionable reports that a small group of contributors can reasonably triage, it’s not a great process at all for learning about all the the potholes, the roadblocks, and the roundabouts that make your journey that much more uncomfortable or take longer. That stuff just gets swallowed up by the sinkhole of grievances (have I exhausted the metaphor yet?! 😂).\n So when Avdi took to  air some of those grievances on Twitter, the natural thing happened that always happens when you feel your work is attacked: The core contributor group got defensive! That’s a mischaracterization! Where are the completed bug reports!? You know the drill, if you’ve ever worked on something, poured your heart into it, and then seen it criticized online. There’s that immediate, knee-jerk reaction of a sting. But it doesn’t have to sting.\n “Between stimulus and response there is a space. In that space is our powerto choose our response. In our response lies our growth and our freedom” – Victor Frankl\n We’re now choosing that response to be something different than the typical response to a perceived slight. Our response will be that of growth, and its essence is that Avdi’s frustrations are broad frustrations, they’re valid frustrations. They’re perhaps not yet in an actionable form, like we’re used to with perfectly described bug reports, but we can turn them into that! Together!\n And even more, we can accept that Avdi’s frustrations are not anywhere near broad enough to cover all the frustrations. So we can ask for more! In a structured way, under a new paradigm of inquiry, and we can make Ruby on Rails better together. That sounds pretty good, no?\n So that’s what we’re doing! We started a small group to involve  Avdi,  Betsy, and others who’ve expressed grievances or interest in those grievances to work together. And the first project to come out of this group is what we’re calling  A May of WTFs. It’s a new category on the Ruby on Rails discussion forum, and it’s going to be a safe space for those WTFs you weren’t going to turn into formal bug reports. It’s going to be timeboxed to the month of May. And it’s going to run under the championship of Betsy Haibel. So I’ll let her set the terms of engagement:\n We all lose time to “Rails WTFs.” Something goes weird in our Rails process, and we spend four hours frantically reading Stack Overflow before it finallyoccurs to us to restart Spring. Or we make one silly typo and it causes the autoloader to lose track of an entirely different class.\n  It can be hard to write bug reports for a WTF. When it’s difficult to understandwhat triggered it an issue, or what fixed it, nailing down a good reproductionseems impossible. And who wants to go to that effort when they’ve just spent hoursstaring at byebug and cursing computers?\n  This May, the Rails team is going to be tackling some of these WTFs – which means we need you to tell us about them! Send us your strangest Rails 6 stories, even if you don’t really understand what triggered them or remember how you fixed it.Provide as much detail as you can – but don’t worry over what you can’t. We’ll be looking through all of this for patterns that will let us improve Rails(or at least its error messages) for everyone.\n So please, come join us in a  May of WTFs. Help Betsy, Avdi, and everyone else who’s interested in transforming the raw energy of frustrations into gleaming patches to documentation, error messages, or even APIs. We’ll take WTFs as input and produce 💖 as output.", "posttime": "2020-05-11 01:53:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ruby,rails", "title": "Ruby on Rails：WTF的五月", "title_en": "Ruby on Rails: A May of WTFs", "transed": 1, "url": "https://weblog.rubyonrails.org/2020/5/7/A-May-of-WTFs/", "via": "", "real_tags": ["ruby", "rails"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001546, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎来到我的新博客！对我来说，这将是一个小小的实验。我想建立一个博客已经有很长一段时间了，但我从来不想把我的博客放在其他网站上，比如Medium(称其为虚荣心，但我喜欢看到我的名字出现在那个URL中)。我也不想设置像WordPress这样的东西，因为那感觉有点矫枉过正。我本可以设置一个像Jekyll这样的静态站点生成器，但是那样我就必须使用markdown进行比我真正希望的更多的样式。\n这时，一位朋友的想法又出现在我的脑海里。为什么不直接使用谷歌文档作为“CMS”呢？\n这就是这一页的内容。我的第一篇简短的博客帖子是从google docs直接传给你的。设置也不是特别复杂(可以在周末设置)。您可以在这里找到代码：\n我喜欢这种方法的原因有几个。首先，它很容易管理。我在谷歌硬盘上有一个博客文件夹，里面有我所有的帖子。如果我想推迟发布某些内容，我会将其移动到不同的文件夹中。如果我想写一篇文章，但我的伴侣正在使用我们共享的笔记本电脑，我会跳到iPad上。如果我最终决定转向一些实际的CMS，那么我宁愿从文本处理器复制内容，而不是从WordPress之类的东西复制内容(我真的不喜欢WordPress)。\n时间会证明这种方法是否奏效，但我能说的是，它相当酷。", "note_en": "Welcome to my new blog! This is going to be a bit of an experiment for me. I have wanted to set up a blog for quite some time now but I never wanted to host my blog on some other website like medium (call it a vanity thing but I like seeing my name in that URL). I also didn’t really want to set up something like wordpress because that felt a little overkill. I could have set up a static site generator like Jekyll but then I would have had to have done a bit more styling with markdown than I’d really like.\n  That’s when a friend’s idea popped back into my mind. Why not just use Google docs as a “CMS”?\n  So this is what this page is. My first short blog post coming straight to you from Google docs. It’s not particularly complicated to set up either (it can be set up over the weekend). You can find the code over here:\n   There are a few reasons why I like this approach. For one, it’s pretty simple to manage. I have a Blog folder on Google drive for all of my posts. If I want to hold off publishing something I move it into a different folder. If I want to do a write up but my partner is using our shared laptop, I jump on the iPad. And if I do eventually decide to move onto some actual CMS, well I’d rather copy over content from a text processor than from something like wordpress (I really don’t like wordpress).\n  Time will tell if this approach works out but all I can say is it is pretty cool.", "posttime": "2020-05-11 01:33:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,博客,现在,generated", "title": "我的博客现在是由Google Docs生成的", "title_en": "My blog is now generated by Google Docs", "transed": 1, "url": "https://benwiser.com/blog/My-blog-is-now-generated-by-Google-Docs.html", "via": "", "real_tags": ["google", "博客", "现在", "generated"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001545, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我第一次编写一行代码大概是在2007年左右，当时我只有十二三岁。尽管在那之前，我也曾摆弄过FrontPage，并从Word文档中导出HTML。还记得免费的网站生成器和免费的共享主机吗？我和他们中的很多人玩过。在那之后，一切都失控了。\n从第一个代码开始，我就知道我找到了一些很棒的东西，一些有价值的东西，一些有趣的东西。\n甚至在我上高中之前，我每天就已经花了几个小时复制粘贴我在随机网站上找到的代码，并对它们进行调整，使其在一个完全没有有价值内容的网站上变得雪上加霜。\n今天，我作为软件开发人员在戴托工作，与我的堂兄兼联合创始人Oğuzhan一起工作，他负责大部分业务。Dytto的当前和测试版是一个工具，可以创建报价，用漂亮的PDF将报价发送给客户，并跟踪交易情况。我从日常生活中抽出几个晚上，用像Laravel，Tailwind CSS和Alpine这样的现代工具把这个最低限度可行的产品组合在一起。非常感谢创作者，泰勒·奥特维尔，亚当·瓦森，史蒂夫·舒格，卡莱布·波齐奥，以及所有的贡献者。\n回想起我还有一个月就满17岁的时候，我在Facebook上看到了一则招聘广告，招聘一家营销机构的网络开发人员(当时人们称其为网站管理员)。作为一个反社会的内向的人，与陌生人交谈以雇佣我这个完全没有扎实成就的业余人士的焦虑是无法抗拒的。然后，我关闭了战斗或逃跑的本能，打了个电话。在完成了在Facebook内部运行的应用程序使用Facebook API的测试后(这是一件事)，我被接受了这份工作。耶我！\n快进到2018年，我做过几份不同的工作，积累了很多经验和知识，在最初的兴奋过去后，我从来没有对任何一份工作感到快乐。看到我的堂兄试图把自己推入企业家世界，我意识到这也是我想要的。我想为自己工作。我想为自己编写代码。我想建造一些东西，并以此谋生。\n所有这些工作和小时工都是赚点钱的手段，但如果你想出去旅行几天或几周，而你的老板拒绝了，那就不值多少钱了。\n于是我们开始计划创业，但不知道要做什么。当我们在一个美食节上和一些小贩聊天时，灯泡亮了起来。他们说，他们只卖物理广告，互联网广告对他们来说太麻烦了。长话短说，那就是我们开始做一件叫做“手艺”的事情的时候。它在某种程度上是工匠们分享他们的作品并出售它们的市场。那是一场灾难。\n在过去的一年里，我把所有的钱都花在了让Craftt工作上，我放弃了，找到了一份工作。但一次还不够。有人通过一位熟人找到了Oğuzhan，并邀请我们两人作为联合创始人加入他们的初创公司。我们跳上了这股潮流。我们已经在那里工作了6个多月了。与许多客户交谈，看到该领域的工作情况，以及修改已经建立的产品(无论是在软件方面还是目标受众方面)的难度，促使我们构建一些新的东西。\n这就是我们决定建造Dytto的原因。我们于5月3日上线，一周内的访问量令人振奋。下一个目标是接触到一些潜在客户，并在几周内推出。我们喜欢聊天，所以请随时通过Twitter(@hkanaktas，@mroguzhanaktas)或hello[at]dytto[dot]co(我们都查看)给我们发消息。", "note_en": "The first time I&#39;ve ever written a line of code was probably around 2007 when I was 12 or 13. Though even prior to that I&#39;ve fiddled with FrontPage and exporting HTMLs from Word documents. Remember the free website generators and the free shared hostings? I&#39;ve played around with a lot of them. It all spiralled out of control after that.\n Ever since that first code, I knew I found something great, something valueable, something  fun.\n Before I even started highschool, I was already spending hours a day copy-pasting codes I find on random websites and tweaking them to make it snow on a website that had absolutely no valuable content.\n Today I&#39;m working on  Dytto as the software developer, alongside my cousin and co-founder,  Oğuzhan, who handles most of the business side. Dytto, in its current -and beta- version, is a tool to create offers, send them to clients in beautiful PDFs, and keep track of the deals. I took a few nights out of my daily life and put together this minimally viable product using modern tools like Laravel, Tailwind CSS and Alpine. Huge thanks to the creators, Taylor Otwell, Adam Wathan, Steve Schoger, Caleb Porzio, and all the contributors.\n Flashback to when I was a month away to turning 17, I saw a job posting on Facebook for a web developer (people called it  webmaster back then) in a marketing agency. As the antisocial introvert I was, the anxiety of talking to some stranger into employing me, a complete amateur who has no solid accomplishment to show, was overwhelming. Then I shut down my fight-or-flight instincts and made the call. After completing a test to use Facebook APIs for an app that runs inside Facebook (it was a thing), I was accepted to the job. Yay me!\n Fast-forward to 2018, I have worked at a few different jobs, built a lot of experience and knowledge and never been happy at any job after the initial thrill of it passed. Seeing my cousin trying to push himself into the entrepreneurial world made me realize that that&#39;s also what I want. I wanted to work for myself. I wanted to code for myself. I wanted to build something and make a living out of it.\n All these employments and hourly works are means to make some money, but it doesn&#39;t worth much when you want to take a trip for a few days/weeks but your &#34;boss&#34; says no.\n So we began to plan on starting a business but didn&#39;t know what about. The lightbulb switched on when we were at a food festival and talking to some vendor. They said they only sell phsyically and internet ads were too much of an hassle for them. Long story short, that&#39;s when we started something called Craftt. It was sort of a marketplace for craftspeople to share their work and sell them. It was a disaster.\n  Having spent all my money in the past year trying to make Craftt work, I gave up and found a job. But once was not enough. Someone found Oğuzhan through a common acquaintance and asked both of us to join their startup as co-founders. We jumped on the bandwagon. We have been working there for more than 6 months now. Talking to many customers, seeing how things work in that area, and the difficulty of modifying an already established product (both in terms of software, and target audience) pushed us to build something new.\n That&#39;s how we decided to build  Dytto. We went live on May 3rd and had motivating amounts of traffic over the week. Next objective is to reach some potential customers and launching in a few weeks. We love to chat, so feel free to send us a message at Twitter ( @hkanaktas,  @mroguzhanaktas), or at hello[at]dytto[dot]co (We both check it).", "posttime": "2020-05-11 01:33:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,开发,开发人员,proper", "title": "在做了10年的开发人员之后，发布了我的第一个合适的产品", "title_en": "Published my first proper product after working as a developer for 10 years", "transed": 1, "url": "https://dytto.co/blog/how-it-all-began", "via": "", "real_tags": ["发布", "开发", "开发人员", "proper"]}, {"category": "", "categoryclass": "", "imagename": "f655691ffc8266bd5287f2e03913897e.jpeg", "infoid": 1001544, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "NovaStelo的灵感来自StarLogo和Scratch，更确切地说，书中的StarLogo出现在“海龟、白蚁、交通堵塞和Scratch 1.4”中。这两本书都出自雷斯尼克的伟大作品。\nNovaStelo基于Pharo Smalltalk 8.0构建。几乎所有的模型和UI都是使用Spec2重写的。\n您需要在更新前保留脚本文件，因为项目文件与任何以前的版本都不兼容。", "note_en": "NovaStelo is inspired from StarLogo and Scratch, more preciselyStarLogo on the book &#34;Turtles, Termites, and Traffic Jams&#34; and Scratch 1.4.Both are of Resnick&#39;s great works.\n NovaStelo is built on Pharo Smalltalk 8.0. Almost all Model and UI are rewritten using Spec2.\n       You need keep script files before update, because project files are incompatible with any previous versions.", "posttime": "2020-05-11 00:55:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,scratch,style,starlogo", "title": "基于MIT Scratch的多Agent系统块式编程环境", "title_en": "Block-style programming environment for multi agent system, based on MIT Scratch", "transed": 1, "url": "https://github.com/EiichiroIto/NovaStelo", "via": "", "real_tags": ["编程", "scratch", "style", "starlogo"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001541, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当威胁来袭时，在战术、操作和战略层面工作的网络安全专业人员需要快速有效地协同工作，以实现共同的网络安全战略，以防范对手。要以可重复、可扩展的方式做到这一点，取决于组织是否有能力发现和缓解其姿态上的差距，了解对手的交易技巧，以及实施和沟通防御性行动方案。\nUnfinter是一个社区驱动的开源工具套件，利用MITRE ATT&amp；CK™框架，将重点从指示器转移到基于行为的方法。这使您能够更有效地评估风险、提升安全态势，并以系统、可衡量和有意义的方式实施缓解措施。\nUnfinter Discover提供了一个工作流程，可帮助威胁报告人员、分析开发人员和网络防御人员在他们的同行和团队之间创建和共享复杂的网络威胁情报(CTI)数据。\nUnforter Disocover为网络专家构建工具，帮助他们创建、共享和使用复杂的网络威胁情报信息。威胁记者对海量的研究和报道很有意义，Analytic开发人员正在精心设计新的检测，Network Defender正在解决其网络中的差距，需要知道下一步要关注什么。\nUnfinter Analytic是一个原型，它允许开发人员熟悉ATT&CK™框架，以衡量其分析的有效性。编写分析并将其映射到您要检测的MITRE ATT；CK™技术。创建分析事件时，Kibana显示将显示事件周围的上下文。\n了解更多。\nUnstrater是开源的，正在寻找合作伙伴。如果您对新功能或新工作流程有想法，请让我们知道并在GitHub中提交问题。如果您是一名开发人员，并且对如何做出贡献有想法，我们欢迎您的拉取请求。我们很高兴每个人都能参加这个实验。\n无拘无束地下载", "note_en": "When the threat hits, cybersecurity professionals working at the tactical, operational, and strategic levels need to work together quickly and effectively enable a common cybersecurity strategy that protects against the adversary. To do this in a repeatable, scalable way depends on an organization’s ability to discover and mitigate gaps in their posture, understand adversary tradecraft, and implement and communicate defensive courese of action.\n  Unfetter is a community-driven suite of open source tools leveraging the  MITRE ATT&amp;CK™ framework, shifting the focus from indicators to a behavior-based methodology. This allows you to more effectively assess your risk, advance your security posture, and implement mitigations in a systemic, measurable, and meaningful way.\n  Unfetter Discover provides a workflow that helps Threat Reporters, Analytic Developers and Network Defenders create and share complex Cyber Threat Intelligence (CTI) data among their peers and across teams.\n  Unfetter Disocover builds tools for cyber experts to help them create, share and use complex Cyber Threat Intelligence information. Threat Reporters are making sense of the vast amount of research and reporting, Analytic Developers are crafting new detections, and Network Defenders are tackling gaps in their networks and need to know what to focus on next.\n Unfetter Analytic is a prototype that allows developers to gain familiarity with the ATT&amp;CK™ framework to measure the effectiveness of their analytics. Write analytics and map them to the MITRE ATT&amp;CK™ techniques you want to detect. When the analytic event is created, the Kibana display shows the context around the event.\n  Learn More\n  Unfetter is open source and looking for partners. If you have an idea for new functionality or a new workflow, let us know and submit an issue in  GitHub. If you are a developer and have ideas on how to contribute, we welcome a pull request. We’re excited for everyone to join the experiment.\n  Download Unfetter", "posttime": "2020-05-11 00:39:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国国家安全局,cyber,分析", "title": "美国国家安全局网络自由计划", "title_en": "NSA Cyber Unfetter Project", "transed": 1, "url": "https://nsacyber.github.io/unfetter/", "via": "", "real_tags": ["美国国家安全局", "cyber", "分析"]}, {"category": "", "categoryclass": "", "imagename": "eb2e85b3356426e70197cea7b4632dcb.jpeg", "infoid": 1001539, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最新的就业报告显示，美国失业率创历史新高，突显出投资者正在努力调和的越来越大的裂痕：股市反弹，经济步履蹒跚。\n美国股市周五加速上涨，此前公布的4月非农就业报告显示，失业率升至14.7%，为纪录最高水平。这对许多市场观察人士来说是令人费解的最新事态发展，他们在观察美国股市复苏的同时，一直在分析源源不断的糟糕经济数据。\n..。", "note_en": "The latest jobs report revealing record U.S. unemployment highlights a growing rift investors are struggling to reconcile: a rallying stock market and stumbling economy.\n  Gains in U.S. stocks accelerated Friday after April’s nonfarm payrolls report showed unemployment rose to 14.7%, the highest level on record. It was the latest head-scratching development for many market observers, who have been parsing a steady stream of abysmal economic data while watching the U.S. stock market stage a recovery.\n...", "posttime": "2020-05-11 00:09:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "股市,经济,market,观察", "title": "为什么在经济如此不景气的情况下，股市却在上涨？", "title_en": "Why Is the Stock Market Rallying When the Economy Is So Bad?", "transed": 1, "url": "https://www.wsj.com/articles/why-is-the-stock-market-rallying-when-the-economy-is-so-bad-11588974327", "via": "", "real_tags": ["股市", "经济", "market", "观察"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001537, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在VITSœ，我们代表着优秀设计在我们所做的一切中的巨大力量：为我们的公司、我们的家具和许多对我们的未来有着深厚兴趣的人进行深思熟虑、负责任和智慧的设计。\n60多年来，VITSœ一直与迪特尔·拉姆斯合作。直到今天，他仍然在改进他的设计，并经常被新一代人引用为对他们正在塑造21世纪的工作的关键影响。\n1957年，我开始开发一种存储系统，它构成了VITSœ公司的基础，该公司成立于1959年。因此，我设计背后的思想在公司内部根深蒂固。“。\n早在20世纪70年代末，迪特尔·拉姆斯(Dieter Rams)就越来越担心他周围的世界状况：“形状、颜色和噪音令人费解的混乱。”\n意识到他是那个世界的重要贡献者，他问了自己一个重要的问题：我的设计是好的设计吗？\n无论如何，创新的可能性并没有耗尽。技术的发展总是为创新设计提供新的机遇。但是，创新设计总是与创新技术同步发展的，它本身永远不会是目的。\n产品是买来用的。它必须满足一定的标准，不仅是功能性的，而且是心理的和审美的。好的设计强调产品的实用性，而忽略任何可能减损它的东西。\n产品的审美质量对其实用性是不可或缺的，因为我们每天使用的产品会影响我们的人和我们的福祉。但只有制作精良的物品才能美观。\n它澄清了产品的结构。更好的是，它可以让产品畅所欲言。充其量，它是不言而喻的。\n实现目标的产品就像工具。它们既不是装饰品，也不是艺术品。因此，他们的设计应该既中立又克制，为用户的自我表达留出空间。\n它不会让一个产品比它的实际价值更具创新性、更强大或更有价值。它不会试图用无法兑现的承诺来操纵消费者。\n它避免了时尚，因此永远不会显得过时。与时尚设计不同的是，它持续了很多年-即使在今天的一次性社会也是如此。\n任何事情都不能武断或听天由命。设计过程中的细心和准确性体现了对用户的尊重。\n设计对保护环境做出了重要贡献。在产品的整个生命周期中，它节约了资源，并将物理和视觉污染降至最低。\n更少，但更好-因为它集中在基本方面，产品没有非必需品的负担。\n这些原则可以在知识共享CC-by-NC-ND 4.0许可证下准确和公平地共享。", "note_en": "Here at Vitsœ we stand for the inordinate power of good design in everything we do: designing thoughtfully, responsibly and intelligently for our company, our furniture and the many people who share a profound interest in all of our tomorrows.\n For over 60 years, Vitsœ has worked continuously with Dieter Rams. He still improves his designs to this day and is often cited by a new generation as a key influence on their work that is shaping the 21st century.\n  “In 1957 I began to develop a storage system that formed the basis of the company Vitsœ, which was founded in 1959. Thus the ideology behind my design is engrained within the company.”\n  Back in the late 1970s, Dieter Rams was becoming increasingly concerned by the state of the world around him: “An impenetrable confusion of forms, colours and noises.”\n Aware that he was a significant contributor to that world, he asked himself an important question: is my design good design?\n  The possibilities for innovation are not, by any means, exhausted. Technological development is always offering new opportunities for innovative design. But innovative design always develops in tandem with innovative technology, and can never be an end in itself.\n  A product is bought to be used. It has to satisfy certain criteria, not only functional, but also psychological and aesthetic. Good design emphasises the usefulness of a product whilst disregarding anything that could possibly detract from it.\n  The aesthetic quality of a product is integral to its usefulness because products we use every day affect our person and our well-being. But only well-executed objects can be beautiful.\n  It clarifies the product’s structure. Better still, it can make the product talk. At best, it is self-explanatory.\n  Products fulfilling a purpose are like tools. They are neither decorative objects nor works of art. Their design should therefore be both neutral and restrained, to leave room for the user’s self-expression.\n  It does not make a product more innovative, powerful or valuable than it really is. It does not attempt to manipulate the consumer with promises that cannot be kept.\n  It avoids being fashionable and therefore never appears antiquated. Unlike fashionable design, it lasts many years – even in today’s throwaway society.\n  Nothing must be arbitrary or left to chance. Care and accuracy in the design process show respect towards the user.\n  Design makes an important contribution to the preservation of the environment. It conserves resources and minimises physical and visual pollution throughout the lifecycle of the product.\n  Less, but better – because it concentrates on the essential aspects, and the products are not burdened with non-essentials.\n  These principles can be shared accurately and fairly under the Creative Commons CC-BY-NC-ND 4.0 licence.", "posttime": "2020-05-11 00:08:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,good,产品", "title": "优秀设计的力量", "title_en": "The Power of Good Design", "transed": 1, "url": "https://www.vitsoe.com/gb/about/good-design", "via": "", "real_tags": ["设计", "good", "产品"]}, {"category": "", "categoryclass": "", "imagename": "1c36798cc96c553a98ba548d05757b9f.jpeg", "infoid": 1001535, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周五，美国劳工统计局(BLS)发布了关于政府停摆对劳动力市场影响的令人痛心的数据，这是基于包括4月12日在内的一周内对家庭和企业进行的调查数据。然而，这绝不是坏消息的结束。6月5日，劳工统计局将公布5月份的数据，我们知道这些数据会更糟糕-尤其是因为我们知道，申领失业保险的人数仍在继续。例如，在德克萨斯州，4月份的第二周，首次申领失业救济金人数为27.4万人，此后三周平均每周超过26万人。\n这些数据很难解释，因为任何“正常”的概念都已经被抛诸脑后。在这个一切都发生了变化的新的统计格局中，你需要一名劳动经济学家来选择自己的道路。\n让我们从来自公司和机构的数据开始。首先，公司报告的就业人数(所谓的非农就业人数)大幅下降，为2050万人。零售业和医疗保健业的就业率下降幅度特别大：分别减少了200万人左右；餐饮服务业(包括餐馆、酒吧和咖啡馆)的情况更糟，减少了550万人。即使是政府部门的工作岗位也减少了近100万个。在这场非同寻常的动荡中，出现了一些奇怪的情况-包括平均工作小时数从34.1小时增加到34.2小时，尽管总工作时间下降了15%，时薪增长了7%以上。出现这些明显反常情况的原因，是低薪和工作时间较少的工人是受停工影响最不利和不成比例的。\n家庭账户给我们提供了关于谁受到的影响最严重的可怕细节。值得注意的是，家庭账户比公司的数据反映了更广泛的情况，因为它涵盖了自由职业者和家庭工人，他们在经济下滑时受到的影响特别大。根据该账户，就业人数减少了2240万人。\n那些处于工资等级较低端的人，从总体上来说，他们可以从繁荣中受益最多，他们在衰退中受到的打击最大。在这场大流行危机中登上头条的第一个数字是总失业率上升了1590万人，达到2250万人，导致失业率从2月份的3.5%上升到3月份的4.4%，4月份上升到14.7%。事实上，失业率甚至更高。\n劳工统计局在周五发布的数据中解释说，事实上，另有750万工人“错误”地报告说，他们已经受雇，但却缺勤。(劳工处已向住户调查员发出特别指示，所有因冠状病毒相关业务结业而缺勤的受雇人士，应被列为临时裁员失业。但劳工统计局并没有更正这些数字，只是简单地报道了人们所说的话。)。将这750万人与实际报告的2250万人相加，总共有3000万人失业，然后除以1.558亿劳动力，实际失业率为19.3%。\n这样的数字在大多数人的有生之年都是史无前例的。在2007-2008年的崩盘中，失业率从2007年12月的5%翻了一番，到2009年10月达到10%，花了近两年的时间。这一次，这一利率在8周内翻了五番。唯一具有可比性的数字是在大萧条时期，但即使在那时，增长也花了更长的时间。美国的年失业率在1929年为3%，1930年为9%，1931年为16%，1932年为24%，1933年为25%。到1941年，就在美国参加第二次世界大战之前，这一比例为10%。因此，我们可能面临着走出这一深渊的漫长道路。\n令人担忧的是，最脆弱的人受到的影响最严重-就冠状病毒的死亡率而言，他们很大程度上也是如此-这确实是我们看到的情况。高中文凭以下的人的失业率从当月的6.8%跃升至21.2%；高中毕业生的失业率从4.4%上升至17.3%。对于受过一定大学教育的人来说，这一数字从3.7%上升到15%；对于大学毕业生来说，这一数字从2.5%上升到8.4%。西班牙裔失业率上升尤为剧烈，从6%上升到18.9%。\n年轻人尤其令人担忧，他们将努力实现从学校到工作的过渡。我们知道，年轻时长期失业会造成永久性的伤疤-几十年来收入不断减少，并增加了发生不利生活事件的风险。即使对于那些受过大学教育的人来说，2020届大学毕业生也将经历一段艰难的时期。但受教育程度较低的少数族裔年轻人将受到特别严重的打击。对于许多人来说，在过去，对糟糕的劳动力市场的一种反应是重返学校-但现在这看起来并不那么有吸引力。\n这张图显示了情况有多糟糕。它绘制了自1948年首次记录以来16岁至24岁人群的月度失业率。今年4月，这一群体的失业率升至27.4%，在可预见的未来，除了进一步上升之外，很难看到其他任何举措。但数据中甚至还没有显示2020届毕业生的情况。\n很难将我们在这些数据中看到的描述为一场正在展开的灾难。年轻人是我最担心的问题。", "note_en": "On Friday, the Bureau of Labor Statistics (BLS) published harrowing data on the labor-market consequences of the shutdown, based on survey data on households and firms taken in the calendar week that included April 12. This, though, is by no means the end of the bad news. On June 5, the BLS will publish data for May that we know is going to be even worse—not least because we know that claims for unemployment insurance are continuing. In the state of Texas, for example,  initial claims were 274,000 for that second week of April, and averaged more than 260,000 a week in the three weeks since then.\n The data are hard to interpret because any idea of “normal” has gone out of the window. A labor economist is what you need to pick your way through this new statistical landscape where everything has changed.\n Let’s start with data from firms and establishments. First, there was a  big decline in the numbers of jobs reported by firms (the so-called non-farm payrolls) of 20.5 million. Employment declines were especially high in the retail trade and health care: each fell by around 2 million; in food and drink services, which includes restaurants, bars, and cafés, things were even worse,  down 5.5 million. Even government jobs were down by nearly a million. Amid this extraordinary turbulence, there were a few quirks—including a rise in the average number of  hours worked from 34.1 to 34.2, even though total hours worked fell by 15 percent, and hourly earnings were up more than 7 percent. The reason for these apparent anomalies was that the low-paid and those on fewer hours are the workers most adversely and disproportionately affected by the shutdowns.\n The household account gave us gruesome detail about who has felt the worst impact. And it’s important to note that the household account captures a broader picture than the firms’ data does, since it covers the self-employed and household workers who are especially affected as the economy turns downward. Employment  according to that account fell by 22.4 million.\n Those at the lower end of the wage scale who, in aggregate terms, can benefit most from a boom are the hardest hit in the slump. The first number that hit the headlines during this pandemic crisis was the rise in total unemployment of 15.9 million to 22.5 million, which resulted in a rise in the unemployment rate from 3.5 percent in February, to 4.4 percent in March, to 14.7 percent in April. In reality, the unemployment rate has been even higher.\n The BLS explained  in its release with Friday’s figures that in fact an additional 7.5 million workers “wrongly” reported that they were employed but absent from work. (The BLS had given special instructions to household survey interviewers for all employed people absent from work due to coronavirus-related business closures should have been classified as unemployed on temporary layoff. But the BLS didn’t correct the numbers and simply reported what people said.) Adding those 7.5 million to the 22.5 million actually reported, to get a total of 30 million jobless, and then dividing by a labor force of 155.8 million results in a true unemployment rate of 19.3 percent.\n Such a number is unprecedented in most people’s lifetimes. In the crash of 2007–2008, it took nearly two years for the unemployment rate to double from 5 percent in December 2007 to 10 percent in October 2009. This time, the rate has quintupled in eight weeks. The only comparable numbers were in the Great Depression, but even then, the increase took much longer. The  annual unemployment rate in the US was 3 percent in 1929, 9 percent in 1930, 16 percent in 1931, 24 percent in 1932, and 25 percent in 1933. By 1941, just before the US entered World War II, it stood at 10 percent. So we may be facing a very long haul out of this abyss.\n The concern is that the most vulnerable are the worst affected—much as they are in terms of the death rates from the Covid-19 virus—and this is indeed what we are seeing. The unemployment rate of those with less than a high-school diploma jumped from 6.8 percent on the month to 21.2 percent; and for high-school graduates, it went from 4.4 percent to 17.3 percent. For those with some college education, the numbers rose from 3.7 percent to 15 percent; and for college graduates, from 2.5 percent to 8.4 percent. The Hispanic unemployment rate rose particularly steeply, from 6 percent to 18.9 percent.\n There is a special concern about young people, who are going to struggle to make the transition from school to work. We know that a long spell of unemployment when you are young creates a permanent scar—reducing earnings for decades and increasing the risk of adverse life events. Even for those with college education, the graduating class of 2020 from universities is going to have a tough time. But minority youngsters with less education are going to be especially hard-hit. For many, in the past, one response to a bad labor market is to go back to school—but that doesn’t look that attractive right now.\n  This graph charts how bad the situation is. It plots the monthly unemployment rate for those aged sixteen to twenty-four from when records were first kept, in 1948. In April, the rate for this cohort rose to 27.4 percent, and it is hard to see it doing anything other than rising further for the foreseeable future. The class of 2020 does not even show up in the data yet.\n It is hard to describe what we are seeing in these data as anything other than an unfolding disaster. The young are my greatest worry.", "posttime": "2020-05-10 23:53:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "失业,jobless,失业率", "title": "大流行失业青年地震", "title_en": "The Pandemic Jobless Youthquake", "transed": 1, "url": "https://www.nybooks.com/daily/2020/05/08/the-pandemic-jobless-youthquake/", "via": "", "real_tags": ["失业", "jobless", "失业率"]}, {"category": "", "categoryclass": "", "imagename": "ac2de48576b8fb25f0e1576c78c6482d.jpg", "infoid": 1001534, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "那是2018年的母亲节。我拿起电话，拨了一个我为母亲准备的手机号码，因为我知道她从来没有用过这个号码。它仍然在我10年前为我们设立的家庭计划中，我注意到它的使用率几乎为零。没人接电话。\n我叹了口气，想知道是不是没有办法联系到她。我的一部分就会松一口气了。我给另一个号码打了电话--几年前我童年时的第一个号码--带着一种有点可笑的期望，认为它仍然属于她。但事实并非如此。\n当我按下10个数字中的每一个时，我的心跳稳步增加。这一次，戒指突然停了下来，我听到了母亲轻柔的问候。当她认出我的时候，她声音中的惊讶是显而易见的，尽管她很快就用一种平静掩盖了这一点，这也是我拼命想要表现出来的。她听起来很疲倦。上一次我们交谈是在四年前，我们都很生气。\n我的孟加拉父母在新泽西郊区抚养我和我的哥哥，他们的结合是一场动荡的、最终注定要失败的包办婚姻的结果。我们有毒的家庭环境在父母的争吵和沉默之间摇摆。他们仁慈地在我上高中的时候离婚了，因为他们在一起太多年了，试图满足南亚文化对婚姻长盛不衰的顽固期望。\n他们每个人都试图以自己的方式为人父母。但我从来没有了解过他们的基本情况，比如他们中的任何一个出生在哪里，他们的生日，他们是如何来到这个国家的，或者他们有几个兄弟姐妹。没有家庭度假，没有游戏之夜，也没有节日传统。我童年的大部分时间都是独自在电视机前吃晚饭，或者和朋友的家人一起度过的，寻找我如此渴望的温暖。\n2006年我去上大学后，我们变得越来越疏远，我们之间的距离逐渐拉大，就像一位老相识一样。我的父亲偶尔从印度的某个地方打来电话，他出人意料地搬回了我上大学一年级时的那个地方，但我母亲的电话里只有沉默。随着没有联系的岁月的积累，我们之间的空间越来越难以逾越。\n我哥哥比我大9岁，他断然断绝了关系。我19岁的时候，他结婚了，留下我们的父母。虽然我的兄弟为自己建立了一个新的家庭，但他与我保持着密切的关系。他的妻子和岳父岳母在每张节日餐桌上都欢迎我。我从来没有因为我弟弟的做法而责怪他。有些父母犯下了不可饶恕的罪行。我们不欠那些和我们有共同DNA但没有在我们生活中赢得一席之地的人的爱。\n但是这种不和谐折磨着我。大约在我30岁生日的时候，我决定我需要和我的父母面对面地坐下来，试着解决让我们分开的根深蒂固的问题。我担心他们是如何靠自己的力量度过难关的。如果没有别的，我不知道他们还会活多久。我不想在我们没有给我们的关系一个机会的情况下让他们死去。\n我对他们每个人都有未回答的问题。和我父亲在一起，我需要问他为什么他没有告诉我就去了印度，再也没有回来。对于我的母亲，我需要理解为什么她在我八年级的大部分时间里都把自己锁在房间里。我想在为时过晚之前听听他们的故事，或许我自己的故事也有意义。\n我突然想到，我并没有试图理解我的父母作为移民的挣扎，或者他们希望自己的生活会是什么样子。为了结束我们根深蒂固的隔阂，我意识到我必须学会同情作为人类的父母，并为我在家庭解体中扮演的角色承担责任。我本可以也应该更多地向他们伸出援手。\n那个母亲节标志着让我和母亲有机会相互了解的努力的开始。我发挥了新闻本能，慢慢地走了进来，尽可能保持情感上的距离，首先是在她的公寓里礼貌地吃了一顿我最喜欢的芥末鱼咖喱午餐。几个月过去了，信任开始建立，我们来到我在曼哈顿的厨房柜台，在我女朋友做咖喱羊肉的时候重温过去。\n我了解了我母亲小时候在杜尔加普尔读的书，当她年轻时第一次移民到加拿大时，融入加拿大的困难，以及她与抑郁症的斗争，这些都没有得到治疗。我小心翼翼地带着她看了那些斗争对我的影响。在我的一次印度之旅中，通过与她的对话以及与我父亲的类似对话，我开始以新的视角看待我自己的历史。\n我告诉了他们每个人我希望自己能做得更好的事情。我的父母，就像我之前那一代人中的许多移民一样，他们的生活是白手起家的，而我则有幸思考自己的情感和抱负。另一种说法是：他们渴望生存。我渴望活下去。我有意识地努力在我们不同的世界观之间进行翻译。这些谈话很有挑战性，有时还会走入死胡同。我经常需要照镜子，就像我需要他们看到我一样。在一个除了愤怒之外的情感很少分享的家庭长大后，仅仅听到别人的声音就是一种宣泄。\n在与母亲的一次艰难的电话交谈中，我告诉她，我发现我必须认识的那个女人是多么了不起：一个移民，她在杜尔加普尔的经历很少，但一再被迫改变自己的生活，往往在决定自己的道路上没有任何发言权，无论是通过移民、结婚还是离婚。\n“谢谢你，”她说。“也许吧。我不知道。有一点是可以肯定的：我尽了最大努力建立一个家庭。“。\n当她的眼泪平息下来时，她又提出了一个话题。“火鸡的事。”火鸡的事？我不得不找寻一下我的记忆。然后我就想起来了。这就是她想让我们的电话结束的方式？\n当我大约8岁的时候，一群火鸡爬上了我们家门前的草坪。当我离开去朋友家的时候，妈妈在我们的台阶上看着我，天开始下起了毛毛雨。我慢跑以躲避雨，当火鸡开始追赶我时，雨变成了我生怕死的冲刺。\n我母亲飞了出去，钻进她的车去驱散他们。我一直无法克服因此而产生的对动物的恐惧。\n“你成了镇上的热门话题，”我母亲高兴地说。“每次我看到有人：‘别忘了，香波是和火鸡一起跑的！’现在很好笑，但那时候就不好笑了。“。\n尽管我们当时都感到恐惧，但现在肯定很有趣。但她记住火鸡的故事可能是出于不同的原因。我们的许多故事都来自黑暗的地方，但在这个故事中，她是她作为母亲想要成为的保护者。当我们谈及我们共同的历史时，她不仅仅是我过去的足迹。她是我的母亲。\n但是，即使我在那些欢乐的时刻找到了平静，我也在努力从头开始建立家庭纽带。有些分歧需要很长时间才能修复。一些怨恨将永久地依附在我们身上。但我感到欣慰的是，我知道我正在采取一切可能的步骤来实现和解。我希望我的父母也有同样的感受。\n在那通母亲节电话大约一年后，我醒来时看到一封来自我母亲的电子邮件。\n“我对你有了更多的了解，”它说。“我脑子里有太多的事情想告诉你。但请永远记住，无论发生什么，我都爱你。“。\n索潘·黛布(Sopan Deb)是“纽约时报”的撰稿人，著有“错失的翻译：遇见抚养我的移民父母”\n“泰晤士报”致力于向编辑发表各种信件。我们想听听您对这篇文章或我们的任何一篇文章的看法。这里有一些小贴士。这是我们的电子邮件：Letters@nytimes.com。", "note_en": "It was Mother’s Day in 2018. I picked up the phone and dialed a cellphone number I had for my mother, knowing that she never used it. It was still on the family plan I had set up for us 10 years ago, and I noticed the usage was mostly zero. No one picked up.\n I sighed and wondered whether there was no way to get in touch with her. A part of me would have been relieved. I called another number — one from my childhood several residences ago — with a somewhat ridiculous expectation that it still belonged to her. It didn’t.\n My heartbeat steadily increased as I pressed each of the 10 digits. This time, the rings stopped short and I heard a soft greeting from my mother. The surprise in her voice when she recognized mine was evident, though she quickly covered it with a calm that I was also trying desperately to project. She sounded tired. The last time we had talked — four years prior — we were both angry.\n My Bengali parents had raised me and my older brother in suburban New Jersey, their union the result of a tumultuous and ultimately doomed arranged marriage. Our toxic home environment oscillated between my parents’ fighting and silence. They mercifully divorced when I was in high school after far too many years together trying to meet the inflexible expectation from South Asian culture that marriages last forever.\n They each tried, in their own way, to be parents. But I never learned even the basics about them, like where either was born, their birthdays, how they got to this country or how many siblings they had. There were no family vacations, game nights or holiday traditions. Much of my childhood was spent eating dinner alone in front of the television or with a friend’s family, seeking the warmth I so craved.\n We became increasingly estranged after I left for college in 2006, the distance between us gradually widening as might happen with an old acquaintance. My father called sporadically from somewhere in India, where he had unexpectedly moved back to when I was a freshman in college, but from my mother there was only silence. As the years without contact piled up, the space between us felt increasingly insurmountable.\n My brother, nine years older than me, cut ties definitively and decisively. When I was 19 years old, he got married, leaving our mother and father behind. While my brother built a new family for himself, he remained close with me. His wife and in-laws welcomed me at every holiday table. I have never faulted my brother for his approach. Some parents commit unforgivable sins. We do not owe our affection to those who share our DNA but have not earned a place in our lives.\n  But the discord gnawed at me. Around my 30th birthday, I decided that I needed to sit down with each of my parents, face to face, and try to address the deep-rooted issues keeping us apart. I worried about how they were managing on their own. And if nothing else, I did not know how much longer they would be around. I did not want them to die without us giving our relationships a chance.\n There were unanswered questions I had for each of them. With my father, I  needed to ask him why he disappeared to India without telling me and never came back. With my mother, I needed to understand why she locked herself in her room for the better part of my eighth-grade year. I wanted to hear their stories before it was too late and perhaps make sense of my own.\n It occurred to me that I had not tried to understand my parents’ struggles as immigrants or what they hoped their lives would be. To end our entrenched estrangement, I realized I would have to learn to empathize with my parents as humans and take responsibility for my role in our family’s disintegration. I could have and should have reached out to them more.\n That Mother’s Day marked the beginning of an effort to give my mother and me the chance to get to know each other. Journalistic instincts engaged, I inched in slowly and kept my emotional distance when I could, starting with a polite lunch over my favorite mustard fish curry at her apartment. As the months passed and trust started to build, we made our way to my kitchen counter in Manhattan, rehashing the past as my girlfriend made lamb curry.\n I learned about the books my mother read as a child in Durgapur, the difficulties of assimilating when she first emigrated to Canada as a young adult and her struggles with depression that had gone untreated. I walked her delicately through the way those struggles had affected me. Through the conversations with her and similar conversations with my father during a trip I took to India, I began to see my own history in a new light.\n I told each of them what I wished I had done better. My parents, like many immigrants in the generation before me, had built their lives from nothing, whereas I had the privilege to contemplate my emotions and aspirations. Said another way: They aspired to survive. I aspired to live. I made a conscious effort to translate between our divergent worldviews. The conversations were challenging and sometimes hit dead ends. Often I needed to look in the mirror as much as I needed them to see me. After growing up in a household in which feelings other than anger were rarely shared, just being heard was cathartic.\n During one difficult phone conversation with my mother, I told her how remarkable I found the woman I had to come know: an immigrant who started with very little in Durgapur and was repeatedly forced to change her life, often without any say in determining her own path, whether through immigration, marriage or divorce.\n “Thank you,” she said. “Maybe. I don’t know. One thing for sure: I tried my best to build a family.”\n As her tears subsided, she broached one more topic. “The turkey thing.”  The turkey thing? I had to search my memory for a second. And then I remembered. This was how she wanted our call to end?\n When I was about 8 years old, a flock of turkeys planted itself on our front lawn. As I left to walk to a friend’s house, with my mother watching me from our steps, it started drizzling. I jogged to get out of the rain, which turned into an in-fear-for-my-life sprint as the turkeys began chasing after me.\n My mother jetted out and got in her car to disperse them. I have never been able to overcome my resultant fear of animals.\n “You were the talk of the town,” my mother said, cheering up. “Every time I see someone: ‘Remember, Shambo was running with the turkeys!’ It’s funny now, but it wasn’t funny back then.”\n Despite the terror we both felt at the time, it is definitely funny now. But she probably remembers the turkey story for a different reason. So many of our stories come from a place of darkness, but in this one she was the protective force she meant to be as a mother. As we laughed about our shared history, she wasn’t just a footprint from my past. She was my mother.\n But even as I found peace in those moments of joy, I struggled to create familial bonds from scratch. Some schisms will take a long time to fix. Some grudges will permanently cling to us. But I take comfort in knowing that I am taking all the steps I can toward reconciliation. I hope my parents feel the same.\n A year or so after that Mother’s Day phone call, I awoke to an email from my mother.\n “I am getting to know you more,” it said. “There are so many things in my mind I wanted to tell you. But always remember I love you, no matter what.”\n Sopan Deb is a writer for The New York Times and the author of “ Missed Translations: Meeting the Immigrant Parents Who Raised Me.”\n The Times is committed to publishing   a diversity of letters  to the editor. We’d like to hear what you think about this or any of our articles. Here are some   tips . And here’s our email:   letters@nytimes.com .", "posttime": "2020-05-10 23:53:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "母亲节,silence", "title": "沉寂4年后，在母亲节给妈妈打个电话", "title_en": "After 4 Years of Silence, a Call to Mom on Mother’s Day", "transed": 1, "url": "https://www.nytimes.com/2020/05/10/opinion/mothers-day-estrangement-parents.html", "via": "", "real_tags": ["母亲节", "silence"]}, {"category": "", "categoryclass": "", "imagename": "7efa1be6e3be123cf5e664fb887b2447.jpg", "infoid": 1001533, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2019年2月21日，我们拍摄了一颗小行星。更准确地说，由日本宇宙航空研究开发机构(JAXA)建造和运营的Hayabusa2号航天器向近地小行星琉球(Ryugu)的表面发射了一枚5克重的金属弹。琉球是一颗旋转的顶部形状的天体，直径约1公里，距离地球约3.5亿公里。这种抛射物打碎了小行星的表面，让Hayabusa2号捕获了一些放样的材料，并将其安全地塞进了飞船。在2019年11月离开琉球后，Hayabusa2预计将在2020年底飞越地球，并将其样本放入返回舱中进行详细分析，供世界各地的实验室进行详细分析。\n在“科学”杂志上发表的一篇新论文中，Hayabusa2团队报告了他们对采样过程本身的观察，以及对琉球表面的测量通常可以告诉我们它的演变。这些观测描绘了一个不同寻常的故事，一位宇宙旅行者从地球表面出发，在太阳附近进行了一次短暂的旅行，最终作为一颗近地小行星在我们附近的轨道上安顿下来。\n我是一名行星科学家，我对为什么行星体看起来是这样很着迷。通过更好地了解琉球是如何以及为什么会出现现在的样子，我们将对太阳系天体的形成和发展有一个更全面的模型-包括常见的C型碳质小行星，琉球就是其中之一。\n这篇新论文描述了琉球的一些部分是如何变蓝的，而另一些部分是如何变红的。\n这些术语与小行星表面在可见光光谱中颜色的细微变化有关。Hayabusa2团队发现，这颗小行星的赤道和两极更蓝，而中纬度更红。有趣的是，这种颜色差异可能与年龄有关，或者更确切地说，与材料直接暴露在太空中的时间长短有关。这是因为暴露的表面会因为太空风化而变暗和变红--微陨石、太阳和宇宙粒子的轰击，以及太阳的加热，这是琉球的主要机制。\n当Hayabusa2从大约一米远的距离发射炮弹，然后它的推进器离开这颗小行星时，一团更红、更黑的鹅卵石和细小颗粒向外吹出，然后又落回了表面。任务团队的结论是，这些颗粒原本只落在巨石裸露的表面，落满了采样点，使其从略带蓝色变成了略带红色。\n这一观察结果让研究小组得以洞察琉球上的纬度条纹。裸露的物质被太阳和空间风化而变红，在小行星的弱重力作用下，慢慢地从地势较高的赤道和两极移动到地势较低的中纬度。这一运动在赤道和两极暴露出更新鲜、更蓝色的物质，并在两者之间沉积变红的物质。\n我发现最令人兴奋的是，通过分析琉球上陨石坑的大小和颜色，Hayabusa2团队得出结论，在某个时候，这颗小行星肯定比现在更接近太阳。这就可以解释表面变红的程度了。使用两种不同的模型计算陨石坑的年龄，研究小组估计，这种由太阳加热引起的变红肯定发生在800万年前或最近的30万年前-从宇宙学的角度讲，仅仅是一眨眼的功夫。\n根据Hayabusa2收集的图像，这些陨石坑的统计数据甚至显示，整个小行星表面本身的年龄可能不超过1700万年，比琉球主带母小行星被认为已经解体的时间年轻得多，后者发生在数亿到10亿年前。\n因此，向一颗相当不起眼的小行星发射一小块金属的简单行为就揭示了这颗小行星生命的详细故事，从形成，到它穿越太阳系内部的旅程，到今天继续塑造其表面的过程。我们可以从造访一颗小行星并描述它的特征中学到这么多东西，这是令人惊讶的。当我们明年拿回那些样品时，我们还会了解到什么呢？更多信息：T.Morota等人。由Hayabusa2从小行星琉球(162173)采集的样本：表面进化的含义，科学(162173)。doi：10.1126/cience.aaz6306", "note_en": "On Feb. 21, 2019, we shot an asteroid.    More precisely, the  Hayabusa2 spacecraft, built and operated by the  Japan Aerospace Exploration Agency, or JAXA, fired a 5-gram metal projectile into the surface of the near-Earth asteroid Ryugu, a spinning-top-shaped body about 1 kilometer across and some 350 million kilometers from Earth. This projectile disrupted the surface of the asteroid, allowing Hayabusa2 to capture some of the lofted material and tuck it safely away on board. Having departed from Ryugu in November 2019, Hayabusa2 is expected to fly past Earth in late 2020 and release its samples in a reentry capsule for detailed analyses in labs across the world.\n  In a new paper published in  Science, the Hayabusa2 team reports on their observations of the sampling process itself, and what measurements of Ryugu&#39;s surface generally can tell us of its evolution. These observations paint a remarkable story of a cosmic traveler that traveled from the  , taking a short-lived excursion near the Sun, before ultimately settling into an orbit in our neighborhood as a near-Earth asteroid.\n  I&#39;m a planetary scientist, and I&#39;m fascinated by why planetary bodies look the way they do. By understanding better how and why Ryugu gained its current appearance, we&#39;ll have a more comprehensive model for how solar system bodies form and develop—including common, &#34;C-type&#34; carbonaceous asteroids, of which Ryugu is one.\n     The new paper describes how some parts of Ryugu are &#34;bluer&#34; and others are &#34;redder.&#34;\n  These terms relate to subtle variations in color of the asteroid surface across the visible spectrum. The Hayabusa2 team found that the equator and poles of the asteroid are bluer, whereas the midlatitudes are redder. Intriguingly, this color difference may be tied to age—or, rather, how long material is directly exposed to space. That&#39;s because exposed surfaces are darkened and reddened by space weathering—bombardment by micrometeorites, solar and cosmic particles—and heating by the Sun, which is the primary mechanism for Ryugu.\n    When Hayabusa2 fired its projectile from a distance of about a meter, and then its thrusters to move away from the asteroid, a cloud of redder, dark pebbles and fine grains blew outward before falling back onto the surface. The mission team concluded that these particles, originally only on the exposed surfaces of boulders, landed all over the sampling site, turning it from a slightly blue color to slightly red.\n   This observation offered the team an insight into the latitudinal &#34;stripes&#34; on Ryugu. Exposed material, reddened by the Sun and by space weathering, slowly moves under the asteroid&#39;s weak gravity from the topographically high equator and poles to the topographically low midlatitudes. This movement exposes fresher, bluer material at the equator and poles and deposits the reddened material in between.\n  What I found most exciting was that, from the analysis of the size and colors of craters on Ryugu, the Hayabusa2 team concluded that at some point the asteroid must have been closer to the Sun that it is now. That would explain the amount of reddening of the surface. Using two different models for calculating the age of craters, the team estimated that this solar heating-induced reddening must have happened either eight million years ago or as recently as 300,000 years ago—a mere blink of an eye, cosmologically speaking.\n  These crater statistics, based on images collected by Hayabusa2, even show that the age of the overall asteroid surface itself is likely no more than around 17 million years, much younger than the time when the main-belt parent asteroids of Ryugu are thought to have broken apart, which happened hundreds of millions to over a billion years ago.\n   And so it is that the simple act of firing a small pellet of metal into a rather unremarkable asteroid has revealed a detailed story of that asteroid&#39;s life, from formation, through its journey across the inner solar system, to the processes that continue to shape its surface today. That we can learn so much from visiting an asteroid and characterizing its   is astonishing. What more will we learn when we get those samples back next year?        More information:\t\t\t\t\t\t\t\t\t\t\t\tT. Morota et al. Sample collection from asteroid (162173) Ryugu by Hayabusa2: Implications for surface evolution,  Science (2020).  DOI: 10.1126/science.aaz6306", "posttime": "2020-05-10 23:52:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "小行星,asteroid,表面", "title": "触摸小行星琉球揭示了其表面和改变轨道的秘密", "title_en": "Touching the asteroid Ryugu revealed secrets of its surface and changing orbit", "transed": 1, "url": "https://phys.org/news/2020-05-asteroid-ryugu-revealed-secrets-surface.html", "via": "", "real_tags": ["小行星", "asteroid", "表面"]}, {"category": "", "categoryclass": "", "imagename": "b338e0624ba4df5ffcbca30943b43673.png", "infoid": 1001532, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我是在斯特鲁加茨基兄弟的“路边野餐”和“有人居住的岛屿”等书中长大的。\nLensAI的想法诞生于去年5月的某个时候。如果你错过了我故事的第一部分，你可以在这里阅读--“我们是如何教会人工智能销售的”。\n在我们产品开发的早期阶段，我们对此充满热情，充满活力。我们渴望从现在到永远改变世界。我们觉得我们是业内从未见过的创新者，巨大的变革将伴随我们而来！我们想飞，但我们从以前的创业公司获得的经验让我们停在了地面上。\n你又在做梦了。停下来！现在是时候开发一款能让你赚钱的产品了，最好是快点！关于改变世界的思考已经够多了，至少在你看到口袋里有第一个人工智能赚到的1K美元之前，我的脑海里一直在重复着。\n在与我内心的批评者和我的搭档谈判后，我们决定按下停止按钮。我们的创业公司选择了一种广为人知、久经考验的商业模式。从那一刻起，人们就再也没有想过要把我们的技术整合到镜片和眼镜上了。我们把重点转移到了识别物体和销售广告上。\n我们在做关于竞争对手的研究，但我们的社交媒体追随者也帮了我们很大的忙，因为他们不断向我们发送大量关于各种公司的信息，这些公司以某种方式从事图像或视频中的对象识别。切菜板。\n康斯坦丁和我都是不安分的人，被无尽的疑虑折磨着。我们有那么多未回答的问题。\n为什么所有这些相互竞争的公司都有数百万和数亿美元的价值，但其中没有独角兽公司？为什么他们的技术在互联网上如此罕见？为什么？为什么？为什么？我经常问自己，都快把我逼疯了。\n为了进一步推进我们的想法，我们必须找到答案。使用视觉搜索和广告作为关键词，我们能够找到与我们的想法或多或少相关的公司。我们把他们都聚集在我们的切菜板上，拿出一把刀，开始了凌乱的检查过程。\n通过对一家又一家公司的分析，我们注意到两大相似之处：有限的广告库存和有限的广告展示。所有这些项目都经过了改进，可以与狭窄的产品圈合作。不仅如此，它们中的一些只适用于单一类别的产品或一个品牌。此外，要显示广告，必须提供与产品相同的匹配项。这个前提对我们来说似乎太严格了。\n由于所使用的商业模式，许多项目都有局限性。它们要么是B2B(企业对企业)，非常复杂，要么是B2C(企业对消费者)，在我们看来是不可行的。例如，一些项目需要与产品植入机构互动，才能在智能电视上流式播放的视频中显示广告。\n所有项目都有相同的“鸡和蛋”问题。“发生这种情况的原因是，当时正在销售的产品数据不足，即使广告商愿意付费为这些产品做广告，也可以在相关的视觉内容中显示出来。”\n我们的砧板帮助我们确定了三个主要问题，如果我们想要成功，我们需要比我们的竞争对手更有效地解决这些问题：\n无论内容首次发布的日期是什么，产品/服务的广告都必须与检测到的视觉内容的对象高度相关。\n我们必须将广告直接投放到检测到的对象中，并以一种不会严格依赖于相似性算法的方式显示广告投放决策。同时，我们不希望用户质疑我们的广告投放或广告选择。\n我们必须为一台机器提供广泛和相关的广告库存，我们必须定期收到这些库存。这样，机器就可以应用各种显示广告算法。\n我们必须让这台机器在浏览的那一刻完全像一个人一样思考。例如：\n这家伙穿的衬衫真可爱，我知道一块男士手表会配得上它的！\n众所周知，人脑的思维过程由于其情感上的无能为力，很难被计算机复制。但我们决定试一试，训练这台机器进行联想决策。\n我们第一次尝试制定可检测的对象、实体、人和其他特征之间的所有需求和链接关系，结果看起来像是某个未知的怪物，要求我们分析所有可能和不可能的数据。\n通过多次测试和大脑中的痛苦，我们能够收集到我们所拥有的所有可以分析的数据。“下面的图片清晰了：\n我们将整个动物园的数据系统化成一张影响力地图，该地图导航了每个实体如何影响那个特定场景中的其他每个实体。让我向您展示它是如何在一个框架内工作的。例如，一旦环境被确定为厨房，厨房用具等广告类别的物品的影响力就增加了。厨房护理产品，厨房护理产品，厨房护理用品，餐具，餐具等广告类别中的对象的影响力都增加了。(注：厨房用品是厨房用品，厨房用品是厨房用品，厨房护理产品，厨房护理用品，餐具，餐具等广告类别中的对象的影响力也增加了。)。\n因此，我们构建了一个影响图，您可以在下面看到它的一个版本。(我们故意扭曲了它，因为它包含了对我们有价值的算法参数。)。\n在此图像中，您可以看到我们操作的实体以及所有实体是如何相互影响的，同时分析图像和上下文的过程正在运行，以显示最相关的广告。\n任务被成功定义：根据特征特征确定对象和实体与广告类别的关系。\n完成后，下一步是在两个实体之间建立连接：类别和对象。\n对象关系是一个对象与某个分类范畴有明显联系的方式。换言之，从分类学的角度来看，每种对象关系都可以描述为对象对产品的某种影响。也就是说，当我们在图像中看到一个物体时，我们可以假设这个物体是一个中心物体，我们需要根据一些特征找到与这个物体相关的产品。\n在处理任务时，需要应用以下关系(表征特征)：\n工具我们需要两个元素来处理大量数据和实体之间的各种类型的关系，它们是：\n一种工具，可以帮助这些人将他们的知识转移到机器上，在我们的例子中，就是识别对象之间关系的特定知识。\n猜猜哪一个更难找到？(剧透警报！这是第一个。)。\n我们在互联网上找遍了，但没有找到能满足我们要求的工具。我们别无选择，只能创造我们自己的。我们汇集了处理海量数据和连接类型的能力。请注意，每个可能的联系都必须有自己的影响力。\n此外，所有这些联系都必须由不同的人建立，这些人可以捕捉机器制造的错误，然后纠正它们。因此，我们得到了一个具有两个面板的数据管理器，它具有广泛的功能集，并且能够处理关系数据库和图形数据库。\n产品开发的这个阶段几乎让我们筋疲力尽。康斯坦丁和我都没有经历过项目开始时的那种兴奋。在我们看来，处理和连接如此大量的数据是不可能的。我们确定物体之间关系的任务即将失败。\n为了感受我们的痛苦，想象一下我们必须处理的几个过程，比如将可检测到的对象与广告类别联系起来，收集可检测到的对象的所有可能的变体，将行业和上下文主题与广告类别联系起来……。\n我们没有统计所有这些进程，但它们有几十万个。感觉就像地狱一样。我们知道现在是委派的时候了，所以自从创建了五个人的小组以来，两个数据都只有一个目的，就是将所有实体链接在一起。这是我们拍到的照片。\n您可以在上图中看到各种实体的关系。最后一张显示了一个场景，也就是单个图像中多个实体的影响。\n我们能够实现这样的场景：在框架对象中检测到的对象总是争夺要显示的权利，而算法的工作是确定在每个框架中显示哪个广告。例如，在三个广告中显示哪一个(茶壶、咖啡机或家具店品牌)的最终决定权完全落在算法的肩上。\n如今，你不能用物体识别软件让任何人感到惊讶，但凭借高准确率的识别，你可以做到。\n下一步是确定我们的模型工作有多精确，如果机器是错的，就给它们F。在进行这项工作的同时，我们还手动测试了我们在完成任务时建立的一些关系，以确定实体之间的关系。\n结果，我们得到了一大堆由机器算法完成的分类错误。我们在数以千计的电影图像和视频画面中发现了它们。为了纠正错误，我们的两个数据，因为小组必须手动标记它们，然后逐个分类。\n有近30种不同类别的错误。我将在下面列出一些最大的。请注意，这些错误类中的每个错误类最多包括十个子类。\n我们继续努力，离我们的目标越来越近。下一步是发布一个公开演示，这样您就可以评估我们的工作或指出我们需要修复的缺点。\n我们承诺将以高质量的内容、我们项目的最新进展和关于机器学习的各种有趣的故事来取悦您。\nLensAI是一个联盟营销平台，可以在正确的时间自动在正确的地点投放正确的广告！🎯。\n我们正在构建一种广告格式，将视觉内容转变为无缝的购物体验-在浏览和销售之间没有更多的差距。", "note_en": "I grew up on such books as «Roadside Picnic» by the Strugatsky Brothers and «The Inhabited Island»\n The idea of LensAI was born last year sometime in May. If you&#39;ve missed Part I of my story, you can read it here -&gt;  How We Taught Artificial Intelligence to Sell.\n At the early stage of our product development, we were passionate about it and full of energy. We desired to change the world now and forever. We felt that we were the innovators the industry had never seen, and massive changes would come with us! We wanted to fly, but the experience we gained from previous startups kept us pulled to the ground.\n &#34;You are dreaming again. Stop it! It is time to build a product that can make you money, preferably quickly! Enough thinking about changing the world, at least until you see the first AI-earned $1k in your pocket,&#34; my mind kept repeating to me all the time.\n After negotiating with my inner-critics and my partner, we decided to press the stop button. A well-known and proven business model was chosen for our startup. Since that moment, there have been no more thoughts about the integration of our technology into lenses and glasses. We shifted our focus to recognizing objects and selling ads.\n  We were doing our research on competitors, but our social media followers were a great help too as they were continually sending us tons of information on various companies that were somehow engaged in the object recognition in images or videos.   The Cutting Board\n Being the restless minds, Konstantin and I were tormented by endless doubts. We had so many unanswered questions.\n &#34;Why all these competing companies are worth millions and hundreds of millions of dollars, but there are no unicorns among them? Why are their technologies so rare to come across on the Internet? Why? Why? Why?&#34; I was asking myself so often that it drove me nuts.\n To proceed further with our idea, we had to find the answers. Using &#34;visual search&#34; and &#34;advertising&#34; as the keywords, we were able to find the companies that were more or less related to our idea. We gather all of them on our &#34;cutting board,&#34; took out a &#34;knife,&#34; and began the messy examining process.\n Through analyzing companies one after the other, we noticed two major similarities: limited advertising inventory and limited ad displays. All those projects were sharpened to work with a narrow circle of products. More than that, some of them worked only within a single category of products or one brand. Also, to display an advertisement, the identical match of the product had to be available. This prerequisite seemed too strict for us.\n Many projects had limitations due to the business model they used. Either they were B2B (business-to-business) and very complex or B2C (business-to-consumer) and, in our opinion, not viable. For example, some projects required interaction with product placement agencies to show ads in a video that was streamed on Smart TV.\n All projects had the same &#34;chicken and egg&#34; problem in common.  It occurred due to an insufficient amount of data about products that were being sold at that moment and could be displayed in relevant visual content even though the advertiser was ready to pay to advertise these products.\n Our &#34;cutting board&#34; helped us to identify three main problems that we needed to solve more efficiently than our competitors if we wanted to succeed:\n The ads of products/services had to be hyper-relevant to the detected objects of the visual content regardless of the date when the content was first released.\n We had to place our ads straight into detected objects and show them in a way that ad placement decisions would not depend strictly on similarity algorithms. Simultaneously, we didn’t want the user to question our ad placements or ad choices.\n We had to provide a machine with a broad and relevant advertising inventory that we would have to receive regularly. This way, the machine could apply various display advertising algorithms.\n  We had to make the machine to &#34;think&#34; exactly like a person in the moment of browsing. For example:\n  &#34;What a cute shirt this guy is wearing, I know that a men&#39;s watch would match it perfectly!&#34;\n  As we know, a human brain thinking process is hard to duplicate by the computer due to its emotional inability. But we decided to give it a try and train the machine in associative decision-making.\n  Our first try to formulate all the requirements and link relationships between detectable objects, entities, people, and other characteristics ended up looking like some unknown monster that demanded us to analyze all possible and impossible data.\n Through multiple tests and pain in the brain, we were able to collect all the data we possessed that could be analyzed.  The following picture cleared up:\n   We systematized the entire &#34;zoo&#34; of data into an influence map that navigated how every entity influenced every other entity in that particular scene. Let me show you how it worked within a frame. For example, once &#34;Environment&#34; was identified as &#34;Kitchen,&#34; the influence of objects from such advertising categories as &#34;Kitchen Furniture,&#34; &#34;Kitchen Appliance,&#34; &#34;Spoons,&#34; &#34;Kitchen Care Products,&#34; &#34;Cups,&#34; &#34;Tableware,&#34; and others, was increased.\n As a result, we built an influence map, a version of which you can see below.  (We distorted it on purpose as it includes parameters of the algorithm that are of value to us.)\n  In this image, you can see what entities we operate and how all of them influence each other while the process of analyzing images and context is running to display the most relevant advertisement.\n The task was successfully defined: determine the relationships of objects and entities to advertising categories according to characterizing features.\n Once accomplished, the next one was to establish a connection between two entities: a category and an object.\n Object relationships are ways of one object to have an obvious connection with some Taxonomy category. In other words, each object relation can be described as some influence of the object on the products from Taxonomy. Meaning, when we see an object in the image, we can assume that this object is a central one, and we need to find relevant to this object products according to some characterizing feature.\n When working on the task, it was necessary to apply the following relationships (characterizing features):\n  The Tool We needed two elements to work with large volumes of data and various types of relationships between entities, they were:\n  a tool that would help these people to transfer their knowledge to a machine, in our case, the particular knowledge to identify relationships between objects.\n Guess which one was much harder to find? (Spoiler Alert! It was the first one.)\n We searched all over the Internet but could not find a tool that would satisfy our requirements. We had no choice but to create our own. We brought together the capabilities of working with massive amounts of data and types of connections. Notice that each possible connection had to have its own weight of influence.\n Also, all these connections had to be established by various people who could catch machine-made errors and then correct them. As a result, we got a two-panel data manager that had a broad set of functions and the ability to work with both relational and graph databases.\n   This stage of product development was the one that almost burnt us out. Neither Konstantin nor I experienced the euphoria we had at the beginning of the project. It seemed to us that to process and link such volume of data is beyond the bounds of possibility. Our mission to determine the relationships between the objects was about to fail.\n To feel our pain, imagine a few of the processes we had to deal with, such as linking detectable objects to advertising categories, collecting all possible variations of detectable objects, connecting both industries and context themes with advertising categories...\n We didn&#39;t count all these processes, but there were hundreds of thousands of them. It felt like HELL. We knew it was time to delegate, so two data since groups of five people were created, both had the only purpose of linking all entities together. Here is the picture we got.\n    You can see the relationships of various entities in the images above. The last one shows a &#34;scene,&#34; aka the influence of multiple entities within a single image.\n We were able to achieve the scenario where the detected in the frame objects always fight for the right to be displayed, and the algorithm&#39;s job is to determine which ad to display in each frame. For example, the final decision on which one of three advertisements to show (a teapot, a coffee maker, or a furniture store brand) is totally on the algorithm&#39;s shoulders.\n Nowadays, you cannot surprise anyone with object recognition software, but with the high accuracy of recognition, you can.\n  The next step was to identify how accurately our models worked and give Fs to machines if they were wrong. In parallel with this work, we also manually tested some of the relationships that we established when we were completing the task to determine relationships between entities.\n As a result, we got a whole bunch of classification errors that were done by machine algorithms. We found them in thousands of images and video frames of movies. To correct the errors, both our data since groups had to mark them manually and then classify them one by one.\n   There were nearly thirty different classes of errors. I will list some of the largest ones below. Please know that each of these error classes includes up to ten subclasses.\n   We continue to work and are getting closer to our goal. The next step is to release a public demo so that you can evaluate our work or point out our shortcomings that require a fix.\n  We promise to delight you with quality content, update on the progress of our project and various entertaining stories about machine learning.\n LensAI is an Affiliate Marketing Platform that automatically delivers the right ads in the right place at the right time! 🎯\n We are building an ad format that turns visual content into a seamless shopping experience — no more gap between browsing and sale.", "posttime": "2020-05-10 23:52:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "思维,艺术,传授,teaching,广告", "title": "向机器传授联想思维的艺术", "title_en": "The Art of Teaching Associative Thinking to Machines", "transed": 1, "url": "https://hackernoon.com/where-can-dreams-take-you-the-art-of-teaching-associative-thinking-to-machines-by6r3yme", "via": "", "real_tags": ["思维", "艺术", "传授", "teaching", "广告"]}, {"category": "", "categoryclass": "", "imagename": "aa70361b1b33e9c8f359840ce5f7b596.jpg", "infoid": 1001531, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与数百万美国人一样，软件公司Limeade的首席人事官兼首席科学官劳拉·哈米尔(Laura Hamill)自3月初以来一直被迫在家工作，以努力阻止冠状病毒的传播。虽然今天强迫的远程文化对许多人来说已经是一种调整，但这位两个十几岁孩子的母亲说，她期待着即使在大流行消退后，也有可能更频繁地在家工作。\n对我来说，这在某种程度上减轻了第二个班次的压力，她告诉CNBC说，要做到这一点。我可以在中午启动洗碗机，或者我可以把鸡拿出来煮，稍后再吃。她补充说，对她来说，远程工作一直是为人父母的巨大优势。\n像哈米尔一样，其他许多人也希望在未来让他们的家庭办公室更多地成为永久的工作空间。事实上，根据商业出版公司getAbstract发布的一项调查，近43%的美国全职员工表示，即使在经济重新开放后，他们也希望更频繁地远程工作。在4月16日至4月17日期间接受调查的1200多名员工中，近20%的人表示，他们的雇主正在积极讨论未来如何让远程工作成为一种更多的选择。\n在Limeade，哈米尔说，他们已经在考虑如何让目前的弹性工作计划更具包容性。她说，在大流行之前，员工可以选择远程工作，但由于日程安排和业务需求，员工仍然需要一周多天在办公室工作。她说，现在，我们正在考虑实际上颠覆这一模式，问自己，我们都想在哪一天一起呆在(办公室)？她说，这样一来，如果员工选择一天在办公室进行面对面的会议和活动，那么如果他们愿意的话，一周剩下的时间都可以在家工作了，如果他们愿意的话，他们就可以选择在办公室里工作的一天了，如果他们愿意的话，那么他们就可以在一周剩下的时间里在家工作了。她说，这样一来，员工就可以选择在办公室里的哪一天面对面开会和活动，如果他们愿意的话，他们就可以在家里工作了。\ngetAbstract首席战略官安德鲁·萨维卡斯(Andrew Savikas)表示，员工更喜欢远程工作的最大原因之一是，他们可以节省日常通勤时间。根据人口普查局的数据，2018年，美国人在上班的单程通勤上平均花费了大约27分钟。这相当于每年花在通勤上的时间超过200个小时。\n萨维卡斯说，人们喜欢找回时间，同时补充说，员工也喜欢远程工作的灵活性，因为他们可以随心所欲地安排一天的工作。\n根据CNBC/Change Research对摇摆州5000多名选民进行的联合调查，47%的人表示，他们通常花在通勤上的时间现在被用来更多地与家人在一起。这项调查在4月17日至4月18日期间收集了回复，调查还发现，员工们一直在把节省下来的通勤时间花在更多的睡眠上，专注于各种爱好，完成更多的工作。\n雷蒙德·琼斯(Raymond&34；RJ；Jones)说，他亲眼目睹了远程工作安排如何对你的个人和职业生活产生积极影响。琼斯目前担任云计算房地产公司EXP World Holdings负责财务和增长的执行副总裁，在此之前，他的整个职业生涯都是在办公室工作的。\n他说，他的上一份工作是Zillow负责投资者关系的副总裁，要求他每天上下班大约两个小时。我住在[华盛顿州]的塔科马，每天都要往返于西雅图，他在谈到自己经常往返于Zillow的办公室时说。保证单程在公交车或火车上至少一个小时，而且交通也很畅通。\n琼斯说，现在通勤的噩梦已经不存在了，因为他目前的角色允许他远程全职工作。琼斯有一个15岁的儿子和一个12岁的女儿。在疫情爆发之前，琼斯说，灵活的工作时间安排让他可以去参加孩子的体育赛事，并帮助解决家庭后勤问题。他解释说，他的妻子是一名律师，工作时间安排也和他一样苛刻，在家工作的能力减轻了她很大的负担。他说，今后，工作场所的灵活性仍将是他职业生涯中的重中之重。他说，随着时间的推移，工作场所的灵活性仍将是他职业生涯中的重中之重，因为他的妻子是一名律师，工作时间安排也和他的一样苛刻。他说，灵活的工作时间安排让他可以去参加孩子的体育赛事，帮助解决家庭后勤问题。\n虽然目前的大流行肯定是史无前例的，但萨维卡斯表示，它的影响只会强化我们已经看到的许多变化。电子商务已经是一件大事了。他说，家庭杂货快递已经是一件事了，在家里工作(对一些人来说)也已经是一件事了。只是我们在五周内就遇到了相当于五年的变化，这可能有点不和谐。\n这位高管说，他希望这场流行病能提供一个难得的机会，从根本上重新思考我们的工作和生活方式。他说，这包括减少花在汽车上的时间，减少污染，让人们有机会重新获得一些灵活性，获得更好的工作与生活平衡。", "note_en": "Like millions of Americans, Laura Hamill, chief people officer and chief science officer at software company  Limeade, has been forced to work from home since early March in an effort to stop the spread of COVID-19. Though today&#39;s forced remote culture has been an adjustment for many, the mom of two teenagers says she looks forward to the possibility of working from home more often even after the pandemic subsides.\n &#34;To me it sort of takes the edge off of the second shift,&#34; she tells  CNBC Make It. &#34;I can start the dishwasher in the middle of the day or I can put out the chicken to cook for a later meal.&#34; She adds that for her, working remotely has been a huge advantage as a parent.\n  Like Hamill, many others are hoping to make their home office more of a permanent work space in the future. In fact, nearly 43% of full-time American employees say they want to work remotely more often even after the economy has reopened, according to a survey released by business publishing company  getAbstract. Of the more than 1,200 employees surveyed between April 16 and April 17, nearly 20% said their employer is actively discussing how they can make remote work more of an option in the future.\n At Limeade, Hamill says they&#39;re already thinking of ways in which they can make their current flexible work program more accommodating. Before the pandemic, she says employees had the option to work remotely, but due to scheduling and business demands workers were still needed in the office multiple days a week. Now, she says, &#34;we&#39;re considering actually flipping the paradigm and saying, &#39;What&#39;s the day that we all want to be in [the office] together?&#39;&#34; This way, she says, if they select one in-office day for in-person meetings and activities, then employees have the rest of the week to work from home if they choose.\n  Andrew Savikas, chief strategy officer at getAbstract, says one of the biggest reasons why employees prefer to work remotely is because they get to save time on their daily commute. On average, Americans spent roughly  27 minutes on their one-way commute to work in 2018, according to the Census Bureau. This equates to over 200 hours spent commuting per year.\n &#34;People like having that time back,&#34; Savikas says, while adding that employees also like the flexibility of working remotely because they can &#34;structure the day how they want.&#34;\n According to a joint  CNBC/Change Research survey of more than 5,000 voters in swing states, 47% said the time they would normally spend on commuting has now been used to spend more time with their family. The survey, which gathered responses between April 17 and April 18, also found that employees have been spending the time they save on their commute to sleep more, focus on various hobbies and get more work done.\n  Raymond &#34;RJ&#34; Jones says he&#39;s seen first-hand how a remote work schedule can positively impact your personal and professional life. Prior to stepping into his current remote position as executive vice president of finance and growth at eXp World Holdings, a cloud-based real estate company, Jones spent his entire career working in an office.\n He says his last job, which was vice president of investor relations at Zillow, required him to spend roughly two hours commuting to and from work each day. &#34;I live in Tacoma, [Washington] and would commute to Seattle each day,&#34; he says of his regular commute to Zillow&#39;s office. &#34;It was guaranteed at least an hour on the bus or train each way, and that&#39;s with perfect traffic.&#34;\n Now, Jones says, &#34;the commuting nightmare is gone&#34; since his current role allows him to work remote full-time. Before the pandemic, Jones, who has a 15-year-old son and a 12-year-old daughter, says his flexible schedule allowed him to go to his &#34;kid&#39;s sporting events and help out with family logistics.&#34; He explains that with his wife being an attorney and having a work schedule that is just as demanding as his, the ability to work from home took &#34;so much of the burden off of her.&#34; Moving forward, he says, workplace flexibility will remain a top priority in his career.\n While the current pandemic is certainly unprecedented, Savikas says its impact has only reinforced a lot of the changes we were already seeing. &#34;E-commerce was already a big thing. Home grocery delivery was already a thing, and working from home was already a thing [for some],&#34; he says. &#34;It&#39;s just that we&#39;ve encountered five years worth of change in five weeks and that can be a little bit jarring.&#34;\n The executive says he hopes this pandemic will provide &#34;one of those rare opportunities to radically rethink the way we work and live.&#34; This includes, he says, having &#34;less time spent in cars, less pollution and a chance for people to reclaim some flexibility and have more work-life balance.&#34;", "posttime": "2020-05-10 23:38:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "远程工作,表示,work", "title": "即使在大流行之后，43%的人表示他们会希望更频繁地远程工作", "title_en": "Even After the Pandemic, 43% Say They'll Want to Work Remotely More Often", "transed": 1, "url": "https://www.cnbc.com/2020/05/04/why-many-employees-are-hoping-to-work-from-home-even-after-the-pandemic-is-over.html", "via": "", "real_tags": ["远程工作", "表示", "work"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001530, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“不可捉摸”一书的作者尼尔·埃亚尔说，分心是把我们从我们计划做的事情上拉出来的行为。分心的对立面不是专注，而是牵引力。任何事情都可以让人分心，就像任何事情都可以成为牵引力一样。如果你在计划做一个大项目时查看电子邮件，你就会分心。相反，如果你打算玩电子游戏，这个游戏不会让你分心。这是牵引力。\n拖延症是指我们全神贯注于分散注意力，而不是去做我们计划做的事情，\n关于我们为什么拖拉，以及为什么这个不受欢迎的习惯如此难以改掉，有很多理论。\n在20世纪30年代，心理学家训练老鼠做某种特定的行为，比如按下杠杆，给它们一点奖励。一旦经过训练，科学家们发现，当老鼠以每3-7次的可变比例时间表获得不可预测的奖励时，它们会更频繁地执行训练过的行为。更值得注意的是，在随机奖励的情况下，这种行为变得很难消除。\n获得奖励会在大脑中释放多巴胺，即使是对奖励的期望也会产生这种效果。\n不仅是老鼠，人类也有随机性的欲望。我们对不可预测性感到兴奋。观看体育比赛--谁会得分/获胜？钓鱼--我能钓到鱼吗？阅读新闻-(过去一个小时)发生了什么？听收音机-他们下一首歌是什么？去酒吧--我会遇到谁？购物--打折吗？\n在这个时代，我们离随机性只有一步之遥。我们中的大多数人无论走到哪里都带着一部智能手机，很大一部分吸引力在于发现“新事物”的兴奋感。对一些人来说，它比糖和海洛因更容易上瘾。\n从事随意性本身并不坏，但当我们利用它来拖延时，它可能很难停止。只需再单击、滚动或制表符。\n我们计划做的许多任务，比如工作、学习和家务，都没有立竿见影的回报。工作和学习的好处是未来的，而查看Instagram或Facebook会立即击中大脑中的奖励系统。我的帖子上有什么赞吗？钟形图标下隐藏着什么故事？\n我和其他许多人用来对抗拖延症的一种流行的技术是时间拳击(Time Boxing)，也就是所谓的“时间拳击”。波莫多罗技术。这项技术规定了25分钟的会议工作，然后是5分钟的休息。有一条严格的规定。在25分钟的工作时间里，你只能完成一项任务，不要打断自己，比如查看电子邮件。没有干扰，只有牵引力。\n在25分钟的工作时间里，我可以集中精力，但我没有休息的制度。\n在我休息的时候，我经常会不假思索地检查网上的“老虎机”。新闻网站和社交媒体。我承认我没有在5分钟的休息时间使用计时器，因为我只有一个计时器。因此，我对5分钟的休息时间不那么严格，这意味着他们可能会超过一点。\n我试过媒体禁食。太严格了。我的鼠脑经常会设法想出一个借口来打破禁食。\n我需要一个更好的休息系统。(对我来说)重点就是获得一点娱乐。我想要满足我对(社交)媒体的渴望，但要以负责任的方式。\n我意识到，相信自己会在此刻做出理性的决定是不明智的。\n丹·艾瑞里(Dan Ariely)在研究行为经济学和非理性时发现，大多数人认为自己是未来更好的版本。“我们都认为，在未来，我们是很棒的人。我们会有耐心，我们不会拖延，我们会锻炼，我们会吃得好……。问题是我们永远不会生活在那样的未来。我们总是活在当下。“\n他建议克服当前非理性的一个诀窍是提前做决定。例如，善待你未来的自己的一种方法是在月初为退休设立自动储蓄，而不是等到月底资金紧张的时候。否则，你的“现在的自己”将赢得你的“未来的自己”。\n因此，回到工作期间有效休息的问题上来。我想要一些娱乐，但不要被拖入互联网的兔子洞太深。我本可以制定一个有很多规则的严格计划，但我对自己有足够的了解，知道我会找借口打破这些规则。\n人类的大脑在某些方面与老鼠没有太大的不同。我们也渴望多巴胺的刺激。我在想，我怎样才能利用随机性的欲望来造福于我呢？\n第一个原型：我拿了一个大玻璃瓶，里面装满了纸片。在每个批次上，我都写了一件事，我会在休息时通过做一些事情来奖励自己。facebook，linkedin，twitter，youtube，俯卧撑，本地新闻，国家新闻，技术新闻，关闭浏览器标签，头脑风暴，…。还有更多。有些拍品我复印得比较多，因为我想每天复印好几次。例如，我想每天登陆Facebook多达4次，所以我用Facebook赚了4次。\n使用“随机性机器”很简单。在完成了25分钟的工作后，是时候转移注意力了。我从办公桌上站起来，走到罐子前，随机挑选了一批。闭上眼睛-不能作弊。\n第一印象：它工作得很好(否则我就不会费心写这篇文章了)。现在我的休息时间更有条理了。一个有意义的奖励，而不是我的旧习惯，一把空洞的奖励是出于无聊而挑选出来的。每次休息只有一个奖励的稀缺让我更欣赏它，更重要的是，画很多画的随意性带来了很多兴奋(双关语)。\n升级原型：几天后，我升级了原型。我意识到我白天不需要这么多奖励。所以我又增加了一条规则。一天的前半部分，我致力于深入工作，在那里我做了8个时隙的编程。我制定的新规则是，在此期间，我不会使用随机性罐子，而是在完成每个会话后掷骰子。骰子的每一面都指定了一个活动或奖励：1个伸展运动，2个瑜伽姿势，3个泡沫辊，4个思考，5个Facebook，6个从罐子里挑。我应该经常做的事情(伸展、翻滚泡沫)和消遣之间的混合。在前8个时隙完成之后，我跳过骰子，在这一天剩下的时间里直接去随机罐子里的好东西。\n有了原型的第二个版本，我仍然可以在一天中获得随机性，但它不会那么让人分心。\n如果有一种奖励我想比每天少一些，我会把它放在罐子下面几天，然后再放回罐子里。\n我的罐子里有大约两倍于我平时经历的数量，所以不能保证我每天都能拿到每一份奖励。这很好。推特可以等一等。\n画了很多之后，我没有把它放回去，但我有一些复制品或三件复制品。如果我连续两次画同样的画，我允许自己跳过它，重新画一张，不要用它来安排涉及其他人的社交消遣。\n我的休息时间更好，更有成就感，我回来工作的速度也更快。我认为白天的拖延症比较少。\n有了随机性机器，我的兴奋变得更大了。我更感谢你转移注意力。现在，它实际上感觉像是一种应得的奖励，对于我画的是哪一幅画，有一种悬念的感觉。\n减少决策疲劳。众所周知，史蒂夫·乔布斯(Steve Jobs)每天总是穿着同样的衣服，以避免不得不为穿什么而做文章。关于如何转移注意力的琐碎决定最好留给系统(JAR)。近乎无限的选择可能会让人疲惫不堪。从大局来看，我从事哪种消遣其实并不重要，所以最好还是听天由命，而不是用精力来做决定。有了随机性机器，它就像一个友好的管家，为我做决定。我的日子就像坐过山车一样。方向已经确定，但刺激取决于我的体验。\n当我画了很多不是我现在希望的东西的时候，我会感到有点失望。但后来我提醒自己，这是我以前的自己在创建Lot时希望我做的事情。所以我决定好好享受一下。\n我不知道随机性罐子是否是管理休息和消遣的最佳方式，但几周后，我认为它比没有系统或过于僵化的系统要好，所以我计划继续使用一段时间。", "note_en": "Nir Eyal, the author of “Indesctractible” says that distractions are actions that pull us away from what we plan to do. The opposite of distraction is not focus, it is traction. Anything can be a distraction, just as anything can be traction. If you check your email when you plan to work on a big project, you’re distracted. Conversely, if you plan to play video games, the game is not a distraction. It is traction.\n  Procrastination is when we give into a distraction instead of doing what we plan to do,\n There are many theories on why we procrastinate, and why this unwanted habit is so hard to break.\n In the 1930s psychologists trained rats to do a certain behavior, e.g. pressing a lever, by giving them small rewards. Once trained, the scientists discovered that when the rats were given rewards unpredictably, on a variable ratio schedule of every 3 - 7 times, they would perform the trained behavior more often. More remarkably, with randomized rewards, the behavior became hard to extinguish.\n Getting rewards releases dopamine in the brain, and even the expectation of a reward has this effect.\n Not only rats, but also humans have a desire for randomness. We get excited by unpredictability. Watching sports - who will score/win? Fishing - will I get a catch? Reading news - what has happened (in the last hour)? Listening to radio - what song will they play next? Going to a bar - who will I meet? Shopping - is there a bargain on the sale?\n In this age we are just a mouse click away from randomness. Most of us carry a smartphone everywhere we go, and a big part of the appeal is the excitement finding out what is “new”. For some it is more addictive than sugar and heroin.\n Engaging in randomness itself is not bad, but when we use it to procrastinate it can be hard to stop. Just one more click, scroll, or tab.\n Many of the tasks that we plan to do, like work, studying and chores, don’t have immediate rewards. The benefits of work and studying are in the future, whereas checking Instagram or Facebook hits the reward systems in the brain immediately. Did I get any likes on my post? What stories hide under the bell-icon?\n One popular technique that I and many others use for fighting procrastination is timeboxing a.k.a. The pomodoro Technique. The technique prescribes a 25-minute session work followed by a 5-minute break. There is a strict rule. During the 25-minute work session you must only do one task and do not interrupt yourself e.g. by checking email. No distractions - only traction.\n I am able to be focused during the 25-minute work sessions, but I didn’t have a system for the breaks.\n During my breaks I would often engage in mindless checking the online “slot-machines”. News sites and social media. I admit that I didn&#39;t use a timer for the 5-minute breaks because I have only one timer. As a result I was not so strict about the 5-minutes of the breaks, meaning they could run over a bit.\n I’ve tried media fasting. It was too strict. My rat-brain would too often manage to come up with an excuse for breaking the fasting.\n I needed a better system for the breaks. The whole point (for me) is to get a little diversion. I want to satisfy my urges for (social) media, but in a responsible way.\n I realize that it is not smart to trust myself to take a rational decision in the moment.\n Dan Ariely has found, when researching behavioral economics and irrationality, that most people think of themselves as better versions in the future. “We all think that in the future, we are wonderful people. We will be patient, we will not procrastinate, we will exercise, we will eat well... The problem is we never get to live in that future. We always live in the present.”\n One trick he recommends to overcome present irrationality is to make upfront decisions. For example a way to be nice to your future self is to set up automatic savings for retirement at the beginning of the month rather than waiting until the end of the month when money is tight. Otherwise your “present self” will win over your “future self”.\n So back to the problem of having effective breaks during work. I want some diversion, but not be drawn too deep into a rabbithole of internet. I could have made a strict plan with many rules, but I know myself well enough to know that I would have found excuses to break them.\n Human brains in some ways are not too different from rats. We also crave a dopamine rush. I thought about how I could use the desire for randomness to my benefit?\n   The first prototype: I took a big glass jar and filled it with paper-lots. On each lot I wrote a thing I would reward myself by doing during a break. Facebook, linkedIn, twitter, youtube, pushups, local news, national news, tech news, close browser tabs, brainstorm, … and a handful more. Some of the lots I made more copies of because I’d like to do it several times per day. For example I want to drop into facebook up to 4 times per day, so I made 4 lots with Facebook.\n It is simple to use the “randomness machine”. After completing a 25-minute session of work it is time for a diversion. I get up from my desk and go to the jar to pick one lot at random. Eyes closed - no cheating.\n  First Impressions: It works well (otherwise I wouldn’t have bothered to write this post). Now my breaks are more structured. One meaningful reward, instead of my old habit of a handful of empty rewards selected out of boredom. The scarcity of only one reward per break made me appreciate it more, and more importantly the randomness of drawing a lot created a lot of excitement (pun intended).\n Upgraded the prototype: A few days later I upgraded the prototype. I realized that I don’t need so many rewards during the day. So I added another rule. The first part of the day I dedicate to deep work where I do 8 time-slots of programming. The new rule I made was that during this period I will not use the randomness jar, instead I throw a dice after completing each session. Each side of the dice has assigned an activity or a reward: 1 stretching, 2 yoga-poses, 3  foam roller, 4 thinking, 5 facebook, 6 pick from the jar. A mix between something I should do more often (stretching, foam-rolling) and diversions. After the first 8 time slots are completed, I skip the dice and go right to the goodies in the randomness jar for the rest of the day.\n With the second version of the prototype I still get randomness throughout the day, but it is less distracting.\n  If there is a reward I want to engage in less frequent than daily, I keep the lot under the jar for a few days before putting it back in.\n I have about twice as many lots in the jar as I normally go through so there is no guarantee that I will get to every reward every single day. Which is fine. Twitter can wait.\n After drawing a lot I don’t put it back in, but I have some duplicate or triplicate lots. If I draw the same two times in a row, I allow myself to skip it and draw a new lot.Don’t use it for scheduled social diversions that involve other people.\n  My breaks are better and more fulfilling, and I return to work quicker. I think there is less total procrastination during the day.\n With the randomness machine my excitement gets bigger. I appreciate the diversion much more. Now it actually feels like an earned reward and there is a sense of suspense about which lot I draw.\n Less decision fatigue. Steve Jobs famously always wore the same outfit every day to avoid having to make about what to wear. Trivial decisions on what diversion to engage in is better left to a system (the jar). Near infinite choice can be fatiguing. In the grand scheme of things it doesn&#39;t really matter which diversion I engage in, so better leave it up to chance instead of using energy to make a decision. With the randomness machine, it is like a friendly butler who makes the decisions for me. My days are on a rollercoaster. The direction is set, but the thrills are up to me to experience.\n When I draw a lot that is not the one I hoped for in the moment, I can feel a bit disappointed. But then I remind myself that this is something my former self wanted me to do when I created the lot. So I decide to enjoy it.\n   I don’t know if a randomness jar is the best way to manage breaks and diversions, but after several weeks I think it is superior to having no system or a too rigid system, so I plan to keep using it for a while.", "posttime": "2020-05-10 23:37:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器,machine,奖励", "title": "随机性机器能帮助你对抗拖延症吗？", "title_en": "Could a randomness machine help you fight procrastination?", "transed": 1, "url": "https://excelerity.com/blog/arne/randomness-jar", "via": "", "real_tags": ["机器", "machine", "奖励"]}, {"category": "", "categoryclass": "", "imagename": "4d9be6170332622cc75b40c2cdeb75ea.jpg", "infoid": 1001529, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科学我们最好的选择可能是发送一大群纳米宇宙飞船--由强大的激光从地球上推进--去看一看。\n几个世纪以来，天文学家一直推测太阳系中含有太阳发现的行星，这些行星在遥远的、黑暗的太阳区域内运行。他们不时地发现未知物体的引力效应，迫使他们寻找罪魁祸首。海王星和冥王星都是这样曝光的。\n现在，天文学家手上也有一个类似的谜题。一段时间以来，他们一直在收集证据，证明一定有一颗大质量的行星在大约500个天文单位(700亿公里)的距离绕太阳运行。\n证据来自海王星以外柯伊伯带中冰体的轨道。这些物体似乎以某种方式聚集在一起，只有当它们被某个大质量物体“聚集”时才能解释。\n这个天体--它被称为“九号行星”--一定是地球质量的5到10倍，但由于距离太远，尽管进行了无数次的搜索，但从地球上很难看到它。\n但是，九号行星可能很难被看到还有另一个原因：因为它根本不是一颗行星。相反，天文学家说，一种可能性是，它可能是一个原始黑洞，大爆炸遗留下来的，但被太阳捕获了。\n虽然这个黑洞的质量是地球的5到10倍，但它的直径却很小--大约5厘米。因此，用望远镜观测几乎是不可能的。通过与暗物质的相互作用可以观察到这样一个黑洞的可能性很小，但这并不能保证。所以天文学家们正在绞尽脑汁想出另一种找到它的方法。\n今天，他们有了答案，这要归功于新泽西州普林斯顿高等研究院的物理学家埃德·维滕(Ed Witten)的工作。Witten的想法是寻找这个黑洞必须对附近经过的任何物体施加的引力。因此，他建议向其方向派遣一支纳米太空飞船舰队，然后寻找任何偏离预期轨迹的意想不到的偏差。\n他说：“如果对柯伊伯带的进一步研究加强了九号行星存在的理由，但通过望远镜搜索或暗物质湮灭信号的发现不会随之而来，那么一支微型航天器舰队的直接搜索可能会变得令人信服。”\n威腾并不是第一个想象纳米空间技术潜力的人。不同的科学家和远见卓识的人研究了使用强大的地面激光束来推动微小的芯片航天器走向恒星的想法。\n最大的好处是，这样的航天器不需要携带自己的燃料，而是坐在地球上产生的激光束的尖端。这种激光束可以在很长一段时间内持续加速它们，使它们达到可能是光速的1%或2%的巨大速度。\nWitten说：“为了搜索行星9，人们希望航天器的速度(至少)为每秒数百公里。”他补充说，这样的速度将允许航天器在10年的时间尺度上旅行500AU。\n更重要的是，有可能向行星9发射数百个，甚至可能是数千个纳米空间飞行器。这一点很重要，因为Witten估计，这样的宇宙飞船需要来到距离黑洞几十AU的范围内，才能观察到其轨迹的任何变化。因为天文学家还不知道九号行星可能在哪里，所以唯一的选择就是这种散射枪方法。\n这样的任务将是一个巨大的挑战。Witten指出了之前和正在进行的开发和推出纳米空间技术的项目。最著名的是“突破星空”，这是一项1亿美元的计划，旨在开发和测试能够将激光推进的纳米空间技术发送到附近恒星系统的技术。该项目的目标是“在一代人的时间内为半人马座阿尔法星的飞越任务奠定基础。”\n前往太阳系外缘的任务可能是一个有用的技术演示。英国火箭科学家凯文·帕金(Kevin Parkin)的计算表明，这种任务的成本将与美国国家航空航天局(NASA)多次执行的10亿美元任务的成本相当。\n然而，这种任务的几乎每一个部分都将是一个挑战，从开发能够提供推进力的激光器到设计能够将位置数据转发回地球的芯片。这将要求航天器在以克为单位的有效载荷内携带一个高精度的机载时钟。“在微型宇宙飞船上进行足够精确的计时可能是这个项目的最大障碍，”Witten说。\n但肯定有尝试的动力。对于任何承担这项任务的人来说，发现一个围绕太阳运行的黑洞都将是一份丰厚的奖品。事实上，这可能是发现围绕我们的恒星运行的重要新天体的最后机会。", "note_en": "The Sciences  Our best bet could be to send a swarm of nanospacecraft — propelled from Earth by a powerful laser — to take a look.\n For centuries, astronomers have speculated that the solar system containsundiscovered planets that orbit in the distant, dark reaches of the sun’srealm. From time to time, they have spotted the gravitational effects ofunknown bodies, forcing them to look for the culprit. Both Neptune and Pluto came to light in this way.\n  Now, astronomers have a similar puzzle on their hands. For some time, they have been gathering evidence that a massive planet must be orbiting the sun at a distance of around 500 astronomical units, or 70 billion kilometers.\n The evidence comes from the orbits of icy bodies in the Kuiper Belt beyond Neptune. These objects seem to cluster together in ways that can only be explained if they were being “herded” by some massive object.\n This object — Planet Nine, as it is dubbed — must be between five and 10 times the mass of Earth, but so far away that it is hard to see from Earth, despite numerous ongoing searches.\n But there is another reason why Planet Nine might be hard to see: because it is not a planet at all. Instead, astronomers say one possibility is that it might be a primordial black hole, left over from the Big Bang but captured by the sun.\n Although between five and 10 times more massive than Earth, this black hole would by tiny — about 5 centimeters across. Consequently, it is almost impossible to spot with a telescope. There is a small possibility that such a black hole might be observable through its interaction with dark matter, but that is by no means guaranteed. So astronomers are scratching their heads to come up with another way of finding it.\n Today, they have an answer, thanks to the work of Ed Witten, a physicist at the Institute for Advanced Study in Princeton, New Jersey. Witten’s idea is to look for the gravitational forces this black hole must exert on anything that passes nearby. So he proposes sending a fleet of nanospacecraft in its direction and then looking for any unexpected deviations from the expected trajectory.\n “If further study of the Kuiper Belt strengthens the case for existence of Planet Nine, but discovery via telescopic searches or a dark matter annihilation signal does not follow, then a direct search by a fleet of miniature spacecraft may become compelling,” he says.\n Witten is not the first to imagine the potential of nanospacecraft. Various scientists and visionaries have studied the idea of using powerful ground-based laser beams to propel tiny chip-based spacecraft toward the stars.\n  The big advantage is that such spacecraft needn’t carry their own fuel, but would instead sit on the tip of laser beam generated on Earth. This laser beam could accelerate them continuously for long periods of time, allowing them to reach huge velocities of perhaps 1 or 2 percent the speed of light.\n “To search for Planet Nine, one would like spacecraft velocities of (at least) hundreds of kilometers per second,” says Witten, adding that such speeds would allow a spacecraft to travel 500 AU on a 10-year timescale.\n What’s more, it is possible to launch nanospacecraft by their hundreds, possiblythousands, toward Planet Nine. That’s important, because Witten estimates that such a spacecraft would need to come within a few dozen AU of a black hole for any changes in its trajectory to be observable. And because astronomers don’t yet know exactly where Planet Nine might be, the only option is this scattergun approach.\n Such a mission would be a significant challenge. Witten points to previous and ongoing projects to develop and launch nanospacecraft. The best known is  Breakthrough Starshot, a $100 million initiative to develop and test the technology capable of sending laser-propelled nanospacecraft to nearby star systems. The project’s goal is to “lay the foundations for a flyby mission to Alpha Centauri within a generation.”\n A mission to the outer edges of the solar system might be a useful technology demonstrator.  Calculations by the British rocket scientist Kevin Parkin suggest that the cost of such a mission would be of the same order as the $1 billion missions that NASA has undertaken many times.\n Nevertheless, almost every part of such a mission would be a challenge, from the development of a laser capable of providing propulsion to the design of a chip capable of relaying position data back to Earth. That will require the spacecraft to carry a high-precision onboard clock within a payload measured in grams. “Sufficiently accurate timekeeping in a miniature spacecraft may be the biggest obstacle to this project,” says Witten.\n But there is certainly motivation to try. The discovery of a black hole orbiting the sun would be quite a prize for whoever undertook such a task. Indeed, it may be the last chance to discover a significant new body orbiting our star.", "posttime": "2020-05-10 23:37:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "找到,tiny,可能", "title": "如果九号行星是一个小黑洞，这就是找到它的方法", "title_en": "If Planet Nine Is a Tiny Black Hole, This Is How to Find It", "transed": 1, "url": "https://www.discovermagazine.com/the-sciences/if-planet-9-is-a-black-hole-this-is-how-to-find-it", "via": "", "real_tags": ["找到", "tiny", "可能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001528, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是会议直播！5月10日(星期日)东部时间上午10：30开始。程序。\n托管在GitHub页面上。前情提要：！！CON 2019、2018、2017、2016、2015、2014。这个页面的背景介绍了我们过去的157位演讲者！", "note_en": "This is the conference livestream! It starts on Sunday, May 10 at 10:30am Eastern.  Program.\n  Hosted on  GitHub Pages. Previously: !!Con  2019,  2018,  2017,  2016,  2015,  2014. The background of this page features our  157 past speakers!", "posttime": "2020-05-10 23:36:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,直播,livestream,github", "title": "！！CON 2020直播流[视频]", "title_en": "!!Con 2020 Livestream [video]", "transed": 1, "url": "http://bangbangcon.com/livestream", "via": "", "real_tags": ["2020", "直播", "github"]}]