[{"category": "", "categoryclass": "", "imagename": "7757db6656fcb7e10096b15c777515a4.jpeg", "infoid": 1005117, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从我的GPT-3帖子上的LW评论来看，那里似乎有很多人认为GPT-3的论文很有价值，因为它表明还有更大的模型做得更好的空间。\n(也就是说，重点不是175B的表现，而是从117米到175B的曲线形状，以及对&gt；175B的影响。)。\n在我看来，这种解读似乎是错误的，我在论文中也没有看到多少迹象表明，这就是两位作者试图表达的意思。因此，我在最初的帖子中根本没有讨论进一步的缩放。不过，由于一些人认为这个话题很重要，所以我将结束循环，将我在LW评论中写的一些东西复制到这里：\n如果我认为这篇论文显示了一个明确的趋势，有成长的空间，用更大的模型进行更高性能的少镜头学习，我会对“少镜头+大LM”作为一种方法印象更深。\n我不认为这说明了这一点。关于这个主题，IMO，最清楚的证据是他们附录H中的许多情节。在很大一部分单独的下游任务上，很少有机会的学习有要么。\n具有清晰定义的形状的缩放趋势，到175B点时基本持平，与微调之间的剩余差距似乎不像是要关闭的(示例：WIC、MultiRC、Record、PhysicaQA、OpenBookQA、6个阅读理解任务中的至少5个、安利)。\n一种非常嘈杂的趋势，由于噪声，规模回报可能很大，但也可能接近于零(例如：BoolQ、CB、WSC)。\n在某些下游任务(Copa、ARC、Winogrande，许多MT任务)、本质上以不同方式探索语言建模技能的“较下游”任务(完形填空/补全)以及合成任务上，伸缩趋势更加令人鼓舞。\n平均而言，随着规模的增长有缓慢但稳定增长的趋势(图1.3)，但这掩盖了上面列出的巨大的跨任务差异。少数镜头的缩放图片与LM Loss本身的缩放图片非常不同，在另一篇OpenAI论文中编目的缩放图片非常平滑和可预测，并且(如GPT-3所示)平稳地持续到175B。\n作为变压器是非常通用的原因的证明：不，我们仍然看到任务性能的广泛传播，尽管LM损失平稳增加，一些最明显的缺陷在所有尺度上持续存在(常识物理，参看第5节)，一些非常基本的能力只是在非常大的规模上出现，甚至在那里也是嘈杂的(算术)。\n作为AGI组件：否。由于大多数任务上的少量学习没有显示出明显的人类水平的缩放趋势，因此AGI中的任何转换器角色都需要更有效的方式来查询它们(例如由另一个模块控制的微调)，或者非转换器模型。\n我在LW的评论中没有说过，但在其他地方已经讨论过了，OpenAI预计他们的LM损失的比例法则将在接近GPT-3的比例上崩溃。\n这是因为他们的计算效率训练的缩放法则(模型快速增长，数据缓慢增长)最终预测到，根据他们的缩放法则，在给定的数据集大小下实现最佳性能是可能的更好的性能。\n具体地说，他们对故障点的点估计(在GPT-3论文之前于2020年1月发布)是。\n(注：我不确定我在这里比较的是LIKE TO LIKE，因为我不确定GPT-3是否正好在扩展论文中定义的计算效率边界上，或者差异有什么影响。)。\n简而言之，不仅极少的性能不太可能像LM损失那样扩展，根据OpenAI的说法，LM损失本身可能会在增加约1个数量级后以目前的方式停止扩展。\n我不清楚那时会发生什么，但这似乎会使任何远远超过175B的简单业绩推断变得复杂，即使是对业绩的衡量也是如此(与极少的机会不同！)。否则，我们预计会无限期地扩大规模。", "note_en": "From the LW comments on my GPT-3 post, it looks like a lot of the people there think the GPT-3 paper is valuable because it shows there is room for even  larger models to do better.\n (That is, the point isn’t the performance at 175B, but the shape of the curve as it passes from 117M to 175B, and the implications for &gt;175B.)\n This interpretation seems wrong to me, and I also saw little in the paper to indicate that this is what the  authors are trying to say.  So I didn’t discuss further scaling at all in my original post.  Since some people find that topic important, though, I will close the loop and copy over here some things I wrote in an  LW comment:\n  If I thought the paper shows a clear trend, with room to grow, toward much greater performance few-shot learning with even bigger models, I would be more impressed with “few-shot + large LM” as an approach.\n I don’t think it shows that. The clearest evidence on this subject, IMO, is the many plots in their Appendix H. On a large fraction of the individual downstream tasks, few-shot learning has either\n a scaling trend with a clearly defined shape that is mostly flat by the 175B point, with a remaining gap vs. fine-tuning that seems unlike to be closed (examples: WiC, MultiRC, ReCoRD, PhysicaQA, OpenBookQA, at least 5 of the 6 reading comprehension tasks, ANLI)\n a very noisy trend where, due to noise, returns to scale might be large but might just as well be near zero (examples: BoolQ, CB, WSC)\n The scaling trend is more encouraging on certain downstream tasks (COPA, ARC, Winogrande, many the MT tasks), on “less downstream” tasks that essentially probe language modeling skill in a different way (cloze/completion), and on synthetic tasks.\n On average, there is a trend toward slow but steady growth with scale (Fig 1.3), but this masks the great across-task variance catalogued above. The scaling picture for few-shot is very different from the scaling picture for LM loss itself, which as catalogued in  another OpenAI paper is remarkably smooth and predictable, and which (as GPT-3 shows) continues smoothly to 175B.\n  As a demonstration that transformers are very generic reasoners: no, we still see a wide spread of task performance despite smooth gains in LM loss, with some of the most distinctive deficits persisting at all scales (common sense physics, cf section 5), and some very basic capabilities only emerging at very large scale and noisily even there (arithmetic).\n As an AGI component: no. Because few-shot learning on most tasks shows no clear scaling trend toward human level, any role of transformers in AGI will require more effective ways of querying them (such as fine-tuning controlled by another module), or non-transformer models.\n  Something I didn’t say in the LW comment, but have  discussed elsewhere, is that OpenAI expects their scaling laws for LM loss to break down at a scale somewhere close to GPT-3′s scale.\n This is because their scaling law for compute-efficient training (which grows the model fast and the data slowly) eventually predicts better performance that is possible according to their scaling law for optimal performance at a given dataset size.\n Specifically, their point estimate for the breakdown point (released in Jan 2020, before the GPT-3 paper) is\n     (N.B. I am not confident I am comparing like to like here, as I’m not sure GPT-3 was exactly on the compute-efficient frontier defined in the scaling paper, or what effect the difference has.)\n In short, not only is few-shot performance unlikely to scale nearly as well as LM loss, LM loss itself – according to OpenAI – is likely to stop scaling in the current way after ~1 additional order of magnitude.\n What will happen at that point is unclear to me, but this would seem to complicate any simple extrapolation of performance far beyond 175B, even for measures of performance which (unlike few-shot!) we would otherwise expect to scale indefinitely.", "posttime": "2020-06-04 14:32:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "扩展,scaling,任务", "title": "GPT-3及其扩展趋势", "title_en": "GPT-3 and Scaling Trends", "transed": 1, "url": "https://nostalgebraist.tumblr.com/post/619672884731904000/gpt-3-and-scaling-trends", "via": "", "real_tags": ["扩展", "scaling", "任务"]}, {"category": "", "categoryclass": "", "imagename": "5fafd45587d96617b86469893acc6bcf.jpeg", "infoid": 1005116, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透东京8月23日电-软银集团(SoftBank Group Corp)(9984.T)将推出一只1亿美元的基金，投资于“由有色人种创始人和企业家领导的公司”，这是抗议活动扰乱美国之际的最新企业行动。\n将负责该基金的软银首席运营官马塞洛·克劳尔(Marcelo Claure)周三在给员工的一封信中写道，被描述为软银改善多样性的努力，“我们必须投入资金，制定计划，并追究自己的责任。”\n软银表示，该基金被命名为“机会增长基金”(Opportunity Growth Fund)，专注于美国的非裔美国人和拉美裔美国人，是同类基金中规模最大的。\n克劳尔写道，它将投资于“来自那些在建立和扩大业务方面面临系统性劣势的社区”的企业家。\n软银还运营着1000亿美元的愿景基金(Vision Fund)，该基金由拉吉夫·米斯拉(Rajeev Misra)领导，在世界各地的初创企业中的投资额超过了整个新基金。\n除了领导陷入困境的办公空间初创公司WeWork的重组外，Claure还经营着一只在拉丁美洲投资的基金。他和米斯拉被视为首席执行长孙正义(Masayoshi Son)的潜在继任者。\n“种族主义是一件可悲的事情，”孙正义在推特上写道，他的帖子以#BlacklivesMatter#标签结束。\nClaure在信中写道，总部位于东京的软银也在建立一个“专门的多元化和包容性计划”。\n软银管理层中男性占压倒性多数，该公司计划在本月稍晚的股东大会上提名首位女性董事会董事。\n虽然涵盖了广泛的国籍，但在Vision Fund网站上列出的30名投资者中，只有4名是女性。\n包括软银(SoftBank)等外国公司在内的公司在美国发生数十年来最严重的内乱后发表了公开声明，一名手无寸铁的黑人男子的死亡再次引发了警察对非裔美国人的暴行问题。\n索尼公司(6758.T)本周推迟了即将推出的PlayStation5游戏机的活动，称“我们希望后退一步，让更多重要的声音被听到。”", "note_en": "TOKYO (Reuters) - SoftBank Group Corp (  9984.T) is launching a $100 million fund to invest in “companies led by founders and entrepreneurs of colour”, in the latest corporate action as protests roil the United States.\n  Described as SoftBank’s bid to improve diversity, “we have to put money behind it, set plans, and hold ourselves accountable,” SoftBank’s Chief Operating Officer Marcelo Claure, who will head the fund, wrote in a letter to employees on Wednesday.\n Named the “Opportunity Growth Fund” and focused on African Americans and Latinos in the U.S. it is, SoftBank says, the largest fund of its kind.\n It will invest in entrepreneurs “from communities that face systemic disadvantages in building and scaling their businesses,” Claure wrote.\n SoftBank also runs the $100 billion Vision Fund, which is headed by Rajeev Misra and invests amounts larger than the entire new fund in startups around the world.\n In addition to leading restructuring at floundering office space startup WeWork, Claure runs a fund investing in Latin America. He and Misra are seen as potential successors to Chief Executive Masayoshi Son.\n “Racism is a lamentable thing,” Son wrote on Twitter, ending his post with the hashtag #blacklivesmatter.\n Claure wrote in his letter that Tokyo-headquartered SoftBank was also establishing a “dedicated diversity and inclusion program”.\n SoftBank’s management is overwhelmingly male, with the company planning to nominate its first female board director at a shareholder meeting later this month.\n While spanning a wide range of nationalities, only four of 30 investors listed on Vision Fund’s website are female.\n Companies including foreign firms like SoftBank have made public statements following the worst U.S. civil unrest in decades as the death of an unarmed black man reignites the issue of police brutality against African Americans.\n Sony Corp (  6758.T) this week pushed back an event for its upcoming PlayStation 5 console, saying “we want to stand back and allow more important voices to be heard.”", "posttime": "2020-06-04 14:31:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "启动,startup,软银", "title": "软银推出1亿美元少数族裔启动基金", "title_en": "SoftBank launches $100m minorities startup fund", "transed": 1, "url": "https://www.reuters.com/article/us-softbank-group-investments/softbank-launches-100-million-fund-investing-in-people-of-color-idUSKBN23A1RK", "via": "", "real_tags": ["启动", "startup", "软银"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005115, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦大学学院的神经学家卡尔·弗里斯顿建立了人脑功能的数学模型。最近，他将自己的模型应用到新冠肺炎身上，并用他所学到的知识为独立圣人提供建议，独立圣人委员会是作为英国政府官方流行病建议机构-紧急情况科学咨询小组(SAGE)的替代机构而成立的。\n您使用的模型与流行病学家在这场大流行中为政府提供建议所依赖的传统模型有何不同？传统模型基本上将曲线拟合到历史数据，然后将这些曲线外推到未来。他们观察现象的表面--可观察的部分，或数据。我们的方法借鉴了物理学，特别是理查德·费曼(Richard Feynman)的工作，但我们的方法是在引擎盖下进行的。它试图捕捉这一现象的数学结构-在这种情况下，就是大流行-并理解所观察到的原因。因为我们不知道所有的原因，所以我们必须推断它们。但这种推论，以及隐含的不确定性，都是建立在模型中的。这就是为什么我们称它们为生成性模型，因为它们包含了生成数据所需知道的所有内容。随着更多的数据进入，你可以调整你对原因的看法，直到你的模型尽可能准确和简单地模拟数据。\n关于新冠肺炎，你能举一个例子说明你所说的不确定性是什么意思吗，以及你是如何将不确定性融入你的模型中的？今天使用的一种常见的流行病学模型是SEIR模型，该模型认为人们必须处于四种状态之一--易感(S)、暴露(E)、感染(I)或康复(R)。不幸的是，现实并没有如此整齐地将它们分解。例如，被找回意味着什么？我们知道新冠肺炎是可以感染的，但是没有症状，那么是指从症状中恢复还是从感染中恢复？这个问题隐藏了许多其他问题，包括与国家测试战略有关的问题。当你思考数据的根本原因时，SEIR模型就会开始分崩离析。你需要能够考虑所有可能状态的模型，并评估哪些状态对随着时间的推移塑造大流行的轨迹具有重要意义。\n这是产生性方法首次应用于大流行。它在其他领域证明了自己吗？这些技术自从脱离物理学以来取得了巨大的成功。他们已经运行你的iPhone和核电站很长时间了。在我的神经生物学领域，我们称这种方法为动态因果模型(DCM)。我们不能直接看到大脑状态，但是我们可以给出大脑成像数据来推断它们。事实上，我们已经将这个想法推得更远了。我们认为大脑可能在进行自己的动态因果建模，减少了它对感官提供给它的数据原因的不确定性。我们称之为自由能原理。但是，无论你谈论的是流行病还是大脑，根本问题都是一样的--你试图理解一个随时间变化的复杂系统。从这个意义上说，我并没有做什么新鲜事。这些数据是由新冠肺炎患者而不是神经元产生的，但除此之外，这只是办公室里的又一天。\n你说生成性模型也比传统模型更有效率。你是什么意思？流行病学家目前通过利用高性能计算机进行大规模的数字运算来解决推断问题。想象一下，您想要模拟苏格兰的一场疫情。使用传统方法，这将花费您一天或更长时间来使用今天的计算资源。这只是模拟一个模型或假设--一组参数和一组起始条件。使用DCM，您可以立即执行相同的操作。这让你可以快速、轻松地给不同的假设打分，从而更快地找到最好的假设。\n还有其他优势吗？是。对于传统的SEIR模型，干预和监测是您添加到模型中的东西-微调或扰动-以便您可以看到它们对发病率和死亡率的影响。但是，在生成性模型中，这些东西与其他重要的东西一起被构建到模型本身中。我们作为个人--以及作为一个社会--的反应，成为流行病学过程的一部分，成为一个大型的自我组织、自我监测系统的一部分。这意味着不仅可以预测未来的病例和死亡人数，还可以预测社会和机构的反应-并为这些预测附加准确的日期。\n你的预测在第一波感染中得到了多大程度的证实？至于伦敦，我们预计4月5日入院人数将达到高峰，死亡人数将在5天后达到高峰，重症监护病房的占用率不会超过容量-这意味着将不需要南丁格尔医院。我们还预测，到5月8日，首都的情况将有所改善，这可能会放松社会疏远措施-他们正在\n你的模型对第二波的风险有什么看法？这些模型支持这样的观点，即未来几周发生的事情不会在触发反弹方面产生太大影响-因为人口在一定程度上受到第一波期间获得的免疫力的保护。真正令人担忧的是，当这种豁免权消失时，第二波浪潮可能会在几个月后爆发。我们可以测试一系列假设，基于非常短的免疫期-就像普通感冒一样-直到持续数十年的免疫权。对于每个持续时间，我们都可以计算出第二波出现的概率和出现的时间。这项工作现在还为时尚早，我怀着真正的兴奋期待着新的免疫力数据的出现，因为现在有了可靠的抗体测试。但重要的信息是，我们现在有一个机会之窗，可以在假定的第二波之前制定好测试和跟踪协议。如果这些都得到了一致的实施，我们可能会将这波浪潮推迟到可以获得治疗或疫苗的时间范围之外，这是我们在第一次之前无法做到的。\n一旦大流行结束，你能用你的模型来询问哪个国家的反应最好吗？这已经在发生了，作为我们试图理解数据潜在原因的一部分。我们一直在比较英国和德国，试图解释德国相对较低的死亡率。答案有时是违反直觉的。例如，看起来德国的低死亡率似乎不是因为他们优越的检测能力，而是因为普通德国人比普通英国人更不可能感染和死亡。为什么？有各种可能的解释，但看起来越来越有可能的一种解释是，德国有更多的免疫性“暗物质”--不受感染的人，可能是因为他们地理上与世隔绝，或者有某种天然的抵抗力。这就像宇宙中的暗物质：我们看不见它，但我们知道它一定存在，以解释我们所能看到的东西。知道它的存在对我们为任何第二波做准备都是有用的，因为这表明对那些接触新冠肺炎的高危人群进行有针对性的测试可能比对整个人群进行非选择性测试更好。\n生成性模型是疾病建模的未来吗？这是流行病学家的问题--他们是专家。但是，考虑到费曼的思想在许多其他学科中产生的影响，如果流行病学界中至少有一部分人在未来没有更多地致力于这种方法，我会感到非常惊讶。\n最后，“连线”杂志的采访称，你喜欢抽烟，中午之前不要和任何人说话，没有手机，也不喜欢一对一的会议。这些东西在封锁期间有变化吗？恐怕不行。诚然，这可以被认为是一对一的会议，但我的默认模式是在一个小组中分享想法-独立智者风格-正常的服务很快就会恢复。就在我和你讲话之前，我谢绝了在早间电台演讲的邀请，现在我要去抽烟了。", "note_en": "Neuroscientist  Karl Friston, of University College London, builds mathematical models of human brain function. Lately, he’s been applying his modelling to Covid-19, and using what he learns to advise  Independent Sage, the committee set up as an alternative to the UK government’s official pandemic advice body, the Scientific Advisory Group for Emergencies (Sage).\n How do the models you use differ from the conventional ones epidemiologists  rely  on to advise governments in this pandemic? Conventional models essentially fit curves to historical data and then extrapolate those curves into the future. They look at the surface of the phenomenon – the observable part, or data. Our approach, which borrows from physics and in particular the work of  Richard Feynman, goes under the bonnet. It attempts to capture the mathematical structure of the phenomenon – in this case, the pandemic – and to understand the causes of what is observed. Since we don’t know all the causes, we have to infer them. But that inference, and implicit uncertainty, is built into the models. That’s why we call them generative models, because they contain everything you need to know to generate the data. As more data comes in, you adjust your beliefs about the causes, until your model simulates the data as accurately and as simply as possible.\n Can you give an example of what you mean by uncertainty, with respect to Covid-19, and how you build it into your models? A common type of epidemiological model used today is the SEIR model, which considers that people must be in one of four states – susceptible (S), exposed (E), infected (I) or recovered (R). Unfortunately, reality doesn’t break them down so neatly. For example, what does it mean to be recovered? We know that with Covid-19 you can be infected but asymptomatic, so does it mean recovered from the symptoms or recovered from the infection? And that question hides a host of others, including questions relating to national testing strategies. SEIR models start to fall apart when you think about the underlying causes of the data. You need models that can allow for all possible states, and assess which ones matter for shaping the pandemic’s trajectory over time.\n This is the first time the generative approach has been applied to a pandemic . Has it proved itself in other domains? These techniques have enjoyed enormous success ever since they moved out of physics. They’ve been running your iPhone and nuclear power stations for a long time. In my field, neurobiology, we call the approach dynamic causal modelling (DCM). We can’t see brain states directly, but we can infer them given brain imaging data. In fact, we have pushed that idea even further. We think the brain may be doing its own dynamic causal modelling, reducing its uncertainty about the causes of the data the senses feed to it. We call this the  free energy principle. But whether you’re talking about a pandemic or a brain,  the essential problem is the same – you’re trying to understand a complex system that changes over time. In that sense, I’m not doing anything new. The data is generated by Covid-19 patients rather than neurons, but otherwise it’s just another day at the office.\n You say generative models are also more efficient than conventional ones. What do you mean? Epidemiologists currently tackle the inference problem by number-crunching on a huge scale, making use of high-performance computers. Imagine you want to simulate an outbreak in Scotland. Using conventional approaches, this would take you a day or longer with today’s computing resources. And that’s just to simulate one model or hypothesis – one set of parameters and one set of starting conditions. Using DCM, you can do the same thing in a minute. That allows you to score different hypotheses quickly and easily, and so to home in sooner on the best one.\n Any other advantages? Yes. With conventional SEIR models, interventions and surveillance are something you add to the model – tweaks or perturbations – so that you can see their effect on morbidity and mortality. But with a generative model these things are built into the model itself, along with everything else that matters. Our response as individuals – and as a society – becomes part of the epidemiological process, part of one big self-organising, self-monitoring system. That means it is possible to predict not only numbers of cases and deaths in the future, but also societal and institutional responses – and to attach precise dates to those predictions.\n How well have your predictions been borne out  in this first wave of infections? For London, we  predicted that hospital admissions would peak on 5 April, deaths would peak five days later, and critical care unit occupancy would not exceed capacity – meaning the  Nightingale hospitals would not be required. We also predicted that improvements would be seen in the capital by 8 May that might allow social distancing measures to be relaxed – which they were in the prime minister’s announcement on 10 May. To date our predictions have been accurate to within a day or two, so there is a predictive validity to our models that the conventional ones lack.\n What is your role with Independent Sage ? I’m a member with special responsibility for modelling. When they first approached me I didn’t see the “Independent”… I’m joking, but only partly. I think of Independent Sage as the ultimate exercise in public engagement; what it would look like if you and I and everyone else were able to sit in on a real Sage meeting. I’ve heard defensive politicians say its very existence impugns the real Sage, but as a scientist I can’t subscribe to that. In my view there can never be anything wrong with transparent, informed discussion. The committee’s other, equally important, role is to present the UK government with alternative hypotheses – to give it more room for manoeuvre.\n What do your models say about the risk of a second wave? The models support the idea that what happens in the next few weeks is not going to have a great impact in terms of triggering a rebound – because the population is protected to some extent by immunity acquired during the first wave. The real worry is that a second wave could erupt some months down the line when that immunity wears off. We can test a range of hypotheses, based on a very short duration of immunity – as with a common cold – right through to immunity that lasts for decades. For each duration we can calculate the probability that a second wave will emerge, and when. It’s early days for this work, and I look forward with genuine excitement to new data on immunity becoming available, now that reliable antibody  tests exist. But the important message is that we have a window of opportunity now, to get test-and-trace protocols in place ahead of that putative second wave. If these are implemented coherently, we could potentially defer that wave beyond a time horizon where treatments or a vaccine become available, in a way that we weren’t able to before the first one.\n Once the pandemic is over, will you be able to use your models to ask which country’s response was best? That is already happening, as part of our attempts to understand the latent causes of the data. We’ve been comparing the UK and Germany to try to explain the comparatively low fatality rates in Germany. The answers are sometimes counterintuitive. For example, it looks as if the low German fatality rate is not due to their superior testing capacity, but rather to the fact that the average German is less likely to get infected and die than the average Brit. Why? There are various possible explanations, but one that looks increasingly likely is that Germany has more immunological “dark matter” – people who are impervious to infection, perhaps because they are geographically isolated or have some kind of natural resistance. This is like dark matter in the universe: we can’t see it, but we know it must be there to account for what we can see. Knowing it exists is useful for our preparations for any second wave, because it suggests that targeted testing of those at high risk of exposure to Covid-19 might be a better approach than non-selective testing of the whole population.\n Are generative models the future of disease modelling? That’s a question for the epidemiologists – they’re the experts. But I would be very surprised if at least some part of the epidemiological community didn’t become more committed to this approach in future, given the impact that Feynman’s ideas have had in so many other disciplines.\n Finally, a    Wired   interview says  you like to smoke, don’t speak to anyone before midday, do not own a mobile phone and deplore one-on-one meetings. Ha s any of th at changed during lockdown? I’m afraid not. It’s true that this could be considered a one-on-one meeting, but my default mode is sharing ideas in a group – Independent Sage-style – and normal service will resume shortly. Just before I spoke to you I declined an invitation to speak on morning radio, and now I’m off for a cigarette.", "posttime": "2020-06-04 14:31:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "暗物质,immunological,模型", "title": "德国可能有更多免疫“暗物质”--世界新闻--卫报", "title_en": "Germany may have more immunological “dark matter” – World news – The Guardian", "transed": 1, "url": "https://www.theguardian.com/world/2020/may/31/covid-19-expert-karl-friston-germany-may-have-more-immunological-dark-matter", "via": "", "real_tags": ["暗物质", "模型"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005114, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳跃导航跳跃搜索在工程上，太赫兹间隙是无线电波和红外光之间电磁频谱中太赫兹频段的一个频带，对此还没有实用的产生和检测辐射的技术。它被定义为0.1到10兆太赫兹(波长为3微米到30微米)。目前，在这个频率范围内，有用的发电和接收技术是低效和不可行的。\n在这个范围内大量生产器件和在室温(能量k·T等于频率为6.2THz的光子的能量)下工作大多是不切实际的。这在无线电频谱最高频率的成熟微波技术和最低频率的成熟红外探测器光学工程之间留下了差距。这种辐射主要用于小规模的专业应用，如亚毫米天文学。自20世纪末以来，一直在进行试图解决这一问题的研究。[1][2][3][4][5]。\n大多数用于微波产生的真空电子器件都可以改装成工作在太赫兹频率，包括磁控管、回旋管、同步加速器和自由电子激光器。[9]类似地，诸如隧道二极管之类的微波探测器也已被重新设计，以检测太赫兹和红外[11]频率。然而，这些设备中的许多都是原型，不是紧凑型的，或者存在于大学或政府的研究实验室，没有从大规模生产中节省成本的好处。\n正在进行的调查改进了发射器(源)和探测器，并加强了这一领域的研究。然而，缺点仍然存在，包括发射器的大小、不兼容的频率范围和不希望的工作温度，以及介于固态电子学和光子技术之间的组件、设备和探测器要求。[12][13][14]。\n自由电子激光器可以通过太赫兹辐射到X射线，从微波产生大范围的电磁辐射受激辐射。但是，它们体积庞大、价格昂贵，不适合需要关键定时的应用(如无线通信)。其他正在积极研究的太赫兹辐射源包括固态振荡器(通过倍频)、后向波振荡器(BWO)、量子级联激光器和回旋管。\n^Gharavi，Sam；Heydari，Babak(2011年9月25日)。超高速CMOS电路：100 GHz以上(第一版)。纽约：施普林格科学+商业媒体。第1-5页(导言)和100页。电话：10.1007-978-1-4614-0305-0。ISBN电话：978-1-4614-0305-0。\n^Sirtori，Carlo(2002)。太赫兹带隙电桥(免费PDF下载)。大自然。应用物理学。417(6885)：132-133。密码：2002Natur.417..132S。DOI：10.1038/417132b。PMID为12000945。\n^Borak，A.(2005)。利用硅基激光器弥合太赫兹鸿沟(免费PDF下载)。科学。应用物理学。308(5722)：638-639。DOI：10.1126/Science.1109831.。PMID为15860612。\n卡尔波维奇，尼古拉斯；戴建明；陆晓飞；陈云青；山口正志；赵宏伟；等。(2008年)。覆盖整个太赫兹间隙的相干外差时域光谱。应用物理通讯(摘要)。92(1)：011131。密码：2008ApPhL.92a1131K。10.1063/1.2828709。\n^Kleiner，R.(2007)。填补了太赫兹的缺口。科学(摘要)。318(5854)：1254-1255.。DOI：10.1126/Science.115，第1373.。PMID为18033873。\n安德烈斯·拉拉扎；大卫·M·沃尔夫；杰弗里·K·卡特林(2013年5月21日)。太赫兹(THz)反向磁控管。达德利·诺克斯图书馆。加利福尼亚州蒙特利：海军研究生院。美国专利8,446,096 B1.。[需要完整的引文]。\n^Glyavin，Mikhail；Denisov，Grigory；Zapvalov，V.E.；Kuftin，A.N.。(2014年8月)。太赫兹回旋管：技术现状与前景。通信技术与电子学杂志。59(8)：792-797。网址：10.1134/S1064226914080075-通过Research gate.net。\n^Evain，C.；Szwaj，C.；Roussel，E.；Rodriguez，J.；Le Parquier，M.；Tordeux，M.；Ribeiro，F.；Labat，M.；Hubert，N.；Brubach，J.-B.；Roy，P.；Bielawski，S.(2019年4月8日)。来自受控相对论电子束的稳定相干太赫兹同步辐射。自然物理学。15(7)：635-639。Arxiv：1810.11805。电话：10.1038/s4156701904886.。\nUCSB自由电子激光源。www.mrl.ucsb.edu。太赫兹设备。加州大学圣巴巴拉分校。[需要完整的引文]。\n^&#34；[没有引用标题]&#34；。ECS交易(摘要)。电化学学会。49(1秒？)：93秒？2012年-通过IOP Science。[需要完整的引文]。\n保罗·戴维斯(2016年7月1日)。红外纳米天线耦合MOS二极管中的隧道整流。科技信息办公室。Meta 16.OSTI.gov.。西班牙马拉加：美国能源部。[需要完整的引文]\n弗格森，布拉德利；张锡成(2002)。太赫兹科学技术材料(免费PDF下载)。自然材料。1(1)：26-33。密码：2002NatMa.1.26f.。DOI：10.1038/nmat708.。PMID为12618844。\n^Tonouchi，Masayoshi(2007)。尖端太赫兹技术(免费PDF下载)。自然光子学。1(2)：97-105。密码：2007NaPho.1.97T。DOI：10.1038/nphoon.2007.3.。200902219783121992。\n陈厚棠；Padilla，Willie J.；Cich，Michael J.；Azad，Abl K.；Averitt，Richard D.；Taylor，Antoinette J.(2009)。超材料固态太赫兹相位调制器(免费PDF下载)。自然光子学。3(3)：148。密码：2009NaPho.3..148C。CiteSeerX：10.1.1.423.5531.。DOI：10.1038/nphoon.2009.3.。\n书名/作者声明/作者：by J.。(2000年6月)。太赫兹源和系统。北约高级研究会。北约科学系列II。27。法国博纳斯堡(2001年出版)。ISBN电话：978-0-7923-7096-3。LCCN上涨2001038180。oclc：248547276-通过谷歌图书。\n迈克·库克(2007)。用新的应用程序填补太赫兹的空白(PDF)。今日半导体。2(1)。第39-43页。\n珍妮特，雷-杜普雷(2011年11月8日)。生物成像、传感技术中的旧电子焕发出新的生机。SLAC国家加速器实验室(新闻稿)。加利福尼亚州帕洛阿尔托：斯坦福大学。.=‘class1’&gt;研究人员已经成功地在电磁频谱中一个基本上未被开发的部分--所谓的太赫兹间隙--产生了强烈的光脉冲.", "note_en": "Jump to navigation  Jump to search  In engineering, the  terahertz gap is a  frequency band in the  terahertz region of the  electromagnetic spectrum between  radio waves and  infrared light for which practical technologies for generating and detecting the radiation do not exist. It is defined as 0.1 to 10 THz ( wavelengths of 3 mm to 30 µm). Currently, at frequencies within this range, useful power generation and receiver technologies are inefficient and unfeasible.\n Mass production of devices in this range and operation at  room temperature (at which energy   k·T is equal to the  energy of a photon with a frequency of 6.2 THz) are mostly impractical. This leaves a gap between mature  microwave technologies in the highest frequencies of the  radio spectrum and the well developed  optical engineering of  infrared detectors in their lowest frequencies. This radiation is mostly used in small-scale, specialized applications such as  submillimetre astronomy.  Research that attempts to resolve this issue has been conducted since the late 20th century.  [1]  [2]  [3]  [4]  [5]\n  Most vacuum electronic devices that are used for microwave generation can be modified to operate at terahertz frequencies, including the magnetron,   [6] gyrotron,  [7] synchrotron,  [8] and free electron laser.  [9] Similarly, microwave detectors such as the  tunnel diode have been re-engineered to detect at terahertz  [10] and infrared  [11] frequencies as well. However, many of these devices are in prototype form, are not compact, or exist at university or government research labs, without the benefit of cost savings due to mass production.\n  Ongoing investigation has resulted in  improved emitters (sources) and  detectors, and research in this area has intensified. However, drawbacks remain that include the substantial size of emitters, incompatible frequency ranges, and undesirable operating temperatures, as well as component, device, and detector requirements that are somewhere between  solid state electronics and  photonic technologies.  [12]  [13]  [14]\n Free-electron lasers can generate a wide range of  stimulated emission of electromagnetic radiation from microwaves, through terahertz radiation to  X-ray. However, they are bulky, expensive and not suitable for applications that require critical timing (such as  wireless communications). Other  sources of terahertz radiation which are actively being researched include solid state oscillators (through  frequency multiplication),  backward wave oscillators (BWOs),  quantum cascade lasers, and  gyrotrons.\n  ^   Gharavi, Sam; Heydari, Babak (25 September 2011).   Ultra High-Speed CMOS Circuits: Beyond 100 GHz (1st ed.). New York: Springer Science+Business Media. pp. 1–5 (Introduction) and 100.  doi: 10.1007/978-1-4614-0305-0.  ISBN   978-1-4614-0305-0.\n ^   Sirtori, Carlo (2002).  &#34;Bridge for the terahertz gap&#34;  (Free PDF download).  Nature. Applied physics.  417 (6885): 132–133.  Bibcode: 2002Natur.417..132S.  doi: 10.1038/417132b.  PMID  12000945.\n ^   Borak, A. (2005).  &#34;Toward bridging the terahertz gap with silicon-based lasers&#34;  (Free PDF download).  Science. Applied physics.  308 (5722): 638–639.  doi: 10.1126/science.1109831.  PMID  15860612.\n ^   Karpowicz, Nicholas; Dai, Jianming; Lu, Xiaofei; Chen, Yunqing; Yamaguchi, Masashi; Zhao, Hongwei; et al. (2008). &#34;Coherent heterodyne time-domain spectrometry covering the entire  terahertz gap&#34;.  Applied Physics Letters (Abstract).  92 (1): 011131.  Bibcode: 2008ApPhL..92a1131K.  doi: 10.1063/1.2828709.\n ^   Kleiner, R. (2007). &#34;Filling the terahertz gap&#34;.  Science (Abstract).  318 (5854): 1254–1255.  doi: 10.1126/science.1151373.  PMID  18033873.\n ^   Larraza, Andres; Wolfe, David M.; Catterlin, Jeffrey K. (21 May 2013).  &#34;Terahertz (THZ) reverse magnetron&#34;. Dudley Knox Library. Monterey, California: Naval Postgraduate School. US Patent 8,446,096 B1.   [   full citation needed]\n ^   Glyavin, Mikhail; Denisov, Grigory; Zapevalov, V.E.; Kuftin, A.N. (August 2014).  &#34;Terahertz gyrotrons: State of the art and prospects&#34;.  Journal of Communications Technology and Electronics.  59 (8): 792–797.  doi: 10.1134/S1064226914080075  – via researchgate.net.\n ^   Evain, C.; Szwaj, C.; Roussel, E.; Rodriguez, J.; Le Parquier, M.; Tordeux, M.-A.; Ribeiro, F.; Labat, M.; Hubert, N.; Brubach, J.-B.; Roy, P.; Bielawski, S. (8 April 2019). &#34;Stable coherent terahertz synchrotron radiation from controlled relativistic electron bunches&#34;.  Nature Physics.  15 (7): 635–639.  arXiv:  1810.11805.  doi: 10.1038/s41567-019-0488-6.\n ^    &#34;UCSB free electron laser source&#34;.  www.mrl.ucsb.edu. Terahertz facility. University of California – Santa Barbara.   [   full citation needed]\n ^    &#34;[no title cited]&#34;.  ECS Transactions (abstract). The Electrochemical Society.  49 (1 ?): 93 ?. 2012  – via IOP Science.   [   full citation needed]\n ^   Davids, Paul (1 July 2016).   Tunneling rectification in an infrared nanoantenna coupled MOS diode. Office of Scientific and Technical Information. Meta 16.  osti.gov. Malaga, Spain: U.S. Department of Energy.   [   full citation needed]\n ^   Ferguson, Bradley; Zhang, Xi-Cheng (2002).  &#34;Materials for terahertz science and technology&#34;  (free PDF download).  Nature Materials.  1 (1): 26–33.  Bibcode: 2002NatMa...1...26F.  doi: 10.1038/nmat708.  PMID  12618844.\n ^   Tonouchi, Masayoshi (2007).  &#34;Cutting-edge terahertz technology&#34;  (free PDF download).  Nature Photonics.  1 (2): 97–105.  Bibcode: 2007NaPho...1...97T.  doi: 10.1038/nphoton.2007.3. 200902219783121992.\n ^   Chen, Hou-Tong; Padilla, Willie J.; Cich, Michael J.; Azad, Abul K.; Averitt, Richard D.; Taylor, Antoinette J. (2009).  &#34;A metamaterial solid-state terahertz phase modulator&#34;  (free PDF download).  Nature Photonics.  3 (3): 148.  Bibcode: 2009NaPho...3..148C.  CiteSeerX   10.1.1.423.5531.  doi: 10.1038/nphoton.2009.3.\n  Miles, Robert E; Harrison, Paul; Lippens, D., eds. (June 2000).   Terahertz Sources and Systems. NATO Advanced Research Workshop. NATO Science Series II.  27. Château de Bonas, France (published 2001).  ISBN   978-0-7923-7096-3.  LCCN  2001038180.  OCLC  248547276 – via Google Books.\n   Cooke, Mike (2007).  &#34;Filling the THz gap with new applications&#34;  (PDF).  Semiconductor Today.  2 (1). pp. 39–43 .\n Janet, Rae-Dupree (8 November 2011).  &#34;New life for old electrons in biological imaging, sensing technologies&#34;. SLAC National Accelerator Laboratory (Press release). Palo Alto, California: Stanford University.  ... researchers have successfully generated intense pulses of light in a largely untapped part of the electromagnetic spectrum – the so-called  terahertz gap.", "posttime": "2020-06-04 14:31:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "赫兹,terahertz", "title": "太赫兹带隙", "title_en": "Terahertz Gap", "transed": 1, "url": "https://en.wikipedia.org/wiki/Terahertz_gap", "via": "", "real_tags": ["赫兹", "terahertz"]}, {"category": "", "categoryclass": "", "imagename": "221a584823befc302ef4d08c1acda2f2.jpeg", "infoid": 1005113, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特斯拉有一些关于自动驾驶的坏消息(我有一个，我个人认为功能需要重新命名)。由于司机睡着了，已经发生了多起撞车事故。那是自动驾驶仪的错吗？我会说司机应该知道不要在405号高速公路上打盹(我用的是自动驾驶仪，相信我，我睡不着)。那么，我们是一起移除自动驾驶系统，还是学会正确使用它呢？\n我们在软件架构方面处于相同的位置。人们欣然接受时髦的词汇和新的想法，好像他们可以解决一切问题。最近，这已经集中在微服务的使用和打破念珠菌的问题上。关于这一点，已经有了一些有趣的对话。如果你还没有看过，这是我指的其中一个对话。\n前几天，一位非常体贴的同事让我注意到了这些(部分是为了通知我，部分是为了骚扰我)，我认为它们提出了一些非常有趣和有道理的观点。要真正理解这会带来什么帮助或伤害，我们不仅需要指出坏处，还需要为好的方面提供指导。让我们逐个来看看这些。\n巨石就是未来，因为人们试图用微服务解决的问题并不真正符合现实。--凯尔西·海托华。\n我相信这是百分之百正确的。“微服务”这个词已经被用作灵丹妙药，可以修复从功能失调的组织到设计糟糕的系统的各种问题。但是，我不认为另一种选择是回到“巨石”(队列不祥的音乐)。\n我们正在处理期望与现实的范式。其中大部分可以归结为以下几点之一：\n您可能在“Head First Design Pattern”一书中找不到这一点。\n现在的代码库太糟糕了，你说“你知道我们应该怎么做吗？我们应该分手。我们会把它拆散，以某种方式找到我们从一开始就没有的工程学科。“。然后他们最终要做的是创建50个可部署的，但这实际上是一个分布式的巨石。--凯尔西·海托华\n不幸的是，这太常见了。随着“神奇药丸”的出现，人们陷入了一种心态，即越小越快，反过来也越好。微服务不会修复一个坏的巨石。如果你做的千层面不好，不管你把它切成多少块，它仍然是不好的。\n1.您正在复制另一个数据库…中的表(信息)，而没有将数据转换为新的数据(添加信息。\n2.服务X在没有Y或Z的情况下无法工作，并且/或者您没有如何处理其中一个宕机的策略。\n2.5奖金，很可能没有办法有意义地与服务脱钩。服务X可以“容忍”服务Y的故障，但如果没有服务Y，它将无法运行。\n3.通过事件总线推送所有数据，以保持服务与…“同步”\nRuyn00bie(我喜欢这个名字)一语中的。这些都是在设计阶段必须考虑的因素。相互依赖的服务需要1)组合在微服务中2)使用队列模式以确保服务可以处理项目(当可用时)3)两个系统都可以坐在微协调器后面来处理错误情况。\n事件总线是微服务基础设施的重要组成部分。但是，我认为它们应该只接受通知，而不是数据同步。\n如果您从一个整体迁移到微服务，您必须将其作为重新评估和更新的机会。如果您处于这个决策点，那么很有可能您正在谈论的是一个已经存在了一段时间的系统。您不能将此视为剪切和粘贴编码练习，您必须回到第一步。\n你需要对巨石有深入的了解。对你来说，这可能意味着你需要研究和理解你不熟悉的方面。您需要将其视为一组独立的子系统，而不是由较小部分组成的一个大系统。\n这可能看起来并不重要，但你看待它的方式会产生巨大的影响。这个观点将决定你将会遇到的每一个决定。\n例如，假设您有一个单一的应用程序，它是一个电子商务平台。你已经决定打破巨石了。您有几个选项：\n越小越好-找到应用程序中的逻辑分割点，使用它们创建紧密绑定在一起的较小应用程序。部署这些并宣布胜利，您就是微服务大师！\n越小越聪明-花点时间发掘一下独石的核心功能。请考虑这些是独立于生态系统的独立端到端应用程序。尝试扩展其处理更多用例的能力。部署无状态应用程序。\n因此，在我们的示例中，我们可能会将事物分解为多个较小的部分，如购物车、产品、订单等。在这两种情况下，我们可能选择相同的分割点，但我们构建的内容将非常不同。在一种情况下，我们会将服务分开，但它们之间会存在紧密耦合。在第二个场景中，我们希望为每一个都创建一套完整的功能。\n我是否可以将此微服务放在另一个架构中，而无需对其进行更改，并充分利用其所有功能？ - 是一名自我反思型工程师。\n如果你的回答是肯定的，那么你一开始的观点是正确的。如果没有，则说明耦合太多，请重新开始。\n很多东西都遵循微服务模式，比如你的车。你的车是由多个较小的部件组成的。其中一些组件，比如您的刹车，可以在您的汽车之外的其他汽车上使用(比如完全独立的微服务)。其他组件，如挡风玻璃，特定于您的品牌和型号(如相互依赖的微服务组件)。\n这是一个仔细的平衡，需要计划才能适当地实施。就像任何好的架构一样，它永远不是固定的，并且会随着时间的推移而发展。\n在架构图上单击SAVE的那一秒，它就已经是无效的 - A Wise Architect。\n一个好的微服务解决方案首先要认识到，您要么是因为想要做出改变，要么是因为需要做出改变。如果需要的话，认清原因，避免像瘟疫这样的根本原因。", "note_en": "Tesla has had some bad press around auto-pilot  (I have one and I personally think that functionality needs to be renamed). Multiple crashes have happened due to the driver falling asleep. Is that auto-pilots fault?  I would say the driver should know not to nap on the 405 freeway ( I use my auto-pilot, trust me, I couldn’t sleep with it). So, do we remove auto-pilot all together or do we learn to use it properly?\n We are in the same position in software architecture. People jump on buzz words and new ideas as if they will fix everything. Lately this has been centered around the use of microservices and breaking up moniliths. There have been interesting conversations about this. In case you have not seen it, this is one of the conversations I am referring to.\n    A very considerate co-worker brought these to my attention ( partly to inform me and partly to harass me) the other day and I think they make some very interesting and valid points. To really understand how this can help or harm we need to not just point out the bad but instruct for the good. Let&#39;s look at each of these.\n  Monoliths are the future because the problem people are trying to solve with  microservices doesn’t really line up with reality. —  KELSEY HIGHTOWER\n I believe that this is 100% true. The word “Microservice” has been used as a magic pill to fix everything from a dysfunctional organization to a badly engineered system. But, I don’t think that the alternative is to go back to “The Monolith” ( Queue ominous music).\n We are dealing with the expectation versus reality paradigm. Most of this can be boiled down to one of these:\n  You might not find this one in your “Head First Design Patterns” book.\n Now the codebase it’s so bad, and you say “You know what we should do? We should break it up. We’re gonna break it up and somehow find the engineering discipline we never had in the first place.” And then what they end up doing is creating 50 deployables, but it’s really a distributed monolith. —  KELSEY HIGHTOWER\n This, unfortunately, is way too common. As the “Magic Pill”   people fall into the mindset that smaller is faster and in return, better. Microservices will not fix a bad Monolith.   If you make a bad Lasagna it doesn’t matter how many pieces you cut it into, its still bad.\n   1. You’re duplicating the tables (information), without transforming the data into something new (adding information), in another database…\n 2. Service X does not work without Y or Z, and/or you have no strategy for how to deal with one of them going down.\n 2.5 Bonus, there is likely no way to meaningfully decouple the services. Service X can be “tolerant” of service Y’s failure, but it cannot ever function without service Y.\n 3. You push all your data over an event-bus to keep your services “in-sync” …\n rubyn00bie ( I love the name) hits on some great points. These items all have to be considered in the designing phases. Interdependent services need to either 1) be combined in a microservice 2) use a queue pattern to ensure that the service can process the item (when available) 3) both systems can sit behind a micro-orchestrator to handle error conditions.\n Event buses are an important part of a microservice infrastructure. But, I believe they should be relinquished to notification only, not data synchronization.\n If you move from a Monolith to Microservices   you have to use this as the opportunity to re-evaluate and update. The chances are that if you are at this decision point you are talking about a system that has been around for a while. You cannot look at this as a cut &amp; paste coding exercise, you have to go back to step one.\n  You need to have intimate knowledge of the Monolith. For you that might mean that you need the research and understand aspects that you are not familiar with. You need to think of this as a bunch of independent subsystems not as one big system in smaller parts.\n It may not seem important, but the way you look at it has a huge impact. This viewpoint will shape every decision you will encounter.\n  For instance, say you have a monolithic application that is an eCommerce platform. You have decided to break the Monolith. You have a few options:\n Smaller is Better — Find the logical division points in the application, use them to create smaller applications that are strongly tied together. Deploy these and claim victory, you are a Microservice master!\n Smaller is Smarter — Take the time to uncover the core capabilities of the Monolith. Consider these are separate end to end applications that are required to live independent from the eco-system. Try to expand its ability to handle more use cases. Deploy a stateless application.\n So in our example, we might break things up into multiple smaller parts, Cart, Product, Order, Etc. In both cases, we may choose the same division points but, what we build will be very different. In one case we would separate the services but there would be tight coupling between them. In the second scenario, we look to create a full set of functionality for each.\n  Could I take this microservice and place it in another architecture without making changes to it and fully use all of its capabilities? — A Self Reflective Engineer\n If your answer is yes, you started with the right viewpoint. If not, you have too much coupling, start again.\n  Many things follow the microservice pattern, like your car. Your car is made up of multiple smaller components. Some of those components, like your breaks, work for cars other than yours (  like a fully independent microservice). Other components, like your windshield, are specific for your make and model (  like microservice components that are interdependent).\n There is a careful balance that will take planning to implement properly. Like any good architecture, it is never fixed and will evolve over time.\n The second you hit save on a Architecture diagram, its already invalid — A Wise Architect\n A good microservice solution will start with recognition that you are either making a change because you want to or you need to. If you need to, recognize why that is and avoid the root causes like the plague.", "posttime": "2020-06-04 14:30:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,开发,软件开发,monoliths,服务", "title": "我刚听说软件开发的未来是铁板一块", "title_en": "I Just Heard That Monoliths Are the Future of Software Development", "transed": 1, "url": "https://medium.com/a-technologists-pov/i-just-heard-that-monoliths-are-the-future-of-software-development-2190bf7f3c40", "via": "", "real_tags": ["软件", "开发", "软件开发", "monoliths", "服务"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005112, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1962年，飞利浦发明了用于音频存储的紧凑型盒式磁带介质，并于1963年8月30日(在柏林广播展上)将其引入欧洲，并于1964年11月在美国(以Norelco品牌)推出，商标名称为紧凑型盒式磁带。飞利浦的团队由比利时哈塞尔特的卢·奥滕斯领导。尽管有其他盒式磁带系统，飞利浦紧凑型盒式磁带由于面对索尼免费授权的压力而成为主导。飞利浦还于1964年11月在美国发布了Norelco Carry-Corder 150录音机/播放器。到1966年，仅在美国就售出了超过25万台录音机，日本很快成为录音机的主要来源国。到1968年，85家制造商已经售出了超过240万台播放器。早些年，音质一般，但到20世纪70年代初，当它赶上8轨磁带的质量并不断改进时，音质得到了极大的改善。紧凑型盒式磁带在20世纪70年代末成为12英寸黑胶唱片的一种流行(并且可重新录制)的替代品。", "note_en": "In 1962, Philips invented the Compact Cassette medium for audio storage, introducing it in Europe on 30 August 1963 (at the Berlin Radio Show), and in the United States (under the Norelco brand) in November 1964, with the trademark name Compact Cassette. The team at Philips was led by Lou Ottens in Hasselt, Belgium.   Although there were other magnetic tape cartridge systems, Philips&#39; Compact Cassette became dominant as a result of Philips&#39; decision in the face of pressure from Sony to license the format free of charge. Philips also released the Norelco Carry-Corder 150 recorder/player in the U.S. in November 1964. By 1966 over 250,000 recorders had been sold in the US alone and Japan soon became the major source of recorders. By 1968, 85 manufacturers had sold over 2.4 million players.   In the early years, sound quality was mediocre, but it improved dramatically by the early 1970s when it caught up with the quality of 8-track tape and kept improving. The Compact Cassette went on to become a popular (and re-recordable) alternative to the 12-inch vinyl LP during the late 1970s.", "posttime": "2020-06-04 14:23:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "进行,catalogue,norelco", "title": "项目C-90，对每一盘盒式磁带进行分类的尝试", "title_en": "Project C-90, an attempt to catalogue every cassette tape", "transed": 1, "url": "http://www.c-90.org/catalogue/tapes", "via": "", "real_tags": ["进行", "catalogue", "norelco"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005111, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "&gt；&gt；t&lt；&lt；Jusr；PRI；JFC；LJ；Phr，Dic，VOC！：我们为C程序员提供帮助。\nII 13 18 35 71。84)95 100 104 110 133，U&A；.v、u&amp；.：v和u：.v.。137 137 139 147 155 160 162 167 168 183。和for_x./do./end。。。186及同时/做。/完。。。186/结束。，如果。/做。/其他如果。/做。/结束。。。186/结束。然后扔出去。。。187/完。。。187 188 188 189 201 204 205 210 219绘图命令。228 233 236 251 284 285 292&gt；&gt；&lt；&lt；JUSR：PRI；JFC：LJ：Phr，Dic，VOC！：为C程序员提供帮助。", "note_en": "&gt;&gt;  &lt;&lt;  Usr  Pri  JfC  LJ  Phr  Dic  Voc  !:  Help J for C Programmers\n  ii            13            18                                                                                              35                                                                                                         71                                  84                          )    95                     100             104                       110                                                                                                      133                     , u&amp;.v, u&amp;.:v,and  u:.v  ..  137         137         139                                             147                                                    155                                      160         162                       167     168                                       183                and  for_x./ do./ end.  ..  186     and  whilst./ do./ end.  ..  186    / end.,  if./ do./ elseif./ do./ end.  ..  186    / end. and  throw.  ..  187    / end.  ..  187     188     188     189                                                    201             204     205                          210                                                     219                                                                     Drawing Commands  .  228                    233                               236                                                                                  251                                                                                            284     285         292          &gt;&gt;  &lt;&lt;  Usr  Pri  JfC  LJ  Phr  Dic  Voc  !:  Help J for C Programmers", "posttime": "2020-06-04 14:06:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,程序员,programmers,提供", "title": "J for C程序员", "title_en": "J for C Programmers", "transed": 1, "url": "https://www.jsoftware.com/help/jforc/contents.htm", "via": "", "real_tags": ["程序", "程序员", "提供"]}, {"category": "", "categoryclass": "", "imagename": "453f288904f38b63a5bec0dca40368a9.jpeg", "infoid": 1005110, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纽约(路透社)-亚马逊公司被起诉，指控其通过强制要求不安全的工作条件，助长了冠状病毒的传播，导致至少一名员工与新冠肺炎签约，将其带回家，眼睁睁地看着她的堂兄死去。\n周三，斯塔滕岛JFK8履行中心的三名员工及其家人向纽约州布鲁克林的联邦法院提起了申诉。\n一名员工芭芭拉·钱德勒(Barbara Chandler)说，她在3月份的新冠肺炎检测呈阳性，后来看到几名家庭成员生病，其中包括4月7日去世的表亲。\n诉讼称，亚马逊通过阻碍阻止冠状病毒传播的努力，以牺牲安全为代价，提高了生产率，使拥有约5000名员工的JFK8成为“危险之地”。\n它说，亚马逊强迫员工以“令人眼花缭乱的速度工作，即使这样做会阻止他们与社会保持距离，洗手和消毒他们的工作空间。”\n亚马逊没有对这起诉讼发表评论，但表示自冠状病毒大流行开始以来，它一直遵循卫生当局和工作场所安全专家的指导。\n这家总部位于西雅图的公司受益于大流行迫使许多无法光顾实体店的消费者更多地在网上购物。\n工会、民选官员和一些员工指责亚马逊对待工人的方式，包括解雇一些对仓库条件持批评态度的员工。\n亚马逊首席执行官杰夫·贝佐斯(Jeff Bezos)上周表示，亚马逊没有因为这样的批评而解雇员工。\n今年上半年，亚马逊在冠状病毒安全方面的支出超过8亿美元，包括清洁、体温检查和口罩。\n根据一名员工的非官方统计，美国配送中心至少有800名工人的新冠肺炎检测呈阳性。\n诉讼寻求禁制令，要求亚马逊遵守工人安全和公共妨害法，不惩罚出现新冠肺炎症状或被隔离的员工。\n本案是Palmer等人诉亚马逊公司，美国地区法院，纽约东区，编号20-02468。", "note_en": "NEW YORK (Reuters) - Amazon.com Inc has been sued for allegedly fostering the spread of the coronavirus by mandating unsafe working conditions, causing at least one employee to contract COVID-19, bring it home, and see her cousin die.\n  The complaint was filed on Wednesday in the federal court in Brooklyn, New York, by three employees of the JFK8 fulfillment center in Staten Island, and by family members.\n One employee, Barbara Chandler, said she tested positive for COVID-19 in March and later saw several household members become sick, including a cousin who died on April 7.\n The lawsuit said Amazon has made JFK8, which employs about 5,000, a “place of danger” by impeding efforts to stop the coronavirus spreading, boosting productivity at the expense of safety.\n It said Amazon forces employees to work at “dizzying speeds, even if doing so prevents them from socially distancing, washing their hands, and sanitizing their work spaces.”\n Amazon did not comment on the lawsuit, but said it has always followed guidance from health authorities and its workplace safety experts since the coronavirus pandemic began.\n The Seattle-based company has benefited as the pandemic forced many consumers unable to visit physical stores to shop online more.\n Unions, elected officials and some employees have faulted Amazon’s treatment of workers, including the firing of some critical of warehouse conditions.\n Chief Executive Jeff Bezos said last week that Amazon has not fired people for such criticism.\n Amazon is spending more than $800 million on coronavirus safety in this year’s first half, including cleaning, temperature checks and face masks.\n At least 800 workers in U.S. distribution centers have tested positive for COVID-19, according to an employee’s unofficial tally.\n  The lawsuit seeks an injunction requiring that Amazon comply with worker safety and public nuisance laws, and not punish employees who develop COVID-19 symptoms or are quarantined.\n The case is Palmer et al v Amazon.com Inc., U.S. District Court, Eastern District of New York, No. 20-02468.", "posttime": "2020-06-04 14:06:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,亚马逊,amazon,冠状病毒", "title": "纽约一名工人将冠状病毒带回家后，亚马逊因仓库被起诉", "title_en": "Amazon is sued over warehouses after New York worker brings coronavirus home", "transed": 1, "url": "https://www.reuters.com/article/us-health-coronavirus-amazon-com-lawsuit/amazon-is-sued-over-warehouses-after-new-york-worker-brings-coronavirus-home-cousin-dies-idUSKBN23A3FI", "via": "", "real_tags": ["病毒", "亚马逊", "amazon", "冠状病毒"]}, {"category": "", "categoryclass": "", "imagename": "3f220bc61bc6e8588ac0d4de876d48a1.jpeg", "infoid": 1005109, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GitHub是5000多万开发人员的家园，他们一起工作，共同托管和审查代码、管理项目和构建软件。\n报名", "note_en": "GitHub is home to over 50 million developers working together to host and review code, manage projects, and build software together.\n  Sign up", "posttime": "2020-06-04 13:42:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "汇编,rust,hack,审查", "title": "Rust中实现的Nand2Tetris Hack汇编器", "title_en": "Nand2Tetris Hack assembler implemented in Rust", "transed": 1, "url": "https://github.com/tamuhey/hack-assembler-rust", "via": "", "real_tags": ["汇编", "rust", "hack", "审查"]}, {"category": "", "categoryclass": "", "imagename": "1446338faf14e7d91106347b59717753.png", "infoid": 1005108, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我们需要让两个不同VPC上的主机能够通信，而不需要通过公网路由流量时，VPC网络对等就会派上用场。它允许RFC 1918跨两个虚拟私有云(VPC)网络连接，无论这两个网络是否在同一GCP项目中。流量完全保持在谷歌的网络内。VPC对等可以与同一项目中的VPC开启，也可以与两个不同项目中的VPC开启。\n延迟更低，因为通信是通过谷歌内部网络进行的，而不是通过公共互联网路由。\n降低了带宽成本。无论何时通过公共互联网进行数据传输，Google Cloud都会按消耗的带宽收费。\n提高了网络安全性，因为网络管理员不必担心暴露在公共互联网上所涉及的风险。\n子网重叠时无法启用私有网络对等。在设置私有网络与不同项目的私有网络对等时，需要注意的是，我们不能对等两个项目的默认私有网络，因为两个私有网络都有重叠的子网。\n我们将演示如何在GCP中对等两个不同项目上的两个VPC。为了对等vPC网络，我们需要在GCP中创建两个项目。假设它们是GCP-PROJECT-1和GCP-PROJECT-2。我们将在GCP-PROJECT-2中将GCP-PROJECT-1的默认vPC与名为vPC-CUSTOM的自定义vPC对等。在这里，我们将使用BGP对等进行网络对等，BGP对等用于在两个系统(对等)之间交换路由信息。您可以在此处https://docs.opendaylight.org/projects/bgpcep/en/latest/bgp/bgp-user-guide-bgp-peering.html阅读有关bgp对等的更多信息。\n让我们在gcp-project-2中创建一个具有地域BGP对等模式的私有网络VPC-CUSTOM。\n在该私有网络中创建一个地域内网段不重叠的子网。您可以根据需要使用任何区域，这里我们选择us-cental1进行演示。\n必须启用ICMP防火墙规则才能通过对等网络发现实例。还可以为ssh添加防火墙规则，以测试与独立网络中的两个虚拟机的连通性。\ngcloud测试版计算网络对等创建Custom-Default\\--network=Custom-vPC\\--Peer-network=default\\--Peer-project=gcp-project-2\\--project=gcp-project-1 gcloud测试版计算网络对等创建default-Custom\\--network=default\\--Peer-network=Custom-vPC\\--Peer-project=gcp-project\\--project=gcp-project-1。\n让我们通过在每个VPC网络中创建两个计算引擎实例来测试连接，并尝试从这两台计算机彼此ping通。\ngcloud计算实例创建ping-test-1\\--网络默认\\--子网默认\\--机器类型F1-micro\\--project=gcp-project-1 gcloud计算实例创建ping-test-2--network vpc-自定义--子网自定义-集中1--机器类型F1-microproject=gcp-project-2。\nping将成功，反之亦然，并确认跨VPC的计算机的可发现性", "note_en": "VPC network peering comes to help when we need to make hosts on two different VPCs needs to be able to communicate without the need to route the traffic through public internet. It allows RFC 1918 connectivity across two Virtual Private Cloud (VPC) networks regardless of whether the two networks are in same GCP project or not. The traffic stays completely within google’s network. VPC peering can be enabled with VPCs in same projects as well as VPCs in two different projects.\n   Lower latency since communications happens through Google’s internal network rather than routing through public internet\n Reduced bandwith costs. Whenever data transfer takes place via public internet Google cloud charges for the bandwidth consumed\n Improved network security since the network admins do not have to worry about the risks involved in exposing to public internet\n VPC peering cannot be enabled with overlapping subnets. While setting up VPC peering with VPCs of different projects, it is worth to be noted that we cannot peer the default VPCs of the two projects since both the VPCs with be having overlapping subnets.\n We will demonstrate how to peer two VPCs on two different projects in GCP. In order to peer VPC networks we need to create two projects in GCP. Let them be  gcp-project-1 and  gcp-project-2 We will be peering default VPC of  gcp-project-1 with a custom VPC named  vpc-custom in  gcp-project-2 We will be using bgp peering for network peering here, bgp peering is used to exchange routing informations between two systems(peers). You can read more about bgp peering here  https://docs.opendaylight.org/projects/bgpcep/en/latest/bgp/bgp-user-guide-bgp-peering.html\n  Let’s create a VPC network  vpc-custom in  gcp-project-2 with regional bgp peering mode.\n  Create a subnet in that VPC with a non overlapping ip range in a region. You can use any region with your requirement, here we’re choosing  us-central1 for demo purposes\n  icmp firewall rule must be enabled for discovery of instances over the peered networks. Also add firewall rules for ssh to test connectivity with two VMs in the separate networks\n   gcloud beta compute networks peerings create custom-default \\ --network=custom-vpc \\ --peer-network=default \\ --peer-project=gcp-project-2 \\ --project=gcp-project-1  gcloud beta compute networks peerings create default-custom \\ --network=default \\ --peer-network=custom-vpc \\ --peer-project=gcp-project \\ --project=gcp-project-1\n  Let’s test the connection by creating two compute engine instances in each VPC network, and try to ping from each other from those machines\n gcloud compute instances create ping-test-1 \\ --network default \\ --subnet default \\ --machine-type f1-micro \\ --project=gcp-project-1  gcloud compute instances create ping-test-2 --network vpc-custom --subnet custom-central1 --machine-type f1-micro --project=gcp-project-2\n    Ping will be successful, do the same vice-versa and confirm the discoverability of machines across VPCs", "posttime": "2020-06-04 13:41:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,云中,peering,网络", "title": "Google云中的VPC对等", "title_en": "VPC Peering in Google Cloud", "transed": 1, "url": "https://medium.com/sellerapp/enabling-vpc-network-peering-in-google-cloud-platform-b97bbb81aeac", "via": "", "real_tags": ["google", "云中", "peering", "网络"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005107, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "看起来clang-11.0.0编译器错误编译了sqlite3.c版本3.32.1。我已经签入了对SQLite的更改，似乎可以解决这个问题。但可能还有其他虫子。因此，请谨慎使用clang-11.0.0并仔细测试您的应用程序！\nOSSFuzz在SQLite上报告了错误23003。我无法在我的桌面(带有GCC-5.4.0的Ubuntu)上重现这个问题，所以我按照OSSFuzz错误复制过程发现了OSSFuzz当前使用的clang-11.0.0似乎有问题。\n错误编译的代码是src/utf.c源文件的第345-347行，如下所示：\n从-S输出中可以看出，Clang-11.0.0正在编译这三行代码，就好像有这样的代码：\n换句话说，Clang似乎假定sqlite3VdbeMemRelease()函数不会更改PMEM-&gt；标志的值。但它确实存在。我的解决办法是在函数调用之前而不是之后对PMEM-&gt；标志进行位调整：\nCLANG-O1-FNO-OMIT-FRAME-POINTER-GLINE-TABLES-ONLY-DFUZZING_BUILD_MODE_UNSAFE_FOR_PROGATION-FSANITIZE=ADDRESS-FSANITIZE-ADDRESS-USE-SCOPE-FSANITZE=FUZZER-NO-LINK-DSQLITE_MAX_LENGTH=128000000-DSQLITE_MAX_SQL_LENGTH=128000000-DSQLITE_MAX_MEMORY=25000000-DSQLITE_PRE。-c-o1-g./sqlite3.c-o sqlite3.o", "note_en": "It appears that the clang-11.0.0 compiler mis-compiles sqlite3.c version 3.32.1.I have  checked in a change to SQLite that appears to work around theproblem. But there might be other bugs. Therefore,use clang-11.0.0 with caution and test your applications carefully!\n  OSSFuzz has been reported bug  23003 against SQLite.I could not reproduce the problem on my desktop (Ubuntu with gcc-5.4.0)so I followed the  OSSFuzz bug replication procedures and discoveredwhat appears to be a problem with Clang-11.0.0 currently used byOSSFuzz.\n The code that is miscompiled is  lines 345-347 of the src/utf.c source file, shown below:\n  From the -S output, it looks likeClang-11.0.0 is compiling these three lines as if there were written as:\n  In other words, Clang seems to be assuming that the sqlite3VdbeMemRelease() functiondoes not change the value of pMem-&gt;flags. But it does. Mywork-around is to do the bit-twiddling of pMem-&gt;flags before the functioncall instead of afterwards:\n      clang -O1 -fno-omit-frame-pointer -gline-tables-only -DFUZZING_BUILD_MODE_UNSAFE_FOR_PRODUCTION -fsanitize=address -fsanitize-address-use-after-scope -fsanitize=fuzzer-no-link -DSQLITE_MAX_LENGTH=128000000 -DSQLITE_MAX_SQL_LENGTH=128000000 -DSQLITE_MAX_MEMORY=25000000 -DSQLITE_PRINTF_PRECISION_LIMIT=1048576 -DSQLITE_DEBUG=1 -DSQLITE_MAX_PAGE_COUNT=16384 -O1 -g -I. -c -O1 -g ./sqlite3.c -o sqlite3.o", "posttime": "2020-06-04 13:18:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sqlite,编译,错误,miscompiled", "title": "clang-11.0.0编译错误的SQLite", "title_en": "Clang-11.0.0 Miscompiled SQLite", "transed": 1, "url": "https://sqlite.org/forum/forumpost/e7e828bb6f", "via": "", "real_tags": ["sqlite", "编译", "错误"]}, {"category": "", "categoryclass": "", "imagename": "23d1d176dda5e4a3015271f09a4d1967.jpg", "infoid": 1005106, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了认识到目前正在发生的一切，乐高在#BlackOutTuesday上的行动不仅包括向致力于种族平等的组织捐赠400万美元，还要求卖家不要宣传任何涉及警察或白宫的布景。\n据“玩具书”报道，周二，乐天(负责乐高附属公司营销)发出电子邮件，要求经销商避免推销一长串产品，包括警察局、警车、一个甜甜圈店(其中包括一个警察微型无花果)和优秀建筑系列版本的白宫(如上图)。\n虽然原始电子邮件中没有具体说明，但作为乐高#BlackOutTuesday努力的一部分，这一请求只打算持续一天。所有列出的套装都没有下架，卖家只是被要求不要积极促销。\n受影响产品的完整清单-包括其他紧急服务套装，如消防站-可以在玩具书上找到。\n卢克·普朗基特(Luke Plunkett)是澳大利亚堪培拉的一名高级编辑。他写了一本关于cosplay的书，设计了一款关于飞机的游戏，还经营着cosplay.kotaku.com。", "note_en": "In recognition of  everything that’s going on right now, LEGO’s actions for   #BlackOutTuesday involved not just a $4 million donation to organisations devoted to racial equality, but a request for sellers to not advertise any sets involving police or the White House.\n  As    The Toy Book report, emails went out on Tuesday from Rakuten (who handle LEGO’s affiliate marketing) asking resellers to avoid promoting a long list of products that included police stations, police vehicles, a donut shop that included a police minifig and the excellent Architecture Series version of The White House (pictured above).\n     While not specified in the original email, the request was intended to only last for one day, as part of LEGO’s #BlackOutTuesday efforts. None of the sets listed were removed from sale, sellers were simply asked not to actively promote them.\n The full list of affected products—which included other emergency services sets like a fire station—can be found   at  The Toy Book.\n Luke Plunkett is a Senior Editor based in Canberra, Australia.  He has written a book on cosplay, designed  a game about airplanes, and also runs  cosplay.kotaku.com.", "posttime": "2020-06-04 13:18:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,asks,包括", "title": "乐高要求商店停止广告警察，白宫布景", "title_en": "Lego Asks Stores to Stop Advertising Police, White House Sets", "transed": 1, "url": "https://kotaku.com/lego-asks-stores-to-stop-advertising-police-white-hous-1843892787", "via": "", "real_tags": ["广告", "asks", "包括"]}, {"category": "", "categoryclass": "", "imagename": "759f3ae9ddba93fa0334398ddbbaf4da.png", "infoid": 1005105, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用GitHub课堂可以轻松管理和组织您的班级。跟踪和管理仪表板中的作业，自动评分工作，并在学生遇到困难时帮助他们-所有这些都是在使用开发人员使用的行业标准工具GitHub的同时进行的。\n登录并开始使用。\n使用自动测试对作业评分，从而节省时间。每次推送都会运行测试，让学生立即看到结果，并根据需要进行更改。\n当学生遇到问题时抓住它，并用版本控制帮助他们倒带。在小组作业中，查看每个学生在GitHub中的个人贡献。\n自动将作业分配给学生，让自动化测试为您完成繁重的任务。\n创建个人和小组作业，为它们添加入门代码，然后将它们发送给学生。\n让学生在任何具有教育者福利的任务中私下或公开工作。当你需要的时候，你需要多少私人任务就有多少。", "note_en": "Managing and organizing your class is easy with GitHub Classroom. Track and manage assignments in your dashboard, grade work automatically, and help students when they get stuck— all while using GitHub, the industry-standard tool developers use.\n  Sign in and get started\n Save time by using automated testing to grade assignments. Tests run with every push, letting students see results immediately and make changes as necessary.\n    Catch when students get stuck and help them rewind with version control. In group assignments, see each student&#39;s individual contribution in GitHub.\n  Automatically distribute assignments to students and let automated testing do the heavy lifting for you.\n  Create individual and group assignments, prime them with starter code, and send them out to students.\n  Make student work private or public for any assignment with Educator’s benefits. As many private assignments as you need, whenever you need them.", "posttime": "2020-06-04 12:30:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "github,学生", "title": "GitHub教室", "title_en": "GitHub Classroom", "transed": 1, "url": "https://classroom.github.com/", "via": "", "real_tags": ["github", "学生"]}, {"category": "", "categoryclass": "", "imagename": "a30298e5fe76a5f1a3b74824c7683431.png", "infoid": 1005104, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Altair是一个用于Python的声明性统计可视化库。有了牛郎星，你可以花更多的时间来理解你的数据和它的意义。牛郎星SAPI简单、友好、一致，并建立在强大的Vega-Lite JSON规范之上。这种优雅的简单性用最少的代码产生漂亮而有效的可视化效果。牛郎星是由杰克·范德普拉斯和布莱恩·格兰杰与UW互动数据实验室密切合作开发的。\n以下是使用Altair在JupyterLab中使用本机Vega-Lite渲染器快速可视化和显示数据集的示例：\nimport Altair as alt#加载一个简单的数据集作为熊猫DataFrame from Vega_Datasets import data ars=data。汽车()ALT。图表(汽车)。mark_point()。编码(x=&#39；马力&#39；，y=&#39；英里_每加仑&#39；，color=&#39；原点&#39；，)。\nAltair从Vega-Lite继承而来的一个独特功能是声明性语法，不仅是可视化的，而且是交互的。通过对上面的示例进行一些修改，我们可以创建一个链接的直方图，该直方图根据选择的散点图进行过滤。\n将牛郎星作为ALT从Vega_DataSets导入data source=data。Cars()笔刷=Alt。选择(type=&#39；间隔&#39；)点=alt。图表(来源)。mark_point()。编码(x=&#39；马力&#39；，y=&#39；英里_每加仑&#39；，颜色=alt.。条件(画笔，原点，Alt。值(&#39；浅灰色&#39；))。Add_Selection(笔刷)栏=Alt。图表(来源)。mark_bar()。编码(y=&#39；Origin&#39；，color=&#39；Origin&#39；，x=&#39；count(Origin)&#39；)。变换过滤器(画笔)点(&A)条(&F)。\n如果您有文档中没有解决的问题，可以通过以下几种方式提问：\nAltair提供了一个Python API，用于在声明管理器中构建统计可视化。我们所说的统计可视化是指：\n数据源是由不同数据类型(数量、顺序、名义和日期/时间)的列组成的DataFrame。\nDataFrame采用整齐的格式，其中行对应于样本，列对应于观察到的变量。\n数据被映射到视觉属性(位置、颜色、大小、形状、刻面等)。使用GROUP-BY数据转换。\nAltair API不包含实际的可视化呈现代码，而是提供遵循Vega-Lite规范的JSON数据结构。生成的Vega-Lite JSON数据可以在以下用户界面中呈现：\n自动生成的内部Python API，它保证可视化是类型检查的，并且完全符合Vega-LitSpecification。\n牛郎星可以使用pip或conda进行安装。有关完整的安装说明，请参阅https://altair-viz.github.io/getting_started/installation.html。\n我们维护一个单独的Jupyter笔记本Github存储库，其中包含交互式教程和示例：\n要使用活页夹或Colab启动包含这些笔记本的实时笔记本服务器，请单击以下徽章之一：\n然而，如此繁多的选项给用户带来了极大的困难，因为他们不得不费力地浏览所有这些API，以找出其中哪一个最适合手头的任务。这些库都不是针对高级统计可视化进行优化的，因此用户必须使用混杂的API来组装自己的库。对于刚刚学习数据科学的个人来说，这迫使他们专注于学习API，而不是探索他们的数据。\n另一个挑战是，当前的绘图API需要用户编写代码，即使是可视化的附带细节也是如此。这导致了作为可视化类型(直方图、散点图等)的不幸和不必要的认知负担。通常可以使用基本信息(如感兴趣的列和这些列的数据类型)来推断。\n例如，如果您对两个数值列的可视化感兴趣，散点图几乎肯定是一个很好的起点。如果向其添加分类列，则可能需要使用颜色或面对该列进行编码。如果推断可视化有时被证明是困难的，那么一个简单的用户界面可以在没有任何编码的情况下构建可视化。Tableau和互动数据实验室的“北极星”和“旅行者”就是这样的用户界面的极好例子。\n我们相信，无需创建另一个具有编程API和内置渲染的可视化库，就可以解决这些挑战。Altair构建可视化的方法使用分层设计，该设计充分利用了现有可视化库的全部功能：\n这种方法使用户最初可以使用简单得多的API执行探索性可视化，根据他们的使用情况选择合适的渲染器，然后利用该渲染器的全部功能进行更高级的绘图定制。\n我们意识到，与Matplotlib、Bokeh等完整的编程API相比，声明性API必然会受到限制。我们认为，为了简化探索性可视化的用户体验，这是一个经过深思熟虑的设计选择。\n如果已克隆存储库，请从存储库的根目录运行以下命令：\n(如果您正在从源签出运行测试，则可以省略--pyargs标志)。\n@文章{VanderPlat2018年，doi={10.21105/joss.01057}，URL={https://doi.org/10.21105/joss.01057}，年份={2018年}，出版商={The Open Journal}，卷={3}，数量={32}，页数={1057}，作者={雅各布·范德普拉斯、布莱恩·格兰杰、杰弗里·希尔、多米尼克·莫里茨和卡尼特·翁苏帕萨瓦特、阿文德·萨蒂扬纳拉扬、伊坦·李和伊利亚·蒂莫费耶夫。标题={牛郎星：Python的交互式统计可视化}，期刊={开源软件期刊}}\n@文章{Satyanarayan2017，作者={Satyanarayan，Arvind和Moritz，Dominik和Wongsuphasawat，Kanit and Heer，Jeffrey}，title={Vega-Lite：A Grammar of Interactive Graphics}，Journal={IEEE可视化和计算机图形学报}，年份={2017}，卷={23}，数量={1}，页数={341-350}，出版商={IEEE}}。\n牛郎星是水瓶座中最亮的一颗星，与天津四和织女星一起形成了北半球被称为夏季三角的星体。", "note_en": "Altair is a declarative statistical visualization library for Python. With Altair, you can spend more time understanding your data and its meaning. Altair&#39;sAPI is simple, friendly and consistent and built on top of the powerful Vega-Lite JSON specification. This elegantsimplicity produces beautiful and effective visualizations with a minimal amount of code.  Altair is developed by  Jake Vanderplas and  BrianGranger in close collaboration with the  UWInteractive Data Lab.\n    Here is an example using Altair to quickly visualize and display a dataset with the native Vega-Lite renderer in the JupyterLab:\n import  altair  as  alt # load a simple dataset as a pandas DataFrame from  vega_datasets  import  data cars  =  data. cars() alt. Chart( cars). mark_point(). encode(  x = &#39;Horsepower&#39;,  y = &#39;Miles_per_Gallon&#39;,  color = &#39;Origin&#39;,)\n  One of the unique features of Altair, inherited from Vega-Lite, is a declarative grammar of not just visualization, but  interaction.With a few modifications to the example above we can create a linked histogram that is filtered based on a selection of the scatter plot.\n import  altair  as  alt from  vega_datasets  import  data source  =  data. cars() brush  =  alt. selection( type = &#39;interval&#39;) points  =  alt. Chart( source). mark_point(). encode(  x = &#39;Horsepower&#39;,  y = &#39;Miles_per_Gallon&#39;,  color = alt. condition( brush,  &#39;Origin&#39;,  alt. value( &#39;lightgray&#39;))). add_selection(  brush) bars  =  alt. Chart( source). mark_bar(). encode(  y = &#39;Origin&#39;,  color = &#39;Origin&#39;,  x = &#39;count(Origin)&#39;). transform_filter(  brush) points  &amp;  bars\n   If you have a question that is not addressed in the documentation, there are several ways to ask:\n    Altair provides a Python API for building statistical visualizations in a declarativemanner. By statistical visualization we mean:\n The  data source is a  DataFrame that consists of columns of different data types (quantitative, ordinal, nominal and date/time).\n The  DataFrame is in a  tidy formatwhere the rows correspond to samples and the columns correspond to the observed variables.\n The data is mapped to the  visual properties (position, color, size, shape,faceting, etc.) using the group-by data transformation.\n The Altair API contains no actual visualization rendering code but insteademits JSON data structures following the Vega-Lite specification. The resultingVega-Lite JSON data can be rendered in the following user-interfaces:\n   Auto-generated internal Python API that guarantees visualizations are type-checked andin full conformance with the  Vega-Litespecification.\n    Altair can be installed with either  pip or with  conda.For full installation instructions, please see https://altair-viz.github.io/getting_started/installation.html\n  We maintain a separate Github repository of Jupyter Notebooks that contain aninteractive tutorial and examples:\n  To launch a live notebook server with those notebook using  binder or Colab, click on one of the following badges:\n       However, such a proliferation of options creates great difficulty for usersas they have to wade through all of these APIs to find which of them is thebest for the task at hand. None of these libraries are optimized forhigh-level statistical visualization, so users have to assemble their ownusing a mishmash of APIs. For individuals just learning data science, thisforces them to focus on learning APIs rather than exploring their data.\n Another challenge is current plotting APIs require the user to write code,even for incidental details of a visualization. This results in an unfortunateand unnecessary cognitive burden as the visualization type (histogram,scatterplot, etc.) can often be inferred using basic information such as thecolumns of interest and the data types of those columns.\n For example, if you are interested in the visualization of two numericalcolumns, a scatterplot is almost certainly a good starting point. If you adda categorical column to that, you probably want to encode that column usingcolors or facets. If inferring the visualization proves difficult at times, asimple user interface can construct a visualization without any coding. Tableau and the  Interactive DataLab&#39;s Polestar and Voyager are excellent examples of such UIs.\n  We believe that these challenges can be addressed without the creation of yetanother visualization library that has a programmatic API and built-inrendering. Altair&#39;s approach to building visualizations uses a layered designthat leverages the full capabilities of existing visualization libraries:\n  This approach enables users to perform exploratory visualizations with a muchsimpler API initially, pick an appropriate renderer for their usage case, andthen leverage the full capabilities of that renderer for more advanced plotcustomization.\n We realize that a declarative API will necessarily be limited compared to thefull programmatic APIs of Matplotlib, Bokeh, etc. That is a deliberate designchoice we feel is needed to simplify the user experience of exploratoryvisualization.\n    If you have cloned the repository, run the following command from the root of the repository:\n       (you can omit the  --pyargs flag if you are running the tests from a source checkout).\n      @article{ VanderPlas2018,  doi =   {10.21105/joss.01057 },  url =   {https://doi.org/10.21105/joss.01057 },  year =   {2018 },  publisher =   {The Open Journal },  volume =   {3 },  number =   {32 },  pages =   {1057 },  author =   {Jacob VanderPlas and Brian Granger and Jeffrey Heer and Dominik Moritz and Kanit Wongsuphasawat and Arvind Satyanarayan and Eitan Lees and Ilia Timofeev and Ben Welsh and Scott Sievert },  title =   {Altair: Interactive Statistical Visualizations for Python },  journal =   {Journal of Open Source Software }}\n  @article{ Satyanarayan2017, author=  {Satyanarayan, Arvind and Moritz, Dominik and Wongsuphasawat, Kanit and Heer, Jeffrey }, title=  {Vega-Lite: A Grammar of Interactive Graphics }, journal=  {IEEE transactions on visualization and computer graphics }, year=  {2017 }, volume=  {23 }, number=  {1 }, pages=  {341-350 }, publisher=  {IEEE }}\n  Altair is the  brightest star in the constellation Aquila, and along with Deneb and Vega forms the northern-hemisphere asterism known as the  Summer Triangle.", "posttime": "2020-06-04 12:06:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可视化,python,declarative", "title": "Altair-Python的声明性统计可视化库", "title_en": "Altair – A declarative statistical visualization library for Python", "transed": 1, "url": "https://github.com/altair-viz/altair", "via": "", "real_tags": ["可视化", "python"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005103, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们需要找到一个安全的地方来处置高放核废料；一个我们可以确信它将被隔离和控制数十万年的地方。如果我们想要控制全球变暖，那么我们很可能也需要找到一个类似的地方来储存二氧化碳。但是在哪呢？\n发表在《科学报告》杂志上的一项新研究显示，花岗岩等结晶岩具有天然的自密封机制，能够将流体锁定数百万年。\n对来自日本和英国的花岗岩的化学和结构的仔细分析表明，当流体(通过裂缝)进入岩石时，它最多只能移动几厘米。科学家们认为，岩石中的钙与流体中的碳酸盐发生反应，生成了微小的方解石晶体，堵塞了所有的缝隙，阻止了进一步的流动。曼彻斯特大学的罗伊·沃格利厄斯(Roy Wogelius)说：“花岗岩中永远不会有这么多方解石，而且它的分布表明，几乎可以肯定的是，它是由试图穿过岩石的少量流体形成的。”\n在我们最终确定我们的放射性废物处理策略之前，需要更多的了解，但这是向前迈出的有希望的一步。\n·本文主要图片的标题于2020年6月3日修改，以明确加州约塞米蒂国家公园是一个保护区，在那里处置核废料将是非法的。", "note_en": "We need to find somewhere safe to dispose of high-level nuclear waste; a place where we can be confident it will be isolated and contained for hundreds of thousands of years. And if we want to keep a lid on global warming then we may well need to find a similar place to store carbon dioxide too. But where?\n  A  new study published in Scientific Reports reveals that crystalline rocks, such as granite, have a natural self-sealing mechanism, capable of keeping fluids locked away for millions of years.\n Careful analysis of the chemistry and structure of granites from Japan and the UK revealed that when fluid did enter the rock (via fractures), it travelled a few centimetres at most. The scientists believe that calcium in the rock reacted with carbonate in the fluid to create tiny crystals of calcite that plugged all the gaps and prevented further flow. “This amount of calcite would never be expected in a granite, and the distribution of it indicates it almost certainly formed from small quantities of fluid trying to move through the rock,” says Roy Wogelius from the University of Manchester.\n Greater understanding is needed before we finalise our radioactive waste disposal strategies, but this is a promising step forward.\n • The caption to the main picture on this article was amended on 3 June 2020 to make clear that the Yosemite national park in California is a protected area where disposal of nuclear waste would be illegal.", "posttime": "2020-06-04 11:42:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "解决,solve,流体", "title": "花岗岩能解决核废料储存难题吗？", "title_en": "Could Granite Solve the Hard Problem of Nuclear Waste Storage?", "transed": 1, "url": "https://www.theguardian.com/science/2020/jun/02/terrawatch-could-granite-solve-the-hard-problem-of-nuclear-waste-storage", "via": "", "real_tags": ["解决", "solve", "流体"]}]