[{"category": "", "categoryclass": "", "imagename": "8da241e2c9c333ebe78312735cbd4263.jpg", "infoid": 1005133, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在385例病例中，237例已经出院，该市只有136人正在接受病毒治疗。", "note_en": "Out of the 385 cases, 237 have discharged, and the city has to only 136 people under treatment for the virus.", "posttime": "2020-06-04 19:09:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "新冠,bangalore", "title": "班加罗尔有1200万居民，新冠肺炎病例只有385例", "title_en": "Bangalore has 12M residents and only 385 Covid-19 cases", "transed": 1, "url": "https://www.thequint.com/news/india/coronavirus-for-a-population-of-12-crore-why-bengaluru-has-only-300-covid-cases", "via": "", "real_tags": ["新冠", "bangalore"]}, {"category": "", "categoryclass": "", "imagename": "05ee22f0808da809f0e9d3efcec56df6.jpeg", "infoid": 1005132, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "俄罗斯总统弗拉基米尔·普京宣布俄罗斯北部北极圈内的一个地区进入紧急状态，原因是2万吨石油从一座发电厂泄漏到一条河流中。\n泄漏发生在5月29日，当时石油产品从诺里尔斯克镍业(Norilsk Nickel)子公司运营的一家工业工厂的一个储罐中泄漏。诺里尔斯克镍业是全球最大的钯生产商，也是最大的镍、铂和铜生产商之一。\n据克里姆林宫报道，这起事故发生在俄罗斯纳德日丁斯基冶金厂的主要工业现场，泄漏的石化产品的一部分实际上渗入了安巴尔纳亚河，据克里姆林宫报道，普京周三在与官员讨论这一事件时表示。他质疑正在采取的措施，以进一步清理北极圈内克拉斯诺亚尔斯克地区诺里尔斯克市附近发生的燃料泄漏。\n据路透社报道，在谈到漏油消息是如何出现在电视会议上时，据报道，普京震惊地发现，地方当局在事件发生两天后才从社交媒体上得知这一事件，他警告了该地区的州长亚历山大号(Alexander USS)。\n我们应该从社交网络上了解哪些紧急情况？据俄罗斯通讯社周三报道，普京说，你那边的健康智慧还好吗？据报道，他随后支持在该地区宣布全国进入紧急状态的提议，因为这将有助于清理工作。\n诺里尔斯克镍业公司在其网站上表示，事故是由于储油罐地下室的支撑柱突然下沉造成的，应急小组立即赶到现场，开始清理工作。诺里尔斯克镍业公司表示，漏油发生在一个非常偏远的地区，当地社区没有受到影响。\n诺里尔斯克市和塔米尔地区宣布进入地区紧急状态。该公司表示，已经成立了一个紧急反应小组，由诺里尔斯克市市长担任主席，并补充说，它正在努力限制对当地环境的破坏。但该公司表示，已经派出了一个特别小组来处理漏油事件。\n诺里尔斯克镍业公司总共调动了250名人员和72件设备进行清算工作。该公司表示，截至6月3日，在HHP-3(发电厂)附近总共收集了262吨柴油，总共清除了800立方米受污染的土壤，并从泄漏到安巴尔纳亚河的地方收集了大约80吨燃料。\n俄罗斯调查委员会(Investigative Committee)在其网站上表示，已对这起造成污染和环境破坏的事件展开调查。报道称，现场的一名经理已被拘留。", "note_en": "President  Vladimir Putin has declared a state of emergency in a region within the Arctic Circle in far northern Russia after 20,000 tons of oil leaked into a river from a power plant.\n The spillage occurred on May 29 when the &#34;oil products&#34; leaked from a tank in an industrial plant operated by a subsidiary of Norilsk Nickel, the world&#39;s largest producer of palladium and one of the largest producers of nickel,   platinum and copper.\n  &#34;The accident took place at the industrial site of the Nadezhdinski Metallurgical Plant, and part of the spilled petrochemicals, a considerable amount actually, seeped into the Ambarnaya River,&#34; Putin said as he discussed the incident with officials on Wednesday,  according to the Kremlin. He questioned the measures being taken to clean up the fuel leak that took place near the city of Norilsk in the Krasnoyarsk region, within the Arctic Circle.\n Discussing how news of the spill emerged in the televised meeting, Putin was reportedly shocked to discover that local authorities had only learned of the incident from social media two days after it happened, and he admonished the region&#39;s governor Alexander Uss, Reuters reported.\n &#34;What are we to learn about emergency situations from social networks? Are you alright health wise over there?&#34; Putin said, the news agency reported Wednesday. He then reportedly supported a proposal to declare a national state of emergency in the area as it would assist the clean-up effort.\n Norilsk Nickel said on its website that &#34;the accident was caused by a sudden sinking of supporting posts in the basement of the storage tank&#34; and that emergency teams &#34;immediately arrived to the site to start clean up works.&#34; It said the spill happened in a remote area and that no local community had been impacted.\n  &#34;A regional emergency situation has been declared in the city of Norilsk and Taymir region. An emergency response team has been set up chaired by the city mayor of Norilsk,&#34; the company said, adding that it was trying to limit damage to the local environment.  It said a special team had been brought in to deal with the oil spill.\n  &#34;In total, Norilsk Nickel has mobilized 250 personnel and 72 equipment items to work on the liquidation. As of June 3, a total of 262 tons of diesel fuel has been collected near HHP-3 (the power plant), a total of 800 cubic meters of contaminated soil has been removed and approximately 80 tons of fuel has been collected from the spill to Ambarnaya river,&#34; the company said.\n Russia&#39;s Investigative Committee has launched a probe into the incident that has &#34;caused pollution and environmental damage,&#34;  it said on its website. A manager at the site has been detained, it said.", "posttime": "2020-06-04 19:00:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "进入,declares,事件", "title": "俄罗斯在北极圈漏油事件后宣布进入紧急状态", "title_en": "Russia declares state of emergency after oil spill in the Arctic Circle", "transed": 1, "url": "https://www.cnbc.com/2020/06/04/russia-oil-spill-in-the-arctic-circle-state-of-emergency-declared.html", "via": "", "real_tags": ["进入", "declares", "事件"]}, {"category": "", "categoryclass": "", "imagename": "f057d335e11fc2a0bd2c09b880196a3d.png", "infoid": 1005131, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在，世界各地的人们都在游行抗议种族主义和警察的暴行，他们对最近发生的警察谋杀乔治·弗洛伊德和布雷娜·泰勒的事件感到愤怒。在Signal，我们支持那些走上街头发出自己声音的人。我们相信，美国有些事情需要改变，即使我们不知道具体如何改变，我们也支持和信任在全国范围内自组织起来的人们来解决这个问题。许多为这一变化组织起来的人和团体都在使用信号进行交流，我们正在努力跟上日益增长的流量。我们还一直在努力寻找更多的方式来支持街上的每一个人。眼下有一件事似乎很清楚：2020年是遮脸的好年头。最新版的Signal for Android和iOS在图片编辑器中引入了新的模糊功能，可以帮助保护你分享的照片中人的隐私。现在很容易给每一张脸一个隐藏的地方，或者在你想要抹去的东西上画一条模糊的痕迹。只需点击新的模糊工具图标即可开始。这一更新已经提交给应用商店，并将尽快开始推出。新的模糊功能利用了Android和iOS的最新系统级和平台级库。为了保护您的隐私，所有处理都在本地您自己的设备上进行。这些系统库并不完美。它们并不是100%都能检测到每一张脸，这些缺陷和潜在的偏差意味着扩展它们的默认功能很重要，这样你就可以总是用模糊画笔手动模糊照片中的其他面孔或区域。我们也想做一些应用程序之外的事情，所以我们将免费向社区分发多功能的面膜。我们一直在努力寻找一家能够在当前全球环境下大量生产面罩的制造商。我们正在敲定剩下的几个细节，并将很快提供更多信息。", "note_en": "Right now, people around the world are marching and protesting against racism and police brutality, outraged by the most recent police murders of George Floyd and Breonna Taylor. At Signal, we support the people who have gone into the streets to make their voices heard. We believe that something in America needs to change, and even if we don’t know exactly how, we support and trust in the people who are self-organizing around the country to figure it out. Many of the people and groups who are organizing for that change are using Signal to communicate, and we’re working hard to keep up with the increased traffic. We’ve also been working to figure out additional ways we can support everyone in the street right now. One immediate thing seems clear: 2020 is a pretty good year to cover your face. The latest version of Signal for Android and iOS introduces a new blur feature in the image editor that can help protect the privacy of the people in the photos you share. Now it’s easy to give every face a hiding place, or draw a fuzzy trace over something you want to erase. Simply tap on the new blur tool icon to get started. This update has already been submitted to the app stores, and it will begin rolling out as soon as possible.  The new blur feature leverages the latest system and platform-level libraries for Android and iOS. In order to maintain your privacy, all of the processing happens locally on your own device. These system libraries are not perfect. They don’t detect every face 100% of the time, and these flaws and potential biases meant that it was important to extend their default functionality so that you can always draw with the blur brush to manually obscure additional faces or areas in a photo.  We want to do something outside of the app too, so we’ll be distributing versatile face coverings to the community free of charge. We’ve been working to find a manufacturer capable of producing high volumes of face coverings in the current global circumstances. We’re finalizing a few remaining details and will provide more information soon.", "posttime": "2020-06-04 18:44:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "信号,tools,支持", "title": "信号模糊工具", "title_en": "Blur Tools for Signal", "transed": 1, "url": "https://signal.org/blog/blur-tools/", "via": "", "real_tags": ["信号", "tools", "支持"]}, {"category": "", "categoryclass": "", "imagename": "9f89cf4c6b97ed3bec4904a33fe3f715.png", "infoid": 1005130, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据消息人士透露，在中东，加州共享滑板车初创公司Bird正在销毁8000至1万辆电动滑板车。\n据五位知情人士透露，由于冠状病毒大流行，鸟牌正在中东报废数千辆电动滑板车，并关闭在该地区大部分地区的运营。\n报废的电动滑板车属于Circ，该公司在1月份被鸟牌收购，金额不详。\n据一名前员工和一名公司消息人士透露，卡塔尔、巴林和阿联酋的城市里有8000到10000辆Circ滑板车，由于他们已经签署了保密协议，这些消息人士要求匿名。\n这位前雇员告诉CNBC，伯德将支付大约30万美元，让Circ&39；在中东的所有滑板车报废。\n鸟牌表示，由于天气炎热，该公司已经暂停了在中东的运营，并补充说，该公司正在利用休息时间回收一些车辆。鸟牌将继续在特拉维夫运营自己的滑板车。\n伯德的一位发言人表示，在暂停期间，我们将利用这个机会，负责任地回收以前在该地区使用的旧Circ船队的一部分。\n在极度磨损之后，Circ车辆不再符合我们严格的质量标准。出售或重复使用这些车辆可能会导致安全和可靠性问题，这对购买者或潜在的骑手来说是不公平或不道德的。我们期待着今年晚些时候在该地区更多地区恢复我们的服务。\n3月27日，鸟牌在Zoom Call上裁员约30%，即裁员前1,387名员工中的406人。\n据这名前员工和另外两名业内消息人士透露，由大约75人组成的整个Circ中东团队当天被解雇，其中许多人在5月31日度过了最后一天。由于局势的敏感性，这两名消息人士不愿透露姓名。\n这位前雇员说，他们将彻底关闭这项业务。他们已经撤出并关闭了中东。每个人都失业了。\n在收购Circ后，他们(鸟牌)一直在那里徘徊，说他们支持我们，因为我们在这里有70%的市场份额，而且我们处于非常有利的地位。显然，科维德来了，他们决定不再做这件事了。我们预计会减薪，因为那是一个糟糕的时期，显然没有手术，但后来他们掉头了，让每个人都被裁掉了。\n在冠状病毒时代，各国政府都在大力支持电动滑板车和电动自行车，将其作为汽车和公共交通的可行替代品。\n电动滑板车共享公司将自己标榜为可持续、环保、减少碳排放的企业。但他们的车辆寿命一直存在疑问，有报道称，一些鸟牌电动滑板车的寿命只有几个月。\n上周，有消息称，优步在将其跳跃部门出售给移动初创公司Lime后，正在报废价值数百万美元的数千辆电动自行车和电动滑板车。\n该公司表示，在得出结论认为，由于需要维护和技术支持，赠送这些旧型号的产品太复杂后，他们决定回收Lime不想要的旧型号。\n柏林滑板车公司Tier的联合创始人兼首席执行官劳伦斯·勒施纳在接受CNBC采访时表示，他已经提出从优步跳跃和鸟牌手中购买滑板车，但这两家公司都没有接受他的提议。\n环保初创公司Balance的联合创始人弗兰克·米汉(Frank Meehan)在Twitter上写道：一些自行车和滑板车共享公司肯定是过去十年来最严重的环境污染者之一，真的是不负责任。\n更正：本文中的一句话已更新，显示Circ在中东拥有70%的市场份额。", "note_en": "Between 8,000 and 10,000  e-scooters are being destroyed in the Middle East by California scooter sharing start-up Bird, according to sources.\n Bird is scrapping thousands of e-scooters in the Middle East and shutting down its operations in the majority of the region as a result of the coronavirus pandemic, according to five people familiar with the matter.\n The e-scooters being scrapped belong to Circ, which was acquired by Bird for an undisclosed sum in January.\n  There are between 8,000 and 10,000 Circ scooters across cities in Qatar, Bahrain and United Arab Emirates, according to one former employee and one company source who asked to be kept anonymous as they&#39;ve signed a confidentiality agreement.\n Bird is paying around $300,000 to have all of Circ&#39;s scooters in the Middle East scrapped, the former employee told CNBC.\n Bird said it has &#34;temporarily paused operations&#34; in the Middle East because of the hot weather, adding that it is using the break to &#34;recycle&#34; some vehicles. Bird will continue to operate its own scooters in Tel Aviv.\n &#34;During this pause, we are taking the opportunity to responsibly recycle parts of the old Circ fleet that were previously used in the region,&#34; a Bird spokesperson said.\n &#34;Following extreme wear and tear, the Circ vehicles no longer met our rigorous quality standards. Selling or re-use of these vehicles would potentially result in safety and reliability issues, which would not have been fair or ethical to the purchasers or potential riders. We look forward to resuming our service throughout more parts of the region later this year.&#34;\n  On March 27, Bird  laid off around 30% of its workforce on a Zoom call, or 406 people out of 1,387 employees prior to the layoffs.\n The entire Circ team in the Middle East, which comprised of around 75 people, was laid off that day and many of them had their last day on May 31, according to the former employee and two other industry sources who preferred to remain anonymous due to the sensitivity of the situation.\n &#34;They&#39;re completely shutting down the operation,&#34; said the former employee. &#34;They&#39;ve pulled out and closed the Middle East. Everyone is unemployed.&#34;\n &#34;They (Bird) hung around after acquiring Circ and said they were backing us because we had 70% market share out here and we were in a very good position. Obviously Covid came in and they decided they didn&#39;t want to do it anymore. We were expecting pay cuts because it was a bad time with obviously no operation but then they turned around and made everyone redundant.&#34;\n  Governments are throwing their weight behind e-scooters and e-bikes as a viable alternative to cars and public transport in the age of the coronavirus.\n E-scooter sharing companies have marketed themselves as sustainable, environmentally-friendly businesses that cut carbon emissions. But there have been questions about the longevity of their vehicles, with reports suggesting some Bird e-scooters have a life span of just a few months.\n Last week, it emerged that  Uber is scrapping thousands of e-bikes and e-scooters worth millions of dollars after selling its Jump unit to mobility start-up Lime.\n  The firm said it decided to &#34;recycle&#34; the older models that Lime didn&#39;t want after concluding that it would be too complicated to give them away due to the maintenance and technical support that they need.\n Lawrence Leuschner, the co-founder and CEO of Berlin scooter company Tier, told CNBC that he has offered to take the scooters from Uber Jump and Bird but neither of the companies took him up on the offer.\n Frank Meehan, co-founder of environmental start-up Equilibrium, wrote on Twitter: &#34;Some bike and scooter sharing companies have to be some of the worst environmental polluters of the last decade, and have been really irresponsible.&#34;\n Correction: A quote in this story has been updated to show that Circ had a 70% share of the market in the Middle East.", "posttime": "2020-06-04 18:21:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "app,中东,scrapping", "title": "伯德在中东报废数千辆电动滑板车", "title_en": "Bird Is Scrapping Thousands of Electric Scooters In the Middle East", "transed": 1, "url": "https://www.cnbc.com/2020/06/03/bird-circ-scooters-middle-east.html", "via": "", "real_tags": ["app", "中东", "scrapping"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005128, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近，我和我的电子邮件提供商发生了一些问题，这让我有点害怕，因为我意识到我把电子邮件当成了理所当然的事情，没有备份以防事情变得糟糕。因为我的电子邮件地址是从我拥有的域运行的，所以我可以很容易地切换电子邮件提供商。然而，我使用MUTT，它不会下载所有文件夹中的所有电子邮件正文，所以我不一定有我所有电子邮件的本地副本。\n于是，我开始寻找一个简单的电子邮件备份解决方案，我发现它的形式是一个非常好的python脚本：imapgrab.py。请注意，此脚本具有以下要求：\n一旦满足要求，只需将脚本复制到任何文件夹并按如下方式执行：./imapgrab.py-l-s imap.mail.server-u用户名-p密码。这将列出提供的服务器上所有可用的IMAP文件夹。要下载所有邮件的副本，请运行以下命令：\n./imapgrab.py-d-v-f~/user@email.com-s imap.mail.server-S-p 993-u user@email.com-p password-m&#34；_all_，-INBOX.Trash，-INBOX.Spam，-INBOX.Junk，-Trash，-Junk，-Spam&#34；\n-d指示脚本下载IMAP文件夹。-f提供存储下载的电子邮件的位置。-m提供有关下载内容的说明(这里我们下载除垃圾箱和垃圾邮件文件夹以外的所有内容)。有关更多用法参数，请查看脚本本身。\n运行此脚本后，我可以定期备份我的电子邮件，另外，以下是用于加密和解密备份的电子邮件的命令(特定于Linux)：\n#create archive vetar-jcvf~/user@email.com.tar.bz2~/user@email.com#ENCRYPT(可能需要一段时间)gpg-c~/user@email.com.tar.bz2#delete Originalrm~/user@email.com.tar.bz2rm-rf~/user@email.com#deccryptgpg~/user@email.com.tar.bz2.gpg#提取ttar-。\n最后，为了实际阅读电子邮件，您可以导入Thunderbird中的邮箱，或者按照我喜欢的方式使用mut：mut-f~/user@email.com/INBOX.mbox：)。\n请注意，在编写该脚本时，Python3不起作用，如果您设法将其转换，请一定要向我喊话！", "note_en": "Recently, I had some issues with my email provider and it gave me a bit of a scare as I realized that I had taken email for granted and did not have a backup in case things went south. Since my email address is run off of a domain that I own, I can easily switch email providers. However, I use mutt and it does not download all the email bodies in all the folders so I did not necessarily have a local copy of all my emails.\n  Thus began the hunt for a simple email backup solution and I found it in the form of a really nice python script:  imapgrab.py. Note that this script has the following requirements:\n  Once the requiremements are met, simply copy the script over to any folder and execute it as follows:  ./imapgrab.py -l -s imap.mail.server -u username -p password. This will list all available IMAP folders on the provided server. To download a copy of all mails run the following:\n ./imapgrab.py -d -v -f ~/user@email.com -s imap.mail.server -S -p 993 -u user@email.com -p password -m &#34;_ALL_,-INBOX.Trash,-INBOX.Spam,-INBOX.Junk,-Trash,-Junk,-Spam&#34;\n -d instructs the script to download the IMAP folders.  -f provides the location to store the downloaded email.  -m provides instructions as to what to download (here we download everything except the trash and spam folders). Check out the script itself for more usage parameters.\n With this script running, I was able to regularly backup my email and as a bonus, here are the commands to encrypt and decrypt the backed up emails (linux specific):\n # create archivetar -jcvf ~/user@email.com.tar.bz2 ~/user@email.com # encrypt (could take a while)gpg -c ~/user@email.com.tar.bz2# delete originalrm ~/user@email.com.tar.bz2rm -rf ~/user@email.com# decryptgpg ~/user@email.com.tar.bz2.gpg# extracttar -xvf ~/user@email.com.tar.bz2\n   Finally, in order to actually read the emails, you can import the mailboxes in thunderbird or use mutt as I like to do:  mutt -f ~/user@email.com/INBOX.mbox :).\n Note that at the time of writing the script does not work with Python 3 and if you do manage to convert it, please do throw me a shout!", "posttime": "2020-06-04 17:31:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电子邮件,email", "title": "IMAP电子邮件备份", "title_en": "IMAP Email Backup", "transed": 1, "url": "https://smalldata.tech/blog/2020/04/07/imap-email-backup", "via": "", "real_tags": ["电子邮件", "email"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005127, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本文翻译成越南语，网址为：Bên Trong Chípđịnh thờI555.。\n如果你玩过电子电路，你可能知道[1]555定时器集成电路，据说是世界上最畅销的集成电路，销量达数十亿美元。由模拟IC奇才汉斯·卡门辛德于1970年设计的555被称为有史以来最伟大的芯片之一，全书都致力于555定时器电路。鉴于555定时器很受欢迎，我想了解一下555定时器的内部结构和工作原理会很有趣。虽然555定时器通常以黑色塑料IC的形式出售，但也有金属罐，可以用钢锯切开金属罐，露出里面的小骰子。在555定时器里。封装中的小芯片通过导线连接到8个管脚上。\n555定时器有数百种应用，从定时器或锁存器到压控振荡器或调制器。下图说明了555定时器是如何作为简单振荡器运行的。在555芯片内部，三个电阻器形成一个分频器，产生电源电压的1/3和2/3的参考电压。外部电容器将在这些限制之间充放电，从而产生振荡。更详细地说，电容器将通过外部电阻器缓慢充电(A)，直到其电压达到2/3参考电压。这会打开放电晶体管，慢慢地将电容器(C)放电。当电容器上的电压达到1/3参考电压(D)时，下(触发)比较器打开，设置触发器和输出，循环重复。电阻和电容的值控制计时，从微秒到小时。[4]总而言之，555定时器的关键部件是用于检测电压上限和下限的比较器、用于设置这些限值的三电阻分频器，以及用于跟踪电路是充电还是放电的触发器。555定时器还有另外两个引脚(复位和控制电压)，这两个引脚是我上面没有介绍过的；它们可以用于更复杂的电路。(=。下面的照片通过显微镜展示了555的硅晶片，在硅片的顶部，有一层薄薄的金属连接着芯片的不同部分。这种金属在照片中清晰可见，为黄白色的痕迹和区域。在金属下面，一层薄薄的玻璃状二氧化硅层在金属和硅之间提供了绝缘，除非二氧化硅上的接触孔允许金属连接到硅。在芯片的边缘，细线将金属焊盘连接到芯片的外部引脚上。芯片上的不同类型的硅更难被看到，芯片的各个区域被杂质处理(掺杂)以改变硅的电学性质。N型硅有多余的电子(负极)，而P型硅没有电子(正极)。在照片中，这些区域的颜色略有不同，周围环绕着薄薄的黑色边框。这些区域是芯片的积木，形成晶体管和电阻。晶体管是芯片中的关键部件。555定时器使用NPN和PNP双极晶体管。如果你学过电子学，你可能见过下面这样的NPN晶体管示意图，图中显示了晶体管的集电极(C)、基极(B)和发射极(E)，晶体管被描绘成位于两层对称的N硅层之间的P硅夹层；N-P-N层构成了NPN晶体管。事实证明，芯片上的晶体管看起来一点也不像这个，而基极。NPN晶体管的原理图符号，以及其内部结构的过于简化的示意图。\n下面的照片显示了555中的一个晶体管，就像它在芯片上显示的那样。硅中略有不同的色调表示已经掺杂形成N区和P区的区域。白黄色区域是芯片上的金属层-这些金属层形成了连接到集电极、发射极和基极的导线。你可以通过它的牛眼结构在芯片上发现发射器，而基座矩形围绕着发射器。555定时器芯片中的NPN晶体管。集电极(C)、发射极(E)和基极(B)连同N和P掺杂的硅一起被标记。\n照片下面是一张横断面图，说明了晶体管是如何构造的。这不仅仅是你在书中看到的N-P-N三明治，但如果你仔细观察下面的垂直横截面，你就会发现构成晶体管的N-P-N。发射极(E)线连接到N+硅。其下方是连接到基触点(B)的P层。并且在其下方是(间接地)连接到集电极(C)的N+层。[5]晶体管被将其与相邻元件隔离的P+环包围。你可能会期望\n有一些子电路在模拟IC中非常常见，但乍看起来可能很神秘。电流镜就是其中之一。如果您看过模拟IC框图，您可能已经看到下面的符号，表示电流源，并想知道什么是电流源，以及为什么要使用电流源。这个想法是，你从一个已知的电流开始，然后你可以用一个简单的晶体管电路，即电流镜，克隆出该电流的多个副本。下面的电路显示了如何使用两个相同的晶体管实现电流镜。[6]参考电流通过左边的晶体管。(在这种情况下，电流由电阻器设置。)。由于两个晶体管具有相同的发射极电压和基极电压，因此它们提供相同的电流，因此右边的电流与左边的参考电流相匹配。电流镜的一个常见用途是代替电阻器。如前所述，IC内部的电阻器既大得不方便，又不准确。只要有可能，使用电流镜而不是电阻器可以节省空间。此外，与两个电阻器产生的电流不同，电流镜产生的电流几乎相同。在555定时器芯片中，三个晶体管构成一个电流镜。它们都共享同一基极，两个晶体管共享发射器。\n上面的三个晶体管形成一个有两个输出的电流镜。请注意，三个晶体管共享基极连接，连接到右侧的集电极，右侧的发射器连接在一起。左边的晶体管是Widlar电流源，这是一种改装后的反射镜，可以产生更小的电流。在示意图上，右边的两个晶体管被画成单个双集电极晶体管Q19。第二个需要了解的重要电路是差分对，这是模拟IC中使用的最常见的双晶体管子电路。[7]您可能想知道比较器如何比较两个电压，或者运算放大器如何将两个电压相减。这是差分对的工作。一种简单的差分对电路原理图。电流吸收器通过差动对发送固定电流I。如果两个输入相等，则电流在两个支路之间平均分配。否则，具有较高输入电压的支路获得大部分电流。\n上面的示意图显示了一个简单的差分对。底部的电流吸收器提供在两个输入晶体管之间分割的固定电流I。如果输入电压相等，则电流将平均分成两个支路(I1和I2)。如果一个输入电压比另一个高一点，相应的晶体管将传导更多的电流，因此一个支路获得更多的电流，而另一个支路的电流变小。很小的输入差异就足以将大部分电流引导到获胜的支路中，从而使比较器打开或关闭。在555中，阈值比较器使用NPN晶体管，而触发比较器使用PNP晶体管。这允许阈值比较器工作在电源电压附近，而触发比较器工作在地附近。555&#39；的比较器还在每个输入(达林顿对)上使用两个晶体管来缓冲输入。下面的555芯片照片和原理图[8]是交互的。点击芯片或原理图中的组件，将显示该组件的简要说明。(有关555定时器如何工作的详细讨论，请参阅555工作原理。)。为了快速概述一下，大输出晶体管和放电晶体管是芯片上最明显的特点。阈值比较器由Q1到Q8组成。触发比较器由Q10至Q13以及电流镜Q9.Q16和Q17组成触发器。构成分压器的三个5K&Amp；欧姆电阻器位于芯片的中间。[9]城市传说说，555是以这三个5K电阻器命名的，但根据其设计者的说法，555只是500芯片系列集成电路中的一个任意数字，通常装在黑色环氧树脂封装中，需要危险的浓酸才能打开。相反，我买了一个装在金属罐里的555(见下图)。为了检查芯片，我使用了冶金显微镜。与标准显微镜不同的是，冶金显微镜通过镜头向下照射光线，使其可以处理不透明的物体(如碎片)。我与胡金(细节)将照片缝合在一起。考虑到555的受欢迎程度，令人惊讶的是，它有几个新手设计缺陷：不平衡的比较器，大的工作电流，不对称的输出波形，以及温度敏感度。[10]1997年，卡门辛德重新设计了555，以创造一种更好的芯片，可以在更低的电压下运行。改进后的芯片被Zetex作为ZSCT1555销售，但不幸的是失败了。最初555的持续成功和改进后的继任者的失败可以视为更坏就是更好原则的一个例子。我希望你", "note_en": "This article is translated into Vietnamese at:  Bên trong chíp định thời 555.\n If you&#39;ve played around with electronic circuits, you probably know [1]the 555 timer integrated circuit,said to be the world&#39;s best-selling integrated circuitwith billions sold.Designed by analog IC wizard Hans Camenzind [2] in 1970, the 555 has been called one of the greatest chips of all time withwhole books devoted to 555 timer circuits. Given the popularity of the 555 timer, I thought it would be interesting to find out what&#39;s inside the 555 timer and how it works.While the 555 timer is usually sold as a black plastic IC, it is also available in a metal can, which can be cut open with a hacksaw [3]revealing the tiny die inside. Inside the 555 timer. The tiny die in the package is connected to the 8 pins by wires.\n The 555 timer has hundreds of applications, operating as anything from a timer or latch to a voltage-controlled oscillator or modulator.The diagram below illustrates how the 555 timer operates as a simple oscillator.Inside the 555 chip, three resistors form a divider generating references voltages of 1/3 and 2/3 of the supply voltage.The external capacitor will charge and discharge between these limits, producing an oscillation.In more detail, the capacitor will slowly charge (A) through the external resistors until its voltage hits the 2/3 reference.At that point (B), the upper (threshold) comparator switches the flip flop off and the output off. This turns on the discharge transistor, slowly discharging the capacitor (C). When the voltage on the capacitor hits the 1/3 reference (D), the lower (trigger) comparator turns on, setting the flip flop and the output, and the cycle repeats. The values of the resistors and capacitor control the timing, from microseconds to hours. [4] To summarize, the key components of the 555 timer are the comparators to detect the upper and lower voltage limits, the three-resistor divider to set these limits, and the flip flop to keep track of whether the circuit is charging or discharging.The 555 timer has two other pins (reset and control voltage) that I haven&#39;t covered above; they can be used for more complex circuits. The photo below shows the silicon die of the 555 through a microscope.On top of the silicon, a thin layer of metal connects different parts of the chip. This metal is clearly visible in the photo as yellowish-white traces and regions. Under the metal, a thin, glassy silicon dioxide layer provides insulation between the metal and the silicon, except where contact holes in the silicon dioxide allow the metal to connect to the silicon. At the edge of the chip, thin wires connect the metal pads to the chip&#39;s external pins. The different types of silicon on the chip are harder to see.Regions of the chip are treated ( doped) with impurities to change the electrical properties of the silicon. N-type silicon has an excess of electrons (negative), while P-type silicon lacks electrons (positive).In the photo, these regions show up as a slightly different color surrounded by a thin black border.These regions are the building blocks of the chip, forming transistors and resistors. Transistors are the key components in a chip. The 555 timer uses NPN and PNP bipolar transistors.If you&#39;ve studied electronics, you&#39;ve probably seen a diagram of an NPN transistor like the one below, showing the collector (C), base (B), and emitter (E) of the transistor, The transistor is illustrated as a sandwich of P silicon in between two symmetric layers of N silicon; the N-P-N layers make an NPN transistor.It turns out that transistors on a chip look nothing like this, and the base often isn&#39;t even in the middle! Schematic symbol for an NPN transistor, along with an oversimplified diagram of its internal structure.\n The photo below shows one of the transistors in the 555 as it appears on the chip.The slightly different tints in the silicon indicate regions that has been doped to form N and P regions.The whitish-yellow areas are the metal layer of the chip on top of the silicon - these form the wires connecting to the collector, emitter, and base. You can spot an emitter on the chip by its &#34;bullseye&#34; structure, while the base rectangle surrounds the emitter. An NPN transistor in the 555 timer chip. The collector (C), emitter (E) and base (B) are labeled, along with N and P doped silicon.\n Underneath the photo is a cross-section drawing illustrating how the transistor is constructed. There&#39;s a lot more than just the N-P-N sandwich you see in books, but if you look carefully at the vertical cross section below the &#39;E&#39;, you can find the N-P-N that forms the transistor. The emitter (E) wire is connected to N+ silicon. Below that is a P layer connected to the base contact (B). And below that is an N+ layer connected (indirectly) to the collector (C). [5]The transistor is surrounded by a P+ ring that isolates it from neighboring components. You might expect PNP transistors to be similar to NPN transistors, just swapping the roles of N and P silicon. But for a variety of reasons, PNP transistors have an entirely different construction.They consist of a small circular emitter (P), surrounded by a ring shaped base (N), which is surrounded by the collector (P). This forms a P-N-P sandwich horizontally (laterally), unlike the vertical structure of the NPN transistors. The diagram below shows one of the PNP transistors in the 555, along with a cross-section showing the silicon structure.Note that although the metal contact for the base is on the edge of the transistor, it is electrically connected through the N and N+ regions to its active ring in between the collector and emitter.A metal line is routed between the collector and base, but is not part of the transistor. A PNP transistor in the 555 timer chip. Connections for the collector (C), emitter (E) and base (B) are labeled, along with N and P doped silicon. The base forms a ring around the emitter, and the collector forms a ring around the base.\n The output transistors in the 555 are much larger than the other transistors and have a different structure in order to produce the high-current output. The photo below shows one of the output transistors. Note the multiple interlocking &#34;fingers&#34; of the emitter and base, surrounded by the large collector. A large, high-current NPN output transistor in the 555 timer chip. The collector (C), base (B) and emitter (E) are labeled.\n Resistors are a key component of analog chips. Unfortunately, resistors in ICs are large and inaccurate; the resistances can vary by 50% from chip to chip. Thus, analog ICs are designed so only the ratio of resistors matters, not the absolute values, since the ratios remain nearly constant. A resistor inside the 555 timer. The resistor is a strip of P silicon between two metal contacts.\n The photo above shows a 1K&amp;ohm resistor in the 555, formed from a strip of P silicon (visible as an outline). Note that the resistor connects two metal wires and another metal wire crosses it.The resistor below is an L-shaped 100K&amp;ohm  pinch resistor.A layer of N silicon on top of the pinch resistor makes the conductive region much thinner (i.e. pinches it), forming a much higher but less accurate resistance. A pinch resistor inside the 555 timer. The resistor is a strip of P silicon between two metal contacts. An N layer on top pinches the resistor and increases the resistance.\n There are some subcircuits that are very common in analog ICs, but may seem mysterious at first. The current mirror is one of these.If you&#39;ve looked at analog IC block diagrams, you may have seen the symbols below, indicating a current source, and wondered what a current source is and why you&#39;d use one. The idea is you start with one known current and then you can &#34;clone&#34; multiple copies of the current with a simple transistor circuit, the current mirror. The following circuit shows how a current mirror is implemented with two identical transistors. [6] A reference current passes through the transistor on the left. (In this case, the current is set by the resistor.) Since both transistors have the same emitter voltage and base voltage, they source the same current, so the current on the right matches the reference current on the left. A common use of a current mirror is to replace resistors. As explained earlier, resistors inside ICs are both inconveniently large and inaccurate. It saves space to use a current mirror instead of a resistor whenever possible. Also, the currents produced by a current mirror are nearly identical, unlike the currents produced by two resistors. Three transistors form a current mirror in the 555 timer chip. They all share the same base and two transistors share emitters.\nThe three transistors above form a current mirror with two outputs. Note the three transistors share the base connection, tied to the collector on the right, and the emitters on the right are tied together. The transistor on the left is a  Widlar current source, a modified mirror that produces a smaller current. On the schematic, the two transistors on the right are drawn as a single two-collector transistor, Q19. The second important circuit to understand is the differential pair, the most common two-transistor subcircuit used in analog ICs. [7]You may have wondered how a comparator compares two voltages, or an op amp subtracts two voltages. This is the job of the differential pair. Schematic of a simple differential pair circuit. The current sink sends a fixed current I through the differential pair. If the two inputs are equal, the current is split equally between the two branches. Otherwise, the branch with the higher input voltage gets most of the current.\n The schematic above shows a simple differential pair. The current sink at the bottom provides a fixed current I, which is split between the two input transistors. If the input voltages are equal, the current will be split equally into the two branches (I1 and I2). If one of the input voltages is a bit higher than the other, the corresponding transistor will conduct more current, so one branch gets more current and the other branch gets less.A small input difference is enough to direct most of the current into the &#34;winning&#34; branch, flipping the comparator on or off. In the 555, the threshold comparator uses NPN transistors, while the trigger comparator uses PNP transistors. This allows the threshold comparator to work near the supply voltage and the trigger comparator to work near ground. The 555&#39;s comparators also use two transistors on each input ( Darlington pair) to buffer the inputs. The 555 die photo and schematic [8]below are interactive. Click on a component in the die or schematic, and a brief explanation of the component will be displayed.(For a thorough discussion of how the 555 timer works, see 555 Principles of Operation.) For a quick overview, the large output transistors and discharge transistor are the most obvious features on the die. The threshold comparator consists of Q1 through Q8. The trigger comparator consists of Q10 through Q13, along with current mirror Q9.Q16 and Q17 form the flip flop. The three 5K&amp;ohm resistors forming the voltage divider are in the middle of the chip. [9]Urban legend says that the 555 is named after these three 5K resistors, but according to its designer555 is just an arbitrary number in the 500 chip series Integrated circuit usually come in a black epoxy package which require inconveniently dangerous  concentrated acid to open.Instead, I bought a 555 in a metal can (below).To examine the die, I used a  metallurgical microscope. Unlike a standard microscope, the metallurgical microscope shines light down through the lens allowing it to work with opaque objects (such as chips).I stitched the photos together with Hugin ( details). Given the popularity of the 555, it&#39;s surprising that it has several rookie design flaws; unbalanced comparators, large operating currents, an asymmetric output waveform, and temperature sensitivity. [10] In 1997, Camenzind redesigned the 555 to create a much better chip that could run at much lower voltages.The improved chip was sold by Zetex as the ZSCT1555, but unfortunately was a flop.The continuing success of the original 555 and the failure of the improved successor can be viewed as an example of the  worse is better principle. I hope you&#39;ve found this look inside the 555 timer chip interesting.Next time you&#39;re building a  555 project, you&#39;ll know exactly what&#39;s inside the chip.If you enjoyed this article, I&#39;ve also reverse-engineered the 741 op amp and 7805 voltage regulator.Thanks to Eric Schlaepfer [11] for helpful comments. Follow me on Twitter and you won&#39;t miss an article!  [1]The 555 timer is iconic enough to appear on mugs,  bags, caps and t-shirts. [2]The book  Designing Analog Chips written by the 555&#39;s inventor Hans Camenzind is really interesting, and I recommend it if you want to know how analog chips work.Chapter 11 has an extensive discussion of the 555&#39;s history and operation. Page 11-3 claims the 555 has been the best-selling IC every year, although I don&#39;t know if that is still true.The free PDF is  hereor get the book. [3]You can cut an IC can open with a plain hacksaw, but a jeweler&#39;s saw gives a much cleaner cut. I got a jeweler&#39;s saw on eBay for $14, and used the #2 blade. Make sure you cut near the top of the IC so you don&#39;t hit the die as I did. [4]The brilliant part of the 555 timer is that the oscillation frequency depends only on the external resistors and capacitor and is insensitive to the supply voltage. If the supply voltage drops, the 1/3 and 2/3 references drop too, so you might expect the oscillations to be faster. But the lower voltage charges the capacitor more slowly, canceling this out and keeping the frequency constant. This voltage insensitivity is so tricky that the chip&#39;s designer didn&#39;t figure it out until near the end of the 555&#39;s design,but it made a big difference.The original design was more complex and required nine pins, which is a terrible size for an ICsince there are no packages between 8 and 14 pins.The final, simpler 555 design worked with 8 pins, making the chip&#39;s packaging much cheaper.(See page 11-3 of  Designing Analog Chips for the full story.) [5]You might have wondered why there is a distinction between the collector and emitter of a transistor, when the typical diagram of a transistor is symmetrical.As you can see from the die photo, the collector and emitter are very different in a real transistor. In addition to the very large size difference, the silicon doping is different. The result is a transistor will have  poor gain if the collector and emitter are swapped. [6]For more information about current mirrors, check  wikipedia, any analog IC book, or chapter 3 of Designing Analog Chips. [7]Differential pairs are also called long-tailed pairs.According to Analysis and Design of Analog Integrated Circuitsdifferential pairs are &#34;perhaps the most widely used two-transistor subcircuits in monolithicanalog circuits.&#34; (p214)For more information about differential pairs, see  wikipedia, any analog IC book, or chapter 4 of Designing Analog Chips. [8]The 555 schematic used in this article is from the  Philips datasheet. [9]Note that the three resistors for the voltage divider are parallel and next to each other.This helps ensure they have the same resistance even if there are electrical variations across the silicon. [10]I&#39;m not criticizing the 555; Hans Camenzind points out the design flaws and attributes them to &#34;the early periodof IC design (and the inexperience of a rookie designer)&#34;;see Designing Analog Chips, page 11-4.The design of a 555 replacement is discussed in detail in &#34;Redesigning the old 555&#34;, IEEE Spectrum, September 1997.That article makes it clear how much much faster IC design is now than in 1970.It took months to create the layout of the 555 chip by hand and manually verify it for correctness.The new chip took two days to layout and 20 minutes to verify. [11]Evil Mad Scientist sells a very cool  discrete 555 timer kit, duplicating the 555 circuit on a larger scale with individual transistors and resistors — it actually works as a 555 replacement.Their  555 footstool is also worth a look.", "posttime": "2020-06-04 17:30:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "定时器,teardown,晶体管", "title": "定时器拆卸：最受欢迎的IC内部(2016)", "title_en": "Timer teardown: inside the most popular IC (2016)", "transed": 1, "url": "http://www.righto.com/2016/02/555-timer-teardown-inside-worlds-most.html", "via": "", "real_tags": ["定时器", "teardown", "晶体管"]}, {"category": "", "categoryclass": "", "imagename": "0a8ca618f9a91e886b4debfab6978624.png", "infoid": 1005124, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "古代艺术家使用了几种技术在岩石上绘制图像。有时他们用手画画，但有时他们会把手、树叶或回旋镖等物体放在墙上，然后用油漆飞溅，在物体的轮廓周围留下一束颜色的喷雾。这听起来像是一种简单的艺术创作方式，但有新的证据表明，这可能是一个相当复杂的过程。澳大利亚北部的人们似乎用蜂蜡塑造了微型模板，用来在利门国家公园伊尔比林吉岩石避难所的墙壁上作画。\n这些微缩图像是伊尔比林吉屋顶和后墙上名副其实的岩石艺术画廊的一部分。几千年来，人们来到这里，用醒目的红色、黄色、黑色和白色来描绘人、动物、物体、轨迹、圆点和几何图案。其中甚至还有一根欧洲烟斗，这表明至少有一些画作肯定是殖民者到达后创作的。\n在355幅画在墙上的图像中，只有59幅是模板-被喷洒的白色颜料(可能是当地高岭土制成)包围的完整大小的手和前臂的轮廓。但是这些模板中有17个太小了，不能用通常的方法来完成，就是用油漆溅出一个实物大小的物体，在墙上留下一个真人大小的轮廓。它们描绘的是人-有时手持回飞镖和盾牌，或者戴着头饰-螃蟹，针鼠，至少两种海龟，袋鼠爪印和几何形状。\n除了印度尼西亚的一个洞穴墙上和澳大利亚新南威尔士州的一个岩石庇护所里的一个微小的人物之外，这些微型模版油画是世界上仅有的几幅此类油画中的一幅。\n当然，古人留下的大部分素描和绘画都比真人大小，但画一个缩小版的奥罗奇或一个人要比用模版画容易得多。除非你先花时间给自己做一个模型或模板。而这似乎正是伊尔比林吉的艺术家们所做的-那里传统上是马拉人的领地。\n考古学家和人类学家与马拉护林员一起工作时注意到，大多数微型模板的边缘都是圆形的，看起来就像是喷洒在与岩石轮廓完全吻合的东西上。这表明模板可能是软的、容易成型的东西，比如粘土、树脂或蜂蜡。而蜂蜡看起来是最有可能的选择。\n今天，马拉人和澳大利亚北部的其他人仍然使用蜂蜡作为粘合剂来修理长矛、鱼叉和其他工具；大多数人都会携带一团蜂蜡作为个人装备的一部分，以防万一。但孩子们也携带蜂蜡，他们把蜂蜡塑造成动物、人和其他物体--可以把它想象成有机游乐团。弗林德斯大学考古学家利亚姆·布雷迪(Liam Brady)和他的同事们想知道，蜂蜡形状是否也可以用来在岩石上制作模板，所以他们决定自己玩一些蜂蜡。\n当它温暖而柔软的时候，只需要几分钟的时间就可以把蜂蜡塑造成各种形状，看起来就像伊比林吉的模板。布雷迪和他的同事们把他们的蜂蜡模板粘在一块砂岩上，然后用白色高岭土粘土和水喷洒油漆。结果看起来很像伊比林吉的画。\n这表明蜂蜡是可以工作的--但伊比林吉的艺术家们真的是这样制作他们的微型模板的吗？布雷迪和他的同事们没有确定这些画的年代，也没有测试岩石掩体的墙壁上是否有蜂蜡、树脂或其他柔软、粘性材料的微观痕迹，但他们希望在以后的旅行中带着合适的设备回来。\n这些模板的意思比它们是如何制作的更难理解。布雷迪和他的同事们写道：“我们没有从玛拉的合作者那里获得任何关于潜在意义或意义的信息。”\n对于玛拉人来说，伊尔比林吉避难所是一个与卡里马拉(Karrimala)有关的地方，卡里马拉是梦幻时间期间穿越澳大利亚创造大陆地貌、植物、动物和人的祖先之一。卡里马拉创造了这个岩石避难所，并以一条彩绘的蛇的形式把自己放在墙上。过去人们住在伊尔比林吉；岩石避难所的地板上仍然散落着石器、研磨石和一个石环壁炉。\n在林门国家公园的另一个岩石避难所，布雷迪和他的同事们发现墙上仍然粘着一些小的蜂蜡雕像。与考古学家一起工作的马拉人告诉他们，这些人物参与了一个特定的仪式，他们甚至在谈论这个仪式时都很紧张。马拉人告诉布雷迪和他的同事，那些家庭与某些地方有正确联系，知道该唱什么歌的人，可以利用这些地方墙上的图像神奇地攻击他们的敌人。\n但他们也告诉考古学家，伊尔比林吉岩石避难所并不是与这类事情有关的遗址。\n这项研究的合著者之一、弗林德斯大学考古学家阿曼达·科尔尼说：“这里重要的是，这一发现为澳大利亚和全球的岩石艺术记录增加了另一个维度。”", "note_en": "Ancient artists used several techniques to paint images on rock. Sometimes they drew by hand, but other times they would place an object like a hand, a leaf, or a boomerang against the wall and spatter it with paint, leaving behind a spray of color surrounding a silhouette of the object. This may sound like a simple way to produce art, but there&#39;s new evidence that it could be a fairly complex process. People in northern Australia seem to have used beeswax to shape miniature stencils to paint on the walls of Yilbilinji Rock Shelter in Limmen National Park.\n  The miniature images are part of a veritable gallery of rock art on the roof and rear walls of Yilbilinji. Over thousands of years, people came here to paint people, animals, objects, tracks, dots, and geometric motifs in striking red, yellow, black, and white. There’s even a European smoking pipe in the mix, which shows that at least some of the paintings must have been created after the colonists arrived.\n Out of 355 images painted on the walls, only 59 are stencils—outlines of full-sized hands and forearms surrounded by sprays of white pigment (probably made with local kaolin clay). But 17 of those stencils are too small to have been done the usual way, by spattering an actual object with paint to leave a life-sized outline on the wall. They depict people—sometimes holding boomerangs and shields or wearing headdresses—crabs, echidna, at least two species of turtle, kangaroo pawprints, and geometric shapes.\n And those miniature stenciled paintings are some of the only ones of their kind in the world, except for a tiny human figure stenciled on a cave wall in Indonesia and one in a rock shelter in New South Wales, Australia.\n Of course, most of the drawings and paintings left behind by ancient people are smaller than life-size, but it’s much easier to draw a scaled-down version of an aurochs or a person than it is to  stencil one. Unless you take the time to make yourself a model or template first, that is. And that seems to be exactly what the artists at Yilbilinji—which is traditionally the domain of the Marra people—did.\n     Archaeologists and anthropologists, working with Marra rangers, noticed that most of the miniature stencils had rounded edges, and it looked like they had been sprayed over something that fit flush against the contours of the rock. That suggested the templates may have been something soft and easily molded, like clay, resin, or beeswax. And beeswax looks like the most likely option.\n Today, the Marra and other people in northern Australia still use beeswax as an adhesive to repair spears, harpoons, and other tools; most men carry a ball of beeswax as part of their personal kit, just in case. But children also carry beeswax, which they mold into animals, people, and other objects—think of it as organic play-dough. Flinders University archaeologist Liam Brady and his colleagues wanted to find out if beeswax shapes could also be used to create stencils on rock, so they decided to play with some beeswax themselves.\n When it was warm and soft, it only took a couple of minutes to mold the beeswax into a variety of shapes that looked like the stencils at Yilbilinji. Brady and his colleagues stuck their beeswax templates onto a slab of sandstone, then spattered it with paint from white kaolin clay and water. The results looked a lot like the Yilbilinji paintings.\n That suggests beeswax could work—but is that really how the Yilbilinji artists made their miniature stencils? Brady and his colleagues didn’t get to date the paintings or test the rock shelter’s walls for microscopic traces of beeswax, resin, or some other soft, sticky material, but they hope to come back with the right equipment on a later trip.\n  The stencils’ meaning is harder to figure out than how they were made. “No information about the potential meaning or significance was obtained from our Marra collaborators,” wrote Brady and his colleagues.\n For the Marra, Yilbilinji Rock Shelter is a site associated with Karrimala, one of the Ancestral Beings who travelled through Australia during the Dreamtime to create the continent’s landforms, plants, animals, and people. Karrimala created the rock shelter and placed himself on the wall in the form of a painted snake. People lived at Yilbilinji in the past; the floor of the rock shelter is still littered with stone tools, grinding stones, and a stone-ringed fireplace.\n At another rock shelter in Limmen National Park, Brady and his colleagues found small beeswax figures still stuck to the walls. The Marra men working with the archaeologists told them those figures were involved in a certain ritual, one they were nervous even talking about. Men whose families had the right connections to certain places, and who knew the right songs to sing, could use images on those places’ walls to magically attack their enemies, the Marra men told Brady and his colleagues.\n But they also told the archaeologists that Yilbilinji Rock Shelter isn’t a site associated with that sort of thing.\n “What is important here is that this discovery adds another dimension to the Australian and global rock art record,” said Flinders University archaeologist Amanda Kearney, a co-author of the study.", "posttime": "2020-06-04 16:39:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "艺术,澳大利亚,miniature,蜂蜡", "title": "澳大利亚发现罕见的微型岩石艺术", "title_en": "Rare miniature rock art found in Australia", "transed": 1, "url": "https://arstechnica.com/science/2020/06/rare-miniature-rock-art-found-in-australia/", "via": "", "real_tags": ["艺术", "澳大利亚", "miniature", "蜂蜡"]}, {"category": "", "categoryclass": "", "imagename": "0139e1722a306a4c386226bbcd830c30.jpg", "infoid": 1005123, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "夏日节日？不，今年夏天最壮观的舞台时刻应该是克拉夫特沃克与国际空间站的现场即兴表演-以及作为太空中第一件电子乐器的iPad。\n看一看(德语文本，带英语字幕)-并找出《近距离接触》中的即兴小品：\n在聚集在斯图加特的人群面前，格斯特从国际太空前哨宣布：\n我是太空中仅有的六个人之一，在人类的前哨--海拔400公里的国际空间站国际空间站(International Space Station ISS)上。国际空间站是一台人类机器--人类有史以来建造的最复杂、最有价值的机器。\n在欧洲哥伦布实验室，也就是空间实验室的继任者，欧洲航天局欧空局正在研究将改善地球日常生活的东西。100多个不同的国家在这里和平合作，实现了单个国家永远无法实现的目标。我们正在开发国际空间站上的技术，以超越我们目前的视野，并准备向太空、月球和火星迈出进一步的步伐。\n这个项目是ESA和Kraftwerk的Henning Schmitz的创意，是乐队和经纪公司个人关系的一部分，Kraftwerk提供了大量的技术支持来实现这一目标。\n我与欧洲航天局进行了交谈，以了解更多关于发生了什么的情况。\niPad上的软件是亨宁·施密茨(Henning Schmitz)为格斯特博士定制的，特别是为了这次活动，然后送上了轨道。\niPad本身在6月底乘坐SpaceX发射的补给任务CRS-15前往国际空间站。(俄罗斯在联盟号上发射的进步号运载火箭也为国际空间站提供供应；美国目前在猎鹰9号上使用龙。)。\n这款应用程序是Lemur，这款里程碑式的触控应用程序，背后有另一个软合成器发出声音。(ESA没有公开另一款应用的身份。)。从最初的硬件版本开始，Kraftwerk就被发现使用狐猴；在这里，优势在于简化了性能界面。(太多的iPad软合成有点麻烦；通过对比，你可以看到它的工作效果有多好。)。\n国际空间站的运行速度接近28,000公里/小时，或者说每92分钟绕地球一圈。你可以在欧空局的网站上追踪它的轨道。这意味着向空间站发送信号和从空间站接收信号是一个巨大的挑战。卫星网络处理来自空间站的音频和视频，外加一个简单的音频反馈给空间站，它只能可靠地保持信号大约20分钟，然后才能将其移交给另一颗卫星。辍学和问题很常见。\n换句话说，欧空局告诉我们，宇航员是“非常棒的演员”。他们只是得到一个基本的入耳式音频馈送，没有视频，并设法让人感觉他们只是随意地通过Skype给你打电话。\nAV信号上也有3-5秒的延迟。因此，为了让即兴表演现场直播，格斯特以独奏为首，克拉夫特沃克紧随其后，并附上了来自空间站的音频。(这样观众就不会有延迟，因为信号从来不会往返。)。格斯特本人基本上是孤立的-一部固定电话将来自斯图加特的馈送连接到休斯顿的NASA控制中心和音频控制室，并一直连接到车站，只给了他一些基本的音频。欧空局和克拉夫特沃克的音响技师在门前，为了避免反馈循环，仍然需要使用混音器衰减器。\n但结果是一场真正的即兴表演。因此，这代表着两个第一：既是太空中的第一件电子乐器，也是地球和轨道之间的第一次现场音乐即兴演奏。\n会场是爵士乐公开节，斯图加特有7500人参加。(因此，当不明飞行物在这座城市的电视塔上空飞过时，人们发出了欢呼声。)。\n亚历山大·格斯特博士既是一名地球物理学家，也是一名宇航员。这是他第二次前往国际空间站执行任务，从2018年6月6日到12月中旬，他将进入太空，并将在这段时间的后半段担任空间站的指挥官，这项任务名为“远征57号”(Expedition 57)。这将使他成为继弗兰克·德·温(Frank De Winne)在第21次远征中担任指挥权之后，第二位担任指挥的欧空局宇航员。(后者让我有幸与之共进晚餐，这要归功于欧空局。当然，我问他关于声音的问题。他的回答是：空间站的声音几乎震耳欲聋，可能不是你在看完《星际迷航：下一代》(Star Trek：The Next Generation)后脑海中发出的柔和咕噜声--俄罗斯部分声音最大，因为它存放着特殊的设备。不过，他们也使用声音作为设备工作情况的一种诊断。)\n另外，如果你看过“火星人”，亚历克斯·沃格尔(Alex Vogel)这个角色从现实生活中的格斯特博士那里汲取了一些元素。\n克拉夫特沃克当然有他们自己的曲目“太空实验室”(1978)。这个名字来自于20世纪70年代开发的一个研究实验室，该实验室是美国国家航空航天局(NASA)和欧洲航天局(ESRO)前身ESRO的联合项目。欧空局告诉我们，格斯特博士现在所处的环境，即欧空局的哥伦布实验室舱，是该项目的直系后代。它是一个巨大的75立方米(嗯，当你把它发射到太空时是巨大的)，里面挤满了处理空间科学、地球观测和技术、材料科学等方面的研究设备。\n所以你得到的是科学和文化的融合，都在欧洲范围内。", "note_en": "Summer festivals? No, the most epic onstage moment for this summer has to be Kraftwerk jamming live with the International Space Station – and an iPad as the first electronic musical instrument in space.\n Take a look (German-language text with English-language subtitles) – and spot the riff from  Close Encounters:\n  In front of a crowd gathered in Stuttgart, Gerst announces from the international space outpost:\n I am one of only six people in space, on the outpost of humanity, the International Space Station ISS, 400 kilometers above sea level. The ISS is a Man Machine – the most complex and valuable machine humankind has ever built.\n Here in the European Columbus laboratory, the successor to the Spacelab, the European Space Agency ESA is researching things that will improve daily life on Earth. More than 100 different nations work together peacefully here and achieve things that a single nation could never achieve. We are developing technologies on board the ISS to grow beyond our current horizons and prepare to take further steps into space, to the Moon and Mars.\n The project was the brainchild of ESA and Kraftwerk’s Henning Schmitz, part of a personal relationship between the band and the agency, with Kraftwerk providing a whole lot of the technical support to make it happen.\n I spoke with the European Space Agency to find out more about what took place.\n  The software on the iPad was custom-configured for Dr. Gerst by Henning Schmitz, especially for this event, and then sent to orbit.\n The iPad itself made its way to ISS on the SpaceX-launched supply mission  CRS-15 at the end of June. (Russian Progress vehicles launched on Soyuz also supply the ISS; the USA uses Dragon atop Falcon 9 at the moment.)\n The app is  Lemur, the landmark touch control app, with another soft synth behind it making the sound. (ESA are not making public the identity of the other app.) Kraftwerk have been spotted using Lemur since the original hardware version; here, the advantage is a simplified performance interface. (Too many iPad soft synths get a bit fiddly; you can see how nicely this works live by contrast.)\n The ISS travels at nearly 28,000 km/hour, or one trip around the Earth every 92 minutes. You can track its orbit on  ESA’s site. That means getting signal to and from the space station is a big challenge. A network of satellites handle audio and video from the space station, plus a simple audio feed back to the station, and it can only maintain a signal reliably for about 20 minutes before it has to be handed off to another satellite. Dropouts and problems are common.\n The astronauts are “terrific actors,” in other words, ESA tells us. They are just getting a basic in-ear audio feed and no video, and manage to make it feel as though they’re just casually Skype calling you.\n There’s 3-5 seconds latency on the AV signal, too. So to make the jam session live, Gerst led with the solo, and Kraftwerk followed along with the audio from the space station. (There’s then no latency for the audience, because the signal never makes a round trip.) Gerst himself basically was isolated – a landline telephone linked the feed from Stuttgart back to the NASA control center and audio control room in Houston and up to the station, giving him just some basic audio. ESA were at front of house with Kraftwerk’s audio technician, and it was still necessary to ride mixer faders to avoid a feedback loop.\n But the result is a genuine improvisation. As such this represents two firsts: both the first electronic instrument in space, and the first live musical jam session between Earth and orbit.\n   The venue is the Jazz Open Festival, with a crowd of 7500 people in Stuttgart. (Hence the cheers as a UFO flies above the TV tower in the city.)\n Dr. Alexander Gerst is a geophysicist as well as astronaut. This is his second mission to the ISS, and puts him in space from 6 June to the middle of December, 2018, and will be the commander of the space station during the second half of that stay, the mission called Expedition 57. That will make him only the second ESA astronaut to take command, after Frank de Winne on Expedition 21. (The latter I’ve had the pleasure to have dinner with, thanks to ESA. I asked him about sound, of course. His answer: the space station is almost deafeningly loud, not perhaps the soft purr you have in mind after watching  Star Trek: The Next Generation – the Russian section being loudest of all, because of particular equipment it stores. They also use sound as one diagnostic for how equipment is working, though.)\n Plus if you’ve seen  The Martian, the character of Alex Vogel draws some elements from the real-life Dr. Gerst.\n Kraftwerk of course had their own track “Spacelab” (1978). The name comes from a research laboratory developed in the 1970s as a joint project between NASA and European Space agency predecessor  ESRO. ESA tells us that the environment Dr. Gerst is in now, ESA’s  Columbus laboratory module, is a direct descendant of that project. It’s a massive 75 cubic meters (well, massive when you’re launching that into space), packed with research equipment handling space science, Earth observation and technology, materials science, and more.\n And so what you get is a convergence of science and culture, all in the European sphere.", "posttime": "2020-06-04 16:38:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "国际,played,空间站", "title": "克拉夫特沃克在国际空间站与一名宇航员进行现场表演(2018年)", "title_en": "Kraftwerk played live with an astronaut on the ISS (2018)", "transed": 1, "url": "https://cdm.link/2018/07/watch-kraftwerk-jam-with-the-iss-and-esa-astronaut-alexander-gerst/", "via": "", "real_tags": ["国际", "played", "空间站"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005122, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有无数的碎片和不平凡的过去，死海卷轴是一个相当难解的谜。现在专家们说，古老的DNA帮助他们拼凑出哪些碎片来自相同的卷轴，哪些文本可能经过了一段距离，以及这些文字的流传范围有多广。\n这些古卷是20世纪最引人注目的发现之一。在库姆兰洞穴和犹太沙漠周围的其他地点发现的这些古籍涵盖了希伯来语圣经正典的部分内容，以及关于宗教实践、法律文件和赞美诗的著作。\n然而，虽然已经发现了几乎完整的羊皮纸卷轴，但也有大量的碎片-总共超过2.5万块-其中一些碎片的来源存在争议。\n这项研究的合著者、以色列特拉维夫大学的诺姆·米兹拉希教授说：“对于第一批学者来说，他们面临着一项艰巨的任务，那就是试图了解他们实际上有多少拼图拼图，以及在数量不详的拼图中有多少已经永远丢失了。”诺姆·米兹拉希教授也是这项研究的合著者。\n米兹拉希告诉“卫报”：“课文的生物材料和写在上面的课文一样有信息量和说服力。”\n研究小组在《细胞》(Cell)杂志上撰文称，从26个碎片中提取的线粒体DNA显示，其中24个碎片是由羊皮制成的，其中包括耶利米书中的两个碎片，而同样是耶利米的两个碎片是由牛皮制成的。\n研究小组说，这表明后者可能是在库姆兰以外生产的。至少在过去两千年里，朱迪亚沙漠并不太适合养牛，库姆兰也没有牛皮加工的证据。\n研究人员补充说，这个想法得到了其他证据的支持，包括其中一块牛皮碎片被认为可以追溯到古卷留在库姆兰洞穴之前很久。\n更重要的是，由于每一头牛的碎片都显示了不同版本的耶利米，研究小组表示，结果表明该地区流传着不同版本的经文，而不仅仅是库姆兰教派的抄写员，米兹拉希说，他们有着“独特的世界观”。\n同样，研究小组表示，对承载安息日祭祀非圣经歌曲的片段进行的基因分析表明，这篇文章也流传到昆兰以外的地方。\n研究人员通过观察核DNA进一步分析了24只羊的碎片，以及在洞穴中发现的其他物品。\n虽然这种DNA被高度降解，并被人类DNA污染，但研究小组表示，他们仍然能够探索基因的相似之处和不同之处。\n在他们的结果中，研究小组发现一份据称来自库姆兰4号洞穴的法律文件片段与其他库姆兰片段在基因上没有聚集-支持了之前研究的怀疑，即它有不同的起源。这项技术还揭示了在同一昆兰洞穴中发现的两张古代水皮中的哪一张，每张水皮都是由整只羊制成的，一块断裂的皮革碎片属于哪一种，并揭示了用一种名为QSP的特殊手稿传统书写的卷轴碎片从基因上聚集在一起，这表明它们来自一个较小的区域，而不是其他传统中写的卷轴碎片。\n但来自德国联邦材料研究和测试研究所(BAM)的死海卷轴专家艾拉·拉宾教授表示，这项研究没有透露任何新的细节，尽管很早就知道一些卷轴来自库姆兰以外的地方。\n她补充说：“(通常)人们不需要DNA来判断片段是来自牛还是羊。”她还指出，之前的基因研究没有发现羊皮的迹象-新研究的作者表示，这是由于早期古代DNA技术和正在研究的不同片段的限制。\n然而，切斯特大学(University Of Chester)希伯来圣经高级讲师、犹太教第二圣殿马修·柯林斯(Matthew Collins)博士对这项研究表示欢迎。\n他说：“通过检查不同卷轴之间的遗传关系--也就是那些被用来制作卷轴的动物之间的遗传关系--或许可以确定文本串是否起源于单一的动物群体或家族--这可能表明它们的起源更集中或更本地化--或者它们之间的基因对应相对较少，这可能表明它们的起源要多样化得多，是从其他地方进口的，”他说。\n但他补充说：“重要的是要记住，这种DNA测序只告诉我们羊皮纸的起源，而不是卷轴本身写在哪里。”", "note_en": "With myriad fragments and an extraordinary past, the Dead Sea scrolls are quite a puzzle. Now experts say ancient DNA has helped them piece together which fragments come from the same scrolls, as well as which texts may have travelled a distance, and how widespread the writings were.\n The scrolls are one of the most remarkable discoveries of the 20th century. Found in the caves of Qumran as well as other sites around the Judean desert, the ancient texts cover parts of the Hebrew bible canon as well as writings about religious practices, legal documents, and hymns.\n However, while nearly complete parchment scrolls have been discovered, there are also a multitude of fragments – more than 25,000 in total – some of which have a debated origin.\n “For the first scholars they faced a formidable task of trying to understand how many jigsaw puzzles they are actually having, and how many of an unknown number of pieces was lost forever,” said Prof Noam Mizrahi of Tel Aviv University,  Israel, and a co-author of the research.\n   “The biological material of the texts, that the texts are written on, is as informative and as telling as the text that was written on it,” Mizrahi told the Guardian.\n Writing in the journal Cell, the team reported how mitochondrial DNA extracted from 26 fragments reveal that 24 of them, including two fragments from the book of Jeremiah, were made of sheep skin, while two fragments, also of Jeremiah, were made from cow skin.\n That suggested the latter were probably produced outside of Qumran, the team said. “The Judean desert has not been well suited for cow husbandry for at least the last two millennia, and there is no evidence for the processing of cow skins in Qumran.”\n The researchers added that the idea was supported by other evidence, including that one of the cow-skin fragments was thought to date to long before the scrolls were left in the caves at Qumran.\n What is more, with each of the cow fragments showing a different version of Jeremiah, the team said the results suggested different versions of the text were circulating in the region, and were not just down to the scribes of the Qumran sect who, Mizrahi said, had a “peculiar world view”.\n Similarly, the team say genetic analysis of fragments bearing the non-biblical Songs of the Sabbath Sacrifice, suggests this text, too, was circulating beyond Qumran.\n The researchers further analysed the 24 sheep fragments, as well as other items found in the caves, by looking at nuclear DNA.\n While this DNA was highly degraded, and contaminated with human DNA, the team said they were still able to explore genetic similarities and differences.\n  Among their results, the team found a fragment of a legal document allegedly from cave 4 in Qumran did not cluster genetically with other Qumran fragments – supporting suspicions from previous research that it had a different origin. The technique also revealed to which of two ancient waterskins, each made from a whole sheep and found in the same Qumran cave, a broken-off leather fragment belonged, and revealed scroll fragments written in a particular scribal tradition called QSP cluster together genetically, suggesting they came from a small area in contrast to those written in other traditions.\n But Prof Ira Rabin, an expert in the Dead Sea scrolls from the Federal Institute for Materials Research and Testing (BAM) in Germany, said the research did not reveal any new details, while it has long been known that some of the scrolls come from outside Qumran.\n “[Generally] one does not need DNA to see whether a fragment is from a cow or from a sheep,” she added, also pointing out previous genetic studies found no sign of sheep skin – something the authors of the new study say is down to the limitations of early ancient DNA techniques and different fragments being studied.\n However Dr Matthew Collins, a senior lecturer in Hebrew bible and Second Temple Judaism at the University of Chester, welcomed the research.\n “By examining genetic relationships between different scrolls – and thus between the animals whose skins were used to produce them – it may be possible to identify whether clusters of texts originated in a single flock, or family, of animals – which may indicate a more focused or localised origin – or whether there is instead relatively little genetic correspondence between them, which may suggest a far more diverse origin, being imported from elsewhere,” he said.\n But he added: “It’s important to remember that this DNA sequencing only tells us about the origins of the parchment, not where the scrolls themselves were written.”", "posttime": "2020-06-04 15:56:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "提供,dna", "title": "专家称，古代DNA为解开死海古卷之谜提供了线索", "title_en": "Ancient DNA is offering clues to puzzle of Dead Sea scrolls, say experts", "transed": 1, "url": "https://www.theguardian.com/science/2020/jun/02/ancient-dna-helps-experts-tackle-puzzle-of-dead-sea-scrolls", "via": "", "real_tags": ["提供", "dna"]}, {"category": "", "categoryclass": "", "imagename": "a7ce557cd671c221c533ff86e0f53f3a.png", "infoid": 1005121, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周二上午(6月2日)，互联网搜索巨头被提起集体诉讼，指控该公司在用户使用谷歌Chrome隐姓埋名模式浏览网络时追踪用户，非法侵犯了用户的隐私！\n根据提交给加利福尼亚州圣何塞联邦法院的起诉书，谷歌通过谷歌分析、谷歌广告管理器和其他应用程序和网站插件收集数据。这也包括智能手机应用程序，无论用户是否点击了谷歌支持的广告，或者是否在他们的“安全”隐姓埋名模式下浏览。\n这有助于谷歌了解用户的朋友、爱好、喜爱的食物和购物习惯。起诉书称，谷歌还追踪他们在网上搜索的“最私密和可能令人尴尬的东西”。\n自2016年6月1日以来，这起诉讼要求每个隐姓埋名模式的用户至少赔偿5000美元-这可能会给谷歌带来数十亿美元的损害赔偿。\n谷歌显然已经做出回应，称他们将“积极”打这场官司--但问题仍然存在，它安全吗？\n这就是像Snap Search这样的解决方案存在的原因。仅仅隐姓埋名是不够的-你还需要屏蔽正确的广告和跟踪器(包括分析工具)。Snap Search可以做到这一切。\n如果你是Android用户，这里是Snap Search和Chrome之间的一个很好的区别。如果你想继续下载，你可以在这里的商店里找到它！", "note_en": "On Tuesday morning (2nd June), a class action law suit was filed against the Internet Search Giant for illegally invading users’ privacy by tracking them while they browsed the net using the Google Chrome Incognito Mode!\n     According to the complaint filed in the federal court in San Jose, California, Google gathers data through Google Analytics, Google Ad Manager and other applications and website plug-ins. This also includes smartphone apps, regardless of whether users click on Google-supported ads or if they browse in their ‘safe’ Incognito Mode.\n This helps Google learn about users’ friends, hobbies, favorite foods, shopping habits. Google also tracks the “most intimate and potentially embarrassing things” they search for online, the complaint said.\n The lawsuit seeks at least $5,000 of damages per user of the Incognito mode since 1st June, 2016 – which could lead to several billions in damages to Google.\n Google has obviously responded saying they will “vigorously” fight the lawsuit – but the question still remains, is it safe?\n This is why a solution like Snap Search exists. Just going incognito isn’t enough – you need to block the right ads and trackers too (including analytics tools).  Snap Search does all that.\n If you’re an Android user, here is a nicely laid out  difference between Snap Search and Chrome. If you’d like to go ahead and download it, you can find it on the store  here!", "posttime": "2020-06-04 15:22:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,起诉,users", "title": "谷歌起诉隐姓埋名模式跟踪用户索赔50亿美元", "title_en": "Google Sued for $5B for tracking users in Incognito Mode", "transed": 1, "url": "https://snapsearch.online/news/google-sued-for-tracking-users/", "via": "", "real_tags": ["谷歌", "google", "起诉", "users"]}, {"category": "", "categoryclass": "", "imagename": "3567d9c99e1097318d0c86b5593c9702.jpg", "infoid": 1005120, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "严寒的北极冬季通常会扑灭该地区爆发的季节性野火。但每隔一段时间，一场拒绝灭亡的野火就会降临。\n这些大火被称为“僵尸火”或“残留火”，可以深入到地表下丰富的有机物质中，比如环绕北极的广阔泥炭地，并在整个寒冷的冬天在积雪下阴燃。“僵尸火”或“残留火”可以深入到地表下丰富的有机物质中，比如环绕北极的广阔泥炭地，并在整个寒冷的冬天在积雪下阴燃。\n随着西伯利亚北极最近几周和几个月出现创纪录的温暖条件，监测北极野火趋势的科学家们越来越相信，今年春天在北极爆发的一些大火实际上是去年夏天遗留下来的。\n去年，这个变暖速度是世界其他地区两倍多的地区出现了创纪录的火灾激增。北极的土壤中储存了大量的碳和其他导致全球变暖的温室气体，包括泥炭和被称为永久冻土的冻土，这些都可以通过燃烧释放出来。泥炭地是含有古老的、腐烂的和部分分解的有机质的湿地。\n欧盟哥白尼大气监测局(CAMS)高级科学家兼野火专家马克·帕林顿(Mark Parrington)表示，最近在去年夏天大火燃烧的地区发现了北极火灾，这些地区受到高于平均温度和异常干燥的地表条件的影响。\n帕林顿在一份新闻稿中表示：“我们从C3S提供的气候数据中了解到，2019年受火灾影响最大的北极圈地区正在经历更温暖和更干燥的地表条件，为火灾的燃烧和持续提供了理想的环境。”他指的是哥白尼气候变化服务机构(Copernicus Climate Change Service)。\n帕林顿等科学家使用卫星传感器来探测可能表明野火活动的热点。\n帕林顿说：“我们已经看到卫星对活跃火灾的观测，暗示‘僵尸’大火可能已经重新点燃，但这还没有得到地面测量的证实。”“这些异常现象在去年夏天燃烧的地区相当普遍。”\n“如果是这样，那么在某些环境条件下，我们可能会看到去年北极火季的累积效应，这将蔓延到即将到来的季节，并可能导致同一地区再次发生大规模和长期的火灾，”他继续说。\n艾伯塔大学火灾研究员迈克·弗兰尼根(Mike Flannigan)表示，僵尸大火并非闻所未闻，他以艾伯塔省麦克默里堡(Fort McMurray)毁灭性的大火为例，这场大火在2016年至2017年期间燃烧了一年多。\n弗兰尼根在接受采访时说：“今年早些时候就冒出了大火，其中一些是整个冬天都在燃烧的大火。”\n今年4月，消防技术人员骑着雪地摩托在阿拉斯加柳树附近发现一场正在冒烟的僵尸大火，官员们一直在寻找其他类似的僵尸大火。\n西伯利亚中北部上周经历了创纪录的高温，紧随其后的是创纪录的暖冬。西伯利亚中北部的几个站，包括北极圈附近或以上的地区，气温都攀升到了80华氏度。\n5月22日，位于北极圈北部的西伯利亚小镇哈坦加记录到的气温为78度，比正常温度高出约46度。该地点当天的典型最高气温为32度。该镇抹去了之前创下的54华氏度的最高纪录和68华氏度的月度纪录。\n5月份西伯利亚的温暖也不是偶然事件，相反，这是自冬季以来的一个一贯特征。欧洲和亚洲的平均气温偏离了今年的平均水平，帮助将全球平均地表温度推高至创纪录的最高水平；在全球气温地图上，这些地区作为红色斑点脱颖而出。\n西伯利亚今年的气温偏离了平均水平，是地球上温度最高的地区之一。根据美国国家海洋和大气管理局最近的一份报告，自1月份以来，该地区一直比长期平均水平高出至少5.4摄氏度(3摄氏度)。据监测全球气温趋势的伯克利地球公司(Berkeley Earth)的罗伯特·罗德(Robert Rohde)称，俄罗斯1月至4月期间的平均气温异常比平均水平高出近11摄氏度(6摄氏度)。\n罗德在推特上写道：“对俄罗斯来说，这不仅仅是一个新的创纪录的反常现象。”“这是有史以来在任何国家的全国平均水平中出现的最大的1月至4月异常。”\n这些是僵尸火灾吗？随着上周北极西伯利亚的积雪融化，卫星探测到了多起火灾。在去年夏天大范围的#场野火之后，这些大火整个冬天都在冒烟吗？[短线程1/5]🔥🧟pic.twitter.com/3jYoHm7a0c。\n-托马斯·史密斯博士🔥🌏(@DrTELS)2020年5月6日。\n这样的温暖对景观产生了戏剧性的影响，主要是通过蒸发蒸腾，即植物和土壤向大气中释放水分的过程。随着温度的升高，土壤和空气之间的水分交换也随之增加。Flannigan说：“当温度变暖时，(空气)从燃料中吸出水分的效率要高得多。”\n高温正在导致积雪融化，并加速土壤的干燥，包括泥炭地，这些土壤在更潮湿的条件下更能抵抗燃烧。\n加拿大麦克马斯特大学的生态水文学家迈克·沃丁顿(Mike Waddington)说，从历史上看，北极泥炭地起到了防火的作用。他说，“现在它更像是火灾的传播者”，因为气温的升高使土壤更容易迅速干燥。不仅这些富含碳的景观更容易燃烧，而且北极野火也在土壤中燃烧得更深，在一个反馈循环中释放更多的碳到大气中，从而加剧了气候变暖。\n北极泥炭地的干燥和燃烧对整个地球产生了重大后果。沃丁顿说，北部泥炭地比热带雨林含有更多储存的碳。他将冬天阴燃而没有火焰，只是在春天重新点燃的大火，与1987年喜剧“公主新娘”(The Princess Bride)中的火焰沼泽场景相提并论，后者的特点是地下冒出了阵阵火焰。\n沃丁顿的研究表明，北部泥炭地可能比森林干燥得更快，他说燃烧更多的泥炭地会导致更多的碳排放。沃丁顿说，北部泥炭地(包括北方森林、亚北极地区和北极本身)中储存的碳比热带雨林中包含的碳更多。\n“这些问题是科学家们一直在警告的问题：极端情况正在恶化。他们将更加干燥，更多的火，更大的火，更多的二氧化碳“释放到空气中”，他说。“这是我们预料之中的事情，如果我们现在看到，10年、15年、20年后只会更糟.”\n弗兰尼根说，温度和野火之间的关系相当简单：“天气越热，我们看到的火就越多。”", "note_en": "The bitterly cold Arctic winter typically snuffs out the seasonal wildfires that erupt in this region. But every once in a while, a wildfire comes along that refuses to die.\n  These blazes, known as “zombie fires” or “holdover fires,” can burrow into the rich organic material beneath the surface, such as the vast peatlands that ring the Arctic, and smolder under the snowpack throughout the frigid winter.\n  With the Siberian Arctic seeing record warm conditions in recent weeks and months, scientists monitoring Arctic wildfire trends are becoming more convinced that some of the blazes erupting in the Arctic this spring are actually left over from last summer.\n    Last year brought a record surge in fires to a region that is warming at more than twice the rate of the rest of the world. The Arctic contains vast stores of carbon and other planet-warming greenhouse gases in its soils, in peat as well as frozen soil known as permafrost, that can be freed up through combustion. Peatlands are wetlands that contain ancient, decomposed and partially decomposed organic matter.\n  According to Mark Parrington, senior scientist and wildfire expert at the European Union’s Copernicus Atmosphere Monitoring Service (CAMS), recent Arctic fire detections have been found in areas where blazes were burning last summer, which lines up with regions affected by warmer-than-average and unusually dry surface conditions.\n  “We know from the climate data provided by C3S that the Arctic Circle regions most affected by fires in 2019 were experiencing warmer and drier surface conditions, providing the ideal environment for fires to burn and persist,” Parrington said in a news release, referring to the Copernicus Climate Change Service.\n  Scientists such as Parrington use satellite sensors to detect hot spots that could indicate wildfire activity.\n  “We have seen satellite observations of active fires that hint that ‘Zombie’ fires might have reignited, yet it has not been confirmed by ground measurements,” Parrington said. “The anomalies are quite widespread in areas that were burning last summer.”\n  “If this is the case, then under certain environmental conditions, we may see a cumulative effect of last year’s fire season in the Arctic which will feed into the upcoming season and could lead to large-scale and long-term fires across the same region once again,” he continued.\n      Mike Flannigan, a fire researcher at the University of Alberta, says zombie fires are not unheard of, citing the destructive  Fort McMurray fire in Alberta that burned for more than a year during 2016 and 2017.\n  “Fires are popping up early this year, and some of them are fires that burned through the winter,” Flannigan said in an interview.\n  In April, fire technicians riding snowmobiles  found a zombie fire smoldering near Willow, Alaska, and officials have been on the lookout for other similar zombie blazes.\n  North-central Siberia experienced record heat last week, which came on the heels of a record-warm winter. Several stations in north-central Siberia, including areas near or above the Arctic Circle, saw temperatures climb well into the 80s.\n  On May 22, the Siberian town of Khatanga, located well north of the Arctic Circle,  recorded a temperature of 78 degrees, about 46 degrees above normal. The typical maximum temperature for that day at that location is 32 degrees. The town obliterated its previous record high for the date, 54 degrees, and its monthly record, 68 degrees.\n  The Siberian warmth in May has not been a fluke event, either; instead, it has been a consistent feature since the winter. Temperature departures from average in Europe and Asia have helped push global average surface temperatures to record highs this year; on global temperature maps, these regions stand out as splotches of crimson red.\n    The temperature departures from average in Siberia this year are some of the highest of any area on Earth. Since January, the region has been running at least 5.4 degrees (3 Celsius) above the long-term average, according to a recent report from the U.S. National Oceanic and Atmospheric Administration. According to Robert Rohde of Berkeley Earth, which monitors global temperature trends, Russia averaged a temperature anomaly of nearly 11 degrees (6 Celsius) above average for the January-to-April period.\n  “That’s not only a new record anomaly for Russia,” Rohde  wrote on Twitter. “That’s the largest January to April anomaly ever seen in any country’s national average.”\n  Are these &#39;zombie&#39; fires? As the snow melted in Arctic Siberia last week, a number of fires have been detected by satellites. Did these fires smoulder through the winter after widespread  #wildfires last summer? [short thread 1/5] 🔥🧟  pic.twitter.com/3jYoHm7a0c\n— Dr Thomas Smith 🔥🌏 (@DrTELS)  May 6, 2020\n  Such warmth has dramatic repercussions for the landscape, primarily through evapotranspiration, the process by which plants and soils release moisture into the atmosphere. As temperatures increase, so too does the moisture exchanged between the soils and the air. “When temperatures warm up, [the air is] much more efficient at sucking the moisture out of the fuel,” Flannigan said.\n  The heat is causing snow cover to melt and is accelerating the drying of soils, including peatlands, that would be more resistant to burning under wetter conditions.\n  Historically, Arctic peatlands served as a fire break, says Mike Waddington, an ecohydrologist at McMaster University in Canada. “Now it’s more of a fire propagator” because of increasing temperatures that make it easier for soils to dry out quickly, he said. Not only are these carbon-rich landscapes more prone to burning, but Arctic wildfires are also burning deeper into the soils, freeing more carbon into the atmosphere in a feedback loop that enhances warming.\n    The drying and burning of Arctic peatlands has major consequences for the planet as a whole. Northern peatlands contain more stored carbon than rainforests do, Waddington said. He compared fires that smolder during the winter without flames, only to reignite in the spring, to scenes from the fire swamp in the 1987 comedy “The Princess Bride,” which features bursts of flame emerging from underground.\n  Waddington’s research has shown that northern peatlands are likely to dry faster than forests, and he said burning more peatlands will lead to more carbon emissions. There is more carbon stored in northern peatlands (including boreal forests, sub-Arctic areas and the Arctic itself), than is contained in tropical rainforests, Waddington said.\n  “These issues are things that scientists have been warning about: The extremes are getting worse. They’ll be more drying, more fire, bigger fire, more carbon dioxide” released into the air,” he said. “It’s something we are expecting, and if we are seeing it now, 10, 15, 20 years from now it’s only going to be worse.”\n  Flannigan says the relationship between temperature and wildfires is rather simple: “The warmer it gets, the more fire we see.”", "posttime": "2020-06-04 15:21:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "西伯利亚,fires,北极", "title": "阿拉斯加和可能的西伯利亚正在爆发“僵尸大火”", "title_en": "‘Zombie fires’ are erupting in Alaska and likely Siberia", "transed": 1, "url": "https://www.washingtonpost.com/weather/2020/05/28/zombie-fires-burning-arctic-siberia/", "via": "", "real_tags": ["西伯利亚", "fires", "北极"]}, {"category": "", "categoryclass": "", "imagename": "be87060b07a5561ab61e81f89a5b90f8.png", "infoid": 1005118, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "错误的信息是不好的。医学上的错误信息更严重。来自一家著名医学杂志的错误信息是最糟糕的。这里详细介绍了有争议的柳叶刀研究，该研究导致世界卫生组织终止了羟氯喹的全球临床试验，以专注于专利疗法。\n简而言之，“柳叶刀”的研究是一项多国注册分析，评估羟氯喹或氯喹与大环内酯类药物(如阿奇霉素)联合或不联合治疗新冠肺炎住院患者的疗效。这项研究非常大(可能是不可能的，但我们稍后会解决这个问题)，纳入了96,032名患者，其中14,888名属于不同的治疗组。研究发现，羟基氯喹和氯喹与大环内酯类药物联合治疗或不联合治疗都会显著增加住院期间的住院死亡率和去创伤性室性心律失常的风险。综上所述，作者得出结论，羟氯喹和氯喹用于新冠肺炎的住院治疗实际上是有害的，并增加了死亡风险。\n“柳叶刀”的这项研究于5月22日星期五发布。经过一个周末的审议，5月25日(星期一)，世界卫生组织匆忙宣布停止新冠肺炎在17个不同国家的所有羟氯喹临床试验。世卫组织没有进行自己的尽职调查，而是立即依赖于一项披着近200年历史的医学杂志《柳叶刀》声誉的观察性研究报告。\n报告发表后，由世界各地数百名医生和研究人员进行的基层调查显示，数据中存在不可调和的不一致之处，而“柳叶刀”的同行审查过程忽视了这些数据。这项研究现在被发现与国家住院新冠肺炎患者登记处的数据不一致，作者继续将数据来源隐藏在一个由一家名不见经传的公司Surgisphere控制的黑匣子里。\nSurgisphere似乎是“柳叶刀”这项研究的唯一数据提供者，并吹嘘自己是一个实时的全球研究网络，使用机器学习和人工智能执行基于云的医疗数据分析。\n根据柳叶刀的研究，它确实是一个非常大、非常复杂的网络，能够与全球数百家医院合作，能够实时检索详细的患者数据。\n人们预计，像这样的跨国数据库将是研究人员梦寐以求的宝库。奇怪的是，事实并非如此。Surgisphere有一个非常薄的文件夹，里面有对过去出版物的贡献。除了柳叶刀上的出版物，外科唯一的另一本同行评议的出版物是2020年5月1日发表在“新英格兰医学杂志”上的一本题为“新冠肺炎的心血管、药物治疗和死亡率”的出版物。\n外科医生网站的研究部分有23个“来自世界各地的案例研究”作为他们以前的工作和产品特点的证据。这些“案例研究”中的绝大多数缺乏科学内容，实际上是由简短的信件、新闻稿或其数据库的潜在使用案例组成的。\n代替实际的研究，该网站看起来主要是促销活动，给人的印象是一家目标远大的不成熟的科技公司，而不是一个拥有数百万患者实时数据的全球数据库。\n根据LinkedIn的数据，Surgisphere有五名员工，其中只有一人拥有医学学位-创始人萨潘·德赛(Sapan Desai)博士。剩下的四名员工似乎几乎没有或根本没有科学或医学背景，但在业务开发和销售与营销方面拥有丰富的经验。该团队的人员将由一名业务发展和战略副总裁，销售和营销副总裁和两名为Surgisphere创建内容的自由撰稿人组成。\n除了创始人，整个Surgisphere团队在2-3个月前才加入公司。实际上，根据领英(LinkedIn)的说法，这位销售和营销副总裁仍受雇于另一家科技公司W.L.戈尔和营销联合公司(W.L.Gore&amp；Associates)。在2020年2月之前，Surgisphere似乎只有一名员工，即创始人。\n至少可以说，Surgisphere背后的互联网踪迹是奇特的。主要是因为它不在那里。互联网档案馆(Wayback Machine)拥有超过4390亿个网页的记录，长期以来一直作为一种工具来查看过去存在的网页。我已经使用这个工具几百次了，经常对它的数据库的广度感到惊讶。即使是一些最晦涩难懂的网页也有历史快照可用。在历史快照不可用的极少数情况下，Wayback机器的响应是“Wayback机器没有存档该页面。”一种不太常见的回答--我以前从未见过--是“对不起”。此URL已从回发机中排除。“。\n这是在WaybackMachine中搜索https://surgisphere.com/时传递的最后一个响应。\n公司隐藏互联网历史主要有两种方式。首先，他们可以在自己的网站上插入特殊代码，以躲避Wayback Machine的自动爬虫。其次，公司可以要求删除他们的历史快照，但不能保证互联网档案馆会满足这些要求。这两种做法都非常不寻常，几乎都是用来掩盖邪恶活动的。\n深入研究Surgisphere会发现三家子公司：手术结果协作公司、血管结果公司和石英临床公司。在这三个网站的每个主页上，Surgisphere版权都在页面底部附近公开可见。\n手术结果合作几乎没有互联网历史，该页面直到2019年才会出现在互联网档案馆中，在那里它只是重定向到血管结果的网页。\n在互联网档案馆中搜索https://vascularoutcomes.com会返回2019年12月的一张快照。快照显示的网页与Surgical Results Collaborative的网页很相似，不包括任何关于团队或已发表研究的细节。\n同样，Surgisphere的另一个医疗数据分析分支Quartz Clinic似乎也缺乏已发表的研究，也没有一个公开可见的团队。\n上面的每个公司网页都提供了LinkedIn链接。然而，这些链接并没有显示有记录的公司简介，而是都直接指向一个人的简介，他就是萨潘·德赛博士(Dr.Sapan Desai)。\n与数百家医院建立合作伙伴关系，以数十种不同的语言格式化电子病历，推动机器学习和人工智能领域的技术前沿，对于一个庞大的多才多艺的团队来说，是一项历时数月难以逾越的任务，更不用说几周内一个人了。\n就在昨天，Surgisphere主页上的“与我们联系”链接重定向到一个奇怪的加密货币WordPress模板。自那以后，Surgisphere的网站被更改了，链接也被删除了；然而，这只是一家理应持有数百万患者高度敏感记录的公司不完整和不专业的又一个例子。\n德赛博士似乎是成立于2007年的Surgisphere的创始人。在PubMed上搜索“Sapan Desai”，显示了过去五年中的39种医学出版物。除了新冠肺炎最近发表的两篇论文外，其他37篇论文中似乎没有任何一篇使用过外科学数据库。为什么Surgisphere的创始人可以访问最大的实时患者数据存储库之一，但在新冠肺炎上发布之前不会使用它？\n如果我们忽略多个空壳公司笼罩着一个匆忙组织的外科公司的形象，而坚持分析“柳叶刀”研究中的新冠肺炎数据，结果就更不能让人放心了。\nSurgisphere几乎没有提供他们的数据源的详细信息。Surgisphere不仅省略了理应捐献的医院，而且他们甚至没有具体说明捐赠国。取而代之的是，他们按大洲对医院和患者数量进行分类。值得注意的是，数据池越大，就越容易混淆虚假数据。\n第一，澳大利亚是独一无二的，因为它既是一个国家，也是一个大陆，这使得数据混淆更具挑战性。因此，澳大利亚首先发现虚假数据也就不足为奇了。英国《卫报》昨天报道，澳大利亚柳叶刀研究纳入的新冠肺炎死亡人数超过了全国记录的新冠肺炎死亡总数。《柳叶刀》的研究报告了73例来自澳大利亚大陆的死亡病例，但记录显示，截至4月21日，澳大利亚总共只有67例新冠肺炎死亡病例。当面对这种不一致时，这项研究的主要作者曼迪普·梅拉(ManDeep Mehra)博士承认了这个错误，但认为这只是一家被意外分配到错误大陆的单一医院而不屑一顾。\n打击2：这项研究的北美数据高度可疑。研究报告称，在2020年4月14日之前，63,315名新冠肺炎住院患者符合纳入标准。“大西洋月刊”对COVID追踪项目精心安排的数据进行了回顾，结果显示，截至4月14日，与新冠肺炎一起住院的患者只有63,276人。从理论上讲，Surgisphere还收集了加拿大和墨西哥的患者数据。然而，与美国相比，这两个国家的新冠肺炎住院人数都很少。16日，加拿大报告新冠肺炎住院治疗2,019人。虽然目前还没有新冠肺炎在墨西哥住院的数据，但截至4月14日，该国只有5,014例阳性病例和332例死亡。根据病例与住院比率的共同比率，墨西哥很可能只有不到1,000名新冠肺炎住院。因此，截至4月14日，新冠肺炎在北美(美国、加拿大和墨西哥)住院的总人数约为66,000人。\n我们是否相信Surgisphere真的与美国、加拿大和墨西哥的559家医院有良好的关系和数据交换协议，这些协议捕获了66,000名患者中63,315名新冠肺炎患者的详细患者记录？这些数字甚至不包括2,230名不符合纳入标准的新冠肺炎患者，这意味着Surgisphere声称他们拥有的患者数据甚至超过了63,315名患者。\n罢工3.该研究报告了来自非洲的患者数据，这需要复杂的患者监测技术和电子医疗记录系统。一封由146名医生和医学研究人员签名的致“柳叶刀”的公开信认为，这是不太可能的。要使数据有效，非洲大陆近25%的新冠肺炎病例和40%的死亡病例将发生在拥有先进的电子患者数据记录和监测的外科手术附属医院，这些医院能够检测和记录“非持续性(至少6秒)或持续性室性心动过速或心室颤动”。在高传染性病毒的背景下，连续的心脏监测并不总是被使用，因为它增加了医护人员的高危患者接触。新冠肺炎期间的心脏监测做法和这样做所需的复杂设备相结合，使得非洲如此大比例的患者获得心律失常数据的可能性极小。\n还有上面没有提到的其他数据奇怪之处，包括各大洲之间患者基线特征、干预措施和结果的异常微小差异。\n上述发现中的任何一个都值得对数据进行更仔细的检查，以进行这种重要性和对患者护理具有如此全球性影响的研究。\nSurgisphere对询问的回应是拒绝提供有关数据源的任何额外细节，而是要求医生和研究人员信任它们。\n两个月前凭空出现的公司值得这样信任吗？\n2020年5月30日更新：增加了Sapan Desai博士的第三部分，以反映Desai博士之前的研究工作。", "note_en": "Misinformation is bad.  Misinformation in medicine is worse.  Misinformation from a prestigious medical journal is the worst.   Herein is a detailed look at the controversial Lancet study that resulted in the World Health Organization ending worldwide clinical trials on hydroxychloroquine in order to focus on patented therapeutics.\n             In brief, the   Lancet study is a multinational registry analysis assessing the effectiveness of hydroxychloroquine or chloroquine with or without macrolide therapy (e.g. azithromycin) in treatment of COVID-19 in hospitalized patients. The study was very large (perhaps impossibly so, but we will address that later) and included 96,032 patients, of which 14,888 were in treatment groups. The study found that hydroxychloroquine and chloroquine with or without macrolide therapy resulted in significantly increased risk of both in-hospital mortality and de-novo ventricular arrhythmia during hospitalization. In summary, the authors concluded that hydroxychloroquine and chloroquine are actually harmful and increase risk of death when used for in-hospital treatment of COVID-19.\n  The Lancet study was released on Friday, May 22. After deliberating over a weekend, on Monday, May 25, the World Health Organization hastily announced the cessation of all COVID-19 clinical trials on hydroxychloroquine in 17 different countries. Instead of performing its own due diligence, the WHO immediately relied on an observational study cloaked in the reputation of the nearly 200-year old medical journal  The Lancet.\n  After its publication, a grass-roots investigation by hundreds of physicians and researchers worldwide revealed irreconcilable inconsistencies in the data that  The Lancet’s peer-review process overlooked. The study is now found to have inconsistencies with data from national registries of hospitalized COVID-19 patients. The authors continue to hide data sources in a black box controlled by an unknown corporation called Surgisphere.\n       Surgisphere appears to be the sole provider of the data for the Lancet study, and boasts itself to be a real-time global research network that &#34;performs cloud-based healthcare data analytics&#34; using machine learning and artificial intelligence.\n  Based on the Lancet study, it must be a very large, sophisticated network indeed to have partnered with hundreds of hospitals worldwide with the capability of retrieving detailed patient data in real-time.\n  One would expect a multinational database such as this to be a treasure trove coveted by researchers. Strangely, this is not so. Surgisphere has a razor thin folder of contributions to past publications. Besides the Lancet publication, Surgisphere’s only other peer-reviewed publication is one entitled   Cardiovascular, Drug Therapy, and Mortality in Covid-19 that was published on May 1, 2020 in The New England Journal of Medicine.\n  The   Research section of Surgisphere&#39;s website features twenty-three “Case Studies from Around the World” as evidence of their prior work and product features.  The vast majority of these “case studies” lack scientific substance and actually consist of short letters, press releases or potential use-cases for its database.\n  In place of actual research, the website appears primarily promotional and gives the impression of an immature tech company with lofty goals as opposed to a global database with real-time data on millions of patients.\n                              According to LinkedIn,   Surgisphere has five employees, only one of which has a medical degree—the founder Dr. Sapan Desai. The remaining four employees appear to have little to no science or medical background, but with a plethora of experience in business development and sales &amp; marketing. The team&#39;s personnel consist of a VP of Business Development and Strategy, VP of Sales and Marketing and two freelance writers creating content for Surgisphere.\n  With the exception of the founder, the entire Surgisphere team joined the corporation only 2-3 months ago. Actually, according to LinkedIn, the VP of Sales &amp; Marketing is still employed by another tech company, W.L. Gore &amp; Associates. Prior to February 2020, Surgisphere appears to have had a single employee, the founder.\n    The internet trail behind Surgisphere is peculiar to say the least. Mostly because it isn’t there. The Internet Archive (Wayback Machine) has records on more than 439 billion web pages and has long served as a tool to view webpages as they existed in the past. I’ve used the tool hundreds of times and am frequently surprised by the breadth of its database. Even some of the most obscure webpages have historical snapshots available. In the rare circumstances where a historical snapshot is not available, the Wayback Machine’s response is “Wayback Machine doesn&#39;t have that page archived.” A far less common response—one I’ve never seen before—is “Sorry. This URL has been excluded from the Wayback Machine.”\n  It’s this last response that is delivered when   searching https://surgisphere.com/ in the Wayback Machine.\n                              There are primarily two ways for companies to hide internet histories. First, they can insert special codes into their websites to hide from the Wayback Machine’s automated crawlers. Secondly, companies can request the removal of their historical snapshots, but there’s no guarantee the Internet Archive will honor these requests. Both of these practices are highly unusual and almost exclusively used for obscuring nefarious activities.\n    A deeper dive into Surgisphere reveals three subsidiary companies:   Surgical Outcomes Collaborative,   Vascular Outcomes and   Quartz Clinical. On each of the homepages of these three websites, the Surgisphere copyright is publicly visible near the bottom of the page.\n  Surgical Outcomes Collaborative has almost no internet history and the page does not appear in the Internet Archive until 2019, in which it just redirects to the webpage for Vascular Outcomes.\n  A   search of https://vascularoutcomes.com in the Internet Archive returns one snapshot from December 2019. The snapshot shows a webpage that is largely similar to that of Surgical Outcomes Collaborative and does not include any details about a team or published research.\n  Similarly,   Quartz Clinical, another healthcare data analytics branch of Surgisphere, also appears to be devoid of published research and without a publicly visible team.\n  Each of the company webpages above provide a LinkedIn link. Instead of showing company profiles with track records, however, the links all direct to the profile of just one person, Dr. Sapan Desai.\n  Forming partnerships with hundreds of hospitals, formatting electronic medical records in dozens of different languages and pushing the forefront of technology in machine learning and AI is an insurmountable task for a large multi-talented team over many months, let alone one person in a few weeks.\n    Just yesterday, the  Get in touch with us link on Surgisphere’s homepage redirected to a strange WordPress template for cryptocurrency. The Surgisphere website has since been changed and the link deleted; however, this serves as just another example of incompleteness and unprofessionalism from a company supposedly holding highly sensitive records on millions of patients.\n     Dr. Desai appears to be the founder of Surgisphere, which was formed in 2007. A   PubMed search for “Sapan Desai” shows 39 medical publications in the last five years. With the exception of the two very recent COVID-19 papers, the Surgisphere database does not appear to have been used in any of the other 37 publications. Why would the founder of Surgisphere have access to one of the largest repositories of real-time patient data, but not use it until publishing on COVID-19?\n  If we ignore the image of multiple shell corporations enshrouding a hastily organized Surgisphere Corporation and stick to analyzing the COVID-19 data from the Lancet study, the findings are even less reassuring.\n     Surgisphere provides scant detail on their data sources. Not only does Surgisphere omit which hospitals supposedly contributed, but they will not even specify the contributing countries. Instead, they categorize hospitals and patient numbers by continent. Notably, the larger the pool of data, the easier it is to obfuscate false data.\n    Strike #1.  Australia is unique because it is both a country and continent, which makes data obfuscation more challenging. Thus, it is no surprise that false data was first discovered in Australia.   The Guardian reported yesterday that the number of COVID-19 deaths included in the Lancet study for Australia exceeded the total nationally recorded number of COVID-19 deaths. The Lancet study reported 73 deaths from the continent of Australia, but records show that Australia had only a total of 67 COVID-19 deaths by April 21. When confronted with this inconsistency, the lead author of the study, Dr. Mandeep Mehra, admitted the error but dismissed it as simply a single hospital that was accidentally designated to the wrong continent.\n  Strike #2.  North American data from the study is highly suspicious. The study reports that 63,315 hospitalized patients with COVID-19 met inclusion criteria prior to April 14, 2020. A review of the well-curated data from the   COVID Tracking Project by  The Atlantic shows that there were only 63,276 patients hospitalized with COVID-19 by April 14. It is theoretically possible that Surgisphere also collected patient data from Canada and Mexico. However, both of these countries had a tiny number of COVID-19 hospitalizations in comparison to the USA. On April 16,   Canada reported 2,019 COVID-19 hospitalizations. Although data is not readily available on COVID-19 hospitalizations in Mexico, the country had only   5,014 positive cases and 332 deaths by April 14. Based on common rates of case-to-hospitalization ratios, it is likely that Mexico had fewer than 1,000 COVID-19 hospitalizations. Thus, the total number of COVID-19 hospitalizations in North America (USA, Canada and Mexico) by April 14 is about 66,000.\n  Are we to believe that Surgisphere truly had relationships and data exchange agreements with 559 hospitals in the USA, Canada and Mexico that captured detailed patient records for 63,315 COVID-19 patients out of a total of 66,000 patients? These figures do not even include the 2,230 patients with COVID-19 who did not meet the inclusion criteria, meaning that Surgisphere is claiming they have patient data on even a greater number than 63,315 patients.\n  Strike #3.  The study reports patient data from Africa that requires sophisticated patient monitoring technology and electronic medical record systems. An   open letter to The Lancet signed by 146 physicians and medical researchers believes this to be unlikely. For the data to be valid, nearly 25% of all COVID-19 cases and 40% of all deaths in the continent would have occurred in Surgisphere-affiliated hospitals with sophisticated electronic patient data recording and monitoring capable of detecting and recording “nonsustained [at least 6 sec] or sustained ventricular tachycardia or ventricular fibrillation.” In the setting of a highly contagious virus, continuous cardiac monitoring is not always utilized as it increases high-risk patient contact for healthcare workers. A combination of cardiac monitoring practices during COVID-19 and the sophisticated equipment necessary to do so make it highly unlikely that cardiac arrhythmia data is available for such a large percentage of patients in Africa.\n  There are additional data oddities not mentioned above which include unusually small variances in patient baseline characteristics, interventions and outcomes among continents.\n  Any one of the above findings warrants closer inspection of data for a study of this importance and with such global implications on patient care.\n     Surgisphere   responded to inquiries by refusing to provide any additional details on the data sources and instead asking physicians and researchers to trust them.\n  Does a corporation that appeared out of thin air two months ago deserve this trust?\n     UPDATE May 30, 2020: The section &#34;Dr. Sapan Desai&#34; was added to reflect Dr. Desai&#39;s prior research work.", "posttime": "2020-06-04 14:33:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "而来,thin,数据", "title": "凭空而来的研究", "title_en": "A study out of thin air", "transed": 1, "url": "https://www.medicineuncensored.com/a-study-out-of-thin-air", "via": "", "real_tags": ["而来", "thin", "数据"]}, {"category": "", "categoryclass": "", "imagename": "7757db6656fcb7e10096b15c777515a4.jpeg", "infoid": 1005117, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从我的GPT-3帖子上的LW评论来看，那里似乎有很多人认为GPT-3的论文很有价值，因为它表明还有更大的模型做得更好的空间。\n(也就是说，重点不是175B的表现，而是从117米到175B的曲线形状，以及对&gt；175B的影响。)。\n在我看来，这种解读似乎是错误的，我在论文中也没有看到多少迹象表明，这就是两位作者试图表达的意思。因此，我在最初的帖子中根本没有讨论进一步的缩放。不过，由于一些人认为这个话题很重要，所以我将结束循环，将我在LW评论中写的一些东西复制到这里：\n如果我认为这篇论文显示了一个明确的趋势，有成长的空间，用更大的模型进行更高性能的少镜头学习，我会对“少镜头+大LM”作为一种方法印象更深。\n我不认为这说明了这一点。关于这个主题，IMO，最清楚的证据是他们附录H中的许多情节。在很大一部分单独的下游任务上，很少有机会的学习有要么。\n具有清晰定义的形状的缩放趋势，到175B点时基本持平，与微调之间的剩余差距似乎不像是要关闭的(示例：WIC、MultiRC、Record、PhysicaQA、OpenBookQA、6个阅读理解任务中的至少5个、安利)。\n一种非常嘈杂的趋势，由于噪声，规模回报可能很大，但也可能接近于零(例如：BoolQ、CB、WSC)。\n在某些下游任务(Copa、ARC、Winogrande，许多MT任务)、本质上以不同方式探索语言建模技能的“较下游”任务(完形填空/补全)以及合成任务上，伸缩趋势更加令人鼓舞。\n平均而言，随着规模的增长有缓慢但稳定增长的趋势(图1.3)，但这掩盖了上面列出的巨大的跨任务差异。少数镜头的缩放图片与LM Loss本身的缩放图片非常不同，在另一篇OpenAI论文中编目的缩放图片非常平滑和可预测，并且(如GPT-3所示)平稳地持续到175B。\n作为变压器是非常通用的原因的证明：不，我们仍然看到任务性能的广泛传播，尽管LM损失平稳增加，一些最明显的缺陷在所有尺度上持续存在(常识物理，参看第5节)，一些非常基本的能力只是在非常大的规模上出现，甚至在那里也是嘈杂的(算术)。\n作为AGI组件：否。由于大多数任务上的少量学习没有显示出明显的人类水平的缩放趋势，因此AGI中的任何转换器角色都需要更有效的方式来查询它们(例如由另一个模块控制的微调)，或者非转换器模型。\n我在LW的评论中没有说过，但在其他地方已经讨论过了，OpenAI预计他们的LM损失的比例法则将在接近GPT-3的比例上崩溃。\n这是因为他们的计算效率训练的缩放法则(模型快速增长，数据缓慢增长)最终预测到，根据他们的缩放法则，在给定的数据集大小下实现最佳性能是可能的更好的性能。\n具体地说，他们对故障点的点估计(在GPT-3论文之前于2020年1月发布)是。\n(注：我不确定我在这里比较的是LIKE TO LIKE，因为我不确定GPT-3是否正好在扩展论文中定义的计算效率边界上，或者差异有什么影响。)。\n简而言之，不仅极少的性能不太可能像LM损失那样扩展，根据OpenAI的说法，LM损失本身可能会在增加约1个数量级后以目前的方式停止扩展。\n我不清楚那时会发生什么，但这似乎会使任何远远超过175B的简单业绩推断变得复杂，即使是对业绩的衡量也是如此(与极少的机会不同！)。否则，我们预计会无限期地扩大规模。", "note_en": "From the LW comments on my GPT-3 post, it looks like a lot of the people there think the GPT-3 paper is valuable because it shows there is room for even  larger models to do better.\n (That is, the point isn’t the performance at 175B, but the shape of the curve as it passes from 117M to 175B, and the implications for &gt;175B.)\n This interpretation seems wrong to me, and I also saw little in the paper to indicate that this is what the  authors are trying to say.  So I didn’t discuss further scaling at all in my original post.  Since some people find that topic important, though, I will close the loop and copy over here some things I wrote in an  LW comment:\n  If I thought the paper shows a clear trend, with room to grow, toward much greater performance few-shot learning with even bigger models, I would be more impressed with “few-shot + large LM” as an approach.\n I don’t think it shows that. The clearest evidence on this subject, IMO, is the many plots in their Appendix H. On a large fraction of the individual downstream tasks, few-shot learning has either\n a scaling trend with a clearly defined shape that is mostly flat by the 175B point, with a remaining gap vs. fine-tuning that seems unlike to be closed (examples: WiC, MultiRC, ReCoRD, PhysicaQA, OpenBookQA, at least 5 of the 6 reading comprehension tasks, ANLI)\n a very noisy trend where, due to noise, returns to scale might be large but might just as well be near zero (examples: BoolQ, CB, WSC)\n The scaling trend is more encouraging on certain downstream tasks (COPA, ARC, Winogrande, many the MT tasks), on “less downstream” tasks that essentially probe language modeling skill in a different way (cloze/completion), and on synthetic tasks.\n On average, there is a trend toward slow but steady growth with scale (Fig 1.3), but this masks the great across-task variance catalogued above. The scaling picture for few-shot is very different from the scaling picture for LM loss itself, which as catalogued in  another OpenAI paper is remarkably smooth and predictable, and which (as GPT-3 shows) continues smoothly to 175B.\n  As a demonstration that transformers are very generic reasoners: no, we still see a wide spread of task performance despite smooth gains in LM loss, with some of the most distinctive deficits persisting at all scales (common sense physics, cf section 5), and some very basic capabilities only emerging at very large scale and noisily even there (arithmetic).\n As an AGI component: no. Because few-shot learning on most tasks shows no clear scaling trend toward human level, any role of transformers in AGI will require more effective ways of querying them (such as fine-tuning controlled by another module), or non-transformer models.\n  Something I didn’t say in the LW comment, but have  discussed elsewhere, is that OpenAI expects their scaling laws for LM loss to break down at a scale somewhere close to GPT-3′s scale.\n This is because their scaling law for compute-efficient training (which grows the model fast and the data slowly) eventually predicts better performance that is possible according to their scaling law for optimal performance at a given dataset size.\n Specifically, their point estimate for the breakdown point (released in Jan 2020, before the GPT-3 paper) is\n     (N.B. I am not confident I am comparing like to like here, as I’m not sure GPT-3 was exactly on the compute-efficient frontier defined in the scaling paper, or what effect the difference has.)\n In short, not only is few-shot performance unlikely to scale nearly as well as LM loss, LM loss itself – according to OpenAI – is likely to stop scaling in the current way after ~1 additional order of magnitude.\n What will happen at that point is unclear to me, but this would seem to complicate any simple extrapolation of performance far beyond 175B, even for measures of performance which (unlike few-shot!) we would otherwise expect to scale indefinitely.", "posttime": "2020-06-04 14:32:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "扩展,scaling,任务", "title": "GPT-3及其扩展趋势", "title_en": "GPT-3 and Scaling Trends", "transed": 1, "url": "https://nostalgebraist.tumblr.com/post/619672884731904000/gpt-3-and-scaling-trends", "via": "", "real_tags": ["扩展", "scaling", "任务"]}, {"category": "", "categoryclass": "", "imagename": "5fafd45587d96617b86469893acc6bcf.jpeg", "infoid": 1005116, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透东京8月23日电-软银集团(SoftBank Group Corp)(9984.T)将推出一只1亿美元的基金，投资于“由有色人种创始人和企业家领导的公司”，这是抗议活动扰乱美国之际的最新企业行动。\n将负责该基金的软银首席运营官马塞洛·克劳尔(Marcelo Claure)周三在给员工的一封信中写道，被描述为软银改善多样性的努力，“我们必须投入资金，制定计划，并追究自己的责任。”\n软银表示，该基金被命名为“机会增长基金”(Opportunity Growth Fund)，专注于美国的非裔美国人和拉美裔美国人，是同类基金中规模最大的。\n克劳尔写道，它将投资于“来自那些在建立和扩大业务方面面临系统性劣势的社区”的企业家。\n软银还运营着1000亿美元的愿景基金(Vision Fund)，该基金由拉吉夫·米斯拉(Rajeev Misra)领导，在世界各地的初创企业中的投资额超过了整个新基金。\n除了领导陷入困境的办公空间初创公司WeWork的重组外，Claure还经营着一只在拉丁美洲投资的基金。他和米斯拉被视为首席执行长孙正义(Masayoshi Son)的潜在继任者。\n“种族主义是一件可悲的事情，”孙正义在推特上写道，他的帖子以#BlacklivesMatter#标签结束。\nClaure在信中写道，总部位于东京的软银也在建立一个“专门的多元化和包容性计划”。\n软银管理层中男性占压倒性多数，该公司计划在本月稍晚的股东大会上提名首位女性董事会董事。\n虽然涵盖了广泛的国籍，但在Vision Fund网站上列出的30名投资者中，只有4名是女性。\n包括软银(SoftBank)等外国公司在内的公司在美国发生数十年来最严重的内乱后发表了公开声明，一名手无寸铁的黑人男子的死亡再次引发了警察对非裔美国人的暴行问题。\n索尼公司(6758.T)本周推迟了即将推出的PlayStation5游戏机的活动，称“我们希望后退一步，让更多重要的声音被听到。”", "note_en": "TOKYO (Reuters) - SoftBank Group Corp (  9984.T) is launching a $100 million fund to invest in “companies led by founders and entrepreneurs of colour”, in the latest corporate action as protests roil the United States.\n  Described as SoftBank’s bid to improve diversity, “we have to put money behind it, set plans, and hold ourselves accountable,” SoftBank’s Chief Operating Officer Marcelo Claure, who will head the fund, wrote in a letter to employees on Wednesday.\n Named the “Opportunity Growth Fund” and focused on African Americans and Latinos in the U.S. it is, SoftBank says, the largest fund of its kind.\n It will invest in entrepreneurs “from communities that face systemic disadvantages in building and scaling their businesses,” Claure wrote.\n SoftBank also runs the $100 billion Vision Fund, which is headed by Rajeev Misra and invests amounts larger than the entire new fund in startups around the world.\n In addition to leading restructuring at floundering office space startup WeWork, Claure runs a fund investing in Latin America. He and Misra are seen as potential successors to Chief Executive Masayoshi Son.\n “Racism is a lamentable thing,” Son wrote on Twitter, ending his post with the hashtag #blacklivesmatter.\n Claure wrote in his letter that Tokyo-headquartered SoftBank was also establishing a “dedicated diversity and inclusion program”.\n SoftBank’s management is overwhelmingly male, with the company planning to nominate its first female board director at a shareholder meeting later this month.\n While spanning a wide range of nationalities, only four of 30 investors listed on Vision Fund’s website are female.\n Companies including foreign firms like SoftBank have made public statements following the worst U.S. civil unrest in decades as the death of an unarmed black man reignites the issue of police brutality against African Americans.\n Sony Corp (  6758.T) this week pushed back an event for its upcoming PlayStation 5 console, saying “we want to stand back and allow more important voices to be heard.”", "posttime": "2020-06-04 14:31:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "启动,startup,软银", "title": "软银推出1亿美元少数族裔启动基金", "title_en": "SoftBank launches $100m minorities startup fund", "transed": 1, "url": "https://www.reuters.com/article/us-softbank-group-investments/softbank-launches-100-million-fund-investing-in-people-of-color-idUSKBN23A1RK", "via": "", "real_tags": ["启动", "startup", "软银"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005115, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦大学学院的神经学家卡尔·弗里斯顿建立了人脑功能的数学模型。最近，他将自己的模型应用到新冠肺炎身上，并用他所学到的知识为独立圣人提供建议，独立圣人委员会是作为英国政府官方流行病建议机构-紧急情况科学咨询小组(SAGE)的替代机构而成立的。\n您使用的模型与流行病学家在这场大流行中为政府提供建议所依赖的传统模型有何不同？传统模型基本上将曲线拟合到历史数据，然后将这些曲线外推到未来。他们观察现象的表面--可观察的部分，或数据。我们的方法借鉴了物理学，特别是理查德·费曼(Richard Feynman)的工作，但我们的方法是在引擎盖下进行的。它试图捕捉这一现象的数学结构-在这种情况下，就是大流行-并理解所观察到的原因。因为我们不知道所有的原因，所以我们必须推断它们。但这种推论，以及隐含的不确定性，都是建立在模型中的。这就是为什么我们称它们为生成性模型，因为它们包含了生成数据所需知道的所有内容。随着更多的数据进入，你可以调整你对原因的看法，直到你的模型尽可能准确和简单地模拟数据。\n关于新冠肺炎，你能举一个例子说明你所说的不确定性是什么意思吗，以及你是如何将不确定性融入你的模型中的？今天使用的一种常见的流行病学模型是SEIR模型，该模型认为人们必须处于四种状态之一--易感(S)、暴露(E)、感染(I)或康复(R)。不幸的是，现实并没有如此整齐地将它们分解。例如，被找回意味着什么？我们知道新冠肺炎是可以感染的，但是没有症状，那么是指从症状中恢复还是从感染中恢复？这个问题隐藏了许多其他问题，包括与国家测试战略有关的问题。当你思考数据的根本原因时，SEIR模型就会开始分崩离析。你需要能够考虑所有可能状态的模型，并评估哪些状态对随着时间的推移塑造大流行的轨迹具有重要意义。\n这是产生性方法首次应用于大流行。它在其他领域证明了自己吗？这些技术自从脱离物理学以来取得了巨大的成功。他们已经运行你的iPhone和核电站很长时间了。在我的神经生物学领域，我们称这种方法为动态因果模型(DCM)。我们不能直接看到大脑状态，但是我们可以给出大脑成像数据来推断它们。事实上，我们已经将这个想法推得更远了。我们认为大脑可能在进行自己的动态因果建模，减少了它对感官提供给它的数据原因的不确定性。我们称之为自由能原理。但是，无论你谈论的是流行病还是大脑，根本问题都是一样的--你试图理解一个随时间变化的复杂系统。从这个意义上说，我并没有做什么新鲜事。这些数据是由新冠肺炎患者而不是神经元产生的，但除此之外，这只是办公室里的又一天。\n你说生成性模型也比传统模型更有效率。你是什么意思？流行病学家目前通过利用高性能计算机进行大规模的数字运算来解决推断问题。想象一下，您想要模拟苏格兰的一场疫情。使用传统方法，这将花费您一天或更长时间来使用今天的计算资源。这只是模拟一个模型或假设--一组参数和一组起始条件。使用DCM，您可以立即执行相同的操作。这让你可以快速、轻松地给不同的假设打分，从而更快地找到最好的假设。\n还有其他优势吗？是。对于传统的SEIR模型，干预和监测是您添加到模型中的东西-微调或扰动-以便您可以看到它们对发病率和死亡率的影响。但是，在生成性模型中，这些东西与其他重要的东西一起被构建到模型本身中。我们作为个人--以及作为一个社会--的反应，成为流行病学过程的一部分，成为一个大型的自我组织、自我监测系统的一部分。这意味着不仅可以预测未来的病例和死亡人数，还可以预测社会和机构的反应-并为这些预测附加准确的日期。\n你的预测在第一波感染中得到了多大程度的证实？至于伦敦，我们预计4月5日入院人数将达到高峰，死亡人数将在5天后达到高峰，重症监护病房的占用率不会超过容量-这意味着将不需要南丁格尔医院。我们还预测，到5月8日，首都的情况将有所改善，这可能会放松社会疏远措施-他们正在\n你的模型对第二波的风险有什么看法？这些模型支持这样的观点，即未来几周发生的事情不会在触发反弹方面产生太大影响-因为人口在一定程度上受到第一波期间获得的免疫力的保护。真正令人担忧的是，当这种豁免权消失时，第二波浪潮可能会在几个月后爆发。我们可以测试一系列假设，基于非常短的免疫期-就像普通感冒一样-直到持续数十年的免疫权。对于每个持续时间，我们都可以计算出第二波出现的概率和出现的时间。这项工作现在还为时尚早，我怀着真正的兴奋期待着新的免疫力数据的出现，因为现在有了可靠的抗体测试。但重要的信息是，我们现在有一个机会之窗，可以在假定的第二波之前制定好测试和跟踪协议。如果这些都得到了一致的实施，我们可能会将这波浪潮推迟到可以获得治疗或疫苗的时间范围之外，这是我们在第一次之前无法做到的。\n一旦大流行结束，你能用你的模型来询问哪个国家的反应最好吗？这已经在发生了，作为我们试图理解数据潜在原因的一部分。我们一直在比较英国和德国，试图解释德国相对较低的死亡率。答案有时是违反直觉的。例如，看起来德国的低死亡率似乎不是因为他们优越的检测能力，而是因为普通德国人比普通英国人更不可能感染和死亡。为什么？有各种可能的解释，但看起来越来越有可能的一种解释是，德国有更多的免疫性“暗物质”--不受感染的人，可能是因为他们地理上与世隔绝，或者有某种天然的抵抗力。这就像宇宙中的暗物质：我们看不见它，但我们知道它一定存在，以解释我们所能看到的东西。知道它的存在对我们为任何第二波做准备都是有用的，因为这表明对那些接触新冠肺炎的高危人群进行有针对性的测试可能比对整个人群进行非选择性测试更好。\n生成性模型是疾病建模的未来吗？这是流行病学家的问题--他们是专家。但是，考虑到费曼的思想在许多其他学科中产生的影响，如果流行病学界中至少有一部分人在未来没有更多地致力于这种方法，我会感到非常惊讶。\n最后，“连线”杂志的采访称，你喜欢抽烟，中午之前不要和任何人说话，没有手机，也不喜欢一对一的会议。这些东西在封锁期间有变化吗？恐怕不行。诚然，这可以被认为是一对一的会议，但我的默认模式是在一个小组中分享想法-独立智者风格-正常的服务很快就会恢复。就在我和你讲话之前，我谢绝了在早间电台演讲的邀请，现在我要去抽烟了。", "note_en": "Neuroscientist  Karl Friston, of University College London, builds mathematical models of human brain function. Lately, he’s been applying his modelling to Covid-19, and using what he learns to advise  Independent Sage, the committee set up as an alternative to the UK government’s official pandemic advice body, the Scientific Advisory Group for Emergencies (Sage).\n How do the models you use differ from the conventional ones epidemiologists  rely  on to advise governments in this pandemic? Conventional models essentially fit curves to historical data and then extrapolate those curves into the future. They look at the surface of the phenomenon – the observable part, or data. Our approach, which borrows from physics and in particular the work of  Richard Feynman, goes under the bonnet. It attempts to capture the mathematical structure of the phenomenon – in this case, the pandemic – and to understand the causes of what is observed. Since we don’t know all the causes, we have to infer them. But that inference, and implicit uncertainty, is built into the models. That’s why we call them generative models, because they contain everything you need to know to generate the data. As more data comes in, you adjust your beliefs about the causes, until your model simulates the data as accurately and as simply as possible.\n Can you give an example of what you mean by uncertainty, with respect to Covid-19, and how you build it into your models? A common type of epidemiological model used today is the SEIR model, which considers that people must be in one of four states – susceptible (S), exposed (E), infected (I) or recovered (R). Unfortunately, reality doesn’t break them down so neatly. For example, what does it mean to be recovered? We know that with Covid-19 you can be infected but asymptomatic, so does it mean recovered from the symptoms or recovered from the infection? And that question hides a host of others, including questions relating to national testing strategies. SEIR models start to fall apart when you think about the underlying causes of the data. You need models that can allow for all possible states, and assess which ones matter for shaping the pandemic’s trajectory over time.\n This is the first time the generative approach has been applied to a pandemic . Has it proved itself in other domains? These techniques have enjoyed enormous success ever since they moved out of physics. They’ve been running your iPhone and nuclear power stations for a long time. In my field, neurobiology, we call the approach dynamic causal modelling (DCM). We can’t see brain states directly, but we can infer them given brain imaging data. In fact, we have pushed that idea even further. We think the brain may be doing its own dynamic causal modelling, reducing its uncertainty about the causes of the data the senses feed to it. We call this the  free energy principle. But whether you’re talking about a pandemic or a brain,  the essential problem is the same – you’re trying to understand a complex system that changes over time. In that sense, I’m not doing anything new. The data is generated by Covid-19 patients rather than neurons, but otherwise it’s just another day at the office.\n You say generative models are also more efficient than conventional ones. What do you mean? Epidemiologists currently tackle the inference problem by number-crunching on a huge scale, making use of high-performance computers. Imagine you want to simulate an outbreak in Scotland. Using conventional approaches, this would take you a day or longer with today’s computing resources. And that’s just to simulate one model or hypothesis – one set of parameters and one set of starting conditions. Using DCM, you can do the same thing in a minute. That allows you to score different hypotheses quickly and easily, and so to home in sooner on the best one.\n Any other advantages? Yes. With conventional SEIR models, interventions and surveillance are something you add to the model – tweaks or perturbations – so that you can see their effect on morbidity and mortality. But with a generative model these things are built into the model itself, along with everything else that matters. Our response as individuals – and as a society – becomes part of the epidemiological process, part of one big self-organising, self-monitoring system. That means it is possible to predict not only numbers of cases and deaths in the future, but also societal and institutional responses – and to attach precise dates to those predictions.\n How well have your predictions been borne out  in this first wave of infections? For London, we  predicted that hospital admissions would peak on 5 April, deaths would peak five days later, and critical care unit occupancy would not exceed capacity – meaning the  Nightingale hospitals would not be required. We also predicted that improvements would be seen in the capital by 8 May that might allow social distancing measures to be relaxed – which they were in the prime minister’s announcement on 10 May. To date our predictions have been accurate to within a day or two, so there is a predictive validity to our models that the conventional ones lack.\n What is your role with Independent Sage ? I’m a member with special responsibility for modelling. When they first approached me I didn’t see the “Independent”… I’m joking, but only partly. I think of Independent Sage as the ultimate exercise in public engagement; what it would look like if you and I and everyone else were able to sit in on a real Sage meeting. I’ve heard defensive politicians say its very existence impugns the real Sage, but as a scientist I can’t subscribe to that. In my view there can never be anything wrong with transparent, informed discussion. The committee’s other, equally important, role is to present the UK government with alternative hypotheses – to give it more room for manoeuvre.\n What do your models say about the risk of a second wave? The models support the idea that what happens in the next few weeks is not going to have a great impact in terms of triggering a rebound – because the population is protected to some extent by immunity acquired during the first wave. The real worry is that a second wave could erupt some months down the line when that immunity wears off. We can test a range of hypotheses, based on a very short duration of immunity – as with a common cold – right through to immunity that lasts for decades. For each duration we can calculate the probability that a second wave will emerge, and when. It’s early days for this work, and I look forward with genuine excitement to new data on immunity becoming available, now that reliable antibody  tests exist. But the important message is that we have a window of opportunity now, to get test-and-trace protocols in place ahead of that putative second wave. If these are implemented coherently, we could potentially defer that wave beyond a time horizon where treatments or a vaccine become available, in a way that we weren’t able to before the first one.\n Once the pandemic is over, will you be able to use your models to ask which country’s response was best? That is already happening, as part of our attempts to understand the latent causes of the data. We’ve been comparing the UK and Germany to try to explain the comparatively low fatality rates in Germany. The answers are sometimes counterintuitive. For example, it looks as if the low German fatality rate is not due to their superior testing capacity, but rather to the fact that the average German is less likely to get infected and die than the average Brit. Why? There are various possible explanations, but one that looks increasingly likely is that Germany has more immunological “dark matter” – people who are impervious to infection, perhaps because they are geographically isolated or have some kind of natural resistance. This is like dark matter in the universe: we can’t see it, but we know it must be there to account for what we can see. Knowing it exists is useful for our preparations for any second wave, because it suggests that targeted testing of those at high risk of exposure to Covid-19 might be a better approach than non-selective testing of the whole population.\n Are generative models the future of disease modelling? That’s a question for the epidemiologists – they’re the experts. But I would be very surprised if at least some part of the epidemiological community didn’t become more committed to this approach in future, given the impact that Feynman’s ideas have had in so many other disciplines.\n Finally, a    Wired   interview says  you like to smoke, don’t speak to anyone before midday, do not own a mobile phone and deplore one-on-one meetings. Ha s any of th at changed during lockdown? I’m afraid not. It’s true that this could be considered a one-on-one meeting, but my default mode is sharing ideas in a group – Independent Sage-style – and normal service will resume shortly. Just before I spoke to you I declined an invitation to speak on morning radio, and now I’m off for a cigarette.", "posttime": "2020-06-04 14:31:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "暗物质,immunological,模型", "title": "德国可能有更多免疫“暗物质”--世界新闻--卫报", "title_en": "Germany may have more immunological “dark matter” – World news – The Guardian", "transed": 1, "url": "https://www.theguardian.com/world/2020/may/31/covid-19-expert-karl-friston-germany-may-have-more-immunological-dark-matter", "via": "", "real_tags": ["暗物质", "模型"]}]