[{"category": "", "categoryclass": "", "imagename": "62fd74cec9dded229cba14c714e10a3c.jpg", "infoid": 1002298, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2019年11月27日Upbit Exchange遭黑客入侵导致ETH 34.2万被盗。从那时起，在12月和1月的几个月里，超过2.36万人通过各种密码交易所被洗钱，其余的一直闲置在黑客的钱包里，直到最近。\n几天前，克莱恩接到警告说，被盗的资金又开始流动了，到5月15日，又有7万ETH资金被输送出去。\n利用其专有的合规和调查平台，Clain调查了这起案件，以具体检测被盗资金流向了哪里。\n以下是黑客钱包的资金流程图，由数千个用于洗钱的ETH地址组成：\n我们发现，最近一次企图清洗被盗资金的行动涉及多个著名的交易所。到目前为止，超过85%的资金是由Clain平台成功定义的，将流入Binance、Huobi和OKex等交易所。\n在下图中，您可以看到涌入主要交易所的累计ETH金额的时间表：\n进一步分析黑客控制的钱包，我们发现它试图通过Tokenlon钱包混淆偷来的资金，将其兑换成USDT和其他稳定的硬币，但由于将洗钱与非法来源混合在一起，它失败了。\n以下是Upbit Hacker钱包自5月1日至5月15日的流入和流出情况的完整视图：\n5月份洗钱资金的整个分配情况以及收件人的名字可以在这里观察到：\n但值得注意的是，有趣的是，一旦密码交易所基本上意识到Upbit有色货币的涌入，一些人就宣布冻结账户，以停止洗钱。然而，进一步调查黑客过去用来汇款的存款地址，我们注意到新创建的地址中只有一小部分，大部分是以前使用的旧地址。\n这一事实本身就应该意味着，以前使用的地址并没有被交易所屏蔽，而是允许黑客一遍又一遍地重复利用旧账户。\n以下是受影响的主要交易所的新创建地址与旧地址的比率：\n拜克斯是受到彻底洗钱影响的公司之一。官员们急忙否认黑客资金的目的地实际上是他们的交换地址(包括拜克斯回应的快照)。但我们可以保证，上述地址确实属于拜克斯，坦率地说，我们对官方的虚假陈述感到惊讶。\n对我们来说，尽管仍然很明显，鉴于流入的资金数量异常，拜克斯应该得到警告，并采取适当的措施来对抗这些企图。但似乎什么都没有做，因为流入的赃款与分别清洗的流出资金之间得到了巧妙的平衡。\n有证据表明，Byex交易所在进一步发送给霍比之前，主要是用来混淆资金的。\n与首次登陆拜克斯的ETH数量相对相同的是，下一批ETH将运往火壁交易所(如下图所示)。\nBinance交易所的官员宣布，他们阻止了Upbit黑客的交易。然而，数据显示，黑客使用的存款地址实际上很久以前就活跃了。这些地址系统地接受了被盗的资金，直到现在还没有被封锁。\n类似的公告紧随其后的是OKEX，插图证实了ADDRESS在更长一段时间内的活动。\n以下是整个期间已确定金额的Upbit被盗资金收件人汇总表：\n通过结合网络科学和机器学习来收集和解释大量交易数据，我们为加密货币生态系统的参与者提供调查服务，并为他们提供关于网络内部结构的有意义的见解。\n要了解有关我们的加密合规能力的更多信息，请访问我们的网站https://clain.io或向我们发送请求：info@clain.io", "note_en": "Upbit exchange was  hacked on November 27, 2019 resulted in ETH 342 000 being stolen. Since then, more than ETH 236 000 was laundered through various crypto exchanges during the months of December and January, the rest has been sitting idle on hackers’ wallets until recently.\n Few days ago, Clain was alerted that the stolen funds started moving again, and by May 15 an additional amount of ETH 70 000 were channeled.\n Using its proprietary  compliance and investigation platform, Clain has looked into the case to detect specifically where the stolen funds were moving to.\n Below is a funds flow chart of the hacker wallet comprised of thousands of ETH addresses used to launder:\n  We have detected that the most recent attempt to launder the stolen funds involved a number of prominent, well-known exchanges. Until now, over 85% of the funds are successfully defined by the Clain platform, to be flowing into exchanges such as Binance, Huobi and OKex.\n In below graph you see the timeframe with cumulative ETH amounts rushing to major exchanges:\n  Analyzing further hacker-controlled wallets we have detected that it was trying to obfuscate stolen funds via Tokenlon wallet exchanging it to USDT and other stable coins but failed as it mixed laundered money with illicit sources.\n Here is a complete view of the incoming and outgoing flows of Upbit Hacker wallet since May 1 to May 15:\n  The entire distribution of May launder funds along with the recipient names can be observed here:\n  Interesting fact though to note is that, as soon as the crypto exchanges became largely aware of the influx of Upbit tinted money, some have announced of freezing accounts to cease the launder. However, looking further into deposit addresses the hacker used to send money to, we noted that there is only a small fraction of newly created addresses, the majority is the old ones used previously.\n This fact alone should imply that the previously used addresses have not been blocked by exchanges, but rather allowed hackers to repeatedly exploit old accounts over and over again.\n Below is the ratio of newly created vs old addresses on the major exchanges affected:\n  Byex is among names that was affected by outright launder. The officials have hurried to deny that the destination of hackers’ funds was in fact their exchange addresses (snapshot of Byex response included). But we can assure that the aforementioned addresses do belong to Byex and are frankly surprised by the official false statement.\n  To us though it remains very clear that given abnormal volume of incoming funds, Byex should have been alerted and taken the appropriate measures to counteract the attempts. But nothing seems to be done as the inflow of stolen money was neatly balanced with respectively laundered outflow.\n   There is evidence to assume that Byex exchange was primarily used to obfuscate funds prior to sending it further to Huobi.\n Relatively the same amount of ETH that first landed on Byex was next headed to Huobi exchange (as illustrated below)\n  The officials of Binance exchange have announced that they blocked transactions of Upbit hacker. However, the data reveals that deposits addresses the hacker used was in fact active long time ago. The addresses systematically accepted the stolen funds and have not been blocked up until now.\n   Similar announcements were followed by OKex and the illustration confirms the activity of address for a longer period.\n  Below is the aggregate table of recipients of Upbit stolen funds with identified amounts for the entire period:\n    By using a combination of network science and machine learning to aggregate and interpret vast quantities of transactional data, we provide investigative services to participants of cryptocurrency ecosystem and supply them with meaningful insight on the network&#39;s internals.\n To learn more about our capacities for crypto compliance, please visit our website  https://clain.io or send us request at  info@clain.io", "posttime": "2020-05-16 04:29:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "交易,upbit,stolen,资金", "title": "5月份，从Upbit被盗的1400万美元ETH通过知名交易所洗钱", "title_en": "$14M in ETH stolen from Upbit were laundered in May through well-known exchanges", "transed": 1, "url": "https://blog.clain.io/upbit-stolen-ethereum-being-laundring-through-binance-huobi-and-okex/", "via": "", "real_tags": ["交易", "upbit", "stolen", "资金"]}, {"category": "", "categoryclass": "", "imagename": "8d41faf933d99f7b6ab19e25fdfc6eff.png", "infoid": 1002296, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ICANN今天彻底拒绝了ethos Capital将.org域名注册机构转变为负债累累的营利性实体的计划，这是世界各地致力于公共利益的非营利组织和非政府组织的一次令人震惊的胜利。这是一次重要的胜利，承认了书记官处作为一个基于使命的非营利实体的长期遗产，保护了数千个组织及其服务的人民的利益。\n我们很高兴ICANN听取了非营利性世界的许多声音，敦促它不要支持将运营.org的公共利益注册中心(Public Interest Registry)出售给私募股权公司ethos Capital。拟议中的收购是域名行业内部人士试图从世界各地数以千计的非营利组织和非政府组织中获利。ICANN表示，这笔交易将从根本上将PIR转变为一个“必须服务于其企业利益相关者利益的实体”，“没有保护或服务.org社区的有意义的计划”。ICANN明确表示，它看到了这项提案的实质，而不管ethos声称非营利组织将继续在他们的未来拥有发言权。他们写道，ICANN委托PIR在其.org注册中心的运营中承担服务公共利益的责任，现在ICANN正被要求转移这种信任。他们写道，ICANN将在其.org注册中心的运营中，将服务于公共利益的责任委托给PIR，现在ICANN被要求转移这一信任。\n这笔交易有可能给非营利性世界带来审查制度和增加运营成本。正如EFF警告的那样，应强大的企业利益集团和政府的要求，私人股本拥有的注册机构将有经济动机暂停域名，导致网站停电。\nICANN在一篇关于其决定的博客文章中还指出，这笔交易如何危及注册处的财务稳定。他们指出，11亿美元的拟议出售将使PIR“从一个可行的非营利性实体转变为一个背负3.6亿美元债务的营利性实体”。这笔债务不是为了PIR或.org社区的利益，而是为了ethos及其投资者的经济利益。而且ethos未能让ICANN相信它不会耗尽PIR的财政资源，将.org注册的稳定和安全置于危险之中。\nICANN并不相信“管理委员会”这一象征性的提议，该委员会试图增加一种责任的表象。他们呼应了EFF自己的信，指出“管理委员会的成员资格需要得到PIR董事会的批准，因此，可能会被PIR的所有者获取或受制于盈利性利益，因此不太可能真正独立于ethos Capital或PIR的董事会。”\n许多组织努力说服ICANN拒绝出售。加入我们的还有全国非营利组织理事会、NTEN、Access Now、美国女童子军、消费者报告、基督教青年会、Demand Progress、OpenMedia、Fight for the Future、Wikimedia、Oxfam、绿色和平、消费者报告、Farmaid、NPR、美国红十字会，以及其他几十个家喻户晓的机构。非营利专业人士和技术专家甚至在1月份聚集在洛杉矶，当面告诉ICANN他们的担忧。捍卫.org域名的联盟就像.org注册者本身一样多种多样，涵盖了所有公共利益领域：援助组织、企业监督机构、博物馆、俱乐部、剧院公司、宗教组织等等。拒绝出售的请愿书收到了超过6.4万个签名，近900个组织签名。国会议员、联合国特别报告员和州慈善监管机构也加入了他们的担忧。\n影响ICANN决定的一个最新进展是加利福尼亚州总检察长泽维尔·贝塞拉(Xavier Becera)的信[pdf]。贝塞拉的信援引EFF和其他联盟成员的话，敦促ICANN拒绝出售。尽管ICANN收到了来自其决策社区某些部分的许多最后一刻的呼吁，敦促该组织忽略贝塞拉的信，但ICANN承认，由于它是加州的非营利性组织，它承担不起忽视州监管机构的代价。\n由于PIR是在宾夕法尼亚州注册成立的，该州法院必须批准其转变为营利性公司。宾夕法尼亚州总检察长正在调查这笔交易，也可能参与其中。ICANN在其理由中表示，如果PIR和ethos能够获得另一个对交易有权的机构的批准，它将允许PIR和ethos提交新的申请。但ICANN拒绝出售背后的所有原因也将面对宾夕法尼亚州的风气。\nICANN的这一决定对非营利性互联网用户来说是一次艰难的胜利。但.org注册处仍然需要一位忠诚的管家，因为互联网协会已经明确表示，它不再想要这一责任。ICANN应该像他们在2002年所做的那样，举行一次公开咨询，选择一个新的.org域名运营商，让非营利组织在其治理中拥有真正的话语权，并真正保证不受审查和金融剥削。", "note_en": "In a stunning victory for nonprofits and NGOs around the world working in the public interest, ICANN today  roundly rejected Ethos Capital’s plan to transform the .ORG domain registry into a heavily indebted for-profit entity. This is an important victory that recognizes the registry’s long legacy as a mission-based, non-for-profit entity protecting the interests of thousands of organizations and the people they serve.\n We’re glad ICANN listened to the  many voices in the nonprofit world urging it not to support the sale of Public Interest Registry, which runs .ORG, to private equity firm Ethos Capital. The proposed buyout was an attempt by domain name industry insiders to profit off of thousands of nonprofits and NGOs around the world. Saying the sale would fundamentally change PIR into an “entity bound to serve the interests of its corporate stakeholders” with “no meaningful plan to protect or serve the .ORG community,” ICANN made clear that it saw the proposal for what it was, regardless of Ethos’ claims that nonprofits would continue to have a say in their future.   &#34;ICANN entrusted to PIR the responsibility to serve the public interest in its operation of the .ORG registry,&#34; they wrote, &#34;and now ICANN is being asked to transfer that trust to a new entity without a public interest mandate.&#34;\n The sale threatened to bring censorship and increased operating costs to the nonprofit world. As  EFF warned, a private equity-owned registry would have a financial incentive to suspend domain names—causing websites to go dark—at the request of powerful corporate interests and governments.\n In a  blog post about its decision, ICANN also pointed out how the deal risked the registry’s financial stability. They noted that the $1.1 billion proposed sale would change PIR “from a viable not-for-profit entity to a for-profit entity with a US$360 million debt obligation.” The debt was not for the benefit of PIR or the .ORG community, but for the financial interests of Ethos and its investors. And Ethos failed to convince ICANN that it would not drain PIR of its financial  resources, putting the stability and security of the .ORG registry at risk.\n  ICANN was not convinced by the  token “stewardship council” that Ethos proposed in an attempt to add an appearance of accountability. Echoing  EFF’s own letter, they noted that “the membership of the Stewardship Council is subject to the approval of PIR&#39;s board of directors and, as a result, could become captured by or beholden to the for-profit interests of PIR&#39;s owners and therefore are unlikely to be truly independent of Ethos Capital or PIR&#39;s board.”\n Many organizations worked hard to persuade ICANN to reject the sale. We were joined by the National Council of Nonprofits, NTEN, Access Now, The Girl Scouts of America, Consumer Reports, the YMCA, Demand Progress, OpenMedia, Fight for the Future, Wikimedia, Oxfam, Greenpeace, Consumer Reports, FarmAid, NPR, the American Red Cross, and dozens of other household names. Nonprofit professionals and technologists even  gathered in Los Angeles in January to tell ICANN their concerns in person. The coalition defending the .ORG domain was as diverse as .ORG registrants themselves, encompassing all areas of public interest: aid organizations, corporate watchdogs, museums, clubs, theater companies, religious organizations, and much, much more. Petitions to reject the sale received over 64,000 signatures, and nearly 900 organizations signed on. Joining them in their concerns were  Members of Congress,  UN Special Rapporteurs, and  state charity regulators [pdf].\n A late development that affected ICANN’s decision was the  letter [pdf] from California’s Attorney General, Xavier Becerra. Citing EFF and other members of the coalition, Becerra’s letter urged ICANN to reject the sale. Although ICANN received many last-minute appeals from some parts of its policymaking community urging the organization to ignore Becerra’s letter, ICANN acknowledged that as it is a California nonprofit, it could not afford to ignore its state regulator.\n Because PIR is incorporated in Pennsylvania, that state’s courts must approve its conversion into a for-profit company. Pennsylvania’s attorney general is investigating the sale, and may also weigh in. In its rationale, ICANN states that it will allow PIR and Ethos to submit a new application if they are able to get the approval of this other body with authority over the deal. But all of the reasons behind ICANN’s rejection of the sale will confront Ethos in Pennsylvania, as well.\n This decision by ICANN is a hard-fought victory for nonprofit Internet users. But the .ORG registry still needs a faithful steward, because the Internet Society has made clear it no longer wants that responsibility. ICANN should hold an open consultation, as they did in 2002, to select a new operator of the .ORG domain that will give nonprofits a real voice in its governance, and a real guarantee against censorship and financial exploitation.", "posttime": "2020-05-16 04:06:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sale,icann", "title": "ICANN Rejects.org出售给私募股权公司ethos Capital", "title_en": "ICANN Rejects .ORG Sale to Private Equity Firm Ethos Capital", "transed": 1, "url": "https://www.eff.org/deeplinks/2020/04/victory-icann-rejects-org-sale-private-equity-firm-ethos-capital", "via": "", "real_tags": ["sale", "icann"]}, {"category": "", "categoryclass": "", "imagename": "5c08a7e82774d6af4b7e90d1a37bc535.jpg", "infoid": 1002295, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据说，台积电制造有限公司已经与特朗普政府就其计划将下一家主要制造厂设在亚利桑那州的计划进行了谈判，这是一次潜在的全球贸易调整，旨在缓解美国对供应链安全的担忧。", "note_en": "Taiwan Semiconductor Manufacturing Co is said to have negotiated a deal with the Trump administration for its plan to locate its next major fabrication facility in Arizona, in a potential realignment of global trade designed to allay US concerns over supply chain security.", "posttime": "2020-05-16 04:06:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "芯片,电将,plant,计划", "title": "台积电将在美国政府支持下斥资120亿美元在亚利桑那州建芯片厂", "title_en": "TSMC to build US$12B chip plant in Arizona with US government support", "transed": 1, "url": "https://www.scmp.com/tech/gear/article/3084491/tsmc-build-us12-billion-chip-plant-arizona-us-government-support", "via": "", "real_tags": ["芯片", "电将", "plant", "计划"]}, {"category": "", "categoryclass": "", "imagename": "df683e33915c2303d59a7611b962d490.jpg", "infoid": 1002294, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在加州大学旧金山分校在任务区领导的一项重大检测工作中，4160名接受冠状病毒检测的人中有2.1%呈阳性。在那些检测呈阳性的人中，90%的人报告说不能在家工作。\n90%的PCR阳性者在避难所期间没有在家工作的能力。旧金山总医院加州大学旧金山分校艾滋病毒、感染和全球疾病部主任Diane Havlir博士告诉KCBS，“这些人都是一线工作人员，他们必须在家里工作，否则他们要么被暂时解雇，要么失业。”\n加州大学旧金山分校的医学助理教授Carina Marquez博士在一份声明中说：“冠状病毒大流行对旧金山的拉丁裔社区造成了不成比例的影响，无论是感染率还是经济困难，我们一直与冠状病毒拉丁裔特别工作组非常密切地合作，通过努力阻断疾病的传播来支持这个社区，”加州大学旧金山分校的医学助理教授卡琳娜·马尔克斯博士(Dr.Carina Marquez)在一份声明中说。\n4月25日至28日，从塞萨尔·查韦斯(Cesar Chavez)到第23街、南范内斯(South Van Ness)到哈里森街(Harrison Street)的16个街区内的每一位居民都接受了免费的自愿冠状病毒检测(见上面图库中的地图)。这是这座城市人口密度第二高的地区，居住在这里的居民中略多于一半的人接受了检测。\n虽然这项研究的投票率被认为是成功的，但研究人员表示，那些没有进行访问测试的人担心被政府机构追踪，以及如果该社区被贴上冠状病毒热点的标签，可能会对当地企业造成负面影响。一些人还担心，如果他们的检测呈阳性，可能会产生孤立的后果。\n研究人员进行了两种类型的测试，以确定那些目前感染了病毒的人和那些以前感染过病毒的人。活动性冠状病毒诊断试验采用鼻拭子采集样本，抗体试验采用指刺法采集血样。结果在72小时内就出来了。\n根据加州大学旧金山分校的一份声明，检测呈阳性的人立即接到加州大学旧金山分校传染病专家的随访电话，而那些检测为阴性的人预计将继续遵循收容所命令，因为可能出现假阴性检测结果，而且普遍缺乏关于再次感染这种疾病的可能性的信息。\n在一份针对研究结果发布的初步声明中，加州大学旧金山分校表示，到目前为止，研究结果表明，感染风险最高的人是那些由于失业、休假或提供基本服务而无法轻松避难的人。在那些检测呈阳性的人中，90%的人报告说无法在家工作。相比之下，在那些检测呈阴性的人中，53%的人报告说他们的工作或财务稳定没有受到影响。在检测呈阳性的人中，近89%的人年收入不到5万美元，大多数人生活在3到5人的家庭(59.6%)或更大的家庭(28.8%)。值得注意的是，居住在人口普查区域以外但去那里工作的人比当地居民(1.4%)更有可能检测出阳性(6.1%)。\n这项研究旨在揭示病毒的隐形传播，并帮助为未来在其他社区的测试工作提供信息。\n加州大学旧金山分校的医学副教授布莱恩·格林伯格博士在一份声明中说，“我们所有的公共卫生决定，包括何时可以放松地区和全州范围内的就地避难所命令，都是基于对这种病毒行为的粗略假设，基于非常有限的数据。”\n格林说，详细研究病毒的传播将为研究人员提供关键的数据点，我们可以推断出这些数据点，以便更好地预测如何在全国类似的社区控制病毒。\n加州大学旧金山分校在海滨小镇博利纳斯也进行了类似的努力。在近1800人的测试中，没有人呈阳性。", "note_en": "In a major testing effort led by UC San Francisco in the Mission District, 2.1% of the 4,160 people tested for COVID-19 were positive. Of those who tested positive, 90% &#34;reported being unable to work from home.&#34;\n   &#34;Ninety percent of the people who were PCR positive had no capability of working from home during shelter in place. These were frontline workers, they had to work outside of the home, either that or they were furloughed or unemployed,” Dr. Diane Havlir, chief of the UCSF Division of HIV, Infection, and Global Disease at San Francisco General, told  KCBS.\n            &#34;The COVID-19 pandemic is disproportionately affecting the Latinx community in San Francisco, both in terms of infection rates and economic hardship, and we have been partnering very closely with the Latino Task Force for COVID-19 to support this community by working to disrupt transmission of the disease,” Dr. Carina Marquez, an assistant professor of medicine at UCSF, said in a statement.\n          From April 25 to 28, free, voluntary COVID-19 testing was offered to every resident in a 16-block area running from Cesar Chavez to 23rd Street and South Van Ness to Harrison Street (see a map in the gallery above). This is the second most dense area of the city and a little over half of the residents living here were tested.\n       While turnout for the study was considered a success, researchers said those people who didn&#39;t access testing feared being tracked by government agencies and the potential negative impact on local businesses if the neighborhood is branded a COVID-19 hotspot. Some also were afraid of the potential consequences of isolation if they tested positive.\n       Researchers conducted two types of tests to identify those individuals who are currently infected and those who previously had the virus. The diagnostic test for active COVID-19 was implemented by collecting samples with nasal swabs while the antibody test was done with a finger-prick to collect a blood sample. Results were available within 72 hours.\n   People who tested positive received immediate follow-up calls from UCSF infectious disease experts while those who test negative are expected to continue following the shelter-in-place order &#34;because of the possibility of false negative test results and a general lack of information about the potential for reinfection with the disease,&#34; according to a statement from UCSF.\n      In a preliminary statement released on the study results, UCSF said, &#34;The results so far suggest that those who are at highest risk for infection are those who cannot easily shelter in place due to job loss, furloughs, or because they are providing the essential services. Among those who tested positive, 90 percent reported being unable to work from home. In contrast, among those who tested negative, 53 percent reported no impact on their work or financial stability. Nearly 89 percent of those who tested positive earn less than $50,000 a year and most live in households of 3 to 5 people (59.6 percent) or larger (28.8 percent). Notably, people who lived outside the census tract but who go there for work were much more likely to test positive (6.1 percent) than residents (1.4 percent).&#34;\n   The study is meant to reveal the invisible spread of the virus and help inform future testing efforts in other communities.\n   “All our public health decisions, including when it will be possible to relax regional and statewide shelter-in-place orders, are driven by rough assumptions about how this virus behaves based on very limited data,” said Dr. Bryan Greenhouse, an associate professor of medicine at UCSF, in a statement.\n   Greenhouse said studying the spread in detail will give researchers &#34;crucial data points that we can extrapolate to better predict how to control the virus in similar communities nationwide.”\n   UCSF conducted a  similar effort in the coastal town of Bolinas. Of the nearly 1,800 people tested, nobody was positive.", "posttime": "2020-05-16 04:05:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,病毒,检测,district", "title": "任务区90%的冠状病毒检测呈阳性的人不能进行WFH", "title_en": "90% of people who tested positive for Covid-19 in Mission District could not WFH", "transed": 1, "url": "https://www.sfgate.com/news/editorspicks/article/90-of-people-who-tested-positive-for-COVID-19-in-15247476.php", "via": "", "real_tags": ["冠状病毒", "病毒", "检测", "district"]}, {"category": "", "categoryclass": "", "imagename": "3a407fa8ab10652c3e8c206c8fcd5602.png", "infoid": 1002293, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "众议院引入了新的冠状病毒应急立法，以应对美国几代人以来面临的最大的公共卫生和经济灾难。就像它本应解决的危机一样，这项法案也是巨额的。有一项条款值得特别关注：如果你受到冠状病毒的经济损害，保证免费上网(正如国会议员马克·维西(Marc Veasey)推动的立法最初设想的那样)。\n互联网接入比以往任何时候都更加重要，因为那些可以在家工作的人，孩子们在网上上学，人们普遍依赖互联网获取信息。人们正在以几乎史无前例的速度失业-美国正面临自大萧条以来的最高失业率。“除了我们面临的所有其他经济压力之外，没有人承担得起失去互联网接入的代价。\n美国人将在很长一段时间内经历这样或那样的社会疏远。这意味着许多依赖于大型集会的企业、教育机构、宗教服务和社会功能都将在网上进行。即使是对有限数量的面对面互动敞开大门的组织，也可能最终依赖互联网来弥补差额或为高危人群提供服务。\n数以千万计的美国人已经失去了收入，这不是他们自己的错，他们正在遵守公共卫生紧急要求，呆在家里，减少彼此的接触，以避免传播感染。这使得到他们家的宽带接入成为与他们的朋友、家人和未来雇主安全通信的唯一手段。\n对于受冠状病毒影响的有孩子的父母来说，宽带接入将是提供远程教育的手段。对于老年人和其他面临病毒高风险的人来说，宽带接入将是在家中与家人保持联系的手段-以及让他们的家人定期检查他们的情况。对于每个人来说，许多面对面的医疗保健已经被远程医疗补充或取代。宽带一直是一项必不可少的服务。但在全球大流行带来的条件下，这是全面参与社会的必由之路。\n在非常基本的层面上，该法案中的紧急宽带福利计划要求互联网服务提供商(ISP)为受冠状病毒影响的人提供免费宽带服务，政府以固定的费率补偿ISP。该法案还锁定了互联网服务提供商在危机期间提供的任何促销费率-在危机结束之前，互联网服务提供商不能开始向人们收取更高的费用。而且，这些特殊交易的附带条件将会更少，因为它通过取消提前解约费，有效地终止了与促销低价相关的强制性长期合同。\n正如前面提到的，这笔账单是巨大的。随着它的各个部分都在重新谈判，国会必须记住，互联网接入是至关重要的，不能拿来讨价还价。\n许多美国人在高速互联网提供商之间几乎没有选择。而垄断和近乎垄断的公司几乎没有动机保持低价格或高速度。这项法案将解决等式中的价格部分，确保美国人在危机期间能够保持在线。这不仅仅是冠状病毒救济的附加条件；相反，它必须是政策制定者的优先事项。", "note_en": "The House of Representatives has introduced new   COVID-19 emergency response legislation  to address the largest public health and economic calamity the United States has faced in generations. Like the crisis it is meant to address, the bill is massive. One provision deserves particular attention: guaranteeing free Internet access if you have been economically harmed by COVID-19 (as originally envisioned in   legislation promoted by Congressman Marc Veasey ).\n Internet access is more important than ever, as those who can work from home, kids are attending school online, and people in general rely on the Internet for information. People are losing jobs at almost unprecedented rates—the U.S. is facing the   highest unemployment rate since the Great Depression .  No one can afford to lose Internet access on top of all the other economic stress we are facing.\n Americans will be experiencing social distancing, in some form or another, for   a long time . That means many businesses, education institutions, religious services, and social functions that rely on large gatherings will do so online. Even organizations that open their doors for limited numbers of in-person interactions may end up relying on the Internet to make up the difference or serve at-risk populations.\n  Tens of millions of Americans have lost their incomes through no fault of their own, and are complying with the public health emergency requirements to stay at home and reduce their contact with one another to avoid spreading the infection. This makes broadband access to their homes the only means of communicating safely with their friends, family, and prospective employers.\n For the COVID-19 impacted parents with children, broadband access will be the means of providing remote education. And for seniors and others highly at risk from the virus, broadband access will be the means to stay in touch with their families from their homes—and for their families to regularly check in on them. For everyone, a lot of face-to-face healthcare has been supplemented or replaced by telehealth. Broadband has always been an essential service. But under the conditions brought on by the global pandemic, it is the only way to fully participate in society.\n At a very basic level, the Emergency Broadband Benefit Program in this bill requires Internet Service Providers (ISPs) to offer free broadband service for COVID-19 impacted people, with the government compensating the ISPs at a set rate. The bill also locks in any of the promotional rates ISPs offered during the crisis for the duration of the crisis—ISPs cannot start charging people more until the crisis is over. And those special deals will come with fewer strings, since it effectively ends mandatory long-term contracts attached to promotional low prices by eliminating early termination fees.\n As mentioned, this bill is   massive . As various parts of it are renegotiated, Congress must keep in mind that Internet access is vital and cannot be bargained away.\n Many Americans have little to no choice among high-speed Internet providers. And monopolies and near-monopolies   have little to no incentive  to keep prices low or speeds high. This bill will address the price part of the equation, ensuring that Americans can stay online during the crisis. This is not something merely tacked on to COVID-19 relief; rather, it must be a priority for policymakers.", "posttime": "2020-05-16 04:04:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,病毒,接入,legislation,互联网", "title": "众议院立法保障受冠状病毒影响的人接入互联网", "title_en": "House Legislation Guarantees Internet Access for Those Affected by Covid-19", "transed": 1, "url": "https://www.eff.org/deeplinks/2020/05/house-legislation-guarantees-internet-access-those-affected-covid-19", "via": "", "real_tags": ["冠状病毒", "病毒", "接入", "互联网"]}, {"category": "", "categoryclass": "", "imagename": "a8313aba4769aa15a1f18a323e80ea39.jpg", "infoid": 1002292, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国有线电视新闻网(CNN)根据疾病控制和预防中心发布的一份报告，研究冠状病毒在华盛顿唱诗班成员中爆发的公共卫生官员发现，病毒可能有多种传播途径。\n当局采访了斯卡吉特山谷合唱团的所有122名成员，他们在疫情爆发前每周二开会，持续了2.5个小时。他们重点关注了3月3日和3月10日在华盛顿州弗农山举行的两次彩排。\n报道称，有53人患病，两人死亡，除一人外，所有人都参加了两次彩排。报告称，已确认33例，20人可能感染。\n3月10日的彩排有61人，其中一名成员报告说有感冒症状。根据报告，该人的冠状病毒检测呈阳性，是卫生当局确认的第一例病例。\n根据斯卡吉特县公共卫生的一份声明，县官员在3月10日发布了社交疏远建议，但大多数人可能还没有意识到这些建议。\n没有人报告参加训练的人之间有身体接触，但他们坐得很近。报道称，椅子之间的距离为6-10英寸，但一些成员之间有空位。\n合唱团分成两组进行部分练习。他们说，在那45分钟的会议中，成员们走得更近了。\n报告称，歌唱行为本身可能有助于通过气溶胶的排放传播，而气溶胶的传播受到发声响度的影响。报告还说，一些被称为超级排放者的人在演讲过程中比同龄人释放更多的气溶胶颗粒。\n还有15分钟的点心休息时间，有饼干和橙子。报道称，成员们在排练前后移动了椅子，并聚集在一个椅架周围。\n报告称，这突显了身体距离的重要性，包括保持人与人之间至少6英尺的距离，避免人群聚集和拥挤的地方，以及在公共场合穿布质面罩，因为在这场流行病期间，其他社交距离措施很难维持。\n报道称，参与者在3月10日练习后一天至12天内出现症状。\n报告称，大多数歌手是女性(84%)，她们的年龄中值为69岁。只有32%的人报告有潜在的健康状况。\n合唱团于3月15日给成员发电子邮件，让他们知道有些人生病了。在卫生官员联系他们时，许多人已经自我隔离，报告说，这可能已经缓解了进一步的传播。\n这项研究是由斯卡吉特县公共卫生官员进行的，并发表在疾控中心的发病率和死亡率周报上。", "note_en": "(CNN)Public health officials studying the Covid-19 outbreak among members of a Washington choir found numerous ways the virus could have spread,  according to a report published by the Centers for Disease Control and Prevention.\n Authorities interviewed all 122 members of  the Skagit Valley Chorale, which met every Tuesday for 2.5 hours before the outbreak. They focused on two rehearsals held March 3 and March 10 in Mount Vernon, Washington.\n The report said 53 people were sickened and two died -- and all but one attended both rehearsals. The report said Thirty-three cases were confirmed, the report said, and 20 people had probable infections.\n    There were 61 people at the March 10 rehearsal, including one member who reported having had cold-like symptoms. That person tested positive for Covid-19 and was the first case identified by health authorities, according to the report.\n   County officials issued social distancing recommendations on March 10, but most people were probably not yet aware of them,  according to a statement from Skagit County Public Health.\n No one reported physical contact between the attendees at the practices, but they sat close together. The report said the chairs were 6-10 inches apart, but there were empty seats between some of the members.\n  The choir broke into two groups for part of the practice. Members moved closer together for that 45-minute session, they said.\n &#34;The act of singing, itself, might have contributed to transmission through emission of aerosols, which is affected by loudness of vocalization,&#34; the report said. The report also said that some people, known as superemitters, release more aerosol particles during speech than their peers.\n There was also a 15-minute snack break with cookies and oranges. Members moved the chairs before and after the rehearsal and congregated around a chair rack, the report said.\n &#34;This underscores the importance of physical distancing, including maintaining at least 6 feet between persons, avoiding group gatherings and crowded places, and wearing cloth face coverings in public settings where other social distancing measures are difficult to maintain during this pandemic,&#34; the report said.\n  Attendees developed symptoms between one day to 12 days after the March 10 practice, the report said.\n Most of the singers were women (84%) and their median age was 69, the report said. Only 32% reported having underlying health conditions.\n   The choir emailed members March 15 to let them know that some people had gotten sick. Many had self-quarantined by the time health officials contacted them, and the report said this may have mitigated further spread.\n The study was conducted by Skagit County Public Heath officials and published in the CDC&#39;s Morbidity and Mortality Weekly Report.", "posttime": "2020-05-16 03:47:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "冠状病毒,coronavirus,病毒,传播,spread", "title": "冠状病毒如何从一名成员传播到华盛顿合唱团诊所87%的歌手", "title_en": "How Coronavirus Spread From One Member To 87% of the Singers at a Washington Choir Practice", "transed": 1, "url": "https://edition.cnn.com/2020/05/13/us/coronavirus-washington-choir-outbreak-trnd/index.html", "via": "", "real_tags": ["冠状病毒", "病毒", "传播", "spread"]}, {"category": "", "categoryclass": "", "imagename": "0f67c4d73c74615fb85c3848ef9fafdb.png", "infoid": 1002291, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "动视正在强迫战区游戏玩家使用他们的手机号码登录，并将其作为一种欺骗作弊者的方式。", "note_en": "Activision is forcing Warzone gamers to use their cellphone number to log in, and using it as a way to permaban cheaters. ", "posttime": "2020-05-16 03:46:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "召唤,duty,作弊者", "title": "《使命召唤：战区》作弊者归2FA所有", "title_en": "'Call of Duty: Warzone' Cheaters Are Getting Owned by 2FA", "transed": 1, "url": "https://www.vice.com/en_us/article/3azzyn/call-of-duty-warzone-cheaters-2fa-cellphone-number", "via": "", "real_tags": ["召唤", "duty", "作弊者"]}, {"category": "", "categoryclass": "", "imagename": "54acbfd043bcca4a1e999d75b1a9c538.jpg", "infoid": 1002290, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "林德尔写道，20世纪30年代，南达科他州超过80%的人口生活在农村地区。这些家庭深受干旱、沙尘暴、蝗虫侵袭和农作物价格下跌的影响。大多数家庭没有自来水、电、中央供暖或电话服务。根据1930年的一项州调查，农场妇女平均每周工作66小时。除了照看孩子和做家务外，他们还在农场做户外工作，有时还为了工资而工作。\n但对于妇女福利倡导者来说，农村妇女花时间阅读是至关重要的。\n来自南达科他州阿斯托里亚的妇女俱乐部负责人达格尼·欣德雷克(Dagney Hinderaker)写道，“每个女性，无论工作多么努力，都必须时不时地停下来娱乐一下，即使这可能只是一个偶尔的晚上或周日下午。”“如果他们愿意坐下来看书，他们会更加精神饱满，思考的事情也会更多。”\n林德尔认为，对许多女性来说，阅读似乎是一种合理的休闲方式。它比收音机更实惠，比电影院更方便。一些妇女给她们的孩子读书，一家人一起学习圣经。但女性读者报告说，她们阅读很大程度上是因为它很有趣。\n一位网友写道：“那些生活最单调的人可能会觉得自己脱颖而出，进入了一个更快乐的生活阶段。”\n在写给“农民的妻子”杂志的一封信中，另一位来自明尼苏达州的农妇宣称，“如果有必要，不要扫地；简化你的用餐；但要腾出时间来阅读、学习和思考。”\n最喜欢的书包括赞恩·格雷的西部小说和其他当代小说，以及经典作品，如“傲慢与偏见”。据报道，受过更多教育的农场女性阅读更多的非虚构类书籍，但所有教育水平的女性都会阅读。\n然而，林德尔写道，阅读材料的获取可能是一个问题。南达科他州的一名妇女报告说，邻居们凑钱订阅了当地的报纸，聚集在一个或另一个家里阅读。另一位解释说，一家妇女俱乐部给她寄来了旧杂志，她把它们分发给了她的熟人。\n她写道：“我利用每一个机会来了解来的人(可能是为了绵羊或其他一些差事)是否喜欢吃一些。”\n您可以通过单击任何营销消息上提供的链接随时取消订阅。\n为农村读者提供的另一个重要资源是南达科他州免费图书馆委员会的巡回图书馆计划。任何一个小镇或家庭团体都可以申请六个月的借阅，藏书从20到70本不等。该委员会还建立了县图书馆，不是由一座专门的建筑组成，而是有一个项目，使学校、邮局、奶油厂和农舍都能买到书。\n当然，现在去邮局取一本书可能会引起焦虑。幸运的是，许多图书馆都在用他们的电子书藏书给我们带来娱乐。\nJSTOR是一个面向学者、研究人员和学生的数字图书馆。JSTOR Daily的读者可以在JSTOR上免费访问我们文章背后的原始研究。\n您可以通过单击任何营销消息上提供的链接随时取消订阅。", "note_en": "Lindell writes that more than 80 percent of South Dakota’s population lived in rural areas in the 1930s. These households suffered immensely from drought, dust storms, grasshopper infestations, and falling crop prices. Most homes had no running water, electricity, central heating, or telephone service. Farm women spent an average of sixty-six hours a week working, according to a 1930 state survey. In addition to childcare and housework, they did outdoor work on their farms and sometimes worked for wages, too.\n    But to advocates for women’s welfare, it was crucial that farm women took time to read.\n “Every women, no matter how hard she must work, must pause at times for recreation, even though it may be only an occasional evening or Sunday afternoon,” Dagney Hinderaker, a women’s club leader from Astoria, South Dakota, wrote. “They will be more refreshed and have more things to think about if they will sit down and read.”\n To many women, Lindell argues, reading seemed like a justifiable form of leisure. It was more affordable than radio and more accessible than a movie theater. Some women read to their children, and families studied the Bible together. But female readers reported that they read largely because it was fun.\n “Those whose lives are the most humdrum may feel themselves lifted out of the ordinary into a more joyous phase of living,” one wrote.\n In a letter to  The Farmer’s Wife magazine, another farm woman from Minnesota proclaimed, “Let the floor go unswept if necessary; simplify your meals; but make time for reading, studying and thinking.”\n Favorite books included Zane Grey westerns and other contemporary novels, as well as classics like  Pride and Prejudice. Farm women with more education reported reading more nonfiction books, but women of all educational levels read.\n However, Lindell writes, access to reading materials could be an issue. One South Dakota woman reported that neighbors pooled their money for a subscription to the local newspaper, gathering at one home or another to read it. Another explained that a women’s club sent her old magazines, which she distributed among her acquaintances.\n “I used every opportunity to learn whether someone who comes (perhaps about sheep or some other errand) would like some,” she wrote.\n  You may unsubscribe at any time by clicking on the provided link on any marketing message.\n  Another important resource for rural readers was the South Dakota Free Library Commission’s traveling library program. Any small town or group of families could request a six-month loan of a collection of anywhere from twenty to seventy books. The commission also set up county libraries consisting not of a dedicated building but a program making books available at schools, post offices, creameries, and farmhouses.\n Right now, of course, heading to a post office to pick up a book might cause anxiety. Fortunately, many libraries are keeping us entertained with their e-book collections.\n        JSTOR is a digital library for scholars, researchers, and students. JSTOR Daily readers can access the original research behind our articles for free on JSTOR.\n  You may unsubscribe at any time by clicking on the provided link on any marketing message.", "posttime": "2020-05-16 03:45:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "农妇,farm,阅读", "title": "阅读让农妇们度过了大萧条", "title_en": "Reading Got Farm Women Through the Depression", "transed": 1, "url": "https://daily.jstor.org/how-reading-got-farm-women-through-the-depression/", "via": "", "real_tags": ["农妇", "farm", "阅读"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002289, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PeerTube是一个优秀的项目，它的目标是创建一个开放和分散的视频“管道”，用于托管视频内容，采用分布式管理和社区驱动的开发。Chocobozzz在数十位贡献者的帮助下，投入了艰苦的工程工作来建立一个伟大的平台，现在我们希望看到它充满内容。\n为了帮助实现这一目标，SourceHut承诺投入5000美元引导PeerTube网络上的内容。这笔钱将用于帮助新的内容创作者开始为PeerTube制作视频。我们将支付一些设备来帮助您入门：相机、麦克风、视频采集卡等等，只要适合您要制作的视频类型，外加200美元的预算将由您自行决定前几个视频的费用。需要一台好相机吗？一对漂亮的麦克风用来进行采访吗？一架用来捕捉镜头的无人机？让我们来实现吧。你还将被安置在Liberapay，这样你的勇气就可以帮助你建立一种可持续的生活方式。\n如果你有一个有趣的爱好要分享，有关于某一学科的深入知识要教，或者你有想要炫耀的才华，或者有一个我们没有想到的好主意，请发电子邮件到sr@cmpwn.com，主题行是“PeerTube Bootstrap应用程序：&lt；你的名字&&gt;34；”(PeerTube Bootstrap application：&lt；your name&gt；&34；)(注：“PeerTube Bootstrap application：&lt；your name&&gt;34；”)。包括你是谁和你为什么要申请的简短总结，以及你想要制作的视频的细节。告诉我们为什么开放文化对你很重要。\n您一定还没有在其他平台上定期发布内容。我们希望资助新的内容创建者，而不是现有的内容创建者。1个。\n我们希望您至少制作5个视频。如果在那之后你认为视频制作不适合你，我们将收回设备，你就可以摆脱困境了。\n一旦你开始在Liberapay上每月至少赚20美元，我们将在所有创建者之间平分正在进行的托管成本：目前是45美元/月。你将永远不会被期望支付超过你Liberapay收入的25%，其余的将由SourceHut来支付。\n我们的实例位于spacepub.space。我们将处理服务器的技术管理，并为您设置入门所需的资源，我们将共同创建一个开放文化创建者社区，他们相互支持，形成充满活力的公地。让我们共同打造PeerTube精彩的平台！\n如果你已经另外做了几个视频，那很好--一定要在你的申请中让我们知道，我们会酌情决定的。↩︎", "note_en": "PeerTube is an excellent project which aims to create an open anddecentralized video “tube” for hosting video content with distributed governanceand community-driven development. Chocobozzz, with the help of dozens ofcontributors, has put in the hard engineering work to build a great platform,and now we want to see it filled with content.\n  To help make this happen,  SourceHut is committing $5,000 to bootstrap contenton the PeerTube network. This money will be used to help new content creatorsstart making videos for PeerTube. We’ll pay for some equipment to get youstarted: cameras, microphones, video capture cards, and so on, whatever isappropriate for the kind of videos you intend to make, plus a $200 budget tospend at your discretion on the first few videos. Need a nice camera? A coupleof nice microphones for conducting interviews? A drone for capturing footage?Let’s make it happen. You’ll also be set up on  Liberapay so that youraudience can help you build a sustainable lifestyle.\n If you have an interesting hobby to share, in-depth knowledge on a subject toteach, or a talent you’d like to show off, or a great idea we haven’t thoughtof, please send an email to  sir@cmpwn.com with thesubject line “PeerTube bootstrap application: &lt;your name&gt;&#34;. Include ashort summary of who you are and why you want to apply, and details on whatkinds of videos you’d like to make. Tell us why open culture is important toyou.\n  You must not already be regularly publishing content on another platform.We’re looking to fund new content creators, not existing ones.  1\n   We expect you to make at least 5 videos. If you decide video creation isn’tfor you after that, we’ll take the equipment back and you’ll be off the hook.\n Once you start earning at least $20/month on Liberapay, we’ll split theongoing cost of hosting evenly among all creators: currently $45/mo. You willnever be expected to pay more than 25% of your Liberapay income; SourceHutwill cover the rest.\n Our instance is at  spacepub.space. We’ll handle the technicaladministration of the server and set you up with the resources you need to getstarted, and together we’ll create a community of open-culture creators whosupport one another to produce a vibrant commons. Let’s help make PeerTube agreat platform!\n If you’ve already made a few videos on the side, that’s fine - be sure to let us know in your application, and we’ll exercise discretion.  ↩︎", "posttime": "2020-05-16 03:45:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "content,视频", "title": "PeerTube Content Bootstrap基金", "title_en": "The PeerTube content bootstrap fund", "transed": 1, "url": "https://sourcehut.org/blog/2020-05-15-peertube-bootstrap-fund/", "via": "", "real_tags": ["content", "视频"]}, {"category": "", "categoryclass": "", "imagename": "f057d335e11fc2a0bd2c09b880196a3d.png", "infoid": 1002288, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天iOS的Signal测试版包括对GIF动画搜索的支持。Signal iOS长期以来一直支持发送和接收GIF，但今天的测试版增加了在Signal内浏览和搜索流行的GIF的支持。我们之前宣布在Signal Android中对动画GIF搜索提供试验性支持，现在我们将把它带到iOS上，同时还对该过程进行了一些隐私更新。像GIPHY这样的GIF搜索引擎提供了网络API，允许应用程序轻松地显示GIF的趋势和搜索功能。例如，如果有人给你发了一条邀请的短信，你可能想回复一条说“我很兴奋”的短信。使用集成的GIF搜索，您可以使用GIF搜索“我很兴奋”，然后发送其中一个结果。当然，当你输入搜索时，它会通过网络传输到GIF搜索引擎：为了对GIPHY隐藏你的搜索词，Signal服务充当隐私保护代理。查询GIPHY时：信号应用程序打开到信号服务的TCP连接。信号服务打开到GIPHY HTTPS API终结点的TCP连接，并在APP和GIPHY之间中继字节。Signal APP通过代理TCP连接一直协商TLS到GIPHY HTTPS API端点。\n由于通信是通过TLS一直到GIPHY进行的，因此信号服务永远看不到发送或接收的明文内容。因为TCP连接是通过信号服务代理的，所以GIPHY不知道是谁发出了请求。信号服务实质上充当GIPHY流量的VPN：信号服务知道您是谁，但不知道您在搜索或选择什么。GIPHY API服务可以看到搜索词，但看不到您是谁。这很有效，但我们也一直在考虑如何提高对流量分析的抵抗力。如果信号服务是恶意的，它可以测量正在传输的数据量，以便辨别正在从GIPHY检索的GIF的一些信息。缓解此类攻击的最常见方法是引入明文填充。在每个GIF的末尾包括随机数量的填充将使信号服务更难将它看到的正在传输的数据量与已知的GIF相关联。然而，问题是我们不能控制内容。如何填充您无法控制的明文内容？RFC 7233规范允许HTTP客户端指示它们希望从远程服务器接收文件的哪些部分。客户端在其请求中传递一个Range标头，服务器在该字节范围内传递部分内容。除了其他功能外，此功能还允许您的浏览器恢复中断的下载，立即开始显示大型文档，并快速查找到长视频中的给定位置。我们还可以滥用范围请求来模拟不受控制的内容的填充。在上图中，客户端希望下载一个13字节的文件。然而，客户端不希望向网络透露它恰好检索到了13个字节。它不是发出普通请求，而是选择一个块大小(在本例中为6字节)，并发出该大小的顺序范围请求。对于第三个也是最后一个请求，只剩下1个字节需要检索，但是它对最后6个字节进行了重叠请求，并丢弃了最后一个请求的前5个字节。客户端刚刚成功地将这段13字节的内容“填充”了5个字节，这使得任何网络观察者都更难确定检索到的内容的真实长度。当我们在以下GIF上尝试此策略时，请随意跟随您的终端中的操作：首先，我们将确定目标文件的大小，并验证服务器是否支持范围请求：我们使用1MB范围大小(以字节为单位)下载文件的第一段：接下来，我们将下载文件的第二段(也使用1MB范围大小)，它将与第一段部分重叠。我们需要丢弃第二个数据段中重叠的字节。我们取两个段的合并字节大小，然后减去原始文件的字节大小。这就留下了需要从第二个数据段中删减的131727个字节：现在我们准备将两个文件数据段合并在一起：最后，我们可以验证合并后的文件是否与原始文件相同：当使用此策略通过隧道信号服务发送tls加密的请求时，我们将用两个大小相同的传输替换1965425字节的单个传输，每个传输的块大小为1MB。因此，信号代理服务在路由流量时只看到块大小的重复请求，这应该会使识别该流量的内容变得更加困难。我们还在继续研究其他措施，比如随机化结果顺序和随机化跨多个下载的请求。我们不相信", "note_en": "Today’s Signal beta for iOS includes support for animated GIF search. Signal iOS has long supported sending and receiving GIFs, but today’s beta adds support for browsing and searching popular GIFs from within Signal. We  previously announced experimental support for animated GIF search in Signal Android, which we’re now bringing to iOS, along with some privacy updates to the process. GIF search engines like GIPHY provide network APIs that allow an app to easily expose trending and search functionality for GIFs. For instance, if someone messages you with an invitation, you might want to write back with a message that says “I’m excited.” With integrated GIF search, you could instead do a GIF search for “I’m excited” and send one of the results instead. Of course, as you type your search, it’s transmitted over the network to the GIF search engine:  In order to hide your search term from GIPHY, the Signal service acts as a privacy-preserving proxy. When querying GIPHY: The Signal app opens a TCP connection to the Signal service. The Signal service opens a TCP connection to the GIPHY HTTPS API endpoint and relays bytes between the app and GIPHY. The Signal app negotiates TLS through the proxied TCP connection all the way to the GIPHY HTTPS API endpoint.\n Since communication is done via TLS all the way to GIPHY, the Signal service never sees the plaintext contents of what is transmitted or received. Since the TCP connection is proxied through the Signal service, GIPHY doesn’t know who issued the request. The Signal service essentially acts as a VPN for GIPHY traffic: the Signal service knows who you are, but not what you’re searching for or selecting. The GIPHY API service sees the search term, but not who you are.  This has worked well, but we have also been thinking about ways to improve resistance to traffic analysis. If the Signal service were malicious, it could measure the amount of data being transmitted in order to discern something about the GIFs being retrieved from GIPHY. The most common way to mitigate an attack like that is through the introduction of plaintext padding. Including a random amount of padding at the end of each GIF would make it more difficult for the Signal service to correlate the amount of data it sees being transmitted with a known GIF. The problem, however, is that we don’t control the content. How can you pad plaintext content that you don’t control?  The  RFC 7233 specification allows HTTP clients to indicate which portions of a file they would like to receive from a remote server. The client passes a  Range header in its request, and the server delivers the partial content within that byte range. Among other things, this functionality allows your browser to resume interrupted downloads, begin displaying large documents immediately, and quickly seek to a given position within long videos. We can  also abuse range requests to simulate padding on content we don’t control. In the diagram above, a client wishes to download a 13-byte file. However, the client doesn’t wish to reveal to the network that it has retrieved exactly 13 bytes. Instead of making a normal request, it picks a block size (in this case 6 bytes), and issues sequential range requests for that amount. For the third and final request, there is only 1 byte remaining to be retrieved, but it instead makes an  overlapping request for the final 6 bytes, and discards the first 5 bytes of the final request. The client has just successfully “padded” this 13-byte piece of content by 5 bytes, making it more difficult for any network observer to determine the true length of what was retrieved.  Feel free to follow along with the action in your terminal as we try this strategy on the following GIF: First, we’ll determine the size of the target file and verify that the server supports range requests:  We download the first segment of the file using a 1MB range size (specified in bytes):  Next we’ll download the second segment of the file (also using a 1MB range size) which will partially overlap with the first.  We need to discard the overlapping bytes in the second segment. We take the combined byte size of the two segments and subtract the byte size of the original file. This leaves us with  131727 bytes that need to be trimmed from the second segment:  Now we are ready to combine our two file segments together:  Finally, we can verify that the combined file is the same as the original:  When TLS-encrypted requests are sent through the tunneled Signal service using this strategy, we’re replacing a single transfer of  1965425 bytes with two identically sized transfers for blocks of 1MB each. As a result, the Signal proxy service only sees repeated requests of a block size when routing traffic, which should make it more difficult to identify the content of that traffic. We’re continuing to look at additional measures like randomizing the order of results and randomizing requests striped across multiple downloads.  We don’t believe that privacy is about austerity. Communication should be expressive and fun. We want you to avoid sending plaintext, but that doesn’t mean that your texts should always be so plain. Send an animated GIF today, and let us know what you think. If you’re ready for a life of adventure (and occasional sadness), you can sign up for the Signal iOS beta channel by emailing support@whispersystems.org. Please include “Signal iOS Beta” in the subject line. If you need a stable and reliable messaging experience, we encourage you to wait a few days for the production release.", "posttime": "2020-05-16 03:44:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "giphy,preserves,gif", "title": "Signal在GIPHY上保护隐私(2017)", "title_en": "Signal preserves privacy on GIPHY (2017)", "transed": 1, "url": "https://signal.org/blog/signal-and-giphy-update/", "via": "", "real_tags": ["giphy", "preserves", "gif"]}, {"category": "", "categoryclass": "", "imagename": "b9b6c904d850860c5dc75ebf1ffaa316.jpeg", "infoid": 1002287, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "旧金山--加州大学旧金山分校(University of California，San Francisco)医学系主任鲍勃·瓦克特(Bob Wachter)在冠状病毒大流行中坐在了前排。\nWachter博士的工作，至少在一定程度上，是让系里大约3000名教职员工、实习生和工作人员了解研究、教育和临床护理方面的最新进展。但大多数日子里，他至少会留出两个小时来通知另一群人：他的推特追随者。\n..。", "note_en": "SAN FRANCISCO—Bob Wachter, the chairman of the department of medicine at the University of California, San Francisco, has had a front-row seat to the coronavirus pandemic.\n  Dr. Wachter’s job, at least in part, is to keep the department’s 3,000 or so faculty, trainees and staff current on developments in research, education and clinical care. But most days he sets aside at least two hours to keep another group informed: his Twitter followers.\n...", "posttime": "2020-05-16 03:44:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,推特,coronavirus,病毒,tweeting", "title": "医生们在推特上谈论冠状病毒，让事实像病毒一样传播", "title_en": "Doctors Are Tweeting About Coronavirus to Make Facts Go Viral", "transed": 1, "url": "https://www.wsj.com/articles/doctors-are-tweeting-about-coronavirus-to-make-facts-go-viral-11589558880", "via": "", "real_tags": ["冠状病毒", "推特", "病毒", "tweeting"]}, {"category": "", "categoryclass": "", "imagename": "342a95b3397cd1f6910fff42ab7c3fc5.png", "infoid": 1002286, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一个与世隔绝的南极基地过冬的12名男子中，有6名在完全隔离17周后依次出现了普通感冒的症状和体征。对从与疫情有关的男子身上提取的样本进行检查，没有发现病原体。\n全文可提供原始印刷版本的扫描副本。获取完整文章(1.2m)的可打印副本(PDF文件)，或单击下面的页面图像逐页浏览。指向PubMed的链接也可用于选定的参考。\n这些引用位于PubMed中。这可能不是本文参考文献的完整列表。\n布拉斯科维奇D，Jamrichováo，RathováV，Kaplan MM，KociskováD。断奶仔猪对甲型猪流感病毒的实验感染。2.受感染动物的脱毒。公牛世界卫生组织。1970；42(5)：767-770。[PMC免费文章][PubMed][谷歌学者]。\n卡梅隆·艾斯，摩尔·布希。一个与世隔绝的南极社区呼吸道感染的流行病学。周慧君(长)1968年9月；66(3)：427-437。[PMC免费文章][PubMed][谷歌学者]。\nElveback LR，Fox JP，Ketler A，Brandt CD，Wassermann FE，Hall CE。病毒观察计划：对纽约大都市家庭中的病毒感染进行持续监测。3.感染与疾病关系的初步报告。我是艾比米奥。1966年5月；83(3)：436-454。[PubMed][谷歌学者]。\n首页--期刊主要分类--期刊细介绍--期刊题录与文摘--期刊详细文摘内容。感染牛与易感牛接触传播口蹄疫中的潜伏病毒感染。J感染Dis。1971年9月；124(3)：270-276。[PubMed][谷歌学者]。\nHedblom EE.。在南极洲遇到的医疗问题。Mil Med.。1961年11月；126：818-824。[PubMed][谷歌学者]。\n福尔摩斯MJ，艾伦TR，布拉德伯恩AF，斯托特EJ。南极基地人员呼吸道病毒的研究。江惠国(长)1971年6月；69(2)：187-199。[PMC免费文章][PubMed][谷歌学者]。\n胡恩·B，泰瑞尔检察官。病毒学中的器官培养。普罗格·梅德·维罗尔。1969年；11：408-450。[PubMed][谷歌学者]。\n辛普森·雷。关于普通感冒的讨论。Proc R Soc Med.。1958年4月；51(4)：267-271。[PMC免费文章][PubMed][谷歌学者]。\n首页--期刊主要分类--期刊细介绍--期刊题录与文摘--文摘内容。普通感冒的流行病学。四、天气的影响。周慧君(长)1965年9月；63(3)：427-439。[PMC免费文章][PubMed][谷歌学者]。\n罗登在。普通感冒的临床评估。Proc R Soc Med.。1958年4月；51(4)：271-273。[PubMed][谷歌学者]。\n首页--期刊主要分类--期刊细介绍--期刊题录与文摘--期刊详细文摘内容。特里斯坦·达库尼亚的普通感冒。江惠国(长)1971年6月；69(2)：255-255。[PMC免费文章][PubMed][谷歌学者]", "note_en": "Six of 12 men wintering at an isolated Antarctic base sequentially developed symptoms and signs of a common cold after 17 weeks of complete isolation. Examination of specimens taken from the men in relation to the outbreak has not revealed a causative agent.\n  Full text is available as a scanned copy of the original print version. Get a printable copy (PDF file) of the   complete article (1.2M), or click on a page image below to browse page by page. Links to PubMed are also available for   Selected References.\n   These references are in PubMed. This may not be the complete list of references from this article.\n Blaskovic D, Jamrichová O, Rathová V, Kaplan MM, Kocisková D. Experimental infection of weanling pigs with A-swine influenza virus. 2. The shedding of virus by infected animals.   Bull World Health Organ. 1970; 42(5):767–770.  [ PMC free article] [ PubMed]  [ Google Scholar]\n Cameron AS, Moore BW. The epidemiology of respiratory infection in an isolated Antarctic community.   J Hyg (Lond) 1968 Sep; 66(3):427–437.  [ PMC free article] [ PubMed]  [ Google Scholar]\n Elveback LR, Fox JP, Ketler A, Brandt CD, Wassermann FE, Hall CE. The Virus Watch program: a continuing surveillance of viral infections in metropolitan New York families. 3. Preliminary report on association of infections with disease.   Am J Epidemiol. 1966 May; 83(3):436–454. [ PubMed]  [ Google Scholar]\n Graves JH, McVicar JW, Sutmoller P, Trautman R, Wagner GG. Latent viral infection in transmission of foot-ana-mouth disease by contact between infected and susceptible cattle.   J Infect Dis. 1971 Sep; 124(3):270–276. [ PubMed]  [ Google Scholar]\n HEDBLOM EE. The medical problems encountered in Antarctica.   Mil Med. 1961 Nov; 126:818–824. [ PubMed]  [ Google Scholar]\n Holmes MJ, Allen TR, Bradburne AF, Stott EJ. Studies of respiratory viruses in personnel at an Antarctic base.   J Hyg (Lond) 1971 Jun; 69(2):187–199.  [ PMC free article] [ PubMed]  [ Google Scholar]\n Hoorn B, Tyrrell DA. Organ cultures in virology.   Prog Med Virol. 1969; 11:408–450. [ PubMed]  [ Google Scholar]\n SIMPSON REH. Discussion on the common cold.   Proc R Soc Med. 1958 Apr; 51(4):267–271.  [ PMC free article] [ PubMed]  [ Google Scholar]\n Lidwell OM, Morgan RW, Williams RE. The epidemiology of the common cold. IV. The effect of weather.   J Hyg (Lond) 1965 Sep; 63(3):427–439.  [ PMC free article] [ PubMed]  [ Google Scholar]\n RODEN AT. Clinical assessment of the common cold.   Proc R Soc Med. 1958 Apr; 51(4):271–273. [ PubMed]  [ Google Scholar]\n Shibli M, Gooch S, Lewis HE, Tyrrell DA. Common colds on Tristan da Cunha.   J Hyg (Lond) 1971 Jun; 69(2):255–255.  [ PMC free article] [ PubMed]  [ Google Scholar]", "posttime": "2020-05-16 03:44:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "基地,common,感染", "title": "南极基地隔离17周后普通感冒暴发(1973年)", "title_en": "Outbreak of common colds at Antarctic base after 17 weeks of isolation (1973)", "transed": 1, "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2130424/", "via": "", "real_tags": ["基地", "common", "感染"]}, {"category": "", "categoryclass": "", "imagename": "35dffc8a22bc5036929ffb68b1aba2c1.png", "infoid": 1002285, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这篇文章中，我将解释为什么播客取代了我在非正式学习中对维基百科的大量使用。我还会谈谈我是如何每天收听五个多小时的播客的！\n三种简单但极其强烈的激情主宰了我的生活：对爱的渴望，对知识的追求，以及对人类苦难的难以忍受的怜悯。--伯特兰·罗素自传的开场白(全文)。\n在Web2.0时代(2000年代中期到2010年代初)，维基百科对我来说是一个很好的非正式学习资源。每当我想了解新话题、历史事件或名人时，我都会在谷歌上搜索。维基百科页面通常位于前几个搜索结果之列。\n我会阅读维基百科的页面，并决定是否想要更深入地挖掘(例如，找到关于这个主题的书来阅读)。大多数情况下，我仅仅通过阅读维基百科页面就学到了足够的东西，然后继续前进。\n例如，当我想学习Django(一种Python编程框架)时，我从维基百科词条Django(Web框架)开始。就像了解京都市长唐·瓦伦丁的生活一样，昆阳战役的历史性事件，权力的游戏概述，等等。\n注意：阅读维基百科页面只是学习的开始，这就是我所说的非正式学习的意思。如果我获得了足够的兴趣，我会找到其他更严肃的材料(例如，书籍、编程文档……)。用于正规学习。\n到了2013年左右，我开始全职做软件工程师。在开放式办公场所，许多知识型员工一边在电脑上工作，一边通过Spotify、Pandora等收听音乐。\n但是我为整天不学习新东西而只是听音乐而感到内疚。相反，我开始一边工作一边收听播客(主要是编写代码)，从这些播客中吸收了大量信息，例如真实的犯罪案件、新闻、工程师、风险资本家和企业家的职业道路，以及了解历史事件。\n但是怎么可能在编程工作中收听播客呢？嗯，除了写作，如果……。否则……逻辑，在现代软件工程中，实际上有很多低级思考的任务，例如，编写单元测试、重构代码、从堆栈溢出复制和粘贴代码、调整CSS样式、调整某些服务器软件的配置文件、使用第三方API、处理HTML、配置IDE、设置开发环境、等待CI完成、编写一次性代码来测试新技术、试验一些低风险的DevOps。的代码进行本地代码审查，手动执行某些产品功能的QA.。\n事实证明，我并不是唯一一个一边听播客一边写代码的人。\n为什么我花了10年时间才意识到，我可以同时收听播客或有声读物和代码，而不会损失太多生产力或理解力？\n-考特兰·艾伦(@csallen)2018年5月17日。\n快进到2016年，我发现我从播客中消费的信息比从电视、YouTube视频或新闻网站等其他媒体形式中消费的信息更多。准确地说，当我写代码、通勤上班、在健身房锻炼、去杂货店购物等等时，我每天花5个多小时听播客。\n基本上，每当我手忙脚乱，头脑空闲的时候，我就会听播客。\n播客只是让知识变得容易获取，就像维基百科一样。互联网上有大量的播客，基本上涵盖了所有的话题！\n制作播客要比写一本书、一篇博客文章或制作一段视频容易得多。它降低了主题专家制作内容 - 的门槛，他们只是在麦克风前聊天！\n作为一名听众，听一位专家通过我的耳朵倾诉知识有多酷？\n最棒的是播客是免费的！是的，在有围墙的花园平台上有一些独家播客，但大多数优秀的播客都是免费收听的。\n当然，它们中的许多都是由广告支持的，所以如果你认为花在听广告上的时间是浪费的钱，那就不是完全免费的。我可能有偏见，但我认为播客广告没有YouTube广告那么烦人：)。\n2017年初，我建立了一个播客搜索引擎，名为Listen Notes，帮助自己发现有趣的播客剧集。播客太多了，我无法全部订阅。\n旧的播客收听模式是订阅几个节目，只听这些节目的新剧集。这可能在2013年奏效，当时播客还不多。\n这就像我们在20世纪90年代中期给几个网站加了书签，一遍又一遍地访问那几个网站，因为互联网上没有太多的网站。\n随着播客数量的增长越来越快，订阅然后只听几个节目的模式将不再有效。\n渐渐地，我在Listen Notes上添加了新的功能，并在2017年底将其变成了我的全职工作。到目前为止，我已经做了两年多的“听笔记”了。顺便说一句，你可能会对Listen Notes的技术栈感兴趣。\n截至撰写这篇文章(2020年2月)，自2017年末以来，我已经收听了3100多集播客。\n我在阴天订阅了这个主歌单。除此之外，我不订阅个人播客 - ，这与大多数播客听众有很大的不同。\n我还有一个私人播放列表，里面只有我和我妻子分享的中文播客：)。我们都会定期将剧集添加到播放列表中。当我们在公路旅行时，一起在车里听播客是很有趣的。\n如果你是Instapaper或Pocket的用户，你可能对你在网上看到的一篇文章的“稍后阅读”的概念 - 很熟悉，但你没有时间马上阅读，所以你把文章添加到Instapaper或Pocket中稍后阅读。\n在Listen Notes上，我将播放列表功能命名为“稍后收听”。你明白我的意思。\n首先，当我遇到我感兴趣的话题或人时，我只需搜索“听笔记”，然后在我的主播放列表中添加几集。这类似于我如何使用维基百科的关键字搜索！\n想要学习新编程框架的基本概念吗？搜索那个编程框架的创建者的名字，狂欢地收听他们的播客采访！示例：Vue的Evan You和Rails的DHH。\n你在硅谷会见一位投资者吗？搜索一下那个投资者的名字，就可以对他们有所了解了！例如：迈克·梅普尔斯(Mike Maples)和亚当·德雷珀(Adam Draper\n一家公司刚刚被收购？搜索其创始人的名字，了解这家公司的历程！例如：GitHub的克里斯·万斯特拉斯(Chris Wanstrath)，格子的扎克·佩雷特(Zach Perret)。\n看到推特上讨论的历史性事件了吗？搜索涉案人员的名字！例子：查尔斯·曼森(Charles Manson)。\n决定要不要买书？搜索作者的名字！例如：尼尔·埃亚尔(Nir EYal)，伊莲·波菲尔特(Elaine Pofeldt)。\n其次，我看了一下Listen-Real-Time页面，在那里它显示了人们在Listen Notes平台上正在收听的内容。每次我盯着Listen Real-Time页面，我都会惊讶于播客内容的多样性。我经常从未知的播客中发现有趣的情节，而苹果播客的评论为零。\n第三，我看了一眼我的书签播客的最新一集。稍后收听的播放列表可以同时包含剧集和播客。我通常会根据最近的发布日期对那些有书签的播客进行排序。这些是我喜欢的播客，但我不太可能有时间(和兴趣)去听它们的每一集。\n到目前为止，我已经为70多个播客 添加了书签。注：我不能订阅70个播客；否则，太多未播放的新节目会让我应接不暇：)。\n此外，在每个播客页面(示例)或剧集页面(示例)的侧边栏上，最多有8个推荐。\n第四，Listen Note Chrome Extension推荐与我访问的网站相关的播客。我之所以构建这个Chrome扩展，是因为我总是想知道某个网站(或公司)是否有官方播客：)原来越来越多的公司开始了自己的播客！\n最后但并非最不重要的一点是，我也会从口口相传中获得播客推荐，例如Twitter、电子邮件时事通讯，或者通过短信或电子邮件从我的朋友那里获得推荐。这是非常老式的做法，但它适用于所有媒体类型(例如，YouTube视频、书籍、新闻文章)。\n我从不会用完我主播放列表中可听的播客内容。而且我从来不会觉得自己被内容压得喘不过气来。\n几年前，当我订阅了大约10个播客时，当这些播客的新集开始在 - 上出现时，我感到不知所措，并不是每一集都值得一听。所以我很快就把未播放的剧集堆了起来。\n现在，我要注意的是只挑选我真正想听的剧集。我可以浏览数百个(很快就是数千个)不同的播客。\n当然，我用AirPods收听播客！较早前，我提到我通常与妻子一起在公路旅行时收听播客。事实上，当我们在杂货店购物时，我们甚至一起听同样的播客！\n我的播客收听程序听起来复杂吗？嗯，算是吧。但这实际上可以归结为一个主播放列表 - ，这是我的音频版本的维基百科，用于非正式学习。\n如果你想听我听的任何东西，你可以订阅我的主播放列表。或者你也可以开始你自己的主播放列表：https://www.listennotes.com/listen/", "note_en": "In this article, I’ll explain why podcasts replaced a lot of my Wikipedia usage for informal learning. I’ll also talk about how I listen to five-plus hours of podcasts every day!\n Three passions, simple but overwhelmingly strong, have governed my life: the longing for love,  the search for knowledge, and unbearable pity for the suffering of mankind. — The Prologue to  Bertrand Russell’s autobiography ( full text)\n   In the Web 2.0 era (mid 2000s - early 2010s), Wikipedia was a great informal learning resource for me. Whenever I wanted to learn about a new topic, a historic event, or a famous person, I searched on Google. Wikipedia pages were usually among the first few search results.\n I would read the Wikipedia page and decide if I wanted to dig deeper (e.g., find books to read on the subject). Most often, I learned enough from just reading a Wikipedia page and moved on.\n For example, when I wanted to learn Django (a Python programming framework), I started with the Wikipedia entry  Django (web framework). Same as learning about the life of  Don Valentine, the city of  Kyoto, the historic event  Battle of Kunyang, an overview of  Game of Thrones, and more.\n Note: Reading Wikipedia pages is just the beginning of learning something, which is what I mean by &#34;informal learning&#34;. If I gain enough interest, I&#39;ll find other more serious materials (e.g., books, programming docs...) for &#34;formal learning&#34;.\n   Then around 2013, I started to work as a software engineer full-time. In open office workplaces, many knowledge workers listened to music via Spotify, Pandora, or the like, while working on a computer.\n But I felt guilty for not learning new things and just listening to music all day long. Instead, I started to listen to podcasts while I worked (mostly writing code), consuming tons of information from these podcasts, e.g., true crime cases, news, career paths for engineers, venture capitalists, and entrepreneurs, and learning about historic events.\n But how is it possible to listen to podcasts at a programming job? Well, other than writing &#34;if... else...&#34; logics, there are actually a lot of &#34;low thinking&#34; tasks in modern software engineering, e.g., writing unit tests, refactoring code, copying &amp; pasting code from Stack Overflow, tweaking CSS styling, tweaking config files for some server software, playing with 3rd party APIs, messing with HTML, configuring IDE, setting up dev environment, waiting for CI to finish, writing throwaway code to test out new technology, experimenting some low risk DevOps tasks on local dev or staging, testing coworker&#39;s code locally for code review, manually doing QA for certain product features...\n Turns out I&#39;m not the only one who listen to podcasts while writing code –\n Why&#39;d it take me 10 years to realize I could listen to a podcast or audio book and code at the same time without losing much productivity or comprehension?\n— Courtland Allen (@csallen)  May 17, 2018\n  Fast forward to 2016 and I found that I was consuming more information from podcasts than from other media formats like TV, YouTube videos, or news websites. To be precise, I spent five-plus hours per day listening to podcasts when I was writing code, commuting to work, working out in the gym, grocery shopping, and so on.\n Basically, whenever my hands and eyes were busy but my mind was free, I would listen to podcasts.\n Podcasts just make knowledge accessible, like Wikipedia. There are tons of podcasts on the Internet that cover basically every topic!\n    It’s easier to produce a podcast than write a book, a blog post, or produce a video. It lowers the bar for subject experts who produce content — they just chat in front of a microphone!\n As a listener, how cool is it to listen to an expert on a subject dumping knowledge through my ears?\n The best part is that podcasts are free! Yes, there are a few exclusive podcasts available on walled garden platforms, but most great podcasts are free to listen to.\n Of course, many of them are ad-supported, so it’s not completely free if you consider that the time spent listening to ads is money wasted. I might be biased, but I think podcast ads are less annoying than YouTube ads :).\n   In early 2017, I built a podcast search engine,  Listen Notes, to help myself discover interesting podcast episodes. There were so many podcasts, and I couldn’t subscribe to them all.\n The old podcast listening model was to subscribe to a few shows and only listen to new episodes from those shows. This may have worked in 2013 when there were not many podcasts.\n It’s like when we bookmarked a few websites in the mid 1990s and visited those few websites again and again because there were not a lot of websites on the Internet.\n As the volume of podcasts grows faster and faster, the subscribe-then-listen-to-only-a-few-shows model won’t work any more.\n Gradually, I added new features to Listen Notes and turned it into my full-time job in late 2017. I’ve been working on Listen Notes for over two years so far. Btw, you may be interested in  the tech stack of Listen Notes.\n       As of writing this article (February 2020), I’ve listened to more than 3,100 podcast episodes since late 2017.\n   I subscribe to this master playlist on  Overcast. Other than that, I don’t subscribe to individual podcasts — which is very different than most podcast listeners out there.\n I also have a private playlist with only Chinese podcasts that I share with my wife :). We both add episodes to that playlist periodically. It’s fun to listen to podcasts together in the car when we are on a road trip.\n     If you are an  Instapaper or  Pocket user, you may be familiar with the “read it later” concept — you come across an online article, but you don’t have time to read it right away, so you add the article to Instapaper or Pocket to read later.\n On Listen Notes, I named the playlist feature as “ Listen Later.” You get the idea.\n  First, when I encounter topics or people that I’m interested in, I just search on Listen Notes and add a few episodes to my master playlist. This is similar to how I used Wikipedia’s keyword search!\n  Want to learn basic concepts of a new programming framework? Search for the name of the creator of that programming framework and binge listen to their podcast interviews! Examples:  Evan You of Vue,  DHH of Rails\n Are you meeting an investor in Silicon Valley? Search the name of that investor to know a bit about them! Examples:  Mike Maples,  Adam Draper\n A company just got acquired? Search the name of its founder to learn the journey of this company! Examples:  Chris Wanstrath of GitHub,  Zach Perret of Plaid\n See a historic event discussed on Twitter? Search the names of the people involved! Example:  Charles Manson\n Deciding whether to buy a book or not? Search the author’s name! Examples:  Nir Eyal,  Elaine Pofeldt\n Second, I look at the  Listen Real-Time page, where it displays what people are listening to on the Listen Notes platform. Every time I stare at the Listen Real-Time page, I’m amazed at how versatile podcast contents are. I often find interesting episodes from unknown podcasts that have zero reviews on Apple Podcasts.\n    Third, I take a glance at the latest episodes of my bookmarked podcasts. A  Listen Later playlist can have both episodes and podcasts. I typically sort those bookmarked podcasts by the latest published date. These are the podcasts I like, but it’s unlikely that I’ll have time (and interest) to listen to every new episode of them.\n So far, I’ve bookmarked over 70 podcasts . Note: I can’t subscribe to 70 podcasts; otherwise, it would be too overwhelming with tons of unplayed new episodes :)\n    Also, on the sidebar of each podcast page ( Example) or episode page ( Example), there are up to eight recommendations.\n    Fourth,  Listen Note Chrome Extension suggests podcasts associated with the websites I visit. I built this Chrome Extension because I always wonder if a particular website (or a company) has official podcasts or not :) Turns out more and more companies are starting their own podcasts!\n    Last but not least, I also get podcast recommendations from word of mouth, e.g., Twitter,  email newsletters, or recommendations from my friends via texts or email. This is very old school, but it works well for all media types (e.g., YouTube videos, books, news articles).\n I never run out of podcast content to listen to from  my master playlist. And I never feel too overwhelmed with content.\n A few years ago, when I subscribed to around 10 podcasts, I felt overwhelmed when new episodes of those podcasts started coming in — not every episode was worth listening to. So I quickly piled up unplayed episodes.\n Now, I’m mindful to only pick episodes that I actually want to listen to. I get to explore hundreds (soon thousands) of different podcasts.\n  Of course, I use AirPods to listen to podcasts! Earlier on, I mentioned that I usually listen to podcasts together with my wife on road trips. Actually, we even listen to the same podcasts together when grocery shopping!\n     Does my podcast listening routine sound complex? Well, kind of. But it really boils down to just a master playlist — my audio version of Wikipedia for informal learning.\n  You can  subscribe to my master playlist if you want to listen to whatever I listen to. Or you can start your own master playlist:  https://www.listennotes.com/listen/", "posttime": "2020-05-16 03:43:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "播客,学习,wikipedia", "title": "为什么播客是我的新维基百科-完美的非正式学习资源", "title_en": "Why Podcasts Are My New Wikipedia – The Perfect Informal Learning Resource", "transed": 1, "url": "https://lnns.co/6ArPszTwvDE", "via": "", "real_tags": ["播客", "学习", "wikipedia"]}, {"category": "", "categoryclass": "", "imagename": "1c1f5e7dbafe061871ecea0c8e7606b5.jpeg", "infoid": 1002284, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": ".bigTop__review{不透明度：0；}.bigTop__VideoPlayerBox{位置：绝对；}.bigTop__VideoPlayerBox--被动{宽度：100%；高度：100%；顶部：0；左侧：0；不透明度：0；/*z索引：-1；*/}.bigTop__VideoPlayerBox--回退{位置：相对；z索引：0；}.bigTop__VideoPlayerBox--。不透明度：1；z-index：1；}.bigTop__VideoPlayer{位置：相对；填充-底部：56.25%；}.bigTop__codeholder{显示：无；}.bigTop__幻灯片显示{光标：指针；位置：绝对；底部：0；右侧：0；背景色：#FFF；填充：10px；宽度：300px；}.bigTop__button{边框宽度：2px；边框样式：实心；font。文本转换：大写；字体大小：12px；字母间距：1px；光标：指针；页边距：0；填充：6px 15px；框大小：边框；过渡：颜色300ms，背景颜色300ms；}.bigTop_button--嵌入{背景：透明；颜色：#FFF；边距：30px自动20px；最小宽度：175px；边框颜色：#FFF；}.bigTop_button--嵌入：ho.。边框颜色：#333；背景颜色：#fff；}.bigTop__button--黑色：悬停{color：#fff；back-color：#333；}.bigTop__Button--内联{空边距：15px 0；}.bigTop__Atmotional{填充：0；边距：0；背景大小：1px 1px；背景位置：-1px-1px；}.bigTop__atomalic：空{paddingBottom：0；背景大小：1px 1px；背景位置：-1px-1px；}.bigTop__atumular：空{paddingBottom：}.bigTop__大气视频，.bigTop__大气img{宽度：100%；显示：块；填充：0；页边距：0；}/*终端媒体css*//*caption/credit*/.bigTop__captioncredit{显示：块；字体系列：&#34；视网膜&#34；，Helvetica，宋体，无衬线；颜色：#666；边距：5px auto 0；填充：0 10px；框大小：边框；}.bigTop__Caption{font-size：14px；line-high：20px；font-weight：300；display：inline；}.bigTop_Credit{font-size：14px；line-high：20px；font-weight：300；text-change：uppercase；display：inline；}/*结束字幕/信用*//*视频播放按钮*/.bigTop__play{宽度：50px；高度：50px；光标：指针；边框：1px#999实心；背景颜色：RGBA(0，0，0，0.7)；边框半径：50%；文本缩进：-9999px；显示：块；框大小调整。.bigTop__play，.bigTop__VideoPlayerBox：HOVER+.bigTop__PLAY--独立，.bigTop__PLAY--HOVER{背景颜色：#0080c3；边框颜色：#0080c3；}.bigTop__PLAY：之前{宽度：0；高度：0；边框-顶部：11px纯色透明；边框-底部：12px纯色透明；边框-左边：18px实体#fff；内容：&#34；}.bigTop__VideoTrigger{光标：指针；宽度：100%；高度：100%；位置：绝对；顶部：0；左侧：0；}.bigTop__play--独立{位置：绝对；顶部：50%；左侧：50%；Transform：TranslateY(-50%)TranslateX(-50%)；-webkit-Transform：TranslateY(-50%)TranslateX(-50%)；Pointer-Events：None；}/*视频按钮*//*/.bigTopPage_Grid{padding：0 10px；框大小：边框大小：边框；左页边距：自动；右页边距：自动；}/*结束页面网格**/*/.plitTop.bigTop__rel{背景颜色：#222；}.plitTop.bigTop__text，.plitTop.bigTop__flash，.plitTop.bigTop__flash：link，.plitTop.。}.plitTop.bigTop--lightTheme.bigTop__rel{Background-color：#fff；}.plitTop.bigTop--lightTheme.bigTop__text，.plitTop.bigTop--lightTheme.bigTop_flash，.plitTop.bigTop--lightTheme.bigTop__flash：link，.plitTop.bigTop--lightTheme.bigTop_hed，.plitTop.bigTop。}.拆分顶部.bigTop__overlay--Bottom，.plitTop.bigTop__overlay--顶部{背景：初始；}.拆分顶部.bigTop__media{浮动：右；宽度：50%；}.拆分顶部.bigTop__captionCredit{文本对齐：右；颜色：#666；}.拆分顶部.bigTop__text.bigTop__text--底部，.plitTop.bigTop__text.bigTop_text--变换：平移(-50%，-50%)；-webkit-Transform：翻译(-50%，-50%)；宽度：50%；最小高度：初始；填充：0 30px；}.edit-Japan.plitTop.bigTop__hed，.edit-Japan.plitTop.bigTop__dek{text-align：Left；}/*仅限4个单元*/@媒体(最大宽度：639px){.plitTop.bigTop__rel{paddingTop：15px；}.plititOnly(最大宽度：639px){.plitTop.bigTop__rel{padd-Bottom：15px；}.plititOnly。}.plitTop.bigTop__captionCredit{text-align：Left；color：#f4f4f4；}.plitTop.bigTop--lightTheme.bigTop__captionCredit{color：#666；}.plitTop.bigTop__text.bigTop__text--Bottom，.plitTop.bigTop__text.bigTop__text--Bottom{positi", "note_en": ".bigTop__preview { opacity: 0;}.bigTop__videoPlayerBox { position: absolute;}.bigTop__videoPlayerBox--passive { width: 100%; height: 100%; top: 0; left: 0; opacity: 0; /*z-index: -1;*/}.bigTop__videoPlayerBox--fallback { position: relative; z-index: 0;}.bigTop__videoPlayerBox--fallback .videoHint { display: none !important;}.bigTop__videoPlayerBox--active { width: 100%; height: 100%; top: 0; left: 0; opacity: 1; z-index: 1;}.bigTop__videoPlayer { position: relative; padding-bottom: 56.25%;}.bigTop__codeholder { display: none;}.bigTop__slideshow { cursor: pointer; position: absolute; bottom: 0; right: 0; background-color: #fff; padding: 10px; width: 300px;}.bigTop__button { border-width: 2px; border-style: solid; font-family: &#39;Retina&#39;, Helvetica, Arial, sans-serif; font-weight: 600; text-transform: uppercase; font-size: 12px; letter-spacing: 1px; cursor: pointer; margin: 0; padding: 6px 15px; box-sizing: border-box; transition: color 300ms, background-color 300ms;}.bigTop_button--embedded { background: transparent; color: #fff; margin: 30px auto 20px; min-width: 175px; border-color: #fff;}.bigTop_button--embedded:hover { color: #333; background-color: #fff;}.bigTop__button--black { color: #333; border-color: #333; background-color: #fff;}.bigTop__button--black:hover { color: #fff; background-color: #333;}.bigTop__button--inline { margin: 15px 0 0;}.bigTop__atmospheric { padding: 0; margin: 0; background-size: 1px 1px; background-position: -1px -1px;}.bigTop__atmospheric:empty { padding-bottom: 56.25%; background-color: #000; background-size: cover; background-repeat: no-repeat;}.bigTop__atmospheric video,.bigTop__atmospheric img { width: 100%; display: block; padding: 0; margin: 0;}/******** end media CSS *******//******************caption/credit********************/.bigTop__captioncredit { display: block; font-family: &#34;Retina&#34;, Helvetica, Arial, sans-serif; color: #666; margin: 5px auto 0; padding: 0 10px; box-sizing: border-box;}.bigTop__caption { font-size: 14px; line-height: 20px; font-weight: 300; display: inline;}.bigTop__credit { font-size: 14px; line-height: 20px; font-weight: 300; text-transform: uppercase; display: inline;}/******** end caption/credit ******//******** Video Play Button *********/.bigTop__play { width: 50px; height: 50px; cursor: pointer; border: 1px #999 solid; background-color: rgba(0, 0, 0, 0.7); border-radius: 50%; text-indent: -9999px; display: block; box-sizing: border-box;}.bigTop__videoPlayerBox:hover + .bigTop__text &gt; .bigTop__play,.bigTop__videoPlayerBox:hover + .bigTop__play--standalone,.bigTop__play--hover { background-color: #0080c3; border-color: #0080c3;}.bigTop__play:before { width: 0; height: 0; border-top: 11px solid transparent; border-bottom: 12px solid transparent; border-left: 18px solid #fff; content: &#34; &#34;; position: absolute; display: block; margin-top: 13px; margin-left: 18px;}.bigTop__videoTrigger { cursor: pointer; width: 100%; height: 100%; position: absolute; top: 0; left: 0;}.bigTop__play--standalone { position: absolute; top: 50%; left: 50%; transform: translateY(-50%) translateX(-50%); -webkit-transform: translateY(-50%) translateX(-50%); pointer-events: none;}/***** Video Button *****//********************Make bigTop align to page grid***********************/.bigTopPage__grid { padding: 0 10px; box-sizing: border-box; margin-left: auto; margin-right: auto;}/*** end page grid **//********************splitTop styling***********************/.splitTop .bigTop__rel { background-color: #222;}.splitTop .bigTop__text,.splitTop .bigTop__flash,.splitTop .bigTop__flash:link,.splitTop .bigTop__hed,.splitTop .bigTop__dek { color: #fff;}.splitTop.bigTop--lightTheme .bigTop__rel { background-color: #fff;}.splitTop.bigTop--lightTheme .bigTop__text,.splitTop.bigTop--lightTheme .bigTop__flash,.splitTop.bigTop--lightTheme .bigTop__flash:link,.splitTop.bigTop--lightTheme .bigTop__hed,.splitTop.bigTop--lightTheme .bigTop__dek { color: #000;}.splitTop .bigTop__overlay { background-color: transparent;}.splitTop .bigTop__overlay--bottom,.splitTop .bigTop__overlay--top { background: initial;}.splitTop .bigTop__media { float: right; width: 50%;}.splitTop .bigTop__captioncredit { text-align: right; color: #666;}.splitTop .bigTop__text.bigTop__text--bottom,.splitTop .bigTop__text.bigTop__text--top { position: absolute; top: 50%; bottom: auto; left: 25%; transform: translate(-50%, -50%); -webkit-transform: translate(-50%, -50%); width: 50%; min-height: initial; padding: 0 30px;}.edition-japan .splitTop .bigTop__hed,.edition-japan .splitTop .bigTop__dek { text-align: left;}/* 4 unit only */@media (max-width: 639px) { .splitTop .bigTop__rel { padding-bottom: 15px; } .splitTop .bigTop__media { float: none; width: 100%; } .splitTop .bigTop__captioncredit { text-align: left; color: #f4f4f4; } .splitTop.bigTop--lightTheme .bigTop__captioncredit { color: #666; } .splitTop .bigTop__text.bigTop__text--bottom, .splitTop .bigTop__text.bigTop__text--bottom { position: relative; width: auto; top: auto; left: auto; margin: 40px 20px; padding: 0; transform: none; -webkit-transform: none; } .bigTop__flash.flashlineSVG { margin-left: 0; }}/* 4, 8 unit splitTop font styling */@media (max-width: 979px) { .splitTop .bigTop__text .bigTop__hed { font-size: 32px; line-height: 1.12; } .wsj-modern span.bigTop__flash.flashlineSVG { text-indent: 215px; } .splitTop .bigTop__text .bigTop__dek { font-size: 16px; line-height: 1.38; }}/* 12, 16 unit splitTop font styling */@media (min-width: 980px) { .splitTop .bigTop__text .bigTop__hed { font-size: 52px; line-height: 1; } .splitTop .bigTop__text .bigTop__dek { font-size: 20px; line-height: 1.3; }}/*** end splitTop styling **//*****SECTION SPECIFIC STYLING***/.magazine .bigTop__flash,.magazine .bigTop__flash:link,.magazine .bigTop__flash:visited,.magazine .bigTop__flash:active { font-family: &#39;Retina Wide&#39;, &#39;Retina Narrow&#39;, &#39;Retina&#39;, &#39;Arial&#39;, sans-serif;}.magazine .bigTop__hed { font-weight: 400;}.magazine .bigTop__dek { font-family: &#39;Exchange&#39;, &#39;Chronicle SSm&#39;, Georgia, serif;}/***************Set via media query and not via classesto prevent page jump/rerenderPreviously set via CSS classes, e.g. bigTop__text--static, bigTop__hed-s,but it took too long for the page to &#34;settle&#34;**//* 4 unit only */@media (max-width: 639px) { .bigTopHide--4, .bigTop__flash.bigTopHide--4 { display: none; } .bigTop { margin: 0 0 20px; } .bigTop__overlay { display: none; } .bigTop__media--image { padding-bottom: 66.77%; } .bigTop__text { position: static; margin-top: 15px; text-align: left; margin-left: 10px; margin-right: 10px; width: auto; } .bigTop__overlay { display: none; } .bigTop__flash, .bigTop__flash:link, .bigTop__flash:active, .bigTop__flash:visited { color: #0080c3; text-align: left; } .bigTop__hed { font-size: 32px; line-height: 1.125; color: #000; text-align: left; } .bigTop__dek { font-size: 17px; line-height: 24px; color: #666; text-align: left; } .bigTop__flash + .bigTop__hed { margin-top: 4px; } .bigTop__hed + .bigTop__dek { margin-top: 1px; } .bigTop__dek:last-child { margin-bottom: 15px; } .bigTop__hed:last-child { margin-bottom: 14px; } .bigTop_button--embedded { margin: 15px 0 10px; color: #000; border-color: #000; min-width: 150px; } .bigTop_button--embedded:hover { background-color: #000; color: #fff; } .bigTop__text--flex &gt; .bigTop__play, .bigTop__play--standalone { position: absolute; top: 28vw; /* half of bottom padding of video elem */ left: 50%; transform: translateY(-50%) translateX(-50%); -webkit-transform: translateY(-50%) translateX(-50%); pointer-events: none; } .bigTop__videoTrigger { height: 0; padding-bottom: 56.25%; } .bigTop__flash.flashlineSVG { background-size: contain; } .wsj-modern .bigTop__text span:before { margin-left: 10px; }}/* 8 unit */@media (min-width: 640px) and (max-width: 979px) { .bigTop__captioncredit, .bigTop__text { max-width: 640px; } .wsj-modern .splitTop span.bigTop .bigTop__flash.flashlineSVG { min-width: 282px; } .bigTop__text.bigTop__text--bottom { box-sizing: border-box; min-height: 40%; top: auto; bottom: 0; padding-bottom: 10px; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); box-sizing: border-box; } .wsj-modern .bigTop span.bigTop__flash.flashlineSVG { max-width: 239px; min-height: 15px; max-height: 15px; min-width: 350px; } .wsj-modern .splitTop.bigTop span.bigTop__flash.flashlineSVG { min-width: 279px; } .bigTop__text.bigTop__text--top { top: auto; bottom:60%; max-height: 40%; padding-top: 10px; box-sizing: border-box; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); } .bigTop__hed { font-size: 42px; line-height: 1.095; } .bigTop__hed + .bigTop__dek { margin-top: 9px; } .bigTop__flash + .bigTop__hed { margin-top: 5px; } .bigTop_button--embedded { margin: 20px auto; } .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play { position: static; } .bigTop__text--center.bigTop__text--flex &gt; .bigTop__play { margin-top: 15px; } .bigTop__text--flex &gt; .bigTop__play + .bigTop__flash { margin-top: 15px; } .wsj-modern .splitTop .bigTop__text span:before { margin-left: 10px; }}/* 8, 12, 16 unit */@media (min-width: 640px) { .bigTopHide--8, .bigTopHide--12, .bigTopHide--16, .bigTop__flash.bigTopHide--8, .bigTop__flash.bigTopHide--12, .bigTop__flash.bigTopHide--16 { display: none; } .bigTop__rel { overflow: hidden; /* fix horizontal scroll in IE11 */ } .bigTop__media--image { padding-bottom: 51.3%; } .bigTop__media--image &gt; .bigTop__preview--forceblur { --webkit-filter: blur(20px); filter: blur(20px); } .bigTop__text { position: absolute; top: 50%; left: 50%; transform: translateY(-50%) translateX(-50%); -webkit-transform: translateY(-50%) translateX(-50%); } .bigTop__dek { font-size: 20px; line-height: 28px; } .bigTop__text--static.bigTop__text { color: #000; position: static; transform: none; margin-left: auto; margin-right: auto; } .bigTop__text--inactive.bigTop__text--bottom, .bigTop__text--inactive.bigTop__text--center { opacity: 0; } .bigTop__text.bigTop__text--flex { flex-direction: column; display: flex; justify-content: flex-end; align-items: center; height: 100%; } .bigTop__text--clickthrough { pointer-events: none; } .bigTop__text--clickthrough &gt; .bigTop__flash, .bigTop__text--clickthrough &gt; .bigTop__hed, .bigTop__text--clickthrough &gt; .bigTop__dek { pointer-events: auto; } .bigTop__text.bigTop__text--flex.bigTop__text--center { justify-content: center; } .bigTop__text--center.bigTop__text--flex &gt; .bigTop__play { order: 2; }}/* 12 unit */@media (min-width: 980px) and (max-width: 1299px) { .bigTop__captioncredit { max-width: 960px; } .splitTop .bigTop__captioncredit { max-width: none; } .bigTop__play { width: 70px; height: 70px; } .bigTop__play:before { border-top-width: 16px; border-bottom-width: 17px; border-left-width: 26px; margin-top: 18px; margin-left: 25px; }}/* 12, 16 unit */@media (min-width: 980px) { .splitTop .bigTop__captioncredit { margin: 0; padding: 5px 5px 0 0; width: 50%; float: right; } .bigTop__hed { font-size: 52px; line-height: 1.077; } .edition-japan .bigTop__hed { font-size: 45px; } .bigTop__text { max-width: 960px; } .bigTop__text.bigTop__text--bottom { box-sizing: border-box; min-height: 30%; top: auto; bottom: 0; box-sizing: border-box; padding-bottom: 30px; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); } .bigTop__text.bigTop__text--top { top: auto; bottom: 70%; max-height: 30%; padding-top: 10px; box-sizing: border-box; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); } .bigTop__hed + .bigTop__dek { margin-top: 8px; } .bigTop__flash + .bigTop__hed { margin-top: 5px; } .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play { /* need to do this because of IE11 */ position: absolute; top: 50%; left: 50%; transform: translateY(0) translateX(-50%); -webkit-transform: translateY(0) translateX(-50%); } .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play + .bigTop__flash, .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play + .bigTop__hed { margin-top: 50px; } .bigTop__text--bottom.bigTop__text--flex &gt; .bigTop__play { margin-top: -45px; } .bigTop__text--center.bigTop__text--flex &gt; .bigTop__play { margin-top: 20px; } .bigTop__text--flex &gt; .bigTop__play + .bigTop__flash { margin-top: 15px; }}/* 16 unit */@media (min-width: 1300px) { .bigTop__captioncredit { max-width: 1280px; } .splitTop .bigTop__captioncredit { max-width: none; } .bigTop__play { width: 90px; height: 90px; } .bigTop__play:before { border-top-width: 20px; border-bottom-width: 22px; border-left-width: 33px; margin-top: 24px; margin-left: 33px; }}", "posttime": "2020-05-16 03:42:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,erases,bigtop", "title": "谷歌删除数千个链接，被虚假投诉欺骗", "title_en": "Google Erases Thousands of Links, Tricked by Phony Complaints", "transed": 1, "url": "https://www.wsj.com/articles/google-dmca-copyright-claims-takedown-online-reputation-11589557001", "via": "", "real_tags": ["谷歌", "google", "erases", "bigtop"]}, {"category": "", "categoryclass": "", "imagename": "7245042964f260fe836d3ec31d4336d9.png", "infoid": 1002283, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它目前实现了各种刚体动力学算法，包括正动力学和逆动力学，以及基于脉冲级LCP和基于力的非线性弹簧阻尼器的接触模型。实现了电机、伺服和串联弹性执行器(SEA)动力学的执行器模型。\n整个代码库都是模板化的，因此您可以使用正向和反向模式自动区分标量类型，如CppAD、Stan Math fvar和ceres：：jet。该库还可以与常规浮点值或双精度值一起使用。另一种选择是使用包含定点整数数学，它提供跨平台确定性计算。\n文中提供了利用CERES进行系统辨识的梯度和使用控制工具箱生成轨迹的实例。\nURDF文件可以通过PyBullet接口或基于TinyXML2提供的解析器加载。因此，所有模拟功能均可用，无需PyBullet。\n建议首先设置BLASFEO和HPIPM，以获得更高效的解算器，这些解算器也可以处理优化问题中的约束：\n然后安装CppADCodeGen(我们并不真正需要它，但是CT需要CPPADCG标志才能使用线性化程序)。\nct_optcon要构建这些文件，请确保安装了Eigen和Boost(libost-dev~1.65)。接下来，发出以下命令：\nGit克隆https://github.com/ethz-adrl/control-toolbox.gitcd ct_coem kdir buildcd buildcmake..。-DCPPAD=1-DHPIPM=1makemake installcd../../ct_optconmkdir buildcd buildcmake..。-DHPIPM=1makemake安装。\n要通过基于Web的可视化工具MeshCat支持可视化，需要安装以下软件包：\n建议安装二进制软件包，如ZeroMQ自述文件所示。\n这将使用ZMQ侦听端口7000(C++MeshCat可视化客户端中的默认设置)启动MeshCat。\n要安装可视化工具服务器以使其能够在共享内存模式下运行可视化工具窗口，请执行以下命令。\n如果模拟器在共享内存模式下使用PyBullet可视化运行，请首先使用以下命令打开可视化工具服务器。\n要加载不带pybullet的URDF模型，我们的基于C++的导入器需要安装如下的TinyXML2：", "note_en": "It currently implements various rigid-body dynamics algorithms, including forward and inverse dynamics, as well as contact models based on impulse-level LCP and force-based nonlinear spring-dampers. Actuator models for motors, servos, and Series-Elastic Actuator (SEA) dynamics are implemented.\n The entire codebase is templatized so you can use forward- and reverse-mode automatic differentiationscalar types, such as CppAD, Stan Math fvar and ceres::Jet. The library can also be used withregular float or double precision values. Another option is to use the includedfix-point integer math, that provide cross-platform deterministic computation.\n Examples to exploit the gradients for system identification using Ceres andtrajectory generation using the Control Toolbox are provided.\n          URDF files can be loaded either throught the PyBullet interface or a provided parser based on TinyXML2. All simulation features are therefore available without requiring PyBullet.\n      It is recommended to first set up BLASFEO and HPIPM for more efficient solvers that can also handle constraints in the optimization problems:\n     Then install CppADCodeGen (we don&#39;t really need it but CT requires the CPPADCG flag to use the linearizers).\n   ct_optconTo build these, make sure Eigen and Boost ( libboost-dev ~1.65) are installed. Next, issue the following commands:\n git clone https://github.com/ethz-adrl/control-toolbox.gitcd ct_coremkdir buildcd buildcmake .. -DCPPAD=1 -DHPIPM=1makemake installcd ../../ct_optconmkdir buildcd buildcmake .. -DHPIPM=1makemake install\n  To support visualization through the web-based visualizer MeshCat, the following packages need to be installed:\n   It is recommended to install the binary packages, as shown on the  ZeroMQ README file.\n              This will start MeshCat with ZMQ listening on port 7000 which is the default setting in the C++ MeshCat visualization client.\n   To install the visualizer server to be able to run the visualizer window in shared-memory mode, issue\n  If the simulator is running with PyBullet visualization in shared-memory mode,first open the visualizer server using\n   To load URDF models without pybullet, our C++-based importer requires TinyXML2 which is installed as follows:", "posttime": "2020-05-16 03:35:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c++,differentiable", "title": "Tiny Differentiable Simulator是一个仅包含头文件的C++物理库", "title_en": "Tiny Differentiable Simulator is a header-only C++ physics library", "transed": 1, "url": "https://github.com/google-research/tiny-differentiable-simulator", "via": "", "real_tags": ["c++"]}]