[{"category": "", "categoryclass": "", "imagename": "62b9b382898f8483a69adae6c770edd7.jpg", "infoid": 1004640, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于这种元素的廉价和丰富的性质，使用钠离子化学而不是普通的锂离子的电池可以提供许多优势。华盛顿州立大学(Washington State University)的科学家们提出了一种被标榜为这一领域潜在游戏规则改变者的设计-一种钠离子电池，其能量容量和循环能力与市场上已有的一些锂离子电池相当。\n在某种程度上，钠离子电池的功能就像锂离子电池一样，通过在液体电解液中的一对电极之间反弹离子来发电。然而，它们目前的形式存在的一个问题是，在这种情况下，不活跃的钠晶体往往会在带负电的电极(阴极)的表面积聚，最终杀死电池。此外，钠离子电池不像锂离子电池那样能容纳那么多的能量。\n华盛顿州立大学(Washington State University)的宋俊华(音)是这篇论文的主要作者，他说，关键的挑战是电池既要有高能量密度，又要有良好的循环寿命。\n宋和他的团队相信他们可能已经想出了解决这些缺点的办法。通过对钠离子电池的设计进行实验，研究小组生产出了一种由层状金属氧化物制成的阴极和具有更高浓度钠离子的液体电解质的版本。\n在测试中，研究小组发现，这导致电解质和阴极之间的相互作用更加顺畅，使钠离子能够持续移动，并避免了在阴极表面堆积不活跃的晶体的麻烦。其结果是电池提供的容量类似于一些锂离子电池，并且不间断地发电，在1000次循环后保持80%的电量。\n林说：我们的研究揭示了阴极结构演变和表面与电解质相互作用之间的本质联系。这是有史以来报道的层状阴极钠离子电池的最好结果，表明这是一项可行的技术，可以与锂离子电池相媲美。\n对结果充满热情的团队现在正在研究电解质与阴极是如何相互作用的，以更好地理解这些相互作用，希望进一步改进设计，甚至可能避免使用其他稀有金属，如钴。\n宋说，这项工作为实现实用的钠离子电池铺平了道路，我们获得的关于阴极-电解质相互作用的基本见解，为我们未来如何在钠离子电池以及其他类型的电池化学中开发无钴或低钴正极材料提供了启示，宋健说，这项工作为实现实用的钠离子电池铺平了道路，我们获得的关于阴极-电解质相互作用的基本见解，有助于我们未来如何在钠离子电池以及其他类型的电池化学中开发无钴或低钴的阴极材料。如果我们能找到锂和钴的可行替代品，钠离子电池就能真正与锂离子电池竞争。而且，这将是游戏规则的改变者。", "note_en": "Batteries that use a sodium-ion chemistry rather than the commonplace lithium-ion could offer a number of advantages, owing to the cheap and abundant nature of the element. Scientists at Washington State University have come up with a design billed as a potential game changer in this area – a sodium-ion battery offering a comparable energy capacity and cycling ability to some lithium-ion batteries already on the market.\n In a way,  sodium-ion batteries function just like lithium-ion batteries, generating power by bouncing ions between a pair of electrodes in a liquid electrolyte. One of the problems with them in their current form, however, is that while this is going on inactive sodium crystals tend to build up on the surface of the negatively-charged electrode, the cathode, which winds up killing the battery. Additionally, sodium-ion batteries don&#39;t hold as much energy as their lithium-ion counterparts.\n &#34;The key challenge is for the battery to have both high energy density and a good cycle life,&#34; says Washington State University&#39;s Junhua Song, lead author on the paper.\n Song and his team believe they may have come up with a solution to these shortcomings. Experimenting with the design of sodium-ion batteries led the team to produce a version with a cathode made of layered metal oxide and a liquid electrolyte with a higher concentration of sodium ions.\n In testing, the team found that this led to a much smoother interaction between the electrolyte and the cathode, enabling the continuous movement of the sodium ions and avoiding the troublesome buildup of inactive crystals on the cathode surface. The upshot of that was battery offering capacity similar to some lithium-ion batteries and with an uninterrupted generation of electricity, maintaining 80 percent of its charge after 1,000 cycles.\n &#34;Our research revealed the essential correlation between cathode structure evolution and surface interaction with the electrolyte,&#34; Lin says. &#34;These are the best results ever reported for a sodium-ion battery with a layered cathode, showing that this is a viable technology that can be comparable to lithium-ion batteries.&#34;\n Enthused with the results, the team is now investigating how the electrolyte interacts with the cathode to better understand these interactions, with hopes of improving the design further, possibly even to avoid the use of other rare metals like cobalt.\n &#34;This work paves the way toward practical sodium-ion batteries, and the fundamental insights we gained about the cathode-electrolyte interaction shed light on how we might develop future cobalt-free or low cobalt cathode materials in sodium-ion batteries as well as in other types of battery chemistries,&#34; Song says. &#34;If we can find viable alternatives to both lithium and cobalt, the sodium-ion battery could truly be competitive with lithium-ion batteries. And, that would be a game changer.&#34;", "posttime": "2020-06-01 18:32:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,电池,salty", "title": "额外的盐钠电池性能与锂相当", "title_en": "Extra salty sodium battery performs on par with lithium", "transed": 1, "url": "https://newatlas.com/energy/sodium-battery-alternative-lithium/", "via": "", "real_tags": ["性能", "电池", "salty"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004638, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转在概率论和统计学中，无意识统计学家定律(LOTUS)是一个定理，用来计算随机变量X的函数g(X)的期望值，当一个人知道X的概率分布，但不知道g(X)的分布。定律的形式可以取决于陈述随机变量x的概率分布的形式。如果它是离散分布，并且知道其概率质量函数ƒX(但不知道ƒg(X))，则g(X)的期望值为。\ne⁡[g(X)]=∑x g(X)f X(X)，{\\DisplayStyle\\OperatorName{E}[g(X)]=\\∑_{x}g(X)f_{X}(X)，\\，}。\n其中总和是x的所有可能值。如果它是连续分布，并且知道其概率密度函数ƒX(但不知道ƒg(X))，则g(X)的期望值为。\ne⁡[g(X)]=∫−∞∞g(X)f X(X)d x{\\DisplayStyle\\OperatorName{E}[g(X)]=\\int_{-\\infty}^{\\infty}g(X)f_{X}(X)\\，\\mathm{d}x}。\n如果知道累积概率分布函数FX(但不知道Fg(X))，则g(X)的期望值由Riemann-Stieltjes积分给出。\nE⁡[g(X)]=∫−∞∞g(X)d F X(X){\\DisplayStyle\\OperatorName{E}[g(X)]=\\int_{-\\infty}^{\\infty}g(X)\\，\\mathm{d}F_{X}(X)}。\n这一命题被称为无意识统计学家的定律，因为学生们被指责使用了身份，而没有意识到它必须被视为严格证明的定理的结果，而不仅仅是一个定义。[4]。\n联合分布也有类似的性质。对于离散随机变量X和Y，二元函数g和联合概率质量函数f(x，y)：[5]\ne⁡[g(X，Y)]=∑y∑x g(x，y)f(x，y){\\displaystyle\\Operatorname{E}[g(X，Y)]=\\sum_{y}\\sum_{x}g(x，y)f(x，y)}。\ne⁡[g(X，Y)]=∫−∞∞∫−∞∞g(x，y)f(x，y)d x dy{\\DisplayStyle\\OperatorName{E}[g(X，Y)]=\\INT_{-\\INFTY}^{\\INFTY}\\INT_{-\\INFTY}^{\\INFTY}g(x，y)f(x，y)\\，\\mathm{d}x\\，\\mathm{d}y}。\n这条定律并不像乍看起来那样是定义的一个微不足道的结果，而是必须得到证明。[5][6][7]。\n对于连续随机变量X，设Y=g(X)，并假设g是可微的，且其逆g−1是单调的。通过反函数和微分的公式，\nd d y(g−1(Y))=1g‘(g−1(Y)){\\DisplayStyle{\\frac{d}{dy}}(g^{-1}(Y))={\\frac{1}{g^{\\Prime}(g^{-1}(Y))}}。\ndx=1g‘(g−1(Y))dy{\\displaystyle dx={\\frac{1}{g^{\\Prime}(g^{-1}(Y))}}dy}。\n∫−∞∞g(X)f X(X)dx=∫−∞∞y f X(g−1(Y))1g‘(g−1(Y))dy{\\DisplayStyle\\INT_{-。\\infty}^{\\infty}g(X)f_{x}(X)\\，dx=\\int_{-\\infty}^{\\infty}yf_{x}(g^{-1}(Y)){\\frac{1}{g^{\\Prime}(g^{-1}(Y))}}\\，dy}。\n现在，请注意，由于累积分布函数F Y(Y)=P(Y≤y){\\DisplayStyle F_{Y}(Y)=P(Y\\leq y)}，代入g(X)的值，取两边的倒数，重新排列得到FY(Y)=FX(g−1(Y)){\\DisplayStyle F_{Y}(Y)=F_{X}(g^{-1}(Y))}。然后，根据连锁反应法则，\nf Y(Y)=f X(g−1(Y))1g‘(g−1(Y)){\\DisplayStyle f_{Y}(Y)=f_{X}(g^{-1}(Y)){\\frac{1}{g^{\\Prime}(g^{-1}(Y))}}。\n∫−∞∞g(X)f X(X)dx=∫−∞∞y f Y(Y)dy{\\displaystyle\\int_{-\\infty}^{\\infty}g(X)f_{x}(X)\\，dx=\\int_{-\\infty}^{\\infty}yf_{Y}(Y)\\，dy}。\ne⁡[g(X)]=∫−∞∞g(X)f X(X)d x{\\DisplayStyle\\OperatorName{E}[g(X)]=\\int_{-\\infty}^{\\infty}g(X)f_{X}(X)\\，dx}。\n设Y=g(X){\\displaystyle Y=g(X)}。然后从期望值的定义开始。\nE⁡[Y]=∑y y f Y(Y){\\DisplayStyle\\操作员名称{E}[Y]=\\SUM_{y}yf_{Y}(Y)}。\nE⁡[g(X)=Y]=∑y y P(g(X)=y){\\DisplayStyle\\OperatorName{E}[g(X)=Y]=\\SUM_{y}YP(g(X)=y)}。\ne⁡[g(X)]=∑y y∑x：g(X)=y f X(X){\\DisplayStyle\\OperatorName{E}[g(X)]=\\SUM_{y}y\\SUM_{x\\，：\\，g(X)=y}f_{X}(X)}。\ne⁡[g(X)]=∑x g(X)f X(X){\\DisplayStyle\\OperatorName{E}[g(X)]=\\SUM_{x}g(X)f_{X}(X)}\n使用测度论中的参数可以从技术上完整地推导出结果，其中变换后的随机变量g(X)的概率空间与原始随机变量X的概率空间相关。这里的步骤包括定义变换后的空间的推进测度，然后结果是变量变换公式的示例。[5]。\n∫Ωg∘X d P=∫R g d(X∗P){\\DisplayStyle\\INT_{\\OMEGA}g\\CIRC X\\，\\mathm{d}P=\\int_{\\mathbb{R}}g\\，\\maththm{d}(X_{*}P)}。\n如果d(X∗P){\\DisplayStyle\\mathm{d}(X_{*}P)}关于勒贝格测度μ{\\DisplayStyle\\µ}绝对连续，我们称X{\\DisplayStyle X}有一个密度。在这种情况下。\nd(X∗P)=f dμ{\\DisplayStyle\\mathm{d}(X_{*}P)=f\\，\\mathm{d}\\mu}。\n其中f：r→R{\\displaystyle f：\\mathbb{R}\\to\\mathbb{R}}是密度(参见Radon-Nikodym导数)。因此，可以将上面的内容重写为更熟悉的。\nE⁡[g(X)]=∫Ωg∘X d P=∫Rg(X)f(X)d x{\\DisplayStyle\\OperatorName{E}[g(X)]=\\int_{\\omega}g\\cic X\\，\\mathm{d}P=\\int_{\\mathbb{R}}g(X)f(X)\\，\\maththm{d}x}。\n艾瑞克·基(1998)第6讲：随机变量存档2009-02-15在回路机上，利兹大学讲稿。\n^Bengt Ringner(2009)&#34；无意识统计学家定律，隆德大学数学科学中心，未发表说明\n约瑟夫·K·布利茨坦；杰西卡·黄(2014)。概率论导论(第一版)。查普曼和霍尔。第156页。\n^a b DeGroot，Morris；Schervish，Mark(2014)。“概率统计”(第4版)。培生教育有限公司。第213页。\n谢尔顿·M·罗斯著(2010)。概率模型导论(第10版)。爱思唯尔公司(Elsevier，Inc.)。\n？概率与统计虚拟实验室，科室，首页--期刊主要分类--期刊细介绍。3.1&#34；期望值：定义和性质&34；，第#34；项；基本结果：变量变换定理&#34；。", "note_en": "Jump to navigation  Jump to search  In  probability theory and  statistics, the  law of the unconscious statistician (LOTUS) is a theorem used to calculate the  expected value of a  function  g( X) of a  random variable  X when one knows the  probability distribution of  X but one does not know the distribution of  g( X). The form of the law can depend on the form in which one states the probability distribution of the random variable  X. If it is a  discrete distribution and one knows its  probability mass function  ƒ X (but not  ƒ  g( X)), then the expected value of  g( X) is\n E  ⁡  [  g  (  X  )  ]  =    ∑    x    g  (  x  )    f    X    (  x  )  ,      {\\displaystyle \\operatorname {E} [g(X)]=\\sum _{x}g(x)f_{X}(x),\\,}\n where the sum is over all possible values  x of  X. If it is a  continuous distribution and one knows its  probability density function  ƒ  X (but not  ƒ  g( X)), then the expected value of  g( X) is\n E  ⁡  [  g  (  X  )  ]  =    ∫    −  ∞     ∞    g  (  x  )    f    X    (  x  )      d   x    {\\displaystyle \\operatorname {E} [g(X)]=\\int _{-\\infty }^{\\infty }g(x)f_{X}(x)\\,\\mathrm {d} x}\n If one knows the  cumulative probability distribution function  F  X (but not  F  g( X)), then the expected value of  g( X) is given by a  Riemann–Stieltjes integral\n E  ⁡  [  g  (  X  )  ]  =    ∫    −  ∞     ∞    g  (  x  )      d     F    X    (  x  )    {\\displaystyle \\operatorname {E} [g(X)]=\\int _{-\\infty }^{\\infty }g(x)\\,\\mathrm {d} F_{X}(x)}\n    This proposition is known as the law of the unconscious statistician because students have been accused of using the identity without realizing that it must be treated as the result of a rigorously proved theorem, not merely a definition.  [4]\n  A similar property holds for  joint distributions. For discrete random variables  X and  Y, a function of two variables  g, and joint probability mass function  f( x,  y):  [5]\n E  ⁡  [  g  (  X  ,  Y  )  ]  =    ∑    y      ∑    x    g  (  x  ,  y  )  f  (  x  ,  y  )    {\\displaystyle \\operatorname {E} [g(X,Y)]=\\sum _{y}\\sum _{x}g(x,y)f(x,y)}\n  E  ⁡  [  g  (  X  ,  Y  )  ]  =    ∫    −  ∞     ∞      ∫    −  ∞     ∞    g  (  x  ,  y  )  f  (  x  ,  y  )      d   x      d   y    {\\displaystyle \\operatorname {E} [g(X,Y)]=\\int _{-\\infty }^{\\infty }\\int _{-\\infty }^{\\infty }g(x,y)f(x,y)\\,\\mathrm {d} x\\,\\mathrm {d} y}\n  This law is not a trivial result of definitions as it might at first appear, but rather must be proved.  [5]  [6]  [7]\n  For a continuous random variable  X, let  Y =  g( X), and suppose that  g is differentiable and that its inverse  g −1 is monotonic. By the formula for  inverse functions and differentiation,\n d    d  y     (    g    −  1    (  y  )  )  =      1      g    ′    (    g    −  1    (  y  )  )       {\\displaystyle {\\frac {d}{dy}}(g^{-1}(y))={\\frac {1}{g^{\\prime }(g^{-1}(y))}}}\n  d  x  =      1      g    ′    (    g    −  1    (  y  )  )     d  y    {\\displaystyle dx={\\frac {1}{g^{\\prime }(g^{-1}(y))}}dy}\n  ∫    −  ∞     ∞    g  (  x  )    f    X    (  x  )    d  x  =    ∫    −  ∞     ∞    y    f    X    (    g    −  1    (  y  )  )      1      g    ′    (    g    −  1    (  y  )  )       d  y    {\\displaystyle \\int _{-\\infty }^{\\infty }g(x)f_{X}(x)\\,dx=\\int _{-\\infty }^{\\infty }yf_{X}(g^{-1}(y)){\\frac {1}{g^{\\prime }(g^{-1}(y))}}\\,dy}\n Now, notice that because the cumulative distribution function              F    Y    (  y  )  =  P  (  Y  ≤  y  )    {\\displaystyle F_{Y}(y)=P(Y\\leq y)}  , substituting in the value of  g( X), taking the inverse of both sides, and rearranging yields              F    Y    (  y  )  =    F    X    (    g    −  1    (  y  )  )    {\\displaystyle F_{Y}(y)=F_{X}(g^{-1}(y))}  . Then, by the  chain rule,\n f    Y    (  y  )  =    f    X    (    g    −  1    (  y  )  )      1      g    ′    (    g    −  1    (  y  )  )       {\\displaystyle f_{Y}(y)=f_{X}(g^{-1}(y)){\\frac {1}{g^{\\prime }(g^{-1}(y))}}}\n  ∫    −  ∞     ∞    g  (  x  )    f    X    (  x  )    d  x  =    ∫    −  ∞     ∞    y    f    Y    (  y  )    d  y    {\\displaystyle \\int _{-\\infty }^{\\infty }g(x)f_{X}(x)\\,dx=\\int _{-\\infty }^{\\infty }yf_{Y}(y)\\,dy}\n  E  ⁡  [  g  (  X  )  ]  =    ∫    −  ∞     ∞    g  (  x  )    f    X    (  x  )    d  x    {\\displaystyle \\operatorname {E} [g(X)]=\\int _{-\\infty }^{\\infty }g(x)f_{X}(x)\\,dx}\n  Let            Y  =  g  (  X  )    {\\displaystyle Y=g(X)}  . Then begin with the definition of expected value.\n E  ⁡  [  Y  ]  =    ∑    y    y    f    Y    (  y  )    {\\displaystyle \\operatorname {E} [Y]=\\sum _{y}yf_{Y}(y)}\n E  ⁡  [  g  (  X  )  =  Y  ]  =    ∑    y    y  P  (  g  (  X  )  =  y  )    {\\displaystyle \\operatorname {E} [g(X)=Y]=\\sum _{y}yP(g(X)=y)}\n E  ⁡  [  g  (  X  )  ]  =    ∑    y    y    ∑    x    :    g  (  x  )  =  y      f    X    (  x  )    {\\displaystyle \\operatorname {E} [g(X)]=\\sum _{y}y\\sum _{x\\,:\\,g(x)=y}f_{X}(x)}\n E  ⁡  [  g  (  X  )  ]  =    ∑    x    g  (  x  )    f    X    (  x  )    {\\displaystyle \\operatorname {E} [g(X)]=\\sum _{x}g(x)f_{X}(x)}\n  A technically complete derivation of the result is available using arguments in  measure theory, in which the  probability space of a transformed  random variable  g( X) is related to that of the original random variable  X. The steps here involve defining a  pushforward measure for the transformed space, and the result is then an example of a  change of variables formula.  [5]\n ∫    Ω    g  ∘  X      d   P  =    ∫      R     g      d   (    X    ∗    P  )    {\\displaystyle \\int _{\\Omega }g\\circ X\\,\\mathrm {d} P=\\int _{\\mathbb {R} }g\\,\\mathrm {d} (X_{*}P)}\n We say            X    {\\displaystyle X}   has a density if              d   (    X    ∗    P  )    {\\displaystyle \\mathrm {d} (X_{*}P)}   is absolutely continuous with respect to the Lebesgue measure            μ    {\\displaystyle \\mu }  . In that case\n d   (    X    ∗    P  )  =  f      d   μ    {\\displaystyle \\mathrm {d} (X_{*}P)=f\\,\\mathrm {d} \\mu }\n where            f  :    R   →    R     {\\displaystyle f:\\mathbb {R} \\to \\mathbb {R} }   is the density (see  Radon-Nikodym derivative). So the above can be rewritten as the more familiar\n E  ⁡  [  g  (  X  )  ]  =    ∫    Ω    g  ∘  X      d   P  =    ∫      R     g  (  x  )  f  (  x  )      d   x    {\\displaystyle \\operatorname {E} [g(X)]=\\int _{\\Omega }g\\circ X\\,\\mathrm {d} P=\\int _{\\mathbb {R} }g(x)f(x)\\,\\mathrm {d} x}\n  ^  Eric Key (1998)  Lecture 6: Random variables   Archived 2009-02-15 at the  Wayback Machine, Lecture notes, University of Leeds\n ^  Bengt Ringner (2009)  &#34;Law of the unconscious statistician&#34;, unpublished note, Centre for Mathematical Sciences, Lund University\n ^   Blitzstein, Joseph K.; Hwang, Jessica (2014).  Introduction to Probability (1st ed.). Chapman and Hall. p. 156.\n ^     a     b   DeGroot, Morris; Schervish, Mark (2014).  Probability and Statistics (4th ed.). Pearson Education Limited. p. 213.\n ^     a     b     c   Ross, Sheldon M. (2010).  Introduction to Probability Models (10th ed.). Elsevier, Inc.\n ^   Virtual Laboratories in Probability and Statistics, Sect. 3.1 &#34;Expected Value: Definition and Properties&#34;, item &#34;Basic Results: Change of Variables Theorem&#34;.", "posttime": "2020-06-01 18:15:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "统计学家,unconscious,displaystyle", "title": "无意识统计学家定律", "title_en": "Law of the Unconscious Statistician", "transed": 1, "url": "https://en.wikipedia.org/wiki/Law_of_the_unconscious_statistician", "via": "", "real_tags": ["统计学家"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004635, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了帮助支持我们的社区在新冠肺炎期间远程工作，我们将在2020年6月30日之前免费提供ACM在我们数字图书馆中发布的所有作品。了解更多。\n我们使用饼干，以确保我们给你最好的经验，在我们的网站。\n您的浏览器似乎不支持它们，这会影响网站功能。", "note_en": "To help support our community working remotely during COVID-19, we are making all work published by ACM in our Digital Library freely accessible through June 30, 2020.  Learn more\n   We use cookies to ensure that we give you the best experience on our website.\n  It seems your browser doesn&#39;t support them and this affects the site functionality.", "posttime": "2020-06-01 17:23:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "透明度,moderation,网站", "title": "适度的透明度重要吗？[PDF]", "title_en": "Does Transparency in Moderation Matter? [pdf]", "transed": 1, "url": "https://dl.acm.org/doi/pdf/10.1145/3359252", "via": "", "real_tags": ["透明度", "网站"]}, {"category": "", "categoryclass": "", "imagename": "0058383b157d7c4f7e1da37985b1b679.png", "infoid": 1004634, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(彭博社)-高级Facebook Inc.。员工们周末在Twitter上表达了他们对首席执行官马克·扎克伯格(Mark Zuckerberg)决定不对煽动性言论采取行动的失望之情。", "note_en": "(Bloomberg) -- Senior Facebook Inc. employees took to Twitter over the weekend to express their dismay at Chief Executive Officer Mark Zuckerberg’s decision not to take action on incendiary comment...", "posttime": "2020-06-01 17:22:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,员工,employees,mark", "title": "Facebook员工批评扎克伯格在特朗普问题上无所作为", "title_en": "Facebook Employees Criticize Zuckerberg’s Inaction over Trump", "transed": 1, "url": "https://www.bloombergquint.com/onweb/facebook-employees-criticize-zuckerberg-s-inaction-over-trump", "via": "", "real_tags": ["facebook", "员工", "employees", "mark"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004633, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一家矿业公司获准炸毁巨坎峡谷洞穴，该洞穴为今天的传统所有者提供了4000年前的基因联系。\n西澳大利亚的一处圣地在一座铁矿的扩建中被摧毁，该圣地显示了4.6万年的持续占领，并为今天的传统所有者提供了4000年的基因联系。\n这个洞穴位于哈默斯利山脉的久坎峡谷，距离汤姆普莱斯山约60公里，是皮尔巴拉西部地区最古老的洞穴之一，也是澳大利亚唯一一个在上一个冰河时代显示出持续人类占领迹象的内陆遗址。周日，它与另一个圣地一起被炸毁。\n矿业公司力拓(Rio Tinto)在2013年根据西澳过时的土著遗产法获得了部长们的同意，同意摧毁或破坏该遗址。该法律于1972年起草，目的是有利于采矿支持者。\n在获得同意一年后，一项旨在抢救一切可以挽救的考古挖掘发现，该遗址的历史是之前认为的两倍多，并蕴藏着丰富的文物，包括神圣的物品。\n最珍贵的是一段4000年前的编成的人类头发，由几个不同的人的头部的头发编织在一起，DNA测试显示这是今天生活的Puutu Kunti Kurrama和Pinikura传统所有者的直系祖先。\n但过时的土著遗产法不允许在新信息的基础上重新谈判同意。因此，尽管与力拓定期会面，普图昆蒂库拉马和皮尼库拉土著公司(PKKP)仍无法阻止爆炸继续进行。\n“它是皮尔巴拉地区最神圣的地方之一…。我们希望该地区得到保护，“库尔德工人党负责人Burchell Hayes告诉澳大利亚卫报。\n“在我们国家发现的那样的辫子头发，然后进行进一步的测试，将其与库拉马人联系起来，这是非常宝贵的。”这是一件值得骄傲的事情，但也是令人难过的。它4000年来的安息之地已不复存在。“。\n海耶斯说，该地点曾被库拉马用作穿过该地区的营地，包括在一些长老的记忆中。\n“我们想做同样的事情，我们想展示给下一代看，”他说。“现在，如果这个遗址已经被摧毁，那么我们可以给他们讲故事，但我们不能给他们看照片，也不能让他们站在岩石掩体前说：这就是你的祖先生活的地方，从4.6万年前开始。”\n自2012年以来，土著遗产法一直以某种形式接受审查。前自由党政府在2014年提出的立法草案遭到否决，此前就连一名国民党议员也认为这对传统所有者不公平，没有允许进行充分的咨询。\n在2017年赢得选举之前，重写该法案被列为工党的优先事项，上个月，由于冠状病毒大流行，西澳土著事务部长本·怀亚特(Ben Wyatt)将对他的法案草案的最终咨询推迟到今年晚些时候。\n怀亚特说，新立法将提供上诉或修改协议的选项，以允许破坏遗产遗址。直到周一，他才意识到居坎遗址的风险，也就是它的破坏。\n他说：“它将规定传统业主和倡议者之间的协议包括一个程序，以考虑可能曝光的新信息，并允许各方在双方同意的情况下修订协议。”“如果任何一方不遵守协议，法例亦会提供上诉的选择。”\n力拓在提交给立法审查的文件中表示，它大体上支持拟议的改革，但根据当前制度授予的同意令应该继续下去，上诉权应该是固定的，不是广泛的，也不是可以延长的，以免“在项目的关键时刻延长批准或上诉程序”。\n力拓的一位发言人表示，该公司与普图·昆蒂·库拉马(Puutu Kunti Kurrama)和皮尼库拉(Pinikura)人的关系可以追溯到30年前，“过去17年来，我们一直在聚坎地区合作”。\n该公司表示：“力拓在一系列遗产问题上与PKKP人员进行了建设性的合作，并在可行的情况下修改了运营，以避免对遗产的影响，并保护对集团具有重要文化意义的地方。”\n这家矿业公司在2011年与传统所有者签署了一项原住民所有权协议，四年后，他们的原住民所有权主张得到了联邦法院的正式批准。他们在2014年为打捞挖掘提供了便利，揭开了该遗址的真实年龄。\n2008年进行的一次1米长的试掘确定该遗址的历史约为2万年，但打捞探险发现了一个“非常有意义的遗址”，收集了7000多件文物，包括4万年前的格子石，数千块来自幼虫的骨骼，这些骨头显示了动物群落随着气候变化的变化，以及神圣的物品。\n洞穴平坦的地面允许堆积很深的土壤和沙子，部分地方形成了近两米深的一层。皮尔巴拉的大多数考古挖掘都在30厘米处碰到岩石。\n最重要的是，考古记录并没有在上一个冰河时代消失。澳大利亚的大多数内陆考古遗址表明，在2.3万到1.9万年前的冰河时代，随着国家的枯竭和水源的枯竭，人们迁离了。来自巨坎峡谷的考古证据表明，它在整个过程中都被占领了。\n“这是那种你不常访问的网站，你可以在那里工作多年，”他说。“要有多大的意义，才能得到更广泛的社会的重视？”他说。\n·本文于2020年5月27日修改，更正了Burchell Hayes的拼写。·本文", "note_en": "Mining company was given permission to blast Juukan Gorge cave, which provided a 4,000-year-old genetic link to present-day traditional owners\n    A sacred site in Western Australia that showed 46,000 years of continual occupation and provided a 4,000-year-old genetic link to present-day traditional owners has been destroyed in the expansion of an iron ore mine.\n The cave in Juukan Gorge in the Hammersley Ranges, about 60km from Mt Tom Price, is one of the oldest in the western Pilbara region and the only inland site in Australia to show signs of continual human occupation through the last Ice Age. It was blasted along with another sacred site on Sunday.\n Mining company Rio Tinto received ministerial consent to destroy or damage the site in 2013 under WA’s outdated Aboriginal heritage laws, which were drafted in 1972 to favour mining proponents.\n One year after consent was granted, an archeological dig intended to salvage whatever could be saved discovered the site was more than twice as old as previously thought and rich in artefacts, including sacred objects.\n  Most precious was a 4,000-year-old length of plaited human hair, woven together from strands from the heads of several different people, which DNA testing revealed were the direct ancestors of Puutu Kunti Kurrama and Pinikura traditional owners living today.\n But the outdated Aboriginal Heritage Act does not allow for a consent to be renegotiated on the basis of new information. So despite regular meetings with Rio Tinto, the Puutu Kunti Kurrama and Pinikura (PKKP) Aboriginal Corporation was unable to stop the blast from going ahead.\n “It’s one of the most sacred sites in the Pilbara region … we wanted to have that area protected,” PKKP director Burchell Hayes told Guardian Australia.\n “It is precious to have something like that plaited hair, found on our country, and then have further testing link it back to the Kurrama people. It’s something to be proud of, but it’s also sad. Its resting place for 4,000 years is no longer there.”\n Hayes said the site had been used as a campsite by Kurrama moving through the area, including in the memory of some elders.\n “We want to do the same, we want to show the next generation,” he said. “Now, if this site has been destroyed, then we can tell them stories but we can’t show them photographs or take them out there to stand at the rock shelter and say: this is where your ancestors lived, starting 46,000 years ago.”\n  The Aboriginal Heritage Act has been up for review, in some form, since 2012.  Draft legislation put forward by the former Liberal government in 2014 was rejected after  even a National party MP argued it was unfair to traditional owners and  did not allow for adequate consultation.\n Rewriting the act was listed as a priority for Labor before their election win in 2017, and last month WA’s Aboriginal affairs minister Ben Wyatt pushed back the final consultation on his draft bill until later this year due to the coronavirus pandemic.\n The new legislation will provide options to appeal or amend agreements to allow for the destruction of heritage sites, Wyatt said. He wasn’t aware of the risk to the Juukan site, or its destruction, until Monday.\n “It will provide for agreements between traditional owners and proponents to include a process to consider new information that may come to light, and allow the parties to be able to amend the agreements by mutual consent,” he said. “The legislation will also provide options for appeal should either party not be compliant with the agreement.”\n In its submission to the legislative review, Rio Tinto said it was broadly supportive of the proposed reform but that consent orders granted under the current system should be carried over, and that rights of appeal should be fixed, not broad or subject to extensions, lest it “prolong approvals or appeals processes at a critical point in the project.”\n A spokesman from Rio Tinto said the company had a relationship with the Puutu Kunti Kurrama and Pinikura people dating back three decades, “and we have been working together in relation to the Juukan area over the past 17 years”.\n “Rio Tinto has worked constructively together with the PKKP People on a range of heritage matters and has, where practicable, modified its operations to avoid heritage impacts and to protect places of cultural significance to the group,” the company said.\n The mining company signed a native title agreement with the traditional owners in 2011, four years before their native title claim received formal assent by the federal court. They facilitated the salvage dig in 2014, which uncovered the true age of the site.\n   An earlier 1 metre test dig, conducted in 2008, dated the site at about 20,000 years old, but the salvage expedition uncovered a “very significant site” with more than 7,000 artefacts collected, including grid stones that were 40,000 years old, thousands of bones from middens which showed changes in fauna as the climate changed, and sacred objects.\n The flat floor of the cave allowed for a significant depth of soil and sand to build up, creating a layer almost two metres deep in parts. Most archeological digs in the Pilbara hit rock at 30cm.\n Most significantly, the archeological records did not disappear during the last Ice Age. Most inland archeological sites in Australia show that people moved away during the Ice Age between 23,000 and 19,000 years ago, as the country dried up and water sources dried up. Archeological evidence from Juukan Gorge suggest it was occupied throughout.\n “It was the sort of site you do not get very often, you could have worked there for years,” he said. “How significant does something have to be, to be valued by wider society?” he said.\n • This article was amended on 27 May 2020 to correct the spelling of Burchell Hayes.  • This article", "posttime": "2020-06-01 17:06:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "土著,tinto,遗址", "title": "力拓炸毁4.6万年前的土著遗址扩大铁矿", "title_en": "Rio Tinto blasts 46,000-year-old Aboriginal site to expand iron ore mine", "transed": 1, "url": "https://www.theguardian.com/australia-news/2020/may/26/rio-tinto-blasts-46000-year-old-aboriginal-site-to-expand-iron-ore-mine", "via": "", "real_tags": ["土著", "tinto", "遗址"]}, {"category": "", "categoryclass": "", "imagename": "375a709d5d702a2c295ce38d168068fd.png", "infoid": 1004632, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "绘制警察暴力地图是一项研究合作项目，收集全国警察杀人的全面数据，以量化警察暴力在社区中的影响。", "note_en": "Mapping Police Violence is a research collaborative collecting comprehensive data on police killings nationwide to quantify the impact of police violence in communities.", "posttime": "2020-06-01 16:31:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,警察,police", "title": "绘制警察暴力地图", "title_en": "Mapping Police Violence", "transed": 1, "url": "https://mappingpoliceviolence.org/", "via": "", "real_tags": ["app", "警察", "police"]}, {"category": "", "categoryclass": "", "imagename": "c13d0ab8a8f0e5ba179d48b84bbc9919.jpg", "infoid": 1004630, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着生物技术的进步，我们对作为人类意味着什么的想法也可能随之进步。\n今天，我们可以用以前无法想象的方式改变我们的身体，无论是植入微芯片，安装先进的假肢，甚至是设计全新的感官。\n所谓的超舒曼主义者--那些寻求通过科技改善身体来改善自己生理的人--认为我们的自然条件阻碍了我们对世界的体验，而我们可以通过科学超越我们目前的能力。\n对一些人来说是技术进步的想法，对另一些人来说是有争议的。但对摄影师大卫·文特纳来说，它们完全是另一回事：美丽。\n文特纳说，美存在于工程产品中。他多年来一直在为即将出版的新书“我想相信--跨舒马主义探索”拍摄现实生活中的半机械人和身体修改器。\n这本书是与艺术总监兼评论家杰姆·弗莱彻合作完成的，书中有各种各样的人，他们在某种程度上认为自己是超舒曼，包括一位长着能感觉到大气压力变化的仿生耳朵的男人，一位能感觉到世界各地正在发生的地震的女人，还有一位研发出实验室器官的技术人员。在某种程度上，这本书的特色是：一位长着能感觉到大气压变化的仿生耳朵的男人，一位能感觉到世界各地正在发生的地震的女人，还有一位研发出实验室器官的技术人员。\n弗莱彻最初是通过伦敦未来主义集团(London Futurist Group)接触到跨舒曼主义亚文化的，这是一个探索技术如何应对未来危机的组织。在会见了一些成员后，这位伦敦的艺术总监找到了文特纳，提出了用一系列肖像拍摄他们的想法。\n温特纳在电话采访中回忆道，我们的第一张照片是与安德鲁·弗拉基米罗夫(Andrew Vladimirov)一起拍摄的，他是一名DIY&34；大脑黑客。每次我们给新人拍照时，我们都会要求推荐和介绍运动中的其他关键人物。\n虽然这位摄影师承认，跨舒马主义者的说法一开始可能看起来很奇怪，但他很快就看到了科技自我提升的吸引力。如果有机会，你会如何设计你自己的身体，你希望它对你有什么影响？&#34；他问道。\nVintiner的研究对象之一詹姆斯·杨(James Young)在2012年的一次事故中失去了手臂和腿，后来转向了仿生学。杨一直对生物技术感兴趣，尤其被科幻美学所吸引。想象他的身体如何在最新技术的帮助下被重建，甚至执行增强的任务，成为他康复过程的一部分。\n但据这位29岁的年轻人说，医生提供给他的选择一点也不令人兴奋--标准配置的带有肉色硅胶袖子的钢制仿生假肢。\n杨在一次视频采访中说，最让人心烦意乱的是看看能买到什么。\n就工具和技术而言，人体可以构成什么是如此模糊的东西--如果你想一想手臂，它只是一件感官设备。\n如果有人会被砍掉胳膊和腿，那一定是我，因为我对技术和它能做的事情感到兴奋。\n日本游戏巨头Konami与假肢雕塑家索菲·德·奥利维拉·巴拉塔(Sophie De Oliveira Barata)合作，为杨设计了一套仿生肢体。结果是一只由灰色碳纤维制成的手臂和腿--这种美学灵感部分来自Konami的“金属齿轮实心”(Metal Gear Solid)，这是这位当时22岁的年轻人最喜欢的视频游戏之一。\n除了预期的功能之外，杨的机械臂还配备了一个USB端口，一个显示他推特信息的屏幕，以及一个装有遥控无人机的可伸缩基座。四肢由传感器控制，传感器将杨的脊椎中的神经冲动转化为身体运动。\nYoung的Vintiner说，先进的假肢使詹姆斯改变了人们对残疾的看法，并补充说：当你第一次向人们展示照片时，他们会被照片中包含的想法震惊和不安。但是如果你仔细分析这些想法，他们会意识到它们是非常务实的。\n杨说，人们花了几年时间不仅欣赏先进的仿生肢体的功能，还欣赏它们的美学。他说，仿生和电子肢体被认为是可怕的，纯粹是因为它们的外观。他们不谋而合，认为残疾并不性感。\n他还觉得仿生学周围有耻辱，因为患者经常被给予肉色的袖子来隐藏他们的假肢。\n从视觉上看，我们认为这是人体的边界，杨说，指的是他剩下的生物手臂。变性人的机会打开了，因为仿生手臂感觉不到疼痛，或者如果你有钱的话，它可以立即被取代。它有不同的耐热能力和不被晒伤的能力。\n当文特纳继续拍摄肖像画时，他感到自己的许多先入为主的观念受到了挑战。这一过程也提出了一个深刻的问题：如果技术可以改变人类的意义，那么它也能改变美丽的意义吗？\n他说，我的大部分(原创)作品都是以人为中心的--他们的行为、性格、怪癖和故事。但是这个项目将美的概念提升到了另一个层次。\n对文特纳来说，科学对我们对美学理解的影响是跨舒马主义最吸引人的方面之一。然而，他发现，这场运动中的许多人仍然将现有的美容标准视为后人类完美的典范。\n弗莱彻和文特纳的书中的另一个主题是索菲亚，一个由汉森机器人公司的科学家大卫·汉森和本·戈泽尔设计的机器人。索菲亚是迄今为止最先进的类人机器人之一。\n在2018年接受CNN Style采访时，汉森表示，索菲亚的造型将会引起世界各地的人们的共鸣，她的出现在一定程度上受到了包括汉森的妻子和奥黛丽·赫本在内的真实女性的启发，还有埃及王后奈菲尔蒂蒂的雕像。\n但她淡褐色的眼睛，完美的拱形眉毛，长长的睫毛，轮廓分明的颧骨和丰满的嘴唇--索菲亚的外表可以说是传统美丽的高加索女性的缩影。\n当我给本·戈泽尔拍照时，他说他没有花时间考虑他(自己)的样子--他对此并不感兴趣，摄影师回忆起那次拍照。\n文特纳看到了一定的讽刺意味：一个不关心自己外表的人仍然会通过他的公司的发明来投射我们对美的关注。\n它还提醒人们，吸引力可能比算法所能理解的要复杂得多。\n温特纳说：“我担心，如果我们能设计出没有任何生物构成缺陷的人类，事情就会越来越完美，达到我们现在只能想象的完美程度。”看看整形手术如何在很短的时间内改变了我们对美的看法。\n如果跨舒曼主义者是对的，我们作为人类可以活到几百岁，那么我们对美的概念和做人的意义将发生巨大的变化。\n由于冠状病毒的流行，“我想相信--跨国界主义探索”以及Kickstarter活动和图片展的启动被暂时推迟。", "note_en": "As biotechnology advances, so too may our ideas of what it means to be  human.\n Today, we can alter our bodies in previously unimaginable ways, whether that&#39;s implanting microchips, fitting advanced prosthetic limbs or even designing entirely new senses.\n So-called transhumanists -- people who seek to improve their biology by enhancing their bodies with technology -- believe that our natural condition inhibits our experience of the world, and that we can transcend our current capabilities through science.\n  Ideas that are &#34;technoprogressive&#34; to some are controversial to others. But to photographer David Vintiner, they are something else altogether: beautiful.\n  &#34;Beauty is in the engineered products,&#34; said Vintiner, who has spent years photographing  real-life cyborgs and body-modifiers for his upcoming book, &#34;I Want to Believe -- An Exploration of Transhumanism.&#34;\n  Made in collaboration with art director and critic Gem Fletcher, the book features a variety of people who identify, to some degree, as &#34;transhuman&#34; -- including a man with bionic ears that sense changes in atmospheric pressure, a woman who can &#34;feel&#34; earthquakes taking place around the world and technicians who have developed lab-made organs.\n Fletcher was first introduced to the transhumanist subculture via the London Futurist Group, an organization that explores how technology can counter future crises. Upon meeting some of its members, the London-based art director approached Vintiner with the idea of photographing them in a series of portraits.\n  &#34;Our first shoot was with Andrew Vladimirov, a DIY &#39;brain hacker,&#39;&#34; Vintiner recalled in a phone interview. &#34;Each time we photographed someone new, we asked for referrals and introductions to other key people within the movement.&#34;\n Though the photographer admitted that the transhumanists&#39; claims can seem outlandish at first, he soon saw the appeal of technological self-enhancement. &#34;If given the chance, how would you  design your own body and what would you want it to say about you?&#34; he asked.\n  One of Vintiner&#39;s subjects, James Young, turned to bionics after losing his arm and leg in an accident in 2012. Young had always been interested in biotechnology and was particularly drawn to the aesthetics of science fiction. Visualizing how his body could be &#34;re-built,&#34; or even perform enhanced tasks with the help of the latest technology, became part of his recovery process.\n But according to the 29-year-old, the options presented to him by doctors were far from exciting -- standard-issue steel bionic limbs with flesh-colored silicone sleeves.\n   &#34;To see what was available was the most upsetting part,&#34; Young said in a video interview.\n &#34;What the human body can constitute, in terms of tools and technology, is such a blurry thing -- if you think about the arm, it&#39;s just a sensory piece of equipment.\n &#34;If there was anyone who would get their arm and leg chopped off, it would be me because I&#39;m excited about technology and what it can get done.&#34;\n  Japanese gaming giant Konami worked with prosthetics sculptor Sophie de Oliveira Barata to design a set of bionic limbs for Young. The result was an arm and leg made from gray carbon fiber -- an aesthetic partly inspired by Konami&#39;s &#34;Metal Gear Solid,&#34; one of the then-22-year-old&#39;s favorite video games.\n Beyond the expected functions, Young&#39;s robotic arm features a USB port, a screen displaying his Twitter feed and a retractable dock containing a remote-controlled drone. The limbs are controlled by sensors that convert nerve impulses from Young&#39;s spine into physical movements.\n &#34;Advanced prosthetics enabled James to change people&#39;s perception of (his) disability,&#34; said Vintiner of Young, adding: &#34;When you first show people the photographs, they are shocked and disconcerted by the ideas contained within. But if you dissect the ideas, they realize that they are very pragmatic.&#34;\n  Young says it has taken several years for people to appreciate not just the functions of advanced bionic limbs but their aesthetics, too. &#34;Bionic and electronic limbs were deemed scary, purely because of how they looked,&#34; he said. &#34;They coincided with the idea that &#39;disability is not sexy.&#39;&#34;\n He also felt there was stigma surrounding bionics, because patients were often given flesh-colored sleeves to conceal their artificial limbs.\n  &#34;Visually, we think that this is the boundary of the human body,&#34; Young said, referring to his remaining biological arm. &#34;Opportunities for transhumanists open up because a bionic arm can&#39;t feel pain, or it can be instantly replaced if you have the money. It has different abilities to withstand heat and to not be sunburned.&#34;\n As Vintiner continued shooting the portraits, he felt many of his preconceptions being challenged. The process also raised a profound question: If technology can change what it is to be human, can it also change what it means to be beautiful?\n &#34;Most of my (original) work centers around people -- their behavior, character, quirks and stories,&#34; he said. &#34;But this project took the concept of beauty to another level.&#34;\n   Science&#39;s impact over our understanding of aesthetics is, to Vintiner, one of the most fascinating aspects of transhumanism. What he discovered, however, was that many in the movement still look toward existing beauty standards as a model for &#34;post-human&#34; perfection.\n Another subject of Fletcher and Vintiner&#39;s book is Sophia, a robot designed by scientists David Hanson and Ben Goertzel at Hanson Robotics.  Sophia is one of the most advanced humanoid robots to date.\n Speaking to CNN Style in 2018, Hanson said that Sophia&#39;s form would resonate with people around the world, and that her appearance was partly inspired by real women including Hanson&#39;s wife and Audrey Hepburn, as well as statues of the Egyptian queen Nefertiti.\n  But with her light hazel eyes, perfectly arched eyebrows, long eyelashes, defined cheekbones and plump lips -- Sophia&#39;s appearance arguably epitomizes that of a conventionally beautiful Caucasian woman.\n  &#34;When I photographed Ben Goertzel, he vocalized how he took no time to consider how he (himself) looked -- it was of no interest to him,&#34; the photographer recalled of the photo shoot.\n Vintiner saw a certain irony: that someone who was unconcerned about his own appearance would nonetheless project our preoccupation with beauty through his company&#39;s invention.\n It also served as a reminder that attractiveness may be more complex than algorithms can ever fathom.\n  &#34;I fear that if we can design humans without any of the &#39;flaws&#39; that occur in our biological makeup, things will be pushed further and further towards a level of perfection we can only imagine right now.&#34; Vintiner said. &#34;Look at how plastic surgery has altered our perception of beauty in a very short space of time.\n &#34;If the transhumanists are right and we, as humans, can live to be several hundreds of years old, our notion of beauty and the very meaning of what it is to be human will change dramatically.&#34;\n Due to the coronavirus pandemic, the launch of &#34;I Want to Believe -- An Exploration of Transhumanism,&#34; as well as a   Kickstarter  campaign and accompanying photo exhibition, have been temporarily postponed.", "posttime": "2020-06-01 15:58:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "舒马,transhumanists,技术", "title": "“技术进步”的跨舒马主义者是如何用技术增强他们的身体的", "title_en": "How 'Technoprogressive' Transhumanists Are Enhancing Their Bodies With Technology", "transed": 1, "url": "https://www.cnn.com/style/article/david-vintiner-transhumanism/index.html", "via": "", "real_tags": ["舒马", "技术"]}, {"category": "", "categoryclass": "", "imagename": "2fe743cf37eb2957d0b662469bb26213.jpg", "infoid": 1004628, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "巴黎--在过去两个月的大部分时间里，巴黎一直空无一人--商店和咖啡馆关门，街道空无一人，数百万游客突然蒸发。\n没有了人，城市景观让人联想到一个更老的巴黎。特别是，它让人想起了欧仁·阿特吉(Eugène Atget)的独特巴黎，他是20世纪初现代摄影之父，对细节的无情关注。\n在数以千计的照片中，阿吉特拍摄了一座空荡荡的城市，每天清晨起床，拖着他的原始设备走遍街道。他的形象将巴黎还原为建筑的精髓。\n毛里西奥·利马(Mauricio Lima)追随阿吉特的脚步，拍摄了他著名的前任拍摄的相同场景的图像。但这一次，由于冠状病毒大流行，这些街道空无一人。利马先生的娱乐活动为阿吉特的作品提供了新的洞察力，也让人们对一个城市的意义有了新的见解，这座城市的独特之处在于它的美丽，但也在于它的寒冷。\n评论家和哲学家沃尔特·本杰明在讨论阿吉特的照片时引用了著名的犯罪现场。他指的是他们的空虚，他们对城市景观细节的冷静关注，他们对多愁善感和浮夸的绝对拒绝。\n正如本杰明所说，阿吉特建立了有益的“人与环境之间的距离”。利马先生令人难忘的最新娱乐证实了这位去世已久的摄影师令人不安的洞察力-巴黎并不关心你的存在。它是无关紧要的，而且肯定会在没有你的情况下继续下去。\n你可以站在巴黎的街道上感到快乐，但这种感觉并没有得到回报。\n阿吉特出生于1857年，他最初尝试表演和绘画，但都没有成功。1890年，他以摄影师的身份开了一家店，目的是-就像他门上的一块牌子所说的那样-为“艺术家提供文件”。他知道画家需要图像作为他们工作的模型，于是他着手为他们提供家具。\n在近30年的时间里，他扛着沉重的三脚架在这座城市里跋涉，记录着已经消失的狭窄街道和肮脏覆盖的低矮建筑组成的巴黎。\n1920年，阿吉特写道：“我可以说我拥有了整个老巴黎。”\n直到1927年阿吉特去世的几年前，他遇到了一位年轻的美国摄影师贝雷尼斯·阿博特(Berenice Abbott)，当时他是艺术家曼·雷(Man Ray)的助手，直到那时，世界对他的作品几乎无动于衷。她拍了他的照片，写了他的故事，获得了他的许多照片，并坚持不懈地宣传了他50年。\n他的照片中的巴黎空荡荡的，隐约出现在看起来像是永恒的雾的昏暗的光线中。他的建筑是独立于人的。他们甚至不需要他们。信息似乎是，巴黎仍在继续。它不关心个人的存在。这座城市对人类并不感情用事。\n诚然，人性的痕迹在他的照片中无时无刻不存在-撕破的广告海报，手工制作的商店招牌，一箱箱蔬菜，一排排靴子。但这些只是提醒人们，这座城市可能曾经有人居住。而在图片中几乎没有人证实这一点。\n本杰明写道，在阿吉特的巴黎，“整个城市都被疏散了，就像一间公寓还没有找到新的租户。”\n把它和今天的图片对比一下。偶尔出现的蒙面人物是风景的附属品。他们戴着面具，遮住了部分脸部，这是对他们人性的进一步否认。\n城市景观独立于人，展现了它的存在。在今天拍摄的塞纳街拐角的奇怪角度的照片中，在现在很时髦的第六区--阿吉特最著名的形象之一--中，这座建筑似乎傲慢地从天空中突现出来，就像一座雕塑。\n维勒街(Rue de l‘Hôtel de Ville)上孤独的骑车人强调了街道的空旷，Servandoni街14号前的小狗也是如此。当前照片中较亮的光线突出了布切里街上石头冰冷坚硬的角度。巴黎似乎比以往任何时候都更加漠不关心。\n从现在的照片中也可以明显看出，巴黎已经被大刀阔斧地清理干净了。积聚了几个世纪的污垢和烟尘-仍然存在于20世纪60年代-已经被冲走了。\n在二战期间德国占领巴黎的照片中，变黑的正面非常突出，现在是白色的。曾经贴在许多门面上的广告海报早已不复存在。墙壁已经被平整过，重新铺设过，重新粉刷过。\n巴黎不再是一个劳动人民的城市。木匠、鞋匠、烟囱清洁工、菜妇和搬运工的存在在阿吉特的照片中被唤起了(如果不是总是被表现出来的话)已经消失很久了。\n塞纳街拥有屋顶花园和别致的店面，现在是这座城市价格较高的地区之一。在阿吉特的指纹里肯定不是这样的。但在今天的照片中，巴黎已经被美化和中产阶级化了。\n正如本杰明所指出的，阿吉特回避的“风景如画”更难避免。难度很大，但在冠状病毒流行的时代，或许并非不可能。", "note_en": "PARIS — For much of the last two months,  Paris has been empty — its shops and cafes shuttered, its streets deserted, its millions of tourists suddenly evaporated.\n Freed of people, the urban landscape has evoked an older Paris. In particular, it has called up the singular Paris of Eugène Atget, an early 20th-century father of modern photography in his unsentimental focus on detail.\n In thousands of pictures, Atget shot an empty city, getting up early each morning and lugging his primitive equipment throughout the streets. His images reduced Paris to its architectural essence.\n Mauricio Lima has followed in Atget’s footsteps, shooting images of the same scenes his famous predecessor captured. But this time those streets are deserted because of the coronavirus pandemic. Mr. Lima’s recreations offer new insight into Atget’s work — and into the meaning of a city unique in its beauty but also in its coldness.\n The critic and philosopher Walter Benjamin famously invoked crime scenes in discussing Atget’s photographs. He was pointing to their emptiness, their clinical attention to details of the urban landscape, their absolute rejection of the sentimental and the grandiose.\n As Benjamin observed, Atget established a beneficial “distance between man and his environment.” And Mr. Lima’s haunting updated recreations confirm the long-dead photographer’s disquieting insight — Paris doesn’t care about your presence. It is indifferent, and will certainly go on without you.\n You can feel joy at standing on a Paris street, but the feeling is not reciprocated.\n    Atget, who was born in 1857, initially tried unsuccessfully at acting and painting. In 1890, he set up shop as a photographer, in order — as a sign over his door said — to provide “Documents for Artists.” He knew that painters needed images as models for their work, and he set about furnishing them.\n For nearly three decades, he trudged through the city, bearing his heavy tripod and documenting a Paris of narrow streets and grime-covered low buildings that was already disappearing.\n In 1920, Atget wrote: “I can say that I possess all of Old Paris.”\n    The world was mostly indifferent to Atget’s work until, several years before his death in 1927, he met a young American photographer, Berenice Abbott, who was working as an assistant to the artist Man Ray. She photographed him, wrote about him, acquired many of his prints and promoted him relentlessly for 50 years.\n  The empty Paris of his prints looms out of the half-light of what seems like perpetual fog. His buildings are independent of  people. They don’t even need them. Paris, the message seems to be, continues. It does not care about the individual presence. The city is not sentimental about humankind.\n True, traces of humanity are ever-present in his pictures — torn advertising posters, artisanal shop signs, bins of vegetables, rows of boots. But these are only reminders that the city might once have been inhabited. And there are few people in the images to confirm this.\n In Atget’s Paris, “the city is evacuated, like an apartment that hasn’t yet found its new tenant,” Benjamin wrote.\n    Compare that with the images from today. The occasional masked figures are incidental to the landscape. That they wear masks, hiding part of their faces, is a further denial of their humanity.\n The urban landscape asserts its presence, independent of people. In the present-day photograph of the strange angle at the corner of the Rue de Seine, in the now-fashionable 6th arrondissement — one of Atget’s most famous images — the building seems to jut insolently out of the sky, like a kind of sculpture.\n The lonely cyclist on the Rue de l’Hôtel de Ville emphasizes the street’s emptiness, as does the small dog in front of 14 Rue Servandoni. The brighter light of the current pictures emphasizes the cold, hard angles of the stone on the Rue de la Bûcherie. Paris seems more indifferent than ever.\n    It is also evident in the present-day photographs that Paris has been mightily cleaned up. The accumulated grime and soot of centuries — still present in the 1960s — has been washed away.\n The blackened facades, so prominent in photographs of Paris during the German occupation in World War II, are now white. The advertising posters that once plastered many of the facades are long gone. Walls have been smoothed over, resurfaced, repainted.\n Paris is no longer a city of working people. The carpenters, cobblers, chimney-sweeps, vegetable-ladies and porters whose presence is evoked, if not always represented, in Atget’s pictures are long since gone.\n The Rue de Seine, with its rooftop gardens and chic storefronts, is now one of the pricier bits of the city. It certainly doesn’t look like that in Atget’s print. But in today’s pictures, Paris has been prettified and gentrified.\n The “picturesque” — which Atget shunned, as Benjamin points out — is more difficult to avoid. Difficult but, in the time of the coronavirus, perhaps not impossible.", "posttime": "2020-06-01 15:38:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "年后,ne,照片", "title": "100年后，欧仁·阿特吉的巴黎", "title_en": "Eugène Atget's Paris, 100 years later", "transed": 1, "url": "https://www.nytimes.com/2020/05/27/world/europe/paris-atget-coronavirus.html", "via": "", "real_tags": ["年后", "ne", "照片"]}, {"category": "", "categoryclass": "", "imagename": "73aeda0cb1405b26592ed9bf313c2017.png", "infoid": 1004627, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转搜索Qt公司在2020年1月宣布，他们将把Qt工具包的LTS版本限制为付费客户，这一举措受到了广泛批评。Qt公司是许多自由软件使用的流行Qt工具包的制造商。他们目前正在强烈考虑更进一步，将所有Qt版本限制在前12个月向许可证持有者支付费用。这危及流行的KDE等离子体桌面环境和LXQt桌面环境的未来，并使使用Qt工具包进行自由软件开发的智慧受到质疑。\nQt公司是广受欢迎的双许可Qt工具包的制造商，目前在纳斯达克赫尔辛基的交易价格约为每股20欧元。\n德国KDE开发人员Olaf Schmidt-Wischhöfer在欧洲发展研究和培训机构协会(European Association Of Development Research And Training Institutes)工作，当他不是KDE社区的志愿者时，他在KDE社区邮件列表上发布了一条关于Qt公司(Qt Group Oyj，QTCOM，目前的交易价格为19.90欧元)和KDE社区之间关系的非常令人担忧的消息。\n到目前为止，Qt公司已经在双许可模式下发布了Qt，在这种模式下，自由软件用户和开发人员可以在GNU GPL下免费使用工具包，而不道德专有软件的商业开发者则被要求在商业许可下许可工具包。Qt公司通过结束这种双许可模式来拉拢自由软件社区的可能性已经有很长一段时间了，这是一个真正令人担忧的问题。当Qt公司在2020年1月宣布Qt长期支持发布将仅限于向许可证持有者支付费用时，这一威胁变得非常现实。\nKDE基金会以其无限的智慧，在几年前的一份书面协议中巩固了Qt和自由软件社区之间的特殊关系。本协议要求Qt公司继续放行Qt(..)的所有部件。根据GPLv3或兼容的许可证&#34；。这很好，但有个漏洞：\n如果这些许可条款在Qt发布时还不存在，则它们必须在不超过12个月的时间范围内应用。&#34；\nQt公司似乎不顾一切地想要最大限度地利用这个漏洞，从发布之日起关闭Qt的LTS版本和开发版本12个月。这一举动给KDE社区和一般使用Qt工具包的部分自由软件社区带来了巨大的问题。让我们假设在Qt中发现了一个巨大的安全漏洞，它影响了KDE或其他基于Qt的免费软件。如果自由软件用户必须保持一整年的易受攻击状态，才能获得更新版本的补丁，那将是非常不幸的。\n12个月的限制原则上不会使Qt成为专有软件，但从实践的角度来看，它也可以是专有的。\n使用KDE或Qt软件的用户可能希望阅读KDE社区邮件列表上Olaf Schmidt-Wischhöfer提供的标题为Qt；Qt，Open Source and Corona&34；的完整消息：\nKDE社区、Qt项目和Qt公司之间的关系一直很密切，对三方都有利。\nQt公司受益于围绕其产品拥有一个由贡献者、开发人员和专家组成的庞大而健康的社区。\nQt项目受益于将公司作为管理人员和非常大的贡献者，并将KDE作为一个大型且知名的子社区。\n幸运的是，KDE Free Qt基金会的存在确保了开源Qt：https://kde.org/community/whatiskde/kdefreeqtfoundation.phpTogether和Martin Konold的继续存在，我在该基金会的董事会中代表KDE。\n在过去的两年中，Qt公司和KDE Free Qt基金会就更新合同进行了谈判。\n在不损害Qt项目或KDE社区的情况下帮助公司增加收入。\n修复付费Qt许可条款与使用或贡献开源(https://www.qt.io/terms-conditions/中的“禁止组合”)之间的不兼容性\n修复Qt Design Studio(它只是部分自由软件)与我们与该公司现有合同之间的许可证不兼容。\n加强我们与该公司的合同，要求他们立即发布Qt的免费软件(目前，他们被允许延迟12个月)，以确保提供适用于KDE的LTS安全补丁。\n评估公司建议的合同变更，目的是使qt业务更有利可图，例如，可以选择将qt与其他软件捆绑销售，或者使与专有第三方软件的集成成为可能。\n谈判中的一个挫折是Qt公司在1月份宣布：https://www.qt.io/blog/qt-offering-changes-2020They宣布Qt的LTS版本将只对付费许可证持有者开放。目前还不清楚这对Qt的贡献以及各方(包括Qt公司、众多贡献Qt的专家、KDE社区和Linux发行版)之间的安全修复共享意味着什么。\n尽管如此，3月6日在法兰克福举行的面对面会议上，我们仍设法为可能的前进道路奠定了基础，继续采取对各方都有利的方法。\n但上周，该公司突然通知KDE e.V.董事会和KDE Free Qt基金会，科罗娜病毒造成的经济前景给他们带来了更大的压力，要求他们增加短期收入。因此，他们正在考虑将所有Qt版本限制在前12个月的付费许可证持有者范围内。他们意识到，这将意味着通过开放治理的贡献在实践中的终结。\n显然，脱离非常强大的Qt+KDE社区是不可能符合Qt公司的中长期健康的。\n我们希望QT公司重新考虑。然而，开放源码社区面临的这种威胁需要预料到，这样Qt和KDE社区才能做好准备。\nQt公司说，只有我们在其他方面给他们优惠，他们才愿意重新考虑这种做法。然而，我想起了半年前的情况。我们曾讨论过一种合同更新的方法，但他们突然通过限制Qt的LTS发布而抛弃了这一方法。\n这对Qt的未来和KDE的未来意味着什么？\nQt中的所有软件更改仍将按照我们的合同要求以开源的方式提供-如果公司决定与社区分道扬镳，可能会延迟12个月。\n我们将继续致力于合同更新，这对各方都有帮助。但是，即使这些谈判被Qt公司单方面阻止，Qt仍将保持开源，KDE将能够使用它。我也绝对相信，即使Qt公司决定放弃合作的好处，Qt+KDE社区也会继续在新功能、错误修复和安全修复方面进行合作。\n瑞典KDE贡献者和FOSS爱好者Jens Reurberg在4月8日对KDE社区邮件列表的回复中谈到了Qt公司：\n在我看来，他们想烧毁田地，却仍然认为春天就能收获的事实是荒谬的，而且似乎是由一个对自己项目涉及的技术或社会层面的工作过程一无所知的人所做的。&#34；\nKrita开发者Boudewijn Rempt在谈到自由软件社区未来的选择时是这样说的：\n如果我们与Qt社区中的其他参与者一起工作，那么这可能是可行的。事实上，我认为有必要开始召集一群利益相关者，并开始为分叉做准备。&#34；\n这是个相当可怕的消息。我可以理解为什么GTK成为现在最占主导地位的工具包。这很不幸，因为GNOME在Linux上真的走上了独裁者的道路。现在Linux上的工具包情况似乎不太好。\n哥们儿，把Qt冻结到5.2版或者其他什么版本都行。任何东西都比侏儒图形用户界面好，它比20年的贪婪更糟糕。\n许多项目试图通过对自由含糊其辞来廉价赚取大笔资金。相当恶心的策略。首先充当反盖茨的救世主，然后一旦人们上瘾就敲诈他们。太丢人了。\n伙计，如果QT公司从Covid19破产，KDE电动汽车可以花1欧元买下它。问题解决了。\n如果Qt公司未能在12个月内发布最新的Qt，KDE有权(根据双方签署的协议)要求在任何免费许可(如BSD或MIT或其他)下发布整个Qt。这将意味着Qt公司的终结，因为当前的许可(LGPL)允许他们在客户需要修改Qt并且不想发布代码时赚钱，但是有了BSD/MIT许可，即使没有Qt公司的商业许可，他们也可以这样做。\nLinuxReviews欢迎所有评论。如果您不想匿名，请注册或登录。它是免费的。", "note_en": "Jump to navigation Jump to search The Qt Company, maker of the popular Qt toolkit used by a lot of free software, announced that they would be restricting LTS releases of the Qt toolkit to paying customers in a widely criticized move back in January, 2020. They are currently strongly considering taking that one step further by restricting all Qt releases to paying license holders for the first 12 months. This jeopardizes the future of the popular KDE Plasma desktop environment as well as the LXQt desktop environment and it puts the wisdom of using the Qt toolkit for free software development in question.\n  The Qt Company, maker of the popular dual-licensed Qt toolkit, is currently trading around €20 per share at NASDAQ Helsinki.\n Germany KDE developer  Olaf Schmidt-Wischhöfer, who works at the  European Association of Development Research and Training Institutes when he is not volunteering for the KDE community, has published a  very worrisome message about the relationship between the  Qt Company (QT Group Oyj,  QTCOM, currently trading at €19.90) and the KDE community on the KDE community mailing list.\n The  Qt Company has so far released Qt under a dual-license model where  free software users and developers have been able to use the toolkit for free under the GNU GPL while  commercial developers of immoral proprietary software have been required to license the toolkit under a commercial license. The possibility of  Qt Company pulling the rug on the free software community by ending this dual-license model has been a real concern for quite some time. This threat become very real when the  Qt Company announced that Qt Long Term Support releases would be restricted to paying license holders back in January 2020.\n The KDE foundation, in its infinite wisdom, cemented the special relationship between Qt and the  free software community  in an written agreement years ago. This agreement  requires the  Qt Company to keep releasing &#34;All parts of Qt (..) under the GPLv3 or under a compatible license&#34;. That&#39;s nice, but there  is a loophole:\n &#34;If these license terms are not yet present at the time of the Qt release, then they must be applied within a timeframe of not more than 12 months. &#34;\n It appears that the  Qt Company are hell-bent in exploiting this loophole to the fullest extent possible by closing off both LTS versions and development versions of Qt for 12 months from their release. That move poses huge problems for both the KDE community and the parts of the  free software community who utilize the Qt toolkit in general. Let&#39;s say that a huge gaping security hole in Qt, which affects KDE or other free Qt-based software, is found. It would be very unfortunate if  free software users would have to remain vulnerable for a full year before they could have access to a newer version with a fix.\n The 12 month restriction would, in principle, not make Qt proprietary software, but it might as well be proprietary from a practical point of view.\n  Those who use KDE or Qt based software may want to read the entire message titled &#34;Qt, Open Source and corona&#34; from  Olaf Schmidt-Wischhöfer on the KDE community mailing list:\n the relationship between the KDE community, the Qt project and The Qt Company has always been close and beneficial for all three.\n The Qt Company benefits from having a large and healthy community of contributors, developers and experts around their product.\n  The Qt project benefits from having the company as a steward and very large contributor, and having KDE as a large and well-known sub-community.\n   Fortunately, the KDE Free Qt Foundation exists, which secures the continued existence of Open Source Qt: https://kde.org/community/whatiskde/kdefreeqtfoundation.phpTogether with Martin Konold, I represent KDE in the board of the foundation.\n  During the past two years, there have been negotiations between The Qt Company and the KDE Free Qt Foundation for updating the contract.\n  helping the company increase their revenue without harming the Qt project or the KDE community\n  Fixing the incompatibility between paid Qt license terms and using or contributing to Open Source (“Prohibited Combination” in  https://www.qt.io/terms-conditions/ )\n Fixing the license incompatibility between the Qt Design Studio (which is only partly Free Software) and our existing contract with the company\n Making our contract with the company stronger, requiring them to make immediate Free Software releases of Qt (currently, they are allowed to delay by 12 months) to ensure the availability of LTS security fixes for KDE\n  Evaluating contract changes suggested by the company aimed at making the Qt business more profitable, for example the option of selling bundles of Qt with other software, or making integrations with proprietary third-party software possible\n One setback in the negotiations has been an announcement of The Qt Company in January:  https://www.qt.io/blog/qt-offering-changes-2020They announced that LTS releases of Qt will only be available for paid license holders. It is still unclear what this implies for contributions to Qt and for the sharing of security fixes between the various parties (including The Qt Company, the many Qt experts contributing, the KDE community, and Linux distributions).\n At an in-person meeting in Frankfurt on March 6, we nevertheless managed to lay the groundwork for a possible path forward, continuing with an approach beneficial to all sides.\n But last week,  the company suddenly informed both the KDE e.V. board and the KDE Free QT Foundation that the economic outlook caused by the Corona virus puts more pressure on them to increase short-term revenue. As a result, they are thinking about restricting ALL Qt releases to paid license holders for the first 12 months. They are aware that this would mean the end of contributions via Open Governance in practice.\n Obviously, it cannot be in the middle- and long-term health of The Qt Company to separate itself from the very strong Qt + KDE communities.\n We hope The Qt Company will reconsider. However, this threat to the Open Source community needs to be anticipated, so that the Qt and KDE communities can prepare themselves.\n The Qt Company says that they are willing to reconsider the approach only if we offer them concessions in other areas. I am reminded, however, of the situation half a year ago. We had discussed an approach for contract updates, which they suddenly threw away by restricting LTS releases of Qt instead.\n What does this mean for the future of Qt and for the future of KDE?\n All software changes in Qt will still be available at as Open Source as required by our contract – maybe with a delay of 12 months if the company decides to part ways with the communities.\n We will continue to work on a contract update that helps all sides. But even if these negotiations were to be unilaterally stopped by The Qt Company, Qt will stay Open Source, and KDE will be able to use it. I am also absolutely sure that the Qt + KDE communities will continue cooperation on new features, bug fixes, and security fixes, even should The Qt Company decide to forgo the benefits of cooperation.\n The Swedish KDE contributor and FOSS enthusiast  Jens Reuterberg has this to say about the Qt Company in a reply on the KDE Community mailing list on April 8th:\n &#34; The fact that they want to burn the field and still think they can harvest come spring is to me ridiculous and seems to be done by someone who has no understanding of the process of work involved in their own project on the technical or social level. &#34;\n Krita developer  Boudewijn Rempt had this to say about the  free software community&#39;s options going forward:\n &#34;If we work together with other participants in the Qt community, then it might be feasible. In fact, I think it&#39;s necessary to start bringing together a group of stakeholders and start preparing for a fork. &#34;\n We do hope that the Qt company will reconsider and allow both development versions and LTS versions of Qt to be licensed under the GNU GPLv3 from day one. However, we are not convinced that using Qt is a good idea even if they do: The  Qt Company has shown that they are  not trustworthy. They lost massive amounts of face when they broke the spirit of their agreement with the  free software community by restricting LTS releases to commercial users back in January. They lost additional face when they dishonored and disgraced themselves by sending a message to the KDE e.V. board and the KDE Free Qt Foundation saying that they will likely restrict all versions of Qt to commercial users for 12 months from their release. They have now put themselves in a position they can not get out of in any even remotely honorable way. The Qt Company would lose additional face if they back-pedal and show that they are weaker than a bunch of hippies in a non-profit foundation and they would lose massive amounts of face and dishonor themselves on a grand scale if they break the spirit of their agreement with the  free software community by restricting Qt releases to a proprietary license for the first 12 months. There is no honorable face-saving way out of this. Thus;  free software developers, and users, should seriously question and consider whether they want to have anything to do with the  Qt Company and their products going forward.\n Update: The Qt Company released this rushed and rather vague statement in their blog on April 9th: &#34;There have been discussions on various internet forums about the future of Qt open source in the last two days. The contents do not reflect the views or plans of The Qt Company.\n The Qt Company is proud to be committed to its customers, open source, and the Qt governance model. &#34;\n It would appear that the public backlash has made the Qt Company leadership seriously reconsider the wisdom of immensely angering the entire free software community.\n  This article is not truthful. The Qt Company has a good and healthy relationship with KDE and active co-operation with the KDE representatives of the KDE Free Qt Foundation (a non-profit foundation with purpose of ensuring Qt&#39;s long-term success). We are also actively working via the Qt Project&#39;s open governance to develop Qt forward together with the open-source community.\n  The article seems to truthfully report what Olaf Schmidt-Wischhöfer wrote publicly. Which is based on alleged **private communication** from Qt Company. NOT the public statement Qt made in January on their blog.\n &gt; But **last week**, the company suddenly informed both the KDE e.V. board and the&gt; KDE Free QT Foundation that the economic outlook caused by the Corona virus&gt; puts more pressure on them to increase short-term revenue. As a result, they&gt; are thinking about restricting ALL Qt releases to paid license holders for the&gt; first 12 months. They are aware that this would mean the end of contributions&gt; via Open Governance in practice.\nDo you have good reason to doubt his representation? If yes, please be more specific. Seems to me personally that Qt Company is just backpedalling due to the backlash, but of course I could be wrong.\n      this is pretty terrible news. i can understand why GTK has been the most dominant toolkit now. which is unfortunate since gnome has really gone the ways of being a dictator on linux. seems like the toolkit situation on linux right now isn&#39;t in a good situation.\n    dude freezing Qt to version 5.2 or whatever is fine with me. anything is better than th Gnome GUI which sucks harder than 20 years of covid19.\n  a number of projects tried to make big money on the cheap by being vague about their freedom. Quite disgusting strategy. First act as anti-Gates the saviour, then rip off people once they&#39;re hooked. such a disgrace.\n    dude if Qt Corp. goes bancrupt from Covid19 , KDE e.V. can buy it for 1 €. problem solved.\n  If Qt Company ever fails to release the latest Qt withing 12 months, KDE is entitled (by mutual agreement both sides signed) to demand release of the entire Qt under any free license (like BSD or MIT or others). Which would mean the end for Qt Company, because current licensing (LGPL) allows them to make money when clients need to modify Qt and do not want to release the code, but with BSD/MIT license they would be allowed to do this even without a commercial license from Qt Company.\n LinuxReviews welcomes  all comments. If you do not want to be anonymous,  register or  log in. It is free.", "posttime": "2020-06-01 15:20:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,qt", "title": "Qt可以成为专有的，KDE关系和基于Qt的自由软件在Jeopardy", "title_en": "Qt Could Go Proprietary, KDE Relationship and Qt-Based Free Software in Jeopardy", "transed": 1, "url": "https://linuxreviews.org/Qt_Could_Go_Proprietary,_KDE_Relationship_And_Qt-Based_Free_Software_In_Jeopardy", "via": "", "real_tags": ["软件", "qt"]}, {"category": "", "categoryclass": "", "imagename": "b94e8e7c8ed90533261a5a8bb7e236d5.jpg", "infoid": 1004625, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在泥盆纪-石炭纪交界处(3.59亿年前)有一次无法解释的陆地大灭绝。在格陵兰岛东部发现的畸形陆地植物孢子表明，物种灭绝与UV-B辐射增加是一致的，表明臭氧层减少。水星通过灭绝级别的数据证明，与其他大规模灭绝不同的是，没有行星规模的火山喷发。重要的是，泥盆纪-石炭纪交界处的陆地大规模灭绝与一次重大的气候变暖相吻合，这场气候变暖结束了最新泥盆纪冰期的强烈末期冰川循环。快速变暖期间臭氧层减少的一个机制是增加了ClO的对流输送。因此，快速变暖过程中的臭氧损失是地球系统固有的过程，不可避免的结论是，在未来变暖的世界中，我们应该对这种可能发生的事件保持警惕。\n泥盆纪末期的大灭绝[或3.59亿年前的汉根堡危机(1)]现在被列为一级大灭绝(2，3)。这次灭绝是一场多重生物危机，与黑色页岩和缺氧有关的海洋灭绝的早期主要阶段(2)与陆地鱼类大规模灭绝(4)和陆生植物的同时灭绝(5)相隔了大约30万年(Ka)(1)。关于花粉和孢子，陆地上的灭绝清楚地表现为泥盆纪-石炭纪(D-C)界线上的多样性完全丧失(6，7)，至少有四个主导孢子组合的主要孢子群灭绝(7)。灭绝后即刻的VI孢子组合以其简单性著称(6)，恢复的植被以小型的简单陆地植物为主。因此，这一事件是一次重大的生态系统破坏，包括结构化森林社区的崩溃(8)。\n在这里，我们报道了格陵兰岛东部陆地D-C边界剖面的一个断面(图1)，它全部包含了灭绝级别。其中一段含有丰富的植物孢子和孢子四分体，具有畸形的雕刻和着色的壁面，这一点是独一无二的。这些畸形与暴露于高水平的紫外线-B(UV-B)是完全一致的，紫外线-B在保护孢粉蛋白壁形成之前破坏了DNA。这表明全球保护性臭氧层暂时丧失。\n在东格陵兰岛，D-C边界是一个2到4米厚的区间，有两个永久性的湖泊，可以沿着75公里长的横断面从远端和深部到近端的浅水环境追踪(图1)。这些湖泊最厚、最远的部分在StensiöBjerg(图1和图2)。S1)。下湖包括一段0.5m厚的泥盆纪末期泥岩[Retispora liidophyta-Verrucosiporites nitidus(LN)过渡孢子带(10)，这里标记为LN*]。在该带上方，有一个0.8米厚的区间，通过该区间，床中点的总有机碳含量(TOC重量%；表S1)逐渐增加到相当异常的最大值21%。然而，高有机质含量的后果是，当TOC%增加到2%以上(图1)时，无定形有机质(AOM)占优势，孢子恢复丧失。孢子只在上游湖中再次发现，但作为极早石炭纪的低多样性后灭绝的VI孢子组合(6，7)。\n160m厚的Stensiöbjerg组的孢子组合。S2~S4)湖泊以下多样性较低(主要为Retispora、鳞藻门和硅藻门)。随着下游湖泊的形成，古环境变得越来越湿润，孢子多样性也随之显著增加，形成了LN*带。然而，随着湖泊的进一步发育，孢子多样性急剧下降，主要孢子群灭绝。S3和S4)，以前在中泥盆世和晚泥盆世是多样的、分布广泛的和范围很长的。这包括在最近的法门纪中实现了全球分布的鳞藻门，所有不同的具有分叉尖端的番茄脚类孢子群(如Ancyropora)，以及Dducites spp，这是形成泥盆纪森林的林下层的Rhacophyton(11)的孢子体，而Diducites spp是形成泥盆纪森林的林下层的Rhacophyton(11)的孢子。\n我们从摄氏度Bjerg上的D-C边界区间收集的数据(图2，表S2和图2)。使我们能够将这些孢子灭绝与巨型孢子的记录联系起来，因为树木大小的植物茎在这个更近的部分丰富。这些树干代表了上游森林中植物残渣的下游堆积。我们的数据表明，这些大的茎在D-C界线上突然完全消失，而在图尔奈期，即早石炭世的前7 Ma(12)，仍然没有消失。这标志着主要森林树冠的坍塌，并与透辉石的灭绝相吻合。然而，\n许多标本，包括四分体和分离的孢子，都是棕色的(图3，H到J和W)。这与直接来自上下岩层的黄橙色孢子颜色(图3，A到C和N到P)所显示的低热成熟度水平形成了对比，镜质体反射率为0.7%(表S3)证实了这个值，相当于最高埋藏温度为107°C。这些在下湖的颜色变化是在每个样本的50个单个角棉样本(图3B和表S3)上测量的，表明平均半透明度从底部的50%逐渐下降。\n这些独特的角藻标本将注意力集中在下游湖内的其他孢子上，这些孢子在检查时也显示出无处不在的畸形。图4显示了孢子Verrucosiporites nitidus，另一个跨越D-C边界的知名物种(16)。边界下面(图4，A到C)和上面(图4，N到P)，这些孢子颜色苍白，有一个形状良好的疣状雕塑。在较低的湖泊内，两栖弧菌表现出从典型到异常的连续的形态范围。然而，大多数拥有结构良好的雕塑的标本都是棕色的。少数人脸色苍白，直径较小，雕塑没有完全成型，元素间距不规则，大小不均匀。似乎在孢子壁发育过程中，产生这种色素沉着的孢子也获得了一定程度的保护。在下湖孢粉组合的其余部分追踪畸形更加困难，因为这个简单的孢子组合中的大多数物种都没有刺，壁面光滑。其中许多在东格陵兰岛和其他地方也是深棕色的，并且在整个VI孢子带都是如此。然而，在所研究的所有三个部分的上游湖泊中都没有明显的畸形孢子，表明破坏的原因已经停止。\n孢子和花粉壁中的畸形在活体花粉(9，17)和化石花粉(9，18)中都有很好的记录，并且是由于DNA[通常是相对碱基对的融合(19)]的破坏造成的，这种损伤发生在保护孢粉蛋白壁层沉积之前。于是花粉就不能复制墙面雕塑的错综复杂和规律性的图案。这种DNA损伤可以通过暴露在UV-B辐射(17)和大气污染物(20)的实验中产生。化石的例子包括二叠纪-三叠纪(9，18，21，22)和三叠纪-侏罗纪(23)的大规模灭绝，那里的针叶花粉和孢子四分体都显示出畸形，通常被解释为来自大火成岩省(LIP)喷发的火山气体的直接影响。然而，在对活的针叶树进行实验之后(9)，这被重新解释为二叠纪-三叠纪的大规模灭绝是由于随着UV-B通量的增加，火山气体最初破坏了臭氧层，然后破坏了花粉和孢子DNA。相比之下，来自三叠纪-侏罗纪的研究则归因于唇部发疹过程中产生的汞(Hg)的遗传毒性效应。\n深色孢子在二叠纪-三叠纪(22)和三叠纪-侏罗纪(23)大规模灭绝级别也有报道。虽然因果关系仍未得到证实，但孢子壁和花粉壁天然地呈黄色，以提供对UV-B的保护，因此任何额外的不透明都会增加这种保护。\n从其它D-C边界区段中已知(26)畸形孢子。一项重要的记录来自波兰(26)，它位于D-C边界(LN孢子带)的正下方，其中包括许多畸形的瓦拉蒂孢子岩标本和孢子四分体。然而，畸形孢子和四分体在波兰都很少见，只有一个样本的四分体含量超过3%，这是裸子植物花粉正常群体的背景突变水平(18)。此外，只有(26)个可用的VI孢子带样本(只包含保存不佳的孢子)与Rebild Bakker的畸形孢子同龄。这些来自波兰的畸形被归因于火山喷发的影响。另一个记录来自比利时(27)，在那里，与LN孢子带相同年龄的畸形孢子被归因于冷却/干旱。同样，比利时剖面与波兰一样，在最早的石炭纪VI带，也就是最大变形发生在东格陵兰岛的时候，没有发现孢子。\n我们对畸形花粉和孢子的记录告诉我们，在大规模灭绝期间起作用的杀死机制是UV-B升高的一段时间，这与保护臭氧层的丧失有关。弗拉斯-法门期(晚泥盆世)、二叠纪末期和三叠纪-侏罗纪大灭绝的致死机制是一种崩塌。\n关于火山气体局部喷发造成DNA损伤的可能性，目前在格陵兰岛东部还没有已知的火山岩产状，最接近的年龄(38岁)大约早于13 Ma。关于空气中的污染物，例如，现代冶炼厂的花粉畸形证据(20)表明，浓度必须非常高才能产生任何影响。因此，这种影响也可以被认为是一种畸形机制，因为穿过D-C边界区间和整个盆地的沉积剖面(38)没有包含异常的沉积物，这些沉积物表明异常的化学派生的气载呼气。\n理解D-C边界臭氧层丧失的关键观测是畸形孢子与下部湖泊完全重合。此外，这些畸形孢子的比例和变暗程度系统地增加到湖床的中点。位于D-C界线的两个湖泊横向分布广泛(38个)(至少50000 km2)，TOC含量异常高，代表了具有分层水柱的长期深湖系统。在D-C边界存在的两个湖泊横向延伸(38)(至少50000 km2)，TOC含量异常高，代表了具有分层水柱的长期深湖体系。这些湖泊的存在与东格陵兰泥盆纪至早石炭世7 km和60 Ma的旱地河流和风沙沉积的正常模式形成了鲜明的对比。这种普遍的干旱与其所处的位置(39)完全一致，无论是在旧红砂岩大陆的内部(距海约1000公里)，还是在南部干旱带的15°古口。只有当持续的季节性降雨量足以维持常年站立的淡水湖时，才能形成这样的大型湖泊。从许多第四纪(40)和深层例子(41，42)可以很好地理解将所需的季节性降雨强度带入这样一个干旱地带大陆内陆的机制。其过程是，大陆内陆夏季的高温导致正常环流的逆转。这种反转吸引了潮湿的空气，然后上升并冷却，产生了强烈的季节性季风。在这些模型中，湖泊是温度最高的，从它们通常干旱的大陆内部位置来看，代表了异常和持续的变暖事件。这将孢子畸形的最大程度置于下湖的中点，与最高温度一致。这种升温与嘴唇在实际喷发期间(即畸形发生时)造成的降温形成对比。与LIP相关的冷却是大气中高水平的火山灰和SO2双重影响的直接结果(3)，并进一步证明在D-C边界没有行星尺度的火山活动。\n最大畸形与气候最大值的重合使我们现在开始寻找温度升高导致臭氧损失的机制。来自美国大陆的综合现代观测和模拟数据(43)提供了这样一种臭氧去除机制，观察到中纬度夏季温度上升，导致向平流层低层对流注入的水蒸气增加。这种增加的高海拔水含量然后超过增加催化活性ClO的产生的阈值(43)，从而增加臭氧损失率。\n正反馈机制在晚泥盆世和早石炭世也可能起作用，因为那里有广阔的陆架海，有大量的碳埋藏(2，44)，因此有机生产力也很高。甲基卤素是由广泛的有机体自然产生的(45)；因此，任何有机生产力的提高最终都会增加供应。臭氧的逐渐丧失和破坏性UV-B的增加将导致观察到的泥盆纪森林环境及其结构性群落的崩溃。随之而来的更高的径流速率将产生一次性的营养物质流入陆架海，从而增加甲基卤素的生产。只有当气温从湖泊循环的顶峰下降时，这一过程才会放缓，从而使臭氧层得以重建。从Stensiöbjerg湖沉积中异常高的TOC间隔的厚度(0.8m)可以估计出持续的时间，这代表了最持久的层化和最温暖的条件。这代表了大约50%。\n..", "note_en": "There is an unexplained terrestrial mass extinction at the Devonian-Carboniferous boundary (359 million years ago). The discovery in east Greenland of malformed land plant spores demonstrates that the extinction was coincident with elevated UV-B radiation demonstrating ozone layer reduction. Mercury data through the extinction level prove that, unlike other mass extinctions, there were no planetary scale volcanic eruptions. Importantly, the Devonian-Carboniferous boundary terrestrial mass extinction was coincident with a major climatic warming that ended the intense final glacial cycle of the latest Devonian ice age. A mechanism for ozone layer reduction during rapid warming is increased convective transport of ClO. Hence, ozone loss during rapid warming is an inherent Earth system process with the unavoidable conclusion that we should be alert for such an eventuality in the future warming world.\n The end-Devonian mass extinction [or Hangenberg Crisis, 359 million years (Ma) ago (  1)] is now included (  2,   3) among the first-order mass extinctions. The extinction was a multiple biotic crisis with an early main phase of marine extinctions associated with black shales and anoxia (  2) separated by an estimated 300 thousand years (ka) (  1) from a terrestrial mass extinction of fish (  4) with coincident extinctions (  5) in land plants. Regarding pollen and spores, the terrestrial extinction is clearly expressed as the complete loss of diversity (  6,   7) across the Devonian-Carboniferous (D-C) boundary with the extinction of at least four major spore groups that had dominated the spore assemblage (  7). The immediate post-extinction VI spore assemblage was remarkable for its simplicity (  6) with the recovery vegetation dominated by small simple land plants. Hence, the event was a major ecosystem disruption that included the collapse of the structured forest community (  8).\n Here, we report on a transect ( Fig. 1) of terrestrial D-C boundary sections from East Greenland that all include the extinction level. One section is unique in containing abundant plant spores and spore tetrads with malformed sculpture and pigmented walls. These malformations are entirely consistent (  9) with exposure to elevated levels of ultraviolet-B (UV-B) that damaged the DNA before the formation of their protective sporopollenin walls. This indicates the temporary loss of the global protective ozone layer.\n In East Greenland, the D-C boundary is a 2- to 4-m-thick interval with two permanent lakes that can be traced ( Fig. 1) along a 75-km-long transect from distal and deep to proximal shallow water environments. The thickest, most distal section of these lakes is on Stensiö Bjerg ( Fig. 1 and fig. S1). The lower lake includes a 0.5-m-thick interval of mudstone of very latest Devonian age [ Retispora lepidophyta - Verrucosisporites nitidus (LN) transitional spore zone (  10), here labeled as LN*]. Above this zone, there is a 0.8-m-thick interval through which the total organic carbon content (TOC weight %; table S1) progressively increases to the quite exceptional maximum of 21% in the midpoint of the bed. However, a consequence of the high organic matter content is that, as TOC% increased above 2% ( Fig. 1), amorphous organic matter (AOM) dominates and spore recovery is lost. Spores are only found again in the upper lake, but as the low diversity post-extinction VI spore assemblage (  6,   7) of very earliest Carboniferous age.\n The spore assemblage in the 160-m-thick Stensiö Bjerg Formation (figs. S2 to S4) below the lakes is of low diversity (largely  Retispora lepidophyta and  Diducites spp). As the lower lake started to form, the paleoenvironment became wetter and more humid, and with it, the spore diversity strikingly increased, which defines the LN* zone. However, as the lake further developed, spore diversity sharply declined with extinctions of major spore groups (figs. S3 and S4) that were formerly diverse, widely distributed, and long ranging through the Mid and Late Devonian. These include  R. lepidophyta that had achieved a global distribution in the latest Famennian, all of the diverse group of lycopod spores with bifurcate tips (e.g.,  Ancyrospora), and  Diducites spp, which is the spore of  Rhacophyton (  11) that formed the understory layer to the Devonian forests.\n The data that we have collected from the D-C boundary interval on Celsius Bjerg ( Fig. 2, table S2, and fig. S5) enable us to link these spore extinctions to the megafossil record, as tree-sized plant stems are abundant in this more proximal section. These stems represent the downstream accumulation of plant debris from forests present upstream. Our data show that these large stems suddenly and entirely disappear exactly at the D-C boundary and remained absent for the Tournaisian, i.e., the first 7 Ma (  12) of the early Carboniferous. This marks the collapse of the main forest canopy and was coincident with the extinction of  Diducites. However, many of the plant groups that formed these first forests reappeared later and had survived as scattered remnants (  13). On Celsius Bjerg, we can also recognize the sedimentological response to this collapse (fig. S6), as the fluvial sandstones above the boundary were deposited by more active larger-scale systems that reflected increased sediment transport in the absence of a structured terrestrial vegetation community.\n  The missing spore record from the lower lake on Stensiö Bjerg was found at Rebild Bakker (  14) ( Fig. 1 and table S3). Here, the two boundary lakes occur within fluvial sandstones and immediately above palynologically dated latest Devonian sediments. The 50-cm-thick lower lake contains no AOM, and five samples from its lower part contain well-preserved, low thermal maturity spores. All the spores that became extinct at the D-C boundary are absent apart from a single specimen of  R. lepidophyta at 9 cm above the base. The top of the Devonian is picked at this and the corresponding level at Stensiö Bjerg. This shows that the missing 0.8-m AOM-rich interval from Stensiö Bjerg was earliest Carboniferous in age.\n The spores from this marginal lake environment are morphologically more diverse. They include  Grandispora cornuta that has long spines that demonstrate a number of unique and highly atypical malformations ( Fig. 3 and figs. S7 and S8) and that reveal the unusual conditions that drove the terrestrial extinctions.  G. cornuta is well known in other D-C boundary sections (  6,   15) and normal specimens ( Fig. 3, D and E) had two wall layers, with the outer wall covered with near-identical long spines (15 to 30 in number) that are regularly spaced, similar in length, and taper evenly to pointed tips.  G. cornuta also have regular circular spots between each inter-ray of the trilete mark, an unusual feature for spores from the D-C boundary interval, which enables it to be uniquely identified even as fragmentary malformed specimens. At Rebild Bakker, malformed specimens of  G. cornuta are the majority ( Fig. 3, F to W) and increase upward in relative abundance through the lower lake from 71 to 95% ( Fig. 3A). The commonest malformation is that the spines become both irregularly spaced (e.g.,  Fig. 3, F, H, and J) and reduced in number, sometimes to as few as five. These spines show a variety of malformed tips that are not evenly pointed, but instead variously became blunt, irregular-shaped crooks, sinuously elongate, or fused together. In other specimens, the sculpture is coalesced and entwined as residual stumps ( Fig. 3, K, N, and P) or elongated with crook ends ( Fig. 3, L and S). On a few specimens, the sculpture was deposited as an irregular mass ( Fig. 3O). On rare specimens, the inner wall never formed ( Fig. 3L), whereas others ( Fig. 3Q) never developed the outer wall. The latter can occur in tetrads ( Fig. 3V), so they are not isolated inner walls from broken spores. Tetrads representing unseparated meiotic spores are common (15% maximum;  Fig. 3, A, R, and W) and show the full range of spine modifications, as shown on the isolated single spores.\n  Many of the specimens, both tetrads and isolated spores, are brown in color ( Fig. 3, H to J and W). This contrasts with the low thermal maturity level demonstrated by the yellow-orange spore colors ( Fig. 3, A to C and N to P) from the beds immediately above and below, a value confirmed by a vitrinite reflectivity of 0.7% (table S3), equivalent to a maximum burial temperature of 107°C. These color variations in the lower lake were measured on 50 single specimens of  G. cornuta from each sample ( Fig. 3B and table S3) and show that the average translucency declined progressively from 50% at the base of the bed to 10% in the highest sample and in parallel with the increase in proportion of malformed specimens.\n These distinctive specimens of  G. cornuta focus attention on other spores within the lower lake that, on examination, also display pervasive malformations.  Figure 4 shows the spore  Verrucosisporites nitidus, another well-known species (  16) that crosses the D-C boundary. Both below ( Fig. 4, A to C) and above ( Fig. 4, N to P) the boundary, these spores are pale in color and with a well-formed sculpture of verrucae. Within the lower lake,  V. nitidus shows a continuous range of morphologies from typical to aberrant forms. However, most specimens that have a well-formed sculpture are brown in color. A minority are pale, smaller in diameter, and with a sculpture that did not fully form, the elements being irregularly spaced and uneven in size. It would appear that spores that developed this pigmentation also acquired a degree of protection during spore wall development. It is more difficult to track malformation in the remainder of the lower lake palynological assemblage, as most of the species in this simple spore assemblage lack spines and have smooth walls. Many of these, in East Greenland and elsewhere, are also dark brown in color and remain so through the entirety of the VI spore zone. However, obvious malformed spores are absent from the upper lake in all three sections that were studied, showing that the cause of the damage has ceased.\n  Malformations in spore and pollen walls are well documented in both living (  9,   17) and fossil pollen (  9,   18) and result from damage to the DNA [typically fusion of opposing base pairs (  19)] that occurs before deposition of the protective sporopollenin wall layer. The pollen are then unable to replicate the intricate and regular pattern of the wall sculpture. Such DNA damage can be produced experimentally by exposure to UV-B radiation (  17) and atmospheric pollutants (  20). Examples from fossil material include the Permo-Triassic (  9,   18,   21,   22) and Triassic-Jurassic (  23) mass extinctions, where both conifer pollen and spore tetrads show malformation that have generally been interpreted as the direct effect of volcanic gases from large igneous province (LIP) eruptions. However, following experiments with living conifers (  9), this has been reinterpreted for the Permo-Triassic mass extinction as the initial destruction of the ozone layer by volcanic gases with the increased UV-B flux and then damaging the pollen and spore DNA. In contrast, that from the Triassic-Jurassic has been attributed (  24) to the genotoxic effects of mercury (Hg) generated during LIP eruptions.\n Dark-colored spores are also reported from the Permo-Triassic (  22) and Triassic-Jurassic (  23) mass extinction levels. Although cause and effect remain unproven, spore and pollen walls are naturally pigmented yellow to provide protection (  25) against UV-B so any additional opacity increases this protection.\n Malformed spores are known (  26) from other D-C boundary sections. An important record is from Poland (  26) immediately below the D-C boundary (LN spore zone) that includes many malformed specimens of  Vallatisporites together with spore tetrads. However, both malformed spores and tetrads are rare in Poland, with only a single sample containing tetrads above 3% that is the background mutation level (  18) within normal population of gymnosperm pollen. In addition, there (  26) was only a single available VI spore zone sample (and that contained only poorly preserved spores) that is coeval with the malformed spores from Rebild Bakker. These malformations from Poland were attributed (  26) to the effects of volcanic eruptions. Another record is from Belgium (  27), where malformed spores of equivalent age to the LN spore zone were attributed to cooling/aridity. Again, the Belgian section in common with Poland had no spore recovery in the earliest Carboniferous VI zone that was when the maximum malformation occurred in East Greenland.\n Our record of malformed pollen and spores informs us that the kill mechanism acting during the mass extinction was an interval of elevated UV-B related to the loss of the protective ozone layer. The kill mechanism inferred for the Frasnian-Famennian (Late Devonian), end Permian, and Triassic-Jurassic mass extinctions is a collapse of the Earth system linked to known LIPs, which are also evidenced (  28,   29) by Hg anomalies. In contrast, compiled records (  26,   29,   30) of igneous activity for the D-C boundary show nothing that approached the planetary scale of a LIP eruption.\n To test the LIP hypothesis [and as advocated in (  31)], we analyzed Hg through the Stensiö Bjerg, Celsius Bjerg, and Rebild Bakker D-C boundary sections. The results ( Fig. 1, tables S1 and S3, and fig. S9) show a number of clear peaks from Stensiö Bjerg. However, when the Hg values are normalized against TOC, the peak coincident with the AOM-rich, high-TOC interval disappears. Hg and TOC analyses ( Fig. 1 and fig. S9) from the correlative Rebild Bakker samples (that lack AOM) only reach a maximum of 7 parts per billion (ppb) and 0.3%, respectively. When normalized as Hg/TOC, the values range from 14 to 26, similar to those from Stensiö Bjerg. Therefore, there is no Hg anomaly coincident with the malformed spores, i.e., at exactly the extinction level. Hg is well known (  32) to be readily absorbed from lake waters by AOM. Hence, a high content simply reflects high AOM absorbing the available Hg. The remaining Hg/TOC peaks at Stensiö Bjerg ( Fig. 1) are coincident with the shifts between carbonate and organic matter–dominated sediments. Hg is also known (  32) to become more concentrated in lake waters that lack organic matter. This then becomes available in excess to become absorbed onto any subsequent AOM produced. These, the first records of Hg through a terrestrial D-C boundary section, in common with marine records from China (  33), the Czech Republic (  33), and Vietnam (  31), have yet to demonstrate convincing evidence (  28) for a LIP.\n A second mechanism to explain an ozone collapse would be the widely repeated hypothesis (  34) of reduced atmospheric  PO 2 (partial pressure of oxygen) across the D-C boundary. This, if correct, would lead to a reduced level of ozone. However, this hypothesis can be refuted as the boundary bed ( Fig. 3C and table S5), and the entire Devonian and Carboniferous section in East Greenland and elsewhere (  35) contains abundant highly reflective dispersed charcoal with reflectivities over 2% and hence of unequivocal wildfire origin. This, in common with a recently updated atmospheric oxygen modeling curve (  36), shows that  PO 2 was in excess of 16.5% (  37).\n Regarding the likelihood of DNA damage from local eruptions of volcanic gases, there are no known occurrences of volcanic rocks at this time in east Greenland, the closest in age (  38) being some 13 Ma earlier. With regard to airborne pollutants, the evidence (  20) from pollen malformation at, for example, modern smelter sites shows that concentrations have to be very high to have any effect. So, this effect can also be discounted as a malformation mechanism because the sedimentary sections (  38) through the D-C boundary interval, and throughout the basin, contains no unusual sediments that are indicative of abnormal chemically derived airborne exhalatives.\n The key observation to understanding the loss of the D-C boundary ozone layer is that the malformed spores occur exactly coincident with the lower lake. In addition, the proportion of these malformed spores and their degree of darkening systematically increases to the midpoint of the lake bed. The pair of lakes present at the D-C boundary was laterally extensive (  38) (at least 50,000 km 2), with exceptionally high TOC contents, and represents long-lived deep lacustrine systems with a stratified water column. The presence of these lakes is in stark contrast to the normal pattern of dryland fluvial and aeolian sedimentary deposition through the 7 km and 60 Ma of the Devonian to early Carboniferous succession in East Greenland. This prevailing aridity is entirely consistent with its location (  39), both in the interior of the Old Red Sandstone Continent (some 1000 km from the sea) and at 15° paleosouth in the southern arid zone. Such large lakes can only form when there is sustained seasonal rainfall sufficient to maintain a perennial standing body of fresh water. The mechanisms that bring the required intensity of seasonal rainfall into such an arid zone continental interior are well understood from many Quaternary (  40) and deep-time examples (  41,   42). The process is that high summer temperatures in the continental interior cause a reversal of the normal circulation. This reversal draws in moisture-laden air, which then rises and cools to produces an intense seasonal monsoon. In these models, the lakes were thermal highs and, from their normally arid continental interior locations, represent episodes of exceptional and sustained warming. This places the maximum degree of spore malformation at the midpoint of the lower lake coincident with the thermal maximum. This warming is in contrast to the cooling that a LIP causes during the actual eruption, i.e., when the malformation would occur. LIP-related cooling is the direct result (  3) of the dual impact of high levels of both ash and SO 2 in the atmosphere and further evidence for the absence of planetary scale volcanism at the D-C boundary.\n The coincidence of maximum malformation with the climatic maximum now leads us to look for a mechanism for ozone loss driven by increasing temperature. Combined modern observation and modeling data (  43) from the continental United States provide such an ozone removal mechanism with an observed increase in mid-latitude summer temperature, leading to an increase in the convective injection of water vapor into the lower stratosphere. This increased high-altitude water content then passes the threshold (  43) for an increased production of catalytically active ClO with ensuing increased rate of ozone loss.\n A positive feedback mechanism could also be at play in the Late Devonian and early Carboniferous, as there were extensive shelf seas with high volumes of carbon burial (  2,   44) and hence high organic productivity. Methyl halogens are produced naturally by a wide range of organisms (  45); hence, any increased organic productivity ultimately increased supply. Progressive ozone loss and increased influx of damaging UV-B would have led to the observed collapse of the Devonian forest environment together with its structured community. The resultant higher rates of runoff would then produce a one-time nutrient flush into the shelf seas and hence increased production of methyl halogens. The process only slowed when temperatures fell from the peak of the lacustrine cycle, allowing the ozone layer to reestablish. A time duration can be estimated from the thickness (0.8 m) of the exceptionally high TOC interval in the lake deposit at Stensiö Bjerg that represents the most persistent stratification and warmest conditions. It represents about 50% \n......", "posttime": "2020-06-01 14:47:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "辐射,radiation,孢子", "title": "UVB辐射是泥盆纪-石炭系灭绝的致死机制", "title_en": "UVB radiation was the Devonian-Carboniferous extinction kill mechanism", "transed": 1, "url": "https://advances.sciencemag.org/content/6/22/eaba0768", "via": "", "real_tags": ["辐射", "radiation", "孢子"]}, {"category": "", "categoryclass": "", "imagename": "4ef103a5666dcd289c4f4fccb49a97f1.png", "infoid": 1004623, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Solid是用于创建用户界面的声明性Javascript库。它不使用虚拟DOM。相反，它选择将模板编译为实际的DOM节点，并将更新包装在细粒度的反应中。这样，当您的状态仅更新依赖于它的代码时，就会运行。\n快地!。性能与优化的、令人痛苦的、命令式的普通DOM代码几乎没有区别。请参阅关于JS框架基准的实体。\n支持JSX、片段、上下文、门户、悬念、SSR、错误边界和异步渲染等现代功能。\n从&#34；solid-js/dom&#34；；const HelloMessage=props=&gt；&lt；div&gt；Hello{pros.name}&lt；/div&gt；；Render(()=&gt；&lt；HelloMessage name=&#34；Taylor&#34；/&gt；，document导入{Render}。getElementById(&#34；hello-Example&#34；)；\n简单的组件只是一个接受属性的函数。Solid使用呈现函数来创建应用程序的反应式挂载点。\n从&#34；solid-js/dom&#34；；const_tmpl$=template(`&lt；div&gt；Hello&lt；/div&gt；`)；const HelloMessage=props=&gt；{const_el$=_tmpl$]导入{Render，Template，Insert，createComponent}。cloneNode(True)；插入(_el$，()=&gt；道具。name，null)；return_el$；}；Render(()=&gt；createComponent(HelloMessage，{name：&#34；Taylor&#34；})，document。getElementById(&#34；hello-Example&#34；)；\n那个_el$是一个真正的div元素，pros.name(在本例中是Taylor)被附加到它的子节点。注意，pros.name包装在一个函数中。这是因为这是该组件中将再次执行的唯一部分。即使名称从外部更新，也只会重新计算该表达式。编译器优化初始呈现，运行时优化更新。这是两全其美的。\n或者，您可以在自己的项目中安装依赖项。要将实体与JSX一起使用(推荐)，请运行以下命令：\nSolid的渲染由DOM表达式库完成。这个库为像Solid这样的细粒度库提供了一个通用的优化运行时，可以使用许多不同的渲染API。最佳选择是将JSX预编译与Babel插件JSX DOM表达式结合使用，以提供最小的代码大小、最干净的语法和最高性能的代码。编译器将JSX转换为本机DOM元素指令，并在反应计算中包装动态表达式。\n最简单的设置方法是将babel-preset-solid添加到您的.babelrc中，或将Babel配置添加到webpack，或ROLLUP：\n请记住，即使语法几乎相同，Solid的JSX和Reaction这样的库的工作方式也有很大的不同。有关更多信息，请参阅JSX呈现。\n或者，在非编译环境中，您可以使用标记模板文字、LIT DOM表达式，甚至将HyperScript与Hyper DOM表达式一起使用。\nSolid的数据管理建立在一组灵活的反应性原语之上。类似于Reaction Hooks，不同的是，它们独立地负责所有的更新，而不是将拥有的组件的更改列入白名单。\n固态原语可以说是它最强大和最独特的原语。通过使用代理和显式设置器，它提供了对不可变接口的控制和可变接口的性能。setter支持多种形式，但要开始使用对象设置和更新状态。\n从&#34；Solid-js&#34；导入{createState，onCleanup}；const CountingComponent=()=&gt；{const[state，setState]=createState({count：0})；const间隔=setInterval(()=&gt；setState({count：stat.。计数器+1})，1000)；onCleanup(()=&gt；clearInterval(Interval))；return&lt；div&gt；{stat.。计数器}&lt；/div&gt；；}；\nconst[state，setState]=createState({user：{firstName：&#34；jack&#34；，lastName：&#34；smith&#34；}})createEffect(()=&gt；setState({displayName：`${state.。用户。FirstName}${state。用户。lastName}`})；控制台。日志(状态。displayName)；//杰克·史密斯setState(&#39；用户&#39；，{FirstName：&#34；Jacob&#34；})；控制台。日志(状态。DisplayName)；//雅各布·史密斯\n每当任何依赖项更改时，State值都会立即更新。每个setState语句将与应用的所有更改同步通知订阅方。这意味着您可以依赖于在下一行上设置的值。\nSolid State还公开了与setState一起使用的协调方法，该方法进行深度差异，以允许与Redux、Apollo(GraphQL)或RxJS等不变存储技术自动有效地交互。\n并查看下面的文档、示例和文章以更熟悉Solid。\n细致入微地思考：SolidJS的性能为何如此出色？从头到尾看看是什么让SolidJS如此快速。\nSolid与JavaScript框架的RealWorld演示比较Solid在更大的应用程序中表现如何？\n设计SolidJS：JSX为什么虚拟DOM诞生的语法也是反应式UI库的最佳语法呢？\n设计SolidJS：不变性反应性状态管理是否既是不可变的，又是性能最好的？\n我们如何编写最快的JavaScript UI框架，多么坚实，超过了JS框架基准。\nUI组件的实际成本不同UI库中组件的成本比较。\n渲染所有实体渲染器与世界上最快的库的DOM比较的最快方法。\nSolid在其V1.0.0版本中功能基本齐全。下一个版本将主要是在稳定的道路上进行错误修复和API调整。", "note_en": "Solid is a declarative Javascript library for creating user interfaces. It does not use a Virtual DOM. Instead it opts to compile its templates down to real DOM nodes and wrap updates in fine grained reactions. This way when your state updates only the code that depends on it runs.\n  Fast! Almost indistinguishable performance vs optimized painfully imperative vanilla DOM code. See Solid on  JS Framework Benchmark.\n  Supports modern features like JSX, Fragments, Context, Portals, Suspense, SSR, Error Boundaries and Asynchronous Rendering.\n  import {  render }  from   &#34;solid-js/dom &#34;; const  HelloMessage  =  props  =&gt; &lt;div&gt;Hello {props.name}&lt;/div&gt;; render( ()  =&gt; &lt;HelloMessage name=&#34;Taylor&#34; /&gt;,  document . getElementById(  &#34;hello-example &#34;));\n A Simple Component is just a function that accepts properties. Solid uses a  render function to create the reactive mount point of your application.\n  import  {  render ,  template ,  insert ,  createComponent  }  from  &#34;solid-js/dom&#34; ; const  _tmpl$  =  template ( `&lt;div&gt;Hello &lt;/div&gt;` ) ; const  HelloMessage  =  props  =&gt;  {  const  _el$  =  _tmpl$ . cloneNode ( true ) ;  insert ( _el$ ,  ( )  =&gt;  props . name , null ) ;  return  _el$ ; } ; render (  ( )  =&gt;  createComponent ( HelloMessage ,  {  name:  &#34;Taylor&#34;  } ) ,  document . getElementById ( &#34;hello-example&#34; ) ) ;\n That  _el$ is a real div element and  props.name,  Taylor in this case, is appended to it&#39;s child nodes. Notice that  props.name is wrapped in a function. That is because that is the only part of this component that will ever execute again. Even if a name is updated from the outside only that one expression will be re-evaluated. The compiler optimizes initial render and the runtime optimizes updates. It&#39;s the best of both worlds.\n      Or you can install the dependencies in your own project. To use Solid with JSX (recommended) run:\n   Solid&#39;s rendering is done by the  DOM Expressions library. This library provides a generic optimized runtime for fine grained libraries like Solid with the opportunity to use a number of different Rendering APIs. The best option is to use JSX pre-compilation with  Babel Plugin JSX DOM Expressions to give the smallest code size, cleanest syntax, and most performant code. The compiler converts JSX to native DOM element instructions and wraps dynamic expressions in reactive computations.\n The easiest way to get setup is add  babel-preset-solid to your .babelrc, or babel config for webpack, or rollup:\n  Remember even though the syntax is almost identical, there are significant differences between how Solid&#39;s JSX works and a library like React. Refer to  JSX Rendering for more information.\n Alternatively in non-compiled environments you can use Tagged Template Literals  Lit DOM Expressions or even HyperScript with  Hyper DOM Expressions.\n     Solid&#39;s data management is built off a set of flexible reactive primitives. Similar to React Hooks except instead of whitelisting change for an owning Component they independentally are soley responsible for all the updates.\n Solid&#39;s State primitive is arguably its most powerful and distinctive one. Through the use of proxies and explicit setters it gives the control of an immutable interface and the performance of a mutable one. The setters support a variety of forms, but to get started set and update state with an object.\n import {  createState,  onCleanup }  from   &#34;solid-js &#34;; const  CountingComponent  = ()  =&gt; {  const [ state,  setState]  =  createState({   counter:  0 });  const  interval  =  setInterval( ()  =&gt;  setState({   counter:   state . counter  +  1 }),  1000 );  onCleanup(()  =&gt;  clearInterval( interval));  return &lt; div&gt; {  state . counter }&lt;/ div&gt;;};\n  const  [ state ,  setState ]  =  createState ( {  user:  {  firstName:  &#34;Jake&#34; ,  lastName:  &#34;Smith&#34;  } } ) createEffect ( ( )  =&gt;  setState ( {  displayName:  `  ${ state . user . firstName }   ${ state . user . lastName }`  } ) ) ; console . log ( state . displayName ) ;  // Jake Smith setState ( &#39;user&#39; ,  { firstName:  &#34;Jacob&#34;  } ) ; console . log ( state . displayName ) ;  // Jacob Smith\n Whenever any dependency changes the State value will update immediately. Each  setState statement will notify subscribers synchronously with all changes applied. This means you can depend on the value being set on the next line.\n Solid State also exposes a reconcile method used with  setState that does deep diffing to allow for automatic efficient interopt with immutable store technologies like Redux, Apollo(GraphQL), or RxJS.\n     And check out the Documentation, Examples, and Articles below to get more familiar with Solid.\n        Thinking Granular: How is SolidJS so Performant? An end to end look at what makes SolidJS so fast.\n A Solid RealWorld Demo Comparison of JavaScript Frameworks How does Solid perform in a larger application?\n   Designing SolidJS: JSX How is it that the syntax born of the Virtual DOM is also secretly the best syntax for Reactive UI libraries?\n Designing SolidJS: Immutability Can Reactive State Management be both Immutable and also the most performant?\n    How we wrote the Fastest JavaScript UI Frameworks How Solid topped the JS Framework Benchmark.\n  The Real Cost of UI Components Comparison of the cost of Components in different UI Libraries.\n The Fastest Way to Render the DOM Comparison of all Solid Renderers against the Fastest Libraries in the World.\n  Solid is mostly feature complete for its v1.0.0 release. The next releases will be mostly bug fixes API tweaks on the road to stability.", "posttime": "2020-06-01 13:40:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,javascript,用于,declarative,dom", "title": "Solid-用于构建用户界面的声明性JavaScript库", "title_en": "Solid – A declarative JavaScript library for building user interfaces", "transed": 1, "url": "https://github.com/ryansolid/solid", "via": "", "real_tags": ["java", "用于", "dom"]}, {"category": "", "categoryclass": "", "imagename": "705cf26cac7d9545aef22998556ddb9e.jpg", "infoid": 1004622, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周末，针对警察杀害乔治·弗洛伊德(George Floyd)和美国历史上无数其他人的抗议活动继续在全国范围内蔓延，警方的回应是如此残酷，甚至连阿拉尼斯·莫里塞特(Alanis Morissette)都可以看到这种讽刺。\n示威者、记者，甚至坐在家里门廊上的人在社交媒体上发布的视频显示，军事化的警察似乎急于在街头实施暴力，而不是帮助平息暴力。\n在明尼阿波利斯，在前警官德里克·肖文(Derek Chauvin)跪在乔治·弗洛伊德(George Floyd)的脖子上超过8分钟后，日益高涨的抗议活动开始了，警察不仅向示威者发射催泪瓦斯、橡皮子弹和颜料罐，而且还向在家观察的平民发射催泪瓦斯、橡皮子弹和颜料罐：\n昨日发布在社交媒体上的视频捕捉到了纽约警察局警察驾车撞向一群抗议者的画面，这让人想起2017年夏洛茨维尔发生的悲剧画面，当时一名白人至上主义者撞上了一群反对种族暴力的示威人群，并杀害了希瑟·海耶(Heather Heyer)。\n另一段视频显示，纽约警察局的一名警官拉下了一名黑人抗议者的口罩，这名抗议者举起了双手，胡椒直接喷到了他的脸上：\n媒体成员在履行报道抗议活动的职责时，也继续遭到警察的枪击和其他攻击。\nCNN记者奥马尔·吉米内斯(Omar Jiminez)本周早些时候在直播中被明尼阿波利斯警察逮捕，他继续报道街道上的反乌托邦场景，据报道，明尼苏达州公共安全部表示，部署警察是为了“解决复杂的城市战争网络”。\n警察的目标是阻止“城市战争”，还是继续对他们应该保护和服务的人发动战争？\n与此同时，美国总统继续向警方和全国各地的其他人发出他自己对暴力的嗜血的信号。\n周六，他在Twitter上发帖称，如果白宫的抗议者接近冲破围栏，“他们将受到最恶毒的狗和最不祥的武器的迎接”。\n“许多特勤局特工都在等待行动。特朗普在推特上写道：“我们把年轻人放在第一线，先生，他们喜欢这样。”\n据“独立报”报道，明尼阿波利斯警察工会负责人鲍勃·克罗尔中尉去年在特朗普的一次集会上发表讲话，庆祝总统允许警察残暴。\n这位中尉上台时穿着一件红色的“支持特朗普的警察”衬衫，抨击奥巴马政府所谓的“卑鄙”对待警察的方式，并补充道：“特朗普总统上任后做的第一件事就是扭转…的颓势。他决定开始让警察做他们的工作，给罪犯戴上手铐，而不是我们。“", "note_en": "The blaze of protests that continue to spread across the country this weekend in response to the police killing of George Floyd and countless others throughout American history is being responded to by policing so brutal even Alanis Morissette could clock the irony.\n  Videos posted on social media by demonstrators, journalists, and even people sitting on their porches at home show militarized police officers who appear eager to enact violence on the streets rather than help quell it.\n In Minneapolis, where the Fed Up-Rising protests started after former police officer Derek Chauvin kneeled on the neck of George Floyd for more than 8 minutes, cops have not only been firing tear gas, rubber bullets, and paint canisters at demonstrators but also on civilians observing from home:\n   Videos posted on social media yesterday captured New York Police Department officers driving into a crowd of protestors, reminiscent of the tragic images from Charlottesville in 2017 where a white supremacist ran into a crowd of people demonstrating against racial violence and killed Heather Heyer.\n    Another video shows an NYPD officer pulling down the face mask of a black protestor, whose hands are raised, and pepper spraying him directly in the face:\n   Members of the media also continue to be shot at and otherwise targeted by police officers while doing their job reporting on the protests.\n    CNN reporter Omar Jiminez, who was arrested on-air by Minneapolis officers earlier this weekend, continued covering the dystopian scenes on the streets where   the Minnesota Department of Public Safety reportedly said cops were deployed to “address a sophisticated network of urban warfare.”\n   Are the police aiming to stop “urban warfare” or are they the ones continuing to wage it against people they are supposed to protect and serve?\n  Meanwhile, the president of the U.S. continues to signal to police and everyone else across the country his own bloodthirst for violence.\n On Saturday he posted on Twitter that protestors at the White House “would have been greeted with the most vicious dogs, and most ominous weapons,” if they had come close to breaching the fence.\n  “Many Secret Service agents just waiting for action. ‘We put the young ones on the front line, sir, they love it,” Trump tweeted.\n According to reporting from the Independent, the head of the Minneapolis Police Union Lieutenant Bob Kroll spoke at a rally for Trump last year where he celebrated the permission the president gave to cops to be brutal.\n   Donning a red “Cops for Trump” shirt as he took the stage, the lieutenant attacked the Obama administration over its alleged “despicable” treatment of police, adding: “The first thing President Trump did when he took office was turn that around … he decided to start to let cops do their job, put the handcuffs on the criminals instead of us.”", "posttime": "2020-06-01 13:22:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "全国,instigating,警察", "title": "警方在全国范围内的抗议活动中煽动暴力", "title_en": "Police Are Instigating Violence During the Nationwide Protests", "transed": 1, "url": "https://www.theroot.com/police-prove-point-of-protests-by-instigating-violence-1843797562", "via": "", "real_tags": ["全国", "警察"]}, {"category": "", "categoryclass": "", "imagename": "5c84145a8365d900d1f3b2014fcb4c0e.png", "infoid": 1004621, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "The Intercept发表了一篇报道，将现实获胜者送进了监狱，烧毁了它的第三个来源。这篇文章是由理查德·埃斯波西托(Richard Esposito)合著的，他是一名嵌入式警察记者，现在是纽约警察局的最高发言人。\n“拦截报”的一篇有争议的报道的合著者将其消息来源送进了监狱，现在他是纽约警察局新闻办公室的负责人。\n这位前记者理查德·埃斯波西托(Richard Esposito)在纽约警察局工作了很长一段时间，与美国警察机构发展了密切的关系，这种关系在拦截行动选择与他合作之前就已经很明显了。然而，新闻网站显然并不认为埃斯波西托的警察友好行为是取消资格，甚至是可疑的。\n埃斯波西托和他的老朋友兼同事马修·科尔(Matthew Cole)是2017年一份关于美国国家安全局(National Security Agency)指控俄罗斯干预2016年美国总统选举的报告的合著者。科尔是The Intercept的全职记者。这些记者向美国政府机构披露了敏感信息，这导致他们的机密消息来源、前美国国家安全局承包商真人秀获得者被曝光，并最终被判入狱五年。\n虽然这个丑闻故事是埃斯波西托在The Intercept上发表的唯一一篇文章，但不知何故，他被分配了一个公司的官方电子邮件地址和一个作者页面，后来在没有任何解释的情况下，这个页面被从网站上删除了。\n同样的二人组，埃斯波西托和科尔，在逮捕和监禁另一名消息来源中央情报局告密者约翰·基里亚库的过程中发挥了不可或缺的作用，几年后他们与拦截组织合作。\n“拦截者”焚烧消息来源的记录远远超出了真人秀获胜者的范畴。2018年，前联邦调查局特工特里·奥尔伯里(Terry Albury)被判处四年监禁，此前他向新闻网站泄露了揭露警察局普遍存在的种族主义和反穆斯林监控做法的文件。揭露FBI的报道的合著者之一科拉·柯里尔(Cora Currier)仍然是The Intercept的编辑。另一位合著者詹娜·麦克劳克林(Jenna McLaughlin)继续与CNN、外交政策(Foreign Policy)和雅虎新闻(Yahoo News)合作。\n接下来，2019年，前美国国家安全局官员丹尼尔·黑尔(Daniel Hale)被大陪审团起诉，罪名是涉嫌泄露文件，显然也是向拦截部门泄露。他将面临长达50年的监禁。\n这种令人不安的模式提出了一个严重的问题，即为什么拦截的来源理查德·埃斯波西托(Richard Esposito)和马修·科尔(Matthew Cole)不断被烧死。是记者们的粗心大意，还是美国政府机构发挥了作用？\n给“拦截”号一个严肃的问题：你是不是秘密为联邦调查局工作？大卫·黑尔，真人秀冠军和特里·奥尔伯里都因为你入狱了。是无能还是你妥协了？你欠很多人一个解释。还有一个道歉。\n由亿万富翁eBay创始人皮埃尔·奥米迪亚(Pierre Omidyar)拥有和资助的Intercept因其对爱德华·斯诺登(Edward Snowden)泄密事件的处理而受到严厉批评。该网站在可疑情况下关闭了对这位著名举报人的国安局文件宝藏的访问，此前只发布了其中的一小部分。奥米德亚是一位与美国政府支持的政权更迭网络有广泛联系的大型科技寡头，他似乎已经有效地将斯诺登的泄密事件私有化，其中绝大多数永远不会曝光。\n奥米德亚自己的观点与一位激进的公民自由主义者的观点并不完全一致。2009年，这位亿万富翁在推特上表示，科技新闻网站“TechCrunch”和任何发布被盗信息的人都应该帮助抓获窃贼。我不应该把酒吧放在第一位。“。维基解密和其他透明组织已经注意到了这一点。\n皮埃尔·奥米迪亚(Pierre Omidyar)在2009年：“任何发布被盗信息的人都应该帮助抓住窃贼”http://t.co/CoaSUoreG4。\n美国政府情报机构也在“拦截”的报告中发现了用处。早在2017年，中情局局长迈克·庞皮欧(Mike Pompeo)在对维基解密(WikiLeaks)及其现已入狱的出版商朱利安·阿桑奇(Julian Assange)进行猛烈攻击时，引用了中情局局长迈克·庞皮欧(Mike Pompeo。\n在鹰派智库战略与国际研究中心(CSIS)的一次演讲中，庞皮欧两次引用了拦截的比德尔的话，将维基解密描绘成不可靠的，并淡化其出版物的重要性。\n比德尔是截取文章的另一位合著者，这篇文章导致真人秀获胜者入狱。\n他的前同事从记者过渡到纽约警察局的公关主管，这让人进一步担心“拦截”、它的编辑判断，以及它的一些撰稿人与美国警察机构培育的关系。\n2017年6月5日，The Intercept公布了一份从美国国家安全局(National Security Agency)泄露的绝密文件，其中声称俄罗斯军事情报机构试图通过涉嫌黑客和网络钓鱼来干预2016年11月的美国大选。\n批评人士认为，这篇文章被过度炒作，缺乏确凿的证据，是由理查德·埃斯波西托(Richard Esposito)和三名全职拦截工作人员共同撰写的：马修·科尔(Matthew Cole)、萨姆·比德尔(Sam Bdle)和瑞安·格里姆(Ryan Grim)。\n就在新闻网站发布这篇报道的几分钟后，美国司法部宣布在发布前两天逮捕了被指控的泄密者。它确认她是一名情报专家和美国国家安全局承包商，名为Reality Leigh Winner。\n由于截获的粗心大意，联邦调查局很容易就能证明文件来自温纳的工作电脑，她曾用这台电脑与记者直接沟通。温纳认罪；2018年8月，她被判处五年以上监禁。\n安全专家和记者严厉批评拦截计划的草率和未能采取基本措施保护其来源。原来，与该网站合作的一名记者已经联系了NSA承包商和NSA本身，希望确认泄露文件的真实性。这位记者鲁莽地披露了联邦执法部门立即用来识别获胜者的关键信息，包括她的居住城市、情报报告编号，以及文件的物理打印输出，其中包含识别其来源的Microdot元数据信息。\n维基解密对截获行动的疏忽感到愤怒，悬赏1万美元，“悬赏10,000美元，以获得导致这名‘记者’被公开曝光和解职的信息。”\n在监狱里，Winner似乎过得不太好。她的母亲Billie Winner-Davis说，由于冠状病毒大流行而导致的监狱封锁“对她和所有囚犯都产生了最糟糕的影响”。\n我女儿#RealityWinner今天已经打了2次电话了。她不太好。监狱的封锁对她和所有囚犯造成了最坏的影响。想象一下被锁在里面，看不到尽头的情景。她被拒绝接受心理治疗。她没有吃东西。我很害怕。pic.twitter.com/bKMpqe72v5。\n灰色地带联系了Winner-Davis，让她知道帮助她女儿入狱的一名拦截记者现在是纽约警察局的一名高级官员。听到这个消息，她大吃一惊，同时也惊讶地得知，合著者理查德·埃斯波西托(Richard Esposito)和马修·科尔(Matthew Cole)在中情局泄密者约翰·基里亚库(John Kiriakou)入狱的事件中也发挥了关键作用。\n“这是非常令人震惊的，”赢家-戴维斯告诉“灰色地带”。“我知道，参与现实案件的同一批记者还揭露了另一个消息来源。我不知道那是约翰·基里亚库。“。\n温纳-戴维斯补充说：“听说埃斯波西托现在是纽约警察局的人非常令人不安，这确实让我想知道，在处理她匿名发送的信息时，他站在哪一边。”“事后看来，我也很想知道”拦截者“是否知道，以及他们的印象如何。”\n灰色地带通过电子邮件截获了一份请求置评的邮件。截至发稿时，它没有回复。\n在真人秀获胜者在监狱中受苦受难的同时，让她入狱的那篇拦截文章的四名合著者之一、前记者理查德·埃斯波西托(Richard Esposito)被提升为纽约市警察局的最高公关职位。\n埃斯波西托在成为美国最大的警察部队之前，曾在主流企业媒体工作过很长时间(前市长迈克尔·布隆伯格(Michael Bloomberg)曾吹嘘过，美国警察部队实际上是“世界第七大军队”)。埃斯波西托作为一名自称的调查记者成名，专注于犯罪和国家安全，在警察和情报机构内部拥有一系列消息来源。他在NBC新闻、ABC新闻、纽约每日新闻和纽约邮报工作了几年。\n埃斯波西托的报道在很大程度上依赖于美国国家安全州的消息来源，并倾向于服务于他们的利益。它得到了奖励，获得了五项艾美奖和一项普利策奖。\n到2020年1月，埃斯波西托宣布他已经换了一份新工作：纽约警察局负责公共信息的副局长。纽约市政府官方网站指出，埃斯波西托的办公室“与当地、国家和国际媒体组织合作”，致力于“与媒体建立牢固的关系，向记者通报情况”。\n我很荣幸地欢迎理查德·埃斯波西托来到纽约警察局，他今天下午宣誓就任我们警察局的首席发言人：@NYPDDCPI。\n前纽约警察局局长、“破窗”警务先驱比尔·布拉顿(Bill Bratton)庆祝埃斯波西托的新任命，祝贺他的“30多年的朋友”-明确表示他与这位前记者的亲密关系可以追溯到几十年前。\n很高兴在今天上午的公民犯罪委员会早餐会上见到新任命的纽约市警察局公共信息副局长理查德·埃斯波西托(@REspositoNYC)，并祝贺我交往了30多年的朋友获得任命。pic.twitter.com/U5oaIW4IM8。\n埃斯波西托在推特上发布了一张自己与纽约警察局情报和反恐主管约翰·米勒(John Miller)的照片，以纪念这一新职位。他指出，米勒也是他的“30多年的朋友”。\n这条推文特别具有象征意义，因为两人都是美国企业媒体圈和警察部门之间旋转门的教科书例子。\n和埃斯波西托一样，约翰·米勒也是一名前记者，与警察机构有着广泛的亲密关系。米勒曾担任纽约警察局的首席发言人，然后转到ABC新闻担任记者和主播(这让他来到阿富汗接受奥萨马·本·拉登(Osama Bin Laden)的采访)。米勒还曾在联邦调查局、国家情报总监办公室和洛杉矶警察局工作过，然后转到哥伦比亚广播公司新闻频道，最后又回到了纽约警察局。\n宣誓就任纽约警察局公共信息副局长。讲台上坐在我30多年的朋友约翰·米勒(John Miller)旁边，他是反恐与情报公司的华盛顿特区。当日颜色：显然是纽约警察局的蓝色pic.twitter.com/8rQYswmkMz\n这段历史提出了一个问题：埃斯波西托、他的老朋友米勒和其他经常光顾旋转门的人是真正的独立记者，还是警察的公关侧翼？而“拦截”(The Intercept)这份自称出版“无畏、敌对、追究权势人物责任的新闻”的刊物，为什么会与美国警察机构在媒体上最亲密的盟友之一合作呢？\n埃斯波西托是“拦截”记者马修·科尔的长期同事。早在2009年，两人就在ABC新闻一起工作，撰写了一些不加批判地呼应美国军方和情报官员的报道，并证明了中情局在海外的行动是合理的。\n他们的报告清楚地表明，埃斯波西托和科尔在中央情报局和其他警察和情报机构有非常高级别的消息来源。他们几乎所有的独家新闻都来自这些匿名官员，记者们倾向于避免咬牙切齿。\n2013年，当埃斯波西托转到NBC新闻领导其调查部门时，他把科尔也带来了。\n在NBC，埃斯波西托和科尔的合作产生了一系列故事，令人喘不过气来呼应匿名的美国军方和情报官员，炒作所谓的恐怖主义威胁，粉饰奥巴马政府的无人机暗杀计划。\n与美国广播公司的情况一样，埃斯波西托和科尔在NBC发表的绝大多数故事都是由美国情报官员提供给他们的。\n也就是说，直到一位名为爱德华·斯诺登(Edward Snowden)的美国国家安全局泄密者揭露了一个全球大规模监控项目，震惊了世界。\n但在2014年，他们与记者格伦·格林沃尔德(Glenn Greenwald)合作，在NBC发布了揭露英国情报机构如何监视社交媒体网站的文件。格林沃尔德可以接触到斯诺登的文件。\n格林沃尔德、埃斯波西托和科尔随后发表了一份关于英国间谍如何使用病毒、黑客和诱捕蜜罐等“肮脏伎俩”来追捕目标的报告。\n当时，格林沃尔德刚刚将拦截器送入地面。科尔随后被聘为特约调查记者，这一职位他至今仍保持不变。\n2015年，当科尔离开美国全国广播公司新闻频道(NBC News)前往The Intercept时，他在推特上写了一篇帖子，对他的前老板埃斯波西托赞不绝口，他称埃斯波西托是“我认识的最好的记者&一个伟大的朋友。”\n作为回报，埃斯波西托写道：“祝你下一章一切顺利！”\n尽管他们多年来第一次没有在同一个办公室工作，但埃斯波西托和科尔再次合作只是个时间问题。\n2016年10月，埃斯波西托离开了NBC新闻。他成立了自己的公司Roundhouse Productions，并开始从事自由职业。埃斯波西托的密友兼同事马修·科尔(Matthew Cole)似乎在2017年把他带到了拦截行动，以撰写一个让真人秀获胜者入狱五年的故事。\n事实上，这是埃斯波西托和科尔第二次焚烧他们的线人，并将他们关进监狱。早在2012年，这两人就参与了对约翰·基里亚库(John Kiriakou)的逮捕，基里亚库是一名揭露中情局酷刑的举报人-他是中情局唯一名因残酷的“强化审讯”计划而服刑的间谍机构成员。\n根据Politico 2012年的一篇报道，在ABC新闻的日子里，美国政府确认埃斯波西托和科尔是基里亚库泄露信息的记者。由于他们的疏忽，Kiriakou最终被判入狱30个月(尽管他在服刑近24个月后于2015年初获释)。\n自那以后，基里亚库明确表示，他认为科尔应该为自己在监狱里的时间负责，他说：“我是因为马修·科尔而入狱的。”\n基里亚库在推特上写道：“”拦截“的马修·科尔(Matthew Cole)烧我是为了[保全]他自己的皮。”“要不然，他为什么要向联邦调查局出卖我，在大陪审团面前指证我呢？”\n当“拦截”发表了NSA的报道，真人秀冠军被逮捕时，Kiriakou公开谴责该新闻网站，说它“应该为自己感到羞耻”。马修·科尔烧了另一个来源。这会让你的整个组织变得不值得信任。“。\n他告诉“拦截报”，“如果你是认真的，你今天就解雇马修·科尔。”\n。@theintercept应该为自己感到羞耻。马修·科尔烧了另一个来源。这会让你的整个组织变得不可信赖。\n灰色地带联系了基里亚库，告诉他埃斯波西托现在与纽约警察局合作。“读到这个，我大吃一惊。我的嘴真的张开了，“基里亚库回答说。\n基里亚库透露，当记者揭露基里亚库时，他之前担任分析师的ABC新闻实际上已经解雇了马修·科尔(Matthew Cole)。ABC新闻并不知道科尔在一边秘密与关塔那摩湾在押人员的律师合作，双重引用他的信息。Politico证实了这一点，当时报道说，科尔一直“横跨传统新闻工作和为关塔那摩在押人员代理律师收集信息之间的界限”。\n在失去在ABC的工作后，正是埃斯波西托把科尔带到了NBC。(埃斯波西托显然每年获得近100万美元的报酬，以领导那里的调查单位。)\nKiriakou补充说，在埃斯波西托背叛他并将他送进监狱之前，他实际上一直是埃斯波西托的朋友。\n基里亚库说，埃斯波西托与美国警察部队关系密切，这是众所周知的事情。基里亚库在谈到埃斯波西托时说，“他的心一直放在执法上。”“他认为自己尽可能接近成为一名警察，而不是真正成为一名警察。”\n埃斯波西托的职业生涯始于报道警察；他最好的朋友是警察；他经常与高级警官出去喝酒。基里亚库回忆说，每个认识埃斯波西托的人都知道这一点。\n基里亚库指出，埃斯波西托和科尔在安全方面都很草率，也没有保护他们的消息来源。但他表示，科尔的行为特别可疑。\n基里亚库说，他认为科尔与美国情报机构关系太近，并重申了他要求拦截局解雇他的呼吁。\n目前尚不清楚哪位记者真人秀获胜者将美国国家安全局的文件泄露给了谁。但考虑到理查德·埃斯波西托(Richard Esposito)是被邀请单独发表这篇报道的，他似乎是一个很好的候选人。\n获胜者的故事仍然在“拦截”网站上发布。然而，奇怪的是，埃斯波西托的个人资料却被从网站上删除了。\n这篇文章的其他三位合著者有The Intercept的简历，但没有Esposito。\nGrayzone搜索了Wayback Machine，发现Esposito之前在Intercept上有一个作者页面，但它被删除了。\n这很奇怪，因为每个为“拦截”撰稿的人，甚至是自由职业者，都会得到一个作者页面，上面有个人简介和一系列文章，这几乎是所有主要新闻网站的惯例。(例如，几年前，我曾为The Intercept做过几次自由撰稿人，现在仍然有一份个人简介，尽管我从未在那里担任过工作人员。)。\nEsposito不仅有一个作者页面，他还拥有一个官方的Intercept电子邮件账户：richard.esposito@theintercept.com，这一事实进一步加剧了谜团。该账号在他现已删除的作者页面上公开列出。纯粹的自由职业者无法在The Intercept获得电子邮件帐户；Esposito显然与该出版物有更深的关系。\nGrayzone联系了The Intercept，询问为什么埃斯波西托的个人资料被删除，为什么他有一封官方电子邮件，以及他与该网站的关系。拦截号没有回复。\n围绕着真人秀获胜者的泄密和“拦截”拙劣的故事，有许多警告信号和悬而未决的问题。\n早在2017年，Winner被捕后，一名前美国政府举报人立即敲响了警钟。前国务院官员彼得·范布伦揭露了伊拉克战争中的腐败行为，随后经历了一场恶毒的恐吓运动，他发表了一篇博客文章，题为“嘿，拦截，真人秀获胜者和美国国家安全局的泄密事件出了很大的问题。”\n范布伦指出，美国情报界几乎将从这起丑闻的一切中受益。他指出，温纳是一名年轻的分析师，在空军有阿富汗事务的背景，他可以接触到所谓的俄罗斯黑客行为的绝密信息，这是多么奇怪。\n范布伦还觉得奇怪的是，美国国家安全局兴高采烈地向“拦截”确认了这份文件的真实性。爱德华·斯诺登和切尔西·曼宁泄露的材料官方未经核实。但“美国国家安全局非常希望你知道这是真的，”范布伦说，他指的是获胜者的文件。在没有提供任何证据的情况下，美国国家安全局的这份单独的报告帮助助长了俄罗斯据称干预2016年美国大选的歇斯底里情绪。\n在这篇文章发表的时候，也有很多关于理查德·埃斯波西托本人的警告信号。\n虽然埃斯波西托直到2020年1月才正式加入纽约警察局，但早在那之前就有堆积如山的证据表明，他与美国警察部队的线人关系异常密切。\n埃斯波西托丝毫没有掩饰他与警察的亲密关系。事实上，他几乎是在炫耀。\n埃斯波西托花了一年的时间。\n..", "note_en": "The Intercept published a story that landed Reality Winner in prison, burning its third source. That article was co-authored by Richard Esposito, an embedded police reporter who is now the NYPD’s top spokesperson.\n   A co-author of a controversial report at The Intercept that landed its source in prison now works as the head of the New York Police Department’s press office.\n The former journalist, Richard Esposito, had embedded for a long period inside the NYPD, developing close ties to US police agencies that were clear before The Intercept chose to work with him. However, the news website apparently did not see Esposito’s cop-friendly behavior as disqualifying or even suspicious.\n Esposito and his longtime friend and colleague, Matthew Cole, a full-time reporter at The Intercept, were co-authors of a  2017 report on National Security Agency allegations of Russian meddling in the 2016 US presidential election. The reporters disclosed sensitive information to US government agencies, which led to the outing of their confidential source, former NSA contractor Reality Winner, and her eventual imprisonment for five years.\n Although this scandalous story was the only piece Esposito published at The Intercept, he was somehow assigned an official company email address as well as an author page that has since been removed from the website without explanation.\n The same duo, Esposito and Cole, played an integral role in the arrest and imprisonment of another source,  CIA whistleblower John Kiriakou, several years before they worked with The Intercept.\n  The Intercept’s record of burning sources extends well beyond Reality Winner. In 2018, former FBI agent  Terry Albury was sentenced to  four years in prison, after he leaked documents to the news website exposing the police agency’s widespread racism and anti-Muslim surveillance practices. One of the co-authors of the reports exposing the FBI, Cora Currier, remains an editor at The Intercept. The other co-author, Jenna McLaughlin, went on to work with CNN, Foreign Policy, and Yahoo News.\n Next, in 2019, former  NSA official Daniel Hale was indicted by a grand jury for allegedly leaking documents, also apparently to The Intercept. He faces up to  50 years in prison.\n The troubling pattern raises serious questions about why sources of The Intercept, Richard Esposito, and Matthew Cole keep getting burned. Is it mere carelessness on the part of the reporters, or have US government agencies played a role?\n Serious question for The Intercept: Do you secretly work for the FBI? David Hale, Reality Winner and Terry Albury are all in prison because of you. Is it incompetence or are you compromised? You owe a lot of people an explanation. And an apology.\n  The Intercept, which is owned and financed by billionaire eBay founder Pierre Omidyar, was heavily criticized for its handling of the Edward Snowden leaks. The website  shut down access to the renowned whistleblower’s trove of NSA documents under  suspicious circumstances, after publishing just a small fraction of them. Omidyar, a Big Tech oligarch with extensive  links to US government-backed regime-change networks, appears to have effectively privatized Snowden’s leaks, the vast majority of which will never see the light of day.\n Omidyar’s own views do not exactly match those of a radical civil libertarian. In 2009, the billionaire tweeted that the technology news website “TechCrunch and anybody else who pubs stolen info  should help catch the thief. Shldnt pub in the 1st place.”  WikiLeaks and other transparency organizations have taken notice.\n Pierre Omidyar in 2009: “Anybody who publishes stolen info should help catch the thief”  http://t.co/CoaSUoreG4\n  US government intelligence agencies have also found utility in The Intercept’s reporting. Back in 2017, none other than  CIA Director Mike Pompeo cited The Intercept, quoting an article by its reporter Sam Biddle, in his withering attack on WikiLeaks and its now imprisoned publisher Julian Assange.\n In a  speech at the hawkish think tank the Center for Strategic and International Studies (CSIS), Pompeo twice quoted The Intercept’s Biddle to portray WikiLeaks as unreliable and downplay the importance of its publications.\n  Biddle is another co-author of The Intercept article that resulted in Reality Winner’s imprisonment.\n His former colleague’s transition from journalist to the head of PR for the NYPD brings up further concerns about The Intercept, its editorial judgement, and the relationships some of its contributors nurtured with US police agencies.\n  On June 5, 2017, The Intercept published a top-secret document leaked from the National Security Agency, which claimed that  Russia’s military intelligence services attempted to meddle in the November 2016 US election through alleged hacking and phishing.\n The article, which critics argued was  over-hyped and  lacked firm evidence, was co-authored by Richard Esposito and three full-time The Intercept staffers: Matthew Cole, Sam Biddle, and Ryan Grim.\n Mere minutes after the news website released the story, the US Department of Justice announced that it had arrested the alleged leaker two days before publication. It identified her as an intelligence specialist and NSA contractor named Reality Leigh Winner.\n Due to the  carelessness of The Intercept, the FBI was easily able to prove the document came from Winner’s work computer, which she had used to directly communicate with the journalists. Winner pleaded guilty; in August 2018, she was sentenced to more than five years in prison.\n Security experts and journalists harshly criticized The Intercept for its sloppiness and failure to take basic measures to protect its source. It turned out that a reporter working with the website had contacted both an NSA contractor and the NSA itself in hopes of confirming the authenticity of the leaked document. The journalist recklessly  disclosed critical information that federal law enforcement immediately used to identify Winner, including her city of residence, the intelligence report number, and a physical printout of the document with microdot metadata information that identified its origin.\n In outrage at The Intercept’s negligence, WikiLeaks offered a  $10,000 reward “for information leading to the public exposure &amp; termination of this ‘reporter.&#39;”\n In prison, Winner does not appear to be faring well. Her mother, Billie Winner-Davis, has said the lockdown of the prison due to the coronavirus pandemic “is having the worst possible impact on her &amp; all inmates.”\n  My daughter  #RealityWinner called 2x already today. SHE IS NOT OK.  The lockdown of the prison is having the worst possible impact on her &amp; all inmates. Imagine being locked inside with no end in sight.  She has been denied psych treatment. She is not eating. I am scared.  pic.twitter.com/bKMpqe72v5\n  The Grayzone contacted Winner-Davis to let her know that one of The Intercept journalists that helped land her daughter in prison is now a top official at the New York Police Department. She was flabbergasted to hear the news, and was also surprised to learn that the co-authors Richard Esposito and Matthew Cole had played a key role in CIA whistleblower John Kiriakou’s imprisonment as well.\n “ That is very shocking,” Winner-Davis told The Grayzone. “ I knew that the same journalists involved in Reality’s case had also exposed another source. I was not aware that it was John Kiriakou.”\n “ Hearing that Esposito is now NYPD is very troubling and does make me wonder which side he was on during the handling of the information she sent anonymously,” Winner-Davis added. “I also would be curious to know if the Intercept knows and what their impression is, in hindsight.”\n The Grayzone emailed The Intercept with a request for comment. It did not reply as of publication.\n  While Reality Winner languished in prison, one of the four co-authors of The Intercept article that landed her behind bars, former journalist Richard Esposito, was promoted to the top communications position in the New York City Police Department.\n Esposito had a long career in mainstream corporate media before his move to the largest police force in the US (which former Mayor Michael Bloomberg once boasted is effectively “the  seventh largest army in the world“). Esposito made his name as a self-described investigative reporter focused on crime and national security, boasting an array of sources within police and intelligence agencies. He worked several for years at NBC News, ABC News, the New York Daily News, and the New York Post.\n Esposito’s reporting relied heavily on sources within the US national security state, and tended to serve their interests. And it was rewarded, with five Emmy Awards and a shared Pulitzer Prize.\n By January 2020, Esposito announced that he had moved on to a new job: the  NYPD’s deputy commissioner for public information. The official New York City government website notes that  Esposito’s office “works with local, national, and international media organizations,” and is dedicated to “building strong relationships with the media, briefing reporters.”\n It’s my honor to welcome Richard Esposito to the NYPD as he’s sworn in this afternoon as our police department’s chief spokesman:  @NYPDDCPI.\n  Former NYPD commissioner, and  “Broken Windows” policing pioneer, Bill Bratton celebrated Esposito’s new appointment, congratulating his “friend of over 30 years” – making it clear that his cozy relationship with the former reporter goes back decades.\n Nice to see newly appointed NYPD Deputy Commissioner of Public Information Richard Esposito ( @REspositoNYC) at this morning’s Citizen Crime Commission Breakfast and congratulate my friend of over 30 years on his appointment.  pic.twitter.com/U5oaIW4IM8\n  Esposito marked the new position by tweeting a photo of himself next to John Miller, the head of intelligence and counter-terror for the NYPD, whom he noted was also his “friend of more than 30 years.”\n This tweet is particularly emblematic, because both men are textbook examples of the  revolving door between US corporate media circles and police departments.\n Like Esposito,  John Miller is a former journalist with an extensive history of intimate relations with police agencies. Miller served as the NYPD’s chief spokesman, then moved to ABC News to work as a reporter and anchor (which brought him to Afghanistan for an  interview with Osama bin Laden). Miller also worked at the FBI, the office of the Director of National Intelligence, and the LAPD, before moving to CBS News, and then finally back again to the NYPD.\n Sworn in as Deputy Commissioner Public Information NYPD. On the dais next to my friend of more than 30 years: John Miller, DC of Counterterror &amp; Intell. Color of the day: apparently NYPD Blue  pic.twitter.com/8rQYswmkMz\n  This history raises the question: Are Esposito, his longtime friend Miller, and other frequenters of the revolving door actual independent journalists, or PR flacks for the cops? And why would The Intercept, a publication that markets itself as publishing “fearless, adversarial journalism that holds the powerful accountable,” collaborate with one of US police agencies’ closest allies in the media?\n   Esposito is a longtime colleague of The Intercept reporter Matthew Cole. The two worked together at ABC News as far back as  2009, filing stories that uncritically echoed US military and  intelligence officials and justify  CIA operations abroad.\n Their reports made it clear that Esposito and Cole had very  high-level sources in the  CIA and other police and intelligence agencies. Virtually all of their scoops came from these  anonymous officials, and the reporters tended to avoid biting the hand that fed them.\n When Esposito moved over to NBC News in 2013 to lead its investigative unit, he brought Cole with him.\n At NBC, the Esposito-Cole partnership produced a string of stories that breathlessly echoed anonymous US military and intelligence officials, hyping up supposed  terrorist threats and whitewashing the  Obama administration’s drone assassination program.\n As had been the case at ABC, the vast majority of stories Esposito and Cole published at NBC were fed to them by  US intelligence officials.\n That is, until an NSA whistleblower named Edward Snowden shocked the world with leaks exposing a global mass surveillance program.\n  But in 2014, they collaborated with journalist Glenn Greenwald, who had access to the Snowden files, to publish documents at NBC that exposed how British intelligence agencies were  spying on social media websites.\n Greenwald, Esposito, and Cole then followed up with a report on how  British spies used “dirty tricks” like viruses, hacking, and honey traps to go after their targets.\n   At the time, Greenwald was just getting The Intercept off the ground. Cole was subsequently brought on board as a staff investigative reporter, a position he maintains today.\n When Cole left NBC News for The Intercept in 2015, he wrote a Twitter thread  heaping praise on his former boss Esposito, whom he called “the finest reporter I’ve known &amp; a great friend.”\n Esposito returned the favor, writing, “wish you the best on this next chapter!”\n Although they weren’t working in the same office for the first time in years, it was only a matter of time until Esposito and Cole collaborated again.\n    In October 2016, Esposito left NBC News. He formed his own company, Roundhouse Productions, and began freelancing. Esposito’s close friend and colleague Matthew Cole appeared to bring him over to The Intercept in 2017 to work on the story that put Reality Winner in prison for five years.\n This was in fact the second time that Esposito and Cole had burnt their sources and landed them behind bars. Back in 2012, the duo were involved in the arrest of John Kiriakou, a whistleblower who exposed CIA torture – and who was the only member of the spy agency to serve time over the brutal “enhanced interrogation” program.\n According to a 2012 report in  Politico, Esposito and Cole were identified by the US government, during their ABC News days, as the journalists to whom Kiriakou leaked information. Due to their negligence, Kiriakou ended up in prison on a 30-month sentence (although he was released early in 2015, after serving nearly 24 months).\n Kiriakou has since made it clear that he holds Cole responsible for his time in prison, stating, “I went to  prison courtesy of Matthew Cole.”\n “Matthew Cole of The Intercept burned me to [save] his own skin,”  Kiriakou has tweeted. “Why else would he rat me out to the FBI and put a cherry on top by testifying against me before the grand jury?”\n When The Intercept published its NSA story and Reality Winner was arrested, Kiriakou publicly condemned the news website, saying it “should be ashamed of itself.  Matthew Cole burns yet another source. It makes your entire organization untrustworthy.”\n He told The Intercept, “If you’re serious, you’ll fire Matthew Cole today”\n . @theintercept should be ashamed of itself. Matthew Cole burns yet another source. It makes your entire organization untrustworthy.\n  The Grayzone reached out to Kiriakou to inform him that Esposito now works with the NYPD. “I was flabbergasted to read this. My mouth was literally hanging open,” Kiriakou responded.\n Kiriakou revealed that ABC News, where he had previously worked as an analyst, had in fact fired Matthew Cole when the reporter outed Kiriakou. ABC News had not known that Cole was secretly working with the attorneys of Guantánamo Bay detainees on the side, double-dipping his information.  Politico confirmed this, reporting at the time that Cole had been “straddling the line between traditional journalism and information gathering for lawyers representing Guantánamo detainees.”\n After he lost his job at ABC, it was Esposito that brought Cole over to NBC. (Esposito had apparently been offered nearly $1 million per year to lead the investigative unit there.)\n Kiriakou added that he had in fact been a friend of Esposito – before the journalist betrayed him and sent him to prison.\n Kiriakou said it was public knowledge that Esposito was close to US police forces. “His heart was always in law enforcement,” Kiriakou said of Esposito. “He considered himself as close to being a cop as he could without actually being a cop.”\n Esposito started his career reporting on police; his best friends were cops; and he regularly went out drinking with top police officials. Kiriakou recalled that everyone who knew Esposito knew this.\n  Kiriakou noted that both Esposito and Cole were sloppy with security, and did not protect their sources. But he said Cole’s behavior was especially suspicious.\n Kiriakou said he believes Cole is too close to US intelligence agencies, and reiterated his call for The Intercept to fire him.\n  It remains unclear which reporter Reality Winner leaked the NSA document to. But given that Richard Esposito was brought on to publish that story alone, he seems like a good candidate.\n The Winner story is still online at The Intercept. Curiously, however, Esposito’s bio has been removed from the website.\n The other three co-authors of the article have bios at The Intercept, but not Esposito.\n The Grayzone searched through the Wayback Machine and found that  Esposito previously had an author page at The Intercept, but it was removed.\n  This is strange, because everyone who contributes pieces to The Intercept, even freelancers, gets an author page with a bio and a list of articles, as is customary for virtually all major news websites. (I, for instance, freelanced a few times for The Intercept several years ago, and still have a bio, although I have never been on staff there.)\n Further compounding the mystery is the fact that Esposito did not just have an author page; he also held an official Intercept email account: richard.esposito@theintercept.com. The account was publicly listed at his now-removed author page. Mere freelancers don’t get email accounts at The Intercept; Esposito clearly had a deeper relationship with the publication.\n The Grayzone contacted The Intercept to ask why Esposito’s bio was removed, why he had an official email, and what his relationship was with the website. The Intercept did not reply.\n  There are many warning signs and unanswered questions surrounding the Reality Winner leak and The Intercept’s bungling of the story.\n Back in 2017, immediately after Winner was arrested, a former US government whistleblower rang alarm bells. Peter van Buren, an ex-State Department official who exposed corruption in the Iraq War, and subsequently endured a  vicious intimidation campaign, published a blog post titled “ Hey Intercept, Something is Very Wrong with Reality Winner and the NSA Leak.”\n Van Buren noted that the US intelligence community stood to benefit from virtually everything about the scandal. He noted how strange it was that Winner, a young analyst with a background in Afghan affairs in the Air Force, would have access to top-secret information on alleged Russian hacking.\n Van Buren also found it odd that the NSA gleefully confirmed the authenticity of the document to The Intercept. The materials leaked by Edward Snowden and Chelsea Manning are officially unverified. But the “NSA wants you to very much know it is real,” Van Buren said, referring to Winner’s document. Without providing any evidence, the lone NSA report helped feed the hysteria that Russia purportedly meddled in the 2016 US election.\n At the time of the article’s publication, there had also been many warning signs about Richard Esposito himself.\n While Esposito did not officially join the NYPD until January 2020, there was a mountain of evidence well before then that he was unusually close to his sources in US police forces.\n Esposito did nothing to conceal his cozy relationship with the cops. In fact, he practically flaunted it.\n Esposito spent a year working \n......", "posttime": "2020-06-01 13:02:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "警察局,press,拦截", "title": "纽约警察局新闻官员与人合写了Intercept Russiagate的故事，被监禁的消息来源", "title_en": "New NYPD press officer co-wrote Intercept Russiagate story, imprisoned source", "transed": 1, "url": "https://thegrayzone.com/2020/05/20/the-intercept-reality-winner-richard-esposito-nypd/#more-23792", "via": "", "real_tags": ["警察局", "press", "拦截"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004620, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个想法来自于过去：CGI。在Internet刚开始的时候，人们一直在编写一个简单的脚本，它通过STDIN(标准输入)接收传入的字节，并写入STDOUT(标准输出)。应用服务器(也称为CGI服务器)接受客户端，调用脚本，并将套接字输入/输出重定向到脚本。这里有很多细节，但这只是一个简短的解释。\n20多年后，世界开始旋转，来到了最初的阶段：无服务器函数/lambda等等，几乎是CGI，除了脚本变成了码头容器，我们需要更多的服务器来做以前一样的事情。\n所以让我们走捷径：我们有一个值得信任的开发人员(我们自己，公司员工-意味着它不是武断的客户端)，所以我们不需要对应用程序进行严格的限制，所以让我们丢弃docker和另一个笨重的员工。\n因为我想写一些小的处理程序，99%的时间里什么都不做。我已经在为最便宜的数字海洋付费了(感谢你们的存在)，我不想额外付钱给像谷歌/亚马逊/Azure这样的Lambda提供商。\n我也尝试过基于k3s的自托管解决方案，但它对于1 GB服务器来说太重了(是的，我不相信市场营销)。\n所以，因为我是开发商，所以我决定自己做轮子；-)。\n如果函数包含Makefile和已安装的make，则可以通过UI/API调用目标(称为操作)。用于安装依赖项或生成。\n每个函数至少包含一个URL：&lt；基本URL&gt；/a/&lt；UID&gt；和任意数量的唯一别名/链接&lt；基本URL&gt；/l/&lt；链接名称&gt；。\n链接对于创建公共链接和在实际实现(函数)之间动态迁移非常有用。例如：您用Python语言制作了一个GitHub钩子处理器，然后改变主意，改用PHP函数。您可以只更改一个链接，而不是更新GitHub repo中的链接(如果您将其散布到任何地方，这可能会很麻烦)。", "note_en": "The idea came from the past: CGI. At the beginning of the Internet, people have been making a simple script that receives incoming bytes over STDIN (standard input) and writes to STDOUT (standard output). The application server (aka CGI server), accepts clients,invokes scripts and redirects socket input/output to the script. There are a lot of details here but this is a brief explanation.\n After more than 20 years the world spin around and arrived at the beginning: serverless functions/lambda and so on.It is almost CGI, except scripts became docker containers, and we need many more servers to do the same things as before.\n So let’s cut the corners a bit: we have a trusted developer (our self, company workers - means it’s not arbitrary clients), so we don’t need a heavy restriction for the application, so let’s throw away docker and another heavy staff.\n      Because I want to write small handlers that will be 99% of the time just do nothing. I am already paying for the cheapestDigital Ocean (thanks guys for your existence) and do not want to pay additionally to Lambda providers like Google/Amazon/Azure.\n I also tried self-hosted solutions based on k3s but it too heavy for 1GB server (yep, it is, don’t believe in marketing).\n So, ‘cause I am a developer I decided to make my own wheels ;-)\n   If function contains Makefile and installed make, it is possible to invoke targets over UI/API (called Actions). Usefulfor installing dependencies or building.\n  Each function contains at least one URL:  &lt;base URL&gt;/a/&lt;UID&gt; and any number of unique aliases/links  &lt;base URL&gt;/l/&lt;LINK NAME&gt;.\n Links are useful to make a public links and dynamically migrate between real implementations (functions). For ex:you made a GitHub hook processor in Python language, than changed your mind and switched to PHP function. Instead of updating link in GitHub repo (that could be a hassle if you spread it everywhere) you can change just a link.", "posttime": "2020-06-01 12:46:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "cgi,服务器", "title": "重新考虑将CGI作为自托管的lambda服务器", "title_en": "Rethinking of CGI as a selfhosted lambda server", "transed": 1, "url": "https://trusted-cgi.reddec.net/", "via": "", "real_tags": ["cgi", "服务器"]}, {"category": "", "categoryclass": "", "imagename": "c6769ed49efeebc705027864e7002082.jpg", "infoid": 1004619, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然NASA及其各承包商的成就总体上令相对较新的公司黯然失色，当然应该受到庆祝，但需要指出的是，有人的个人财富处于危险之中的情况相当罕见。通常情况下，政府机构会发布招标书，潜在的承包商通常会在早期阶段投入大量非公司资金，如果他们没有被选中，几乎永远不会继续下去。新来者更多地(当然不是完全)按照“建造它，他们会来”的心态运作。他们这样做不仅仅是为了获得合同，也是因为创始人对太空极客的热情。碰巧的是，他们有财力比几乎任何一位单独的收薪工程师做出更大的贡献(这并不是在贬低他们)，同时又不完全受制于某些机构的需求。这在设计和试验方面提供了相当大的回旋余地，这是大多数承包商[明智地]避免的风险。不，这些公司并不是太空技术和探索的全部，但他们也取得了值得与其他伟人一起庆祝的成就。", "note_en": "While the accomplishments of NASA and its various contractors overall eclipse those of the relative newcomers and certainly should be celebrated, a point to be made is that it’s quite uncommon for someone’s personal fortune been on the line. Generally a government agency releases a RFP, and prospective contractors typically invest a non-company ruining amount of funding in those early stages, and pretty much never continue if they’re not down selected. The newcomers operate more along the lines (but of course not entirely) on the “build it and they will come” mentality. They do this not merely to secure contracts, but because of the founder’s space geek passion. It just so happens that they have the financial means to make greater contributions than pretty much any singular salary-collecting engineer (that’s not being disparaging), while not being entirely beholden to some agency’s needs. This gives quite a bit of leeway in terms of design and experimentation, which are risks most contractors [wisely] avoid. No, these companies aren’t the be-all-end-all of space technology and exploration, but they’ve also had accomplishments worth celebrating along with the other greats.", "posttime": "2020-06-01 12:43:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "太空,来自,space,机构", "title": "如果这是你来自太空的灵感，那你就做错了", "title_en": "If This Is Your Inspiration from Space, You’re Doing It Wrong", "transed": 1, "url": "https://hackaday.com/2020/05/31/if-this-is-your-inspiration-from-space-youre-doing-it-wrong/", "via": "", "real_tags": ["太空", "来自", "space", "机构"]}]