[{"category": "", "categoryclass": "", "imagename": "40090e0a53d6b14f88721bbaa76ed226.jpg", "infoid": 1001525, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Microsoft正在为Office 365和Exchange Online推出新的全部回复保护功能。它的设计是为了防止电子邮件风暴(回复所有启示录)，即在某人忘记将所有人都密件抄送或通讯组列表配置错误后，成百上千的人开始回复某个电子邮件线程。\n新的拦截功能将主要受益于大型组织，最初将推出检测10封回复所有电子邮件的功能，所有电子邮件都在60分钟内发送给5000多名收件人。微软的Exchange传输团队解释说：“随着时间的推移，随着我们收集使用情况遥测和客户反馈，我们希望对回复所有风暴防护功能进行调整、微调和增强，使其对更广泛的Office 365客户更有价值。”\n回复-所有的电子邮件风暴都是一个影响大大小小的企业的问题，并且已经发生了几十年。微软早在1997年就发生了一起臭名昭著的事件，员工们亲切地将其称为疯人院DL3。大约有25,000人在通讯组列表上，并不断回复这条帖子，产生了15,000,000封电子邮件和195 GB的数据。这起事件使微软自己的Exchange邮件服务器不堪重负，该公司在Exchange中推出了邮件收件人限制，试图解决未来的问题。\n尽管如此，微软仍在遭受回复所有电子邮件的风暴。去年，GitHub的一份通知引发了数千名微软员工的电子邮件风暴。早在3月份，数以千计的微软员工也收到了回复-所有的电子邮件帖子都在30分钟内被迅速关闭。\n微软新的所有回复电子邮件拦截功能在自动触发后将保留四个小时，足以阻止人们问“为什么我会在这个电子邮件帖子上？”成百上千次。这项新功能似乎适用于微软自己的员工。“不管为哪家公司工作，人类的行为仍然像人类一样，”Exchange团队说。“我们已经看到该功能的第一个版本成功地降低了微软内部的”回复-所有风暴“(Reply-All Storms)的影响。”", "note_en": "Microsoft is rolling out a new reply-all protection feature for Office 365 and Exchange Online. It’s designed to prevent email storms (reply allpocalypse), when hundreds or thousands of people start replying to an email thread after someone forgot to BCC everyone or a distribution list was misconfigured.\n The new block feature will mostly benefit large organizations, and is initially being rolled out to detect 10 reply-all emails to over 5,000 recipients within 60 minutes. “Over time, as we gather usage telemetry and customer feedback, we expect to tweak, fine-tune, and enhance the Reply All Storm Protection feature to make it even more valuable to a broader range of Office 365 customers,”  explains Microsoft’s Exchange transport team.\n   Reply-all email storms are a problem that affect businesses large and small, and have been occurring for decades. Microsoft had its own infamous incident back in 1997, which employees fondly refer to as  Bedlam DL3. Around 25,000 people were on a distribution list and kept replying to the thread, generating 15,000,000 email messages and 195 gigabytes of data. The incident overwhelmed Microsoft’s own Exchange mail servers, and the company rolled out a message recipient limit in Exchange to try and tackle future problems.\n Microsoft still suffers from reply-all email storms, though. Last year a GitHub notification triggered an email storm for thousands of Microsoft employees. Back in March, thousands of Microsoft employees were also caught in a reply-all email thread that was quickly shut down within 30 minutes.\n Microsoft’s new reply-all email block feature will stay in place for four hours after it’s automatically triggered, enough time to stop people from asking “why am I on this email thread?” hundreds of times. The new feature appears to be working for Microsoft’s own employees. “Humans still behave like humans no matter which company they work for,” says the Exchange team. “We’re already seeing the first version of the feature successfully reduce the impact of reply-all storms within Microsoft.”", "posttime": "2020-05-10 23:08:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,微软,阻止,blocks,回复", "title": "微软现在阻止回复所有电子邮件风暴，以结束我们的收件箱噩梦", "title_en": "Microsoft now blocks reply-all email storms to end our inbox nightmares", "transed": 1, "url": "https://www.theverge.com/2020/5/10/21253627/microsoft-reply-all-email-block-reply-allpocalypse-storm", "via": "", "real_tags": ["microsoft", "微软", "阻止", "blocks", "回复"]}, {"category": "", "categoryclass": "", "imagename": "c5e07a95bf2b5c3d117407ec95ab4854.jpg", "infoid": 1001523, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "帖子浏览量为1715次。MS飞行模拟器2020 VS现实生活", "note_en": "Post with 1715 views. MS Flight Simulator 2020 vs Real life", "posttime": "2020-05-10 22:37:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "飞行,flight", "title": "MS飞行模拟器与真实生活", "title_en": "MS Flight Simulator vs. Real Life", "transed": 1, "url": "https://m.imgur.com/a/hdWw4ds", "via": "", "real_tags": ["飞行", "flight"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001522, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "POPL过去是从周一到周三中午的事情。科马克·弗拉纳根(Cormac Flanagan)在那里发表了他未来的论文(关于如何消除隐含触摸操作的静态分析；还有臭名昭著的费莱森-瓦德勒(Felleisen-Wadler)论文)。星期三晚上，科马克和我要飞回休斯顿。在返回的航班上，科马克问了一个看似简单的问题：\n我们整个航班都在从不同的角度讨论这个问题。我帮助我儿子的代数老师的经历，以及几年前帮我做代数作业的简陋保姆的经历，把我推向了“代数是函数式编程，我们可以通过让数学活起来，就能产生巨大的不同”的方向。我们到达的时间很晚，当我回家的时候，我发了一封电子邮件，说我们明天早上要开会。\n我们都在科基·卡特赖特的办公室见面，因为它比我的大。我宣布，我想把理论抛在脑后，建立一门课程，一种编程语言，并支持使用函数式编程在K-12学校教授代数、更多的数学和编程。\n施里拉姆当场接受了这个想法。“我一直想参与这样的项目。”布鲁斯很高兴有机会设计一种新的语言。科马克明确表示他会帮忙，但他真的很想辞职。马修很安静。科基后来驳斥了这个想法。“确保当它失败时，你还有回来的路。”\n我们讨论了很长一段时间，得出了两个结论：博士生需要专注于学位论文的软件问题，以防我们失败。布鲁斯和我会专注于语言和课程。\n布鲁斯和我开始设计一种叫做Jam的语言。它被认为是简单的，方案式的，没有括号，因为我们相信老师不会喜欢括号符号。同时，我们确信语法应该基本上是“插入式简单的”。但最重要的是，我们希望在这种语言中有类似图像的部分，以便求和、积分、索引等看起来尽可能像数学教科书。\n同时，我们所有人都在讨论，我们将使用Scheme来构建这个软件生态系统。\n几周后，我发现马修在这个周末开始“拼凑埃德先生”。我肯定他用的不是“鹅卵石”，而是接近的东西。而且可能比这个周末多花了一点时间。我非常确定的是，第一次按键受孕可能发生在那一天(与我对马太福音的理解交叉产生了我的记忆)。\n我不记得不同的会议了。也许这是我第二次提出当前的用户界面-Emacs和命令行-是学生们最大的障碍。\n无论如何，我开始着手建立一个用户友好的环境。当时看来，主要的问题是构建一个可以处理现代实体(如图片和活动对象)的GUI文本编辑器。我选择dwxWindows作为起点，因为它似乎是最有前途的跨平台GUI库，选择libschema作为SchemeImplementation，因为它很容易嵌入。我认为文本编辑器最难的部分是让它运行得足够快，所以我用C++编写了这一部分。\n这个节目被称为“艾德先生”，因为它主要是一名编辑。名字“ed”已经被取走了。在前面加一个字母得到的单词中，无论出于什么原因，只有“red”是有吸引力的，但这个名字也被采用了(作为“受限ed”)。再加一个字母就到了“mred”。我喜欢“先生”这个词，也不介意它已经是会说话的马的名字了。\n尽管编辑器核心是用C++编写的，但我至少从小组那里了解到或有足够的指导，以便在环境的其余实现中致力于Scheme。因此，libschema不仅成为运行学生程序的工具，而且成为实现GUI本身的语言。为了实现这一点，我开始更改libschema：添加支持扩展OFC++类的内置对象系统，将编译添加到AST而不是直接解释S表达式，等等。几个月后，我对实现的这一部分有了足够的关注，可以将其作为单独的部分。我称它为Ms Scheme&34；，但自从Ms&34；似乎把它拼写为&#34；MzScheme&34；时，似乎太过强烈地暗示了&#34；microsoft&#34；的意思，所以我把它命名为&#34；Ms Scheme&34；，但因为它似乎太过强烈地暗示了&#34；Microsoft&#34；。(大约在2001年，我们开始使用伞形名称PLT Scheme，并且不再为子系统使用可爱的名称。PLT计划在2010年成为&#34；球拍。)。\n这就是为什么在gui-lib包中，HISTORY.txt最早的条目是“Version 0.7：1995年5月10日”，而在HISTORY.txt中，球拍集合中最早的条目是“Verion 0.27：1995年9月26日”。编辑排在第一位，语言有点像是事后才想到的。\n当然，语言很快就主导了这个想法-如果不是日常工作的话，几年来的主要工作仍然是让跨平台的GUI和绘图工具包运行良好。鉴于该语言已成为该项目的主线，即使在1995年，也很容易看到本应是一个更好起点的呼应。但是结果还不错。\n到了95年夏天，我已经设计了现在所知的设计收据的基本原理和几天的教材。我们聘请了四名教师和科基的一名博士生，通过为期一周的研讨会来测试这一材料。\n在这一周里，马修演示了一个基于埃德先生的初级IDE。我印象深刻，在四位参与者身上试用了Ed先生，图片简单，应有尽有。虽然没有成功，但我们让前四位无辜的用户试用了我们的第一个教学环境。", "note_en": "POPL used to be a Monday-through-Wednesday-noon affair. Cormac Flanaganpresented his  future paper there (a static analysis on how toeliminate implicit touch operations; there was also the infamousFelleisen-Wadler paper). Wednesday night, Cormac and I were flying backto Houston. On this flight back Cormac asked a seemingly simplequestion:\n  We spent the entire flight discussing this from various angles. Myexperience with helping my son’s algebra teacher and, years earlier, ababy sitter with algebra homework, pushed me in the direction of“algebra is functional programming and we can make a huge differenceby bringing math alive.” We arrived late in the evening, and when I gothome, I sent email that we’d have a meeting next morning.\n  We all met in Corky Cartwright’s office because it was bigger thanmine. I announced that I wanted to leave theory behind and build acurriculum, a programming language, and support software to usefunctional programming for teaching algebra, more math, andprogramming in K-12 schools.\n Shriram embraced the idea on the spot. “I have always wanted to beinvolved in such a project.” Bruce loved the chance to design a newlanguage. Cormac made clear he’d help but he really wanted adissertation. Matthew was quiet. Corky later dismissed the idea. “Makesure you have path back when it fails.”\n We discussed for quite a while and came to two conclusions: the PhDstudents needed to focus on software issues for dissertations in casewe’d fail. Bruce and I would focus on the language and thecurriculum.\n  Bruce and I started designing a language called Jam. It was supposedto be simple, Scheme-ish, and without parentheses because we wereconvinced that teachers would not like the parenthetical notation. Atthe same time, we were sure that the syntax should be  basically“parenthetically simple.” But most importantly, we wanted to haveimage-like parts in this language so that Sum, Integral, Indexing, andso on would look as much as possible like the math text books.\n In parallel, all of us discussed that we’d use Scheme to build thissoftware ecosystem.\n  A few weeks later I found out that over this weekend Matthew hadstarted to “cobbled together MrEd.” I am sure he didn’t use“cobble” but something close. And it probably took a bit more thanthis weekend. What I am pretty sure about is that the first keystrokes of conception probably took place on that day(cross-producting my memory with my understanding of Matthew).\n  I don’t remember the different meetings. Maybe it was the secondmeeting where I suggested the current user interface—  Emacs and thecommand line—  was the biggest obstacle for students.\n In any case, I set out to build a user-friendly environment. The mainproblem, it seemed at the time, was to build a GUI text editor thatcould handle modern entities like pictures and live objects. I pickedwxWindows as a starting point, because it seemed like the mostpromising cross-platform GUI library, and libscheme as the Schemeimplementation, because it was easy to embed. I figuredthat the hard part of a text editor was making it run fast enough, so Iwrote that part in C++.\n The program was called “MrEd” because it was mostly an editor. Thename “ed” was already taken. Among the words you get by adding a letterto the front, only “red” was appealing for whatever reason, but thatname was also taken (as “restricted ed”). Adding one more letter arrivedat “mred.” I liked the “Mr” part and didn’t mind that it was alreadythe name of a talking horse.\n Although the editor core was in C++, I at least knew enough or hadenough direction from the group to aim for Scheme for the rest of theenvironment’s implementation. So, libscheme became not only the vehiclefor running student programs, but also the language for implementingmuch of the GUI itself. To make that practical, I started changinglibscheme: adding a built-in object system that supports extension ofC++ classes, adding compilation to an AST instead of interpretingS-expressions directly, and so on. After a few months, I becameattached enough to this part of the implementation to break it out as aseparate piece. I called it &#34;Ms. Scheme&#34;, but since &#34;Ms&#34; seemed toolikely to suggest &#34;Microsoft&#34;, spelled it &#34;MzScheme&#34;. (Around 2001, westarted using the umbrella name &#34;PLT Scheme&#34; and moved away fromadopting cute names for subsystems. &#34;PLT Scheme&#34; became &#34;Racket&#34; in2010.)\n That’s why the oldest entry for   HISTORY.txt in the  gui-lib packageis “Version 0.7: May 10, 1995,” while the oldest entry in   HISTORY.txtfor the  racket collection is “Verion 0.27: September 26, 1995.” Theeditor came first, and the language was something of an afterthought.\n Of course, the language quickly came to dominate the idea—  if notthe day-to-day work, which for several years was still mostly aboutgetting cross-platform GUI and drawing toolkit to run well. Given thatthe language became the main line of the project, it’s easy to seechoices that would have been a better starting point, even in 1995. Butit turned out okay.\n  By summer ’95, I had designed the basics of what is now known as the design recipeand a few days worth of teaching material. We recruitedfour teachers and one of Corky’s PhD candidates to test this materialwith a week-long workshop.\n  During the week, Matthew demoed a rudimentary IDE based on MrEd. Iwas suitably impressed and tried MrEd onthe four participants, with simple images and all. It didn’t go toowell, but we had the first four innocent users try out our very firstteaching environment.", "posttime": "2020-05-10 22:22:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "球拍,racket,代数", "title": "球拍有25年的历史了", "title_en": "Racket is 25 years old", "transed": 1, "url": "https://blog.racket-lang.org/2020/05/racket-is-25.html", "via": "", "real_tags": ["球拍", "racket", "代数"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001521, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "IO_INGING是在Linux下进行异步I/O编程的一种强大的新方法。摆脱了上一代I/O子系统的各种限制，IO_ing有着巨大的发展前景。有关Iouring给表带来的更多详细信息，请参阅“What is Iouring？”一章。\n这本IO指南是由Shuveb Hussain创建的，他也是专注于Linux的博客unixism.net的作者。\n本指南的源代码存储库在Github上。如果您想要贡献，请给我发送拉取请求。如果您在文档或附带的源代码示例中发现任何错误，请在GitHub上提出问题。示例程序的存储库是单独维护的。请查看下面的详细信息。\nGithub上提供了本指南中所有示例程序的源代码。如果您在示例中发现错误，请在Github上提出问题。我想让这些例子简单而切中要害。出于这个原因，我可能不会合并添加功能的拉取请求。欢迎拉取修复错误的请求。", "note_en": "io_uring is a powerful new way to do asynchronous I/O programming under Linux. Doing away with various limitations of previous generation I/O subsystems,   io_uring holds immense promise. For more details on what   io_uring brings to the table, please see the chapter   What is io_uring?.\n This   io_uring guide was created by  Shuveb Hussain, who is also the author of the Linux-focused blog,  unixism.net.\n The source code repository for this guide is  here on Github. Please send me pull requests should you want to contribute. If you find any bugs in either the documentation or the included source code examples, please raise an issue on GitHub. The repository for the example programs is maintained separately. Please see details below.\n Source code for all example programs in this guide are available  on Github. If you find bugs in the examples, please raise issues on Github. I want to keep these examples simple and to the point. I many not merge pull requests that add features for that reason. Pull requests that fix bugs are welcome.", "posttime": "2020-05-10 22:07:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "教程,示例,io,拉取", "title": "Iouring之王：Io_uring教程、示例和参考资料", "title_en": "Lord of the io_uring: io_uring tutorial, examples and reference", "transed": 1, "url": "https://unixism.net/loti/", "via": "", "real_tags": ["教程", "示例", "io", "拉取"]}, {"category": "", "categoryclass": "", "imagename": "230e25fac0f4de57a8fc6c33479484b4.jpg", "infoid": 1001520, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "官方数据显示，在德国，冠状病毒感染人数正在上升，就在几天前，该国放松了封锁限制。\n根据罗伯特·科赫研究所(RKI)的数据，德国的繁殖率-每个确诊患者感染的人数-现在超过1。\n这份报告发布之际，数千名德国人周六聚集在一起，呼吁全面结束封锁。\n德国总理安格拉·默克尔(Angela Merkel)在与德国16个州的领导人会谈后，于周三宣布全面放松国家限制。\n所有的商店都被允许重新开张，学生们将逐渐回到学校，德甲-德国顶级足球联赛-最快将在下周末重新开始。\n但周六全国各地都发生了抗议活动，一些人呼吁更快地取消措施。\n德国的确诊病例数量在世界上排名第七，周日的最新RKI数据显示，报告的感染人数为169,218人，报告的死亡人数为7,395人。\n公共卫生机构周六发布的报告称，繁殖率估计为1.1。\n虽然这一估计涉及一定程度的不确定性，但人数的增加需要在未来几天密切关注形势。\n德国对疫情的反应赢得了赞誉。大规模检测和有效的封锁限制有助于将死亡人数保持在远低于其他欧洲国家的水平。\n但在周三与16个州的首脑交谈后，一些人批评了默克尔放松这些措施的决定。\n财政大臣实施了紧急刹车，要求地方当局在案件超过每10万人50人的门槛时重新实施限制。\n据报道，北莱茵-威斯特伐利亚州和石勒苏益格-荷尔斯坦州肉类加工厂的疫情已经突破了这条线，迫使地区官员采取行动。\n据报道，图林根州的一个地区记录了每10万人中有80多人感染，据信是由于护理设施的爆发。\n这些最新的官方数据似乎表明，德国的冠状病毒感染人数可能再次上升得更快。\n繁殖率已经上升到1.1，这意味着10个人将把病毒传染给另外11个人。为了控制住大流行，这一水平应该低于1。\n不过，这个数字只是一个估计数字。而且它确实每天都有很大的不同。因此，官员们警告不要将其过度解读为短期变化。\n但这一切都发生在德国放松对一些风险最高的行业的限制时，这些行业可能会受到感染-如餐馆、酒店和职业足球。\n因此，政府将密切关注这是否标志着一种趋势。如果病毒传播得更快，可能会重新施加一些限制。\n与此同时，尽管德国的每日死亡人数是一个多月来最低的。截至周日的24小时内，这里死于冠状病毒的人数不到40人。在其他欧洲大国，这一水平有时已升至近1000人。\n虽然一些人担心该国放松限制太快，但德国的其他人正在抗议持续的封锁。\n最近几周，少数人走上街头，但周六，人数增加到数千人，他们聚集在全国各地的城市-包括柏林、法兰克福、慕尼黑和斯图加特。\n周六，柏林警方在国会大厦外逮捕了大约30人，原因是他们不遵守社会距离措施。当局表示，一些示威者向警察投掷瓶子。", "note_en": "Coronavirus infections are rising in Germany, official data shows, just days after the country eased its lockdown restrictions.\n According to the Robert Koch Institute (RKI), Germany&#39;s reproduction rate - the number of people each confirmed patient infects - is now above 1.\n  The report came as thousands of Germans gathered on Saturday calling for a total end to the lockdown.\n Chancellor Angela Merkel announced a broad relaxation of national restrictions on Wednesday after talks with the leaders of Germany&#39;s 16 states.\n  All shops are allowed to reopen, pupils will gradually return to class and the Bundesliga - Germany&#39;s top football league - will restart as soon as next weekend.\n  But there were protests across the country on Saturday, as some called for measures to be lifted even quicker.\n Germany has the seventh-highest number of confirmed cases in the world, with latest RKI data on Sunday showing the reported infected tally at 169,218 and a reported death toll of 7,395.\n  The report from the public health agency released on Saturday said the reproduction rate was estimated at 1.1.\n While this estimate involves &#34;a degree of uncertainty&#34;, the rise in the number requires &#34;a close monitoring of the situation in the coming days&#34;.\n Germany has won praise for its response to the outbreak. Mass testing and effective lockdown restrictions have helped keep the death toll far lower than in other European countries.\n  But some have criticised Mrs Merkel&#39;s decision to relax those measures after speaking with the heads of the 16 states on Wednesday.\n The chancellor imposed an &#34;emergency brake&#34;, requiring local authorities to reimpose restrictions if cases rise above a threshold of 50 per 100,000 people.\n Outbreaks at meat processing plants in the states of North Rhine-Westphalia and Schleswig-Holstein have already reportedly breached that line, and forced district officials to act.\n And one district in the state of Thuringia reportedly recorded more than 80 infections per 100,000 people, thought to be due to outbreaks at care facilities.\n    These latest official figures appear to show that the number of Covid-19 infections in Germany may be rising faster again.\n The reproduction rate has risen to 1.1 - that means that ten people will pass the virus on to 11 more people. To keep the pandemic in check this level should be below one.\n This figure though is an estimate. And it does vary a lot from day to day. So officials warn against interpreting too much into short-term changes.\n But this all comes as Germany is easing restrictions in some of the most risky sectors when it potential infections - such as restaurants, hotels and professional football.\n So the government will be watching closely to see if this does mark a trend. And if the virus is spreading more rapidly, some restrictions could be reimposed.\n At the same though the daily death toll in Germany is the lowest it&#39;s been in more than a month. Fewer than 40 people here died of Covid-19 in the 24 hours until Sunday. In other large European countries this level has at times risen to almost 1,000.\n   While some worry that the country is easing its restrictions too soon, others in Germany are protesting against the continued lockdown.\n Small numbers of people have taken to the streets in recent weeks but on Saturday this swelled to thousands of people who gathered in cities across the country - including Berlin, Frankfurt, Munich and Stuttgart.\n  Officers in Berlin arrested about 30 people outside the Reichstag on Saturday for not obeying social distancing measures. Authorities say some demonstrators threw bottles at the police.", "posttime": "2020-05-10 22:06:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,coronavirus,冠状病毒,德国,germany", "title": "冠状病毒：德国感染率上升，封锁放松", "title_en": "Coronavirus: Germany infection rate rises as lockdown eases", "transed": 1, "url": "https://www.bbc.co.uk/news/world-europe-52604676", "via": "", "real_tags": ["病毒", "冠状病毒", "德国", "germany"]}, {"category": "", "categoryclass": "", "imagename": "602663a25452bdd4ecce26f6a64a3991.jpg", "infoid": 1001518, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ProPublica是一个调查滥用权力的非营利性新闻编辑室。注册后即可收到我们最重要的新闻。\n这场90年来最严重的危机已经过去了10周，政府拯救经济的努力既取得了惊人的成功，也遭遇了灾难性的失败。\n这一点最明显的例证出现在周五，当时政府报告称，4月份有2050万人失去了工作。这标志着全国范围内自大萧条以来从未见过的深不可测的痛苦时期。同样在周五，股市出现反弹。\n标准普尔500指数目前从3月中旬的低点上涨了30%，回到了去年10月的水平，当时2020年的企业收益前景看起来很光明。最近几周，公司为投资级公司出售了创纪录的债券。垃圾债券在经济低迷时期历来是不可靠的，但现在已经咆哮着卷土重来。\n如果你在寻找投资者对谁赢得了救助的判断，那么考虑一下这些回报：私募股权巨头阿波罗集团(Apollo Group)的股价已经从低点飙升了80%。另一家私募股权巨头黑石集团(Blackstone)的股价上涨了50%。\n原因是，像阿波罗和黑石这样的资产持有者-不成比例地是最富有和最有影响力的-已经得到了世界上最强大的中央银行的保险。这种慷慨是无穷无尽的，而且是无条件的。“即使出现第二波疫情，”摩根大通的经济学家周五在一份庆祝报告中写道，“美联储已经明确表示，没有美元限额，也没有弹尽粮绝的危险。”", "note_en": "ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive  our biggest stories as soon as they’re published.\n  Ten weeks into the worst crisis in 90 years, the government’s effort to save the economy has been both a spectacular success and a catastrophic failure.\n  The clearest illustration of that came on Friday, when the government reported that 20.5 million people lost their jobs in April. It marked a period of unfathomable pain across the country not seen since the Great Depression. Also on Friday, the stock market rallied.\n  The S&amp;P 500 is now up 30% from its lows in mid-March and back to where it was last October, when the outlook for 2020 corporate earnings looked sunshiny. Companies have sold  record amounts of debt  in recent weeks for investment-grade companies. Junk bonds, historically dodgy during an economic swoon, have roared back.\n  If you’re looking for investors’ verdict on who has won the bailout, consider these returns: Shares of Apollo Group, the giant private equity firm, have soared 80% from their lows. The stock of Blackstone, another private equity behemoth, has risen 50%.\n  The reason: Asset holders like Apollo and Blackstone — disproportionately the wealthiest and most influential — have been insured by the world’s most powerful central bank. This largess is boundless and without conditions. “Even if a second wave of outbreaks were to occur,” JPMorgan economists wrote in a celebratory note on Friday, “the Fed has explicitly indicated that there is no dollar limit and no danger of running out of ammunition.”", "posttime": "2020-05-10 22:06:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "计划,working", "title": "救助计划正在奏效-为富人服务", "title_en": "The Bailout Is Working – For the Rich", "transed": 1, "url": "https://www.propublica.org/article/the-bailout-is-working-for-the-rich", "via": "", "real_tags": ["计划", "working"]}, {"category": "", "categoryclass": "", "imagename": "a33538f59979fd9c5a532049d9bf437b.png", "infoid": 1001517, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "雷蒙德在2019年和2020年经历了两次内部事件后，增加了针对大规模回复所有电子邮件风暴的保护措施。\n黑客组织ShinyHunters正在一个黑暗的网络犯罪市场上出售10家公司的数据。\n安全漏洞发生在2019年12月，被美国司法部的JSOC团队发现。\n而健壮的密码则是要确保安全，还有很长的路要走你宝贵的在线账户，基于硬件的双因素身份验证需要把保安送到更上一层楼。..。\n唐纳德·特朗普总统想要保护美国&#39；通过禁止美国建设美国电网公司从购买电气产品中脱颖而出可能来自敌国的装备。那个&#39；It‘说起来容易，说起来难..。", "note_en": "Redmond adds protection against massive &#34;Reply-All&#34; email storms after suffering two internal incidents in 2019 and 2020.\n  Hacker group &#34;ShinyHunters&#34; is selling the data of 10 companies on a dark web cybercrime marketplace.\n  Security breach took place in December 2019 and was discovered by the DOJ&#39;s JSOC team.\n    While\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trobust\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpasswords\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgo\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlong\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tway\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsecuring\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyour\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tvaluable\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tonline\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\taccounts,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thardware-based\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttwo-factor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tauthentication\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttakes\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsecurity\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnext\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tlevel.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  President\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tDonald\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTrump\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twants\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprotect\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAmerica&#39;s\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpower-grid\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tby\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tforbidding\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tUS\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcompanies\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfrom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tbuying\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\telectrical\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tequipment\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfrom\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpossible\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tenemy\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcountries.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThat&#39;s\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\teasier\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsaid\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...", "posttime": "2020-05-10 22:05:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "客户,ocean,美国", "title": "Digital Ocean在将内部文档留在网上后暴露了客户数据", "title_en": "Digital Ocean exposed customer data after it left an internal document online", "transed": 1, "url": "https://www.zdnet.com/article/digital-ocean-says-it-exposed-customer-data-after-it-left-an-internal-doc-online/", "via": "", "real_tags": ["客户", "ocean", "美国"]}, {"category": "", "categoryclass": "", "imagename": "a4ff0f583162f89be98e1d3fc0a490a0.jpg", "infoid": 1001515, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周，微软向Office365客户推出了一项新功能，帮助他们的IT员工检测并阻止所有电子邮件风暴的回复。\n该术语指的是员工在群发电子邮件(如全公司范围的通知)中使用全部回复选项的情况。\n如果电子邮件链中的收件人数量很多，并且多名员工点击了全部回复按钮，则随后的事件会产生大量流量，通常会降低电子邮件服务器的速度或使其崩溃。\n这类事件几乎每时每刻都在发生，在某个时候，一家公司会因为员工参与并放大回复而导致电子邮件服务器宕机-所有这些风暴都是一场恶作剧。\n微软也已经遭遇了两起这样的事件，第一起发生在2019年1月，第二起发生在2020年3月。微软回复的所有电子邮件风暴包括5.2万多名员工，他们最终导致公司内部通信堵塞达数小时之久。\n去年，在Microsoft Ignite大会上，微软宣布将致力于一项功能，该功能将有助于防止Office365 Exchange电子邮件服务器上的所有回复电子邮件风暴。\n这项功能本周开始向全球所有Office 365用户推出。在目前的形式中，微软表示，“回复所有风暴防护”功能将屏蔽所有收件人超过5000人、回复超过10封的电子邮件--所有邮件序列都是在过去60分钟内完成的。\n一旦触发该功能，Exchange Online将在接下来的四个小时内阻止电子邮件线程中的所有回复，帮助服务器确定实际电子邮件的优先顺序，并关闭所有回复风暴。\n微软表示，未来还将继续开发这一功能，承诺为Exchange管理员添加控件，这样他们就可以设置自己的风暴检测限制。\n其他计划的功能还包括回复所有风暴报告和实时通知，以提醒管理员正在进行的电子邮件风暴，以便他们可以密切关注电子邮件服务器的状态，以确定可能的减速或崩溃。\n由于微软最近遭遇了电子邮件风暴，它自己的网络被证明是这一功能的最佳试验场。\n交易所团队本周表示，无论人类为哪家公司工作，他们的行为方式都与人类相似。我们已经看到该功能的第一个版本成功降低了在Microsoft内部回复所有风暴的影响。\n注册后，即表示您同意使用条款并承认隐私政策中概述的数据做法。\n您还可以免费订阅ZDNet的今日技术更新和ZDNet公告时事通讯。您可以随时取消订阅这些时事通讯。\n您同意接收来自CBS系列公司的更新、提醒和促销信息，包括ZDNet的今日技术更新和ZDNet公告时事通讯。你可以随时退订。\n通过注册，您同意接收您可以随时取消订阅的选定时事通讯。您也同意使用条款，并承认我们的隐私政策中概述的数据收集和使用做法。\n我们似乎进入了一些人喜欢称之为浏览器大战的领域。突然之间，微软开始玩起好戏来了。\n微软提出修复免费的Surface笔记本电脑3个屏幕破裂似乎没有明显的原因。它会报销那些谁已经付钱给将此问题修复为他们的..。\n微软&#39；的私人预览节目用于全息镜头的Windows Autopilot%2现在已打开。我们的目标是：使设备更易于调配并进行规模化管理。..。\n在一周的时间里，微软宣布计划在目前没有数据中心的国家增加三个新的数据中心区域。\n微软基于Windows的双屏Surface Neo目前处于暂停状态，但该公司仍在继续研发基于Android的双屏双屏产品。\n黑客被认为是无害的，因为黑客没有获得任何主要微软应用程序的源代码。\n想要避免让你的网上账户被黑了吗？启用双因素身份验证，一项重要的安全措施那", "note_en": "Microsoft rolled out this week a new feature to Office 365 customers to help their IT staff detect and stop &#34; Reply-All email storms.&#34;\n The term refers to situations when employees use the Reply-All option in mass-mailed emails, such as company-wide notifications.\n If the number of recipients in the email chain is large, and if multiple employees hit the Reply-All button, then the ensuing event generates massive amounts of traffic that usually slows down or crashes email servers.\n Such events happen almost all the time, and, at one point or another, a company is going to have email servers go down because of employees participating and amplifying Reply-All storms as a prank.\n Microsoft, too, has suffered two such incidents already, the first in  January 2019, and a second in  March 2020. The Microsoft Reply-All email storms included more than 52,000 employees, who ended up clogging the company&#39;s internal communications for hours.\n   Last year, at the Microsoft Ignite conference,  Microsoft announced it would work on a feature that would help prevent Reply-All email storms on Office 365 Exchange email servers.\n The feature started rolling out this week to all Office 365 users worldwide. In its current form, Microsoft says the &#34;Reply All Storm Protection&#34; feature will block all email threads with more than 5,000 recipients that have generated more than 10 Reply-All sequences within the last 60 minutes.\n   Once the feature gets triggered, Exchange Online will block all replies in the email thread for the next four hours, helping servers prioritize actual emails and shut down the Reply-All storm.\n Microsoft said it would also continue working on the feature going forward, promising to add controls for Exchange admins so they can set their own storm detection limits.\n Other planned features also include Reply-All storm reports and real-time notifications to alert administrators of an ongoing email storm so that they can keep an eye on the email server&#39;s status for possible slowdowns or crashes.\n And since Microsoft has had its run-ins with email storms recently, its own network proved the best testing ground for the feature.\n &#34;Humans still behave like humans no matter which company they work for,&#34;  the Exchange team said this week. &#34;We&#39;re already seeing the first version of the feature successfully reduce the impact of reply all storms within Microsoft.&#34;\n  By registering, you agree to the  Terms of Use and acknowledge the data practices outlined in the  Privacy Policy.\n  You will also receive a complimentary subscription to the ZDNet&#39;s Tech Update Today and ZDNet Announcement newsletters. You may unsubscribe from these newsletters at any time.\n         You agree to receive updates, alerts, and promotions from the CBS family of companies - including ZDNet’s Tech Update Today and ZDNet Announcement newsletters. You may unsubscribe at any time.\n      By signing up, you agree to receive the selected newsletter(s) which you may unsubscribe from at any time. You also agree to the  Terms of Use and acknowledge the data collection and usage practices outlined in our  Privacy Policy.\n       It seemed as if we were entering what some enjoy calling browser wars. Suddenly, Microsoft starts to play nice.\n  Microsoft\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\toffering\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trepair\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfree\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tSurface\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tLaptop\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t3\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tscreens\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcracked\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tseemingly\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tno\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tapparent\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\treason.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAnd\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tit\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twill\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\treimburse\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthose\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twho\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\talready\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpaid\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfix\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tissue\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ton\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttheir\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  Microsoft&#39;s\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprivate\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tpreview\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprogram\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tWindows\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tAutopilot\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tfor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tHoloLens\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t2\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tis\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tnow\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\topen.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tThe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tgoal:\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tTo\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmake\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthe\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tdevices\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\teasier\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tprovision\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tand\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmanage\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tscale.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  In the span of a week, Microsoft announced plans to add three new datacenter regions in countries where it doesn&#39;t currently have them.\n  Microsoft&#39;s dual-screen Windows-based Surface Neo is on hold, but the company is continuing to work on the dual-screen Android-based Duo.\n  Hack considered harmless as the hacker did not gain access to the source code of any major Microsoft apps.\n  Want\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tavoid\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thaving\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tyour\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tonline\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\taccounts\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thacked?\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tEnable\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ttwo-factor\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tauthentication,\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\ta\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tcrucial\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsecurity\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tmeasure\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tthat\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\trequires\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tan\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\textra\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tstep\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\twhen\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tsigning\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tin\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tto\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\thigh-value\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tservices.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t...\n  But they are over having meetings, and most of them working for large enterprise aren&#39;t happy with their job.", "posttime": "2020-05-10 21:54:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "微软,microsoft,阻止,launches,电子邮件", "title": "微软推出Office 365新功能阻止回复-所有电子邮件风暴", "title_en": "Microsoft Launches New Office 365 Features Blocking Reply-All Email Storms", "transed": 1, "url": "https://www.zdnet.com/article/microsoft-adds-protection-against-reply-all-email-storms-in-office-365/", "via": "", "real_tags": ["微软", "microsoft", "阻止", "launches", "电子邮件"]}, {"category": "", "categoryclass": "", "imagename": "5ca9e5ad76e2d174e82f0c20f4d3a73a.png", "infoid": 1001514, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Gearbox⚙️是一个用Go编写的用于构建微服务的Web框架，侧重于高性能和内存优化。它建立在Fasthttp之上，比net/http快10倍。\n在变速箱中，我们关心的是每种方法在构建过程中将使用的性能和内存，以及我们如何改进这一点。它还需要更多的时间来研究将使用的每个组件，并将其与其他开源Web框架的不同实现进行比较。它可能最终会以优化的方式编写我们自己的组件来实现我们的目标。\n打包主要导入(&#34；github.com/abahmed/gearbox&#34；&#34；github.com/valyala/Fasthttp&#34；)func main(){//设置gearbox gearbox：=gearbox。new()//定义处理器变速箱。get(&#34；/hello&34；，func(CTX*Fasthttp.。RequestCtx){CTX.。回应。SetBodyString(&#34；Hello World！&#34；)})//启动服务变速箱。开始(&#34；：3000&#34；)}。\n如果您有任何问题或建议，请随时在Gitter上加入我们，或者给我们发电子邮件至gearbox@googlegroups.com", "note_en": "gearbox  ⚙️ is a web framework for building micro services written in Go with a focus on high performance and memory optimization. It&#39;s built on  fasthttp which is  10x faster than net/http\n In  gearbox, we care about peformance and memory which will be used by each method while building things up and how we can improve that. It also takes more time to  research about each component that will be used and  compare it with different implementations of other open source web frameworks. It may end up writing our  own components in an optimized way to achieve our goals\n        package main import (   &#34;github.com/abahmed/gearbox &#34;   &#34;github.com/valyala/fasthttp &#34;) func  main() {   // Setup gearbox  gearbox  := gearbox. New()   // Define your handlers gearbox. Get(  &#34;/hello &#34;,  func(ctx *fasthttp. RequestCtx) {\tctx. Response. SetBodyString(  &#34;Hello World! &#34;) })   // Start service gearbox. Start(  &#34;:3000 &#34;)}\n         Feel free to Join us on  Gitter, or email us at  gearbox@googlegroups.com if you have questions, or suggestions", "posttime": "2020-05-10 21:53:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "web,gearbox", "title": "Gearbox-一个用Go编写的Web框架", "title_en": "Gearbox  – A web framework written in Go", "transed": 1, "url": "https://github.com/abahmed/gearbox", "via": "", "real_tags": ["web", "gearbox"]}, {"category": "", "categoryclass": "", "imagename": "604e74deec5d7f464c8801e1702b9120.jpg", "infoid": 1001513, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这起诉讼旨在寻求对阿拉米达县的禁令和声明救济，CNBC最先报道了这起诉讼。这起诉讼是在加利福尼亚州北区的美国地区法院提起的。\n周六早些时候，特斯拉首席执行官埃隆·马斯克(Elon Musk)在推特上表示，他正在对阿拉米达县提起诉讼，并威胁要立即将其总部和未来的项目迁往德克萨斯州或内华达州。\n特斯拉原本计划周五召回约30%的工厂工人，这是其重新开工计划的一部分，无视阿拉米达县的居家命令。马斯克是基于加州州长加文·纽瑟姆(Gavin Newsom)周四发布的新指导意见重新开业的，该指导意见允许制造商恢复运营。这一指导赢得了马斯克的赞扬，他后来向员工发送了一封内部电子邮件，说明根据州长修改后的命令重新开业的计划。然而，州长的指导包括警告地方政府可以保持更具限制性的规定。阿拉米达县和其他几个湾区县市上周将居家订单延长至5月底。这些命令进行了修订，确实放松了一些限制。然而，它并没有取消制造订单。\n诉讼认为，阻止特斯拉开业，阿拉米达县违背了自己的指导方针。\n阿拉米达县已明确承认并宣传“商家可以。。。起诉书中写道，该公司经营生产“电池和电动汽车”。“然而，令人费解的是，第三订单和县官员同时坚持特斯拉必须继续关闭，从而进一步加剧了围绕阿拉米达县关于特斯拉是否可以恢复其弗里蒙特工厂和该县其他地方制造活动的立场的模棱两可、混乱和不合理的情况。”\n术语“第三命令”指的是阿拉米达县发布的修改后的留置令。\n周五，阿拉米达县卫生局表示，特斯拉尚未获得重新开业的“绿灯”，并表示，如果该公司重新开业，将违反命令。", "note_en": "The lawsuit, which seeks injunctive and declaratory relief against Alameda County, was  first reported by CNBC. The lawsuit was filed in U.S. District Court for California’s Northern District.\n Earlier Saturday,  Tesla   CEO  Elon Musk   tweeted that he was filing a lawsuit against Alameda County and threatened to move its headquarters and future programs to Texas or Nevada immediately.\n Tesla had planned to bring back about 30% of its factory workers Friday as part of its reopening plan, defying Alameda County’s stay-at-home order. Musk was basing the reopening on new guidance issued Thursday by California Gov.  Gavin Newsom   that allows manufacturers to resume operations. The guidance won praise from Musk, who later sent an internal email to employees about plans to reopen based on the governor’s revised order. However, the governor’s guidance included a warning that local governments could keep more restrictive rules in place. Alameda County, along with several other Bay Area counties and cities, last week extended the  stay-at-home orders through the end of May. The orders were revised and did ease some of the restrictions. However, it did not lift the order for manufacturing.\n The lawsuit argues that by preventing Tesla from opening, the Alameda County is going against its own guidance.\n “Alameda County has expressly recognized and publicized that “businesses may . . . operate to manufacture” batteries and electric vehicles,” the complaint reads. “Inexplicably, however, the Third Order as well as County officials have simultaneously insisted that Tesla must remain shuttered, thereby further compounding the ambiguity, confusion and irrationality surrounding Alameda County’s position as to whether Tesla may resume manufacturing activities at its Fremont Factory and elsewhere in the County.”\n The term “third order” is a reference to a revised stay-in-place order issued by Alameda County.\n On Friday, the Alameda County Health Department said  Tesla had not been given “the green light” to reopen and said if the company did, it would be out of compliance with the order.", "posttime": "2020-05-10 21:52:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,迫使,sues,诉讼", "title": "特斯拉起诉阿拉米达县迫使加州工厂重新开工", "title_en": "Tesla sues Alameda County to force California factory reopening", "transed": 1, "url": "https://techcrunch.com/2020/05/09/tesla-sues-alameda-county-to-force-california-factory-reopening/", "via": "", "real_tags": ["特斯拉", "迫使", "sues", "诉讼"]}, {"category": "", "categoryclass": "", "imagename": "4bee66a08f4f4d87c5f8175ec24991eb.jpeg", "infoid": 1001512, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据白厅正在考虑的计划，英国人可以被赋予在家工作的合法权利，以确保他们在封锁后不会被迫回到工作场所。\n《每日电讯报》透露，商业、能源和工业战略部门的官员提出了将在家工作的权利写入法律的问题，这是缓解封锁的一系列选择的一部分。\n一位消息人士说，合法权利的想法是官员们在讨论政府重返工作岗位的一揽子计划时提出的。\n这将意味着员工不会感到被迫进入办公室，同时限制了雇主的成本，这些雇主必须让他们的工作场所安全地进行社交距离。\n这一想法-仍处于初级阶段-已经赢得了政府部长们的支持，他们已经起草了鼓励人们重返工作岗位并推动经济增长的计划。其中一人说：这完全说得通。\n这项措施可能会在保守党在12月选举中赢得的所谓红墙席位中受到欢迎。英国首相鲍里斯·约翰逊(Boris Johnson)承诺，在该党2019年的宣言中，他的政府将使灵活工作成为工人的一项默认权利。\n它说：我们将鼓励弹性工作，并就将其设为默认工作进行磋商，除非雇主有充分的理由不这样做。\n2017年，马修·泰勒(Matthew Taylor)在一篇关于现代工作的评论中提出了对在家工作提供更多保护的想法，该评论称：鼓励弹性工作对每个人都有好处，并已被证明对生产率、员工留任和工作质量有积极影响。\n在2018年政府的回应中，部长们表示，作为对2019年要求弹性工作的权利的法定评估的一部分，政府应该考虑如何进一步促进工作场所真正的灵活性。\n一位熟悉这些计划背后想法的消息人士表示，合法的在家工作权利-或承诺在家工作-将确保一旦封锁解除，通勤者试图返回工作岗位时，车站不会排起长队。\n交通部门警告说，两米长的社会距离规定将意味着火车和公交车必须有85%的空载，以确保旅客被分开。\n自由民主党前座议员莱拉·莫兰(Layla Moran)表示，对雇主和工人来说，任何新法律都可能是双赢的。\n她说，通过引入这项法律，政府将让个人更多地控制工作与生活的平衡，从而改善心理健康，提高生产力。它还将有助于解决工作场所准入方面的差距，尤其是那些需要照顾孩子或承担其他照顾责任的人。\n我相信这一改变对雇员和雇主都有好处，而且有可能是双赢的。\n工会秘书长弗朗西斯·O&#39；格雷迪告诉“每日电讯报”：在家工作的权利将是向前迈出的一大步。从事各种工作的人都需要对自己的工作时间和工作地点有更多的控制权。这就是为什么我们呼吁所有员工在第一天就享有弹性工作的权利。\n英国工会联合会上周的一份报告发现，十分之四的员工担心回去工作时无法与同事保持社交距离。\n研究还发现，超过四分之一的人担心无法与客户或客户保持社交距离。三分之一的人担心会让家里的其他人面临更大的风险。\nUnison工会还报告说，其一些成员曾表示，他们很害怕，如果被迫上班，他们可能会把病毒带回家--这可能会带来毁灭性的后果。\n一位来自白厅的消息人士告诉“每日电讯报”：一旦封锁措施放松，我们正在与关键的利益相关者和行业团体以及工会就安全工作进行接触。\n一位政府发言人说：商务大臣继续与企业、工会领袖以及科学和医学界合作，这样我们就可以确保那些一旦措施放松就会重返工作岗位的人的工作场所是安全的，并给人们重返工作的信心。\n如果大臣们推进这些计划，英国将与德国结盟，德国上周公布了在疫情爆发后进一步引入在家工作的合法权利的提议。\n社会民主党劳工部长胡伯特斯·海尔(Hubertus Heil)表示，就业立法将在秋季提交，使德国和芬兰成为世界上仅有的两个将在家工作权利写入法律的国家。\n海尔告诉“星期日图片报”：只要愿意，只要工作允许，每个人都应该能够在家庭办公室工作。在这场流行病中，我们正在学习在家可以做多少工作。\n每日电讯报重视您的评论，但恳请所有帖子都是主题、建设性和尊重的。请检查我们的评论政策。", "note_en": "Britons could be given a legal right to work from home to ensure that they are not forced to go back to workplaces  after the lockdown under plans being considered in Whitehall.\n Officials at the Business, Energy and Industrial Strategy department have raised the issue of enshrining a right to work from home in law as part of a suite of options to ease the lockdown, The Telegraph can reveal.\n One source said the idea of a legal right was suggested by officials during talks about the Government&#39;s return to work package.\n It would mean staff would not feel  compelled to go in to the office, while limiting the costs for employers who have to make their workplaces safe for social distancing.\n The idea – still in its infancy – has won the support of Government ministers who have drawn up the plans to encourage people to return to work and get the economy motoring. One said: &#34;It makes complete sense.&#34;\n  The measure could prove popular in the so-called- red wall seats won by the Tories at December&#39;s election. Boris Johnson, the Prime Minister, committed his Government to making flexible working a  default right for workers in the party&#39;s 2019 manifesto.\n It said: &#34;We will encourage flexible working and consult on making it the default unless employers have good reasons not to.&#34;\n The idea of more protections to work from home were contained in a review of modern-day working by Matthew Taylor in 2017, which said: &#34;Encouraging flexible work is good for everyone and has been shown to have a positive impact on productivity, worker retention and quality of work.&#34;\n In the Government&#39;s response in 2018, ministers said that, &#34;as part of the statutory evaluation of the Right to Request Flexible Working in 2019, the Government should consider how further to promote genuine flexibility in the workplace&#34;.\n A source familiar with the thinking behind the plans said a legal right to work from home – or a commitment to one – would ensure that there are not huge queues at stations when commuters try to return to work once the lockdown eases.\n Transport authorities have warned the two-metre social distancing rules would mean trains and buses  would have to run 85 per cent empty to ensure travellers are kept apart.\n The Liberal Democrat frontbencher Layla Moran said any new law could be a &#34;win-win&#34; for employers and workers.\n &#34;By introducing this law, the Government will be giving the individuals even more control over their work-life balance, leading to improved mental health and more productivity,&#34; she said. &#34;It would also help address disparities in accessibility to the workplace, faced especially by those with childcare or other caring responsibilities.\n &#34;I believe this change would benefit both the employees and the employers, and has the potential to be a win-win.&#34;\n Frances O&#39;Grady, the TUC general secretary, told The Telegraph: &#34;The right to work from home would be a big step forward. People in all types of job need to be given more control over their hours and where they work. That&#39;s why we&#39;ve called for all workers to have a day one right to flexible working.&#34;\n A report from the TUC last week found that four in 10 workers are are concerned about not being able to socially distance from colleagues when back at work.\n  The study also found more than a quarter were concerned about not being able to socially distance from customers or clients. One third were concerned about exposing others in their household to greater risk.\n The Unison union also reported that some of its members had said they were &#34;terrified that, if forced to go into work, they might take the virus home – with potentially devastating consequences&#34;.\n A Whitehall source told The Telegraph: &#34;We are engaging with key stakeholder and industry groups, as well as the unions, on safe working once lockdown measures have been relaxed.&#34;\n A Government spokesman said: &#34;The Business Secretary continues to work with businesses, union leaders and the science and medical community so we can ensure workplaces are safe for those who will go back to work once the measures are relaxed and give people the confidence to return to work.&#34;\n If ministers take the plans forward it would align the UK with Germany, which last week unveiled proposals to  introduce a legal right to work from home after the pandemic.\n Hubertus Heil, the Social Democrat labour minister, said employment legislation would be tabled in the autumn, making Germany and Finland the only countries in the world to have the right to home working enshrined in law.\n Mr Heil told Bild am Sonntag: &#34;Everyone who wants to and whose job allows it should be able to work in a home office. We are learning in the pandemic how much work can be done from home.&#34;\n  The Telegraph values your comments but kindly requests all posts are on topic, constructive and respectful. Please review our commenting policy.", "posttime": "2020-05-10 21:52:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,coronavirus,冠状病毒,权利,home", "title": "冠状病毒封锁后，在家工作的权利可能被载入法律", "title_en": "Right to work from home could be enshrined in law after coronavirus lockdown", "transed": 1, "url": "https://www.telegraph.co.uk/politics/2020/05/08/right-work-home-could-enshrined-law-coronavirus-lockdown-ends/", "via": "", "real_tags": ["病毒", "冠状病毒", "权利", "home"]}, {"category": "", "categoryclass": "", "imagename": "b3542617d22dbfcb1642bad4dfc4d9f4.png", "infoid": 1001511, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当您开始使用Linux时，您可能会根据它的桌面环境来判断您的发行版。在这篇综述中，我们将仔细看看设计师在设计桌面时会考虑什么。“环境”是窗口管理器和您的桌面上可能具有的其他元素的组合。这些是任务栏、图标，有时也是桌面上的活动元素。\n设计师制作Linux桌面环境以吸引所有用户。您可能不是普通用户。当你阅读这篇文章时，考虑一下你的喜好是什么。两个最流行的桌面环境是GNOME和KDE。他们有不同的哲学。对于GNOME(Gnu Network Object Model Environment，GNU网络对象模型环境)来说，就是要保持事物可用但不可见。KDE(K桌面环境)选择始终使用菜单。第三大最受欢迎的Linux桌面环境是Cinnamon。\n您对Linux桌面环境的选择取决于个人喜好，尽管您所做的工作将对您的最终决定产生最大影响。你的选择将与你是大量打字还是做图形工作有很大关系。例如，程序员可能会喜欢平铺窗口管理器的裸露外观，因为他们将更少地将手从键盘上抬起。\n为了帮助您选择合适的Linux桌面环境来满足您的需求，我们让五个最流行的桌面环境进行了一场无限制的七轮对决。我们根据安装、应用程序、用户体验、用户文档、性能、扩展和可配置性对GNOME、KDE、Cinnamon、Awese和Regolith进行了10分的评分。\nLinux发行版维护人员在启动时往往会选择特定的桌面环境。这不会仅仅因为你选择了Ubuntu就把你锁定在某个特定的桌面上，但是安装另一个桌面需要很多软件。该软件是实现所有图形组件(如框架、按钮和菜单)的基础。主要软件包也有创建特定应用程序的项目，这些应用程序与它们自己的桌面外观相匹配。其中许多可以在其他环境中使用，以防您爱上某个特定的环境。它会在图形上给出一些不一致的地方，但是工作得很好。\nKDE的等离子体项目有很多这样的项目，所以如果您有一个GNOME桌面，并且想要切换，那么您最终可能会安装一个几千兆字节的版本。如果您选择安装所有推荐的软件包，您将可以访问“K”应用程序。这些都是很棒的应用程序，但是在每个系统上，您应该选择GNOME或KDE，以避免磁盘空间浪费。当然，你还有很多其他的选项，这些选项可能会把你的设置搞得一团糟。\n与此同时，肉桂不需要来自它的侏儒祖先的任何东西-它已经用自己的软件包取代了所有这些东西。您可以使用包管理器安装许多最小的包。Suckless DWM是一个替代的最小选项，需要从源代码编译并更改为您的设置。这实际上很容易做到，棘手的部分是根据您的喜好对其进行配置。要获得一些灵感，请查看Luke Smith的构建。你需要添加几个程序，然后自己编译，这意味着你应该流利地编译软件和处理补丁。\nAWOWE有一个基本的设置，而且更容易定制，因为有很多主题可用。*它还可以作为新版本在您的存储库中使用。\nRogolith具有令人印象深刻的状态-它很容易安装，并且有像样的默认设置。然而，它需要Gnome，因为它取代了GNOME-shell，后者降低了用户的印象。当您与GNOME一起试用时也需要小心。在第一次测试Regolith之后，您可能会发现GNOME-Shell会话有一些变化。\n一些应用程序严重依赖窗口管理器来处理它们的窗口。当您选择窗口管理器时，您需要考虑您的应用程序是否可以处理整个工作流。流行的图像编辑器GIMP就是一个例子，当您在未停靠模式下使用这些工具时，该程序可能会导致问题。对于GIMP，您可以选择将所有工具放在应用程序中，称为单窗口模式。在运行办公软件包时，它们通常运行得很好，除非它们是专门为环境设计的。\nKDE有许多项目需要桌面环境才能运行。当心那些没有明显原因而拼写为“K”的节目。它们通常是为KDE制造的。话虽如此，它们中的大多数都可以跨平台工作。除非你知道必须要换，否则不要换。\n如果整个瓷砖窗户的东西不太适合你，不要考虑AweseTM、Regolith或DIY DIY NASK SUNK DWN。他们可以做漂浮的窗户，但做得不是很好。\nDWM可以处理大多数情况，但在双头设置中，您可能会遇到应用程序大小超过屏幕的问题。\n如果你在第二个屏幕上有不同的分辨率，Awesom也会发生同样的情况。对于大多数应用程序来说，这不是一个大问题。如果您觉得可以节省内存，这是值得的。\n您需要考虑的最重要的事情是，您是否想要三大Linux桌面环境(GNOME、KDE和Cinnamon)附带的所有通知。你可以把它们带走，稍微调整一下。\n获胜者：平局(GNOME，KDE和Cinnamon)。三个最大的Linux桌面环境都有强大的应用程序支持。\n当前的Linux桌面环境旨在吸引大量受众。GNOME有很多好看的东西，它的扩展可以为你提供天气预报、邮件通知和几乎任何你需要的来自互联网的东西。在KDE中，您会发现一种不同的理念，但是您仍然可以将许多小部件添加到您的桌面。在很长一段时间里，在桌面右下角设置按钮的想法是不可避免的。当GNOME开发人员决定挑战这一想法时，许多用户都大吃一惊。\n这就是肉桂存在的原因之一。在这里测试的其他参赛者使用的想法是，如果你有其他解决方案，任何东西都可以被扔掉。进入平铺、极简主义的桌面环境；DWM、令人敬畏和华而不实。对于DWM团队，整个理念是在用户决定之前不添加任何内容。你必须是决定这件事的人。\n大型Linux桌面环境之间最大的区别在于，您是应该拥有所有内容的菜单，还是应该寻找其他方法来定位应用程序。GNOME已经放弃了强制下拉或弹出菜单，而是允许搜索来完成这项工作。默认情况下，GNOME自带一个顶部栏，显示日期和您选择的扩展名。当您需要启动应用程序时，您可以启动文本搜索或调出可供选择的应用程序网格。\n有添加应用程序下拉菜单的扩展，您还可以添加“位置”来查看您的数据的不同目录。即使您不同意GNOME取消下拉菜单的初始选择，GNOME也很容易使用。您还可以添加许多扩展以保持更新。为了改善桌面环境的外观，您还可以选择许多主题。代价是高内存使用率。\nKDE Linux桌面环境的理念一直是使用并增强已知的概念。这就是为什么他们有菜单栏、开始框和应用程序列表的原因。如果你喜欢一致性，KDE血浆是为你准备的。该系统仍然非常创新，因此您不会缺少新功能。\n乍一看，您可能认为界面不灵活，但事实并非如此。\n您可以在屏幕上的任何位置设置任务栏，并且可以用多种方式设置桌面样式。事实上，KDE可能是模仿其他操作系统外观的最佳选择。你有桌面的小工具，你也可以在屏幕的任何地方添加一个坞站，让它看起来都是MacOS。由于KDE的设计理念比较保守，标准设置使得界面主要由鼠标驱动，所以如果您想把手指放在键盘上，而不想使用指点设备，那就去别处吧。\n肉桂开始是对GNOME 3.0的一种反应。Cinnamon的设计者喜欢这个应用程序启动程序，而GNOME团队则不喜欢它，所以他们开始了一个项目，用扩展重新添加它。该项目增加了扩展，现在是自己的窗口管理器。\n在此桌面上，您有用于应用程序的传统角菜单按钮。你在桌面上的任何地方都有一个右击菜单和天气等小工具。如果你喜欢任务栏和开始按钮，你会发现这个桌面很舒服。\n您可以选择一个看起来像Windows的主题。在Cinnamon中，你有“香料”可以增强你的桌面。它们是主题、小程序、桌面小程序和扩展。你可以很容易地用装饰品和有用的东西填满你的屏幕。这些都是交互式的、简单的信息显示，比如您的CPU、音乐播放器等。\nAWEW有许多可用的主题，而且比DWM等更极端的窗口管理器更容易使用。一旦你运行了它，你可以平铺所有的东西，但是你不需要这样做。使用Key-Chord键启动应用程序并键入部分应用程序名称是可能的，但您也可以使用下拉菜单。此菜单出现在光标所在的位置，并显示所有可用的应用程序。您可以在屏幕上拖动窗口，直到您习惯了平铺技术。\n大多数应用程序在AweseTM下运行良好，因此您的工作将会很顺利。选择主题时，请查看配置文件以查找依赖项。这些文件是Lua语言的，即使编程经验有限，您也能理解。一些问题可能是因为它采用了常规Linux的许多功能-dmenu和rofi就是您可能需要的示例。\nregolith是i3的预配置版本-它仍然运行GNOME，但取代了GNOME-SHELL。这意味着您正在运行在GNOME中自动启动的所有应用程序。默认情况下，桌面是平铺的，您可以使用i3的按键和弦来导航和组织您正在运行的应用程序。但是，您可以选择使用浮动应用程序。底部还有一个任务栏，用于显示网络、电池等的状态。\n习惯Regolith Linux桌面环境中的绑定需要一段时间，因此请阅读手册中的密钥绑定并制定培训计划。否则，你很快就会厌倦初学者的困惑。\nRegolith非常容易使用，但不会从您的机器中节省太多资源。要实现这一转变，你需要一个学习新习惯的计划。否则，您很快就会注意到，您一直在执行与以前在旧桌面环境中相同的操作。\n获胜者：平局。GNOME、Cinnamon和KDE的用户体验得分均为9分(满分10分)。\n文档是绝对必要的，但是许多维护人员和程序员讨厌编写文档。对于主要的Linux桌面环境，多亏了大型组织，您拥有了非常棒的文档。Canonical有Ubuntu的GNOME版本，所以你可以在他们的网站上找到很多。GNOME还有一个很棒的站点，分为用户、管理员和开发人员。\n要查找有关Cinnamon的任何帮助，请从Linux Mint网站开始-有大量的PDF文档可用。开发工作在GitHub上进行。您可以在香料页面上找到大多数信息。如果你想做扩展，可以在Cinnamon GitHub页面找到链接。就像在GNOME中一样，扩展是用JavaScript编写的。\n乍一看，Awesom的网站有一个指向手册页的链接，仅此而已。再看一遍，您不仅可以看到一次描述一个函数的库，还可以看到对配置文件的介绍。如果你想做你自己的主题调整和小工具，可以从Aweseme的食谱页面开始。这里有许多记录良好且易于理解的小部件。理解AweseTM的附加组件不需要学习Lua编程语言，因为它们可以保持代码的简单性。\n对于Regolith的帮助，分发页面非常棒。有关更高级的内容，请查看i3文档。有大量的视频和页面让人们炫耀他们的桌面。还有一个很棒的文档页面，您可以在那里找到您需要的包。\n当您使用标准桌面、Gnome和KDE时，您可能会注意到您正在使用大量内存。在某些情况下，CPU负载也会快速增加。一旦您启动了几个应用程序，系统就会开始在它们之间进行交换，这会导致速度变慢，有时还会挂起。\n如果您还没有注意到，在尝试您的选择时，请尝试在单独的窗口中运行HTOP。你应该会发现AweseI3和DWM有很大的不同，如果你是精英的话。\n当您开始测量时，内存占用的差异是惊人的。GNOME在引导时从大约3 GB的某个地方开始。这可以通过认真的调整来减少，但不会太多。相比之下，令人敬畏的窗口管理器只有600MB左右。\n不过，获得优势是有代价的：您需要学习一些使用AweseDesktop环境的新习惯。在平铺窗口管理器的情况下，您必须使用键盘快捷键在窗口之间移动。在Regolith中，您还可以使用dmenu、drun或rofi启动所有应用程序。\n你可以用组合键到达这些位置。你对这一变化感到不舒服是可以理解的--使用鼠标的习惯往往根深蒂固。但是，即使你最终没有切换到一个新的环境，培训的努力也是有价值的，因为你还学会了寻找键盘快捷键，这对Vi和Emacs等单独的应用程序很有帮助。\n赢家：超棒的台式机环境。你可以在你和其他人一样拖累你的系统之前，放上很多眼花缭乱的东西和守护程序。\n在GNOME中，您有一个扩展框架。您基本上是在使用JavaScript制作网页-尽管这过于简单化了。您在其页面上有大量可用的扩展集。与您的桌面和浏览器的集成使事情变得更加简单。\n如果你想做你自己的GNOME扩展，你需要学习如何用JavaScript编程，JavaScript是Web开发人员非常常用的语言。对于某些扩展，您可能会遇到性能问题，但是在安装之前阅读评论，您就会没事的。\n如果您更喜欢使用KDE作为您的Linux桌面管理器，您可以在它的存储中查找扩展；您可以让一切看起来都像GNOME，并将许多小部件放到您的桌面上。甚至可以使用桌面上的Get New Widgets选项下载它们。在KDE中，扩展称为胞质，并使用CMake进行编译。您仍然需要了解JavaScript，但还需要添加QML。\n肉桂香料也是用JavaScript编写的。网站有大量的选择，所以你还是被宠坏了。这些都很棒，但是如果你想要一个更精简的设置，你需要扩展AweseTM或Regolith。AWOWE没有小部件系统-相反，您可以使用配置文件运行常规的Linux命令和应用程序。\nStreetturtle的电子邮件小部件就是一个很好的例子。它从监视Python程序的Lua脚本开始。Python程序会一直检查您的电子邮件。虽然这需要更好的编程技能，但使用任何编程语言来实现您的目标都很容易。要下载其他人的小部件，请查看https://awesomewm.org.。Regolith同样使用常规脚本进行扩展，但也与GNOME集成，但不与GHOME Shell集成。\n赢家：KDE拥有最强大的扩展生态系统，但GNOME和Cinnamon紧随其后。\n加上所有的扩展，本综合报道中的所有竞争者都有大量的主题。在GNOME中，您可以为不同的类别选择主题：应用程序、光标、图标、外壳和声音。它们位于单独的文件中，并且对组件使用CSS。\n您还可以在GHOME中使用许多SVG文件来表示动画。这使得在下载现有主题后安装它们变得很容易。您将无法从安装工具进行搜索，而在KDE中，您可以直接从您的工具在官方网站上搜索这些内容。\n在GNOME中，您可以使用扩展网页添加新的扩展。它有一个本地部分，显示您当前安装的扩展。如果您放入的内容太多，或者您怀疑其中一个会使系统崩溃，您可以将它们全部关闭，然后从头开始，而不删除它们。\n在KDE中，有一个专门的应用程序，只用于添加新的主题和桌面元素。这稍微好一点，但是有其他解决方案可以将所有内容保存为单个文件。存储库很大，所以你会把大部分时间花在寻找你自己的个人风格上。如果您制作了任何网页，这些文件本身就很容易理解，因为它们是用CSS或JavaScript制作的。\n很棒的桌面环境使用Lua语言，大多数人只需阅读文件就能理解。这种更改外观的方式比较麻烦，至少对于非程序员来说是这样。当然，我们的想法是，开发人员和其他经常使用命令行的人是主要用户。因此，配置文件是脚本。\n在Awesom中，Lua脚本调用其他脚本或二进制文件。当您习惯它时，这实际上会更快，但普通用户最初将面临相当陡峭的学习曲线需要克服。\n要配置Regolith，请将默认的i3配置文件从/etc/regolith/i3/config复制到您的主目录~/.config/regolith/i3/config。该文件是纯文本文件，您可以在其中设置i3的参数。\n赢家：KDE有一个专门的应用程序，用于配置操作系统的外观，以及大量的主题。\n在这场对决中，我们已经向您展示了一种选择最佳Linux桌面环境的方法，所以现在轮到您尝试并自行决定了！使用计算机时，您有许多不同的任务或操作。您可以工作，在这种情况下，您有一个工作流程。您使用计算机的方式会影响您要使用的桌面环境，使其成为非常个人化的选择。\n您可能会发现最好在GNOME、KDE或Cinnamon上工作，因为这些都是最流行的发行版中的默认桌面环境。它们还包括所有不错的功能和扩展，同时很容易上手。您可以看到您的应用程序，并有符号告诉您可以做什么。其中最精致的是KDE。它也是这一串中装饰性最强、用途最广的。不过，这是要付出代价的。\n肉桂在延展性和易用性之间取得了最好的平衡，同时它也是快速和灵敏的。同时，它对资源的消耗也不是那么重。您还可以添加各种小部件形式的扩展，这些小部件可以向您发送持续和更新的信息。\nRegolith需要更多的训练，但是它会自动为您设置，这样您就可以继续使用GNOME了。然而，添加扩展和其他小工具有点棘手。如果您决定选择平铺窗口管理器，可能是考虑到桌面的简单性，以及它提供的低资源使用率。\n使用Awesom，您必须设置并练习才能使用它！它很容易成为团队中最难入门的。当您启动并运行时，从资源的角度来看，Awesom确实提供了最大的好处。尽管基于文本的系统建立了令人敬畏的WM，但要进入它并不是那么有挑战性。有了很多例子和大量的教程，即使是很小的努力也会导致一个强大的，快速的桌面，这是你喜欢的。\n总冠军：肉桂。在这场对峙中，你可以看到，决定最好的桌面环境并不完全客观。不过，权衡之下，这里的最佳选择是肉桂，因为它将用户体验、性能和定制化很强地结合在一起。\n\n..", "note_en": "When you start out with Linux, you may judge your distribution by its desktop environment. For this Roundup we’ve going to take a closer look at what designers consider when they design a desktop. The “environment” is the window manager combined with the other elements you may have on your desktop. These are task bars, icons and sometimes active elements on your desktop.\n Designers make Linux desktop environments to appeal to all users. You may not be a generic user. While you read this, consider what your preferences are. The two most popular desktop environments are GNOME and KDE. They have different philosophies. For GNOME (Gnu Network Object Model Environment), it is to keep things available but not visible. KDE (K Desktop Environment) chooses to stick with the menus at all times. The third most popular Linux desktop environment is Cinnamon.\n  Your choice of Linux desktop environment comes down to personal taste, though what you are working will have the biggest influence on your final decision. Your choice will have a lot to do with whether you are typing a lot or doing graphic work. For example, programmers may appreciate the bare look of tiling window managers, because they’ll have to lift their hands off of the keyboard less.\n To help you pick the right Linux desktop environment for your needs, we’ve put five of the most popular desktop environments up against each other in a no-holds-barred, seven-round face-off. We’ve rated   GNOME,  KDE,   Cinnamon,   Awesome and   Regolith on a 10-point scale based on Installation, Applications, User Experience, User Documentation, Performance, Extensions and Configurability.\n  Linux distribution maintainers tend to choose a specific desktop environment when they start. This does not lock you into a specific one just because you chose, for example, Ubuntu, but installing another desktop will need a lot of software. This software is the foundation that implements all the graphical components, such as frames, buttons and menus. The major packages also have projects that create specific applications that match the look of their own desktop. Many of these can be used in other environments in case you have fallen for a particular one. It will give a little inconsistency graphically but works well.\n The Plasma project from KDE has many such projects, so if you have a GNOME desktop and want to switch you may end up with a multi gigabyte install. If you choose to install all recommended packages, you will have access to the ‘K’ applications. These are great applications but on each system, you should choose either GNOME or KDE to avoid disc space waste. Of course, you have many other options which can really mess up your settings.\n  Cinnamon, meanwhile, doesn’t require anything from its GNOME ancestor – it has replaced it all with its own packages. You can install many of the minimal ones with your package manager. Suckless dwm is an alternative minimal option that needs to be compiled from source and changed to your settings.This is actually easy to do, the tricky part is to configure it to your liking. To get some inspiration, check out the   build of Luke Smith.  You need to add a few programs and compile them yourself which means that you should be fluent with compiling software and handling patches.\n Awesome comes with a basic setup and is easier to customize, because there are many themes available.  It is also available in your repository as a fresh version.\n Regolith comes in an impressive state – it is easy to install and has decent defaults. It requires Gnome, however, because it replaces gnome-shell, which draws down the impression. You also need to be careful when you try it out together with GNOME. You may find that there are some changes to your gnome-shell session after first testing Regolith.\n    Some applications rely heavily on the window manager to handle their windows. When you choose a window manager, you need to consider if your applications can handle your whole workflow. Popular image editor GIMP is an example of a program that can cause problems when you use the tools in an undocked mode. In the case of GIMP, you have an option to have all tools inside the application, called single-window mode. When running office packages, they usually do fine unless they are made especially for the environment.\n KDE has many projects that need the desktop environment to operate. Watch out for programs that are spelled with a ‘K’ for no apparent reason. They are usually made for KDE. With that said, most of them work across platforms. Don’t switch until you know you have to.\n If the whole tiling windows thing does not suit you very well, do not consider Awesome, Regolith or the do-it-yourself Suckless dwn. They can do floating windows but not very well.\n DWM can handle most situations, but you may have problems with application size exceeding the screen in a dual head setup.\n The same happens in Awesome if you have different resolutions on the second screen. This is not a big problem for most applications. It is worth it if you feel you can save on memory usage.\n The most important thing you need to consider is if you want all the notifications that come with the three big Linux Desktop Environments (GNOME, KDE and Cinnamon). You can take them with you, with some tweaking.\n  Winner: Tie (GNOME, KDE and Cinnamon). The three largest Linux desktop environments all have strong application support.\n   Current Linux desktop environments have been designed to appeal to a large audience. GNOME has a lot of nice eye candy and its extensions serve you with the weather, mail notifications and, almost anything you need from the internet. In KDE you’ll find a different philosophy but you can still get lots of widgets to add to your desktop. The idea of a button at the lower right corner of the desktop was, for a long time, unavoidable. When the GNOME developers decided to challenge this idea, many users were aghast.\n This is one reason Cinnamon exists. The other contestants tested here use the idea that anything can be thrown out if you have another solution. Enter the tiling, minimalist desktop environments; dwm, awesome and regolith. With the dwm team, the whole philosophy is to add nothing until the user decides to. You have to be the one who decides about this.\n   The biggest difference between the big Linux desktop environments has been whether you should have menus for everything or find other ways to locate applications. GNOME has taken the path away from a compulsory drop-down or pop-up menu, instead allowing search to do the job. As default, GNOME comes with a top-bar that shows the date and your chosen extensions. When you need to start an application, you start a text search or you bring up the grid of applications where you can choose.\n There are extensions to add an application drop-down menu, you can also add ‘Places’ to see different directories for your data. GNOME is easy to use even if you do not agree with their initial choice to banish drop-down menus. You can also add many extensions to keep you updated. To improve the desktop environment’s appearance, you also have many themes that you can choose from. The cost is high memory usage.\n   The philosophy of the KDE Linux desktop environment has always been to use known concepts and enhance them. This is why they have a menu bar, start box and list of applications. If you like consistency, KDE Plasma is for you. The system is still very innovative so you will not lack new features.\n At first glance, you may think that the interface is inflexible, but that is not true.\n You can set your task-bar at any place on the screen and you can style the desktop in many ways. In fact, KDE is probably the best option for emulating the look of the other operating systems. You have widgets for the desktop and you can also add a dock anywhere on the screen to make it look all macOS. Since KDE’s design philosophy is conservative, standard settings make the interface primarily mouse-driven, so if you want to stick your fingers to the keyboard and never use a pointing device, go elsewhere.\n   Cinnamon started as a reaction to GNOME 3.0. The designers of Cinnamon liked the application launcher while the GNOME team moved away from that, so they started a project to add it again with extensions. The project grew extensions and is now its own window manager.\n On this desktop, you have the traditional corner menu button for applications. You also have a right-click menu anywhere on the desktop and widgets for weather, etc. You will find this desktop comfortable if you like the taskbar and start button.\n You can choose a theme that looks like Windows. In Cinnamon, you have ‘spices’ that enhance your desktop. They are themes, applets, desklets and extensions. You can easily fill your screen with decorations and useful things. These are both interactive and simple displays of info, like your CPU, music player, etc.\n   Awesome has many themes available and is easier to use than more extreme window managers like dwm. Once you have it running, you can tile everything, but you don’t have to. Starting applications with a key-chord and typing in part of the application’s name is possible, but you can also use a dropdown menu. This menu appears where the cursor is and shows all the applications available. You can drag your windows across the screen until you get used to tiling techniques.\n Most applications run well under Awesome, so your work will be smooth. When you pick a theme, look through the configuration files to find dependencies. The files are in the Lua language, which you will be able to follow even with limited programming experience. Some problems may result from the fact that it takes many features from regular Linux – dmenu and rofi are examples you may need.\n    Regolith is a preconfigured version of i3 – it still runs GNOME but replaces gnome-shell. This means that you are running all applications that auto start in GNOME. The desktop is, by default, tiled and you use the key-chords of i3 to navigate and keep your running applications organised. However, you have the option to use floating applications. You also have a taskbar at the bottom to show the status of your network, battery and more.\n Getting used to the bindings in Regolith Linux desktop environment takes a while, so look through the manual for key-bindings and set a training schedule. You will quickly get tired of the beginner confusion otherwise.\n Regolith is very easy to use but does not save much resources from your machine. To make the transition, you need a plan to learn new habits. Otherwise, you will soon notice that you keep doing the same thing as you did before on your old desktop environment\n Winner: Tie. GNOME, Cinnamon and KDE all score 9 out of 10 for user experience.\n   Documentation is absolutely necessary, but many maintainers and coders hate writing it. For the major Linux desktop environments, you have great documentation thanks to big organisations. Canonical has the GNOME version of Ubuntu, so you will find a lot on their website. GNOME also has a great site that is split between users, administrators and developers.\n  To find any help for Cinnamon, start from the   Linux Mint website– there are numerous PDF documents available.Development happens on GitHub. You can find most information on the spices page. If you want to make extensions, find links at the   Cinnamon github page. Just as in GNOME, extensions are written in JavaScript.\n At first glance, Awesome’s website has a link to the man page, and that is it. Look again and you see not just the libraries described one function at a time, but also an introduction to the configuration file. If you want to make your own theme tweaks and widgets, start at   Awesome’s recipe page. There are many widgets here that are well documented and easy to understand. Learning the Lua programming language is not necessary to understand Awesome’s add-ons, since they keep the code simple.\n For help with Regolith, the distribution page is great. For more advanced stuff, look for i3 documentation. There are loads of videos and pages where people show off their desktops. There is also a   great documentation page where you can find packages you need.\n    When you use the standard desktops, Gnome and KDE, you will likely notice that you are using a lot of memory. In some cases, the CPU load also increases quickly. As soon as you start several applications, the system will start swapping between them, which leads to slowdowns and sometimes hangs.\n If you haven’t noticed yet, try running htop in a separate window while you try out your choices. You should see a substantial difference with Awesome, i3 and, if you are elite, dwm.\n The difference in memory footprint is staggering when you start measuring. GNOME starts with somewhere in the region of 3GB at boot. This can be trimmed down by serious tweaking, but not very much. In comparison, the Awesome window manager weighs in at around 600MB.\n Getting the advantage comes at a cost, though: you need to learn a few new habits to use Awesome desktop environment. In the case of the tiling window managers, you have to use keyboard shortcuts to move between windows. In Regolith, you also start all applications with dmenu, drun or rofi.\n You reach these with a key combination. You will be forgiven for feeling uncomfortable about this change – the habit of using the mouse often sits deep. But even if you end up not switching to a new environment, the effort of training is valuable, since you also learn to look for keyboard shortcuts, which helps in individual apps such as Vi and Emacs.\n Winner: Awesome desktop environment. You can put a lot of eye candy and daemons before you weigh down your system as much as the others.\n   In GNOME, you have a framework for extensions. You are basically making webpages using JavaScript – though this is an oversimplification. You have a huge collection of extensions available on its pages. The integration with your desktop and browser makes things even easier.\n If you want to make your own GNOME extensions,you need to learn how to program in JavaScript which is a very common language for web developers. For some of the extensions, you may run into performance problems, but read the reviews before you install and you’ll be OK.\n If you prefer to use KDE as your Linux desktop manager, you can look in its store for extensions; you can make everything look like GNOME and put many widgets on your desktop. They are even available to download using the Get New Widgets option on the desktop. In KDE, extensions are called plasmoids and are compiled with CMake. You still need to know JavaScript, but also add QML to the mix.\n  Cinnamon spices are also written in JavaScript. The website has a huge amount of choice, so you are still spoiled. These are all great, but if you go for a leaner setup, you have Awesome or Regolith to extend. Awesome doesn’t have a widget system-instead you run regular Linux commands and applications using your configuration file.\n A good example is the email widget by streetturtle. It starts with a Lua script that watches a Python program. The Python program keeps checking your email. While this requires better programming skills, it makes it easy to use any programming language to achieve your goal. To download other people’s widgets, look at   https://awesomewm.org. Regolith is likewise extended with regular scripts but is also integrated with GNOME, but not GHOME Shell.\n Winner: KDE has the most robust extension ecosystem, but GNOME and Cinnamon aren’t far behind.\n   Together with all the extensions, there are a huge number of themes for all the contenders featured here in this Roundup. In GNOME, you choose themes for different categories; applications, cursor, icons, shell and sound. They come in separate files, and they use CSS for the components.\n You also have many SVG files in GHOME to represent the animations. This makes it easy to install existing themes after you have downloaded them. You will not be able to search from the install tool, while in KDE you can search the official site for these things straight from your tool.\n In GNOME, you can add new extensions using the extensions webpage. It has a local section that shows your currently installed extensions. If you put in too many or you suspect that one is crashing your system, you can turn off all of them and start from the beginning without removing them.\n In KDE there is a special application just for adding new themes and desktop elements. This is a little better, but other solutions exist to save all of it as a single file. The repositories are huge, so you will spend most of your time looking for your own personal style. The files themselves are easy enough to understand if you have made any webpages, as they are either made with CSS or JavaScript.\n  Awesome desktop environment uses the Lua language, which most people should be able to figure out just by reading the files. This way of changing the look is a bit more cumbersome, at least for non-programmers. The idea, of course, is that developers and others who use the command line a lot are the primary users. As a consequence, the configuration files are scripts.\n In Awesome, Lua scripts call other scripts or binaries. When you get used to it, this is actually faster, but regular users will face a fairly steep learning curve to overcome initially.\n To configure Regolith, you copy the default i3 configuration file from  /etc/regolith/i3/config to your home directory  ~/.config/regolith/i3/config. The file is a straight text file where you set parameters for i3.\n Winner: KDE has a dedicated application for configuring the look and feel of your OS, along with plenty of themes.\n   In this face-off, we have shown you a way of choosing the best Linux desktop environment, so now it is your turn to try them out and decide for yourself! When using your computer, you have many different tasks or actions. You may do work, in which case you have a workflow. The way you use the computer affects which desktop environment you want to use, making it a very personal choice.\n You are probably going to find it best to work on GNOME, KDE or Cinnamon, because these are the default desktop environments in the most popular distributions. They also include all the nice features and extensions, while being easy to get started with. You can see your applications and have symbols that tell you what you can do. The most polished of these is KDE. It is also the most decorative and versatile of the bunch. This comes at a cost, though.\n Cinnamon has the best balance between extensions and ease of use, while it is also fast and responsive. At the same time, it is not that heavy on resources. You can also add a wide range of extensions in the shape of widgets that send you ongoing and updated information.\n Regolith requires a bit more training, but it does set itself up for you so you can continue as you did with GNOME. Adding extensions and other gadgets is a bit more tricky, however. If you decide to choose a tiling window manager, it will probably be for the simplicity of the desktop, as well as the low resource usage it offers.\n With Awesome you have to set up and practice to use it! It’s easily the hardest in the group to get started with. When you are up and running, Awesome does deliver the most benefits from a resource point of view. Despite the text-based system of setting up the Awesome WM, it is not that challenging to get into. With many examples available and tutorials aplenty, even a little effort will  lead to a strong, fast desktop that is to your liking.\n Overall Winner: Cinnamon. In this face-off, you can see that deciding on the best desktop environment is not entirely objective. However, on balance, the best choice here is Cinnamon because of its strong combination of user experience, performance and customization.\n      \n......", "posttime": "2020-05-10 21:26:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,桌面环境,desktop", "title": "Linux桌面环境对决：哪种GUI最好", "title_en": "Linux Desktop Environment Face-Off: Which GUI Is Best", "transed": 1, "url": "https://www.tomshardware.com/news/linux-desktop-environment-face-off", "via": "", "real_tags": ["linux", "桌面环境", "desktop"]}, {"category": "", "categoryclass": "", "imagename": "b0ad618b2cffc8336a551b2d849be987.jpg", "infoid": 1001510, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特斯拉是加州最后一家主要汽车制造商，也是该州最大的制造业雇主，我们的弗里蒙特工厂拥有超过10,000名员工，全州拥有20,000名员工。我们理解冠状病毒造成的影响，并有责任注意我们人员的生计和安全，他们中的许多人依赖我们，由于就地避难所订单的影响，他们已经失业数周。\n鉴于州长最近的指导-有科学和可信的健康数据支持，州和联邦政府将车辆制造归类为国家关键基础设施，以及我们强有力的安全计划-特斯拉已经启动了恢复运营的进程。我们的员工很高兴能重返工作岗位，我们这样做是考虑到他们的健康和安全。\n我们正在做的重启计划是几个月来精心计划和准备的结果。它是以我们在上海巨型工厂制定的全面重返工作计划为蓝本的，在过去的三个月里，我们看到了平稳健康的运营。\n我们正在花时间让我们的人员在开始工作之前接受适当的培训，所有员工在返回任何特斯拉工厂工作之前都必须完成在线视频培训。我们对所有地点都有一个全面的重返工作计划。包括一名内部医生在内的跨职能响应团队每天都在根据地点和工作特定的风险评估制定健康和安全指南，我们正在持续审查我们的流程，以确保它们在这个新环境中为我们的员工工作。\n早在3月份，我们就在每个地点进行了风险评估，考察人们如何以及在哪里工作，他们如何互动，以及需要采取哪些措施来满足安全标准。在某些情况下，我们添加了分隔或障碍来分隔工作区，并通过将部件放置在离生产线上完成任务的位置更近的位置来最大限度地减少员工交互。我们还需要额外的个人防护设备，以及严格的清洁和消毒方案。\n我们的重返工作岗位手册详细介绍了我们为确保员工安全而采取的全面安全措施。\n为什么我们要重启特斯拉并不是一个异类，也不是与我们背道而驰的。从该州第一个就地避难所命令开始，国家关键基础设施，包括像特斯拉的弗里蒙特工厂这样的汽车制造，被认为是至关重要的，并获准继续运营。总督在本周明确表示应恢复生产时，重申了这个方向。\n此外，至少有三个同样情况的邻近县已经重新启动了包括制造业在内的经济，包括索拉诺、纳帕和圣华金三县。与此同时，我们工厂所在的阿拉米达县和隔壁的圣克拉拉县在他们的返工令常见问题解答中表示，允许恢复制造分布式能源资源(州法律定义包括电动汽车、太阳能和电池存储)。\n我们如何与县合作与州长最近的指导和弗里蒙特市的支持相反，阿拉米达县坚持我们不应该恢复运营。这并不是因为我们没有尝试或缺乏透明度，因为我们已经与阿拉米达县卫生保健服务机构会面并就我们的重启计划进行了合作。不幸的是，做出这些决定的县公共卫生官员没有回复我们的电话或电子邮件。\n下面的列表只是我们与市县官员分享的一些信息：温度筛查协议，以及当我们恢复长途班车路线时增加温度筛查的承诺。\n工厂布局面积为600万平方英尺，以说明员工分布在我们600万平方英尺的设施中的情况。\n休息室容量(因社交距离而减少)和基于工作区的每个房间的人数。\n我们将继续以安全、负责任的方式让群众重新就业。然而，该县的立场让我们别无选择，只能采取法律行动，以确保特斯拉及其员工能够重返工作岗位。我们在5月9日提起诉讼，要求法院宣布县命令无效，县政府声称这些命令阻止了特斯拉恢复运营。", "note_en": "Tesla is the last major carmaker remaining in California, and the largest manufacturing employer in the State with more than 10,000 employees at our Fremont factory and 20,000 statewide. We understand the impacts COVID-19 has caused and have a responsibility to look out for the livelihoods and safety of our personnel, many of whom rely on us and have been out of work for weeks due to the impacts of shelter-in-place orders.\n Given the Governor’s recent guidance, which is supported by science and credible health data, the state and federal government’s classification of vehicle manufacturing as national critical infrastructure, and our robust safety plan, Tesla has started the process of resuming operations. Our employees are excited to get back to work, and we’re doing so with their health and safety in mind.\n What We’re Doing Our restart plan is the result of months of careful planning and preparation. It was modeled after the comprehensive return to work plan we established at our Shanghai Gigafactory, which has seen smooth and healthy operations for the last three months.\n We are taking the time we need to get our personnel properly trained before they begin work and all employees must complete an online video training before returning to work at any Tesla facility. We have a thorough return-to-work plan for all locations. A cross-functional response team, including an in-house physician, has been working daily to establish health and safety guidelines based on location- and job-specific risk assessments, and we are continuously reviewing our processes to ensure they work for our employees in this new environment.\n  Back in March, we conducted risk assessments at each site, looking at how and where people work, how they interact, and what measures are needed to meet safety standards. In some cases, we have added partitions or barriers to separate work areas and minimized employee interactions by positioning parts closer to where that task is completed on the line. We are also requiring additional personal protective equipment, along with rigorous cleaning and disinfecting protocols.\n Our  Return to Work playbook details the comprehensive safety measures we have introduced to ensure employee safety.\n Why We’re Restarting Tesla is not an outlier, nor are we going against the grain. From the State’s very first shelter-in-place order, national critical infrastructure, including vehicle manufacturing like Tesla’s Fremont factory, was considered vital and given permission to continue operating. The Governor repeated this direction this week when he made clear manufacturing should resume.\n In addition, at least three neighboring counties in the same situation have already restarted their economies including manufacturing, including Solano, Napa, and San Joaquin Counties. Meanwhile, Alameda county, where our factory resides, and Santa Clara County next door, have stated in their return to work order FAQs that the manufacturing of distributed energy resources (which is defined in state law to include electric vehicles, solar and battery storage) is permitted to resume.\n How We’ve Worked with the County Contrary to the Governor’s recent guidance and support from the City of Fremont, Alameda County is insisting we should not resume operations. This is not for lack of trying or transparency since we have met with and collaborated on our restart plans with the Alameda County Health Care Services Agency. Unfortunately, the County Public Health Officer who is making these decisions has not returned our calls or emails.\n The list below is just some of the information we’ve shared with city and county officials: Temperature screening protocol plus a commitment to add temperature screening when we resume long-distance shuttle routes\n    Factory layout with square footage to illustrate on how people are spread out across our 6 million square foot facility\n  Break room capacities (reduced for social distancing) and numbers of people in each room based on work area\n We will continue to put people back to work in a safe and responsible manner. However, the County’s position left us no choice but to take legal action to ensure that Tesla and its employees can get back to work. We filed a lawsuit on May 9 asking the court to invalidate the County Orders, to the extent the County claims they prevent Tesla from resuming operations.", "posttime": "2020-05-10 20:44:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "工作岗位,work,员工", "title": "回到工作岗位上来", "title_en": "Getting Back to Work", "transed": 1, "url": "https://www.tesla.com/blog/getting-back-work", "via": "", "real_tags": ["工作岗位", "work", "员工"]}, {"category": "", "categoryclass": "", "imagename": "34407b8a5d5bf39e009ee62c3eb89931.png", "infoid": 1001509, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几年里，机器翻译领域发生了一场革命。使用深度学习构建的新翻译系统已经取代了语言学家使用数十年的统计学研究构建的旧系统。流行的翻译产品，如谷歌翻译，已经改变了它们的内部结构，用新的深度学习模型取代了旧的代码。\n这对每个人都很好。深度学习的方法不仅更准确，而且不需要你有语言学的研究生学位就能理解。从理论上讲，这很简单，任何有足够训练数据和计算机能力的人都应该能够建立自己的语言翻译系统。尽管如此，自己构建翻译系统仍然很困难，因为对于普通的卧室爱好者来说，所需的数据量和计算能力是令人望而却步的。\n但就像机器学习中的其他一切一样，机器翻译正在迅速成熟。工具越来越容易使用，GPU变得越来越强大，培训数据也比以往任何时候都更加丰富。现在，您可以使用现成的硬件和软件构建语言翻译系统，该系统足够好，可以在实际项目中使用。最棒的是，你不需要向谷歌支付任何API费用就可以使用它。\n那我们就开始吧！让我们构建一个西班牙语到英语的翻译系统，它可以高精度地翻译“来自野外”的文本！\n我们翻译系统的核心将是一个神经网络，它接收一个句子，并输出该句子的翻译结果。我以前写过机器翻译系统的历史，以及我们如何使用神经网络翻译文本，但这里是简短的版本：\n神经翻译系统实际上是两个端到端相互连接的神经网络。第一神经网络学习将单词(即句子)序列编码成表示其含义的数字阵列。第二个神经网络学习将这些数字解码成意思相同的单词序列。诀窍是编码器接受一种语言的单词，而解码器输出另一种语言的单词。因此，实际上，该模型通过中间数字编码学习从一种人类语言到另一种人类语言的映射：\n为了对句子的意思进行编码和解码，我们将使用一种特殊类型的神经网络，称为递归神经网络。标准的神经网络没有记忆。如果您给它相同的输入，它每次都会得到相同的结果。相反，递归神经网络之所以称为递归，是因为上一次输入会影响下一次预测。\n这很有用，因为句子中的每个单词都不是单独存在的。每个词的意思取决于它在句子中的上下文。通过让句子中的每个词影响下一个词的值，它允许我们捕捉到一些上下文。\n因此，如果你向神经网络显示单词“my”、“name”、“is”，然后要求它对单词“Adam”的含义进行编码，它将使用前面的单词“知道”来表示单词“Adam”作为一个名称的含义。如果您想了解更多有关其工作原理的详细信息，请查看我之前的文章。\n如果你精通机器学习，一提到递归神经网络，你可能会打哈欠。如果是这样，请跳到下面的Linux shell命令，开始训练您的模型。我明白，机器学习是一个快速发展的领域，几年前还是绝对革命性的东西现在已经是古老的新闻了。\n事实上，还有一种更新的语言翻译方法，它使用一种名为Transformer的新型模型。转换器模型进一步尝试通过对每个单词之间的交叉关系建模来捕捉句子中每个单词的上下文含义，而不是仅仅考虑单词的顺序。我也写过关于变形金刚模型的文章，但是我们将在这个项目中使用递归神经网络来保持训练时间的合理性。别担心，成绩还是会很好的！\n很好，那么我们将使用两个递归神经网络来翻译文本。我们将训练第一个人用西班牙语编码句子，训练第二个人把它们解码成英语。如果你相信我的Reddit评论，每个拥有Python副本的高中生都已经知道如何创建递归神经网络，所以是时候开始了，对吗？\n还没那么快!。我们需要一种策略来处理杂乱无章的真实数据。人类非常善于在没有任何帮助的情况下从混乱的数据中提取信息。例如，你可以毫无问题地读到这句话：\n对格式完美的文本进行训练的神经网络不会知道这是什么意思。神经网络没有能力推断出它们在训练数据中看到的东西。如果神经网络以前从未见过世界上的“计算机”，它不会自动知道它与“计算机”的含义相同。\n解决方案是将文本标准化-我们希望尽可能多地删除格式差异。我们将确保单词在相同的上下文中总是以相同的方式大写，我们将修复标点符号周围的任何奇怪的格式，我们将清理MS Word随机添加的任何奇怪的卷曲引号，等等。整个想法是确保相同的句子总是以完全相同的方式输入，无论用户如何键入。\n请注意，无论用户的Shift键工作得多么糟糕，“他访问了伦敦”这句话是如何以同样的方式规范化的。注意，London总是大写，而其他单词不大写，因为它通常用作专有名词。确保文本格式清晰，这将使神经网络的工作变得容易得多。\n下面是我们的整个翻译管道的外观，说明我们要翻译的文本，并以翻译的版本结束：\n首先，我们需要把课文分成几个句子。我们的神经网络一次只能翻译一个句子，如果我们试图一次输入整个段落，结果会很差。\n将文本拆分成句子似乎很容易，但实际上这是一项棘手的任务，因为人们可能会以各种不同的方式嵌套标点符号和格式。对于这个项目，我们将使用一个用Python编写的简单句子拆分器来减少您需要安装的第三方库的数量。但是NLP库(如Spacy)包括复杂的句子拆分模型，如果这不能满足您的需要，您可以使用这些模型。\n接下来，我们将执行文本规范化。这是最难做好的部分，如果你在这一步上偷工减料，最终的结果将会令人失望。一旦我们有了规范化的文本，我们就会把它提供给翻译模型。\n请记住，您还需要颠倒文本规范化和句子拆分步骤来生成最终翻译。所以我们有一个反规范化的步骤，然后一个将文本重新组合成句子的步骤。\n我们将使用Python3编写粘合代码来规范化文本、执行转换并输出结果。\n您可能会认为我们会使用TensorFlow或PyTorch这样的通用机器学习框架来实现我们的翻译模型。取而代之的是，我们将使用Marian NMT，这是一个专门为机器翻译设计的基于C++的机器学习框架，主要由微软翻译团队开发。它已经内置了几个神经翻译模型架构。\nTensorFlow和PyTorch非常适合实验和尝试新的神经网络设计。但是，一旦您弄清楚了模型体系结构，并且您正在尝试扩展您的设计来处理现实世界的用户，您就不再需要通用工具了。\nMarian NMT是一个专门的工具，旨在方便快捷地构建生产级翻译系统。这里没有必要重新发明轮子。这是一个例子，说明了随着机器学习从研究实验室进入日常使用，软件是如何变得更加成熟的。\n要运行Marian，我们需要一台运行Linux的计算机。任何功能相当强大的计算机都应该可以工作。我用的是一台台式电脑，Ubuntu Linux18.04，英特尔i7CPU，内存32 GB。为了存储训练数据，我使用的是普通固态硬盘。\n重要的是，这台电脑有一个很好的NVIDIA GPU，有足够的显存。GPU承担着大部分的计算工作，所以这是你应该投资的地方。我使用的是一台内存为24 GB的英伟达泰坦RTX。至少，你需要一个显存至少为8 GB的GPU。其他不错的消费级GPU选择包括GTX 1080 Ti或GTX 2080 Ti。像NVIDIA Tesla或Quadro系列这样的服务器级图形处理器也可以使用。\n您可以将Marian与单个GPU或多个GPU并行使用以加快速度，但每个GPU都需要有足够的内存来单独保存模型和训练数据。换句话说，两个内存为4 GB的GPU无法取代一个内存为8 GB的GPU。\n尽管有微软的支持，但玛丽安还没有在Windows上运行。Mac OS也不受支持。所以，只管咬紧牙关，要么在你的计算机上安装Linux，要么考虑从你最喜欢的云提供商那里租用一台云中的Linux机器。\n我推荐为这个项目安装Ubuntu Linux18.04LTS。尽管最近发布了Ubuntu Linux20.04LTS，但更新GPU驱动程序和深度学习库以适应新的Ubuntu版本需要时间。不要尝试使用最新版本的Ubuntu，除非您愿意处理额外的麻烦并解决您自己的安装问题。\nNVIDIA的CUDA和cuDNN库使Marian能够利用您的GPU加速培训过程。因此，在我们继续之前，如果您尚未安装CUDA和cuDNN，则需要安装它们。\n在Ubuntu Linux 18.04上，我建议安装CUDA/cuDNN版本10.1。这些版本会很适合玛丽安。\n如果您安装了不同的版本，则必须调整下面的命令以与之匹配。NVIDIA臭名昭著，因为在新版本的CUDA中稍作改动会导致与旧软件的不兼容，所以如果您偏离了标准路径，请再次准备好进行您自己的调试。\n在编译Marian之前，您需要安装比Ubuntu18.04默认包含的更新版本的CMake。您还需要安装一些其他必备组件。\n不过，别担心，没什么大不了的。只需运行以下终端命令：\n#通过第三方repo安装较新的CMake wget-O-https://apt.kitware.com/keys/kitware-archive-latest.asc 2&gt；/dev/NULL|sudo apt-key add-sudo apt-add-pository&#39；deb https://apt.kitware.com/ubuntu/bionic Main-Get install cmake git build-Essential libBoost-all-dev。\n请注意，这些命令从第三方软件包存储库中提取软件包。因此，请检查命令正在执行的操作，以确保您对此没有问题。\n安装了这些必备组件后，运行以下命令下载并编译Marian(包括示例和帮助器工具，它们分布在不同的git repos中)：\n#下载并编译MARIAN CD~GIT CLONE https://github.com/marian-nmt/marian CD MARIAN MKDIR BUILD CD BUILD CMAKE-DCOMPILE_SERVER=ON-DCUDA_TOOLKIT_ROOT_DIR=/USR/LOCAL/CUDA10.1/.。Make-J4#抓取并编译Marian模型示例和辅助工具CD~/Marian/git clone https://github.com/marian-nmt/marian-examples.git CD Marian-Examples/CD Tools/Make。\n最后，我与Marian分享了我们将用来训练从西班牙语到英语的模型的脚本。它们基于Marian附带的罗马尼亚语翻译示例，但针对西班牙语到英语进行了修改，并扩展到更大的数据集。让我们抓住这些：\n#下载本文的西班牙语到英语脚本cd~/marian/marian-examples git克隆https://github.com/ageitgey/spanish-to-english-translation#安装我们将使用的稍后cd西班牙语到英语翻译的模块sudo python3-m pip install-r requirements.txt。\n您可以随意调整这些脚本，使其适用于您想要翻译的任何语言对。以拉丁语为基础的语言，如法语或意大利语，需要很少的修改，而不太相似的语言，如普通话，则需要更多的工作。\n为了训练一个翻译模型，我们需要数百万对完全相同的句子，只是它们已经被翻译成两种语言。这称为平行语料库：\n我们有的句子对越多，我们的模型就越能更好地学习如何翻译不同类型的文本。要创建一个工业实力模型，我们需要数千万个或更多的训练句子。最重要的是，这些句子需要涵盖人类表达的整个范围，从正式文件到俚语和笑话。\n一个糟糕的翻译系统和像谷歌翻译一样强大的翻译系统之间最大的区别是训练数据的数量和种类！幸运的是，在2020年，我们可以在很多地方找到意外创建的并行数据，并可以通过一些巧妙的技巧将其转化为训练句对。\n对于正式和法律文本，我们有欧盟的礼物。他们将法律文件翻译成成员国的所有语言，包括英语和西班牙语。沿着同样的思路，我们可以找到其他国际机构的交叉翻译的法律文本，如联合国和欧洲中央银行。\n对于历史写作，我们可以从翻译成不同语言的经典书籍中寻找句子对。我们可以选择版权过期的书籍，将这些作品的不同译本配对，以创建我们知道的表达相同事情的成对句子。\n对于非正式的交谈，我们有DVD的礼物。自20世纪90年代末DVD格式推出以来，几乎所有的电影和电视节目都包含了几种语言的机器可读字幕。我们可以将相同电影和电视节目的不同译本配对，以创建并行数据。同样的想法也适用于有字幕的较新内容，如蓝光和YouTube视频。\n现在我们知道在哪里可以找到数据，但要清理和准备这些数据仍然有很多工作要做。幸运的是，OPUS(开放平行语料库)上令人惊叹的人们已经完成了收集多种语言的句子对的工作。你可以在他们的网站上浏览和下载他们所有的平行句子数据。这将极大地加速我们的项目，因此请务必查看本文末尾对他们工作的引用。\n我们稍后运行的训练脚本将自动从OPUS下载这些数据源，为我们提供近8500万个零工作的翻译句子对。太棒了！\nOPUS按语言对提供文件。因此，如果您想创建芬兰语到意大利语的翻译模型，而不是西班牙语到英语，您可以通过下载该语言对的文件来实现。请记住，对于使用较少的语言来说，很难找到句子对。另外，请记住，有些语言需要独特的文本规范化方法，而本例中没有涉及这些方法。\n还要记住，这些数据来自不同的地方，质量各不相同。在这些下载中肯定会有一些坏的或重复的数据。当您处理庞大的数据集时，数据质量永远得不到保证，而且您经常需要亲自动手来查找和修复任何明显的问题。\n我包含的用于训练模型的脚本将自动下载并为您准备数据，但是如果您想要为不同的语言对构建翻译模型，那么有必要讨论一下涉及的步骤。\n我们从OPUS下载的每个数据源将包括两个文本文件。一个文本文件具有英语句子列表，而另一个文本文件以相同的顺序具有匹配的西班牙语句子列表。因此，我们将得到大量的文本文件，如下所示：\n合并：将所有英文文本文件合并为一个庞大的文本文件。同样，合并所有西班牙语文本文件，确保所有句子保持有序，以便英语和西班牙语文件仍然匹配。\n随机排列：随机排列每个文件中的句子顺序，同时保持英语和西班牙语文件中句子的相对顺序相同。混合来自不同来源的训练数据将有助于模型学习跨不同类型的文本进行泛化，而不是首先学习转换正式数据，然后学习转换非正式数据，等等。\n拆分：将每种语言的主数据文件拆分为培训、开发和测试部分。我们将在大量训练数据上训练模型，但保留一些句子用于测试模型并确保其工作。这确保了我们使用它在训练期间从未见过的句子来测试模型，因此我们可以确定它不只是记住了正确的答案。\n永远不可能获得涵盖每一个可能的单词的训练数据，因为人们总是在编造新词。为了帮助我们的翻译系统处理从未见过的单词，我们将使用一种称为子词切分的方法。\n子词切分是将单词分成更小的片段，并教导模型在每个单词的每个片段之间进行翻译。人们希望，如果模型看到一个它以前从未见过的单词，它至少可以尝试通过翻译组成这个单词的子词来猜测该单词的意思。\n假设我们的训练数据包含单词Low、Low、Newer和Wide。我们可以把单词分成词根和后缀：\n现在想象一下，我们被要求翻译最宽这个词。尽管该词从未出现在训练数据中，但模型将知道如何翻译WID和EST，因此通过将这两个子词翻译放在一起，它将能够很好地猜测最宽的意思。这不会总是完美的，但它在很多情况下都会工作得足够好，而且它会使翻译模型总体上更准确。\n我们将使用的子字分割的具体实现称为BPE，即字节对编码。你可以在最初的研究论文中读到它是如何工作的。\n要利用BPE，我们需要训练一个新的BPE模型来适应我们的训练数据集，然后我们将在文本规范化过程中包括一个额外的步骤，我们在该BPE模型中运行文本。同样，我们需要在反规范化过程中添加步骤，以重新连接最终翻译中被BPE模型拆分成单独单词的任何单词。\n下载培训数据、准备数据、创建BPE模型以及使用Marian培训实际翻译模型的整个过程都在一个脚本中。要启动所有操作，请运行以下命令：\n您可以查看run-me.sh脚本，了解每一步都发生了什么。它非常简单-它下载训练数据，合并它，将其正常化，然后启动Marian训练过程。\n如果您要构建生产级翻译系统，请随意将此脚本替换为您自己的实现。此脚本只是您需要执行的步骤的指南。\n在准备好数据并开始训练模型之后，您将看到如下所示的输出：\n[2020-05-01 10：09：23]EP.。1：向上。1000：参议员154,871：费用70.37619781：时间370.45秒：5024.86字/秒。\n这条消息说，我们目前处于第一个纪元(第一次通过训练数据)，到目前为止，模型已经更新了1000次，处理了154,871个句子对。\n70.3的成本值告诉您模型培训过程在找到最佳解决方案方面已经走了多远。成本为0.0将意味着模型是完美的，并且总是将训练数据中的任何西班牙语句子转换为完美匹配的英语翻译。这永远不会发生，因为。\n..", "note_en": "In the last few years, there has been a revolution in machine translation. New translation systems built using deep learning have replaced older systems built by linguists using decades of research in statistics. Popular translation products like Google Translate have switched their internals out and replaced their old code with new deep learning models.\n  This is great for everyone. The deep learning approach is not only more accurate, but it doesn’t require you to have a graduate degree in linguistics to understand. In theory, it’s simple enough that anyone with enough training data and computer power should be able to build their own language translation system. Despite this, it’s still been difficult to build a translation system on your own because the amount of data and computing power required was prohibitive for the average bedroom hobbyist.\n But like everything else in machine learning, machine translation is rapidly maturing. The tools are getting easier to use, GPUs are getting more powerful and the training data is more plentiful that ever. You can now build a language translation system using off-the-shelf hardware and software that is good enough to use in real projects. And best of all, you won’t have to pay Google any API fees to use it.\n So let’s do it! Let’s build a Spanish-to-English translation system that can translate text ‘from the wild’ with a high level of accuracy!\n  At the core of our translation system will be a neural network that takes in one sentence and outputs the translation of that sentence. I’ve  written before about the history of machine translation systems and how we use neural networks to translate text, but here’s the short version:\n A neural translation system is really two neural networks hooked up to each other, end-to-end. The first neural network learns to encode sequences of words (i.e. sentences) into an array of numbers that represent their meaning. The second neural network learns to decode those numbers back into a sequence of words that mean the same thing. The trick is that the encoder takes in words in one language but the decoder outputs words in a different language. So in effect, the model learns a mapping from one human language to another via an intermediate numerical encoding:\n  For encoding and decoding the meaning of a sentence, we’ll use a special type of neural network called a  recurrent neural network. A standard neural network has no memory. If you give it the same inputs, it comes up with the same result every time. In contrast,  recurrent neural networks are called recurrent because the last input influences the next prediction.\n This is useful because each word in a sentence doesn’t stand on its own. The meaning of each word depends on its context in the sentence. By letting each word in the sentence influence the value of the next word, it allows us to capture some of that context.\n So if you show the neural network the words “My”, “name”, “is” and then ask it to encode the meaning of the word “Adam”, it will use the previous words to know to represent the meaning of the word “Adam” as a name. If you want more details on how this works,  check out my earlier article.\n If you are well versed in machine learning, you might be yawning at the mention of recurrent neural networks. If that’s the case, skip down to the Linux shell commands below to start training your model. I get it, machine learning is a rapidly developing field and what was absolutely revolutionary just few years ago is  ancient news now.\n In fact, there’s an  even newer approach to language translation using a new type of model called a Transformer. Transformer models go further in trying the capture the contextual meaning of each word in a sentence by modeling the cross-relationships between every single word instead of just considering the order of the words.  I’ve written about Transformer models too, but we’ll use recurrent neural networks for this project to keep the training times reasonable. Don’t worry, the results will still be excellent!\n  Great, so we’ll use two recurrent neural networks to translate text. We’ll train the first one to encode sentences in Spanish and train the second one to decode them into English. And if you believe my reddit commenters, every high school student with a copy of Python already knows how to create a recurrent neural network, so time to get started, right?\n Not so fast! We need a strategy for handling messy, real-world data. Humans are very good at pulling information out of messy data without any help. For example, you can probably read sentence this without any problems:\n  A neural network trained on perfectly-formatted text would have no idea what that said. Neural networks don’t have the ability to extrapolate beyond what they’ve seen in their training data. If the neural net has never seen the world “cOMPuTERs” before, it won’t automatically know it means the same thing as “computers”.\n The solution is to  normalize the text — we want to remove as much formatting variation as possible. We’ll make sure that words always are capitalized the same way in the same context, we’ll fix any weird formatting around punctuation, we’ll clean up any weird curly quote marks that MS Word randomly added, and so. The whole idea is to make sure that the same sentence would always be fed in exactly the same way, no matter how the user typed it.\n  Notice how the sentence, “He visited London” is normalized the same way no matter how badly the user’s Shift key works. And notice that London is always capitalized while the other words aren’t because it is normally used as a proper noun. Making sure the text is cleanly formatted like this will make the neural network’s job a lot easier.\n Here’s what our full translation pipeline will look like, stating with the text we want to translate and ending with the translated version:\n  First, we need to split the text into sentences. Our neural network will only be able to translate one sentence at a time and it will produce poor results if we try to feed in an entire paragraph at once.\n Splitting text into sentences might seem easy, but it is actually a tricky task because of all the different ways someone could nest punctuation and formatting. For this project, we’ll use a simple sentence splitter written in Python to reduce the amount of 3rd-party libraries you need to install. But NLP libraries (like  spaCy) include sophisticated sentence splitting models that you can use if this doesn’t satisfy your needs.\n Next, we’ll perform text normalization. This is the hardest part to get right and if you skimp on this step, the final results will be disappointing. And once we have normalized text, then we’ll feed it to the translation model.\n Keep in mind that you also need to reverse the text normalization and sentence splitting steps to generate the final translation. So we’ll have a de-normalization step and then a step to recombine the text back into sentences.\n   We’ll use Python 3 to write the glue code to normalize text, perform the translation, and output the results.\n  You might have assumed that we’d use a general-purpose machine learning framework like TensorFlow or PyTorch to implement our translation model. Instead, we are going to use  Marian NMT, a C++-based machine learning framework specially designed for machine translation, mainly developed by the Microsoft Translator team. It has several neural translation model architectures already built-in.\n TensorFlow and PyTorch are great for experimentation and trying out new neural network designs. But once you figure out the model architecture and you are trying to scale up your design to handle real-world users, you don’t need a general purpose tool anymore.\n Marian NMT is a specialized tool designed to make it easy and fast to build production-level translation systems. There’s no need to reinvent the wheel here. This is an example of how software is getting more mature as machine learning moves from research labs into daily use.\n  To run Marian, we’ll need a computer running Linux. Any computer that is reasonably powerful should work. I’m using a desktop computer with Ubuntu Linux 18.04, an Intel i7 CPU and 32GB of RAM. For storing the training data, I’m using normal SSD hard drives.\n The important part is that the computer has a good Nvidia GPU with sufficient video memory. The GPU is doing the bulk of the computing work, so that’s where you should invest your money. I’m using an Nvidia TITAN RTX with 24GB of memory. At a minimum, you’ll want a GPU with at least 8GB of video memory. Other good consumer-level GPU choices include the GTX 1080 Ti or GTX 2080 Ti. Server-class GPUs like the Nvidia TESLA or Quadro lines will also work.\n You can use Marian with a single GPU or with multiple GPUs in parallel to speed things up, but each GPU needs to have enough memory to hold the model and training data on its own. In other words, two GPUs with 4GB of memory will not work in place of one GPU with 8GB of memory.\n   Despite being supported by Microsoft, Marian doesn’t yet run on Windows. Mac OS isn’t supported either. So just bite the bullet and either install Linux on your computer or consider renting a Linux machine in the cloud from your favorite Cloud provider.\n I recommend installing Ubuntu Linux 18.04 LTS for this project. Even though Ubuntu Linux 20.04 LTS was recently released, it takes time for GPU drivers and deep learning libraries to be updated for new Ubuntu releases. Don’t try to use the latest version of Ubuntu unless you are willing to deal with extra headaches and solve your own installation problems.\n  Nvidia’s CUDA and cuDNN libraries are what allow Marian to take advantage of your GPU to accelerate the training process. So before we go any further, you’ll need to install CUDA and cuDNN if you haven’t already.\n On Ubuntu Linux 18.04, I recommend installing CUDA /cuDNN version 10.1. Those versions will work great with Marian.\n  If you install a different version, you’ll have to adapt the commands below to match. Nvidia is notorious for making slight changes in newer versions of CUDA that cause incompatibilities will older software, so again be prepared to do you own debugging if you veer off the standard path.\n  Before you can compile Marian, you’ll need to install a newer version of CMake than is included with Ubuntu 18.04 by default. You’ll also need to install a few other prerequisites.\n But don’t worry, it’s no big deal. Just run these terminal commands:\n # Install newer CMake via 3rd-party repo wget -O -  https://apt.kitware.com/keys/kitware-archive-latest.asc 2&gt;/dev/null |  sudo apt-key add - sudo apt-add-repository &#39;deb  https://apt.kitware.com/ubuntu/ bionic main&#39; sudo apt-get install cmake git build-essential libboost-all-dev\n Note that these commands pull packages from a 3rd-party package repository. So check what the commands are doing to make sure you are OK with that.\n With those pre-requisites installed, run these commands to download and compile Marian (including the examples and helper tools, which are spread across separate git repos):\n # Download and compile Marian cd ~ git clone  https://github.com/marian-nmt/marian cd marian mkdir build cd build cmake -DCOMPILE_SERVER=on -DCUDA_TOOLKIT_ROOT_DIR=/usr/local/cuda-10.1/ .. make -j4 # Grab and compile the Marian model examples and helper tools cd ~/marian/ git clone  https://github.com/marian-nmt/marian-examples.git cd marian-examples/ cd tools/ make\n Finally, I’ve  shared the scripts that we’ll use to train our Spanish-to-English model with Marian. These are based on the Romanian translation example included with Marian, but modified for Spanish-to-English and scaled up to a larger data set. Let’s grab those:\n # Download the Spanish-to-English scripts for this article cd ~/marian/marian-examples git clone  https://github.com/ageitgey/spanish-to-english-translation # Install the Python modules we&#39;ll use later cd spanish-to-english-translation sudo python3 -m pip install -r requirements.txt\n You are free to  tweak these scripts to work for any language pair that you want to translate. Latin-based languages like French or Italian would require very few changes while less similar languages like Mandarin would require a lot more work.\n  To train a translation model, we need millions of pairs of sentences that are exactly the same except that they have been translated into two languages. This is called a  parallel corpora:\n  The more sentence pairs we have, the better our model will learn how to translate different kinds of text. To create an industrial-strength model, we’ll need  tens of millions of training sentences or more. And most importantly, these sentences need to cover the whole range of human expression, from formal documents to slang and jokes.\n The biggest difference between a bad translation system and something as powerful as Google Translate is the amount and variety of training data! Luckily in 2020, there are lots of places where we can find parallel data that was created by accident and can be turned into training sentence pairs with some clever tricks.\n For formal and legal text, we have the gift of the European Union. They translate their legal documents into all the languages of their member states, including English and Spanish. Along the same lines, we can find cross-translated legal text from other international agencies, like the United Nations and the European Central Bank.\n For historical writing, we can source sentence pairs from classic books that have been translated into different languages. We can take books that are out of copyright and pair up different translations of those works to create pairs of sentences that we know say the same thing.\n And for informal conversation, we have the gift of DVDs. Since the DVD format was launched in the late 1990s, almost all movies and TV shows have included machine-readable subtitles in several languages. We can pair up different translations of the same movies and TV shows to create parallel data. This same idea also works for newer content that has subtitles, like Blu-rays and YouTube videos.\n Now we know where to find the data, but it is still a lot of work to clean and prepare it all. Luckily the amazing folks at  OPUS (Open Parallel Corpus) have already done the work of collecting sentence pairs in numerous languages. You can  browse and download all their parallel sentence data on their website. This will speed up our project enormously, so make sure to check out the citations of their work at the end of this article.\n The training script that we’ll run later  will automatically download these data sources from OPUS, giving us nearly 85 million translated sentence pairs with zero work. That’s awesome!\n OPUS provides files by language pair. So if instead of Spanish-to-English you wanted to create, say, a Finnish-to-Italian translation model, you could do that by downloading the files for that language pair instead. Just keep in mind it will be harder to find sentence pairs for less widely-spoken languages. Also,keep in mind that some languages will need unique approaches to text normalization that aren’t covered in this example.\n  Also keep in mind that this data was sourced from a variety of places and quality varies. There is certain to be some bad or duplicated data in these downloads. When you are working with huge data sets, data quality is never guaranteed and you often need to get your hands dirty to find and fix any glaring issues.\n  The script I included to train the model will automatically download and prep the data for you, but it’s worth talking about the steps involved in case you want to build a translation model for a different language pair.\n Each data source we download from OPUS will include two text files. One text file has a list of English sentences and the other has a matching list of Spanish sentences in the same order. So we’ll end up with numerous text files, like this:\n  Combine: Combine all the English text files into a single, massive text file. Likewise, combine all the Spanish text files, making sure to keep all the sentences in order so that the English and Spanish files still match up.\n Shuffle: Randomize the order of the sentences in each file, while still keeping the sentences in the English and Spanish files  in the same relative order. Mixing up training data from different sources will help the model learn to generalize across different types of text instead of first learning to translate formal data, then learning to translate informal data, and so on.\n Split: Split the master data files for each language into training, development and testing segments. We’ll train the model on the bulk of the training data but withhold some sentences to use to test the model and make sure that it is working. This ensures that we are testing the model using sentences that it never saw during training so we can be sure it didn’t just memorize the correct answers.\n  It is never possible to get training data that covers every possible word because people make up new words all the time. To help our translation system handle never-before-seen words, we are going to use an approach called  subword segmentation.\n Subword segmentation is where we divide words into smaller fragments and teach the model translate between each fragment of each word. The hope is that if the model sees a word it has never seen before, it can at least try to guess the meaning of the word by translating the subwords that make it up.\n Imagine that our training data contained the words  low,  lowest,  newer, and  wider. We could split the words into roots and suffixes:\n  Now imagine that we are asked to translate the word  widest. Even though that word was never in the training data, the model will know how to translate  wid and  est, so by putting those two subword translations together, it will be able to make a pretty good guess as to what  widest means. This won’t always be perfect, but it will work well enough in a lot of cases and it will make the translation model more accurate overall.\n The specific implementation of subword segmentation will we use is called BPE, or Byte Pair Encoding. You can read about how it works  in the original research paper.\n To take advantage of BPE, we’ll need to train a new BPE model to fit our training data set and then we’ll include an extra step in our text normalization process where we run the text through that BPE model. Likewise, we’ll need to add step during the de-normalization process to re-join any words in the final translation that were split into separate words by the BPE model.\n  The entire process of downloading the training data, preparing it, creating the BPE model and training the actual translation model with Marian is all in one script. To kick everything off, run this command:\n  You can  take a look at the   run-me.sh  script to see what happens at each step. It’s pretty straightforward — it downloads the training data, combines it, normalizes it and then kicks off the Marian training process.\n Feel free to replace this script with your own implementation if you are going to build a production-grade translation system. This script is just a guide to the steps that you need to perform.\n After the data is prepared and the model starts to train, you’ll see output like this:\n [2020-05-01 10:09:23] Ep. 1 : Up. 1000 : Sen. 154,871 : Cost 70.37619781 : Time 370.45s : 5024.86 words/s\n   This message is saying that we are currently on Epoch 1 (the first pass over the training data) and so far, the model has been updated 1000 times with 154,871 sentence pairs processed.\n The Cost value of 70.3 tells you how far the model training process has gotten to finding an optimal solution. A cost of 0.0 would mean the model is perfect and always turns any Spanish sentence into the perfect match English translation in the training data. This will never happen because the\n......", "posttime": "2020-05-10 20:35:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,翻译", "title": "构建您自己的“谷歌翻译”--高质量的机器翻译系统", "title_en": "Build Your Own ‘Google Translate’-Quality Machine Translation System", "transed": 1, "url": "https://medium.com/@ageitgey/build-your-own-google-translate-quality-machine-translation-system-d7dc274bd476", "via": "", "real_tags": ["google", "谷歌", "翻译"]}, {"category": "", "categoryclass": "", "imagename": "0ad49aa08a84f77f88aeb1ef135a8f74.jpg", "infoid": 1001508, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "空格键用于播放或暂停，M键用于静音，左右箭头键用于查找，上下箭头键用于音量。\n在墨尔本以北两小时车程的农业小镇墨尔奇森，许多当地人正在前往教堂。其中一人正在庆祝他的21岁生日，吉利克兄弟正在他们的后院建造一个雪貂笼子。\n他们还不知道，一颗46亿年前的陨石刚刚落在他们的小镇上。\n我们11岁的儿子和7岁的女儿在外面的前阳台上，我听到砰的一声，砰的一声，砰的一声。\n我们冲到外面，我们可以看到这股蓝色的烟雾，就在晴朗的蓝天上，我们意识到发生了什么事。\n玛丽安说，除了噪音，还有一股强烈的甲基化酒精气味。\n上午11点的教堂礼拜迟到了，贝格一家挤进车里，从车道上滚了出来。\n玛丽安说：我们从围场往下看，那里有115头挤奶的奶牛，它们几乎都挤在围场的角落里，试图竖起耳朵逃跑。\n在上午的过程中，每个人都提出了自己的理论，说明是什么导致了不寻常的噪音和气味。乳制品爆炸，或者飞机坠毁。\n我开玩笑地说，我以为是两艘宇宙飞船在互相射击，玛丽安说。\n其他人认为这是火灾或车祸，并预计附近消防站的警报器会突然响起。\n当然，每个人都在猜测…。另一位当地人唐·波尔金霍恩(Don Polkinghorne)说，是枪响、煤气爆炸还是(火车)轨道上发生了什么？\n但那是1969年：没有办法查找或确认实际发生的事情。\n我们只是继续做我们正在做的事情，因为在那些日子里没有人能发现。\n那天晚上，在离镇子只有几分钟路程的一个农场里，已故的阿诺德·布里斯班在那个星期天第二次去给他的奶牛挤奶。\n阿诺德的儿媳贝丝·布里斯班(Beth Brisbane)解释说，在离开院子后，他注意到院子里有这种黑色的木炭物质。\n他不知道那是什么，但很明显它是从天而降的，因为没有其他原因。\n阿诺德捡起大部分木炭，把它扔过栅栏，然后用软管冲洗院子，把这种不寻常的物质冲进农场的粪坑。\n但第二天早上，当Murchison的居民继续证实他们关于天空中有光、有烟、有噪音的说法时，布里斯班决定将这种奇怪的、黑色的、类似木炭的物质样本带到谢普顿新闻(SHepparton News)。\n警方报告称：1969年9月28日，在维多利亚州北部发现坠落物体后，在Murchison发现了物质。\n在告诉警方后，谢泼顿新闻报给墨尔本大学的地质系打了电话。\n墨尔本大学地质学教授约翰·洛弗林(John Lovering)在墨尔奇森陨石着陆的当天有点心不在焉。\n他回忆说，当时我正坐飞机从美国回来，在墨尔本的实验室里拿到了第一批月球样本进行分析。\n在阿波罗11号登月三个月后，洛弗林教授被提名为澳大利亚首席调查人员之一，负责分析宇航员带回家的样本。\n洛弗林教授第一次听说陨石着陆的消息时，他正站在墨尔本机场，手里拿着一袋月球岩石样本。\n一个来自那个时代的家伙走过来说，在一个叫Murchison的地方，有什么东西从天而降。\n与此同时，墨尔本大学地质系的一群学生已经开始前往该镇寻找陨石碎片。\n安德鲁·格列德罗当时是一名地质学三年级学生。今天，他是墨尔本大学地球科学荣誉退休教授。\n他被指定在布里斯班农场的粪坑中分拣，这是一项艰巨的任务。\n我被指派穿着口香糖靴子站在坑里，卷起袖子，筛选粪便，摸着沙砾之类的砂砾，#34；格列迪奥教授回忆道。\n直到着陆几天后，人们才认识到这块陨石的真正意义。\n在带着月球岩石回来后，洛弗林教授赶上了官方程序，他没有机会去默奇森。\n碰巧，他正在墨尔本ABC电视演播室等待接受时事节目“今夜今夜”的采访，这时他终于看到了一块陨石。\n门猛然打开，一个家伙拿着一个塑料袋走了进来，塑料袋(从岩石上冒出的气体)都炸飞了，他记得。\n我打开它，闻到了所有这些非常复杂的有机化合物的气味--一种令人难以置信的混合了你所能想象到的所有气味的香料。\n我看了看里面，有一个黑色的，看起来像煤质的物质，我说，天哪，这是一个碳质球粒陨石！\n这些是最稀有的陨石，也是最原始的陨石。这是一个非常新鲜的。&#34；\n因为这块岩石是在白天着陆的，而且很快就被发现了，所以它珍贵的有机化合物鸡尾酒没有受到污染。\n被这一发现的重大意义淹没了，洛弗林教授开始在电视演播室里跳来跳去。\n[主持人]彼得·库奇曼(Peter Couchman)说，等一下，等一下，我们还没有开播，但当我们上节目的时候，我都很平静，很镇定，他说。\n没过多久，来自世界各地的科学家和陨石收藏家开始蜂拥来到墨奇森这个小镇。\n碳质球粒陨石进入大气层后会破裂；当地人报告的轰鸣是这些陨石碎片打破了音障。\n因此，与大多数陨石不同的是，那里没有撞击地点，也没有陨石坑。相反，墨奇森陨石散落在一片11公里长、3公里宽的农田上。\n贝丝·布里斯班(Beth Brisbane)回忆说，有了像穿过Murchison East的干草棚这样的线索，人们就有了去哪里找的想法。\n不计其数的科学家出现在布里斯班农场看了看奶牛场。\n空格键用于播放或暂停，M键用于静音，左右箭头键用于查找，上下箭头键用于音量。\n当时年龄分别为10岁和11岁的吉利克兄弟彼得和金对这项事业贡献最大。\n金·吉利克说：我们开始拼凑它是从哪里掉下来的，以及它是怎么掉下来的。\n我们很快意识到，小碎片走得更少，落到地上的速度更快，而大碎片携带得更远，走得更远。\n使用该地区的地图，兄弟俩划出了一条陨石坠落的位置和方向的路径，这告诉他们应该往哪里看。\n每天上午10点或11点，当太阳在高空升起时，他们的母亲会开车送他们去他们认为有可能出现陨石碎片的地区。\n我们只是去散步，排成队，上上下下，上上下下，金说。\n他们有时很长一段时间都没有找到任何碎片，但Kim说，这只会让搜索变得更加令人满意。\n吉利克兄弟很快就因知道哪里可以找到陨石碎片而声名鹊起。\n洛弗林教授就是这些科学家中的一员。在一次科学交流中，他带来了他最近从美国带回的月球岩石样本。\n结果得到了回报。在找到的100公斤Murchison陨石中，Kim说他和Peter大约找到了三分之一。\n在1970年接受“今夜今夜”采访时，金的母亲艾米丽·吉利克被问及如何处理陨石样本。\n我们用不同的石头和矿物交换了很多东西，我们给墨尔本大学和悉尼博物馆捐了很多钱，我们也卖了很多给美国的机构，她说。\n当被问及这家人从出售陨石中赚了多少钱时，艾米丽犹豫了一下。\n我真的不想说。我们真的得到了相当多，这笔钱将用来教育孩子们，她当时回应道。\n直到今天，Murchison当地人还不愿谈论出售陨石碎片赚了多少钱，或者他们是否为自己留了一小块纪念品。\n有人告诉我它值3000美元一克，对吗？&34；贝丝·布里斯班问道。\n当然也有一些居民相当肯定还有陨石碎片有待发现。\n空格键用于播放或暂停，M键用于静音，左右箭头键用于查找，上下箭头键用于音量。\n玛丽安·贝格说，他们认为它的主要部分可能在瓦兰加盆地的中部。\n自墨奇森陨石坠落半个世纪以来，它的科学意义仍然无与伦比。\n他住在离Murchison数千公里的地方，但他职业生涯的大部分时间都在研究这块特殊的岩石。\n他说，对我和其他许多研究陨石的科学家来说，墨奇森陨石是最重要的陨石。\n我从学生时代就开始研究陨石，直到今天仍然在研究它，我自己的学生也在研究默奇森。\n赫克博士解释说，这一块古老的矿物质不断为科学家提供对太阳系和我们起源的新见解。\n空格键用于播放或暂停，M键用于静音，左右箭头键用于查找，上下箭头键用于音量。\n像Murchison陨石这样的碳质球粒陨石含有丰富的碳，仅占今天陨石的4%。\n更重要的是，已有46亿年历史的墨奇森标本比我们的太阳系还要古老；它是把我们的星球邻居带到我们今天所认识的道路上的一个小小的、臭气熏天的快照。\n赫克博士解释说，就像动物发育中的胚胎一样，胚胎的情况决定了未来的结果。\n在我们的太阳和行星形成之前，太阳系是一个由气体、尘埃和碎片组成的杂乱无章的圆盘。墨奇森陨石是一些从未被收集到行星或月球上的碎片的混合物。\nHeck博士说，它很可能在火星以外的小行星带中四处撞击，直到最近，才有什么东西把它踢向维多利亚州中部。\n默奇森陨石充满了一系列有机化合物，包含了生命本身的起源，如氨基酸、水、糖和与酒精相关的化合物。\n这种有机分子的浓度是甲基化酒精恶臭的原因，Murchison当地人报告说，当它第一次坠毁在大气中时。今天，在岩石样本中仍然可以闻到这种气味。\n赫克博士说，像这样的陨石可能在地球历史上很早的时候就撞上了地球，并提供了使后来的生命得以形成的益生菌积木。\n墨奇森陨石的其他发现让我们了解了太阳在非常年轻的恒星时的行为。\n赫克博士说，当太阳还处于萌芽阶段时，它比今天活跃得多。\n这意味着有更多的火山喷发正在进行，高能粒子向四面八方喷射，击中了他们路径上的一切。\n他说，科学家能够在墨尔奇森陨石内的某些矿物中看到这种活动的记录。\n用不同的技术研究这些不同类型的矿物将需要更多年的时间来量化，但我们实际上可以通过在实验室研究Murchison来做早期太阳系天文学。\n更重要的是，赫克博士说，墨奇森陨石是我们星球上太阳前星尘颗粒最丰富的来源。\n这些颗粒非常罕见，他说，并解释说，不同的颗粒代表着来自不同古代恒星的物质。\n这告诉我们，我们的太阳系是由众多不同的恒星…组成的。所以我们本质上是这些不同明星的产物。\n乍一看(陨石)不太壮观。如果你仔细观察，它实际上是我们银河系的样本，非常有价值。\n赫克博士说，如果这块岩石没有在光天化日之下撞击人口稠密的地区，当地居民很快就会把消息传给科学家，那么所有这些洞察力可能都不会成为现实。\n在陨石坠落50年后，贝丝·布里斯班(Beth Brisbane)站在默奇森(Murchison)的家庭奶牛场里，思考着如果她的岳父没有把样品送到当地报纸上，太空岩石会变成什么样子。\n我经常想知道…。如果它被忽略了会发生什么，其他的碎片是否会被捡起来。", "note_en": "Space to play or pause, M to mute, left and right arrows to seek, up and down arrows for volume.\n In the small farming town of Murchison, two hours north of Melbourne, many locals were making their way to church. One was celebrating his 21st birthday, and the Gillick brothers were building a ferret cage in their back yard.\n  They didn&#39;t know it yet but a 4.6-billion-year-old meteorite had just rained down on their town.\n          &#34;Our 11-year-old son and our seven-year-old daughter were out on the front verandah and I heard this &#39;ba-boom, ba-boom, ba-boom&#39;.\n  &#34;We rushed outside and we could see this puff of blue smoke, right up in the clear blue sky and we realised something had happened.&#34;\n Aside from the noise, Marianne says there was also a strong smell of methylated spirits.\n Running late for the 11.00am church service, the Begg family piled into their car and rolled out of their driveway.\n &#34;We looked down the paddock with 115 milking cows and they were all just about heaped in the corner of the paddock, trying to get away with their ears up,&#34; Marianne says.\n        Over the course of the morning, everyone came up with their own theory as to what had caused the unusual noise and smell. A dairy exploding, or maybe a plane crashing.\n &#34;I jokingly said I thought it was two spaceships shooting at each other,&#34; says Marianne.\n Others thought it was a fire or car accident, and expected the sirens at the nearby fire station to spring to life.\n  &#34;Everybody was of course speculating … Was it the guns going off, a gas explosion or something had happened on the [train] track?&#34; says Don Polkinghorne, another local.\n But it was 1969: there was no way of looking up or confirming what had actually happened.\n &#34;We just went on with what we were doing, because nobody in those days could find out.&#34;\n          That evening, on a farm just minutes from town, the late Arnold Brisbane went to milk his dairy cows for the second time that Sunday.\n &#34;Having left the yard pristine, he noticed this black charcoal substance on the yard,&#34; explains Beth Brisbane, Arnold&#39;s daughter in-law.\n &#34;He had no idea what it was but obviously it had fallen out of the sky because there was no other reason for it.&#34;\n Arnold scooped up the bulk of the &#34;charcoal&#34;, threw it over the fence and then proceeded to hose the yard down — flushing the unusual substance into the farm&#39;s manure pit.\n       But the next morning, as Murchison residents continued to corroborate their stories of lights, smoke and noise in the sky, Mr Brisbane decided to take a sample of this strange, black, charcoal-like substance to Shepparton News.\n     The police report states: &#34;Substance found at Murchison after sighting of falling object in Northern Victoria on 28/9/69.&#34;\n After telling the police, the Shepparton News called the geology department at the University of Melbourne.\n      On the day of the Murchison meteorite landing, John Lovering, professor of geology at the University of Melbourne, was slightly preoccupied.\n &#34;I was coming back in the aircraft from America, having picked up the first lunar samples to analyse in our labs here in Melbourne,&#34; he recalls.\n It was three months after  Apollo 11 landed on the moon and Professor Lovering had been nominated as one of the principal Australian investigators for analysing the samples the astronauts brought home.\n   It was as he was standing in Melbourne airport, clutching a bag of moon rock samples, that Professor Lovering first heard about the meteorite landing.\n &#34;A bloke from The Age came and said, &#39;something has fallen out of the sky in a place called Murchison&#39;.&#34;\n Meanwhile, a group of University of Melbourne geology students had already made their way to the town to start looking for pieces of meteorite.\n Andrew Gleadow was a third-year geology student at the time. Today, he&#39;s an emeritus professor of earth sciences at the University of Melbourne.\n He was designated the grim task of sorting through the manure pit on the Brisbanes&#39; farm.\n &#34;I was assigned to stand in the pit with gumboots on, sleeves rolled up, sieving through manure, feeling for gritty little lumps like gravel,&#34; Professor Gleadow recalls.\n  It wasn&#39;t until a couple of days after the landing that the true significance of the meteorite was recognised.\n Caught up with official proceedings following his return with the moon rocks, Professor Lovering hadn&#39;t had the opportunity to go to Murchison.\n As it happened, he was in the Melbourne ABC TV studio, waiting to be interviewed on current affairs program This Day Tonight, when he finally laid eyes on a piece of the meteorite.\n &#34;The door flung open and a bloke came in carrying a plastic bag, all blown up [from the gases coming off the rock],&#34; he remembers.\n &#34;I opened it up and I got the smell of all these very complex organic compounds— an incredible potpourri of all the smells that you ever imagined.\n &#34;I looked inside and there was this black, coaly looking material and I said, &#39;My god, it&#39;s a carbonaceous chondrite!&#39;\n    &#34;These are the rarest of meteorites, the most primitive of them. And here was this beautifully fresh one.&#34;\n   Because the rock had landed in the daytime and was discovered quickly, its precious cocktail of organic compounds wasn&#39;t contaminated.\n Overwhelmed by the significance of the find, Professor Lovering began leaping around the TV studio.\n &#34;[Presenter] Peter Couchman said &#39;hold on, hold on we&#39;re not on the air yet&#39;, but by the time we got on the air I was all calm and collected,&#34; he says.\n  It wasn&#39;t long before scientists and meteorite collectors from all over the world began to descend upon the tiny town of Murchison.\n  Carbonaceous chondrites break up as they enter the atmosphere; the booming the locals reported was these meteorite fragments breaking the sound barrier.\n So unlike most meteorites, there was no impact site, no crater. Instead, the Murchison meteorite was scattered across a swathe of farmland 11 kilometres long and 3km wide.\n With clues like a big piece that went through a hay shed in Murchison East, people had an idea of where to look, Beth Brisbane remembers.\n Countless scientists showed up at the Brisbanes&#39; farm to take a look at the dairy.\n    Space to play or pause, M to mute, left and right arrows to seek, up and down arrows for volume.\n It was the Gillick brothers, Peter and Kim, aged 10 and 11 at the time, who became most dedicated to the cause.\n  &#34;We started to piece together where it fell and how it fell,&#34; Kim Gillick says.\n &#34;We realised quickly that the small pieces travel less and fell quicker to the earth, and the large pieces carried and went further.&#34;\n Using maps of the area, the brothers gridded a path of where the meteorite fell and which direction, and that told them where to look.\n Each day at 10 or 11am, when the sun was high in the sky, their mother would drive them to an area that they had determined as a potential spot for meteorite fragments.\n  &#34;We&#39;d just go walking, get in lines and just go up and down, up and down,&#34; Kim says.\n They sometimes went for long periods without finding any pieces, but Kim says that just made the search all the more satisfying.\n  The Gillick brothers quickly gained a reputation for knowing where to find fragments of meteorite.\n  Professor Lovering was one of these scientists. In a sort of scientific exchange, he brought along the samples of moon rock he&#39;d recently brought back from America.\n    And it paid off. Of the 100 kilograms of Murchison meteorite that was recovered, Kim says he and Peter recovered roughly a third.\n    In an interview with This Day Tonight in 1970, Kim&#39;s mother Emily Gillick was asked what was being done with the meteorite samples.\n &#34;We have exchanged a lot for different stones and minerals, we have donated a lot to the Melbourne University and Sydney Museum and we have also sold a lot to American institutions,&#34; she said.\n When asked how much the family had made from the sale of the meteorite, Emily hesitated.\n &#34;I really wouldn&#39;t like to say. We really have got quite a bit and it&#39;s going to educate the children,&#34; she responded at the time.\n To this day, Murchison locals are reluctant to speak about how much was made from the sale of meteorite fragments, or whether they souvenired a small chunk for themselves.\n &#34;Somebody told me it was worth $3,000 a gram, is that right?&#34; Beth Brisbane asks.\n And then of course there are some residents who are fairly certain there are still pieces of meteorite to be discovered.\n   Space to play or pause, M to mute, left and right arrows to seek, up and down arrows for volume.\n &#34;They think that the main piece of it might be in the middle of the Waranga Basin,&#34; says Marianne Begg.\n     Half a century since the fall of the Murchison meteorite, it remains unrivalled in its scientific significance.\n  He lives thousands of kilometres from Murchison but has spent much of his career studying this particular rock.\n        &#34;The Murchison meteorite was the most important meteorite for me and for many other scientists who study meteorites,&#34; he says.\n &#34;I started studying the meteorite when I was a student and still study it today and I have my own students working on Murchison.&#34;\n This single clump of ancient minerals, Dr Heck explains, is constantly offering scientists fresh insights into the solar system and our origins.\n   Space to play or pause, M to mute, left and right arrows to seek, up and down arrows for volume.\n     Carbonaceous chondrites like the Murchison meteorite are rich in carbon and make up just 4 per cent of meteorites that fall today.\n  What&#39;s more, at 4.6 billion years old, the Murchison specimen is older than our solar system; it&#39;s a small, smelly snapshot of the conditions that set our planetary neighbourhood on the path to what we recognise today.\n &#34;Similar to an embryo in an animal developing, what happens to the embryo determines the future outcome,&#34; Dr Heck explains.\n Before our Sun and planets formed, the solar system was a messy disc of gas, dust and debris. The Murchison meteorite is a mixture of some of the chunks that were never collected into a planet or a moon.\n It probably knocked around in the asteroid belt beyond Mars, Dr Heck says, until much more recently, something kicked it towards central Victoria.\n  Filled with a range of organic compounds, the Murchison meteorite contains &#34;the very origins of life itself&#34; such as amino acids, water, sugars and alcohol-related compounds.\n That concentration of organic molecules is the reason for the stench of methylated spirits that Murchison locals reported when it first crashed through the atmosphere. The odour can still be smelled in samples of the rock today.\n Dr Heck says a meteorite much like this one could have hit Earth very early on in its history and &#34;delivered the prebiotic building blocks that enabled later life to form&#34;.\n   Other discoveries from the Murchison meteorite have taught us about the behaviour of the Sun when it was a very young star.\n &#34;When the Sun was in its infancy, it was much more active than today,&#34; Dr Heck says.\n &#34;That means there were many more eruptions going on, high-energy particles shooting out in all directions, hitting everything in their path.&#34;\n He says scientists are able to see a record of that activity in certain minerals contained within the Murchison meteorite.\n &#34;Quantifying this will take many more years of studying these different types of minerals with different techniques, but we can actually do early solar system astronomy by studying Murchison in the laboratory.&#34;\n What&#39;s more, Dr Heck says the Murchison meteorite is the most prolific source on our planet of pre-solar stardust grains.\n &#34;These grains are very rare,&#34; he says, explaining that different grains represent material from different ancient stars.\n &#34;This tells us that our solar system formed from a multitude of different stars … so we&#39;re essentially a product of these different stars.\n &#34;At first sight [the meteorite] looks not very spectacular. If you look at it closer, it is actually a sample of our galaxy and it is extremely valuable.&#34;\n All of these insights might not have materialised, Dr Heck says, if the rock hadn&#39;t struck in broad daylight, in a populated area where word passed quickly from the local residents to scientists.\n        Now 50 years since the meteorite fell, standing in the family dairy in Murchison, Beth Brisbane considers what would have become of the space rock if her father-in-law hadn&#39;t taken a sample to the local newspaper.\n &#34;I often wonder … what would&#39;ve happened if it had been ignored, whether other pieces would&#39;ve been picked up.", "posttime": "2020-05-10 20:15:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "太空,游客,visitor,陨石", "title": "当一位太空游客来到维多利亚州时(2019年)", "title_en": "When a space visitor came to country Victoria (2019)", "transed": 1, "url": "https://www.abc.net.au/news/science/2019-10-02/murchison-meteorite-50th-anniversary-1969-science-geology/11528644?nw=0", "via": "", "real_tags": ["太空", "游客", "visitor", "陨石"]}]