[{"category": "", "categoryclass": "", "imagename": "b15680be7ec8d7c6a60c4a9727890a73.jpg", "infoid": 1003862, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Jetson Xavier NX在小型机系统中为Edge带来超级计算机性能，还支持所有流行的AI框架。", "note_en": "Jetson Xavier NX Brings Supercomputer Performance to the Edge in a Small Form Factor System and  also Supports all Popular AI Frameworks.", "posttime": "2020-05-27 07:13:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "xavier,ai", "title": "Jetson Xavier NX", "title_en": "Jetson Xavier NX", "transed": 1, "url": "https://www.nvidia.com/en-us/autonomous-machines/embedded-systems/jetson-xavier-nx/", "via": "", "real_tags": ["xavier", "ai"]}, {"category": "", "categoryclass": "", "imagename": "68c447bbe48129fd4e8d2b6de84c2fe0.png", "infoid": 1003861, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国总统唐纳德·特朗普的一篇帖子首次被推特贴上了事实核查的标签。\n特朗普总统在推特上写道：#34；不可能(零！)。邮寄的选票不会有实质上的欺诈性。&#34；\n在过去的一周里，美国总统就邮寄选票的有效性发表了几项未经证实的声明。\n推特的通知在推文下面显示了一个蓝色感叹号，建议读者了解邮寄选票的情况。\n这家社交媒体公司曾承诺在其网站上增加虚假或误导性信息的警告标签，但它对美国总统采取行动的速度一直很慢。\n在此之前，推特决定不删除特朗普总统对2001年洛里·克劳苏蒂斯(Lori Klausutis)之死的评论。总统在推特上发布了几条信息，宣传一种阴谋论，即克劳苏蒂斯是被MSNBC主持人乔·斯卡伯勒谋杀的。\n该公司拒绝删除这些推文，但向克劳苏蒂斯表示，对总统声明造成的痛苦深表歉意。", "note_en": "A post by US President Donald Trump has been given a fact-check label by Twitter for the first time.\n President Trump  tweeted: &#34;There is NO WAY (ZERO!) that Mail-In Ballots will be anything less than substantially fraudulent.&#34;\n  The US president has made several unsubstantiated claims about the validity of mail-in ballots over the past week.\n Twitter&#39;s notification displays a blue exclamation mark underneath the tweets, suggesting readers &#34;get the facts about mail-in ballots&#34;.\n  The social media company had pledged to increase the warning labels under false or misleading information on its site but it has been slow to take steps against the US president.\n   The move comes on the heels of Twitters decision not to remove comment President Trump made about the death Lori Klausutis in 2001. The president has tweeted several messages promoting a conspiracy theory that Ms Klausutis was murdered by MSNBC host Joe Scarborough.\n  The company declined to take down those tweets but told Mr Klausutis it was &#34;deeply sorry&#34; about the pain caused by the president&#39;s statements.", "posttime": "2020-05-27 07:13:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,核查,tags,总统", "title": "推特标签特朗普的推文带有事实核查警告", "title_en": "Twitter tags Trump tweet with fact-checking warning", "transed": 1, "url": "https://www.bbc.com/news/technology-52815552", "via": "", "real_tags": ["推特", "核查", "tags", "总统"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003859, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Paseto是您喜欢Jose(JWT、JWE、JWS)的一切，没有任何困扰Jose标准的设计缺陷。\n不可能，何塞！为凡人设计密码功能过去三年的漏洞研究和密码分析对Jose互联网标准家族(通常称为JSON Web令牌，也称为JSON Web Tokens)并不友好。JWT)。这导致许多安全专家大胆宣布，不要使用JWT！但这让许多开发人员缺乏可行的替代方案。Scott更进一步，设计了一个更安全的替代方案：PASETO(平台无关的安全令牌)，目前用10种编程语言实现。", "note_en": "Paseto is everything you love about JOSE (JWT, JWE, JWS) without any of the  many design deficits that plague the JOSE standards.\n        No Way JOSE! Designing Cryptography Features for Mere Mortals    The past three years of vulnerability research and cryptanalysis has not been kind to the JOSE family of Internet standards (most commonly known as JSON Web Tokens a.k.a. JWT). This has led to many security experts declaring boldly, &#34;Don&#39;t use JWT!&#34; but has left many developers in want of a viable alternative. Scott went a step further and designed a safer alternative: PASETO (Platform-Agnostic SEcurity TOkens), which is currently implemented in 10 programming languages.", "posttime": "2020-05-27 06:57:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,jose", "title": "Paseto-Jose(JWT、JWE、JWS)，没有Jose标准中的许多设计缺陷", "title_en": "Paseto – JOSE (JWT, JWE, JWS) without the many design deficits in JOSE standards", "transed": 1, "url": "https://paseto.io/", "via": "", "real_tags": ["设计", "jose"]}, {"category": "", "categoryclass": "", "imagename": "a4e5c3589e38b0dc3e085b7c621dc308.jpeg", "infoid": 1003858, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "至少有11家电视台播放了亚马逊公关团队编写和制作的相同片段。", "note_en": "At least 11 TV stations aired an identical segment written and produced by Amazon’s PR team.", "posttime": "2020-05-27 06:57:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,亚马逊,电台,news,团队", "title": "当地新闻电台运行由亚马逊编写和制作的宣传部分", "title_en": "Local News Stations Run Propaganda Segment Scripted and Produced by Amazon", "transed": 1, "url": "https://www.vice.com/en_us/article/4ayvwb/local-news-stations-run-propaganda-segments-scripted-and-produced-by-amazon", "via": "", "real_tags": ["amazon", "亚马逊", "电台", "news", "团队"]}, {"category": "", "categoryclass": "", "imagename": "379d408cd237b61c9d48a8b37bfacfa2.jpg", "infoid": 1003857, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "优步(Uber)宣布了一项激进的行动计划，以缩减业务，因为在大流行停摆期间，优步的亏损激增。\n该公司表示，将再裁员3000人，使最近几周的裁员总数达到员工总数的四分之一。\n该公司还将关闭或整合40多个办事处，并逐步关闭其人工智能实验室等部门。\n首席执行官达拉·科斯罗沙希(Dara Khosrowshahi)在致员工的一封信中写道：我们必须将自己打造成一家自给自足的企业，不再依赖新资本或投资者来保持增长、扩张和创新。\n我们必须采取这些艰难的行动，才能站稳脚跟，确保我们的未来，继续我们的使命。\n甚至在疫情爆发之前，优步就在努力应对巨额亏损。但随着大流行期间活动的骤降，它面临的挑战成倍增加。\n上个月，在美国和加拿大封锁最严重的时候，优步的乘车次数下降了80%。与此同时，尽管优步Eats(Uber Eats)的外卖业务激增，但仍处于亏损状态。\n本月早些时候，优步(Uber)宣布将裁员3700人，并警告可能会进一步裁员。裁员不包括司机，优步认为司机是独立承包商。\n受影响的办事处包括旧金山和新加坡的中心，随着公司选择新的地区总部，这些中心将于明年开始关闭。\n优步表示，将重组剩余员工，并削减不属于其核心个人交通或送餐业务一部分的领域支出，包括AI实验室。\n优步的行动是病毒持续经济影响和控制努力的最新迹象。\n虽然一些地方已经开始放松限制，但许多公司-特别是旅游业的公司-警告称，公众对许多日常活动安全的信心需要时间才能恢复。\n优步规模较小的竞争对手Lyft也宣布大幅裁员，航空公司、酒店经营者和Airbnb等预订平台也宣布大幅裁员。\n考斯罗沙希表示：鉴于疫情的戏剧性影响，以及任何最终复苏的不可预测性，我们正将精力集中在我们的核心移动和交付平台上，并调整我们公司的规模，以符合我们业务的现实。", "note_en": "Uber has announced a drastic action plan to scale back its business as its losses balloon amid pandemic lockdowns.\n The firm said it would cut 3,000 more jobs, bringing the total reductions in recent weeks to a quarter of the workforce.\n It is also closing or consolidating more than 40 offices and winding down units such as its artificial intelligence lab.\n  &#34;We must establish ourselves as a self-sustaining enterprise that no longer relies on new capital or investors to keep growing, expanding and innovating,&#34; chief executive Dara Khosrowshahi wrote in a letter to staff.\n  &#34;We have to take these hard actions to stand strong on our own two feet, to secure our future and to continue on our mission.&#34;\n  Even before the pandemic, Uber was grappling with huge losses. But its challenges have multiplied as activity plunges during the pandemic.\n The number of Uber rides dropped 80% last month at the height of the lockdowns in the US and Canada. Meanwhile, although its Uber Eats food delivery business has surged, it remains loss-making.\n Earlier this month,  Uber announced it would cut 3,700 staff and  warned of possible additional reductions. The workforce cuts do not include drivers, whom Uber considers independent contractors.\n The affected offices include hubs in San Francisco and in Singapore, which will start closing over the next year as the firm selects a new regional headquarters.\n Uber said it would reorganise its remaining staff and cut back spending in areas that are not part of its core personal transport or food delivery businesses, including its AI Labs.\n   Uber&#39;s actions are the latest sign of the ongoing economic impact of the virus and efforts to control it.\n While some places have started to ease restrictions, many companies - especially those in the travel industry - have warned it will take time for public confidence in the safety of many everyday activities to be restored.\n Uber&#39;s smaller rival, Lyft, has also announced significant job cuts, as have airlines, hoteliers and booking platforms such as Airbnb.\n &#34;Given the dramatic impact of the pandemic, and the unpredictable nature of any eventual recovery, we are concentrating our efforts on our core mobility and delivery platforms and resizing our company to match the realities of our business,&#34; Mr Khosrowshahi said.", "posttime": "2020-05-27 06:41:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,关闭,close,优步", "title": "优步将关闭其人工智能实验室", "title_en": "Uber to close its AI labs", "transed": 1, "url": "https://www.bbc.com/news/business-52711649", "via": "", "real_tags": ["人工智能", "关闭", "close", "优步"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003856, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我一直最喜欢的基于地图的数据可视化创建于1944年。哈罗德·菲斯克(Harold Fisk)与美国陆军工程公司合作，绘制了密西西比河的长度地图。他的视觉形象与其他人不同的是，他通过时间绘制了河流的地图，并设法以一种既美丽又令人惊讶的有效的方式做到了这一点。我想通过创建我自己的系统来程序地生成蜿蜒河流的地图来向他的系列地图致敬。\n密西西比河下游冲积河谷(pl。22，嘘。6，细节)，哈罗德·菲斯克，1944年。\n这个地图生成器系统是用胡迪尼创建的。该系统所需要的只是一条输入指南。这条线变成了河流，河流随着时间的推移而移动和演变，留下了它成长的视觉历史。这张地图是关于一个地方的，尽管是一个虚构的地方，所以需要有河流流经的地形。我生成了一个看似合理的随机地形，并用这条指引线切割出一个山谷，因为山谷控制着河流的流量：平坦平原上的慢河蜿蜒曲折，陡峭地形上的快速河流则不会。\n当河流流经地貌时，它不断侵蚀河床上的物质，并将其沉积在下游。这一过程不断重塑河流的流向，造成蜿蜒的弯道。浏览地球的卫星图像，很容易找到河流蜿蜒的例子。下面是几个示例，它们将告诉我们使用自定义代码重新创建地质过程的尝试。\n这个系统的基本动态很容易理解：河流吸收物质并将其沉积在下游，河流侵蚀曲线的外岸，在那里水流速度较快，并沉积在水流速度较慢的内岸，河流可以切断弯道，以利于形成一条更直的路径，形成被称为牛弓湖的孤立部分。\n要用代码模拟这个过程，我们可以忽略侵蚀和沉积，只考虑平面上的一条曲线。曲线上的每个点都有一个由三个向量表示的坐标框：法线、切线和双切线。由于我们处理的是平面现象(现在忽略高程的变化)，我们可以忽略法向量(在我们的例子中，法线只是垂直指向)，而只利用切线和双切向量。直线和双切线方向上的切点与切线成直角。\n需要注意的一件事是，双切向量不足以使我们的曲线弯曲。派生的双切线通常指向直线的同一侧，而我们需要我们的双切线才能知道这条线是朝哪个方向弯曲的。它应该始终指向曲线的外部，其长度应该与该点的线曲率成比例。\n使用切线和修改后的双切线，我们创建了一个混合了两者的新矢量。此新矢量将添加到曲线上每个点的位置。有了这个基本逻辑，河流中的弯道就有机地形成了。可以通过分别调整这两个向量的总体影响来影响折弯的样式，并可以通过增加最终混合向量的比例来调整折弯的强度。\n切线(蓝色)和修改的双切线(红色)在左侧重叠，新的混合方向矢量(紫色)在右侧重叠。\n如果您正在阅读这篇文章，那是因为您的浏览器不支持HTML5视频元素。\n当河流弯回自身时，曲折就会被切断，取而代之的是一条更短的路径。这一过程形成了牛弓湖，这些湖通常是位于主要河流两侧的新月形水体。为了在我们的河流中发现潜在的牛弓，我们会做距离检查，看看这条河是否有重叠的危险。如果发现接近碰撞，则会隔离两个碰撞点之间的曲线部分，并将其转换为自己的曲线段。这些新生成的湖泊表现出的唯一行为是，它们会随着时间的推移变得越来越小，直到它们从系统中被删除。(目前的系统不允许河流与牛弓湖重新相交，因此增加了一个额外的步骤，以确保湖泊删除自身有可能与河流重叠的部分。)。\n背景网格化绘图是通过在主河样条线上散布一些点和在背景平面上散布一些附加点来创建的。Voronoi断裂用于将背景平面转换为具有不规则边缘的较小多边形。然后，每个多边形被分解成不均匀的栅格。这些新多边形中的每一个都被迭代细分循环进一步拆分，该循环创建伪随机大小的曲线图。最后，从河流几何图形创建的有机形状用于沿海岸创建边界地块。计算最终多边形集的中心点，该中心点成为Plot ID Number文本图层的位置。\n公路网并不是从公路网开始的。最初的算法是试图创造一种有机的增长模式。系统从一些随机放置的点开始。每个点都有一个方向生长矢量。该点沿此增长矢量移动，并在移动时绘制一条线。如果该点遇到另一条线，它将停止。随着点的移动，方向矢量会缓慢旋转。我发现如果我把弯曲的向量和非弯曲的向量混合起来，结果就像相交的道路。我通过使线条的粗细与其长度成正比来强调这一结果。\n我创建的第一张地图图像缺乏地方感。没有任何一个地方的名字，这似乎是一个错失了做一些引人注目的事情的机会。我考虑过随机生成的无意义字符串或手动命名地点，但这两种选择似乎都不是一个很好的可伸缩解决方案。\n我和安德鲁·贝尔讨论了这个问题，他发现了一个美国地质勘探局的地理地名数据库(GNIS数据)。然后，他编写了一个python脚本来解析内容并去掉后缀(比如&#34；Lake&#34；或&#34；Summit&34；)，以生成用于我的特写的适当名称列表。我不想用已经存在的地方来命名地物，所以剪掉后缀有助于降低重现哈德逊河的可能性。取而代之的是，随机添加了新的后缀，以产生像哈德逊峰会(Hudson Summit)或哈德逊沼泽(Hudson Swamp)这样的特色名称。此外，他删除了重复的条目以及过长的名称(小西叉西支羽河出现在其中一张生成的地图上)。\n被隔离命名的地物包括主要河流、湖泊、岛屿、山峰、盆地和沼泽地。河流、湖泊和岛屿足够容易，因为这些特征是从河流系统本身的创造中出现的。通过对地形坡度的分析，将山峰和盆地分离出来。发现了平坦的部分，如果这些单位接近水位，就被认为是一个盆地。如果公寓位于高海拔，就被指定为山峰。沼泽地稍微更具挑战性。低坡度的区域被隔离并转变为轴对齐的边界框，其中心成为标签的位置。这个项目的未来迭代将找到以更像地图的方式布置文本的方法，文本沿着像山脊和细小的湖泊这样的特征流动。\n我想实现一些功能，这需要修改曲折的逻辑本身。目前的系统并不像我希望的那样健壮。我正在考虑从基于样条线的方法转向基于粒子的方法，这可能会使分支河成为可能，也可能使自然湖泊的形成成为可能。这种基于粒子的方法还可以使河流三角洲成为可能，并允许河流与现有的牛弯重新相交。\n我还想致力于使道路系统成为一种迭代的方法。第一个通道将铺设主要的高速公路，第二个通道将在第一个通道外建造次要道路，等等。我还需要研究道路应该如何避免沿着陡峭的斜坡生长的逻辑。", "note_en": "My all-time favorite map-based data visualization was created in 1944. Harold Fisk, working with the US Army Corp. of Engineers,  mapped the length of the Mississippi River. What sets his visualization apart from others is that he maps the river through  time, and manages to do so in a way that is both beautiful and surprisingly effective. I want to pay homage to his series of maps by creating my own system for procedurally generating maps of meandering rivers.\n  The Alluvial Valley of the Lower Mississippi River (pl. 22, sh. 6, detail), Harold Fisk, 1944\n    This map generator system was created with Houdini. All the system requires is an input guide line. The line becomes the river and the river moves and evolves over time and leaves behind a visual history of its growth. The map is of a place, albeit a fictional place, so there needs to be terrain on which the river flows. I generate a plausible randomized terrain and use the guide line to cut away a valley. The valley controls the flow of the river: slow rivers on flat plains meander, fast rivers on steep terrain do not.\n    As a river moves through the landscape, it is constantly eroding material from the river bed and depositing it downstream. This process continually reshapes the flow of the river causing it to create snaking bends. Browsing through satellite images of the Earth, it is easy to find examples of river meandering. Below are a few examples that will inform our attempts to recreate the geological process with custom code.\n    The underlying dynamics of this system are easy enough to understand: rivers pick up material and deposit it downstream, rivers erode the outer bank of a curve where the water speed is higher and deposit on the inner bank where the water speed is slower, and rivers can cut off meanders in favor of a straighter path which forms isolated sections called oxbow lakes.\n To simulate this process with code, we can ignore erosion and deposition and just think of a curved line on a plane. Each point on the curve has a coordinate frame which is represented by three vectors: normal, tangent, and bitangent. Since we are dealing with a planar phenominon (ignoring changes in elevation for now), we can disregard the normal vector (in our case, the normal just points straight up) and just make use of the tangent and bitangent vectors. The tangent points in the direction of the line and the bitangent is at a right angle to the tangent.\n One thing to note, the bitangent vector isn&#39;t enough to make our curve meander. A derived bitangent generally points to the same side of the line, whereas we need our bitangent to be aware of which way the line is curved. It should always point to the outside of the curve and its length should be proportional to the curvature of the line at that point.\n      Using the tangent and modified bitangent, we create a new vector that is a blend of the two. This new vector is added to the position of each point on the curve. With this basic logic, the bends in the river form organically. The style of the bends can be influenced by adjusting the overall influence of these two vectors individually, and the intensity of the bends can be adjusted by increasing the scale of the final blended vector.\n  Tangents (blue) and modified bitangents (red) overlapped on left, new blended directional vector (purple) on right\n    If you are reading this, it is because your browser does not support the HTML5 video element.\n  When a river bends back into itself, the meander bend gets cut off in favor of a shorter path. This process creates oxbow lakes which are generally crescent shaped bodies of water to the sides of the main river flow. To find potential oxbows in our river, we do distance checks to see if the river is in danger of overlapping itself. If a near collision is found, the part of the curve between the two collision points is isolated and turned into its own curve segment. The only behavior that these newly generated lakes exhibit is that they get smaller over time until they are deleted from the system.  (The current system doesn&#39;t allow for the river to reintersect the oxbow lakes, so an extra step is added to ensure that the lake deletes parts of itself that are at risk of being overlapped by the river.)\n            The background grid-based plots were created by scattering some points on the main river spline and some additional points on the background plane. Voronoi Fracture is used to turn the background plane into smaller polygons with irregular edges. Each polygon is then broken up into a non-uniform grid. Each of those new polygons is broken up further with an iterated subdivision loop which creates plots of pseudo-random sizes. Finally, an organic shape created from the river geometry is used to create boundary plots along the shore. The center point of the final set of polygons is calculated which becomes the location of the plot id number text layer.\n              The network of roads didn&#39;t begin as a network of roads. The initial algorithm was an attempt to create an organic growth pattern. The system begins with some randomly placed points. Each point is given a directional growth vector. The point moves along this growth vector and draws a line as it goes. If the point encounters another line, it stops. As the point moves, the directional vector rotates slowly. I found that if I mix curving vectors with non-curving vectors, the result ended up resembling intersecting roads. I emphasized this result by making the thickness of the lines be directly proportional its length.\n      The first map images that I created lacked a sense of place. There were no names for any of the places which seemed like a missed opportunity to do something compelling. I considered randomly generated nonsense strings, or manually naming places, but neither of these options seemed like a good scalable solution.\n I discussed the problem with  Andrew Bell and he found a USGS database ( GNIS data) of geographic place names. He then wrote a python script to parse the content and crop off the suffix (things like &#34;Lake&#34; or &#34;Summit&#34;) to produce a list of proper names to use for my features. I did not want to name features after places that already exist so cropping off the suffix helps to reduce the likelihood of recreating something called &#34;Hudson River&#34;. Instead, new suffixes were randomly added to produce feature names like &#34;Hudson Summit&#34; or &#34;Hudson Swamp&#34;. Additionally, he pulled out duplicate entries as well as excessively long names (  Little West Fork West Branch Feather River showed up in one of the generated maps).\n The features that were isolated for naming include the main river, lakes, islands, peaks, basins, and marshland. The river, lakes, and islands were easy enough since those features are present from the creation of the river system itself. The peaks and basins were isolated by analyzing the slope of the terrain. Flat sections were found and if those flats were near the water level, it was considered a basin. If the flat was at a high elevation, it was designated as a peak. The marshland was slightly more challenging. Areas with low slope were isolated and turned into axis-aligned bounding boxes whose center became the location for the label. Future iterations of this project will find ways to lay the text out in a more map-like manner with text flowing along features like ridges and thin lakes.\n          There are some features that I would like to implement which would require a rework of the meandering logic itself. The current system is not as robust as I would like it to be. I&#39;m considering moving from a spline-based approach to a particle-based one which might make branching rivers possible as well as natural lake formation. The particle based approach could also make river deltas possible as well as allowing rivers to re-intersect existing oxbows.\n I would also like to work on making the road system an iterative approach. The first pass would lay out the major highways, the second pass would build secondary roads off the first pass, etc. I also need to work on the logic for how roads should avoid growing up steep slopes.", "posttime": "2020-05-27 06:41:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "河流,maps", "title": "曲折：从来不存在的河流地图", "title_en": "Meander: Maps of rivers that never existed", "transed": 1, "url": "http://roberthodgin.com/project/meander", "via": "", "real_tags": ["河流", "maps"]}, {"category": "", "categoryclass": "", "imagename": "80f7d5a82b427f9b94efb32151e90764.png", "infoid": 1003855, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Stormkit与您的GIT流完美集成。它可以无缝构建、部署和扩展您的javascript应用程序。\n您的提交已在Stormkit上成功构建。您可以单击以下链接进行预览。\n您的提交已在Stormkit上成功构建。您可以单击以下链接进行预览。\n喜欢用户体验和内置的Nuxt.js支持。到目前为止很棒的经验，保持好的工作！\n在Stormkit之前，我们管理自己的Docker工作流。在迁移之后，我们每年节省数百个小时。\n我印象深刻的是，我们使用Stormkit使我们的自定义安装工作变得如此简单，并改善了我们的开发人员体验。做得好!。\n您可以构建、部署和发布所有这些技术以及更多-我们的系统旨在支持任何Node.js或JAMStack应用程序。\nNavigesNext在Javascript应用程序的整个生命周期中简化和自动化复杂的流程。\n为什么？我们认为开发者应该能够专注于用户问题，而不是管理工具、服务和基础设施。\n什么？我们使您的工作基础设施自动化，并提供包含最先进的最佳实践和功能的套件。", "note_en": "Stormkit integrates perfectly with your git flow.   It builds, deploys and scales your javascript apps seamlessly.\n  Your commit has been built succesfully on   Stormkit. You can click the following link to preview it.\n  Your commit has been built succesfully on   Stormkit. You can click the following link to preview it.\n  Loved the user experience and built-in Nuxt.js support. Great experience so far, keep up the good work!\n Prior to Stormkit we were managing our own Docker workflow. We have saved hundreds of hours per year after the migration.\n I&#39;m impressed how easy we made our custom setup work with Stormkit and improved our developer experience. Good job!\n  You can build, deploy and publish all these technologies and more - our system is designed to support any Node.js or JAMStack application.\n  navigate_next  Simplify and automate complex processes over the entire life cycle of a Javascript application.\n  Why?   We believe that developers should be able to focus on user problems instead of managing tools, services and infrastructure.\n  What? We automate your work infrastructure and provide a kit that includes state of the art best practices and features.", "posttime": "2020-05-27 06:40:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "花费,access", "title": "无需花费数小时即可轻松访问前端的AWS基础设施", "title_en": "Getting easy access to AWS infrastructure for frontends without spending hours", "transed": 1, "url": "https://stormkit.io", "via": "", "real_tags": ["花费", "access"]}, {"category": "", "categoryclass": "", "imagename": "e46a49402fba87f8a5133c3aa2bd0a6a.jpg", "infoid": 1003854, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周二，Twitter首次在特朗普总统的推文上贴上了事实核查的标签，以回应长期以来的批评，即该公司在监管世界领导人的错误信息和虚假信息方面过于放手。\n这一举动在大选年升级了华盛顿和硅谷之间的紧张局势，是对特朗普在过去24小时内的两条推文的回应。这些推文错误地声称邮寄选票是欺诈性的。推特的标签说，“获取邮寄选票的事实”，并将用户重定向到有关特朗普未经证实的说法的新闻文章。\n没有办法(零！)。邮寄的选票将不会有实质性的欺诈性。邮箱将被抢劫，选票将被伪造&amp；甚至非法打印出来&amp；伪造签名。加州州长正在向数以百万计的人发送选票，任何人……。\n-唐纳德·J·特朗普(@realDonaldTrump)2020年5月26日。\nTwitter发言人凯蒂·罗斯伯勒(Katie Rosborough)表示，这些推文“包含关于投票过程的潜在误导性信息，已被贴上标签，以提供有关邮寄选票的额外上下文。”\n.生活在该州，无论他们是谁，也不管他们是如何到达那里的，都会得到一份。随后，专业人士将告诉所有这些人，他们中的许多人以前从未想过投票，如何投票，以及投票给谁。这将是一场被操纵的选举。不行!。\n-唐纳德·J·特朗普(@realDonaldTrump)2020年5月26日。\n推特的行动发生在推特因特朗普的另一组推文而面临接二连三的批评的一天。周二早些时候，乔·斯卡伯勒(Joe Scarborough)的一名前员工的丈夫要求Twitter首席执行官杰克·多尔西(Jack Dorsey)删除特朗普总统的推文，进一步助长了关于这名员工妻子死亡的毫无根据的阴谋论。\n在其14年的历史中，Twitter允许世界领导人和普通公民的错误信息几乎不受控制地传播。其领导人长期以来一直表示，该平台的用户将在该平台上进行辩论，并自行纠正虚假信息。\n相比之下，其规模大得多的竞争对手Facebook在几年前推出了一项事实核查计划。Facebook资助了一支第三方事实核查人员大军来调查内容，然后这些内容会在网站上贴上标签，并在其覆盖范围内降级。\nTwitter拥有约3.3亿用户，而Facebook的用户为26亿，Twitter没有资源或机构意愿来吸引事实核查人员。\n但推特在大流行期间彻底改变了做法。今年3月，该公司修改了服务条款，表示将删除任何人的帖子，即使是世界领导人的帖子，如果这些帖子“违反了全球和公共卫生信息权威来源的指导”。例如，这包括声称社交距离无效或精油可以用来治疗疾病的评论。\n不久之后，Twitter首次将这一政策应用于世界各国领导人，删除了巴西总统贾尔·博尔索纳罗(Jair Bolsonaro)和威尼祖兰总统尼古拉斯·马杜罗(Nicolas Maduro)的推文，认为关于打破社会疏远秩序和兜售虚假治疗的推文具有如此大的潜在危害，给它们贴上标签是不够的。\n然后在本月早些时候，Twitter推出了一项新政策，称将对与Covid相关的错误信息贴上标签或提供警告信息，即使这些信息不是卫生当局的直接矛盾，也没有直接违反公司的政策。该公司当时表示，可能会将标签扩展到其他问题领域，例如其他类型的健康相关恶作剧或其他有伤害风险的情况。周二关于选举的推文代表着向与选举相关的错误信息的新领域扩张。", "note_en": "Twitter on Tuesday slapped a fact-check label on President Trump’s tweets for the first time, a response to long-standing criticism that the company is too hands-off when it comes to policing misinformation and falsehoods from world leaders.\n The move, which escalates tensions between Washington and Silicon Valley in an election year, was made in response to two Trump tweets over the past 24 hours. The tweets falsely claimed that mail-in ballots are fraudulent. Twitter’s label says, “Get the facts about mail-in ballots,” and redirects users to news articles about Trump’s unsubstantiated claim.\n There is NO WAY (ZERO!) that Mail-In Ballots will be anything less than substantially fraudulent. Mail boxes will be robbed, ballots will be forged &amp; even illegally printed out &amp; fraudulently signed. The Governor of California is sending Ballots to millions of people, anyone.....\n— Donald J. Trump (@realDonaldTrump)  May 26, 2020\n The tweets, said Twitter spokesperson Katie Rosborough, “contain potentially misleading information about voting processes and have been labeled to provide additional context around mail-in ballots.”\n  ....living in the state, no matter who they are or how they got there, will get one. That will be followed up with professionals telling all of these people, many of whom have never even thought of voting before, how, and for whom, to vote. This will be a Rigged Election. No way!\n— Donald J. Trump (@realDonaldTrump)  May 26, 2020\n Twitter’s actions come on a day when Twitter was facing a barrage of criticism over another set of Trump tweets. Earlier on Tuesday the widower of a former staffer to Joe Scarborough asked Twitter chief executive officer Jack Dorsey to delete tweets by President Trump furthering a baseless conspiracy theory about the staffer’s wife’s death.\n   For its 14-year existence, Twitter has allowed misinformation by world leaders and everyday citizens to spread virtually unchecked. Its leaders have long said that the platform’s users would engage in debate on the platform and correct false information on their own.\n Its much larger rival Facebook, by contrast, launched a fact-checking program several years ago. Facebook funds an army of third-party fact checkers to investigate content, which then gets labeled on the site and demoted in its reach.\n   Twitter, which has roughly 330 million users compared to Facebook’s 2.6 billion, has not had the resources or the institutional will to engage fact-checkers.\n But Twitter has radically changed its approach during the pandemic. In March, the company revised its terms of service to say that it would remove posts by anyone, even world leaders, if such posts went “against guidance from authoritative sources of global and public health information.&#34; That includes comments claiming that social distancing is ineffective or essential oils can be used to cure the disease, for example.\n  Soon after, for the first time, Twitter applied the policy to world leaders, removing tweets by Brazilian president Jair Bolsonaro and Venezulan President Nicolas Maduro, arguing that the tweets about breaking social distancing orders and touting false cures had such potential for harm that labeling them would be insufficient.\n  Then earlier this month, Twitter rolled out a new policy saying that it would label or provide warning messages about covid-related misinformation, even when that information is not a direct contradiction of health authorities and does not directly violate the company’s policies. The company said at the time that it may expand the labels to other issue areas, such as other types of health-related hoaxes or other situations where there is a risk of harm. Tuesday’s tweets on elections represent an expansion into a new area of election-related misinformation.", "posttime": "2020-05-27 06:39:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,核查,labels,推文", "title": "推特首次将特朗普的推文贴上事实核查的标签", "title_en": "Twitter labels Trump’s tweets with a fact-check for the first time", "transed": 1, "url": "https://www.washingtonpost.com/technology/2020/05/26/trump-twitter-label-fact-check/", "via": "", "real_tags": ["推特", "核查", "labels", "推文"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003853, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Google Cloud Platform或GCP在过去两年多的时间里提升了其他云服务提供商的标准。由于GCP的参与增加，原本看起来像AWS和Azure之间的两匹马比赛的情况现在发生了变化。直到最近，随着GCP决定积极推进产品和服务，CXO一直有一个二元选择-导致了第三个选择。他们面临的第一个问题是-GCP的优势是什么？为什么会选择GCP而不是AWS或Azure？\n值得注意的是，为什么AWS over Azure或Azure over AWS只是几年前的起点。一家企业刚刚通过了这两项中的一项。\n有了云计算，企业可以满足今天的需求，并通过利用尖端和创新的产品、动态定价模式、X-as-a-a-service模式和更高的敏捷性，奠定基础，使其能够在未来的竞争中超越竞争对手。\n虽然这些都是云供应商的共同优势，但GCP在几个大的类别中将自己与其他供应商区分开来，我们将在这篇文章中详细介绍每一个。\n如果你看一看广阔的大数据/Hadoop市场，你会看到一系列的术语、工具、框架-Map/Reduce、HBase、Apache Drill、Parquet格式等等，不胜枚举。还有其他开源项目，如HTTP/2、GRPC、Protocol Buffers；机器学习产品，如TensorFlow，包含Kubernetes等管理解决方案，Anthos等混合云解决方案，甚至SRE等流程和实践--所有这些不同的工具/框架都有一个共同点--Google及其开源贡献。\n使用Google-GCP，您在竞争之前获得尖端和创新产品的机会要高得多。\n使用GCP，您可以使用计算和内存的任意组合，同时使用快速磁盘和任何实例进行联网。您需要使用网络优化实例，并发现生产中的CPU和/或RAM短缺。实例选择更简单，不会根据计算、内存、存储和网络进行细分。用户可以完全灵活地更改实例的四个功能中的任何一个-自定义RAM和CPU组合以及可配置的IPO、磁盘大小、带宽和网络。\n谷歌使用自己的光纤网络，提供超低延迟，也被第三方广泛记录。它还使用全球SDN(软件定义网络)，该网络专门为微服务和大数据工作负载提供了令人难以置信的性能。\n这个专用网络意味着-企业工作量在专用高速公路上旅行，完全绕过拥堵的互联网车道。\n没有其他供应商投资和创新产品，使企业客户可以选择避免供应商锁定。\n使用Kubernetes，它允许以与机器/操作系统/供应商无关的方式编写和管理应用程序。\n同时，通过Anthos，它允许这些应用程序在任何云平台上运行。\n根据Gartner的说法，未来是混合的，似乎只有GCP才能使其成为可能。\n这也与创新息息相关。如果2005-2014年是一个大数据时代，那么2015-2024年无疑将是一个云计算时代-在那里它将被广泛采用。未来将是一个机器学习和人工智能的时代，在这个时代，它的使用将成为商品，它将很容易使用，每个企业-无论大小-都将拥有某种形式的ML/AI。\nGCP也将在未来实现这一目标。有了TensorFlow，它使ML成为了一个任何人都可以插入的框架/工具。\nGCP的价格竞争战略是为持续使用、定制使用和承诺使用自动提供折扣。\nGCP的可抢占虚拟机或Spot实例在标价的基础上有80%的固定折扣。没有现货市场需要处理。这一固定价格使企业能够始终如一地预测成本。\n虽然没有关于哪家云提供商提供更多服务和工具的争论，但有一个问题是关于哪家提供商提供了不同的、根据全球规模量身定做的工具和服务。\nGCP提供了一个其他提供商没有的工具--它不是Kubernetes和Anthos。是扳手。它兼具-SQL和非-SQL的优点；它具有全球规模和强大的一致性保证。\n云计算不是要不要的问题，而是何时的问题。这个问题的答案是，什么时候会定义一家公司-它会成就一家企业，也会毁掉一家企业。它不再是一个成本中心，它是让企业在竞争中奋进的推动者。云支持企业的快速变化，没有人能比谷歌更好地处理快速变化。\n企业未来的与众不同之处将是他们实现目标的速度和灵活性-云实现了这一点，而谷歌云通过尖端技术和创新增强了这一点。", "note_en": "Google Cloud Platform or  GCP has raised the bar for other cloud service providers since last 2 odd years. What was increasing looking like a two horse race between AWS and Azure, has now changed due to increased participation from GCP. A CxO had a binary choice until very recently, with GCP deciding to aggressively move forward on products and services - has led to a 3rd alternative. And the first question they face is -  What are the advantages of GCP?  Why would one choose GCP over AWS or Azure?\n It is important to note that Why AWS over Azure or Azure over AWS was the starting point only few years ago. An enterprise just went ahead with one of the two.\n  With Cloud computing, an enterprise could meet today’s demand and lay a foundation that allows it to leapfrog ahead of competition in future by utilising  cutting edge and innovative products,  dynamic pricing models,  X-as-a-service model and  increased agility.\n While these are common benefits across a cloud vendor, GCP has set itself apart from others in few broad categories and we will examine each in a bit of detail in this post.\n    If you take a look at the broad Big Data/Hadoop market, you would see a range of jargons, tools, frameworks -  Map/Reduce, HBase, Apache Drill, Parquet Format and so on, the list goes on and on. Then you have other open source initiatives like  HTTP/2, gRPC, Protocol Buffers; machine learning products like  Tensorflow, contain management solutions like  Kubernetes, Hybrid cloud solution like  Anthos, even processes and practices like  SRE - all these diverse tools/frameworks has one thing in common - Google and its open source contributions.\n Your chances of getting a cutting edge and innovative product before the competition is much higher with Google - GCP.\n  With GCP, one could got with any combination of compute and memory while the fast disks and networking with any instance. One need to go with a &#34;Network Optimised Instance&#34; and discover CPU and/or RAM shortages in production.  Instance choices are simpler and not segmented based on Compute, Memory, Storage and Networking. A user has full flexibility to change any one of the four features of an instance -  Custom RAM and CPU combination with configurable IPOS, disk size, bandwidth and networking.\n   Google uses its own fiberoptic network with provides ultra low latency and has been widely documented by 3rd parties as well. It also uses a global SDN (Software Defined Network) which offers incredible performance specially for Microservices and big data work loads.\n This private network means - an enterprises workload travel on a dedicated superhighway bypassing the congested internet lanes altogether.\n  No other provider is investing and innovating in products that gives an enterprise customer option to avoid vendor lock-in.\n With  Kubernetes, it allows applications to be written and managed in a machine/os/vendor agnostic way.\n At the same time, with  Anthos, it allows those application to be run in any cloud platform.\n As per Gartner, the future is hybrid and only GCP seems to be making it possible.\n  This ties into Innovation as well. If 2005-2014 was an era of Big Data, there is no doubt that 2015-2024 would be an era of Cloud Computing - where it would be adopted widely. The future would be an era of Machine learning and AI where its usage would become commodity, it would be easy to use and every enterprise - big and small - would have some form of ML/AI.\n GCP stands to deliver on that future as well. With Tensorflow, it has made ML a framework/tool that any one could plug into.\n    GCP&#39;s strategy for competing on price is to offer discounts for sustained use, for customised use, and for committed use  automatically.\n GCP&#39;s  Preemptible VMs or Spot Instances are a fixed flat 80% off of list price. There is no spot market to deal with. This fixed price allows an enterprise to project costs consistently.\n  While there is no debate around which cloud provider gives more services and tools - there is a question around which provider gives tools and services that are different and are tailored to global scale.\n GCP provides one such tool that no other provider has -- it is not Kubernetes and Anthos. It is  Spanner. It is best of both - SQL and No-SQL worlds; it has global scale and strong consistency guarantees.\n  Cloud computing is not a question of if but when. And the answer to that when would define a company - it would make or break an enterprise. IT is no longer a cost centre, it is an enabler that allows enterprises to forge ahead of competition. Cloud enables rapid changes in enterprises and no one had been able to handle rapid changes better than google.\n The differentiator going forward for enterprises is going to be the speed and agility with which they can achieve a goal - cloud enables that and google cloud augments that with cutting edge technology and innovation.", "posttime": "2020-05-27 06:39:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "选择,gcp", "title": "为什么会选择GCP而不是其他云提供商？", "title_en": "Why would one choose GCP over other cloud providers?", "transed": 1, "url": "http://www.xmsxmx.com/gcp-advantages-benefits-over-aws-azure/", "via": "", "real_tags": ["选择", "gcp"]}, {"category": "", "categoryclass": "", "imagename": "318035ae0a295cb5a3516b0d5a8bd887.jpg", "infoid": 1003851, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一系列推文中出现了一个新的警告标签，鼓励推特用户“了解邮寄选票的事实”。在这些推文中，总统毫无根据地声称，通过邮寄投票方式收到的选票是“欺诈性的”。\n在给TechCrunch的一份声明中，Twitter的一位发言人表示，总统的两条推文“包含关于投票过程的潜在误导性信息，已被贴上标签，以提供有关邮寄选票的额外背景信息。”\n“这一决定与我们本月早些时候分享的方法是一致的，”这位发言人说，并链接到该公司最近发布的关于其错误信息政策的博客文章。\n点击推特的新提示，用户会进入一个事实核查页面，突出显示CNN的一篇报道，揭穿了总统的虚假说法。该页面还提供了一个摘要，其中的要点为误导性的推文提供了有用的背景，包括邮寄投票已经在全国广泛使用的事实。\n最近几周，特朗普一直在抨击邮寄投票的努力，尽管专家们一致认为，邮寄投票是一个安全的过程-如此安全，以至于它已经被广泛用于缺席投票，并在五个州被作为主要的投票方式。", "note_en": "A new warning label encouraging  Twitter   users to “Get the facts about mail-in ballots” appeared on a series of tweets in which the president baselessly claimed ballots received through mail-in voting methods are “fraudulent.”\n   In a statement to TechCrunch, a Twitter spokesperson said the  pair of tweets from the president “contain potentially misleading information about voting processes and have been labeled to provide additional context around mail-in ballots.”\n “This decision is in line with the approach we shared earlier this month,” the spokesperson said, linking to the company’s  recent blog post on its misinformation policies.\n Clicking through the new prompt from Twitter brings users to a fact-checking page highlighting a CNN story debunking the president’s false claims. The page also offers a summary with bullet points providing useful context for the misleading tweets, including the fact that vote-by-mail is already widely in use around the country.\n Trump has railed against  vote-by-mail efforts in recent weeks, in spite of the consensus view by experts that voting through the mail is a safe process—so safe that it’s already widely used for absentee ballots and relied upon in five states as the primary method for voting.", "posttime": "2020-05-27 06:23:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,核查,adds,邮寄", "title": "推特增加警告标签事实核查特朗普的虚假投票主张", "title_en": "Twitter adds a warning label fact-checking Trump’s false voting claims", "transed": 1, "url": "https://techcrunch.com/2020/05/26/twitter-trump-labels-fact-checking-tweet/", "via": "", "real_tags": ["推特", "核查", "adds", "邮寄"]}, {"category": "", "categoryclass": "", "imagename": "bf617375b255942def3e9a107f7506aa.jpg", "infoid": 1003850, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Twitter的一位发言人在一份声明中告诉国会山：“我们对这些声明以及它们引起的关注给这家人带来的痛苦深表歉意。”\n我们一直在努力扩展现有的产品功能和政策，这样我们就可以更有效地解决像这样的事情，我们希望这些变化很快就能到位。&#34；我们一直在努力扩展现有的产品功能和政策，这样我们就可以在未来更有效地解决类似的问题，我们希望这些变化很快就能到位。\n在斯卡伯勒办公室工作的洛里·克劳苏蒂斯(Lori Klausutis)的鳏夫曾书面要求推特删除这些帖子。洛里·克劳苏蒂斯(Lori Klausutis)于2001年去世，此前她的心律异常导致她失去意识，头部撞到了佛罗里达州斯卡伯勒国会办公室的桌子上。她的死被裁定为意外。\n我是一名研究工程师，不是律师，但我审阅了Twitter的所有规则和服务条款。总统在推特上表示，洛莉是在没有证据的情况下被谋杀的，这与官方的尸检结果相反，这违反了推特的社区规则和服务条款。像我这样的普通用户会因为这样的推文而被驱逐出平台，但我只是要求删除这些推文。\n针对精神病患者乔·斯卡伯勒(Joe Scarborough)的悬案开庭并不是唐纳德·特朗普(Donald Trump)最初的想法，这已经持续了多年，早在我加入合唱团之前。2016年，当乔和他未来古怪的前妻米卡(Mika)没完没了地采访我时，我会一直在想……。\n-唐纳德·J·特朗普(@realDonaldTrump)2020年5月26日", "note_en": "“We are deeply sorry about the pain these statements, and the attention they are drawing, are causing the family,&#34; a Twitter spokesperson told The Hill in a statement.\n &#34;We&#39;ve been working to expand existing product features and policies so we can more effectively address things like this going forward, and we hope to have those changes in place shortly.&#34;\n  The widower of Lori Klausutis, the woman who worked in Scarborough&#39;s office, had asked Twitter in writing to remove the posts. Lori Klausutis died in 2001 after an abnormal heart rhythm caused her to lose consciousness and hit her head on a desk in Scarborough’s congressional office in Florida. Her death was ruled an accident.\n  &#34;I&#39;m a research engineer and not a lawyer, but reviewed all of Twitter&#39;s rules and terms of service. The President&#39;s tweet that suggests that Lori was murdered without evidence and contrary to the official autopsy is a violation of Twitter&#39;s community rules and terms of service. An ordinary user like me would be banished from the platform for such a tweet but I am only asking that these tweets be removed.&#34;\n    The opening of a Cold Case against Psycho Joe Scarborough was not a Donald Trump original thought, this has been going on for years, long before I joined the chorus. In 2016 when Joe &amp; his wacky future ex-wife, Mika, would endlessly interview me, I would always be thinking....\n— Donald J. Trump (@realDonaldTrump)  May 26, 2020", "posttime": "2020-05-27 06:07:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,推文,deeply,办公室", "title": "推特对特朗普的推文深表歉意，但不会删除这些推文", "title_en": "Twitter 'deeply sorry' about Trump's tweets, but won't remove them", "transed": 1, "url": "https://thehill.com/homenews/media/499539-twitter-deeply-sorry-about-trumps-tweets-on-scarborough-late-intern-but-wont", "via": "", "real_tags": ["推特", "推文", "deeply", "办公室"]}, {"category": "", "categoryclass": "", "imagename": "a82f25a1c31ae93dbc383b1030770cf8.png", "infoid": 1003848, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "艾尔·里斯和杰克·特劳特在“定位：为你的头脑而战”一书中向我们介绍了广告中常用的品牌和产品定位的基本概念。\n但那是在20世纪80年代出版的，在知识上留下了一些空白。虽然里斯和特劳特的概念仍然是基本的，但并没有真正将它们付诸实践的方法。\n阿普丽尔是一个定位大师，顾问、作家和主旨演讲者。在科技界从事了20多年的营销工作后，在她丰富的产品定位经验的推动下，她决定填补定位知识的空白。\n她的书，显然很棒！(亚马逊英国；亚马逊美国)，详细介绍了定位产品的10个步骤流程，任何企业家或营销商都可以遵循。\n大约一年前，我非常自然地第一次看到了四月的书。我发现它非常有用，所以我知道我必须尽快面试她。\n我想听一个能说明产品定位价值的故事，同时也能让我深入了解如何用邓福德的方式来定位产品。\n我得到的这个是完美的：从来没有公开过，充满了细节，有趣，令人印象深刻(10亿美元的收入！)，而且非常有洞察力。\n这次我要在文章末尾去掉几个链接。它们包括一个四月的模板，以及一个由一家使用这种方法定位产品的真实公司发布的示例。\n这是一个非常古老的故事，我以前没有讲过，但它真的很巧妙。\n对于大多数初创企业来说，产品的想法都是基于我所说的定位论文。所以，你有一个想法，比如我想要建立更好的电子邮件，或者，就像这个故事一样，我们想要建立一个更好的数据库。\n当时，关系数据库都是很大、很复杂的东西，您必须安装在服务器上。您需要一个管理员，他们需要大量的资源，而且很难安装、很难设置和很难使用。这是很久以前的事了，我们正处于智能移动设备的早期(我们实际上处于笔记本电脑等技术的早期)。\n我们的想法是创建一个允许您使用SQL编程的数据库(就像您在大型数据库中一样)，不过我们要做的是占用空间小，两次单击安装，不需要管理员，那种您可以在PC上运行的数据库。我们的想法是把它作为电子表格的替代品卖给人们。\n我们把它设想为商业生产力软件。你可以把这个东西放在你的PC或笔记本电脑上，如果你必须操作一些数据和编写结构化查询，但你不想用Excel电子表格格式来做，你可以使用我们的东西。\n我们认为这很酷(我们是超级技术人员)，我们通过与一些现有客户交谈来验证这个想法，这些客户大多也是超级技术人员。每个人都去了，听起来很酷！\n我们发布了这个产品，我们把它作为一个小的独立数据库出售。虽然我们真的把它定位为生产力软件，但它是Excel的替代品。\n我们推出了这款产品，并围绕它开展了营销活动，将其投放市场，但我们并没有卖得很多。结果发现没有人想要它。我们卖出了几百本，但这些东西只卖100美元一支，所以我们需要卖几千本。而且，我们没有卖出数千台，所以看起来有点失败。\n几个月后，我们决定停止使用这种产品，因为它很难闻。\n我是团队的初级成员，担任产品营销的角色。我的老板对我说，接下来我要你给我们的客户打个电话，我们只有几百个，但如果你能弄到100个左右就太好了。只要试探一下他们对产品的所作所为，看看如果我们停止使用产品，他们会不会生气。\n现在，该产品不是SaaS，它是您在计算机上安装的独立软件，因此我们没有任何客户使用数据。我们知道我们的销量不是很高，所以我们怀疑人们也没有太多地使用它-但我们并不确定，我们也不想让每个人在我们告诉他们我们要关闭产品时都会生气。所以我们想我们应该先给他们打个电话，看看每个人都在做什么，然后我们再评估一下每个人会有多生气。\n我拿到了顾客名单，开始给每个人打电话。我有一个月没做别的事了，如果幸运的话，我现在每天有三到四次谈话。在第一周结束时(在大约15-20个人之后)，我发现几乎每个电话都是一样的：\n我：你好，我是4月份，我是从WATCOM公司打来的电话，我想知道你们使用这种产品的情况。\n我：是的，是的，让我调出我的记录。是的，您是在1月10日买的。\n他们：哦，对了！是啊，我是说看起来很酷。我们买了它，我们玩了一会儿，但后来我们并没有真正用上它。\n我有这么多这样的谈话，所以我在想，这没什么大不了的，我们想让这款产品停用，但甚至没有人知道他们有它。\n但是后来我的客户电话号码是21。我让那家伙接电话，他说：哦！那个东西！太神奇了，简直像变魔术一样！\n他的故事是，他让所有的销售人员都带着笔记本电脑(这是给你的销售人员一台笔记本电脑的早期)，他们过去常常到外地去。他说，他的问题是，他所有的销售人员都到外地去，但该公司的订单系统是内部的，运行着这个大型的甲骨文数据库。他的推销员会去外地接订单，把它写在纸上，然后他们会回到办公室，手动将订单输入他们的数据库。\n他说，有时他们会犯错误，或者他们会错误地引用订单，或者错过一条信息，最终不得不与客户来回来回三四次才能把订单做好。\n他所做的是将我们的SQL数据库放在笔记本电脑上，因为占用的空间非常小，可以放在笔记本电脑的小内存空间中，而且它与他在总部的Oracle数据库兼容。我们的客户编写了一个小程序，这样他们就可以在与客户在一起时在笔记本电脑上接受订单。然后，他们返回到办公室插件，自动与总部的大型甲骨文数据库同步。\n我觉得这很奇怪，这不是我们做这个产品的目的。但是我没有勇气告诉那个家伙我们要终止这款产品，所以我把它写了下来，并不断地打电话给更多的客户。\n我又打了一大堆电话，大多数情况下，其他人都没有用它做任何事情。\n但后来我找到了另一个人，他也在做同样的事情。这有点不同，因为他有现场服务代表，而不是销售人员。尽管如此，现场服务代表需要做一些笔记并跟踪事情，因此他们再次将数据库放在笔记本电脑或移动设备上。同样，当代表回到总部时，这些数据将与大型Oracle数据库同步。\n我最终打了100个电话，我有六七个人把我们的数据库放在某种移动设备上，让他们不在总部的团队能够做一些事情，然后他们可以把总部的数据同步到一个更大的SQL数据库上。\n我回到我当时的老板和高管团队那里，我喜欢好消息和坏消息。好消息是，我打了一百个电话，我知道人们在用这个产品做什么，绝大多数人不使用它，不喜欢它，如果我们关掉它，也不会有一丝悲伤。但是，我有这一小撮异类在以一种我们从未预料到的方式使用这款产品，当我们关闭它时，他们会非常失望。\n这在内部引发了一场讨论，我们如何才能将这个数据库重新定位为完全不同的东西，并成功地将其作为另一个东西销售。\n我们做到了，我们对它进行了重新定位，这样它就不再是与excel竞争的桌面生产力软件，而是一个可嵌入的移动设备数据库。\n好消息是，当时移动设备可嵌入数据库的竞争并不激烈。然而，也有一些人建造了自己的东西，试图完成我们所做的同样的事情。\n这需要业务上完全不同的转变。我们采取了不同的定价模式：我们不再一次销售一个数据库，我们将根据客户的销售队伍有多大，一次销售数百份。我们需要改变我们进入市场的路线，我们以前是从我们的网站上一次销售一份，但这将需要一名销售人员去与IT部门和销售主管交谈，以解释这件事是关于什么的。\n在一笔更大的交易中，这些交易从每笔100美元增加到了潜在的数千美元的收入。\n它最初的想法是，我们可以简单地用不同的方式讲述这个故事。\n我们必须弄清楚产品会变成什么样子，因为我们已经了解了旧产品(Excel)具有竞争力的可比性，但我们现在知道，对于我们最满意的客户来说，Excel不是可比性的。只有不高兴的客户才会把我们比作Excel，而现在高兴的客户根本不把我们当成Excel的替代品。\n我们满意的客户将我们与他们为数据存储构建的临时脚本相提并论，这些脚本安装在笔记本电脑上，可以与甲骨文同步。他们目前的解决方案非常复杂，而且是自主开发的。\n所以我们的第一步是看这个新的场景：我们有一个新的可比性；因此，我们有不同的有趣的功能。我们满意的客户喜欢我们，因为我们的SQL与他们的总部数据库兼容，而且我们的数据库占用的空间足够小，不会占用太多硬盘。\n这意味着他们可以把它放在资源非常有限的笔记本电脑或移动设备上，然后派人去实地考察。\n所以，它从洞察谁喜欢我们的东西开始，为什么喜欢我们的东西。这让我们想到了不同的竞争对手，因此，不同的关键功能，以及我们可以为客户提供的不同价值。\n然后，我们选择了不同的目标客户，最后，我们将我们的市场类别从商业生产力软件转向了用于移动设备的嵌入式数据库。\n我认为这个故事的结果是它变得很酷。我们最初这样做是为了测试，所以我们一开始雇佣了一名销售人员来计算定价。我们卖了一些特价商品，然后我们雇佣了越来越多的销售人员，产品开始疯狂销售。\n最终，我们被硅谷的一家大型数据库公司收购，产品继续卖啊卖啊卖。该产品今天仍然存在(请看这里：SAP SQL Anywhere)，并且仍然用作移动设备的嵌入式数据库。\n据我所知，在它的巅峰时期，它的收入是10亿美元。我们差一点就把产品扼杀了！想象一下，如果我没有进行这些对话，而是我们刚刚做了一项调查，问我，嘿，你喜欢这玩意儿吗？我们会拿回结果，我会说95%的用户认为它很愚蠢，他们不喜欢它。\n它们最终都是偶然的发现对话，因为我的目标不是问他们我们可以构建的新功能，或者您知道在客户电话中会做的任何正常事情，我的目标实际上是弄清楚他们是否在使用它，如果是的话，他们在做什么，以及这对业务的关键程度有多高，我的目标是找出他们是否在使用它，如果是这样，他们在做什么，这对业务的关键程度有多高。\n这是在我们甚至还不知道客户发现是什么之前，所以这是偶然的，但我们获得的洞察力就像是一次客户发现电话。它使我们基本上能够经历一个定位流程，就像我在我的书中概述的定位流程(亚马逊英国；亚马逊美国)。\n哈哈。重要的是要强调，我当时是初级的，虽然这是基于我收集到的洞察力，但从那时起，我就不是那个人了。这是一个重大的商业决定，而且很大程度上是首席执行官的决定。与整个团队的贡献相比，我做出的小小贡献是微不足道的，但重大的战略转变就是这样。\n美国的营销人员通常是在一个地方，用来展示洞察力，或者教育团队的其他成员，让他们了解客户在做什么，以及我们听到了什么。但是，如果你要做出改变，整个团队都必须加入进来并做出决定。\n市场营销无法靠自己做到这一点，因此，作为我现在为客户提供咨询服务的顾问，我不会做定位练习，除非我们能获得代表，而且通常情况下，整个高管团队都在房间里。这是因为，如果我不能说服销售人员、客户成功或首席执行官相信这是一件好事，这是不可能发生的。\n我们不能在泡沫中做这些事情，要想实现商业战略的重大转变，必须让每个人都走到一起。\n这是我非常、非常、非常的第一个产品，这个产品现在作为SAP的一部分一直存在。最初的公司是从加拿大滑铁卢大学剥离出来的，公司名为WATCOM。\nWATCOM最终被Sybase收购，当时我认为Sybase是世界上最大的数据库提供商之一。几年后，Sybase被SAP收购，由于我们的授权与他们的授权非常契合，他们为我们提供了充足的资金，在某种程度上让我们不为所动。\n在那之后，我们继续疯狂增长，因为我们处于移动设备崛起的正确时机-每台设备都需要我们整洁的嵌入式数据库。\n我和我的团队发现有一件事特别有用，那就是竞争性比较的想法。你介意也讲一下吗？\n所以，竞争性的可比性对我来说也是一个小小的突破。说实话，我不是从市场营销起步的，但最终我管理了一个庞大的营销团队(大学毕业两年后，他妈的阿普丽尔是如何领导一个全球营销团队的)，所以我上了很多营销课程，读了很多营销书籍，因为我觉得我必须迎头赶上。\n我发现有一件事很有趣，那就是定位是一个基础性的营销概念，但我们似乎没有这样做的方法论。\n很长一段时间以来，我一直认为那真的很有趣。而且，我试图建立一种方法论，将定位分解为碎片，然后有一个将其重新组装起来的过程。\n显然，有竞争力的替代方案是定位的关键。如果不知道你和谁相比，你就不能知道你的独特价值是什么。\n但在很长一段时间里，我一直在以一种典型的方式思考竞争性比较：当有人问你谁是你的竞争对手时，你往往会想到其他和你一样做软件的供应商。\n然而，在B2B市场中，你实际竞争的往往是一个电子表格，你的目标客户目前正在使用它来解决问题。\n(见鬼：在她的书中，阿普丽尔使用了一个客户简单地使用Excel或雇佣实习生来做你的产品所做的工作的例子。如果您将您的产品与类似的软件进行比较，但您的客户正在使用实习生手动操作，那么您没有进行正确的比较。)。\n我第一次得出这个结论时，我读了很多克莱顿·克里斯滕森(Clayton Christensen)和“待做的工作”(Jobs To Do)理论。这让我想到，公司雇佣你的产品是为了做一份工作，而这份工作并不总是显而易见的。\n你真的得找个有竞争力的替代方案。毕竟，如果我不明白我真正的竞争对手是谁，那么我就不明白我的产品有什么独特之处，因为我不知道我在和谁比较。如果你不把这件事搞清楚，你的整个定位就会错。\n谢谢!。您现在已订阅-我们只会在发布新的采访时与您联系。", "note_en": "Al Ries and Jack Trout in &#39; Positioning: The Battle for Your Mind&#39; introduced us to the fundamental concepts of brand and product positioning commonly used in advertising.\n But that was published in the 1980s and left something of a gap in knowledge. While Ries and Trout&#39;s concepts are still fundamental, there wasn&#39;t really a method for putting them into action.\n  April is a positioning &#39;guru&#39;, consultant, author, and keynote speaker. After more than 20 years in marketing in the tech world, and fueled by her many experiences of positioning product, she decided to fill the positioning knowledge gap.\n Her book, Obviously Awesome!  (  Amazon UK ;   Amazon USA ), details a 10 step process for positioning a product that any entrepreneur or marketer can follow.\n I first came across April&#39;s book very naturally about a year ago. I found it so useful that I knew I had to interview her for How the F*ck as soon as possible.\n I wanted to hear a story that would illustrate the value of product positioning, but one that also gives insight into &#39;how&#39; to position a product the Dunford way.\n The one that I got was perfect: Never publicly told before, full of details, fun, impressive ($1 billion in revenue!), and super insightful.\n I&#39;m going to drop a couple of links at the end of the article this time. They include one of April&#39;s templates, and an example published by a real company who used this method to position their product.\n    This one&#39;s a really old story, one I haven&#39;t told before, but it&#39;s really neat.\n With most start-up&#39;s, the idea for a product is based on what I would call a positioning thesis. So, you have an idea for something like &#39;I want to build better email&#39; or, like in the case of this story, we wanted to build a better database.\n At the time, relational databases were all big, complex things that you had to install on a server. You needed an administrator, they took a lot of resources, and they were very difficult to install, difficult to set up, and difficult to use. This story was a long time ago, and we were in the early days of smart mobile devices (we were actually in the early days of technology like laptops).\n We had this idea that we would create a database that allowed you to program in SQL (like you would in a big database) except that we were going to make a low footprint, two-click install, doesn&#39;t need an administrator, kind of database that you could run on a PC. The idea was that we were gonna sell it to people as an alternative to a spreadsheet.\n We envisioned it as &#39;business productivity software&#39;. You would put this thing on your PC or laptop, and if you had to manipulate some data and write structured queries, but you didn&#39;t want to do it in Excel spreadsheet format, you could use our thing.\n We thought that was cool (we were super techy) and we validated the idea by talking to some of our existing customers who were, for the most part super techies, too. Everybody went &#39;yeah, that sounds cool!&#39;.\n    We released the product, and we were selling it as this little standalone database. Although we were really positioning it as productivity software that was an alternative to Excel.\n We launched the product and ran marketing campaigns around it, put it out in the market, and   we did not  sell very many. It turned out that nobody wanted it. We sold a couple hundred copies, but we were only selling these things for $100 a pop, so we&#39;d needed to sell thousands of them. And, we weren&#39;t selling thousands of them, so it looked like a bit of a failure.\n A few months in we decided we were gonna have to &#39;end-of-life&#39; the product because it was a stinker.\n    I was junior on the team, in a product marketing role. My boss said to me next &#34;I want you to call our customers, we&#39;ve only got a couple hundred of them, but it would be great if you could get a hold of around 100 of them. Just feel them out for what they&#39;re doing with the product and see if they&#39;re gonna be mad if we end-of-life it.&#34;\n Now, this product was not SaaS, it was a standalone software that you installed on your computer, so we didn&#39;t have any customer usage data. We knew we weren&#39;t selling very many, so we had the suspicion that people also weren&#39;t using it all that much - but we didn&#39;t know for sure, and we didn&#39;t want everyone to get angry if we told them that we were gonna turn the product off. So we thought we should call them first and see what everyone&#39;s doing and then we&#39;ll gauge how mad everyone&#39;s gonna be.\n I got the list of customers, and I started calling everybody. I didn&#39;t do anything else for a month, and I&#39;m having three-four conversations a day if I&#39;m lucky. At the end of the first week (after about 15-20 people) I found that almost every call went the same:\n  Me: &#34;Hi, I&#39;m April, I&#39;m calling from company WATCOM and I just wanted to know about your usage of this product.&#34;\n  Me: &#34;Yes, yes, you did, let me pull up my records. Yes you bought it on the 10th of January.&#34;\n Them: &#34;Oh yeah! Yeah, I mean it seemed cool. We bought it, we fooled around with it for a little bit, but then we didn&#39;t really use it.&#34;\n  I had so many of these conversations, so I was thinking &#39;yeah, this is gonna be no big deal, we want to end-of-life this product and no one even knows they have it.&#39;\n But then I had customer call number 21. I get the guy on the phone and he says: &#34;Oh! That thing! It&#39;s amazing, it&#39;s like magic!&#34;\n     His story was that he had all these salespeople with laptops (this was the early days of giving your salesperson a laptop) which they used to go out in the field. He says that his problem is that all his salespeople go out in the field, but the company&#39;s order system is in-house and runs this big Oracle database. His salesmen would go out in the field to take an order, write it down on paper and then they would come back to the office to manually enter the order into their database.\n He said that sometimes they&#39;d make a mistake or they&#39;d misquote the order or miss a piece of information and end up having to go back and forth with the customer three or four times before they get the order right.\n    What he was doing was putting our SQL database on the laptop, because the footprint was so small it fitted on the laptop&#39;s small memory space, and it was compatible with his Oracle database back at headquarters. Our customer wrote a small program so that they could take the order on their laptop while they were with the customer. They&#39;d then come back to the office plug-in and automatically sync up with the big Oracle database at headquarters.\n  I thought &#39;that&#39;s weird, that is not what we built this product to do&#39;. But I didn&#39;t have the guts to tell the guy we were going to end the product and so I wrote it down and kept calling more customers.\n I did a whole bunch more calls and for the most part, all the other people were not using it for anything.\n But then I got another guy who was doing the exact same thing. It was a little bit different in that he had field service reps rather than salespeople. Still, the field service reps needed to take some notes and track things and so again they had put the database on the laptop or mobile device. Again that data would be synced with the large Oracle database when the rep got back to headquarters.\n I ended up doing a hundred calls, and I had six or seven that were putting our database on some kind of mobile device to enable their teams who were not at headquarters to do stuff and then they could sync that up back at headquarters to a bigger SQL database.\n    I go back to my boss at the time and the executive team, and I&#39;m like &#39;good news and bad news&#39;. Good news is that I made a hundred calls I know what people are doing with the product, and the vast majority don&#39;t use it, don&#39;t like it, and aren&#39;t gonna be one bit sad if we turn it off. But, I&#39;ve got this handful of outliers that are using this product in a way we never expected, and they&#39;re going to be very disappointed when we turn it off.\n That sparked a conversation internally about how we could we reposition this database into something completely different and sell it successfully as this other thing.\n We did it, we repositioned it so that instead of being desk productivity software that competes with excel, it would be an embeddable database for mobile devices.\n The good thing was that there was not a lot of competition for &#39;embeddable database for mobile devices&#39; at the time. However, there were people building homegrown things trying to accomplish the same thing that we did.\n    It required a completely different shift in the business. We made a different pricing model: we were no longer selling it one database at a time, we were gonna sell hundreds of copies at a time depending on how big the customer&#39;s salesforce was. We needed to change our route to market, we were previously selling it one copy at a time from our website, but this was going to require a salesperson to go and talk to IT and the head of sales to explain what this thing was about.\n The deals went from $100 a pop to potentially thousands of dollars of revenue in a bigger deal.\n    It started out with the idea that we could simply tell the story in a different way.\n We had to work through what the product was becoming, because we had had an understanding of the competitive comparable for the old product (Excel), but we knew that now, for our most happy customers Excel was not the comparable. Just the unhappy customers were comparing us to Excel, and now the happy customers didn&#39;t see us as an Excel alternative at all.\n What our happy customers were comparing us to were the makeshift scripts that they&#39;d built for data storage, that sits on a laptop and can sync back to Oracle. Their current solutions were very complicated and homegrown.\n So our first step was to look at this new scenario: we have a new comparable; therefore, we have different features that are interesting. Our happy customers loved us because we had SQL that was compatible with their headquarters database, and our database was low footprint enough that it didn&#39;t take up too much hard disk.\n This meant that they could put it on a very resource-constrained laptop or a mobile device and send people out in the field.\n So, it started with insight into who loved our stuff and why. That got us to thinking about different competitive comparables and, therefore, different key features and, therefore, the different value we could deliver to the customer.\n We then chose different customers to target and, finally, we shifted our market category away from &#39;business productivity software&#39; to an &#39;embeddable database for mobile devices&#39;.\n      I think the result of that story is where it gets cool. We did this as a test originally, so we started out by hiring one salesperson to figure out the pricing. We sold some deals and, then we hired more and more salespeople, and the product started selling like crazy.\n    Eventually, we got acquired by a huge database company in Silicon Valley, and the product continued to sell and sell and sell. That product still exists today (look at it here:   SAP SQL anywhere ) and is still used as an embeddable database for mobile devices.\n At its peak, is my understanding, that it was making $1 billion in revenue. And we had almost killed the product! Imagine if I hadn&#39;t had had those conversations and instead we had just done a survey saying &#39;hey do you like this thing&#39;. We would have got the results back, and I would have said 95% of users think it&#39;s stupid and they don&#39;t like it.\n      They ended up being very much discovery conversations by accident because my goal was not to ask them about new features we could build or you know any of the normal things you would do on a customer call, my goal really was to figure out if they were using it, and if so what were they doing and how business-critical was that.\n This was before we even knew what customer discovery was, so it was by accident but the insight that we got was just like a customer discovery call. It enabled us to essentially walk through a position process just like the positioning process I outline in my book (  Amazon UK ;   Amazon USA )\n      Ha. It&#39;s important to highlight that I was junior at this time, and although it was based on the insight I had gathered, from there on, it was not me. This was a significant business decision, and very much the CEO&#39;s. My little contribute contribution was kind of minor when compared to the whole team&#39;s contribution, but big strategic shifts are like that.\n Us marketers are often in a place to shine a light on insight or to educate the rest of the team on what the customers are doing and what we are hearing. But, the whole team has to get on board and make the decision if you&#39;re gonna make a shift.\n Marketing doesn&#39;t get to do that on their own and so, as a consultant now with my clients, I don&#39;t do a positioning exercise unless we can get representation, and usually, it&#39;s the whole executive team in the room together. That&#39;s because if I can&#39;t convince sales, customer success, or the CEO that it&#39;s a good thing to do, it ain&#39;t gonna happen.\n We don&#39;t get to do these things in a bubble it&#39;s gotta be everybody coming together if there is going to be a big shift in business strategy.\n    There was my very, very, very first product and that product lives on now as part of SAP. The original company was a spin-out from the University of Waterloo here in Canada, the company was called   WATCOM.\n WATCOM was eventually acquired by a Sybase which, at the time, was I think one of the biggest database providers in the world. Years later, Sybase was acquired by SAP, and because our mandate fit so nicely under theirs, they funded us well and kind of left us alone.\n After that, we just continued to grow like crazy because we were at the right time for the rise of mobile devices – our neat embeddable database was needed on every device.\n  One thing my team and I found particularly useful was that idea of competitive comparables. Would you mind going into that, too?\n  So, the competitive comparable was a bit of a breakthrough for me too. To tell you the truth, I didn&#39;t start out in marketing, but I ended up running a big marketing team (  How the F*ck:  April led a global marketing team two years out of college), and so I did a lot of marketing courses and read a lot of marketing books because I felt like I had to catch up.\n One of the things that I found intriguing was this idea that positioning was a foundational marketing concept and yet we didn&#39;t seem to have a methodology for doing it.\n I thought that was really interesting for the longest time. And, I was trying to build a methodology that would break positioning into pieces and then have a process for putting it back together.\n Clearly, a competitive alternative is a key thing in positioning. You can&#39;t know what your distinctive value is without knowing who you&#39;re compared against.\n    But for a long time, I was thinking about competitive comparison in a typical way: when someone says &#39;who is your competitor&#39; you tend to think of other providers out there that do software just like yours.\n However, in B2B markets, often the thing you are actually competing against is something like a spreadsheet that your target customer is using to solve the problem at the moment.\n (How the F*ck: In her book April uses the example of a customer simply using Excel or hiring an intern to do the job your product does. If you compare your product against similar software, but your customer is using an intern to do in manually, you aren&#39;t making the right comparison.)\n I first came to this conclusion when I was reading a lot of Clayton Christensen and jobs to be done theory. It got me thinking about the idea that companies hire your product to do a job, and that job is not always obvious.\n You&#39;ve really got to nail the competitive alternative. After all, if I don&#39;t understand who my real competitive alternative is then, I don&#39;t understand what&#39;s unique about my offering because I don&#39;t know who I&#39;m comparing to. If you don&#39;t nail this, your whole positioning will be wrong.\n Thank you! You&#39;re now subscribed - we will only contact you when a new interview is released.", "posttime": "2020-05-27 05:51:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据库,database,产品,reposition", "title": "我帮助重新定位了一款数据库产品，该产品后来获得了10亿美元的收入", "title_en": "I helped reposition a database product that went on to make $1B in revenue", "transed": 1, "url": "https://www.thefxck.com/interviews/product-positioning-april-dunford", "via": "", "real_tags": ["数据库", "database", "产品"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003847, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您在自定义目录中安装了“我的世界地下城”，则有机会卸载“我的世界”地下城启动器和/或游戏将删除整个父目录和其中的所有内容。\n在卸载任何东西之前，请确保“我的世界地下城”启动器至少使用Bootstrap 166或更高版本。您可以在设置&gt；关于&gt；Bootstrap中查看此信息。\n我一直在网上读到这个错误会导致整个磁盘被擦除，但事实并非如此。因此，我想更详细地说明这个错误是关于什么的，以及我们在听到第一个报告后大约30分钟内发布的修复程序是什么：\n当玩家在地下城安装对话框中选择了一个自定义的安装位置时，地下城启动器选择了该位置，并且天真地认为只有由地下城启动器编写的文件才会驻留在那里。因此，在卸载启动程序时，卸载逻辑将简单地删除该安装位置文件夹，从而不会在磁盘上留下由启动程序创建的程序文件的痕迹。\n我们没有考虑到玩家选择的自定义位置中也可能有属于其他程序的文件。不幸的是，我们在测试中没有发现这一点。所以这个错误只会影响那些为地下城选择了一个自定义安装位置的玩家，那里还有其他的程序文件，然后试图卸载地下城启动器。\n我们在听到第一个报告(引导程序版本166及更高版本)后不久发布的修复程序是只删除地下城安装位置下启动器知道的文件夹。\n我们对此可能给玩家带来的不便深表歉意，并肯定会将此作为改进我们质量保证过程的学习经验。\n我在我的固态硬盘上安装了“我的世界地下城”启动器和我所有的游戏，它不让我在相同的地方安装游戏，所以我卸载了启动器，这样我就可以把它安装在我的C盘上了，但是它抹去了我整个游戏的固态硬盘！", "note_en": "If you have installed Minecraft Dungeons in a  custom directory, there is a chance uninstalling Minecraft Dungeons Launcher and/or the game will remove the entire parent directory and everything in it.\n Before uninstalling anything, please ensure the Minecraft Dungeons Launcher atleast uses Bootstrap version 166 or higher. You can check this at  Settings &gt; About &gt; Bootstrap.\n I&#39;ve been reading online that this bug was causing entire disks to be wiped out, which was not necessarily the case. So I&#39;d like to clarify what the bug was about in more detail, and what is the fix we released within around 30 minutes after hearing the first report:\n When a player selected a custom &#34;Install Location&#34; in the Dungeons installation dialog, the Dungeons Launcher was taking that location and naively considering that only files written by the Dungeons Launcher would live there. Thus, when uninstalling the Launcher, the uninstall logic would simply delete that &#34;Install Location&#34; folder, to leave no traces of program files created by the Launcher on disk.\n We didn&#39;t consider that the custom location chosen by players could also have files belonging to other programs in it. And unfortunately, we didn&#39;t catch that in tests. So the bug would only impact players who had selected a custom install location for Dungeons where other program files also exist, then tried to uninstall the Dungeons Launcher.\n The fix we released soon after hearing about the first report (which is in Bootstrap version 166 and up) is to delete only the folders that the Launcher knows about, under the Dungeons install location.\n We are very sorry for the inconvenience this might have caused to players and will surely take this as a learning experience for improving our quality assurance process.\n I had the Minecraft Dungeons launcher installed on my SSD with all my games, it wouldn&#39;t let me install the game in the same place so I uninstalled the launcher so I could install it on my C drive but it wiped out my entire games SSD!", "posttime": "2020-05-27 05:51:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "卸载,wipes,程序", "title": "Launcher在卸载时擦除整个SSD", "title_en": "Launcher wipes entire SSD when uninstalling", "transed": 1, "url": "https://bugs.mojang.com/browse/MCL-14107", "via": "", "real_tags": ["卸载", "wipes", "程序"]}, {"category": "", "categoryclass": "", "imagename": "2d941c8240e4beb4b0fec72db0fb86bf.jpg", "infoid": 1003845, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我喜欢IT技术连接：https://www.youtube.com/channel/UCy0tKL1T7wFoYcxCe0xjN6Q Patreon：https://www.patreon.com/agingwheels商品：https://.", "note_en": "I like it Technology Connections: https://www.youtube.com/channel/UCy0tKL1T7wFoYcxCe0xjN6Q Patreon: https://www.patreon.com/agingwheels Merchandise: https://...", "posttime": "2020-05-27 05:35:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "日本,figaro,https", "title": "日产菲加罗-灵感来自日本的复古敞篷车[视频]", "title_en": "Nissan Figaro – Retro-inspired convertible from Japan [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=HE2dKZ492TA", "via": "", "real_tags": ["日本", "figaro", "https"]}, {"category": "", "categoryclass": "", "imagename": "4645b4c0568fe413d109202574ecaa93.jpg", "infoid": 1003842, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“这是病毒的报复，”伦敦卫生与热带医学院(London School Of Hygiene And Tropical Medicine)院长彼得·皮奥特(Peter Piot)博士说。“我让他们的生活变得困难。现在他们想要抓住我。“。\n现年71岁的皮奥特博士是抗击埃博拉和艾滋病的传奇人物。但是新冠肺炎差点杀了他。\n“一周前，我不可能做这个采访，”他最近在他伦敦的餐厅里通过Skype说，他身后有一幅马蹄莲的油画。“10分钟后，我还是喘不过气来。”\n皮奥特博士在经历了一段病毒猎人生涯后，遗憾地回首往事，他说自己误判了猎物，成为了猎物。\n“我低估了这一点--它会以多快的速度传播。我的错误是认为它就像SARS，范围相当有限。或者说它就像流感一样。但两者都不是。“。\n1976年，作为比利时安特卫普热带医学研究所(Institute Of Tropical Medicine)的病毒学研究生，皮奥特博士是调查扎伊尔扬布库(现在的刚果民主共和国)一场神秘病毒性出血热的国际团队的一员。\n为了避免给该镇蒙上污名，研究小组成员以附近一条河流的名字将病毒命名为“埃博拉”。\n后来，在20世纪80年代，他是证明这种在非洲被称为“苗条”的消瘦疾病是由导致其他地方年轻男同性恋者死亡的同一种病毒引起的科学家之一。\n1991年至1994年，他担任国际艾滋病协会(International AIDS Society)主席，然后担任联合国艾滋病(U.N.AIDS)--联合国抗艾滋病项目--的第一任主任。\n这些专业知识使他对新的冠状病毒构成的危险保持着敏锐的警觉。1月下旬，他和他的妻子，人类学家海蒂·拉尔森(Heidi Larson)去新加坡参加了一个医学会议，一周前新加坡出现了第一例病例。在那里，在世界卫生组织宣布这种新出现的病毒为国际关注的突发公共卫生事件的当天，他接受了当地电视台的即兴采访。\n“我们开始禁止在我们的行为中握手。我们出去吃饭是因为我们喜欢好吃的食物，但我们开始对‘埃博拉肘部’表示敬意。“。\n3月初，他和伦敦卫生与热带医学院(London School Of Hygiene And Tropical Medicine)疫苗信心项目负责人拉森博士一起去了波士顿。她在TedMed上发表了一场关于破坏疫苗接种活动的谣言的TedMed演讲，他被问到了100个关于病毒的问题。\n79：“我是不是应该担心我会抓到新冠肺炎？彼得，你有多担心？“。\n他建议说：“我会尽我所能避免被感染，因为你不知道个人的结果。”\n尽管那一周在波士顿地区举行的医学会议变成了超级传播者活动，但皮奥特博士几乎毫无疑问没有在那里受到感染。\n回到伦敦的家中，他向30到250名听众发表了讲话，参加了一个50人的生日派对，并在伦敦或剑桥的五家餐厅共进晚餐或喝酒。\n“我的惯用作案手法，”他说。除了避免握手，他没有采取特别的预防措施。“我真的不知道我是在哪里感染的。”\n虽然当时已经有许多确诊病例，但英国直到3月23日才正式进入封锁状态，当时确认的死亡人数为335人。相比之下，皮奥特博士和他的妻子从16日开始在家工作。\n“我的第一反应是，‘哦，我希望不是Covid。’”\n“它像一辆公交车一样冲击着我。极度疲惫，就像你身体里的每个细胞都很疲惫。我的头皮非常敏感--海蒂一碰它就疼。这是一种神经症状。“。\n这是一种新的感觉。他说，尽管他在蚊子肆虐的气候中度过了所有的时间，但“我一生中从未患过重病。”他经常慢跑，看起来很健康，他开玩笑说，“这是我成年后第一次一个月不喝酒。”\n另一方面，拉森博士在旅行中经历了一连串的热带疾病：脑型疟疾、戊型肝炎、伤寒和登革热。\n“我知道彼得感受到的很多症状--疼痛时你如何保持头部，在房间里走动就会感到多么疲惫。”所以，如果他要水或其他什么东西，我就放下手中的活，马上就拿到了。当你身体不舒服时，时间是一种不同的体验--每一分钟都很重要。“。\n当时，几乎不可能进行检测；可用的为数不多的试剂盒是为医院保留的。\n3月26日，他终于通过一位私家医生找到了一个。结果是阳性的，他的发烧持续高烧。\n3月31日，气温达到了104华氏度，他开始感到困惑。他和妻子去了伦敦皇家医院的急诊室。\n虽然他没有感到呼吸急促，但他的血氧饱和度只有84%，低得危险。X光显示两个肺中的液体呈细菌性肺炎的模式。\n他说，他的血液测试“真的很糟糕”。他的C-反应蛋白(表示炎症)和D-二聚体(表示血液凝块形成)的水平都非常高。\n“我立刻从医生变成了病人，”他说。给他上了氧气，然后用轮床送他上楼。\n“就在那时，它击中了我的胃，”拉森博士说。在他接受评估时，她被允许留下来，但不能冒险上楼。\n正常情况下，英国的国民医疗服务医院“和印度的公交车一样拥挤，”拉森博士说。“但他们有一场宣传活动说，‘除非你已经到了最后11个小时，否则不要来医院’，所以医院几乎是空的。”\n“但当我看到彼得乘坐那辆手推车穿过两扇门时--我和我们在塞拉利昂认识的埃博拉家属有同样的感觉：他们把亲人藏起来，因为他们知道可能再也见不到他们了，因为他们不想在情感上与他们分离。”\n皮奥特博士说，一开始，他太疲惫了，以至于无动于衷。他要求一间单人房，但被告知是为没有检测呈阳性的人预留的，以保护他们。他和另外三名男子被关在一个20乘22英尺的房间里，一个卫生间。\n“他们称NHS为‘伟大的均衡器’，”他说。“食物是棒棒糖和土豆泥，太难吃了。我的室友打呼噜很厉害。“。\n拉森医生当晚回家听到南非著名艾滋病研究者吉塔·拉姆吉博士刚刚因新冠肺炎去世的消息。拉姆吉博士是皮奥特博士学校的名誉教授，在生病之前曾在那里主持过一次研讨会。\n“她和我一样大，我突然有一种强烈的感觉，‘这可能会发生在我身上’，”拉森博士说。\n“你所能做的就是躺在那里想，‘我希望情况不会变得更糟。’”\n他接受了静脉注射抗生素和高流量氧气，每两个小时就被叫醒一次，检查他的a、血压和其他生命体征。\n“我特别担心自己不会戴上呼吸机，”他说。“呼吸机可以拯救生命，但也会造成很大的伤害。一旦你感染了埃博拉病毒，你的存活几率就和埃博拉病毒的存活几率一样，大约是三分之一。“。\n每天，他都会与拉森医生或他的成年子女交谈。他确实有机会看了他妻子推荐的关于西西里侦探“蒙塔巴诺探长”的BBC新连续剧的几集。\n“如果这发生在手机之前，你能想象那种孤独吗？”他说。“这就像是在监狱里。听着，我知道我享有特权，我知道我不会像纳尔逊·曼德拉那样被困在这里27年。但这个世界缩小到了必需品。你满脑子想的都是：‘我的呼吸怎么样？’“。\n皮奥特博士说，最后，他的血氧饱和度达到了92%。他於四月八日出院。\n“他们想给我叫辆出租车，但我拒绝了，我想呼吸伦敦现在没有污染的空气。”\n“这令人震惊，就像斯德哥尔摩综合症一样，”他在谈到自己的生还时说。“坦率地说，当我回到家时，我开始哭泣。太感人了。“。\n在医院出院之前，他的病毒检测呈阴性。但现在，另一件事正在发生--一种延迟的免疫反应。\n“渐渐地，我变得呼吸急促，”他说。“我们住在一栋三层楼的老乔治亚式房子里，我好不容易才上楼。”\n她最近自己的病毒抗体检测呈阳性，尽管她的病情非常轻微，她不确定什么时候达到顶峰。她有两次严重的头痛，第一次是在3月下旬，第二次是在4月中旬。第二次，她也有发痒的红眼睛，这是一种罕见的但公认的症状，可能表明是通过眼睛感染的。\n4月15日，皮奥特医生的心跳开始加速到每分钟165次。他的血氧百分比又降到了80%左右。\n他和拉森医生去了大学学院医院，在那里他做了胸部X光检查。\n这一次，两边没有明显的细菌团块，“我的肺里到处都是浸润的东西，它们真的是一团糟。这叫‘组织性肺炎’。“。\n他解释说，整个肺部长得像一束束葡萄的小囊泡正在渗出信号蛋白--他正在经历一场“细胞因子风暴”。它们将贪婪的白细胞吸引到气囊之间的空隙中，因此它们可能会阻止氧气通常进入他的红细胞的路径。\n“我的祖父在第一次世界大战期间曾在战壕中作战--在佛兰德斯的那些罂粟田里，”皮奥特博士说。“他说最糟糕的是休假回家--然后意识到你必须回去做什么。”\n但是，给他吸氧住院可能是徒劳的-他的肺正在“僵硬”，可能无法吸收。\n取而代之的是，专门治疗难治性肺炎的乔安娜·波特(Joanna Porter)医生给他静脉注射类固醇以减少炎症，同时使用抗凝剂来防止他的心房纤颤导致的血块。\n英国的NHS官僚机构禁止她讨论皮奥特医生的治疗，尽管他得到了他的许可。他仍在她的照顾之下。上周，PET扫描、CT扫描和支气管镜检查显示，他的部分肺部尚未完全清除。“而且，”他补充说，“告诉你的美国观众：所有这些昂贵的测试都是免费的，NHS是免费的。”他一直是全民医保的推动者。\n类固醇似乎有效，但服用时间过长可能会产生副作用，包括肌肉萎缩、骨骼虚弱和糖尿病。\n他说，他的余生可能不得不服用抗凝剂，而且他的部分肺部可能会永久留下疤痕。\n他说：“如果你在身患重病时得了这种细胞因子风暴，你就完蛋了。”“但是我有三个阶段--先是发烧，然后需要氧气，然后是暴风雨。”\n“人们认为，有了新冠肺炎，1%的人死亡，其余的人只是得了流感。事情没有那么简单--整个事情都在中间。“。\n“他们只说，‘休息吧！休息一下！休息吧！“。那不是我的堡垒。把我推到海滩上坐是惩罚。“。\n“但我做了一点。我正在与CEPI合作研发疫苗，“他补充道，他指的是流行病准备创新联盟，这是一个成立于2017年的联盟，目的是创造针对传统疫苗公司不投资的新疾病甚至未来疾病的疫苗。\n“我曾面临死亡，”他说。“1976年，当我们从病人身上抽血时，防护装备还是个笑话。我逃过了一次直升机事故。但这次不同。我认为面对死亡并幸存下来是一件好事--它迫使你思考什么是必要的，谁是必要的。“。\n“我现在用佛兰芒语，我们称之为‘ervaringsdeskundige’--一个‘体验专家’。”被安排进顾问小组的人不是因为你研究过一种疾病，而是因为你经历过这种疾病。那就是我。现在我在想我的余生该做些什么。“", "note_en": "“This is the revenge of the viruses,” said Dr. Peter Piot, the director of the London School of Hygiene and Tropical Medicine. “I’ve made their lives difficult. Now they’re trying to get me.”\n Dr. Piot, 71 years old, is a legend in the battles against Ebola and AIDS. But Covid-19 almost killed him.\n “A week ago, I couldn’t have done this interview,” he said, speaking recently by Skype from his London dining room, a painting of calla lilies behind him. “I was still short of breath after 10 minutes.”\n Looking back, ruefully, on being brought down by a virus after a life as a virus-hunter, Dr. Piot said he had misjudged his prey and had become the hunted.\n “I underestimated this one — how fast it would spread. My mistake was to think it was like SARS, which was pretty limited in scope. Or that it was like influenza. But it’s neither.”\n In 1976, as a graduate student in virology at the Institute of Tropical Medicine in Antwerp, Belgium, Dr. Piot was  part of the international team that investigated a mysterious viral hemorrhagic fever in Yambuku, Zaire, now the Democratic Republic of Congo.\n To avoid stigmatizing the town, team members named the virus “Ebola” after a nearby river.\n Later, in the 1980s, he was one of the scientists who proved that the wasting disease known as “slim” in Africa was caused by the same virus that was killing young gay men elsewhere.\n From 1991 to 1994, he was president of the International AIDS Society, and then the first director of U.N.AIDS, the United Nations’ anti-H.I.V. program.\n That expertise made him keenly alert to the danger posed by the new coronavirus. In late January, he and his wife,  Heidi Larson, an anthropologist, went to a medical conference in Singapore, which had had its first case a week earlier. While there, he gave an impromptu  interview to local television on the day the World Health Organization  declared the emerging virus a public health emergency of international concern.\n  “We started banning handshaking from our behavior. We went out to eat because we like good food, but we started giving the ‘Ebola elbow.’”\n In early March, he went to Boston with Dr. Larson, who heads  the Vaccine Confidence Project at the London School of Hygiene and Tropical Medicine. She  gave a TedMed talk about rumors that damage vaccination campaigns, and he was asked  100 questions about the virus.\n No. 79: “Should I be worried that I’m going to get Covid-19? How worried are you, Peter?”\n He advised: “I would do everything I can to avoid becoming infected as you don’t know individual outcomes.”\n Although medical conferences in the Boston area that week were  turning into super-spreader events, Dr. Piot almost undoubtedly did not get infected there.\n  Back home in London, he spoke to audiences of 30 to 250, attended a 50-person birthday party and had dinner or drinks in five restaurants in London or Cambridge.\n “My usual modus operandi,” he said. Aside from avoiding hand shakes, he took no particular precautions. “I really don’t know where I was infected.”\n Although there were then already many confirmed cases, Britain did not officially go into lockdown  until March 23, when there were  335 confirmed deaths. Dr. Piot and his wife, by contrast, began working from home on the 16th.\n “My immediate thought was, ‘Oh, I hope it’s not Covid.’”\n “It hit me like a bus. Extreme exhaustion, like every cell in your body is tired. And my scalp was very sensitive — it hurt if Heidi touched it. That’s a neurological symptom.”\n It was a new feeling. Despite all the time he has spent in mosquito-riddled climes, “I’d never been seriously ill in my life,” he said. A regular jogger and apparently healthy he joked, “This is the first time in my adult life I didn’t drink wine for a month.”\n  Dr. Larson, on the other hand, has survived a fusillade of tropical diseases in her travels: cerebral malaria, hepatitis E, typhoid and dengue.\n “I knew how a lot of the symptoms Peter had felt — how you hold your head when it hurts, how fatigued you get just moving across the room. So if he asked for water, or anything, I dropped what I was doing and got it immediately. Time is a different experience when you’re not well — every minute matters.”\n At the time, it was almost impossible to get tested; the few kits available were reserved for hospitals.\n On March 26, he finally found one through a private doctor. It was positive, and his fever kept rising.\n On March 31, it hit 104 degrees and he began feeling confused. He and his wife went to the emergency room of the Royal London Hospital.\n  Although he did not feel short of breath, his oxygen saturation was only 84 percent, dangerously low. An X-ray showed fluid in both lungs in a pattern that suggested bacterial pneumonia.\n His blood tests “were really bad,” he said. His levels of C-reactive protein, which indicate inflammation, and of D-Dimer, which indicate blood clots forming, were both very high.\n “I instantly changed from doctor to patient,” he said. He was put on oxygen and sent upstairs on a gurney.\n “That was when it hit me in the stomach,” Dr. Larson said. She had been allowed to stay while he was assessed but could not venture upstairs.\n Normally Britain’s National Health Service hospitals “are as crowded as Indian buses,” Dr. Larson said. “But they had a campaign saying, ‘Don’t come to the hospital unless you’re in the 11th hour,’ so it was almost empty.”\n “But when I saw Peter go through the double doors on that cart — I had the same feeling as the Ebola families we knew in Sierra Leone: They were hiding their relatives because they didn’t want to be separated from them emotionally, knowing they might never see them again.”\n At first, Dr. Piot said, he was so exhausted he was apathetic. He asked for a single room, but was told they were reserved for people who had not tested positive, for their protection. He was put in a 20-by-22-foot room, one bathroom, with three other men.\n “They call the N.H.S. ‘the great equalizer,’” he said. “The food was bangers and mash — awful. And my roommates snored a lot.”\n  Dr. Larson went home that night to  hear on the news that Dr. Gita Ramjee, a well-known South African AIDS researcher, had just died of Covid-19. Dr. Ramjee was an honorary professor at Dr. Piot’s school and had led a symposium there before falling ill.\n “She was my age, and I suddenly felt an acute sense of ‘it could happen to me,’” Dr. Larson said.\n “All you can do is lie there thinking, ‘I hope it’s not going to get worse.’”\n He got intravenous antibiotics and high-flow oxygen, and was roused every two hours for checks on his a blood pressure and other vital signs.\n  “I was particularly anxious that I not be put on a ventilator,” he said. “Ventilators can save lives, but they can also do a lot of harm. Once you’re on one, your chances of surviving are the same as of surviving Ebola — about one third.”\n  Every day, he talked to Dr. Larson or his grown children. He did get to watch episodes of a new BBC series about a Sicilian detective, “ Inspector Montalbano,” that his wife recommended.\n “If this had happened before cellphones, can you imagine the loneliness?” he said. “It’s like being in prison. Look, I know I’m privileged, and I know I’m not going to be stuck here for 27 years like Nelson Mandela. But the world shrinks to the essentials. All you can think is: ‘How is my breathing going?’”\n Finally, Dr. Piot said, his oxygen saturation came up to 92 percent. He was discharged on April 8.\n “They wanted to call me a taxi, but I said no, I wanted to breathe the now non-polluted air in London.”\n “It was a shock, like Stockholm syndrome,” he said of his survival. “When I got home, frankly, I started crying. It was so emotional.”\n Before the hospital released him, he had tested negative for the virus. But now something else was going on — a delayed immune reaction.\n “Gradually, I became short of breath,” he said. “We live in an old Georgian house, with three floors, and I had a hard time getting upstairs.”\n She recently tested positive for antibodies to the virus herself, although her illness was so mild that she’s not sure when it peaked. She had two bouts of bad headaches, the first in late March and the second in mid-April. The second time, she also had itchy red eyes, which are  a rare but recognized symptom and may indicate  infection through the eyes.\n On April 15, Dr. Piot’s heart started to race to 165 beats a minute. The percentage of his blood oxygen dropped to the mid-80s again.\n He and Dr. Larson went to the University College Hospital where he had a chest X-ray.\n This time, instead of distinct bacterial masses on each side, “my lungs were full of infiltrates, and they were a real mess. It’s called ‘ organizing pneumonia.’”\n The tiny sacs that grow like bunches of grapes throughout the lungs, he explained, were oozing signaling proteins — he was having a “cytokine storm.” Those drew voracious white blood cells into the spaces between the air sacs so they threatened to block the paths oxygen normally takes to his red blood cells.\n “My grandfather fought in the trenches in World War I — in those poppy fields in Flanders,” Dr. Piot said. “He said the worst part was going home on leave — and then realizing what you had to go back to.”\n But hospitalizing him on oxygen might have been fruitless — his lungs were “stiffening” and perhaps unable to absorb it.\n Instead, Dr. Joanna Porter, who specializes in difficult pneumonias, put him on an intravenous steroid to reduce the inflammation, along with an anticoagulant to prevent blood clots from his atrial fibrillation.\n Britain’s N.H.S. bureaucracy forbade her from discussing Dr. Piot’s treatment, though he gave his permission. He is still under her care. Last week, a PET scan, CT scan and bronchoscopy showed that parts of his lungs have not completely cleared. “And,” he added, ever the universal health care booster, “tell your American audience: All these expensive tests are free from the N.H.S.”\n The steroids appear to be working, but taking them for too long can have side effects, including muscle wasting, weakening of bones and diabetes.\n  He may have to take anticoagulants for the rest of his life, he said, and parts of his lungs may permanently be scarred.\n “If you get this cytokine storm while you’re acutely ill, you’re finished,” he said. “But I had three stages — first fever, then needing oxygen, and now the storm.”\n “People think that, with Covid-19, 1 percent die and the rest just have flu. It’s not that simple — there’s this whole thing in the middle.”\n “All they say is, ‘Rest! Rest! Rest!’ That’s not my forté. Pushing me to sit on the beach is punishment.”\n “But I’m doing a little. I’m working with CEPI on vaccines,” he added, referring to the  Coalition for Epidemic Preparedness Innovations, an alliance formed in 2017 to create vaccines against new and even future diseases that traditional vaccine companies don’t invest in.\n “I’ve faced death,” he said. “In 1976, when we were drawing blood from patients, protective gear was a joke. And I escaped a helicopter accident. But this was different. I think facing death and surviving it is a good thing — it forces you to think about what is essential, who is essential.”\n “I’m now in Flemish what we call an ‘ervaringsdeskundige’ — an ‘experience expert.’ Someone who is put on an advisory panel not because you’ve studied a disease, but because you’ve lived it. That’s me. And now I’m thinking about what to do with the rest of my life.”", "posttime": "2020-05-27 05:04:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "病毒,virus,可能", "title": "病毒猎人瀑布是他低估的病毒的猎物", "title_en": "A Virus-Hunter Falls Prey To a Virus He Underestimated", "transed": 1, "url": "https://www.nytimes.com/2020/05/26/health/coronavirus-peter-piot.html?referringSource=articleShare", "via": "", "real_tags": ["病毒", "virus", "可能"]}]