[{"category": "", "categoryclass": "", "imagename": "363258e42e7a6860af8074416217c2d0.jpg", "infoid": 1001484, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "神经学家玛丽安·沃尔夫(Maryanne Wolf)在12年前出人意料地获得了成功，“普鲁斯特和乌贼：阅读大脑的故事和科学”(2007)，这是一项关于识字在人类认知发展中的作用的研究。但当她写完最后几节时，她意识到这本书已经过时了。数字革命已经发生，她埋头于苏美尔文字和希腊字母，以至于没有注意到这一点。她在自己的新书“读者回家”(Reader，Come Home)中承认，她觉得自己就像瑞普·范·温克尔(Rip Van Winkle)，这本书包含了9封写给任何对阅读价值感兴趣的人的伴随信。在这里，沃尔夫使用神经科学的工具来研究从旧印刷品到新屏幕的过渡过程中阅读发生了什么-“阅读大脑的电路将如何被数字媒体的独特特征所改变，特别是在年轻人中。”她的关注点既不是阅读头脑，也不是我们的品味、知识、智力或技能，而是我们大脑中的物理器官。那些其他的事情是由我们的大脑能够和倾向于做什么来决定的。\n沃尔夫从一个遗传事实开始：“人类生来就不是用来读书的。”识字是一项表观遗传成就，将我们视觉和语言的生物学能力延伸到一个新的“回路”中，实现了奇妙的壮举-不仅创造了雷纳·玛丽亚·里尔克(Rainer Maria Rilke)的杰作“杜诺诗篇”(Duino Elegie)，这部小说在沃尔夫年轻时就抓住了她，而且还具有想象其他自我和世界的能力，跟踪复杂的论点，获取和储存知识。她称其为“一项非自然的文化发明”，但它不仅仅将口头文化转化为印刷文化。识字改变了人类的大脑，使其“改装了一些现有的神经元组”，并“形成了新的循环电路”。大脑必须改变，因为与生俱来的大脑不能阅读。如果经常长时间暴露，它会对暴露在什么环境中做出反应。识字是通过实践来发展的-通过劳动来推动修改后的大脑功能的发展。你读得越多，你的大脑适应能力就越强。它是一个“塑料”器官。\n沃尔夫的开场白之后是对阅读生理学的有力描述。她将看似简单的理解字母、单词和句子的过程分解成认知片段，通过不同的脑叶(额叶、颞叶、顶叶和枕叶)和层(最上面的端脑等)追踪阅读过程。她的陈述不能在这里浓缩，因为步骤太多太复杂了。有一段关于读者如何通过“注意力的聚光灯”开始理解一个单词的段落，让我们对这种复杂性有了一个了解：\n第一批聚光灯负责定位注意力系统，它有三个快速完成的任务。首先，它们帮助我们从我们最初关注的任何事情中解脱出来--这些事情发生在我们大脑皮层的顶叶(即，端脑的最上层)。第二，它们帮助我们将注意力转移到我们面前的任何东西上…。。这种移动我们视觉注意力的行为发生在我们的中脑深处(即中脑或第三层)。第三，它们帮助我们集中新的注意力，并在这样做的同时，提醒整个阅读回路为行动做好准备。最后一次阅读前的注意力集中发生在皮层下面的一个特殊区域，该区域充当大脑的主要总机之一：非常重要的丘脑，它位于每个半球的间脑或第二层。\n这就是在任何适当的阅读开始之前会发生的事情！还要记住，这种特殊的关注焦点是“整个阅读循环”的第一步。如果大脑没有预料到单词的阅读，这种情况就不会发生。\n当大脑对书面文字进行更深入的认知时，它会解释内容，就像读者确实在体验一样。阅读大脑和纸质阅读变得如此交织在一起，以至于当人们读到安娜·卡列尼娜(Anna Karenina)跳楼身亡的场景时，“你也跳了起来。”“很有可能，”大脑扫描显示，“当你移动腿和躯干时，当你读到安娜跳到火车前面时，同样的神经元也会被激活。”沃尔夫以此作为证据，证明阅读能培养同理心和想象力，这是识字的两大奇妙结果。阅读还培养了“认知耐心”，这对于批判性智力在与“新奇偏见”作斗争时是必要的。“新奇偏见”是人类对新现象的偏好，因为它们是新的。阅读也激活了背景知识：理解的过程将我们正在阅读的内容与我们已经拥有的知识结合起来，这些知识以某种方式与手头的事情有关，从而使这些知识在我们心中保持活力。\n然而，识字的独创性，以及大脑的神经可塑性，在“读者回家”的后半部分困扰着沃尔夫。如果阅读不是自然的，而是人为的，它可能会变质。如果大脑因为重复而适应了印刷\n在后来的这些信件中，沃尔夫听起来像是数字爱好者经常嘲笑的那种危言耸听的人。毕竟，他们说，阅读不是消亡，而是欣欣向荣。沃尔夫自己引用了加州大学圣地亚哥分校的一项研究，表明平均每个用户每天消耗34G的数据-相当于近10万个单词。\n沃尔夫的答案再次来自神经科学研究，这些研究揭示了纸质阅读和屏幕阅读之间，以及“深度阅读”和快速阅读之间的显著认知和情感差异-这些差异体现在大脑活动中。在一项研究中，研究人员“坦率地说，令人惊讶的是，仅仅通过让他们的文学研究生仔细阅读或为了娱乐而阅读，大脑的不同区域就被激活了，包括涉及运动和触摸的多个区域。”在另一组实验中，在一组人读完纸上的故事后，另一组人在屏幕上读完故事后，第一组比第二组更准确地重建了情节-因为与虚拟文本不同的是，书给了大脑一个具体的行动空间安排。总之，沃尔夫说，纸质阅读大脑比屏幕阅读大脑有更好的记忆力，更多的想象力，更多的沉浸感和耐心，以及更多的知识。生理学证明了这一点。\n沃尔夫恳求的语气--“读者，请回家吧”--源于这样一个事实：尽管存在危险，但屏幕时间正在取代读书时间。这下可麻烦了。“我们数字阅读越多，”她警告说，“我们潜在的大脑回路就越能反映这种媒介的特征。”六千年来，阅读迫使人类大脑加深和拓宽其认知。这是一项辉煌的成就，受到“我们进化的线路和当代文化之间的根本紧张”的威胁。我们正在倒退。\n或者我们是吗？哈佛大学英语教授莉亚·普莱斯认为沃尔夫的担忧有些过头了--后悔屏幕出现的爱书人陷入了一种神话，即他们认为深度、全神贯注的读者是在电脑前阅读的代表。斯文·伯克茨(The Gutenberg Elegie，1994)、尼古拉斯·卡尔(Nicholas Carr)(“谷歌让我们变傻了吗？”)和国家艺术工作人员基金会(National Endowment For The Arts Staff)等书籍爱好者误解了阅读的历史。2004年，国家艺术工作人员基金会(National Endowment For The Arts Staff)撰写了“危险阅读”(The Risk At Risk)报告(我当时在那里工作)。普莱斯都提到了他们，并指责他们将读书视为一种紧张、刻意、孤独的事情，并相信梦幻般的概念，如“读者和作者之间的一种未经调解的交流”。他们的立场是情绪和信仰一样多，普莱斯总结道--“情绪就是恐惧。”\n事实上，普莱斯写道，“严肃的、沉默的、单独的从封面到封面的阅读从来都不只是印刷品的众多用途之一。”一心多用并不是什么新鲜事。阅读通常是草率的、随意的和社交的--故意如此。爱书人后悔的数字实践与阅读的其他用途有很多相似之处-例如，每隔一天阅读一篇博客，阅读18世纪充斥城市的小册子。阅读也不总是理想化的。反数字批评家称赞的全神贯注往往被怀疑是腐蚀年轻人和鼓励懒惰的。最后，普莱斯认为，随着时间的推移，阅读习惯发生了变化，这不仅是因为印刷技术的进步，也是因为现代基础设施的变化，比如公共交通的兴起。爱书人真正担心的不是书籍的消失，而是享受它们所需的时间和空间的消失。\n这些都是争论，听起来足够广泛，以至于需要对自古以来的书籍阅读进行百科全书式的处理。但是当我们谈到书的时候，我们所谈论的只有170页小的，间距松散的文本。陈述是随意的，散文是流畅的。普莱斯自由地将不同的现象混合在一起-例如，她对书籍的直接体验与“阅读疗法”(在医疗中阅读书籍)项目。租用纽约公共图书馆的楼梯举办活动，在2008年电影版《欲望都市》之后变得流行起来，得到了和南北战争前和吉姆·克罗时代阅读一样多的关注。在短短的几页中，我们从15世纪教皇的纵容到1900年英国的印刷生产，再到本·富兰克林的印刷业务(没有生产任何书籍)，再到亚马逊Kindle，然后又回到简·奥斯汀和她对读者借书而不是买书的抱怨。事实来来去去。有一次，在一个标题为“插页：请平放”的部分(开头是普莱斯抬着一个塞满大部头和笔记本电脑的背包，伤了她的脊椎)，每一行文字都横跨接缝，覆盖了两页。这是令人不安的，但它提出了普莱斯关于阅读的可变性的观点。\n普莱斯汇编的细节令人着迷，也很有趣。它们也很好地说明了旧书的使用或多或少符合数字习惯。例如：\n继“圣经”之后，殖民地时期美国最受欢迎的书是“新世纪”。\n拥有书籍并不总是意味着读书。海明威对詹姆斯·乔伊斯的“尤利西斯”赞不绝口，但“他的复制品至今依然干净利落，只剪掉了第一页和最后一页。”\n名人锅炉工在很长一段时间内一直主导着市场。1813年，简·奥斯汀的“傲慢与偏见”只卖出了1500册，而罗伯特·索西的纳尔逊勋爵传记和他可耻的私生活两次售罄。\n出版商并没有把他们的新书吹捧为引人入胜的翻页者，而是有时会做相反的事情，用1835年的一则广告的话说，夸大一本书的能力，使其“被拿起来放在地上，没有任何不便”。价格评论：“对我们来说，打断一本书意味着冲动和不耐烦。但在印刷业历史的大部分时间里，它被证明是文明的自我克制。\n中世纪晚期，我们的廉价平装书(或平板电脑)有了一个漂亮的版本，即所谓的“腰带书”，它挂在人的衣服上，以一种前现代的“便携”形式陪伴着僧侣们到处走。\n书店和图书馆并不总是浏览、购买或借阅的起点。企鹅号商业成功的秘诀之一就是在火车站台和烟草商店里卖书。\n在过去，阅读可能是知识的来源，也可能是精神错乱的迹象，正如塞万提斯告诉我们的那样，唐·吉诃德就是这样：“在几乎没有睡眠和如此多的阅读的情况下，他的大脑干涸了。”歌德的“少年维特的悲伤”引发了无数模仿自杀事件。19世纪的图书馆非常担心过度阅读小说对年轻人的影响，从而限制了他们可以借到的书的数量。\n普莱斯断言，认为网络用户已经抛弃了书籍的流行观念是完全错误的，因为“书中的人也是云中的人”。如果你喜欢在网上阅读，你也会倾向于阅读纸质书。这只是遵循了历史记录，表明“一种技术取代另一种技术的情况是多么罕见。”嗜热者戈蒂埃在1835年宣称，报纸正在扼杀这本书；托马斯·爱迪生在1913年预测，电影将使书籍在教室里过时。\n这些都是引人发笑的事实和典故。它们加在一起，就是一个很有说服力的案例，说明这位忠实的书呆子只是一种过去的读者。然而，我们必须警惕将过去的阅读理想化的忠告并不意味着没有现在的阅读危机。普莱斯将出版收入的上升作为反对天崩地裂的证据。她没有引用的是劳工统计局的一项研究，该研究发现，美国人每天只阅读15分钟，而15-24岁的人每天只有6分钟，尽管他们有5个半小时的空闲时间可以打发。国家艺术基金会报告说，从1992年到2017年，成年人阅读任何书籍(不是为了工作或上学)的比例从前一年的60.9%下降到52.7%。“大众传媒文化心理学”最近的一项研究指出，在70年代末，60%的青少年报告说他们每天读一本书或一本杂志；到了2016年，这一比例骤降至16%。考试成绩也紧随其后。在2018年的ACT上，只有46%的考生在阅读方面达到了“大学准备”，比2011年下降了6分。1972年至2016年的SAT语言成绩下降了36分。尽管投入了数十亿美元的教育资金和致力于阅读教学的重大立法，所有这些都发生了。顺便说一句，低收入家庭的孩子比高收入家庭的孩子花在屏幕上的时间要多得多，而且他们在阅读测试中的成绩也更差。(我们仍然存在“数字鸿沟”，但这与20年前的情况相反，当时民主党人担心穷人联系不充分，会进一步落后。)。这是一个阅读问题，普莱斯收集的历史证据只触及了它的边缘。\n用不了多久，在个人电脑消失之前，所有活着的记忆都会消失。人们将不再根据人们记忆中没有电脑的生活背景来解释屏幕的意义。莉亚·普莱斯(Leah Price)和玛丽安·沃尔夫(Maryanne Wolf)伴随着书籍长大；他们的童年是纸质的，而不是数字的。我怀疑，普莱斯之所以想缓和数字革命的影响，是因为一种自由主义的冲动，即带着彬彬有礼的微笑接受文化变革。这就是通行的礼仪。我曾多次目睹我的人文学科的同事们耸耸肩，收到流行文化与他们的知识兴趣越来越远的消息。批评人们的文化选择对他们来说是不得体的。但是，每一项调查都显示，年轻人的闲暇时间里阅读时间很少，而屏幕上的时间却很多，人们越来越难不分享沃尔夫的沮丧。", "note_en": "Neuroscientist Maryanne Wolf had a surprise hit a dozen years ago,  Proust and the Squid: The Story and Science of the Reading Brain (2007), a study of literacy’s role in the development of human cognition. But as she wrote the final sections, she realized the book had already become dated. The Digital Revolution had happened, and she was too buried in Sumerian scripts and Greek alphabets to notice. She felt like Rip van Winkle, she admits in her new book,  Reader, Come Home, comprising nine companionable letters addressed to anybody interested in the value of reading. Here, Wolf uses the tools of neuroscience to examine what happened to reading in that transition from old print to new screens—“how the circuitry of the reading brain would be altered by the unique characteristics of the digital medium, particularly in the young.” Her focus is neither the reading  mind, nor our tastes, knowledge, intelligence, or skills, but the physical organ inside our heads. Those other things are shaped by what our brains are able and disposed to do.\n  Wolf begins with a genetic fact: “human beings were never born to read.” Literacy is an epigenetic achievement, extending our biological capacities for vision and language into a new “circuitry” that performs wondrous feats—not only the creation of masterpieces such as Rainer Maria Rilke’s  Duino Elegies, which grabbed Wolf when she was young, but the capacity to imagine other selves and worlds, follow complex arguments, and acquire and store knowledge. She calls it “an unnatural cultural invention,” but it did more than transform oral cultures into print cultures. Literacy altered the human brain, making it “refit some of its existing neuronal groups” and “form newly recycled circuits.” The brain had to change because the innate brain can’t read. It responds to what it is exposed to  if exposure happens often, for a long period. Literacy develops through practice—through labor that compels the development of revised brain functions. The more you read, the more your brain adapts. It is a “plastic” organ.\n What follows Wolf’s opening statements is a  tour de force description of the physiology of reading. She breaks down the seemingly simple process of understanding letters, words, and sentences into its cognitive pieces, tracking the course of reading through different lobes (frontal, temporal, parietal, and occipital) and layers (uppermost telencephalon, etc.). Her presentation can’t be condensed here because the steps are so numerous and complex. One paragraph on how a reader begins to apprehend a single word through “spotlights of attention” gives an idea of this complexity:\n The first spotlights, which do the work of the orienting attentional system, have three quickly accomplished jobs. First, they help us  disengage  from whatever we were originally attending to—which takes place in the parietal lobe of our cortex (i.e., in the telencephalon’s uppermost layer). Second, they help us  move our attention to whatever is in front of us…. This act of moving our visual attention takes place deep in our midbrain (i.e., in the mesencephalon, or third layer). Third, they help focus our new attention and, in so doing, alert the entire reading circuit to prepare for action. This last pre-reading focusing of attention takes place in a special area below the cortex that functions as one of the brain’s major switchboards: the very important thalamus, which resides in the diencephalon, or second layer, of each hemisphere.\n And that’s what happens before any proper reading can begin! Keep in mind, too, that this particular spotlight of attention is a primary step in an “entire reading circuit.” It wouldn’t happen if the brain were not anticipating the reading of a word.\n As the brain proceeds to deeper cognitions of written words, it interprets the content as if the reader were actually experiencing it. The reading brain and the print read become so intertwined that when one reads the scene in which Anna Karenina leaps to her death, “you leaped, too.” “In all likelihood,” brain scanning shows, “the same neurons you deploy when you move your legs and trunk were also activated when you read that Anna jumped before the train.” Wolf takes this as proof that reading fosters empathy and imagination, two marvelous consequences of literacy. Reading also cultivates “cognitive patience,” necessary to the critical intellect as it struggles against “novelty bias”—the human preference for new phenomena because they are new. Reading activates background knowledge, too: the process of comprehension combines what we are reading with the knowledge we already have that is somehow related to the matter at hand, thus keeping that knowledge alive in us.\n The very inventedness of literacy, however, along with the neuroplasticity of the brain, troubles Wolf in the second half of  Reader, Come Home. If reading is not natural but invented, it can deteriorate. If the brain adapted to print because of repeated exposure, it can adapt away if exposure slows. The circuit will break if unused, or if something different from print draws more of the brain’s attention. If screens take the place of paper, the brain will react.\n “What Will Become of the Readers We Have Been?” she asks in Letter Four, which rehearses oft-noted drawbacks of the screen habitat. Hyperstimulation is one; “continuous partial attention,” whereby one attends to several things at once—Instagram, TV, texting—but none deeply, is another; an environment that rewards short attention spans is a third. Wolf backs these observations with neurological data. She quotes other scientists who say, for instance, “[m]ultitasking created a dopamine-addiction feedback loop, effectively rewarding the brain for losing focus.” She cites data on the extent to which virtual reading has replaced paper reading (for example, 20-year-olds checking their phones 150-190 times per day). She points out how the “physical and temporal  thereness of books” provides a tactile support for the reading circuit’s development that e-books do not, while noting e-books nonetheless continue to spread to classrooms and children’s bedrooms. “Behind our screens, at work and at home, we have sutured the temporal segments of our days so as to switch our attention from one task or one source of stimulation to another. We cannot but be changed.”\n  In these later letters, Wolf sounds like the kind of alarmist digital enthusiasts often deride. After all, they say, reading is not dying; it’s thriving. Wolf herself quotes a study from the University of California, San Diego, showing that an average user consumes 34 gigabytes of data per day—the equivalent of nearly 100,000 words.\n Wolf’s answer comes, once again, from neuroscientific studies revealing significant cognitive and affective differences between print and screen reading, and between “deep reading” and fast reading—differences that show up in brain activity. In one study, researchers “were frankly surprised that just by asking their literature graduate students either to read closely or to read for entertainment, different regions of the brain became activated, including multiple areas involved in motion and touch.” In another, after one group read a story on paper, another on screens, the first reconstructed the plot more accurately than the second—for a book, unlike a virtual text, gives the brain a concrete spatial arrangement for the action. In sum, Wolf says, the paper reading brain has better memory, more imagination, immersion, and patience, and more knowledge than the screen reading brain. The physiology proves it.\n Wolf’s pleading tone—“reader, please, come home”—follows from the fact that, in spite of the dangers, screen time is displacing book time. We are in trouble. “The more we read digitally,” she warns, “the more our underlying brain circuitry reflects the characteristics of that medium.” For six millennia, reading compelled the human brain to deepen and widen its cognitions. It is a glorious achievement, threatened by a “fundamental tension between our evolutionary wiring and contemporary culture.” We are moving backward.\n  Or are we? Harvard English professor Leah Price thinks Wolf’s worry overdone—that bibliophiles who regret the advent of screens are caught up in a myth of the deep, all-absorbed book reader whom they take as representative of reading before computers. Book-lovers such as Sven Birkerts ( The Gutenberg Elegies, 1994), Nicholas Carr (“Is Google Making Us Stupid?”), and the National Endowment for the Arts staff who produced the 2004 report  Reading at Risk (I worked there at the time) misconstrue reading’s history. Price mentions them all and chides them for seeing book reading as an intense, deliberate, solitary affair and believing in dreamy notions such “an unmediated communion between a reader’s mind and an author’s.” Their position is as much mood as belief, Price concludes—and “[t]hat mood is fear.”\n In truth, Price writes, “serious, silent, solitary cover-to-cover reading has never been more than one of many uses to which print had been put.” Multitasking is nothing new. Reading was usually cursory, haphazard, and social—purposely so. And the digital practices bibliophiles regret have much in common with other uses of reading—for instance, reading a blog every other day and reading pamphlets that flooded cities in the 18th century. Reading wasn’t always idealized, either. The total absorption that anti-digital critics praise was often suspected of corrupting the youth and encouraging idleness. Finally, Price argues, reading habits have changed over time not only because of advances in print technology, but also because of changes in modern infrastructure such as the rise of public transportation. What bibliophiles really fear isn’t the disappearance of books but the elimination of the time and space needed to enjoy them.\n Those are the contentions, which sound sweeping enough to require an encyclopedic treatment of book reading from ancient times forward. But  What We Talk About When We Talk About Books has only 170 small, loosely-spaced pages of text. The presentation is casual, the prose fluid. Price mixes different phenomena freely—for example, her direct experience of books with projects of “bibliotherapy” (book reading in medical care). Renting the New York Public Library staircase for events, which became popular after the 2008 film version of  Sex and the City, gets as much attention as reading in the antebellum and Jim Crow eras. In but a few pages we leap from 15th-century papal indulgences to print production in Britain in 1900 to Ben Franklin’s printing business (which produced no books) to the Amazon Kindle—then back to Jane Austen and her complaint that readers borrowed books instead of buying them. Facts come and go. At one point, in a section headed “Interleaf: Please Lay Flat” (which begins with Price injuring her spine hefting a backpack stuffed with tomes and a laptop), each line of text runs across the seam and covers both pages. It’s disconcerting, but makes Price’s point about the variability of reading.\n  The details price compiles are fascinating and amusing. They nicely illustrate, too, older book-uses more or less consonant with digital habits. For instance:\n The most popular book in Colonial America after the Bible was the New England Primer, but “nowhere in the world today can you find a copy of the Primer published before 1727.” It was too common for librarians to bother collecting. Sometimes, the most influential books are judged disposable.\n Book owning didn’t always mean book reading. Hemingway praised James Joyce’s  Ulysses loudly, but “his copy survives crisp and clean to this day, with only the first and last pages cut.”\n Celebrity potboilers have dominated the market for a long time. In 1813, Jane Austen’s  Pride and Prejudice sold a meager 1,500 copies, while Robert Southey’s biography of Lord Nelson and his scandalous private life sold out twice.\n Rather than touting their latest books as compelling page-turners, publishers sometimes did the opposite, playing up a book’s capacity to “be taken up and laid down without inconvenience,” as an 1835 ad put it. Price comments: “For us, interrupting a book denotes impulsivity and impatience. But for most of print’s history, it proved civilized self-restraint.”\n The late Middle Ages had a nifty version of our cheap paperback (or tablet), the so-called “girdle book” that hung from one’s clothing and accompanied monks everywhere in a pre-modern form of “portability.”\n Bookstores and libraries haven’t always been Ground Zero for browsing and buying or borrowing. One secret of Penguin’s commercial success was to sell books on train platforms and in tobacco shops.\n In the past, reading could be a source of knowledge—or a sign of derangement, as it was for Don Quixote, as Cervantes tells us: “with virtually no sleep and so much reading he dried out his brain.” Goethe’s  The Sorrows of Young Werther provoked numerous copycat suicides. Nineteenth-century libraries worried enough about the effect of excessive novel reading on young people to cap the number of books they could borrow.\n The popular notion that web users have abandoned books is flat wrong, Price asserts, for “people of the book are also people of the cloud.” If you like to read online, you tend to like to read paper, too. This merely follows the historical record showing “how rarely one technology supersedes another.” Théophile Gautier declared in 1835 that the newspaper was killing the book; Thomas Edison in 1913 predicted that movies would make books obsolete in classrooms.\n  These are diverting facts and allusions. They add up to a persuasive case for the devoted bookworm as just one type of past reader. Nevertheless, the sound advice that we must beware of idealizing past reading doesn’t mean there is no present reading crisis. Price cites rising publishing revenues as evidence against the-sky-is-falling. What she doesn’t cite is a Bureau of Labor Statistics study that found Americans read “for personal interest” only 15 minutes a day—and 15-24 year-olds only six minutes per day, despite having five-and-a-half hours of leisure time to fill. The National Endowment for the Arts reports that from 1992 to 2017 the portion of adults who read any book (not for work or school) over the preceding year fell from 60.9% to 52.7%. A recent study in  Psychology of Popular Media Culture noted that in the late ’70s 60% of teens reported reading a book or magazine every day; by 2016 the rate had plummeted to 16%. Test scores have followed suit. On the 2018 ACT, only 46% of test-takers reached “college readiness” in reading, a drop of six points from 2011. SAT verbal scores from 1972 to 2016 fell 36 points. All of this happened despite billions of education dollars and major legislation devoted to reading instruction. Low-income kids spend much more time on screens than do high-income kids, by the way, and they score more poorly on reading tests. (We still have a “digital divide,” but it’s the reverse of the one from 20 years ago when Democrats worried that the poor weren’t adequately connected and would fall further behind.) There is a reading problem, and the historical evidence Price assembles touches only its edges.\n It won’t be long before all living memory of a time before the personal computer is gone. People will no longer address the meaning of screens from the remembered background of a computer-free life. Leah Price and Maryanne Wolf grew up with books; they had a print childhood, not a digital one. Price aims to soften the impact of the Digital Revolution, I suspect, because of a liberal impulse to accept cultural change with an urbane smile. That’s the going etiquette. I have witnessed many times my humanities colleagues receive news of popular culture drifting ever farther from their intellectual interests with a shrug. It is unseemly to them to criticize people for their cultural choices. But with every survey showing meager reading time and massive screen time in the leisure hours of the young, it is increasingly difficult not to share Wolf’s dismay.", "posttime": "2020-05-10 13:26:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "无书,bookless,阅读", "title": "我们的无书未来", "title_en": "Our Bookless Future", "transed": 1, "url": "https://claremontreviewofbooks.com/our-bookless-future/", "via": "", "real_tags": ["无书", "bookless", "阅读"]}, {"category": "", "categoryclass": "", "imagename": "5c283e9bfb9052d813b50e63d7cf8f88.jpg", "infoid": 1001483, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Windows内置了很多广告。这不仅仅是免费更新的问题，即使你购买了一台带有Windows 10证书的新电脑，或者投资200美元购买了Windows 10专业版，你也会在软件中看到广告。但是，您可以阻止它中的很多内容。在本文中，我们将指导您完成禁用所有内置Windows10广告的整个过程。\n要禁用所有内置Windows 10广告，请逐步按照以下步骤操作：\n单击搜索按钮。在搜索栏中键入Settings并选择选项，如下图所示：\n现在选择上图中突出显示的个性化选项。一旦您选择个性化选项，就会出现以下屏幕：\n如您所见，屏幕分为两部分。从屏幕左侧选择Lock Screen(锁定屏幕)选项，如上图所示。单击Lock Screen(锁定屏幕)选项后，将出现以下屏幕：\n现在从背景下拉菜单中选择图片或幻灯片。关闭锁定屏幕上名为“从Windows和Cortana获取有趣的事实、提示和更多信息”的切换按钮。来自锁定屏幕的广告将被禁用。\n要从“开始”菜单禁用这些应用程序，请在“开始关闭”中旋转名为“偶尔显示建议”的切换按钮，如上图中突出显示的那样。\n单击搜索按钮。在搜索栏中键入Settings并选择选项，如下图所示：\n从Windows设置屏幕中选择系统选项，如上图中突出显示的那样。一旦您选择系统选项，将出现以下屏幕：\n如您所见，屏幕分为两部分。从屏幕左侧选择通知和操作选项，如上图所示。单击该选项后，将出现以下屏幕：\n现在，在使用Windows时关闭名为“获取提示、技巧和建议”的切换按钮，以禁用广告。\n在通知和操作的同一屏幕上，关闭名为“在更新后向我显示Windows欢迎体验”的切换按钮，偶尔在我登录时也会关闭，以突出显示新增功能和建议功能。\n要禁用Cortana广告，请关闭名为“让Cortana不时显示思想、问候和通知”的切换按钮，如上图中突出显示的搜索框中所示。\n单击上图中突出显示的选项菜单。单击选项菜单后，将出现以下对话框：\n从对话框中选择视图选项卡，如上图中突出显示的那样。将显示以下选项：\n取消选中名为显示同步提供程序通知的复选框以禁用播发。然后单击Apply(应用)和OK(确定)按钮。\n在右键单击Windows应用商店图标时，选择更多-&&gt;关闭动态磁贴，如上图中突出显示的那样。\n单击搜索按钮。在搜索栏中键入Settings并选择选项，如下图所示：\n从Windows设置屏幕中选择设备选项，如上图中突出显示的那样。只要您单击Devices(设备)选项，就会出现以下屏幕：\n如您所见，屏幕分为两部分。如上图所示，从屏幕左侧选择钢笔&amp；Windows墨水。要禁用广告，请取消选中名为显示推荐的应用程序建议的复选框，如下所示：\n按照此步骤操作，您将能够禁用Windows 10的所有内置广告。", "note_en": "Windows has a lot of advertisements built-in. This is not just about the free update offer, you will see the advertisement in your software even if you buy a new PC that arrives with a Windows 10 certificate or invests $200 on a version of Windows 10 professional. However, you can block a lot of it. In this article, we will guide you through the whole procedure to disable all of the built-in Windows 10 ads.\n    To disable all of the built-in Windows 10 ads, follow this procedure step by step:\n    Click the  Search button. Type  Settings in the search bar and select the option as the following image is showing:\n        Now choose the  Personalization option as highlighted in the above image. As soon as you will choose the  Personalization option, the following screen will appear:\n    As you can see that the screen is divided into two parts. Select the  Lock screen option from the left side of the screen as the above image is indicating. After clicking on the  Lock screen option, the following screen will appear:\n    Now choose the  Picture or  Slideshow from the  Background drop down. Turn off the toggle button named  Get fun facts, tips, and more from Windows and Cortana on your lock screen. Ads from the lock screen will be disabled.\n            To disable the apps from the Start menu, turn the toggle button named  Show suggestions occasionally in Start off as highlighted in the above image.\n    Click the  Search button. Type  Settings in the search bar and select the option as the following image is showing:\n        Choose the  System option from the  Windows Settings screen as highlighted in the above image. As soon as you will select the  System option, the following screen will appear:\n    As you can see that the screen is divided into two parts. Select the  Notifications &amp; actions option from the left side of the screen as highlighted in the above image. After clicking the option, the following screen will appear:\n    Now turn the toggle button named  Get tips, tricks and suggestions as you use Windows off in order to disable ads.\n    On the same screen of  Notifications &amp; action, turn off the toggle button named  Show me the Windows welcome experience after updates and occasionally when I sign in to highlight what’s new and suggested.\n              To disable the Cortana ads, turn off the toggle button named  Let Cortana pipe up from time to time with thoughts, greetings, and notifications in the Search box as highlighted in the above image.\n            Click the  Options menu as highlighted in the above image. After clicking the  Options menu, the following dialogue box will appear:\n    Choose the  View tab from the dialogue box as highlighted in the above image. The following options will appear:\n    Uncheck the checkbox named  Show sync provider notifications to disable the advertisements. Then click the  Apply and  OK button.\n          As you will right-click the  Windows Store icon, choose  More -&gt;  Turn Live Tile off as highlighted in the above image.\n    Click the  Search button. Type  Settings in the search bar and select the option as the following image is showing:\n        Choose the  Devices option from the  Windows Settings screen as highlighted in the above image. As soon as you will click the  Devices option, the following screen will appear:\n    As you can see that the screen is divided into two parts. Select the  Pen &amp; Windows Ink from the left side of the screen as above is indicating. To disable ads, uncheck the checkbox named  Show recommended apps suggestions as follows:\n      By following this procedure you will be able to disable all of Windows 10’s built-in ads.", "posttime": "2020-05-10 13:26:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,windows,windows-10,内置,built", "title": "如何禁用所有内置Windows 10广告", "title_en": "How to disable all of the built-in Windows 10 ads", "transed": 1, "url": "https://www.faqforge.com/windows/windows-10/how-to-disable-all-of-the-built-in-windows-10-ads/", "via": "", "real_tags": ["广告", "windows", "内置", "built"]}, {"category": "", "categoryclass": "", "imagename": "e6d80c350e31356faae097050cf477e4.jpeg", "infoid": 1001482, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个故事始于2018年5月。那个月我给自己买了一辆树莓派3B。我有一个模糊的想法，想用它做一面智能镜，但很快就意识到：\n我摆弄着Raspbian，试图加载谷歌助手，这样我就可以给自己买一个便宜的谷歌主页。不幸的是，Google Assistant SDK存在一些破坏交易的限制。像热词检测这样简单的事情很难设置，充其量也就是偶然事件。\n也许它可以是一个“我的世界”服务器？结果发现，Mincraft Java版服务器根本不适合内存仅为1 GB的设备。\n在此之前大约4个月，我在大学学习了操作系统入门课程。我们对哈佛大学创建的教学操作系统OS/161进行了修改。我个人很喜欢那个课程，因为我们在兔子洞里只走了几英寸，我有很多问题没有回答。我的覆盆子PI需要比35美元的纸镇…更好的东西。\n如果你读到问题时深深地叹了口气，我不会责怪你。当涉及到这样的事情时，我是相当天真的。这种天真就是我没有立即放弃这个想法的原因。事实上，我用另一种同样天真的观点来支持它：\n好了，别再提那些卑鄙的事了。我已经下定决心了。我决定写一种操作系统。我的目标是什么？\n如果我能让它做任何有用的事，那就是奇迹了。我们就当这是一次学习经历吧。\n做任何复杂的事情(连接到互联网、使用HDMI等)。是完全没有问题的。\n就这样，在2018年5月的一个决定性的日子里，它开始了。这是一个周末的黑客马拉松，开始了一年多的操作系统编写之旅。\n很明显，我没有在那个周末构建操作系统。事实上，我继续在黑暗中摸索。我决定慢慢来。将不会有代码的盲目复制。我会做一些研究，看一些手册。然后我会拼凑一些代码。加上一些评论和大量的待办事项。经常失败。再试试。冲洗并重复。\n自2018年以来，该项目已经取得了长足的进步。我会花几个星期的时间练习它，然后在上课的时候把它放在一边几个月。\n顺便说一句，我到目前为止写的并不是真正的操作系统。它还不够复杂。正确的术语应该是裸机程序。\n到目前为止，该程序实现了虚拟内存和中断等概念。这里有一些用于线程化的初始代码。它使用帧缓冲区通过HDMI输出基本形状和VGA字体。我还在对一些实现USB的代码进行反向工程！\n当试图编写操作系统时，会有过多的细节。您可以以任何您想要的方式实现一切，因为作为开发人员，您拥有很大的控制权。这也意味着有大量的事情需要跟踪。当一切都开始破裂时，很难找出原因。\n我一直发现，一个好的学习方法很难做到。对于那些对嵌入式开发感兴趣的人，我建议您尝试一下这样的方式！我是在几乎没有经验的情况下进入的，而且走了这么远，所以我绝对可以想象会有更多的人做同样的事情！\n你可以在GitHub上找到我的项目。我试着把事情记录下来，并尽可能地跟踪我的进度。我的承诺不是最好的，所以请注意。", "note_en": "This story begins in May 2018. I bought myself a Raspberry Pi 3B that month. I had the vague idea of using it to make a smart mirror, but soon realized that:\n   I toyed with Raspbian and tried to load up the Google Assistant, so I could get myself a cheap Google Home. Unfortunately, there were some deal-breaking limitations on the Google Assistant SDK. Simple things like hotword detection were difficult to setup and a hit-or-miss affair at best.\n Maybe it could be a Minecraft Server? Turns out, the Minecraft Java Edition server is not at all suitable for devices with a piddly 1GB of RAM.\n  About 4 months prior to this, I had taken an introductory Operating Systems course at University. We made modifications to OS/161, an instructional operating system that was created at Harvard. I personally loved that course and because we had gone mere inches into the rabbit hole, I had a lot of unanswered questions. And my Raspberry Pi needed to be something more than a $35 paperweight…\n    If you took a deep sigh when you read the question, I don’t blame you. I’m fairly naïve when it comes to matters like these. That naïveté is why I didn’t dismiss the idea immediately. In fact, I bolstered it with another, equally naïve sentiment:\n        OK, enough with the cringey stuff. My mind was made up. I had decided to write some kind of an operating system. What were my goals?\n It would be a miracle if I could make it do anything useful. Let’s just call it a learning experience.\n  Doing anything sophisticated (connecting to Internet, using HDMI, etc.) would be completely out of question.\n And thus it began, on one fateful day in May 2018. A weekend hackathon that started off a 1+ year journey into writing an operating system.\n  Obviously I didn’t build an operating system in that weekend. In fact, I continue to fumble in the dark. I had decided to take things slowly. There would be no blind copying of code. I’d do some research and read manuals. Then I’d slap together some code. Throw in some comments and a lot of TODOs. Fail a lot. Try again. Rinse and repeat.\n      The program has come a long way since 2018. I would work on it for a few weeks then leave it alone for months while I was going through classes.\n Incidentally, what I’ve written so far is not really an operating system. It’s not sophisticated enough. The correct term would be a bare-metal program.\n So far, the program implements concepts like Virtual Memory and Interrupts. There’s some initial code for threading. It uses a framebuffer to output basic shapes and VGA fonts over HDMI. I’m also reverse-engineering some code that implements USB!\n  There’s a plethora of fine details when trying to write an operating system. You can implement everything in any way you want, because as the developer, you have a lot of control. That also means there’s an overwhelming number of things to keep track of. And when everything start to break, it’s hard to figure out why.\n I’ve always found that a good way to learn is to do. For those who are interested in embedded development, I would recommend trying something like this! I entered with next to no experience and got this far, so I can definitely imagine more people doing the same!\n You can find my project on  GitHub. I tried to document things and track my progress wherever I could. I wasn’t the best with my commits, so be warned.", "posttime": "2020-05-10 13:25:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "托瓦尔,torvalds,事情", "title": "如果托瓦尔兹能做到的话。", "title_en": "If Torvalds can do it...", "transed": 1, "url": "https://medium.com/@cde3d29d703f/c2ff58e049d7", "via": "", "real_tags": ["托瓦尔", "torvalds", "事情"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001481, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "不同的前端允许Xi-Editor在桌面、终端甚至智能手机上运行。要开始使用，请找到与您的平台兼容的前端，然后按照安装说明操作。\n请参阅前端键盘箭头右键。\n对技术细节感兴趣吗？在幕后，Xi-Editor使用CRDT和持久的绳索来高效地操作文本。文档页面解释了所有这些功能的工作原理。\n阅读文档键盘_箭头_右。\nXi-Editor是一个雄心勃勃的早期项目，有很多事情要做。如果您感兴趣，请查看我们的问题跟踪器和路线图。拉取请求总是受欢迎的。\n贡献向导键盘_箭头_右", "note_en": "Different frontends allow xi-editor to run on the desktop, in a terminal, or even on a smartphone. To get started, find a frontend that&#39;s compatible with your platform and follow the installation instructions.\n   See frontends  keyboard_arrow_right\n  Curious about technical details? Under the hood, xi-editor uses a CRDT and a persistent rope to manipulate text efficiently. The documentation pages explain how all of this works.\n   Read documentation  keyboard_arrow_right\n Xi-editor is an ambitious, early-stage project, and there&#39;s a lot to be done. If you&#39;re interested, check out our  issue tracker and  roadmap. Pull requests are always welcome.\n   Contributing guide  keyboard_arrow_right", "posttime": "2020-05-10 13:19:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编辑,editor,箭头", "title": "XI-编辑-未来20年的编辑", "title_en": "Xi-editor – An editor for the next 20 years", "transed": 1, "url": "https://xi-editor.io/", "via": "", "real_tags": ["编辑", "editor", "箭头"]}, {"category": "", "categoryclass": "", "imagename": "e363a1bdbf884d5ffef2b7f4dba16c6d.jpg", "infoid": 1001480, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "发明家大卫·苏(David Soo)在昆士兰北部与一位老朋友共进晚餐后，完全没有想到他的生活会发生戏剧性的变化。\n这位悉尼工程师的用餐伙伴是当地的一名厨师，他在巴布亚新几内亚勉强逃脱了伤害，在那里他被挥舞着弓箭的土匪抢劫了。\n在他的最后一次旅行中，他在付了钱并把香草豆带回城里后遭到了伏击。\n他说他不想再做了，因为太危险了，我想，为什么我们不能在澳大利亚这里做呢？\n它的售价约为每公斤600美元，是世界上仅次于藏红花的第二大最有利可图的香料作物。\n他说，许多大型食品加工商或制造商，如雀巢，现在都在改变或强制他们只想要天然种植的香草，他们不想要人造香草。\n发现贪婪的市场是一回事，挑战是开发一种商业上可行的方式来种植这种有时棘手且劳动密集型的作物。\nSoo先生正在开发的解决方案是一种定制设计的350立方米温室，具有可控的生长条件，可以通过移动设备进行调整。\n现在，新南威尔士州中部海岸的试点项目已经进行了三年，苏先生正在一个获得专利的测地圆顶温室里种植大约200株香草藤。\n部分成功来自于将作物种植在垂直的土壤填充的格子架上，这使得藤蔓能够生根并获得所有水平的养分。\n这些格子是为我们所说的三维植物设计的--因为它们是藤蔓植物，它们的根结构来自藤蔓上所有不同部位的节点，它们不是从底部长出来的，Soo先生说。\n在像马达加斯加这样的地方，它们必须爬树，然后它们不得不把根一直伸到地面上，所以藤蔓越高，它们获得的营养就越少。&#34；在马达加斯加这样的地方，它们必须爬到树上，然后把根一直伸到地面上，所以藤蔓越高，它们获得的营养就越少。\n格子柱自动旋转，这样所有的藤蔓都能平等地接触到阳光。\n该公司工业自动化总监布拉德·亚格(Brad Yager)表示，目标是建立一个更可持续的农业系统。\n亚格尔表示：我们在一系列行业提供能源和自动化解决方案，但参与这样的项目，帮助开发更可持续的自动化解决方案，对我们真的很有吸引力。\n农业科学家约翰·特劳顿博士曾为世界上一些最大的食品公司担任顾问，他说香草穹顶是一个独特的设计，是澳大利亚独创性的一个很好的例子。\n特劳顿博士说：植物喜欢待在室内，如果你优化了温度、湿度、光线以及所有这些因素，你就会突然剔除主要的变量，那就是气候。\n自动化是我们致力于农业和园艺转型的关键驱动力之一；换句话说，我们越能实现这些操作的自动化，它们的效率就越高，它们的效率就越高，它们的用水效率就越高，它们的生产力就越高。\n试点农场的葡萄藤还没有开花，这是授粉发生的时候。\nSoo先生表示，他有信心从他的作物中生产出大约一吨香草豆。\n在完成试验后，他希望将香草穹顶推向市场，这样他就可以从客户那里购买豆子，成为供应商。\n温室是达到目的的一种手段--我们需要能够种植藤蔓，他说。\n我已经为温室的设计、温室和棚架申请了专利，但我想要做的是降低生产成本，让很多人都能买下这些温室，自己种植。", "note_en": "Inventor David Soo had no idea his life would change dramatically after having dinner with an old friend in Far North Queensland.\n  The Sydney-based engineer&#39;s dining partner was a local chef, who had a narrow escape from harm in Papua New Guinea, where he was robbed by bow-and-arrow-wielding bandits.\n  &#34;On his last trip, he got ambushed after he&#39;d paid the money and was taking the vanilla beans back down to the city.\n &#34;He said he didn&#39;t want to do it anymore because it&#39;s too dangerous and I thought, &#39;Well why can&#39;t we do it here in Australia?&#39;.&#34;\n    It sells for about $600 a kilogram and is the second-most lucrative spice crop in the world behind saffron.\n &#34;A lot of the big food processors or manufacturers, such as Nestle, are now moving or mandating that they only want naturally grown vanilla, they don&#39;t want synthetic vanilla,&#34; he said.\n   Discovering a voracious market was one thing; the challenge was developing a commercially viable way to grow the sometimes tricky and labour-intensive crop.\n The solution Mr Soo is developing is a custom-designed, 350-cubic-metre greenhouse, with controlled growing conditions that can be adjusted by mobile device.\n Now three years into a pilot project on the Central Coast of New South Wales, Mr Soo is growing about 200 vanilla vines in a patented geodesic dome greenhouse.\n  Part of the success came from planting the crop in vertical soil-filled trellises, which allow the vines to take root and get nutrients at all levels.\n &#34;The trellises are designed for what we call three-dimensional plants — because they&#39;re vines and they have their root structures coming out of the nodes at all different parts along the vine, they don&#39;t come from the bottom,&#34; Mr Soo said.\n &#34;Out at places like Madagascar where they have to climb up trees, they then have to send their roots all the way down to the ground, so the higher the vines, the less nutrients they get.&#34;\n   The trellis columns rotate automatically so that all of the vines get equal access to sunlight.\n  The company&#39;s director for industrial automation, Brad Yager, said the goal was a more sustainable farming system.\n &#34;We do energy and automation solutions across a range of industries, but getting involved in a project like this to help develop a more sustainable automated solution was really appealing to us,&#34; Mr Yager said.\n Agricultural scientist Dr John Troughton, who has been a consultant to some of the biggest food companies in the world, said the vanilla dome was a unique design and a great example of Australian ingenuity.\n  &#34;Plants like being inside and if you optimise the temperature, the humidity, the light, all those factors, you suddenly have taken out the major variable, which is climate,&#34; Dr Troughton said.\n &#34;Automation is one of the key drivers we work on to convert agriculture and horticulture; in other words, the more we can automate these operations, the more efficient they&#39;re going to be, the more effective they&#39;re going to be, the more water-use efficient they&#39;re going to be, the more productive they&#39;re going to be.&#34;\n The vines in the pilot farm are yet to flower, which is when pollination occurs.\n Mr Soo said he was confident of yielding about a tonne of vanilla bean from his crop.\n  After completing the trial, he hoped to market the vanilla dome so that he could buy beans off his clients and become a supplier.\n  &#34;The greenhouse is a means to an end — we need to be able to grow the vines,&#34; he said.\n &#34;I&#39;ve patented the design, the greenhouse and the trellises, but what I&#39;d like to be able to do is reduce the production costs, make it very much available to a lot of people to actually buy these greenhouses and grow them for themselves.&#34;", "posttime": "2020-05-10 13:18:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "测地,production,香草", "title": "测地圆顶中的香草兰生产", "title_en": "Vanilla Production in Geodesic Domes", "transed": 1, "url": "https://www.abc.net.au/news/2020-05-10/high-tech-dome-grows-vanilla-from-smartphone/12218902", "via": "", "real_tags": ["测地", "香草"]}, {"category": "", "categoryclass": "", "imagename": "81fd36c1ff6c6b68fd10d73de8cf1fca.png", "infoid": 1001479, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "毛茸茸的推特目前正在热议一家新网站，该网站出售假冒皮衣，并未经许可非法使用真正皮衣所有者的照片。\n可以理解的是，被这个网站剽窃了作品的摄影师和旅行者感到不安，并希望行使他们对诈骗网站的合法追索权(即DMCA下架电子邮件)，但有一个问题：\n他们的联系信息不在DNS中，而且他们的网站托管在CloudFlare后面。\n您可能会认为这是一个噱头，但我将向您展示如何在一个简单的步骤中获得其服务器的真实IP地址。\n大多数山寨网站运营商将选择像Magento、WooCommerce和OpenCart这样的开源电子商务平台，这些平台通常有一种机制，让客户注册账户并登录。\n(如果没有，请注销并使用“重置密码”功能，该功能几乎肯定会给您发送一封电子邮件。)。\n一旦您收到来自诈骗站点的电子邮件，您将需要查看电子邮件标题。\n使用Gmail，可以点击电子邮件右侧的三个点，然后点击“显示原件”。\n现在你就知道了。CloudFlare背后的服务器的IP地址在30分钟或更短的时间内将热管道送到您的收件箱，否则您将退款。\n这比这些仿冒皮衣网站给你的任何一笔交易都要公平。\n您可以确定谁托管他们的网站。(在本例中，它是一家名为Net Minders的公司。)。\n记住这一点，你可以向他们的网络主机提供商发送一封电子邮件，引用“数字千年版权法”(Digital Millennium Copy版权法)。\n一两封电子邮件可能会被忽视，但丢弃来自不同人的数百封截然不同的投诉电子邮件对业务不利。这(连同向域名注册商提出的类似的滥用投诉，这不会被DNS隐私所掩盖)应该足以关闭这些非法网站。\n该技术简单、有效、便携。每当有人试图支持另一个网站兜售假冒商品，并试图躲在CloudFlare后面时，都可以使用它。", "note_en": "Furry Twitter is currently abuzz about a new site selling knock-off fursuits and illegally using photos from the owners of the actual fursuits without permission.\n  Understandably, the photographers and fursuiters whose work was ripped off by this website are upset and would like to exercise their legal recourse (i.e. DMCA takedown emails) of the scam site, but there’s a wrinkle:\n Their contact info isn’t in DNS and their website is hosted behind CloudFlare.\n   You might think this is a show-stopper, but I’m going to show you how to get their server’s real IP address in one easy step.\n  Most knock-off site operators will choose open source eCommerce platforms like Magento, WooCommerce, and OpenCart, which usually have a mechanism for customers to register for an account and login.\n  (If it doesn’t, logout and use the “reset password” feature, which will almost certainly send you an email.)\n Once you have an email from the scam site, you’re going to need to view the email headers.\n With Gmail, can click the three dots on the right of an email then click “Show original”.\n   And there you have it. The IP address of the server behind CloudFlare delivered piping hot to your inbox in 30 minutes or less, or your money back.\n That’s a fairer deal than any of these knock-off fursuit sites will give you.\n   You can identify who hosts their website. (In this case, it’s a company called Net Minders.)\n With this knowledge in mind, you can send an email to their web hosting provider, citing the Digital Millennium Copyright Act.\n One or two emails might get ignored, but discarding hundreds of distinct complaint emails from different people is bad for business. This (along with similar abuse complaints to the domain registrar, which isn’t obscured by DNS Privacy) should be enough to shut down these illicit websites.\n    The technique is simple, effective, and portable. Use it whenever someone tries to prop up another website to peddle knock-off goods and tries to hide behind CloudFlare.", "posttime": "2020-05-10 13:18:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "隐藏,obtain,网站", "title": "获取隐藏在CloudFlare后面的网站IP地址的简单方法", "title_en": "The Easy Way to Obtain a Website's IP Address That Hides Behind CloudFlare", "transed": 1, "url": "https://soatok.blog/2020/05/09/how-to-de-anonymize-scam-knock-off-sites-hiding-behind-cloudflare", "via": "", "real_tags": ["隐藏", "obtain", "网站"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001477, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "乐高城深空火箭和发射控制系统是一种“模块化、多级火箭，带有驾驶舱、助推器和有效载荷存储模块。”该页面的显著特色是发射控制塔、发射台和各种额外设备(如月球车)的图像。但是这种火箭真的能飞吗？\n乐高为我们提供了一个“3D探索”选项，这为我们提供了一个很好的测量火箭确切大小的方法。我们首先假设：\n3个街区高的迷你雕像代表一个1.753米高的普通美国成年人(美国部门。(卫生与公众服务部；等人)。\n这两个助推器类似于航天飞机上使用的5层固体火箭助推器。\n这个设计的一个有趣的方面是，它去掉了常用的第二级助推器，取而代之的是有效载荷。虽然这增加了货物空间，但也增加了需要送入轨道的总质量，这也使得加速变得更加困难。\n使用这些数字，我们可以开始计算主要阶段的燃料量。让我们假设主级包含的燃料和氧化剂与航天飞机外部燃料箱中的燃料和氧化剂相似。相比之下，航天飞机的外部燃料箱可容纳735,601公斤燃料(LOX和LH2)，体积为2,050,798升。这大约是每升0.36千克的燃料。由于我们的主工作台的容积(假设它是一个气缸)为113,115升，所以它可以容纳大约40,573公斤的燃料。\n至于我们的固体火箭助推器，它的火箭燃料容积约为491.43立方米(假设是全圆柱形)，即每立方米可容纳约1,017公斤燃料。知道我们的SRB的体积是27.94立方米，我们可以假设我们的每个SRB可以容纳28,410公斤推进剂。\n为了简单起见，让我们假设我们的太空舱在质量上与猎户座乘员舱相似，或10400公斤。为简单起见，让我们假设有效载荷级与我们的Crew模块具有相同的质量。我们现在有了使用火箭方程式检查其运动所需的信息：\n我们知道我们的初始质量(M0)是107793千克(我们假设级是100%的推进剂)，我们知道我们的最终质量(Mf)是10400千克(这只是乘员舱)。标准重力(G0)只有9.81m/s^2。\n我们现在必须计算我们的比冲量(i，sp)。因为这些发动机也有不同的质量流量，所以我们需要用这个方程式得到最终的Isp。把这些数字输入到MATHEMICAL a中，我们就会得到：\n我们的最后一个Isp，也就是263.1秒。将它重新插入火箭方程式，我们得到最终的δ-v：\n4246.43米每秒，或4.25千米/秒。即使是需要9.4千米/秒的狮子座也不够高，尽管它肯定会打破卡曼线。这给乐高市领导层带来了令人不安的问题。如果它永远不会到达月球，为什么布景要包括一辆月球车和一只抓手？如果卫星没有到达甚至低地球轨道的δ-v，那它是用来做什么的？乐高，我们需要答案！", "note_en": "The LEGO City  Deep Space Rocket and Launch Control is a “modular, multi-stage rocket with cockpit, booster and payload storage modules.” Prominently featured on the page are images of the launch control tower, launchpad, and various extra equipment such as a lunar rover. But can this rocket really fly?\n  LEGO helpfully provides an “Explore in 3D” option for us, which provides us a good measure of the exact size of the rocket. We will first assume that:\n A minifigure, 3 blocks high, is repesentative of an average American adult, at 1.753 meters tall ( US Dept. of Health and Human Services; et al.)\n  The two boosters are similar to the 5-layer  solid rocket boosters used on the space shuttle\n   An interesting aspect of this design is that it removes the commonly-used second stage booster and replaces it with a payload. While this increases cargo space, it also increases the total mass that needs to be put into orbit, which makes it harder to accelerate as well.\n Using these figures, we can start calculating the amount of fuel in our main stage. Let’s assume that that the main stage contains fuel and oxidizer similar to that in the space shuttle’s external fuel tank. For comparison, the  shuttle’s external fuel tank holds 735,601 kilograms of fuel (both LOX and LH2), in a volume of 2,050,798 litres. That’s roughly 0.36 kg of fuel per litre. As our main stage has volume (assuming it’s a cylinder) 113,115 litres, it can hold about 40,573 kilograms of fuel.\n As for our solid rocket boosters, they hold 500,000 kg of rocket fuel in a volume of about 491.43 cubic meters (assuming a fully cylindrical booster), or about 1017 kg of fuel per cubic meter. Knowing that our SRB has volume 27.94 cubic meters, we can assume that each of our SRBs hold 28,410 kg of propellant.\n For simplicity, let’s just assume that our space capsule is similar in mass to the  Orion crew module, or 10,400 kg. Let’s assume that the payload stage has the same mass as our crew module for simplicity. We now have the information we need to use the  rocket equation to examine its motion:\n  We know our initial mass (m 0) to be 107,793 kg (we’re assuming the stages are 100% propellant), and we know our final mass (m f) to be 10,400 kg (that’s just the crew module). Standard gravity (g 0) is just 9.81 m/s^2.\n We’ll now have to calculate our specific impulse (I sp). Since these engines also have different mass flow, we’ll need to get final I sp with  this equation. Plugging in those numbers to Mathematica gives us:\n  Our final I sp, which is 263.1 seconds. Plugging this back into the rocket equation, we get our final delta-v:\n  4246.43 meters per second, or 4.25 km/s. That’s not high enough for even LEO, which  requires about 9.4 km/s, though it would definitely break the Karman line. This raises troubling questions for LEGO City leadership. Why does the set include a rover and a grappling arm, if it will never reach the moon? What’s the satallite used for if it doesn’t have the delta-v to reach even low-earth orbit? LEGO, we need answers!", "posttime": "2020-05-10 10:56:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "火箭,不会,deep,燃料", "title": "乐高城深空火箭会不会进入深空？", "title_en": "Will the Lego City Deep Space Rocket Go into Deep Space?", "transed": 1, "url": "http://h313.info/blog/aerospace/2020/05/09/an-analysis-of-the-lego-city-deep-space-rocket.html", "via": "", "real_tags": ["火箭", "不会", "deep", "燃料"]}, {"category": "", "categoryclass": "", "imagename": "1d5ae34c17714296c20ca62887f69dd9.png", "infoid": 1001476, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "很高兴向您介绍针对计划使用、标准预留实例或EC2实例节约计划的Amazon Elastic Compute Cloud(EC2)客户的降价信息。价格变化已经生效，因此任何购买新闻RIS或新的EC2实例储蓄计划的人都将能够利用较低的价格。\n我们的工程投资，再加上我们的规模和久经考验的产能管理能力，使我们能够确定并将成本节约传递给您。\n您获得的降价幅度取决于您选择的地区、您购买的是1年期还是3年期，最后是您在协议中承诺的实例族。降价幅度从你之前支付的1%到18%不等。下面我给出了M5、C5和R5实例类型的一些节省的快照，但是C5n、C5d、M5a、M5n、M5ad、M5dn、R5a、R5n、R5d、R5ad、R5dn、T3、T3a、Z1d和A1实例类型也有降价。\n\n有几点需要注意，首先，此降价不适用于可转换预留实例、计算节省计划或按需实例。其次，由于涉及许可，Windows实例将看到不同的降价。\n所有地区都可以降价，立即生效。展望未来，您将为EC2支付新的较低价格。\n--马丁", "note_en": "It is my great pleasure to tell you about a price reduction for  Amazon Elastic Compute Cloud (EC2) customers who plan to use, Standard Reserved Instances or EC2 Instance Saving Plans. The price changes are already in effect, and so anyone buying news RIs or a new EC2 Instance Saving Plan will be able to take advantage of the lower prices.\n  Our engineering investments, coupled with our scale and our time-tested ability to manage our capacity, allow us to identify and pass on cost savings to you.\n  The price reduction you receive, depends on the region you choose, whether you take out a 1 or 3 year term and finally the instance family you commit to in your agreement. Price reductions vary from between 1% to a massive 18% on what you were previously paying. Below I’ve given a snapshot of some of the savings across the M5, C5, and R5 instance types, however there are also price reductions for the instance types C5n, C5d, M5a, M5n, M5ad, M5dn, R5a, R5n, R5d, R5ad, R5dn, T3, T3a, Z1d, and A1.\n  \n  There are a few caveats that I’d like to make you aware of, firstly, this price reduction is not available for Convertible Reserved Instances, Compute Saving Plans or On-Demand instances. Secondly, Windows instances will see a different price reduction due to the licensing involved.\n  The price reduction is available in all regions effective immediately. Going forward, you will pay the new lower price for  EC2.\n  — Martin", "posttime": "2020-05-10 10:39:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ec2,实例", "title": "AWS EC2一般降价", "title_en": "AWS EC2 General Price Cut", "transed": 1, "url": "https://aws.amazon.com/blogs/aws/ec2-price-reduction-for-ec2-instance-saving-plans-and-standard-reserved-instances/", "via": "", "real_tags": ["ec2", "实例"]}, {"category": "", "categoryclass": "", "imagename": "0c6ae6bfb227bef2df2f648f14cb0d22.png", "infoid": 1001475, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "埃隆·马斯克(Elon Musk)宣布，由于当地对冠状病毒的反应过度，特斯拉将把总部和更多总部从加州迁至德克萨斯州和内华达州。\n在过去的几周里，马斯克一直在批评与大流行相关的避难所就地命令和限制-甚至称它们为法西斯主义者。\n正如我们本周早些时候报道的那样，在加利福尼亚州州长表示开始缓慢重新开放该州后，特斯拉试图重新开放弗里蒙特工厂，但弗里蒙特工厂所在的阿拉米达县关闭了特斯拉重启生产的尝试。\n对此，马斯克在推特上宣布，特斯拉正在对该县提起诉讼：\n“特斯拉正在立即对阿拉米达县提起诉讼。阿拉米达未经选举产生的无知的“临时卫生官”的行为违背了州长、总统、我们的宪法自由&仅仅是普通常识！“。\n这位首席执行官更进一步，宣布特斯拉将把总部和“未来的项目”搬到德克萨斯州和内华达州：\n“坦率地说，这是最后一根稻草。特斯拉现在将立即将其总部和未来的项目搬到德克萨斯州/内华达州。“。\n马斯克甚至暗示，特斯拉甚至可能不会保留弗里蒙特工厂，因为特斯拉在弗里蒙特雇佣了大约1万名员工，这取决于“未来如何对待它”：\n“如果我们甚至完全保留弗里蒙特的制造活动，那将取决于未来如何对待特斯拉。特斯拉是加州仅存的最后一家汽车制造商。\n这位首席执行官补充说，尽管有就地避难所的订单，特斯拉仍然能够继续运营其位于阿拉米达旁边的圣华金县的铸件铸造厂和其他设施。\n“由于当地的原地避难令仍在继续，没有为主要制造业活动(如特斯拉)的恢复提供拨备，我越来越担心这对我们地区经济的潜在影响。我们知道许多重要的企业已经证明，他们可以使用严格的安全和社会距离做法成功运营。我坚信，这些同样的做法也可能适用于其他制造业企业，特别是那些对我们的就业基础如此关键的企业。该市鼓励该县与我们当地的企业接触，为重新开放我们的当地经济提出可接受的指导方针。“就像我们十多年来所做的那样，一旦特斯拉能够恢复汽车制造业务，伦敦金融城就准备支持他们，并致力于以一种深思熟虑、平衡的方式进行这一努力，这对我们的弗里蒙特社区来说仍然是安全的。”\n特斯拉总部所在的帕洛阿尔托市长阿德里安·费恩(Adrian Fine)在推特上写道：\n我是帕洛阿尔托市长。如果特斯拉离开帕洛阿尔托，我会非常难过和失望，并随时准备提供帮助。我真的很感激有一家尖端的公司在这里工作，雇佣员工，纳税，并帮助解决气候危机。很高兴能帮上忙。\n我知道埃隆很沮丧，但我认为这是一种过度反应，具有讽刺意味的是，这正是他认为这个县正在发生的事情。\n“搬家总部”可能意味着很多不同的事情，有些比另一些更广泛，但这将是一件大事，特别是对特斯拉的普通/工程师/高管来说。\n虽然不比搬迁弗里蒙特工厂或他所说的“不保留弗里蒙特制造业活动”的可能性更大，但这听起来简直是疯了。\n虽然我倾向于同意埃隆的观点，即特斯拉能够通过与上海实施的措施类似的措施安全地重新开业，但我觉得他对这些威胁的做法并不正确。\n您正在阅读的是electrek，专家们日复一日地发布关于特斯拉、电动汽车和绿色能源的新闻。一定要查看我们的主页，了解所有最新新闻，并在Twitter、Facebook和LinkedIn上关注electrek，随时了解最新消息。不知道从哪里开始？请查看我们的YouTube频道以了解最新的评论。", "note_en": "Elon Musk announced that Tesla will move its headquarters and more from California to Texas and Nevada due to the local response to the coronavirus, which he believes is excessive.\n Over the last few weeks, Musk has been criticizing the shelter-in-place orders and restrictions related to the pandemic – going as far as calling them fascist.\n  As we reported earlier this week, Tesla attempted to reopen Fremont factory following comments from California’s Governor about starting to slowly reopen the state, but  Alameda County, where the Fremont factory is located, shut down Tesla’s attempt to restart production.\n In response, Musk announced on  Twitter that Tesla is filing a lawsuit against the county:\n “Tesla is filing a lawsuit against Alameda County immediately. The unelected &amp; ignorant “Interim Health Officer” of Alameda is acting contrary to the Governor, the President, our Constitutional freedoms &amp; just plain common sense!”\n The CEO went even further and announced that Tesla will be moving its headquarters and “future programs” to Texas and Nevada:\n “Frankly, this is the final straw. Tesla will now move its HQ and future programs to Texas/Nevada immediately.”\n Musk even suggested that Tesla might not even keep Fremont factory, where it employs about 10,000 people, depending on “how it gets treated in the future”:\n “If we even retain Fremont manufacturing activity at all, it will be dependen on how Tesla is treated in the future. Tesla is the last carmaker left in CA.”\n The CEO added that Tesla has been able to keep operating its castings foundry and other facilities in San Joaquin County, which located next to Alameda, despite the shelter-in-place orders.\n   “As the local shelter-in-place order continues without provisions for major manufacturing activity, such as Tesla, to resume, I am growing concerned about the potential implications for our regional economy.  We know many essential businesses have proven they can successfully operate using strict safety and social distancing practices.  I strongly believe these same practices could be possible for other manufacturing businesses, especially those that are so critical to our employment base. The City encourages the County to engage with our local businesses to come up with acceptable guidelines for re-opening our local economy.  As we have done for over a decade, the City is prepared to support Tesla as soon as they are able to resume automobile manufacturing operations and are committed to a thoughtful, balanced approach to this effort that remains safe for our Fremont community.”\n And the Mayor of Palo Alto, where Tesla’s HQ is located, Adrian Fine  Tweeted the following:\n Palo Alto Mayor here. I would be really sad and disappointed if Tesla left Palo Alto , and stand ready to help. I truly appreciate having a cutting edge company based here, employing people, paying taxes, and helping to solve the climate crisis. Happy to help\n  I understand that Elon is frustrated, but I think that’s an overreaction, which ironically is what he believes the county is having.\n “Moving HQ” can mean a lot of different things, some more extensive than others, but it’s going to be a big deal, particularly for Tesla’s rank and file/engineers/executives.\n Though no bigger than moving Fremont factory or whatever he means by the possibility of not “retaining Fremont manufacturing activity”, which sounds just insane.\n While I tend to start to agree with Elon about Tesla being able to reopen safely with similar measures as the ones implemented in Shanghai, I feel like he is not going about it the right way with those threats.\n  You’re reading Electrek— experts who break news about  Tesla,  electric vehicles, and  green energy, day after day. Be sure to check out our  homepage for all the latest news, and follow Electrek on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  YouTube channel for the latest reviews.", "posttime": "2020-05-10 10:39:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,coronavirus,病毒,特斯拉,反应", "title": "特斯拉将因当地冠状病毒反应将加州移至德克萨斯州/内华达州", "title_en": "Tesla will move California to Texas/Nevada due to local coronavirus response", "transed": 1, "url": "https://electrek.co/2020/05/09/tesla-move-california-to-texas-nevada-coronavirus-response/", "via": "", "real_tags": ["冠状病毒", "病毒", "特斯拉", "反应"]}, {"category": "", "categoryclass": "", "imagename": "fcc375b7f03a14388d94189667e8220d.png", "infoid": 1001473, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "那么哪一个更好呢？网格还是Flex？什么时候用哪一种？有什么不同？对我来说，我认为这两者是对布局设计的根本不同的思考方式。我不认为其中一个比另一个更好或更差。它们一起使用是很常见的。\n或者你可以在Twitter上关注我，在那里我可以分享更多的教程。\n甚至可能有一些我忽略的错误(如果您发现了任何错误，请告诉我。)。\n我的目标不是说一个比另一个好。但是为了帮助刚刚起步的人了解Flexbox和Grid的一般用例。\nFlex不是为生成网格而设计的。它基于柔线和方向的概念。但是，Flex仍然可以使用WRAP处理行和列：\n通常，FLEX不是用来创建网格的，而是用来对齐行和列的。但是.。\n要使用FLEX模拟网格，必须将FLEX-WRAP属性设置为WRAP。\n栅格具有间隙和线条。Flex具有软线，但它们在不同的上下文中使用。\nFLEX只为您提供一条定义整体项目方向的弹性线。它由弹性方向属性(设置为行或列)确定。有一个主轴(X)和一个十字轴(Y)。挠性开始和挠性结束可以根据挠性方向而改变。\n栅格允许您更改间隙大小。但您不能更改每个维度的单个间隙的大小：一旦使用GRID-ROW-GAP设置了间隙大小，所有行间隙都必须是该大小。栅格-列-间隙也是如此。\n要同时设置所有间隙大小，可以使用栅格间隙快捷键。\n当同时使用Flex和网格模型时，了解单元格、项目和内容之间的区别是很重要的。\n这里，我还增加了Flex中的项数，只是为了看看它是如何工作的。\n当涉及到内部项目对齐时，它们所做的事情几乎是一样的。有些属性甚至具有完全相同的名称(例如，Adjut-Content和Adjut-Items用来对齐内部内容和/或项目的目的完全相同)。\n我记得我们刚刚使用Float CSS属性来处理&#34；Float&34；元素的时候。它只在水平方向上起作用！谢天谢地，那些日子早已一去不复返了。以下是360设置：\n如果在FLEX和GRID中有这么多属性产生相同的结果，那么有什么不同呢？基本上，对齐项目有三种思考方式。\n有时事情不会像预期的那样对齐。这是因为不同的对齐属性是针对特定情况量身定做的。\n注意：使用GRID，如果您学习如何将fr单位与min-max一起使用，则可以避免创建响应布局的媒体查询。\n在性能测试中，Flex的渲染速度通常比网格快。但是如果你对电网已经很在行，除非有很好的理由，否则我不会担心转换。\n如果您想单独详细了解Flex或Grid：\n或者你可以在Twitter上关注我，在那里我可以分享更多的教程。\n免费学习编码。FreeCodeCamp的开源课程已经帮助超过4万人找到了开发人员的工作。开始", "note_en": "So which one is better? Grid or Flex? When to use which? What are the differences? For me, I see both as fundamentally different ways of  thinking about layout design. I don&#39;t think one as better or worse than the other. It is common to use them together.\n   Or you can just   follow me on Twitter where I share more of my tutorials.\n   There may even be some mistakes I overlooked (let me know if you find any.)\n My goal is not to say one is better than the other. But to help someone who is just starting out get some perspective on general use cases for both flexbox and grid.\n    Flex is not designed to make grids. It is based around the idea of a flex line and direction. However, flex can still handles row and column using  wrap:\n      Generally flex is not used to create grids but to align rows and columns. But...\n To simulate a grid with flex you would have to set  flex-wrap property to  wrap.\n  Grid has  gaps and  lines. Flex has  flex lines but they are used in a different context.\n  FLEX gives you only one flex line defining overall item direction. It is determined by  flex-direction property (set to  row or  column.) There is a main (x) axis and cross-axis (y).  flex-start and  flex-end can change depending on  flex-direction.\n GRID allows you to change gap size. But you can&#39;t change size of individual gaps per  dimension: once gap size is set with  grid-row-gap all   row gaps must be that size. Same goes for  grid-column-gap.\n To set all gap sizes at the same time you would use the  grid-gap short hand.\n  When working with both flex and grid models it&#39;s important to understand the difference between  cells,  items and  content.\n       Here I also increased number of items in flex just to see how it works.\n              They both do pretty much the same things when it comes to inner item align. Some properties even have exactly the same names ( adjust-content and  adjust-items for example serve exactly the same purpose of aligning  inner content and/or items.)\n  I remember the times when we just used  float CSS property to &#34;float&#34; elements. It only worked horizontally! Thankfully those days are long gone. Here&#39;s the 360 setup:\n    If so many properties produce the same exact results in flex and grid, what is the difference? Basically there are 3 ways of thinking about aligning items.\n   Sometimes things won&#39;t align as expected. This is because different align properties are tailored for specific situations.\n     Note: with grid you can avoid media queries for creating responsive layouts if you learn how to use fr units together with min-max.\n   In performance tests flex usually renders faster than grid. But if you&#39;re already good at grid I wouldn&#39;t worry about switching unless there is a good reason.\n  If you want to take a super detailed look at Flex or Grid in isolation:\n   Or you can just   follow me on Twitter where I share more of my tutorials.\n      Learn to code for free. freeCodeCamp&#39;s open source curriculum has helped more than 40,000 people get jobs as developers.  Get started", "posttime": "2020-05-10 10:39:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "flex,css,方向", "title": "CSS Flex与网格", "title_en": "CSS Flex vs. Grid", "transed": 1, "url": "https://www.freecodecamp.org/news/differences-between-css-flex-and-grid/", "via": "", "real_tags": ["flex", "css", "方向"]}, {"category": "", "categoryclass": "", "imagename": "f5535634c38705258932e9414cf11a86.png", "infoid": 1001472, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在很多人都在考虑家庭网络的安全，作为OWASP物联网安全项目的项目负责人之一，我想提供三个你在家里可以做到的安全级别。\n关于这份清单，需要认识到的最重要的一点是，它是头重脚轻的。第一个远比第二个重要，前三个远比后三个重要。等。\n将所有默认密码更改为唯一且强的密码。这是本文中最重要的一点。大多数家庭网络要么是通过网络钓鱼，要么是通过他们拥有的带有错误密码的随机设备被侵入。它通常是一个从未配置过或从未更改过默认值的密码。使用密码管理器为每个帐户/设备设置并存储不同的有效密码。\n为网络上的所有计算机、路由器和其他设备打补丁。第二件最重要的事情是确保您的所有计算机和设备都安装了最新的安全补丁。您应该启用自动更新(如果可用)，如果没有，请尝试至少每周更新一次。\n如果你只做这两件事，你会比95%的家庭用户更安全。但让我们看看级别2。\n为高风险系统启用2FA。大多数人的最高风险系统是他们的主要电子邮件账户和手机账户。这些是打开您拥有的所有其他帐户的所有大门的钥匙(因为它们是您进行帐户恢复的方式)。接下来是您的社交媒体帐户，然后是控制您家中物联网系统的任何帐户。您是否有联网的灯、电器、游戏系统、媒体系统等？更改他们的密码(请参见上文)，并启用双因素身份验证。\n将您的高风险设备划分到单独的网络中。下一个需要考虑的强大控制是对您的网络进行分段。这是您将您的高风险系统(如物联网设备、娱乐系统、游戏系统等)放在自己的网络上的地方，这些网络与您的个人计算机、笔记本电脑、电话等是分开的。\n将您的DNS更改为1.1.1.2或1.1.1.3以获得隐私和恶意域筛选。接下来，您可以考虑更改所有设备上的DNS设置，以便由CloudFlare使用这些设置。事实上，有很多好的选择；我只是试着说明性的。1.1.1.2仅阻止恶意软件，1.1.1.3阻止恶意软件和成人内容。请确保不仅在您的路由器上设置这些设置，而且在您的其他设备上也设置这些设置。\n因此，如果您已经完成了所有这些操作，那么您现在就可以进入到第3级了。本节需要一些相当重要的技术知识才能实现，而且可能远远超出了大多数人的需要。但是这很有趣！\n使用Rumble清点您的家庭网络资产。任何认真对待安全问题的人都要从了解他们在防御什么开始，这就是朗布尔的用武之地。这是一个由H.D.Moore创建的工具，可以为您的本地网络创建一个持续更新的清单，并且有一个适用于家庭网络的免费版本！安装它，运行常规扫描，调查任何异常情况。\n使用CanaryTools监视网络上的恶意篡改。在您有了库存之后，您可以开始在网络上寻找欺骗的实际迹象。最有效的方式是使用金丝雀代币，而且还有一个免费版本！创造一些，把它们撒在周围，然后寻找热门的。\n升级到类似Ubiquiti Dream Machine的Prosumer路由器，以获得企业安全功能。接下来，您可能想看看更高端的路由器。这些年来，Ubiquiti的东西变得越来越好，作为一个从防火墙工程起步的人，我开始在这些东西中看到大量的企业功能。企业身份验证、基于地理位置的黑白名单、基于MAC的控制、IDS/IPS、信号优化、日志记录功能等。另一个选项是Sophos提供的Astaro Security Gateway。\n点击您的网络并实施Suricata的新兴威胁规则来检测恶意活动。最后，如果您对这些东西非常感兴趣，那么您应该看看真正的IDS。Suricata基于Snort，这也是我在最近几个Forever中使用的，我推荐使用E-T签名。\n请记住，做好前几项将极大地提高您的安全性。为了获得最好的结果，让尽可能多的你认识和关心的人来做前两件事！\n高级部分的另一个很好的选择是使用PiHole。它更多的是在屏蔽广告和提供隐私方面，但绝对值得一看。更多", "note_en": "A lot of people are thinking about the security of their home network right now, and as one of the project leaders on the  OWASP Internet of Things Security Project, I wanted to provide three levels of security you can do at home.\n The most important thing to realize about this list is that it’s top-heavy. The first one is far more important than the second, and the first three are far more important than the second three. Etc.\n    Change all default passwords to something unique and strong. This is the most important thing in this article. Most home networks get broken into through either phishing or some random device they have with a bad password. It’s usually a password that was never configured or never changed from the default.  Use a password manager to make and store good passwords that are different for every account/device.\n Patch all computers, routers, and other devices on the network. The second most important thing to do is make sure you keep all your computers and devices updated with security fixes. You should enable automatic updates if available, and try to update at least weekly if not.\n  If you did just those two things you’d be more secure than 95% of home users out there. But let’s look at  Level 2.\n  Enable 2FA for high-risk systems. Most peoples’ highest risk systems are their primary email account and their mobile phone account. These are the keys that open all doors into every other account you have (because they’re how you do account recovery). Next come your social media accounts, and then any accounts that control IoT systems in your house. Do you have internet-connected lights, appliances, gaming systems, media systems, etc? Get their passwords changed (see above), and enable two-factor authentication.\n Segment your high-risk devices onto a separate network. The next strong control to consider is segmenting your network. This is where you take your higher-risk systems, like your IoT devices, your entertainment systems, gaming systems, etc., and place them on their own network—separate from your personal computers, laptops, phones, etc.\n  Change your DNS to 1.1.1.2, or 1.1.1.3 to get privacy and malicious domain filtering.Next, you can consider changing your DNS settings on all your devices to use those by CloudFlare. There are plenty of good options, actually; I’m just trying to be prescriptive. 1.1.1.2 blocks just malware, and 1.1.1.3 blocks malware and adult content. Make sure to set these on not just your router, but on your other devices as well.\n  So if you’ve done all that, you can now move into the tasty stuff at  Level 3. This section requires some pretty significant technical knowledge to implement, and is probably far more than most people need. But it’s fun!\n  Use  Rumble to inventory your home network’s assets. Anyone serious about security starts with understanding what they’re defending, and that’s where Rumble comes in. It’s a tool created by H.D. Moore that creates a continuously-updated inventory of your local network, and  there’s a free version for home networks! Install that, run regular scans, and investigate anything out of the ordinary.\n Use  CanaryTools to monitor for malicious tampering on your network. After you have your inventory, you can move into looking for actual signs of trickery on the network. The most efficient way to do that is with Canary Tokens, and once again,  there’s a free version! Create some, sprinkle them around, and look for hits.\n Upgrade to a prosumer router like a  Ubiquiti Dream Machine to get enterprise security features. Next you might want to look at a higher-end router. The Ubiquiti stuff has been getting better and better over the years, and as someone who started in firewall engineering, I’m starting to see tons of enterprise features in these things. Enterprise Auth, Geo-based Black/Whitelisting, MAC-based controls, IDS/IPS, Signal Optimization, Logging Capabilities, etc. Another option is an  Astaro Security Gateway, by Sophos.\n Tap your network and implement Suricata’s Emerging Threat rules to detect malicious activity. And finally, if you’re seriously into this stuff, you should look at getting into a real IDS.  Suricata is based on Snort, and it’s what I’ve used for the last few forevers, and I recommend using the E T Signatures.\n  Remember, doing the first few well will  massively improve your security. And for the best results, get as many people that you know and care about to do the first two!\n    Another great option for the advanced section is the use of a PiHole. It’s more in the spaces of blocking ads and providing privacy, but it’s definitely worth a look.  More", "posttime": "2020-05-10 10:36:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,保护,approach", "title": "保护您的家庭网络的三层方法", "title_en": "A 3-Tiered Approach to Securing Your Home Network", "transed": 1, "url": "https://danielmiessler.com/blog/three-tiered-approach-lock-down-your-home-network/", "via": "", "real_tags": ["app", "保护", "approach"]}, {"category": "", "categoryclass": "", "imagename": "949173951b20544ebc826d40e85e8dbd.png", "infoid": 1001471, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "高龄和合并症并不是冠状病毒相关死亡率的唯一预测因子。随着致命病例出现在更多不同的社区，研究人员开始起草一份致病因素的短名单。\n最新的研究来自一组印尼研究人员进行的一项新研究。在这篇文章中，作者基于780例实验室确认的冠状病毒病例，令人信服地建立了冠状病毒死亡与维生素D缺乏之间的关系。\n“年龄、性别、合并症、维生素D状况和疾病结局(死亡率)都是从电子病历中提取的。目的是确定死亡率和相关因素的模式，特别关注维生素D的状况，“作者在新的队列分析中写道。他说：“结果显示，大部分死亡个案均为男性或年龄较大的人士，他们有既往病症，并低於正常的维生素D血清水平。”单变量分析显示，有既往疾病且维生素D水平低于正常水平的老年和男性病例与死亡几率增加有关。在控制年龄、性别和共病时，维生素D状况与病例的冠状病毒死亡率结果密切相关。“。\n由普拉博沃·拉哈鲁苏纳博士领导的这项研究表明，那些受到SARS-CoV-2病毒不成比例影响的人还会因为无法获得维生素D而面临额外的风险。维生素D是一种被研究为对人体内血清25水平产生重大影响的制剂。\n独立进行的研究已经证实，达到每日维生素D推荐值的患者在SARS-CoV-2传播后患轻度冠状病毒病例的可能性增加近20倍。\n建议儿童每天达到400到800 IU(或10-20微克)，71岁及以上的人建议将此值增加到800 IU。\n这篇以印尼队列为前提的新论文，通过将冠状病毒死亡与每一种复发因素联系起来，延长了这些发现。\n根据结果，在医院接受冠状病毒治疗的维生素D缺乏患者中，绝大多数死于呼吸系统疾病。\n此外，有既往疾病的患者、男性和老年人在康复过程中被发现独特地受到维生素D水平的帮助和虚弱。\n当研究人员调整了年龄、性别和共病等因素后，维生素D状态仍然是冠状病毒相关死亡率的有力指标。\n“这项研究的重点是确定冠状病毒感染患者的死亡模式，以及血清25(OH)D[维生素D]水平和死亡结果之间的可能联系，”论文继续说。“有必要进行随机对照试验，以调查补充维生素D对冠状病毒结果的作用，并建立潜在的机制。”\n在新的队列研究中，维生素D不足的参与者死于冠状病毒的几率增加了13倍，而维生素D缺乏的患者增加了19倍。\n不幸的是，医学上可以将超过40%的美国人口定义为维生素D缺乏。除了保护我们免受进行性疾病的侵袭外，维生素D还可以提高我们吸收钙的能力，防止晚年骨质疏松等退行性疾病，甚至多种形式的癌症。\n总而言之，上个月提出的所有研究结果都表明，体内血清25(OH)D水平的增加具有改善中度冠状病毒结局和缓和严重到严重症状的双重潜力。\n同样，体内血清25(OH)D水平的下降可能会使冠状病毒患者的所有临床结果复杂化。\n他说：“维生素D的状况与临床结果密切相关。社会科学研究网络报告说：“多项Logistic回归分析表明，血清25(OH)D的标准差每增加一次，出现轻度临床结果而不是严重结果的几率约为7.94倍，而有趣的是，出现轻微临床结果而不是严重结果的几率约为19.61倍。", "note_en": "Old age and comorbidities  are not the only predictors of COVID-19 related mortality. As fatal cases appear in more diverse communities researchers are beginning to draft a shortlist of contributing factors.\n The latest comes from   a new study  conducted by a team of Indonesian researchers. In it, the authors compellingly establish a correlation between COVID-19 deaths and Vitamin D insufficiency based on 780 laboratory-confirmed coronavirus cases.\n “Age, sex, co-morbidity, Vitamin D status, and disease outcome (mortality) were extracted from electronic medical records. The aim was to determine patterns of mortality and associated factors, with a special focus on Vitamin D status,” the authors wrote in the new cohort analysis. “Results revealed that the majority of the death cases were male and older and had pre-existing conditions and below normal Vitamin D serum level. Univariate analysis revealed that older and male cases with pre-existing conditions and below normal Vitamin D levels were associated with increasing odds of death. When controlling for age, sex, and comorbidity, Vitamin D status is strongly associated with COVID-19 mortality outcome of cases.”\n  The research, led by Dr. Prabowo Raharusuna indicates that those who are disproportionately affected by the SARS-CoV-2 virus are additionally put at risk by a failure to achieve Vitamin D;   an agent studied to pose a major influence on serum25 levels in the human body.\n Independently conducted studies  have already verified that patients who meet the recommended daily value of vitamin D increase their likelihood of developing mild COVID-19 cases following SARS-CoV-2 transmission by nearly 20 times.\n Children are advised to achieve between 400 and 800 IU a day (or 10–20 micrograms), and individuals aged 71 and older are advised to increase this value to 800 IU.\n The new paper, premised by Indonesian cohorts, lengthens these findings by linking coronaviruses fatalities with each and every recurring element.\n According to the results, the vast majority of Vitamin D deficient patients admitted to hospitals for COVID-19 treatment succumbed to respiratory disease.\n Additionally, patients with preexisting conditions, men and the elderly were found to be uniquely aided and debilitated by Vitamin D levels during the recovery process.\n When the researchers adjusted for factors like age,   sex , and   comorbidity , Vitamin D status remained a strong indicator of  COVID-19 related mortality.\n “This study focused on identifying patterns of mortality among patients infected with COVID-19 and the possible association between serum 25(OH)D [vitamin D] levels and mortality outcomes,” the paper continued. “Randomized controlled trials are warranted to investigate the role of vitamin D supplementation on COVID-19 outcomes and to establish the underlying mechanisms.”\n The Vitamin D insufficient participants involved in the new cohort study increased their odds of succumbing to COVID-19 by a factor of 13 while the vitamin D deficient patients increased this odd by a factor of 19.\n Unfortunately, more than 40% of the US population can be medically defined as Vitamin D deficient. In addition to keeping us protected against progressive illnesses,  Vitamin D improves our ability to absorb calcium, preventing degenerative diseases like osteoporosis later in life and even many forms of cancer.\n   Collectively, all of the findings posited in the last month suggest that an increase in serum 25(OH)D levels in the body has the dual potential to improve moderate coronavirus outcomes and temper severe to critical manifestations.\n Similarly a decrease in serum 25(OH)D level in the body likely compounds all clinical outcomes in  COVID-19 patients.\n “Vitamin D status is significantly associated with clinical outcomes. A multinomial logistic regression analysis reported that for each standard deviation increase in serum 25(OH)D, the odds of having a mild clinical outcome rather than a severe outcome were approximately 7.94 times while interestingly, the odds of having a mild clinical outcome rather than a critical outcome were approximately 19.61 times,” The Social Science Research Network reports.", "posttime": "2020-05-10 10:35:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,维生素,冠状病毒,chance", "title": "低水平的维生素D？你死于冠状病毒的几率更高", "title_en": "Low levels of Vitamin D? You have a higher chance of dying from Covid-19", "transed": 1, "url": "https://www.theladders.com/career-advice/if-your-body-has-low-levels-of-this-you-have-a-higher-chance-of-dying-from-covid-19", "via": "", "real_tags": ["病毒", "维生素", "冠状病毒", "chance"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001470, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们听到了越来越多关于NVIDIA的下一代安培和霍珀图形处理器的消息，上周传言比过去几个月更多。现在?。我们有消息说NVIDIA正和霍珀一起爆炸到5纳米。\n根据DigiTimes的一份新报告，NVIDIA已经预订了台积电2021年5纳米的产能，同时还在与三星洽谈较小数量的订单。原因呢？为了防止AMD变得更大，NVIDIA决定迎头赶上，甚至超越AMD，采用台积电的7 nm和5 nm EUV节点。\n现在请记住，这里没有人要记录在案，所以对这一切持保留态度。有一些重大的权力行动正在发生，我相信我们现在都能看到--但这一切都是非常有趣的。\nTwitter上的RetiredEngineer&39；在推特上发布了DigiTimes的报告，没有任何迹象表明NVIDIA&34；之前低估了AMD拥抱台积电的影响，并在自己的迁移到高级节点的计划中犯了一些错误。转战三星，在台积电战略上摇摆不定，但后来又回到台积电，NVIDIA无法获得足够的7 nm产能，导致AMD抢占了风头，侵蚀了NVIDIA的品牌价值，并增加了自己在GPU上的市场份额。\n这条推文继续说，为了防止AMD变得更大，NVIDIA已经决定迎头赶上，甚至超越AMD，采用台积电的7 nm和即将推出的5 nm EUV节点。\nGA102-84 SMS/5376 CUDA核心/12 GB GDDR6/384位总线-比腾讯通2080 Ti快40%。\nGA103-60 SMS/3840 CUDA核心/10 GB GDDR6/320位总线-比腾讯通2080 Ti快10%。\nGA104-48 SMS/3072 CUDA核心/8 GB GDDR6/256位总线-比腾讯通2080 Ti慢5%。\n我已经写过关于NVIDIA的下一代安培GPU架构将比当前一代的图形处理器(如图灵架构)快75%的传言，就在此之前，有传言称安培将以图灵一半的能力提供50%以上的性能。这是相当疯狂的事情就在那里。\n不仅如此，我们还有传言说GeForce RTX 3080和GeForce RTX 3070显卡的规格，这两款显卡都将采用NVIDIA的新安培GPU架构。\n我们已经听说安培会以图灵一半的功率多提供50%的性能，这让我毛骨悚然。更好的是，你可以在这里读到所谓的基于安培的GeForce RTX 3080和GeForce RTX 3070的泄露规格。\nAMD还刚刚公布了其下一代rDNA2/Navi2X计划，直到最近，我们还将其称为Big Navi。这些规格是可怕的，但与NVIDIA为其旗舰HPC安培GA100野兽计划的相比，它们相形见绌。", "note_en": "We are hearing more and more about  NVIDIA&#39;s next-gen Ampere and Hopper GPUs, with more rumors flying in the last week than the last few months. Now? We have news that NVIDIA is bursting right into 5nm with Hopper.\n  According to a new report from DigiTimes, NVIDIA has &#34; already pre-booked TSMC&#39;s 5nm production capacity in 2021&#34; while &#34; also in discussion with Samsung for smaller volume orders&#34;. The reason? To &#34; prevent AMD from getting any bigger, NVIDIA has decided to catch up, even leapfrog AMD, in adopting TSMC&#39;s 7nm and 5nm EUV nodes&#34;.\n  Now remember, there&#39;s no one going on the record here so take this all with a grain of salt. There are some big power moves going on, I&#39;m sure we can all see that by now -- but this is all just so very interesting.\n  &#39;RetiredEngineer&#39; on Twitter tweeted out the DigiTimes report, nothing that NVIDIA &#34; previously underestimated the effect of AMD embracing TSMC, and made some errors in its own plans for migrating to advanced nodes. Moving to Samsung and wavering in its TSMC strategy, only to be go back to TSMC later, NVIDIA was unable to secure enough 7nm capacity, resulting in AMD grabbing the limelight, eroding NVIDIA&#39;s brand value, and increase its own market share for GPUs&#34;.\n  The tweet continues that &#34; in order to prevent AMD from getting any bigger, NVIDIA has decided to catch up, even leapfrog AMD&#34; by adopting TSMC&#39;s 7nm and upcoming 5nm EUV nodes.\n      GA102 - 84 SMs / 5376 CUDA cores / 12GB GDDR6 / 384-bit bus -  40% faster than RTX 2080 Ti\n GA103 - 60 SMs / 3840 CUDA cores / 10GB GDDR6 / 320-bit bus -  10% faster than RTX 2080 Ti\n GA104 - 48 SMs / 3072 CUDA cores / 8GB GDDR6 / 256-bit bus -  5% slower than RTX 2080 Ti\n   I&#39;ve already written about rumors that   NVIDIA&#39;s next-gen Ampere GPU architecture would be up to 75% faster than current-gen GPUs such as the Turing architecture, right after   rumors that Ampere would offer 50% more performance at half the power of Turing. This is pretty crazy stuff right there.\n  Not only that, but we&#39;ve got some   rumored specs on the purported GeForce RTX 3080 and GeForce RTX 3070 graphics cards, which will both be powered by NVIDIA&#39;s new Ampere GPU architecture.\n We&#39;ve already heard that   Ampere would offer 50% more performance at half the power of Turing, which sent the hairs on my neck standing up. Better yet, you can read about the leaked specs on the   purported Ampere-based GeForce RTX 3080 and GeForce RTX 3070 right here.\n       AMD also just revealed its   next-gen RDNA 2 / Navi 2X plans, something we referred to as Big Navi until just recently. Those specs are monstrous, but they pale in comparison to what NVIDIA has planned for its flagship HPC destined Ampere GA100 beast.", "posttime": "2020-05-10 09:46:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nvidia,amd", "title": "NVIDIA，AMD将收购台积电产能", "title_en": "NVidia, AMD Battle To Buy Out TSMC's Capacity", "transed": 1, "url": "https://www.tweaktown.com/news/72296/nvidia-wants-to-leap-frog-amd-and-prevent-them-from-getting-bigger/amp.html", "via": "", "real_tags": ["nvidia", "amd"]}, {"category": "", "categoryclass": "", "imagename": "f154f388be9136989030aca8f92ac7e9.jpg", "infoid": 1001469, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "又一个月，TIOBE指数又一次更新。该指数根据搜索引擎结果追踪编程语言的受欢迎程度。这个月，C超越了Java，进入了第一名的位置。\n2019年，C语言荣获令人垂涎的年度编程语言大奖。现在，2020年已经快过半了，它会再次获奖吗？\nTIOBE指数更新了2020年5月的排名，并有了新的第一名。(或者，我们应该说是老的头号人物吗？在1985、1990、2000、2005和2015年间，C语言一直是排名第一的编程语言！)。\n欢迎回到榜首，C。TIOBE指数的更新表明，当前C：的搜索量略有上升的原因。\nJava和C在4月份就已经非常接近了，但是这个月C再次超过了Java。上一次C排名第一是在2015年。我们只能猜测为什么C又是第一名。其中一个原因可能是冠状病毒。这听起来可能很愚蠢，但一些编程语言确实从这种情况中受益。数据科学领域的Python和R就是一个例子，因为每个人都在寻找病毒的解毒剂。而且嵌入式软件语言(如C和C++)也越来越受欢迎，因为这些语言用于医疗设备的软件中。另外值得一提的是，《锈迹斑斑》现在真的已经接近前20名了(一个月内从第27名升至第21名)。\nC受欢迎的另一个原因可能是因为该语言在嵌入式设备中的使用及其跨平台编程。\n随着物联网的不断发展，C语言也可能与之一起成长，并继续作为一种通用编程语言使用。\nC语言最早出现于1972年，48年后的今天，它仍然启发着其他语言的语法。\n这种顶级语言的重新洗牌将Java推到了银牌位置。当然，下个月所有人都可以重新洗牌，Java可以重新爬起来。\n但是，Java是否在走下坡路呢？企业中并不缺少Java；在可预见的未来，Java仍将是顶级编程语言。\n然而，特别是在移动应用程序编程方面，Kotlin是正直的。根据RedMonk在2020年1月的编程语言排名，Kotlin正在快速增长。来自GitHub和Stack Overflow的数据显示，它现在是第19种最常用的编程语言。像Duolingo这样的大牌已经将它们的源代码从Java迁移到了Kotlin，减少了它们的行数。\n就每月的TIOBE指数更新而言，没有太多值得注意的变化。铁锈正在向前20名靠拢，如果它保持自己的轨迹，我们可能很快就会看到它进入榜单。\n另一方面，如果Perl继续保持下降趋势，它可能会退出排行榜。本月的变化率为-0.51%。它目前在榜单上排名第18位，但在2019年5月是第13位。\n上个月我们谈到了Scratch进入前20名的编程语言。教育语言教孩子们(所有年龄段的孩子！)。通过游戏制作，掌握一些基本的编码概念和批判性思维技能。目前排名第19位，变动幅度为+0.32%。", "note_en": "Another month, another update to the TIOBE Index. The Index tracks the popularity of programming languages according to search engine results. This month, C moved up past Java and entered the number one position.\n  In 2019,  C won the coveted Programming Language of the Year award. Now, nearly halfway through 2020, is it in line to win the award again?\n The TIOBE Index updated their rankings for May 2020 and there’s a new number one. (Or, should we say an  old number one? C was the number one programming language throughout 1985, 1990, in 2000, 2005, and 2015!)\n    Welcome back to the top spot, C. The  TIOBE Index update suggests a current reason for the slight uptick in searches for C:\n Java and C were already very close in April, but this month C surpasses Java again. The last time C was number one was back in 2015. We can only guess why C is number one again. One of the reasons might be the Corona virus. This might sound silly but some programming languages really benefit from this situation. Examples are Python and R in the data sciences area because everybody is searching for an antidote for the virus. But also embedded software languages such as C and C++ are gaining popularity because these are used in software for medical devices. On another note, it is also worth mentioning that Rust is really getting close to the top 20 now (from #27 to #21 within one month).\n Another reason for C’s popularity might be because of the language’s use in embedded devices and its cross-platform programming.\n As the Internet of Things continues to gain prominence, C will also likely grow along with it, as well as continue its use as a general-purpose programming language.\n C first appeared back in 1972 and 48 years later, it still inspires other languages’ syntax today.\n   This reshuffling of the top languages pushes Java down to the silver position. Of course, next month all can reshuffle again and Java can climb back up.\n But, is Java on the decline? There’s no shortage of Java in the enterprise; for the foreseeable future Java will remain a top programming language.\n However, especially in mobile app programming, Kotlin is on the up and up. According to  The RedMonk Programming Language Rankings for January 2020, Kotlin is growing fast. Data from GitHub and Stack Overflow suggests that it is now the 19th most commonly used programming language.  Big names such as Duolingo have migrated their source code from Java over to Kotlin, reducing their line count.\n   As far as the monthly TIOBE Index update goes, there aren’t many more notable changes. Rust is edging closer into the top 20 and if it maintains its trajectory, we could see it make the list soon.\n Perl, on the other hand, might be on its way off of the charts, if it continues its downward trend. This month it saw a rate of change of -0.51%. It is currently number 18 on the list, but in May 2019 it was number 13.\n We spoke about  Scratch’s entry to the top 20 programming languages last month. The educational language teaches kids (of all ages!) some basic coding concepts and critical thinking skills through game making. It is now in the 19th position with a change of +0.32%.", "posttime": "2020-05-10 09:17:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "编程,programming,声称,语言", "title": "TIOBE声称，C语言现在是最流行的编程语言", "title_en": "C Is Now the Most Popular Programming Language, Claims TIOBE", "transed": 1, "url": "https://jaxenter.com/c-programming-may-2020-171598.html", "via": "", "real_tags": ["编程", "声称", "语言"]}, {"category": "", "categoryclass": "", "imagename": "cee06b3721b0eaf14e92aa8bb80ccd6f.jpeg", "infoid": 1001468, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "不，我们的口罩没有得到FDA或NIOSH或任何其他州或联邦监管机构的批准，但我们已经对它们进行了严格的测试，以确保它们服务于为我们服务的医疗专业人员！\n疾控中心最近批准了“自制口罩”，用于危机管理和批准材料的短缺。\nN95口罩仍然是推荐的个人防护设备(PPE)。蒙大拿面罩是一个工具，可以帮助您将现有的N95面罩供应增加6个。在N95口罩供不应求或没有供应的情况下，我们建议每个使用这些口罩的医院或个人在医院管理人员的支持下进行全面的适合性测试。面罩的过滤效率将随着插入过滤器外壳的材料的不同而不同。\n这不是FDA或NIOSH批准的N95产品，应该经过测试并符合您当地医院的标准。\n虽然我们已经按照OSHA标准对该设备进行了要求的测试，但这不是FDA或NIOSH批准的产品。我们所有的研究结果都表明，这款口罩通过或超过了过滤的标准测试要求。请参阅我们的研究。\n制造面具不生产面具。这是一项帮助社区满足自身需求的草根努力。我们鼓励学校、大学、牙医、公共图书馆和业余爱好者使用3D打印文件，以满足其社区的需求。如果能与当地厂商协调，设计文件也可以用于该产能，因为蒙大拿州有当地厂商愿意以成本价出售口罩。请查看我们的购买页面或联系星火研发部门了解更多信息。\n在PLA中打印时，这种蒙版的制作成本约为每个蒙版材料1美元。其他灯丝有不同的价格结构，但我们想强调的是，这些文件拥有临时专利，仅供开源使用。如果您选择出售面膜来支付材料成本，我们建议每个面膜的价格上限为2美元。如果您选择从事注塑生产，请注意，这些注塑CAD文件上的专利是为了确保生产是有限的非营利性企业，这些企业以成本运营来服务于当地社区。营利性企业将不会获得任何许可。\n您可以使用温水或吹风机来定制适合穿着者的衣服。有关说明，请参阅此视频\n可以，使用打印机上的缩放功能调整X、Y和Z尺寸。\n在我们的测试中，口罩没有导致二氧化碳水平上升。这项测试是在一名没有肺部并发症的健康人身上进行的。如果你有呼吸问题，这个口罩或任何口罩都不推荐使用。\n任何有足够大的构建平台的3D打印机都应该能够创建蒙版。大多数打印机都兼容，但请下载文件进行验证。\n根据您的打印机、设置和所选材料的不同，这会有很大差异。在PLA中以以下设置打印时，可能需要大约3个小时才能打印。其他打印机和材料可能需要2-9个小时才能完成。\n当涉及到设置时，每台打印机都是不同的。请下载文件并允许您的打印机调整为最佳设置，或仅使用您的传统设置。对于我们的打印过程，我们使用了：\n我们一直在PLA使用和测试。使用基本液体树脂的ABS、尼龙和SLA打印机也可以正常工作，但所有口罩在使用前都需要经过检查和适配测试。不适当的适配会降低过滤效率。一些打印机发现TPU提供了灵活、舒适的适配，我们正在努力提供有关效率的测试结果。\n我们发现，我们每个面罩可以使用大约30-33米的灯丝，每1公斤线轴产生20-22个面罩。\n我们还没有试过弹性树脂。如果您尝试过，请记录您的发现并通过电子邮件发送给我们！最新消息：我们尝试过传统树脂的支持者发现，它不是制作这种面膜的有效材料。感谢您的反馈！\n我们鼓励本土创新。欢迎您在现有工具的基础上使用这些文件进行构建和利用。请注意：针对蒙大拿州口罩进行的所有研究和测试都特别遵循这些确切的设计文件。任何修改都将使相关研究无效，并需要进行完整的测试。\n我已经做了一个蒙大拿州面具通过遵循您的网站上的设计。这次又是什么？\n1.干得好！感谢您将您的时间和精力投入到这项工作中。2.上传一张你和你面具的照片，并在我们的Instagram账户上贴上@makehemasks的标签。\n3.按照上面的说明让当地医院批准使用口罩。\n我们推荐使用从医用口罩上剪下来的2.5英寸正方形。一个N95外科口罩将产生六个带手术保护的过滤器，并将产生更大的过滤，具体取决于合适的程度。其他有创意的过滤材料还没有经过我们的测试，但在极端情况下可以考虑。\n我们建议使用当地供应的N95口罩、医用口罩或其他N95等级的滤清器材料，但如果没有，请与当地的滤清器供应公司联系，寻找替代产品。我们目前不建议制造任何过滤器，也不能获得N95材料进行分销。\n我可以与您联系提出我的改进想法或协助您进行新的更新和设计吗？\n我们鼓励每个人制作自己的面具，并在他们的社区内讨论创新。我们现在不会主办一个论坛来讨论设计建议和创新。在我们继续测试和修改我们的设计时，请回此网站查看有关文件的更新。每个面膜都必须经过测试，并且适合个别供应商，所以当您自行改进时，请记住所有测试仅适用于我们网站上发布的准确设计。\n收到任何来源的口罩后，所有部件都必须按照政府指南进行消毒--https://www.ncbi.nlm.nih.gov/books/NBK214361/。\n执行必要的配合测试和其他检查，以确保特定供应商的个人贴合性和密封性。\n请注意：正确的消毒顺序是正确使用任何面膜的绝对关键。请明确遵循此教学视频：\n你的医院应该审查并采用一个可靠的使用程序，并确保他们建议为这种口罩推荐适当的穿戴和脱下规程。\n不按照您的雇主个人医院批准的穿衣和落纱指南操作可能会导致交叉污染。\n与当地的诊所/医院/疗养院等联系，看看他们是否出现短缺。如果他们感兴趣，与设施内的人联系，并在递送口罩时通过他们进行工作。\n打印出递送包裹pdf(Link即将推出)，并在递送口罩时随身携带。这些信息将向管理人员解释在面具上执行的所有严格测试如何最好地利用它。\n在发放口罩之前，让正式的医院代表在责任转移表上签字。", "note_en": "No, our masks are not approved by the FDA or NIOSH or any other state or federal regulatory body, but  we’ve tested them rigorously to make sure they serve medical professionals that are serving us!\n The CDC has recently approved “homemade masks” for crisis management and shortages of approved materials.\n   N95 masks are still the recommended personal protection equipment (PPE). The Montana Mask is a tool to help you  extend your existing supply of N95 masks by six. In situations where N95 masks are in short supply or not available, we recommend that each hospital or individual using these masks run a  complete fit test with the support of hospital administrators. The filtration efficiency of the mask will vary with the material inserted into the filter casing.\n This is not an FDA or NIOSH approved N95 product and should be tested and fit to your local hospital standard.\n   Although we have performed the  tests required per OSHA standards for this equipment, this is not an FDA or NIOSH approved product. All our research findings indicate that this mask passes or exceeds standard test requirements for filtration.  Please see our research.\n  Make The Masks does not manufacture masks. This is a grassroots effort to help communities fill their own needs. We encourage the 3D printing files to be used by schools, universities, dentists, public libraries, and hobbyists to meet the needs of their communities. If you can coordinate with local manufacturers, the design files can also be used in that capacity. There are local manufacturers in Montana that are willing to sell masks at cost. Please see our  PURCHASE page or  contact Spark R&amp;D for more information.\n  When printing in PLA, this mask can be created for around $1 per mask for materials. Other filaments have a different price structure, but we would like to stress the fact that these files have provisional patents and are for  open source use only. If you choose to sell the mask to cover the cost of your materials, we recommend a price cap of $2 per mask. If you chose to pursue injection molding production, please note that the patents on these molding CAD files are to ensure that production is limited not-for-profit ventures that operate at cost to serve their local community. No licensing will be awarded to for-profit ventures.\n    You may use warm water or a hair dryer to customize fit to the wearer. Please see this video for instructions\n  Yes, use the scaling feature on your printer to adjust the X, Y, and Z dimensions.\n   During our  test , the mask did not cause CO2 levels to rise.  This test was conducted on a healthy individual with no existing pulmonary complications. If you have respiratory issues, this mask, or any mask, may not be recommended for use.\n   Any 3D printer that has a big enough build platform should be able to create the mask. Most printers are compatible, but please download the files to verify.\n   This varies greatly depending on your printer, settings, and chosen material. When printing in PLA at the settings below, it can take around 3 hours to print. Other printers and materials can vary from 2-9 hours to complete.\n   When it comes to settings, every printer is different. Please download the files and allow your printer to adjust to the optimal settings, or just use your traditional settings. For our printing process, we have used:\n    We have been using and testing in PLA.  ABS, Nylon, and SLA printers using a basic liquid resin would also function well, but all masks need to undergo inspection and fit testing prior to use. Improper fit reduces filtration efficiency. Some printers have found that TPU provides a flexible, comfortable fit, and we are working to provide test results as to the efficiency.\n   We have found that we can use about 30-33 meters of filament per mask, which yields 20-22 masks per 1 Kg spool.\n   We have not yet tried flexible resin. If you try it, please document your findings and  email us!  UPDATE: Our supporters that have tried traditional resin found that it was NOT an effective material for this mask. Thanks for your feedback!\n   We encourage local innovation. You are welcome to use these files to build off of and utilize the tools you have on hand. PLEASE NOTE: all research and tests conducted for the Montana masks follow these exact design files specifically. Any modifications will void the associated research and require a complete workup of testing.\n  I have made a Montana Mask by following the design on your site. Now what?\n 1. GREAT WORK! Thank you for adding your time and energy to this effort. 2. Post a pictures of you and your mask and tag our Instagram account @makethemasks\n 3. Follow the instructions above to get your local hospital to approve use of the mask.\n    We recommend using 2.5” squares cut from surgical masks.  One n95 surgical mask will yield six filters with surgical protection and will yield a greater filtration depending on the fit. Other creative filter materials have not been tested by us, but could be considered in extreme circumstances.\n  We recommend using local supply of N95 masks, surgical masks or other N95 rated material for filters, but if they are not available, please check with local filter supply companies to seek out alternatives. We don’t currently recommend manufacturing any filters and do not have access to N95 material for distribution.\n  Can I contact you with my ideas for improvements or assist with new updates and design?\n We encourage everyone to make their own masks and discuss innovation within their community. We are not hosting a forum for discussion on design suggestions and innovations at this time. Check back to this site for updates on files as we continue to test and modify our designs. Each mask must be tested and fit to an individual provider, so as you make improvements on your own, please remember that all the tests only apply to the exact design posted on our site.\n    After receiving masks from any source, all pieces must be disinfected per government guidelines -  https://www.ncbi.nlm.nih.gov/books/NBK214361/\n  Perform necessary fit testing and other inspections to ensure personal fit and seal to a specific provider.\n PLEASE NOTE: Proper sanitizing sequences are absolutely critical to proper usage of any mask. Please explicitly follow this instructional video:\n  Your hospital should review and adopt a robust procedure for use and ensure they are recommending a proper donning and doffing protocol for this mask.\n Not following your individual employer hospital-approved guidelines for donning and doffing could result in cross-contamination.\n   Approach your local clinics/hospitals/nursing homes, etc  to see if they are experiencing a shortage. If they are interested, make a contact with someone within the facility and work through them when delivering your mask.\n Print out the DELIVERY PACKET pdf (Link coming soon) and bring it with you when delivering the masks. This information will explain to the administration all of the rigorous testing performed on the mask how they can best utilize it.\n Have an official hospital representative sign the Transfer of Liability form before releasing the masks.", "posttime": "2020-05-10 09:17:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "打印,设计,发布,n95,口罩", "title": "3D打印N95蒙大拿州面具设计在GPLv3下发布", "title_en": "3D Printed N95 Montana Mask Design Released Under GPLv3", "transed": 1, "url": "https://www.makethemasks.com/faq", "via": "", "real_tags": ["打印", "设计", "发布", "n95", "口罩"]}]