[{"category": "", "categoryclass": "", "imagename": "ef405e250dfb7e5632c17290e13aa85d.png", "infoid": 1006183, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "xrdp使用MicrosoftRemote Desktop Protocol(RDP)提供远程计算机的图形登录。xrdp接受来自各种RDP客户端的连接：FreeRDP、rktop、NeutrinoRDP和Microsoft Remote DesktopClient(适用于Windows、Mac OS、iOS和Android)。\n大多数Linux发行版应该在其存储库中分发最新版本的xrdp。您需要xrdp和xorgxrdp包才能获得最佳体验。建议xrdp依赖于xorgxrdp，因此安装xrdp应该足够了。如果未提供xorgxrdp，请使用Xvncserver。\nxrdp在3389/TCP上侦听。确保您的防火墙接受从您想要访问的位置到3389/TCP的连接。\nYUM将被DNF替换，因此您可能需要在上面的命令中使用DNF代替YUM。\nFreeBSD不是xrdp的主要目标。它在FreeBSD上工作，但驱动器重定向功能除外。\n到目前为止还不支持MacOS等其他操作系统，但我们欢迎您的贡献。\n要从打包的源代码编译xrdp，您需要基本的构建工具-编译器(GCC或clang)和make程序。此外，您还需要openssl-devel、pam-devel、libX11-devel、libXfix-devel、libXrandr-devel。根据您的配置，将需要更多额外的软件。\n要从签出的git存储库编译xrdp，您还需要autoconf、auto ake、libtool和pkgconfig。\n如果从签出的存储库中编译，请确保您也已经复制子模块(使用GIT CLONE--递归https://github.com/neutrinolabs/xrdp)。\n如果您想使用音频重定向，您需要构建并安装附加的PulseAudio模块。构建说明可以在wiki上找到。\nxrdp├──Common···Common Code├──Docs···Documentation├──Fontdump···Windows├──的字体转储···Keymap Generator├──instfiles···可安装数据文件├──KEYGEN···xrdp RSA密钥对生成器├──libPainter··画图库├──库fxcodec·RFX编解码库├──libxrdp···核心RDP协议实现├──M4。mc···rdp客户端模块，用于使用├──├──pkgconfig代理rdp连接···pkg-config Configuration├──sesman···xrdp├──tcutils的会话管理器···基于qt的瘦客户端├──测试实用程序···代码├──vnc的测试···xrdp的vnc客户端模块···用于xrdp的vnc客户端模块。频道├──xrdp···主服务器代码├──xrdpi···虚拟频道├──xrdpvr···通过rdp└──xup播放媒体的接口···X11rdp和xorgxrdp客户端模块", "note_en": "xrdp provides a graphical login to remote machines using MicrosoftRemote Desktop Protocol (RDP). xrdp accepts connections from a variety ofRDP clients: FreeRDP, rdesktop, NeutrinoRDP and Microsoft Remote DesktopClient (for Windows, Mac OS, iOS and Android).\n         Most Linux distributions should distribute the latest release of xrdp in theirrepository. You would need xrdp and xorgxrdp packages for the bestexperience. It is recommended that xrdp depends on xorgxrdp, so it shouldbe sufficient to install xrdp. If xorgxrdp is not provided, use Xvncserver.\n xrdp listens on 3389/tcp. Make sure your firewall accepts connection to3389/tcp from where you want to access.\n        yum is being replaced with  dnf, so you may need to use  dnf insteadof  yum in the above commands.\n    FreeBSD is not a primary target of xrdp. It is working on FreeBSD exceptfor the drive redirection feature.\n Other operating systems such as macOS are not supported so far, but wewelcome your contributions.\n    To compile xrdp from the packaged sources, you need basic build tools - acompiler ( gcc or  clang) and the  make program. Additionally,you would need  openssl-devel,  pam-devel,  libX11-devel, libXfixes-devel,  libXrandr-devel. More additional software wouldbe needed depending on your configuration.\n To compile xrdp from a checked out git repository, you would additionallyneed  autoconf,  automake,  libtool and  pkgconfig.\n   If compiling from a checked out repository, please make sure you&#39;ve got the submodulescloned too (use  git clone --recursive https://github.com/neutrinolabs/xrdp)\n   If you want to use audio redirection, you need to build and install additionalpulseaudio modules. The build instructions can be found at wiki.\n   xrdp├── common ······ common code├── docs ········ documentation├── fontdump ···· font dump for Windows├── genkeymap ··· keymap generator├── instfiles ··· installable data file├── keygen ······ xrdp RSA key pair generator├── libpainter ·· painter library├── librfxcodec · RFX codec library├── libxrdp ····· core RDP protocol implementation├── m4 ·········· Autoconf macros├── mc ·········· media center module├── neutrinordp · RDP client module for proxying RDP connections using NeutrinoRDP├── pkgconfig ··· pkg-config configuration├── sesman ······ session manager for xrdp├── tcutils ····· QT based utility program for thin clients├── tests ······· tests for the code├── vnc ········· VNC client module for xrdp├── vrplayer ···· QT player redirecting video/audio to clients over xrdpvr channel├── xrdp ········ main server code├── xrdpapi ····· virtual channel API├── xrdpvr ······ API for playing media over RDP└── xup ········· X11rdp and xorgxrdp client module", "posttime": "2020-06-12 03:14:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,rdp,open,xrdp", "title": "Xrdp：一个开源的RDP服务器", "title_en": "Xrdp: An open source RDP server", "transed": 1, "url": "https://github.com/neutrinolabs/xrdp", "via": "", "real_tags": ["开源", "rdp", "open", "xrdp"]}, {"category": "", "categoryclass": "", "imagename": "a3ccf0dbc00c4a7424df0b4b4973d851.jpeg", "infoid": 1006182, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "前首席执行官Facebook Inc.。副手克里斯·考克斯(Chris Cox)即将重返这家社交媒体巨头。一年多前，他因与首席执行官马克·扎克伯格(Mark Zuckerberg)在公司发展方向上存在分歧而离职。\n考克斯是Facebook最早的工程师之一，他宣布计划重返公司担任产品主管，他于2019年3月辞去了这一职位。这一角色的核心是执行扎克伯格对Facebook平台的愿景，众所周知，考克斯不同意这位首席执行官朝着统一公司产品的方向发展的计划……", "note_en": "Former top Facebook Inc. deputy Chris Cox is returning to the social-media giant, just over a year after leaving amid disagreements with CEO Mark Zuckerberg over the company’s direction.\n  Mr. Cox, who was one of Facebook’s earliest engineers, announced his plans to return as the company’s head of product, the job he resigned in March 2019. The core of the role is executing Mr. Zuckerberg’s vision for Facebook’s platforms, and Mr. Cox was known to have disagreed with the CEO’s plans to move toward unifying the company’s products...", "posttime": "2020-06-12 03:14:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,cox", "title": "扎克伯格副手克里斯·考克斯(Chris Cox)将重返Facebook", "title_en": "Chris Cox, Zuckerberg lieutenant, to return to Facebook", "transed": 1, "url": "https://www.wsj.com/articles/zuckerberg-lieutenant-returns-to-facebook-a-year-after-departure-11591899761", "via": "", "real_tags": ["facebook", "cox"]}, {"category": "", "categoryclass": "", "imagename": "7cc0bbe438a24c9bae5f840e151d0f04.jpg", "infoid": 1006181, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "徒步穿过美国西部的国家公园-约书亚树、大峡谷、布莱斯峡谷-深深呼吸原始的空气。这些都是未被破坏的土地，总而言之，这是一个伟大的美国保护故事。然而，一种看不见的威胁实际上正在吹过空气，通过雨滴落下：微塑料颗粒，小块(定义为不到5毫米长)破碎的塑料瓶，以及从衣服上磨损的微纤维，所有这些污染物都会被地球的大气系统卷起来，沉淀在荒野中。\n研究人员今天在“科学”杂志上发表了一篇文章，报告了一个惊人的发现：在收集了14个月的雨水和空气样本后，他们计算出，每年有超过1000吨的微塑料颗粒落入美国西部的11个保护区。这相当于超过1.2亿个塑料水瓶。犹他州州立大学(Utah State University)环境科学家、主要作者贾尼斯·布拉尼(Janice Brahney)说：“我们只是为西部的保护区做了这件事，这只占美国总面积的6%。”“这个数字实在太大了，令人震惊。”\n这进一步证实了一种越来越可怕的情景：微塑料正吹向世界各地，降落在理应是纯净的栖息地，比如北极和遥远的法国比利牛斯山。它们通过废水流入海洋，污染深海生态系统，甚至被海风喷出水面，吹到陆地上。现在在美国西部，考虑到这些是基本的大气过程，大概在世界其他地方，它们正在以塑料雨的形式下降-新的酸雨。\n塑料雨可能被证明是一个比酸雨更隐蔽的问题，酸雨是二氧化硫和氮氧化物排放的结果。通过在发电厂部署洗涤器来控制前者，在汽车上部署催化转化器来控制后者，美国和其他国家在过去的几十年里减少了酸化问题。但是，即使是最偏远的环境，微型塑料也已经破坏了，而且没有办法擦洗水、陆地或空气中的颗粒-这种东西绝对无处不在，而且我们不可能在海洋中拖着一块塑料磁铁。塑料之所以如此有用-它的坚硬-也是它成为一种令人担忧的污染物的原因：塑料从未真正消失，而是破碎成越来越小的碎片，渗透到地球上越来越小的角落。更糟糕的是，根据咨询公司麦肯锡(McKinsey)的数据，到2030年，塑料垃圾预计将从每年2.6亿吨飙升至4.6亿吨。在经济发展中的国家，更多的人加入中产阶级意味着更多的消费主义和更多的塑料包装。\n为了量化整个美国西部的问题已经变得多么严重，研究人员使用了11个国家公园和保护区的收集器，对雨水和空气进行采样。每个人都有一个“湿”桶来收集雨水，一个“干”桶来收集空气。传感器会探测到降雨量，打开“湿”桶，同时关闭干桶。当外面阳光明媚时反之亦然，所以干燥的水桶会收集风中携带的微塑料颗粒，而潮湿的水桶则保持关闭状态。研究人员还对他们收集的每一场特定风暴的发源地进行了建模，在将水和微塑料倾倒到湿桶之前，观察了它经过的城市的大小。\n总体而言，他们发现，在一年多的时间里收集的样本中，令人震惊的98%含有微塑料颗粒。平均而言，捕获的大气颗粒物中有4%实际上是合成聚合物。在雨中落下的颗粒比风中沉积的颗粒更大，较轻的颗粒更容易被气流卷住。超细纤维来自聚酯服装等来源，在湿样品中占合成材料的66%，在干样品中占70%。布拉尼说：“几乎在每个样品中都能看到鲜艳的塑料碎片，这让我大吃一惊。”此外，研究小组不能用他们的设备计算透明或白色颗粒和纤维，所以他们的计数可能是保守的。\n通过观察沉积湿微塑料样品的风暴路径，布拉尼和她的同事们能够绘制出天气系统如何运输颗粒的地图。例如，风可能会将城市地区的微塑料颗粒踢离地面，在迫使它们再次浮出地面之前，将它们带到顺风方向。布拉尼说：“雨水能非常有效地清除空气中所有的东西。”“因此，大气中可能会有相当数量的灰尘和塑料，一场暴雨将把它们冲走。”微塑料颗粒甚至可以充当凝聚核，即吸引水蒸气形成云的碎片。\n另一方面，干燥的尘埃似乎正在传播更长的距离。这些粒子\n布拉尼说：“我们看到了与急流位置的关系，这意味着控制沉积的气团在大气层中确实很高。”(在美国，快速流动的喷流从西向东横跨整个大陆。)。这与其他科学家开始在世界其他地方看到的情况不谋而合：微小的塑料碎片-主要是衣服上的合成纤维-正被风卷住，散布得很远很广，污染了以前纯净的栖息地。例如，欧洲的城市似乎在北极播种微型塑料。\n这项新研究还带来了另一个令人不安的惊喜：30%的样本颗粒是微珠，这是一种微小的合成球体，美国在2015年禁止在美容产品中使用这种微球。然而，样品中的微珠通常比你在这些产品中找到的要小。布拉尼说：“我们确实看到了很多颜色鲜艳的微珠，各种颜色的彩虹，还有一些我们鉴定为丙烯酸的微珠。”\n这使得研究人员推测，这些微珠来自工业涂料和涂料。如果喷洒这些微珠，他们可以很容易地将微珠喷到大气中，在那里它们会被风卷起并带到很远的地方。如果真是这样的话，油漆行业可能会面临污染美容行业的同样的微珠清算。尽管如此，如果一个国家禁止涂料中的微珠，这种东西很可能会从邻国吹进来。\n更令人不安的是，微塑料最终会分解成纳米塑料，小到研究人员在没有合适的设备的情况下可能无法检测到它们。“我看不到任何小于4微米的东西，但这并不意味着它不在那里，”布拉尼说。“仅仅因为我们看不到他们出现在我们面前，并不意味着我们没有吸入他们。”\n科学家们还不知道吸入微珠可能对人类健康意味着什么，但我们有理由认为它是无益的。随着时间的推移，塑料碎片往往会渗出其成分化学物质，并已被认为可以运输病毒和细菌等微生物。研究人员刚刚开始探索这对其他生物意味着什么：今年早些时候发表的一项研究发现，暴露在微塑料下的寄居蟹在生长过程中很难选择新的贝壳，这是一个特别的问题，因为它们需要这些贝壳才能生存。\n在美国国家公园的土壤中，塑料的到来可能会产生连锁效应。斯特拉斯克莱德大学(University Of Strathclyde)的微整形研究员史蒂夫·艾伦(Steve Allen)没有参与这项新研究，他说：“它们不能只阻塞小动物的消化道，比如蠕虫。”“但也正是这些塑料和塑料中的化学物质会对土壤产生影响。其中很多还只是理论上的--我们仍在努力解决这个问题。“。\n布拉尼和她的同事们注意到，微塑料可能正在改变土壤的热性质，例如，改变它吸收和储存热量的方式。它们还可能导致通常生活在那里的微生物或多或少地生长，重新安排群落，改变泥土循环营养的方式。微塑料也可能改变水通过这些土壤的方式。\n但撇开这些剩余的未知因素不谈，这项研究为微塑性生命周期提供了一个关键的谜团，它随着每一项新的研究而变得越来越复杂。科学家们一直在试图弄清楚世界上的塑料污染会发生什么，几乎所有的塑料污染似乎都在环境中“消失”。但像这样的研究表明，这些东西永远不会真正消失，它只是被粉碎成更小的碎片，分散在世界各地，可能要花很多年的时间在不同的系统中循环-空中、陆地和海洋。\n例如，科学家们已经发现，洋流正在将微塑性颗粒带入深海生态系统-当洋流变慢时，悬浮颗粒会脱落并沉降在海底。“深海洋流的行为基本上与大气洋流是一样的，”曼彻斯特大学地球科学家伊恩·凯恩(Ian Kane)说，他是这项研究的主要作者，但没有参与这项新工作。“它们是全球再循环模式的一部分，颗粒根据形状和密度进行运输。所以这也是同样的过程。这些作者发现，在潮湿的条件下，较重的颗粒往往会脱落。“。\n史蒂夫·艾伦(Steve Allen)和他的配偶迪尼·艾伦(Deonie Allen)也是斯特拉斯克莱德大学(University Of Strathclyde)的微塑料研究员，他们上个月发表的另一项研究发现，海洋正在打鼓微塑料颗粒，然后这些颗粒随着海风漂浮在岸上。以前，人们认为，当微塑料通过废水流入大海时，它们会留在那里。因此，落在土壤上的微塑料也可能不会停留在原地。“这可能不是静态的，”迪尼·艾伦(Deonie Allen)说。“它不会坐视不管。有些会通过我们的地下水位，有些会因为侵蚀而移动，或者重新释放到大气中。“。\n关于这个微塑料循环，科学还有很多需要了解的地方，但有一点是明确的：不会再把塑料放回瓶子里。\n👁大脑是人工智能的有用模型吗？另外：获取最新的人工智能新闻。\n🏃🏽‍♀️想要最好的健康工具吗？看看我们Gear团队挑选的最好的健身跟踪器、跑步装备(包括鞋子和袜子)和最好的耳机", "note_en": "Hoof it through the national parks of the western United States—Joshua Tree, the Grand Canyon, Bryce Canyon—and breathe deep the pristine air. These are unspoiled lands, collectively a great American conservation story. Yet an invisible menace is actually blowing through the air and falling via raindrops: Microplastic particles, tiny chunks (by  definition, less than 5 millimeters long) of fragmented plastic bottles and microfibers that fray from clothes, all pollutants that get caught up in Earth’s atmospheric systems and deposited in the wilderness.\n Writing today in the journal  Science, researchers report a startling discovery: After collecting rainwater and air samples for 14 months, they calculated that over 1,000 metric tons of microplastic particles fall into 11 protected areas in the western US each year. That’s the equivalent of over 120 million plastic water bottles. “We just did that for the area of protected areas in the West, which is only 6 percent of the total US area,” says lead author Janice Brahney, an environmental scientist at Utah State University. “The number was just so large, it&#39;s shocking.”\n It further confirms an increasingly hellish scenario: Microplastics are blowing all over the world, landing in supposedly pure habitats, like  the Arctic and the  remote French Pyrenees. They’re flowing into the oceans via wastewater and tainting  deep-sea ecosystems, and they’re even ejecting  out of the water and  blowing onto land in sea breezes. And now in the American West, and presumably across the rest of the world given that these are fundamental atmospheric processes, they are falling in the form of  plastic rain—the new acid rain.\n  Plastic rain could prove to be a more insidious problem than acid rain, which is a consequence of sulfur dioxide and nitrogen oxide emissions. By deploying scrubbers in power plants to control the former, and catalytic converters in cars to control the latter, the US and other countries have over the last several decades  cut down on the acidification problem. But microplastic has already corrupted even the most remote environments, and there’s no way to scrub water or land or air of the particles—the stuff is absolutely everywhere, and it’s not like there’s a plastic magnet we can drag through the oceans. What makes plastic so useful—its hardiness—is what also makes it an alarming pollutant: Plastic never really goes away, instead breaking into ever smaller bits that infiltrate ever smaller corners of the planet. Even worse, plastic waste is expected to skyrocket from 260 million tons a year to 460 million tons by 2030,  according to the consultancy McKinsey. More people joining the middle class in economically-developing countries means more consumerism and more plastic packaging.\n  To quantify just how bad the problem has become across the American West, the researchers used collectors in 11 national parks and protected areas, sampling both rain and air. Each had a “wet” bucket to collect rainwater, and a “dry” bucket to collect air. A sensor would detect rainfall and open up the “wet” bucket while closing the dry one. And vice versa when it’s sunny out, so the dry bucket would collect microplastic particles carried on the wind while the wet bucket stayed shut. The researchers also modeled where each particular storm they collected rain from had originated, looking at the size of the cities it traveled through before dumping water, and microplastics, into the wet bucket.\n  Overall, they found that a stunning 98 percent of samples collected over a year contained microplastic particles. On average, 4 percent of captured atmospheric particulates were actually synthetic polymers. The particles that fell in rain were larger than those deposited by wind—lighter particles are more easily caught up in air currents. Microfibers, from sources like polyester clothing, made up 66 percent of the synthetic material in wet samples and 70 percent in dry samples. “I was just completely floored to see little brightly-colored pieces of plastic in nearly every single sample,” says Brahney. Plus, the team wasn&#39;t able to count clear or white particles and fibers with their equipment, so their tally is likely conservative.\n Looking at the path of the storms that deposited the wet microplastic samples, Brahney and her colleagues were able to map how weather systems transport the particles. Winds, for instance, might kick up microplastic particles off the ground in an urban area and carry them downwind before forcing them to the surface once more. “Rain is very effective at scrubbing the atmosphere of everything that&#39;s in it,” says Brahney. “And so there could be a fair amount of dust and plastics in the atmosphere and a rainstorm will wash those out.” Microplastic particles could even be acting as condensation nuclei, bits of debris that attract water vapor to form a cloud.\n The dry fallout, on the other hand, appears to be traveling longer distances. These particles’ smaller size indicates they’re more easily carried on winds for hundreds, maybe thousands of miles—consider that dust from the Sahara readily blows across the Atlantic and falls in the Amazon rainforest—instead of getting caught up in storms, a more regional phenomenon. And microplastics are probably traveling even farther than soil particles because they&#39;re far less dense.\n “We saw relationships to the location of the jet stream, which implies that the air masses that are controlling deposition are really high in the atmosphere,” says Brahney. (In the US,  the fast-moving jet stream runs from west to east across the continent.) This jibes with what other scientists are starting to see elsewhere around the world: Tiny pieces of plastic—largely synthetic fibers from clothes—are getting caught in the wind and spread far and wide, tainting formerly pristine habitats. For example, the cities of Europe  seem to be seeding the Arctic with microplastic.\n This new research comes with another troubling surprise: 30 percent of the sample particles were microbeads, tiny synthetic spheres that the United States  banned from beauty products in 2015. The microbeads in the samples, though, were generally smaller than the ones you’d find in those products. “We did see a lot of brightly-colored microbeads, in all colors of the rainbow, and some of those we identified as acrylic,” says Brahney.\n That leads the researchers to speculate that the microbeads are coming from industrial paints and coatings. If these are sprayed, they could easily spew the microbeads into the atmosphere, where they’d be picked up by winds and carried afar. If that’s indeed the case, the paint industry may be in for the same kind of microbead reckoning that sullied the beauty industry. Still, if one country bans microbeads in paints, the stuff could well blow in from a neighboring country.\n  More troubling still, microplastics eventually break into  nanoplastics, bits so small that researchers may not be able to detect them without the right equipment. “I couldn&#39;t see anything smaller than four microns, but that doesn&#39;t mean it wasn&#39;t there,” says Brahney. “Just because we can&#39;t see them in front of us, doesn&#39;t mean we&#39;re not breathing them in.”\n Scientists don&#39;t yet know what inhaling microbeads might mean for human health, but it’s reasonable to assume it’s not beneficial. Bits of plastic tend to leach their component chemicals over time, and have been known to transport microbes like viruses and bacteria. Researchers are just beginning to explore what this means for other organisms: One study published earlier this year found that hermit crabs exposed to microplastics  have difficulties choosing new shells as they grow, a particular problem since they need those shells to survive.\n  In the soils of America’s national parks, the arrival of plastics could have cascading effects. “These can not just block up the digestive tract of small animals, like worms,” says University of Strathclyde microplastic researcher Steve Allen, who wasn’t involved in the new study. “But it&#39;s also the chemicals that are  on these plastics and  in these plastics that can have an effect on the soil. A lot of that is still theoretical—we&#39;re still trying to work it out.”\n Brahney and her colleagues note that microplastics may be changing the thermal properties of soil, for instance, altering how it absorbs and stores heat. They may also lead to the growth of more or less of the microbes that normally live there, rearranging communities and altering the way the dirt cycles nutrients. Microplastics may also change how water moves through these soils.\n But setting these many remaining unknowns aside, this research puts in place a critical piece of the puzzle regarding the microplastic life cycle, which grows increasingly complex with each new study. Scientists have been trying to figure out what happens to the world’s plastic pollution, nearly all of which seems to “disappear” in the environment. But studies like this one are showing that the stuff never truly goes away, it just gets shredded into smaller bits that disperse all over the world, perhaps spending many years cycling through different systems—air, land, and sea.\n Scientists have discovered, for instance, that currents are carrying microplastic particles into deep-sea ecosystems—when the currents slow, the suspended particles fall out and settle on the seafloor. “Deep sea currents basically behave in the same way as atmospheric currents do,” says University of Manchester earth scientist Ian Kane, who was lead author  on that study, but wasn’t involved in this new work. “They&#39;re part of a global recirculation pattern, and the particles are transported according to the shape and the density. And so it&#39;s the same process. What these authors found is that the heavier particles tended to fall out in the wet conditions.”\n  Other research published last month by Steve Allen and his spouse Deonie Allen, also a microplastic researcher University of Strathclyde, found that the oceans are burping up microplastic particles, which then float onshore on sea breezes. Previously, it was believed that when microplastics flowed into the sea via wastewater, they’d stay there. So it may also turn out that microplastics landing on soil are also not staying put. “It may not be static,” says Deonie Allen. “It&#39;s not going to just sit. Some of it ends up going down through our water table, some of it moves because of erosion, or gets rereleased back into the atmosphere.”\n There’s still much that science has to learn about this microplastic cycle, but this much is clear: There’ll be no putting the plastic back in the bottle.\n   👁 Is the brain a  useful model for AI? Plus:  Get the latest AI news\n 🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2020-06-12 03:14:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "塑料,rain", "title": "塑料雨是新的酸雨", "title_en": "Plastic Rain Is the New Acid Rain", "transed": 1, "url": "https://www.wired.com/story/plastic-rain-is-the-new-acid-rain/", "via": "", "real_tags": ["塑料", "rain"]}, {"category": "", "categoryclass": "", "imagename": "60479f280f4e30f392f772f18206e7f1.png", "infoid": 1006180, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转在数学中搜索，康托函数是一个连续的函数，但不是绝对连续的。这在分析中是一个臭名昭著的反例，因为它挑战了关于连续性、导数和测度的天真直觉。虽然它处处是连续的，几乎处处都有零导数，但当它的自变量从0到1时，它的值仍然从0到1。因此，从某种意义上说，该函数看起来非常像一个常数，不能增长，而在另一种意义上，它确实是通过构造单调增长的。\n它也被称为康托三元函数，勒贝格函数，[1]勒贝格奇异函数，康托-维塔利函数，魔鬼楼梯，[2]康托楼梯函数，[3]和康托-勒贝格函数。[4]Georg Cantor(1884)引入了Cantor函数，并提到Scheeffer指出它是Harnack所声称的微积分基本定理的推广的反例。康托函数由Scheeffer(1884)、Lebesgue(1904)和Vitali(1905年)讨论和推广。\n参见图。要正式定义康托函数c：[0，1]→[0，1]，设x在[0，1]中，通过以下步骤获得c(X)：\n如果x包含1，则将第一个1后面的每个数字严格替换为0。\n1/4是0.02020202.。在基数3。没有1所以下一阶段仍然是0.02020202…。这里改写为0.01010101..。当以基数2读取时，这对应于1/3，因此c(1/4)=1/3。\n1/5是0.01210121.。以3为基数。第一个1后面的数字被0替换成0.01000000…。因为没有2，所以不会重写。当以基数2读取时，这对应于1/4，因此c(1/5)=1/4。\n二百/二百四十三等于0.21102(或0.211012222.)。以3为基数。第一个1之后的数字被0替换为0.21。这被重写为0.11。当以基数2读取时，这对应于3/4，因此c(200/243)=3/4。\n等价地，如果C{\\DisplayStyle{\\Mathcal{C}}是[0，1]上的康托集，则康托函数c：[0，1]→[0，1]可以定义为\nC(X)={∑n=1∞a n 2 n，x=∑n=1∞2 a n 3 n∈C f o r in a n∈{0，1}；sup y≤x，y∈C c(Y)，x∈[0，1]∖C.。{\\displaystyle c(X)={\\start{case}\\sum_{n=1}^{\\infty}{\\frac{a_{n}}{2^{n}}，&amp；x=\\sum_{n=1}^{\\infty}{\\frac{2a_{n}}{3^{n}\\in{\\mathcal{C}}\\\\maththm{for}\\a_{n}\\。\\sup_{y\\leq x，\\，y\\in{\\mathcal{C}c(Y)，&amp；x\\in[0，1]\\setminus{\\mathcal{C}}。\\end{case}。\n这个公式是明确定义的，因为Cantor集合的每个成员都有一个唯一的基数为3的表示法，该表示法只包含数字0或2。(对于C{\\DisplayStyle{\\mathcal{C}的某些成员，三元展开与尾随的2&#39；s重复，并且存在以1结尾的替代非重复展开。例如，1/3=0.13=0.02222.。3是康托集合的成员)。由于c(0)=0和c(1)=1，并且c在C{\\displaystyle{\\mathcal{C}上是单调的，显然，0≤c(X)≤1对[0，1]中的所有x∈[0，1]∖C{\\displaystyle x\\在[0，1]\\set减{\\mathcal{C}也成立。\nCantor函数挑战了关于连续性和测度的天真直觉；尽管它处处连续，几乎处处导数为零，但c(X){\\textstyle c(X)}随着x{\\textstyle x}从0到1而从0到1，并取其间的每个值。康托函数是实函数一致连续(确切地说，它是指数为α_2/log_3的Hölder连续)但不是绝对连续的最常被引用的例子。它在形式(0。x 1 x 2 x 3.。X N022222.，0.。x 1 x 2 x 3.。xn200000…)，并且每个不在康托集合中的点都在这些区间中，所以它的导数在康托集合之外是0。另一方面，它在包含上述区间端点的康托集的不可数子集中的任何点都没有导数。\n康托函数也可以看作康托集上支持的1/2-1/2伯努利测度μ的累积概率分布函数：C(X)=μ([0，x]){\\TextStyle c(X)=\\Mu([0，x])}。这种概率分布称为康托分布，没有离散部分。也就是说，相应的度量是无原子的。这就是函数中没有跳跃不连续的原因；任何这样的跳跃都将对应于度量中的一个原子。\n然而，康托函数的任何非常数部分都不能表示为概率密度函数的积分；在任何区间上积分不是几乎处处为零的任何假定的概率密度函数都将给该分布赋予概率零的某个区间以正概率。特别地，正如Vitali(1905)指出的那样，函数不是其导数的积分，即使导数几乎处处存在。\n康托函数是非递减的，因此特别是它的图形定义了一条可校正的曲线。Scheeffer(1884)证明其图的弧长为2。\n由于无穷大的康托集的勒贝格测度为0，对于任意正的ε，1和δ，都存在一个总长度为&δ的两两不交子区间的有限序列，在该序列上，康托函数的累计升幅大于ε。\n事实上，对于每一个显示样式和限制_{k=1}^{M}(y_{k}-x_{k})&lt；δk=1M(y_k−x_k)&lt；δ；0都有有限多个两两不交区间(x_k，y_k)(1_DisplayStyle，y_k)&lt；\\DELTA}和∑k=1M(c(Yk)−c(Xk))=1{\\DisplayStyle\\SUM\\LIMITS_{k=1}^{M}(c(y_{k})-c(x_{k}))=1}。\n下面我们在单位区间上定义一个收敛于康托函数的函数序列{fn}。\n然后，对于每个整数n≥0，下一个函数fn+1(X)将根据fn(X)定义如下：\n设fn+1(X)n=1/2+1/2×fn(3 x−2)，当2/3≤x≤1时。\n这三个定义在端点1/3和2/3处是兼容的，因为通过归纳，对于每个n，fn(0)f=0和f n(1)f=1。可以检查fn是否逐点收敛到上面定义的康托函数。此外，收敛是一致的。事实上，根据fn+1的定义，分成三种情况，我们可以看到。\nmax x∈[0，1]|f n+1(X)−f n(X)|≤1 2 max x∈[0，1]|f n(X)−f n−1(X)|，n≥1.{\\displaystyle\\max_{x\\in[0，1]}|f_{n+1}(X)-f_{n}(X)|\\leq{\\frac{1}{2}}\\，\\max_{x\\in[0，1]}|f_{n}(X)-f_{n-1}(X)|，\\quad n\\geq 1。}。\nmax x∈[0，1]|f(X)−f n(X)|≤2−n+1max x∈[0，1]|f 1(X)−f 0(X)|.。{\\displaystyle\\max_{x\\in[0，1]}|f(X)-f_{n}(X)|\\leq 2^{-n+1}\\，\\max_{x\\in[0，1]}|f_{1}(X)-f_{0}(X)|}。\n此外，如果f0(0)i=0，f0(1)i=1，并且f0有界[需要引用]，那么起始函数的选择实际上并不重要。\n康托函数与康托集密切相关。康托集合C可以被定义为区间[0，1]中在其基数-3(三元)展开中不包含数字-3\\f25 1-3的那些数字的集合，除非1后面只跟零(在这种情况下，尾部-3\\f25 1000-3\\f25…-3\\f6。{\\DisplayStyle\\ldots}可以替换为0222Dotts。{\\displaystyle\\ldots}以删除任何1)。结果表明，Cantor集是一个具有无穷多个点(零维体积)，但长度为零(一维体积)的分形。这里D=loglog(2)/loglog(3){\\displaystyle D=\\⁡(2)/\\⁡(3)}是C的分形维数。我们也可以将康托函数定义为康托集合的截面的D维体积。我们可以把康托函数定义为康托集合的截面的D维体积，其中D=LOG Log(2)/LOG(3){\\DisplayStyle D=\\LOG(2)/\\LOG(3)}。我们也可以将康托函数定义为康托集合的截面的D维体积\nF(X)=HD(C∩(0，x))。{\\displaystyle f(X)=H_{D}(C\\cap(0，x))。}。\ny=∑k=1∞b k 2−k{\\DisplayStyle y=\\sum_{k=1}^{\\infty}b_{k}2^{-k}}。\n是实数0≤y≤1关于二进制位b k∈{0，1}的二进(二进制)展开式。然后考虑函数。\nCz(Y)=∑k=1∞b k z k。{\\displaystyle C_{z}(Y)=\\sum_{k=1}^{\\infty}b_{k}z^{k}。}。\n对于z=C1/3，函数x=2的逆C1/3(Y)是Cantor函数。也就是说，y<sub>y</sub>=y<sub>y</sub>(X)是康托函数。一般而言，对于任何1/2的z，Cz(Y)看起来就像是Cantor函数侧翻，随着z接近于零，台阶的宽度也会变宽。\n如上所述，Cantor函数也是Cantor集合上测度的累积分布函数。不同的康托函数，或魔鬼的楼梯，可以通过考虑不同的康托集或其他分形支持的无原子概率度量来获得。虽然Cantor函数几乎处处都有导数0，但目前的研究集中在右上导数与右下导数不同的点集的大小问题上，从而导致导数不存在。这种可微性分析通常以分形维数的形式给出，其中Hausdorff维数是最流行的选择。这方面的研究是由Darst在20世纪90年代开始的，他证明了Cantor函数的不可微集的Hausdorff维数是Cantor集维数的平方，(LOG⁡2/LOG⁡3)2{\\DisplayStyle(\\log2/\\log3)^{2}}。随后，Falconer[6]证明了这种平方关系对所有的Ahlfor&#39都成立；的正则奇异测度，即dim H⁡{x：F‘(X)=L im H→0+μ([x，x+h])h不存在}=(dim H⁡supp⁡(μ))2{\\displaystyle\\dim_{H}\\Left\\{x：F&#39；(X)=\\lim_{h\\to 0^{+}}{\\frac{\\mu([x，x+h])}{h}}{\\text{不存在}}\\right\\}=\\Left(\\dim_{H}\\Operatorname{supp}(\\mu)\\right)^{2}}。\n随后，Troscheit[7]获得了更全面的集合的图景，其中对于自共形和自相似集合上支持的更一般的归一化Gibb&#s测度，不存在导数。\n赫尔曼·明科夫斯基(Hermann Minkowski)的问号函数在视觉上松散地类似于康托函数，看起来像是后者的平滑形式；它可以通过从连分式展开到二进制展开来构造，就像康托函数可以通过从三元展开到二元展开来构造一样。问号函数具有在所有有理数处导数为零的有趣性质。\n理查德·达斯特(1993-09-01)。Cantor函数的不可微集的Hausdorff维数为[ln(2)/ln(3)]2&#34；美国数学学会论文集。119(1)：105-108。10.2307/2159830。联合包裹服务公司股价上涨2159830。\n肯尼斯·J·福尔科纳(2004-01-01)。单边多重分形分析与魔鬼楼梯的不可微点。剑桥哲学学会数学论文集。136(1)：167-174。密码：2004MPCPS.136..167F。DOI：10.1017/S0305004103006960。ISSN电话：1469-8064。\n^Troscheit，萨沙(2014-03-01)。自共形魔鬼楼梯的Hölder可微性。剑桥哲学学会数学论文集。156(2)：295-311。Arxiv：1301.1286。密码：2014MPCPS.156..295T。DOI：10.1017/S0305004113000698。ISSN电话：1469-8064。\n巴斯，理查德·富兰克林(2013)[2011]。研究生真实分析(第二版)。CreateSpace独立出版公司。ISBN电话：978-1-4818-6914-0。CS1维护：REF=HARV(链接)。\n康托，G.(1884)。de la puqhance des overfaits de Points：Extrit d&39；une lettre adresséeàl&#34；éditeur&#34；[完美点数的力量：从致编辑的信中摘录》(The Power of Perfect Set Points：Extrit d&#39；une lettre adresséeàl&#34；éditeur&#34；)。数学学报。波士顿国际出版社。4：381-392。DOI：10.1007/bf02418423.。ISSN：0001-5962。转载于：E.Zermelo(编辑)，Gesammelte Abhandlungen Mathatischen and Philosophischen Inhalts，Springer，New York，1980。\n理查德·B·达斯特；朱迪思·A·帕拉加洛；普莱斯，托马斯·E(2010)，“好奇曲线”，哈肯萨克，新泽西州：世界科学出版公司。ISBN978-981-4291-28-6,2681574先生。\nDovgoshey，O.；Marto，O.；Ryazanov，V.；Vuorinen，M.(2006)。&#34；康托函数&#34；(PDF)。“数理演绎”(Exexextiones Mamaaticae)。爱思唯尔BV。24(1)：1-37。doi：10.1016/j.exmath.2005.05.002.。ISSN电话：0723-0869。2195181岁的先生。\n朱利安·F·弗隆(1994-04-01)。关于康托集和康托函数历史的注记&#34；。数学杂志。Informa UK Limited。67(2)：136-140。10.2307/2690689。ISSN：0025-570X。联合包裹服务公司股价上涨2690689。\n勒贝格，H.(1904)，Leçons sur l&#39；intégration et la recherche des Functions Priftions[关于整合和搜索原始函数的课程]，巴黎：Gauthier-Villars。\n莱昂尼，乔瓦尼(2017)。索博列夫空间的第一堂课。181(第二版)。罗德岛普罗维登斯：美国数学学会。734页。ISBN电话：978-1-4704-2921-8。华侨城：976406106。\n谢弗，路德维希(1884)。Allgemeine Untersuhungenüber Constraint der Curven&#34；[关于曲线校正的一般调查]。数学学报。波士顿国际出版社。5：49-82。DOI：10.1007/bf02421552.。ISSN：0001-5962。\n首页--期刊主要分类--期刊细介绍--期刊题录与文摘--期刊详细文摘内容。初等实数分析(第二版)。ClassicalRealAnalysis.com。ISBN电话：978-1-4348-4367-8。CS1维护：REF=HARV(链接)。\nVestrup，E.M.(2003)。测度论和整合论。概率统计中的威利系列。约翰·威利和他的儿子们。ISBN978-0471249771。CS1维护：REF=HARV(链接)。\n维塔利，A.(1905)，#34；Sulle Funzioni Integrali&#34；[关于积分函数]，Atti Accad.。SCI。都灵属(Torino Cl.)。SCI。菲斯。垫子。自然，40：1021-1034", "note_en": "Jump to navigation  Jump to search  In  mathematics, the  Cantor function is an example of a  function that is  continuous, but not  absolutely continuous. It is a notorious counterexample in analysis, because it challenges naive intuitions about continuity, derivative, and measure. Though it is continuous everywhere and has zero derivative almost everywhere, its value still goes from 0 to 1 as its argument reaches from 0 to 1. Thus, in one sense the function seems very much like a constant one which cannot grow, and in another, it does indeed monotonically grow, by construction.\n It is also referred to as the  Cantor ternary function, the  Lebesgue function,  [1]  Lebesgue&#39;s singular function, the  Cantor–Vitali function, the  Devil&#39;s staircase,  [2] the  Cantor staircase function,  [3] and the  Cantor–Lebesgue function.  [4]  Georg Cantor ( 1884) introduced the Cantor function and mentioned that Scheeffer pointed out that it was a  counterexample to an extension of the  fundamental theorem of calculus claimed by  Harnack. The Cantor function was discussed and popularized by  Scheeffer (1884),  Lebesgue (1904) and  Vitali (1905).\n    See figure. To formally define the Cantor function  c : [0,1] → [0,1], let  x be in [0,1] and obtain  c( x) by the following steps:\n If  x contains a 1, replace every digit strictly after the first 1 by 0.\n  1/4 is 0.02020202... in base 3. There are no 1s so the next stage is still 0.02020202... This is rewritten as 0.01010101... When read in base 2, this corresponds to 1/3, so  c(1/4) = 1/3.\n 1/5 is 0.01210121... in base 3. The digits after the first 1 are replaced by 0s to produce 0.01000000... This is not rewritten since there are no 2s. When read in base 2, this corresponds to 1/4, so  c(1/5) = 1/4.\n 200/243 is 0.21102 (or 0.211012222...) in base 3. The digits after the first 1 are replaced by 0s to produce 0.21. This is rewritten as 0.11. When read in base 2, this corresponds to 3/4, so  c(200/243) = 3/4.\n Equivalently, if                C      {\\displaystyle {\\mathcal {C}}}   is the  Cantor set on [0,1], then the Cantor function  c : [0,1] → [0,1] can be defined as\n c  (  x  )  =      {          ∑    n  =  1     ∞          a    n      2    n      ,     x  =    ∑    n  =  1     ∞          2    a    n       3    n      ∈      C         f  o  r        a    n    ∈  {  0  ,  1  }  ;          sup    y  ≤  x  ,    y  ∈      C      c  (  y  )  ,     x  ∈  [  0  ,  1  ]  ∖      C    .           {\\displaystyle c(x)={\\begin{cases}\\sum _{n=1}^{\\infty }{\\frac {a_{n}}{2^{n}}},&amp;x=\\sum _{n=1}^{\\infty }{\\frac {2a_{n}}{3^{n}}}\\in {\\mathcal {C}}\\ \\mathrm {for} \\ a_{n}\\in \\{0,1\\};\\\\\\sup _{y\\leq x,\\,y\\in {\\mathcal {C}}}c(y),&amp;x\\in [0,1]\\setminus {\\mathcal {C}}.\\\\\\end{cases}}}\n This formula is well-defined, since every member of the Cantor set has a  unique base 3 representation that only contains the digits 0 or 2. (For some members of                C      {\\displaystyle {\\mathcal {C}}}  , the ternary expansion is repeating with trailing 2&#39;s and there is an alternative non-repeating expansion ending in 1. For example, 1/3 = 0.1 3 = 0.02222... 3 is a member of the Cantor set). Since  c(0) = 0 and  c(1) = 1, and  c is monotonic on                C      {\\displaystyle {\\mathcal {C}}}  , it is clear that 0 ≤  c( x) ≤ 1 also holds for all            x  ∈  [  0  ,  1  ]  ∖      C      {\\displaystyle x\\in [0,1]\\setminus {\\mathcal {C}}}  .\n  The Cantor function challenges naive intuitions about  continuity and  measure; though it is continuous everywhere and has zero derivative  almost everywhere,            c  (  x  )    {\\textstyle c(x)}   goes from 0 to 1 as            x    {\\textstyle x}   goes from 0 to 1, and takes on every value in between. The Cantor function is the most frequently cited example of a real function that is  uniformly continuous (precisely, it is  Hölder continuous of exponent  α = log 2/log 3) but not  absolutely continuous. It is constant on intervals of the form (0. x 1 x 2 x 3... x n022222..., 0. x 1 x 2 x 3... x n200000...), and every point not in the Cantor set is in one of these intervals, so its derivative is 0 outside of the Cantor set. On the other hand, it has no  derivative at any point in an  uncountable subset of the  Cantor set containing the interval endpoints described above.\n The Cantor function can also be seen as the  cumulative probability distribution function of the 1/2-1/2  Bernoulli measure  μ supported on the Cantor set:            c  (  x  )  =  μ  (  [  0  ,  x  ]  )    {\\textstyle c(x)=\\mu ([0,x])}  . This probability distribution, called the  Cantor distribution, has no discrete part. That is, the corresponding measure is  atomless. This is why there are no jump discontinuities in the function; any such jump would correspond to an atom in the measure.\n However, no non-constant part of the Cantor function can be represented as an integral of a  probability density function; integrating any putative  probability density function that is not  almost everywhere zero over any interval will give positive probability to some interval to which this distribution assigns probability zero. In particular, as  Vitali (1905) pointed out, the function is not the integral of its derivative even though the derivative exists almost everywhere.\n  The Cantor function is non-decreasing, and so in particular its graph defines a  rectifiable curve.  Scheeffer (1884) showed that the arc length of its graph is 2.\n  Because the  Lebesgue measure of the  uncountably infinite  Cantor set is 0, for any positive  ε &lt; 1 and  δ, there exists a finite sequence of  pairwise disjoint sub-intervals with total length &lt;  δ over which the Cantor function cumulatively rises more than  ε.\n In fact, to every  δ &gt; 0 there are finitely many pairwise disjoint intervals ( x k, y k) (1 ≤  k ≤  M) with              ∑    k  =  1     M    (    y    k    −    x    k    )  &lt;  δ    {\\displaystyle \\sum \\limits _{k=1}^{M}(y_{k}-x_{k})&lt;\\delta }   and              ∑    k  =  1     M    (  c  (    y    k    )  −  c  (    x    k    )  )  =  1    {\\displaystyle \\sum \\limits _{k=1}^{M}(c(y_{k})-c(x_{k}))=1}  .\n    Below we define a sequence { f  n} of functions on the unit interval that converges to the Cantor function.\n  Then, for every integer   n ≥ 0, the next function  f  n+1( x) will be defined in terms of  f  n( x) as follows:\n   Let  f  n+1( x) =  1/2 + 1/2 ×  f  n(3  x − 2),  when  2/3 ≤  x ≤ 1.\n The three definitions are compatible at the end-points 1/3 and 2/3, because  f  n(0) = 0 and  f  n(1) = 1 for every  n, by induction. One may check that  f  n converges pointwise to the Cantor function defined above. Furthermore, the convergence is uniform. Indeed, separating into three cases, according to the definition of  f  n+1, one sees that\n max    x  ∈  [  0  ,  1  ]      |     f    n  +  1    (  x  )  −    f    n    (  x  )    |   ≤      1  2        max    x  ∈  [  0  ,  1  ]      |     f    n    (  x  )  −    f    n  −  1    (  x  )    |   ,    n  ≥  1.    {\\displaystyle \\max _{x\\in [0,1]}|f_{n+1}(x)-f_{n}(x)|\\leq {\\frac {1}{2}}\\,\\max _{x\\in [0,1]}|f_{n}(x)-f_{n-1}(x)|,\\quad n\\geq 1.}\n  max    x  ∈  [  0  ,  1  ]      |   f  (  x  )  −    f    n    (  x  )    |   ≤    2    −  n  +  1        max    x  ∈  [  0  ,  1  ]      |     f    1    (  x  )  −    f    0    (  x  )    |   .    {\\displaystyle \\max _{x\\in [0,1]}|f(x)-f_{n}(x)|\\leq 2^{-n+1}\\,\\max _{x\\in [0,1]}|f_{1}(x)-f_{0}(x)|.}\n Also the choice of starting function does not really matter, provided  f 0(0) = 0,  f 0(1) = 1 and  f 0 is  bounded [   citation needed].\n  The Cantor function is closely related to the  Cantor set. The Cantor set  C can be defined as the set of those numbers in the interval [0, 1] that do not contain the digit 1 in their  base-3 (triadic) expansion, except if the 1 is followed by zeros only (in which case the tail 1000           …    {\\displaystyle \\ldots }   can be replaced by 0222           …    {\\displaystyle \\ldots }   to get rid of any 1). It turns out that the Cantor set is a  fractal with (uncountably) infinitely many points (zero-dimensional volume), but zero length (one-dimensional volume). Only the  D-dimensional volume              H    D      {\\displaystyle H_{D}}   (in the sense of a  Hausdorff-measure) takes a finite value, where            D  =  log  ⁡  (  2  )    /   log  ⁡  (  3  )    {\\displaystyle D=\\log(2)/\\log(3)}   is the fractal dimension of  C. We may define the Cantor function alternatively as the  D-dimensional volume of sections of the Cantor set\n f  (  x  )  =    H    D    (  C  ∩  (  0  ,  x  )  )  .    {\\displaystyle f(x)=H_{D}(C\\cap (0,x)).}\n   y  =    ∑    k  =  1     ∞      b    k      2    −  k      {\\displaystyle y=\\sum _{k=1}^{\\infty }b_{k}2^{-k}}\n be the  dyadic (binary) expansion of the real number 0 ≤  y ≤ 1 in terms of binary digits  b  k ∈ {0,1}. Then consider the function\n C    z    (  y  )  =    ∑    k  =  1     ∞      b    k      z    k    .    {\\displaystyle C_{z}(y)=\\sum _{k=1}^{\\infty }b_{k}z^{k}.}\n For  z = 1/3, the inverse of the function  x = 2  C 1/3( y) is the Cantor function. That is,  y =  y( x) is the Cantor function. In general, for any  z &lt; 1/2,  C  z( y) looks like the Cantor function turned on its side, with the width of the steps getting wider as  z approaches zero.\n As mentioned above, the Cantor function is also the cumulative distribution function of a measure on the Cantor set. Different Cantor functions, or Devil&#39;s Staircases, can be obtained by considering different atom-less probability measures supported on the Cantor set or other fractals. While the Cantor function has derivative 0 almost everywhere, current research focusses on the question of the size of the set of points where the upper right derivative is distinct from the lower right derivative, causing the derivative to not exist. This analysis of differentiability is usually given in terms of  fractal dimension, with the Hausdorff dimension the most popular choice. This line of research was started in the 1990s by Darst,  [5] who showed that the Hausdorff dimension of the set of non-differentiability of the Cantor function is the square of the dimension of the Cantor set,            (  log  ⁡  2    /   log  ⁡  3    )    2      {\\displaystyle (\\log 2/\\log 3)^{2}}  . Subsequently  Falconer  [6] showed that this squaring relationship holds for all Ahlfor&#39;s regular, singular measures, i.e. dim    H    ⁡    {    x  :    f  ′   (  x  )  =    lim    h  →    0    +            μ  (  [  x  ,  x  +  h  ]  )   h       does not exist    }   =      (      dim    H    ⁡  supp  ⁡  (  μ  )   )     2      {\\displaystyle \\dim _{H}\\left\\{x:f&#39;(x)=\\lim _{h\\to 0^{+}}{\\frac {\\mu ([x,x+h])}{h}}{\\text{ does not exist}}\\right\\}=\\left(\\dim _{H}\\operatorname {supp} (\\mu )\\right)^{2}}\nLater, Troscheit  [7] obtain a more comprehensive picture of the set where the derivative does not exist for more general normalized Gibb&#39;s measures supported on self-conformal and  self-similar sets.\n Hermann Minkowski&#39;s  question mark function loosely resembles the Cantor function visually, appearing as a &#34;smoothed out&#34; form of the latter; it can be constructed by passing from a continued fraction expansion to a binary expansion, just as the Cantor function can be constructed by passing from a ternary expansion to a binary expansion. The question mark function has the interesting property of having vanishing derivatives at all rational numbers.\n  ^   Darst, Richard (1993-09-01). &#34;The Hausdorff Dimension of the Nondifferentiability Set of the Cantor Function is [ ln(2)/ln(3) ]2&#34;.  Proceedings of the American Mathematical Society.  119 (1): 105–108.  doi: 10.2307/2159830.  JSTOR  2159830.\n ^   Falconer, Kenneth J. (2004-01-01). &#34;One-sided multifractal analysis and points of non-differentiability of devil&#39;s staircases&#34;.  Mathematical Proceedings of the Cambridge Philosophical Society.  136 (1): 167–174.  Bibcode: 2004MPCPS.136..167F.  doi: 10.1017/S0305004103006960.  ISSN  1469-8064.\n ^   Troscheit, Sascha (2014-03-01). &#34;Hölder differentiability of self-conformal devil&#39;s staircases&#34;.  Mathematical Proceedings of the Cambridge Philosophical Society.  156 (2): 295–311.  arXiv:  1301.1286.  Bibcode: 2014MPCPS.156..295T.  doi: 10.1017/S0305004113000698.  ISSN  1469-8064.\n  Bass, Richard Franklin (2013) [2011].  Real analysis for graduate students (Second ed.). Createspace Independent Publishing.  ISBN   978-1-4818-6914-0.  CS1 maint: ref=harv ( link)\n Cantor, G. (1884). &#34;De la puissance des ensembles parfaits de points: Extrait d&#39;une lettre adressée à l&#39;éditeur&#34; [The power of perfect sets of points: Extract from a letter addressed to the editor].  Acta Mathematica. International Press of Boston.  4: 381–392.  doi:  10.1007/bf02418423.  ISSN  0001-5962.   Reprinted in: E. Zermelo (Ed.), Gesammelte Abhandlungen Mathematischen und Philosophischen Inhalts, Springer, New York, 1980.\n Darst, Richard B.; Palagallo, Judith A.; Price, Thomas E. (2010),  Curious curves, Hackensack, NJ: World Scientific Publishing Co. Pte. Ltd.,  ISBN   978-981-4291-28-6,  MR  2681574\n Dovgoshey, O.; Martio, O.; Ryazanov, V.; Vuorinen, M. (2006).  &#34;The Cantor function&#34;  (PDF).  Expositiones Mathematicae. Elsevier BV.  24 (1): 1–37.  doi: 10.1016/j.exmath.2005.05.002.  ISSN  0723-0869.  MR  2195181.\n Fleron, Julian F. (1994-04-01). &#34;A Note on the History of the Cantor Set and Cantor Function&#34;.  Mathematics Magazine. Informa UK Limited.  67 (2): 136–140.  doi: 10.2307/2690689.  ISSN  0025-570X.  JSTOR  2690689.\n Lebesgue, H. (1904),  Leçons sur l&#39;intégration et la recherche des fonctions primitives [ Lessons on integration and search for primitive functions], Paris: Gauthier-Villars\n Leoni, Giovanni (2017).   A first course in Sobolev spaces.  181 (2nd ed.). Providence, Rhode Island: American Mathematical Society. p. 734.  ISBN   978-1-4704-2921-8.  OCLC  976406106.\n Scheeffer, Ludwig (1884). &#34;Allgemeine Untersuchungen über Rectification der Curven&#34; [General investigations on rectification of the curves].  Acta Mathematica. International Press of Boston.  5: 49–82.  doi:  10.1007/bf02421552.  ISSN  0001-5962.\n Thomson, Brian S.; Bruckner, Judith B.; Bruckner, Andrew M. (2008) [2001].  Elementary real analysis (Second ed.). ClassicalRealAnalysis.com.  ISBN   978-1-4348-4367-8.  CS1 maint: ref=harv ( link)\n Vestrup, E.M. (2003).  The theory of measures and integration. Wiley series in probability and statistics. John Wiley &amp; sons.  ISBN   978-0471249771.  CS1 maint: ref=harv ( link)\n Vitali, A. (1905), &#34;Sulle funzioni integrali&#34; [On the integral functions],  Atti Accad. Sci. Torino Cl. Sci. Fis. Mat. Natur.,  40: 1021–1034", "posttime": "2020-06-12 03:13:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "函数,function", "title": "康托函数，又名。魔鬼阶梯：0导数的递增函数", "title_en": "Cantor function, a.k.a. devil's staircase: increasing function with 0 derivative", "transed": 1, "url": "https://en.wikipedia.org/wiki/Cantor_function", "via": "", "real_tags": ["函数", "function"]}, {"category": "", "categoryclass": "", "imagename": "ecd4850d558982a25d9392ee724d5a0a.jpg", "infoid": 1006179, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们都听过很多次了：在室内、室外、火车和公交车上都要戴面罩。在工作中，在超市里，在教堂里。\n但现在，剑桥大学和格林威治大学的一项新的建模研究表明，口罩在预防未来新型冠状病毒爆发方面可能比最初想象的更重要。\n为了防止病毒卷土重来，病毒的繁殖数量(从一个感染者那里感染它的平均人数)需要降到1.0以下。研究人员认为，仅靠封锁是不可能实现这一点的。然而，他们说，封锁和广泛的口罩遵从性相结合可能会起到作用。\n科学家们在周三发表在“皇家学会学报A”上的论文中写道：“我们表明，当公众一直使用口罩时(而不仅仅是从症状第一次出现时起)，有效的繁殖次数Re可以减少到1以下，从而减缓疫情的传播，”科学家们在周三发表在“皇家学会学报A”(Proceases Of The Royal Society A)上的论文中写道。\n建模表明，当锁定期与100%口罩的使用相结合时，疾病传播大大减少，可在18个月内防止复发，这是开发疫苗经常引用的时间框架。研究还表明，如果人们在公共场合戴口罩，降低R值的效果是只在症状出现后才戴面罩的两倍。\n口罩不一定要是最好的外科口罩或呼吸器口罩。他们的结论是，仅捕捉50%呼出的飞沫的自制覆盖物将提供“人口层面的好处”。\n众所周知，戴口罩主要是保护别人不受自己的伤害，而不是反过来。这不是你认为别人是危险的迹象。\n“科学焦点”援引该研究的主要作者理查德·斯图特博士的话说：“我们的分析支持公众立即普遍采用口罩。”\n斯图特是剑桥大学植物科学系的一个研究小组的成员，该小组通常对作物病害的传播进行建模。\n阿拉米达县和旧金山市卫生官员要求居民在离开家的任何时候都要戴上面罩，并在30英尺内接近任何不住在他们家里的人。\n在旧金山、康特拉科斯塔、马林、纳帕、圣克拉拉、圣马特奥和索诺马县(以及欢乐山市和弗里蒙特市)，人们离开家去超市、药店或医生等必需品场所时，必须使用基本的非医疗口罩，包括围巾和头巾，以遮住鼻子和嘴巴。", "note_en": "We&#39;ve all heard it many times: Wear a face covering — indoors, outdoors, on trains and buses. At work, in the supermarket and at church.\n   But now a new modeling study out of Cambridge and Greenwich universities suggests that face masks may be even more important than originally thought in preventing future outbreaks of the new coronavirus.\n   To ward off resurgences, the reproduction number for the virus (the average number of people who will contract it from one infected person) needs to drop below 1.0. Researchers don’t believe that’s achievable with lockdowns alone. However, a combination of lockdowns and widespread mask compliance might do the trick, they say.\n      “We show that, when face masks are used by the public all the time (not just from when symptoms first appear), the effective reproduction number, Re, can be decreased below 1, leading to the mitigation of epidemic spread,” the scientists wrote in the paper published Wednesday by the  Proceedings of the Royal Society A.\n          The modeling indicated that when lockdown periods are combined with 100% face mask use, disease spread is vastly diminished, preventing resurgence for 18 months, the time frame that has frequently been cited for developing a vaccine. It also demonstrated that if people wear masks in public, it is twice as effective at reducing the R number than if face coverings are only worn after symptoms appear.\n       The masks don’t have to be top-of-the-line surgical or respirator masks. Homemade coverings that catch only 50 percent of exhaled droplets would provide a “population-level benefit,” they concluded.\n       As has been well-publicized, wearing a mask primarily protects others from yourself, rather than the other way around. It is not a sign that you consider others a danger.\n   Science Focus quoted the study’s lead author, Dr Richard Stutt, as saying, “Our analyses support the immediate and universal adoption of face masks by the public.”\n   Stutt is part of a team that usually models the spread of crop diseases at Cambridge’s department of plant sciences.\n   Alameda County and San Francisco city health officials require residents to wear face coverings any time they leave home and get within 30 feet of anyone not living in their household.\n   In San Francisco, Contra Costa, Marin, Napa, Santa Clara, San Mateo and Sonoma counties (plus the cities of Pleasant Hill and Fremont) people must use basic nonmedical, cloth masks, including scarves and bandannas, to cover their noses and mouths when they leave home to go to essential places like the supermarket, drugstore or doctor.", "posttime": "2020-06-12 03:13:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "口罩,mask", "title": "研究：100%使用口罩可粉碎第二波、第三波新冠肺炎波", "title_en": "Study: 100% face mask use could crush second, third Covid-19 wave", "transed": 1, "url": "https://www.sfgate.com/science/article/Study-100-face-mask-use-could-crush-second-15333170.php", "via": "", "real_tags": ["口罩", "mask"]}, {"category": "", "categoryclass": "", "imagename": "68cb75c27915854b668d13bb0e8280f2.png", "infoid": 1006178, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据首席执行官苏珊·沃西基(Susan Wojcicki)说，该公司宣布了一项为期多年、耗资1亿美元的基金，致力于“放大和发展黑人创作者和艺术家及其故事的声音”。\n“在YouTube，我们相信黑人的生命很重要，我们都需要做更多的事情来消除系统性种族主义，”沃西基在一篇博客文章中写道。我们致力于作为一个集中和放大黑人声音和观点的平台做得更好。\n沃西基宣布，本周六，也就是6月13日，YouTube将举办由YouTube Originals制作的名为“熊目击者，采取行动”的直播筹款活动，这是根据新倡议为内容提供资金的一个例子。\n由和主办的“熊目击者，采取行动”将由圆桌讨论和小组讨论，强有力的现场时刻，音乐致敬等构成。活动于美国东部时间6月13日(星期六)下午6点/太平洋时间下午3点开始。据YouTube称，这部特辑将旨在激励和联合关键而有意义的声音(YouTube创作者、有影响力的公众人物、著名的活动家声音)，以创造变革，提高意识，并为种族正义筹集资金。\n此外，在整个6月份，YoutTube的Spotlight频道将突出种族正义问题，包括YouTube上黑人社区的最新观点，以及历史内容、教育视频和抗议报道。据报道，这些内容展示了几个世纪以来争夺股权的极其重要的故事。\nYouTube原创内容全球主管苏珊·丹尼尔斯(Susanne Daniels)表示：“我支持”黑人生命也是命“(Black Lives Matter)运动，我认为我们必须帮助放大黑人的声音，继续关于有意义的变革和种族正义的对话。”“YouTube有一种独特的能力，可以团结黑人社区内的创作者、艺术家和强大的声音，鼓励世界站出来为种族正义发声。”\n“熊目击者，采取行动”将由圆桌讨论和小组讨论、现场时刻、音乐悼念-包括约翰·传奇和特雷·宋兹的表演-以及更多内容组成。将鼓励观众直接在YouTube直播上捐款支持平等司法倡议。\n主持人包括Jemele Hill、Roland S.Martin和Soledad O‘Brien；小组成员包括Ambers Closet、KimberléCrenshaw、Patrisse Cullors、Kimberly N.Foster、Alicia Garza、Roxane Gay、Eddie Glaude、Kimberly Jones、Jouelzy、MN Fats、Prince EA、Rashad Robinson、Bakari Sellers、Michael Skolnik、Chaz Smith和Baratunde瑟斯顿。Que，Jarvis Landry，Alonzo Lerone，Indya Moore，Jeff Okudah，Laviska Shault Jr.，Bryan Stevenson，sWooZie和Wilmer Valderrama。\n《熊目击者，行动起来》由勒布朗·詹姆斯的SpringHill Entertainment、Fly on the Wall和Byron Phillps出品。雷金纳德·哈德林(Reginald Hudlin)担任执行制片人和节目制片人。", "note_en": "announced a multiyear, $100 million fund dedicated to “amplifying and developing the voices of Black creators and artists and their stories,” according to CEO Susan Wojcicki.\n “At YouTube, we believe Black lives matter and we all need to do more to dismantle systemic racism,” Wojcicki wrote in a blog post. “We’re committed to doing better as a platform to center and amplify Black voices and perspectives.\n As an example of content being funded under the new initiative, Wojcicki announced that this Saturday, June 13, YouTube will host livestream fundraising event produced by YouTube Originals, called “Bear Witness, Take Action.”\n Hosted by   and  , “Bear Witness, Take Action” will be structured with roundtable discussions and panels, powerful live moments, musical tributes and more. The event kicks off Saturday, June 13, at 6pm ET / 3pm PT. The special will aim to inspire and unite key and meaningful voices (YouTube creators, influential public figures, prominent activist voices) to create change, heighten awareness and raise funding for racial justice, according to YouTube.\n  In addition, throughout the month of June, YoutTube’s Spotlight channel will highlight racial justice issues, including the latest perspectives from the Black community on YouTube alongside historical content, educational videos, and protest coverage. This content showcases incredibly important stories about the centuries-long fight for equity, according to .\n “I support the Black Lives Matter movement and I think it’s imperative that we help amplify Black voices and continue the conversation about meaningful change and racial justice,” said Susanne Daniels, YouTube’s global head of original content. “YouTube has a unique ability to unite creators, artists and powerful voices within the Black community to encourage the world to stand up and speak out for racial justice.”\n “Bear Witness, Take Action” will be structured with roundtable discussions and panels, live moments, musical tributes — including performances from John Legend and Trey Songz — and more. Viewers will be encouraged to donate to support the  Equal Justice Initiative directly on the YouTube livestream.\n Moderators include Jemele Hill, Roland S. Martin and Soledad O’Brien; panelists include Ambers Closet, Kimberlé Crenshaw, Patrisse Cullors, Kimberly N. Foster, Alicia Garza, Roxane Gay, Eddie Glaude, Kimberly Jones, Jouelzy, MN FATS, Prince EA, Rashad Robinson, Bakari Sellers, Michael Skolnik, Chaz Smith and Baratunde Thurston; special guests Tremayne Anchrum, Carmelo Anthony, AyChristeneGames, Danielle Bainbridge, Essang Bassey, Shalom Blac, Asante Blackk, Sterling K. Brown, Hakeem Butler, Duke Dawson, De’arra &amp; Ken, Khadi Don, Rasul Douglas, Teala Dunn, Bryce Hall, Skai Jackson, Jamilla &amp; Que, Jarvis Landry, Alonzo Lerone, Indya Moore, Jeff Okudah, Laviska Shenault Jr., Bryan Stevenson, sWooZie and Wilmer Valderrama.\n “Bear Witness, Take Action” is produced by LeBron James’ SpringHill Entertainment, Fly on the Wall and Byron Phillps. Reginald Hudlin serves as executive producer and showrunner.", "posttime": "2020-06-12 02:56:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,app,youtube,apple,艺术", "title": "苹果公司发起1亿美元种族正义倡议；YouTube为黑人创作者和艺术家设立1亿美元基金", "title_en": "Apple Launches $100 Million Racial Justice Initiative; YouTube Creates $100 Million Fund for Black Creators and Artists", "transed": 1, "url": "https://variety.com/2020/digital/news/youtube-100-million-fund-black-creators-artists-common-keke-palmer-1234631840/", "via": "", "real_tags": ["苹果", "app", "youtube", "apple", "艺术"]}, {"category": "", "categoryclass": "", "imagename": "fd93c5ba89bc7aeeb77dc980b7d1ece7.png", "infoid": 1006177, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "镜头-Kubernetes IDE。通过在GitHub上创建帐户，为lensapp/lens开发做出贡献。", "note_en": "Lens - The Kubernetes IDE. Contribute to lensapp/lens development by creating an account on GitHub.", "posttime": "2020-06-12 02:55:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "kubernetes", "title": "Lens(Kubernetes IDE)v3.5.0-RC.1", "title_en": "Lens (The Kubernetes IDE) v3.5.0-RC.1", "transed": 1, "url": "https://github.com/lensapp/lens/releases/tag/v3.5.0-rc.1", "via": "", "real_tags": []}, {"category": "", "categoryclass": "", "imagename": "b03615a850b437c519a31525a29228d8.png", "infoid": 1006176, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个新的在线平台，可以追踪世界各地的空气污染，现在可以向公众开放。这些地图使用了哥白尼哨兵5P卫星的数据，使用14天移动平均数显示了二氧化氮的平均浓度。这些地图不仅显示了全球范围内随着时间的变化，而且还为用户提供了放大到感兴趣的区域的可能性，例如欧洲的任何城市或地区。\n平均地图也反映了新冠肺炎封锁的影响-在许多地区都可以看到二氧化氮浓度的急剧下降。这些效应现在可以很容易地在全球范围内探索。\n由于排放量的波动，以及日照、温度和风等天气条件的变化，我们大气中的二氧化氮浓度每天变化很大，所有这些都会影响气体在大气中的寿命。\n出于这些原因，有必要在相当长的一段时间内--在这种情况下是14天--分析数据，因为它允许准确绘制和分析全球各地的二氧化氮浓度。\n二氧化氮是由发电厂、车辆和其他工业设施产生的，会对人类健康产生重大影响-增加出现呼吸问题的可能性。\n由于空气质量令人严重担忧，哥白尼哨兵5P卫星于2017年发射，以绘制全球范围内的多种空气污染物地图。Copernicus Sentinel-5P搭载了Tropomi仪器，这是一种最先进的仪器，可以探测大气气体的独特指纹，以比以往任何时候都更准确和更高的空间分辨率对空气污染物进行成像。\n地图门户是哨兵-5P产品算法实验室(S5P-PAL)的一部分，S5P-PAL是由欧盟委员会资助的一个正在进行的项目。S5P-PAL是一个项目，它允许快速、低成本地开发哨兵-5P原型产品(例如，溴、一氧化碳和水蒸气)，并生成更高级别的产品，如全球地图。目前正在开发一氧化碳产品的新测绘门户和其他功能，例如选择区域和时间段来调查测量时间序列。\nS5P-PAL也是新的“针对冠状病毒和地球观测的快速行动”仪表盘的一部分，也被称为RACE。该平台提供关键的环境、经济和社会指标，以衡量冠状病毒封锁的影响，并监测封锁后的恢复情况。\n哥白尼哨兵是一支由欧盟拥有的专用卫星组成的舰队，旨在提供丰富的数据和图像，这些数据和图像对欧盟的哥白尼环境计划至关重要。欧盟委员会领导和协调这一计划，以改善环境管理，保障每天的生命安全。欧空局负责空间部分，负责代表欧洲联盟开发哥白尼哨兵系列卫星，并确保哥白尼服务的数据流通，而哥白尼哨兵卫星的业务则委托给欧空局和欧洲气象卫星组织。", "note_en": "A  new online platform that allows for the tracking of air pollution worldwide is now available to the public. The maps, which use data from the Copernicus Sentinel-5P satellite, show the averaged nitrogen dioxide concentrations using a 14-day moving average. The maps not only show changes over time on a global scale, but also provide the possibility for users to zoom in to areas of interest, for example any city or region over Europe.\n The averaged maps also reflect the effects of the COVID-19 lockdown – with drastic reductions of nitrogen dioxide concentrations visible over many areas. These effects can now be easily explored across the globe.\n Nitrogen dioxide concentrations in our atmosphere vary widely on a day-to-day basis owing to the fluctuations of emissions, as well as variations in weather conditions such as sunlight, temperature and wind, all of which can affect the lifetime of the gas in the atmosphere.\n For these reasons, it is necessary to analyse data over a substantial period of time – in this case 14 days – as it allows for the accurate mapping and analysis of nitrogen dioxide concentrations across the globe.\n Nitrogen dioxide is produced from power plants, vehicles and other industrial facilities and can have significant impacts on human health – increasing the likelihood of developing respiratory problems.\n With air quality a serious concern, the  Copernicus Sentinel-5P satellite was launched in 2017 to map a multitude of air pollutants around the globe. Copernicus Sentinel-5P carries the Tropomi instrument – a state-of-the-art instrument that detects the unique fingerprint of atmospheric gases to image air pollutants more accurately and at a higher spatial resolution than ever before.\n The mapping portal is part of the Sentinel-5P Product Algorithm Laboratory (S5P-PAL) – an ongoing project funded by the European Commission. S5P-PAL is a project that allows fast and cost-efficient Sentinel-5P prototype product development (for example bromine monoxide and water vapour) and the generation of higher level products like global maps. New mapping portals for the carbon monoxide product and additional functionalities, for example the selection of an area and time-period to investigate time-series of measurements, are currently in development.\n  The S5P-PAL is also part of the new ‘Rapid Action on Coronavirus and Earth observation’ dashboard, also known as  RACE. The platform provides access to key environmental, economic and social indicators to measure the impact of the coronavirus lockdown and monitor post-lockdown recovery.\n  The Copernicus Sentinels are a fleet of dedicated EU-owned satellites, designed to deliver the wealth of data and imagery that are central to the European Union&#39;s Copernicus environmental programme. The European Commission leads and coordinates this programme, to improve the management of the environment, safeguarding lives every day. ESA is in charge of the space component, responsible for developing the family of Copernicus Sentinel satellites on behalf of the European Union and ensuring the flow of data for the Copernicus services, while the operations of the Copernicus Sentinels have been entrusted to ESA and EUMETSAT.", "posttime": "2020-06-12 02:55:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "全球,space,哥白尼", "title": "欧洲航天局全球空气污染地图现已面世", "title_en": "European Space Agency Global air pollution maps now available", "transed": 1, "url": "http://www.esa.int/ESA_Multimedia/Images/2020/06/Global_air_pollution_maps_now_available", "via": "", "real_tags": ["全球", "space", "哥白尼"]}, {"category": "", "categoryclass": "", "imagename": "1482cb9edacfa80211e2bc98bfca889f.jpg", "infoid": 1006175, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从冠状病毒封锁迫使员工将工作带回家以来，家庭办公室再次成为现代生活中令人垂涎的特征。", "note_en": "Since coronavirus lockdowns forced workers to take their jobs home, the home office has once again become a much-coveted feature of modern living.", "posttime": "2020-06-12 02:38:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,办公室,office,现代", "title": "当办公室回到家时发生了什么", "title_en": "What Happened When the Office Came Home", "transed": 1, "url": "https://www.citylab.com/design/2020/06/home-office-setup-design-history-remote-work-furniture/612889/", "via": "", "real_tags": ["app", "办公室", "office", "现代"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006174, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "POP！_OS是为与System76计算机完美协调而设计和开发的操作系统。选择Pop！给您一种现代的、美丽的、强大的体验。#TryPopOS。\n更好的处理器让一切都变得更快，从打开应用程序到渲染视频。所有选项均为台式机级别的第三代AMD Ryzen CPU。\nRyzen 9 Pro 3900(3.1至4.3 GHz-12核-24个线程)。\n存储您的操作系统和应用程序的M.2固态硬盘。选择NVMe固态硬盘以获得最佳性能。\n添加另一个驱动器以存储更多文件，如大型音乐、视频、照片或游戏库。选择NVMe固态硬盘以获得最佳性能。\n用来自世界各地的帆布、尼龙和其他有意识的材料定制。加州旧金山手工制作。\nSystem76产品包括终身支持。选择较长的保修期以保护您的投资。电池保修期为一年。\n我们将寄给您一个运输标签，捐赠您的旧计算机，以便负责任地回收。仅在毗邻的美国提供。", "note_en": "Pop!_OS is an operating system designed and developed for perfect harmony with System76 computers. Choose Pop! for a modern, beautiful, and powerful experience. #TryPopOS\n  A better processor makes everything faster, from opening apps to rendering video. All options are desktop-class 3rd Gen AMD Ryzen CPUs.\n   Ryzen 9 Pro 3900 (3.1 up to 4.3 GHz - 12 Cores - 24 Threads)\n  An M.2 SSD that stores your OS and applications. Choose a NVMe SSD for the best performance.\n Add another drive to store more files like large music, video, photo, or game libraries. Choose a NVMe SSD for the best performance.\n   Custom made with canvas, nylon, and other consciously-sourced materials from around the world. Handmade in San Francisco, CA.\n System76 products include lifetime support. Choose a longer warranty to protect your investment. Batteries are covered for one year.\n  We’ll send you a shipping label to donate your old computer to be responsibly recycled. Only available in the contiguous US.", "posttime": "2020-06-12 02:37:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amd,ryzen", "title": "这就是结局吗？System 76 Serwal-AMD和POP！_OS", "title_en": "Is this the endgame? System 76 Serwal – AMD and pop!_OS", "transed": 1, "url": "https://system76.com/laptops/serw12/configure", "via": "", "real_tags": ["amd", "ryzen"]}, {"category": "", "categoryclass": "", "imagename": "288617a3c7b4f8d226535fb806f796d0.png", "infoid": 1006173, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天Linux发行版评论的主题可能是独一无二的--据我们所知，Pop！_OS是第一个由硬件OEM制造商创建和维护的Linux发行版。至少，这是第一个有人认真对待的问题。\n该硬件制造商就是System76，可能是世界上最知名的纯Linux笔记本电脑制造商。一些较大的OEM在几个型号上提供Linux作为替代操作系统-但System76销售Linux系统，并且只销售Linux系统。\n在2017年之前，System76销售预装了Ubuntu Linux的系统。但是，当Canonical决定停止开发Unity桌面环境，转而使用Gnome3时，Canonical对该公司态度冷淡--而且，有争议的是，System76决定，它将创建和管理自己的Ubuntu派生发行版，而不是仅仅在现有的Ubuntu安装中添加自己的私有存储库和几个软件包。\n至关重要的是，新的发行版将不仅仅针对System76硬件。虽然该公司使用新的发行版来简化和保持对硬件设置的更多控制，但它将Pop！_OS设计为一个真正的发行版，适合-并鼓励在任何Linux PC上使用-无论是否从System76购买。\n自从2017年发布第一个版本以来，System76一直在吹嘘Pop！_OS为Linux带来了易用性和友好、开放的环境。这并没有给我太大的吹嘘，因为该公司是从Ubuntu开始的，Ubuntu被广泛认为是所有发行版中最新手友好的-但我错了。这无疑是我在四十年的计算机生涯中所见过的最诱人的操作系统安装过程。\nPop！_OS安装程序使用五颜六色的、卡通的黄金时代科幻比喻的重新想象来点亮安装程序。完成整个安装程序所需的页面不到10页，并且没有一个页面将超过50%的屏幕空间用于技术内容。最终的效果是隐含地让用户放心，嘿，这些东西很容易--没有理由被吓倒。\n尽管它很简短，而且在毫无意义的美观工作上投入了如此多的屏幕空间，但安装程序对技术人员也很友好。大的图形口音并不会让你很难在实际的技术细节中游刃有余。对于技术爱好者和系统管理员来说，这个安装程序使用了一个嵌入式的、主题为gparted的副本作为它的自定义分区程序，这对他们来说是一种特别好的体验。\n分区后，安装程序提供可选的驱动器加密，并很好地解释了加密的好处和潜在问题。当选择加密密码短语时，安装程序会警告用户密码太接近字典单词-例如，我尝试了Password1！并被警告不要这样做。更好的是，当我尝试一个长的但完全来自字典的密码短语-洋红色下面的第48个线轴-它并没有抱怨字典里的单词，没有大写，或者缺少数字或符号字符。\n安装程序完成并要求在创建新的用户配置文件之前重新启动，但向您保证，它将在重新启动后要求您创建一个。这样，您就可以为某人提供一台预装的即用PC，而不必求助于简单的变通方法，如名为Owner的默认配置文件。最后，虽然没有明显标记，但在&#34；Restart&34；旁边有一个奇怪的小按钮，它将显示安装控制台日志。\nUbuntu资深用户首先会注意到的是Pop！_OS-It上的控制台启动序列，这与用户在服务器(而不是桌面！)上使用的文本完全相同。安装了Ubuntu，但文本已显著放大，并以有趣/时髦的计算机正方形字体呈现。我们认为这比桌面Ubuntu决定将整个事情隐藏在一个空白的洋红色屏幕后面是一个更好的选择-非技术用户不会不安地怀疑事情是否真的在后台发生，而更多的技术用户也会获得有价值的诊断信息。\n启动后，第二个设置向导将引导您完成键盘检查、位置服务切换、时区设置、云服务集成，最后是用户设置。向导的用户创建部分警告用户弱密码，就像磁盘加密向导所做的那样-事实证明Hunter2并没有让它比Password1更快乐！做。我真的很喜欢Pop！_OS&#39；密码强度检查器-没有一个这样的检查器是完美的，但这个检查器比我以前用过的错误更少，更正确，可能会拯救相当多的用户。\n一旦你完成了第二个向导并放入实际的桌面，你就会看到一个看起来几乎像骨头一样的Gnome3桌面--启动器是隐藏的，黑色的全局顶部菜单栏是可见的，单击“活动”会隐藏桌面，并向你呈现一个堆满巨大图标的启动器。然而，外观可能具有欺骗性--尽管这个版本的Gnome3外壳看起来更接近于最初的版本，但它比Ubuntu的修改要严重得多。\n我唯一没有立即认出的是右上角的一个奇怪的小按钮，它看起来有点像Manjaro靴子的飞溅图标。单击此按钮将下拉一个菜单，通知您一些有用的键盘快捷键，并提供一个链接以允许您修改其余的键盘快捷键.。并切换平铺。等等，瓷砖？是啊。瓷砖。\n当您在小的下拉菜单中启用平铺时-在Retrospect中，它显示平铺桌面的图标-不会立即发生任何反应。但是，当您打开第二个应用程序时，第一个应用程序会缩小到屏幕宽度的一半，而第二个应用程序则紧挨着它。\n从这里开始，关于Pop！_OS&#39；平铺的一切都是直观和不言而喻的-如果您调整一个窗口的大小，它周围的其他窗口就会扩大或缩小以与之匹配。将窗口从桌面上的一个位置拖到另一个位置会重新排列磁贴，这真的没有什么意外之处。\n我要说的是，磁贴功能并不完全美观。理论上，您可以在瓷砖管理下拉菜单中设置窗口之间的间距，但实际上，它们经常不能准确地对齐或与间距一致。那种因为没有其他东西足够漂亮而拒绝使用Mac以外的任何东西的人，可能不会喜欢，甚至不能容忍Pop！_OS磁贴管理。对我们其他人来说，这很简单，而且很管用。\n我们不认为磁贴管理在配备两个或更多显示器的功能齐全的现代台式PC上非常有用，但对于一台简单的笔记本电脑来说，它可能很容易成为天赐之物，毕竟，这是System76销售的大部分产品。", "note_en": "The subject of today&#39;s Linux distro review is perhaps one of a kind—as far as we know, Pop!_OS is the first Linux distribution to be created and maintained by a hardware OEM manufacturer. At the very least, it&#39;s the first one anyone has taken seriously.\n That hardware manufacturer is  System76, probably the world&#39;s best-known Linux-only laptop manufacturer. Some larger OEMs offer Linux as an alternative operating system on a few models—but System76 sells Linux systems, and  only Linux systems.\n Until 2017, System76 sold its systems preinstalled with Ubuntu Linux. But Canonical left the company cold when it decided to stop development on its Unity desktop environment and move back to Gnome3—and, controversially, System76 decided that instead of merely adding its own private repository and a few packages to a stock Ubuntu install, it would create and manage its own Ubuntu-derived distribution.\n Crucially, the new distribution would not just be for System76 hardware. Although the company uses the new distro to simplify and retain more control over its hardware setup, it designed Pop!_OS to be a real distro suitable for use—and encouraged for use—on any Linux PC, whether purchased from System76 or not.\n     System76 has been bragging about Pop!_OS bringing ease of use and a friendly, open air to Linux ever since its first released version in 2017. This didn&#39;t strike me as much of a brag, given that the company was starting with Ubuntu, widely known as the noob-friendliest of all distros—but I was wrong. This is easily the most  inviting operating system installation procedure I&#39;ve ever seen in forty years of computing.\n The Pop!_OS installer uses colorful, cartoonish reimaginings of Golden Age sci-fi tropes to brighten up the installer. Fewer than ten pages are necessary to get through the entire installer, and no single page devotes more than 50 percent of its screen real estate to technical stuff. The net effect is to reassure the user implicitly that, hey, this stuff is easy—there&#39;s no reason to be intimidated.\n Despite its brevity—and devoting so much screen real estate to meaningless prettywork—the installer is friendly to technical people, too. The big graphic accents don&#39;t make it difficult to maneuver through the actual technical bits. In a particularly nice touch for technophiles and sysadmins, the installer uses an embedded, themed copy of  gparted for its custom partitioner.\n    After partitioning, the installer offers optional drive encryption and does a good job of explaining what the benefits and potential problems of that encryption might be. When selecting an encryption passphrase, the installer warns the user about passwords that are too close to dictionary words—for example, I tried  Password1! and was warned against it. Better yet, when I tried a long but entirely dictionary-derived passphrase— forty eighth bobbin under the magenta—it did  not complain about the dictionary words, the lack of capitalization, or the lack of numeric or symbolic characters.\n The installer finishes and asks to reboot before creating a new user profile but reassures you that it will ask you to create one after the reboot. This allows you to give someone a pre-installed, ready-to-go PC without having to resort to crude workarounds like a default profile named &#34;Owner.&#34; Finally, although it&#39;s not obviously labeled, there&#39;s an odd little button next to &#34;restart&#34; that will display the installation console log.\n     The first thing that will catch the eye of veteran Ubuntu users is the console boot sequence on Pop!_OS—it&#39;s the exact same text one might be used to from a server (not desktop!) installation of Ubuntu, but the text has been significantly enlarged and rendered in a fun/funky &#34;computer-y&#34; square font. We think this was a better choice than desktop Ubuntu&#39;s decision to just hide the whole thing behind a blank magenta screen—non-technical users aren&#39;t left wondering uneasily if things are actually happening in the background or not, and more technical users get valuable diagnostic information as well.\n Once booted, a second setup wizard leads you through keyboard review, location services toggle, timezone setup, cloud services integration, and finally user setup. The user creation portion of the wizard warns the user about weak passwords, much as the disk encryption wizard did—and it turns out  Hunter2 doesn&#39;t make it any happier than  Password1! did. I really like Pop!_OS&#39; password strength checker—no such checker is perfect, but this one gets less wrong and more right than I&#39;m used to and will probably save quite a few users from themselves.\n     Once you&#39;ve completed the second wizard and dropped into the actual desktop, you&#39;re looking at what appears to be an almost bone-stock Gnome3 desktop—the launcher is hidden, the black global top menu bar is visible, and clicking Activities hides the desktop and presents you with a launcher stocked with enormous icons. Appearances can be deceiving, however—this version of the Gnome3 shell is much more heavily modified than Ubuntu&#39;s, despite looking closer to the original.\n The only thing I didn&#39;t immediately recognize was an odd little button on the upper right that looks a bit like the Manjaro boot splash icon. Clicking this button drops down a menu informing you of a few useful keyboard shortcuts and offering a link to let you modify the rest of the keyboard shortcuts... and toggle tiling. Wait,  tiling? Yep. Tiling.\n  When you enable tiling in the little drop-down menu—which, in retrospect, shows an icon of a tiled desktop—nothing happens immediately. But when you open a second application, the first is shrunk to half the screen width, and the second is slapped next to it.\n From here, everything about Pop!_OS&#39; tiling is intuitive and self explanatory—if you resize one window, the others around it expand or shrink to match. Dragging a window from one place to another on the desktop will rearrange the tiles along with it, and there really aren&#39;t any surprises.\n I will say that the tile function isn&#39;t exactly beautiful. You can in theory set the gaps between windows in the tile management drop-down, but in practice, they frequently didn&#39;t line up exactly right or in accordance to the gap. The sort of person who refuses to use anything but a Mac because nothing else is pretty enough will probably  not like, or even be able to tolerate, the Pop!_OS tile management. For the rest of us, it&#39;s simple and it works.\n We don&#39;t think the tile management is very useful on a full, modern desktop PC with two or more monitors—but it could easily be a godsend on a simple laptop, which, after all, is the majority of what System76 sells.", "posttime": "2020-06-12 02:37:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,发行版,distro", "title": "Linux发行版回顾：System76的Pop_OS", "title_en": "Linux distro review: System76’s Pop _OS", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/06/linux-distro-review-system76s-ubuntu-based-pop_os/", "via": "", "real_tags": ["linux", "发行版", "distro"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006172, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "《LISP 2项目》出现在《IEEE计算史年鉴(开放获取)》2017年10月至12月的第三期期刊中。\n我第一次听说LISP 2是在1971年左右，那是在1966年的一篇会议论文中，这篇论文包括在加州大学伯克利分校高级编程语言研讨会的阅读材料中。LISP 2的目标是将ALGOL和FORTRAN等面向数字的语言的优点与LISP的符号功能结合起来。这篇论文详细描述了这种语言及其实现，但到了1971年，很明显，LISP 2并没有流行起来；相反，最初的LISP 1.5版本催生了各种方言，如BBN-LISP、MACLISP和Stanford LISP 1.6。\n在2005年左右，我开始了一个项目来归档LISP历史，并不断遇到参与LISP 2的人，包括Paul Abrahams，Jeff Barnett，Lowell Hawkinson，Michael Levin，Clark Weissman，Fred Blair，Warren Teitelman和Danny Bobrow。到2010年，我已经能够扫描属于Barnett、Herbert Stoyan和Clark Weissman的LISP 2文档和源代码。2012年，在一篇名为“哈罗德·V·麦金托什和他的学生：LISP逃离麻省理工学院”(Harold V.McIntosh and His How Students：LISP Effect MIT)的长篇博客文章中，我写了一篇关于霍金森和其他人的文章，之后我决定尝试讲述LISP 2项目的故事，在这个项目中，有这么多有趣的人。我的资料来源包括原始项目文件，以及对参与者的电话和电子邮件采访，几位参与者非常友好地提供了对多个草稿的反馈。我让这篇文章搁置了五年，但去年在年鉴上发表了另一则轶事后，编辑戴夫·沃尔登(Dave Walden)鼓励我提交这篇文章。\n2017年12月28日，就在文章即将付印之际，洛厄尔·霍金森突然死于一场意外。", "note_en": "“ The LISP 2 Project” appears in the  October-December 2017 issue of  IEEE Annals of the History of Computing (open access).\n I first heard about LISP 2 around 1971, from a  1966 conference paper included in the reading for a U.C. Berkeley seminar on advanced programming languages. The goal of LISP 2 was to combine the strengths of numerically-oriented languages such as ALGOL and FORTRAN with the symbolic capabilities of LISP. The paper described the language and its implementation at some length, but by 1971 it was pretty clear that LISP 2 had not caught on; instead, the original  LISP 1.5 had spawned a variety of dialects such as  BBN-LISP,  MACLISP, and  Stanford LISP 1.6.\n In  2005 I began a project to  archive LISP history  and kept encountering people who’d been involved with LISP 2, including Paul Abrahams, Jeff Barnett, Lowell Hawkinson, Michael Levin, Clark Weissman, Fred Blair, Warren Teitelman, and Danny Bobrow. By 2010 I had been able to scan  LISP 2 documents and source code belonging to  Barnett,  Herbert Stoyan, and Clark Weissman. In 2012, after writing about Hawkinson and others in an extended blog post “ Harold V. McIntosh and his students: Lisp escapes MIT,” I decided to try to tell the story of the LISP 2 project, where so many interesting people’s paths had crossed. My sources included original project documents as well as telephone and email interviews with participants, and several participants were kind enough to provide feedback on multiple drafts. I let the article sit in limbo for five years, but last year after I published  another anecdote in the  Annals, editor  Dave Walden encouraged me to submit this one.\n On December 28, 2017, as the article was about to go to press, Lowell Hawkinson  died suddenly from an accident.", "posttime": "2020-06-12 02:20:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "lisp2,lisp", "title": "Lisp2项目", "title_en": "The Lisp 2 Project", "transed": 1, "url": "https://mcjones.org/dustydecks/archives/2018/01/31/981/", "via": "", "real_tags": ["lisp2", "lisp"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006171, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Hamler是一种强类型语言，具有编译时类型检查和内置的并发和分发支持。\nHamler使各行各业能够构建下一代可扩展、可靠、实时的应用，特别是针对5G、物联网和边缘计算。\n近十年来，我们一直在开发基于Erlang/OTP的软件系统，特别是我们的主要产品EMQ X-可伸缩的开源MQTT代理。所以，我们一直相信二郎号是工程学的杰作。它具有惊人的并发性、分布性和容错性，是少数几个能够正确处理并发性和软实时的通用语言平台之一。\n不过，从所有写二郎的经验来看，我们相信以下功能可以帮助二郎程序员更好地适应即将到来的5G、IoT和边缘编程浪潮，吸引更多人使用BEAM。\n通过解析Hamler源代码生成CST，然后通过CST-&gt；AST-&gt；CoreFn的语法树转换、语法分析和类型检查生成CoreErlang的IR。然后，Erlang编译器使用该代码来生成最终的BEAM字节码。\nHamler 0.1编译器最初尝试基于GHC 8.10.1实现，但后来更改为适应Purescript编译器0.13.6的实现。\nHamler repl&&gt;；--列表、范围和枚举；[1，2，3]&gt；[1..10]&gt；[&#39；a&#39；.。&#39；z&#39；]&gt；将数据导入为地图&gt；--新地图&gt；m=#{&#34；foo&#34；=&gt；m=#{&#34；foo&#34；=&#34；bar&#34；=&&gt;；&#34；foo&#34；}&gt；--匹配地图&gt；#{&#34；foo&#34；：=a，&#34；bar&。：=b}=m&gt；--get，put&gt；Map.get&#34；foo&#34；m--a=&#34；bar&#34；&gt；Map.get&#34；m--b=&#34；foo&#34；&gt；m1=Map.put&#34；key&#34；&#34；val&#34；&-key，value&gt；key=。值=地图。值m。\nEMQ是一家开源软件公司，为5G时代的物联网应用提供高度可扩展的实时消息和流媒体平台。", "note_en": "Hamler is a strongly-typed language with compile-time typechecking and built-in support for concurrency and distribution.\n Hamler empowers industries to build the next generation of scalable, reliable, realtime applications, especially for 5G, IoT and edge computing.\n  For almost a decade, we have been developing software systems based on Erlang/OTP, especially our main product  EMQ X - the scalable open-source MQTT broker. So, we have always believed that Erlang is a masterpiece of engineering. With amazing concurrency, distribution and fault tolerance, it is one of the few general-purpose language platforms able to properly handle concurrency and soft realtime.\n However, from all the experience writing Erlang, we believe that the following features can help Erlang programmer better adapt to the coming wave of 5G, IoT and edge-programming and attract more people for using BEAM.\n      The Hamler source code is parsed to generate CST, then CoreErlang’s IR is generated after CST -&gt; AST -&gt; CoreFn’s syntax tree transformation, syntax analysis and type checking. The code is then used by the Erlang compiler to generate the final Beam bytecode.\n   The Hamler 0.1 compiler was initially attempted to be implemented based on the GHC 8.10.1, but was later changed to adapt from  Purescript Compiler 0.13.6’s implementation.\n    hamler repl &gt;  -- List, range and enums &gt;  [1,2,3] &gt;  [1..10] &gt;  [ &#39;a&#39;.. &#39;z&#39; ] &gt; import Data.Map as Map &gt;  -- New map &gt; m  =  #{&#34;foo&#34; =&gt; &#34;bar&#34;, &#34;bar&#34; =&gt; &#34;foo&#34;} &gt;  -- Match Map &gt;  #{&#34;foo&#34; := a, &#34;bar&#34; := b} = m &gt;  -- get, put &gt; Map.get  &#34;foo&#34; m  -- a  =  &#34;bar&#34; &gt; Map.get  &#34;bar&#34; m  -- b  =  &#34;foo&#34; &gt; m1  = Map.put  &#34;key&#34;  &#34;val&#34; &gt;  -- keys, values &gt; keys  = Map.keys m &gt; values  = Map.values m\n               EMQ is an open source software company providing highly-scalable, real-time messaging and streaming platform for IoT applications in 5G Era.", "posttime": "2020-06-12 02:19:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,编程语言,gt", "title": "哈姆勒编程语言", "title_en": "The Hamler Programming Language", "transed": 1, "url": "https://www.hamler-lang.org/", "via": "", "real_tags": ["编程", "编程语言", "gt"]}, {"category": "", "categoryclass": "", "imagename": "59f5d937570b5b372ac725cea83cafe2.jpg", "infoid": 1006170, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "联邦通信委员会(Federal Communications Commission)表示，它对SpaceX和其他低地球轨道(LEO)卫星供应商能否提供低于100ms的延迟表示严重怀疑。\n正如我们昨天报道的那样，FCC主席阿吉特·派(Ajit Pai)放弃了一项计划，该计划将完全阻止SpaceX和其他LEO公司作为低延迟提供商申请农村宽带资金。但FCC今天公布了全部订单，这表明SpaceX将很难说服欧盟委员会，其服务的延迟将低于FCC的100ms标准。\n联邦通信委员会命令的最终版本承认，与在更高海拔运行的地球静止卫星相比，LEO卫星具有固有的优势。联邦通信委员会的命令说，低地球轨道上的卫星不会受到与高轨道卫星相同的传播延迟限制。但该命令接着表示，联邦通信委员会严重怀疑任何近地轨道网络是否能够满足低延迟级别的简短申请要求，因此像SpaceX这样的小公司在申请低延迟提供商的资金时，很有可能被拒绝：\n打算使用低地球轨道卫星的服务提供商声称，由于卫星轨道的高度，他们的技术的延迟是由物理定律决定的。我们仍然怀疑卫星轨道的高度是卫星申请者是否有能力满足欧盟委员会的低延迟性能要求的唯一决定因素。正如评论者所解释的那样，特定技术的客户所经历的延迟不仅仅是传输中的一条链路的物理问题。卫星网络中的传播延迟并不单独考虑网络其他部分的延迟，例如处理、路由和将流量传输到其目的地。寻求使用低地球轨道卫星网络竞标低延迟提供商的短表格申请者将面临巨大挑战，向欧盟委员会工作人员证明，他们的网络可以向低于欧盟委员会100ms低延迟门槛的消费者提供真实世界的性能。\n如果SpaceX和类似的公司被拒绝进入低延迟类别，他们将在反向拍卖中处于劣势，该拍卖将在未来十年内每年从农村数字机会基金(RDOF)分配160亿美元。定于10月29日开始的拍卖将为ISP提供资金，以便在没有提供商提供至少25 Mbps下行和3 Mbps上行家庭互联网速度的人口普查区部署宽带。\nFCC在授予资金时将优先考虑低延迟网络，因此SpaceX和其他LEO提供商可能无法与地面网络竞争。如果卫星公司被归入联邦通信委员会(FCC)的高延迟类别，那么即使是DSL提供商在资金争夺战中也会比LEO网络更有优势。\nSpaceX公司辩称，FCC的怀疑是没有根据的，并告诉该机构的官员，其Starlink宽带系统轻松通过了委员会对低延迟服务的100ms门槛，即使包括不切实际的最坏情况下的处理时间。尽管海拔不是造成延迟的唯一因素，但SpaceX的高度(从540公里到570公里)只是延迟的一小部分。SpaceX首席执行官埃隆·马斯克(Elon Musk)表示，该公司的目标是延迟低于20ms，类似于有线互联网，并且足够低，足以支持竞争性的在线游戏。SpaceX将有机会在申请阶段向FCC详细说明自己的情况。\n对于SpaceX来说，时机是问题的一部分。SpaceX已经发射了大约480颗卫星，但尚未提供商业服务，各公司必须在7月15日之前提交拍卖申请。拥有商业服务将使SpaceX更容易说服FCC相信其服务是低延迟的。被归入高延迟类别并不会完全让SpaceX和其他LEO提供商无法获得资金，但至少可能会减少他们获得的金额。\nStarLink的网站上说，这家由SpaceX运营的ISP计划于2020年在美国北部和加拿大部署服务，到2021年迅速扩大到人口稠密世界的全球覆盖范围。\n另外，LEO卫星提供商被禁止在FCC拍卖中申请成为千兆位提供商，尽管DSL和固定无线ISP将有机会证明他们可以提供千兆位速度。联邦通信委员会的命令称，虽然使用这些技术的千兆位速度还没有在商业上广泛获得，但使用这些技术的服务提供商越来越多地报告说，他们部署了能够提供这些技术的网络。就像SpaceX在低延迟类别中一样，DSL和固定无线提供商在尝试进入千兆类别时将面临很高的门槛：\n虽然申请人如有意使用固定无线或数码用户线路技术来履行其拍卖904的公众利益义务，将获准在其申请中选择千兆性能级别，但这些申请人要说服选管会人员相信他们合理地有能力履行农村地区的公共利益义务，从而有资格竞投千兆性能级别，将面临沉重的负担。特别是对于DSL服务，如果没有主要依赖于光纤的混合方法，我们预计使用DSL技术的申请人将无法证明其能够合理地提供满足千兆性能等级公共利益义务的服务。\nFCC表示，固定无线提供商将不得不考虑距离限制、频段属性、信道带宽要求、回程和中途要求、塔楼选址要求、容量限制、所需的上游速度、所需的最低月度使用限额，以及记录中提出的其他问题。最终，联邦通信委员会表示，它预计相对较少的固定无线和DSL技术将能够满足千兆性能级别投标的简短要求。", "note_en": "The Federal Communications Commission said it has &#34;serious doubts&#34; that SpaceX and other low-Earth orbit (LEO) satellite providers will be able to deliver latencies of less than 100ms.\n As we  reported yesterday, FCC Chairman Ajit Pai backed off a plan that would have  completely prevented SpaceX and other LEO companies from applying for rural-broadband funding as low-latency providers. But the FCC&#39;s  full order was released today and suggests that SpaceX will have a tough time convincing the commission that its service will deliver latencies below the FCC standard of 100ms.\n The final version of the FCC order acknowledges that LEO satellites have &#34;intrinsic advantages&#34; over geostationary satellites that operate at much higher altitudes. &#34;Satellites in low-Earth orbit are not subject to the same propagation latency limitations as higher orbiting satellites,&#34; the FCC order said. But the order goes on to say the FCC has &#34;serious doubts that any low-Earth orbit networks will be able to meet the short-form application requirements for bidding in the low-latency tier&#34; and that companies like SpaceX thus face a high chance of being rejected when they apply for funding as low-latency providers:\n Service providers that intend to use low-Earth orbit satellites claim that the latency of their technology is &#34;dictated by the laws of physics&#34; due to the altitude of the satellite&#39;s orbit. We remain skeptical that the altitude of a satellite&#39;s orbit is the sole determinant of a satellite applicant&#39;s ability to meet the Commission&#39;s low-latency performance requirements. As commenters have explained, the latency experienced by customers of a specific technology is not merely a matter of the physics of one link in the transmission. Propagation delay in a satellite network does not alone account for latency in other parts of the network such as processing, routing, and transporting traffic to its destination. Short-form applicants seeking to bid as a low-latency provider using low-Earth orbit satellite networks will face a substantial challenge demonstrating to Commission staff that their networks can deliver real-world performance to consumers below the Commission&#39;s 100ms low-latency threshold.\n  If SpaceX and similar companies are rejected from the low-latency category, they will be at a disadvantage in a reverse auction that will distribute $16 billion—$1.6 billion yearly, over ten years—from the Rural Digital Opportunity Fund (RDOF). The auction, scheduled to begin on October 29, will give ISPs funding to deploy broadband in census blocks where no provider offers home-Internet speeds of at least 25Mbps downstream and 3Mbps upstream.\n The FCC will prioritize low-latency networks when awarding funding, so SpaceX and other LEO providers could come up short against terrestrial networks. Even DSL providers would have an advantage over LEO networks in funding battles if the satellite companies are placed in the FCC&#39;s high-latency category.\n SpaceX has argued that the FCC&#39;s skepticism is unwarranted,  telling agency officials that its Starlink broadband system &#34;easily clears the commission&#39;s 100ms threshold for low-latency services, even including its &#39;processing time&#39; during unrealistic worst-case scenarios.&#34; While altitude isn&#39;t the only factor in latency, SpaceX&#39;s altitudes, ranging from 540km to 570km, are a fraction of the 35,000km used with geostationary satellites. SpaceX CEO Elon Musk has  said the company is aiming for latency below 20ms, similar to cable Internet and low enough to support competitive online gaming. SpaceX will have a chance to make its case in detail to the FCC during the application stage.\n The timing is part of the problem for SpaceX. The company has launched about 480 satellites but isn&#39;t offering commercial service yet, and companies have to submit applications for the auction by July 15. Having a commercial service available would make it easier for SpaceX to convince the FCC that its service is low-latency. Getting placed in the high-latency category wouldn&#39;t completely shut SpaceX and other LEO providers out of funding, but it would likely at least reduce the amount they get.\n Starlink&#39;s  website says the SpaceX-operated ISP plans to deploy &#34;service in the Northern US and Canada in 2020, rapidly expanding to near global coverage of the populated world by 2021.&#34;\n  Separately, LEO satellite providers are forbidden from applying as gigabit providers in the FCC auction, even though DSL and fixed-wireless ISPs will be given a chance to demonstrate that they can provide gigabit speeds. While gigabit speeds &#34;are not commercially available on a widespread basis using these technologies, service providers using these technologies have increasingly reported deploying networks capable&#34; of providing them, the FCC order said. Like SpaceX in the low-latency category, DSL and fixed-wireless providers will face a high bar in attempts to enter the gigabit category:\n While an applicant will be permitted to  select the Gigabit performance tier in its application if it intends to use fixed wireless or DSL technologies for meeting its Auction 904 public interest obligations, such applicants face a high burden to persuade Commission staff that they are reasonably capable of meeting the public interest obligations in rural areas and thus qualified to bid for the Gigabit performance tier. Particularly for DSL services, we do not anticipate that an applicant using DSL technologies would be able to demonstrate that it is reasonably capable of offering a service that meets the Gigabit performance tier public interest obligations absent a hybrid approach that relies mostly on fiber.\n Fixed-wireless providers will have to account for &#34;distance limitations, spectrum bands attributes, channel bandwidths requirements, backhaul and medium haul requirements, tower siting requirements, capacity constraints, required upstream speeds, required minimum monthly usage allowances, and other issues raised in the record,&#34; the FCC said. Ultimately, the FCC said it expects that &#34;relatively few fixed wireless and DSL technologies will be able to meet the short-form requirements for bidding in the Gigabit performance tier.&#34;", "posttime": "2020-06-12 02:19:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "竞标,faces,延迟", "title": "SpaceX在竞标农村宽带资金时在FCC面临很高的门槛", "title_en": "SpaceX faces high bar at FCC in bid for rural-broadband funding", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/06/fcc-has-serious-doubts-that-spacex-can-deliver-latencies-under-100ms/", "via": "", "real_tags": ["竞标", "faces", "延迟"]}, {"category": "", "categoryclass": "", "imagename": "f25c06fe15e4cb308cce6c8a87dad025.jpg", "infoid": 1006169, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天上午，有人似乎在将比特币的弟弟加密货币以太(ETH)从一个数字钱包转移到另一个数字钱包时犯了一个错误。毕竟，当交易价值134美元的数字货币时，似乎几乎没有人会故意支付260万美元的费用-但这正是发生的事情。\n这就对了。有人支付了10,668.73185 ETH，当时价值约260万美元，将0.55 ETH从一个钱包转移到另一个钱包。这笔交易，在所有痛苦的荣耀中，都可以在Etherscan上看到-Etherscan是一种查看和搜索ETH交易的工具。\n虽然互联网喜欢好的阴谋，Twitter上的许多人都在猜测，这是某种精心策划的洗钱形式的证据，但可能有一个简单得多的解释：一个错误。\nEtherum用户可以指定他们的交易条款，设置他们想要发送的ETH金额和他们愿意支付的费用金额。这种想法认为，费用越高，他们的交易就越有可能被包括在下一个区块-也就是说，它会更快地完成。这是可能的，因此，有人试图发送价值260万美元的ETH与134美元的费用，并简单地颠倒了这两个领域。\n当然，我们谈论的是加密货币，所以某种令人费解的骗局总是有可能的。然而，这并不是第一次在一笔本来很小的交易上支付异常高额的费用。2019年2月，有人不小心支付了2100 ETH的费用来移动.1 ETH。\nCoinDesk当时报道，错误背后的韩国区块链公司承认了错误，联系了受益的矿池，并达成了一项协议，该公司获得了意外发送的ETH的一半返还。值得注意的是，这种部分圆满的结局100%依赖于矿池的商誉，因为ETH交易在设计上是不可逆转的。\n这一次是这样吗？目前公开的信息是不可能确切知道的，但不管是哪种情况，下次你发短信或犯令人尴尬的打字错误时都要记住，情况可能会更糟。差不多，260万美元更差。", "note_en": "Someone appears to have made a mistake this morning when transferring the cryptocurrency  ether (ETH), the younger sibling to bitcoin, from one digital wallet to another. After all, when moving around $134 dollars worth of digital currency, it hardly seems like anyone would intentionally pay a $2.6 million fee — and yet that&#39;s exactly what happened.\n That&#39;s right. Someone paid 10,668.73185 ETH, worth approximately $2.6 million at the time, to move 0 .55 ETH from one wallet to another. The transaction, in all its painful glory, is  visible on Etherscan — a tool for viewing and searching ETH transactions.\n    While the internet loves a good conspiracy, and many on Twitter are speculating that this is evidence of some elaborate form of money laundering, a much simpler explanation is likely: a mistake.\n Ethereum users can dictate the terms of their transactions, setting both the amount of ETH they want to send and the amount of fees they are willing to pay. The higher the fee, the thinking goes, the more likely their transaction will be included on the next block — i.e. it will go through more quickly. It&#39;s possible, therefore, that someone attempted to send $2.6 million worth of ETH with $134 in fees and simply reversed the two fields.\n   Of course, we are talking about cryptocurrency, so some kind of  convoluted scam is always a possibility. However, this wouldn&#39;t be the first time that an unusually large fee has been paid on an otherwise small transaction. In February of 2019, someone accidentally  paid 2,100 ETH in fees to move .1 ETH.\n Coindesk reported at the time that the South Korean blockchain firm behind the error admitted to the mistake, contacted the mining pool that had benefitted, and worked out a deal where the firm got half of the accidentally sent ETH returned. Notably, that partial happy ending 100 percent relied on the goodwill of the mining pool, as ETH transactions are non-reversible by design.\n  Is that what happened this time around? It&#39;s impossible to know for sure with the information that&#39;s publicly available at the moment, but either way, the next time you fat-finger a text message or make an embarrassing typo just keep in mind that it could be worse. Like, $2.6 million worse.", "posttime": "2020-06-12 02:01:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "转移,fees,eth", "title": "有人支付了260万美元的费用来转移价值134美元的加密货币", "title_en": "Someone paid $2.6M in fees to move $134 worth of cryptocurrency", "transed": 1, "url": "https://mashable.com/article/million-cryptocurrency-ethereum-fee-paid-by-mistake/", "via": "", "real_tags": ["转移", "fees", "eth"]}]