[{"category": "", "categoryclass": "", "imagename": "6a62b5124ac1ebccc878da504d110602.jpg", "infoid": 1003105, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2019年7月，有争议的G2A Marketplace背后的G2A公司提出向独立审计师开放其交易历史。其目标是澄清其在多年来被指控帮助促进赃物销售后的任何不当行为。只有一家开发商接受了他们的报价。现在G2A将自愿向他们支付近4万美元。\n在其众多业务线中，波兰人拥有的、总部位于香港的G2A经营着一个店面，来自世界各地的用户可以在这里销售游戏密钥。它将这项服务与亚马逊和eBay等零售商相提并论。多年来，各种规模的开发商都抱怨说，G2A市场允许出售赃物。这种情况导致了现实世界中开发商和G2A员工之间的大声比赛和质问。\n2019年，G2A提出了它声称的大胆提议，承诺在其市场上出售的任何以欺诈方式获得的游戏密钥的价值都是10倍。只有一个问题：开发人员必须与G2A和独立审计师合作。只有一家公司，捷克的独立开发商WUBE Software-Factorio的制造商-签署了该计划。G2A当时告诉Polygon，它打算聘请普华永道(Pricewaterhouse Coopers)、安永(Ernst&amp；Young)、毕马威(KMPG)或德勤(Deloitte)进行审计。\n不幸的是，根据周三发布的一篇博客文章，G2A无法与这些大公司达成协议，只能自己进行审计。\n“WUBE向G2A报告了一份它认为在网上非法出售的321把钥匙的名单，”G2A在博客文章中说。“在评估了多家独立审计公司后，发现没有一家符合我们同意的要求，WUBE和G2A决定G2A应继续进行内部调查。这项调查证实，在2016年3月至2016年6月期间，WUBE的198把钥匙通过其Marketplace出售。\n因此，GamesIndustry.biz报道说，G2A已经向WUBE支付了39600美元，正如承诺的那样，这是有问题的全价游戏密钥价值的10倍。\n在其帖子中，G2A不接受允许非法获得的密钥出售的指责。\nG2A在这篇博客文章中称：“当我们推出这一报价时，我们想向博彩界发出一个明确的信息，那就是欺诈行为伤害了各方。”正如我们在本博客中阐明的那样，欺诈直接伤害了购买非法钥匙的个人，它伤害了游戏开发商，最终伤害了G2A，因为作为交易促进者，我们被迫支付与销售相关的成本。我们想要放大这一信息，吸引人们的注意。“\n它接着补充说，展望未来，它现在承诺全额补偿开发商“通过G2A Marketplace出售的任何密钥，如果他们能够证明自己是非法的”所产生的任何费用。\nG2A的一位发言人表示：“我们将是第一个承认，在我们作为一家公司的形成时期，我们花了太长时间才意识到少数人在滥用我们的市场。”“然而，我们收到的批评给我们敲响了警钟，在过去的几年里，我们一直致力于解决我们网站上的任何欺诈事件。今天，我们使用了数字产品在线市场中一些最复杂的专有反欺诈人工智能技术。“", "note_en": "In July 2019, G2A, the company behind the controversial  G2A Marketplace, offered to open its transaction history to  an independent auditor. The goal was to clear its name of any wrongdoing after years of accusations it helps facilitate the sale of stolen goods. Only a single developer took them up on the offer. Now G2A will voluntarily pay them  nearly $40,000.\n Among its many lines of business, the Polish-owned and Hong Kong-based G2A runs a storefront where users from around the world can sell game keys. It likens that service to retailers like Amazon and eBay. Developers of all sizes have complained for years that the G2A Marketplace allows for the sale of stolen goods. The situation has led to  shouting matches and heckling between developers and G2A employees in the real world.\n In 2019, G2A made what it claimed to be a bold offer, promising 10 times the value of any fraudulently obtained game keys sold on its marketplace. There was only one catch: Developers  had to work with G2A and an independent auditor. Only one company, Czech-based independent developer Wube Software — makers of  Factorio — signed on to the program. G2A  told Polygon at the time that it intended to use either PricewaterhouseCoopers, Ernst &amp; Young, KMPG or Deloitte to perform the audit.\n Unfortunately, according to  a blog post issued on Wednesday, G2A couldn’t come to terms with those large firms and just did the audit themselves.\n “Wube reported to G2A a list of 321 keys that it believed had been sold online illegitimately,” G2A said in the blog post. “After assessing a number of independent auditing companies and finding none that would meet our agreed requirements, Wube and G2A decided that G2A should proceed with an internal investigation. This investigation confirmed that 198 of Wube’s keys had been sold via its Marketplace between March 2016 — June 2016.”\n As a result, GamesIndustry.biz  reports that G2A has paid out $39,600 to Wube, which is — as promised — 10 times the value of the full-price game keys in question.\n In its post, G2A accepts no blame for allowing the illegally obtained keys to be sold.\n “When we launched this offer, we wanted to send a clear message to the gaming community that fraud hurts all parties,” G2A said in the blog post. “As we spell out in this blog, fraud directly hurts individuals who buy illegitimate keys, it hurts gaming developers and it ultimately hurts G2A because we are forced — as the transaction facilitator — to cover costs related to the sale. We wanted to amplify that message and capture people’s attention.”\n It went on to add that, going forward, it is now committed to compensating developers in full for any fees incurred “for any keys sold via G2A Marketplace, if they are able to prove they were illegitimate.”\n  “We would be the first to admit that, in our formative years as a company, we took too long to recognize that a small number of individuals were abusing our Marketplace,” said a G2A spokesperson. “However, the criticism we received was the wake-up call we needed, and over the last years we have been totally committed to tackling any incidents of fraud on our site. Today we use some of the most sophisticated proprietary anti-fraud AI technology of any online marketplace for digital products.”", "posttime": "2020-05-21 19:48:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,开发,pays,g2a", "title": "G2A向Factorio开发商支付39,600美元，超过非法获得的游戏密钥", "title_en": "G2A pays Factorio developer $39,600 over illegally obtained game keys", "transed": 1, "url": "https://www.polygon.com/2020/5/20/21265275/g2a-confirms-it-sold-stolen-game-keys", "via": "", "real_tags": ["游戏", "开发", "pays", "g2a"]}, {"category": "", "categoryclass": "", "imagename": "1371b10bb560bfeaec056e20f066d2bb.png", "infoid": 1003104, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这意味着你可以自由复制和分享这些漫画(但不能出售它们)。更多细节。", "note_en": "This means you&#39;re free to copy and share these comics (but not to sell them).  More details.", "posttime": "2020-05-21 19:04:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电影,记号,分享", "title": "英语字母表中第二十四个字母 / X 记号 / 成人电影 / 未知数", "title_en": "X", "transed": 1, "url": "https://xkcd.com/2309/", "via": "", "real_tags": ["电影", "记号", "分享"]}, {"category": "", "categoryclass": "", "imagename": "87a2caae38e1b7d5d5d364d3ce7baa60.png", "infoid": 1003103, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，戴尔宣布对其办公室(Latitude)和专业工作站(Precision)产品线中的几款笔记本电脑进行更新，包括设计更改、规格提升和其他待命改进。\n戴尔在其关于新笔记本电脑的新闻稿中比往常更关注可持续性，并指出其使用了回收材料和可持续包装。但在很大程度上，重点放在规格颠簸和小的设计演变上。\n戴尔上周宣布对其XPS系列笔记本电脑进行类似的更新；XPS系列更侧重于个人使用，重点放在内容创作上。Precision机器也是关于内容创作的，但它们配备了工作站级的图形和其他针对专业使用案例的功能。\n著名的Precision工作站笔记本电脑系列专为密集图形处理、数据分析和CAD建模而设计，与早期型号相比，由于挡板减少，戴尔声称Precision 5550和5750是目前市场上最小的15英寸和17英寸移动工作站。\n我们不会在这里用一把尺子来检查每一台竞争对手的笔记本电脑，但这些铝制机器至少在这方面看起来确实是设计超前的。这两款机型都带有戴尔InfinityEdge品牌，与XPS机型相同。这意味着近边缘到边缘的显示器在每一面都有相等比例的最小边框。\n就规格而言，5000系列Precision笔记本电脑一如预期提供第10代英特尔CPU，具有酷睿i5、酷睿i7、酷睿i9和至强(W-10855M)选项，核数从4个一直到8个。RAM的时钟频率为2933 MHz，有8 GB、16 GB、32 GB和64 GB四种配置可供选择。\nPrecision 5550提供NVIDIA Quadro T1000和T2000工作站显卡选项(均带4 GB GDDR6)。5750去掉了T1000，但增加了NVIDIA Quadro RTX 3000选项和6 GB GDDR6。两者都提供英特尔超高清显卡。与它们的XPS表亲一样，它们可以配置4K或全高清屏幕(在这种情况下，最大亮度为500nits)，并具有Wi-Fi 6和蓝牙5.0，以及迅雷3和USB-C端口。5550或5750都可以配置一系列M.2存储选项，从256 GB到2TB不等。\n在Latitude方面，与其说高端性能是关注点，不如说是时尚的设计和便携性。这个有25年历史的品牌在整个产品线上都进行了更新和刷新。这意味着要对十几种产品进行更改，因此我们不会在这里详细介绍所有这些更改(您可以在戴尔的网站上找到所有更改)。\n旗舰机型为高端Latitude 9410和9510，配备14英寸和15英寸显示屏。这些也采用了最小边框的设计，但显示屏只有1080p，而不是4K。我们正在考虑高达16 GB的2133 MHz内存、酷睿i7 CPU、固态硬盘和一些大容量电池选项。正如商务旅行者对笔记本电脑的期待一样，电池续航时间是宣传的一个重要部分；戴尔声称，9510最大的电池选项可提供长达34小时的电池续航时间。对于上述旅行者来说，同样重要的是：除了Wi-Fi 6，这些笔记本电脑还提供高通(Qualcomm)的LTE移动宽带选项。9510提供5G移动宽带，而9410仅限于4G。\n9510重3.1磅，配备了一系列麦克风，旨在让视频会议成为一种尽可能愉快的体验。它有两个可转换的2合1版本和一个经典的翻盖。2合1的重量稍微多一点：3.3磅。9410是一款360度铰链装备的敞篷车，电池续航时间长达27小时，载重3磅。\n值得注意的是，价格稍低的7310和7410 Latitude笔记本电脑已经转向焊接RAM，这对于希望随着时间的推移升级企业用户笔记本电脑的IT经理来说并不是什么好消息。\n戴尔还更新了面向企业客户的各种产品线中的许多其他机器(除了这里提到的那些)，包括上述产品以及OptiPlex台式机塔架和一体机。在大多数情况下，我们主要关注规格更新。", "note_en": "Today, Dell announced updates to several laptops in its office (Latitude) and professional workstation (Precision) product lines, with design changes, spec bumps, and other improvements on tap.\n Dell focused more than usual on sustainability in its press release on the new laptops, noting its use of recycled materials and sustainable packaging. But for the most part, the focus is on specs bumps and small design evolutions.\n Dell announced similar updates  to its XPS line of laptops last week; the XPS line is focused more on personal use, with an emphasis on content creation. The Precision machines are also all about content creation, but they&#39;re equipped with workstation-class graphics and other features aimed at professional use cases.\n  The storied  Precision line of workstation laptops is designed for &#34;intensive graphics processing, data analysis, and CAD modeling,&#34; and thanks to bezel reductions compared to earlier models, Dell claims the  Precision 5550 and 5750 are the smallest 15-inch and 17-inch mobile workstations on the market right now.\n We&#39;re not going to go over every competing laptop with a ruler right here, but these aluminum machines do seem design-forward in that regard, at least. Both models carry Dell&#39;s &#34;InfinityEdge&#34; branding, the same that was applied to the XPS machines. That means near-edge-to-edge displays with equally proportioned, minimal bezels on each side.\n Specs-wise, the 5000-series Precision laptops offer 10th-generation Intel CPUs as expected, with Core i5, Core i7, Core i9, and Xeon (W-10855M) options, with core counts from four all the way up to eight. RAM clocks in at 2933MHz and is available in 8, 16, 32, and 64GB configurations.\n The Precision 5550 offers Nvidia Quadro T1000 and T2000 workstation graphics options (both with 4GB GDDR6). The 5750 drops the T1000 but adds an Nvidia Quadro RTX 3000 option with 6GB of GDDR6. Both offer Intel UHD graphics as well. As with their XPS cousins, they can be configured with either 4K or FullHD screens (maximum of 500 nits of brightness in this case) and feature Wi-Fi 6 and Bluetooth 5.0, as well as Thunderbolt 3 and USB-C ports. Either the 5550 or 5750 can be configured with a range of M.2 storage options, from 256GB up to 2TB.\n  On the Latitude side, high-end performance isn&#39;t the focus so much as sleek design and portability. The 25-year-old brand saw updates and refreshes across the entire product line. That means changes to more than a dozen products, so we won&#39;t get into all of them here (you can find them all  on Dell&#39;s website).\n The flagships are the  high-end Latitude 9410 and  9510, with 14- and 15-inch displays. These, too, adopt a minimal-bezel design, but the displays are only available in 1080p, not 4K. We&#39;re looking at up to 16GB of 2133Mhz RAM, Core i7 CPUs, SSDs, and some large-ish battery options. As one would expect in laptops for business travelers, battery life is a big part of the pitch; Dell claims up to 34 hours of battery life from the biggest battery option on the 9510. Also key for said travelers: these laptops offer LTE mobile broadband options from Qualcomm in addition to Wi-Fi 6. While the 9510 offers 5G mobile broadband, the 9410 is limited to 4G.\n The 9510 weighs 3.1 pounds and comes with an array of microphones intended to make video conferencing as pleasant an experience as it can be. It&#39;s available in both a convertible 2-in-1 version and a classic clamshell. The 2-in-1 weighs a little more: 3.3 pounds. The 9410 is a 360-degree-hinge-equipped convertible that offers up to 27 hours of battery life and a 3-pound carry weight.\n It&#39;s worth noting that the  slightly-lower-down-the-pricing-scale 7310 and  7410 Latitude laptops have moved to soldered RAM, which isn&#39;t great news for IT managers looking to upgrade business users&#39; laptops over time.\n Dell also updated a number of other machines (besides those mentioned here) in its various product lines for business customers, including those above and its OptiPlex desktop towers and all-in-ones. In most cases, we&#39;re mainly looking at specs refreshes.", "posttime": "2020-05-21 19:04:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电脑,推出,launched,笔记本电脑", "title": "戴尔推出了Latitude、Precision商用笔记本电脑系列的全面更新", "title_en": "Dell launched sweeping update of its Latitude, Precision business laptop lines", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/05/dell-launched-sweeping-update-of-its-latitude-precision-business-laptop-lines/", "via": "", "real_tags": ["电脑", "推出", "launched", "笔记本电脑"]}, {"category": "", "categoryclass": "", "imagename": "4a20b43dbba3bea3b12af2cb046fe026.jpg", "infoid": 1003102, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们在Check Point Research工作的每个研究项目的目标之一是深入了解软件是如何工作的：它们包含哪些组件？他们脆弱吗？攻击者如何利用这些漏洞？更重要的是，我们如何防范此类攻击？\n在我们最新的研究中，我们创建了一种名为“安全链接”的安全机制，以保护malloc()的单链表不被攻击者篡改。我们成功地向核心开源库的维护者介绍了我们的方法，现在它已经集成到最常见的标准库实现中：glibc(Linux)，以及其流行的嵌入式对应产品：uClibc-NG。\n需要注意的是，安全链接并不是阻止所有针对现代堆实现的攻击尝试的灵丹妙药。然而，这是朝着正确方向又迈出了一步。根据我们过去的经验，这种特定的缓解将阻止我们多年来演示的几个主要漏洞，从而将“损坏”的软件产品变成“无法利用”的产品。\n从二进制攻击的早期开始，堆内部数据结构就一直是攻击者的主要目标。通过了解堆的malloc()和free()的工作方式，攻击者能够利用堆缓冲区中的初始漏洞(如线性缓冲区溢出)进入更强大的利用原语(如任意写入)。\n这方面的一个例子在2001年的PhRack文章中有详细介绍：Vudo Malloc Tricks。本文探讨了多个堆实现的内部结构，并描述了现在所说的“不安全-取消链接”。修改双向链表的FD和BK指针(例如，小仓)的攻击者可以使用unlink()操作触发任意写入，从而在目标程序上实现代码执行。\n事实上，2005年的glibc版本2.3.6嵌入了一个称为“安全解除链接”的已知漏洞原语的修复。这个优雅的修复在从列表取消链接之前验证双链接节点的完整性，如图1所示：\n虽然这个利用原语在15年前就被阻止了，但当时还没有人提出类似的解决方案来保护单链表的指针。利用这一弱点，攻击者将他们的注意力转移到这些未受保护的单链表上，如Fast-bins和TCache(线程缓存)。破坏单个链表使得攻击者能够获得任意Malloc原语，即任意内存地址中的小型受控分配。\n在本文中，我们将弥合这一存在了近20年的安全差距，并展示如何创建一种安全机制来保护单链表。\n在我们深入到安全链接的设计之前，让我们回顾一个针对易受攻击的Fast-Bins的示例攻击。对这类开发技术有丰富经验的读者可以直接跳到介绍安全链接的部分。\n在对智能灯泡黑客攻击的研究中，我们发现了一个基于堆的缓冲区溢出漏洞：CVE-2020-6007。通过对此严重漏洞的攻击过程，我们说明了攻击者如何利用Fast-Bins的无保护单链表将基于堆的线性缓冲区溢出转换为更强大的任意写入。\n在我们的测试用例中，堆是一个简单的dlmalloc实现，或者更具体地说，是编译成32位版本的uClibc(MicroLibC)的“malloc标准”实现。图2显示了此堆实现使用的元数据：\n分配和使用缓冲区时，前两个字段存储在用户的数据缓冲区之前。\n当释放缓冲区并将其放入Fast-Bin时，也会使用第三个字段，并指向Fast-Bin的链表中的下一个节点。此字段位于用户缓冲区的前4个字节。\n当缓冲区被释放并且没有放在快速入库中时，第三个和第四个字段都用作双向链表的一部分。这些字段位于用户缓冲区的前8个字节。\n快速存储箱是由各种大小的“存储箱”组成的数组，每个存储箱都有一个特定大小的块的单链接列表。最小bin大小包含最大0x10字节的缓冲区，NEXT包含0x11到0x18字节的缓冲区，依此类推。\n在不深入细节的情况下，我们的漏洞会给我们带来一个小型的、但可控的、基于堆的缓冲区溢出。我们的总体计划是溢出位于快速回收站中的相邻空闲缓冲区。图3显示了溢出之前的缓冲区外观：\n图4：我们的溢出修改了释放的缓冲区的Size和PTR字段(以红色显示)。\n使用我们的溢出，我们修改了我们希望是Fast-Bin记录的单链接指针。通过将此指针更改为我们自己的任意地址，我们可以触发堆，使其认为新释放的块现在存储在那里。图5显示了Fast-Bin的损坏的单链表，就像它在堆中显示的那样：\n通过触发与相关Fast-Bin匹配的大小的分配序列，我们获得Malloc-WHERE原语。关于构建完整的代码执行漏洞的其余技术细节，以及Lightbulb研究的全部内容，将在未来的博客文章中发布。\n注意：你们中的一些人可能会说我们获得的Malloc-where原语是受约束的，因为虚拟的“Free Chunk”应该以与当前Fast-Bin的大小字段匹配的大小字段开始。然而，这个额外的验证检查只在glibc中实现，uClibc-NG中没有。因此，我们对我们的Malloc没有任何限制-在那里是原始的。\n在完成灯泡研究后，在36C3开始之前，我还有一些时间，我的计划是解决最近CTF比赛中的一些棋子挑战。相反，我发现自己又在思考最近开发的漏洞。近十年来，我一直在以相同的方式利用基于堆的缓冲区溢出，总是以堆中的单链接列表为目标。即使在CTF挑战中，我仍然将重点放在TCache的易受攻击的单链表上。当然，有一些方法可以减轻这种流行的利用原始漏洞。\n这就是安全链接概念的由来。安全链接利用地址空间布局随机化(ASLR)中的随机性(目前在大多数现代操作系统中大量部署)来“签署”列表的指针。当与块对齐完整性检查结合使用时，这种新技术可以保护指针免受劫持尝试。\n重要的是要注意，我们的攻击者不知道堆的位置，因为ASLR随机化了堆的基地址和mmap_base(下一节将详细介绍此主题)。\n我们的解决方案提高了门槛，阻止了攻击者基于堆的攻击企图。一旦部署，攻击者必须具有堆泄漏/指针泄漏形式的附加功能。我们保护的一个示例场景是位置相关的二进制文件(加载时没有ASLR)，它在解析传入的用户输入时会出现堆溢出。这就是我们之前在灯泡研究中展示的例子中的情况。\n到目前为止，攻击者能够在没有任何堆泄漏的情况下攻击这些目标，并且仅通过仅依赖于二进制文件的固定地址来对堆的分配进行最小程度的控制。当我们将堆分配重定向到目标二进制文件中的固定地址时，我们可以阻止此类利用尝试，并利用堆的ASLR获得随机性。\nrndbit在32位Linux计算机上默认为8，在64位计算机上默认为28。\n我们将存储单链表指针的地址表示为L。我们现在定义以下计算：\n根据上面所示的ASLR公式，移位将存储器地址的第一个随机位定位在掩码的LSBit处。\n这就引出了我们的保护计划。我们用P表示单链表指针，该方案如下所示：\n#DEFINE PROTECT_PTR(pos，ptr，type)。#定义PROTECT_PTR(pos，ptr，type)。\\r定义PROTECT_PTR(pos，ptr，type)。#DEFINE_PRORECT_PTR(pos，ptr，type)#定义PROTECT_PTR(pos，ptr，type)。#定义PROTECT_PTR(pos，ptr，type)。\\r定义PROTECT_PTR(pos，ptr，type)。\n这样，来自地址L的随机位被放置在存储的受保护指针的LSB之上，如图6所示：\n图6：掩码指针P‘被随机位覆盖，如红色所示。\n此保护层可防止攻击者在不知道随机ASLR位(以红色显示)的情况下将指针修改为受控值。\n然而，如果你注意了，你就会很容易地看到，我们在安全解除链接机制方面处于劣势。虽然攻击者无法正确劫持指针，但我们也受到限制，因为我们无法检查是否发生了指针修改。这是进行额外检查的地方。\n堆中所有分配的块都与已知的固定偏移量对齐，该偏移量在32位机器上通常为8字节，在64位机器上通常为16字节。通过检查每个显示的()指针是否相应地对齐，我们添加了两个重要的层：\n在64位计算机上，此统计保护会导致攻击尝试失败，每16次中有15次失败。如果我们回到图6，我们可以看到受保护指针的值以半字节0x3结束，这意味着攻击者必须在他的溢出中使用值0x3，否则他将损坏该值并使对齐检查失败。\n即使就其本身而言，这种对齐检查也可以防止已知的利用漏洞原语，例如本文描述如何将Fast-Bin指向malloc()挂钩以立即获得代码执行的利用原语。\n附注：在英特尔CPU上，glibc仍然在32位和64位架构上使用0x10字节对齐，这与我们刚才描述的常见情况不同。这意味着，对于glibc，我们在32位上提供了增强的保护，并且可以从统计上阻止16次攻击尝试中的15次。\n图7显示了我们提交给glibc的初始补丁的片段：\n图7：发送到glibc的补丁初始版本的示例代码片段。\n虽然补丁已经清除，但我们仍然可以看到，保护glibc的TCache所需的代码修改很小，而且很简单。这就把我们带到了下一个部分，基准测试。\n基准测试显示，对于free()，添加的代码总计为2-3条ASM指令，对于malloc()，添加的代码总计为3-4条ASM指令。在glibc上，这一变化可以忽略不计，即使将10亿(！)。GCP中单个vCPU上的malloc()/free()操作。测试在64位版本的库上运行。以下是在同一GCP服务器上对大小为128(0x80)字节的缓冲区运行glibc的基准测试malloc-Simple后的结果：\n每次测试的较快结果以粗体标记。正如我们所看到的，结果几乎是一样的，而且在一半的测试中，打补丁的版本速度更快，这真的没有什么意义。这通常意味着服务器上的噪音级别远远高于添加的功能对整体结果的实际影响。或者简而言之，这意味着我们的新功能增加的开销可以忽略不计，这是个好消息。\n再举一个例子，对tcmalloc(Gpertools)基准测试影响最大的是1.5%的开销，而平均只有0.02%。\n该保护仅使用L和P，它们在指针需要被保护()或显示()时都存在。\n需要注意的是，Fast-bin和TCache都使用单链表来保存数据，这一点在glibc的文档中有详细介绍。它们只支持PUT/GET API，没有公共功能遍历整个列表并保持其完好无损。虽然确实存在这样的功能，但它仅用于收集malloc统计信息(Mallinfo)，因此访问单链接指针所增加的开销可以忽略不计。\n对齐检查减少了攻击面，并要求Fast-Bin或TCache块指向对齐的内存地址。如上所述，这将直接阻止已知的利用漏洞变体。\n就像安全解除链接(对于双向链表)一样，我们的保护依赖于这样一个事实，即攻击者不知道合法的堆指针是什么样子。在双向链表方案中，攻击者可以伪造内存结构，并且知道有效的堆指针是什么样子，可以成功地伪造有效的FD/BK指针对，该指针对不会触发任意写入原语，但允许在攻击者控制的地址处使用块。\n在单链表方案中，由于保护层依赖于从部署的ASLR继承的随机性，没有指针泄漏的攻击者将无法完全控制被覆盖的指针。建议的page_shift将随机位直接放在存储指针的第一位上。与对齐检查一起，这将在统计上阻止攻击者更改存储的单链接指针的最低位/字节(小端)。\n我们的目的是将安全链接合并到实现各种包含单链接列表的堆的领先开放源码中。一个这样的实现是Google的tcmalloc(Thread-Cache Malloc)，当时它只是作为gpertools存储库的一部分开源的。在将我们的补丁提交给gpertools之前，我们决定先看看Chromium的Git库，以防他们使用不同版本的tcmalloc。事实证明，他们确实做到了。\nChrome的tcmalloc看起来像是基于gpertool的2.0版本。\n在2020年2月，在我们已经向所有开放源码提交补丁之后，Google发布了官方的TCMalloc GitHub存储库，这与之前的两个实现都不同。\n在检查Chromium的版本时，我们看到他们的TCache现在不仅基于双链表(现在称为FL，代表自由列表)，而不是单链表(最初称为SLL)，他们还添加了一个称为MaskPtr()的特殊函数。仔细查看2012年的问题，会发现以下代码片段：\ninline void*MaskPtr(void*p){0//最大化ASLR熵并保证结果为无效地址。(const uintptr_t掩码=~(reinterpret_cast&lt；uintptr_t&gt；(TCMalloc_SystemAlloc)(reinterpret_cast&lt；void*&gt；(reinterpret_cast&lt；uintptr_t&gt；(p)&gt；&gt；13)；(返回掩码^)；}。\n该代码与我们的Protected_ptr实现非常相似。此外，该补丁的作者特别提到，“这里的目标是防止利用漏洞的自由列表攻击。”\n看起来Chromium的安全团队引入了他们自己版本的安全链接到Chromium的tcmalloc，他们在8年前就这样做了，这是相当令人印象深刻的。\n通过检查它们的代码，我们可以看到它们的掩码基于来自代码段(TCMalloc_Systemalloc)的(随机值)指针，而不是我们实现中使用的堆位置。此外，它们将地址移位硬编码值13，并且还反转其掩码的位。因为我们找不到他们设计选择的文档，所以我们可以从代码中读到使用位反转来保证结果是无效地址。\n通过阅读他们的日志，我们还了解到，他们估计此功能的性能开销不到2%。\n与我们的设计相比，Chromium的实现意味着额外的内存引用(对代码函数)和额外的位翻转ASM指令。不仅如此，它们的指针屏蔽是在没有额外对齐检查的情况下使用的，因此代码无法在不使进程崩溃的情况下提前捕获指针修改。\n我们实现并测试了补丁，以成功地将建议的缓解集成到最新版本的glibc(Ptmalloc)、uClibc-NG(Dlmalloc)、gPertools(Tcmalloc)以及后来的Google全新TCMalloc中。此外，我们还向Chromium的开发团队指出了我们提交给gpertools的安全链接版本，希望我们的一些特定于gperftools的性能提升能够应用到Chromium的版本中。\n当我们开始研究安全链接时，我们相信将安全链接集成到这3个(现在是4个)占主导地位的库中将导致其他库更广泛地采用，无论是在开放源码社区中还是在行业中的封闭源码软件中。自2012年以来，基本版本的安全链接已经嵌入到Chromium中，这一事实证明了该解决方案的成熟性。\n以下是在撰写本文时的集成结果。\n状态：已集成。将于2020年8月发布2.32版。激活：默认情况下打开。GNU的glibc项目的维护人员非常合作，反应非常灵敏。主要的障碍是签署法律文件，允许我们作为公司的员工将GPL许可的源代码捐赠给GNU的存储库。一旦我们解决了这个问题，过程就非常顺利，最新版本的补丁已提交到库中，准备包含在即将到来的版本中。\n我们要感谢Glibc的维护人员在整个过程中的合作。他们愿意将“默认开启”的安全特性集成到他们的项目中，这令人暖心，特别是与我们最初的期望相比，以及与我们从其他存储库收到的响应相比。\n状态：版本v1.0.33发布。激活：默认情况下打开。向uClibc-NG提交我们的特性非常容易，并且它立即集成到这个提交中。我们可以自豪地说，安全链接已经作为uClibc-NG版本v1.0.33的一部分发布了。如果我们回到我们对智能灯泡的研究，这个功能会阻止我们的攻击，并迫使我们在产品中发现一个额外的漏洞。\n我们要再次感谢uClibc-NG的维护者在这一过程中的合作。\n状态：正在整合中。激活：默认关闭。尽管我们早些时候提到了Chromium的MaskPtr()功能，自2012年开始使用，但这一功能并没有出现在tcmalloc的两个公共版本中。因此，我们碰碰运气，提交了指向gpertools的tcmalloc实现的安全链接。\n由于gpertools存储库的复杂状态，既然Google的官方TCMalloc存储库是公开的，这个过程正在取得进展，但进展缓慢。在2020年1月初的拉取请求中，您可以看到我们为将此功能集成到存储库中所做的努力。最初的反应是我们害怕的：我们的功能“毁了性能”。提醒一下，当使用存储库的基准测试套件时，最坏的结果是1.5%的开销，平均只有0.02%。\n最后，带着一些不情愿，我们决定将这一功能添加为“默认关闭”，希望有一天有人会自动激活这一功能。这个功能还没有合并，但我们希望在不久的将来会合并。\n我们仍然要感谢该项目的唯一维护人员，他提供了所有必要的管道，以便允许用户选择启用安全链接的配置选项。\n状态：已拒绝。激活：不适用。在此拉取请求中，我们向TCMalloc提交了我们的补丁，遗憾的是，该请求立即被拒绝。我们再一次听说，“这样做的性能成本太高，无法合并”，他们甚至不会将其作为“默认关闭”的可配置功能进行集成：“虽然是宏保护，但它添加了另一个需要构建和定期测试的配置，以确保一切都能正常工作。”我们找不到任何来自Google的代表来帮助我们解决与存储库维护人员的冲突，所以我们让它保持原样。\n不幸的是，它看起来像是Google最常见的malloc()实现，大多数C/C++都使用它\n..", "note_en": "One of our goals for every research project we work on in Check Point Research is to get an intimate understanding of how software work: What components do they contain? Are they vulnerable? How can attackers exploit these vulnerabilities? And more importantly, how can we protect against such attacks?\n In our latest research, we created a security mechanism, called “Safe-Linking”, to protect  malloc()’s single-linked lists from tampering by an attacker. We  successfully pitched our approach to maintainers of core open-source libraries, and it is now  integrated into the most common standard library implementation:  glibc (Linux), and its popular embedded counterpart:  uClibc-NG.\n It is important to note that Safe-Linking is not a magic bullet that will stop all exploit attempts against modern-day heap implementations. However, this is another step in the right direction. From our past experience, this specific mitigation would have blocked several major exploits that we demonstrated throughout the years, thus turning “broken” software products to ones that are “unexploitable.”\n  From the early days of binary exploitation, the heap internal data structures have been a prime target for attackers. By understanding the way the heap’s  malloc() and  free() work, attackers were able to leverage an initial vulnerability in a heap buffer, such as a linear buffer overflow, into a stronger exploit primitive such as an Arbitrary-Write.\n An example of this is detailed in the Phrack article from 2001:  Vudo Malloc Tricks. This article explores the internals of multiple heap implementations, and describes what is now called “Unsafe-Unlinking.” Attackers that modify the  FD and  BK pointers of double-linked lists (such as the Small-Bins, for example) can use the  unlink() operation to trigger an Arbitrary-Write, and thus achieve code execution over the target program.\n And indeed, glibc version 2.3.6 from 2005 embedded a fix to this known exploit primitive called “Safe-Unlinking.” This elegant fix verifies the integrity of the double-linked node before unlinking it from the list, as can be seen in Figure 1:\n  While this exploit primitive was blocked more than 15 years ago, at the time no one came up with a similar solution to protect the pointers of the single-linked lists. Leveraging this weak spot, attackers shifted their focus to these unprotected single-linked lists such as Fast-Bins and also TCache (Thread Cache). Corrupting the single linked-list allows the attacker to gain an Arbitrary-Malloc primitive, i.e. a small controlled allocation in an arbitrary memory address.\n In this article, we close this almost 20 year old security gap and show how we created a security mechanism to protect single-linked lists.\n Before we dive into the design of Safe-Linking, let’s review a sample exploitation that targets the vulnerable Fast-Bins. Readers with a lot of experience in such exploitation techniques should feel free to skip ahead to the section,  Introducing Safe-Linking.\n  During our research on hacking smart lightbulbs, we found a heap-based buffer overflow vulnerability:  CVE-2020-6007. Through the exploitation process of this high-severity vulnerability, we illustrate how attackers leverage the Fast-Bins’ unprotected single-linked lists to transform a heap-based linear buffer overflow into a much more powerful Arbitrary-Write.\n In our test case, the heap is a simple  dlmalloc implementation, or more specifically, the “malloc-standard” implementation of  uClibc (micro LibC), compiled to a 32bit version. Figure 2 shows the meta-data used by this heap implementation:\n   When a buffer is allocated and used, the first two fields are stored  before the user’s data buffer.\n When the buffer is freed and placed in a Fast-Bin, the third field is also used and points to the next node in the Fast-Bin’s linked list. This field is located at the first 4 bytes of the user’s buffer.\n When the buffer is freed and isn’t placed in a Fast-Bin, both the third and fourth fields are used as part of the doubly-linked list. These fields are located at the first 8 bytes of the user’s buffer.\n The Fast-Bins are an array of various sized “bins”, each holding a single-linked list of chunks up to a specific size. The minimal bin size contains buffers up to 0x10 bytes, the next holds buffers of 0x11 to 0x18 bytes, and so on.\n  Without diving into specifics, our vulnerability gives us a small, yet controllable, heap-based buffer overflow. Our master plan is to overflow an adjacent free buffer that is located in a Fast-Bin. Figure 3 shows how the buffers look  before our overflow:\n     Figure 4: Our overflow modified the  size and  ptr fields of the freed buffer (shown in  red).\n Using our overflow, we modify what we hope is the single-linked pointer of a Fast-Bin record. By changing this pointer to our own arbitrary address, we can trigger the heap into thinking that a new freed chunk is now stored there. Figure 5 shows the Fast-Bin’s corrupt single-linked list, as it appears to the heap:\n  By triggering a sequence of allocations of the size which matches that of the relevant Fast-Bin, we gain a Malloc-Where primitive. The rest of the technical details on constructing a full code execution exploit, as well as the lightbulb research in full, will be released in a future blog post.\n Note: Some of you might say that the Malloc-Where primitive we gained is constrained, as the dummy “Free Chunk” should begin with a size field that matches that of the current Fast-Bin. However, this additional verification check was only implemented in glibc, and is missing from uClibc-NG. Therefore, we have no limitations whatsoever for our Malloc-Where primitive.\n  After finishing the lightbulbs research, I had some time to spare before 36C3 began, and my plan was to solve some pwn challenges from recent CTF competitions. Instead, I found myself thinking again about the recently developed exploit. I’ve been exploiting heap-based buffer overflows the same way for almost a decade, always targeting a single-linked list in the heap. Even in the CTF challenges, I still focused on the vulnerable single-linked lists of the TCache. Surely there is some way to mitigate this popular exploit primitive.\n And this is how the concept of Safe-Linking arose. Safe-Linking makes use of randomness from the Address Space Layout Randomization (ASLR), now heavily deployed in most modern operating systems, to “sign” the list’s pointers. When combined with chunk alignment integrity checks, this new technique protects the pointers from hijacking attempts.\n      It’s important to note that our attacker doesn’t know where the heap is located, as the heap’s base address is randomized together with the  mmap_base by the ASLR (more on this topic in the next section).\n Our solution raises the bar and blocks our attacker’s heap-based exploit attempts. Once deployed, attackers must have an additional capability in the form of heap-leak / pointer-leak. An example scenario for our protection is a position-dependent binary (loads without ASLR) that has a heap overflow when parsing incoming user input. This was exactly the case in the example we’ve shown before in the lightbulb research.\n Until now, an attacker was able to exploit such targets without any heap leak, and with only minimal control over the heap’s allocations, by depending solely on the fixed addresses of the binary. We can block such exploit attempts, and leverage the heap’s ASLR to gain randomness when we redirect heap allocations to fixed addresses in the target binaries.\n    rndbit defaults to 8 on 32 bit Linux machines, and 28 on 64 bit machines.\n We denote the address in which the single-linked list pointer is stored as  L. We now define the following calculation:\n  According to the ASLR formula shown above, the shift positions the first random bits from the memory address right at the LSBit of the mask.\n This leads us to our protection scheme. We denote the single-linked list pointer with  P and this is how the scheme looks:\n   #define PROTECT_PTR(pos, ptr, type)  \\\r        ((type)((((size_t)pos) &gt;&gt; PAGE_SHIFT) ^ ((size_t)ptr)))\r\r#define REVEAL_PTR(pos, ptr, type)   \\\r        PROTECT_PTR(pos, ptr, type)\n This way, the random bits from the address  L are placed on top of the LSB of the stored protected pointer, as can be seen in Figure 6:\n Figure 6: The masked pointer  P’ is covered with random bits, as shown in  red.\n This protection layer prevents an attacker without the knowledge of the random ASLR bits (shown in  red) from modifying the pointer to a controlled value.\n However, if you paid attention, you can easily see that we are at a disadvantage against the Safe-Unlinking mechanism. While the attacker can’t properly hijack the pointer, we are also limited as we can’t check if a pointer modification occurred. This is where an additional check takes place.\n All allocated chunks in the heap are aligned to a known fixed offset which is usually 8 bytes on 32 bit machines, and 16 on 64 bit machines. By checking that each  reveal()ed pointer is aligned accordingly, we add two important layers:\n  On 64 bit machines, this statistical protection causes an attack attempt to fail 15 out of 16 times. If we go back to Figure 6, we can see that the value of the protected pointer ends with the nibble 0x3, meaning that an attacker must use the value 0x3 in his overflow, or else he will corrupt the value and fail the alignment check.\n Even on its own, this alignment check prevents known exploit primitives, such as the one described in this  article that describes how to point the Fast-Bin at the  malloc() hook to immediately gain code execution.\n Side Note: On intel CPUs, glibc still uses an alignment of 0x10 bytes on both 32 bits  and 64 bits architectures, unlike the common case we just described above. This means that for glibc, we provide enhanced protection on 32 bits, and can statistically block 15 out of 16 attacks attempts.\n  Figure 7 shows a snippet from the initial patch that we’ve submitted to glibc:\n Figure 7: Example code snippet from the initial version of our patch, as sent to glibc.\n While the patch was since cleaned, we can still see that the required code modification for protecting glibc’s TCache is small and simple. Which brings us to the next section, benchmarking.\n  Benchmarking showed that the added code sums up to 2-3 asm instructions for  free() and 3-4 asm instructions for  malloc(). On glibc, the change was negligible and wasn’t measurable even when summing up  1 billion (!)  malloc()/ free() operations on a single vCPU in GCP. The tests were run on a 64 bit version of the library. Here are the results after running glibc’s benchmarking test  malloc-simple on buffers of size 128 (0x80) bytes on the same GCP server:\n  The faster results for each test are marked in  bold. As we can see, the results are pretty much the same, and in half of the tests the patched version was  faster, which doesn’t really make sense. This usually means that the noise level on the server is way higher than the actual impact of the added feature on the overall results. Or in short, it means that the added overhead from our new feature is negligible, and that’s good news.\n As another example, the worst impact on tcmalloc’s ( gperftools) benchmarking tests was an overhead of 1.5%, while the average was only 0.02%.\n  The protection uses only  L and  P which are both present at the time the pointer needs to be  protect()ed or  reveal()ed.\n It is important to note, and is detailed in glibc’s documentation, that both the Fast-Bins and the TCache use single-linked lists to  hold data. They only support the put/get API, and no common functionality traverses the entire list and keeps it intact. While such functionality does exist, it is only used for gathering malloc statistics ( mallinfo), and so the added overhead for accessing the single-linked pointer is negligible.\n  The alignment check reduces the attack surface and mandates that a Fast-Bin or a TCache chunk points to an aligned memory address. This directly blocks known exploit variants, as mentioned above.\n Just like Safe-Unlinking (for double-linked lists), our protection relies on the fact that the attacker doesn’t know what legitimate heap pointers look like. In the double-linked list scenario, an attacker that can forge a memory struct, and knows what a valid heap pointer looks like, can successfully forge a valid  FD/ BK pair of pointers that won’t trigger an Arbitrary-Write primitive, but allows a chunk at an attacker-controlled address.\n In the single-linked list scenario, an attacker  without a pointer leak won’t be able to fully control an overridden pointer, due to the protection layer that relies on the randomness inherited from the deployed ASLR. The proposed  PAGE_SHIFT places the random bits right over the first bit of the stored pointer. Together with the alignment check, this statistically blocks attackers from changing even the lowest bit / byte (Little Endian) of the stored single-linked pointer.\n  Our intent was to merge Safe-Linking into the leading open sources that implement each kind of heap that contain single-linked lists. One such implementation is tcmalloc (Thread-Cache Malloc) by Google, which, at the time, was only open-sourced as part of the  gperftools repository. Before submitting our patch to gperftools, we decided to have a look at Chromium’s Git repository, just in case they might use a different version of tcmalloc. Which, as it turns out, they did.\n  Chromium’s tcmalloc looks as if it is based on gperftool’s 2.0 version.\n In February 2020, after we already submitted patches to all of the open sources, Google released an official  TCMalloc GitHub repository, which differs from both prior implementations.\n While examining Chromium’s version, we saw that not only is their TCache now based on double-linked lists (now called  FL, for Free List) and not a single-linked list (originally called  SLL), they also added a peculiar function called  MaskPtr(). A closer look at their  issue from 2012 showed the following code snippet:\n inline void* MaskPtr(void* p) {\r  // Maximize ASLR entropy and guarantee the result is an invalid address.\r  const uintptr_t mask =\r      ~(reinterpret_cast&lt;uintptr_t&gt;(TCMalloc_SystemAlloc) &gt;&gt; 13);\r  return reinterpret_cast&lt;void*&gt;(reinterpret_cast&lt;uintptr_t&gt;(p) ^ mask);\r}\n The code is remarkably similar to our  PROTECT_PTR implementation. In addition, the authors of this patch specifically mentioned that, “The goal here is to prevent freelist spraying in exploits.”\n It looks like Chromium’s security team introduced their own version of Safe-Linking to Chromium’s tcmalloc, and they did it 8 years ago, which is quite impressive.\n From examining their code, we can see that their mask is based on a (random valued) pointer from the code section ( TCMalloc_SystemAlloc), and not a heap location as is used in our implementation. In addition, they shift the address by the hard coded value 13, and also invert the bits of their mask. As we failed to find the documentation for their design choices, we can read from the code that the bit inversion is used to guarantee the result is an invalid address.\n From reading their logs, we also learned that they estimated the performance overhead of this feature as less than 2%.\n Compared to our design, Chromium’s implementation implies an additional memory reference (to the code function) and an additional asm instruction for the bit flipping. Not only that, their pointer masking is used without the additional alignment check, and therefore the code can’t catch a pointer modification in advance without crashing the process.\n  We implemented and tested the patches for successfully integrating the proposed mitigation to the latest versions of glibc ( ptmalloc), uClibc-NG ( dlmalloc), gperftools ( tcmalloc) and later, Google’s brand-new TCMalloc. In addition, we also pointed Chromium’s development team to our version of Safe-Linking as was submitted to gperftools, in the hope that some of our gperftools-specific performance boosts will find their way into Chromium’s version.\n When we started working on Safe-Linking, we believed that integrating Safe-Linking to these 3 (now 4) dominant libraries will lead to a wider adoption by other libraries, both in the open source community and in closed source software in the industry. The fact that a basic version of Safe-Linking was already embedded into Chromium since 2012 proves the maturity of this solution.\n Here are the integration results, as they are at the time of writing this blog post.\n  Status: Integrated. Will be released in version 2.32 in August 2020.  Activation: On by default. The maintainers of GNU’s glibc project were very cooperative and responsive. The main hurdle was signing the legal documents that will allow us, as employees in a corporation, to donate GPL-licensed source code to GNU’s repository. Once we overcame this issue, the process was really smooth, and the latest version of our patch was  committed to the library, ready to be included in the upcoming version.\n We would like to thank the maintainers of glibc for their cooperation throughout this entire process. Their willingness to integrate an “on by default” security feature into their project was heart-warming, especially when compared to our initial expectations, and to the response we received from other repositories.\n  Status: Released in version  v1.0.33.  Activation: On by default. Submitting our feature to uClibc-NG was very easy, and it was integrated right away in this  commit. We can proudly say that Safe-Linking is already released as part of uClibc-NG version  v1.0.33. If we go back to our research on smart lightbulbs, this feature would have blocked our exploit and would have forced us to find an additional vulnerability in the product.\n Once again, we want to thank the maintainers of uClibc-NG for their cooperation in this process.\n  Status: Undergoing integration.  Activation: Off by default. Although we earlier mentioned Chromium’s  MaskPtr() functionality, available since 2012, this feature didn’t find its way to either of the public versions of tcmalloc. And so, we tried our luck in submitting Safe-Linking to gperftools’s implementation of tcmalloc.\n Due to the complex status of the gperftools repository, now that Google’s official TCMalloc repository is public, this process was making progress, but slowly. In this  pull request from the beginning of January 2020, you can see our efforts to integrate this feature into the repository. The initial response was the one we dreaded: our feature “ruins performance.” As a reminder, when using the repository’s benchmarking suite, the worst case result was an overhead of 1.5%, and the average was only 0.02%.\n Eventually, with some reluctance, we settled on adding this feature as “off by default”, hoping that someday someone will activate this feature on its own. This feature wasn’t merged yet, but we hope that it will be in the near future.\n We would still like to thank the sole maintainer of this project, who offered to do all of the necessary plumbing so as to allow users the configuration option to enable Safe-Linking.\n  Status: Rejected.  Activation: N/A. We submitted our patch to TCMalloc in this  pull request, which, sadly, was rejected right away. Once again, we heard, “The performance costs of this are too high to merge”, and that they are not going to integrate it even as an “off by default” configurable feature: “While macro-protected, it adds another configuration that needs to be built and regularly tested to ensure everything stays working.” We couldn’t find any representative from Google that would help us resolve this conflict with the maintainers of the repository, and we left it as is.\n Unfortunately, it looks like Google’s most common implementation of  malloc(), which is used in most of their C/C+\n......", "posttime": "2020-05-21 18:19:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "漏洞,缓解,linking,指针", "title": "安全链接-新的malloc()缓解关闭了十年前的利用漏洞原语", "title_en": "Safe-Linking – New malloc() mitigation closes a decade old exploit primitive", "transed": 1, "url": "https://research.checkpoint.com/2020/safe-linking-eliminating-a-20-year-old-malloc-exploit-primitive/", "via": "", "real_tags": ["漏洞", "缓解", "linking", "指针"]}, {"category": "", "categoryclass": "", "imagename": "6f27184a1f3800946822e5d353923f1a.jpeg", "infoid": 1003101, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个关于从从事绝密项目的不知情的JavaScript开发人员那里提取Codez的复杂但不太有用的方法的故事。\n最近有几篇关于网站滥用WebSocket功能对用户的计算机进行端口扫描的文章出现在这些网站上。例如：https://nullsweep.com/why-is-this-website-port-scanning-me/.。\n这些技术之所以有效，是因为浏览器允许来自公共来源的WebSocket打开到本地主机的WebSockets连接，而不需要太多保护。\n这让我开始思考。我知道流行的JavaScript框架在开发中使用WebSockets在内容更改时自动重新加载页面。恶意网站会窃听该流量，并找出开发人员何时保存他们的代码吗？\n要么设置，要么向前端开发人员经常使用的热门站点注入广告恶意软件。让我们说http://frontend-overflowstack.com/。\n在此页面上，添加尝试打开公共端口的WebSockets连接的代码(扫描10k端口大约需要一秒钟，因此您可以在此相当慷慨)。\n如果页面设法打开了一个连接，请使其保持打开状态，并将收到的所有消息转发到您的恶意秘密数据库。\n我在http://frontend-overflowstack.com/.上托管了一个非常简单的页面。加载后，它会尝试将网络插座连接到访问者计算机上2000到10000之间的每个端口(除了Firefox不允许的几个端口)。如果端口连接，则它会侦听该端口并输出收到的任何消息。此页面不保存或以其他方式传输任何捕获的数据，它仅临时显示在屏幕上。\n如果此页上出现任何输出，则实际恶意的站点可以很容易地将该输出发送到它想要的任何服务器。\n要测试这个概念，我们需要一个使用热重新加载的简单Web服务器。这是我能想到的最简单的方法：\n它在运行时会在端口3000上启动服务器，在端口9856上启动WebSocket服务器，并每隔5秒向任何连接的WebSocket客户端发送消息：RELOAD。\n因此，front end-overflowstack.com直接窃听本地开发服务器向我的本地浏览器发送的重新加载消息。\n在这个阶段，可以坐下来兴高采烈地计算每个访问我们站点的访问者对他们的本地JavaScript代码进行了多少次更改，但是我们能用这个来获取更多信息吗？\n现在的大多数前端开发似乎都涉及到使用REACTION，通常这涉及到运行webpack开发的服务器，该服务器包括它自己的、更花哨的Web套接字接口。\n此服务器通过其Web套接字共享更多数据，但只有一点点有趣。演示这一点非常简单，只需调用Create-Reaction-app：\n一旦有更多的数据被显示，我们就会得到哈希和状态消息，所有无用的信息。\n但是，当开发人员输入错误时会发生什么呢？webpack开发服务器通过其WebSocket连接，很有帮助地尝试将大量调试和堆栈信息发送到开发人员的屏幕上。\n现在事情变得更有趣了。我们有代码片段，文件路径，位置，各种有用的信息。\n如果最终开发人员意外地在包含有用数据的行上输入错误，情况会更好：\n现在，我们已经获得了此开发人员的AWS开发人员凭据的副本。快点，启动比特币矿工！\n没有某种形式的图表，任何技术设计都是不完整的。下面是它的工作原理，用图表表示：\n(为了简化图表，我省略了正在运行的本地Web服务器，并假装WebSocket服务器直接从编辑器内部发起)。\n某些浏览器选项卡上的恶意网页会以静默方式连接到用户计算机上打开的WebSocket。当敏感数据通过该套接字发送时(来自期望通过仅本地通道进行通信的进程)，网站可以接收该消息数据，并将其转发到任何外部数据库。\n说真的，这个攻击媒介是相当微不足道的。您必须引诱不知情的用户访问您的站点，并在他们开发JS代码时停留在该站点上。\n然后，你必须等待幸运地从他们的编码错误中收集到一些数据，也许才能找到一个可以让你从这些数据中获利的机会。\n然而，我们已经看到各个站点已经在使用WebSocket端口扫描技术，而没有引起一般开发人员的注意。由于JS工具往往使用少量的知名端口，因此编写脚本来巧妙地渗透Reaction Dev流量并不是特别困难。\n想象一下，一个为Twitbook工作的内部开发人员只是在他们的编辑器中按了SAVE，导致访问令牌或内部服务器地址泄露给了错误的用户。\n这有点吓人的方面是，一个合理的开发人员应该有一个普遍的期望，即在他们选择的代码编辑器中按下保存应该没有有效地导致数据泄漏到第三方Web服务的可能性。这次袭击增加了这种可能性，足以让人有点担心。\n我试图拦截JavaScript热重载机制，因为这确实是我熟悉的WebSockets的唯一通用用法。不和谐也使用WebSockets，但匆匆一瞥并没有产生任何明显的结果，因为该频道的设计考虑到了公共互联网。\n令人担忧的是，仅仅这一个用于重新加载的单向通信通道的简单用例就将如此多的潜在信息暴露给了不好的网站。\n考虑到这一点，WebSockets的其他用途(对于不是为公共互联网设计的数据)可能会受到类似的危害。\n可以说，webpack开发的服务器应该进行一些身份验证，或者使用替代的浏览器通信通道进行热重新加载(我相信出于其他原因，这已经在计划中了)。\n浏览器/Web标准为WebSocket实现源码策略的方式确实令人惊讶，并导致专为本地开发而设计的软件以一种不理想的方式暴露在公共互联网上。", "note_en": "This is a story of a convoluted, not-very-useful method for extracting codez from unwitting JavaScript developers working on top secret projects.\n A couple of articles have hit the sites recently about websites abusing websocket functionality to port-scan user’s computers’. For example:  https://nullsweep.com/why-is-this-website-port-scanning-me/.\n  The reason these techniques work is because browsers allow websockets from public origins to open websockets connections to localhost without many protections.\n This got me thinking. I know that popular JavaScript frameworks use websockets in development to automatically reload pages when content changes. Could a malicious website eaves-drop on that traffic, and find out when developers are saving their code?\n   Either set-up, or inject advertising malware into a popular site that front-end developers tend to frequent. Let’s say  http://frontend-overflowstack.com/\n On this page, add code that tries to open websockets connections to common ports (scanning 10k ports takes a second or so, so you can be quite generous here)\n If the page manages to open a connection, hold it open, and forward all messages received to your secret database of nefariousness.\n  I’ve hosted a very simple page at:  http://frontend-overflowstack.com/. On load, it tries to connect a websocket to every port between 2,000 and 10,000 on the visitors computer (barring a few that Firefox doesn’t allow). If a port connects, then it listens to that port and outputs any messages received.  This page does not save or otherwise transmit any captured data, it is only displayed temporarily on screen.\n If any output appears on this page, an actually malicious site could easily send that output to any server it wants.\n  To test this concept out, we need a simple web server that uses hot-reloading. This is the simplest I could come up with:\n  Which, when run, starts up a server on port 3000, a websocket server on port 9856, and sends a message:  reload to any connected websocket clients every 5 seconds.\n   So frontend-overflowstack.com is directly eaves-dropping on reload messages being sent by a local dev server to my local browser.\n At this stage, it’s possible to sit back and gleefully count how many times each visitor to our site makes changes to their local JavaScript code, but can we use this to get more info?\n  The majority of front-end development these days seems to involve using React, and typically this involves running the  webpack-dev server, which includes its own, more fancy web-socket interface.\n This server shares much more, only slightly interesting, data over its websocket. Demonstrating this is as simple as invoking create-react-app:\n    Instantly there’s more data being shown, we’re getting hashes and status messages, all the useless infos.\n But what happens when the developer makes a typo? The webpack dev server helpfully tries to send a bunch of debugging and stack information to the developer’s screen, by way of its websocket connection.\n  Now things are getting juicy. We’ve got code snippets, paths to files, locations, all sorts of bits of useful info.\n It gets even better if eventually the Dev accidentally typos on a line containing useful data:\n  Now we’ve got a copy of this developer’s AWS Dev credentials. Quick, fire up the bitcoin miners!\n  No technical design is complete without some form of diagram. Here’s how this works, graphically:\n  (To simplify the diagram, I have omitted the local web server running, and pretended that the websocket server originates from within the editor directly)\n A malicious web page on some browser tab silently connects to open websockets on the user’s machine. When sensitive data is sent over that socket (from a process that expects to be communicating over a local-only channel) the website can receive that message data, and forward it on to any external database.\n   In all seriousness, this attack vector is pretty slim. You’ve got to tempt unwitting users to visit your site, and to stay on it while they’re developing JS code.\n You’ve then got to wait to get lucky to glean morsels of data from their coding mistakes, to maybe find an opening that allows you to profit from this data.\n  However, we’ve already seen that various sites are already using websocket port-scanning technology without much in the way of general developer awareness. Given that JS tooling tends to use a small number of well-known ports, writing a script to exfiltrate react Dev traffic subtly would not be particularly hard.\n Imagine an internal developer working for  Twitbook just pressing save in their editor and causing that access token or internal server address to be leaked to the wrong audience.\n The  slightly scary aspect of this is that a reasonable developer should have a general expectation that pressing save in their code editor of choice should have effectively 0 chance of causing data to be leaked to a third-party web service. This attack raises that chance enough to be a tiny bit concerning.\n  I pursued this vector of trying to intercept JavaScript hot-reloading mechanisms because it’s really the only general use of websockets that I’m familiar with.  Discord also uses websockets, but a passing glance at that didn’t yield any obvious results, as that channel is designed with the public internet in mind.\n It’s worrying that just this one simple use-case of a one-way communication channel for reloading has exposed so much potential information to bad websites.\n Given this, it’s likely that other uses of websockets (for data not designed for the public internet) may be similarly compromised.\n Arguably the webpack-dev server should do some authentication or that alternate browser communication channels be used for hot-reloading (I believe this is already being planned for other reasons).\n It certainly feels like it’s the way that browsers/web standards implement origin policies for websockets is surprising, and is resulting in software designed for local-only development to be exposed to the public internet in a non-ideal way.", "posttime": "2020-05-21 18:18:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,websocket,secrets,开发人员", "title": "使用WebSocket从开发人员那里窃取机密", "title_en": "Stealing Secrets from Developers Using Websockets", "transed": 1, "url": "https://medium.com/@stestagg/stealing-secrets-from-developers-using-websockets-254f98d577a0", "via": "", "real_tags": ["开发", "websocket", "secrets", "开发人员"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003100, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创建帐户", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2020-05-21 17:34:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "唾液,saliva,创建", "title": "6英尺还不够：唾液滴如何在空气中传播", "title_en": "6ft Is Not Always Enough: How Saliva Droplets Spread Through the Air", "transed": 1, "url": "https://spectrum.ieee.org/the-human-os/biomedical/imaging/six-feet-is-not-always-enough-how-saliva-droplets-spread-through-the-air", "via": "", "real_tags": ["唾液", "saliva", "创建"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003099, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "目的：意大利北部的米兰大都市区是受SARS-CoV-2爆发影响最严重的地区之一。然而，轻度冠状病毒的流行趋势仍不清楚。本研究的目的是检查健康无症状成人中SARS-CoV-2感染的血清阳性率、危险因素和实验室相关性。设计：我们在疫情爆发期间进行了一项横断面研究。采用横向流动免疫分析法检测抗SARS-CoV-2 IgM/IgG抗体的存在。地点：一家领先的学术医院的血液中心，作为冠状病毒转诊中心。参与者：我们随机抽取了自疫情爆发以来的献血者样本(2020年2月24日至4月8日，n=789)。主要观察指标：主要结果是IgG/IgM抗SARS-CoV-2抗体的流行率。结果：本试验从疫情开始以来(2020年2月24日至4月8日，n=789)随机抽取献血者。主要观察指标：主要结果是IgG/IgM抗SARS-CoV-2抗体的流行率。结果：0.001)。在疫情爆发之初，SARS-CoV-2的总体血清阳性率为4.6%(2.3vs.7.9%；P&lt；0.0001 vs.120历史对照)。在逐步实施社会疏远措施的研究期间，由于IgG+上升至5%(2.8~8.2；趋势P=0.004，调整后每周增加2.7，SE 1.3%)，血清阳性率逐渐上升至7.1%(4.4~10.8)，但IgM+无明显变化(P=NS)。在多因素Logistic回归分析中，年轻人血清转换为免疫球蛋白的频率较高(P=0.043)，而新近感染(IgM+)的年龄较大(P=0.002)。IgM+与较高的甘油三酯、嗜酸性粒细胞和淋巴细胞独立相关(P&lt；0.05)。结论：SARS-CoV-2感染在疫情开始时已经在米兰流行。社交距离在年轻人中可能更有效，到4月底，4.4%-10.8%的健康成年人有血清转换的证据。无症状感染可能会影响血脂和血细胞计数。\n这项研究由Ricerca Corente IRCCS Ca Granda Ospedale Maggiore Policlinico(机构对DP的资助)资助；冠状病毒网络注册表生物库，Fondazione IRCCS Ca Granda Ospedale Magiclinico(LV)资助；Ricerca Finalizzata Minesero della Salut(意大利卫生部)RF-2016-02364358(LV)，FondaziaFondazione IRCCS Ca Granda Ospedale Maggiore Policlinico(意大利卫生部)RF-2016-02364358(LV)。\n所有相关的道德准则都得到了遵守；任何必要的IRB和/或伦理委员会的批准都已经获得，IRB/监督机构的详细信息也包括在手稿中。\n已获得所有必要的患者/参与者同意，并已将适当的机构表格存档。\n我理解所有临床试验和任何其他预期干预研究必须在ICMJE批准的注册机构注册，如ClinicalTrials.gov。我确认手稿中报告的任何此类研究都已注册，并提供了试验注册ID(注意：如果张贴追溯注册的前瞻性研究，请在试验ID字段中提供一份声明，说明为什么没有提前注册该研究)。\n我已遵循所有适当的研究报告指南，并上传了相关的赤道网络研究报告核对表和其他相关材料作为补充文件(如果适用)。", "note_en": "Objectives: The Milan metropolitan area in Northern Italy was among the most severely hit by the SARS-CoV-2 outbreak. The epidemiological trends of mild COVID-19 are however still unknown. The aim of this study was to examine the seroprevalence of SARS-CoV-2 infection in healthy asymptomatic adults, the risk factors, and laboratory correlates.Design: We conducted a cross-sectional study during the outbreak. Presence of anti-SARS-CoV-2 IgM/IgG antibodies against the Nucleocapsid protein was assessed by a lateral flow immunoassay.Setting: Blood center at a leading academic hospital serving as COVID-19 referral center.Participants: We considered a random sample of blood donors since the start of the outbreak (February 24th to April 8th 2020, n=789).Main outcome measures: The main outcome was the prevalence of IgG/IgM anti-SARS-CoV-2 antibodies .Results: The test had a 98.3% specificity and 100% sensitivity, and for IgG was validated in a subset by an independent ELISA against the Spike protein (N=34, P&lt;0.001). At the start of the outbreak, the overall seroprevalence of SARS-CoV-2 was 4.6% (2.3 to 7.9; P&lt;0.0001 vs. 120 historical controls). During the study period characterized by a gradual implementation of social distancing measures, there was a progressive increase in seroprevalence to 7.1% (4.4 to 10.8), due to a rise in IgG+ to 5% (2.8 to 8.2; P=0.004 for trend, adjusted weekly increase 2.7, SE 1.3%), but not of IgM+ (P=NS). At multivariate logistic regression analysis, seroconversion to IgG was more frequent in younger (P=0.043), while recent infections (IgM+) in older individuals (P=0.002). IgM+ was independently associated with higher triglycerides, eosinophils, and lymphocytes (P&lt;0.05).Conclusions: SARS-CoV-2 infection was already circulating in Milan at the outbreak start. Social distancing may have been more effective in younger individuals, and by the end of April 4.4-10.8% of healthy adults had evidence of seroconversion. Asymptomatic infection may affect lipid profile and blood count.\n      The study was funded by Ricerca Corrente Fondazione IRCCS Ca\u0092 Granda Ospedale Maggiore Policlinico (Institutional funding to DP); COVID-19 Network Registry Biobanking, Fondazione IRCCS Ca\u0092 Granda Ospedale Maggiore Policlinico (LV); Ricerca Finalizzata Ministero della Salute (Italian Ministry of Health) RF-2016-02364358 (LV), Fondazione Sviluppo Ca\u0092 Granda for the project Liver-Bible - PR-0361 (LV); the EU Programme Horizon 2020 (under grant agreement No. 777377) for the project LITMUS (LV).\n  All relevant ethical guidelines have been followed; any necessary IRB and/or ethics committee approvals have been obtained and details of the IRB/oversight body are included in the manuscript.\n  All necessary patient/participant consent has been obtained and the appropriate institutional forms have been archived.\n  I understand that all clinical trials and any other prospective interventional studies must be registered with an ICMJE-approved registry, such as ClinicalTrials.gov. I confirm that any such study reported in the manuscript has been registered and the trial registration ID is provided (note: if posting a prospective study registered retrospectively, please provide a statement in the trial ID field explaining why the study was not registered in advance).\n  I have followed all appropriate research reporting guidelines and uploaded the relevant EQUATOR Network research reporting checklist(s) and other pertinent material as supplementary files, if applicable.", "posttime": "2020-05-21 17:12:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "covid,研究", "title": "研究发现，在大流行开始时，伦巴第已存在Covid抗体", "title_en": "Study found Covid antibodies already present in Lombardy at start of pandemics", "transed": 1, "url": "https://www.medrxiv.org/content/10.1101/2020.05.11.20098442v1", "via": "", "real_tags": ["covid", "研究"]}, {"category": "", "categoryclass": "", "imagename": "e392e113ed3890a8318aca00e259a02e.jpg", "infoid": 1003098, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Automattic的这笔投资的估值高于New Vector上一次收购的估值，延长了去年850万美元的首轮融资，这笔资金来自企业技术专业公司Concept Capital和曙光资本(Dawn Capital)，外加欧洲种子基金FirstMinint Capital-使迄今筹集的资金总额达到1810万美元。(其中包括早些时候来自一款基于以太网的安全聊天和加密钱包应用Status的500万美元战略投资)。\nNew Vector的去中心化技术为许多政府用户提供即时通讯功能，包括法国(法国去年分叉Riot推出了一款通讯应用程序(TCHAP))和德国(刚刚宣布其武装部队将采用Matrix作为所有内部通信的主干)，以及KDR、Mozilla、RedHat和维基媒体(Wikimedia)等公司。\n让Automattic加入显然是Matrix的一个重大战略推动-这让New Vector有了远大的梦想。\nNew Vector首席执行官兼首席技术官兼Matrix联合创始人马修·霍奇森告诉TechCrunch：“这是向前迈出的一大步。”“我们希望得到Automattic的支持，真正扩展生态系统，将Matrix功能引入WordPress--以及Automattic所做的各种WordPress插件。同样，Matrix也向所有这些用户开放。“。\n一篇宣布战略投资的博客文章提出了一个耐人寻味的可能性，即去中心化的Tumblr-或者所有WordPress网站自动获得自己的Matrix聊天室。\nNew Vector在博客中写道：“这是一个巨大的消息，尤其是因为WordPress实际上运营着当今网络上超过36%的网站--将Matrix带给所有这些用户的潜力是令人难以置信的。”“想象一下，如果每个可湿性粉剂网站自动附带自己的矩阵室或社区？想象一下，如果可湿性粉剂中的所有内容都自动发布到矩阵和网络上？…。想象一下，有一个出色的Matrix客户端可以作为WordPress插件将实时聊天嵌入到您的站点中？“。\n就目前而言，这些可能性仍然是耐人寻味的想法。但是，除了向New Vector Automattic投入大量资金之外，它还为Matrix.org/WordPress集成工程师打开了一个职位--因此Matrix团队有另一个明确的理由对未来的集成感到兴奋。\nHodgson补充道：“其中一位最优秀和最大的开源人员非常相信我们正在做的事情，并对尝试将WordPress的世界打开到Matrix分散的世界感兴趣。”在某些方面，像Automattic这样相对成熟的公司正着眼于地平线，把他们的芯片放在分散的未来，这是令人欣慰的。而他们可以‘做个Facebook’，无所事事，把所有事情都集中起来，尽可能地锁定。“\nMatrix联合创始人兼New Vector运营和产品负责人阿曼丁·勒·佩普(Amandine Le Pape)表示：“这有点像是一种验证。”“同样，从风投公司获得资金也证明了这是一项可行的业务。这是一种验证，它实际上是一个可以真正成长的主流开源项目。“。\n虽然Automattic的战略投资提议显然只是New Vector抓住的一个绝佳机会，但考虑到意识形态的一致性和整合潜力，根据Le Pape的说法，这也是一个很有帮助的时机，因为他们一直在发展SaaS业务。\n霍奇森补充说：“我们正在考虑与New Vector to Go和Drive合作的商业模式--既为Matrix提供资金，又保持项目和公司的发展，与Automattic与WordPress.com的成功合作非常非常相似。”“因此，能够直接与他们的董事会和我们的董事会比较笔记，告诉他们如何在WordPress.org和WordPress.com的拆分之间实现这一点，对我们来说应该是一个真正有用的工具。”\n虽然Matrix用户可以选择托管他们自己的服务器，但这样做显然会带来很高的复杂性(以及潜在的开销)。因此，New Vector的商业模式是提供一种名为Modular的付费Matrix托管服务，它负责付费托管的复杂性。(Modular网站上的营销手册敦促潜在客户：“注册并在几秒钟内部署您自己的安全聊天服务！”)。\n“显然，我们的一些最知名的客户，如Mozilla，可以自己去运营它。莫兹拉懂技术。但实际上，对他们来说，直接让我们来运营要容易得多，总体上也便宜得多。“霍奇森补充道。“好的是，他们对自己的数据拥有完全的自我主权。这是他们的DNS。我们给他们访问数据库的权限。他们可以在任何时候离开…。切换主机提供程序或自己运行它。(用户)通常从我们开始，以此作为启动和运行的一种方式。“。\n在谈到搬家时，霍奇森表示，他预计Automattic在这笔投资之后将从Slake转移到Riot。\nAutomattic创始人马特·穆伦韦格在一份支持声明中补充说：“我对New Vector与Matrix所做的事情感到非常兴奋--创建一种强大、安全、开放的协议，可以像网络或电子邮件具有其基础层那样，将各种类型的即时消息和协作结合在一起。”我赞同New Vector对开放源码的热情和开放标准的力量。我很高兴看到Automattic公司和New Vector公司在未来如何就我们共同的愿景进行合作。“。\nMullenweg已经是Matrix的支持者，早在2017年就通过Patreon加入了它的种子。当时，该团队正从孵化和完全由Amdocs(一家电信供应商，New Vectors的联合创始人曾在那里工作(管理其统一的通信部门)提供资金)过渡到分拆并四处寻找新的资金来源，以继续开发他们分散的标准。\n大约三年过去了-现在银行里又有了数百万美元的资金-霍奇森表示，New Vector能够考虑未来的盈利前景，目前拥有约1680万用户和4.5万部署(高于10月份的1100万和4万)。\n他告诉我们：“我认为也有很高的机会--摸着石头过河--如果需要的话，这笔注资会给我们提供一条直接实现盈利的途径。”“鉴于(冠状病毒)大流行带来的宏观经济不确定性，有机会说我们银行里有这么多现金，假设我们的客户大致遵循我们到目前为止看到的轨迹，…。这将是一种在不依赖任何进一步资金的情况下走出另一边的方法。\n“如果事情进展顺利，我们明年可能会增加资金，以便加倍取得成功。但现在，这至少给了我们一个相当厚实的安全网。“。\n根据霍奇森的说法，冠状病毒危机一直在“显著”加速人们对Matrix的兴趣，因为那些可能一直在考虑转向分散通信的实体感到，控制他们的数据的必要性要大得多--因为现在有这么多用户在家里登录。\n“随着封锁的开始，我们看到注册人数增加了大约10倍，”他说。“它是逐渐减少了一点，但一夜之间就成了一场真正的规模戏剧性事件。”我们不得不在Jitsi的产品上推出一套全新的视频会议部署，并将我们运行的服务的硬件规模扩大几倍。\n“我们也看到留存率上升，这很好。我们假设会有一大批用户拼命地想要找个家，然后他们就不一定会留下来了。实际上，他们比现有的用户群留在了更多的地方，这是令人放心的。\n在某些情况下，New Vector发现客户从根本上缩短了计划部署时间-从几个月缩短到几天。\n霍奇森表示：“我们在德国确实有一家(教育)机构在9月份进行了招标-我们希望你在周一上线。”他指出，在这种情况下，客户跳过了整个招标过程，因为他们觉得他们需要一个安全的系统，可以让学校的孩子使用。(出于隐私考虑，排除了使用Zoom或Microsoft Teams等集中化选项的可能性。)\n他补充说：“至少从新矢量的角度来看，最大的影响是，我们许多移动较慢、较大的机会-特别是在与政府合作的公共部门-突然大幅加速。”“因为以前拥有优质服务是件好事-‘如果我们有自己的加密信使，如果每个人都不使用Telegram或WhatsApp来管理我们的国家，那不是很好吗？’然后突然之间，随着任何一个国家的所有人口突然不得不远程工作，拥有高质量的通信成为事关生死存亡的要求，拥有这种加密和自我主权是一件巨大的事情。”\n根据Hodgson的说法，就与Slake(等人)竞争而言，最大的考虑是可用性和UX。\n因此，在过去的一年里，New Vector聘请了一个专门的内部设计团队来专注于平滑任何过于极客的边缘-尽管这项工作的大部分工作还没有推向用户。\n他说：“实际上，我们已经将Riot的整个开发转变为以设计为主导。”“现在不再是像我这样的一大群开发人员去研究它了--取而代之的是产品所有者和产品方向由设计团队制定。”就焦点和可用性而言，这是一个无法辨认的差异。\n“在未来的一年里，我们预计Riot将基本上得到重建，至少是在外观上，以摆脱我们今天所拥有的复杂性、极客气质和IRC的后遗症，转而支持某种能够真正打击松弛和不和谐的东西。”\n在最近的另一个重大发展中，New Vector在Riot中开启了端到端加密，使其成为所有新的非公开对话(DM和私人聊天)的默认加密。\n“这相当于电子邮件突然授权PGP，并设法不破坏一切，”霍奇森在谈到这一壮举时说。\n一个关键的挑战是在Matrix的非加密版本可以在任何地方启用之前与用户“平价”-以及相关的问题需要解决，比如搜索。\n“通常情况下，我们在服务器上进行搜索，如果邮件是加密的，服务器显然无法对它们进行索引-所以我们不得不将所有搜索功能转移到客户端运行。我们编写了一整套REST，允许您在客户端(包括桌面版本)将搜索引擎嵌入到Riot中，这样人们就可以在那里实际访问他们的加密消息历史记录，并在设备之间共享它，“他解释说。\ne2e的另一个关注点是验证过程-这也是现在默认情况下内置的。\n“当您现在登录Riot时，如果您已经登录到某个地方，它会强制您扫描现有登录的二维码。这有点像你在WhatsApp网站上所做的，但它不只是用它来验证你的身份，它还会用来证明你在这个账户上是合法的，“他说。“所以其他每个人都知道要完全信任那个登录--这样，如果发生了某种攻击，如果你的管理员试图向你的账户添加恶意设备来监视你，或者如果有中间人攻击，或者诸如此类的事情，每个人都可以看到不受信任的设备没有经过你的验证。”\n“它基本上是在你的设备和即时联系人之间建立一个简单的信任网络，这样你就可以完全保护自己免受幽灵设备或其他更肮脏的尝试的攻击，从而危及账户的安全。在创建非常非常强大的端到端加密方面，我认为使用二维码和使用表情符号比较而不是相互读出数字的组合现在几乎是独一无二的。“。\ne2e加密矩阵使用的是基于信号协议推广的算法。NCC集团在2016年对其进行了审计，但新资金的计划包括全栈审计-一旦他们解决了新的默认e2e的任何初期问题。\n“(我们希望)至少选择一条路径，一组特定的客户端和服务器，因为我们不能做所有的事情，显然，因为Matrix现在有60-70个不同的应用程序，或者说不同的客户端。至少有四个可行的服务器实现，但我们将选择长期支持的官方路径，至少找到一套我们可以审计并推荐给政府的方案，“霍奇森在谈到审计计划时说。\n他们还在与Jitsi合作一个项目，使后者的WebRTC兼容的视频会议平台e2e也进行加密-另一个关键部分是Jitsi的技术是New Vector通过Matrix提供的视频通话。\n我们在视频会议方面与JITSI合作，我们正在与他们合作开发e2e加密视频会议…。他们(最近)推出了世界上第一个基于WebRTC的e2e加密会议。他们计划使用Matrix作为交换密钥的方式-也使用所有的验证过程[New Vector已经为Riot开发]。因为端到端加密很棒，显然在保护数据方面--但是如果你不知道你在和谁交谈，在验证他们的身份方面，这完全是浪费时间，“Hodgson补充道。\n因此，当JITSI的e2e加密发布时，New Vector将能够将e2e加密的视频会议也作为其分散捆绑包的一部分。\n在接下来的12个月里，New Vector对Matrix的增长预期是多少？他在谈到这一点时表示：“去年，我们几乎将网络的所有规模指标增加了两倍，我认为前一年我们增加了两倍，所以我希望我们能继续沿着这条轨道前进。”\nNew Vector自去年年底以来一直致力于的另一个“有趣的事情”是Matrix的对等版本-开发了一个“足够轻量级的服务器实现”，允许Matrix用户通过网络浏览器(或移动设备上的应用程序)在分散的P2P空间中运行“Riot”。\n“大约一个月前，我们开启了点对点网络，他们现在正处于让它持久的阶段-以前，如果网络上的所有客户端都消失了，那么整个网络就会消失，而现在，即使人们开始重新启动浏览器和应用，它也有能力持续下去。”这在很大程度上是一个疯狂的科学项目，但据我所知，没有其他人能在这个范围内做到这一点，“他说。\n“令人高兴的是，它的外观和感觉都与今天的Matrix一模一样。您可以使用所有的客户端、人们已经编写的…的所有网桥。只是碰巧暴动正在连接一个嵌入自身的服务器，而不是与坐在服务器…上的服务器对话。所以这是一个彻底的范式转变。“。\n他补充说：“我们根本不确定它会不会奏效，但实际上，它的效果比我们预期的要好。”“在未来一年左右的时间里，我们预计会看到越来越多的人强调点对点--甚至可能是在默认情况下。因此，如果您安装了Riot，您就不必选择一台服务器，并经历一件相当繁琐的事情，即找出值得信任的服务提供商，您是想以New Vector的身份从我们这里购买一台，还是想去瑞士的ISP那里买一台。取而代之的是，你可以开始在一个纯粹的点对点的陆地上漂洋过海，然后如果你想把你的数据保存在某个地方，那么你可以去找一个服务器，把你自己固定在互联网上的一个家里。但这将是一种完全不同的思考方式。“。\n那些对P2P去中心化IM感兴趣的人可以通过p2p.riot.im在Web浏览器中体验这种风格的Riot", "note_en": "The investment by Automattic, which is at a higher valuation than the last tranche  New Vector   took in, extends an  $8.5M Series A last year, from enterprise tech specialists  Notion Capital and  Dawn Capital plus European seed fund  Firstminute Capital — and brings the total raised to date to $18.1M. (Which includes an earlier  $5M in strategic investment from an Ethereum-based secure chat and crypto wallet app,  Status).\n New Vector’s decentralized tech powers instant messaging for a number of government users, including France — which forked  Riot   to launch a messaging app last year ( Tchap) — and Germany, which  just announced its armed forces will be adopting Matrix as the backbone for all internal comms; as well as for the likes of KDR, Mozilla, RedHat and Wikimedia, to name a few.\n  Getting Automattic on board is clearly a major strategic boost for  Matrix   — one that’s allowing New Vector to dream big.\n “It’s very much a step forwards,” New Vector CEO and CTO and Matrix co-founder, Matthew Hodgson, tells TechCrunch. “We’re hopefully going to get the support from Automattic for really expanding the ecosystem, bringing Matrix functionality into WordPress — and all the various WordPress plugins that Automattic does. And likewise open up Matrix to all of those users too.”\n A blog post announcing the strategic investment dangles the intriguing possibility of a decentralized Tumblr — or all WordPress sites automatically getting their own Matrix chatroom.\n “This is huge news, not least because WordPress literally runs over 36% of the websites on today’s web – and the potential of bringing Matrix to all those users is incredible,” New Vector writes in the blog post . “Imagine if every WP site automatically came with its own Matrix room or community?  Imagine if all content in WP automatically was published into Matrix as well as the Web?…  Imagine there was an excellent Matrix client available as a WordPress plugin for embedding realtime chat into your site?”\n Those possibilities remain intriguing ideas for now. But as well as ploughing funding into New vector Automattic is opening up a job for a Matrix.org/WordPress integrations engineer — so the Matrix team has another tangible reason to be excited about future integrations.\n “One of the best and the biggest open source guys really believes in what we’re doing and is interested in trying to open up the worlds of WordPress into the decentralized world of Matrix,” adds Hodgson. “In some ways it’s reassuring that a relatively established company like Automattic is keeping its eye on the horizon and putting their chips on the decentralized future. Whereas they could be ‘doing a Facebook’ and just sitting around and keeping everything centralized and as locked down as possible.”\n “It’s a bit of a validation,” says Matrix co-founder and New Vector head of ops and products, Amandine le Pape. “The same way getting funding from VCs was validation of the fact it’s a viable business. Here it’s a validation it’s actually a mainstream open source project which can really grow.”\n  While the strategic investment offer from Automattic was obviously just a great opportunity to be seized by New vector, given ideological alignment and integration potential, it also comes at helpful time, per le Pape, given they’ve been growing their SaaS business.\n “The business model that we’re looking at with New Vector to go and drive — both to fund Matrix and also to keep the lights on and grow the projects and the company — is very, very similar to what Automattic have successfully done with WordPress.com,” adds Hodgson. “So being able to compare notes directly with their board and our board to go and say to them how do you make this work between the WordPress.org and the WordPress.com split should be a really useful tool for us.”\n While Matrix users can choose to host their own servers there’s obviously a high degree of complexity (and potential expense) involved in doing so. Hence New Vector’s business model is to offer a paid Matrix hosting service, called  Modular, where it takes care of the complexity of hosting for a fee. (Marketing copy on the  Modular website urges potential customers to: “Sign up and deploy your own secure chat service in seconds!”)\n “Some of our highest profile customers like Mozilla could go and run it themselves, obviously. Mozilla know tech. But in practice it’s a lot easier and a lot cheaper overall for them to just go and get us to run it,” adds Hodgson. “The nice thing is that they have complete self sovereignty over their data. It’s their DNS. We give them access to the database. They could move off at any time… switch hosting provider or run it themselves. [Users] typically start off with us as a way to get up and running.”\n Talking of moving, Hodgson says he expects Automattic to move over from Slack to Riot following this investment.\n “I am very excited about what New Vector is doing with Matrix — creating a robust, secure, open protocol that can bring all flavors of instant messaging and collaboration together, in the way that the web or email has its foundation layer,” added Automattic founder, Matt Mullenweg, in a supporting statement.  “I share New Vector’s passion for open source and the power of open standards. I’m excited to see how Automattic and New Vector can collaborate on our shared vision in the future.”\n Mullenweg was already a supporter of Matrix, chipping into its seed via  Patreon back in 2017. At the time the team was transitioning from being incubated and wholly financed by Amdocs, a telco supplier where New Vectors’ co-founders used to work (running its unified comms division), to spinning out and casting around for new sources of funding to continue development of their decentralized standard.\n Some three years on — now with another multi-million dollar tranche of funding in the bank — Hodgson says New Vector is able to contemplate the prospect of profitability ahead, with ~16.8 million users and 45,000 deployments at this point (up from 11M and 40k back in October).\n “I think there’s also a high chance — touch wood — that this injection gives us a path straight through to profitability if needed,” he tells us. “Given the macroeconomic uncertainty thanks to the [COVID-19] pandemic, the opportunity to say we have this amount of cash in the bank, assuming our customers follow roughly the trajectory that we’d seen so far… this would be a way to get out the other side without having to depend on any further funding.\n “If things are on track we probably would do additional funding next year in order to double down on the success. But right now this at least gives us a pretty chunky safety net.”\n The coronavirus crisis has been accelerating interest in Matrix “significantly”, per Hodgson, as entities that might have been contemplating a switch to decentralized comms down the line feel far greater imperative to take control of their data — now that so many users are logging on from home.\n “As lockdowns began we saw sign ups increase by a factor of about 10,” he says. “It’s tapered off a little bit but it was a real scaling drama overnight. We had to launch an entirely new set of videoconferencing deployments on  Jitsi’s   offering, as well as scaling up the hardware for the service which we run by several times over.\n “We’re also seeing retention go up, which was nice. We assumed there would be a huge spike of users desperately trying to find a home and then they wouldn’t necessarily stick around. In practice they’ve stuck around more than the existing user base which is reassuring.”\n In some cases, New Vector has seen customers radically shrink planned deployment timescales — from months to a matter of days.\n “We literally had one [educational] outfit in German reach out and say that tender in September — we want you to go live on Monday,” says Hodgson, noting that in this instance the customer skipped the entire tendering process because of they felt they needed a secure system school kids could use. (And privacy concerns ruling out use of centralized options  such as Zoom or Microsoft Teams.)\n “The biggest impact from a New Vector perspective at least has been that a lot of our slower moving, bigger opportunities — particularly in the public sector with governments — have suddenly sped up massively,” he adds. “Because it was previously a nice to have premium thing — ‘wouldn’t it be good if we had our own encrypted messenger and if everybody wasn’t using Telegram or WhatsApp to run our country’ — and then suddenly, with the entire population of whichever country it might be suddenly having to work remotely it’s become an existential requirement to have high quality communication, and having that encrypted and self sovereign is a massive deal.”\n In terms of competing with Slack (et al), the biggest consideration is usability and UX, according to Hodgson.\n So, over the last year, New Vector has hired a dedicated in-house design team to focus on smoothing any overly geeky edges — though most of this work is yet to be pushed out to users.\n “We’ve actually pivoted the entire development of Riot to be design led,” he says. “It’s no longer a whole bunch of developers, like myself, going and hacking away on it — instead the product owner and the product direction’s being laid by the design team. And it is an unrecognizable difference — in terms of focus and usability.\n “Over the coming year we are expecting Riot to basically be rebuilt at least cosmetically to get rid of the complexity and the geekiness and the IRC hangovers which we have today in favor of something that can genuinely punch its weight against Slack and Discord.”\n In another major recent development New Vector  switched on end-to-end encryption across the piece in Riot, making it the default for all new non-public conversations (DMs and private chats).\n “It’s the equivalent of email suddenly mandating PGP and managing not to break everything,” says Hodgson of that feat.\n A key challenge was to “get parity” with users of the non-encrypted version of Matrix before it could be enabled everywhere — with associated problems to tackle, such as search.\n “Typically we were doing search on the server and if the messages are encrypted the server obviously can’t index them — so we had to shift all of our search capabilities to run client side. We went and wrote a whole bunch of REST that allows you to basically embed a search engine into Riot on the client, including on the desktop version, so that people can actually reach their encrypted message history there and share it between devices,” he explains.\n Another focus for the e2e was the verification process — which is also now built in by default.\n “When you now log into Riot it forces you to scan a QR code on an existing login if you’ve already logged in somewhere. A bit like you do on WhatsApp web but rather than just using it to authenticate you it also goes and proves that you are a legitimate person on that account,” he says. “So everyone else then knows to trust that login completely — so that if there is an attack of some kind, if you admin tries to add a malicious device into your account to spy on you or if there’s a man-in-the-middle attack, or something like that, everybody can see that the untrusted device hasn’t been verified by you.\n “It’s basically building out a simple web of trust of your devices and immediate contacts so that you have complete protection against ghost devices or other nastier attempts to go and compromise the account. The combination of using QR codes and also using emoji comparison rather than having to read out numbers to one another is I think almost unique now, in terms of creating really, really super robust end-to-end encryption.”\n The e2e encryption Matrix uses is based on algorithms popularized by the Signal protocol. It was audited by NCC Group in 2016 but plans for the new funding include a full stack audit — once they’ve ironed out any teething issues with the new default e2e.\n “[We want to] at least pick a path, a particular set of clients and servers — because we can’t do the whole thing, obviously, because Matrix has got 60-70 different apps on it now, or different clients. And there are at least four viable server implementations but we will pick the long term supported official path and at least find a set which we can then audit and recommend to governments,” says Hodgson of the audit plans.\n They’re also working with  Jitsi on  a project to make the latter’s WebRTC-compatible videoconferencing platform e2e encrypted too — another key piece as Jitsi’s tech is what New Vector offers for video calling via Matrix.\n “We partner with Jitsi for the videoconferencing side of things and we’re working with them on their e2e encrypted videoconferencing… They [recently] got the world’s first  WebRTC  -based e2e encrypted conferencing going. And they plan to use Matrix as the way to exchange the keys for that — using also all of the verification process [New Vector has developed for Riot]. Because end-to-end encryption’s great, obviously in terms of securing the data — but if you don’t know who you’re talking to, in terms of verifying their identity, it’s a complete waste of time,” adds Hodgson.\n So when Jitsi’s e2e encryption launches New Vector will be able to include e2e encrypted videoconferencing as part of its decentralized bundle too.\n How much growth is New Vector expecting for Matrix over the next 12 months? “We’ve tripled almost all of the sizing metrics for the network in the last year, and I think we tripled the year before that so I’m hoping that we can continue on that trajectory,” he says on that.\n Another “fun thing” New Vector has been working on, since the end of last year, is a peer-to-peer version of Matrix — having developed a “sufficiently lightweight server implementation” that allows Matrix users to run ‘riot’ in a decentralized p2p space via a web browser (or via the app on a mobile device).\n “We turned on the peer-to-peer network about a month ago now and they’re at the point right now of making it persistent — previously if all of the clients on the network went away then the entire network disappeared, whereas now it has the ability to persist even if people start restarting their browsers and apps. And it’s very much a mad science project but as far as I know nobody else is remotely in that ballpark,” he says.\n “The nice thing is it looks and feels identical to Matrix today. You can use all of the clients, all of the bridges that people have already written… It just happens to be that the Riot is connecting to a server wedged into itself rather than talking to one sitting on the server… So it’s a total paradigm shift.”\n “We weren’t sure it was going to work at all but in practice it’s working better than we could have hoped,” he adds. “Over the next year or so we’re going to expect to see more and more emphasis on peer-to-peer — possibly even by default. So that if you install Riot you don’t have to pick a server and go through this fairly clunky thing of figuring out what service provider to trust and do you want to buy one from us as New Vector or do you want to a Swiss ISP. Instead you can start off bobbing around the ocean in a pure peer-to-peer land, and then if you want to persist your data somewhere then you go and find a server to pin yourself to a home on the Internet. But it would be a completely different way of thinking about things.”\n Those interested in dipping a toe in p2p decentralized IM can check out this flavor of Riot in a web browser via  p2p.riot.im", "posttime": "2020-05-21 17:11:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "增长,grow,matrix", "title": "Automattic向新矢量注资460万美元帮助增长Matrix", "title_en": "Automattic pumps $4.6M into New Vector to help grow Matrix", "transed": 1, "url": "https://techcrunch.com/2020/05/21/automattic-pumps-4-6m-into-new-vector-to-help-grow-matrix-an-open-decentralized-comms-ecosystem/", "via": "", "real_tags": ["增长", "grow", "matrix"]}, {"category": "", "categoryclass": "", "imagename": "8138d6e74e2bedb52ea6a57c65ebd7a3.png", "infoid": 1003097, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们非常兴奋地宣布，WordPress.com的创建者Automattic将首先进入Matrix生态系统，向New Vector(制作Riot和Modular.im的公司，由核心Matrix团队于2017年创立)投资近500万美元。更重要的是，Matt Mullenweg(WordPress的联合创始人和Automattic的创始人)和Automattic团队承诺在未来的工作中最大限度地利用Matrix！\n这是一个巨大的消息，尤其是因为WordPress确实运行着当今网络上超过36%的网站-将Matrix带给所有这些用户的潜力是令人难以置信的。想象一下，如果每个可湿性粉剂网站都自动附带自己的Matrix房间或社区？想象一下，如果WP中的所有内容都自动发布到Matrix和Web上，会是什么样子？(到目前为止，这还不是个好主意--原来Automattic已经在im.wordpress.com上为WordPress.com运行了一个XMPP桥！)。想象一下，有一个很棒的Matrix客户端可以作为WordPress插件嵌入到您的站点中进行实时聊天？想象一下，如果Tumblr(现在是Automattic的一部分)变得分散了！？\n事实上，如果您是Matrix或WordPress社区的开发人员，现在可能是考虑如何跨越这些流的好时机……。尤其是因为Automattic刚刚为Matrix.org/WordPress集成工程师提供了一个职位！撇开投资不谈，这表明Automattic对Matrix是认真的-我们要感谢他们在这个充满挑战的时代为Matrix提供了更多的工作机会，进一步加速了Matrix的发展。也许有一天，矩阵工程师会像Web开发人员一样成为常见的职业选择。)。\n这就是说，现在整合工作还为时过早，除了对New Vector的投资(这实际上是NV在10月份筹集的资金的延伸)和Automattic的职位空缺之外，还没有什么具体的项目要宣布-但这些都是我们一直在考虑的想法。至少，在接下来的几个月里，我们应该会看到Automattic的社区迁移到Matrix上。\n与Matt和团队在这方面合作非常有趣：我们看到在对开放网络、开放源码和开放标准的真正热爱方面存在巨大的重叠。马特(独立于Automattic)在2017年我们最需要的时候通过Patreon向Matrix捐赠了大量资金，这也不是巧合。我们也期待着从Automattic在可持续和负责任地资助和发展开源项目方面的经验中获益-WordPress.com是一个很好的例子，说明了如何在不影响开源性质的情况下支持像WordPress这样的项目的开发。\n因此，我们想正式欢迎WordPress和Automattic家族的其他成员加入Matrix。这是令人难以置信的激动人心的时刻，我们迫不及待地想看看合作会有什么结果！同时，如果任何其他大型开源组织想要加入Automattic和Mozilla的行列，跳进Matrix，您知道在哪里可以找到我们的…。：D。\n非常感谢马特相信“黑客帝国”--关注这个空间的更新。", "note_en": "We’re very excited indeed to announce that  Automattic, the creators of  WordPress.com, are jumping head first into the Matrix ecosystem with a strategic investment of almost $5M into  New Vector (the company which makes  Riot and  Modular.im, founded by the core Matrix team in 2017). More importantly, Matt Mullenweg (co-founder of WordPress and founder of Automattic) and the Automattic gang are committing to make the most of Matrix in their work going forwards!\n This is huge news, not least because WordPress literally runs over 36% of the websites on today’s web - and the potential of bringing Matrix to all those users is incredible. Imagine if every WP site automatically came with its own Matrix room or community? Imagine if all content in WP automatically was published into Matrix as well as the Web? (This isn’t so far fetched an idea - turns out that Automattic already runs a XMPP bridge for wordpress.com over at  im.wordpress.com!). Imagine there was an excellent Matrix client available as a WordPress plugin for embedding realtime chat into your site? Imagine if  Tumblr (which is part of Automattic these days) became decentralised!?\n In fact, if you’re a developer in either the Matrix or WordPress communities, now might be a good time to think about how to cross the streams.... not least because Automattic just opened up a role for a  Matrix.org/WordPress Integrations Engineer! Quite aside from the investment, this shows Automattic is serious about Matrix - and we’d like to thank them for opening up jobs in these challenging times to further accelerate Matrix. Perhaps some day Matrix Engineer will be as common a career choice as Web Developer ;)\n That said, it’s super early days for integration work, and there isn’t a concrete project to announce yet beyond the investment in New Vector (which is effectively an extension of the funding NV raised in October) and Automattic’s Job opening - but these are the sort of ideas we’ve been kicking around. And at the very least, we should expect to see Automattic’s communities migrating over to Matrix in the coming months.\n It’s been loads of fun working with Matt and the team on this: we see a huge overlap in terms of a genuine love for the open web, open source and open standards. It’s also no coincidence that Matt (independently of Automattic) donated substantially to Matrix via Patreon back in 2017 when we needed it the most. We’re also looking forward to benefiting from Automattic’s experience in sustainably and responsibly funding and growing open source projects in general - WordPress.com is an excellent example of how one can support development of a project like WordPress without compromising its open source nature.\n So, we’d like to formally welcome WordPress and the rest of the Automattic family into Matrix. It’s incredibly exciting times, and we can’t wait to see what will come of the partnership! And meanwhile, if any other massive open source organisations want to join Automattic and  Mozilla in leaping into Matrix, you know where to find us… :D\n Huge thanks go to Matt for believing in Matrix - watch this space for updates.", "posttime": "2020-05-21 16:49:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "automattic,matrix", "title": "欢迎Automattic来到Matrix", "title_en": "Welcoming Automattic to Matrix", "transed": 1, "url": "https://matrix.org/blog/2020/05/21/welcoming-automattic-to-matrix", "via": "", "real_tags": ["matrix"]}, {"category": "", "categoryclass": "", "imagename": "e2de6a48ceafd23e895b108594f32928.jpg", "infoid": 1003096, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以色列安全研究人员在全球域名系统(DNS)的一个基本原理中发现了一个无法修复的漏洞，该漏洞可被滥用来发起潜在的压倒性拒绝服务攻击。\n特拉维夫大学的Lior Shafir和Herzliya跨学科中心的Anat Bremler-Barr都发表了关于DNS漏洞的发现，他们称之为NXNSAttack，此前他们向供应商披露了这个漏洞，让他们有时间开发补丁。\nNXNSAttack利用了DNS中所谓的无缝委派的弱点，在DNS中，查询返回对域具有权威性的服务器的名称，但不返回它们的互联网协议地址。\n使用恶意DNS服务器的攻击者可以使用包含假的、随机的权威服务器名称的委派进行响应。\n这些服务器名称被设置为指向受害者域，从而强制解析程序生成进一步的查询，这些查询将被发送到无法解析它们的目标DNS服务器。\n这是符合标准的DNS服务器的运行方式，但NXNSAttack的后果可能是拒绝服务泛滥，数据包放大倍数高达1621倍。\n目前服务于全球互联网基础设施的开源和专有DNS服务器受到影响，需要打补丁。\n这包括互联网软件联盟(Internet Software Consortium)的BIND等DNS解析器，也包括谷歌(Google)、微软(Microsoft)、亚马逊网络服务(Amazon Web Services)和Cloudflare等云和网络服务提供商使用的专有DNS解析器，它们现在已经收到了补丁。\n但是，补丁程序无法修复该漏洞，仅通过添加对名称服务解析重试次数的限制来缓解NXNSAttack。\n不幸的是，NXNSATTACK滥用了DNS协议的最基本原则，这实际上意味着没有修复，只有缓解，与以色列研究人员合作的捷克共和国域名管理员PetrŠpaček写道。\nŠpaček指出，虽然从表面上看，在处理单个委托时限制解析的名称数量等缓解技术似乎很容易实施，但它们可能会破坏某些域的解析。\n对解析重试添加任意限制可能会给估计4%的二级域带来问题，这些二级域的顶级域(TLD)(如.com和.net)的委派存在问题。\nŠpaček表示：在接下来的几天里，我们将看到供应商在确定他们的魔术数字方面取得了多大的成功，以及他们是否在没有打破任何主要领域的情况下脱颖而出。", "note_en": "Israeli security researchers have discovered an unfixable vulnerability in one of the fundamentals of the worldwide domain name system (DNS) that can be abused to launch potentially overwhelming denial of service attacks.\n Lior Shafir and Yehuda Afek, both of Tel Aviv University and Anat Bremler-Barr of the Herzliya Interdisciplinary Centre published their findings on the DNS vulnerabilty, which they called  NXNSAttack after disclosing it to vendors to give them time to develop patches.\n The NXNSAttack takes advantage of a weakness in the so-called glueless delegation in the DNS, in which queries return names of servers that are authoritative for a domain, but not their internet protocol addresses.\n An attacker with a malicious DNS server can respond with a delegation that contains fake, random authoritative server names.\n These server names are set to point to a victim domain, which forces the resolver to generate further queries that are sent to the target DNS server which is unable to resolve them.\n This is how standards-compliant DNS servers should operate, but the consequences of NXNSAttack can be denial of service floods with a very high packet amplification factor of up to 1621 times.\n Open source and proprietary DNS servers that currently serve the global internet infrastructure are affected and need patching.\n This includes DNS resolvers such as the Internet Software Consortium&#39;s BIND, and also proprietary ones used by cloud and web services providers such as Google, Microsoft, Amazon Web Services, and Cloudflare which have now received patches.\n However, the patches do not fix the vulnerability, and only provide mitigation against NXNSAttack by adding limits on the amount of retries for name service resolution.\n &#34;Unfortunately NXNSAttack abuses the very basic principle of DNS protocol, which practically means there is no fix, only mitigation,&#34; Petr Špaček of the Czech Republic domain name administrator who collaborated with the Israeli researchers  wrote.\n Špaček noted that while on the surface mitigation techniques such as limiting the number of names resolved while processing single delegations appear simple to implement, they could break resolution for some domains.\n Adding arbitrary limits on resolution retries could cause problems for the esitimated four per cent of second-level domains that have issues with their delegation from top-level domains (TLDs) such as .com and .net.\n &#34;In [the] upcoming days we will see how successful vendors were in determining their magic numbers and if they get away without breaking any major domains,&#34; Špaček said.", "posttime": "2020-05-21 16:48:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人员,warn,dns", "title": "研究人员警告无法修复的DNS DoS NXNS攻击", "title_en": "Researchers Warn of Unfixable DNS DoS NXNS Attack", "transed": 1, "url": "https://www.itnews.com.au/news/researchers-warn-of-unfixable-dns-denial-of-service-nxnsattack-548345", "via": "", "real_tags": ["人员", "warn", "dns"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003095, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "+--+|KISS|*一个独立的LINUX(R)发行版，关注||简单性和“少即是多”的概念。|*分发只针对x86-64**||架构和英语。||+--++--+|概述|*。使用纯文本软件包系统，该系统||与语言无关，可使用基本UNIX||实用程序进行解析。|*使用小于1000的包管理器||POSIX sh行(不包括空行和||注释)。|*基于MUSL libc、busybox和Linux内核。|*每次安装的发行版都包含||完整的(发行版)源代码和git历史||附带。|*简单小巧，||全部只需一个人就能轻松维护。|*没有&#34；后端&#34；。这个发行版只是||几个git存储库。|*具有&#34；总线因子&#34；N/A(0？)。感谢以上||点。给予用户和社区充分的权力。|*所有shell代码都经过shellcheck||(包括每个仓库包)。|*所有软件包都由||软件包管理器从源代码编译，该管理器会自动处理||依赖项、补丁等。|*明确排除以下软件：|dbus、systemd、polkit、gettext、intltool、||PulseAudio、pam、Wayland、logind、ConsoleKit2|和所有桌面环境。|*选择！可以替换coreutils、init、设备管理器、||编译器、shell和*。没有||锁定到特定软件(当然不包括MUSL和|内核)。|*无根Xorg环境，无需任何附加||软件。|*通过git和GnuPG进行仓库签名，||基于已签名的提交，内置于git本身。||+--++--+|进一步阅读|。*请参阅：|https://k1ss.org/guidestones||https://k1ss.org/install||https://k1ss.org/package-system||https://k1ss.org/community|+--+", "note_en": "+-------------------------------------------------------+| || KISS || || * An independent Linux(R) distribution with a focus || on simplicity and the concept of less is more. || || * The distribution targets only the x86-64 ** || architecture and the English language. || || |+-------------------------------------------------------++-------------------------------------------------------+| || OVERVIEW || || * Uses a plain-text package system which is || language agnostic and parseable with basic UNIX || utilities. || || * Uses a package manager written in less than 1000 || lines of POSIX sh (excluding blank lines and || comments). || || * Based on musl libc, busybox and the Linux kernel. || || * Every installation of the distribution contains the || full sources (of the distribution) with git history || attached. || || * Is simple and small enough to be maintainable in || its entirety by a single person with little effort. || || * There is no &#34;backend&#34;. This distribution is merely || a few git repositories. || || * Has a &#34;Bus factor&#34; of N/A (0?) thanks to the above || points. Full power to the users and the community. || || * All shell code is linted by and passes shellcheck || (including each and every repository package). || || * All packages are compiled from source by the || package manager which automatically handles || dependencies, patches, etc. || || * Explicitly excludes the following software: || || dbus, systemd, polkit, gettext, intltool, || pulseaudio, pam, wayland, logind, ConsoleKit2 || and all Desktop Environments. || || || * Choice! The coreutils, init, device manager, || compiler, shell and * can be replaced. There&#39;s no || lock-in to specific software (excluding musl and || the kernel of course). || || * Rootless Xorg environment without any additional || software. || || * Repository signing through git and gnupg, || based on signed commits and built into git itself. || || |+-------------------------------------------------------++-------------------------------------------------------+| || FURTHER READING || || * See: || ||  https://k1ss.org/guidestones ||  https://k1ss.org/install ||  https://k1ss.org/package-system ||  https://k1ss.org/community || || |+-------------------------------------------------------+", "posttime": "2020-05-21 16:26:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,管理器", "title": "KISS Linux-专注于少即是多的发行版", "title_en": "Kiss Linux – A distribution with a focus on less is more", "transed": 1, "url": "http://k1ss.org", "via": "", "real_tags": ["linux", "管理器"]}, {"category": "", "categoryclass": "", "imagename": "a2b67d9c78187a32ba966e3e540c8f22.png", "infoid": 1003094, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年5月19日：微软宣布了许多与Linux相关的东西，还有毛伊岛(Maui)。问题是：MAUI已经是Linux发行版的名称，也是Linux应用程序的图形用户界面框架的名称。\n微软的MAUI也是图形用户界面的框架。因此，我在GitHub上开了一期。微软将作何反应？\n“预期行为：Microsoft选择Linux社区中尚未使用的名称。实际行为：微软选择Linux社区中已经使用过的名称。\n我假设微软会认出名称冲突，道歉，并重新命名他们的项目。别小题大作。随时都可能发生。\n(注：MVP代表“最有价值的专业人士”，这不是微软员工。)。\n“这是经过法律审查的。我不相信这是这个讨论的论坛。“。\n美国东部时间晚上8：14：微软员工发布了他的工作邮箱地址(任何人都很容易在网上找到)，因此希望停止GitHub上关于这一问题的公开讨论。这一举动可能是为了缓解公司的沙尘暴升级。\n我们只能猜测，进一步的讨论是否会在公关部引发一些“垃圾雷达”。\nUTC下午8：52：Microsoft锁定该问题，无法添加进一步的反应(如竖起和向下大拇指，甚至编辑现有评论)：\n今晚晚些时候：一些评论被标记为离题，可能是因为担心微软“最有价值的专业人士”的答案可能会被视为…。不够专业：\n大约在同一时间，毛伊UI框架背后的团队在https://nxos.org/news/official-statement-regarding-xamarin-forms-rebanding-as-maui/，上发布了一份官方声明，称。\n“我们愿意相信，这是一个不幸的事件，是由于集思广益会议期间的疏忽，没有为他们的产品选择一个新的、有吸引力的名称，而不是试图使用品牌和营销手段，这可能是一个大公司，如微软和他们的子公司Xamarin，超越了一个竞争对手的框架，这个UI框架直到今天仍然是谷歌搜索”Maui UI Framework“时的第一个结果，但由于GitHub(微软的另一家子公司)和微软自己的网站(特别是他们的博客)的强大，SESEG(微软的另一家子公司)和微软自己的网站(具体地说，就是他们的博客)SESEHub(微软的另一家子公司)和微软自己的网站(特别是他们的博客)。\n我们恳请负责此软件开发的微软团队重新考虑更改为其他名称。如果他们如此倾向于使用太平洋岛屿，他们有很多选择，其中许多岛屿也是以自由和开放源码项目命名的可能性很小。\n甚至在今晚晚些时候：几乎所有的评论现在都被标记为离题，无法看到大拇指向上/向下的回应，需要登录才能查看。\nMAUI项目是一个免费的模块化前端框架，用于开发快速且引人注目的用户体验：https://mauikit.org/", "note_en": "May 19, 2020: Microsoft announces a lot of Linux related stuff, and  Maui. Trouble is: Maui is already the name of  a Linux distribution and the name of a   framework for graphical user interfaces for Linux applications.\n  The Maui from Microsoft is  also a  framework for graphical user interfaces. Hence I open an issue on GitHub. How will Microsoft react?\n  “Expected Behavior: Microsoft chooses names not already used in the Linux community. Actual Behavior: Microsoft chooses names already used in the Linux community.”\n I assume that Microsoft will recognize the name clash, apologize, and rename their project. No big deal. Can happen any time.\n    (Note: MVP stands for “Most Valuable Professional”, this is  not a Microsoft employee.)\n   “This has been through legal review. I don’t believe this is the forum for this discussion.”\n     8:14 PM UTC: In a move that could be out of a corporate playbook for shitstorm de-escalation, the Microsoft employee posts his work mail address (which anyone could find on the net easily anyhow) and hence hopes to stop the public discussion about the issue on GitHub.\n We can only speculate whether further discussion triggers some “shitstorm radar” at the PR department.\n 8:52 PM UTC: Microsoft locks the issue, making it impossible to add further reactions (such as thumbs up and down or even editing existing comments):\n  Later this evening:  Some comments get marked as off-topic, possibly in fear that the Microsoft “Most Valuable Professional” answers might be seen as… less than  professional:\n  Around the same time, the team behind the Maui UI framework publishes an official statement at  https://nxos.org/news/official-statement-regarding-xamarin-forms-rebanding-as-maui/, saying\n “We would like to believe that this an unfortunate event caused by an oversight during the brainstorming session to select a new and appealing name for their product and not an attempt at using the branding and marketing might consist of a large corporation such as Microsoft and their subsidiary Xamarin to step over a competing framework, a UI framework that as of today is still the first result in Google when searching for the term “Maui UI framework” but that due to the might of GitHub (another Microsoft subsidiary) and Microsoft own website (specifically, their blog) SEO that will change over time.\n We would like to kindly ask the Microsoft team that is in charge of the development of this software to reconsider changing to a different name. If they were so inclined to use Pacific Islands, there are plenty to choose from, many of which the probability that another island is also named after a free and open-source project is substantially minimal.”\n Even later this evening: Almost all comments are now marked as off-topic, making it impossible to see the thumbs up/thumbs down response, and requiring to sign in to view.\n  The Maui project is a free and modular front-end framework  for developing fast and compelling user experiences:  https://mauikit.org/", "posttime": "2020-05-21 16:26:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,linux,微软,是不是,loves", "title": "微软热爱Linux--是不是有点太过了？", "title_en": "Microsoft loves Linux – a little too much?", "transed": 1, "url": "https://medium.com/@probonopd/microsoft-loves-linux-a-little-too-much-cff91023e4b8", "via": "", "real_tags": ["microsoft", "linux", "微软", "是不是", "loves"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003093, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，2020年5月20日，GNOME基金会、罗斯柴尔德专利成像公司和Leigh M.Rothschild高兴地宣布，罗斯柴尔德专利成像公司和GNOME之间的专利纠纷已经解决。\n在这项不了了之的和解协议中，GNOME获得了一份释放协议，并承诺不会因罗斯柴尔德专利成像公司持有的任何专利而被起诉。此外，Rothschild Patent Image和Leigh Rothschild都向根据现有开源计划批准的许可证(及其后续版本)发布的任何软件(包括整个Rothschild专利组合)授予发布和约定，只要这些软件构成侵权指控的重要部分。\nGNOME基金会执行董事尼尔·麦戈文说：“我非常高兴我们已经结案。这将使我们能够将注意力重新集中在创建一个自由软件桌面上，并将确保未来所有自由和开放源码软件的确定性。“。\n利·罗斯柴尔德说：“我很高兴我们设法友好地解决了这个问题。我一直支持开放源码软件及其开发者的创新，并鼓励其创新和采用。“。\n来自Searman&amp；Sterling LLP的马特·伯科维茨(Matt Berkowitz)、基兰·基赫费尔(Kieran Kieckhefer)、乔伊·王(Joy Wang)和拉里·克劳奇(Larry Crouch)为侏儒无偿代理。GNOME和更广泛的自由开放源码社区感谢他们在过去10个月中的不懈工作。", "note_en": "Today, on the 20th of May 2020, the GNOME Foundation, Rothschild Patent Imaging, and Leigh M. Rothschild are pleased to announce that the patent dispute between Rothschild Patent Imaging and GNOME has been settled.\n In this walk-away settlement, GNOME receives a release and covenant not to be sued for any patent held by Rothschild Patent Imaging. Further, both Rothschild Patent Imaging and Leigh Rothschild are granting a release and covenant to any software that is released under an existing Open Source Initiative approved license (and subsequent versions thereof), including for the entire Rothschild portfolio of patents, to the extent such software forms a material part of the infringement allegation.\n Neil McGovern, Executive Director for the GNOME Foundation said “I’m exceptionally pleased that we have concluded this case. This will allow us to refocus our attention on creating a free software desktop, and will ensure certainty for all free and open source software in future.”\n Leigh Rothschild said “I’m pleased that we have managed to settle this issue amicably. I have always supported the innovation of open source software and its developers and encourage its innovation and adoption.”\n GNOME was represented pro-bono by Matt Berkowitz, Kieran Kieckhefer, Joy Wang and Larry Crouch from Shearman &amp; Sterling LLP. GNOME and the wider free and open source community owes its thanks and gratitude to their tireless work over the past 10 months.", "posttime": "2020-05-21 16:25:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "专利,case,软件", "title": "针对GNOME的专利案件解决", "title_en": "Patent case against GNOME resolved", "transed": 1, "url": "https://www.gnome.org/news/2020/05/patent-case-against-gnome-resolved/", "via": "", "real_tags": ["专利", "case", "软件"]}, {"category": "", "categoryclass": "", "imagename": "342a95b3397cd1f6910fff42ab7c3fc5.png", "infoid": 1003092, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1哥本哈根大学营养、锻炼与体育系，丹麦哥本哈根2200；kd.uk.sxen@bim(M.M.B.)；kd.uk.sxen@ekceneiw(J.W.)；kd.uk.sxen@TSA(A.A.)；kd.uk.sxen@eybdnulj(J.L.-J.)。\n1哥本哈根大学营养、锻炼与体育系，丹麦哥本哈根2200；kd.uk.sxen@bim(M.M.B.)；kd.uk.sxen@ekceneiw(J.W.)；kd.uk.sxen@TSA(A.A.)；kd.uk.sxen@eybdnulj(J.L.-J.)。\n2丹麦南部精神卫生服务区神经发育障碍研究中心(焦点)，儿童和青少年精神卫生欧登塞，5000欧登塞，丹麦；kd.dyr@grebneliB.sleiN。\n1哥本哈根大学营养、锻炼与体育系，丹麦哥本哈根2200；kd.uk.sxen@bim(M.M.B.)；kd.uk.sxen@ekceneiw(J.W.)；kd.uk.sxen@TSA(A.A.)；kd.uk.sxen@eybdnulj(J.L.-J.)。\n1哥本哈根大学营养、锻炼与体育系，丹麦哥本哈根2200；kd.uk.sxen@bim(M.M.B.)；kd.uk.sxen@ekceneiw(J.W.)；kd.uk.sxen@TSA(A.A.)；kd.uk.sxen@eybdnulj(J.L.-J.)。\n1哥本哈根大学营养、锻炼与体育系，丹麦哥本哈根2200；kd.uk.sxen@bim(M.M.B.)；kd.uk.sxen@ekceneiw(J.W.)；kd.uk.sxen@TSA(A.A.)；kd.uk.sxen@eybdnulj(J.L.-J.)。\n被许可人MDPI，巴塞尔，瑞士。本文是根据知识共享署名(CC By)许可证(http://creativecommons.org/licenses/by/4.0/).)的条款和条件分发的开放获取文章。\n注意缺陷多动障碍(ADHD)是一种具有复杂症状的神经发育障碍，核心症状和功能障碍通常持续到成年。最近的调查估计，全世界儿童和青少年中ADHD的患病率约为7%，与十年前相比大幅增加。常规治疗通常包括用中枢神经刺激剂进行药物治疗，但无反应者的数量和不良反应要求替代治疗方案。运动已经被认为是治疗ADHD的一种安全和低成本的辅助疗法，据报道，在一般儿童群体中，运动对认知功能的几个方面都有积极的影响。在这里，我们回顾了运动影响ADHD儿童和非ADHD儿童认知功能的现有证据，并提出了可能的神经生理作用机制。我们发现体力活动和ADHD之间有很好的联系，并且在急性有氧运动对ADHD儿童的执行功能产生小到中度有益影响的形式下，也有因果证据。尽管有很大的异质性，荟萃分析发现锻炼对基于人群的控制(PBC)儿童的积极影响很小，我们从长期干预中提取的影响大小表明，运动对患有ADHD的儿童和青少年具有一致的积极影响。缺乏探讨不同运动参数影响的研究阻碍了这方面的有限结论。需要进行大规模的临床试验，并适时进行锻炼。总而言之，现有的初步证据表明，运动可以改善与ADHD表现密切相关的认知表现，无论是否诊断为ADHD的儿童。基于PBC和ADHD儿童的研究结果，我们谨慎地提供了锻炼参数的建议。\nADHD是一种神经发育障碍，其特征是在12岁前诊断为注意力不集中和/或多动和冲动[1]。据估计，全世界儿童和青少年中ADHD的流行率在5%到10%之间[，，]，最近的调查估计57%的确诊病例会持续到成年[]，这对社会和学术技能的有害影响是有据可查的[]。这一诊断的严重性突出表现为预期寿命[]下降、与其他精神疾病诊断[]和药物滥用[]共病，以及受影响儿童及其家人的生活质量下降[]。目前的治疗方法大多包括刺激性和非刺激性药物治疗以及认知治疗。哌醋甲酯(MPH)等兴奋剂对ADHD的症状有最大的积极影响，但20-25%的确诊患者对治疗没有反应，药物治疗可能伴随着身体和心理的不良反应[，]。因此，ADHD的严重性和流行率迫切要求治疗方法能够补充或加强药物和认知治疗的效果，并改善对这些治疗有弹性的儿童的生活。体力活动可以构成这样一种方法。\n对于被诊断为ADHD的儿童，她或他必须在注意力不集中和/或多动和冲动类别中至少出现九种症状中的六种。根据美国精神病学协会的精神疾病诊断和统计手册(DSM-5)[1]，儿童可以被诊断为三种ADHD表现中的任何一种：注意力不集中、多动和冲动，或者这些症状的某种组合[1]。因此，ADHD是一种伞形诊断。虽然分类诊断具有临床和实用价值，但反过来，它们可能会过度简化复杂的认知特征混合。这似乎是ADHD的情况，目前的证据表明，ADHD应该被认为是在普通人群中持续变化的特征的损害尾巴，而不是一个离散的类别[，]。这表明，总体上有益于儿童的干预或活动也与患有ADHD的儿童和青少年相关，并可能缓解ADHD的症状。众所周知，急性和有规律的体力活动(PA)可以触发广泛的生理事件，这些事件可以导致身体和心理健康以及包括记忆域在内的身体和认知功能的改善(参见例如，[]或[]以进行回顾)。相比之下，PA对认知功能的影响，与基于人群的对照(PBC)相比，已知在ADHD儿童中受到影响的研究较少。在这篇综述中，我们描述了与ADHD相关的认知表现缺陷，并回顾了运动对ADHD儿童认知表现(特别是执行功能，包括选择性注意和持续注意)的影响的实证证据。为了证实这一讨论，我们对与ADHD相关的神经生理和神经认知异常进行了表征，并为抵消或改善儿童和青少年的锻炼效果提供了一个机制框架，同时强调了近几十年来的关键研究结果。此外，我们从现有的干预研究中提取和展示了效应大小，并根据提出的神经生理学框架对这些结果进行了讨论。最后，我们将谨慎地为被诊断为ADHD的人提供急性和长期运动干预的持续时间、强度和类型的建议。\n注意力不集中的ADHD的主要症状包括注意力不集中、健忘、组织能力差和缺乏毅力，而多动和冲动与对延迟奖励的不耐烦、难以抑制不及时和不适当的运动反应以及无法将运动活动抑制到特定情况下的适当水平[1]有关。这些症状和执行功能之间的联系是毋庸置疑的[]，因此，现有的研究已经记录了认知测试中的表现缺陷(包括。执行)ADHD儿童的功能[，，]。传统上认为执行功能(EF)的三个主要方面：工作记忆、抑制控制和认知灵活性或集合转移[，]。患有ADHD的儿童在某些方面(但不是所有方面)表现不佳，很少有相同的EFS测试(例如，参见[]以进行回顾)。因此，每个孩子都有他或她自己的概况，即在EFS测试中的表现和注意力控制的结合，这反映了他或她的特殊病因。重要的是，这种跨多个NCF测试的单独性能组合可能需要关键信息\n关于急性运动对PBC儿童的影响的几个发现对本综述特别感兴趣，值得进一步讨论。根据前面的侧翼任务测试抑制性控制将PBC儿童分为高成绩组和低成绩组，Drollette等人发现，在成绩较差的儿童中，锻炼对抑制控制产生了更大的有利影响[]。根据前面提到的ADHD代表了普通人群中存在的极端特征的概念，结果表明ADHD儿童因此可能从剧烈运动中受益最多。支持这一点的几项研究报告称，在ADHD儿童的几项认知功能测试中，急性运动对表现有积极影响。Silva等人。在要求注意力的第一人称计算机模拟[]中发现了性能的提高，但据报道，部署了GO/NO-GO[，75]，FLANKER[，，]和Stroop[79，80，]测试，对抑制控制也有积极的影响。此外，通过改进的侧翼测试[]、任务转换测试[]、威斯康星州卡片分类任务[]和交替使用任务[]来探索运动诱导的认知灵活性提高的结果也被报道过。重要的是，也存在几个截然不同的发现[，87]。不同的结果可能反映了方法的异质性。例如，Craft报告说，在一轮持续1到10米的运动后，数字广度或一般智力没有变化[]。很可能~10m的持续时间不足以影响NCF随后的测试性能。\n总而言之，一些调查急性运动影响的研究发现，急性运动对认知功能的各个方面的表现都有积极的影响-ADHD儿童也是如此。除非观察到的积极影响只是暂时的，从表面上看，急性运动的有益影响可能会在几周或几个月的过程中积累成认知功能水平的差异。这种影响将反映在认知和体力活动水平之间的正相关以及长期干预后认知表现的变化上。这将在接下来的几节中讨论。\n儿童的活动水平通常直接作为在一个或多个典型日期收集的加速度计数据[]、通过体力活动问卷[]间接测量或通过评估健康水平(例如，[，])来测量。通过将健康和活动水平与NCF测试中的表现相关联，可以估计“慢性体育活动”和认知功能之间的关联。来自荟萃分析的证据支持在PBC儿童中存在正相关[，96，97]。患有ADHD的儿童比他们的PBC同龄人更不可能达到推荐的体力活动水平，根据前述研究，这可能不仅与身体能力等方面的缺陷有关，而且与认知功能的衡量标准也有关[]。在代表普通人群的大样本中(n=45,897)，Cook等人。据报道，患有ADHD的年轻人没有服用药物，或者很可能久坐不动[]。这支持了早期发现的久坐不动的生活方式的风险增加和患有ADHD的未经药物治疗的青少年肥胖的风险[]。\n布拉塞尔等人在患有多动症高危青少年(即父母和教师评定量表上≥第90个百分位数)的儿童中，发现有氧适能与修改侧翼任务中不一致试验的准确性以及较低的干扰分数呈正相关，这共同表明高适应儿童具有更好的抑制能力[]。与此相一致，侧翼任务中一致和不一致试验的响应时间更长。\n..", "note_en": "1Department of Nutrition, Exercise &amp; Sports, University of Copenhagen, 2200 Copenhagen, Denmark;  kd.uk.sxen@bim (M.M.B.);  kd.uk.sxen@ekceneiw (J.W.);  kd.uk.sxen@tsa (A.A.);  kd.uk.sxen@eybdnulj (J.L.-J.)\n 1Department of Nutrition, Exercise &amp; Sports, University of Copenhagen, 2200 Copenhagen, Denmark;  kd.uk.sxen@bim (M.M.B.);  kd.uk.sxen@ekceneiw (J.W.);  kd.uk.sxen@tsa (A.A.);  kd.uk.sxen@eybdnulj (J.L.-J.)\n 2Research Center in Neurodevelopmental Disorder (FOCUS), Child and Adolescent Mental Health Odense, Mental Health Services Region of Southern Denmark, 5000 Odense, Denmark;  kd.dysr@grebneliB.sleiN\n 1Department of Nutrition, Exercise &amp; Sports, University of Copenhagen, 2200 Copenhagen, Denmark;  kd.uk.sxen@bim (M.M.B.);  kd.uk.sxen@ekceneiw (J.W.);  kd.uk.sxen@tsa (A.A.);  kd.uk.sxen@eybdnulj (J.L.-J.)\n 1Department of Nutrition, Exercise &amp; Sports, University of Copenhagen, 2200 Copenhagen, Denmark;  kd.uk.sxen@bim (M.M.B.);  kd.uk.sxen@ekceneiw (J.W.);  kd.uk.sxen@tsa (A.A.);  kd.uk.sxen@eybdnulj (J.L.-J.)\n 1Department of Nutrition, Exercise &amp; Sports, University of Copenhagen, 2200 Copenhagen, Denmark;  kd.uk.sxen@bim (M.M.B.);  kd.uk.sxen@ekceneiw (J.W.);  kd.uk.sxen@tsa (A.A.);  kd.uk.sxen@eybdnulj (J.L.-J.)\n Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license ( http://creativecommons.org/licenses/by/4.0/).\n  Attention Deficit Hyperactivity Disorder (ADHD) is a neurodevelopmental disorder with a complex symptomatology, and core symptoms as well as functional impairment often persist into adulthood. Recent investigations estimate the worldwide prevalence of ADHD in children and adolescents to be ~7%, which is a substantial increase compared to a decade ago. Conventional treatment most often includes pharmacotherapy with central nervous stimulants, but the number of non-responders and adverse effects call for treatment alternatives. Exercise has been suggested as a safe and low-cost adjunctive therapy for ADHD and is reported to be accompanied by positive effects on several aspects of cognitive functions in the general child population. Here we review existing evidence that exercise affects cognitive functions in children with and without ADHD and present likely neurophysiological mechanisms of action. We find well-described associations between physical activity and ADHD, as well as causal evidence in the form of small to moderate beneficial effects following acute aerobic exercise on executive functions in children with ADHD. Despite large heterogeneity, meta-analyses find small positive effects of exercise in population-based control (PBC) children, and our extracted effect sizes from long-term interventions suggest consistent positive effects in children and adolescents with ADHD. Paucity of studies probing the effect of different exercise parameters impedes finite conclusions in this regard. Large-scale clinical trials with appropriately timed exercise are needed. In summary, the existing preliminary evidence suggests that exercise can improve cognitive performance intimately linked to ADHD presentations in children with and without an ADHD diagnosis. Based on the findings from both PBC and ADHD children, we cautiously provide recommendations for parameters of exercise.\n ADHD is a neurodevelopmental disorder characterized by inattention and/or hyperactivity and impulsivity diagnosed in children before the age of 12 [ 1]. Worldwide prevalence of ADHD in children and adolescents is estimated to be between 5% and 10% [ , , ] and recent surveys estimate that 57% of diagnosed cases persist into adulthood [ ], with well-documented detrimental impact on social and academic skills [ ]. The gravity of this diagnosis is underlined by the decreased life expectancy [ ], comorbidity with other psychiatric diagnoses [ ] and substance abuse [ ], along with reduced quality of life for the affected children and their families [ ]. Present treatment approaches most often include stimulant and non-stimulant pharmacotherapy along with cognitive therapy. Stimulants such as methylphenidate (MPH) show the largest positive effects on the symptomatology in ADHD, but 20–25% of the diagnosed individuals do not respond to the treatment, and pharmacotherapy can be accompanied by physical and psychological adverse effects [ , , , , , , , ]. The gravity and prevalence of ADHD thus urgently calls for therapeutic approaches which can supplement or potentiate the effect of pharmacological and cognitive treatment as well as improve the life for children resilient to these. Physical activity may constitute such an approach.\n For a child to be diagnosed with ADHD, she or he must present at least six of the nine symptoms within either the inattentive and/or the hyperactivity and impulsivity category. According to the American Psychiatric Association’s Diagnostic and Statistical Manual for Mental disorders (DSM-5) [ 1], a child can be diagnosed with either of the three ADHD presentations: inattentive, hyperactive and impulsive or some combination of these [ 1]. ADHD is thus an umbrella diagnosis. Whereas categorical diagnoses are of clinical and practical value, they may conversely oversimplify a complex mixture of cognitive traits. This appears to be the case for ADHD, where the current evidence demonstrates that ADHD should be considered as the impairing tail of traits that vary continuously throughout the general population rather than a discrete category [ , , , , ]. This suggests that interventions or activities, which benefit children, in general, are also relevant for children and adolescents with ADHD and may alleviate the ADHD symptomatology. Acute and regular physical activity (PA) are known to trigger a wide array of physiological events that can lead to improvements in physical and psychological well-being as well as physical and cognitive functions including the memory domain (see e.g., [ ] or [ ] for review). In contrast, the effects of PA on cognitive functions, which are known to be affected in children with ADHD compared to population-based controls (PBC) are sparsely studied. In this review, we describe deficits in cognitive performance associated with ADHD and review the empirical evidence suggesting effects of exercise on cognitive performance (specifically Executive Functions (EFs) including selective attention as well as sustained attention) in children with and without ADHD. To substantiate the discussion, we characterize neurophysiological and neurocognitive abnormalities associated with ADHD and provide a mechanistic framework for the counteracting or ameliorating effects of exercise in children and adolescents while highlighting key findings from the recent decades of research. Furthermore, we extract and present effect sizes from existing intervention studies and discuss these results in light of the neurophysiological framework presented. Finally, we will cautiously provide recommendation of duration, intensity, and type of acute and long-term exercise interventions for persons diagnosed with ADHD.\n The cardinal symptoms of inattentive ADHD encompass distractibility, forgetfulness, poor organization skills and low perseverance, whereas hyperactivity and impulsivity are associated with impatience for delayed rewards, difficulties in inhibition of untimely and inappropriate motor responses along with inability to dampen motor activities to appropriate levels for a given situation [ 1]. The link between these symptoms and executive functions is unmistakable [ ], and accordingly, existing research has documented performance deficits in tests of cognitive (incl. executive) functions in children with ADHD [ , , ]. Three primary aspects of executive functions (EF) are traditionally identified; working memory, inhibitory control and cognitive flexibility or set shifting [ , ]. Children with ADHD display subpar performance in some, but not all aspects, and rarely the same tests of EFs (see e.g., [ ] for review). Every child thus has his or her own profile, i.e., a combination of performance in tests of EFs and attentional control, which reflects his or her idiosyncratic etiology. Importantly, this individual combination of performances across several tests of NCFs may entail pivotal information about his or her individual path to remission. The framework for this review is thus that of assessing the effects of exercise on performance in tests of EFs and attention in children and adolescents with (and without) ADHD. The objective is to answer the question: To what extent can exercise improve cognitive deficits associated with pediatric ADHD and which modality, intensity and duration of exercise might benefit cognitive performance based on studies of acute and long-term exercise in children and adolescents with and without ADHD?\n Although ADHD is in general associated with lower performance, neuropsychological tests are in isolation unlikely to have sufficient selectivity necessary to entail clinical value [ ]. As an example, if pediatric ADHD was diagnosed based on impaired performance (&gt;90 percentile) in at least five commonly used tests for executive functions, ~10% would be identified, whereas ~50% would be identified using only the most sensitive of these (see [ ] for a discussion). Additionally, several of the tests commonly deployed to assess EF in ADHD have low construct validity (see e.g., [ ] for a discussion). At first sight, the tenet that deficits in EF may lead to the complex array of ADHD symptoms appears to be scarcely supported in the literature. As an example, meta-evidence suggests that impaired inhibitory control [ ], which is thought to be a fundamental deficit in ADHD, does not differ between individuals with ADHD and age-matched population-based controls when evaluated with the Stroop test [ ]. On the other hand, meta-analyses results for both go/no-go [ ] and stop-signal [ ] tasks reveals impaired inhibition in ADHD. As a result, meta-analyses including all three tests find small differences between PBC and ADHD populations across different tasks and test paradigms [ ]. Improving task validity may thus increase sensitivity, and recent results demonstrate that slight protocol alterations can improve validity of tasks probing working memory in ADHD [ ]. Furthermore, deploying a comprehensive test-battery including several tests within each EF domain can increase sensitivity and specificity to 89 and 80% respectively [ ]. Another important point of criticism is the practice of comparing pooled average performance scores with little attention to intra-individual variability. This may impede detection of subpar performance. Exemplified; The lower selective and sustained attention ability associated with ADHD results in lower average performance (e.g., higher mean reaction times (RT) in a flanker test), which originates in part from large intra-individual variability [ , , ]. This variability does not stem from large systematic fluctuation in trial-to-trial performance, but rather from few very high RTs, signifying lapses in attention [ ].\n Assessing internal phenomena such as cognitive processes is not straightforward and crude categorization into ‘presentations’ or ‘core symptoms’ may not be of sufficient fidelity to fully describe the idiosyncratic etiology of ADHD. Each core symptom of ADHD assessed through conventional scales (e.g., Connor’s rating scales) is influenced by several neurocognitive functions typically operationalized as performance on neurocognitive tests. Although, each cognitive construct (i.e., ‘working memory’, ‘cognitive flexibility’, ‘inhibitory control’ ‘attentional control’) involves multiple and overlapping neurophysiological processes and testing these independently is accordingly troublesome (e.g., testing WM independent of attentional control), they do provide cut out a middleman and provide a more detailed picture of the pathology. Elucidating the effect of exercise on tests of executive functions and attention (combined termed neurocognitive functions, NCF) provides vital information on how to target exercise interventions for children with ADHD.\n Meta-analyses suggest that pediatric ADHD is associated with consistently lower performance in tests of response inhibition, behavioral inhibition, reaction time variability, cognitive flexibility, choice impulsivity (delayed gratification and delay discounting tasks) and WM [ , , , , ]. As argued below, exercise might constitute an avenue to symptom amelioration by improving these NCFs. A raison d’être for this narrative review is therefore that changes in NCFs reflect changes in the clinical severity for children with ADHD. However, correlated improvements in NCFs and ADHD symptomatology suggest that this is not the case for exercise (e.g., [ ]). Furthermore, as cognitive functions develop in parallel with CNS maturation during the first two decades of our life [ ], it can be argued that e.g., subpar NCFs in pediatric ADHD is solely a matter of tardy cognitive maturation and targeting e.g., EF specifically in children makes little sense [ , , ]. However, as measures of EF influence learning behaviors more than estimates of core symptomatology [ ] and ADHD-related EF deficits are evident in adolescents [ ] and persist into adulthood [ ], it appears that deficits in NCFs (incl. EF) are of clinical importance and do not wane with central nervous maturation [ ]. In the following section, we provide a comprehensive overview of the effect of exercise on tests of NCFs where children with ADHD generally display subpar performance.\n Physical activity (PA) and exercise exerts a plethora of beneficial physiological, psychological and neurocognitive effects. These include reductions in stress [ ], anxiety [ ], depression [ ] and negative affect [ 61] along with positive influences on cognition including improved executive and memory functions (see [ ] for review). A discussion of the effects of exercise on cognition warrants a few semantic clarifications. Firstly, physical activity can be defined as any  bodily movement that results in energy expenditure [ ]. This broad definition includes both planned and deliberately executed  exercise along with everyday activities such as commuting on foot. The distinction between PA and exercise feeds into the perspectives dominating the research field; exercise may act as a neuro-enhancer and improve cognitive performance through acute and long-term effect on monoaminergic transmission, neurotrophic signaling and mechanisms of neuroplasticity (see e.g., [ ] for review). Additionally, it is also a prevalent perspective in the literature, that the cognitive load associated with engaging in physical activities and exercise (e.g., decision making processes, adherence to the rules of a game or the demands for flexible behavior as a team member [ ]) could entail training of impaired cognitive functions. The possibility of the latter is discussed below.\n During the recent years, there has been an increasing focus on acute effects of a single bout of exercise. Acute exercise increases arousal, which is accompanied by potentiated performance in a wide array of cognitive tasks. Although a single bout of exercise is unlikely to cause long-lasting changes in the cognitive functioning, the immediate effect can be harvested for relevant purposes (e.g., improved class-room behavior and learning outcome). Across cognitive domains, meta-analyses point to positive effect of acute exercise in PBC children. For combined EFs, effect sizes (ESs, either Cohen’s  d og Hedges’  g) vary from 0.19 to 0.54 [ , , , ], whereas two meta analyses score effects of exercise on measures of attention to ESs of 0.43 and 0.42 [ , ]. To the best of our knowledge, only four meta-analyses investigating the effect of exercise on cognition including children with ADHD exist [ , , 70, ]. None of these calculate the effect of acute and long-term exercise separately and we accordingly present these at the end of this section.\n A few findings on the effects of acute exercise on PBC children are of particular interest for the present review and warrant further discussion. Dividing PBC children into high and low performance groups based on a preceding Flanker’s Task testing inhibitory control, Drollette et al., found that exercise elicits larger beneficial effects on inhibitory control in the lower performing children [ ]. Based on the aforementioned notion that ADHD represents the extremes of traits present throughout the general population, the results suggest that children with ADHD are thus likely to benefit the most from acute exercise. Supporting this, several studies report positive effects of acute exercise on performance on several tests of cognitive functions in children with ADHD. Silva et al. found increased performance in an attention-demanding first person computer simulation [ ], but also positive effect on  inhibitory control has been reported deploying go/no-go [ , 75], Flanker [ , , ] and Stroop [ 79, 80, ] tests. In addition, findings of exercise-induced performance increases for cognitive flexibility probed with modified Flanker tests [ ], task-switch tests [ ], the Wisconsin card sorting task [ ] and the alternate use task [ ] have also been reported. Importantly, several contrasting findings also exist [ , , , 87]. The divergent results likely reflect methodological heterogeneity. For example Craft reported no change in digit span or general intelligence following a bout of exercise lasting 1 to 10 m [ ]. It is likely that durations of ~10 m are not sufficient to impact subsequent performance on tests of NCFs.\n In summary, some studies investigating effects of acute exercise have found positive effects on performance in various aspects of cognitive functions – also in children with ADHD. Unless the observed positive effects are merely transient, taken at face value the beneficial effects of acute exercise could in term over the course of weeks or months accumulate into differences in levels of cognitive functioning. Such effects would be reflected in both positive associations between cognition and physical activity levels and changes in cognitive performance after long-term interventions. This is discussed in the subsequent sections.\n Activity levels of children are typically measured directly as accelerometer data collected over one or more typical days [ ], indirectly through physical activity questionnaires [ ] or by assessment of the fitness level (e.g., [ , , , , ]). By correlating fitness and activity levels with performance on tests of NCFs, associations between ‘chronic physical activity’ and cognitive functions can be estimated. Evidence from meta-analyses supports a positive relation in PBC children [ , 96, 97]. Children with ADHD are less likely than their PBC peers to meet recommended levels of physical activity, and based on the aforementioned studies, this may be linked to deficits not only in physical capacity etc., but also in measures of cognitive functions [ ]. In a large sample representing the general population ( n = 45,897), Cook et al. reported that young individuals with ADHD who are unmedicated, are—or are likely to be—sedentary [ ]. This supports earlier finding of an increased risk of a sedentary lifestyle and risk of obesity in un-medicated youth with ADHD [ ].\n In preadolescent children with a high risk of ADHD (i.e., ≥90th percentile on the hyperactive/impulsive parents’ and teachers’ rating scales), Brassell et al., found a positive correlation between aerobic fitness and accuracy for the incongruent trials in a modified Flanker task as well as lower interference scores, altogether signifying better inhibitory capacity for high fit children [ ]. In line with this, longer response times across congruent and incongruent trials in the Flanker task has been rep\n......", "posttime": "2020-05-21 15:41:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "认知,adhd,exercise", "title": "运动对ADHD患者认知能力的影响", "title_en": "Effects of Exercise on Cognitive Performance with ADHD", "transed": 1, "url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6617109/", "via": "", "real_tags": ["认知", "adhd", "exercise"]}, {"category": "", "categoryclass": "", "imagename": "854dee68eed21cffd5a040064cc1d53f.jpg", "infoid": 1003091, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当苏联在1957年将人造卫星送入轨道时，美国用自己的间谍卫星进行了回应。这个名为科罗娜(Corona)的间谍项目试图定位苏联的导弹地点，但其类似谷歌地球(Google Earth)的照片捕捉到了一些意想不到的东西：动物及其栖息地的快照。现在，通过将这些图像与现代数据进行比较，科学家们找到了一种方法，可以追踪缺乏历史记录的地区的生物多样性下降情况。\n研究人员在哈萨克斯坦北部草原地区的Bobak旱獭(旱獭Bobak)种群上测试了这种方法。在那里，苏联人在20世纪60年代将数百万公顷的自然栖息地变成了农田。科学家们在美国地质调查局的数据库中搜索了卫星的黑白胶片图像，以寻找这种类似松鼠的动物洞穴的迹象。他们识别了5000多个历史悠久的土拨鼠住所，并将它们与该地区的当代数字图像进行了比较，总共绘制了12000多个土拨鼠洞穴的地图。\n研究小组今天在“皇家学会学报B”上报道，在超过50年的时间里，大约有8代土拨鼠在研究区域的同一个洞穴里居住，即使它们的栖息地发生了重大变化。总体而言，研究人员估计，自20世纪60年代以来，土拨鼠洞穴的数量减少了14%。但一些最古老的田地-那些经常受到人类犁地种植小麦的干扰-的洞穴数量暴跌得更多，约为60%。\n当土拨鼠的洞穴被犁地破坏时，土拨鼠往往会回来重建。但研究小组说，持续的人类活动可能会削弱旱獭的家庭，因为这些精力旺盛的动物花在重建上的钱对它们的健康造成了损害。作者说，随着时间的推移，长期的干扰可能显著减少了这些地区旱獭的数量。\n加州大学洛杉矶分校的生态学家和土拨鼠专家丹尼尔·布卢姆斯坦(Daniel Blumstein)没有参与这项研究，他说，研究人员几十年来一直知道土拨鼠使用相同的洞穴。但他说，多年前开垦地区洞穴的长期减少令人惊讶。\n这项研究的作者、柏林洪堡大学地理学家Catalina Munteanu说，这项工作可能是有记录以来哺乳动物对其为农业开发的栖息地做出的最长的现代反应。她说，这种方法提供了一个“非常令人兴奋”的机会，可以观察从太空中可以看到的物种数量的变化，比如白蚁土丘、河狸水坝、放牧小径，在这种情况下，还有洞穴。\n布卢姆斯坦对此表示同意。他说，像这样的工具可能会通过更好地管理我们的活动来帮助我们减少对动物栖息地的影响。", "note_en": "When the Soviet Union launched Sputnik into orbit in 1957, the United States responded with its own spy satellites. The espionage program, known as Corona, sought to locate Soviet missile sites, but its Google Earth–like photography captured something unintended: snapshots of animals and their habitats frozen in time. Now, by comparing these images with modern data, scientists have found a way to track the decline of biodiversity in regions that lack historic records.\n The researchers tested the approach on bobak marmot ( Marmota bobak) populations in the grassland region of northern Kazakhstan. There, Soviets converted millions of hectares of natural habitat into cropland in the 1960s. The scientists searched the satellites’ black and white film images on a  U.S. Geological Survey database for signs of the squirrellike animal’s burrows. They identified more than 5000 historic marmot homes and compared them with contemporary digital images of the region, mapping more than 12,000 marmot burrows in all.\n About  eight generations of marmots occupied the same burrows in the study area over more than 50 years, even when their habitats underwent major changes, the team reports today in the  Proceedings of the Royal Society B. Overall, the researchers estimate the number of marmot burrows dropped by 14% since the ’60s. But the number of burrows in some of the oldest fields—those persistently disturbed by humans plowing grassland to plant wheat—plunged by much more—about 60%.\n    When their burrows were damaged by plowed fields, marmots would often return and rebuild. But the consistent human activity likely weakened marmot families, as the energy animals spent rebuilding took its toll on their health, the team says. The prolonged disturbance may have significantly reduced marmots’ population size in those areas over time, the authors say.\n Researchers have long known that marmots use the same burrows over decades, says Daniel Blumstein, an ecologist and marmot expert at University of California, Los Angeles, who was not involved in the study. But the long-term decline of burrows in areas farmed years ago is surprising, he says.\n The work may be the longest recorded modern response of a mammal to its habitat being developed for agriculture, says study author Catalina Munteanu, a geographer at Humboldt University of Berlin. The approach, she says, offers a “really exciting” chance to look at changes in species populations that are visible from space, such as termite mounds, beaver dams, grazing trails, and, in this case, burrows.\n Blumstein agrees. Tools like this, he says, might help us reduce our impact on animal habitats by better managing our activities.", "posttime": "2020-05-21 15:19:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "卫星,war,土拨鼠", "title": "冷战卫星无意中追踪到了物种的减少", "title_en": "Cold War Satellites Inadvertently Tracked Species Declines", "transed": 1, "url": "https://www.sciencemag.org/news/2020/05/cold-war-satellites-inadvertently-tracked-species-declines", "via": "", "real_tags": ["卫星", "war", "土拨鼠"]}]