[{"category": "", "categoryclass": "", "imagename": "f01fae422ea4a51ce6139e5a1e603d31.jpg", "infoid": 1001332, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在大多数情况下，补充剂往好了说是浪费钱，往坏了说是有害的。但是，维生素D会不会是一个值得注意的例外--现在比以往任何时候都要特殊呢？让我们来看看吧。\n事实证明，没有什么比大流行更能引发营养狂热了。吃大量大蒜和在汤里加辣椒是世界卫生组织选择揭穿的冠状病毒的两种“疗法”，但在冠状病毒危机期间，有许多同样疯狂、增强免疫力的食物骗局已经变得“病毒式”传播。\n简单地说，你不能通过饮食来“增强”你的免疫系统，没有任何特定的食物或补充剂可以防止你感染冠状病毒。\n然而，这并不是说均衡的饮食不会对你的整体健康有所帮助，也不是说一些营养素在帮助免疫系统发挥作用方面确实有特别公认的作用。\n欧盟营养与健康声明登记册列出了10种与免疫功能有可信联系的维生素和矿物质。尽管存在所有潜在缺陷，但该数据库可以说是世界上最有用的食品健康声明科学评估数据库。它们是铜、叶酸、铁、硒、维生素A、维生素B12、维生素B6、维生素C、维生素D和锌。\n所有这些营养素都可以从不同的饮食中获得，所有的证据都表明这是获得它们的最好方式。对于大多数人来说，好的饮食应该是蔬菜、水果、全谷物、豆类和坚果含量高，含有适量的鱼、乳制品、家禽和液体油，以及少量的红肉和加工肉类、精制碳水化合物和糖。\n然而，维生素D可能是一个例外，因为它不是那么容易从食物中获得的，而且在包括美国在内的所有人群中都普遍缺乏。这一点，以及随着温暖月份的到来，我们在很大程度上仍然被封锁，无法充分利用来自太阳的维生素D的事实，使得它在冠状病毒方面值得研究。\n维生素D/冠状病毒的研究热潮无疑正在快速发展。这些是仅在上个月发布的三篇不同的三篇论文的片段。\n·科学家在一项研究中发现，75岁以下的ICU冠状病毒患者100%存在维生素D不足。\n·在另一例患者中，在血清维生素D代谢物水平较高(超过30 ng/ml 25-羟基胆钙化醇)的55名患者中，47名患者症状轻微，4名患者症状“一般”，2名患者症状严重，2名患者症状危急。低维生素D(&lt;30 ng/ml 25-羟胆钙化醇)157例中，轻度症状2例，一般症状55例，重度症状54例，危重症状46例。\n·研究人员发现，第三项研究发现，在整个欧洲国家，维生素D水平与人均冠状病毒病例和死亡率之间存在很强的关联。\n这里需要特别注意，就像所有与冠状病毒快速释放相关的研究一样，这些都是非同行评审的预印本。此外，通常存在相关性与因果关系的局限性。维生素D含量较低与年龄增长和皮肤变黑有关，这两者都与免疫功能下降独立相关-在年老的情况下直接或通过少数民族人群中较高的糖尿病发病率(与较高的冠状病毒风险有关)。\n然而，目前冠状病毒维生素D研究的热潮并不是凭空而来的。之前的研究已经指出，维生素D缺乏可能是脓毒症风险的生物标志物，而围绕维生素D在预防感染和死亡方面的潜在益处的数据一直在增长。\n特别是，一项系统的综述和荟萃分析整理了25项随机对照试验(RCT)的证据，这些试验向所有患有急性呼吸道感染的年龄组服用维生素D补充剂，发现所有参与者都有保护作用，特别是那些基线25-羟基维生素D水平表明缺乏的人。\n到目前为止，还没有研究结果表明维生素D补充剂已经直接在冠状病毒患者身上进行了测试，尽管这很可能会出现。法国最近启动了一项临床随机对照试验，将测试在感染早期给予大剂量维生素D的效果，与标准剂量相比，对老年维生素D缺乏冠状病毒感染的成年人的死亡率的影响。\n在冠状病毒危机期间，你是否应该服用维生素D药片以防万一？维生素D显然不是灵丹妙药，很可能只有在缺乏时才有用。\n然而，由于维生素D非常实惠，而且风险/收益比似乎是有利的，对大多数人来说，补充剂可能是合理的。如果你是黑人或棕色，年迈或在家完全与世隔绝，情况尤其如此。\n“鉴于[维生素D]罕见的副作用和相对较宽的安全边际，它可能是许多疾病的一种重要、廉价和安全的辅助疗法，”“欧洲临床营养学杂志”(European Journal Of Clinic Nutrition)最近一篇关于这种营养素的叙述性综述的作者说。\n在未来大型和精心设计的研究完成之前，我们只是不知道维生素D对冠状病毒的具体影响。但是，增加你的摄入量肯定是所有营养想法中最不疯狂的。", "note_en": "For the most part, supplements are a waste of money at best and harmful at worst. But could vitamin D be a notable exception – now more than ever? Let&#39;s take a look.\n    Turns out there’s nothing quite like a pandemic to bring out the nutrition crazies. Eating lots of garlic and adding hot peppers to your soup are two “cures” for COVID-19 that the World Health Organization has chosen to debunk, but there are any number of equally-bonkers, immune-boosting food scams that have gone “viral” during the coronavirus crisis.\n Simply put, you can’t “boost” your immune system through diet, and no specific food or supplement will prevent you from becoming infected with the coronavirus.\n However, that’s not to say that eating a balanced diet won’t help your general health, nor indeed that some nutrients do have specifically recognized roles in helping the immune system to function.\n  The EU Register on Nutrition and Health Claims – which for all its potential flaws is arguably the world’s most useful database of scientifically assessed health claims for food – lists 10 vitamins and minerals as having credible links to immune function. These are copper, folate, iron, selenium, vitamin A, vitamin B12, vitamin B6, vitamin C, vitamin D and zinc.\n All these nutrients are available from a varied diet and all the evidence suggests this is the best way to obtain them. A good diet for most people will be one that’s heavy in vegetables, fruits, whole grains, pulses and nuts, contains moderate amounts of fish, dairy, poultry and liquid oils, and smaller amounts of red and processed meat, refined carbohydrates and sugar.\n  However, vitamin D could be something of an exception as it’s not so easy to get from food and is widely deficient across populations, including  in the US. This and the fact that as warmer months arrive we&#39;re still largely locked down and unable to take full advantage of vitamin D from the sun makes it worthy of study in relation to COVID-19.\n And the vitamin D/COVID-19 research bandwagon is certainly moving apace. These are snippets from three different three papers released in the last month alone.\n ·       In  one study it was found that 100% of ICU COVID-19 patients less than 75 years old had vitamin D insufficiency.\n ·       In  another, out of  55 patients with higher blood serum levels of vitamin D metabolite (more than 30ng/ml 25-hydroxycholecalciferol), 47 had mild symptoms, 4 had “ordinary” symptoms, 2 had severe symptoms and 2 had critical symptoms. Of the 157 patients with lower vitamin D (less than 30ng/ml 25-hydroxycholecalciferol), 2 had mild symptoms, 55 ordinary symptoms, 54 severe symptoms and 46 critical symptoms.\n ·        The third found that across European countries, there was a strong association between vitamin D levels and per capita COVID-19 cases and mortality.\n A huge dollop of caution is needed here, as with like all rapid release coronavirus-related research these are non-peer reviewed preprints. Moreover, there’s the usual limitation of correlation versus causation. Lower vitamin D is associated with increasing age and darker skin, both of which link independently with decreased immune function – directly in the case of old age or via higher diabetes rates (linked to higher COVID-19 risk) in ethnic populations.\n  Nevertheless, the current rush of COVID-19 vitamin D studies didn’t just come out of nowhere. Previous studies have noted that vitamin D deficiency may be a  biomarker of sepsis risk, while data has been growing around a potential benefit of the vitamin D in prevention of and mortality from infections.\n In particular, a  systematic review and meta-analysis collating evidence from 25 randomized controlled trials (RCTs) that gave vitamin D supplements to all age groups with acute respiratory infections found protective effects among all participants, but particularly among those with baseline 25-hydroxyvitamin D levels indicative of deficiency.\n So far there are no results from studies in which vitamin D supplements have been tested directly in patients with COVID-19, though this will likely come. A French clinical RCT was recently started that will test the effects of a large single vitamin D-dose, administered early in infection, compared to a standard dose, on the mortality of older vitamin D-deficient COVID-19 infected adults.\n  Should you take vitamin D pills during the coronavirus crisis just in case? Vitamin D is clearly not a panacea and is most likely useful only in deficiency.\n However, because vitamin D is very affordable and the risk/benefit ratio seems to be favorable, supplements might be reasonable for most people to consider. This is especially so if you are black or brown, are elderly or fully isolating at home.\n “Given [vitamin D’s] rare side effects and its relatively wide safety margin, it may be an important, inexpensive, and safe adjuvant therapy for many diseases,” say the authors of a recent narrative review of the nutrient in the  European Journal of Clinical Nutrition\n Until future large and well-designed studies are completed we just don’t know what the impact of vitamin D might be in COVID-19 specifically. But upping your intake is certainly the least crackpot of all the nutrition ideas out there.", "posttime": "2020-05-09 06:23:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,维生素,病毒,vitamin", "title": "维生素D与冠状病毒：迄今的证据", "title_en": "Vitamin D and Covid -19: The Evidence So Far", "transed": 1, "url": "https://www.acsh.org/news/2020/05/04/vitamin-d-covid-19-evidence-so-far-14763", "via": "", "real_tags": ["冠状病毒", "维生素", "病毒", "vitamin"]}, {"category": "", "categoryclass": "", "imagename": "00cbe635fbddb038e873d37f811a26eb.jpg", "infoid": 1001331, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国4月失业率跳升至14.7%，为大萧条以来的最高水平，因许多企业关闭或严重缩减业务，试图限制这种致命冠状病毒的传播。\n劳工部表示，2050万人突然失去工作，在一个月内抹去了十年的就业增长。损失的速度和程度无法与之相比。这大约是2007年至2009年整个金融危机期间美国经历的两倍。\n随着病毒在3月份加速传播，特朗普总统和一些州和地方领导人出台了限制措施，导致企业突然关闭并裁员数百万人。许多企业和家庭也取消了所有的旅行计划。分析人士警告称，可能需要数年时间才能回到美国2月份记录的3.5%的失业率，部分原因是即使科学家在疫苗方面取得进展，也不清楚大流行后的经济将是什么样子。\n不过，特朗普在周五接受福克斯新闻(Fox News)采访时声称，经济将迅速反弹。\n特朗普说：“这些工作岗位都会回来，而且很快就会回来。”\n前副总统乔·拜登(Joe Biden)预计是特朗普在11月总统选举中的竞争对手，他在NowThis News播出的讲话中表示，就业报告显示了一场“经济灾难”，这场灾难在一定程度上是由于白宫今年早些时候对危机反应迟缓和不平衡而“雪上加霜”的。\n华尔街对裁员这一毁灭性的消息不屑一顾。道琼斯工业平均指数周五上涨455.43点。自4月初以来，股市一直在上涨，很大程度上是因为政府对企业的援助达到了创纪录的水平，而且人们乐观地认为治愈方法即将到来。然而，从上一次衰退中得到的教训是，华尔街的复苏远远早于全国其他地区。\n“这相当可怕，”Stifel Fixed Income首席经济学家Lindsey Piegza表示.。“我担心许多这样的工作岗位不会再回来了，我们的失业率将一直持续到2021年，接近10%。”\n严峻的就业数据可能会给一些正在辩论何时重新开放部分州经济的州长带来更大的紧迫性。分析人士说，许多人正在权衡健康风险和经济损失，这是一个令人痛苦的选择。一些人希望迅速重新开业能让人们重返工作岗位，但由于许多企业部分产能运营，父母们正在努力应对育儿挑战，这将是困难的。\n突如其来的经济收缩已经迫使数百万美国人转向食品银行，首次寻求政府援助，或者停止支付租金和其他账单。由于几个星期没有工资，一些人还失去了医疗保险，甚至把自己的房子挂牌出售。人们越来越担心，随着人们从中产阶级中脱颖而出，年轻人难以开始职业生涯，这种损害将是永久性的。\n密歇根州立大学(Michigan State University)教授、美国总统巴拉克·奥巴马(Barack Obama)的前经济顾问丽莎·库克(Lisa Cook)表示：“这对女性和年轻人的影响尤其令人震惊，而且不成比例。”“那些在大萧条时期长大的人，对余生的消费犹豫不决。”\n失业开始于酒店业，4月份减少了770万个工作岗位，但其他行业也受到了严重影响。零售业减少了210万个工作岗位，制造业减少了130万个工作岗位。通常在经济低迷时期被证明具有弹性的白领和政府工作岗位也被大幅削减，公司裁员210万人，州和地方政府裁员近100万人。未来几周，随着官员们应对严重的预算短缺，可能会削减更多的州和地方政府工作岗位。\n上个月甚至有140万人在医疗保健领域裁员，因为患者推迟了牙科护理、小手术和其他紧急情况以外的事情。\n从任何标准来看，四月份的失业率都是可怕的，然而经济学家说它低估了痛苦的程度。劳工部表示，如果那些声称因“其他原因”缺勤的工人被归类为失业或暂时停职，失业率将在20%左右。官方数据也不包括数百万完全离开劳动力的工人和被迫缩减为兼职的500万人。\n到目前为止清楚的是，拉美裔、非裔美国人以及餐饮业和零售业的低薪工人受到就业危机的打击最大。这些工人中的许多人已经靠工资过活了，在大流行来袭之前，他们的缓冲最少。\n专注于就业和薪资趋势的ADP研究所联席主管Ahu Yildirmaz表示：“低薪工人现在正在经历他们自己的大萧条。”\n4月份，拉美裔失业率跃升至创纪录的18.9%，非裔美国人失业率为16.7%，亚裔失业率为14.5%，白人失业率为14.2%。\n女性的失业率比男性高出近3个百分点，这在很大程度上反映了女性在遭受重创的酒店业和零售业工作中的普遍程度。\n这是有记录以来最大的性别失业差距--之前的最高纪录是在大衰退期间创下的。那一次，受打击最严重的是那些男人。\n教育也成为经济衰退中最明显的鸿沟之一。虽然许多受过高等教育的白领已经能够在家工作，但低薪工人却没有这种奢侈品。其结果是，没有接受过任何大学教育的工人失业的比例大约是大学毕业生同龄人的四倍。\n4月份，高中学历以下人群的失业率飙升至21.2%，超过了大衰退后创下的历史新高。\n虽然国会已经批准了近3万亿美元的援助，但对许多人来说，援助到达的速度一直很慢。数百万人仍在与过时的网站和拥堵的电话线作斗争，试图获得失业援助和救济支票。经济学家敦促国会现在采取行动，确保援助不会在今年夏天结束，届时失业率仍可能处于历史水平。\n前美联储工作人员、经济衰退专家、经济学家克劳迪娅·萨姆(Claudia Sahm)表示：“这个失业率应该是一个真正的打击--甚至可能是对面子的打击。”“国会必须坚持援助方案，直到更多的人重返工作岗位。”\n越来越多的人达成共识，认为经济不会像特朗普希望的那样迅速反弹，尽管本月会有更多企业重新开业。许多餐馆、健身房和其他企业将只能在有限的容量下运营，而由于害怕冒险外出，事实证明，顾客回来的速度很慢。许多企业将无法生存。所有这一切都意味着，在未来几个月-甚至可能几年-经济需要的工人将会少得多。\n克利夫兰联邦储备银行总裁洛蕾塔·梅斯特(Loretta Mester)在接受采访时表示，“这不像是转动电灯开关，一切都回到了2月份的水平。”“我们很快就减少了所有的人口。重新填充它将需要更长的时间。“。\n梅斯特说，目前对经济最好的治疗方法可能是更多的病毒测试、监测和对冠状病毒治疗的投资。如果没有这些措施，即使商店和餐馆重新开张，人们也不太可能再次外出消费。\n梅斯特说，“下半年仍有很大的不确定性.”“自3月中旬以来，消费者信心一直非常、非常糟糕。”\n许多企业最初进行了临时裁员，因为高管认为停摆将是短暂的。根据劳工部的数据，4月份约有1800万失业者表示，他们的裁员是暂时的，相比之下，只有约200万人表示，他们的失业是永久性的。但随着时间的推移，预计永久性裁员将会升级。劳工部在4月中旬对工人进行了调查。\n“这是一场灾难。当情况跌落悬崖时，他们通常不会很快恢复，“达特茅斯学院经济学教授David BlanchFlower说。\n许多新失业的人面临着仅仅几个月前他们还无法想象的压力。\n艾琳·惠勒(Erin Huyler)在佛罗里达州基韦斯特经营着一家托儿服务公司，该公司于3月中旬被迫关闭。她不确定什么时候重新开放是安全的，特别是因为她观察的许多孩子都是来自其他州和国家的旅行者的孩子。\n国会批准了为失业者提供额外资金，并扩大了该计划，以便零工工人和惠勒等个体户可以申请。但惠勒的经历表明，仍有数百万人在等待救援物资的到来。已有超过7500人写信给“华盛顿邮报”，表示他们仍在等待。\n惠勒还没有拿到救济金或失业金。她终于在银行账户上看到了一笔存款，这笔存款是她几周前申请的小企业管理局(SBA)紧急贷款。\n“这是有帮助的，但在失业七周后，1，000美元并不是一大笔钱，”惠勒说。", "note_en": "The U.S. unemployment rate jumped to 14.7 percent in April, the highest level since the Great Depression, as many businesses shut down or severely curtailed operations to try to limit the spread of the deadly  coronavirus.\n The Labor Department  said 20.5 million people abruptly lost their jobs, wiping out a decade of employment gains in a single month. The speed and magnitude of the loss defies comparison. It is roughly double what the nation experienced during the entire financial crisis from 2007 to 2009.\n As the virus’s rapid spread accelerated in March, President Trump and a number of state and local leaders put forth restrictions that led businesses to suddenly shut down and shed millions of workers. Many businesses and households also canceled all travel plans. Analysts warn it could take years to return to the  3.5 percent unemployment rate the nation recorded in February, in part because it is unclear what the post-pandemic economy will look like, even if scientists make progress on a vaccine.\n   Trump, though, claimed in a Fox News interview Friday that there would be a quick rebound.\n “Those jobs will all be back, and they’ll be back very soon,” Trump said.\n Former vice president Joe Biden, Trump’s expected opponent in November’s presidential election, said in remarks broadcast by NowThis News that the jobs report illustrated “an economic disaster” that was “made worse” in part by a slow and uneven White House response to the crisis earlier this year.\n   Wall Street shrugged off the devastating news about layoffs. The Dow Jones industrial average gained 455.43 points on Friday. Stocks have rallied since early April, largely because of record levels of government aid for businesses and optimism  that a cure is near. The lesson from the last recession, however, was that Wall Street recovered long before the rest of the country.\n    “This is pretty scary,” said Lindsey Piegza, chief economist at Stifel Fixed Income. “I’m fearful many of these jobs are not going to come back and we are going to have an unemployment rate well into 2021 of near 10 percent.”\n The stark employment data could create even more urgency for a number of governors who are debating  when to reopen parts of their state economies. Many are weighing the health risks and the economic toll, a harrowing choice, analysts say. Some hope that reopening quickly will get people back to work, but it will be difficult with many businesses operating at partial capacity and parents wrestling with child-care challenges.\n The sudden economic contraction has already forced millions of Americans to  turn to food banks,  seek government aid for the first time or stop paying rent and other bills. As they go without paychecks for weeks, some have also  lost health insurance and even put their homes up for sale. There is a growing concern that the damage will be permanent as people  fall out of the middle class and young people struggle to launch careers.\n   “The impact on women and youth is particularly shocking and disproportionate,” said Lisa Cook, a professor at Michigan State University and former economic adviser to President Barack Obama. “Those who grew up during the Great Depression were hesitant to spend for the rest of their lives.”\n  Job losses began in the hospitality sector, which shed 7.7 million jobs in April, but other industries were also heavily affected. Retail lost 2.1 million jobs, and manufacturing shed 1.3 million jobs. White-collar and government jobs that typically prove resilient during downturns were also slashed, with companies shedding 2.1 million jobs and state and local governments losing nearly a million. More state and local government jobs could be cut in the coming weeks as officials  deal with severe budget shortfalls.\n  There were even  1.4 million layoffs in health care last month as patients put off dental care, minor surgeries and other things beyond emergencies.\n April’s unemployment rate was horrific by any standard, yet economists say it  underestimates the extent of the pain. The Labor Department said the unemployment rate would have been about 20 percent if workers who said they were absent from work for “other reasons” had been classified as unemployed or furloughed. The official figure also does not count millions of workers who  left the labor force entirely and the  5 million who were forced to scale back to part time.\n  What is clear so far is that Hispanics, African Americans and low-wage workers in restaurants and retail have been hit hardest by the job crisis. Many of these workers were already living paycheck to paycheck and had the least cushion before the pandemic hit.\n   “Low-wage workers are experiencing their own Great Depression right now,” said Ahu Yildirmaz, co-head of the ADP Research Institute, which focuses on job and wage trends.\n The unemployment rate in April jumped to a record 18.9 percent for Hispanics, 16.7 percent for African Americans, 14.5 percent for Asians and 14.2 percent for whites.\n  Women’s unemployment was nearly three points higher than men’s, another disparity that largely reflects the prevalence of women in hard-hit hospitality and retail jobs.\n It’s the  largest gender-unemployment gap on record — the previous high was set during the Great Recession. That time, it was the men who were hit hardest.\n  Education has also emerged as one of the downturn’s starkest divides. While many highly educated white-collar workers have been able to do their jobs from home, low-wage workers do not have that luxury. The result is workers without any college education are losing their jobs at about four times the rate of their college-graduate peers.\n In April, the unemployment rate soared to 21.2 percent for people with less than a high school degree, surpassing the previous all-time high set in the aftermath of the Great Recession.\n  While Congress has approved nearly $3 trillion in aid, it has been slow to arrive for many. Millions are still battling outdated websites and jammed phone lines to try to get unemployment aid and a relief check. Economists are urging Congress to act now to ensure aid does not end this summer, when the unemployment rate is still likely to be at historic levels.\n   “This unemployment rate should be a real kick in the pants — and maybe even the face,” said economist Claudia Sahm, a former Federal Reserve staffer and expert on recessions. “Congress has to stay the course on aid until more people are back at work.”\n There is a growing consensus that the economy is not going to bounce back quickly, as Trump wants, even as more businesses reopen this month. Many restaurants, gyms and other businesses will be able to operate only at limited capacities, and customers, fearful of venturing out, are proving to be slow to return. And many businesses will not survive. All of this means the economy is going to need far fewer workers for months — or possibly years — to come.\n “It’s not like turning a light switch and everything goes back to where it was in February,” Loretta Mester, president of the Federal Reserve Bank of Cleveland, said in an interview. “We depopulated everything quickly. Repopulating it will take a lot longer.”\n   Mester said the best cure for the economy at this point is probably more virus testing, monitoring and investment in a covid-19 treatment. Without those measures, people are unlikely to go out and spend again, even if stores and restaurants reopen.\n “There’s still a lot of uncertainty about the second half of the year,” Mester said. “Consumer confidence has been really, really bad since mid-March.”\n Many businesses initially did temporary layoffs because executives believed the shutdowns would be short-lived. About 18 million of the unemployed in April said their layoff was temporary, according to Labor Department data, compared with only about 2 million who said their job loss was permanent. But permanent layoffs are expected to escalate as time goes on. The Labor Department surveyed workers in mid-April.\n   “This is a catastrophe. When things go over a cliff, they usually they don’t recover quickly,” said David Blanchflower, an economics professor at Dartmouth College.\n Many of the newly unemployed face strains they could not imagine just a few months ago.\n Erin Huyler runs a child-care service in Key West, Fla., that was forced to close in mid-March. She is not sure when it will be safe to reopen, especially since many of children she watches are the kids of travelers visiting from other states and nations.\n Congress approved additional money for the unemployed and expanded the program so gig workers and the self-employed, such as Huyler, could apply. But Huyler’s experience is indicative of that of millions still waiting for aid to arrive. Over 7,500 people have written in to The Washington Post about how they are still waiting.\n   Huyler has yet to get the relief check or unemployment money. She finally saw a deposit in her bank account for the Small Business Administration emergency loan she applied for weeks ago.\n “That was helpful, but $1,000 is not a lot of money after seven weeks of unemployment,” Huyler said.", "posttime": "2020-05-09 05:54:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "失业率,rate", "title": "美国失业率飙升至14.7%，为大萧条时代以来最差", "title_en": "US Unemployment Rate Soars To 14.7%, the Worst Since the Depression Era", "transed": 1, "url": "https://www.washingtonpost.com/business/2020/05/08/april-2020-jobs-report/", "via": "", "real_tags": ["失业率", "rate"]}, {"category": "", "categoryclass": "", "imagename": "3b52d88c0f7c602935a2c43fac9a7161.png", "infoid": 1001330, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "要了解如何使用Async-GraphQL、WARP、DIESEL和amp；PostgreSQL创建符合中继标准的服务器，您还可以在以下网址查看一个实际示例：https://github.com/phated/twentyfive-stars", "note_en": "To see how you would create a Relay-compliant server using async-graphql, warp, diesel &amp; postgresql, you can also check out a real-world example at:  https://github.com/phated/twentyfive-stars", "posttime": "2020-05-09 05:53:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "graphql,rust,服务器,twentyfive", "title": "异步GraphQL：Rust中功能最全的GraphQL服务器框架", "title_en": "Async-GraphQL: The most fully-featured GraphQL server framework in Rust", "transed": 1, "url": "https://github.com/async-graphql/async-graphql", "via": "", "real_tags": ["graphql", "rust", "服务器"]}, {"category": "", "categoryclass": "", "imagename": "142c6da180da747f644ecea0184dec55.png", "infoid": 1001329, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "全球网站速度分析器", "note_en": "Global Website Speed Profiler", "posttime": "2020-05-09 05:53:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "fast,网站", "title": "快或慢", "title_en": "Fast or Slow", "transed": 1, "url": "https://www.fastorslow.com/", "via": "", "real_tags": ["fast", "网站"]}, {"category": "", "categoryclass": "", "imagename": "9d100115521a943a0cdf78948f0b9db4.jpg", "infoid": 1001328, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "紫疹、腿部肿胀、导管堵塞和猝死--大大小小的血块都是冠状病毒的常见并发症，研究人员刚刚开始解开其中的原因。几周来，关于这种疾病对全身的影响的报道如雨后春笋般涌入，其中许多是由血块引起的。“这就像一场血块风暴，”纽约市哥伦比亚大学心脏病学四年级研究员贝努德·比克德利(Behnood Bikdeli)说。任何患有严重疾病的人都有发展成血栓的风险，但住院的冠状病毒患者似乎更容易受到影响。\n荷兰和法国的研究表明，20%到30%的危重冠状病毒患者1、2会出现凝块。科学家们有几个看似合理的假设来解释这一现象，他们刚刚开始开展旨在获得机理洞察力的研究。但随着死亡人数的上升，他们也在争先恐后地测试抑制血栓的药物。\n血液凝块，即凝胶状的细胞和蛋白质，是身体止血的机制。一些研究人员认为凝血是冠状病毒的一个关键特征。但让科学家们感到困惑的不仅仅是它们的存在，还有它们的出现方式。都柏林皇家外科学院爱尔兰血管生物学中心主任詹姆斯·奥唐奈(James O‘Donnell)说：“演讲有很多地方有点不同寻常。”\n血液稀释剂不能可靠地防止冠状病毒携带者的凝血，年轻人正在死于大脑阻塞引起的中风。许多住院患者体内一种名为D-二聚体的蛋白质片段水平急剧升高，这种蛋白质片段是在凝块溶解时产生的。高水平的D-二聚体似乎是感染3型冠状病毒的住院患者死亡率的有力预测因子。\n研究人员还观察到人体最小血管中的微小凝块。纽约市威尔·康奈尔医学院的血液学家杰弗里·劳伦斯和他的同事们检查了三名冠状病毒感染者的肺和皮肤样本，发现毛细血管被凝块堵塞4，包括奥唐奈领导的团队在内的其他小组也报告了类似的发现5。\n他说：“这不是你希望在一个刚刚感染严重的人身上看到的。”“这真的是非常新的。”这可能有助于解释为什么有些人的血氧读数极低，以及为什么机械通气往往无济于事。O‘Donnell说，这是一次“双重打击”。肺炎会用液体或脓液堵塞肺部的微囊，微凝块会限制含氧血液通过它们。\n为什么会发生这种凝血仍然是个谜。一种可能性是SARS-CoV-2直接攻击血管内皮细胞。内皮细胞拥有与病毒进入肺细胞相同的ACE2受体。有证据表明血管内皮细胞可以被感染：来自德国苏黎世大学医院和马萨诸塞州波士顿布里格姆妇女医院的研究人员在肾组织内的内皮细胞中观察到了SARS-CoV-2。渥太华大学心脏研究所的首席科学官彼得·刘(Peter Liu)表示，在健康人中，血管是“一条非常光滑的管道”。衬里可以有效地阻止血块的形成。但病毒感染会破坏这些细胞，促使它们大量生产触发这一过程的蛋白质。\n病毒对免疫系统的影响也可能影响凝血。在一些人中，冠状病毒促使免疫细胞释放大量化学信号，加剧炎症，这与凝血和凝结通过各种途径有关。病毒似乎激活了补体系统，这是一种引发凝血的防御机制。劳伦斯的研究小组发现，来自冠状病毒携带者的肺部和皮肤组织中堵塞的小血管中布满了补体蛋白。加拿大温哥华不列颠哥伦比亚大学血液学研究项目主任Agnes Lee说，所有这些系统-补体、炎症、凝血-都是相互关联的。“在一些COVID患者中，所有这些系统都处于超驱动状态。”\n但李补充说，可能还有其他因素在起作用，而不是冠状病毒所特有的。住院的患有这种疾病的人通常有许多凝血的危险因素。他们可能年事已高或超重，可能患有高血压或糖尿病。他们会发高烧，因为他们病得很重，很可能已经被固定住了。他们可能有凝血的遗传倾向，或者正在服用增加风险的药物。“这有点像一场完美的风暴，”她说。\n就在研究人员开始解开冠状病毒携带者体内凝血是如何发生的时候，他们正在加紧测试旨在预防和破坏凝块的新疗法。血液稀释药物是重症监护病房患者的标准护理，冠状病毒携带者也不例外。但剂量是一个激烈辩论的问题。“现在的问题是，你应该有多积极？”纽约市贝丝以色列女执事医疗中心动态部和血栓部主任罗伯特·弗劳门哈夫特说。同样位于纽约市的西奈山医学院(Mount Sinai School Of Medicine)的研究人员报告称，接受血液稀释剂治疗的机械通气冠状病毒住院患者的死亡率比没有接受治疗的患者低。但研究小组不能排除观察到的其他解释，而且高剂量的这些药物存在风险7。\n在纽约市的哥伦比亚大学，研究人员正在启动一项临床试验，以比较标准剂量的血液稀释剂和更高剂量的血液稀释剂在患有冠状病毒的危重患者中的作用。加拿大和瑞士也计划进行类似的试验。贝丝以色列女执事医疗中心的科学家们已经开始注册一项临床试验，以评估一种名为组织型纤溶酶原激活剂(TPA)的更有效的解栓药物。这种药物效力更强，但与血液稀释剂相比，严重出血的风险更高。\n科学家们希望这些试验和其他试验将提供必要的数据，帮助医生做出困难的治疗决定。李光耀担心发生的“反动医学”的数量。“人们正在改变他们的治疗方法，以回应他们的当地和个人经验，”她说。她理解这种动力，“但我们必须记住，首要的是不伤害他人”。", "note_en": "Purple rashes, swollen legs, clogged catheters and sudden death — blood clots, large and small, are a frequent complication of COVID-19, and researchers are just beginning to untangle why. For weeks, reports have poured in of the disease’s effects throughout the body, many of which are caused by clots. “This is like a storm of blood clots,” says Behnood Bikdeli, a fourth-year cardiology fellow at Columbia University in New York City. Anyone with a severe illness is at risk of developing clots, but hospitalized patients with COVID-19 appear to be more susceptible.\n Studies from the Netherlands and France suggest that clots appear in 20% to 30% of critically ill COVID-19 patients  1 ,  2. Scientists have a few plausible hypotheses to explain the phenomenon, and they are just beginning to launch studies aimed at gaining mechanistic insights. But with the death toll rising, they are also scrambling to test clot-curbing medications.\n  Blood clots, jelly-like clumps of cells and proteins, are the body’s mechanism to stop bleeding. Some researchers view clotting as a key feature of COVID-19. But it’s not just their presence that has scientists puzzled: it’s how they show up. “There are so many things about the presentations that are a little bit unusual,” says James O’Donnell, director of the Irish Centre for Vascular Biology at the Royal College of Surgeons in Dublin.\n  Blood thinners don’t reliably prevent clotting in people with COVID-19, and young people are dying of strokes caused by the blockages in the brain. And many people in hospital have drastically elevated levels of a protein fragment called D-dimer, which is generated when a clot dissolves. High levels of D-dimer appear to be a powerful predictor of mortality in hospitalized patients infected with coronavirus  3.\n Researchers have also observed miniature clots in the body’s smallest vessels. Jeffrey Laurence, a haematologist at Weill Cornell Medicine in New York City, and his colleagues examined lung and skin samples from three people infected with COVID-19 and found that the capillaries were clogged with clots  4. Other groups, including a team led by O’Donnell, have reported similar findings  5.\n  “This is not what you&#39;d expect to see in someone who just has a severe infection,” he says. “This is really very new.” This might help to explain why some people have critically low blood-oxygen readings, and why mechanical ventilation often doesn’t help. It’s a “double hit”, says O’Donnell. Pneumonia clogs the tiny sacs in the lungs with fluid or pus, and microclots restrict oxygenated blood from moving through them.\n  Why this clotting occurs is still a mystery. One possibility is that SARS-CoV-2 is directly attacking the endothelial cells that line the blood vessels. Endothelial cells harbour the same ACE2 receptor that the virus uses to enter lung cells. And there is evidence that endothelial cells can become infected: researchers from the University Hospital Zurich in Germany and Brigham and Women’s Hospital in Boston, Massachusetts, observed SARS-Cov-2 in endothelial cells inside kidney tissue  6. In healthy individuals, the blood vessel is “a very smoothly lined pipe”, says Peter Liu, chief scientific officer at the University of Ottawa Heart Institute. The lining actively stops clots from forming. But viral infection can damage these cells, prompting them to churn out proteins that trigger the process.\n The virus’s effects on the immune system could also affect clotting. In some people, COVID-19 prompts immune cells to release a torrent of chemical signals that ramps up inflammation, which is linked to coagulation and clotting through a variety of pathways. And the virus appears to activate the complement system, a defence mechanism that sparks clotting. Laurence’s group found that small, clogged vessels in lung and skin tissue from people with COVID-19 were studded with complement proteins. All these systems — complement, inflammation, coagulation — are interrelated, says Agnes Lee, director of the Hematology Research Program at the University of British Columbia in Vancouver, Canada. “In some patients with COVID, all of those systems are kind of in hyperdrive.”\n  But Lee adds that there could be other factors at play that aren&#39;t specific to COVID-19. People with the disease who become hospitalized typically have a number of risk factors for clotting. They might be elderly or overweight, and could have high blood pressure or diabetes. They show up with high fevers and, because they’re seriously ill, have probably been immobilized. They might have a genetic predisposition to clotting, or be taking medications that increase the risk. “It&#39;s kind of like a perfect storm,” she says.\n  Even as researchers begin to unravel how clotting occurs in people with COVID-19, they’re sprinting to test new therapies aimed at preventing and busting clots. Blood-thinning medications are standard of care for patients in the intensive-care unit, and those with COVID-19 are no exception. But dosing is a matter of hot debate. “The question is now, how aggressive should you be?” says Robert Flaumenhaft, chief of the division of homeostasis and thrombosis at Beth Israel Deaconess Medical Center in New York City. Researchers from Mount Sinai School of Medicine, also in New York City, reported that hospitalized patients with COVID-19 on mechanical ventilation who received blood thinners had a lower mortality than those who weren’t treated with them. But the team couldn’t rule out other explanations for the observation, and high doses of these drugs carry risks  7.\n At Columbia University in New York City, researchers are launching a clinical trial to compare the standard clot-preventing doses of blood thinners with a higher dose in people who are critically ill with COVID-19. Similar trials are planned for Canada and Switzerland. And scientists at Beth Israel Deaconess Medical Center have begun enrolment for a clinical trial to evaluate an even more powerful clot-busting medication called tissue plasminogen activator, or tPA. This drug is more potent, but carries higher risks of serious bleeding than do blood thinners.\n  Scientists hope that these trials and others will provide the data necessary to help physicians to make difficult treatment decisions. Lee worries about the amount of ‘reactionary medicine’ happening. “People are changing their therapeutic approach in reaction to their local and personal experience,” she says. She understands the impetus, “but we have to remember the main thing is first do no harm”.", "posttime": "2020-05-09 05:53:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,coronavirus,病毒,血块,blood", "title": "冠状病毒血块之谜加剧", "title_en": "Coronavirus blood-clot mystery intensifies", "transed": 1, "url": "https://www.nature.com/articles/d41586-020-01403-8", "via": "", "real_tags": ["冠状病毒", "病毒", "血块", "blood"]}, {"category": "", "categoryclass": "", "imagename": "d98a74b815e775560c47f055d5342905.jpg", "infoid": 1001327, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是最现代的汽车，你很可能会发现它被触摸屏所主宰，而不是过去把仪表盘弄得乱七八糟的所有刻度盘和开关。通常会有不止一个屏幕，有些屏幕比笔记本电脑上的屏幕还要大。但是，尽管触摸屏提供了一种操作大量控件和设置的便捷方式，但最新的研究表明，它们也可能是危险的分心之物。\n为了发现触摸屏有多严重地分散了司机的注意力，尼尔·金尼尔和他在交通研究实验室的同事们安排了一系列实验。交通研究实验室曾是英国政府机构，现在作为一个独立的测试设施运营。他们招募了两组司机，每组20人。其中一个是谷歌Android Auto的老用户，这是一款很受欢迎的“信息娱乐”应用，司机可以通过汽车的触摸屏与手机互动。其他人则是安卓汽车的主要竞争对手苹果CarPlay的支持者。\n每个参与者都使用实验室复杂的驾驶模拟器沿着一条设定的虚拟路线完成了三次15分钟的旅行。在其中一次旅行中，他们必须只使用触摸屏执行任务。这些任务包括导航到一家餐厅，在Spotify(一种音乐服务)上播放一首特定的歌曲，切换广播频道，让系统读出短信，以及打一个“免提”电话。在第二次旅行中，他们不得不做同样的事情，但只使用了汽车的声控控制器。第三次旅行是对照组，没有分配任务。\n每当挡风玻璃上的红条闪烁时，研究人员通过拉动指示杆来闪烁汽车的灯，来测量司机需要多长时间才能做出反应。正如他们所预期的那样，使用屏幕触摸控制的司机比使用语音控制的司机需要更长的时间来响应闪光条。虽然差异可能不到一秒，但在高速公路上，这将导致停车距离增加到25米。\n然而，令金尼尔博士惊讶的是，司机的注意力被操作屏幕所需的一系列眼神所转移的时间之长令人惊讶。最糟糕的结果包括使用Android Auto在Spotify上播放歌曲的平均累积扫视时间为20秒，使用CarPlay设置前往餐厅的路线的累计时间为16秒。对于语音命令，这两个平均值分别降至4秒和3秒。\n研究人员计算出，在某些任务中，当使用触摸屏时，对红色条的反应时间比标准时间长50%以上。这比之前一项模拟器研究中发现的46%的损伤更严重，该研究考察了开车时使用手持手机的影响，这在许多国家是被禁止的。\n金尼尔博士和他的同事们敦促车辆安全机构制定标准，限制在汽车触摸屏上使用过度分散注意力的任务。目前只有自愿性的指导方针。例如，美国国家公路交通安全管理局(National Highway Traffic Safety Administration)表示，触摸屏任务应该在两秒或更短的时间内完成，累计时间不超过12秒。\n研究人员认为，语音激活是一种更安全的选择，应该鼓励，尽管软件还需要改进。瑞典人工解决方案公司的安迪·皮尔特(Andy Peart)对此表示赞同，该公司正在开发辅助语音识别。一个问题是，口头命令通常有多种意图。“要求调高温度，播放埃德·希兰(Ed Sheeran)，系统就不能应付了，”他补充道。\n车辆控制向触摸屏的迁移也引发了人们对机器而不是司机反应时间太慢以及需要混乱的步骤才能启动的抱怨。今年4月，英国汽车杂志《What Car？》在检查了新车的触摸屏后报道称，使用触摸屏而不是物理按钮时，调整加热器风扇的时间可能是使用触摸屏时的两倍，选择新电台的时间是原来的八倍。\n汽车制造商正在开发更容易操作的屏幕，并将其放置得更符合司机对道路的看法。增加身体和触觉反应的触觉反馈也即将到来。例如，当感觉并按下屏幕上的虚拟按钮时，这可能检测到移动的手指并产生咔哒声和轻微的振动。然而，老派的驾车者可能仍然更喜欢他们的车带上真正的旋钮。。\n这篇文章发表在印刷版的科技版上，标题为“敏感的驱动因素”。", "note_en": "S  most modern cars and instead of all the dials and switches that used to clutter the dashboard you are likely to find it dominated by a touchscreen. Often there is more than one screen, and some are bigger than those on a laptop. But, though touchscreens provide a convenient way to operate a multitude of controls and settings, the latest research shows they can also be dangerous distractions.\n To discover how badly touchscreens distract drivers, Neale Kinnear and his colleagues at the Transport Research Laboratory, a former British-government agency now run as an independent test facility, arranged a series of experiments. They recruited two groups of 20 drivers. One consisted of regular users of Google’s Android Auto, a popular “infotainment” app which lets drivers interact with their phone through a car’s touchscreen. The others were partisans of Android Auto’s main rival, Apple CarPlay.\n  Each participant completed three 15 minute journeys along a set virtual route using the laboratory’s sophisticated driving simulator. On one of these trips they had to carry out tasks using only the touchscreen. These tasks included navigating to a restaurant, playing a particular song on Spotify (a music service), changing radio channels, getting the system to read out a text message, and making a “hands-free” telephone call. On the second trip they had to do the same, but using only the car’s voice-activated controls instead. The third journey was a control, with no assigned tasks.\n Whenever a red bar flashed on the windscreen the researchers measured how long it took a driver to react by pulling the indicator stalk to flash the car’s lights. As they expected, drivers using touch controls on the screen took longer to respond to the flashing bar than did those using voice controls. Though the difference might be less than a second, at motorway speeds this would result in an increased stopping distance of up to 25 metres.\n Dr Kinnear was, however, surprised by the amount of time drivers’ attention was diverted by the series of glances needed to operate the screen. Among the worst outcomes were a mean of 20 seconds of cumulative glances using Android Auto to play a song on Spotify, and of 16 seconds to set up the route to a restaurant with CarPlay. For voice commands those means fell to four and three seconds respectively.\n The researchers calculated that reaction times to the red bar when the touchscreen was being employed were more than 50% longer than standard for some tasks. This was worse than the 46% impairment found in a previous simulator study looking at the effects of using a hand-held mobile phone while driving, which is banned in many countries.\n  Dr Kinnear and his colleagues have urged vehicle-safety bodies to impose standards that limit the use of overly distracting tasks on a car’s touchscreen. At present there are only voluntary guidelines. America’s National Highway Traffic Safety Administration, for instance, says touchscreen tasks should be completed in glances of two seconds or less, with a cumulative time of no more than 12 seconds.\n The researchers believe voice-activation is a safer alternative that should be encouraged, though the software needs to be improved. Andy Peart of Artificial Solutions, a Swedish firm developing  -assisted voice recognition, agrees. One problem is that spoken commands often have multiple intent. “Ask to turn the temperature up and play Ed Sheeran, and the system can’t cope,” he adds.\n The migration of vehicle controls to touchscreens has also led to complaints about the machines’ rather than the drivers’ reaction times being too slow, and requiring a confusing number of steps, to boot. In April, after examining the touchscreens in new vehicles,  What Car?, a British motoring magazine, reported that adjusting the heater fan can take twice as long when using a touchscreen rather than a physical button, and that selecting a new radio station takes eight times longer.\n Carmakers are developing screens that are easier to operate and positioning them more in line with a driver’s view of the road. Haptic feedback, which adds physical, tactile responses, is also coming. This might, for example, detect a moving finger and produce a clicking sound and a slight vibration when a virtual button on the screen is felt and pressed. Old-school motorists may, however, still prefer their cars to come with real knobs on. ■\n This article appeared in the Science &amp; technology section of the print edition under the headline &#34;Touchy drivers&#34;", "posttime": "2020-05-09 05:52:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "触摸屏,safety", "title": "道路安全：在车内使用触摸屏的驾车者正分心", "title_en": "Road safety: Motorists using touchscreens in cars are being distracted", "transed": 1, "url": "https://www.economist.com/science-and-technology/2020/05/07/motorists-using-touchscreens-in-cars-are-being-distracted", "via": "", "real_tags": ["触摸屏", "safety"]}, {"category": "", "categoryclass": "", "imagename": "98228ee603fb71bed975d350f2346acb.jpg", "infoid": 1001325, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个隶属于日本多个机构的研究小组发现了月球上嵌入碳排放的证据。在他们发表在“科学进展”杂志上的论文中，该小组描述了他们对卡古亚月球轨道器碳数据的研究，以及他们从中学到了什么。在60年代和70年代的载人登月任务带回月球岩石样本后，科学家们开始制定一种理论来解释月球是如何存在的。近年来，随着人们接受月球是由一颗大行星与地球相撞时喷出的物质形成的，这一理论取得了成果。部分理论取决于来自月球岩石的数据，这些数据表明，由于大规模撞击产生的热量，月球上挥发性碳正在蒸发。但现在，月球表面似乎埋藏着古老的碳，这表明可能需要对月球诞生的时间做出一些改变。\n这项工作包括研究卡古亚月球轨道器一年半的数据，特别关注碳排放。他们发现，月球排放的碳比人们想象的要多，而且超过了新的碳添加所能解释的，比如与微流星体的碰撞。他们还发现，月球的某些部分比其他部分排放了更多的碳-例如，玄武岩平原比高地排放的碳更多。研究人员认为，这是因为平原上的表面物质比高原上的物质新，因此蒸发的时间更少。\n研究人员的发现表明，月球表面下有大量的古代化石，而且很可能自月球形成以来就一直在那里。它是如何在非常炎热的早期坚持下去的，仍然是一个谜。研究人员还指出，他们的方法可以应用于太阳系中其他天体的研究，他们打算利用这一方法从水星和火卫一那里了解更多信息。更多信息：横田昭一郎等人。卡古亚对月球本土碳离子全球排放的观测，科学进步(2020)。doi：10.1126/scrisAdv.aba1050", "note_en": "A team of researchers affiliated with multiple institutions in Japan has found evidence of embedded carbon emissions on the moon. In their paper published in the journal  Science Advances, the group describes their study of carbon data from the KAGUYA lunar orbiter and what they learned from it.    After the manned moon missions of the 60s and 70s brought back samples of lunar rocks, scientists began formulating a theory to explain how the moon came to exist. That theory reached fruition in recent years as it became accepted that the moon was formed from material that was expelled when a large planet collided with the Earth. Part of the theory hinges on data from the moon rocks that indicate volatile carbon vaporizing from the moon due to the heat from the massive impact. But now, it appears that there is ancient carbon embedded in the moon&#39;s surface, suggesting some changes may have to be made to the   of the moon&#39;s birth.\n  The work involved studying a year and a half of data from the KAGUYA lunar orbiter, focusing specifically on carbon emissions. They found that the moon was emitting more carbon than has been thought, and more than could be accounted for by new carbon additions, such as the   or collisions with micrometeoroids. They also found that some parts of the moon have been emitting more carbon than others—the basaltic plains, for example, emit more carbon than the highlands. The researchers suggest this is because surface material on the plains is newer than material in the highlands and thus has had less time to vaporize.\n  The findings by the researchers suggest that the moon has a large amount of ancient   beneath its surface, and it has likely been there since the moon was formed. How it could have persisted on a very hot early   remains a mystery. The researchers also note that their approach could be applied to the study of other celestial bodies in the solar system and that they intend to use it to learn more about   from Mercury and Phobos.        More information:\t\t\t\t\t\t\t\t\t\t\t\tShoichiro Yokota et al. KAGUYA observation of global emissions of indigenous carbon ions from the Moon,  Science Advances (2020).  DOI: 10.1126/sciadv.aba1050", "posttime": "2020-05-09 05:36:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "排放,moon,月球", "title": "月球上的碳排放使月球诞生理论受到质疑", "title_en": "Carbon emissions on the moon put theory of moon birth in doubt", "transed": 1, "url": "https://phys.org/news/2020-05-carbon-emissions-moon-theory-birth.html", "via": "", "real_tags": ["排放", "moon", "月球"]}, {"category": "", "categoryclass": "", "imagename": "e9c6b0e359c14a85bf027ba731acb7a0.jpeg", "infoid": 1001324, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-加利福尼亚州州长加文·纽瑟姆(Gavin Newsom)周五表示，他已经签署了一项行政命令，让所有加州登记选民都能收到11月选举的邮寄选票。\n然而，纽瑟姆在他的每日冠状病毒简报中表示，邮寄选票不能替代实体投票地点，该州也在努力为不参加投票的选民设立安全的地点。\n加州国务卿亚历克斯·帕迪利亚(Alex Padilla)在简报会上与纽瑟姆通了电话，他说，由于担心冠状病毒大流行对面对面投票的影响，他所在的州是第一个在选举前向每位选民发送选票的州。\n帕迪拉说，对于加州人来说，没有比他们将收到的选票更安全的投票方式了，选票上有预付退货邮资。\n帕迪拉说：“这对公众健康、投票权都有好处，对参与选举也有好处，因为今年11月的选举仍将是我们一生中最重要的一次选举。”", "note_en": "(Reuters) - California Governor Gavin Newsom on Friday said he had signed an executive order for all California registered voters to receive a mail-in ballot for the November election.\n Newsom, in his daily coronavirus briefing, said the mail-in ballots were no substitute for physical sites to vote at, however, and that the state was also working on setting up safe places for walk-in voters.\n California Secretary of State Alex Padilla, who joined Newsom by phone during the briefing, said his state was the first to send every voter a ballot in advance of the election over concerns about the effect of the coronavirus pandemic on in-person voting.\n There was no safer way for Californians to vote than by the ballots they would be receiving, which have return postage prepaid on them, Padilla said.\n “It’s great for public health, it’s great for voting rights, it’s going to be great for participation because this November’s election is still slated to be the consequential election of our lifetime,” Padilla said.", "posttime": "2020-05-09 05:35:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,选民,voters,投票", "title": "加州选民将获得2020年大选的邮寄选票", "title_en": "California voters to get mail-in ballots for 2020 election", "transed": 1, "url": "https://www.reuters.com/article/us-health-coronavirus-usa-california/california-voters-to-get-mail-in-ballots-for-2020-election-governor-idUSKBN22K2T3", "via": "", "real_tags": ["2020", "选民", "voters", "投票"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001321, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我已经关闭了面对面的会议-您甚至可以说DEF CON 28被取消了。\n阅读本文时要听的主题曲：DEFCON被SKIDITY&ANP；BUS取消DEFCON 28安全模式常见问题解答👈。\n为什么？今年现在或在可预见的将来，人们聚集在一起参加会议、体育球类活动或俱乐部活动是不安全的。为了纪念这个(希望)一生中只有一次的事件，我们当然做了衬衫。当我写我的DEF CON vs.CoronaVirus博客文章2020年3月12日时，我乐观地认为，社会距离、庇护、强大的医疗反应和大规模测试将使8月初的集会变得安全。我不再相信了。即使明天发现疫苗，也不会很快进行测试、生产、分发和管理，以便人们在8月份之前安全出行。太多的州仍然开放或正在重新开放，人们聚会的时间太长了，缺乏联邦协调让我对今年一切恢复正常没有希望。我还担心，推迟到今年晚些时候的会议将在限制开始放松后陷入第二波，最终不得不取消。正因为如此，推迟DEF CON不是一个选择。DEF CON 28的主题是探索，2020年也没有令人失望。虽然我在将近一个月前的4月11日做出了取消面对面会议的决定，但推迟宣布是因为我学会了如何真正取消。这需要与工作人员、律师、会计师和凯撒合作数周。我不想在我们理解并确信我们可以驾驭这一过程之前，就在推特上宣布我们取消了这场骗局，从而危及到了这场骗局的未来。尽管我们的面对面拉斯维加斯活动被取消，我们将在8月7日至9日(周五至周日)运行DEF CON 28安全模式，周四将举行101迎新活动-所有这些都是远程的。我们将使用DEF CON论坛来协调您参与的各种方式。在那里，每个人都可以宣布他们的计划，进行注册，发布图片和视频，并让人们参与进来。然后在8月6日，我们将开放DEF CON Discord.io/DC服务器，每个人都可以加入，开始他们的骗局体验！预计会有新的在线神秘挑战、DEF CON被取消音乐专辑、远程CTF(如Hack-a-Sat)、村庄(如Packet Hacking Village)、比赛(如电话挑战赛、火腿考试等)等活动。我们还计划举办一个远程电影之夜和狂欢。有太多不同的平台可供一刀切，所以我们不会挑选获胜者，而是充当协调人，用计划日历、链接、描述和音乐告诉每个人去哪里。好消息是DEF CON将继续存在，DEF CON 29计划于2021年8月5日至8日举行，您现在可以预订房间了。在个人层面上，这是我记忆中压力最大的几个月，在家门封锁和不得不在DEF CON的未来导航之间，感觉我周围都是地雷，灯都关了。虽然取消谈判仍在进行中，但幸运的是，DEF CON Goons和社区Write Large一直令人惊叹，帮助我朝着一个安全的方向导航。我感到自豪的是，这些年来，我们在康涅狄格州之外的自我照顾和相互支持方面都变得更好了，我迫不及待地想在混乱和不确定的情况下见到每一个人。黑客确实喜欢安全。感谢您的支持和理解，“黑暗正切”", "note_en": "I have shut down the in person conference - You might even say that DEF CON 28 is Canceled\n  Theme song to listen to as you read this:   DEF CON Is Canceled by Skitish &amp; Bus The DEF CON 28   Safe Mode FAQ 👈\n  Why? It is  not safe for people to gather in large groups for conferences, sports ball events, or clubbing now or in the foreseeable future this year.  To commemorate this (hopefully) once in a lifetime event we of course   made shirts.  When I wrote my   DEF CON vs. COVID-19 blog post March 12th 2020 I was optimistic that social distancing, sheltering, a robust medical response with wide scale testing would make it safe to gather in early August. I no longer believe that.   Even if a vaccine were to be discovered tomorrow it would not be soon enough to test, manufacture, distribute and administer in time for people to safely to travel by August.  Too many States have stayed open or are re-opening, people partied for far too long, and the lack of Federal coordination gives me no hope that things will get back to normal this year. I also worry that the conferences that postponed to later this year will be caught up in the &#34;second wave&#34; after restrictions start to ease and they will end up having to cancel. Because of this, postponing for DEF CON was not an option.  The theme for DEF CON 28 is &#34;  Discovery,&#34; and 2020 has not disappointed.  While I made the decision to cancel the in-person conference almost a month ago on April 11th, the delay in announcing has been due to learning how to actually cancel. It has taken weeks of working with staff, lawyers, accountants, and Caesars. I didn&#39;t want to endanger the future of the con by tweeting that we were canceling before we understood and were confident we could navigate the process.  Even though our in-person Las Vegas event is canceled, we will run DEF CON 28 Safe Mode August 7-9 (Friday through Sunday) with 101 orientation Thursday - all of it remote. We will use the   DEF CON Forums to coordinate all the various ways you to participate. That is where everyone can announce their plans, do signups, post pictures and videos and get people involved.  Then on August 6th we will open the   DEF CON discord.io/dc server up for everyone to join and start their con experience!  Expect events like a new on-line Mystery Challenge, a DEF CON is Canceled music album, remote CTFs like  Hack-a-Sat, Villages like the Packet Hacking Village, contests like the  TeleChallenge, Ham Exams, and more. We are also planning a remote  movie night and drink-up.  There are too many different platforms for &#34;one size fits all&#34; so instead of us picking a winner we will act as the coordinator pointing everyone where to go with a   planning calendar, links, descriptions, and music.  The good news is DEF CON will survive, and DEF CON 29 is planned for August 5-8 2021,   you can reserve your rooms now.  On a personal level this has been the most stressful few months I can remember, between being on home lock-down and having to navigate the future of DEF CON it has felt like there were land mines all around me and the lights were turned off. While cancellation negotiations are still ongoing I&#39;ve been lucky that the DEF CON Goons and community writ large have been amazing, helping me to navigate in a safe direction. I am proud that over the years we have all gotten better at self care and supporting each other outside of Con and I can&#39;t wait to see everyone when it is less chaotic and uncertain. Hackers do like security.  Thank you for your support and understanding,  The Dark Tangent", "posttime": "2020-05-09 04:26:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "def", "title": "面对面DEF CON 28取消", "title_en": "In-person DEF CON 28 cancelled", "transed": 1, "url": "https://forum.defcon.org/node/232005", "via": "", "real_tags": ["def"]}, {"category": "", "categoryclass": "", "imagename": "453380464056990f0f0190b93a81e2df.jpg", "infoid": 1001320, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "IT服务提供商Cognizant在本周的财报电话会议上表示，上个月发生在2020年4月的勒索软件事件将对其第二季度收入产生负面影响。\n虽然我们预计与这个问题相关的收入影响将在本季度中期基本得到解决，但我们确实预计本季度的收入和相应的利润率影响将在5000万至7000万美元之间，Cognizant首席财务官卡伦·麦克洛夫林(Karen McLoughlin)在昨天的财报电话会议上表示。\nMcLoughlin还预计，该事件将招致与调查、恢复服务和补救违规相关的额外和不可预见的法律、咨询和其他成本。\nCognizant首席财务官表示，公司现在已经完全从勒索软件感染中恢复过来，并恢复了大部分服务。\n在谈到勒索软件攻击时，Cognizant首席执行官布莱恩·汉弗莱斯(Brian Humphries)表示，这起事件只影响了其内部网络，但不影响客户系统。\n更确切地说，汉弗莱斯表示，勒索软件事件影响了(1)Cognizant支持员工在家工作的精选系统，以及(2)在冠状病毒流行期间Cognizant用来支持在家工作能力的笔记本电脑的供应。\n汉弗莱斯说，工作人员迅速采取行动，关闭了所有受影响的系统，这在一段时间内影响了Cognizant的计费系统。作为预防措施，一些客户服务部门被关闭了。\nCogizant与客户举行了会议，然而，由于Cognizant避免透露所发生事情的任何实际细节，会议进行得并不顺利。\nZDNet了解到这一事件的时间是在4月17日，当时几名心怀不满的客户联系了本报记者，称该公司试图以技术问题为幌子掩盖一个重大的安全漏洞，并切断了一系列服务的接入。\n起初，客户担心黑客从服务器窃取了用户数据，或者发生了勒索软件事件，勒索软件传播到客户服务器，加密了他们的数据，服务器变得无法访问。\n在Cognizant向所有客户发送内部警报，敦促客户阻止IP地址列表的流量后，客户被推入完全偏执的模式。\n客户很快将IP地址链接到过去由迷宫勒索软件团伙运营的网络服务器。\n作为美国最大的服务器托管和IT服务提供商之一，Cogizant最终在4月18日公开承认，其网络在一天后感染了迷宫勒索软件。\n这起事件的认知损失与铝生产商挪威海德鲁(Norsk Hydro)去年报告的范围相同，该公司报告称，2019年3月的勒索软件事件将导致总收入损失超过4000万美元，该公司后来将这一数字调整为年内近7000万美元。\n汉弗莱斯表示，Cognizant目前正在努力解决客户的担忧，这些客户在勒索软件攻击后选择暂停Cognizant服务，这也影响了Cognizant目前的利润。\n近年来，美国证交会(SEC)将勒索软件列为公司利润主要前瞻性风险因素的申请数量从2014年的3份飙升至2019年的1139份，2020年已经达到743份。企业今天将勒索软件攻击视为其利润的真正风险，因为勒索软件事件往往会对股价造成声誉损害，并因收入损失而造成财务损失，因为大多数受害者需要数周至数月的时间才能完全恢复。", "note_en": "IT services provider Cognizant said in an earnings call this week that a ransomware incident that took place last month in April 2020 will negatively impact its Q2 revenue.\n &#34;While we anticipate that the revenue impact related to this issue will be largely resolved by the middle of the quarter, we do anticipate the revenue and corresponding margin impact to be in the range of $50 million to $70 million for the quarter,&#34; said Karen McLoughlin, Cognizant Chief Financial Officer in an earnings call yesterday.\n McLoughlin also expects the incident to incur additional and unforeseen legal, consulting, and other costs associated with the investigation, service restoration, and remediation of the breach.\n The Cognizant CFO says the company has now fully recovered from the ransomware infection and restored the majority of its services.\n  Speaking on the ransomware attack, Cognizant CEO Brian Humphries said the incident only impacted its internal network, but not customer systems.\n   More precisely, Humphries said the ransomware incident impacted (1) Cognizant&#39;s select system supporting employees&#39; work from home setups and (2) the provisioning of laptops that Cognizant was using to support its work from home capabilities during the COVID-19 pandemic.\n Humphries said staff moved quickly to take down all impacted systems, which impacted Cognizant&#39;s billing system for a period of time. Some customer services were taken down as a precaution.\n   Cognizant held meetings with customers, however, the meetings did not go smoothly as Cognizant avoided sharing any actual details of what had happened.\n ZDNet learned of the incident as it was going on, at the time, on April 17, when several disgruntled customers had reached out to this reporter about the company attempting to hide a major security breach under the guise of &#34;technical issues&#34; and cutting off access to a series of services.\n Initially, customers feared that a hacker had either stole user data from servers, or a ransomware incident had taken place, and the ransomware spread to customer servers, encrypting their data and the servers becoming inaccessible.\n Customers were thrown in full paranoia mode after Cognizant sent an internal alert to all customers, urging clients to block traffic for a list of IP addresses.\n Customers were quick to link the IP addresses to web servers operated in the past by the Maze ransomware gang.\n Cognizant, one of the largest providers of server hosting and IT services in the US, eventually publicly admitted that its network was infected with the Maze ransomware a day later  on April 18.\n  Cognizant losses from the incident are in the same range reported last year by aluminum producer Norsk Hydro, which reported that a March 2019 ransomware incident would cause total revenue losses of  more than $40 million, a number it later adjusted to nearly $70 million during the year.\n Humphries said that Cognizant is now working to address the concerns of customers who opted to suspend Cognizant services in the wake of the ransomware attack, which also impacted Cognizant&#39;s current bottom line.\n  The number of SEC filings listing ransomware as a major forward-looking risk factor to companies&#39; profits  has skyrocketed in recent years from 3 filings in 2014 to 1,139 in 2019, and already 743 in 2020. Companies are seeing today ransomware attacks as a real risk for their bottom lines as ransomware incidents tend to cause reputational damage to stock prices and financial losses due to lost revenue as most victims take weeks and months to fully recover.", "posttime": "2020-05-09 04:10:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,cogizant,expects,客户", "title": "Cogizant预计在勒索软件攻击后损失在5000万至7000万美元之间", "title_en": "Cognizant Expects To Lose Between $50M and $70M Following Ransomware Attack", "transed": 1, "url": "https://www.zdnet.com/article/cognizant-expects-to-lose-between-50m-and-70m-following-ransomware-attack/", "via": "", "real_tags": ["软件", "cogizant", "expects", "客户"]}, {"category": "", "categoryclass": "", "imagename": "7685def13b61cc1e3b2618b3fda7590e.jpg", "infoid": 1001319, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据彭博社(Bloomberg)报道，谷歌首席执行官桑达尔·皮查伊(Sundar Pichai)周四告诉谷歌员工，准备好在10月份甚至可能到年底进行远程工作。实际上，谷歌的一位女发言人说，预计大多数谷歌员工在2021年之前都会在家工作。\n不仅仅是谷歌。Facebook还告诉员工，他们中的大多数人可以继续在家工作到今年年底。在线房地产公司Zillow也宣布，其员工可以在家工作到2021年。而且，加勒比海一家主要的保险供应商Sagicor宣布，他们的员工将在家工作到2021年。\n德克萨斯州、佐治亚州、南卡罗来纳州和其他州正在鼓励企业重新开业。企业并不像这些政府那样乐观。最近的一项人力资源调查发现，62%的雇主计划让员工在家工作，直到专家(而不是政客)同意重返工作岗位是安全的。\n一些企业正在考虑重新开放办公室，但要求员工在一周的部分时间继续在家工作。通过在任何时候减少工作人员的数量，他们将能够在办公室里保持社交距离。\n弗雷斯特(Forrester)分析师安德鲁·休伊特(Andrew Hewitt)认为这是一个好主意。你把人们轮流带回来，你就错开了。你当然不能把每个人都聚集在一起。商业领袖需要决定他们办公室里绝对必须有哪些人，并做好计划，以降低每个人的健康风险。\n不只是办公室经理对在家工作的人产生了好感。GlassDoor的一项调查显示，67%的员工会支持雇主无限期强制员工在家工作的决定。\n一般来说，年轻员工比年长的员工对此更有信心，年龄在18-34岁之间的员工中，68%的人表示有信心在必要时远程工作，而在55-64岁的员工中，这一比例为44%。有趣的是，有未满18岁孩子的在职父母中，有71%的人表示，他们有信心能够高效地远程工作。\nIT管理层对这种在家工作的新模式也没什么意见。IDG的一项调查发现，71%的人表示，冠状病毒大流行让人们对远程工作场所产生了更积极的看法。这已经让他们开始考虑如何规划未来的办公空间、技术人员配备和整体人员配备。\n全球工作场所分析公司(GWA)认为，即使在这种新型冠状病毒最终被控制之后，许多员工也不会再回到办公室。GWA总裁凯特·李斯特说，我们最好的估计是，到2021年底，将有25%-30%的劳动力每周多天在家工作。\n为什么？两者都是因为他们发现80%的员工希望至少在某些时候在家工作。而且，更重要的是，经理和高管发现他们的远程员工还在工作。李斯特说：\n远程工作最大的障碍之一是信任-经理们根本不信任他们的员工可以不受束缚地工作。他们习惯于通过计算入座人数来管理，而不是根据结果。那不是管理，那是照看孩子。更重要的是，看到某人的后脑勺，经理根本不知道那个人是否真的在工作。当客户问我如何知道他们是否在工作时？我问你怎么知道他们现在在工作？\n展望未来，随着我们控制住大流行，工作可能永远不会一样。在家工作，可能不再是规则的例外。", "note_en": "According to a Bloomberg report, Sundar Pichai, Google&#39;s CEO, told  Google employees on Thursday to be ready to work remotely through October and possibly to the end of the year. Actually, a Google spokeswoman said most Google workers are expected to work from home until 2021.\n     It&#39;s not just Google.  Facebook has also told its staffers that most of them can continue to work from home through the end of the year.  Zillow, the online real-estate company, has also announced that its  people can work from home until 2021. And,  Sagicor, a major Caribbean&#39;s insurance provider, announced their  employees would be working from home until 2021.\n Texas, Georgia, and South Carolina and other states are encouraging businesses to re-open. Businesses aren&#39;t nearly as optimistic as these governments are. A recent HR survey found  62% of employers plan on keeping people working from home until experts, not politicians, agree it&#39;s safe to go back to work.\n Some businesses are exploring  reopening their offices but asking their employees to continue to work at home part of the week. By reducing the number of staffers at work at any one time they&#39;ll be able to maintain social distancing in the office.\n   Andrew Hewitt, a Forrester analyst, thinks this is a good idea. &#34; You bring people back in shifts, you stagger it. You certainly don&#39;t bring everybody together.&#34; Business leaders need to decide on who they absolutely must have in the office, and plan so as to reduce the health risk to everyone.\n It&#39;s not just the office managers who&#39;ve warmed up to people working from home. A  Glassdoor survey showed &#34;67% of employees would support the decision by their employer to mandate employees &#39;work from home indefinitely.&#39;&#34;\n   Generally speaking younger workers are more confident about this than their older counterparts, &#34;68% of employees aged 18-34 reported being confident in doing their work remotely if they have to, compared to 44% of employees aged 55-64.&#34; Interestingly,  &#34;71% of employed parents with children under age 18 said that they feel confident they can efficiently do their job remotely.&#34;\n IT management is also OK with this new work from home model.  An IDG survey found 71% say the   coronavirus pandemic &#34;has created a  more positive view of remote workplaces.&#34; This is already making them look at &#34;how they plan for office space, tech staffing and overall staffing in the future.&#34;\n Global Workplace Analytics (GWA) thinks, even after the novel coronavirus is finally corralled, many workers won&#39;t be returning to the office. GWA&#39;s President Kate Lister, said, &#34;Our best estimate is that 25-30% of the workforce will be working-from-home multiple days a week by the end of 2021.&#34;\n Why? Both because they&#39;ve found 80% of employees want to work from home at least some of the time. And, what&#39;s far more important, managers and executives are finding their remote workers are, well, still working. Lister said:\n One of the biggest holdbacks of remote work is trust—managers simply don&#39;t trust their people to work untethered. They&#39;re used to managing by counting butts-in-seats, rather than by results. That&#39;s not managing, that&#39;s baby-sitting. What&#39;s more, seeing the back of someone&#39;s head tells a manager nothing about whether that person is actually working. When clients ask &#34;How will I know if they&#39;re working?&#34; I ask &#34;How do you know they are working now?&#34;\n Moving ahead, as we get on top of the pandemic, work may never be the same. Working from home, may go from being an exception to the rule.", "posttime": "2020-05-09 04:08:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,预计,expects", "title": "谷歌预计其员工在2021年之前将在家工作", "title_en": "Google expects its staff to work from home until 2021", "transed": 1, "url": "https://www.zdnet.com/article/google-expects-its-staff-to-work-from-home-until-2021-and-its-not-alone/", "via": "", "real_tags": ["google", "谷歌", "预计", "expects"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001318, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天早上，我在看玛吉·阿普尔顿的精彩演讲，她回答了一个关于我有时会遇到的比喻的问题。用她的话说，“比喻不就是一种无聊的分散注意力的东西吗？为什么我要用这些完全不相关的模糊误导的故事来污染我的(观念)呢？“。\n我有时确实很想知道这一点！我真的很喜欢用直截了当的方式解释事情。那么隐喻是怎么回事呢？\n在演讲中，她解释了“比喻隐喻”和“认知隐喻”之间的区别，并指出我们在日常语言中使用了大量的隐喻来理解我们周围的世界。她提到了一本超级有趣的书，叫“我们赖以生存的隐喻”，我马上就开始读了。\n下面是“我们赖以生存的隐喻”中的一个例子，这些隐喻是我们用来表达想法的。\n想法就像食物：“原始的事实”，“半生不熟的想法”，“吞下那句话”，“用勺子喂我们的学生”，“论文中有肉的部分”，“那个想法已经发酵多年了”。\n作为人的思想：“相对论催生了大量的思想”，“这些思想是谁的创意”，“那些思想在中世纪消亡了”，“认知心理学还处于初级阶段”。\n创意作为产品：“我们这周产生了很多创意”，“需要改进”，“他的智力生产力近年来有所下降”。\n把想法当作商品：“他不会买的”，“那是个没用的想法”，“她有有价值的想法”\n作为资源的想法：“他的想法用完了”，“让我们集思广益”，“那个想法会大有用武之地”。\n作为切割工具的想法：“这是一个精辟的想法”，“切中问题的核心”，“他很犀利”。\n想法就像时尚：“那个想法几年前就过时了”，“马克思主义在西欧很流行”，“伯克利是前卫思想的中心”，“符号学已经变得相当时髦了”。\n我想到的是，我们用来表达想法的不同类型的隐喻如此之多，这让我感到惊讶！我们不再用一个大的比喻，而是一直使用小的比喻来向对方解释事情。\n好了，让我们进入这篇博文的重点。当我在读“隐喻”的时候，我对编程中的隐喻产生了兴趣(当然)。\n我试着想出最枯燥的技术文档，应该有最少的隐喻。显而易见的选择是手册页，它的优点是已经在我的计算机上了。\n下面是我今天早上在手册页上找到的一些比喻。我只在这上面花了大约2个小时，所以这绝对不是对计算中使用的每一种隐喻的完整讨论，但我很开心地找到了它们，也许你也会觉得它很有趣。\n我基本上是通过翻阅比喻中的比喻例子找到这些比喻，并为它们在电脑上的所有手册页上涂上油污。\n“包含RFC 4648第5节base64url编码的128位密钥的文件”\n“缓存已满，未缓存的新页面变得可见”(man zathurarc.)。\n还有很多种资源：带宽、TCP套接字、会话ID、堆栈空间、内存、磁盘空间。\n在查询之间保持TCP套接字打开并重用它，而不是创建新的TCP套接字(手册摘要)。\n最大值很容易耗尽额外的3 GB左右的内存(Man Valgrind)。\n请注意，TLS 1.3仅受TLS后端(Man Curl)的子集支持。\n在Linux上，futimens是在utimensat系统调用(Man Futimens)之上实现的库函数。\n限制为房间/建筑物(有楼层和天花板，您撞到了它们)是一种有趣的方式：\n这指定了进程的nice值可以提高到的上限(Man Getrlimit)。\n“这是脆弱的，可能会改变，因此不应该依赖”(MAN PS)。\n“显然，如果你给一些数码相机喂一张CF卡，它们就会消化不良)(Man Mkfs)。\n“上面的例子可以被认为是一个最大限度的重复，它必须吞下它能吞下的一切”(Man Pcrepattern)。\n“这将允许您将换行符分隔的name=value对提供给‘(Man Cgi)上的脚本。\n“HTTPS保证密码不会明文传输”(man net：：SSLeay)。\n“将多个证书打包到ASN.1结构中的方法”(Man Gpgsm)。\n这是较丰富的类别之一-许多不同的手册页似乎都同意流程是人，或者至少在某种程度上是活的。\n如果进程退出导致进程组变为孤立状态(MAN退出)。\n如果父进程终止，则其“僵尸”子进程(如果有的话)(人工等待)。\n然而，Git不(也不应该)更改用户背后的标签(man git-tag)。\n对于大型项目，这是一个非常昂贵的操作，因此请谨慎使用(man git-log)。\n由于预算被消耗而导致softirq处理程序函数每秒终止的次数(man sar.sysstat)。\n下面是我发现的一些还不属于这些类别的东西。\n当在glibc下创建线程时，所有线程设置只使用一个大锁(Man Valgrind)。\n在此之前擦除文件系统签名、数据等是一个非常好的主意(Man Cryptsetup)\n因此，当我们谈论编程时，我们总是在使用隐喻！我发现的隐喻比我预想的要多得多，其中大多数只是我通常谈论程序的一部分。\n我还不确定这是怎么回事，但这让我意识到，我使用的隐喻可能比我想象的要多得多，也许有更多的方式来使用隐喻，以一种与人们已经在讨论计算机思想的方式相配合的方式。(与其编造一个全新的比喻，不如利用已经在使用的好比喻！)", "note_en": "This morning I was watching a  great talk byMaggie Appletonwhere she addresses a question about metaphors that I’ve had sometimes. In her words, “Aren’t metaphors justa frivolous distraction? Why would I pollute my [concepts] with these fuzzymisleading stories that are completely unrelated?”\n And I definitely wonder this sometimes! I really like explaining things in straightforward ways. So what’s going on with metaphors?\n  In the talk, she explains the difference between a “figurative metaphor” and a“cognitive metaphor” and points out that there a TON of metaphors that we usein our everyday language to understand the world around us. And she referencedthis super interesting book called  Metaphors we live by which Iimmediately got and started reading.\n Here’s an example from “Metaphors we live by” of a bunch of metaphors we use for ideas:\n ideas as  food: “ raw facts”, “ half-baked ideas”, “ swallow that claim”, “ spoon-feed our students”, “ meaty part of the paper”, “that idea has been  fermenting for years”\n ideas as  people: “the theory of relativity  gave birth to an enormous number of ideas”, “whose  brainchild was that”, “those ideas  died off in the middle ages”, “cognitive psychology is in its  infancy“\n ideas as  products: “we’ve  generated a lot of ideas this week”, “it needs to be  refined”, “his  intellectual productivity has decreased in recent years”\n ideas as  commodities: “he won’t  buy that”, “that’s a  worthless idea”, “she has  valuable ideas”\n ideas as  resources: “he  ran out of ideas”, “let’s  pool our ideas”, “that idea will  go a long way“\n ideas as  cutting instruments: “that’s an  incisive idea”, “that  cuts right to the heart of the matter”, “he’s  sharp“\n ideas as  fashions: “that idea  went out of style years ago”, “marxism is  fashionable in western europe”, “berkeley is a center of  avant-garde thought”, “semiotics has become quite  chic“\n What I thought was surprising about this break down of different types ofmetaphors we use for ideas was – there are so many of them!! Instead of OneBig Metaphor, we’re using small metaphors all the time to explain things toeach other.\n  Okay, let’s get to the point of this blog post. As I was reading “Metaphors welive by”, I got interested in metaphors in programming (of course).\n And I tried to think of the driest possible technical documentation thatshould have the least metaphors. The obvious choice was man pages, which havethe advantage of already being on my computer.\n So here are a bunch of metaphors I found in man pages this morning. I onlyspent like 2 hours on this so this definitely isn’t a Complete Discussion ofEvery Kind of Metaphor Used In Computing Ever, but I had fun finding them andmaybe you will find it fun too.\n I basically found these by going through examples of metaphors in Metaphors ToLive By and grepping all the man pages on my computer for them.\n   “The file  containing the RFC 4648 Section 5 base64url encoded 128-bit secret key”\n   “the cache is  full and a new page that isn’t cached becomes visible”  ( man zathurarc)\n  There are also lots of kinds of resources: bandwidth, TCP sockets, session IDs,stack space, memory, disk space.\n Keep the TCP socket open between queries and  reuse it rather than creating a new TCP socket  ( man dig)\n the maximum value will easily  eat up three extra gigabytes or so of memory  ( man valgrind)\n  Note that TLS 1.3 is only supported by a subset of TLS  backends  ( man curl)\n      On Linux,  futimens is a library function implemented  on top of the  utimensat system call  ( man futimens)\n  Limits as rooms/buildings (which have floors, and ceilings, which you hit) are kind of fun:\n This specifies a  ceiling to which the process’s nice value can be raised  ( man getrlimit)\n  “This is  fragile, subject to change, and thus should not be relied upon”  ( man ps)\n  “Apparently some digital cameras get  indigestion if you feed them a CF card)  ( man mkfs)\n  “the above example can be thought of as a maximizing repeat that must  swallow everything it can”  ( man pcrepattern)\n “This will allow you to  feed newline-delimited name=value pairs to the script on’  ( man CGI)\n  “HTTPS guarantees that the password will not  travel in the clear”  ( man Net::SSLeay)\n “way to  pack more than one certificate into an ASN.1 structure”  ( man gpgsm)\n  This is one of the richer categories – a lot of different man pages seem toagree that processes are people, or at least alive in some way.\n If the exit of the process causes a process group to become  orphaned  ( man exit)\n If a parent process terminates, then its  “zombie” children (if any)  ( man wait)\n   However, Git does not (and it should not) change tags  behind users back ( man git-tag)\n  This is a very  expensive operation for large projects, so use it with caution  ( man git-log)\n   The number of times the softirq handler function terminated per second because its  budget was consumed  ( man sar.sysstat)\n  here are some more I found that didn’t fit into any of those categories yet.\n when a thread is created under glibc, just one  big lock is used for all thread setup  ( man valgrind)\n    it is a very good idea to  wipe filesystem signatures, data, etc. before  ( man cryptsetup)\n  So when we talk about programming, we’re using metaphors all the time! I founda lot more metaphors than I expected, and most of them are just part of how I’dnormally talk about a program.\n I’m not sure what to make of this yet, but this made me realize that I probablyuse a lot more metaphors than I think, and that maybe there are more ways touse metaphors in a way that work with the way people are already discussingcomputer ideas. (instead of inventing a whole new metaphor, take advantage ofgood metaphors that are already being used!)", "posttime": "2020-05-09 03:53:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "手册,man", "title": "手册页中的隐喻", "title_en": "Metaphors in Man Pages", "transed": 1, "url": "https://jvns.ca/blog/2020/05/08/metaphors-in-man-pages/", "via": "", "real_tags": ["手册", "man"]}, {"category": "", "categoryclass": "", "imagename": "1faf5c3499f89696855fca0cc0429021.png", "infoid": 1001317, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "支持这个频道：https://paypal.me/jeffquitney or https://www.patreon.com/jeffquitney More at http://quickfound.net/‘Simon Ramo的“多态”…的概念", "note_en": "Support this channel: https://paypal.me/jeffquitney OR https://www.patreon.com/jeffquitney  more at http://quickfound.net/  'Simon Ramo's concept of \"polymorphic\"…", "posttime": "2020-05-09 03:24:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "多态,polymorphics,https", "title": "都是关于多态的(1960)[视频]", "title_en": "All About Polymorphics (1960) [video]", "transed": 1, "url": "https://vimeo.com/356421222", "via": "", "real_tags": ["多态", "https"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001315, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Orca是一种深奥的编程语言，旨在快速创建程序定序器，其中字母表的每个字母都是一个操作，其中小写字母对bang进行操作，大写字母对每一帧进行操作。\n此应用程序不是合成器，而是一个灵活的实时编码环境，能够将MIDI、OSC和amp；UDP发送到您的音频/视频接口，如Ableton、Renoise、VCV Rack或超级对撞机。\nC实现的直播编码环境运行在终端上。它的设计是为了节能。它可以处理大文件，即使您的终端很小。如果您需要帮助，请访问聊天室或论坛。\nsudo apt-get install git libncures5-dev libncursesw5-dev libportmidi-devgit clone https://github.com/hundredrabbits/Orca-c.git cd orca-cmake#编译orcabuild/orca#run orca。\n要选择您的MIDI输出设备，请按F1(或Ctrl+D)打开主菜单，然后选择MIDI输出.。\n┌ORCA─┐┌PortMidi Device Selection─┐│新││&gt；[*]#0-MIDI至0端口││打开.。││[]#2-ES1371││保存│└─┘│另存为.。│设置bpm.。││设置网格大小.。││自动调整网格│&gt；MIDI输出.。│控件.。││运算符.。││关于.。│退出│└─┘。\n核心库：C99编译器(不需要VLA)，外加足够的libc用于malloc、realloc、free、memcpy、memset和memmove。(此外，还必须支持#杂注ONCE。)。\n命令行解释器：以上功能，外加POSIX，以及足够的libc用于常见字符串操作(strlen、strcmp等)。\nLiveCoding终端UI：以上功能，加上ncurses(或兼容的curses库)，以及浮点支持(用于计时)。或者，PortMidi可用于启用直接MIDI输出。\n构建脚本(简称Tool)是用bash编写的。它应该可以与GCC(包括MUSL-GCC包装器)、tcc和clang一起使用，并且会自动检测您的编译器。您可以使用-c选项手动指定编译器。\n目前已知构建在macOS(GCC、clang、tcc)和linux(GCC、MUSL-GCC、tcc和clang，可选使用lld)和Windows上的cygwin或wsl(GCC或clang，tcc未经测试)。\nPortMidi是一个可选的依赖项。在运行工具构建脚本时，可以通过添加选项--portmidi来启用它。\n./tool build-c clang-7--portmidi orca#使用名为clang-7的编译器#(启用了优化)和#(启用了用于MIDI输出的PortMidi)构建livecoding环境。#二进制文件放在build/orca./tool build-d orca#livecoding环境的调试版本。#BINARY放在build/debug/orca./tool build-d cli#无头CLI解释器的调试版本。#BINARY放置在build/debug/cli./tool lean#与make lean相同。删除内部版本/。\nMake Release#Optimized Build，二进制文件放在build/or camake debug#调试版本，二进制文件放在build/debug/orcamake干净#删除build/。\n默认情况下，make包装器将启用--portmidi。如果您单独运行工具构建脚本，默认情况下不会启用--portmidi。\n用法：orca[选项][文件]常规选项：--undo-limit&lt；number&gt；设置最大撤消步骤数。如果您计划处理大文件，请将其设置为较低的数字。默认值：100--Initial-Size&lt；nxn&gt；创建新栅格文件时，请使用这些起始尺寸。--bpm&lt；number&gt；设置节奏(每分钟节拍)。默认值：120--SEED&lt；number&gt；设置随机函数的种子。默认值：1-h或--help打印此消息并退出。OSC/MIDI选项：--Strict-减少传出MIDI和OSC消息的计时抖动。使用更多CPU时间。--OSC-MIDI-BIDULE&lt；path&gt；将MIDI设置为通过格式化为Plogue Bidule的OSC发送。路径参数是Plogue OSC MIDI设备的路径。示例：/OSC_MIDI_0/MIDI\n$./tool build--portmidi orca#使用构建脚本编译orca$build/orca#运行orca。\n┌控件─┐│Ctrl+Q退出││箭头键移动光标││Ctrl+D或F1打开主菜单││0-9、A-Z、a-z、。插入字符││！：%/=#*││空格键播放/暂停││Ctrl+Z或Undo││Ctrl+X Cut││Ctrl+C Copy││Ctrl+V Paste││Ctrl+S Save││Ctrl+F Frame前进││Ctrl+I或插入附加/覆盖模式││&#39；(引号)矩形选择模式││Shift+箭头键调整矩形选择││Alt+箭头键滑动选择││`(Grave)或~幻灯片选择模式││Escape返回正常模式或取消选择││(AND)调整网格大小(水平)││_││+调整网格(垂直)││[AND]调整网格标尺(水平)││}调整网格标尺(垂直)和&gt；调整BPM││？控件(此消息)│└─┘。\nCLI(cli二进制)从文件读取并运行orca模拟1个Timestep(默认)或指定的数字(-t选项)，并将网格的结果状态写入标准输出。", "note_en": "Orca is an  esoteric programming language designed to quickly create procedural sequencers, in which every letter of the alphabet is an operation, where lowercase letters operate on bang, uppercase letters operate each frame.\n This application  is not a synthesizer, but a flexible livecoding environment capable of sending MIDI, OSC &amp; UDP to your audio/visual interfaces, like Ableton, Renoise, VCV Rack or SuperCollider.\n The livecoding environment for the C implementation runs in a terminal. It&#39;s designed to be power efficient. It can handle large files, even if your terminal is small. If you need  help, visit the  chatroom or the  forum.\n   sudo apt-get install git libncurses5-dev libncursesw5-dev libportmidi-devgit clone https://github.com/hundredrabbits/Orca-c.git cd Orca-cmake  # Compile orcabuild/orca  # Run orca\n  To choose your MIDI output device, press  F1 (or  Ctrl+D) to open the main menu, and then select  MIDI Output...\n ┌ ORCA ──────────────┐┌ PortMidi Device Selection ─────┐│ New ││ &gt; [*] #0 - Midi Through Port-0 ││ Open... ││ [ ] #2 - ES1371 ││ Save │└────────────────────────────────┘│ Save As... ││ ││ Set BPM... ││ Set Grid Size... ││ Auto-fit Grid ││ ││ &gt; MIDI Output... ││ ││ Controls... ││ Operators... ││ About... ││ ││ Quit │└────────────────────┘\n  Core library: A C99 compiler (no VLAs required), plus enough libc for  malloc,  realloc,  free,  memcpy,  memset, and  memmove. (Also,  #pragma once must be supported.)\n Command-line interpreter: The above, plus POSIX, and enough libc for the common string operations ( strlen,  strcmp, etc.)\n Livecoding terminal UI: The above, plus ncurses (or compatible curses library), and floating point support (for timing.) Optionally, PortMidi can be used to enable direct MIDI output.\n  The build script, called simply  tool, is written in  bash. It should work with  gcc (including the  musl-gcc wrapper),  tcc, and  clang, and will automatically detect your compiler. You can manually specify a compiler with the  -c option.\n Currently known to build on macOS ( gcc,  clang,  tcc) and Linux ( gcc,  musl-gcc,  tcc, and  clang, optionally with  LLD), and Windows via cygwin or WSL ( gcc or  clang,  tcc untested).\n  PortMidi is an optional dependency. It can be enabled by adding the option  --portmidi when running the  tool build script.\n    ./tool build -c clang-7 --portmidi orca  # Build the livecoding environment with a compiler  # named clang-7, with optimizations enabled, and  # with PortMidi enabled for MIDI output.  # Binary placed at build/orca./tool build -d orca  # Debug build of the livecoding environment.  # Binary placed at build/debug/orca./tool build -d cli  # Debug build of the headless CLI interpreter.  # Binary placed at build/debug/cli./tool clean  # Same as make clean. Removes build/\n  make release  # optimized build, binary placed at build/orcamake debug  # debugging build, binary placed at build/debug/orcamake clean  # removes build/\n The  make wrapper will enable  --portmidi by default. If you run the  tool build script on its own,  --portmidi is not enabled by default.\n  Usage: orca [options] [file]General options: --undo-limit &lt;number&gt; Set the maximum number of undo steps. If you plan to work with large files, set this to a low number. Default: 100 --initial-size &lt;nxn&gt; When creating a new grid file, use these starting dimensions. --bpm &lt;number&gt; Set the tempo (beats per minute). Default: 120 --seed &lt;number&gt; Set the seed for the random function. Default: 1 -h or --help Print this message and exit.OSC/MIDI options: --strict-timing Reduce the timing jitter of outgoing MIDI and OSC messages. Uses more CPU time. --osc-midi-bidule &lt;path&gt; Set MIDI to be sent via OSC formatted for Plogue Bidule. The path argument is the path of the Plogue OSC MIDI device. Example: /OSC_MIDI_0/MIDI\n  $ ./tool build --portmidi orca  # compile orca using build script$ build/orca  # run orca\n  ┌ Controls ───────────────────────────────────────────┐│ Ctrl+Q Quit ││ Arrow Keys Move Cursor ││ Ctrl+D or F1 Open Main Menu ││ 0-9, A-Z, a-z, Insert Character ││ ! : % / = # * ││ Spacebar Play/Pause ││ Ctrl+Z or Ctrl+U Undo ││ Ctrl+X Cut ││ Ctrl+C Copy ││ Ctrl+V Paste ││ Ctrl+S Save ││ Ctrl+F Frame Step Forward ││ Ctrl+I or Insert Append/Overwrite Mode ││ &#39; (quote) Rectangle Selection Mode ││ Shift+Arrow Keys Adjust Rectangle Selection ││ Alt+Arrow Keys Slide Selection ││ ` (grave) or ~ Slide Selection Mode ││ Escape Return to Normal Mode or Deselect ││ ( and ) Resize Grid (Horizontal) ││ _ and + Resize Grid (Vertical) ││ [ and ] Adjust Grid Rulers (Horizontal) ││ { and } Adjust Grid Rulers (Vertical) ││ &lt; and &gt; Adjust BPM ││ ? Controls (this message) │└─────────────────────────────────────────────────────┘\n  The CLI ( cli binary) reads from a file and runs the orca simulation for 1 timestep (default) or a specified number ( -t option) and writes the resulting state of the grid to stdout.", "posttime": "2020-05-09 03:23:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "视听,esolang,ctrl", "title": "ORCΛ：视听直播编码的esolang", "title_en": "ORCΛ: an esolang for audio-visual live coding", "transed": 1, "url": "https://git.sr.ht/~rabbits/orca", "via": "", "real_tags": ["视听", "esolang", "ctrl"]}, {"category": "", "categoryclass": "", "imagename": "e73d9788301c4148cdc6cbbb60b1d07e.png", "infoid": 1001314, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "像Siri、Google Now和Amazon Alexa这样的助手问世还不到十年，它们已经变得令人难以置信地无处不在。人们喜欢一个聪明的助手，他可以做任何人要求的事情。但是，如果你曾经尝试过测试这些助手中任何一个的极限，你很快就会意识到，他们只是还没有完全做到这一点。正如JR·拉斐尔在“计算机世界”(ComputerWorld)上所说的那样：\n事实是，尽管语音助手取得了很大的进步，也有很多方便的方式，但它们仍然经常失败，不可靠。谷歌和其他公司越是推动他们的虚拟助手，并扩大他们的运营领域，纠正这个问题的挑战就变得越紧迫。\n这些助理的未来会是什么样子呢？是不是有更多的技能？更多功能？我的观点是，虽然这些主流设备将慢慢改进，但它们的速度将比我们希望的要慢得多。由于这些助手纯粹是由自然语言处理和机器学习驱动的，失败是缺乏尚未开发的更复杂技能的自然结果。雇佣人工操作员来确保请求得到满足的成本将是站不住脚的-即使是对苹果这样的科技巨头来说也是如此。\n2019年1月，亚马逊宣布Alexa设备销量超过1亿台。在大规模营销活动的支持下，这些设备的推出将导致语音助手技术的广泛采用和社会正常化。但他们将如何改进呢？\n在过去的几年里，助理/礼宾领域的一些公司如雨后春笋般涌现出来。像Velocity Black这样的公司旨在创造面向超级富豪的高端礼宾服务，而其他公司，比如现在已经转型的GoButler，则试图为大众创造免费的礼宾服务。\n这些新兴公司正专注于构建为用户创造真正价值的解决方案，超越了简单的信息传递。他们不仅帮你安排日历，还帮你安排现实生活中的事情。这些公司中的大多数都有一个共同点，那就是它们几乎完全由坐在电脑前的人类提供动力，不断地处理客户的请求。这意味着它们最终会受到人力和容量限制，这些限制永久地限制了它们的扩展能力，从而限制了它们对大量用户的用处。因此，供需定律规定，他们的服务必须变得更昂贵，更难获得，就像我们看到的另一款个人助理Magic在用户成群结队试图注册时所看到的那样。\n未来充满了完全由人工智能驱动的助手的梦想。然而，除非发现人工通用智能，否则不久的将来很可能是混合的：虽然人类仍将是等式的一部分，但它们很可能会补充尖端的、不断学习的人工智能系统，这些系统逐渐承担着越来越多的工作。这将有助于扩大运力，降低这些服务对用户的成本。随着时间的推移，我们将达到这样的地步，人工智能系统和与现有应用程序的战略合作伙伴关系将为客户提出的绝大多数请求提供动力。我们不知道纯人工智能驱动的解决方案的未来会是什么样子，但机器学习方面的最新进展为我们提供了可能进入榜单的功能的线索。\n1.了解情感。像Affectiva这样的公司已经建立了一些技术，这些技术利用了边缘计算的最新进展，使他们能够在用户的本地硬件设备上培训和运行复杂的深度学习模型。这些发展将使虚拟助理能够以非常经济高效的方式有效地分析语音，然后生成与短音频片段相关联的情感特征列表。简而言之，助手可以利用这样的技术来了解我们在与他们交谈时的感受，并提供帮助，或者根据需要做出富有同情心的回应。\n2.了解你是谁。IBM Watson的个性洞察工具利用自然语言处理的最新进展和心理特征模型来分析简单的用户语音和用户生成的文本。该程序创建了一个用户的个性，相关的倾向，甚至购买的驱动因素的透彻的图片。助理服务可以使用这样的技术来更好地理解我们，并利用这些信息来调整他们与我们交谈的方式。\n3.了解你想要什么。我和我在Twing的团队正在构建技术，允许用户要求我们做事情，告诉我们他们的喜好，并在运行中自动执行他们想要的东西。我们的工作采用了新的技术，利用了生成性对抗神经网络(GANS)，这是一个系统，在这个系统中，多个相互竞争的神经网络接收大量数据，并相互竞争，以针对收集的训练数据生成最接近人类的动作。简而言之，该系统可以学习如何在现实世界中响应人类的语音行事。举个例子，你的助手会对你说早上好，帮你点你最喜欢的早餐到公司，给你做早间简报，让你知道去上班的优步很快就会到外面。\n4.为你做任何事。这些现代助理中的大多数远远不只是简单的问答。事实上，他们通过API与数百家合作伙伴公司合作，代表你完成事情。\n这些只是下一代助手通过利用机器学习和自然语言处理所能做的几个例子。归根结底，这些机器学习系统的能力是由使用情况驱动的；它们从一大群用户那里获得的数据越多，它们改进的速度就越快。\n这些新的助手将能够做的一些事情将从根本上改变我们与我们的设备的关系，引发关于隐私的重大对话，并让人们更仔细地考虑他们应该与这些助手分享什么。我们是否仍然可以相信这些辅助服务背后的公司是以我们的最佳利益为依归呢？大公司免费或以令人难以置信的低价提供助理服务，这本身就是有好处的；例如，让助理只从母公司购买商品和服务。希望我们会被那些为用户提供以隐私为中心的服务的公司所吸引。\n我相信下一代助手的未来在于人类和AI驱动的混合系统。他们会在现实世界中为你做事情(并得到你的同意)，使用你的数据来了解你，做出明智的决定，并像真正的助手那样行事。自然语言处理、机器学习的进步，以及训练复杂深度学习系统的速度和可及性，是推动这些助手每分钟变得更聪明的原因。现实生活中的Jarvis-All-All不再太遥远了。\nBuild In的专家撰稿人网络发表由创新技术专业人士撰写的深思熟虑、以解决方案为导向的故事和评论。它是科技行业分享创新道路上令人信服的解决问题的第一人称描述的最终目的地。", "note_en": "Assistants like Siri, Google Now, and Amazon Alexa have been around for less than a decade, and they&#39;ve already become incredibly pervasive. People love the idea of an intelligent assistant who can do whatever one asks. But if you&#39;ve ever tried to test the limits of any of these assistants, you very quickly realize that   they&#39;re just not quite there yet . As JR Raphael  put it  in  ComputerWorld :\n The truth is, for all of their progress and the many ways in which they can be handy, voice assistants still fail far too frequently to be dependable. And the more Google and other companies push their virtual assistants and expand the areas in which they operate, the more pressing the challenge to correct this problem becomes.\n What does the future hold for these assistants? Is it more skills? More features? My perspective is that while these mainstream devices will slowly improve, they&#39;ll do so at a much slower rate than we’d like. Since these assistants are driven purely by natural language processing and machine learning, failure is a natural result of a lack of more complex skills that have yet to be developed. The cost of employing human operators to ensure that requests get fulfilled would be untenable — even for tech giants like Apple.\n In January 2019,  Amazon announced that more than 100 million Alexa devices have been sold . The rollout of these devices — backed by massive marketing campaigns — will result in the widespread adoption and societal normalization of voice assistant technologies. But how will they improve?\n   A number of companies in the assistant/concierge space have sprouted up in the last few years. Companies like  Velocity Black  aim to create high-end concierge services geared toward the ultra-wealthy, while others, like the now-pivoted  GoButler , tried to create a free concierge service for the masses.\n These emerging companies are focusing on building solutions that create real value for users, going beyond the simple delivery of information. They don’t just help you with your calendar, but rather arrange things for you in the real world. What most of these companies have in common is that they are all almost entirely  powered by humans sitting at a computer, tapping away at customers&#39; requests . This means that they are ultimately bound by human labor and capacity constraints that perpetually confine their ability to scale, limiting how useful they can be to masses of users. As a result, the law of supply and demand dictates that their services must get more expensive and less accessible, much like we have seen with  Magic , another personal assistant, when users tried to sign up in droves.\n The future is filled with dreams of an assistant driven entirely by artificial intelligence. Short of the discovery of artificial general intelligence, however, the immediate future will most likely be hybrid: While humans will still be part of the equation, they will likely complement cutting-edge, ever-learning AI systems that gradually take on more and more jobs. This will help expand capacity and lower the cost of these services to users. Over time, we&#39;ll reach a point where a combination of artificial intelligence systems and strategic partnerships with existing applications are powering the vast majority of requests customers are making. We don&#39;t know what the future of purely AI-driven solutions will look like, but recent advances in machine learning give us clues for features that might make the cut.\n   1. Understand emotion. Companies like  Affectiva  have built technologies that leverage recent advances in edge computing that allow them to train and run complex deep learning models on users&#39; local hardware devices. These developments will enable virtual assistants to effectively analyze voice in a very cost effective manner, then generate a list of emotional characteristics associated with a short audio snippet. In short, assistants could leverage technologies like this to understand how we&#39;re feeling when we speak to them and offer help, or tailor responses to be sympathetic.\n 2. Understand who you are.  IBM Watson&#39;s  Personality Insights  tool leverages recent advances in natural language processing and models of psychological traits to analyze simple user speech and user-generated text. The program creates a thorough picture of a user&#39;s personality, associated tendencies, and even drivers of purchase. Assistant services could use technologies like this to &#34;understand&#34; us better, and use this information to modulate the way they speak to us.\n 3. Understand what you want.  My team and I at  Wing  are building technologies that allow users to ask us to do things, teach us about their preferences, and automate what they want on the fly. Our work employs novel techniques that leverage generative adversarial neural networks (GANs), a system where multiple competing neural networks take in vast amounts of data and compete with each other to generate the most human-like action against collected training data. In short, the system can learn how to do things in the real world in response to human speech. An example would be saying &#34;Good morning,&#34; and your assistant ordering you your favorite breakfast to arrive at work, providing you with a morning briefing, and letting you know that your Uber to work will be outside soon.\n 4. Get anything done for you. Most of these modern assistants go far beyond simple question and answer. In fact, they work with hundreds of partner companies through APIs to get things done on your behalf.\n These are just a few examples of what next-generation assistants will be able to do by leveraging machine learning and natural language processing. Ultimately, the capabilities of these machine learning systems are driven by usage; the more data they get from a large group of users, the faster they can improve.\n   Some of the things these new assistants will be able to do will fundamentally change the relationships we have with our devices, spark major conversations about privacy and make people more carefully consider what they should be sharing with these assistants. Will we still be able to trust that the companies behind these assistant services have our best interests at heart? Large corporations offering their assistant services for free or for an incredibly low price inherently have something to gain; for example, having assistants purchase goods and services exclusively from their parent companies. Hopefully, we&#39;ll gravitate toward companies that create privacy-centric services for their users.\n I believe the future of next-generation assistants lies in hybrid systems driven by humans  and  AI.  They will do things for you in the real world (and with your consent), use your data to learn about you to make informed decisions and behave as a real assistant would. Advances in natural language processing, machine learning and the speed and accessibility of training complex deep learning systems are what&#39;s driving these assistants to get smarter every minute. A real-life  Jarvis-for-all is not too far away anymore.\n  Built In’s expert contributor network publishes thoughtful, solutions-oriented stories and commentary written by innovative tech professionals. It is the tech industry’s definitive destination for sharing compelling, first-person accounts of problem-solving on the road to innovation.", "posttime": "2020-05-09 02:53:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "虚拟,virtual,助手", "title": "下一代虚拟助理将比Alexa和Siri性感得多", "title_en": "Next-Generation Virtual Assistants Will Be Far Sexier Than Alexa and Siri", "transed": 1, "url": "https://builtin.com/software-engineering-perspectives/virtual-assistants-alexa-siri", "via": "", "real_tags": ["虚拟", "virtual", "助手"]}]