[{"category": "", "categoryclass": "", "imagename": "d30e905fc49d135a8b3909588634d54a.jpg", "infoid": 1000306, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最初是一名平面设计师。网络开发只是将我的创造力带到生活中的一个工具。由于我不能跟上设计和开发领域的每一件事，我做出了一个艰难的决定，只专注于Web开发。考虑到我现在的生活会轻松一些，我惊讶地看到有这么多不同的方式可以作为开发人员-全栈、后端、前端、DevOps等。议程：00：00-从01：45开始-.的利弊.", "note_en": "I started out as a graphic designer. Web-development was just a tool to bring my creativity to life. As I couldn&#39;t keep up with everything going on in the design and development world, I made a tough decision to focus just on web development. Thinking that my life will be easier now, I surprisingly saw that there are so many different paths you can take as a dev- full-stack, backend, frontend, DevOps, etc.  Agenda:  00:00 - Beginning  01:45- The pros and cons of  ...", "posttime": "2020-05-02 18:05:35", "tags": "开发,应该,strive,development", "title": "多面手与专家--作为一名开发人员，您应该努力做到哪一种？", "title_en": "Generalists vs. specialists – which one should you strive for as a developer?", "transed": 0, "url": "https://youtu.be/LlFZ2tt-sTY", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["开发", "应该", "strive"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000305, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "哈佛大学伯克曼·克莱恩互联网与社会中心(Berkman Klein Center for Internet&Amp；Society)隐私专家、研究员布鲁斯·施奈尔(Bruce Schneier)告诉BuzzFeed新闻，我对联系人追踪应用的问题是它们完全没有价值。我甚至不是在谈论隐私问题，我是说它的功效。有人认为这会有用处吗？这只是政府想要做的事情，见鬼去吧。对我来说，这只是技术人员在做技术方面的事情，因为他们不知道还能做什么。\n我还没有在博客上写过这件事，因为我认为这是显而易见的。但从我收到的推文和电子邮件来看，似乎并非如此。\n这是一个经典的识别问题，疗效取决于两件事：假阳性和假阴性。\n误报：任何应用程序都会对联系人有准确的定义：让我们说，在超过10分钟的时间里，它的距离不到6英尺(约合3米)。假阳性率是未导致传播的联系的百分比。这将是因为几个原因。其一，这款应用基于GPS和蓝牙的定位和接近系统并不够精确，无法捕捉到每一个联系人。其次，这款应用程序没有意识到任何可以减轻罪责的情况，比如墙壁或……。\n假设你带着这款应用程序去杂货店购物，它随后会提醒你有联系人。你该怎么办？对你来说，把自己隔离两周是不够准确的。如果没有无处不在、便宜、快速和准确的测试，你就无法确认这款应用的诊断。所以警报是没用的。\n同样，假设你在杂货店购物时使用了这款应用，它不会提醒你有任何联系。你是清白的吗？不，你不是。你实际上并不知道你是否被感染了。\n最终的结果是一款不起作用的应用程序。人们会在社交媒体上发布他们的糟糕经历，人们会阅读这些帖子，并意识到这款应用程序不值得信任。这种信任的丧失甚至比根本没有应用程序还要糟糕。\n这与隐私问题无关。认为接触者追踪可以通过应用程序而不是人类健康专业人员来完成的想法是完全愚蠢的。\n此外，最大的假阴性：表面传播。有人在表面咳嗽，一分钟后你就会触摸到它。您从未接近过此人，也未注册为联系人。并不是说任何一种接触追踪都能找到这些东西。\n但并不是所有的技术人员都被这一点所诱惑-例如，在这份报告中它得到了短暂的回应：https://healthpolicy.duke.edu/sites/default/files/atoms/files/covid-19_surveillance_roadmap_final.pdf-以及Scott Gottleib，其他作者在医疗保健IT领域都有很大的影响力(例如，Farzad)。\n但从另一个角度来看：最终，我们拥有的唯一真正的工具是隔离；我们面临的主要问题是如何最有效地使用它，使成本/效益最大化。这款应用可能会在这方面扮演一个很小的角色，虽然不是你想象的那样简单，但更多的是让人们对他们周围的总体病毒载量进行估计。它不能取代真正的接触者追踪。\n也可以把它留在地面上，然后由从未直接接触过的人捡起来。\n如果你考虑到不同的生活条件，接触问题就会变得更糟。我现在住在一栋有多套公寓的房子里。每天早上，我都会去我的工作区，边工作边坐在电脑前8小时。我楼下的邻居可能也会这么做，但我很确定蓝牙无法分辨出我们之间有一层楼，可能会把这当作接触。我楼上还有个邻居。\n这对于跟踪应用程序有什么特别之处呢？或者你是在批评追踪接触者来控制流行病的整个想法？\n不幸的是，你似乎还没有对此进行足够详细的调查，然而你现在却突然到处被引用(危险)。几个错误的假设：-在iOS和Android的下一次更新中，将实现仅使用蓝牙追踪联系人，而Won&#39；不需要应用程序就可以运行(只需选择加入)。这意味着在iOS的4-5个月内，大约80%的设备都可以使用跟踪功能。当然在Android上就不是这样了，但考虑到这件事的批判性.。\n至少你没有对隐私问题大发雷霆，因为Android和iOS中新的联系人追踪API也已经解决了这一问题。在进一步分享之前，我鼓励您查看有关这些API的信息，并在此重新考虑您的帖子。\n我甚至不是在谈论隐私问题，我是说它的功效。有人认为这会有用处吗？\n我认为它可以作为后续传统接触者追踪调查的支柱。我没有完美的14天召回。我希望在我联系医疗专业人员的那一刻自动生成14天的地点/联系人报告，因为", "note_en": "&#34;My problem with contact tracing apps is that they have absolutely no value,&#34; Bruce Schneier, a privacy expert and fellow at the Berkman Klein Center for Internet &amp; Society at Harvard University, told BuzzFeed News. &#34;I&#39;m not even talking about the privacy concerns, I mean the efficacy. Does anybody think this will do something useful? ... This is just something governments want to do for the hell of it. To me, it&#39;s just techies doing techie things because they don&#39;t know what else to do.&#34;\n I haven&#39;t blogged about this because I thought it was obvious. But from the tweets and emails I have received, it seems not.\n This is a classic identification problem, and efficacy depends on two things: false positives and false negatives.\n False positives: Any app will have a precise definition of a contact: let&#39;s say it&#39;s less than six feet for more than ten minutes. The false positive rate is the percentage of contacts that don&#39;t result in transmissions. This will be because of several reasons. One, the app&#39;s location and proximity systems -- based on GPS and Bluetooth -- just aren&#39;t accurate enough to capture every contact. Two, the app won&#39;t be aware of any extenuating circumstances, like walls or  ...\n Assume you take the app out grocery shopping with you and it subsequently alerts you of a contact. What should you do? It&#39;s not accurate enough for you to quarantine yourself for two weeks. And without ubiquitous, cheap, fast, and accurate testing, you can&#39;t confirm the app&#39;s diagnosis. So the alert is useless.\n Similarly, assume you take the app out grocery shopping and it doesn&#39;t alert you of any contact. Are you in the clear? No, you&#39;re not. You actually have no idea if you&#39;ve been infected.\n The end result is an app that doesn&#39;t work. People will post their bad experiences on social media, and people will read those posts and realize that the app is not to be trusted. That loss of trust is even worse than having no app at all.\n It has nothing to do with privacy concerns. The idea that contact tracing can be done with an app, and not human health professionals, is just plain dumb.\n   Also, the biggest false negative: surface transmission. Someone coughs on a surface, and you touch it a minute later. You never went close to the person, and are not registered as a contact. Not that any kind of contact tracing can pick that stuff up.\n But not all techies are seduced by this - it got short shrift in this report, for instance:  https://healthpolicy.duke.edu/sites/default/files/atoms/files/covid-19_surveillance_roadmap_final.pdf - as well as Scott Gottleib, other authors have serious chops in Healthcare IT (e.g. Farzad)\n But a view from a different side: In the end, the only real tool we have is quarantine; the main question facing us is how to use it most efficiently, to maximise the cost/benefit balance. It&#39;s possible that the app will play a small role in that, though not in the simple way that you imagine, but more in giving people an estimate of the general viral load around them. It&#39;s not substitute for real contact tracing.\n or it can be left behind on a surface and picked up by someone later who was never in direct contact\n  the contact problem gets even worse if you take different living conditions into account. I&#39;m living in a house with multiple apartments. every morning I go to my workspace and sit there for 8h in front of my PC while working. my downstairs neighbor might do the same but I&#39;m pretty sure Bluetooth can&#39;t tell there&#39;s a floor between us and might count this as contact. I also have an upstairs neighbor...\n How is this specific to tracing apps? Or are you criticizing the whole idea of contact tracing to control epidemics?\n  Unfortunately it appears you haven&#39;t looked into this in enough detail, yet you&#39;re now being suddenly quoted everywhere (dangerous). Several erroneous assumptions: - Contact tracing by ONLY bluetooth will be implemented in the next updates of iOS and Android and won&#39;t require an app to function (just opt-in). That means the tracking capabilities will be available on about 80% of devices within 4-5 months on iOS. Less so on Android of course, but given the critical nature of this  ...\n At least you didn&#39;t rant about the privacy implications because, again, the new Contact Tracing APIs in Android and iOS have taken care of this as well. I would encourage you to review the information about these APIs and reconsider your post here before it&#39;s shared further.\n &#34;I&#39;m not even talking about the privacy concerns, I mean the efficacy. Does anybody think this will do something useful?\n I think it would be useful as the backbone of a subsequent traditional contact tracing investigation. I don&#39;t have perfect 14-day recall. I&#39;d prefer to have a 14-day place/contact report generated automatically the moment I contacted health professionals due to symptoms. The efficacy of the automated notifications is questionable but a &#34;trusted&#34; cross-platform OS level API for device proximity tracking seems reasonable and useful.\n the disease has some transmission rate that&#39;s less than 100% (and I don&#39;t know what that is).\n I&#39;mnot surprised, it&#39;s like trying to &#34;nail a buggy on a mule in the dark&#34; for several reasons. But two that are easy to see,\n 1, Even though  R 0 is an &#34;average&#34; it&#39;s for a moment in time, because it changes all the time, thus we have  R t when dealing with historic etc data (usually derived from a graph).\n 2, Like the Case Fataliry Rate (CFR) it&#39;s sensitive to it&#39;s inputs. Which in the case of asymptomatic and presymptomatic infection is very dificult to find out even remotely close without mass testing.\n  1, Let everyone get infected with attendant high mortality rates and getting an endemic infection with anything upto 1-6% of the worlds population dead.\n 2, Vacination, if one that is both safe and effective ever comes about (We still do not have vaccines four the four &#34;Seasonal CoV, or SARS-CoV-1)\n 3, Eradication, where the virus is robbed of hosts thus dies out and with a little luck becomes extinct. This can only be by effective &#34;Issolation&#34; not social distancing. Social distancing slows the spread it does not stop infections happening.\n As the first two are not realy options currently we are going for social distancing in the hope we can slow it enough so that healthcare has a chance to cut the death rate of the spreading infection.\n At some point social distancing is going to have to stop, because the economy will change beyond anything that would have been imagined half a year ago except by &#34;scare mongering scientists&#34;... And that sort of &#34;societal change&#34; an absolut anathema to the 1% of the 1% and other vested interests.\n      If anyone has any other ideas --and no I do not meen the idiotic &#34;herd immunity Policy&#34; carried out so disastrously in the UK etc-- then I for one would be delighted to hear about them.\n I&#39;m not an epidemiologist and may well be an idiot, but isn&#39;t this missing the point a bit? It&#39;s akin to not recommending that people wear masks on the basis that they only reduce the likelihood of transmission by a modest percentage rather than eliminating it (and yes, I know that there are also other reasons not to recommend wearing masks).\n Surely, even if an app correctly encourages only one out of every five or six vulnerable recipients to self-isolate or get tested when they wouldn&#39;t otherwise have done so, then the transmission rate is reduced, however minimally. The difference between a reproduction rate of 0.9 and 1.1 is the difference between a virus that eventually disappears in the local population and one that eventually infects almost everybody. This, in addition to other measures, still seems like quite an  ...\n Great post Bruce! But please correct the title from &#34;COVAD-19&#34; to &#34;COVID-19&#34; so it passes the most basic filters when sharing\n Richard is correct. If the contact tracing apps are billed as a complete solution, people will be disappointed. But that’s not the intent; they’re part of a suite of tools. They don’t need to be 100% accurate to have a positive effect.\n Manual contract tracing has the exact same problems. You’ll get false positives, because the virus doesn’t pass to everyone you come in contact with. You’ll also get false negatives, because you can’t identify everyone you were close to. But manual contact tracing works, as evidenced by South Korea. There’s no reason to think that good tracing apps can’t be a valuable assist.\n The contact apps aren&#39;t to alert you when you are in proximity with someone who as COVID.\n They are to trace those who have been in proximity with someone who is diagnosed with COVID for sufficient time to have become possibly infected and to get them tested.\n If we weren&#39;t concerned with privacy, each individual phone user would be identified and would be required to be tested.\n But with privacy, and sufficient testing capacity, people can be notified anonymously that they were in proximity of someone positively diagnosed and they can decide whether to get tested.\n Depending on how many choose to do that, it will have at minimum, some positive impact in that more people will get tested. There is though, if the proximity detection is even partly useful, the possibility that more positive cases will be detected and people can quarantine and also be treated if needed earlier.\n That should reduce the health impact of COVID-19 and treatments are more likely to be useful in the early stages of infection.\n Hi, Bruce! I agree with your assessment of false positives/negatives but I disagree with the conclusions you draw.\n In a pandemic a single individual is not significant. What does matter, however, is the herd. There is a significant advantage to reducing the number of cases, even if some alerts are false positives or some cases go missing as false negatives.\n The alerts/testing does not have to work with 100% precision to be effective. Even with only a 50% success rate this would be a great success. Remember pandemics are all about exponential growth and 1/2^n would help reducing cases tremendously.\n I&#39;m not sure whether the terms of &#39;false positives&#39; and &#39;false negatives&#39; apply here. It is not a test. It is about creating a contact list. And yes, it will not be perfect.\n I think Richard and Clive hit my main points, but here is another three cents.\n    The argument that the bluetooth contact tracing is not reliable enough to influence behaviour. As Richard pointed out, it doesn&#39;t have to persuade everyone, just a few percent; *but also* it isn&#39;t a binary decision. Maybe someone doesn&#39;t go to a big event because he had a couple of alerts recently. Instead of being an asymptomatic mega spreader, he is just a regular spreader.\n The other main point I wanted to make is that contact tracing may not be as rigorous as human driven contact tracing, but it has other possibilities. 1. It can handle anonymous contacts ( transmission on a bus, anyone? and 2. You can go back in time! Not very far, for privacy reasons, but if you start getting warnings about contacts who weren&#39;t infection when you met them, time to test.\n Minor points. 20% in Singapore, yes they&#39;re law abiding and tend to trust the authorities, but this is a central government database system including location, which is a massive dis-incentive. It also ran as a regular app, so had to be foreground to work, and chewed battery.\n Without ubiquitous testing, this is of limited use. However, anything that helps target testing, will make testing so much more effective.\n The bluetooth contact information doesn&#39;t have to be used in isolation. Ask about symptoms, give it more weight, find downstream contacts getting sick, give it more weight.\n  Absent someone outing themselves as a professional active epidemiologist, we should be very careful about writing this off for reasons we&#39;re not sure of. I do know there was a lot of noise about how long the viral RNA can remain viable on a surface in a lab ( probably based on test from SARS-1 virus), but I&#39;m hearing a lot now about this not being a proven vector, and that the main transmission vector is probably direct.\n I&#39;m not sure you are barking up the right tree here. A contact tracing app is not an infection test and should not be mistaken as replacing one. It can however shorten the reaction time to identify a better subset of high risk individuals in the overall population that at all had the chance of being close enough for a possible infection over the previous 14 days the moment someone testes positive, so they can be tested as well and potential pre- or non-symptomatic infections  ...\n Richard and Bryant are correct, This was never meant to be a 100% purposeful solution. it was just yet another prosthetic to help us manage the problem.\n The validity of input data is also a concern - i.e. questionable due to significant rates of RT-PCR false negatives and false positives. Studies have demonstrated false negative rate of between 10 to 50%, with many experts agreeing on conservative a estimate of 20%. In Australia, TGA admits tests have not been subjected to standard validations due to the fast track approval process. If the testing accuracy is dubious, then this undermines the premise of the app. Australia hasn&#39;t  ...\n And without ubiquitous, cheap, fast, and accurate testing, you can&#39;t confirm the app&#39;s diagnosis. So the alert is useless.\n We&#39;re working on &#34;ubiquitous, cheap, fast, and accurate testing,&#34;; will you revise your post once it&#39;s there? It already is there in a bunch of countries; are apps not useful there?\n The idea is not to have only apps, but to warn people who are at increased risk to nudge them towards getting tested. Contact tracing by hand worked remarkably well in many places; the apps are supposed to aid with that.\n  &gt; 2, Vacination, if one that is both safe and effective ever comes about (We still do not have vaccines four the four &#34;Seasonal CoV, or SARS-CoV-1)\n Well, no, but as Derek Lowe has pointed out, that&#39;s mostly because nobody&#39;s bothered. SARS-CoV-1 is extinct, and it&#39;s a bit hard to test a vaccine when you have no pathogen to test it against: the SARS-CoV-1 vaccines-under-development appear to have activity against SARS-CoV-2 as well, so that&#39;s givign them a head start. As for the other human coronaviruses... all put together, they cause perhaps 15% of human colds. So a vaccine against one would cure about 25%  ...\n SARS-CoV-2 is not like that. There&#39;s only one of it, it&#39;s not very diverse (it hasn&#39;t had time, even if it didn&#39;t also have a proofreader keeping the mutation rate down), and nobody has prior exposure. A vaccine is *definitely* worthwhile.\n I think you misunderstood one very important point: If you get a warning from the app that you have been in contact with someone you shouldn ’t quarantine for two weeks. You should limit your contacts for the next 72h and behave as „potentially infected “in a reasonable way and quarantine in case you get the slightest symptoms. So really wear mask, really don ’t see others and really be careful with your hand hygiene. The advantage of the app will be the time to know that you  ...\n The purpose of these contact apps - regardless of design and technique - is to suggest who should be tested next. Your scenario is not in use, these apps won&#39;t ever be able to tell you if you are a &#34;positive&#34; or &#34;negative&#34;.\n So there are no false negatives or positives at all - false positives will disappear when tested, and the only disadvantage they bring is loss of the limited test supply. False negatives should not - if they follow the social distancing rules - infect other people and will show up eventually when feeling sick.\n If testing supply is sufficient, you increase the amount of physical tests to minimze the amount of false negatives (if you&#39;ve ever been in range of an infected person you will be send to a test).\n In real world conditions now somewhere between one in a hundred or one per ten thousand persons you meet is infected, depending on location. So an app - even if done badly, distributed only to some people and not working all the time may still help to create a waiting-to-be-tested line that works better than random testing.\n In a perfcet world you simply test everyone 4 times in two weeks and you&#39;re done.\n @Tyler - can you provide any more details on three levels of proximity sensing? AFAIK, South Korea had to run a battery of device calibrations in order to compensate for the different broadcasting power levels of different phones/chips; from this I conclude that Bluetooth is not a good tool to measure distances to other devices. Please explain why that is incorrect.\n Also, I would like to comment on the &#34;something is better than nothing&#34; idea: if the app reports contact with someone tested positive for Covid-19, what happens next? With a decentralized, anonymous system, it is all up to the individual. If they all run and ask for a test, the testing system might not be able to cope given too many false positives. Even if they get a test, after a few times of having a negative test despite being alerted by the app, people will stop  ...\n And at this very moment in Europe, people with severe symptoms are still not being admitted to a proper test unless they have been in contact with someone known to be positive - so there seems a very strong need to keep the testing numbers low. Adding millions of app users will not help on that. And the app will NOT help any of the official contact tracing, as officials have not access to any useful data, even if you hand over your phone. All they get are random numbers  ...\n And finally: Once such an app is in place there is a clear danger the app will become &#34;mandatory&#34;, e.g. for admission to certain places (&#34;show me your app or I will not let you in&#34;).\n I think Stefan and Tyler both make good points - this is not a replacement for a medical test, and it isn&#39;t for now. It&#39;s about identifying higher risk individuals in the future.\n Can a phone tell if you&#39;ve been infected by Covid-19? Of course not. But it can give you some degree of warning if you&#39;re at higher risk due to past proximity with someone who has tested positive. Nothing replaces proper testing, though.\n You also assert &#34;It&#39;s not accurate enough for you to quarantine yourself for two weeks&#34;. I&#39;m afraid I take issue with this; that rather depends on your criteria for going into quarantine.\n - If you will only quarantine if you are proven sick, then yeah, it does nothing for you - *yet*. Testing is being scaled up in many countries, and in the future (while we&#39;re still dealing with this) having a warning might be a prompt to get tested and act based on it&#39;s result.\n - If you will quarantine if you&#39;ve had a warning - or perhaps a number of warnings - as you see it as your duty to prevent transmission even though you may or may not be infected, then maybe it&#39;s good enough now. Testing can catch up in time.\n The problem of false negatives - of contacts not being recorded - is not a problem in itself because that&#39;s the world we already live in. My concern, though, would be that people start to rely on the app, rather than continuing to keep their distance, wash their hands, and not touching their face.\n On problem of contact tracing (regardless of centralized or not) with Bluetooth or similar technology is that a malicious attacker with specialized radio equipment (think 500 meter instead of 5m, and think wardriving with radio signals from outside to inside a building) can make any group of people falsely believe that they are infected.\n For example, someone might just drive by a parliament building and send the members of parliament into voluntary home quarantine. This is possible with Bluetooth Beacons.\n Is my understanding correct? Let&#39;s say I own a restaurant and I want to shut down my competitor&#39;s restaurant. Or let&#39;s say I am a teenage kid and want to shut down my school. Or, let&#39;s say I am a US democrat and want to hurt the political activities of the republican party.\n I really don&#39;t know since I am not an expert, but I am wondering if such apps should be widely used.\n There is ways around every problem, i wonder why professionals are so quick to dismiss ideas completely because of minor hurdles..\n First of all you can definde logical sectors. You research in what possbile locations infection typically takes place. Then you can give an &#34;ID&#34; to these locations. (I dont want to go into technicals but for example QR Codes at store entrances and busses)\n Even if you only trace all public locations somebody has been to you have gained a lot.\n Another way to segment the problem is to use different modes, for home, outside, work etc.\n The limited testing capatibilities are exactly why an app would be helpful. You would know where to look without &#34;testing around&#34; cases.\n Of course there is other problems but there is also other solutions. You could develop cheap blue tooth transponders for rooms and vehicles for example.\n RE: &#34;My problem with contact tracing apps is that they have absolutely no value.&#34; Not true: they can improve reaction time, assuming the tools are use appropriately.\n  RE: &#34;To me, it&#39;s just techies doing techie things.&#34; Absolutely. This is a common problem: Americans in general, and techies in particular,  lovetechnical solutions, even if they don&#39;t make sense.\n  Alternative: If you want to avoid the issues in tracing and stop the spread of the disease, there is a simple, cost effective solution: 1. Assume that everyone outside your home is a potential carrier. 2. Assume that every surface you touch is potentially contaminated. (The only exception is a surface that you cleaned yourself -- recently.)\n Keep your distance. Wear a mask. Encourage others to wear one. If you touch an object or surface, wash your hands. You don&#39;t wait for an app to tell you that you might have been exposed. You don&#39;t rely on the person to self-isolate based on the app.\n One of the first rules of gun safety is this: assume that all guns are loaded. The only exception is a gun that you have unloaded yourself. Treat every gun that you handle as if it is loaded -- always. If you treat it with respect, you&#39;ll never have to say, &#34;I&#39;m sorry: I didn&#39;t know it was loaded.&#34;\n [My background in college was microbiology and biochemistry. I spent most of my early career working with scientists, where I regularly encountered hazardous materials.]\n The money spent on these dragnets for people&#39;s relationships (or better fascists&#39; wet dream) should better be spent by minifying surface conterminations and raising the sanitizing in the public space.\n Like: - having soap and sterilium dispensers in each and every public building, schools or toilet FOR FREE, and MQTT-driven &#34;refill needed&#34; and &#34;cleaning needed&#34; foot or ellbow operated buttons. AMZN should have a few from their shelved dash button project.\n  - changing the door opening programs for public means of transportation to open alway all doors to maximize air change and minimize door handle usage.\n    - use multilingual speech recognition in elevators (where you could for example say 5th floor, fünfter stock, or the name of any tennant in the 5th floor)\n - also rotating heat exchangers with moisture/enthalpy recovery in modern skyscrapers should be a big no-no sanitationwise.\n One further problem I see (which could be included in the &#34;false&#34; positive area) is false assumptions, of where everybody has a smart phone, and where there&#39;s a permanent 1:1 relationship between the user and the technology. This is very much in the vein of &#34;you are your phone&#34; that&#39;s presumed with things like payment systems.\n This is a real blind spot for the people who advocate this kind of application of technology, including the people who are advocating for online voting. For people who live in that kind of environment, where they are never without their phones, and have apps for everything, COVID tracking, voting, purchasing, multi-factor authentication, and nearly anything else is just another app.\n However, there are plenty of people out there that don&#39;t use their phones that way. There&#39;s still lots of feature phones out there, that don&#39;t have the capacities of a smart phone, including ones that don&#39;t support wi-fi or LTE (or GPS). And there&#39;s also plenty of places where people may share phones. Plus, the issues of people who are in areas (often, but not always, ru\n For the technically adept who live on their smartphones, it&#39;s easy to dismiss the people who don&#39;t have similar technology and usage patterns as Luddites that &#34;can&#39;t get with the program&#34;, but like it or not, that kind of usage is far from universal, and widespread enough that I think the kind of monitoring proposed will have significant (and likely fatal) gaps in coverage.\n I&#39;m unconvinced that this is a problem that can be solved with this application of this technology.\n Assume you take the app out grocery shopping with you and it subsequently alerts you of a contact. What should you do? It&#39;s not accurate enough for you to quarantine yourself for two weeks. And without ubiquitous, cheap, fast, and accurate testing, you can&#39;t confirm the app&#39;s diagnosis. So the alert is useless.\n If you assume that all the app does is say &#34;you had a contact&#34;, then yes, in the absence of easy testing, it&#39;ll quickly feel pointless to people.\n But what if, on the other hand, the app says something like: &#34;Your phone registered proximity to someone who&#39;s known to be infected, at [this time], for [this long]. Please answer a few questions:  - Were you around other people, or by yourself?  - Were you wearing a mask?  - Did you spend time within 6 feet of anyone who was not wearing a mask?&#34;\n  Given this, the app could help the user make a reasonable decision about their risk level; should they seek a test, or isolate at home?\n If we&#39;re concerned about too many false positives, the multipliers can be brought down, so for example, brief encounters are low risk, and if you say you were wearing a mask, it&#39;s listed as very low risk. But there will still be cases where this kind of app gives you value, especially after we&#39;ve opened up a lot; for example, if you&#39;re in a coffee shop without a mask for 2 hours, and then you later get an alert that someone infected was near you  ...\n There are ongoing studies right now to verify the efficacy of contact tracing apps, and whether the contacts they register are inline with what we would consider &#34;dangerous&#34; contacts with a reasonably high probability of transmission (e.g. by EPFL in Switzerland). Maybe we should all calm down and wait for the results before we start yelling at each other, and making arguments based on on intuition and &#34;common sense.&#34;\n (Also, just to point that out as well, these apps don&#39;t have to be perfect. It&#39;s totally fine for them to have a high percentage of false positives and false negatives, as long as they overall have a measurable positive impact on the reproduction number. And since small changes in the reproduction number can have large effects, even an app that only works somewhat poorly could still make the difference between an infection getting out of hand, and being contained.)  ...\n One final point: many of these apps do not work in the way you think they work, and can not be used to track people&#39;s behavior. Might be worth looking into actual proposals for how these apps will work instead of calling people fascists without any evidence.\n My view of these tracking apps seems to be somewhat different than the ones posted above. Even if there are tech problems with the apps; even if a lot of folks will not pay attention to the results; even if there are multitudes of false positive/negative results; if even one human life is saved, then it will benefit the future.\n Imagine that if one life saved is the future parent or grand-parent of the next Marie Curie, Albert Einstein, Jonas Salk, or Richard Feynman.\n Assume you take the app out grocery shopping with you and it subsequently alerts you of a contact. What should you do? It&#39;s not accurate enough for you to quarantine yourself for two weeks.\n Whether or not it&#39;s accurate, one might be concerned that the government would find out and order a quarantine. This is one of many reasons why people may avoid using the app (even if they have the technical capability to run it) which could make the false-negatives a self-reinforcing problem.\n If you can get clusters of people to use it, say everyone in a big office building, it&#39;s a lot easier to hit that 20-60% number than in the population as a whole.\n IMO these apps will be most useful as a tool to assist manual contact tracing teams at first.\n That&#39;s an overly simplistic analysis, that among other things only considers gross benefit rather than net benefit. I could just as easily say that the mental effects of pervasive surveillance could make &#34;the next Einstein&#34; turn away from physics. Maybe we&#39;d bring a deadly anti-government revolution into existence. These are all wild-ass guesses. Setting social policy based on evidenceless predictions is a fool&#39;s errand.\n Any &#34;if it only saves one life&#34; argument ignores the fact that there are trade-offs in all things. Everything has a cost and, scaled up to the world, it&#39;s not uncommon that that cost is greater than one life.\n Our rulers have been telling us nonstop for weeks that SARS-CoV-2 is so contagious that you can get it just from walking past someone on the sidewalk, and now we&#39;re all supposed to use &#34;contact tracing&#34; apps? Just who do they think they&#39;re kidding?\n This isn&#39;t a virus, it&#39;s a plot device in a badly written movie that does whatever the writer needs it to from one scene to the next without regard for logic or continuity.\n My understanding, is that the concept of &#34;contact tracing apps&#34; is not to  replace trained contact tracers, but rather to increase the amount of work they can accomplish in each day.\n  Perhaps at least one Asian country has already tried it, and the world can learn from their experience.\n I see that while I was editing this, Dan G made the same point more succinctly :)\n  Although there has been very much discussion of the possibility of transmission via surfaces, doctors just aren&#39;t seeing it. It appears (from real-life tracing of how people became infected) that almost all transmissions are to people who were within 2 meters of an infected person for more than 10 or 15 minutes.\n No technique will catch 100% of anything. That&#39;s not necessary, for it to be useful.\n    Some countries may achieve eradication within their borders ... but until vaccine eradication becomes possible, they would have to keep their travel barriers up high, and pay the price for that, permanently.\n Even with such barriers in place, these countries will have the reality that leakage can&#39;t reliably be forced to zero, and therefore be ready with Test/Trace/Isolate responses whenever a new case appears.\n Might be worth looking into actual proposals for how these apps will work instead of calling people fascists without any evidence. I called nobody a fascist. I called the system a fascist&#39;s wet dream.\n Somebody creates a system with the best intentions. Governments changes, systems stay, rules change... what do you do, if the next government misuses your system?\n And it will be misused at some point in time, because a pile of data invites misuse - just like trash attracts rats and left over french fires attracts raccoons. The best way ist to not collect possibly dangerous data at all.\n I showed up ways to lower the reproduction number of COVID-19 (and by the way other viruses and bacteria in the same effort). More sustainable, broader in effect, even accessible to people without smartphones, money, lobby and support (the working poor, and the really poor - these have been the substrate on which COVID19 grew in Singapore).\n With each and every such data collection system (and set of laws coming with it), please ask yourself: what could the next (possibly dystropean, stupid, extremist) government or junta do with it, should the country fails, elects an extremist party, breaks apart in a civil war, etc?\n If you introduce a situation where somebody can say &#34;the system said so&#34; and confine or even deport you &#34;for medical reasons&#34; *and everybody copes with it*, the temptation to just emulate &#34;is infected&#34;-events to get rid of &#34;the other side&#34; will grow fast. Not even the workers for this system would know that they deport or confine for political reasons, they just do their work.\n Maybe you should read up about the first &#34;big data&#34; application (made with punch cards and hollerith machines back in the day): the field &#34;religion&#34; in the dutch census database before 1933. Introduced with the best intentions (to calculate church taxes correctly and fast) the occupying germans said thank you, and used this information to pick up and deport the jews. Greetings from Anne F.\n Now sit down and make a list of what can be done under the worst circumstances with your proposed system and all data in it if NOT in the hands of St Lucas and used for the greater good of all human beings, but in the greedy claws of Kim Abu Adolpho Jean-Bedel al-Teherani from Somedistantholestan, if he wishes to divide and opress his subordinates.\n I&#39;m not sure whether the terms of &#39;false positives&#39; and &#39;false negatives&#39; apply here. It is not a test. It is about creating a contact list. And yes, it will not be perfect\n  Anyone who wants to understand the purpose of such tools, can consider the real-life example of crime investigators looking at the telephone records of a suspect.\n Will all of the calls on the phone log be related to the crime? Well duh, no! Of course not.\n Could there have been other conversations related to the crime that don&#39;t show in the phone log? Well duh, yeah! Of course.\n Despite these limitations, review of phone logs has enabled investigators to exclude or confirm suspects. It&#39;s a data source, NOT a diagnostic.\n False positives: Any app will have a precise definition of a contact: let&#39;s say it&#39;s less than six feet for more than ten minutes.\n They&#39;re Mormons. Caffeinated beverages are a sin. You&#39;re considered &#34;engaged&#34; if you stop to have a 10-minute conversation with some guy at a coffee shop. You&#39;re then obligated to have sex with him and make it right in the eyes of God. Those men are very suave, wear a certain kind of underwear, and maintain certain very proper and old-fashioned protocols and expectations of appropriate &#34;social distancing&#34; for a man&#39;s soon-to-be-carnal  ...\n This is a &#39;dumb&#39; take. The idea that contact tracing can be done with &#34;human health professionals&#34; is &#34;just plain dumb&#34;. The performance of human health professionals will also result in false positives and false negatives. What&#39;s the evidence that those rates are significantly better than an app?\n The smart take would realize that the choice isn&#39;t  betweenapps and &#39;professionals&#39; –they could and should be used together. Without an app like what&#39;s being discussed, how would any professionals be able to trace a person&#39;s contacts, e.g. at a grocery store? Maybe the transmission of some other disease could be traced by, e.g. reviewing security camera videos at a number of stores, but this disease doesn&#39;t seem likely to be contained  ...\n The better way to interpret  any contact tracing, either by app or &#39;professional&#39;, is not as a binary &#39;infected&#39; or &#39;not infected&#39; judgement but as  evidenceto be weighed by such factors as false positives, false negatives, or other (approximately) measured biases in the different procedures. Yes, there would almost certainly be some threshold that, when exceeded, any contact tracing operation would suggest (or demand) that a person  ...\n Also, the idea that contact tracing could be performed, &#39;at scale&#39;, by what someone might reasonably consider to be a &#34;human health professional&#34; is also &#34;just plain dumb&#34;. The people likely to be involved in any large scale contact tracing effort are almost certainly not going to be doctors or nurses to any significant extent. They might be &#39;professionals&#39; because they&#39;re being paid but they&#39;re only &#39;health  ...\n I agree with Bruce on this. All the arguments that &#34;it doesn&#39;t need be perfect&#34;, and &#34;contact tracing app is a positive contribution even if only helps track down a small number of cases&#34;, miss the point.\n The true positive results will be drowned in false positives, which will divert precious resources into conducting useless activities, and creating unneeded stress in people.\n It will also lull people into a false sense of safety. &#34;Oh, the techies are looking out for us, we&#39;re good&#34;. And so there will be false negatives that could have been prevented or detected through more serious means.\n There are some food for thought videos on this site, unpacking “R” into causal factors, discussing transmissibility in terms of a statistical population of values rather than a point value, and referencing realistic models (e.g. modeling portal MIDAS.)\n The idea behind the APP is that you have ubiquitous, cheap, fast, and accurate testing. But App or not, we need massive testing to get back to or near to normal again.   https://paulromer.net/\n  The numbers don&#39;t add up for mathematical modeling on YouTube. AMS is too much the gentleman&#39;s club, and there are too many fashion models on the premises.\n Do you mean to include Australia? The Commonwealth Government sat on its hands in Jan, Feb and half way through March. It allowed thousands of infected people to come from overseas straight into the community.\n The social distancing rules and business closures have been imposed by the State Governments. States have closed their borders to other States. Contact tracing and testing has been done by the States.\n  This seems calculated to convince the community to live with the virus. Lots of copies have been downloaded. It beats me why people have so much faith in computer systems.\n My understanding is that the Prime Minister of the other antipodean nation to which you may be referring, New Zealand, did state an intention to eradicate the virus.\n I can see your assertion that what is required is tracking, tracing, testing and confining. However in my view a clear aim should also be stated, perhaps:\n  Communities should demand that their Governments ensure that each infected person infect on average less than one other person.\n Modern infectious diseases like coronavirus are the consequence of industrial civilization: technical developments enable the high density populations of modern cities and the ability for rapid mass travel.\n  If we look at the efficiency of modern medicine, it is in rapid decline because many of the innovations that allowed us to get here are over 100 years old: sanitation and hygeine (Ignaz Semmelweiss), painkillers and anesthetics, antibiotics (developed for about $40,000 in basic science research), and the vaccine.\n  Modern medicine -- like any industrial enterprise -- is characterized by diminishing returns. In this context, to expect technology to save us from coronavirus is not rational. There are no technical solutions to the problems caused by too much technology.\n The solutions here are in the policy realm: a comprehensive system of social insurance so that the sick can get treated and national resources can be rapidly mobilized in an emergency; and, alongside this, a guaranteed minimum income so that those who are ill can stay at home without risking infecting others but can maintain their ability to participate in the economy.\n A starting point for the latter policy direction might be John Kenneth Galbraith&#39;s &#34;cyclically graduated compensation,&#34; which ties unemployment benefits to the unemployment rate. When unemployment is low, benefits are just enough to get by; when unemployment is high, benefits are competitive with wages. This eliminates the incentive to idleness and prevents recessions from driving down wages, all while preserving aggregate demand  ...\n It&#39;s voluntary to carry the app, then when it informs of a possible contact it&#39;s voluntary to get tested. Excuse me, what&#39;s the point? Just so Silicon Valley can be seen to be doing something, anything…\n The ugly point hidden so far is the monetization. It&#39;s beyond belief this app is given away in altruism.\n Maybe voluntary in one direction. If a test is what I wanted, it wouldn&#39;t be so easy to volunteer. My city has one testing center, a 4 hour walk from me, and if I thought I could walk or bike that distance there&#39;d be no reason to. It wouldn&#39;t exactly be a great idea to take a bus or taxi there. If I solved that problem, I still wouldn&#39;t be able to be tested, because it&#39;s only open to critical workers and their families, people  ...\n The tests need to be abundant and  accessible. These app makers would do more good by making an app that helped get people to tests, or tests to people. Health officials all praise testing, but much of the world seem to be dragging their feet on it. Stories abound of people who maybe once had COVID and don&#39;t expect to ever know.\n Contact tracking apps can be viewed as crude virus infection proxies. They imitate (with some degree of fidelity) the spreading mechanism of a generic virus.\n They proxy only the physical locality aspect of a virus infection opportunity. All other aspects are treated as if they were operating at 100% effectiveness.\n If widely enough adopted, they might provide insight into how the population is really interacting with itself. This in turn used with recorded cases and fatalities might help estimate the unknow infection rate.\n When infections are on the rise, we currently need to put 100% of the population into lockdown, i.e. a light to moderate quarantine. A widely used contact tracing app would allow us to only put those into quarantine who have had exposure. We might achieve half the efficacy of a total lockdown by merely quarantining 5% of the population. The rate of false positives hardly matters for this use-case, in some situations 99.9% could be acceptable.  ...\n Like brute forcing a password each char is exponential, a computer can do it but manual testing can&#39;t, you need 95% accurate tests.\n Probably pointless when you don&#39;t give your citizens proper welfare or source of income to be able to hunker down, they are going to revolt, or have to queue for food etc.\n The arguments about surface transmission, it&#39;s purely how well behaved your population is, social distancing and hand hygiene works. All you are doing with this argument is saying we&#39;ll all suffer the lowest common denominator.\n &#34;you can&#39;t expect people to isolate for 2 weeks if they get a false positive&#34; - social distancing and hygiene applies to households, households with positive cases still have family members living in them that are not catching it with proper protocols.\n So yes, it&#39;s easily defeated, but where you have a good uptake of proper behavior, where contact tracing and hygiene has already been successful, it makes that process much more thorough and faster if there is any more outbreaks of community transmission. Every contact will be tested.\n The wild card at the end of any theory is peoples behavior and the ugly truth is that&#39;s why some countries are doing better than others.\n Chinese Researchers fitst pointed out that something like 6% of those infected do not &#34;seroconvert&#34; (produce antibodies).\n The WHO later warned of this but frustratingly just said &#34;many&#34; not a range of percentages.\n But it&#39;s not just the seroconvertion issue, others are starting to say that in some the antibodies die back quickly --as little as two-four weeks, hence they can be reinfected in a very short time.\n Others think that the virus might hide in the body out of the circulatory system where our blood tests will not spot it. Thus it can come back with a vengence if those people are subject to stress.\n Such issues is confirmed by research could make a nonsense of &#34;back to work testing&#34;...\n But there are issues as I&#39;ve pointed out to @Jane and @C above, but there is more peculiarities being detected.\n There is a paper that I&#39;ve yet to read in depth done in the UK that has a cohort of ~16k patients, that tested positive in the UK, which is about a third of the total recorded cases at the time.\n Off the top of my head 14% did not progress to hospital, of those that did something like 30% died.\n But more intetestingly of those in hospital who died ~60% were men. But only about half of those in hospital had recognisable comorbidities.\n Those that were hospitalised tended to &#34;group&#34; that is they shared symptoms with others but not others.\n This suggests there are &#34;types&#34; of infection or patient. Which is which is unclear currently, but this raises the flag that there might not be a &#34;one size fits all&#34; vaccine. Which effects not just efficacy but safety as well. That is a vaccine that is safe for one type might be quite unsafe for another group.\n I would like to interject a question of practicality into this very interesting discussion of opinion and theory. Earlier this week, Apple began rolling out a beta of iOS 13.5 that includes the Covid-19 Tracking capability, with the default being &#34;On&#34;, located under Settings/Privacy/Health.  Does this mean someones iPhone running iOS 13.5 Beta is now collecting and reporting contact information to Apple, or does this mean the feature  ...\n There is , i wonder why professionals are so quick to dismiss ideas completely because of minor hurdles..\n No there are not ways around every problem, you would know that if you have been a practicing professional engineer for any period of time.\n Your first limitvand theres nothing you can do about this is &#34;the laws of physics&#34;.\n This leads into another issue even when the laws of physics do alow it, existing systems may not be designed for such solutions to be possible.\n Which leads into another issue &#34;work factor -v- Power Consumption&#34; if the solution cuts battery life down to only an hour or two a day, people are either not going to carry their phone because it&#39;s on charge all the time or they are going to turn the phone off.\n Which leads into another issue, the application may well be a resource hog this slow other applications on a phone down to a crawl.\n But there is another issue are all phones going to be able to run both Bluetooth and WiFi, they do share the frequency spectrum so what was once usable WiFi gets jamed by all those bluetooth emiting phones...\n There are a number of other just technical not security issues but the above should make you realise that there is NOT &#34;ways around every problem&#34;, and they are NOT &#34;minor hurdles&#34;.\n  To me, it&#39;s just techies doing techie things because they don&#39;t know what else to do.\n  Like so many other &#34;techies&#34; they have little or no clue what they are doing, because their love of technology and thinking they look clever is a Dunning-Kruger problem. Of which we have hundreds of thousands of examples with the likes of IoT and many &#34;start up gizmos&#34; all going wrong at the simple technical levels, let alone the security levels that very very few have any experience what so ever.\n  We&#39;re putting millions of people into effective quarantine today. Even if this app has a rate of 50% false positives and we end up putting hundreds of thousands people into quarantine wrongfully it&#39;s a huge win for society overall.\n One final point: many of these apps do not work in the way you think they work, and can not be used to track people&#39;s behavior.\n  The location of your phone is known to many people and both the IC and LEO&#39;s can get it either by just &#34;snooping on the backbone&#34; or poping around with an NSL etc.\n  I just wish people would take this fact on board because it might tell you why some LEO&#39;s are going to have wet dreams over this technology.\n But it gets worse your phone has no idea if it&#39;s recording another mobile phone or a &#34;fixed position beacon&#34;. This alows your phone position to be worked out fairky accurately especially if the accelerometers in the phone are also enabled.\n But it gets worse if a Government insists that the DB&#39;s are stored centrally (France for instance) or accessable centrally than any anonymity in the system can be fairly easily unrolled...\n And these are just one or two of the more easily seen flaws in the system, there are others and no doubt many more will be found with the Standards, Protocols and Implementations.\n  Perfection is the enemy of good. The system isn’t perfect but it is valuable.\n Your phone alerts you that someone you spent 18 minutes with at a coffee shop has tested positive. It recommends that you watch for symptoms and get tested.\n  A false negative is more risky because it may lead to a false sense of security as people go out convinced they don’t have coronavirus. But they would do that anyway without the app.\n Other considerations aside, if this application requires electricity to work, that could be a show-stopper on Iphone, at least my Iphone. 😉\n An official with a Canadian public health authority I questioned said in manual contact tracing they are only interested in people who had CLOSE and PROLONGED contact with an infected person. So, I conclude, there&#39;s no need for an app to, say, collect the numbers of people you walk by on the street on in a supermarket. Also remember that manual tracing -- like an app -- only covers who you are in contact with, not what you touch.\n I have a better idea: make it a feature of Pokémon. Ten million people will download it the first day, no questions asked.\n Contact tracing has a long history for STDs. STDs also have a medical solution. And for STDs the notion of a contact is nicely bounded.\n This bugger virus is not understood. It is interesting for an application to present a spaghetti map for others to map to if and only if the known positive Is in your cached weeks of stranger IDs matches.\n A virus transfer would look like any other interaction: hello Bob, drug sale, drug purchase, bum a cigarette, ask for directions, Time and space will have to be fuzzy for surface contact viral transfers.\n  The obvious is a test me notification icon. The number of triggered contacts is likely to be 20-200 times the number of positive tests. USA new cases yesterday 36,000 so ball park one million tests triggered a day.\n Speaking of ball park... model contact dynamics reported by such an application at a baseball or basketball game.\n Your phone alerts you that someone you spent 18 minutes with at a coffee shop has tested positive\n  Contact tracing has a long history for STDs. STDs also have a medical solution. And for STDs the notion of a contact is nicely bounded.\n Officially top secret, but an open secret, no doubt. The suave gentleman at the coffee shop, a.k.a. &#34;that guy,&#34; is simply  too entitled.\n Bread is said to leaven in 18 minutes, according to some of those Jewish rabbis.\n There was a certain worldly &#34;way of life&#34; at some of those coffee shops, which is no more, and cannot be.\n Social conversation cannot possibly spread disease more than mere physical proximity without the conversation and socialization.\n There is something more going on. It is the false expectation and assumption of more intimate contact at night to follow any sort of open conversation or talk by day.\n That&#39;s the Asian Yin–Yang. There are Asian triads and wiseguys who rule the night life of the city in a strange and inconsistent reflection of day life.\n about your sentence: &#34;To me, it&#39;s just techies doing techie things because they don&#39;t know what else to do.&#34; I&#39;d have added &#34;to defeat the virus&#34; in the end.  Instead for other purposes at least some governments will enjoy to look into collected data.  https://eprint.iacr.org/2020/493\n   Allowed HTML: &lt;a href=&#34;URL&#34;&gt; • &lt;em&gt; &lt;cite&gt; &lt;i&gt; • &lt;strong&gt; &lt;b&gt; • &lt;sub&gt; &lt;sup&gt; • &lt;ul&gt; &lt;ol&gt; &lt;li&gt; • &lt;blockquote&gt; &lt;pre&gt;", "posttime": "2020-05-02 18:05:30", "tags": "程序,病毒,app,冠状病毒,tracing", "title": "我使用冠状病毒接触者追踪应用程序", "title_en": "Me on Covid-19 contact tracing apps", "transed": 0, "url": "https://www.schneier.com/blog/archives/2020/05/me_on_covad-19_.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["程序", "病毒", "app", "冠状病毒", "tracing"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000304, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "双子座是一种新的合作设计的互联网协议，它探索地鼠和网络之间的空间，努力解决其中一个的(感知到的)局限性，同时避免另一个的(不可否认的)陷阱。\n该服务器托管Gemini的官方规范和其他文档，并为那些想要使用该协议的人提供免费的个人Gminispace(通过sftp管理)。这些内容的绝大部分是通过双子座本身提供的，所以你需要一个合适的客户端才能访问它。\n少量的服务器内容也可以通过下面的HTTPS或通过Gopher获得。", "note_en": "Gemini is a new, collaboratively designed internet protocol, which explores the space inbetween gopher and the web, striving to address (perceived) limitations of one while avoiding the (undeniable) pitfalls of the other.\n This server hosts the official specification and other documentation for Gemini, as well as offering free personal Geminispace (managed via  sftp) for those wanting to play with the protocol. The vast majority of this content is served via Gemini itself, so you&#39;ll need a suitable  client to access it.\n A small amount of the server&#39;s content is also available via HTTPS below, or via  gopher.", "posttime": "2020-05-02 18:05:27", "tags": "设计,collaboratively,提供,gemini", "title": "双子座--一种新的、协同设计的互联网协议", "title_en": "Gemini – A new, collaboratively designed internet protocol", "transed": 0, "url": "https://gemini.circumlunar.space/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["设计", "提供", "gemini"]}, {"category": "", "categoryclass": "", "imagename": "10d0075f0a234a5f330d3c1e530921c2.jpg", "infoid": 1000303, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "JavaSE13(2019年9月)引入了文本块作为预览特性，旨在减少在Java中声明和使用多行字符串文字的痛苦。随后在第二个预览版中对其进行了改进，做了一些细微的修改，并计划在JavaSE15中成为Java语言的永久特性(2020年9月)。\nJava程序中的字符串文字并不局限于像&#34；yes&#34；和&#34；no&#34；这样的短字符串；它们通常对应于HTML、SQL、XML、JSON甚至Java等结构化语言中的整个程序。\n文本块是可以包含多行文本的字符串文字，并使用三引号(&#34；&#34；&#34；)作为其开始和结束分隔符。\n文本块可以被认为是嵌入在Java程序中的二维文本块。\n能够保留嵌入式程序的二维结构，而不必使用转义字符和其他语言干扰，更不容易出错，从而产生更具可读性的程序。\n在纽约QCon的Java Futures中，Java语言架构师Brian Goetz带我们进行了一次旋风式的Java语言特性之旅。在本文中，他深入研究文本块。\nJavaSE13(2019年9月)引入了文本块作为预览特性，旨在减少在Java中声明和使用多行字符串文字的痛苦。\n随后在第二个预览版中对其进行了改进，做了一些细微的修改，并计划在JavaSE15中成为Java语言的永久特性(2020年9月)。\n文本块是可以包含多行文本的字符串文字。文本块如下所示：\n在这个简单的示例中，变量ADDRESS将包含一个两行字符串，每行后面都有行终止符。如果没有文本块，我们将不得不编写：\n字符串地址=&#34；25 Main Street\\n&#34；+&#34；美国Anytown，12345\\n&#34；或字符串地址=&#34；25 Main Street\\n，美国Anytown，12345\\n&#34；；\n正如每个Java开发人员都知道的那样，这些替代方案编写起来很麻烦。但是，更重要的是，它们也更容易出错(很容易忘记并没有意识到这一点)，也更难阅读(因为语言语法与字符串的内容混在一起)。因为文本块通常没有转义字符和其他语言中断，所以它让语言避开了障碍，所以读者更容易看到文本块中的内容。\n字符串文字中最常见的转义字符是换行符(\\n)，文本块允许直接表示多行字符串，因此不再需要换行符。换行符之后，下一个最常见的转义字符是双引号(\\&#34；)，必须对其进行转义，因为它与字符串文字分隔符冲突。文本块也不需要这些，因为单引号与三引号文本块分隔符不冲突。\n有人可能会认为这个特性会被称为多行字符串文字(很多人可能会这么称呼它)。但是，我们选择了一个不同的名称，文本块，以强调这样一个事实，即文本块不仅仅是不相关的行的集合，而是更好地被认为是嵌入在Java程序中的二维文本块。为了说明我们所说的二维是什么意思，让我们再来看一看。\n作者希望这篇文章能打印出什么内容呢？虽然我们无法读懂他们的想法，但似乎不太可能是想让XML块缩进21个空格；这21个空格更有可能仅仅是为了将文本块与周围的代码对齐。另一方面，几乎可以肯定的是，作者的意图是输出的第二行应该比第一行多缩进四个空格。此外，即使作者确实想要.。\n从这个例子中，我们可以看到，程序源代码中嵌入的多行文本块的块的自然缩进既来自于块的各行之间所需的相对缩进，也来自于块与周围代码之间的相对缩进。我们希望字符串字面值与代码对齐(因为如果它们不对齐，它们会看起来不合适)，并且我们希望字符串字面值的行反映相对缩进……。\n解决这个问题的一种方法是使用库方法，我们可以将其应用于多行字符串文字，例如Kotlin的trimIndent方法，而Java确实提供了这样的方法：string：：stripIndent。但由于这是一个非常常见的问题，Java走得更远，在编译时自动去除附带的缩进。\n为了理清附带的和必要的缩进，我们可以想象在包含整个代码段的XML代码段周围绘制尽可能小的矩形，并将该矩形的内容视为二维文本块。这是魔术", "note_en": "Java SE 13 (Sept 2019) introduced text blocks as a preview feature, aimed at reducing the pain of declaring and using multi-line string literals in Java. It was subsequently refined in a second preview, with minor changes, and is scheduled to become a permanent feature of the Java Language in Java SE 15(Sept 2020).\n  String literals in Java programs are not limited to short strings like &#34;yes&#34; and &#34;no&#34;; they often correspond to entire &#34;programs&#34; in structured languages such as HTML, SQL, XML, JSON, or even Java.\n  Text blocks are string literals that can comprise multiple lines of text and uses triple quotes (&#34;&#34;&#34;) as its opening and closing delimiter.\n  A text block can be thought of as a  two dimensional block of text embedded in a Java program.\n  Being able to preserve the two-dimensional structure of that embedded program, without having to muck it up with escape characters and other linguistic intrusions, is less error-prone and results in more readable programs.\n   In  Java Futures at QCon New York, Java Language Architect Brian Goetz took us on a whirlwind tour of some of the recent and future features in the Java Language. In this article, he dives into Text Blocks.\n Java SE 13 (Sept 2019) introduced   text blocks as a  preview feature, aimed at reducing the pain of declaring and using multi-line string literals in Java.\n  It was subsequently refined in a  second preview, with minor changes, and is scheduled to become a  permanent feature of the Java Language in Java SE 15(Sept 2020).\n Text blocks are string literals that can comprise multiple lines of text. A text block looks like:\n  In this simple example, the variable  address will contain a two-line string, with line terminators after each line. Without text blocks, we would have to have written:\n String address = &#34;25 Main Street\\n&#34; + &#34;Anytown, USA, 12345\\n&#34;;orString address = &#34;25 Main Street\\nAnytown, USA, 12345\\n&#34;;\n As every Java developer already knows, these alternatives are cumbersome to write. But, more importantly, they are also more  error-prone (it&#39;s easy to forget a  \\n and not realize it), and more  difficult to read(because the language syntax is intermixed with the contents of the string). Since a text block is usually free of escape characters and other linguistic interruptions, it lets the language get out of the way so it is easier for readers to see the contents of the  ...\n The most commonly escaped character in string literals is newline ( \\n), and text blocks eliminate the need for these by allowing multi-line strings to be expressed directly. After newline, the next most commonly escaped character is double quote ( \\&#34;), which must be escaped because it conflicts with the string literal delimiter. Text blocks eliminate the need for these as well, because a single quote does not conflict with the triple-quote text block delimiter.\n  One might think that this feature would have been called &#34;multi-line string literals&#34; (and, probably, that&#39;s what a lot of people will call it.) But, we chose a different name,  text blocks, to highlight the fact that a text block is not merely an unrelated collection of lines, but instead better thought of as a  two-dimensional block of textthat is embedded in a Java program. To illustrate what we mean by &#34;two-dimensional&#34;, let&#39;s take a slightly more  ...\n  What does the author expect this to print? While we can&#39;t read their minds, it seems unlikely that the intent was that the XML block should be indented by 21 spaces; it is far more likely that these 21 spaces are there solely to line up the text block with the surrounding code. On the other hand, it is almost certainly the author&#39;s intent that the second line of output should be indented by four more spaces than the first. Further, even if the author did want exactly  ...\n From this example, we can see that the natural indentation of a block of a multi-line block of text embedded in our program source derives both from the desired relative indentation between the lines of the block, and from the relative indentation between the block and the surrounding code. We want our string literals to line up with our code (because they would look out of place if they didn&#39;t), and we want the lines of our string literals to reflect the relative indentation  ...\n One way to address this problem is with a library method we can apply to multi-line string literals, such as Kotlin&#39;s   trimIndent method, and Java indeed does provide such a method:   String::stripIndent. But because this is such a common problem, Java goes farther, automatically stripping the incidental indentation at compile time.\n To disentangle the incidental and essential indentation, we can imagine drawing the smallest possible rectangle around the XML snippet that contains the entire snippet, and treating the contents of this rectangle as a two-dimensional block of text. This &#34;magic rectangle&#34; is the contents of the text block, and reflects the relative indentation between the lines of the block but ignores any indentation that is an artifact of how the program is indented.\n This &#34;magic rectangle&#34; analogy may help motivate how text blocks work, but the details are a little more subtle because we may want finer control over which indentation is deemed incidental vs essential. The balance of incidental vs essential indentation can be adjusted using the position of the trailing delimiter relative to the contents.\n  A text block uses triple-quotes ( &#34;&#34;&#34;) as its opening and closing delimiter, and the remainder of the line with the opening delimiter must be blank. The content of the text block begins on the next line, and continues up until the closing delimiter. The compile-time processing of the block&#39;s contents has three phases:\n Line terminators are normalized. All line terminators are replaced by with the LF ( \\u000A) character. This prevents the value of a text block from being silently affected by the newline conventions of whatever platform the code was last edited on. (Windows uses  CR +  LF to terminate lines; Unix systems use  LF only, and there are even  other schemes in use as well.)\n  Incidental leading white space, and all trailing white space, is removed from each line. Incidental white space is determined as follows:\t Compute a set of  determining lines, which are all the non-blank lines of the result of the previous step, as well as the last line (the line that contains the closing delimiter) even if it is blank;\n  Escape sequences in the content are interpreted. Text blocks use the same set of escape sequences as do string and character literals. Performing these last means that escapes like  \\n,  \\t,  \\s, and  \\&lt;eol&gt; do not affect the whitespace processing. (Two new escape sequences have been added to the set as part of  JEP 368;  \\s for an explicit space, and  \\&lt;eol&gt; as a continuation indicator.)\n In our XML example, all the whitespace would be removed from the first and last line, and the middle two lines would be indented by four spaces, because there are five determining lines in this example -- the four lines containing XML code and the line containing the closing delimiter -- and the lines are all indented by at least as much whitespace as the first line of content. Often enough, this indentation is what is expected, but sometimes we might not want to  ...\n  Because the last line is also a determining line, the common whitespace prefix is now the amount of whitespace before the closing delimiter in the last line of the block, and this is the amount that is removed from each line, leaving the whole block indented by four. We could also manage the indentation programmatically, via the instance method   String::indent), which takes a multi-line string (whether it comes from a text block or not), and indents every line by  ...\n  In the extreme case, if no whitespace stripping is desired, the closing delimiter could be moved all the way back to the left margin:\n  Alternately, we could achieve the same effect by moving the entire body of the text block back to the margin:\n  These rules may sound somewhat complicated at first, but the rules were chosen to balance the various competing concerns of wanting to be able to indent the text block relative to the surrounding program while not generating variable amounts of incidental leading whitespace, and providing an easy way to adjust or opt out of whitespace stripping if the default algorithm is not what is wanted.\n  Java&#39;s string literals do not support interpolation of expressions, as some other languages do; text blocks do not either. (To the extent that we may consider this feature at some point in the future, it would not be specific to text blocks, but applied equally to string literals.) Historically, parameterized string expressions were built with ordinary string concatenation ( +); in Java 5,  String::formatwas added to support &#34;printf&#34; style string formatting.  ...\n Because of the global analysis surrounding whitespace, getting the indentation right when combining text blocks with string concatenation can be tricky. But, a text block evaluates to an ordinary string, so we can still use  String::format to parameterize the string expression. Additionally, we can use the new  String::formatted method, which is an instance version of  String::format:\n  (Unfortunately, this method could not also be called  format because we cannot overload static and instance methods with the same name and parameter lists.\n  While string literals are, in some sense, a &#34;trivial&#34; feature, they are used frequently enough that small irritations can add up. So it should be no surprise that the lack of multi-line strings has been one of the most common complaints about Java in recent years, and that many other languages have multiple forms of string literals to support different use cases.\n What may be surprising is the number of different ways that such a feature is expressed in popular languages. It&#39;s easy to say &#34;we want multi-line strings&#34;, but when we survey other languages, we find a surprisingly diverse range of approaches in both syntax and goals. (And, of course, a comparably broad range of developer opinions about the &#34;right&#34; way to do it.) While no two languages are the same, for most features that are common to  ...\n The following table shows (some of) the options for string literals in various languages. In each, the  ... is considered the content of the string literal, which may or may not be processed for escape sequences and embedded interpolations,  xxx represents a user-chosen nonce that is guaranteed to not conflict with the contents of the string, and  ## represents a variable number of  # symbols (which may be zero.)\n   esc. Some degree of escape sequence processing, where escapes are usually derived from the C style (e.g.,  \\n);\n      here. A &#34;here-doc&#34;, where the following lines, up until a line that contains only the user-selected nonce, are treated as the body of the string literal.\n  prefix. The prefix form is valid with all the other forms of string literals, and have been omitted for brevity.\n  delim. The delimiter is customizable to some degree, whether by inclusion of a nonce (C++), a varying number of  # characters (Rust, Swift), or swapping curly braces for other matched brackets (Ruby).\n While this table gives a flavor for the diversity in approaches to string literals, it really only scratches the surface, as the variety of subtleties in how languages interpret string literals are too varied to be captured in such a simple form. While most languages use an escape language inspired by C, they vary in exactly what escapes they support, whether and how they support unicode escapes (e.g.,  \\unnnn), and whether forms that don&#39;t support  ...\n The most obvious axis of variation across languages is the choice of delimiters, and how different delimiters signal different forms of string literals (with or without escapes, single or multiple lines, with or without interpolation, choice of character encodings, etc.) But reading between the lines, we can see how these syntactic choices often reflect philosophical differences about language design -- how to balance the various goals such as simplicity,  ...\n Not surprisingly, the scripting languages (bash, Perl, Ruby, Python) have made &#34;user choice&#34; their first priority, with many forms of literals which may vary in non-orthogonal ways (and often, multiple ways to express the same thing.) But in general, languages are all over the map in how they encourage users to think about string literals, how many forms they expose, and how orthogonal those forms are. We also see several philosophies about strings  ...\n Despite the range of approaches and opinions, from the perspective of balancing principled design with expressiveness, there is a clear &#34;winner&#34; from this survey:  Swift. It manages to support escaping, interpolating, and true raw-ness with a single, flexible mechanism (in both single- and multi-line variants.) It should not be surprising that the newest language in the group has the cleanest story, as it had the benefit of hindsight and could  ...\n  Text blocks were not the first iteration of this feature; the first iteration was   raw string literals. Like Rust&#39;s raw strings, it used a variable-sized delimiter (any number of backtick characters) and didn&#39;t interpret the contents at all. This proposal was withdrawn after it was fully designed and prototyped, as it was judged that, while it was sound enough, felt too &#34;nailed on the side&#34; -- it had too little common with traditional  ...\n One major objection to the JEP 326 approach is that raw strings worked differently in every way from traditional string literals; different delimiter characters, varying vs fixed delimiters, single- vs multi-line, escaping vs non-escaping. Invariably, someone is going to want some different combination of choices, and there will be calls for more different forms, leading us down the road that Bash took. On top of that, it didn&#39;t do anything to  ...\n  Jim Laskey and Stuart Marks, of the Java team at Oracle, have published a  programmer&#39;s guide outlining the details, and style recommendations, for text blocks.\n Use text blocks when it improves the clarity of code.Concatenation, escaped newlines, and escaped quote delimiters obfuscate the contents of a string literal; text blocks get &#34;out of the way&#34; so the contents are more obvious, but they are syntactically heavier than traditional string literals. Use them where the benefits pay for the extra costs; if a string fits on a single line and has no escaped newlines, it is probably best to stick with  ...\n Avoid in-line text blocks within complex expressions. While text blocks are string-valued expressions, and therefore can be used anywhere a string is expected, it is not always best to nest text blocks within complex expressions; it is sometimes better to pull it out into a separate variable. In the following example, the text block breaks up the flow of the code when reading, forcing readers to mentally switch gears:\n String poem = new String(Files.readAllBytes(Paths.get(&#34;jabberwocky.txt&#34;)));String middleVerses = Pattern.compile(&#34;\\\\n\\\\n&#34;) .splitAsStream(poem) .match(verse -&gt; !&#34;&#34;&#34; ’Twas brillig, and the slithy toves Did gyre and gimble in the wabe; All mimsy were the borogoves, And the mome raths outgrabe. &#34;&#34;&#34;.equals(verse)) .collect(Collectors.joining(&#34;\\n\\n&#34;));\n If we pull the text block into its own variable, it is easier for readers to follow the flow of the computation:\n String firstLastVerse = &#34;&#34;&#34; ’Twas brillig, and the slithy toves Did gyre and gimble in the wabe; All mimsy were the borogoves, And the mome raths outgrabe. &#34;&#34;&#34;;String poem = new String(Files.readAllBytes(Paths.get(&#34;jabberwocky.txt&#34;)));String middleVerses = Pattern.compile(&#34;\\\\n\\\\n&#34;) .splitAsStream(poem) .match(verse -&gt; !firstLastVerse.equals(verse)) .collect(Collectors.joining(&#34;\\n\\n&#34;));\n Avoid mixing spaces and tabs in the indentation of a text block. The algorithm for stripping incidental indentation computes a common whitespace prefix, and therefore will still work if lines are  consistently indented with a combination of spaces and tabs. However, this is obviously brittle and error-prone, so it is best to avoid mixing them -- use one or the other.\n Align text blocks with the neighboring Java code. Since incidental whitespace is automatically stripped, we should take advantage of this to make code easier to read. While we might be tempted to write:\n void printPoem() { String poem = &#34;&#34;&#34;’Twas brillig, and the slithy tovesDid gyre and gimble in the wabe;All mimsy were the borogoves,And the mome raths outgrabe.&#34;&#34;&#34;; System.out.print(poem);\n because we don&#39;t want any leading indentation in our strings, most of the time we should write:\n void printPoem() { String poem = &#34;&#34;&#34; ’Twas brillig, and the slithy toves Did gyre and gimble in the wabe; All mimsy were the borogoves, And the mome raths outgrabe. &#34;&#34;&#34;; System.out.print(poem);}\n  Don&#39;t feel obligated to line up the text with the opening delimiter. We can choose to line up the text block contents with the opening delimiter:\n String poem = &#34;&#34;&#34; ’Twas brillig, and the slithy toves Did gyre and gimble in the wabe; All mimsy were the borogoves, And the mome raths outgrabe. &#34;&#34;&#34;;\n This might seem attractive, but can be cumbersome if the lines are long or the delimiter starts far to the left margin, because now the text will be sticking all the way into the right margin. But this form of indentation isn&#39;t required; we can use any continuation indentation, as long as we do so consistently:\n String poem = &#34;&#34;&#34; ’Twas brillig, and the slithy toves Did gyre and gimble in the wabe; All mimsy were the borogoves, And the mome raths outgrabe. &#34;&#34;&#34;;\n When a text block contains an embedded triple quote, only escape the first quote. While it is allowable to escape every quote, it is not necessary, and interferes needlessly with readability; escaping only the first quote is needed:\n String code = &#34;&#34;&#34; String source = \\&#34;&#34;&#34; String message = &#34;Hello, World!&#34;; System.out.println(message); \\&#34;&#34;&#34;; &#34;&#34;&#34;;\n Consider splitting very long lines with \\. Along with text blocks, we get two new escape sequences,  \\s (for a literal space) and  \\&lt;newline&gt; (a continuation line indicator.) If we have literals with very long lines, we can use  \\&lt;newline&gt; to put a line break in the source code but which is removed during the compile-time escape processing of the string.\n  String literals in Java programs are not limited to short strings like  &#34;yes&#34; and  &#34;no&#34;; they often correspond to entire &#34;programs&#34; in structured languages such as HTML, SQL, XML, JSON, or even Java. Being able to preserve the two-dimensional structure of that embedded program, without having to muck it up with escape characters and other linguistic intrusions, is less error-prone and results in more readable  ...\n  Brian Goetz is the Java Language Architect at Oracle, and was the specification lead for JSR-335 (Lambda Expressions for the Java Programming Language.) He is the author of the best-selling Java Concurrency in Practice, and has been fascinated by programming since Jimmy Carter was President.\n  A round-up of last week’s content on InfoQ sent out every Tuesday. Join a community of over 250,000 senior developers. \t\t\t View an example\n  Select your country              I consent to InfoQ.com handling my data as explained in this  Privacy Notice.", "posttime": "2020-05-02 18:05:25", "tags": "java,feature,string", "title": "Java Feature Spotlight：文本块", "title_en": "Java Feature Spotlight: Text Blocks", "transed": 0, "url": "https://www.infoq.com/articles/java-text-blocks/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["java", "feature", "string"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000302, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最后，Redis 6.0.0稳定版发布了。这一次，从发布第一个候选版本到最终发布稳定版本之间的周期相对较短。它花了大约四个月的时间，这不是一个很小的时间，但与我们过去的记录相比并不算多：)所以大新闻是之前宣布的，但有一些显著的变化。旧的东西是：SSL、ACL、RESP3、客户端缓存、线程化I/O、副本上的无盘复制、Redis-Benchmark中的集群支持……", "note_en": "Finally Redis 6.0.0 stable is out. This time it was a relatively short cycle between the release of the first release candidate and the final release of a stable version. It took about four months, that is not a small amount of time, but is not a lot compared to our past records :)So the big news are the ones announced before, but with some notable changes. The old stuff are: SSL, ACLs, RESP3, Client side caching, Threaded I/O, Diskless replication on replicas, Cluster support in Redis-benchmark  ...", "posttime": "2020-05-02 18:05:21", "tags": "redis,release", "title": "Redis 6.0 GA", "title_en": "Redis 6.0 GA", "transed": 0, "url": "http://antirez.com/news/132", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["redis", "release"]}, {"category": "", "categoryclass": "", "imagename": "7a034189248b66fe211290851ec0fb89.gif", "infoid": 1000301, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们很兴奋地宣布，Rust/WinRT项目终于在GitHub上有了一个永久的公共主页：\nRust/WinRT遵循C++/WinRT建立的使用标准语言和编译器为Windows运行时构建语言投影的传统，为Rust开发人员提供了一种自然而惯用的方式来调用Windows API。Rust/WinRT允许您使用从描述API的元数据直接动态生成的代码调用任何过去、现在和将来的WinRT API，并直接进入Rust包，在那里您可以像调用另一个Rust模块一样调用它们。\nWindows运行时基于幕后的组件对象模型(COM)API，并设计为通过C++/WinRT和Rust/WinRT等语言投影进行访问。这些语言投影获取描述各种API的元数据，并为目标编程语言提供自然绑定。正如您可以想象的那样，这使得开发人员可以更轻松地使用他们想要的语言为Windows构建应用程序和组件。然后，您可以使用这些Windows API来构建桌面应用程序、存储.。\n微软长期以来一直依赖C++作为我们很多工作的主干，但它面临着一些挑战，特别是在安全性方面。如果您遵循某些谨慎的约定，现代C++肯定会使编写安全可靠的C++变得更容易，但这通常很难在较大的项目中实施。铁锈是一种耐人寻味的语言。它在许多方面与C++非常相似，在编译、运行时模型、类型系统和确定性终结方面都恰到好处。..。\n下面是Rust调用Windows API的一个简单示例。API本身并不重要，但它应该能让您了解从Rust代码调用WindowsAPI的自然程度。在下面的示例中，我们使用Windows.Data.Xml.Dom命名空间中的XmlDocument类来分析和检查一个简单的XML文档：\n如果您熟悉Rust，您会注意到它看起来更像Rust，而不是C++或C#。请注意模块和方法名称上的Snake_Case以及？用于错误传播的运算符。\n下面是使用Windows.ApplicationModel.DataTransfer命名空间将一些值复制到剪贴板的另一个示例：\n作为一个更完整的例子，我鼓励您看看Robert Mikhayelyan的扫雷演示。Robert最初使用C++/WinRT编写了这款经典游戏的一个版本，并能够快速将其移植到使用Rust/WinRT。https://github.com/robmikh/minesweeper-rs。\n这是一个非常早的公开预览，但我们已经决定从现在开始公开工作。所以请试一试，让我们知道你的想法。我们希望在继续开发Rust/WinRT时得到反馈，并计划最终在crates.io上发布。我们还希望提供与现有Win32和COM API更无缝的互操作，包括对COM-rs crate的支持，后者目前支持COM API。https://github.com/microsoft/winrt-rs", "note_en": "We are excited to announce that the Rust/WinRT project finally has a permanent and public home on GitHub:\n  Rust/WinRT follows in the tradition established by  C++/WinRT of building language projections for the Windows Runtime using standard languages and compilers, providing a natural and idiomatic way for Rust developers to call Windows APIs. Rust/WinRT lets you call any WinRT API past, present, and future using code generated on the fly directly from the metadata describing the API and right into your Rust package where you can call them as if they were just another Rust module.\n The Windows Runtime is based on Component Object Model (COM) APIs under the hood and is designed to be accessed through language projections like C++/WinRT and Rust/WinRT. Those language projections take the metadata describing various APIs and provide natural bindings for the target programming language. As you can imagine, this allows developers to more easily build apps and components for Windows using their desired language. You can then use those Windows APIs to build desktop apps, store  ...\n Microsoft has long depended on C++ as the backbone for so much of what we do, but it has some challenges particularly when it comes to security. Modern C++ certainly makes it easier to write safe and secure C++ if you follow certain careful conventions, but that is often hard to enforce on larger projects. Rust is an intriguing language. It closely resembles C++ in many ways, hitting all the right notes when it comes to compilation, runtime model, type system and deterministic finalization.  ...\n Here below is a simple example of Rust calling a Windows API. The API itself does not matter, but it should give you a sense for how naturally Windows APIs may be called from Rust code. In the following example, we are using the XmlDocument class from the Windows.Data.Xml.Dom namespace to parse and inspect a simple XML document:\n  If you are familiar with Rust, you will notice this looks far more like Rust than it looks like C++ or C#. Notice the snake_case on module and method names and the ? operator for error propagation.\n Here is another example using the Windows.ApplicationModel.DataTransfer namespace to copy some value onto the clipboard:\n  For a more complete example, I encourage you to have a look at Robert Mikhayelyan’s Minesweeper demo. Robert originally wrote a version of the classic game using C++/WinRT and was able to quickly port it over to using Rust/WinRT.  https://github.com/robmikh/minesweeper-rs\n This is a very early public preview, but we have decided to work in the open from here on out. So please give it a try and let us know what you think. We would love the feedback as we continue to develop Rust/WinRT and plan to eventually publish on crates.io. We also hope to provide more seamless interop with existing Win32 and COM APIs including support for  the com-rs crate, which supports COM APIs today.  https://github.com/microsoft/winrt-rs", "posttime": "2020-05-02 18:05:19", "tags": "rust,winrt", "title": "Rust/WinRT公共预览", "title_en": "Rust/WinRT Public Preview", "transed": 0, "url": "https://blogs.windows.com/windowsdeveloper/2020/04/30/rust-winrt-public-preview/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["rust", "winrt"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000300, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "选择此选项将在上下文中搜索发布者/社会的所有发布", "note_en": "Selecting this option will search all publications for the Publisher/Society in context", "posttime": "2020-05-02 18:05:16", "tags": "免费,提供,today,选项,option", "title": "《今日物理》暂时免费提供其档案", "title_en": "Physics Today is temporarily making its archive freely available", "transed": 0, "url": "https://physicstoday.scitation.org/journal/pto", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["免费", "提供", "today", "选项", "option"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000299, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该存储库包含Arduino库、KiCAD PCB设计文件、Gerber生产文件、BOM和来自2018年OSHWA峰会的开源计算机鼠标礼包项目的组装说明。电路设计、PCB布局和代码由Joel Murphy(又名biomurph|@SafeForRobots)于2018年夏天制作。鼠标滚轮和滚轮支架是与Eugene Chang合作设计的，由有形创意公司制造。生产的PCB板是经过制作和填充的。\n是的，是的，确实是这样。几年前，我试图在开源硬件设计、生产和销售方面取得成功。我在SparkFun之前就做了这样的东西，但它从来没有起飞过。我一直坐在那几天的一小堆零部件上，今年夏天我决定把那一堆零配件砍掉。那就给你吧。一款功能齐全的电脑鼠标，让您随心所欲地修改和修改。欢迎光临！\n如果您有兴趣修改设计文件以更新此项目，我发现仍在销售此类光学鼠标传感器的地方是一家名为PixArt的公司，该公司有多种传感器可供选择。我的目标之一就是做到这一点，所以如果你想成为第一批知道我什么时候有工作原型的人，请看这个回购。\n下载此回购的ZIP或克隆它。然后将名为Mouse的文件移动或复制到Documents&gt；Arduino&&gt;Library文件夹中。打开或重新启动Arduino，Thengoto File&gt；Examples&gt；Mousey&gt；OpenMouse以查找在OpenMouse上运行的草图。\n这款开源计算机鼠标是围绕ATmega32U4构建的，带有Arduino Leonardo引导加载程序。它已经用Mousey库中的示例草图进行了编程。有两种操作模式HID和NOT-HID。使用鼠标左侧的滑动开关选择模式。\n当滑动开关位于距离每孔衬垫样机区域最近的一侧(也称为向下)时，鼠标处于HID模式。当插入微型USB电缆时，鼠标将读取传感器(轮子、按钮、光学传感器)，其功能就像连接到计算机上的鼠标一样！\n当滑动开关位于最靠近7针母接头的一侧(也称为向上)时，鼠标处于非HID模式。当插入微型USB线时，鼠标将读取传感器(轮子、按钮、光学传感器)，并以115200波特率通过串行发送数据。您可以打开任何串行终端从鼠标查看数据。\n将小鼠包装成HID位置的HID选择开关。如果您将鼠标插入计算机，但它的工作方式与鼠标不同，请检查以确保HID开关处于HID模式。标记为SW1的小触控开关是莱昂纳多的复位按钮。您可以即时切换模式，然后按下此重置按钮即可更改模式，而无需拔下鼠标插头。如果所有方法都失败了，请使用Mousey中的示例中的OpenMouse.ino代码重新编程鼠标。", "note_en": "This repository holds the Arduino library, KiCAD PCB design files, gerber production files, BOM, and assembly instructions for the open-source computer mouse goodie bag item from the 2018 OSHWA Summit. The circuit design, PCB layout, and code were produced by Joel Murphy (aka biomurph | @SafeForRobots) in the Summer of 2018. The mouse wheel and wheel holder were designed in collaboration with Eugene Chang, and manufactured by  Tangible Creative. The production PCB boards were fabricated and stuffed  ...\n      Yes, yes it did. Years ago, I tried to make a go of it in open-source hardware design, production and sales. I made something like  this before SparkFun did, but it never got off the ground. I&#39;ve been sitting on a small pile of components from those days, and this summer I decided that I have to chip away at that pile. So here you go. A fully functional computer mouse for you to hack and modify to your hearts delight. You&#39;re welcome!\n If you are interested in modifying the design files to bring this project up to date, the one place that I have found that still sells these kinds of optical mouse sensors is a company called  PixArt that has a variety of sensors to choose from. One of my goals is to do just that, so watch this repo if you want to be among the first to know when I have a working prototype.\n  Either download the ZIP of this repo or clone it. Then move or copy the file named  Mouseyinto your  Documents &gt; Arduino &gt; libraries folder. Open or restart Arduino, Thengoto  File &gt; Examples &gt; Mousey &gt; OpenMouse to find the sketch that runs on OpenMouse.\n  This open-source computer mouse is built around an ATmega32u4 with the Arduino Leonardo bootloader. It has already been programmed with the example sketch from the Mousey library. There are two modes of operation HID and Not-HID. Modes are selected using the slide switch on the left side of the mouse.\n  When the slide switch is on the side closest to the pad per hole prototyping area (aka DOWN), the mouse is in HID mode. When plugged into a micro USB cable, the mouse will read the sensors (wheel, buttons, optical sensor), and function just like a mouse attached to your computer!\n  When the slide switch is on the side closest to the 7 pin female header (aka UP), the mouse is in the Not-HID mode. When plugged into a micro USB cable, the mouse will read the sensors (wheel, buttons, optical sensor) and send the data it gets over serial at 115200 baud. You can open any serial terminal to view the data from the mouse.\n  The mice were packaged with the HID select switch in the HID position. If you plug your mouse in to a computer and it doesn&#39;t work like a mouse should, then check to make sure that the HID switch is in HID mode. The small tact switch labeled  SW1is the reset button for the Leonardo. You can switch modes on the fly, and press this reset button to change modes without unplugging your mouse. If all else fails, re-program the mouse with the OpenMouse.ino code from the example in the Mousey  ...", "posttime": "2020-05-02 18:05:13", "tags": "硬件,开源,鼠标,open,mouse", "title": "开源鼠标固件和硬件存储库", "title_en": "Repository for Open Source Mouse Firmware and Hardware", "transed": 0, "url": "https://github.com/biomurph/Mouse", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["硬件", "开源", "鼠标", "open", "mouse"]}, {"category": "", "categoryclass": "", "imagename": "f92429cfa9d112778efdf62f0b3c702b.jpg", "infoid": 1000298, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与世界其他地区一样，加拿大无人机制造商Draganfly一直在焦急地关注着这种新型冠状病毒的传播。2月中旬，当冠状病毒病例开始在华盛顿疗养院如雨后春笋般涌现时，该团队开始集思广益。到今年3月，DraganFly已经获得了从空中提供社交距离和健康监测服务所需的机器视觉和人工智能技术的许可。测试这项技术的需求是“永不满足的”，不仅来自政府和执法部门，也来自卫生部门……。\n但故事并没有到此为止。在西港飞行员突然终止前后，我们与DraganFly首席执行官卡梅隆·切尔(Cameron Chell)进行了交谈。无人机公司还有两名飞行员计划在不到两周内开始工作。切尔说，来自其他司法管辖区的请求已经“淹没”了“蜻蜓”，而私人方面的数字“甚至更多”。“事实上，接下来的几名美国飞行员将在私营部门。一种是基于无人机的，另一种是基于设施的。另外..。\n随着联邦和地方政府努力应对冠状病毒大流行-从跟踪冠状病毒的传播到判断何时取消限制-每个人都在更密切地关注无人机和机器人等自主技术。公共和私营部门迫切需要技术来帮助限制人类接触，并提供有关社会距离等措施的实施和有效性的早期检测数据。任何依赖人工交互的业务，无论是与客户的交互.。\n与大多数无人机公司不同，DraganFly拥有数十年的经验。该公司成立于1998年，切尔引以为豪的是，他领导着“世界上最古老的商用无人机制造商”。这家加拿大公司约有25名员工，总部设在萨斯喀彻温省的萨斯卡通，在温哥华、洛杉矶和北卡罗来纳州的罗利设有办事处。直到这个月，DraganFly可以说最出名的是在2013年开发了第一架被誉为拯救人类生命的无人机。\nVB Transform 2020 Online-2020年7月15日至17日：与领先的人工智能高管一起参加VentureBeat&#39；年度人工智能活动。立即注册，可节省30%的数字访问通行证。\n近年来，得益于市场领军企业大疆(DJI)和鹦鹉，廉价的消费级无人机变得流行起来。但蜻蜓的四个收入来源中没有一个是与消费者相关的。第一个是合同工程(主要是针对美国的一级军事承包商)。第二个是原始系统制造，也就是制造无人机…。\n虽然DraganFly自己不制造消费无人机，但它已经为客户设计了各种有效载荷、万向节附件和软件集成。该公司更喜欢美国法警和边境巡逻员等高度专业化的工作。忘了便宜的无人机吧-想想在较冷的天气里工作的电池，……。\nChell告诉VentureBeat说，DraganFly的客户“通常对性能有更高的要求”。“他们有一些特殊的需求，我们的工程就是根据这些需求来调整的。此外，他们往往不一定会购买那么多的外国产品。那个地区的买家更有责任感，当然是在军事层面上，对安全…。\n大约12周前，当“华盛顿疗养院的情况变得可怕”时，DraganFly团队正试图弄清楚无人机如何能提供帮助。但他们想做的不仅仅是使用无人机从空中对人大喊大叫。\n“我们就像是，‘在无人机上装扬声器？’有什么大不了的。真的？这不是创新，“切尔宣称。“我们在想，如果成功的话，我们需要能够提供比这种非常典型的用例更多的价值。”\n该公司意识到，它没有实现真正想做的事情的人工智能印章。因此，它开始与其合作伙伴进行谈判。\n“我们去找它了，”切尔说。“我们在想‘哦，热像仪！’可能世界上每个人都想过热像仪。我们很快就揭穿了他们的用法。热学不测量核心温度，这是了解是否存在潜在发烧所必需的。..。\n这家加拿大公司进行了研究，构建了用例，进行了测试，并在几周内签署了一项协议。DraganFly花了150万美元获得了一个健康和呼吸监测平台，即生命情报项目的许可，该平台是由UniSA和澳大利亚国防科学部合作开发的。\n生命智能项目可以帮助估计人与人之间的距离，但它也可以监测人群和劳动力中个人的温度、心率和呼吸频率。DraganFly设想这项技术将被航空公司和游轮部署；对于潜在的高危群体，比如护理中的老年人……。\n“我们授权它用于摄像网络和无人机，”切尔解释说。UniSA构建了核心技术--“特定的机器视觉和非产品化形式的人工智能。“蜻蜓”只是碰巧在它的名录中有一所公立研究型大学。然后，该公司开发了", "note_en": "Like the rest of the world, Canadian drone maker  Draganflyhas been anxiously watching the spread of the novel coronavirus. And when COVID-19 cases started springing up across Washington nursing homes in mid-February, the team began brainstorming. By March, Draganfly had licensed the machine vision and AI tech needed to offer social distancing and health monitoring services from the air. Demand to test the technology was “insatiable, ”not just from government and law enforcement, but also from health  ...\n But the story doesn’t end there. We spoke with Draganfly CEO Cameron Chell  before and after the abrupt termination of the Westport pilot. The drone company has two more pilots scheduled to start in less than two weeks. Chell says Draganfly has been “inundated ”with requests from other jurisdictions, while the numbers on the private side “are even more prolific. ”Indeed, the next couple of U.S. pilots will be in the private sector. One is drone-based, and the other is facility-based. Additional  ...\n  As federal and local governments wrestle with the coronavirus pandemic — from tracking the spread of COVID-19 to gauging when to lift restrictions — everyone is taking a closer look at autonomous technologies like  drones and  robots. The public and private sectors are desperate for technology that can help limit human contact and provide early detection data on the implementation and effectiveness of measures like social distancing. Any business that relies on human interaction, whether with customers  ...\n  Unlike most drone companies, Draganfly has decades of experience. It was founded in 1998, and Chell prides himself on leading “the oldest commercial drone manufacturer in the world.” The Canadian company has some 25 employees and is based in Saskatoon, Saskatchewan, with offices in Vancouver; Los Angeles; and Raleigh, North Carolina. Until this month, Draganfly was arguably best known for developing  the first drone credited with saving a human life, in 2013.\n  VB Transform 2020 Online - July 15-17, 2020: Join leading AI executives at VentureBeat&#39;s AI event of the year.  Register today and save 30% off digital access passes.\n Cheap consumer drones have become popular in recent years, thanks to market leaders  DJI and  Parrot. But none of Draganfly ’s four revenue streams is consumer-related. The first is contract engineering (primarily for tier one U.S.-based military contractors). The second is original systems manufacturing, meaning building drones  ...\n  While Draganfly does not build consumer drones itself, it has designed various payloads, gimbal attachments, and software integrations for its customers that do. The company prefers highly specialized work for the likes of U.S. marshals and border patrol. Forget cheap drones —think batteries that operate in colder weather,  ...\n Draganfly customers “generally have a higher performance requirement, ”Chell told VentureBeat. “They have some specialized needs that our engineering is attuned to. Also, they tend to not necessarily buy as much foreign product. The buyers in that area are a bit more conscientious, certainly on a military level, of security  ...\n  Some 12 weeks ago, when “things got scary in Washington with nursing homes,” the Draganfly team was trying to figure out how drones could help. But they wanted to do more than just use drones to yell at people from the skies.\n “We were like,  ‘Put a loudspeaker on a drone?’ Big deal. Really? That’s not innovative,” Chell declared. “We were thinking if this hits, we need to be able to provide more value than very typical use cases like that.”\n The company realized it did not have the AI chops to pull off what it really wanted to do. So it started talking to its partners.\n  “We went looking for it, ”Chell said. “We were thinking ‘Oh, thermal cameras! ’Probably every person in the world has thought about thermal cameras. And we debunked the use of those very quickly. Thermal doesn ’t measure core temperature, which is what is required to understand if there ’s a potential fever present.  ...\n The Canadian company researched, built use cases, ran tests, and in the space of a few weeks had signed a deal. Draganfly paid $1.5 million to license a health and respiratory monitoring platform, the Vital Intelligence Project, developed in a collaboration between UniSA and the Australian Department of Defence Science  ...\n The Vital Intelligence Project can help estimate the distances between people, but it can also monitor temperatures, heart rates, and respiratory rates of individuals in crowds and workforces. Draganfly envisioned the tech being deployed by airlines and cruise ships; for potential at-risk groups, like seniors in care  ...\n “We licensed it for camera networks and for drones, ”Chell explained. UniSA built the core technology —“the specific machine vision and AI in a non-productized form. ”Draganfly simply happened to have the public research university in its Rolodex. The company then developed the productized form, including camera  ...\n “That includes everything from going out and doing the policy development work through to what the GUI needs to look like, ”Chell said. “Both software and mechanical engineering to provide stabilization on the drones so that they ’re optimized to collect this data. That piece of IP, go to market, and actual commercialization  ...\n  Still, some repurposing was required, as the Vital Intelligence Project was not exactly being used to monitor groups of people.\n “They were using it so that they can fly helicopters over …disaster relief zones and pick up the vital signs of survivors on the ground, ”Chell said. “They could determine what resources they needed to apply where or the severity of survivors ’current situation, and did they need to get them right at that moment.  ...\n Draganfly and the university took the technology and adapted it for social distancing and health monitoring. To be clear, the Vital Intelligence Project had never been strapped to a drone and pointed at a crowd before the Westport pilot.\n “The previous use case that would be most similar to this one was designed to be used in disaster relief areas to get the vital signs of survivors on the ground, ”Chell said. “Those happen to be the same set of vital signs that we can now pick up anonymized in a crowd to determine if there ’s infectious or respiratory  ...\n  Draganfly started test flights in Westport, Connecticut to identify social distancing and detect symptoms. The city is in Fairfield County, adjacent to New York City and considered the epicenter for the spread of the coronavirus in Connecticut.\n The three-phase pilot was supposed to validate the technology’s use and have officials develop public safety policy around it. The next step would have been to test those policies. The whole process was supposed to take some 60 days, during which Draganfly hoped to initiate additional pilots.\n  Phase one was to test whether the technology could be an effective resource multiplier, letting officials cover more ground to see if social distancing is being effectively adhered to, for example. Instead of sending a few cruisers out and having officers walk around, they could put one camera up in the sky  ...\n “Social distancing, which we ’ve shown on the videos, that ’s actual visual data, ”Chell said. “It gives the operator of the camera, typically the officer, the real-time data. They should make operational decisions at that point if they need to separate a crowd. Or everything is fine [and] they don ’t need  ...\n  Westport First Selectman Jim Marpe called it the “Flatten the Curve Pilot Program. ”It was supposed to help the community “practice safe social distancing, while identifying possible coronavirus and other life-threatening symptoms. ”Police Chief Foti Koskinas said at the time: “Using drones remains a go-to  ...\n There was no health monitoring in phase one. Before the Westport pilot ended, Chell was already calling phase one a “success, ”so we asked what exactly that meant. “The technology worked in a real-world environment, ”Chell said. “So that was successful. We were able to get very good operational social  ...\n  In announcing the end of the pilot just a couple of days later, Marpe said, “in our good faith effort to get ahead of the virus and potential need to manage and safely monitor crowds and social distancing in this environment, our announcement was perhaps misinterpreted, not well-received, and posed many  ...\n  When we spoke to Chell a few days later, he seemed to understand why the pilot had to end.\n “The official pushback was around health monitoring, and the misunderstanding around how it works, what it does, and what it ’s for, ”he said. “And so at this point, Westport just feels politically that they just don ’t want to move forward with the project. They had been extremely helpful. They provided  ...\n No part of the Vital Intelligence Project employs facial recognition technology, Draganfly has consistently said. Still, we wondered if the resulting output from phase one could be repurposed to do so. Could someone take the video feed and run a facial recognition algorithm on top of it?\n “No more than you could do that on a security camera system today, ”Chell explained. “The requirements to run social distancing, in terms of resolution and stabilization in the video platform are minute compared to what you have to have in order to run the health measurement platform. So while today  ...\n  The pilot never got to phase two, which was the anonymized health measurement. The plan was to test crowds as sample sets —how many are coughing, sneezing, have a fever (considering heart rate, respiratory rate, high blood pressure, and biometric measurements based on skin tones). We asked if the  ...\n “It has. There ’s some challenges with that at times, ”Chell admitted. “So darker skin tones and different types of lights and the rest of it can create some problems. If you have somebody walking up to a kiosk and using this type of technology, it ’s a different scenario because it ’s a controlled  ...\n  That’s not a problem, Chell insists, because the technology is not meant to identify people. The whole point is to measure the health of a population.\n “When you combine things like fever, coughing, elevated heart rate, particular respiratory rates, then you ’ve got a picture of health, ”Chell said. “You ’re not diagnosing if somebody has COVID-19 or not, but you are doing a health measurement and getting a pretty clear idea of the rate of infectious  ...\n  One big difference between phase one and phase two that led to major confusion is that the latter does not output video. Draganfly published videos to show how the technology worked, but that was misleading. The health measurement system does not record the subjects at a location that the drone  ...\n “It just comes back and says in this particular geographic location, where you did the health measurement data, there were 22 people in the field view. Here are the heart rates, here are the respiratory rates, here are the fevers. Here ’s the likelihood, and percentage of, infections and/or  ...\n  “You need at least that much data time to understand respiratory rate, ”Chell explained. “In that timeframe, you also have your heart rate beating so you ’re able to collect that data concurrently. You can get biometric measurements of skin tone data quite quickly as well in that timeframe.  ...\n The drone sends the data it collects back to the cloud (Draganfly uses AWS and Fortinet) for processing. “All of that happens in the cloud through encrypted lines. So that is a secure cloud environment where all of that AI happens. If the drone goes down, there ’s no SD card that you can pull  ...\n  Interestingly, Westport wasn ’t using Draganfly drones —the plan was to deploy its Commander series in phase three. In the interest of time, the first two phases were to rely on third-party drones, which Westport already had. The police department launched its drone program in early 2016  ...\n Draganfly claims its technology works at up to 190 feet away from subjects. “At 190 feet, you ’re talking about a $35,000 drone, just because of the cameras and the additional sensors and stabilization. On a $600 drone, that doesn ’t have really optimized stabilization software and such  ...\n But again, that was meant for phase three. The Draganfly system Westport piloted could have potentially worked from almost 10 times further away. For now, it doesn’t look like Westport will ever verify those claims. Other towns and companies, however, want to try.", "posttime": "2020-05-02 18:05:10", "tags": "开展,pandemic,无人机,draganfly", "title": "美国开展了“蜻蜓”和“大流行无人机”试点研究。", "title_en": "Draganfly and ‘pandemic drone’ pilot studies in the U.S.", "transed": 0, "url": "https://venturebeat.com/2020/04/30/draganfly-pandemic-drone-united-states-pilots/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["开展", "pandemic", "无人机", "draganfly"]}, {"category": "", "categoryclass": "", "imagename": "9f201dcdf46ef4ab8c9832a2c405e78d.jpg", "infoid": 1000297, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌对澳大利亚悬而未决的2020年电信立法修正案(国际生产订单)法案(IPO法案)提出了几个担忧，包括英联邦对措辞的选择，建议的记录共享途径，以及该法案与美国澄清海外合法使用数据法案(CLOUD Act)的目的不符。\nIPO法案意在修订1979年美国电信(截取和访问)法案(TIA Act)，为澳洲机构创建一个框架，以便从与澳洲有协议的国家的外国指定通信提供商那里获得存储的电信数据，反之亦然。它还将取消指定的行政上诉法庭成员签发某些逮捕令的能力。\n云法案是澳大利亚获得拟议中的与美国的双边协议以实施云法案的前提条件。\n云法案创建了一个法律框架，规范执法部门如何跨境访问数据。\n如果协议最终敲定并获得批准，澳大利亚和美国的服务提供商将能够回应对方国家要求获取电子证据的合法命令。\n一项双边云法案协议将使澳大利亚执法部门能够为国内订单提供打击直接针对美国公司的严重犯罪所需的通信数据，反之亦然。\n在提交给议会情报与安全联合委员会(PJCIS)及其对IPO法案的审查报告的一份意见书[PDF]中，谷歌表示，虽然它鼓励和支持澳大利亚政府就行政协议进行谈判的努力，但它表示，该法案中的某些内容令人担忧。\n特别是在考虑如何将本条例草案下的截取权力与有争议的“电信和其他立法(协助和接入)法”下的技术能力通知一起使用时，它写道。\n在向PJCIS提出建议时，谷歌表示，该法案不应适用于作为企业或政府实体基础设施提供商的服务提供商，称企业或政府实体最适合自己制作所要求的记录。\n根据条例草案，指定通讯供应商须向提出要求的机构或澳洲指定当局提供任何要求的通讯及数据。谷歌更愿意授权成为一个双向渠道。\n恕我直言，我们的经验是，更好的方法是，所有与澳大利亚执法机构的通信都通过指定的机构进行，该机构充当多个机构的协调人，该机构写道。\n建立一个协调机构将防止重复的风险，并将作为培训、教育和与指定通信提供商联系的单一联系点。\n对不遵守IPO的民事处罚建立了一个合规框架。如果指定通信提供商收到有效的IPO，并且指定通信提供商在IPO发行时达到强制执行阈值，则指定通信提供商必须遵守IPO。\n谷歌将这两步测试称为门槛，即达到门槛相对较低的门槛。\n不遵守首次公开募股(IPO)的规定可能会导致法人团体被处以高达1000万澳元的民事罚款。它表示，强制要求遵守IPO的义务与“云法案”(Cloud Act)的目的背道而驰，该法案旨在解除屏蔽法规，但并未明确规定服务提供商必须承担义务。\n法案的作者似乎意识到了这种二分法，因为法案明确宣称澳大利亚的服务提供商不必遵守国际机构的互惠要求。\n具体地说，这家搜索巨头表示，它对试图将强制性义务强加给总部设在海外的指定通信提供商感到担忧，这种义务只存在于构建一项其他非强制性的国际协议中。\n它写道：[我们]恭敬地要求对此进行修改，以反映云法的意图，即在现有法律中找到执法程序，并删除对民事处罚的提及。\n在其他地方，谷歌正在寻求有关合格法官在批准涉及截获通信的IPO时将扮演的角色的进一步信息。\n鉴于“托拉法”等其他相关立法缺乏适当的基于案情的上诉程序，推迟现有的上诉机制并不令人满意。\n依赖现有法律作为上诉程序的主要来源是特别有问题的…。特别是，海外供应商", "note_en": "Google has raised a handful of concerns with Australia&#39;s pending  Telecommunications Legislation Amendment (International Production Orders) Bill 2020 (IPO Bill), including the Commonwealth&#39;s choice of phrasing, the avenues proposed for record-sharing, and the Bill being at odds with the purpose of the United States&#39;  Clarifying Lawful Overseas Use of Data Act (CLOUD Act).\n The IPO Bill is intended to amend the  Telecommunications (Interception and Access) Act 1979 (TIA Act) to create a framework for Australian agencies to gain access to stored telecommunications data from foreign designated communication providers in countries that have an agreement with Australia, and vice versa. It would also remove the ability for nominated Administrative Appeals Tribunal members to issue certain warrants.\n The  Bill is a precondition for Australia to obtain a proposed bilateral agreement with the United States in order to implement the CLOUD Act.\n The  CLOUD Act creates a legal framework regulating how law enforcement can access data across borders.\n If the agreement is finalised and approved, service providers in Australia and the US would be able to respond to lawful orders from the other country for access to electronic evidence.\n   A bilateral CLOUD Act agreement would enable Australian law enforcement to serve domestic orders for communications data needed to combat serious crime directly on US-based companies, and vice versa.\n In a  submission [PDF] to the Parliamentary Joint Committee on Intelligence and Security (PJCIS) and  its review of the IPO Bill, Google said while it encourages and supports efforts by the Australian government to negotiate an executive agreement, it said there are certain elements of the Bill that give it cause for concern.\n   &#34;Especially when considering how the interception powers under this Bill could be used in tandem with technical capability notices under the controversial Telecommunications and Other Legislation (Assistance and Access) Act,&#34; it wrote.\n Making a recommendation to the PJCIS, Google said the Bill should not apply to service providers in their capacity as infrastructure providers to corporations or government entities, saying corporations or government entities are best placed to produce the requested records themselves.\n  Under the Bill, designated communications providers are instructed to provide any requested communications and data to the requesting agency or the Australian Designated Authority. Google would prefer the authority to be a two-way channel.\n &#34;Respectfully, our experience is that a better approach would be that all communications to and from an Australian law enforcement agency be channelled through the Designated Authority and that this authority acts as a coordinator across multiple agencies,&#34; it wrote.\n &#34;Putting in place a coordinating body will guard against the risk of duplication and will act as a single point of contact for training, education, and access to designated communications providers.&#34;\n  Civil penalties for non-compliance with an IPO establishes a framework for compliance. If a designated communications provider receives a valid IPO and the designated communications provider meets the &#34;enforcement threshold&#34; when the IPO is issued, the designated communications provider must comply with the IPO.\n Google labelled the two-step test that is the threshold, a &#34;relatively low bar to meet&#34;.\n &#34;Failure to comply with an IPO may lead to a civil penalty of up to AU$10 million for body corporates. The imposition of a mandatory obligation to comply with an IPO is contrary to the purpose of the CLOUD Act which is to lift blocking statutes, but explicitly does not create a compulsory obligation on service providers,&#34; it said.\n &#34;The authors of the Bill appear to be aware of this dichotomy as the Bill explicitly asserts that Australian service providers do not have to comply with reciprocal requests from international agencies.&#34;\n Specifically, the search giant said it was concerned by the attempt to impose a mandatory obligation on overseas-based designated communications providers that exists &#34;only in the construct of an otherwise non-compulsory international agreement&#34;.\n &#34;[We] respectfully request that this be amended to reflect the intent of the CLOUD Act, which is that enforcement procedures be found in existing law, and that references to civil penalties be removed,&#34; it wrote.\n Elsewhere, Google is seeking further information about the role that eligible judges will play in approving IPOs that involve the interception of communications.\n  &#34;Deferring to existing appeal mechanisms is not satisfactory given the lack of appropriate merit based appeal processes in other relevant legislation such as the TOLA Act,&#34; it continued.\n &#34;The reliance on existing law as the primary source for appeal procedures is especially problematic … in particular, overseas providers may be subject to other third-country laws, conflicts with which are not and cannot be lifted through the international agreement, yet no option would exist to raise such an impediment to compliance.&#34;\n Google said this would create exactly the type of conflict of laws scenario that the CLOUD Act is designed to prevent.", "posttime": "2020-05-02 18:05:07", "tags": "google,谷歌,希望,australia,法案", "title": "谷歌希望澳大利亚取消云法案准备法案中的民事处罚", "title_en": "Google wants Australia to remove civil penalties from CLOUD Act-readying Bill", "transed": 0, "url": "https://www.zdnet.com/article/google-wants-australia-to-remove-civil-penalties-from-cloud-act-readying-bill/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["google", "谷歌", "希望", "australia", "法案"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000296, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SeaFox根据ESTree AST格式生成AST，可用于JavaScript程序的语法分析(解析)或词法分析(标记化)，在ES2015及更高版本中，JavaScript程序可以是脚本也可以是模块。\nSeafox公开的解析方法接受一个可选的Options对象，该对象允许您指定是以脚本模式(默认)还是以模块模式进行解析。\n{//允许使用Module作为目标符号模块进行分析？：boolean；//启用每个节点的开始和结束偏移以及行/列位置信息的标志loc：false；//禁用web兼容性disableWebCompat：false；//将原始属性附加到每个文字和标识符节点raw的标志：false；//Enabled指令指令：false；//允许在全局作用域globalReturn：false中返回的标志；//启用隐含的严格模式ImpliedStrict的标志。\n从&#39；导入{parseScript，parseModule，parse}。/SeaFox&#39；；parseScript(&#39；({x：[y]=0}=1)&#39；)；parseModule(&#39；({x：[y]=0}=1)&#39；，{指令：true，raw：true})；parse(&#39；({x：[y]=0}=1)&#39；，{。parse(&#39；({x：[y]=0}=1)&#39；)；\n词法分析只能在解析期间完成，并且只接受函数类型作为选项。\n需要为开始和结束启用loc选项。否则，此值将设置为未定义。\nSeaFox是为提高性能和降低内存使用量而开发的，该解析器比所有其他javascript解析器快2倍到4倍。", "note_en": "Seafox generates  AST according to  ESTree AST format, and can be used to perform  syntactic analysis (parsing) or  lexical analysis (tokenization) of a JavaScript program, and with  ES2015 and later a JavaScript program can be either  a script or a module.\n The  parse method exposed by  Seafox takes an optional  options object which allows you to specify whether to parse in   script mode (the default) or in   module mode.\n  {   // Allow parsing using Module as the goal symbol  module ?: boolean;   // The flag to enable start and end offsets and line/column location information to each node loc :  false;   // Disable web compatibility disableWebCompat :  false;   // The flag to attach raw property to each literal and identifier node raw :  false;   // Enabled directives directives :  false;   // The flag to allow return in the global scope globalReturn :  false;   // The flag to enable implied strict mode impliedStrict :  false;  //Enable  ...\n  import {  parseScript,  parseModule,  parse }  from   &#39;./seafox &#39;; parseScript(  &#39;({x: [y] = 0} = 1) &#39;); parseModule(  &#39;({x: [y] = 0} = 1) &#39;, { directives:  true, raw:  true }); parse(  &#39;({x: [y] = 0} = 1) &#39;, { module:  true }); parse(  &#39;({x: [y] = 0} = 1) &#39;);\n  Lexical analysis can only be done during parsing and accepts only a function type as the option\n    The  loc option needs to be enabled for  start and  end. Otherwise this values will be set to  undefined\n  Seafox is developed for performance and low memory usage, and the parser is about 2x - 4x faster than all other javascript parsers.", "posttime": "2020-05-02 18:05:02", "tags": "java,javascript,兼容,compliant,false", "title": "快速的100%规范兼容、自托管的JavaScript解析器", "title_en": "A fast 100% spec compliant, self-hosted JavaScript parser", "transed": 0, "url": "https://github.com/KFlash/seafox", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["java", "兼容", "compliant", "false"]}, {"category": "", "categoryclass": "", "imagename": "4f63cc74c2a0a358ef584f6d6c7340f6.jpg", "infoid": 1000295, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在2017年6月，苹果就推出了“用于VR的金属”，并强调了与Valve的合作伙伴关系。当时，Valve正在推动VR作为平台，并在Vive系统上与HTC合作；快进到2020年，Valve拥有自己的高端耳机，并刚刚发布了备受期待的标题《Half Life：Alyx》。\n几乎没有支持Mac的游戏，甚至苹果最高端的MacBook Pro也达不到Oculus或SteamVR的最低规格要求。正如Upload的人员指出的那样，Valve最近的硬件调查显示，该平台上只有4%的游戏玩家一开始就使用MacOS，这表明相当少的实际游戏玩家甚至符合Mac拥有的VR用户维恩的图表。\n在Mac上构建虚拟现实内容的游戏开发商很可能喜欢在一台机器上开发和测试的能力。当苹果用Mac Pro和iMac Pro等高价设备积极追逐专业人士时，当一个主要的软件平台认为你不值得努力时，这不是一个很好的外观。", "note_en": "Apple   introduced “Metal for VR” back in June 2017 and highlighted a partnership with Valve. At the time, Valve was pushing VR as a platform and working with HTC on its Vive system; fast-forward to 2020 and Valve has its own high-end headset and has just released its highly-anticipated title “Half Life: Alyx.”\n   Almost no games supported Mac, and even Apple’s highest-end MacBook Pros failed to meet minimum specification requirements for Oculus or SteamVR.  As the folks at  Upload  point out, Valve’s recent  hardware survey  showcases that just 4% of gamers on the platform use macOS to begin with, suggesting a pretty small sliver of actual gamers even fit in the Mac-owning VR user Venn diagram.\n Game developers building VR content on Mac likely enjoyed the ability to develop and test on a single machine. As Apple aggressively chases professionals with high-priced gear like the Mac Pro and iMac Pro, it’s not a great look when a major software platform decides you’re not worth the effort.", "posttime": "2020-05-02 18:04:58", "tags": "mac,macos,drops,游戏,vr", "title": "Value放弃对MacOS的VR支持", "title_en": "Valve drops VR support for macOS", "transed": 0, "url": "https://techcrunch.com/2020/05/01/valve-drops-vr-support-for-macos/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["mac", "macos", "drops", "游戏", "vr"]}, {"category": "", "categoryclass": "", "imagename": "9376556faae6ced37ae727378989fa3d.png", "infoid": 1000294, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在上一篇文章中，我们已经了解了如何可视化时间序列数据。在这篇文章中，我们将讨论如何使用ARMA和ARIMA模型进行时间序列建模。这里AR代表自回归，MA代表移动平均。\n在我们开始讨论ARIMA模型之前，我们应该了解时间序列的平稳性。\n如果观测值的均值、方差和协方差在一段时间内没有变化，则称时间序列为平稳序列。\n换言之，如果观测值的联合分布不变，并且当时间起点偏移k个量时保持不变，则称一个过程是平稳的。\n这意味着均值和方差是恒定的，不依赖于时间。平稳过程有两种类型：严格平稳过程和弱平稳过程。\nARIMA是自回归综合移动平均模型的缩写，是目前应用最广泛的时间序列预测模型之一。\n它还解释了连续时间点之间数据或噪声的增长/下降模式。\n将ARIMA应用于具有非平稳性的数据，并采用连续观测的差值来消除非平稳性。有时需要多次连续观测的差异才能得到修正的平稳模型。\n这就是它被称为集成模型的原因，因为拟合到修改后的序列的平稳模型必须求和或积分，以提供原始非平稳序列的模型。\n我们应该将ARIMA模型拟合到平稳和非季节性的时间序列数据，并遵循上面流程图中描述的过程。\n首先，您应该绘制数据图表，以发现隐藏的模式、趋势和其他行为。\n要稳定和规格化数据，可以使用Box-Cox变换。这是一种变换通常不服从正态分布的数据的方法。\n绘制ACF/PACF以确定ARIMA模型的顺序，即p、d和q值。或者，您也可以使用AICC和BICC来确定p、q、d值。选择AICC和BICC最低的。\n验证残差并确保它看起来像白噪声，否则请尝试使用不同p、q和d值的修改后的模型。请记住，白噪声的残差可以进行预测。\n我们将使用阿莫里市的月度温度数据集。您可以从此链接下载。\n将熊猫作为snssns.set(rc={&#39；figure.figsize&#39；：(15，6)})%matplotlib inlinedf=pd.read_csv(&#39；./monthly_temperature_aomori_city.csv&#39；)df[&#39；DATE&#39；]=pd.to_DateTime(DF[[&#39；Year&#39；，&#39；month&#39；]].assign(DAY=1))df.drop([&#39；]，smimport matplotlib.pylot作为pltimport海运)导入pdimport statsmods.api。年&#39；，&#39；月&#39；]，位置=真，轴=1)df[&#39；温度&#39；]=df[&#39；temperature&#39；]*(9/5)+32df.set_index(&#39；DATE&#39；，inplace=True)df.to_csv(&#39；./monthly_temperature_aomori_city_updt.csv&#39；，索引=真)df.head()。\n让我们为前200行画一张简单的线条图，以了解数据中的模式以及温度是如何趋势的。看起来这里遵循的是一种循环模式。\n我们将绘制前5年的盒子和胡须图，以了解数据分布，并快速获得数据的五点汇总。\n如果您正在寻找有关时间序列分析和可视化的深入教程，可以查看此博客，它是此时间序列分析博客的第1部分。\n为了进一步分析时间序列数据，分解有助于去除数据的季节性。\n基本上，分解有三个组成部分，如下图所示，即趋势、季节性和残差。\n您必须选择一种模型类型，也可以是加法或乘法。我们采用了加法模型，因为季节性从开始到结束变化不大。\nARIMA模型对非平稳数据的处理效果更好，我们首先要检查的是数据的平稳性。增广的Dickey-Fuller检验可以用来检验序列是非平稳的零假设。\nADF检验有助于理解Y的变化是否是线性趋势。如果存在线性趋势，但滞后值不能解释Y随时间的变化，则我们的数据将被认为是非平稳的。\n从statsmods.tsa.stattools导入adfullerdef check_stantality(TimeSeries)：result=adfuller(timeSeries，autolag=&#39；AIC&#39；)dfoutput=pd.Series(result[0：4]，index=[&#39；Test Statistics&#39；，&#39；p-value&#39；，&#39；#LAGS Used&#39；，&#39；；##39；，&#39；]。p-值：%f&#39；%Result[1])为键打印(&#39；临界值：&#39；)，结果[4]中的值。Items()：打印(&#39；\\t%s：%.3f&#39；%(键，值))。\n检验统计量的值小于5%的临界值，p值也小于0.05，因此我们可以拒绝零假设和时间序列平稳的交替假设似乎是正确的。\n", "note_en": "In the previous  post we have seen how to visualize a time series data. In this post we will discuss how to do a time series modelling using ARMA and ARIMA models. Here AR stands for Auto-Regressive and MA stands for Moving Average\n Before we start discussing the ARIMA models, we should know the stationarity of time series\n  A time series is called to be stationary if there is no change in mean, variance and covariance of the observations over a period of time.\n  In other words a process is said to be stationary if the joint distribution of observations does not change and remain same when the origin of time is shifted by amount k\n This means that the mean and variance are constant and do not depend on time. There are two types of stationary processes: Strict &amp; Weak Stationary Process\n      ARIMA stands for Auto-Regressive Integrated Moving Average and it’s one of the widely used time series models for forecasting\n It also accounts for the pattern of growth/decline in the data or noise between consecutive time points\n ARIMA are applied to data that shows Non-Stationarity and difference of successive observations are taken to eliminate the non-stationarity. Sometimes more than one difference of successive observation is required to get a modified stationary model\n That’s the reason it is called as an Integrated model because the stationary model that is fitted to the modified series has to be summed or integrated to provide a model for the original non-stationary series\n   We should be fitting the ARIMA model to a Stationary and non-seasonal time series data and follow the procedure described in the above flow chart\n First thing is you should plot the data to find hidden patterns, trends and other behavior\n  To stabilize and normalize the data you can use the Box-Cox transformation. It is a way to transform data that ordinarily do not follow a normal distribution\n Plot ACF/PACF to determine the order for the ARIMA model i.e. p,d and q values. Alternatively, you can also use AICc and BICc to determine the p,q,d values. Choose the one where AICc and BICc is lowest\n Verify the Residuals and ensure it looks like white noise otherwise try a modified model with different values of p,q and d. Remember Residuals which are white noise can do a forecast\n   We will be using the Monthly Temperature datatset of Armori City. You can download it from this  link\n  import pandas as pdimport statsmodels.api as smimport matplotlib.pyplot as pltimport seaborn as snssns.set(rc={&#39;figure.figsize&#39;:(15,6)})%matplotlib inlinedf = pd.read_csv(&#39;./monthly_temperature_aomori_city.csv&#39;)df[&#39;DATE&#39;] = pd.to_datetime(df[[&#39;year&#39;, &#39;month&#39;]].assign(DAY=1))df.drop([&#39;year&#39;,&#39;month&#39;],inplace=True,axis=1)df[&#39;temperature&#39;] = df[&#39;temperature&#39;]*(9/5)+32df.set_index(&#39;DATE&#39;,inplace=True)df.to_csv(&#39;./monthly_temperature_aomori_city_updt.csv&#39;,index=True)df.head()\n   Let’s draw a simple line plot for first 200 rows to understand the pattern in the data and how the temperature is trending. It looks like that a Cyclic pattern is followed here\n    We will draw a Box and Whisker plot for first 5 years to understand the data distribution and get a quick five point summary for the data\n    If you are looking for in-depth tutorial on Time Series Analysis and Visualization you can check  this blog, which is part 1 of this time series analysis blogs\n  To further analyze the time series data, Decomposition helps to remove the seasonality from the data.\n Basically Decomposition has three components that is shown in the graphs below i.e Trend, Seasonality and Residual\n You have to choose a model type also additive or multiplicative. We have taken an additive model because the seasonality doesn’t varies much from start to end of the years\n          ARIMA model works better on a Non-Stationary data and the first thing that we should be checking is the Stationarity of the data. The Augmented Dickey-Fuller test can be used to test the null hypothesis that the series is non-stationary\n The ADF test helps to understand whether a change in Y is a linear trend or not. If there is a linear trend but the lagged value cannot explain the change in Y over time, then our data will be deemed non-stationary\n  from statsmodels.tsa.stattools import adfullerdef check_stationarity(timeseries): result = adfuller(timeseries,autolag=&#39;AIC&#39;) dfoutput = pd.Series(result[0:4], index=[&#39;Test Statistic&#39;,&#39;p-value&#39;,&#39;#Lags Used&#39;,&#39;Number of Observations Used&#39;]) print(&#39;The test statistic: %f&#39; % result[0]) print(&#39;p-value: %f&#39; % result[1]) print(&#39;Critical Values:&#39;) for key, value in result[4].items(): print(&#39;\\t%s: %.3f&#39; % (key, value))\n   The value of test statistics is less than 5% critical value and p-value is also less than 0.05 so we can reject the null hypothesis and Alternate Hypothesis that time series is Stationary seems to be true\n   There is nothing unusual about the time plot and there appears to be no need to do any data adjustments. There is no evidence of changing variance also so we will not do a Box-Cox transformation.\n  So what does model order of ARIMA(2,1,3) means? It means 2nd order Auto-Regressive (AR) and 3rd order Moving Average (MA). You can think it as ARIMA( AR(p), I(d), MA(q))\n So the d is Integrated I(d) part that is decided based on number of times you have to do a data difference to make it stationary. We will learn more about it in the next section\n  For Moving Average order i.e. q you have to look at the Auto Correlation Factor(ACF) graph. You need some experience to keenly look at the graphs and significant lags and corresponding Correlations to determine the value\n Similarly for the Auto-Regressive order i.e. p you have to look at the partial correlation factor (pacf) graph\n Another Alternate way is to find the set of models with the lowest AIC values Akaike’s Information Criterion\n For determining AIC you have to fit the model with different combination of p,q and d and look for the lowest AIC value\n  Our Data is stationary but just to showcase how data differencing works we will assume that our Time Series data is not Stationary\n We will also do a log transform of the original data to make the seasonality same throughout the data\n   So Basically you have to subtract the value with their previous value to get the difference in data. We will use numpy.diff() function to achieve that\n    The differenced data looks stationary so we don’t have to go for any further differencing\n Again, After our first data differencing we will check the stationarity of data using the ADF test.\n This time the p-value is 0 which is very good and the test statistics is also less than the 5% critical\n     The value of d will be 1 because we have done the data difference one time to achieve stationarity\n  Once our data is set to stationary then the next task is to determine the appropriate value of ARIMA model i.e. p and q\n We can learn some important properties of our time series data with the help of Auto Correlation(ACF) and Partial Auto Correlation (PACF) graphs.\n This provide useful descriptive properties for understanding which model can be used for time series forecasting\n  In other words, ACF is used to understand if there exists a correlation between a time series data point with another point as a function of their time difference\n The Partial Auto Correlation factor(PACF) is the partial correlation between the two points at a specific lag of time.\n Plotting the partial autocorrelative functions one could determine the appropriate lags  p in an AR ( p) model or in an extended ARIMA ( p, d, q) model\n       From the PACF plot we can see a significant correlation at lag of 2. So the PACF suggests an AR(2) model. So an inital order for the model will be (2,0,3)\n  Alternatively, you can also use auto arima to find the appropriate value of p,q and d\n  So if you want to know the value of p,q and d without much of pain then use  Auto arima.\n It’s a python library inspired from the auto arima package in R which is used to find the best fit ARIMA model for the univariate time series data\n  import pyramid as pmauto_arima_fit = pm.auto_arima(df, start_p=1, start_q=1, max_p=3, max_q=3, m=12, start_P=0, seasonal=True, d=1, D=1, trace=True, error_action=&#39;ignore&#39;, suppress_warnings=True, stepwise=True)\n  Fit ARIMA: order=(1, 1, 1) seasonal_order=(0, 1, 1, 12); AIC=7044.189, BIC=7071.210, Fit time=29.769 secondsFit ARIMA: order=(0, 1, 0) seasonal_order=(0, 1, 0, 12); AIC=8721.729, BIC=8732.538, Fit time=0.218 secondsFit ARIMA: order=(1, 1, 0) seasonal_order=(1, 1, 0, 12); AIC=8072.542, BIC=8094.159, Fit time=5.261 seconds\n This will help to choose the best value of p,q and d based on the lowest AIC and BIC values\n  Now we have to fit our data to the ARIMA using the order of model (2,0,3) determined above using ACF and PACF plot.\n This sets the lag value to 2 for autoregression AR(2) and uses a data difference order of 0 since our time series is stationary, and uses a moving average model of 3.\n     A model residuals is difference between the predicted and expected value and can be verified using the fitted model property resid().\n Residual object is of type ndarray so we will store it in a Dataframe for plotting\n In the below line plot we don’t see any large residuals and all of them are within their upper and lower limits\n    Next we will check if these residuals are normally distributed and looks Gaussian or not. So we will plot the density plot to check this. This looks normal with a long left tail and centered at Zero\n    The mean of the residual is close to Zero and there is no significant correlation also that we can see in the pacf plot for residuals\n       The residual diagnostics looks like a white noise since 95% of our sample autocorrelations is between the two blue lines and it meets all our criteria for a good forecast and prediction.\n    Predict function takes a start and end parameters to specify the index at which to start and stop the prediction\n We could have done it another way also by splitting the train and test data and then comparing the test values with the predicted values\n In our case we want to validate the predicted and expected value of first three years 1882-1885. so we will give a start value of 0 and end value of 36 and that will return an ndarray of predicted values\n  Using this returned value and the original value we will plot this and visualize how the predicted and real values differ. The red lines in the graph are original values and green are predicted values\n     This looks good so far but how to quantify how the score of predicted vs Expected values. For this we will calculate the Root Mean Square Error values using Scipy\n      Next and Final Step to forecast the temperature of upcoming years i.e. Out of Sample Forecast. We will use the forecast method of statsmodel for this task.\n You can pass steps as one of the parameter i.e. number of out of sample forecasts from the end of the sample\n    We are forecasting the temperature for next 3 years i.e. 36 months so our steps will be 36 and for a confidence interval of 95% we will pass the alpha value as 0.05\n      It is stored in a variable ci above and this is how the interval value looks like\n    Now we will plot the forecast value which is shown as red line for year 2020 thru 2023 in the below graph.\n The blue strip that you see around the line is the forecast interval which is drawn with the help of fill_between() api of matplotlib\n      Time Series Data Visualization is an important step to understand for analysis &amp; forecasting and finding out the patterns in data\n Dickey-Fuller test performed to determine if the data is stationary or not. It’s necessary to check the stationarity before fitting the data to ARIMA\n Decomposition helps to remove the seasonality from the data and three components of decomposition are Trend, Seasonality and Residual\n Data differencing helps to remove stationarity from data and to determine the value of d\n Plot Auto-Correlation(ACF) and Partial Auto-Correlation (PACF) graph to determine the value of p and q\n Auto Arima package used to determine the value of p,q and d by evaluating the value of Akaike’s Information Criterion (AIC)\n Residual diagnosis is an important step post fitting the ARIMA model to evaluate if forecasting can be done with the fitted model or not\n Residual property of ARIMAResult object used for the Residual Analysis. If the residual is a white noise then we are good and ready for forecasting\n  There are few topics which I have not explained in detail like Additive and Multiplicative Model, Determine the p,q value by reading the ACF and PACF plot and using SARIMAX function for time series data with seasonality. So I would be covering those topics separately in my upcoming posts\n Facebook has an open source tool  Prophet for forecasting time series data and in my next post I will be using prophet to evaluate and compare the forecasting results with python statsmodel", "posttime": "2020-05-02 18:04:55", "tags": "教程,序列,tutorial,数据,data", "title": "时间序列建模和预测综合教程", "title_en": "Comprehensive Tutorial on Time Series Modelling and Forecasting", "transed": 0, "url": "https://kanoki.org/2020/04/30/time-series-analysis-and-forecasting-with-arima-python/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["教程", "序列", "tutorial", "数据", "data"]}, {"category": "", "categoryclass": "", "imagename": "746acbdc70aec3fcdc4dc47d15aefc90.jpg", "infoid": 1000293, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对抗复杂性是软件开发的一个反复出现的主题，我已经看到它一次又一次地重复自己。这是我一直看到的在各个层次上都在争论的事情：函数和方法应该进行多少评论？理想的抽象量是多少？一个框架什么时候开始有太多的魔力？一个组织中什么时候会有太多的语言？\n我们试图摆脱复杂性，控制它，追求简单。我认为这样框定事情是被误导的。复杂性必然存在于某个地方。\n弹性工程学教会我的一件事是控制论中的必备多样性的概念：只有复杂性才能处理复杂性。\n如果您使构建工具变得简单，它将无法处理存在的所有奇怪的边缘情况。\n如果您想要处理奇怪的边缘情况，您需要偏离您想要建立的任何规范。\n如果您希望通用默认设置易于使用，则通用默认设置的规则必须在工具和用户之间共享，这些用户会根据工具的期望来调整自己的系统。\n如果您允许配置或编写脚本，则为用户提供了一种指定必须共享的规则的方法，以便该工具适合他们的系统。\n如果要使工具保持简单，则必须强制用户仅在符合此简单性的参数范围内进行操作。\n如果您的用户用例不能很好地与您的简单性相匹配，他们将围绕您的工具构建填隙程序以实现其目标。\n这是无法避免的。复杂性必然存在于某个地方。不管你是否意识到，它总是人们解决问题的一部分。\n不幸的是，如果我们到了清单的最后一点(我们总是以某种方式做到这一点)，垫片就会成为风景的一部分。复杂性不会潜伏。这是每个人学习经历的一部分，他们会适应它。\n他们绕过它，看到两个相互冲突的概念之间的不匹配。这种必要的复杂性可能会移动-回到工具(或新工具)-或者通过重新组织事物来消除。每一次这样的改变都需要付出努力，需要更多的调整，人们需要看到复杂性，理解复杂性，处理复杂性。在某些情况下，变化不会简化事情，它们会通过在不同人的假设之间创造新的不匹配而使事情复杂化，这将…。\n在“日常事物的设计”中，唐·诺曼提到了头脑中的知识和世界中的知识的概念(类似的概念在Roesler&amp；Woods&39；Design for Experts一书中更具学术性)。头脑中的知识是你知道的、你学到的、存在于你记忆中的东西。世界上的知识就是一切：记录下来的信息，设计中的提示(你通过看它的符号就知道电源按钮，你知道它可以……。\n在某些方面，专业知识就是在你的头脑中拥有让你更好地阅读世界的知识。\n我们在软件设计中遇到的一个常见陷阱来自于关注我们发现它是如何阅读和解释给定的代码片段的。专注于简单性充满了危险，因为复杂性是无法消除的：它只能四处移动。如果您将其移出您的代码，它会去哪里？\n当我们设计Rebar3时，我们觉得这个工具可以很简单。其简单性的条件是您对Erlang/OTP项目的预期结构有一个基本的了解。只要你遵循这些规则，事情就会进展顺利。我们将一些复杂性外化到更广泛的生态系统中。规则总是需要学习的(我们是这样假设的)，但是工具现在依赖于对它们的理解。在为了解规则的人简化工具使用的过程中，我们使……。\n这种陷阱在软件体系结构中是隐蔽的。当我们采用像微服务这样的东西时，我们会努力使每项服务都是单独简单的。但是，除非这种简单性太过束缚，以至于您的实际应用程序继承了它并被迫变得简单，否则它仍然必须去某个地方。如果它不在单个的微服务中，那么它在哪里？\n复杂性必然存在于某个地方。如果你幸运的话，它生活在定义明确的地方。在您决定稍微复杂的代码中，在支持代码的文档中，在工程师的培训课程中。你给它一个地方，而不是试图把它全部藏起来。你可以创造方法来管理它。当你需要它的时候，你知道去哪里见它。如果你不走运，只是试图假装复杂性可以完全避免，那么它在这个世界上就无处可去了。..。\n在无处可去的情况下，它不得不在您的系统中到处漫游，无论是在您的代码中，还是在人们的头脑中。随着人们四处转移和离开，我们对它的理解也会受到侵蚀。\n复杂性必然存在于某个地方。如果你拥抱它，给它应有的位置，在知道它存在的情况下设计你的系统和组织，并专注于适应，它可能只会成为一种压力。", "note_en": "Fighting complexity is a recurring theme of software development I&#39;ve seen repeat itself over and over again. It&#39;s something I keep seeing debated at all levels: just how much commenting should go on in functions and methods? What&#39;s the ideal amount of abstraction? When does a framework start having &#34;too much magic&#34;? When are there too many languages in an organisation?\n We try to get rid of the complexity, control it, and seek simplicity. I think framing things that way is misguided. Complexity has to live somewhere.\n One thing Resilience Engineering has taught me is the concept of  Requisite Variety from cybernetics: only complexity can handle complexity.\n  if you make the build tool simple, it won&#39;t handle all the weird edge cases that exist out there\n if you want to handle the weird edge cases, you need to deviate from whatever norm you wanted to establish\n if you want ease of use for common defaults, the rules for common defaults must be shared between the tool and the users, who shape their systems to fit the tool&#39;s expectations\n if you allow configuration or scripting, you give the users a way to specify the rules that must be shared, so the tool fits their systems\n if you want to keep the tool simple, you have to force your users to only play within the parameters that fit this simplicity\n if your users&#39; use cases don&#39;t map well to your simplicity, they will build shims around your tool to attain their objectives\n This cannot be avoided. Complexity  has to live somewhere. It&#39;s always a part of people solving problems, whether you realize it or not.\n Unfortunately, if we make it to the last point of the list (we always do in some way), the shims become part of the landscape. Complexity doesn&#39;t lay dormant. It is part of everyone&#39;s learning experience, and they adapt to it.\n They work around it, see the mismatch between two clashing concepts. That necessary complexity may move around —back into the tool (or a new tool) —or be removed by re-structuring things. Each such change requires an effort and more adjustments, and for people to see the complexity, understand the complexity, and tackle the complexity. And in some cases, changes will not simplify things, they will complexify them by creating new mismatches between assumptions various people had, which will  ...\n In   The Design of Everyday Things, Don Norman mentions the concept of &#34;Knowledge in the head&#34; and &#34;knowledge in the world&#34; (similar concepts are more academically presented in Roesler &amp; Woods&#39;   Designing for Expertise). Knowledge in the head are things you know, that you have learned, that are in your memory. Knowledge in the world is everything else: information written down, cues in design (you know the power button by looking at its symbol, and you know it can  ...\n In some ways, expertise is having knowledge in your head that allows you to better read the world.\n  A common trap we have in software design comes from focusing on how &#34;simple&#34; we find it to read and interpret a given piece of code. Focusing on simplicity is fraught with peril because complexity can&#39;t be removed: it can just be shifted around. If you move it out of your code, where does it go?\n When we designed Rebar3, we felt the tool could be simple. The condition for its simplicity is that you have a basic understanding of the expected structure of Erlang/OTP projects. As long as you follow these rules, things will go well. We externalized some of the complexity into the broader ecosystem. The rules always needed to be learned (so we assumed), but the tool now depended on them being understood. In simplifying tool usage for people who knew the rules, we made it harder for  ...\n The trap is insidious in software architecture. When we adopt something like microservices, we try to make it so that each service is individually simple. But unless this simplicity is so constraining that your actual application inherits it and is forced into simplicity, it still has to go somewhere. If it&#39;s not in the individual microservices, then where is it?\n Complexity has to live  somewhere. If you are lucky, it lives in well-defined places. In code where you decided a bit of complexity should go, in documentation that supports the code, in training sessions for your engineers. You give it a place without trying to hide all of it. You create ways to manage it. You know where to go to meet it when you need it. If you&#39;re unlucky and you just tried to pretend complexity could be avoided altogether, it has no place to go in this world.  ...\n With nowhere to go, it has to roam everywhere in your system, both in your code and in people&#39;s heads. And as people shift around and leave, our understanding of it erodes.\n Complexity has to live somewhere. If you embrace it, give it the place it deserves, design your system and organisation knowing it exists, and focus on adapting, it might just become a strength.", "posttime": "2020-05-02 18:04:51", "tags": "存在,complexity,复杂性", "title": "复杂性必须存在于某个地方", "title_en": "Complexity Has to Live Somewhere", "transed": 0, "url": "https://ferd.ca/complexity-has-to-live-somewhere.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["存在", "复杂性"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000292, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "昨天苹果发布了iOS13.5Beta3(似乎将iOS13.4.5重新命名为13.5)，这杀死了我的一个bug。不过，这不是一个普通的错误，这是我发现的第一个0day。而且这可能也是最好的一次。不一定是因为它给了你多少，但肯定是因为我用了它多少，也因为它有多么简单。事实上，如此简单，以至于我在推特上发布的PoC看起来绝对是一个笑话。但这是100%真实的。\n我称它为“通灵纸”是因为，就像“神秘博士”喜欢携带的那个名字的物品一样，它可以让你通过安检，让别人相信你有很多你不应该拥有的证件。\n与几乎任何其他bug和我不得不处理的任何其他漏洞相比，这个错误在没有任何iOS和/或漏洞背景知识的情况下应该是可以理解的。本着这种精神，我也将尝试以一种没有iOS或利用特定知识的方式来撰写这篇文章。不过，我确实希望您大致了解什么是XML、公钥加密和哈希，理解C代码当然是一个很大的优势。\n所以，系好安全带，我大胆地说，这是iOS上迄今为止最强大的沙盒逃逸的最优雅的漏洞。：P。\n基本概念是&lt；tag&gt；打开一个标记，&lt；/tag&gt；关闭它，然后在其间插入内容。这些内容可以是原始文本，也可以是更多标签。空标记可以是自动关闭的，如&lt；tag/&gt；，它们还可以具有a=&#34；b&#34；以及yada yada等属性。上述文件中有三项内容超出了基本标记的范围：\n&lt；？.？&gt；-以问号开头和结尾的标签，即所谓的“处理指令”，会受到特殊处理。\n&lt；！DOCTYPE.&gt；-以！DOCTYPE开头的标记是“文档类型声明”，也会被特殊处理。\n&lt；！-&gt；-以&lt；！--开头和--&gt；结尾的标记是注释，它们加上其内容将被忽略。\n完整的XML规范包含更多内容，但是a)这与我们无关，b)任何人都不应该被强迫阅读。现在，XML很难解析，原因是这篇XKCD很好地说明了这一点：\n因此，您可以构造&lt；mis&gt；matching&lt；/tag&gt；，&lt；属性，这些属性永远不会关闭&gt；，甚至是永远不会关闭的&lt；标记，也可能是这样的标记：&lt；！&gt；，列表就是不会结束。这使得XML成为一种极难正确解析的格式，这一点很快就会变得重要起来。\n现在，在XML的基础上，我们有了“属性列表”，或简称为“plist”：另一种用于存储序列化数据的通用格式。你有数组、带有键-值对的字典、字符串、数字等等。plist文件有一堆不同的形式，但在苹果生态系统中，你会实际看到的只有两种：“bplist”二进制格式和基于XML的格式，这两种格式超出了本文的讨论范围。有效的XML plist可能如下所示：\n&lt；？xml version=&#34；UTF-8&#34；？&gt；&lt；！DOCTYPE plist public&#34；-//APPLIST//dtd plist 1.0//en&#34；&#34；http://www.apple.com/DTDs/PropertyList-1.0.dtd&#34；&gt；&lt；plist version=&#34；1.0&#34；&gt；&lt；dict&&gt;；&lt；key&gt；操作系统内部版本&lt；/key&gt；&lt；string&gt；19D76&lt；/string&gt；IOConsoleLocked&lt；/key&gt；&lt；false/&gt；&lt；！--abc--&gt；&lt；key&gt；IOConsoleUsers&lt；/key&gt；&lt；array&gt；&lt；\nPLIST文件在整个iOS和MacOS中都用于配置文件、软件包属性，最后但并非最不重要的是作为代码签名的一部分。\n所以：代码签名。当二进制文件想要在iOS上运行时，名为AppleMobileFileIntegrity(或“AMFI”)的内核扩展要求它具有有效的代码签名，否则它将被当场杀死。这个代码签名是什么样子对我们来说并不重要，重要的是它是由散列和标识的。此哈希可以通过以下两种方式之一进行验证：\n它可以提前为内核所知，这就是所谓的“临时(ad-hoc)”签名。它用于iOS系统应用程序和守护进程，并且直接根据内核中的已知散列集合检查散列。\n它需要使用有效的代码签名证书进行签名。这适用于所有第三方应用程序，在此场景中，AMFI会调用userland守护进程amfid，让它运行所有必要的检查。\nApp Store证书。这只由苹果自己持有，为了以这种方式签名，你的应用程序需要通过App Store的审查。\n开发者证书。这可以是免费的“7天”证书、“常规”开发人员证书或企业分发证书。\n在后一种情况下，有问题的应用程序还需要“配置配置文件”，即Xcode(或某些第三方软件)可以为您获取的文件，该文件需要放在Payload/Your.app/embedded.mobil的App.ipa包中", "note_en": "Yesterday Apple released iOS 13.5 beta 3 (seemingly renaming iOS 13.4.5 to 13.5 there), and that killed one of my bugs. It wasn’t just any bug though, it was the first 0day I had ever found. And it was probably also the best one. Not necessarily for how much it gives you, but certainly for how much I’ve used it for, and also for how ridiculously simple it is. So simple, in fact, that  the PoC I tweeted out looks like an absolute joke. But it’s 100% real.\n I dubbed it “psychic paper” because, just like  the item by that name that Doctor Who likes to carry, it allows you get past security checks and make others believe you have a wide range of credentials that you shouldn’t have.\n In contrast to virtually any other bug and any other exploit I’ve had to do with, this one should be understandable without any background knowledge in iOS and/or exploitation. In that spirit, I’ll also try and write this post in a manner that assumes no iOS- or exploitation-specific knowledge. I do expect you however to loosely know what XML, public key encryption and hashes are, and understanding C code is certainly a big advantage.\n So strap in for the story of what I’ll boldly claim to be the most elegant exploit for the most powerful sandbox escape on iOS yet. :P\n     The basic concept is that  &lt;tag&gt; opens a tag,  &lt;/tag&gt; closes it, and stuff goes in between. That stuff can be either raw text or more tags. Empty tags can be self-closing like  &lt;tag/&gt;, and they can have attributes like  a=&#34;b&#34; as well, yada yada. There’s three things in the above file that go beyond just basic tags:\n &lt;?...?&gt; - Tags starting and ending with question marks, so-called “processing instructions”, are treated specially.\n  &lt;!DOCTYPE ...&gt; - Tags starting with  !DOCTYPE are, well, “document type declarations” and are treated specially as well.\n  &lt;!-- --&gt; - Tags starting with  &lt;!-- and ending with  --&gt; are comments, and they plus their contents are ignored.\n The full XML specification contains  a lot more, but a) that’s irrelevant to us, and b) nobody should ever be forced to read that. Now, XML is horrible to parse for reasons this XKCD illustrates beautifully:\n  So yeah, you can construct  &lt;mis&gt;matched&lt;/tags&gt;,  &lt;attributes that=&#34;are never closed&gt;, even  &lt;tags that are never closed, maybe a tag like this:  &lt;!&gt;, the list simply doesn’t end. This makes XML a format that’s excruciatingly hard to parse correctly, which will become relevant in a bit.\n Now building on XML, we have “property list”, or “plist” for short: yet another general-purpose format for storing serialised data. You have arrays, dictionaries with key -&gt; value pairs, strings, numbers, etc. Plist files exist in a bunch of different forms, but the only two that you’ll realistically see in an Apple ecosystem are the “bplist” binary format that are out of scope for this post, and the XML-based format. A valid XML plist can look something like this:\n &lt;?xml version=&#34;1.0&#34; encoding=&#34;UTF-8&#34;?&gt; &lt;!DOCTYPE plist PUBLIC &#34;-//Apple//DTD PLIST 1.0//EN&#34; &#34;http://www.apple.com/DTDs/PropertyList-1.0.dtd&#34;&gt; &lt;plist  version= &#34;1.0&#34; &gt; &lt;dict&gt;  &lt;key&gt;OS Build Version &lt;/key&gt;  &lt;string&gt;19D76 &lt;/string&gt;  &lt;key&gt;IOConsoleLocked &lt;/key&gt;  &lt;false/&gt;  &lt;!-- abc --&gt;  &lt;key&gt;IOConsoleUsers &lt;/key&gt;  &lt;array&gt;  &lt;dict&gt;  &lt;key&gt;kCGSSessionUserIDKey &lt;/key&gt;  &lt;integer&gt;  ...\n Plist files are used all throughout iOS and macOS for configuration files, package properties, and last but not least as part of code signatures.\n So: code signatures. When a binary wants to run on iOS, a kernel extension called AppleMobileFileIntegrity (or “AMFI”) requires it to have a valid code signature, or else it will be killed on the spot. What this code signature looks like isn’t important for us, all that matters is that it is identified by a hashsum. This hash can be validated in one of two ways:\n It can be known to the kernel ahead of time, which is called an “ad-hoc” signature. This is used for iOS system apps and daemons, and the hash is simply checked against a collection of known hashes directly in the kernel.\n  It needs to be signed with a valid code signing certificate. This is used for all 3rd party apps, and in this scenario, AMFI calls out to the userland daemon  amfid to have it run all the necessary checks.\n  The App Store certificate. This is held only by Apple themselves and in order to get signed this way, your app needs to pass the App Store review.\n  Developer certificates. This can be the free “7-day” certificates, “regular” developer certificate, or enterprise distribution certificates.\n In the latter case, the app in question will also require a “provisioning profile”, a file that Xcode (or some 3rd party software) can fetch for you, and that needs to be placed in your  App.ipa bundle at  Payload/Your.app/embedded.mobileprovision. This file is signed by Apple themselves, and specifies the duration, the list of devices, and the developer accounts it is valid for, as well as all the restrictions that should apply to the app.\n  In a standard UNIX environment, pretty much the only security boundaries you get are UID checks. Processes of one UID can ’t access resources of another UID, and any resource deemed “privileged ”requires UID 0, i.e. “root ”. iOS and macOS still use that, but also introduce the concept of “entitlements ”. In layman ’s terms, entitlements are a list of properties and/or privileges that should be applied to your binary. If present, they are embedded in the code signature of your binary,  ...\n  This would mean that the binary in question “holds the  task_for_pid-allow entitlement”, which in this specific case means is allowed to use the  task_for_pid() mach trap, which is otherwise not allowed at all (at least on iOS). Such entitlements are checked all throughout iOS and macOS and there’s well upwards of a thousand different ones in existence (Jonathan Levin has built  a big catalogue of all the ones he could find, if you ’re curious). The important thing is just that all  ...\n This presents an interesting problem. With iOS system apps and daemons, Apple is the one signing them, so they wouldn ’t put any entitlements on there that they don ’t want the binaries to have. The same goes for App Store apps, where Apple is the one creating the final signature. But with developer certificates, the signature on the binary is created by the developers themselves, and Apple merely signs the provisioning profile. This means that the provisioning profile must create  ...\n  Compared to the over-1000 entitlements in existence, this list is extremely short, with the only two functional entitlements being  keychain-access-groups (related to credentials) and  get-task-allow (allowing your app to be debugged). Not a whole lot to work with.\n  Back in fall 2016  I wrote my first kernel exploit, which was based on the infamous “Pegasus vulnerabilities”. Those were memory corruptions in the XNU kernel in a function called  OSUnserializeBinary, which is a subordinate of another function called  OSUnserializeXML. These two functions are used to parse not exactly XML data, but rather plist data - they are  the way of parsing plist data in the kernel. Now given the vulnerabilities I had just written an exploit for, and the still  ...\n At the same time, I was in the process of figuring out how to build an iOS app without Xcode. Partly because I wanted to understand what’s really going on under the hood, and partly because I just hate GUIs for development, especially when you Google how to do something, and the answer is a series of 17 “click here and there”s that are no longer valid because all the GUI stuff moved somewhere else in the last update. So I was getting a provisioning profile via Xcode every 7 days,  ...\n It was this combination, as well as probably a good portion of dumb luck that made me discover the following bug, and excitedly tweet about it:\n    In an informal sense, it’s clear what it means for a binary to hold an entitlement. But how do you  formally specify that? What would code look like that takes as input a process handle and an entitlement name and just returned a boolean saying whether the process does or does not have that entitlement? Luckily for us, XNU has precisely such a function in   iokit/bsddev/IOKitBSDInit.cpp:\n extern  &#34;C&#34;  boolean_t IOTaskHasEntitlement ( task_t  task ,  const  char  *  entitlement ) {  OSObject  *  obj ;  obj  =  IOUserClient :: copyClientEntitlement ( task ,  entitlement );  if  ( ! obj )  {  return  false ;  }  obj -&gt; release ();  return  obj  !=  kOSBooleanFalse ; }\n The lion’s share of the work here is done by these two functions though, from   iokit/Kernel/IOUserClient.cpp:\n OSDictionary *  IOUserClient :: copyClientEntitlements ( task_t  task ) { #define MAX_ENTITLEMENTS_LEN (128 * 1024)  proc_t  p  =  NULL ;  pid_t  pid  =  0 ;  size_t  len  =  0 ;  void  * entitlements_blob  =  NULL ;  char  * entitlements_data  =  NULL ;  OSObject  * entitlements_obj  =  NULL ;  OSDictionary  * entitlements  =  NULL ;  OSString  * errorString  =  NULL ;  p  =  ( proc_t ) get_bsdtask_info ( task );  if  ( p  ==  NULL )  {  goto  fail ;  }  pid  =  proc_pid ( p );  if  ( cs_entitlements_dictionary_copy ( p ,  ( void  ** ) &amp; entitlements )  ==  0  ...\n So we have a reference implementation for entitlement checks, and it’s backed by  OSUnserializeXML. Great! …or is it?\n A very interesting thing about this bug is that I couldn’t point you at any particular piece of code and say “there’s my bug”. The reason for that is that, of course, iOS doesn’t have just one, or two, or even three plist parsers, it has at least four! These are:\n    The answer to 1) is “all of them”, and to 2)  CFPropertyListCreateWithData. And as a few folks on Twitter already figured out after my tweet, the answer to 3) is obviously “lolnope”. Because it’s very hard to parse XML correctly,  valid XML makes all parsers return the same data, but slightly  invalid XML makes them return just slightly  not the same data. :D In other words, any parser difference can be exploited to make different parsers see different things. This is the  ...\n Before we move on to exploiting this, I would like to note that in all my tests,  OSUnserializeXML and  IOCFUnserialize always returned the same data, so for the rest of this post I will consider them as equivalent. For brevity, I will also be dubbing  OSUnserializeXML/ IOCFUnserialize “IOKit”,  CFPropertyListCreateWithData “CF”, and  xpc_create_from_plist “XPC”.\n  Let’s start with the variant of the PoC I tweeted out, which is perhaps the most elegant way of exploiting this bug:\n &lt;?xml version=&#34;1.0&#34; encoding=&#34;UTF-8&#34;?&gt; &lt;!DOCTYPE plist PUBLIC &#34;-//Apple//DTD PLIST 1.0//EN&#34; &#34;http://www.apple.com/DTDs/PropertyList-1.0.dtd&#34;&gt; &lt;plist  version= &#34;1.0&#34; &gt; &lt;dict&gt;  &lt;!-- these aren&#39;t the droids you&#39;re looking for --&gt;  &lt;!---&gt;&lt;!--&gt;  &lt;key&gt;platform-application &lt;/key&gt;  &lt;true/&gt;  &lt;key&gt;com.apple.private.security.no-container &lt;/key&gt;  &lt;true/&gt;  &lt;key&gt;\n The interesting tokens here are  &lt;!---&gt; and  &lt;!--&gt;, which, as per my understanding of the XML specification, are not valid XML tokens. Nonetheless, IOKit, CF and XPC all accept the above XML/plist… just not exactly in the same way.\n I wrote a little tool called   plparse that I have so far been reluctant to open-source because it emphasises the fact that there exist multiple plist parsers in iOS, and that they certainly don’t all work the same. It takes an input file and any combination of  -c,  -i and  -x args to parse the file with the CF, IOKit and XPC engines respectively. Running on the above file, we get:\n % plparse -cix ent.plist {}{ task_for_pid-allow: true, platform-application: true, com.apple.private.security.no-container: true,}{ com.apple.private.security.no-container: true, platform-application: true, task_for_pid-allow: true,}\n The output is a lazy JSON-like format, but you get the gist of it. At the top is CF, followed by IOKit, and finally XPC. This means that when we slap the above entitlements file on our app (plus app identifier that we need and such) and  amfiduses CF to check whether we have any entitlements that the provisioning profile doesn ’t allow, it doesn ’t see any. But then when the kernel or some daemon wants to check whether we ’re allowed to do Fun Stuff ™, they see  ...\n So how does this specific example work? This is the comment tag handling code of CF (the relevant one anyway, there are multiple):\n case  &#39;!&#39; :  // Could be a comment  if  ( pInfo -&gt; curr + 2  &gt;=  pInfo -&gt; end )  {  pInfo -&gt; error  =  __CFPropertyListCreateError ( kCFPropertyListReadCorruptError ,  CFSTR ( &#34;Encountered unexpected EOF&#34; ));  return  false ;  }  if  ( * ( pInfo -&gt; curr + 1 )  ==  &#39;-&#39;  &amp;&amp;  * ( pInfo -&gt; curr + 2 )  ==  &#39;-&#39; )  {  pInfo -&gt; curr  +=  2 ;  skipXMLComment ( pInfo );  }  else  {  pInfo -&gt; error  =  __CFPropertyListCreateError ( kCFPropertyListReadCorruptError ,  CFSTR ( &#34;Encountered  ...\n  if  ( c  ==  &#39;!&#39; )  {  c  =  nextChar ();  bool  isComment  =  ( c  ==  &#39;-&#39; )  &amp;&amp;  (( c  =  nextChar ())  !=  0 )  &amp;&amp;  ( c  ==  &#39;-&#39; );  if  ( ! isComment  &amp;&amp;  ! isAlpha ( c ))  {  return  TAG_BAD ;  // &lt;!1, &lt;!-A, &lt;!eos  }  while  ( c  &amp;&amp;  ( c  =  nextChar ())  !=  0 )  {  if  ( c  ==  &#39;\\n&#39; )  {  state -&gt; lineNumber ++ ;  }  if  ( isComment )  {  if  ( c  !=  &#39;-&#39; )  {  continue ;  }  c  =  nextChar ();  if  ( c  !=  &#39;-&#39; )  {  continue ;  }  c  =  nextChar ();  }  if  ( c  ==  &#39;&gt;&#39;  ...\n As can be seen, IOKit checks for the  !-- chars, and then correctly advances the pointer by three chars before seeing  -&gt;, which doesn’t end the comment. CF on the other hand only advances the pointer by  two chars, so it parses the second  - twice, thus seeing both  &lt;!-- and  --&gt;. This means that while IOKit considers  &lt;!---&gt; as just the start of a comment, CF considers it as both start and end. After that, we feed both parsers the  &lt;!--&gt;token,  ...\n  After discovering this, I didn’t bother reversing XPC, I simply fed it some test data and observed the results. In this case, it turned out to see the same things as IOKit, which was  perfect for my case. I could sneak entitlements past  amfid using CF, but have them show up when parsed by both IOKit and XPC!\n   &lt;?xml version=&#34;1.0&#34; encoding=&#34;UTF-8&#34;?&gt; &lt;!DOCTYPE plist PUBLIC &#34;-//Apple//DTD PLIST 1.0//EN&#34; &#34;http://www.apple.com/DTDs/PropertyList-1.0.dtd&#34;&gt; &lt;plist  version= &#34;1.0&#34; &gt; &lt;dict&gt;  &lt;???&gt; &lt;!-- ?&gt; &lt;key&gt;task_for_pid-allow&lt;/key&gt; &lt;true/&gt; &lt;!-- --&gt; &lt;/dict&gt; &lt;/plist&gt;\n  These are all less elegant and less rewarding than the first variant, and I’ll leave it as an exercise to the reader to figure out what parser difference causes those, or how the different parsers react to them.\n One thing to note here though is that, depending on what you use to install IPA files on your iDevice, getting these entitlements to survive that process can be tricky. That is because the entitlements on a provisioned app also contain a team- and app identifier, which at least Cydia Impactor generates randomly every time you sign, and thus has to parse, modify and re-generate the entitlements blob. I don ’t know about any of its alternatives, but I ’ve  ...\n  From this point forward, it’s simply a matter of picking entitlements. For a start, we can give ourselves the three entitlements in my initial PoC:\n com.apple.private.security.no-container - This prevents the sandbox from applying any profile to our process whatsoever, meaning we can now read from and write to any location the  mobile user has access to, execute a ton of syscalls, and talk to many hundreds of drivers and userland services that we previously weren’t allowed to. And as far as user data goes, security no longer exists.\n  task_for_pid-allow - Just in case the file system wasn’t enough, this allows us to look up the task port of any process running as  mobile, which we can then use to read and write process memory, or directly get or set thread register states.\n  platform-application - Normally we would be marked as a non-Apple binary and not be allowed to perform the above operations on task ports of Apple binaries, but this entitlement marks us as a genuine, mint-condition Cupertino Cookie. :P\n And just in case this entitlement magic wasn’t enough, say we needed to pretend to CF that we have certain entitlements as well, we could easily do that with the three above ones now. All we have to do is find a binary that holds the entitlement(s) we want,  posix_spawn it in suspended state, get the newly created process’ task port, and make it do our bidding:\n task_t  haxx ( const  char  * path_of_executable ) {  task_t  task ;  pid_t  pid ;  posix_spawnattr_t  att ;  posix_spawnattr_init ( &amp; att );  posix_spawnattr_setflags ( &amp; att ,  POSIX_SPAWN_START_SUSPENDED );  posix_spawn ( &amp; pid ,  path_of_executable ,  NULL ,  &amp; att ,  ( const  char * []){  path_of_executable ,  NULL  },  ( const  char * []){  NULL  });  posix_spawnattr_destroy ( &amp; att );  task_for_pid ( mach_task_self (),  pid ,  &amp; task );  return  task ; }\n You can further get some JIT entitlements to dynamically load or generate code, you can spawn a shell, or any of literally a thousand other things.\n There are a mere two privileges this bug does not give us: root and kernel. But for both of those, our available attack surfaces just increased a hundredfold, and I would argue that going to root isn’t even worth it, because you might as well go straight for the kernel.\n But I hope you will understand, dear reader, that losing one 0day is loss enough for me, so of course escalating past “mobile with every entitlement ever” is left as an exercise to you. ;)\n  Given the elusive nature of this bug, how did Apple ultimately patch it? Obviously there could only be one way: by introducing MORE PLIST PARSERS!!!one!\n In iOS 13.4 already, Apple hardened entitlement checks somewhat, due to a bug report  credited to Linus Henze:\n Available for: iPhone 6s and later, iPad Air 2 and later, iPad mini 4 and later, and iPod touch 7th generation\n While I don’t know the exact details of that bug, based on  a tweet of Linus I’m assuming this had to do with bplist, which, while also exploiting parser differences, wouldn’t have gotten past  amfid. And my bug actually survived the 13.4 fix, but was finally killed in 13.5 beta 3.\n I also don’t know whether it was Linus, Apple or someone else who went on to look for more parser differences, but having two entitlement bugs fixed in two consecutive minor iOS releases feels like too much of a coincidence, so I’m strongly assuming whoever it was drew inspiration from Linus’ bug.\n Apple’s final fix consists of introducing a new function called  AMFIUnserializeXML, which is pasted into both AMFI.kext and  amfid, and is used to compare against the results of  OSUnserializeXML and  CFPropertyListCreateWithData to make sure they are the same. You can still include a sequence like  &lt;!---&gt;&lt;!--&gt;&lt;!-- --&gt;in your entitlements and it will go through, but try and sneak anything in between those comments, and AMFI will  ...\n  So while this does technically bump the number of XML/plist parsers from 4 to 6, it does sadly actually mitigate my bug. :(\n  As far as first 0days go, I couldn’t have wished for a better one. This single bug has assisted me in dozens of research projects, was used thousands of times every year, and has probably saved me just as many hours. And the exploit for it is in all likelihood the most reliable, clean and elegant one I’ll ever write in my entire life. And it even fits in a tweet!! Well over 3 years since discovery is not half bad for such a bug, but I sure  ...\n We can also ask ourselves how a bug like that could ever exist. Why the hell there are 4 different plist parsers on iOS. Why we are still using XML even. But I figure those are more philosophical than technical in nature. And while this entire story shows that it might be a good idea to periodically ask ourselves whether the inaccuracies of our mental models are acceptable, or something should be documented and communicated more thoroughly,  ...\n Now, I’ve pumped this post out as soon as I possibly could, so if I’ve left any mistake in here, you have any questions, or just wanna chat in general, feel free to  file an issue, hit me up  on Twitter, or shoot me an email at  *@*.net where  * =  siguza.\n At the time of writing, this bug is still present on the latest non-beta version of iOS. The whole project is available  on GitHub, have fun with it while it lasts!\n And finally, some of the reactions I got of Twitter for all of you to enjoy:", "posttime": "2020-05-02 18:04:48", "tags": "ios,沙盒,paper,gt,entitlements", "title": "通灵纸：iOS沙盒逃脱", "title_en": "Psychic Paper: iOS Sandbox Escape", "transed": 0, "url": "https://siguza.github.io/psychicpaper/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["ios", "沙盒", "paper", "gt"]}]