[{"category": "", "categoryclass": "", "imagename": "2825e09ac4ebe7e0746533b1b61c9eb6.jpg", "infoid": 1001088, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "js是一个构建在Vue.js之上的前端框架，它提供了很棒的开发功能，比如服务器端渲染、自动生成的路由、改进的元标签管理和SEO改进。\n我们的前端团队并没有真正考虑使用Nuxt.js作为客户端的主要技术，直到我们最近收到了一个具有许多非常具体功能的独特项目的请求。因为这也是我们团队中的几个成员第一次使用Nuxt.js，所以我决定写这个博客来解释它是如何为我们工作的。\njs为前端开发人员提供了很多好处，但是有一个关键特性让我们最终决定使用这个框架-SEO改进。我们的应用程序需要此功能，因为它不是典型的内部SPA(单页应用程序)。这是一个包含社交分享功能和管理的公共网络应用程序。\n说到社交分享，Nuxt.js有很好的元标签管理，因此我们可以根据从后端接收的数据轻松地创建特定的、可定制的社交分享窗口。这是其中一个例子。\n为了提高SEO，Nuxt.js使用SSR(服务器端呈现)。SSR正在获取Ajax数据，并在服务器(Node.js)上将Vue.js组件呈现为HTML字符串。当所有异步逻辑完成后，它会将它们直接发送到浏览器，然后最终将静态标记提供给客户端上的一个完全交互的应用程序。该特性允许使用Google SEO解析器对DOM元素进行很好的解析。当加载网站DOM时，SEO解析器立即以极快的速度解析DOM元素。\n另一方面，使用Vue.js、Reaction、Angel等框架构建的典型SPA应用程序在加载DOM之后使用Ajax从后端获取数据，因此SEO解析器无法解析所有的DOM元素，因为还没有呈现。Ajax抓取是异步的，而SEO解析不是。\njs和Vue.js处理逻辑的方式非常不同。主要区别在于Vue总是在客户端运行，而Nuxt不是，这在某些情况下可能会导致重大问题。例如，如果您想要在加载应用程序之后立即选择DOM元素，则应用程序可能正在Node.js端运行，当然，Node.js中没有DOM元素。\n访问浏览器的本地存储时也会发生同样的情况。这就是Nuxt使用cookie而不是本地存储的主要原因-因为它们总是可以访问的。\n使用VUE，我们没有这些问题，因为它总是在客户机上运行，因此我们不必担心那些潜在的问题。\n让我们看看如何在Vue中处理这种类型的潜在问题，以及如何在Nuxt中做到这一点-通过实际的代码示例。\n这张图中最重要的是“Created”方法的提前返回。Nuxt有一个全局可访问的对象“进程”，它向我们显示我们当前是在服务器端还是在客户端运行。我们看到的代码背后的逻辑侧重于管理套接字连接，如果我们在服务器上运行，显然我们不想在接收套接字事件时更新DOM，因为服务器端没有DOM。如果这是一个Vue.js应用程序，代码将是相同的，除了早期返回部分-因为进程将始终在客户机上运行，并且永远不需要检查该特定语句。\nNuxt.js根据文件夹结构生成自己的路由器，而使用Vue.js则必须手动完成-但请记住，这两种原则各有优缺点。自动生成的路由器的优点是创建它更容易、更快。您只需创建目录和文件，Nuxt就可以完成所有工作。但缺点是，与手动编写的相比，它的可控性和可管理性较差。\n使用Vue.js，您可以轻松地将自己的逻辑添加到路由器、导入服务，并且比手动生成的路由器拥有更多的路由管理控制权。这个原则更耗时、更复杂，但这并不总是意味着它会变得更糟。\n当我们处于项目的研究阶段时(大约6个月前)，还没有值得冒险使用的可靠的打字入门工具包或配置。有很多的皮棉错误和丢失的类型，所以我们决定使用香草JS(ES6+)。同时，对Nuxt.js的TypeScript支持有了很大的改进，现在有了新的入门工具包和配置，可以随时使用，而不用担心与TypeScript相关的问题。\n糟糕的服务器端错误处理是我们在开发Nuxt.js应用程序时必须处理的最大、最苛刻的问题。当代码在Nuxt.js服务器(Node.js)端执行时，应用程序抛出非常无关的错误消息，调试和修复同样的错误非常困难和复杂。为了简化调试，有必要以特定方式处理Node.js端的错误。\n现在，有了更好的类型脚本支持和对SSR更深入的理解，我可以可靠地说Nuxt.js已经为中型和企业级应用程序做好了准备，但是仍然有改进的空间-比如Nuxt的Node.js端的更好的错误处理和Ajax管理。\nNuxt根据页面的目录和文件结构生成路由器逻辑及其路由。例如，如果我们创建一个目录和文件“about/index.vue”，Nuxt.js会自动为该页面创建路由“/about”。不需要在应用程序中的任何其他位置定义或配置路由。\n对于嵌套路由，只需在父目录内创建一个目录-“about/me/index.vue”将生成“about/me”路由。要创建动态嵌套路由或嵌套路由参数，所有需要做的就是命名带有LOCASH前缀的子目录-“user/_id/index.vue”将根据用户的id为用户创建动态嵌套路由。\njs还有一个非常有趣的与结构相关的特性-布局。js应用程序有主App.vue文件，它是所有应用程序组件的主根组件包装器。js使用布局，其中每个布局都充当应用程序组件的单独包装器。例如，如果我们希望某些特定的页面使用不同的UI库、全局CSS样式、字体系列、设计系统、元标签或其他元素，我们可以定义使用什么布局作为其父根组件。默认情况下，所有Nuxt.js页面都使用default.vue布局。\nNuxt.js中的Vuex的结构与通常的Vue.js环境几乎相同-带有存储模块。这种类型的结构是可选的，但强烈建议您进行更好的结构和代码维护。每个商店都应该根据应用程序逻辑和数据流进行结构化和模块化。例如，如果应用程序包含授权逻辑，我们必须创建授权存储模块来管理所有授权数据和逻辑，如登录、注销、cookie、令牌、用户数据等。\n开发您的第一个Nuxt.js项目一开始肯定会令人困惑和复杂，特别是如果您有Vue.js背景而没有SSR知识的话。但就像任何其他技术一样，要真正理解Nuxt.js框架的功能和好处，需要时间、错误和大量代码。对我来说，我热切地期待着我的下一个Nuxt.js项目，在那里我可以使用我学到的知识(希望还有打字脚本)，而不会遇到我之前参与的Nuxt.js+TypeScript项目的任何障碍。\n如果您有兴趣了解有关Nuxt.js的更多信息，我强烈建议您查看以下来源：\njs是一个非常强大的框架，具有许多有用的特性，使前端应用程序的开发变得更容易、更有趣。但请记住，它并不是所有类型的客户端应用程序和网站的最佳选择。\n那么，回答主要问题-Nuxt.js还是Vue.js？答案是，您必须了解每种方法的优点和缺点，还需要根据项目类型、目标和要求知道何时使用一种方法而不是另一种方法。\nNuxt通过其服务器端渲染功能提供了更好的SEO改进，通过自动通用路由器加快了开发速度，通过出色的配置选项和meta标签方法提供了公共共享功能和管理，通过预先渲染的页面自动拆分代码-所有这些都是Vue.js不可能或极其复杂的。如果您的下一个项目需要这些功能，我向您保证Nuxt.js将是一个很好的选择。\n另一方面，如果您的目标是内部产品、扩展的代码管理和覆盖范围、典型的客户端SPA、不需要SEO速率和性能，以及手动代码逻辑胜过通用解决方案，那么显而易见的选择是Vue.js，因为在处理所有这些方面，Vue.js远远优于Nuxt.js。\n_。如果您有什么想法想要讨论，请与我们的团队分享！", "note_en": "Nuxt.js is a frontend framework built upon Vue.js that offers great development features such as server side rendering, automatically generated routes, improved meta tags managing and SEO improvement.\n Our Front-end team didn’t really consider using Nuxt.js as a main technology on the client side until we recently received a request for a unique project with a number of very specific features. As this was also the first time a couple of members in our team used Nuxt.js, I decided to write this blog to explain how it worked for us.\n  Nuxt.js offers many benefits to front-end developers, but there was one key feature that made our decision to use this framework final – SEO improvement. Our application needs this feature because it is not a typical internal SPA (single-page application). It’s a public web application that includes social sharing features and management.\n Speaking of social sharing, Nuxt.js has great meta tags managing, so we could easily make specific and customisable social share windows depending on the data received from back-end. Here’s one of the examples.\n   To improve SEO, Nuxt.js uses SSR (Server Side Rendering). SSR is fetching AJAX data and rendering Vue.js components into HTML strings on the server (Node.js). It sends them directly to the browser when all asynchronous logic is done, and then finally serves the static markup into a fully interactive app on the client. This feature allows for great parsing through DOM elements with the Google SEO parser. SEO parser is parsing through DOM elements with enormous speed immediately when the website DOM is loaded.\n On the other hand, typical SPA applications built with frameworks like Vue.js, React, Angular and similar are fetching data from backend with AJAX after DOM is loaded, and therefore SEO parser is not able to parse all of the DOM elements, because there are not yet rendered. AJAX fetching is asynchronous, while SEO parsing is not.\n    Nuxt.js and Vue.js handle logic very differently. The main difference is that Vue is always running on the client side, while Nuxt is not, and that can cause major problems in some cases. For example – if you want to select a DOM element right after the application is loaded, there is a possibility that the app is running on the Node.js side, and of course, there are no DOM elements in Node.js.\n The same would happen when accessing a browser’s local storage. That is the main reason why Nuxt is using cookies over local storage – because they are always accessible.\n With Vue, we don’t have those kinds of problems because it is always running on the client, and therefore we do not have to bother with those kind of potential problems.\n Let’s see how to handle this types of potential problems in Vue and how to do it in Nuxt – with actual code examples.\n  The most important thing in this picture is the early return in the “created” method. Nuxt has a globally accessible object “process” that shows us are we currently running on the server side or the client side. The logic behind the code we see is focused on managing socket connection, and obviously we do not want to update the DOM on receiving socket events if we are running on server, because there is no DOM on the server side. If this was a Vue.js application, the code would be identical, except for the early return part – because the process would always be running on client and there would never be a need to check that particular statement.\n  Nuxt.js generates its own router based on the folder structure, while with Vue.js, it must be done manually – but keep in mind that there are pros and cons to both principles. Automatically generated router’s pros are that it is easier and faster to create one. You just create the directory and files, and Nuxt does all of the work. But the cons are that it is less controllable and manageable than a manually written one.\n  With Vue.js you can easily add your own logic to the router, import services and have more control managing routes than with a manually generated router. This principle is more time consuming and more complex, but that doesn’t always mean it is worse because of it.\n    While we were in the research phase of our project (some 6 months ago), there were no reliable Typescript start-kits or configurations whose usage was worth the risk. There were plenty of linting errors and missing types, so we decided to go with vanilla JS (ES6+). In the meantime, Typescript support for Nuxt.js has drastically improved and now there are new start-kits and configurations ready to be used without worrying about Typescript-related issues.\n Bad server-side error handling was the biggest and the most demanding issue we had to deal with while developing a Nuxt.js application. While code was executing on the Nuxt.js server (Node.js) side, the application was throwing very unrelated error messages, and it was really hard and complex to debug and fix those same errors. It was necessary to handle errors on the Node.js side in a specific way in order to make debugging simpler.\n Now, with better Typescript support and a deeper understanding of SSR, I can reliably say that Nuxt.js is ready for mid-scale and enterprise-scale applications, but there is still room for improvement – like better error handling and AJAX managing on the Node.js side of Nuxt.\n    Nuxt generates router logic and its routes based on the directory and file structure for pages. For example, if we create a directory and file  “about/index.vue”, Nuxt.js automatically creates the route  “/about” for that page. There is no need to define or configure routes anywhere else in application.\n For nested routes, creating a directory inside the parent directory is all that is necessary –  “about/me/index.vue” will generate the  “about/me” route. And for creating dynamic nested routes or nested route parameters, all that is required is to name the subdirectory with the lodash prefix –  “user/_id/index.vue” will create a dynamic nested route for users based on their id.\n  Nuxt.js has one more structure-related feature that is very interesting – layouts. Vue.js applications have the main App.vue file, which is the main root component wrapper for all application components. Nuxt.js uses layouts, where every layout serves as an individual wrapper for application components. For example, if we want some specific pages to use different UI libraries, global CSS styles, font families, design systems, meta tags or other elements, we can define what layout to use as its parent root component. By default, all Nuxt.js pages are using the default.vue layout.\n Vuex in Nuxt.js is structured almost identically to the usual Vue.js environment – with store modules. This type of structuring is optional, but highly recommended for better structure and code maintenance. Every store should be structured and modularized based on the application logic and data flow. For instance, if the application contains authorization logic, we must create the authorization store module for managing all authorization data and logic, such as log in, log out, cookies, tokens, user data, etc.\n    Developing your first Nuxt.js project will surely be confusing and complex at first, especially if you have Vue.js background without SSR knowledge. But just like any other technology, it takes time, mistakes and a lot of lines of code to truly understand the power and the benefits of the Nuxt.js framework. As for me, I’m eagerly awaiting my next Nuxt.js project where I’ll get to use my acquired knowledge (and hopefully Typescript) without encountering any obstacles from the previous Nuxt.js + Typescript project I worked on.\n If you’re interested in learning more about Nuxt.js, I highly recommend you check out these sources:\n  Nuxt.js is a very powerful framework with many useful features that make developing front-end applications easier and more entertaining. But keep in mind that it is not the best choice for all types of client-side applications and websites.\n So, to answer the main question – Nuxt.js or Vue.js? The answer is that you have to know the strengths and weaknesses of each, and you also need to know when to use one over the other based on the project type, goals and requirements.\n Nuxt offers better SEO improvement with its server-side rendering feature, faster development with auto-generic router, public share features and management with great configuration options and meta tags methods, automatic code splitting with pre-rendered pages – all of this is impossible or extremely complex to achieve with Vue.js. If these features are required for your next project, I assure you that Nuxt.js will be an excellent choice.\n On the other hand, if your goals are internal product, expanded code managing and coverage, typical client-side SPA, no need for SEO rate and performance, and manual code logic over generic solutions, then the obvious choice is Vue.js, as it’s far superior to Nuxt.js when it comes to handling all that.\n __________ We’re available for partnerships and open for new projects. If you have an idea you’d like to discuss,  share it with our team!", "posttime": "2020-05-07 21:47:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "胜过,js", "title": "Nuxt.js胜过Vue.js：您应该在什么时候使用它，为什么使用它", "title_en": "Nuxt.js over Vue.js: when should you use it and why", "transed": 1, "url": "https://www.bornfight.com/blog/nuxt-js-over-vue-js-when-should-you-use-it-and-why/", "via": "", "real_tags": ["胜过", "js"]}, {"category": "", "categoryclass": "", "imagename": "f8523826e80a8fd528211e2a589f93e3.png", "infoid": 1001087, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们非常高兴能展示Riot有史以来最大的变化：从过去24小时起，我们将对所有新的非公开对话启用默认的端到端加密，同时完全重写Riot围绕E2E加密的用户体验，由Matrix中的一整套全新加密功能提供支持。我们已经在网络、桌面、iOS和RiotX Android！🎉🍾🎊🔐🛡上同时发布了这个版本。\n这已经是很长一段时间了-交叉签名的第一次设计始于2018年11月，Nad的用户体验预览用于端到端加密，在2019年的大部分时间里，Uhoreg都在自己努力迭代规范并编写核心实现。然后，自2019年10月下旬以来，Riot团队的其他成员一直在加紧将其投入生产-从2020年2月FOSDEM 2020的初步实施开始，现在是今天的全面上线。那么，让我们来看看有什么大惊小怪的！\n每个过去在Riot中使用过E2E加密的人都会熟悉这样一个事实，即每当任何用户在您的任何房间登录新设备时，它都会警告您-这会变得非常无聊，非常快。其基本原理是，如果您不知道您是否真的在与您认为自己是谁交谈，那么E2EE是非常无用的，就像没有证书的SSL/TLS是无用的一样。此外，有人试图破解Matrix中的加密的最有可能的方式之一是访问目标的帐户并添加一个“幽灵”设备，以便监视他们的对话。因此，当意外设备突然出现时，您应该向用户发出警告，以便他们可以进行验证。但在实践中，我们转向过度了，这最终只会让人恼火。\n因此，为了解决这个问题，我们引入了用户在登录时验证自己的设备的功能-确认他们是合法的所有者，从而让所有验证过他们的人自动信任新的登录。这使我们能够自动警告用户有关其帐户的意外登录，并提供一种双因素身份验证形式以完成登录(假设用户需要以某种方式担保新登录)。我们称之为交叉签名，因为用户通过对其身份签名，将信任从一个设备转移到另一个设备。\n在升级到今天的Riot版本时，您会注意到的第一件事是系统会提示您“设置加密”以使交叉签名生效：\n这是因为我们需要设置恢复密码，以允许您在没有其他登录设备可用时验证您的新登录。当您在服务器上备份加密邮件密钥时，此密码短语可保护您在服务器上的交叉签名数据，并替换用于在新设备上检索历史记录的旧密码短语。因此，您现在只需使用一个密码就可以在登录和检索历史记录时验证您的设备(如果您已经使用下面屏幕截图中的切换设置了备份)。\nRiot iOS还没有这个安装阶段--目前，要升级你的账户以支持交叉签名，你需要使用Riot Web、Riot Desktop或RiotX Android。(提醒一下，Riot Android很快就会被RiotX Android取代，我们还没有在旧应用程序上实现任何新的E2EE工作。)。\n然后，在您的帐户上设置交叉签名后，系统将提示您检查当前会话并将其验证为您自己的会话-这意味着随后验证您的每个人都将自动信任它们。\n现在是清理帐户上仍然存在的陈旧会话的好时机-这些会话存在安全隐患(您无法通过交叉签名来证明您拥有这些会话，因此您将始终看起来不受信任)，而且它们会降低对其他所有人的加密速度。您可以在设置&gt；安全&amp；隐私部分中删除它们。\n.这意味着您可以通过从现有会话验证新登录(应该会弹出一个“未经验证的登录”提示)来为新登录提供担保-或者您可以输入恢复密码或恢复密钥来证明您对设备的所有权。？注意：只有当您的其他骚乱已升级到最新版本以支持交叉签名时，此功能才有效。\n这里的另一项新功能是，如果您正在将加密密钥备份到服务器，则验证自己的行为(通过验证现有设备或输入恢复密码/密钥)将神奇地使您的加密历史记录在新登录名上可用！✨。\n登录后，只需进行一次验证即可永久信任其他用户及其所有当前和未来的设备(除非他们将其撤销)-查看由一次成功验证产生的所有绿色复选框。\n请注意，交叉签名不仅仅适用于Riot：如果您交叉签名Riot的任何支持E2EE的Matrix客户端，那么验证将被记录下来，其他人也会信任它。因此，如果我在我的账户上登录Weechat(说E2EE，但还不做交叉签名)，只要我从Riot验证它，所有其他说交叉签名的人都会自动信任Weechat。\n交叉签名第一次合并到Riot的开发分支是在2月份的FOSDEM 2020上(我们从那以后一直在迭代它，以解决一些想法和错误)，我们的Talk Making and Breaking Encryption in Matrix为感兴趣的人提供了更多的技术细节。\n超级偏执狂用户需要注意的一点是：目前，用来给自己的设备签名的私钥和用来给其他用户签名的私钥都是由您的恢复密码/密钥加密的，并存储在服务器上，以便在您丢失所有设备的情况下进行恢复。我们还允许在设备之间共享(八卦)签名密钥，但目前该实现也将它们加密存储在服务器上。“此限制将在将来修复，但目前如果您不信任您的服务器具有加密密钥，您可能希望暂缓使用交叉签名。\n最后，在技术细节方面：在内部，您的恢复密码/密钥称为SSSS(Secure Secret Storage and Sharing，又名Quad-S)密钥-它加密任意秘密数据(例如签名密钥和备份密钥)，然后将这些数据存储在服务器上的个人帐户数据中。如果您在帐户数据中查找m.ret_storage.default_key，则可以通过/DevTools斜杠命令在Riot Web/Desktop中查看它的运行情况，然后它加密的各种秘密位于m.Cross_signing.master、m.Cross_signing.self_sign、m.Cross_signing.user_sign和m.megolm_backup.v1。(它们分别处理如何整体保护您的交叉签名数据；如何对您自己的设备进行交叉签名；如何对其他用户进行交叉签名；以及如何加密您的邮件备份(如果您使用它们)。SSSS既支持将数据存储在帐户数据中(以便您可以在丢失所有设备的情况下恢复数据)，也支持定义如何在设备之间安全地共享/八卦数据(如果您不想将其存储在服务器上的account_data中)。\n交叉签名的另一个方面是，我们已经极大地改进了验证的工作方式，使您更容易信任您正在与之交谈的人。\n第一个大变化是：我们现在支持扫描二维码进行验证！*如果你登录RiotX Android或Riot iOS，你现在可以通过扫描Riot Web(或任何其他Riot)上的二维码进行验证，你进入了💥：D我们甚至做了一些魔术，这样你刚刚扫描的设备也会回报并自动信任你。别担心，如果你不想扫描二维码，你仍然可以选择比较表情符号(如果你感到怀旧或受虐，甚至可以比较公共指纹)。\n第二个重大变化是：验证现在使用DM！，而不是验证是短暂的东西，如果您错过它们，它们就会永远消失，我们现在会在它们出现时显示弹出窗口，并在Direct Message历史记录中与验证您的人一起跟踪它们。\n第三个大变化是：验证现在发生在侧面板中！以前的验证是丑陋的模式弹出窗口，它会阻止您正在做的事情，直到您处理它们(特别恼人的是，因为您无法恢复它们)。现在您可以根据需要进出它们，同时执行多个操作，再也不会受制于邪恶的模式弹出窗口。\n关于Riot Web、RiotX Android和Riot iOS上交叉签名和验证的完整过程，有一段来自Valère的精彩视频，它完整地展示了上周的Open Tech Will Save Us Meetup：\n最后，既然验证用户通常是一次性的活动，我们强烈建议使用交叉签名方！\n曾几何时，当面做这件事可能是一件非常愚蠢和有趣的事情(想象一下，一屋子人互相喊表情符号，疯狂地跑来跑去扫描彼此的二维码)-但在我们勇敢的新反乌托邦未来，我们能做的最好的事情就是在吉西身上做这件事。(显然，1：1验证效率更高，但集体验证更有趣--事实证明，你可以通过Jitsi成功验证至少3个重叠的表情符号！)戴夫(Riot Web的原著作者、交叉签名开发冠军)为后人录制了上周新矢量交叉签名派对编辑后的亮点……。：D。\n希望从前面的章节中可以清楚地看出，Nad-Riot的首席设计师已经在改进UI和UX方面付出了巨大的努力。任何对我们一直在工作的全部设计资产感兴趣的人都可以在Figma上查看它们。\n我们应该强调的主要改进之一是，我们现在终于有了一种一致的方式来表示加密房间和使用屏蔽的UI中的信任级别：\n有了新的防护罩，我们不再在用户的对话中添加新设备时骚扰他们-相反，我们希望他们看到，如果添加了不可信的设备，房间的防护罩会到处闪烁红色。\n挂锁现在被用来显示私密的房间(类似于其他消息应用程序)，而不是加密的-尽管在我们这个新的E2EE默认世界中，实际上几乎所有的私密房间都应该加密。我们现在还将您的活动应用程序登录称为“会话”，而不是我们以前使用的相当隐晦的“设备”。\n最后，即使对话中出现未经验证的会话，我们也不再喋喋不休并阻止消息-用户的盾牌变红是警告您可能正在发生坏事的提示。\n阻止我们进行默认加密的所有私人对话的另一个主要原因是，不想突然破坏Matrix社区多年来想出的所有客户端、机器人和网桥。安全地实现E2EE是很困难的，而且认为每个随机的Matrix项目都必须自己弄清楚这一点是疯狂的。\n因此，我们创建了Pantalaimon-这是一个为您完成所有E2EE繁重任务的小应用程序；让任何现有的Matrix客户端/机器人/网桥都可以参与加密的私人房间，而不必实际使用E2EE。潘(他是这么称呼他的朋友的)工作得非常好--例如，我们在生产中使用它在加密房间里使用Mjolnir。最初是由poljar使用他的Matrix-nio库用Python编写的，目前正在使用我们新的Matrix-rust-sdk库向Rust进行移植-提供了一个真正轻量级的守护进程来处理Matrix中最复杂的部分。我们的FOSDEM演讲为感兴趣的人提供了演示和更多信息。\n值得一提的是，虽然Pantalaimon非常有用，但越来越多的客户端现在确实拥有原生E2EE支持--这是由越来越多的独立E2EE实现提供支持的。*目前的名单包括：\n另一项艰巨的任务是支持在E2EE房间中进行搜索。从Riot Desktop 1.6开始，我们默认完全支持在E2EE房间中进行搜索-现在您甚至可以在右侧面板中列出E2EE房间中的所有文件。\n这要归功于Seshat-Poljar的另一个项目，它提供E2EE房间的客户端全文搜索索引，安全地加密和存储索引，以便Riot Desktop可以实现搜索。Seshat是用Rust编写的，在未来，我们希望看到它也集成到Riot Mobile(和Pantalaimon)中-在桌面和移动之间八卦加密的搜索索引，这样无论你在什么平台上，你都可以快速搜索你的房间。\n值得注意的是，这也是Riot Desktop第一次偏离Riot Web的功能-我们现在拥有了完整的构建基础设施，可以在Riot Desktop中为Linux、MacOS和Windows提供更丰富的本机功能(如Seshat)。关注这个空间，了解更多原生功能--例如，我们最终将能够实现即按即说！\n默认情况下阻止E2EE的最后一件事是，我们需要追踪客户端最终没有解密收到的消息所需的密钥的剩余场景。这被证明是一个真正的痛苦，因为在某些情况下，您可能合法地无法解密(例如，发送者不知道您的存在，因为当他们发送消息时，他们的服务器还没有看到您在房间里-或者可能发送者已经将您列入黑名单-或者发送消息时您不在房间？)。相反，在客户端之间传输密钥时的任何错误都可能导致相同的症状(例如，如果客户端或服务器未能正确跟踪房间中的哪些设备，或者如果用户从备份中克隆了他们的设备，并且加密无法处理由此产生的分裂大脑)。在症状完全相同的情况下区分细菌和合法行为有点像噩梦。\n最后，我们解决了这个问题，既找到了剩余的漏洞，又改善了用户体验，以便Riot告诉您“为什么”它无法解密给定的消息(例如，“您被列入黑名单”或“发送者不知道您在房间里”等)。这是一个巨大的改进，除非发生了一些奇怪的事情，否则很少会出现这样的错误。我们也得到了一些安慰，因为WhatsApp也有同样的问题，而且它们甚至没有去中心化！\n虽然我们已经可以放心地在默认情况下打开加密，但我们还可以做大量的工作来进一步改进加密。快速浏览剩余的主要项目：\n根据用户反馈，不可避免地需要对UI/UX进行更多的润色。感谢使用我们在过去两周发布的候选版本的每个人进行的令人惊叹的测试，我们相信我们抓住了剩下的精彩，但总会有更多的微调。有关更多详细信息，请参阅本文末尾仪表板中的“阶段4”。\n目前，交叉签名要求您将加密的交叉签名密钥存储在服务器上，这意味着服务器上猜测您的恢复密码/密钥的攻击者可能会对恶意设备进行交叉签名，以监视您的帐户。一般来说，这很好，因为如果您丢失了所有设备，这是恢复帐户交叉签名状态的唯一方法。然而，如果您是超级偏执狂，您可能希望在设备之间共享(八卦)密钥，而不是将它们加密存储在服务器上。协议支持这一点--我们只是还没有把它连接起来。\n现在有两个密码很麻烦-一个用于您的帐户，另一个用于您的加密状态。我们可以扩展您的加密密码，也可以解锁您的帐户--但这将意味着完全重写Riot的登录过程和密码重置逻辑(并迁移每个人的密码)。我们本可以在这个版本中做到这一点，但我们已经迟到了，所以我们决定推迟到未来。\n目前，我们没有办法在不显式验证用户密钥的情况下将其标记为受信任。我们计划在“第一次使用时就信任”(豆腐)的地方隐含地信任用户，但这让用户界面变得更加复杂--虽然我们已经设计了它，但它被推到了未来的版本中。\n你不能在Riot iOS上设置交叉签名；相反，你会被路由到Riot Web上进行排序。如果你唯一的设备是在iOS上，那就太可惜了--我们只需要把它移植过来就行了。\n目前只有Riot Desktop支持通过Seshat进行加密搜索。我们需要在RiotX Android和Riot iOS中实现它，可能还需要在Riot Web上实现，然后在这些设备之间共享加密的搜索索引。\n我们没有办法有选择地导出/导入房间的密钥，以便有意识地修复丢失历史的用户的历史。显然，这避开了E2EE，但有时拥有它确实是一件非常有用的事情。有第三方工具可以提供这一点，但是Riot有本机支持就太好了。\n在协议层，没有什么可以阻止您通过签署受信任的用户来委派信任。例如，系统管理员可以为加入团队的每个新用户签名，然后他们会自动信任团队中的其他每个人。不过，我们还没有在“暴动”里接上这个。\n最后但并非最不重要的一点是：自从Olm和Megolm从NCC集团获得最初的公开审计以来，已经有几年了。虽然核心加密棘轮从那时起没有显著变化，但所有这些密钥管理工作当然都是新的-一旦我们确信我们有一个值得验证的长期稳定版本，我们将对整个堆栈进行另一次审核。\n虽然在过去的6个月里，默认的E2EE一直是我们的主要项目，当然也有很多其他的事情在发生--但是我们太专注于E2EE了，以至于我们忘记了正确地告诉任何人这件事。所以，迟到总比不到好，这里有一些亮点！\n早在2015年，当我们第一次将视频会议添加到Matrix中时，我们的目的总是让人们连接到本地会议服务器，而不是我们在matrix.org上运行的默认会议服务器-但由此产生的额外复杂性意味着它的待办事项列表…不断减少。直到现在！\nRiot Web现在支持直接实例化Jitsi视频/语音会议，通过Riot Web直接集成Jitsi，而不必使用自定义集成管理器。这意味着要将Riot部署配置为默认指向自定义JITSI，现在只有一个配置行：https://github.com/vector-im/riot-web/blob/develop/docs/jitsi.md有详细信息。您还可以在Matrix博客上看到设置此功能的完整教程。值得注意的是，到目前为止，只有Riot Web和Desktop有能力使用这一功能，但Riot iOS和RiotX Android应该很快就会跟进。(事实上，今天的iOS版本支持加入自托管的Jitsis，并将很快支持创建它们)。\n我们从Mozilla那里反复听到的反馈之一是，Riot需要更好的键盘快捷键-既记录了我们已经拥有的快捷键，也引入了新的快捷键，比如“跳到上一个/下一个房间”和“跳到上一个/下一个未读的房间”。嗯，我们很高兴地说，由于t3chGuy的努力，终于有了这些快捷键！你可以通过点击Cmd/Ctrl+/或点击用户设置的帮助选项卡中的‘键盘快捷键’按钮来查看所有新的快捷键。看起来是这样的！\nRiot Web多年来UI/UX中最糟糕的部分之一是房间目录-特别是如何查看其他服务器上的目录。再一次，我们很高兴地宣布，这个问题现在已经通过大幅改进的UI得到了修复-现在可以轻松地将新服务器添加到您的房间目录中，并查看由服务器上的网桥公开的房间目录。看起来是这样的！\n希望每个人都注意到了新的邀请对话框--根据你最近与谁交谈提供建议，并简化了旧的设计，从而极大地改善了邀请人们参加对话的过程。我们在这里仍在解决一些美观和可访问性问题，但它是明确的。\n..", "note_en": "We are incredibly excited to present the biggest change in Riot ever: as of the last 24 hours we are  enabling end-to-end encryption by default for all new non-public conversations, together with a complete rework of Riot’s user experience around E2E encryption, powered by a whole new suite of encryption features in Matrix. We have released this simultaneously on  Web,  Desktop,  iOS and  RiotX Android! 🎉🍾🎊🔐🛡\n     This has been a long time coming - the first designs for cross-signing started in Nov 2018 with Nad’s  User Experience Preview for End-to-end encryption, and for much of 2019 Uhoreg was plugging away by himself iterating on the specification and writing the core implementations. Then, since late Oct 2019 the rest of the Riot team has piled on to bring it to production - starting with the initial implementation in Feb 2020 for FOSDEM 2020, and now the full go-live today. So, let’s see what all the fuss is about!\n    Everyone who’s used E2E encryption in Riot in the past will be familiar with the fact it warns you whenever any user logs in on a new device in any of your rooms - and that this gets very boring, very fast. The rationale was that E2EE is pretty useless if you don’t know if you’re actually talking to the person you think you are, just as SSL / TLS would be useless without certificates. Moreover, one of the most likely ways for someone to try to compromise encryption in Matrix is to gain access to the target’s account and add a ‘ghost’ device in order to spy on their conversations. Therefore you should warn users when unexpected devices suddenly appear so they can verify them. But in practice, we oversteered and this just ends up being annoying.\n So to fix this, we’ve introduced the ability for users to  verify their own devices at login - confirming that they are the rightful owners and so letting everyone who has verified them automagically trust the new login. This then gives us the ability to automatically warn users about unexpected logins on their account - and provides a form of two factor authentication in order to complete login (given the user needs to vouch for the new login somehow). We call this cross-signing, because the user is crossing over the trust of one device to another by signing its identity.\n The first thing you’ll notice on upgrading to today’s Riot releases is that you’ll be prompted to “set up encryption” in order for cross-signing to work:\n  This is because we need to set up a recovery passphrase to allow you to verify your new logins when you have no other logged in devices available.  This passphrase secures your cross-signing data on the server, and replaces the old passphrase used to retrieve your history on new devices, when you backed up your encrypted message keys on the server. So you now have one single passphrase to both verify your devices when you log in and retrieve your history (if you have set up the backup with the toggle in the screenshot below).\n  Riot iOS does not have this setup phase yet - for now, to upgrade your account to support cross-signing you’ll need to use Riot Web, Riot Desktop or RiotX Android. (Heads up that Riot Android is shortly to be replaced by RiotX Android, and we haven’t implemented any of the new E2EE work on the old app.)\n Then, having set up cross-signing on your account, you will be prompted to review your current sessions and verify them as your own - meaning that everyone who subsequently verifies you will automatically trust them.\n  Now is a great time to clear up your stale old sessions still present on your account - these are a security hazard (you can&#39;t prove that you own them by cross-signing them, so you will always appear untrusted) plus they slow down encryption for everyone else. You can remove them in the Settings &gt; Security &amp; Privacy section.\n   ...meaning you can either vouch for the new login by verifying it from one of your existing sessions (which should be helpfully prompting you with an “Unverified login” popup) - or you can enter your recovery passphrase or recovery key to prove your ownership of the device.  N.B. this only works if your other Riots have been upgraded to the latest version in order to support cross-signing.\n Another nice new thing here is that if you are backing up your encryption keys to the server, the act of verifying yourself (either by verifying an existing device or entering the recovery passphrase/key) will magically make your encrypted history available on your new login! ✨\n Once you’ve logged in, then all it takes is a single verification to trust other users and all of their current and future devices forever (unless they revoke it) - see all the green checkboxes resulting from a single successful verification.\n  Please note that cross-signing isn’t just for Riot: if you cross-sign any E2EE-capable Matrix client from Riot, then the verification will be recorded and others will trust it. So, if I logged into weechat on my account (speaks E2EE but doesn’t do cross-signing yet),  as long as I verify it from Riot, everyone else who speaks cross-signing will automatically trust the weechat.\n Cross-signing first merged to the develop branches of Riot back in February at FOSDEM 2020 (we’ve been iterating on it since to iron out some thinkos and bugs) and our talk  Making and Breaking Encryption in Matrix provides a lot more technical detail for those interested.\n   One point for super-paranoid users: currently the private key used to sign your own devices and the private key used to sign other users are encrypted by your recovery passphrase/key and stored on the server to allow recovery if you lose all your devices. We also allow signing keys to be shared (gossiped) between devices, but right now the implementation also stores them encrypted on the server too.  This restriction will be fixed in future, but for now if you don’t trust your server with encrypted keys, you may want to hold off on using cross-signing.\n Finally, in terms of technical details: internally, your recovery passphrase/key is referred to as your  SSSS (Secure Secret Storage and Sharing, aka  Quad-S) key - it encrypts arbitrary secret data (e.g. signing keys and backup keys) which are then stored in your personal account data on the server. You can see it in action in Riot Web/Desktop via the /devtools slash command if you look for the m.secret_storage.default_key in account data, and then the various secrets it encrypts are at m.cross_signing.master, m.cross_signing.self_signing, m.cross_signing.user_signing and m.megolm_backup.v1. (These respectively handle how you secure your cross-signing data overall; how you cross-sign your own devices; how you cross-sign other users; and how you encrypt your message backups if you use them). SSSS supports both storing data in account data (so you can recover it if you lose all your devices) as well as defining how to securely share/gossip it between device (if you don&#39;t want to store it on the server in account_data).\n  The other side of cross-signing is that we’ve massively improved how verification works, to make it even easier to trust who you’re talking to.\n The first big change is:  we now support scanning QR codes for verification!  If you’re logging in on RiotX Android or Riot iOS, you can now verify by scanning a QR code on Riot Web (or any other Riot for that matter) and 💥, you’re in :D  We even do some magic so the device you just scanned will reciprocate and automatically trust you too. And don’t worry, if you don’t want to scan QR codes you can still choose to compare emoji (or even compare public fingerprints if you’re feeling nostalgic or masochistic).\n  The second big change is that:  verifications now use DMs!  Rather than verifications being transient things which if you miss them are gone forever, we now show a popup when they appear and also track them in the Direct Message history with whoever is verifying you.\n  The third big change is:  verifications now happen in the side panel!  Previously verifications were ugly modal popups which blocked what you were doing until you dealt with them (particularly annoying given you couldn’t resume them). Now you can hop in and out of them as needed, do multiple ones at the same time, and never be beholden to the evil modal popup again.\n  For a full run-through of cross-signing and verification on Riot Web, RiotX Android and Riot iOS, there’s a  great video from Valère giving a full run through from last week’s  Open Tech Will Save Us meetup:\n   Finally, now that verifying users is generally a once-off activity, we highly recommend having cross-signing parties!\n Once upon a time this might have been a very silly fun thing to do in person (imagine a room of people yelling emoji at each other and frantically running around scanning each other&#39;s QR codes) - but in our brave new dystopian future the best we can do is to do it over Jitsi. (Obviously it&#39;s more efficient to do it via 1:1, but it&#39;s more fun to do it en masse - turns out that you can successfully do at least 3 overlapping emoji verifications via Jitsi!)  Dave (original author of Riot Web and cross-signing dev champion) recorded the edited highlights of the New Vector cross-signing party last week for posterity... :D\n  Hopefully it’s clear from the previous sections that a huge amount of effort has gone into refining the UI and UX here by Nad - Riot’s lead designer. Anyone interested in the full design assets we&#39;ve been working from can  check them out at Figma.\n One of the main improvements we should call out is that we finally have a consistent way now of representing encrypted rooms and trust level in the UI using shields:\n    With the new shields, we no longer nag the user whenever a new device is added in their conversations - instead we expect them to see the room&#39;s shields flash red everywhere if an untrustworthy device is added.\n Padlocks are now used to show rooms which are private (similar to other messaging apps) rather than encrypted - although in practice almost all private rooms should be encrypted in our new E2EE-by-default world. We also now refer to your active app logins as ‘sessions’ as opposed to the rather cryptic ‘devices’ we used before.\n Finally, we no longer nag and block messages even when an unverified session appears in a conversation - the user’s shield going red is your cue to warn you that badness may be happening.\n  One of the other major things that has been stopping us making all private conversations encrypted by default is not wanting to suddenly sabotage all the clients, bots and bridges which the Matrix community has come up with over the years. Implementing E2EE securely is Hard, and it’s crazy to think that each and every random Matrix project would have to figure it out themselves.\n So, we created  Pantalaimon - a little application which does all the E2EE heavy lifting for you; letting any existing Matrix client/bot/bridge participate in encrypted private rooms without having to actually speak E2EE. Pan (as he’s called to his friends) works incredibly well - we use it in production to use  Mjolnir from encrypted rooms, for instance. Originally written in Python by  poljar using his matrix-nio library, there’s currently a porting to Rust in progress using our new  matrix-rust-sdk library - providing a truly lightweight daemon to handle the most complicated bits of Matrix. Our  FOSDEM talk has a demo and a lot more information for those interested.\n It&#39;s worth noting that while Pantalaimon is super useful, an increasing number of clients do now have native E2EE support - powered by an ever increasing number of independent E2EE implementations.  The current list includes:\n   Another huge task has been supporting search in E2EE rooms. As of Riot Desktop 1.6 we have full support by default for search in E2EE rooms - and you can now even list all the files in E2EE rooms in the right-hand panel.\n This is thanks to  Seshat - another project from poljar, which provides client-side full text search indexing of E2EE rooms, securely encrypting and storing the indexes so that Riot Desktop can implement search. Seshat is written in Rust, and in future we expect to see it integrated into Riot Mobile (and Pantalaimon) too - gossipping the encrypted search indexes between desktop and mobile, so you can quickly search your rooms no matter what platform you’re on.\n It’s worth noting this is also the first time that Riot Desktop has deviated in functionality from Riot Web - and we now have the full build infrastructure in place to ship much richer native functionality (like Seshat) for Linux, macOS and Windows in Riot Desktop. Watch this space for more native functionality - we’ll be finally able to implement  push to talk, for instance!\n  The final thing which has kept E2EE off by default is that we’ve needed to chase down the remaining scenarios where clients end up not having the keys they need to decrypt received messages. This turns out to be a real pain, because there are some scenarios where you may legitimately be unable to decrypt (e.g. the sender doesn’t know you exist, because when they sent the the message their server hadn’t yet seen you were in the room - or perhaps the sender has blacklisted you - or perhaps you weren’t in the room when the messages were sent?). Conversely, any bug when transporting keys between clients could result in the same symptoms (e.g. if a client or server has failed to correctly track which devices are in a room, or if a user clones their device from a backup and the encryption fails to handle the resulting split brain). Distinguishing bugs from legitimate behaviour when the symptoms are all the same is a bit of a nightmare.\n In the end, we’ve solved this both by hunting down the remaining bugs, but also improving the user experience so that Riot tells you *why* it couldn’t decrypt a given message (e.g. “you were blacklisted” or “the sender didn’t know you were in the room” etc). It’s a huge improvement, and it’s pretty rare to see one of these errors unless something strange is going on. We’ve also taken some solace in the fact that WhatsApp  has the same problem, and they’re not even decentralised!\n  While we’ve got to the point where we feel comfortable turning on encryption by default, there’s still an extensive roadmap of work we can do to improve encryption further. Quickly going through the main remaining items:\n There’s inevitably going to be more UI/UX polishing needed based on user feedback. Thanks to the amazing testing from everyone who used the release candidates we shipped over the last two weeks we believe we caught the remaining showstoppers, but there’s always going to be more fine-tuning. See “Phase 4” in  the dashboard at the end of this post for more details.\n Currently cross-signing requires that you store your encrypted cross-signing keys on the server, meaning that an attacker on the server who guesses your recovery passphrase/key could cross-sign a malicious device to spy on your account. Generally this is fine, as if you lose all your devices it’s the only way to recover your account’s cross-signing state. However, if you are super paranoid, you may wish to share (gossip) the keys between devices instead rather than storing them encrypted on the server. The protocol supports that - we just haven’t hooked it up yet.\n It’s clunky to have two passwords now - one for your account, and one for your encryption state. We could extend your encryption password to also unlock your account too - but it’d mean completely rewriting Riot’s login process and password reset logic (and migrating everyone’s passwords over). We could have done it in this release, but we’re already late and so we decided to defer it in future.\n Currently we don’t have a way to mark a user as trusted without explicitly verifying their keys. We have plans for implicitly trusting users where we ‘trust on first use’ (TOFU), but this complicates the UI further - and while we’ve designed it, it got punted to a future release.\n You can’t set up cross-signing on Riot iOS; you get routed to sort it out on Riot Web instead. This is a real shame if your only device is on iOS - we just need to port this over.\n Encrypted search via Seshat is only supported on Riot Desktop today. We need to implement it in RiotX Android and Riot iOS and possibly Riot Web too, and then share the encrypted search indexes between the devices.\n We don’t have a way to selectively export / import keys for a room in order to consciously fix the history for a user who’s missing history. Obviously this sidesteps E2EE, but sometimes it’s a really useful thing to have. There are third party tools which provide this, but it’d be great for Riot to have native support.\n At the protocol layer, there’s nothing stopping you delegating trust by signing a trusted user. For instance, a sysadmin could sign every new user joining a team, and they would then automatically trust everyone else in the team. We haven’t hooked this up in Riot yet though.\n Finally, last but not least: it’s been a few years since Olm and Megolm got their  original public audits from NCC Group. Whilst the core cryptographic ratchets haven’t changed significantly since then, all this key management work is of course new - and we will be doing another audit covering the whole stack once we are confident we have a long-term stable release worthy of validation.\n  While E2EE-by-default has been our primary project for the last 6 months, there’s of course been lots of other stuff happening too - but we’ve been so engrossed in E2EE that we forgot to properly tell anyone about it. So, better late than never, here’s some of the highlights!\n  Back when we first added video conferencing into Matrix in 2015, the intention was always to let folks hook up to a local conferencing server rather than the default we ran at matrix.org - but the resulting additional complexity meant that it kept getting bumped down the todo list… until now!\n Riot Web now has support to directly instantiate Jitsi video/voice conferences, integrating Jitsi directly via Riot Web rather than by having to use a custom integration manager. This means that to configure your Riot deployment to point by default to a custom Jitsi is now a single configuration line:  https://github.com/vector-im/riot-web/blob/develop/docs/jitsi.md has the details. You can also see a full tutorial for setting this up over on the  Matrix blog. It’s worth noting that so far only Riot Web and Desktop have the ability to use this feature, but Riot iOS and RiotX Android should follow shortly.  (In fact, today&#39;s iOS release supports joining self-hosted Jitsis, and will support creating them too shortly).\n  One of the recurring bits of feedback we’ve heard from Mozilla has been the need for better keyboard shortcuts in Riot - both documenting the ones we have already, as well as introducing new ones like “jump to previous/next rooms” and “jump to previous/next unread rooms”. Well, we’re happy to say this is finally here thanks to t3chguy’s efforts!  You can see all the new shortcuts by hitting Cmd/Ctrl + / or hitting the ‘Keyboard Shortcuts’ button in the Help tab of User Settings. It looks like this!\n   One of the worst bits of UI/UX in Riot Web for many years has been the Room Directory - particularly how you go about viewing the directories on other servers. Again, we’re happy to announce that this is now fixed with a massively improved UI - it’s now trivial to add new servers to your room directory, and view the room directories exposed by bridges on your server. It looks like this!\n   Hopefully everyone has also spotted the new Invite dialog - hugely improving the process of inviting people to conversations by providing suggestions based on who you’ve been talking to recently, and streamlining the old design. There’s are a few cosmetic and accessibility issues we’re still working through here, but it’s definit\n......", "posttime": "2020-05-07 21:46:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "matrix,riot", "title": "默认情况下，Riot/Matrix启用交叉签名验证和E2E加密", "title_en": "Riot/Matrix enables cross-signed verification and E2E encryption by default", "transed": 1, "url": "https://blog.riot.im/e2e-encryption-by-default-cross-signing-is-here/", "via": "", "real_tags": ["matrix", "riot"]}, {"category": "", "categoryclass": "", "imagename": "590fe48239937b6dcfbe760e3bd08c84.png", "infoid": 1001086, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们是一群充满激情的有趣的企业家，他们建造了我们自己的革命性软件，旨在使运输变得简单。EasyPost最初是一家工程第一公司，我们为拥有务实的软件开发方法而感到自豪。我们的团队拥有丰富的不同经验和不同的背景，从初创公司到大型科技公司。\n我们给我们的员工以他们想要的方式工作的自主权。我们相信在正确的时间使用正确的工具来解决正确的问题。我们通过公开、协作、深思熟虑和负责任地工作来赋予员工权力。", "note_en": "We&#39;re a fun group of passionate entrepreneurs who built our own revolutionary software designed to make shipping simple. EasyPost started as an Engineering first company and we are proud to have a pragmatic approach to software development. Our team has a wealth of diverse experience and different backgrounds ranging from startups to large technology companies.\n We give our employees the autonomy to work the way they want to get the job done. We believe in using the right tools to solve the right problems at the right times. We empower employees by working openly, collaboratively, thoughtfully, and with responsibility.", "posttime": "2020-05-07 21:31:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "便士,easypost", "title": "EasyPost仍在增长100便士-加入我们", "title_en": "EasyPost Still Growing 100p – Join Us", "transed": 1, "url": "https://www.easypost.com/careers", "via": "", "real_tags": ["便士", "easypost"]}, {"category": "", "categoryclass": "", "imagename": "46c91505620af0a7b47e68b562f8819d.png", "infoid": 1001085, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们很自豪地宣布收购KeyBase，这是Zoom进一步加强我们视频通信平台安全的90天计划中的又一个里程碑。自2014年推出以来，Keybase的杰出工程师团队利用他们深厚的加密和安全专业知识构建了安全的消息传递和文件共享服务。我们很高兴能将Keybase的团队整合到Zoom系列中，帮助我们构建能够达到当前Zoom可伸缩性的端到端加密。\n此次收购标志着Zoom迈出了关键的一步，因为我们试图创建一个真正私人的视频通信平台，该平台可以扩展到数亿参与者，同时还可以灵活地支持Zoom的各种用途。我们的目标是为每个使用案例提供尽可能多的隐私，同时平衡我们用户的需求和我们防止平台上有害行为的承诺。Keybase的经验丰富的团队将是这项任务的关键部分。\n今天，在Zoom客户端(例如，Zoom房间、膝上型计算机和运行Zoom应用程序的智能手机)之间流动的音频和视频内容在每个发送客户端设备上都是加密的。直到它到达接收方的设备时才会解密。在最近的Zoom 5.0版本中，Zoom客户端现在支持使用具有256位密钥的行业标准AES-GCM加密内容。但是，每次会议的加密密钥都是由Zoom的服务器生成的。此外，Zoom客户端广泛使用的一些功能，如支持与会者呼叫电话桥或使用其他公司提供的室内会议系统，将始终要求Zoom在云中保留一些加密密钥。但是，对于那些将隐私置于兼容性之上的主机，我们将创建一个新的解决方案。\nZoom将为所有付费账户提供端到端加密会议模式。登录用户将生成公共加密身份，这些身份存储在Zoom网络的存储库中，可用于在与会者之间建立信任关系。会议主持人将生成临时的每次会议对称密钥。此密钥将在客户端之间分发，使用非对称密钥对进行封装，并在与会者列表发生重大更改时轮换。加密秘密将在主持人的控制下，主持人的客户端软件将决定允许哪些设备接收会议密钥，从而加入会议。我们还在研究允许企业用户提供额外身份验证级别的机制。\n这些端到端加密会议将不支持电话桥、云录音或非Zoom会议室系统。如果主持人明确允许，缩放房间和缩放电话参与者将能够参加。加密密钥将由主持人严格控制，主持人将允许与会者参加。我们相信，这将提供与现有消费者端到端加密信息平台同等或更好的安全性，但视频质量和规模使Zoom成为3亿多名每日会议参与者的选择，其中包括一些世界上最大的企业的与会者。\n在我们做这项工作以进一步保护我们用户的隐私的同时，我们也意识到我们希望防止使用Zoom的产品造成伤害。为此，我们会采取以下步骤：\n我们将继续与用户合作，以增强会议主持人可用的报告机制，以报告不想要的和破坏性的与会者。\nZoom不会也不会主动监控会议内容，但我们的信任和安全团队将继续使用自动化工具，根据其他可用的数据寻找滥用用户的证据。\nZoom没有也不会为合法拦截目的建立解密现场会议的机制。\n我们也没有办法将我们的员工或其他人插入到会议中，而不会在参与者列表中反映出来。我们不会建立任何加密后门来允许秘密监视会议。\n我们致力于在构建我们的端到端加密产品时保持透明和开放。我们计划在5月22日(星期五)公布详细的密码设计草案。然后，我们将主持与公民社会、密码专家和客户的讨论部分，以分享更多细节并征求反馈。一旦我们评估了集成到最终设计中的反馈，我们将宣布我们的工程里程碑和部署给Zoom用户的目标。\n我们期待着欢迎Keybase团队的到来，并对我们可以共同构建的可能性感到兴奋。\n本新闻稿包含1995年“私人证券诉讼改革法”中与Zoom收购Keybase有关的明示和暗示的“前瞻性陈述”，这些陈述涉及重大风险、不确定性和假设，可能导致实际结果与此类陈述明示或暗示的结果大不相同。本通讯中的前瞻性陈述包括有关交易的潜在利益、我们的端到端加密产品的开发、我们整合密钥库团队的能力以及潜在增长机会等方面的陈述。在某些情况下，您可以通过诸如“预期”、“相信”、“估计”、“预期”、“打算”、“可能”、“可能”、“计划”、“项目”、“将”、“将”、“应该”等术语来识别前瞻性陈述。在某些情况下，您可以通过“预期”、“相信”、“估计”、“预期”、“打算”、“可能”、“计划”、“项目”、“将会”、“将会”、“应该”等术语来识别前瞻性陈述。“”可以“，”“可以”“预测”、“潜在”、“目标”、“探索”、“继续”或这些术语的否定，以及旨在识别前瞻性陈述的类似表达。然而，并不是所有的前瞻性陈述都包含这些标识性的词语。就其性质而言，这些陈述会受到许多不确定因素和风险的影响，包括我们无法控制的因素，这些因素可能会导致实际结果、业绩或成就与陈述中预期或暗示的大不相同。这些假设、不确定性和风险包括，除其他外，交易的预期收益没有按预期实现的可能性，或者根本没有实现，管理层的注意力从正在进行的业务运营和机会中分散，对业务或员工关系的潜在不利反应或变化，成功整合Keybase的能力，以及可能影响Zoom未来结果的其他因素。可能导致实际结果和结果与前瞻性陈述预期的结果大不相同的其他风险和不确定因素包括在“风险因素”标题下以及我们最近提交给美国证券交易委员会的文件中的其他部分。这些风险和不确定因素可能导致实际结果和结果与前瞻性陈述中预期的结果大不相同，这些风险和不确定因素包括在我们提交给美国证券交易委员会的最新文件中的“风险因素”和其他地方。包括我们截至2020年1月31日的Form 10-K年度报告。前瞻性陈述只在陈述发表之日发表，并基于陈述发表时Zoom可获得的信息和/或管理层截至那时对未来事件的善意信念。除非法律要求，否则Zoom没有义务更新前瞻性陈述，以反映它们发表后的事件或情况。", "note_en": "We are proud to announce the acquisition of Keybase, another milestone in Zoom’s 90-day plan to further strengthen the security of our video communications platform. Since its launch in 2014, Keybase’s team of exceptional engineers has built a secure messaging and file-sharing service leveraging their deep encryption and security expertise.  We are excited to integrate Keybase’s team into the Zoom family to help us build end-to-end encryption that can reach current Zoom scalability.\n This acquisition marks a key step for Zoom as we attempt to accomplish the creation of a truly private video communications platform that can scale to hundreds of millions of participants, while also having the flexibility to support Zoom’s wide variety of uses. Our goal is to provide the most privacy possible for every use case, while also balancing the needs of our users and our commitment to preventing harmful behavior on our platform. Keybase’s experienced team will be a critical part of this mission.\n  Today, audio and video content flowing between Zoom clients (e.g., Zoom Rooms, laptop computers, and smartphones running the Zoom app) is encrypted at each sending client device.  It is not decrypted until it reaches the recipients’ devices. With the recent Zoom 5.0 release, Zoom clients now support encrypting content using industry-standard AES-GCM with 256-bit keys. However, the encryption keys for each meeting are generated by Zoom’s servers. Additionally, some features that are widely used by Zoom clients, such as support for attendees to call into a phone bridge or use in-room meeting systems offered by other companies, will always require Zoom to keep some encryption keys in the cloud. However, for hosts who seek to prioritize privacy over compatibility, we will create a new solution.\n  Zoom will offer an end-to-end encrypted meeting mode to all paid accounts. Logged-in users will generate public cryptographic identities that are stored in a repository on Zoom’s network and can be used to establish trust relationships between meeting attendees. An ephemeral per-meeting symmetric key will be generated by the meeting host. This key will be distributed between clients, enveloped with the asymmetric keypairs and rotated when there are significant changes to the list of attendees. The cryptographic secrets will be under the control of the host, and the host’s client software will decide what devices are allowed to receive meeting keys, and thereby join the meeting. We are also investigating mechanisms that would allow enterprise users to provide additional levels of authentication.\n These end-to-end encrypted meetings will not support phone bridges, cloud recording, or non-Zoom conference room systems. Zoom Rooms and Zoom Phone participants will be able to attend if explicitly allowed by the host. Encryption keys will be tightly controlled by the host, who will admit attendees.  We believe this will provide equivalent or better security than existing consumer end-to-end encrypted messaging platforms, but with the video quality and scale that has made Zoom the choice of over 300 million daily meeting participants, including those at some of the world’s largest enterprises.\n As we do this work to further protect our users’ privacy, we are also cognizant of our desire to prevent the use of Zoom’s products to cause harm. To that end, we will be taking the following steps:\n We will continue to work with users to enhance the reporting mechanisms available to meeting hosts to report unwanted and disruptive attendees.\n Zoom does not and will not proactively monitor meeting contents, but our trust and safety team will continue to use automated tools to look for evidence of abusive users based upon other available data.\n Zoom has not  and will not  build a mechanism to decrypt live meetings for lawful intercept purposes.\n We also do not have a means to insert our employees or others into meetings without being reflected in the participant list. We  will not build any cryptographic backdoors to allow for the secret monitoring of meetings.\n  We are committed to remaining transparent and open as we build our end-to-end encryption offering. We plan to publish a detailed draft cryptographic design on Friday, May 22. We will then host discussion sections with civil society, cryptographic experts, and customers to share more details and solicit feedback. Once we have assessed this feedback for integration into a final design, we will announce our engineering milestones and goals for deploying to Zoom users.\n We look forward to welcoming the Keybase team and are excited for the possibilities of what we can build together.\n  This communication contains express and implied “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995 related to Zoom’s acquisition of Keybase that involves substantial risks, uncertainties and assumptions that could cause actual results to differ materially from those expressed or implied by such statements. Forward-looking statements in this communication include, among other things, statements about the potential benefits of the transaction, our development of our end-to-end encryption offering, our ability to integrate the Keybase team, and potential growth opportunities.  In some cases, you can identify forward-looking statements by terms such as “anticipate,” “believe,” “estimate,” “expect,” “intend,” “may,” “might,” “plan,” “project,” “will,” “would,” “should,” “could,” “can,” “predict,” “potential,” “target,” “explore,” “continue,” or the negative of these terms, and similar expressions intended to identify forward-looking statements. However, not all forward-looking statements contain these identifying words. By their nature, these statements are subject to numerous uncertainties and risks, including factors beyond our control, that could cause actual results, performance or achievement to differ materially and adversely from those anticipated or implied in the statements. These assumptions, uncertainties and risks include that, among others, the possibility that the anticipated benefits of the transaction are not realized when expected or at all, division of management’s attention from ongoing business operations and opportunities, potential adverse reactions or changes to business or employee relationships, the ability to integrate Keybase successfully, and other factors that may affect future results of Zoom.  Additional risks and uncertainties that could cause actual outcomes and results to differ materially from those contemplated by the forward-looking statements are included under the caption “Risk Factors” and elsewhere in our most recent filings with the Securities and Exchange Commission (the “SEC”), including our annual report on Form 10-K for the year ended January 31, 2020. Forward-looking statements speak only as of the date the statements are made and are based on information available to Zoom at the time those statements are made and/or management’s good faith belief as of that time with respect to future events.  Zoom assumes no obligation to update forward-looking statements to reflect events or circumstances after the date they were made, except as required by law.", "posttime": "2020-05-07 21:16:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "需要,acquires,zoom", "title": "缩放需要密钥库", "title_en": "Zoom Acquires Keybase", "transed": 1, "url": "https://blog.zoom.us/wordpress/2020/05/07/zoom-acquires-keybase-and-announces-goal-of-developing-the-most-broadly-used-enterprise-end-to-end-encryption-offering/", "via": "", "real_tags": ["需要", "acquires", "zoom"]}, {"category": "", "categoryclass": "", "imagename": "ba3cffb1522c44bf1e389cbd55d8a819.jpg", "infoid": 1001084, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司遭遇集体诉讼，声称该公司隐瞒了一些2016年MacBook Pro用户遇到的所谓舞台灯光问题。由于受影响的MacBook Pro显示屏底部发出异常的背光图案，被称为舞台照明，问题与笔记本电脑盖子反复打开和关闭时的线缆应力或撕裂有关。苹果最终在2019年启动了该问题的修复计划，并悄悄修复了下一代MacBook的罪魁祸首。周三，洛杉矶居民Mahan Taleshour向加利福尼亚州北区美国地区法院提出申诉，称苹果意识到其产品存在缺陷，没有向消费者披露这一问题。原告声称，他的2016款15英寸MacBook Pro在2020年1月经历了舞台灯光效果，但由于维修计划仅涵盖2016年发布的13英寸MacBook Pro机型，显示屏维修的全部费用由他负责。他补充说，修理显示器的费用报价为850美元，并补充说，自从冠状病毒爆发以来，他一直无法修理设备。舞台灯光效果被描述为显示屏底部的明暗交替斑块，起诉书指出，一些MacBook Pro机型在背光线严重损坏后出现了完全的显示屏故障。维修显示电缆通常是一项昂贵的服务，因为它需要更换整个显示单元。在对苹果推销有缺陷的产品并未能实施质量控制的投诉中，诉讼还声称该公司在这件事上的行为是非法的，违反了消费者法律补救法案和宋比弗利消费者保证法(Song-Beverly Consumer Warranty Act)。原告还指控苹果隐瞒显示屏线缆问题是恶意的、压抑的、蓄意的，意在欺诈。原告要求官方披露显示屏线缆的缺陷、MacBook Pro维修费用或经济损失的赔偿、将AppleCare和Repair计划服务扩展到15英寸机型以及律师费的问题，并要求官方披露这些显示线缆的缺陷性质、赔偿MacBook Pro维修费用或经济损失、将AppleCare和Repair计划服务扩展到15英寸机型以及法律费用等方面的信息，并指控苹果公司对显示屏电缆问题的隐瞒是恶意的、压抑的、蓄意的。原告要求官方披露显示屏电缆的缺陷性质、MacBook Pro维修费用或经济损失赔偿、将AppleCare和Repair计划服务扩展到15英寸机型，以及法律费用。", "note_en": "Apple has been hit with a class-action lawsuit claiming that the company concealed the so-called &#34;stage lighting&#34; issue experienced by some 2016 MacBook Pro owners.     Dubbed &#34;stage lighting&#34; due to abnormal backlighting patterns emanating from the bottom of an impacted MacBook Pro&#39;s display, the  problem was tied to stress or tearing on the laptop&#39;s cable when the lid was opened and closed repeatedly. Apple eventually launched a  repair program for the issue in 2019 and  quietly fixed the underlying culprit in the next generation of MacBook.  On Wednesday, Los Angeles resident Mahan Taleshpour lodged a complaint in the U.S. District Court of the Northern District of California alleging that Apple was aware of the defect in its product and failed to disclose the issue to consumers.   The plaintiff claims that his 2016 15-inch MacBook Pro experienced stage lighting effects in January 2020, but he was left responsible for the full cost of the display repair due to the fact that the repair program only covers 13-inch MacBook Pro models released in 2016. He added that the cost to repair the display was quoted as $850, adding that he&#39;s been unable to repair the device since the  COVID-19 outbreak.   The &#34;stage lighting&#34; effect is described as alternating patches of light and darkness at the bottom of the display, and the complaint points out that some MacBook Pro models experience complete display failure after significant backlight cable damage. Repairing the display cable is often a costly service, since it requires the entire display unit to be replaced.   Among complaints that Apple promoted a defective product and failed to exercise quality control, the lawsuit also claims that the company&#39;s conduct in the matter was unlawful and violated the Consumers Legal Remedies Act and the Song-Beverly Consumer Warranty Act.  It also levies allegations that Apple&#39;s &#34;concealment&#34; of the display cable issue was &#34;malicious, oppressive, deliberate&#34; and &#34;intended to defraud.&#34;  The plaintiff is seeking an official disclosure about the &#34;defective nature&#34; of the display cables, restitutions for MacBook Pro repair costs or economic losses, an expansion of AppleCare and repair program service to 15-inch models, and legal fees.", "posttime": "2020-05-07 21:02:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "macbook-pro,苹果,apple,macbook,app", "title": "苹果就2016 MacBook Pro“Stage Lighting”问题提起诉讼", "title_en": "Apple Sued Over 2016 MacBook Pro 'Stage Lighting' Issue", "transed": 1, "url": "https://appleinsider.com/articles/20/05/06/apple-sued-over-2016-macbook-pro-stage-lighting-issue", "via": "", "real_tags": ["苹果", "apple", "macbook", "app"]}, {"category": "", "categoryclass": "", "imagename": "b5225fe00f12a24f7cd2ad854f2b71d5.jpg", "infoid": 1001083, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "3月27日，当我听说一名同事死于冠状病毒时-这是大都会运输局的第一例-时，我想，“事情开始了。”更多的死亡接踵而至，经常是一天不止一次。一些我过去每天都会见到的人和拳头碰在一起。\n在Facebook上，当坏消息传来时，我和同事们都会表达悲痛，并向家属表示哀悼。但我们的自发反应是旁观者麻木的好奇心。我们知道这会发生的。我们知道我们中的许多人无法挺过这场大流行。\n每天，我都会看到MTA工人小组页面上的帖子，语气欢快：“哦，上帝，我们开始了。我有症状了，14天后见。或者不会。“。\n我们在震中工作，死亡率大大高于急救人员。常识告诉你，地铁列车和站台是这种病毒的巨大载体。我们把它和钢尘一起吸入。作为一名列车员，当我把头伸出车厢外进行所需的站台观察时，许多车站的乘客都站在离我脸10英寸的地方。在其他时候，他们会靠在出租车里问问题。公交车司机的情况更糟，他们的乘客就在他们前面进入。\n我的同事想锁上机组人员乘坐的两节车厢的车门。公共汽车司机想让乘客从后门进入。我们想要危险津贴和照看孩子的家庭假。\n3月中旬，一份公告发布，要求列车长每15分钟发布一次公告。洗手，肥皂和水，消毒液，肘部打喷嚏。“共同努力，我们可以帮助维护纽约的安全。”\n具有讽刺意味的是，我们没有肥皂和水。在我当时的航站楼，卫生间在自来水管道中断后关闭了三天。大多数员工洗手间的状况也同样糟糕。船员房间都挤得水泄不通。\nMTA对没有戴护目镜或棉织安全手套的工人采取严厉的行动。然而，我们不得不在没有防范冠状病毒的情况下工作。\n起初我们被警告不要戴口罩。MTA表示，这会让公众感到恐慌。上面说口罩对我们来说很危险。后来，它说我们可以戴上我们自己买的口罩。但到那时，几乎没有口罩可供出售。\n疫情宣布一周后，TWU Local 100的一位副总裁来到我的航站楼做报告。我义愤填膺地站起来，问为什么我们没有收到口罩。我被告知健康人不需要口罩，医生更需要口罩。医生不是很健康吗？没人接。橡胶手套和洗手液怎么样？没人接。\n最后，MTA同意向我们提供个人防护装备。签到时，我们会得到一个N95口罩和三小包湿巾，大小相当于在医生办公室打针前使用的那些。这将持续三天。我们还从调度员办公室的瓶子里拿了一个小容器来装满洗手液。\n这些面具的制作很便宜。我的同事抱怨说，口罩捏住了他们的鼻子。带子很容易折断。许多口罩必须用管道胶带固定。\n或者说我是这么听说的。副总统来访两天后，我出现严重的身体疼痛、寒战和干咳。3月27日，我早上6点醒来。去洗手间然后晕倒了。我给一位密友打了个简短的电话，然后拨打了911。一辆救护车把我送到纽约大学朗格尼医疗中心，在那里我接受了治疗并出院了。我与世隔绝了14天，之后我感觉好多了。我的同事告诉我有一个地方可以让我做测试。4月15日，我的检测呈阳性。进一步隔离。我的直接存款对账单显示692美元：不到我第一个支付期工资的一半，此后就什么都没有了。(我已经用完了所有的病假)。\n我听说的第三个死亡案例是我每天都会见到的一位黑人同事，他曾经看过我读米歇尔·亚历山大的“新吉姆·克罗”(The New Jim Crow)。他想知道为什么一位来自印度的妇女会对黑人的状况感兴趣。从那时起，每当我们相遇时，我们就拥抱和亲吻对方的脸颊。\n当我的N次列车和我的R次列车到达大西洋大道时，我经常和站台对面的另一位同事交谈。他是参与快速运输行动的仅有的两名东正教犹太人之一。作为一名火车爱好者，他有一次注意到连接一节车厢和另一节车厢的电缆松动了，危险地挂在第三根铁轨附近。他那天可能救了很多人的命。现在他也死了。\n我们偶然发现了身体。我知道有两个案子。一名火车操作员在两节车厢之间行走时，差点被一辆车绊倒。另一个人笔直地坐在售票员窗外的长凳上，直到8小时轮班结束时，我的同事们才发现他在每次旅行中都会注意到这个人，然后才发现自己已经死了。\n大流行创造的条件让人们清楚地认识到，我们基本工人-一般工人-是那些防止社会秩序陷入混乱的人。然而，我们却被极不尊重地对待，好像我们是可有可无的牺牲品。自3月27日以来，至少有98名纽约运输工人死于冠状病毒。我的同事苦口婆心地说：“我们不是必需的。我们是牺牲品。“。\n这可能是个人的情况，但不是在我们的人数中。希望这次经历能让我们清楚地看到我们在维持社会运行中所起的关键作用，这样我们才能捍卫我们的利益，捍卫我们的生命。比如匹兹堡的环卫工人罢工，要求提供防护设备。就像通用电气的工人呼吁公司改变工厂用途，生产通风机，而不是喷气式发动机。\n我在4月30日参加了第二次考试。结果是阴性的。明天，我会回去工作。\n苏雅塔·吉德拉(Sujatha Gidla)是一名MTA指挥家，著有“大象中的蚂蚁：贱民家庭和现代印度的形成”一书。\n“泰晤士报”致力于向编辑发表各种信件。我们想听听您对这篇文章或我们的任何一篇文章的看法。这里有一些小贴士。这是我们的电子邮件：Letters@nytimes.com。", "note_en": "When I heard that a co-worker had died from Covid-19 — the first in the Metropolitan Transportation Authority — on March 27, I thought, “It’s starting.” More deaths followed in quick succession, frequently more than once a day. Some of those people I used to see every day and fist bump.\n On Facebook, when bad news comes, my co-workers and I express grief and offer condolences to the families. But our spontaneous response is the numb curiosity of an onlooker. We knew this was coming. We knew many among us wouldn’t make it through the pandemic.\n Every day I see posts on the M.T.A. workers’ group pages striking a jaunty tone: “Oh Lord, here we go. I got the symptoms, see you all in 14 days. Or not.”\n We work at the epicenter of the epicenter, with a mortality rate  substantially higher than that of first responders. Common sense tells you that subway trains and platforms are giant vectors of this virus. We breathe it in along with steel dust. As a conductor, when I stick my head out of the car to perform the required platform observation, passengers in many stations are standing 10 inches from my face. At other times, they lean into the cab to ask questions. Bus drivers, whose passengers enter right in front of them, are even worse off.\n My co-workers want doors locked on the two cars where the crew rides. Bus drivers want to let passengers enter through the back doors. We want hazard pay and family leave for child care.\n  In mid-March, a bulletin came out mandating that conductors make an announcement every 15 minutes. Wash hands, soap and water, sanitizer, elbow-sneeze. “Together we can help keep New York safe.”\n The irony was that we didn’t have soap and water. At my terminal at that time, the restrooms were closed for three days after a water main break. Most employee restrooms are in similarly bad shape. Crew rooms are packed.\n The M.T.A. takes stern action against workers seen without goggles or cotton knit safety gloves. Yet we had to work without protection against the coronavirus.\n At first we were warned not to wear masks. The M.T.A. said it would panic the public.  It said masks were dangerous for us. Later it said we could wear masks we bought ourselves. But by then there were few masks for sale.\n One week after the pandemic was declared, a vice president of TWU Local 100 came to my terminal to give a talk. I rose to my feet in outrage and asked why we weren’t receiving masks. I was told healthy people didn’t need masks and that doctors needed them more. Aren’t doctors healthy? No answer. How about rubber gloves and hand sanitizer? No answer.\n Finally, the M.T.A.  agreed to supply us with personal protective equipment. When signing in, we get an N95 mask and three small packets of wipes the size of those used before a shot at the doctor’s office. This is meant to last three days. We also get a small container to fill with hand sanitizer from a bottle in the dispatcher’s office.\n The masks are cheaply made. My co-workers complain that the masks pinch their noses. The straps break easily. Many masks must be secured with duct tape.\n Or so I have heard. Two days after the vice president’s visit, I developed severe body aches, chills and a dry cough. On March 27, I woke up at 6 a.m. to go to the bathroom and collapsed. I made a quick call to a close friend and then dialed 911. An ambulance took me to NYU Langone Medical Center, where I was treated and discharged. I stayed isolated for 14 days, after which I felt better. My co-workers told me about a place where I could get tested. On April 15, I tested positive. Further quarantine. My direct-deposit statement shows $692: less than half my wages for the first pay period and nothing thereafter. (I had used up all of my sick days).\n The third death I heard about was a black co-worker I used to see every day who once saw me reading Michelle Alexander’s “The New Jim Crow.” He wanted to know why a woman from India was interested in the condition of black people. From then on, whenever we ran into each other we hugged and cheek-kissed.\n I used to talk to another co-worker across the platform when his N train and my R train reached Atlantic Avenue. He was one of only two Orthodox Jews in the rapid transit operation. A train buff, he once noticed that a cable that connects one car to another had come loose and was hanging dangerously near the third rail. He may have saved lives that day. Now he’s dead, too.\n We are stumbling upon dead bodies. I know of two cases. A train operator nearly tripped over one while walking between cars. The other person was sitting upright on a bench right outside the conductor’s window and discovered to be dead only at the end of an eight-hour shift after my co-workers kept noticing the person on each trip.\n The conditions created by the pandemic drive home the fact that we essential workers — workers in general — are the ones who keep the social order from sinking into chaos. Yet we are treated with the utmost disrespect, as though we’re expendable. Since March 27, at least 98 New York transit workers have died of Covid-19. My co-workers say bitterly: “We are not essential. We are sacrificial.”\n That may be true individually, but not in our numbers. Hopefully this experience will make us see clearly the crucial role we play in keeping society running so that we can stand up for our interests, for our lives. Like the Pittsburgh sanitation workers walking out to demand protective equipment. Like the G.E. workers calling on the company to repurpose plants to make ventilators instead of jet engines.\n I took my second test on April 30. It was negative. Tomorrow, I will go back to work.\n Sujatha Gidla, an M.T.A. conductor, is the author of “ Ants Among Elephants: An Untouchable Family and the Making of Modern India.”\n The Times is committed to publishing   a diversity of letters  to the editor. We’d like to hear what you think about this or any of our articles. Here are some   tips . And here’s our email:   letters@nytimes.com .", "posttime": "2020-05-07 21:01:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "必需,essential,口罩", "title": "他说，我们不是必需的。我们是牺牲品。", "title_en": "‘We Are Not Essential. We Are Sacrificial.’", "transed": 1, "url": "https://www.nytimes.com/2020/05/05/opinion/coronavirus-nyc-subway.html", "via": "", "real_tags": ["必需", "essential", "口罩"]}, {"category": "", "categoryclass": "", "imagename": "b28a6f0d19e30f14047cf2e73f0e57a3.jpg", "infoid": 1001081, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加拿大莱斯布里奇的三名警察在向一名穿着冲锋衣、配有塑料爆破器的女子拔枪后正在接受调查。\n据CTV新闻报道，这名19岁的女子-被确认为阿什利-在工作过程中穿着这套服装，她是可可香草银河酒吧的一名员工，这是一家以星球大战为主题的餐厅，在冠状病毒(CoronaVirus)爆发前刚刚开业。这家餐厅正在推广他们的特价5月4日驾车和外卖菜单，菜单上有一名跳舞的冲锋队。\n在视频中，可以看到阿什利放下爆破器，试图在警察包围她时趴在地上，但由于服装僵硬，她无法做到这一点。然后，警官们将她推倒在地，摘下头盔，给她戴上手铐，并轻拍冲锋队的服装。就在阿什利的老板、酒吧老板布拉德·惠伦(Brad Whalen)向警方尖叫说阿什利拿着一把塑料枪的同时，视频的作者走近警察，告诉他们同样的事情。然而，警察指示他退后，不要干预。\n鉴于加拿大警方对待枪支报告的严肃性，莱斯布里奇警察局长已经对回应警官的行为展开了调查，以评估他们的回应是否恰当。加拿大仍在从4月的新斯科舍省大屠杀中恢复过来，在那次大屠杀中，一名男子疯狂杀戮，杀害了22人，并促使加拿大政府驱逐了所有攻击性武器。\n虽然警方没有提出指控，但惠伦声称阿什利流了鼻血，并表达了他对这种情况的惊讶。惠伦说，有时候你真的得用常识。当所有的东西都装进盒子里时--你有了标志，你就有了音乐和气氛。&34；惠伦说，当所有的东西都装进盒子里--你有了标志，你就有了音乐，就有了气氛。&34；惠伦说，当所有东西都装进盒子里时，你就有了音乐，就有了气氛。", "note_en": "Three police officers of Lethbridge, Canada are under investigation after pulling their guns on a woman wearing a stormtrooper costume, complete with a plastic blaster.\n According to   CTV News, the 19-year-old woman -- identified as Ashley -- was wearing the costume in the course of her work as an employee of Coco Vanilla Galactic Cantina, a   Star Wars-themed restaurant that had opened right before the coronavirus (COVID-19) outbreak. The restaurant was promoting its special May the 4th drive-by and takeaway menus with a dancing stormtrooper.\n     In the video, Ashley can be seen dropping the blaster and trying to get on the ground as the officers surround her but being unable to do so due to the rigidity of the costume. The officers then push her down, remove the helmet, handcuff her and pat down the stormtrooper costume. At the same time as Ashley&#39;s boss Brad Whalen, the owner of the Cantina, screamed to the police that Ashley was holding a plastic gun, the author of the video approached the officers to tell them the same thing. The police, however, instructed him to stay back and not interfere.\n Lethbridge&#39;s Chief of Police has opened an investigation into the actions of the responding officers to evaluate whether their response was appropriate, given the seriousness with which the Canadian police takes firearm reports. Canada is still recovering from April&#39;s Nova Scotia massacre, where a man went on a killing spree, murdering 22 people and prompting the Canadian government to banish all assault weapons.\n  Although the police didn&#39;t press charges, Whalen claims that Ashley got a bloody nose and expressed his astonishment at the situation. &#34;Sometimes you really have to use common sense,&#34; Whalen said. &#34;When all the things fit in the box — you&#39;ve got the signs, you&#39;ve got the music, the atmosphere.&#34;", "posttime": "2020-05-07 20:04:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "袭击,shatner,警察", "title": "威廉·沙特纳被5月4日冲锋枪袭击的警察弄得心烦意乱", "title_en": "William Shatner Upset By Police Who Drew Guns Upon Stormtrooper On May 4th", "transed": 1, "url": "https://www.cbr.com/star-wars-stormtrooper-fake-blaster/", "via": "", "real_tags": ["袭击", "shatner", "警察"]}, {"category": "", "categoryclass": "", "imagename": "9bc659aaa10e3052f56a97c983c1444f.jpg", "infoid": 1001080, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ZDNet获悉，本周4400万巴基斯坦移动用户的详细信息在网上泄露。\n上个月，一名黑客试图以210万美元的比特币价格出售一个包含1.15亿巴基斯坦移动用户记录的套餐，随后发生了这起泄密事件。\nZDNet已经获得了这两个数据集的副本。我们收到了今天在网上发布的全部4400万条记录，但我们还收到了5500万条用户记录的样本，这些记录是1.15亿条数据转储的一部分。根据数据集，我们可以得出结论，这两者是相同的。\n根据我们对泄露文件的分析，这些数据既包含个人身份信息，也包含与电话有关的信息。这包括以下内容：\n公司的详细信息与公司网站上列出的公共记录和公共电话号码相匹配。此外，ZDNet还与多名巴基斯坦用户核实了泄露数据的有效性。\n根据订阅日期，泄露文件中最古老的条目来自2013年末，这表明黑客要么获得了更旧的备份文件，要么入侵发生在2013年，直到现在才在网上浮出水面。\n泄露文件中的绝大多数条目都包含属于巴基斯坦移动运营商Jazz(前身为MobiLink)的手机号码。然而，ZDNet也识别出似乎属于其他移动运营商的电话号码。\n因此，我们不能根据实际和有形的证据得出数据来自Jazz服务器的结论。目前，尚不清楚这些数据来自Jazz本身、政府组织、Jazz合作伙伴还是电话营销公司。\nJazz发言人没有回复记者的置评请求；然而，该公司此前否认数据来自其服务器。\n巴基斯坦已经在调查这起事件，自上个月一名黑客首次试图在黑客论坛上出售全部1.15亿批产品以来，巴基斯坦电信管理局(PTA)和联邦调查局(FIA)一直在调查此事。\n最先发现4月份论坛广告并分析数据样本的威胁情报公司Rewterz也得出结论，数据是真实的，也避免直接指责爵士，缺乏任何证据。", "note_en": "The details of 44 million Pakistani mobile subscribers have leaked online this week,  ZDNet has learned.\n The leak comes after a hacker tried to sell a package containing 115 million Pakistani mobile user records last month for a price of $2.1 million in bitcoin.\n ZDNet has obtained copies of both data sets. We received the entire 44 million records released online today, but we also received a sample of 55 million user records that were part of the 115 million data dump. Based on the data sets, we can conclude that the two are the same.\n According to our analysis of the leaked files, the data contained both personally-identifiable and telephony-related information. This includes the likes of:\n     Details for companies matched public records and public phone numbers listed on companies&#39; websites. In addition, ZDNet also verified the validity of the leaked data with multiple Pakistani users.\n  Based on the dates of subscription, the oldest entries in the leaked files are from late 2013, suggesting that hackers either got their hands on an older backup file, or the breach took place in 2013, and only now surfaced online.\n   The vast majority of entries in the leaked files contained mobile phone numbers belonging to Jazz (formerly Mobilink), a Pakistani mobile operator. However,  ZDNet also identified phone numbers that appeared to belong to other mobile operators.\n As a result, we could not conclude based on actual and tangible evidence that the data was taken from Jazz servers. Currently, it is unclear if the data came from Jazz itself, a government organization, a Jazz partner, or a telemarketing firm.\n A Jazz spokesperson did not reply to a request for comment; however, the company previously disputed that the data came from its servers.\n The incident is already  under investigation in Pakistan, where the Pakistan Telecommunication Authority (PTA) and the Federal Investigation Agency (FIA) are looking into the matter since last month when a hacker first tried to sell the entire 115 million batch on a hacker forum.\n Threat intelligence company  Rewterz, which first spotted the April forum ad and analyzed data samples, also concluded that the data was real, and also avoided directly blaming Jazz, lacking any evidence.", "posttime": "2020-05-07 20:03:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "缓存,移动用户,million,数据", "title": "4400万巴基斯坦移动用户的详细信息在网上泄露，是更大的1.15亿缓存的一部分", "title_en": "Details of 44 Million Pakistani Mobile Users Leaked Online, Part of Bigger 115 Million Cache", "transed": 1, "url": "https://www.zdnet.com/article/details-of-44m-pakistani-mobile-users-leaked-online-part-of-bigger-115m-cache/", "via": "", "real_tags": ["缓存", "移动用户", "million", "数据"]}, {"category": "", "categoryclass": "", "imagename": "4b42708e6dd81549551e104b928c87bc.jpg", "infoid": 1001079, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在培养皿中生长的迷你大脑在感染导致冻疮的常见疱疹病毒时，很快就会出现阿尔茨海默氏症的迹象。这一发现增加了越来越多的证据，表明一些阿尔茨海默氏症病例是由病毒引发的，可能会用抗病毒药物治疗。\n阿尔茨海默病的一个主要特征是在大脑中积聚了被称为β-淀粉样斑块的蛋白质块。一个新兴的学派认为，这些斑块起到了防御病毒和细菌的作用，这些病毒和细菌有时会设法进入大脑。\n单纯疱疹病毒-1(HSV-1)是一种与阿尔茨海默病有关的病毒，它会导致唇疱疹，并在体内终生停留。携带HSV-1病毒的人更容易患上阿尔茨海默氏症，在死于这种疾病的人的大脑中发现了高水平的疱疹病毒。\n为了了解HSV-1如何导致阿尔茨海默氏症，马萨诸塞州塔夫茨大学的达娜·凯恩斯和她的同事们将病毒添加到培养皿中生长的脑组织块中。他们用人体干细胞填充甜甜圈形状的支架，然后诱使其形成脑细胞，从而制造出迷你大脑。\n在感染HSV-1的三天内，迷你大脑形成了大的β-淀粉样斑块，这让人想起阿尔茨海默病患者大脑中发现的那些斑块。迷你大脑还显示出这种情况的其他迹象，如炎症和脑细胞丢失。\n相比之下，当用万乃洛韦(一种常用的疱疹药物)治疗迷你大脑时，它们似乎受到保护，不受HSV-1的损害。凯恩斯说，这一发现支持了美国目前正在进行的一项临床试验，该试验正在测试万乃洛韦是否有助于治疗同样患有HSV-1的人的阿尔茨海默病。\n一个悬而未决的问题是，为什么在大约三分之二的50岁以下人群中发现的HSV-1似乎入侵了一些人的大脑，而不是另一些人的大脑。凯恩斯说，那些由于年龄或遗传因素而血脑屏障较弱的人可能面临更大的风险。\n凯恩斯和她的同事们现在希望测试其他微生物，如牙龈卟啉单胞菌，这是一种与阿尔茨海默氏症和牙龈疾病有关的细菌，是否也会在他们的大脑模型中导致斑块形成。\n注册我们的免费健康检查和时事通讯，每月综述您需要了解的所有健康和健身新闻", "note_en": "Mini-brains grown in a dish rapidly develop signs of Alzheimer’s disease when infected with the common herpes virus that causes cold sores. The finding adds to growing evidence that some cases of Alzheimer’s are triggered by viruses and could potentially be treated with antiviral drugs.\n A major hallmark of Alzheimer’s disease is the build-up in the brain of protein clumps called  beta-amyloid plaques. An emerging school of thought is that these plaques function as defences against viruses and bacteria that sometimes manage to get into the brain.\n Herpes simplex virus-1 (HSV-1), which causes cold sores and stays in the body for life, is one virus that has been linked to Alzheimer’s disease. People with HSV-1 are more likely to get Alzheimer’s, and high levels of herpes viruses have been found in the brains of people who died with the condition.\n   To understand how HSV-1 might cause Alzheimer’s disease, Dana Cairns at Tufts University in Massachusetts and her colleagues added the virus to clumps of brain tissue grown in dishes. They made the  mini-brains by filling doughnut-shaped scaffolds with human stem cells that were then coaxed into forming brain cells.\n  Within three days of being infected with HSV-1, the mini-brains developed large beta-amyloid plaques reminiscent of those found in the brains of people with Alzheimer’s disease. The mini-brains also showed other signs of the condition, such as inflammation and loss of brain cells.\n In contrast, when the mini-brains were treated with valacyclovir, a commonly used herpes drug, they seemed to be protected against HSV-1 damage. This finding lends support to a clinical trial currently under way in the US that is testing whether valacyclovir helps to treat Alzheimer’s disease in people who also have HSV-1, says Cairns.\n  One unresolved question is why HSV-1, which is found in about two-thirds of people under 50, seems to invade the brains of some people but not others. Those with weaker blood-brain barriers due to age or genetic factors may be more at risk, says Cairns.\n Cairns and her colleagues now hope to test whether other microbes, such as  Porphyromonas gingivalis, a bacterium that has been  linked with Alzheimer’s and gum disease, also cause plaque formation in their brain models.\n   Sign up to our free  Health Check newsletter for a monthly round-up of all the health and fitness news you need to know", "posttime": "2020-05-07 20:03:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "病毒,导致,herpes", "title": "常见疱疹病毒导致脑细胞出现阿尔茨海默病症状", "title_en": "Common Herpes Virus Causes Signs of Alzheimer's Disease In Brain Cells", "transed": 1, "url": "https://www.newscientist.com/article/2242749-common-herpes-virus-causes-signs-of-alzheimers-disease-in-brain-cells/", "via": "", "real_tags": ["病毒", "导致", "herpes"]}, {"category": "", "categoryclass": "", "imagename": "0818f7905b5afb9809650d2bb803b5bf.jpg", "infoid": 1001078, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "原型喷气发动机可以在不使用任何化石燃料的情况下自行推进，这可能为碳中性航空旅行铺平道路。\n根据周二发表在AIP Advance杂志上的研究，该设备压缩空气并用微波将其电离，产生推动空气向前的等离子体。这意味着飞机有朝一日可能只用电力和周围的空气作为燃料飞行。\n从概念验证原型到在真正的飞机上安装发动机，还有很长的路要走。但原型能够将一个重1公斤(2.2磅)的钢球发射到24毫米(几乎1英寸)的空中。这与传统喷气发动机的推力相同，与比例成正比。\n我们的研究结果表明，这种基于微波空气等离子体的喷气发动机可以成为传统化石燃料喷气发动机的一种潜在的可行替代品，武汉大学首席研究员兼工程师陶唐在一份新闻稿中表示。\n航空旅行在气候变化中只占很小的一部分，但并不是微不足道的。“纽约时报”(New York Times)在9月份报道称，商业航空排放的温室气体占所有温室气体排放量的2.5%-尽管这不包括军用喷气式飞机。\n唐在新闻稿中表示，我们工作的动机是帮助解决由于人类使用化石燃料内燃机为汽车和飞机等机械提供动力而导致的全球变暖问题。\n我们的设计不需要化石燃料，因此没有碳排放造成温室效应和全球变暖。", "note_en": "A prototype jet engine can propel itself without using any fossil fuels, potentially paving the way for carbon-neutral air travel.\n The device compresses air and ionizes it with microwaves, generating plasma that thrusts it forward,  according to research published Tuesday in the journal  AIP Advances. That means planes may someday fly using just electricity and the air around them as fuel.\n   There&#39;s a long way to go between a proof-of-concept prototype and  installing an engine in a real plane. But the prototype was able to launch a one-kilogram (2.2-pound) steel ball 24 millimeters (almost one inch) into the air. That&#39;s the same thrust, proportional to scale, as a conventional jet engine.\n &#34;Our results demonstrated that such a jet engine based on microwave air plasma can be a potentially viable alternative to the conventional fossil fuel jet engine,&#34; lead researcher and Wuhan University engineer Jau Tang  said in a press release.\n  Air travel represents a small but not insignificant portion factor of climate change.  The New York Times  reported in September that commercial air is responsible for 2.5 percent of all greenhouse gas emissions - though that excludes military jets.\n &#34;The motivation of our work is to help solve the global warming problems owing to humans&#39; use of fossil fuel combustion engines to power machinery, such as cars and airplanes,&#34; Tang said in the release.\n &#34;There is no need for fossil fuel with our design, and therefore, there is no carbon emission to cause greenhouse effects and global warming.&#34;", "posttime": "2020-05-07 20:03:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "科学家,化石,create,燃料", "title": "科学家创造了一种不使用化石燃料的“空气等离子体”发动机原型", "title_en": "Scientists Create a Prototype 'Air Plasma' Engine That Works Without Fossil Fuels", "transed": 1, "url": "https://www.sciencealert.com/scientists-have-created-a-fossil-fuel-free-jet-engine-prototype", "via": "", "real_tags": ["科学家", "化石", "create", "燃料"]}, {"category": "", "categoryclass": "", "imagename": "ab59032af71d6d9f114b4f79a2908923.jpg", "infoid": 1001077, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周早些时候，在没有任何警告的情况下，互联网上出现了一个Windows可执行文件，其中包含一个完全可以玩的超级马里奥64(Super Mario 64)PC端口。这个独立的程序远不只是一个普通的模拟ROM，它支持自动缩放到任何屏幕分辨率等功能，玩家已经在试验添加简单的显卡级别的重着色器，包括光线跟踪。\nPC端口--发布时几乎没有升级--并不像其他一些现已停产的Super Mario 64移植项目那样，是在现代游戏引擎中从头开始构建的。它的发布与最近任天堂内部文件的泄露无关，这些文件可以追溯到Gamecube时代。\n相反，这个移植似乎是一年来努力将Super Mario64ROM反编译成可解析的C代码的直接结果。这种从原始二进制代码到易读代码的逆向工程并不是一个简单的过程，但越来越多的业余反编译器社区正在努力解开他们最喜欢的一些游戏背后的秘密。\n两年的反编译超级马里奥64的努力并不是从一开始就考虑到Windows可执行文件的。肯尼克斯目前正在帮助领导从这项努力中剥离出来的塞尔达逆向工程团队(Zelda Reverse Engineering Team，简称ZRET)，他说，相反，它的主要动机是那些想要更好地理解游戏代码的速跑者，以便帮助发现那些[速跑]漏洞。(Kenix目前正在帮助领导从这项努力中剥离出来的塞尔达逆向工程团队(Zelda Reverse Engineering Team，简称ZRET)。\n对N64ROM进行反向工程的第一步是最基本的，就像首先找出使用了哪个特定版本的Silicon Graphics IDO编译器来创建ROM一样。这需要进行大量的试验和错误测试，在某些情况下，可以通过仔细解析泄漏的调试版本和隐藏在ROM文件中的源代码片段来帮助测试。Kenix告诉ARS，即使运行这样一个过时的编译器进行测试，也意味着模仿最初的N64开发人员使用的SGI工作站系统调用。\n下一步只是简单地找出ROM是如何组织的。&#34；您如何知道函数在哪里？“你怎么知道多边形或纹理数据在哪里？”肯尼克斯说。您必须分析ROM的内部结构，然后生成一种将其拆分成各种文件的方法。\n幸运的是，N64游戏将它们的文件安排在16字节的块中，这样可以更容易地看到标记文件末尾的空填充。还有一些游戏，比如Ocarina of Time，使用了一个易于解析的直接内存访问表，该表定义了原始ROM中的大多数文件边界(如今，像N64Split这样的工具可以自动执行这个过程)。游戏的调试版本还可以帮助反向工程师记录其结构，这要归功于存在未压缩的游戏文件和C宏，如__FILE__和__LINE__，它们揭示了任天堂使用的内部文件名。\n由于ROM的编译器和基本结构已知，简单的反编译技术可以生成一个庞大的原始汇编语言指令列表，这些指令将馈送到N64硬件。但是，将这些指令转换成人类可解析和容易编辑的C代码绝非一个简单的过程(而且将汇编代码转换为C的自动化工具通常会引入逻辑错误或使代码混淆得太严重)。\n因此，真正对N64ROM进行反向工程意味着逐个函数地检查这些汇编代码文件，并手动将它们转换成可用的C代码。与仿真不同的是，有时足够接近就足够了，但这里的精确度很重要。我们的目标是[在运行编译器之后]逐字节匹配游戏中所有函数的原始汇编代码，&#34；Kenix说。\n即使以这种方式转换少数汇编指令的一个小函数也可能是一个复杂的过程。但是，单个N64功能可能会运行数千条指令，而一款N64游戏可能会有数千条这样的功能(例如，在Ocarina of Time中，超过15，700个)。\n难度也可能因游戏而异。对于超级马里奥64，任天堂在编译源代码时没有任何花哨的编译器选项，这意味着反编译后的汇编语言更容易转换回C代码。然而，对于像“时间的奥卡莉娜”这样的游戏，任天堂使用优化标志来生成更快的代码，使得生成的ROM更难解开源代码。\nKenix说，当有优化标志时，对于&#39；vs&#39；While&#39；[Statement]等，很难将循环与&#39；匹配。您必须尝试所有等效的代码模式，直到找到匹配的模式。\n虽然ZRET领导层明白PC端口将是他们努力的自然结果，但Kenix表示，反向工程师认为这超出了我们的工作范围。我们只需反编译游戏即可。其他人不可避免地会拿起它并写入PC端口。&#34；\n但ZRET成员Rozlette指出，即使手头有反编译的C代码，制作PC端口也不像只是为Windows编译那么容易，ZRET成员罗兹莱特(Rozlette)指出。&#34；有很多代码处理与N64硬件的对话。例如，N64渲染管道与现代OpenGL有很大不同。", "note_en": "Early this week, with little warning, the Internet was graced with a Windows executable containing a fully playable PC port of  Super Mario 64. Far from being just a usual emulated ROM, this self-contained program enables features like  automatic scaling to any screen resolution, and players are already experimenting with  adding simple graphics-card-level reshaders, including ray-tracing, as well.\n The PC port—which was released with little buildup and almost no promotion—wasn&#39;t built from scratch in a modern game engine, in the manner of  some other now-defunct  Super Mario 64 porting projects. And its release has nothing to do with  a recent leak of internal Nintendo files dating back to the Gamecube days.\n Instead, the port seems to be a direct result of a years-long effort to  decompile the  Super Mario 64 ROM into parsable C code. This kind of reverse-engineering from raw binary to easy-to-read code isn&#39;t a simple process, but it&#39;s an effort that  a growing community of  hobbyist decompilers is undertaking to unlock the secrets behind some of their favorite games.\n  The two-year effort to decompile  Super Mario 64 wasn&#39;t started with a Windows executable in mind. Instead, it was motivated primarily by speedrunners who wanted &#34;to understand the game&#39;s code better in order to help find those [speedrunning] exploits,&#34; according to Kenix, who&#39;s currently helping to head the  Zelda Reverse Engineering Team (ZRET) that spun off from that effort.\n The first step in reverse-engineering an N64 ROM is as basic as figuring out which specific version of the  Silicon Graphics IDO compiler was used to create the ROM in the first place. This requires a lot of trial and error testing, helped in some cases by careful parsing of  leaked debug builds and  source code snippets left buried in the ROM files themselves. And even running such an outdated compiler for testing means emulating the SGI workstation system calls that original N64 developers used, Kenix told Ars.\n The next step is simply figuring out how the ROM is organized. &#34;How do you know where functions are? How do you know where polygon or texture data is?&#34; Kenix said. &#34;You have to analyze the internals of the ROM and then generate a way to split it into those various files.&#34;\n Fortunately, N64 games arrange their files in 16-byte chunks, which can make it easier to see the empty &#34;padding&#34; marking the end of a file. And some game, like  Ocarina of Time, use an easy-to-parse  direct-memory-access table that defines most of the file boundaries found in the original ROM (these days, a  tool like N64Split can automate this process). Debug builds of a game can also help reverse engineers document its structure, thanks to the presence of uncompressed game files and C macros like  __FILE__ and __LINE__ that reveal internal file names used by Nintendo.\n  With the ROM&#39;s compiler and basic structure known, simple decompilation techniques can generate a sprawling list of the raw assembly language instructions that are fed to the N64 hardware. But converting those instructions to C code that&#39;s parsable and easily editable by humans is far from a simple process (and  automated tools that convert that assembly code to C often introduce logic errors or obfuscate the code too severely).\n Thus, truly reverse-engineering an N64 ROM means going through those assembly code files function by function, converting them by hand into usable C code. And unlike emulation, where &#34;close enough&#34; is  sometimes sufficient, precision is important here. &#34;Our goal is to match byte for byte the original assembly code of all functions in the game [after running through the compiler],&#34; Kenix said.\n  Even converting a small function of a few assembly instructions in this manner  can be a complicated process. But individual N64 functions can run into the thousands of instructions, and a single N64 game can have thousands of such functions (over 15,700 in the case of  Ocarina of Time, for one example).\n The difficulty can vary by game, as well. For  Super Mario 64, Nintendo compiled its source code without any fancy compiler options, meaning the decompiled assembly language is simpler to convert back to C code. For a game like  Ocarina of Time, though, Nintendo used optimization flags to generate faster code, making the resulting ROM that much harder to untangle back into its source.\n &#34;When there are optimization flags, you have a harder time matching a loop to a &#39;for&#39; vs &#39;while&#39; [statement] etc.,&#34; Kenix said. &#34;You have to try all equivalent patterns of code until you find the one that matches.&#34;\n   While ZRET leadership understands that PC ports are going to be a natural result of their efforts, Kenix said reverse engineers &#34;consider that outside of the scope of what we do. We just decompile the game. Someone else will inevitably pick it up and write the PC port.&#34;\n But even with decompiled C code in hand, making a PC port is &#34;not as easy as just [saying] &#39;compile it for Windows,&#39;&#34; ZRET member Rozlette noted. &#34;There is a lot of code that deals with talking to N64 hardware. The N64 render pipeline is very different than modern OpenGL, for example.&#34;", "posttime": "2020-05-07 20:03:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "代码,逆向工程,源代码,massive", "title": "超越仿真：对N64源代码进行逆向工程的巨大努力", "title_en": "Beyond Emulation: the Massive Effort To Reverse-Engineer N64 Source Code", "transed": 1, "url": "https://arstechnica.com/gaming/2020/05/beyond-emulation-the-massive-effort-to-reverse-engineer-n64-source-code/", "via": "", "real_tags": ["代码", "逆向工程", "源代码", "massive"]}, {"category": "", "categoryclass": "", "imagename": "36c6213e8a31f1a81268b44808b09015.jpeg", "infoid": 1001076, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "许多智能家居设备制造商依靠订阅来保持稳定的资金流入，但Wink正在学习这种策略是如何很容易出错的。该公司已经宣布计划在5月13日开始每月订阅5美元(是的，离现在只有一周了)，而且这是强制性的。拒绝注册，你将无法访问应用程序中的设备以及所有自动操作。根据Wink的说法，“长期成本和最近的经济事件”(读作：冠状病毒)促使了这一举措，该公司不想出售用户数据来抵消免费运营服务的成本。\n如果你认为短时间的通知和硬切断的威胁都会激怒客户…。嗯，你说得对。Reddit用户和其他人被激怒了。他们被要求每月支付5美元才能继续使用家中已有的设备，一周的时间很少，他们没有时间权衡订阅的优点或寻找替代产品。“支付赎金，否则他们会毁了我们的智能家居，”一位用户说。\n我们已经请温克发表评论了。无论它如何回应，这一决定都突显了将你的智能家居系统建立在没有某种核心离线功能的免费服务上的风险。虽然这种系统只要持续使用就会非常诱人，但你也相信该公司可以无限期地保持这些免费服务的运行。如果不能，你的连接家庭可能会在没有任何警告的情况下变得毫无用处。", "note_en": "Many smart home device makers rely on subscriptions to keep a steady stream of money coming in, but  Wink is learning how that strategy can easily go wrong. The company has  announced plans to move to a $5 per month subscription on May 13th (yes, just one week from now), and it’s mandatory. Decline to sign up and you’ll lose access to devices in the app as well as all automations. “Long term costs and recent economic events” (read: COVID-19) prompted the move, according to Wink, and the company didn’t want to sell user data to offset the costs of running services for free.\n If you think that both the short notice and the threat of a hard cutoff will anger customers... well, you’re correct.  Reddit users and others are incensed. They’re being asked to pay $5 per month to keep using the devices they already have in their homes, and one week gives them very little time to either weigh the merits of a subscription or find alternatives. “Pay the ransom or they kill our smart homes,” one user said.\n  We’ve asked Wink for comment. However it responds, the decision highlights the risks of basing your smart home system around free services without some kind of core offline functionality. While that kind of system can be very alluring so long as it lasts, you’re also trusting that the company can keep those free services running indefinitely. If it can’t, your connected household might be rendered useless with little warning.", "posttime": "2020-05-07 20:02:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "智能家居,smart,免费", "title": "WINK智能家居用户有一周的时间订阅或被关闭", "title_en": "Wink Smart Home Users Have One Week To Subscribe Or Be Shut Off", "transed": 1, "url": "https://www.engadget.com/wink-monthly-subscription-234146666.html", "via": "", "real_tags": ["智能家居", "smart", "免费"]}, {"category": "", "categoryclass": "", "imagename": "c498edbbd607cf6a3532ee717845370f.png", "infoid": 1001075, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转到搜索Norsk数据是位于挪威奥斯陆的一家(小型)计算机制造商。它存在于1967年至1992年，在20世纪70年代初至80年代末是最活跃的时期。在1987年该公司的巅峰时期，它是挪威第二大公司，员工超过4500人。\n纵观诺斯克数据公司的历史，它生产了一长串极具创新性的系统，其中不成比例地创造了大量的世界第一。这方面的一些例子是NORD-1，第一台将内存分页作为标准选项的小型机，以及第一台具有浮点指令标准的机器，NORD-5，世界上第一台32位小型机(击败VAX，通常被称为第一台，比VAX早6年)。\nNorsk数据的起源可以追溯到挪威凯勒的挪威国防研究机构开发数字计算机的时候，那里已经设计了几台早期的计算机，如SAM和SAM 2，也被称为Flink。\n这一项目的成功促使Lars Monrad Krohn、Per Bjørge和Rolf Skçr于1967年8月8日成立了A/S Nordata-Norsk data Elektronikk。该公司成为许多研究项目的重要小型机供应商，特别是瑞士日内瓦的CERN，他们被选为许多项目生产计算机，从SPS项目[1]开始，这是Norsk Data的国际突破性合同。Norsk Data成功的其他细分市场包括过程控制、挪威市政管理数据中心、报纸以及部分教育、卫生和大学部门。\n在1987年的一段时间里，按股票价值计算，Norsk Data是挪威第二大公司，仅次于Norsk Hydro，雇佣了4500多名员工。\n1991年3月，在1月份的事件发生后不久，挪威数据公司向立陶宛数学和信息学研究所捐赠了第一台计算机。这笔捐款启动了立陶宛LITNET-学术和研究网络的发展。同年晚些时候，直接连接维尔纽斯和莫斯科的网络连接线被关闭。在同样由挪威数据公司捐赠的硬件的帮助下，立陶宛能够使用其第一个基于卫星的互联网连接，速度为9.6kbit/s，这是立陶宛第一条完全独立于前苏联的通信线路。[2]。\n在长期取得非凡成功后，诺斯克数据帝国在20世纪90年代初崩溃，主要原因是没有意识到个人电脑革命的影响(以及来自基于UNIX的工作站的日益激烈的竞争)。海豚公司延续了诺斯克数据技术。有关诺斯克数据的更多信息，请单击此处(挪威语)。Norsk Data被Telenor收购，并经历了几次品牌重塑和重新推出。\n纵观整个时代，诺斯克数据公司生产了一长串极具创新性的计算机。这方面的一些示例包括：\nNORD-1是第一台将内存分页作为标准选项的小型机，也是第一台具有浮点指令标准的机器。\nNord-5是世界上第一台击败VAX的32位小型机，经常号称是第一台，长6年。\nKps(知识处理系统)是与racal plc合资开发的，该系统开创了运行多用户lisp机器环境的先河。\n尽管诺斯克数据拆分导致大量裁员，但大量员工和知识产权在各种规模较小的公司得以生存。有些很快就破产了，有些是出于税收目的购买的。\n硬件研发部门于1989年被分拆为海豚服务器技术公司(Dolphin Server Technology)。Dolphin后来分拆成几家公司，其中最成功的是Dolphin Interconnect Solutions，一家集群互连硬件公司。\n在英国，Telenor保留了几年的Norsk Data名称，专注于硬件支持和维护合同，主要是与HMCG和地方政府的合同。\n在互联网热潮的尾声，Telenor决定尝试通过收购ISP CIX和曼彻斯特的一家托管公司XTML来扩展这项服务。采购总支出超过5000万GB。\n在21世纪初，这组公司的名称和业务重点发生了几次变化，被称为NExtra(连同收购的CIX&amp；XTML)、Telenor Business Solutions(仍然使用CIX；XTML)，最后在CIX&amp；XTML转售给Pipex后恢复到ND Norsk Data，据报道价格不到收购价格的10%。\n被收购公司的大部分价值损失被归因于互联网热潮期间包括在收购价格中的天文数字商誉支付。诺斯克数据公司随后更名为2E2，并在2E2之后收购了Pink Rocade的一部分。这支持了公司的硬件维护方面。收购带来的增长趋势仍在继续，几家规模较小的企业被聘用，许多员工随后被解雇。托马斯·库克(Thomas Cook)、伍尔沃斯(Woolworths)、HMP或Corus等高收入合同的重大损失从未被类似规模的客户取代。\n除了硬件，诺斯克数据还生产了广泛的系统和应用软件：\nSINTRAN-适用于Nord 10和更高型号的操作系统，1973年的版本III，1974年的III/VS。\n基于XMSG-OSI(X21和X.25)的通信系统，与SINTRAN集成，1974年及以后支持同步和异步通信。1982年完全支持LU 6.2。\n1975年，中央工业研究院移植了基于Codasyl数据库规范的SIBAS数据库，SIBAS归SRS所有。\n德国基尔和穆尔海姆和德鲁尔开发的BASIC编译器，使用维也纳开发方法的CAT系统(公共抽象树语言)，1983。\n用于ND-100/ND-500的C语言编译器，由Lule aka大学和瑞典IAR Systems AB与Norsk Data A.S合作开发，1984。一个后来在德国基尔和穆尔海姆和德鲁尔开发的C编译器，采用使用维也纳开发方法的CAT系统，1987年。\nplanc编译器-planc是Norsk Data的系统语言-一种由其实现定义的语言，类似于C，但赋值从左到右，如您阅读：A+1=：与A++相同\n德国基尔大学Hans Langmaack教授和他的团队利用CAT系统使用维也纳开发方法开发的PASCAL编译器，1987年。\nLED语言敏感程序员的编辑器面向屏幕的文本编辑器和调试器完整的集成开发环境。\nND-NOTIS-集成、模块化的字处理和办公应用程序套件，与数据库和客户应用程序捆绑在一起。\nLISP机器Lisp-麻省理工学院的Lisp机器LISP是在拉卡尔-诺斯克(ZetaLisp)合资企业开发的。\nTECHNOVISION-CAD系统在德国穆尔海姆和德鲁尔开发。Technovision是一种模块化的CAD/CAM系统，被国际上认为是市场上最好的系统之一。它的部分设计是由Norsk data Dietz GmbH设计的。名为Technostation的特殊工作站是专门为运行technovision而设计的。它受到了国际媒体的极大好评，甚至获得了设计奖。[3]。\nBIBDIA-由德国穆尔海姆的Norsk data Dietz GmbH开发的图书馆系统。BIBDIA由Biber GmbH从1992年开始进一步开发。目前基于网络的版本仍在德国和瑞士作为市场领先者运行。\n两种批处理语言，称为JEC和XCOM。JEC主要用作简单的批处理作业控制器，而XCOM用于更复杂的例程，如操作系统补丁等。大多数应用程序有两个不同的版本，一个是为NORD-10/ND-100系列编译的，另一个是为ND-500/ND-5000系列编译的。\nND将Notis-WP和Notis-RG剥离出来，成立Notis AS，后来更名为Maxware。Notis-QL是由微软复制的，微软称其为Access(Notis-QL的内部名称是Access-1&34；)，但原件被卖给了Sysdeco，现在以QBEVision&34；的名称出售。\n万维网起源于Tim Berners-Lee在CERN的SINTRAN III下运行的Norsk data nord-10上用Pascal编写的查询程序。[4]他们还使用了基于SGML的ND-Notis，并使用以HTML编码的TCP/IP与Notis-Mail一起发送电子邮件。", "note_en": "Jump to navigation  Jump to search  Norsk Data was a ( mini-) computer  manufacturer located in  Oslo,  Norway. Existing from 1967 to 1992, it had its most active period in the years from the early 1970s to the late 1980s. At the company&#39;s peak in 1987 it was the second largest company in Norway and employed over 4,500 people.\n Throughout its history Norsk Data produced a long string of extremely innovative systems, with a disproportionately large number of world firsts. Some examples of this are the  NORD-1, the first minicomputer to have memory  paging as a standard option, and the first machine to have floating-point instructions standard, the  NORD-5, the world&#39;s first 32-bit minicomputer (beating the  VAX, often claimed the first, by 6 years)\n    The origins of Norsk Data go back to the development of digital computers at the  Norwegian Defense Research Establishment at  Kjeller,  Norway, where several early computers had been designed, such as the  SAM and the  SAM 2, also known as the FLINK.\n The success of this program resulted in the founding of  A/S Nordata - Norsk Data Elektronikk on August 8, 1967 by  Lars Monrad Krohn, Per Bjørge and  Rolf Skår. The company became a significant supplier of minicomputers to many research projects, in particular to  CERN in  Geneva,  Switzerland, where they were chosen to produce the computers for many projects, starting with the  SPS Project  [1], Norsk Data&#39;s international breakthrough contract. The other market segments Norsk Data succeeded in were process control, Norwegian  municipal administration  data centers, newspapers, as well as parts of the educational, health, and university sector.\n For a period in 1987, Norsk Data was the second largest company by stock value in Norway, second only to  Norsk Hydro, and employed over 4,500 people.\n In March 1991, shortly after  January Events, Norsk Data donated the first computer to Lithuanian Institute of Mathematics and Informatics. This donation started the development of  LITNET - Academic and Research Network in  Lithuania. Later that year, the network connection lines, directly connecting  Vilnius to  Moscow, were shut down. With the help of the hardware, again donated by Norsk Data, Lithuania was able to use its first  satellite-based Internet connection, which operated at 9,6 kbit/s. This was the first Lithuanian communications line that was totally independent from former  Soviet Union.  [2]\n After a long period of exceptional success, the Norsk Data &#34;empire&#34; collapsed in the early 1990s, mostly due to not realizing the impact of the  PC revolution (as well as the growing competition from  UNIX-based  workstations). Norsk Data technology was continued by  Dolphin. See more about Norsk Data  here (Norwegian). Norsk Data was purchased by Telenor and went through several rebrands and relaunches.\n  Throughout the times, Norsk Data produced a long string of extremely innovative computers. Some examples of this include:\n The  NORD-1, the first  minicomputer to have memory paging as a standard option, and the first machine to have floating-point instructions standard\n The  NORD-5, the world&#39;s first 32-bit minicomputer - beating the  VAX, often claimed to be first - by 6 years\n  The KPS (Knowledge Process System), developed in joint venture with  Racal plc, a system which pioneered running a multi-user  LISP machine environment\n  Although the Norsk Data breakup caused a large number of layoffs, a large number of employees and intellectual property lived on in various smaller companies. Some went bankrupt quite quickly, some were bought for tax purposes.\n The Hardware Research and Development group was split off into Dolphin Server Technology in 1989. Dolphin later split off into a number of companies, by far the most successful of these being  Dolphin Interconnect Solutions, a  cluster interconnect hardware company.\n  In the UK,  Telenor kept the Norsk Data name for several years, focusing in on hardware support and maintenance contracts, mainly with  HMCG and local governments.\n At the tail end of the &#34;dotcom boom&#34; Telenor decided to try and expand the service by acquiring the ISP  CIX and a hosting company in Manchester, XTML. The total expenditure on acquisitions was more than £50 million.\n The name and business focus of this group of companies was changed several times in the early 21st Century, being known as Nextra (along with the acquired CIX &amp; XTML), Telenor Business Solutions (still with CIX &amp; XTML) and finally reverting to ND Norsk Data once CIX &amp; XTML had been resold to Pipex, reportedly for less than 10% of the purchase price.\n Much of the loss in value of the acquired companies was put down to the astronomical &#34;goodwill&#34; payment included in the purchase price during the &#34;dotcom boom&#34;. ND Norsk Data was then renamed 2e2, and with 2e2 came the acquisition of part of Pink Roccade. This bolstered the hardware maintenance side of the company. The growth by acquisition trend continued with several smaller businesses being taken on, and many employees subsequently being laid off. Major losses of high earning contracts such as Thomas Cook, Woolworths, HMP, or Corus, were never replaced with similar-sized customers.\n     In addition to hardware, Norsk Data also produced a wide range of system and application software:\n SINTRAN –  Operating system for Nord 10 and later models, version III from 1973, III/VS in 1974\n XMSG – OSI based ( X21 and  X.25) communication system, integrated with SINTRAN, with support for both synchronous and asynchronous communication in 1974 and on. Full  LU 6.2 support in 1982\n SIBAS  database based on the  Codasyl database specifications was ported by the Central Institute for Industrial Research in 1975 SIBAS is owned by SRS.\n   BASIC compiler developed in  Kiel and  Mülheim an der Ruhr,  Germany with the CAT-System (Common Abstract Tree-Language) using the  Vienna Development Method, 1983\n  C C compiler for ND-100/ND-500 developed by University of Luleå, and IAR Systems AB, Sweden, in cooperation with Norsk Data A.S, 1984. A later C compiler developed in Kiel and Mülheim an der Ruhr, Germany with the CAT-System using the Vienna Development Method, 1987.\n  PLANC compiler - PLANC was the system language of Norsk Data - a language &#34;defined by its implementation&#34;, similar to C, but assignment left to right, as you read: A + 1 =: A same as A++\n Pascal compiler developed by Prof. Dr. Hans Langmaack and his team at  Kiel University in Germany with the CAT-System using the  Vienna Development Method, 1987\n  LED – &#34;Language-sensitive programmer&#39;s EDitor&#34; Screen oriented  text editor and  debugger - complete Integrated Development Environment made for own use.\n ND-NOTIS – Integrated, modular  word processing and office application suite with ties to database and customer applications.\n  Lisp Machine Lisp – MIT Lisp machine lisp developed in a joint venture Racal-Norsk (ZetaLisp).\n Technovision - CAD system developed in Mülheim an der Ruhr, Germany.  Technovision was a modular CAD/CAM system which was internationally considered to be one of the best on the market. It was in part designed by Norsk Data Dietz GmbH. A special workstation named the Technostation was designed specifically for running Technovision. It was extremely well received by international press, and even won a design award.  [3]\n BIBDIA - Library system developed by Norsk Data Dietz GmbH in Mülheim an der Ruhr, Germany.  BIBDIA was further developed by BiBer GmbH since 1992. The current WEB-based version is still running as a market leader in Germany and Switzerland.\n  two batch languages, called JEC and XCOM. JEC were used primarily as a simple batch job controller, whereas XCOM was used for much more involved routines such as operating system patches etc. Most of the applications came in two different editions, one compiled for the NORD-10/ND-100 series and one compiled for the ND-500/ND-5000 series.\n ND spun off NOTIS-WP and NOTIS-RG into NOTIS AS, which later changed its name to Maxware.  NOTIS-QL was copied by Microsoft, where it is called Access (the internal name for NOTIS-QL was &#34;Access-1&#34;) but the original was sold to Sysdeco and sold now with the name &#34;QBEVision&#34;.\n  The  World Wide Web originated when  Tim Berners-Lee wrote the  ENQUIRE program in Pascal on a Norsk Data NORD-10 running under SINTRAN III at  CERN.  [4] They also used ND-NOTIS, that was based on SGML, and emailed with NOTIS-MAIL, using tcp/ip, coded in HTML.", "posttime": "2020-05-07 20:01:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据,norsk", "title": "诺斯克数据公司", "title_en": "Norsk Data", "transed": 1, "url": "https://en.wikipedia.org/wiki/Norsk_Data", "via": "", "real_tags": ["数据", "norsk"]}, {"category": "", "categoryclass": "", "imagename": "40c084415cda03650064ce1eed8b3c85.jpeg", "infoid": 1001074, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我是一名专业的模特师。我领导普华永道(PwC)的建模小组和模型评审服务达10年之久，之后又领导IBM的欧洲建模小组达5年之久。不过，我必须强调，我的评论只代表我个人的意见，并不代表上述团体的意见。我必须同意关于模型编程的一系列评论。首先，该模型的文档标准非常低，要么是代码内部的外部注释，要么是通过使用适当的变量名开发自文档代码。看到变量被定义为：inti，j，k，l，lc，lc2，b，c，n，nf，i2；没有任何指示它们表示什么，这是最糟糕的编程实践形式。其次，似乎缺乏对该模型的测试。当用相同的值播种随机数生成器时，无法产生相同的结果，这特别令人担忧，并暗示了程序开发中的一些基本问题。对于如此重要的模型，缺乏适当的测试制度的任何文档也令人担忧。第三，语言和整体编程风格的选择(主模拟模块由超过5400行代码组成)。对于将用于制定现实世界决策且需要经常更改以反映不断变化的需求(例如尝试新的干预形式)的模型来说，这不是一个合适的选择。我很欣赏这个模型是15年前写的，但它现在正被用来制定决策，它应该进行更新，以反映最佳实践。(有关最佳实践的示例，我建议您查看来自巴泽尔大学Biozentrum的这个模型https://github.com/neherlab/covid19_scenarios)。此外，我还想评论一下与此模型相关的建模问题，而不是编程问题。该模型由280多个参数组成，外加每次运行的人口密度文件。我从(痛苦的)经验中知道，创建280个参数的一致数据集是极其困难的，必须遵循严格的程序，以确保创建和使用适当的数据集，并将它们全面记录下来，并与所使用的模型版本和所产生的输出相联系。最佳做法是为每次运行使用数据管理员，他们负责收集和记录所使用的输入。我不知道是否遵循了这样的程序，但缺乏与所提供的数据集相关的文档并不能产生信心。这就引出了一个广泛的问题。为什么圣人模特组里没有专业的模特师。https://www.gov.uk/government/publications/scientific-advisory-group-for-emergencies-sage-coronavirus-covid-19-response-membership/list-of-participants-of-sage-and-related-sub-groups有许多专业组织，如OR Society https://www.theorsociety.com/，或精算师协会和精算师协会https://www.actuaries.org.uk/，他们本可以被联系来提供建模人员，他们的专业经验包括建立模型，在这些模型上做出关键的现实世界决策。这个小组似乎完全由学者组成，他们可能不习惯于他们的模型被用来做出现实世界的决定，以及随之而来的对模型开发和使用的要求。这种多样性的缺乏令人失望。", "note_en": "I am a professional modeller. For ten years I headed PwC’s modelling group and model review service and then for 5 years I headed IBM’s European modelling group. I must stress, however, that my comments represent my personal opinions and in no way represent the views of the organisations mentioned. I must agree with the range of comments about the programming of the model. First, the model has been developed with a very poor standard of documentation, either external, internal comments within the code or through the development of self-documenting code by using appropriate variable names. Seeing variables defined as: int i, j, k, l, lc, lc2, b, c, n, nf, i2; without any indication of what they represent, is the worst form of programming practice. Second, there appears to be a lack of testing of the model. The inability to produce the same results when seeding the random number generators with the same values is particularly alarming, and suggests some fundamental issues with the program’s development. The absence of any documentation of an appropriate testing regime for a model of this importance is also alarming Third, the choice of language and monolithic programming style (the main simulation module consists of over 5400 lines of code). This is not an appropriate choice for a model that will be used for making real world decisions and will need to be altered often to reflect changing requirements (such as trying out new forms of intervention). I appreciate that the model was written 15 years ago, but it is being used for making decisions today, and it should have been updated to reflect best practice. (For an example of best practice, I recommend you look at this model  https://github.com/neherlab/covid19_scenarios from the Biozentrum of the University of Bazel). I would also like to comment on, in addition, the modelling issues rather than the programming issues associated with this model. The model consists of over 280 parameters plus a population density file for each run. I know from (bitter) experience that creating consistent datasets of 280 parameters is extremely difficult and rigorous procedures have to be followed to ensure that appropriate sets of data are created and used and they are comprehensively documented and linked to both the version of the model used and to the outputs that are produced. Best practice would use data curators for each run who are responsible for the collection and documentation of the inputs used. I have no idea whether such procedures are followed, but the lack of documentation associated with the dataset supplied does not engender confidence. This leads to a wide question. Why is it that professional modellers are not represented on the SAGE modelling group.  https://www.gov.uk/government/publications/scientific-advisory-group-for-emergencies-sage-coronavirus-covid-19-response-membership/list-of-participants-of-sage-and-related-sub-groups There are a number of professional organisations such as the OR society  https://www.theorsociety.com/ , or the Institute and Faculty of Actuaries  https://www.actuaries.org.uk/ who could have been approached to provide modellers whose professional experience consists of building models on which critical real world decisions are made. The group seems to consist entirely of academics, who are, perhaps, unused to their models being used to make real world decisions and the attendant requirements on the model development and use. This lack of diversity is disappointing.", "posttime": "2020-05-07 20:01:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,github,问题,issue,模型", "title": "GitHub问题呼吁撤回帝国理工学院代码库缺陷研究", "title_en": "GitHub issue calling for retraction of Imperial College study for codebase flaws", "transed": 1, "url": "https://github.com/mrc-ide/covid-sim/issues/165", "via": "", "real_tags": ["代码", "github", "问题", "issue", "模型"]}, {"category": "", "categoryclass": "", "imagename": "5cee5e3272681c47ac9ff90e998a44ea.jpg", "infoid": 1001073, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这位物理学家出身的软件企业家说：“我确实责怪自己没有在20年前做到这一点。”“公平地说，我也指责物理界的一些人在20年前试图阻止这种情况的发生。他们是成功的。“。早在2002年，经过多年的努力，Wolfram自己出版了一本1200页的巨著“一种新的科学”，详细阐述了自然界运行在超简单的计算规则上的一般想法。这本书立即成为畅销书，并获得了热烈的好评：“纽约时报”称其为“一流的智力刺激”。但沃尔夫拉姆的论点在科学家中几乎没有发现皈依者。他们的工作还在继续，他又回去经营他的软件公司Wolfram Research。这就是事情一直存在的地方-直到上个月，伴随着令人屏息的媒体报道(以及一份448页的预印稿)，沃尔夫勒姆宣布了一条基于他的非传统思想的可能的“通往物理学基础理论的道路”。再一次，物理学家们并不信服，他们说，这在很大程度上是因为现有的理论比他的模型做得更好。\n就其核心而言，沃尔夫拉姆的新方法是一幅宇宙的计算图景-宇宙遵循的基本规则类似于计算机代码行。这段代码作用于一个图形，这是一个点之间有连接的网络，随着代码的数字逻辑向前单击，一步一步地增长和变化。根据Wolfram的说法，这个图形是宇宙的基本物质。从一张小小的图表和一组简短的规则开始，令人难以置信的复杂结构可以迅速出现。他在一篇总结这一想法的博客文章中写道：“即使一个系统的基本规则极其简单，整个系统的行为本质上也可能是任意丰富和复杂的。”“这让我思考：宇宙能这样运作吗？”沃尔弗拉姆和他的合作者乔纳森·戈拉德(Jonathan Gorard)发现，这种模型可以再现量子理论和爱因斯坦广义相对论的某些方面，这两个理论是现代物理学的两大基本支柱。戈拉德是剑桥大学的物理学博士生，也是沃尔弗拉姆研究公司的顾问。\n但沃尔夫拉姆的模型纳入目前公认的物理学的能力并不一定那么令人印象深刻。德克萨斯大学奥斯汀分校(University Of Texas At Austin)的量子计算机科学家斯科特·亚伦森(Scott Aaronson)说，“这是一种无限灵活的哲学，不管任何人对物理学的看法是正确的，他们都可以断言，‘哦，是的，你可以把类似的东西嫁接到我们的模型上’”，他是德克萨斯大学奥斯汀分校(University Of Texas At Austin)的量子计算机科学家。\n当被问及对这些批评的看法时，戈拉德表示同意-在某种程度上。“我们只是在某种程度上适合自己，”他说。“但我们这么做只是为了能真正去做一次系统化的搜索”，寻找适合我们宇宙的特定规则。\n然而，Wolfram和Gorard还没有发现任何符合这些要求的计算规则。如果没有这些规则，他们就不能做出任何明确、具体的新预测，这些预测可以进行实验测试。事实上，根据批评家的说法，沃尔夫拉姆的模型甚至还没有复制出传统物理中最基本的定量预测。麻省理工学院的物理学家丹尼尔·哈洛(Daniel Harlow)说：“(量子物理学和广义相对论)的实验预测已经被证实了很多小数位--在某些情况下，精确度只有[100亿]的1/4。”“到目前为止，我还没有看到任何迹象表明，使用Wolfram倡导的那种简单的(计算规则)可以做到这一点。他宣称的成功充其量只能算是定性的。此外，即使是这种质量上的成功也是有限的：模型中缺少了现代物理学的一些关键特征。它可以定性再现的物理部分大部分都在那里，因为Wolfram和他的同事们一开始就把它们放进去了。Aaronson说，这种安排类似于宣布，“如果我们假设有一只兔子从帽子里出来，那么值得注意的是，这只兔子会从帽子里出来。”“然后(不停地)说它有多了不起。”\n不出所料，沃尔弗拉姆不同意这种说法。他声称他的模型已经复制了大部分的基础物理。“通过一个极其简单的模型，我们能够再现狭义相对论、广义相对论和量子力学的核心结果，”他说，“当然，正是这些导致了在过去一个世纪里对物理学做出了如此多精确的定量预测。”\n即使是沃尔弗拉姆的批评者也承认，他至少在一件事上是正确的：简单的计算规则可以导致如此复杂的现象，这真的很有趣。但是，他们急忙补充说，这很难说是一个原创性的发现。这个想法“可以追溯到沃尔夫兰之前很久，”哈洛说。他引用了计算机先驱艾伦·图灵(Alan Turing)在20世纪30年代和约翰·冯·诺伊曼(John Von Neumann)在20世纪50年代的工作，以及数学家约翰·康威(John Conway)在70年代初的工作。(普林斯顿大学教授康威去世\n然后，在20世纪90年代，Wolfram决定重返科学研究-但没有传统研究环境提供的支持和投入。根据他自己的说法，他将自己隔离了大约十年，在他的一小群员工的帮助下，组装了一种最终成为一种新的科学。\n这本书一出版，媒体就被英雄局外人从荒野归来，单枪匹马改变整个科学的浪漫形象所笼罩。“连线”杂志在封面上称沃尔弗拉姆为“破解一切密码的人”。“沃尔弗拉姆赢得了一些吹嘘的权利，”“纽约时报”宣称。“没有人对这种新的世界思维方式做出了更大的贡献。”然而，就像现在一样，研究人员在很大程度上忽视和嘲笑了他的工作。已故物理学家弗里曼·戴森(Freeman Dyson)在2002年告诉“新闻周刊”(NewsWeek)：“科学家在接近老年时提出宏伟的、不太可能的理论，这是一个传统。”“沃尔弗拉姆的不同寻常之处在于，他在40多岁的时候就做了这件事。”\n沃尔弗拉姆的故事正是许多人想听的那种，因为它与他们已经知道的科学史上熟悉的戏剧性故事的节拍相吻合：孤独的天才(通常是白人和男性)默默无闻地工作，被当权者拒绝，从孤立中走出来，胜利地抓住了一段真理。但这很少--如果有的话--科学发现实际上是如何展开的。科学史上有一些表面上符合这一形象的例子：想想阿尔伯特·爱因斯坦(Albert Einstein)在20世纪初作为一个默默无闻的瑞士专利办事员辛辛苦苦研究相对论的情形。或者，举一个最近的例子，数学家安德鲁·怀尔斯(Andrew Wiles)在他的阁楼上工作了多年，在1995年最终宣布成功之前，他一直在证明费马最后定理。但是，将这些发现描绘成一个单独的天才的作品，尽管它是浪漫的，却掩盖了科学的真正工作过程。科学是一项集体努力。爱因斯坦与他那个时代的研究人员保持着密切的联系，怀尔斯的工作遵循了其他数学家在他开始之前几年制定的道路。他们两人都是更广泛的科学界积极、定期的参与者。即便如此，他们仍然是规则的例外。大多数重大科学突破都是更具协作性的-例如，量子物理学是由世界各地的数十名物理学家在四分之一个世纪内缓慢发展起来的。\n北卡罗来纳州立大学(North Carolina State University)宇宙学家凯蒂·麦晋桁(Katie Of Mack)表示：“我认为，物理学家都在寻找他们将发现万物理论的尤里卡时刻的流行观点是不幸的。”“我们确实想找到更好、更完整的理论。但我们的做法是测试和改进我们的模型，寻找不一致之处，并循序渐进地朝着更好、更完整的模型迈进。“。\n大多数科学家会毫不犹豫地告诉你，他们的学科是--而且一直都是--一个协作的、共同的过程。没有人可以在没有得到同行的批判性评价和最终验证的情况下，给一个科学领域带来革命性的变化。今天，这一要求是通过同行审查来执行的-沃尔弗拉姆的批评者说，他的声明绕过了这个过程。“当然，没有理由让Wolfram和他的同事能够绕过正式的同行审查，”Mack说。“如果他们以我们实际上拥有的处理工具的格式发布他们的结果，那么他们从物理界获得有用反馈的机会肯定要大得多。”\n麦晋桁并不是唯一一个感到担忧的人。加州理工学院的物理学家肖恩·卡罗尔(Sean Carroll)说：“很难指望物理学家突然梳理出数百页的新理论，而不是以论文、研讨会和会议报告的形式积累起来。”“就我个人而言，我觉得用这种方法写一些简短的论文来解决具体问题，比不经过太多审查就宣布取得突破更有效。”\n那么，为什么沃尔弗拉姆要以这种方式宣布他的想法呢？为什么不走传统路线呢？“我并不真的相信匿名同行评议，”他说。“我认为这是腐败的。我要说的是，这是一个有点腐败的游戏的巨大故事。我认为这在某种程度上是不可避免的，在这些非常大的系统中发生。这真是太可惜了。“。\n那么沃尔弗拉姆的目标是什么呢？他说，他希望得到物理学界的关注和反馈。但他的非常规方法--在一篇超长的论文上征求公众意见--几乎确保了它将保持模糊不清。沃尔弗拉姆说他希望得到物理学家的尊重。为这篇报道咨询的人说，要想获得它，他需要承认并参与科学界其他人之前的工作。\n当得到其他物理学家对他的工作的一些回应时，沃尔夫勒姆出奇地冷漠。他抱怨道：“我对你传达的问题的天真感到失望。”“我应该得到更好的。”", "note_en": "“I do fault myself for not having done this 20 years ago,” the physicist turned software entrepreneur says. “To be fair, I also fault some people in the physics community for trying to prevent it happening 20 years ago. They were successful.” Back in 2002, after years of labor, Wolfram self-published  A New Kind of Science, a 1,200-page magnum opus detailing the general idea that nature runs on ultrasimple computational rules. The book was an instant best seller and received glowing reviews: the  New York Times called it “a first-class intellectual thrill.” But Wolfram’s arguments found few converts among scientists. Their work carried on, and he went back to running his software company Wolfram Research. And that is where things remained—until last month, when, accompanied by breathless press coverage (and  a 448-page preprint paper), Wolfram announced a possible “path to the fundamental theory of physics” based on his unconventional ideas. Once again, physicists are unconvinced—in no small part, they say, because existing theories do a better job than his model.\n  At its heart, Wolfram’s new approach is a computational picture of the cosmos—one where the fundamental rules that the universe obeys resemble lines of computer code. This code acts on a graph, a network of points with connections between them, that grows and changes as the digital logic of the code clicks forward, one step at a time. According to Wolfram, this graph is the fundamental stuff of the universe. From the humble beginning of a small graph and a short set of rules, fabulously complex structures can rapidly appear. “Even when the underlying rules for a system are extremely simple, the behavior of the system as a whole can be essentially arbitrarily rich and complex,” he wrote in  a blog post summarizing the idea. “And this got me thinking: Could the universe work this way?” Wolfram and his collaborator Jonathan Gorard, a physics Ph.D. candidate at the University of Cambridge and a consultant at Wolfram Research, found that this kind of model could reproduce some of the aspects of quantum theory and Einstein’s general theory of relativity, the two fundamental  pillars of modern physics.\n  But Wolfram’s model’s ability to incorporate currently accepted physics is not necessarily that impressive. “It’s this sort of infinitely flexible philosophy where, regardless of what anyone said was true about physics, they could then assert, ‘Oh, yeah, you could graft something like that onto our model,’” says Scott Aaronson, a quantum computer scientist at the University of Texas at Austin.\n  When asked about such criticisms, Gorard agrees—to  a point. “We’re just kind of fitting things,” he says. “But we&#39;re only doing that so we can actually go and do a systematized search” for specific rules that fit those of our universe.\n  Wolfram and Gorard have not yet found any computational rules meeting those requirements, however. And without those rules, they cannot make any definite, concrete new predictions that could be experimentally tested. Indeed, according to critics, Wolfram’s model has yet to even reproduce the most basic quantitative predictions of conventional physics. “The experimental predictions of [quantum physics and general relativity] have been confirmed to many decimal places—in some cases, to a precision of one part in [10 billion],” says Daniel Harlow, a physicist at the Massachusetts Institute of Technology. “So far I see no indication that this could be done using the simple kinds of [computational rules] advocated by Wolfram. The successes he claims are, at best, qualitative.” Further, even that qualitative success is limited: There are crucial features of modern physics missing from the model. And the parts of physics that it can qualitatively reproduce are mostly there because Wolfram and his colleagues put them in to begin with. This arrangement is akin to announcing, “‘If we suppose that a rabbit was coming out of the hat, then remarkably, this rabbit would be coming out of the hat,’” Aaronson says. “And then [going] on and on about how remarkable it is.”\n  Unsurprisingly, Wolfram disagrees. He claims that his model has replicated most of fundamental physics already. “From an extremely simple model, we’re able to reproduce special relativity, general relativity and the core results of quantum mechanics,” he says, “which, of course, are what have led to so many precise quantitative predictions of physics over the past century.”\n  Even Wolfram’s critics acknowledge he is right about at least one thing: it is genuinely interesting that simple computational rules can lead to such complex phenomena. But, they hasten to add, that is hardly an original discovery. The idea “goes back long before Wolfram,” Harlow says. He cites the work of computing pioneers Alan Turing in the 1930s and John von Neumann in the 1950s,  as well as that of mathematician John Conway in the early 1970s. (Conway, a professor at Princeton University, died of COVID-19 last month.) To the contrary, Wolfram insists that he was the first to discover that virtually boundless complexity could arise from simple rules in the 1980s. “John von Neumann, he absolutely didn’t see this,” Wolfram says. “John Conway, same thing.”\n    Born in London in 1959, Wolfram was a child prodigy who studied at Eton College and the University of Oxford before earning a Ph.D. in theoretical physics at the California Institute of Technology in 1979—at the age of 20. After his Ph.D., Caltech promptly hired Wolfram to work alongside his mentors, including physicist Richard Feynman. “I don’t know of any others in this field that have the wide range of understanding of Dr. Wolfram,” Feynman wrote in a letter recommending him for the first ever round of MacArthur “genius grants” in 1981. “He seems to have worked on everything and has some original or careful judgement on any topic.” Wolfram won the grant—at age 21, making him among the youngest ever to receive the award—and became a faculty member at Caltech and then a long-term member at the Institute for Advanced Study in Princeton, N.J. While at the latter, he became interested in simple computational systems and then moved to the University of Illinois in 1986 to start a research center to study the emergence of complex phenomena. In 1987 he founded Wolfram Research, and shortly after he left academia altogether. The software company’s flagship product, Mathematica, is a powerful and impressive piece of mathematics software that has sold millions of copies and is today nearly ubiquitous in physics and mathematics departments worldwide.\n  Then, in the 1990s, Wolfram decided to go back to scientific research—but without the support and input provided by a traditional research environment. By his own account, he sequestered himself for about a decade, putting together what would eventually become  A New Kind of Science with the assistance of a small army of his employees.\n  Upon the release of the book, the media was ensorcelled by the romantic image of the heroic outsider returning from the wilderness to single-handedly change all of science.  Wired dubbed Wolfram “the man who cracked the code to everything” on its cover. “Wolfram has earned some bragging rights,” the  New York Times proclaimed. “No one has contributed more seminally to this new way of thinking about the world.” Yet then, as now, researchers largely ignored and derided his work. “There’s a tradition of scientists approaching senility to come up with grand, improbable theories,” the late physicist Freeman Dyson told  Newsweek back in 2002. “Wolfram is unusual in that he’s doing this in his 40s.”\n  Wolfram’s story is exactly the sort that many people want to hear, because it matches the familiar beats of dramatic tales from science history that they already know: the lone genius (usually white and male), laboring in obscurity and rejected by the establishment, emerges from isolation, triumphantly grasping a piece of the Truth. But that is rarely—if ever—how scientific discovery actually unfolds. There are examples from the history of science that superficially fit this image: Think of Albert Einstein toiling away on relativity as an obscure Swiss patent clerk at the turn of the 20th century. Or, for a more recent example, consider mathematician Andrew Wiles working in his attic for years to prove Fermat’s last theorem before finally announcing his success in 1995. But portraying those discoveries as the work of a solo genius, romantic as it is, belies the real working process of science. Science is a group effort. Einstein was in close contact with researchers of his day, and Wiles’s work followed a path laid out by other mathematicians just a few years before he got started. Both of them were active, regular participants in the wider scientific community. And even so, they remain exceptions to the rule. Most major scientific breakthroughs are  far more collaborative—quantum physics, for example, was developed slowly over a quarter-century by dozens of physicists around the world.\n  “I think the popular notion that physicists are all in search of the eureka moment in which they will discover the theory of everything is an unfortunate one,” says Katie   Mack, a cosmologist at North Carolina State University. “We do want to find better, more complete theories. But the way we go about that is to test and refine our models, look for inconsistencies and incrementally work our way toward better, more complete models.”\n  Most scientists would readily tell you that their discipline is—and always has been—a collaborative, communal process. Nobody can revolutionize a scientific field without first getting the critical appraisal and eventual validation of their peers. Today this requirement is performed through peer review—a process Wolfram’s critics say he has circumvented with his announcement. “Certainly there’s no reason that Wolfram and his colleagues should be able to bypass formal peer review,” Mack says. “And they definitely have a much better chance of getting useful feedback from the physics community if they publish their results in a format we actually have the tools to deal with.”\n  Mack is not alone in her concerns. “It’s hard to expect physicists to comb through hundreds of pages of a new theory out of the blue, with no buildup in the form of papers, seminars and conference presentations,” says Sean Carroll, a physicist at Caltech. “Personally, I feel it would be more effective to write short papers addressing specific problems with this kind of approach rather than proclaiming a breakthrough without much vetting.”\n  So why did Wolfram announce his ideas this way? Why not go the traditional route? “I don&#39;t really believe in anonymous peer review,” he says. “I think it’s corrupt. It’s all a giant story of somewhat corrupt gaming, I would say. I think it’s sort of inevitable that happens with these very large systems. It’s a pity.”\n  So what are Wolfram’s goals? He says he wants the attention and feedback of the physics community. But his unconventional approach—soliciting public comments on an exceedingly long paper—almost ensures it shall remain obscure. Wolfram says he wants physicists’ respect. The ones consulted for this story said gaining it would require him to recognize and engage with the prior work of others in the scientific community.\n  And when provided with some of the responses from other physicists regarding his work, Wolfram is singularly unenthused. “I’m disappointed by the naivete of the questions that you’re communicating,” he grumbles. “I deserve better.”", "posttime": "2020-05-07 20:01:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "批评,criticize,物理学", "title": "物理学家批评斯蒂芬·沃尔弗拉姆的“万物理论”", "title_en": "Physicists Criticize Stephen Wolfram’s ‘Theory of Everything’", "transed": 1, "url": "https://www.scientificamerican.com/article/physicists-criticize-stephen-wolframs-theory-of-everything", "via": "", "real_tags": ["批评", "criticize", "物理学"]}]