[{"category": "", "categoryclass": "", "imagename": "a241bf4ad801d910fca10ffc30bfaef8.jpg", "infoid": 1003480, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "呆在家里的命令让更多的人远离道路，但全国各地的警察报告说，鲁莽驾驶的情况有所上升。\n在康涅狄格州，与去年相比，交通减少了一半，但致命的机动车事故增加了约40%。\n康涅狄格州警察若瑟·多雷卢斯告诉美国广播公司新闻记者吉奥·贝尼特斯，我们重新发现，随着道路开放，某些人正以此为契机，将自己的车辆推向极限。\n多雷卢斯说，在冠状病毒大流行期间，他们已经看到超过限速15英里的汽车增加了90%。\n下午1点收看美国广播公司。美国东部时间和ABC新闻下午4点直播。美国东部时间每个工作日都有ABC新闻团队对这部小说进行特别报道，包括最新的新闻、背景和分析。\n上个月，州长高速公路安全协会(GHSA)敦促全国司机减速，因为州高速公路安全官员开始报告超速严重激增。\n从3月中旬到4月中旬，加州公路巡逻队在全州范围内发布了近2500张时速超过100英里的传票，比去年同期增长了87%。\n加州现在使用它的700多个电子高速公路标志来显示这样的信息：如果你必须出行，不要超速。\n高速公路和汽车安全倡导者总裁凯西·蔡斯告诉ABC新闻，当你以每小时100英里以上的速度行驶时，这些撞车事故不可避免地会致命或接近致命。\n在马萨诸塞州，车祸的死亡率正在上升。在明尼苏达州，与前几年同期相比，机动车撞车事故和死亡人数增加了一倍多。\n专家们仍然不确定是什么促使人们从事更鲁莽的驾驶行为。\n蔡斯说，有些人可能觉得自己被关在家里，认为这是一种缓解压力的方式。有些人可能一辈子都想做这件事，现在他们发现道路变得有点通畅了，他们正在利用这一局面。\nGSHA负责外部事务的高级主管帕姆·沙德尔·费舍尔(Pam Shadel Fischer)表示，这可能是因为司机在没有其他司机上路的情况下更难测量自己的速度。\n费舍尔说，交通量当然决定了速度，我们称之为羊群心态，这是有道理的。\n在努力打击超速的同时，他们也采取了额外的安全措施，以防止冠状病毒的传播。多雷卢斯说，在康涅狄格州，他们现在交通拦截期间都戴着口罩，使用塑料袋带走司机的文件，并在可能的情况下拍摄文件。\n随着国家重新开放，国家运输安全委员会主席罗伯特·萨姆沃特周一再次呼吁道路安全。\n萨姆沃特说，随着我们迈向新常态，我们需要安全到达那里。不要超速。开车时不要分心。\n根据GHSA的说法，现在判断一些已经解除避难所命令的州是否看到超速或鲁莽驾驶恢复到大流行前的水平还为时过早。\n蔡斯说，看看当更多的人开始上路时会发生什么，这将是一件有趣的事情。当原地避难令解除后，这种危险和致命的行为是否会减少。", "note_en": "Stay-at-home orders are  keeping more people off the roads, but police across the country are reporting a rise in reckless driving.\n In Connecticut, traffic has been cut in half compared to last year, but fatal motor vehicle accidents are up by about 40%.\n  &#34;We&#39;re finding that with the open roads, certain individuals are taking this as an opportunity to push their vehicles to the limit,&#34; Connecticut State Police Trooper Josue Dorelus told ABC News&#39; Transportation Correspondent Gio Benitez.\n  Dorelus said they have seen a 90% increase in cars going over 15 miles above the speed limit during the  coronavirus pandemic.\n Tune into ABC at 1 p.m. ET and ABC News Live at 4 p.m. ET every weekday for special coverage of the novel   with the full ABC News team, including the latest news, context and analysis.\n The Governors Highway Safety Association (GHSA) urged drivers nationwide last month to slow down as state highway safety officials started reporting a &#34;severe spike&#34; in speeding.\n  The California Highway Patrol  issued nearly 2,500 citations statewide for driving over 100 miles per hour from mid-march to mid-April -- an 87% jump from the same time last year.\n California is now using its more than 700 electronic highway signs to display messages like, &#34;If you must travel do not speed.&#34;\n  &#34;When you&#39;re going in excess of 100 miles an hour, these crashes are inevitably going to be fatal or near fatal,&#34; Advocates for Highway and Auto Safety President Cathy Chase told ABC News.\n In Massachusetts, the fatality rate for car crashes is rising. In Minnesota, motor vehicle crashes and fatalities have more than doubled compared to the same time period in previous years.\n Experts are still unsure what is motivating people to engage in more reckless driving behaviors.\n  &#34;Some people might be feeling cooped up and think of it as a stress relief,&#34; Chase said. &#34;Some people may have wanted to do this their whole lives and now they see the roads have opened up a bit and they&#39;re taking advantage of the situation.&#34;\n Pam Shadel Fischer, GSHA’s senior director of external engagement, said it could be because it is harder for drivers to gauge their own speed without other drivers on the road.\n &#34;Certainly traffic volumes dictate speed,&#34; Fischer said, &#34;and there is something to be said for what we&#39;d call that herd mentality.&#34;\n  While officers try to crack down on speeding, they are also  taking extra safety precautions to prevent the spread of COVID-19. Dorelus said that in Connecticut they are now wearing masks for the duration of the traffic stops, utilizing plastic bags to take the documents of drivers and taking pictures of documents when possible.\n  As the nation reopens, the National Transportation Safety Board Chairman Robert Sumwalt renewed his call for road safety on Monday.\n &#34;As we move toward a new normal, we need to get there safely,&#34; Sumwalt said. &#34;Don’t speed. Don’t drive distracted.&#34;\n  According to the GHSA its too soon to tell whether or not some states that have lifted shelter in place orders have seen speeding or reckless driving return to pre-pandemic levels.\n &#34;It will be interesting to see what happens when more people start going on the roads,&#34; Chase said. &#34;When shelter-in-place orders are lifted, whether this dangerous and deadly behavior is reduced.&#34;", "posttime": "2020-05-24 11:41:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "高速公路,highway,安全", "title": "随着高速公路交通量的下降，鲁莽的司机是否还在增加高速公路的死亡人数？", "title_en": "With Highway Traffic Down, Are Reckless Drivers Still Increasing Highway Fatalities?", "transed": 1, "url": "https://abcnews.go.com/US/police-uptick-speeding-fatal-crashes-amid-pandemic/story?id=70751844", "via": "", "real_tags": ["高速公路", "highway", "安全"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003479, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1968年的大流行是由甲型H3N2流感病毒引起的，该病毒由甲型禽流感病毒的两个基因组成，包括一种新的H3血凝素，但也含有1957年H2N2病毒的N2神经氨酸酶。它于1968年9月在美国首次被发现。据估计，全球死亡人数为100万人，美国约为10万人。大多数超额死亡发生在65岁及以上的人群中。H3N2病毒作为季节性甲型流感病毒继续在全球传播。季节性H3N2病毒与老年人的严重疾病有关，会经历定期的抗原漂移。", "note_en": "The 1968 pandemic was caused by an influenza A (H3N2) virus comprised of two genes from an avian influenza A virus, including a new H3 hemagglutinin, but also contained the N2 neuraminidase from the 1957 H2N2 virus. It was first noted in the United States in September 1968. The estimated number of deaths was 1 million worldwide and about 100,000 in the United States. Most excess deaths were in people 65 years and older. The H3N2 virus continues to circulate worldwide as a seasonal influenza A virus. Seasonal H3N2 viruses, which are associated with severe illness in older people, undergo regular  antigenic drift.", "posttime": "2020-05-24 11:40:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,h3n2", "title": "1968年大流行(H3N2病毒)", "title_en": "1968 Pandemic (H3N2 Virus)", "transed": 1, "url": "https://www.cdc.gov/flu/pandemic-resources/1968-pandemic.html", "via": "", "real_tags": ["病毒", "h3n2"]}, {"category": "", "categoryclass": "", "imagename": "f2c8803074656d2f24d5c251b9a473ef.jpg", "infoid": 1003478, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周，Tiara Show去商场寻找夏装-这是为了分散人们对自3月份以来一直让她呆在家里的流行病的注意力。\n但到处都有冠状病毒的提醒：美国鹰的一名迎宾告诉她，口罩是强制性的，并给了她一个一次性的。在里面，货架已经被削减和重新排列，牛仔裤在一个区域，衬衫在另一个区域。其他所有试衣间都关门了。在通过有机玻璃隔板支付了购买的衬衫、短裤和耳环后，Show自己从打印机那里撕下了收据。\n“一切都不一样了，”这位来自蒙大拿州米苏拉的23岁球员说。“如果说有什么不同的话，那就是它让病毒感觉更真实了。”\n在全国范围内，商店正在重新开业，接受一个改变了的现实。零售商多年来一直试图让顾客流连忘返，希望他们能买到比需要的更多的东西，现在他们正在重新想象他们的商店，以迎接一个充满刻意购买的抢占即走的未来。他们说，试妆或在过道里玩玩具的日子已经一去不复返了。现在的重点是让购物更快、更容易、更安全，以适应消费者预期和习惯的长期变化。\n苹果公司正在门口检查购物者的体温。百思买要求顾客预约购物。梅西百货(Macy‘s)和诺德斯特龙(Nordstrom)正在取消美容咨询和改装服务，而Gap正在关闭浴室和试衣间。化妆品巨头丝芙兰将不再允许购物者测试产品。其他人在将商品重新上架之前，正在对退货进行长达72小时的隔离。\n与此同时，美国鹰服饰公司(American Eagle Outfitters)正在重新想象购物体验的每一个部分。它已经投资于路边皮卡和红外线机器，这些机器可以在顾客走过时测量他们的温度。入口处的陈列品曾经堆满了服装，现在已经变成了“迎宾桌”，摆满了瓶装洗手液、一次性口罩和用来清洁鞋底的粘性蓝色垫子。衣服甚至有不同的折叠方式，以鼓励人们不插手浏览。新协议已经在435家(近一半)其美国门店推出，让我们得以一窥即使是最无害的互动也可能会如何改变。\n该公司首席商务官安德鲁·麦克莱恩(Andrew McLean)说，“从你走进我们店的那一刻起，我们就想让你看到一些新鲜的东西。”“粘乎乎的垫子、迎宾桌--它们都是顾客头脑中的触发器，让他们觉得现在的情况不同了。”\n这家零售商现在限制了商店的人数，当轮到顾客购物时，它正在使用一款移动应用程序来通知顾客。该公司还在一本65页的员工手册中详细阐述了新的协议，包括如何折叠牛仔裤和T恤，以便购物者在不接触它们的情况下对其进行详细检查。\n这些努力表明，即使美国冠状病毒死亡人数超过92,000人，零售商仍将竭尽全力安抚紧张的消费者，让他们相信再次亲自购物是安全的。在大流行期间，已经遭受重创的行业受到了沉重打击，因为长达数周的停摆导致更广泛的经济陷入衰退。四大连锁店-J.Crew、Neiman Marcus、Stage Stores和J.C.Penney-本月已根据破产法第11章申请破产保护，第五家连锁店Pier 1正濒临灭绝。分析人士说，更多的零售商正摇摇欲坠地走向破产，这增加了他们应对公共卫生的赌注。\n埃默里大学罗林斯公共卫生学院(Emory University‘s Rollins School of Public Health)全球卫生和流行病学教授罗伯特·A·贝德纳奇克(Robert A.Bednarczyk)说，“经验告诉我们，放松限制和就地避难命令意味着疾病的死灰复燃。”“口罩、体温检查、手部卫生--随着商店重新开张，这些都很重要，但增加传播的风险仍然存在。\n零售商多年来一直在他们的门店增加互动展示、样品站，甚至攀岩墙和提供全方位服务的酒吧，希望为购物者提供他们在网上无法获得的体验。但分析人士表示，这些努力中的许多现在都是不切实际或不安全的，需要进行彻底改革，最终可能会降低购物体验的乐趣，并进一步削弱本已疲软的零售环境。\n他们说，许多变化既是务实的，也是公开令人放心的：例如，如果有人在American Eagle要求试衣间，员工在允许他们进入之前，必须在购物者看得很清楚的情况下对门把手和固定装置进行消毒。\n纽约咨询公司WSL Strategic Retail的首席执行官温迪·利布曼(Wendy Liebmann)表示：“零售商开始考虑的不仅仅是商店的清洁程度。”“他们在考虑商品销售，考虑事情的发展方向。他们怎样才能让人们购物变得更容易呢？这场大流行不会稳定下来。这将是一个漫长的过山车。\n在华盛顿特区的一家独立玩具店Child‘s Play，店主史蒂文·亚伦斯(Steven Aarons)正准备减少冲动购物--减少儿童数量。他正在拆除游戏桌，取而代之的是价格更高的精灵宝可梦卡片和插孔-比如1000个拼图和滑板车-父母可以很快拿到。\nAarons在34年前开了这家店，他说：“感觉就像是我们开始了一项全新的业务。”“说我们要拿走游戏桌，不让孩子们再在商店里跑来跑去是很痛苦的，但这也是正确的做法。”\n他说，可能还需要几年时间，顾客才会觉得花几个小时和他们的孩子一起浏览过道是一件很舒服的事情。与此同时，他建立了公司的网站，并增加了自大流行开始关闭以来一直需求旺盛的送货服务。员工每天从该公司的雪佛兰大通(Chevy Chase)门店减少约60份订单，尽管整体销售额下降了约50%。\n在美国经营着375家门店的丹麦珠宝商潘多拉(Pandora)已经将珠宝清洁机从后台搬到了卖场，这样员工们就可以在顾客面前对试穿后的每一件珠宝进行消毒。\n试戴首饰有它自己的预防措施。这家零售商已经创建了一套精心设计的系统，以确保客户和员工不会发生身体接触。顾客被指示站在离商店柜台三英尺的地方。如果有人想试戴珠宝，员工会将物品从箱子里拿出来，放在柜台上的托盘上。\n该公司北美业务总裁希德·凯斯瓦尼(Sid Keswani)表示：“当员工后退时，客户会向前走一步，所以总会有6英尺高的空间。”\n该公司还将客户数量限制在一次五人以内，并正在为繁忙的假日季节制定新的安全措施，假日季节约占其销售额的40%。\n“我们觉得这是一次相当安全的旅行，”凯斯瓦尼说。“但我说相当安全，因为如你所知，目前还不能保证。”\n数据显示，自本月商场重新开业以来，客流量稳步增长。对5月1日开业的八家购物中心(包括俄克拉何马州、田纳西州和佐治亚州)的分析显示，购物中心从涓涓细流-约为一年前购物者数量的五分之一-迅速增长，在某些情况下超过了一年前的日均价格。\n根据Placer.ai的数据，截至5月6日，德克萨斯州的米德兰公园购物中心(Midland Park Mall)报告称，与前一天相比增长了79%。Placer.ai使用3000万台设备的位置数据分析了人流量模式。与此同时，南卡罗来纳州的梅西百货的客流量比去年同期跃升了9%。\n美国之鹰(American Eagle)也有类似的情况，购物者一开始小心翼翼地返回，然后热情高涨。销售额也在上升：根据该公司董事长兼首席执行官杰伊·肖滕斯坦(Jay Schotstein)的说法，许多重新开业的商店销售的商品与一年前一样多。\n“进来的顾客都是来买的，”他说。“他们不是来看的。”\n今年3月，该公司关闭了其在美国的所有980家美国鹰(American Eagle)和Aerie门店，并让4万名员工中的大多数人休假。重新开业从5月1日开始，在医生的帮助下制定了一系列新的指导方针：员工必须在每次轮班开始前洗手20秒，然后在测量自己的体温之前对商店温度计进行消毒。\n除了新的协议之外，还有更多的开放式考虑。鼓励员工从面具后面微笑，并注意非语言的暗示。“戴上口罩，一开始你可能会觉得有点尴尬，但别让这妨碍了你！”员工手册上说。“我们不希望这感觉像是一场无菌或临床互动。即使你们可能相距6英尺，但你的工作仍然是建立联系！“。\n有关于自己动手制作面罩的教程，以及制作包括每位员工微笑照片的徽章的指南。高管们表示，目标是在大流行购物的时代让顾客放心。\n肖特滕斯坦说：“这是一个为期两个月的过程，目的是弄清楚怎样才能让人们感到安全。”“这是一个新的现实：客户想要回来，但他们想要回到他们觉得安全的地方。”", "note_en": "Tiara Show went to the mall last week in search of summer clothes — and a distraction from the pandemic that has kept her homebound since March.\n  But there were  coronavirus reminders everywhere: A greeter at American Eagle told her masks were mandatory and offered her a disposable one. Inside, shelves had been pared down and rearranged, with jeans in one area, shirts in another. Every other fitting room was closed. After paying for her purchase — shirts, shorts and earrings — through a plexiglass divider, Show tore the receipt from the printer herself.\n  “Everything was so different,” said the 23-year-old from Missoula, Mont. “If anything, it made the virus feel more real.”\n  Across the country, stores are reopening to a changed reality. Retailers that have spent years trying to get customers to linger, in hopes they’ll buy more than they need, are reimagining their stores for a grab-and-go future filled with deliberate purchases. Gone, they say, are the days of trying on makeup or playing with toys in the aisles. The focus now is on making shopping faster, easier and safer to accommodate long-term shifts in consumer expectations and habits.\n    Apple is checking shoppers’ temperatures at the door. Best Buy is asking customers to shop by appointment. Macy’s and Nordstrom are doing away with beauty consultations and alteration services, while the Gap is closing off bathrooms and fitting rooms. Cosmetics giant Sephora won’t allow shoppers to test products anymore. Others are quarantining returns for as long as 72 hours before putting merchandise back on shelves.\n    American Eagle Outfitters, meanwhile, is reimagining every part of the shopping experience. It has invested in curbside pickup and infrared machines that measure customers’ temperatures as they walk by. Entryway displays once piled high with apparel have become “welcome tables” with bottles of hand sanitizer, disposable masks and sticky blue mats that clean shoe soles. Clothes are even folded differently, to encourage hands-off browsing. The new protocols, which already have been rolled out at 435, or nearly half, of its U.S. stores, offer a glimpse of how even the most innocuous interactions might be tempered.\n        “From the moment you walk into our store, we want you to see something that’s new,” said Andrew McLean, the company’s chief commercial officer. “The sticky mat, the welcome table — they’re all triggers in the customer’s mind that things are different now.”\n  The retailer, which now limits the number of people in stores, is using a mobile app to notify customers when it’s their turn to shop. And it has spelled out its new protocols in a 65-page employee handbook, including how to fold jeans and T-shirts to allow shoppers to examine them in detail without touching them.\n  The efforts illustrate the lengths to which retailers are going to reassure skittish consumers that it’s safe to shop in person again, even as U.S. coronavirus deaths surpass 92,000. The already bruised industry has been hit hard during the pandemic, as weeks-long shutdowns ushered the broader economy into recession. Four major chains — J. Crew, Neiman Marcus, Stage Stores and J.C. Penney — have filed for Chapter 11 bankruptcy protection this month, and a fifth, Pier 1, is headed toward extinction. And analysts say many more retailers are teetering toward bankruptcy, raising the stakes on their public health response.\n    “Experience has shown us that loosening restrictions and shelter-in-place orders means a resurgence of disease,” said Robert A. Bednarczyk, a professor of global health and epidemiology at Emory University’s Rollins School of Public Health. “Masks, temperature checks, hand hygiene — they’re all important as stores reopen, but there are still risks for increased transmission.&#34;\n    Retailers have spent years adding interactive displays, sample stations, even rock-climbing walls and full-service bars to their stores in hopes of offering shoppers an experience they can’t get online. But analysts say many of those efforts are now impractical or unsafe, requiring an overhaul that could ultimately make the shopping experience less enjoyable and further cut into an already weak retail environment.\n    Many of the changes, they say, are as much about being overtly reassuring as they are pragmatic: If someone asks for a fitting room at American Eagle, for example, employees must disinfect door handles and fixtures in clear view of the shopper before allowing them in.\n  “Retailers are starting to consider more than just the cleanliness of their stores,” said Wendy Liebmann, chief executive of WSL Strategic Retail, a New York-based consulting firm. “They’re thinking about merchandising, about where things go. How can they make it easier for people to shop? This pandemic isn’t going to level off. It’s going to be a long roller coaster.&#34;\n      At Child’s Play, an independent toy store in Washington, D.C., owner Steven Aarons is preparing for fewer impulse buys — and fewer children. He is removing play tables and replacing Pokémon cards and jacks with bigger-ticket items — such as 1,000-piece puzzles and scooters — that parents can quickly pick up.\n    “It feels like we’re starting a whole new business,” said Aarons, who opened the store 34 years ago. “It’s painful to say we’re going to take away the play tables and not let kids run around the store anymore, but it’s also the right thing to do.”\n  It could be years, he says, before customers feel comfortable spending hours browsing aisles with their children. In the meantime, he has built up the company’s website and added a delivery service that has been in high demand since the pandemic shutdowns began. Employees drop off about 60 orders a day from the company’s Chevy Chase store, though overall sales are down about 50 percent.\n  Pandora, a Danish jeweler that operates 375 stores in the United States, has moved its jewelry-cleaning machines from backrooms to the selling floor so that employees can sanitize each piece after it’s been tried on, in full view of customers.\n  Trying on jewelry comes with its own precautions. The retailer has created an elaborate system to ensure customers and employees don’t come into physical contact. Customers are instructed to stand three feet from store counters. If someone wants to try on jewelry, the employee takes the item out of the case and places it on a tray on the counter.\n    “The customer steps forward as the employee steps backward, so there’s always that six-foot space,” said Sid Keswani, president of the company’s North American operations.\n  The company also is limiting customers to five at a time and is developing new safety measures for the busy holiday season, which accounts for about 40 percent of its sales.\n  “We feel it’s a pretty safe journey,” Keswani said. “But I say  pretty safe because, as you know, there are no guarantees right now.”\n    Data show a steady increase in foot traffic since malls began reopening this month. An analysis of eight shopping centers that opened May 1, including in Oklahoma, Tennessee and Georgia, shows that it went from a trickle — about one-fifth the number of shoppers a year earlier — to a quick acceleration that in some cases exceeded average daily rates a year earlier.\n  By May 6, Midland Park Mall in Texas reported a 79 percent jump from the day before, according to  Placer.ai, which analyzes foot traffic patterns using location data from 30 million devices. Macy’s stores in South Carolina, meanwhile, saw traffic jump 9 percent from a year earlier.\n  It’s been a similar story at American Eagle, where shoppers returned cautiously at first, then with more gusto. Sales also are on the rise: Many reopened stores are selling as much merchandise as they were a year ago, according to Jay Schottenstein, the company’s chairman and chief executive.\n      “The customers who come in are coming in to buy,” he said. “They are not coming in to look.”\n  The company closed all 980 of its U.S. American Eagle and Aerie stores in March and furloughed the majority of its 40,000 workers. Reopenings began May 1, with a host of new guidelines created with help from doctors: Employees must wash their hands for 20 seconds at the beginning of each shift, then disinfect a store thermometer before taking their own temperature.\n    Alongside new protocols are more open-ended considerations. Employees are encouraged to smile from behind their masks and pay attention to nonverbal cues. “With masks on, you may feel a bit awkward at first, but don’t let that hold you up!” the employee manual says. “We don’t want this to feel like a sterile or clinical interaction. Even though you may be 6 feet apart — it’s your job to still create a connection!”\n  There are tutorials for do-it-yourself face masks, and a guide to creating badges that include a smiling picture of each employee. The goal, executives say, is to reassure customers in an era of pandemic shopping.\n  “This has been a two-month process of figuring out what it’s going to take to make people feel secure,” Schottenstein said. “It’s a new reality: Customers want to come back in, but they want to come back where they feel safe.”", "posttime": "2020-05-24 11:10:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "改变,changing,顾客", "title": "大流行是如何改变购物的？", "title_en": "How the pandemic is changing shopping", "transed": 1, "url": "https://www.washingtonpost.com/business/2020/05/21/pandemic-is-changing-every-aspect-shopping-store-layouts-how-jeans-are-folded/", "via": "", "real_tags": ["改变", "changing", "顾客"]}, {"category": "", "categoryclass": "", "imagename": "68d36bb85d6e5b385c0ca15303668138.jpg", "infoid": 1003477, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PubMed是由美国国家生物技术信息中心(NCBI)维护的庞大的生物医学文献数据库，是美国政府最受欢迎的网站之一，每天约有200万用户。因此，当PubMed发生变化时，它不会被忽视。\n然而，对于该网站的管理员来说，不幸的是，本周公布的一项全面重新设计让许多PubMed用户怒不可遏，并在社交媒体上表达了他们有时充满诅咒的抱怨。\n“难道只有我一个人讨厌新的PubMed吗？”5月19日，NCBI推出翻拍电影的第二天，埃默里大学医学院遗传学家大卫·温申克的实验室@LCNeuroScience在推特上写道。\n“没有。一见钟情。瑞士洛桑联邦理工学院的生物学家大卫·苏特(David Suter)答道，这也是第二和第三，这只是数百条类似推文中的一条，这些推文很快就得到了回应-其中一些无法在家庭友好的网站上发表。到5月22日，温申克实验室的原始推文已经获得了1600多个赞。\n许多投诉者谴责PubMed的新样式和布局，它显示搜索结果的方式，以及它理应增强的搜索算法。“这是你没要的新的PubMed。它会让你的眼睛流血，扼杀你的灵魂。密歇根大学医学院(University Of Michigan Medical School)分子生物学家保罗·詹金斯(Paul Jenkins)在推特上写道：#带回老朋友。\n我名字的最佳匹配-前五个包括两个我不是资深作者的地方。在什么世界里这是最好的搭配呢？\n--毒品猴(@Pharmgmonkeyblog)2020年5月19日。\n与此同时，分子生物学家理查德·埃布赖特敦促PubMed用户要求返回到旧版本：\nNCBI已经摧毁了PubMed。单击新PubMed主页右下角的反馈链接，通知NCBI您拒绝新界面，并要求永久提供旧界面。https://t.co/mhaVnCdwlj。\n-理查德·H·埃布赖特(@R_H_Ebright)2020年5月20日。\n其他人则提出了更微妙的看法，他们指出，几乎每一次流行网站的重新设计都会在人们学会接受之前最初受到批评。\n我也讨厌新发布的东西，但现在更接近技术/网站的一面，出于许多原因需要更新&从长远来看，更新往往会让网站变得更好。只是很难重新学习一些已经成为第二天性的东西。\n-希瑟·D·马歇尔(@CloudyMediaBlog)2020年5月22日。\n当被要求对这样的反馈发表评论时，包括NCBI在内的国家医学图书馆的一位发言人将Science Insider引导到NLM关于重新设计的博客文章。他们指出，翻拍的目的是为PubMed用户提供现代化的界面，更容易的导航，以及基于机器学习算法的更好的搜索结果。在1月份的一篇帖子中，NCBI的客户服务总监巴特·特拉维克(Bart Trawick)指出：“无论你认为新版本的PubMed就是这样，还是你对如何改进有很好的洞察力-我们都会等待你的消息。”\n这种等待显然已经结束了。5月21日，NLM主任帕特里夏·布伦南(Patricia Brennan)在Twitter上鼓励PubMed用户在其反馈表上记录他们的想法。她写道，该机构理解用户可能在过渡过程中遇到了“一些问题”。传统版本仍然可以在这里获得，尽管NCBI注意到访问它将只是短期的。\n*更新，5月23日，上午11：30：本文已更新，并提供了指向PubMed&#39；传统网站的链接。", "note_en": "PubMed, the massive database of biomedical literature maintained by the U.S. National Center for Biotechnology Information (NCBI), is one of the U.S. government’s most popular websites, with some 2 million users daily. So when something at PubMed changes, it doesn’t go unnoticed.\n Unfortunately for the site’s caretakers, however, a sweeping redesign unveiled this week has left many PubMed users fuming—and airing their sometimes curse-laden complaints on social media.\n “Am I the only one who hates the new PubMed?” tweeted @LCneuroscience, the laboratory of David Weinshenker, a geneticist at the Emory University School of Medicine, on 19 May, the day after NCBI rolled out its remake.\n  “No. Hate at first sight. Also second and third,” replied biologist David Suter of the Swiss Federal Institute of Technology Lausanne, in just one of hundreds of similar tweets that quickly came in response—some unprintable on family-friendly websites. And by 22 May, the original tweet from the Weinshenker lab had racked up more than 1600 likes.\n Many of the complainers decry PubMed’s new styling and layout, the way it displays search results, and its supposedly enhanced search algorithms. “HERE’S THE NEW PUBMED YOU DIDN’T ASK FOR. IT’S GOING TO MAKE YOUR EYES BLEED AND KILL YOUR SOUL. #bringbackoldpubmed,”  tweeted Paul Jenkins, a molecular biologist at the University of Michigan Medical School.\n  &#34;best match&#34; for my name - first five includes two where I&#39;m not senior author. In what world is that a best match?\n— Drug Monkey (@drugmonkeyblog)  May 19, 2020\n Molecular biologist Richard Ebright, meanwhile, urged PubMed users to demand a return to an older version:\n NCBI has destroyed PubMed.  Click feedback link at lower right corner of &#34;new&#34; PubMed homepage to inform NCBI that you reject the new interface and to demand permanent optional availability of the &#34;legacy&#34; interface.  https://t.co/mhaVnCdwlj\n— Richard H. Ebright (@R_H_Ebright)  May 20, 2020\n Others offered a more nuanced take, noting that nearly every redesign of a popular website is initially criticized before people learn to live with it.\n I also hate new pubmed, but being closer to the tech/website side of things now, updates are needed for many reasons &amp; often make the site better in the long run. It’s just hard to relearn something that had become second nature.\n— Heather D. Marshall (@CloudyMediaBlog)  May 22, 2020\n When asked to comment on such feedback, a spokesperson for the National Library of Medicine, which encompasses NCBI, directed  ScienceInsider to NLM blog posts about the redesign. They note the remake aimed to provide PubMed users with a modern interface, easier navigation, and better search results based on machine learning algorithms. And in a January post, Bart Trawick, NCBI’s director of customer services, noted that: “Whether you think the new version of PubMed is the bee’s knees just the way it is, or you have a great insight on how to make it better—we will be waiting to hear from you.”\n That wait is apparently over. And on 21 May, NLM Director Patricia Brennan took to Twitter to encourage PubMed users to record their thoughts on its  feedback form. The agency understands users may be experiencing “ some issues” with the transition, she wrote. The legacy version is  still available here, though NCBI notes that access to it will only be &#34;short-term.&#34;\n *Update, 23 May, 11:30 a.m.: This story has been updated with a link to PubMed&#39;s legacy site.", "posttime": "2020-05-24 10:54:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,欢迎,pubmed", "title": "他们重新设计了PubMed，一个深受欢迎的网站。这件事进行得不太顺利。", "title_en": "They redesigned PubMed, a beloved website. It hasn’t gone over well", "transed": 1, "url": "https://www.sciencemag.org/news/2020/05/they-redesigned-pubmed-beloved-website-it-hasn-t-gone-over-well", "via": "", "real_tags": ["设计", "欢迎", "pubmed"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003476, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "选择购买试用订阅港币10元，试用期4周，试用结束后每月收费港币495.00元。\n4周内可无限制享受英国“金融时报”值得信赖、屡获殊荣的商业新闻的无限量高级数字访问。\n礼品-每月与家人、朋友和同事分享多达10篇文章", "note_en": "Select  Purchase a Trial subscription for HK$10.00 for 4 weeks   You will be billed HK$495.00 per month after the trial ends\n  For 4 weeks receive unlimited Premium digital access to the FT&#39;s trusted, award-winning business news\n  Gift Article – share up to 10 articles a month with family, friends and colleagues", "posttime": "2020-05-24 10:39:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "加大,ramps,试用", "title": "索尼加大VR力度，对虚拟活动的需求激增", "title_en": "Sony ramps up VR efforts as demand for virtual events surges", "transed": 1, "url": "https://www.ft.com/content/08f620d1-a433-41e6-af7c-a12335880076", "via": "", "real_tags": ["加大", "ramps", "试用"]}, {"category": "", "categoryclass": "", "imagename": "340c281054cc9c33f843f8711358e348.jpeg", "infoid": 1003475, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“爱国者法案”即将被重新授权，但我们仍然不知道我们的网络浏览习惯是如何被收集的基本事实。", "note_en": "The Patriot Act is about to be reauthorized, but we still don't know basic facts about how our web browsing habits are being collected.", "posttime": "2020-05-24 10:39:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "fbi,idea,网络", "title": "国会不知道FBI收集了多少网络浏览数据", "title_en": "Congress Has No Idea How Much Web Browsing Data the FBI Collects", "transed": 1, "url": "https://www.vice.com/en_us/article/ep4d97/congress-has-no-idea-how-much-web-browsing-data-the-fbi-collects", "via": "", "real_tags": ["fbi", "idea", "网络"]}, {"category": "", "categoryclass": "", "imagename": "7846a43e74e98aae9cd0c2de189604fc.png", "infoid": 1003472, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在做了10年的活跃(超级)用户后，我刚刚删除了我在四方和群组上的账户，超过40000个活跃签到，1,000+张照片，100个给其他用户的小费，以及推特和其他服务使用的无数新增位置数据。\n我不想再登记和贡献我的数据了。我不想主动向他们的系统提供我的数据，如果可能的话，甚至是被动的。\n既然Foursquare不在乎他们的超级用户花了多少时间来保持Foursquare数据的更新，而机器人们却在用无稽之谈的数据浪费我们的时间，而且他们也几乎抛弃了他们的普通用户，所以我决定离开这个平台，加入OpenStreetMap，为一个真正的众包和开放平台做出贡献。\n多亏了Foursquare，我对随机POI非常了解，我将利用这些知识来编辑OSM。现在我正在阅读大量的常见问题解答和维基，因为OSM并非易事，但我非常肯定我会在以后的很多年里做出贡献。\n(最初的日记条目是我的推文的副本，从这一次开始：https://twitter.com/pzumk/status/1263504225222492160But我编辑了条目，使其更具可读性，因为我没有意识到这是公开的，哈哈)。\n地点：德国下萨克森州汉诺威地区汉诺威中心", "note_en": "I have just now deleted my accounts on Foursquare and Swarm after being an active (super) user for 10 years with more than 40000 active check-ins, 1000+ photos, 100s tipps for other users and a innumerable amount of added location data which has been used by Twitter and other services.\n I don’t want to check-in and contribute my data anymore. I don’t want to actively feed their system with my data, if possible not even passively.\n Since Foursquare doesn’t care about the time their super users have been spending to keep the Foursquare-data fresh whilst bots are wasting our time with nonsense data, and since they are also pretty much abandoning their normal users too, I have decided to leave the platform and join OpenStreetMap to contribute to a real crowdsourced and open platform.\n Thanks to Foursquare I know pretty much about random POI and I’m going to use that knowledge to edit the OSM. Right now I’m reading a lot of the FAQs and Wikis because OSM isn’t easy, but I’m pretty sure I’ll contribute for many years.\n  (The original diary entry was a copy of my tweets, starting with this once:  https://twitter.com/pzumk/status/1263504225222492160But I have edited the entry to make it more readable as I didn’t realise this is public, haha)\n Location:  Centre, Hanover, Region Hannover, Lower Saxony, Germany", "posttime": "2020-05-24 10:08:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "foursquare,数据", "title": "再见，Foursquare，你好，OpenStreetMap", "title_en": "Goodbye Foursquare, Hello OpenStreetMap", "transed": 1, "url": "https://www.openstreetmap.org/user/pzumk/diary/393135", "via": "", "real_tags": ["数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003471, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Tails使用Tor网络来保护您的在线隐私，并帮助您避免审查。尽情享受互联网的乐趣吧。\n关闭计算机并在Tails USB棒上启动，而不是在Windows、MacOS或Linux上启动。尾巴在关闭时不会在计算机上留下任何痕迹。\nTails包括一系列应用程序，分别用于处理敏感文档和进行通信。Tails中的一切都是现成的，并且都有安全的默认设置。\n您可以免费下载Tails，独立的安全研究人员可以验证我们的工作。Tails基于Debian GNU/Linux。\n记者和他们的消息来源使用Tail发布敏感信息，并从不安全的地方访问互联网。\n我们的工作资金来自像你们这样的人和支持互联网自由的组织的捐款。见见我们的合作伙伴。", "note_en": "Tails uses the Tor network to protect your privacy online and help you avoidcensorship. Enjoy the Internet like it should be.\n Shut down the computer and start on your Tails USBstick instead of starting on Windows, macOS, or Linux. Tails leaves no trace on the computer when shut down.\n Tails includes a selection of applications to work on sensitive documents and communicatesecurely. Everything in Tails is ready-to-use and has safe defaults.\n You can download Tails for free and independent security researchers can verify ourwork. Tails is based on Debian GNU/Linux.\n   Journalists and their sources use Tails to publish sensitive informationand access the Internet from unsafe places.\n  Our work is funded by donations from people like you andorganizations that support Internet freedom.  Meet ourpartners.", "posttime": "2020-05-24 09:53:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "操作系统,审查,operating,tails", "title": "Tails是一种保护您的隐私并避免审查的操作系统", "title_en": "Tails is a operating system that protects your privacy and avoids censorship", "transed": 1, "url": "https://tails.boum.org/?new", "via": "", "real_tags": ["操作系统", "审查", "operating", "tails"]}, {"category": "", "categoryclass": "", "imagename": "f37257ead15263e4bae3f43dc6cf1941.jpg", "infoid": 1003470, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纯洁与危险：为什么有些人对封锁感到奇怪的安慰，害怕群体免疫力，并迅速惩罚任何质疑他们之间严峻选择的人", "note_en": "Purity and danger: Why some are strangely comforted by lockdowns, fearful of herd immunity, and quick to punish anyone who questions the stark choice between them", "posttime": "2020-05-24 09:37:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免疫,immunity,群体", "title": "“羊群免疫禁忌”杂志", "title_en": "The Herd Immunity Taboo – Tablet Magazine", "transed": 1, "url": "https://www.tabletmag.com/sections/science/articles/plague-journal-herd-immunity-doidge", "via": "", "real_tags": ["免疫", "immunity", "群体"]}, {"category": "", "categoryclass": "", "imagename": "ffba0988fc2934bb29cb88a3038bd774.jpg", "infoid": 1003469, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一篇题为“MongoDB和Jepsen”的文章中，MongoDB声称他们的数据库通过了“业界最严格的数据安全性、正确性和一致性测试”。作为回应，Jepsen发表了一篇文章，声称MongoDB 3.6.4实际上没有通过他们的测试；而更新的MongoDB 4.2.6有更多的问题，包括“回溯因果事务”，即事务颠倒顺序，以便读取可以看到未来写入的结果。\n杰普森有限责任公司(Jepsen LLC)的回应始于他们在官方Twitter上对Maxime Beugnet的回复：\n我不得不承认，当我看到那个网页时，我感到惊讶。在该报告中，MongoDB在默认情况下丢失了数据并违反了因果规则。不知何故，这成为当今所有可用的数据库中数据一致性、正确性和安全性保证最强的数据库之一！\n这份报告被Kit Patella命名为MongoDB 3.6.4。凯尔·金斯伯里(Kyle Kingsbury)的这份新报告对此进行了扩展：\n类似地，MongoDB的默认读取关注度允许中止读取：读取器可以观察到未完全提交的状态，并且在将来可能会被丢弃。正如读隔离一致性文档所指出的，“未提交的读操作是默认的隔离级别”。\n我们发现，由于这些弱缺省值，MongoDB的因果会话在缺省情况下不能保持因果一致性：用户需要同时指定写和读关注点多数(或更高)才能实际获得因果一致性。MongoDB解决了这个问题，说它正在按设计工作，并更新了他们的隔离文档，指出即使MongoDB提供了“客户端会话中的因果一致性”，但除非用户小心地同时使用读和写关注点多数，否则这一保证是站不住脚的。现在有一个详细的表显示了较弱的读写关注点提供的属性。\n近年来，MongoDB一直在大力推广其事务功能。但正如杰普森发现的那样，默认情况下，事务支持不起作用。在一个测试中，使用事务将值追加到文档。他们发现，即使数据库/集合级别的写关注占大多数，当在事务级别使用默认的写关注时，“事务似乎会丢失确认的写入”。(这可以通过在事务级别显式指定写入关注点来解决。)。\n客户端观察到一个单调增长的元素列表，直到[1 2 3 4 5 6 7]，此时列表重置为[]，并从[8]重新开始。这可能是MongoDB回滚的一个例子，这是“数据丢失”的一种花哨的说法。\n这很糟糕，但一个更微妙的问题出现了：我们到底为什么能够读取这些值？毕竟，Read Concerns Linizable应该只显示大多数确认的(即持久的)写入。答案是一个令人惊讶但有文档记录的MongoDB设计选择：\n事务中的操作使用事务级别的读取关注点。也就是说，在集合和数据库级别设置的任何读取关注点在事务内都会被忽略。\n这实际上意味着“没有显式读取关注点的事务将数据库或集合级别的任何请求的读取关注点降级为缺省的本地级别”，从而允许事务读取可能稍后回滚的未提交数据。\n反之亦然。根据文档，“如果事务没有对提交使用写关注点”多数“，则快照读取关注点不能保证读取操作使用了提交多数的数据的快照。”换言之，在不设置写关注点的情况下，有效地忽略了读关注点“快照”。同样，这必须在事务级别完成，因为事务会忽略集合和数据库级别的设置。\n即使使用快照隔离，也有许多场景会产生意想不到的结果。它们中的大多数都太复杂了，无法在这里概括，但其中有一个确实很突出。\n在一项测试中，杰普森的研究人员告诉客户阅读一份文档，然后给它附加一个值。在测试开始时，文档包含序列[2，3，4]。读取该值后，文档被更改为[1，2，3，4]。\n这通常是有效的，但在四个事务中，客户端从数据库读取[1，2，3，4]。\n当然，这是不可能的：我们的测试严格按照顺序提交每个事务的操作，除非MongoDB构建了时间机器，否则它不能返回它还不知道将被写入的值。这表明回溯因果事务实际上运行了两次，在第二次运行时，观察到了它自己先前执行的效果。这可能是不适当的重试机制造成的另一个后果。\n我们发现网络分区可能会导致MongoDB复制事务的影响。尽管从未两次将相同的值附加到一个数组中，但我们反复观察到具有同一元素的多个副本的数组。\n为了更好地理解这些行为，研究人员试图禁用自动重试，结果却发现“MongoDB事务忽略了retryWrites设置，不管怎样都重试”。\n除了向开发者提供如何更安全地使用MongoDB的建议外，Jepsen还建议“MongoDB可能希望修改他们的营销语言，使用‘快照隔离’而不是‘ACID’”。\n编辑注意：本文的前一个版本暗示在使用事务时总是会发生数据丢失。此特定问题仅在使用事务的默认写入关注点时发生。但是，使用写入关注点多数的事务检测到了其他异常。\nInfoQ上上周内容的综述每周二都会发布。加入一个超过25万名高级开发人员的社区。查看示例。\n选择您的国家/地区我同意InfoQ.com按照本隐私声明中的说明处理我的数据。", "note_en": "In an article titled  MongoDB and Jepsen, MongoDB claimed that their database passed “the industry’s toughest data safety, correctness, and consistency Tests”. In response, Jepsen published an article stating that MongoDB 3.6.4 had in fact failed their tests; the newer  MongoDB 4.2.6 has more problems including “retrocausal transactions” where a transaction reverses order so that a read can see the result of a future write.\n  Jepsen LLC’s response begins with this  reply to Maxime Beugnet on their official Twitter feed:\n  I have to admit raising an eyebrow when I saw that web page. In that report, MongoDB lost data and violated causal by default. Somehow that became &#34;among the strongest data consistency, correctness, and safety guarantees of any database available today&#34;!\n  The report in question was titled  MongoDB 3.6.4 by Kit Patella. The new report, by Kyle Kingsbury, expands on this:\n  Similarly, MongoDB’s default level of read concern allows aborted reads: readers can observe state that is not fully committed, and could be discarded in the future. As the read isolation consistency docs note, “Read uncommitted is the default isolation level”.\n  We found that due to these weak defaults, MongoDB’s causal sessions did not preserve causal consistency by default: users needed to specify both write and read concern majority (or higher) to actually get causal consistency. MongoDB closed the issue, saying it was working as designed, and updated their isolation documentation to note that even though MongoDB offers “causal consistency in client sessions”, that guarantee does not hold unless users take care to use both read and write concern majority. A detailed table now shows the properties offered by weaker read and write concerns.\n    In recent years MongoDB has been heavily promoting its transactional capabilities. But as Jepsen found, transactional support doesn’t work by default. In one test, transactions were used to append values to a document. They found that even with write concern majority at the database/collection level, “transactions appeared to lose acknowledged writes” when using the default write concern at the transactional level. (This can be addressed by explicitly specifying a write concern at the transaction level.)\n  Clients observed a monotonically growing list of elements until [1 2 3 4 5 6 7], at which point the list reset to [], and started afresh with [8]. This could be an example of MongoDB  rollbacks, which is a fancy way of saying “data loss”.\n  This is bad, but a more subtle question arises: why were we able to read these values at all? After all, read concern linearizable is supposed to show only majority-acknowledged (i.e. durable) writes. The answer is a surprising—but documented—MongoDB design choice:\n  Operations in a transaction use the transaction-level read concern. That is, any read concern set at the collection and database level is ignored inside the transaction.\n  Effectively this means “transactions without an explicit read concern downgrade any requested read concern at the database or collection level to a default level of local”, allowing the transaction to read uncommitted data which may be later rolled back.\n  The inverse is also problematic. According to the documentation, “If the transaction does not use write concern “majority” for the commit, the &#34;snapshot&#34; read concern provides no guarantee that read operations used a snapshot of majority-committed data.”. In other words, the read concern “snapshot” is effectively ignored without setting the write-concern. And again, this must be done at the transaction level because transactions ignore the collection and database level settings.\n    Even with snapshot isolation, there were numerous scenarios with unexpected results. Most of them are too complex to summarize here, but one of them really stood out.\n  In one test, Jepsen researchers told the client to read a document and then append a value to it. At the start of the test, the document contained the sequence [2, 3, 4]. After reading the value, the document was altered to be [1, 2, 3, 4].\n  This usually worked, but in four transactions the client read [1, 2, 3, 4] from the database. Kingsbury continues,\n  This is, of course, impossible: our test submits each transaction’s operations in strict order, and unless MongoDB has built a time machine, it cannot return values which it doesn’t yet know will be written. This suggests that the retrocausal transaction actually ran twice, and on its second run, observed an effect of its own prior execution. This could be another consequence of an inappropriate retry mechanism.\n    We found that network partitions could cause MongoDB to duplicate the effects of transactions. Despite never appending the same value to an array twice, we repeatedly observed arrays with multiple copies of the same element.\n  In an attempt to understand these behaviors better, researchers attempted to disable automatic retries only to discover that “MongoDB transactions ignore the retryWrites setting, and retry regardless”.\n  In addition to offering advice to developers on how to more safely use MongoDB, Jepsen recommends that “MongoDB may wish to revise their marketing language to use ‘snapshot isolated’ instead of ‘ACID’”.\n  Editors Note: A previous version of this article implied that that data loss could always occur when using transactions. This specific problem only occured when using the default write concern for transactions. However, other anomalies were detected with transactions using write concern majority.\n  A round-up of last week’s content on InfoQ sent out every Tuesday. Join a community of over 250,000 senior developers.\r \r\t\t\t View an example\n  Select your country              I consent to InfoQ.com handling my data as explained in this  Privacy Notice.", "posttime": "2020-05-24 09:08:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "mongodb,驳斥,disputes", "title": "杰普森驳斥MongoDB的数据一致性主张", "title_en": "Jepsen Disputes MongoDB's Data Consistency Claims", "transed": 1, "url": "https://www.infoq.com/news/2020/05/Jepsen-MongoDB-4-2-6/", "via": "", "real_tags": ["mongodb", "驳斥", "disputes"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003468, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "社交网站上的评论必须以某种方式分类。大平台是如何做到这一点的-是推荐系统、学习排名算法、马尔可夫决策过程、神经网络和学习自动机的复杂组合吗？嗯，也许在某些情况下，但通常只是一个简单的公式。在本文中，我们使用虚拟评论区模拟来测试黑客新闻、YouTube和Reddit使用的公式以及一些替代公式。剧透提醒：YouTube做得不好。\n240名访问者在24小时内以相等的间隔递增。每位访问者被随机分配为评论者(10%)或投票者(90%)。评论者留下一条评论，这会得到随机分配的质量类别：很好(10%)、一般(80%)或较差(10%)。好的评论获得赞成票的可能性很高，获得反对票的可能性较低；恶臭的人则相反；另一方面，投票者看到排名靠前的评论，并根据其概率进行投票。在这一点上，他们停止阅读或继续阅读，该概率取决于他们刚刚投出的选票(赞成票为0%，反对票为50%，反对票为15%)。如果他们不离开，他们将看到下一个排名的评论，该过程将继续进行，直到他们最终离开或阅读所有评论。当模拟结束时，他们将看到下一个排名的评论，该过程将继续，直到他们最终离开或阅读所有评论。当模拟结束时，他们将看到下一个排名的评论，并且该过程将继续，直到他们最终离开或阅读所有评论。当模拟结束时，他们停止阅读或继续进行，该概率取决于他们刚刚给出的投票的概率。\n当然，这并不是每个评论区的完美模型。有些参数在某些情况下是不合适的。实际上，访问率可能会随着时间的推移而变化。选民在最近(非)投票的条件下，在某条评论后离开的概率也可能取决于他们已经阅读了多少评论。评论线程不会出现。投票概率可能会随着时间的推移而变化。等等。\n我们分析中的所有排名方法都是通过给每条评论打分，并按降序排列评论。分数由下面的公式确定。\n从基础开始，我们有比率和差值，也就是。净上升的数量。我们不认为这些是最优的，但它们是有用的基线。另一个版本的比率表现类似。\n出于测试目的，我们有随机排名，也就是随机排名，以及根据真正的向上投票概率排名的上升概率排名。\nReddit的算法，在这里详述，是一种基于和估计真实投票概率的频繁方法。这是我们称之为贝叶斯平均的贝叶斯版本：与比率相同，但我们假设投出了几张额外的“幻影”选票，比如3张反对票和3张赞成票。\nHacker News粗略地使用公式，如果我们将分母解释为对投票数量的估计，那么它就像比率一样，实际上，这个分母可能更自然地被认为是对包括隐性不投票在内的投票数量的估计，不投票(值为0)不会影响分子。\n为了了解模拟效果，以下是使用黑客新闻评分公式在一次运行中向第240名访问者提供的评论：\nYouTube还使用了一个涉及评论年龄的公式，他们的系统额外考虑了用户的生命周期比率，在我们的测试中，我们将其设置为0，就好像所有用户都是新用户一样。\n最后，让我们考虑一下如何修改贝叶斯平均来考虑时间。为了使新的评论更明显，我们将首先使幻影投票全部上升，然后渐近地将其降低为不投票。我们还将切换到类似于Hacker News公式的分母来估计不投票。这将产生修改后的贝叶斯公式。这就产生了修改后的贝叶斯公式。为了估计不投票，我们还将使用类似于Hacker News公式的分母。这将产生修改后的贝叶斯公式。\n我用每个公式做了足够多的模拟运行(1,000-20000次)，对它们的比较相当有信心。没有更多的麻烦，瞧：\n所以YouTube略好于随机，Reddit比简单的差异差，而黑客新闻是三个中唯一一个比贝叶斯平均好的。令人失望，但也有可能。结果的概括性如何？一如既往，…需要做更多的工作", "note_en": "Comments on social sites have to be sorted somehow.How do big platforms do it – is it some complicated mix ofrecommender systems,learning-to-rank algorithms,Markov decision processes,neural networks, andlearning automata?Well, maybe in  some casesbut often it’s just a simple formula.In this article we put the formulas used by Hacker News, YouTube, andReddit, along with a few alternatives, to the test, using virtual commentsection simulations.Spoiler alert: YouTube does not do well.\n  240 visitors arrive at equally spaced increments over a 24 hour period.Each visitor is randomly assigned as a commenter (10%) or a voter (90%).Commenters leave a single comment, which gets a randomly assigned qualitycategory: great (10%), mediocre (80%), or stinker (10%).Great comments have a high probability of receiving upvotes and a lowprobability of receiving downvotes;stinkers are the reverse;and mediocre comments have a low probability of receiving any votes.Voters, on the other hand, see the top-ranked comment and vote accordingto its probabilities.At this point they stop reading or keep going based on a probability thatdepends on the vote they just gave (0% for upvotes, 50% for downvotes, 15% fornon-votes).If they don’t leave, they see the next-ranked comment and the process continuesuntil they finally do leave or they read all the comments.When the simulation concludes, we log the average number of upvotes pervisitor which we use as our utility function.\n  Of course this is not a perfect model of every comment section.Some of these parameters will be inappropriate in some cases.Realistically the rate of visitors may vary over time.A voter’s probability of leaving after a certain comment conditional on themost recent (non-)vote may also depend on how many comments they’ve alreadyread.Comment threads are not represented.Vote probabilities may change over time.Et cetera, et cetera.\n    All ranking methods in our analysis rank comments by scoring each commentand in descending order.The scores are determined by the formulas below.\n Starting with the basics, we have the  ratioand the  difference , a.k.a. the number of net upvotes.We don’t expect these to be optimal but they’re useful baselines.Another version of the ratio is which performs similarly.\n For testing purposes, we have the  random ranking which is, well, justrandom, and the  upvote probability ranking which ranks according to the trueupvote probability.\n Reddit’s algorithm, detailed  here,is a frequentist method for estimating the true voting probabilitiesbased on  and .The  Bayesianversion of this is what we’ll call the  Bayesian average: the same as ratio but we imagine that a few extra “phantom” votes have been cast, say 3downvotes and 3 upvotes.\n Hacker News  roughlyuses the formula ,which is like  ratio, if we interpret the denominator as an estimate of the number votes cast.In fact, this denominator is probably more naturally thought of as anestimate of the number of votes cast including implicit non-votes.Non-votes (with a value of 0) would not impact the numerator.\n To get a sense of how the simulations look, here are the comments as presentedto the 240th visitor from one run using the Hacker News scoring formula:\n  YouTube also uses a  formula thatinvolves the age of the comment.Their system additionally factors in the user’s lifetime ratio, whichfor our tests we set to 0 as if all users are new.\n Lastly, let’s consider how we might modify the Bayesian average to taketime into account.To make new comments more visible we’ll make the phantom votes all upvotesat first, then asymptotically reduce them to non-votes.We’ll also switch to a denominator similar to the Hacker News formula’s inorder to estimate non-votes.This yields the  modified Bayes formula\n   I did enough simulation runs (1000-20000) with each formulato be pretty confident about how they compare.Without further ado, voila:\n  So YouTube is marginally better than  random, Reddit is worse than the simple  difference, andHacker News is the only one of the three better than  Bayesian average.Disappointing but also plausible. How generalizable are the results?As always, more work required…", "posttime": "2020-05-24 09:07:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "algorithms,算法,黑客,youtube,排名", "title": "评论排名算法：黑客新闻VS YouTube VS Reddit", "title_en": "Comment Ranking Algorithms: Hacker News vs. YouTube vs. Reddit", "transed": 1, "url": "http://amacfie.github.io/2020/05/21/comment-ranking/", "via": "", "real_tags": ["算法", "黑客", "youtube", "排名"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003466, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "监狱&amp；#8203Break&lt；/div&gt；&lt；/a&gt；&lt；div id=&#34；altStoreSection&#34；style=&#34；display：None&#34；&gt；&lt；a id=&#34；altStoreLink&34；&gt；&lt；div class=&#34；Button Second Button expandOutElement&#34；&。注意：必须安装最新版本的AltStore才能使用此功能。&lt；/span&&gt;；/style=&#34；display:none&#34；&gt；Download&lt；/p&gt；；&lt；a id=&#34；AltDownloadURL&#34；&gt；&lt；p id=&#34；altDownloadURL&#34；altDownloadURL&#34；/a&&gt;&lt；a id=&#34；安装链接URL&34；&gt；a id=&#34；安装链接URL&#34；&gt；p id=&#34；altDownloadURL&#34；/a&gt；&lt；a=&#34；安装链接URL&#34；&gt；style=&#34；display:none&#34；&gt；Download&lt；/p&gt；&lt；/a&gt；&lt；div id=&#34；PayLinks&34；&gt；&lt；a href=&#34；https://www.paypal.me/pwn20wnd&#34；&gt；&lt；svg版本=&#34；1.1&#34；id=&#34；CAPA_1&34；xmlns=&#34；http://www.w3.org/2000/svg&#34；xmlns:xlink=&#34；http://www.w3.org/1999/xlink&#34；x=&#34；0px&#34；y=&#34；0px&#34；ViewBox=&#34；0 0512512&#34；启用-背景：新建0 512512；&#34；xml：space=&#34；保留&#34；宽度=40 Height=40；gt；&lt；g&gt；&lt；path class=&#34；st1。M111.4 295.9c-3.519.2-17.4 108.7-21.5134-.31.8-122.5-3 2.5H12.3c-7.60-13.1-6.6-12.1-13.9L58.8 46.6c1.5-9.610.1-16.9 20-16.9 152.3 0 165.1-3.7204 11.4 60.1 23.3 65.6 79.5 44 140.3-21。.562.6-72.589.5-140.1 90.3-43.4.7-69.5-7-75.324.2zM357.1 152c-1.80-1.32.5-1.8-31.3-211.4-5.122.5-8.833.6-39.9 113.8-150.5 103.9-204.5 103.9-6.10-10.13.3-10.9.。140.4-27.1 169.7-27.1 169.7-17.1 3.512.9 10.6 12.9h63.5c8.6 015.7-6.317.4-14.9.7-5.4-1.6.1 14.4-91.34.6-22 14.3-19.729.3-19.7 71 0 126.4-28.8 142.9-112.3 6.5-34.8。4.6-71.4-23.8-92.6z&#34；/&gt；&lt；/g&gt；&lt；/svg；&lt；/a&gt；&lt；a href=&#34；https://www.patreon.com/Pwn20wnd&#34；&gt；&lt；svg版本=&#34；1.1&#34；id=&#34；CAPA_1&#34；xmlns=&#34；http://www.w3.org/2000/svg&#34；xmlns：xlink=&#34；http://www.w3.org/1999/xlink&#34；x=&#34；0px&#34；y=&#34；0px&#34；ViewBox=&#34；0 0512512&#34；启用-背景：新建0 512512；&#34；xml：space=&#34；保留&#34；宽度=40 Height=40；gt；&lt；g&gt；&lt；path class=&#34；st1。M512194.8c0 101.3-82.4 183.8-183.8 183.8-101.7 0-184.4-82.4-184.4-183.8 0-101.6 82.7-184.3 184.4-184.3C429.610.551293.2512 194.8zM0 501.5h90v-491H0v491z&34；/&gt；&lt；/g&gt；&lt；/g&gt；&lt；/svg&gt；&lt；/a&gt；/div&gt；&lt；p id=&#34；viewLegacyVersions&#34；onclick=&#34；viewLegacyVersions()&#34；fadeUpElement viewMoreGlobal&34；&gt；查看以前的版本&lt；/p&gt；&lt；div id=&#34；legacyReleases&#34；&gt；&lt；/div&gt；div class=&#34；关于隐藏的越狱&34；&gt；&lt；h1&gt；关于un0ver&lt；/h1&gt；p&gt；un0ver是一个监狱&amp；#8203越狱，这意味着您可以自由地对您的iOS设备做任何您想做的事情。允许您更改所需内容并在您的权限范围内操作，un0ver可释放您的iDevice。&lt；/p&&gt;；/div&gt；&lt；div class=&#34；关于越狱隐藏&#34；&gt；H1&&gt;；安装指南&lt；/H1&&gt;；&lt；div class=&#34；plillSelector&34；&gt；SPAN onClick=&#34；changeInstall(this)&#34；&gt；Windows&lt；/span&gt；&lt；SPAN onClick=&#34；changeInstall(this)&#34；&gt；Linux&lt；/span&gt；&lt；SPAN onClick=&#34；changeInstall(this)&#34；&gt；iOS&lt；/span&gt；&lt；div id=&#34；&gt；&lt；/div&&gt;；&lt；/div&&gt;；&lt；div class=&#34；安装信息&34；id=&#34；macosGuide；style=&#34；显示：Block；&34；&gt；&lt；h1&gt；AltStore&lt；/h1&&gt;；&lt；ol&&gt;；&lt；li&&gt;；下载&lt；a href=&#34；https://www.altstore.io/&#34；&gt；AltStore&lt；/a&gt；.。使用操作系统的链接。&lt；/li&&gt;；&lt；/li&gt；&li&gt；解压并将AltStore移动到您的应用程序文件夹。&lt；/li&gt；&lt；启动AltStore应用程序。&lt；/li&&gt;；&lt；/li&&gt;单击菜单栏中的AltStore图标，然后单击安装邮件插件选项。&lt；/li&gt；&。/li&gt；&lt；li&gt；打开邮件首选项中的常规选项卡，单击管理插件，选中AltPlugin，然后应用并重新启动邮件。&lt；/li&gt；&lt；li&gt；通过USB连接您的iOS设备。/li&gt；&lt；&lt；li&gt；单击菜单栏中的AltStore，然后转到安装AltStore&amp；#8594(您的iOS设备)&lt；/。&lt；li&&gt;在您的iOS设备上，打开设置&amp；#8594常规&amp；#8594设备管理，然后点击您的苹果ID。&lt；/li&&gt;；Trust AltStore。/li&&gt;；&lt；/li&&gt;；点击位于&lt；a onClick=&#34；goTo(&#39；uncoverCenterTitle&#39；)&#34；&gt；above&lt；/a&gt；.&lt；/li&gt；的&amp；报价在AltStore中打开&amp；报价按钮。&lt；li&gt；AltStore现在将安装该应用程序。等待它完成。&lt；/li&&gt;；&lt；/li&gt；&lt；h1&gt；xcode+iOS A；打开Un0ver和监狱#8203Break！&lt；/ol&gt；&lt；h1&gt；xcode+iOS A", "note_en": "jail&amp;#8203break&lt;/div&gt; &lt;/a&gt; &lt;div id=&#34;altStoreSection&#34; style=&#34;display:none&#34;&gt; &lt;a id=&#34;altStoreLink&#34;&gt; &lt;div class=&#34;button secondaryButton expandOutElement&#34;&gt;Open in AltStore&lt;/div&gt; &lt;/a&gt; &lt;span&gt;Note: The latest version of AltStore must be installed to use this feature.&lt;/span&gt; &lt;/div&gt; &lt;a id=&#34;alternativeDownloadURL&#34;&gt; &lt;p id=&#34;altDownloadURL&#34; style=&#34;display:none&#34;&gt;Download&lt;/p&gt; &lt;/a&gt; &lt;a id=&#34;installLinkURL&#34;&gt; &lt;p id=&#34;installLink&#34; style=&#34;display:none&#34;&gt;Download&lt;/p&gt; &lt;/a&gt; &lt;div id=&#34;payLinks&#34;&gt; &lt;a href=&#34;https://www.paypal.me/pwn20wnd&#34;&gt; &lt;svg version=&#34;1.1&#34; id=&#34;Capa_1&#34; xmlns=&#34;http://www.w3.org/2000/svg&#34; xmlns:xlink=&#34;http://www.w3.org/1999/xlink&#34; x=&#34;0px&#34; y=&#34;0px&#34; viewBox=&#34;0 0 512 512&#34; style=&#34;enable-background:new 0 0 512 512;&#34; xml:space=&#34;preserve&#34; width=40 height=40&gt; &lt;g&gt; &lt;g&gt; &lt;path class=&#34;st1&#34; d=&#34;M111.4 295.9c-3.5 19.2-17.4 108.7-21.5 134-.3 1.8-1 2.5-3 2.5H12.3c-7.6 0-13.1-6.6-12.1-13.9L58.8 46.6c1.5-9.6 10.1-16.9 20-16.9 152.3 0 165.1-3.7 204 11.4 60.1 23.3 65.6 79.5 44 140.3-21.5 62.6-72.5 89.5-140.1 90.3-43.4.7-69.5-7-75.3 24.2zM357.1 152c-1.8-1.3-2.5-1.8-3 1.3-2 11.4-5.1 22.5-8.8 33.6-39.9 113.8-150.5 103.9-204.5 103.9-6.1 0-10.1 3.3-10.9 9.4-22.6 140.4-27.1 169.7-27.1 169.7-1 7.1 3.5 12.9 10.6 12.9h63.5c8.6 0 15.7-6.3 17.4-14.9.7-5.4-1.1 6.1 14.4-91.3 4.6-22 14.3-19.7 29.3-19.7 71 0 126.4-28.8 142.9-112.3 6.5-34.8 4.6-71.4-23.8-92.6z&#34; /&gt; &lt;/g&gt; &lt;/g&gt; &lt;/svg&gt; &lt;/a&gt; &lt;a href=&#34;https://www.patreon.com/Pwn20wnd&#34;&gt; &lt;svg version=&#34;1.1&#34; id=&#34;Capa_1&#34; xmlns=&#34;http://www.w3.org/2000/svg&#34; xmlns:xlink=&#34;http://www.w3.org/1999/xlink&#34; x=&#34;0px&#34; y=&#34;0px&#34; viewBox=&#34;0 0 512 512&#34; style=&#34;enable-background:new 0 0 512 512;&#34; xml:space=&#34;preserve&#34; width=40 height=40&gt; &lt;g&gt; &lt;g&gt; &lt;path class=&#34;st1&#34; d=&#34;M512 194.8c0 101.3-82.4 183.8-183.8 183.8-101.7 0-184.4-82.4-184.4-183.8 0-101.6 82.7-184.3 184.4-184.3C429.6 10.5 512 93.2 512 194.8zM0 501.5h90v-491H0v491z&#34; /&gt; &lt;/g&gt; &lt;/g&gt; &lt;/svg&gt; &lt;/a&gt; &lt;/div&gt; &lt;p id=&#34;viewLegacyVersions&#34; onclick=&#34;viewLegacyVersions()&#34; class=&#34;fadeUpElement viewMoreGlobal&#34;&gt; View Previous Versions &lt;/p&gt; &lt;div id=&#34;legacyReleases&#34;&gt;&lt;/div&gt; &lt;!-- Long Description (Built from the ground up) --&gt; &lt;div id=&#34;detailedInfo&#34;&gt; &lt;div class=&#34;aboutJailbreak hidden&#34;&gt; &lt;h1&gt;About unc0ver&lt;/h1&gt; &lt;p&gt;unc0ver is a jail&amp;#8203break, which means that you can have the freedom to do whatever you would like to do to your iOS device. Allowing you to change what you want and operate within your purview, unc0ver unlocks the true power of your iDevice.&lt;/p&gt; &lt;/div&gt; &lt;div class=&#34;aboutJailbreak hidden&#34;&gt; &lt;h1&gt;Installation Guide&lt;/h1&gt; &lt;div class=&#34;pillSelector&#34;&gt; &lt;span onClick=&#34;changeInstall(this)&#34;&gt;macOS&lt;/span&gt; &lt;span onClick=&#34;changeInstall(this)&#34;&gt;Windows&lt;/span&gt; &lt;span onClick=&#34;changeInstall(this)&#34;&gt;Linux&lt;/span&gt; &lt;span onClick=&#34;changeInstall(this)&#34;&gt;iOS&lt;/span&gt; &lt;div id=&#34;pillSelectorPill&#34;&gt;&lt;/div&gt; &lt;/div&gt; &lt;div class=&#34;installInfo&#34; id=&#34;macosGuide&#34; style=&#34;display: block;&#34;&gt; &lt;h1&gt;AltStore&lt;/h1&gt; &lt;ol&gt; &lt;li&gt;Download &lt;a href=&#34;https://www.altstore.io/&#34;&gt;AltStore&lt;/a&gt;. Use the link for your operating system.&lt;/li&gt; &lt;li&gt;Unzip and move AltStore to your Applications folder.&lt;/li&gt; &lt;li&gt;Launch the AltStore application.&lt;/li&gt; &lt;li&gt;Click on the AltStore icon in the Menu Bar, and then click on the Install Mail Plug-in option.&lt;/li&gt; &lt;li&gt;Open the Mail app, and click on Mail &amp;#8594 Preferences in the menu bar.&lt;/li&gt; &lt;li&gt;Open the General tab in mail preferences, click Manage Plug-ins, check AltPlugin, and apply and restart Mail.&lt;/li&gt; &lt;li&gt;Connect your iOS device via USB.&lt;/li&gt; &lt;li&gt;Click AltStore in the menu bar, then go to Install AltStore &amp;#8594 (Your iOS Device)&lt;/li&gt; &lt;li&gt;Login with your Apple ID when prompted and click install.&lt;/li&gt; &lt;li&gt;On your iOS device, open Settings &amp;#8594 General &amp;#8594 Device Management and tap on your Apple ID.&lt;/li&gt; &lt;li&gt;Trust AltStore.&lt;/li&gt; &lt;li&gt;Tap the &amp;quotOpen in AltStore&amp;quot button located &lt;a onClick=&#34;goTo(&#39;uncoverCenterTitle&#39;)&#34;&gt;above&lt;/a&gt;.&lt;/li&gt; &lt;li&gt;AltStore will now install the app. Wait until it finishes.&lt;/li&gt; &lt;li&gt;Open unc0ver and jail&amp;#8203break!&lt;/li&gt; &lt;/ol&gt; &lt;h1&gt;Xcode + iOS App Signer&lt;/h1&gt; &lt;ol&gt; &lt;li&gt;Install Xcode, open it, and agree to the license agreement.&lt;/li&gt; &lt;li&gt;Plug in your iOS device and select it as the build target.&lt;/li&gt; &lt;li&gt;Open Xcode and create a new iOS Application.&lt;/li&gt; &lt;li&gt;Type a name and identifier.&lt;/li&gt; &lt;li&gt;Xcode will complain about the lack of a provisioning profile. Click fix issue.&lt;/li&gt; &lt;li&gt;Sign into an Apple ID when prompted.&lt;/li&gt; &lt;li&gt;Download &lt;a href=&#34;https://dantheman827.github.io/ios-app-signer/&#34;&gt;iOS App Signer&lt;/a&gt;&lt;/li&gt; &lt;li&gt;Download the latest version of unc0ver from &lt;a onClick=&#34;goTo(&#39;uncoverCenterTitle&#39;)&#34;&gt;above&lt;/a&gt;.&lt;/li&gt; &lt;li&gt;Open iOS App Signer.&lt;/li&gt; &lt;li&gt;Select the ipa you just downloaded as an input file.&lt;/li&gt; &lt;li&gt;Click start.&lt;/li&gt; &lt;li&gt;Return to Xcode. Go to the menu bar. Click Window &amp;#8594 Devices.&lt;/li&gt; &lt;li&gt;Find your device, click the plus, and select the file created by iOS App Signer.&lt;/li&gt; &lt;li&gt;Open unc0ver on your device and jail&amp;#8203break!&lt;/li&gt; &lt;/ol&gt; &lt;h1&gt;Cydia Impactor&lt;/h1&gt; &lt;ol&gt; &lt;li&gt;Note: This method requires an Apple developer account.&lt;/li&gt; &lt;li&gt;Download &lt;a href=&#34;http://www.cydiaimpactor.com/&#34;&gt;Cydia Impactor&lt;/a&gt; for the applicable OS.&lt;/li&gt; &lt;li&gt;Extract the application file, and open it.&lt;/li&gt; &lt;li&gt;Connect your iOS device.&lt;/li&gt; &lt;li&gt;Download the latest version of unc0ver from &lt;a onClick=&#34;goTo(&#39;uncoverCenterTitle&#39;)&#34;&gt;above&lt;/a&gt;.&lt;/li&gt; &lt;li&gt;Drag the IPA file into the Impactor window.&lt;/li&gt; &lt;li&gt;Enter your Apple ID and password (requires developer account). (Note: If you are using two factor authentication, generate an app specific password, and use that here.)&lt;/li&gt; &lt;li&gt;On your iOS device, open Settings &amp;#8594 General &amp;#8594 Device Management and tap on your Apple ID.&lt;/li&gt; &lt;li&gt;Trust unc0ver.&lt;/li&gt; &lt;li&gt;Open unc0ver and jail&amp;#8203break!&lt;/li&gt; &lt;/ol&gt; &lt;/div&gt; &lt;div class=&#34;installInfo&#34; id=&#34;iosGuide&#34;&gt; &lt;h1&gt;ReProvision&lt;/h1&gt; &lt;ol&gt; &lt;li&gt;Jailbreak your device with any other listed method.&lt;/li&gt; &lt;li&gt;Add &lt;a href=&#34;https://repo.incendo.ws&#34;&gt;https://repo.incendo.ws&lt;/a&gt; to your source list in Cydia.&lt;/li&gt; &lt;li&gt;Install ReProvision.&lt;/li&gt; &lt;li&gt;Download the latest version of unc0ver from &lt;a onClick=&#34;goTo(&#39;uncoverCenterTitle&#39;)&#34;&gt;above&lt;/a&gt;&lt;/li&gt; &lt;li&gt;Download the latest version of Unc0ver.&lt;/li&gt; &lt;li&gt;Open the downloaded IPA and tap the &amp;quotShare&amp;quot Icon.&lt;/li&gt; &lt;li&gt;Open the file in ReProvision from the share sheet menu.&lt;/li&gt; &lt;li&gt;Tap the &amp;quotInstall&amp;quot button in ReProvision.&lt;/li&gt; &lt;li&gt;Wait for the install to complete.&lt;/li&gt; &lt;li&gt;Continue enjoying unc0ver!&lt;/li&gt; &lt;/ol&gt; &lt;/div&gt; &lt;div class=&#34;installInfo&#34; id=&#34;windowsGuide&#34;&gt; &lt;h1&gt;AltStore&lt;/h1&gt; &lt;ol&gt; &lt;li&gt; Install iTunes (Win32 Not UWP) &lt;ul&gt; &lt;li&gt;&lt;a href=&#34;https://www.apple.com/itunes/download/win64&#34;&gt;64 Bit Download&lt;/a&gt;&lt;/li&gt; &lt;li&gt;&lt;a href=&#34;https://www.apple.com/itunes/download/win32&#34;&gt;32 Bit Download&lt;/a&gt;&lt;/li&gt; &lt;/ul&gt; &lt;/li&gt; &lt;li&gt;Download &lt;a href=&#34;https://www.altstore.io/&#34;&gt;AltStore&lt;/a&gt; Use the link for your operating system.&lt;/li&gt; &lt;li&gt;Right click the zip you just downloaded and click &amp;quotExtract All&amp;quot Wait until this finishes.&lt;/li&gt; &lt;li&gt;Double click &#34;Setup.exe&#34; and follow the on screen instructions provided by AltStore.&lt;/li&gt; &lt;li&gt;Press the Windows key, type &amp;quotAltServer&amp;quot and open the application.&lt;/li&gt; &lt;li&gt;Click the arrow icon near the network icon in the taskbar. This will bring up an menu with multiple icons. Look for a diamond shaped logo that says AltServer when mousing over it. Click on it.&lt;/li&gt; &lt;li&gt;From the option brought up, hover over Install AltStore, and select your iOS device.&lt;/li&gt; &lt;li&gt;Enter your Apple ID and password when prompted.&lt;/li&gt; &lt;li&gt;On your iOS device, open Settings &amp;#8594 General &amp;#8594 Device Management and tap on your Apple ID.&lt;/li&gt; &lt;li&gt;Trust AltStore.&lt;/li&gt; &lt;li&gt;Tap the &amp;quotOpen in AltStore&amp;quot button located &lt;a onClick=&#34;goTo(&#39;uncoverCenterTitle&#39;)&#34;&gt;above&lt;/a&gt;.&lt;/li&gt; &lt;li&gt;If promoted, sign into the same Apple ID you used before.&lt;/li&gt; &lt;li&gt;AltStore will now install the app. Wait until it finishes.&lt;/li&gt; &lt;li&gt;Open unc0ver and jail&amp;#8203break!&lt;/li&gt; &lt;/ol&gt; &lt;h1&gt;Cydia Impactor&lt;/h1&gt; &lt;ol&gt; &lt;li&gt;Note: This method requires an Apple developer account.&lt;/li&gt; &lt;li&gt; Install iTunes (Win32 Not UWP) &lt;ul&gt; &lt;li&gt;&lt;a href=&#34;https://www.apple.com/itunes/download/win32&#34;&gt;64 Bit Download&lt;/a&gt;&lt;/li&gt; &lt;li&gt;&lt;a href=&#34;https://www.apple.com/itunes/download/win32&#34;&gt;32 Bit Download&lt;/a&gt;&lt;/li&gt; &lt;/ul&gt; &lt;/li&gt; &lt;li&gt;Download &lt;a href=&#34;http://www.cydiaimpactor.com/&#34;&gt;Cydia Impactor&lt;/a&gt; for the applicable OS.&lt;/li&gt; &lt;li&gt;Extract the application file, and open it.&lt;/li&gt; &lt;li&gt;Connect your iOS device.&lt;/li&gt; &lt;li&gt;Download the latest version of unc0ver from &lt;a onClick=&#34;goTo(&#39;uncoverCenterTitle&#39;)&#34;&gt;above&lt;/a&gt;.&lt;/li&gt; &lt;li&gt;Drag the ipa file into the Impactor window.&lt;/li&gt; &lt;li&gt;Enter your Apple ID and password (requires developer account). (Note: If you are using two factor authentication, generate an app specific password, and use that here.)&lt;/li&gt; &lt;li&gt;On your iOS device, open Settings &amp;#8594 General &amp;#8594 Device Management and tap on your Apple ID.&lt;/li&gt; &lt;li&gt;Trust unc0ver.&lt;/li&gt; &lt;li&gt;Open unc0ver and jail&amp;#8203break!&lt;/li&gt; &lt;/ol&gt; &lt;/div&gt; &lt;div class=&#34;installInfo&#34; id=&#34;linuxGuide&#34;&gt; &lt;h1&gt;Cydia Impactor&lt;/h1&gt; &lt;ol&gt; &lt;li&gt;Note: This method requires an Apple developer account.&lt;/li&gt; &lt;li&gt;Download &lt;a href=&#34;http://www.cydiaimpactor.com/&#34;&gt;Cydia Impactor&lt;/a&gt; for the applicable OS.&lt;/li&gt; &lt;li&gt;Extract the application file, and open it.&lt;/li&gt; &lt;li&gt;Connect your iOS device.&lt;/li&gt; &lt;li&gt;Download the latest version of unc0ver from &lt;a onClick=&#34;goTo(&#39;uncoverCenterTitle&#39;)&#34;&gt;above&lt;/a&gt;.&lt;/li&gt; &lt;li&gt;Drag the ipa file into the Impactor window.&lt;/li&gt; &lt;li&gt;Enter your Apple ID and password (requires developer account). (Note: If you are using two factor authentication, generate an app specific password, and use that here.)&lt;/li&gt; &lt;li&gt;On your iOS device, open Settings &amp;#8594 General &amp;#8594 Device Management and tap on your Apple ID.&lt;/li&gt; &lt;li&gt;Trust unc0ver.&lt;/li&gt; &lt;li&gt;Open unc0ver and jail&amp;#8203break!&lt;/li&gt; &lt;/ol&gt; &lt;/div&gt; &lt;/div&gt; &lt;div class=&#34;featureWrapper hidden&#34;&gt; &lt;svg version=&#34;1.1&#34; id=&#34;Capa_1&#34; xmlns=&#34;http://www.w3.org/2000/svg&#34; xmlns:xlink=&#34;http://www.w3.org/1999/xlink&#34; x=&#34;0px&#34; y=&#34;0px&#34; viewBox=&#34;0 0 512 512&#34; style=&#34;enable-background:new 0 0 512 512;&#34; xml:space=&#34;preserve&#34; width=80 height=80&gt; &lt;/style&gt; &lt;path class=&#34;st1&#34; d=&#34;M312.3,364c-0.4-7.2-3.6-14-8.8-19.3l-38-38c6.1-1.9,11.7-5.3,16.2-9.8l1-1c16.7-16.7,15.4-45.3-3-63.7 c-8.8-8.7-20.1-14-31.9-14.7c-12.3-0.7-23.6,3.4-31.8,11.7l-1,1c-4.5,4.5-7.9,10.1-9.8,16.2l-38-38c-11.2-11.2-28.7-11.9-39.1-1.5 l-34.4,34.4c-4.2,4.2-6,10.3-4.7,16.4c1.4,6.6,6,11.9,12.3,14.4c4,1.5,7.6,3.9,10.7,7l1.1,1.1c5.3,5.3,8.4,12,8.9,18.9 c0.4,6.5-1.7,12.3-5.9,16.5s-10,6.3-16.5,5.9c-6.9-0.4-13.6-3.6-18.9-8.9l-1.1-1.1c-3.1-3.1-5.5-6.7-7-10.7 c-2.4-6.3-7.8-10.9-14.4-12.3c-6-1.3-12.2,0.5-16.4,4.7L7.4,327.7c-10.4,10.4-9.7,27.9,1.5,39.1l38,38c-6.1,1.9-11.7,5.3-16.2,9.8 l-1,1c-16.7,16.7-15.4,45.3,3,63.7c9.8,9.8,22.4,14.7,34.6,14.7c10.8,0,21.3-3.9,29.1-11.7l1-1c4.5-4.5,7.9-10,9.8-16.2l38,38 c5.3,5.3,12.1,8.4,19.3,8.8c0.5,0,1.1,0,1.6,0c6.9,0,13.5-2.6,18.2-7.4l32.7-32.7c2.5,6.2,6.3,11.8,11.1,16.6l1.1,1.1 c18.4,18.4,47,19.7,63.7,3c16.7-16.7,15.4-45.3-3-63.7l-1.1-1.1c-4.9-4.9-10.4-8.6-16.6-11.1l32.8-32.8 C310.1,378.8,312.8,371.5,312.3,364z&#34; /&gt; &lt;g&gt; &lt;g&gt; &lt;path class=&#34;st1&#34; d=&#34;M490.1,229.8c-5.4-5.4-12-9.6-19.1-12.1l33.5-33.5c5.1-5.1,7.8-12.3,7.3-19.8c-0.4-7.2-3.6-14-8.8-19.3 l-37.2-37.2c5.3-2,10-5.1,14-9l1-1c16.7-16.7,15.4-45.3-3-63.7c-18.4-18.4-47-19.7-63.7-3l-1,1c-3.9,3.9-7,8.7-9,14L366.8,8.9 C355.6-2.3,338.1-3,327.7,7.4l-33.5,33.5c-2.5-7.1-6.6-13.6-12.1-19.1l-1.1-1.1c-18.4-18.4-47-19.7-63.7-3 c-16.7,16.7-15.4,45.3,3,63.7l1.1,1.1c5.4,5.4,12,9.6,19.1,12.1L207,128.1c-10.4,10.4-9.7,27.9,1.5,39.1l39.8,39.7 c5.1,5.1,12.4,7,19,5.1c6.1-1.8,10.6-6.7,12-12.9c0.8-3.9,2.7-7.3,5.4-10.1l1-1c4.2-4.2,10-6.3,16.5-5.9 c6.9,0.4,13.6,3.6,18.9,8.9c5.3,5.3,8.4,12,8.9,18.9c0.4,6.5-1.7,12.3-5.9,16.5l-1,1c-2.7,2.7-6.1,4.6-10.1,5.4 c-6.3,1.3-11.1,5.8-12.9,12c-2,6.6,0,13.9,5.1,19l39.7,39.7c5.9,5.9,13.5,8.9,20.9,8.9c6.7,0,13.2-2.4,18.2-7.4l33.5-33.5 c2.5,7.1,6.6,13.6,12.1,19.1l1.1,1.1c18.4,18.4,47,19.7,63.7,3c16.7-16.7,15.4-45.3-3-63.7L490.1,229.8z M480.1,280.5 c-8.9,8.9-24.8,7.6-35.4-3l-1.1-1.1c-3.5-3.5-6.1-7.7-7.5-12.2c-2.1-6.5-7.6-11.6-14.2-13.2c-6.2-1.5-12.5,0.2-16.9,4.6 l-35.2,35.2c-1.4,1.4-3.2,1.6-4.5,1.5c-2.2-0.1-4.5-1.2-6.3-3l-38-38c6.1-1.9,11.7-5.3,16.2-9.8l1-1c8.3-8.3,12.4-19.6,11.7-31.8 c-0.7-11.8-5.9-23.1-14.7-31.9s-20.1-14-31.9-14.7c-12.3-0.7-23.6,3.4-31.8,11.7l-1,1c-4.5,4.5-7.9,10.1-9.8,16.2l-38-38 c-1.8-1.8-2.9-4.1-3-6.3c-0.1-1.3,0.1-3.1,1.5-4.5l35.2-35.2c4.4-4.4,6.1-10.7,4.6-16.9c-1.6-6.7-6.6-12.1-13.2-14.2 c-4.5-1.5-8.7-4.1-12.2-7.5l-1.1-1.1c-10.6-10.6-11.9-26.5-3-35.4c8.9-8.9,24.8-7.6,35.4,3l1.1,1.1c3.5,3.5,6.1,7.7,7.6,12.2 c2.1,6.5,7.6,11.6,14.2,13.2c6.2,1.5,12.5-0.2,16.9-4.6l35.2-35.2c2.5-2.5,7.5-1.8,10.8,1.5l38.9,38.9c4.9,4.9,12,6.9,18.4,5.2 c6-1.6,10.6-6.1,12.2-12c0.9-3.4,2.7-6.3,5.1-8.8l1-1c8.9-8.9,24.8-7.6,35.4,3c10.6,10.6,11.9,26.5,3,35.4l-1,1 c-2.4,2.4-5.4,4.1-8.8,5.1c-6,1.7-10.4,6.2-12,12.2c-1.7,6.5,0.3,13.5,5.2,18.4l38.8,38.8c1.8,1.8,2.9,4.1,3,6.3 c0.1,1.3-0.1,3.1-1.5,4.5l-16,16l-14.1,14.1l-5,5c-4.4,4.4-6.1,10.7-4.6,16.9c1.6,6.7,6.6,12.1,13.1,14.2 c4.5,1.5,8.7,4.1,12.2,7.6l1.1,1.1C487.7,255.7,489,271.5,480.1,280.5z&#34; /&gt; &lt;/g&gt; &lt;/g&gt; &lt;/svg&gt; &lt;h1&gt;Compatible&lt;/h1&gt; &lt;p&gt; unc0ver supports iOS 11.0 through to iOS 13.5 (Excluding 12.3-12.3.2 and 12.4.2-12.4.5) &lt;/p&gt; &lt;/div&gt; &lt;div class=&#34;featureWrapper hidden&#34;&gt; &lt;svg version=&#34;1.1&#34; id=&#34;Layer_1&#34; xmlns=&#34;http://www.w3.org/2000/svg&#34; xmlns:xlink=&#34;http://www.w3.org/1999/xlink&#34; x=&#34;0px&#34; y=&#34;0px&#34; viewBox=&#34;0 0 512 512&#34; style=&#34;enable-background:new 0 0 512 512;&#34; xml:space=&#34;preserve&#34; width=80 height=80&gt; &lt;path class=&#34;st1&#34; d=&#34;M473.5,138.9l0-0.4c-0.2-4.9-0.4-10.1-0.5-15.9c-0.4-28.2-22.9-51.6-51.1-53.2C363.1,66.2,317.5,47,278.6,9 l-0.3-0.3c-12.7-11.6-31.8-11.6-44.5,0L233.4,9C194.5,47,149,66.2,90.1,69.5C61.9,71,39.4,94.4,39,122.6c-0.1,5.8-0.2,11-0.5,15.9 l0,0.9c-1.1,60-2.6,134.7,22.4,202.5c13.7,37.3,34.6,69.7,61.9,96.3c31.1,30.3,71.8,54.4,121,71.6c1.6,0.6,3.3,1,5,1.4 c2.4,0.5,4.8,0.7,7.2,0.7c2.4,0,4.8-0.2,7.2-0.7c1.7-0.3,3.4-0.8,5-1.4c49.2-17.2,89.9-41.3,120.9-71.6 c27.3-26.7,48.1-59.1,61.9-96.4C476,273.9,474.6,199.1,473.5,138.9z M422.8,331.5c-26.4,71.5-80.2,120.6-164.5,150 c-0.3,0.1-0.6,0.2-1,0.3c-0.9,0.2-1.8,0.2-2.6,0c-0.3-0.1-0.6-0.2-0.9-0.3c-84.4-29.4-138.3-78.5-164.6-150 c-23-62.5-21.7-131.1-20.6-191.6l0-0.3c0.2-5.2,0.4-10.6,0.5-16.6c0.2-12.5,10.2-22.9,22.7-23.6c33.3-1.9,62.6-8.3,89.5-19.7 c26.9-11.4,50.7-27.4,72.9-49c1.1-1,2.6-1,3.7,0c22.2,21.6,46.1,37.6,72.9,49c26.9,11.4,56.2,17.8,89.5,19.7 c12.6,0.7,22.5,11.1,22.7,23.6c0.1,6,0.2,11.5,0.5,16.6C444.6,200.3,445.9,268.9,422.8,331.5z&#34; /&gt; &lt;path class=&#34;st1&#34; d=&#34;M256,128.4c-70.4,0-127.6,57.2-127.6,127.6c0,70.4,57.2,127.6,127.6,127.6c70.4,0,127.6-57.2,127.6-127.6 C383.6,185.7,326.4,128.4,256,128.4z M313.9,237.6L244,307.5c-2.9,2.9-6.8,4.4-10.6,4.4s-7.7-1.5-10.6-4.4l-26.7-26.7 c-5.9-5.9-5.9-15.4,0-21.2c5.9-5.9,15.4-5.9,21.2,0l16.1,16.1l59.3-59.3c5.9-5.9,15.4-5.9,21.2,0 C319.8,222.3,319.8,231.8,313.9,237.6z&#34; /&gt; &lt;/svg&gt; &lt;h1&gt;Stable&lt;/h1&gt; &lt;p&gt; Utilizing proper and deterministic techniques, jail&amp;#8203break stability is guaranteed. &lt;/p&gt; &lt;/div&gt; &lt;div class=&#34;featureWrapper hidden&#34;&gt; &lt;svg version=&#34;1.1&#34; id=&#34;lock&#34; xmlns=&#34;http://www.w3.org/2000/svg&#34; xmlns:xlink=&#34;http://www.w3.org/1999/xlink&#34; x=&#34;0px&#34; y=&#34;0px&#34; viewBox=&#34;0 0 512 512&#34; style=&#34;enable-background:new 0 0 512 512;&#34; xml:space=&#34;preserve&#34; width=80 height=80&gt; &lt;g&gt; &lt;path d=&#34;M391.1,484.7H120.9c-19.8,0-36-16.2-36-36V263.4c0-19.8,16.2-36,36-36h270.2c19.8,0,36,16.2,36,36v185.3 C427.1,468.5,410.9,484.7,391.1,484.7z&#34;/&gt; &lt;path d=&#34;M148.1,227.4v-92.3c0-59.6,48.3-107.9,107.9-107.9s107.9,48.3,107.9,107.9v92.3&#34;/&gt; &lt;/g&gt; &lt;g&gt; &lt;circle class=&#34;lockInner&#34; cx=&#34;256&#34; cy=&#34;322.1&#34; r=&#34;32.2&#34;/&gt; &lt;path class=&#34;lockInner&#34; d=&#34;M256,422.3L256,422.3c-4,0-7.3-3.3-7.3-7.3v-53.4c0-4,3.3-7.3,7.3-7.3l0,0c4,0,7.3,3.3,7.3,7.3V415 C263.3,419,260,422.3,256,422.3z&#34;/&gt; &lt;/g&gt; &lt;/svg&gt; &lt;h1&gt;Secure&lt;/h1&gt; &lt;p&gt; Utilizing native system sandbox exceptions, security remains intact while enabling access to jailbreak files. &lt;/p&gt; &lt;/div&gt; &lt;!-- &lt;div class=&#34;featureWrapper hidden&#34;&gt; &lt;svg version=&#34;1.1&#34; id=&#34;Capa_1&#34; xmlns=&#34;http://www.w3.org/2000/svg&#34; xmlns:xlink=&#34;http://www.w3.org/1999/xlink&#34; x=&#34;0px&#34; y=&#34;0px&#34; viewBox=&#34;0 0 512 512&#34; style=&#34;enable-background:new 0 0 512 512;&#34; xml:space=&#34;preserve&#34; width=80 height=80&gt; &lt;g&gt; &lt;g&gt; &lt;path class=&#34;st1&#34; d=&#34;M256,28.5c-129.6,0-235,105.4-235,235c0,96.7,60.6,184.7,150.8,219.1c3.8,1.5,8,1.3,11.6-0.5 c3.6-1.8,6.4-5,7.6-8.8l44.1-140.7c2.1-6.7-0.8-13.9-6.9-17.2c-19.1-10.5-30.9-30.4-30.9-51.8c0-32.4,26.3-58.8,58.8-58.8 s58.8,26.3,58.8,58.8c0,21.4-11.8,41.2-30.9,51.8c-6.1,3.4-9,10.6-6.9,17.2L321,473.2c1.2,3.9,4,7,7.6,8.8c2,1,4.2,1.5,6.4,1.5 c1.8,0,3.6-0.3,5.2-1c90.2-34.3,150.8-122.4,150.8-219C491,133.9,385.6,28.5,256,28.5z M344.2,448.9l-35.9-114.6 c22.4-16.6,35.8-42.9,35.8-70.9c0-48.6-39.5-88.1-88.1-88.1s-88.1,39.5-88.1,88.1c0,28.1,13.5,54.3,35.8,70.9\n......", "posttime": "2020-05-24 08:52:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ios,越狱,jailbreak,altstore", "title": "Un0ver越狱，适用于IOS 11.0到13.5", "title_en": "unc0ver Jailbreak for iOS 11.0 to 13.5", "transed": 1, "url": "https://unc0ver.dev/?released", "via": "", "real_tags": ["ios", "越狱", "jailbreak", "altstore"]}, {"category": "", "categoryclass": "", "imagename": "221981162961b87dd4542bcbec5ebd10.jpg", "infoid": 1003465, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有趣的打火机：https://www.bladehq.com/?search=lighter https://amzn.to/2t8kpYA寻找更多刀具.值得信赖的在线商店(BladeHQ)http://shrsl.", "note_en": "Interesting Lighters : https://www.bladehq.com/?search=lighter https://amzn.to/2t8kpYA Looking For More Knives...Trusted Online Store (BladeHQ) http://shrsl....", "posttime": "2020-05-24 08:37:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "lighter,https", "title": "“打火机”的工作原理", "title_en": "How a “Rope Lighter” Works", "transed": 1, "url": "https://www.youtube.com/watch?v=XlnOY7umKLY", "via": "", "real_tags": ["lighter", "https"]}, {"category": "", "categoryclass": "", "imagename": "b5d0f1167a86fdbbb8945644fc4c54f6.png", "infoid": 1003464, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "前5,000个最常用的域名前缀/后缀列表-礼貌LeanDomainSearch-https://leandomainsearch.com/top-domain-name-prefixes-and-suffixes/-Common-Domain-Prefix-Suffix-List.tsv", "note_en": "Top 5000 Most Common Domain Prefix/Suffix List - Courtesy LeanDomainSearch - https://leandomainsearch.com/top-domain-name-prefixes-and-suffixes/ - common-domain-prefix-suffix-list.tsv", "posttime": "2020-05-24 08:22:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "前缀,domain", "title": "5000个最常用的域前缀/后缀列表", "title_en": "A list of the 5000 most commonly used domain prefix/suffix", "transed": 1, "url": "https://gist.github.com/erikig/826f49442929e9ecfab6d7c481870700", "via": "", "real_tags": ["前缀", "domain"]}, {"category": "", "categoryclass": "", "imagename": "9e1710291bad83801119db4f4dba5483.jpg", "infoid": 1003462, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多亏了冠状病毒，科技活动被左右取消。这反过来又损害了依赖这些事件的公司和集团的财务状况。一些开源组织，如Linux基金会，可以解决这个问题。其他人就没那么幸运了。一些组织，如Drupal基金会、开放源码倡议(OSI)、开放源码事务(Joomla)和Ajv JSON Schema验证器，正处于真正的麻烦之中。FOSS Responders正试图帮助这些和其他团体和个人。\n虽然开源为数十亿美元的企业提供了动力，但许多开源项目的预算很少。诸如“维系”、“开放集体”和“核心基础设施倡议”等组织试图帮助这些组织及其创建的代码保持在水面之上。\n但是，冠状病毒大流行给这些群体带来了新的压力。他们中的大多数依靠活动来筹集资金和建立金融合作伙伴关系。但这些活动已经不复存在了。诚然，像最近的红帽峰会这样的虚拟活动可以取得成功，但这对这些组织帮助不大。\n因此，Foss Responder联合创始人、GitLab高级开源项目经理努里茨·桑切斯(Nuritzi Sanchez)表示：我们大约在3月中旬开始，作为对冠状病毒活动取消的回应。它是一群开源领导者，他们来自Indeed、Facebook、Google、Red Hat、GitHub、GitLab等公司。\n他们已经建立了一个流程来帮助面临财务困境的开源个人和组织。桑切斯说，到目前为止，组织是最积极主动伸出援手的组织。它们还在整合有关如何计划和执行虚拟活动的信息，并提供一个人们可以寻找和提供帮助的地方。\nFOSS Responders在筹集捐款方面已经取得了一些成功。Open Collective的社会工程总监Alyssa Wright报告说，它从Indeed、Open Source Collective、Linux Fund、GitHub、Google、Sentry、Etherum Foundation和斯隆基金会筹集了资金。因此，FOSS Responders正在向由于冠状病毒大流行而经历财务压力的开源组织捐赠超过10万美元。\n5月22日，FOSS Responders&#39；将为陷入困境的开源团体举办一场名为“Uplift！”的庆祝和筹款活动，任何高达5000美元的捐款都将得到Indeed的捐款。\n还需要做更多的工作。就像陷入困境的小企业一样，小型开源基金会和开发团队需要他们能得到的所有帮助。", "note_en": "Thanks to the  coronavirus,  technology events have been canceled left and right. This, in turn, is damaging the finances of companies and groups that depend on these events. Some open-source groups, such as  The Linux Foundation, can deal with it. Others aren&#39;t so fortunate. Some, such as  Drupal Foundation, the  Open Source Initiative (OSI),  Open Source Matters (Joomla), and  Ajv JSON Schema validator, are in real trouble.  FOSS Responders is trying to help these and other groups and individuals.\n While open source powers billion-dollar businesses, many open-source projects operate on a shoestring budget. Groups such as  Sustain,  Open Collective, and the  Core Infrastructure Initiative try to help these groups and the code they create stay above water.\n But, the COVID-19 pandemic brought new pressure on these groups. Most of them rely on events to fund-raise and build financial partnerships.  Those events simply don&#39;t exist any longer. True, virtual events such as the  recent Red Hat Summit can be successful, but that doesn&#39;t help these organizations much.\n So, Nuritzi Sanchez, a FOSS Responder co-founder and  GitLab senior open-source program manager, said: We &#34;started out around mid-March as a response to COVID-19 event cancellations. It&#39;s a group of open source leaders from companies like  Indeed, Facebook, Google, Red Hat, GitHub, GitLab, etc.&#34;\n They&#39;ve set up a process to help both open-source individuals and organizations facing financial trouble. So far, Sanchez said, &#34;organizations are the ones that have been reaching out most so far.&#34; They&#39;re also consolidating information on how to plan and execute virtual events and provide a place where people can look for and offer help.\n   FOSS Responders has already had some success in raising donations. Alyssa Wright, Open Collective&#39;s director of social engineering, reports that it&#39;s raised funds from Indeed, Open Source Collective, Linux Fund, GitHub, Google, Sentry, Ethereum Foundation, and the Sloan Foundation. As a result &#34;FOSS Responders is contributing over $100K to open-source organizations that are experiencing financial strain because of the COVID-19 pandemic.&#34;\n On May 22, FOSS Responders&#39; is hosting a celebration and fundraiser called  UPLIFT! for troubled open-source groups,  Any donations of up to $5K will be matched by a donation from Indeed.\n   More needs to be done. Just like  beleaguered small businesses, small open-source foundations and developer groups need all the help they can get.", "posttime": "2020-05-24 07:51:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开源,响应者,responders,组织", "title": "“FOSS响应者”希望帮助开源组织生存下来", "title_en": "'FOSS Responders' Want to Help Open-Source Groups Survive", "transed": 1, "url": "https://www.zdnet.com/article/keeping-open-source-groups-alive-foss-responders/", "via": "", "real_tags": ["开源", "响应者", "组织"]}]