[{"category": "", "categoryclass": "", "imagename": "4c83e69c6727146f5ecc754cb433f128.jpg", "infoid": 1001572, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "问问任何一个面包头都做了什么(或者还在做什么！)。准将64是最高级的8位计算机，你和你几乎肯定会有几个标准答案中的一个或多个来回答这个问题：\nVIC-II芯片有16种颜色(是Sclair ZX Spectrum的两倍)和8个硬件精灵。\n当然，其他一些8位机器也可以赶上或超过这些功能中的一个或多个，但就我和其他许多人而言，没有人像C64那样将它们全部捆绑在一起。然而，就个人而言，如果你拿枪指着我的头，告诉我把面包盒的吸引力降低到一种非常具体的核心天才成分，我只能说是硬件精灵。遗憾的是，C64在本地只提供了其中的8个。当然，通过我们称为多路复用的众所周知的权宜之计，这一限制已经得到了极大的扩展。\n在继续之前，如果我不指出多路复用/多路复用器这个术语的模糊和历史争议的本质，那将是疏忽的，在C64的遗产时代，这个术语往往被那种相互冲突的定义所分裂，即只有编码势利者才会费心去挑拨离间。(这句话的意思是：“多路复用器/多路复用器”)在C64的传统时代，往往会因为相互矛盾的定义而被撕裂，只有编码势利者才会费心去挑拨离间。在接下来的几年里，这种情况在很大程度上已经变得成熟起来，因为迂腐的语义已经被更普遍的共识所取代：多路复用指的是任何使用中断重新绘制已经绘制的精灵的措施，通常是用一个新的指针(即定义)在屏幕下方更远的地方，从而产生一个或多个额外的精灵(有关如何最大限度地利用这种方法产生的精灵数量的超级核心技术论文，请参阅Linus Akesson&39；的详细文章)。无论如何，就本文而言，多路复用和多路复用器采用了今天大多数人(包括我自己)使用的更广泛的含义。当然，正如您所期待的那样，我在开发中的下一代游戏Parallaxian中使用了多路复用器技术，其临时的精灵模式如下所示：\n黑色文字表示精灵区域1，红色表示精灵区域2&34；如果你知道蓝色意味着什么，那就给你自己一颗金星，直奔谚语的顶端吧！。这说明，与之前的许多其他例子(如Armalyte和Turrican)一样，当涉及到扩展同时在屏幕上可见的硬件精灵的数量时，光栅中断的绝对威力。事实上，从Parallaxian捕捉到静止帧(下面将进一步定义，仅供外行使用)显示，VIC-II在没有一次使用精灵4、5、6或7的情况下绘制了10个硬件精灵，同时处理视差平滑滚动处理程序和软件精灵的需求，这些精灵以小人的形式在前景和铬合金圆顶激光柱体中奔跑……这再次提醒人们为什么会有这样的精灵，这也提醒了我们为什么会有这样的软件精灵，这些精灵以小人物的形式奔跑在前景和铬色圆顶激光地堡中。但我真正想从这张图片中强调的是：多路复用是一种垂直偏向的技术。换句话说，您只能在y方向上多路复用，而不能在x方向上多路复用。这是因为每个帧都由VIC-II组成，VIC-II从屏幕顶部(实际上远高于可见屏幕)开始，然后在屏幕上运行渲染光束(也称为光栅)，在瞬间跳回到最左侧并向下移动一个像素深度，然后重复该过程312次(在我们在欧洲使用的PAL机器上；在美国的NTSC上，仅262次)，直到整个屏幕渲染完成为止，然后重复该过程312次(在我们在欧洲使用的PAL机器上；在美国的NTSC上，仅262次)，直到整个屏幕被渲染完为止(在我们在欧洲使用的PAL机器上，在美国的NTSC上，仅262次)，然后在瞬间跳回最左侧并向下跳跃1个像素深度。这意味着每个屏幕刷新帧都是一个完整的自上而下的序列，在PAL机器上每秒重复50次-有关光栅上更详细的入门知识(并将这种离题的切线扼杀在萌芽状态)，请参阅这篇Dustlayer文章。现在你可能在想，为什么我们不能在光栅光束沿着水平扫描线快速移动时，在某个点上触发重新绘制一个精灵，以创建一个水平光栅分割呢？这就是为什么我们不能在某个点上触发重新绘制一个精灵，因为光栅光束沿着一条水平扫描线快速移动，从而产生一个水平光栅分割？毕竟，市面上有很多带有垂直光栅条效果的演示，这表明x方向的精灵多路复用器可能是可能的。答案是，我们不能以任何值得玩游戏的实用方式来做这件事；精灵渲染是VIC-II不那么琐碎的琐事之一，而让这样的拆分保持稳定并持续几条扫描线的硬件资源是不存在的-有关这个主题的详细处理，请参见帕西·奥贾拉(Pasi Ojala)的最好的文章，《遗失的循环》(Missing Cycle&34；)。\n撇开对李小龙老电影名称的模糊引用不谈，如果遵守某些条件，就有可能在屏幕上的其他地方重复使用已经绘制的精灵，而不需要求助于脑筋急转弯的多路复用技术。它仍然远不容易执行(从新手程序员的角度来看)，但它可能比多路复用稍微容易一些，并且不受垂直偏见或\n为了示意性地说明原理，下图显示了Parallaxian的加力燃烧器效果是如何由与飞机的激光器相同的精灵(精灵2)提供服务的，但它只在游戏中起作用，因为加力燃烧器的火焰无论如何都必须闪烁，而且激光必须在屏幕上移动，从而揭示了切换方法的两个关键规则或条件：\n由切换复杂的精灵渲染的任何对象都不能固定在位置和实体上；如果它不是移动的，它必须像火焰一样闪烁。\n但是，由切换复杂的精灵渲染的任何对象在移动时都可以表面上是实体的，例如坠落的炸弹(虽然它的坚固性是一种光学错觉，但实际上，它在每隔一帧上都是不可见的。", "note_en": "Ask any &#34;Breadhead&#34; what made (or still makes!) the Commodore 64 the  superlative 8-bit computer and you&#39;re pretty much guaranteed one or more of a handful ofstandard answers to the question:\n The  VIC-II chip with its 16 colours(twice what the  Sinclair ZX Spectrum had) and 8 hardware sprites.\n Sure, some other 8-bit machines could also match or outdo one or more of those features, but as far as I and many others are concerned, none tied them all together like the C64 did.  Personally, however, if you held a gun to my head and told me to reduce the  Breadbox&#39;s appeal down to one very specific core &#34;genius ingredient&#34;, I would have to say it is the hardware sprites.  Such a pity, then, that the C64 only provides 8 of them natively.  Of course, that limitation has been stretched massively via the well known expedient we call  multiplexing.\n  Before proceeding, it would be remiss of me not to point out the nebulous and historically contentious nature of the term  multiplexing / multiplexor which, during the C64&#39;s legacyera, tended to be riven by the kind of  conflicting definitions that only coding snobs could be botheredto split hairs over.  That situation has largely mellowed in the ensuing years, to the extent now that pedantic semantics have been supplanted by a more general consensus:    Multiplexing means any measure that uses an interrupt to re-draw an already drawn sprite, typically with a new pointer (i.e. definition), further down the screen,thereby producing one or more additional sprites (for an ultra hardcore technical treatise on maxing out the number of sprites yielded this way, see Linus Akesson&#39;s detailed article).  In any event, for the purposes of this article,  multiplexing and  multiplexor assume the broader meaning most people, myself included, use today.  And of course, as you might very well expect, I use a multiplexor technique in my next-generation game in development, Parallaxian, as per its provisional  sprite schema depicted below:\n  Black text denotes &#34;sprite zone 1&#34;, red denotes &#34;sprite zone 2&#34; and, well, give yourself a gold star and go straight to the top of the proverbial if you know what blue denotes!  What this illustrates, along with many other examples before it (such as  Armalyte and Turrican) is  the sheer power of raster interrupts when it comes to expanding the number of hardware spritesvisible on-screen simultaneously.  In fact, that capture of a still frame (defined further below, just for the uninitiated) from  Parallaxian shows that the  VIC-II has drawn TEN hardware sprites without once using sprites4, 5, 6 or 7,while at the same time managing the demands of a parallaxing smooth scroll handler and &#34;software sprites&#34; in the form of little men that run about the foreground and &#34;chrome dome&#34; laser pillboxes...yet another reminder why the Commodore 64 was and remains in a league of its own compared with its era-peers.  But what I  really want to highlight the most from that image is this:    Multiplexing is a vertically biased technique.  In other words, you can only multiplex in the y-direction, not the x-direction.   That&#39;s because each   frame consists of the VIC-II starting at the top of the screen (actually way above the visible screen) and far to the left and then running a render beam (aka the &#34;raster&#34;)across the screen, jumping back to the far left and down one pixel depth in an instant before  repeating the process 312 times(on the  PAL machines we use in Europe; on the USA&#39;s  NTSC it&#39;s a mere 262 times)until the entire screen is rendered.  This means each single screen refresh frame is  a complete top-to-bottom sequence, repeated 50 times per second on PAL machines - for a more detailed primer on the raster(and to nip this wandering-off-topic tangent in the bud), see this  Dustlayer article.  Now maybe you&#39;re wondering,  why can&#39;t we trigger a re-draw of a sprite at some point as the raster beam zips along a horizontal scan line, you know, to create a  horizontal raster split?  After all, there are many demos out there with vertical raster bar effects that would suggest an x-direction sprite multiplexor might be possible.  The answer is we can&#39;t do this in any game-worthy practical way; sprite rendering is one of the VIC-II&#39;s less trivial chores and the hardware resources to keep such a split stable for more thana few scanlines\tjust doesn&#39;t exist - for a detailed treatment of this subject, see Pasi Ojala&#39;s superlative article, &#34;Missing Cycles&#34;.\n    Obscure references to old Bruce Lee film titles aside, it is possible - if certain conditions are adhered to - to reuse an already drawn sprite elsewhere on the screen without recourseto brain-teasing multiplexing techniques.  It&#39;s still far from simple to execute (from a novice coder&#39;s perspective), but it&#39;s maybe slightly easier than multiplexing and is not bound by vertical biases or scanline-splitting constraints.  I call it, rather arbitrarily and without the least iota of community consensus,   Toggle-plexing (or  Toggleplexing, without the hyphen).  Assuming you are familiar with the fundamental nomenclature used with sprites, the technical principle is thus:\n On every  even numbered VIC-II frame, we set the toggle-plexed sprite&#39;s x- and y-positions, colours, mode (hi-res or MCM), pointer, MSB ($D010) and its x- and y-expansion bits to suit the desired rendering of the sprite at that location.\n  On every  odd numbered VIC-II frame, we do the same but for a totally different sprite definition and / or location.\n To illustrate the principle schematically, the diagram below shows how  Parallaxian&#39;s afterburner effect is served by the same sprite (sprite 2) as the plane&#39;s laser; but it only worksin the game because the afterburner flame has to flicker anyway and the laser has to move across the screen, thereby revealing 2 critical rules or conditions of the toggle-plexing method:\n Any object rendered by the toggle-plexed sprite cannot be fixed in position and solid; it must flicker, like a flame, if it is not mobile.\n Any object rendered by the toggle-plexed sprite, however, can be ostensibly solid if it is moving, such as a falling bomb (although its solidity is an optical illusion,as in actuality, it is invisible on every other frame.", "posttime": "2020-05-11 04:38:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "切换,plexing,精灵", "title": "Commodore 64上的“切换”雪碧", "title_en": "“Toggle-plexing” Sprites on the Commodore 64", "transed": 1, "url": "https://kodiak64.com/blog/toggleplexing-sprites-c64", "via": "", "real_tags": ["切换", "plexing", "精灵"]}, {"category": "", "categoryclass": "", "imagename": "e6a7d82c33500a7dda7d8c8fd77d753a.png", "infoid": 1001571, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "35岁的冠状病毒幸存者利亚·布隆伯格(Leah Blomberg)不记得曾被紧急送往重症监护病房，在那里她会在呼吸机上花18天的时间与生命作斗争。\n布隆伯格告诉我：“我醒来时发现了一些我从未想象过的东西。”一名护士拿着锯子站在她的病床旁，砍掉了她的胳膊和腿。布隆伯格记得大喊救命。有一次，她试着摸她的脸，然后惊恐地意识到，她的头骨只有一半完好无损。\n像布隆伯格这样的经历在ICU的患者中很常见。困扰最危重冠状病毒患者的呼吸衰竭--急性呼吸窘迫综合征(ARDS)--需要机械通气。使用呼吸机的患者中有80%患有被称为ICU精神错乱的迷幻状态，在此期间他们形成虚假的、往往令人恐惧的记忆。因为这些错觉记忆是基于现实生活中的刺激，它们比噩梦更生动--根据杰西·范德霍夫的说法，它们感觉“尽可能真实”。\n范德胡夫因冠状病毒住院，并在ICU的呼吸机上呆了一周，他记得自己看到了自己的死亡。“我产生了幻觉，我会晕倒--真的很慢，”他告诉我。“我记得我特别有这样的想法，哦，我要死了，当我的脸撞到地上的时候，这会很痛的。”范德胡夫一度看到了自己的葬礼。“这真的很痛苦，”他说。“我记得在我的葬礼上见过我妈妈。”\n许多ICU患者经历了与他们的死亡相关的妄想，通常以涉及酷刑或袭击的令人痛心的场景为特征。范德比尔特大学医学中心ICU康复中心的心理学家吉姆·杰克逊告诉我，从很多方面来说，这是有道理的。在经历精神错乱的急性大脑功能障碍的同时，患者试图创造一种反映他们环境中非常真实的痛苦和压力的叙事。问题是，大脑会将现实转化为更可怕的东西。\n杰克逊告诉我：“我们有精神错乱的病人，他们被带到医院的成像中心做核磁共振检查。”“当他们被推入核磁共振机时--非常恰当--他们确信自己正被移入烤箱，因为在他们的脑海中，核磁共振机与烤箱有些模糊的相似之处。”杰克逊在ICU康复诊所的工作中经常看到这种错觉。他还经常看到将涉及导管的手术误认为是性侵犯的患者。\n“你不能告诉人们，‘这不是发生在你身上，’”加州大学圣地亚哥分校(UC San Diego)的肺部重症监护医生罗伯特·欧文斯(Robert Owens)告诉我。“这是他们记得的。所以它可能很难治疗。“。\n虽然神志不清的神经科学原因尚不清楚，但它的发病很可能是由于一系列因素造成的，包括缺氧-大脑缺氧-以及镇静剂的使用。\n研究大脑功能障碍和危重疾病的创伤内科医生梅尤尔·B·帕特尔(Mayur B.Patel)说，“(服用镇静剂的患者)温和、平静、平静的表情可能会被误认为睡着了，而实际上，他们的大脑着火了。”(Patel和他在范德比尔特大学的团队目前正在研究已故的ICU患者-包括那些死于冠状病毒的患者-以更多地了解他们的大脑发生了什么。)。\n约翰·霍普金斯大学精神病学副教授乔·比恩弗努告诉我：“我们过去认为给病人服用镇静剂可以防止长期的创伤后现象。”“但事实证明，如果说有什么不同的话，那就是情况似乎正好相反。”\n最近重症监护的趋势是尽可能减少镇静剂。医生尽量避免使用苯二氮卓类药物，这类镇静剂被认为是特别容易使人神志不清的。但普遍存在的药物短缺使这一点变得不可能。最重要的是，许多冠状病毒患者需要长时间的通气，这意味着他们需要更长时间的镇静，而且往往更重。\n范德比尔特大学医学中心(Vanderbilt University Medical Center)肺部和危重护理教授韦斯·伊利(Wes Ely)表示，大流行迫使医生放弃了几乎所有可以减少神志不清的循证干预措施。因此，冠状病毒感染患者中ICU精神错乱的患病率急剧上升。\n与伊利一起工作的杰克逊说，他特别担心在有冠状病毒患者的重症监护室里缺乏家庭探视。多项研究表明，陪护家庭成员通过提供舒适和将患者与现实捆绑在一起，显著减少了精神错乱。\n杰克逊告诉我：“通常情况下，家庭成员会帮助这些患者了解什么是事实，什么不是事实。”“他们可以说，‘亲爱的，相信我，你实际上并没有被放进烤箱。我和你一起去了核磁共振中心。我一直在那里，确保你没有出事。‘“。\n一些医院用来减轻精神错乱持久影响的另一个策略是ICU日记。家庭成员和医疗保健专业人员撰写了一本个人日记，详细介绍了患者在医院的每一天。在病人出院后，记录帮助他们重建发生在他们身上的故事。\n杰克逊说：“现在所有这些叙述都被扔出了窗外。”\n家属探视的缺席，加上已经不堪重负的医务人员，以及延长镇静剂的使用，让许多医生担心ICU逗留对冠状病毒幸存者的长期后果。敲响警钟，声音最大的是伊利。\n“如果你必须设计一个实验，让精神错乱变得尽可能严重，那么COVID就是它，”他告诉我。“COVID本质上是一个精神错乱的工厂。”\n他有理由担心。精神错乱是ICU幸存者认知、身体和心理不良后果的强烈预测因子。ICU患者出院后可能经历的这一系列问题，称为重症监护综合征(PICS)，影响到高达33%的使用呼吸机的患者和50%在ICU停留至少一周的患者。四分之一的ARDS幸存者患有创伤后应激障碍。这一比率与从战斗中归来的士兵相似。最终，精神健康症状和认知问题的结合阻止了许多ARDS幸存者重返工作岗位：在最近的一项研究中，近一半的参与者在出院一年后无法重返之前的工作岗位。\n“这是一个我们大多数人甚至不知道存在的重大公共卫生问题，”伊利说。\n杰克逊认为，他的新冠状病毒患者的心理状况可能比其他ARDS幸存者更糟糕。他告诉我：“害怕死亡的动力，现在在COVID时代，害怕孤独死亡-我们认为，这导致了创伤后应激障碍的症状。”\n现在布隆伯格出院了，她明白护士并没有真的想要杀她。但是这些知识并不会让记忆感觉更真实。除了与极度的肌肉无力作斗争外，布隆伯格还存在睡眠问题。“我很害怕，”她说，“在我看到那么可怕的事情之后。”\n另一位冠状病毒幸存者菲奥娜·洛温斯坦(Fiona Lowenstein)告诉我，她还没有准备好应对出院后将经历的心理痛苦的冲击。她说：“我感觉很奇怪，因为我的朋友、家人和我为康复而接受的采访都在公开庆祝我。”“但我觉得我有一个肮脏的小秘密，那就是我一点都不舒服。”\n布列塔尼·洛尼斯(Brittany Lohnes)在2016年从ARDS中幸存下来，她也感受到了内部庆祝和痛苦之间的不和谐。“每个人都在说，‘你真是个奇迹。你活了下来。完全没有心理健康方面的跟进，“她告诉我。洛内斯与闪回、焦虑发作和严重的抑郁症作了一年的斗争，直到她决定找一位创伤治疗师。“老实说，对情感方面没有任何形式的善后照顾是最困难的部分，”她说。\n许多ARDS幸存者告诉我，当冠状病毒患者出院时，他们感到深深的不安。阿曼达·格鲁(Amanda Growth)记得她在出院九个月后突然出现的创伤后应激障碍(PTSD)症状是如何让她措手不及的。“他们让我大吃一惊，因为我以为我已经熬过去了，”她告诉我。首先是被插管的闪回-当两名护士按住她的手臂插入呼吸管时的挣扎。“如果你考虑这样的程序，在任何其他情况下，那都会被认为是酷刑，”Growth说。然后噩梦就来了。她说：“我一直在做噩梦，我一直在努力想要醒来。”“我刚刚到了一个我希望自己死在医院的地步。”\n格鲁能够为她的抑郁症和创伤后应激障碍寻求帮助。但她的康复需要一个漫长的接受过程。Growth说：“我们有一种看法，认为人们生病了，然后就会恢复过来，但事实完全不是这样的。”“你生命中的这一章会发生，在那之后的每一章都会改变。我担心(冠状病毒)幸存者会经历某种程度上的悲痛，不得不经历他们的生活已经改变的现实。“。\n和Growth一样，在一场几乎致命的山地自行车事故中幸存下来的彼得·吉布(Peter Gibb)也经历了自杀的念头，他从重症监护病房(ICU)跟随他回家。他告诉我：“我很幸运，在英国的一家医院里有一家ICU后续诊所。”“你会被邀请回来，你可以谈论你所经历的一切，因为你的疾病危急阶段和你所感受到的一切之间存在着脱节。”\n吉布漫长的康复之路激发了他创建ICU Steps的灵感，这是一个为受到危重疾病影响的患者和家庭提供支持的组织。由于第一手知道记录ICU日记的好处，他目前正在开发一种基于云的产品，他希望这种产品可以在世界各地有冠状病毒患者的医院实施。\n在美国，每年只有16家ICU后续诊所为500多万名新的ICU幸存者提供服务。其中两家最大的诊所-范德比尔特和约翰·霍普金斯-已经看到冠状病毒患者的涌入。\n吉布说：“临床医生做了如此出色的工作，让我们达到了生存的地步。”“但是生存和找回我们的生活是两码事。”\n我们想听听您对这篇文章的看法。向编辑提交一封信，或写信给letters@theatlantic.com。", "note_en": "The 35-year-old COVID-19 survivor Leah Blomberg doesn’t remember being rushed to the intensive-care unit, where she would spend 18 days fighting for her life on a ventilator.\n   “I woke up to something that I would never have imagined,” Blomberg told me. A nurse was standing over her hospital bed with a saw, cutting off her arms and legs. Blomberg remembers yelling for help. At one point, she tried to touch her face—and realized, with horror, that only half of her skull was intact.\n   Experiences such as Blomberg’s are common among patients in the ICU. The respiratory failure that afflicts the most critically ill COVID-19 patients—acute respiratory distress syndrome (ARDS)—requires mechanical ventilation.  Eighty percent of patients on a ventilator suffer from a hallucinogenic state known as ICU delirium, during which they form false, and often frightening, memories. Because these delusional memories are based on real-life stimuli, they’re more vivid than a nightmare—according to Jesse Vanderhoof, they feel “as real as real can get.”\n  Vanderhoof, who was hospitalized for COVID-19 and spent a week on a ventilator in the ICU, remembers seeing his own death. “I was having these hallucinations where I would be passing out—really slowly falling,” he told me. “I remember specifically having thoughts like,  Oh, I’m dying, and this is going to hurt when I hit my face on the ground.” At one point, Vanderhoof saw his own funeral. “It was really traumatic,” he said. “I remember seeing my mom at my funeral.”\n    Many ICU patients experience delusions related to their deaths, often characterized by harrowing scenarios involving torture or assault. In many ways, this makes sense, Jim Jackson, a psychologist at the ICU Recovery Center at Vanderbilt University Medical Center, told me. While experiencing the acute brain dysfunction of delirium, patients are attempting to create a narrative that reflects the very real pain and stress of their environment. The problem is that the mind transmogrifies reality into something much scarier.\n  “We’ve had delirious patients who are taken to an imaging center at the hospital to get an MRI,” Jackson told me. “As they are being pushed into the MRI machine—quite appropriately—they’re convinced that they’re being moved into an oven, because that MRI machine bears some vague resemblance in their mind to an oven.” Jackson sees this delusion frequently in his work at the ICU recovery clinic. He also regularly sees patients who misremember a procedure involving a catheter as a sexual assault.\n  “You can’t tell people, ‘This didn’t happen to you,’” Robert Owens, a pulmonary-critical-care physician at UC San Diego, told me. “That’s what they recall. And so it can be very difficult to treat.”\n  While the neuroscientific cause of delirium is poorly understood, its onset is likely due to a concatenation of factors, including hypoxia—oxygen starvation of the brain—and the use of sedatives.\n “The muted, sort of restful, peaceful look [of sedated patients] can be mistaken for sleeping when, in fact, their brain is on fire,”  said  Mayur B. Patel, a trauma physician who researches brain dysfunction and critical illness. (Patel and his team at Vanderbilt University are currently studying deceased ICU patients—including those who died of COVID-19—to learn more about what happened to their brain.)\n “We used to think that giving patients sedative medications was protective against longer-term post-traumatic phenomena,” Joe Bienvenu, an associate professor of psychiatry at Johns Hopkins, told me. “But it turns out, if anything, the opposite appears to be the case.”\n  The recent trend in critical care has been to minimize sedatives as much as possible. Doctors try to avoid benzodiazepines, a class of sedatives that is known to be particularly deliriogenic. But widespread  medication shortages have rendered this impossible. On top of that, many COVID-19 patients require  prolonged ventilation, which means they need to be sedated for longer, and often more heavily.\n The pandemic has forced doctors to abandon nearly all of the evidence-based interventions that can reduce delirium, according to Wes Ely, a professor of pulmonary and critical care at Vanderbilt University Medical Center. As a result, the prevalence of ICU delirium in patients with COVID-19 is  sharply rising.\n    Jackson, who works with Ely, said he’s particularly concerned about the lack of family visitation in ICUs with COVID-19 patients.  Multiple  studies suggest that attendant family members significantly reduce delirium by providing comfort and tethering the patient to reality.\n “Typically, family members help orient these patients to what is factual and what is not,” Jackson told me. “They can say, ‘Honey, trust me, you weren’t actually put into an oven. I went with you to the MRI center. I was there the whole time making sure nothing happened to you.’”\n  Another strategy that some hospitals employ to mitigate the lasting effects of delirium is the ICU diary. Family members and health-care professionals contribute to a personal journal that details each day the patient spends in the hospital. After patients are discharged, the record helps them reconstruct the narrative of what happened to them.\n “Now all those narratives have just been thrown out the window,” Jackson said.\n  The absence of family visitation coupled with already overwhelmed medical staff and the extended use of sedatives have many doctors worried about the long-term consequences of ICU stays for COVID-19 survivors. Sounding the alarm the loudest is Ely.\n “If you had to design an experiment to make delirium as bad as it could be, COVID is it,” he told me. “COVID is essentially  a delirium factory.”\n He has reason to be concerned. Delirium is a  strong predictor of adverse cognitive, physical, and psychological outcomes for ICU survivors. This cluster of problems that ICU patients can experience post-discharge, called  p ost-intensive-care syndrome (PICS),  affects up to 33 percent of all patients on ventilators and 50 percent of patients who stay in the ICU for at least one week.  One in four ARDS survivors develops PTSD. That’s a rate  similar to that of soldiers returning from combat. Ultimately, a combination of mental-health symptoms and cognitive problems prevents many ARDS survivors from going back to work:  Nearly half of the participants in a recent study were unable to return to their previous jobs one year after being discharged from the hospital.\n  “This is a major public-health problem that most of us don’t even know exists,” Ely said.\n Jackson believes that his new COVID-19 patients may fare worse psychologically than other survivors of ARDS. “That dynamic of being terrified of dying, and now in the COVID era, terrified of dying alone—that contributes, we believe, to symptoms of post-traumatic stress disorder,” he told me.\n  Now that Blomberg’s out of the hospital, she understands that a nurse didn’t actually try to kill her. But that knowledge doesn’t make the memory feel any less real. In addition to struggling with extreme muscle weakness, Blomberg is having trouble sleeping. “I’m afraid,” she said, “after the horrible things I saw.”\n    Another COVID-19 survivor, Fiona Lowenstein, told me she didn’t feel prepared for the onslaught of psychological distress she would experience when she was discharged from the hospital. “I felt bizarre because I was sort of being publicly celebrated by friends, family, and the interviews I was doing for having recovered,” she said. “But I felt like I had this dirty little secret, which was that I was not fully well at all.”\n  Brittany Lohnes, who survived ARDS in 2016, also felt the dissonance between being celebrated and suffering internally. “Everybody’s like, ‘You’re a miracle. You survived.’ There is absolutely no mental-health follow-up at all,” she told me. Lohnes struggled with flashbacks, anxiety attacks, and major depression for a year until she decided to find a trauma therapist. “Not having any kind of aftercare for the emotional aspect is honestly the hardest part,” she said.\n Many ARDS survivors told me that they feel a deep sense of disquiet when COVID-19 patients are discharged from the hospital. Amanda Grow remembers how she was blindsided by the symptoms of PTSD that cropped up nine months after her discharge from the ICU. “They surprised me so much because I thought I was through it,” she told me. First came flashbacks of being intubated—of struggling when two nurses held down her arms to insert a breathing tube. “If you think about a procedure like that, under any other conditions, that would be considered torture,” Grow said. Then came the nightmares. “I just kept having all these nightmares where I was fighting to wake up, fighting to wake up, fighting to wake up,” she said. “I just reached a point where I wished I had died in the hospital.”\n  Grow was able to seek help for her depression and PTSD. But her recovery involved a long process of acceptance. “We have this perception that people are sick and then they bounce back, but that’s not the way it is at all,” Grow said. “This chapter of your life happens, and it changes every chapter after that. I worry about [COVID-19] survivors experiencing kind of a breakdown of grief, having to go through this reality that their life has changed.”\n Like Grow, Peter Gibb, who survived a near-fatal mountain-biking accident, also experienced suicidal thoughts that followed him home from the ICU. “I was lucky enough to be in one of the UK hospitals with an ICU follow-up clinic,” he told me. “You get invited back, and you can talk about what you’ve been through, because there’s a disconnect between the critical phase of your illness and everything you’re feeling.”\n Gibb’s long road to recovery inspired him to create ICUsteps, a support group for patients and families who have been affected by critical illness. Knowing the benefits of keeping an ICU diary firsthand, he’s currently developing a cloud-based product that he hopes can be implemented in hospitals with COVID-19 patients across the world.\n In the United States, only  16 ICU follow-up clinics serve more than  5 million new ICU survivors each year. Two of the largest clinics—at Vanderbilt and Johns Hopkins—are already seeing an influx of COVID-19 patients.\n “Clinicians do such a wonderful job in getting us to the point where we’re going to survive,” Gibb said. “But surviving and getting our life back are two different things.”\n  We want to hear what you think about this article.  Submit a letter to the editor or write to letters@theatlantic.com.", "posttime": "2020-05-11 04:37:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "妄想症,delirium,icu", "title": "“Covid-19是一个妄想症工厂”", "title_en": "‘Covid-19 Is a Delirium Factory’", "transed": 1, "url": "https://www.theatlantic.com/video/archive/2020/05/icu-delirium/611155/", "via": "", "real_tags": ["妄想症", "delirium", "icu"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001570, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几个月前，我的顾问问我是否想要开发DDiDD项目的一小部分，它将检查传入的DNS数据包，并自动回复任何具有无效域名的数据包，这将使DNS服务器不必响应这些数据包。听起来很简单，不是吗？有一个问题-数据包需要以线速处理，在我的情况下，这意味着40千兆位每秒。\n假设数据包大小约为每个数据包80字节，每秒40G比特的纯DNS数据包意味着该程序每秒必须处理6250万个数据包。这给了我16纳秒来处理每个数据包，或者给出一个4.2 GHz的单核处理器的67个CPU周期(假设我的NIC和处理器之间的网桥没有延迟)。这甚至不足以让Linux内核的网络堆栈发送数据包(L.Rizzo，2012，p.3)。\n能够创建虚拟接口以与同一台计算机上的DNS服务器通信。\n有许多库承诺比Linux内核更高的数据包处理速度，其中大多数依赖于NIC上的硬件或内核旁路技术。有趣的是，这些方法中的大多数依赖于轮询，而不是中断，因为在如此高的网络速度下，终止实际上会减慢数据包处理的速度。\n幸运的是，我正在使用的试验台中的一些网卡内部包含FPGA，并且支持P4，这实际上将我们的网卡变成了一个交换机。但是，P4不支持简单的查看数据包内容的方式，只支持查看报头。这也需要购买昂贵的专用硬件，这将限制我们可以部署软件的位置。\nMellanox的VMA通过使用LD_PRELOAD来使用内核自己的网络调用覆盖内核的网络调用来运行，这降低了您必须执行的代价高昂的mempys、中断和上下文切换的数量。\nCloudFlare在解释这一点上比我在他们的博客上做得好得多，它的工作方式与Mellanox的解决方案类似。\nNetmap是允许快速数据包I/O的内核模块的集合。然而，它也需要打补丁的驱动程序，并且支持的网卡比DPDK少。它还允许您创建供非网络映射程序使用的虚拟网络接口。\nDPDK是另一个由英特尔赞助的高速内核旁路库，它支持广泛的网络接口，但有一个麻烦的API，需要为物理层以外的所有内容重写网络堆栈。虽然远不理想，但因为这是我最熟悉的库，所以我最终在项目中使用了它。\nDPDK中比较有趣的模块之一是内核NIC接口，它允许您创建供非DPDK程序使用的虚拟接口。然而，它也比传统的虚拟界面更快，因为它省去了内核空间和用户空间之间一些代价高昂的转换。这需要一个内核模块kmod/rte_kni.ko。对于我的用例，我将设置Carrier=On，这样我就不必费心使用RTE_KNI_UPDATE_LINK()。\n开发人员还在他们的报告中提供了一个方便的示例应用程序，它将传入的数据从物理NIC接口转发到KNI接口，反之亦然。这里的魔术发生在kni_egress和kni_inress函数中，这两个函数的工作方式类似。\n每个接口都有RX和TX环形缓冲区，用于在读取数据包之前将其存储起来。这使得在不处理数据包的情况下发送和接收数据包变得相当简单。要发送数据包，只需将包含数据包的Pusha RTE_mbuf放入TX缓冲区，而要接收数据包，请将RX缓冲区读入不同的RTE_mbuf。这些操作是通过物理接口的RTE_ETH_TX_BULT和RTE_ETH_RX_BURST以及我们的KNI One的RTE_KNI_TX_BURST和RTE_KNI_RX_BURST来实现的。因此，程序需要做的就是使用rte_*_rx_burst读入数据，然后使用rte_*_tx_burst将这些rte_mbuf写出到另一个接口。\n由于此示例不处理标头，因此它对最终用户是完全透明的，只是现在所有流量都是通过veth*而不是eth*路由的。\nDPDK还直接向用户公开环形缓冲区，这是该项目的核心组件。通过让KNI_INTRESS写入新的环形缓冲区而不是KNI TX环，我可以运行另一个线程来处理这些数据包。这看起来是这样的：\n为此，我需要4条线。一个线程将数据包从我们的NIC转发到Worker_RX_RING。在那里，另一个线程读取Worker_RX_RING并解析每个数据包。然后，具有由ICANN确定的无效TLD的所有DNS数据包被传递到Worker_Tx_RING，而其余的继续传递到KNI接口。最后，一个线程向NIC传递无效的TLD响应，而另一个线程传递来自KNI的传出数据包。\n现在我们已经让环工作人员在彼此之间传递数据，我们还必须解析传入的DNS数据包，并将它们读入我们的程序。以下是在Wireshark中打开的DNS查询包的示例：\n这里我们关注的是DNS部分，因此我们可以跳过前42个字节，它们是第2-4层报头。在开始时，我们有2个字节充当客户端匹配回复的标识符。在此之后，我们有两个字节的标志，RFC 1035将在第4.1.1节中详细介绍。接下来的4组2个字节列出了数据包后面的问题、答案、名称服务器资源记录(RR)和资源记录的数量。需要注意的是，这些记录是大端的，这意味着在x86_64这样的小端架构上运行时，您必须反转它们。我们将跳过额外的RRS，将重点放在问题RRS上。\n每个查询(或问题资源记录)都按域拆分成子字符串，因此在我们的示例中，ns5.SPOTIFY.COM将变成ns5、Spotify和com。在每个字符串之前是字符串的长度，因此ns5应该是03 6E 73 35。这同样适用于其他两个域。名称以空终止符00结束。然后，我们获得了查询类型的指示符(在本例中，A记录的指示符为0x0001)和查询类的指示符(互联网地址的指示符为0x0001)。\n了解了这一点，实现一个算法来遍历查询名称直到我们找到TLD是很容易的：\n//循环到查询名std：：string query；int str_len，Offset=0；char*qname_start=qname；while(True){//读入字符串长度str_len=*qname；qname=qname+str_len+1；if(*qname！=0x0)Offset+=str_len+1；Else Break；}。\n在本例中，TLD是COM。这恰好是一个有效的TLD，所以我们将把这个包推入KNI的rx_queue并继续。但如果不是呢？\n值得庆幸的是，对于我们的用例，我不需要包括权限部分或任何额外的内容，因此，我所要做的就是修改现有的数据包(从而节省错误锁和memcpys)，将目的地址和端口与源地址和端口进行交换。这必须在以太网、IPv4和UDP报头上完成。然后，我将修改NXDOMAIN标志，同时使用简单的位掩码保持其他所有内容不变：\n//修改DNS头部*(DNS_HDR+2)|=0b10000000；//标准查询权威答案，否//截断或递归*(DNS_HDR+3)=0b00000011；//名称错误。\n现在要做的最后一件事是：生成我们的IPv4校验和(并忽略UDP校验和)：\n//设置IPv4校验和IP_hdr-&gt；hdr_checksum=0；ip_hdr-&gt；hdr_checksum=rte_ipv4_cksum(IP_Hdr)；udp_hdr-&gt；dgram_cksum=0；//忽略UDP校验和。\n就这样！剩下要做的就是将数据包推送到NIC的RX_QUEUE，然后它就会被发回。", "note_en": "A couple months ago, my advisor asked me if I wanted to develop a small part of the  DDiDDproject, which would check incoming DNS packets and reply to any packets with an invalid domainautomatically, which would free up the DNS server from responding to those. Sounds simple, right?There’s one catch - the packets needed to be processed at line rate, which in my case meant 40gigabits per second.\n 40 gigabits per second of pure DNS packets, assuming packet sizes of about 80 bytes per packet,means that the program would have to process 62.5 million packets every second. That gives me 16nanoseconds to process each packet, or 67 CPU cycles given a 4.2GHz processor with a single core(assuming that the bridge between my NIC and my processor has zero latency). This is not enough timefor the Linux kernel’s network stack to even send a packet ( L. Rizzo, 2012, p. 3).\n  Ability to create virtual interfaces to communicate with the DNS server on the same machine\n  There’s many libraries out there that promise higher packet processing speeds than the Linux kernel.Most of them rely on hardware on the NIC or kernel bypass techniques. It’s interesting to note thatmost of these methods rely on polling, rather than interrupts, since at such high network speedsinterrupts would actually slow down packet processing.\n  Luckily, some of the NICs in the testbed I’m using contain FPGAs inside and support  P4, whichessentialy turns our NIC into a switch. However, P4 did not support an easy way of looking at thepacket’s contents, only the headers. This also requires buying expensive, specialized hardware,which would limit where we could deploy the software.\n  Mellanox’s  VMA runs by using an  LD_PRELOAD to override the kernel’s network calls withtheir own, which lowers the number costly  memcpys, interrupts, and context switches you have todo.\n  Cloudflare does a much better job of explaining this than I will on  their blog.It works in a similar way to Mellanox’s solution.\n  Netmap is a collection of kernel modules that allow for fast packet I/O. However, italso requires patched drivers, and supports less NICs than DPDK does. It also lets you createvirtual network interfaces for non-netmap programs to use.\n  DPDK is another high-speed kernel bypass library sponsored by Intel which supportsa wide array of network interfaces, but has a troublesome API which requires rewriting the networkstack for everything beyond the physical layer. While far from ideal, since this was the libraryI was most familiar with, I ended up using this for the project.\n  One of the more interesting modules in DPDK is the  kernel NIC interface, which lets youcreate a virtual interface for non-DPDK programs to use. However, it’s also faster than traditionalvirtual interfaces, since it cuts out some of the costly transitions between kernelspace anduserspace. This requires a kernel module,  kmod/rte_kni.ko. For my use case, I’ll be setting carrier=on so I won’t have to bother with  rte_kni_update_link().\n The developers also provided a handy  example application in their repos, whichforwards incoming data from a physical NIC interface to a KNI interface, and vice versa. The magichere happens in the  kni_egress and  kni_ingress functions, which work similarly.\n Each interface has RX and TX ring buffers, which stores packets until they’re read. That makes thesending and receiving packets without processing them rather simple. To transmit a packet, just pusha  rte_mbuf containing the packet into the TX buffer, and to recieve a packet, read the RX bufferinto a different  rte_mbuf. These operations are achieved with the  rte_eth_tx_burst and rte_eth_rx_burst for our physical interface, and  rte_kni_tx_burst and  rte_kni_rx_burst for ourKNI one. So, all the program needs to do is read data in with  rte_*_rx_burst and then write those rte_mbufs out to the other interface using  rte_*_tx_burst.\n Since this example doesn’t handle headers, it’s fully transparent to the end user, except that alltraffic is now routed thorugh  vEth* instead of  eth*.\n  DPDK also exposes the ring buffers directly to the user, which is a core component of this project.By having  kni_ingress write to a new ring buffer instead of the KNI TX ring, I can have anotherthread running to do work on those packets. Here’s what that looks like:\n  For this, I’ll need 4 threads. One would forward the packets from our NIC to the  WORKER_RX_RING.There, another thread reads  WORKER_RX_RING and parses through each packet. All DNS packets withan invalid TLD as determined by  ICANN are then passed to the  WORKER_TX_RING, whilethe rest continue to the KNI interface. Finally, one thread would pass invalid TLD responses tothe NIC, while the other passes outgoing packets from the KNI.\n  Now that we have our ring workers passing data between each other, we’ll also have to parse theincoming DNS packets and read them into our program. Here’s an example of a DNS query packetopened in Wireshark:\n  What we’re focusing on here is the DNS section, so we can skip the first 42 bytes, which are thelayer 2-4 header. At the beginning, we have 2 bytes that act as an identifier for the client tomatch up replies. After that, we have two bytes of flags, which  RFC 1035 goes into ondetail in section 4.1.1. The next 4 sets of 2 bytes list the number of questions, answers, nameserver resource records (RRs), and resource records following the packet. It’s important to notethat these records are in big-endian, which means you’ll have to reverse them when running on alittle-endian architecture like x86_64. We’ll skip the additional RRs and focus on the question RRs.\n Each query (or question resource record) is split up into substrings by domain, so in our case ns5.SPOTIFY.COM will become  ns5,  SPOTIFY, and  COM. Preceding each string is the length ofthe string, so  ns5 would be  03 6e 73 35. The same applies to the other two domains. The nameends with the null terminator  00. Following that we’ve got indicators for query type ( 0x0001 inthis case for an A record), and query class ( 0x0001 for Internet addresses).\n Knowing this, it’s trivial to implement an algorithm to go through the query name until wefind the TLD:\n // Loop until the end of the query name  std :: string  query ;  int  str_len ,  offset  =  0 ;  char  * qname_start  =  qname ;  while  ( true )  {  // Read in the string length  str_len  =  * qname ;  qname  =  qname  +  str_len  +  1 ;  if  ( * qname  !=  0x0 )  offset  +=  str_len  +  1 ;  else  break ;  }\n In this case, the TLD is  COM. That happens to be a valid TLD, so we’ll push thispacket into the KNI’s RX_QUEUE and continue. But what if it isn’t?\n  Thankfully, for our use case, I didn’t need to include authority sections or anything extra.Therefore all I had to do was modify the existing packet (thus saving on  mallocs and  memcpys)by swapping the destination address and ports with the source address and ports. This had to be doneon the Ethernet, IPv4, and UDP headers. Following that, I’ll modify the NXDOMAIN flags while keepingeverything else the same using a simple bitmask:\n // Modify DNS headers * ( dns_hdr  +  2 )  |=  0b10000000 ;  // Standard query authoritative answer, no  // truncation or recursion * ( dns_hdr  +  3 )  =  0b00000011 ;  // Name error\n One last thing to do now: generate our IPv4 checksums (and ignore the UDP ones):\n // Set IPv4 checksum  ip_hdr -&gt; hdr_checksum  =  0 ;  ip_hdr -&gt; hdr_checksum  =  rte_ipv4_cksum ( ip_hdr );  udp_hdr -&gt; dgram_cksum  =  0 ;  // Ignore UDP checksum\n And that’s it! All that’s left to do is push the packet to the NIC’s RX_QUEUE, and it’ll be sentback.", "posttime": "2020-05-11 04:37:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "剖析,dns,数据包", "title": "以线速剖析DNS数据包", "title_en": "Dissecting DNS Packets at line rate", "transed": 1, "url": "http://h313.info/blog/networking/dpdk/dns/2020/05/05/dissecting-dns-packets-at-line-rate.html", "via": "", "real_tags": ["剖析", "dns", "数据包"]}, {"category": "", "categoryclass": "", "imagename": "0a3fefbc25514313c451a5a005f884b3.png", "infoid": 1001569, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GitLab 13.0将于2020年5月22日登陆GitLab.com。除了令人兴奋的新功能，它还包括计划中的弃用，因为它是今年的主要版本发布。我们试图最大限度地减少这些更改，但有些更改足够重要，足以保证功能更改。\n继续阅读，了解更多关于GitLab.com的这些重要变化，GitLab.com将在5月22日发布之前的几天内发布。\n作为更新Auto DevOps以支持Kubernetes 1.16的一部分，默认的PostgreSQL图表版本将从0.7.1更改为8.2.1。\n要将现有的0.7.1 PostgreSQL数据库迁移到较新的基于8.2.1的数据库，请按照升级指南备份数据库，安装新版本的PostgreSQL，然后恢复数据库。\n要保持旧默认值，需要将AUTO_DevOps_Postgres_Channel配置项变量显式设置为1。\n由于Kubernetes 1.16中删除了几个API，因此在GitLab 13.0版中，deploymentApiVersion设置将更改为新的默认值：app/v1。\n如果您使用的是Kubernetes1.9及更低版本，则需要升级Kubernetescluster才能获得app/v1版本支持。对于Auto DevOps，GitLab需要1.12+的Kubernetes。\n不鼓励使用ONLY和EXCEPT来支持规则。规则提供了更详细、更具表现力的作业执行以及评估和理解起来不那么复杂的逻辑。\n仅使用和例外的自动开发操作和安全配置模板正在更改为规则。已自定义作业模板的用户将需要转换，因为这两个配置选项不能一起使用。我们提供了文档来帮助您迁移模板。\n仅使用和EXCEPT对这些模板进行的任何自定义都必须更改为规则语法。Only/Except不能与规则组合使用，因为它打算由该功能替换。有关将规则转换或固定到以前版本的指导，请参阅我们的疑难解答文档。\nGitLab.com上的/projectsAPI端点应用了50,000个基于偏移量的分页限制。进行偏移量超过50,000的API调用的集成必须切换到基于键集的数据分页，这将显著缩短响应时间并减少GitLab服务器上的负载。自我管理实例可以将限制自定义为所需的值。\n为了优化性能，基于键集的分页只提供基于项目id的排序。需要更灵活排序选项的用例可以继续使用基于偏移量的分页，前提是偏移量保持在限制以下。如果用例需要具有深度偏移量的灵活排序选项，我们建议对客户端进行排序。\n随着我们继续致力于代码段的版本控制，我们正在进行更改，以便在UI和API中搜索代码段，从而从搜索结果中删除代码段内容。标题和描述仍然可以通过搜索和API访问。\n对于使用GitLab Silver、Premium或更高版本的客户，GitLab在列出项目时的API响应当前返回名为MARKED_FOR_DELETE_AT的属性，该属性表示将项目标记为软删除的日期。\n为了标准化我们的API中的术语，GitLab 13.0中删除了该属性。已添加名为marked_for_delete_on的具有相同信息的新属性。\n为了提高性能，在GitLab 12.9中，我们将group Details API中的Groups/：ID端点返回的项目数量限制为100个。\n为了进一步提高端点性能，在GitLab 13.0中，当通过API请求组详细信息时，我们从响应中删除了PROJECTS和SHARED_PROJECTS属性。用户仍然可以在同一组API中找到此信息，也可以在该组的项目终结点列表中找到此信息。\n引入了一个新的id字段，它替换了JSON公共安全报告中不推荐使用的CVE字段。\n随着我们添加(并鼓励第三方供应商添加)更多的安全集成，我们正在努力改进我们当前的JSON通用报告格式。主字段CVE属性令人困惑，因为它不包含CVE数据，因此应将其删除。我们引入id字段，该字段对于GitLab扫描仪是自动计算的，对于第三方合作伙伴扫描仪是必需的。id字段最终将取代CVE作为唯一标识符。在安全报告中使用cveproperty的任何人，无论是使用自定义脚本还是作为我们的Secure功能的集成者，最终都需要停止使用CVE属性，而应该开始使用新的id属性。请注意，今天的id和cve都是必填字段。\n我们正在从Runners API终结点删除Token属性，该终结点将按ID获取Runner的详细信息。您可以在与此相关的问题或您通常的支持渠道中提供反馈。\nWindows Batch Executor for the Shell Executor：在GitLab 11.11中，我们不推荐使用Windows Batch Executor for the GitLab Runner，而支持PowerShell。在13.0中，我们将从Runner shell执行器中删除对Windows批处理(Cmd)的支持。当用户注册新的运行器shell执行器时，它现在将缺省为powershell。\ndebug/job/list？v=1端点：在13.0中，用于监视的/debug/Jobs/list？v=1端点替换为/debug/Jobs/list？v=2端点。\n注册命令上的Docker服务标志：在GitLab Runner 12.7中，我们引入了允许Docker Executor中配置中的服务别名的功能。在13.0中，旧结构--docker-services也将被删除。这意味着以下选项GitLab-runner register--docker-services postgres将不再设置服务，因为配置不再是字符串数组。对于具有依赖--docker-services标志的自动化的用户，请单击此处查看迁移示例。\n遗留构建目录缓存功能标志：在GitLab Runner 13.0中，我们将删除11.10中引入的遗留构建目录缓存功能标志。我们强烈建议用户不要在生成目录中存储任何内容。有关其他详细信息，请参阅最佳实践文档页面的构建目录部分。\nWindows 1803支持终止：在GitLab Runner 13.0中，不再支持Windows 1803。\nFedora 29支持终止：在GitLab Runner 13.0中，不再支持Fedora 29。\n对于自托管的GitLab 13.0，本周对于GitLab.com用户，我们已经删除了License-Management.gitlab.ci.yml模板(从GitLab 12.8起就不再推荐使用)。您必须将其替换为License-Scaning.gitlab-ci.yml模板。有关更多详细信息，请访问文档。\n如果要直接引用作为License Compliance的一部分运行的许可证扫描的结果，还需要使用新的报告类型工件：Reports：License_Scanning，而不是工件：Reports：License_management。对于GitLab 12.8到GitLab 12.10的版本，这是可选的，但对于GitLab 13.0的版本，这是必需的。这不适用于GitLab 12.7及更早版本的用户。\n之所以进行此更改，是因为GitLab License Management现在已重命名为GitLab License Compliance。在与用户和分析师审阅后，我们确定这个新名称更好地表明了该功能的用途，与现有的市场术语保持一致，并减少了与GitLab订阅许可功能的混淆。您可以在EPIC重命名License Management to License Compliance中找到关于此问题的研究和工作。作为许可合规性的一部分对您的项目进行的分析将称为许可扫描。\n注册GitLab每月两次的时事通讯，探索即将到来的网络广播、操作博客，并随时了解每月发布的令人兴奋的新功能：\nGitLab不仅仅是源代码管理或CI/CD。它是一个完整的软件开发生命周期&在单个应用程序中的DevOps工具。\n免费试用GitLab", "note_en": "GitLab 13.0 is coming on May 22, 2020 to GitLab.com. Along with the exciting new features, it also includes planned deprecations because it is this year&#39;s major version release. We try to minimize these changes, but some are important enough to warrant the change in functionality.\n Keep reading to learn more about these important changes to GitLab.com, which willbe arriving over the next few days leading up to release on May 22.\n  As part of updating Auto DevOps to support Kubernetes 1.16, the default PostgreSQL chart version is changing from 0.7.1 to 8.2.1.\n To migrate your existing 0.7.1 PostgreSQL database to the newer 8.2.1-based database,follow the  upgrade guideto backup your database, install the new version of PostgreSQL, and restore your database.\n To remain on the old default, you will need to explicitly set the AUTO_DEVOPS_POSTGRES_CHANNEL CI variable to  1.\n  Because several APIs  were removedin Kubernetes 1.16, the  deploymentApiVersion setting is changing to a new defaultof  apps/v1 in  GitLab 13.0.\n If you are using Kubernetes 1.9 and below, you will need to upgrade your Kubernetescluster to get  apps/v1 version support. For Auto DevOps, GitLab requires Kubernetes 1.12+.\n  The use of   only and  except isdiscouraged in favor of   rules. rules provides more verbose and expressive job execution  logic that is lesscomplex to evaluate and understand.\n Auto DevOps and Secure  configuration templatesthat use  only and  except are changing to  rules. Users who have customizedjob templates will need to transition as these two configuration options cannotbe used together. We have  documentation available for help migrating your templates.\n   Any customization to these templates using  only and  except must be changed tothe   rules syntax.  only/except can’t be used incombination with  rules since it’s intended to be replaced by that functionality.Please see  our troubleshooting docfor guidance on transition your rules or pinning to the previous version.\n     An offset-based pagination limit of  50,000 is being applied to the  /projectsAPI endpoint on GitLab.com. Integrations that make API calls with offsets above 50,000 must switch to  keyset-based pagination,which will offer significantly improved response times and reduced load on theGitLab server. Self-managed instances can customize the limit to a desired value.\n To optimize performance, keyset-based pagination only offers ordering based onproject  id. Use cases that require more flexible ordering options can continueto use offset-based pagination, provided the offsets remain below the limit.If use cases require flexible ordering options with deep offsets, we recommendsorting client-side.\n  As we continue to work towards  version control for Snippets,we are making a change to search for Snippets in the UI and API that removes snippet Content from search results.  Title and  Description will still beaccessible via search and API.\n  For customers using GitLab Silver, Premium, or above, GitLab&#39;s API response when listing projectscurrently returns an attribute named  marked_for_deletion_at that denotes thedate on which a project was marked for soft deletion.\n To standardize on terminology across our APIs, this attribute is removed inGitLab 13.0. A new attribute named  marked_for_deletion_on with the sameinformation has  already been added.\n  To improve performance, in  GitLab 12.9we limited the number of projects returned from the  groups/:id endpoint in the group details API to 100.\n To further improve endpoint performance, in GitLab 13.0 we are removing the projects and  shared_projects attributes from the response when requesting group detailsthrough the API. Users can still find this information in the same Group API,in the  list a group&#39;s projects endpoint.\n Introducing a new  id field which replaces the deprecated  cve field in the JSON common security report\n As we add (and encourage third-party vendors to add) more security integrations,we&#39;re working to improve our current JSON common report format. The primary field cve property is confusing, as it does not contain CVE data and should thereforebe removed. We are introducing the  id field, which is automatically calculatedfor GitLab scanners and required for third-party partner scanners. The  id fieldwill eventually replace  cve as a unique identifier. Anyone leveraging the  cveproperty in security reports, with custom scripts or as an integrator into ourSecure features, will eventually need to stop using the  cve property and insteadshould start using the new  id property. Please be aware that today  id and cve are both required fields.\n   We are removing the  token attribute from the Runners API endpoint that gets detailsof a Runner by its ID. You can provide feedback in the related issue or yourusual support channels.\n  Windows Batch  cmd for the shell executor: In GitLab 11.11, we deprecated the use of Windows Batch executor for the GitLab Runner in favor of PowerShell. In 13.0 we will remove support for Windows batch (cmd) from the Runner shell executor. When a user registers a new runner shell executor it will now default to  powershell.\n debug/jobs/list?v=1 endpoint: In 13.0, the  /debug/jobs/list?v=1 endpoint used for monitoring is replaced with the  /debug/jobs/list?v=2 endpoint.\n Docker services flag on register command: In GitLab Runner 12.7 we introduced the ability to allow a service alias from  config in the Docker executor. In 13.0, the old structure,  --docker-services will also be removed. This means that the following option  gitlab-runner register --docker-services postgres will no longer set the service as the configuration is no longer an array of strings. For users with automation that relies on the  --docker-services flag, click here for a  migration example.\n Legacy build directory caching feature flag: In GitLab Runner 13.0 we will remove the legacy build directory caching feature flag that was introduced in 11.10. We highly recommend that users do not store anything in the  Builds Directory. Refer to the  Build Directory section of the best practices documentation page for additional details.\n Windows 1803 support end of life: In GitLab Runner 13.0, Windows 1803 is no longer supported.\n Fedora 29 support end of life: In GitLab Runner 13.0, Fedora 29 is no longer supported.\n  As of GitLab 13.0 for self-hosted, and this week for GitLab.com users, we have removed the License-Management.gitlab.ci.yml template (deprecated since GitLab 12.8). You must replace it with the License-Scanning.gitlab-ci.yml template instead. For more details visit  the documentation.\n If you are directly referencing the results of the License Scan running as part of License Compliance, you also need to use the new report type artifacts:reports:license_scanning instead of artifacts:reports:license_management. This is optional with the release of GitLab 12.8 through GitLab 12.10, but mandatory with the release of GitLab 13.0. This will not apply to users of versions GitLab 12.7 and earlier.\n This change was made because GitLab License Management is now renamed to GitLab License Compliance. After review with users and analysts, we determined that this new name better indicates what the feature is for, aligns with existing market terminology, and reduces confusion with GitLab subscription licensing features. You can find the research and work on this issue in the epic Rename License Management to License Compliance. The analyses of your projects done as a part of License Compliance will be called License Scanning.\n Sign up for GitLab’s twice-monthly newsletter to explore upcoming webcasts, how-to blogs, and stay up-to-date on exciting new features released every month:\n GitLab is more than just source code management or CI/CD. It is a full software development lifecycle &amp; DevOps tool in a single application.\n Try GitLab for Free", "posttime": "2020-05-11 04:07:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "gitlab", "title": "Gitlab.com将迁移到13.0", "title_en": "Gitlab.com Is Moving to 13.0", "transed": 1, "url": "https://about.gitlab.com/releases/2020/05/06/gitlab-com-13-0-breaking-changes/", "via": "", "real_tags": ["gitlab"]}, {"category": "", "categoryclass": "", "imagename": "e7a1e3be701e7154639da1a638f401d1.jpeg", "infoid": 1001568, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "切断有线电视-人们放弃有线电视和卫星电视订阅-早在冠状病毒爆发之前。但这场大流行夸大了这一趋势，为依赖这些服务进行分发的节目创造了更深层次的发行者。\n首先，长期以来，人们坚持付费电视订阅的为数不多的原因之一就是能够观看体育直播，这一直是人们的普遍看法。由于几乎所有的职业和大学体育赛事都关闭了，这种说法没有说服力。\n与此同时，随着美国失业率达到大萧条(Great Depression)以来的最高水平，以及免费或低成本订阅流媒体视频的选择如此之多，美国人逃离付费电视的速度达到了创纪录的水平。\n确切的数字有点取决于您统计的内容和谁在计数，但总体情况很清楚。\n这其中包括AT&amp；T(股票代码：T)、康卡斯特(CMCSA)、Charge Communications(CHTR)、Dish Network(DISH)和Verizon Communications(VZ)的各种视频服务订户同比下降18.9%、4.6%、2.5%、4.1%和5.8%。他指出，在合并的基础上，虚拟电缆捆绑-也被称为虚拟MVPD，或vMVPDS-有史以来第一季度的订户损失。\n格林菲尔德在接受Barron‘s采访时表示，特别发人深省的是，第一季度的大部分活动都早于病毒爆发--第二季度的数据可能会变得相当糟糕。\n他说，体育的回归会有所帮助，但最大的问题是，“最好的内容在流媒体服务上，价格只有付费电视的一小部分”。格林菲尔德认为，根本没有理由为娱乐节目订阅有线电视-而且核心体育观众可能不到5000万，太低了，无法支撑沃尔特·迪士尼(Walt Disney)旗下的ESPN等体育节目网络目前的成本结构，广告和会员费都可能长期下降。(请注意，格林菲尔德最近将他对ESPN母公司迪士尼的评级下调至出售。)。\nMoffett Nathanson的电信和有线电视分析师克雷格·莫菲特(Craig Moffett)估计，传统付费电视服务第一季度的订户损失为180万，使12个月的损失率达到有史以来最差的7.6%。卫星电视服务订阅量连续第三季度下降100多万。他指出，卫星和有线电视服务的订户损失都是有史以来最糟糕的一个季度。他指出，付费电视家庭已经回落到1995年的水平。\n莫菲特警告说，“随着体育节目的停播，随着本季度结束，失业海啸的痛苦刚刚开始袭来，所有这些数字在第二季度都会变得更糟。”\n他在虚拟MVPD订户的疲软中看到了麻烦。莫菲特写道：“vMVPD曾经被视为有线电视网络的最后一道防线，但在第一季度就崩溃了。”他估计，总的来说，他们在本季度失去了34.1万名订户。“索尼的PlayStation Vue服务在1月底关闭。他们的大约50万订户似乎没有去过任何地方。AT&amp；T TV Now(前身为DirecTV Now)、Sling TV和(我们相信)FuboTV都失去了订户。迪士尼的Hulu Live TV似乎在多次涨价后遇到了障碍，第一季度仅增长了约10万订户，与最近的高速增长相比突然减速。即使是目前增长最快的YouTube电视，也不能填补所有的空白。总订阅量(包括传统订阅量和vMVPD订阅量)现在正以每年5.3%的速度缩减。是的，那也是有史以来最糟糕的。“。\n莫菲特指出，一些受影响最大的公司已经推出了流媒体服务，以帮助抵消这一问题，比如迪士尼+、康卡斯特(Comcast)的孔雀(Peacock)和美国电话电报公司(AT&amp；T)的HBO Max。但他认为，很明显，随着消费者转向这些服务，他们将永远不会回到传统的付费电视-他补充说，这些直接面向消费者的服务“不太可能接近它们表面上要取代的业务的盈利能力”。\n莫菲特补充说，虽然现在宣布有线电视行业死亡还为时过早，但他表示，现在起草该行业的讣告实际上并不为时过早。\n所以他写了一条：“有线电视网络业务，曾经是世界上最赚钱的行业之一，在经历了漫长而痛苦的滑落到无关紧要之后，今天屈服了…当冠状病毒危机在2020年初来袭时，体育节目停播了，这就是结束的开始。到体育节目回来的时候，损害已经造成了。病人没有反应。死者身后留下了迪士尼+和孔雀。将在Zoom上空举行湿婆仪式。“。\n康卡斯特(Comcast)、查特(Charge)、威瑞森(Verizon)和美国电话电报公司(AT&amp；T)等有线电视和电信公司拥有一些可以抵消的好处--它们是最大的宽带互联网服务提供商。但对于依赖有线和卫星电视服务分发节目的公司来说，付费电视的加速消亡确实是个坏消息，这些公司包括迪士尼的娱乐体育节目电视网(ESPN)和美国广播公司(ABC)、探索通信公司(Discovery Communications)、AMC Networks(AMCX)、维亚康姆哥伦比亚广播公司(ViacomCBS)和康卡斯特(Comcast)自己的NBC环球(NBC Universal)等。\n与此同时，Netflix在第一季度签约了超过1500万新订户。当谈到有线电视公司时，趋势并不是他们的朋友。", "note_en": "Cord-cutting—people dropping their cable and satellite TV subscriptions—predates the onset of Covid-19. But the pandemic is exaggerating the trend, creating deeper issuers for programming that relies on those services for distribution.\n  For one thing, it has long been the conventional wisdom that one of the few reasons people have hung on to their pay-TV subscriptions is access to live sports. With almost all professional and college sporting events shut down, that argument carries no weight.\n  Meanwhile, with U.S. unemployment at the highest rate since the Great Depression, and so many options for free or low-cost subscription streaming video, Americans are fleeing pay TV at a record rate.\n  The exact numbers depend a little on what you count and who is doing the counting, but the overall picture is clear.\n      That includes year-over-year subscriber declines of 18.9% for the various video services of  AT&amp;T (ticker: T), 4.6% at  Comcast (CMCSA), 2.5% at  Charter Communications (CHTR), 4.1% at  Dish Network (DISH), and 5.8% at  Verizon Communications (VZ). On a combined basis, he notes, the virtual cable bundles—also known as virtual MVPDs, or vMVPDS—had subscriber losses for the first quarter ever.\n  Greenfield said in an interview with Barron’s that what is especially sobering is that most of the first quarter activity pre-dated the virus—the numbers are likely to get considerably worse in the second quarter.\n  He says a return of sports would help, but that the biggest issue is that “the best content is on streaming services at a fraction of the price” of pay TV. Greenfield argues that there is simply no reason to subscribe to cable for entertainment programming—and that the core sports audience might be under 50 million, too low to support the current cost structure of the sports programming networks like ESPN, owned by  Walt Disney (DIS), with both advertising and affiliate fees likely in secular decline. (Note that Greenfield  recently cut his rating on ESPN parent Disney to Sell.)\n  Craig Moffett, telecom and cable analyst at Moffett Nathanson, estimates the first-quarter subscriber losses at 1.8 million for the traditional pay TV services, bringing the 12-month loss rate to a worst-ever 7.6%. Satellite TV service subscriptions fell by over 1 million for the third quarter in a row. He notes that both satellite and cable services had their worst-ever quarter for subscriber losses. Pay-TV households, he notes, have dropped back to a level last seen in 1995.\n  And Moffett warns that “with sports off the air, and with the pain of the tsunami of unemployment just beginning to hit as the quarter ended, all these numbers will get worse in Q2.”\n  He sees trouble in the weakness in virtual MVPD subscribers. “The vMVPDs, once viewed as the last line of defense for cable networks, imploded in Q1,” Moffett writes. Collectively, he estimates they lost 341,000 subscribers in the quarter.  “Sony ’s PlayStation Vue service shut down at the end of January. Their ~500,000 subscribers appear to have gone ...nowhere. AT&amp;T TV Now (formerly DirecTV Now), Sling TV, and (we believe) fuboTV all lost subscribers. Disney’s Hulu Live TV appears to have hit a wall in the wake of multiple price increases, growing by only ~100,000 subscribers in Q1, an abrupt deceleration from their recent torrid growth. Even YouTube TV, by far the fastest-growing of the lot, couldn’t pick up all the slack. Total subscriptions, including both traditional and vMVPDs, are now shrinking by 5.3% per year. Yes, that, too, is the worst ever.”\n  Moffett notes that some of the most affected companies have launched streaming services to help offset the issue, pointing to Disney+, Comcast’s Peacock and AT&amp;T’s HBO Max. But he thinks it is clear that as consumers shift to those services, they are never coming back to traditional pay TV—and he adds that those direct-to-consumer services are unlikely “to ever come close to matching the profitability of the business they are ostensibly designed to replace.”\n  Moffett adds that while it is a little early to declare the cable sector dead, he says it isn’t actually too early to draft the industry’s obituary.\n  So he wrote one: “The cable network business, once among the world’s most profitable industries, succumbed today after a long and painful slide into irrelevance ...When the coronavirus crisis hit in early 2020, sports went off the air, and that was the beginning of the end. By the time sports came back, the damage had been done. The patient was unresponsive. The deceased is survived by Disney+ and Peacock. A shiva will be held over Zoom.”\n  The cable and telecom companies like Comcast, Charter, Verizon, and AT&amp;T have some offsetting benefits—they are the largest providers of broadband internet service. But the accelerating demise of pay TV is bad news indeed for companies that rely on cable and satellite TV services to distribute programming, including Disney’s ESPN and ABC, Discovery Communications (DISCA),  AMC Networks (AMCX),  ViacomCBS (VIAC), and Comcast’s own NBCUniversal, among others.\n  Netflix , meanwhile, signed up more than 15 million new subscribers in the first quarter. When it comes to cable companies, the trend is not their friend.", "posttime": "2020-05-11 03:38:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "流行,finally,有线电视", "title": "大流行会最终扼杀有线电视吗？", "title_en": "Will the Pandemic Finally Kill Cable TV?", "transed": 1, "url": "https://www.barrons.com/articles/cord-cutting-picks-up-steam-r-i-p-cable-tv-51588954999", "via": "", "real_tags": ["流行", "finally", "有线电视"]}, {"category": "", "categoryclass": "", "imagename": "391784ea5c4f5e33c928538802b3e08e.png", "infoid": 1001567, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有没有想过编写C代码并在Android上运行？厌倦了只做最基本的事情的几百万字节的包。这是一个演示如何制作您自己的APK，以及如何在大约2秒内构建、安装并自动运行它们，并且APK大小约为25KB。\n免责声明：我对此代码不承担任何担保或责任。自费使用。我从来没有在应用程序商店发布过应用程序，所以使用这个工具集来制作商业应用程序可能会有一些根本的问题！\n因为有时候你想做一些不符合正常方式的事情，而网上所有的讨论都围绕着所有正常的过程来做。而这些过程会发生变化，使得跟上并做具体的事情变得困难。通过使用Makefile，可以很容易地看到执行了哪些确切的命令，并添加自定义规则和调整您的构建。C是一种通用语言。从ESP8266到RaspberryPI、Windows Linux，再到现在的Android，Rawraw可以在所有操作系统上运行。只需编写一次代码，就可以随时随地使用它。\n当你没有用堆积如山的豆子填满你的构建过程时，你最终只剩下重要的部分，而不是琐碎的部分。这使得开发、部署等变得更容易，因为一切都需要更少的时间。\n为了吸引那些在互联网上张贴这是不可能的事情的勒德人，或者你做错了堆栈溢出问题，还得做一点这件事。在JNI&34；中请求权限，哦，您必须在Java或其他类似的愚蠢的东西中这样做。我对你关于什么是可能的，什么是不可能的看法完全不感兴趣。这是计算机科学。这里有很多限制。我可以做任何我想做的事。这只是几个比特。你不拥有我。\n附注：如果你想要一大堆关于如何用C在Android上做你需要Java做的事情的例子，滚动到这个文件的底部：https://github.com/cntools/rawdraw/blob/master/CNFGEGLDriver.c-它展示了如何使用JNI在Android API之间编组大量的东西，而不需要回到Java/Kotlin的领域。\n大部分测试都是在Linux上完成的，然而@AEFeinstein至少在Windows上做了粗略的测试。你还需要对Android studio的一些组件进行设置才能使用它，所以完全安装Android studio通常会更容易一些，但在Windows上有一些关于如何零散安装的说明。\n这组步骤介绍了如何在Linux中安装支持NDK的Android Studio。它使用图形化安装程序，并且安装的内容比下面的说明多得多。您可以将这两套说明混合搭配使用。例如，如果您使用的是Linux，但不要为Goog牺牲6 GB的磁盘。\n进入手机上的“开发人员选项”并启用USB调试，确保选择“始终允许”。\n如果您在Windows Subsystem for Linux(WSL)中进行开发，请按照无GUI安装的步骤从命令行安装Android组件，而不安装任何GUI组件。\n为了将APK推送到您的手机上，您还需要在Windows中安装ADB。您可以通过从https://developer.android.com/studio#downloads或直接从https://dl.google.com/android/repository/platform-tools_r24.0.4-windows.zip.获取完整的Android Studio来做到这一点。安装完整的Android Studio比较容易，但您也可以只获取命令行工具，然后从那里安装ADB。以下步骤概述了如何使用直接链接执行此操作。\n安装Windows Subsystem for Linux(WSL)。你可以在这里找到使用说明：https://docs.microsoft.com/en-us/windows/wsl/install-win10-我们使用ubuntu来做这件事。\n仅下载命令行工具&#34；：https://developer.android.com/studio#downloads-您可以通过单击&#34；LinuxTM工具集，然后右键单击Accept链接并说“将链接复制到位置”来获取URL并在WSL中使用wget下载工具。然后你可以在WSL中说wget&lt；link&gt；。\n为Android SDK创建一个文件夹，并将其导出。您可能希望将该导出添加到~/.bashrc：\n解压缩仅限&#34；命令行工具的&#34；文件，以便工具位于全新的Android-SDK文件夹中。\n#yes|$Android_HOME/tools/bin/sdkmanager--SDK_ROOT=${Android_HOME}--许可证#$Android_HOME/tools/bin/sdkmanager--SDK_ROOT=${Android_HOME}&#34；build-tools；29.0.3&#34；&#34；cmake；3.10.2.4988404&#34；&#34；ndk；21.1.6352462&#34；&#34；patcher；v4&#34；&。Android-24&34；&#34；工具&#34；\n注意：由于环境变量的更新，您可能需要关闭并重新打开您的WSL终端。\n进入手机上的“开发人员选项”并启用USB调试，确保选择“始终允许”。\n您可能希望复制并粘贴此项目，但您可能会将其作为子模块使用。您可能还希望复制并粘贴子模块。\n您必须覆盖应用程序名称。参见Makefile APPNAME-您应该能够包括此项目的Makefile并覆盖它。您还必须使用您计划使用的任何名称和组织更新AndroidManifest.xml。这意味着更新所有三个字段。头中的android：name字段和Package字段。\n如果您使用的是必须提示输入的权限，则必须将其添加到AndroidManifest.xml中，并检查您是否拥有该权限，如果没有，则提示用户。请参见下面的辅助函数。您可以使用ColorChord中的ound_android.c查看此示例。https://github.com/cnlohr/colorchord/blob/master/colorchord2/sound_android.c。\n请务必卸载所有以前安装的应用程序，如果您有一个使用另一个密钥签名的相同名称的不同版本，则会发生不好的事情。\n如果您的应用程序立即打开和关闭，请尝试查看是否缺少任何符号：\n因为我们完全是在NDK中使用JNI来做这件事，所以我们不会有机会编写任何Java/Kotlin代码并调用它。这意味着所有的在线例子都必须大量编排。在rawraw的EGL驱动程序中，我们有很多这样做的例子。也就是说，您可以使用以下函数，这些函数可以帮助您完成大部分工作。\n此外，除了rawraw之外，您还必须实现以下两个函数，以便在应用程序挂起或恢复时进行处理。\n除此之外，HandleMotion(.)的语法。不同之处在于，掩码变量不是掩码，它只是更新特定的指针。", "note_en": "Ever wanted to write C code and run it on Android? Sick of multi-megabytepackages just to do the most basic of things. Well, this is a demo of howto make your own APKs and build, install and automatically run them in about2 seconds, and with an apk size of about 25kB.\n     DISCLAIMER: I take no warranty or responsibility for this code. Use at your own risk. I&#39;ve never released an app on the app store, so there may be some fundamental issue with using this toolset to make commercial apps!\n   Becaue sometimes you want to do things that don&#39;t fit into the normal way of doing it and all the discussions online revolve around doing it with all the normal processes. And those processes change, making it difficult to keep up and do specific things. By using  Makefiles it&#39;s easy to see what exact commands are executed and add custom rules and tweak your build. C is a universal language. Rawdraw operates on everything from an ESP8266, to RaspberryPi, Windows Linux and now, even Android. Write code once, use it everywhere.\n When you don&#39;t fill your build process with hills of beans, you end up being left with the parts that are important, and not the frivilous parts. This makes it easier to develop, deploy, etc, because everything takes much less time.\n A little bit of this also has to do to stick it to all those luddites people on the internet who post &#34;that&#39;s impossible&#34; or &#34;you&#39;re doing it wrong&#34; to Stack Overflow questions... Requesting permissions in the JNI &#34;oh you  have to do that in Java&#34; or other dumb stuff like that. I am completely uninterested in your opinions of what is or is not possible. This is computer science. There aren&#39;t restrictions. I can do anything I want. It&#39;s just bits. You don&#39;t own me.\n P.S. If you want a bunch of examples of how to do a ton of things in C on Android that you &#34;need&#34; java for, scroll to the bottom of this file:  https://github.com/cntools/rawdraw/blob/master/CNFGEGLDriver.c - it shows how to use the JNI to marshall a ton of stuff to/from the Android API without needing to jump back into Java/Kotlin land.\n  Most of the testing was done on Linux, however @AEFeinstein has done at least cursory testing in Windows. You still need some components of Android studio set up to use this, so it&#39;s generally easier to just install Android studio completely, but there are instructions on sort of how to do it piecemeal for Windows.\n  This set of steps describes how to install Android Studio with NDK support in Linux. It uses the graphical installer and installs a lot more stuff than the instructions below. You may be able to mix-and-match these two sets of instructions. For instance if you are on Linux but don&#39;t want to sacrifice 6 GB of disk to the Googs.\n       Go into developer options on your phone and enable &#34;USB debugging&#34; make sure to select always allow.\n   If you&#39;re developing in Windows Subsystem for Linux (WSL), follow the &#34;Steps for GUI-less install&#34; to install the Android components from the command line, without any GUI components.\n  In order to push the APK to your phone, you need  adb installed in Windows as well. You can do that by getting the full Android Studio from  https://developer.android.com/studio#downloads or directly  https://dl.google.com/android/repository/platform-tools_r24.0.4-windows.zip. Installing the full Android Studio is easier, but you can also get the &#34;Command line tools only&#34; and install  adb from there. The steps below outline how to do this with the direct link.\n  Install Windows Subsystem for Linux (WSL). You can find instructions here:  https://docs.microsoft.com/en-us/windows/wsl/install-win10 - we use &#34;Ubuntu&#34; for this.\n  Download &#34;Command line tools only&#34;:  https://developer.android.com/studio#downloads - you can get a URL and use  wget in WSL to download the tools by clicking on the &#34;Linux&#34; toolset, then right-clicking on the accept link and saying copy link to location. Then you can say  wget &lt;link&gt; in WSL.\n Create a folder for the Android SDK and export it. You may want to add that export to your  ~/.bashrc:\n  Unzip the &#34;Command line tools only&#34; file so that  tools is in your brand new  android-sdk folder.\n # yes | $ANDROID_HOME/tools/bin/sdkmanager --sdk_root=${ANDROID_HOME} --licenses# $ANDROID_HOME/tools/bin/sdkmanager --sdk_root=${ANDROID_HOME} &#34;build-tools;29.0.3&#34; &#34;cmake;3.10.2.4988404&#34; &#34;ndk;21.1.6352462&#34; &#34;patcher;v4&#34; &#34;platform-tools&#34; &#34;platforms;android-24&#34; &#34;tools&#34;\n   NOTE: because of updates to environment variables, you may want to close and re-open your WSL terminal.\n  Go into developer options on your phone and enable &#34;USB debugging&#34; make sure to select always allow.\n     You may want to copy-and-paste this project, but, you could probably use it as a submodule. You may also want to copy-and-paste the submodule.\n You  MUST override the app name. See in Makefile  APPNAME - you should be able to include this project&#39;s makefile and override that. You must also update  AndroidManifest.xml with whatever name and org you plan to use. That means updating all three fields. Both  android:name fields and the  package field in the header.\n If you are using permission you have to prompt for, you must both add it to your  AndroidManifest.xml as well as check if you have it, and if not, prompt the user. See helper functions below. You can see an example of this with  sound_android.c from ColorChord.  https://github.com/cnlohr/colorchord/blob/master/colorchord2/sound_android.c\n Be sure to uninstall any previously installed apps which would look like this app, if you have a different build by the same name signed with another key, bad things will happen.\n  If your app opens and closes instantly, try seeing if there are any missing symbols:\n   Because we are doing this entirelly in the NDK, with the JNI, we won&#39;t have the luxury of writing any Java/Kotlin code and calling it. That means all of the examples online have to be heavily marshalled. In rawdraw&#39;s EGL driver, we have many examples of how to do that. That said, you can use the following functions which get you most of the way there.\n        Also, above and beyond rawdraw, you  must implement the following two functions to handle when your apps is suspended or resumed.\n  In addition to that, the syntax of  HandleMotion(...) is different, in that instead of the  mask variable being a mask, it is simply updating that specific pointer.", "posttime": "2020-05-11 03:37:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,android,程序", "title": "完全用C和make编写Android应用程序", "title_en": "Writing Android Apps Entirely in C and make", "transed": 1, "url": "https://github.com/cnlohr/rawdrawandroid", "via": "", "real_tags": ["app", "android", "程序"]}, {"category": "", "categoryclass": "", "imagename": "e387c96e81e9e126ae109f53999169ba.jpg", "infoid": 1001566, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在19世纪50年代，墓地里挤满的人并不都死了。在炎热的夏天，纽约人成群结队地来到布鲁克林庞大的绿林公墓，以便呼吸和活动。这座城市的人口在五十年内增长了五倍，人们需要一个地方来逃离他们的小房子。\n尽管受到驱散的警告，人们仍继续在陵墓之间野餐。但市政府官员没有惩罚去墓地的人，而是采取了不同的方式。为了满足需求，他们在几个街区外建了一个公园。这将成为该市历史上最有效的公共卫生措施之一。\n在过去的150年里，展望公园在布鲁克林的中心占据了500多英亩的土地。就在周边延伸着一条宽阔的道路，禁止车辆通行，将自行车和行人一分为二。方圆三英里多。在美国最大、最密集的城市中心，你可以在树木的包围下，想跑多远就跑多远，而不需要穿过一条街道，也不会看到一辆车。\n这个循环我已经运行了至少一千次了。我在一天中的任何时间和一年中的任何时间都在运行它。我在冻雨和酷热中跑步。总会有人的。它总是感觉像是一种逃避。但现在，有史以来第一次，这种感觉消失了。\n不同的是警察。他们每几百码就在车里闲逛，以强制社交距离，并有权对与他人距离太近的跑步者处以罚款和逮捕。逮捕大多发生在其他更贫穷的公园和社区-一些已经变得暴力。本周，一名警察在布鲁克林门廊上驱散一群人时，一拳打在一名男子的脸上。在附近，警方强行逮捕了三名黑人男子，据称其中一人昏迷。周五，纽约市市长白思豪(Bill De Blasio)没有改变路线，而是宣布他将部署警察，进一步限制通往户外的通道-包括哈德逊河(Hudson River)两旁的公共空间狭长地带。理由是我们没有足够的空间让每个人外出或逗留很长时间。\n但我们确实有地方。横跨整个曼哈顿的宽阔大道在寂静中回荡。纽约市有6000多英里的街道。在一个典型的夏季周末，当许多人出行时，其中大部分几乎不会被汽车使用。今年夏天，街道肯定只会更加荒芜。而且有可能将它们关闭，不让汽车进入，给人们步行、跑步和骑自行车的空间。特别是在大流行期间，仅仅是保护公共空间就是一项对身心健康的高收益投资。\n像纽约市的许多人一样，我住在一套大约250平方英尺的公寓里。对于我来说，要遵守和郊区麦克豪宅里的人一样的命令要困难得多。我们唯一的避难所是公共空间，在温暖的日子里，这些公共空间通常会挤满人，超出了任何社交距离的能力。当人们被困在家里，那么多其他机构都关闭了-我们的图书馆、博物馆、健身房、游泳池、餐馆-公园已经比往常更拥挤了。甚至绿林公墓也威胁要关闭，因为寻找步行空间的人过于拥挤。这种情况将创造一个病毒式的火药桶，将在炎热的夏季点燃纽约。提出解决方案是限制这些本已珍贵的公共空间的使用，这与解决方案相反。\n需要四处走动是一种基本的生理需求。当我们与世隔绝并被限制在狭小的空间时，我们的健康就像大多数动物一样恶化。即使是那些自认为内向的人，也有一些需要出现在人们面前，即使是安静的。在冠状病毒大流行期间，我们必须以尽可能安全的方式做这些事情。我们可以预期，户外通常会更安全，因为空气可以分散我们适当距离的呼吸。随着健身房关闭，基本的日常体育活动陷入停顿，有意识地进行锻炼比以往任何时候都更加重要-对身体和精神都是如此。\n当然，心脏病、糖尿病和抑郁症并没有不复存在。如果说有什么不同的话，那就是他们应该随着久坐隔离和监禁而恶化-更不用说经济衰退和我们周围失去生命和社区的现实了。\n本月早些时候，该市气喘吁吁地宣布，在周末期间，6000英里的城市街道中只有7条将关闭交通。它的目标是到夏天达到100英里-仅占可用面积的1%。白思豪辩称，该市没有足够的“人员”来开放更多的人行横道，因为每个新的步行十字路口都需要警察的监督。但显然有足够的人员来维持公园的治安。\n取缔公园而不是提供更多空间的决定具有巨大的后果-而且不仅仅是对纽约人来说。这是美国政府默认惩罚性司法而非恢复性司法的一个缩影。我们把人往最坏的方面想。当我们看到人们挤在公园里的照片时，我们会认为他们只是危险、鲁莽的人。我们呼吁惩罚他们。\n在大流行期间，人们不会厚颜无耻地寻找拥挤的公园。就像没有人想睡在地铁车厢里或住在桥下一样，人们都到外面去，因为他们没有其他地方可去。如果可以选择，人们就不会挤在一起了--而这个选择是存在的。\n打开街道。至少打开一半。如果我们没有足够的警力来实施临时交通封锁，那就用混凝土栅栏半永久地打开它们。永久开放其他街道。炸掉沥青，给土地铺上草皮，种树种花，不要回头。\n病毒将伴随我们很长一段时间，而且会有更多的病毒出现。我们需要做好准备。打开街道。机不可失，时不再来。\n我们想听听您对这篇文章的看法。向编辑提交一封信，或写信给letters@theatlantic.com。\n医学博士，是“大西洋月刊”的特约撰稿人。他也是耶鲁大学公共卫生学院的讲师，也是即将出版的“清洁”一书的作者。", "note_en": "In the 1850s, the people filling the cemetery were not all dead. Throughout the hot days of summer, New Yorkers flocked to Brooklyn’s sprawling  Green-Wood Cemetery in order to breathe and move. The city’s population had increased  fivefold in five decades, and people needed a place to escape from their tiny homes.\n   Despite warnings to disperse, people continued picnicking among the mausoleums. But instead of punishing the cemetery-goers, city officials took a different approach. To accommodate the demand, they  built a park a few blocks away. It would come to be one of the most effective  public-health measures in the city’s history.\n For the past  150 years, Prospect Park has occupied more than 500 acres in the heart of Brooklyn. Just within the perimeter stretches a wide road that’s closed to traffic, divided in half for bikes and pedestrians. It’s more than three miles around. In the center of America’s largest and densest city, you can run as far as you like, surrounded by trees, without crossing a single street or seeing a single car.\n I’ve run the loop at least a thousand times. I’ve run it at all hours of the day and times of the year. I’ve run in freezing rain and torrid heat. There are always people. It’s always felt like an escape. But now, for the first time ever, that feeling is gone.\n    The difference is the police. They idle in cars every few hundred yards to enforce social distancing, empowered to fine and arrest runners for getting too close to others. The arrests happen mostly in other, poorer parks and neighborhoods—and some have gotten violent. This week, while breaking up a group on a stoop in Brooklyn, a police officer  punched a man in the face. Nearby, police forcibly arrested three black men in an encounter that allegedly left one  unconscious. Instead of changing course, on Friday New York City Mayor Bill de Blasio  announced that he would deploy police to further limit access to the outdoors—including the strips of public space that line the Hudson River. The justification is that we don’t have enough space for everyone to be out, or to linger long.\n  But we do have the space. The vast avenues that span the length of Manhattan are echoing in silence. New York City is home to more than  6,000 miles of streets. Much of that is barely used by cars on a typical summer weekend, when many people travel. The streets will surely be only more barren this summer. And  it is possible to close them to cars and give people room to walk, run, and bike. Especially during a pandemic, simply preserving public space is a profoundly high-yield investment in physical and mental health.\n   Like many others in New York City, I live in an apartment that’s about 250 square feet. It’s a lot harder for me to abide by the same orders as people in sprawling suburban McMansions. Our sole escape is the public spaces that typically fill beyond any ability to socially distance on warm days. When people are stuck at home, and so many other establishments are closed—our libraries, museums, gyms, pools, restaurants—the parks are already more crowded than usual. Even the Green-Wood Cemetery has  threatened to close because of overcrowding by people in search of spaces to walk. The situation stands to create a viral tinderbox that will ignite New York in the heat of the summer. To propose that the solution is to limit the use of these already precious public spaces is the inverse of a solution.\n The need to move around is a basic physiologic imperative. Our health  deteriorates just like that of most animals when isolated and confined to tiny spaces. Even those who identify as introverts have  some need to be in the presence of people, if quietly. During the coronavirus pandemic, we must do these things in the safest possible ways. We can expect to be generally safer outdoors, where air disperses our properly distanced breath. With gyms closed and basic daily physical activity ground to a halt, deliberately undertaking exercise is more important than ever—for the body and mind.\n  Of course, heart disease, diabetes, and depression have not ceased to exist. If anything, they should be expected to worsen with sedentary isolation and confinement—not to mention economic depression and the realities of the loss of life and community all around us.\n    Earlier this month, the  city breathlessly announced that during the weekend it will close to traffic just seven of the 6,000 miles of city streets. It aims to get up to 100 miles by summer—barely 1 percent of the area available. De Blasio has argued that the city doesn’t have enough “ personnel”to open more, as each newly pedestrian intersection would require police supervision. But apparently there is enough personnel to police the parks.\n The decision to crack down on parks rather than make more space available is of tremendous consequence—and not just to New Yorkers. It is a microcosm of America’s  default to punitive rather than restorative justice. We assume the worst in people. When we see photos of people crowded into a park, we assume they are simply dangerous, reckless people. We call to punish them.\n  People are not brazenly seeking out crowded parks during a pandemic. Just as no one wants to sleep in a subway car or live under a bridge, people are going outside because they have no other place to go. If given the option, people would not be crowded together—and that option exists.\n Open the streets. Open at least half of them. If we do not have enough police to enforce temporary closure to traffic, then open them semipermanently with concrete barriers. Open other streets  permanently. Dynamite the asphalt, sod the land, plant trees and flowers, and do not look back.\n The virus is going to be with us for a long time, and more viruses will come. We need to be prepared. Open the streets. Do it now.\n  We want to hear what you think about this article.  Submit a letter to the editor or write to letters@theatlantic.com.\n            , M.D., is a staff writer at  The Atlantic. He is also a lecturer at Yale School of Public Health and author of the forthcoming book   Clean.", "posttime": "2020-05-11 03:36:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "关闭,close", "title": "别关闭公园。打通街道", "title_en": "Don’t Close Parks. Open Up Streets", "transed": 1, "url": "https://www.theatlantic.com/health/archive/2020/05/open-the-streets/611470/", "via": "", "real_tags": ["关闭", "close"]}, {"category": "", "categoryclass": "", "imagename": "39ddde4c274d251badf844f3a2b613c2.png", "infoid": 1001565, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有压倒性的考古学和遗传学证据表明，现代语音设备是在60万年前被人类获得的1。另一方面，象征现代想象力的人工制品，如(1)组合比喻艺术，(2)带眼的骨针，(3)住宅的建造，以及(4)精心制作的墓葬，都出现在不早于7万年前。(1)为什么现代语音设备的获得与现代想象力的获得有很大差距，(2)是什么触发了现代想象力的获得，7万年前就出现了。(2)是什么触发了现代想象力的获得，7万年前就出现了。(2)是什么触发了现代想象力的获得，7万年前就出现了。(2)是什么触发了现代想象力的获得。我们对现代想象力进化起源的研究一直受到对想象力某一特定组成部分发展的时间限制的观察的推动。现代儿童在童年早期没有接触过递归语言，永远不会获得被称为前额叶合成(PFS)的积极的建设性想象力。与词汇和语法习得不同的是，词汇和语法习得可以在人的一生中学习，而PFS的发展有一个很强的关键期，没有在童年早期接触过递归语言的人在成年后永远不会获得PFS。他们的语言总是缺乏对空间介词和递归的理解，而空间介词和递归依赖于PFS能力。以类似的方式，早期的原始人成年后不能学习递归语言，因此也不能教给他们的孩子递归语言。因此，PFS习得的强关键期的存在为行为现代性创造了进化障碍。一个进化的数学模型表明，三个事件的协同作用(1)基因突变通过同时减缓两个或更多儿童的前额叶皮质发育来延长临界期，(2)这些儿童发明了递归语言元素，如空间介词，以及(3)他们使用这些递归元素进行对话交流，导致他们父母的非递归交流系统同时转换为递归语言，并在大约7万年前获得了PFS。(2)这些儿童发明了递归语言元素，如空间介词，以及(3)他们使用这些递归元素进行对话交流，导致他们父母的非递归交流系统同时转换为递归语言，并获得了大约7万年前的PFS。\n韦尼克区和布罗卡区与语言的联系是众所周知的。不太常见的是，人们意识到理解完整的递归语言依赖于外侧前额叶皮质(LPFC)。Wernicke区主要连接单词和宾语3，Broca区解释语法并将句子中的单词分配到一个语法组，如名词、动词或介词3，但只有LPFC才能根据句子的描述4、5将记忆中的对象组合成一个新的心理意象。后者的功能通常被称为想象。然而，术语“想象力”是模棱两可的，因为它经常被用来描述任何内部产生的经验。例如，做梦通常被描述为一种想象的体验。然而，做梦有一个完全不同的神经机制，因为做梦不受LPFC 6-8的控制。LPFC在睡眠6、8期间是不活跃的，LPFC受损的患者不会注意到梦中的变化7。为了区分做梦时的想象和有意识的、有目的的、主动的、由LPFC驱动的新奇心理意象的合成，我们将后者定义为前额叶合成(PFS)。PFS完全依赖于完整的LPFC 11-16，LPFC受损的患者通常会失去PFS功能，证实了这两种类型的想象体验之间的神经分离。2.PFS完全依赖于完整的LPFC 11-16，LPFC受损的患者经常失去PFS功能，证实了这两种类型的想象经验之间的神经分离。\nLPFC和Broca‘s区受损的患者经常出现特殊的PFS缺陷，这会影响他们的语言和想象力。华金·福斯特(Joaquin Fuster)称他们在语言上的改变是“前额失语症”15，并解释说，“虽然单词和句子的发音保持不变，但语言是贫乏的，‘命题’能力明显减弱。”减少了句子的长度和复杂度。缺乏独立从句，更广泛地说，没有充分利用乔姆斯基所描述的语言递归的潜力15。亚历山大·卢里亚称这种情况为“额前动态性失语症”17，并报告说，只要对话不涉及宾语组合，这些患者就看起来不起眼。他们不会丢失他们的词汇量，并且可以让对话继续下去：“…。这类病变的患者发音没有困难。他们还能够保持听到和理解大多数口语的能力。他们使用数字符号和许多不同类型的抽象概念的能力也保持不变…。这些患者很容易理解“因果关系”、“发展”或“合作”等复杂概念的含义。他们还能够进行抽象的对话。…。他们可以重复和理解简单的句子\n在成年学习一门新语言的过程中，PFS和MERGE之间的区别也可以突出出来：当一个人学习德语、西班牙语或意大利语时，他会学习新的单词(韦尼克区)和新的语法规则(布罗卡区)，然而，PFS没有丝毫变化。同样的PFS能力也可以用来理解德语、西班牙语或意大利语句子。换句话说，尽管词汇和语法规则不同，PFS在所有现代人类语言中都是通用的。\n所有人类语言都允许使用有限数量的词(在这里和以后，词被理解为意义单位，被语言学家称为义位)来高保真地传输无限数量的新奇图像。使用有限数量的单词来传达无限数量的图像的魔力完全取决于对话者进行PFS的能力。当我们描述小说形象时(“我的房子在左边第二个，就在教堂对面”)，我们依赖对话者使用PFS来可视化小说形象。当我们讲故事时，我们经常描述对话者从未见过的东西(“那个生物有三个头，两个尾巴，绿色的大眼睛，跑得比猎豹还快”)，我们依靠对话者想象他们脑海中的故事。正如史蒂芬·平克所说，“说话者有一个想法，发出一个声音，依靠听众听到声音并恢复那个想法”22。当一个人试图理解描述对象组合的句子时，PFS能力的重要性得到了最好的认识。想想这两句话：“一只狗咬了我的朋友”和“我的朋友咬了一只狗。”单用单词或语法是不可能区分意义上的差异的，因为这两个句子中的单词和语法结构都是相同的。理解意义上的差异，领会第一句话的不幸和第二句话的幽默，取决于对话者的PFS能力。只有当LPFC在脑海中形成这两个不同的形象之后，我们才能理解这两句话的不同之处。类似地，带有嵌套解释的递归语句(“山后的大树左边的巨石上的一条蛇”)迫使对话者使用PFS将对象(蛇、巨石、树和小山)组合成一个新的场景。出于这个原因，语言学家将现代完整的人类语言称为递归语言。\n递归语言使用有限数量的单词来传达无限数量的新奇图像的能力取决于对话者的PFS能力，空间介词、动词时态、嵌套和其他常见的语法元素也促进了这种能力。例如，考虑空间介词的指数能力来增加可以高保真传送的不同图像的最大数量(图2)。在一种没有空间介词或其他递归成分的语言中，1000个名词可以向听者传达1000个图像。只添加一个空间介词就可以形成三个单词的短语(例如：“杯子后面的碗”或“碗后面的杯子”)，并将可以传达的不同图像的数量从1000增加到100万(图2,1000×1×1000)。添加第二个空间介词并允许形式为宾语-介词-宾语-介词-宾语的五个单词的句子(例如：“碗后的盘子上的杯子”)将可传递的不同图像的数量增加到40亿(1000×2×1000×2×1000)。添加第三个空间介词会将不同图像的数量增加到27万亿(1000×3×1000×3×1000×3×1000)，依此类推。一种有1000个名词和100个空间介词的典型语言理论上可以传达1000^101x100^100个不同的图像。这个数字明显大于宇宙中的原子总数。实际上，一种只需1000个单词和几个介词的递归语言就可以传递无限多不同的图像。\n使用有限数量的单词来传递无限数量的图像的魔力完全取决于PFS能力。缺乏这种能力的人不能根据空间介词所强加的规则构建新颖的心理意象，因此不能理解空间介词的意义。在一种有1000个名词和100个空间介词的语言的理论例子中，PFS残疾人对这1000个名词的理解将受到限制。推广到语言的其他元素，我们得出结论，PFS残疾患者预计会缺乏对任何语言递归元素的理解-Fuster和Luria报告的额前性失语患者15、18的症状。(由于“失语症”在希腊语中的意思是“无言”，而这些患者在语言方面没有问题，我们更愿意将\n..", "note_en": "There is an overwhelming archeological and genetic evidence that modern speech apparatus was acquired by hominins by 600,000 years ago  1. On the other hand, artifacts signifying modern imagination, such as (1) composite figurative arts, (2) bone needles with an eye, (3) construction of dwellings, and (4) elaborate burials arose not earlier than 70,000 years ago  2. It remains unclear (1) why there was a long gap between acquisition of modern speech apparatus and modern imagination, (2) what triggered the acquisition of modern imagination 70,000 years ago, and (3) what role language might have played in this process. Our research into evolutionary origin of modern imagination has been driven by the observation of a temporal limit for the development of a particular component of imagination. Modern children not exposed to recursive language in early childhood never acquire the type of active constructive imagination called Prefrontal Synthesis (PFS). Unlike vocabulary and grammar acquisition, which can be learned throughout one’s lifetime, there is a strong critical period for the development of PFS and individuals not exposed to recursive language in early childhood can never acquire PFS as adults. Their language will always lack understanding of spatial prepositions and recursion that depend on the PFS ability. In a similar manner, early hominins would not have been able to learn recursive language as adults and, therefore, would not be able to teach recursive language to their children. Thus, the existence of a strong critical period for PFS acquisition creates an evolutionary barrier for behavioral modernity. An evolutionary mathematical model suggests that a synergistic confluence of three events (1) a genetic mutation that extended the critical period by slowing down the prefrontal cortex development simultaneously in two or more children, (2) invention of recursive elements of language, such as spatial prepositions, by these children and (3) their dialogic communications using these recursive elements, resulted in concurrent conversion of a non-recursive communication system of their parents to recursive language and acquisition of PFS around 70,000 years ago.\n Association of Wernicke’s and Broca’s areas with language is well-known. Less common is realization that understanding of full recursive language depends on the lateral prefrontal cortex (LPFC). Wernicke’s area primarily links words with objects  3, Broca’s area interprets the grammar and assigns words in a sentence to a grammatical group such as noun, verb, or preposition  3, but only the LPFC can combine objects from memory into a novel mental image according to a sentence’s description  4, 5. The latter function is commonly called imagination. The term “imagination,” however, is ambiguous as it is regularly used to describe any experience that was generated internally. For example, dreaming is often described as an imaginary experience. However, dreaming has a completely different neurological mechanism, as dreaming is not controlled by the LPFC  6– 8. LPFC is inactive during sleep  6, 8 and patients whose LPFC is damaged do not notice change in their dreams  7. In order to distinguish the imagination during dreaming from the conscious purposeful active LPFC-driven synthesis of  novel mental images, we define the latter process as  Prefrontal Synthesis (PFS, a.k.a. mental synthesis)  9, 10. PFS is completely dependent on an intact LPFC  11– 16 and patients with damage to LPFC often lose their PFS function confirming neurological dissociation between the two types of imaginary experience  2.\n Patients with damage to the LPFC and spared Broca’s area often present with a specific PFS deficit, that affects both their language and imagination. Joaquin Fuster calls their alteration in language “prefrontal aphasia”  15 and explains that “although the pronunciation of words and sentences remains intact, language is impoverished and shows an apparent diminution of the capacity to ‘propositionize.’ The length and complexity of sentences are reduced. There is a dearth of dependent clauses and, more generally, an underutilization of what Chomsky characterizes as the potential for recursiveness of language”  15. Alexander Luria calls this condition “frontal dynamic aphasia”  17 and reports that as long as a conversation does not involve combination of objects, these patients look unremarkable. They do not lose their vocabulary and can keep a conversation going: “…patients with this type of lesion have no difficulty articulating words. They are also able to retain their ability to hear and understand most spoken language. Their ability to use numerical symbols and many different kinds of abstract concepts also remains undamaged… these patients had no difficulty grasping the meaning of complex ideas such as ‘causation,’ ‘development,’ or ‘cooperation.’ They were also able to hold abstract conversations. … They can repeat and understand sentences that simply communicate events by creating a sequence of verbal images”  18. Luria further explains that their disability shows only when patients have to imagine several objects or persons in a  novel combination (revealing the problem of PFS): “But difficulties developed when they were presented with complex grammatical constructions which coded logical relations. … Such patients find it almost impossible to understand phrases and words which denote relative position and cannot carry out a simple instruction like ‘draw a triangle above a circle.’ This difficulty goes beyond parts of speech that code spatial relations. Phrases like ‘Sonya is lighter than Natasha’ also prove troublesome for these patients, as do temporal relations like ‘spring is before summer’ [AV: space is commonly used to represent time and therefore PFS disability usually results in inability to understand temporal relationship as well]. …Their particular kind of aphasia becomes apparent only when they have to operate with groups or arrangements of elements. If these patients are asked, ‘Point to the pencil with the key drawn on it’ or ‘Where is my sister’s friend?’ they do not understand what is being said. As one patient put it, ‘I know where there is a sister and a friend, but I don’t know who belongs to whom’”  18. In our research, we have found that simplest relational inquiries can often quickly elucidate PFS disability. Questions, such as “If a cat ate a dog, who is alive?” and “Imagine the  blue cup inside the  yellow cup, which cup is on top? can be consistently answered by four-year-old children but commonly failed by individuals with PFS disability  19.\n Crucially, PFS disability is not just a receptive language disorder, but a deficit in imagination that can be confirmed by nonverbal IQ tests. Individuals with PFS disability may have normal full-scale IQ, but commonly exhibit a selective and catastrophic deficit in tasks relying on PFS, e.g., matrix reasoning tasks requiring integration of multiple objects  12, such as those shown in  Figure 1. Persons with PFS disability invariably fail these integration tasks and, therefore, typically perform below the score of 86 in non-verbal IQ tests  20.\n  A deficit in imagination in otherwise unremarkable individuals is extremely counterintuitive for several reasons. First, most scientists have never met anyone with PFS disability as these individuals do not frequent university campuses and other privileged institutions. Second reason is that PFS was traditionally grouped with the other components of imagination, such as dreaming, spontaneous insight, and integration of modifiers, making it difficult to discuss the exact nature of a patient’s deficit, whose dreaming, spontaneous insight, and integration of modifiers remain normal. Finally, even when we see individuals with PFS disability, we tend to anthropomorphize, assume their normal PFS, and brush off their shortfall as a linguistic problem, memory deficit, or inattentiveness. However, when considered together with nonverbal IQ test, specifically those items that require integration of objects, there can be no mistake: as many as 18% of modern individuals exhibit PFS disability  5. These individuals include some patients with damage to their PFC, low-functioning individuals with congenital neurological problems, as well as individuals with no congenital abnormality, who were not exposed to recursive language in early childhood (see below).\n  PFS is defined neurobiologically as the conscious, purposeful process of synthesizing  novel mental images from two or more objects stored in memory. There is no linguistically defined process that is neurobiologically equivalent to this distinct mechanism of imagination. The closest in spirit is Chomskyan Merge, defined as a process of combining any two syntactic objects to create a new one  21. PFS, however, is different both in scope and underlying neurobiology. An individual does not need to know the names of objects in order to combine them mentally into a novel hybrid object or scene. One can mentally combine objects of strange geometrical shape that do not have names in any language. Merging of objects in mental space does not directly depend on knowledge of any language.\n Even when language is used to direct PFS in the mind of interlocutor, PFS definition is different from Merge. For example, combination of an adjective and a noun is a Merge operation, but does not fall under PFS that must always involve combination of two or more independent objects. Furthermore, PFS, but not Merge, requires creating a  novel mental hybrid object or scene. For example, a sentence ‘ship sinks’ can be understood by  remembering a previously seen picture of a sinking ship and thus, completely avoiding the PFS process. Under Chomskyan theory, ‘ship sinks’, however, is considered a Merge operation since the sentence merges a determiner phrase ‘ship’ and a verb ‘sinks’ to create a sentence ‘ship sinks.’\n In neurobiological terms, Merge operation is defined in such a way that it utilizes all three brain language regions: Wernicke’s area that primarily links words with objects; Broca’s area that interprets the grammar and assigns words in a sentence to a grammatical group such as noun, verb, or preposition  3; and the LPFC that synthesizes the objects from memory into a novel mental image according to sentence’s description  4, 5. Crucially, PFS definition leaves out interpretation of grammar in the Broca’s area and leaves out linking words with objects in the Wernicke’s area. PFS definition limits it to the function of the LPFC. Thus, PFS is defined significantly more narrowly than the Merge operation in both neurological and linguistic terms.\n The difference between PFS and Merge can be also highlighted by the process of learning a new language in adulthood: when one studies German, Spanish or Italian, one learns new words (Wernicke’s area) and new grammar rules (Broca’s area), PFS, however, does not change a bit. The same PFS abilities can be used to understand German, Spanish, or Italian sentences. PFS, in other words, is universal across all modern human languages, despite different words and grammar rules.\n All human languages  allow high fidelity transmission of infinite number of novel images with the use of a  finite number of words (here and later, words are understood as units of meaning, called sememes by linguists). The magic of using a finite number of words to communicate an infinite number of images completely depends on interlocutor’s ability to conduct PFS. When we describe a novel image (“My house is the second one on the left, just across the road from the church”), we rely on the interlocutor to use PFS in order to visualize the novel image. When we tell stories, we are often describing things that the interlocutor has never seen before (“That creature has three heads, two tails, large green eyes, and can run faster than a cheetah”) and we rely on the interlocutor to imagine the story in their mind’s eye. As Steven Pinker put it, “the speaker has a thought, makes a sound, and counts on the listener to hear the sound and to recover that thought”  22. The importance of the PFS ability is best realized when one is attempting to understand sentences describing combination of objects. Consider the two sentences: “A dog bit my friend” and “My friend bit a dog.” It is impossible to distinguish the difference in meaning using words or grammar alone, since both words and grammatical structure are identical in these two sentences. Understanding the difference in meaning and appreciating the misfortune of the 1 st sentence and the humor of the 2 nd sentence depends on interlocutor’s PFS ability. Only after the LPFC forms these two different images in front of the mind’s eye, are we able to understand the difference between these two sentences. Similarly, recursive statements with nested explanations (“a snake on the boulder to the left of the tall tree that is behind the hill”) force interlocutor to use PFS to combine objects (a snake, the boulder, the tree, and the hill) into a novel scene. For this reason, linguists refer to modern full human languages as recursive languages.\n This ability of recursive language to communicate an infinite number of novel images with the use of a finite number of words depends on interlocutor’s PFS capacity and also is facilitated by spatial prepositions, verb tenses, nesting, and other common elements of grammar. Consider, for example, the exponential ability of spatial prepositions to increase the maximum number of distinct images that can be communicated with high fidelity ( Figure 2). In a language with no spatial prepositions or other recursive elements, 1000 nouns can communicate 1000 images to a listener. Adding just one spatial preposition allows for the formation of three-word phrases (such as: ‘a bowl behind a cup’ or ‘a cup behind a bowl’) and increases the number of distinct images that can be communicated from 1000 to one million (1000×1×1000,  Figure 2). Adding a second spatial preposition and allowing for five-word sentences of the form object-preposition-object-preposition-object (such as: ‘a cup on a plate behind a bowl’) increases the number of distinct images that can be communicated to four billion (1000×2×1000×2×1000). The addition of a third spatial preposition increases the number of distinct images to 27 trillion (1000×3×1000×3×1000×3×1000), and so on. A typical language with 1000 nouns and 100 spatial prepositions can theoretically communicate 1000^101 x 100^100 distinct images. This number is significantly greater than the total number of atoms in the universe. For all practical purposes, an infinite number of distinct images can be communicated by a recursive language with just 1000 words and a few prepositions.\n  The magic of using a finite number of words to communicate an infinite number of images completely depends on the PFS ability. A person lacking this ability is unable to construct novel mental images according to the rules imposed by spatial prepositions and, therefore, will not understand the meaning of spatial prepositions. In the theoretical example of a language with 1000 nouns and 100 spatial prepositions, the person with PFS disability will be limited in his/her comprehension to the 1000 nouns. Generalizing to other elements of language, we conclude that patients with PFS disability are expected to lack understanding of any recursive elements of language – the symptom reported by Fuster and Luria in  prefrontal aphasia patients  15, 18. (Since “aphasia” is translated from Greek as “speechless” and these patients have no problem with speech, we prefer to call their condition a “PFS disability.”)\n Extending this argument from a single individual to a community of individuals with PFS disability, we note that the communication system in that community must be non-recursive. Similarly, if we could envision a community of individuals who have not yet acquired the PFS ability phylogenetically, we could confidently say that they could not have understood recursive language and therefore could not have used spatial prepositions. They still could communicate, but their communication system must have been non-recursive, void of spatial prepositions and other sentences describing object combinations. Linguistics does not have an established name for such a communication system with thousands of words and no recursion. We cannot refer to it as ‘language’ in order to avoid confusion with recursive language. Accordingly, we will simply refer to it as rich-vocabulary non-recursive communication system.\n PFS disability is not limited to individuals with LPFC damage. Individuals without any brain injury exhibit PFS disability if they were not exposed to recursive language in early childhood  23– 26. In our metaanalysis of published research, ten out of ten individuals linguistically deprived until puberty suffered lifelong PFS disability despite learning significant vocabulary through intensive post-pubertal language therapy  4. E.g., Genie, who was linguistically isolated until the age of 13 years 7 months, expanded her vocabulary to several hundred words following multi-year rehabilitation, but never completely acquired ability to understand spatial prepositions, verb tense, or recursion  27, 28. Furthermore, like other individuals with PFS disability, she invariably failed in nonverbal mental integration tasks that require PFS, such as those shown in  Figure 1  4. As a child Genie was not exposed to any dialogic communications; the next group of individuals grew up exposed to conversations, but not with a recursive language.\n About 90% of all congenitally deaf children are born to hearing parents  29. In the US, these children typically receive special services, are introduced to a formal sign language and are encouraged to use this recursive language for communication. In less developed countries, however, deaf children may never be exposed to a formal sign language. To communicate, such families usually spontaneously invent homesign (a.k.a. kitchensign), a system of iconic gestures that consists of simple signs. The homesign system though is lacking spatial prepositions, verb tenses and other recursive elements of a formal sign language. In other words, deaf linguistic isolates grow up exposed to a non-recursive communication system with large number of sign-words. Our analysis shows that these individuals deprived of recursive conversations until puberty performed poorly in all PFS tests, both verbal and nonverbal (such as those shown in  Figure 1) despite focused multi-year post-pubertal rehabilitation efforts  4. The consistent observation of PFS disability in these individuals stands in stark contrast to their performance on memory as well as semantic tests: they could easily remember hundreds of newly learned words and recall previously seen objects from memory but had real difficulty in any tasks requiring them to mentally combine these objects into novel configurations. Consider E.M., a deaf individual who was not introduced to a formal sign language until the age of 15  30. E.M. tested at age 19, four years after his acquisition of hearing aids and intensive language therapy, could not follow a direction to “put the green box in the blue box”  30; he would pick up the appropriate two boxes and “move them through a variety of spatial arrangements, watching the examiner for clues as to which was correct.”  30 For successful completion of this task without relying on trial and error, one needs to use PFS to generate the novel mental image of the green box inside the blue box. In other words, the correct arrangement of physical objects is possible only after completing its mental simulation.\n Isolated deaf children who grow up using homesign for communication must be distinguished from deaf children developing in a community of other deaf childr\n......", "posttime": "2020-05-11 03:21:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "递归,递归语言,language,pfs", "title": "7万年前的递归语言革命--罗穆卢斯和雷穆斯假说", "title_en": "Recursive Language Revolution 70k Years Ago the Romulus and Remus Hypotheses", "transed": 1, "url": "https://www.biorxiv.org/content/10.1101/166520v9.full", "via": "", "real_tags": ["递归", "递归语言", "language", "pfs"]}, {"category": "", "categoryclass": "", "imagename": "a8b72a0e51d66213d40e859e3b11ddd4.jpeg", "infoid": 1001564, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PermalLink GitHub是5000多万开发人员的家园，他们一起工作，共同托管和审查代码、管理项目和构建软件。\n报名。\n可能你们中的许多人都遇到过错误，虽然它们很容易修复(例如，复制粘贴错误)，但在修复它们之前，它们在代码中隐藏了几个月或几年。在许多情况下，这些问题的解决方案是静态和动态代码分析器和程序，以便通过函数检查内存泄漏或CPU时间使用情况，从而帮助更好地优化代码和搜索瓶颈。\n我将要展示的所有工具对于开源项目都是免费的(PVS-Studio是一个小例外，但稍后会这样)，其中许多工具可以很容易地与CI(在我的例子中是GitLab CI)集成，以进行自动代码和回归检查。\n我已经与Sonarcloud、Cppcheck和Coverity Scan集成了很多项目，它们的代码和实现细节可以在这里找到--https://gitlab.com/dashboard/projects.。\nSonarcloud扫描的结果可以在这里找到-https://sonarcloud.io/organizations/qarmin-1/projects和cppcheck在GitLab上的给定项目中的管道中，例如https://qarmin.gitlab.io/-/godot/-/jobs/526221853/artifacts/report/index.html。\n这可能是C/C++源文件中最基本、最容易使用的错误搜索程序，它不需要编译检查过的程序即可工作。\n我们所要做的就是进入项目目录并在那里运行Cppcheck，或者使用图形版本并单击它。\n它有很多种结果表示，但对我来说，最方便的方法是导出为html(如下面的示例所示)。\n控制台-在项目文件夹内执行这些命令，报表文件夹内将生成一个包含代码和错误的HTML文件。\nSonarcloud允许您通过网站查看和分类潜在错误。它可以免费用于开源项目。它发现与Cppcheck类似的bug，而不是需要耗时的编译。\n静态分析器在操作上类似于Sonarcloud(您也可以在线查看结果，对于开源解决方案是免费的)，但它不允许将结果公开，因此每个人都必须请求访问它们。根据我的经验，它比以前的工具发现更多真正的错误。\n-$Coverity_SCAN_TOKEN、$GITLAB_USER_EMAIL、$Coverity_SCAN_PROJECT_NAME等名称应使用您的令牌、名称等更改，g++rr.cpp-o rr.out应更改为正确的指令。\ncurl-o/tmp/cov-Analysis-linux64.tgz https://scan.coverity.com/download/linux64--表单项目=$COVERITY_SCAN_PROJECT_NAME--表单TOKEN=$COVERITY_SCAN_TOKENTAR xfz/tmp/cov-analysis-linux64.tgzcov-analysis-linux64-*/bin/cov-build--目录COV-INT g++rr.cpp-o r.outtar CFZ cov-int.tar.gz cov--INTURL https://scan.coverity.com/builds?project=$COVERITY_SCAN_PROJECT_NAME--表单TOKEN=$COVERITY_SCAN_TOKEN。--表单电子邮件=$GitLab_USER_EMAIL--表单文件=@cov-int.tar.gz。\nPVS-Studio是一个商业静态代码分析器，用于检测打字错误、错误和安全漏洞。分析器可以离线检查源代码，即完全与互联网隔离。这对于有特殊安全和代码泄漏保护要求的项目非常有用。\nPVS-Studio可在Windows、Linux、MacOS环境下运行。它支持与Azure DevOps、Travis CI、CircleCI、GitLab CI/CD、PlatformIO、Jenkins、SonarQube、Visual Studio等系统集成。已经为快速引入分析器开发了一个场景，甚至在一个大型的老项目中也是如此，例如，本文描述了这一场景。\n您可以通过以下链接下载分析仪并申请为期一周的试用许可证：https://www.viva64.com/en/pvs-studio-download/。\n虽然分析器定位为B2B解决方案，但许多开发人员可以在开源项目中甚至在封闭源代码项目中免费使用它。\n开源项目。参与GitHub、GitLab或Bitbucket上的项目开发的开发人员可以免费使用PVS-Studio。免费许可不会扩展到镜像项目。可以获得为期1年的免费许可：\n许可证到期后，您可以通过相同方式获取新的许可证密钥。\n针对开放源码项目开发人员的免费PVS-Studio一文中描述了这种类型的免费许可的更多细节。\n封闭源代码和学术项目。对于这类项目，基于将特殊类型的注释附加到分析的源代码上，另一种免费许可的选择是合适的。虽然这样的评论在大型企业项目中可能是不可接受的，但个别开发人员很可能会将它们添加到他们自己的项目中。这种类型的免费许可在文章“如何使用PVS-Studio for Free”中有更详细的描述。\n葡萄酒检查的样本报告，以及错误的解释可以在这里找到-https://www.viva64.com/en/b/0352/。\n安装strace软件包-sudo apt install straceLicense activate-pvs-studio-Analyzer Credentials usermail@gmail.com RRRR-WWWW-RRRR0-TTTD。\n这是一个检查程序在处理器上花费时间的好工具。显示程序在不同线程和可用处理器之间使用的时间。还允许您检查每个函数使用的处理器节拍数。\n动态和开放的代码分析器。它具有搜索内存泄漏、错误读取或应用程序剖析的能力。它在一个线程中运行代码，因此它的性能在较大的项目中不是很令人满意，但在较小的程序中工作得很好。\n==50713==内存错误检测器memcheck==50713==版权所有(C)2002年至2017年，和GNU GPL&#39；d，由Julian Seward等人撰写。=50713=使用Valgrind-3.15.0和LibVEX；使用-h重新运行版权信息==50713==命令：./rr.out==50713=50713=50713==堆摘要：==50713==退出时使用：2,400字节，2个块==50713==总堆使用量：3个分配，1个释放，分配的75,104字节==50713=50713==1块中的800字节在丢失记录中肯定丢失1/2==50713==在0x483C583：运算符NEW[](UNSIGNED LONG)(在/usr/lib/x86_64-linux-gnu/valgrind/vgpreload_memcheck-amd64-linux.so)==50713==中为0x10919E：Main(In/HOME/rafal/rr.out)==50713=50713==1,600字节在丢失记录中确定丢失2/2=50713==在0x483C583：运算符NEW[。memcheck-amd64-linux.so)==50713==BY 0x1091AC：Main(In/HOME/rafal/rr.out)==50713=50713==泄漏摘要：==50713==绝对丢失：2个数据块中的2,400字节==50713==间接丢失：0数据块中的0字节==50713==可能丢失的：0数据块中的0字节==50713=仍可访问：0数据块中的0字节==50713==被禁止的：0数据块中的0字节。使用以下条件重新运行：-s==50713==错误摘要：2个上下文中的2个错误(取消显示：0，来自0)。\n以图形形式显示每个时间单位的分配数量、内存泄漏和内存消耗。在检测内存泄漏方面，它比Valgrind快得多，但我猜没有以文本形式显示它们的选项。\ng++rr.cpp-o rr.outheaptrace./rr.outheaptrace_gui/home/rafal/heaptrack.rr.out.50388.gz#文件名应出现在上一条命令之后。\nGCC和朗都有分析器，可以在运行过程中检查程序是否有故障。与Valgrind不同的是，它们允许程序在多个线程上运行，这使得它们通常运行得更快(甚至是几倍)。在它们的帮助下编译的程序的运行速度甚至要慢几倍，占用的RAM也要多几倍。\n泄漏消毒器-负责检测内存泄漏。它显示分配了多少内存以及在哪里分配了内存。此工具的开销最小。\n从malloc中的#0 0x7fe4aeb98ae8(/lib/x86_64-linux-gnu/libasan.so.5+0x10dae8)分配的51个对象中的3672字节直接泄漏内存中的#1 0xd2d3c25：：alloc_static(unsign long，bool)core/os/memory y.cpp：82#2 0xd2d3b24 in Operator new(unsign long，()FileAccess：：Create(FileAccess：：AccessType)core/os/file_access.cpp：49#5 0xd20d707 in FileAccess：：create_for_path(string const&amp；)core/os/file_access.cpp：83#6 0xd20d9c7 in FileAccess：：create/file_access.h：77#4 0xd20d2d0 in FileAccess：：Create(FileAccess：：AccessType)core/os/file_access.cpp：83#6 0xd20d9c7 in FileAccess：：open(string const&amp；)\n地址消毒器-负责检测值在内存中不正确位置的写入/读出，例如刚刚释放的值。\n在TabContainer：：_gui_input(Ref&lt；InputEvent&gt；常量中的0x61a001447e90线程T0#0 0x9f01bf7处读取大小为8的内容/gui/tab_tainer.cpp：89#1 0x2358959 in MethodBind1&lt；Ref&lt；InputEvent&gt；Const&amp；&gt；：：Call(Object*，Variant Const**，int，Variant：：CallError&amp；)。cpp：7630x61a001447e90位于线程T0释放的1256字节区域[0x61a001447e80，0x61a001448368]内16字节：#0 0x7f5d74ba804f in__interceptor_free(/lib/x86_64-linux-gnu/libasan.so.5+0x10c.。(object*)core/os/memory y.h：118之前由线程T0在此处分配：#0 0x7f5d74ba8448 in malloc(/lib/x86_64-linux-gnu/libasan.so.5+0x10c448)#1 0xeb7a32a in memory：：alloc_static(unsign long，bool)core/os/memory y.cpp：85#2 0xeb7a226 in Operator new(。\n未定义的消毒器-负责检测描述C/C++语言标准的文档中未定义的情况，例如位移位大于变量长度的值(int a=25 552)、除以零或向变量写入超出其范围的值。\nServers/visual_server.cpp：513：17：运行时错误：-2.42852超出了类型为无符号字符的可表示值的范围。摘要：UnfinedBehaviorSaniizer：orrr.cpp：10：5中的未定义行为Servers/visual_server.cpp：513：17：运行时错误：将非零偏移量4应用于空指针。\n内存消毒器-仅在Clang中可用，负责检测未初始化变量的使用(从我的测试来看，它并不总是正常工作)。\n==44112==警告：Memory Saniizer：Main(/HOME/rafal/rr2.out+0x4974b8)#1 0x7f86d21ec0b2 in_libc_start_main/build/glibc-YYA7BZ/glibc-2.31/csu/../csu/libc-start.c:308:16#2 0x41c26d in_start(/HOME/raal/r2.out+0x41c26d)摘要：使用未初始化的值#0x4974b8。\n==44112==警告：Memory Saniizer：Main(/HOME/rafal/rr2.out+0x4974b8)#1 0x7f86d21ec0b2 in_libc_start_main/build/glibc-YYA7BZ/glibc-2.31/csu/../csu/libc-start.c:308:16#2 0x41c26d in_start(/HOME/raal/r2.out+0x41c26d)摘要：使用未初始化的值#0x4974b8。\nClang和GCC从版本10开始也有静态分析器，可以在编译期间检测潜在的错误，这不幸地延长了执行所需的时间。\nrr.cpp：7：10：警告：初始化期间存储到&#39；r&#39；的值从不读取int*r=new int[200]；^~rr.cpp：12：5：警告：赋值为垃圾或未定义的int qq=rr；^~", "note_en": "Permalink     GitHub is home to over 50 million developers working together to host and review code, manage projects, and build software together.\n  Sign up\n       Probably many of you have encountered errors which, although they were easy to fix (e.g. copy-paste bugs), were hidden in the code for months or years before they were fixed. The solution to these problems in many cases are static and dynamic code analyzers and programs to check for memory leaks or CPU time usage by functions that help to better optimize the code and search for bottlenecks.\n All tools I&#39;m going to present are free for open-source projects (with a small exception of PVS-Studio, but about that later), many of which can be easily integrated with CI (in my case Gitlab CI) for autimatical code and regression checking.\n I have integrated many projects with Sonarcloud, Cppcheck and Coverity Scan, whose codes and implementation details can be found here -  https://gitlab.com/dashboard/projects.\n The results of Sonarcloud scans can be found here -  https://sonarcloud.io/organizations/qarmin-1/projects and Cppcheck in pipelins in a given project on Gitlab e.g.  https://qarmin.gitlab.io/-/godot/-/jobs/526221853/artifacts/report/index.html\n  This is probably the most basic and easiest to use error search program in C/C++ source files, which does not require compilation of the checked program to work.\n All we have to do is enter the project directory and run Cppcheck there, or use the graphical version and click it.\n It has many kinds of results presentation, but for me the most convenient method is to export to html (shown in the example at the bottom)\n        Console - execute these commands inside the project folder, and an HTML file with code and errors will be generated inside the  report folder\n   Sonarcloud allows you to view and sort potential errors through the website. It is free to use for open source projects. It finds similar bugs as Cppcheck as opposed to it requires time-consuming compilation.\n       A static analyzer similar in operation to Sonarcloud (you can also view the results online and it is free for open source solutions), but it does not allow to make the results publicly available, so each individual must ask for access to them. According to my experience it finds more real errors than previous tools.\n      Names like - $COVERITY_SCAN_TOKEN, $GITLAB_USER_EMAIL, $COVERITY_SCAN_PROJECT_NAME should be changed with yours tokens, names etc. and also  g++ rr.cpp -o rr.out should be changed to proper comilation instructions\n curl -o /tmp/cov-analysis-linux64.tgz https://scan.coverity.com/download/linux64 --form project=$COVERITY_SCAN_PROJECT_NAME --form token=$COVERITY_SCAN_TOKENtar xfz /tmp/cov-analysis-linux64.tgzcov-analysis-linux64-*/bin/cov-build --dir cov-int g++ rr.cpp -o rr.outtar cfz cov-int.tar.gz cov-intcurl https://scan.coverity.com/builds?project=$COVERITY_SCAN_PROJECT_NAME --form token=$COVERITY_SCAN_TOKEN --form email=$GITLAB_USER_EMAIL --form file=@cov-int.tar.gz\n  PVS-Studio is a commercial static code analyzer for detecting typos, errors, and security weaknesses. The analyzer can check the source code offline, i.e. completely isolated from the internet. This is useful for projects with special security and code leakage protection requirements.\n PVS-Studio runs on Windows, Linux, macOS environments. It supports integration with such systems as Azure DevOps, Travis CI, CircleCI, GitLab CI/CD, PlatformIO, Jenkins, SonarQube, Visual Studio and others. A scenario has been developed for the rapid analyzer introduction even in a large old project, which is described, for example, in this  article.\n You can download the analyzer and request a one-week trial license by following the link:  https://www.viva64.com/en/pvs-studio-download/\n Although the analyzer is positioned as a B2B solution, many developers can use it for free both in open source and even in closed source projects.\n Open source projects. PVS-Studio can be used free of charge by developers involved in the development of projects hosted on GitHub, GitLab, or Bitbucket. A free license doesn&#39;t extend to projects&#39; mirrors. It is possible to get a free license for a period of 1 year:\n Upon expiration of the license, you can get a new license key in the same way.\n Additional details of this type of free licensing are described in the article  &#34;Free PVS-Studio for those who develops open source projects&#34;.\n Closed source and academic projects. For such projects, an alternative option for free licensing is suitable, based on appending comments of a special kind to the analyzed source code. Although such comments may be unacceptable in large enterprise projects, individual developers may well add them to their own projects. This type of free licensing is described in more detail in the article  &#34;How to use PVS-Studio for Free&#34;.\n  Sample Report from the Wine check, together with an explanation of the errors can be found here -  https://www.viva64.com/en/b/0352/\n   Installation of the strace package -  sudo apt install straceLicense activation -  pvs-studio-analyzer credentials usermail@gmail.com RRRR-WWWW-RRRR0-TTTD.\n     A great tool to check the time the program spends on the processor.Displays the time used by the program between different threads and available processors.Also allows you to check the number of processor ticks used by each function.\n        Dynamic and open code analyzer.It has the ability to search for memory leaks, incorrect readings or application profiling.It runs the code in one thread, so its performance is not very satisfactory for larger projects, but it works perfectly in smaller programs.\n  ==50713== Memcheck, a memory error detector==50713== Copyright (C) 2002-2017, and GNU GPL&#39;d, by Julian Seward et al.==50713== Using Valgrind-3.15.0 and LibVEX; rerun with -h for copyright info==50713== Command: ./rr.out==50713== ==50713== ==50713== HEAP SUMMARY:==50713== in use at exit: 2,400 bytes in 2 blocks==50713== total heap usage: 3 allocs, 1 frees, 75,104 bytes allocated==50713== ==50713== 800 bytes in 1 blocks are definitely lost in loss record 1 of 2==50713== at 0x483C583: operator new[](unsigned long) (in /usr/lib/x86_64-linux-gnu/valgrind/vgpreload_memcheck-amd64-linux.so)==50713== by 0x10919E: main (in /home/rafal/rr.out)==50713== ==50713== 1,600 bytes in 1 blocks are definitely lost in loss record 2 of 2==50713== at 0x483C583: operator new[](unsigned long) (in /usr/lib/x86_64-linux-gnu/valgrind/vgpreload_memcheck-amd64-linux.so)==50713== by 0x1091AC: main (in /home/rafal/rr.out)==50713== ==50713== LEAK SUMMARY:==50713== definitely lost: 2,400 bytes in 2 blocks==50713== indirectly lost: 0 bytes in 0 blocks==50713== possibly lost: 0 bytes in 0 blocks==50713== still reachable: 0 bytes in 0 blocks==50713== suppressed: 0 bytes in 0 blocks==50713== ==50713== For lists of detected and suppressed errors, rerun with: -s==50713== ERROR SUMMARY: 2 errors from 2 contexts (suppressed: 0 from 0)\n      Displays in graphic form the number of allocations, memory leaks, memory consumption per time unit. It is much faster than Valgrind in detecting memory leaks, but I guess there is no option to display them in text form.\n      g++ rr.cpp -o rr.outheaptrack ./rr.outheaptrack_gui /home/rafal/heaptrack.rr.out.50388.gz # File name should appear after the previous command\n  Both GCC and Clang contain analyzers that check the program for malfunctions during operation. Unlike Valgrind, they allow the program to run on many threads, which makes them usually faster (even several times).A program compiled with their help works even several times slower and takes up several times more RAM.\n  Leak Sanitizer - responsible for detecting memory leaks. It shows how much and where memory has been allocated. This tool has minimal overhead.\n Direct leak of 3672 byte(s) in 51 object(s) allocated from: #0 0x7fe4aeb98ae8 in malloc (/lib/x86_64-linux-gnu/libasan.so.5+0x10dae8) #1 0xd2d3c25 in Memory::alloc_static(unsigned long, bool) core/os/memory.cpp:82 #2 0xd2d3b24 in operator new(unsigned long, char const*) core/os/memory.cpp:42 #3 0x49c53ae in FileAccess* FileAccess::_create_builtin&lt;FileAccessUnix&gt;() core/os/file_access.h:77 #4 0xd20d2d0 in FileAccess::create(FileAccess::AccessType) core/os/file_access.cpp:49 #5 0xd20d707 in FileAccess::create_for_path(String const&amp;) core/os/file_access.cpp:83 #6 0xd20d9c7 in FileAccess::open(String const&amp;, int, Error*) core/os/file_access.cpp:108 #7 0xd64d3f4 in PCKPacker::pck_start(String const&amp;, int) core/io/pck_packer.cpp:66\n Address Sanitizer - Responsible for detecting writing/reading of values to incorrect places in the memory, e.g. just released.\n READ of size 8 at 0x61a001447e90 thread T0 #0 0x9f01bf7 in TabContainer::_gui_input(Ref&lt;InputEvent&gt; const&amp;) scene/gui/tab_container.cpp:89 #1 0x2358959 in MethodBind1&lt;Ref&lt;InputEvent&gt; const&amp;&gt;::call(Object*, Variant const**, int, Variant::CallError&amp;) core/method_bind.gen.inc:775 #2 0xe5d9137 in Object::call_multilevel(StringName const&amp;, Variant const**, int) core/object.cpp:7630x61a001447e90 is located 16 bytes inside of 1256-byte region [0x61a001447e80,0x61a001448368)freed by thread T0 here: #0 0x7f5d74ba804f in __interceptor_free (/lib/x86_64-linux-gnu/libasan.so.5+0x10c04f) #1 0xeb7b37f in Memory::free_static(void*, bool) core/os/memory.cpp:181 #2 0x158da38 in void memdelete&lt;Object&gt;(Object*) core/os/memory.h:118previously allocated by thread T0 here: #0 0x7f5d74ba8448 in malloc (/lib/x86_64-linux-gnu/libasan.so.5+0x10c448) #1 0xeb7a32a in Memory::alloc_static(unsigned long, bool) core/os/memory.cpp:85 #2 0xeb7a226 in operator new(unsigned long, char const*) core/os/memory.cpp:42 #3 0x92d0b6b in Object* ClassDB::creator&lt;PopupMenu&gt;() (/usr/bin/godots+0x92d0b6b)\n Undefined Sanitizer - Responsible for detecting situations not defined in the documents describing the C/C++ language standard, e.g. a bit shift by a value greater than the length of a variable (int a = 25 552), dividing by zero or writing to a variable a value outside its range\n servers/visual_server.cpp:513:17: runtime error: -2.42852 is outside the range of representable values of type &#39;unsigned char&#39;SUMMARY: UndefinedBehaviorSanitizer: undefined-behavior servers/visual_server.cpp:513:17 in orrr.cpp:10:5: runtime error: applying non-zero offset 4 to null pointer\n Memory Sanitizer - available only in Clang, responsible for detecting the use of non-initialised variables (from my tests it does not always work as it should)\n ==44112==WARNING: MemorySanitizer: use-of-uninitialized-value #0 0x4974b8 in main (/home/rafal/rr2.out+0x4974b8) #1 0x7f86d21ec0b2 in __libc_start_main /build/glibc-YYA7BZ/glibc-2.31/csu/../csu/libc-start.c:308:16 #2 0x41c26d in _start (/home/rafal/rr2.out+0x41c26d)SUMMARY: MemorySanitizer: use-of-uninitialized-value (/home/rafal/rr2.out+0x4974b8) in main\n  ==44112==WARNING: MemorySanitizer: use-of-uninitialized-value #0 0x4974b8 in main (/home/rafal/rr2.out+0x4974b8) #1 0x7f86d21ec0b2 in __libc_start_main /build/glibc-YYA7BZ/glibc-2.31/csu/../csu/libc-start.c:308:16 #2 0x41c26d in _start (/home/rafal/rr2.out+0x41c26d)SUMMARY: MemorySanitizer: use-of-uninitialized-value (/home/rafal/rr2.out+0x4974b8) in main\n                Clang and GCC from version 10 onwards also have static analyzers that can detect potential errors during compilation, which unfortunately extends the time needed for its execution.\n  rr.cpp:7:10: warning: Value stored to &#39;r&#39; during its initialization is never read int* r = new int[200]; ^ ~~~~~~~~~~~~rr.cpp:12:5: warning: Assigned value is garbage or undefined int qq = rr; ^~~~~~ ~~", "posttime": "2020-05-11 03:20:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c++,代码,修复,checking,项目", "title": "检查和修复C/C++代码(以及其他语言)的有用工具", "title_en": "Useful tools for checking and fixing C/C++ code (and others languages too)", "transed": 1, "url": "https://github.com/qarmin/Instrukcje-i-Tutoriale/blob/master/AnalizatoryCC%2B%2BENG.md", "via": "", "real_tags": ["c++", "代码", "修复", "checking", "项目"]}, {"category": "", "categoryclass": "", "imagename": "24e61a8175af932d24d6bfab5f86fc71.png", "infoid": 1001563, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几周前，美国电信业开始通过其惯常的盟友推动一种胡说八道的说法。简而言之，这一说法围绕的论点是，美国互联网在大流行期间仍然有效的唯一原因是特朗普FCC无视公众，无视最客观的专家，并在电信业游说者的要求下摧毁了自己。这一争论首先出现在AEI，然后是特朗普的FCC，然后是华尔街日报的页面，此后在全国范围内的许多专栏文章中都可以看到。我打赌这不是巧合，我还打赌我们会看到更多这样的照片。\n所有这些文章都试图辩称，美国互联网在大流行期间能够正常运作的唯一原因是，作为恢复互联网自由的一部分，FCC摧毁了其在电信领域的权威，废除了网络中立。故事说，这一废除推动了对美国宽带网络的大量投资(根本不是真的)，导致了电信乌托邦(也不是真的)。该论点还认为，在欧洲，监管者通常在监管行业整合和电信垄断等方面扮演着更积极的角色，互联网几乎分崩离析(你猜怎么着：事实并非如此)。\n通常，就像这篇专栏文章一样，很多人坚称，美国的宽带行业在很大程度上是美好的，而欧盟已经下了地狱：\n与这里不同的是，欧洲的电视网受到更严格的监管。多年来，这导致消费者的投资减少，表现更差。美国消费者总体上受到私营部门的良好服务。\n任何花了五分钟与康卡斯特客户支持交谈的人，或者试图让像Frontier Communications这样丑闻缠身的ISP升级劣质DSL线路的人，都知道这是胡说八道。尽管如此，我们还是写了一篇长长的帖子，探究这一论点到底有多狗屎，以及这些说法是如何完全没有证据支持的。整个纸牌屋都是建立在无稽之谈之上的，利用一场灾难来帮助证明监管捕获和市场失灵是正当的，这在伦理上是荒谬的。\n尽管美国互联网在大流行期间总体上表现相对较好是事实，但对于所谓的“最后一英里”(即从你的ISP网络到你家的链接)就不能这么说了。是的，核心互联网和大多数主要的交通路线，旨在处理超级碗等活动期间的巨大运力峰值，已经相对较好地处理了负载。正如萨沙·迈因拉特(Sascha Meinrath)在这里正确指出的那样，问题在于消费者和商业领域的速度缓慢，对许多人来说，这些行业已经多年没有升级过了：\n现在，一个由网络科学家组成的国际联盟每天从互联网服务提供商(ISP)的客户那里收集75万个美国宽带速度测试，我们一直在跟踪人们家庭连接速度的惊人损失。根据大多数ISP的说法，核心网络正在处理额外的负载。但我们的数据显示，最后一英里的网络基础设施似乎正在倒塌。\n再说一次，你的5 Mbps DSL线路在正常情况下可能还可以，但在大流行期间，当你的整个家庭都在播放4K视频、玩游戏和缩放时，它就不会很好地为你服务了。而且你的DSL线路没有升级，因为(1)几乎没有竞争迫使你的ISP这么做，(2)美国政府充斥着马屁精，他们把竞选捐款和ISP收入置于市场健康和消费者福利之上。虽然有一群与行业有关联的人非常努力地假装不是这样，但这是一种政策失败，与盲目放松监管、缺乏竞争，以及更重要的是腐败直接相关。简而言之，这与该行业的最新论调截然相反。\n多年来，我们一直注意到美国电信公司拒绝维修或升级老化的DSL线路，因为这条线路利润不够高，速度不足以让华尔街满意。在没有竞争和监管的情况下，美国宽带巨头没有任何动力去努力尝试。同样，因为我们的立法者和监管者在很大程度上是被俘虏的旋转门式的，他们橡皮图章地批准糟糕的合并，对非常明显的行业问题视而不见，例行公事地将数十亿纳税人的钱投入垄断企业，以换取通常只有部分部署的光纤网络--如果它们真的重新部署的话。\n与此同时，几乎放弃升级老化的DSL线路的美国电信公司，帮助康卡斯特在美国大片地区巩固了更大的垄断地位。这是一个电信业、特朗普联邦通信委员会和各种行业辩护者都会忽视的问题，几乎可以说是滑稽可笑的效果。同样被忽视的事实是，这导致美国宽带用户为宽带支付的价格在发达国家中名列前茅：\n许多研究，包括FCC自己进行的研究表明，宽带价格是宽带采用的第二大障碍(可用性是第一)。很明显，如果人们对一项服务收费很高，他们购买它的可能性就会降低。独立研究人员已经证明，贫困地区通常比富裕社区支付更高的连接费用。少数民族和农村地区的红线现象似乎很普遍，我们需要来自联邦通信委员会的准确定价数据，才能有意义地解决这些差异。\n试着找出阿吉特·派(Ajit Pai)，或这群电信垄断辩护者中的任何人，是否真的承认美国宽带市场竞争不激烈，因此对企业和消费者来说都非常昂贵。你根本找不到它。你会发现很多借口和稻草人的论点，比如最近的一个，旨在分散媒体、公众和政策制定者对非常明显的市场失灵的注意力。市场失灵在正常时期是一个主要问题，在宽带是必不可少的生命线的大流行期间更是如此。", "note_en": "A few weeks ago, the US telecom industry began pushing a  bullshit narrative through its usual allies. In short, the claim revolves around the argument that the only reason the US internet still works during a pandemic was because the Trump FCC ignored the public, ignored most objective experts, and  gutted itself at the behest of telecom industry lobbyists. The argument first popped up  over at AEI, then  the Trump FCC, then the  pages of the Wall Street Journal, and has since been seen in  numerous op-eds nationwide. I&#39;d wager that&#39;s not a coincidence, and I&#39;d also wager we&#39;ll be seeing a lot more of them.\n All of the pieces try to argue that the only reason the US internet works during a pandemic is because the FCC  gutted its authority over telecom as part of its &#34;restoring internet freedom&#34; net neutrality repeal. This repeal, the story goes, drove significant investment in US broadband networks ( not remotely true), resulting in telecom Utopia (also  not true). The argument also posits that in Europe, where regulators have generally taken a more active role in policing things like industry consolidation and telecom monopolies, the internet all but fell apart (guess what:  not true).\n Usually, like in  this op-ed, there&#39;s ample insistence that the US broadband sector is largely wonderful while the EU has gone to hell:\n &#34;Unlike here, European networks are more heavily regulated. This has led to less investment and worse performance for consumers for years. American consumers are being generally well served by the private sector.&#34;\n Anybody who has spent five minutes talking to Comcast customer support -- or tried to get scandal-plagued ISP like Frontier Communications to upgrade  rotten DSL lines -- knows this is bullshit. Still, we penned a  lengthy post exploring just how full of shit this argument is, and how there&#39;s absolutely  zero supporting evidence for the claims. The entire house of cards is built on fluff and nonsense, and it&#39;s just ethically grotesque to use a disaster to help justify regulatory capture and market failure.\n While it&#39;s true that the US internet,  in general, has held up relatively well during a pandemic, the same can&#39;t be said of the so called &#34;last mile,&#34; or the link from your ISP&#39;s network to your home. Yes, the core internet and most primary transit routes, designed to handle massive capacity spikes during events like the Superbowl, has handled the load relatively well. The problem, as Sascha Meinrath  correctly notes here, is sluggish speeds on consumer and business lines that, for many, haven&#39;t been upgraded in years:\n &#34;Right now, an international consortium of network scientists is collecting 750,000 U.S. broadband speed tests from internet service provider (ISP) customers each day, and we’ve been tracking a stunning loss of connectivity speeds to people’s homes. According to most ISPs, the core network is handling the extra load. But our data show that the last-mile network infrastructure appears to be falling down on the job.&#34;\n Again, your 5 Mbps DSL line might be ok during normal times, but it&#39;s not going to serve you well during a pandemic when your entire family is streaming 4K videos, gaming, and Zooming. And your DSL line isn&#39;t upgraded because there&#39;s (1) very little competition forcing your ISP to do so, and (2) the US government is filled to the brim with sycophants who prioritize campaign contributions and ISP revenues over the health of the market and consumer welfare. And while there&#39;s a contingency of industry-linked folks who try very hard to pretend otherwise, this is a policy failure that&#39;s directly tied to mindless deregulation, a lack of competition, and, more importantly, corruption. In short, the complete opposite of the industry&#39;s latest talking point.\n For years we&#39;ve been noting how US telcos have refused to  repair or upgrade aging DSL lines because it&#39;s not profitable enough, quickly enough for Wall Street&#39;s liking. Facing no competition and no regulatory oversight, there&#39;s zero incentive for a giant US broadband provider to try very hard. Similarly, because our lawmakers and regulators are largely of the captured, revolving door variety, they rubber stamp  shitty mergers, turn a blind eye to  very obvious industry problems, routinely throwing billions in taxpayer money at monopolies in exchange for fiber networks that are usually only  partially deployed -- if they&#39;re  deployed at all.\n Meanwhile, US telcos that have all but given up on upgrading aging DSL lines have helped cement an even  bigger Comcast monopoly across vast swaths of America. It&#39;s a problem that the telecom sector, Trump FCC, and various industry apologists will ignore to almost comical effect. Also ignored is the fact that this results in US broadband subscribers paying some of the highest prices for broadband in the developed world:\n &#34;Numerous studies, including those conducted by the FCC itself, show that broadband pricing is the second-largest barrier to broadband adoption (availability is the first). It’s obvious that if people are being charged a lot for a service, they’re less likely to purchase it. And independent researchers have already documented that poor areas often pay more than rich communities for connectivity. Redlining of minority and rural areas appears to be widespread, and we need accurate pricing data from the FCC to meaningfully address these disparities.&#34;\n Try to find any instance where Ajit Pai, or anybody in this chorus of telecom monopoly apologists, actually admits that the US broadband market isn&#39;t competitive and, as a result, is hugely expensive for businesses and consumers alike. You simply won&#39;t find it. What you will find are a lot of excuses and straw men arguments like this latest one, designed to distract the press, public, and policymakers from very obvious market failure. Market failure that was a major problem in normal times, and exponentially more so during a pandemic where broadband is an essential lifeline.", "posttime": "2020-05-11 03:20:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,病毒,市场,failure,美国", "title": "冠状病毒暴露出一种有害的宽带市场失灵否认主义", "title_en": "Covid-19 Is Exposing a Virulent Strain of Broadband Market Failure Denialism", "transed": 1, "url": "https://www.techdirt.com/articles/20200506/10391544448/covid-19-is-exposing-virulent-strain-broadband-market-failure-denialism.shtml", "via": "", "real_tags": ["冠状病毒", "病毒", "市场", "failure", "美国"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001562, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "考虑一下在iOS应用商店中找到您的应用的人。他们决定想要你的应用程序：点击“获取”或“购买”按钮。\n应用程序下载-希望是快速的；希望你已经把它缩小了，因为你已经描绘了这个时刻，你甚至关心用户体验的这一方面-然后用户点击打开按钮。\n他们已经等着看这款应用了。他们很兴奋地想看看它是什么样子，并开始使用它！\n而且，现在它在这里，你可以在他们的道路上设置一系列障碍-这会导致你失去一些人-或者你可以通过让他们进入应用程序来立即满足他们的兴趣和好奇心。\n我是这样的：当我下载一个带有第一次运行教程的应用程序时，我会试图找到一种方法来缩短它的路径，然后进入实际的应用程序。如果我做不到，我就会飞快地看一遍，因为我知道无论如何我都不会记得任何事情。\n同样，如果应用程序需要进行第一次运行设置，我会尽量避免。如果它有第一次运行的设置和教程，除非我绝对确定我想要这个应用程序，否则我会放弃。\n在App Store推出之初，有没有一些关于应用程序的引用，甚至可能是史蒂夫·乔布斯(Steve Jobs)的话，是这样的呢？“iPhone应用程序应该非常容易使用，不需要帮助。”\n从那以后，我一直在想，如果我看了第一期教程，他们就搞砸了。应用程序的设计应该让你能够快速了解基本情况，然后通过逐步披露，找到更高级的功能。\n在我看来，最好的第一次运行体验是让人们尽快进入应用程序，因为那是他们想要的地方。\n他们已经等待了足够长的时间-找到应用程序，下载它-现在你想把快乐推迟得更久，从而玷污甚至冒险吗？别这么做！\n记住，人们很忙，经常心不在焉，还有无数的其他应用程序。你的应用程序不是全世界的。这个人就是整个世界。\n请记住，应用程序中的每一件事都会发送一条消息。第一次运行的教程会传递这样的信息，即您的应用程序有一个陡峭的学习曲线。这绝对是一件令人反感的事。\n它立即在用户中引发了焦虑，有两个相关的方面：1)“我能学会这个显然很难使用的应用程序吗？”和2)“我还会记得这篇教程中的任何一篇吗？我需要拿出纸笔做笔记吗？“", "note_en": "Consider the person who finds your app on the iOS App Store. They decide they want your app: they tap the get or purchase button.\n The app downloads — hopefully quickly; hopefully you‘ve made it small, because you’ve pictured this moment and you care about even this aspect of the user experience — and then the user taps the Open button.\n They’ve already waited to see the app. They’re excited to see what it’s like and get started using it!\n And, now that it’s here, you can put a bunch of obstacles in their way — which will cause you to lose some of these people — or you can satisfy their interest and curiosity right away by getting them into the app.\n  Here’s me: when I download an app with a first-run tutorial, I try to find a way to short-circuit it and get to the actual app. If I can’t, I just race through it, knowing I wouldn’t have remembered any of it anyway.\n  Similarly, if an app has first-run setup to do, I try to avoid it. If it has first-run setup  and a tutorial, I’ll just give up unless I know for absolute sure that I want this app.\n  Isn’t there some quote, maybe even from Steve Jobs, about apps early in the day of the App Store, that went something like this? “iPhone apps should be so easy to use that they don’t need Help.”\n I’ve always thought to myself, since then, that if I see a first-run tutorial, they blew it. Apps should be designed so that you can figure out the basics quickly, and then find, through progressive disclosure, more advanced features.\n It seems to me that the best first-run experience is to get people into the app as quickly as possible, because that’s where they want to be.\n They’ve already waited long enough — finding the app, downloading it — and now you want to delay the joy even longer, and thereby tarnish or even risk it? Don’t do it!\n Remember that people are busy, often distracted, and there are zillions of other apps. Your app is not the world. The person is the world.\n   Remember that every single thing in your app sends a message. A first-run tutorial sends the message that your app has a steep learning curve. Definitely a turn-off.\n It provokes anxiety in the user immediately, in two related ways: 1) “Will I ever be able to learn this apparently hard-to-use app?” and 2) “Will I remember any of this tutorial at all? Do I need to get out pen and paper and take notes?”", "posttime": "2020-05-11 03:06:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,iphone,应用程序", "title": "理想的iPhone App首次运行体验根本不是", "title_en": "The Ideal iPhone App First-Run Experience Is None at All", "transed": 1, "url": "https://inessential.com/2020/05/09/the_ideal_iphone_app_first_run_experienc", "via": "", "real_tags": ["app", "iphone", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "e9d7b2191c2c05e40ec310512d77a634.jpg", "infoid": 1001561, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Clearview AI是一家面部识别软件公司，帮助执法部门追踪疑似罪犯。现在，这家科技公司正在与联邦和州当局谈判，以帮助追踪冠状病毒的传播。NBC新闻的雅各布·沃德报道了这项有争议的技术。2020年4月28日", "note_en": "Clearview AI is a facial recognition software company that helps law enforcement track down suspected criminals. Now the tech company is in talks with federal and state authorities to help trace the spread of the coronavirus. NBC News’ Jacob Ward reports on the controversial technology. April 28, 2020", "posttime": "2020-05-11 03:04:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,病毒,跟踪,pitches", "title": "ClearviewAI推出面部识别跟踪冠状病毒患者", "title_en": "ClearviewAI pitches facial recognition to track Covid-19 patients", "transed": 1, "url": "https://www.nbcnews.com/now/video/controversial-tech-company-pitches-facial-recognition-to-track-covid-19-82638917537", "via": "", "real_tags": ["冠状病毒", "病毒", "跟踪", "pitches"]}, {"category": "", "categoryclass": "", "imagename": "a5b573fafea45340726cf4ff53cee9d3.jpeg", "infoid": 1001560, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "理解继政府债券之后的投资，公司债券市场是全球债券宇宙中最大的部分。由于有大量的到期日、收益率和信用质量可用，投资公司债券有可能为投资者提供比政府债券更高的收益率和多样化的好处。\n当公司想要扩大业务或为新的商业冒险提供资金时，他们通常会转向公司债券市场借钱。一家公司确定它想借多少钱，然后发行这个数额的债券；购买债券的投资者实际上是根据债券发行或招股说明书中确立的条款借钱给公司。\n与股票不同，公司债券的所有权并不意味着对发行债券的公司拥有所有权权益。取而代之的是，公司在一段时间内向投资者支付利息，并在债券发行时确定的到期日偿还本金。\n虽然一些公司债券具有可能影响到期日的赎回或赎回功能，但大多数债券大致分为以下期限范围：\n除了到期日，公司债券还根据信用质量进行分类。穆迪投资者服务公司(Moody‘s Investors Service)和标准普尔(Standard&amp；Poor’s)等信用评级机构对公司债券发行人进行独立分析，根据每个发行人的信誉对其进行评级。信用评级较低的公司债券发行人倾向于为其公司债券支付更高的利率。\n公司债券分为两大类：投资级和投机级(或高收益)债券。投机级债券是由信用质量被认为比评级较高的投资级公司低的公司发行的。投资级类别有四个评级等级，而投机级类别由六个评级等级组成。\n从历史上看，投机级债券是由较新的公司发行的，这些公司位于竞争特别激烈或波动特别大的行业，或者基本面令人不安。今天，也有许多公司的业务被设计成以传统上与投机级公司相关的杠杆程度运营。虽然投机级信用评级表明违约概率更高，但这些债券通常通过支付更高的利率或收益率来补偿投资者的更高风险。如果发行人的信用质量恶化，可以下调信用评级；如果基本面好转，可以上调信用评级。\n“堕落天使”是一个术语，描述的是一家投资级公司陷入困境，随后其债务评级被下调至投机级。“冉冉升起的新星”是指因发行人信用质量改善而被信用评级机构上调债券评级的公司.。由于信用评级机构的评级是主观的，所以有时他们也不同意评级-这种情况被称为“分裂评级”。堕落天使、冉冉升起的新星和分裂的评级都可能为投资者提供机会，因为他们的评级可能会波动，从而承担更大的风险，从而增加额外的收益。\n公司债券的价格受多个因素影响，包括债券的到期日、发行公司的信贷评级和一般利率水平。公司债券的收益率会随利率变动而波动，以反映债券价格因利率变动而出现的变化，以及市场对发行人信用质量的看法。大多数公司债券的信用风险和收益率通常比类似期限的政府债券高。这种分歧造成了公司和政府债券之间的信用利差，因此公司债券投资者通过承担更大的风险来赚取额外的收益。信用利差影响债券的价格，可以用图形绘制和衡量，即公司债券和政府债券在每个到期点的收益率之差。\n多元化：公司提供投资于各种经济部门的机会。在广泛的企业范围内，风险和收益存在着很大的差异。公司债券可以增加股票投资组合的多样化，也可以使政府债券或其他固定收益证券的固定收益投资组合多样化。\n收入：公司有潜力提供诱人的收入。大多数公司债券每半年支付一次。一个例外是零息债券，这种债券不支付利息，但以很大的折扣出售，然后在到期时以全额面值赎回。另一个例外是浮动利率债券，这些债券的利率波动与货币市场参考利率挂钩，如伦敦银行间同业拆借利率(LIBOR)或联邦基金利率。这些证券的收益率往往低于可比期限的固定利率证券，但本金波动也较小。\n流动性：公司债券可以在到期前的任何时间在一个庞大而活跃的二级交易市场上出售。\n与公债类似，公司债也面临利率风险。此外，公司债券还存在信用或违约风险-借款人无法偿还贷款并违约的风险。违约风险水平根据发行人的基础信用质量而有所不同。\n特定证券或证券组的信用质量不能保证整个投资组合的稳定性或安全性。提供个别发行/发行人的质量评级是为了表明此类发行/发行人的信用评级，一般范围分别为AAA、AAA或AAA(最高)至D、C或D(最低)，标准普尔、穆迪和惠誉的评级范围分别为：A AA、AAA或AAA(最高)至D、C或D(最低)。\n关于风险：投资债券市场是有风险的，包括市场风险、利率风险、发行人风险、信用风险、通胀风险和流动性风险。大多数债券和债券策略的价值都受到利率变化的影响。与存续期较短的债券和债券策略相比，存续期较长的债券和债券策略往往更为敏感和波动；债券价格一般会随着利率上升而下跌，目前的低利率环境增加了这种风险。目前债券交易对手能力的减少可能会导致市场流动性下降和价格波动增加。债券投资在赎回时的价值可能高于或低于原始成本。公司债务证券面临发行人无法支付债务本金和利息的风险，也可能由于利率敏感性、市场对发行人资信的看法和一般市场流动性等因素而受到价格波动的影响。某些美国政府证券得到了政府完全信任的支持。美国政府机构和当局的义务得到了不同程度的支持，但通常没有得到美国政府完全信任的支持。投资于这类证券的投资组合不受担保，价值将会波动。浮动利率贷款不在交易所交易，受到重大信贷、估值和流动性风险的影响。由于实际和感知的一般市场、经济和行业状况，股票的价值可能会下降。分散投资并不能保证不受损失。\n不能保证这些投资策略在所有市场条件下都会奏效，或者适用于所有投资者，每个投资者都应该评估自己的长期投资能力，特别是在市场低迷时期。\n本材料仅供参考，不应被视为对任何特定证券、策略或投资产品的投资建议或推荐。投资者在作出投资决定前，应咨询他们的投资专业人士。本文中包含的信息是从被认为可靠但不能保证的来源获得的。\nPIMCO只向合格机构和投资者提供服务。这不是向非法或未经授权的任何司法管辖区的任何人提供的。|太平洋投资管理公司地址：加利福尼亚州纽波特海滩650Newport Center Drive650号，邮编：92660，受美国证券交易委员会监管。|PIMCO Investments LLC，美国分销商，地址：1633Broadway，New York，NY，10019是太平洋投资管理公司的一家公司。|太平洋投资管理公司欧洲有限公司(公司编号2604517)、太平洋投资管理公司欧洲有限公司阿姆斯特丹分公司(公司编号24319743)和太平洋投资管理欧洲有限公司意大利分公司(公司编号07533910969)由英国金融市场行为监管局(25 The North Colonnade，Canary Wharf，London E14 5HS)授权和监管。根据意大利综合金融法第27条，阿姆斯特丹和意大利分行分别受澳大利亚金融管理局和意大利金融服务委员会的额外监管。PIMCO欧洲有限公司的服务和产品仅向金融市场行为监管局手册中定义的专业客户提供，不向个人投资者提供，他们不应依赖这种沟通。|PIMCO Deutschland GmbH(公司编号：192083，Seidlstr.。24-24A，80335慕尼黑，德国)由德国联邦金融监管局(居里夫人)授权和监管。24-28日，60439法兰克福(美因河畔法兰克福)根据德国银行法第32条的规定。PIMCO Deutschland GmbH提供的服务和产品仅提供给第31a节定义的专业客户。2德国证券交易法(WpHG)。个人投资者不能使用它们，他们不应该依赖这种沟通。|PIMCO(Schweiz)GmbH(注册于瑞士，公司编号。瑞士苏黎世Brandschenkestrasse 41,8002，电话：+41 44 512 49 10。PIMCO Swiss GmbH提供的服务和产品不向个人投资者提供，他们不应依赖此通信，而应联系他们的财务顾问。|PIMCO Asia Pte Ltd(501Orchard Road#09-03，Singapore 238880，Wheelock Place，Singapore 238880，注册号199804652K)受新加坡金融管理局监管，是资本市场服务牌照的持有者和豁免的财务顾问。未经授权提供资产管理服务及投资产品的人士不得使用该等服务及投资产品。|PIMCO Asia Limited(香港中环金融街8号国际金融中心二期22楼2201室)获证券及期货事务监察委员会发牌，从事证券及期货条例下的第1、4及9类受规管活动。未经授权提供资产管理服务及投资产品的人士不得使用该等服务及投资产品。|PIMCO Australia Pty Ltd ABN 54084280508，AFSL 246862(PIMCO Australia)按照2001年公司法的规定向批发和零售客户提供产品和服务(仅限于零售客户的一般金融产品建议)。此信息仅供一般信息使用，不考虑任何特定投资者的目标、财务状况或需求。|PIMCO日本有限公司(日本东京市南区Toronomon Towers Office 18F，4-1-28，Toronomon，Minato-ku，105-0001)金融工具商业注册号为关东地方财政局(金融工具行)第382号。太平洋投资管理公司日本有限公司是日本投资顾问协会和日本投资信托协会的成员。PIMCO日本有限公司提供的投资管理产品和服务仅向其各自管辖范围内的人员提供，在未经授权的情况下不向提供此类产品或服务的人员提供。资产估值将根据证券价格和投资组合中衍生品交易的价值、市场状况、利率和信用风险等因素而波动。外币计价资产的投资将受到汇率的影响。不能保证投资的本金会被保留，也不能保证会实现一定的回报；投资可能会蒙受损失。所有的利润和损失都由投资者承担。每种费用和费用及其总额的数额、最高限额和计算方法将根据投资策略、投资业绩状况、管理期限和未偿还资产余额而有所不同，因此这些费用和费用", "note_en": "Understanding Investing    After government bonds, the corporate bond market is the largest section of the global bond universe. With a vast array of maturities, yields and credit quality available, investing in corporate bonds has the potential to provide higher yields than government bonds and diversification benefits for investors.\n  When companies want to expand operations or fund new business ventures, they often turn to the corporate bond market to borrow money. A company determines how much it would like to borrow and then issues a bond offering in that amount; investors that buy a bond are effectively lending money to the company according to the terms established in the bond offering or prospectus.\n Unlike equities, ownership of corporate bonds does not signify an ownership interest in the company that has issued the bond. Instead, the company pays the investor a rate of interest over a period of time and repays the principal at the maturity date established at the time of the bond’s issue.\n While some corporate bonds have redemption or call features that can affect the maturity date, most are loosely categorized into the following maturity ranges:\n  In addition to maturity, corporate bonds are also categorized by credit quality. Credit rating agencies such as Moody’s Investors Service and Standard &amp; Poor’s provide independent analysis of corporate bond issuers, grading each issuer according to its creditworthiness. Corporate bond issuers with lower credit ratings tend to pay higher interest rates on their corporate bonds.\n   Corporate bonds fall into two broad credit classifications: investment-grade and speculative-grade (or high yield) bonds. Speculative-grade bonds are issued by companies perceived to have a lower level of credit quality compared to more highly rated, investment-grade, companies. The investment-grade category has four rating grades while the speculative-grade category is comprised of six rating grades.\n  Historically, speculative-grade bonds were issued by companies that were newer, were in a particularly competitive or volatile sector or had troubling fundamentals. Today, there are also many companies whose businesses are designed to operate with the degree of leverage traditionally associated with speculative-grade companies. While a speculative-grade credit rating indicates a higher default probability, these bonds typically compensate investors for the higher risk by paying higher interest rates, or yields. Credit ratings can be downgraded if the credit quality of the issuer deteriorates or upgraded if fundamentals improve.\n  “Fallen angel” is a term that describes an investment-grade company that has fallen on hard times and has subsequently had its debt downgraded to speculative grade. “Rising star” refers to a company whose bond rating has been increased by a credit rating agency due to an improvement in the credit quality of the issuer. Since the credit rating agencies’ ratings are subjective, there are also times when they do not concur on the rating – an occurrence known as a “split rating.” Fallen angels, rising stars and split ratings may all present opportunities for investors to add additional yield by assuming greater risk due to the potential volatility of their ratings.\n  The price of a corporate bond is influenced by several factors, including the maturity, the credit rating of the company issuing the bond and the general level of interest rates.The yield of a corporate bond fluctuates to reflect changes in the price of the bond caused by shifts in interest rates and the markets’ perception of the issuer’s credit quality.Most corporates typically have more credit risk and higher yields than government bonds of similar maturities. This divergence creates a credit spread between corporates andgovernment bonds, so that the corporate bond investor earns extra yield by taking on greater risk. The credit spread affects the price of the bond and can be graphically plotted and measured as the difference between the yield of a corporate and government bond at each point of maturity.\n    Diversification: Corporates offer the opportunity to invest in a variety of economic sectors. Within the broad spectrum of corporates there is a wide divergence of risk and yield. Corporate bonds can add diversification to an equity portfolio as well as diversify a fixed income portfolio of government bonds or other fixed income securities.\n  Income: Corporates have the potential to provide attractive income. Most corporate bonds pay on a fixed semiannual schedule. One exception is zero-coupon bonds, which do not pay interest but are sold at a deep discount and then redeemed for full face value at maturity. Another exception is floating-rate bonds that have fluctuating interest rates tied to a money market reference rate such as the London Interbank Offered Rate (LIBOR) or federal funds rate. These tend to have lower yields than fixed-rate securities of comparable maturities but also less fluctuation in principal value.\n    Liquidity: Corporate bonds can be sold at any time prior to maturity in a large and active secondary trading market.\n  Similar to government bonds, corporate bonds are exposed to interest rate risk. In addition, corporate bonds also have credit or default risk - the risk that the borrower fails torepay the loan and defaults on its obligation. The level of default risk varies based on the underlying credit quality of the issuer.\n  The credit quality of a particular security or group of securities does not ensure the stability or safety of an overall portfolio. The quality ratings of individual issues/issuers are provided to indicate the credit-worthiness of such issues/issuer and generally range from AAA, Aaa, or AAA (highest) to D, C, or D (lowest) for S&amp;P, Moody’s, and Fitch respectively.\n A word about risk: Investing in the  bond market is subject to risks, including market, interest rate, issuer, credit, inflation risk, and liquidity risk. The value of most bonds and bond strategies are impacted by changes in interest rates. Bonds and bond strategies with longer durations tend to be more sensitive and volatile than those with shorter durations; bond prices generally fall as interest rates rise, and the current low interest rate environment increases this risk. Current reductions in bond counterparty capacity may contribute to decreased market liquidity and increased price volatility. Bond investments may be worth more or less than the original cost when redeemed.  Corporate debt securities are subject to the risk of the issuer’s inability to meet principal and interest payments on the obligation and may also be subject to price volatility due to factors such as interest rate sensitivity, market perception of the creditworthiness of the issuer and general market liquidity. Certain  U.S. government securities are backed by the full faith of the government. Obligations of U.S. government agencies and authorities are supported by varying degrees but are generally not backed by the full faith of the U.S. government. Portfolios that invest in such securities are not guaranteed and will fluctuate in value.  Floating rate loans are not traded on an exchange and are subject to significant credit, valuation and liquidity risk.  Equities may decline in value due to both real and perceived general market, economic and industry conditions.  Diversification does not ensure against loss.\n There is no guarantee that these investment strategies will work under all market conditions or are suitable for all investors and each investor should evaluate their ability to invest long-term, especially during periods of downturn in the market.\n  This material has been distributed for informational purposes only and should not be considered as investment advice or a recommendation of any particular security, strategy or investment product. Investors should consult their investment professional prior to making an investment decision. Information contained herein has been obtained from sources believed to be reliable, but not guaranteed.\n PIMCO provides services only to qualified institutions and investors. This is not an offer to any person in any jurisdiction where unlawful or unauthorized. |  Pacific Investment Management Company LLC, 650 Newport Center Drive, Newport Beach, CA 92660 is regulated by the United States Securities and Exchange Commission. |  PIMCO Investments LLC, U.S. distributor, 1633 Broadway, New York, NY, 10019 is a company of PIMCO. |  PIMCO Europe Ltd (Company No. 2604517), PIMCO Europe, Ltd Amsterdam Branch (Company No. 24319743), and PIMCO Europe Ltd - Italy (Company No. 07533910969) are authorised and regulated by the Financial Conduct Authority (25 The North Colonnade, Canary Wharf, London E14 5HS) in the U.K. The Amsterdam and Italy branches are additionally regulated by the AFM and CONSOB in accordance with Article 27 of the Italian Consolidated Financial Act, respectively. PIMCO Europe Ltd services and products are available only to professional clients as defined in the Financial Conduct Authority’s Handbook and are not available to individual investors, who should not rely on this communication. |  PIMCO Deutschland GmbH (Company No. 192083, Seidlstr. 24-24a, 80335 Munich, Germany) is authorised and regulated by the German Federal Financial Supervisory Authority (BaFin) (Marie-Curie-Str. 24-28, 60439 Frankfurt am Main) in Germany in accordance with Section 32 of the German Banking Act (KWG). The services and products provided by PIMCO Deutschland GmbH are available only to professional clients as defined in Section 31a para. 2 German Securities Trading Act (WpHG). They are not available to individual investors, who should not rely on this communication. |  PIMCO (Schweiz) GmbH (registered in Switzerland, Company No. CH-020.4.038.582-2), Brandschenkestrasse 41, 8002 Zurich, Switzerland, Tel: + 41 44 512 49 10. The services and products provided by PIMCO Switzerland GmbH are not available to individual investors, who should not rely on this communication but contact their financial adviser. |  PIMCO Asia Pte Ltd (501 Orchard Road #09-03, Wheelock Place, Singapore 238880, Registration No. 199804652K) is regulated by the Monetary Authority of Singapore as a holder of a capital markets services licence and an exempt financial adviser. The asset management services and investment products are not available to persons where provision of such services and products is unauthorised. |  PIMCO Asia Limited (Suite 2201, 22nd Floor, Two International Finance Centre, No. 8 Finance Street, Central, Hong Kong) is licensed by the Securities and Futures Commission for Types 1, 4 and 9 regulated activities under the Securities and Futures Ordinance. The asset management services and investment products are not available to persons where provision of such services and products is unauthorised. |  PIMCO Australia Pty Ltd ABN 54 084 280 508, AFSL 246862 (PIMCO Australia) offers products and services to both wholesale and retail clients as defined in the Corporations Act 2001 (limited to general financial product advice in the case of retail clients). This communication is provided for general information only without taking into account the objectives, financial situation or needs of any particular investors. |  PIMCO Japan Ltd (Toranomon Towers Office 18F, 4-1-28, Toranomon, Minato-ku, Tokyo, Japan 105-0001) Financial Instruments Business Registration Number is Director of Kanto Local Finance Bureau (Financial Instruments Firm) No. 382. PIMCO Japan Ltd is a member of Japan Investment Advisers Association and The Investment Trusts Association, Japan. Investment management products and services offered by PIMCO Japan Ltd are offered only to persons within its respective jurisdiction, and are not available to persons where provision of such products or services is unauthorized. Valuations of assets will fluctuate based upon prices of securities and values of derivative transactions in the portfolio, market conditions, interest rates and credit risk, among others. Investments in foreign currency denominated assets will be affected by foreign exchange rates. There is no guarantee that the principal amount of the investment will be preserved, or that a certain return will be realized; the investment could suffer a loss. All profits and losses incur to the investor. The amounts, maximum amounts and calculation methodologies of each type of fee and expense and their total amounts will vary depending on the investment strategy, the status of investment performance, period of management and outstanding balance of assets and thus such fees and expenses cannot be set forth herein. |  PIMCO Canada Corp. (199 Bay Street, Suite 2050, Commerce Court Station, P.O. Box 363, Toronto, ON, M5L 1G2) services and products may only be available in certain provinces or territories of Canada and only through dealers authorized for that purpose. |  PIMCO Latin America Edifício Internacional Rio Praia do Flamengo, 154 1o andar, Rio de Janeiro – RJ Brasil | No part of this publication may be reproduced in any form, or referred to in any other publication, without express written permission. PIMCO is a trademark of Allianz Asset Management of America L.P. in the United States and throughout the world. ©2016, PIMCO", "posttime": "2020-05-11 02:50:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "理解,corporate", "title": "理解公司债券", "title_en": "Understanding Corporate Bonds", "transed": 1, "url": "https://nl.pimco.com/en-nl/resources/education/understanding-corporate-bonds", "via": "", "real_tags": ["理解", "corporate"]}, {"category": "", "categoryclass": "", "imagename": "fdf104b1288db0076ff40f0a9dab91e1.jpeg", "infoid": 1001559, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-特斯拉公司(TSLA.O)周六起诉加州地方当局，这家电动汽车制造商推动重新开放那里的工厂，首席执行官埃隆·马斯克(Elon Musk)威胁要将特斯拉的总部和未来的项目从该州搬到德克萨斯州或内华达州。\n马斯克一直在推动重新开放特斯拉位于加利福尼亚州弗里蒙特的工厂，此前阿拉米达县卫生部门表示，该汽车制造商不得重新开放，因为当地遏制冠状病毒传播的封锁措施仍然有效。\n在周六的一篇博客文章中，特斯拉表示，该县的立场让它别无选择，只能采取法律行动，以确保特斯拉及其员工能够重返工作岗位。\n该公司表示，它已经制定了一项彻底的重返工作计划，其中包括对人员进行在线视频培训，工作区隔断区域，温度筛查，穿戴防护设备的要求，以及严格的清洁和消毒协议。\n该公司表示，已将重启计划通知了弗里蒙特工厂所在的阿拉米达县的卫生当局，但声称代理官员没有回复电话或电子邮件。\n阿拉米达县公共卫生部周六早些时候表示，它一直在“直接沟通，并与特斯拉团队密切合作”，但没有立即回复记者的置评请求。\n特斯拉周六在旧金山联邦法院对该县提起诉讼，称持续的限制措施是该县的一种“夺权行为”，因为加州州长周四曾表示，该州的制造商将被允许重新开张。\n诉讼称，该公司表示，阿拉米达违反了联邦和加州宪法，并藐视州长的命令。\n阿拉米达县计划一直关闭到5月底，只允许必要的企业重新开放。该县表示，它不认为特斯拉是一项必要的业务。县官员没有立即回复对这起诉讼的置评请求。\n周六，直言不讳的马斯克也在Twitter上抱怨，并威胁要离开该州。\n他在推特上写道：“如果我们甚至保留弗里蒙特的制造活动，这将取决于特斯拉未来受到的待遇。”他指的是旧金山湾区的设施，这是特斯拉在美国唯一的汽车工厂。\n阿拉米达县周六表示，它一直在与特斯拉合作制定一项安全计划，该计划“允许重新开工，同时保护在该工厂工作的数千名员工的健康和福祉”，并表示期待很快就安全计划达成协议。\n弗里蒙特市长莉莉·梅(莉莉·梅)对继续实施原地避难所订单而没有为特斯拉等制造商恢复提供资金的潜在经济影响表示担忧。周六，梅敦促该县与企业合作，制定“可接受的重新开业指导方针”。\n马斯克周四告诉员工，弗里蒙特的有限生产将于周五下午重新开始。\n特斯拉去年在弗里蒙特工厂生产了近50万辆汽车，搬迁整个生产设施将是一项艰巨的任务。\n韦德布什分析师丹·艾夫斯(Dan Ives)周六估计，该公司可能需要12至18个月的时间来搬迁生产。\n特斯拉发出搬迁工厂的威胁之际，正值特斯拉计划提高弗里蒙特Y型运动型多功能车(SUV)的产量，预计这将产生创纪录的需求和利润率。\n马斯克曾在3月份与加州官员就特斯拉是否必须停止在弗里蒙特生产一事发生争执，他批评了封锁和留在家中的命令，称它们是对美国企业的“严重风险”，是“违宪的”。\n自3月18日以来，特斯拉股价已上涨127%，为近期收盘低点，其中包括最近一个交易周的涨幅16.8%，周五收于819.42美元。", "note_en": "(Reuters) - Tesla Inc (  TSLA.O) sued local authorities in California on Saturday as the electric carmaker pushed to re-open its factory there and Chief Executive Elon Musk threatened to move Tesla’s headquarters and future programs from the state to Texas or Nevada.\n Musk has been pushing to re-open Tesla’s Fremont, California, factory after Alameda County’s health department said the carmaker must not reopen because local lockdown measures to curb the spread of the coronavirus remain in effect.\n In a blog post on Saturday, Tesla said the county’s position left it no choice but to take legal action to ensure Tesla and its employees can go back to work.\n The company said it had worked out a thorough return-to-work plan that includes online video training for personnel, work zone partition areas, temperature screening, requirements to wear protective equipment and rigorous cleaning and disinfecting protocols.\n The company said it had informed health authorities in Alameda County, where the Fremont factory is located, about its restart plans, but claimed the acting official did not return calls or emails.\n Alameda County’s Public Health Department, which earlier on Saturday said it had been “communicating directly and working closely with the Tesla team,” did not immediately respond to a request for comment.\n Tesla filed a lawsuit against the county in San Francisco federal court on Saturday, calling the continued restrictions a “power-grab” by the county since California’s governor had said on Thursday that manufacturers in the state would be allowed to reopen.\n The company said Alameda was going against the federal and California constitutions, as well as defying the governor’s order, the lawsuit said.\n  Alameda County is scheduled to remain shut until the end of May, with only essential businesses allowed to reopen. The county said it does not consider Tesla an essential business. County officials did not immediately respond to a request for comment on the lawsuit.\n The outspoken Musk also took to Twitter on Saturday to complain and threatened to leave the state.\n “If we even retain Fremont manufacturing activity at all, it will be dependen (sp) on how Tesla is treated in the future,” he tweeted, referring to the San Francisco Bay area facility that is Tesla’s only U.S. vehicle factory.\n Alameda County said on Saturday that it has been working with Tesla to develop a safety plan that “allows for reopening while protecting the health and well-being of the thousands of employees” that work at the factory and that it looks forward to coming to an agreement on a safety plan very soon.\n Fremont Mayor Lily Mei expressed concern about the potential economic implications of continuing the shelter-in-place order without provisions for manufacturers such as Tesla to resume. Mei on Saturday urged the county to work with businesses on “acceptable guidelines for re-opening.”\n Musk had told employees on Thursday that limited production would restart at Fremont on Friday afternoon.\n Tesla last year built nearly half a million vehicles at the Fremont plant and moving the entire production facility would be a massive undertaking.\n Dan Ives, a Wedbush analyst, on Saturday estimated it could take the company 12 to 18 months to relocate production.\n  The threat to relocate the facility comes as Tesla aims to ramp up production at Fremont of its Model Y sport utility vehicle, which it expects to generate record demand and profit margins.\n Musk, who sparred with California officials in March over whether Tesla had to halt production at Fremont, had criticized the lockdown and stay-at-home orders, calling them a “serious risk” to U.S. business and “unconstitutional.”\n Tesla shares have risen 127% since March 18, their recent closing low, including a 16.8% gain in the last trading week to close at $819.42 on Friday.", "posttime": "2020-05-11 02:36:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,诉讼,files,计划", "title": "特斯拉提起诉讼，要求重新开放工厂，马斯克面临批评", "title_en": "Tesla Files Lawsuit Demanding Reopening of Plant As Musk Faces Criticism", "transed": 1, "url": "https://www.reuters.com/article/us-health-coronavirus-tesla/tesla-sues-california-county-in-virus-factory-closure-fight-threatens-to-leave-idUSKBN22L0S5", "via": "", "real_tags": ["特斯拉", "诉讼", "files", "计划"]}, {"category": "", "categoryclass": "", "imagename": "570c10d39146de61ff18967ddd14cf3a.jpg", "infoid": 1001558, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这就是伊布卢斯描述的神奇的多腿动物，它被附加在法国版的利奥·非洲人身上，很可能是由Thevet复制的，毫无疑问是由Paré复制的。\n它甚至被被切断的四肢包围--但是别担心，它会修复它们的！\n有人请我(我雇来的人要求)确切地解释一下，像“利维坦”这样的词条是如何最终被误读并腐化成“kuyūtha”甚至“rakaboúna”的。我相信一定会有一些人(想必一只手少了几个手指)对词源、语言以及怪物是如何在这些基础上进化的感兴趣的。\n阿拉伯语很难读懂。为什么？嗯，首先，有不同的书写方式，不同的类型、文本、字体大小(可以这么说)。例如，看看这个。\n漂亮易读的文字，现代的阿尔瓦迪印刷术。简单的农民。然后你会得到更老的版本，比如这个版本的al-Qazwini。\n可读性稍差一些，但仍可读。但是当你看到这个版本的al-Damiri时，你需要看到整个页面才能获得全面的影响。\n你的眼睛没有欺骗你。方框里的文字是al-Damiri。页边空白处的文字是al-Qazwini创作的奇迹。没错，两本书只卖一本，都是用可爱的小螃蟹笔迹写的！\n当然，还有那些漂亮的手稿，上面有华丽的文字，我几乎看不懂。\n下一个问题是语言本身。阿拉伯语的元音字母很少。大多数元音都用变音符号表示。\n你猜怎么着？大多数时候他们甚至不写变音符号！基于此，Kuyutha，Kiyutha，Kayutha，Kuyuthan，Kayuthan，Kiyuthan根据分配的元音都是同等有效的。结尾的“an”可以是字母，也可以是变音符号--如果是字母，它肯定在那里，如果它是变音符号，那么它就在那里，这是有争议的。\n不仅如此，根据写作质量，K和L可以看起来相同，Y和B可以看起来相同(因此Kuyuban)，T和TH和N可以看起来相同…。所以把它和平均元音移动(山楂)结合起来，你就可以拼凑出利维坦是如何被乱码变成kuyūtha的。\n“但是Rakaboúna呢？”我听到你说。“你甚至在参赛作品中用”搞笑但可以理解“来形容它！”\n嗯，是的。是的。这种误读是佩伦独有的，他把他的翻译归功于al-Damiri，你可能记得这是一篇微不足道的文字。我承认我无法理解他是如何从“KuyūTha”中找到“Rakaboúna”的，直到我从上下文中看出来，这一切都是有意义的。以下是实际部分：\n我已经强调了“公牛的名字是kuyūtha”。看到课文有多挤了吗？原来Perron把“Bull”(Thawr)的最后一个字母“Bull”(即R)粘在了公牛的名字上。然后他继续把Y读成B，把TH读成N，给出了“Rakaboúna”。以下是魔术是如何发生的：\n现在你就知道了。这头可怜的宇宙公牛被赋予了越来越离奇的绰号，而实际上，它应该只是被称为庞然大物，可怜的牛。\n我们的想象力一直是我们最大的盟友，也是我们最大的敌人。面对未知，我们用各种形状和大小的生物填充了它，从微小的灵魂到巨大的宇宙怪物。自从我们赢得了好奇的能力以来，这些实体就已经分享了我们的世界。\n官方生物参赛作品上的所有艺术品和文字均为©生物之书。版权所有。\n不是我的图像和文本(通常在旁白中)在适用的情况下或在公共领域中被视为其各自的所有者，并在任何可能的情况下记入贷方。不属于我的图片的使用属于“合理使用”(如果有任何问题，请告诉我！)。\n输入您的电子邮件地址以跟踪此博客，并通过电子邮件接收新帖子的通知。", "note_en": "Here it is, the miraculous multi-legged animal described by Iambulus, appended to a French version of Leo Africanus, and copied probably by Thevet and unquestionably by Paré.\n  It’s even surrounded by severed limbs – but don’t worry, it’ll fix ‘em!\n      I have been requested (by someone who I hire to request) to explain how, exactly, something like “Leviathan” could end up misread and corrupted into “Kuyūtha” or even “Rakaboûna”. And I’m sure there are some people out there (presumably countable on one hand missing several fingers) who are interested in etymology, language, and how monsters evolve based on those.\n  Arabic is tricky to read. Why? Well, for a start there’s different ways of writing it, different types, texts, font sizes (as it were). Look at this, for instance.\n  Nice and legible text, modern printing of al-Wardi. Easy peasy. Then you get older copies like this version of al-Qazwini.\n  Slightly less legible, but still readable. But then you get to this version of al-Damiri, and, well, you need to see the whole page to get the full impact.\n  Your eyes aren’t deceiving you. The text in the box is al-Damiri. The text in the margins is the  Wonders of Creation by al-Qazwini. That’s right, two books for the price of one, all in lovely tiny crabbed handwriting!\n And then of course there’s the lovely manuscripts with the flowery text which I can barely decipher.\n   The next issue is the language itself. There are few vowel letters in Arabic. Most vowel sounds are represented with diacritics.\n And guess what? Most times they don’t even write the diacritics! So just based on that, Kuyutha, Kiyutha, Kayutha, Kuyuthan, Kayuthan, Kiyuthan are all equally valid based on the vowels assigned. The “an” at the end can be either a letter or a diacritic – if it’s a letter it’s definitely there, if it’s a diacritic it’s debatably there.\n Not only that, but based on the quality of the writing, K and L can look identical, Y and B can look identical (hence Kuyuban), T and TH and N can look identical… So combine that with the average vowel movements (haw haw) and you can piece together how Leviathan could get garbled into Kuyūtha.\n  “But what about Rakaboûna?” I hear you say. “You even describe it as “hilarious but understandable” in your entry!”\n Well, yes. Yes it is. This misreading is unique to Perron, and he attributes his translation to al-Damiri, which you may remember as being teeny-tiny-textual. I’ll admit I couldn’t figure out how he got “Rakaboûna” out of “Kuyūtha”, until I saw it in context and it all made sense. Here’s the actual part:\n  I’ve highlighted “and the name of the bull [is] Kuyūtha”. See how cramped the text is? Turns out Perron glued the last letter of “bull” ( thawr), which is an R, to the name of the bull. Then he proceeded to read the Y as B and the TH as N, giving “Rakaboûna”. Here’s how the magic happened:\n  And there you have it. The poor cosmic bull got saddled with increasingly bizarre monikers, when in reality it should have just been called Behemoth, poor bovine.\n  Our imagination has always been our greatest ally, and our worst enemy. In the face of the unknown, we populated it with creatures of all shapes and sizes, from minuscule spirits to gigantic cosmic monsters. These entities have shared our world ever since we earned the capacity to wonder.\n    All artwork and text on the official creature entries are © A Book of Creatures. All rights reserved.\n Images and text not by me (typically in the asides) are © their respective owners where applicable or in the public domain, and are credited whenever possible. The usage of images that are not mine goes under “Fair Use” (if there are any issues let me know!)\n     Enter your email address to follow this blog and receive notifications of new posts by email.", "posttime": "2020-05-11 02:35:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "book,文字", "title": "“生物之书”(The Book Of Creatures)", "title_en": "A Book of Creatures", "transed": 1, "url": "https://abookofcreatures.com/", "via": "", "real_tags": ["book", "文字"]}]