[{"category": "", "categoryclass": "", "imagename": "59ae017bb57773e98014d4b788151b30.jpg", "infoid": 1001687, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "急于拥抱尖端技术的企业正在探索量子计算，这种计算依赖于量子比特来执行在经典计算机上会困难得多，或者根本不可行的计算。最终目标是量子优势，这是量子计算机开始解决有用问题的拐点。虽然这还有很长的路要走(如果可以实现的话)，但潜力是巨大的。应用包括从密码学和优化到机器学习和材料科学的方方面面。\n正如量子计算初创公司IonQ所描述的那样，量子计算是一场马拉松，而不是短跑。上个月，我们有幸采访了IonQ首席执行官彼得·查普曼(Peter Chapman)，讨论了各种话题。在其他问题中，我们向查普曼询问了量子计算对人工智能和ML的未来影响。\n话题很快转向了强大的人工智能，即人工通用智能(AGI)，这一点还不存在。强大的人工智能是这样一种想法，即有一天机器可以理解或学习人类可以理解的任何智力任务。\n查普曼告诉VentureBeat：“在强烈的人工智能意识中，我对此有更多的看法，只是因为我个人在这方面有更多的经验。”“最近刚刚发表了一篇非常有趣的论文，讨论了如何使用量子计算机来推断NLP中单词的含义。我确实认为，对于强大的人工智能来说，这些事情看起来相当有希望。这实际上也是我加入IonQ的原因之一。这是因为我认为这确实有一定的应用价值。“。\nVB Transform 2020 Online-7月15日至17日：与领先的AI高管一起参加年度AI活动。立即注册，可节省30%的数字访问通行证。\n在随后的一封电子邮件中，查普曼详细阐述了他的想法。他写道：“几十年来，人们一直认为大脑的计算能力存在于神经元中，作为一个最小的单位。”“许多人的早期努力试图找到一种解决方案，使用人工神经网络中连接在一起的人工神经元，但收效甚微。这种方法是由大脑是一台电子计算机的想法推动的，类似于经典的计算机。\n“然而，从那时起，我相信我们现在知道大脑不是一台电子计算机，而是一台电化学计算机，”他补充说。“可悲的是，今天的计算机没有足够的处理能力来模拟神经元离散部分的化学相互作用，如树突、轴突和突触。即使按照摩尔定律，它们也不会在明年或一百万年后出现。“。\n查普曼随后引用了理查德·费曼的名言，他说：“大自然不是经典的，该死的，如果你想模拟自然，你最好把它变成量子力学的。”天哪，这是一个很棒的问题，因为它看起来并不容易。“\n查普曼说：“同样，强大的人工智能很可能不是经典的，它也是量子力学的。”\nIonQ的竞争对手之一D-Wave认为，量子计算和机器学习“非常匹配”。查普曼仍持观望态度。\n“我没有花足够的时间来真正理解它，”他承认。“很明显，有很多人认为ML和Quantum有重叠之处。当然，如果你考虑到85%的ML都会产生一棵决策树，而决策树的深度可以很容易地用量子计算机进行优化。显然，有很多人认为决策树的生成可以用量子计算机来优化。老实说，我不知道是不是这样。我认为现在进行机器学习还为时过早，但显然有这么多人在从事这方面的工作。很难想象它没有应用。“。\n查普曼在后来的一封电子邮件中继续说：“ML与优化有着密切的联系：许多学习问题都被表述为对一组训练样本的某些损失函数的最小化。一般说来，通用量子计算机擅长解决这类问题。“。\n与今天的经典计算机相比，QC实现的优化水平将高得多。\n培训时间可能会大大减少，因为QC可以并行处理问题，其中经典计算机串行执行相同的计算。\n由于QC带来的速度改进，可以考虑的排列的数量可能会大得多。\n无论是强大的人工智能还是ML，IonQ都不是特别感兴趣。该公司将这一点留给了它的客户和未来的合作伙伴。\n查普曼说：“在一个量子体系中，有太多的事情要做。”“从教育的一端一直到量子计算机本身。我认为我们的一些竞争对手已经承担了很多整个问题集。我们IonQ只是专注于为他们生产世界上最好的量子计算机。我们认为，对于我们这样的小公司来说，这已经是一个足够大的任务了。“。\n“所以，就目前而言，我们有点高兴让其他人解决不同的问题，”他补充道。“…。我们没有额外的带宽或资源投入到机器学习算法上。幸运的是，还有很多其他公司认为那里有应用程序。我们将与他们合作，在这个意义上，我们将提供他们的算法将在其上运行的硬件。但我们本身并不是在做ML业务。“", "note_en": "Businesses eager to embrace cutting-edge technology are exploring quantum computing, which depends on qubits to perform computations that would be much more difficult, or simply not feasible, on classical computers. The ultimate goals are quantum advantage, the inflection point when quantum computers begin to solve useful problems. While that is a long way off (if it can even be achieved), the potential is massive. Applications include everything from cryptography and optimization to machine learning and materials science.\n As quantum computing startup IonQ has described it,  quantum computing is a marathon, not a sprint. We had the pleasure of interviewing IonQ CEO Peter Chapman last month to discuss a variety of topics. Among other questions, we asked Chapman about quantum computing’s future impact on AI and ML.\n   The conversation quickly turned to Strong AI, or Artificial General Intelligence (AGI), which does not yet exist. Strong AI is the idea that a machine could one day understand or learn any intellectual task that a human can.\n “AI in the Strong AI sense, that I have more of an opinion [about], just because I have more experience in that personally,” Chapman told VentureBeat. “And there was  a really interesting paper that just recently came out talking about how to use a quantum computer to infer the meaning of words in NLP. And I do think that those kinds of things for Strong AI look quite promising. It’s actually one of the reasons I joined IonQ. It’s because I think that does have some sort of application.”\n  VB Transform 2020 Online - July 15-17: Join leading AI executives at the AI event of the year.  Register today and save 30% off digital access passes.\n In a follow-up email, Chapman expanded on his thoughts. “For decades, it was believed that the brain’s computational capacity lay in the neuron as a minimal unit,” he wrote. “Early efforts by many tried to find a solution using artificial neurons linked together in artificial neural networks with very limited success. This approach was fueled by the thought that the brain is an electrical computer, similar to a classical computer.”\n “However, since then, I believe we now know the brain is not an electrical computer, but an electrochemical one,” he added. “Sadly, today’s computers do not have the processing power to be able to simulate the chemical interactions across discrete parts of the neuron, such as the dendrites, the axon, and the synapse. And even with Moore’s law, they won’t next year or even after a million years.”\n Chapman then quoted Richard Feynman, who famously said “Nature isn’t classical, dammit, and if you want to make a simulation of nature, you’d better make it quantum mechanical. And by golly, it’s a wonderful problem because it doesn’t look so easy.”\n “Similarly, it’s likely Strong AI isn’t classical, it’s quantum mechanical as well,” Chapman said.\n  One of IonQ’s competitors, D-Wave, argues that  quantum computing and machine learning are “extremely well matched.” Chapman is still on the fence.\n “I haven’t spent enough time to really understand it,” he admitted. “There clearly [are] a lot of people who think that ML and quantum have an overlap. Certainly, if you think of 85% of all ML produces a decision tree, and the depth of that decision tree could easily be optimized with a quantum computer. Clearly, there [are] lots of people that think that generation of the decision tree could be optimized with a quantum computer. Honestly, I don’t know if that’s the case or not. I think it’s still a little early for machine learning, but there clearly [are] so many people that are working on it. It’s hard to imagine it doesn’t have [an] application.”\n Chapman continued in a later email: “ML has intimate ties to optimization: Many learning problems are formulated as minimization of some loss function on a training set of examples. Generally, Universal Quantum Computers excel at these kinds of problems.”\n  The level of optimization achieved will be much higher with a QC as compared to today’s classical computers.\n The training time might be substantially reduced because a QC can work on the problem in parallel, where classical computers perform the same calculation serially.\n The number of permutations that can be considered will likely be much larger because of the speed improvements that QCs bring.\n  Whether Strong AI or ML, IonQ isn’t particularly interested in either. The company leaves that to its customers and future partners.\n “There’s so much to be to be done in a quantum,” Chapman said. “From education at one end all the way to the quantum computer itself. I think some of our competitors have taken on lots of the entire problem set. We at IonQ are just focused on producing the world’s best quantum computer for them. We think that’s a large enough task for a little company like us to handle.”\n “So, for the moment we’re kind of happy to let everyone else work on different problems,” he added. “… We just don’t have extra bandwidth or resources to put into working on machine learning algorithms. And luckily, there [are] lots of other companies that think that there [are] applications there. We’ll partner with them in the sense that we’ll provide the hardware that their algorithms will run on. But we’re not in the ML business, per se.”", "posttime": "2020-05-12 02:09:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,首席,ceo,量子", "title": "IonQ首席执行官彼得·查普曼谈量子计算将如何改变人工智能的未来", "title_en": "IonQ CEO Peter Chapman on How Quantum Computing Will Change the Future of AI", "transed": 1, "url": "https://venturebeat.com/2020/05/09/ionq-ceo-peter-chapman-on-how-quantum-computing-will-change-the-future-of-ai/", "via": "", "real_tags": ["人工智能", "首席", "ceo", "量子"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001685, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "前言：羟基氯喹(HCQ)与阿奇霉素合用或不与阿奇霉素合用目前仍是一种潜在的治疗冠状病毒流行的方法。一些研究显示了不同的结果。方法：对2020年3月2日至4月17日在三级医院住院的成人冠状病毒患者进行单中心回顾性研究。根据接受的治疗(盐酸/阿奇霉素、≥48h或其他治疗)，比较各组患者的特征。从入院开始，通过对重症监护病房(ICU)支持和/或死亡的需求来评估结果。结果：内科病房冠状病毒感染住院患者中，45例48小时内接受盐酸阿奇霉素≥治疗，优良率为91.1%(OR=6.2p=0.002)，优于其他治疗方案(n=87)。在年龄、性别、合并症、胸部影像范围和严重程度方面，各组在基线上具有可比性。在需要转院到ICU(n=27)(进行机械通气)的患者中，转院的中位延迟时间为2天(IQR1-3)。我们仅报告1例患者出现不良事件(心电图QT间期延长)，需要停用HCQ。结论：HCQ/阿奇霉素联合治疗住院患者冠状病毒具有潜在的应用价值。\n所有相关的道德准则都得到了遵守；任何必要的IRB和/或伦理委员会的批准都已经获得，IRB/监督机构的详细信息也包括在手稿中。\n已获得所有必要的患者/参与者同意，并已将适当的机构表格存档。\n我理解所有临床试验和任何其他预期干预研究必须在ICMJE批准的注册机构注册，如ClinicalTrials.gov。我确认手稿中报告的任何此类研究都已注册，并提供了试验注册ID(注意：如果张贴追溯注册的前瞻性研究，请在试验ID字段中提供一份声明，说明为什么没有提前注册该研究)。\n我已遵循所有适当的研究报告指南，并上传了相关的赤道网络研究报告核对表和其他相关材料作为补充文件(如果适用)。", "note_en": "Introduction: Hydroxychloroquine (HCQ) with or without azithromycin is currently still debated as a potential treatment for the COVID-19 epidemic. Some studies showed discrepant results. However, timing for the treatment initiation and its setting (in-hospital or out-patient) are not consistent across studies.Methods: Monocentric retrospective study conducted from 2th March to 17th April 2020, in adults hospitalized in a tertiary hospital for COVID-19. Patients characteristics were compared between groups depending on the therapy received (HCQ/azithromycin taken ≥ 48 hours or other treatment). Outcomes were evaluated from admission, by the need for intensive care unit (ICU) support and/or death. Univariate analyses were performed using non-parametric tests and confirmed by a multiple logistic regression using Pearson correlation test.Results: Among 132 patients admitted for COVID-19 in the medicine ward, 45 received HCQ/azithromycin ≥ 48 hours, with a favorable outcome in 91.1% of cases (OR=6.2, p=0.002) versus others regimen (n=87). Groups were comparable at the baseline in terms of age, sex, comorbidities, extend in thoracic imaging, and severity. Among patients that required to be transferred to ICU (n=27) (for mechanical ventilation), median delay for transfer was 2 days (IQR 1-3). We report only 1 patient that presented an adverse event (a prolonged QT interval on EKG) that required to discontinue HCQ. Conclusion: The present study suggests a potential interest of the combination therapy using HCQ/azithromycin for the treatment of COVID-19 in in-hospital patients.\n        All relevant ethical guidelines have been followed; any necessary IRB and/or ethics committee approvals have been obtained and details of the IRB/oversight body are included in the manuscript.\n  All necessary patient/participant consent has been obtained and the appropriate institutional forms have been archived.\n  I understand that all clinical trials and any other prospective interventional studies must be registered with an ICMJE-approved registry, such as ClinicalTrials.gov. I confirm that any such study reported in the manuscript has been registered and the trial registration ID is provided (note: if posting a prospective study registered retrospectively, please provide a statement in the trial ID field explaining why the study was not registered in advance).\n  I have followed all appropriate research reporting guidelines and uploaded the relevant EQUATOR Network research reporting checklist(s) and other pertinent material as supplementary files, if applicable.", "posttime": "2020-05-12 02:08:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "氯喹,azithromycin,治疗", "title": "羟氯喹联合阿奇霉素：降低COVID19发病率的潜力", "title_en": "Hydroxychloroquine plus azithromycin: potential in reducing COVID19 morbidity", "transed": 1, "url": "https://www.medrxiv.org/content/10.1101/2020.05.05.20088757v1", "via": "", "real_tags": ["氯喹", "治疗"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001683, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当$FAMEED_COMPANY在2010年推出时，它只在$Techbro_Founder车库的一台服务器上运行。从那时起，我们经历了风险投资的爆炸性增长，今天我们拥有来自世界各地的数亿日活跃用户(DAU)，他们通过我们的移动应用程序和$Famouscompany.com访问我们的产品。自那以后，我们对后端进行了几次恐慌引发的更改，以管理我们的技术债务(通常是在一次备受瞩目的停机之后)，以防止我们的服务器崩溃。这些年来，我们现有的技术堆栈为我们提供了很好的服务，但随着我们寻求进一步发展，很明显，完全重写我们的应用程序将以某种方式防止我们每年在客户获取上损失20亿美元。\n正如我们在之前的博客文章中提到的，$FAMERED_COMPANY后端历来都是用$NOPARICAL_LANGUAGE开发的，并且架构在$PARICAL_OPEN_SOURCE_framework之上。为了满足我们的独特需求，我们设计并开源了$AN_ENGINEER_Take_A_Mythology_CLASS，这是一个针对$UNSPECTIONAL_LANGUAGE的高可用性、即时编译器。然而，即使使用我们的自定义运行时，我们最终也开始在第99个百分位延迟统计数据中看到零星的峰值，随着我们扩展以处理不断增加的DAU计数，这个峰值变得更加明显。幸运的是，我们所有的软件都是为自省而重新设计的，并且使用我们从Brendan Gregg网站复制的一些BPF脚本，我们的内部分析工具$FAMERED_COMPANY工程师确定性能瓶颈是花费在垃圾收集器上的时间造成的。\n最初，我们尝试处理一些我们并不真正理解的垃圾收集器参数，但令我们惊讶的是，这并没有神奇地解决我们的问题，所以我们完全禁用了垃圾收集。这增加了我们的内存使用量，但是我们的自动按需伸缩器为我们处理了这一点，如下图所示：\n然而，最终，我们决定转行的原因是，尽管美国数十所大学都在教授这种语言，但我们很难用平凡的语言招聘新的人才。我们在$Practical_open_source_framework上发表的博客帖子在Reddit上也得到了较少的好评，这巩固了我们的信念，即我们的技术堆栈现在是遗留代码。\n我们知道我们需要找到一些能跟上我们名牌公司规模的东西。我们根据他们的网站上有多少项目符号，他们在黑客新闻头版出现的频率，以及我们让办公室人员填写的重要语言特征(性能、效率、社区、易用性)的电子表格，对我们选择的一些有希望的替代方案进行了评估并进行了排名，这些项目符号在他们的网站上有多少个项目符号，他们出现在Hacker News的首页上的频率有多高，以及我们让办公室里的人填写的重要语言特征的电子表格。\n因为我们的电子表格满足随机性的强大统计保证，所以我们能够重用它来替换我们应用程序的CSPRNG。\n经过仔细考虑，我们决定重新设计我们的平台，使用$flashy_language和$hashed_technology。根据Stack Overflow开发人员调查，$FLASHY_LANGUAGE不仅很受欢迎，而且是跨平台的；我们也在使用它来重新实现我们的移动应用程序。重写我们的核心基础设施相当简单：由于我们拥有的工程师超过了我们可能需要的数量，甚至不知道该怎么做，我们只是冻结了处理错误报告，转而将精力转移到$HUPED_TECHING上。我们最初在适应$flashy_language的一些怪癖时遇到了一些困难，并且遇到了一些$hashed_technology的错误，但总的来说，它们强大的新功能让我们消除了以前的解决方案必须处理的一些复杂性。\n在不停机的情况下部署更改需要一些仔细的计划，但这也不太困难：我们只需将状态页面硬编码为每当我们推送新更改时不更新，让用户猜测我们的服务是否启动。管理增量部署是关键：我们对新代码进行了积极的A/B测试。我们的内部研究表明，偶尔向用户展示一个全新的界面，然后在他们下次加载页面时切换回旧界面，这会增加用户参与度，所以我们确保根据我们发现的与多武装土匪有关的媒体文章来实现这样一个系统。\n随着我们的重写现在已经完成，并向我们所有的客户推出，我们认为这一努力对我们和我们的团队来说是一个巨大的成功。我们已经测量了我们的性能，您可以看到以下结果摘要：\n重写后，对我们重要的每个指标都大幅增加，我们甚至确定了一些不再与我们相关的指标，例如错误数量、用户挫折感和维护成本。今天，我们将在我们的GitHub页面上提供一些我们负担得起的开源代码。它本身毫无用处，并且与我们的基础设施紧密相关，但您可以将其加星以使我们看起来更相关。\n人们经常说，完全重写软件充满了风险，但我们$FAMONED_COMPANY喜欢下大赌注，很明显，这一次获得了丰厚的回报。虽然我们在这篇博客文章中关注的是后端更改，但正如我们之前提到的，我们也在移动应用程序中使用$FLASHY_LANGUAGE，因为我们没有资源为每个平台编写本机应用程序。不幸的是，增加锁定，这些重写也意味着我们将不推荐第三方API访问我们的服务。我们知道我们的一些用户出于可访问性的原因而依赖这些界面，但我们$FAMERED_COMPANY致力于改善我们为残疾人提供的服务，只要你不使用任何形式的辅助技术，而这些技术根本不再适用于我们的应用程序。\n我们希望您将我们公司的轶事内化为某种基本事实，并将其展示给贵公司的CTO，这样他们也可以考虑重新设计他们的架构，就像我们所做的那样。我们知道你会忽略这样一个事实，即你不是我们，我们有足够的工程师和资源可以做任何我们想做的事情，但这个决定会毁了你的初创公司，所以我们不会很快看到你的博客帖子，讲述你使用$HAMED_TECHING的经历。如果你不能影响你的公司使用什么，你仍然可以在下一次语言战争发生时提出来计分。\n如果您正在阅读这篇文章，并且像我们一样对$HAMED_TECHING感兴趣，我们正在招聘！请务必查看我们的工作页面，那里将没有与$FLASHY_LANGUAGE相关的职位。", "note_en": "When $FAMOUS_COMPANY launched in 2010, it ran on a single server in $TECHBRO_FOUNDER’s garage. Since then, we’ve experienced explosive VC-funded growth and today we have hundreds of millions of daily active users (DAUs) from all around the globe accessing our products from our mobile apps and on $famouscompany.com. We’ve since made a couple of panic-induced changes to our backend to manage our technical debt (usually right after a high-profile outage) to keep our servers from keeling over. Our existing technology stack has served us well for all these years, but as we seek to grow further it’s clear that a complete rewrite of our application is something which will somehow prevent us from losing two billion dollars a year on customer acquisition.\n  As we’ve mentioned in previous blog posts, the $FAMOUS_COMPANY backend has historically been developed in $UNREMARKABLE_LANGUAGE and architected on top of $PRACTICAL_OPEN_SOURCE_FRAMEWORK. To suit our unique needs, we designed and open-sourced $AN_ENGINEER_TOOK_A_MYTHOLOGY_CLASS, a highly-available, just-in-time compiler for $UNREMARKABLE_LANGUAGE. Even with our custom runtime, however, we eventually began seeing sporadic spikes in our 99th percentile latency statistics, which grew ever more pronounced as we scaled up to handle our increasing DAU count. Luckily, all of our software is designed from the ground up for introspectability, and using  some BPF scripts we copied from Brendan Gregg’s website our in-house profiling tools $FAMOUS_COMPANY engineers determined that the performance bottlenecks were a result of time spent in the garbage collector.\n Initially, we tried messing with some garbage collector parameters we didn’t really understand, but to our surprise that didn’t magically solve our problems so instead we disabled garbage collection altogether. This increased our memory usage, but our automatic on-demand scaler handled this for us, as the graph below shows:\n  Ultimately, however, our decision to switch was driven by our difficulty in hiring new talent for $UNREMARKABLE_LANGUAGE, despite it being taught in dozens of universities across the United States. Our blog posts on $PRACTICAL_OPEN_SOURCE_FRAMEWORK seemed to get fewer upvotes when posted on Reddit as well, cementing our conviction that our technology stack was now legacy code.\n  We knew we needed to find something that could keep up with us at $FAMOUS_COMPANY scale. We evaluated a number of promising alternatives that we selected and ranked based on the how many bullet points they had on their websites, how often they’d appear on the front page of Hacker News, and a spreadsheet of important language characteristics (performance, efficiency, community, ease-of-use) that we had people in the office fill out.\n As our spreadsheet met strong statistical guarantees of randomness, we were able to reuse it to replace our application’s CSPRNG.\n After careful consideration, we settled on rearchitecting our platform to use $FLASHY_LANGUAGE and $HYPED_TECHNOLOGY. Not only is $FLASHY_LANGUAGE popular according to the Stack Overflow developer survey, it’s also cross platform; we’re using it to reimplement our mobile apps as well. Rewriting our core infrastructure was fairly straightforward: as we have more engineers than we could possibly ever need or even know what to do with, we simply put a freeze on handling bug reports and shifted our effort to $HYPED_TECHNOLOGY instead. We originally had some trouble with adapting to some of $FLASHY_LANGUAGE’s quirks, and ran into a couple of bugs with $HYPED_TECHNOLOGY, but overall their powerful new features let us remove some of the complexity that our previous solution had to handle.\n Deploying the changes without downtime required some careful planning, but this was also not too difficult: we just hardcoded the status page to not update whenever we pushed new changes, keeping users guessing if our service was up or not. Managing incremental rollout was key: we aggressively A/B tested the new code. Our internal studies showed that gaslighting users by showing them a completely new interface once in a while and then switching back to the old one the next time they loaded a page increases user engagement, so we made sure to implement such a system based on a Medium article we found that had something to do with multi-armed bandits.\n With our rewrite now complete and rolled out to all of our customers, we think the effort has been a massive success for us and our team. We have measured our performance and you can see a summary of the results below:\n  Every metric that matters to us has increased substantially from the rewrite, and we even identified some that were no longer relevant to us, such as number of bugs, user frustration, and maintenance cost. Today we are making some of the code that we can afford to open source available on our GitHub page. It is useless by itself and is heavily tied to our infrastructure, but you can star it to make us seem more relevant.\n  It’s often said that completely rewriting software is fraught with peril, but we at $FAMOUS_COMPANY like to take big bets, and it’s clear that this one has paid off handsomely. While we focused on our backend changes in this blog post, as we mentioned before we are using $FLASHY_LANGUAGE in our mobile apps as well, since we don’t have the resources to write native applications for each platform. Unfortunately  to increase lock-in these rewrites also mean we will be deprecating third-party API access to our services. We know some of our users relied on these interfaces for accessibility reasons, but we at $FAMOUS_COMPANY are dedicated to improving our services for those with disabilities as long as you aren’t using any sort of assistive technologies, which no longer work at all with our apps.\n We hope that you internalize our company’s anecdote as some sort of ground truth and show it to your company’s CTO so they too can consider redesigning their architecture like we have done. We know you’ll ignore the fact that you’re not us and we have enough engineers and resources to do whatever we like, but the decision will ruin your startup so it’s not like we’ll see  your blog posts about your experience with $HYPED_TECHNOLOGY anytime soon. If you’re not in a position to influence what your company uses, you can still bring it up for point-scoring the next time a language war comes up.\n If you’re reading this and are interested in $HYPED_TECHNOLOGY like we are, we are hiring! Be sure to check out our jobs page, where there will be zero positions related to $FLASHY_LANGUAGE.", "posttime": "2020-05-12 01:40:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "company", "title": "我们在$名人公司改用$HAMED_TECHING", "title_en": "We at $Famous_company Switched to $Hyped_technology", "transed": 1, "url": "https://saagarjha.com/blog/2020/05/10/why-we-at-famous-company-switched-to-hyped-technology/", "via": "", "real_tags": ["company"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001682, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年4月8日，约翰·霍顿·康威出现冠状病毒症状。2020年4月11日，他死于这种疾病。1 2 3 4。\n像很多人一样，我哀悼康威的逝世，但我也颂扬他的一生。我赞颂他的成就，我赞颂他的好奇心，我赞颂他使重要的数学主题引人入胜和有趣的技巧。\n这项技能的一个最好的例子是本文的主题编程语言FRACTRAN。\n康威从早年就触动了我自己的生活。正如我在八皇后问题…中所描述的那样。以及拉甘瓦尔德意想不到的怀旧之情：\n有一次，我母亲送我去了一个天才儿童日营，它的组织方式就像一所大学。“学生”自选选修课，我选了一门叫“乌敦尼特”的选修课。结果是半天的拼图和游戏练习，我被吸引住了。\n我还能在哪里学到在超级立方体里玩井字游戏？还是关于说谎者和说真话的人？或者，碰巧，关于马丁·加德纳？我怀疑所有的材料都是从他收集的专栏中拿出来的，这很适合我。\n我们在“胡敦尼特”中谈到的其中一件事是康威的生活游戏。我记得在那里听说过它，但我也不记得经常玩它。当时发生了很多事情，完全有可能是因为我太忙着爱上雷蒙德·斯穆利安，以至于没有给约翰·康威留下好奇心。5 6 7。\n在我的一生中，我又几次重新发现了康威的“人生游戏”(Game Of Life)。我们在大学里谈过。几年后，我读了威廉·庞德斯通(William Poundstone)的“递归的宇宙：宇宙的复杂性和科学知识的极限”，它真的让我大吃一惊：\n一路上，我学到了一些博弈论的知识。我喜欢各种各样的游戏，我想我在图书馆里发现了“战略游戏：理论与应用”，并把它拿了起来，想着它会对我的五子棋有所帮助。\n这就把我带到了康威的“论数字和游戏”，并通过平行的路径，到达了超现实的数字。就像“生活的游戏”(Game Of Life)一样，超现实的数字不断出人意料地出现，重新点燃了我对我们如何表示数据、提供或阻碍处理这些数据的方式的兴趣。\n1987年，康威为1984年和1985年在新泽西州莫里斯敦和1986年夏天在帕洛阿尔托举办的关于通信和计算问题的特别研讨会贡献了FRACTRAN：一种简单的通用算术编程语言。加利福尼亚。FRACTRAN本身在该领域并不是一个重要的公开问题，但正如已发表论文的编辑所指出的那样：\n也许所有贡献中最有趣的是康威关于FRACTRAN的迷人的文章，这是一个奇怪的数字集合，当以简单的方式操作时，可以产生所有可能的计算。我们从他的文章开始。\n--Thomas M.Cover&amp；B.Gotinath，“通信与计算中的公开问题”10。\n正如维基百科所指出的，FRACTRAN程序是由正分数和初始正整数输入n组成的有序列表。该程序通过如下方式更新整数n来运行：\n对于列表中nf为整数的第一个分数f，请将n替换为nf。\n重复此规则，直到列表中没有一个分数在乘以n时产生整数，然后停止。\n例如，这是一个用于计算任何斐波纳契数的FRACTRAN程序：17/65、133/34、17/19、23/17、2233/69、23/29、31/23、74/341、31/37、41/31、129/287、41/43、13/41、1/13、1/3。11。\n所有FRACTRAN程序也都以n的初始值开始，该值有时是常量，有时由用户提供。当它由用户提供时，有时需要准备n以使其可用。\n在这个程序的例子中，为了计算某个x值的fib(X)，我们计算n=78*5^(x-1)。\n让我们使用这个程序来计算fib(7)。我们从n=78*5^(7-1)开始，即1,218,750。我们将跟随一段时间来感受一下会发生什么：\n计划中的第一个分数是17/65。1,218,750乘以17/65等于318,750，因此我们将1,218,750替换为318,750，然后重新开始。\n计划中的第一个分数是17/65。318,750除以65会剩下余数，所以我们继续前进。\n节目的下一个分数是133/34。318,750乘以133/34等于1,246,875，因此我们将318,750替换为1,246,875，然后重新开始。\n节目的下一个分数是13/41。24576除以41会剩下余数，所以我们继续前进。\n程序中的下一个分数是1/13。24,576除以13会留下余数，所以我们继续。\n程序中的下一个分数是1/3。24,576乘以1/3是8,192，所以我们用8,192替换24,576，然后重新开始。\n8,192是一个重要的数字，因为没有一个除数可以均匀地除以8,192。所以我们看到。\n计划中的第一个分数是17/65。8192除以65会剩下余数，所以我们继续前进。\n节目的下一个分数是133/34。8,192除以34剩下的余数，所以我们继续前进。\n程序中的下一个分数是17/19。8,192除以19剩下的余数，所以我们继续。\n节目的下一个分数是13/41。8192除以41会剩下余数，所以我们继续前进。\n程序中的下一个分数是1/13。8,192除以13后剩下的是余数，所以我们继续。\n程序中的下一个分数是1/3.8,192除以3剩下的是余数，所以我们继续。程序中没有一个去中心化程序平均分配到8,192个，所以程序暂停。\n所有FRACTRAN程序都会为n生成一系列值，并且必须从这些值中提取我们想要的结果。对于我们的Fibonacci程序，这些值以1,218,750、318,750、1,246,875和1,115,625开始，然后以221,184、73,728、24,576和8,192结束。13个。\n在斐波纳契数列中，我们想要的结果是n的最后一个值的log2。n的最后一个值是8,192，log2(8,192)是13，这就是我们想要的答案。第7个斐波纳契数是13。\n程序本身，一个有限的分数列表。本节目名单为17/65、133/34、17/19、23/17、2233/69、23/29、31/23、74/341、31/37、41/31、129/287、41/43、13/41、1/13和1/3。\n初始值n。它可以是常量，可以是用户提供的值，也可以是用户定义的值的转换。该程序的转换可以用JavaScript表示为n=&gt；78*Math.pow(5，n-1)。\n从n的值到我们想要的结果的转换，按照我们想要的方式编码。在我们的示例中，它类似于VALUES=&gt；Math.log2(last(Values))。\n编写FRACTRAN解释器非常容易。让我们从编写一个JavaScript Fibonacci函数开始，该函数使用我们的FRACTRAN程序来实现。我们需要注意的主要问题是，n的值可能会变得非常非常大，因此我们需要使用大整数，也就是“BigInts”14。\n处理大整数的一个后果是，我们依赖于数字的许多东西不再有效。例如，Math.log2(8192)=&gt；13，但math.log2(8192n)=&gt；TypeError：无法将BigInt值转换为数字。我们必须编写我们自己的log2函数。\nMath.pow也是如此，我们将不得不写我们自己的。如果您愿意，可以随意使用这些实现：\n//任何足够复杂的循环函数，包含特定的、//非正式指定的、充满错误的、缓慢实现的//一半线性递归常量log2=(N)=&gt；{let result=0n；while(True){//退化条件if(n==1n)Break；//(n%2n==1n)RETURN；IF(n&lt；1n)RETURN；//分治征服++RESULT；//(n%2n==1n)RETURN；IF(n&lt；1n)RETURN；//分治++RESULT；n=n/2n；}返回结果；}常量幂=(基，指数)=&gt；{if(指数&lt；0n)返回；设结果=1n；而(指数--&gt；0n)结果=结果*基；返回结果；}。\n现在继续编写您自己的实现。在您编写完自己的代码之前，请忽略下面的代码。\n//使用log2和上面的幂来制定种子并解密结果const fib=(X)=&gt；{const program=(&#39；17/65,133/34，17/19，23/17,2233/69，23/29，31/23，74/341，&#39；+&#39；31/37，41/31,129/287，41/43，13/41，1/13，1/3&#39；)。拆分(/(？：\\s*，|\\s)\\s*/)。映射(f=&gt；f.。拆分(&#39；/&#39；)。map(n=&gt；BigInt(N)；设n=78n*power(5 n，BigInt(X)-1 n)；Program_start：while(True){for(const[分子，分母]，程序){if(n%denominator=0n){n=(n*分子)/分母；Continue Program_start；}}Break；}return log2(N)；}；FIB(7)//=&gt；13。\n这太酷了。FRACTRAN程序非常小，而且简单得离谱：它只是分数。中央FRACTRAN解释器也非常小：它实际上是WHILE循环中的FOR循环，如果JavaScript支持GOTO，则可以避免WHILE循环(以及BREAK语句)。15个。\n尽管FRACTRAN表面上看起来很优雅，但乍一看，它似乎是高深莫测的。它是不是一种既不好读也不好写的语言？或者，有没有一种方法可以通过编写分数列表来疯狂地编写程序？\n要回答这个问题，我们必须首先考虑另一位伟大思想家马文·明斯基(Marvin Minsky)的作品。\n1987年9月，斯图尔特·布兰德在麻省理工学院出版了“媒体实验室：发明未来”。说这本书影响了我是不公平的。就像许多商业和技术圣徒传记一样，它对麻省理工学院和导演尼古拉斯·尼葛洛庞帝(Nicholas Negroponte)试图做的事情赞叹不已。\n这也很有启发性：布兰德详细描述了媒体实验室是如何由其企业赞助商资助的，以及资助模式是如何推动研究的。他们的座右铭是，“不演示就死”，这意味着这些钱流向了那些不仅能让同龄人惊叹的人，还能提供舞台魔力，让他们的企业赞助商打开钱包。\n当时我在科技企业销售部工作，我敏锐地理解到，虽然没有牛排很难卖出SIZE，但当你有非常好的牛排，但没有SIZE的时候，同样不太可能获得销售。16个。\n媒体实验室提到的其中一个人物是马文·明斯基(Marvin Minsky)。明斯基被认为是人工智能领域的巨人，人工智能是当时的郁金香狂热。历史将表明，随着这本书的出版，人工智能资金开始了另一次周期性崩溃，但当我读这本书时，杂志和书架在令人窒息的散文和乌托邦愿景的重压下呻吟。\n1985年，明斯基出版了“心灵学会”，我在媒体实验室读到有关明斯基的文章后买下了这本书。1994年，一家名为旅行者(Voyager)的公司出版了“心灵社会”(Society Of Mind)的CD-ROM版，我用苹果的一款比较古怪的产品--从菲利普斯那里借来的CD-ROM阅读器和音频-CD播放机--“玩”了这个版本，并打上了PowerCD的牌子。\nCD-ROM的特色之一是对明斯基的办公室进行互动参观。我仍然清楚地记得他关于他挂在墙上的镜子的讨论，他提到费曼写了一整本书，致力于解释一件事：光实际上是如何从镜子上反射出来的，在这本书中，他解释了为什么所有非专业人士相信的关于光和反射的东西实际上都是错误的。\n与费曼和康威一样，明斯基也有解释具有挑战性的想法的天赋。他也像费曼和康威一样，为人类知识的进步做出了巨大贡献。他的研究领域之一是可计算性，具体地说，就是研究一类理想化的计算机器，这些机器现在被命名为明斯基机器(Minsky Machines)，以纪念他的名字。17 18。\n明斯基机器是一种理想化的机器，已经被证明是计算通用的。明斯基机器是称为寄存器机器的理想化机器家族的一部分。\n就像寄存器机器和图灵机一样，明斯基机器形成了一个小家族，它们之间在想象的方式上略有不同，但在计算上都是等价的。我们将讨论明斯基机器的一种特别简单的形式，我们称之为“宏伟的”明斯基机器。19个\n就像图灵机一样，宏伟的明斯基机器也有有限的状态。然而，Magnificent Minsky机器没有单一的磁带在一个或两个方向上延伸到无限远，而是有有限数量的磁带，每个磁带只在一个方向上延伸到无穷大。\n就像图灵机一样，一台宏伟的明斯基机器为每一盘磁带都有一个磁头，根据它的指令，可以移动它的磁头并改变到不同的状态。与图灵机不同的是，一台宏伟的明斯基机器可以将其磁头在任意方向上移动任意限量。我们称这些方向为向前(“远离开始”)和向后(“朝向开始”)。\n当图灵机与其磁头下面的特定符号相匹配时，它可以写入符号，也可以将磁头向任意方向移动一个正方形。\n与图灵机不同，一台宏伟的明斯基机器不能在它的磁带上写任何东西，因此与它的磁头下面的任何东西都不匹配。它能做的就是测试是否有可能执行一个动作。既然总是可以前进的，我们唯一关心的就是后退有没有可能。\n与图灵机不同的是，一台宏伟的明斯基机器可以同时移动零个或多个磁头。因此，它的测试可以检查一个或多个磁头是否可以向后移动。\n举一个字面上的例子，如果磁头在开头，就不可能后退。如果磁头向前移动n个方块，则可以向后移动&lt；=n个方块，但不能移动所有&gt；n个方块。\n这些设计选择的最终效果是，Magnificent Minsky Machine可以存储任意数量的状态，就像图灵机一样，但它通过使每个磁头与其磁带的开头保持任意距离来存储该状态。20个。\n让我们使用宏伟的明斯基机器编写一个程序。现在我们已经大致了解了这些机器是如何运行的，下面是我们将如何指定每台Magnificent Minsky机器，即我们应该如何编写其“程序”：\n我们的机器将有有限数量的状态，用连续的正整数表示，即1，2，3，…。\n每条规则都将表示为“如果这样做，如果那样做”。因此，它们将有两个条款：一个行动条款和一个守卫条款。\nACTION子句应由一组向前移动的磁头和每个磁头表示移动多少方块的正整数组成。我们将把它们记为(磁带标识符^要向前移动的正方形)的元组。ACTION子句是这样的元组的无序集合，同一规则中没有两个元组共享相同的磁带头。ACTION子句还将包括一个正整数，指示要进入的下一个状态。\n保护条款应由一组向后移动的磁头和一个正整数组成，该正整数表示向开始移动的方块数。与ACTION子句一样，同一规则中的两个保护子句不能共享同一磁头。\n由于同一规则中的两个子句不能共享同一个磁带头，因此没有一条规则可以既测试保护子句中的磁带头，又同时移动操作子句中的磁带头。\n我们的Magnificent Minsky机器是通过将磁头放置在特定位置进行初始化的，因此，除了列出其中的状态和规则外，Magnificent Minsky机器的说明还将包括设置磁头初始位置的说明。\n当我们希望运行Magnificent Minsky机器时，我们将其启动为状态1。我们通过按顺序扫描当前状态内的规则来操作我们的机器。\n对于每个规则，我们检查其保护条款。如果可以将保护子句中的所有磁头移向开头，则规则“触发”，我们按照保护子句所指定的那样将磁头移向开头。然后，我们参考操作条款，并将列出的所有磁头从末尾移开列出的数量。最后，当规则触发时，如果它列出了下一个状态，我们将更改到该状态，并返回到按顺序扫描当前状态中的规则。\n如果任何规则的保护条款不能执行磁头朝向开头的所有必需的移动，则该规则失败，并且磁头不会受到干扰。然后，我们继续尝试该州列表中的下一个规则，然后再尝试下一个规则，依此类推。如果当前状态下的所有规则都失败，计算机将暂停。由此可以得出结论，如果机器在没有任何规则的情况下进入一种状态，它就必须停止。\n如果机器试图转换到未定义的状态，它也会停止。因此，显式转换到状态0是显式停止机器的格式良好的方式。\n现在我们准备好讨论Magnificent Minsky机器的一个简单符号，并尝试一个。\n考虑一台伟大的明斯基机器，它将把两个数字相加。我们只需要一个州，有两条规则。我们的符号将会很简单。在每个州，都有一个逗号分隔的规则列表。因为我们的第一台机器中只有一个状态，所以我们现在只讨论如何写下规则。\n我们州将有一个逗号分隔的规则列表，即规则1、规则2。空格并不重要，因此我们还可以编写规则1、规则2，甚至：\n(与大多数编程语言一样，我们如何使用空格安排程序是为了便于人类阅读而组织布局的问题。)。\n每条规则都有一个操作子句和一个守卫子句，用/分隔，例如：\n/显然类似于除法的表示法，但在Magnificent Minsky Machine中，它实际上并不意味着“除法”，它只是将每个规则中的操作子句与守卫子句分开。\n动作子句和保护子句都有完全相同的符号：形式为(t^s)的一个或多个元组，其中t标识磁头，s标识要移动的方块数量。^字符在一些编程语言中表示幂运算，但在Magnificent Minsky Machine中，它只是一种分隔两个数字的方式。\n(1^1)(4^1)是action子句，它有两个元组：(1^1)表示将磁头1移动1平方，(4^1)表示将磁头4移动1平方。\n(3^1)是保护条款，它说要将磁头3移动一个正方形。\n在Magnificent Minsky机器中，动作子句总是将磁头向前移动，而保护子句总是将磁头向后移动，所以我们不需要让我们的子句使用+或-或指向不同方向的箭头，只要知道/左边的子句是动作子句并将磁头向前移动就足够了，而/右边的子句是保护子句，并且向后移动磁头就足够了。\n现在来看我们的第一台机器：我们的机器只有一种状态1，它有两个规则：\n我们的程序将两个正数相加，我们称之为a和b。它有三盘磁带，1、2和3。为了设置机器，我们将磁头1放在磁带的开头，将磁头2a正方形放在前面，将磁头3b放在正方形前面。当机器停止时，磁头1将是a+b正方形向前，而磁头2和3将在开始处。\n我们可以用它将数字2+2相加，看看是否会得出4。我们将如何以图形方式显示磁头的位置：21。\n这表明磁头1在开始处，而磁头2和3在前面两个正方形处，即开始处\n..", "note_en": "On April 8, 2020,  John Horton Conway developed symptoms of COVID-19. On April 11, 2020, he succumbed to the disease.  1  2  3  4\n Like so very, very many, I mourn Conway’s passing, and yet I also celebrate his life. I celebrate his accomplishments, I celebrate his curiosity, and I celebrate his skill at making important topics in mathematics engaging and interesting.\n One of the finest examples of that skill is the programming language FRACTRAN, the subject of this essay.\n Conway touched my own life from early days. As I described in  The Eight Queens Problem… and Raganwald’s Unexpected Nostalgia:\n My mother had sent me to a day camp for gifted kids once, and it was organized like a university. The “students” self-selected electives, and I picked one called  Whodunnit. It turned out to be a half-day exercise in puzzles and games, and I was hooked.\n  Where else would I learn about playing tic-tac-toe in a hypercube? Or about liars and truth-tellers? Or, as it happened, about  Martin Gardner? I suspect the entire material was lifted from his collections of columns, and that suited me down to the ground.\n One of the things we talked about in “Whodunnit” was  Conway’s Game of Life. I recall hearing about it there, but I also don’t recall playing with it much. There was a lot going on, and it’s entirely possible that I was too busy falling in love with Raymond Smullyan to have curiosity left over for John Conway.  5  6  7\n    I went on to rediscover Conway’s Game of Life several times in my life. We talked of in university. And years later, I read William Poundstone’s  The Recursive Universe: Cosmic Complexity and the Limits of Scientific Knowledge, and it literally blew my mind:\n Along the way, I learned a little about Game Theory. I loved games of all kinds, and I think I spotted  Games of Strategy: Theory and Applications in a library and picked it up, thinking it would help my Backgammon.\n That led me to Conway’s  On Numbers and Games, and via parallel paths, to  Surreal Numbers. Like the Game of Life, Surreal Numbers keep popping up unexpectedly, reigniting my interest in how the way we represent data, affords or hinders working with that data.\n                          In 1987, Conway contributed  FRACTRAN: A SIMPLE UNIVERSAL PROGRAMMING LANGUAGE FOR ARITHMETIC to a special workshop on problems in communication and computation conducted in the summers of 1984 and 1985 in Morristown, New Jersey, and the summer of 1986 in Palo Alto. California. FRACTRAN itself was not an important open problem in the field, but as the editors of the published papers noted:\n Perhaps the most entertaining of all the contributions is Conway’s fascinating article on FRACTRAN, a strange collection of numbers, which when operated on in a simple way, yield all possible computations. We begin with his article.\n –Thomas M. Cover &amp; B. Gotinath, “Open Problems in Communication &amp; Computation”  10\n  As Wikipedia notes, a FRACTRAN program is an ordered list of positive fractions together with an initial positive integer input  n. The program is run by updating the integer  n as follows:\n for the first fraction  f in the list for which  nf is an integer, replace  n by  nf\n  repeat this rule until no fraction in the list produces an integer when multiplied by  n, then halt.\n For example, this is a FRACTRAN program for computing any Fibonacci number:  17/65,  133/34,  17/19,  23/17,  2233/69,  23/29,  31/23,  74/341,  31/37,  41/31,  129/287,  41/43,  13/41,  1/13,  1/3.  11\n All FRACTRAN programs also start with an initial value for  n. That value is sometimes a constant, and sometimes provided by the user. When it’s provided by the user, there is sometimes a need to prepare  n to make it usable.\n In this program’s case, to compute  fib(x) for some value of  x, we compute  n = 78 * 5^(x - 1).\n Let’s use this program to compute  fib(7). We start with  n = 78 * 5^(7-1), which is  1,218,750. We’ll follow along for a while to get the feel for what happens:  12\n The first fraction in the program is 17/65. 1,218,750 multiplied by 17/65 is 318,750, so we replace 1,218,750 with 318,750 and begin again.\n  The first fraction in the program is 17/65. 318,750 leaves a remainder when divided by 65, so we move on.\n  The next fraction in the program is 133/34. 318,750 multiplied by 133/34 is 1,246,875, so we replace 318,750 with 1,246,875 and begin again.\n  The next fraction in the program is 13/41. 24,576 leaves a remainder when divided by 41, so we move on.\n  The next fraction in the program is 1/13. 24,576 leaves a remainder when divided by 13, so we move on.\n  The next fraction in the program is 1/3. 24,576 multiplied by 1/3 is 8,192, so we replace 24,576 with 8,192 and begin again.\n 8,192 is an important number, because  none of the divisors divide evenly into 8,192. So we see\n The first fraction in the program is 17/65. 8,192 leaves a remainder when divided by 65, so we move on.\n  The next fraction in the program is 133/34. 8,192 leaves a remainder when divided by 34, so we move on.\n  The next fraction in the program is 17/19. 8,192 leaves a remainder when divided by 19, so we move on.\n  The next fraction in the program is 13/41. 8,192 leaves a remainder when divided by 41, so we move on.\n  The next fraction in the program is 1/13. 8,192 leaves a remainder when divided by 13, so we move on.\n  The next fraction in the program is 1/3. 8,192 leaves a remainder when divided by 3, so we move on. None of the demoninators in the program divide evenly into 8,192, so the program halts.\n All FRACTRAN programs produce a series of values for  n, and the result we want must be extracted from them. For our Fibonacci program, the values begin with  1,218,750,  318,750,  1,246,875, and  1,115,625, and then end with  221,184,  73,728,  24,576, and  8,192.  13\n In the case of Fibonacci, the result we want is the  log2 of the last value for  n. The last value of  n is 8,192, and  log2(8,192) is  13, the answer we want. The 7th Fibonacci number is 13.\n  The program itself, a finite list of fractions. This program’s list is  17/65,  133/34,  17/19,  23/17,  2233/69,  23/29,  31/23,  74/341,  31/37,  41/31,  129/287,  41/43,  13/41,  1/13, and  1/3.\n  An initial value of  n. This may be a constant, it may be a user-supplied value, or it may be a transformation of a user-defined value. This program’s transformation can be expressed in JavaScript as  n =&gt; 78 * Math.pow(5, n-1).\n  A transformation from the values of  n into the result we want, encoded the way we want it. In our case, it is something like  values =&gt; Math.log2(last(values)) .\n  Writing a FRACTRAN interpreter is very easy. Let’s begin by writing a JavaScript Fibonacci function that uses our FRACTRAN program for its implementation. The main thing we’ll need to watch out for is that that values of  n can grow very, very large, so we will want to use big integers, aka “BigInts.”  14\n One consequence of working with big integers is that many of the things we depend on for numbers no longer work. For example,  Math.log2(8192) =&gt; 13, but  math.log2(8192n) =&gt; TypeError: Cannot convert a BigInt value to a number. We’ll have to write our own  log2 function.\n The same goes for  Math.pow, we’ll have to write our own. Feel free to use these implementations if you like:\n // Any sufficiently complicated function that loops, contains an ad hoc, // informally-specified, bug-ridden, slow implementation of // half of Linear Recursion const  log2  =  ( n )  =&gt;  {  let  result  =  0 n ;  while  ( true )  {  // degenerate condition  if  ( n  ===  1 n )  break ;  // termination conditions  if  ( n  %  2 n  ===  1 n )  return ;  if  ( n  &lt;  1 n )  return ;  //divide and conquer  ++ result ;  n  =  n  /  2 n ;  }  return  result ; } const  pow  =  ( base ,  exponent )  =&gt;  {  if  ( exponent  &lt;  0 n )  return ;  let  result  =  1 n ;  while  ( exponent --  &gt;  0 n )  result  =  result  *  base ;  return  result ; }\n Now go ahead and write your own implementation. Ignore the code below until you’ve written your own.\n // uses log2 and pow from above to formulate the seed and decipher the result const  fib  =  ( x )  =&gt;  {  const  program  =  (  &#39; 17/65, 133/34, 17/19, 23/17, 2233/69, 23/29, 31/23, 74/341, &#39;  +  &#39;  31/37, 41/31, 129/287, 41/43, 13/41, 1/13, 1/3 &#39;  ). split ( / (?:\\s *,| \\s)\\s */ ). map ( f  =&gt;  f . split ( &#39; / &#39; ). map ( n  =&gt;  BigInt ( n )));  let  n  =  78 n  *  pow ( 5 n ,  BigInt ( x )  -  1 n );  program_start :  while  ( true )  {  for  ( const  [ numerator ,  denominator ]  of  program )  {  if  ( n  %  denominator  ===  0 n )  {  n  =  ( n  *  numerator )  /  denominator ;  continue  program_start ;  }  }  break ;  }  return  log2 ( n ); }; fib ( 7 )  //=&gt; 13\n This is very cool. The FRACTRAN program is very small and ridiculously simple: It’s just fractions. And the central FRACTRAN interpreter is also very small: It’s literally a  for loop inside a  while loop, and the  while loop (along with a  break statement) could have been avoided if JavaScript supported  GOTO.  15\n For all its apparent elegance, FRACTRAN appears at first glance to be inscrutable. Is it one of those languages that is neither good for reading nor writing? Or is there a method to the madness of writing a program by composing a list of fractions?\n To answer this question, we must first consider the work of another great mind no longer with us,  Marvin Minsky.\n      In September of 1987,  Stewart Brand published  The Media Lab: Inventing the Future at M.I.T.. To say that the book affected me does not do its impact justice. Like many business and technical hagiographies, it was breathless in its admiration for what M.I.T.–and director Nicholas Negroponte–were trying to do.\n It was also highly revealing: Brand described in detail how the Media Lab was funded by its corporate sponsors, and how the funding model drove research. Their motto was, “Demo or Die,” which meant that the money went to the people who could not only wow their peers, but also provide the stage-magic that would open the wallets of their corporate sponsors.\n I was working in technology Enterprise Sales at the time, and keenly understood that while it’s really difficult to sell sizzle without steak, it’s equally improbable to secure the sale when you have perfectly good steak, but no sizzle.  16\n One of the figures mentioned in The Media Lab was  Marvin Minsky. Minsky was considered a giant in Artificial Intelligence, and Artificial Intelligence was the  tulip mania of the day. History would show that as the book was released, AI funding was starting another of its cyclical collapses, but as I read the book, the magazines and book shelves were groaning under the weight of breathless prose and utopian visions.\n   In 1985, Minsky had published  The Society of Mind, and I bought it on the strength of reading about Minsky in The Media Lab. In 1994, a company called Voyager published a  CD-ROM version of The Society of Mind that I “played” using one of Apple’s quirkier products, a CD-ROM reader and audio-CD player they borrowed from Phillips and branded as  PowerCD.\n One of the features of the CD-ROM was an interactive tour of Minsky’s office. I still vividly recall his discussion of a mirror he had hanging on the wall, and his mention that Feynman had written an  entire book devoted to explaining just one thing: How light  actually reflects off a mirror, and that in this book, he explains why all of the things non-specialists believe about light and reflection are actually false.\n Like Feynman and Conway, Minsky had a talent for explaining challenging ideas. And also like Feynman and Conway, he had made enormous contributions to the progress of human knowledge. One of his areas of research was in computability, and specifically, the study of a certain class of idealized computing machines that are now named  Minsky Machines in his honour.  17  18\n  A  Minsky Machine is an idealized machine that has been proven to be computationally universal. Minsky Machines are part of the family of idealized machines called  Register Machines.\n Like Register Machines and Turing Machines, Minsky machines form a little family, with slight differences between them in the way they are imagined, but all are computationally equivalent. We shall discuss one particularly simple form of Minsky Machine that we shall call the “Magnificent” Minsky Machine.  19\n Like a  Turing Machine, a Magnificent Minsky Machine has a finite number of states. However, instead of having a single tape that stretches to infinity in one or both directions, Magnificent Minsky Machines have a finite number of tapes, each of which stretches to infinity in only one direction.\n Like a Turing Machine, a Magnificent Minsky Machine has a tape-head for each tape, and based on its instructions, can move its tape-heads and change to a different state. Unlike a Turing Machine, a Magnificent Minsky Machine can move its tape-heads any finite amount in either direction. We call these directions forward (“away from the beginning”), and backwards (“towards the beginning”).\n When a Turing Machine matches a particular symbol under its tape-head, it can write a symbol, and it can also move the tape-head one square in either direction.\n Unlike a Turing Machine, a Magnificent Minsky Machine cannot write anything on its tapes, and therefore, does not match anything under its tape-heads. What it can do is test whether it is possible to perform a move. Since it is always possible to move forward, the only test we care about is whether a move backwards is possible.\n Also unlike a Turing Machine, a Magnificent Minsky Machine can move zero  or more of its tape-heads at the same time. Therefore, its test may check whether one or more tape-heads can be moved backwards.\n To give a literal example, if the tape-head is at the beginning, no backwards move is possible. If the tape-head is  n squares forward, all moves backwards &lt;=  n squares are possible, but all moves &gt;  n squares are not possible.\n The net effect of these design choices is that a Magnificent Minsky Machine can store an arbitrary amount of state, just like a Turing Machine, but it stores that state by having each tape-head be an arbitrary distance from the beginning of its tape.  20\n      Let’s write a program using a Magnificent Minsky Machine. Now that we have the general idea of how these machines operate, here is how we will specify each Magnificent Minsky Machine, i.e. How we shall write its “program:”\n Our machine will have a finte number of states, denoted with consecutive positive integers, i.e. 1, 2, 3, …\n    Each rule will be expressed as “Do this, provided that.” Thus, they will have two clauses: An  action clause, and a  guard clause.\n  The action clause shall consist of a set of tape-heads to move forward, and a positive integer for each tape-head stating how many squares to move. We shall note these as tuples of  (tape-identifier^squares-to-move-forward). The action clause is an unordered set of such tuples, with no two tuples in the same rule sharing the same tape-head. The action clause will also include a positive integer indicating the next state to enter.\n  The guard clause shall consist of a set of tape-heads to move backwards, and a positive integer stating how many squares to move towards the beginning. As with the action clause, no two guard clauses in the same rule can share the same tape-head.\n  Because no two clauses in the same rule can share the same tape-head, it follows that no one rule can both test a tape-head in the guard clause and simultaneously move a tape-head in the action clause.\n Our Magnificent Minsky Machine is initialized with the tape-heads being placed in a specific set of positions, so in addition to listing the states and rules therein, the description of a Magnificent Minsky Machine will also include instructions for setting up the initial position of the tape-heads.\n When we wish to run a Magnificent Minsky Machine, we start it in state 1. We operate our machine by scanning the rules within the current state, in order.\n For each rule, we check its guard clause. If it is possible to move all of the tape-heads in the guard clause towards the beginning, the rule “fires,” and we move the tape-heads towards the beginning as specified by the guard clause. We then consult the action clause, and move all of the tape-heads listed away from the end by the amounts listed. Finally, when a rule fires, if it lists a next state, we change to that state and return to scanning the rules within the current state, in order.\n If any rule’s guard clause cannot perform  all of the required movement of tape-heads towards the beginning, the rule fails, and the tape-heads are not disturbed. We then move on and try the next rule in that state’s list, and the next, and so forth. If all of the rules in the current state fail, the machine halts. It follows, trivially, that if the machine enters a state without any rules, it must necessarily halt.\n If the machine attempts to transition to an undefined state, it also halts. An explicit transition to state 0, therefore, is the well-formed way to explicitly halt the machine.\n Now we’re ready to discuss a simple notation for Magnificent Minsky Machines, and to try one out.\n  Consider a Magnificent Minsky Machine that will add two numbers. We will only need one state, with two rules. Our notation will be simple. In each state, there is a comma-separated list of rules. Since we will only have one state in our first machine, we will only discuss how to write down the rules right now.\n Our state will have a comma-sparated list of rules, i.e.  rule1, rule2. Whitespace is not significant, so we could also write  rule1,rule2 or even:\n  (As is usual with most programming languages, how we arrange our program with whitespace is a matter of organizing the layout for human readability.)\n Each rule willl have an action clause and a guard clause, separated with  /, e.g.:\n  The  / obviously resembles the notation for division, but in a Magnificent Minsky Machine, it doesn’t actually mean “divide,” it just separates the action clause from the guard clause in each rule.\n The action clauses and guard clauses both have exactly the same notation: One or more tuples of the form  (t^s), where  t identifies the tape-head, and  s identifies the number of squares to move. The  ^ character means exponentiation in some programming langauges, but in a Magnificent Minsky Machine, it’s just a way of separating two numbers.\n  (1^1)(4^1) is the action clause, and it has two tuples:  (1^1) says to move tape-head 1 by one squre, and  (4^1) says to move tape-head 4 by one square.\n  (3^1) is the guard clause, and it says to move tape-head 3 by one square.\n In a Magnificent Minsky Machine, action clauses always move the tape-heads forward, and guard clauses always move the tapehead backwards, so we don’t need to have our clauses use a  + or  -, or arrows pointing in different directions, it is enough to know that clauses to the left of the  / are action clauses and move the tape-heads forward, while clauses to the right of the  / are guard clauses, and move the tape-heads backwards.\n Now to our first machine: Our machine only has one state,  1, and it has two rules:\n  Our program adds two numbers positive numbers, which we shall call  a and  b. It has three tapes, 1, 2, and 3. To set the machine up, we place tape-head 1 at the beginning of its tape, tape-head 2  a squares forward, and we place tape-head 3  b squares forward. When the machine halts, tape-head 1 will be  a + b squares forward, while tape-heads 2 and 3 will be at the beginning.\n We can use it to add the numbers 2+2, and we’ll see if it comes up with 4. Here’s how we’ll show the position of the tape-heads graphically:  21\n  This shows that tape-head 1 is at the beginning, while tape-heads 2 and 3 are two squares forward, the beginnin\n......", "posttime": "2020-05-12 01:38:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "深奥,john,磁头", "title": "还记得约翰·康威的“弗拉特兰”吗？这是一种可笑却出奇深奥的语言。", "title_en": "Remembering John Conway's FRACTRAN, a ridiculous yet surprisingly deep language", "transed": 1, "url": "http://raganwald.com/2020/05/03/fractran.html", "via": "", "real_tags": ["深奥", "john", "磁头"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001681, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Apache NiFi支持强大且可伸缩的数据路由、转换和系统中介逻辑有向图。Apache NiFi的一些高级功能和目标包括：", "note_en": "Apache NiFi supports powerful and scalable directed graphs of data routing, transformation, and system mediation logic. Some of the high-level capabilities and objectives of Apache NiFi include:", "posttime": "2020-05-12 01:38:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "阿帕奇,apache,nifi", "title": "阿帕奇NiFi", "title_en": "Apache NiFi", "transed": 1, "url": "http://nifi.apache.org/index.html", "via": "", "real_tags": ["阿帕奇", "apache", "nifi"]}, {"category": "", "categoryclass": "", "imagename": "eab4de15a74c7fe4bf69f7651093b302.png", "infoid": 1001680, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "WebRecorder为您浏览的任何网页创建交互式副本，包括您的交互(如播放视频和音频、滚动、单击按钮等)所显示的内容。\nwebrecorder.io提供5 GB存储空间的免费账户。通过成为网络记录器的支持者，获得更多，并为网络记录器的发展做出贡献。\n不想注册吗？下载桌面应用程序即可在您自己的计算机上收集和访问存档网页，无需帐户。\n当您重新登录网站时，捕获您在网站上看到的内容，并在不透露您的凭据的情况下共享存档页面。\nWebRecorder的远程浏览器功能提供对WebRecorder服务器上运行的一系列预配置浏览器的访问。它们提供最全面的网络流量捕获，并支持闪存。\n网络记录器项目是由新博物馆的Rhizome发起的一个开源项目。我们的使命是让所有人都能访问高保真的网络存档。\n以下是我们开发的其他一些工具。这里提供了WebRecorder生产的可重用软件组件的广泛列表。\n了解更多网络记录器是根茎的一个项目，根茎是一个注册了501(C)(3)的非营利性组织。你的捐款是免税的。\n即使您处于脱机状态，也可以使用此桌面Web存档查看器浏览导出的收藏。\nWebRecorder为Web存档提供了一系列可重用的开源软件组件，所有这些组件都可以在GitHub上获得。", "note_en": "Webrecorder creates an interactive copy of any web page that you browse, including content revealed by your interactions such as playing video and audio, scrolling, clicking buttons, and so forth.\n  Webrecorder.io offers free accounts with 5GB of storage. Get more and contribute to Webrecorder&#39;s development by  becoming a supporter.\n Don&#39;t want to register?  Download Desktop App to collect and access archived web pages on your own computer, no account necessary.\n    Capture what you see on websites when you&#39;re logged into them, and share archived pages without revealing your credentials.\n      Webrecorder&#39;s Remote Browser feature provides access to a range of preconfigured browsers running on the Webrecorder server. They offer for the most thorough capture of network traffic, and support for Flash.\n The Webrecorder project is an open source initiative by Rhizome at the New Museum. Our mission is to make high-fidelity web archiving accessible to all.\n Here are some other tools we have developed. An extensive lists of re-usable software components produced by Webrecorder is available here.\n Learn more Webrecorder is a project of Rhizome, a registered 501(c)(3) non-profit organization. Your donations are tax-deductible.\n  Use this desktop web archive viewer to browse exported collections, even when you are offline.\n Webrecorder produces a range of re-usable open source software components for web archiving, all of which are available on GitHub.", "posttime": "2020-05-12 01:38:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "记录器,interactive,存档", "title": "网络记录器：为您浏览的任何网页制作交互式副本", "title_en": "Webrecorder: Make an interactive copy of any web page that you browse", "transed": 1, "url": "https://webrecorder.io/", "via": "", "real_tags": ["记录器", "存档"]}, {"category": "", "categoryclass": "", "imagename": "8bcbf4725023a3732c4df5d7ba9a7676.png", "infoid": 1001679, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "电是我们一天中不断遇到的一种常见现象。几乎每个人都熟悉电气技术。我们也经历过穿过铺着地毯的房间并接地到金属(可能是门把手)后产生的弧形静电火花。我们曾在雷雨中感受到令人难以置信的闪电威力。然而，当我们去了解这些事件期间到底发生了什么时，我们通常会遇到两种有点迟钝的形象之一：第一种是水压模型，另一种是闪电。或者，当我们去了解这些事件中到底发生了什么时，我们通常会遇到两种有点迟钝的形象：第一种是水压模型，另一种是。电势(电压)相当于管道中的压力，在管道中电流是水流。在后者中，电是由称为电子的小珠子沿着导线传播而产生的。但这两种可视化都有它们的优点。水压模型帮助我们构思出像电位和电阻这样的抽象概念-但显然电路的导线、电容器和电阻与大坝、管道和收缩管道的结构几乎没有相似之处。电子珠子模型是高度相似的。但是，电子珠子模型是高度相似的。但是，电子珠子模型是高度相似的。但是，水压模型帮助我们构思出像电位和电阻这样的抽象概念--然而很明显，电路中的导线、电容器和电阻与大坝、管道和收缩管道的结构几乎没有什么相似之处。除了本身缺乏可视化的自我参照概念“电荷”之外，为了解决这些缺点，我们提出了以下动画：将电作为原子上的电子壳层之间的表面到表面的旋转齿轮(见下面的电影)。“这不是万能的可视化，而是希望朝着正确的方向迈出几步。”\n任何物理概念都是在能想象到的最简单的条件下首先被理解的。后来，在我们获得一个现象的基本内部工作原理后，我们可以将这些原理扩展到其他越来越复杂的情况。因此，解释包括电在内的原子间现象需要从最简单的原子开始：氢气。氢气构成了现有物质的大部分，以其电离的形式能够在星际宇宙中容纳巨大的电流。氢只有一个电子，主要存在于原子核的某些径向距离内。这个电子，通常被称为电子云，是原子表面位置的同义词。虽然大约99.999的电子存在于原子核的430pm以内，但找到延伸到令人难以置信的距离的表面的可能性很小。事实上，根据量子力学，电子的径向分布函数没有距离限制。对于我们的模型，我们将电子壳层的这些扩展表示为。\n下面(图2)所示的电路由单列氢原子组成。我们可以认为氢原子是电离的，并将其说明为网状电子壳层。这是另一种显示原子间共享电子的方式。我们看到两端的电子柱相对旋转。这种旋转说明了角动量的凝聚方向性。电子壳层的内聚角动量解释了“电荷”的概念。“在本例中，顺时针(CCW)旋转表示正电荷(+)，逆时针(CW)表示负(-)电荷。将符号任意分配给CW或CCW旋转并不重要，由于关于电荷方向性的约定在历史上一直在徘徊，其基本特征是，平均而言，在电路中(+)和(-)带电终端之间，内聚旋转的方向是相反的。\n电荷也是一个有标度的量。在图示的电路中，电子在(-)端子的旋转速度比(+)快。这不是关于(+)和(-)带电端子的一般特征，而是对电势概念的说明更特殊。快速旋转的壳层比旋转较慢的壳层代表更大的电子动量，因此在电学上更有生产力。*在量子力学下，不可能精确地区分速度和方向性对电子动量的贡献，因此我们的可视化简化了动量的概念。*在量子力学下，不可能精确地区分速度和方向性对电子动量的贡献，因此我们的可视化简化了动量的概念。每个终端的电子之间的方向性)表示电压或电位的概念。终端之间的电压降越大，一旦两个终端接触，产生的电流就越大。因此，电流是这样一个过程，即更大的动量电子壳层(更快，更有凝聚力)激发较弱的(更慢的，更不粘合的)壳层运动。当两个终端接触时，新接触的柱子之间的动量转移以接近光速的速度迅速发生。然而，如果原子保持不变，它们的电子继续以很大的速度旋转。但是，当两个终端进行接触时，新接触的柱子之间的动量转移发生得很快，接近光速。然而，如果原子保持不动，它们的电子继续以很大的速度旋转", "note_en": "Electricity is a common phenomenon that we encounter continually throughout the day.  Almost everyone is acquainted with electrical technology.  We have also experienced sparks from arc’ed static electricity after walking across a carpeted room and grounding to metal, perhaps a doorknob.  We have taken in the incredible power of lightning during a thunderstorm.  And yet, when we go to find out what is actually happening during these events, we are generally met with one of two somewhat obtuse visualizations:  The   water pressure model or the   electron-bead model.  Both are analogies by degree.  In in the former, electric potential (voltage) is comparable to pressure in a pipe where current is flow of water.  In the latter, electricity results from little beads called electrons that travel down a wire.    Both of these visualizations have their merits.  The water-pressure model helps us conceive of abstract concepts like potential and resistance — and yet clearly the wires, capacitors, and resistors of electrical circuitry bear little resemblance to the structures of dams, pipes, and constricting conduits.  The electron-bead model is highly accurate in terms of quantitative accounting, but it stretches the imagination as to how a moving bead actually produces motive pressure, other than the self-referential concept of “charge,” which itself lacks visualization.  To address these shortcomings, we propose the following animation:  Electricity as surface-to-surface rotational gearing between electron-shells on atoms (see  movie below).  This is not the end-all-be-all visualization, but hopefully a few steps in the right direction.\n  Any physical concept is best first understood under the simplest conditions imaginable. Later, after we gain access to the basic inner workings of a phenomenon, we can extend these principles to other situations of greater and greater complexity.  For this reason, explanation of inter-atomic phenomena, including electricity, need to begin with the simplest atom:  hydrogen.  Hydrogen constitutes the majority of the material in existence, and in its ionized form is capable of hosting gargantuan currents throughout the interstellar cosmos.  Hydrogen has one electron, which exists predominantly within certain radial distances of the nucleus.  This electron, often referred to as the electron cloud, is synonymous with the location of the surface of the atom.  While   99.999% of the electron exists within 430 pm of the nucleus, there is a small chance of finding the surface extended to incredible distances.  In fact, under Quantum Mechanics,   the radial distribution function for the electron has no limit on distance.  For our model, we represent these extensions of the electron shell as incredibly thin filaments, radially organized about the atom, as shown below in  Figure 1:\n  The circuit shown below ( Fig 2) is composed of single-file hydrogens.  We can consider the hydrogens   ionized and illustrate this as enmeshed electron shells.  This is another way of showing shared electrons between atoms.  We see that the electron columns at either terminal rotate opposite.  This rotation illustrates cohesive directionality of angular momentum.  Cohesive angular momentum of the electron shell explains the concept of “charge,” where in this example clockwise (CCW) rotation represents positive (+) charge and counter-clockwise (CW) is negative (-) charge.  The arbitrary assignment of sign to CW or CCW rotation is unimportant, as the conventions concerning directionality of charge   have wandered throughout history.  The essential feature is that, on average, the direction of cohesive rotation is in opposition between (+) and (-) charged terminals in a circuit.\n Charge is also a scaled quantity.  In the illustrated circuit, electrons rotate faster at the (-) terminal than the (+).  This is not a general feature concerning (+) and (-) charged terminals but is rather particular to illustration of the concept of   electric potential.  Fast rotating shells represent greater electron momentum, and hence electrically more productive shells, than those depicted with slower rotation.  Under quantum mechanics it is not possible to precisely separate   the contribution of speed and directionality to electron momentum, so our visualization simplifies momentum to speed of rotation.   Together, the difference in electron momentum (speed, directionality) between electrons at each terminal signifies the concept of voltage, or electric potential.    The greater the voltage drop between terminals, the greater the current produced once the two make contact.  Therefore, current is the process where greater momentum electron shells (faster, more cohesive) incite weaker (slower, less cohesive) shells into motion.  When the two terminals make contact, the momentum transfer between the newly engaged columns occurs rapidly, at near light speeds.  The atoms stay put, however, and their electrons continue to rotate at much less ferocious speeds.  This is the concept of   drift velocity.\n  It’s important to recognize this visualization is a highly simplified model of electricity.  We simplify the differences in charge constituting voltage with directional rotation speed.  In reality, while charge  is quantized since an object can only rotate one way or the other with respect to some arbitrary axis, electron angular momentum is a continuous concept.  For instance, electron momentum could deconstruct to cohesion of surface rotation and/or it could reflect rotational speed, but these are indistinguishable to the theorist and experimenter alike.  In any event, it is apparent that the actual electron shells   are, in fact, rotating.  Also, if we look at more complex atoms we find additional electrons.  We would visualize these   additional electrons as additional polarized shells that can productively interact with neighboring atoms.  The conducting metals in real wires, for instance, have multiple polar lobes constituting their electron shells.  These complex electron shapes are mathematically described by the concept of   orbitals.  The unique multi-lobed structure of p- and d-type orbitals on a metal atom is perhaps why they are such effective conductors.  Each pair of polar surfaces within an orbital is able to productively contact neighboring atoms.  Also, actual wiring in modern technology often utilizes alternating, rather than the illustrated direct-type, current.  Our visualization is easily extended to alternating current by having the atoms move back and forth instead of unidirectionally — a motion which is equally capable of providing motive force at a distance through a circuit.  This visualization is just a starting point for the imagination.  It is not perfect, but it moves things in the right direction.  For example, it has some serious advantages over the traditional visualizations like the “electron bead flow” and “water-pressure analogy.”  Unlike these traditional models, we are invoking real structural understanding of the atom to sum up the phenomenon of electricity.  The bead-model of the electron, also called the Bohr model of the atom, has been seriously disregarded for several decades in favor of valence shells, which we reference exclusively.  The water-model illustrates potential and current well, but the analogy also fails to join what is structurally clear about the atom from quantum theory.  Here we hope to have included these oversights into a cohesive visualization by providing for the concepts of charge, voltage, and current with simple hydrogen atoms moving one another through basic surface-to-surface contact.", "posttime": "2020-05-12 01:37:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "形象化,visualizing,电子", "title": "将电形象化", "title_en": "Visualizing Electricity", "transed": 1, "url": "https://demystifyingscience.com/blog/how-to-visualize-electricity", "via": "", "real_tags": ["形象化", "电子"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001678, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Anki销毁了我的历史记录，将废弃的历史记录上传到同步服务器，然后每次我试图从备份中还原时，我都会反复重新同步这些废弃的历史记录，然后我编写了自己的间隔重复应用程序。它从标记文件中读取输入，在终端中询问问题，并将状态存储在json文件中。我在一个下午写了几百行代码，从那以后我就一直在用它。\n我也想在我的Android手机上运行它，但经过几天的挣扎和几个千兆字节的IDE下载，我失去了兴趣。\n这是我的典型经验。扩展和定制我的笔记本电脑是一件例行公事。扩展和定制我的手机是如此痛苦，以至于我每次都放弃。我笔记本电脑上的软件感觉就像一只舒适的旧靴子，经过多年的调整和脚本编写，穿上了。我手机上的软件感觉就像一台老虎机，每月移动一次所有的按钮，在广告播放时让我睁开眼睛。它又亮又亮，但它不在我这边。\nPinephone是一款售价150美元的手机，旨在能够运行主线Linux。我买了一台，希望创造一种更像使用笔记本电脑的体验。\n显然，编写一套完整的手机套装是一项大工程，因此，我会坚持不懈地尽可能偷工减料，并采用简洁美观的功能。\n我装了移动电话。当时的医生非常简陋，但Samueldr非常友好，通过IRC向我介绍了这一过程，我在这里写下了这个过程。\n我还没有开始编写系统配置，但是一旦我这样做了，它将是使用nixops ploy-d Focus的一次单击部署-这比LineageOS更新过程有了很大的改进。默认配置如下所示。\n因为手机运行的是普通的Linux用户，所以可以直接在手机上编译。但是我的笔记本电脑的编译速度大约快了10倍，所以似乎值得投资于交叉编译。\n第一步是获得我所有依赖项的arm64版本。这是在shell.nix中完成的。\n我固定nixpkgs的版本，以确保本地和远程开发使用每个依赖项的完全相同的版本。\nNIX最近获得了对交叉编译的支持，但是很多包还没有成功地交叉编译。所以诀窍是设置交叉编译，但是从本地的arm64repo获取一些包。这些不会在非arm64机器上从源代码构建，但是nixpkgs二进制缓存中有预构建的版本。\narmPkgs=import nixpkgs{system=&#34；aarch64-linux&#34；；}；CrossPkgs=import nixpkgs{CroSystem=hostPkgs。利布。系统。举例说明。aarch64-多平台；overays=[(Self：Super：{Inherit(ArmPkgs)GCC台面libGLSDL2；})]；}；\n大多数配置在本地构建和跨构建之间共享，因此shell.nix接受一个布尔参数来告诉它我们正在尝试什么。\n我们需要可在主机上运行的pkgconfig和patchelf，因为它们在编译期间使用。我们需要在目标机器上可运行的libGL和SDL2进行链接。\n现在，我们可以执行nix-shell以放入shell设置中进行本地编译，或者执行nix-shell--arg cross true以放入shell设置中进行交叉编译。\n我把每件事都写得有条不紊，因为我想让整个系统保持小巧、简单和快速。Zig是一种小型、简单、快速的语言，它也非常关心交叉编译。\n唯一的问题是它在交叉编译时很难使用pkgconfig找到头文件。我还没有试着调试这个--只是直接传递了它们。\n..。try include deNix(exe，&#34；NIX_LIBGL_DEV&#34；)；try include deNix(exe，&#34；NIX_SDL2_DEV&#34；)；.fn include deNix(exe：*std.build.LibExeObjStep，env_var：[]const U8)！void{var buf=std.ArrayList(U8).init(allocator。exe.addIncludeDir(buf.item)；}。\nZig也没有在生成的二进制文件中正确设置路径，但这是合理的-它没有办法知道我正在交叉编译到相同的NIX系统，所以它默认使用一些合理的启发式方法。我只是在编译后修补二进制文件。\n然后，构建过程要么是本地ZIG构建，要么是跨&amp；&amp；./sync的ZIG构建。\n因为笔记本电脑和手机都运行相同的操作系统，具有相同的固定依赖关系，所以我不会费心使用虚拟机进行本地开发。我只需用代码模拟设备传感器，其他一切都会一样运行。\n我正在编写一个即时模式的GUI库，因为我发现它们在代码行和智力开销方面都比大多数保留的系统简单得多。我们的机械公司最近在GDC上发表了一次演讲，阐述了这一理论基础。\n电池使用率经常受到关注，但在我的笔记本电脑上，这个应用程序一直徘徊在1%的CPU左右，而每当我按下按钮时，GNOME计算器就会达到20%-30%。如果这成为更复杂的UI的问题，我可以在绘图命令层添加一些缓存。\n肯定有一些事情很难在即时模式下做好，比如复杂的反应性布局，但幸运的是，这些都不是我关心在手机上做的事情。\n我从Microui复制了我的渲染器和字体图集，我已经构建了足够的UI库来运行。以下是这款间隔重复应用的整个用户界面：\nif(ui.key orelse0==&#39；Q&#39；){尝试保存日志(self.logs.item)；std.os.exit(0)；}常量白色=UI.color{.R=255，.g=255，.B=255，.a=255}；var TEXT_RECT=RECT；var BUTTON_RECT=text_rect.splitBottom(atlas.text_height)；switch(self.state){.Prepare=&gt；{try ui.text(text_rect，White，try format(allocator，&#34；{}PENDING&#34；，.{self.queue e.len}))；if(try ui.button(button_rect，White，&#34；Go&#34；)){self.state=.Prompt；}，.Prompt=&gt；{const next=self.queue[0]；const text=try format(allocator，&#34；){self.state=.Prompt；}，.Prompt=&gt；{const next=self.queue[0]；const text=try format(allocator，&#34；)。{}\\n\\n(紧急性={}，间隔={})&#34；，.{next.cloze.renders[next.state.ender_ix]，next.state.urgency，next.state.interval_ns})；尝试ui.text(text_rect，White，text)；if(try ui.button(button_rect，White，&#34；show&#34；){self.state=.Reval；}}，.Reval=&Get。尝试ui.text(RECT，白色，Try Format(allocator，&#34；{}&#34；，.{next.cloze.text}))；var event_o：？Log.Event=null；var misse_rect=button_rect；var Hit_rect=misse_rect.plitRight(@divTrunc(misse_rect.w，2))；if(try ui.button(misse_rect，White，&#34；misse&。}if(try ui.button(Hit_rect，White，&#34；Hit&#34；)){event_o=.hit；}if(Event_O)|event|{try self.logs.append(.{.at_ns=std.time.milliTimestamp()*1_000_000，.cloze_text=next.cloze.text，.ender_ix=next.state.ender_ix，.event=event，})；self.queue=。if(self.queue e.len==0){self.queue=try sortByUrgency(&amp；self.frame_arena，self.cloze，self.logs.item)；self.state=.Prepare；}Else{self.state=.Prompt；}}，}。\n我真的很喜欢它是直接的代码，而不是分散在多个文件、类或回调中。你可以从上到下看。如果我想对某个组件或布局进行抽象，我只需将其放入一个函数中即可。\n显然，要改进抗锯齿、字体、布局等方面需要做很多工作，但我认为可以在不使上面的界面复杂化的情况下完成这些工作。", "note_en": "After anki trashed my history, uploaded the trashed history to the sync server, and then repeatedly re-synced the trashed history every time I tried to restore from backup, I wrote my own spaced repetition app. It reads input from a markdown file, asks questions in the terminal and stores state in a json file. I wrote those few hundred lines of code in an afternoon and I&#39;ve been using it ever since.\n I wanted to run it on my android phone too, but after several days of struggling and several gigabytes of IDE downloads I lost interest.\n This is my typical experience. Extending and customizing my laptop is a routine affair. Extending and customizing my phone is so painful that I give up every time. The software on my laptop feels like a comfortable old boot, worn in over years of tweaking and scripting. The software on my phone feels like a slot machine that moves all the buttons around once a month and holds my eyes open while the ads play. It&#39;s shiny and polished, but it isn&#39;t on my side.\n  The  pinephone is a $150 mobile phone that aims to be able to run mainline linux. I bought one hoping to create an experience more like the experience of using my laptop.\n Obviously writing an entire mobile suite is a big project, so I&#39;m relentlessly cutting corners wherever possible and adopting an aesthetic of simplicity &gt; capability.\n    I installed  mobile-nixos. The docs at the time were very barebones but  samueldr was kind enough to walk me through it over irc and I wrote down the process  here.\n I haven&#39;t gotten around to writing a system configuration yet, but once I do it will be a single-click deploy with  nixops deploy -d focus - a big improvement over the  LineageOS update process. The default configuration looks like  this.\n  Since the phone is running a normal linux userland it is possible to compile directly on the phone. But my laptop compiles things ~10x faster so it seemed worth investing in cross-compilation.\n The first step is getting hold of arm64 versions of all my dependencies. This is done in  shell.nix.\n I pin the version of nixpkgs to make sure that both local and remote development use the exact same version of each dependency.\n  Nix recently gained support for cross-compilation but many packages don&#39;t cross-compile successfully yet. So the trick is to setup for cross-compilation, but grab some packages from the native arm64 repo. These won&#39;t build from source on a non-arm64 machine but there are pre-built version available in the nixpkgs binary cache.\n armPkgs  =  import  nixpkgs  {  system  =  &#34;aarch64-linux&#34; ;  } ;  crossPkgs  =  import  nixpkgs  {  crossSystem  =  hostPkgs . lib . systems . examples . aarch64-multiplatform ;  overlays  =  [( self :  super : {  inherit  ( armPkgs )  gcc mesa libGL SDL2  ;  })] ;  } ;\n Most config is shared between local and cross builds, so  shell.nix takes a boolean argument that tells it which we&#39;re attempting.\n  We need pkgconfig and patchelf runnable on the host machine because they are used during compilation. And we need libGL and SDL2 runnable on the target machine to link against.\n  Now we can do  nix-shell to drop into a shell setup for local compilation, or  nix-shell --arg cross true to drop into a shell setup for cross compilation.\n  I wrote everything in  zig because I&#39;m trying to keep the whole system small, simple and fast. Zig is a small, simple, fast language that also cares a lot about cross-compilation.\n  The one hitch is that it struggled to find headers using pkgconfig when cross-compiling. I haven&#39;t tried to debug this - just passed them directly instead.\n    ... try includeNix(exe, &#34;NIX_LIBGL_DEV&#34;); try includeNix(exe, &#34;NIX_SDL2_DEV&#34;);...fn includeNix(exe: *std.build.LibExeObjStep, env_var: []const u8) !void { var buf = std.ArrayList(u8).init(allocator); defer buf.deinit(); try buf.appendSlice(std.os.getenv(env_var).?); try buf.appendSlice(&#34;/include&#34;); exe.addIncludeDir(buf.items);}\n Zig also didn&#39;t set paths correctly in the resulting binary but this is reasonable - there is no way for it to know that I&#39;m cross-compiling to an identical nix system so it defaults to some reasonable heuristics. I just patch the binary after compilation.\n     The build process is then either  zig build local or  zig build cross &amp;&amp; ./sync.\n Since both laptop and phone are running the same operating system with the same pinned dependencies I don&#39;t bother to use a virtual machine for local development. I can just mock out the device sensors in code and everything else will run the same.\n  I&#39;m writing an immediate-mode GUI library because I find them much simpler than most retained systems, in terms of both lines of code and mental overhead. Our Machinery recently gave a  GDC talk that lays out the rationale.\n Battery usage is often given as a concern, but on my laptop this app hovers around 1% cpu at all times whereas gnome-calculator reaches 20-30% whenever I press buttons. If this becomes a problem with more complex UIs I can add some caching at the draw command layer.\n There are definitely some things that may be difficult to do well in immediate-mode, like complex reactive layouts, but luckily they aren&#39;t things that I care about doing on my phone.\n I copied my  renderer and  font atlas from  microui and I&#39;ve built just enough UI library to get things working. Here is the entire UI for the spaced repetition app:\n if (ui.key orelse 0 == &#39;q&#39;) { try saveLogs(self.logs.items); std.os.exit(0);}const white = UI.Color{ .r = 255, .g = 255, .b = 255, .a = 255 };var text_rect = rect;var button_rect = text_rect.splitBottom(atlas.text_height);switch (self.state) { .Prepare =&gt; { try ui.text(text_rect, white, try format(allocator, &#34;{} pending&#34;, .{self.queue.len})); if (try ui.button(button_rect, white, &#34;go&#34;)) { self.state = .Prompt; } }, .Prompt =&gt; { const next = self.queue[0]; const text = try format( allocator, &#34;{}\\n\\n(urgency={}, interval={})&#34;, .{ next.cloze.renders[next.state.render_ix], next.state.urgency, next.state.interval_ns } ); try ui.text(text_rect, white, text); if (try ui.button(button_rect, white, &#34;show&#34;)) { self.state = .Reveal; } }, .Reveal =&gt; { const next = self.queue[0]; try ui.text(rect, white, try format(allocator, &#34;{}&#34;, .{next.cloze.text})); var event_o: ?Log.Event = null; var miss_rect = button_rect; var hit_rect = miss_rect.splitRight(@divTrunc(miss_rect.w, 2)); if (try ui.button(miss_rect, white, &#34;miss&#34;)) { event_o = .Miss; } if (try ui.button(hit_rect, white, &#34;hit&#34;)) { event_o = .Hit; } if (event_o) |event| { try self.logs.append(.{ .at_ns = std.time.milliTimestamp() * 1_000_000, .cloze_text = next.cloze.text, .render_ix = next.state.render_ix, .event = event, }); self.queue = self.queue[1..]; if (self.queue.len == 0) { self.queue = try sortByUrgency(&amp;self.frame_arena, self.clozes, self.logs.items); self.state = .Prepare; } else { self.state = .Prompt; } } },}\n I really like that it&#39;s just straight code - not split across multiple files or classes or callbacks. You can just read it from top to bottom. If I want to abstract over some component or layout I can just put it in a function.\n Obviously it needs a lot of work to improve anti-aliasing, fonts, layout etc, but I think those can be done without complicating the interface above.", "posttime": "2020-05-12 01:37:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "pinephone,手机", "title": "Pinephone第一步", "title_en": "Pinephone first steps", "transed": 1, "url": "https://scattered-thoughts.net/writing/pinephone-first-steps/", "via": "", "real_tags": ["pinephone", "手机"]}, {"category": "", "categoryclass": "", "imagename": "bc1c686e709d1c953be460cf42da4708.jpeg", "infoid": 1001677, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几年里，文章和博客文章开始问同样的问题：“为什么所有的网站看起来都是一样的？”\n这些帖子通常会指出一些常见的设计元素，从带有叠加文本的大图片到汉堡菜单，这是三条水平线，当点击时，会显示可供选择的页面选项列表。\n我的同事巴迪亚·杜斯蒂(Bardia Doosti)、大卫·克兰德尔(David Crandall)、诺曼·苏(Norman Su)和我正在研究网络的历史，这时我们开始注意到这些帖子突然出现。不过，没有一位作者做过任何形式的实证研究。这更多的是他们的预感。\n我们决定对这一说法进行调查，看看网站开始看起来一样的说法是否属实，如果是这样的话，探索为什么会发生这种情况。因此，我们进行了一系列数据挖掘研究，仔细检查了1万个网站上的近20万张图片。\n要研究整个互联网几乎是不可能的；有超过10亿个网站，有很多倍于此的网页。由于没有可供选择的全部列表，因此随机进行互联网抽样是不可能的。即使这是可能的，大多数人也只是定期访问这些网站的一小部分，所以随机抽样可能甚至不会像大多数人经历的那样捕捉到互联网。\n我们最终使用了罗素1000(Russell 1000)的网站，这是美国市值最高的企业，我们希望它能代表主流企业网页设计的趋势。我们还研究了另外两组网站，一组是Alexa的500个流量最大的网站，另一组是获得Webby Awards提名的网站。\n因为我们对这些网站的视觉元素感兴趣，所以我们使用了定期保存网站的互联网档案馆(Internet Archive)提供的他们网页的图片作为数据。因为我们想要收集对比数百万个网站对的定量数据，所以我们需要自动化分析过程。\n要做到这一点，我们必须确定一个我们可以自动测量的“相似性”的定义。我们调查了颜色和布局等特定属性，以及使用人工智能从数据中自动学习的属性。\n对于颜色和布局属性，我们测量了将一个网站的配色方案或页面结构转换为另一个网站需要进行的逐个像素的编辑次数。对于人工智能生成的属性，我们训练了一个机器学习模型，根据图像来自哪个网站对图像进行分类，并测量模型学习到的属性。我们之前的工作表明，这在度量风格相似性方面做得相当好，但是人类很难理解模型关注的是什么属性。\n我们发现，在所有三个指标-颜色、布局和人工智能生成的属性-网站之间的平均差异在2008年至2010年达到峰值，然后在2010年至2016年下降。布局差异减少的最多，在这段时间内下降了30%以上。\n这些发现证实了网页设计博客作者的怀疑，即网站正在变得越来越相似。在展示了这一趋势之后，我们想要研究我们的数据，看看是什么具体的变化导致了这一趋势。\n您可能认为这些站点只是复制彼此的代码，但随着时间的推移，代码相似性实际上已显著降低。然而，软件库的使用增加了很多。\n库以常见任务的通用代码集合为特色，例如为移动设备调整页面大小或制作汉堡菜单滑入滑出。我们观察了哪些站点有很多共同的库，以及它们看起来有多相似。使用某些库构建的网站-Bootstrap、FontAwese和JQuery UI-看起来彼此更相似。这可能是因为这些库控制页面布局，并且具有常用的默认选项。使用其他库(如SWFObject和JQuery工具)的站点往往看起来非常不同，这可能是因为这些库允许更复杂、更定制的页面。\n2005年平均相似度得分的网站往往比2016年平均相似度得分的网站看起来不那么相似。\n例如，在2005年，Webshots.com和Yum.com被认为相对相似，但配色方案和布局略有不同。虽然它们都主要使用白色、蓝色和黑色，但右边的网站背景是蓝色的。\n而2016年的两个网站，Xfinity.com和Gilt.com则更加相似：它们的顶部都有一个菜单栏，主要是黑白相间的图片。这些页面的文本要少得多，并且更好地利用了现有的更高分辨率的显示器。\n一方面，追随潮流在其他设计领域是完全正常的，比如时尚或建筑。如果设计因为使用相同的库而变得越来越相似，这意味着它们很可能变得更容易为视障人士所接受，因为流行的库通常比个别开发人员更善于符合可访问性标准。它们也更加用户友好，因为新访问者不需要花那么多时间来学习如何浏览网站的页面。\n另一方面，互联网是一个共享的文化产物，它的分布式、去中心化的性质是它的独特之处。随着主页和完全可定制的平台(如Neopets和MySpace)逐渐淡出人们的记忆，网页设计可能会失去其作为一种创造性表现形式的力量。Mozilla基金会认为整合不利于互联网的“健康”，网络的美感可以被视为其福祉的一个因素。\n如果网站因为许多人使用相同的图书馆而看起来更相似，那么维护这些图书馆的大型科技公司可能会在互联网的视觉美学上获得不成比例的权力。虽然与保密代码相比，发布任何人都可以使用的库可能会给网络带来净收益，但大型科技公司的设计原则并不一定适用于每个网站。\n这种巨大的力量是科技行业整合的更大故事的一部分-这当然可能是一个令人担忧的原因。我们认为，审美巩固也应该得到严格的审视。\n喜欢你读过的吗？想要更多吗？注册该对话的每日时事通讯。]", "note_en": "Over the past few years,  articles and  blog posts have started to ask some version of the same question: “ Why are all websites starting to look the same?”\n These posts usually point out some common design elements, from large images with superimposed text, to  hamburger menus, which are those three horizontal lines that, when clicked, reveal a list of page options to choose from.\n My colleagues Bardia Doosti, David Crandall, Norman Su and I were studying the  history of the web when we started to notice these posts cropping up. None of the authors had done any sort of empirical study, though. It was more of a hunch they had.\n We decided to investigate the claim to see if there were any truth to the notion that websites are starting to look the same and, if so, explore why this has been happening. So we ran  a series of data mining studies that scrutinized nearly 200,000 images across 10,000 websites.\n  It’s virtually impossible to study the entire internet;  there are over a billion websites, with many times as many webpages. Since there’s no list of them all to choose from, performing a random sample of the internet is off the table. Even if it were possible, most people only see a tiny fraction of those websites regularly, so a random sample may not even capture the internet that most people experience.\n We ended up using the websites of  the Russell 1000, the top U.S. businesses by market capitalization, which we hoped would be representative of trends in mainstream, corporate web design. We also studied two other sets of sites, one with Alexa’s 500 most trafficked sites, and another with sites nominated for  Webby Awards.\n Because we were interested in the visual elements of these websites, as data, we used images of their web pages from  the Internet Archive, which regularly preserves websites. And since we wanted to gather quantitative data comparing millions of website pairs, we needed to automate the analysis process.\n To do that, we had to settle on a definition of “similarity” that we could measure automatically. We investigated both specific attributes like color and layout, as well as attributes learned automatically from data using artificial intelligence.\n For the color and layout attributes, we measured how many pixel-by-pixel edits we would have to make to transform the color scheme or page structure of one website into another. For the AI-generated attributes, we trained a machine learning model to classify images based on which website they came from and measure the attributes the model learned.  Our previous work indicates that this does a reasonably good job at measuring stylistic similarity, but it’s very difficult for humans to understand what attributes the model focused on.\n  We found that across all three metrics – color, layout and AI-generated attributes – the average differences between websites peaked between 2008 and 2010 and then decreased between 2010 and 2016. Layout differences decreased the most, declining over 30% in that time frame.\n  These findings confirm the suspicions of web design bloggers that websites are becoming more similar. After showing this trend, we wanted to study our data to see what kinds of specific changes were causing it.\n You might think that these sites are simply copying each other’s code, but code similarity has actually significantly decreased over time. However, the use of software libraries has increased a lot.\n  Libraries feature collections of generic code for common tasks, like resizing a page for mobile devices or making a hamburger menu slide in and out. We looked at which sites had lots of libraries in common and how similar they looked. Sites built with certain libraries – Bootstrap, FontAwesome and JQuery UI – tended to look much more similar to each other. This could be because these libraries control page layout and have commonly used default options. Sites that used other libraries, like SWFObject and JQuery Tools, tended look much different, and that might be due to that fact that those libraries allow for more complex, customized pages.\n  Sites with average similarity scores in 2005 tended to look less similar than those with average similarity scores in 2016.\n For example, in 2005, Webshots.com and Yum.com were considered relatively similar, but had somewhat different color schemes and very different layouts. While they both mostly use white, blue and black, the site on the right has a blue background.\n  Two 2016 sites, Xfinity.com and Gilt.com, on the other hand, are even more similar: They both have a menu bar on the top and are primarily white and black with images. These pages have much less text and make better use of the higher resolution monitors that exist now.\n    On the one hand, adhering to trends is totally normal in other realms of design, like fashion or architecture. And if designs are becoming more similar because they’re using the same libraries, that means they’re likely becoming more accessible to the visually impaired, since popular libraries are  generally better at conforming to accessibility standards than individual developers. They’re also more user-friendly, since new visitors won’t have to spend as much time learning how to navigate the site’s pages.\n On the other hand, the internet is a shared cultural artifact, and its distributed, decentralized nature is what makes it unique. As home pages and fully customizable platforms like NeoPets and MySpace fade into memory, web design may lose much of its power as a form of creative expression. The Mozilla Foundation  has argued that consolidation is bad for the “health” of the internet, and the aesthetics of the web could be seen as one element of its well-being.\n And if sites are looking more similar because many people are using the same libraries, the large tech companies who maintain those libraries may be gaining a disproportionate power over the visual aesthetics of the internet. While publishing libraries that anyone can use is likely a net benefit for the web over keeping code secret, big tech companies’ design principles are not necessarily right for every site.\n This outsize power is part a larger story of consolidation in the tech industry – one that certainly  could be a cause for concern. We believe aesthetic consolidation should be critically examined as well.\n  [ Like what you’ve read? Want more?  Sign up for The Conversation’s daily newsletter.]", "posttime": "2020-05-12 01:36:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网站,starting", "title": "是的，网站开始看起来更相似了。", "title_en": "Yes, websites are starting to look more similar", "transed": 1, "url": "https://theconversation.com/yes-websites-really-are-starting-to-look-more-similar-136484", "via": "", "real_tags": ["网站", "starting"]}, {"category": "", "categoryclass": "", "imagename": "9c3c7938b896622a50428f005ad6fc93.jpg", "infoid": 1001675, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ProPublica是一个调查滥用权力的非营利性新闻编辑室。注册后即可收到我们最重要的新闻。\n这篇文章是与总部设在俄亥俄州扬斯敦的“商业杂志”合作撰写的，后者是ProPublica地方报道网络的成员。\n2016年11月一个反常温暖的早晨，扬斯敦的商界和政界领袖挤在这座俄亥俄州城市长期受苦的东区一小块杂乱无章的土地上。在几十年的衰落中摇摇欲坠，这个地区是坑坑洼洼的街道，杂草丛生的地块，腐烂的房屋和免下车的酒类市场。\n但在这一天，这座曾经是全国钢铁制造中心，现在是工业衰落的典范的城市，正在庆祝一项新事业的破土动工：世界上第一个自我冷却的饮料罐：冰镇罐头。总部位于加州的饮料公司约瑟夫国际公司(Joseph Co.International)曾承诺投资2000万美元建立一个研发和制造园区，并创造数百个新的就业机会。它的座右铭是：“冰河时代结束了！”\n身穿深色西装，打着粉色领带的公司董事长兼首席执行官米切尔·约瑟夫(Mitchell Joseph)对100多名朋友、家人和市政府官员发表讲话时笑容满面。他说，他的曾祖父于20世纪初在这里创立了星空瓶装公司，之后该公司于1971年关门。\n“这是我们的圣地，”约瑟夫说。能够在几乎100年后在同样的物业上回归，并采用饮料行业的革命性技术，并将其带回扬斯敦，对我们来说是非常令人欣慰的。“。\n时任市长约翰·麦克纳利(John McNally)和扬斯敦州立大学(Young Gstown State University)校长吉姆·特雷塞尔(Jim Tressel)在约瑟夫将铲子开进莱恩大道(Lane Avenue)沿线的一块草皮时鼓掌，并正式启动了一个项目，官员们表示，该项目将每年生产10亿罐。约瑟夫宣布：“我们将为波士顿、佛罗里达、达拉斯提供一切服务。”", "note_en": "ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive  our biggest stories as soon as they’re published.\n  This article was produced in partnership with The Business Journal, based in Youngstown, Ohio, which is a member of the  ProPublica Local Reporting Network.\n  On an unseasonably warm November morning in 2016, Youngstown’s business and political leaders crowded onto a small, scraggly plot of land on the Ohio city’s long-suffering East Side. Reeling from decades of decline, the area was a patchwork of potholed streets, weeded lots, moldering homes and drive-thru liquor marts.\n  But on this day, the city, once a national center of steel manufacturing and now a poster child for industrial decay, was celebrating the groundbreaking of a new venture: Chill-Can, the world’s first self-chilling beverage can. Joseph Co. International, a California-based beverage company, had pledged to build a $20 million research and manufacturing campus and create hundreds of new jobs. Its motto: “The Ice Age Is Over!”\n  Dressed in a dark suit and pink tie, Mitchell Joseph, the firm’s chairman and CEO, beamed as he addressed more than 100 friends, family members and city officials. His great-grandfather, he said, had founded the Star Bottling Co. on the site at the turn of the 20th century, before it closed shop in 1971.\n  “It’s sacred ground to us,” Joseph said. “To be able to come back after almost 100 years on the same exact property and take technology that is revolutionary in the beverage industry and bring it back to Youngstown is very gratifying to us.”\n  Then-Mayor John McNally and Youngstown State University President Jim Tressel applauded as Joseph drove a shovel into a patch of turf along Lane Avenue and officially kick-started a project that officials said would manufacture 1 billion cans a year. “We’ll service everything up to Boston, down to Florida, out to Dallas,” Joseph proclaimed.", "posttime": "2020-05-12 01:06:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,铁锈", "title": "挣扎的铁锈带城市将复兴寄托在一个自冷的饮料罐上", "title_en": "A Struggling Rust Belt City Pinned Its Revival on a Self-Chilling Beverage Can", "transed": 1, "url": "https://www.propublica.org/article/youngstown-chill-can", "via": "", "real_tags": ["rust", "铁锈"]}, {"category": "", "categoryclass": "", "imagename": "47251e5ac8880b853c679e85d77464ca.jpeg", "infoid": 1001674, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从周一开始，340万名高中生将坐在书桌前-以及在汽车里、卧室地板上和任何他们能找到安静的地方-参加高级选修考试，希望能证明他们掌握了一系列学术科目。\n这些测试看起来将与过去几年大不相同，因为冠状病毒大流行已经关闭了高中，并促使运行高级预修课程的大学委员会争先恐后地创建一种新的考试形式。\n..。", "note_en": "Beginning Monday, 3.4 million high school students will sit down at desks—and in cars, on bedroom floors and anywhere they can find some quiet—and take Advanced Placement exams with the hopes of proving mastery of a range of academic subjects.\n  The tests will look much different than in years past, as the coronavirus pandemic has closed high schools and sent the College Board, which runs the Advanced Placement program, scrambling to create a new format.\n...", "posttime": "2020-05-12 00:52:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "coronavirus,冠状病毒,病毒,时代,考试", "title": "冠状病毒时代的美联社考试：在线，时长只有15到45分钟", "title_en": "A.P. Exams in the Coronavirus Era: Online, and Just 15 To 45 Minutes Long", "transed": 1, "url": "https://www.wsj.com/articles/a-p-exams-in-the-coronavirus-era-online-and-just-15-to-45-minutes-long-11589208916", "via": "", "real_tags": ["冠状病毒", "病毒", "时代", "考试"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001673, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通过@stripestatus推特馈送提供的更新-请关注我们的网站！", "note_en": "Updates provided via the  @stripestatus Twitter feed—follow us there!", "posttime": "2020-05-12 00:52:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "条带,stripe,关注", "title": "条带的API已关闭", "title_en": "Stripe's API Is Down", "transed": 1, "url": "http://status.stripe.com?down=now", "via": "", "real_tags": ["条带", "stripe", "关注"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001672, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "推荐附件：USB电缆，引脚24x1(2)，8MB pSRAM，USB主机电缆Teensy 4.1在2.4 x 0.7英寸的外形中具有最快的微控制器和扩展的强大外围设备集。\nTeensy 4.1的设计目的是将所有通用I/O引脚带到外部边缘上。要使用以太网端口，需要连接磁极插孔和电容器。目前这只是一个使用OSH公园共享电路板的DIY项目。PJRC计划在不久的将来将其作为DIY工具包提供。建议使用这些部件来构建以太网连接。1个以太网Magjack RB1-125BAG1A，Mouser950-RB1-125BAG1A，Digikey1278-1011-ND2接头，3x2，2 mm间距Digikey1849-1000-ND2插槽，3x2，2 mm间距Amhenon FCI 89361-706LF，Digikey609-3139-ND1带状电缆，3至6英寸Digikey HF06S-5-ND1电容器，0.1。\nTeensy 4.1的底部有焊接2个内存芯片的位置。较小的位置用于放置pSRAM芯片。较长的位置用于闪存。Teensy 4.1&#39；的USB主机端口允许您连接USB设备，如键盘和MIDI乐器。需要5针接头和USB主机电缆才能插入USB设备。如果需要多个设备，则可以使用USB集线器。有关详细信息，请参阅USBHost_t36示例。", "note_en": "Recommended Accessories: USB Cable, Pins 24x1 (2), 8MB PSRAM, USB Host Cable Teensy 4.1 features the fastest micocontroller and an expanded set ofpowerful peripherals in a 2.4 by 0.7 inch form factor.\n Teensy 4.1 is designed to bring all general purpose I/O pins tobreadboard friendly pads on the outside edges. To use the Ethernet port, a magjack and capacitor need to be connected. This is currently available only as a DIY project using this OSH Park Shared Circuit Board.PJRC is planning to offer this as a DIY kit in the near future. These parts are recommended to build the Ethenet connection. 1 Ethernet Magjack RB1-125BAG1A,  Mouser 950-RB1-125BAG1A,  Digikey 1278-1011-ND2 Header, 3x2, 2mm pitch  Digikey 1849-1000-ND2 Socket, 3x2, 2mm pitch Amphenol FCI 89361-706LF,  Digikey 609-3139-ND1 Ribbon Cable, 3 to 6 inch  Digikey HF06S-5-ND1 Capacitor, 0.1uF, 8051 Capacitor, 1uF, 805 probably not needed1 Capacitor, 1nF, 805 optional, should be high voltage rated if used1 Resistor, 1M optional1 Circuit Board  OSH Park Shared PCB\n The bottom side of Teensy 4.1 has locations to solder 2 memory chips.  The smaller location is meant for a  PSRAM chip. Thelarger location is intended for flash memory. Teensy 4.1&#39;s USB Host port allow you to connect USB devices, like keyboardsand MIDI musical instruments. A 5 pin header and a USB Host cable are needed tobe able to plug in a USB device. USB hubs may be used if more than 1 device is needed. See the USBHost_t36examples for details.", "posttime": "2020-05-12 00:51:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,mb,ethernet,usb", "title": "Teensy 4.1发布：100 Mbps以太网、高速USB、8 MB闪存", "title_en": "Teensy 4.1 Released: 100 Mbps Ethernet, High-Speed USB, 8 MB Flash", "transed": 1, "url": "https://www.pjrc.com/store/teensy41.html", "via": "", "real_tags": ["发布", "mb", "ethernet", "usb"]}, {"category": "", "categoryclass": "", "imagename": "1f3b45f848a35b2102c615aea9f0e239.jpg", "infoid": 1001671, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欧洲地区区域互联网注册中心(RIPE NCC)正在举行选举，以填补其执行董事会的三个席位。选举将于2020年5月13日至15日在RIPE NCC的年度股东大会上举行，结果将于5月15日上午10点45分现场直播。\n在成熟的NCC执行董事会三个空缺席位的候选人中，经营着一家名为Netstyle的网络公司的埃拉德·科恩(Elad Cohen)就是其中之一。\n互联网调查员Ron Guilmette将Netstyle和科恩的电子邮件地址与南非互联网协议地址空间中的可疑活动联系起来。这包括属于Sasol的IP地址块，以及似乎属于Tredcor、AfrOx、Woolworths和SITA的块。\n区域互联网注册机构，如RIPE网络协调中心，向其服务区域内的成员提供互联网资源。这些资源包括网际协议(IP)地址。\n在几个月的时间里，MyBroadband与Guilmette合作调查了大量有价值的互联网协议(IP)地址被明显窃取和占用的事件。\n调查的一部分揭露了非洲地区互联网注册中心(AFRINIC)的一名内部人员如何从AFRINIC的空闲地址池中挪用大量IP地址块。\n此空闲池是AFRINIC托管的IP地址空间，用于根据其规则向合法有资格获得IP地址空间的个人或组织发放。\nAFRINIC内部至少有一个人自己拿到了这些未分配的IP地址，并在黑市上出售。\n自从我们的报告发表以来，AFRINIC立即解雇了有问题的内部人士，并收回了从其空闲池中拿走的IP地址块。\n我们调查的另一部分涉及称为“传统”IP地址块的地址分配。\n这些地址块特别有价值，因为它们不会收取AFRINIC的年费，因为在AFRINIC出现之前，它们被分配给互联网早期的公司。\n在梳理非洲的IP地址空间时，Guilmette发现Cohen的Netstyle电子邮件地址([电子邮件受保护])出现在以下IP地址块的Internet路由注册表(IRR)记录中：\n当被问及Infoplan、AECI、Sasol、Tredcor和Wooltru区块时，科恩表示，他们(Netstyle)是所有这些区块的所有者，除了Sasol区块。他还说，他后悔曾经买过它们。\n科恩说，他通过一家美国经纪人为这些区块支付了数百万美元，但没有说明他使用的是哪家经纪人。\n当被问及有关购买的法律文件时，他说：“法律文件与相关的美国律师在一起，我们将在任何法庭上出示。”\n科恩拒绝回答为什么他的电子邮件地址会出现在萨索尔回收的一块IP地址的IRR记录中。\n下表总结了Guilmette调查认定为“被盗”的所有遗留IP地址块。\n在这种情况下，Guilmette选择使用“被盗”一词，专门指存储在AFRINIC数据库中的IP地址块的WHOIS记录被以可疑方式操纵的情况。\n这包括姓名、地址和联系方式的改变，吉尔梅特称这种方式“明显是假的”。\n世界卫生组织的记录就像互联网的地契。如果一个不好的演员能够找到操纵IP地址块的WHOIS记录的方法，就像能够闯入地契办公室，改变贵重房产的地契信息一样。\nAFRINIC尚未回答有关如何对这些传统IP地址块进行更改的问题。\n在更新下表中的信息时，Netstyle和Cohen连接到了其他几个块。\nNetstyle当前路由的IP地址是属于附属计算服务公司(160.116.0.0/16)的地址块的一部分。\n已使用电子邮件地址“[EMAIL_PROTECTED]”将IRR对象添加到属于Safren Computer Services的块的AFRINIC数据库中。该条目最后一次修改是在2020年1月26日。MyBroadband之前公布的文件将科恩与“Afri Holdings Ltd”的名字联系起来。\n类似地，在RADb数据库中使用“[Email.Protected]”地址为Agrihold添加了一个IRR对象。该条目最后一次修改是在2020年1月3日。\nIP地址块的估计值是使用1美元兑18.79兰特和每个IP地址20美元的汇率计算的。这一价格是基于业内消息人士的反馈，他们表示，20美元的平均价格是合理的，但价格可能会更高，也可能更低，具体取决于情况。\n\n科恩是争夺成熟的NCC执行董事会三个空缺席位的九名候选人之一。他提名了自己，并获得了第二高的支持提名。\n支持提名排名前五的候选人是谢尔盖·迈索多夫(35)，埃拉德·科恩(16)，雷蒙德·杰滕(16)，乔迪·佩莱特·马丁内斯(13)和威廉·西尔维斯特(11)。\n应该注意的是，此排名仅供参考。支持提名不一定决定哪些候选人将当选。\nGuilmette已将Maikel Uerling与南非传统IP地址块上的可疑活动联系起来，这一点在MyBroadband的早些时候的一份报告中发表。\n网络专用SAS、Novogara和FiberXpress都在上表中列出的一个或多个被盗IP地址块中通告路由，包括连接到Netstyle和Cohen的IP地址块。\n这意味着它们接受发往Guilmette认定为被盗的IP地址的网络流量。\n一个例子是Infoplan块(196.16.0.0/14)，其中Cohen的Netstyle电子邮件地址列在Internet Routing Registry条目中。网络专用SAS、Novogara和FiberXpress都为Infoplan块中包含的IP地址子分配通告路由。\n埃拉德·科恩(Elad Cohen)被要求就他加入RIPE NCC执行董事会的活动发表评论。他拒绝回答问题。\n必须指出的是，科恩在本报告中没有受到任何非法活动的指控。\nMyBroadband还向RIPE NCC询问了科恩的执行董事会候选人资格。该组织证实，它知道针对他的指控。\n“成熟的NCC是根据荷兰法律成立的会员协会。根据我们的规定，任何人都可以被支持作为执行局选举的候选人，“该组织的一位发言人表示。\n“每个成员都有权提名(并且)每个成员只能支持一个被提名人一次。”", "note_en": "The Regional Internet Registry for the European region, RIPE NCC, is holding elections to fill three seats on its executive board. The elections will be held at RIPE NCC’s annual general meeting on 13-15 May 2020, with the results live streamed at 10:45 on 15 May.\n Among the candidates for the three seats available on the RIPE NCC Executive Board is Elad Cohen, who operates a networking company called Netstyle.\n Internet investigator Ron Guilmette has linked Netstyle and Cohen’s e-mail address to   suspicious activity in the South African Internet Protocol address space. This included a block of IP addresses that belongs to Sasol, and blocks which appear to belong to Tredcor, Afrox, Woolworths, and SITA.\n Regional Internet Registries, like the RIPE Network Coordination Centre, provide Internet resources to their members in their service region. These resources include Internet Protocol (IP) addresses.\n  Over several months, MyBroadband worked with Guilmette to look into the apparent theft of, and squatting on, vast swaths of valuable Internet Protocol (IP) addresses.\n One portion of the investigation uncovered how an insider at Africa’s Regional Internet Registry, AFRINIC,   misappropriated large IP address blocks from AFRINIC’s free pool of addresses.\n This free pool is the IP address space that AFRINIC holds in trust to give out to people or organisations that legitimately qualify to receive IP address space under its rules.\n At least one person inside AFRINIC helped themselves to these unassigned IP addresses and sold them on the black market.\n Since publishing our report, AFRINIC has summarily dismissed the insider in question and has   taken back the IP address blocks that were taken from its free pool.\n  Another part of our investigation involved address assignments referred to as “legacy” IP address blocks.\n These blocks of addresses are particularly valuable because they do not attract AFRINIC’s annual fees, as they were assigned to companies in the early days of the Internet, before AFRINIC existed.\n While combing through Africa’s IP address space, Guilmette discovered that Cohen’s Netstyle e-mail address (  [email protected]) appeared in the Internet Routing Registry (IRR) records for the following IP address blocks:\n  When queried about the Infoplan, AECI, Sasol, Tredcor, and Wooltru blocks, Cohen stated that they (Netstyle) are the owners of all of those ranges, except the Sasol block. He also said that he regrets ever buying them.\n Cohen said he paid millions of US dollars for the blocks via a US-based broker, but did not state which broker he used.\n When asked for the legal documentation regarding the purchases, he said: “The legal documents are with the USA lawyer involved, we will show them in any court.”\n Cohen declined to answer questions about why his e-mail address appeared in an IRR record for a block of IP addresses which Sasol has reclaimed.\n  The table below summarises all of the legacy IP address blocks which Guilmette’s investigation identified as “stolen”.\n In this context, Guilmette chose to use the term “stolen” to specifically refer to a situation where the WHOIS records of an IP address block, stored in AFRINIC’s database, had been manipulated in a suspicious way.\n This includes names, addresses, and contact information being changed in ways which Guilmette described as “obviously fake”.\n WHOIS records are like the title deeds of the Internet. If a bad actor can find a way to manipulate the WHOIS record of an IP address block, it would be like being able to break into the deeds office and change the information on the title deeds of valuable property.\n AFRINIC has yet to answer questions on how the changes to these legacy IP address blocks were made.\n While updating the information in the table below, Netstyle and Cohen were connected to a few other blocks.\n Netstyle is currently routing IP addresses that are part of a block which belonged to a company called Affiliated Computing Services (160.116.0.0/16).\n An IRR object was added to the AFRINIC database for the block belonging to Safren Computer Services using the e-mail address “ [email protected]”. The entry was last modified on 26 January 2020. Documents   previously published by MyBroadband link Cohen to the name “Afri Holdings Ltd”.\n Similarly, an IRR object was added for Agrihold in the RADb database using the “ [email protected]” address. The entry was last modified on 3 January 2020.\n The estimated value of a block of IP addresses was calculated using an exchange rate of R18.79 per USD and a price of $20 per IP address. The price is based on feedback from industry sources who have indicated that $20 is a reasonable average to work with, but that prices can be higher or lower depending on circumstances.\n \n  Cohen is one of   nine candidates contending for the three available seats on the RIPE NCC Executive Board. He nominated himself and he is also tied for the second-highest number of support nominations received.\n The top five candidates by   support nominations received are Sergey Myasoedov (35), Elad Cohen (16), Raymond Jetten (16), Jordi Palet Martinez (13), and William Sylvester (11).\n It should be noted that this ranking is given for interest only. Support nominations do not necessarily determine which candidates will be voted in.\n    Guilmette has connected Maikel Uerlings to suspicious activity on South African legacy IP address blocks, as published in   an earlier report on MyBroadband.\n Network Dedicated SAS, Novogara, and FiberXpress all advertise routes in one or more of the stolen IP address blocks listed in the table above, including ones connected to Netstyle and Cohen.\n This means that they accept network traffic destined for IP addresses which Guilmette has identified as stolen.\n One example is the Infoplan block (196.16.0.0/14), where Cohen’s Netstyle e-mail address is listed in the Internet Routing Registry entry. Network Dedicated SAS, Novogara, and FiberXpress all advertise routes for IP address sub-allocations contained in the Infoplan block.\n  Elad Cohen was asked for comment regarding his campaign to join the RIPE NCC Executive Board. He declined to answer questions.\n It must be noted that Cohen is not being accused of any illegal activity in this report.\n  MyBroadband also asked RIPE NCC about Cohen’s candidacy for the Executive Board. The organisation confirmed that it was aware of the allegations against him.\n “The RIPE NCC is a membership association under Dutch law. According to our rules, anyone can be supported as a candidate for the Executive Board elections,” a spokesperson for the organisation stated.\n “Each member is entitled to make nominations [and] each member can support a nominee only once.”", "posttime": "2020-05-12 00:34:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "组织,ip,地址", "title": "连接到IP地址抢劫案的MAN正在竞选欧洲知识产权组织的职位", "title_en": "Man connected to IP address heist running for position at European IP org", "transed": 1, "url": "https://mybroadband.co.za/news/internet/350973-man-connected-to-african-ip-address-heist-running-for-board-position-at-european-ip-address-organisation.html", "via": "", "real_tags": ["组织", "ip", "地址"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001670, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新的环境变量支持：内置对.env和NEXT_PUBLIC_PREFIX的支持，如CRA中所示。\n改进的内置获取支持：对于Node.js和所有浏览器(构建和运行时)，放弃节点获取和同构获取导入，转而使用内置获取多边形填充。\n集成的Web Vitals报告：捕获推动灯塔得分的指标，但要从您的实际流量中获取。\n快速刷新是一种全新的热重新加载体验，可为您提供对Reaction组件所做编辑的即时反馈。现在，对于Next.js 9.4或更高版本上的所有项目，它现在都是默认启用的。\n热重新加载已经存在很长一段时间了，但从历史上看，它太脆弱了，无法在您的工作流中默认启用。正因为如此，Next.js以前实现了一种粗略的热重新加载形式，它将重置应用程序的整个状态。\n旧的热重新加载实现对编译或运行时错误没有弹性，如果您在编辑CSS或JavaScript时输入错误，则会执行应用程序的完全重新加载。这不是最优的，打乱了你的思路。\nFAST Refresh深度集成到Reaction本身(通过Reaction Refresh)，允许Next.js对Reaction组件树执行可预测的精确更新。\n这意味着Next.js将只更新您编辑的文件中的代码，并且只重新呈现该组件，而不会丢失组件状态。这包括样式(内联、CSS-in-JS或CSS/Sass模块)、标记、事件处理程序和效果(通过useEffect)。\n作为这次体验的一部分，我们完全重新设计了错误覆盖，以使其更有帮助，并使您的应用程序对打字错误或运行时错误具有弹性。这包括但不限于：\n准确的错误位置，在编译前解析到代码的原始行和列。\njs在9.3中引入了静态站点生成方法，目标很明确：我们应该获得静态(始终快速、始终在线、全球分布)的好处，但要出色地支持动态数据，这正是Next.js所熟知的。\n为了两全其美，Next.js支持增量静态生成，即在构建站点后更新静态内容。例如，在9.3中，我们在getStaticPath中引入了Fallback：true选项，它允许您在运行时添加新页面。\n我们最近整理了一个示例，展示了Next.js如何以这种方式静态预呈现无限数量的页面：\n今天，我们还引入了增量静态再生(Beta)，这是一种更新现有页面的机制，当流量传入时，通过在后台重新呈现它们。受过时而重新验证的启发，这确保了流量始终以静态方式不间断地提供服务，并且只有在新构建的页面完成生成之后才会将其推送。\n导出异步函数getStaticProps(){return{props：await getDataFromCMS()，//我们将尝试重新生成页面：//-当请求传入时//-最多每秒一次STRISTH_REVALIDATE：1}}。\n页面永远不会脱机。如果后台页重新生成失败，则旧页保持不变。\nNext Start和Vercel edge平台都已经完全支持增量功能(添加页面和延迟更新页面)和预览模式。\n接下来，我们将开发补充RFC，以解决两个额外的增量静态生成功能：\n一次重新生成多个页面并使其无效(如您的博客索引和某个博客帖子)。\n在我们宣布下一代静态站点生成之后，我们想要分享从Headless CMS API获取内容并将其呈现为Next.js HTML的真实场景。\n我们与世界上一些最好的CMS系统的创建者合作：Conentful、DatoCMS、棱镜、SANISH和TakeShape，还有更多的系统正在开发中。\n这些示例不仅可以随时使用并获得100%开源和麻省理工学院的许可，而且它们还结合了可用的最佳实践：\n我们还与TinaCMS在CMS的一个令人兴奋的新方向上进行了合作：内容的页面内编辑。请查看他们的指南，了解如何为您的项目实施它。\n我们从使用Next.js的公司得到的一个常见反馈是，不清楚环境变量何时内联到浏览器包中，以及何时仅在Node.js环境中可用。\n第一种方法是向浏览器公开环境变量，您可以在环境变量前面加上NEXT_PUBLIC_。当使用该环境变量时，它将内联到浏览器JavaScript包中。\n您不再需要添加next.config.js和env键来公开这些变量。\n//Pages/index.js//环境变量将向浏览器公开。记录(&#39；我的应用程序版本&#39；，进程。环境。NEXT_PUBLIC_VERSION)导出默认函数(){返回Hello World}。\n第二个更改是Next.js现在默认支持.env加载。允许您轻松定义开发和生产环境变量。\n在Next.js 9.1.7中，我们宣布在浏览器中对FETCH()API进行多层填充。现在，这种多层填充也扩展到了Node.js环境。\n实际上，您不再需要使用任何类型的服务器端FETCH PolyFill(例如，同构-取消获取或节点-获取)，因为Next.js将在所有环境中自动提供FETCH()。\n导出异步函数getStaticProps(){//不再需要从同构导入FETCH-UNFETCH常量res=AWAIT FETCH(&#39；https://./posts&#39；)常量POST=AWAIT RES。json()return{props：{post}函数({post}){//呈现帖子.。}导出默认值。\n上周，谷歌Chrome团队推出了Core Web Vitals。核心网络活力是在网络上传递伟大用户体验的关键质量信号，著名的灯塔报告就是建立在这个基础上的。\n如果您希望您的网站或Web应用程序尽可能快，那么跟踪这些指标是非常有用的，这也是Next.js的核心目标之一。\nChrome团队发布了一个Core Web Vitals Chrome扩展，它允许您作为开发人员获得页面执行情况的可视反馈。\n在构建生产Web应用程序时，您还希望了解您的站点对访问者和(潜在)客户的表现如何。您甚至可能希望跟踪这些度量随时间的改进或倒退，以查看您的更改是否对您的受众产生了预期的影响。\n为了帮助向您的分析服务报告Core Web Vitals，我们与Google合作引入了一种名为reportWebVitals的新方法，可以从Pages/_app.js中导出：\n//将为每个必须报告的指标调用一次。导出函数报告WebVitals(指标){//这些指标可以发送到任何分析服务。log(公制)}函数({，pageProps}){return}导出默认值。\n要将此方法与您的分析服务结合使用，请参阅文档的将结果发送到分析部分。如果您想了解更多关于核心Web Vitals的信息，可以参考web.dev/vitals。\n如果您正在处理一个大型项目，您的一些导入语句可能会受到../意大利面的影响：\n在这种情况下，我们应该使用绝对进口，而不是相对进口。假设Components目录位于根目录，我们希望import语句如下所示：\n我们很高兴地宣布，Next.js9.4使得设置JavaScript和TypeScript项目的绝对导入变得超级简单。您只需将baseUrl配置添加到jsconfig.json(JS项目)或tsconfig.json(TS项目)。\n这将允许从的绝对导入。(根目录)。它还与VSCode和其他编辑器集成，支持代码导航和其他编辑器功能。\n注意：如果您之前修改了webpack模块别名配置以启用绝对导入，则现在可以删除该配置。\n此外，Next.js9.4还支持路径选项，该选项允许您创建自定义模块别名。例如，以下代码允许您使用@/design-system而不是Components/design-system：\n如果指定路径，则必须指定baseUrl。您可以在TypeScript文档中了解有关路径选项的更多信息。\n当在Next.js9.3中启动内置的Sass支持时，我们得到的反馈是一部分用户想要配置Sass编译器。例如，要配置include dePath，请执行以下操作。\n我们重新设计了命令行输出，使其更加一致，输出的重复数据(如部署URL)更少，需要等待开发服务器启动等等。我们还更改了消息类型的间距，使其在消息之间保持一致，这意味着它们不再从一行跳到另一行。\n加入有关GitHub讨论的Next.js社区。讨论是一个社区空间，允许您与其他Next.js用户联系并提出问题。\n如果您使用的是Next.js，请随意与社区共享您的项目URL。\n我们感谢我们的社区和所有外部反馈和贡献，这些反馈和贡献帮助塑造了这个版本。", "note_en": "New Environment Variables Support: built-in support for  .env and a  NEXT_PUBLIC_ prefix, as seen in CRA\n Improved Built-in Fetch Support: ditch your  node-fetch and  isomorphic-fetch imports in favor of a built-in  fetch polyfill, for Node.js and all browsers (build and runtime)\n Integrated Web Vitals Reporting: capture the  metrics that drive Lighthouse scores, but from your real traffic\n  Fast Refresh is a new hot reloading experience that gives you instantaneous feedback on edits made to your React components. It is now  enabled by default for all projects on Next.js 9.4 or newer.\n Hot reloading has  existed for a long time but has  historically been  too fragile to enable by default in your workflow. Because of this, Next.js previously implemented a coarse form of hot reloading that would reset the entire state of your application.\n The old hot reloading implementation was not resilient to compilation or runtime errors and would perform a full reload of your application if you made a typo while editing your CSS or JavaScript. This was suboptimal and interrupted your train of thought.\n Fast Refresh deeply integrates into React itself ( via React Refresh), allowing Next.js to perform predictable precision updates to your React component tree.\n This means Next.js will only update code in the file you edited, and only re-render that component,  without losing component state. This includes styles (inline, CSS-in-JS, or CSS/Sass Modules), markup, event handlers, and effects (via  useEffect).\n  As part of this experience, we completely redesigned the error overlay to be more helpful and to make your application resilient to typos or runtime errors. This includes, but is not limited to:\n Accurate error locations, resolved to the  original line and column of your code, before compilation\n  Next.js introduced Static Site Generation methods in 9.3 with a clear goal in mind: we should get  the benefits of static (always fast, always online,  globally distributed), but with excellent support for dynamic data, which Next.js is known for.\n To get the best of both worlds, Next.js supports  Incremental Static Generation, updating static content after you have already built your site. For example, in 9.3 we’ve introduced the  fallback: true option in  getStaticPaths, which allows you to add  new pages at runtime.\n We recently put together an example showcasing how Next.js can statically pre-render an infinite number of pages this way:\n  Today, we are also introducing  Incremental Static Regeneration (beta), which is a mechanism to  update existing pages, by re-rendering them in the background as traffic comes in. Inspired by  stale-while-revalidate, this ensures traffic is served uninterrupted, always statically, and the newly built page is pushed only after it&#39;s done generating.\n export  async  function  getStaticProps ( )  {  return  { props :  await  getDataFromCMS ( ) ,  // we will attempt to re-generate the page:  // - when a request comes in  // - at most once every second unstable_revalidate :  1  } }\n  Pages never go offline. If the background page re-generation fails, the old page remains unaltered.\n Both incremental features (adding pages and lazily updating them), as well as  preview mode, are already fully supported by both  next start and the  Vercel edge platform out of the box.\n Up next, we will be working on a supplemental RFC to address two additional incremental static generation capabilities:\n Re-generating and invalidating multiple pages at once (like your blog index and a certain blog post)\n  On the heels of our announcement of  next-gen static site generation, we wanted to share real-world scenarios of fetching content from Headless CMS APIs and rendering it as Next.js HTML.\n We partnered with the creators of some of the best CMS systems in the world:  Contentful,  DatoCMS,  Prismic,  Sanity, and  TakeShape, with more on the way.\n  These examples are not only ready to be used and 100% open source and MIT licensed, but they incorporate the best practices available:\n   We also have collaborated with TinaCMS on an exciting new direction for CMS:  in-page editing of content.  Check out their guide to learn how to implement it for your project.\n  A common piece of feedback that we got from companies using Next.js is that it was unclear when an environment variable is inlined into the browser bundle and when it is only available in the Node.js environment.\n  The first is to expose an environment variable to the browser you can prefix the environment variable with  NEXT_PUBLIC_. When that environment variable is used it will then be inlined into the browser JavaScript bundle.\n You no longer have to add a  next.config.js and add the  env key to expose these variables.\n // pages/index.js // The environment variable will be exposed to the browser  . log ( &#39;My Application Version&#39; , process . env . NEXT_PUBLIC_VERSION ) export  default  function    ( )  {  return   Hello World  }\n The second change is that Next.js now supports  .env loading by default. Allowing you to easily define development and production environment variables.\n     In  Next.js 9.1.7 we announced polyfilling of the   fetch() API in the browser. Today this polyfilling has been extended to the Node.js environment too.\n In practice, you no longer have to use any type of server-side fetch polyfill (for example  isomorphic-unfetch or  node-fetch) as Next.js will automatically provide  fetch() in all environments.\n  export  async  function  getStaticProps ( )  {  // fetch no longer needs to be imported from isomorphic-unfetch  const res  =  await  fetch ( &#39;https://.../posts&#39; )  const posts  =  await res . json ( )  return  { props :  { posts  }  } } function    (  { posts  } )  {  // Render posts... } export  default\n  Last week the Google Chrome team introduced  Core Web Vitals. Core Web Vitals are the quality signals key to delivering great UX on the web, on top of which the  famous Lighthouse reports are built.\n Keeping track of these metrics is extremely useful if you want your website or web application to be as fast as possible, which is one of the core goals of Next.js.\n  The Chrome team has released a  Core Web Vitals Chrome extension that allows you as a developer to get visual feedback on how your pages are performing.\n When building production web applications you also want to know how your site is performing for your visitors and (potential) customers. You might even want to track the improvement or regression of these metrics over time in order to see if your changes have the intended impact on your audience.\n In order to aid reporting Core Web Vitals to your analytics service we have introduced,  in collaboration with Google, a new method called  reportWebVitals which can be exported from  pages/_app.js:\n // Will be called once for every metric that has to be reported. export  function  reportWebVitals ( metric )  {  // These metrics can be sent to any analytics service   . log (metric ) } function    (  {   , pageProps  } )  {  return   } export  default\n To use this method in combination with your analytics service refer to the  &#34;Sending result to Analytics&#34; section of the docs. If you want to learn more about Core Web Vitals you can refer to  web.dev/vitals.\n  If you’re working on a large project, some of your  import statements might suffer from the  ../../../ spaghetti:\n  In such cases, instead of relative imports, we should be using  absolute imports. Assuming that the  components directory exists at the root, we want  import statements to look like:\n  We&#39;re excited to announce that Next.js 9.4 makes setting up absolute imports super simple for both JavaScript and TypeScript projects. All you need to do is to add the  baseUrl config to   jsconfig.json (JS projects) or   tsconfig.json (TS projects).\n  This will allow absolute imports from  . (the root directory). It also integrates with VSCode and other editors, supporting code navigation and other editor features.\n Note: If you’ve previously modified your  Webpack module alias configuration to enable absolute imports, that configuration can now be removed.\n Furthermore, Next.js 9.4 also supports the  paths option, which allows you to create custom module aliases. For example, the following allows you to use  @/design-system instead of  components/design-system:\n    You must specify  baseUrl if you specify  paths. You can learn more about the  paths option  in the TypeScript documentation.\n  When built-in Sass support was launched in  Next.js 9.3 we got the feedback that a subset of users wanted to configure the sass compiler. For example to configure  includePaths.\n    We have redesigned the command line output to be more consistent and output less duplicate data like the deployment URL, waiting on the development server to start and more. We&#39;ve also changed the spacing of the message type to be consistent across messages, meaning they no longer jump from line to line.\n        Join the Next.js community on  GitHub Discussions. Discussions is a community space that allows you to connect with other Next.js users and ask questions.\n If you are using Next.js feel free to  share your project url with the community.\n We are thankful to our community and all the external feedback and contributions that helped shape this release.", "posttime": "2020-05-12 00:19:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "增量,refresh,js", "title": "Next.js 9.4-快速刷新、增量静态再生", "title_en": "Next.js 9.4 – Fast Refresh, Incremental Static Regeneration", "transed": 1, "url": "https://nextjs.org/blog/next-9-4", "via": "", "real_tags": ["增量", "refresh", "js"]}]