[{"category": "", "categoryclass": "", "imagename": "1ba31488434baaa369c1fb90fd846384.png", "infoid": 1001498, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "地球和金星是“姐妹世界”，有着相似的大小、质量和体积组成。然而，你不会想要参观现代的金星，它的大气中含有二氧化碳和氮气，表面温度徘徊在450摄氏度左右。但我们的邻居可能并不总是这么不友好。\n破译早期金星的样子并不容易-部分原因是该行星的表面相对年轻，只有3-7亿年的历史-但来自先锋金星任务的迹象表明，它的大气中曾经含有比今天更多的水。金星表面还可能存在液态水，以及板块构造和稳定的温带气候；一些研究甚至表明，金星的气候可能比地球早期的气候更稳定，避免了地球的冰雪期。\n关于是什么导致了金星的剧烈变化，有很多理论：逐渐变暖的太阳可能在短时间内宜居后让金星变得炎热和干燥，或者很早的岩浆海洋以及二氧化碳和蒸汽的大气可能在近40亿年前让位于地球的当前状态。\n然而，在一项新的研究中，韦和德尔·吉尼奥提供了证据，证明浅水海洋和宜居条件可能在金星上持续了长达30亿年，直到火山大火成岩省(LIP)同时出现，结束了地球的温带时期。\n该团队使用NASA的Rocke-3D(用动力学解决地球和地外环境的轨道和气候关键)大气环流模型对金星的历史进行了几次模拟，以检查行星自转速度和表面水位的变化可能如何影响其早期气候。假设金星早期的大气层和地球早期的大气层一样，是富碳和凉爽的，而且自转速度很慢，研究小组发现，在该行星40多亿年历史的大部分时间里，金星的气候可能是稳定的-这是对逐渐变暖的太阳理论的打击。\n作者认为，过去数亿年来嘴唇的同时喷发可能通过向大气中释放大量二氧化碳而导致温室效应失控。由此导致的行星表面的干燥可能会使它进入一个新的内部-表面动力学状态，新暴露的玄武岩--今天在金星上很明显--起到了有效的氧汇的作用。\n在地球的过去，嘴唇是以随机的随机过程顺序出现的，而不是同时出现的，作者指出，这“对我们今天所知的生命来说是偶然的”。但对金星内部的了解还不足以推测，不能居住的最终状态是否是类似金星的行星，甚至是地球上内部过程的必然产物。研究人员需要从金星表面进行更多的观测，以更好地约束其早期历史，并进一步挑战岩浆海洋理论。\n最终，更好地了解金星的历史将提供对类地过程和系外行星过程的洞察，包括宜居窗口是否比目前认为的更广。(《地球物理研究杂志：行星》，https://doi.org/10.1029/2019JE006276，，2020年)\n引用：惠灵，K.(2020年)，金星可居住多久？，Eos，第101页，https://doi.org/10.1029/2020EO142936.。发表于2020年5月8日。", "note_en": "Earth and Venus are “sister worlds,” sharing a similar size, mass, and bulk composition. You wouldn’t want to visit modern-day Venus, though, with  its atmosphere of carbon dioxide and nitrogen and surface temperatures hovering around 450°C. But our neighbor probably wasn’t always so inhospitable.\n Deciphering what early Venus looked like isn’t easy—in part because the planet’s surface is  relatively young, just 300–700 million years old—but  indications from the Pioneer Venus mission suggest that its atmosphere once contained more water than it does today. Venus also might have hosted liquid water at its surface, as well as plate tectonics and a stable, temperate climate; some studies even indicate that Venus’s climate may have been more stable than early Earth’s, avoiding Earth’s icy  snowball periods.\n Theories abound about what led to Venus’s drastic transformation: A gradually warming Sun may have left the planet hot and desiccated after a short period of habitability, or a very early magma ocean and an atmosphere of carbon dioxide and steam could have given way to the planet’s current state nearly 4 billion years ago.\n In a new study, though,   Way and Del Genio provide evidence that a shallow water ocean and habitable conditions may have persisted on Venus for as long as 3 billion years, until volcanic  large igneous provinces (LIPs) emerged simultaneously and ended the planet’s temperate period.\n The team ran several simulations of Venus’s history using  NASA’s ROCKE-3D (Resolving Orbital and Climate Keys of Earth and Extraterrestrial Environments with Dynamics) general circulation model to examine how variations in the planet’s rotation rate and surface water levels might have influenced its early climate. Assuming that Venus’s early atmosphere, like early Earth’s, was carbon rich and cool and that its rotation rate was slow, the team found that Venus’s climate could have been stable for most of the planet’s more than 4-billion-year history—a strike against the gradually warming Sun theory.\n The authors believe that simultaneous eruptions of LIPs over the past few hundreds of millions of years could have led to a runaway greenhouse effect by releasing large amounts of carbon dioxide into the atmosphere. The resultant drying of the planet’s surface could have driven it into a new interior-surface dynamics regime, with newly exposed basalts—evident on Venus today—acting as an efficient oxygen sink.\n In Earth’s past, LIPs have emerged sequentially in a random stochastic process, rather than simultaneously, which the authors note is “fortuitous for life as we know it today.” But not enough is known about Venus’s interior to speculate whether an uninhabitable end state is the inevitable product of internal processes on Venus-like planets or even on Earth for that matter. Researchers need more observations from Venus’s surface to better constrain its early history and further challenge the magma ocean theory.\n Ultimately, a better understanding of Venus’s history will provide insights into both terrestrial processes and those of exoplanets, including whether the window of habitability is wider than currently thought. ( Journal of Geophysical Research: Planets,  https://doi.org/10.1029/2019JE006276, 2020)\n   Citation: Wheeling, K. (2020), How long was Venus habitable?,  Eos, 101,  https://doi.org/10.1029/2020EO142936. Published on 08 May 2020.", "posttime": "2020-05-10 19:50:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "金星,venus", "title": "金星可以居住多久？", "title_en": "How Long Was Venus Habitable?", "transed": 1, "url": "https://eos.org/research-spotlights/how-long-was-venus-habitable#.XralmVMHBZM.twitter", "via": "", "real_tags": ["金星", "venus"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001497, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创建并共享源代码的美丽图像。开始键入文件或将文件放入文本区域即可开始。", "note_en": "Create and share beautiful images of your source code. Start typing or drop a file into the text area to get started.", "posttime": "2020-05-10 19:50:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,创建,create,文件", "title": "Carbon：创建和共享源代码图像", "title_en": "Carbon: Create and share images of source code", "transed": 1, "url": "https://carbon.now.sh/", "via": "", "real_tags": ["代码", "创建", "create", "文件"]}, {"category": "", "categoryclass": "", "imagename": "b7903f7a461f115477eaf9dc66b8113a.jpg", "infoid": 1001496, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它能够检测到f*，s*，p*，t*，w*，c*等几十个单词，但对“scunthorpe”有一个特别的豁免；那个小镇已经受够了。\n这个s*的工作原理：现代字体可以将字母组合成单一的连字，通常用于fi或fl，但你可以选择任何东西，所以我们为粗话做了这件事。", "note_en": "It’s able to detect the words  f***, s***, p***, t***, w***,  c*** and dozens more, but  with a special exemption for  “Scunthorpe”; that town has   suffered enough.\n  How this s*** works:  Modern fonts can combine  letters into a single  ligature,  usually for things like fi or fl  but you can pick anything  so we’ve done it for swears.", "posttime": "2020-05-10 19:50:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "字体,scunthorpe,sans,原理", "title": "Scunthorpe Sans-一种自我审查的字体", "title_en": "Scunthorpe Sans – a self-censoring font", "transed": 1, "url": "https://vole.wtf/scunthorpe-sans/", "via": "", "real_tags": ["字体", "sans", "原理"]}, {"category": "", "categoryclass": "", "imagename": "c36e5088c3957193b1478f903ee62dd1.png", "infoid": 1001495, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“我们的愿景是，大约10年后，VR/AR将成为继移动之后的下一个主要计算平台。它甚至可以比移动设备更无处不在-特别是在我们到达AR之后-因为你可以一直在…上使用它。一旦你有了好的VR/AR系统，你就不再需要购买手机、电视或许多其他实物-它们只需成为数字商店中的应用程序。-马克·扎克伯格，2015(来源：Mark Zuckerberg)。\n我们在20世纪80年代尝试了虚拟现实，但没有奏效。这个想法可能很棒，但当时的技术远远没有实现它，几乎每个人都忘了这一点。然后，在2012年，我们意识到现在这可能会奏效。摩尔定律和智能手机零部件供应链意味着，实现这一愿景的硬件大部分都在货架上。从那时起，我们已经从概念验证走到了真正伟大的大众市场消费设备的四分之三的道路上。\n问题是，我们还没有想出你会用一个不是游戏(或一些非常利基的工业应用)的伟大的VR设备做什么，也不清楚我们会做什么。我们已经有了五年的实验项目，各种各样的内容都试过了，除了游戏，什么都没有真正奏效。\n与此同时，很有启发性的是，现在我们都被锁在家里，视频通话已经成为一种巨大的消费现象，但VR并非如此。这应该是一个虚拟现实的时刻，但它不是。\n这能告诉我们什么吗？当然，如果原始体验是令人惊叹的，那么应用程序会有更多的时间吗？嗯，也许吧。如果你尝试Oculus Quest，体验确实令人惊叹，很容易认为这是未来的一部分。然而，如果你在1980年尝试过今天的游戏机，你会有同样的反应-显然令人惊叹，显然是未来的一部分。但事实证明，游戏机的装机量是150-2亿台，而不是个人电脑的15亿台，更不用说智能手机的40亿台了。这是一项大生意，但它是科技行业的一个分支，而不是它的核心推动生态系统。大多数人对游戏机游戏的体验是商场里微软商店橱窗里的演示--他们说‘太漂亮了’，然后走了过去。很久以前，一位名叫哈米·斯帕克斯(Hammy Sparks)的学校老师(是的，真的)告诉我可以有不同大小的无穷大--在科技领域，可以有不同大小的奇迹，这让我震惊不已。\n智能手机是宽而通用的，而游戏机是深而窄的，而深而窄是一个较小的市场。VR更深更窄，所以如果我们不能想出一种既深又窄的内容形式，我想我们不得不假设VR将是游戏机的一个子集。这将是一项不错的业务，但这不是马克·扎克伯格收购Oculus的原因。这是科技领域的另一个分支，而不是继智能手机之后的下一个平台。\n有一堆想法在这里飘荡。其一，你还不能真正开发应用程序和提高工作效率，因为屏幕的分辨率还不够高，无法阅读文本，所以我们还不能在360度虚拟球体中工作，而这一点很快就会到来。另一个原因是，耳机需要更小、更轻，而且要做到穿透，这样你才能看到周围的房间。还有一个是，我们只需要继续等待，特别是等待更大的装机量(想必是由那些狭隘的游戏销售推动的)，创新就会以某种方式发挥作用。\n这些观点从根本上讲都没有什么不合逻辑的地方，但它们确实让我想起了卡尔·波普尔(Karl Popper)对马克思主义者的批评--当被问及为什么他们所谓的科学预测还没有发生时，他们总是说，‘啊，历史环境不对--你只需要再等几年’。当然，当被问到为什么共产主义国家似乎总是表现不佳时，马克思主义者倾向于回答说，‘啊，但那不是真正的共产主义’。这几天我似乎经常听到‘啊，但这不太合适’。\n换句话说，人们常说iPhone、PC或飞机曾经看起来也很原始和无用，但它们变得更好了，同样的情况也会发生在这里。这样做的问题是，iPhone或Wright Flier确实是原始和不切实际的，但它们是概念上的突破，有明确的根本改进途径。iPhone的摄像头不好，没有应用程序，也没有3G，但没有理由不能迅速添加这些功能。布莱里奥特在莱特夫妇第一次动力飞行仅仅六年后就飞越了英吉利海峡。这里等效的前进路径是什么？从管道胶带模型到Oculus Quest有一个明显的路线图，今天让Quest变得更小、更轻，但打入完全不同的消费者行为或消费者应用模式的路线图是什么呢？要将VR带到游戏之外，你具体需要相信哪些方面会发生变化？\n深入探讨这一点，我认为可能有四个命题需要考虑。\n我们基本上就快到了，硬件和开发者生态系统的更多迭代会把我们带到一个临界点，S曲线将会向上，这是真的吗？我们怎么知道呢？\n我们是不是在iPhone问世之前智能手机的位置？所有的核心技术都在那里-我们有应用程序、触摸屏和快速数据网络等等-但我们需要改变范式，将它们打包成更易于访问的形式。Oculus是新的Symbian吗？值得一提的是，在iPhone问世之前，没有人真的这么说过移动设备--正如我在这里写的那样，新方法的必要性只是在事后才显而易见。\n无处不在的体验和你戴在头上的将你周围的世界拒之门外并将你置于另一种现实中的装置之间是否存在根本的矛盾？“不深不窄的虚拟现实”是自相矛盾的修饰法吗？毕竟，这就是游戏机的答案。我怀疑很多科技界人士会立即拒绝这一点--当我们拥有合适的VR时，它一定是未来的，但人们实际上不能把它当作既定的东西。\n或者，推而广之，这就是关键所在--“真正的”虚拟现实需要一些完全不同的设备，而这就是它走向普及的原因吗？作为头盔的VR是狭窄的，但是作为神经蕾丝的VR不是吗？\n读到马克在上面所说的话，当他谈到AR和VR的融合时，我突然意识到，这个和许多VR的愿景(参见“Ready Player One”)实际上描述的不是“头盔MD，而是更好的东西”，而是眼镜，或者隐形眼镜，或者甚至是更遥远的未来的东西，比如神经植入物。在此基础上，我认为你可以争辩说，即使是Oculus Quest也不是“那里”的四分之三，而实际上还只是VR S曲线的起点。智能手机的继任者将不仅仅是将AR和VR融合在一起，而是让区别变得无关紧要-它可以让你每天都戴着，可以无缝地遮挡和补充现实世界，并产生难以区分的体积空间。按照这种观点，Oculus不是iPhone，而是牛顿(Newton)或苹果2(Apple 2)，它们也远不是通用的，柏拉图式的理想通用设备是十年或二十年后的。\n反过来，这种观点的问题在于，当科技人用大约十年或二十年的时间来衡量时，他们实际上正处于科幻小说的边缘-我祖父写了很多科幻小说，但我试图思考我们现在拥有的东西，以及我们现在拥有的路线图，这些路线图可能会告诉我们下一步可以建立什么。但是，如果“真正的虚拟现实”需要十年或二十年后的东西，那么我们将迎来另一个虚拟现实的冬天。\n把所有这些线索放在一起，我绕来绕去的问题不仅仅是我们除了游戏之外还没有VR的“杀手级应用”，而是我们不知道获得一款应用的途径可能是什么。我们可以从基本原则中断言信仰--第一代个人电脑也没有杀手级的应用程序，但它们看起来很有用。当我开始我的职业生涯时，3G是一个热门话题，每个投资者都在问‘什么是3G的杀手级应用？’事实证明，让你口袋里有互联网的杀手级应用程序就是，嗯，把互联网放在你的口袋里。但有了这些，我们知道下一步要做什么，而有了虚拟现实，我们就不知道了。这告诉我，虚拟现实在未来有一席之地。只是没告诉我是什么样的地方。", "note_en": "“Our vision is that VR / AR will be the next major computing platform after mobile in about 10 years. It can be even more ubiquitous than mobile - especially once we reach AR - since you can have it always on… Once you have a good VR / AR system, you no longer need to buy phones or TVs or many other physical objects - they can just become apps in a digital store.’ - Mark Zuckerberg, 2015 (  Source )\n We tried VR in the 1980s, and it didn’t work. The idea may have been great, but the technology of the day was nowhere close to delivering it, and almost everyone forgot about it. Then, in 2012, we realised that this might work now. Moore’s law and the smartphone component supply chain meant that the hardware to deliver the vision was mostly there on the shelf. Since then we’ve gone from the proof of concept to maybe three quarters of the way towards a really great mass-market consumer device.\n The problem is, we haven’t worked out what you would do with a great VR device that isn’t a game (or some very niche industrial application), and it’s not clear that we will. We’ve had five years of experimental projects and all sorts of content has been tried, and nothing other than games has really worked.\n Meanwhile, it’s instructive that now that we’re all locked up at home, video calls have become a huge consumer phenomenon, but VR has been not. This should have been a VR moment, and it isn’t.\n  Does that tell us anything? Surely if a raw experience is amazing, the applications will come with a bit more time? Well, perhaps. If you try the Oculus Quest, the experience is indeed amazing and it’s easy to think that this is part of the future. However, if you’d tried one of today’s games consoles in 1980 you’d have had the same reaction - clearly amazing and clearly part of the future. But it turned out that games consoles were a 150-200m unit installed base, not the 1.5bn of PCs, let alone the 4bn of smartphones. That’s a big business, but it’s a branch off the side of the tech industry, not its central, driving ecosystem. Most people’s experience of console games is the demo in the window of a Microsoft store in the mall - they say ‘that’s pretty’ and walk past. A long time ago a school teacher named Hammy Sparks (yes, really) blew my mind by suggesting that there can be different sized infinities - in tech, there can be different sized amazings.\n Smartphones are broad and universal, whereas consoles are deep and narrow, and deep and narrow is a smaller market. VR is even deeper and even narrower, and so if we can’t work out a form of content that isn’t also deep and narrow, I think we have to assume that VR will be a subset of the games console. That would be a decent business, but it’s not why Mark Zuckerberg bought Oculus. It’s another branch off the side of tech, not the next platform after smartphones.\n There’s a bunch of ideas that float around here. One is that you can’t really do apps and productivity yet because the screens aren’t high enough resolution to read text, so we can’t yet work in a 360 degree virtual sphere, and that will come. Another is that the headsets need to be even smaller and even lighter, and do pass-through so you can see the room around you. Yet another is that we just have to keep waiting, and in particular wait for a larger installed base (presumably driven by those deep-and-narrow games sales), and the innovation will somehow kick in.\n There’s nothing fundamentally illogical about any of these ideas, but they do remind me a little of Karl Popper’s criticism of Marxists - that when asked why their supposedly scientific prediction hadn’t happened yet they would always say ‘ah, the historical circumstances aren’t right - you just have to wait a few more years’. There is also, of course, the tendency of Marxists to respond to being asked why communist states seem always to turn out badly by saying ‘ah, but that isn’t proper communism’. I seem to hear ‘ah, but that isn’t proper VR’ an awful lot these days.\n To put this another way, it’s quite common to say that the iPhone, or PCs, or aircraft also looked primitive and useless once, but they got better, and the same will happen here. The problem with this is that the iPhone or the Wright Flier were indeed primitive and impractical, but they were breakthroughs of concept with clear paths for radical improvement. The iPhone had a bad camera, no apps and no 3G, but there was no reason why those couldn’t quickly be added. Blériot flew across the Channel just six years after the Wrights’ first powered flight. What’s the equivalent forward path here? There was an obvious roadmap for getting from a duct-taped mock-up to the Oculus Quest, and today for making the Quest even smaller and lighter, but what is the roadmap for breaking into a completely different model of consumer behaviour or consumer application? What specifically do you have to believe will change to take VR beyond games?\n Poking away at this a bit further, I think there are maybe four propositions to think about.\n Is it true that we are essentially almost there, and a bit more iteration of the hardware and the developer ecosystem will get us to a tipping point, and the S Curve will turn upwards? How would we know?\n Are we where smartphones were before the iPhone? All of the core technology was there - we had apps and touch screens and fast data networks and so on - but we needed a change in the paradigm to package them all up in a much more accessible form. Is Oculus the new Symbian? It’s worth noting that no-one was really saying this about mobile  before the iPhone -  as I wrote here, the need for a new approach was only obvious in hindsight.\n Is there a fundamental contradiction between a universally accessible experience and a device that you put on your head that shuts out the world around you and places you into an alternative reality? Is ‘VR that isn’t deep and narrow’ an oxymoron? That, after all, was the answer for games consoles. I suspect a lot of people in tech would reject this out of hand - the  right VR, when we have it,  must be the future, but one can’t actually take it as a given.\n Or, by extension, is this the point - that ‘real’ VR needs some completely different device and that’s what would take it to universality? VR as HMD is narrow but VR as, say, neural lace is not?\n Reading Mark’s quote above, as he talks about the merging of AR and VR, it strikes me that this and many visions for VR (cf ‘Ready Player One’) are really describing not ‘an HMD but a bit better’ but glasses, or perhaps contact lenses, or maybe even something even further into the future like neural implants. On that basis I think you could argue that even the Oculus Quest is not 3/4 of the way ‘there’ but actually still just at the beginning of the VR S Curve. The successor to the smartphone will be something that doesn’t just merge AR and VR but make the distinction irrelevant - something that you can wear all day every day, and that can seamlessly both occlude and supplement the real world and generate indistinguishable volumetric space. On that view the Oculus isn’t the iPhone - it’s the Newton, or the Apple 2, which were also far from universal, and the platonic ideal universal device is a decade or two into the future.\n In turn, the trouble with this argument is that when tech people take about ‘ten years’ or ‘twenty years’, they are effectively right on the edge of science fiction - my grandfather wrote a lot of science fiction, but I try to think about the stuff we have now, and the roadmaps we have now that might tell us what we can build next. But if ‘real VR’ needs something that’s ten or twenty years away, we’re in for another VR winter.\n Pulling all of these threads together, the issue I circle around is not just that we don’t have a ‘killer app’ for VR beyond games, but that we don’t know what the path to getting one might be. We can make assertions of belief from first principles - there was no killer app for the first PCs either, but they looked useful. When I started my career 3G was the hot topic, and every investor kept asking ‘what’s the killer app for 3G?’ It turned out that the killer app for having the internet in your pocket was, well, having the internet in your pocket. But with each of those, we knew what to build next, and with VR we don’t. That tells me that VR has a place in the future. It just doesn’t tell me what kind of place.", "posttime": "2020-05-10 19:49:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "虚拟现实,vr", "title": "虚拟现实的冬天", "title_en": "The VR Winter", "transed": 1, "url": "https://www.ben-evans.com/benedictevans/2020/5/8/the-vr-winter", "via": "", "real_tags": ["虚拟现实", "vr"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001494, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科罗纳的情况见证了阴谋论的戏剧性增加。不仅与病毒本身、其来源和传播有关，而且将它与许多其他声称的阴谋联系在一起。\n我不是阴谋论的狂热粉丝。我认为这是一种通过获取“秘密知识”来缩短多年辛勤工作的尝试，这些“秘密知识”使这个人“特别”、“觉醒”，并能够将其他人视为低人一等、“羊皮疙瘩”。\n为了让所有严肃的阴谋论者感到轻松，我写了一个迷你故事，在社交媒体上引起了一些反响；\n假登月飞船在圆顶附近飞行一次后触地。飞行员很容易看出地球是平的。但他也参与了这件事。它的真正任务是向非洲国家新开设的盖茨大学运送另一批微芯片疫苗。由共济会建造并由索罗斯资助的光照派大院是COVID-23的完美试验场，爬行动物们很贴切地给它起了个名字，因为((3×15)+(22×9))×4×2/3-18=666。这只尾随的羊羔很快就会连接到由希拉里·克林顿和埃尔维斯领导的照明控制的Starlink 5G网络。我们唯一的希望是让小唐纳德·特朗普再次当选，亚历克斯·琼斯成为国务卿。约翰尼是能够接触到秘密智慧的特殊人士之一。他被唤醒了。他真幸运。\n这并不是说阴谋不存在。他们是这样做的。但是大规模的阴谋是不可能维持的。这让我们看到了这篇博客文章的标题：\n根据一份聪明的数学论文，随着时间的推移，要让许多人“参与其中”真的很难。引用“大众科学”(PoparScience)上一篇总结数学模型的文章：\n如果你想把事情保密五年，那就让参与阴谋的人少于2531人。如果你再拍十年，1257张是你能拍到的最多的。如果你想要一个持续一个世纪或更长时间的阴谋(比如达芬奇密码)，那么你需要将你的人数控制在非常小的水平，减少到125人。\n这有效地粉碎了“假登月”、“扁平地球”、“爬行动物”等阴谋。它们根本不可能被遏制。", "note_en": "The Corona situation has seen a dramatic increase in conspiracy theories. Notonly concerning the virus itself, its origin and propagation, but linking itto a multitude of other claimed conspiracies.\n I am not a big fan of conspiracy theories. I see it as a an attempt to shortcut years of hard work by gaining access to “secret knowledge” that makes theperson “special” and “ woke”and able to look upon other people as inferior, as“ sheeple”.\n To lighten up all the serious conspiracy theorists, I wrote a mini-story thatgot some traction around on social media;\n The fake moon landing &#34;space ship&#34; touched the ground after a flightclose to the dome. The pilot would have easily seen that the Earth isflat. But he was in on it. Its true mission was to deliver anotherbatch of microchiped vaccines to the newly opened Gates University inan African country. Built by the Freemasons and funded by Soros, theIlluminati compound was the perfect testing ground for COVID-23, aptlynamed by the Reptilians because ((3×15)+(22×9))×4×2/3-18 = 666. Thechemtrailed sheeple would soon be hooked up to the Illuminaticontrolled Starlink 5G network, headed by Hillary Clinton and Elvis.Our only hope was to get Don Trump Jr reelected and Alex Jones asSecretary of State.Johnny was among the special people with access to the secret wisdom.He was woke. Lucky him.\n Its not that conspiracies do not exist. They do. But large scale conspiraciesare impossible to maintain. And this brings us to the title of this blog post:\n  According to  a clever mathematicalpaperit is really hard to keep many “in on it” over time. To quote  the articlein PopularScience summarizing the mathematical model:\n If you want to keep things a secret for five years, have less than2,531 people in on the plot. If you&#39;re shooting for a decade, 1,257is the largest you can go. And if you want to have a conspiracy thatlasts a century or more (like the DaVinci Code) then you need to keepyour numbers really small, down to 125 people.\n This effectively blows to pieces conspiracies such as “fake moon landing”,“flat Earth” and “reptilians”. They are simply impossible to contain.", "posttime": "2020-05-10 19:49:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "保守,conspiracy,阴谋", "title": "怎样才能保守阴谋的秘密呢？", "title_en": "What does it take to keep a conspiracy secret?", "transed": 1, "url": "https://isene.org/2020/05/Conspiracy.html", "via": "", "real_tags": ["保守", "阴谋"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001493, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "研究表明，由于人们的注意力集中在冠状病毒上，未诊断和未治疗的结核病病例将导致140万人死亡。\n结束结核病(TB)的全球伙伴关系负责人说，研究显示，由于冠状病毒的限制，预计还会有数百万人感染这种疾病，这让她感到“恶心”。\n从现在到2025年，预计将有多达630万人患上结核病，由于病例在封锁期间没有得到诊断和治疗，预计还会有140万人死亡。这将使全球在五到八年内消灭结核病的努力倒退。\n遏制结核病伙伴关系的执行主任Lucica Ditiu说：“我们回到了2013年的数字，我们有这么多人死亡，这对我来说是令人恶心的。”“我只是因为不能控制我们的所作所为而感到愤怒，…。而忘记了现有的节目，我们损失了太多，从人们的生命损失开始。“。\n我们惊讶地看着一种…。已经120天了，有100种候选疫苗正在研发中。\nDitiu说：“我不得不说，我们以一种令人费解的方式看待结核病社区，因为结核病已经存在了数千年。”“100年来，我们已经有了一种疫苗，我们有两到三种潜在的疫苗正在研发中。到2027年，我们需要大约5亿人接种疫苗，我们对一种…。已经120天了，它有100个候选疫苗正在研发中。所以我认为这个世界，对不起，我的法语，真的是一团糟。“她说。\n“我们社区的担心是，研究人员正朝着仅仅开发Covid疫苗的方向前进。这现在已经提上了每个人的议事日程，很少有人继续关注其他[疾病]。我们没有结核病疫苗，我们没有HIV疫苗，我们没有疟疾疫苗，在所有这些中，结核病是最古老的。那么为什么会有这样的反应呢？我想是因为我们是个白痴的世界。我能说什么呢？“。\n周三公布的这些数据是基于三个月的封锁和10个月的封锁解除后恢复服务的基础上的。\n这项研究是由遏制结核病伙伴关系委托与伦敦帝国理工学院、Avenir Health和约翰·霍普金斯大学合作进行的。它是以冠状病毒对一些病例数量最高的国家结核病服务影响的快速评估得出的数据为模型的。\n在过去的几年里，由于提供了更多的治疗这种疾病和防止其传播的服务，病例数量稳步下降。\n五年前，世界各国领导人承诺到2030年结束结核病流行。在2018年的一次高级别会议上，他们承诺加大应对力度，包括到2022年将资金翻一番。", "note_en": "With attention focused on coronavirus, undiagnosed and untreated TB cases will cause 1.4 million to die, research suggests\n    The head of a global partnership to end tuberculosis (TB) said she is “sickened” by research that revealed millions more people are expected to contract the disease as a result of Covid-19 restrictions.\n Up to 6.3 million more people are predicted to develop TB between now and 2025 and 1.4 million more people are expected to die as cases go undiagnosed and untreated during lockdown. This will set back global efforts to end TB by five to eight years.\n “The fact that we’ve rolled back to 2013 figures and we have so many people dying, this for me is sickening,” said  Lucica Ditiu, executive director of the Stop TB Partnership. “I am outraged that just by not being able to control what we do … and forgetting about programmes that exist we lose so much, starting with the loss of the lives of people.”\n  We look in amazement on a disease that … is 120 days old and it has 100 vaccine candidates in the pipeline\n “I have to say we look from the TB community in a sort of puzzled way because TB has been around for thousands of years,” Ditiu said. “For 100 years we have had a vaccine and we have two or three potential vaccines in the pipeline. We need around half a billion [people] to get the vaccine by 2027 and we look in amazement on a disease that … is 120 days old and it has 100 vaccine candidates in the pipeline. So I think this world, sorry for my French, is really fucked up,” she said.\n “The fear we have in the community is that researchers are heading towards just developing a vaccine for Covid. That’s on the agenda of everyone now and very few remain focused on the others [diseases]. We don’t have a vaccine for TB, we don’t have a vaccine for HIV, we don’t have a vaccine for malaria and out of all this, TB is the oldest. So why this reaction? I think because we are a world of idiots. What can I say?”\n The figures, published on Wednesday, are based on a three-month lockdown and a 10-month period of restoring services after lockdown is lifted.\n  The research was commissioned by the Stop TB Partnership in collaboration with Imperial College London, Avenir Health and Johns Hopkins University. It was modelled on data drawn from rapid assessments of the impact of the coronavirus on TB services in countries with some of the highest number of cases.\n  The past few years have seen a steady decline in cases as a result of more services to treat the disease and prevent its spread.\n Five years ago, world leaders pledged to  end the TB epidemic by 2030. At a high-level meeting in 2018, they promised to scale up their response, including doubling funding by 2022.", "posttime": "2020-05-10 19:49:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "患上,predicted,结核病", "title": "由于封锁，预计将有数百万人患上结核病", "title_en": "Millions predicted to develop tuberculosis as result of the lockdowns", "transed": 1, "url": "https://www.theguardian.com/global-development/2020/may/06/millions-develop-tuberculosis-tb-covid-19-lockdown", "via": "", "real_tags": ["患上", "predicted", "结核病"]}, {"category": "", "categoryclass": "", "imagename": "366c939dc1c746bf08a1c6c1bd640bff.png", "infoid": 1001492, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本新闻稿中的材料在USDL-20-08158：30之前禁止传输。(美国东部时间)2020年5月8日星期五技术信息：家庭数据：cpsinfo@bls.gov*www.bls.gov/cps机构数据：cesinfo@bls.gov*www.bls.gov/cesMedia联系人：(202)691-5902*PressOffice@bls.gov(注：2020年5月8日，劳工统计局发现，经季节性调整的专业和技术服务、专业和商业服务、私营服务提供、服务提供、。修正后的非农估计总数大约比最初报告的低3.7万人。LABSTAT数据库中的估计值已更正为2020年2月、3月和4月。劳工统计局下周将对其他发布的产品进行更正。)就业情况--2020年4月美国劳工统计局今天报告，4月份非农就业总人数减少了2050万人，失业率上升到14.7%。这些措施的变化反映了冠状病毒(冠状病毒)大流行的影响和遏制它的努力。各主要行业的就业人数均大幅下跌，其中休闲业和酒店业的失业情况尤为严重。本新闻稿刊载两项按月统计调查的统计数字。家庭调查通过人口特征衡量包括失业在内的劳动力状况。机构调查衡量的是按行业划分的非农就业人数、工作时间和收入。有关这两个调查中使用的概念和统计方法的更多信息，请参阅技术说明。4月份家庭调查数据显示，失业率上升10.3个百分点，达到14.7%。这是该系列历史上最高的增长率和最大的环比增幅(经季节性调整的数据可追溯到1948年1月)。4月失业人口增加1,590万人至2,310万人。这些措施的急剧增加反映了冠状病毒大流行的影响和遏制它的努力。(参见表A-1。有关住户调查及其措施如何受到冠状病毒大流行影响的更多信息，请参见新闻稿末尾的方框。)。4月份，所有主要工人群体的失业率都大幅上升。成年男性为13.0%，成年女性为15.5%，青少年为31.9%，白人为14.2%，黑人为16.7%，亚洲人为14.5%，西班牙裔为18.9%。除了黑人之外，所有这些群体的利率都创下了各自系列的历史新高。(参见表A-1、A-2和A-3。)。4月份，报告临时下岗的失业人数增加了约10倍，达到1810万人。永久性失业人数增加54.4万人，达到200万人。(参见表A-11。)。4月份，失业时间不足5周的失业人数增加了1070万人，达到1430万人，几乎占失业人数的三分之二。失业5至14周的失业人数增加520万人，至700万人。长期失业人数(失业时间超过27周的人)为93.9万人，当月减少22.5万人，占失业人数的4.1%(见表A-12)。劳动参与率比上月下降2.5个百分点，降至60.2%，为1973年1月以来的最低水平(当时为60.0%)。以家庭调查衡量的总就业人数减少了2240万人，降至1.334亿人。就业与人口比为51.3%，当月下降8.7个百分点。这是该系列历史上最低的增长率和最大的环比降幅(经季节性调整的数据可追溯到1948年1月)。(参见表A-1。)。当月，通常从事全职工作的人数减少了1500万人，通常从事兼职工作的人数减少了740万人。非全时工作人员占了当月就业人数下降的三分之一。(见表A-9)由于经济原因从事非全日制工作的人数在这个月几乎翻了一番，达到1090万人。这些人本来更喜欢全职工作，但由于工作时间减少或找不到全职工作，他们开始做兼职工作。这组人包括通常全职工作的人和通常兼职的人。(参见表A-8。)。4月份，目前找工作的非劳动力人数为990万人，几乎翻了一番。这些人没有被算作失业，因为他们在过去4周内没有积极寻找工作或无法找到工作。(见表A-1)4月份，边缘依附于劳动力的人数为230万人，比4月份增加了85.5万人。劳动力是目前想要工作的非劳动力中的一个子集。这些人不在劳动力大军中", "note_en": "Transmission of material in this news release is embargoed until\t\t\t\t\tUSDL-20-08158:30 a.m. (EDT) Friday, May 8, 2020Technical information: Household data:\tcpsinfo@bls.gov * www.bls.gov/cps Establishment data:\tcesinfo@bls.gov * www.bls.gov/cesMedia contact:\t (202) 691-5902 * PressOffice@bls.gov(NOTE: On May 8, 2020, BLS discovered errors in national estimates for seasonally adjusted allemployees in professional and technical services, professional and business services, privateservice- providing, service-providing, total private, and total nonfarm. The corrected totalnonfarm estimate is approximately 37,000 lower than initially reported. Estimates in the LABSTATdatabase have been corrected for February, March and April 2020. BLS will make corrections to otherrelease products next week.) \t\tTHE EMPLOYMENT SITUATION -- APRIL 2020 Total nonfarm payroll employment fell by 20.5 million in April, and the unemployment rate rose to 14.7 percent,the U.S. Bureau of Labor Statistics reported today. The changes in these measures reflect the effects of thecoronavirus (COVID-19) pandemic and efforts to contain it. Employment fell sharply in all major industry sectors,with particularly heavy job losses in leisure and hospitality.This news release presents statistics from two monthly surveys. The household survey measures labor force status,including unemployment, by demographic characteristics. The establishment survey measures nonfarm employment,hours, and earnings by industry. For more information about the concepts and statistical methodology used in thesetwo surveys, see the Technical Note. Household Survey Data In April, the unemployment rate increased by 10.3 percentage points to 14.7 percent. This is the highest rate and the largest over-the-month increase in the history of the series (seasonally adjusted data are available back to January 1948). The number of unemployed persons rose by 15.9 million to 23.1 million in April. The sharp increases in these measures reflect the effects of the coronavirus pandemic and efforts to contain it. (See table A-1. For moreinformation about how the household survey and its measures were affected by the coronavirus pandemic, see the box at the end of the news release.) In April, unemployment rates rose sharply among all major worker groups. The rate was 13.0 percent for adult men,15.5 percent for adult women, 31.9 percent for teenagers, 14.2 percent for Whites, 16.7 percent for Blacks, 14.5 percent for Asians, and 18.9 percent for Hispanics. The rates for all of these groups, with the exception of Blacks,represent record highs for their respective series. (See tables A-1, A-2, and A-3.) The number of unemployed persons who reported being on temporary layoff increased about ten-fold to 18.1 million inApril. The number of permanent job losers increased by 544,000 to 2.0 million. (See table A-11.) In April, the number of unemployed persons who were jobless less than 5 weeks increased by 10.7 million to 14.3 million, accounting for almost two-thirds of the unemployed. The number of unemployed persons who were jobless 5 to 14 weeks rose by 5.2 million to 7.0 million. The number of long-term unemployed (those jobless for 27 weeks or more), at 939,000, declined by 225,000 over the month and represented 4.1 percent of the unemployed.(See table A-12.) The labor force participation rate decreased by 2.5 percentage points over the month to 60.2 percent, the lowestrate since January 1973 (when it was 60.0 percent). Total employment, as measured by the household survey, fellby 22.4 million to 133.4 million. The employment-population ratio, at 51.3 percent, dropped by 8.7 percentage pointsover the month. This is the lowest rate and largest over-the-month decline in the history of the series (seasonallyadjusted data are available back to January 1948). (See table A-1.) The number of persons who usually work full time declined by 15.0 million over the month, and the number who usuallywork part time declined by 7.4 million. Part-time workers accounted for one-third of the over-the-month employment decline. (See table A-9.)The number of persons at work part time for economic reasons nearly doubled over the month to 10.9 million. These individuals, who would have preferred full-time employment, were working part time because their hours had beenreduced or they were unable to find full-time jobs. This group includes persons who usually work full time and persons who usually work part time. (See table A-8.) The number of persons not in the labor force who currently want a job, at 9.9 million, nearly doubled in April.These individuals were not counted as unemployed because they were not actively looking for work during the last4 weeks or were unavailable to take a job. (See table A-1.)Persons marginally attached to the labor force--a subset of persons not in the labor force who currently want a job--numbered 2.3 million in April, up by 855,000 over the month. These individuals were not in the labor force,wanted and were available for work, and had looked for a job sometime in the prior 12 months but had not lookedfor work in the 4 weeks preceding the survey. Discouraged workers, a subset of the marginally attached who believedthat no jobs were available for them, numbered 574,000 in April, little changed from the previous month.(See Summary table A.)Establishment Survey DataTotal nonfarm payroll employment fell by 20.5 million in April, after declining by 870,000 in March. The Aprilover-the-month decline is the largest in the history of the series and brought employment to its lowest levelsince February 2011 (the series dates back to 1939). Job losses in April were widespread, with the largest employment decline occurring in leisure and hospitality. (See table B-1. For more information about how the establishment survey and its measures were affected by the coronavirus, see the box note at the end of the newsrelease.)In April, employment in leisure and hospitality plummeted by 7.7 million, or 47 percent. Almost three-quarters of thedecrease occurred in food services and drinking places (-5.5 million). Employment also fell in the arts, entertainment,and recreation industry (-1.3 million) and in the accommodation industry (-839,000).Employment declined by 2.5 million in education and health services in April. In health care, employment declined by1.4 million, led by losses in offices of dentists (-503,000), offices of physicians (-243,000), and offices of otherhealth care practitioners (-205,000). Employment also declined in social assistance (-651,000), reflecting job lossesin child day care services (-336,000) and individual and family services (-241,000). Employment in private educationdeclined by 457,000 over the month. Professional and business services shed 2.1 million jobs in April. Sharp losses occurred in temporary help services(-842,000) and in services to buildings and dwellings (-259,000). In April, employment in retail trade declined by 2.1 million. Job losses occurred in clothing and clothing accessoriesstores (-740,000), motor vehicle and parts dealers (-345,000), miscellaneous store retailers (-264,000), and furnitureand home furnishings stores (-209,000). By contrast, the component of general merchandise stores that includes warehouseclubs and supercenters gained 93,000 jobs. In April, manufacturing employment dropped by 1.3 million. About two-thirds of the decline was in durable goodsmanufacturing (-914,000), which saw losses in motor vehicles and parts (-382,000) and in fabricated metal products(-109,000). Nondurable goods manufacturing shed 416,000 jobs.Employment in the other services industry declined by 1.3 million in April, with nearly two-thirds of the decline occurring in personal and laundry services (-797,000).Government employment dropped by 980,000 in April. Employment in local government was down by 801,000, in part reflectingschool closures. Employment also declined in state government education (-176,000).Construction employment fell by 975,000 in April, with much of the loss in specialty trade contractors (-691,000). Joblosses also occurred in construction of buildings (-206,000). Employment fell in transportation and warehousing in April (-584,000). Transit and ground passenger transportation andair transportation lost 185,000 jobs and 141,000 jobs, respectively.Wholesale trade shed 363,000 jobs in April, largely reflecting losses in the durable and nondurable goods components. Employment in financial activities fell by 262,000 over the month, with the vast majority of the decline occurring in real estate and rental and leasing (-222,000). Employment in information fell by 254,000 in April, driven by a decline in motion picture and sound recording industries (-217,000).Mining lost 46,000 jobs in April, with most of the decline occurring in support activities for mining (-33,000). In April, average hourly earnings for all employees on private nonfarm payrolls increased by $1.34 to $30.01. Averagehourly earnings of private-sector production and nonsupervisory employees increased by $1.04 to $25.12 in April. The increases in average hourly earnings largely reflect the substantial job loss among lower-paid workers; this change,along with earnings increases, put upward pressure on the average hourly earnings estimates. (See tables B-3 and B-8.)The average workweek for all employees on private nonfarm payrolls increased by 0.1 hour to 34.2 hours in April. Inmanufacturing, the workweek declined by 2.1 hours to 38.3 hours, and overtime declined by 0.9 hour to 2.1 hours. Theaverage workweek for production and nonsupervisory employees on private nonfarm payrolls increased by 0.1 hour to33.5 hours. (See tables B-2 and B-7.)The change in total nonfarm payroll employment for February was revised down by 45,000 from +275,000 to +230,000, andthe change for March was revised down by 169,000 from -701,000 to -870,000. With these revisions, employment changesin February and March combined were 214,000 lower than previously reported. (Monthly revisions result from additionalreports received from businesses and government agencies since the last published estimates and from the recalculation of seasonal factors.)_____________The Employment Situation for May is scheduled to be released on Friday, June 5, 2020, at 8:30 a.m. (EDT). _______________________________________________________________________________________________________|\t\t\t\t\t\t\t\t\t\t\t\t\t||\t\t\t\t\t\t\t\t\t\t\t\t\t|| Coronavirus (COVID-19) Impact on April 2020 Establishment and Household Survey Data\t\t|| \t\t\t\t\t\t\t\t\t\t\t\t\t||\t\t\t\t\t\t\t\t\t\t\t\t\t|| Data collection for both surveys was affected by the coronavirus (COVID-19) pandemic. The household\t|| survey is generally collected through in-person and telephone interviews, but personal interviews\t|| were not conducted for the safety of interviewers and respondents. The household survey response\t|| rate, at 70 percent, was about 13 percentage points lower than in months prior to the pandemic.\t|| In the establishment survey, approximately one-fifth of the data is collected at four regional data\t|| collection centers. Although these centers were closed, about half of the interviewers at these\t|| centers worked remotely to collect data by telephone. Additionally, BLS encouraged businesses to\t|| report electronically. The collection rate for the establishment survey in April was 74.9 percent,\t|| essentially unchanged from collection rates prior to the pandemic.\t\t\t\t\t||\t\t\t\t\t\t\t\t\t\t\t\t\t|| In the establishment survey, workers who are paid by their employer for all or any part of the pay\t|| period including the 12th of the month are counted as employed, even if they were not actually at\t|| their jobs. Workers who are temporarily or permanently absent from their jobs and are not being\t|| paid are not counted as employed, even if they are continuing to receive benefits. The length of\t|| the reference period does vary across the respondents in the establishment survey; one-third of\t|| businesses have a weekly pay period, slightly over 40 percent a bi-weekly, about 20 percent \t\t|| semi-monthly, and a small amount monthly. \t\t\t\t\t\t\t\t|| \t\t\t\t\t\t\t\t\t\t\t\t\t|| There was a change to the estimation method used in the establishment survey for April. Business \t|| births and deaths cannot be adequately captured by the establishment survey as they occur. Therefore,|| the establishment survey estimates use a model to account for the relatively stable net employment\t|| change generated by business births and deaths. Due to the impact of the COVID-19 pandemic, the \t|| relationship between the two was no longer stable in April. Therefore, the establishment survey \t|| made modifications to the birth-death model. For more information, see\t\t\t\t|| www.bls.gov/cps/employment-situation-covid19-faq-april-2020.pdf. \t\t\t\t\t||\t\t\t\t\t\t\t\t\t\t\t\t\t|| In the household survey, individuals are classified as employed, unemployed, or not in the labor\t|| force based on their answers to a series of questions about their activities during the survey \t|| reference week (April 12th through April 18th). Workers who indicate they were not working during\t|| the entire survey reference week and expect to be recalled to their jobs should be classified as \t|| unemployed on temporary layoff. In April, there was an extremely large increase in the number of\t|| persons classified as unemployed on temporary layoff. \t\t\t\t\t\t|| \t\t\t\t\t\t\t\t\t\t\t\t\t|| However, there was also a large increase in the number of workers who were classified as employed \t|| but absent from work. As was the case in March, special instructions sent to household survey\t|| interviewers called for all employed persons absent from work due to coronavirus-related business\t|| closures to be classified as unemployed on temporary layoff. However, it is apparent that not all\t|| such workers were so classified. \t\t\t\t\t\t\t\t\t|| \t\t\t\t\t\t\t\t\t\t\t\t\t|| If the workers who were recorded as employed but absent from work due to &#34;other reasons&#34; (over\t|| and above the number absent for other reasons in a typical April) had been classified as unemployed\t|| on temporary layoff, the overall unemployment rate would have been almost 5 percentage points higher\t|| than reported (on a not seasonally adjusted basis). However, according to usual practice, the data \t|| from the household survey are accepted as recorded. To maintain data integrity, no ad hoc actions\t|| are taken to reclassify survey responses. \t\t\t\t\t\t\t\t|| \t\t\t\t\t\t\t\t\t\t\t\t\t|| More information is available at www.bls.gov/cps/employment-situation-covid19-faq-april-2020.pdf.\t||\t\t\t\t\t\t\t\t\t\t\t\t\t||______________________________________________________________________________________________________\t|", "posttime": "2020-05-10 19:37:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "统计局,bls", "title": "劳工统计局报告失业率为14.7%", "title_en": "BLS Reports 14.7% Unemployment Rate", "transed": 1, "url": "https://www.bls.gov/news.release/empsit.nr0.htm", "via": "", "real_tags": ["统计局", "bls"]}, {"category": "", "categoryclass": "", "imagename": "519a109c34575e9c96da3185c2e7a41b.png", "infoid": 1001491, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你知道你在推特上看到的所有代码截图吗？虽然准则通常令人印象深刻，但我们看到美容部门还有改进的空间。Carbon使创建和共享源代码的美丽图像变得很容易。那你还在等什么？去用你新发现的设计能力给你所有的追随者留下深刻的印象吧。\n一旦你把所有的代码都写成碳纸，你就可以通过改变语法主题、背景颜色、窗口主题或填充来定制你的图像。\n自定义图像后，您可以在Tweet上发布指向该图像的链接，也可以直接保存。\n如果您使用Tweet按钮，Carbon将自动使您的图片变得可访问。但是，如果您想要手动在tweet上发布您的图片，请查看如何让您的twitter图片可访问。\n如果您在帖子中包含碳素图像，则源代码将在辅助技术中不可见，无法放大或复制，等等。请考虑添加另一个包含源代码的文本元素，如图像下方的HTML详细信息元素。\n如果您使用的是Google Chrome或其他支持渐进式Web Apps的浏览器，您可以通过以下方式安装Carbon以脱机使用：\nIntelliJ IDEA Carbon-now-sh-通过上下文菜单以Carbon格式打开当前IntelliJ IDEA文件中的选择。\nVS代码Carbon-now-sh-使用命令Carbon在Carbon中打开当前的VS代码文件。\nSublime Text 3 Carbon-now-sh-使用自定义绑定密钥在当前Sublime Text 3文件中打开所选内容。\nEmacs Carbon-now-sh-使用交互函数Carbon-now-sh打开当前Emacs中的选择。\nXcode nef-这个Xcode扩展允许您在单个操作中将代码选择导出为碳片段。\nCLI Carbon-Now-cli-以Carbon格式打开文件或使用Carbon-Now直接下载文件，具有交互模式、选择性突出显示等功能。\n@bonshbot-一种电报聊天机器人，它接受代码片段或要点URL并生成碳图像。\nR碳酸盐-在R中反复操作图像美学，或者用碳纸打开，或者直接下载。\nCS 101-计算思维导论-萨博·罗伊的计算机科学教科书。\n你们公司用碳吗？考虑赞助该项目，为新功能、错误修复等提供资金。", "note_en": "You know  all  of  those code  screenshots you see on Twitter? Though the code&#39;s usually impressive, we saw room for improvement in the aesthetic department. Carbon makes it easy to create and share beautiful images of your source code. So what are you waiting for? Go impress all of your followers with your newfound design prowess.\n         Once you&#39;ve got all of your code into Carbon, you can customize your image by changing the syntax theme, background color, window theme, or padding.\n  After you&#39;ve customized your image you can either Tweet a link to the image, or save it directly.\n If you use the &#39;Tweet&#39; button, Carbon will automatically make your image accessible. However, if you want to manually tweet your image, please check out  how to make your Twitter images accessible.\n If you include a Carbon image in a post, the source code will be invisible for assistive technology, it will not be possible to enlarge it or copy it, etc. Please, think about adding another element with the source code as text, like an  HTML Details Element below the image.\n  If you are using Google Chrome, or another browser that supports Progressive Web Apps, you can install Carbon for use offline by:\n     IntelliJ IDEA  carbon-now-sh - Open up the selection in your current IntelliJ IDEA file in Carbon through a context menu\n  VS Code  carbon-now-sh - Open up your current VS Code file in Carbon with command  carbon\n Sublime Text 3  carbon-now-sh - Open up the selection in your current Sublime Text 3 file with a custom bound key\n  Emacs  carbon-now-sh - Open up the selection in your current Emacs using interactive function  carbon-now-sh\n  Xcode  nef - This Xcode extension enables you to export a code selection as a Carbon snippet in a single action\n  CLI  carbon-now-cli - Open a file in Carbon or download it directly using  carbon-now, featuring an interactive mode, selective highlighting and more\n    @carbonshbot - A Telegram chatbot wich takes in a code snippet or gist URL and generates an Carbon image\n  R  carbonate - Iteratively manipulate image aesthetics in  R and either open in Carbon or download directly.\n  &#34;CS 101 - An Introduction to Computational Thinking&#34; - a computer science textbook by Sarbo Roy.\n            Does your company use Carbon? Consider sponsoring the project to fund new features, bug fixes, and more.", "posttime": "2020-05-10 15:54:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,创建,create,carbon", "title": "Carbon：创建并分享源代码的美丽图像", "title_en": "Carbon: Create and share beautiful images of your source code", "transed": 1, "url": "https://github.com/carbon-app/carbon", "via": "", "real_tags": ["代码", "创建", "create", "carbon"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001489, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特斯拉(Tesla)正在起诉加州地方当局，这家电动汽车制造商正推动重新开放那里的工厂，首席执行官埃隆·马斯克(Elon Musk)威胁要将公司总部迁往德克萨斯州或内华达州。\n马斯克一直在推动重新开放特斯拉位于加利福尼亚州弗里蒙特的工厂，此前阿拉米达县卫生部门表示，该汽车制造商不得重新开放，因为当地遏制冠状病毒传播的封锁措施仍然有效。\n特斯拉周六对该县提起诉讼，称持续的限制措施是该县的一种“夺权行为”，因为加州州长周四曾表示，该州的制造商将被允许重新开张。\n该公司在向旧金山联邦法院提起的诉讼中表示，阿拉米达违反了联邦和加州宪法，也藐视了州长的命令。\n弗里蒙特工厂所在的阿拉米达县计划关闭到5月底，只允许必要的企业重新开放。县官员没有立即回复对这起诉讼的置评请求。\n周六，直言不讳的马斯克也在Twitter上抱怨，并威胁要离开该州。\n他在推特上写道：“如果我们甚至完全保留弗里蒙特的制造活动，那将取决于特斯拉未来受到的待遇。”旧金山湾区的工厂目前是特斯拉在美国唯一的汽车工厂。\n(@elonmusk)坦率地说，这是最后一根稻草。特斯拉现在将立即将其总部和未来的项目转移到德克萨斯州/内华达州。如果我们甚至完全保留弗里蒙特的制造活动，那将取决于特斯拉未来被如何对待。特斯拉是加州最后一家汽车制造商。\n阿拉米达县周六表示，该县一直在与特斯拉合作制定一项安全计划，该计划“允许重新开工，同时保护在该工厂工作的数千名员工的健康和福祉”，并期待很快就安全计划达成协议。\n弗里蒙特市长莉莉·梅(莉莉·梅)对继续实施原地避难所命令而没有规定特斯拉等制造商恢复的潜在经济影响表示担忧。周六，梅敦促该县与企业合作，制定“可接受的重新开业指导方针”。\n马斯克周四告诉员工，弗里蒙特的有限生产将于周五下午重新开始。\n特斯拉在弗里蒙特的工厂每年生产超过41.5万辆汽车，搬迁整个生产设施将是一项艰巨的任务。\n韦德布什分析师丹·艾夫斯(Dan Ives)周六估计，该公司可能需要12至18个月的时间来搬迁生产。\n特斯拉发出搬迁工厂的威胁之际，其目标是提高弗里蒙特Y型运动型多功能车(SUV)的产量。Y型运动型多功能车(SUV)是该汽车制造商迄今利润最高的汽车。\n马斯克曾在3月份与加州官员就特斯拉是否必须停止在弗里蒙特生产一事发生争执，他批评了封锁和留在家中的命令，称这些命令对美国企业来说是“严重风险”，是“违宪的”。\n自3月18日以来，特斯拉股价已上涨127%，创下近期收盘低点，其中包括上个交易周16.8%的涨幅，周五收于819.42美元。", "note_en": "Tesla is suing local authorities in  California as the electric carmaker pushes to reopen its factory there and chief executive Elon Musk threatens to move the company’s headquarters to Texas or Nevada.\n Musk has been pushing to reopen Tesla’s Fremont, California, factory after Alameda County’s health department said the carmaker must not reopen because local lockdown measures to curb the spread of the coronavirus remain in effect.\n Tesla filed a lawsuit against the county on Saturday, calling the continued restrictions a “power-grab” by the county since California’s governor had said on Thursday that manufacturers in the state would be allowed to reopen.\n  The company said Alameda was going against the federal and California constitutions, as well as defying the governor’s order, in the lawsuit filed in San Francisco federal court.\n Alameda County, where the Fremont factory is located, is scheduled to remain shut until the end of May, with only essential businesses allowed to reopen. County officials did not immediately respond to a request for comment on the lawsuit.\n The outspoken Musk also took to Twitter on Saturday to complain and threatened to leave the state.\n “If we even retain Fremont manufacturing activity at all, it will be dependent on how Tesla is treated in the future,” he tweeted. The San Francisco Bay area facility is currently Tesla’s only US vehicle factory.\n (@elonmusk) Frankly, this is the final straw. Tesla will now move its HQ and future programs to Texas/Nevada immediately. If we even retain Fremont manufacturing activity at all, it will be dependen on how Tesla is treated in the future. Tesla is the last carmaker left in CA.\n Alameda County said on Saturday that it has been working with Tesla to develop a safety plan that “allows for reopening while protecting the health and well-being of the thousands of employees” who work at the factory, and that it looks forward to coming to an agreement on a safety plan very soon.\n Fremont mayor Lily Mei expressed concern about the potential economic implications of continuing the shelter-in-place order without provisions for manufacturers such as Tesla to resume. Mei on Saturday urged the county to work with businesses on “acceptable guidelines for re-opening”.\n Musk had told employees on Thursday that limited production would restart at Fremont on Friday afternoon.\n  Tesla builds more than 415,000 cars a year at the Fremont plant and moving the entire production facility would be a massive undertaking.\n Dan Ives, a Wedbush analyst, on Saturday estimated it could take the company 12 to 18 months to relocate production.\n The threat to relocate the facility comes as Tesla aims to ramp up production at Fremont of its Model Y sport utility vehicle, the carmaker’s most profitable vehicle to date.\n Musk, who sparred with California officials in March over whether Tesla had to halt production at Fremont, had criticised the lockdown and stay-at-home orders, calling them a “serious risk” to US business and “unconstitutional”.\n Tesla shares have risen 127% since 18 March, their recent closing low, including a 16.8% gain in the last trading week to close at $819.42 on Friday.", "posttime": "2020-05-10 13:41:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,病毒,埃隆·马斯克,特斯拉,马斯克", "title": "埃隆·马斯克威胁要将特斯拉总部搬出加州，原因是冠状病毒限制", "title_en": "Elon Musk threatens to move Tesla HQ out of California over Covid-19 restriction", "transed": 1, "url": "https://www.theguardian.com/world/2020/may/10/elon-musk-threatens-to-move-tesla-hq-out-of-california-over-covid-19-restrictions", "via": "", "real_tags": ["冠状病毒", "病毒", "埃隆·马斯克", "特斯拉", "马斯克"]}, {"category": "", "categoryclass": "", "imagename": "7fb638f9cf6507a7566ea857846f3e2a.jpg", "infoid": 1001488, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从一开始，Python的语法就是LL(1)：它只需要一个从左到右的解析器，向前看一个标记来解决歧义。标准CPython解析器是由一个简单的自定义解析器生成器生成的。然而，这种简单性是有代价的。首先，官方的Python语法文件没有准确捕获语言。语法允许无效的构造，例如，这个赋值表达式(使用new walrus运算符)：这个表达式是非法的，因为walrus运算符的左侧必须是一个名称，而不是像[x for x in y]这样的任意子表达式。不过，Python的LL(1)解析器的功能不足以强制执行此规则，因此必须在通过特殊情况逻辑(在将解析树转换为抽象语法树(AST)时运行的特殊情况逻辑)进行解析后才能强制执行该规则。更糟糕的是，有一些Python代码是我们想要编写但无法编写的，因为它不能被解析。用-语句括起来看起来很合理，但目前是禁止的：阅读更多2020年Python语言峰会的报道。Guido van Rossum、Pablo Galindo和Lysandros Nikolaou编写了一个新的Python解析器来去除这些缺点，并建议PEP617在CPython中采用它。新的解析器是以更强大的风格编写的，称为解析表达式语法(PEG)，因此该项目被命名为“PEGEN”。当PEG解析器读取可能匹配多个语法规则的令牌序列的开头时，解析器会从左到右尝试每条规则，直到其中一条成功。例如，给定一组规则：解析器首先尝试将规则A应用于其输入序列。如果A成功，解析器将忽略B和C。否则，解析器继续并尝试应用规则B，依此类推。与LL(1)解析器不同，PEG解析器可以根据需要向前看，以消除序列的歧义。语法是确定性的：在多个规则匹配的情况下，最左边的规则获胜。有些序列需要指数级的时间才能找到匹配规则；为了避免这种情况，大多数PEG解析器(包括新的Python解析器)实现了“Packrat”方法来缓存中间结果。PackRAT解析器可以在线性时间内处理任何输入，但会在其缓存上花费一些内存。PEGEN的语法比旧的要清晰得多，并且语法与所有合法的Python程序完全匹配。CPython的旧解析器分阶段进行：记号赋值器向LL(1)解析器提供数据，该解析器生成具体的语法树(CST)，并将其转换为AST。cst阶段是必需的，因为解析器不支持左递归。考虑一下这个表达式：旧解析器的CST太扁平了，正如本幻灯片中的演示者所展示的那样：在现实生活中，表达式将在运行时通过首先将a加到b，然后添加c来计算。不幸的是，CST不对此嵌套计算进行编码，因此LL(1)解析器必须第二次转换程序以将CST转换为适当嵌套形式的AST，然后可以生成字节码。另一方面，PEGEN直接生成AST。根据程序的不同，PEGEN可能会使用更多或更少的内存：它在PackRat方法上花费的钱，可以通过跳过CST来节省。Emily Morehouse针对旧解析器测试了PEGEN，方法是验证它们为标准库中的每个模块和前3800个PyPI包生成相同的AST。(PEGEN解析标准库的速度略快于旧解析器，但使用的内存多10%。)。一旦Python有了非LL(1)解析器，其语法可能会变得更加复杂；Victor Stner询问第三方Python解析器(如linters和IDE)是否会有困难。van Rossum确信，如果有必要，他们自己可以采用更强大的解析器。作者计划谨慎地将CPython切换到新的解析器。在Python3.9alpha6中，新的解析器将选择加入；它将成为Beta1和官方3.9版本中的默认解析器，旧的解析器仍然可以通过命令行开关使用。一旦启用了新的解析器，将允许使用带括号的-语句！在Python3.10中，旧的解析器将被删除。然而，PEP617仍然必须得到批准，新的规范需要最后的审查。这项提议没有遭到反对；事实上，观众中的几个人询问它是否可以更早成为违约。", "note_en": "Since its start, Python’s grammar has been  LL(1): it needs only a left-to-right parser that looks one token ahead to resolve ambiguities. The standard CPython parser is  produced by a simple custom parser generator. There are some costs to this simplicity, however. First, the  official Python grammar file does not capture the language exactly. There are invalid constructs allowed by the grammar, for example, this assignment expression (using the new walrus operator):  This expression is illegal, because the left side of the walrus operator must be a name, not an arbitrary sub-expression like  [x for x in y]. Python’s LL(1) parser is not powerful enough to enforce this rule, though, so it must be enforced after parsing by special-case logic that runs while transforming the parse tree into the abstract syntax tree (AST).  Worse, there is Python code that we would like to write but cannot, because it can’t be parsed. Parenthesized with-statements look reasonable  but they’re currently prohibited:   Read more 2020 Python Language Summit coverage.  Guido van Rossum, Pablo Galindo, and Lysandros Nikolaou wrote a new Python parser to excise these warts, and  proposed PEP 617 to adopt it in CPython. The new parser is written in a more powerful style called a  parsing expression grammar (PEG), so the project is named “PEGEN”.  When a PEG parser reads the beginning of a token sequence that could match several grammar rules, the parser tries each of those rules, from left to right, until one succeeds. For example, given a set of rules:  The parser first tries to apply rule A to its input sequence. If A succeeds, the parser ignores B and C. Otherwise, the parser moves on and tries to apply rule B, and so on. Unlike an LL(1) parser, a PEG parser can look ahead as far as necessary to disambiguate a sequence. The grammar is deterministic: in cases where multiple rules match, the leftmost wins. Some sequences would require exponential time to find the matching rule; to prevent this, most PEG parsers (including the new Python parser) implement the “packrat” method to cache intermediate results. A packrat parser can process any input in linear time, but spends some memory on its cache.  PEGEN’s grammar is far more legible than the old one’s, and the grammar exactly matches all legal Python programs.  CPython’s old parser progresses in stages: the tokenizer feeds the LL(1) parser, which produces a concrete syntax tree (CST), which is transformed into the AST. The CST stage is necessary because the parser does not support left recursion. Consider this expression:  The old parser’s CST is too flat, as the presenters showed in this slide:    In real life, the expression will be evaluated at runtime by first adding  a to  b, then adding  c. Unfortunately the CST does not encode this nested evaluation, so the LL(1) parser must transform the program a second time to turn the CST into an AST in the properly nested form, which can then generate bytecode. PEGEN, on the other hand, directly generates the AST. Depending on the program, PEGEN may use more or less memory: what it spends on the packrat method, it may save by skipping the CST.  Emily Morehouse tested PEGEN against the old parser by verifying they produce the same AST for every module in the standard library and the top 3800 PyPI packages. (PEGEN parses the standard library slightly faster than the old parser, but uses 10% more memory.)  Once Python has a non-LL(1) parser, its syntax may grow more grammatically complex; Victor Stinner asked if third-party Python parsers (such as linters and IDEs) might have difficulty. Van Rossum felt certain they could adopt more powerful parsers themselves, if necessary.  The authors plan to switch CPython to the new parser cautiously. In Python 3.9 alpha 6 the new parser will be opt-in; it will become the default in beta 1 and in the official 3.9 release, with the old parser still available by a command line switch. As soon as the new parser is enabled, parenthesized with-statements will be allowed! In Python 3.10 the old parser will be deleted. PEP 617 must still be approved, however, and the new code needs a final review.  The proposal met no opposition; in fact, several in the audience asked whether it could become the default sooner.", "posttime": "2020-05-10 13:41:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,cpython,解析器", "title": "替换CPython的解析器", "title_en": "Replacing CPython’s Parser", "transed": 1, "url": "https://pyfound.blogspot.com/2020/04/replacing-cpythons-parser-python.html", "via": "", "real_tags": ["python", "cpython", "解析器"]}, {"category": "", "categoryclass": "", "imagename": "ab2e0390e497368a818df81a64dfcb99.png", "infoid": 1001486, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Netflix为其即将上映的喜剧“太空部队”(Space Force)投放预告片一天后，实际军事部门发布了其首个征兵视频。\n在周三发布到推特上的一段视频中，显示了火箭、任务控制室和身穿太空服的美国航天部队成员，画外音说，也许你在这个星球上的目的不是在这个星球上。\n空军部长芭芭拉·巴雷特(Barbara Barrett)在周三的一次直播中表示，到目前为止，招募人员对太空部队来说还不是问题。申请者如雪崩般蜂拥而至。\n美军这个第六军种成立于2019年12月，将于2021年年中投入运营。根据一份情况说明书，它的职责包括培养军事空间专业人员，获取军事空间系统，以及完善空间力量的军事理论。\n尊重他人，保持文明礼貌，不离题。我们删除违反我们政策的评论，我们鼓励您阅读这些评论。我们可以随时关闭讨论线程。", "note_en": "A day after Netflix dropped a trailer for its   upcoming comedy Space Force, the   actual military branch has posted its first recruitment video.\n In a video posted Wednesday to Twitter showing rockets, mission control-types rooms and US Space Force members in spacesuits, a voice-over says, &#34;maybe your purpose on this planet isn&#39;t on this planet.&#34;\n  Secretary of the Air Force Barbara Barrett said  during a livestream Wednesday that so far recruitment hasn&#39;t been a problem for the Space Force. &#34;There&#39;s been an avalanche of applicants.&#34;\n This sixth branch of the US military was established in December 2019 and will be operational by mid-2021.  Among its responsibilities will be, &#34;developing military space professionals, acquiring military space systems [and] maturing the military doctrine for space power,&#34; according to a fact sheet.\n  Be respectful, keep it civil and stay on topic. We delete comments that violate  our policy, which we encourage you to read. Discussion threads can be closed at any time at our discretion.", "posttime": "2020-05-10 13:27:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "太空,发布,space,军事", "title": "美国太空部队发布首个招募视频，承认Netflix喜剧“太空部队”", "title_en": "US Space Force Releases First Recruitment Video, Acknowledges Netflix Comedy 'Space Force'", "transed": 1, "url": "https://www.cnet.com/news/first-us-space-force-recruitment-video-wants-you-to-find-your-purpose-off-the-planet/", "via": "", "real_tags": ["太空", "发布", "space", "军事"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001485, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是发表在“设计与规划II--设计与通信中的计算机”一章的略微修订版本。\n有一种广为流传的信念，认为计算机只能做它们被编程要做的事情。这种错误的信念是基于形式和内容的融合。在描述过程时，严格的语法不必精确。程序员必须非常精确地遵循计算机语法，但他想要表达的内容仍然是自由的。语法是僵化的，是因为使用它的程序员，而不是因为计算机。程序员甚至不需要精确到自己的想法--他脑海中可能有一系列可接受的计算机答案，如果计算机的答案不超出这个范围，他可能会很满意。程序员不必将计算机固定在特定的进程中。在一系列不确定的情况下，他可以要求计算机生成新的程序，或者他可以推荐选择规则，并给计算机关于做出哪些选择的建议。因此，对要执行什么或如何执行的计算机编程不需要非常清晰和精确的公式。\n这里提出的论点并不是专门关于设计的，而是关于我们能得到什么计算机来帮助我们做这件事这一普遍问题。由于许多原因，人们习惯于低估可能性。首先，我想警告一下，接受许多相信自己了解情况的人采取的明显温和的立场是有陷阱的。科幻小说家、形形色色的科学家、经济预测家、心理学家，甚至逻辑学家经常告诉我们，计算机永远不会真正思考，这使它成为一个令人信服的故事。我们不能陷入对机器的拟人化思维；它们只做它们的程序所说的，它们不能是原创的或有创意的。(译注：我们不能陷入拟人化的思维方式；它们只能照程序说的做，不能有原创性或创造性。)。\n很容易理解为什么一个人文主义者想要对思维过程的模糊性进行研究，因为在这种模糊性和所期望的拟人化的独特性之间有一个简单的非必然结论。但这并不是最重要的。正在讨论的谬论是一种广为流传的迷信，认为除非一个人对要做什么以及如何做有一个极其清晰、准确的表述，否则我们可以编写一个计算机程序来做某事。科学家--甚至是计算机科学家--传播这种观点的次数至少与人文主义者一样多。\n关于计算机的局限性，我们被告知的内容通常是这样的：计算机不能创造。它只能完全按照它所说的去做。除非一个过程被精确地公式化，否则你不可能让计算机来完成它。现在，这一点在某种意义上是完全正确的，在另一种意义上则是绝对错误的。(工业和信息化部电子科学技术情报研究所陈皓)。在解释原因之前，有趣的是要注意到-早在计算机出现之前-魔鬼也是这样说的：他只能看起来很有创造力。\n玛丽的年龄是安的两倍，当玛丽和安现在一样大的时候。如果玛丽24岁，安多大？\n解决了一些问题，但不是全部问题。在那篇文章中，我关心的是如何更进一步，把这种工作扩展到更多用途的普通智力的方向。但就我在这里的目的而言，即使在他们目前的状态下，他们也可以作为足够的榜样，因为虽然他们能处理的能力有限，但他们已经做了足够的事情来扰乱古老的舒适信念。\n旧的观点认为，程序只不过是一套严格的规则，规定了在每种情况下到底要做什么。对于安抚初学者编程，或者分析初学者编写的程序，这确实是一个有用的观点。然而，对于更高级的程序来说，虽然从某种意义上说是完全正确的，但可以说房子只不过是建筑材料的排列，或者说书籍只是一长串单词。事实上，对我的一篇《科学美国人》文章(1967年1月1日发表在《计算机评论》上)的评论断言，这些程序是由字典查找例程、搜索和比较函数序列以及排序-合并类型操作组成的。\n让我从讨论一种源于好的逻辑学家和坏的哲学家的观点的怀疑态度开始。我们被告知，关于证明逻辑系统自洽的确定性定理具有这样的顺序：发现的过程不可能完全机械化，因此人类总是比机器更有优势。我相信几乎每个读者都听说过哥德尔的定理，而且大多数人都听说过这个所谓的结果。但这不是一个合乎逻辑的结果，因为它是基于粗心的技术疏忽。如果完全适用于解决问题的问题，那么哥德尔定理严格地只适用于完全自洽的逻辑系统。人们并不是如此始终如一，没有任何理由让我们觉得必须沿着这样的路线建造我们的机器。取而代之的是，我们可以，而且已经在做，建造能够容忍相互矛盾的事实断言的机器。要做到这一点，我们必须添加用于解决矛盾的选择规则、用于在不兼容语句之间进行选择的优先级层次结构等等。在伯特伦·拉斐尔1964年的麻省理工学院博士学位论文中描述了这样一个简单的例子。下面是与该程序对话示例：\n拉斐尔的知识收集、问答系统表明，当特定事实与一般原则相冲突时，它如何给予更高的优先级。当然，这是一种相当简单的解决矛盾的方法，只有当语句之间的概括性程度有明显差异时，才能使用这一例外原则。当它们处于相同级别时，程序简单地拒绝后面的语句，如下所示：\n当然，拉斐尔也可以制定其他的优先权规则。顺便说一句，上面这句话是模棱两可的。拉斐尔的程序通常通过研究所涉及的实体是否已知拥有东西或是事物的一部分等来进行正确的猜测。稍后我将更详细地描述这一点。拉斐尔证明了这样的上下文决策可以编程，这说明了一个更一般的观点，或者更确切地说，它显示了一种与其他方法不同的、更健康的对程序的态度。因此，我们将尝试解释其中的一些。\n最普遍和最简单的观点是，计算机程序是对某些数据执行的一系列明确的操作。让我们举一个简单的程序例子：假设X是一个作为输入给出的数字：\n在拉斐尔的程序中，当遇到格式为x的语句具有y#34；时，必须决定是&#34；具有&#34；的意思是拥有&#34；的&34；，还是具有作为部分的&#34；：\n问题一旦被发现，就会被传送到程序的一部分，以便能够回顾以前发生的所有事情。该子计划根据以下基础做出决定：\n(4)如果我们到了这一步，那么我们就知道y已经参与了某件事情的一部分，并被拥有了，我们需要一个更优秀的人。\n设U1和U2分别是我们知道在问题(1)和(2)的答案中存在的事物或集合。这些取决于-y。我们现在问：x是U1或U2的成员，还是U2的子体\n？如果两个都不是，我们就放弃。如果是其中一个，我们选择相应的结果-#34；的一部分，或者&#34；拥有。如果两者都有，我们再次放弃并要求提供更多信息。正如拉斐尔所说：这些标准很简单，但它们足以使程序对歧义词Has的不同句子中的意图做出相当合理的决定。当然，程序可能会被愚弄而犯错误，例如，在上面的对话中，Dick Has a Chain这句话出现在句子之前，John拥有一条链。然而，一个人在类似的情况下接触到一个生词也会犯类似的错误。这里的要点是，通过参考句子描述中的词的描述来自动解决句子意义中的歧义是可行的，所述句子描述可以通过适当地预先暴露于明确的句子而自动创建。&#34；\n因此，程序被指示通过收集先验知识来尝试搜索，以找出x和y是否以一种或另一种方式更密切地相关(如果有关系的话)。该计划的这一部分最好被设想为一个小型审判法庭，或者是一个收集证据和权衡证据的程序。直接把它看作是预先指定的问题解决序列中的一个过程是不好的，而是当程序遇到不一致或歧义时可以咨询的上诉法院。现在，当我们编写一个大型程序时，有许多这样的法院，每个法院都可以在必要时呼吁他人帮助，即使程序员自己已经声明了允许此类上诉的合法原则，但将该程序视为一个序列也变得毫无意义。他可能只是非常不完全地理解，在程序运行过程中，这些程序将在何时何地相互调用。对于一个特殊的法庭，他只粗略地了解了会导致它被传唤的一些情况。简而言之，一旦超过初学者水平，程序员不会简单地编写指令序列。取而代之的是，他们为社交或过程不多的个人写作。尽管我们可能会尝试，但我们很少能提前完全想象到他们互动的所有细节。毕竟，这就是我们需要计算机的原因。\n不仅所有恐惧的人文主义者，而且大多数计算机专家都有这样一种巨大的错觉，即编程本质上是一种精确而刻板的表达媒介，这是建立在形式和内容之间的基本混淆的基础上的。如果诗人被要求以十四行为单位写作，这并不会使他们更精确；如果作曲家必须使用所有十二个音调，它不会限制整体形式；如果设计师只能使用四阶表面，没有人会注意到这一点！那么，在(较老的)编程语言的相当僵硬的语法如何提高描述过程的精确度的问题上找到如此一致的看法是很有趣的。你必须在你的计算机语法(句法)上非常精确才能让你的程序运行，这是完全正确的。不允许有拼写或标点符号错误！但是这让你对你的程序要做什么有一个精确的想法，这是完全错误的。在FORTRAN中，如果你想要你的程序调用一些已经写好的过程，你必须使用一种固定的形式，如&#34；转到。你不能说，&#34；或&#34；继续进行，&#34；等等，所以语法是僵硬的。但是，你几乎可以去任何地方，所以内容是免费的。\n更糟糕的谬误是假设这种僵硬是因为电脑！这是因为指定语言的程序员！在Bobrow的学生项目中，如果你愿意，你可以一次性地输入，使用总是意味着转到，在简单的情况下，它会允许你使用使用而不是Go。当然，这是灵活性的一个简单例子，但这是大多数人不理解的一点：Fortran的刚度是派生的，如果有什么不同的话，那就是它是派生出来的。这当然是灵活性的一个简单例子，但这也是大多数人不理解的一点：Fortran的僵硬是派生出来的，如果有什么不同的话，那就是它是由Fortran的僵硬派生出来的，这是灵活性的一个很小的例子，但大多数人不理解这一点：Fortran的刚度是派生的。\n举一个具有更大灵活性的现代系统的例子，由Warren Teitelman(麻省理工学院博士论文，1966)开发的一种称为Pilot的编程语言，允许程序员通过语言(当前版本)的外部语句在他的程序和语言本身中进行修改。我们通常可以认为这些建议是建议，而不是程序，因为它们是在奇怪的时间编写的，并且通常在默认情况下有条件地应用，或者作为先前建议的结果。下面是一个示例。\n告知进度，如果m是Side-1的成员，m是Side-2的成员，并且(countq side-1m)不等于(countq side-1c)，则退出。(输入系统的早期建议语句集合已用于生成合理的人性化输入语法。)。\n该程序是一种尝试各种范围的启发式搜索\n然而，重点不在于放松语法限制，而在于程序中刚刚做出的修改的忠告性质。Tell Progress&34；语句可以在不太了解&#34；Progress&34；已经如何工作或它在&#34；计划中的位置的情况下做出。&#34；它可能已经受到其他建议的影响，人们可能不清楚何时会使用新建议，何时会忽略它。其他一些功能可能已被修改，因此，在某些情况下，进度根本无法评估情况，而且可能会有人被吃掉。如果发生这种情况，局外人会试着猜测原因。\n他可以选择(1)彻底理解现有的程序并真正解决问题，或者(2)输入一份新的建议声明，描述他想象中的排便情况，并告诉程序不要将传教士转移到被吃掉的位置。(2)他可以选择(1)彻底理解现有的程序并真正解决问题，或者(2)输入一个新的建议声明，描述他想象中的排便情况，并告诉程序不要将传教士转移到被吃掉的位置。当一个程序通过部分理解的补丁和修复程序的演变而变得强大时，程序员开始失去对内部细节的跟踪，不再能预测会发生什么-并开始希望而不是知道，看着程序就好像它是一个行为不可预测的个体。\n这在一些大程序中已经是正确的，但随着我们进入多控制台计算机的时代，它很快就会变得更加尖锐。有了分时系统，大型的启发式程序将由几个程序员开发和修改，每个人在来自不同控制台的不同示例上测试它们，并独立地插入建议。程序将变得无效，但是没有一个程序员会完全理解它。(当然，这并不总是成功的-互动可能会使情况变得更糟，而且可能没有人能够再次修复它！)。现在我们看到了像这样的语句的真正问题，它只做程序员让它做的事情。没有任何一个程序员。\n最后，我们来讨论这样一个问题：当我们想要编写一个程序，但是我们对要做什么或如何做的想法没有完全明确的时候，我们应该做什么。让每个人都对这个问题望而却步的不定论非常简单：\n大前提：如果我写一个程序，它会做一些特别的事情，因为每个程序都会做一些明确的事情。\n其实有两种谬误。首先，说一个人头脑中没有一个特定的结果是不够的。取而代之的是，人们有一个(定义不明确的)可接受的性能范围，如果机器的性能在这个范围内，将会感到高兴。因此，范围越宽，指定程序的纬度就越大。即使写下特定的单词或指令，这也不一定是无效的，因为人们仍然可以自由地将该程序视为一个实例。从这个意义上说，人们可以认为一个特定的书面故事是这个概念的一个实例，这个概念在作者的脑海中可能仍然是不确定的。\n这听起来可能像是一种逃避，在一定程度上确实如此。第二个谬误围绕着我必须写下特殊过程的断言。在每一个不确定的领域，凌晨1点可以自由地指定(而不是特定的程序)程序-生成器、选择规则、关于选择的咨询法院等。因此，行为可以有很大的范围-它不需要两次遵循相同的线，它可以覆盖大致相同的容忍度，这是作者的想法。\n在这一点上，可能会有最后的反对意见：它正好位于这个范围内吗？请记住，我并不是说编程是表达定义不明确的想法的简单方式！要利用这种媒介无与伦比的灵活性，需要极高的技能--技术、智力和审美。要将程序的行为精确地限制在一个范围内可能非常困难，就像一个编写者需要一些技能来表达一定程度的歧义一样。计算机就像一把小提琴。你可以想象一个小说家先是一台留声机，然后是一把小提琴。他说，后者听起来令人毛骨悚然。这是我们从人文主义者和大多数计算机科学家那里听到的论点。他们说，计算机程序对于特定的目的是好的，但是它们不灵活。小提琴和打字机都不是，除非你学会使用。", "note_en": "This is a slightly revised version of a chapter published in  Design and Planning II -- Computers in Design and Communication\n  There is a popular, widespread belief that computers cando only what they are programmed to do. This false belief is based on aconfusion between form and content. A rigid grammar need not make for precisionin describing processes. The programmer must be very precise in following thecomputer grammar, but the content he wants to be expressed remains free. Thegrammar is rigid because of the programmer who uses it, not because of the computer.The programmer does not even have to be exact in his own ideas‑he may have arange of acceptable computer answers in mind and may be content if thecomputer&#39;s answers do not step out of this range. The programmer does not haveto fixate the computer with particular processes. In a range of uncertainty hemay ask the computer to generate new procedures, or he may recommend rules ofselection and give the computer advice about which choices to make. Thus,computers do not have to be programmed with extremely clear and preciseformulations of what is to be executed, or how to do it.\n    The argument presented here is not specifically about&#34;design,&#34; but about the general question of what we can get computersto help us do. For a number of reasons, it is customary to underestimate thepossibilities. To begin, I want to warn against the pitfall of accepting theapparently &#34;moderate&#34; positions taken by many people who believe theyunderstand the situation. Science‑fiction writers, scientists of all descriptions,economic forecasters, psychologists, and even logicians tell us often, and makeit a convincing tale, that computers will never really think.  &#34;We mustnot fall into anthropomorphic ways of thinking about machines; they do onlywhat their programs say; they can&#39;t be original or creative.&#34;\n  It is easy to understand why a humanist will want torhapsodize about the obscurity of thought processes, for there is an easy  nonsequitur  betweenthat obscurity and the desired an anthropomorphic uniqueness. But this isn&#39;tthe  non sequitur  importanthere. The fallacy under discussion is the widespread superstition that we can&#39;twrite a computer program to do something unless one has an extremely clear,precise formulation of what is to be done, and exactly how to do it. Thissuperstition is propagated at least as much by scientists—and even by&#34;computer scientists&#34;—as by humanists.\n  What we are told, about the limitations of computers,usually takes this general form: &#34;A computer cannot create. It can do onlyexactly what it is told. Unless a process is formulated with perfect precision,you cannot make a computer do it.&#34; Now this is perfectly true in onesense, and it is absolutely false in another. Before explaining why, it isinteresting to note that ‑ long before computers ‑ the same was said of theDevil: he could only appear to be creative.\n    Mary is twice as old as Ann was when Mary was as old asAnn is now. If Mary is 24 years old, how old is Ann?\n  and solves some, but not all of them. In that article I wasconcerned with problems of going further, to extend such work in the directionof more versatile general intelligence. But for my purpose here, they can serveas adequate examples even in their present state, for while limited in whatthey can handle, they already do enough to confound the old comfortablesuperstitions.\n  The old view is that a program is &#34;nothing but&#34; aset of rigid rules for exactly what to do in each situation. This is indeed auseful point of view for reassuring beginners at programming, or for analyzingthe programs written by beginners. However, for more advanced processes, while&#34;perfectly&#34; true in one sense, it would be as correct to say that&#34;houses are nothing but arrangements of construction materials&#34; or&#34;books are merely long strings of words.&#34; Indeed, a review of myScientific American article (in Computer Reviews 8, 1, Jan. 1967) asserts thatthese programs are made of &#34;dictionary lookup routines, sequences ofsearch and comparison functions, and sort-merge type operations.&#34;\n    Let mebegin by discussing one of the skeptical attitudes that is derived from somestatements of good logicians and bad philosophers. We are told that certaintheorems about proving the self‑consistency of logical systems have theconsequence: &#34;It is impossible to mechanize completely the process ofdiscovery and therefore humans will always have the advantage overmachines.&#34; I am sure almost every reader has heard of Godel&#39;s theorem, andmost have heard of this alleged consequence. But this is not a logicalconsequence, for it is based on a careless technical oversight. If applicableat all to the problem‑solving question, Godel&#39;s theorem applies strictly onlyto perfectly self‑consistent logical systems. People are not this consistent,and there is no reason whatever why we should feel constrained to build ourmachines along such lines. Instead we can, and already do, build machines thatcan tolerate contradictory factual assertions. To do this, we have to addselection rules for resolving contradictions, priority hierarchies for choosingbetween incompatible statements, and the like. A simple example of such ascheme is described in Bertram Raphael&#39;s 1964 MIT PhD dissertation. Here is anexample of a dialog with that program:\n   à  à  à  à  à  à  à  à  à  à  à  à  à   Raphael&#39;sknowledge‑collecting, question‑answering system shows how it gives higherpriority to particular facts when they conflict with general principles. This&#34;Exception Principle&#34; is, of course, a rather simple‑minded way toresolve contradictions, and it can be only used when there is a cleardifference in level of generality between the statements. When they are on thesame level, the program simply rejects the later statement, as seen here:\n                             But ofcourse Raphael could have written some other priority rule. Incidentally, theprogram&#39;s statement, &#34;The above sentence is ambiguous...&#34; concernsthe possibility that the word &#34;has&#34; might mean either &#34;has as apart&#34; or &#34;owns. &#34; Raphael&#39;s program usually guesses correctlyby a study of whether the entities in question are already known to own things,or to be parts of things, etc. I will describe this later in more detail.Raphael&#39;s demonstration that such &#34;contextual&#34; decisions can beprogrammed, illustrates a more general point, or rather, shows a different andhealthier attitude toward programs than the &#34;nothing but&#34; approach.We will therefore try to explain some of these better ways to think aboutprograms.\n    The mostcommon and simple‑minded view is that a computer program is a sequence ofclear-cut operations to be performed on some data. Let&#39;s take a simple exampleof a program: suppose that X is a number given as input:\n              InRaphael&#39;s program, it has to be decided whether &#34;has&#34; means&#34;owns&#34; or &#34;has as parts&#34; when a statement of the form&#34;x has y&#34; is encountered:\n                  Theproblem, when recognized, is transmitted to a part of the program that is ableto review all that has happened before. This sub‑program makes its decision onthe following basis:\n    (4) If we get to this point, then y is known already tobe involved in being part of something and in being owned and we need a finertest.\n  Let U 1 and U 2 be the &#34;something&#34; or the&#34;some set&#34; that we know exists, respectively, in the answers toquestions (1) and (2). These depend on‑ y. We now ask: is x a member of, or asubject of U 1 or U 2\n? If neither, we give up. If one, we choosethe corresponding result‑&#34;part of&#34; or &#34;owns.&#34; If both, weagain give up and ask for more information. As Raphael says:  &#34;These criteria are simple, yet they are sufficientto enable the program to make quite reasonable decisions about the intendedpurpose in various sentences of the ambiguous word &#34;has.&#34; Of course,the program can be fooled into making mistakes, e.g., in case the sentence,&#34;Dick has a chain,&#34; had been presented before the sentence,&#34;John owns a chain,&#34; in the above dialogue. However, a human beingexposed to a new word in a similar situation would make a similar error. Thepoint here is that it is feasible to automatically resolve ambiguities insentence meaning by referring to the descriptions of the words in the sentence‑descriptionswhich can automatically be created through proper prior exposure to unambiguoussentences.&#34;\n  Thus, the program is instructed to attempt to search thoughits collection of prior knowledge, to find whether x and y are related, if atall, more closely in one or the other way. This &#34;part&#34; of the programis best conceived of as a little trial court, or as an evidence‑collecting andevidence-weighing procedure. It is not good to think of it as a proceduredirectly within a pre‑specified sequence of problem solving, but rather as anappeal court to consult when the program encounters an inconsistency orambiguity. Now when we write a large program, with many such courts, eachcapable if necessary of calling upon others for help, it becomes meaningless tothink of the program as a &#34;sequence.&#34; Even though the programmerhimself has stated the &#34;legal&#34; principles which permit such&#34;appeals,&#34; he may have only a very incomplete understanding of whenand where in the course of the program&#39;s operation these procedures will callon each other. And for a particular &#34;court,&#34; he has only a sketchyidea of only some of the circumstances that will cause it to be called upon. Inshort, once past the beginner level, programmers do not simply write &#39;sequencesof instructions&#39;. Instead, they write for the individuals of little societiesor processes. For try as we may, we rarely can fully envision, in advance, allthe details of their interactions. For that, after all, is why we needcomputers.\n    The great illusion shared not only by all terrifiedhumanists but also by most computer &#34;experts,&#34; that programming is aninherently precise and rigid medium of expression, is based on an elementaryconfusion between form and content. If poets were required to write in units offourteen lines, it wouldn&#39;t make them more precise; if composers had to use alltwelve tones, it wouldn&#39;t constrain the overall forms; if designers had to useonly fourth order surfaces no ‑one would notice it much! It is humorous, then,to find such unanimity about how the rather stiff grammar of (the older)programming language makes for precision in describing processes. It&#39;sperfectly true that you have to be very precise in your computer grammar(syntax) to get your program to run at all. No spelling or punctuation errorsare allowed! But it&#39;s perfectly false that this makes you have a precise ideaof what your program will do. In FORTRAN, if you want your program to call uponsome already written procedure, you have to use one of the fixed forms like&#34;GO TO.&#34; You can&#39;t say &#34;USE,&#34; or &#34;PROCEED ON TO,&#34;etc., so the syntax is stiff. But, you can &#34;GO TO&#34; almost anything,so the content is free.\n A worse fallacy is to assume that such stiffness is becauseof the computer! It&#39;s because of the programmers who specified the language! InBobrow&#39;s STUDENT program, you could type once and for all, if you wish,&#34;USE ALWAYS MEANS GO TO&#34; and in simple situations it would then allowyou to use &#34;USE&#34; instead of &#34;GO T0.&#34; This is, of course, atrivial example of flexibility, but it is a point that most people don&#39;tappreciate: FORTRAN&#39;s stiffness is, if anything,  derived\n For an example of a modern system with more flexibility, aprogramming language called PILOT, developed by Warren Teitelman (Ph.D.dissertation, MIT, 1966), allows the programmer to make modifications both inhis programs and in the language itself, by external statements in the (currentversion of) the language. We can often think of these as &#34;advice&#34;rather than as &#34;program,&#34; because they are written at odd times, andare usually conditionally applied in default situations, or as a consequence ofprevious advice.  An example is the following\n  Tell progress, if m is a member of side‑1 and m is amember of side‑2 and (countq side‑1 m) is not equal to (countq side‑1 c), thenquit.  (An earliercollection of advice statements to the input system has been used to producethe reasonably humanoid input syntax.)\n  The program is a heuristic search that tries variousarrangements and moves, and prefers those that make &#34;progress&#34; towardgetting the people across the river. Teitelman writes the basic program first.But the missionaries get eaten, and the above &#34;advice&#34; says to&#34;modify the progress‑measuring part of the program to reject moves thatleave unequal numbers of missionaries and cannibals on the sides of theriver.&#34; As Teitelman says:\n  This gives the eating conditions to PROGRESS. It is notsufficient to simply count and compare, because when all of the cannibals areon one side with no missionaries, they do outnumber the missionaries 3 to 0.However, nobody gets eaten.\n  The point, however, is not in the relaxation of syntaxrestrictions, but in the advice‑like character of the modification just made inthe program. The &#34;tell progress&#34; statement can be made without knowingvery much about how &#34;progress&#34; works already or where it lies in the&#34;program.&#34; It may already be affected by other advice, and one mightnot have a clear idea of when the new advice will be used and when it will beignored. Some other function may have been modified so that, in certainsituations, &#34;progress&#34; won&#39;t get to evaluate the situation at all,and someone might get eaten anyway. If that happened, the outsider would try toguess why.\n  He would have the options (1) of thoroughly understandingthe existing program and &#34;really fixing&#34; the trouble, or (2) ofentering anew advice statement describing what he imagines to be the defectivesituation and telling the program not to move the missionary into the positionof being eaten. When a program grows in power by an evolution of partially‑understoodpatches and fixes, the programmer begins to lose track of internal details andcan no longer predict what will happen—and begins to hope instead of know,watching the program as though it were an individual of unpredictable behavior.\n  This is already true in some big programs, but as we enterthe era of multiple‑console computers, it will soon be much more acute. Withtime‑sharing, large heuristic programs will be developed and modified byseveral programmers, each testing them on different examples from differentconsoles and inserting advice independently. The program will grow ineffectiveness, but no one of the programmers will understand it all. (Ofcourse, this won&#39;t always be successful‑the interactions might make it getworse, and no one might be able to fix it again!) Now we see the real troublewith statements like &#34;it only does what its programmer told it todo.&#34; There isn&#39;t any one programmer.\n    Finally we come to the question of what to do when we wantto write a program but our idea of what is to be done, or how to do it, isincompletely specified. The  non sequitur  that put everyone off about this problem is verysimple:\n  Major Premise: If I write a program it will do somethingparticular, for every program does something definite.\n      There are really two fallacies. First, it isn&#39;t enough tosay that one doesn&#39;t have a particular result in mind. Instead, one has an(ill-defined) range of acceptable performances, and would be delighted if themachine&#39;s performance lies in the range. The wider the range, then, the wideris one&#39;s latitude in specifying the program. This isn&#39;t necessarily nullified,even when one writes down particular words or instructions, for one is stillfree to regard that program as an instance. In this sense, one could considera particular written-down story as an instance of the concept that still mayremain indefinite in the author&#39;s mind.\n  This may sound like an evasion, and in part it is. Thesecond fallacy turns around the assertion that I have to write down aparticular process. In each domain of uncertainty 1 am at liberty to specify(instead of particular procedures) procedure‑generators, selection rules,courts of advice concerning choices, etc. So the behavior can have wide ranges‑itneed never twice follow the same lines, it can be made to cover roughly thesame latitude of tolerance that lies in the author&#39;s mind.\n  At this point there might be a final objection: does it lieexactly over this range? Remember, I&#39;m not saying that programming is an easyway to express poorly defined ideas! To take advantage of the unsurpassedflexibility of this medium requires tremendous skill‑technical, intellectual,and esthetic. To constrain the behavior of a program precisely to a range maybe very hard, just as a writer will need some skill to express just a certaindegree of ambiguity. A computer is like a violin. You can imagine a novicetrying first a phonograph and then a violin. The latter, he says, soundsterrible. That is the argument we have heard from our humanists and most of ourcomputer scientists. Computer programs are good, they say, for particularpurposes, but they aren&#39;t flexible. Neither is a violin, or a typewriter, untilyou learn how to use it.", "posttime": "2020-05-10 13:26:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,表达,good,程序", "title": "为什么编程是表达理解不足的想法的好媒介(1967)", "title_en": "Why Programming Is a Good Medium for Expressing Poorly Understood Ideas (1967)", "transed": 1, "url": "http://web.media.mit.edu/~minsky/papers/Why%20programming%20is--.html", "via": "", "real_tags": ["编程", "表达", "good", "程序"]}, {"category": "", "categoryclass": "", "imagename": "363258e42e7a6860af8074416217c2d0.jpg", "infoid": 1001484, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "神经学家玛丽安·沃尔夫(Maryanne Wolf)在12年前出人意料地获得了成功，“普鲁斯特和乌贼：阅读大脑的故事和科学”(2007)，这是一项关于识字在人类认知发展中的作用的研究。但当她写完最后几节时，她意识到这本书已经过时了。数字革命已经发生，她埋头于苏美尔文字和希腊字母，以至于没有注意到这一点。她在自己的新书“读者回家”(Reader，Come Home)中承认，她觉得自己就像瑞普·范·温克尔(Rip Van Winkle)，这本书包含了9封写给任何对阅读价值感兴趣的人的伴随信。在这里，沃尔夫使用神经科学的工具来研究从旧印刷品到新屏幕的过渡过程中阅读发生了什么-“阅读大脑的电路将如何被数字媒体的独特特征所改变，特别是在年轻人中。”她的关注点既不是阅读头脑，也不是我们的品味、知识、智力或技能，而是我们大脑中的物理器官。那些其他的事情是由我们的大脑能够和倾向于做什么来决定的。\n沃尔夫从一个遗传事实开始：“人类生来就不是用来读书的。”识字是一项表观遗传成就，将我们视觉和语言的生物学能力延伸到一个新的“回路”中，实现了奇妙的壮举-不仅创造了雷纳·玛丽亚·里尔克(Rainer Maria Rilke)的杰作“杜诺诗篇”(Duino Elegie)，这部小说在沃尔夫年轻时就抓住了她，而且还具有想象其他自我和世界的能力，跟踪复杂的论点，获取和储存知识。她称其为“一项非自然的文化发明”，但它不仅仅将口头文化转化为印刷文化。识字改变了人类的大脑，使其“改装了一些现有的神经元组”，并“形成了新的循环电路”。大脑必须改变，因为与生俱来的大脑不能阅读。如果经常长时间暴露，它会对暴露在什么环境中做出反应。识字是通过实践来发展的-通过劳动来推动修改后的大脑功能的发展。你读得越多，你的大脑适应能力就越强。它是一个“塑料”器官。\n沃尔夫的开场白之后是对阅读生理学的有力描述。她将看似简单的理解字母、单词和句子的过程分解成认知片段，通过不同的脑叶(额叶、颞叶、顶叶和枕叶)和层(最上面的端脑等)追踪阅读过程。她的陈述不能在这里浓缩，因为步骤太多太复杂了。有一段关于读者如何通过“注意力的聚光灯”开始理解一个单词的段落，让我们对这种复杂性有了一个了解：\n第一批聚光灯负责定位注意力系统，它有三个快速完成的任务。首先，它们帮助我们从我们最初关注的任何事情中解脱出来--这些事情发生在我们大脑皮层的顶叶(即，端脑的最上层)。第二，它们帮助我们将注意力转移到我们面前的任何东西上…。。这种移动我们视觉注意力的行为发生在我们的中脑深处(即中脑或第三层)。第三，它们帮助我们集中新的注意力，并在这样做的同时，提醒整个阅读回路为行动做好准备。最后一次阅读前的注意力集中发生在皮层下面的一个特殊区域，该区域充当大脑的主要总机之一：非常重要的丘脑，它位于每个半球的间脑或第二层。\n这就是在任何适当的阅读开始之前会发生的事情！还要记住，这种特殊的关注焦点是“整个阅读循环”的第一步。如果大脑没有预料到单词的阅读，这种情况就不会发生。\n当大脑对书面文字进行更深入的认知时，它会解释内容，就像读者确实在体验一样。阅读大脑和纸质阅读变得如此交织在一起，以至于当人们读到安娜·卡列尼娜(Anna Karenina)跳楼身亡的场景时，“你也跳了起来。”“很有可能，”大脑扫描显示，“当你移动腿和躯干时，当你读到安娜跳到火车前面时，同样的神经元也会被激活。”沃尔夫以此作为证据，证明阅读能培养同理心和想象力，这是识字的两大奇妙结果。阅读还培养了“认知耐心”，这对于批判性智力在与“新奇偏见”作斗争时是必要的。“新奇偏见”是人类对新现象的偏好，因为它们是新的。阅读也激活了背景知识：理解的过程将我们正在阅读的内容与我们已经拥有的知识结合起来，这些知识以某种方式与手头的事情有关，从而使这些知识在我们心中保持活力。\n然而，识字的独创性，以及大脑的神经可塑性，在“读者回家”的后半部分困扰着沃尔夫。如果阅读不是自然的，而是人为的，它可能会变质。如果大脑因为重复而适应了印刷\n在后来的这些信件中，沃尔夫听起来像是数字爱好者经常嘲笑的那种危言耸听的人。毕竟，他们说，阅读不是消亡，而是欣欣向荣。沃尔夫自己引用了加州大学圣地亚哥分校的一项研究，表明平均每个用户每天消耗34G的数据-相当于近10万个单词。\n沃尔夫的答案再次来自神经科学研究，这些研究揭示了纸质阅读和屏幕阅读之间，以及“深度阅读”和快速阅读之间的显著认知和情感差异-这些差异体现在大脑活动中。在一项研究中，研究人员“坦率地说，令人惊讶的是，仅仅通过让他们的文学研究生仔细阅读或为了娱乐而阅读，大脑的不同区域就被激活了，包括涉及运动和触摸的多个区域。”在另一组实验中，在一组人读完纸上的故事后，另一组人在屏幕上读完故事后，第一组比第二组更准确地重建了情节-因为与虚拟文本不同的是，书给了大脑一个具体的行动空间安排。总之，沃尔夫说，纸质阅读大脑比屏幕阅读大脑有更好的记忆力，更多的想象力，更多的沉浸感和耐心，以及更多的知识。生理学证明了这一点。\n沃尔夫恳求的语气--“读者，请回家吧”--源于这样一个事实：尽管存在危险，但屏幕时间正在取代读书时间。这下可麻烦了。“我们数字阅读越多，”她警告说，“我们潜在的大脑回路就越能反映这种媒介的特征。”六千年来，阅读迫使人类大脑加深和拓宽其认知。这是一项辉煌的成就，受到“我们进化的线路和当代文化之间的根本紧张”的威胁。我们正在倒退。\n或者我们是吗？哈佛大学英语教授莉亚·普莱斯认为沃尔夫的担忧有些过头了--后悔屏幕出现的爱书人陷入了一种神话，即他们认为深度、全神贯注的读者是在电脑前阅读的代表。斯文·伯克茨(The Gutenberg Elegie，1994)、尼古拉斯·卡尔(Nicholas Carr)(“谷歌让我们变傻了吗？”)和国家艺术工作人员基金会(National Endowment For The Arts Staff)等书籍爱好者误解了阅读的历史。2004年，国家艺术工作人员基金会(National Endowment For The Arts Staff)撰写了“危险阅读”(The Risk At Risk)报告(我当时在那里工作)。普莱斯都提到了他们，并指责他们将读书视为一种紧张、刻意、孤独的事情，并相信梦幻般的概念，如“读者和作者之间的一种未经调解的交流”。他们的立场是情绪和信仰一样多，普莱斯总结道--“情绪就是恐惧。”\n事实上，普莱斯写道，“严肃的、沉默的、单独的从封面到封面的阅读从来都不只是印刷品的众多用途之一。”一心多用并不是什么新鲜事。阅读通常是草率的、随意的和社交的--故意如此。爱书人后悔的数字实践与阅读的其他用途有很多相似之处-例如，每隔一天阅读一篇博客，阅读18世纪充斥城市的小册子。阅读也不总是理想化的。反数字批评家称赞的全神贯注往往被怀疑是腐蚀年轻人和鼓励懒惰的。最后，普莱斯认为，随着时间的推移，阅读习惯发生了变化，这不仅是因为印刷技术的进步，也是因为现代基础设施的变化，比如公共交通的兴起。爱书人真正担心的不是书籍的消失，而是享受它们所需的时间和空间的消失。\n这些都是争论，听起来足够广泛，以至于需要对自古以来的书籍阅读进行百科全书式的处理。但是当我们谈到书的时候，我们所谈论的只有170页小的，间距松散的文本。陈述是随意的，散文是流畅的。普莱斯自由地将不同的现象混合在一起-例如，她对书籍的直接体验与“阅读疗法”(在医疗中阅读书籍)项目。租用纽约公共图书馆的楼梯举办活动，在2008年电影版《欲望都市》之后变得流行起来，得到了和南北战争前和吉姆·克罗时代阅读一样多的关注。在短短的几页中，我们从15世纪教皇的纵容到1900年英国的印刷生产，再到本·富兰克林的印刷业务(没有生产任何书籍)，再到亚马逊Kindle，然后又回到简·奥斯汀和她对读者借书而不是买书的抱怨。事实来来去去。有一次，在一个标题为“插页：请平放”的部分(开头是普莱斯抬着一个塞满大部头和笔记本电脑的背包，伤了她的脊椎)，每一行文字都横跨接缝，覆盖了两页。这是令人不安的，但它提出了普莱斯关于阅读的可变性的观点。\n普莱斯汇编的细节令人着迷，也很有趣。它们也很好地说明了旧书的使用或多或少符合数字习惯。例如：\n继“圣经”之后，殖民地时期美国最受欢迎的书是“新世纪”。\n拥有书籍并不总是意味着读书。海明威对詹姆斯·乔伊斯的“尤利西斯”赞不绝口，但“他的复制品至今依然干净利落，只剪掉了第一页和最后一页。”\n名人锅炉工在很长一段时间内一直主导着市场。1813年，简·奥斯汀的“傲慢与偏见”只卖出了1500册，而罗伯特·索西的纳尔逊勋爵传记和他可耻的私生活两次售罄。\n出版商并没有把他们的新书吹捧为引人入胜的翻页者，而是有时会做相反的事情，用1835年的一则广告的话说，夸大一本书的能力，使其“被拿起来放在地上，没有任何不便”。价格评论：“对我们来说，打断一本书意味着冲动和不耐烦。但在印刷业历史的大部分时间里，它被证明是文明的自我克制。\n中世纪晚期，我们的廉价平装书(或平板电脑)有了一个漂亮的版本，即所谓的“腰带书”，它挂在人的衣服上，以一种前现代的“便携”形式陪伴着僧侣们到处走。\n书店和图书馆并不总是浏览、购买或借阅的起点。企鹅号商业成功的秘诀之一就是在火车站台和烟草商店里卖书。\n在过去，阅读可能是知识的来源，也可能是精神错乱的迹象，正如塞万提斯告诉我们的那样，唐·吉诃德就是这样：“在几乎没有睡眠和如此多的阅读的情况下，他的大脑干涸了。”歌德的“少年维特的悲伤”引发了无数模仿自杀事件。19世纪的图书馆非常担心过度阅读小说对年轻人的影响，从而限制了他们可以借到的书的数量。\n普莱斯断言，认为网络用户已经抛弃了书籍的流行观念是完全错误的，因为“书中的人也是云中的人”。如果你喜欢在网上阅读，你也会倾向于阅读纸质书。这只是遵循了历史记录，表明“一种技术取代另一种技术的情况是多么罕见。”嗜热者戈蒂埃在1835年宣称，报纸正在扼杀这本书；托马斯·爱迪生在1913年预测，电影将使书籍在教室里过时。\n这些都是引人发笑的事实和典故。它们加在一起，就是一个很有说服力的案例，说明这位忠实的书呆子只是一种过去的读者。然而，我们必须警惕将过去的阅读理想化的忠告并不意味着没有现在的阅读危机。普莱斯将出版收入的上升作为反对天崩地裂的证据。她没有引用的是劳工统计局的一项研究，该研究发现，美国人每天只阅读15分钟，而15-24岁的人每天只有6分钟，尽管他们有5个半小时的空闲时间可以打发。国家艺术基金会报告说，从1992年到2017年，成年人阅读任何书籍(不是为了工作或上学)的比例从前一年的60.9%下降到52.7%。“大众传媒文化心理学”最近的一项研究指出，在70年代末，60%的青少年报告说他们每天读一本书或一本杂志；到了2016年，这一比例骤降至16%。考试成绩也紧随其后。在2018年的ACT上，只有46%的考生在阅读方面达到了“大学准备”，比2011年下降了6分。1972年至2016年的SAT语言成绩下降了36分。尽管投入了数十亿美元的教育资金和致力于阅读教学的重大立法，所有这些都发生了。顺便说一句，低收入家庭的孩子比高收入家庭的孩子花在屏幕上的时间要多得多，而且他们在阅读测试中的成绩也更差。(我们仍然存在“数字鸿沟”，但这与20年前的情况相反，当时民主党人担心穷人联系不充分，会进一步落后。)。这是一个阅读问题，普莱斯收集的历史证据只触及了它的边缘。\n用不了多久，在个人电脑消失之前，所有活着的记忆都会消失。人们将不再根据人们记忆中没有电脑的生活背景来解释屏幕的意义。莉亚·普莱斯(Leah Price)和玛丽安·沃尔夫(Maryanne Wolf)伴随着书籍长大；他们的童年是纸质的，而不是数字的。我怀疑，普莱斯之所以想缓和数字革命的影响，是因为一种自由主义的冲动，即带着彬彬有礼的微笑接受文化变革。这就是通行的礼仪。我曾多次目睹我的人文学科的同事们耸耸肩，收到流行文化与他们的知识兴趣越来越远的消息。批评人们的文化选择对他们来说是不得体的。但是，每一项调查都显示，年轻人的闲暇时间里阅读时间很少，而屏幕上的时间却很多，人们越来越难不分享沃尔夫的沮丧。", "note_en": "Neuroscientist Maryanne Wolf had a surprise hit a dozen years ago,  Proust and the Squid: The Story and Science of the Reading Brain (2007), a study of literacy’s role in the development of human cognition. But as she wrote the final sections, she realized the book had already become dated. The Digital Revolution had happened, and she was too buried in Sumerian scripts and Greek alphabets to notice. She felt like Rip van Winkle, she admits in her new book,  Reader, Come Home, comprising nine companionable letters addressed to anybody interested in the value of reading. Here, Wolf uses the tools of neuroscience to examine what happened to reading in that transition from old print to new screens—“how the circuitry of the reading brain would be altered by the unique characteristics of the digital medium, particularly in the young.” Her focus is neither the reading  mind, nor our tastes, knowledge, intelligence, or skills, but the physical organ inside our heads. Those other things are shaped by what our brains are able and disposed to do.\n  Wolf begins with a genetic fact: “human beings were never born to read.” Literacy is an epigenetic achievement, extending our biological capacities for vision and language into a new “circuitry” that performs wondrous feats—not only the creation of masterpieces such as Rainer Maria Rilke’s  Duino Elegies, which grabbed Wolf when she was young, but the capacity to imagine other selves and worlds, follow complex arguments, and acquire and store knowledge. She calls it “an unnatural cultural invention,” but it did more than transform oral cultures into print cultures. Literacy altered the human brain, making it “refit some of its existing neuronal groups” and “form newly recycled circuits.” The brain had to change because the innate brain can’t read. It responds to what it is exposed to  if exposure happens often, for a long period. Literacy develops through practice—through labor that compels the development of revised brain functions. The more you read, the more your brain adapts. It is a “plastic” organ.\n What follows Wolf’s opening statements is a  tour de force description of the physiology of reading. She breaks down the seemingly simple process of understanding letters, words, and sentences into its cognitive pieces, tracking the course of reading through different lobes (frontal, temporal, parietal, and occipital) and layers (uppermost telencephalon, etc.). Her presentation can’t be condensed here because the steps are so numerous and complex. One paragraph on how a reader begins to apprehend a single word through “spotlights of attention” gives an idea of this complexity:\n The first spotlights, which do the work of the orienting attentional system, have three quickly accomplished jobs. First, they help us  disengage  from whatever we were originally attending to—which takes place in the parietal lobe of our cortex (i.e., in the telencephalon’s uppermost layer). Second, they help us  move our attention to whatever is in front of us…. This act of moving our visual attention takes place deep in our midbrain (i.e., in the mesencephalon, or third layer). Third, they help focus our new attention and, in so doing, alert the entire reading circuit to prepare for action. This last pre-reading focusing of attention takes place in a special area below the cortex that functions as one of the brain’s major switchboards: the very important thalamus, which resides in the diencephalon, or second layer, of each hemisphere.\n And that’s what happens before any proper reading can begin! Keep in mind, too, that this particular spotlight of attention is a primary step in an “entire reading circuit.” It wouldn’t happen if the brain were not anticipating the reading of a word.\n As the brain proceeds to deeper cognitions of written words, it interprets the content as if the reader were actually experiencing it. The reading brain and the print read become so intertwined that when one reads the scene in which Anna Karenina leaps to her death, “you leaped, too.” “In all likelihood,” brain scanning shows, “the same neurons you deploy when you move your legs and trunk were also activated when you read that Anna jumped before the train.” Wolf takes this as proof that reading fosters empathy and imagination, two marvelous consequences of literacy. Reading also cultivates “cognitive patience,” necessary to the critical intellect as it struggles against “novelty bias”—the human preference for new phenomena because they are new. Reading activates background knowledge, too: the process of comprehension combines what we are reading with the knowledge we already have that is somehow related to the matter at hand, thus keeping that knowledge alive in us.\n The very inventedness of literacy, however, along with the neuroplasticity of the brain, troubles Wolf in the second half of  Reader, Come Home. If reading is not natural but invented, it can deteriorate. If the brain adapted to print because of repeated exposure, it can adapt away if exposure slows. The circuit will break if unused, or if something different from print draws more of the brain’s attention. If screens take the place of paper, the brain will react.\n “What Will Become of the Readers We Have Been?” she asks in Letter Four, which rehearses oft-noted drawbacks of the screen habitat. Hyperstimulation is one; “continuous partial attention,” whereby one attends to several things at once—Instagram, TV, texting—but none deeply, is another; an environment that rewards short attention spans is a third. Wolf backs these observations with neurological data. She quotes other scientists who say, for instance, “[m]ultitasking created a dopamine-addiction feedback loop, effectively rewarding the brain for losing focus.” She cites data on the extent to which virtual reading has replaced paper reading (for example, 20-year-olds checking their phones 150-190 times per day). She points out how the “physical and temporal  thereness of books” provides a tactile support for the reading circuit’s development that e-books do not, while noting e-books nonetheless continue to spread to classrooms and children’s bedrooms. “Behind our screens, at work and at home, we have sutured the temporal segments of our days so as to switch our attention from one task or one source of stimulation to another. We cannot but be changed.”\n  In these later letters, Wolf sounds like the kind of alarmist digital enthusiasts often deride. After all, they say, reading is not dying; it’s thriving. Wolf herself quotes a study from the University of California, San Diego, showing that an average user consumes 34 gigabytes of data per day—the equivalent of nearly 100,000 words.\n Wolf’s answer comes, once again, from neuroscientific studies revealing significant cognitive and affective differences between print and screen reading, and between “deep reading” and fast reading—differences that show up in brain activity. In one study, researchers “were frankly surprised that just by asking their literature graduate students either to read closely or to read for entertainment, different regions of the brain became activated, including multiple areas involved in motion and touch.” In another, after one group read a story on paper, another on screens, the first reconstructed the plot more accurately than the second—for a book, unlike a virtual text, gives the brain a concrete spatial arrangement for the action. In sum, Wolf says, the paper reading brain has better memory, more imagination, immersion, and patience, and more knowledge than the screen reading brain. The physiology proves it.\n Wolf’s pleading tone—“reader, please, come home”—follows from the fact that, in spite of the dangers, screen time is displacing book time. We are in trouble. “The more we read digitally,” she warns, “the more our underlying brain circuitry reflects the characteristics of that medium.” For six millennia, reading compelled the human brain to deepen and widen its cognitions. It is a glorious achievement, threatened by a “fundamental tension between our evolutionary wiring and contemporary culture.” We are moving backward.\n  Or are we? Harvard English professor Leah Price thinks Wolf’s worry overdone—that bibliophiles who regret the advent of screens are caught up in a myth of the deep, all-absorbed book reader whom they take as representative of reading before computers. Book-lovers such as Sven Birkerts ( The Gutenberg Elegies, 1994), Nicholas Carr (“Is Google Making Us Stupid?”), and the National Endowment for the Arts staff who produced the 2004 report  Reading at Risk (I worked there at the time) misconstrue reading’s history. Price mentions them all and chides them for seeing book reading as an intense, deliberate, solitary affair and believing in dreamy notions such “an unmediated communion between a reader’s mind and an author’s.” Their position is as much mood as belief, Price concludes—and “[t]hat mood is fear.”\n In truth, Price writes, “serious, silent, solitary cover-to-cover reading has never been more than one of many uses to which print had been put.” Multitasking is nothing new. Reading was usually cursory, haphazard, and social—purposely so. And the digital practices bibliophiles regret have much in common with other uses of reading—for instance, reading a blog every other day and reading pamphlets that flooded cities in the 18th century. Reading wasn’t always idealized, either. The total absorption that anti-digital critics praise was often suspected of corrupting the youth and encouraging idleness. Finally, Price argues, reading habits have changed over time not only because of advances in print technology, but also because of changes in modern infrastructure such as the rise of public transportation. What bibliophiles really fear isn’t the disappearance of books but the elimination of the time and space needed to enjoy them.\n Those are the contentions, which sound sweeping enough to require an encyclopedic treatment of book reading from ancient times forward. But  What We Talk About When We Talk About Books has only 170 small, loosely-spaced pages of text. The presentation is casual, the prose fluid. Price mixes different phenomena freely—for example, her direct experience of books with projects of “bibliotherapy” (book reading in medical care). Renting the New York Public Library staircase for events, which became popular after the 2008 film version of  Sex and the City, gets as much attention as reading in the antebellum and Jim Crow eras. In but a few pages we leap from 15th-century papal indulgences to print production in Britain in 1900 to Ben Franklin’s printing business (which produced no books) to the Amazon Kindle—then back to Jane Austen and her complaint that readers borrowed books instead of buying them. Facts come and go. At one point, in a section headed “Interleaf: Please Lay Flat” (which begins with Price injuring her spine hefting a backpack stuffed with tomes and a laptop), each line of text runs across the seam and covers both pages. It’s disconcerting, but makes Price’s point about the variability of reading.\n  The details price compiles are fascinating and amusing. They nicely illustrate, too, older book-uses more or less consonant with digital habits. For instance:\n The most popular book in Colonial America after the Bible was the New England Primer, but “nowhere in the world today can you find a copy of the Primer published before 1727.” It was too common for librarians to bother collecting. Sometimes, the most influential books are judged disposable.\n Book owning didn’t always mean book reading. Hemingway praised James Joyce’s  Ulysses loudly, but “his copy survives crisp and clean to this day, with only the first and last pages cut.”\n Celebrity potboilers have dominated the market for a long time. In 1813, Jane Austen’s  Pride and Prejudice sold a meager 1,500 copies, while Robert Southey’s biography of Lord Nelson and his scandalous private life sold out twice.\n Rather than touting their latest books as compelling page-turners, publishers sometimes did the opposite, playing up a book’s capacity to “be taken up and laid down without inconvenience,” as an 1835 ad put it. Price comments: “For us, interrupting a book denotes impulsivity and impatience. But for most of print’s history, it proved civilized self-restraint.”\n The late Middle Ages had a nifty version of our cheap paperback (or tablet), the so-called “girdle book” that hung from one’s clothing and accompanied monks everywhere in a pre-modern form of “portability.”\n Bookstores and libraries haven’t always been Ground Zero for browsing and buying or borrowing. One secret of Penguin’s commercial success was to sell books on train platforms and in tobacco shops.\n In the past, reading could be a source of knowledge—or a sign of derangement, as it was for Don Quixote, as Cervantes tells us: “with virtually no sleep and so much reading he dried out his brain.” Goethe’s  The Sorrows of Young Werther provoked numerous copycat suicides. Nineteenth-century libraries worried enough about the effect of excessive novel reading on young people to cap the number of books they could borrow.\n The popular notion that web users have abandoned books is flat wrong, Price asserts, for “people of the book are also people of the cloud.” If you like to read online, you tend to like to read paper, too. This merely follows the historical record showing “how rarely one technology supersedes another.” Théophile Gautier declared in 1835 that the newspaper was killing the book; Thomas Edison in 1913 predicted that movies would make books obsolete in classrooms.\n  These are diverting facts and allusions. They add up to a persuasive case for the devoted bookworm as just one type of past reader. Nevertheless, the sound advice that we must beware of idealizing past reading doesn’t mean there is no present reading crisis. Price cites rising publishing revenues as evidence against the-sky-is-falling. What she doesn’t cite is a Bureau of Labor Statistics study that found Americans read “for personal interest” only 15 minutes a day—and 15-24 year-olds only six minutes per day, despite having five-and-a-half hours of leisure time to fill. The National Endowment for the Arts reports that from 1992 to 2017 the portion of adults who read any book (not for work or school) over the preceding year fell from 60.9% to 52.7%. A recent study in  Psychology of Popular Media Culture noted that in the late ’70s 60% of teens reported reading a book or magazine every day; by 2016 the rate had plummeted to 16%. Test scores have followed suit. On the 2018 ACT, only 46% of test-takers reached “college readiness” in reading, a drop of six points from 2011. SAT verbal scores from 1972 to 2016 fell 36 points. All of this happened despite billions of education dollars and major legislation devoted to reading instruction. Low-income kids spend much more time on screens than do high-income kids, by the way, and they score more poorly on reading tests. (We still have a “digital divide,” but it’s the reverse of the one from 20 years ago when Democrats worried that the poor weren’t adequately connected and would fall further behind.) There is a reading problem, and the historical evidence Price assembles touches only its edges.\n It won’t be long before all living memory of a time before the personal computer is gone. People will no longer address the meaning of screens from the remembered background of a computer-free life. Leah Price and Maryanne Wolf grew up with books; they had a print childhood, not a digital one. Price aims to soften the impact of the Digital Revolution, I suspect, because of a liberal impulse to accept cultural change with an urbane smile. That’s the going etiquette. I have witnessed many times my humanities colleagues receive news of popular culture drifting ever farther from their intellectual interests with a shrug. It is unseemly to them to criticize people for their cultural choices. But with every survey showing meager reading time and massive screen time in the leisure hours of the young, it is increasingly difficult not to share Wolf’s dismay.", "posttime": "2020-05-10 13:26:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "无书,bookless,阅读", "title": "我们的无书未来", "title_en": "Our Bookless Future", "transed": 1, "url": "https://claremontreviewofbooks.com/our-bookless-future/", "via": "", "real_tags": ["无书", "bookless", "阅读"]}, {"category": "", "categoryclass": "", "imagename": "5c283e9bfb9052d813b50e63d7cf8f88.jpg", "infoid": 1001483, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Windows内置了很多广告。这不仅仅是免费更新的问题，即使你购买了一台带有Windows 10证书的新电脑，或者投资200美元购买了Windows 10专业版，你也会在软件中看到广告。但是，您可以阻止它中的很多内容。在本文中，我们将指导您完成禁用所有内置Windows10广告的整个过程。\n要禁用所有内置Windows 10广告，请逐步按照以下步骤操作：\n单击搜索按钮。在搜索栏中键入Settings并选择选项，如下图所示：\n现在选择上图中突出显示的个性化选项。一旦您选择个性化选项，就会出现以下屏幕：\n如您所见，屏幕分为两部分。从屏幕左侧选择Lock Screen(锁定屏幕)选项，如上图所示。单击Lock Screen(锁定屏幕)选项后，将出现以下屏幕：\n现在从背景下拉菜单中选择图片或幻灯片。关闭锁定屏幕上名为“从Windows和Cortana获取有趣的事实、提示和更多信息”的切换按钮。来自锁定屏幕的广告将被禁用。\n要从“开始”菜单禁用这些应用程序，请在“开始关闭”中旋转名为“偶尔显示建议”的切换按钮，如上图中突出显示的那样。\n单击搜索按钮。在搜索栏中键入Settings并选择选项，如下图所示：\n从Windows设置屏幕中选择系统选项，如上图中突出显示的那样。一旦您选择系统选项，将出现以下屏幕：\n如您所见，屏幕分为两部分。从屏幕左侧选择通知和操作选项，如上图所示。单击该选项后，将出现以下屏幕：\n现在，在使用Windows时关闭名为“获取提示、技巧和建议”的切换按钮，以禁用广告。\n在通知和操作的同一屏幕上，关闭名为“在更新后向我显示Windows欢迎体验”的切换按钮，偶尔在我登录时也会关闭，以突出显示新增功能和建议功能。\n要禁用Cortana广告，请关闭名为“让Cortana不时显示思想、问候和通知”的切换按钮，如上图中突出显示的搜索框中所示。\n单击上图中突出显示的选项菜单。单击选项菜单后，将出现以下对话框：\n从对话框中选择视图选项卡，如上图中突出显示的那样。将显示以下选项：\n取消选中名为显示同步提供程序通知的复选框以禁用播发。然后单击Apply(应用)和OK(确定)按钮。\n在右键单击Windows应用商店图标时，选择更多-&&gt;关闭动态磁贴，如上图中突出显示的那样。\n单击搜索按钮。在搜索栏中键入Settings并选择选项，如下图所示：\n从Windows设置屏幕中选择设备选项，如上图中突出显示的那样。只要您单击Devices(设备)选项，就会出现以下屏幕：\n如您所见，屏幕分为两部分。如上图所示，从屏幕左侧选择钢笔&amp；Windows墨水。要禁用广告，请取消选中名为显示推荐的应用程序建议的复选框，如下所示：\n按照此步骤操作，您将能够禁用Windows 10的所有内置广告。", "note_en": "Windows has a lot of advertisements built-in. This is not just about the free update offer, you will see the advertisement in your software even if you buy a new PC that arrives with a Windows 10 certificate or invests $200 on a version of Windows 10 professional. However, you can block a lot of it. In this article, we will guide you through the whole procedure to disable all of the built-in Windows 10 ads.\n    To disable all of the built-in Windows 10 ads, follow this procedure step by step:\n    Click the  Search button. Type  Settings in the search bar and select the option as the following image is showing:\n        Now choose the  Personalization option as highlighted in the above image. As soon as you will choose the  Personalization option, the following screen will appear:\n    As you can see that the screen is divided into two parts. Select the  Lock screen option from the left side of the screen as the above image is indicating. After clicking on the  Lock screen option, the following screen will appear:\n    Now choose the  Picture or  Slideshow from the  Background drop down. Turn off the toggle button named  Get fun facts, tips, and more from Windows and Cortana on your lock screen. Ads from the lock screen will be disabled.\n            To disable the apps from the Start menu, turn the toggle button named  Show suggestions occasionally in Start off as highlighted in the above image.\n    Click the  Search button. Type  Settings in the search bar and select the option as the following image is showing:\n        Choose the  System option from the  Windows Settings screen as highlighted in the above image. As soon as you will select the  System option, the following screen will appear:\n    As you can see that the screen is divided into two parts. Select the  Notifications &amp; actions option from the left side of the screen as highlighted in the above image. After clicking the option, the following screen will appear:\n    Now turn the toggle button named  Get tips, tricks and suggestions as you use Windows off in order to disable ads.\n    On the same screen of  Notifications &amp; action, turn off the toggle button named  Show me the Windows welcome experience after updates and occasionally when I sign in to highlight what’s new and suggested.\n              To disable the Cortana ads, turn off the toggle button named  Let Cortana pipe up from time to time with thoughts, greetings, and notifications in the Search box as highlighted in the above image.\n            Click the  Options menu as highlighted in the above image. After clicking the  Options menu, the following dialogue box will appear:\n    Choose the  View tab from the dialogue box as highlighted in the above image. The following options will appear:\n    Uncheck the checkbox named  Show sync provider notifications to disable the advertisements. Then click the  Apply and  OK button.\n          As you will right-click the  Windows Store icon, choose  More -&gt;  Turn Live Tile off as highlighted in the above image.\n    Click the  Search button. Type  Settings in the search bar and select the option as the following image is showing:\n        Choose the  Devices option from the  Windows Settings screen as highlighted in the above image. As soon as you will click the  Devices option, the following screen will appear:\n    As you can see that the screen is divided into two parts. Select the  Pen &amp; Windows Ink from the left side of the screen as above is indicating. To disable ads, uncheck the checkbox named  Show recommended apps suggestions as follows:\n      By following this procedure you will be able to disable all of Windows 10’s built-in ads.", "posttime": "2020-05-10 13:26:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,windows,windows-10,内置,built", "title": "如何禁用所有内置Windows 10广告", "title_en": "How to disable all of the built-in Windows 10 ads", "transed": 1, "url": "https://www.faqforge.com/windows/windows-10/how-to-disable-all-of-the-built-in-windows-10-ads/", "via": "", "real_tags": ["广告", "windows", "内置", "built"]}, {"category": "", "categoryclass": "", "imagename": "e6d80c350e31356faae097050cf477e4.jpeg", "infoid": 1001482, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个故事始于2018年5月。那个月我给自己买了一辆树莓派3B。我有一个模糊的想法，想用它做一面智能镜，但很快就意识到：\n我摆弄着Raspbian，试图加载谷歌助手，这样我就可以给自己买一个便宜的谷歌主页。不幸的是，Google Assistant SDK存在一些破坏交易的限制。像热词检测这样简单的事情很难设置，充其量也就是偶然事件。\n也许它可以是一个“我的世界”服务器？结果发现，Mincraft Java版服务器根本不适合内存仅为1 GB的设备。\n在此之前大约4个月，我在大学学习了操作系统入门课程。我们对哈佛大学创建的教学操作系统OS/161进行了修改。我个人很喜欢那个课程，因为我们在兔子洞里只走了几英寸，我有很多问题没有回答。我的覆盆子PI需要比35美元的纸镇…更好的东西。\n如果你读到问题时深深地叹了口气，我不会责怪你。当涉及到这样的事情时，我是相当天真的。这种天真就是我没有立即放弃这个想法的原因。事实上，我用另一种同样天真的观点来支持它：\n好了，别再提那些卑鄙的事了。我已经下定决心了。我决定写一种操作系统。我的目标是什么？\n如果我能让它做任何有用的事，那就是奇迹了。我们就当这是一次学习经历吧。\n做任何复杂的事情(连接到互联网、使用HDMI等)。是完全没有问题的。\n就这样，在2018年5月的一个决定性的日子里，它开始了。这是一个周末的黑客马拉松，开始了一年多的操作系统编写之旅。\n很明显，我没有在那个周末构建操作系统。事实上，我继续在黑暗中摸索。我决定慢慢来。将不会有代码的盲目复制。我会做一些研究，看一些手册。然后我会拼凑一些代码。加上一些评论和大量的待办事项。经常失败。再试试。冲洗并重复。\n自2018年以来，该项目已经取得了长足的进步。我会花几个星期的时间练习它，然后在上课的时候把它放在一边几个月。\n顺便说一句，我到目前为止写的并不是真正的操作系统。它还不够复杂。正确的术语应该是裸机程序。\n到目前为止，该程序实现了虚拟内存和中断等概念。这里有一些用于线程化的初始代码。它使用帧缓冲区通过HDMI输出基本形状和VGA字体。我还在对一些实现USB的代码进行反向工程！\n当试图编写操作系统时，会有过多的细节。您可以以任何您想要的方式实现一切，因为作为开发人员，您拥有很大的控制权。这也意味着有大量的事情需要跟踪。当一切都开始破裂时，很难找出原因。\n我一直发现，一个好的学习方法很难做到。对于那些对嵌入式开发感兴趣的人，我建议您尝试一下这样的方式！我是在几乎没有经验的情况下进入的，而且走了这么远，所以我绝对可以想象会有更多的人做同样的事情！\n你可以在GitHub上找到我的项目。我试着把事情记录下来，并尽可能地跟踪我的进度。我的承诺不是最好的，所以请注意。", "note_en": "This story begins in May 2018. I bought myself a Raspberry Pi 3B that month. I had the vague idea of using it to make a smart mirror, but soon realized that:\n   I toyed with Raspbian and tried to load up the Google Assistant, so I could get myself a cheap Google Home. Unfortunately, there were some deal-breaking limitations on the Google Assistant SDK. Simple things like hotword detection were difficult to setup and a hit-or-miss affair at best.\n Maybe it could be a Minecraft Server? Turns out, the Minecraft Java Edition server is not at all suitable for devices with a piddly 1GB of RAM.\n  About 4 months prior to this, I had taken an introductory Operating Systems course at University. We made modifications to OS/161, an instructional operating system that was created at Harvard. I personally loved that course and because we had gone mere inches into the rabbit hole, I had a lot of unanswered questions. And my Raspberry Pi needed to be something more than a $35 paperweight…\n    If you took a deep sigh when you read the question, I don’t blame you. I’m fairly naïve when it comes to matters like these. That naïveté is why I didn’t dismiss the idea immediately. In fact, I bolstered it with another, equally naïve sentiment:\n        OK, enough with the cringey stuff. My mind was made up. I had decided to write some kind of an operating system. What were my goals?\n It would be a miracle if I could make it do anything useful. Let’s just call it a learning experience.\n  Doing anything sophisticated (connecting to Internet, using HDMI, etc.) would be completely out of question.\n And thus it began, on one fateful day in May 2018. A weekend hackathon that started off a 1+ year journey into writing an operating system.\n  Obviously I didn’t build an operating system in that weekend. In fact, I continue to fumble in the dark. I had decided to take things slowly. There would be no blind copying of code. I’d do some research and read manuals. Then I’d slap together some code. Throw in some comments and a lot of TODOs. Fail a lot. Try again. Rinse and repeat.\n      The program has come a long way since 2018. I would work on it for a few weeks then leave it alone for months while I was going through classes.\n Incidentally, what I’ve written so far is not really an operating system. It’s not sophisticated enough. The correct term would be a bare-metal program.\n So far, the program implements concepts like Virtual Memory and Interrupts. There’s some initial code for threading. It uses a framebuffer to output basic shapes and VGA fonts over HDMI. I’m also reverse-engineering some code that implements USB!\n  There’s a plethora of fine details when trying to write an operating system. You can implement everything in any way you want, because as the developer, you have a lot of control. That also means there’s an overwhelming number of things to keep track of. And when everything start to break, it’s hard to figure out why.\n I’ve always found that a good way to learn is to do. For those who are interested in embedded development, I would recommend trying something like this! I entered with next to no experience and got this far, so I can definitely imagine more people doing the same!\n You can find my project on  GitHub. I tried to document things and track my progress wherever I could. I wasn’t the best with my commits, so be warned.", "posttime": "2020-05-10 13:25:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "托瓦尔,torvalds,事情", "title": "如果托瓦尔兹能做到的话。", "title_en": "If Torvalds can do it...", "transed": 1, "url": "https://medium.com/@cde3d29d703f/c2ff58e049d7", "via": "", "real_tags": ["托瓦尔", "torvalds", "事情"]}]