[{"category": "", "categoryclass": "", "imagename": "62b7bb36b176aa66d66859238e80ee08.gif", "infoid": 1004708, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "3月初，我在我们的编辑中写了一篇关于网格渲染的文章。在我们进入今天的主题之前，我想展示一下我自上一篇文章以来添加的网格渲染的一个小功能，即在启用捕捉的情况下渲染对象局部网格，以指导对象的移动：\n我认为结果相当不错，感觉像是一个很好的例子，说明了Mechanical的模块化在实践中是如何工作的-只需查询对tm_grid_renender_api的访问，并添加您的插件可能需要的任何网格渲染。\n不管怎样，我们继续吧。在今天的帖子中，我们将讨论如何挑选老鼠。\n当用户在视口内单击时，所有类型的3D编辑器都需要某种方法来确定鼠标指针下碰巧出现的任何对象的对象标识。我会把这个过程称为“挑选”。\n拾取，就像网格渲染一样，通常被认为是图形程序员关心的或者不重要的问题之一。相反，有些工具程序员往往会以这样或那样的方式提出解决方案。通常，通过鼠标指针将某种形式的光线从视口摄影机的位置投射到摄影机的近平面上。\n整个情况，渲染和工具人员之间截然不同的竖井，渲染程序员的首要态度，以及两个最常见的问题解决方案，在很多方面都很糟糕，让我想哭。\n例如，当您需要拾取不具有形而上学表示的对象时，物理系统就会崩溃，并且通常在视口中渲染的许多对象不需要形而上学表示。一种常见的用户解决方法是开始添加物理表示，仅仅是为了使编辑器中的内容可拾取。不理想的…。\n另一方面，实现仅用于编辑拾取的特定光线投射系统可能需要大量的工作。当然，该实现不一定是世界上最快的，因为您通常每帧(或更少)只投射一条光线，但是，您肯定需要某种加速结构(如BVH-tree)，因为您肯定希望拾取实际渲染的三角形，而不是某个代理。这种结构既会消耗内存，又要花一些时间来烹饪，一旦您开始处理包含大量对象(&gt；10K)的稍微复杂的场景，您可能就需要添加另一个级别的加速结构。(&lt;##**$$}{##**$$})\n更不用说，这两种方法都不太可能处理对可变形对象(如蒙皮角色)的拾取，或对Alpha蒙版对象(例如，树上树叶之间的对象)的拾取，或处理纯粹基于体素的对象，或任何类型的“纳米”解决方案。\n很明显，这不是你想要的。即使在CPU上实现一个像样的解决方案是可行的，您真正想要的是一个基于GPU的拣选解决方案。您想知道鼠标光标下的像素的身份，而不是某个看不见的代理的身份。当您使用处理所有类型的几何体变形和曲面类型的象素完美解决方案时，您将永远不会再接受任何不太精确的解决方案。\n具有讽刺意味的是，实现基于GPU的拣选解决方案的基础实际上非常简单，比您能想到的任何基于CPU的拣选解决方案都容易得多。那么让我们来看看我们在“机械”中的实现。\n首先，我们的解决方案依赖于几个前提条件，所以让我们把它们去掉，因为我不会在这篇文章中更详细地介绍它们：\n首先，我们依赖于我们的着色器系统能够有效地为视口中所有绘制的对象选择不同的着色器变体。我们使用本文描述的“系统”概念来处理这个问题。\n其次，我们始终依赖于支持将无序访问视图(UAV)绑定到像素着色器的硬件。\n所以这个想法很简单。当用户在视口内单击时，我们将激活一个名为Pick_System的特殊着色器系统。这意味着实现对Pick_System支持的任何着色器将在用于在屏幕上渲染对象的像素(或计算)着色器中激活略有不同的代码路径。\n激活的着色器变体添加了对在PICKING_SYSTEM中定义的UPDATE_PICKING_BUFFER()的调用。实际的拾取缓冲区与一个12字节的缓冲区一样愚蠢，绑定为auav，包装了一个简单的结构：\n//`pos`应为SV_Position.xy(或CS类似的文字)。/`Identity`为渲染对象的唯一标识。在TM中，这通常是发布GPU工作的实体的ID。/`z`是着色点的Z深度值。/`opacity`是当前着色像素的不透明度值。void update_Pick_Buffers(uint2位置，uint2身份，浮动z，浮动不透明度){//如果像素的不透明度小于&#34；不透明度拾取阈值&#34；//--返回。if(opacity&lt；load_opacity_Threshold())返回；//如果该像素不在鼠标光标下--返回。uint2 CURSOR_POS=LOAD_CURSOR_POS()；IF(pos.x！=Cursor_pos.x||pos.y！=Cursor_pos.y)return；//将像素z与//PICKING_BUFFER中当前存储的z值进行比较。如果它大于或等于(后面)--返回。uint d=asuint(Z)；if(d&gt；=Pick_Buffer.Load(0))return；//更新拣货缓冲区。PICKING_Buffer.Store3(0，uint3(d，身份))；}。\n虽然这种幼稚的实现在大多数情况下会产生正确的拾取结果，但它有时会失败，并返回最近曲面后面的拾取结果。这是因为我们需要防止并发访问PICKING_BUFFER。\n我们可以结合使用原子和利用d的符号位来实现自旋锁定机制，以防止对PICKING_BUFFER进行并发更新。该实现是一个bithair，但看起来如下所示：\nuint d=asuint(Z)；uint current_d_or_lock=0；do{//`z`在存储的z值后面，立即返回。if(d&gt；=PickingBuffer.Load(0))返回；//执行原子min。`current_d_or_locked`保存当前存储的//值。PICKING_Buffer.InterlockedMin(0，d，CURRENT_d_OR_LOCKED)；//我们依靠符号位来指示拣选缓冲区是否//当前被锁定。这意味着只有当//缓冲区解锁并且`d`小于当前存储的`d`时，才会进入此分支。if(d&lt；(Int)current_d_or_lock){uint last_d=0；//尝试通过设置符号位获取写锁定。PICKING_Buffer.InterlockedCompareExchange(0，d，asuint(-(Int)d)，last_d)；//只有写锁成功才会执行此分支。if(last_d==d){//更新对象标识。PICKING_Buffer.Store2(4，Identity)；uint虚拟；//释放写锁。Pick_Buffer.InterlockedExchange(0，d，ummy)；}}//旋转直到释放写锁定。}While((Int)Current_d_or_Locked&lt；0)；\n自旋锁定更新到位后，您应该始终在拾取缓冲区中获得最近的曲面。\n这就是着色器方面的内容，现在让我们转到CPU端，看看我们为调度和将PICKING_BUFFER的结果从GPU读回CPU而准备的C-API。它名为tm_gpu_Pick_api，如下所示：\nstruct tm_GPU_PICKING_API{struct tm_GPU_PICKING_O*(*CREATE)(struct tm_allocator_i*allocator，struct tm_renender_resource_command_buffer_o*res_buf，struct tm_shader_system_o*Pick_system，struct tm_shader_o*clear_Pick_Buffer_shader)；void(*DESTORY)(structm_gpu_Pick_o*。bool(*update_cpu)(struct tm_GPU_PICKING_o*inst，struct tm_renender_backend_i*rb，bool activate_system，const tm_ve2_t Cursor_position，Float Opacity_Threshold，uint64_t*result)；void(*update_GPU)(struct tm_GPU_Pick_o*inst，struct tm_shader_system_context_o*context，struct tm_renent。}；\nCreate()和Destroy()只负责创建和销毁拾取对象。每个支持拾取的视口都有自己的tm_GPU_PICKING_O。在内部，tm_GPU_PICKING_O拥有PICKING_BUFFER和一些状态。\n检查是否有新的回读结果可用于PICKING_BUFFER。如果是，则在RESULT中返回PICKING_BUFFER的标识部分，并且函数返回TRUE。机械中的ObjectSelection跟踪是基于实体ID的，因此我们可以简单地将实体ID作为常量缓冲区的一部分传递给所有绘制和调度调用，这意味着可以直接使用返回的ValueIn结果，而无需任何额外的查找。\n如果用户在视口内的某个地方单击了鼠标按钮，则应将true与光标位置和任意不透明度阈值一起传递给activate_system。这将准备将通过常量缓冲区传递给PICKING_SYSTEM的状态，并将其排队以供激活。不透明度阈值控制应在哪个曲面不透明度值处单击(即，拒绝)像素。我有计划在编辑器中公开对不透明阈值的控制，但还没有抽出时间，现在我们只通过了0.5，这感觉像是一个像样的默认值。任何不透明度小于0.5的像素都将被单击。\n每当我们要渲染视口时，都会调用update_gpu()。它执行以下操作：\n如果在最后一次调用update_cpu()时没有激活PICKING_SYSTEM，它会立即旋转。\n将计算调度调用排队以清除PICKING_BUFFER，该调用计划在视口中发生任何其他渲染之前执行。\n使用传递给update_cpu()的鼠标光标位置和不透明度阈值更新与PICKING_SYSTEM关联的常量缓冲区。\n将PICKING_BUFFER的异步读回操作从GPU排队到CPU，计划在视口中所有渲染完成后运行。\n由于我们不希望在回读PICKING_BUFFER的过程中使GPU停滞，因此它可能需要几个帧，直到结果可用并且从update_cpu()返回true。但在实践中，从用户的角度来看，这种延迟并不明显。\n使用基于GPU的拾取解决方案，您再也不必在CPU端纠结复杂的拾取代码，只要着色器实现了不超过几行代码的PICKING_SYSTEM，屏幕上可视化的任何东西都可以拾取。\n还要注意的是，虽然上面的代码示例只涵盖像素完美的选择，但没有什么能阻止您将其扩展为执行更多的模糊选择，只需计算光标与当前像素之间的距离并接受小于n像素的距离值。这在处理编辑器小工具和类似工具的选择时会很有用。", "note_en": "In early March I wrote a  post about the rendering ofgrids in our editor.Before we dive into today’s topic, I wanted to show off a trivial addition to the grid rendering I’veadded since the last post, rendering of an object local grid to guide moving of objects whensnapping is enabled:\n   I think it turned out quite nice and it feels like a good example of how well the modularity aspectsof The Machinery work in practice — just query access to the  tm_grid_renderer_api and add whatevergrid rendering your plugin might need.\n Anyway, let’s move on. In today’s post, we’ll talk about mouse picking.\n  All types of 3D-editors tend to need some way to determine the object identity of whatever objectthat happens to be under the mouse pointer when the user clicks inside a viewport. I’ll be referringto this process as “picking”.\n Picking, just like grid rendering, is one of those problems that typically are considered tooboring, or unimportant, for graphics programmers to even care about. Instead, it tends to end up inthe lap of some tools programmer to come up with a solution in one way or another. Usually, by doingsome form of ray cast from the position of the viewport camera through the mouse pointer coordinateprojected on the camera’s near plane.\n   The whole situation with distinct silos between rendering and tools folks, the prima donna attitudeamong rendering programmers, and the two most common solutions to the problem are bad in so manyways it makes me wanna cry.\n Relying on e.g. the physics system will break as soon as you need to pick stuff that doesn’t have aphysics representation, and there are typically lots of objects rendered in a viewport that don’tneed one. A common user workaround is to start adding physics representations just for the sake ofmaking stuff pickable in the editor. Not ideal…\n On the other hand, implementing a specific ray casting system only used for doing editor picking canbe a significant amount of work. Sure, the implementation doesn’t have to be the fastest in theworld since you will typically only be casting a single ray per frame (or less), but still, you’lldefinitely need some kind of acceleration structure (like a BVH-tree) as you definitely want to pickagainst the actual rendered triangles and not some proxy. That structure will consume both memoryand take some time to cook, and as soon as you start dealing with somewhat more complicated sceneswith lots of objects (&gt;10K) you’ll probably need to add another level of acceleration structure.\n Not to mention the fact that neither of these approaches will likely handle picking againstdeformable objects (like skinned characters), or picking through alpha masked objects (e.g.in-between the leaves on a tree), or handle purely voxel-based objects, or any kind of “Nanite”-solution.\n Clearly, this is not what you want. Even if it’s doable to implement a decent solution on the CPU,what you really want is a GPU based picking solution. You want to know the identity of the pixelunder the mouse cursor, not the identity of some invisible proxy. The second you’ve worked with apixel-perfect solution that handles all kinds of geometry deformations and surface types, you willnever again be okay with anything that’s less accurate.\n Ironically, implementing the foundations of a GPU-based picking solution is really straight forward,much easier than any CPU-based picking solution you can think of. So let’s take a look at theimplementation we have in The Machinery.\n  First of all, our solution relies on a few prerequisites, so let’s get them out of the way as Iwon’t cover them in more detail in this post:\n First of all, we rely on our shader system being able to efficiently select a different shadervariation for all drawn objects in the viewport. We handle this using the “Systems”-conceptdescribed in  this post.\n Secondly, we rely on always running on hardware that supports binding Unordered Access Views(UAVs) to the pixel shader.\n So the idea is very simple. When the user clicks inside a viewport, we activate a special shadersystem called  picking_system. That means that any shader that implements support for the picking_system will activate a slightly different code path in the pixel (or compute) shader usedfor rendering the object on screen.\n The activated shader variation adds a call to  update_picking_buffer() which is defined in the picking_system. The actual picking buffer is something as silly as a 12 bytes buffer, bound as aUAV, wrapping a simple struct:\n   // `pos` should be SV_Position.xy (or comparable writing from a CS).//// `identity` is a unique identifier of the rendered object. In TM this is// typically the ID of the entity issuing the GPU work.// // `z` is the Z depth value of the shaded point.//// `opacity` is the opacity value of the currenly shaded pixel. void update_picking_buffers(uint2 pos, uint2 identity, float z, float opacity) { // If the opacity of the pixel is less than the &#34;opacity picking threshold&#34; // -- return. if (opacity &lt; load_opacity_threshold()) return; // If this pixel is not under the mouse cursor -- return. uint2 cursor_pos = load_cursor_pos(); if (pos.x != cursor_pos.x || pos.y != cursor_pos.y) return; // Compare pixel z against the currently stored z-value in the // picking_buffer. If it&#39;s greater or equal (behind) -- return. uint d = asuint(z); if (d &gt;= picking_buffer.Load(0)) return; // Update picking buffer. picking_buffer.Store3(0, uint3(d, identity));}\n While this naive implementation will produce the correct picking result most of the time, it willoccasionally fail and return a picking result that is behind the closest surface. This is because weneed to protect against concurrent access to the  picking_buffer.\n We can use atomics together with exploiting the sign bit of  d to implement a spinlock mechanismthat prevents concurrent updates to the  picking_buffer from happening. The implementation is a bithairy, but looks something like this:\n uint d = asuint(z);uint current_d_or_locked = 0;do { // `z` is behind the stored z value, return immediately. if (d &gt;= picking_buffer.Load(0)) return; // Perform an atomic min. `current_d_or_locked` holds the currently stored // value. picking_buffer.InterlockedMin(0, d, current_d_or_locked); // We rely on using the sign bit to indicate if the picking buffer is // currently locked. This means that this branch will only be entered if the // buffer is unlocked AND `d` is the less than the currently stored `d`. if (d &lt; (int)current_d_or_locked) { uint last_d = 0; // Attempt to acquire write lock by setting the sign bit. picking_buffer.InterlockedCompareExchange(0, d, asuint(-(int)d), last_d); // This branch will only be taken if taking the write lock succeded. if (last_d == d) { // Update the object identity. picking_buffer.Store2(4, identity); uint dummy; // Release write lock. picking_buffer.InterlockedExchange(0, d, dummy); } }// Spin until write lock has been released.} while((int)current_d_or_locked &lt; 0);\n With the spinlock-update in place, you should always be getting the closest surface in the pickingbuffer.\n So that’s it on the shader side of things, now let’s move over to the CPU side and take a look atthe C-API we have in place for scheduling and reading back the result of the  picking_buffer fromthe GPU to the CPU. It’s called  tm_gpu_picking_api and looks like this:\n struct tm_gpu_picking_api{ struct tm_gpu_picking_o *(*create)(struct tm_allocator_i *allocator, struct tm_renderer_resource_command_buffer_o *res_buf, struct tm_shader_system_o *picking_system, struct tm_shader_o *clear_picking_buffer_shader); void (*destroy)(struct tm_gpu_picking_o *inst, struct tm_renderer_resource_command_buffer_o *res_buf); bool (*update_cpu)(struct tm_gpu_picking_o *inst, struct tm_renderer_backend_i *rb, bool activate_system, const tm_vec2_t cursor_position, float opacity_threshold, uint64_t *result); void (*update_gpu)(struct tm_gpu_picking_o *inst, struct tm_shader_system_context_o *context, struct tm_renderer_resource_command_buffer_o *res_buf, struct tm_renderer_command_buffer_o *cmd_buf, uint32_t device_affinity_mask);};\n create() and  destroy() are simply responsible for creating and destroying a picking object. Eachviewport that supports picking has its own  tm_gpu_picking_o. Internally,  tm_gpu_picking_o ownsthe  picking_buffer and some state.\n  Checks if there’s a new read-back result available for the  picking_buffer. If so the  identitypart of the  picking_buffer is returned in  result and the function returns  true. Objectselection tracking in The Machinery is based on the entity ID so we can simply pass the entity IDas part of a constant buffer to all draw and dispatch calls which means that the returned valuein  result can be used directly without any additional lookup.\n If the user clicked the mouse button somewhere inside a viewport,  true should be passed to activate_system together with the cursor position and an arbitrary opacity threshold. Thisprepares the state that will be passed to the  picking_system through a constant buffer andqueues it for activation. The opacity threshold controls at which surface opacity value a pixelshould be clicked-through (i.e., rejected). I have plans exposing control over the opacitythreshold in the editor but haven’t got around to it, right now we only pass 0.5 which feels likea decent default value. Any pixel with opacity less than 0.5 will be clicked through.\n update_gpu() is called whenever we’re about to render a viewport. It does the following:\n If the  picking_system wasn’t activated when the last call to  update_cpu() was made, it justreturns immediately.\n Queues a compute dispatch call to clear the  picking_buffer, scheduled to execute before anyother rendering happens in the viewport.\n Updates the constant buffer associated with the  picking_system with the mouse cursor positionand opacity threshold passed to  update_cpu().\n Queues an asynchronous read-back operation of the  picking_buffer from the GPU to CPU, scheduledto run after all rendering has finished in the viewport.\n As we don’t want to stall the GPU with the read-back of the  picking_buffer, it can take a fewframes until the result is available and  true is returned from  update_cpu(). In practice though,this delay hasn’t been noticeable from a user’s perspective.\n    With a GPU-based picking solution you’ll never again have to struggle with complicated picking codeon the CPU-side, anything that’s visualized on screen can be picked as long as the shader implementsthe  picking_system which isn’t more than a couple of lines of code.\n Also note that while the code examples from above only cover pixel-perfect selection, there’snothing preventing you from extending it to do more of a fuzzy selection, just calculating thedistance between the cursor and the current pixel and accept a distance value less than  n pixels.This can be useful when dealing with selection of editor gizmos and similar.", "posttime": "2020-06-02 02:32:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "渲染,rendering,对象", "title": "渲染和编辑器之间的边界-第2部分：拾取", "title_en": "Borderland Between Rendering and Editor – Part 2: Picking", "transed": 1, "url": "https://ourmachinery.com/post/borderland-part-2-picking/", "via": "", "real_tags": ["渲染", "rendering", "对象"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004707, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了保护我们的客户，苹果不会披露、讨论或确认安全问题，直到调查已经发生，补丁或版本可用。最近发布的版本列在苹果安全更新主页上。\n适用于：iPhone 6s及更高版本、iPad Air 2及更高版本、iPad mini 4及更高版本以及iPod touch 7代。\n关于非由苹果公司生产的产品的信息，或未被苹果公司控制或测试的独立网站的信息，是在没有推荐或认可的情况下提供的。对于第三方网站或产品的选择、性能或使用，苹果不承担任何责任。对于第三方网站的准确性和可靠性，苹果没有提出任何声明。有关其他信息，请与供应商联系。", "note_en": "For our customers&#39; protection, Apple doesn&#39;t disclose, discuss, or confirm security issues until an investigation has occurred and patches or releases are available. Recent releases are listed on the  Apple security updates page.\n    Available for: iPhone 6s and later, iPad Air 2 and later, iPad mini 4 and later, and iPod touch 7th generation\n  Information about products not manufactured by Apple, or independent websites not controlled or tested by Apple, is provided without recommendation or endorsement. Apple assumes no responsibility with regard to the selection, performance, or use of third-party websites or products. Apple makes no representations regarding third-party website accuracy or reliability.  Contact the vendor for additional information.", "posttime": "2020-06-02 02:32:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,苹果,app,apple,补丁", "title": "苹果补丁CVE-2020-9859(Un0ver)", "title_en": "Apple patches CVE-2020-9859 (unc0ver)", "transed": 1, "url": "https://support.apple.com/en-us/HT211214", "via": "", "real_tags": ["2020", "苹果", "app", "apple", "补丁"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004706, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你们中的许多人一直在问我，什么时候我会出版Debian Handbook…的更新版。最后一个合适的发行版可以追溯到Debian 8 Jessie！\n是的，我完全跳过了Debian 9，我不希望这种情况再次发生，所以我雇了两个外部贡献者来更新Debian 10的图书(谢谢Daniel Leidert和Jorge Maldonado Ventura)。\n内容在git中已经准备好一段时间了，但我有太多的其他职责，以至于我从来没有发布过合适的版本。我想自己复习所有的东西，但是我没能做到这一点。与其总是拖延到我找到所需的时间，我发现更好的做法是发布我们现在拥有的东西，让社区发挥它的魔力(包括翻译人员将审查他们必须翻译的内容！)。\n所以你来了。您可以获得Debian 10的Debian手册。如果您发现问题，请报告(最好是在salsa.debian.org上)。\n目前还没有平装本。lulu.com上的印刷版仍然是Debian 8版本。我会在接下来的几周里试着解决这个问题。", "note_en": "Many of you have been asking me when I will publish an updated version of the Debian Handbook… the last proper release dates back to Debian 8 Jessie !\n Yes I entirely skipped Debian 9. I didn’t want this to happen again so I hired two external contributors to update the book for Debian 10 (thank you Daniel Leidert and Jorge Maldonado Ventura).\n The content has been ready for a while in git but I’m so swamped with other duties that I never put out a proper release. I wanted to review everything myself but I failed at doing this. And instead of always postponing until I find the required time, I figured out it would be better just to release what we have right now and let the community do its magic (including translators that will review what they have to translate!).\n So here you are. You can get the  Debian Handbook for Debian 10. If you find out issues, please  report them (on salsa.debian.org preferably).\n There’s no paperback version yet. The print version on lulu.com is still the Debian 8 version. I will try to fix this in the coming weeks.", "posttime": "2020-06-02 02:32:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "debian", "title": "Debian 10 Buster的Debian手册，现已上线", "title_en": "Debian Handbook for Debian 10 Buster, now live", "transed": 1, "url": "https://debian-handbook.info/2020/debian-handbook-for-debian-10-buster-now-live/", "via": "", "real_tags": ["debian"]}, {"category": "", "categoryclass": "", "imagename": "30a38111f3ea43e01a491ef8facfcb46.jpg", "infoid": 1004705, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周末，SpaceX公司的猎鹰9号火箭成功地将机组人员“龙”飞船和机上的两名宇航员从佛罗里达安全送入太空，这场发射令人惊叹，令人敬畏，坦率地说，看起来真的很酷。在这个廉价的微型高清摄像头和流媒体内容的时代，如果你错过了它，或者即使你只是想再看一遍来娱乐，也应该很容易赶上它。但在周末的大部分时间里，直到今天早上，你根本看不到它，这要归功于版权内容ID机器人的加班工作。\n5月30日的发射在NASA的YouTube频道进行了现场直播，然后进行了存档，并附上了几个较短的视频片段和从为期一天的直播中提取的亮点。NASA的镜头，就像来自其他政府机构的照片和视频一样，通常发布到公共领域，而不是受版权保护，其他实体可以对其进行镜像或转播。国家地理杂志也报道了这次发射，它的镜头包含了美国国家航空航天局的一些内容。然后事情变得很愚蠢。\nTwitter用户发现，到周日，由于国家地理的版权主张，NASA的档案视频不再可以观看。当时试图播放美国国家航空航天局的一些视频时，出现了一条错误消息：视频不可用：此视频包含来自国家地理杂志的内容，国家地理以版权为由已将其屏蔽。\n美国国家航空航天局(NASA)周日介入，并敦促这些公司解决问题。NASA通讯总监Bettina Inclán周日晚间在推特上说，在过去的几天里，我们NASA的团队一直在与YouTube保持联系，YouTube加剧了这一问题。&#34；我们也一直在与NatGeo联系，该公司致力于发布演示-2保险的索赔。&#34；\n最后，YouTube、NASA和国家地理似乎解决了他们的问题。到美国东部时间今天上午9：30，视频已经恢复并可以播放，您可以再次尽情观看发射仪式。\n然而，与周六的发布不同的是，这一内容ID声明并不是历史性的第一次，而是一种熟悉的模式的一部分。几乎就是这个问题发生在2012年，当时其他企业-在那个案例中，是斯克里普斯广播公司-不正当地向NASA提出了托管自己视频的版权要求。同样的情况也发生在使用美国国家航空航天局(NASA)公共领域胶片的独立第三方身上。\nYouTube在2012年末引入了自动内容ID索赔的上诉程序。对于那些视频被标记的用户-即使这些视频使用公共领域内容-恢复它们的过程仍然可能是具有挑战性和深奥的。\n该系统也是可利用的。去年，YouTube与内布拉斯加州的一名男子达成了2.5万美元的和解协议，原因是他被指控滥用版权主张敲诈其他YouTube用户，威胁他们提出虚假的下架请求，除非他们付钱给他。", "note_en": "This weekend&#39;s  launch, in which SpaceX&#39;s Falcon 9 rocket successfully propelled the Crew Dragon spacecraft and the two astronauts on board from Florida safely into space, was  amazing, awe-inspiring, and frankly, just plain cool to watch. And here in the age of inexpensive, tiny high-definition cameras and streaming content, it  should be easy to catch up on it if you missed it—or even if you just want to watch it again for fun. But for most of the weekend and into this morning, you couldn&#39;t watch it at all, thanks to copyright content ID bots working overtime.\n The May 30 launch was streamed live to NASA&#39;s YouTube channel and then  archived, along with several shorter clips and highlights taken from the day-long livestream. NASA footage, like photo and video from other government agencies, is generally  published into the public domain, not under copyright, and other entities can mirror or rebroadcast it. National Geographic  also covered the launch, and its footage incorporated some of the NASA content. Then things got stupid.\n By Sunday, the archival NASA video was no longer available to view, Twitter users  spotted, because of a copyright claim from National Geographic. Attempts at that time to play back some of the NASA videos resulted in an error message saying, &#34;Video unavailable: This video contains content from National Geographic, who has blocked it on copyright grounds.&#34;\n NASA got involved by Sunday and pushed the companies for a fix. &#34;Over the last few days our team at NASA has been in touch with YouTube who escalated the issue,&#34; NASA Communications Director Bettina Inclán said  on Twitter Sunday night. &#34;We also have been in contact with NatGeo who is committed to releasing the claims for Demo-2 coverage.&#34;\n In the end, it appears that YouTube, NASA, and National Geographic got their issues sorted out. By 9:30am Eastern time this morning, the videos were restored and playable, and you can once again watch the launch to your heart&#39;s content.\n   Unlike Saturday&#39;s launch, however, this content ID claim was not a historic first but instead part of a familiar pattern. Almost this exact problem  occurred back in 2012, when other businesses—in that case, the Scripps broadcast companies—improperly filed copyright claims against NASA hosting its own videos. The same happens to  independent third parties who use public domain NASA footage.\n YouTube introduced an  appeals process for automated content ID claims in late 2012. For users whose videos get flagged—even when those videos use  public domain content—the process for having them restored can still be challenging and esoteric.\n That system is also exploitable. Last year, YouTube reached a  $25,000 settlement with a Nebraska man over allegations that he abused copyright claims to extort other YouTubers by threatening them with bogus takedown requests unless they paid him money.", "posttime": "2020-06-02 02:32:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "主张,launch,nasa", "title": "SpaceX发射片段因虚假版权主张而被撤下", "title_en": "SpaceX launch footage was taken down thanks to bogus copyright claim", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/06/false-natgeo-copyright-claim-took-nasas-launch-video-down-this-weekend/", "via": "", "real_tags": ["主张", "launch", "nasa"]}, {"category": "", "categoryclass": "", "imagename": "a07e2d84a07dc074b717d6e4b03c79ce.jpg", "infoid": 1004703, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着反对警察暴行和种族主义的抗议活动在美国许多大城市发生，达拉斯警察局周日要求公众通过该市的智能手机应用程序提交抗议活动中非法活动的视频。事情并不顺利，据报道，该应用程序被韩国流行音乐视频等无关内容淹没，不到一天，由于技术问题，该应用程序停止运行。\nBuzzFeed新闻写道，为了回应达拉斯警方的推特请求，数百名韩国流行歌迷回复了他们最喜欢的艺术家的照片和视频。许多人还声称，他们在iWatch Dallas应用程序上提交了警察伤害抗议者的视频，以及韩国流行歌手的粉丝剪辑视频。&#34；许多人还声称，他们向iWatch Dallas应用提交了警察伤害抗议者的视频，以及韩国流行歌手的粉丝剪辑。\n该部门在美国东部时间周日凌晨12点48分提出了提供抗议者视频的要求。如果你有抗议活动中非法活动的视频，并试图将其分享给@DallasPD，你可以将其下载到我们的iWatch Dallas应用程序上。推特上写道，你可以保持匿名。\n到周日晚上，警察局的推特账号说，由于技术问题，iWatch达拉斯应用程序将暂时关闭。我们今天联系了警察局，了解该应用程序的状态，如果得到回应，我们将更新这篇文章。我今天无法在iPhone应用程序中提交，但这可能是因为我不在达拉斯地区-该应用程序要求启用您手机的定位服务，并告诉我由于验证错误，我的设备被阻止。\nBuzzFeed写道，目前还不清楚推特上的韩国流行歌迷是因为流量过大而导致该应用程序停止运行，还是警方只是想让人们停止通过该应用程序上传照片和视频。\n一名推特用户敦促韩国流行乐迷下载这款应用，并发送你所有的幻想曲，让他们的工作变得尽可能艰难，让他们撤下这款应用。之后，这条以韩流为主题的帖子蜂拥而至。另一条被广泛转发的推文则敦促人们在那些狗屎里充斥着幻想曲，让他们很难找到除了我们最喜欢的舞蹈之外的其他任何东西。这条推文在推特上广为流传，让他们很难找到除了我们最喜欢的舞蹈之外的任何东西。这条推特被广为流传的另一条推文呼吁人们用Fancam充斥那些狗屎，让他们很难找到除了我们最喜欢的舞蹈之外的任何东西。\n适用于iPhone和Android的iWatch Dallas应用程序自去年10月以来一直可用，最后一次更新是在3月份。在周日收到数百条负面评论后，这款应用在两个应用商店的平均评分都是1星。一些评论很好笑，比如这款应用射杀了我的狗，杀死了我的狗，偷走了我的狗，吃掉了我的妻子，或者说这款应用给了它们病毒。其他评论是严肃的，他们说，我们不应该生活在一个警察国家，这款应用程序宣扬种族主义和压迫行为，我不想仅仅因为我是黑人就被杀，因为乔治·弗洛伊德(George Floyd)的正义很重要。\n最近几乎每一条评论都给这款应用打了一颗星，尽管一位iOS用户给了它五星，并称iWatch Dallas是举报共产主义煽动者试图摧毁我们城市的绝妙方式。与此同时，推特上充斥着警察袭击抗议者的视频，Slate在一篇题为“全国警察爆发暴力事件”的文章中详细描述了这一点。\n达拉斯警方周六表示，他们逮捕了74人，并将以煽动骚乱罪起诉他们。该市发布了宵禁，警察局长蕾妮·霍尔(Renee Hall)表示，警方将逮捕违反宵禁的个人，不会容忍我们城市再有任何破坏行为。周日晚上，警方表示，到目前为止，达拉斯市中心几乎没有活动发生。\n互联网已经存在很长一段时间了，政府对围绕它建立起来的文化仍然有着如此悲惨的理解，这总是让我感到惊讶。", "note_en": "With protests against police brutality and racism happening in many major US cities, the Dallas Police Department on Sunday  asked the public to submit videos of &#34;illegal activity from the protests&#34; through the city&#39;s smartphone app. It didn&#39;t go well, as the app was reportedly inundated with unrelated content, such as K-pop videos, and within less than a day, the app had stopped working due to &#34;technical difficulties.&#34;\n &#34;In response to the tweeted request from Dallas Police, hundreds of K-pop fans replied with photos and videos of their favorite artists,&#34;  BuzzFeed News wrote. &#34;Many people also claimed to have submitted videos of the police harming protestors, as well as fan edits of K-pop artists, to the iWatch Dallas app.&#34;\n The department made its request for video of protesters at 12:48am CT Sunday. &#34;If you have video of illegal activity from the protests and are trying to share it with @DallasPD, you can download it to our iWatch Dallas app. You can remain anonymous,&#34; the tweet said.\n By Sunday evening, the department&#39;s Twitter account  said, &#34;Due to technical difficulties iWatch Dallas app will be down temporarily.&#34; We contacted the police department about the status of the app today and will update this article if we get a response. I was unable to make a submission in the iPhone app today, but that may be because I&#39;m not in the Dallas area—the app asks for your phone&#39;s location services to be enabled and told me that my &#34;device is blocked&#34; due to a &#34;validation error.&#34;\n &#34;It&#39;s unclear if K-pop fans from Twitter overwhelmed the app with traffic, causing it to stop working or if the police department simply wanted people to stop submitting photos and videos through the app,&#34; BuzzFeed wrote.\n  K-pop-themed  submissions apparently flooded in after a Twitter user  urged K-pop fans to &#34;download the app and send all your fancams&#34; in order to &#34;make their jobs as hard as possible&#34; and &#34;make them take down the app.&#34; Another  widely shared tweet urged people to &#34;FLOOD that shit with fancams [and] make it SO HARD for them to find anything besides our faves dancing.&#34;\n The iWatch Dallas app for  iPhone and  Android has been available since October and was last updated in March. The app has a 1-star average rating on both app stores after getting hundreds of negative reviews on Sunday. Some reviews were facetious, saying things like &#34;this app shot my dog,&#34; &#34;killed my dog,&#34; &#34;stole my dog and ate my wife,&#34; or that the app gave them a virus. Other reviews were serious, saying, &#34;we shouldn&#39;t live in a police state,&#34; that the &#34;app promotes racist and oppressive behavior,&#34; &#34;I don&#39;t wanna get killed just because I&#39;m black,&#34; &#34;Justice for George Floyd,&#34; and &#34;Black Lives Matter.&#34;\n Nearly every single recent review gave the app one star, though one iOS user gave it five stars and called iWatch Dallas a &#34;Fantastic way to report communist agitators trying to destroy our city.&#34; Meanwhile, Twitter has been flooded with videos of police officers assaulting protesters, as Slate detailed in an article titled &#34; Police Erupt in Violence Nationwide.&#34;\n Dallas police on Saturday  said they arrested 74 people and will charge them with &#34;inciting a riot.&#34; The city issued a curfew, and Police Chief Renee Hall  said police will &#34;make arrests of individuals violating curfew&#34; and &#34;will not tolerate any more  vandalism of our city.&#34; On Sunday night, police  said, &#34;As of now, there is very little activity occurring in the downtown Dallas area.&#34;\n  The internet has been around for a long time, it always surprises me that governments  still have such a miserable comprehension of the culture that&#39;s built up around it.", "posttime": "2020-06-02 02:31:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "police,应用程序", "title": "达拉斯警方要求公众提供示威者的视频-进展不顺利", "title_en": "Dallas Police asked public for videos of protesters–it didn’t go well", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/06/dallas-police-asked-public-for-videos-of-protestors-it-didnt-go-well/", "via": "", "real_tags": ["police", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "8c02f27303455eb22cffadc8d3c52e85.jpg", "infoid": 1004701, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "黑洞是最神秘和最迷人的宇宙学现象之一。黑洞是空间中具有如此强烈的引力场的区域，无论是物质还是辐射都无法逃脱。在过去五年左右的时间里，天体物理学家收集了第一批关于黑洞周围强大引力的观测资料。LIGO和处女座的合作能够使用世界上一些最先进的引力波探测器探测到这些引力波周围的引力波。与此同时，事件视界望远镜研究小组捕捉到了第一张黑洞阴影的图像。\n虽然这两个观测都非常有希望和引人入胜，但它们都不太可能揭示事件视界，事件视界是定义黑洞周围空间中任何东西都无法逃脱的特定区域的边界。尽管如此，它们应该包含一个指向恰好在视界外的邻近区域的签名，在那里弯曲得非常厉害，以至于它的路径关闭了自己，形成了被称为光环的圆形轨道。\n研究这些光环最终可以丰富我们目前对黑洞及其性质的理解。然而，到目前为止，仍然有许多问题没有得到回答，我们对黑洞和它们周围的光环还远没有得到很好的理解。\n德国马克斯·普朗克引力物理研究所和葡萄牙阿韦罗大学的研究人员最近引入了一个定理，可以预测静止黑洞周围的光环。他们在“物理评论快报”上发表的一篇论文中提出的定理表明，一般来说，平衡黑洞的每个自转感都必须至少有一个光环。\n开展这项研究的两位研究人员佩德罗·库尼亚(Pedro Cunha)和卡洛斯·赫代罗(Carlos Herdeiro)通过电子邮件告诉Phys.org，值得注意的是，光环的特性可以编码许多相关的黑洞信息。通过测量这些性质，我们可以直接看到黑洞附近难以捉摸而又相当未知的非常强的区域。目前还不清楚爱因斯坦的广义相对论是否能很好地描述在这种极端条件下的万有引力定律。因此，一个关键的问题是：在任何引力理论中，任何黑洞模型都需要有光环吗？\n根据广义相对论，黑洞在平衡态和空空间中的性质受到很大的限制。过去的宇宙学观测表明，这些经典黑洞都有光环轨道，这可能意味着任何可以想象到的黑洞也会有这些轨道。\n通过他们的研究，库尼亚和赫代罗试图研究外推光环轨道概念的可能性，并将其应用于具有一般物质含量的黑洞，或应用于另一种引力理论(即，不是广义相对论)。他们设计的新定理为一般平衡黑洞必须至少有一个光环轨道的预测提供了坚实的理论基础。\n库尼亚和赫代罗说：在我们的论文中，我们引入了一种普遍的、在数学上有创新的论点，它确立了平衡黑洞作为规则，在每个旋转意义上确实必须至少有一个标准光环，库尼亚和赫代罗说。为了分析轻环，人们通常会考虑给定引力理论的解族，比如广义相对论，或者某种特定的修正引力模型。然而，这里的论点是拓扑性质的。\n拓扑学是一个特定的数学领域，它专注于研究当对象经历变形或形状和大小的其他更改时不受影响的几何特性。拓扑学研究的关键思想是，有些问题不受对象的确切形状和大小的影响，而是受这些对象相互变形的方式的影响。\n研究人员解释说，作为一个简单的例子，球体和甜甜圈有不同数量的洞，并且在拓扑上是不同的。相比之下，尽管球体和立方体的几何形状不同，但它们的拓扑结构是相同的。\n在他们的论文中，Cunha和Herdeiro将基于拓扑的构造应用到是否存在围绕黑洞的光环轨道的问题上。他们的定理没有使用特定的引力理论提供的运动方程来尝试回答这个问题，而是简单地研究了时空在黑洞附近和远离黑洞时的行为。\n库尼亚和赫代罗说：换句话说，我们并不假设一个引力定律是正确的，而只是假设正确的引力定律(即，无论哪一个)允许黑洞的存在。然后，迫使时空结构服从某些规律性要求，黑洞的存在意味着地平线外一定有一个光环。事实上，一个旋转的黑洞必须至少有两个光环：一个用于光线以与黑洞相同的旋转方向绕着黑洞旋转，另一个用于用于光线以相反的方向绕着黑洞旋转。\n库尼亚和赫代罗最近的论文提供了一个新的理论视角，可以作为进一步研究黑洞周围光环的基础。它的主要优势是它的普遍性，因为它不遵循任何具体的引力理论，因此即使爱因斯坦的广义相对论在这方面不适用或不准确，它也是有效的。\n库尼亚和赫代罗说，预测总是有光环，而且它们总是在地平线之外，这会产生重要的后果。例如，它意味着黑洞的轮廓，也就是我们所知的黑洞阴影，通常是不同的，通常比人们预期的黑洞本身的大小要大。因此，阴影应该始终是黑洞的放大。\n虽然它在理论上可能是强大的，就像任何其他适用于真实系统的数学定理一样，库尼亚和赫代罗引入的结构是基于一系列假设的。在他们未来的工作中，研究人员计划改变其中的一些假设，并评估他们的定理的预测是改变还是保持不变。\n库尼亚和赫代罗说，我们定理的一个关键假设是，在远离黑洞的地方没有引力场。然而，在宇宙中，有一个宇宙常数驱动着宇宙的膨胀。这就产生了一个微小的引力场，不管它离黑洞有多远。如果这个微小的假设改变会改变我们定理的结论，这将是非常有趣的。更多信息：佩德罗·V·P·库尼亚等人(Pedro V.P.Cunha et al)。“静止黑洞和光环”，“物理评论快报”(2020)。网址：10.1103/PhysRevLett.124.181101", "note_en": "Black holes, regions in space with such an intense gravitational field that no matter or radiation can escape from them, are among the most mysterious and fascinating cosmological phenomena. Over the past five years or so, astrophysicists collected the first observations of the strong gravitational forces around black holes.    The LIGO-Virgo collaboration was able to detect gravitational waves around these   using some of the most advanced gravitational-wave detectors in the world. Meanwhile, the Event Horizon Telescope research group captured the very first image of a black hole shadow.\n While both these observations are highly promising and captivating, neither of them is likely to unveil the event horizon, the boundary defining the specific region in space around a black hole from which nothing can escape. Nonetheless, they should contain a signature pointing to a neighboring region just outside of the event horizon, wherein   is bent so strongly that its path closes over itself and forms circular orbits known as light rings.\n Studying these light rings could ultimately enrich our current understanding of black holes and their properties. So far, however, many questions remain unanswered, and we are still far from gaining a good understanding of both black holes and the light rings surrounding them.\n Researchers at the Max Planck Institute for Gravitational Physics in Germany and Universidade de Aveiro in Portugal have recently introduced a theorem that makes predictions about the light rings around stationary black holes. Their theorem, presented in a paper published in   Physical Review Letters, suggests that equilibrium black holes must, as a general rule, have at least one light ring in each of their sense of rotation.\n &#34;Remarkably, the properties of light rings can encode much relevant black hole information,&#34; Pedro Cunha and Carlos Herdeiro, the two researchers who carried out the study, told Phys.org via email. &#34;Measuring these properties grants a direct window into the elusive and yet fairly uncharted regime of very strong   close to a black hole. At this moment it is still unclear whether Einstein&#39;s theory of general relativity remains a good description of the laws of gravity under such extreme conditions. Therefore, a key question is: does any black hole model, in any theory of gravity, need to have a light ring?&#34;\n  According to the theory of general relativity, the properties of black holes in a state of equilibrium and in empty space are very constrained. Past cosmological observations suggest that these classical black holes possess light ring orbits, which could mean that any conceivable black hole would also have these orbits.\n    With their study, Cunha and Herdeiro tried to examine the possibility of extrapolating the notion of light ring orbits and applying it to black holes with generic matter content or to alternative theories of gravity (i.e., not the theory of general relativity). The new theorem they devised provides a solid theoretical basis for the prediction that generic equilibrium black holes must possess at least one light ring orbit.\n &#34;In our paper, we introduce a generic and mathematically innovative argument that establishes that an equilibrium black hole must indeed have, as a rule, at least one standard light ring in each rotational sense,&#34; Cunha and Herdeiro said. &#34;To analyze light rings, typically, one considers families of solutions of a given theory of gravity, like general relativity, or some particular model of modified gravity. Here, however, the argument is of a topological nature.&#34;\n Topology is a specific area of mathematics that focuses on the study of geometric properties that are not affected when an object undergoes deformations or other changes in shape and size. The key idea underlying topology studies is that some problems are unaffected by the exact shape and size of objects, but rather by the way in which these objects can be deformed into each other.\n &#34;As a simple example, a sphere and a donut have a different number of holes and are topologically distinct,&#34; the researchers explained. &#34;In contrast, a sphere and a cube have the same topology, despite having different geometrical shapes.&#34;\n In their paper, Cunha and Herdeiro apply topology-based constructs to the question of whether a light ring orbit exists around a black hole. Instead of using equations of motion provided by a specifiic theory of gravity to try and answer this question, their theorem simply examines how the spacetime should behave both near a black hole and far away from it.\n  &#34;In other words, we do not assume that one law of gravity is correct, but only assume that the correct law of gravity (i.e., whichever that is) allows the existence of black holes,&#34; Cunha and Herdeiro said. &#34;Then, forcing the spacetime structure to obey to some regularity requirements, the existence of a black hole implies that there must be a light ring outside the horizon. In fact, a rotating black hole must have at least two light rings: one for light circling the black hole in the same spinning direction as the black hole and another one for light circling the black hole in the opposite direction.&#34;\n The recent paper by Cunha and Herdeiro provides a new theoretical perspective that could serve as a basis for further studies examining light rings around black holes. Its key advantage is its generality, as it does not follow any specific theory of gravity and thus holds even if Einstein&#39;s theory of general relativity was not applicable or accurate in this context.\n &#34;The prediction that   always have light rings and they are always outside the horizon has important consequences,&#34; Cunha and Herdeiro say. &#34;For instance, it implies that the silhouette of a black hole, known as the black hole shadow, is generically different and usually larger than what one would expect the size of the black hole itself to be. So the shadow should always be a magnification of the black hole.&#34;\n While it may be theoretically strong, just like any other mathematical theorem that applies to real systems the construct introduced by Cunha and Herdeiro is based on a series of assumptions. In their future work, the researchers plan to change some of these assumptions and assess whether their theorem&#39;s predictions change or remain the same.\n &#34;One key assumption of our theorem is that far away from the black hole there is no gravitational field,&#34; Cunha and Herdeiro said. &#34;However, in the Universe there is a cosmological constant that drives the expansion of the Cosmos. This creates a tiny gravitational field no matter how far away from the black hole one is. It would be very interesting to understand if this slight change in assumption would change our theorem&#39;s conclusions.&#34;        More information:\t\t\t\t\t\t\t\t\t\t\t\tPedro V. P. Cunha et al. Stationary Black Holes and Light Rings,  Physical Review Letters (2020).  DOI: 10.1103/PhysRevLett.124.181101", "posttime": "2020-06-02 02:30:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "预言,predicts,黑洞", "title": "一个新的定理预言静止的黑洞必须至少有一个光环。", "title_en": "A new theorem predicts stationary black holes must have at least one light ring", "transed": 1, "url": "https://phys.org/news/2020-06-theorem-stationary-black-holes.html", "via": "", "real_tags": ["预言", "predicts", "黑洞"]}, {"category": "", "categoryclass": "", "imagename": "a386dab336657e91f4b089beba32a700.jpg", "infoid": 1004700, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据《纽约时报》报道，Facebook数十名员工周一举行虚拟罢工，抗议该公司上周决定不对总统特朗普发布的煽动性帖子采取行动。\n在这次虚拟罢工之前，Facebook决定不对特朗普上周发布的一系列有争议的帖子采取任何行动，其中包括一条似乎威胁要对抗议者采取暴力的帖子，称“当抢劫开始，枪击就开始了。”Twitter上周认定，这条消息违反了其反对美化暴力的规定，限制了在其平台上查看、点赞、回复和转发该帖子的能力。\n据“泰晤士报”报道，员工休假一天以支持全国各地的抗议活动，并留下自动电子邮件通知发件人他们不在办公室，以抗议公司的不作为。\n在过去的一年里，扎克伯格一直反对事实核查的政客。他说，用户应该能够查看这些帖子，并决定自己应该相信什么。\n扎克伯格将特朗普煽动性帖子作为平台的决定上周遭到员工内部的强烈反对。扎克伯格写道，周五，扎克伯格写了一篇博客文章，解决了员工的担忧，尽管Facebook最终“决定不讨论这件事，因为国民警卫队的引用意味着我们将其解读为对国家行动的警告，我们认为人们需要知道政府是否计划部署武力。”\n“我们关于煽动暴力的政策允许围绕国家使用武力进行讨论，尽管我认为今天的情况提出了一些重要的问题，即这种讨论的潜在限制应该是什么，”他继续说。\n在泄露给The Verge的内部信息中，Facebook员工批评了该公司的中立立场。\n一名员工写道：“我不得不说，我发现我们必须经历的扭曲令人难以置信地难以忍受。”“所有这些都表明，11月发生暴力升级和内乱的风险非常高，如果我们未能通过这里的考验，历史将不会仁慈地评判我们。”\n另一名员工写道：“这让我感到悲伤和羞愧。”“希望这不是最后的评估？希望还有人在某个地方讨论这是如何以及为什么这显然是在鼓吹暴力？“。\n周一，随着越来越多的员工公开批评扎克伯格和Facebook的决定，该公司告诉CNN：“我们认识到我们许多人现在感受到的痛苦，特别是我们的黑人社区。我们鼓励员工在与领导意见相左时公开发言。由于我们未来将面临更多有关内容的艰难决定，我们将继续寻求他们的诚实反馈。“", "note_en": "Dozens of Facebook employees staged a virtual walkout on Monday in protest of the company’s decision not to take action against incendiary posts by President Donald Trump last week,  according to  The New York Times.\n The virtual walkout comes on the heels of a decision from Facebook  not to take any action against a series of controversial posts from Trump last week, including one that seemed to threaten violence against protestors by saying, “when the looting starts, the shooting starts.” Twitter determined that the same message violated its rules  against the glorification of violence last week, limiting the ability to view, like, reply, and retweet the post on its platform.\n According to the  Times, employees took the day off to support protests across the country and are leaving behind automated email messages telling senders that they’re out of the office in protest of the company’s inaction.\n Over the last year, Zuckerberg has  opposed fact-checking politicians. He has said that users should be able to view these posts and decide what to believe on their own.\n Zuckerberg’s decision to platform Trump’s inflammatory posts faced heavy internal opposition from employees last week. On Friday, Zuckerberg authored a blog post addressing the employees’ concerns, even though Facebook ultimately “decided to leave it up because the National Guard references meant we read it as a warning about state action, and we think people need to know if the government is planning to deploy force,” Zuckerberg wrote.\n “Our policy around incitement of violence allows discussion around state use of force, although I think today’s situation raises important questions about what potential limits of that discussion should be,” he continued.\n In leaked internal messages to  The Verge , Facebook employees criticized the company’s neutral position.\n “I have to say I am finding the contortions we have to go through incredibly hard to stomach,” one employee wrote. “All this points to a very high risk of a violent escalation and civil unrest in November and if we fail the test case here, history will not judge us kindly.”\n “Makes me sad and frankly ashamed,” another employee wrote. “Hopefully this wasn’t the final assessment? Hopefully there is still someone somewhere discussing how and why this is clearly advocating for violence?”\n As more employees went public criticizing Zuckerberg and Facebook’s decision on Monday,  the company told CNN: “We recognize the pain many of our people are feeling right now, especially our Black community. We encourage employees to speak openly when they disagree with leadership. As we face additional difficult decisions around content ahead, we’ll continue seeking their honest feedback.”", "posttime": "2020-06-02 02:29:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,员工,employees", "title": "Facebook员工罢工抗议唐纳德·特朗普的帖子", "title_en": "Facebook employees walk out in protest of Donald Trump’s posts", "transed": 1, "url": "https://www.theverge.com/2020/6/1/21277135/facebook-walkout-protest-virtual-president-donald-trump-posts", "via": "", "real_tags": ["facebook", "员工", "employees"]}, {"category": "", "categoryclass": "", "imagename": "d78363b1ba8434cb5de0f68133e75d8b.jpg", "infoid": 1004699, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "感谢收看！此外，节拍和鼓掌的数字在部分地方有点不同步，但我在Movie Maker中做了这整件事，所以这是…", "note_en": "Thanks for watching! Also, The numbers for the beats and claps are a little out of sync at parts, but I made this whole thing in Movie Maker so this was the ...", "posttime": "2020-06-02 02:29:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "connick,entire,鼓掌", "title": "5/4的诀窍-小哈里·康尼克(Harry Connick Jr.)。欺骗了全体观众(2015)", "title_en": "The 5/4 trick – How Harry Connick Jr. tricked an entire audience (2015)", "transed": 1, "url": "https://www.youtube.com/watch?v=4hYYgz-AJKU", "via": "", "real_tags": ["connick", "entire", "鼓掌"]}, {"category": "", "categoryclass": "", "imagename": "0a06d715e16bbcc483db91407d2f4bd3.jpeg", "infoid": 1004698, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我制作并维护了几年的浏览器扩展，我记得我经常会编写大量的代码，这些代码以后会成为很好的功能。然而，这些并不容易维护，我有两件事要做：一是我将有一种方法来编写可以在整个应用程序中重用的代码，另一件是集中事件。\njs是围绕这样一种理念构建的，即应该区分与视觉外观和视觉工作方式相关的逻辑。\n同时，userinterface.js提供了编写和组织UI的新方法。\n使用userinterface.js的另一个优点是通过关注点分离和UI机制抽象的原则实现代码可重用性。\n要开始使用userinterface.js，您只需按照userinterface.js-skone存储库上的说明搭建一个新项目。\n为了能够在浏览器中使用userinterface.js，您可以使用git子模块。\n模型是节点的对象表示形式。根据方法的不同，它有三个必需的属性：名称、方法和属性或回调，\nName属性将是您的模型的标识符，它将在您需要运行模型时使用。Method属性将描述您的模型应该如何排列。属性和回调属性将包含您的元素的属性。\n我们使用appendChild方法创建了一个名为Simple model的模型，它有两个Li元素子元素，分别具有className simplmodel和textContent我的第一个简单模型。是的，每个属性(除子元素之外)都将设置为该元素。\nUserInterface。model({name：&#34；simplmodel&#34；，方法：UserInterface。appendChild，properties：{tagName：&#34；li&#34；，//必填className：&#34；simplmodel&#34；，textContent：&#34；我的第一个简单模型&#34；}})；UserInterface。runModel(&#34；simplmodel&#34；，{parentNode：Document。querySelector(&#34；ul&#34；)})；\n在前面的示例中，我们创建了一个简单的模型，但是如果我们想要做更多的工作并向其中添加一些子元素，那该怎么办呢？这里有Child属性，它是一个数组，您可以在其中指定子元素。\nUserInterface。模型({名称：&#34；子代&#34；，方法：UserInterface.。appendChild，properties：{tagName：&#34；div&#34；，className：&#34；model&#34；，Children：[{tagName：&#34；div&#34；，className：&#34；Child&#34；，textContent：&#34；My First Child&#34；//等]。}]}})；UserInterface。runModel(&#34；子&#34；，{parentNode：Document。Body})；\n模型需要有属性属性或回调属性，但是回调属性到底有什么作用呢？当您想要回显模型中的某些数据时，可以使用回调属性。\n例如，在这里，我们有一个名为echomodel的模型，它具有回调属性。此属性与properties属性的工作方式相同，只是在模型运行之前添加了一个额外的步骤。回调将根据您通过runModel传递的数据返回一个properties对象。\nUserInterface。模型(名称：&#34；echomodel&#34；，方法：UserInterface。appendChild，callback：data=&gt；({tagName：&#34；p&#34；，className：&#34；echomodel&#34；，textContent：&#34；my&#34；+data。text+&#34；型号&#34；}))；用户界面。runModel(&#34；echomodel&#34；，{parentNode：Document.。正文，数据：{&#34；text&#34；：&#34；echo&#34；}})；\n绑定是一个回调函数，当绑定到模型时，每当模型运行时都会自动调用该函数。绑定将使您的模型更加活跃，例如向您的模型添加事件侦听器，这就是您要做的地方。\n您还可以执行更多操作，例如使用事件侦听器将所有模型连接在一起！\n绑定是赋予模型生命力的一种方式，使它们能够在执行各自的方法时执行操作。这意味着如果您想要向将在其中执行操作的元素添加侦听器。\nUserInterface。模型({名称：&#34；按钮&#34；，方法：UserInterface。appendChild，属性：{tagName：&#34；button&#34；}})；UserInterface。绑定(&#34；按钮&#34；，函数(元素){元素。textContent=&#34；Bound&#34；；})；UserInterface。runModel(&#34；按钮&#34；，{parentNode：Document。Body})；\n对象是你的模型的主干，它们将为你的绑定存储和操作数据。这就是你想要隐藏复杂东西的地方。\n在本例中，我们创建并运行一个名为myModel的模型，该模型本身将运行另一个模型，并将其传递给上下文myObj。\n上下文代表模型之间相互通信的保留区域，它们通常表示为对象，但也可以是几乎任何形式。\n第二个模型运行后，它将听到问候语通知。您注意到第一个模型中的事件侦听器了吗？是的，无论何时单击我们的第一个模型，它都会向上下文myObj通告问候，并将一个空对象作为数据传递给它。这个空对象也可以是您想要传递给其他模型的任何对象。\nUserInterface。Model({name：&#34；myModel&#34；，方法：UserInterface。appendChild，属性：{tagName：&#34；div&#34；}})；UserInterface。模型({名称：&#34；某模糊模型&#34；，方法：UserInterface.。appendChild，属性：{tagName：&#34；div&#34；}})；UserInterface。绑定(&#34；myModel&#34；，function(Element){const_myObj=new Obj()；元素。addEventListener(&#34；单击&#34；，Function(){UserInterface。发布(_myObj，&#34；greeting&#34；，{})；})；UserInterface。runModel(&#34；某模糊模型&#34；，{parentNode：Document。Body，bindingArgs：[_myObj]})；})；UserInterface。绑定(&#34；ome obcuremodel&#34；，function(element，myObj){UserInterface。LISTEN(myObj，&#34；greeting&#34；，function(Data){//用数据做一些有用的事情或问候回})；})；UserInterface。runModel(&#34；按钮&#34；，{parentNode：Document。Body})；\n已处理的属性以及元素可以具有的任何属性或返回它们的回调。\njs还提供了一个集合，其中包含一些基本模型供您入门。", "note_en": "I made and maintained for a few years a browser extension and I can remember that I would often write tons of code that would later make good features. However those were not easy to maintain and I had two things I wanted to do: one is that I would have a way to write code that could be reused accross the entire application and the second to centralize events.\n userinterface.js was built around the idea that logic relating to how the visual looks and how the visual works should be distinguished.\n At the same time userinterface.js is providing new ways to write and organize your UI.\n Another advantage of using userinterface.js is code reusability through principles of separation of concerns as well UI mechanisms abstraction.\n        To get started with userinterface.js all you need to do is scaffold a new project by following the instructions on the  userinterface.js-skeleton repository.\n  In order to be able to use userinterface.js in the browser you can use git submodules.\n    A  Model is an object representation of a  Node.It has three required properties depending on the method:  name,  method and  properties or  callback,\n The  name property will be the identifier of your model it will be used whenever you need to run your model.The  method property will describe how your model should be ran.The  properties and  callback properties will contain the properties of your Elements.\n   We create a model named  simple model with the method  appendChild it has a two  LI  element children that have the className  simplemodel and textContent  My first simple model.Yes you got it, every properties (except  children) will be set to the  element.\n  UserInterface . model ( {\t name:  &#34;simplemodel&#34; ,\t method:  UserInterface . appendChild ,\t properties:  {\t\t tagName:  &#34;li&#34; ,  // required\t\t className:  &#34;simplemodel&#34; ,\t\t textContent:  &#34;My first simple model&#34;\t } } ) ; UserInterface . runModel ( &#34;simplemodel&#34; ,  {  parentNode:  document . querySelector ( &#34;ul&#34; )  } ) ;\n    In the previous example we created a simple model, but what if we wanted to do more and add some children to it ?The  children property is here for that, it is an Array where you can specify child elements.\n UserInterface . model ( {\t name:  &#34;children&#34; ,\t method:  UserInterface . appendChild ,\t properties:  {\t\t tagName:  &#34;div&#34; ,\t\t className:  &#34;model&#34; ,\t\t children:  [\t\t\t {\t\t\t\t tagName:  &#34;div&#34; ,\t\t\t\t className:  &#34;child&#34; ,\t\t\t\t textContent:  &#34;My first child&#34;\t\t\t\t // and so on..\t\t\t }\t\t ]\t } } ) ; UserInterface . runModel ( &#34;children&#34; ,  {  parentNode:  document . body  } ) ;\n    Models are required to have either the  properties property or  callback property, but exactly what does the  callback property do ?It is used when you want to echo some data in your model.\n For example here, we have a model called  echomodel that has the  callback property. This property works the same as the  properties property does except that an extra step is added before your model is ran.The  callback will return a  properties object accordingly to the data you passed through  runModel.\n UserInterface . model (\t name:  &#34;echomodel&#34; ,\t method:  UserInterface . appendChild ,\t callback:  data  =&gt;  ( {\t\t tagName:  &#34;p&#34; ,\t\t className:  &#34;echomodel&#34; ,\t\t textContent:  &#34;My &#34; + data . text + &#34; model&#34;\t } ) ) ; UserInterface . runModel ( &#34;echomodel&#34; ,  {  parentNode:  document . body ,  data:  { &#34;text&#34;:  &#34;echo&#34;  }  } ) ;\n    A  Binding is a callback function that, when bound to a model, is automatically called whenever the model has ran. Bindings will make your models more alive, an example of that would be adding an event listener to your model, that is the place where you will be doing it.\n You can also do much more such as using event listeners to connect all of your models together!\n A Binding is way to give life to your models enabling them to do things whenever their respective method is executed.That means if you want to add a listener to an Element that&#39;s where you will be doing it.\n  UserInterface . model ( {\t name:  &#34;button&#34; ,\t method:  UserInterface . appendChild ,\t properties:  {\t\t tagName:  &#34;button&#34;\t } } ) ; UserInterface . bind ( &#34;button&#34; ,  function ( element )  {\t element . textContent  =  &#34;bound&#34; ; } ) ; UserInterface . runModel ( &#34;button&#34; ,  {  parentNode:  document . body  } ) ;\n    Objects are the backbone of your models they will store and manipulate data for your  Binding.That&#39;s where you want to hide the complicated stuff.\n   In this example we are creating and running a model called  myModel that will himself run another model and pass it the context  myObj.\n Contexts represent a reserved area for models to communicate with each others, they&#39;re often represented as Object but could pretty much be anything.\n After the second model ran it will listen to the &#34;greeting&#34;  announce.Did you notice the event listener in our first model ? Yes, whenever our first model is clicked it will  announce &#34;greeting&#34; to the context  myObj and pass it an empty object as data. This empty object could also be anything that you want to pass to the other model.\n  UserInterface . model ( {\t name:  &#34;myModel&#34; ,\t method:  UserInterface . appendChild ,\t properties:  {\t\t tagName:  &#34;div&#34;\t } } ) ; UserInterface . model ( {\t name:  &#34;someobscuremodel&#34; ,\t method:  UserInterface . appendChild ,\t properties:  {\t\t tagName:  &#34;div&#34;\t } } ) ; UserInterface . bind ( &#34;myModel&#34; ,  function ( element )  {\t const  _myObj  =  new  Obj ( ) ;\t element . addEventListener ( &#34;click&#34; ,  function ( )  {\t\t UserInterface . announce ( _myObj ,  &#34;greeting&#34; ,  { } ) ;\t } ) ;\t UserInterface . runModel ( &#34;someobscuremodel&#34; ,  {  parentNode:  document . body ,  bindingArgs: [ _myObj ]  } ) ; } ) ; UserInterface . bind ( &#34;someobscuremodel&#34; ,  function ( element ,  myObj )  {\t UserInterface . listen ( myObj ,  &#34;greeting&#34; ,  function ( data )  {\t\t // do something useful with data or greet back\t } ) ; } ) ; UserInterface . runModel ( &#34;button&#34; ,  {  parentNode:  document . body  } ) ;\n                        Processed properties along with any properties a Element can have or a callback returning them\n                            userinterface.js also provides a  collection that contains a few basic models to get you started.", "posttime": "2020-06-02 01:46:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,app,java,javascript,用于", "title": "Userinterface.js-用于构建前端JavaScript应用程序的小型库", "title_en": "Userinterface.js – A small library to build front-end JavaScript applications", "transed": 1, "url": "https://github.com/thoughtsunificator/userinterface.js", "via": "", "real_tags": ["程序", "app", "java", "用于"]}, {"category": "", "categoryclass": "", "imagename": "b0d6e1aabd0846d19451e1d48b3e523e.gif", "infoid": 1004696, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "激光穿过装饰华丽的微细玻璃，已经被证明可以与自身相互作用，形成称为孤子的自我维持的波型。在玻璃中制造的复杂设计是一种光子拓扑绝缘体，这种设备可能会被用来使激光和医学成像等光子技术变得更有效率。2016年获得诺贝尔奖的拓扑材料有能力保护通过它们的波流不受不必要的无序和缺陷的影响。到目前为止，我们对拓扑保护的理解大多限于独立作用的光粒子，但在5月22日发表在“科学”杂志上的一篇新论文中，宾夕法尼亚州立大学的研究人员报告说，他们已经使用拓扑保护来调节光子之间的相互作用，直接观察到这些复杂设备的基本波型。\n宾夕法尼亚州立大学(Penn State)唐斯布罗早期职业发展物理学教授、这篇论文的资深作者米凯尔·雷特斯曼(Mikael Rechtsman)表示，人们可能对电子学更熟悉，但在光子学和光子学的平行世界里，我们关心的是光的性质，而不是电子。光子学有无数的应用，包括电信、使用激光切割的制造，以及激光雷达，例如，用来帮助控制自动驾驶车辆。拓扑保护提供了使光子设备更节能、更轻、更紧凑的承诺。\n拓扑保护的概念可以应用于电子、光子、原子和。例如，在电子学中，拓扑保护可以通过使电子可靠地流过材料而不散射来提高效率。对于电子来说，这种保护需要非常接近绝对零度的极强的外部磁场，但对于光子，所有的实验都可以在室温下进行，因为光子不带电荷，没有磁场。\n为了进行他们的实验，研究人员用激光照射一块玻璃，玻璃上刻有一系列极其精确的隧道，每个隧道的直径大约是人类头发的十分之一。这些被称为波导的隧道就像电线一样，集中了穿过它们的光流。这块玻璃中的波导排列成栅格，形成一个阵列，但每个波导通过玻璃的路径并不是直的-它可能更好地描述为蛇形，由研究人员设计的曲折和弯曲的几何形状导致了光的拓扑保护。\n宾夕法尼亚州立大学博士后研究员、这篇论文的第一作者塞巴巴拉塔·慕克吉(Sebabrata Mukherjee)说，我们必须在实验室里建造制造设施，通过玻璃精确雕刻三维波导，这一过程被称为飞秒激光写入。写入三维波导的能力对于实现拓扑至关重要，通过观察设备边缘受保护的光的单向流动，实验证实了这一特性。\n通过一种称为克尔效应的过程，玻璃的性质会因为强光的存在而改变。玻璃中的这种变化调节了通常不相互作用的许多光子之间的相互作用，这些光子通过阵列传播。随着功率的增加，光线塌陷成一束不扩散(即衍射)，而是螺旋状旋转的光束。孤子的螺旋旋转是研究人员设计的波导特定形状的标志，也是设备确实是拓扑的指示器。\n雷特斯曼说，在正常情况下，光子是互相忽略的。你可以让两束激光束交叉，两者都不会因另一束而改变。在我们的系统中，我们能够让光子相互作用并形成孤子，因为光子的强度改变了玻璃的性质。通过环境的改变，光子变得相互感知。\n孤子是许多相互作用受周围环境影响的系统中最基本的波形。\nRechtsman说，从理论上理解并在实验上探测像我们的阵列这样的拓扑系统中的孤子，将是将拓扑保护应用于光子设备实际应用的关键因素，特别是那些需要高光功率的设备。更多信息：Sebabrata Mukherjee等人。拓扑带隙中Floquet孤子的观测，“科学”(2020)。doi：10.1126/cience.aba8725", "note_en": "Laser light traveling through ornately microfabricated glass has been shown to interact with itself to form self-sustaining wave patterns called solitons. The intricate design fabricated in the glass is a type of &#34;photonic topological insulator,&#34; a device that could potentially be used to make photonic technologies like lasers and medical imaging more efficient.    Topological materials, which were awarded the Nobel Prize in 2016, have the ability to &#34;protect&#34; the flow of waves through them against unwanted disorder and defects. Until now, our understanding of topological protection of   has been mostly limited to particles of light acting independently, but in a new paper that appears May 22 in the journal  Science, researchers at Penn State report that they have used the   to mediate interaction between photons, directly observing the fundamental wave patterns of these intricate devices.\n  &#34;People are perhaps more familiar with electronics, but there is a whole parallel world of &#39;photonics,&#39; where we are concerned with the properties of light instead of electrons,&#34; said Mikael Rechtsman, Downsbrough Early Career Development Professor of Physics at Penn State, and senior author of the paper. &#34;There are myriad applications of photonics, including in  ,   for telecommunication, manufacturing using laser cutting, and lidar, which is used, for example, to help control autonomous vehicles. Topological protection offers the promise to make photonic devices more energy efficient, lighter, and more compact.&#34;\n  The concept of topological protection can be applied in electronic, photonic, atomic, and  . In electronics, for example, topological protection can improve efficiency by getting electrons to flow reliably through a material without scattering. For electrons this protection requires extremely  , nearing absolute zero, and very often a strong external magnetic field, but with photons all of the experiments can be performed at room temperature, and because photons do not have a charge, without a magnetic field.\n    To perform their experiments, the researchers shine a laser through a piece of glass that has a series of extremely precise tunnels carved through it, each with a diameter of about one-tenth that of a human hair. The tunnels, called &#34;waveguides,&#34; act like wires, concentrating the flow of light through them. The waveguides in the piece of glass are arranged in a grid, forming an array, but the path of each waveguide through the glass is not straight—it is perhaps better described as serpentine, with twists and turns designed by the researchers with a geometry that leads to the topological protection of light.\n  &#34;We had to build the fabrication facility in our lab to precisely carve the three-dimensional waveguides through the glass, a process called femtosecond laser writing,&#34; said Sebabrata Mukherjee, a postdoctoral researcher at Penn State and first author of the paper. &#34;The ability to write three-dimensional waveguides is crucial to making the   topological, a property that is confirmed experimentally by observing the &#39;protected&#39; one-way flow of light along the edge of the device.&#34;\n  Through a process called the &#34;Kerr effect,&#34; the properties of the glass are changed due to the presence of the intense  . This change in the glass mediates an interaction between the many photons, which usually do not interact, propagating through the array. As the power was increased, the light collapsed into a beam that didn&#39;t spread out (i.e., diffract), but rather rotated in spirals. The spiral rotation of the solitons is a signature of the specific shape of the waveguides designed by the researchers and an indicator that the device is, indeed, topological.\n  &#34;Under normal circumstances, photons are oblivious to one another,&#34; said Rechtsman. &#34;You can cross two laser beams and neither will be changed by the other. In our system, we were able to get photons to interact and form solitons because the intensity of the   altered the properties of the glass. The photons became &#39;aware&#39; of each other through the change in their environment.&#34;\n  Solitons are known to be the most fundamental waveforms in many systems where interaction is mediated by the surrounding environment.\n  &#34;Theoretically understanding and experimentally probing solitons in topological systems like our   arrays will be a key ingredient in applying topological protection for practical use in photonic devices, especially those that require high optical power,&#34; said Rechtsman.        More information:\t\t\t\t\t\t\t\t\t\t\t\tSebabrata Mukherjee et al. Observation of Floquet solitons in a topological bandgap,  Science (2020).  DOI: 10.1126/science.aba8725", "posttime": "2020-06-02 01:44:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "制造,intricately,光子", "title": "复杂制造的玻璃的几何形状使光阱本身", "title_en": "Geometry of intricately fabricated glass makes light trap itself", "transed": 1, "url": "https://phys.org/news/2020-06-geometry-intricately-fabricated-glass.html", "via": "", "real_tags": ["制造", "光子"]}, {"category": "", "categoryclass": "", "imagename": "e7d2f9136d3e4f7fde072d2a73b5f226.png", "infoid": 1004695, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用Skyfield预测通过(很棒的库！)，并使用Nasa TLE API从最好的CelesTrak网站获取TLE更新数据。\n[{&#34；Rise&#34；：{&#34；Alt&#34；：&#34；10.00&#34；，&#34；az&#34；：&#34；264.51&#34；，&#34；az_ocant&#34；：&#34；N&#34；，&#34；is_sunlight&#34；：true，&#34；utc_datetime&#34；：&#34；星期一，2020年6月1日14：19：29格林尼治标准时间&#34；，&#34；UTC_TIMESTAMP&#34；：1591021169，&#34；可见&#34；：FALSE}，&#34；顶峰&#34；：{&#34；ALT&#34；：&#34；17.38&#34；，&#34；az&#34；：&#34；308.01&#34；，&#34；az_ocant&#34；：&#34；N。，&#34；is_sunlight&#34；：TRUE，&#34；UTC_DATETIME&#34；：&#34；Mon，2020-06 14：21：49 GMT&#34；，&#34；UTC_TIMESTAMP&#34；：1591021309，&#34；可见&#34；：FALSE}，&#34；设置&#34；：{&#34；ALT&#34；：&#34；9.98&#34；，&#34；az。351.63&#34；，&#34；az_ocant&#34；：&#34；NW&#34；，&#34；is_sunlight&#34；：TRUE，&#34；UTC_DATETIME&#34；：&#34；周一，14：24：08 GMT&#34；，&#34；UTC_TIMESTAMP&#34；：1591021448，&#34；可见&#34；：FALSE}，&#34；可见&#34。\n考虑到太阳在地平线附近，而观察者在夜间，可见区域实际上告诉我们卫星是否可能可见。您可以在这里阅读更多内容。", "note_en": "Uses  Skyfield to predict passes (great library!), and  Nasa TLE API to get TLE updated data taken from the greatest  CelesTrak website.\n       [ { &#34;rise&#34;: { &#34;alt&#34;: &#34;10.00&#34;, &#34;az&#34;: &#34;264.51&#34;, &#34;az_octant&#34;: &#34;N&#34;, &#34;is_sunlit&#34;: true, &#34;utc_datetime&#34;: &#34;Mon, 01 Jun 2020 14:19:29 GMT&#34;, &#34;utc_timestamp&#34;: 1591021169, &#34;visible&#34;: false }, &#34;culmination&#34;: { &#34;alt&#34;: &#34;17.38&#34;, &#34;az&#34;: &#34;308.01&#34;, &#34;az_octant&#34;: &#34;N&#34;, &#34;is_sunlit&#34;: true, &#34;utc_datetime&#34;: &#34;Mon, 01 Jun 2020 14:21:49 GMT&#34;, &#34;utc_timestamp&#34;: 1591021309, &#34;visible&#34;: false }, &#34;set&#34;: { &#34;alt&#34;: &#34;9.98&#34;, &#34;az&#34;: &#34;351.63&#34;, &#34;az_octant&#34;: &#34;NW&#34;, &#34;is_sunlit&#34;: true, &#34;utc_datetime&#34;: &#34;Mon, 01 Jun 2020 14:24:08 GMT&#34;, &#34;utc_timestamp&#34;: 1591021448, &#34;visible&#34;: false }, &#34;visible&#34;: false }]\n  The  visible field actually tells if the satellite will be  probably visible, considering the sun is near the horizon, and the observer is at night. You can read more  here.", "posttime": "2020-06-02 01:43:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "卫星,passes,tle", "title": "查询您上方给定卫星的下一遍", "title_en": "Query next passes for a given satellite above you", "transed": 1, "url": "https://github.com/redraw/satellite-passes-api", "via": "", "real_tags": ["卫星", "passes", "tle"]}, {"category": "", "categoryclass": "", "imagename": "029cc7172d0dbc22b20762c5ca27b446.jpeg", "infoid": 1004694, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "乔治·弗洛伊德(George Floyd)被杀后正在进行的抗议活动在周六再次陷入暴力，全国各地的警察向抗议者发射催泪瓦斯，驾驶车辆穿过人群，向记者或自家财产上的人发射非致命性子弹，至少有一次，推倒了一名拄着拐杖离开的老人。以下是执法人员升级全国动乱的一些方式。\n广泛分享：国民警卫队和MPD扫荡我们的住宅区街道。在我们家的前廊向我们发射油漆罐。大喊“照亮他们”#JusticeForGeorgeFloyd#JusticeForGeorge#BlackLivesMatter pic.twitter.com/bW48imyt55。\n-Tanya Kerssen(@tkerssen)2020年5月31日。\n警方刚刚突袭了我们藏身的加油站。在多次呼喊媒体，并在空中举起我的记者证后，我被摔倒在地。然后，另一个警察走过来，在我被按住的时候用胡椒喷雾喷到了我的脸上。pic.twitter.com/23EkZIMAFC。\n-迈克尔·安东尼·亚当斯(@MichaelAdams317)2020年5月31日。\n我是@RyanFairCloth，@StarTribune的记者。他说，当警察朝他的窗户开枪时，他正试图回家。他在流血，但看起来还好。pic.twitter.com/LYH0h7c4hf。\n-贾里德·戈耶特(@JaredGoyette)2020年5月31日。\n警察不喜欢我拍摄着火的汽车，所以他们拿着警棍向我走来。撞了我的自行车。啊，这是音频pic.twitter.com/tfaOoVCw5v“。\n-约翰·库萨克(@JohnCusack)2020年5月31日。\n我不敢相信我刚刚目睹的一切。他们开着警笛把车停在广场上，然后做了这件事。#Louisville pic.twitter.com/65o2lgZCJh。\n-Natalie Neysa Alund(@nataliealund)2020年5月30日。\n当一名纽约警察拉下他的面具并向他喷洒胡椒时，这名男孩举起了双手。⁦@NYPDShea⁩？市长⁦@BilldeBlasio⁩？pic.twitter.com/YtXDOoVckA。\n-谢里琳·伊菲尔(@Sifill_LDF)2020年5月31日。\n明尼苏达州巡逻队刚刚近距离向记者和摄影师发射催泪瓦斯。pic.twitter.com/r7X6J7LKo8。\n-Molly Hennessy-Fiske(@mollyhf)2020年5月31日。\n以下是今早乔伊斯·比蒂(Joyce Beatty)、香农·哈丁(Shannon Hardin)、凯文·博伊斯(Kevin Boyce)、抗议者和哥伦布警察的38张照片序列。pic.twitter.com/ZZEd6MfJCH。\n-凯尔·罗伯逊(@KRobPhoto)2020年5月30日。\n有关乔治·弗洛伊德之死和全国性抗议活动的更多报道，请收听后续内容，或阅读更多：\n像您这样的读者使我们的工作成为可能。帮助我们继续提供您在其他地方找不到的报道、评论和批评。\n加入Slate Plus。\n会合", "note_en": "The ongoing protests following the killing of George Floyd were caught up in violence again on Saturday, as police all over the country tear-gassed protesters, drove  vehicles through crowds, opened fire with nonlethal rounds  on journalists or people  on their own property, and in at least one instance,  pushed over an elderly man who was walking away with a cane. Here are some of the ways law enforcement officers escalated the national unrest.\n  Share widely: National guard and MPD sweeping our residential street. Shooting paint canisters at us on our own front porch. Yelling “light em up”  #JusticeForGeorgeFloyd  #JusticeForGeorge  #BlackLivesMatter  pic.twitter.com/bW48imyt55\n— Tanya Kerssen (@tkerssen)  May 31, 2020\n            Police just raided the gas station we were sheltering at. After shouting press multiple times and raising my press card in the air, I was thrown to the ground. Then another cop came up and peppered sprayed me in the face while I was being held down.  pic.twitter.com/23EkZIMAFC\n— Michael Anthony Adams (@MichaelAdams317)  May 31, 2020\n          This is  @RyanFaircloth, a reporter with the  @StarTribune. He says he was trying to get home when police shot out his window.  He is bleeding but seems ok.  pic.twitter.com/LYH0h7c4hf\n— Jared Goyette (@JaredGoyette)  May 31, 2020\n  Cops didn’t like me filming the burning car so they came at me with batons. Hitting my bike.  Ahhm here’s the audio  pic.twitter.com/tfaOoVCw5v”\n— John Cusack (@johncusack)  May 31, 2020\n      I cannot believe what I just witnessed. They pulled up onto the square with a police siren on and did this.  #Louisville  pic.twitter.com/65o2lgZCJh\n— Natalie Neysa Alund (@nataliealund)  May 30, 2020\n            This boy had his hands up when an NYPD ofcr pulled his mask down and pepper sprayed him. ⁦ @NYPDShea⁩? Mayor ⁦ @BilldeBlasio⁩?  pic.twitter.com/YtXDOoVckA\n— Sherrilyn Ifill (@Sifill_LDF)  May 31, 2020\n          Minnesota State Patrol just fired tear gas at reporters and photographers at point blank range.  pic.twitter.com/r7X6J7LKo8\n— Molly Hennessy-Fiske (@mollyhf)  May 31, 2020\n  Here is a 38 photo sequence of what happen this morning with Joyce Beatty, Shannon Hardin, Kevin Boyce, protesters and Columbus Police.  pic.twitter.com/ZZEd6MfJCh\n— Kyle Robertson (@KRobPhoto)  May 30, 2020\n      For more Slate coverage of George Floyd’s death and the nationwide protests, listen to What Next, or    read more  :\n      Readers like you make our work possible. Help us continue to provide the reporting, commentary, and criticism you won’t find anywhere else.\n  Join Slate Plus\n   Join", "posttime": "2020-06-02 01:43:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "全国,erupt,警察", "title": "警察在全国范围内爆发暴力事件", "title_en": "Police Erupt in Violence Nationwide", "transed": 1, "url": "https://slate.com/news-and-politics/2020/05/george-floyd-protests-police-violence.html", "via": "", "real_tags": ["全国", "erupt", "警察"]}, {"category": "", "categoryclass": "", "imagename": "cdfe4e37ddd3c9c16049739e0142b764.jpeg", "infoid": 1004693, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两年前，在看了一部关于维姆·霍夫(Wim Hof)和他的方法的纪录片后，我开始考虑洗冷水澡，试着亲自看看这样的好处是否值得让我感到不适。\n我说“考虑”是因为正如你可以想象的那样，在冬天跳进冷水澡是你醒来后最不想做的事情。\n因此，我开始认真研究冷水澡的好处，寻找更多急需的动力。\n在过去的几年里，关于冷水澡所谓的好处有很多猜测。他们中的一些人有科学的支持，另一些没有科学的支持。来自“发现我的健康”的健康和长寿专家朗达·帕特里克博士写了一份报告，解释了有关寒冷暴露的科学现状。冷水澡有科学依据的好处包括：\n它会增加棕色脂肪的数量(棕色脂肪越多，身体脂肪百分比越低)。\n它可能通过刺激一种名为RBM3的特殊冷休克蛋白而起到神经保护作用。\n在阅读和做了关于冷暴露的研究后，我发现所有这些都对这种做法有好处，越来越多的人分享了他们在冷水浴方面的积极经验。我决定我需要亲自试一试！\n我不得不承认这比我预想的要难得多。对我来说，为了健康，把早上的热水澡换成冷水澡是不可能的。\n但我还是想把它们融入我的生活。我发现在阻力训练结束后洗冷水澡要容易得多，所以我开始这么做。\n不幸的是，几个月后，我意识到这个技巧大大削弱了阻力训练的好处。\n我被困住了，因为我想洗这些冷水澡，但我想让它们更容易融入我的日常生活中，而且“冷水澡”和“轻松”通常不会很好地搭配在一起。我决定试着把冷水澡推迟到早上。\n我记得我自己，刚醒来，盯着淋浴看了5分钟，想着这会有多难，然后立即编造了一个借口，证明洗个热水澡是合理的！\n我不得不说，在那一刻，我的创造力是有史以来最好的。我记得我曾想过这样的借口：\n哦，我觉得喉咙有点痛，冷水澡肯定会让情况更糟的…。\n“我感觉很冷，这个冷水澡肯定会让我恶心的。”…。\n我只是不能下到淋浴下面，把水调冷，然后呆在那里。\n直到我改变了我对冷水澡的看法，以及我对它们的期待。\n你看，如果你想开始洗冷水澡以获得长期好处，你很容易陷入一种情况，即短期痛苦将远远超过感知到的长期好处。作为人类，我们已经很难考虑长远的问题，所以期望长期利益成为我们早晨跳进冰冷的水中的充分理由，对我们大多数人来说都是不现实的。\n我明白我必须找到一个短期的动力来克服看似不可能的冷水澡。\n冷水澡是我2020年的一个大目标，1月初，我偶然看到了谢恩·帕里什(Shane Parrish)的一条推文，他是“伟大的心理模型”(The Great Mind Model)的作者，也是“知识项目”(Knowledge Project)的主持人。\n对我来说，这就是我所需要的。理解做你不想做的事情的能力是“长期结果的最大来源”。\n它与我产生了很大的共鸣，因为在没有阐述它的情况下，我被这个概念说服了。我之所以认为励志演讲、视频和文章弊大于利，是因为它们宣扬了这样一种观念，即当你认为一切皆有可能时，那种极端的动机感觉，你会感到肾上腺素在体内奔跑，是实现目标的燃料。\n根据我的经验，依靠这种感觉是获得与你想要的完全相反的完美方式。这种感觉不会持久，大多数有意义的成就需要几个月甚至几年的时间才能完成。依靠一种短暂的动力感觉怎么可能是解决方案呢？\n我认为长期成功的最大因素是有能力遵循你的计划，做你今天必须做的下一件事，并克服不想做某些事情的不可避免的感觉。\n所以我决定把做我不想做但必须做的事情的能力作为一种我可以提高的技能来考虑，对我来说，早上洗个冷水澡是训练它的唯一最好的方法。\n有什么比从温暖的床上半醒到洗个冰冷的淋浴更糟糕的呢？\n我给自己一个挑战，在一月份的30天里早上洗冷水澡，作为一种离开我的舒适区开始一年的方式。\n不出所料，这并不容易。但这是它的目标。我洗冷水澡是因为我不想洗冷水澡，尽管听起来很奇怪。\n对我来说，改变游戏规则的是停止思考，这改变了我在冷水中的能力。这是人类大脑的一种常见机制：很快就能找到很好的借口来证明不遵循你的计划是合理的。\n通过这次洗澡实验，我开始培养自我意识，注意到我们可以告诉自己的所有小谎言，并观察到我们经常想出的对失败的不诚实解释。自欺欺人是自我提升的巨大阻碍。\n我一接近播种器，就迅速钻到它下面，让水流淌。刚开始的几秒钟很可怕，但之后会好一点。\n随着时间的推移，我对冷水的耐受力提高了很多。然而，现在的头几秒钟并不比一个月前容易！\n现在我有规律地尝试了一个月的冷水澡，我可以说出我所体验到的好处了。在那一个月里，除了淋浴之外，我没有改变任何其他的生活方式，所以我可以将我感受到的好处归因于冷水澡。\n我非常相信身心健康之间的相互联系。在我看来，我对免疫系统强大的信念和我实际的免疫系统一样重要。维姆·霍夫(Wim Hof)和他的一些学生所做的实验强化了这一信念，并证实了这一点：他们表明，“通过练习在短期培训计划中学到的技术，交感神经系统和免疫系统确实可以自愿受到影响”，并在不接受治疗的情况下克服了细菌注射。\n如果你早上通常很难完全清醒，那就不要再看促性腺激素和其他兴奋剂来解决你的问题了。跳进冷水澡比300毫克的咖啡因要强大得多，不到5分钟就能让你从睡梦中苏醒过来。\n正如我所料，“做你不想做的事”是一项技能，而冷水澡似乎是训练这项技能的绝佳方式。通过习惯不舒服，通过提高你从舒适到不舒服的能力，把事情做好变得更容易。\n情绪波动可能非常频繁，我们都会经历那些没有任何事情按计划进行的早晨。我发现早上第一件事就是进行这种艰难的仪式，这样更容易克服心情不好的日子。克服阵雨会给人一种持续的感觉，那就是度过一天并尊重我说过的要做的事情并不是那么难。\n当你体验到一种非常不舒服的感觉时，大脑和身体之间会发生一些事情。它有一种冥想的效果，迫使你活在当下，对你所拥有的和即将到来的一天心存感激，因为这一天很可能不会有比这个冷水澡更难的身体成分了。经历身体上的逆境是一个很好的日常提醒，让我们享受我们所拥有的一切美好的事物，并有助于减少压力和焦虑。\n一个月后，我的挑战就完成了。现在问题来了，下一步是什么。我发现冷水澡的好处和体验总体上是非常积极的，所以我决定无限期地坚持下去。\n在这个月里，当我对冷浸泡更感兴趣的时候，我在波兰的Wim Hof营地偶然看到了一段来自Yes They的很棒的视频。我认为冷水澡是冷浸泡世界迈出的伟大的第一步，我很乐意在即将到来的一年里参与到这样的冒险中来！\n目前，巴黎冬天的水很冷，对Wim Hof的同样的引述也激励着我每天跳进冰冷的水里：\n“如果你不去御寒，感冒就会向你袭来”\n这并不适合每个人，但是如果你觉得你需要练习你的韧性，这是一个很好的起点！", "note_en": "Two years ago, after watching a documentary about Wim Hof and his method I started considering taking cold showers to try and see for myself if the benefits are worth the discomfort.\n I say “consider” because as you can imagine, jumping in a cold shower during winter is the last thing you want to do upon waking up.\n  So I started really looking into the benefits of cold showers in search of further much-needed motivation.\n  There have been a lot of speculations over the last years about the alleged benefits of cold showers. Some of them are backed by science, others are not. Health and longevity specialist Dr. Rhonda Patrick from  Found my fitness wrote a  report explaining the current state of the science regarding cold exposure. Among the science-backed benefits of cold showers are:\n It increases the amount of brown fat (having more brown fat is  associated with lower body fat percentage)\n It may have a neuroprotective effect through stimulating a special cold shock protein known as RBM3\n   After reading and doing my research about cold exposure, I found all these benefits to this practice and a growing community of people sharing their positive experiences with cold showers. I decided I needed to try it for myself!\n  I have to admit it was much harder than I expected. For me, switching from the morning hot shower to a cold one for the health benefits was just impossible.\n But I still wanted to incorporate them into my life... I found that taking cold showers just after resistance training was much easier so I started to do so.\n Unfortunately, a few months later, I realized this trick  undermines greatly the benefits of resistance training.\n I was stuck because I wanted to take these cold showers, but I wanted to make it easier to incorporate them into my daily routine, and “cold showers” and “easy” usually don’t go well together. I decided to try to move the cold showers back to the morning.\n I remember myself, just after waking up, staring at the shower for 5 minutes thinking about how hard it will be, and immediately inventing an excuse that will justify getting a hot shower instead!\n I have to say at that moment, my creativity was the best it ever was. I can recall coming up with excuses like:\n “Oh, I feel a little pain in my throat, the cold shower will for sure make it worse…”\n “I feel very cold, this cold shower will for sure make me sick…”\n  I was just unable to get under the shower, turn the water cold, and stay there.\n Until I changed my perception of cold showers, and what I was expecting from them.\n  You see if you want to start cold showers for the long term benefits, you will easily be stuck in a situation where short term pain will be far more intense than the perceived long term benefits. As humans, it’s already hard for us to think long term, so expecting a long term benefit to be a sufficient reason to jump in that freezing cold water in the morning is just not realist for most of us.\n I understood that I had to find a short term motivation to overcome that seemingly impossible cold shower.\n Cold showers were a big objective for me in 2020, and early January, I came across a tweet from Shane Parrish, author of  The Great Mental Models and host of  The Knowledge Project.\n  For me, that was all I needed. Understanding that the ability to do things you don’t want to do is “the biggest generator of long term results”.\n It resonated a lot with me because without formulating it, I was convinced by this concept. The reason why I think motivational speeches, videos, and articles do more harm than good is that they promote the idea that the feeling of extreme motivation when you think everything is possible, and you feel adrenaline running in your body is the fuel for achievement.\n In my experience, relying on this feeling is a perfect way to get the exact opposite of what you want. This feeling doesn’t last, and most meaningful achievements take months if not years to get completed. How relying on an ephemeral feeling of motivation could possibly be the solution?\n I think the biggest factor in long term success is the ability to follow your plan, do the next thing you have to do today and overcome the inevitable feeling of not wanting to do certain things.\n So I decided to consider the  ability to do things I don’t want to do but have to do as a skill I could improve, and to me, a morning cold shower was the single best way to train it.\n What could possibly be worse than going half awake from a warm bed to a freezing cold shower?\n I gave myself the challenge to take morning cold showers for 30 days during the month of January as a way to start the year outside of my comfort zone.\n  As expected it was not easy. But it was the goal of it. I was taking cold showers  because I don’t want to take cold showers, as weird as it might sound.\n For me, the game-changer in my ability to get under the cold water was to stop thinking. It’s a common mechanism of the human brain: finding great excuses really fast to justify not following your program.\n With this shower experiment, I started to develop self-awareness, notice all the little lies we could tell ourselves and observe the dishonest explanations to our failures we often come up with. Lying to ourselves is a huge inhibitor to self-improvement.\n As soon as I get close to the sower, I quickly get under it and just let the water flow. The first seconds are horrible, but then it gets a bit better.\n With time, my tolerance for cold water increased a lot. However, the first seconds are not easier now than they were a month ago!\n  Now that I tried cold showers regularly for a month, I can tell the benefits I experienced. I didn’t change anything else than the showers in my lifestyle during that month so I can attribute the benefits I felt to cold showers.\n  I am a huge believer in the interconnection between mind and body health. To my mind, my belief in the strength of my immune system is as much important as my actual immune system. This belief was increased and confirmed by the experiment Wim Hof and some of his students went through: they  showed that “through practicing techniques learned in a short-term training program, the sympathetic nervous system and immune system can indeed be voluntarily influenced” and overcome a bacterial injection without medical treatment.\n  If you usually struggle to get fully awake in the morning, stop looking at nootropics and other stimulants to fix your problem. Jumping in a cold shower is much more powerful than 300mg of caffeine and will get you from sleeping to fully awake in less than 5 minutes.\n  As I expected, “doing things you don’t want to do” is a skill, and cold showers seem to be an excellent way to train this skill. By getting used to discomfort and by improving your ability to go from comfort to discomfort, getting stuff done becomes easier.\n  Mood swings can be very frequent, and we all go through those mornings where nothing goes as planned. I found having this hard ritual first thing in the morning made it easier to get over bad mood days. Overcoming the shower gives a sustained feeling that it’s not that hard to get through the day and respect what I said I was going to do.\n  There is something that happens between the mind and the body when you experience a very uncomfortable feeling. It has a meditative effect and forces you to be present in the moment and be grateful for what you have and for your day to come that will most likely not have any harder physical component than this cold shower. Experiencing physical adversity is a great daily reminder to enjoy all the great things we have and contributes to less stress and anxiety.\n  After a month, my challenge is completed. Now comes the question of what’s next. I found the benefits and the experience of cold showers so positive overall that I decided to stick to it indefinitely.\n As I got even more interested in cold immersion during this month, I came across a great  video from Yes Theory at the Wim Hof camp in Poland. I think cold showers are a great first step in the world of cold immersion and I would love to participate in such an adventure in the year to come!\n For the moment, the water is pretty cold in Paris during winter, and the same quote for Wim Hof motivates me to jump under the cold water every day:\n “If you don’t go to the cold, the cold will come to you”\n It’s not for everyone, but if you feel like you need to practice your resilience it’s a great place to start!", "posttime": "2020-06-02 01:42:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冷水澡,cold", "title": "30天的冷水澡：不是我想要的", "title_en": "30 Days of Cold Showers: Not What I Was Expecting", "transed": 1, "url": "https://medium.com/lifetizr/i-took-a-cold-shower-everyday-for-30-days-393d9f99138e", "via": "", "real_tags": ["冷水澡", "cold"]}, {"category": "", "categoryclass": "", "imagename": "42c9c376df8873196e35ca3493ca1f5d.png", "infoid": 1004690, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以研究为基础的政策解决方案的综合平台，以结束美国的警察暴行。", "note_en": "The comprehensive platform of research-based policy solutions to end police \rbrutality in America.", "posttime": "2020-06-02 00:58:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "结束,police,基础", "title": "零运动：结束美国的警察暴力", "title_en": "Campaign Zero: End police violence in America", "transed": 1, "url": "https://www.joincampaignzero.org/", "via": "", "real_tags": ["结束", "police", "基础"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004689, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我担心我可能已经陷入了一个时间循环，在这个循环中，我注定每周都会写同样的博客文章，讲述最高法院如何推迟审议其合格的豁免议程。早在4月份，我就注意到，法院在5月15日的会议上安排了13个不同的限定豁免案件，其中3个案件明确要求法院完全重新考虑这一原则。自去年10月以来，其中许多请愿书已经得到充分通报，并已准备就绪，可供审议。但法院随后重新安排了大部分案件的审理时间，一次又一次，一次又一次。\n今天早上，最高法院又一次搁置了这个问题。上周四参加会议的有八份不同的合格豁免证书请愿书，但在今天上午的法庭命令中，这些请愿书都没有获得批准或被拒绝。我们预计这些请愿书将很快在6月4日(周四)的法院会议上重新提交，这意味着我们最快可能在6月8日(周一)对这些案件做出最终裁决。\n虽然显然不可能确切知道大法官们在这些案件中持续拖延的动机是什么，但我可以预计，乔治·弗洛伊德的死，以及他的死引发的持续愤怒和混乱，正在沉重地压在他们的心头。正如我的同事克拉克·内利上周所讨论的那样，德里克·肖文犯下的毫无意义的暴力行为-以及乔治·弗洛伊德乞求救命时袖手旁观的警察令人震惊的漠不关心-是我们对执法部门几乎没有责任的文化的产物。虽然这种文化有许多复杂的原因，但最重要的原因之一是合格免疫力。正如我在周末指出的那样，各种类型的记者和评论员都认识到乔治·弗洛伊德的死与最高法院无法无天改写我们的主要民权法规之间的深刻联系。\n大法官们现在有一个非常关键的机会，可以采取第一步来纠正有条件豁免的法律和道德变态。如果他们这样做，也许会对乔治·弗洛伊德(George Floyd)和许多像他一样的人的悲惨死亡产生一些小小的救赎作用。如果不是，我们对执法部门的信任危机将会变得多么严重，这一点怎么夸大都不为过。", "note_en": "I fear I may have become trapped in a time loop, in which every week I am doomed to write the same blog post about how the Supreme Court has delayed consideration of its qualified immunity docket. Back in  April, I noted that the Court had scheduled thirteen different qualified immunity cases for its May 15th conference, including three cases explicitly calling for the Court to reconsider the doctrine entirely. Many of these petitions had already been fully briefed and ready for consideration since last October. But the Court then rescheduled the bulk of those cases  again, and  again, and  again.\n This morning, the Court kicked the can down the road once more. There were eight different qualified immunity cert petitions that went to conference last Thursday, but none of those petitions were either granted or denied in this morning’s  orders. We expect that these petitions will soon be relisted for the Court’s conference this Thursday, June 4th, which means we could get a decision in these cases as soon as Monday, June 8th.\n While it’s obviously impossible to know for sure what is motivating the Justices’ continued delay in these cases, I expect that the death of George Floyd, and the continuing outrage and chaos his death has provoked, are weighing heavily on their minds. As my colleague Clark Neily  discussed last week, the senseless violence committed by Derek Chauvin—and the stunning indifference of the officers standing by as George Floyd begged for his life—is the product of our culture of near‐​zero accountability for law enforcement. And while that culture has many complex causes, one of the most significant is qualified immunity. As  I noted over the weekend, reporters and commentators of all stripes have recognized the profound connection between George Floyd’s death and the Supreme Court’s lawless rewriting of our primary civil rights statute.\n The Justices have a critical opportunity now to take the first steps toward correcting the legal and moral perversities of qualified immunity. If they do so, perhaps it will effect some small measure of redemption for the tragic death of George Floyd, and so many like him. If not, it is difficult to overstate how severe our crisis of confidence in law enforcement will become.", "posttime": "2020-06-02 00:58:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "豁免权,immunity,豁免", "title": "随着合格豁免权成为焦点，SCOTUS推迟了更多时间", "title_en": "As Qualified Immunity Takes Center Stage, More Delay from SCOTUS", "transed": 1, "url": "https://www.unlawfulshield.com/2020/06/as-qualified-immunity-takes-center-stage-more-delay-from-scotus/", "via": "", "real_tags": ["豁免权", "immunity", "豁免"]}]