[{"category": "", "categoryclass": "", "imagename": "97f94e3fad2838f563ba48ec50ae45ed.jpg", "infoid": 1005928, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "获取关于冠状病毒的所有最新新闻，并每天将更多信息发送到您的收件箱。您可以在此处注册。\n据当地搬家公司称，受国内冠状病毒爆发影响最严重的大都市纽约市，正在以前所未有的速度失去居民。\n例如，Roadway Moving总裁罗斯·萨皮尔(Ross Sapir)告诉福克斯商业频道(Fox Business)，随着他的公司应对自2008年成立以来最繁忙的季节，人们正在搬离曼哈顿，数量之多他以前从未见过。\n“这太疯狂了，…。我从来没有见过这样的增长。“萨皮尔说。“就搬离这座城市而言，(业务量)是其他任何季节的两倍或三倍。”\n在某些日子里，Roadway留下的查询增加了200%。它的客户主要是高净值个人，通常是曼哈顿富裕地区25岁至45岁的专业人士。\nUnited Van Lines首席执行官马克·罗杰斯(Marc Rogers)告诉福克斯商业(Fox Business)，大多数搬出曼哈顿的居民(61%)的收入超过10万美元。那些搬出去的人也往往年龄更大-64%的人年龄在55岁或以上-或者在25岁到40岁之间(25%)。\n“在…，纽约市5月份的房价上涨幅度非常大。这些都是人们对搬家感兴趣的线索。“罗杰斯说。\n根据United Van Lines向福克斯商业提供的数据，与去年相比，纽约市场对搬家的兴趣上升了40%。这些数字远远超过了同期平均增长8%的全国趋势。\n纽约市搬家公司Oz Moving告诉福克斯商业频道，虽然其总工作量从3月到4月下降了46%，但从3月到5月，搬离纽约市的人数增加了12%。与此同时，与去年相比，4月份纽约市内部的搬家人数下降了47%。\n与全国数据一致，Sapir表示，他在他的公司在全国各地服务的任何其他市场都没有看到任何接近纽约市水平的活动。\n对纽约来说，坏消息是2020年最繁忙的季节可能还没有到来。\n最初，随着冠状病毒病例激增，恐慌迫使人们离开曼哈顿。萨皮尔说，他接到了要求第二天服务的人打来的疯狂电话。然而，现在他正在与那些有更深思熟虑的计划的客户合作-他认为这些客户不会回到城市，特别是如果学校不重新开学的话。\n美国联合航空公司(United Van Lines)表示，大型搬家公司正在等待数千项计划，预计今年的“旺季”将发生在7月至9月之间，而不是传统的5月至7月。罗杰斯说，有很多“被压抑的需求”。\nRoadway的很大一部分客户正在离开曼哈顿前往佛罗里达或南方的其他地区。\n来自联合面包车公司的数据证实了这些趋势。纽约市居民对迈阿密表现出搬家兴趣的首选目的地是迈阿密，坦帕和奥兰多也进入了前十名-亚特兰大、夏洛特和罗利-达勒姆也是如此。\n萨皮尔说，纽约市逃亡者中其他受欢迎的目的地包括新泽西州、康涅狄格州和威彻斯特的周边郊区。\n然而，这不仅仅是一次性的举动。在公路方面，与去年同期相比，库存增加了900%。萨皮尔说，这些人似乎对自己的长期计划不确定，可能正在尝试一个新的地点，看看明年左右曼哈顿的情况会如何。\n上周，当被问及在税收暴跌之际，由于担心将富人赶出纽约市，他是否提出了对富人增税的计划时，纽约市市长白思豪(Bill De Blasio)表示，冠状病毒大流行带来了一系列差异，包括阶层差异。\n白思豪说：“即使在这场危机中，富人也在不断变得更加富有。”“所以，我绝对相信现在是讨论对富人增税的公平时机。”\n纽约州州长安德鲁·科莫(Andrew Cuomo)要求立法者取消州和地方税收减免的1万美元上限，以帮助居民，并可能防止高净值个人前往税收较低的州。", "note_en": "Get all the latest news on coronavirus and more delivered daily to your inbox.   Sign up here.\n  New York City, the metropolitan area hardest hit by the domestic  coronavirus outbreak, is losing residents at an unprecedented clip, according to local moving companies.\n Roadway Moving President Ross Sapir, for example, told FOX Business that people are moving out of Manhattan in numbers he has “never seen before,” as his company deals with its busiest season since its 2008 inception.\n “It’s insane … I’ve never seen such growth,” Sapir said. “[Business is] double or triple compared to any other season as far as moving out of the city.”\n  On some days, Roadway experiences a 200 percent increase in leaving inquiries. Its clientele consists largely of higher net-worth individuals, typically 25-year-old to 45-year-old professionals in well-to-do parts of Manhattan.\n    United Van Lines CEO Marc Rogers told FOX Business that the majority of residents moving out of Manhattan, 61 percent, are earning over $100,000. And those moving out also tend to be older – 64 percent are aged 55 or over – or in the 25 to 40 age range (25 percent).\n “New York City is up very dramatically for May in … these leads for interest in moving,” Rogers said.\n The New York market has seen a 40 percent uptick in interest for move-outs when compared with last year, according to data provided to FOX Business by  United Van Lines. Those numbers far outpace national trends, which show an average increase of 8 percent during the same time period.\n New York City moving company  Oz Moving told FOX Business that while its overall workload decreased by 46 percent from March to April, moves out of New York City rose 12 percent between March and May. Meanwhile, moves within New York City were down 47 percent in April when compared with last year.\n Consistent with the national data, Sapir said he has not seen activity anywhere near New York City levels in any of the other markets that his company serves across the country.\n The bad news for the Big Apple is that 2020’s busiest season has likely not even arrived yet.\n Initially, panic drove people out of Manhattan, as coronavirus cases surged. Sapir said he fielded frantic calls from people who were requesting next-day service. However, now he is working with clients who have a more thought-through plan – whom he doesn’t see returning to the city, especially if schools do not reopen.\n United Van Lines says large moving companies are sitting on thousands of initiatives in queue, predicting the “busy season” this year will occur between July and September, rather than the traditional May through July. Rogers said there is a lot of “pent-up demand.”\n   A large proportion of Roadway’s clients are leaving Manhattan for Florida, or other areas in the South.\n Data from United Van Lines corroborated those trends. The top destination that New York City residents were showing moving interest in was Miami, while Tampa and Orlando also made the top 10 – as did Atlanta, Charlotte and Raleigh-Durham.\n The other popular destinations among New York City escapees include surrounding suburban areas in New Jersey, Connecticut and Westchester, Sapir said.\n It’s not only one-off moves, however. At Roadway, storage is up 900 percent when compared with the same period last year. Sapir said these people seem to be unsure of their long-term plans and might be trying out a new location to see how the situation plays out in Manhattan over the next year or so.\n   When asked last week whether he had tabled plans to raise taxes on the wealthy over fears of driving them from the city at a time when tax revenues have plummeted, New York City Mayor Bill de Blasio said the coronavirus pandemic has brought up a number of disparities, including class disparities.\n “The rich keep getting richer even in the midst of this crisis,” de Blasio said. “So, I absolutely believe this is a fair time to talk about higher taxes on the wealthy.”\n New York Gov. Andrew Cuomo is asking lawmakers to lift a $10,000 cap on state and local tax deductions, as a means to help residents and potentially prevent high-net-worth individuals from leaving for lower-tax states.", "posttime": "2020-06-10 07:42:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人员,evacuation,纽约市", "title": "搬家人员说，随着居民向南迁移，从纽约市疏散是“疯狂的”", "title_en": "“insane” evacuation from NYC, movers say, as residents head south", "transed": 1, "url": "https://www.foxbusiness.com/features/coronavirus-insane-exodus-nyc", "via": "", "real_tags": ["人员", "纽约市"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005926, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "IBM云状态页面", "note_en": "IBM Cloud Status page", "posttime": "2020-06-10 07:09:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "cloud,状态", "title": "IBM Cloud关闭以及他们的状态页面(看起来托管在那里", "title_en": "IBM Cloud down as well as their status page which looks to be hosted there", "transed": 1, "url": "https://cloud.ibm.com/status", "via": "", "real_tags": ["cloud", "状态"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005925, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "更新：到目前为止，捆绑包取得了巨大的成功，更多的开发人员提交了他们的项目。我们增加了新一轮的游戏&还有更多。所有以前和将来的买家都可以即时访问。现在包括了1000个项目。\n我们生活在一个种族不公正、不平等和警察对黑人施暴的时代。我们希望每个人都尽其所能表明立场。我们已经与来自我们平台的所有创建者合作，以支持那些直接与受影响的人合作的组织。\n我们联系了我们的社区，史无前例的创作者捐赠了740多个项目，成为我们认为是有史以来最大的捆绑包的一部分。超过3，400美元的有偿作品可供选择，最低捐款金额为5美元。\n所有收益将捐赠给NAACP法律辩护和教育基金和社区保释基金，各占一半。\n请注意：捆绑购买不会赠送Steam(或其他外置钥匙)。itch.io页面上只提供直接下载。\n什么是itch.io？itch.io是一个开放的市场，面向专注于独立视频游戏的独立数字创作者。了解更多。\n如果您是有兴趣将他们的项目添加到捆绑包中的开发人员，请回复此帖子中的顶级帖子。", "note_en": "Update: The bundle has been a huge success so far and many more developers have submitted their projects. We&#39;ve added a new round of games &amp; more. All previous and future buyers get instant access. There are now 1,000 projects included.\n    We live in a time of racial injustice, inequality, and police brutality against black people. We hope that everyone takes a stand in any way that they can. We’ve partnered with creators from all across our platform to support organizations that are working directly with those affected.\n  We reached out to our community and an unprecedented number of creators donated over 740 projects to be part of what we believe is the largest bundle ever. Over $3,400 of paid works are available Pay-what-you-want with a minimum donation amount of $5.\n  All proceeds will be donated to the  NAACP Legal Defense and Educational Fund and  Community Bail Fund split 50/50.\n  Please note: No Steam (or other external keys) will be given for bundle purchases. Only direct downloads will be available on the itch.io page.\n        What is itch.io? itch.io is an open marketplace for independent digital creators with a focus on independent video games.  Learn more\n    If you’re a developer who is interested in adding their project to the bundle please reply to the top-level post  in this thread.", "posttime": "2020-06-10 07:07:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "定期,items,捆绑", "title": "定期购买1,427件商品，价格为5美元--7890美元", "title_en": "Buy 1,427 items for $5 Regularly –$7,890", "transed": 1, "url": "https://itch.io/b/520/bundle-for-racial-justice-and-equality", "via": "", "real_tags": ["定期", "items", "捆绑"]}, {"category": "", "categoryclass": "", "imagename": "56250ea599c451bef9fa72944ecd134d.png", "infoid": 1005924, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几年前，DeepMind在古老的围棋游戏中击败了特级围棋大师，令研究界惊叹不已。最近，DeepMind看到其自学成才的代理人在视频游戏“星际争霸II”(StarCraft II)中击败了专业人士。现在，这家总部位于英国的人工智能公司又推出了另一项令人印象深刻的创新，这一次是在文本到语音(TTS)领域。文语转换(TTS)系统以自然语言文本为输入，以合成的类人语音为输出。文本到语音合成流水线是复杂的，包括文本归一化、对齐语言特征、MEL谱图合成、原始音频波形合成等多个处理阶段。尽管像Siri这样的数字助理中使用的现代TTS系统拥有高保真的语音合成和广泛的现实部署，但即使是最好的TTS系统也有缺点。每一阶段都需要昂贵的“地面真实”注释来监督输出，而且系统不能直接从字符或音素作为输入进行训练，以端到端的方式合成语音，这种方式在其他机器学习领域越来越受欢迎。为了解决这些问题，DeepMind研究人员开发了EATS，这是一种以端到端方式进行对抗性训练的生成性模型，其性能可与依赖多阶段培训和额外监督的SOTA模型相媲美。\nEATS(端到端对抗性TTS)的任务是将输入的字符或音素序列映射到24 kHz的原始音频。现实世界中的一个关键挑战是，输入文本和输出语音信号通常具有非常不同的长度，并且不对齐。EATS通过两个高级子模块来处理这一问题：校准器预测每个输入令牌的持续时间并产生音频对准表示，以及解码器将校准器的输出上采样到全音频。\n它是一种前馈卷积神经网络，适合于要求快速批处理推理的应用。\n对抗性方法使生成器能够从相对较弱的监督信号中学习，从而显著降低了注释的成本。\n它不依赖于自回归抽样或教师强迫，避免了诸如暴露偏差和减少推理时的并行性等问题，这使得它在训练和推理方面都很有效。\n研究人员使用平均意见得分(MOS)来衡量语音质量来评估EATS。在测试中，所有模型都在由专业配音人员表演的人类语音数据集及其对应的文本上进行了训练。语音池由69名说北美英语的人组成。\n与以前的模型相比，EATS需要的监督要少得多，但仍能达到4.083的MOS，接近GaN-TTS和WaveNet等SOTA方法的水平，而且比No RWDS、No MelD和No Differdicator等模型要好得多。这篇论文端到端的对抗性文本到语音是在arxiv上的。", "note_en": "DeepMind wowed the research community several years ago by defeating grandmasters in the ancient game of Go, and more recently saw its self-taught agents thrash pros in the video game StarCraft II. Now, the UK-based AI company has delivered another impressive innovation, this time in text-to-speech (TTS).  Text-to-speech (TTS) systems take natural language text as input and produce synthetic human-like speech as their output. The text-to-speech synthesis pipelines are complex, comprising multiple processing stages such as text normalisation, aligned linguistic featurisation, mel-spectrogram synthesis, raw audio waveform synthesis and so on.  Although contemporary TTS systems like those used in digital assistants like Siri boast high-fidelity speech synthesis and wide real-world deployment, even the best of them still have drawbacks. Each stage requires expensive “ground truth” annotations to supervise the outputs, and the systems cannot train directly from characters or phonemes as input to synthesize speech in the end-to-end manner increasingly favoured in other machine learning domains.  To address these issues, DeepMind researchers have developed EATS, a generative model trained adversarially in an end-to-end manner that achieves performance comparable to SOTA models that rely on multi-stage training and additional supervision.\n  EATS (End-to-end Adversarial TTS) is tasked with mapping an input sequence of characters or phonemes to raw audio at 24 kHz. A critical real-world challenge is that the input text and output speech signals will generally have very different lengths and are not aligned. EATS deals with this via two high-level submodules: An aligner which predicts the duration of each input token and produces an audio-aligned representation, and a decoder which upsamples the aligner’s output to the full audio frequency.\n   It is a feed-forward convolutional neural network, which makes it suitable for applications where fast batched inference is important.\n The adversarial approach enables the generator to learn from a relatively weak supervisory signal, significantly reducing the cost of annotations.\n It does not rely on autoregressive sampling or teacher forcing, avoiding issues like exposure bias and reduced parallelism at inference time, which makes it efficient in both training and inference.\n Researchers evaluated EATS using Mean Opinion Score (MOS) to measure speech quality. In the tests, all models were trained on datasets of human speech performed by professional voice actors and their corresponding text. The voice pool comprised 69 North American English speakers.\n  Compared to previous models, EATS requires substantially less supervision but still achieves an MOS of 4.083, approaching the level of SOTA methods like GAN-TTS and WaveNet, and substantially better than models like No RWDs, No MelSpecD, and No Discriminators.  The paper  End-to-End Adversarial Text-to-Speech is on  arXiv.", "posttime": "2020-06-10 07:07:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,推出,introduces,语音", "title": "DeepMind推出“Eats”--一种对抗性的、端到端的TTS方法", "title_en": "DeepMind Introduces ‘Eats’ – An Adversarial, End-to-End Approach to TTS", "transed": 1, "url": "https://syncedreview.com/2020/06/09/deepmind-introduces-eats-an-adversarial-end-to-end-approach-to-tts/", "via": "", "real_tags": ["app", "推出", "语音"]}, {"category": "", "categoryclass": "", "imagename": "4e3b6c35db38bd9cb301e2634eb23889.png", "infoid": 1005923, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们也是程序员和网络工程师的草根社区，他们在构建和部署新的网络元素方面相互帮助。我们关心的是实际应用和寻找更简单的方法来做事情。\n欢迎您加入我们的社区！向下滚动到底部的ForTips，了解如何参与其中。\nSnabb编译为名为snabb的独立可执行文件。这个单一的二进制文件包括多个应用程序，可以在任何现代Linux/x86-64发行版上运行。(你可以把它想象成网络的忙碌盒子。)。\nSnabb NFV使QEMU/KVM网络性能适用于需要高数据包速率的应用，如ISP核心路由器。这是为那些想要在每台服务器上处理高达100 Gbps或50 Mpps的Virtio-Net网络流量的人而设计的。我们最初开发Snabb NFV是为了支持德国电信的TeraStreamNetwork。\n您可以使用QEMU独立部署Snabb NFV，也可以将其与OpenStack等云计算平台集成。\nSnabb lwAFTR是IPv6过渡技术轻量级4-over-6(Lw4o6)面向互联网的组件。ISP可以使用lwAFTR功能为其用户提供对IPv4互联网的访问，同时维护简单的仅支持IPv6的内部网络。部署Snabb lwAFTR的ISP还可以配置lw4o6在多个不同客户之间共享IPv4地址，从而改善IPv4地址空间耗尽问题并降低成本。有关更多详细信息，请参阅lwAFTR文档。\nVPWS(Virtual Private Wire Service，虚拟专用线服务)是Alexander Gall at Switch公司开发的第二层VPN应用。他的Github VPN分支机构是发展的主线。\nPacetBlaster通过重放PCAP格式的跟踪文件或将可定制的数据包合成到任意数量的英特尔82599万兆网络接口上来生成加载。这是非常高效的：即使对于数百Gbps的流量，也只需要每个CPU一个核心的很小的%。因为只需要很少的CPU资源，所以您可以在小型服务器上运行PacketBlaaster，甚至可以直接在被测设备上运行PacketBlaaster。\nSNSH(Snabb Shell)是一个用于交互试验Snabb的工具。它使用Lua shell提供对所有API的直接访问。您可以从脚本文件或交互式shell操作snsh。\nsnabb二进制文件是独立的，包括所有应用程序，并且可以在计算机之间复制。\n或者简单地运行snabb，就像在Linux下一样。这是通过使用包装器外壳脚本实现的，该脚本作为&#39；make docker&#39；的一部分进行链接：", "note_en": "We are also a grassroots community of programmers and networkengineers who help each other to build and deploy new networkelements. We care about practical applications and finding simplerways to do things.\n  You are welcome to join our community! Scroll down to the bottom fortips on how you can get involved.\n      Snabb compiles into a stand-alone executable called snabb. This single binary includes multiple applications and runs onany modern  Linux/x86-64 distribution. (You couldthink of it as a busybox fornetworking.)\n    Snabb NFV makes QEMU/KVM networkingperformance practical for applications that require high packet rates,such as ISP core routers. This is intended for people who want toprocess up to 100 Gbps or 50 Mpps of Virtio-net network traffic perserver. We originally developed Snabb NFV to support DeutscheTelekom&#39;s  TeraStreamnetwork.\n You can deploy Snabb NFV stand-alone with QEMU or you can integrate itwith a cloud computing platform such as OpenStack.\n  Snabb lwAFTR is the internet-facing component of&#34;lightweight 4-over-6&#34; (lw4o6), an IPv6 transition technology. An ISPcan use lwAFTR functions to provide its users with access to the IPv4internet while maintaining a simple IPv6-only internal network. An ISPdeploying Snabb lwAFTR can also configure lw4o6 to share IPv4 addressesbetween multiple different customers, ameliorating the IPv4 addressspace exhaustion problem and lowering costs. See the  lwAFTRdocumentation for more details.\n  VPWS (Virtual Private Wire Service) is a Layer-2 VPN application beingdeveloped by Alexander Gall at  SWITCH. His Github  vpn branchis the master line of development.\n  packetblaster generates load byreplaying a  pcap format tracefile or synthesizing customizable packets onto any number of Intel 82599 10-Gigabit networkinterfaces. This is very efficient: only a small % of one core per CPUis required even for hundreds of Gbps of traffic. Because so littleCPU resources are required you can run packetblaster on a small serveror even directly on a Device Under Test.\n  snsh (Snabb Shell) is a tool for interactivelyexperimenting with Snabb. It provides direct access to all APIsusing a Lua shell. You can operate snsh either from script files orfrom an interactive shell.\n    The  snabb binary is stand-alone, includes all of the applications,and can be copied between machines.\n        Or simply run snabb, as you would under linux. This is made possible by using a wrapper shell script thatgets linked to as part of &#39;make docker&#39;:", "posttime": "2020-06-10 07:06:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,pure,snabb", "title": "Snabb：使用Lua的100 Gbit/s纯软件交换", "title_en": "Snabb: 100 Gbit/s pure software switching using Lua", "transed": 1, "url": "https://github.com/snabbco/snabb", "via": "", "real_tags": ["软件", "pure", "snabb"]}, {"category": "", "categoryclass": "", "imagename": "fa23edad7b64ba208ea1786d069058cf.jpg", "infoid": 1005921, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月，特斯拉首席执行官埃隆·马斯克(Elon Musk)在当地卫生官员的建议下，强行让他在加州的电动汽车工厂重新开张。现在有报道的冠状病毒病例可能源于仓促的重新开放。\n正如华盛顿邮报周二报道的那样，据报道，特斯拉在弗里蒙特工厂的几名工人因冠状病毒而下岗。两例确诊病例来自附近一家单独的制造座椅的工厂。\n特斯拉和弗里蒙特工厂所在的阿拉米达县早在5月份就达成了一项协议，将在该县关闭时间表之前重新开工。该州加快了制造业的重新开放，唐纳德·特朗普(Donald Trump)总统甚至鼓励马斯克重启，因此马斯克继续为弗里蒙特工厂制定了他版本的与社会疏远、产能减少和符合面具的计划。\n那是在与县官员敲定正式重新开放计划的一周前。县卫生官员告诉“华盛顿邮报”，在此之前，马斯克将工人送回了工厂，这意味着检测还不是必需的，而且可能会让生病的工人在工作时传播传染病。特斯拉没有回复记者的置评请求。\n阿拉米达县过去一个月的病例有所增加，截至周日，累计病例近4000例。当特斯拉工厂正式重新开工时，只有2200多箱。", "note_en": "Last month Tesla CEO Elon Musk  bullied his way to reopening his electric car factory in California ahead of local health officials&#39; recommendations. Now there are reported coronavirus cases that likely stemmed from the rushed reopening.\n As the   Washington Post reported Tuesday, several workers at Tesla facilities in Fremont were reportedly away from work because of coronavirus. Two confirmed cases were based out of a separate, nearby factory that makes seats.\n Tesla and Alameda County, where the Fremont factory is based,  reached an agreement back in May to reopen ahead of the county&#39;s shutdown schedule. The state had accelerated manufacturing reopening and  President Donald Trump even encouraged Musk to restart, so Musk went ahead with his version of a social-distancing, reduced-capacity, and mask-compliant plan for the Fremont factory.\n  That was a week before settling on an  official reopening plan with county officials. Before that, Musk sent workers back to the factory, which meant testing wasn&#39;t required yet and could have allowed sick workers to spread the infectious disease while at work, as county health officials told the  Washington Post. Tesla didn&#39;t respond to a request for comment.\n Alameda County has seen an  increase in cases in the past month, with nearly 4,000 cumulative cases as of Sunday. When the Tesla factory officially reopened, there were just over 2,200 cases.", "posttime": "2020-06-10 07:05:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,迫使,factory,马斯克", "title": "马斯克迫使工厂重新开工后，特斯拉工人对新冠肺炎的检测呈阳性", "title_en": "Tesla workers test positive for Covid-19 after Musk forced factory reopening", "transed": 1, "url": "https://mashable.com/article/tesla-fremont-factory-coronavirus/", "via": "", "real_tags": ["特斯拉", "迫使", "factory", "马斯克"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005920, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们依赖您的支持：您听说过Phoronix Premium吗？这是什么补充本网站上的广告，为我们的优质无广告服务。每月只需3美元，您就可以帮助支持我们的网站，同时产生的资金允许我们继续进行Linux硬件审查、性能基准测试、维护我们的社区论坛等等。你也可以考虑通过贝宝支付小费。今天早上，我注意到串扰/SRBDS是继英特尔发布月度安全建议之后最新的侧通道漏洞。事实证明，英特尔违反了他们自己对这一披露的禁令，在他们收回之前，我碰巧很快就发现了这一点。在那之后的几个小时里，这个串音漏洞背后的大学研究人员伸出援手，提供了一份被禁运的白皮书副本。到目前为止，正式披露时间已过，因此有关此新的侧通道英特尔CPU漏洞的信息是公开的，它首次表明投机性执行可使攻击者跨英特尔CPU上的物理内核泄漏敏感信息。\n大学研究人员发现，这个最新的漏洞可以绕过诸如Spectre和Meltdown之类的现有内核内缓解，而不依赖于攻击者/受害者在同一个CPU内核上。因此，即使禁用了超线程并采取了先前的缓解措施，在获得新的CPU微码之前，英特尔CPU仍会受到串扰的影响。SRBDS在本质上类似于MDS(微体系结构数据采样)，但有这一重要区别。荷兰阿姆斯特丹Vrije大学和瑞士苏黎世理工学院的研究人员做出了这一发现。\n此新的临时执行漏洞称为特殊寄存器缓冲区数据采样(SRBDS)。此漏洞与执行对共享缓冲区的核外访问的指令有关。在易受SRBDS攻击的指令中有RDRAND和RDSEED，由于需要安全随机数生成这一特性通常非常敏感，因此RDRAND和RDSEED尤其有问题。大学研究人员确实有概念实现的证据表明，RDRAND/RDSEED的输出甚至可以从独立CPU上的Intel SGX Enclaves内部泄露。\n研究人员发现的受影响的CPU范围从英特尔天空湖到至少咖啡湖。英特尔Cascade Lake似乎是第一代不容易受到跨核攻击的产品。\n减轻串扰涉及在更新分级缓冲器之前锁定整个存储器总线，并在内容已被清除之后解锁。但由于这是一个巨大的性能损失，当前的英特尔CPU微码缓解仅在安全关键指令(如RDRAND/RDSEEED/EGETKEY)附近强加了这种行为，而发出核外请求的其他指令可能最终仍会跨CPU内核泄漏。虽然有概念代码的证据，但英特尔认为SRBDS在现实世界中很难利用。\n2018年9月对此分阶段缓冲区内容泄漏进行了初步概念验证实施，并于2019年7月进一步证明了RDRAND/RDSEED泄漏。直到现在，英特尔才将这一披露公之于众，同时通过漏洞赏金计划奖励研究人员。据研究人员称，这段很长的公开期据说是由于实施跨核心漏洞修复的困难造成的。\n由于禁运已经解除，这篇论文和更多细节将发布在相声漏洞网站上。我已经在内部对缓解后的微码运行基准测试，并将启动这些基准测试，但考虑到英特尔仅针对选定指令进行缓解的范围较为有限，因此除RdRand性能等方面外，总体影响可能很小。请稍后关注Phoronix上的基准测试。\n最新消息：英特尔今天发布了适用于从哈斯韦尔到咖啡湖的Linux操作系统的最新CPU微码。", "note_en": "We Rely On Your Support: Have you heard of  Phoronix Premium? It&#39;s what complements advertisements on this site for our premium ad-free service. For as little as $3 USD per month, you can help support our site while the funds generated allow us to keep doing Linux hardware reviews, performance benchmarking, maintain our community forums, and much more. You can also consider  a tip via PayPal.   This morning I noted  CrossTalk / SRBDS as the newest side-channel vulnerability following Intel&#39;s monthly security advisories being sent out. It turns out Intel broke their own embargo on the disclosure and I happened to spot it quickly before they retracted it. In the hours since, the university researchers behind this CrossTalk vulnerability reached out and have provided an embargoed copy of the whitepaper. As of now, the formal disclosure time has passed so information on this new side-channel Intel CPU vulnerability is public and it shows for the first time that speculative execution can enable attackers to leak sensitive information across physical cores on Intel CPUs.\n    The university researchers discovered this newest vulnerability can bypass existing intra-core mitigations from the likes of Spectre and Meltdown while not being contingent upon the attacker/victim being on the same CPU core. So even if Hyper Threading is disabled and with prior mitigations, Intel CPUs can still be exposed to CrossTalk until obtaining new CPU microcode. SRBDS is similar in nature to MDS (Microarchitectural Data Sampling) but with this important difference. Making this discovery were researchers at Vrije Universiteit Amsterdam, The Netherlands and ETH Zurich, Switzerland.\n  This new transient execution vulnerability is referred to as Special Register Buffer Data Sampling (SRBDS). This vulnerability is about instructions that perform off-core accesses to shared buffers. Among the instructions vulnerable to SRBDS is RDRAND and RDSEED, which is particularly problematic due to the often sensitive nature of needing secure random number generation. The university researchers do have a proof of concept implementation showing that the output of RDRAND/RDSEED can even be leaked from within Intel SGX enclaves on separate CPUs.\n  The affected CPUs found by researchers span from Intel Skylake through at least Coffee Lake. Intel Cascade Lake appears to be the first generation not vulnerable to cross-core attacks.\n  Mitigating CrossTalk involves locking the entire memory bus before updating the staging buffer and unlocking it after the contents have been cleared. But as that is a huge performance penalty, the current Intel CPU microcode mitigation is only imposing this behavior around &#34;security critical&#34; instructions like RDRAND / RDSEEED / EGETKEY while other instructions that issue off-core requests may still end up being leaked across CPU cores. While there is proof of concept code, Intel for their part believes SRBDS is difficult to exploit in the real world.\n  An initial proof-of-concept implementation of this staging buffer contents leakage was made in September 2018 and further RDRAND/RDSEED leakage proved in July 2019. Only now is Intel making this disclosure public while rewarding the researchers via the bug bounty program. This very long disclosure period was reportedly done due to &#34;the difficulty of implementing a fix for the cross-core vulnerabilities&#34;, according to the researchers.\n  The paper and more details will be published on  the CrossTalk vulnerability site now that the embargo has lifted. I am already running benchmarks internally on the mitigated microcode and will have those up, but given the more limited scope that Intel is mitigating it for just select instructions, the overall impact is likely to be small except for areas like RdRand performance. Stay tuned for benchmarks on Phoronix shortly.\n  UPDATE: Intel has now  released updated CPU microcode for Linux spanning from Haswell to Coffee Lake for today&#39;s disclosure.", "posttime": "2020-06-10 07:04:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "显示,shows,英特尔", "title": "串扰显示跨物理CPU核心泄漏信息的可能性", "title_en": "CrossTalk Shows Possibility of Leaking Information Across Physical CPU Cores", "transed": 1, "url": "https://www.phoronix.com/scan.php?page=article&item=crosstalk-srbds-vulnerability&num=1", "via": "", "real_tags": ["显示", "shows", "英特尔"]}, {"category": "", "categoryclass": "", "imagename": "9512a824683caaf77735664c4b79196b.jpg", "infoid": 1005919, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "巴比伦健康已经承认其GP视频预约应用程序遭遇了数据泄露。\n在该公司的一名用户发现他被允许访问数十个其他患者的会诊视频后，该公司就被提醒了这个问题。\n巴比伦的一项后续检查显示，还有少量英国用户也可以看到其他会话。\n巴比伦允许其成员通过智能手机视频通话与医生、治疗师或其他健康专家交谈，并在适当的时候向附近的药店发送电子处方。它在英国拥有超过230万注册用户。\n总部设在利兹的罗里·格洛弗通过与巴比伦合作伙伴之一宝帕(Bupa)的私人健康保险计划会员资格获得了这项服务。\n周二上午，当他去检查处方时，他注意到应用程序的咨询回放部分有大约50个视频不属于他。\n当你使用一个可信的应用程序时，你不会期望看到这样的事情。看到犯下如此重大的错误，令人震惊。\n格洛弗说，他提醒了一位曾为巴比伦工作的同事注意这一事实。他转而向该公司的合规部门指出了这一问题。\n它在声明中说，6月9日星期二下午，我们发现并解决了一个问题，在两个小时内，一名患者访问了另一名患者的会诊记录介绍。\n我们的调查显示，今天预约预约的三名患者通过巴比伦应用程序中用户个人资料的一个部分错误地显示了其他患者的会诊记录，但没有查看。\n&#34；这是软件错误而不是恶意攻击的结果。问题很快就被发现和解决了。\n当然，我们非常认真地对待任何安全问题，无论多么微小，我们都会联系受影响的患者，在需要的时候更新情况，向他们道歉，并提供支持。\n一位发言人说，在格洛弗的同事联系之前，巴比伦的工程团队就已经意识到了这个问题。\n他说，这个问题是通过一项新功能意外引入的，该功能允许用户在通话过程中将基于音频的咨询切换到基于视频的咨询。\n他补充说，受影响的用户仅在英国，这不会影响我们的国际业务。\n不过，格洛弗表示，他仍有顾虑，不打算再次使用这项服务。\n你希望你说的任何话都是私人的，而不是与陌生人分享。", "note_en": "Babylon Health has acknowledged that its GP video appointment app has suffered a data breach.\n The firm was alerted to the problem after one of its users discovered he had been given access to dozens of video recordings of other patients&#39; consultations.\n A follow-up check by Babylon revealed a small number of further UK users could also see others&#39; sessions.\n  Babylon allows its members to speak to a doctor, therapist or other health specialist via a smartphone video call and, when appropriate, sends an electronic prescription to a nearby pharmacy. It has more than 2.3 million registered users in the UK.\n  Leeds-based Rory Glover had access to the service via his membership of a private health insurance plan with Bupa, one of Babylon&#39;s partners.\n On Tuesday morning, when he went to check a prescription, he noticed he had about 50 videos in the Consultation Replays section of the app that did not belong to him.\n   &#34;You don&#39;t expect to see anything like that when you&#39;re using a trusted app. It&#39;s shocking to see such a monumental error has been made.&#34;\n Mr Glover said he alerted a work colleague to the fact, who used to work for Babylon. He in turn flagged the issue to the company&#39;s compliance department.\n    &#34;On the afternoon of Tuesday 9 June we identified and resolved an issue within two hours whereby one patient accessed the introduction of another patient&#39;s consultation recording,&#34; it said in statement.\n &#34;Our investigation showed that three patients, who had booked and had appointments today, were incorrectly presented with, but did not view, recordings of other patients&#39; consultations through a subsection of the user&#39;s profile within the Babylon app.\n &#34;This was the result of a software error rather than a malicious attack. The problem was identified and resolved quickly.\n &#34;Of course we take any security issue, however small, very seriously and have contacted the patients affected to update, apologise to and support where required.&#34;\n A spokesman said that Babylon&#39;s engineering team was already aware of the issue before it was contacted by Mr Glover&#39;s workmate.\n He said the problem had been accidentally introduced via a new feature that lets users switch from audio to video-based consultations part way through a call.\n  &#34;Affected users were in the UK only and this did not impact our international operations,&#34; he added.\n However, Mr Glover said he still had concerns and did not intend to use the service again.\n  &#34;You expect anything you say to be private, not for it to be shared with a stranger.&#34;", "posttime": "2020-06-10 06:48:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,app,gp,health", "title": "巴比伦健康承认GP应用程序遭遇数据泄露", "title_en": "Babylon Health admits GP app suffered a data breach", "transed": 1, "url": "https://www.bbc.co.uk/news/technology-52986629", "via": "", "real_tags": ["程序", "app", "gp", "health"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005918, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当Go项目开始时，“一个总体目标是Go通过启用工具、自动化诸如代码格式化之类的平凡任务以及消除处理大型代码库的障碍来做更多的事情来帮助正在工作的程序员”(Go FAQ)。十多年后的今天，我们继续遵循同样的目标，特别是当它与程序员最关键的工具：他们的编辑器有关时。\n在过去的十年里，围棋开发人员依赖于各种编辑器和几十个独立创作的工具和插件。Go早期的成功在很大程度上要归功于GoCommunity创建的奇妙的开发工具。围棋的VS代码扩展使用了很多这样的工具，现在有41%的围棋开发者在使用(围棋开发者调查)。\n随着VS Code Go扩展的流行和生态系统的扩展，它需要更多的维护和支持。在过去的几年中，Go团队与VS Code团队合作来帮助Go扩展维护人员。Go团队还开始了一项新的计划，以改进支持所有Go编辑器扩展的工具，重点是支持带GOPLS的语言服务器协议和带Delve的调试适配器协议。\n通过VS Code和Go团队之间的这种协作工作，我们意识到Go团队在发展围棋语言之外的围棋开发体验方面处于独特的地位。\n因此，我们很高兴地宣布围棋团队与VS代码团队合作的下一阶段：围棋的VS代码扩展正式加入围棋项目。随之而来的是两个关键变化：\n该项目的存储库正在移动，以加入https://github.com/golang/vscode-go.上Go项目的其余部分。\n我们对那些帮助建立和维持这一心爱的延伸的人的感激之情怎么说都不为过。我们知道创新的想法和功能来自您，我们的用户。作为扩展的所有者，Go团队的主要目标是减轻Go社区的维护工作负担。我们将确保构建保持绿色，对问题进行分类，并更新文档。围棋团队成员将使贡献者了解相关的语言变化，我们将消除扩展的不同依赖关系之间的矛盾。\n请继续与我们分享您的想法，提交问题并为该项目做出贡献。贡献的流程现在将与Go项目的其余部分相同。围棋团队成员将在地鼠松弛的#vscode频道提供一般帮助，我们还创建了#vscode-dev频道，与贡献者讨论问题和集思广益。\n我们对这一新的进步感到兴奋，希望您也是如此。通过维护主要的围棋编辑器扩展，以及围棋工具和语言，围棋团队将能够为所有围棋用户提供更有凝聚力和更精致的开发体验，而无论他们的编辑是谁。\n一如既往，我们的目标是不变的：每个用户都应该拥有编写Go代码的出色体验。", "note_en": "When the Go project began, “an overarching goal was that Go do more to help theworking programmer by enabling tooling, automating mundane tasks such as codeformatting, and removing obstacles to working on large code bases”( Go FAQ).Today, more than a decade later, we continue to be guided by that same goal,especially as it pertains to the programmer’s most critical tool: their editor.\n Throughout the past decade, Go developers have relied on a variety of editorsand dozens of independently authored tools and plugins. Much of Go’s earlysuccess can be attributed to the fantastic development tools created by the Gocommunity. The VS Code extension for Go, built usingmany of these tools, is now used by 41 percent of Go developers( Go developer survey).\n As the VS Code Go extension grows in popularity and as the ecosystem expands, itrequires more maintenance and support.Over the past few years, the Go team has collaborated with the VS Code team tohelp the Go extension maintainers. The Go team also began a new initiative toimprove the tools powering all Go editor extensions, with a focus on supportingthe Language Server Protocolwith   gopls and the Debug Adapter Protocol with Delve.\n Through this collaborative work between the VS Code and Go teams, we realizedthat the Go team is uniquely positioned to evolve the Go development experiencealongside the Go language.\n As a result, we’re happy to announce the next phase in the Go team’spartnership with the VS Code team:  The VS Code extension for Go is officiallyjoining the Go project. With this come two critical changes:\n The project’s repository is moving to join the rest of the Go project at  https://github.com/golang/vscode-go.\n We cannot overstate our gratitude to those who have helpedbuild and maintain this beloved extension. We know that innovative ideas andfeatures come from you, our users. The Go team’s primary aim as owners of theextension is to reduce the burden of maintenance work on the Go community.We’ll make sure the builds stay green, the issues get triaged, and the docs getupdated. Go team members will keep contributors abreast of relevant languagechanges, and we’ll smooth the rough edges between the extension’s differentdependencies.\n Please continue to share your thoughts with us by filing issues and making contributionsto the project. The process for contributing will now be the same as for the rest of the Go project. Go teammembers will offer general help in the #vscode channel on Gophers Slack, and we’ve also createda #vscode-dev channel to discuss issues and brainstorm ideas with contributors.\n We’re excited about this new step forward, and we hope you are too.By maintaining a major Go editor extension, as well as the Go tooling andlanguage, the Go team will be able to provide all Go users, regardless of theireditor, a more cohesive and refined development experience.\n As always, our goal remains the same: Every user should have an excellentexperience writing Go code.", "posttime": "2020-06-10 06:47:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "扩展,extension,围棋", "title": "VS Code Go扩展加入了Go项目", "title_en": "The VS Code Go extension joins the Go project", "transed": 1, "url": "https://blog.golang.org/vscode-go", "via": "", "real_tags": ["扩展", "extension", "围棋"]}, {"category": "", "categoryclass": "", "imagename": "dc13a89db3acad775563ccc40902218e.jpg", "infoid": 1005917, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook的研究人员表示，他们已经开发出所谓的神经转译器，这是一种将代码从一种高级编程语言(如C++、Java和Python)转换成另一种高级编程语言的系统。它是无人监督的，这意味着它在没有标签的数据集中寻找以前没有检测到的模式，并且只需最少的人工监督，据报道，它的表现比基于规则的基线“显著”高出一大截。\n将现有代码库迁移到现代或更高效的语言(如Java或C++)需要源语言和目标语言的专业知识，而且成本通常很高。例如，澳大利亚联邦银行在五年的时间里花费了大约7.5亿美元将其平台从COBOL转换到Java。转译器在理论上可能有帮助-它们消除了从头开始重写代码的需要-但在实践中很难构建，因为不同的语言可能具有不同的语法，并依赖于独特的平台API、标准库函数和变量类型。\nFacebook的系统-代码转换器，可以在C++、Java和Python之间转换-通过一种无监督的学习方法解决了这一挑战。代码转换器首先使用跨语言语言模型预训练进行初始化，它将表示相同指令的代码片断映射到相同的表示形式，而与编程语言无关。(源代码序列的输入流是随机屏蔽的，代码转换器的任务是根据上下文预测屏蔽的部分。)。一种称为去噪自动编码的过程训练系统生成有效序列，即使在输入有噪声的输入数据时也是如此，而反向转换允许代码转换器生成可用于训练的并行数据。\n代码转换器的跨语言特性源于跨编程语言存在的公共标记(锚点)的数量，这些标记来自诸如“for”、“While”、“if”和“try”等常见关键字，以及源代码中出现的数字、数学运算符和英语字符串。反向翻译通过将源到目标模型与并行训练的“后向”目标到源模型相耦合来提高系统的翻译质量。目标到源模型用于将目标序列翻译成源语言，产生有噪源序列，而源到目标模型帮助从噪声源重构目标序列，直到两个模型收敛。\nVB Transform 2020 Online-7月15-17日。加入领先的人工智能高管：注册免费直播。\nFacebook的研究人员在一个公共的GitHub语料库上对代码转换器进行了培训，语料库包含超过280万个开源存储库，目标是在功能层面进行翻译。(在编程中，函数是用于执行单个相关操作的可重用代码块。)。在对所有可用的源代码进行代码转换器预培训之后，去噪自动编码和反向翻译组件仅在功能上进行培训，在具有大约6,000个令牌的批次组件之间交替。\n为了评估代码转换器的性能，研究人员从GeeksforGeek提取了852个用C++、Java和Python编写的并行函数，GeeksforGeek是一个收集编码问题并用几种编程语言提供解决方案的在线平台。利用这些，他们开发了一种新的衡量标准-计算精度-测试假设函数在给定相同输入时是否会产生与参考相同的输出。\nFacebook指出，虽然性能最好的代码转换器版本并没有生成许多与参考资料严格相同的函数，但其翻译的计算精度很高。他们将此归因于波束搜索的结合，这是一种维护一组部分解码的序列的方法，这些序列被附加到形成的序列中，然后进行评分，这样最好的序列就会冒泡到顶部：\n当从C++转换到Java时，74.8%的代码转换器代返回了预期的输出。\n当从C++转换到Python时，67.2%的代码转换器代返回了预期的输出。\n当从Java转换到C++时，91.6%的代码转换器代返回了预期的输出。\n当从Python转换到Java时，56.1%的代码转换器代返回了预期的输出。\n当从Python转换到C++时，57.8%的代码转换器代返回了预期的输出。\n当从Java转换到Python时，68.7%的代码转换器代返回了预期的输出。\n根据研究人员的说法，代码转换器在实验中展示了对每种语言特定的语法以及语言的数据结构和方法的理解，并且它在适应小的修改(如当输入中的变量被重命名时)的同时，在编程语言之间正确地对齐库。虽然它并不完美-例如，代码转换器在生成过程中未能考虑到某些变量类型-但它的表现优于使用专家知识手动重写规则的框架。\n“代码转换器可以很容易地推广到任何编程语言，不需要任何专业知识，而且性能远远超过商业解决方案，”合著者写道。“我们的结果表明，通过向解码器添加简单的约束以确保生成的函数在语法上是正确的，或者通过使用专用架构，可以很容易地修复模型中的许多错误。”\nFacebook并不是唯一一个开发代码生成人工智能系统的组织。在今年早些时候的微软构建大会上，OpenAI演示了一个基于GitHub存储库的模型，该模型使用英语注释来生成整个函数。两年前，莱斯大学的研究人员创建了一个名为Bayou的系统，它能够通过将“意图”关联到公开可用的代码后面来编写自己的软件程序。\n英特尔实验室首席科学家兼主任贾斯汀·戈特施利希(Justin Gottschlich)在最近的一次采访中告诉VentureBeat：“(像这样的程序)真的只是试图消除创建软件的细枝末节。”“(他们)可以帮助加快…的生产效率。(通过处理)窃听。(他们可以)增加(科技行业)的工作岗位数量，因为没有编程背景的人将能够利用他们的创造性直觉，通过这些意向性界面通过机器捕捉到这一点。", "note_en": "Facebook researchers say they’ve developed what they call a neural transcompiler, a system that converts code from one high-level programming language like C++, Java, and Python into another. It’s unsupervised, meaning it looks for previously undetected patterns in data sets without labels and with a minimal amount of human supervision, and it reportedly outperforms rule-based baselines by a “significant” margin.\n Migrating an existing codebase to a modern or more efficient language like Java or C++ requires expertise in both the source and target languages, and it’s often costly. For example, the Commonwealth Bank of Australia  spent around $750 million over the course of five years to convert its platform from COBOL to Java. Transcompilers could help in theory — they eliminate the need to rewrite code from scratch — but they’re difficult to build in practice because different languages can have a different syntax and rely on distinctive platform APIs, standard-library functions, and variable types.\n  Facebook’s system —  TransCoder, which can translate between C++, Java, and Python — tackles the challenge with an unsupervised learning approach. TransCoder is first initialized with cross-lingual language model pretraining, which maps pieces of code expressing the same instructions to identical representations regardless of programming language. (Input streams of source code sequences are randomly masked out, and TransCoder is tasked with predicting the masked-out portions based on context.) A process called denoising auto-encoding trains the system to generate valid sequences even when fed with noisy input data, and back-translation allows TransCoder to generate parallel data that can be used for training.\n The cross-lingual nature of TransCoder arises from the number of common tokens — anchor points — existing across programming languages, which come from common keywords like “for,” “while,” “if,” and “try” and also digits, mathematical operators, and English strings that appear in the source code. Back-translation serves to improve the system’s translation quality by coupling a source-to-target model with a “backward” target-to-source model trained in parallel. The target-to-source model is used to translate target sequences into the source language, producing noisy source sequences, while the source-to-target model helps to reconstruct the target sequences from the noisy sources until the two models converge.\n  VB Transform 2020 Online - July 15-17. Join leading AI executives:  Register for the free livestream.\n The Facebook researchers trained TransCoder on a public GitHub corpus containing over 2.8 million open source repositories, targeting translation at the function level. (In programming, functions are blocks of reusable code that are used to perform a single, related action.) After pretraining TransCoder on all source code available, the denoising auto-encoding and back-translation components were trained on functions only, alternating between the components with batches of around 6,000 tokens.\n To evaluate TransCoder’s performance, the researchers extracted 852 parallel functions in C++, Java, and Python from GeeksforGeeks, an online platform that gathers coding problems and presents solutions in several programming languages. Using these, they developed a new metric — computational accuracy — that tests whether hypothesis functions generate the same outputs as a reference when given the same inputs.\n Facebook notes that while the best-performing version of TransCoder didn’t generate many functions  strictly identical to the references, its translations had high computational accuracy. They attribute this to the incorporation of beam search, a method that maintains a set of partially decoded sequences that are appended to form sequences and then scored so the best sequences bubble to the top:\n When translating from C++ to Java, 74.8% of TransCoder’s generations returned the expected outputs.\n When translating from C++ to Python, 67.2% of TransCoder’s generations returned the expected outputs.\n When translating from Java to C++, 91.6% of TransCoder’s generations returned the expected outputs.\n When translating from Python to Java, 56.1% of TransCoder’s generations returned the expected outputs.\n When translating from Python to C++, 57.8% of TransCoder’s generations returned the expected outputs.\n When translating from Java to Python, 68.7% of TransCoder’s generations returned the expected outputs.\n According to the researchers, TransCoder demonstrated an understanding of the syntax specific to each language as well as the languages’ data structures and their methods during experiments, and it correctly aligned libraries across programming languages while adapting to small modifications (like when a variable in the input was renamed). And while it wasn’t perfect — TransCoder failed to account for certain variable types during generation, for example — it outperformed frameworks that rewrite rules manually built using expert knowledge.\n “TransCoder can easily be generalized to any programming language, does not require any expert knowledge, and outperforms commercial solutions by a large margin,” the coauthors wrote. “Our results suggest that a lot of mistakes made by the model could easily be fixed by adding simple constraints to the decoder to ensure that the generated functions are syntactically correct, or by using dedicated architectures.”\n Facebook isn’t the only organization developing code-generating AI systems. During  Microsoft’s Build conference earlier this year, OpenAI  demoed a model trained on GitHub repositories that uses English-language comments to generate entire functions. And two years ago, researchers at Rice University created a system —  Bayou — that’s able to write its own software programs by associating “intents” behind publicly available code.\n “[Programs like these are] really just trying to eliminate the minutiae of creating software,” principal scientist and director at Intel Labs Justin Gottschlich told VentureBeat in a recent interview. “[They] could help accelerate productivity … [by taking care of] bugging. [And they could] increase the number of jobs [in tech] because people who don’t have a programming background will be able to take their creative intuition and capture that via machine by these intentionality interfaces.”", "posttime": "2020-06-10 06:46:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,代码,programming,facebook,transcoder", "title": "Facebook的代码转换器AI可以在编程语言之间转换", "title_en": "Facebook’s TransCoder AI Translates Between Programming Languages", "transed": 1, "url": "https://venturebeat.com/2020/06/08/facebooks-transcoder-ai-converts-code-from-one-programming-language-into-another/", "via": "", "real_tags": ["编程", "代码", "facebook"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005916, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据一些业务逻辑，您需要定期向某些用户发送电子邮件(例如，时事通讯)。\n以MongoDB为例，当然持久性可以根据您的喜好进行更改。\n为您的内部模块和功能制定明确的合作者和职责是很重要的。\n如果您通过使用TDD测试驱动应用程序来启动应用程序，这几乎是免费的。\nTEST(向尚未收到新闻稿的用户发送新闻稿&#39；，异步t=&gt；{等待UserRepository.insert({name：&#39；test&#39；，email：&#39；[电子邮件受保护]&#39；，lastEmailSentAt：null})等待新闻稿。run()//我应该在此声明什么？//我们需要新闻稿的协作者.})。\n为了定义合作者，我尝试遵循单一责任原则(来自可靠原则家族)。\n您可以更进一步，从业务角度来看待它：\n谁是与特定软件组件或模块相关联的&#34；角色(如个人或业务部门)？\n它断言在调用findNotYetReceivedNewsletter方法时，返回了正确的用户数。\n测试(&#39；查找尚未收到时事通讯的用户&#39；，异步t=&gt；{等待UsersCollection.insert({name：&#39；test&#39；，email：&#39；[电子邮件受保护]&#39；，lastEmailSentAt：New Date()})等待UsersCollection.insert({name：&#39；test&#39；，email：&#39；[电子邮件受保护。)const Users=await userRepository.findNotYetReceivedNewsletter()t.true(Array.isArray(Users))t.is(users.length，1)t.true(UsersCollection.find.calledOnce)t.true(UsersCollection.find.calledWith({lastEmailSentAt：null}))})。\n在这种情况下，电子邮件的实际发送是已清除的，因此不会实际发送任何电子邮件。\ntest(将时事通讯发送给用户&#39；，异步t=&gt；{const user={name：&#39；test&#39；，email：&#39；[电子邮件受保护]&#39；，lastEmailSentAt：null}const emailStub=sinon.stub(email，&#39；send&#39；)等待emailService.sendTo(User)t.is(emailStub.callCount，\n人们可能倾向于将所有逻辑放在一个函数中，然后就到此为止。\n它可能会奏效，但能持续多久呢？或者更好的是：如何有效地测试它？\n在第一个UAT中，我认为很明显，我们需要提供时事通讯模块，至少提供一种方法来检索用户。\n让我们在UserRepository中尝试一下，并断言已查询Users集合以查找尚未收到时事通讯的用户：\ntest(&#39；向尚未收到的用户发送时事通讯&#39；，异步t=&gt；{等待db.get(&#39；用户&#39；).insert({name：&#39；test&#39；，email：&#39；[电子邮件受保护]&#39；，lastEmailSentAt：null})sinon.spy(userRepository，&#39；findNotYetReceivedNewsLetter&)。)等待时事通讯。运行(用户存储库)t.is(userRepository.findNotYetReceivedNewsletter.callCount，1)//我们仍需要协作者来发送时事通讯.})。\n使用.spy，因为我希望查询数据库，并在稍后断言函数已被调用。\n对于电子邮件，我不希望调用真正的函数，因此使用.stub。\n我在测试中传入了合作者，并在应用程序代码中使用真正的实现。\n异步函数运行(userRepository，emailService){const Users=await userRepository.findNotYetReceivedNewster()for(用户的const用户){await emailService.sendTo(User)}}。\ntest(&#39；向尚未收到的用户发送时事通讯&#39；，异步t=&gt；{等待db.get(&#39；用户&#39；).insert({name：&#39；test&#39；，email：&#39；[电子邮件受保护]&#39；，lastEmailSentAt：null})sinon.spy(userRepository，&#39；findNotYetReceivedNewsLetter&)。)等待时事通讯.run(userRepository，emailService)t.is(userRepository.findNotYetReceivedNewsletter.callCount，1)t.is(emailService.sendTo.callCount，1)//实现您关于参数的断言，如电子邮件的&#34；收件人&#34；，&#34；主题&#34；，&#34；内容等})。\n├──index.js├──index.test.js├──lib│├──db.js│├──Email-Service.js│├──Email-Service.test.js│├──email.js│├──email.test.js│├──User-Repository.js│└──User-Repository.test.js├──Package.lock.json└──Package.json。\n其他软件组件都经过了单元测试，有关更多详细信息，请查看GitHub上的项目\n每个合作者都有自己的测试(除了lib/db.js，因为它是一个围绕monk的简单包装器，已经经过了很好的测试)。\njs是选择用来发送电子邮件的API的包装器，并且有一个公开的函数.Send。", "note_en": "You need to send a recurring email to some users (a newsletter for example), based on some business logic.\n          MongoDB as an example, but of course the persistence can be changed at your liking\n   It&#39;s important to come up with clear collaborators and responsibilities for your internal modules and functions.\n This comes almost for free if you start your application by test-driving it using TDD.\n     test(&#39;sends a newsletter to users that did not yet receive it&#39;, async t =&gt; { await UserRepository.insert({ name: &#39;test&#39;, email: &#39; [email protected]&#39;, lastEmailSentAt: null }) await newsletter.run() // what should I assert here?? // we need a collaborator for the newsletter...})\n   To define the collaborators I try to follow the Single Responsibility Principle (from the SOLID principles family).\n  You can take it a step further and see it from the business point of view:\n Who is the &#34;actor&#34; (like a person or business sector) associated to a specific software component or module?\n       It asserts that when calling the method  findNotYetReceivedNewsletter, the correct number of users are returned.\n  test(&#39;find users that did not yet receive the newsletter&#39;, async t =&gt; { await UsersCollection.insert({ name: &#39;test&#39;, email: &#39; [email protected]&#39;, lastEmailSentAt: new Date() }) await UsersCollection.insert({ name: &#39;test&#39;, email: &#39; [email protected]&#39;, lastEmailSentAt: null }) sinon.spy(UsersCollection, &#39;find&#39;) const users = await userRepository.findNotYetReceivedNewsletter() t.true(Array.isArray(users)) t.is(users.length, 1) t.true(UsersCollection.find.calledOnce) t.true(UsersCollection.find.calledWith({ lastEmailSentAt: null }))})\n  In this case, the actual sending of the emails is &#34;stubbed&#34; out, so no emails are actually sent.\n  test(&#39;sends newsletter to user&#39;, async t =&gt; { const user = { name: &#39;test&#39;, email: &#39; [email protected]&#39;, lastEmailSentAt: null } const emailStub = sinon.stub(email, &#39;send&#39;) await emailService.sendTo(user) t.is(emailStub.callCount, 1)})\n  One could be inclined to put all the logic inside a function and call it a day.\n It could work, but for how long? Or better: how do you effectively test it?\n    In the first UAT I think it&#39;s apparent that we need to provide the newsletter module at least a way to  retrieve the users.\n Let&#39;s try it with a  UserRepository, and assert that the Users collection has been queried for users that did not receive a newsletter yet:\n test(&#39;sends a newsletter to users that did not yet receive it&#39;, async t =&gt; { await db.get(&#39;users&#39;).insert({ name: &#39;test&#39;, email: &#39; [email protected]&#39;, lastEmailSentAt: null }) sinon.spy(userRepository, &#39;findNotYetReceivedNewsletter&#39;) await newsletter.run(userRepository) t.is(userRepository.findNotYetReceivedNewsletter.callCount, 1) // we still need a collaborator for sending the newsletter...})\n Using  .spy since I want the DB to be queried, and later assert that the function has been called.\n For the email, I don&#39;t want the real function to be called, hence using  .stub.\n I am passing in the collaborators in the tests, and use the real implementations in the application code.\n  async function run (userRepository, emailService) { const users = await userRepository.findNotYetReceivedNewsletter() for (const user of users) { await emailService.sendTo(user) }}\n  test(&#39;sends a newsletter to users that did not yet receive it&#39;, async t =&gt; { await db.get(&#39;users&#39;).insert({ name: &#39;test&#39;, email: &#39; [email protected]&#39;, lastEmailSentAt: null }) sinon.spy(userRepository, &#39;findNotYetReceivedNewsletter&#39;) sinon.stub(emailService, &#39;sendTo&#39;) await newsletter.run(userRepository, emailService) t.is(userRepository.findNotYetReceivedNewsletter.callCount, 1) t.is(emailService.sendTo.callCount, 1) // implement your assertions about arguments, like &#34;recipient&#34;, &#34;subject&#34;, &#34;content&#34; of the email etc.})\n    ├── index.js├── index.test.js├── lib│ ├── db.js│ ├── email-service.js│ ├── email-service.test.js│ ├── email.js│ ├── email.test.js│ ├── user-repository.js│ └── user-repository.test.js├── package-lock.json└── package.json\n The other software components are Unit tested, for further details check out  the project on GitHub\n Every collaborator has their own tests (except  lib/db.js since it&#39;s a simple wrapper around  monk that is already well tested).\n email.js is the wrapper around your API of choice to send emails and has a single exposed function  .send.", "posttime": "2020-06-10 06:30:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "原理,solid", "title": "使用Solid原理在Node.js中进行示例测试", "title_en": "Testing in Node.js by example using the SOLID principles", "transed": 1, "url": "https://cri.dev/posts/2020-05-20-Testing-in-Nodejs-by-example-using-the-SOLID-principles/", "via": "", "real_tags": ["原理", "solid"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005915, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亲爱的FreeBSD社区，FreeBSD项目采用了一种新的源自LLVM的行为准则。新的行为准则可在。\n2018年进行的第一次调查告诉我们：-94%的开发人员认为项目中的尊重沟通很重要；1%不同意-89%认为免费BSD应该欢迎所有背景的人；2%不同意-73%表示应该将有毒人员从项目中移除，无论他们的技术贡献是什么；-https://www.freebsd.org/internal/code-of-conduct.htmlBACKGROUNDActive FreeBSD开发人员被邀请完成两项与我们的指导准则相关的调查。第一次调查于2018年进行，第一次调查告诉我们：-94%的开发人员认为在项目中尊重沟通很重要；1%的人不同意-89%的人认为FreeBSD应该欢迎所有背景的人；9%的人不同意-35%的人不满意2018年通过的行为准则，34%的人持中立态度，30%的人感到满意。这些结果表明，对现行行为准则的不满程度足以值得调查。在回顾了其他开源行为准则之后，FreeBSD核心团队调查了采用LLVM派生或GO派生的行为准则。6月初进行了第二次调查，只有一个问题：FreeBSD应该采用哪种行为准则？-LLVM派生的行为准则：https://github.com/freebsd/core.10-public-docs/blob/master/CoC/llvm-based.md-GO派生的行为准则：https://github.com/freebsd/core.10-public-docs/blob/master/CoC/golang-based。.MD-保留当前的行为准则：https://web.archive.org/web/20200108075747/https://www.freebsd.org/internal/code-of-conduct.htmlRESULTS-4%的人赞成保留当前的行为准则-33%的人赞成从GO派生的行为准则-63%的人赞成从LLVM派生的行为准则。因此，核心团队遵循了大多数活跃的FreeBSD开发人员的偏好，采用了LLVM派生的行为准则。谢谢您感谢LLVM和GO社区，以及我们热情的成员，他们帮助支持了这一演变。--FreeBSD核心团队", "note_en": "Dear FreeBSD community,The FreeBSD Project has adopted a new LLVM-derived code of conduct. Thenew code of conduct can be found at\n https://www.freebsd.org/internal/code-of-conduct.htmlBACKGROUNDActive FreeBSD developers were invited to complete two surveys relatedto our Code of Conduct.The first survey, conducted in 2018, told us that: - 94% of developers believe respectful communication in the project is important; 1% disagreed - 89% believe FreeBSD should be welcoming to people of all backgrounds; 2% disagreed - 73% say toxic people should be removed from the Project regardless of their technical contribution; 9% disagreed - 35% were dissatisfied with the code of conduct adopted in 2018, 34% were neutral, and 30% were satisfied.These results indicated that there was sufficient dissatisfaction withthe current code of conduct to warrant investigation. After reviewingother open source codes of conduct, the FreeBSD Core Team investigatedadopting either an LLVM-derived or a Go-derived code of conduct.A second survey was held at the start of June and had only one question: Which code of conduct should FreeBSD adopt? - An LLVM-derived code of conduct:  https://github.com/freebsd/core.10-public-docs/blob/master/CoC/llvm-based.md - A Go-Derived code of conduct:  https://github.com/freebsd/core.10-public-docs/blob/master/CoC/golang-based.md - Retain the current code of conduct:  https://web.archive.org/web/20200108075747/https://www.freebsd.org/internal/code-of-conduct.htmlRESULTS - 4% favoured keeping the current code of conduct - 33% favoured the Go-derived code of conduct - 63% favoured the LLVM-derived code of conduct.Thus, the Core Team, following the preference of a majority of activeFreeBSD developers, adopted the LLVM-derived code of conduct.THANK YOUThank you to the LLVM and Go communities, and our impassioned memberswho helped champion this evolution.-- FreeBSD Core Team", "posttime": "2020-06-10 06:29:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "freebsd,code", "title": "新的FreeBSD行为准则", "title_en": "New FreeBSD Code of Conduct", "transed": 1, "url": "https://www.mail-archive.com/freebsd-announce@freebsd.org/msg00965.html", "via": "", "real_tags": ["freebsd", "code"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005914, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "公司计划在发布错误的音乐家形象后用人工智能取代编辑的计划适得其反。\n微软(Microsoft)用机器人取代人类记者的决定适得其反，此前这家科技公司的人工智能软件用一张错误的混血乐队Little Mix成员的照片展示了一个关于种族主义的新闻故事。\n在“卫报”披露计划解雇MSN.com的人类编辑，并用微软的人工智能代码取而代之一周后，该软件的早期推出导致了一篇关于歌手杰德·瑟沃尔(Jade Thirlwall)个人对种族主义的反思的故事，并配上了她的乐队成员利-安妮·平诺克(Leigh-Anne Pinock)的照片。\n瑟沃尔参加了最近在伦敦举行的黑人生命也是命(Black Lives Matter)抗议活动，她在周五批评MSN，说她厌倦了“无知”的媒体犯下这样的错误。她在Instagram上发帖称：“@MSN如果你打算从其他准确的媒体机构复制和粘贴文章，你可能会想要确保你使用的是群里正确的混合种族成员的图片。”\n她说：“这些狗屎总是发生在@leighannpInnock和我身上，这已经成为了一个流传的笑话。”“你不能从一个团体…的四个成员中区分出两个有色人种女人，这让我很生气。做得更好！“。\n据Thirlwall公司的消息人士称，Thirlwall不可能知道的是，这张图片是由微软的人工智能软件选择的，该软件已经负责编辑新闻网站的部分内容，该网站吸引了全球数亿读者。\n微软不进行原创报道，而是雇佣人类编辑来选择、编辑和重新调整新闻机构(包括《卫报》)的文章的用途。然后，文章被托管在微软的网站上，这家科技公司与原始出版商分享广告收入。上月底，微软决定在流感大流行期间解雇数百名记者，并用人工智能软件完全取而代之。\n当被问及微软为什么部署不能区分混血个体的软件，领先企业在部署该公司的人工智能软件时是否会渗透明显的种族主义偏见，以及该公司是否会重新考虑用机器人取代人工编辑的计划时，这家科技公司的一名发言人表示：“我们一意识到这个问题，就立即采取行动解决它，并更换了不正确的形象。”在被问及这一问题时，这家科技公司的一名发言人表示：“我们一意识到这个问题，就立即采取行动解决它，并更换了不正确的形象。”\n在这篇文章发表之前，MSN的工作人员被告知，“卫报”将刊登一篇负面文章，内容涉及人工智能软件中所谓的种族主义偏见，这款软件很快就会抢走他们的工作。\n由于无法阻止新的机器人编辑从《卫报》等外部新闻网站挑选故事，剩下的人类工作人员被告知保持警惕，如果机器人认为感兴趣并自动将其发布在MSN.com上，请删除这篇文章的一个版本。他们还被警告说，即使他们删除了它，机器人编辑也可能会否决他们的意见，并试图再次发布。\n在人工智能软件决定有关这起事件的报道会引起MSN读者的兴趣后，工作人员已经不得不删除批评MSN运行关于Little Mix With the error image的报道的报道。\n一名工作人员表示，微软对其人工智能产品的声誉损害深表担忧：“鉴于目前所有的反种族主义抗议活动，现在不是犯错的时候。”", "note_en": "Firm’s plan to replace editors with AI backfires after wrong image of musician is published\n    Microsoft’s decision to replace human journalists with robots has backfired, after the tech company’s artificial intelligence software illustrated a news story about racism with a photo of the wrong mixed-race member of the  band Little Mix.\n A week after the Guardian revealed plans to fire the human editors who run MSN.com and replace them with Microsoft’s artificial intelligence code, an early rollout of the software resulted in a story about the  singer  Jade Thirlwall’s  personal reflections on racism being illustrated with a picture of her fellow band member Leigh-Anne Pinnock.\n Thirlwall, who attended a recent Black Lives Matter protest in London, criticised MSN on Friday, saying she was sick of “ignorant” media making such mistakes. She posted on Instagram: “@MSN If you’re going to copy and paste articles from other accurate media outlets, you might want to make sure you’re using an image of the correct mixed race member of the group.”\n “This shit happens to @leighannepinnock and I ALL THE TIME that it’s become a running joke,” she said. “It offends me that you couldn’t differentiate the two women of colour out of four members of a group … DO BETTER!”\n What Thirlwall could not have known, according to sources at the company, is that the image was selected by Microsoft’s artificial intelligence software, which is already responsible for editing parts of the news site, which attracts hundreds of millions of readers worldwide.\n  Microsoft does not carry out original reporting but employs human editors to select, edit and repurpose articles from news outlets, including the Guardian. Articles are then hosted on Microsoft’s website and the tech company shares advertising revenue with the original publishers. At the end of last month, Microsoft decided to fire hundreds of journalists in the middle of a pandemic and fully replace them with the artificial intelligence software.\n Asked why Microsoft was deploying software that cannot tell mixed-race individuals apart, whether apparent racist bias could seep into deployments of the company’s artificial intelligence software by leading corporations, and whether the company would reconsider plans to replace the human editors with robots, a spokesman for the tech company said: “As soon as we became aware of this issue, we immediately took action to resolve it and have replaced the incorrect image.”\n In advance of the publication of this article, staff at MSN were told to expect a negative article in the Guardian about alleged racist bias in the artificial intelligence software that will soon take their jobs.\n  Because they are unable to stop the new robot editor selecting stories from external news sites such as the Guardian, the remaining human staff have been told to stay alert and delete a version of this article if the robot decides it is of interest and automatically publishes it on MSN.com. They have also been warned that even if they delete it, the robot editor may overrule them and attempt to publish it again.\n Staff have already had to delete coverage criticising MSN for running the story about Little Mix with the wrong image after the AI software decided stories about the incident would interest MSN readers.\n One staff member said Microsoft was deeply concerned about reputational damage to its AI product: “With all the anti-racism protests at the moment, now is not the time to be making mistakes.”", "posttime": "2020-06-10 06:29:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器人,微软,microsoft,编辑,robot", "title": "微软机器人编辑迷惑混血小混血歌手", "title_en": "Microsoft's robot editor confuses mixed-race Little Mix singers", "transed": 1, "url": "https://www.theguardian.com/technology/2020/jun/09/microsofts-robot-journalist-confused-by-mixed-race-little-mix-singers", "via": "", "real_tags": ["机器人", "微软", "microsoft", "编辑", "robot"]}, {"category": "", "categoryclass": "", "imagename": "3694f0f4436b36faddc48a26a0ef4778.jpg", "infoid": 1005913, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "荷兰一所大学的学者今天公布了关于英特尔处理器新漏洞的详细信息。\n这个安全漏洞被他们命名为串扰，它使在一个CPU内核上执行的攻击者控制的代码能够泄露运行在不同内核上的其他软件的敏感数据。\nVrije大学的系统和网络安全组织(VUSec)表示，串扰漏洞是另一种类型的MDS(微体系结构数据采样)攻击。\nMDS攻击的目标是处于临时状态的用户数据，因为它正在CPU及其许多数据缓存系统中进行处理。\n更具体地说，串扰会在数据被CPU的行填充缓冲区(LBF)处理时攻击数据，LBF是上述CPU缓存系统之一。\n根据VUSec团队的说法，LBF缓存实际上使用的是所有CPU内核共享的以前未记录在案的临时缓冲区。\n在今天发布的一段演示视频中，VUSec研究团队展示了他们如何利用串扰攻击，通过LBF缓存攻击这种未记录的暂存缓冲区，并泄露其他内核(下例中为Intel SGX密钥)上的应用程序处理的数据。\n研究小组表示，自2018年9月以来，在过去的21个月里，他们一直在与英特尔合作修补相声攻击。\nVUSec团队表示，修补这个漏洞花费了超过标准的90天，原因是问题的复杂性，以及他们最初没有彻底调查跨核泄漏的可能性。\n与此同时，英特尔已经对其CPU的硬件设计进行了重大改变，其最近的大部分产品都不容易受到这种攻击。\n对于所有较老的英特尔中央处理器系列，芯片制造商今天发布了微码(中央处理器固件)更新，以修补串扰漏洞--英特尔将其称为特殊寄存器缓冲区数据采样或SRBDS(CVE2020-0543，英特尔-SA-00320)。\n英特尔在一篇分析其6月份安全更新的博客文章中表示，与迄今为止报告的所有侧通道问题一样，英特尔不知道在实验室环境之外有任何真实的SRBDS漏洞利用。\n此页上列出了易受攻击的英特尔CPU列表(请查看表中的SRBDS列)。该列表包括嵌入式、移动、台式机和服务器产品的CPU系列。\nVUSec团队还发布了概念验证代码和关于相声攻击的技术论文和网站。英特尔在这里有自己的技术报告。", "note_en": "Academics from a university in the Netherlands have published details today about a new vulnerability in Intel processors.\n The security bug, which they named CrossTalk, enables attacker-controlled code executing on one CPU core to leak sensitive data from other software running on a different core.\n The Vrije University&#39;s Systems and Network Security Group (VUSec) says the CrossTalk vulnerability is another type of MDS (microarchitectural data sampling) attack.\n MDS attacks target user data while in a &#34;transient&#34; state, as it&#39;s being processed inside the CPU and its many data-caching systems.\n More specifically, CrossTalk attacks data while it&#39;s being processed by the CPU&#39;s Line Fill Buffer (LBF), one of these aforementioned CPU cache systems.\n   According to the VUSec team, the LBF cache actually works with a previously undocumented memory &#34;staging buffer&#34; that is shared by all CPU cores.\n  In a demo video published today, the VUSec research team showed how they employed a CrossTalk attack to attack this undocumented staging buffer via the LBF cache, and leak data processed by apps on other cores (an Intel SGX key, in the example below).\n    The research team said they&#39;ve been working with Intel on having the CrossTalk attack patched for the past 21 months, since September 2018.\n The VUSec team said that patching this bug took more than the standard 90 days because of the complexity of the issue and because they initially didn&#39;t thoroughly investigate the possibility of a cross-core leak.\n In the meantime, Intel has already made significant changes to the hardware design of its CPUs, and most of its recent products are not vulnerable to this attack.\n For all the older Intel CPU lines, the chipmaker has released today microcode (CPU firmware) updates to patch the CrossTalk vulnerability -- which Intel refers to as &#34;Special Register Buffer Data Sampling&#34; or SRBDS (CVE-2020-0543, Intel-SA-00320).\n &#34;As with all side-channel issues reported to date, Intel is not aware of any real-world exploits of SRBDS outside of a lab environment,&#34;  Intel said in a blog post analyzing its June security updates.\n A list of vulnerable Intel CPUs are listed  on this page (check the SRBDS column in the table). The list includes CPU lines for embedded, mobile, desktop, and server products.\n The VUSec team has also published  proof-of-concept code and a  technical paper and  website on the CrossTalk attack. Intel has its own technical write-up,  here.", "posttime": "2020-06-10 06:13:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "英特尔,攻击,attack", "title": "新的串扰攻击影响英特尔的移动、台式机和服务器CPU", "title_en": "New CrossTalk Attack Impacts Intel's Mobile, Desktop, and Server CPUs", "transed": 1, "url": "https://www.zdnet.com/article/new-crosstalk-attack-impacts-intels-mobile-desktop-and-server-cpus/", "via": "", "real_tags": ["英特尔", "攻击", "attack"]}, {"category": "", "categoryclass": "", "imagename": "e97676c00e8f0cc09f0f8140b493263a.jpeg", "infoid": 1005912, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周四，我在LinkedIn上发了一篇帖子。没有附加文章，没有促销，没有比赛，没有我的双胞胎女儿的可爱照片(那是一个不同的帖子)-只是LinkedIn上关于我与我正在工作的一个特定产品营销项目的恋情的常规、纯文本、快速和肮脏的帖子。\n但在我告诉你具体是怎么开始的之前，我想澄清一下：我远不是LinkedIn上的任何一位专家。我承认在Instagram上把自己放在了地狱里，但在Good‘ol Li上，我通常只是为了欢笑、灵感和联系而来。如果幸运的话，我可能会得4到5个大拇指。\n但上周四，情况发生了不同的变化。当我点击“贴子”的时候，…上的反应和评论就开始蜂拥而至。然后是留言。然后是更多消息…。还有更多。我总共收到了超过75条信息(而且还在不断增加)，其中大多数都要求向我请教，并要求某种形式的指导。神圣的。胡说八道。\n嘿，我将拥有我的狗屎：帖子确实建议如果你有兴趣了解更多关于产品营销的知识，我们可以联系一下。但我想，充其量我可能会有一两个前同事带着“他妈的Covid”溜进我的DMS。我被解雇了。我们去拿点喝的，快步走吧。“。我很乐意接受，我们会变得有点放肆，咯咯地笑一笑，也许我会帮一个朋友找到他们的路-或者至少他们的信心。\n但我却找不到认识的人。真的没人。给我发信息的每一个人都是一个新的、有趣的、饥饿的、兴奋的人，想要了解更多关于产品营销的知识：见鬼的是什么，我是如何进入的，如果我认为这会很适合他们，如果是的话，我建议他们也如何到达那里。\n伙计们，我是一个脑筋急转弯3翼2。我的主要类型是表演者，所以我甚至不会表现得像75个人向我寻求帮助，这不是世界上最大的自我打击。我的次要类型是帮手，所以我不仅对自己感到很满意，而且很想开始工作！是时候预订这些变焦并改变世界了！\n但是等等。操。还记得关于双胞胎婴儿的那部分吗？嗯。他们已经6个月大了。他们又笨又可爱，几乎所有的事情都依赖于我。\n呃，还记得关于科维德的那部分吗，还有整个，没有孩子的事？还记得关于我已经在做的产品营销项目的那部分吗，在我已经做过的产品营销工作中？\n嗯。我现在有几件事要做。所以我花了几天时间才弄清楚该怎么办。因为我觉得自己像个笨蛋，主动提供帮助，然后又取消了。但我也知道，如果我承诺指导75个人，告诉我的孩子、丈夫和全职工作去踢石头，我就是一个更大的傻瓜。\n一个我可以承诺的博客系列。是的，这意味着今晚的家庭游戏之夜要坐在外面，把自己锁在卧室里，白噪音机器发出刺耳的声音，希望没有婴儿的哭声或无意中听到的笑声会分散我的注意力。但我会这么做的，希望至少能帮助你们75人中的一些人，他们正在寻找征兆或推动力，或者有人告诉他们，他们的下一步应该是什么，或者不应该是什么。\n如果你是这75个人中的一个，或者你是我的LinkedIn页面上的新人，或者你是有机地找到了我，那么嗨。我是奥宾，我是一名产品营销员，她写出了令人信服的信息，促进了销售，定位了产品，并推出了解决方案。我愿意以任何我能做到的方式，以“可扩展的”方式分享我的知识和经验，帮助你找到、调整或继续你寻找职业幸福的旅程。\n要浏览我的博客系列的第1部分，“产品营销：你将拥有的最好的工作”，请单击此处。", "note_en": "Last Thursday, I made  a post on LinkedIn. No article attached, no promotion, no contest, no cute picture of my twin girls (that was  a different post) — just a regular, text only, quick and dirty post on LinkedIn about the love affair I was having with a particular product marketing project I was working on.\n   But before I tell you exactly  what began, I want to make it clear: I am far from any kind of LinkedIn expert. I admit to putting myself way the hell out there  on instagram, but on good ‘ol LI I’m usually just here for the laughs, the inspos, and the connects. I might score 4 or 5 thumbs if I’m lucky.\n But last Thursday, things played out differently. The second I clicked “post”, the reactions and comments started pouring in…And then the messages. And then more messages…and then more. In total I received over 75 messages (and counting) — the majority of them asking to pick my brain, and for some version of mentorship. Holy. Crap.\n  And hey, I’ll own my shit: the post  did suggest we connect if you’re interested in learning more about product marketing. But I figured at BEST I might get 1 or 2 former colleagues slide into my dms with a “Fuck Covid. I got laid off. Let’s grab drinks and Zoom about it.” I’d gladly entertain it, we’d get a little saucy, have a giggle, and maybe I’d help a friend find their path — or at least their confidence.\n But instead I got  nobody I knew. LITERALLY nobody. Every single person who messaged me was someone new, and interesting, and hungry, and excited to learn more about product marketing: What the hell it is, how I got into it, if I thought it would be a good fit for them, and if so, how they I suggest they get there too.\n You guys I’m an enneagram 3 wing 2. My primary type is THE PERFORMER, so I won’t even act like 75 people asking me for help wasn’t the biggest ego stroke in the WORLD. And my secondary type is THE HELPER, so not only was I feeling pretty pleased with myself, but STOKED to start getting to work! Time to book these zooms and change the world!\n But wait. FUCK. Remember that part about twin infants? Yeah. They’re 6 months. They’re  stupid cute, and KIND of depend on me for literally everything.\n  And uh, remember that part about Covid, and the whole, not having childcare thing? And remember that part about the product marketing project I was already working on, at the product marketing job I already have?\n Yeah. I’ve got a few things on my plate right now. So it took me a few days to figure out what the hell to do. Because I feel like a jackass, offering help, and then rescinding it. But I also know I’m an even bigger jackass if I commit to mentor 75 people and tell my kids, husband, and full-time job to go kick rocks.\n  A blog series I can commit to. Yes it means sitting out for tonight’s family game night, and locking myself in the bedroom with the white noise machine blaring, hoping no baby cry or overheard laughter will break my concentration. But I’m going to do it, in hopes of helping at least some of the 75 of you who are looking for a sign, or a push, or someone to tell them wtf their next step should or shouldn’t be.\n If you’re one of the 75, or you’re someone new coming across my LinkedIn page, or you found me organically, then hi. I’m Aubyn, and I’m a product marketer who totally gets her rocks off writing compelling messaging, enabling sales, positioning products, and launching solutions. I’d love to *scalably* share my knowledge and experience in any way I can to help you find, realign, or continue on in your journey to find career happiness.\n To scope part 1 of my blog series,  Product Marketing: The Best Job You’ll Ever Have,  click here.", "posttime": "2020-06-10 06:11:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "request", "title": "为什么我要对你“请教我”的要求说“不”", "title_en": "Why I’m Answering “No” to Your Request to “Pick My Brain”", "transed": 1, "url": "https://medium.com/@aubynbethcasady/why-im-answering-no-to-your-request-to-pick-my-brain-296621d1a3ab", "via": "", "real_tags": ["request"]}]