[{"category": "", "categoryclass": "", "imagename": "fbe8916fb31c0ad872fa98540acd7b6e.jpg", "infoid": 1002898, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "采用持续部署并不是所有的彩虹和小马，所以这个视频涵盖了3个常见的错误，提出了避免它们的建议，并讨论了我们如何…", "note_en": "Adopting continuous deployment isn't all rainbows and ponies, so this video covers 3 common mistakes, makes suggestions to avoid them, and talks about how we...", "posttime": "2020-05-20 07:43:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "部署,continuous,持续", "title": "持续部署的三大误区", "title_en": "Three Mistakes of Continuous Deployment", "transed": 1, "url": "https://www.youtube.com/watch?v=0vXgGe3dVWY", "via": "", "real_tags": ["部署", "持续"]}, {"category": "", "categoryclass": "", "imagename": "73478724e133fdd5fb273e0a3dc3ead1.png", "infoid": 1002897, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软今天将为Windows10发布一款新的类似Spotlight的启动器应用。新的PowerToys Run Launcher旨在取代和现代化现有的Win+R快捷方式，包括在Windows中快速搜索应用程序和文件，以及计算器等插件，以及查找正在运行的进程的功能。\n此早期版本将支持通常由内置Windows开始菜单搜索功能处理的基本搜索任务。但也有计划让它成为一个功能更强大的启动器，类似于MacOS上的Alfred，并且比苹果的Spotlight搜索功能更强大。\n当前的Win+R功能是基本的，Windows高级用户使用它来启动命令提示、regedit、Powershell实例，甚至是Windows中控制面板等区域的快捷方式。这个新的PowerToys Run Launcher将支持目前Windows中Run所支持的所有命令，但微软正在与一个开源社区合作，这使得它变得更加强大。\n微软一直在与WOX和WindowWalker的制造商合作，将这些项目整合到PowerToys Run中。基本功能今天就会推出，虽然是早期版本，但这里和那里都会有一些错误。\n启动程序的好处意味着我们很快就会得到插件，或者能够添加定制的网络搜索、片段等等。微软现有的Windows开始菜单处理来自网络的搜索结果，但它也会强制你进入必应搜索结果，并打开Edge浏览器进行任何网络查询。\n除了PowerToys Run，微软今天还发布了键盘管理器PowerToy。这是一个简单的键盘重新映射器，允许Windows10用户重新定义键盘上的按键。只要键盘管理器和PowerToys在后台运行，就会重新映射按键，并且您可以交换各个按键，甚至可以交换Windows快捷键。\n键盘管理器是PowerToys最新0.18版本的一部分，可从微软的GitHub发行版获得。\nPowerToys Run和键盘管理器是Microsoft正在开发的众多PowerToys中的一部分。微软去年最初带回了PowerToys，让任何人都可以为高级用户改进Windows10，第一套于9月份面世。PowerToys最早是在Windows95中推出的。这些应用程序是Windows工程师测试原型功能的快捷方式，微软很快将一些最好的应用程序打包成PowerToys捆绑包。", "note_en": "Microsoft is releasing a new Spotlight-like launcher app for Windows 10 today. Designed to replace and modernize the existing Win + R shortcut, the  new PowerToys Run launcher includes quick search for apps and files across Windows, plugins like a calculator, and the ability to find running processes.\n This early version will support basic search tasks that are typically handled by the built-in Windows Start menu search functionality. But there are plans to make this a more powerful launcher that’s similar to Alfred on macOS and more functional than Apple’s Spotlight search.\n The current Win + R functionality is basic and used by Windows power users to launch cmd prompts, regedit, powershell instances, and even shortcuts to areas in Windows like the Control Panel. This new PowerToys Run launcher will support all of the same commands that Run does currently in Windows, but Microsoft is collaborating with an open-source community that’s contributing to make it far more powerful.\n   Microsoft has been working with the makers of Wox and WindowWalker to incorporate these projects into PowerToys Run. The basics are arriving today, albeit in an early version that will have some bugs here and there.\n The benefits of a launcher mean we’ll soon get plugins or the ability to add custom web searches, snippets, and more. Microsoft’s existing Windows Start menu handles search results from the web, but it also forces you into Bing search results and opens the Edge browser for any web queries.\n   Alongside PowerToys Run, Microsoft is also releasing a Keyboard Manager PowerToy today. It’s a simple keyboard remapper that allows Windows 10 users to redefine keys on a keyboard. Keys will be remapped as long as the Keyboard Manager and PowerToys are running in the background, and you can swap individual keys and even Windows shortcuts.\n The Keyboard Manager is part of the latest 0.18 release of PowerToys,  available on Microsoft’s GitHub distro.\n PowerToys Run and Keyboard Manager are part of the many PowerToys that Microsoft is developing. Microsoft originally brought back PowerToys last year to allow anyone to improve Windows 10 for power users, and the  first set arrived in September. PowerToys were first introduced back in Windows 95. The apps were a quick way for Windows engineers to test prototype features, and Microsoft soon packaged some of the best ones into PowerToys bundles.", "posttime": "2020-05-20 07:29:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows,下载,microsoft,windows-10,run", "title": "适用于Windows 10的Microsoft新PowerToys Run Launcher现已可供下载", "title_en": "Microsoft's New PowerToys Run Launcher for Windows 10 is Now Available To Download", "transed": 1, "url": "https://www.theverge.com/2020/5/19/21262060/microsoft-windows-10-launcher-powertoy-spotlight-alfred-download-build", "via": "", "real_tags": ["windows", "下载", "microsoft", "run"]}, {"category": "", "categoryclass": "", "imagename": "918e56fdfb89943a5df6b7e6657ae2e7.png", "infoid": 1002896, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "登入", "note_en": "登入", "posttime": "2020-05-20 07:28:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,计算,computing,登入", "title": "ACM：2020年代的计算课程草案", "title_en": "ACM: Computing Curriculum Draft for 2020s", "transed": 1, "url": "https://drive.google.com/file/d/1LPbxATWYSQlFJEB0ejDlsj1P_tVH0TLm/view", "via": "", "real_tags": ["2020", "计算", "computing", "登入"]}, {"category": "", "categoryclass": "", "imagename": "69a51e96bbee397cdca12b30d094830e.jpeg", "infoid": 1002895, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "，为什么会有这么多的爱？你可以喜欢它，我也可以不喜欢它，就像任何其他YouTuber一样。\n因为你的观点忽略了一个事实，那就是LMG实际上是一家公司。他的YouTube频道可能在每个YouTube账户的大多数员工名单中名列前茅。因此，这不仅是一家公司，而不是YouTuber，它还是一家拥有清晰商业计划的娱乐公司。\n你可以整天讨厌它，但YouTube不再是业余狂欢节，就像谷歌不再是车库公司一样。他们都在进化，甚至YouTuber自己也是如此。\n如果你对顶级专家对特定主题的意见感兴趣：YouTube上可能也有一些频道。但由于受众减少，这些频道自然会变小。\n(我发这篇文章并不是因为我是Linus Shill，而是我最近才在大约6个月前发现了他的频道，他做了一项令人难以置信的工作，对于我个人来说，我真的与技术失去了联系，因为，你知道，我从小到大，专门从事不同的工作相关的东西等等。因此，所有人都称赞他建立了一个非常好的信息娱乐频道)", "note_en": ", why all the love? You can like it, I can dislike it, just like any other youtuber.\n because your opinion leaves out the fact, that LMG is in fact a company. His youtube channels are probably on the top list of most employees per youtube account. So not only is this a company, not a &#34;youtuber&#34;, it&#39;s an entertainment company with a clear business plan.\n You can hate it all day long, but youtube is no amateur fest anymore as much as google is no garage company any longer. They all have evolved, even the youtubers themselves.\n If you are interested in top tier expert opinions on specific topics: there too might be some channels on youtube out there. But naturally those channels will be smaller due to less audience.\n  (and i only post this not because i am a Linus shill, but i only recently discovered his channel about 6 months ago, and he does an incredible job, as for me personally, i really lost touch with technology in general due to, you know, growing up, specializing in different work related stuff and such. So all the cudos to him for establishing a really good infotainment channel)", "posttime": "2020-05-20 06:57:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "database,数据库,推出,launches,频道", "title": "iFixit推出全球最大的医疗设备维修数据库", "title_en": "iFixit launches world's largest medical equipment repair database", "transed": 1, "url": "https://old.reddit.com/r/DataHoarder/comments/gmrehh/hello_rdatahoarder_were_ifixit_and_we_just/", "via": "", "real_tags": ["database", "数据库", "推出", "launches", "频道"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002894, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为一个预览版，我们将尽最大努力不做突破性的改变，但在我们准备好发布之前，仍然有一些颠簸需要解决。您现在可以开始试用Reaction Native for Windows的0.62预览版了！\n针对MacOS的Reaction Native的类似升级正在进行中。敬请关注下一次更新！\n我们最近最大的公告之一是添加并完全支持用于MacOS的Reaction Native扩展！我们非常高兴能在Windows努力的同时为MacOS开发RESPECT Native Support。\n我们已经为Reaction Native for MacOS发布了一个官方的NPM包，并有一个回购可供公众关注和贡献--我们希望在未来能看到一些非常酷的Reaction Native应用程序，它们现在可以真正在任何地方运行。\n这有点意料之中，因为Reaction Native今天在Android上运行得很好，但仅仅在新的Surface Duo设备上运行是不够的。我们还通过发布两个重要的API：TwoPaneView和DeviceInfoModule，增加了对双屏设备及其状态识别的支持。\n要了解更多关于在Surface上使用Reaction Native进行开发的信息，请访问我们详细介绍该体验的最新博客文章。\n我们已经开始解决Windows社区模块的支持缺口-从我们的贡献开始！这包括WebView和Camera、Picker、AsyncStorage、NetInfo和DateTimePicker。\n除了最初的设置之外，我们还在研究一大堆我们知道在构建Reaction Native应用程序时非常棒且必不可少的内容。在我们的GitHub项目板上查看我们正在跟踪和计划下一步要解决的问题的完整列表。\n最后，除了亲自为这些社区模块做贡献外，我们还希望帮助引导健壮的测试基础设施，并增强这些模块消费者的可靠性。我们通过将配置项添加到Reaction-Native-Webview Repo开始了此过程。敬请关注更多内容！\nWebView模块为您设置基本的虚拟主机技术，该技术在您要瞄准的设备上原生可用。此模块已更新为支持Windows和MacOS。\n要在此短片中获取您自己版本的应用程序，请查看RssReader示例。\n相机模块是让您更轻松地自由访问本机API的又一大进步。\n就像在移动设备上一样，当你定义了CameraFeed模块，并且你正在运行应用程序的设备上连接了摄像头时，该组件将连接到正确的原生API，让你能够访问拍摄甜蜜照片所需的硬件。\nAsyncStorage可以说是构建Reaction Native应用程序时提供给您的最重要的模块之一，现在Windows和MacOS完全支持AsyncStorage。\n一个重要的网络API，用于连接和检查连接的运行状况。因为Reaction Native是一个基于JavaScript的框架，所以需要这样的API能够在所有平台上随时可用是非常有价值的--我们最近发布的这个模块同时支持Windows和MacOS。\nDateTimePicker社区控件是一个独特的组件，它在很多方面定义了您正在使用的平台的设计，现在已经更新为支持Windows。", "note_en": "As a preview release, we will try our best not to make breaking changes, but still have a few bumps to sort out before we&#39;re ready for release. You can now start trying out the  0.62-preview of React Native for Windows!\n A similar upgrade for  React Native for macOS is in progress. Stay tuned for the next update!\n     One of our biggest announcements recently is our addition and full support of the  React Native for macOS extension! We are super excited to be developing React Native support for macOS along side our Windows effort.\n We have an official  npm package out for React Native for macOS and a  repo available to the public to follow and contribute to - we hope to see some really cool React Native apps out there in the future that can now truly run everywhere.\n    This is a little bit to be expected, as React Native works great today with Android, but just running on the new Surface Duo device isn&#39;t enough. We&#39;ve also added support for awareness of the dual-screen device and it&#39;s status through shipping two important APIs:  TwoPaneView and  DeviceInfoModule.\n To learn more about developing on the Surface Duo with React Native,  go check out our latest blog post detailing the experience.\n  We&#39;ve begun addressing the Windows community module support gap - starting with contributions from us! This includes   WebView and   Camera,  Picker,  AsyncStorage,  NetInfo, and  DateTimePicker.\n On top of that initial set, we&#39;re also looking at a whole bunch more that we know are awesome and essential to have when building a React Native app. Check out the full list of what we&#39;re tracking and planning to tackle next on our  GitHub Project Board.\n Lastly, in addition to contributing to these community modules personally, we want to help bootstrap a robust test infrastructure and enhance reliability for consumers of these modules. We have started this process by adding CI to  react-native-webview repo. Stay tuned for more!\n   The WebView module sets you up with the barebones web hosting tech that&#39;s available nativly on the device you&#39;re targetting. This module has been updated to support Windows and macOS.\n To get your own version of the app in this short clip, check out the  RssReader sample.\n   The Camera module is another big step towards making it easier to give you unfettered access to native APIs.\n Just like on mobile, when you define a CameraFeed module, and the device you&#39;re running the app on has a camera attached, the component will hookup to the correct native APIs to give you access to the hardware needed to snap sweet pics.\n    Arguably one of the most important modules to have available to you when building a React Native app, AsyncStorage is now fully supported on Windows and macOS.\n  An important network API for hooking up to and checking the health of your connection. As React Native is a JavaScript-based framework the need for an API such as this to be readily available on all platforms is very valuable - our recent release for this module supports both Windows and macOS.\n   A unique component that in many ways defines the design of the platform you&#39;re using, the DateTimePicker community control has been updated to support Windows as well now.", "posttime": "2020-05-20 06:57:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,微软,os,native,模块", "title": "微软推出的针对Mac OS X的Reaction Native", "title_en": "React Native for Mac OS X by microsoft", "transed": 1, "url": "https://microsoft.github.io/react-native-windows/blog/2020/05/19/rn4mupdadates", "via": "", "real_tags": ["microsoft", "微软", "os", "native", "模块"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002893, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有一篇博客文章更详细地介绍了更大的图景，并介绍了完成这项工作所需的所有部件。它可以在这里获得：https://devblogs.microsoft.com/directx/directx-heart-linux。这封求职信的其余部分将集中在Linux内核位上。概述=这是Microsoft虚拟GPU(VGPU)驱动程序的初稿。该驱动程序将半虚拟化的GPU暴露给在Windows主机上的虚拟机中运行的用户模式应用程序。这可以在诸如WSL(Windows Subsystem For Linux)等环境中实现硬件加速，在该环境中，Linux虚拟机能够与Windows主机共享GPU。投影是通过将WDDM(Windows显示驱动程序模型)接口暴露为一组IOCTL来完成的。这允许移植针对Windows上的WDDM GPU抽象编写的API和用户模式驱动程序，以便在Linux环境中运行。这样可以将D3D12和DirectML API及其关联的用户模式驱动程序移植到Linux。这还使第三方API(如流行的NVIDIA Cuda计算API)能够在WSL环境中进行硬件加速。仅将GPU的渲染/计算方面投影到虚拟机，不显示任何显示功能。此外，目前还没有表示集成。因此，尽管D3D12API可以用来呈现屏幕外的图形，但是(目前)像素还没有从Linux环境流回Windows主机桌面的路径。此GPU堆栈有效地与原生Linux图形堆栈并行。驱动程序创建/dev/dxg设备，用户模式应用程序可以打开该设备并处理它们的ioctls。驱动程序的IOCTL接口在dxgkmthk.h(Dxgkrnl图形端口驱动程序ioctl定义)中定义。该接口与Windows上的D3DKMT接口匹配。Ioctls在ioctl.c中实现。当VM启动时，主机上的hyper-v会通过hyper-v驱动程序将虚拟GPU设备添加到VM。主机向VM提供几个VM总线通道：全局通道和分配给VM的每个虚拟GPU一个通道。驱动程序向Hyper-V驱动程序(Hv_Driver)注册VM总线通道的到达。dxg_probe_device识别vGPU通道并创建相应的对象(vGPU的dxg适配器和全局通道的dxggglobal)。驱动程序使用Hyper-V VM总线接口与主机通信。dxgvmbus.c实现通信接口。全局通道具有主机分配的8 GB IO空间。此空间由主机管理，用于为来宾提供对某些分配的直接CPU访问。视频内存是在主机上分配的，但现有_sysmem分配除外。Windows主机代表来宾为GPU分配内存。Linux客户可以通过将GPU虚拟地址映射到分配，然后从提交给GPU命令缓冲区内引用那些GPU虚拟地址来访问存储器。对于需要CPU访问的分配，主机将分配映射到来宾系统中为此目的保留的8 GB IO空间中的某个位置。Windows主机使用嵌套的CPU页表来确保此来宾IO空间始终映射到正确的分配位置，因为它可能在其生命周期内在专用GPU内存(例如vRAM、固件保留DDR)和共享系统内存(常规DDR)之间迁移。Linux来宾将用户模式CPU虚拟地址映射到分配IO空间范围，以供用户模式API和驱动程序直接访问。LX_DXLOCK2 ioctl的实施=我们非常感谢您对LX_DXLOCK2 ioctl的实施提供反馈。此ioctl用于获取分配的CPU地址，该地址驻留在主机的视频/系统内存中。其工作方式：1.驱动程序向主机发送锁定消息2.主机在VM IO空间中分配空间并将其映射到分配内存3.主机返回IO空间中用于映射分配的地址4.驱动程序(在dxg_map_iSpace中)使用vm_mmap分配用户模式虚拟地址范围，并使用io_remap_ofn_range将其映射到IO空间)5.将VA返回给应用程序内部对象=。-dxg适配器-表示虚拟GPU-dxg进程-跟踪每个进程状态(所创建对象的句柄表，对象列表等)-dxgdevice-其他对象(上下文、分页队列、分配、GPU同步对象)的容器-dxgcontext-表示用于分组调度的GPU执行线程。-dxghwqueue-表示GPU执行硬件调度的线程-dxgallocation-表示GPU可访问的分配-dxgsyncobject-表示GPU同步对象-dxgresource-dxgalloction对象的集合-dxgsharedresource、dxgsharedsyncobj-共享对象的帮助器对象", "note_en": "There is a blog post that goes into more detail about the bigger picture, and walks through all the required pieces to make this work. It is available here:  https://devblogs.microsoft.com/directx/directx-heart-linux . The rest of this cover letter will focus on the Linux Kernel bits.  Overview ========  This is the first draft of the Microsoft Virtual GPU (vGPU) driver. The driver exposes a paravirtualized GPU to user mode applications running in a virtual machine on a Windows host. This enables hardware acceleration in environment such as WSL (Windows Subsystem for Linux) where the Linux virtual machine is able to share the GPU with the Windows host.  The projection is accomplished by exposing the WDDM (Windows Display Driver Model) interface as a set of IOCTL. This allows APIs and user mode driver written against the WDDM GPU abstraction on Windows to be ported to run within a Linux environment. This enables the port of the D3D12 and DirectML APIs as well as their associated user mode driver to Linux. This also enables third party APIs, such as the popular NVIDIA Cuda compute API, to be hardware accelerated within a WSL environment.  Only the rendering/compute aspect of the GPU are projected to the virtual machine, no display functionality is exposed. Further, at this time there are no presentation integration. So although the D3D12 API can be use to render graphics offscreen, there is no path (yet) for pixel to flow from the Linux environment back onto the Windows host desktop. This GPU stack is effectively side-by-side with the native Linux graphics stack.  The driver creates the /dev/dxg device, which can be opened by user mode application and handles their ioctls. The IOCTL interface to the driver is defined in dxgkmthk.h (Dxgkrnl Graphics Port Driver ioctl definitions). The interface matches the D3DKMT interface on Windows. Ioctls are implemented in ioctl.c.  When a VM starts, hyper-v on the host adds virtual GPU devices to the VM via the hyper-v driver. The host offers several VM bus channels to the VM: the global channel and one channel per virtual GPU, assigned to the VM.  The driver registers with the hyper-v driver (hv_driver) for the arrival of VM bus channels. dxg_probe_device recognizes the vGPU channels and creates the corresponding objects (dxgadapter for vGPUs and dxgglobal for the global channel).  The driver uses the hyper-V VM bus interface to communicate with the host. dxgvmbus.c implements the communication interface.  The global channel has 8GB of IO space assigned by the host. This space is managed by the host and used to give the guest direct CPU access to some allocations. Video memory is allocated on the host except in the case of existing_sysmem allocations. The Windows host allocates memory for the GPU on behalf of the guest. The Linux guest can access that memory by mapping GPU virtual address to allocations and then referencing those GPU virtual address from within GPU command buffers submitted to the GPU. For allocations which require CPU access, the allocation is mapped by the host into a location in the 8GB of IO space reserved in the guest for that purpose. The Windows host uses the nested CPU page table to ensure that this guest IO space always map to the correct location for the allocation as it may migrate between dedicated GPU memory (e.g. VRAM, firmware reserved DDR) and shared system memory (regular DDR) over its lifetime. The Linux guest maps a user mode CPU virtual address to an allocation IO space range for direct access by user mode APIs and drivers.     Implementation of LX_DXLOCK2 ioctl ==================================  We would appreciate your feedback on the implementation of the LX_DXLOCK2 ioctl.  This ioctl is used to get a CPU address to an allocation, which is resident in video/system memory on the host. The way it works:  1. The driver sends the Lock message to the host  2. The host allocates space in the VM IO space and maps it to the allocation memory  3. The host returns the address in IO space for the mapped allocation  4. The driver (in dxg_map_iospace) allocates a user mode virtual address range using vm_mmap and maps it to the IO space using io_remap_ofn_range)  5. The VA is returned to the application     Internal objects ================  The following objects are created by the driver (defined in dxgkrnl.h):  - dxgadapter - represents a virtual GPU  - dxgprocess - tracks per process state (handle table of created  objects, list of objects, etc.)  - dxgdevice - a container for other objects (contexts, paging queues,  allocations, GPU synchronization objects)  - dxgcontext - represents thread of GPU execution for packet  scheduling.  - dxghwqueue - represents thread of GPU execution of hardware scheduling  - dxgallocation - represents a GPU accessible allocation  - dxgsyncobject - represents a GPU synchronization object  - dxgresource - collection of dxgalloction objects  - dxgsharedresource, dxgsharedsyncobj - helper objects to share objects  between different dxgdevice objects, which can belong to different processes     Object handles ==============  All GPU objects, created by the driver, are accessible by a handle (d3dkmt_handle). Each process has its own handle table, which is implemented in hmgr.c. For each API visible object, created by the driver, there is an object, created on the host. For example, the is a dxgprocess object on the host for each dxgprocess object in the VM, etc. The object handles have the same value in the host and the VM, which is done to avoid translation from the guest handles to the host handles.     Signaling CPU events by the host ================================  The WDDM interface provides a way to signal CPU event objects when execution of a context reached certain point. The way it is implemented:  - application sends an event_fd via ioctl to the driver  - eventfd_ctx_get is used to get a pointer to the file object  (eventfd_ctx)  - the pointer to sent the host via a VM bus message  - when GPU execution reaches a certain point, the host sends a message  to the VM with the event pointer  - signal_guest_event() handles the messages and eventually  eventfd_signal() is called.   Sasha Levin (4):  gpu: dxgkrnl: core code  gpu: dxgkrnl: hook up dxgkrnl  Drivers: hv: vmbus: hook up dxgkrnl  gpu: dxgkrnl: create a MAINTAINERS entry   MAINTAINERS | 7 +  drivers/gpu/Makefile | 2 +-  drivers/gpu/dxgkrnl/Kconfig | 10 +  drivers/gpu/dxgkrnl/Makefile | 12 +  drivers/gpu/dxgkrnl/d3dkmthk.h | 1635 +++++++++  drivers/gpu/dxgkrnl/dxgadapter.c | 1399 ++++++++  drivers/gpu/dxgkrnl/dxgkrnl.h | 913 ++++++  drivers/gpu/dxgkrnl/dxgmodule.c | 692 ++++  drivers/gpu/dxgkrnl/dxgprocess.c | 355 ++  drivers/gpu/dxgkrnl/dxgvmbus.c | 2955 +++++++++++++++++  drivers/gpu/dxgkrnl/dxgvmbus.h | 859 +++++  drivers/gpu/dxgkrnl/hmgr.c | 593 ++++  drivers/gpu/dxgkrnl/hmgr.h | 107 +  drivers/gpu/dxgkrnl/ioctl.c | 5269 ++++++++++++++++++++++++++++++  drivers/gpu/dxgkrnl/misc.c | 280 ++  drivers/gpu/dxgkrnl/misc.h | 288 ++  drivers/video/Kconfig | 2 +  include/linux/hyperv.h | 16 +  18 files changed, 15393 insertions(+), 1 deletion(-)  create mode 100644 drivers/gpu/dxgkrnl/Kconfig  create mode 100644 drivers/gpu/dxgkrnl/Makefile  create mode 100644 drivers/gpu/dxgkrnl/d3dkmthk.h  create mode 100644 drivers/gpu/dxgkrnl/dxgadapter.c  create mode 100644 drivers/gpu/dxgkrnl/dxgkrnl.h  create mode 100644 drivers/gpu/dxgkrnl/dxgmodule.c  create mode 100644 drivers/gpu/dxgkrnl/dxgprocess.c  create mode 100644 drivers/gpu/dxgkrnl/dxgvmbus.c  create mode 100644 drivers/gpu/dxgkrnl/dxgvmbus.h  create mode 100644 drivers/gpu/dxgkrnl/hmgr.c  create mode 100644 drivers/gpu/dxgkrnl/hmgr.h  create mode 100644 drivers/gpu/dxgkrnl/ioctl.c  create mode 100644 drivers/gpu/dxgkrnl/misc.c  create mode 100644 drivers/gpu/dxgkrnl/misc.h  --  2.25.1", "posttime": "2020-05-20 06:42:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,lkml,directx,gpu", "title": "LKML：Linux上的DirectX", "title_en": "LKML: DirectX on Linux", "transed": 1, "url": "https://lkml.org/lkml/2020/5/19/742", "via": "", "real_tags": ["linux", "lkml", "directx", "gpu"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002891, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "LWN订户已向您提供以下仅限订阅的内容。数以千计的用户依赖LWN获取来自Linux和自由软件社区的最好消息。如果您喜欢这篇文章，请考虑接受右边的试用报价。感谢您访问LWN.net！\n免费试用LWN 1个月：无需付款或信用卡。现在激活您的试用订阅，看看为什么成千上万的读者订阅LWN.net。\nAWK是一种文本处理语言，已有40多年的历史。它有一个POSIX标准", "note_en": "The following subscription-only content has been made available to you by an LWN subscriber. Thousands of subscribers depend on LWN for the best news from the Linux and free software communities. If you enjoy this article, please consider accepting the trial offer on the right. Thank youfor visiting LWN.net!\n Try LWN for free for 1 month: no payment or credit card required.  Activate your trial subscription now and see why thousands of readers subscribe to LWN.net.\n AWK is a text-processing language with a history spanning more than 40years. It has a  POSIXstandard", "posttime": "2020-05-20 06:41:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "awk,state,lwn", "title": "AWK的现状", "title_en": "The State of the AWK", "transed": 1, "url": "https://lwn.net/SubscriberLink/820829/5bf9bf8bb9d6f2bf/", "via": "", "real_tags": ["awk", "state", "lwn"]}, {"category": "", "categoryclass": "", "imagename": "ca137f8b1df814fb050b2cd4982d640e.png", "infoid": 1002890, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "输出预览被更改为为自动完成的输入生成预览，而不是为实际输入生成预览。\n现在，在预览期间按&lt；Enter&gt；将计算整个字符串，包括自动完成的部分。按&lt；ESCAPE&gt；可取消该行为。\n[182aaf5622]-DOC：通过修复和使语法更加一致来增强指南(克里斯·霍兰德)#33152。\n[12391c7a20]-fs：调用js(Anna Henningsen)#33274前清理Dir.read()uv_fs_t数据。\n[69061dc73e]-Repl：用实际列表替换硬编码核心模块列表(鲁本·布里奇沃特)#33282。\n[b93a723fe6]-test：Async_Hooks+Promise+Worker交互的回归测试(安娜·亨宁森)#33347。\n[804982c1b6]-工具：添加eslint规则以仅通过调试日志(鲁本桥水)#32161。\n-BEGIN pgp签名消息-哈希：SHA256b9c9b96ecfbf47403b25a7e5779b290e7434ee3e93f8f1a15faa6c7f9a84f953 node-v14.3.0-aix-ppc64.tar.gzfd6a44303646f28b7e7577de687c2681cb565bef534e84deef44202e7919d7f3 node-v14.3.0-darwin-x64.tar.gz2361c2cd5781e80c81fa51c699f6f86b09f82bf08ea44dcdab5dcba94968e16a node-v14.3.0-darwin-x64.tar.xzec98a4fe5d34af134f1466246a302a8a2355d03710a68f452a9b1b8fb76bef68 node-v14.3.0-headers.tar.gz5608b6add7817a12a962646ac4f762d2ce7764ddf4a2fb8cb6367c174e17594f node-v14.3.0-headers.tar.xzb6541c22d25880cf0ec03a41838d763e50a7632761b9e7c49bd1809944eba3dd node-v14.3.0-linux-arm64.tar.gz53bb110ea135ae3c819f535373ce1b779e86c7aa49a9b93fc5f26969a72365d2 node-v14.3.0-linux-arm64.tar.xz75dd096aee0d124437f7c7ab700655628cfe6ad2ba3de5a20c47d7ea0de738a0节点-。v14.3.0-linux-armv7l.tar.gzcd749752538352e27e4ead4fd102fd1786302b1d1e794f67f7a39e8ba23e5fe0 node-v14.3.0-linux-armv7l.tar.xz9edd33f363c08e7edc50f147116c379bf030b38fb42a1fba4350d3f23cf280c9 node-v14.3.0-linux-ppc64le.tar.gz17853af5af55c03def97224d90dc2bd86c81d8afef1c51e48910212224b329bf node-v14.3.0-linux-ppc64le.tar.xzdd159dad0cb29722a6f2b3e03880ed887590ca038d806874a4cfce3f8aa85f6b node-v14.3.0-linux-s390x.tar.gz01ad8fc06ce8266a847c2a4fb5ccfc43dcd2a6fe68b8d494e2409182bf063dd7 node-v14.3.0-linux-s390x.tar.xzea08acdf403d13ab67303d503eab080a5285c005c75c0710551d928f3cc74057 node-v14.3.0-linux-x64.tar.gz17236db7b9447080b58c2e50937982c386fe8a60e644b8d7f23e546068a8acba node-v14.3.0-linux-x64.tar.xzbcb0574454a1646cce32425b927dd0b032c7e8a8c089d1ce1db9b44546c3aa6f节点-。v14.3.0.pkgf968f49835d74a8b897828edf012d0abb45d4fec5dbe98679cadb854cd343bbc node-v14.3.0.tar.gzf1a1ea2c3a252b3c9bab2449edf6ad6da7e9fa4d39d497662b15f57ec14f1a77 node-v14.3.0.tar.xz710643457e52ce1563be85cdf0d87e841b9c99313be04c6d4a8b5d388109801e node-v14.3.0-win-x64.7z07bebc231dd8d773ab41cdcfbcb8b48e2336fbee20deb961b4300b9ba86afa04 node-v14.3.0-win-x64.zip4359fe49f3622375fe8841a46205b107aef61b1a5b8710b8d7c0e7c83f2aefa7 node-v14.3.0-win-x86.7z90f780fa7f8031a3ad8017237bbf1d831918dc86e6fa8efd9bf6ebc4e1d4ab71 node-v14.3.0-win-x86.zip37e52b6d223c1330092ce1877f8e9b85ad37be6fe3d5953be1fa5c0dd6e9a881 node-v14.3.0-x64.msi4b57315eafae9f42d6e55b94569803b14285f32d19f32778d0753f8e4455e8f5 node-v14.3.0-x86.msi296e3ebdd356c4fbd2b4a832c504e510ecdb20ac041005ed491e5373e96fc907 win-x64/node.exe918d96c8515093304c2b252c995e2eaaed813a436e15ae502cc66e360b29473f win-x64/node.lib9b158c46e6ea4a25475d52b0d701ac12d9c87c442b2158076d9e7e3723482c24 WIN-x64。/node_pdb.7zc5b8eb2ba641e60fc057574f6befb67085e3c5573822cbe27fd421f36e33c7f1 win-x64/node_pdb.zipe9d4316f291c6bc2ab6aa855a3d28d10fd1bb6919659a2e951c380ad1f6dc3b1 win-x86/node.exe9e4df96c5b9ca3af6e94fe768aa0c0005d8a58ffb7aa76aed917174994095abd win-x86/node.lib5a5ba0a64f0cfb231037744c0ac341b421c7854286467fed1d646f6f427e9575 win-x86/node_pdb.7zfd06d80caa782a2999c224b43b639c8c7b0630c8ee7201022bac652d7cbc8d95 Win-x86/NODE_pdb.zip-BEGIN pgp SIGNATURE-iQIzBAEBCAAdFiEEueL1mBqm4M0oFg2f8TmTp1WZZTwFAl7ET8gACgkQ8TmTp1WZZTygyA//TSfFpgTH9jlmQGXmfejHNrXWy6IAYhZqxWxaY18bMtFHUwGWY+T1WCSu+Rjm8ZFSxgaNN8wgOv7wF5I1Goy9WnnDbik1M75xqcAwPmE0zRJDTNmmTQRrx1boHljNZyAlCK6US8n9sqdLvj5XEKYIBWRJic+0u1GN+H0tl9bXwA4XxyQqtrkMTi4f/8Ue9/RnYWJr1orPTWB+709BfzSENE3oqp/MZKAcjojfye7mOzjHOtNPhaAo7uCtGIt9PfNlW0wWEmPizxQCp+l6lCDOpFo/yH3Hmydi1PNcVeKrST3uMcPKgYlL7lJzwky8Q/xCFaZc605SUoxriKwnLBEh1JAqz2KlhaZCvUCrPHXy9kqmNQdvhcFZ0/HP7aBMIHf0Iho2/0CzhoRFWswW/7tzXRszu/ZUFxXUUcmmS52tq3YXhtMngANs9W6szCh7X4Hc8z4l9AiWucpvOrBczVA/hstNE6u+xxNgAnosC0qlu7Kzo19KrRO+Msz2II207CvyYHm36nyGyvSsHgFAJO+rst/Hx0aA6IgeMJWGZq8gwZhM0Bvxquu16b/L6JNstWMJWmztjP6ZPqUiAkEdiXu2+Jkp0bSgzKr5paCLLMeeW3mXusr5TLbUdJiEa/Q96wSNJAxm/5sK+mE7rJfSS1nrnCzv7I7R77x9T+pNEZ0ZizM==VnGm-END pgp签名", "note_en": "The output preview is changed to generate previews for autocompleted inputinstead of the actual input.\n  Pressing  &lt;enter&gt; during a preview is now going to evaluate the whole stringincluding the autocompleted part. Pressing  &lt;escape&gt; cancels that behavior.\n      [  182aaf5622] -  doc: enhance guides by fixing and making grammar more consistent (Chris Holland)  #33152\n                     [  12391c7a20] -  fs: clean up Dir.read() uv_fs_t data before calling into JS (Anna Henningsen)  #33274\n                     [  69061dc73e] -  repl: replace hard coded core module list with actual list (Ruben Bridgewater)  #33282\n                          [  b93a723fe6] -  test: regression tests for async_hooks + Promise + Worker interaction (Anna Henningsen)  #33347\n                [  804982c1b6] -  tools: add eslint rule to only pass through &#39;test&#39; to debuglog (Ruben Bridgewater)  #32161\n   -----BEGIN PGP SIGNED MESSAGE-----Hash: SHA256b9c9b96ecfbf47403b25a7e5779b290e7434ee3e93f8f1a15faa6c7f9a84f953 node-v14.3.0-aix-ppc64.tar.gzfd6a44303646f28b7e7577de687c2681cb565bef534e84deef44202e7919d7f3 node-v14.3.0-darwin-x64.tar.gz2361c2cd5781e80c81fa51c699f6f86b09f82bf08ea44dcdab5dcba94968e16a node-v14.3.0-darwin-x64.tar.xzec98a4fe5d34af134f1466246a302a8a2355d03710a68f452a9b1b8fb76bef68 node-v14.3.0-headers.tar.gz5608b6add7817a12a962646ac4f762d2ce7764ddf4a2fb8cb6367c174e17594f node-v14.3.0-headers.tar.xzb6541c22d25880cf0ec03a41838d763e50a7632761b9e7c49bd1809944eba3dd node-v14.3.0-linux-arm64.tar.gz53bb110ea135ae3c819f535373ce1b779e86c7aa49a9b93fc5f26969a72365d2 node-v14.3.0-linux-arm64.tar.xz75dd096aee0d124437f7c7ab700655628cfe6ad2ba3de5a20c47d7ea0de738a0 node-v14.3.0-linux-armv7l.tar.gzcd749752538352e27e4ead4fd102fd1786302b1d1e794f67f7a39e8ba23e5fe0 node-v14.3.0-linux-armv7l.tar.xz9edd33f363c08e7edc50f147116c379bf030b38fb42a1fba4350d3f23cf280c9 node-v14.3.0-linux-ppc64le.tar.gz17853af5af55c03def97224d90dc2bd86c81d8afef1c51e48910212224b329bf node-v14.3.0-linux-ppc64le.tar.xzdd159dad0cb29722a6f2b3e03880ed887590ca038d806874a4cfce3f8aa85f6b node-v14.3.0-linux-s390x.tar.gz01ad8fc06ce8266a847c2a4fb5ccfc43dcd2a6fe68b8d494e2409182bf063dd7 node-v14.3.0-linux-s390x.tar.xzea08acdf403d13ab67303d503eab080a5285c005c75c0710551d928f3cc74057 node-v14.3.0-linux-x64.tar.gz17236db7b9447080b58c2e50937982c386fe8a60e644b8d7f23e546068a8acba node-v14.3.0-linux-x64.tar.xzbcb0574454a1646cce32425b927dd0b032c7e8a8c089d1ce1db9b44546c3aa6f node-v14.3.0.pkgf968f49835d74a8b897828edf012d0abb45d4fec5dbe98679cadb854cd343bbc node-v14.3.0.tar.gzf1a1ea2c3a252b3c9bab2449edf6ad6da7e9fa4d39d497662b15f57ec14f1a77 node-v14.3.0.tar.xz710643457e52ce1563be85cdf0d87e841b9c99313be04c6d4a8b5d388109801e node-v14.3.0-win-x64.7z07bebc231dd8d773ab41cdcfbcb8b48e2336fbee20deb961b4300b9ba86afa04 node-v14.3.0-win-x64.zip4359fe49f3622375fe8841a46205b107aef61b1a5b8710b8d7c0e7c83f2aefa7 node-v14.3.0-win-x86.7z90f780fa7f8031a3ad8017237bbf1d831918dc86e6fa8efd9bf6ebc4e1d4ab71 node-v14.3.0-win-x86.zip37e52b6d223c1330092ce1877f8e9b85ad37be6fe3d5953be1fa5c0dd6e9a881 node-v14.3.0-x64.msi4b57315eafae9f42d6e55b94569803b14285f32d19f32778d0753f8e4455e8f5 node-v14.3.0-x86.msi296e3ebdd356c4fbd2b4a832c504e510ecdb20ac041005ed491e5373e96fc907 win-x64/node.exe918d96c8515093304c2b252c995e2eaaed813a436e15ae502cc66e360b29473f win-x64/node.lib9b158c46e6ea4a25475d52b0d701ac12d9c87c442b2158076d9e7e3723482c24 win-x64/node_pdb.7zc5b8eb2ba641e60fc057574f6befb67085e3c5573822cbe27fd421f36e33c7f1 win-x64/node_pdb.zipe9d4316f291c6bc2ab6aa855a3d28d10fd1bb6919659a2e951c380ad1f6dc3b1 win-x86/node.exe9e4df96c5b9ca3af6e94fe768aa0c0005d8a58ffb7aa76aed917174994095abd win-x86/node.lib5a5ba0a64f0cfb231037744c0ac341b421c7854286467fed1d646f6f427e9575 win-x86/node_pdb.7zfd06d80caa782a2999c224b43b639c8c7b0630c8ee7201022bac652d7cbc8d95 win-x86/node_pdb.zip-----BEGIN PGP SIGNATURE-----iQIzBAEBCAAdFiEEueL1mBqm4M0oFg2f8TmTp1WZZTwFAl7ET8gACgkQ8TmTp1WZZTygyA//TSfFpgTH9jlmQGXmfejHNrXWy6IAYhZqxWxaY18bMtFHUwGWY+T1WCSu+Rjm8ZFSxgaNN8wgOv7wF5I1Goy9WnnDbik1M75xqcAwPmE0zRJDTNmmTQRrx1boHljNZyAlCK6US8n9sqdLvj5XEKYIBWRJic+0u1GN+H0tl9bXwA4XxyQqtrkMTi4f/8Ue9/RnYWJr1orPTWB+709BfzSENE3oqp/MZKAcjojfye7mOzjHOtNPhaAo7uCtGIt9PfNlW0wWEmPizxQCp+l6lCDOpFo/yH3Hmydi1PNcVeKrST3uMcPKgYlL7lJzwky8Q/xCFaZc605SUoxriKwnLBEh1JAqz2KlhaZCvUCrPHXy9kqmNQdvhcFZ0/HP7aBMIHf0Iho2/0CzhoRFWswW/7tzXRszu/ZUFxXUUcmmS52tq3YXhtMngANs9W6szCh7X4Hc8z4l9AiWucpvOrBczVA/hstNE6u+xxNgAnosC0qlu7Kzo19KrRO+Msz2II207CvyYHm36nyGyvSsHgFAJO+rst/Hx0aA6IgeMJWGZq8gwZhM0Bvxquu16b/L6JNstWMJWmztjP6ZPqUiAkEdiXu2+Jkp0bSgzKr5paCLLMeeW3mXusr5TLbUdJiEa/Q96wSNJAxm/5sK+mE7rJfSS1nrnCzv7I7R77x9T+pNEZ0ZizM==VnGm-----END PGP SIGNATURE-----", "posttime": "2020-05-20 06:40:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "js,node", "title": "Node.js-v14.3.0", "title_en": "Node.js – v14.3.0", "transed": 1, "url": "https://nodejs.org/en/blog/release/v14.3.0/", "via": "", "real_tags": ["js", "node"]}, {"category": "", "categoryclass": "", "imagename": "06c892df530df9e627410aa314a96b5a.jpg", "infoid": 1002889, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司的一份声明称，廉价航空公司表示，在数据泄露事件中，2,200名客户的信用卡详细信息也被获取，但护照记录没有被获取。\n易捷航空没有透露安全事件是何时发生的，也没有说明黑客是如何进入其系统的，但该公司表示，它将事件提交给了英国的数据保护机构信息专员办公室(Information Commission‘s Office)。根据欧洲数据保护规则，公司有72小时的时间向监管机构通报安全事件。\n和航空业的其他公司一样，这家航空公司也受到了冠状病毒大流行的沉重打击，迫使全球大量人口呆在家里，商务旅行和度假也被搁置。在大流行之前，EasyJet在2019年运送了超过2800万名乘客。\n该公司是首批向英国政府请求救助以防止金融崩溃的公司之一。\nICO去年表示，在一次数据泄露暴露了50万客户的预订细节后，它打算对英国航空公司(British Airways)处以创纪录的1.83亿英磅(合2.3亿美元)的罚款。黑客在其网站上安装了Skiming恶意软件后，已经盗走了数千个信用卡号码。", "note_en": "The budget airline said 2,200 customers also had their credit card details accessed in the data breach, but passport records were not accessed, a company statement said.\n EasyJet did not say when the security incident happened or how the hackers accessed its systems, but the company said it referred the incident to the Information Commissioner’s Office, the U.K.’s data protection agency. Companies are given 72 hours to inform regulators of a security incident under European data protection rules.\n  The airline, like the rest of the aviation industry, has been hit hard by the coronavirus pandemic, which forced vast swathes of the global population to stay at home, and put business travel and vacations on hold. Prior to the pandemic, EasyJet carried more than 28 million passengers in 2019.\n The company was one of the first to ask the U.K. government  for a bailout to prevent financial collapse.\n The ICO said last year that it intended to fine British Airways a record £183 million ($230m) after  a data breach exposed the booking details of 500,000 customers. Hackers had siphoned off thousands of credit card numbers after installing skimming malware on its website.", "posttime": "2020-05-20 06:25:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "航空,records", "title": "易捷航空称900万条旅行记录因数据泄露而被窃取", "title_en": "EasyJet says 9M travel records taken in data breach", "transed": 1, "url": "https://techcrunch.com/2020/05/19/easyjet-travel-credit-cards-breach/", "via": "", "real_tags": ["航空", "records"]}, {"category": "", "categoryclass": "", "imagename": "bde50ea925325e9b2ec566f52393f25d.png", "infoid": 1002887, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "保证您的在线安全是Chrome DNA的一部分。除了提供强大的默认保护，我们的目标是为您提供可访问的、直观的和有用的控件，以便您可以做出适合您的选择。所以，今天我们已经开始在桌面上推出新的工具和重新设计Chrome的隐私和安全设置，来帮助你控制你的网络安全。\n通过这次重新设计，我们通过简化的语言和视觉效果使控件更易于查找和理解：\n它更容易管理这些cookie。您可以选择您访问的网站是否以及如何使用Cookie，还可以选择以常规模式或隐名模式阻止第三方Cookie，以及阻止某些或所有网站上的所有Cookie。\n在“站点设置”中，我们将控件重新组织为两个不同的部分，以便更容易找到最敏感的网站权限：访问您的位置、摄像头或麦克风以及通知。一个新的部分还突出显示了最新的权限活动。\n在Chrome设置的顶部，你会看到“你和谷歌”(以前是“人”)，在那里你可以找到同步控制。这些控件让你负责与谷歌共享哪些数据存储在你的谷歌账户中，并在你的所有设备上都可以使用。\n因为很多人会定期删除他们的浏览历史记录，所以我们将“清除浏览数据”控件移到了“隐私与安全”部分的顶部。", "note_en": "Keeping you safe and secure online is part of Chrome’s DNA. Along with providing strong default protections, we aim to give you accessible, intuitive, and useful controls so you can make choices that are right for you. So, today we’ve started rolling out new tools and a redesign of Chrome’s privacy and security settings on desktop, to help you control your safety on the web.\n  With this redesign, we’ve made the controls even easier to find and understand, with simplified language and visuals:\n  It’s easier to manage  cookies. You can choose if and how cookies are used by websites you visit, with options to block third-party cookies in regular or Incognito mode, and to block all cookies on some or all websites.\n In Site Settings, we’ve reorganized the controls into two distinct sections to make it easier to find the most sensitive website permissions: access to your location, camera or microphone, and notifications. A new section also highlights the most recent permissions activity.\n At the top of Chrome settings, you’ll see “You and Google” (previously “People”), where you can find  sync controls. These controls put you in charge of what data is shared with Google to store in your Google Account  and made available across all your devices.\n Because many people regularly delete their browsing history, we’ve moved that control, “Clear browsing data”, to the top of the Privacy &amp; Security section.", "posttime": "2020-05-20 06:24:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chrome,privacy,访问", "title": "Chrome中更直观的隐私和安全控制", "title_en": "More intuitive privacy and security controls in Chrome", "transed": 1, "url": "https://www.blog.google/products/chrome/more-intuitive-privacy-and-security-controls-chrome/", "via": "", "real_tags": ["chrome", "privacy", "访问"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002886, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2002年5月，由代数符号压缩到一个小空间中的意义的数量，是另一种情况，有助于我们习惯于在他们的帮助下进行推理。-查尔斯·巴贝奇，引用于艾弗森的图灵奖演讲。\n在讨论LL1邮寄名单上的“书呆子的复仇”提出的问题时，保罗·普雷斯科德写了一些让我印象深刻的事情。从表面上看，宣称这是一种编程语言似乎是一件相当糟糕的事情。据我所知，简洁性=力量。如果是这样，那么代换，我们得到了，这似乎不是你想要做的权衡(如果这是一种权衡)。这并不是说Python的目标不是作为一种有效的编程语言。简洁等于力量吗？在我看来，这似乎是一个重要的问题，对于任何对语言设计感兴趣的人来说，这可能是最重要的问题，而且直接面对这个问题会很有用。我还不确定答案是不是简单的“是”，但这似乎是一个很好的假设。假设我的假设是简洁就是力量，或者足够接近，除非在病理例子中，你可以将它们视为相同的。在我看来，简洁性是编程语言的目的。如果直接用机器语言告诉计算机该做什么，计算机也会同样高兴。我认为我们不厌其烦地开发高级语言的主要原因是为了获得优势，这样我们就可以用10行高级语言来说(更重要的是，想一想)需要1000行机器语言的东西。换句话说，高级语言的主要目的是使源代码更小。如果较小的源代码是高级语言的目标，那么衡量一种编程语言的能力的标准就是它使您的程序变得多小。相反，一种不能使你的程序变小的语言在编程语言应该做的事情上做得不好，就像一把切得不好的刀，或者打印出来的东西难以辨认。然而，指标在什么意义上很小呢？代码大小的最常见度量是代码行。但我认为这个指标是最常见的，因为它是最容易测量的。我认为没有人真的相信这是对节目长度的真正考验。不同的语言对一行应该放多少有不同的约定；在C语言中，很多行除了一两个分隔符之外什么都没有。另一个简单的测试是程序中的字符数，但这也不是很好；一些语言(例如Perl)只是使用比其他语言更短的标识符。我认为衡量程序大小的更好的方法是元素的数量，如果你画了一棵代表源代码的树，那么元素就是一个不同的节点。变量或函数的名称是元素；整数或浮点数是元素；文字文本段是元素；模式元素或格式指令是元素；新块是元素。存在边界情况(是两个元件还是一个元件？)。但我认为它们中的大多数对于每种语言都是相同的，所以它们不会对比较产生太大影响。这个度量需要充实，在特定语言的情况下可能需要解释，但我认为它试图度量正确的东西，即程序包含的部分的数量。我认为你在这个练习中画的这棵树是你为了构思这个程序而必须在脑海里做的东西，所以它的大小与你写或读它所要做的工作量成比例。设计这种度量可以让我们比较不同的语言，但这并不是，至少对我来说，这不是它的主要价值。简洁性测试的主要价值是指导语言的设计，语言之间最有用的比较是同一语言的两个潜在变体之间的比较，简洁性测试的主要价值是指导语言的设计，语言之间最有用的比较是同一语言的两个潜在变体之间的比较。我能用这种语言做些什么来缩短程序？如果程序的概念负载与其复杂性成正比，并且给定的程序员可以容忍固定的概念负载，那么这就等同于问，我能做些什么才能使程序员完成最多的工作？对我来说，这似乎等同于问，我如何才能设计出一种好的语言？(顺便说一句，没有什么比设计语言更明显地表明，所有语言都是等价的这一老生常谈是错误的。当你在设计一种新的语言时，你会不断地比较两种语言--如果我做了x的语言，和如果我没有做x的语言--来决定哪种语言更好。如果这真的是一个没有意义的问题，你不妨抛硬币决定。)。追求简洁似乎是发现新想法的好方法。如果你能做一些事情，让许多不同的程序变得更短，这可能不是巧合：你可能已经发现了一个有用的新抽象。您甚至可以编写一个程序，通过搜索源代码c++来提供帮助。", "note_en": "May 2002   &#34;The quantity of meaning compressed into a small space by algebraic signs, is another circumstance that facilitates the reasonings we are accustomed to carry on by their aid.&#34;  - Charles Babbage, quoted in Iverson&#39;s Turing Award Lecture\n  In the discussion about issues raised by  Revenge of the Nerds on the LL1 mailing list, Paul Prescod wrotesomething that stuck in my mind. On the face of it, this seems a rather damning thing to claim about a programming language. As far as I can tell, succinctness = power.If so, then substituting, we get and this doesn&#39;t seem a tradeoff (if it  is a tradeoff)that you&#39;d want to make. It&#39;s not far from saying that Python&#39;s goal is not to be effective as a programming language.  Does succinctness = power? This seems to me an important question,maybe the most important question for anyone interested inlanguage design, and one that it would be useful to confrontdirectly. I don&#39;t feel sure yet that the answer is a simple yes, but it seems a good hypothesis to begin with.   Hypothesis  My hypothesis is that succinctness is power, or is close enoughthat except in pathological examples you can treat them as identical.  It seems to me that succinctness is what programming languages are  for. Computers would be just as happy to be told what todo directly in machine language. I think that the mainreason we take the trouble to develop high-level languages is toget leverage, so that we can say (and more importantly, think)in 10 lines of a high-level language what would require 1000lines of machine language. In other words,the main point of high-level languages is to make source code smaller.  If smaller source code is the purpose of high-level languages, andthe power of something is how well it achieves its purpose, thenthe measure of the power of a programming language is how small itmakes your programs.  Conversely, a language that doesn&#39;t make your programs small isdoing a bad job of what programming languages are supposed todo, like a knife that doesn&#39;t cut well, or printing that&#39;s illegible.   Metrics  Small in what sense though? The most common measure of code size islines of code. But I think that this metric is the most common becauseit is the easiest to measure. I don&#39;t think anyone really believesit is the true test of the length of a program. Differentlanguages have different conventions for how much you should puton a line; in C a lot of lines have nothing on them but a delimiter or two.  Another easy test is the number of characters in a program, but this is not very good either; some languages (Perl,for example) justuse shorter identifiers than others.  I think a better measure of the size of a program would be the number of elements, where an element is anything thatwould be a distinct node if you drew a tree representing the source code. The name ofa variable or function is an element; an integer or a floating-point number is an element;a segment of literal text is an element;an element of a pattern, or a format directive, is an element;a new block is an element. There are borderline cases(is -5 two elements or one?) but I think most of them are thesame for every language, so they don&#39;t affect comparisons much.  This metric needs fleshing out, andit could require interpretation in the case of specific languages,but I think it tries to measure the right thing, which is the number of parts a program has. I think the tree you&#39;d draw in thisexercise is what you have to make in your head in order toconceive of the program, and so its size is proportionate to theamount of work you have to do to write or read it.   Design  This kind of metric would allow us to compare different languages,but that is not, at least for me, its main value. The main valueof the succinctness test is as a guide in  designing languages.The most useful comparison between languages is between twopotential variants of the same language. What can I do in thelanguage to make programs shorter?  If the conceptual load ofa program is proportionate to its complexity, and a given programmercan tolerate a fixed conceptual load, then this is the same as asking,what can I do to enable programmers to get the most done? Andthat seems to me identical to asking, how can I design a goodlanguage?  (Incidentally, nothing makes it more patently obvious that the oldchestnut &#34;all languages are equivalent&#34; is false than designinglanguages. When you are designing a new language, you&#39;re  constantlycomparing two languages-- the language if I did x, and if I didn&#39;t-- todecide which is better. If this were really a meaningless question,you might as well flip a coin.)  Aiming for succinctness seems a good way to find new ideas.If you can do something that makes manydifferent programs shorter, it is probably not a coincidence: you have probably discovered a useful new abstraction. You might even beable to write a program to help by searchingsource code for repeated patterns. Among other languages, thosewith a reputation for succinctness would be the ones to look to fornew ideas: Forth, Joy, Icon.   Comparison  The first person to write about these issues, as far as I know, wasFred Brooks in the  Mythical Man Month. He wrotethat programmers seemed to generate about the sameamount of code per day regardless of the language.When I first read this in my early twenties,it was a big surprise to me and seemed to have huge implications.It meant that (a) the only way to get software written faster was touse a more succinct language, and (b) someone who took thetrouble to do this could leave competitors who didn&#39;t in the dust.  Brooks&#39; hypothesis, if it&#39;s true, seems to be at the very heart of hacking.In the years since, I&#39;ve paid close attention to any evidence I couldget on the question, from formal studies to anecdotes about individualprojects. I have seen nothing to contradict him.  I have not yet seen evidence that seemed to me conclusive,and I don&#39;t expect to. Studieslike Lutz Prechelt&#39;s comparison of programming languages, whilegenerating the kind of results I expected, tend to use problems thatare too short to be meaningful tests. A better test of a language iswhat happens in programs that take a month to write. And the onlyreal test, if you believe as I do that the main purpose of a languageis to be good to think in (rather than just to tell a computer what todo once you&#39;ve thought of it) is what new things you can write in it.So any language comparison whereyou have to meet a predefined spec is testing slightly the wrongthing.  The true test of a language is how well you can discoverand solve new problems, nothow well you can use it to solve a problem someone else hasalready formulated. These two are quite different criteria.In art, mediums like embroidery and mosaic work well if youknow beforehand what you want to make, but are absolutely lousy ifyou don&#39;t. When you want to discover the image as you make it--as you have to do with anything as complex as an image of aperson, for example-- you need to use a more fluid medium like pencil orink wash or oil paint. And indeed, the way tapestries and mosaics are made inpractice is to make a painting first, then copy it. (The word&#34;cartoon&#34; was originally used to describe a painting intended forthis purpose).  What this means is that we are never likely to have accurate comparisonsof the relative power of programming languages. We&#39;ll have precisecomparisons, but not accurate ones. In particular, explicit studiesfor the purpose of comparing languages,because they will probably use small problems, and will necessarily usepredefined problems, will tend to underestimate the power of themore powerful languages.  Reports from the field, though they will necessarily be less precise than&#34;scientific&#34; studies, are likely to be more meaningful. For example, Ulf Wiger of Ericsson did a  study that concluded that Erlang was 4-10xmore succinct than C++, and proportionately faster to develop software in: Comparisons between Ericsson-internal development projects indicatesimilar line/hour productivity, including all phases of software development,rather independently of which language (Erlang, PLEX, C, C++, or Java)was used. What differentiates the different languages then becomes sourcecode volume.\n The study also deals explictly with a point that was only implicit in Brooks&#39; book (since he measured lines of debugged code):programs written in more powerful languages tend to have fewer bugs.That becomes an end in itself, possibly more important than programmerproductivity, in applications like network switches.   The Taste Test  Ultimately, I think you have to go with your gut. What does it feellike to program in the language? I think the way to find (or design)the best language is to become hypersensitive to how well a languagelets you think, then choose/design the language that feels best. Ifsome language feature is awkward or restricting, don&#39;t worry, you&#39;llknow about it.  Such hypersensitivity will come at a cost. You&#39;ll find that you can&#39;t stand programming in clumsy languages. I find it unbearablyrestrictive to program in languages without macros, just as someone usedto dynamic typing finds it unbearably restrictive to have to go back toprogramming in a language where you have to declare the type ofevery variable, and can&#39;t make a list of objects of different types.  I&#39;m not the only one. I know many Lisp hackers that this has happenedto. In fact, the most accurate measure of the relative power of programminglanguages might be the percentage of people who know the languagewho will take any job where they get to use that language, regardlessof the application domain.   Restrictiveness  I think most hackers know what it means for a language to feel restrictive.What&#39;s happening when you feel that? I think it&#39;s the same feelingyou get when the street you want to take is blocked off, and you have totake a long detour to get where you wanted to go. There is somethingyou want to say, and the language won&#39;t let you.  What&#39;s really going on here, I think, is that a restrictive language isone that isn&#39;t succinct enough. The problem is not simply that you can&#39;tsay what you planned to. It&#39;s that the detour the language makes youtake is  longer. Try this thought experiment. Suppose there weresome program you wanted to write, and the language wouldn&#39;t let youexpress it the way you planned to, but instead forced you to write theprogram in some other way that was  shorter. For me at least,that wouldn&#39;t feel very restrictive. It would be like the street youwanted to take being blocked off, and the policeman at the intersection directing you to a shortcut instead of a detour. Great!  I think most (ninety percent?) of the feeling of restrictiveness comes from being forced to make the programyou write in the language longer than one you have in your head.Restrictiveness is mostly lack of succinctness.So when a language feels restrictive, what that (mostly) means is that it isn&#39;tsuccinct enough, and when a language isn&#39;t succinct, it willfeel restrictive.   Readability  The quote I began with mentions two other qualities, regularity andreadability. I&#39;m not sure what regularity is, or what advantage, if any, code that is regular and readable has over code that is merelyreadable. But I think I know what is meant by readability, and I thinkit is also related to succinctness.  We have to be careful here to distinguish between the readability ofan individual line of code and the readability of the whole program.It&#39;s the second that matters. I agree that a line of Basic is likely to bemore readable than a line of Lisp. But a program written in Basic isis going to have more lines than the same program written inLisp (especially once you cross over into Greenspunland). Thetotal effort of reading the Basic program will surely be greater. I&#39;m not as sure that readability is directly proportionate to succinctnessas I am that power is, but certainly succinctness is a factor (in the mathematical sense; see equation above) in readability.So it may not even be meaningful to say that the goal of a language isreadability, not succinctness; it could be like saying the goal was readability,not readability.  What readability-per-line does mean, to the user encountering the languagefor the first time, is that source code will  look unthreatening. Soreadability-per-linecould be a good marketing decision, even if it is a bad designdecision. It&#39;s isomorphic to the very successful technique of lettingpeople pay in installments: instead of frightening them with a highupfront price, you tell them the low monthly payment. Installment plansare a net lose for the buyer, though, as mere readability-per-line probablyis for the programmer.The buyer is going to make a  lot of those low, low payments; and the programmer is going to read a  lot of those individually readable lines.  This tradeoff predates programming languages. If you&#39;re used to readingnovels and newspaper articles, your first experience of reading a mathpaper can be dismaying. It could take half an hour to read a single page. And yet, I am pretty sure that the notation is not the problem, even thoughit may feel like it is. The math paper is hard to read because the ideas are hard. If you expressed the same ideas in prose(as mathematicians had to do before they evolved succinct notations),they wouldn&#39;t be any easier to read, because the paper would grow to thesize of a book.   To What Extent?  A number of people have rejectedthe idea that succinctness = power. I think it would be more useful, insteadof simply arguing that they are the same or aren&#39;t, to ask:to what  extent does succinctness = power?Because clearly succinctness isa large part of what higher-level languages are for. If it is not all they&#39;refor, then what else are they for, and how important, relatively, are theseother functions?  I&#39;m not proposing this just to make the debate more civilized. I reallywant to know the answer. When, if ever, is a language too succinct for its own good?  The hypothesis I began with was that, except in pathological examples,I thought succinctness could be considered identical with power. WhatI meant was that in any language anyone would design, theywould be identical, but that if someone wanted to design a languageexplicitly to disprove this hyphothesis, they could probably do it. I&#39;mnot even sure of that, actually.   Languages, not Programs  We should be clear that we are talking about the succinctnessof languages, not of individual programs.It certainly is possible for individual programs to be written too densely.  I wrote about this in  On Lisp. A complex macromay have to save many times its own length to be justified. If writingsome hairy macro could save you ten lines of code every time you use it,and the macro is itself ten lines of code, then you get a net saving inlines if you use it more than once. But that could still be a bad move,because macro definitions are harder to read than ordinary code. You might have to use the macro ten or twenty times before it yielded a netimprovement in readability.  I&#39;m sure every language has such tradeoffs (though I suspect the stakesget higher as the language gets more powerful). Every programmer musthave seen code that some clever person has made marginally shorterby using dubious programming tricks.  So there is no argument about that-- at least, not from me. Individualprograms can certainly be too succinct for their own good. The questionis, can a language be? Can a language compel programmers to writecode that&#39;s short (in elements) at the expense of overall readability?  One reason it&#39;s hard to imagine a language being too succinct is that ifthere were some excessively compact way to phrase something, there wouldprobably also be a longer way. For example, if you felt Lisp programs usinga lot of macros or higher-order functions were too dense, you could, if youpreferred, write code that was isomorphic to Pascal. If youdon&#39;t want to express factorial in Arc as a call to a higher-order function  (rec zero 1 * 1-)you can also write out a recursive definition:  (rfn fact (x) (if (zero x) 1 (* x (fact (1- x)))))Though I can&#39;t off the top of my head think of any examples, I am interestedin the question of whether a language could be too succinct. Are there languages that force you to write code in a way that is crabbed and incomprehensible?If anyone has examples, I would be very interested to see them.  (Reminder: What I&#39;m looking for are programs that are very dense accordingto the metric of &#34;elements&#34; sketched above, not merely programs that areshort because delimiters can be omitted and everything has a one-character name.)", "posttime": "2020-05-20 06:23:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "力量,succinctness,语言", "title": "简洁就是力量", "title_en": "Succinctness Is Power", "transed": 1, "url": "http://www.paulgraham.com/power.html", "via": "", "real_tags": ["力量", "语言"]}, {"category": "", "categoryclass": "", "imagename": "bac67ca9d770518dc14d2ba43392ccfe.jpg", "infoid": 1002885, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据报道，亚马逊(Amazon)正在与上周申请破产保护的负债累累的零售商JCPenney进行谈判。亚马逊股价上涨。\n据服装业贸易出版物“女装日报”(Women‘s Wear Daily)报道，亚马逊在JCPenney总部所在的得克萨斯州普莱诺有一个团队。报导援引一位未具名消息人士的话称，两家公司正在进行对话。\n收购JCPenney可能会提振这家在线零售商蓬勃发展的服装业务。亚马逊也有可能有兴趣收购JCPenney计划出售的一些商店，并将其用作分销网点。\n亚马逊在回应置评请求时回答说，它对猜测不予置评。\n将这些时事通讯发送到您的收件箱&&了解有关我们的产品和服务的更多信息。隐私政策和使用条款(&W)。\nJCPenney周五根据破产法第11章申请破产重组，理由是冠状病毒大流行是一个核心原因。这家零售商多年来一直在苦苦挣扎，计划今年关闭近200家门店，明年再关闭50家门店。\n自从冠状病毒来袭以来，亚马逊一直在迅速扩张。为了满足激增的需求，亚马逊额外雇佣了大约10万名工人，然后又增加了7.5万名工人。\n亚马逊过去曾采取过大胆举措，比如收购了全食超市(Whole Foods Market)，并在电动汽车方面进行了大量投资。\n请在Twitter上关注Brian Deagon，邮箱为@IBD_BDeagon，了解更多关于科技股、分析和金融市场的信息。", "note_en": "Amazon ( AMZN) is reportedly in talks with  JCPenney ( JCP), the debt-laden retailer that filed for bankruptcy protection last week. Amazon stock moved up.\n    X  According to apparel industry trade publication  Women&#39;s Wear Daily, Amazon has a team in Plano, Texas, where JCPenney is headquartered. The report cited an unnamed source saying there is a dialogue between the two companies.\n The acquisition of JCPenney could potentially bolster the online retailer&#39;s burgeoning apparel business. It&#39;s also possible Amazon could be interested in acquiring some of the stores that JCPenney plans to sell and use them as distribution outlets.\n Amazon, in a response to a request for comment, replied that it does not comment on &#34;speculation.&#34;\n Get these newsletters delivered to your inbox &amp; more info about our products &amp; services.  Privacy Policy &amp;  Terms of Use\n  JCPenney filed for Chapter 11 bankruptcy reorganization Friday, citing the coronavirus pandemic as a core reason. The retailer has been struggling for years and plans to close nearly 200 stores this year and an additional 50 stores next year.\n Amazon has been rapidly expanding since the coronavirus struck. In order to fulfill spiking demand, Amazon hired  100,000 additional workers and then added  another 75,000 workers.\n Amazon has made bold moves in times past, such as its acquisition of Whole Foods Market and its large investments in electric vehicles.\n  Please follow Brian Deagon on Twitter at  @IBD_BDeagon  for more on tech stocks, analysis and financial markets.", "posttime": "2020-05-20 06:09:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,talks,jcpenney", "title": "亚马逊称正在洽谈收购破产的JC Penney", "title_en": "Amazon Said To Be In Talks To Buy Bankrupt JC Penney", "transed": 1, "url": "https://www.investors.com/news/technology/amazon-stock-up-jcpenney-acquisition-report/", "via": "", "real_tags": ["亚马逊", "amazon", "talks", "jcpenney"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002884, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由Craig S.Mullins撰写，大型机继续擅长传统任务，例如高速事务处理和运行大型批处理工作负载。大型机还可以轻松处理大量数据(数TB)，例如分析处理和机器学习所需的数据。事实上，大型机支持b", "note_en": "By Craig S. Mullins Mainframes continue to excel at traditional tasks such as high-speed transaction processing and running large batch workloads. Mainframes also can easily handle large amounts of data—multiple terabytes—such as is needed for analytical processing and machine learning. Indeed, the mainframe supports b", "posttime": "2020-05-20 06:08:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "现代化,modern,大型机", "title": "大型机是一个现代化的平台", "title_en": "The Mainframe Is a Modern Platform", "transed": 1, "url": "https://www.enterprisesystemsmedia.com/post/the-mainframe-is-a-modern-platform", "via": "", "real_tags": ["现代化", "modern", "大型机"]}, {"category": "", "categoryclass": "", "imagename": "be18dde51807fe29c5a19614120770da.png", "infoid": 1002883, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以下是一些关于自动时间跟踪的小贴士，特别是对于ADHD患者：如何获得即时反馈，以便采取行动，而不是内疚。\ntl；dr：Qbserve当我使用MacOS时，现在的RescueTime+Custom New URL Tab(Chrome扩展)指向它的报告，这样我就可以立即获得关于我的工作效率(激励我继续前进)或我的懈怠程度(激励我开始工作)的反馈。另外，我使用Intent，用于网页浏览。\n我再怎么强调“立即”这个词也不为过。延迟的报告(一周后、一天后或每当我检查时)确实提供了一些现实检查和对要更改的内容的洞察力(通常只是第一次)，但对实际实施这些更改没有什么用处。(如果有关系的话，我有多动症。对一些人来说，洞察力可能就足够了。)。\n那么时间是什么呢？如果没人问我，我知道是什么。如果我想向问我的人解释，我不知道。-河马的奥古斯丁。\n我所知道的是我记不住时间。我飘忽而出，进入梦想和想法的内心世界。我需要某种“假肢”来维持我的日常功能，甚至可以让我保持在正常的轨道上。举个简单的例子：从15岁左右开始，我总是戴手表(不，口袋里的智能手机是不够的)。如果我没有它，我会感到困惑。\n那工作呢？自由职业很棒，给了我我想要的自由和灵活性。然而，它的代价是缺乏外部结构，以启动工作并使其保持在正轨上。有时需要检查单个(与之相关！)。LINK，和2h都不见了(在兔子洞潜水后)。\n我的手表(Fitbit，激励我多走多睡；足够一周充电一次)，\n所有东西的闹钟(我需要在晚上开会吗？我设了一个闹钟)。\n让我和大家分享一下是什么帮助我进行自我间谍，我的意思是，时间跟踪。我需要两样东西：\n我怎么强调后者都不为过。如果我在一周后，甚至一天后得到一个总结，它会让我感到内疚(这是我擅长的！)，但它不会有任何帮助。我会继续责备自己，继续偷懒/犯罪。\n我需要的是一位始终守望的神，它也能提供即时的反馈。(“在电子游戏方面没有ADHD。”--我们力求得到快速、客观、可行的反馈！)。\n更重要的是，任务栏中的始终监视立方体显示了我的工作效率得分(占6%的那个)：\n当我看到它很低的时候，我就有动力开始工作，它有很高的继续工作的动力(作为参考，6%是很低的；但我当天没有使用这台笔记本电脑工作)。\n然而，在2019年12月，我带来了一台新的笔记本电脑，这一次是Windows。令我惊讶的是，设置开发环境非常容易(Anaconda、Node和VSCode的工作方式几乎相同)。另一件事开始成为挑战：既然我不能使用Qbserve，而且功能强大的显卡除了深度学习之外还有其他很好的用途，如何提高工作效率？我安装了RescueTime。\n它跟踪得相当好，但忽略了一个核心功能-实时反馈。也就是说，我知道我可以在Wish上看到报告，但我希望经常得到反馈。它不能以我有意识地检查它为条件。\n我寻找扩展，以便在任务栏上看到它，但无济于事。然而，然后它就断了。我使用了一些扩展来用新的选项卡来激励自己：死亡率新选项卡(在“额外的”中有更多)或一个不那么病态的选项卡：动量。为什么不直接将新选项卡设置为RescueTime呢？\n现在，每次我打开一个新选项卡(我一直都这样做)，就会得到一个现实检查。我或多或少知道我是如何拖延某一天的，所以我不需要它的摘要。不过，时间的总结是无价的。注意：默认视图位于https://www.rescuetime.com/dashboard.。\n如果你认为我低估了政府破坏我的力量，那你就低估了我自我破坏的能力。但是，如果您更喜欢开源(更注重隐私)的替代方案，可以使用ActivityWatch，它可以与相同的URL选项卡重定向一起使用，此http://localhost:5600/#/timeline。\n界面稍微不那么精致(不幸的是，我在打开它和获取图表之间遇到了延迟)，但跟踪功能可以正常工作。因为它是我喜欢的Vue，有一天我可能会根据我的需要修改它。\n最近，我在所有机器上都使用了一个插件：Intent，这是我从一个HN线程中学到的。(我在Qbserve/Rescue Time之上使用了它，而不是代替它！)。它只适用于选项卡，但因为它是我分心的主要来源(“再看一段视频”、“再看一条评论”等)，所以它很重要。\n最好的时光是在高中的时候，写一篇数学论文，休息一下玩Timeshock游戏(一块插板，没有故事情节)。我们都知道没有休息是不好的：\n问题是，当我漂移时，不是清爽的15分钟，而是一段2小时的兔子洞之旅，不仅消耗了我的时间，还消耗了我的注意力。但目前的大多数软件都没有解决这个问题。\n午夜过后，我使用社交媒体，但这并没有阻止我，而是在第二天削减了全球限制。\n当一个应用程序在没有任何警告的情况下把我踢出去时，会有一个令人讨厌的惊喜。它是如此令人不快(特别是当我正在写一条长长的评论的时候)，它可能会提示我卸载它。\n限制太严格了。有时我知道某一天我需要更多的社交媒体。\n我看到了倒计时(所以我知道是结束回复，还是开始写新的有意义)，\n然而，它将YouTube的“正常使用”与例如用于创建深度学习研讨会(查找最近论文的视频摘要)区分开来。\n我使用Toggl对按小时计酬(少数人)的项目进行时间跟踪。我试着把它用在其他项目上，有时它会让我更容易保持在正轨上。然而，我经常忘了打开它。\n有几个插件(例如ColdTurkish)是“太核”的。在没有事先警告的情况下，(在Facebook或Hacker News上)在写回复的过程中被停下来，让我感到不安。更糟糕的是，当我把它用在我的工作中时，在数据科学或量子游戏中。\n我对Pomodoro有断断续续的感觉，但它不是一直有效的，尤其是当我自己使用的时候-不是这样的。有几天，我没有一个应用程序能用得更多。我经常在启动或重新启动时遇到问题。波莫多罗在其他人控制时间的时候工作(或者我们轮流工作，我知道其他人也依赖于此)，但不是单独工作。\n附注：为什么所有跟踪时间的软件都假定这一天从午夜开始？(午夜似乎与平均睡眠时间相差甚远。)。\n我希望它能给你一点追踪时间的灵感。如果它激励了你，那就太好了--不管你是否患有多动症。当然，你认为什么是宝贵的时间，是多么让人分心，这取决于你。我们需要承认，创造性的工作需要在随机追求和灵感之间取得平衡，并集中精力完成一些事情。而且，休息不是让人分心的东西。虽然我拖拖拉拉很多，但我正在慢慢地学习如何休息(例如，一个革命性的想法，一次小便有一天\n明确地说，这样的时间跟踪对我有帮助，但远不能解决我的问题。与约会的话题不同，我希望从一无所知到相当能干，而当谈到时间组织时，我从一无所知变成了稍微不那么有头绪。\n如果你在时间安排上苦苦挣扎，我推荐爱德华·哈洛威尔和约翰·拉蒂所著的“如何处理时间安排”、YouTube频道和“分心驱动：识别和应对注意力缺陷障碍”一书。“假肢”一词来自他们的书，在书中，他们将ADHD比作近视。戴眼镜或镜片是一个可以接受的解决方案，人们不会被强迫“更努力地眯着眼睛”。\n我感谢wojciech jabłoński打扰我写这篇文章来写《多动症技术栈》(这是他的标题)；感谢安娜卡尔皮克对草案的评论。它是这样开始的：https://news.ycombinator.com/item?id=22854491.。\n如果有需要，我很乐意用Evernote写在我的待办事项清单上。我发现它比典型的TODO应用程序更有用，因为它更符合“子弹日记”(Bullet Journal)的风格：如果我不做一项任务，它就会消失，除非我有意识地重新写下它。\n我的一位密友向我展示了他的展示，背景是一个长方形。\n嗯，它是365x100像素，你的生命中没有那么多的日子。想一想每一天，如果你以一种重要的方式度过它。\n我的桌面乱七八糟，所以我很少看到它。但几年来，我一直看到每个新选项卡(死亡率-新选项卡)：\n这是一种现代的“纪念森里”。颇具讽刺意味的是，它激励我尽情地生活。每次新的标签，我都会问自己“打开这个网站是不是我能用这段时间做的最好的事情？”它不是用来娱乐的，它让我不会无意中让时间从我的手指间流过。", "note_en": "A few tips on automatic time tracking, especially for people with ADHD: how to get immediate feedback, for actions, not guilt.\n tl;dr: Qbserve when I was on macOS, now RescueTime + Custom New URL Tab (Chrome extension) pointing its report, so I get immediate feedback on my productivity (motivates me to keep moving), or the depth of my slacking (motivates me to start working). Plus I use Intention, for web browsing.\n I cannot stress enough the word  immediate. Delayed reports (after a week, after a day, or whenever I check) sure give a bit of reality-check and insight on what to change (usually only the first time) but were not useful for actually implementing these changes. (I have ADHD if that matters. For some people insight might be enough.)\n  What then is time? If no one asks me, I know what it is. If I wish to explain it to him who asks, I do not know. — Augustine of Hippo\n What I do know is that I cannot keep track of time. I zone out, into the inner world of dreams and ideas. I need some kind of “prosthetics” for my daily functioning, to even remotely stay on track. As a simple example: since being 15 or so I always wear a watch (no, a smartphone in the pocket is not enough). If I am without it, I feel confused.\n And how about work? Freelancing is great and gives me the freedom and flexibility I desire. However, it comes as the cost of the lack of external structure, to get work started and keep it on track. Sometimes it takes checking a single (snd relevant!) link, and 2h are gone (after a rabbit hole dive).\n    my watch (Fitbit, motivates me to walk more and sleep more; enough to charge once a week),\n  alarms for everything (I need to for a meeting in the evening? I set an alarm).\n Let me share what helped me with self-spying, I mean, time tracking. I need two things:\n  I cannot overemphasize the latter. If I get a summary after a week, or even — after a day, it will guilt-trip me (at which I excel!), but it won’t be helpful. I will keep blaming myself, keep slacking/sinning.\n  What I need is an always-watching deity that also provides immediate feedback. (“ There is no ADHD when it comes to video games.” — we strive on fast, objective&amp; actionable feedback!)\n    What is even more important, is the always-watching-cube in the taskbar, displaying my productivity score (the one with 6%):\n    When I see it is lowish, I am motivated to start working, with it is high — motivated to continue (for reference, 6% is very low; but I didn’t use this laptop for work the given day).\n  However, in Dec 2019 I brought a new laptop, this time with Windows. To my surprise, it was easy to set up a dev environment (Anaconda, Node, and VSCode work almost the same). Another thing started to be a challenge: how to be productive, since I cannot use Qbserve AND  a powerful graphics card has other good uses than deep learning? I installed  RescueTime.\n  It tracks reasonably well but misses one core feature — real-time feedback. That is, I know I can see reports at wish, but I would love to get frequent feedback. It cannot be conditional on my consciously checking it.\n I looked for extensions so that I would see it on the taskbar but to no avail. However, then it snapped. I used some extensions to motivate myself with new tabs:  Mortality New Tab (more on that in the “extra”) or a less morbid one:  Momentum. Why not setting a new tab to RescueTime directly?\n  Now each time I open a new tab (which I do all the time) get a reality check. I more or less know how I procrastinate a given day, so I don’t need a summary of it. A summary of time is invaluable, though. A small note: the default view is at  https://www.rescuetime.com/dashboard.\n  If you think that I underestimate the government power to sabotage me, you underestimate my ability to self-sabotage myself. However, if you prefer an open-source (and much more privacy-focused) alternative, there is  ActivityWatch, that would work with the same URL tab redirect, this  http://localhost:5600/#/timeline\n  The interface is slightly less polished (and, unfortunately, I experience a delay between opening it and getting a chart), but the tracking works. Since it is  in Vue I love, one day I might modify it to my needs.\n  There is one, very recent, plugin I use on all machines:  Intention, I learned from  an HN thread. (I used it on top of Qbserve / Rescue Time, not instead of it!) It works only for tabs, but since it is my main source of distractions (“ just one more video”, “ just one more comment”, etc), it matters.\n    The best time ever was when in high school, writing a mathematical paper, and taking breaks with Timeshock game (a pinboard, no storyline). We all know that no breaks is bad:\n  The problem is when I drift, and instead of a refreshing 15 min, it is a 2h rabbit hole journey, eating not only my time but also attention. But most of the current software does not address that.\n I use social media after midnight, and it does not stop me then but cuts the global limit for the next day.\n There is a nasty surprise when an app kicks me out, with no warning. It is so unpleasant (especially when I am in the middle of writing a long comment) that it may prompt be to uninstall it.\n Too strict limits. Sometimes I know that a given day I need more social media.\n  I see the countdown (so I know if to wrap-up a reply, or if it makes sense to start writing a new one),\n  yet, it distinguishes between “normal use” of YouTube and e.g. using it for creating a workshop on deep learning (looking for video abstract of recent papers).\n  I use  Toggl for time tracking for projects in which I am paid by the hour (minority). I tried it to use for other projects, and sometimes it makes it easier to stay on track. However, I often forgot to switch it on.\n There are a few plugins (e.g. ColdTurkey) that are “too nuclear”. Being halted in the middle of writing a reply (on Facebook or Hacker News), with no prior warning, left me disturbed. Even worse, when I used it for my WORK stuff, in data science or Quantum Game.\n I have my on-and-offs with Pomodoro, but it does not work on a consistent basis, and least — not when self-applied. There was not a single app I was able to use more for a few days. Often I had a problem with starting or restarting. Pomodoro worked when sometime else was controlling time (or we took turns, and I knew others depend on that as well), but not for solo work.\n Side note: why ALL time-tracking pieces of software assume that day starts at midnight? (Midnight does not seem to be anywhere near to the average of sleep time.)\n  I hope it inspired you a bit to track time. If it inspired you, great — no matter if you have ADHD or not. Of course, it is up to you what you consider a valuable time, and what a distraction. We need to admit that creative work pretty much needs a balance between random pursuits and inspirations, and focus to get something done. Also, rest is something different than a distraction. While I procrastinate a lot I am slowly learning how to rest (e.g. a revolutionary idea of having a day a wee\n To make it clear, such time-tracking helped me but is far for solving my problems. Unlike the topic of  dating, where I want from clueless to fairly competent, when it comes to time organization I went from clueless to slightly less clueless.\n If you struggle with time organization, I recommend  How to ADHD Youtube channel and  Driven to Distraction: Recognizing and Coping with Attention Deficit Disorder book by Edward Hallowell &amp; John Ratey. The term “prosthetic” comes from their book, in which they compare ADHD to be short-sighted. Wearing glasses or lenses is an acceptable solution, and people are not pushed to “just squint their eyes harder”.\n I thank Wojciech Jabłoński for bugging me to write it to write “ADHD tech stack” (it’s his title); thanks Anna Karpiuk for remarks on the draft. It started as this comment:  https://news.ycombinator.com/item?id=22854491.\n If there is a need, I am happy to write on my TODO list with Evernote. I find it more useful than typical TODO apps, as it is more in the line of the Bullet Journal: if I don’t do a task, it is gone unless I take a conscious effort to write it down again.\n  A close friend of mine showed me his display, with a rectangle in the background.\n   Well, it is 365 x 100 pixels, and there are not as many days in you life. Think about every day, and if you spend it in a way that matters.\n My desktop is cluttered, so I rarely see it. But for a few years I have been seeing with each new tab ( Mortality — New Tab):\n  It is a modern-day “ memento mori”. Quite ironically, it motivated me to live to the fullest. With each new tab, I asked myself “ Is opening this website the best thing I can do with this piece of time?”. It didn’t hold me for entertainment; it held me from making time pass through my fingers, unintentionally.", "posttime": "2020-05-20 06:06:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "技术,tech,时间", "title": "ADHD技术堆栈：自动时间跟踪，以获得可行的反馈，而不是负罪感", "title_en": "ADHD tech stack: auto time tracking to get actionable feedback, not guilt", "transed": 1, "url": "https://medium.com/@pmigdal/adhd-tech-stack-auto-time-tracking-b8ff5b6bc888", "via": "", "real_tags": ["技术", "tech", "时间"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002881, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "OpenBSD 6.7是今天早上发布的，它是这个注重安全的BSD操作系统的最新版本。OpenBSD6.7的众多变化包括：-FFS2文件系统改进，包括对新安装默认使用64位时间戳和块号。-支持ARM64上的Raspberry PI 4，同时也改进了对Raspberry PI 3的支持。Raspberry PI 2/3对OpenBSD ARMv7的支持也得到了改进。-更好地支持Pinebook Pro等RockChip系统。-各种SMP改进，包括更好的AMD SMT/核心/封装检测。-各种不同的硬件驱动程序改进，包括英特尔AX200 WiFi设备支持。-为支持FIDO/U2F安全密钥而引入的FIDO驱动程序。-修复了在不同USB 3.0控制器上使用USB 2.0设备时的处理。-PowerPC OpenBSD版本切换到Clang作为其默认代码编译器。-各种dhclient修复。--各项安全改进。OpenBSD6.7更改的大列表可以通过OpenBSD.org上的发布声明找到。", "note_en": "OpenBSD 6.7 was released this morning as the newest version of this security-minded BSD operating system.\r   Among the many changes with OpenBSD 6.7 are:\r   - FFS2 file-system improvements including using 64-bit timestamps and block numbers by default for new installs.\r   - Support for the Raspberry Pi 4 on ARM64 while improving the Raspberry Pi 3 support too. Raspberry Pi 2/3 support has also improved for OpenBSD ARMv7.\r   - Better support for Rockchip systems like the Pinebook Pro.\r   - Various SMP improvements including better AMD SMT/Core/Package detection.\r   - A wide variety of different hardware driver improvements, including Intel AX200 WiFi device support.\r   - A FIDO driver introduced for FIDO/U2F security keys support.\r   - Fixed handling of USB 2.0 devices when in use on different USB 3.0 controllers.\r   - The PowerPC OpenBSD build switched over to Clang as its default code compiler.\r   - Various dhclient fixes.\r   - Various security improvements.\r   The big list of OpenBSD 6.7 changes can be found via the release announcement on  OpenBSD.org.", "posttime": "2020-05-20 05:37:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,openbsd,改进", "title": "OpenBSD 6.7发布", "title_en": "OpenBSD 6.7 Released", "transed": 1, "url": "https://www.phoronix.com/scan.php?page=news_item&px=OpenBSD-6.7-Released", "via": "", "real_tags": ["发布", "openbsd", "改进"]}]