[{"category": "", "categoryclass": "", "imagename": "4630ba1381fbc548eea8f92e6000744a.jpg", "infoid": 1003124, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该计划是在拉吉夫·甘地逝世周年纪念日推出的。Chhattisgarh CM Bhupesh Baghel说，Nyay Yojana将使19万农民受益，并有助于扩大种植面积。\n国大党主席索尼娅·甘地(Sonia Gandhi)周四(5月21日)在恰蒂斯加尔邦启动了拉吉夫·甘地·基桑奈(Rajiv Gandhi Kisan Nyay)计划，这一天是这位前总理的逝世纪念日，他说这是对他“真正的敬意”。\n甘地通过视频会议向发布会发表讲话时表示：“这样的计划应该在基层实施，以帮助改变人们的生活。这是一个革命性的计划，是对拉吉夫·甘地的真正致敬。这是与拉吉夫·甘地的价值观相一致的一大步。\n恰蒂斯加尔邦首席部长Bhupesh Baghel说，Rajiv Gandhi Kisan Nyay Yojana将使19万农民受益，并帮助扩大种植面积。他说，该计划的目的是帮助农民赚取更多收入，并使该州的种植面积更大，目前该州的种植面积为20%。\nछत्तीसगढ़सरकारद्वाराप्रारंभकीगईदेशमेअपनीतरहकीपहलीयोजनाराजीवगांधीकिसानन्याययोजनाकेतहतधान。मक्काऔरगन्ना(रबी)उत्पादककिसानोंकेखातेमेंलगभग5700型करोड़रूपएकीराशिकिसानोंकोखेतीकिसानीकेलिएप्रोत्साहितकरने，उन्हेंउपजकासहीदामदिलानेकेउद्देश्य..。\n根据CMO Chhattisgarh的一条推文，根据该计划，拉比季节的稻谷、玉米和甘蔗农民将分四期在他们的银行账户中获得5700卢比的核心资金。周四，通过直接利益转移(DBT)向农民发放了第一批1500卢比。\nकांग्रेसअध्यक्षामाननीयसोनियागांधीजीएवंमाननीयराहुलगांधीजीआजकरेंगे“राजीवगांधीकिसानन्याययोजना”काशुभारंभpic.twitter.com/Gs1a4vbueX。\n通过Rajiv Gandhi Kisan Nyay Yojana，已经采取措施向恰蒂斯加尔邦的农民提供所有必要的资源，鼓励作物生产，并将资金直接汇到他们的银行账户。计划将无地部落农业劳工纳入该计划的第二阶段。这是一个非常独特的决定，将使他们全部自给自足。“索尼娅·甘地说。\n前国大党主席拉胡尔·甘地(Rahul Gandhi)也赞扬了恰蒂斯加尔邦政府在穷人和农民因冠状病毒爆发和为遏制疾病传播而实施的封锁而面临困难的时候推出了这一计划。", "note_en": "The scheme was launched on Rajiv Gandhi&#39;s death anniversary. Chhattisgarh CM Bhupesh Baghel said the Nyay Yojana will benefit 19 lakh farmers and help bring more area under cultivation.\n  Congress president  Sonia Gandhi launched the  Rajiv Gandhi Kisan Nyay scheme in Chhattisgarh on Thursday (May 21), the death anniversary of the former prime minister, and said this was a ‘true tribute’ to him.\n Addressing the launch event through video-conferencing, Gandhi said: “Such schemes should be implemented at the ground level to help bring a change in the lives of people. This is a revolutionary scheme and is a true tribute to Rajiv Gandhi. This is a big step taken in lines with the values of Rajiv Gandhi.\n Chhattisgarh Chief Minister Bhupesh Baghel said the Rajiv Gandhi Kisan Nyay Yojana will benefit 19 lakh farmers and help bring more area under cultivation. He said the aim of the scheme is to help farmers earn more and bring more area in the state under cultivation, which currently stands at 20 per cent.\n छत्तीसगढ़ सरकार द्वारा प्रारंभ की गई देश मे अपनी तरह की पहली योजना राजीव गांधी किसान न्याय योजना के तहत धान, मक्का और गन्ना (रबी) उत्पादक किसानों के खाते में लगभग 5700 करोड़ रूपए की राशि किसानों को खेती किसानी के लिए प्रोत्साहित करने, उन्हें उपज का सही दाम दिलाने के उद्देश्य..\n According to a tweet by CMO Chhattisgarh, under the scheme, paddy, maize and sugarcane farmers in the rabbi season will get Rs 5,700 core in their bank accounts, in four instalments. On Thursday, the first instalment of Rs 1,500 crore was given to the farmers through Direct Benefit Transfer (DBT).\n   कांग्रेस अध्यक्षा माननीय सोनिया गांधी जी एवं माननीय राहुल गांधी जी आज करेंगे “राजीव गांधी किसान न्याय योजना” का शुभारंभ  pic.twitter.com/Gs1a4vbueX\n “Through the Rajiv Gandhi Kisan NYAY Yojana, steps have been taken to provide all requisite resources to the farmers of Chhattisgarh, encourage crop production and send funds directly to their bank accounts. There is a plan to include landless tribal agricultural labourers in the second phase of this scheme. This is a very unique decision which will make them all self-sufficient,” said Sonia Gandhi.\n Former Congress president Rahul Gandhi also lauded the Chhattisgarh government for launching the scheme at a time when the poor and farmers were facing hardships due to the  coronavirus outbreak and the lockdown imposed to contain the spread of the disease.", "posttime": "2020-05-21 22:12:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "农民,state,计划", "title": "印度邦宣布农民基本收入：每英亩每年170美元", "title_en": "Indian state announces basic income for farmers: $170 per acre per year", "transed": 1, "url": "https://indianexpress.com/article/india/chhattisgarh-sonia-gandhi-launches-rajiv-gandhi-kisan-nyay-scheme-6421246/", "via": "", "real_tags": ["农民", "state", "计划"]}, {"category": "", "categoryclass": "", "imagename": "d097a84f570b551bde601eea0e85e74f.jpg", "infoid": 1003123, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "订阅我的主频道-http://Timcast.net支持我的工作-https://www.timcast.com/donate https://www.youtube.com/watch?v=5xUNON8kztI从.", "note_en": "SUBSCRIBE TO MY MAIN CHANNEL - http://Timcast.net Support My Work - https://www.timcast.com/donate https://www.youtube.com/watch?v=5xUNON8kztI Buy stuff from...", "posttime": "2020-05-21 22:12:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "collapsing,https", "title": "Reddit正在崩溃，超级用户暴露", "title_en": "Reddit Is Collapsing, Power Users Exposed", "transed": 1, "url": "https://www.youtube.com/watch?v=a3nafnWsgH0", "via": "", "real_tags": ["https"]}, {"category": "", "categoryclass": "", "imagename": "67157d17897facce37bc4d25f6776b87.png", "infoid": 1003120, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此次发布的notqmail遵循两个主题：修复错误和降低错误可能性。\nqmail-pop3d：如果root进行了身份验证，则不是以root身份运行(并且是对root密码进行字典攻击的载体)，而是退出1，使其看起来就像失败的检查密码登录一样。(#92)。\n删除不能正确支持CNAME的旧DNS服务器的解决方法。乔纳森·德·博因·波拉德(Jonathan De Boyne Pollard)制作的补丁在网上漂浮多年。(#97)。\n使用系统头而不是重新声明exit()、read()、write()、malloc()、free()、fork()、uint32_t。(#79，#80，#81，#82，#101，#30)。\n在开发此版本的过程中，我们发现了我们打算在下一个版本中删除的程序。我们认为，所有这些都不是必要的，也不是足够有用的，不值得花费维护费用。如果您不同意，请告诉我们！\n删除qmail-pop3d，因为活跃维护的POP3服务器(例如Courier IMAP或Dovecot)很好地支持Maildir。\n我们感谢Qualys的发现、协作方法以及削减新版本的动力。", "note_en": "This release of notqmail is guided by two themes:  fix bugs and  reduce bug likelihood.\n  qmail-pop3d: instead of running as root if root authenticates (and being a vector for a dictionary attack on the root password), exit 1 to look just like a failed  checkpassword login. ( #92)\n   Remove workaround for ancient DNS servers that do not properly support CNAME.  Patch by Jonathan de Boyne Pollard that was floating around the net for years. ( #97)\n  Use system headers instead of redeclaring  exit(),  read(),  write(),  malloc(),  free(),  fork(),  uint32_t. ( #79,  #80,  #81,  #82,  #101,  #30)\n    In the course of developing this release, we found programs that we intend to remove in the next release. We believe none of these remains necessary or useful enough to be worth the cost of maintaining. If you disagree, please let us know!\n Remove  qmail-pop3d, since Maildir is well supported by actively maintained POP3 servers (e.g.,  Courier IMAP or  Dovecot).\n  We thank Qualys for their findings, collaborative approach, and impetus to cut a new release.", "posttime": "2020-05-21 21:47:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "notqmail,版本", "title": "Notqmail 1.08·notqmail/notqmail维基", "title_en": "Notqmail 1.08 · notqmail/notqmail Wiki", "transed": 1, "url": "https://github.com/notqmail/notqmail/wiki/notqmail-1.08", "via": "", "real_tags": ["notqmail", "版本"]}, {"category": "", "categoryclass": "", "imagename": "dad2a2e7085620c13eba1a0597fc31cd.jpg", "infoid": 1003119, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一份新的报告发现，尽管由于冠状病毒隔离和在家呆着的命令，美国人开车减少了，但美国的道路变得更加致命。\n美国国家安全委员会(NSC)的这份文件称，早期数据显示，3月份每行驶距离的死亡率同比增长了14%。\n然而，美国3月份的道路死亡总人数为2690人，下降了8%。\nNSC的报告称，3月份每亿辆车行驶里程死亡率为1.22，而2019年3月为1.07。\n国家安全委员会主席洛林·M·马丁(Lorraine M Martin)说，令人不安的是，我们有开放的车道，而且显然是鲁莽驾驶的开放季节。\n现在，在一场全球性的流行病和危机中，我们应该把安全驾驶作为我们的公民责任。\n马丁表示：如果我们不能为自己做这件事，我们就应该为我们的急救人员、执法部门和医护人员做这件事，他们理所当然地专注于冠状病毒患者，不应该被本可以预防的车祸搞得不知所措。\nNSC表示，数据表明，超速增加是导致死亡率惊人上升的关键因素之一。\n它还表示，在一些州放松对青少年的驾照要求可能是一个促成因素。\nNSC是一个由美国国会特许成立的非营利性组织，它将任何涉及机动车事故的人：司机、乘客、行人和骑自行车的人计算为死亡人数。\n报告称，截至3月份，机动车死亡、受伤和财产损失的估计成本为954亿美元(780亿GB)。", "note_en": "US roads have become more lethal even though Americans are driving less due to coronavirus quarantine and stay-at-home orders, a new report has found.\n Early data indicate a year-on-year 14% jump in fatality rates per distance driven in March,  the document by the National Safety Council (NSC) says.\n  However, the overall number of roadway deaths across the US in March fell by 8% to 2,690.\n     The mileage death rate per 100 million vehicle miles driven was 1.22 in March compared with 1.07 in March 2019, the NSC report said.\n &#34;Disturbingly, we have open lanes of traffic and an apparent open season on reckless driving,&#34; said NSC President Lorraine M Martin.\n &#34;Right now, in the midst of a global pandemic and crisis, we should take it as our civic duty to drive safely.\n &#34;If we won&#39;t do it for ourselves, we should do it for our first responders, our law enforcement and our healthcare workers, who are rightly focused on coronavirus patients and should not be overwhelmed by preventable car crashes,&#34; Ms Martin said.\n Data suggested that the increase in speeding was one of the key factors explaining the alarming rise in the death rate, the NSC said.\n It also said relaxing driving licence requirements for teenagers in some states might have been a contributing factor.\n The NSC - a non-profit organisation chartered by US Congress - counts a fatality as anyone involved in a motor vehicle accident: drivers, passengers, pedestrians and cyclists.\n The estimated cost of motor-vehicle deaths, injuries, and property damage through March was $95.4bn (£78bn), the report said.", "posttime": "2020-05-21 21:25:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,coronavirus,病毒,美国,roads", "title": "报道称，美国道路空荡荡的在冠状病毒大流行中更致命", "title_en": "Emptier US roads more lethal in coronavirus pandemic, report says", "transed": 1, "url": "https://www.bbc.com/news/world-us-canada-52753925", "via": "", "real_tags": ["冠状病毒", "病毒", "美国", "roads"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003118, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "移动支付公司Square的亿万富翁首席执行官杰克·多尔西(Jack Dorsey)将向人类前进(Humanity Forward)捐赠500万美元，该组织由前民主党总统候选人发起，旨在为全民基本收入奠定基础。\n多尔西计划通过一个名为Start Small的基金捐出10亿美元的财富，他在杨致远的最新一期播客中宣布了这笔七位数的捐款。多尔西告诉杨，普遍基本收入(UBI)是一个“早就应该”的想法，“我们改变政策的唯一方法是通过试验和展示案例研究来说明为什么这样做是可行的。”\n杨说，人道前进计划立即将多尔西的捐款以250美元的小额现金赠款的形式分发给近2万名因冠状病毒大流行而失去工作或遭受经济打击的人。杨的组织已经发放了近200万美元的直接现金援助，以帮助因冠状病毒大流行而摇摇欲坠的社区。\n杨在一份声明中说：“杰克的捐赠不仅将直接影响当前经济低迷时期数以万计的有需要的人，还将帮助人类向前发展，我们的运动将继续为美国的全民基本收入提供理由。”我们知道，每个美国人的UBI都是可能的，这笔500万美元的从小开始将有助于展示全国各地的家庭都有可能实现的目标。“。\n作为一名总统候选人，杨致远创造了普遍的基本收入-他所说的“自由红利”-这是他竞选活动的核心。他告诉选民，美国正处于“我国历史上最伟大的经济和技术变革的第三局”，自动化和人工智能的进步将从根本上重塑全球经济。他在2019年告诉“滚石”杂志：“如果你正在应对这种历史性的经济转变，那么你需要带来真正的解决方案，帮助人们管理过渡。”“要做到这一点，最有效的方式就是全民基本收入。”\n杨的信息和他作为候选人时令人耳目一新的粗制滥造的方式帮助他在网上积累了热情的追随者，并筹集了数千万美元。他以科技为中心的愿景也赢得了多尔西、Y-Combinator总裁萨姆·奥特曼和特斯拉的埃隆·马斯克等人的称赞。\n杨致远在爱荷华州和新罕布夏州的初选中令人失望后退出了竞选。但他将自己的草根追随者和筹款能力转化为人道前进(Humanity Forward)，这是一个致力于增加对普遍基本收入的支持的非营利性组织。\n随着冠状病毒的流行使美国经济陷入停滞，导致3000万人(而且还在增加)失业，杨突然不再是唯一一个为基本收入而战的人。民主党和共和党议员，来自纽约州民主党众议员亚历山德里亚·奥卡西奥-科尔特斯(Alexandria Ocasio-Cortez)。对犹他州共和党参议员米特·罗姆尼(Mitt Romney)来说，他直言不讳地支持直接现金支付，以缓冲冠状病毒关闭的打击。杨咨询了华盛顿特区的政策制定者，并看到他的标志性想法以向中低收入美国人支付1200美元的形式进入了CARE法案，这是大流行救济法案之一。“你别无选择，只能采取大刀阔斧的措施来帮助支撑需求，让美国家庭脱离水深火热的境地，而要做到这一点，除了尽快把现金送到每个人手中之外，没有什么现实的办法，”他今年早些时候告诉“滚石”杂志(Rolling Stone)。\n在“杨说”的播客采访中，杰克·多尔西称赞杨致远将曾经相当模糊的基本收入概念带给了主流观众。多尔西告诉杨，华盛顿指定的冠状病毒救援资金有这么多都流向了“银行和较大的公司，而这些资金本可以进入这个国家的个人手中，这”只是一场悲剧“。”虽然特朗普政府的救援努力包括直接现金支付和扩大失业保险福利，但小型和少数族裔拥有的企业一直难以通过特朗普政府的Paycheck Protection Program获得财政支持。数百家上市公司通过PPP获得了数十亿美元的救济，美联储(Federal Reserve)通过直接贷款和降低利率来拯救大公司。\n多尔西说，他认为全民基本收入不仅是帮助在大流行期间失去收入的人的一种方式，也是在快速变化的经济中的某种安全网。“每一个领域都将被自动化触及，而UBI对我来说代表着一层楼，”多尔西说。“一层楼，人们可以站在上面，拥有知识和内心的安宁，他们可以生存下来，在他们学习如何过渡到这个新世界的同时，吃饭和喂养他们的孩子。”\n作为数百万小企业使用的在线支付和电子商务平台Square的首席执行官，多尔西表示，由于这场危机，大流行前正在进行的技术变革加速了。“没有一个人领导这场自动化冲锋，也没有一个人可以阻止它，”他说。“这就是为什么我们需要向内看，确保我们照顾到每一个人，特别是在这种转变发生时我们最脆弱的人。人们首先需要这种内心的平静来面对它。“。例如，企业已经停止使用人工收银员，转而采用仅限在线的支付模式。“这场危机，这场大流行正在加速我们预期的变化速度，”他说。“我一直在说，我们将在10周内看到10年的进步或变化。”\n多尔西说，他决定支持杨的“人道前进”(Humanity Forward)组织，以帮助推动更多关于基本收入在美国的使用和影响的实验。“我们只有那么多时间来解决这些问题，”他说。“如果我们今天采取的这些小步骤能复合成改变政策并促进政策成功的实验，那就太棒了。我们在这个领域能做的越多越好。“。\n订阅滚石杂志的时事通讯。有关最新新闻，请在Facebook、Twitter和Instagram上关注我们。", "note_en": "Jack Dorsey, the billionaire CEO of   and mobile-payment company Square, is giving $5 million to   Humanity Forward , a group launched by former Democratic presidential candidate   to build the case for a universal basic income.\n Dorsey, who plans to give away $1 billion of his wealth through a fund called Start Small, announced the seven-figure donation on the newest episode of Yang’s podcast,  “Yang Speaks.” Dorsey told Yang that a universal basic income, or UBI, was a “long overdue” idea and “the only way we can change policy is by experimenting and showing case studies of why this works.”\n   Yang says Humanity Forward plans to immediately distribute Dorsey’s contribution in the form of small cash grants of $250 to nearly 20,000 people who’ve lost their jobs or taken an economic hit as a result of the Covid-19 pandemic. Yang’s group has already given away nearly $2 million in direct cash assistance to help communities reeling from the coronavirus pandemic.\n “Not only will Jack’s donation directly impact tens of thousands of people in need during the current economic downturn, it will help Humanity Forward and our movement continue to make a case for universal basic income in the United States,” Yang said in a statement. “We know UBI for every American is possible, and this $5 million from Start Small is going to help demonstrate what is possible for families across the country.”\n As a presidential candidate, Yang   made a universal basic income  — what he called a “Freedom Dividend” — the centerpiece of his campaign. He told voters that the U.S. was “in the third inning of the greatest economic and technological transformation in the history of our country” with advances in automation and artificial intelligence poised to radically reshape the global economy. “If you’re dealing with an economic shift this historic, then you need to bring real solutions to bear that are going to help people manage the transition,” he   told   Rolling Stone  in 2019. “And the most efficient way to do that is a universal basic income.”\n Yang’s message and his refreshingly unpolished approach as a candidate helped him amass a fervent online following and raise tens of millions of dollars. His tech-centric vision also drew praise from Dorsey, Y-combinator president Sam Altman, and Tesla’s Elon Musk, to name a few.\n Yang exited the race after disappointing finishes in the Iowa and New Hampshire primaries. But he translated his grassroots following and fundraising prowess into Humanity Forward, a nonprofit group devoted to growing support for universal basic income.\n As the Covid-19 pandemic ground the U.S. economy to a halt and put 30 million people (and counting) out of work,  Yang suddenly wasn’t so alone in his crusade for a basic income. Democratic and Republican lawmakers, from Rep. Alexandria Ocasio-Cortez (D-N.Y.) to Sen. Mitt Romney (R-Utah), spoke out in favor of direct cash payments to cushion the blow of the coronavirus shutdown. Yang consulted with policymakers in Washington, D.C., and watched his signature idea make its way into the CARES Act, one of the pandemic relief bills, in the form of a $1,200 payment to middle- and low-income Americans. “You have no choice but to take drastic measures to help support demand and keep American families above water, and there’s no realistic way to do that except just to put cash in everyone’s hands as fast as possible,” he   told   Rolling Stone  earlier this year.\n In the “Yang Speaks” podcast interview, Jack Dorsey credits Yang with bringing what was once a fairly obscure idea of a basic income to a mainstream audience. Dorsey tells Yang it’s “just a tragedy” that so much of the coronavirus relief funds earmarked by Washington had gone to “the banks and larger companies when it could be going into the hands of individuals in this country.” While the Trump administration’s relief efforts have included direct cash payments and expanded unemployment insurance benefits, small and minority-owned businesses   have struggled  to secure financial support through the Trump administration’s Paycheck Protection Program. Hundreds of publicly-traded companies have received billions of dollars in relief through the PPP, and the Federal Reserve has come to the rescue of large firms with direct lending and lowered interest rates.\n  Dorsey says he sees universal basic income not only as a way to help people who’ve lost their income during the pandemic but also as a safety net of sorts in a fast-changing economy. “Every single field is going to be touched by automation, and UBI to me represents a floor,” Dorsey says. “A floor that people can stand on, and have the knowledge and peace of mind that they could survive and eat and feed their children while they are learning how to transition into this new world.”\n As the CEO of Square, the online payment and e-commerce platform used by millions of small businesses, Dorsey says the technological changes that were underway before the pandemic have accelerated as a result of this crisis.  “There’s no one person leading this automation charge, and there’s no one person that can stop it,” he says. “That’s why we need to look inwards and make sure we’re taking care of everyone, especially our most vulnerable as this shift happens. People need that peace of mind to face it in the first place.”  Businesses, for instance, have stopped using human cashiers and moved to online-only payment models. “This crisis, this pandemic is accelerating the rate of change that we had expected,” he says. “I’ve been saying we’re seeing 10 years of progress or change in 10 weeks.”\n Dorsey says he decided to support Yang’s group Humanity Forward to help spur more experimentation about the uses and effects of a basic income in the U.S. “We only have so much time to address these things,” he says. “If the small steps we’re taking today compound into experiments that change and inform policy success, that’s awesome. And the more we can do in this space, the better.”\n  Sign up for  Rolling Stone’s Newsletter. For the latest news, follow us on  Facebook,  Twitter, and  Instagram.", "posttime": "2020-05-21 21:25:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "收入,basic,帮助", "title": "杰克·多尔西将给安德鲁·杨500万美元，为基本收入立案。", "title_en": "Jack Dorsey Is Giving Andrew Yang $5M to Build the Case for a Basic Income", "transed": 1, "url": "https://www.yahoo.com/entertainment/twitter-jack-dorsey-giving-andrew-090025479.html", "via": "", "real_tags": ["收入", "basic", "帮助"]}, {"category": "", "categoryclass": "", "imagename": "361a0ca7cae20ac66c234aa2f246f2ac.jpg", "infoid": 1003117, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "超本地化社交媒体平台Nextdoor正在赢得美国当地执法部门和其他政府官员的支持，这让民权倡导者感到震惊。", "note_en": "The hyper-local social media platform Nextdoor is winning over local law enforcement and other government officials in the U.S., alarming civil rights advocates.", "posttime": "2020-05-21 21:24:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "警察,courts,本地化", "title": "隔壁法院如何让警察和公职人员", "title_en": "How Nextdoor Courts Police and Public Officials", "transed": 1, "url": "https://www.citylab.com/equity/2020/05/nextdoor-local-partnerships-police-government-privacy-app/611827/", "via": "", "real_tags": ["警察", "courts", "本地化"]}, {"category": "", "categoryclass": "", "imagename": "4b7d9ecba1881eda1176c27aaa7da297.png", "infoid": 1003116, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您好，正如我在自述文件更新的拉取请求中提到的，诊断数据收集(遥测)没有针对此项目的私有版本启用，并且仅在发布版本(https://github.com/microsoft/winget-cli/releases)和通过微软商店安装的应用程序)上启用。此数据收集受Windows 10隐私保护，您可以在此处找到Windows 10隐私声明以及控制诊断和反馈设置的详细信息-https://support.microsoft.com/en-us/help/4468236/diagnostics-feedback-and-privacy-in-windows-10-microsoft-privacy", "note_en": "Hi, As I mentioned in the pull request for the readme update, diagnostic data collection (telemetry) is not enabled for private builds of this project and is enabled only on the release builds ( https://github.com/microsoft/winget-cli/releases) and the app installed via Microsoft store. This data collection is covered by windows 10 privacy, You can find the windows 10 privacy statement and details of controlling the diagnostic and feedback settings here - https://support.microsoft.com/en-us/help/4468236/diagnostics-feedback-and-privacy-in-windows-10-microsoft-privacy", "posttime": "2020-05-21 21:24:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,软件,软件包,package,https", "title": "Windows软件包管理器不允许选择退出遥测", "title_en": "Windows package manager does not permit opting out of telemetry", "transed": 1, "url": "https://github.com/microsoft/winget-cli/issues/179", "via": "", "real_tags": ["windows", "软件", "软件包", "package", "https"]}, {"category": "", "categoryclass": "", "imagename": "0ba2cbc32f2fea337332276713483997.png", "infoid": 1003115, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着实现远程工作的技术逐渐成熟，许多公司已经尝试了远程工作的想法。但突然之间，一场全球大流行迫使世界各地的公司迅速和根本地改变了他们的工作方式，以保持一定的生产力。正如许多人所观察到的那样，在家工作与在流行病期间被迫在家工作截然不同，我们认为在这种新的背景下，将会有一段充分提高生产力的旅程。\n我们从来不相信远程制造雷达是可能的，然而我们来了--这是我们没有亲自见过面就制造出的第一个雷达。许多建议的闪光灯都表明了实现一流远程协作的迫切需求。我们不想忽视房间里的大象，不想对这场危机发表评论，但做好远程优先协作是一个深入而微妙的主题，当然，我们的所有建议都不适合雷达格式。因此，除了本版本之外，您还可以找到一个播客，在该播客中，我们将讨论我们创建雷达远程优先的经验、一份书面经验报告，其中包括远程优先生产力方面的建议、涵盖危机中的技术策略的网络研讨会以及指向其他ThoughtWorks材料(包括我们的远程工作攻略)的链接。我们希望这些材料，连同其他互联网资源，将帮助那些试图驾驭这些未知水域的组织。", "note_en": "Many companies have experimented with the idea of remote working as the technology to enable it has slowly matured. But suddenly, a global pandemic has forced companies all over the world to rapidly and fundamentally change their way of working to preserve some productivity. As many have observed, &#34;working from home&#34; is starkly different from &#34;being forced to work from home during a pandemic&#34;, and we think there will be a journey ahead to become fully productive in this new context.\n We&#39;ve never believed that creating a Radar remotely was possible, and yet here we are — this is the first Radar we&#39;ve ever produced without meeting in person. Many of the proposed blips spoke to the pressing need to enable first-class remote collaboration. We didn&#39;t want to ignore the elephant in the room and  not comment on the crisis, but doing a good job of remote-first collaboration is a deep and nuanced subject and certainly not all of our advice would fit in the Radar format. So alongside this edition you&#39;ll find  a podcast where we discuss our experiences in creating the Radar remote-first, a written experience report including advice on remote-first productivity, a  webinar covering tech strategies in a crisis and links to other ThoughtWorks materials, including our  remote working playbook. We hope that these materials, together with other internet resources, will help organizations that attempt to navigate these unknown waters.", "posttime": "2020-05-21 21:23:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "技术,technology,远程", "title": "ThoughtWorks技术雷达第22卷", "title_en": "ThoughtWorks Technology Radar Vol.22", "transed": 1, "url": "https://www.thoughtworks.com/radar", "via": "", "real_tags": ["技术", "远程"]}, {"category": "", "categoryclass": "", "imagename": "5d3a57ef7c894115c864bb1bd4d53a43.jpg", "infoid": 1003114, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "没有什么比金融界两大巨头之间非常公开的口角更好的了。\n在一个角落里，“黑天鹅”的作者纳西姆·尼古拉斯·塔勒布(Nassim Nicholas Taleb)；在另一个角落里，是AQR资本管理公司的创始人克里夫·阿斯内斯(Cliff Asness)。这两个人在推特上用了不合时宜的措辞，都在谈论为极端事件投保是否值得，或者说是所谓的尾部风险对冲。\nTaleb批评了AQR的表现，Asness承认这一点，但表示这是由于市场目前对价值型股票的惩罚。\n事实证明，冠状病毒大流行是尾部风险对冲的绝佳时机-截至4月底，CBOE Eurekaedge尾部风险波动性对冲基金指数的回报率为51.47%。标准普尔500价值指数SP500V，+1.46%今年已经下跌了19%，相比之下，标准普尔500指数下跌了8%，SPX指数下跌了1.66%。", "note_en": "There’s nothing like a very public spat between two titans of the financial world.\n  In the one corner, “Black Swan” author Nassim Nicholas Taleb; in the other, Cliff Asness, the founder of AQR Capital Management. The two took to Twitter with each using unprintable words about whether it’s worth the cost to insure against extreme events, or what’s called tail-risk hedging.\n  Taleb criticized AQR’s performance, which Asness acknowledges but says is due to the market’s current punishment of value stocks.\n  The coronavirus pandemic has proved to be a terrific time for tail-risk hedging — the CBOE Eurekahedge Tail Risk Volatility Hedge Fund Index has returned 51.47% through the end of April. The S&amp;P 500 value index  SP500V,  +1.46% has dropped 19% this year, compared to the 8% fall for the broader S&amp;P 500  SPX,  +1.66% .", "posttime": "2020-05-21 21:23:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,asness,指数", "title": "Taleb和Asness在推特上就尾部风险对冲问题争执不下", "title_en": "Taleb and Asness feud on Twitter over tail-risk hedging", "transed": 1, "url": "https://www.marketwatch.com/story/finance-titans-taleb-and-asness-feud-on-twitter-2020-05-21?mod=home-page", "via": "", "real_tags": ["推特", "asness", "指数"]}, {"category": "", "categoryclass": "", "imagename": "0cb21b060b3440ef9af7c09e3e5eabf5.jpg", "infoid": 1003113, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新西兰总理杰辛达·阿德恩(Jacinda Ardern)表示，在冠状病毒危机之后，每周工作四天可能有助于重建国家经济。本周早些时候，Ardern在Facebook Live上提出了这个想法。\n周二，Ardern在新西兰旅游中心罗托鲁亚发表讲话，他提出了一系列建议，这些建议可能有助于推动该国至关重要的旅游业的发展，包括缩短每周工作时间，这可能会鼓励公民更多地旅行。\n我听到很多人建议我们应该实行一周四天工作制，阿德恩说。归根结底，这实际上是雇主和雇员之间的问题。但正如我已经说过的，我们学到了太多关于COVID的知识，了解了人们在家工作的灵活性，以及可以从这种灵活性中释放出来的生产力。\n她补充说，如果你是一名雇主，并且有能力这样做，我真的会鼓励人们考虑这一点，考虑这是否适合你的工作场所，因为这肯定会促进全国各地的旅游业。\n刚刚结束在罗托鲁瓦的访问-我想分享一些来自我们旅游业的东西…。\n杰辛达·阿德恩(Jacinda Ardern)于2020年5月18日(星期一)发布。\nArden说，国内旅游约占该行业的60%，但新西兰人在国际旅游上的支出约为90亿美元(NZD)。\n根据该国去年12月发布的官方统计数据，旅游业创造了约162亿美元的收入，占新西兰GDP的5.8%。旅游业直接就业近23万人，约占全国就业总人数的8.4%。\nArdern因对大流行的反应而受到赞扬。新西兰约500万人口中，已有略高于1500例确诊病例和21例死亡病例。4月下旬，她宣布该国暂时赢得了对抗广泛的社区传播冠状病毒的战斗。\n在新西兰没有广泛的、未被检测到的社区传播。我们已经赢得了这场战斗，阿德恩在4月27日说。但是，如果我们要保持这种状态，我们就必须保持警惕。\n去年，在冠状病毒大流行之前，微软尝试了每周工作四天的新想法，结果令人振奋。据这家软件制造商称，生产率提高了40%。人力资源管理协会(Society For Human Resource Management)2019年6月发布的一份报告称，在接受调查的2700多家美国公司和组织中，现在有15%的公司和组织为员工提供每周四天工作制，高于2017年的12%。\n报告指出，虽然每周四天工作制仍然相对少见，但实施这一工作制的组织报告称，生产率或收入并没有因此而下降。", "note_en": "New Zealand Prime Minister Jacinda Ardern says a four-day workweek could help rebuild the nation&#39;s economy in the wake of the  coronavirus crisis. Ardern floated the idea during a  Facebook Live earlier this week.\n  Speaking Tuesday from Rotorua, a tourist hub in New Zealand, Ardern brought up a flurry of suggestions that could help jumpstart the country&#39;s vital tourism industry, including the shorter workweek, which could encourage citizens to travel more.\n &#34;I hear lots of people suggesting we should have a four-day week,&#34; Ardern said. &#34;Ultimately that really sits between employers and employees. But as I&#39;ve said there&#39;s just so much we&#39;ve learnt about COVID and that flexibility of people   working from home, the productivity that can be driven out of that.&#34;\n  &#34;I&#39;d really encourage people to think about that if you&#39;re an employer and in a position to do so to think about whether or not that is something that would work for your workplace because it certainly would help tourism all around the country,&#34; she added.\n Just finishing up a visit in Rotorua - thought I’d share some of the things coming through from our tourism industry...\nPosted by  Jacinda Ardern on Monday, May 18, 2020\n Arden said domestic tourism makes up about 60% of the industry, but New Zealanders spend about $9 billion (NZD) on tourism internationally.\n  According to the country&#39;s  official statistics, released in December, tourism generated about $16.2 billion,  or 5.8% of New Zealand&#39;s GDP. Nearly 230,000 people were directly employed in tourism — about 8.4% of the total number of people employed in the country.\n  Ardern has been praised for her response to the pandemic. New Zealand has had just over  1,500 confirmed cases and 21 deaths in a population of about 5 million. In late April, she announced the country has   &#34;won&#34; the battle against widespread community transmission of the coronavirus for the time being.\n &#34;There is no widespread, undetected community transmission in New Zealand. We have won that battle,&#34; Ardern said on April 27. &#34;But we must remain vigilant if we are to keep it that way.&#34;\n Microsoft tried the   idea of four-day work week last year, before the coronavirus pandemic, with promising results. Productivity rose 40%, according to the software maker. A June 2019  report from the Society for Human Resource Management said 15% of more than 2,700 American companies and organizations  surveyed now offer a four-day work week option to employees, up from 12% in 2017.\n &#34;While four-day workweeks are still relatively uncommon, organizations that have implemented them report no decreases to productivity or revenue as a result,&#34; the report stated.", "posttime": "2020-05-21 21:01:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "冠状病毒,病毒,总理,pm,旅游业", "title": "新西兰总理在冠状病毒感染后标记四天工作周以提振关闭的经济", "title_en": "New Zealand PM Flags Four-Day Workweek To Boost Its Shuttered Economy After COVID-19", "transed": 1, "url": "https://www.cbsnews.com/news/new-zealand-four-day-workweek-jacinda-ardern/", "via": "", "real_tags": ["冠状病毒", "病毒", "总理", "pm", "旅游业"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003112, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "防锈分析器是一个新的IDE后端，用于防锈编程语言。支持Open Collective上的防锈分析器。\n在过去的几个月里，我一直忙于战壕中的生锈分析仪工作。今天，我不由自主地决定退一步，想想更长远的生锈分析仪路线图。\n以下是我(@matklad)对此事的个人想法，它们不一定反映ide或编译团队的共识观点：-)。\n对我来说，Ruust分析器最令我惊讶的一个方面是它已经很有用了。今天，我编写了Ruust代码，享受着快速的代码完成、大部分正确的转到定义和过多的帮助。甚至宏内的语法突出显示也起作用了！\n我对锈蚀分析器的最初计划是编写一到两年的快速技巧，以演示概念验证IDE支持，这是值得努力而不是最终产品的东西。显然，我们已经大大超过了这个目标：今天人们依赖锈蚀分析器进行高效的锈蚀编程。这创造了它自己的机会和危险，这就给这份规划文档提供了信息。\n今天人们编写了大量的锈蚀代码，他们至少应该得到基线级别的IDE支持。我认为我们当前的目标是使锈蚀分析器在当前状态下更易于使用，从而有效地实现RFC2912。\n锈检仪端的编程工作量相对较小：我们需要修复各种协议一致性问题，清理各种缺省值以减少实验性，编写不需要太多热情就能理解的文档等等。组织人员的数量要大得多，我们需要用Rustup打包锈检分析器，合并 - 和锈检分析器VS代码扩展，弄清楚存储库结构等。\n另外，我想确保防锈分析仪可以在大型非货运单库中使用。我们已经对此提供了一些初步支持，但还有一堆细节需要解决。\n我看到的主要危险是锈谱仪在目前的状态下可能会僵化。这将是不好的，因为虽然目前的锈谱仪架构大体上是正确的，但许多重要的和难以改变的细节是错误的。在我们将锈谱仪推向公众之后，我们应该把重点放在枯燥的实施和设计工作上，相对较少的闪亮的GIF和大量的基础工作在未来十年内。\n生锈分析仪使用粉笔作为特性解算器已经有很长一段时间了，如果能完成这项工作，并将其集成到生锈分析中，给人们带来他们的GATS，那就太好了。\n我们应该在rustc和ruust分析器之间共享解析器。从IDE的观点来看，解析是编译器最有趣的部分之一。通过将rustc转换为无损语法，我们将跨越最重要的障碍，从那时起它将是一条下坡路。我认为这里的设计空间很容易理解，但要做的工作很多。在某个时候，我应该暂时不再积极研究rustc，而是专注于共享解析器。\nRust-Analyzer中最基本的数据结构，甚至比语法树更基本的数据结构是VFS，即虚拟文件系统。它有两个目标：\n这种抽象是Ruust分析器的纯功能世界和外部世界的混乱之间的边界。它需要将不区分大小写的文件系统、符号链接和循环连接到一个更简单的树模型，其中包含我们想要的UTF8路径。此外，它还应该与非路径文件一起使用：在某些用例中，我们想要分析RuST代码，而这些代码并不真正驻留在文件系统中。\n我正在努力解决的一个具体方面是动态性。一方面，似乎一个好的设计是要求预先将VFS中的文件集指定为一个全局集。这一点很重要，因为要正确注册文件监视器而不丢失更新，您需要急于抓取文件系统。然而，预先指定一组全局会使稍后更改该集变得混乱。\n我很想知道这方面的现有解决方案。我有一个具体的问题是：&#34；看守人如何处理项目的动态添加/删除？&#34；。如果您有任何经验要分享，请在防锈分析仪中评论VFS问题。理想情况下，我们将VFS变成一个板条箱。IO板条箱，因为它似乎通常很有用，并且可以封装相当多的复杂性。\n当前vfs为…。​不太好，我不喜欢在上面建生锈分析仪。\n目前，proc-宏是作为动态库实现的，可以加载到编译器进程中。这对编译器来说已经足够了，但对于IDE来说却相当不合适：\n目前，我们通过在单独的进程中运行proc-宏来掩盖这一点，并且从不使proc-宏缓存无效，但这感觉像是一次黑客攻击，而且实现复杂性很高。如果proc-宏是确定性的，并且根据定义是可控的，那会更好，而WASM可以给我们提供这一点。\n我有点担心这会受到那些希望在编译时通过TCP连接到数据库的人的反对：)从长远来看，我认为保证确定性编译是非常重要的，不管IDE的情况如何。\nIDE可以利用一个非常重要的语言属性来大幅提高性能：\n如果可以在不查看其他函数体的情况下对函数体进行类型检查，则可以通过大幅减少需要执行的工作量来加快IDE的运行速度。\n如果我们想要快速而正确的IDE支持，我们应该通过版本机制将其从语言中逐步淘汰。\n请注意，impl特征的自动特征泄漏问题不大，因为如果调用函数，您只需要检查函数的主体。当然，作为IDE作者，我希望要求指定自动特征，但作为语言用户，我更喜欢当前的设计。\n铁锈分析器采用了一种新颖的、相当高科技的基于查询的体系结构进行增量计算。今天，很明显，这种通用的方法非常适合IDE用例。但是，我对具体的细节有很多疑问。我觉得今天的铁锈分析器缺乏机械上的同情心，留下了大量的性能。很多内部数据结构都是堆分配的弧滴，我们过度使用散列和未充分使用索引，我们甚至没有内部标识符！\n要了解编译器前端的速度有多快，我强烈推荐查看用于Ruby的类型检查器Sorbet。您可以从以下两个链接开始：\n这项工作给了我很大的启发，但也让我感到尴尬的是，生锈分析仪与那种原始的性能和简单性相去甚远。\n我认为部分原因是本质上的复杂性，HashMap的名称解析和宏扩展都很困难，但我也想知道我们是否可以将SALSA更改为使用基于 - 的arenas，而不是HashMap中的Arc。\n目前锈检分析器的一个特点是不将缓存持久化到磁盘上，在锈检分析器中打开项目意味着我们在处理标准库和依赖项时需要等待十几秒。\n我认为这一限制实际上是一项非常有价值的资产！它迫使我们保持非增量代码路径相当快。\n我认为我们实际上根本不需要持久缓存是合理的。RUST分析器基本上是文本处理，输入的大小是几十兆字节(无论如何我们都忽略了其中的大部分)。如果我们不在这里和那里降低性能，并将工作放在所有的内核上，我们应该能够在合理的时间预算内从头开始加载项目。\n这里的第一步将是建立持续基准和性能调优的文化。\n我们已经成功地使用了锈蚀分析器来锻造一个可以在IDE中工作的体系结构。现在是时候试验一下像所有锈蚀代码一样快速工作的体系结构了：-)\n在我看来，决定项目长期成功的两个重要特征是：\n构建用于测试的项目的发布版本需要多长时间？\n我对铁锈分析器的测试速度非常满意。我在IntelliJ中的一个错误是添加了许多使用Rust标准库的测试，因此速度很慢。在铁锈分析器中，只有三个超级集成的测试需要真正的libstd，所有其他的测试都是从内存中只包含相关STD位的设备进行工作的。\n但构建时间还有很多需要改进的地方。这一点非常重要， - 您构建代码的速度越快，做其他任何事情的速度就越快。请注意，即使是为了缩短构建时间，您也需要更快的构建时间！最近，我试图在Ruust-Analyzer中进行一些编译时优化，并测量“现在编译是否更快？”需要很长时间，所以只需尝试较少的不同优化！\n这里最大的问题是，作为一种语言，Rust很难快速编译。我经常遇到的一个具体问题是，更改深度依赖项会重新编译世界。这与C/C++相反，在C/C++中，如果不接触任何.h文件，更改依赖项只需要重新链接。理论上，通过自动从cratts派生公共头文件，我们可以在Rust中拥有类似的东西。虽然我担心，如果没有显式的、物理的“这是ABI”边界，它在保持编译方面的效率会低得多。\n顺便说一句，如果Rust坚持使用.crate文件，实现IDE支持会容易得多：-)。\n尽管如此，生锈分析仪要比生锈容易造得多，我相信我们也可以为生锈做很多事情。\n关于这一点，我已经在IRO上写了很长时间。要点是，我认为我们可以将rustc拆分成前端的文本处理部分，以及后端的LLVM、链接器和现实部分。那么，从理论上讲，前端部分可能是一个沼泽标准的Rust项目，它完全不依赖IO、外部工具或C++代码。\n这里的一个问题是，目前rustc测试套件主要由UI和Run-pass测试集成组成，它们通过构建整个编译器来工作。这样的测试套件非常适合测试一致性和捕获回归，但不太适合快速TDD。我认为我们应该努力构建一个单元测试套件，例如，它可以在不构建类型检查器的情况下轻松地测试名称解析，并且不需要stdlib。\n最后，这里的所有变化都是对现有软件体系的深度削减。推动如此雄心勃勃的项目完成需要人们，他们可以投入大量的时间和精力。直截了当地说，我们需要更多全职从事IDE工具的有偿工作的人员。我感谢我在铁业系统公司的同事们，他们投入了大量的精力使这成为现实。\n如果您觉得铁锈分析仪很有用，并且是专业使用的，请考虑请贵公司通过我们的公开征集赞助铁锈分析仪。个人海绵也可以接受(非常感谢！)", "note_en": "rust-analyzer is a new &#34;IDE backend&#34; for the  Rust programming language.Support rust-analyzer on  Open Collective.\n During the past several months, I’ve been swamped with in-the-trenches rust-analyzer work.Today, I spontaneously decided to take a step back and think about longer-term &#34;road map&#34; for rust-analyzer.\n What follows is my ( @matklad) personal thoughts on the matter, they not necessary reflect the consensus view of ide or compiler teams :-)\n One of the most surprising aspects of rust-analyzer for me is how useful it already is.Today, I write Rust code enjoying fast code-completion, mostly correct go to definition and plethora of assists.Even syntax highlighting inside macros works!\n My original plan for rust-analyzer was to write a quick one-to-two-year hack to demonstrate a proof-of-concept IDE support, something to strive for rather than a finished product.Obviously, we have massively overshot this goal: people depend on rust-analyzer for productive Rust programming today.This creates its own opportunities and dangers, which inform this planning document.\n People write a ton of Rust today, and they deserve at least a baseline level of IDE support.I think our immediate goal is to make rust-analyzer easier to use in its current state, effectively implementing  RFC2912.\n The amount of programming work on rust-analyzer side is relatively small here:we need to fix various protocol conformance issues,clean up various defaults to be less experimental,write documentation which doesn’t require a lot of enthusiasm to understand, etc.The amount of org stuff is much bigger — we need to package rust-analyzer with rustup, merge the RLS and rust-analyzer VS Code extensions, figure out repository structure, etc.\n Separately, I want to make sure that rust-analyzer is usable inside large non-Cargo based monorepos.We have some initial support for this already, but there’s a bunch of details we need to iron out.\n The main danger I see is that rust-analyzer can ossify in its present state.This would be bad, because, although current rust-analyzer architecture is right in broad strokes, a lot of important and hard-to-change details are wrong.After we push rust-analyzer to the general public, we should focus on boring implementation &amp; design work, with relatively few shiny gifs and a lot of foundational work for the next decade.\n rust-analyzer has been using chalk as its trait solver for a long time now.It would be good to finish the work, and integrate it into rustc as well,  and give people their GATs.\n We should share the parser between rustc and rust-analyzer already.Parsing is one of the most interesting bits of the compiler, from the IDE point of view.By transitioning rustc to a lossless syntax we’ll cross the most important barrier, and it will be a downhill road from that point on.The design space here I think is well-understood, but the amount of work to do is large.At some point, I should take a break from actively hacking on rust-analyzer and focus on sharing the parser.\n The most fundamental data structure in rust-analyzer, even more fundamental than a syntax tree, is the VFS, or Virtual File System.It serves two dual goals:\n  This abstraction is the boundary between the pure-functional universe of rust-analyzer, and the messiness of the external world.It needs to bridge case-insensitive file systems, symlinks and cycles to a simpler model of &#34;tree with utf8 paths&#34; we want inside.Additionally it should work with non-path files: there are use-cases where we want to do analysis of Rust code, which doesn’t really reside on the file system.\n One specific aspect I am struggling with is dynamism.On the one hand, it seems that a good design is to require to specify the set of files in VFS upfront, as a set of globs.This is important because, to properly register file watchers without losing updates, you need to crawl the file-system eagerly.However, specifying a set of globs up-front makes changing this set later messy.\n I would be curious to hear about existing solutions in this area.One specific question I have is: &#34;How does watchman handle dynamic addition/removal of projects?&#34;.If you have any experience to share, please comment on the VFS issue in rust-analyzer.Ideally, we turn VFS into just a crates.io crate, as it seems generally useful, and can encapsulate quite a bit of complexity.\n The current VFS is …​ not great, I don’t feel comfortable building rust-analyzer on top of it.\n At the moment, proc-macros are implemented as dynamic libraries, loadable into the compiler process.This works ok-enough for the compiler, but is a pretty bad fit for an IDE:\n  At the moment, we paper over this by running proc-macros in a separate process and never invalidating proc-macro caches, but this feels like a hack and has high implementation complexity.it would be much better if proc-macros were deterministic and controllable by definition, and WASM can give us that.\n I am slightly worried that this will get push-back from folks who want to connect to databases over TCP at compile time :)Long term, I believe that guaranteeing deterministic compilation is hugely important, irrespective of IDE story.\n There’s a very important language property that an IDE can leverage to massively improve performance:\n  If it is possible to type-check the body of a function without looking at the bodies of other functions, you can speed up an IDE by drastically reducing the amount of work it needs to do.\n   If we want to have fast &amp; correct IDE support, we should phase out those from the language via edition mechanism.\n Note that auto-trait leakage of impl Trait is not nearly as problematic, as you only need to inspect a function’s body if you call the function.Of course, as an IDE author I’d love to require specifying auto-traits, but, as a language user, I much prefer the current design.\n rust-analyzer uses a novel and rather high-tech query-based architecture for incremental computation.Today, it is clear that this general approach fits an IDE use-case really well.However, I have a lot of doubts about specific details.I feel that today rust-analyzer lacks mechanical sympathy and leaves a ton of performance on the table.A lot of internal data structures are heap-allocated  Arc-droplets, we overuse hashing and underuse indexing, we don’t even intern identifiers!\n To get a feeling of how blazingly fast compiler front-ends can be, I highly recommend checking out Sorbet, type checker for Ruby.You can start with these two links:\n  I am very inspired by this work, but also embarrassed by how far rust-analyzer is from that kind of raw performance and simplicity.\n Part of that I think is essential complexity — Rust’s name resolution and macro expansion are  hard.But I also wonder if we can change salsa to use  Vec-based arenas, rather than  Arcs in  HashMaps.\n One of the current peculiarities of rust-analyzer is that it doesn’t persist caches to disk.Opening project in rust-analyzer means waiting a dozen seconds while we process standard library and dependencies.\n I think this &#34;limitation&#34; is actually a very valuable asset!It forces us to keep the non-incremental code-path reasonably fast.\n I think it is plausible that we don’t actually need persistent caches at all.rust-analyzer is basically text processing, and the size of input is in tens of megabytes ( and we ignore most of those megabytes anyway).If we just don’t lose performance here and there, and throw the work onto all the cores, we should be able to load projects from scratch within a reasonable time budget.\n The first step here would be establishing the culture of continuous benchmarking and performance tuning.\n We’ve already successfully used rust-analyzer for forging an architecture which works in IDE at all.Now it’s time to experiment with architecture which works,  fast, just as all Rust code should :-)\n In my opinion the two important characteristics that determine long-term success of a project are:\n How long does it take to build a release version of the project for testing?\n I am very happy with the testing speed of rust-analyzer.One of my mistakes in IntelliJ was adding a lot of tests that use Rust’s standard library and are slow for that reason.In rust-analyzer, there are only three uber-integrated tests that need the real libstd, all others work from in-memory fixtures which contain only the relevant bits of std.\n But the build times leave a lot to be desired.And this is hugely important — the faster you can build the code, the faster you can do everything else.Heck, even for improving build times you need fast build times!I was trying to do some compile-time optimizations in rust-analyzer recently, and measuring “is it faster to compile now?” takes a lot of time, so one has to try fewer different optimizations!\n The biggest problem here is that Rust, as a language, is hard to compile fast.One specific issue I hit constantly is that changing a deep dependency recompiles the world.This is in contrast to C/C++ where, if you don’t touch any  .h files, changing a dependency requires only re-linking.In theory, we can have something like this in Rust, by automatically deriving public headers from crates.Though I fear that without explicit, physical “this is ABI” boundary, it will be much less effective at keeping compile times under control.\n As an aside, if Rust stuck with  .crate files, implementing IDE support would have been much easier :-)\n Nonetheless, rust-analyzer is much easier to build than rustc.I believe there’s a lot we can do for rustc build as well.\n I’ve written at length about this on  irlo.The gist is that I think we can split rustc into a front-end &#34;text-processing&#34; part, and backend &#34;LLVM, linkers and real world&#34; part.The front bit then could, in theory, be a bog standard Rust project, which doesn’t depend on IO, external tools or C++ code at all.\n One wrinkle here is that rustc test suite at the moment consists predominantly of UI and run-pass tests integration, which work by building the whole compiler.Such a test suite is ideal for testing conformance and catching regressions, but is not really well suited for rapid TDD.I think we should make an effort to build a unit test suite a-la rust-analyzer, such that it’s easy, for example, to test name resolution without building the type checker, and which doesn’t require stdlib.\n Finally, all changes here represent deep cuts into an existing body of software.Pushing such ambitious projects to completion require people, who can dedicate significant amounts of their time and energy.To put it bluntly, we need more dedicated folks working on the IDE tooling as a full time, paid job.I am grateful to my colleagues at  Ferrous Systems who put a lot of energy into making this a reality.\n If you find rust-analyzer useful and use it professionally, please consider asking your company to sponsor rust-analyzer via our  Open Collective.Sponsorships from individuals are also accepted (and greatly appreciated!).", "posttime": "2020-05-21 21:00:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,分析仪,analyzer,需要", "title": "铁锈分析仪：未来几年", "title_en": "Rust Analyzer: Next few years", "transed": 1, "url": "https://rust-analyzer.github.io/blog/2020/05/18/next-few-years.html", "via": "", "real_tags": ["rust", "分析仪", "analyzer", "需要"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003108, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PostgreSQL全球开发集团宣布，PostgreSQL 13的第一个测试版现已可供下载。此版本包含PostgreSQL 13最终版本中所有可用功能的预览，不过在此之前，该版本的一些细节可能会更改。\n您可以在发行说明中找到有关PostgreSQL 13中所有功能和更改的信息：\n本着开源PostgreSQL社区的精神，我们强烈建议您在您的系统中测试PostgreSQL13的新功能，以帮助我们消除任何可能存在的错误或其他问题。虽然我们不建议您在您的生产环境中运行PostgreSQL 13 Beta 1，但我们建议您设法针对此Beta版本运行您的典型应用程序工作负载。\n您的测试和反馈将帮助社区确保PostgreSQL13版本符合我们的标准，即提供世界上最先进的开源关系数据库的稳定、可靠版本。您可以在这里阅读更多关于我们的测试版测试流程以及如何做出贡献的信息：\nPostgreSQL13中有许多新功能，有助于提高PostgreSQL的整体性能，同时使开发应用程序变得更加容易。\nB树索引，PostgreSQL的标准索引，在处理重复数据的方式上得到了改进。这些增强功能有助于缩小索引大小并提高查找速度，特别是对于包含重复值的索引。\nPostgreSQL13增加了增量排序，当从查询的较早部分排序的数据已经排序时，它可以加速数据排序。此外，带有OR子句或IN/ANY常量列表的查询可以使用扩展统计信息(通过CREATE STATISTICS创建)，这可以带来更好的规划和性能提升。PostgreSQL13现在可以使用磁盘存储对大型聚合集进行散列聚合(用作聚合查询的一部分)。\n在此版本中，PostgreSQL的分区功能有了更多改进，包括增加了分区表之间直接联接的情况，这可以缩短整体查询执行时间。分区表现在支持BEFORE行级触发器，并且分区表现在可以通过逻辑复制完全复制，而无需发布单独的分区。\nPostgreSQL13使用FETCH First with Ties等特性为编写查询带来了更多便利，该特性返回与最后一行匹配的任何附加行。还添加了用于jsonpath查询的.datetime()函数，它会自动将类似日期或类似时间的字符串转换为适当的PostgreSQL日期/时间数据类型。现在生成随机UUID甚至更容易，因为无需保存就可以使用gen_Random_uuid()函数来启用任何扩展。\nPostgreSQL13最令人期待的特性之一是VACUUM命令能够并行处理索引。可以使用VACUAL命令上的新PARALLEL选项(或VANUUMDB上的--PARALLEL)访问此功能，该选项允许您指定用于清理索引的并行工作线程的数量。请注意，这不适用于Full选项。\nreindexdb命令还使用新的--job标志添加了并行度，该标志允许您指定在对数据库重新编制索引时要使用的并发会话数量。\nPostgreSQL13引入了可信扩展的概念，它允许超级用户指定用户可以在其数据库Solong中安装的扩展，因为他们拥有CREATE特权。\n此版本包括更多监视PostgreSQL数据库活动的方法：PostgreSQL13现在可以跟踪WAL使用统计数据和流式基本备份的进度，以及分析命令的进度。pg_basebackup还可以生成一个清单，该清单可用于使用名为pg_verifybackup的新工具验证备份的完整性。现在还可以限制复制槽保留的WAL空间量。\npg_dump的新标志--include-foreign-data在转储输出中包括来自外部数据包装器引用的服务器的数据。\npg_rewind命令在PostgreSQL13中也有改进。除了pg_rewind自动执行崩溃恢复之外，您现在还可以使用它通过--write-recover-conf标志配置备用PostgreSQL实例。pg_rewind还可以使用目标实例的restore_command来获取所需的预写日志。\nPostgreSQL在这个最新版本中继续改进其安全功能，引入了几个功能来帮助进一步安全地部署PostgreSQL。\nlibpq是驱动psql和许多PostgreSQL连接驱动程序的连接库，它包括几个新参数来帮助保护连接。PostgreSQL 13引入了channel_binding连接参数，使客户端可以指定需要将通道绑定功能作为SCRAM的一部分。此外，使用受密码保护的TLS证书的客户端现在可以使用sslpassword参数指定其密码。PostgreSQL13还增加了对DER编码证书的支持。\nPostgreSQL外部数据包装器(Postgres_Fdw)在如何保护连接方面也得到了几个增强，包括能够使用基于证书的身份验证连接到其他PostgreSQL群集。此外，非特权帐户现在可以通过postgres_fdw连接到另一个PostgreSQL数据库，而无需使用密码。\nPostgreSQL13继续改善Windows上的可操作性，因为现在在Windows上运行PostgreSQL的用户现在可以选择通过UNIX域套接字进行连接。\nPostgreSQL13文档增加了术语词汇表，以帮助人们熟悉PostgreSQL和通用数据库的概念。与此同时，表格中的函数和运算符的显示也进行了重大修改，这有助于提高Web和PDF文档的可读性。\n用于性能测试的pgbench实用程序现在支持对其表进行分区的功能，从而更容易对包含分区的工作负载进行基准测试。\npsql现在包括\\warn命令，除了\\warn将数据发送到stderr之外，该命令在输出数据方面与\\echo命令类似。如果您需要有关任何postgresql命令的其他指导，--help标志现在包含一个指向https://www.postgresql.org.的链接。\nPostgreSQL13中还添加了许多其他新特性和改进，其中一些对您的用例可能与上面提到的一样重要，甚至更重要。有关新增和更改功能的完整列表，请参阅发行说明：\n每个PostgreSQL版本的稳定性在很大程度上取决于您(社区)如何使用您的工作负载和测试工具来测试即将到来的版本，以便在PostgreSQL 13正式发布之前发现错误和回归。由于这是一个测试版，因此仍然可以对数据库行为、功能细节和API进行细微的更改。您的反馈和测试将有助于确定新功能的最终调整，因此请在不久的将来进行测试。用户测试的质量有助于确定我们何时可以发布最终版本。\nPostgreSQL维基中公开提供了公开发布的问题列表。您可以在PostgreSQL网站上使用此表单报告错误：\n这是版本13的第一个测试版。PostgreSQL项目将根据测试需要发布更多测试版，随后发布一个或多个候选版本，直到2020年底的最终版本。有关更多信息，请参阅Beta测试页面。", "note_en": "The PostgreSQL Global Development Group announces that the first beta release ofPostgreSQL 13 is now  available for download.This release contains previews of all features that will be available in thefinal release of PostgreSQL 13, though some details of the release could changebefore then.\n You can find information about all of the features and changes found inPostgreSQL 13 in the  release notes:\n  In the spirit of the open source PostgreSQL community, we strongly encourage youto test the new features of PostgreSQL 13 in your systems to help us eliminateany bugs or other issues that may exist. While we do not advise you to runPostgreSQL 13 Beta 1 in your production environments, we encourage you to findways to run your typical application workloads against this beta release.\n Your testing and feedback will help the community ensure that the PostgreSQL 13release upholds our standards of providing a stable, reliable release of theworld&#39;s most advanced open source relational database. You can read more aboutour  beta testing process and howyou can contribute here:\n    There are many new features in PostgreSQL 13 that help improve the overallperformance of PostgreSQL while making it even easier to develop applications.\n B-tree indexes, the standard index of PostgreSQL, received improvements forhow they handle duplicate data. These enhancements help to shrink index size andimprove lookup speed, particularly for indexes that contain repeated values.\n PostgreSQL 13 adds incremental sorting, which accelerates sorting data when datathat is sorted from earlier parts of a query are already sorted. Additionally,queries with OR clauses or IN/ANY constant lists can use extended statistics(created via  CREATE STATISTICS), which can lead to better planning andperformance gains. PostgreSQL 13 can now use disk storage for hash aggregation(used as part of aggregate queries) with large aggregation sets.\n There are more improvements added to PostgreSQL&#39;s partitioning functionality inthis release, including an increased number of cases where a join directlybetween partitioned tables can occur, which can improve overall query executiontime. Partitioned tables now support  BEFORE row-level triggers, and apartitioned table can now be fully replicated via logical replication withouthaving to publish individual partitions.\n PostgreSQL 13 brings more convenience to writing queries with features like FETCH FIRST WITH TIES, which returns any additional rows that match the lastrow. There is also the addition of the  .datetime() function for jsonpathqueries, which will automatically convert a date-like or time-like string to theappropriate PostgreSQL date/time datatype. It is also even easier now togenerate random UUIDs, as the  gen_random_uuid() function can be used withouthaving to enable any extensions.\n  One of the most anticipated features of PostgreSQL 13 is the ability for the VACUUM command to process indexes in parallel. This functionality can beaccessed using the new  PARALLEL option on the  VACUUM command (or --parallel on  vacuumdb), which allows you to specify the number of parallelworkers to use for vacuuming indexes. Note that this does not work with the FULL option.\n The  reindexdb command has also added parallelism with the new  --jobs flag,which lets you specify the number of concurrent sessions to use when reindexinga database.\n PostgreSQL 13 introduces the concept of a &#34;trusted extension&#34;, which allows fora superuser to specify extensions that a user can install in their database solong as they have a  CREATE privilege.\n This release includes more ways to monitor activity within a PostgreSQLdatabase: PostgreSQL 13 can now track WAL usage statistics and the progress ofstreaming base backups, and the progress of an  ANALYZE command. pg_basebackup can also generate a manifest that can be used to verify theintegrity of a backup using a new tool called  pg_verifybackup. It is also nowpossible to limit the amount of WAL space reserved by replication slots.\n A new flag for  pg_dump,  --include-foreign-data, includes data from serversreferenced by foreign data wrappers in the dump output.\n The  pg_rewind command also has improvements in PostgreSQL 13. In addition to pg_rewind automatically performing crash recovery, you can now use it toconfigure standby PostgreSQL instances using the  --write-recovery-conf flag. pg_rewind can also use the  restore_command of the target instance to fetchneeded write-ahead logs.\n  PostgreSQL continues to improve on its security capabilities in this latestrelease, introducing several features to help further deploy PostgreSQL safely.\n libpq, the connection library that powers  psql and many PostgreSQLconnection drivers, includes several new parameters to help secure connections.PostgreSQL 13 introduces the  channel_binding connection parameters, whichlets a client specify that they want to require the channel bindingfunctionality as part of SCRAM. Additionally, a client that is using a passwordprotected TLS certificate can now specify its password using the  sslpasswordparameter. PostgreSQL 13 also adds support for DER encoded certificates.\n The PostgreSQL foreign data wrapper ( postgres_fdw) also received severalenhancements to how it can secure connections, including the ability to usecertificate-based authentication to connect to other PostgreSQL clusters.Additionally, unprivileged accounts can now connect to another PostgreSQLdatabase via the  postgres_fdw without using a password.\n  PostgreSQL 13 continues to improve operability on Windows, as now users whorun PostgreSQL on Windows now have the option to connect over UNIX domainsockets.\n The PostgreSQL 13 documentation adds a  glossaryof terms to help people familiarize themselves with both PostgreSQL and generaldatabase concepts. This coincides with a significant rework in the display offunctions and operators in tables, which helps to improve readability both onthe web and in the PDF documentation.\n The  pgbench utility, used for performance testing, now supports the ability topartition its &#34;accounts&#34; table, making it easier to benchmark workloads thatcontain partitions.\n psql now includes the  \\warn command that is similar to the  \\echo commandin terms of outputting data, except  \\warn sends it to stderr. And in case youneed additional guidance on any of the PostgreSQL commands, the  --help flagnow includes a link to  https://www.postgresql.org.\n  Many other new features and improvements have been added to PostgreSQL 13, someof which may be as or more important to your use case than what is mentionedabove. Please see the  release notesfor a complete list of new and changed features:\n   The stability of each PostgreSQL release greatly depends on you, the community,to test the upcoming version with your workloads and testing tools in order tofind bugs and regressions before the general availability of PostgreSQL 13. Asthis is a Beta, minor changes to database behaviors, feature details, and APIsare still possible. Your feedback and testing will help determine the finaltweaks on the new features, so please test in the near future. The quality ofuser testing helps determine when we can make a final release.\n A list of  open issuesis publicly available in the PostgreSQL wiki. You can report bugs using this form onthe PostgreSQL website:\n   This is the first beta release of version 13. The PostgreSQL Project willrelease additional betas as required for testing, followed by one or morerelease candidates, until the final release in late 2020. For furtherinformation please see the  Beta Testing page.", "posttime": "2020-05-21 20:34:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,postgresql,beta", "title": "PostgreSQL 13 Beta 1发布", "title_en": "PostgreSQL 13 Beta 1 Released", "transed": 1, "url": "https://www.postgresql.org/about/news/2040/", "via": "", "real_tags": ["发布", "beta"]}, {"category": "", "categoryclass": "", "imagename": "3b4f6c9c6fad84050624411007c29304.jpg", "infoid": 1003106, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软最初的Xbox控制台源代码已经在网上泄露，同时泄露的还有一个版本的Windows NT 3.5的代码。Xbox源代码包括原始控制台(Windows2000的自定义版本)上操作系统的内核。我们可以确认泄露的Xbox操作系统是真的，并于本月早些时候出现在网上。微软的一位发言人在给The Verge的一份声明中说：“我们知道这些报道，并正在进行调查。”\n虽然Xbox OS泄漏包括一些构建环境、Xbox开发工具包、用于测试的仿真器和内部文档，但我们知道这个内核和源代码以前曾在爱好者中私下传播过。这意味着它不太可能进一步帮助原创Xbox游戏的自制和仿真器的努力。\nXbox有许多模拟器，包括CXBX、XQEMU和CXBX重新加载，但大多数都很难模拟原始的Xbox操作系统和内核。微软开发了第一个考虑到x86硬件的Xbox，但Xbox内核是基于支持DirectX 8的Windows2000的定制和精简版本。\n多年来，非官方的仿真器一直试图复制这个内核，但到目前为止，与原始Xbox可用的900款游戏相比，只有大约40款游戏的仿真支持有限。微软有自己专有的模拟Xbox和Xbox360游戏，但目前只能在Xbox One游戏机上使用，而不能在Windows PC上使用。\n在Xbox泄露的同时，Windows NT3.5接近最终版的源代码也出现在了网上。源代码包括所有必要的构建工具，应该可以让发烧友深入研究旧的操作系统。由于Windows3.5的支持已于2001年12月结束，该操作系统仅在全球范围内的一小部分系统中使用，因此源代码泄露并不是一个重大的安全问题。\n多年来，微软在很大程度上保护了其专有Windows和Xbox源代码。Windows 2000和NT 4的部分源代码早在2004年就泄露了，甚至一些Windows 10源代码也在2017年发布到了网上。我们要求微软对Windows NT 3.5源代码泄露事件发表评论，但该公司表示，对于这一特定事件，它没有什么可分享的。", "note_en": "Microsoft’s original Xbox console source code has leaked online, alongside code for a version of Windows NT 3.5. The Xbox source code includes the kernel for the operating system on the original console, a custom version of Windows 2000. We can confirm the leaked Xbox OS is genuine, and appeared online earlier this month. “We’re aware of these reports and are investigating,” a Microsoft spokesperson said in a statement to  The Verge.\n While the Xbox OS leak includes some build environments, the Xbox Development Kit, emulators used for testing, and internal documents, we understand this kernel and source code has been passed around privately among enthusiasts previously. That means it’s unlikely to help further homebrew and emulator efforts for original Xbox games.\n A number of emulators exist for the Xbox, including CXBX, XQEMU, and CXBX Reloaded, but most have struggled to emulate the original Xbox OS and kernel. Microsoft developed the first Xbox with x86 hardware in mind, but the Xbox kernel was based on a custom and stripped down version of Windows 2000 with DirectX 8 support.\n   Unofficial emulators have tried to replicate this kernel for years, but so far only around 40 games have limited emulation support compared to the 900 games available for the original Xbox. Microsoft has its own proprietary emulation Xbox and Xbox 360 games, but it’s only currently available on Xbox One consoles and not on Windows PCs.\n Alongside the Xbox leak, source code for a near-final version of Windows NT 3.5 has also appeared online. The source code includes all the necessary build tools, and should allow enthusiasts to dig into the old operating system. As Windows 3.5 support ended in December 2001, the operating system is only used in a small number of systems worldwide so a source code leak isn’t a significant security issue.\n Microsoft has largely protected its proprietary Windows and Xbox source code over the years. Partial Windows 2000 and NT 4 source code  leaked back in 2004, and even some  Windows 10 source code was posted online in 2017. We asked Microsoft to comment on the Windows NT 3.5 source code leak, but the company says it has nothing to share about this particular incident.", "posttime": "2020-05-21 19:49:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,代码,xbox", "title": "Xbox和Windows NT 3.5源代码在线泄露", "title_en": "Xbox and Windows NT 3.5 source code leaks online", "transed": 1, "url": "https://www.theverge.com/2020/5/21/21265995/xbox-source-code-leak-original-console-windows-3-5", "via": "", "real_tags": ["windows", "代码", "xbox"]}, {"category": "", "categoryclass": "", "imagename": "6a62b5124ac1ebccc878da504d110602.jpg", "infoid": 1003105, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2019年7月，有争议的G2A Marketplace背后的G2A公司提出向独立审计师开放其交易历史。其目标是澄清其在多年来被指控帮助促进赃物销售后的任何不当行为。只有一家开发商接受了他们的报价。现在G2A将自愿向他们支付近4万美元。\n在其众多业务线中，波兰人拥有的、总部位于香港的G2A经营着一个店面，来自世界各地的用户可以在这里销售游戏密钥。它将这项服务与亚马逊和eBay等零售商相提并论。多年来，各种规模的开发商都抱怨说，G2A市场允许出售赃物。这种情况导致了现实世界中开发商和G2A员工之间的大声比赛和质问。\n2019年，G2A提出了它声称的大胆提议，承诺在其市场上出售的任何以欺诈方式获得的游戏密钥的价值都是10倍。只有一个问题：开发人员必须与G2A和独立审计师合作。只有一家公司，捷克的独立开发商WUBE Software-Factorio的制造商-签署了该计划。G2A当时告诉Polygon，它打算聘请普华永道(Pricewaterhouse Coopers)、安永(Ernst&amp；Young)、毕马威(KMPG)或德勤(Deloitte)进行审计。\n不幸的是，根据周三发布的一篇博客文章，G2A无法与这些大公司达成协议，只能自己进行审计。\n“WUBE向G2A报告了一份它认为在网上非法出售的321把钥匙的名单，”G2A在博客文章中说。“在评估了多家独立审计公司后，发现没有一家符合我们同意的要求，WUBE和G2A决定G2A应继续进行内部调查。这项调查证实，在2016年3月至2016年6月期间，WUBE的198把钥匙通过其Marketplace出售。\n因此，GamesIndustry.biz报道说，G2A已经向WUBE支付了39600美元，正如承诺的那样，这是有问题的全价游戏密钥价值的10倍。\n在其帖子中，G2A不接受允许非法获得的密钥出售的指责。\nG2A在这篇博客文章中称：“当我们推出这一报价时，我们想向博彩界发出一个明确的信息，那就是欺诈行为伤害了各方。”正如我们在本博客中阐明的那样，欺诈直接伤害了购买非法钥匙的个人，它伤害了游戏开发商，最终伤害了G2A，因为作为交易促进者，我们被迫支付与销售相关的成本。我们想要放大这一信息，吸引人们的注意。“\n它接着补充说，展望未来，它现在承诺全额补偿开发商“通过G2A Marketplace出售的任何密钥，如果他们能够证明自己是非法的”所产生的任何费用。\nG2A的一位发言人表示：“我们将是第一个承认，在我们作为一家公司的形成时期，我们花了太长时间才意识到少数人在滥用我们的市场。”“然而，我们收到的批评给我们敲响了警钟，在过去的几年里，我们一直致力于解决我们网站上的任何欺诈事件。今天，我们使用了数字产品在线市场中一些最复杂的专有反欺诈人工智能技术。“", "note_en": "In July 2019, G2A, the company behind the controversial  G2A Marketplace, offered to open its transaction history to  an independent auditor. The goal was to clear its name of any wrongdoing after years of accusations it helps facilitate the sale of stolen goods. Only a single developer took them up on the offer. Now G2A will voluntarily pay them  nearly $40,000.\n Among its many lines of business, the Polish-owned and Hong Kong-based G2A runs a storefront where users from around the world can sell game keys. It likens that service to retailers like Amazon and eBay. Developers of all sizes have complained for years that the G2A Marketplace allows for the sale of stolen goods. The situation has led to  shouting matches and heckling between developers and G2A employees in the real world.\n In 2019, G2A made what it claimed to be a bold offer, promising 10 times the value of any fraudulently obtained game keys sold on its marketplace. There was only one catch: Developers  had to work with G2A and an independent auditor. Only one company, Czech-based independent developer Wube Software — makers of  Factorio — signed on to the program. G2A  told Polygon at the time that it intended to use either PricewaterhouseCoopers, Ernst &amp; Young, KMPG or Deloitte to perform the audit.\n Unfortunately, according to  a blog post issued on Wednesday, G2A couldn’t come to terms with those large firms and just did the audit themselves.\n “Wube reported to G2A a list of 321 keys that it believed had been sold online illegitimately,” G2A said in the blog post. “After assessing a number of independent auditing companies and finding none that would meet our agreed requirements, Wube and G2A decided that G2A should proceed with an internal investigation. This investigation confirmed that 198 of Wube’s keys had been sold via its Marketplace between March 2016 — June 2016.”\n As a result, GamesIndustry.biz  reports that G2A has paid out $39,600 to Wube, which is — as promised — 10 times the value of the full-price game keys in question.\n In its post, G2A accepts no blame for allowing the illegally obtained keys to be sold.\n “When we launched this offer, we wanted to send a clear message to the gaming community that fraud hurts all parties,” G2A said in the blog post. “As we spell out in this blog, fraud directly hurts individuals who buy illegitimate keys, it hurts gaming developers and it ultimately hurts G2A because we are forced — as the transaction facilitator — to cover costs related to the sale. We wanted to amplify that message and capture people’s attention.”\n It went on to add that, going forward, it is now committed to compensating developers in full for any fees incurred “for any keys sold via G2A Marketplace, if they are able to prove they were illegitimate.”\n  “We would be the first to admit that, in our formative years as a company, we took too long to recognize that a small number of individuals were abusing our Marketplace,” said a G2A spokesperson. “However, the criticism we received was the wake-up call we needed, and over the last years we have been totally committed to tackling any incidents of fraud on our site. Today we use some of the most sophisticated proprietary anti-fraud AI technology of any online marketplace for digital products.”", "posttime": "2020-05-21 19:48:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,开发,pays,g2a", "title": "G2A向Factorio开发商支付39,600美元，超过非法获得的游戏密钥", "title_en": "G2A pays Factorio developer $39,600 over illegally obtained game keys", "transed": 1, "url": "https://www.polygon.com/2020/5/20/21265275/g2a-confirms-it-sold-stolen-game-keys", "via": "", "real_tags": ["游戏", "开发", "pays", "g2a"]}, {"category": "", "categoryclass": "", "imagename": "1371b10bb560bfeaec056e20f066d2bb.png", "infoid": 1003104, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这意味着你可以自由复制和分享这些漫画(但不能出售它们)。更多细节。", "note_en": "This means you&#39;re free to copy and share these comics (but not to sell them).  More details.", "posttime": "2020-05-21 19:04:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电影,记号,分享", "title": "英语字母表中第二十四个字母 / X 记号 / 成人电影 / 未知数", "title_en": "X", "transed": 1, "url": "https://xkcd.com/2309/", "via": "", "real_tags": ["电影", "记号", "分享"]}]