[{"category": "", "categoryclass": "", "imagename": "5e23f8e7c96e887d989aa8507a83cd5f.jpeg", "infoid": 1002727, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们将发布Spleeter，以帮助音乐信息检索(MIR)研究团体利用最先进的源分离算法的力量。它以基于TensorFlow的Python库的形式出现，带有用于2、4和5个词干分离的预先训练的模型。Spleeter将在代尔夫特举行的2019年ISMIR会议上进行展示和现场演示。\n虽然不是一个广为人知的话题，但几十年来，源分离问题已经引起了大量音乐信号研究人员的兴趣。它从一个简单的观察开始：音乐录音通常是几个单独的乐器轨道(主唱、鼓、贝斯、钢琴等)的混合。音乐源分离的任务是：给定一个混合，我们可以恢复这些单独的音轨(有时称为词干)吗？这有许多潜在的应用：思考混音、混音、主动倾听、教育目的，但也有其他任务的预处理，如转录。\n有趣的是，我们的大脑非常善于分离仪器。只要专注于这首曲子中的一种乐器(比如说主唱)，你就能非常清晰地听到它与其他乐器的声音。然而，这并不是真正的分离，你仍然可以听到所有其他的部分。在许多情况下，可能无法准确恢复混合在一起的各个磁道。因此，挑战是要尽可能地接近它们，也就是说，在不造成太多扭曲的情况下，尽可能地接近原件。\n多年来，来自世界各地的数十个才华横溢的研究团队探索了许多策略。如果你对这段迷人的旅程感兴趣，你应该去阅读这篇文献概述，或者这篇。最近，进展的速度取得了一些巨大的飞跃，这主要是由于机器学习方法的进步。为了保持跟踪，人们一直在国际评估活动中比较他们的算法。这就是我们如何知道Spleeter的性能与最好的建议算法的性能相匹配的原因。\n此外，Spleeter速度非常快。如果您运行的是GPU版本，那么可以预期分离速度比实时快100倍，这使得它成为处理大型数据集的一个很好的选择。\n我要说的可不少。如果您是从事音乐信息检索的研究人员，并且一直认为源分离工件不适合作为管道中的预处理步骤……。嗯，你也许应该重新考虑一下，试试斯普莱特。如果你是一名音乐黑客，想要用Spleeter构建一些很棒的东西，那就去做吧。实际上，Spleeter是麻省理工学院授权的，所以你可以自由地以任何你想要的方式使用它。不用说，如果您计划在受版权保护的歌曲上使用Spleeter，请确保您事先获得了版权所有者的适当授权。\n在引擎盖下，Spleeter是一个相当复杂和精心制作的引擎，但我们已经努力使其真正易于使用。实际的分离可以通过单个命令行来实现，它应该可以在您的笔记本电脑上工作，而不管您的操作系统是什么。对于更高级的用户，有一个名为Separator的python API类，您可以将其直接操作到您常用的管道中。\n我们已经竭尽全力拿出一份详尽的文件。请不要犹豫通过传统的GitHub工具向我们反馈、指出问题或提出改进建议！\n我们致力于源代码分离已经有很长一段时间了(我们已经在ICASSP 2019上有了一份出版物)。我们已经将Spleeter与Open-unMix(Inria的一个研究团队最近发布的另一个开源模型)进行了基准比较，并报告了速度提高后性能略有提高(请注意，训练数据集不同)。\n和平号研究人员面临的硬限制之一是由于版权问题缺乏公开可用的数据集。在Deezer这里，我们可以访问一个相当大的目录，我们一直在利用它来构建Spleeter。因为我们不能共享这些数据，所以把它变成一个可访问的工具是我们让每个人都可以复制我们的研究的一种方式。站在更道德的立场上，我们认为研究人员之间不应该因为他们获得或缺乏受版权保护的材料而进行不公平的竞争。\n最后但并非最不重要的一点是，培训这类模型需要大量的时间和精力。通过做一次并分享结果，我们希望省去别人的一些麻烦和资源。\n自从我们发布Spleeter以来，我们已经收到了很多反馈，其中大多数都是非常积极的，我们很高兴看到人们对我们的工作给予了如此多的关注。然而，这些反应中的一些可能有点过度热情，所以让我们重申几件事。Spleeter是一个很好的工具，但是我们绝不能声称已经“解决”了源分离问题。数以百计的研究人员和工程师工作了几十年，取得了进展，并建造了Spleeter所基于的工具。这是我们对一个生动、不断增长和开放的生态系统的贡献，希望其他人也能在此基础上建立起来。\n最后，值得一提的是，混音是一门艺术，掌握音响工程师本身就是艺术家。显然，我们不打算以任何方式损害他们的工作或影响任何人的信用。当您使用Spleeter时，请负责任地使用。", "note_en": "We are releasing   Spleeter to help the research community in Music Information Retrieval (MIR) leverage the power of a state-of-the-art source separation algorithm. It comes in the form of a Python Library based on  Tensorflow, with pretrained models for 2, 4 and 5 stems separation.  Spleeter will be presented and live-demoed at the 2019  ISMIR conference in Delft.\n  While not a broadly known topic, the problem of source separation has interested a large community of music signal researchers for a couple of decades now. It starts from a simple observation: music recordings are usually a mix of several individual instrument tracks (lead vocal, drums, bass, piano etc..). The task of music source separation is: given a mix can we recover these separate tracks (sometimes called  stems)? This has many potential applications: think remixes, upmixing, active listening, educational purposes, but also pre-processing for other tasks such as transcription.\n  Interestingly, our brain is very good at isolating instruments. Just focus on one of the instrument of  this track (say the lead vocal for instance) and you will be able to  hear it quite distinctively from the others. Yet that’s not really separation, you still hear all the other parts. In many cases, it may not be possible to exactly recover the individual tracks that have been mixed together. The challenge is thus to approximate them the best we can, that is to say as close as possible to the originals without creating too much distortions.\n For years, a lot of strategies have been explored, by dozens of brilliant research teams from all over the world. If you’re interested in this fascinating journey you should go read  this literature overview, or  this one. The pace of progress has recently made some giant leaps, mainly due to advances in machine learning methods. To keep track, people have been comparing their algorithm in  international evaluation campaigns. That’s how we know that  Spleeter performances match those of the best proposed algorithms.\n Additionally,  Spleeter is  very fast. If you are running the GPU version you can expect separating  100x faster than real-time which makes it a good option to process large datasets.\n  Quite a lot I’d say. If you’re a researcher working on Music Information Retrieval and have always considered that source separation artifacts made it unsuitable as a pre-processing step in your pipeline... Well, you should probably reconsider and try  Spleeter. If you are a music hacker and want to build something awesome using  Spleeter, then go ahead. Actually  Spleeter is  MIT-Licensed so you are  really free to use it in any way you want. It goes without saying that if you plan to use  Spleeter on copyrighted songs, make sure you get proper authorization from right owners beforehand.\n  Under the hood,  Spleeter is a fairly complex and crafted engine but we’ve worked hard to make it really easy to use. The actual separation can be achieved with a  single command line, and it should work on your laptop regardless of your Operating System. For more advanced users, there is a python API class called   Separator that you can manipulate directly into your usual pipeline.\n We’ve tried hard to come up with a  thorough documentation. Don’t hesitate to give us feedback, point out issues or suggest improvement through the traditional github tools!\n  We’ve been working on source separation for a long time (and we already had a  publication at ICASSP 2019). We have benchmarked  Spleeter against  Open-Unmix -another open-source model recently released by a research team from Inria- and reported  slightly better performances with increased speed (note that the training dataset is not the same).\n One of the hard limitations faced by MIR researchers is the lack of publicly available datasets due to copyright issues. Here at  Deezer, we have access to a fairly large catalog that we’ve been leveraging to build  Spleeter. Since we can not share this data, turning it into an accessible tool is a way for us to make our research reproducible by everyone. On a more ethical standpoint, we feel there should not be an unfair competition between researchers based on their access to copyrighted material or lack thereof.\n Last but not least, training this kind of models requires a lot of time and energy. By doing it once and sharing the result, we hope to save others some trouble and resources.\n  Since we released  Spleeter, we have received numerous feedback, most of them very positive and we’re thrilled to see all that attention given to our work. A few of these reactions may however be a little over-enthusiastic, so let’s just restate a few things.  Spleeter is a neat tool, but in no way do we claim to have “ solved” source separation. Hundreds of researchers and engineers working for decades have made the advances and built the tools on which  Spleeter is based. It’s our contribution to a vivid, ever-growing and open ecosystem and hopefully something others will build upon too.\n Finally, it’s worth pointing out that music mixing is a fine art and that mastering sound engineers are artists in their own rights. Obviously we do not intend to harm their work in any manner or affect anyone’s credit. When you use  Spleeter, please do so responsibly.", "posttime": "2020-05-19 10:15:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "spleeter,music,分离", "title": "Spleeter-音乐源-分离引擎", "title_en": "Spleeter – Music Source-Separation Engine", "transed": 1, "url": "https://deezer.io/releasing-spleeter-deezer-r-d-source-separation-engine-2b88985e797e", "via": "", "real_tags": ["spleeter", "music", "分离"]}, {"category": "", "categoryclass": "", "imagename": "c77d7cdb956c2a762ec0860159260315.png", "infoid": 1002726, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "\\$\\Begingroup\\$您的任务是构建一个表示数字时钟的生活游戏模拟，它满足以下属性：\n时钟以十进制(例如，12：00、3：59、7：24)显示小时和分钟，一天中的1,440分钟中的每一分钟都有不同的状态-小时将从0变为23，或者从1变为12，并带有PM指示器。\n分钟定期更新-从一次分钟更改到下一次更改需要相同的生成次数。\n一位匿名的旁观者能够一眼看出显示器应该是一个数字钟。这尤其需要：\n这些数字是可见的，并且可以清楚地区分。你必须能够一目了然地说出正在显示的时间。\n数字会在适当的位置更新。每个新数字出现在与前一个数字相同的位置，数字的边界框几乎没有移动。(具体地说，一个数字不包含位于不同位置的10个不同的数字，这些数字在每次数字更改时都会被揭开。)。\n数字紧挨着显示，它们之间没有过多的空格。\n您的计划将在以下方面按顺序评分(较低的标准充当较高标准的决胜局)：\n边界框大小-面积最小且完全包含给定解的矩形框获胜。\n\\$\\endgroup\\$。\nI‘我很确定这是B3/S23，但您能确认或否认吗？Conor O&’Brien。\n\\$\\Begingroup\\$&34；它们还必须原地更新-每个新数字必须出现在与前一个数字相同的位置。&#34；您如何定义同一位置的&#34；，因为数字不一定是矩形的。\\$\\endgroup\\$-Martin Ender。\n\\$\\Begingroup\\$我们的小数位必须有多清晰？如果你知道它是什么，并且眯着眼睛，那么你就可以分辨出0和8之间的区别了吗？或者它需要通过测试吗？匿名旁观者可以在没有提示的情况下判断出它是什么？\\$\\endgroup\\$-s SPARR。\n\\$\\Begingroup\\$这也发布在哈卡迪博客上：hackaday.com/2017/03/11/a-clock-created-with-conways-life\\$\\endgroup\\$-Anool Maidharia。\n嗯，这个设计肯定不是最优的。既不是从边界框的角度(那7段数字很大)，也不是从最初的人口计数(有一些无用的东西，还有一些肯定可以变得更简单的东西)，以及执行速度-嗯……。我不确定。\n转到在线JavaScript Conway生活模拟器。单击导入，粘贴设计文本。你应该看看设计。然后，转到设置并将生成步长设置为512或这些行附近的某个值，否则您将不得不永远等待才能看到时钟显示更新。\n请注意，使这个庞大的设计变得可用的唯一算法是hashlife。但是有了这个，您可以在几秒钟内实现整个时钟绕回。使用其他算法，即使看到时间变化也是不切实际的。\n它使用的是P30技术。只是一些基本的东西，滑翔机和轻型宇宙飞船。基本上，设计是自上而下的：\n在最上面，有一只钟。这是一个11520周期的钟。请注意，您需要大约10.000代才能确保显示器得到适当更新，但设计仍应稳定，时钟周期较小(约为5.000代-时钟需要是60的倍数)。\n然后是时钟分配阶段。时钟滑翔机被复制到一个平衡树中，所以在最后，有32个滑翔机在完全相同的时刻到达计数器阶段。\n计数器级为每个状态和每个数字使用RS锁存器(我们以十进制计数)。因此，分钟的右数字有10个状态，分钟的左数字有6个状态，小时有12个状态(两个小时数字在这里合并)。对于这些组中的每一组，计数器的行为类似于移位寄存器。\n在计数阶段之后，有查找表。它们将状态脉冲转换为显示段开/关动作。\n然后是显示器本身。这些区段简单地由多串LWSS制成。每个段都有自己的锁存器以保持其状态。我可以对数字状态进行简单的逻辑或运算，以了解某个段必须打开还是关闭，并去掉这些锁存器，但是当数字改变时(由于信号延迟)，不变的段会有故障。从查找表到数字段会有很长的滑翔机流。所以它就不会那么好看了。这是必须的。是。\n不管怎么说，这个设计其实没有什么特别之处。在这个过程中没有发现令人惊讶的反应，也没有以前没有人想到的真正聪明的组合。只是把这里和那里的一些东西放在一起(我甚至不确定我是不是按照正确的方式做的--实际上我对此完全陌生)。然而，这需要很大的耐心。让所有这些滑翔机在正确的时间在正确的位置升空是令人费解的。\n我可以将相同的时钟块复制n次(每个计数器单元一次)，而不是将相同的根时钟复制并分发到n个计数器单元。这实际上会简单得多。但那样我就不能那么容易地通过在单点上改变时钟来调整它了。我有电子学背景，在真实的电路中，这将是非常错误的。\n每个网段都有自己的RS锁存器。这要求查找表同时输出R和S脉冲。如果我们有一个锁存器，它只会从公共输入脉冲切换其状态，我们就可以使查找表变得一半大。PM点有这样一个插销，但它很大，我想不出更实用的东西。\n将显示屏缩小。但那就不会那么好看了。这是必须的。是。\n\\$\\endgroup\\$。\n\\$\\Begingroup\\$@Poke来吧，你可以试着自己添加这个.。无论如何，我已经编辑了这篇帖子的AM+PM两个版本，以供您愉快。\\$\\endgroup\\$-暗淡。\n如你所知，这个答案已经出现在Microsiervos上，这是最重要的西班牙语技术博客之一，在Twitter上有超过80万的追随者\\$\\endgroup\\$-Luis Mendo。\n罗里，你拿起你的头，用最大的力气把它砸在墙上十几次。然后您就可以开始了。\\$\\endgroup\\$-暗淡。\n所以设计过程是：，好的，我需要碰撞它，我的滑翔机在这个时候从那里滑翔过来。让我们看看用两个反射器把它拿到那里去。废话，它需要碰撞的只是两代人的步伐太快了，那里。如果我稍微移动一下反光镜，让我们看看……。糟了，太晚了。好的，让我们在别的地方与他们相撞。糟了，我没有房间让我的滑翔机去那里。好的，让我们再加两个没用的反光镜，好让它到达那里。糟了，反光板撞上了另一股滑翔机.。糟了，让我们上床睡觉吧。&#34；\\$\\endgroup\\$-224；暗淡\n…。请务必遵循挑战规范。不过，请不要钻空子。滥用任何标准漏洞的答案都被认为是无效的。如果您认为某个规范不明确或未详细说明，请改为对该问题进行评论。\n…。试着优化你的分数。例如，对挑战的回答应该尽量简短。除了竞争版本之外，您还可以随时包含代码的可读性版本。对您的答案的解释使阅读更有趣，非常鼓舞人心。\n…。包括一个简短的标题，指示您的代码的语言及其分数，如挑战所定义的。\n点击“发布您的答案”，即表示您同意我们的服务条款、隐私政策和Cookie政策。\n不是你想要的答案吗？浏览标记的其他问题或提出您自己的问题。", "note_en": "\\$\\begingroup\\$  Your task is to build a Game of Life simulation representing a digital clock, which satisfies the following properties:\n The clock displays the hours and minutes in decimal (e.g.  12:00,  3:59,  7:24) with a different state for each of the 1,440 minutes of the day — either the hours will go from 0 to 23 or from 1 to 12 with a PM indicator.\n  The minutes update at regular intervals — from one change of minute to the next takes the same number of generations.\n An anonymous bystander is able to tell at a glance that the display is supposed to be a digital clock. In particular, this entails:\n The digits are visible and clearly distinguishable. You must be able to tell with certainty at a glance what time is being displayed.\n The digits update in place. Each new number appears in the same place as the previous number, and there is little to no movement of the bounding boxes of the digits. (In particular, a digit does not contain 10 different digits in different places that get uncovered every time the digits change.)\n The digits appear next to each other, without an excessive amount of space between them.\n  Your program will be scored on the following things, in order (with lower criteria acting as tiebreakers for higher criteria):\n Bounding box size — the rectangular box with the smallest area that completely contains the given solution wins.\n      \\$\\endgroup\\$\n  \\$\\begingroup\\$  I&#39;m pretty sure this is B3/S23, but could you confirm or deny?  \\$\\endgroup\\$\r–  Conor O&#39;Brien\n  \\$\\begingroup\\$  &#34;They must also update in place — each new number must appear in the same place as the previous number.&#34; How do you define &#34;in the same place&#34;, since the digits won&#39;t necessarily be rectangular.  \\$\\endgroup\\$\r–  Martin Ender\n  \\$\\begingroup\\$  how discernable must our decimal digits be? is &#34;if you know what it is and you squint then you can tell the difference between 0 and 8&#34; enough, or does it need to pass the &#34;an anonymous bystander can tell what it is with no prompting&#34; test?  \\$\\endgroup\\$\r–  Sparr\n  \\$\\begingroup\\$  this got posted on the Hackaday blog too :  hackaday.com/2017/03/11/a-clock-created-with-conways-life  \\$\\endgroup\\$\r–  Anool Mahidharia\n  \\$\\begingroup\\$  Well, the design is certainly not optimal. Neither from the bounding box standpoint (those 7-segment digits are  huge), nor from the initial population count (there are some useless stuff, and some stuff that could certainly be made simpler), and the execution speed - well... I&#39;m not sure.\n      Go to  the online JavaScript Conway life simulator. Click  import, paste the design text. You should see the design. Then, go to  settings and set the  generation step to 512, or something around those lines, or you&#39;ll have to wait forever to see the clock display updating.\n   Note that the only algorithm that makes this huge design useable is hashlife. But with this, you can achieve the whole clock wraparound in seconds. With other algorithms, it is impractical to even see the hour changing.\n  It uses p30 technology. Just basic things, gliders and lightweight spaceships. Basically, the design goes top-down:\n At the very top, there&#39;s the clock. It is a 11520 period clock. Note that you need about 10.000 generations to ensure the display is updated appropriately, but the design should still be stable with a clock of smaller period (about 5.000 or so - the clock needs to be multiple of 60).\n Then, there is the clock distribution stage. The clock glider is copied in a balanced tree, so at the end, there are 32 gliders arriving at the exact same moment to the counters stage.\n The counter stage is made using a RS latch for each state, and for each digit (we&#39;re counting in decimal). So there is 10 states for the right digit of the minutes, 6 states for the left digit of the minuts, and 12 states for the hours (both digits of the hours are merged here). For each of these groups, the counter behaves like a shift register.\n After the counting stage, there are the lookup tables. They convert the state pulses to display segments ON/OFF actions.\n Then, the display itself. The segments are simply made with multiple strings of LWSS. Each segment has it own latch to maintain its state. I could have made a simple logical-OR of the digit states to know wether a segment must be ON or OFF, and get rid of these latches, but there would be glitches for non-changing segments, when the digits are changing (because of signal delays). And there would be long streams of gliders coming from the lookup table to the digit segments. So it wouldn&#39;t be as nice-looking. And it needed to be. Yes.\n Anyway, there is actually nothing extraordinary in this design. There are no amazing reactions that have been discovered in this process, and no really clever combinations that nobody thought of before. Just bits taken here and there and put together (and I&#39;m not even sure I did it the &#34;right&#34; way - I was actually completely new to this). It required a lot of patience, however. Making all those gliders coming up at the right time in the right position was head-scratching.\n  Instead of copying and distributing the same root clock to the  n counter cells, I could have just put the same clock block  n times (once for each counter cell). This would actually be much simpler. But then I wouldn&#39;t be able to adjust it as easily by changing the clock at a single point... And I have an electronics background, and in a real circuit, that would be horribly wrong.\n Each segment has it own RS latch. This requires the lookup tables to output both R and S pulses. If we had a latch that would just toggle its state from a common input pulse, we could make the lookup tables half as big. There is such a latch for the PM dot, but it is huge, and I&#39;m unable to come up with something more practical.\n Make the display smaller. But that wouldn&#39;t be as nice-looking. And it needed to be. Yes.\n    \\$\\endgroup\\$\n  \\$\\begingroup\\$  @Poke come on, you could have tried to add this yourself... Anyway, I have edited the post with a version with both AM+PM, for your pleasure.  \\$\\endgroup\\$\r–  dim\n  \\$\\begingroup\\$  Just so you know, this answer has been  featured in  Microsiervos, one of the most important blogs about technology in Spanish, with over 800K followers on  Twitter  \\$\\endgroup\\$\r–  Luis Mendo\n  \\$\\begingroup\\$  @Rory You take your head, smash it on the wall a dozen times as hard as you can. You are then ready to start.  \\$\\endgroup\\$\r–  dim\n  \\$\\begingroup\\$  So the design process is: &#34;Ok, I need to collide that, and my glider comes from there in this position at this time. Let&#39;s see bring it there using two reflectors. Crap, the thing it needs to collide is just two generation steps too soon, there. If I move the reflectors a bit, let&#39;s see... Crap, too late. Ok, let&#39;s collide them some place else. Crap, I don&#39;t have the room to make my glider go there. Ok, let&#39;s add two other useless reflectors just to make it arrive there instead. Crap, the reflectors collide this other stream of glider... Crap, let&#39;s go to bed.&#34;  \\$\\endgroup\\$\r–  dim\n    …Be sure to follow the challenge specification. However, please refrain from exploiting obvious loopholes. Answers abusing any of the  standard loopholes are considered invalid. If you think a specification is unclear or underspecified, comment on the question instead.\n  …Try to optimize your score. For instance, answers to   challenges should attempt to be as short as possible. You can always include a readable version of the code in addition to the competitive one.\r  Explanations of your answer make it more interesting to read and are very much encouraged.\n  …Include a short header which indicates the language(s) of your code and its score,  as defined by the challenge.\n    By clicking “Post Your Answer”, you agree to our  terms of service,  privacy policy and  cookie policy\n  Not the answer you&#39;re looking for? Browse other questions tagged     or  ask your own question.", "posttime": "2020-05-19 10:15:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,生活,digital,数字", "title": "在康威的“生活的游戏”中制作数字钟", "title_en": "Build a digital clock in Conway's Game of Life", "transed": 1, "url": "https://codegolf.stackexchange.com/questions/88783/build-a-digital-clock-in-conways-game-of-life", "via": "", "real_tags": ["游戏", "生活", "digital", "数字"]}, {"category": "", "categoryclass": "", "imagename": "0a1837bfba89f9f25c47a21efb2272b4.jpg", "infoid": 1002725, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的48小时里，Windows 10的另一个更新--KB4556799--对终端用户的PC造成了严重破坏。今天早上，我醒来时发现，我正在使用的几个系统用来对PC硬件进行基准测试，这些系统充斥着问题。\n这一更新声称改进了各种安全措施，还包括存储和管理文件的更新。不幸的是，这似乎导致了蓝屏死亡(BSOD)、稳定性问题和乱码音频，因为文件实际上是被隐藏或删除的，Windows或他们使用的软件找不到这些文件。\n今天早上，我自己的问题，在更新偷偷溜进来之后，看到我的电脑处于BSOD的持续重启周期中，指向内存、显卡和其他错误。最终，我设法进入了操作系统，并使用系统还原功能获得了它们的原样，现在这个方法已经奏效了。\n在另一个系统上，几个程序声称各种文件丢失了，但前一天晚上PC工作正常-在这里，只需删除令人不快的更新就可以解决问题。其中很多都是严重的DLL文件，因此如果您再次遇到同样的问题，请检查是否已安装更新KB4556799并将其清除。\n在微软自己的论坛上已经有大量帖子，Windows最新网站也指向导致音频问题的更新，以及Reddit上关于系统减速和无法解释的软件崩溃的各种帖子。\n此外，请务必在Windows Update设置的高级选项部分关闭更新并尽可能长时间地延迟更新，直到微软解决了另一场灾难。", "note_en": "The last 48 hours has seen another Windows 10 update - KB4556799 - wreak havoc on end user&#39;s PCs and this morning, I woke to find several systems I&#39;m using to benchmark PC hardware riddled with problems.\n    The update, which claims to improve various security measures also states includes  &#39;Updates for storing and managing files.&#39; Unfortunately, this appears to have caused blue screens of death (BSOD), stability issues and garbled audio as files are literally being hidden or deleted and cannot be found by Windows or the software they use.\n  My own problems this morning, after the update sneaked in, saw my PC sit in a continual reboot cycle of BSODs pointing at memory, graphics card and other errors. Eventually I managed to get into the OS and used system restore to get things as they were and this has worked for now.\n     On another system, several programs claimed that various files were missing, yet the PC was working fine the night before - here, simply removing the offending update fixed the issue. A lot of these were critial dll files so if you&#39;re experience the same issues, check to see if update KB4556799 has been installed and get rid of it.\n  There are already numerous posts on  Microsoft&#39;s own forum with website  Windows Latest also pointing at the update causing audio issues and various posts including  this one on Reddit about system slow downs and unexplained software crashes.\n    Also be sure to switch off updates and delay them for as long as possible in the advanced options section of Windows Update&#39;s settings till Microsoft sorts out what is yet another disaster.", "posttime": "2020-05-19 10:14:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,windows-10,隐藏,hides,pc", "title": "新的Windows 10更新隐藏文件，给数百万人带来严重问题", "title_en": "New Windows 10 Update Hides Files Causing Serious Problems for Millions", "transed": 1, "url": "https://www.forbes.com/sites/antonyleather/2020/05/18/new-windows-10-update-deletes-files-causing-serious-problems-for-millions/", "via": "", "real_tags": ["windows", "隐藏", "hides", "pc"]}, {"category": "", "categoryclass": "", "imagename": "e27063594934f3e38e2b3851fa773a13.png", "infoid": 1002724, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "给你学点蟒蛇。我们已经与No Stack Press合作开设了一堂Python速成课程！使用电子书快速学习基本要领，如使用Python自动化枯燥的东西，第2版：面向总初学者的实用编程，使用Python破解代码：构建和破解密码的入门，用Python发明自己的计算机游戏，第4版，Python Crash课程，第2版：动手，基于项目的编程入门，等等。另外，您的购买将支持书业慈善基金会和无淀粉出版社基金会！\n支付1美元或更多。通常情况下，捆绑在一起的电子书的总成本高达375美元。在Humble Bundle这里，您可以选择价格并增加您的贡献来升级您的捆绑包！此捆绑包的最低购买金额为1美元。\n随时随地阅读它们。此捆绑包中的电子书有PDF、MOBI和ePub格式，因此可以在您的计算机、电子阅读器、iPad、手机和各种移动设备上使用！说明和推荐阅读程序列表可以在这里找到。\n支持慈善事业。选择资金的去向-通过贝宝捐赠基金在出版商、图书行业慈善基金会(BINC)和无淀粉出版社基金会之间进行选择。如果你喜欢我们的工作，你也可以给我们一个谦虚的小费！", "note_en": "Learn you some Python. We&#39;ve teamed up with No Starch Press for a crash course on Python! Learn the essentials quickly with ebooks like  Automate the Boring Stuff with Python, 2nd Edition: Practical Programming for Total Beginners, Cracking Codes with Python: An Introduction to Building and Breaking Ciphers, Invent Your Own Computer Games with Python, 4th Edition, Python Crash Course, 2nd Edition: A Hands-On, Project-Based Introduction to Programming, and more. Plus, your purchase will support the Book Industry Charitable Foundation and No Starch Press Foundation!\n Pay US$1 or more. Normally, the total cost for the ebooks in this bundle is as much as US$375. Here at Humble Bundle, you choose the price and increase your contribution to upgrade your bundle! This bundle has a minimum US$1 purchase.\n Read them anywhere. The ebooks in this bundle are available in PDF, MOBI, and ePub formats, so they work on your computer, e-readers, iPads, cell phones, and a wide array of mobile devices! Instructions and a list of recommended reading programs can be found  here.\n Support charity. Choose where the money goes - between the publisher, Book Industry Charitable Foundation (Binc) and No Starch Press Foundation via  PayPal Giving Fund. If you like what we do, you can leave us a Humble Tip too!", "posttime": "2020-05-19 10:14:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,学习,book", "title": "卑微的书包：向你学习无淀粉出版社的蟒蛇", "title_en": "Humble Book Bundle: Learn You Some Python by No Starch Press", "transed": 1, "url": "https://www.humblebundle.com/books/learn-you-some-python-no-starch-press-books?mc_cid=b822cd8611&mc_eid=443b882743", "via": "", "real_tags": ["python", "学习", "book"]}, {"category": "", "categoryclass": "", "imagename": "1292324ec2db09424570c51bd61bcbda.jpg", "infoid": 1002722, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在新墨西哥州一对犹太退休人员的家中发现了一辆被盗的德库宁汽车。这不是他们唯一的秘密。", "note_en": "A stolen de Kooning was found in the New Mexico home of a pair of Jewish retirees. It wasn’t their only secret.", "posttime": "2020-05-19 09:58:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "painting,退休", "title": "门后的那幅画", "title_en": "The Painting Behind the Door", "transed": 1, "url": "https://www.tabletmag.com/sections/arts-letters/articles/de-kooning-art-theft", "via": "", "real_tags": ["painting", "退休"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002721, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "将您自己的脚本注入到黑盒进程中。挂钩任何函数，监视加密API或跟踪私有应用程序代码，不需要源代码。编辑，点击保存，立即看到结果。所有这些都不需要编译步骤或程序重启。\n适用于Windows、MacOS、GNU/Linux、iOS、Android和QNX。从NPM安装Node.js绑定，从PyPI获取Python包，或者通过其SWIFT绑定、.NET绑定、Qt/QML绑定或C API使用Frida。\nFrida现在是，将来也永远是自由软件(自由，就像自由一样)。我们希望支持下一代开发工具，并帮助其他自由软件开发人员通过逆向工程实现互操作性。\n我们感到自豪的是，NoowSecure正在使用Frida对大规模的移动应用进行快速、深入的分析。Frida拥有一套全面的测试套件，并在广泛的用例中通过了多年的严格测试。", "note_en": "Inject your own scripts into black box processes. Hook any function, spy on crypto APIs or trace private application code, no source code needed. Edit, hit save, and instantly see the results. All without compilation steps or program restarts.\n  Works on Windows, macOS,  GNU/Linux, iOS, Android, and QNX. Install the Node.js bindings from  npm, grab a Python package from  PyPI, or use Frida through its  Swift bindings,  .NET bindings,  Qt/Qml bindings, or  C API.\n  Frida is and will always be  free software (free as in freedom). We want to empower the next generation of developer tools, and help other free software developers achieve interoperability through reverse engineering.\n  We are proud that  NowSecure is using Frida to do fast, deep analysis of mobile apps  at scale. Frida has a comprehensive test-suite and has gone through years of rigorous testing across a broad range of use-cases.", "posttime": "2020-05-19 09:58:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,gresemonkey,greasemonkey,绑定", "title": "FRIDA-GRESEMONKEY for Native Apps", "title_en": "Frida – Greasemonkey for Native Apps", "transed": 1, "url": "https://frida.re/", "via": "", "real_tags": ["app", "绑定"]}, {"category": "", "categoryclass": "", "imagename": "5234bc4212423e66b795cbd843204fc9.jpg", "infoid": 1002720, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "乔·拜登(Joe Biden)被指控性侵犯，保守派人士欢欣鼓舞，因为他们发现女权主义者陷入了新的虚伪陷阱。一个女人，除了同时代的描述之外，没有任何佐证，却指控一个有权势的男人犯下了几十年的罪行？嗯，这听起来是不是和克里斯汀·布莱西·福特对最高法院提名人布雷特·卡瓦诺(Brett Kavanaugh)的控诉非常接近？然而，这一次，许多支持#MeToo运动的自由派似乎持怀疑态度？\n“新闻终结者”(NewsBusters)执行主编蒂姆·格雷厄姆(Tim Graham)：“这个故事的#MeToo运动在哪里？他们刻板的“相信所有女人”的套话怎么了？“。\n福克斯新闻主持人塔克·卡尔森：“媒体和职业女权运动令人气愤、令人作呕的伪善。“相信所有的女人！”不，他们没有。“。\n白宫顾问凯莉安·康韦(Kellyanne Conway)说：“三个神奇的词，‘相信所有女人。’我没有听到星号；我没有看到脚注，‘相信所有女性，只要她们攻击与特朗普总统结盟的人；相信所有女性，只要她们-拥有大学学位或更高学历-是支持在第九个月堕胎的。’“。\n事实上，“相信所有的女人”确实有一个星号：*它从来都不是女权主义的“样板”。我们正在目睹的是右翼谴责其想象中的美国妇女运动的另一个例子。\n花几个小时在社交媒体网站和新闻数据库上追踪“相信所有女人”的起源-就像我做的那样-你会发现语言就像病毒一样，可以在一夜之间发生变异。突然之间，昨天的语录遭受了一些外来DNA的插入，这使得它们很容易武器化。在这种情况下，外来入侵是一个词：“所有”。\n在卡瓦诺的听证会上，“全部”插入风靡一时。当从卡玛拉·哈里斯(Kamala Harris)到玛齐·希罗诺(Mazie Hirono)等参议员对布拉西博士的信任被福克斯新闻(Fox News)的权威人士提升为普遍的性别轻信时，他们实际上说的“我相信她”变成了所有女性的信条。前福克斯新闻撰稿人摩根·奥尔塔格斯在2019年2月表示：“这就是真正的标签。”“Twitter上有一个很棒的搜索功能，你可以搜索#BelieveAllWomen。对于那些不相信这一点的人来说，民主党在卡瓦诺一案中就是这样。“。\n有意义地跟踪Twitter上的标签是一件令人困惑的琐事，即使是对我咨询的专业数据刮除者来说也是如此。“这是一个非常有趣的兔子洞，”哈佛大学施莱辛格图书馆的数字档案员巴勃罗·莫拉莱斯·亨利(Pablo Morales Henry)告诉我。施莱辛格图书馆拥有3000多万条与地铁相关的推文。\n不过，还是让我们接受奥尔塔格斯的挑战吧。正如她所指出的，Twitter有一项搜索功能，虽然算不上“很棒”，但至少粗略地反映了该网站的使用情况-特别是最受欢迎的用户，他们最有可能将标签传播得更远更广。例如，输入2016年的#BlackLivesMatter或#MakeamericaGreatAain“，你就会得到无穷无尽的参考资料。输入#BelieveAllWomen for 2017，当时#MeToo运动在10月份开始，你会得到几十个参考文献，紧随其后的是2018年(卡瓦诺听证会之年)更多的参考文献。但事情是这样的：我发现，这个标签在很大程度上主要是由诋毁它的人使用的。\n似乎#BelieveAllWomen第一次出现在推特上是在2014年底，当时有三条推文--分别是安大略省的一位助产士、多伦多的一位教育家和“终身学习者”，以及“珍娜和坎普·凯拉，一对来自渥太华的双胞胎，她们在业余时间策划活动。”加起来如下：不到4000名追随者。\n然后，在2015年秋天，希拉里·克林顿发布了一条推文：“致每一位性侵…的幸存者。你有权发表意见。你有权被人相信。“。胡安妮塔·布罗德里克(Juanita Broaddrick)声称比尔·克林顿(Bill Clinton)在1978年强奸了她，2016年1月6日，她在推特上回应称，“希拉里试图让我保持沉默。”保守派编辑大卫·弗伦奇(David French)在Twitter上拥有大量追随者(截至撰写本文时，追随者超过20.9万人)，他立即转发了布罗德里克，并附上了#BelieveAllWomen(BelieveAllWomen)的标签，紧随其后的是四个问号。\n碰巧的是，这个被右翼吹成篝火的谣言，在主流媒体上成为了公认的事实，从NPR到《纽约时报》，再到加拿大的《环球邮报》(The Globe And Mail)，声明将#BelieveAllWomen描述为“#MeToo运动的战斗口号”，“当天的秩序”，以及“如果有的话，一个司法不公的公式”。\n上周，当梅根·凯利(Megyn Kelly)在接受塔拉·里德(Tara Reade)采访时说，一切都回到了原点。“一些最常吹捧‘我们必须相信所有女性’的人，比如在最高法院的卡瓦诺听证会上，当谈到你时，似乎肯定改变了语气。”\n在我的网上搜索中，我遇到了一些女权主义者，他们似乎真心支持这个短语。但压倒性的是，部署这一短语的Twitter成员是保守派，他们把它当作鞭子挥舞。为什么？\n因为右翼知道#我也是(#MeToo)积极分子应该牢记的是什么：危险在于纯洁。如果女性运动的多元性能够在公众心目中沦为僵化的样板，那么#我也是(#MeToo)的未来将从它誓言捍卫的单个不诚实的女性身上损失更多，而不是从成船的掠夺性男性身上损失更多。\n这就是为什么“相信所有的女人”不是对“相信女人”的放大，而是它的否定。正如施莱辛格图书馆的莫拉莱斯·亨利先生告诉我的那样，在对这两个标签的使用进行了几天的分析之后，“看起来#BelieveAllWomen，特别是最近，正在被用来反对#BelieveWomen。”在针对自由派政客的指控中，它的使用激增-通常伴随着谴责双重标准的配套标签。\n双标准纯度测试只在一个方向上运行。保守派人士对自己厚颜无耻的伪善并不感到不安，这不是他们在玩的游戏。凯莉安·康韦(Kellyanne Conway)声称，在走回白宫之前，“相信所有女性”是“亲女性”的？\n令人奇怪的是，保守派被他们的无耻所免疫。引用W·B·叶芝(W.B.Yeats)的话说，你是如何与“一个/谁，被证明他撒谎了/既不在自己/也不在邻居眼里蒙羞”进行斗争的？右翼反对原则，很早就知道如何将左翼的原则性表达变成阿喀琉斯的脚跟。即使当它不得不编造表达式的时候。\n女权主义确实相信很多关于“所有女性”的事情。所有妇女都应该在法律下得到平等待遇，在工作场所同工同酬，生殖健康，免受家庭暴力。女权主义者长期以来一直认为，当“所有”指的是所有类别的女性时，就应该相信“所有女性”-即，无论种族、宗教或经济地位如何，都是平等的。这就是安妮塔·希尔(Anita Hill)2017年在CNN市政厅说的话的意思，“除非我们能相信所有女性，每个女性的声音都有价值，否则我们中没有人会真正被视为平等。”阅读她的全部评论，很明显，她并不是平等地对待每一个女性，而是平等地对待“所有种族、所有年龄、各种大小、各种背景”的女性。\n祝你好运，找到任何一个认为我们应该相信所有女性所说的一切的女权主义者-即使是她们关于性侵犯的说法。历史充分证明，当一个不应该相信的女人或男人被相信时，可能会发生可怕的事情：还记得“斯科茨伯勒男孩”(Scottsboro Boys)吗？\n至少从90年代末开始，GOGCHA保守主义的专长就一直在谴责女权主义者未能兑现他们的教条主义标签。首先，将女权主义者讽刺为一群集体思维的极权主义者，然后每次他们步调一致时都指责他们虚伪。但你猜怎么着？女权主义从来没有在五分钟内步调一致。如果说有什么不同的话，那就是我们往往更多地是相互掐着喉咙，而不是列队行进。从与女性抗争的可比性到色情，再到#MeToo，从玛格丽特·阿特伍德到你们的女权主义者都在讨论比例和正当程序。女权主义内部广泛的意见是其优势之一，而不是弱点。如果女权主义者看到安妮塔·希尔、莫妮卡·莱温斯基、克里斯汀·布莱西·福特和塔拉·里德之间的区别，我会说她们是在做自己的工作。那不是虚伪，那是正直。\n最终的虚伪将是一场妇女运动，它聚集在简约标签的旗帜下，谈论每个女性的想法。女权主义诞生于一种愿望，即女性被视为个体，而不是千篇一律的理想或无名的刻板印象。当我在数据库中搜索女性关于“相信所有女性”的实际声明时，我发现的是女性呼吁不要用普遍的术语来定义-“我不相信所有的女性都有生育的愿望”或“我不相信所有女性的兴趣都是一样的”-以及对试图对自己的性别进行分类的愤怒。\n这就是为什么#我也是(#MeToo)运动的首选标签是#BelieveWomen。没有“全部”就不一样了。相信女人只不过是对古老的#DoubtWomen做法的反驳。\n因为，正如女性所见证的那样，被怀疑会导致时间的流逝。2017年，一个人在Twitter上写道，关于一名前夫在圣诞节谋杀了他的两个年幼女儿的案件，“你知道人们还应该#BelieveWomen说些什么吗？”当他们向当局报告他们虐待的前男友，并担心他们的安全和孩子的安全时。撕裂珍贵的女孩。“\n或者，另一位在一名持怀疑态度的法官拒绝向她发出保护令后，对一名妇女被丈夫殴打致死的消息做出了令人震惊的回复，恳求“怀疑论文化”“试一试”和“#bw”。不被信任的说法太多了，无法列出，而且名单越来越长。一名女子在回应媒体关于一名学生被一名被判有罪的性犯罪者跟踪并杀害的报道后写道：“当我们说#相信女人时，这对我们来说可能是生死攸关的问题。”此前，她向校园警察和911提出申诉，数周来一直没有人理睬。\n不让它的信息和使命被劫持和歪曲，对妇女运动来说是生死攸关的。女权主义存在的根本原因是将每个女性从“所有女性”的概念中解放出来。它的未来取决于对这一信念的全力捍卫。\n苏珊·法鲁迪(Susan Faludi)是一名记者和作家，最近出版了回忆录“在暗室里”(In The Darkroom)。\n“泰晤士报”致力于向编辑发表各种信件。我们想听听您对这篇文章或我们的任何一篇文章的看法。这里有一些小贴士。这是我们的电子邮件：Letters@nytimes.com。", "note_en": "Joe Biden has been accused of sexual assault, and conservatives are having a field day, exultant that they’ve caught feminists in a new hypocrisy trap. A woman, with no corroboration beyond contemporaneous accounts, charges a powerful man with a decades-old crime? Hmm, doesn’t that sound mighty close to Christine Blasey Ford’s complaint against Supreme Court nominee Brett Kavanaugh? Yet this time, many liberals who’ve championed the #MeToo movement seem skeptical?\n Tim Graham, executive editor of NewsBusters: “Where is the #MeToo movement on this story? What happened to their rigid ‘Believe All Women’ boilerplate?”\n Fox News host  Tucker Carlson: “the infuriating, the sickening hypocrisy of the media and the professional feminist movement. ‘Believe All Women!’ No they don’t.”\n White House adviser Kellyanne Conway: “Three magic words, ‘Believe All Women.’ I didn’t hear an asterisk; I didn’t see a footnote, ‘Believe All Women so long as they are attacking somebody aligned with President Trump, Believe All Women so long as they are — have a college degree or better or are — are for abortion in the ninth month.’”\n In fact, “Believe All Women” does have an asterisk: *It’s never been feminist “boilerplate.” What we are witnessing is another instance of the right decrying what it imagines the American women’s movement to be.\n Spend some mind-numbing hours tracking the origins of “Believe All Women” on social media sites and news databases — as I did — and you’ll discover how language, like a virus, can mutate overnight. All of a sudden, yesterday’s quotes suffer the insertion of some foreign DNA that makes them easy to weaponize. In this case, that foreign intrusion is a word: “all.”\n “All” insertion was all the rage during the Kavanaugh hearings. When senators from Kamala Harris to Mazie Hirono had their regard for Dr. Blasey’s credibility elevated by Fox News pundits to universal gender credulity, their actual words, “I believe her,” became  believe all women. “That’s literally the hashtag,” former Fox News contributor Morgan Ortagus said in February 2019. “There’s a great search function on Twitter, and you can search the #BelieveAllWomen. For those of you who don’t believe that’s what the Democrats had in the case of Kavanaugh.”\n  Meaningfully tracking hashtags on Twitter is a confounding chore, even for the professional data scrapers I consulted. “It’s a very interesting rabbit hole,” Pablo Morales Henry, digital archivist at Harvard University’s Schlesinger Library, which  maintains a collection of more than 30 million MeToo-related tweets, told me.\n Nevertheless, let’s take the Ortagus challenge. As she noted, Twitter has a search function that, while hardly “great,” does at least crudely reflect the site’s use — especially by its most popular users who are most likely to spread a hashtag far and wide. For instance, type in #BlackLivesMatter or #MakeAmericaGreatAgain” for 2016, and you get a bottomless well of references. Type in #BelieveAllWomen for 2017, when the #MeToo movement took off in October, and you get several dozen references, followed in 2018 (the year of the Kavanaugh hearings) by many more. But here’s the thing: I found that the hashtag is, by a wide margin, used mostly by its detractors.\n It seems that #BelieveAllWomen first appeared on Twitter in late 2014, in three tweets — by an  Ontario midwife, a Toronto educator and “ lifelong learner” and “ Jenna &amp; Kayla, twins from Ottawa who plan events in their spare time.” Combined following: fewer than 4,000 followers.\n Then, in the fall of 2015, Hillary Clinton posted a  tweet: “To every survivor of sexual assault … you have the right to be heard. You have the right to be believed.” To which Juanita Broaddrick, who alleges that Bill Clinton raped her in 1978,  responded on Twitter on Jan. 6, 2016, “Hillary tried to silence me.” Conservative editor David French, who has a large Twitter following (more than 209,000 followers as of this writing), retweeted Ms. Broaddrick at once — attaching the hashtag #BelieveAllWomen, followed by four question marks.\n  As happens, the canard, blown into a bonfire by the right, became accepted truth in mainstream media, from NPR to The New York Times to The Globe and Mail in Canada, with pronouncements characterizing #BelieveAllWomen as “the rallying cry of the #metoo movement,” “ the order of the day” and “ a formula for miscarriage of justice if ever there was one.”\n  It all came full circle last week, when Megyn Kelly  said in her interview with Tara Reade, “Some of those who touted the ‘we must believe all women’ line the most, during, for example, the Kavanaugh hearings for the Supreme Court, certainly seem to have changed their tune when it comes to you.”\n In my online searches, I encountered some feminists who seemed genuinely to subscribe to the phrase. But overwhelmingly, the Twitterati deploying the phrase were conservatives, wielding it as a whip. Why?\n Because the right knows what #MeToo activists do well to keep in mind: Peril lies in purity. If the pluralism of the women’s movement can be reduced to rigid boilerplate in the public mind, then the future of #MeToo will have more to lose from a single untruthful woman whom it’s sworn to defend than from boatloads of predatory men.\n This is why “Believe All Women” is not an amplification of “Believe Women,” but its negation. As Mr. Morales Henry at the Schlesinger Library told me, after several days of analyzing the use of the two hashtags, “It looks like #BelieveAllWomen, especially recently, is being used in opposition to #BelieveWomen.” Its use spikes on occasions when allegations are made against a liberal politician — often with companion hashtags decrying a double standard.\n The double-standard purity test operates in one direction only. Conservatives are unfazed by their own brazen hypocrisies; that’s not the game they’re playing. Kellyanne Conway claiming it’s “pro-woman” to “believe all women,” before walking back into  that White House?\n  Conservatives have been oddly immunized by their shamelessness. How do you fight, to quote W.B. Yeats, “with one/Who, were it proved he lies,/Were neither shamed in his own/Nor in his neighbours’ eyes”? The right, being averse to principle, has long known how to turn the left’s expressions of principle into Achilles’ heels. Even when it has to make up the expression.\n Feminism has, indeed, believed many things about “all women.” That all women are deserving of equal treatment under the law, equal pay in the workplace, reproductive health, freedom from domestic violence. And feminists have long held that “all women” should be believed when the “all” refers to all categories of women — i.e., equal regardless of race, religion or economic status. This is what Anita Hill meant when she said in a  CNN town hall in 2017, “And until we can believe all women, every woman’s voice has value, none of us really will be seen as equal.” Read her comments in full, and it’s clear she wasn’t giving equal credence to every individual woman, but equal standing to women of “all races, all ages, all sizes, all backgrounds.”\n Good luck finding any feminist who thinks we should believe everything all women say — even what they say about sexual assault. History offers ample evidence of the horrors that can ensue when a woman or a man is believed who shouldn’t be: Remember the  Scottsboro Boys?\n Since at least the late ’90s, gotcha conservativism’s specialty has been condemning feminists for failing to live up to their dogmatist label. First, caricature feminists as a bunch of groupthink totalitarians, then accuse them of hypocrisy every time they are not in lock step. But guess what? Feminism has never, for five minutes, been about lock step. If anything, we tend to be at each other’s throats more often than we’re marching in ranks. And that’s on subjects from comparable worth to women in combat to pornography to #MeToo, where feminists from  Margaret Atwood to  yours truly have argued for proportion and due process. The broad spectrum of opinion within feminism is one of its strengths, not a frailty. If feminists see distinctions between Anita Hill, Monica Lewinsky, Christine Blasey Ford and Tara Reade, I’d say they’re doing their jobs. That’s not hypocrisy, that’s integrity.\n The ultimate hypocrisy would be a women’s movement that rallies behind the banner of reductive hashtags about what every woman thinks. Feminism was birthed out of a desire that women be treated as individuals, not as a cookie-cutter ideal or a faceless stereotype. When I searched databases for women’s actual statements on “believe all women,” what I found were appeals by women  not to be defined in universal terms — “I do not believe all women are born with the desire to reproduce” or “I don’t believe all women’s interests are the same” — and outrage at attempts to categorize their sex.\n This is why the preferred hashtag of the #MeToo movement is #BelieveWomen. It’s different without the “all.” Believing women is simply the rejoinder to the ancient practice of #DoubtWomen.\n For to be disbelieved has consequences, as women have witnessed, time out of mind. As one person  wrote on Twitter in 2017, concerning a case in which an ex-husband murdered his two young daughters on Christmas, “You know what else people should #BelieveWomen about? When they tell authorities about their abusive ex and have concerns about their safety and the safety of their children. RIP precious girls.”\n Or another who implored the “skeptic culture” to “give it a try” and “#bw,” in a stricken reply to the news of a woman beaten to death by her husband after a doubting judge denied her a protective order. The accounts of not being believed are too legion to list, and the list grows longer. A woman, responding to press reports of a student stalked and murdered by a convicted sex offender — after her appeals to campus police and 911 went unheeded for weeks —  wrote, “When we say #believewomen, it’s because this can literally be a matter of life or death for us.”\n And not having its message and mission hijacked and distorted can be life or death for the women’s movement. Feminism’s bedrock reason for being is to free every woman from the concept of “all women.” Its future rests on a full-throated defense of that belief.\n  Susan Faludi is a journalist and an author, most recently of the memoir “In the Darkroom.”\n The Times is committed to publishing   a diversity of letters  to the editor. We’d like to hear what you think about this or any of our articles. Here are some   tips . And here’s our email:   letters@nytimes.com .", "posttime": "2020-05-19 09:57:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "右翼,wing,女性", "title": "“相信所有女人”是一个右翼陷阱", "title_en": "‘Believe All Women’ Is a Right-Wing Trap", "transed": 1, "url": "https://www.nytimes.com/2020/05/18/opinion/tara-reade-believe-all-women.html", "via": "", "real_tags": ["右翼", "wing", "女性"]}, {"category": "", "categoryclass": "", "imagename": "dcfac43dbbaee6b504aabfec4b9c3e41.jpeg", "infoid": 1002719, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "去年12月，一名与美军一起训练的沙特阿拉伯学员在彭萨科拉海军航空站开火，造成3名士兵死亡，8人受伤。联邦调查局找回了两部iPhone，在未能访问他们的数据后，要求苹果解锁。该公司拒绝了，但最终FBI在没有苹果帮助的情况下解锁了其中至少一个，并发现枪手与恐怖组织基地组织之间存在实质性联系。美国司法部长巴尔建议迫使苹果公司在未来采取行动，他说：“……如果不是我们的联邦调查局的独创性，一些运气，以及几个小时的时间和资源，这些信息就不会被发现。底线是：我们的国家安全不能继续掌握在大公司手中，他们把钱放在合法进入和公共安全上。现在是通过立法解决问题的时候了。“。\n目前尚不清楚枪击事件是否是基地组织的命令，但数据显示，枪手与该组织保持了较长时间的联系，包括其领导层。在袭击期间，他开枪打死了两部手机，试图摧毁它们，他一直在使用端到端加密的应用程序，以便与恐怖组织沟通。尽管司法部长巴尔和联邦调查局局长克里斯·雷表示，如果苹果帮助解锁手机，结果会更快出来。\n美国公民自由联盟高级幕僚检察官布雷特·马克斯·考夫曼回应巴尔的评论说，每次发生需要对数字设备进行调查的创伤性事件时，司法部都会大声宣称需要后门进行加密，然后悄悄宣布它确实找到了一种在不威胁整个世界安全和隐私的情况下获取信息的方法。那个喊狼来了的男孩对高喊加密的机构一无所知。尽管巴尔推动后门和手机制造商的合作引起了担忧，但考夫曼的回应并没有提到司法部不是在寻求解锁手机的能力，而是希望尽快做到这一点。\n多年来，苹果拒绝与执法部门合作一直是个问题。该公司希望确保其用户对信任苹果的数据充满信心，但警方和联邦调查局表示，拒绝合作阻碍了调查，并将生命置于危险之中。听起来巴尔想要将一项制度写入法律，迫使苹果公司在未来的案件中遵守这一制度。这项计划有多现实--或者它会得到多少政客的支持--还有待观察，尽管它将迫使苹果重新考虑如何处理用户隐私。", "note_en": "Last December, a Saudi Arabian cadet training with the US military opened fire at Naval Air Station Pensacola, killing three soldiers and wounding eight others. The FBI recovered two iPhones, and after failing to access their data,  asked Apple to unlock them. The company refused, but eventually the FBI unlocked at least one of them without Apple’s help, and discovered substantial ties between the shooter and terrorist group al Qaeda.  US Attorney General Barr suggests  forcing Apple to take action in the future, saying “...if not for our FBI’s ingenuity, some luck, and hours upon hours of time and resources, this information would have remained undiscovered. The bottom line: our national security cannot remain in the hands of big corporations who put dollars over lawful access and public safety. The time has come for a legislative solution.”\n It’s not clear if the shooting was an order from al Qaeda, but the data shows that the shooter was in touch for an extended period of time with the organization, including its leadership. During the attack, he shot both phones in an attempt to destroy them, and he had been using apps with end-to-end encryption in order to communicate with the terrorist group. The FBI was able to access the data regardless, though Attorney General Barr and FBI Director Chris Wray suggest that results would have come much quicker if Apple had helped to unlock the phones.\n  ACLU Senior Staff Attorney Brett Max Kaufman responded to Barr’s comments, saying &#34;Every time there’s a traumatic event requiring investigation into digital devices, the Justice Department loudly claims that it needs backdoors to encryption, and then quietly announces it actually found a way to access information without threatening the security and privacy of the entire world. The boy who cried wolf has nothing on the agency that cried encryption.&#34; While Barr’s push for backdoors and cooperation from phone manufacturers raises concerns, Kaufman’s response doesn’t address that the DoJ isn’t seeking the ability to unlock phones, but to do so as quickly as possible.\n Apple’s refusal to work with law enforcement  has been an issue for years. The company wants to ensure its users feel confident in trusting Apple with their data, yet police and the FBI say that the refusals to cooperate hinder investigations and put lives at risk. It sounds like Barr wants to put a system into law that would oblige Apple to comply in future cases. How realistic this plan is -- or how much buy-in from politicians it will get -- remains to be seen, though it would force Apple to rethink how it approaches user privacy.", "posttime": "2020-05-19 09:28:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "手机,barr,苹果", "title": "AG Barr寻求“立法解决方案”让公司解锁手机", "title_en": "AG Barr Seeks 'Legislative Solution' To Make Companies Unlock Phones", "transed": 1, "url": "https://www.engadget.com/barr-legislation-apple-unlock-iphones-165628162.html", "via": "", "real_tags": ["手机", "barr", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "52a1c8f3affc523bae8bc96d336a3030.png", "infoid": 1002718, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "：Electronics：使用JavaScript、HTML和CSS构建跨平台桌面应用程序-电子/电子", "note_en": ":electron: Build cross-platform desktop apps with JavaScript, HTML, and CSS - electron/electron", "posttime": "2020-05-19 09:12:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电子,electron", "title": "电子v9.0.0", "title_en": "Electron v9.0.0", "transed": 1, "url": "https://github.com/electron/electron/releases/tag/v9.0.0", "via": "", "real_tags": ["电子", "electron"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002717, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它可能不像一级方程式那样令人毛骨悚然，也不像英超足球那样戏剧性，但数独解决方案作为一项观众运动正在获得一批利基追随者。\n相信我，这太让人激动了。只要问问YouTube解谜频道的粉丝们就知道了，该频道的收视率在过去两个月里飙升。其排名靠前的数独视频点击量已超过300万次。\n在日常挑战中，该频道的两位英国主持人，益智奇才西蒙·安东尼(Simon Anthony)和马克·古德利夫(Mark Goodliffe)，讲述了他们试图解决极其困难的数独时的演绎策略和过程。\n让视频如此欢乐的是源源不断的“啊哈！”瞬间，以及数独独具匠心的表演。我今天设置的谜题，奇迹，上周出现在频道上。(单击此处查看今天所有拼图的可打印页面。为了在线解决这些问题，每个网格下面都有一个链接。)。\n奇迹是-屏住呼吸-反骑士，反国王，不连续的数独，这意味着除了正常的数独规则(即从1到9的数字必须在每行、列和笼子中只出现一次)，以下规则也适用：\n1.反骑士规则：骑士移动距离的两个方格不能有相同的数字。(在国际象棋中，骑士的走法是两步走一步，侧步走一步。)。\n2.反王规则：水平、垂直、对角接触的两个正方形不能有相同的数字。(就像在中一样，棋王不能在一步棋之间移动两个方格。)。\n3.不连续规则：水平或垂直相邻的两个正方形不能有连续的数字。\n这些额外的规则中的每一个都给数独带来了一个新的维度，结果是一个精美的谜题，它从如此少的信息开始-只有两条线索-令人眼花缭乱，但却有一个独特的解决方案。它的名字因此而得名，奇迹。\n作为应对奇迹的准备，这里有两个更容易的数独游戏，一个使用反骑士规则，另一个使用非连续规则。(您可以在这里将它们都打印出来。)。我已经帮你完成了每一步的第一步。\n正常的数独规则和“反骑士”规则一样适用，在这个规则中，骑士移动的两个方格不能有相同的数字。换句话说，下面网格中的蓝色单元格都不能包含4，因为它们都是从4开始的骑士移动。\n让我们从4开始吧。我已经将所有被禁止有4的单元格都涂成了蓝色，要么是因为行/列中已经有了4，要么是因为骑士的移动。标记了其中两个保持架中4的唯一可用单元格。\n正常数独规则适用，以及水平或垂直相邻的两个正方形不能有连续数字的非连续规则也适用。(这意味着，比方说，带有3的正方形不能垂直或水平相邻于带有2或4的正方形。)。\n再说一遍，我会让你开始的。看第二排的蓝色方块。它不能包含1、3或6，因为这些数字已在其行/列中。由于它与1相邻，因此它不能包含2，由于它与6相邻，因此它不可能是5。因此它必须是4。绿色单元格之所以是1，是因为该笼子中的其他可用单元格中有三个与2相邻(因此不可能是1)，并且最后一个可用单元格位于具有1的列中。\n正确的!。解决这两个更简单的数独，然后处理奇迹，它同时使用反骑士和非连续规则。(还有反国王规则，这是不言而喻的，既然你已经掌握了另外两条规则，应该很容易理解。)。\n如果你苦苦挣扎，你可以随时观看西蒙破解谜团，实时解开它。\n我在星期一每两周在这里放一个拼图。我总是在寻找大谜题。如果你想推荐一个，给我发电子邮件。\n如果你正在卫报的应用程序中阅读这篇文章，并且每次我发布谜题或它的解决方案时，你都想要一份通知，请点击上面的“关注亚历克斯·贝洛斯”(Follow Alex Bellos)按钮。\n我是几本通俗数学书的作者。我的第一本数学书“亚历克斯在诺伯兰的历险记”刚刚再版，以庆祝它的十周年纪念日。新版完全更新了，包括一个关于数独数学的部分。", "note_en": "It may not be as hair-raising as Formula 1, nor as dramatic as Premier League football, but Sudoku solving is acquiring a niche following as a spectator sport.\n It’s surprisingly thrilling, believe me. Just ask fans of the puzzle-solving YouTube channel  Cracking the Cryptic, which has seen its viewing figures shoot up over the last two months. Its  top Sudoku video has had more than 3 million views.\n In daily challenges, the channel’s two British hosts, puzzle wizards Simon Anthony and Mark Goodliffe, narrate their strategies and processes of deduction as they attempt to solve fiendishly difficult Sudokus.\n What makes the videos so joyous is the constant stream of ‘aha!’ moments, as well as the ingenuity of the sudokus presented. The puzzle I am setting today, the Miracle, appeared on the channel last week. ( Click here for a printable page for all today’s puzzles. To solve them online there is a link underneath each grid.)\n  The Miracle is – hold your breath – an  anti-knight,  anti-king,  non-consecutive sudoku, which means that as well as normal Sudoku rules (that is, the numbers from 1 to 9 must appear only once in each row, column, and cage) the following rules also apply:\n 1. Anti-knight rules: no two squares that are a knight’s move apart can have the same digit. (The knight’s move is 2 along and 1 to the side, as in chess.)\n 2. Anti-king rules: no two squares that touch either horizontally, vertically or diagonally can have the same digit. (As in, no two squares a chess king can move between in a single move.)\n 3. Non-consecutive rules: no two squares that are horizontally or vertically adjacent can have consecutive numbers.\n Each of these extra rules brings a new dimension to Sudoku and the result is an exquisite puzzle, which dazzles by starting with so little information – just two clues! -and yet has a unique solution. Hence it’s name, the Miracle\n As preparation for tackling the Miracle, here are two easier Sudokus, one with the anti-knight rule, and one with the non-consecutive rule. ( You can print them both out here.) I’ve helped you with the first steps in each.\n   Normal sudoku rules apply, as well as the ‘anti-knight’ rule, in which no two squares that are a knight’s move apart can have the same digit. In other words, none of the blue cells in the grid below can contain a 4, because they are all a knight’s move from a 4.\n  Let’s start with the 4s. I have coloured in blue all the cells that are prohibited from having a 4, either because there is already a 4 in the row/column, or because of the knight’s move. The only available cells for a 4 in two of the cages are marked.\n    Normal sudoku rules apply, as well as the non-consecutive rule that no two squares that are horizontally or vertically adjacent can have consecutive numbers. (Meaning that a square that has, say, a 3, cannot be vertically or horizontally adjacent to a square that has a 2 or a 4.)\n Again, I’ll start you off. Look at the blue square on the second row. It cannot contain a 1,3 or a 6 because these numbers are already in its row/column. Since it is adjacent to a 1, it cannot contain a 2, and since it is adjacent to a 6, it cannot be a 5. So it must be a 4. The green cell is a 1 because three of the other available cells in that cage are adjacent to the 2 (and thus cannot be a 1), and the last available cell is in a column with a 1.\n  Right! Solve these two simpler sudokus and then tackle the Miracle, which uses both the anti-knight and the non-consecutive rule. (And the anti-king rule, which is self-explanatory, and should be easy to get your head around now you have mastered the other two rules.)\n If you struggle, you can always  watch Simon at Cracking the Cryptic solve it in real time.\n   I set a puzzle here every two weeks on a Monday. I’m always on the look-out for great puzzles. If you would like to suggest one,  email me.\n If you are reading this in the Guardian app, and you want a notification each time I post a puzzle, or its solution, click the ‘Follow Alex Bellos’ button above.\n  I’m the author of several books of popular maths. My first maths book,  Alex’s Adventures in Numberland, has just been reissued to celebrate its tenth anniversary. The new edition is fully updated, including one section about the maths of Sudoku.", "posttime": "2020-05-19 08:57:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "体育,观众,spectator,规则", "title": "数独作为观众体育不太可能被封锁", "title_en": "Sudoku as Spectator Sport is Unlikely Lockdown Hit", "transed": 1, "url": "https://www.theguardian.com/science/2020/may/18/can-you-solve-it-sudoku-as-spectator-sport-is-unlikely-lockdown-hit", "via": "", "real_tags": ["体育", "观众", "spectator", "规则"]}, {"category": "", "categoryclass": "", "imagename": "9e09bbce989391a592d08ae32a97ef9a.jpg", "infoid": 1002716, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "克莱尔·曼希普向窗外高唱歌曲。Ketaki Chowkhani开始对一只流浪狗吠叫。布莱克·米切尔穿着变装表演。\n当数百万人在流行病中与孤立作斗争时，那些独居的人面临着一种特殊的孤独。\n现在独居的人比历史上任何时候都多，这与半个世纪前相比是一个巨大的转变，这种转变在很大程度上是由女性经济的崛起推动的。\n当然，独处和孤独不是一回事，许多独居的人独处的时间很少。\n在全球范围内的居家订单开始几周或几个月后，我们想知道独自居住的人过得怎么样。他们在做些什么让自己忙碌呢？他们最渴望的是什么？他们觉得没有什么东西就可以自由生活了吗？\n2000多名读者分享了他们的故事和照片。这是其中的一些。\n我在地球上近64年的时间里，58年来一直与他人生活在一起并为他人服务，独自生活是纯粹的幸福。坦率地说，我是很多朋友羡慕的对象，比如当她们的丈夫在同一个房间的时候，她们不能和我通电话。\n作为一名教师，我每天花几个小时做一个虚拟的根管，试图让我的高中生接触到电脑。在这中间的几个小时里，我做了很多很酷的事情。拼图游戏让我想喝狗碗里的杜松子酒，但我尝试过编织、素描、单人纸牌和单人卡拉OK，这很有趣。我从来没有这么开心过。\n我们的消费者精神错乱已经戛然而止。尽管困难重重，但现在世界上有如此多的美丽。在我狭小的空间和寂静中，没有任何我想要或需要的东西。我很好。\n朦胧的恐惧和持续的恐惧。这种感觉是，周围的城墙之外正在发生很多事情，尽管每天都没有太大的变化。你几乎没有控制力。每个人都有嫌疑。每个人都囤积卫生纸。\n在监狱里，我在那里度过了六周的第二次酒后驾车，在与世隔绝的情况下，我已经在那里呆了八周，我见证了人类的丑陋行为以及巨大的慷慨和温柔行为。这名女子秘密地将一袋奇多送到监狱邻区饥饿的准妈妈手中，这与当地披萨店的老板向当地食品储藏室捐赠物品的情况没有什么不同。在急需帮助的时候，这两个人都被感动去帮助他们不那么幸运的邻居。-埃弗森·卡尔曼(Everson Kalman)，40岁，纽约州奥尼奥塔。\n我很内向，我是天生的。我有一个雇主，当我在家工作时，他继续付钱给我。我有无线网络。我没有孩子。一位朋友分享了他的Netflix密码。我被#祝福了。\n我想到了所有有隔离性行为的情侣。哦，能在急速会议之间抽出时间来个速战速决真是太好了。我的前夫在这段时间伸出手来“看看我。”我第四次下载了Bumble。\n有一种感觉是，这次隔离将进一步巩固我的单身。社交距离使得形成有意义的联系几乎是不可能的。\n在我去杂货店买东西之前的一天晚上，我睡不着觉。没有车，我怎么能运够两个星期的杂货呢？如果我病得太重不能去，我怎么去买食品呢？我厌倦了自己做饭。我厌倦了一个人做每件事。\n我32岁的自己挖出了我从6个月大就有的泰迪熊。当我清醒地躺在摇篮里抱着我的毛绒动物，在YouTube的引导冥想下，我忍不住承认，如果我有人用胳膊搂着我，我胸口的紧绷就会减轻。也许我可以(应该？)。给另一个人腾出空间。\n“我为能牵着我爱的人的手的那一天而活着。”\n世界上还有什么比牵手更好的吗？这个甜蜜而简单的手势说明了整个故事。\n我丈夫梅尔和我在第一次约会时手牵手。他现在已经走了快17年了，每次我出去散步，每次我们的孩子或孙子孙女伸手拉我的手，我都会想起他。\n今年冬天，我刚满90岁，冠状病毒就来了。没有访客。不能共用一餐。没有拥抱或亲吻，对我来说最难的是，没有人握住我的手。有时候我想大喊，“为什么？我做了什么？“。其他时候，我对公寓的安全以及家人和朋友的电话感到非常感激。我甚至学会了变焦。\n我等待着隔离结束的那一天，我可以重返这个世界。最重要的是，我活着就是为了能牵着我爱的人的手的那一天。--贝特·费伯(Bette Ferber)，90岁，洛杉矶。\n我和家人住在一起，但在过去一个月左右的时间里，我感觉好像是孤身一人。我的父母和兄弟姐妹都在这里，但我们仍然分开。我大部分时间都独自呆在房间里，但隔着墙我仍然能听到每个人的声音。我听到他们在电话里的声音或他们的脚步声。\n我最喜欢的事情是看着窗外，感觉到我在这个世界上是多么渺小。我房间的窗户就在我的桌子旁边，当我感到压力很大或觉得这一切都太多时，我可以向外看，然后忘记，至少有一段时间是这样。\n我知道单曲不太可能成为邻里的消遣。不管怎样，我都想唱歌。\n于是，一天晚上，我把身子探出卧室的窗户，开始唱起“纽约，纽约”。我的声音响彻小巷，在歌曲结束时，邻居们从他们的窗户里鼓掌，要求再来一次。\n在这周剩下的时间里，我每晚都给邻居唱歌。我是如此孤独地呆在我的公寓里，以至于我甚至没有想到还有成百上千的其他人，独自坐在他们的公寓里，就在几英尺远的地方。\n这十年开始时，我自愿在康复中心呆了33天。没有电话。没有电视。偶尔，工作人员会给我们提供最新的新闻，这是我第一次听说冠状病毒的地方。\n我被释放一小时后就故态复萌了。我搬进了预订了一个月的Airbnb，打算在那之后找到一个新的住处。取而代之的是这个国家关闭了。\n我没有时间去找一个AA小组。想要电话号码，赞助商。会议已经数字化了，我不知道如何参与几十个人的视频聊天，每个人都认识每个人，而我一个人也不认识。他们说成功的戒酒与社区有关，而这正是冠状病毒从我们身上夺走的东西。\n在我所在的城市宣布在家工作的命令之前，我参加了几次会议，但在他们告诉我们不要聚集在10人或10人以上的团体之后。我们30个人挤在一个肮脏的房间里，共享咖啡，尽量不咳嗽或打喷嚏。我痛苦地意识到，在那些时刻，我们都愿意拿死亡来赌一把，因为上瘾也同样可怕。\n我还在我的临时住所。我还是孤身一人。我还在喝酒。我父母一天打六次电话，都很担心。我想摇晃他们(6英尺外)说，“你们是在要求我做一些在世界末日我做不到的事情，当时一切都还在一起。”\n在冠状病毒之前，我通勤去人力资源部上班。晚上和周末，我会在旧金山周围的变装俱乐部扮演玛丽·卢·珀尔(Mary Lou PEAR)，这是我的舞台形象。\n当大流行来袭时，我的生活，就像许多人的生活一样，被颠倒了。我发现自己被限制在我的一居室公寓里，独自一人与我的假发和感觉在一起。但随后，灵感袭来。我开始集思广益，想办法在家里重现我一直计划在俱乐部表演的拖拽数字。\n不知不觉中，我制作了一些我最喜欢的艺术家的变装音乐视频恶搞歌曲：席琳·迪翁(Celine Dion)、多莉·帕顿(Dolly Parton)、沙尼亚·吐温(Shania Twain)和杜瓦·利帕(Dua Lipa。--布莱克·米切尔(Blake Mitchell)，30岁，旧金山。\n几年前我的目标是告诉我爸爸，“我爱你。”这看起来可能没什么大不了的。但对于那些父母是移民的人，亚洲人的父母，任何类型的“我们养活了你们，为什么我们需要说出来？”家长们，这是件大事。\n对我来说，宽恕和同情父亲是一段漫长的旅程。当我快到40岁的时候，我还没有达到目标，但我对自己的意图很满意。\n然后最近，被这场流行病孤立了，在电视屏幕上看到我的父亲，不知道什么时候才能再去看望我的父母，我感觉自己的心变得柔软了。他那布满纹理和背光的脸，在我心里激起了一些东西。当他把iPad交还给我妈妈时，我对他们的手缝说“爱你”。我不知道他有没有听到我说的话。\n上周我又说了一遍：“我爱你，巴。”他正从屏幕上转过身去，但他停顿了一下，身体和声音依旧。他又说了一遍“再见”，声音有点粗暴，也许是一种承认，但这真的无关紧要。我做到了。\n以这种微不足道但意义重大的方式，感觉多年的负担消失了，这是多么神奇的事情。感受爱在内心激荡，像恩典一样。--邱佳迪(Chia-Ti Chiu，音译)，41岁，布鲁克林。\n当印度进入禁闭状态时，我爱上了窗外的一只棕色流浪狗。\n我每天都会看到她，不是睡觉，就是静静地玩一块布。在最初的几天里，我会大声喊她。她会转过身来，有点惊讶，而我疯狂地挥手想要引起她的注意。因为我不确定她是男是女，我就用双筒望远镜监视她。这为我在朋友圈赢得了“变态教授”的称号。\n我的爱不对等的第一个迹象是她开始不理睬我的电话。就在那时，我开始对她吠叫。我可以向你保证，这对我来说是一次非常令人满意的经历。另一方面，她竖起耳朵，简短而震惊地看了我一眼。\n我的朋友和家人担心我神志不清，但他们更担心我的邻居会听到我的声音。我母亲提出要更多地和我通电话。然后意想不到的事情发生了。小狗吠了一声。--凯塔基·乔哈尼(Ketaki Chowkhani)，34岁，印度卡纳塔克邦马尼帕尔。\n去年秋天，一位朋友问我：“如果你有世界上所有的时间和金钱，你会做什么？”\n“我想我要切洋葱，”我说。我一直讨厌洋葱，直到最近，我终于学会了如何把它们切成令人满意的方块，然后把它们煮成平底锅里没有美味的东西。\n这成了我新的、卑微的乐趣。我喜欢我的刀在砧板上发出的有节奏的声音，因为我砍穿了一层又一层，感觉到结构坍塌了。我满怀爱意地切开，我的厨艺也提高了。现在，洋葱是我杂货店的主食。\n我手头要带几瓶红色的和一袋黄色的，以备不时之需。当我任教和学习的大学搬到网上时，我把红色切成薄片，用来做沙拉。当我发现领养狗的表格填错时，我把2个土豆和6个土豆切成了西班牙玉米饼。\n因为我的公寓是工作室，洋葱的臭味弥漫在我的生活区。唯一没有洋葱的区域是浴室，它恰好大得不成比例，光线也很好，所以我在那里呆的时间越来越长。\n切洋葱的确会让人流泪，我认为这是一种好处；为切好的洋葱哭泣是我最近最好的哭泣方式。他们的皮肤是几周来唯一碰过我的皮肤。-朱莉·伦德(Julie Lunde)，26岁，亚利桑那州图森市。\n另一方面，自从我们开始封锁以来，我的丈夫戴夫已经接待了多名访客-包括一个小丑家庭，一群海盗和修剪树木的人，我们的成年孩子，以及许多兽医客户。\n我尽我最大的努力去找戴夫，但他很少说得通。然后，当他与一位看不见的访客滔滔不绝地交谈时，我感到困惑不解。\n戴夫为多人摆放餐桌，为离开的客人打包衣服，并为新来的客人做好准备。他和“小丑太太”接触最多的是问我和她相处得好不好。当我得知他们是直呼其名时(她的名字是露露)，他可能已经察觉到我感到奇怪的嫉妒。当他为我们成年的孩子摆桌子时，我感到最难过，特别是现在，他们不能来参观了。\n在加冕之前，我们在家里的关系没有太大的不同。但是因为我们有一种社交生活，屋外有真人，屋里有真正的访客，所以我并不感到孤单。\n戴夫打盹的时候，我假装我真的一个人住。如此自由！我没有负罪感，做我想做的事，吃我想吃的东西，看我想看的东西，穿我想穿的衣服(我确信我不能在这方面与小丑夫人竞争)。\n我现在还可以。但我知道，当生活再次开放时，我会张开双臂疯狂地欢迎我的来访者回来。\n下午与鸟儿、松鼠和偶尔出现的兔子一起在我的后院度过，给我带来了如此多的安慰。所有这些高大优雅的树；斑驳的阳光。一线希望已经放慢到可以享受我所拥有的了。一种不同的、更重要的会计核算。自然界中的时间就是财富。\n让我们把一切都公之于众：我是一个40岁出头，超重，同性恋，会唱歌剧的技术作家，过早地变白了。又不是几十个性伴侣在我门外排队。但我有一些朋友，我们有福利，每个人都很高兴，没有人渴望任何改变。\n作为一个90年代中期出柜的人，我被教导要恐惧性，认识到它可以杀死我，就像其他很多LGTQ的人一样。最近出现的暴露前预防措施(PrEP)意味着性不再等同于死亡，在几年的时间里，生活是美好的。\n进入新的冠状病毒，再一次性=死亡。我的隔绝泡沫不包括我的任何有福利的朋友；我们没有那种级别的关系。我们已经发送了一些茄子表情符号来表示我们还活着，但我们中没有人会冒着死亡的风险亲自联系。\n我现在在想我是否还能再做爱。我上周停止服用PrEP了。我用这笔钱买了一件长袍和一条头巾。如果我要隐居，那我看起来就像个隐士。\n在新奥尔良是不可能感到孤独的。试着安静地散步，在酒吧独自栖息，或者站在杂货店排队。有人会跟你说话--而且不仅仅是天气。\n我是二月份去瑞士参加一个会议的。但随后在意大利爆发了一个集群。边境关闭了。我离开后就回家了。\n今天标志着我几乎没有离开我的一居室联排别墅两个多月。我散步了几次，有一次去杂货店买东西。\n在杂货店里，我低头看着。盯着篮子，我意识到：我不需要咖啡。我不需要羽衣甘蓝。谁碰了这些鳄梨？这些都是过去的奢侈品。\n独居开始让人付出代价。谁会知道我会不会走下坡路呢？\n我真的需要再购物一次，但我相信会有陌生人问，“宝贝，你好吗？”我会忍不住告诉他们。但当你必须在六英尺外大声叫喊时，情况就不同了。\n我伴侣去世的痛苦不像以前那么剧烈了，但没有改变的是我对孤独的渴望和对社会认可的渴望。请不要建议一个欢乐时光。请不要邀请我参加你的生日聚会。请不要问我是否愿意和你们一起绕湖散步。因为我不喜欢，但我也不想解释为什么。\n我知道当家庭主妇的订单到来时感到高兴是自私的。我知道数百万人已经受到影响。但是在我的房间里，在我自己小小的悲伤的心里，我松了一口气。当我没有自我可带时，我终于从那些要求我带上自己的聚会中解脱出来。\n我一个人住，我喜欢这样。我吃的奥利奥比以往任何时候都多，但我也在做更健康的事情。我骑自行车。我烤柠檬椰子蛋糕。我给多年未见的朋友写信。我拉大提琴。当我想的时候，我会联系我的邻居，我的家人和我的朋友。一直以来，我都很高兴自己能独处，能在自己的心里活动，能保持甜蜜、甜蜜的与世隔绝。\n在下午5点期间。在Zoom的夸兰提尼上，我听到朋友们不好意思地承认，自言自语是多么令人安慰、有趣，甚至是启示性的。但我一生都在自言自语--个人的和职业的。当我创建Juanito来容纳我自己的方方面面时，我还是个孩子的时候就成了一个腹语者。就在那时，在公共场合自言自语开始流行起来。对Juanito的反应从好奇、着迷到彻头彻尾的恐惧，不一而足。\n当我们在原地避难的时候，我一直想写一部关于与胡尼托练习腹语的个人发现的节目。流行病已经消除了分心的事情，我们可以在任何时候排练。华尼托带着手套、面罩和一盒高乐氏纸巾出现在我们的彩排现场，这让我和他自己都很开心。他要求我在把手伸进他背上之前戴上手套。\n华尼托又来了。他坚持认为，我们应该庆祝我的幸运，因为我是一名口技表演者，而当时我戴着必要的口罩，不需要控制嘴唇。--桑德拉·卢科夫(Sandra Luckow)，55岁，纽约\n我和我3岁的侄女莱拉(Lila)在FaceTime上通话两分钟后，她问我妹妹，“我们现在可以看另一个节目吗？”(我就是那个节目，我让她很无聊。)。\n当我和莱拉在没有妹妹的情况下聊天时，她有时会宣布她要去另一个房间。尽管她承诺“很快就会回来”，但我还是感到一阵恐慌，就好像我身临其境地生活在手机里一样。没有腿跟着她，她离开我的地方我都被困住了。有一次，她把我留在一个塑料南瓜里。“不！”我喊着，因为我的视野被橙色的墙缩小了。“等等！”\n我想知道莱拉是不是开始把真人版的我和像素化的版混为一谈了。我最后一次在现实生活中见到她是在四个月前，也就是750年前的蹒跚学步的时候。\n我想知道我是不是也开始把真人版的我和像素化的版混为一谈了。在人们开始质疑自己存在的现实之前，没有面对面的人类接触还能持续多久？--艾米·邓普西(Amy Dempsey)，40岁，缅因州南波特兰。\n对于像我这样在过去22年里一直与躁郁症作斗争的人来说，流行病是一个难题。在流行病中保持身体健康的因素-社会疏远-会在灵魂中溃烂疾病。\n抑郁症的行为疗法大致是这样的：“到外面去！探望家人。拥抱一个朋友。参加一个集体健身课。对陌生人微笑。无论你做什么，不要整天一个人穿着睡衣，躺在床上吃米饭布丁，阅读关于一种不可预测的致命疾病的文章。“。\n至少可以说，这几天过得很艰难。但后来我想起来了，一切最终都会过去的。这也是他们在行为疗法中教的东西。\n编辑：杰西卡·班尼特，丹尼尔·琼斯，米娅·李和安雅·斯特泽迈恩。照片编辑：伊夫·莱昂斯。\n上图，从左上到右：Kamilah Aisha Moon，Ketaki Chowkhani，Maxwell Chien，Michi Cabrera，Melanie Lan，Christopher Russell，Desiree Ontivieros，Joan Bunney，Makea King，Dylan Cohen，Kate Ziegler，Daniel Issroff，Patricia Hamilton，Natalia Abelley ra，Daniel Iammatteo，Jane Seaton", "note_en": "Claire Manship belted songs out the window. Ketaki Chowkhani began barking at a stray puppy. Blake Mitchell performed in drag.\n As millions of people grapple with isolation in a pandemic, those who live alone face a particular kind of solitude.\n More people live alone now than at any other time in history, a seismic shift from even a half-century ago, and one fueled largely by women’s economic rise.\n Being alone and being lonely are not the same thing, of course, and many people who live by themselves spend little time alone.\n Weeks or months into the stay-at-home orders worldwide, we wanted to know how solo dwellers were faring. What were they doing to keep themselves occupied? What did they most long for? What did they feel liberated to live without?\n More than 2,000 readers shared their stories and their photos. Here are some of them.\n    I’ve been living with and serving others for 58 of my almost 64 years on earth, and living solo is pure bliss. Frankly, I’m the envy of plenty of friends, like women who can’t talk to me on the phone when their husbands are in the same room.\n As a teacher, I spend a few hours a day performing a virtual root canal trying to get my high school kids to engage with a computer. In the intervening hours, I do lots of cool things. Jigsaw puzzles make me want to drink gin from the dog bowl, but I’ve tried knitting, sketching, solitaire and solo karaoke, which is hilarious. I’ve never been happier.\n Our consumer insanity has come to a screeching halt. Despite the suffering, there is so much beauty right now in the world. In my little space and silence, there is nothing I want or need. I’m good.\n  Nebulous fear and constant dread. The sense that a lot is going on beyond the surrounding walls, though nothing changes much from day to day. You have little control. Everyone is suspect. Everyone hoards toilet paper.\n In jail, where I spent six weeks for a second DWI, and in isolation, where I have now been for eight weeks, I have witnessed humans’ ugly behavior as well as tremendous acts of generosity and tenderness. The woman who clandestinely delivered a bag of Cheetos to the hungry, expectant mother in the adjoining section of the jail is not unlike the owner of the local pizza parlor donating items to the local food pantry. Both are moved to help their less fortunate neighbors in a time of great need.  —  Everson Kalman, 40, Oneonta, N.Y.\n  Introvert that I am, I was made for this. I had an employer who continued to pay me as I worked from home. I had Wi-Fi. I have no children. A friend shared his Netflix password. I was #blessed.\n I thought of all the couples having quarantine sex. Oh, to be able to squeeze in a quickie between Zoom meetings. My ex reached out during this time to “check on me.” I downloaded Bumble for the fourth time.\n  There is a sense that this quarantine will further cement my singleness. Social distancing makes forming meaningful connections feel almost impossible.\n I couldn’t sleep one night before I went grocery shopping. How will I haul two weeks’ worth of groceries without a car? How will I get groceries if I’m too ill to go? I’m so tired of my own cooking. I’m so tired of doing everything alone.\n My 32-year-old self dug out the teddy bear I’ve had since I was 6 months old. As I lay awake cradling my stuffed animal, with a guided meditation from YouTube, I couldn’t help but concede that the tightness in my chest would have been eased if I had someone to wrap their arms around me. Perhaps I could (should?) make space for another person.\n  ‘I Live for the Day When I Can Hold the Hands of Those I Love’\n Is there anything better in the world than holding hands? That sweet, simple gesture tells the whole story.\n  My husband, Mel, and I held hands on our first date. He has been gone almost 17 years now, and I think of him every time I go for a walk and every time one of our kids or grandkids reaches for my hand.\n  This winter, after I turned 90, coronavirus arrived. No visitors. No shared meals. No hugs or kisses and, hardest for me, no one to hold my hand. Sometimes I want to shout, “Why? What did I do?” Other times I feel so grateful for the safety of my apartment and calls from family and friends. I’ve even learned to Zoom.\n I wait for the day when this quarantine is over and I can go back out into the world. And most importantly, I live for the day when I can hold the hands of those I love.  —  Bette Ferber, 90, Los Angeles\n    I live with my family, but for the past month or so I have felt as if I’ve been alone. My mother, father and siblings are here, but we are still apart. I spend most of the time in my room, alone, but I can still hear everyone through the walls. I listen to their voices on the phone or their steps moving around.\n My favorite thing is to look out the window and feel how small I am next to the world. The window in my room is right beside my desk, and when I’m getting stressed or feel like this is all too much, I can look out and forget, at least for a moment.\n    I knew a singalong wasn’t likely to become a neighborhood pastime. I wanted to sing anyway.\n And so, one evening, I leaned out my bedroom window and started singing a rendition of “New York, New York.” My voice was ringing down the alley, and by the end of the song, neighbors were applauding from their windows and calling for an encore.\n I sang for my neighbors every night for the rest of the week. I had been so alone in my apartment that it didn’t even occur to me there were hundreds of other people, sitting alone in theirs, just a few feet away.\n  I began this decade by voluntarily spending 33 days in rehab. No phones. No TV. Occasionally, staff would give us updates about the news, which is where I first heard of the coronavirus.\n I relapsed an hour after being released. I moved into an Airbnb that I had booked for a month, with the intention of finding a new place to live after. The country shut down instead.\n I did not have time to find an AA group. To get phone numbers, a sponsor. Meetings have moved digitally, and I don’t know how to participate in a video chat of dozens of people where everyone knows everyone and I know no one. They say successful sobriety is about community, which is the very thing Covid-19 has stripped from us.\n I went to a few meetings before my city announced a stay-at-home order, but after they told us not to gather in groups of 10 or more. There would be 30 of us packed in a dirty room, sharing coffee, trying not to cough or sneeze. I was painfully aware, in those moments, that we were all willing to take a gamble on death because addiction is just as terrifying.\n I am still in my temporary home. I am still alone. I am still drinking. My parents call six times a day, concerned. And I want to shake them (from six feet away) and say, “You are asking me to do something in the end of the world that I couldn’t do when everything was still held together.”\n    Before Covid-19, I commuted to my day job in  H.R. On evenings and weekends, I performed in drag clubs around San Francisco as  Mary Lou Pearl, my stage persona.\n When the pandemic hit, my life, like the lives of so many, was flipped upside down. I found myself confined to my one-bedroom apartment, alone with my wigs and feelings. But then, inspiration hit. I began brainstorming ways I could recreate drag numbers at home that I had been planning to perform at the clubs.\n  Before I knew it, I had produced drag music video parodies of songs by some of my favorite artists: Celine Dion, Dolly Parton, Shania Twain and Dua Lipa.  —  Blake Mitchell, 30, San Francisco\n  My goal a couple of years ago was to tell my dad, “I love you.” It might not seem like a big deal. But to those who have immigrant parents, Asian parents, any type of “We provide for you so why do we need to say it?” parents, it’s a big deal.\n It has been a long journey for me toward forgiveness and compassion for my dad. As I neared 40, I hadn’t been able to reach the goal but was content enough with my intention.\n Then recently, isolated by this pandemic, seeing my dad on the video screen and not knowing when I would visit my parents again, I felt my heart soften. His face, grainy and backlit, stirred something within me. As he handed back the iPad to my mom, I said, “Love you” to the gap between their hands. I didn’t know if he heard me.\n Last week I said it again: “I love you, Ba.” He was turning away from the screen, but he paused, his body and voice still. He said “Goodbye” again, somewhat gruffly, perhaps an acknowledgment, but it doesn’t really matter. I did it.\n How miraculous, in this small but significant way, to feel years of burden fall away. To feel love stirring within, like grace.  —  Chia-Ti Chiu, 41, Brooklyn\n   When India went into lockdown, I fell in love with a brown stray puppy outside my window.\n I would see her every day, either sleeping or quietly playing with a piece of cloth. In the first few days, I would call out to her. She would turn, a little surprised, while I waved frantically to get her attention. Since I was not sure if she was a male or female, I spied on her with a pair of binoculars. This earned me the name “pervert professor” in my friend circle.\n  The first sign that my love was nonreciprocal was when she began ignoring my calls. That is when I started barking at her. I can assure you, it was a very satisfying experience for me. She, on the other hand, cocked her ears and gave me a brief, shocked look.\n My friends and family worried for my sanity, but they were more worried that my neighbors might hear me. My mother offered to speak to me more often on the phone. Then the unexpected happened. The puppy barked back.   — Ketaki Chowkhani, 34, Manipal, Karnataka, India\n  Last fall, a friend asked me: “What would you do if you had all the time and money in the world?”\n “I think I’d chop onions,” I said. I had hated onions until recently, when I had finally learned how to chop them into satisfying cubes and cook the pieces down to delicious nothings in the pan.\n It became my new, menial pleasure. I loved the rhythmic sounds my knife made against the chopping board as I hacked through the layers and felt the structure give way. I cut with love, and my cooking improved. Now, onions are a staple of my grocery runs.\n I like to have a few reds and a bag of yellows on hand in case of minor emergencies. When the university where I teach and study moved online, I sliced the reds for use in a salad. When I discovered I had filled out the foster dog form incorrectly, I diced two and six potatoes for a Spanish tortilla.\n Because my apartment is a studio, the stink of onions has permeated my living area. The only onion-free zone is the bathroom, which happens to be disproportionately large and well lit, so I’m spending an increasing amount of time in there.\n It’s true that chopping raw onions can induce tears, which I view as a benefit; crying over cut onions is the best kind of crying I do these days. Their skins are the only ones that have touched mine in weeks.  —  Julie Lunde, 26, Tucson, Ariz.\n   My husband, Dave, on the other hand, has had multiple visitors since our lockdown began — including a family of clowns, a group of pirates and tree trimmers, our grown children, and many veterinary clients.\n I do my best to engage Dave, but he rarely makes sense. Then I sit, mystified, when he has a fluid stream of conversation with an invisible visitor.\n Dave sets the dining table for multiple people, packs clothes for departing guests and gets ready for new arrivals. He engages most with “Mrs. Clown” and asks if I am on good terms with her. He might have sensed that I felt weirdly jealous when I learned that they are on a first-name basis (hers is Lulu). I am saddest when he sets the table for our grown children, especially now, when they can’t visit.\n Pre-corona, our relationship at home was not much different. But because we had a social life with real people outside our home and real visitors inside it, I didn’t feel so alone.\n When Dave is napping, I pretend that I truly do live alone. Such freedom! Without guilt, I do what I want, eat what I want, watch what I want and wear what I want (I am sure I can’t compete in that area with Mrs. Clown).\n I am OK for now. But I know that when life opens up again, I will welcome my visitors back with frantic, open arms.\n   Spending afternoons in my backyard with the birds, squirrels and occasional rabbit has brought me so much solace. All of these tall, elegant trees; dappled sunlight. A silver lining has been slowing down enough to enjoy what I have. A different, more crucial kind of accounting. Time in nature is wealth.\n  Let’s put it all out there: I’m an early 40s, overweight, gay, opera-singing technical writer who went prematurely silver. It isn’t like dozens of sex partners were lining up outside my door. But I had some friends, and we had benefits, and everyone was happy, and no one was eager for anything to change.\n As someone who came out in the mid-’90s, I was taught to be terrified of sex, learned that it could kill me as it had so many other L.G.B.T.Q. people. The recent advent of pre-exposure prophylaxis (PrEP) meant that sex no longer equaled death, and for a few years, life was great.\n Enter the new coronavirus, and once again sex = death. My isolation bubble does not include any of my friends with benefits; we don’t have that level of relationship. We’ve sent some eggplant emojis to say we’re alive, but none of us is risking death to connect in person.\n I’m now wondering if I’ll ever have sex again. I stopped taking PrEP last week. I used the money to buy a caftan and a turban. If I’m going to be a recluse, I may as well look the part.\n   It’s impossible to be lonely in New Orleans. Try going on a quiet walk, perching solo at a bar or standing in a grocery line. Someone will talk to you — and not just about the weather.\n I left in February for a meeting in Switzerland. But then a cluster broke out in Italy. Borders were closed. I left and came home.\n Today marks more than two months that I’ve scarcely left my one-bedroom townhome. I took a couple of walks and went grocery shopping once.\n  At the grocery I kept my eyes down. Staring at the basket, I realized: I didn’t need the coffee. I didn’t need the kale. Who touched these avocados? Those were luxuries of the past.\n Living alone started to take its toll. Who would know if I took a bad turn?\n I really need to shop again, but I’m sure some stranger will ask, “How you doin’, baby?” and I’ll be tempted to tell them. But it’s not the same when you have to shout from six feet away.\n  The pain of my partner’s death is not as sharp as it once was, but what hasn’t changed is my hunger for solitude and an ache for societal approval of it. Please don’t suggest a happy hour. Please don’t invite me to your birthday party. Please don’t ask if I would like to join you for a walk around the lake. Because I don’t feel like it, but also, I don’t want to have to explain why.\n I knew it was selfish to feel glad when the stay-at-home orders came in. I knew millions were already affected. But inside my room, in my own little grieving heart, I was relieved. I was at last released from the gatherings that demanded I bring myself when I had no self to bring.\n I’m living alone and I love it. I’m eating more Oreos than ever, but I’m also doing healthier things. I ride my bike. I bake lemon coconut cake. I write letters to friends I haven’t seen in years. I play my cello. I reach out to my neighbors, my family and my friends when I want to. And all the while, I rejoice in the permission to keep to myself, to move around in my own heart, to remain in sweet, sweet isolation.\n    During 5 p.m. quaran-tinis on Zoom, I hear sheepish confessions from friends about how comforting, entertaining and even revelatory talking to oneself can be. But I have been talking to myself my entire life — personally and professionally. I became a ventriloquist as a child, when I created Juanito to house aspects of myself. It was then that talking to myself in public took off. Responses to Juanito range from intrigued and fascinated to downright scared.\n While we’re sheltering in place, I have been wanting to write a show about the personal discoveries of practicing ventriloquism with Juanito. The pandemic has cut out the distractions and we can rehearse at any hour. Juanito amused himself and me by showing up at our rehearsal in gloves, a mask and a container of Clorox wipes. He demanded I put on gloves before sticking my hand into his back.\n Once again, Juanito’s there. He insisted that we should celebrate my good fortune of being a ventriloquist at a time when, with a required mask, lip control isn’t required.  —  Sandra Luckow, 55, New York\n  Two minutes into my FaceTime call with my 3-year-old niece, Lila, she asked my sister, “Can we watch a different show now?”(I was the show, and I was boring her.)\n When Lila and I FaceTime without my sister, she sometimes announces that she’s going to another room. Even though she promises to “come back soon,” I feel a rush of panic, as if I physically live inside the phone. With no legs to follow her, I’m trapped wherever she leaves me. Once, she left me inside a plastic pumpkin. “No!” I shouted, as my field of vision was narrowed by orange walls. “Wait!”\n I wonder if Lila is starting to conflate the human version of me with the pixelated one. The last time I saw her in real life was four months ago, i.e. 750 years in toddler time.\n I wonder if I, too, am beginning to conflate the human version of me with the pixelated one. How long can people go without in-person human contact before they begin to question the reality of their own existence?  —  Amy Dempsey, 40, South Portland, Maine\n   A pandemic is a conundrum for someone like me, a person who has struggled with bipolar depression for the last 22 years. What keeps the body healthy in a pandemic — social distancing — festers sickness in the soul.\n Behavioral therapy for depression goes something like this: “Go outside! Visit family. Hug a friend. Take a group exercise class. Smile at a stranger. And whatever you do, don’t stay alone in your pajamas all day, eating rice pudding in bed and reading articles about an unpredictable, deadly disease.”\n The days have been difficult, to say the least. But then I remember that everything, eventually, will pass. That’s something they teach in behavioral therapy, too.\n Editing by Jessica Bennett, Daniel Jones, Miya Lee and Anya Strzemien. Photo editing by Eve Lyons.\n Top photo, from top left to right: Kamilah Aisha Moon, Ketaki Chowkhani, Maxwell Chien, Michi Cabrera, Melanie Lan, Christopher Russell, Desiree Ontivieros, Joan Bunney, Makea King, Dylan Cohen, Kate Ziegler, Daniel Issroff, Patricia Hamilton, Natalia Abelleyra, Daniel Iammatteo, Jane Seaton", "posttime": "2020-05-19 08:55:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "孤立", "title": "独自的 / 仅仅 / 孤立的 / 孤独的", "title_en": "Alone", "transed": 1, "url": "https://www.nytimes.com/2020/05/13/style/coronavirus-modern-love-living-alone.html", "via": "", "real_tags": ["孤立"]}, {"category": "", "categoryclass": "", "imagename": "3ff845809b7870bf2fe03f06cbb4cff2.png", "infoid": 1002715, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "目前，许多科学论文都发表在订阅期刊上，并被锁在付费墙后面。这种模式阻碍了研究，并将公共资金转移到寄生出版商，同时几乎完全依赖于研究人员的无偿工作。我们认为，科学应该朝着一种不同的出版模式发展，在这种模式下，所有的科学出版物都可以免费向读者开放获取，而不会向作者收取不公平的价格。\n出于这个原因，我们将避免为那些没有公开我们所审查的研究的场所担任同行审查员。相反，在如何分配我们的审查时间和组织努力方面，我们将优先考虑开放使用的场馆。\n如果您的名字是在您不知情和无意的情况下添加到此列表中的，请联系我们，我们将删除它。", "note_en": "Many scientific articles are currently published in subscriptionjournals and locked behind paywalls. This model impedes research and divertspublic funding to parasitic publishers, while relying almost entirely on theunpaid work of researchers. We believe that science should evolvetowards a different publishing model in which all scientific publications arefreely available to readers as open access, without charging authors unfairprices.\n For this reason, we will avoid serving as peer reviewers for venues that do not make publicly available the research that we review. Instead, we will give priority to open-access venues in how we allocate our reviewing time and organizational efforts.\n     If your name was added to this list without your knowledge and intention,please  contact us and we will remove it.", "posttime": "2020-05-19 08:39:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,free,研究", "title": "没有免费的景观吗？没有复审。", "title_en": "No free view? No review.", "transed": 1, "url": "https://nofreeviewnoreview.org/", "via": "", "real_tags": ["免费", "free", "研究"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002714, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软的量子团队很兴奋地宣布了Q#编码大赛-2020年夏季，这是Q#系列比赛中的第三场！在这场比赛中，你可以考验你的量子编程技能，在Q#中解决量子计算任务。获奖者(以及一些幸运的参与者)将获得一件Microsoft Quantum T恤！\n与经典计算相比，量子计算是一种截然不同的计算范式。事实上，它是如此不同，以至于一些被认为是经典难以处理的任务(如整数因式分解或模拟物理系统)可以在量子计算机上高效地执行。2017年12月，微软推出了Quantum开发工具包，其中包含Q#编程语言。\n2018年夏天，我们举办了首届量子编程大赛，其中包括量子计算入门主题的问题：叠加、测量、量子神谕和简单算法。2019年冬天，我们主办了第二届量子编程大赛，在这些主题上提供了更难的问题，以及一些关于实施么正变换的任务。这次比赛将引入新的任务类型，以及对以前任务的一些曲折。\n比赛将从6月19日持续到6月22日。像往常一样，我们将在大赛前的周末(6月12日至6月15日)举行热身活动，让您有机会在大赛前熟悉大赛环境和提交系统。参加热身活动是可选的。\n主赛和热身赛将有几个不同复杂程度的任务。\n要解决每个任务，您将编写Q#代码来实现所描述的任务。仅在Q#中接受解决方案。\n如果解决方案通过了预定义测试集中的所有测试，则该解决方案是正确的。提交后不久，您就会知道解决方案是否正确。\n平局是根据所有任务的最低惩罚时间解决的，该时间计算为任何正确解决的任务的最新提交时间(自比赛开始以来的时间)。不合格的提交不会受到惩罚。\n大赛和热身赛将奖励T恤如下：主竞赛排名前50名的参与者将获得一件Microsoft Quantum T恤。\n在主竞赛中随机抽取25名参赛者，他们至少解决了一个问题，但没有进入前50名，他们将获得一件微软量子T恤。\n热身赛随机抽取25名参与者，他们解决了至少一个问题，但在主竞赛中没有赢得一件T恤，他们将获得一件微软量子T恤。\n所有T恤获胜者将在主竞赛结束后选出。T恤设计将于稍后公布：-)。\n不需要购买。必须年满16岁或更大。比赛将于6月22日/20日结束，具体请看官方规则。\nQuantum Katas-帮助您学习量子计算和Q#的教程和编程练习的集合(包括以前比赛中的大部分问题)。\n请注意，本次竞赛将使用Q#0.11.2004.2825，而之前的竞赛分别使用Q#0.2和Q#0.4。我们已经从以前的比赛中更新了测试工具，以支持最新版本的Q#，因此您可以将它们用于练习。", "note_en": "Microsoft&#39;s Quantum team is excited to announce the Q# Coding Contest – Summer 2020, the third in the series of Q# contests! In this contest you can put your quantum programming skills to the test, solving quantum computing tasks in Q#. The winners (as well as some lucky participants) will receive a Microsoft Quantum T-shirt!\n Quantum computing is a radically different computing paradigm compared to classical computing. Indeed, it is so different that some tasks that are believed to be classically intractable (such as factoring integers or simulating physical systems) can be performed efficiently on a quantum computer. In December 2017 Microsoft introduced the  Quantum Development Kit which includes the Q# programming language.\n In summer of 2018 we hosted the  first quantum programming contest, which included problems on introductory topics in quantum computing: superposition, measurement, quantum oracles and simple algorithms. In winter of 2019 we hosted the  second quantum programming contest, which offered harder problems on those topics plus some tasks on implementing unitary transformations. This contest will introduce new types of tasks, as well as some twists on the previous ones.\n The contest will run  from June 19 to June 22. As usual, we will hold a warmup round the weekend before the contest,  from June 12 to June 15, to give you an opportunity to get familiar with the contest environment and submission system before the main contest. Participation in the warmup round is optional.\n   The main contest and the warmup round will have several tasks of various complexity levels.\n To solve each task, you will write Q# code to implement the described task. Solutions are accepted in Q# only.\n The solution is correct if it passes all tests from a predefined test set. You will know whether the solution is correct soon after submitting it.\n  Ties are resolved based on lowest penalty time for all tasks, which is computed as the latest submission time (the time since the start of the contest) for any of the correctly solved tasks. There is no penalty for failed submissions.\n The contest and the warmup round will award T-shirts as follows:  The top 50 ranked participants in the main contest will receive a Microsoft Quantum T-shirt.\n Random 25 participants of the main contest who solved at least one problem but didn&#39;t finish in the top 50 will receive a Microsoft Quantum T-shirt.\n Random 25 participants of the warmup round who solved at least one problem but didn&#39;t win a T-shirt in the main contest will receive a Microsoft Quantum T-shirt.\n All T-shirt winners will be selected after the end of the main contest. T-shirt designs will be announced later :-)\n NO PURCHASE NECESSARY. Must be 16 years of age or older. Game ends 06/22/20. For details, see the  Official Rules.\n        The  Quantum Katas — a collection of tutorials and programming exercises that help you learn quantum computing and Q# (includes most of the problems from previous contests).\n  Note that this contest will use Q# 0.11.2004.2825, while the previous contests used Q# 0.2 and Q# 0.4, respectively. We&#39;ve updated the test harnesses from the previous contests to support the latest version of Q#, so you can use them for practice.", "posttime": "2020-05-19 08:24:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,微软,2020,编码,量子", "title": "公告：微软Q编码大赛-2020年夏季", "title_en": "Announcement: Microsoft Q Coding Contest – Summer 2020", "transed": 1, "url": "https://codeforces.com/blog/entry/77614", "via": "", "real_tags": ["microsoft", "微软", "2020", "编码", "量子"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002712, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当Python和R不能依赖于C/C++所支持的功能或库时，它们就会变得很慢。它们不仅对于某些算法开发是低效的，而且对于诸如FASTQ解析这样的常见任务也是低效的。使用这些语言限制了生物学家的研究。有时，您可能有一个绝妙的想法，但仅仅因为使用的语言不能快速实现。这可能会令人沮丧。我一直在寻找一种供生物学家快速易用的高级语言。这篇博文报道了我的一些探索。虽然没有定论，但您可能仍会感兴趣。\n在这里，我用几种语言(包括C、Python、Javascript、LuaJIT、Julia、Nim和Crystal)实现了两个任务，FASTQ解析和间隔重叠查询。我在比较他们的表现。我精通C语言，对Python略知一二。我使用LuaJIT和Javascript已经有几年了。我对朱莉娅、尼姆和克里斯托同样是新手。这些语言中的MyImplementation可能不是最佳的。阅读结果时，请牢记这一重要注意事项。\n源代码和完整的表格可以在我的lh3/biofastgithub repo上找到。您还可以找到机器设置、正在使用的库版本和一些技术说明。我在这里只展示部分结果。\n下表显示了解析gzip格式的FASTQ(T Gzip)或普通格式的FASTQ(t格式)所需的CPU时间(以秒为单位)。我们只计算序列的数量，并计算长度之和。除了这两个BioPython实现之外，其他所有实现都使用与我用C语言编写的kseq.hparser类似的算法。\n该基准测试侧重于I/O和字符串处理。我替换了几种语言的低级I/O以获得良好的性能。代码看起来更像C，而不是高级语言，但至少这些语言让我不用求助于C就能获得强大的功能。\n值得一提的是，默认的BioPython FASTQ解析器在普通FASTQ上慢70倍以上，在gzip的FASTQ上慢10倍以上。在人工30Xgzip的FASTQ上运行C实现需要20分钟。defaultBioPython解析器将需要四个半小时，与bwa-mem2多线程映射相当。如果您想解析FASTQ，但不需要其他BioPython功能，请选择PyFastx或mappy。\n下表显示了与另一个间隔列表比较，用于计算列表间隔覆盖范围的CPU时间(以秒为单位)。计时和内存占用有两列，具体取决于加载到内存中的列表。\n该算法的实现非常简单。这主要是关于对大型阵列的随机访问。JavaScript和LuaJIT在这里要慢得多，因为我不能将对象放入数组中；我只能将对对象的引用放入数组中。\n以下内容是主观的，可能会引起争议，但我需要直言不讳。表现并不是一切。一些微妙但重要的细节只对那些编写这些程序的人是显而易见的。\n这是两种相似的语言。它们很旧，在设计时没有考虑到即时(JIT)编译。人们后来开发了JIT编译器，并使它们变得更快。我喜欢这两种语言。它们很容易使用，性能缺陷很少，而且速度相当快。尽管如此，它们并不是生物信息学的合适语言。如果是的话，他们几年前就会占上风了。\n在朱莉娅、尼姆和克里斯托这三种更现代的语言中，朱莉娅达到了1.0第一。我认为Julia可以很好地取代Matlab或R语言本身。如果你喜欢Matlab或R的体验，你可能会喜欢Julia，它有内置的矩阵支持，基于1的坐标系，友好的REPL，以及对绘图的重视。我听说它的微分方程解算器可能是所有语言中最好的。\n我不认为朱莉娅是Python的好替代品。Julia的启动时间很长，当您使用Bio.jl这样的大型包时，Julia编译代码可能需要30秒，比脚本的实际运行时间要长。你可能感觉不到它在实践中速度很快。实际上，在我的基准测试中，Julia的速度也没有其他语言快。我在这里的Julia实现可能会得到最多的赞誉。我从朱莉娅的支持者那里看到了相当多的“你拿错了手机”的回复。同样重要的是，Julia开发人员并不重视向后兼容性。如果他们到那时仍然坚持自己的观点，几年后可能会出现像蟒蛇2到3这样的过渡。我不会冒这个险的。\nNIM于2019年9月到期。它的语法在表面上类似于python，这是一个优点。从尼姆身上获得下降的表现相对容易些。我可能花在学习NIM上的时间最少，但我写程序的速度比Julia快。\n缺点是，编写NIM程序感觉有点像编写Perl，因为我需要特别注意引用与值的关系。对于第二个任务，我的初始实现比Javascript慢好几倍，这是意想不到的。即使在当前的程序中，我仍然不明白为什么如果我在一个实例中更改为按值引用，性能会变得更差。NIM的支持者建议我运行分析器。我不确定生物学家会不会对此感到高兴。\n克里斯托是个惊喜。在第二个基准测试中，我在第一次尝试时就得到了极大的满足。当我最初尝试使用Crystal的内置缓冲阅读器时，我确实绕道了FASTQ解析，但是在我开始自己管理缓冲区之后，我又一次获得了类似于C的性能。\n水晶很像红宝石。它具有非常相似的语法，包括现代程序员熟悉的aclass/Mixin系统。Ruby上的一些基本教程甚至适用于Crystal。我认为建立在成功的语言之上是设计一门新语言的正确方式。另一方面，Julia给人的感觉与大多数主流语言(如C++和Python)不同。它的一些关键特性没有经受住时间的考验，可能会成为错误和性能陷阱的频繁来源。\n要实现FAST程序，我们需要关心引用与值之间的关系。水晶也没什么不同。Crystal的优点是它的类系统具有明确的引用和值。在朱莉娅、尼姆和克里斯托中，我觉得克里斯托最舒服。\n克里斯托并非没有问题。首先，没有root权限很难安装Crystal。我在lh3/PortableCrystal中提供了一个便携安装二进制包。它暂时缓解了这个问题。第二，水晶不稳定。每个版本都引入了多个突破性更改。您的代码编写日期稍后可能无法工作。尽管如此，我的计划似乎没有受到过去两年突破性变化的影响。这给了我一些信心。Crystal Devs还表示，1.0将“在不久的将来”问世。我期待着那一天的到来。\n一种好的高水平、高性能的程序设计语言将是生物信息学领域的福音。它可以扩展生物学家的研究范围，缩短有经验的程序员的开发时间，并将大量Python脚本的运行时间节省数倍。然而，在我看来，没有一种语言是足够好的。我看看克里斯托会怎么样。它有潜力。\n由Disqus提供支持的博客评论", "note_en": "Python and R are slow when they can’t rely on functionality or libraries backedby C/C++. They are inefficient not only for certain algorithm development butalso for common tasks such as FASTQ parsing. Using these languages limits thereach of biologists. Sometimes you may have a brilliant idea but can’t delivera fast implementation only because of the language in use. This can befrustrating. I have always been searching for a  high-level languagethat is fast and easy to use by biologists. This blog post reports some of myexploration. It is inconclusive but might still interest you.\n  Here I am implementing two tasks, FASTQ parsing and interval overlap query, inseveral languages including C, Python, Javascript,  LuaJIT, Julia,  Nim, and  Crystal. I am comparing theirperformance. I am proficient in C and know Python a little. I have used LuaJITand Javascript for a few years. I am equally new to Julia, Nim and Crystal. Myimplementations in these languages may not be optimal. Please keep thisimportant note in mind when reading the results.\n  The source code and the full table are available at my  lh3/biofastgithub repo. You can also found the machine setup, versions of libraries inuse and some technical notes. I will only show part of the results here.\n  The following table shows the CPU time in seconds for parsing a gzip’d FASTQ(t gzip) or a plain FASTQ (t plain). We only count thenumber of sequences and compute the sum of lengths. Except the two BioPythonimplementations, all the others use an algorithm similar to my  kseq.hparser in C.\n  This benchmark stresses on I/O and string processing. I replaced the low-levelI/O of several languages to achieve good performance. The code looks more likeC than a high-level language, but at least these langauges give me the powerwithout resorting to C.\n It is worth mentioning the default BioPython FASTQ parser is over 70 timesslower on plain FASTQ and over 10 times slower on gzip’d FASTQ. Running the Cimplementation on a human 30X gzip’d FASTQ takes 20 minutes. The defaultBioPython parser will take four and half hours, comparable to bwa-mem2multi-thread mapping. If you want to parse FASTQ but doesn’t need otherBioPython functionality, choose  PyFastx or mappy.\n  The following table shows the CPU time in seconds for computing the breadth ofcoverage of a list intervals compared against another interval list. There aretwo columns for timing and memory footprint, depending on which list is loadedinto memory.\n  The implementation of this algorithm is straightforward. It is mostly aboutrandom access to large arrays. Javascript and LuaJIT are much slower herebecause I can’t put objects in an array; I can only put references to objectsin an array.\n  The following is subjective and can be controversial, but I need to speak itout. Performance is not everything. Some subtle but important details are onlyapparent to those who write these programs.\n  These are two similar languages. They are old and were not designed with Just-In-Time (JIT) compilation in mind. People later developed JITcompilers and made them much faster. I like the two languages. They are easy touse, have few performance pitfalls and are pretty fast. Nonetheless, they arenot the right languages for bioinformatics. If they were, they would haveprevailed years ago.\n  Among the three more modern languages Julia, Nim and Crystal, Julia reached 1.0first. I think Julia could be a decent replacement of Matlab or R by thelanguage itself. If you like the experience of Matlab or R, you may like Julia.It has builtin matrix support, 1-based coordinate system, friendly  REPLand an emphasis on plotting as well. I heard its differential equation solver might bethe best across all languages.\n I don’t see Julia a good replacement of Python. Julia has a long startup time.When you use a large package like Bio.jl, Julia may take 30 seconds to compilethe code, longer than the actual running time of your scripts. You may not feelit is fast in practice. Actually in my benchmark, Julia is not really as fastas other languages, either. Probably my Julia implementations here will getmost slaps. I have seen quite a few you-are-holding-the-phone-wrong type ofresponses from Julia supporters. Also importantly, the Julia developers do notvalue backward compatibility. There may be a python2-to-3 like transition inseveral years if they still hold their views by then. I wouldn’t take the risk.\n  Nim reached its maturity in September 2019. Its syntax is similar to python onthe surface, which is a plus. It is relatively easier to get descentperformance out of Nim. I have probably spent least time on learning Nim but Ican write programs faster than in Julia.\n On the down side, writing Nim programs feels a little like writing Perl in thatI need to pay extra attention to reference vs value. For the second task, myinitial implementation was several times slower than the Javascript one, whichis unexpected. Even in the current program, I still don’t understand why theperformance get much worse if I change by-reference to by-value in one instance.Nim supporters advised me to run a profiler. I am not sure biologists wouldenjoy that.\n  Crystal is a pleasant surprise. On the second benchmark, I got a fastimplementation on my first try. I did take a detour on FASTQ parsing when Iinitially tried to use Crystal’s builtin buffered reader, but again I gotC-like performance immediately after I started to manage buffers by myself.\n Crystal resembles Ruby a lot. It has very similar syntax, including aclass/ mixin system familiar to modern programmers. Some elementary tutorialson Ruby are even applicable to Crystal. I think building on top of successfullanguages is the right way to design a new language. Julia on the other handfeels different from most mainstream languages like C++ and Python. Some of itskey features haven’t stood the test of time and may become frequent sources ofbugs and performance traps.\n To implement fast programs, we need to care about reference vs value. Crystalis no different. The good thing about Crystal is that reference and value areexplicit with its class system. Among Julia, Nim and Crystal, I feel mostcomfortable with Crystal.\n Crystal is not without problems. First, it is hard to install Crystal withoutthe root permission. I am providing a portable installation binary package in lh3/PortableCrystal. It alleviates the issue for now. Second, Crystal isunstable. Each release introduces multiple breaking changes. Your code writtentoday may not work later. Nonetheless, my program seems not affected bybreaking changes in the past two years. This has given me some confidence. TheCrystal devs also said 1.0 is coming “ in the near future”. I will lookforward to that.\n  A good high-level high-performance programming language would be a blessing tothe field of bioinformatics. It could extend the reach of biologists, shortenthe development time for experienced programmers and save the running time ofnumerous python scripts by many folds. However, no languages are good enough inmy opinion. I will see how Crystal turns out. It has potentials.\n         blog comments powered by  Disqus", "posttime": "2020-05-19 08:09:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,programming,设计,程序设计,high", "title": "快速高级程序设计语言", "title_en": "Fast high-level programming languages", "transed": 1, "url": "https://lh3.github.io/2020/05/17/fast-high-level-programming-languages", "via": "", "real_tags": ["程序", "设计", "程序设计", "high"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002711, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "精确的电脉冲模式可以让失明的人识别各个字母。精确的电脉冲模式可以让失明的人识别各个字母。", "note_en": "A precise pattern of electrical pulses allows people who have lost their sight to identify individual letters.  A precise pattern of electrical pulses allows people who have lost their sight to identify individual letters.", "posttime": "2020-05-19 07:54:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电流,people,模式", "title": "盲人用电流“阅读”大脑中追踪到的字母", "title_en": "Blind people ‘read’ letters that are traced on their brains with electricity", "transed": 1, "url": "https://www.nature.com/articles/d41586-020-01421-6", "via": "", "real_tags": ["电流", "people", "模式"]}]