[{"category": "", "categoryclass": "", "imagename": "26c3490b8f28f3af421d7fce594c65c8.jpg", "infoid": 1008499, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你不会找到更大的发射台，这个非同寻常的机会之窗将于6月26日晚上11点59分(太平洋时间)砰的一声关闭。申请“创业战场”，就在这里，就在现在。\n今年的传奇投球比赛是虚拟的，但竞争带来的好处和机会是非常真实的，而且往往会改变生活-对于所有参与者来说，不仅仅是最终的获胜者。让我们更深入地探讨一下这一点。\n最高奖金-10万美元股权自由现金-将为您的底线带来奇迹。TechCrunch专题文章-带您走进英雄联盟。随着胜利而来的颠覆杯和赞誉，好吧，谁不喜欢吹嘘自己的权利呢？但正是在全球范围内，对寻求收购有前途的初创公司的媒体、投资者、潜在客户和大型科技公司的巨大敞口，才能将战场竞争对手带上一个全新的轨道。\n下面快速浏览一下Startup Battlefield是如何工作的。我们接受来自任何背景、地域和行业的创始人的申请，只要你的公司处于初创阶段，拥有带有技术组件(软件、硬件或平台)的MVP，并且没有得到太多主要媒体的报道。\n我们的编辑会筛选每一份申请，并只会选择他们认为拥有某些特定条件的初创公司。这场史诗般的较量发生在Disrupt2020期间，从9月1日开始。14-18。注：这个机会是百分之百免费的。TechCrunch不收取任何申请费或参与费，也不收取任何股权。\n你将接受TC编辑为期六周的自由投球指导，让你进入最佳格斗状态。外加与行业专家的虚拟网络研讨会系列。你只有6分钟的时间向评委--由专家风投、企业家和TechCrunch编辑组成的小组--进行推介和演示。然后你要回答他们的问题--他们会有很多问题。\n在第一轮中幸存下来的创始人将在Disrupt的最后一天进入决赛。当你向一组新的评委推销时，这是起泡-冲洗-重复。接下来是大揭晓的时候了：一家初创公司获得了头衔、颠覆杯和10万美元的奖金。\n您点击申请链接了吗？没有吗？这里有更多申请的理由。如果你在比赛中获得一席之地，你就可以获得一张颠覆数字专业通行证，你还可以在数字创业巷向世界各地的人们免费展示。\n您将与我们的人工智能平台CrunchMatch建立网络，与投资者、媒体、潜在客户和渴望与战场竞争对手见面的人群建立虚拟的1：1会议。\n获得领先声音网络研讨会：听取顶尖行业人士分享他们在大流行期间和之后适应和蓬勃发展的战略。\n这个免费的、福利丰厚的机会在短短12小时内就消失了。不惜一切代价让你的初创企业继续前进。在截止日期6月26日晚上11点59分(太平洋时间)之前申请参加Startup Battlefield的比赛。\n贵公司是否有兴趣赞助或参展Disrupt2020？请填写此表格与我们的赞助销售团队联系。", "note_en": "You won’t find a bigger launching pad, and this window of extraordinary opportunity slams shut on June 26 at 11:59 pm (PT).  Apply to Startup Battlefield right here, right now.\n This year’s legendary pitch competition is virtual, but the benefits and opportunity that comes from competing are very real and often life changing — for all participants not just the ultimate winner. Let’s explore that a bit more.\n  The top prize — $100,000 equity free cash — will do wonders for your bottom line. The TechCrunch feature article – brings you into the league of legends. The Disrupt cup and the acclaim that comes with winning, well, who doesn’t love bragging rights? But it’s the huge exposure — on a global scale — to media, investors, potential customers and big tech players looking to acquire promising startups, that can take Battlefield competitors on a whole new trajectory.\n Here’s a quick look at how Startup Battlefield works. We accept applications from founders of any background, geography and industry as long as your company is early stage, has an MVP with a tech component (software, hardware or platform) and hasn’t received much major media coverage.\n Our editors screen every application and will choose only startups they feel possess that certain je ne sais quoi. The epic pitch-off takes place during Disrupt 2020, which runs from Sept. 14 – 18.  Note: This opportunity is 100 percent free. TechCrunch does not charge any application or participation fees or take any equity.\n You’ll receive six weeks of free pitch coaching from TC editors to whip you into prime fighting trim. Plus a virtual webinar series with industry experts. You’ll have just 6 minutes to pitch and demo to the judges — a panel of expert VCs, entrepreneurs and TechCrunch editors. Then you’ll answer their questions — and they’ll have plenty.\n Founders who survive the first round move to the finals on the last day of Disrupt. It’s lather-rinse-repeat as you pitch to a fresh set of judges. Then it’s time for the big reveal: one startup takes the title, the Disrupt cup and the $100,000.\n Have you clicked the application link yet? No? Here are more reasons to apply. If you earn a spot in the competition, you get a  Disrupt Digital Pro pass and you get to exhibit to people around the world in  Digital Startup Alley — for free.\n You’ll network with CrunchMatch, our AI-powered platform, to set up virtual 1:1 meetings with investors, media, potential customers and the throngs of folks eager to meet a Battlefield competitor.\n  Access to Leading Voices Webinars: Hear top industry minds share their strategies for adapting and thriving during and after the pandemic\n This no-cost, perk-packed opportunity disappears in just 12 hours. Do whatever it takes to keep your startup moving forward.  Apply to compete in Startup Battlefield before the deadline expires on  June 26 at 11:59 pm (PT).\n Is your company interested in sponsoring or exhibiting at Disrupt 2020? Contact our sponsorship sales team by   filling out this form.", "posttime": "2020-06-27 03:13:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "创业,2020,申请,left", "title": "\n在Disrupt2020申请创业战场只剩下12个小时了", "title_en": "\n\t\t\t\tOnly 12 hours left to apply for Startup Battlefield at Disrupt 2020\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/26/only-12-hours-left-to-apply-for-startup-battlefield-at-disrupt-2020/", "via": "", "real_tags": ["创业", "2020", "申请", "left"]}, {"category": "", "categoryclass": "", "imagename": "32f90ab46e0b3b31c793338caaf261f2.jpg", "infoid": 1008497, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "克雷格·费德里吉(Craig Federighi)对iOS14和更具争议性的2020年发布的一些见解！WVFRM全集：http://bit.ly/WaveformMKBHD感谢.", "note_en": "Some insight with Craig Federighi about the iOS 14 and the more controversial 2020 announcements! Full WVFRM episode: http://bit.ly/WaveformMKBHD Thanks for ...", "posttime": "2020-06-27 03:11:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,苹果,回应,responds,waveformmkbhd", "title": "苹果回应你的评论[采访克雷格·费德勒]", "title_en": "Apple Responds to Your Comments [Interview with Craig Federigh]", "transed": 1, "url": "https://www.youtube.com/watch?v=Q2aaCDNjWEg", "via": "", "real_tags": ["apple", "苹果", "回应", "responds"]}, {"category": "", "categoryclass": "", "imagename": "d5e73fa06a7cdce222d81bdaccdccc46.jpg", "infoid": 1008496, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "分析表明，英国医院里的冠状病毒患者现在的死亡速度比疫情高峰期要慢。\n牛津大学的研究人员发现，在4月至6月期间，英国每天死亡的冠状病毒患者的比例从6%下降到1.5%。\n治疗的改进、患者数量的变化和季节性影响都可能起到作用。\n在4月8日疫情最严重的时候，英格兰有15468名冠状病毒携带者住院，其中899人死亡(6%)。\n根据牛津大学循证医学中心汇编的最新数据，截至6月21日，有2698名冠状病毒患者住院治疗，其中30人死亡(1%)。\n医院病死率是自疫情爆发以来使用的一种衡量标准，提供了一致的数字，并使研究人员能够寻找趋势。\n虽然住院人数和住院死亡人数都在下降，但死亡人数下降的速度更快。\n与新冠肺炎一起住院的人数每29天减少一半，而死亡人数每16天减少一半。\n进行这项分析的卡尔·赫内根教授表示，包括意大利在内的其他国家也出现了医院死亡率下降的模式，\n如果死亡率是1%而不是6%，这是一种截然不同的疾病。\n他说，这意味着在疾病最严重的4月份，每天有500人死亡。\n他的合著者杰森·奥克(Jason Oke)说，这是一个令人鼓舞的趋势，但需要更多的工作来理解原因。\n尽管研究人员无法确定这一趋势背后的确切原因，但他们提出了一些原因。\n其一是，随着对这种疾病的了解越来越多，医护人员已经能够更好地使用现有药物治疗它，即使在新的治疗方法上没有任何重大突破。\n例如，医生现在已经准备好期待血液凝固和免疫反应过度的患者，而在早期，他们希望治疗主要被视为呼吸道疾病的症状。\n在重症监护患者中，常见的类固醇地塞米松现在被用来抑制可能导致器官损伤的失控免疫反应。\n根据赫内根教授的说法，这可能是一个关键因素，但不太可能完全解释死亡率下降的原因。\n这也可能归因于住院患者类型的变化。\n研究人员表示，随着NHS的压力有所缓解，有可能会有空间接纳那些在疫情高峰期没有达到更严格的医院护理门槛的患者。这些患者可能会稍微不那么脆弱，因此死亡的可能性也更小。\n更令人沮丧的是，这种病毒也有可能已经撕裂了最脆弱的人群，留下了一开始风险较低的人。\n另一种可能性是，可能有一群患者长期住院，他们既没有出院，也没有死于病毒。\n夏天也可能起到保护作用：循环中危害人们免疫系统的其他疾病较少，而更多的阳光意味着更多的维生素D。", "note_en": "Coronavirus patients in hospital in England are dying at a slower rate now than they were at the peak of the epidemic, analysis suggests.\n University of Oxford researchers found the proportion of coronavirus patients dying each day in England fell from 6% to 1.5% between April and June.\n Improvements in treatments, changes in the patient population and seasonal effects could all play a role.\n  Around the height of the outbreak, on 8 April, there were 15,468 people in hospital in England with coronavirus of whom 899 died (6%).\n  By 21 June there were 2,698 hospitalised coronavirus patients, 30 of whom died (1%), according to the most recent data compiled University of Oxford&#39;s Centre for Evidence-Based Medicine.\n Hospital case fatality is a measure used since the beginning of the outbreak, providing consistent figures and enabling researchers to look for trends.\n  While both the number of people in hospital and the number of hospitalised people dying are falling, deaths are falling at a faster rate.\n The number of people in hospital with Covid-19 is halving every 29 days, while deaths are halving every 16 days.\n Prof Carl Heneghan, who carried out the analysis, said the pattern of falling death rates in hospitals was also being seen in other countries, including Italy,\n  &#34;It&#39;s a radically different disease we&#39;re looking at if the death rate is 1% rather than 6%&#34;.\n He said that translated to a difference of 500 deaths a day in April when the disease was at its height.\n &#34;This is an encouraging trend but one that needs more work to understand the cause,&#34; his co-author Jason Oke said.\n Although the researchers were unable to determine exactly what was behind the trend, they put forward a number of reasons.\n  One is that, as more is understood about the disease, healthcare staff have been better able to treat it using existing drugs, even without any major breakthrough in new treatments.\n For example, doctors are now primed to expect patients with blood clotting and overactive immune responses, whereas in the early days they were looking to treat the symptoms of what was seen as primarily a respiratory disease.\n And in critical care patients, the common steroid  dexamethasone is now being used to dampen down the out-of-control immune reactions that can cause organ damage.\n This is likely to be a key factor, but is unlikely to completely explain the falling death rate, according to Prof Heneghan.\n  It may also be down to changes in the types of patients admitted to hospital.\n  As strain on the NHS has eased, the researchers say it is possible that there is room to admit patients who would not have met the stricter threshold for hospital care at the height of the epidemic. And these patients may be slightly less vulnerable and therefore less likely to die.\n More sombrely, it&#39;s also possible that the virus, having torn through the most vulnerable populations, has left behind people who were at lower risk to start with.\n A further possibility is that there could be a group of patients in hospital for long periods, not being discharged but also not succumbing to the virus.\n Summer might also be playing a protective role: there are fewer other illnesses in circulation to compromise people&#39;s immune systems, and more sunlight means more  Vitamin D.", "posttime": "2020-06-27 03:05:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,death,患者", "title": "医院冠状病毒死亡率下降", "title_en": "Coronavirus death rate falling in hospitals", "transed": 1, "url": "https://www.bbc.com/news/health-53192532", "via": "", "real_tags": ["病毒", "冠状病毒", "death", "患者"]}, {"category": "", "categoryclass": "", "imagename": "8e0d9d4875ac50ab7706eddff6d0a429.jpg", "infoid": 1008494, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "联邦通信委员会(Federal Communications Commission)正在帮助查特避免纽约州的宽带竞争，该决定将阻止政府为查特需要建设的地点的其他ISP提供资金。\nFCC计划在定于10月份开始的反向拍卖中，在10年内从农村数字机会基金(RDOF)向ISP奖励高达160亿美元。联邦通信委员会昨天在一份声明中表示，它批准了Charge Communications的豁免请求，将纽约的2127个人口普查区排除在合格地区名单之外，因为根据与纽约州达成的和解协议，该公司将在这些地区部署宽带。\n另外，FCC拒绝了边境通信公司(Frontier Communications)提出的将29个州部分地区的近1.7万个人口普查区排除在拍卖之外的请求。\nRDOF的规定阻止在已经拥有家庭互联网接入的人口普查区块提供资金，这些地区的下行速度至少为25 Mbps，上行速度至少为3 Mbps。RDOF的规定还阻止在人口普查区提供资金，在这些地区，至少有一家ISP从任何联邦或州宽带补贴计划中获得资金，以提供25/3 Mbps或更好的服务。但正如我们之前报道的那样，该规定不会阻止ISP获得资金，为纽约部分地区提供服务，因为合并条件要求Charge提供服务，但该公司尚未完成建设。查特向联邦通信委员会请愿，要求豁免禁止在那些人口普查区提供RDOF资金，在这些地区，查特没有资金，但仍然有约束力的州义务，必须部署至少25/3 Mbps的宽带服务。\n查特在纽约的项目是州政府在收购时代华纳有线电视时强加的条件所要求的。Charge未能在该项目的临时最后期限前完成，但在同意支付1200万美元用于其他新宽带部署的和解协议中，获得了额外一年的遵守时间。根据新的推迟的最后期限，查特需要在2021年9月30日之前完成向纽约州北部的14.5万户家庭和企业部署服务。查特以Spectrum品牌名称提供服务。\n联邦通信委员会表示，将纽约人口普查区排除在今年的拍卖之外，将推动委员会的目标，即农村数字机会基金支持流向最需要普遍服务支持的地区，以推进宽带部署-这些地区仍然完全没有宽带服务，宽带速度为25/3 Mbps。\nFCC最初将整个纽约排除在拍卖之外，但在抗议后推翻了这一决定。根据昨天的决定，纽约的47,024套住房和企业有资格从今年的拍卖中获得资金。\n美国大约有1100万个人口普查区，但有数百万个空置。人口普查局表示，每个人口普查区的大小不等，从四面都是街道的城市中的一个街区到偏远地区数百平方英里的街区。\n在同一命令的另一部分中，FCC昨天表示，它将允许在Frontier声称提供25/3 Mbps服务的16987个人口普查区提供资金。FronTier于2020年4月申请破产，当它向FCC声称自2019年6月以来已经在这16,987个人口普查区部署了25/3 Mbps宽带时，招致了质疑。FCC表示，FronTier后来解释说，其16987个人口普查区的名单并没有反映自2019年6月以来的新建筑，而是更准确地报告了某些地区可用的最快速度。\nFCC同意有理由持怀疑态度。FCC表示，鉴于记录中对Frontier提交的文件的有效性存在大量而重大的担忧，包括它自己承认错误提交了2019年6月的数据，它试图修改的质疑中存在错误，以及对其质疑的解释不一致，委员会驳回了Frontier的质疑，FCC表示。\nFrontier在4月10日的一份文件中敦促FCC将16987个人口普查区排除在外。但一个半月后，Frontier放弃了这一请求，在5月23日告诉FCC，它欢迎将Frontier以25/3 Mbps或更高速度提供服务的受到挑战的人口普查区纳入RDOF拍卖。这些人口普查区分布在29个州；自最初提交申请以来，Frontier完成了在其中4个州的业务出售。\nFCC说，在全国范围内，它确定5392,530个住宅和企业被算作未提供服务的地点，今年160亿美元的拍卖可以在这些地点分配资金。RDOF的总体预算是在10年内达到204亿美元。剩下的44亿美元将在FCC收集到更准确的宽带地图数据后分配。\n披露：拥有Charge 13%股份的Advance/Newhouse伙伴关系是Advance Publications的一部分。Advance Publications拥有康泰纳仕(CondéNast)，康泰纳仕拥有Ars Technica。", "note_en": "The Federal Communications Commission is helping Charter avoid broadband competition in New York State with a decision that will block government funding for other ISPs in locations where Charter is required to build.\n The FCC plans to award ISPs up to $16 billion over 10 years from the Rural Digital Opportunity Fund (RDOF) in a reverse auction  scheduled to begin in October. The FCC said in an  announcement yesterday that it &#34;granted Charter Communications&#39; waiver request to exclude 2,127 census blocks in New York from the eligible areas list because the company will deploy broadband in those locations pursuant to a settlement reached with the State of New York.&#34;\n Separately, the FCC denied a Frontier Communications request to exclude nearly 17,000 census blocks in parts of 29 states from the auction.\n RDOF rules block funding in census blocks that already have home-Internet access at speeds of at least 25Mbps downstream and 3Mbps upstream. RDOF rules also block funding in census blocks where at least one ISP has been awarded money from any federal or state broadband-subsidy program &#34;to provide 25/3Mbps or better service.&#34; But as we  previously reported, that rule would not prevent ISPs from getting funding to serve parts of New York where  Charter is required by a merger condition to offer service but in which it hasn&#39;t yet finished construction. Charter petitioned the FCC for a waiver to ban RDOF funding in those census blocks &#34;in which Charter has unfunded but nonetheless binding state obligations to deploy at least 25/3Mbps broadband service.&#34;\n Charter&#39;s New York project is required by conditions the state government imposed on its purchase of Time Warner Cable. Charter failed to meet interim deadlines in that project but got an extra year to comply in a settlement in which it  agreed to pay $12 million toward other new broadband deployments. Under the new, postponed deadline, Charter is required to finish deploying service to 145,000 homes and businesses in Upstate New York by September 30, 2021. Charter offers service under the Spectrum brand name.\n The FCC said excluding the New York census blocks from this year&#39;s auction &#34;will further the Commission&#39;s goal that Rural Digital Opportunity Fund support flow to areas that are in the most need of universal service support to advance broadband deployment—those that remain wholly unserved with broadband speeds of 25/3Mbps.&#34;\n The FCC originally  shut all of New York out of the auction, but it reversed that decision after protest. Under yesterday&#39;s decision, 47,024 homes and businesses in New York are eligible for funding from this year&#39;s auction.\n There are about 11 million census blocks in the US, but several million are  unoccupied. The size of each census block varies from &#34;a block in a city bounded on all sides by streets&#34; to &#34;hundreds of square miles&#34; in remote areas, the Census Bureau  says.\n  In another portion of the same order, the FCC yesterday said it will allow funding in 16,987 census blocks where Frontier  claimed it offers 25/3Mbps service. Frontier, which filed for bankruptcy in April 2020, drew skepticism when it claimed to the FCC that it had deployed 25/3Mbps broadband to those 16,987 census blocks since June 2019. Frontier later &#34;explained that its list of 16,987 census blocks does not reflect new builds since June 2019, but rather more accurate reporting on the fastest speeds that are available in certain blocks,&#34; the FCC said.\n The FCC agreed there is reason for skepticism. &#34;Given the numerous and significant concerns in the record regarding the validity of Frontier&#39;s filing, including its own admission that it had misfiled its June 2019 data, errors in its challenge that it sought to revise, and inconsistent explanations for its challenge, the commission denied Frontier&#39;s challenge,&#34; the FCC said.\n Frontier urged the FCC to exclude the 16,987 census blocks in a  filing on April 10. But Frontier gave up on that request a month and a half later,  telling the FCC on May 23 that it &#34;would welcome the inclusion into the RDOF auction the challenged census blocks where Frontier provides service at speeds of 25/3Mbps and greater.&#34; These census blocks are in 29 states; since the original filing,  Frontier completed a sale of its operations in four of those states.\n Nationwide, the FCC said it determined that 5,392,530 homes and businesses count as &#34;unserved locations&#34; where this year&#39;s $16 billion auction can distribute funding. The RDOF&#39;s overall budget is $20.4 billion over 10 years. The remaining $4.4 billion will be distributed after the FCC  collects more accurate broadband-mapping data.\n Disclosure: The Advance/Newhouse Partnership, which owns 13 percent of Charter, is part of Advance Publications. Advance Publications owns Condé Nast, which owns Ars Technica.", "posttime": "2020-06-27 02:45:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "帮助,helps,fcc", "title": "FCC帮助Charge避免宽带竞争", "title_en": "FCC helps Charter avoid broadband competition", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/06/fcc-helps-charter-avoid-broadband-competition/", "via": "", "real_tags": ["帮助", "helps", "fcc"]}, {"category": "", "categoryclass": "", "imagename": "0072bd815e86b7428b5acafcb1d14875.jpg", "infoid": 1008492, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "市中心-珍妮·李(Jenny Lee)在一家艺术教育非营利组织工作，这让她在西区和南区的学校上学。当她需要乘坐优步或Lyft去上班时，它们“相当昂贵”，即使是短途旅行也要花费20-30美元。\n相比之下，她说，这种离她住的地方更近的湖景东区的旅行“永远只需要12美元”。\n李说：“尽管我的工作支付了这些费用，但我们是非营利性的，我们没有无限的预算。”“很多时候，当我必须去某个地方的时候，我觉得这对于我实际要走的路程来说可能太多了。”\n最近的一项研究表明，李的经历可能是优步和Lyft对在芝加哥以非白人为主的社区下车的乘客收取更高价格的更大模式的一部分。\n乔治华盛顿大学(George Washington University)的两名研究人员进行的这项研究显示，芝加哥的叫车费用每英里都会上涨，因为某人在非白人居民比例较高的社区下车。\n研究人员阿克沙特·潘迪(Akshat Pandey)和艾林·卡利斯坎(Aylin Caliskan)表示，他们的研究发现，动态定价模式-拼车服务使用的是动态定价模式，而出租车不使用-被发现会导致“基于种族的价格差异”。\n研究还得出结论，如果乘客在居民年龄偏小或大多数居民没有获得大学学位的社区上下车，他们的票价可能会发生变化。根据这项研究，人们在房价较高的地区接送时也会收取更高的费用。\n两人表示，他们的研究是对用于确定叫车应用定价的算法进行的第一次“大规模公平”审查。\n根据这项研究，芝加哥之所以被选为研究对象，是因为它有法律要求拼车公司披露票价。芝加哥的优步(Uber)和Lyft打车服务是美国最昂贵的打车服务之一，这要归功于该市某些地区对单次乘车征收的新税。\n这项研究使用了美国人口普查数据和2018年11月至2019年12月期间芝加哥1亿多次叫车出行的数据。\n伊利诺伊大学芝加哥分校(University Of Illinois At Chicago)城市规划学副教授凯特·洛(Kate Lowe)表示，在该市的地理位置上，种族可能会在优步和Lyft的定价中发挥作用，她对此并不感到惊讶。\n研究交通的洛威表示，叫车应用在扩大非白人社区和低收入家庭居民的准入方面可以发挥重要作用。\n她说：“这项研究显示的结果与社会科学领域的许多人的发现一致，即在一个以结构性种族主义为特征的世界里，市场机制往往会反映和强化结构性种族主义。”\n优步的一位发言人表示，公司不会容忍通过算法或用户进行的歧视，并赞扬了研究动态定价影响的研究。\n尽管如此，这位发言人表示，这项研究在分析中可能忽略了许多其他因素。\n该公司的声明写道：“重要的是，不要等同于因果关系，这一分析可能没有考虑到一些相关因素，比如与土地使用/邻里模式、出行目的、一天中的时间和其他影响的相关性。”“我们期待看到最终结果.”\nLyft的一位发言人对最近在沙龙发表的一篇关于这项研究的文章做出了类似的回应，称这项分析“存在严重缺陷”，其动态定价没有考虑种族因素。\n作者在给芝加哥街区俱乐部的一份声明中说，这项研究表明“价格歧视与上下车地点的人口统计数据高度相关。”\n研究人员说：“这些发现不能提供对因果关系的直接洞察力，但精确地量化了无意中的不同影响，这些影响使居住在特定社区的历史上处于不利地位的群体处于进一步的不利地位。”\n以前也研究过同样的定价模型。这项研究指出，2015年的一项分析显示，备考公司普林斯顿评论(Princeton Review)在亚裔美国人较多的地区向个人收取了更高的价格。\n订阅芝加哥街区俱乐部。我们每一分钱都能从芝加哥的社区报道。", "note_en": "DOWNTOWN — Jenny Lee works for an arts education nonprofit, which takes her to schools in the West and South sides. When she needs to take an Uber or Lyft for work, they are “quite expensive,” costing $20-$30 even for short trips.\n By contrast, such trips closer to where she lives in Lakeview East are “only ever 12 bucks,” she said.\n “Even though my work pays for these, we’re a nonprofit and we don’t have an unlimited budget,” Lee said. “So often times, when I have to go somewhere, it feels like this is maybe way too much for how far I’m actually going.”\n A recent  study shows Lee’s experience may be part of a larger pattern of Uber and Lyft charging higher prices for riders being dropped off in predominately non-white neighborhoods of Chicago.\n The study, from two researchers at George Washington University, showed ride-hailing fares in Chicago increased per mile for trips where a person was dropped off in a neighborhood with a high percentage of non-white residents.\n Researchers Akshat Pandey and Aylin Caliskan said their study found dynamic pricing models — used by ride sharing services but not taxis — have been found to lead to “racially-based price disparities.”\n The study also concludes riders may see their fares change if they’re picked up or dropped off in neighborhoods where residents skew younger or where most residents haven’t obtained a college degree. People are also being charged more when getting picked up in areas with more expensive homes, according to the study.\n  The two said their study is the first “large-scale fairness” review of algorithms used to determine the prices set by ride-hailing apps.\n Chicago was chosen for the research because it has laws that ask ride-share companies to  disclose their fare prices, according to the study. Uber and Lyft rides in Chicago are among the  most expensive in the country, thanks to  new taxes on single rides in certain areas of the city.\n The study used U.S. Census data and data from more than 100 million ride-hailing trips in Chicago between November 2018 to December 2019.\n Kate Lowe, an associate professor of urban planning at University of Illinois at Chicago, said she was not surprised about the role race may play in the pricing of Ubers and Lyfts within the city’s geography.\n Lowe, who studies transportation, said ride-hailing apps can have an important role in expanding access for residents of non-white neighborhoods and low-income households.\n “What this study shows aligns with what many people across social sciences find, which is — in a world characterized by structural racism — market mechanisms are often going to reflect and reinforce structural racism,” she said.\n An Uber spokesperson said the company does not condone discrimination through algorithms or users and praised studies researching the impact of dynamic pricing.\n Still, the spokesperson said the study may have overlooked numerous other factors in its analysis.\n “It’s important not to equate correlation for causation, and there may be a number of relevant factors that weren’t taken into account for this analysis, such as correlations with land-use/neighborhood patterns, trip purposes, time of day, and other effects,” the company statement read. “We look forward to seeing the final results.”\n A Lyft spokesperson responded similarly to a recent article about the study in  Salon, saying the analysis was “deeply flawed” and race did not factor into its dynamic pricing.\n The authors said in a statement to Block Club Chicago the study demonstrates “price discrimination correlates highly with the demographics of pickup and dropoff locations.”\n “These findings cannot provide direct insights on causality, yet precisely quantify the unintentional disparate impact that puts historically disadvantaged groups residing at particular neighborhoods at a further disadvantage,” the researchers said.\n This same pricing model has been researched before. The study points to  a 2015 analysis that showed The Princeton Review, a test prep company, charged higher prices to individuals in areas with more Asian Americans.\n Subscribe to Block Club Chicago. Every dime we make funds reporting from Chicago’s neighborhoods.", "posttime": "2020-06-27 02:43:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "社区,lyft,研究", "title": "研究显示，优步，Lyft对前往非白人社区的乘客收取更高费用", "title_en": "Uber, Lyft Charge More for Riders Going to Non-White Neighborhoods, Study Shows", "transed": 1, "url": "https://blockclubchicago.org/2020/06/26/uber-lyft-charges-more-for-riders-going-to-chicagos-non-white-neighborhoods-study-shows/", "via": "", "real_tags": ["社区", "lyft", "研究"]}, {"category": "", "categoryclass": "", "imagename": "0109f8b07e888bc3911bee86ff751885.jpg", "infoid": 1008491, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“纽约时报”的媒体专栏作家本·史密斯解释了独立媒体的力量是如何影响到无限的受众的。关于起床：起床是工作日的早晨……", "note_en": "New York Times' media columnist Ben Smith explains how the power of independent media can reach unlimited audiences. About Rising: Rising is a weekday mornin...", "posttime": "2020-06-27 02:43:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "smith,媒体", "title": "Ben Smith谈Substack和独立记者的崛起[视频]", "title_en": "Ben Smith on the rise of Substack and independent journalists [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=3xgLOHW42Nw#t=12", "via": "", "real_tags": ["smith", "媒体"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008490, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "代码质量和编码风格分析。代码体系结构及其复杂性的漂亮概述。", "note_en": "Analysis of code quality and coding style. Beautiful overview of code architecture and it&#39;s complexity.", "posttime": "2020-06-27 02:43:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,php,风格", "title": "PHP洞察：分析PHP项目的代码质量", "title_en": "PHP Insights: Analyze the code quality of PHP projects", "transed": 1, "url": "https://phpinsights.com", "via": "", "real_tags": ["代码", "php", "风格"]}, {"category": "", "categoryclass": "", "imagename": "fcd9dbf0e4da5e2cac309d889570a8c8.jpg", "infoid": 1008489, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "联合利华长期以来一直站在不断变化的数字供应链中提供行业领先地位，无论是在可看性、测量、广告欺诈还是品牌安全方面，我们一直在不断发展我们的方法，通过联合利华责任框架解决社会问题，该框架呼吁更负责任的平台、内容和基础设施。\n通过这一框架，我们正在积极与所有数字平台接触，以做出有意义的改变，并影响信任和透明度。我们已经取得了实质性进展，我们承认我们合作伙伴的努力，但仍有更多工作要做，特别是在美国这一两极分化的选举期间，在分裂和仇恨言论领域。\n当前文化格局的复杂性赋予了品牌新的责任，要求它们学习、回应并采取行动，以推动一个值得信赖和安全的数字生态系统。\n鉴于我们的责任框架和美国两极分化的氛围，我们决定从现在开始至少到今年年底，我们将不会在美国的社交媒体新闻馈送平台Facebook、Instagram和Twitter上投放品牌广告。目前继续在这些平台上投放广告不会给人们和社会增加价值。我们将持续监测，并将在必要时重新考虑我们目前的立场。\n我们将通过转向其他媒体来维持我们在美国的媒体投资总额。\n我们将继续与我们的合作伙伴单独合作，并通过所有行业论坛，如全国广告商协会(ANA)、世界广告商联合会(WFA)、全球负责任媒体联盟(GARM)等，推动行动、透明度、澄清政策并创造执法的一致性。我们相信，这种做法将带来更富有成效的进展。", "note_en": "Unilever has long been at the forefront of providing industry leadership within a changing digital supply chain, whether it be viewability, measurement, ad fraud or brand safety and we’ve continued to evolve our approach to address societal issues with the Unilever Responsibility Framework that calls for more responsible platforms, content and infrastructure.\n Through this framework, we are actively engaging with all digital platforms to make meaningful change and impact trust and transparency. We have made substantial progress, and we acknowledge the efforts of our partners, but there is much more to be done, especially in the areas of divisiveness and hate speech during this polarized election period in the U.S.\n The complexities of the current cultural landscape have placed a renewed responsibility on brands to learn, respond and act to drive a trusted and safe digital ecosystem.\n Given our Responsibility Framework and the polarized atmosphere in the U.S., we have decided that starting now through at least the end of the year, we will not run brand advertising in social media newsfeed platforms Facebook, Instagram and Twitter in the U.S. Continuing to advertise on these platforms at this time would not add value to people and society. We will be monitoring ongoing and will revisit our current position if necessary.\n  We will maintain our total planned media investment in the U.S. by shifting to other media.\n We will continue to work with our partners individually and through all industry forums such as the Association of National Advertisers (ANA), World Federation of Advertisers (WFA), Global Alliance for Responsible Media (GARM), among others, to drive action, transparency, clarify policies and create consistency in enforcement. We are confident this approach will lead to more productive progress.", "posttime": "2020-06-27 02:42:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "时代,responsible,媒体", "title": "在这个两极分化的时代推动负责任的数字生态系统", "title_en": "Driving a Responsible Digital Ecosystem in These Polarized Times", "transed": 1, "url": "https://www.unileverusa.com/news/news-and-features/2020/driving-a-responsible-digital-ecosystem-during-these-polarized-times.html", "via": "", "real_tags": ["时代", "媒体"]}, {"category": "", "categoryclass": "", "imagename": "59abf42ca20f04d1c852861e4c803fcf.png", "infoid": 1008488, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在最近的一次筹款活动中，我们对我们的标准交易进行了两次修改。从2021年冬季一批开始，我们的交易将是12.5万美元，购买后资金保险箱7%的股权，我们将在随后的几轮交易中将按比例分配的权利金额减少到4%。在接下来的几年里，这将使我们能够再为多达3000家公司提供资金。\n作为背景，YC最初出价约2万美元收购了一家公司6%的股份。2011年，尤里·米尔纳(Yuri Milner)和SV Angel开始向YC的每一家初创公司额外提供15万美元。我们继续与新投资者进行这一计划，并将交易金额降至约10万美元，利率为7%。2014年，我们将这一数字增加到12万美元，2018年，我们筹集了最后一笔资金，增加到15万美元。\n多年来，我们已经几次改变了我们的交易，因为我们筹集了新的资金，修改了预算，并与当前的环境和经济相匹配。我们预计这不会是我们最后一次更改交易，但我们确实觉得这是未来几年的正确地点。", "note_en": "We are making two changes to our standard deal in conjunction with a recent fundraise. Starting with the Winter 2021 batch, our deal will be $125,000 for 7% equity on a post-money safe, and we will reduce the amount of our  pro rata right to 4% of subsequent rounds. In the coming years, this will enable us to fund as many as 3000 more companies.\n For background, YC originally gave about $20,000 for 6% of a company. In 2011, Yuri Milner and SV Angel began offering an additional $150k to every startup in YC. We continued this program with new investors and reduced the deal to about $100k for 7%. In 2014, we increased that amount to $120k and in 2018 to $150k when we raised our last fund.\n We have changed our deal several times over the years as we have raised new funds, modified budgets, and to match the current environment and economy. We do not expect this to be the last time we change the deal, but we do feel this is the right place to be for the next several years.", "posttime": "2020-06-27 02:42:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "交易,标准,standard", "title": "新的标准交易", "title_en": "A New Standard Deal", "transed": 1, "url": "https://blog.ycombinator.com/a-new-standard-deal/", "via": "", "real_tags": ["交易", "标准", "standard"]}, {"category": "", "categoryclass": "", "imagename": "1163efc27e4b51f0210835343c72d4c8.png", "infoid": 1008487, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当在网站或服务上工作时，开发环境应该尽可能地模仿生产环境。由于大多数生产网站和服务都是在HTTPS上提供的，开发版本也应该如此。这正是mkcert试图解决的问题。\nmkcert是一种工具，它使生成由本地CA(证书颁发机构)签名的本地受信任SSL证书变得容易。\n#在macOS上安装Sbrew install mkcert#生成并安装本地CAmkcert-install#创建新证书atekcert-key-file key.pem-cert-file cert.pem localhost。\n现在，您可以将SSL密钥和证书用于本地服务器。例如，如果您有一个Jekyll博客，您可以使用以下命令在HTTPS上提供服务", "note_en": "When working on a website or a service, the development environment should imitate as much as possible the production one. And since most production websites and services are served on HTTPS, the same should happen for the development versions as well. This is exactly what  mkcert is trying to solve.\n  mkcert is a tool that makes it easy to generate locally-trusted SSL certificates signed by a local CA (Certificate Authority).\n    # Install on macOSbrew  install mkcert # Generate and install a local CAmkcert  -install # Create a new certificatemkcert  -key-file key.pem  -cert-file cert.pem localhost\n  Now you can use the SSL key and cert for your local server. For instance, if you have a Jekyll blog, you can use the following command to serve on HTTPS", "posttime": "2020-06-27 02:36:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "提供,local,证书", "title": "使用mkcert在HTTPS上为您的本地网站提供服务", "title_en": "Serve your local website on HTTPS with mkcert", "transed": 1, "url": "https://diamantidis.github.io/tips/2020/06/26/serve-localhost-website-on-https-with-mkcert", "via": "", "real_tags": ["提供", "local", "证书"]}, {"category": "", "categoryclass": "", "imagename": "691046f0cc7a4a756de9a53d49c358ff.jpg", "infoid": 1008486, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "众议院-科学、空间和技术；途径和方法；军事；金融服务；能源和商业；外交。\n众议院-2020年6月11日提交给科学、空间和技术委员会，以及方法和手段委员会、军事委员会、金融服务委员会、能源和商业委员会以及外交事务委员会，任期随后由议长决定，每种情况下都用于审议属于有关委员会管辖范围的条款。“(所有行动)", "note_en": "House - Science, Space, and Technology; Ways and Means; Armed Services; Financial Services; Energy and Commerce; Foreign Affairs\n  House - 06/11/2020 Referred to the Committee on Science, Space, and Technology, and in addition to the Committees on Ways and Means, Armed Services, Financial Services, Energy and Commerce, and Foreign Affairs, for a period to be subsequently determined by the Speaker, in each case for consideration of such provisions as fall within the jurisdiction of the committee concerned.  ( All Actions)", "posttime": "2020-06-27 02:35:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,american,委员会", "title": "恢复美国在半导体制造领域的领导地位", "title_en": "To restore American leadership in semiconductor manufacturing", "transed": 1, "url": "https://www.congress.gov/bill/116th-congress/house-bill/7178?s=1&r=1", "via": "", "real_tags": ["美国", "american", "委员会"]}, {"category": "", "categoryclass": "", "imagename": "994e5a2b4e41223c9064b822af26e4cb.jpg", "infoid": 1008485, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "联合利华的品牌包括多芬(Dove)、本·杰瑞(Ben&amp；Jerry)和赫尔曼(Hellmann)，该公司周五表示，将至少在12月31日之前停止在美国Facebook、Instagram和Twitter上投放广告。\n根据营销分析公司Pathmatics的数据，这家消费品巨头今年在美国的Facebook上花费了超过1180万美元。\n环球媒体执行副总裁路易斯·迪·科莫在一份声明中说：“考虑到我们的责任框架和美国两极分化的氛围，我们决定从现在开始到今年年底，我们将不会在美国的社交媒体新闻馈送平台Facebook、Instagram和Twitter上投放品牌广告。”\n在这个时候继续在这些平台上做广告不会给人们和社会增加价值。我们将持续监测，并将在必要时重新审视我们目前的状况。\n这家总部位于伦敦的公司表示，将通过转向其他媒体来维持其在美国的媒体投资计划。它的二十多个品牌包括Breyers和Ben&amp；Jerry‘s冰淇淋，Hellmann’s蛋黄酱，立顿和纯叶茶，以及多芬产品(Dove Products)等消费必需品。\n声明称，我们正在积极与所有数字平台合作，以做出有意义的改变，并影响信任和透明度。我们已经取得了实质性的进展，我们承认我们合作伙伴的努力，但还有更多的工作要做，特别是在美国这一两极分化的选举期间，在分裂和仇恨言论领域。\n睡眠巨人(Sleep Giants)的一份运行名单显示，自一群组织呼吁Facebook广告商在7月份暂停广告支出以来的一周里，包括威瑞森(Verizon)、巴塔哥尼亚(Patagonia)、REI、Lending Club和North Face在内的90多家营销机构宣布有意加入。该组织包括反诽谤联盟、全国有色人种协进会、睡眠巨人组织、改变颜色组织、新闻自由组织和常识组织。\n这些组织表示，他们正在要求Facebook采取一系列行动，对仇恨言论和虚假信息进行更严格的监管，包括为那些声称自己因种族或宗教原因而成为目标的用户建立单独的审查渠道，或者让广告商看到他们的广告出现在与后来因错误信息或仇恨而被删除的内容附近的频率，并允许他们退款。\nFacebook的另一个主要消费者宝洁公司(Procter&amp；Gamble)本周早些时候表示，它正在审查其在其上做广告的所有媒体渠道、网络、平台和节目，以确保内容和评论准确且尊重所有人，并且我们没有在我们认为令人憎恨、歧视、诽谤或贬损的内容上或附近做广告。\n宝洁首席品牌官马克·普里查德(Marc Pritchard)表示，作为其中的一部分，我们正在与媒体公司和平台合作，在需要的时候采取适当的系统性行动，但没有特别提到Facebook。\n去年，Facebook通过其数百万广告商在全球带来了697亿美元的广告收入。该公司今年早些时候表示，它拥有800多万广告商。\nFacebook在周五的一份声明中表示：我们每年投入数十亿美元来保障我们社区的安全，并不断与外部专家合作，审查和更新我们的政策。我们已经向民权审计敞开了大门，我们已经禁止了250个白人至上主义组织出现在Facebook和Instagram上。\n我们在人工智能方面的投资意味着，在用户向我们报告之前，我们发现近90%的仇恨言论是我们行动的，而最近的一份欧盟报告发现，Facebook在24小时内评估的仇恨言论报告比Twitter和YouTube更多。我们知道我们还有更多的工作要做，我们将继续与民权组织、GARM和其他专家合作，开发更多的工具、技术和政策来继续这场斗争。\n在CNBC最近获得的一份致广告商的备忘录中，Facebook全球营销解决方案副总裁卡罗琳·埃弗森(Carolyn Everson)表示，抵制总体上不是我们共同进步的方式。\n她在备忘录中表示：我也真心希望你们现在知道，我们不会因营收压力而做出政策调整。我们制定政策是基于原则而不是商业利益。\n她说：我们已经制定了旨在保护和服务公众对话的政策和平台能力，并一如既往地致力于放大代表不足的社区和边缘化群体的声音。我们尊重我们的合作伙伴的决定，并将在此期间继续与他们密切合作和沟通。\n“改变的颜色”是一家为人们提供在线行动和面对面活动以对抗种族不公正的组织，该组织称赞了联合利华的声明。\n联合利华总裁拉沙德·罗宾逊(Rashad Robinson)表示，作为Facebook平台上最大的消费者之一，联合利华决定停止广告，并承诺履行我们的#StopHateforProfit承诺，这让我们在追究Facebook对针对黑人的仇恨、诽谤和歧视性内容的责任方面向前迈出了一大步。Facebook的领导人应该明白这场民权运动的严重性，并采取紧急措施补救其危害，包括实施永久性的民权基础设施。Facebook再也承担不起把视线移开的后果了。", "note_en": "Unilever, whose brands include Dove, Ben &amp; Jerry&#39;s and Hellmann&#39;s, said Friday it will halt advertising on  Facebook, Instagram and  Twitter in the U.S. at least through Dec. 31.\n The consumer products giant has spent more than $11.8 million in the U.S. this year on Facebook, according to marketing analytics firm Pathmatics.\n   &#34;Given our Responsibility Framework and the polarized atmosphere in the U.S., we have decided that starting now through at least the end of the year, we will not run brand advertising in social media newsfeed platforms Facebook, Instagram and Twitter in the U.S.,&#34; Luis Di Como, EVP of Global Media, said in a statement.\n &#34;Continuing to advertise on these platforms at this time would not add value to people and society. We will be monitoring ongoing and will revisit our current position if necessary.&#34;\n The London-based company said it will maintain its planned media investment in the U.S. by shifting to other media. Its more than two dozen brands include Breyers and Ben &amp; Jerry&#39;s ice cream, Hellmann&#39;s mayonnaise, Lipton and Pure Leaf teas and consumer staples like Dove products.\n &#34;We are actively engaging with all digital platforms to make meaningful change and impact trust and transparency,&#34; the statement said. &#34;We have made substantial progress, and we acknowledge the efforts of our partners, but there is much more to be done, especially in the areas of divisiveness and hate speech during this polarized election period in the U.S.&#34;\n  In the week since a  group of organizations called on Facebook advertisers to pause their ad spending during the month of July, more than 90 marketers including  Verizon, Patagonia, REI, Lending Club and The North Face have announced their intention to join, according to a  running list from Sleeping Giants. The group of organizations includes the Anti-Defamation League, the NAACP, Sleeping Giants, Color of Change, Free Press and Common Sense.\n The organizations said they&#39;re asking Facebook to more stringently police hate speech and disinformation by  taking a number of actions, including creating a &#34;separate moderation pipeline&#34; for users who say they&#39;ve been targeted because of their race or religion, or to let advertisers see how frequently their ads appeared near to content that was later removed for misinformation or hate, and allow them refunds for those advertisements.\n Procter &amp; Gamble, another major Facebook spender, said earlier this week it is reviewing all media channels, networks, platforms and programs it advertises on &#34;to ensure that the content and commentary accurately and respectfully all people, and that we are not advertising on or near content we determine to be hateful, discriminatory, denigrating or derogatory.&#34;\n &#34;As part of that, we&#39;re working with media companies and platforms to take appropriate systemic action where needed,&#34; P&amp;G chief brand officer Marc Pritchard said, without specifically mentioning Facebook.\n  Last year, Facebook brought in $69.7 billion in ad revenue globally through its millions of advertisers. The company said earlier this year it has more than 8 million advertisers.\n &#34;We invest billions of dollars each year to keep our community safe and continuously work with outside experts to review and update our policies,&#34; Facebook said in a statement Friday. &#34;We&#39;ve opened ourselves up to a civil rights audit, and we have banned 250 white supremacist organizations from Facebook and Instagram.\n &#34;The investments we have made in AI mean that we find nearly 90% of Hate Speech we action before users report it to us, while a recent EU report found Facebook assessed more hate speech reports in 24 hours than Twitter and YouTube. We know we have more work to do, and we&#39;ll continue to work with civil rights groups, GARM, and other experts to develop even more tools, technology and policies to continue this fight.&#34;\n In a recent memo to advertisers obtained by CNBC, Facebook&#39;s VP of global marketing solutions, Carolyn Everson, said &#34;boycotting in general is not the way for us to make progress together.&#34;\n &#34;I also really hope by now you know that we do not make policy changes tied to revenue pressure,&#34; she said in the memo. &#34;We set our policies based on principles rather than business interests.&#34;\n  &#34;We have developed policies and platform capabilities designed to protect and serve the public conversation, and as always, are committed to amplifying voices from underrepresented communities and marginalized groups,&#34; she said. &#34;We are respectful of our partners&#39; decisions and will continue to work and communicate closely with them during this time.&#34;\n Color of Change, an organization provides online actions and in-person events for people to stand up to racial injustice, praised Unilever&#39;s announcement.\n &#34;As one of the largest spenders on Facebook&#39;s platforms, Unilever&#39;s decision to halt advertising and commit to our #StopHateforProfit pledge brings us a huge step forward in holding Facebook accountable for enabling hateful, denigrating and discriminatory content against Black people,&#34; said the group&#39;s president, Rashad Robinson. &#34;Facebook leaders should understand the gravity of this movement for civil rights and take urgent steps to remedy its harms, including implementing a permanent civil rights infrastructure. Facebook cannot afford to look away anymore.&#34;", "posttime": "2020-06-27 02:35:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,facebook,pauses", "title": "联合利华暂停Facebook和Twitter上的广告至年底", "title_en": "Unilever pauses Advertising on Facebook and Twitter till year end", "transed": 1, "url": "https://www.cnbc.com/2020/06/26/unilever-pauses-facebook-and-twitter-advertising-for-rest-of-2020-due-to-polarized-atmosphere-in-us.html", "via": "", "real_tags": ["广告", "facebook", "pauses"]}, {"category": "", "categoryclass": "", "imagename": "f3f1ad030719bf2589fe3a7f47b3ff9e.jpg", "infoid": 1008484, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "让我们抛开这一点：如果你在市场上想买一辆三排SUV，你需要花很长时间和精力去看起亚Telluride(Kia Telluride)。这是合法的最好的三排运动型多用途车，我已经驾驶了自2009年以来…。永远不会。难怪它获得了2020年度世界汽车奖。\n当我在2019年芝加哥车展上第一次看到Telluride时，我的第一反应是这看起来不像起亚。没有像起亚灵魂这样古怪的设计美学。取而代之的是，这家韩国汽车制造商选择了经典的SUV外观，把异想天开换成了庄严。起亚新款旗舰SUV的正面没有卡通般的大格栅和小小的起亚灵魂徽章，而是一个看起来更克制的格栅，上面的Telluride是用大号正楷写成的，就像路虎(Range Rover)一样。Telluride的外观都是干净的线条和柔和的曲线，B和C柱融入到窗户中，窗户周围的金属装饰从前到后。\nTelluride在设计时考虑到了美国市场，LX内饰的起价为33,690美元。我们的评测车型售价为46,860美元，是一款高端的Telluride SX，包括2,000美元的Prestige套装(平视显示器、纳帕皮革内饰和加热/通风后排座椅)。满载，它是一辆令人印象深刻的野兽SUV。\n在引擎盖下，你会发现一辆3.8升的V6发动机，在6000rpm的转速下能够提供291hp(214kW)的功率，在5200rpm的转速下可以提供262磅英尺(355 Nm)的扭矩，配上8速自动变速器。这对于一辆中型三排SUV来说已经足够了，遏制重量为4,211磅(1,911公斤)。每当我在州际公路上需要一些魅力的时候，Telluride都会以最小的噪音和小题大做做出回应。Telluride提供了令人惊讶的安静乘车体验，部分原因是它的隔音玻璃挡风玻璃和前门窗户。\n有四种驾驶模式：智能、环保、运动和舒适(加上Tellurides上的Snow和AWD锁，配备了可选的AWD)。\n对于一辆以科罗拉多州山区小镇命名的车辆来说，Telluride是一款非常有能力的越野车，这并不令人惊讶。Telluride有17.0°的离地角度和8英寸(20.3厘米)的离地间隙，虽然没有前后锁定差速器，但Telluride可以利用中心离合器锁定50-50分裂的能力进行非常合适的模仿-或者将扭矩直接发送到需要它的车轮上。在最近的MAMA拉力赛上，有一个越野赛道设置在其中一个赛道的内场。除了通常的吉普车和皮卡之外，还有一辆Telluride。我跳了进去，向球场发起进攻，球场上有一条泥泞的小路，穿过一片灌木丛，直接爬上一个小山脊。随着四轮驱动的投入和中心离合器的发挥，起亚沉着地处理了整个过程。\n起亚在Telluride上包括其全套驾驶员辅助和安全功能标准，这是我们希望所有原始设备制造商都能做到的。它在很大程度上是标准的东西-避免碰撞，保持车道辅助，360°摄像头-起亚在它上做了一个我以前从未遇到过的非常好的扭转。Telluride的仪表盘是标准的两个模拟表盘，中间有一个小LED显示屏。当您激活转向灯时，显示屏上显示的任何内容都会变为汽车那一侧的摄像机视图。拿着，盲点！\n有了2000美元的SX Prestige套餐，Telluride感觉很高档，但这个大单元最引人注目的是起亚始终如一地把所有的小事情都做对了。当然，Nappa真皮座椅和模拟的拉丝金属和木质装饰坐在上面看起来很不错，但Telluride中存在着许多其他主流汽车制造商错过了的设计和谐元素。一个例子是中央控制台，上面有10.25色触摸屏信息娱乐系统。它以一种很好的方式让我想起了宝马iDrive的前几代产品。它唯一的缺点是只能触摸。虽然屏幕很容易在司机伸手可及的范围内，但在大多数与信息娱乐相关的小提琴操作中，我更喜欢在杯托附近有一个旋钮。CarPlay和Android Auto都是标准配置。\n其他的控制，比如媒体和气候，都被巧妙地放置在司机可以轻松触及的地方。驾驶位置也很出色，驾驶Telluride也有一种简单的直觉性。虽然它不是必备品，但在这个价位上，HUD确实是一个很好的选择，起亚的实现就像SUV中的其他一切一样：智能和深思熟虑。\n与三排起亚·索伦托(Kia Sorrento)不同，Telluride的内部感觉完全是宽敞的。这甚至延伸到了第三排。很难说SUV的第三排宽敞或舒适，但Telluride在谈到最不糟糕的第三排时，与庞大的宝马X7并驾齐驱。\n即使第三排向上，后面还有21cu ft(595L)的货位，第三排向下扩展到46cu ft(1303L)，第二排向下折叠到87cu ft(2464L)。第二排既可以是长凳(带有LX和EX装饰)，也可以是船长的椅子(S和SX)。\n在燃油经济性方面，Telluride也是令人尊敬的，在高速公路上达到每加仑26英里，在城市达到每加仑20英里，加起来为23英里(9/11.8/10.2L/100公里)。在一周的混合驾驶中，我们看到了每加仑23.9英里(9.8l/100公里)。\n除了少数例外，我们所有的汽车贷款期限都是一周。周末有了车，我的感觉可能会有很大不同，有好的解脱，也有请让我永远保留这个。&#34；Telluride绝对属于第二类。我开过很多三排豪华SUV，既有中型的，也有全尺寸的。而起亚Telluride SX与Prestige Pack真的很好地对抗他们。我很难辩解为什么要花75,000多美元买一辆装满子弹的沃尔沃XC90，而你花大约30,000美元就可以获得95%的体验。\n而购车者似乎也同意这一点。与我交谈过的起亚人告诉我，他们看到了Telluride SX的巨大需求，互联网上的闲聊(包括/r/askcar销售)似乎证实了这一点。考虑到Telluride的建造和乘坐质量，这也就不足为奇了，更不用说起亚出色的保修范围了。底座Telluride LX售价33,690美元，是一笔不错的交易。Telluride SX满载4.7万美元，如果你正在寻找一辆宽敞的三排SUV，拥有所有的装饰和口哨，那是一件轻而易举的事情。", "note_en": "Let&#39;s get this out of the way: if you&#39;re in the market for a three-row SUV, you need to look long and hard at the Kia Telluride. It is legitimately the best three-row SUV I&#39;ve driven since... ever. No wonder it won the  2020 World Car of the Year award.\n When I first laid eyes on the Telluride at the 2019 Chicago Auto Show, my first reaction was &#34;this doesn&#39;t look like a Kia.&#34; There are no quirky design aesthetics  like the Kia Soul. Instead, the Korean automaker has gone for the classic SUV look, swapping out whimsy for gravitas. Instead of the cartoonishly large grille and tiny Kia badge of the Soul, the front of Kia&#39;s new flagship SUV has a more restrained-looking grille with &#34;Telluride&#34; spelled out in large block letters à la Range Rover. The Telluride exterior is all clean lines and gentle curves, with the B and C pillars blending into the windows and metal trim around the windows going from front to back.\n Designed with the US market in mind, the Telluride starts at $33,690 for the LX trim. Priced at $46,860, our review model was a top-end Telluride SX with the $2,000 Prestige Package (heads-up display, Nappa leather trim, and heated/ventilated back seats) included. Fully loaded, it&#39;s an impressive beast of an SUV.\n Under the hood, you&#39;ll find a 3.8-liter V6 power plant capable of 291hp (214kW) at 6,000rpm and 262lb-ft (355Nm) of torque at 5,200rpm paired with an 8-speed automatic transmission. That&#39;s more than enough for a mid-size, three-row SUV with a curb weight of 4,211lb (1,911kg). Any time I needed some oomph on the interstate, the Telluride responded with a minimum of noise and fuss. And the Telluride offers a surprisingly quiet ride, in part because of the acoustic glass windshield and front door windows.\n There are four drive modes: Smart, Eco, Sport, and Comfort (plus Snow and AWD Lock on the Tellurides equipped with the optional AWD).\n Not surprisingly for a vehicle named after a Colorado mountain town, the Telluride is a very capable off-road vehicle. It has a 17.0° departure angle and 8 inches (20.3cm) of ground clearance, and while there&#39;s no front or rear locking differentials, the Telluride can do a very passable imitation with the center clutch&#39;s ability to lock into a 50-50 split—or send the torque directly to the wheel that needs it. At the most recent  MAMA rally, there was an off-road course set up on the infield of one of the tracks. In addition to the usual lineup of Jeeps and pickup trucks was a Telluride. I hopped inside and attacked the course, which consisted of a very muddy track that ran through a copse and directly up a small ridge. With all-wheel drive engaged and the center clutch doing its thing, the Kia handled the course with aplomb.\n Kia includes its entire suite of driver-assistance and safety features standard on the Telluride, something we wish all OEMs would do. It&#39;s largely standard stuff—collision avoidance, lane-keep assist, 360° camera—Kia put a really nice twist on it that I&#39;d not encountered before. The instrument panel in the Telluride is the standard two analog dials with a small LED display in the middle. When you activate the turn signal, whatever is showing in the display changes to a camera view of that side of the car. Take that, blind spot!\n    With the $2,000 SX Prestige Package, the Telluride feels upscale, but what stands out the most about this big unit is Kia&#39;s consistency in getting all of the little things right. Sure, the Nappa leather seats and simulated brushed metal and wood trim are nice to sit on and look at, but there&#39;s an element of design harmony present in the Telluride that many other mainstream car makers miss the mark on. One example is the center console, topped by the 10.25 color touchscreen infotainment system. It reminds me—in a good way—of previous iterations of BMW&#39;s iDrive. Its sole downside is that it&#39;s touch only. While the screen is easily within the driver&#39;s reach, I prefer also having a knob near the cupholders for most of my infotainment-related fiddling. And both CarPlay and Android Auto are standard.\n The rest of the controls, like media and climate, are smartly placed within easy reach of the driver. The driving position is outstanding as well, and there&#39;s an easy intuitiveness about piloting the Telluride. While it&#39;s not a must-have, the HUD is a really nice option at this price point, and Kia&#39;s implementation is like everything else in the SUV: smart and well-thought out.\n Unlike the three-row Kia Sorrento, the Telluride feels downright spacious inside. That even extends into the third row. It&#39;s hard to call the third row in an SUV spacious or comfortable, but the Telluride is up there with the massive  BMW X7 when it comes to least-bad third rows.\n Even with the third row up, there&#39;s still 21cu ft (595L) of cargo space behind, which expands to 46cu ft (1,303L) with the third row down and 87cu ft (2,464L) with the second row folded down as well. That second row can either be a bench (with the LX and EX trims) or captain&#39;s chairs (the S and SX).\n The Telluride is also respectable when it comes to fuel economy, hitting 26mpg on the highway, 20mpg in the city, and 23mpg combined (9/11.8/10.2L/100km). In a week of mixed driving, we saw 23.9mpg (9.8l/100km).\n With few exceptions, all of our press car loans are a week long. At the end of the week with a car, my feelings can vary between &#34; good riddance&#34; and &#34; please let me keep this forever.&#34; The Telluride is definitely in the second category. I&#39;ve driven a lot of three-row luxury SUVs, both mid-size and full-size. And the Kia Telluride SX with Prestige Pack really holds up well against them. I&#39;d have a hard time arguing for spending $75,000 plus on a loaded Volvo XC90 when you can get 95% of the experience for about $30,000 less.\n And car buyers seem to agree. The Kia folks I&#39;ve spoken with tell me that they&#39;re seeing huge demand for the Telluride SX, and chatter on the Internet (including /r/askcarsales) seems to bear that out. It&#39;s no wonder, given the Telluride&#39;s build and ride quality, not to mention Kia&#39;s excellent warranty coverage. At $33,690, the base Telluride LX is a nice deal. Fully loaded at $47,000, the Telluride SX is a no-brainer if you&#39;re looking for a roomy three-row SUV with all the bells and whistles.", "posttime": "2020-06-27 02:16:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "telluride", "title": "起亚Telluride是今年最令人惊讶的SUV", "title_en": "The Kia Telluride is the most surprising SUV of the year", "transed": 1, "url": "https://arstechnica.com/cars/2020/06/review-the-kia-telluride-is-the-best-three-row-suv-on-the-market/", "via": "", "real_tags": ["telluride"]}, {"category": "", "categoryclass": "", "imagename": "ce7de48d49d6e6acfc96cd7ab8c6c9cd.jpg", "infoid": 1008483, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国东部时间周五下午1：45更新：SpaceX已经取消了周五的Starlink发射尝试。该公司在推特上宣布推迟发射，宣布退出今天的星链任务；团队需要额外的时间进行发射前的检查，但猎鹰9号和卫星状况良好。一旦靶场确定，将宣布新的目标发射日期。\n原文：SpaceX正在为周五下午第10次发射Starlink卫星做准备。搭载猎鹰9号火箭从佛罗里达州肯尼迪航天中心发射的计划是在美国东部时间下午4点18分(世界协调时20点18分)。周五发射尝试的天气前景是有利的。\n在这次第10次发射中，值得后退一步来认识到，除了开发可重复使用的火箭，两个不同的龙航天器，以及雄心勃勃的星际飞船项目外，SpaceX在过去几年里还建造了600颗卫星。而且这些都不是小立方体卫星--每颗Starlink卫星重260千克，都有自己的星载推进系统。这是一个相当了不起的新生产能力。\nSpaceX在去年发射了如此多的卫星，并计划在低地球轨道上建造一个信标星座，以便从太空提供全球互联网服务，并计划再发射数千颗卫星，这引起了天文学家的担忧，这是可以理解的。SpaceX试图关注这些担忧。\n此前，从1月份开始，SpaceX开始试验将卫星调暗，以降低卫星的反射率。这使得它们的亮度降低了大约一个星等。现在，通过这次发布，该公司将寻求进一步解决其中一些担忧。该公司已经开发出一种无线电透明泡沫，它将从卫星上翻转出来，防止反射。\n该公司表示，这款面罩在发射时平放在底盘上，在卫星与猎鹰9号分离时展开。遮阳板通过完全阻挡光线到达漫射天线来防止光线从漫射天线反射出去。这种方法不仅避免了天线表面变暗带来的热影响，而且还应该对亮度降低有更大的影响。\n现在，这些面罩卫星将有机会在太空中大放异彩，或者更确切地说，是不是大放异彩。周五的发射尝试将发射57颗带护目镜的Starlink卫星，以及由SpaceFlight安排的两颗BlackSky Global卫星的搭乘任务。这项拼车任务应该有助于SpaceX抵消部分发射成本。\n这将是SpaceX第三次五次发射猎鹰9号核心-这枚助推器于2019年3月从Demo-1任务开始其职业生涯，此后还执行了其他三次任务。该公司将在“当然我仍然爱你”无人机上找回这个助推器。下面的网络直播应该在起飞前大约15分钟开始。", "note_en": "1:45pm ET Friday Update: SpaceX has scrubbed its Starlink launch attempt for Friday. The company announced the delay by saying  on Twitter, &#34;Standing down from today’s Starlink mission; team needed additional time for pre-launch checkouts, but Falcon 9 and the satellites are healthy. Will announce new target launch date once confirmed on the Range.&#34;\n Original post: SpaceX is preparing for its 10th launch of Starlink satellites on Friday afternoon. The launch on board a Falcon 9 rocket from Kennedy Space Center in Florida is scheduled for 4:18pm ET (20:18 UTC). The weather outlook for Friday&#39;s launch attempt is favorable.\n On this 10th launch, it&#39;s worth stepping back to realize that, in addition to developing reusable rockets, two different Dragon spacecraft, and working on its ambitious Starship project, SpaceX has  also built 600 satellites in the last couple of years. And these are not small CubeSats—each of the Starlink satellites weighs 260kg and has its own on-board propulsion system. This is a pretty remarkable new production capability.\n  That SpaceX has launched so many satellites in the last year, and plans to launch thousands more as it builds out a constellation of beacons in low-Earth orbit to provide global Internet service from space, has understandably raised concerns among astronomers. SpaceX has tried to be attentive to these concerns.\n Previously, beginning in January, SpaceX began to experiment with darkening its satellites so they were less reflective. This helped reduce their brightness by about one magnitude. Now, with this launch, the company will seek to address some of those concerns further. The company has developed a radio-transparent foam that will flip out from the satellites and prevent reflection.\n &#34;This visor lays flat on the chassis during launch and deploys during satellite separation from Falcon 9,&#34;  the company stated. &#34;The visor prevents light from reflecting off of the diffuse antennas by blocking the light from reaching the antennas altogether. Not only does this approach avoid the thermal impacts from surface darkening the antennas, but it should also have a larger impact on brightness reduction.&#34;\n Now these &#34;visor&#34; sats will get their chance to shine, or rather not shine, in space. Friday&#39;s launch attempt will loft 57 Starlink satellites, with visors, along with a rideshare mission of two BlackSky Global satellites arranged by Spaceflight. This rideshare mission should help SpaceX offset some of its launch costs.\n This will be the third time SpaceX has launched a Falcon 9 core five times—this booster started its career with the Demo-1 mission in March 2019 and has since flown three other missions. The company will seek to recover this booster on the  Of Course I Still Love You droneship. The webcast below should begin about 15 minutes before liftoff.", "posttime": "2020-06-27 02:15:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "周五,scrubs,卫星", "title": "SpaceX周五取消卫星发射尝试Starlink[更新]", "title_en": "SpaceX scrubs Friday launch attempt Starlink of satellites [Updated]", "transed": 1, "url": "https://arstechnica.com/science/2020/06/spacex-set-to-launch-a-full-complement-of-starlink-satellites-with-visors/", "via": "", "real_tags": ["周五", "scrubs", "卫星"]}, {"category": "", "categoryclass": "", "imagename": "52679ba6c65e6e16e23bca5c12262e4b.jpg", "infoid": 1008482, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从本质上讲，重力是一个谜。是的，我们可以谈论时空的曲率，也许还可以用拉伸的橡皮片来类比。但是我们不知道为什么质量会导致时空弯曲。\n换句话说，在我们的引力理论中，物质是风景，时空既是演员又是舞台工作人员。但物质的行为是由量子力学描述的，量子力学将空间和时间视为给定的变量。对于量子力学来说，空间和时间是物质展示有史以来最好的舞台。我们如何让这两种理论只上演一出戏呢？\n也许这就是为什么这两种理论根本不能融合在一起-没有一部剧可以有两个主演，对吗？多亏了一种新的实验装置，我们可能最终会找到答案，它可能会让引力和量子力学都发挥主导作用。\n物理学家们认为，必须有可能将引力和量子力学结合起来：这是一种共同的理论，量子力学的甜汁和广义相对论略微让人费解的甘露就是从这个理论中流出的。问题是，理论是建立在数据的基础上的，我们几乎没有关于量子力学如何被重力修改(反之亦然)的数据。\n量子力学和引力的观测同时重要，但由于规模的原因，观测是困难的。当支配量子力学的力很重要时，引力就非常弱。在天平的另一端，重力在很长的距离内占主导地位，而量子效应在这些距离上完全消失。这可能是黑洞唯一的视界提供了一个自然的实验，在那里你可以观察到量子力学与重力一起工作。幸运的是，附近没有任何黑洞可以让我们进行详细的观测。\n另一种选择是创建我们自己的硬件，在那里我们可以直接观察到被重力改变的量子行为。除了技术上的困难，这也有不利的一面：引力效应在本质上是牛顿的，可能会受到地球质量分布变幻莫测的影响。需要一些一流的模型才能表明，任何观测到的与预测的偏差都是由于新物理造成的。然而，研究人员正在建立至少可以提供数据的实验。\n我们怎么才能得到这些数据呢？从本质上说，我们需要一个巨大而巨大的物体，它对量子系统也有明显的影响。这正是研究人员正在创造的。这是一个钟摆，但不是普通的钟摆。\n如果没有进一步的能量输入，普通的钟摆--绳子上的质量--会迅速减速到停止。即使在真空中，钟摆的弦也会弯曲和弯曲，使其动量消散。同样，绳子和质量之间的连接，以及绳子和支撑架之间的连接也会弯曲和弯曲。这些瑕疵不仅从摆动运动中吸收能量，而且通常在错误的时间将能量送回，从而改变钟摆的摆动运动。结果是钟摆的运动不是完全可预测的。这些瑕疵可能小得令人难以置信，但它们足以冲刷掉量子力学的影响。\n为了制造出近乎完美的钟摆，研究人员将一个小硅盘(直径3毫米)焊接到一根精细的玻璃纤维上，然后再将其焊接到一块大玻璃块上。拉丝工艺和焊接是关键步骤。通过注意纤维是如何拉伸的，研究人员能够创造出高度均匀的5厘米长、直径1微米的纤维。焊缝(与胶水或夹具相反)提供的是一种不太柔韧的僵硬的附着物。为了让你知道这个钟摆到底有多好，一旦启动，它在15小时后仍然在运动，没有任何额外的能量。如果用胶水粘住，时间只有两到三个小时。\n钟摆本身不是量子物体。但它是在重力和量子力学可以一起发挥作用的界面上运行的。钟摆的自然运动是由万有引力(在这种情况下是牛顿引力)给出的。但是硅片是一面很好的镜子：它可以被光推来推去。\n基本的想法是，当镜子摆动时，它也会撞到光子并反射它们。这种反光使镜子猛烈一击。如果镜子朝着入射光移动，踢会减慢它的速度；如果镜子离开入射光，踢会加快它的速度。只有非常干净的机械振荡器才能观察到这一点，就像研究人员建造的那样。\n这些相互作用的量子力学是非常清楚的，并且测量非常精确。振子的性质是由重力决定的，所以任何偏差都可能归因于与牛顿引力的偏差。正如我上面所说的，这将需要对整个系统的量子和重力方面进行一些非常好的建模。\n在接下来的几年里，研究人员将建立光学装置，使他们能够用高精度的激光驱动和测量钟摆。在那之后，真正的乐趣将开始，我们可能会看到上升的光子与下降的引力子相遇。", "note_en": "Gravity is, at heart, a mystery. Yes, we can talk about curvature of space-time and perhaps make analogies with stretched rubber sheets. But we don’t know why mass causes space-time to curve.\n To put it another way, in our theory of gravity, matter is the scenery and space-time is both cast and stage crew. But matter&#39;s behavior is described by quantum mechanics, which takes space and time as a given. For quantum mechanics, space and time are the stage in which matter puts on the best show ever. How do we get these two theories to put on just one play?\n Perhaps this is why the two theories simply do not get on—no show can have two lead actors, right? We may finally get to find out thanks to a  new experimental device that may make it possible for both gravity and quantum mechanics to play lead roles.\n  Physicists think that it must be possible to unite gravity and quantum mechanics: a common theory from which floweth the sweet sap of quantum mechanics and the slightly mind-bending nectar of general relativity. The problem is that theories are built on data, and we have very little data about how quantum mechanics is modified by gravity (or vice versa).\n Observations of quantum mechanics and gravity being simultaneously important are difficult because of scale. When the forces that govern quantum mechanics are important, gravity is incredibly weak. At the other end of the scale, gravity dominates over very long distances, while quantum effects vanish entirely at these distances. It may be that the only the event horizon of a black hole provides a natural experiment where you might observe quantum mechanics working alongside gravity. Luckily, there aren’t any nearby black holes that allow us to make detailed observations.\n The alternative is to create our own hardware where we can directly observe quantum behavior being modified by gravity. Apart from the technical difficulties, this also has a downside: the gravitational effects will be Newtonian in nature and probably subject to the vagaries of the Earth’s mass distribution. It will take some top-class modeling to show that any observed deviation from predictions is due to new physics. Nevertheless, researchers are building experiments that may at least provide data.\n  How do we get that data? Essentially, we need a giant and massive object that also has observable effects on a quantum system. This is exactly what the researchers are on the way to creating. It’s a pendulum, but not just any pendulum.\n An ordinary pendulum—a mass on a string—will quickly slow to a stop if not given an input of further energy. Even in a vacuum, the pendulum’s string will bend and flex, dissipating its momentum. Likewise, the connections between the string and the mass, and the string and the support frame, will also bend and flex. These imperfections don’t just absorb energy from the swinging motion, they also give it back, usually at the wrong time, shifting the pendulum’s swinging motion. The result is that the pendulum’s motion is not perfectly predictable. These imperfections can be incredibly small, but they&#39;re enough to wash out the influence of quantum mechanics.\n To make a nearly perfect pendulum, the researchers welded a small silicon disc (3mm in diameter) to a fine glass fiber, which was then welded to a large glass block. The fiber drawing process and the welds were the critical steps. By paying attention to how the fiber is drawn, the researchers were able to create a 5cm long, 1µm diameter fiber that was highly uniform. The welds (as opposed to glue or clamping) provide the sort of stiff attachment that does not flex very much. To give you an idea of just how good this pendulum is, once set in motion, it was still in motion 15 hours later without any additional energy. If it had been glued and clamped, that time would be just two to three hours.\n  The pendulum itself is not a quantum object. But it&#39;s operating at the interface where gravity and quantum mechanics can play together. The pendulum’s natural motion is given by the laws of gravity (Newtonian gravity, in this case). But the silicon disc is an excellent mirror: it can be pushed around by light.\n The basic idea is that as the mirror swings, it will also bump into photons and reflect them. That reflection gives the mirror a kick. If the mirror is moving toward the incoming light, the kick will slow it down; if the mirror is moving away from the incoming light, the kick will speed it up. This is only observable for very clean mechanical oscillators, like the one that the researchers have built.\n The quantum mechanics of these interactions are very well understood, and the measurements are very precise. The oscillator’s properties are given by gravity, so any deviations  may be attributable to deviations from Newtonian gravity. As I said above, though, this is going to need some mighty good modeling of both quantum and gravitational aspects of the whole system.\n In the next couple of years, the researchers will build up the optical setup to allow them to drive and measure the pendulum with high-precision lasers. After that, the real fun will begin, and we may get to see the rising photon meet the falling graviton.", "posttime": "2020-06-27 02:14:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "可能,pendulum,量子力学", "title": "微小的钟摆可能揭示引力的秘密", "title_en": "Tiny pendulum may reveal gravity’s secrets", "transed": 1, "url": "https://arstechnica.com/science/2020/06/tiny-pendulum-may-reveal-gravitys-secrets/", "via": "", "real_tags": ["可能", "pendulum", "量子力学"]}]