[{"category": "", "categoryclass": "", "imagename": "fb8971d61dcbd7031875cbce499f2737.jpg", "infoid": 1006090, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1911年推出，并至少持续生产到1916-1917年。我认为罗宾斯和麦尔斯(Robbins&Amp；Myers)是那个时期最好、最简单的粉丝之一，1404&34；型号14，上面的照片显示了它的三个版本。此外，还制作了类似的16&34；风扇，名单1411和14110，除风扇大小外，与12&34；型号基本相同。\n从左到右是1911年的原始型号(我最喜欢的粉丝之一，经常是日常用户)，警卫使用的是方形背环。这与R&amp；M&34；棒棒糖风扇后来的生产版本使用的笼子相同。下面显示了一个早期的棒棒糖粉丝。1912年，1404的护罩改为两圈笼子，使用圆形钢丝背环和R&amp；M已经使用了几年的相同的普通旗笼徽章。*在1404年的最后几年，名单编号。变成了14040，基本上是和1404型一样的风扇，但有一个毛毡覆盖的底板。实际上，生产的最后一年是在R&amp；为1916年推出了新的拉制钢制风扇电机之后，似乎已经有了一个笼子，上面有上面照片右侧所示的新的、更小的实心笼子徽章。右边的风扇在底座上有它原来的感觉。*这三个风扇都有他们原来的油漆，在黄铜上抛光，和头线。\n在冲压钢马达型号问世后，14040是继续生产了一年或更长时间，还是我看到了一些笼子更换的结果？我从加拿大多伦多找到了一些新的信息，下面的电子新闻显示，旧铸铁R&AMM风扇与新的1916年冲压钢型号一起出售。这将解释最新榜单上1404款车型上的小圆形徽章。似乎1916年的12&34；和16&34；风扇，无论是旧的铸铁型号还是新的冲压钢型号，都使用了旧的国旗徽章，而只有较小的(冲压钢制)风扇使用了新的圆形实心笼子徽章。在1917年的型号中，钢铁都有较新的圆形笼子徽章和一个黄铜笼子。1918年，可能还有1919年，R&Amp；M&M的较大风扇有一个包裹的钢笼，随后是一个焊接的钢笼，公元1920年。\n如果不是准确的话，人们可以按如下方式密切地确定列表1404型和14040型的日期：\nRobbins&Amp；Myers是历史最悠久的风扇公司之一，于1897年开始在俄亥俄州斯普林菲尔德制造直流吊扇，由钱德勒·罗宾斯和詹姆斯·迈尔斯所有。直流台式风扇是在1899年增加的。在从Charles Eck那里获得摆动风扇机构的专利后，R&amp；M于1904年将其独特的直流棒棒糖振荡器投入生产，几年后又推出了交流版本。*风扇前面的薄片黄铜盘受到来自风扇的空气的作用，导致风扇来回摆动。风扇底座上的止动块被棒棒糖轴底部的销子接触，将圆盘移动到另一边，导致风扇摆动到另一边。\n直到1908年第一台交流风扇问世之前，R&Amm一直只生产直流电风扇。他们的新12&34；和16&34；AC风扇是由西屋制造的，并为R&Amm重新贴上了徽章。它们实际上与西屋的坦克风扇一模一样，但带有R&amp；M开放旗帜笼子徽章。随着西屋电气(Westinghouse)即将在1912年推出一款新的拉制钢制风扇电机，R&amp；很可能发现它将不再有交流风扇电机的来源，这促使他们设计自己的交流风扇电机，该列表1404；及其变种。\n1404取消了以前西屋电气制造的R&Amm；AC风扇的机械启动开关。1404融合了三种速度，在高、中、低速度之间有很好的分离。他们跑起来也很安静，是日常生活中很容易使用的风扇。\n更常用的敞开旗帜笼形徽章在大多数1404年和14040风扇上使用，如右图所示，1916年在12&34；和16&34；R&Amp；M风扇上使用过。下面的照片，右，是R&amp；M铸铁风扇电机生产的最后一年(大概是1917年)使用的较小的圆形徽章。我既有12&34；R&A；M 14040振荡器，也有16&34；R&A；M 11530振荡器，带有圆笼徽章。1911-1917年间的Robbins&amp；Myers汽车标签几乎没有关于它们的信息；清单编号(前两位是型号)以及电压和频率，以及直流电或交流电。但这就是你得到的所有信息-没有序列号或专利日期或其他信息。如果有专利正在申请中，它们从来没有作为实际日期出现在这些风扇的电机标签上。是的，R&Amm确实制造了1404型和14040的直流电版本。上面是较新版本的列表1505中的电机标签，该列表具有毛毡底板，使其成为列表15050。请注意30伏\n对我来说，不同寻常的是，铜翼螺栓应该表明螺栓是由黄铜制成的，而人们可能会认为，黑色的翼螺栓应该表明是铁翼螺栓。此外，人们还会认为黄铜更早，铁更晚。1911年的机型都有漆铜的机翼螺栓。在这里讨论的最新风扇上，有一个小的，实心的笼子徽章，大的翼螺栓是钢的，而小的是铜的，漆成黑色。第一张照片中央的风扇和直流风扇都有一个铜制的大螺栓，但都有一个黑色的钢制小螺栓。但这样的小细节对于老粉丝来说并不少见。*这些公司可能用了他们手头的东西。\n这些风扇从未使用过后轴承盖或后轴承盖。在没有毛毡底板的早期型号上，棕褐色纤维盖被拧到底座上，这有助于保护开关和布线。三只橡胶脚保护着风扇放置的表面。\n下面是早期(1911年)带有方形背环的笼子和后来带有两个圆形环的笼子的对比照片。双环笼子只在使用的年份(1912-1917年)中有所不同，因为1917年的笼子上有较小的实心徽章。\n笼子支柱和夹子如右图所示，历年都是用冲压钢制成的，没有什么不同。所有连接的螺钉都是实心的黄铜。\n刀片经过高度抛光和上漆。笼子和其他黄铜部件可能是浸泡和上漆的，并不像现代修复中常见的那样高度抛光。我从来没有想过蘸漆是什么意思，但我会经常在那个时期的粉丝目录中看到这个词。\n下面是一些30伏直流电源的照片，列出了15050个风扇。经过一些换向器和刷子的清洗和油杯的润滑，这台风扇运行得很好。我将电源线连接到我的压差上，将电压降低到30伏或更低，并将其插入电源条插座，我在插座中安装了一个桥式整流器，可以提供接近直流电压的电压。但是桥式整流器很小，每个大约4美元，而且很容易连接。他们可以安装在大多数早期风扇的底座内，如果底座上有空间，然后风扇可以插入常规的房屋墙壁插座。\n当直流模型的底座相同(开关不同)时，电机的直径更大、深度更深，结构不同。我想说DC比AC版本的电机更好看。从电机后侧伸出的管子是刷架。但早期版本的不同之处在于有一个螺丝上的滚花帽。直到1917年左右，才出现我们今天所知的典型的两个插头。取而代之的是风扇和其他电器使用如下所示的连接插头，允许风扇连接到灯插座。在19世纪10年代，墙壁插座开始安装在建筑物中，但连接插头一直持续到20世纪30年代，当时可以从标准的双叉插头中分离出来。直流风扇电机的排气与交流电机非常不同。直流电机上的几个大开口与交流电机上的许多较小的通风孔形成对比。油杯是由黄铜制成的，里面有弹簧加载的毛毡芯子，用来把油抽到轴承上。20磅的非洗涤剂是旧风扇使用的合适机油。这些R&AMM粉丝的稀缺性和可用性如何？我会说他们有点不常见，但并不太难找到。当然，它们甚至比1902-07年的GE煎饼，或者GE同期的大电机轭(Big Motor Yoke)和小电机轭(Small Motor Yoke)都要少得多。直流模式相当罕见，很难找到，这是有意义的，因为直流电在我们国家的大部分时间里都相当早地消失了。我打赌很多华盛顿的粉丝在两次世界大战的废品驱动器中遇到了他们的命运。\n感谢一位著名的R&amp；M粉丝收藏家为我提供了1911年1404系列粉丝的R&amp；M目录页的扫描。我遇到的唯一数字是普通110伏60循环电流的1404和1411个风扇。在榜单1404和其他铸铁R&AMM粉丝之后发生了什么？直到1916年，所有R&A&M台式风扇都是铸铁制造的。从1916年开始，R&amp；M有了由拉制钢材制成的新设计，这是西屋电气在1912年车型年率先采用的特点。似乎在1916年之后的一两年里，铸铁模型仍然可以买到，但他们的风扇主要是新压制的钢结构。新产品包括一个带四个叶片的6&#34；双速风扇、一个三速风扇、5个叶片风扇-型号26和27(交流和直流)和12&#34；和16&#34；6个叶片风扇-型号21和22(交流和直流非振荡器)以及摆动风扇，型号24和25(交流和直流)。型号是列表号的前两位，这是描述R&AM的重要数字", "note_en": "Introduced for 1911 and continued in production through at least  1916-1917 is what I consider to be one of the best and simplest fans of the period, the Robbins &amp; Myers &#34;List 1404&#34; model 14, three versions of which are shown in the photo above.  A similar 16&#34; fan was also made, the List 1411 and 14110 which, other than the fan size, was basically the same as the 12&#34; model.\n  Left to right are the original 1911 model (one of my favorite fans and often a daily user) with a guard using a square back ring.  This is the same cage used on later production versions of the R&amp;M &#34;lollipop&#34; fan.  An early lollipop fan is shown below.  For 1912 the guard of the 1404 was changed to a two ring cage using a round wire back ring and the same common flag cage badge that R&amp;M had already been using for a few years.  For the final few years of the 1404 the List No. became 14040 and was, basically, the same fan as the 1404 but with a felt covered base plate.  The last year of production was actually  after R&amp;M introduced their new drawn steel fan motors for 1916 and appears to have had a cage with the new, smaller solid cage badge as shown on the right of the photo above.   The fan on the right has its original felt on the base.  All three fans have their original paint, finish on the brass, and head wires.\n  Was the 14040 continued in production for a year or more after the stamped steel motor modles came out or am I seeing the result of some cage substitutions?  I have found some new information from the Toronto, Canada  The Electrical News, below, that shows the old cast iron R&amp;M fans were sold alongside the new 1916 stamped steel models.  This would account for the small round badge on the latest List 1404 models.  It appears that the 12&#34; and 16&#34; fans for 1916, both the old cast iron models and new stamped steel models, used the old flag badge while only the smaller (stamped steel) fans used the new round solid cage badge.  1917 models, both iron and steel had the newer round cage badge and a brass cage.   For 1918 and possibly 1919 R&amp;M&#39;s larger fans had a wrapped steel cage followed by a welded steel cage c.1920.\n     One can closely, if not exactly, date the List 1404 and 14040 models as follows:\n      Robbins &amp; Myers was one of the oldest fan companies, having begun the manufacture of direct current ceiling fans in 1897 in Springfield, Ohio under the ownership of Chandler Robbins and James Myers.  Direct current desk fans were added in 1899.  After acquiring a patent from Charles Eck for an oscillating fan mechanism, R&amp;M put into production their unique DC &#34;lollipop&#34; oscillator in 1904, followed a few years later by an AC version.  A sheet brass disk in front of the fan was acted upon by the air from the fan causing the fan to oscillate back and forth.  Stops on the base of the fan were contacted by a pin at the bottom of the lollipop shaft to shift the disc to the other side, resulting in the fan oscillating to the other side.\n    R&amp;M had been making only direct current fans until 1908 when their first AC fans were introduced.  Their new 12&#34; and 16&#34; AC fans were made by Westinghouse and re-badged for R&amp;M.  They were virtually identical to the Westinghouse &#34;tank&#34; fans but with the R&amp;M open flag cage badge.  With Westinghouse&#39;s impending introduction of a new drawn steel fan motor in 1912 it is likely that R&amp;M found it would no longer have a source of AC fan motors, prompting them to design their own AC fan motor, the &#34;List 1404&#34; and varients.\n  The 1404 did away with the mechanical start switch of the previous R&amp;M AC fans made by Westinghouse.  The 1404 incorporated three speeds with a good speed separation between high and medium and medium and low.  They also run pretty quietly and are an easy fan to live with for daily use.\n       The much more commonly used &#34;open flag&#34; cage badge as used on most 1404 and 14040 fans is shown in the top photo, right, and was used on 12&#34; and 16&#34; R&amp;M fans through 1916.  The photo below, right, is of the smaller round badge used during the last year of R&amp;M cast iron fan motor production, presumably 1917.   I have both the 12&#34; R&amp;M 14040 and a 16&#34; R&amp;M 11530 oscillator with the round cage badge.                    Robbins &amp; Myers motor tags from the 1911-1917 era have little information on them; the &#34;List No.&#34; (the first two digits are the &#34;model number&#34;) and the voltage and frequency, as well as direct or alternating current.  That is all you got- no serial numbers or patent dates or other information was included.  If there were patents pending they never were on the motor tags of these fans as an actual date.         Yes, R&amp;M did make Direct Current versions of the 1404 and 14040.  Above is the motor tag of a later version of the List 1505 with felt base plate making it a List 15050.  Note the 30 volts on the tag.  A standard 110 v. DC version is a List 1500, or List 15000 with the felt base.  Most information for R&amp;M fans is hard to come by.  I have not seen any catalogs of their earlier fans so that I might see what voltages and frequencies they made fans for or the other models that were made in this series of the Models 14 and 15.   Right:  The 1911 1404 on the left in the photo and the c.1915 14040 on the right.  Not too many fan makers pin striped their fans but R&amp;M was one who did well into the 1920s.  Usually a pair of double stripes was used, hand applied, around both the motor and the base.  A single stripe was applied to the sides of the trunnion.   R&amp;M&#39;s finish was second to none in this period and their black japan finish was very durable.  It can usually be cleaned up using acetone and a rag and Q-tips with no harm to the japan.  That finish is really tough!  Click on photos in the blog to see a larger version.     There are two wing bolts on these fans.  Here you can see them both painted black; one for the tilt adjustment on the left upper side of the trunnion and a smaller wing bolt, also painted black on this fan, at the bottom center of the trunnion to adjust for side to side position of the fan. The tilt adjustment must be the easiest to use and most secure locking of any fan ever made.  A wonderful design of a simple part.\n  What is unusual to me is that a brass wing bolt should indicate that the bolt is made of brass and, one would think, a black painted wing bolt would indicate an iron wing bolt.  Also, one would think that brass is earlier and iron is later.  The 1911 model has both wing bolts of lacquered brass.  On the newest fan discussed here, the one with the small, solid cage badge, the large wing bolt is steel but the small one is brass, painted black.  The fan in the center of the first photo and the DC fan both have a brass large bolt but a black steel small bolt.  Such minor details are not uncommon for old fans.  The companies probably used what they had on hand.\n      Rear bearing caps or covers were never used on these fans.  On the earlier models without the felt base plate a tan fiber cover was screwed to the base which helped to protect the switch and wiring.  Three rubber feet protected the surface the fan was placed on.\n    Below are comparison photos of the early (1911) cage with square back ring and the later cages with the two round rings.  The double ring cages only differed among the years used (1912- 1917) by having the smaller solid badge on the  1917 cages.\n         Cage struts and clips as shown to the right were made of stamped steel in all years and did not differ.  Attaching screws were solid brass.\n Blades were highly polished and lacquered.  Cages and other brass parts were probably dipped and lacquered and not highly polished as is commonly seen on modern restorations.  I have never figured out what the &#34;dipped&#34; part of dipped and lacquered is but will often see that term used in fan catalogs of the period.\n     Some photos, below, of the 30 volt Direct Current, List 15050 fan.  After some cleaning of the commutator and brushes and lubricating the oil cups, this fan runs very well.  I connect the power cord to my variac to reduce the voltage to 30 volts or less and plug it into a power strip socket in which I have installed a bridge rectifier which gives a close approximation of direct current voltage.  The bridge rectifiers are small, about $4 each, and are easy to hook up.  They can be installed inside the base of most early fans if there is room in the base and the fan can then be plugged into a regular house wall outlet.\n    While the base of the DC models is the same (the switch is not the same) the motor is larger in diameter and deeper, with different construction.   I would say the DC has a better looking motor than the AC versions.  The tubes sticking out from the rear sides of the motor are the brush holders.  Earlier versions differ somewhat in having a screw-on knurled cap.   There were no typical two prong plugs as we know them today until about 1917.  Instead fans and other electrical appliances used &#34;attachment plugs&#34; as shown below allowing the fan to be connected to a light socket.  In the nineteen teens wall outlets began to be installed in buildings but the attachment plugs persisted into the 1930s, by then separable from a standard two prong plug.          Venting on the DC fan motors is very different from the AC motors.  A few large openings on the DC motors contrast with many smaller vent holes on the AC motors.  Oil cups are made of brass and have spring loaded felt wicks in them to wick oil to the bearings.  20 wt. non-detergent is the proper oil to use on old fans.      What about rarity and availability of these R&amp;M fans?  I would say they are a bit uncommon but not too hard to find.   Certainly they are much less common than even the 1902-07 GE pancakes, or the GE &#34;Big Motor Yoke&#34; and &#34;Small Motor Yoke&#34;  models of about the same period.  DC models are fairly rare and hard to find which makes sense since Direct Current power disappeard for the most part from our country fairly early.  I bet a lot of DC fans met their fate in the scrap drives of the two world wars.\n  Thanks goes to a noted collector of R&amp;M fans for providing me with this scan of an R&amp;M catalog page for the 1911 year List 1404 series of fans. The only numbers I have encountered are the List 1404 and 1411 fans for the common 110 volt 60 cycle current.     What came after the List 1404 and other CAST IRON R&amp;M fans?   Up until 1916 all R&amp;M desk fans were made of cast iron.  Beginning in 1916 R&amp;M had new designs made of drawn steel, a feature that Westinghouse pioneered for the 1912 model year.  It appears that the cast iron models were still available for a year or two after 1916 but, predominately, their fans would be of the new pressed steel construction.  The new offerings included a 6&#34; two speed fan with four blades, a three speed 9&#34;, 5 blade fan- Models 26 and 27 (AC and DC), and 12&#34; and 16&#34; 6 blade fans- Model 21 and 22 (AC and DC non-oscillators) as well as oscillating fans, Models 24 and 25 (AC and DC).  The model numbers were the first two digits of the &#34;List Number&#34; which is the important number in describing R&amp;M fans.  For several years the 12&#34; and 16&#34; fans were available only with 6 blades.  A brass cage was used on 1916-17 fans with a change to wrapped steel cages for one or two years more before the cages went to welded steel.   Before the welded steel cages appeared the four blade fans returned and the 6 blade may have been discontinued.  As R&amp;M information is hard to come by I will leave it at this for now until I can update the details.                                                                                            Pictured at left is a 1916 R&amp;M 6 wing oscillating Model 24 (List 2404).  This is probably the last year for the large, open flag cage badge to be used and followed in 1917 by the smaller, solid, round flag cage badge, still on a brass cage and with a 6 wing blade.                (To be continued)  I have not yet covered or even mentioned that there are 16&#34; versions of the 1404; the List 1411, 14110, etc.  The size difference is about the only notable difference although the first year model 1411 (1911) used a square back ring cage but with a front (round) ring that the 12&#34; fan did not use, it had no front ring on the cage.   8-24-16  R&amp;M Flag cage badges- new reproductions: Often the original cage badge is missing from early R&amp;M fans.  It was a thin stamped sheet brass &#34;flag&#34; as you see pictured in this blog.   Fortunately for those who have a missing badge, which is a very common occurrence, AFCA member Darryl Hudson makes excellent die stamped reproductions that are nearly impossible to tell from the originals.  Darryl made a run of flag badges then ran out. Fortunately he did made another batch around 2014 and I think they are still available.  If you need a badge don&#39;t dally, they may sell out again and you don&#39;t know if they will be made again.  Darryl does excellent work.  He makes the badges in the original thickness of .010 and the same in a thicker and slightly more durable 0.015&#34; thickness for the same price of $40.00 each plus shipping.   That&#39;s a bargain for the quality and intricateness of his badges.   Darryl Hudson  68 Bluegrass Drive, Aiken, SC 29803  (803) 649-6641  http://www.hudsonscustommachining.com  Many high quality reproduction parts supplies: grommets, feet, brush caps, gears, plugs and various hardware. Also custom machining and some restoration services. See Web page or email for complete list.                    Above:  Darryl had dies made to stamp out new R&amp;M cage badges.  Quality is excellent with relief on both sides as per the originals.                  Left:  Darryl Hudson  reproduction R&amp;M cage badge that has seen some use and had one corner bent some.  What you get form him are perfect and an unpolished bright brass.  Above right;  original R&amp;M cage badge with original &#34;dipped and lacquered&#34; finish.    Blades were highly polished and lacquered but not on cages or badges.      Here is a brand new Darryl Hudson reproduction as you will receive them showing the front and the back sides.    Click on any photo to enlarge; two clicks to supersize on many photos.", "posttime": "2020-06-11 10:34:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "早期,electric,风扇", "title": "早期的电扇", "title_en": "Early electric fans", "transed": 1, "url": "https://earlyfans.blogspot.com/2011/10/robbins-myers-list-1404-desk-fans-1911.html", "via": "", "real_tags": ["早期", "electric", "风扇"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006089, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "木工YouTube频道", "note_en": "Woodworking YouTube channels", "posttime": "2020-06-11 10:33:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "工程师,woodworking,youtube", "title": "工程师用的木工", "title_en": "Woodworking for Engineers", "transed": 1, "url": "https://woodgears.ca/", "via": "", "real_tags": ["工程师", "youtube"]}, {"category": "", "categoryclass": "", "imagename": "b4870c53e6815ee09b4b01987698ca04.jpg", "infoid": 1006088, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一名软件开发人员在推特上发帖称，每天戴几个小时的虚拟现实头盔会损害他的视力。\n在一位医生将他的视力问题归咎于这项技术后，一次去眼镜店的旅行让他对我未来的VR使用感到担忧。\n他在推特上写道，眼镜应该可以解决这个问题，但通常只会开给40岁的人。\n视光师协会表示，没有看到VR头盔会造成永久性眼睛损伤的证据。\nFacebook旗下的Oculus在其手册中表示，每4000人中就有一人可能会出现头晕、癫痫、眼睛或肌肉抽搐。该公司建议出现这些症状的用户停止使用耳机并去看医生。\n医生此前曾警告称，虚拟现实是对真实或想象环境的计算机生成模拟，可能会导致眼睛疲劳，因为大脑被迫以不同于正常的方式处理视觉刺激。\n用户抱怨使用耳机时会感到恶心和头晕，这通常会降低用户感知周围空间的方式，从而导致晕动病。\n丹尼·比特曼(Danny Bittman)已经做了四年的虚拟现实开发人员，他认为这可能会影响他的视力。\n我三年来第一次去看眼科医生。现在我非常担心我未来的虚拟现实使用。我有一个新的眼球会聚问题，表现得像诵读困难症。医生是一位耳机拥有者，他相信这是我使用VR造成的。他在推特上写道：我们通常会给40岁的人配这种眼镜。\n他接着描述了这个问题：当我看屏幕或书之类的东西时，我的眼睛会跳起来。我一直都有一小部分这样的症状，但现在更严重了。它还与头痛和眩晕有关。\n他说，这个问题是关于长时间使用耳机的问题，并承认他每天最多可以戴6个小时的耳机，分成30分钟的疗程。\n验光师协会的Ceri Smith-Jaynes告诉BBC：目前我们没有任何可靠的证据表明虚拟现实头盔会导致儿童或成人视力永久性下降。已经有一些研究着眼于只短期使用VR头盔的影响；这些研究并没有显示视力下降。\n然而，有些人确实会出现暂时性的症状，如恶心、干涩、眼睛易怒、头痛或眼睛疲劳。&#34；\n但她确实有一些使用建议：如果你整天都呆在虚拟现实中，没有休息时间，你需要时间重新适应光线和现实世界不同的视觉环境。我建议每小时休息5到10分钟，利用这段时间四处走动，眨眼，看看窗外，或者散散步。\n一个人可以轻松忍受的耳机使用小时数取决于你的双眼视觉状态(问问你的验光师)和你在VR中所做的任务。&#34；\nVR耳机已经被改造，以帮助提高视力。初创公司GiveVision发明了一种名为SightPlus的设备，旨在通过将现实世界的视频投射到视网膜的工作部分来恢复视力，这些人的视力已经恶化到无法修复的地步。\n穆尔菲尔德眼科医院的一项临床试验表明，在60名参与者中，有59人的视力得到了改善，近一半的人表示，他们会在看电视、阅读或去剧院时佩戴这种设备。该公司正在与索尼合作开发其下一款设备。", "note_en": "A software developer has tweeted about how wearing a VR headset for hours a day has damaged his eyesight.\n A visit to the opticians left him &#34;worried about my future VR use&#34; after a doctor blamed the technology for a problem with his vision.\n Glasses should correct the issue but would normally only &#34;be prescribed to 40-year-olds&#34;, he tweeted.\n The Association of Optometrists said it had not seen evidence that VR headsets could cause permanent eye damage.\n Facebook-owned Oculus states in its handbook that one in 4,000 may suffer &#34;dizziness, seizures, eye or muscle twitching.&#34; It recommends users suffering these symptoms discontinue using the headset and see a doctor.\n  Doctors have previously warned that virtual reality, which is the computer-generated simulation of a real or imaginary environment, can cause eye strain because the brain is forced to process visual stimuli in a different way to normal.\n And users have complained about nausea and dizziness when using headsets, which is generally put down the the way a user perceives space around them, leading to motion sickness.\n Danny Bittman, who has worked as a virtual reality developer for four years, suggested it could have affected his eyesight.\n &#34;Just had my first eye doctor visit in three years. Now I&#39;m very worried about my future VR use. I have a new eye convergence problem that acts like dyslexia. The doc, a headset owner, is convinced my VR use caused this. He said &#34;these glasses we usually prescribe to 40-year-olds&#34;, he tweeted.\n  He went on to describe the problem: &#34;My eyes jump when I read things like a screen or books. I&#39;ve always had a small level of this but it&#39;s greatly intensified now. It&#39;s also linked to headaches and vertigo.&#34;\n He said that the issue was about &#34;prolonged use&#34;, and admitted that he could spend up to six hours a day wearing a headset, split into 30-minute sessions.\n Ceri Smith-Jaynes, from the Association of Optometrists, told the BBC: &#34;We currently do not have any reliable evidence that VR headsets cause permanent deterioration in eyesight in children or adults. There have been some studies looking into the effects of short-term use of VR headsets only; these did not reveal a deterioration in eyesight.\n &#34;However, some people do suffer from temporary symptoms such as nausea, dry, irritable eyes, headache or eyestrain. &#34;\n But she did have some advice about usage: &#34;If you spend all day in VR without a break, you&#39;ll need time to readjust to the light and the different visual environment of the real world. I would suggest taking a five-to-ten minute break each hour, using that time to move about, blink and look out of a window, or take a short walk.\n &#34;The number of hours of headset use a person can comfortably tolerate will vary depending on your binocular vision status (ask your optometrist) and the task you are doing in VR.&#34;\n VR headsets have been adapted to help improve eyesight. Start-up GiveVision created a device called SightPlus, that aims to restore vision to people whose eyesight has deteriorated beyond repair by projecting a video of the real world into the working part of the retina.\n A clinical trial at Moorfields Eye Hospital suggested it improved eyesight in 59 of the 60 participants, with nearly half saying they would wear the device for watching TV, reading or going to the theatre. The firm is partnering with Sony to develop its next device.", "posttime": "2020-06-11 10:17:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,警告,warns,问题", "title": "开发人员警告VR耳机损害视力", "title_en": "Developer Warns VR Headset Damaged Eyesight", "transed": 1, "url": "https://www.bbc.com/news/technology-52992675", "via": "", "real_tags": ["开发", "警告", "warns", "问题"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006087, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着时间的推移，玩游戏中使用的骰子在形状和大小上都发生了变化，并随着对公平、机会和概率的考虑而演变。\n无论是在赌场玩掷骰子，还是在家里和家人玩简单的棋盘游戏，掷骰子都会给每一场游戏带来一点机会或运气。我们希望骰子是公平的，每个数字掷出的概率都是相等的。\n但一项新的研究表明，情况并不总是如此。在罗马时代，许多骰子明显是倾斜的，不像今天的完美立方体。在中世纪早期，骰子在数字排列上通常是不平衡的，1与2相对，3与4相对，5与6相对。无论这些物体是由什么材料制成的(金属、粘土、骨头、鹿角和象牙)，也不管它们的大小或形状是否完全对称或一致，因为就像天气一样，滚动是由神或其他超自然因素预先决定的。\n加州大学戴维斯分校(University of California，Davis)人类学教授、最近一项关于骰子的研究的主要作者杰尔默·埃肯斯(Jelmer Eerkens)解释说，这一切在1450年左右开始改变，当时骰子制造者和玩家似乎意识到了这种形式会影响功能。\n一种新的世界观正在兴起--文艺复兴。伽利略和布莱斯·帕斯卡(Blaise Pascal)等人正在形成关于机会和概率的概念，我们从书面记录中知道，在某些情况下，他们实际上是在咨询赌徒，他说。我们认为骰子的使用者在游戏中也接受了关于公平、机会或概率的新想法。\nEerkens说，标准化骰子的属性，如对称性和数字的排列，可能是降低无良玩家操纵骰子改变特定掷骰子赔率的可能性的一种方法。\n骰子在考古遗址中并不常见。Eerkens说，它们通常在垃圾、居民区或墓地中发现，经常作为遗址中的孤零零的物品被发现。许多都没有准确的日期。\n在查看了荷兰各地数十个博物馆和考古仓库的数百个骰子后，埃肯斯和他的合著者、纽约美国自然历史博物馆的亚历克斯·德沃格特(Alex De Voogt)能够组装和分析一套110个仔细标注日期的立方体形状的骰子。他们的发现发表在12月的“考古学报”杂志上。\n--400年前或罗马时代制造的骰子，在形状、大小、材料和数字配置上都有很大的变化。--当骰子在1100年左右再次出现时，它们主要是质数配置，其中相反的数字与质数(1-2；3-4；5-6)相一致，这种编号方式在古代美索不达米亚和埃及也很流行。中世纪早期的骰子与他们的罗马前身相比也往往很小。\n--1450年左右，编号系统很快变成了7，对边加起来就是7(6-1；5-2；3-4)。骰子的形状也变得高度标准化，而且又变得更大了。标准化在一定程度上可能是大规模生产的副产品。\n埃肯斯说，他研究骰子是因为它们是一种方便的物品，可以将功能与风格分开，而不是考古遗址中发现的其他文物，比如用于狩猎的功能物品箭头。作为考古学家，我们研究的许多文物将这两者混为一谈。。我们知道，对于骰子来说，它们纯粹是有风格的。\nEerkens说，这项研究还表明，骰子和许多实物一样，反映了人们不断变化的世界观。\n研究人员在他们的文章中总结道，赌徒可能认为掷骰子不再是命运决定的，而是随机决定的。\n资料由加州大学戴维斯分校提供。原著：Karen Nikos-Rose。注意：内容可以根据样式和长度进行编辑。\n杰尔默·W·埃肯斯，亚历克斯·德·沃格特。三方骰子的演变。考古学报，2017年；88(1)：163doi：10.1111/j.1600-0390.2017.12182.x。\n下面是您可能感兴趣的相关文章。科学日报与TrendMD网络中的学术出版物共享链接，并根据需要从第三方广告商那里赚取收入。", "note_en": "Over time, dice used in playing games have changed in shape and size and evolved with considerations about fairness, chance and probability.\n Whether at a casino playing craps or engaging with family in a simple board game at home, rolling the dice introduces a bit of chance or &#34;luck&#34; into every game. We expect dice to be fair, where every number has equal probability of being rolled.\n    But a new study shows this was not always the case. In Roman times, many dice were visibly lopsided, unlike today&#39;s perfect cubes. And in early medieval times, dice were often &#34;unbalanced&#34; in the arrangement of numbers, where 1 appears opposite 2, 3 opposite 4, and 5 opposite 6. It did not matter what the objects were made of (metal, clay, bone, antler and ivory), or whether they were precisely symmetrical or consistent in size or shape, because, like the weather, rolls were predetermined by gods or other supernatural elements.\n  All that began to change around 1450, when dice makers and players seemingly figured out that form affected function, explained Jelmer Eerkens, University of California, Davis, professor of anthropology and the lead author of a recent study on dice.\n &#34;A new worldview was emerging -- the Renaissance. People like Galileo and Blaise Pascal were developing ideas about chance and probability, and we know from written records in some cases they were actually consulting with gamblers,&#34; he said. &#34;We think users of dice also adopted new ideas about fairness, and chance or probability in games.&#34;\n  &#34;Standardizing the attributes of a die, like symmetry and the arrangement of numbers, may have been one method to decrease the likelihood that an unscrupulous player had manipulated the dice to change the odds of a particular roll,&#34; Eerkens said.\n     Dice are not common finds in archaeological sites. They are typically found in garbage, domestic areas, or cemeteries, and frequently are recovered as lone objects in a site, Eerkens said. Many are not accurately dated.\n After looking at hundreds of dice in dozens of museums and archaeological depots across the Netherlands, Eerkens and his co-author, Alex de Voogt, of the American Museum of Natural History, New York, were able to assemble and analyze a set of 110 carefully dated, cube-shaped dice. Their findings were published in the journal  Acta Archaeologica in December.\n  -- Dice made before 400, or in Roman times, are highly variable in shape, size, material and configuration of numbers.    -- When dice reappear around 1100 they are predominantly in the &#34;primes&#34; configuration, where opposite numbers tally to prime numbers (1-2; 3-4; 5-6), a numbering style that was also popular in ancient Mesopotamia and Egypt. Early medieval dice also tend to be quite small relative to their Roman predecessors.\n     -- Around 1450 the numbering system quickly changed to &#34;sevens&#34; where opposite sides add up to seven (6-1; 5-2; 3-4). Dice also became highly standardized in shape, and also were made larger again. Standardization may be, in part, a byproduct of mass production.\n Eerkens said he studied dice because they are a convenient item in which to isolate the function from the style, as opposed to other artifacts found in archaeological sites, such as arrowheads, a functional item used for hunting. &#34;A lot of artifacts we study as archaeologists conflate the two... . We know for dice they are purely stylistic.&#34;\n The study also shows that dice, like many material objects, reflect a lot about people&#39;s changing worldviews, Eerkens said.\n  The researchers conclude in their article, &#34;Gamblers may have seen dice throws as no longer determined by fate, but instead as randomizing objects governed by chance.&#34;\n    Materials provided by   University of California - Davis. Original written by Karen Nikos-Rose.  Note: Content may be edited for style and length.\n    Jelmer W. Eerkens, Alex de Voogt.  THE EVOLUTION OF CUBIC DICE.  Acta Archaeologica, 2017; 88 (1): 163 DOI:  10.1111/j.1600-0390.2017.12182.x\n  Below are relevant articles that may interest you. ScienceDaily shares links with scholarly publications in the  TrendMD network and earns revenue from third-party advertisers, where indicated.", "posttime": "2020-06-11 10:16:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发生变化,dice,骰子", "title": "骰子如何在两千年的时间里发生变化，变得更加公平(2018年)", "title_en": "How dice changed over 2k years to be more fair (2018)", "transed": 1, "url": "https://www.sciencedaily.com/releases/2018/01/180130140246.htm", "via": "", "real_tags": ["发生变化", "dice", "骰子"]}, {"category": "", "categoryclass": "", "imagename": "232994280b26429c840ea2e0e88a1b29.jpeg", "infoid": 1006086, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一篇关于一个发展中事件的帖子。我将不再遵循我早先的发帖模式。在这些困难的时刻，我会写下我得到的东西。如果你喜欢我以前写的任何一篇文章，并想帮助这个项目继续下去，请订阅下面的内容或成为patreon.com/ForwardBlog的赞助人。\n国会山自治区(CHAZ)很可能是西雅图当地社会主义者和无政府主义者的一个短暂的公共项目。但这是一堂有趣的课，讲述了如何建立社区社会，以及它们可以为一大群人带来什么好处。在对西雅图警察局进行了一周的强硬抗议后，当地无政府主义者开始在西雅图国会山地区及其周围设置路障，一旦该部门从他们的东区撤退。查兹是在西雅图警局放弃该辖区后才成立的。国会山是一个豪华的LGBTQ社区，很多年轻的城市专业人士已经在那里生活过。6月8日，他们正式宣布六个街区的半径在他们的完全控制之下，并给它起了一个新的名字，国会山自治区(CHAZ)，也就是“自由国会山”。无政府主义者用“自由国会山”这个绰号来向北爱尔兰城市德里的博格赛德社区竖立的“自由德里”招牌致敬，德里在动乱期间成为一座四面楚歌的城市。当你考虑到在短短两周内，三个不同的警区要么被废弃，要么被烧毁(明尼阿波利斯2个，西雅图1个)，这些发展是令人惊讶的。我们在美国以前从未见过这种情况，它确实表明，通过数字和坚定的决心可以实现什么。现在，很明显，我们的目标不是接管警察局，而是取消对各部门的资助，并试图从头开始重建警察。有些人可能会遵循“改革”的路线，但这个国家的无政府主义者和社会主义者知道的远不止这些。CHAZ是当地的一项实验，但值得借鉴，在一个不人道的时代，它是一股新鲜的空气。\n6月7日，西雅图市长珍妮·杜尔坎(Jenny Durkan)宣布，今后不能再使用催泪瓦斯，只能使用缓和局势的技术。那天晚上和6月8日晚上，她的部门决定无论如何都要使用催泪瓦斯，因为像这个国家的大多数市长一样，他们无法控制他们野蛮和不负责任的警察部门。6月8日深夜，催泪瓦斯充斥国会山地区整条街道的视频浮出水面。这段视频在网上疯传，但没有走红的是西雅图警察局在深夜进行的战术撤退，以及随后当地无政府主义者和社会主义者在该地区获得的完全控制权。到6月9日早上，六个街区的半径已经完全在他们的控制之下。人们设置了路障，竖起了标语，艺术家们进来在社区打上了他们的印记。至于内部治理，当然没有。这是一个非中央集权治理的实验，作为一个事实上的无政府主义地区运作。它可能与丹麦哥本哈根克里斯汀斯哈文区的弗里敦克里斯蒂安尼亚最为相似，弗里敦克里斯蒂安尼亚是一个有意设立的公社。\n废弃的警察局旁边搭起了帐篷，当地医务人员、艺术家、公务员和餐馆老板纷纷涌入该地区，以提供他们的服务。据估计，目前约有200名居民占领了查兹，他们来自西雅图全市。6月9日，他们成立了“无警察合作社”，免费发放水、洗手液、零食、口罩和烤肉串。一个十字路口被封锁，以提供“讲解”，基本上就是关于如何经营合作社和如何建立有效的公社的讲演。其他演讲者教育人们警察的暴行和向前推进的抗议策略。一个带有大投影仪的大屏幕户外电影院被设置起来，西雅图交通部捐赠了移动厕所。此外，正在制作自制的防暴盾牌，并分发给公社的每个人。展望未来，当地的分区居民也希望建立一场能够蔓延到西北地区的有凝聚力的劳工运动。像CODEPINK这样的全国性组织支持公社声明“警察才是真正的煽动者”。查兹的当地积极分子决定用一把粉色的雨伞作为他们的象征，以表示与香港人的团结，这些人的技术被世界各地的抗议者效仿。正如前面提到的，街头医务人员已经淹没了该地区，并发挥了重要作用。他们中的许多人都受过大学教育，有在抗议期间在现场工作的经验。他们还建造了医疗帐篷，以应对未来肯定会与警方发生的冲突。\n6月9日，查兹代表发布了一份由该地区许多集体声音提出的要求清单。其中大多数都是非常现实的，如果西雅图真的有代表的话，就可以实现。", "note_en": "This is a post about a developing event. I will no longer be following my earlier model of posting. I will write what comes to me during these difficult times. If you like any of my past writings and want to help keep this project going, please subscribe below or become a patron at  patreon.com/ForwardBlog\n   The Capitol Hill Autonomous Zone (CHAZ) will most likely be a short lived communal project of local socialists and anarchists in Seattle. But it’s fascinating lesson in how to build communal societies and what benefits they can provide to a large group of people. After a week of tough protesting against the Seattle PD, local anarchists began to create roadblocks in and around the Capitol Hill area of Seattle once the department retreated from their East Precinct. CHAZ was established only after the Seattle PD abandoned that precinct. Capitol Hill is a posh, LGBTQ community where a lot of younger urban professionals already lived. On June 8th, they officially declared a six block radius under their complete control and gave it a new name, The Capitol Hill Autonomous Zone (CHAZ), aka “Free Capitol Hill.” Anarchists used the moniker “Free Capitol Hill” in homage to the “Free Derry” sign erected in the Bogside neighborhood of the Northern Ireland city of Derry, which became an embattled city during the Troubles. These developments are amazing when you consider that in just two weeks, three different police precincts were either abandoned or burned down (2 in Minneapolis, 1 in Seattle). We’ve never seen this before in America and it does signal what can be possible through numbers and sheer determination. Now, obviously the goal is not to take over police stations, but to defund departments and attempt to rebuild policing from the ground up. Some may toe the line of “reform” but anarchists and socialists in this country know that much more than that is needed. CHAZ is a local experiment, but one worth taking lessons from and it’s a breath of fresh air during a time of inhumanity.\n      On June 7, the mayor of Seattle, Jenny Durkan announced that no more tear gas can be used and only de-escalation techniques going forward. That night and the night of June 8th, her department decided to use tear gas anyway because like most mayors in the country, they have no control of their brutish and unaccountable police departments. Video surfaced late on the night of June 8th of tear gas filling an entire street in the Capitol Hill district. This video went viral, but what didn’t go viral was the Seattle PD’s tactical retreat that happened later in the night and the subsequent complete control that was gained in the district by local anarchists and socialists. By the morning of June 9th, that six block radius was in their complete control. Roadblocks were erected, signs were put up and artists came in to put their stamp on the community. As far as internal governance goes, there is none of course. It’s an experiment in de-centralized governance operating as a  de facto anarchist region. It’s probably most similar to Freetown Christiania which is an intentional commune in the borough of Christianshavn in the city of Copenhagen, Denmark.\n      Tents have been pitched next to the abandoned police station and local medics, artists, civil servants and restauranteurs have flooded the zone in order to provide their services. It’s estimated that about 200 residents are currently occupying CHAZ and have come from all over the city of Seattle. On June 9th, they established the “No Cop Co-op”, which hands out free water, hand sanitizer, snacks, masks and kebabs. An intersection was cordoned off to provide “teach-ins” which are basically soapbox lectures on how to run a co-op and how to build effective communes. Other speakers educate people on police brutality and protesting tactics moving forward. A large screen outdoor cinema was set up with a large projector and portable toilets were donated from the Seattle Transportation Department. Additionally, homemade riot shields are being made and distributed to everyone in the commune. Going forward, local zoners also hope to build a cohesive labor movement that can spread across the Northwest. National  organizations like CODEPINK support the commune stating “police are the real instigators.” Local activists in CHAZ have decided to use a pink umbrella as their symbol to show solidarity with those in Hong Kong whose techniques have been copied by protestors all over the world. As mentioned earlier, street medics have flooded the zone and play a major role. Many of them are college educated and have experience being in the field during protests. They also have created medic tents in order to deal with the future conflicts that they will surely have with the police.\n      On June 9th, CHAZ representatives  released a list of demands that were authored by many of the collective voices in the zone. Most of them are extremely realistic and can be accomplished if Seattle actually had a representative government instead of one that works for Amazon. The list of demands falls under four categories: economics, education, the justice system and health and human services. The authors stated further that the zone was on land taken from the local Native American Duwamish people over a century ago. The Pacific Northwest has a long history with native tribes and the collective voices of the zone realize that. Additionally, they have requested no violence be used in attempts to remove the zoners and that they be allowed to operate in a communal structure in order to “show the country what is possible through collective voices.” CHAZ has been praised by the IWW’s  Industrial Worker publication as an effective way to distribute badly needed social services. The irony behind the creation of CHAZ is that austerity measures have been put in many American cities since the CARES bailout back in March. This is expected during crises and it’s not acceptable to those not just in CHAZ but protesting within the BLM movement. Austerity has been a prime focus during these protests because while police departments across the country see their budgets increase every year, every other line item of public services continue to be cut. Anarchists in the zone realize they need to do more planning going forward. They have already began deputizing scouts and are working on expanding their perimeter even more. Smoking areas have been designated and local marijuana growers have flooded the zone to provide free marijuana. The anti-capitalist views of the inhabitants will create an atmosphere of brainstorming that will only serve the commune for the better going forward. As an example of this, many have began talking about black-owned banks, divesting from local corporations and prison reform. Local activists even gave a soapbox speech  criticizing the American Legislative Exchange Council (ALEC), and how their representatives in conservative state legislatures write laws without “any clue” as to who they represent. The opportunity is there to create a flourishing commune in a short term project that will ultimately likely be destroyed at some point. The main goal is to provide a glimpse for Americans what can be possible though communal action when you operate outside of the system of government that many Americans take for granted. This is not a country that is used to communal action and most citizens probably don’t even know the definition of a co-op. Kshama Sawant is a Seattle City Council member and member of the Trotskyist Socialist Alternative Party (SA). She visited the zone on June 9th and asked the residents to turn it into a community center for restorative justice. She agreed that there needs to be long term goals and that the method of going beyond policing (police abolition) needs to be analyzed and discoursed in the mainstream. Sawant did suggest caution though on pushing the city too far. She, along with the residents want to avoid future violence if the police do eventually move in to tear down the commune. The development of CHAZ is a real time education in community organizing and anarchist alternatives. Amazon and Boeing weren’t going to provide the people of Seattle with basic life necessities. Those in CHAZ hope they can demonstrate that social services can be provided in a vacuum. They have stated they will continue to build the commune and will continue until they are forced out. Long live the commune!", "posttime": "2020-06-11 10:16:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "来到,hill,西雅图", "title": "欢迎来到国会山自治区(CHAZ)", "title_en": "Welcome to the Capitol Hill Autonomous Zone (CHAZ)", "transed": 1, "url": "https://forwardblog.substack.com/p/welcome-to-the-capitol-hill-autonomous?r=5iwv9&utm_campaign=post&utm_medium=web&utm_source=hackernews", "via": "", "real_tags": ["来到", "hill", "西雅图"]}, {"category": "", "categoryclass": "", "imagename": "c88b9580016859586046269d456b0099.jpg", "infoid": 1006085, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此网页以及其他几个项目(VPN、虚拟化、远程基础设施监控等)。都是从我的家庭实验室托管的，如上图所示。", "note_en": "This web page, along with several other projects (VPNs, virtualization, remote infrastructure monitoring, etc.) are hosted from my home lab, pictured above.", "posttime": "2020-06-11 09:59:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "homelab,vpn", "title": "自托管Homelab网站", "title_en": "Self-Hosted Homelab Website", "transed": 1, "url": "https://hydn.dev/homelab/", "via": "", "real_tags": ["homelab", "vpn"]}, {"category": "", "categoryclass": "", "imagename": "27037f3d6116bb61e74f4c78d02e50b4.png", "infoid": 1006084, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "AWS CodeArtiact是一项完全托管的软件工件存储库服务，使任何规模的组织都可以轻松安全地存储、发布和共享软件开发过程中使用的包。CodeArtiact使您不再需要设置、操作和扩展工件管理所需的基础设施，这样您就可以专注于软件开发。使用CodeArtiact，您只需为您使用的内容付费，而无需支付许可费或前期承诺。\nAWS CodeArtiact可与常用的包管理器和构建工具配合使用，例如Maven和Gradle(Java)、NPM和YAR(JavaScript)、pip和twine(Python)，从而可以轻松地将CodeArtiact集成到您现有的开发工作流中。可以将CodeArtiact配置为自动从公共构件存储库(如NPM public Registry、Maven Central和Python package Index(PyPI))获取软件包，从而确保团队能够可靠地访问最新的软件包。\nIT领导者可以使用AWS CodeArtiact创建集中式存储库，用于共享其开发团队批准使用的软件包。CodeArtiact与AWS Identity and Access Management(IAM)的集成为他们提供了控制谁有权访问包的能力。此外，CodeArtiact对AWS CloudTrail的支持使领导者能够清楚地了解哪些软件包正在使用以及在哪里使用，从而可以轻松识别需要更新或删除的软件包。CodeArtiact还支持使用AWS密钥管理服务进行加密，因此客户可以控制用于加密其包的密钥。\n要了解有关AWS CodeArtiact的更多信息，请查看博客，访问CodeArtiact产品页面或参考CodeArtiact文档。\n您可以在这里查看AWS CodeArtiact可用的AWS区域的完整列表﻿。", "note_en": "AWS CodeArtifact is a fully managed software artifact repository service that makes it easy for organizations of any size to securely store, publish, and share packages used in their software development process. CodeArtifact eliminates the need for you to set up, operate, and scale the infrastructure required for artifact management so you can focus on software development. With CodeArtifact, you only pay for what you use and there are no license fees or upfront commitments.\n  AWS CodeArtifact works with commonly used package managers and build tools such as Maven and Gradle (Java), npm and yarn (JavaScript), pip and twine (Python), making it easy to integrate CodeArtifact into your existing development workflows. CodeArtifact can be configured to automatically fetch software packages from public artifact repositories such as npm public registry, Maven Central, and Python Package Index (PyPI), ensuring teams have reliable access to the most up-to-date packages.\n  IT leaders can use AWS CodeArtifact to create centralized repositories for sharing software packages approved for use across their development teams. CodeArtifact’s integration with AWS Identity and Access Management (IAM) provides them with the ability to control who has access to the packages. Further, CodeArtifact’s support for AWS CloudTrail gives leaders visibility into which packages are in use and where, making it easy to identify packages that need to be updated or removed. CodeArtifact also supports encryption with AWS Key Management Service so customers can control the keys used to encrypt their packages.\n  To learn more about AWS CodeArtifact check out the  blog, visit the CodeArtifact  product page or refer to CodeArtifact  documentation.\n  You can see a full list of AWS Regions where AWS CodeArtifact is available  ﻿here. ﻿", "posttime": "2020-06-11 09:58:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,codeartifact,codeartiact", "title": "AWS CodeArtiject：完全托管的软件工件存储库服务", "title_en": "AWS CodeArtifact: A fully managed software artifact repository service", "transed": 1, "url": "https://aws.amazon.com/about-aws/whats-new/2020/06/introducing-aws-codeartifact-a-fully-managed-software-artifact-repository-service/", "via": "", "real_tags": ["软件"]}, {"category": "", "categoryclass": "", "imagename": "a6ff60e6c88915f32022949e7bd761be.png", "infoid": 1006082, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“好的，我准备好了，”亚历克斯说。我丈夫穿着他的绿色手术服，里面是一件医院发行的夹克，他的名字绣在左上角的心脏上：亚历山大·福滕科(Alexander Fortenko)医生，急诊内科。我的眼睛看到了他鼻梁上慢慢生长的红色压疮。\n他满怀期待地看着我。他在等我背诵我每班前做的咒语。“我爱你，”我说。“注意安全。远离生病的人。“。这是我们的护身符--这是一个不可能的要求，我希望违背所有的理性，能保证他的安全。他已经开始依赖它了，这让我很担心。\n我走进医院，径直走向医生的办公室和储物柜。一旦我打开门，我就给我的手消毒，然后我把护目镜从背包里拿出来。这些是可重复使用的，而且我们只有一对-通常情况下，我每隔几个病人就会清理和重新消毒这些东西，大约在12小时的轮班中大约五六次。然后，我把背包放到储物柜里。我确保我不会碰任何东西，除了我绝对必须要碰的东西。当我还戴着外科口罩时-就是我从家里戴的那个-我走进了急诊室。\n我要做的第一件事是从店员那里拿一个N95口罩，他通常会记录每个人一天中拿到了多少个口罩。在几周前纽约的高峰期，当物资稀缺时，办事员会实时统计谁收到了面具，以及什么时候收到的。我洗手，然后穿上我的N95。我要确保它密封得很紧。它痛苦地扎进我鼻子上的压疮，我的眼睛开始流泪。我练习做几次呼吸--空气紧紧地吸着，就像我在用吸管吸气一样。那很好。只有在呼吸困难的时候才是安全的。我在上面放了一个外科口罩，以保护N95，然后我再次清洁我的护目镜，并戴上它们。这是我最后一次摸我的脸。\n现在我开始用漂白湿巾清洁我的工作站，以避免以前使用过它的人可能造成的污染。它是仪式性的和彻底的-同样的事情，每一次轮班。我首先清洁的是椅子--它的靠背，然后是座椅，然后是任何把手。我走到桌子前--上面和下面也是。然后是我的键盘-在每个字母和行之间。然后我把它翻过来，把后面也擦干净。我走到鼠标旁边，小心地确保我也清洁了电线和轮子。电话就是下一个。我再打扫一遍号码之间的空隙，并特别小心听筒。最后，我会擦拭显示器和周围的墙壁或隔断，因为我在工作时可能会碰触到它们。\n我登录并开始检查我的病人数量。每个病人都被推定为COVID。阑尾炎的病人？科维德。卒中?。也叫COVID。腿疼吗？科维德。我们了解到，每一次遭遇都是潜在的暴露。因此，尽管纽约已经过了高峰期，但我们不能不保持高度警惕。\n在我看我的第一个病人之前，我洗手并戴上一副新手套。然后我把一件黄色的一次性礼服套在我的手术服上，然后戴上第二副手套，确保我把黄色礼服的袖子套进这第二双手套里，这样我的手腕就不会露出。我再次检查我的口罩和护目镜，以确保它们是舒适的，然后我走进房间。\n在接下来的12个小时里，我独自在家陪着我们21个月大的儿子罗南。当罗南在打盹时，我忙于自己的工作。当他醒来时，我们一起玩耍和读书。我断断续续地打扫公寓，心急如焚：我把玩具收起来，知道10分钟后它们会被拉出来再次丢弃。我是他玩具篮里的西西弗斯。然后，我擦拭经常接触到的表面，用吸尘器吸尘，并给亚历克斯淋浴的浴缸漂白。\n下午三点左右，我开始吃晚饭，试着做足够几顿饭吃的东西-我已经精通千层面和炖肉，任何可以重新加热的东西。下午5点，我喝了一天中的第三杯咖啡，然后给罗南放了点音乐。他跳舞的时候我回复工作邮件。我几乎一直在和他打交道，这使得我很难离开现在去任何地方。这是一种祝福，让我不用担心亚历克斯。\n下午6点57分，我们隔壁大楼的邻居拿着萨克斯管走出阳台，弹着“带我出去看球赛”，紧随其后的是“上帝保佑美国”。他是一位年长的绅士，可能80出头，喜欢用亮粉色来配饰-通常是一顶帽子，有时是一件看起来很舒服的羊毛衫。罗南砰的一声敲了敲我们的窗户，大喊“巴沃！”欣喜若狂--他还是发不出R的音。他在阳台上挥手鞠躬表示谢意。\n一旦我和病人在房间里，我试着保持6英尺的距离。视情况而定，我通常是一个人。有时，如果病人病情危重，可能会有护士或其他工作人员，但大多数情况下，我们会尽量减少进入的人数，以保存个人防护用品。我走近病人检查他们-我听他们的肺，我看他们的喉咙后面，我检查他们的腹部是否有压痛，我还看他们的腿。我们为每个人的投诉量身定做我们的例行检查-但如今，这些故事听起来都很相似。标准的历史和考试大约需要5到10分钟。\n当我看完病人后，我脱下我的黄色长袍，然后脱下最上面一层手套。我用最下面的一副手套开门。我关上门(或者拉上窗帘，取决于病人在哪里)，然后脱下剩下的一副手套。然后，我去洗手池洗手。如果病人咳嗽，或者如果我长时间靠得很近，我通常会更换手术面罩并擦去护目镜。然后，就转到下一个病人身上了。\n我明白了，我重复一项行动或例行程序越多，我就越善于成功地执行它，避免我们现在都害怕的污染。\n这是强迫症样的行为，我认为医院里的每个人都在一定程度上从这次大流行中感染上了这种行为。我一点也不偏离它。我知道这是让我安全的原因。\n我想，她这么说是为了搞笑。她知道这是个不可能的要求。但我不确定我的妻子是否意识到了我肩上的重担--我觉得有责任保证安全。我已经两个多月没有拥抱我的家人了--任何能让他们不感染可能会杀死他们的病毒的事情。\n一个病人进来了，DNR/DNI。由救护车送来的。超级变态。血氧水平在40多岁。虚弱，脱水-脱水得护士不能给他们静脉注射。我们必须做IO-骨内-在他们的胫骨上钻一根针，以便给他们补水和用药。这是一个痛苦的过程，但他们不会退缩-不要对疼痛做出反应，因为他们病得很重。\n因为“请勿插管”的命令，我们无能为力。BiPAP机器是一个简单的选择，但考生必须足够清醒，以协调他们的呼吸与设备。这个病人没有足够的精神能力来处理这件事。我们还知道，BiPAP将病毒雾化，通过空气传播新冠肺炎，将整个急诊室置于危险之中。\n正当我和我的团队讨论病人的治疗计划时，他们的搭档来了。他们要求被允许进入病人的房间，因为他们知道接下来会发生什么。他们感觉到了。我们都是这样做的。当配偶告诉我是时候停止争吵了-让病人舒服点。我看了看房间--病人呼吸非常快，很明显处于窘迫状态，所以我们给他们打了一点吗啡来帮助他们缓解呼吸。\n我和我的团队聚在一起，我们决定，只要合伙人了解呆在房间里的风险，他们就应该被允许进入房间。我们给他们穿上睡袍，解释安全程序，然后让他们进来。他们坐在床边等着，我们从窗户看。\n我们眼睁睁地看着病人的血氧浓度直线下降，意识到会发生什么--随时都会发生。他们的伴侣坐在他们旁边，我们看着他们的嘴唇在动--我们听不清任何话，只有温柔而舒缓的喃喃自语。\n警报器在房间和整个急诊室响起，几秒钟内，我们的一名护士走进去把它关掉了。我紧跟着她--重新穿上长袍，宣布死亡时间。\n当他们伤心地哭泣时，我握着他们戴着手套的手。难以想象：当一个人无助地坐在旁边，看着他们所爱的人变得越来越苍白，看着生活慢慢离开他们的身体时，他们一定会感到悲伤。在这种情况下不让他们享受人类的舒适是多么不公平。\n我感觉我对他们的手的握力放松了，我把他们拉了进来拥抱他们。和我在房间里的护士注视着我的心跳，然后静静地坐在另一边和我一起，双臂环抱着悲痛-一个临时的盾牌。\n“让我们为爸爸欢呼吧！”我从我们的一个小罐子和一个木勺里递给罗南一个不锈钢盖子，我们绕着我们的小厨房走来走去，制造了相当大的噪音。\n我想知道，在短暂的恐慌中，当他长大后，他是否会记住这一点，以及如何记住这一点。\n到晚上7：30，罗南已经吃过晚饭，洗过澡了。我们和祖父母一起聊天，读了最后一本书，7点45分，他在床上过夜。\n晚上8点左右，我收到亚历克斯发来的短信：“成交。回家了。“。\n这半个小时的独处是我一天中最难熬的部分。我一直在抵挡的所有恐惧和焦虑终于有机会表明自己了，它们确实做到了。贪婪地，怀着复仇之心-如果今天是亚历克斯感染病毒的日子呢？如果他病得很重怎么办？如果我病得很重怎么办？谁来照顾罗南？\n接下来是一些痛苦而病态的心理解释：我死了可能会更好。亚历克斯比我强壮。他将能够重建。他会给罗南一个更快乐的童年。\n我沉迷于这种世界末日的想法，因为它让我的大脑为最坏的情况做好了准备。如果我们中的一个人真的生病了，那不会完全令人震惊--也不会让我完全虚弱。至少我是这么告诉自己的。我需要考虑这些事情，我不能告诉其他任何人，因为-嗯，谁会愿意和我一起在水下度过那段时间呢？我觉得我几个月来一直在为大热做准备。累死了。\n亚历克斯和我所做的就是谈论冠状病毒。尽管我们都在讨论数字、趋势、患者、死亡人数和疫苗，但我们很少谈论他在医院看到的情况。我们从不谈论真正可怕的事情，担心大声呼吸会引起他们对我们的注意。\n当亚历克斯最终回到家时，他在我们的前门外脱掉了他的手术服，把它们塞进一个塑料袋里，然后紧紧地绑上。他脱下医院的木鞋，把它们放在外面，还有他的背包和外套。\n我们问我们的隔壁邻居，一位可爱的60多岁的妇女，她正在与癌症作斗争，她是否同意这一点。“当然，当然，”她说，当我们解释说我们害怕罗南会无意中碰到它们时，她的眼睛里充满了泪水。这些天他什么事都干。\n一进门，亚历克斯就和我打了个简短的招呼，然后跳进淋浴间，花了整整15分钟为自己减压和消毒。我在洗手间门口静静地等着他，听着。什么都没有-没有丝瓜络擦洗，没有水溅，也没有几乎空的洗发水瓶子里的树莓。他站在浴缸里一动不动，筋疲力尽。我想知道他在想什么。\n我通常不会推。有些日子，我需要的是模糊。他似乎本能地感觉到了这一点。\n但现在有些事情不同了。我厌倦了谈论这件事。我厌倦了勇敢。我厌倦了假装我不想让他辞职。别进去就好。和我们待在一起，注意安全。我已经想了一百万次了，但是，我不能让我自己说出来。我只想抓着他，即使这很自私。\n她能感觉到我在骗她，但她需要我告诉她一切都很好。所以我就这么做了。\n我在淋浴时闭上眼睛，一天的小画框就回来了。有些细节比其他的更生动--有些病人在他们离开后很久还会留在你身边。很难知道你的大脑会抓住什么，什么会给你带来痛苦。\n一个人的眼睛看着他们心脏停止跳动的确切时刻的方式。呼吸困难时发出的时而咯咯作响，时而沙哑的声音。血液在身体后部积聚和停滞的方式，出现了一个纬度鸿沟，几乎一半的血液已经不完美地浸泡在紫色的染料中。变得苍白，这就是所谓的。\n我试着把它们都洗掉。死亡感觉离表面太近了，就好像如果我足够努力地擦洗，我就可以把恐惧--原始的，兽性的--推回去。我告诉自己我需要听到的让它变得令人愉快的话-他们年纪大了，他们过着美好的生活。我忘了病人年轻的时候我说了什么。我想办法让它不那么具有破坏性。\n这就是我被困住的地方：我是别人在插管前最后见到的人之一。他们中的许多人呼吸困难，但他们是清醒的。我看着他们为这个决定而苦苦挣扎：如果我们不插管，你很可能会死。如果我们插管，你的生存机会只会稍高一点。不管怎样，这可能是你最后一次清醒了。你得说再见，以防万一。他们努力应对不确定性。他们是孤身一人。他们的眼睛睁得大大的，热泪盈眶。我该怎么办？他们想知道。你怎么做？\n我希望我能说，我记得他们所有的脸，事后我检查了他们的病历，看看他们发生了什么-他们成功了吗？但是数量太多了。\n洗完澡，没穿盔甲，他看起来很虚弱。只是人类。他吃得够吗？不，我不是这么想的。我想：我喂他吃得够多了吗？因为这不就是我们在这里做的吗-驻扎我们的瞭望塔？有效地分派我们的责任。我在做我该做的吗？我把你照顾得够好了吗？这就是我们要做的。我们互相照顾；我们很敏锐，我们在场，我们在做。误差容限为零。\n“我能做些什么呢？”我妻子想知道。我想拥抱一下，但还是忍住了。", "note_en": "“Okay, I’m ready,” Alex says. My husband is wearing his green scrubs under a hospital-issued jacket with his name embroidered on the upper left side, over his heart: Dr. Alexander Fortenko, Emergency Medicine. My eyes catch on the red pressure ulcer that’s been slowly growing on the bridge of his nose.\n He looks at me expectantly. He’s waiting for me to recite the incantation I do before each shift. “I love you,” I say. “Be safe. Stay away from sick people.” It’s our talisman — an impossible ask that I hope, against all rationality, will keep him safe. It worries me that he’s come to rely on it.\n   I walk into the hospital and head straight for the doctor’s offices and lockers. I sanitize my hands once I’ve opened the door, and then I take my goggles out of my backpack. These are reusable, and we only get one pair — typically, I clean and resanitize these every few patients, about five or six times in a twelve-hour shift. Then, I put my backpack away into my locker. I make sure I don’t touch anything else except what I absolutely must. While I’m still wearing a surgical mask — the same one I’ve worn from home — I walk into the ER.\n The first thing I do is grab an n95 mask from the clerk, who usually keeps track of how many each person has gotten throughout the day. During the peak in New York a few weeks back, when supplies were scarce, the clerk would have a running tally of who’d received a mask, and when. I wash my hands and then I put my n95 on. I need to make sure it’s tightly sealed. It digs painfully into the pressure ulcer on my nose, and my eyes start to water. I practice taking a few breaths — air comes in strained gulps, like I’m sucking it through a straw. That’s good. It’s only safe when it’s difficult to breathe. I put a surgical mask on top, to preserve the n95, and then I clean my goggles again, and put them on. This is the last time I touch my face.\n Now I begin cleaning my work station with bleach wipes, to avoid possible contamination from the person who has previously used it. It’s ritualistic and thorough — the same thing, every shift. The first thing I clean is the chair — the back of it, then the seat, then any handles. I move on to the desk — the top and underneath, too. Then my keyboard — between each letter and row. Then I turn it over and clean the back as well. I move on to the mouse, taking care to make sure I also clean the cord and the wheel. The phone is next. I clean again between the numbers and take special care with the receiver. Finally, I wipe down the monitor and any surrounding walls or partitions that I might touch incidentally while working.\n I log in and start to review my patient load. Every patient is presumed COVID. A patient with appendicitis? COVID. Stroke? Also COVID. Leg pain? COVID. We’ve learned that every encounter is a potential exposure. So, despite New York being past peak, we can’t afford to be anything less than extremely vigilant.\n Before I see my first patient, I wash my hands and put on a fresh pair of gloves. Then I put on a yellow disposable gown over my scrubs, and then a second pair of gloves, making sure that I catch the sleeve of the yellow gown into this second pair, so that my wrists are not exposed. I check my mask and goggles again to make sure they’re snug, and then I go into the room.\n  For the next twelve hours, I am home alone with our 21-month-old son, Ronan. I busy myself with my own work while Ronan is napping. When he wakes up, we play and read. I clean the apartment in fits and starts timed to waves of anxiety: I put the toys away, knowing they’ll be pulled out and abandoned again 10 minutes later. I am the Sisyphus of his toy basket. Then, I wipe down commonly touched surfaces, vacuum, and bleach the bathtub where Alex showers.\n Around mid-afternoon, I begin dinner and try to make enough for a few meals — I’ve become proficient in lasagnas and stews, anything that reheats well. At 5 PM, I have my third coffee of the day and I put on some music for Ronan. I answer work emails while he dances. I’m engaged with him almost constantly, which makes it difficult to be anywhere but in the present. It’s a blessing that keeps me from worrying about Alex.\n At 6:57 PM, our neighbor in the adjacent building exits onto his balcony with his saxophone and plays Take Me Out to the Ball Game , followed by God Bless America . He’s an older gentleman, probably in his early eighties, with a penchant for accessorizing with bright pink — usually a cap, sometimes a cozy-looking cardigan. Ronan bangs on our window and yells “Bavo!” gleefully — he still can’t pronounce his Rs. He’s acknowledged with a wave and a bow from the balcony.\n   Once I’m in the room with a patient, I try to maintain a six foot distance. Depending on the situation, I’m usually alone. Sometimes, if the patient is critically ill, there may be a nurse or other staff, but for the most part we try to minimize how many people go in, to conserve PPE. I approach the patient to examine them — I listen to their lungs, I look at the back of their throat, I examine their abdomen for tenderness, and I also look at their legs. We tailor our routine exam for each individual complaint — but these days, the stories all sound similar. A standard history and exam takes about five to ten minutes.\n When I’m done seeing the patient, I pull off my yellow gown and, with it, my top layer of gloves. I use the bottom set of gloves to open the door. I close the door shut (or pull the curtain, depending on where the patient is) and take off the remaining pair of gloves. Then, I head to the sink to wash my hands. If the patient was coughing or if I spent a lot of time in close proximity, I usually change the procedure mask and wipe down my goggles. Then, it’s on to the next patient.\n  I’ve learned that the more I repeat an action or a routine, the better I become at carrying it out successfully and avoiding what we all fear right now, contamination.\n It’s OCD-like behavior that I think everyone in the hospital has picked up, to a certain degree, from this pandemic. I don’t deviate from it, at all. I know it’s what keeps me safe.\n  She says it to be funny, I think. She knows it’s an impossible ask. But I’m not sure my wife realizes the weight on my shoulders — the responsibility I feel to stay safe. I haven’t hugged my family in over two months — anything to keep them from contracting a virus that could kill them.\n  A patient comes in, DNR/DNI. Brought in by ambulance. Super sick. Blood oxygen level in the 40s. Weak, dehydrated — so dehydrated the nurses can’t get an IV in them. We have to do an IO — intraosseous — drill a needle into their shinbone in order to hydrate and medicate them. It’s a painful procedure but they don’t wince — don’t react to the pain because they’re so sick.\n Because of the Do Not Intubate order, there’s not much we can do. A BiPAP machine is briefly an option, but candidates have to be lucid enough to coordinate their breathing with the device. This patient doesn’t have the mental capacity to handle that. We also know that BiPAPs aerosolize the virus — spreading COVID-19 through the air, putting the whole ER at risk.\n As I’m discussing the patient’s treatment plan with my team, their partner arrives. They ask to be allowed into the patient’s room because they know what’s coming. They sense it. We all do.  The spouse tells me it’s time to stop fighting — to make the patient comfortable. I look into the room — the patient is breathing really fast, clearly in distress, so we give them a little morphine to help ease their breathing.\n I huddle with my team and we decide that as long as the partner understands the risk of being in the room, they should be allowed inside. We gown them up, explain safety procedures, and let them in. They sit by the bed and wait, and we watch from the window.\n We watch the patient’s blood oxygen numbers plummet, aware of what will happen — any second now. Their partner sits by them and we watch their lips move — we can’t make out any words, just a gentle and soothing murmur.\n  The alarm blares in the room and throughout the ER and, within seconds, one of our nurses goes in to turn it off. I am on her heels — re-gowned, to call the time of death.\n I hold the partner’s gloved hand as they cry inconsolably. Unimaginable: the grief one must feel as they sit helplessly by, watching their loved one grow paler — watching life slowly leave their body. How unfair it feels to withhold human comfort from them in these circumstances.\n I feel my grip relax on their hand and I pull them in for a hug. The nurse in the room with me watches for a beat and then joins me quietly on the other side, interlocking her arms around the grieving — a temporary shield.\n  “Let’s cheer for papa!” I hand Ronan a stainless steel lid from one of our smaller pots and a wooden spoon, and we march around our small kitchen, making quite the racket.\n I wonder, in a brief moment of panic, if and how he’ll remember this when he’s older.\n By 7:30 PM, Ronan has had dinner and bathed. We FaceTime with both sets of grandparents, read one last book and at 7:45, he’s in bed for the night.\n At around 8 PM, I get a text from Alex: “Done. Coming home.”\n This half an hour of solitude is the hardest part of my day. All the fears and anxieties I’ve been warding off finally have a chance to declare themselves, and they do. Greedily, with vengeance — What if today is the day Alex contracted the virus? What if he gets very ill? What if I get very ill? Who will take care of Ronan?\n This, followed by some painfully morbid mental accounting: It’s probably better if I die. Alex is stronger than I am. He’ll be able to rebuild. He’ll give Ronan a happier childhood.\n I indulge myself in this doomsday thinking because it’s priming my brain for the worst case scenario. If one of us does get sick, it won’t come as a total shock — it won’t totally debilitate me. At least that’s what I tell myself. I need to think about these things and I can’t tell anyone else about them because — well, who would want to spend that time with me, underwater? I feel as if I’ve been bracing for a hit for months now. I’m exhausted.\n All Alex and I do is talk about coronavirus. And in spite of all our discussions about numbers, trends, patients, death toll, and vaccines, we seldom talk about what he sees at the hospital. And we never talk about the really scary things, afraid that by breathing them aloud we might call their attention to us.\n  When Alex finally gets home, he takes his scrubs off outside our front door and stuffs them into a plastic bag that he ties off tightly. He takes his hospital clogs off and leaves them outside, along with his backpack and coat.\n We asked our next door neighbor, a lovely 60-something-year-old woman who is battling cancer, if this was alright with her. “Of course, of course,” she said, her eyes filling with tears when we explained that we were afraid Ronan would touch them unwittingly. He gets into everything these days.\n Once inside, Alex greets me briefly and jumps into the shower where he spends a good fifteen minutes decompressing and sanitizing himself. I wait for him quietly in the bathroom doorway and listen. Nothing — no loofah scrubbing, no water splashing, and no raspberries from almost-empty shampoo bottles. He’s standing still in the tub, exhausted. I wonder what he’s thinking.\n   I don’t usually push. Some days, vague is what I need. He seems to instinctively sense that.\n But something is different now. I am tired of talking around this thing. I am tired of being brave. I am tired of pretending that I don’t want to ask him to quit. Just don’t go in. Stay here with us, stay safe. I have thought it a million times and yet, I can’t bring myself to give voice to it. I just want to hold on to him, even if it’s selfish.\n   She can sense when I’m lying to her, but she needs me to tell her everything is okay. So I do.\n I close my eyes in the shower and little frames of the day come back. Some details are more vivid than others — some patients stick with you long after they’re gone. It’s hard to know what your brain will latch on to, what will cause you pain down the road.\n The way someone’s eyes look at the exact moment that their heart has stopped beating. The sometimes gurgling, sometimes raspy sound someone makes when they can’t breathe. The way that blood pools and stagnates at the back of the body, a latitudinal divide emerging, almost like half of it has been dipped imperfectly in purple dye.  Lividity, it’s called.\n I try to wash it all away. Death feels too close to the surface, like if I scrub hard enough, I can push back the fear — the rawness, the animalism. I tell myself what I need to hear to make it palatable —  they were older, they lived a good life. I forget what I say when the patient is young. I find something to make it less devastating.\n This is what I get stuck on: I am one of the last people someone sees before they’re intubated. Many of them have difficulty breathing, but they’re awake. I watch them struggle with the decision: If we don’t intubate, you’ll most likely die. If we do intubate, your chance of survival is only slightly better. Either way, this may be the last time you’re ever lucid. You have to say goodbye,  just in case. They grapple with uncertainty. They’re alone. Their eyes widen, fill with tears.  What should I do?They want to know.  What would you do?\n I wish I could say that I remember all of their faces, that I check their charts afterwards to see whatever happened to them — did they make it? But there are too many.\n  Out of the shower, armorless, he seems frail. Just human. Has he been eating enough? No, that’s not what I think. I think: Have I been feeding him enough? Because isn’t that what we’re doing here — manning our lookout towers? Effectively dispatching our responsibilities. Am I doing my part? Am I taking care of you well enough? That’s what we do. We take care of each other; we’re sharp, we’re present, we’re on it. The margin for error is zero.\n     “What can I do?” my wife wants to know. I go in for a hug, but stop myself.", "posttime": "2020-06-11 09:41:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "嫁给,er,病人", "title": "我嫁给了纽约市的一个急诊室医生", "title_en": "I'm Married to an ER Doc in NYC", "transed": 1, "url": "https://superorganizers.substack.com/p/im-married-to-an-emergency-room-doctor", "via": "", "real_tags": ["嫁给", "er", "病人"]}, {"category": "", "categoryclass": "", "imagename": "83634ca5a1f041cc7d0dc7919062721e.jpeg", "infoid": 1006079, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您或您认识的人正面临驱逐，CNBC希望听到您的消息。请向财经记者Alicia Adamczyk发送电子邮件至alicia.adamczyk@nbcuni.com。\n甚至在冠状病毒大流行之前，美国就正在经历住房专家和倡导者认为的驱逐危机。每年有200多万人面临驱逐，远远超过2008年抵押贷款危机最严重时期面临丧失抵押品赎回权的人数。\n专家预计，未来几个月，驱逐危机将变得更加严重。新冠肺炎的经济衰退对租房者的打击尤其严重。他们将在服务业就业岗位中占据不成比例的份额，该行业已因冠状病毒关闭而遭受重创。\n事实上，根据城市研究所(Urban Institute)的数据，在今年3月25日至4月10日期间，在18岁至64岁的租房者中，近一半的人报告说，他们在支付房租或水电费方面遇到了困难，食物不安全，或者负担不起所需的医疗费用。\n在过去的几个月里，数以千计的租户拖欠租金。城市研究所(Urban Institute)报告称，由于所在社区不成比例的失业，有色人种的处境比白人租房者的情况更糟。大约25%的黑人和拉丁裔租房者报告说，5月份没有支付或推迟租金，相比之下，白人租房者的这一比例为14%。\n为了让人们留在家里，联邦政府禁止联邦政府援助的房产在7月25日之前进行驱逐，包括马萨诸塞州、纽约州和密歇根州在内的一些城市和州也实施了自己的临时驱逐暂停令。但根据普林斯顿大学(Princeton University)追踪全国驱逐情况的驱逐实验室(Exiction Lab)的数据，其中许多禁令将于本月开始到期，具体取决于该州。\n此外，每周额外发放的600美元联邦失业救济金将于7月底到期。城市研究所(Urban Institute)住房政策高级研究员所罗门·格林(Solomon Greene)告诉CNBC Make It，这笔额外的钱让许多失业的人能够继续支付房租。再加上暂停驱逐的结束，美国可能会在未来几周经历全国范围内驱逐事件的上升。\n住房权利倡议组织创始人兼执行董事亚伦·卡尔在接受CNBC采访时表示，在全球健康危机期间驱逐居民，会使他们面临更大的感染和传播新冠肺炎的风险，将一场灾难变成一场世界末日。\n卡尔说，街上可能有很多人。尤其是在像纽约市这样已经有无家可归问题的地方，它可能会变成无家可归的噩梦。\n驱逐实验室的作家Alieza Durana告诉CNBC Make It，驱逐也会对个人和家庭产生长期的-在某些情况下，会影响几代人-的经济后果。这可能会毁掉租户多年的信用，让他们更难找到新的住处。它还给那些受影响的人带来了精神和情感上的损失，并对少数族裔社区，特别是有色人种妇女和她们的孩子造成了特别严重的打击。\n杜拉纳说，驱逐给个人、家庭和社区带来的人员伤亡真的是毁灭性的。他指出，被驱逐的租户往往会面临失业和更高的抑郁症发病率等问题。\n格林说，即使我们没有面临大流行，住房不稳定也会带来巨大的健康后果。当你因为没有地方避难而不能在适当的地方避难时，暴露的风险就会放大得多，情况也会变得更糟。(工业和信息化部电子科学技术情报研究所陈皓)。\n如果你面临驱逐，卡尔建议尽快联系你所在地区的非营利性租户组织和你选出的官员。\n专家们表示，尽管如此，这场危机需要政府做出大规模回应。全国低收入住房联盟(National Low Income Housing Coalition)主席兼首席执行官迪奈·延特尔(Dinae Yentel)在给CNBC的一份声明中表示，如果州和地方政府不尽快介入帮助，全国范围内将出现一场驱逐海啸和无家可归者激增，这不仅会摧毁个人和他们的社区，还会摧毁整个经济。\nYentel说，现在住房比以往任何时候都更像是医疗保健。确保所有人的住房稳定既是道德上的当务之急，也是公共卫生的需要。\n自疫情爆发以来，活动人士一直在推动改革和改革政策，比如增加租金补贴和取消租金补贴，尽管各州行动迟缓，联邦政府在支持租户方面也几乎没有采取什么行动。杜拉纳说，政府可以立即采取的一项措施是确保有资格获得联邦租赁援助的租户真正获得资金。目前，只有四分之一的合格收件人收到了它。\n格林说，增加对租户的资源，比如为面临驱逐的租户提供倡导者和法律支持，也将有助于在未来几年和几十年里让人们留在家里。他还主张采取有针对性的救济措施，比如拨出大约1000亿美元来支付危机期间低收入租户的租金，以及为房东提供抵押贷款减免。\n格林说，目前还没有好的数据集来估计有多少人可能因为新冠肺炎而面临驱逐。但杜拉纳说，自从一些暂停令被取消后，驱逐实验室已经注意到驱逐申请的增加。与持续数年的抵押贷款危机不同，所有面临驱逐的租户可能会在暂停令解除后的短短几个月内发现自己没有房子。\n格林希望，当前的危机将刺激房地产行业的结构性改革，包括加强对全国租户的保护，就像2008年止赎危机后经历的房主那样。他说，我们早就应该在租房者领域进行这样的改革，特别是针对低收入租户的改革。\n至少，住房专家和倡导者希望联邦政府能在全国范围内实施统一的暂缓驱逐令，而不是目前实施的临时禁令。在这场已夺走超过11.3万美国人生命的大流行中，让人们呆在家里应该是当务之急。\n5月份众议院通过的“英雄法案”(Heros Act)包括将全国范围内暂停驱逐申请、听证和执行的期限延长12个月。堪萨斯城租户权利组织KC租户的负责人塔拉·拉格胡维尔(Tara Raghuveer)告诉CNBC，这是防止租房者失去家园的一个很好的开始。该法案于5月在众议院获得通过，但到目前为止一直在参议院陷入停滞状态，该法案包括在全国范围内暂停驱逐申请、听证和处决12个月。KC租户是一家位于堪萨斯城的租户权利组织。\n我确实认为在这一点上任何一次驱逐都是不人道的。Raghuveer说，如果人们被迫离开家园，这将带来潜在的人力成本，生命成本。我认为甚至一次驱逐都不应该发生。", "note_en": "If you or someone you know is facing eviction, CNBC Make It would like to hear from you. Please email money reporter Alicia Adamczyk at alicia.adamczyk@nbcuni.com.\n Even before the coronavirus pandemic, the U.S. was experiencing what housing experts and advocates deemed an eviction crisis.  More than 2 million people face eviction each year, far more than the number of people who faced foreclosure at the height of the 2008 mortgage crisis.\n  Experts expect the eviction crisis to get far worse in the coming months. The Covid-19 economic recession has hit renters especially hard. They  make up a disproportionate share of service sector jobs, an industry that has been decimated as a result of the coronavirus shutdowns.\n In fact, between March 25 and April 10 of this year,  nearly half of renters aged 18 to 64 reported that they were having trouble paying their rent or utilities, were  food insecure or couldn&#39;t afford needed medical care, according to the Urban Institute.\n Thousands of tenants have been missing rent payments over the past few months. People of color have fared worse than white renters due to the  disproportionate job loss in their communities, the Urban Institute reports. About 25% of black and Latino renters  reported not paying or deferring rent in May, compared to 14% of white renters.\n To keep people in their homes, the federal government banned evictions in federally assisted properties through July 25, and some cities and states,  including Massachusetts, New York and Michigan, put their own  temporary eviction moratoriums in place. But  many of those bans begin expiring this month depending on the state, according to Princeton University&#39;s Eviction Lab, which tracks evictions across the country.\n Plus, the  extra $600 per week in federal unemployment benefits is  set to expire at the end of July. That extra money is &#34;what has been allowing many people who have lost their jobs to continue paying rent,&#34; Solomon Greene, a senior fellow in housing policy at the Urban Institute, tells  CNBC Make It. Coupled with the end of eviction moratoriums, the U.S. is likely to experience an uptick in evictions nationwide in the coming weeks.\n  Evicting people in the middle of a global health crisis puts them at greater risk of contracting and spreading Covid-19, turning &#34;a catastrophe into an apocalypse,&#34; Aaron Carr, founder and executive director of the Housing Rights Initiative, tells CNBC Make It.\n &#34;A lot of people could be on the streets,&#34; says Carr. &#34;Especially in places like New York City that already have a homeless problem, it could turn into a homeless nightmare.&#34;\n Eviction also has long-term — in some cases, multi-generational — financial consequences for individuals and families, Alieza Durana, a writer with the Eviction Lab, tells CNBC Make It. It can ruin a tenant&#39;s credit for many years, making it harder for them to find a new place to live. It also takes a  mental and emotional toll on those affected, and hits minority communities,  particularly women of color and  their children, especially hard.\n  &#34;The human toll that an eviction takes on a person and family and community is really devastating,&#34; says Durana, noting that tenants who are evicted often experience  job loss and higher rates of depression, among other issues.\n  &#34;Housing instability has huge health consequences even when we&#39;re not facing a pandemic,&#34; says Greene. &#34;Exposure risk is so much more amplified and worsened when you can&#39;t shelter in place because you don&#39;t have a place to shelter.&#34;\n  If you are facing an eviction, Carr suggests contacting a  nonprofit tenant organization in your area and your elected officials as soon as you can.\n That said, the crisis requires a large-scale government response, according to experts. If state and local governments don&#39;t step in to help soon,  there will be a &#34;tsunami of evictions and a spike in homelessness&#34; nationwide, that will &#34;devastate&#34; not just individuals and their communities, but the economy broadly, Dinae Yentel, president and CEO of the National Low Income Housing Coalition, says in a statement to CNBC Make It.\n &#34;Now more than ever, housing is health care,&#34; says Yentel. &#34;Ensuring housing stability for all is both a moral imperative and a public health necessity.&#34;\n  Activists have been pushing for reforms and policies like increased rental assistance and rent cancellation since the start of the pandemic, though states have been slow to move and the federal government has done little to support tenants. One measure the government could take immediately, says Durana, is to ensure that renters who qualify for federal rental assistance actually get the funds. Currently,  only one in four eligible recipients receive it.\n Increased resources for tenants, like providing advocates and legal support to tenants facing eviction, would also help keep people in their homes in the years and decades to come, says Greene. He also advocates for targeted relief measures, like allocating roughly $100 billion to cover rent for low income tenants through the crisis, and mortgage relief for landlords.\n There&#39;s no good data set currently available to estimate how many people may face eviction because of Covid-19, says Greene. But the Eviction Lab has already noticed an increase in eviction filings since some moratoriums have been lifted, says Durana. And unlike with the mortgage crisis, that lasted years, all of the tenants facing eviction could find themselves without a home in just a couple of months after the moratoriums lift.\n Greene hopes the current crisis will spur structural changes in the housing sector, including stronger protections for tenants nationwide, like homeowners experienced after the 2008 foreclosure crisis. &#34;We&#39;re overdue to have that kind of reform in the renters space, particularly for low income renters,&#34; he says.\n At the very least, housing experts and advocates hope the federal government will put in place a uniform, nationwide eviction moratorium instead of the ad hoc bans currently in place. In the middle of a pandemic that has claimed the lives of over 113,000 Americans, keeping people in their homes should be a priority.\n And the  HEROES Act, which was passed by the House in May but has so far stalled in the Senate, includes an extension of the nationwide moratorium on eviction filings, hearings and executions for 12 months, which Tara Raghuveer, director of KC Tenants, a tenants rights group in Kansas City, tells CNBC Make It is a &#34;great start&#34; to prevent renters from losing their homes.\n &#34;I do think any one eviction at this point is inhumane. It comes at potential human cost, the cost of life, if people are forced out of their homes,&#34; says Raghuveer. &#34;I don&#39;t think even one eviction should be happening.&#34;", "posttime": "2020-06-11 09:22:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,保护措施,apocalypse", "title": "随着冠状病毒保护措施在全国范围内到期，住房“启示录”即将到来", "title_en": "Housing ‘apocalypse' coming as coronavirus protections expire across the country", "transed": 1, "url": "https://www.cnbc.com/2020/06/10/how-to-prevent-the-coming-coronavirus-tsunami-of-evictions.html", "via": "", "real_tags": ["病毒", "冠状病毒", "保护措施"]}, {"category": "", "categoryclass": "", "imagename": "4c9061717d91ce9b027ff1b9ae6e7622.jpg", "infoid": 1006077, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特斯拉(Tesla)已超过丰田，成为世界上市值最高的汽车制造商，其股价已升至每股1,000美元的新高。\n随着股价的上涨，这家总部位于加州的汽车制造商在过去几年里一直在迅速攀登最有价值汽车制造商的行列。\n很难直接将特斯拉与其他汽车制造商进行比较，因为该公司不仅仅是一家汽车制造商，因为它不断增长的能源部门以及对汽车业务的科技式的做法。\n但其目前的大部分收入来自于销售汽车，这使得该公司从市值的角度来看，大多是一家“汽车制造商”。\n2018年，特斯拉的股价飙升，使其价值超过了几家主要汽车制造商，但对于这家电动汽车制造商来说，在经历了艰难的一年后，这一涨势是短暂的。\n现在，特斯拉的股票自去年年底以来又开始了一轮上涨，今天，该股再创新高，超过每股1,000美元。\n它将特斯拉的市值提高到了1800亿美元以上-超过丰田，成为全球最有价值的汽车制造商(通过u/brand dude87评选的市值最高的25家汽车制造商)：\n公平地说，特斯拉不仅通过自己的表现实现了这一目标，而且几乎所有其他汽车制造商的估值都有所下降。\n这家日本汽车制造商在全球大流行期间损失了高达20%的价值，但它仍然挽回了大部分损失。\n2010年，丰田向特斯拉投资了5000万美元，他们促成了Nummi工厂的大幅折扣出售，Nummi工厂现在是特斯拉的弗里蒙特工厂。\n早在2017年，这家汽车制造商就出售了所持特斯拉股份，获得了丰厚的利润，但这仍然只是今天价值的一小部分。\n我做多TSLA，我很高兴看到市场认识到它是一家成功的成长型公司，但我认为它有点失控-就像股市的其他部分一样。\n目前有数百万人失业，特斯拉在除亚洲以外的几乎所有市场都显示出需求疲软的明显迹象。\n我仍然对特斯拉的长期前景充满信心，但本季度将是一个艰难的季度，然而，特斯拉的股价正在创下新高。这很奇怪。\n显然，我不是唯一这样想的人，因为就在一个月前，埃隆说该股太高，当时股价为每股760美元。\n您正在阅读的是electrek，专家们日复一日地发布关于特斯拉、电动汽车和绿色能源的新闻。一定要查看我们的主页，了解所有最新新闻，并在Twitter、Facebook和LinkedIn上关注electrek，随时了解最新消息。不知道从哪里开始？请查看我们的YouTube频道以了解最新的评论。", "note_en": "Tesla (TSLA) has become the world’s most valuable automaker – surpassing Toyota – as its stock pushes to a new high at $1,000 a share.\n As its stock price rose, the California-based automaker has been rapidly climbing the ranks of the most valuable automakers in the last few years.\n It’s hard to directly compare Tesla to other automakers because the company is more than an automaker due to its growing energy division and its tech-like approach to the automotive business.\n But most of its revenue currently comes from selling cars, which mostly makes the company an “automaker” on a market capitalization standpoint.\n In 2018,  Tesla had a surge in stock price that made it more valuable than several major automakers, but it was short-lived after a difficult year on the stock market for the electric automaker.\n Now Tesla’s stock (TSLA) has been on another run since late last year and today, the stock hit another high of over $1,000 per share.\n It raised Tesla’s market valuation to over $180 billion – surpassing Toyota to become wold’s most valuable automaker (via  Top 25 Automakers by Market Cap by u/brandude87):\n  To be fair, Tesla didn’t just achieve that through its own performance but also declines in valuation from virtually all other automakers.\n  The Japanese automaker lost as much as 20% of its value during the global pandemic, but it has still recovered most of that loss.\n  In 2010, Toyota invested $50 million in Tesla and they brokered a heavily discounted sale of the Nummi factory, which is now Tesla’s Fremont factory.\n The automaker  sold its stake in Tesla for a good profit back in 2017, but it was still only a fraction of what it would be worth today.\n  I am long TSLA and I am glad to see the market recognize that it is a successful growing company, but I think it’s getting a bit out of control – like the rest of the stock market.\n There are millions of people without jobs and Tesla is showing clear signs of weak demand in virtually every market except in Asia.\n I am still confident about Tesla’s longterm prospect, but this quarter is going to be a rough one and yet, Tesla’s stock is hitting new highs. It’s weird.\n Apparently, I am not the only thinking that since it was just a month ago when Elon said the stock was too high and it was trading at $760 a share back then.\n  You’re reading Electrek— experts who break news about  Tesla,  electric vehicles, and  green energy, day after day. Be sure to check out our  homepage for all the latest news, and follow Electrek on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  YouTube channel for the latest reviews.", "posttime": "2020-06-11 08:49:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,位数,joins,制造商", "title": "特斯拉加入4位数俱乐部，股价突破1000美元", "title_en": "Tesla Joins 4-Digit Club, Share Price Cracks $1,000", "transed": 1, "url": "https://electrek.co/2020/06/10/tesla-tsla-becomes-wolds-most-valuable-automaker-hits-1000-per-share/", "via": "", "real_tags": ["特斯拉", "位数", "joins", "制造商"]}, {"category": "", "categoryclass": "", "imagename": "64884cdb8bad5ad833e9cd8a589b9981.png", "infoid": 1006076, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "MODEL正在招聘亲力亲为的首席工程师，他们将负责使用Node&amp；Reaction在我们的旗舰电子商务SaaS平台上运营软件开发团队和发货功能。\n做一个努力工作的人，管理一支每天都能做出高质量公关的团队。", "note_en": "Modal is hiring hands-on lead engineers who will be responsible for running software development squads and shipping feature on our flagship e-commerce SaaS platform using Node &amp; React.\n Be a hard worker, run a team that cranks out high-quality PR’s daily.", "posttime": "2020-06-11 08:31:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hiring,团队", "title": "莫德蒙德正在聘请一名首席工程师", "title_en": "Modal is hiring a Lead Engineer", "transed": 1, "url": "https://jobs.lever.co/modal/d6c3c81d-1526-4f08-9a4e-4767dde0df17", "via": "", "real_tags": ["hiring", "团队"]}, {"category": "", "categoryclass": "", "imagename": "9358a3f7e8257b4cd6fbd12ee6fb17a1.jpeg", "infoid": 1006075, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-亚马逊公司(AMZN.O)周三表示，它将实施为期一年的暂停警方使用其面部识别软件的禁令，扭转了其长期以来支持将该技术出售给执法部门的做法。\n公民自由活动人士表示担心，在反对警察暴行、种族不公正和乔治·弗洛伊德(George Floyd)之死的示威活动中，面部识别可能会导致不公正的逮捕。\n批评人士还质疑该软件的准确性，指出过去的一项研究显示，亚马逊的“识别”服务很难识别肤色较深的人的性别。亚马逊对这项研究提出了异议。\n该公司通过其亚马逊网络服务部门销售云计算技术，该公司在一份声明中表示，它已经推动制定法规，以确保该软件的使用合乎道德。\n亚马逊表示：“我们希望这项为期一年的禁令能让国会有足够的时间来实施适当的规定，如果有要求，我们随时准备提供帮助。”\n几个月来，国会一直在权衡可能出台的面部识别法规。周一，科技巨头IBM(IBM.N)写信给会员表示，它不再全面提供这款软件。\n媒体报道指出，亚马逊的“Rekognition”并不是一部商业大片。它已经将这项服务出售给俄勒冈州和佛罗里达州的执法部门，据报道，它还向美国移民和海关执法局推销这项服务。众所周知，法国的Idemia和日本的NEC等公司在面部识别业务上的时间要长得多，它们拥有的合同要多得多。\n然而，由于亚马逊在科技行业的突出地位以及对面部识别的辩护，近年来它受到了首当其冲的批评，这赋予了它的声明象征意义。\n该公司表示，将继续允许客户Thorn和Marinus Analytics使用其技术来帮助执法部门寻找人口贩运受害者。", "note_en": "(Reuters) - Amazon.com Inc (  AMZN.O) on Wednesday said it was implementing a one-year moratorium on police use of its facial recognition software, reversing its long-time support of selling the technology to law enforcement.\n Civil liberties activists have voiced concern that facial recognition could lead to unjust arrests during demonstrations against police brutality, racial injustice and the death of George Floyd.\n Critics also have questioned the software’s accuracy, pointing to a past study showing Amazon’s “Rekognition” service struggled to identify the gender of individuals with darker skin tones. Amazon has taken issue with that research.\n The company, which sells cloud computing technology via its Amazon Web Services division, said in a statement it has pushed for regulations to ensure the software was used ethically.\n “We hope this one-year moratorium might give Congress enough time to implement appropriate rules, and we stand ready to help if requested,” Amazon said.\n Congress has been weighing possible regulations of facial recognition for months. On Monday, technology giant IBM (  IBM.N) wrote members to say it no longer is offering the software generally.\n Media reports indicate that Amazon’s ‘Rekognition’ has not been a commercial blockbuster. It has sold the service to law enforcement in Oregon and Florida, and it reportedly has marketed it to U.S. Immigrations and Customs Enforcement. Firms such as France’s Idemia and Japan’s NEC, in the facial recognition business for much longer, are known to have far more contracts.\n Yet Amazon, due to its prominence in the technology industry and its defense of facial recognition, has faced the brunt of criticism in recent years, giving symbolic significance to its announcement.\n The company said it would continue to permit use of its technology by customers Thorn and Marinus Analytics to help law enforcement find human trafficking victims.", "posttime": "2020-06-11 08:15:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,警方,pauses,表示", "title": "亚马逊暂停警方使用面部识别技术一年", "title_en": "Amazon Pauses Police Use of Facial Recognition Tech For a Year", "transed": 1, "url": "https://www.reuters.com/article/us-amazon-com-facial-recognition/amazon-pauses-police-use-of-facial-recognition-tech-for-a-year-idUSKBN23H3EO", "via": "", "real_tags": ["亚马逊", "amazon", "警方", "pauses", "表示"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006074, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我感谢许多同事在审阅MSS的各种草稿时提出的一些小的更正和主要的想法，其中主要是R.Pesch、E.E.McDonnell、R.许仕仁、D.L.福克斯、J.A.Cramer、K.B.Iverson、P.Cooper、R.H.张伯伦、L.J.迪基和J.Sansom。\nAPL是一种正式的、命令式语言。因为它是命令性的，所以句子可以被称为指令，并且可以被执行以产生结果。在这里使用的插图中，指令将被缩进，其执行结果将显示在下面的行上，没有缩进。因此：\n因为APL是形式化和明确的，所以APL可以由一台称为计算机的机器或严格地说，APL计算机或APL系统来机械地执行。由于这个原因，它也被称为编程语言，它的名字就是从这个短语派生出来的。因为它具有数学表示法的分析属性，所以也被称为分析型编程语言。\n与任何活着的语言一样，APL也有方言，这在一定程度上是由使某些结构过时的进化造成的，但也是由于在其上实现APL系统的许多不同计算机的限制和特殊特性造成的。虽然本简介包括对方言的简要讨论，但读者可能会发现有必要参考特定系统的手册或国际标准化组织颁布的APL标准[1]。\nAPL起源于试图为与计算机应用相关的主题的教学和分析提供一致的符号，并通过在各种主题中的应用和在计算机系统中的实施而发展起来。关于语言历史的广泛讨论可以在APL的设计[2]和APL的演变[3]中找到，也可以在其中引用的出版物中找到。\n字典不应该作为一种语言的介绍来阅读，而应该与其他在读者感兴趣的上下文中使用这种语言的材料一起查阅。即使是语法的一般部分，即使对初学者来说也可能是易懂的，也许也应该在接触了一定数量的其他语言之后才能学习。\n另一方面，词典不应该只用来查找个别单词的意思，还应该研究一下，以获得语言的整体看法。具体地说，根据语言知识的增加，可以一次又一次有益地复习语法，并且对相关动词和副词组的研究可以揭示重要的关系，否则很容易被忽视。\n除了一些本地字母表的字母，如英语(用于姓名)和十位十进制数字(用于数字和姓名)之外，APL字母表还包括6个希腊字母、54个图形符号和大约20个由一对图形符号叠加而成的复合符号。几乎所有的图形符号(至少在一个方向上)都出现在英语词典中的一些常用符号表中，例如“美国传统词典”中的符号和符号表[4]。至少有一半的人熟悉它们在英语和算术中的使用。\n在大多数apl系统上，名称⎕av表示其元素包括字母表的列表。许多系统以小写和大写斜体以外的方式打印这两个英文字母，通常使用下划线的大写和大写。\n每个“原始”动词和副词(即词典中定义的动词和副词)都是由单个图形、复合符号或希腊字母组成的。因此，符号与代词名称的选择并不冲突，编程语言中常用的保留字(由英语字母表中的字母表示的基元名称)也不冲突。\n在任何符号的使用中，有可发音的名称是很方便的。由于同一个符号在不同的工作中通常有许多不同的用途，最著名的名称通常反映了该符号的特定用途，而不是该符号本身的名称。例如，在[4]的引用表中，给出的是⍴和×10的“电阻率”和“乘以”，而不是“希腊Rho”和“圣安德鲁十字”。\n在本词典中，我们尝试为符号提供名称(在表1：字母表中)和在APL中的通用用法(第IV-VI节)。表4提供了在特定上下文中可能使用的同义词。表1的三列提供APL符号、符号名称和音译方案，用于在计算机终端设备上广泛提供的ASCII字符集[5]。最后二十五个apl符号(以⍝开头)称为复合符号，因为它们通常是通过叠加两个较简单的符号来输入的(如在∩和∘中为⍝)，并且通常按组成它们的对命名(如在⊖中为圆条)。\n任何语言的学生都应该警惕并利用其他语言知识提供的线索，以及符号本身的外观提供的线索。例如：\n符号⌊和⌈的出现暗示了它们对Minimum和Maximum的使用，而⌊与字母L的相似性表明“Lesser Of”；↑和↓这对符号用于获取和丢弃。\n希腊语-英语的对应也很重要，如在⍳中表示整数(⍳4)，在⍴中表示重复(3⍴4)或重塑(2⍴⍳3⍴⍳6)。\n⊥用作基值(如在10⊥1 8 6 7←→1867年中)，因为它的形状表示基数，而⊤用于反函数。\n∨用于或因为v是相应拉丁语vel的首字母，而∧用于和因为它与∨的图形关系。\n单词是按照以下规则从左向右扫描APL字母表的字母序列而成的：\n引号的处理方式与英语很相似：开始引号和结束引号之间的所有内容都构成一个单词。但是，左引号后面的一对相邻引号代表引号字符本身，并不充当右引号；&#39；can&#39；t&#39；是通常用作六个字母单词&#39；can&#39；t&#39；的缩写的五个字符的单词。其余规则在应用报价规则后使用。\n不是本地字母表的马克龙(‘)、点(.)、四元(⎕)、空格()、数字或字母的每个字母都是单字母单词，也用作分隔符。\n空格是分隔符，除非它落在两个数字之间，即以数字或马克龙开头的单词，或者以点后跟数字的单词。\n单词⍺、⍵、→和$⎕中的任何一个，或者以符号⎕或本地字母表中的字母开头并以其他字母、数字、马克龙或圆点继续的单词都是一个名称，并且可以通过语法部分中讨论的系词(←)来赋值。\n不是名字的单词称为令牌。记号要么没有意义，要么有固定的指称。例如，标记3.14和314e‘2和2j3有意义，但3..14和’2和&#39；pi和2k3没有意义。\n有意义的数字令牌可以是由空格分隔的两个或多个数字组成的列表，其中，数字可以是实数，也可以是由j-1分隔的两个实数形成的复数。\n实数要么是简单的，要么是由e-隔开的两个简单数字形成的指数数字。一个简单的数字可以由一个或两个马克龙(代表无穷大和负无穷大)组成，也可以包含至少一个数字，最多一个点和一个马克龙(它表示负数，必须处于领先位置)。\n名词，如数字3和5.6；字母字符或文字，如&#39；+&#39；和&#39；A&#39；和&#39；a&#39；…。\n动词，如+(加法)和|(量值)，作用于名词以产生也是名词的结果。一个特定动词所用的名词称为它的论元(一个在主题意义上或主语意义上采用的词)。根据动词是用于一个论元(在它的右边)还是两个论元(在它的左边和右边)，它可能有两个不同的(但通常是相关的)意义。例如：\n副词作用于动词或名词的副词，如//。例如，+/是一个(派生的)动词，名为PLUS，跨越它所应用的任何数字列表的总和，而×/是一个动词，它在列表的所有元素中生成乘积。当一个副词用于名词而不是动词时(如1 0 2/产生一个“选择”动词，因此1 0 2/5 8 7产生5+7/7)，它很可能被称为形容词。然而，由于(在英语中)由名词产生动词的方式更多地是由后缀而不是形容词(如deify、reify和nitrify)实现的，所以我们将在所有情况下使用副词这个术语。\n适用于两个参数的连词，如⍤和¨，如⌽⍤⍉(反转和转置)。连词的论元可以是动词(如上面的例子)，也可以是名词(如10？⍟，意思是以十为底的对数)。\n系词，由箭头←表示，用于为名词、动词、副词或连词指定名称。例如：箭头与英语中的系词“is”和“are”的作用相同；通常读作“is”，如Area←4×8←中的“Area is 4×8”，以及“(动词)sum is plus Cross”表示SUM←+/。指定给名词的名称将称为代词，而指定给动词的名称可能称为谚语(发音为长o，如“proonoun”，以区别于现有的英语单词)。\n标点符号，由指定执行顺序的成对括号提供，就像它们在初等代数中所做的那样。句子必须显示在不同的行上，并且不能使用标点符号来分隔它们。\n名词可以按四种独立的方式分类：数值型或字面型；记号或代词；开放式或盒式；不同等级的数组。秩0、1、2的数组具有特殊名称、项、列表和表，或者(在数学上)标量、向量和矩阵。这四种分类详述如下。\n数字和文字。数字写成2、2.3和23e2(对于2300)和2J5(对于复数)，负数有一个前导马克龙，如‘3.2；；文字用引号括起来，如&#39；A&#39；和&#39；a&#39；和&#39；+#39；*。\n记号和代词。已分配给名词的名称将称为代词。引用名词的记号包括“AND”和“∘”(表示无穷大、减去无限和装箱的空列表&lt；&#39；&#39；)，以及其他数字项和列表(如3.4e2和2 3 4)，以及文字项和列表(如&#39；a&#39；和&#39；cab&#39；)。产生名词的短语(例如3×4或⌽&#39；ABCD&#39；)可以称为名词短语。\n数组。单个实体(如2.3或2.3j5或&#39；A&#39；或&#39；+#39；)称为项目。用逗号表示的动词(称为连词或之前)链接其参数以形成一个列表，该列表的形状(由动词⍴给出)等于组合的项数。例如：\nDate←1，7，7，6⍴Date 4 Word←&#39；s&39；a&#39；a&#39；，&#39；w&#39；⍴Word 3⌽Word(⌽是动词反转)是⌽Date 6 7 7 1。\n表达式s⍴l从列表l生成形状s的数组。例如：\n(3，4)⍴Date，1，8，6，7，1，9，1，7 1 7 7 6 1 8 6 7 1 9 1 7表←2 3⍴Word，&#39；b&#39；，&#39；a&#39；，&#39；t&#39；⍴表2 3 SAW BAT。\n名词形状的元素的数目被称为名词的秩；因此，秩2的名词是表，秩1是列表，秩0是项，秩3是三维或秩3数组等。此外，形状的每个位置被称为数组的轴，并且轴由索引0、1、2等引用。例如，表的轴0具有长度2，轴1具有长度3。\n阵列A的最后k个轴确定阵列的秩-k个单元或k-个单元。例如，如果：\n那么列表ABCD&39；是一个单元格，两个分开的3x4表格是一个单元格的2个单元格，每个单独的字母是一个单元格的0个单元格。\n形状向量的其余部分被称为相对于秩为k的单元的阵列的外部形状或框架。例如，如果⍴b是2 3 4 5，则b具有相对于秩2的单元格的帧2-3(因此具有形状4 5)、相对于5元素的秩-1单元格的帧2 3 4、相对于秩0的单元格的帧2 3 4 5(即，项)、以及秩为4的单元格的空帧(表示项)。\n框架中的单元格数量是其形状的乘积，如果形状中的一个或多个元素为零，则单元格数量为零；然后称该框架为零框架。由于空列表中的乘积是1%，因此空帧不是零帧。\n排名比a小一的单元格被称为一个单元的大单元，大单元在名词的讨论和动词对其的应用中起着重要的作用。例如，动词from(由{表示)从其参数中选择主单元格，如下所示：\n0{a 1{a zu mnop EFGH qrst ijkl uvwx 0{0{a 2 1{0{a ju ijkl EFGH 1{2{0{a j。\n此外，动词等级(由⍋表示)为{提供索引，将主单元带入“词法”或“行-专业”顺序。例如：\nn←4 3⍴3 1 4 2 7 9 3 2 0 3 1 4 n 3 1 4 2 7 9 3 2 0 3 1 4 g←⍋n g 1 0 3 2 g{n 2 7 9 3 1 4 3 1 4 2 0&#39；⍋&#39；CARE&#39；1 0 32。\n负数(如1-CELL和‘2-CELL)也用于指代其对应的帧具有由该数字的大小指示的等级的单元。例如，列表可以称为单元的2个单元格或1个单元格，而两个独立的3×4表格中的每一个都称为单元的1个单元格或2个单元格。数组的1-单元格是其主单元格，而项本身只有一个主单元格。\n打开并装箱。到目前为止讨论的名词称为open，以区别于动词box(用&lt；表示)产生的盒装名词。box的结果是一个项，装箱的名词通常(但不一定)显示在box中。例如：\nBox允许将任何数组(如表示单词的字母列表)视为单个实体。例如：\nLetters←&#39；⍴Letters 10⌽Letters我在这里看到I Words←(&lt；&#39；I&#39；)，(&lt；&#39；is&#39；)，(&lt；&#39；Here&#39；)⍴Words 3⌽Words(2，3)⍴Words，⌽Words|`|这里|是||。\n大多数动词的正常用法都是有限的，动词通常适用的名词类别被称为它的领域。例如，动词减号(在表达式-n中)仅适用于数值参数n；而表达式-&#39；n&#39；n&#39；没有意义；减号的范围仅限于数值参数。\n一元和二元。大多数动词有两种定义，一种用于一元格(一个参数)，另一种用于二元格(两个参数)。如果省略其中一个定义，则动词的对应大小写具有空域。在任何句子中，如果动词前面有合适的左论元，即任何本身不是连词论元的名词，则动词的二元定义也适用。否则，适用一元定义。\n动词的一元格也叫单元格，我们可以说在短语？⍵？中使用的“The Monad？”，以及在短语⍺？⍵？中使用的“the二元？”。\n动词的等级。动词等级的概念与名词等级的概念密切相关：一个等级为k的动词适用于其论元的每个k单元。这个概念将通过使用动词Ravel(用逗号表示)的示例来介绍，它分解整个参数以生成元素列表。因此：\nA←2 3 4⍴&#39；abcdefghijklmnopqrstuvwx；一个eFGH ijkl mnop qrst uvwx，a abcdefghijklmnopqrstuvwx\n由于RAVEL应用于其整个参数，因此其秩被称为无界或无限；它还可以通过在表达式中使用秩合取⍤来应用于指定秩r的单元格⍤r。因此：\n最后一个结果说明了一条一般规则：结果的形状是参数的框架(相对于动词应用到的单元)，与将动词应用于单个单元所产生的形状相关联。通常情况下，这些单个形状是一致的，但如果不一致，则首先将它们设置为如下所示的共同形状：\n如果等级不同，则通过重塑每个参数来引入领导单位长度，从而使它们达到共同的最大等级mr。形式上，单个结果a由(u，⍴a)⍴a代替，其中u←(Mr-⍴⍴a)⍴1。\n如果各个形状不同(在达到共同的等级之后)，则通过表达式ms↑a-1将每个形状变为共同的形状，其中ms是形状上的最大值。因此，如果形状是S1、S2和S3，则Ms←S1⌈S2⌈S3是。例如，⍳⍤0(2 3 4)的单个结果为0 0 1和0 1 2和0 1 2 3；总体结果为表：0 1 0 0 0 1 2 0 0 1 2。\n零帧(其没有可以应用该函数的单元格)的情况通常如下处理：通过将该函数应用于具有该自变量单元格所需形状的代理自变量来确定单个结果的形状。例如，如果⍴m为0 5 4，则案例⌹m的单个结果形状为4 x 5，整个结果的形状为0 4 5。如果各个结果形状对于不同的合适代理参数可以不同，则认为它是所有代理参数中最小的形状。例如，如果⍴m为0×3，则⍳m的单个结果形状的秩为1，形状为0。整体结果的形状为00%。\n动词的并元格有两个等级，左等级控制其左参数的单元等级，右等级控制其右参数的单元等级。例如：\np←&#39；t q←3 4⍴&#39；q唤醒阅读灯p，⍤0 1q清醒面包夹。\n最后，每个动词有三个内在等级，一元等级、左边等级和右边等级。这一事实往往简化了动词的定义。例如，⌽的一元情况被定义为具有等级1，因此它足以定义其在列表上的行为，例如，如⌽&#39；abc&39；←→&#39；和⌽1-2-3-←→3-2-1所示。因此，⌽对更高等级的参数的应用是完全定义的。例如：\n堕落的案例。动词的等级只是对它所应用的单元的等级设置了一个上限，它的域可以包括比其名义等级低的等级的论元。例如，⌽的排名为1位，但其域名还包括如下项目s：s≡⌽s s。类似地，⌹(矩阵逆)的秩为2，但被扩展为列表和项参数，如下所示：(⌹a)≡⌹⍪⊃a表，其中表函数⍪从列表或项参数形成一个单列表。\n协议。动词并元格的两个参数必须在以下意义上一致：左框架和右框架(相对于特定动词)必须相同，除非如果一个框架是空列表，则单个对应的单元格与另一个参数的每个单元格一起用作参数。\n例如，如果q←3 4⍴&#39；wakereadlight&#39；和p←&#39；abc&#39；(与前面使用派生动词⍤0-1的示例相同)，则在。\n..", "note_en": "I am indebted to numerous colleagues for minor corrections\rand major ideas arising from their reviews of various\rdrafts of the mss., chief among them being R. Pesch,\rE.E. McDonnell, R. Hui, D.L. Forkes, J.A. Cramer, K.B.\rIverson, P. Cooper, R.H. Chamberlain, L.J. Dickey, and J.\rSansom.\n         APL is a formal, imperative language. \rBecause it is imperative,\ra sentence may be called an  instruction, \rand may be  executed to produce a  result. \rIn illustrations used here an\rinstruction will be indented, \rand the result of its execution\rwill be shown on the following line without indentation.\rThus:\n    Because it is formal and unambiguous, \rAPL can be executed mechanically \rby a machine called a  computer or,\rstrictly speaking, an  APL computer, \ror  APL system. \rFor this reason it is also \rcalled a  programming language, \ra phrase from which its name derives. \rBecause it shares the analytic properties \rof mathematical notation, \rit is also called \ran  analytical programming language.\n  Like any living language, APL has dialects, resulting\rin part from evolution that has rendered certain constructs\robsolete, but also from the limitations and special characteristics\rof the many different computers on which APL\rsystems are implemented. Although this introduction includes\ra brief discussion of dialects, the reader may find\rit necessary to consult manuals for specific systems, or the\rAPL Standard promulgated by the International Standards Organization \r [1].\n  APL originated in an attempt to provide consistent notation\rfor the teaching and analysis of topics related to the\rapplication of computers, and developed through its application\rin a variety of topics, and through its implementation\rin computer systems. Extensive discussions of the history\rof the language may be found in  The Design of APL  [2]\rand  The Evolution of APL  [3], \rand in the publications cited\rtherein.\n  A dictionary should not be read as an introduction to\ra language, but should rather be consulted in conjunction\rwith other material that uses the language in some context\rof interest to the reader. Even the general section on\rgrammar, which may be intelligible even to the beginner,\rshould perhaps be studied only after a certain amount of\rother exposure to the language.\n  On the other hand, a dictionary should not be used only\rto find the meanings of individual words, but should also\rbe studied to gain an overall view of the language. In particular,\rthe grammar may be profitably reviewed again and\ragain in the light of increased knowledge of the language,\rand the study of groups of related verbs and adverbs can\rreveal important relationships otherwise easily overlooked.\n      In addition to both cases of the letters of some  native\ralphabet such as English (used for names) and the ten decimal\rdigits (used in numbers and in names), the APL alphabet\rincludes six Greek letters, fifty-four graphic symbols,\rand about twenty composite symbols formed by superposing\ra pair of graphic symbols. Nearly all of the graphic\rsymbols occur (in at least one orientation) in some table\rof commonly-used symbols in English dictionaries, such as\rthe Table of Symbols and Signs in \r The American Heritage Dictionary  [4]. \rAt least half are familiar from their use in\rEnglish and in arithmetic.\n  On most APL systems, the name  ⎕av denotes a list\rwhose elements include the alphabet. Many systems print\rthe two English alphabets in other than lowercase and uppercase\ritalics, often using uppercase and uppercase underscored.\n  Every “primitive” verb and adverb \r(i.e., those defined in the dictionary) \ris formed from a single graphic, composite\rsymbol, or Greek letter. \rConsequently, symbols do not\rconflict with the choice of names for pronouns, as do the\r reserved words \r(names of primitives represented by letters\rof the English alphabet) \rcommonly used in programming languages.\n  In any use of symbols it is convenient to have pronounceable\rnames for them. Because of the many different\ruses commonly made of the same symbol in different endeavours,\rthe best-known names usually reflect a particular\ruse of the symbol rather than a name for the symbol itself.\rFor example, in the cited table from\r [4],\r“resistivity”, and\r“multiplied by” are given \rfor  ⍴ and  × ,  \rrather than “Greek rho” \rand “St. Andrew’s cross”.\n  In this dictionary, we attempt to provide both a name\rfor the symbol (in  Table 1: Alphabet) \rand for its general\ruse in APL (Sections IV-VI). \r Table 4 provides synonyms\rfor possible use in particular contexts. \rThe three columns of  Table 1 provide the APL symbol, \ra name for the symbol,\rand a transliteration scheme for use with the ASCII character set \r [5]\rwidely provided on computer terminal devices.\rThe last twenty-five APL symbols (beginning with  ⍝)  \rare called composite symbols because they are commonly entered\rby superposing two simpler symbols (as in  ∩ with  ∘ \rfor  ⍝),  \rand are often named by the pair composing them\r(as in circle-bar for  ⊖).\n  A student of any language should be alert to, and exploit,\rclues provided by knowledge of other languages, as\rwell as clues provided by the appearance of the symbols\rthemselves. For example:\n  The appearance of the symbols  ⌊ and  ⌈ \rsuggests their use for  minimum and  maximum, \rand the similarity of  ⌊ to the letter L suggests \r“lesser of”; the pair  ↑ and  ↓ \rare used for  take and  drop.\n  Greek-English correspondences are also significant, as\rin  ⍳ for  integers  ( ⍳4), \rand in  ⍴ \rfor  repetition  ( 3⍴4)  \ror  reshape  ( 2 3⍴⍳6).\n  ⊥ is used for  base-value \r(as in  10⊥1 8 6 7 ←→ 1867)  \rbecause its shape suggests a base, and  ⊤ is\rused for the inverse function.\n  ∨ is used for  or \rbecause v is the initial letter of the\rcorresponding Latin  vel, \rand  ∧ is used for and because\rof its graphic relationship to  ∨ .\n  Words are formed by scanning a sequence of letters\rof the APL alphabet from left to right according to the\rfollowing rules:\n  Quotes are treated much as in English: everything between\ran opening quote and a closing quote forms a\rsingle word. However, a pair of adjacent quotes following\ran opening quote represents the quote character\ritself, and does not act as a closing quote;  &#39;can&#39;&#39;t&#39; \ris the five-character word commonly used as an abbreviation\rof the six-letter word  &#39;cannot&#39; .  \rThe remaining rules are used after applying the rule for quotes.\n    Every letter that is neither a macron  ( ¯), \rdot  ( .), quad  ( ⎕), \rspace  (  ), digit, nor letter of the native alphabet,\ris a one-letter word, and also serves as a delimiter.\n  The space is a delimiter unless it falls between two\r numbers, that is, words that begin with a digit or a\rmacron, or with a dot followed by a digit.\n    Any of the words  ⍺ ,     ⍵ ,     → ,   \rand  $ ,  \ror a word that begins\rwith the symbol  ⎕ or a letter of the native alphabet and\rcontinues with further letters, digits, macrons or dots is a\rname, and may be assigned a value by means of a \rcopula  ( ←)  as discussed \rin the section on grammar.\n  A word that is not a name is called a  token. \rA token is either meaningless or has a fixed referent. \rFor example,\rthe tokens  3.14 and  314e¯2 \rand  2j3 are meaningful, \rbut  3..14 and  ¯¯2 and  &#39;pi \rand  2k3 are not.\n  A meaningful numeric token may be a list formed of\rtwo or more numbers separated by spaces, \rwhere a number may be a  real number \ror a  complex number formed by two\rreal numbers separated by a  j .\n  A  real number is either  simple or \ran  exponential number\rformed from two simple numbers separated \rby an  e .  \rA simple number may be formed of \rone or two macrons (representing infinity and minus infinity), \ror contain at least one\rdigit and at most one dot and one macron (which denotes\ra negative number and must be in the leading position).\n        Nouns, such as the  numbers  3 \rand  5.6 ,   alphabetic\rcharacters or  literals \rsuch as  &#39;+&#39; and  &#39;A&#39; \rand  &#39;a&#39; .\n  Verbs, such as  + (addition) \rand  | (magnitude) that act\rupon nouns to produce results that are also nouns.\rThe nouns to which a particular verb applies are called\rits  arguments \r(a word adopted in its sense of  theme,\ror  subject). \rA verb may have two distinct (but usually\rrelated) meanings according to whether it is applied\rto one argument (to its right) or two arguments (to its\rleft and right). For example:\n  Adverbs, such as  / ,  \rthat act upon verbs or nouns. \rFor example,  +/ is a ( derived) \rverb called  plus across that\rsums any list of numbers to which it is applied, \rand  ×/ is a verb that yields \rthe product across all elements of a list.  \r\rWhen an adverb applies to a noun rather than to a verb\r(as in   1 0 2 / to produce \ra “selection” verb so \rthat   1 0 2 / 5 8 7 \ryields  5 7 7)  \rit might well be called an  adjective. \rHowever, since such production of verbs\rfrom nouns is (in English) more commonly performed\rby a suffix rather than by an adjective (as in deify,\rreify, and nitrify), \rwe will use the term  adverb for all cases.\n  Conjunctions, such as  ⍤ \rand  ¨ ,   \rwhich apply to two arguments, as  ⌽⍤⍉ \r(reverse  and transpose). \rThe arguments of a conjunction may be either verbs \r(as in the examples above) \ror nouns (as in  10¨⍟ ,  \rmeaning base-ten logarithm).\n  copula, denoted by the \rarrow  ← ,  \rand used to assign a name to a noun, verb, \radverb, or conjunction. For example:\r\r \r\rThe arrow plays the same role as the copulas “is” \rand “are” in English; \rit is usually read as “is”, \ras in “area is four times eight” \rfor  area←4×8 ,  \rand “(the verb) sum is plus across” \rfor  sum←+/ .   \r\rA name assigned to a noun will be called a  pronoun,\rand one assigned to a verb may be called a  proverb\r(pronounced with a long o as in “pronoun” \rto distinguish it from the existing English word).\n  Punctuation, provided by paired parentheses that\rspecify the sequence of execution just \ras they do in elementary algebra. \rSentences must appear on separate lines, \rand no punctuation is used to separate them.\n      Nouns may be classified in four independent ways: numeric\ror literal; token or pronoun; open or boxed; arrays of\rvarious ranks. Arrays of \rranks  0 ,  1 ,  \rand  2 have the special\rnames,  item,  list, and  table, \ror, alternatively (in mathematics)\r scalar,  vector, and  matrix. \rThe four classifications are elaborated below.\n    Numeric and literal. Numbers are written \ras  2 and  2.3 \rand  23e2 (for  2300)  \rand  2j5 (for a complex number),\rand a negative number has a leading macron, \ras in  ¯3.2 ;  \rliterals are enclosed in quotes, \ras  &#39;A&#39; and  &#39;a&#39; and  &#39;+&#39; .\n    Tokens and pronouns. A name that has been assigned to\ra noun will be called a  pronoun. \rTokens that refer to nouns\rinclude  ¯ and  ¯¯ and  ∘ \r(denoting infinity, minus infinity,\rand the boxed empty list  &lt;&#39;&#39;),  \ras well as other numeric items and lists \r(such as  3.4e2 and  2 3 4),  \rand literal items and lists \r(such as  &#39;a&#39; and  &#39;cab&#39;).  \rA phrase that produces a noun \r(such as  3×4 or  ⌽&#39;abcd&#39;)  \rmay be called a  noun phrase.\n    Arrays. A single entity such \ras  2.3 or  2.3j5 or  &#39;A&#39; \ror  &#39;+&#39; is called an  item. \rThe verb denoted by a comma (and\rcalled  catenate or  before) \rchains its arguments to form a  list\rwhose  shape (given by the verb ⍴) \ris equal to the number\rof items combined. For example:\n  date←1,7,7,6\r ⍴date\r4\r word←&#39;s&#39;,&#39;a&#39;,&#39;w&#39;\r ⍴word\r3\r ⌽word (⌽  is the verb  reverse)\rwas\r ⌽date\r6 7 7 1\n  The expression  s⍴l produces an array of shape  s \rfrom the list  l. For example:\n  (3,4)⍴date,1,8,6,7,1,9,1,7\r1 7 7 6\r1 8 6 7\r1 9 1 7\r table←2 3⍴word,&#39;b&#39;,&#39;a&#39;,&#39;t&#39;\r ⍴table table\r2 3 saw\r bat\n  The number of elements in the shape of a noun is\rcalled the  rank of the noun; \rthus a noun of rank  2 is a\rtable, of rank  1 is a list, \rof rank  0 is an item, \rof rank  3 is a  3-dimensional \ror  rank-3 array, etc. \rMoreover, each position of the shape is \rcalled an  axis of the array, and axes\rare referred to by \rindices  0 ,  1 ,  2 ,  \retc. For example, axis  0 \rof  table has length  2 \rand axis  1 has length  3 .\n  The last  k axes of an array  a \rdetermine  rank-k cells\ror  k-cells of   a .   \rFor example, if:\n    then the list  &#39;abcd&#39; is a  1-cell \rof  a ,   \rthe two separate  3 by  4 \rtables are  2-cells of  a ,  \rand the individual letters are each  0-cells \rof  a .\n  The rest of the shape vector is called the  outer shape\ror  frame of the array relative to the cells \rof rank  k .  \rFor example, if  ⍴b \ris   2 3 4 5 ,  \rthen  b has the frame  2 3 \rrelative to the cells of rank  2 \r(and therefore of shape  4 5),  \rhas a frame of   2 3 4 \rrelative to  5-element rank- 1 cells,\ra frame of   2 3 4 5 \rrelative to cells of rank  0 \r(that is, items), and an empty frame \r(signifying an item) of cells of\rrank  4 .\n  The number of cells in a frame is the product over its\rshape, and if one or more of the elements in the shape is\rzero, the number of cells is zero; the frame is then said to\rbe a  zero frame. \rSince the product across an empty list \ris  1 ,  \ran empty frame is  not a zero frame.\n  A cell of rank one less than the rank \rof  a is called\ra  major cell of  a ,  \rand major cells play an important role\rin the discussion of nouns \rand the application of verbs to them. \rFor example, the verb  from \r(denoted by  {)  \rselects major cells from its argument, as in:\n  0{a 1{a\rabcd mnop\refgh qrst\rijkl uvwx\r0{0{a 2 1{0{a\rabcd ijkl\r efgh\r 1{2{0{a\rj\n  Moreover, the verb  grade \r(denoted by  ⍋)  \rprovides indices to  { \rthat bring major cells to “lexical” \ror “row-major” order. For example:\n  n←4 3⍴3 1 4 2 7 9 3 2 0 3 1 4\r n\r3 1 4\r2 7 9\r3 2 0\r3 1 4\r g←⍋n\r g\r1 0 3 2\r\r g{n\r2 7 9\r3 1 4\r3 1 4\r3 2 0\r &#39;abcdefg&#39; ⍋ &#39;care&#39;\r1 0 3 2\n  Negative numbers \r(as in  ¯1-cell and  ¯2-cell) \rare also used to refer to cells whose corresponding \rframes are of the rank indicated by the magnitude \rof the number. \rFor example, the list  &#39;abcd&#39; may be referred \rto either as a  ¯2-cell \ror as a  1-cell of  a ,   \rand each of the two \rseparate  3 by  4 tables \rare called either  ¯1-cells \ror  2-cells of  a .   \rThe  ¯1-cells of an array are its major cells, \rand an item has a\rsingle major cell, itself.\n    Open and boxed. The nouns discussed \rthus far are called  open, \rto distinguish them from  boxed nouns produced by\rthe verb  box (denoted by  &lt;).   \rThe result of box is an item,\rand boxed nouns are commonly (but not necessarily) \rdisplayed in boxes. For example:\n    Box allows one to treat any array \r(such as a list of letters that represent a word) \ras a single entity. For example:\n  letters←&#39;I was here&#39;\r ⍴letters\r10\r ⌽letters\rereh saw I\r words←(&lt;&#39;I&#39;),(&lt;&#39;was&#39;),(&lt;&#39;here&#39;)\r ⍴words\r3\r ⌽words (2,3)⍴words, ⌽words\r|¯¯¯¯||¯¯¯||¯| |¯| |¯¯¯||¯¯¯¯|\r|here||was||I| |I| |was||here|\r|____||___||_| |_| |___||____|\r |¯¯¯¯||¯¯¯||¯|\r |here||was||I|\r |____||___||_|\n      Most verbs are limited in their normal application, and\rthe class of nouns to which a verb normally applies is called\rits  domain. \rFor example, the verb  minus \r(in the expression  -n)  \rapplies only to a numeric \rargument  n ,  \rand the expression  -&#39;n&#39; \ris meaningless; the domain of  minus is limited\rto numeric arguments.\n    Monads and Dyads. Most verbs have two definitions, \rone for the  monadic case (one argument), \rand one for the  dyadic case (two arguments). \rIf one of these definitions is omitted,\rthe corresponding case of the verb has an empty domain.\rIn any sentence, the dyadic definition of a verb applies if\rit is preceded by a suitable left argument, that is, any noun\rthat is not itself an argument of a conjunction. Otherwise\rthe monadic definition applies.\n  The monadic case of a verb is also called a  monad,\rand we may speak of “the monad  ÷”  \rused in the expression  ÷⍵ ,   \rand of “the  dyad  ÷”  \rused in the expression  ⍺÷⍵ .\n    Ranks of verbs. The notion of verb rank \ris closely related\rto that of noun rank: a verb of rank  k \rapplies to each of\rthe  k-cells of its argument. \rThis notion will be introduced\rby an example using the verb  ravel \r(denoted by a comma),\rwhich ravels its entire argument \rto produce a list of the elements. \rThus:\n  a←2 3 4⍴&#39;abcdefghijklmnopqrstuvwx&#39;\r a\rabcd\refgh\rijkl\r\rmnop\rqrst\ruvwx\r ,a\rabcdefghijklmnopqrstuvwx\n  Since ravel applies to its entire argument, \rits rank is said to be  unbounded, \ror  infinite; \rit can also be applied to\rcells of a specified rank  r \rby using the rank conjunction  ⍤ \rin the expression  ,⍤r .  Thus:\n      The last result illustrates a general rule: the shape of\ra result is the frame of the argument (relative to the cells\rto which the verb applies) catenated with the shape produced\rby applying the verb to the individual cells. Commonly\rthese individual shapes agree, but if not, they are\rfirst brought to a common shape as follows:\n  If the ranks differ, they are brought to a common maximum\rrank  mr by reshaping each argument to introduce\rleading unit lengths. Formally, an individual result a\ris replaced by  (u,⍴a)⍴a,   \rwhere  u←(mr-⍴⍴a)⍴1 .\n  If the individual shapes differ (after being brought to a\rcommon rank), each is brought to a common shape by\rthe expression  ms↑a ,  \rwhere  ms is the maximum over\rthe shapes. \rThus, if the shapes \rare  s1 and  s2 \rand  s3 ,  \rthen  ms←s1⌈s2⌈s3 .  \rFor example, the individual\rresults of  ⍳⍤0(2 3 4) \rare  0 1 \rand   0 1 2 \rand   0 1 2 3 ;  \rthe overall result is the table:  \r0 1 0 0 \r0 1 2 0 \r0 1 2 3\n  The case of a zero frame (which has no cells to which\rthe function may be applied) \ris normally treated as follows:\rThe shape of the individual result is determined by\rapplying the function to a surrogate argument having the\rshape required for the argument cell. \rFor example, if  ⍴m \ris   0 5 4 ,  \rthen the individual result shape for the case  ⌹m \ris  4 5 ,  \rand the shape of the entire result \ris   0 4 5 .   \rIf the\rindividual result shape can differ \rfor different suitable surrogate\rarguments, it is taken to be the smallest shape over\rall surrogate arguments. \rFor example, if  ⍴m is  0 3 ,   \rthe individual result shape of  ⍳m \rhas rank  1 \rand is of shape  0 .  \rThe shape of the overall result is  0 0 .\n  The dyadic case of a verb has two ranks, \ra  left rank that\rgoverns the rank of the cells of its left argument, \rand a  right\rrank that governs the rank of cells of its right argument. \rFor example:\n  p←&#39;abc&#39;t\r q←3 4⍴&#39;wakereadlamp&#39;\r q\rwake\rread\rlamp\r\r p,⍤0 1 q\rawake\rbread\rclamp\n  Finally, each verb has three intrinsic ranks, a monadic\rrank, a left rank, and a right rank. \rThis fact often simplifies\rthe definition of a verb. \rFor example, the monadic case of  ⌽ \ris defined to have rank 1, \rand it therefore suffices to define\rits behaviour on lists, perhaps by example, \ras in  ⌽&#39;abc&#39; ←→ &#39;cba&#39; \rand  ⌽1 2 3 ←→ 3 2 1 .  \rThe application \rof  ⌽ to an argument of higher rank \ris therefore completely\rdefined. For example:\n      Degenerate cases. The rank of a verb merely places an\rupper limit on the ranks of the cells to which it applies, and\rits domain may include arguments of rank lower than its\rnominal rank. For example,  ⌽ \rhas rank  1 ,  \rbut its domain also includes an item  s as \rfollows:  s≡⌽s .  \rSimilarly,  ⌹ (matrix inverse) \rhas rank  2 ,  \rbut is extended to list and item\rarguments as follows:  (⌹a)≡⌹⍪⊃a ,  \rwhere the  table function  ⍪ \rforms a one-column table from a list or item argument.\n    Agreement. The two arguments of the dyadic case of a\rverb must  agree in the following sense: \rthe left frame and\rthe right frame (relative to the particular verb) must be\ridentical, except that if one frame is an empty list, the\rsingle corresponding cell is used as argument together with\reach cell of the other argument.\n  For example, if  q←3 4⍴&#39;wakereadlamp&#39; \rand  p←&#39;abc&#39; \r(as in the earlier example \rusing the derived verb  ,⍤0 1),  \rthen in the \n......", "posttime": "2020-06-11 08:13:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apl,dictionary,动词", "title": "APL词典(1987)", "title_en": "A Dictionary of APL (1987)", "transed": 1, "url": "https://www.jsoftware.com/papers/APLDictionary1.htm", "via": "", "real_tags": ["apl", "动词"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006073, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着最近所有关于Mac过渡到ARM处理器的谣言四起，我看到了一些关于这对未来软件意味着什么的断言。我想，作为一个长期为Mac开发软件的人，包括上一次从PowerPC到英特尔的架构过渡，我可以附和这一点。\n可以这么说，我对苹果的内部计划一无所知。这些都是基于我多年使用苹果和苹果框架的经验得出的有根据的猜测。也许这一切都是徒劳的，因为这种转变甚至可能不会发生！\n我发现可可不太可能在短期内消失。可可在很大程度上是用Objective-C编写的，既然苹果一直在对SWIFT大举投资，那么这个想法就是可可肯定会消失。\nCocoa是驱动MacOS上几乎所有应用程序的框架。没有NSWindow，没有NSView，Mac上就没有应用程序。苹果可以在SWIFT中完全重写Cocoa，但这将是对资源的巨大浪费，而且需要很多年的时间才能完成。众所周知，苹果的团队规模很小，所以我不认为他们会花时间去做这件事，只会说5年后的今天，一切都在斯威夫特！那不是很棒吗？抱歉，我们在此期间没有做任何事情，这里有一组全新的错误，您也会发现的。\n&#34；但是等一下！那么SwiftUI呢？你可能会说。SwiftUI还不到一岁。看看斯威夫特花了多长时间才到了不会让人难以置信地痛苦的地步。SwiftUI很可能是在类似的轨道上，无论如何，SwiftUI的许多部分也位于Cocoa之上。\n断言：Objective-C将随着ARM的过渡而消失，从现在开始它将是快速的。\nObjective-C短期内不会去任何地方。太多的MacOS和太多的重要应用程序依赖于它。见鬼-可可框架是用Objective-C编写的！Objective-C对苹果来说仍然非常重要，即使市场部不愿提及它。\n他们的想法是，由于像Microsoft Word和Photoshop这样的主要应用程序在iPad上已经有了版本，所以对它们来说，将其重新编译并作为Catalyst应用程序在MacOS上运行将是小菜一碟。\n对于MacOS上这些应用程序的用户来说，这将是一个严重的降级，也将严重偏离这些应用程序目前在MacOS上的表现方式。即使有了Catalyst，要让iPad应用程序看起来和感觉上都像Mac应用程序，仍然有很多工作要做。除了添加用户期望的所有缺少的功能外，您仍然需要一个团队来确保所有端口都正确无误。我只是不认为这会发生。\n这是有可能发生的。我给它50/50的机会。就我个人而言，我希望这不会发生，因为MacOS上的沙箱仍然有很多问题尚未解决，尽管开发人员多年来一直在抱怨这个问题。\n是的，这完全是真的。OpenGL和OpenCL已经弃用了一段时间，现在支持Metal。苹果将利用这个机会放弃它们。\n苹果今年会发布基于ARM的Mac吗？我希望如此，我认为上行空间是巨大的。我们将失去VMware和其他基于x86的应用程序，这将是可悲的，但如果它能带来更好的性能和更长的电池续航时间，我完全支持它。", "note_en": "With all the recent rumors flying around about the Mac transitioning to ARM processors, I&#39;ve seen some assertions about what this means for software going forward. I thought I could chime in on this as someone who&#39;s been developing software for the Mac for a long time, including the last architecture transition from PowerPC to Intel.\n Let it be stated that I have no knowledge of what Apple&#39;s internal plans are. These are educated guesses based on my years of experience of working with Apple and Apple&#39;s frameworks. And maybe this is all for nothing, since this transition might not even happen!\n  I find it very unlikely that Cocoa is going away anytime soon. Cocoa is largely written in Objective-C, and since Apple has been heavily investing in Swift the idea is that Cocoa must be going away.\n Cocoa is the framework that drives pretty much every app on MacOS. Without NSWindow, without NSView, you&#39;ve got no apps on the Mac. Apple  could completely rewrite Cocoa in Swift, but that would be a monumental waste of resources and would take many years to accomplish. Apple famously keeps its teams small, so I don&#39;t see them spending the time to do this, only to say 5 years from now &#34;Hey- it&#39;s all in Swift now! Isn&#39;t that great? Sorry we didn&#39;t get anything done in the meantime and here&#39;s a whole new set of bugs you&#39;ll be discovering as well&#34;.\n &#34;But wait! What about SwiftUI?&#34; you might say. SwiftUI is barely one year old. Look at how long it&#39;s taken Swift to get to a point where it&#39;s not incredibly painfully to use. SwiftUI is most likely on a similar track, and regardless, many parts of SwiftUI also sit atop Cocoa.\n Assertion: Objective-C is going away with the ARM transition, and it&#39;ll be Swift only from here on out.\n Objective-C isn&#39;t going anywhere anytime soon. Too much of MacOS and too many important applications rely on it. Heck- the Cocoa frameworks are written in Objective-C! Objective-C is still incredibly important to Apple, even if the marketing department doesn&#39;t like to mention it.\n   The thinking goes, since major apps like Microsoft Word and Photoshop already have versions on the iPad, it would be a piece of cake for them to recompile and run on MacOS as Catalyst apps.\n This would be a serious downgrade for users of these apps on MacOS, and would be a major departure from the way the apps currently behave on MacOS. And even with Catalyst, it&#39;s still a lot of work for an iPad app to look and feel like a Mac app. You&#39;re still going to need a team to make sure everything ports correctly, in addition to adding all the missing functionality that your users would expect to be there. I just don&#39;t see this happening either.\n  This could happen. I give it a 50/50 shot at happening. Personally, I hope it doesn&#39;t happen as there are still many problems with the sandbox on MacOS that have yet to be resolved, even though developers have been complaining about it for years.\n  Yea, this is totally happening. OpenGL and OpenCL have been deprecated for a while now in favor of Metal. Apple will use this opportunity to drop them.\n  Will Apple release ARM based Macs this year? I hope so, I think the upside is huge. We&#39;ll lose things like VMware and other x86 based applications which will be sad, but if it brings better performance and longer battery life, I&#39;m all for it.", "posttime": "2020-06-11 08:12:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,过渡,guesses,应用程序", "title": "关于软件过渡到ARM上的MacOS的有根据的猜测", "title_en": "Educated Guesses on Software Transitioning to macOS on ARM", "transed": 1, "url": "https://shapeof.com/archives/2020/6/educated_guesses_about_a_mac_transition_to_arm.html", "via": "", "real_tags": ["软件", "过渡", "guesses", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "3ee3b64159d3f861beb213cf808febf9.jpeg", "infoid": 1006071, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果答案是否定的--而且你试图在推特上发布一篇你还没有打开的文章的链接--Twitter可能会温和地建议你在发帖之前阅读这篇文章。\nTwitter周三宣布，该公司正在测试一项新功能，该功能将向任何试图在没有点击的情况下转发一篇文章的人显示一条警告消息，这是该公司帮助促进知情讨论的努力的一部分。\n公告写道，分享一篇文章可以引发对话，所以你可能想在发推特之前先读一读。\n这是Twitter近几个月来采取的最新举措之一，目的是更积极地引导这款应用的言论。今年5月，Twitter推出了新功能，让人们选择谁可以回复他们的推文，试图减少用户之间的火药战。\n该网站最近还承担了更积极的事实核查角色，在关于冠状病毒的误导性推文中添加警告标签，甚至在事实核查总统唐纳德·特朗普(Donald Trump)身上也添加了警告标签。\n目前还不清楚Twitter是否计划在更大范围内推出它的提示功能，敦促人们在分享文章之前先阅读它们。", "note_en": "If the answer is no — and you try to tweet the link to an article you haven&#39;t opened — Twitter might gently suggest that you read the article before posting.\n Twitter is testing out a new feature that will show a warning message to anyone who tries to retweet an article without clicking on it as part of an effort to &#34;help promote informed discussion,&#34; the company announced Wednesday.\n &#34;Sharing an article can spark conversation, so you may want to read it before you Tweet it,&#34; the announcement reads.\n    It&#39;s one of the latest measures Twitter has taken in recent months to more actively steer discourse on the app. In May, Twitter unrolled new features that let people select who can reply to their tweets in an attempt to reduce flame wars between users.\n The site has also taken on a  more aggressive fact-checking role as of late, adding warning labels to misleading tweets about coronavirus and even fact-checking President Donald Trump.\n It&#39;s not clear whether Twitter plans any wider rollout for its prompt urging people to read articles before sharing them.", "posttime": "2020-06-11 07:22:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "推特,文章,feature,twitter", "title": "推特的新功能让你在没有打开文章的情况下分享文章而唠叨不休", "title_en": "New Twitter Feature Nags You For Sharing Articles Without Opening Them", "transed": 1, "url": "https://www.businessinsider.com/new-twitter-feature-sharing-articles-without-opening-them-2020-6", "via": "", "real_tags": ["推特", "文章", "feature", "twitter"]}]