[{"category": "", "categoryclass": "", "imagename": "fe0470b0840ffa5f37eea274a41a7c80.jpg", "infoid": 1004254, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人工智能(AI)似乎正变得越来越聪明。每部iPhone都比上一部更好地学习你的脸、声音和习惯，人工智能对隐私和工作构成的威胁也在继续增长。这一激增反映了更快的芯片、更多的数据和更好的算法。麻省理工学院(MIT)计算机科学研究生戴维斯·布拉洛克(Davis Blalock)表示，一些改进来自于微调，而不是他们的发明者声称的核心创新-其中一些收益可能根本不存在。布拉洛克和他的同事们比较了数十种改善神经网络的方法，神经网络是一种松散地模仿大脑的软件架构。“50篇论文，”他说，“很明显，它甚至不是很明显的艺术状态是什么。”\n研究人员评估了81种修剪算法，这些算法通过修剪不需要的连接来提高神经网络的效率。所有人都以略有不同的方式声称优越。但很少有人对它们进行适当的比较-当研究人员试图并排评估它们时，没有明确的证据表明在10年的时间里表现有所改善。这一结果在3月份的机器学习和系统会议上公布，这让布拉洛克的博士导师、麻省理工学院计算机科学家约翰·古塔格感到惊讶，他说，不均匀的比较本身可能解释了停滞不前的原因。“这是老生常谈，对吗？”古塔格说。“如果你不能衡量某件事，那就很难把它做得更好.”\n研究人员开始意识到人工智能许多子领域进展不稳的迹象。2019年对搜索引擎中使用的信息检索算法进行的荟萃分析得出了“高水位线…”的结论。实际上设定在2009年。“。2019年的另一项研究复制了七个神经网络推荐系统，属于媒体流媒体服务使用的那种系统。研究发现，Six未能超越几年前开发的简单得多的非神经算法，当时早期的技术进行了微调，揭示了该领域的“幻影进展”。在3月份发布在arxiv上的另一篇论文中，康奈尔大学(Cornell University)的计算机科学家凯文·马斯格雷夫(Kevin MusGrave)研究了损失函数，这是一种从数学上指定目标的算法的一部分。马斯格雷夫在一项涉及图像检索的任务中，平等地比较了其中的十几个人，发现与他们的开发者的说法相反，准确性自2006年以来并没有提高。马斯格雷夫说：“总是有这样一波又一波的炒作。”\n机器学习算法的收益可以来自其体系结构、损失函数或优化策略的根本改变-它们如何使用反馈来改进。但卡内基梅隆大学(Carnegie Mellon University)研究图像识别模型的计算机科学家齐科·科尔特(Zico Kolter)表示，对这些模型进行微妙的调整也可以提高性能。他研究的图像识别模型被训练成对黑客的“敌意攻击”具有免疫力。早期的一种称为投影梯度下降(PGD)的对抗性训练方法，在这种方法中，模型只在真实和欺骗性的例子上进行训练，似乎已经被更复杂的方法所超越。但在2月份的一篇arxiv论文中，科尔特和他的同事们发现，当使用一个简单的技巧来增强它们时，所有的方法都取得了大致相同的效果。\n科尔特的博士生莱斯利·赖斯(Leslie Rice)说：“这是非常令人惊讶的，这是以前没有被发现的。”科尔特说，他的发现表明，像PGD这样的创新很难获得，而且很少有实质性的改善。“很明显，PGD实际上就是正确的算法，”他说。“这是显而易见的事情，人们希望找到过于复杂的解决方案。”\n其他主要的算法进步似乎也经受住了时间的考验。1997年，语言翻译中使用了一种名为长短期记忆(LSTM)的体系结构，这是一个重大突破。经过适当的培训后，LSTM的性能与20年后开发出的理应更先进的体系结构的性能相当。机器学习的另一个突破出现在2014年，出现了生成性对手网络(GANS)，例如，它在创建和批评循环中将网络配对，以提高它们产生图像的能力。2018年的一篇论文报道，经过足够的计算，最初的GaN方法可以与后来几年的方法的能力相匹配。\n科尔特说，与调整现有的算法相比，研究人员更有动力创造一种新的算法，并对其进行调整，直到它达到最先进的水平。他指出，后者可能看起来不那么新奇，这使得“很难从那里拿到一份论文”。\n古塔格说，对于算法的发明者来说，与其他算法的发明者彻底比较其性能也是一种阻碍--结果发现他们的突破并不是他们想象的那样。“过于仔细地比较是有风险的。”这也是一项艰巨的工作：人工智能研究人员使用不同的数据集、调优方法、性能度量和基线。“做所有的苹果对苹果的比较并不是真的可行。”\n一些夸大业绩的说法可以归因于该领域的爆炸性增长，那里的论文数量超过了经验丰富的评论家。“这其中很多似乎都是成长的烦恼，”Blalock说。他敦促审查者坚持与基准进行更好的比较，并表示更好的工具将有所帮助。今年早些时候，布拉洛克的合著者、麻省理工学院研究员何塞·冈萨雷斯·奥尔蒂斯(Jose Gonzalez Ortiz)发布了一款名为ShrinkBench的软件，它使得比较修剪算法变得更容易。\n研究人员指出，即使新方法在根本上并不比旧方法更好，他们实施的调整也可以应用到他们的祖先身上。每隔一段时间，一种新的算法就会是一个真正的突破。“这几乎就像是一个风险投资组合，”布拉洛克说，“有些业务并不是真的在运作，但有些业务做得非常好。”", "note_en": "Artificial intelligence (AI) just seems to get smarter and smarter. Each iPhone learns your face, voice, and habits better than the last, and the threats AI poses to privacy and jobs continue to grow. The surge reflects faster chips, more data, and better algorithms. But some of the improvement comes from tweaks rather than  the core innovations their inventors claim—and some of the gains may not exist at all, says Davis Blalock, a computer science graduate student at the Massachusetts Institute of Technology (MIT). Blalock and his colleagues compared dozens of approaches to improving neural networks—software architectures that loosely mimic the brain. “Fifty papers in,” he says, “it became clear that it wasn’t obvious what the state of the art even was.”\n The researchers evaluated 81 pruning algorithms, programs that make neural networks more efficient by trimming unneeded connections. All claimed superiority in slightly different ways. But they were rarely compared properly—and when the researchers tried to evaluate them side by side, there was no clear evidence of performance improvements over a 10-year period.  The result, presented in March at the Machine Learning and Systems conference, surprised Blalock’s Ph.D. adviser, MIT computer scientist John Guttag, who says the uneven comparisons themselves may explain the stagnation. “It’s the old saw, right?” Guttag said. “If you can’t measure something, it’s hard to make it better.”\n Researchers are waking up to the signs of shaky progress across many subfields of AI. A  2019 meta-analysis of information retrieval algorithms used in search engines concluded the “high-water mark … was actually set in 2009.”  Another study in 2019 reproduced seven neural network recommendation systems, of the kind used by media streaming services. It found that six failed to outperform much simpler, nonneural algorithms developed years before, when the earlier techniques were fine-tuned, revealing “phantom progress” in the field. In  another paper posted on arXiv in March, Kevin Musgrave, a computer scientist at Cornell University, took a look at loss functions, the part of an algorithm that mathematically specifies its objective. Musgrave compared a dozen of them on equal footing, in a task involving image retrieval, and found that, contrary to their developers’ claims, accuracy had not improved since 2006. “There’s always been these waves of hype,” Musgrave says.\n Gains in machine-learning algorithms can come from fundamental changes in their architecture, loss function, or optimization strategy—how they use feedback to improve. But subtle tweaks to any of these can also boost performance, says Zico Kolter, a computer scientist at Carnegie Mellon University who studies image-recognition models trained to be immune to “ adversarial attacks” by a hacker. An early adversarial training method known as projected gradient descent (PGD), in which a model is simply trained on both real and deceptive examples, seemed to have been surpassed by more complex methods. But in a  February arXiv paper, Kolter and his colleagues found that all of the methods performed about the same when a simple trick was used to enhance them.\n    “That was very surprising, that this hadn’t been discovered before,” says Leslie Rice, Kolter’s Ph.D. student. Kolter says his findings suggest innovations such as PGD are hard to come by, and are rarely improved in a substantial way. “It’s pretty clear that PGD is actually just the right algorithm,” he says. “It’s the obvious thing, and people want to find overly complex solutions.”\n Other major algorithmic advances also seem to have stood the test of time. A big breakthrough came in 1997 with an architecture called long short-term memory (LSTM), used in language translation. When properly trained, LSTMs  matched the performance of supposedly more advanced architectures developed 2 decades later. Another machine-learning breakthrough came in 2014 with generative adversarial networks (GANs), which pair networks in a create-and-critique cycle to sharpen their ability to produce images, for example.  A 2018 paper reported that with enough computation, the original GAN method matches the abilities of methods from later years.\n Kolter says researchers are more motivated to produce a new algorithm and tweak it until it’s state-of-the-art than to tune an existing one. The latter can appear less novel, he notes, making it “much harder to get a paper from.”\n Guttag says there’s also a disincentive for inventors of an algorithm to thoroughly compare its performance with others—only to find that their breakthrough is not what they thought it was. “There’s a risk to comparing too carefully.”  It’s also hard work: AI researchers use different data sets, tuning methods, performance metrics, and baselines. “It’s just not really feasible to do all the apples-to-apples comparisons.”\n Some of the overstated performance claims can be chalked up to the explosive growth of the field, where papers outnumber experienced reviewers. “A lot of this seems to  be growing pains,” Blalock says. He urges reviewers to insist on better comparisons to benchmarks and says better tools will help. Earlier this year, Blalock’s co-author, MIT researcher Jose Gonzalez Ortiz, released software called ShrinkBench that makes it easier to compare pruning algorithms.\n Researchers point out that even if new methods aren’t fundamentally better than old ones, the tweaks they implement can be applied to their forebears. And every once in a while, a new algorithm will be an actual breakthrough. “It’s almost like a venture capital portfolio,” Blalock says, “where some of the businesses are not really working, but some are working spectacularly well.”", "posttime": "2020-05-29 23:21:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,领域,catching,算法", "title": "一些人工智能领域的引人注目的进步并不是真的", "title_en": "Eye-catching advances in some AI fields are not real", "transed": 1, "url": "https://www.sciencemag.org/news/2020/05/eye-catching-advances-some-ai-fields-are-not-real", "via": "", "real_tags": ["人工智能", "领域", "catching", "算法"]}, {"category": "", "categoryclass": "", "imagename": "e0dc15f7bf496b794d57b4de6f8d41c1.jpg", "infoid": 1004253, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "3月中旬，随着旧金山市长伦敦布赖德发布了一项全市范围的居家命令，佩吉·西米尔开始做准备。Cmiel是旧金山犹太人生活中心(SFCJL)的临床运营总监，这是一个占地9英亩的老年住房综合体，位于Excelsior社区，包括长期护理设施、短期康复住房和一个记忆护理侧翼。校园里住着300多名老年居民，他们是最容易受到这种致命和高传染性冠状病毒影响的人群之一。这种冠状病毒已经蔓延到全球各地。\nCmiel的工作人员为工人和居民储备了个人防护装备和口罩；对每一个走进门的人进行了症状筛查；雇佣了更多的工作人员来打扫浴室和公共区域；并开始向每个人进行关于控制病毒的最佳做法的教育，比如洗手，避免近距离接触，并密切关注发烧或咳嗽等症状。虽然疗养院占加州冠状病毒死亡人数的近一半，但在SFCJL，没有一个居民的病毒检测呈阳性。“早点出发真的是我们做的最有帮助的事情，”Cmiel说。“这个设施的门把手以前从来没有这么干净过。”\n并不是每个家庭都这么幸运，准备得这么充分。美国各地的疗养院都被新冠肺炎摧毁了。在包括科罗拉多州、马萨诸塞州和弗吉尼亚州在内的许多州，疗养院居民的死亡占冠状病毒死亡的50%或更多。但像SFCJL这样的少数几个家庭的成功，可能会为他们的同事提供一些线索，让他们知道在国家准备应对潜在的第二波感染时，如何保障居民的安全。\n老年医生和疗养院经营者明白为什么这些空间如此脆弱。长期护理设施在很多方面都是完美的病毒孵化器。居民年龄较大，身体虚弱，经常患有心脏病或糖尿病等合并症，更容易受到严重的新冠肺炎感染。许多人需要帮助执行基本的任务，如吃饭、穿衣或洗澡，而这些工作不能通过视频预约提供，这使得他们更有可能从帮助他们的助手那里感染，或者将病毒传染给他们的照顾者。这些助手可能在几个不同的设施工作，在不知不觉中把它从一个家搬到另一个家。\n这些设施的布局也加强了各个领域的联系。大多数居民共用卧室、卫生间、活动室和餐厅，员工共用休息室。这些团体空间的设计部分是为了削减成本，也是为了鼓励社交。但共享空间也帮助传播了病毒。高级设施确实有应对流感等疫情的方案，但大流行来得如此之快，SARS-CoV-2病毒的传染性如此之强，以至于许多设施在毫无准备的情况下被发现。“这种病毒在一定程度上占上风，”加州大学旧金山分校的老年病学家安娜·乔多斯(Anna Chodos)说。与医院不同的是，大多数疗养院通常没有充足的装备，如口罩和长袍，这些在控制流感时是不必要的。\n现在，随着各州慢慢开始重新开放，老年护理设施面临着一项更复杂的努力：在新冠肺炎疫情持续的情况下，弄清楚如何保障居民的安全，保持他们的生活质量。即使是像SFCJL这样的设施，前进的道路也远不明朗。“我们如何安全、缓慢地引入探访和小组活动？它会非常小心，非常谨慎，“Cmiel说。“重新开始把人们带回社区将是非常可怕的。”\n与医院不同，大多数疗养院居民长期居住在这些设施中，因此工作人员必须为人们的长期情感、社会和身体健康创造舒适的环境。但是，这种新型冠状病毒使这些重要的心理服务被搁置。“疗养院里的生活方式被打乱了，”印第安纳大学老年病学助理教授凯瑟琳·昂罗(Kathleen Unroe)说。“这里是人们居住的地方。这些都是社交场所。“。\n或者至少他们曾经是。目前，许多设施都在尽可能地限制活动，让人们呆在自己的房间里，远离共享空间。Unroe咨询了几家护理机构，并说其中一家的家人已经两个月没有被允许访问了。“我有这些家庭成员对我说，‘我一生中从未离开过95岁的母亲这么长时间，’”她补充道。“这是很深刻的。”\n昂罗还指出，在一些设施中，即使是从新冠肺炎康复的人也不能总是回到自己的房间。如果他们在症状缓解后几周内继续脱毒并检测呈阳性，他们就必须保持隔离，这可能是可怕和令人沮丧的。有些人不明白为什么不能回到自己平常的房间；“有些人只是觉得被遗弃了，只是感到困惑或生气。”\n那么，是什么让SFCJL的表现比许多同行更好呢？这很可能是早期行动和运气的结合。该设施是加利福尼亚州首批在游客进入场所之前开始对他们进行筛查的设施之一。他们囤积了防护设备，并准备向每一位居民和工作人员分发口罩。拉古纳本田医院和康复中心是旧金山的另一家长期护理机构，很早就被隔离了，它有700多张床位，也取得了类似的成功-据报道，居民和工作人员中只有29例。扎克伯格SF总医院和创伤中心(Zuckerberg SF General Hospital And Trauma Center)首席质量官特洛伊·威廉姆斯(Troy Williams)表示：“旧金山的行动非常早，所以我不认为这是偶然的。”他一直负责本田拉古纳(Laguna Honda)应对疫情的工作。\n加州大学旧金山分校的乔多斯同意，本田拉古纳早期封锁设施和隔离受感染居民的行动是缓解疫情不可或缺的一部分。“他们把它像虫子一样压碎了，”她说。但她说，旧金山的工厂也很幸运：“幸运的是，我们有伟大的领导层。幸运的是我们的病毒较少。“。与美国其他地区相比，旧金山发布在家命令的时间更早，感染率也相对较低。随着病毒在社区中传播的减少，工作人员不太可能意外地将病毒引入设施。\n另一个因素可能是，拉古纳本田和SFCJL都参与了旧金山的普遍测试计划，该计划由市长授权，并由该市公共卫生部带头实施。这两个设施将继续每隔几周对所有工作人员和居民进行一次测试，如果他们开始看到更积极的结果，测试就会更频繁。(工作人员每天晚上回家，每天由物理和呼吸治疗师、助手、护士和其他工作人员组成的团队重新进入这些建筑群，可能会带来新的感染。)。“我们必须全力以赴，”威廉姆斯说，“因为它可能会改变。”\n他们还在研究其他降低风险的战略。例如，SFCJL开设了一个新翼，接收当地医院的新冠肺炎康复患者，他们需要短期康复护理才能再次回家。那个单位有一支完全独立的医疗、护理和清洁人员。病人使用不同的入口，工作人员在他们被带到房间后立即清洁电梯。\n对于疗养院的所有老年人来说，无论是否爆发病毒疫情，卧床不与亲人进行任何身体接触都对身心健康不利。通常，设施有很多活动和访客；志愿者演奏音乐，带着治疗犬，或者与居民玩纸牌游戏。为了适应大流行期间的情况，拉古纳本田和SFCJL的工作人员都购买了iPad，这样居民就可以视频呼叫家人。拉古纳本田现在开始举办一些社交距离的活动，比如宾果游戏和艺术课程，参与者可以相距6英尺，戴着口罩。\n乔多斯说，这些措施可以帮助阻止病毒从无症状携带者那里传播。她补充说，对于这种传染性的病毒，“在任何情况下都没有多余的预防措施。”\n但根据Unroe的说法，这些预防措施只在一定程度上有帮助。她说：“这些疫情仍在继续，它们将在疗养院继续。”关于病毒是如何以及为什么在一些家庭传播得如此之快，而在另一些家庭中却没有，仍有许多悬而未决的问题。根据早期的数据，她说：“这是关于设施的大小和在你的社区中传播的数量。”\n尽管如此，昂罗警告说，尽管研究人员正在努力寻找解决方案，但他们仍然没有得到所有的答案：“这是一个动荡的时代，我们正试图在信息不完整的情况下做出临床和手术决策。”\n随着旧金山开始重新开放，SFCJL的Cmiel感到紧张。“这把我吓死了，”她说。“我实际上认为，既然这座城市正在重新开放，我们就需要收紧政策。”如果病毒在城市中的社区传播开始增加，养老院居民将面临更大的风险。但是，人们可以在没有见到亲人、没有得到锻炼或智力刺激的情况下生活多久呢？“这是我们居民的安全、健康和家庭需求之间的持续平衡，”Cmiel补充道。\n保护老年人不受新冠肺炎伤害的一个更深远的方法是在家里照顾他们，让他们远离长期居住的环境。加州的两项倡议，基于社区的成人服务和多功能老年人服务计划(CBAS和MSSP)，分别为数千名低收入老年人提供服务-其中大多数是有色人种。这些计划提供基本服务，如家庭护理、物理和情感治疗、餐饮和交通，这些服务与养老院居民获得的支持不相上下。\n在MSSP服务的近10,000名老年人中，到目前为止只有3人死于新冠肺炎，克莱尔·拉姆齐(Claire Ramsey)说，她是老年正义组织(Justice In Aging)的高级职员律师，该组织是一家倡导低收入老年人的非营利组织。“这是一种更安全的提供护理的方式，”她评论说。乔多斯指出，在家中接受护理的老年人抑郁症的发生率也较低，认知和身体衰退的速度也较慢。昂罗说，家庭护理通常也是老年人更喜欢的：“人们应该在他们想要得到照顾的地方得到照顾。几乎每个人都会说这是在他们的家里。“。\n倡导者表示，养老院是必要的，但它们不应该成为需要帮助的老年人的默认护理解决方案。拉姆齐说：“应该有一个连续的护理体系，机构护理应该真正保留给需要它的人，他们不可能在自己的家里取得成功和安全。”\n但新冠肺炎的经济效应正迫使各州削减预算；加利福尼亚州和纽约州都提议削减为低收入老年人提供家务帮助的项目，这些项目使他们无法进入机构。在金州，州长加文·纽瑟姆(Gavin Newsom)修订后的预算将取消CBAS和MSSP，并将家庭护理医疗基金的工作时间减少7%。纽约州已经决定限制消费者导向个人援助计划(Consumer Directed Personal Assistant Program)的资格，该计划为残疾或慢性病的纽约人支付家庭护理助手的费用。拉姆齐说，如果没有这些计划，许多老年人将别无选择，只能入住长期护理机构。她补充说：“如果你这样做，实际上会有更多的人死亡。”\n另一个令人担忧的问题是，即使老年人不会被迫进入高风险的生活环境，其他削减也可能危及他们的整体健康。加州的拟议预算还将削减享受医疗服务的资格，并取消可选的医疗福利，如足疗、物理治疗和糖尿病预防计划。无论这种新型冠状病毒的威胁是什么，这些好处对于保持人们的健康和生命都很重要。拉姆齐说：“我们非常担心的一件事是，这些疾病对人们的累积危害有多大。”“这真的是死了1000刀。”\n“连线”正在免费提供有关公共卫生以及如何在冠状病毒大流行期间保护自己的报道。订阅我们的冠状病毒更新时事通讯以获取最新更新，并订阅以支持我们的新闻。\n“你并不孤单”：一名护士如何面对大流行", "note_en": "In mid-March, as San Francisco mayor London Breed issued a citywide stay-at-home order, Peggy Cmiel started getting prepared. Cmiel is the director of clinical operations at the San Francisco Center for Jewish Living, or SFCJL, a 9-acre senior housing complex in the Excelsior neighborhood that includes long-term care facilities, short-term rehab housing, and a memory care wing. The campus houses over 300 elderly residents, members of one of the populations most vulnerable to the deadly and highly infectious  coronavirus that has spread across the globe.\n  Cmiel’s staff stocked up on personal protective equipment and masks for workers and residents; screened everyone who walked in the door for symptoms; hired more staff to clean bathrooms and common areas; and started educating everyone on best practices for containing the virus, like washing hands, avoiding close contact, and keeping an eye out for  symptoms like fevers or coughs. And while nursing homes account for  nearly half of California’s coronavirus fatalities, at the SFCJL not a single resident has tested positive for the virus. “Getting an early start was really the most helpful thing we did,” says Cmiel. “The doorknobs in this facility have never been more clean before.”\n  Not every home was so lucky and so well prepared. Nursing homes across the US have been devastated by  Covid-19. In many states including  Colorado,  Massachusetts, and  Virginia, nursing home resident deaths account for  50 percent or more of coronavirus deaths. But the success of a handful of homes, like SFCJL, might offer their colleagues some clues about how to keep residents safe as the nation braces for a potential second wave of infections.\n Geriatricians and nursing home operators understand why these spaces are so vulnerable. Long-term care facilities are, in many ways, perfect virus incubators. Residents, who are older, frail, and often have comorbidities like heart disease or diabetes, are  more susceptible to severe Covid-19 infections. Many need help performing basic tasks like eating, dressing, or bathing—care that can’t be delivered through a video appointment, making it more likely they could get an infection from the aides who help them, or pass the virus along to their caretakers. Those aides may work at several different facilities, and unknowingly carry it from one home to another.\n  The layout of these facilities also furthers contact in various areas. Most residents share bedrooms, bathrooms, activity rooms, and dining rooms—and staffers share a break room. Those group spaces are designed partly to cut costs, and also to encourage socializing. But shared spaces have also helped spread the virus. Senior facilities do have protocols to handle outbreaks like the flu, but the pandemic arrived so quickly and the SARS-CoV-2 virus is so contagious that many facilities were caught unprepared. “There’s an extent to which this virus just had the upper hand,” says Anna Chodos, a geriatrician at the UCSF. Unlike hospitals, most nursing homes aren&#39;t ordinarily well stocked with gear like masks and gowns, which aren’t necessary when containing the flu.\n  Now, as states slowly start to reopen, senior care facilities are facing a more complicated endeavor: figuring out how to keep residents safe and maintain their quality of life as the Covid-19 pandemic stretches on. Even for facilities like SFCJL, the path forward is far from clear. “How do we safely and slowly introduce visitation and group activities? It’s going to be very careful and very cautious,” says Cmiel. “It will just be very scary to start bringing people back into the community again.”\n Unlike hospitals, most nursing home residents live in these facilities permanently, so staff have to create environments that are comfortable for people’s long-term emotional, social, and physical well-being. But the novel coronavirus has put those important psychological services on hold. “The way of life inside nursing homes is so disrupted,” says Kathleen Unroe, an assistant professor of geriatrics at the University of Indiana. “This is where people live. These are social places.”\n  Or at least they used to be. Many facilities currently are restricting movement as much as possible, keeping people in their rooms and out of shared spaces. Unroe consults for several nursing facilities, and says that at one of them, family members haven’t been allowed to visit for two months. “I have these family members who say to me, ‘I have never been away from my 95-year-old mother for this long in my life,’” she adds. “It’s profound.”\n Unroe also points out that at some facilities, even people who have recovered from Covid-19 can’t always go back to their own rooms. If they continue to shed virus and test positive for weeks after their symptoms have resolved, they have to stay in isolation, which can be scary and upsetting. Some don’t understand why they can’t go back to their usual rooms; “others just feel abandoned and are just confused or mad.”\n  So what helped the SFCJL fare better than many of its counterparts? It’s likely a combination of early action and luck. The facility was one of the first in California to start screening visitors before they entered the premises. They stocked up on protective equipment and were ready to hand out masks to every single resident and staff member. Laguna Honda Hospital and Rehabilitation Center, another long-term care facility in San Francisco that quarantined early, has over 700 beds and has had similar success—reporting only 29 cases among residents and staff. “San Francisco acted really early, so I don’t think it’s by chance,” says Troy Williams, the chief quality officer at Zuckerberg SF General Hospital and Trauma Center, who has been in charge of Laguna Honda&#39;s response to the pandemic.\n UCSF’s Chodos agrees that Laguna Honda’s early moves to lock down the facility and isolate infected residents were integral in abating the outbreak. “They crushed it like a bug,” she says. But she says facilities in San Francisco also got lucky: “Got lucky in that we had great leadership. Got lucky in that we had less virus.” San Francisco issued stay-at-home orders early compared with the rest of the nation, and has seen relatively low infection rates. With less viral spread in the community, it’s less likely that staff would accidentally introduce it into the facility.\n Another factor is likely that both Laguna Honda and SFCJL participated in San Francisco’s universal testing program, mandated by the mayor and spearheaded by the city’s Department of Public Health. Both facilities will continue to test all staff and residents every few weeks, testing more often if they start to see more positive results. (Staff go home every night, and each day teams of physical and respiratory therapists, aides, nurses, and other staff reenter these complexes, potentially bringing new infections with them.) “We have to keep our pedal to the metal,” Williams says, “because it could change.”\n They are also working on other strategies to reduce risk. For example, SFCJL has opened a new wing that accepts patients from local hospitals who are recovering from Covid-19, and who need short-term rehab care before they can go home again. That unit has an entirely separate medical, nursing, and cleaning staff. Patients use a different entrance, and staffers clean the elevator immediately after they are taken to their rooms.\n  For all seniors in nursing homes, whether or not there is a viral outbreak, staying in bed without any physical contact with loved ones is bad for mental and physical health. Normally, facilities have lots of activities and visitors; volunteers play music, bring therapy dogs, or play card games with residents. To adapt during the pandemic, both Laguna Honda and SFCJL staff bought iPads so residents can video call their families. Laguna Honda is now starting to run a few socially distanced activities like bingo games and art classes where participants can be six feet apart and wear masks.\n  Chodos says these measures can help stem the spread of the virus from asymptomatic carriers. With a virus this infectious, she adds, “no precaution is superfluous in any circumstance.”\n But those precautions are only helpful to a point, according to Unroe. “These outbreaks are continuing and they’re going to continue in nursing homes,” she says. There are still a lot of unanswered questions about how and why the virus has spread so quickly in some homes, but not in others. Based on  early data, she says: “It’s about the size of the facility and the amount of spread in your community.”\n Nevertheless, Unroe warns that while researchers are working furiously to figure out solutions, they still don’t have all the answers: “It&#39;s a turbulent time and we&#39;re trying to make clinical and operational decisions with incomplete information.”\n As San Francisco starts to reopen, SFCJL’s Cmiel is nervous. “This scares me to death,” she says. “I actually think we need to tighten up now that the city is reopening.” If community transmission of the virus starts to increase in the city, nursing home residents will be at an even greater risk. But how long can people go without seeing their loved ones, or getting exercise or intellectual stimulation? “It’s this constant balance,” adds Cmiel, “between the safety and health of our residents and the needs of the families.”\n   A much more far-reaching approach to keep older people safe from Covid-19 would be to care for them in their homes, keeping them out of long-term residential settings. Two initiatives in California, Community-Based Adult Services and Multipurpose Senior Services Program (CBAS and MSSP, respectively), serve thousands of low-income seniors—the majority of whom are people of color. The programs provide essential services like at-home nursing care, physical and emotional therapy, meals, and transportation that are on-par with the support received by residents in senior homes.\n Out of the nearly 10,000 seniors served by MSSP, only three have died of Covid-19 so far, says Claire Ramsey, a senior staff attorney at Justice in Aging, a nonprofit that advocates for low-income seniors. “This is a way safer way to provide care,” she comments. Chodos notes that seniors who receive care in their homes also have  lower rates of depression, and experience slower  cognitive and  physical decline. And home care is also usually what seniors would prefer, says Unroe: “People should be cared for where they want to be cared for. Almost anyone would say that is in their homes.”\n Advocates say that nursing homes are necessary, but they shouldn’t be the default care solution for seniors who need some assistance. “There should be a continuum of care, and institutional care should really be reserved for people who need it, who can’t be successful and safe in their own homes,” says Ramsey.\n  But the economic effects of Covid-19 are forcing states to cut budgets; both California and New York have proposed cuts to programs that provide low-income seniors with at-home help that keeps them out of institutions. In the Golden State, Governor Gavin Newsom’s revised budget will eliminate both CBAS and MSSP and reduce the hours of in-home care MediCal funds by 7 percent. New York state already has decided to limit eligibility to the Consumer Directed Personal Assistance Program, which pays for home nursing aides for disabled or chronically ill New Yorkers. Ramsey says that without these programs, many seniors will have no choice but to move into long-term care facilities. “You are literally going to have more people die if you do this,” she adds.\n Another worry is that even if seniors aren’t forced into high-risk living situations, other cuts could jeopardize their overall health. California’s proposed budget would also cut eligibility for MediCal and eliminate optional MediCal benefits like podiatry, physical therapy, and diabetes prevention programs. Those benefits are important for keeping people healthy and alive, regardless of the threat from the novel coronavirus. “One of the things we’re very worried about is how bad these are cumulatively for people,” says Ramsey. “It’s really death by 1,000 cuts.”\n  WIRED is providing  free access to stories about public health and how to protect yourself during the  coronavirus pandemic. Sign up for our  Coronavirus Update newsletter for the latest updates, and  subscribe to support our journalism.\n   “You’re Not Alone”: How one nurse is  confronting the pandemic", "posttime": "2020-05-29 23:04:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "逃脱,homes,居民", "title": "一些疗养院逃脱了新冠肺炎的追捕--他们这样做是对的", "title_en": "Some Nursing Homes Escaped Covid-19–Here's What They Did Right", "transed": 1, "url": "https://www.wired.com/story/some-nursing-homes-escaped-covid-19-heres-what-they-did-right/", "via": "", "real_tags": ["逃脱", "homes", "居民"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004252, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "DuckDuckGo广告牌", "note_en": "DuckDuckGo Billboards", "posttime": "2020-05-29 22:49:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,duckduckgo", "title": "DuckDuckGo广告牌", "title_en": "DuckDuckGo Billboards", "transed": 1, "url": "https://duckduckgo.com/billboards/", "via": "", "real_tags": ["广告"]}, {"category": "", "categoryclass": "", "imagename": "40017bcd42c7d2139a70fa651df20947.png", "infoid": 1004251, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇文章将介绍使用Home Assistant和Node-RED正常化所有media_player音量级别。如果您还没有，我建议您阅读我上一篇关于发送文本到语音通知的博客文章，其中更深入地介绍了此流消耗的可选辅助功能子流。\n使用Amazon Alexa媒体播放器集成功能，此自动化功能可根据一天中的不同时间对我家中的所有音量级别进行标准化，以便将我所有的Amazon Echoand Ecobe Switch+设备带入Home Assistant。\n这是我家里我最喜欢的自动化产品之一，我想你也会喜欢的！我写这个自动化有几个原因：\n我希望所有的演讲者在就寝时间都保持安静。这样可以防止有人在凌晨2点被炸死。\n早上喝完咖啡后，我想把音量调到可以接受的水平。\n自动化允许通过子流进行重用。这意味着你可以在其他情况下触发它，比如朋友结束了，音乐正在播放，增加音量或降低音量。\n少了一件我必须思考的事情，或者不断触摸才能改变的事情。在大流行的今天，这也是你可能要清理的一件事！\n如果您还没有安装Alexa Media Player自定义组件，如果您使用的是Alexa，请安装该组件，否则跳过此部分。\n这个插件令人惊叹，因为它将所有支持Alexa的设备(如Amazon Echoor ecobe Switch+)正常化为可供家庭助理使用的媒体播放器。\n此自动化流通过调用media_player.volume_set服务控制音量级别。我建议您先打开Home Assistant开发人员工具并导航到“服务”选项卡，然后对其进行测试。\n接下来，开始在media_player上播放一些音乐，并使用以下有效负载调用media_player.volume_set服务：\n如果您没有听到音量变化，请尝试使用不同的VOLUME_LEVEL，以防设备已处于该音量级别。如果没有，则停止并检查日志。这将有助于诊断设备无法工作的原因，并在继续之前为您节省大量时间。\n我强烈建议添加多个输入布尔来控制特定自动化或所有自动化是否可以运行。在维护的情况下，能够打开或关闭特定的自动化或所有的自动化总是很好的。下面是此Automation流中使用的三个INPUT_BOOLEAN。\nAUTOMATION_ENABLE：名称：启用自动化图标：mdi:home-automationautomation_normalize_volume：名称：AUTOMATION-全天自动规格化音量图标：mdi：VOLUME-HUTOMATION_NOTIFICATIONS：名称：触发自动化时通知图标：mdi：HOME-AUTOMANIZATION。\n此子流程将获得当前设备的音量级别，比较当前状态和所需状态。如果需要更改，它将调用所需的服务来更改设备音量级别。\n然后，我创建了一个具有状态节点、一个输入和一个输出的新子流。此子流程(可选)取决于“发送自动语音通知”子流程。\nGraph TDInputNode(Input)--&gt；ACurrentStateNode(FAS：FA-数据库获取当前音量级别)ACurrentStateNode--&gt；BFunctionNode(FAS：FA-代码设置音量级别有效负载)BFunctionNode--&gt；CCallServiceNode(FAS：FA-PLAY设置音量级别)BFunctionNode--&gt；DCallSubflowNode。StatusOutputNode(Status)style StatusNode Fill：#ECF5Fstyle StatusOutputNode Fill：#FAFBstyle InputNode Fill：#FAFBstyle ACurrentStateNode Fill：#66ACFDstyle BFunctionNode Fill：#FBB68Fstyle CCallServiceNode Fill：#66ACFDstyle DCallSubflowNode Fill：#FF75A1 style OutputNode Fill：#FAFAFB。\n让我们分解一下子流。传入的消息被传递到Get Current Volume Level Current State节点，以使用实体填充msg.data。然后将其传递到设置音量级别有效负载节点，该节点检查是否需要进行任何更改以满足所需的音量级别，并输出文本到语音(TTS)状态消息。如果需要更改，设置音量级别节点将调用media_player.volume_set服务。\n以下是Set Volume Level PayloadFunction节点中包含的JavaScript代码，用于仅在需要时智能调整音量。\nconst entity=msg.payload&amp；&amp；msg.payload.entity_id；const Attributes=msg.data&amp；&amp；msg.data.tributesif(！entity||！tributes){node.status({Fill：&#34；red&#34；，Shape：&#34；dot&#34；，text：&#34；Invalid Volume payload&#34；})；返回[null，null]；}const desired_({填充：&#34；红色&#34；，形状：&#34；点&#34；，文本：&#34；无效卷有效负载&#34；})；返回[null，null]；}const desired_。0.0||desired_volume_level&gt；1.0){let message=&#34；音量级别必须在0到1之间。&#34；；node.status({Fill：&#34；red&#34；，Shape：&#34；dot&#34；，text：message})；node.error(Message)；return[null，{payload：{entity_id：entity，message：message}}]；}if(desired_volume_level==属性.volume_level)。音量级别已处于所需级别。&#34；；node.status({填充：&#34；灰色&#34；，形状：&#34；点&#34；，文本：消息})；node.log(Message)；return[null，{payload：{entity_id：entity，message：message}}]；}const volumePayload={payload：{data：{entity_id：entity，volume_level：desired_volume_level}；let message=。+(RESENDED_VOLUME_LEVEL*100)+&#34；百分比.&#34；；const Speech Payload={payload：{entity_id：entity，message：message}}；node.status({Fill：&#34；green&#34；，form：&#34；dot&#34；，text：message})；return[volumePayload，talk Payload]；\n正如您所看到的，它将输出一个友好的语音通知有效负载，该负载将被发送到Send Automation Speech Notification子流。如果您没有使用Alexa_MEDIA_Player Home Assistant插件，您可能需要更新“设置音量级别有效负载”功能节点以获取您期望的音量范围。\n您可以通过传递具有以下有效负载的消息对象来触发此子流。我建议使用Inject Node来测试这一点。\n请注意，对于我的Alexa演讲者。我使用介于[0.0..0.10]之间的音量级别。要静音，请传递0.0。\n该子流程将获取所有MEDIA_Player‘，然后将它们逐个发送到设置的音量级子流程。\n如果您没有使用Alexa，您可能需要调整获取所有媒体播放器节点，因为它将返回具有特定功能属性的所有设备，该属性表示我支持更改音量级别。\nGraph TDInputNode(Input)--&gt；AFunctionNode(FAS：FA代码解析音量级别)AFunctionNode--&gt；BGetEntiesNode(FAS：FA-搜索获取所有媒体播放器)BGetEntiesNode--&gt；CChangeNode(FAS：FA-随机设置音量级别有效负载)CChangeNode--&gt；DSubflowNode(FAS：FA-随机设置音量级别有效负载)CChangeNode--&gt；DSubflowNode(FAS：FA-随机设置音量级别有效负载)CChangeNode--&gt；DSubflowNode(FAS。StatusOutputNode(Status)style StatusNode Fill：#ECF5Fstyle StatusOutputNode Fill：#FAFBstyle InputNode Fill：#FAFBstyle AFunctionNode Fill：#FBB68Fstyle BGetEntiesNode Fill：#66ACFDstyle CChangeNode Fill：#FEA530style DSubflowNode Fill：#FF75A1 style OutputNode Fill：#FAFAFBlinkStingNode Fill。\n您可以通过传递具有以下浮点(例如0.1)有效负载的消息对象来触发此子流。我建议使用Inject Node来测试这一点。\n此流将前面的两个子流结合在一起，以基于一天中的时间将所有成交量级别正常化。在我家，我把早上9点到晚上9点的水平设置为30%，否则我设置为10%。\n为了让流在一天中的不同时间设置音量级别，我使用BigTimer节点，打开时间为09：00，关闭时间为21：00。然后我将开味精设为0.3，关味精设为1。当计时器打开和关闭时，它将检查我的自动化标志是否打开。如果是，它将枚举所有媒体设备，并根据计时器输出消息(例如，.1或.3)设置音量。\nGraph TDABigTimerNode(FAS：FA-Clock Normize Volume)--&gt；B CurrentStateNode(FAS：FA-启用数据库自动化？)B CurrentStateNode--&gt；CCurrentStateNode(FAS：FA-数据库标准化音量级别？)CCurrentStateNode--&gt；DRbeNode(FAS：FA-滚动只允许更改的值)DRbeNode--&。StatusOutputNode(Status)style StatusNode Fill：#ECF5FFstyle StatusOutputNode Fill：#FAFBstyle ABigTimerNode Fill：#3DB39Fstyle B CurrentStateNode Fill：#66ACFDstyle CCurrentStateNode Fill：#66ACFDDbeNode Fill：#FEB95Estyle ECallSubflow Fill：#FF75A1 linkStyle默认笔划宽度：2px，Fill。\n[{&#34；id&#34；：&#34；7a62a2d3.c0f4a4&#34；，&#34；类型&#34；子流&#34；，&#34；名称&#34；：&#34；发送自动化语音通知&#34；，&#34；信息&#34；：&#34；&#34；，&#34；类别&#34；：&#34；&#34；，&。：[{&#34；x&#34；：60，&#34；y&#34；：100，&#34；y&#34；：[{&#34；id&#34；：&#34；87411254.a6ed18&#34；}]}]，&#34；out&#34；：[{&#34；x&#34；：1120，&#34；y&#34；：100，&#34；wire&#34；：[{&#34；id&#34；：&#34；d44cc51a.be0668&#34；，&#34；port&#34；：0}]}]，&#34；状态&#34；：{&#34；x&#34；：220，&#34；y&#34；：40，&#34；wire&#34；：：[{&#34；id&#34；：&#34；aef53056.742438。port&#34；：0}]}}，{&#34；id&#34；：&#34；89300b1.595bcf8&#34；，&#34；类型&#34；：&#34；函数&#34；，&#34；z&#34；：：&#34；7a62a2d3.c0f4a4&#34；，&#34；名称&#34；：&#34；设置语音负载&#34；，&。Const Entity=flow.get(\\&#34；$parent.speech_entity_id\\&#34；)||(msg.payload&amp；&amp；msg.payload.entity_id)||\\&#34；media_player.office_echo_plus\\&#34；；\\nconst消息=(msg.payload&amp；&amp；msg.payload.message)||\\&#34；自动化未提供消息\\&#34；；\\nconst公告=msg.payload&amp；&amp；msg.payload.宣告；\\n\\n如果(公告){\\n node.status({填充：\\&#34；绿色\\&#34；，形状：\\&#34；点\\&#34；，文本：\\&#34；公告消息：\\&#34；+消息})；\\n返回{\\n有效负载：{\\n数据：{\\n消息：消息，\\n数据：{\\&#34；类型\\&#34；：\\&#34；公告\\&#34；，\\&#34；方法\\&#34；：\\&#34；全部\\&#34；}，\\n目标：！！实体？[实体]：[]\\n}\\n}\\n}；\\n}\\n\\nnode.status({填充：\\&#34；绿色\\&#34；，形状：\\&#34；点\\&#34；，文本：\\&#34；TTS消息：\\&#34；+消息})；\\n返回{\\n负载：{\\n数据：{\\n消息：消息，\\n数据：{type：\\&#34；TTS\\&#34；}，\\n目标：[实体]\\n}\\n}\\n}；&#34；，&#34；输出&#34；：1，&#34；noerr&#34；：0，&#34；x&#34；：700，&#34；y&#34；：100，&#34；wire&#34；：[[&#34；d44cc51a.be0668&#34；]]}，{&#34；id&#34；：d44cc51a.be0668&#34；，&#34；类型&#34；：&#34；api-call-service&#34；，&#34；7a62a2d3.c0f4a4&#34；，&#34；name&#34；：&#34；发送语音通知&#34；，&#34；server&#34；：&#34；61956bd4.93dff。：false，&#34；service_domain&#34；：&#34；Notify&#34；，&#34；service&#34；：&#34；Alexa_media&#34；，&#34；entityId&#34；：&#34；&#34；，&#34；data&#34；：&#34；&#34；，&#34；dataType&#34；：&#34；json&#34；，&#34；mergecontext。&#34；，&#34；output_location&#34；：&#34；payload&#34；，&#34；output_location_type&#34；：&#34；msg&#34；，&#34；mustack heAltTags&#34；：false，&#34；x&#34；：950，&#34；y&#34；：100，&#34；wire&#34；：[[]]}，{&#34；id&34；：&#34；6add9bc6.4c3624&#34；，&#34；类型&#34；：&#34；api-c", "note_en": "This post is going to cover normalizing all  media_player volume levels with Home Assistant and  Node-RED.If you haven’t already, I’d recommend reading my previous blog post on sending Text-to-Speech notifications whichdives a bit deeper on the optional accessibility Subflow this Flow consumes.\n This automation normalizes all volume levels in my home based on the time of dayusing the Amazon Alexa Media Player Integrationto bring in all my Amazon Echoand  ecobee Switch+devices into Home Assistant.\n This is one of my favorite automations in my house and I think you will enjoyit too! I wrote this automation for several reasons:\n I wanted all speakers to be quiet at bed time. This prevents someone fromgetting blasted at 2:00 am in the morning.\n In the morning after I’ve had my cup of coffee, I want to increase the volumeto an acceptable level.\n Automation allows for reuse via sub-flows. This means you can trigger it forother use cases like friends are over and music is playing, increase ordecrease the volume.\n One less thing I have to think about, or constantly touch to change. Intodays pandemic, this is also one less thing you potentially have to clean!\n   If you haven’t done so already, install the Alexa Media Player Custom Componentif you are using Alexa, otherwise skip this section.\n This addon is amazing as it normalizes all of your Alexa enabled devices suchas the Amazon Echoor  ecobee Switch+into a  media_player that can be used by Home Assistant.\n  This Automation Flow controls the volume levels by calling the media_player.volume_set service. I’d recommend testing it first by openingthe Home Assistant Developer tools and navigating to the Services tab.\n Next, start playing some music on your  media_player and call the media_player.volume_set service with a payload of:\n  If you don’t hear a volume change, try a different  volume_level in case thethe device is already at that level. If it’s not then stop and check the logs.This will help diagnose why the device isn’t working and save you lots of timebefore continuing.\n  I highly recommend adding multiple Input Booleansthat controls if a specific automation or all automations can run. It’s alwaysnice to be able to turn on or off a specific automation or all in the case ofmaintenance. Here are the three  input_booleans that are used in thisAutomation Flow.\n  automation_enable: name: Enable Automations icon: mdi:home-automationautomation_normalize_volume: name: Automation - Automatically Normalize Volume throughout the day icon: mdi:volume-highautomation_notifications: name: Notify when an automation is triggered icon: mdi:home-automation\n  This Subflow will get the current devices volume level, compare the current anddesired state. If changes are required, it will call the required service tochange the devices volume level.\n I then create a new Subflow with a status node, one input and one output. ThisSubflow optionally depends on the  Send Automation Speech Notification Subflow.\n graph TDInputNode(Input) --&gt; ACurrentStateNode(fas:fa-database Get Current Volume Level)ACurrentStateNode --&gt; BFunctionNode(fas:fa-code Set Volume Level Payload)BFunctionNode --&gt; CCallServiceNode(fas:fa-play Set Volume Level)BFunctionNode --&gt; DCallSubflowNode(fas:fa-sliders-h Send Automation Speech Notification)CCallServiceNode --&gt; OutputNode(Output 1)StatusNode(fas:fa-heartbeat Status: All) --&gt; StatusOutputNode(Status)style StatusNode fill:#ECF5FFstyle StatusOutputNode fill:#FAFAFBstyle InputNode fill:#FAFAFBstyle ACurrentStateNode fill:#66ACFDstyle BFunctionNode fill:#FBB68Fstyle CCallServiceNode fill:#66ACFDstyle DCallSubflowNode fill:#FF75A1style OutputNode fill:#FAFAFBlinkStyle default stroke-width:2px,fill:none,stroke:#CCD0D4\n Let’s break down the Subflow. The incoming message gets passed to the Get Current Volume Level Current State node to populate  msg.data with theentity. This is then passed to the  Set Volume Level Payload node which checksto see if any changes are required to meet the desired volume level and outputsText-to-Speech (TTS) status messages. If changes are required, the Set Volume Level node will call the  media_player.volume_set service.\n Here is the JavaScript code contained in the  Set Volume Level PayloadFunction node to smartly adjust the volume only if it is needed.\n const entity = msg.payload &amp;&amp; msg.payload.entity_id;const attributes = msg.data &amp;&amp; msg.data.attributesif (!entity || !attributes) { node.status({ fill: &#34;red&#34;, shape: &#34;dot&#34;, text: &#34;Invalid volume payload&#34; }); return [null, null];}const desired_volume_level = msg.payload.volume_level || 0;if (desired_volume_level &lt; 0.0 || desired_volume_level &gt; 1.0) { let message = &#34;Volume level must be between 0 and 1.&#34;; node.status({ fill: &#34;red&#34;, shape: &#34;dot&#34;, text: message }); node.error(message); return [null, { payload: { entity_id: entity, message: message } }];}if (desired_volume_level === attributes.volume_level) { let message = &#34;Volume level is already at the desired level.&#34;; node.status({ fill: &#34;grey&#34;, shape: &#34;dot&#34;, text: message }); node.log(message); return [null, { payload: { entity_id: entity, message: message } }];}const volumePayload = { payload: { data: { entity_id: entity, volume_level: desired_volume_level } }};let message = &#34;Setting Volume Level to &#34; + (desired_volume_level * 100) + &#34; percent.&#34;;const speechPayload = { payload: { entity_id: entity, message: message }};node.status({ fill: &#34;green&#34;, shape: &#34;dot&#34;, text: message });return [volumePayload, speechPayload];\n As you an see it will output a friendly speech notification payload that willbe sent to the  Send Automation Speech Notification Subflow. If you are notusing the  alexa_media_player Home Assistant addon, you may want to update theyou’ll want to update  Set Volume Level Payload Function node to take in avolume range you are expecting.\n You can trigger this Subflow by passing a message object with thefollowing payload. I recommend using a  Inject Nodeto test this out.\n  Please note, for my Alexa speakers. I use a volume level between the range of [0.0..0.10). To mute, pass  0.0.\n  This subflow will get all  media_player’ and then send them one by one to the Set Volume Level Subflow.\n If you are not using Alexa, you may need to tweak the  Get All Media Playersnode as it’s returning all devices that have a specific feature attributewhich says I support changing the volume level.\n graph TDInputNode(Input) --&gt; AFunctionNode(fas:fa-code Parse Volume Level)AFunctionNode --&gt; BGetEntitiesNode(fas:fa-search Get All Media Players)BGetEntitiesNode --&gt; CChangeNode(fas:fa-random Set Volume Level Payload)CChangeNode --&gt; DSubflowNode(fas:fa-sliders-h Set Volume Level)DSubflowNode --&gt; OutputNode(Output)StatusNode(fas:fa-heartbeat Status: All) --&gt; StatusOutputNode(Status)style StatusNode fill:#ECF5FFstyle StatusOutputNode fill:#FAFAFBstyle InputNode fill:#FAFAFBstyle AFunctionNode fill:#FBB68Fstyle BGetEntitiesNode fill:#66ACFDstyle CChangeNode fill:#FEA530style DSubflowNode fill:#FF75A1style OutputNode fill:#FAFAFBlinkStyle default stroke-width:2px,fill:none,stroke:#CCD0D4\n You can trigger this Subflow by passing a message object with thefollowing  float (e.g.  0.1) payload. I recommend using a  Inject Nodeto test this out.\n  This flow brings the two previous sub flows together to normalize all volumelevels based on the time of the day. In my home, I set the level to 30% from9:00am to 9:00pm, otherwise I set to 10%.\n To have the flow set the volume levels at different times of the day, I use the BigTimer Nodewith an  On Time of  09:00 and a  Off Time of  21:00. Then I set the ON Msg to  .3 and a  OFF Msg to  .1. When the timer turns on and turns off,it will check to see if my automation flags are turned on. If they are, it willenumerate over all media devices and set the volume based on the timers outputmessage (e.g.,  .1 or  .3).\n graph TDABigTimerNode(fas:fa-clock Normalize Volume) --&gt; BCurrentStateNode(fas:fa-database Automations Enabled?)BCurrentStateNode --&gt; CCurrentStateNode(fas:fa-database Normalize Volume Levels?)CCurrentStateNode --&gt; DRbeNode(fas:fa-scroll Only allow changed values)DRbeNode --&gt; ECallSubflow(fas:fa-sliders-h Set Volume Level on All Media Devices Subflow)StatusNode(fas:fa-heartbeat Status: All) --&gt; StatusOutputNode(Status)style StatusNode fill:#ECF5FFstyle StatusOutputNode fill:#FAFAFBstyle ABigTimerNode fill:#3DB39Fstyle BCurrentStateNode fill:#66ACFDstyle CCurrentStateNode fill:#66ACFDstyle DRbeNode fill:#FEB95Estyle ECallSubflow fill:#FF75A1linkStyle default stroke-width:2px,fill:none,stroke:#CCD0D4\n  [ { &#34;id&#34;: &#34;7a62a2d3.c0f4a4&#34;, &#34;type&#34;: &#34;Subflow&#34;, &#34;name&#34;: &#34;Send Automation Speech Notification&#34;, &#34;info&#34;: &#34;&#34;, &#34;category&#34;: &#34;&#34;, &#34;in&#34;: [ { &#34;x&#34;: 60, &#34;y&#34;: 100, &#34;wires&#34;: [ { &#34;id&#34;: &#34;87411254.a6ed18&#34; } ] } ], &#34;out&#34;: [ { &#34;x&#34;: 1120, &#34;y&#34;: 100, &#34;wires&#34;: [ { &#34;id&#34;: &#34;d44cc51a.be0668&#34;, &#34;port&#34;: 0 } ] } ], &#34;status&#34;: { &#34;x&#34;: 220, &#34;y&#34;: 40, &#34;wires&#34;: [ { &#34;id&#34;: &#34;aef53056.742438&#34;, &#34;port&#34;: 0 } ] } }, { &#34;id&#34;: &#34;89300b1.595bcf8&#34;, &#34;type&#34;: &#34;function&#34;, &#34;z&#34;: &#34;7a62a2d3.c0f4a4&#34;, &#34;name&#34;: &#34;Set Speech Payload&#34;, &#34;func&#34;: &#34;const entity = flow.get(\\&#34;$parent.speech_entity_id\\&#34;) || (msg.payload &amp;&amp; msg.payload.entity_id) || \\&#34;media_player.office_echo_plus\\&#34;;\\nconst message = (msg.payload &amp;&amp; msg.payload.message) || \\&#34;Automation provided no message\\&#34;;\\nconst announcement = msg.payload &amp;&amp; msg.payload.announcement;\\n\\nif (announcement) {\\n node.status({ fill: \\&#34;green\\&#34;, shape: \\&#34;dot\\&#34;, text: \\&#34;Announce message:\\&#34; + message });\\n return {\\n payload:{\\n data: {\\n message: message,\\n data: { \\&#34;type\\&#34;: \\&#34;announce\\&#34;, \\&#34;method\\&#34;: \\&#34;all\\&#34; },\\n target: !!entity ? [entity] : []\\n }\\n }\\n };\\n}\\n\\nnode.status({ fill: \\&#34;green\\&#34;, shape: \\&#34;dot\\&#34;, text: \\&#34;TTS message:\\&#34; + message });\\nreturn {\\n payload:{\\n data: {\\n message: message,\\n data: { type: \\&#34;tts\\&#34; },\\n target: [entity]\\n }\\n }\\n};&#34;, &#34;outputs&#34;: 1, &#34;noerr&#34;: 0, &#34;x&#34;: 700, &#34;y&#34;: 100, &#34;wires&#34;: [ [ &#34;d44cc51a.be0668&#34; ] ] }, { &#34;id&#34;: &#34;d44cc51a.be0668&#34;, &#34;type&#34;: &#34;api-call-service&#34;, &#34;z&#34;: &#34;7a62a2d3.c0f4a4&#34;, &#34;name&#34;: &#34;Send Speech Notification&#34;, &#34;server&#34;: &#34;61956bd4.93df44&#34;, &#34;version&#34;: 1, &#34;debugenabled&#34;: false, &#34;service_domain&#34;: &#34;notify&#34;, &#34;service&#34;: &#34;alexa_media&#34;, &#34;entityId&#34;: &#34;&#34;, &#34;data&#34;: &#34;&#34;, &#34;dataType&#34;: &#34;json&#34;, &#34;mergecontext&#34;: &#34;&#34;, &#34;output_location&#34;: &#34;payload&#34;, &#34;output_location_type&#34;: &#34;msg&#34;, &#34;mustacheAltTags&#34;: false, &#34;x&#34;: 950, &#34;y&#34;: 100, &#34;wires&#34;: [ [] ] }, { &#34;id&#34;: &#34;6add9bc6.4c3624&#34;, &#34;type&#34;: &#34;api-current-state&#34;, &#34;z&#34;: &#34;7a62a2d3.c0f4a4&#34;, &#34;name&#34;: &#34;Speech Notifications?&#34;, &#34;server&#34;: &#34;61956bd4.93df44&#34;, &#34;version&#34;: 1, &#34;outputs&#34;: 2, &#34;halt_if&#34;: &#34;true&#34;, &#34;halt_if_type&#34;: &#34;bool&#34;, &#34;halt_if_compare&#34;: &#34;is&#34;, &#34;override_topic&#34;: false, &#34;entity_id&#34;: &#34;input_boolean.automation_notifications&#34;, &#34;state_type&#34;: &#34;habool&#34;, &#34;state_location&#34;: &#34;&#34;, &#34;override_payload&#34;: &#34;none&#34;, &#34;entity_location&#34;: &#34;&#34;, &#34;override_data&#34;: &#34;none&#34;, &#34;blockInputOverrides&#34;: false, &#34;x&#34;: 440, &#34;y&#34;: 140, &#34;wires&#34;: [ [ &#34;89300b1.595bcf8&#34; ], [] ], &#34;outputLabels&#34;: [ &#34;&#34;, &#34;enabled&#34; ] }, { &#34;id&#34;: &#34;aef53056.742438&#34;, &#34;type&#34;: &#34;status&#34;, &#34;z&#34;: &#34;7a62a2d3.c0f4a4&#34;, &#34;name&#34;: &#34;&#34;, &#34;scope&#34;: null, &#34;x&#34;: 100, &#34;y&#34;: 40, &#34;wires&#34;: [ [] ] }, { &#34;id&#34;: &#34;87411254.a6ed18&#34;, &#34;type&#34;: &#34;function&#34;, &#34;z&#34;: &#34;7a62a2d3.c0f4a4&#34;, &#34;name&#34;: &#34;Check for overrides&#34;, &#34;func&#34;: &#34;const alwaysSpeak = msg.payload &amp;&amp; msg.payload.announcement\\nif (alwaysSpeak) {\\n return [msg, null];\\n} else {\\n return [null, msg];\\n}&#34;, &#34;outputs&#34;: 2, &#34;noerr&#34;: 0, &#34;x&#34;: 210, &#34;y&#34;: 100, &#34;wires&#34;: [ [ &#34;89300b1.595bcf8&#34; ], [ &#34;6add9bc6.4c3624&#34; ] ], &#34;outputLabels&#34;: [ &#34;Bypass notification&#34;, &#34;Check for notifications&#34; ] }, { &#34;id&#34;: &#34;974adda.d2ea92&#34;, &#34;type&#34;: &#34;Subflow&#34;, &#34;name&#34;: &#34;Set Volume Level&#34;, &#34;info&#34;: &#34;Set Volume Level&#34;, &#34;category&#34;: &#34;&#34;, &#34;in&#34;: [ { &#34;x&#34;: 80, &#34;y&#34;: 120, &#34;wires&#34;: [ { &#34;id&#34;: &#34;4c86fd47.0875e4&#34; } ] } ], &#34;out&#34;: [ { &#34;x&#34;: 960, &#34;y&#34;: 100, &#34;wires&#34;: [ { &#34;id&#34;: &#34;263d05a1.5b6672&#34;, &#34;port&#34;: 0 } ] } ], &#34;status&#34;: { &#34;x&#34;: 240, &#34;y&#34;: 40, &#34;wires&#34;: [ { &#34;id&#34;: &#34;7a662cd5.162a24&#34;, &#34;port&#34;: 0 } ] } }, { &#34;id&#34;: &#34;563c252e.ce31e4&#34;, &#34;type&#34;: &#34;function&#34;, &#34;z&#34;: &#34;974adda.d2ea92&#34;, &#34;name&#34;: &#34;Set Volume Level Payload&#34;, &#34;func&#34;: &#34;const entity = msg.payload &amp;&amp; msg.payload.entity_id;\\nconst attributes = msg.data &amp;&amp; msg.data.attributes\\nif (!entity || !attributes) {\\n node.status({ fill: \\&#34;red\\&#34;, shape: \\&#34;dot\\&#34;, text: \\&#34;Invalid volume payload\\&#34; });\\n return [null, null];\\n}\\n\\nconst desired_volume_level = msg.payload.volume_level || 0;\\nif (desired_volume_level &lt; 0.0 || desired_volume_level &gt; 1.0) {\\n let message = \\&#34;Volume level must be between 0 and 1.\\&#34;; \\n node.status({ fill: \\&#34;red\\&#34;, shape: \\&#34;dot\\&#34;, text: message });\\n node.error(message);\\n \\n return [null, { \\n payload: {\\n entity_id: entity,\\n message: message\\n }\\n }];\\n}\\n\\nif (desired_volume_level === attributes.volume_level) {\\n let message = \\&#34;Volume level is already at the desired level.\\&#34;; \\n node.status({ fill: \\&#34;grey\\&#34;, shape: \\&#34;dot\\&#34;, text: message });\\n node.log(message);\\n return [null, { \\n payload: {\\n entity_id: entity,\\n message: message\\n }\\n }];\\n}\\n\\nconst volumePayload = { \\n payload: {\\n data: {\\n entity_id: entity,\\n volume_level: desired_volume_level\\n } \\n }\\n};\\n\\nlet message = \\&#34;Setting Volume Level to \\&#34; + (desired_volume_level * 100) + \\&#34; percent.\\&#34;;\\nconst speechPayload = { \\n payload: {\\n entity_id: entity,\\n message: message\\n }\\n};\\n\\nnode.status({ fill: \\&#34;green\\&#34;, shape: \\&#34;dot\\&#34;, text: message });\\nreturn [volumePayload, speechPayload];&#34;, &#34;outputs&#34;: 2, &#34;noerr&#34;: 0, &#34;x&#34;: 510, &#34;y&#34;: 120, &#34;wires&#34;: [ [ &#34;263d05a1.5b6672&#34; ], [ &#34;b41308c0.f41e9&#34; ] ], &#34;inputLabels&#34;: [ &#34;Volume Percentage&#34; ], &#34;outputLabels&#34;: [ &#34;Volume Level Payload&#34;, &#34;Speech Notification Payload&#34; ] }, { &#34;id&#34;: &#34;263d05a1.5b6672&#34;, &#34;type&#34;: &#34;api-call-service&#34;, &#34;z&#34;: &#34;974adda.d2ea92&#34;, &#34;name&#34;: &#34;Set Volume Level&#34;, &#34;server&#34;: &#34;61956bd4.93df44&#34;, &#34;version&#34;: 1, &#34;debugenabled&#34;: false, &#34;service_domain&#34;: &#34;media_player&#34;, &#34;service&#34;: &#34;volume_set&#34;, &#34;entityId&#34;: &#34;&#34;, &#34;data&#34;: &#34;&#34;, &#34;dataType&#34;: &#34;json&#34;, &#34;mergecontext&#34;: &#34;&#34;, &#34;output_location&#34;: &#34;payload&#34;, &#34;output_location_type&#34;: &#34;msg&#34;, &#34;mustacheAltTags&#34;: false, &#34;x&#34;: 770, &#34;y&#34;: 100, &#34;wires&#34;: [ [] ] }, { &#34;id&#34;: &#34;b41308c0.f41e9&#34;, &#34;type&#34;: &#34;Subflow:7a62a2d3.c0f4a4&#34;, &#34;z&#34;: &#34;974adda.d2ea92&#34;, &#34;name&#34;: &#34;&#34;, &#34;env&#34;: [], &#34;x&#34;: 830, &#34;y&#34;: 160, &#34;wires&#34;: [ [] ] }, { &#34;id&#34;: &#34;4c86fd47.0875e4&#34;, &#34;type&#34;: &#34;api-current-state&#34;, &#34;z&#34;: &#34;974adda.d2ea92&#34;, &#34;name&#34;: &#34;Get Current Volume Level&#34;, &#34;server&#34;: &#34;61956bd4.93df44&#34;, &#34;version&#34;: 1, &#34;outputs&#34;: 1, &#34;halt_if&#34;: &#34;&#34;, &#34;halt_if_type&#34;: &#34;str&#34;, &#34;halt_if_compare&#34;: &#34;is&#34;, &#34;override_topic&#34;: true, &#34;entity_id&#34;: &#34;&#34;, &#34;state_type&#34;: &#34;str&#34;, &#34;state_location&#34;: &#34;&#34;, &#34;override_payload&#34;: &#34;none&#34;, &#34;entity_location&#34;: &#34;data&#34;, &#34;override_data&#34;: &#34;msg&#34;, &#34;blockInputOverrides&#34;: false, &#34;x&#34;: 250, &#34;y&#34;: 120, &#34;wires&#34;: [ [ &#34;563c252e.ce31e4&#34; ] ] }, { &#34;id&#34;: &#34;7a662cd5.162a24&#34;, &#34;type&#34;: &#34;status&#34;, &#34;z&#34;: &#34;974adda.d2ea92&#34;, &#34;name&#34;: &#34;&#34;, &#34;scope&#34;: null, &#34;x&#34;: 120, &#34;y&#34;: 40, &#34;wires&#34;: [ [] ] }, { &#34;id&#34;: &#34;76be143e.dbb0e4&#34;, &#34;type&#34;: &#34;Subflow&#34;, &#34;name&#34;: &#34;Set Volume Level on All Media Devices&#34;, &#34;info&#34;: &#34;&#34;, &#34;category&#34;: &#34;&#34;, &#34;in&#34;: [ { &#34;x&#34;: 100, &#34;y&#34;: 120, &#34;wires&#34;: [ { &#34;id&#34;: &#34;642c5f33.bd92a8&#34; } ] } ], &#34;out&#34;: [ { &#34;x&#34;: 1120, &#34;y&#34;: 120, &#34;wires&#34;: [ { &#34;id&#34;: &#34;15d5ddae.8f64c2&#34;, &#34;port&#34;: 0 } ] } ], &#34;env&#34;: [], &#34;color&#34;: &#34;#DDAA99&#34;, &#34;status&#34;: { &#34;x&#34;: 1120, &#34;y&#34;: 40, &#34;wires&#34;: [ { &#34;id&#34;: &#34;ba88f8d5.b5d648&#34;, &#34;port&#34;: 0 }, { &#34;id&#34;: &#34;15d5ddae.8f64c2&#34;, &#34;port&#34;: 0 } ] } }, { &#34;id&#34;: &#34;f467a711.24ca3&#34;, &#34;type&#34;: &#34;ha-get-entities&#34;, &#34;z&#34;: &#34;76be143e.dbb0e4&#34;, &#34;server&#34;: &#34;61956bd4.93df44&#34;, &#34;name&#34;: &#34;Get All Media Players&#34;, &#34;rules&#34;: [ { &#34;property&#34;: &#34;attributes.supported_features&#34;, &#34;logic&#34;: &#34;is&#34;, &#34;value&#34;: &#34;56253&#34;, &#34;valueType&#34;: &#34;num&#34; }, { &#34;property&#34;: &#34;attributes.available&#34;, &#34;logic&#34;: &#34;is&#34;, &#34;value&#34;: &#34;true&#34;, &#34;valueType&#34;: &#34;bool&#34; } ], &#34;output_type&#34;: &#34;split&#34;, &#34;output_empty_results&#34;: true, &#34;output_location_type&#34;: &#34;msg&#34;, &#34;output_location&#34;: &#34;payload&#34;, &#34;output_results_count&#34;: 1, &#34;x&#34;: 480, &#34;y&#34;: 120, &#34;wires&#34;: [ [ &#34;1fe46c89.0e0543&#34; ] ] }, { &#34;id&#34;: &#34;1fe46c89.0e0543&#34;, &#34;type&#34;: &#34;change&#34;, &#34;z&#34;: &#34;76be143e.dbb0e4&#34;, &#34;name&#34;: &#34;Set Volume Level Payload&#34;, &#34;rules&#34;: [ { &#34;t&#34;: &#34;set&#34;, &#34;p&#34;: &#34;payload.volume_level&#34;, &#34;pt&#34;: &#34;msg&#34;, &#34;to&#34;: &#34;volume_level&#34;, &#34;tot&#34;: &#34;flow&#34; } ], &#34;action&#34;: &#34;&#34;, &#34;property&#34;: &#34;&#34;, &#34;from&#34;: &#34;&#34;, &#34;to&#34;: &#34;&#34;, &#34;reg&#34;: false, &#34;x&#34;: 730, &#34;y&#34;: 120, &#34;wires&#34;: [ [ &#34;15d5ddae.8f64c2&#34; ] ] }, { &#34;id&#34;: &#34;642c5f33.bd92a8&#34;, &#34;type&#34;: &#34;function&#34;, &#34;z&#34;: &#34;76be143e.dbb0e4&#34;, &#34;name&#34;: &#34;Parse Volume Level&#34;, &#34;func&#34;: &#34;const volumeLevel = parseFloat(msg.payload);\\nnode.status({ fill: \\&#34;green\\&#34;, shape: \\&#34;dot\\&#34;, text: \\&#34;Volume Level: \\&#34; + volumeLevel });\\nflow.set(\\&#34\n......", "posttime": "2020-05-29 22:48:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "node,home,fill", "title": "如何使用Node-RED将家庭音量级别正常化", "title_en": "How-to normalize home volume levels with Node-RED", "transed": 1, "url": "https://blakeniemyjski.com/blog/how-to-normalize-home-volume-levels-with-node-red/", "via": "", "real_tags": ["node", "home", "fill"]}, {"category": "", "categoryclass": "", "imagename": "21947a8813f36b4bf869d7fe5756747c.png", "infoid": 1004250, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "想知道如何在新冠肺炎大流行期间安全投票？我们将指导您完成邮寄投票的过程，这样您就可以在即将到来的选举中安全投票并节省时间。\n我们将指导您完成邮寄投票的过程，这样您就可以在即将到来的选举中安全投票并节省时间。", "note_en": "Wondering how to vote safely during the COVID-19 pandemic? We’ll guide you through the vote by mail process so that you can vote safely and save time in the upcoming elections.\n We’ll guide you through the vote by mail process so that you can vote safely and save time in the upcoming elections.", "posttime": "2020-05-29 22:48:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "登记,vote,投票", "title": "2分钟内登记邮寄投票", "title_en": "Register to Vote by Mail in 2 Minutes", "transed": 1, "url": "https://mustvote.org/", "via": "", "real_tags": ["登记", "vote", "投票"]}, {"category": "", "categoryclass": "", "imagename": "8fb74c03d1ce7415af500e3585094132.jpg", "infoid": 1004249, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "BATS提供的大多数股票报价数据。市场指数是实时显示的，但DJIA指数除外，因为DJIA指数延迟了两分钟。所有时间都是ET。免责声明。晨星：2018年版权归晨星公司所有。版权所有。FactSet：FactSet Research Systems Inc.2018。版权所有。芝加哥商业协会：某些市场数据是芝加哥商品交易所公司的财产。以及它的许可人。版权所有。道琼斯(Dow Jones)：道琼斯品牌指数由标准普尔道琼斯指数有限责任公司(S&P Dow Jones Indices LLC)的子公司DJI Opco专有，并由DJI Opco计算、分销和营销，并已获得S&P Opco、LLC和CNN的使用许可。标准普尔和标准普尔是标准普尔金融服务有限责任公司的注册商标，道琼斯是道琼斯商标控股有限责任公司的注册商标。道琼斯品牌指数的所有内容版权所有，2018年标准普尔道琼斯指数有限责任公司和/或其附属公司。", "note_en": "Most stock quote data provided by BATS. Market indices are shown in real time, except for the DJIA, which is delayed by two minutes. All times are ET. Disclaimer. Morningstar: Copyright 2018 Morningstar, Inc. All Rights Reserved. Factset: FactSet Research Systems Inc.2018. All rights reserved. Chicago Mercantile Association: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&amp;P Dow Jones Indices LLC and have been licensed for use to S&amp;P Opco, LLC and CNN. Standard &amp; Poor&#39;s and S&amp;P are registered trademarks of Standard &amp; Poor&#39;s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&amp;P Dow Jones Indices LLC 2018 and/or its affiliates.", "posttime": "2020-05-29 22:47:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,妻子,wrote,道琼斯", "title": "鳏夫写了一封信，要求推特删除特朗普关于他去世妻子的推文", "title_en": "Widower wrote letter asking Twitter to remove Trump's tweets about his dead wife", "transed": 1, "url": "https://edition.cnn.com/2020/05/26/media/widower-letter-to-jack-dorsey-twitter/index.html", "via": "", "real_tags": ["推特", "妻子", "wrote", "道琼斯"]}, {"category": "", "categoryclass": "", "imagename": "50ca71db962028149aab87ed95ed1499.jpg", "infoid": 1004248, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "哥伦比亚大学、布朗大学、宾夕法尼亚大学、普渡大学--这些大学有着神圣的传统、自豪的校友和另一个共同之处：现在，它们正被心怀不满的学生起诉。\n学生们声称，当校园在冠状病毒大流行中关闭时，他们应该有权拿回更多的钱。面临此类挑战的机构名单正在增加，包括康奈尔大学(Cornell)、范德比尔特大学(Vanderbilt)、自由大学(Liberty)和坦普尔大学(Temple)等私立大学，以及加利福尼亚州、佛罗里达州、北卡罗来纳州和亚利桑那州的整个公共系统。\n这些案件-现在总共有几十起-提出了一个棘手的问题，即什么才是大学教育真正有价值的地方。\n几家律师事务所正在处理这些诉讼。其中最多产的是南卡罗来纳州的Anastopoulo律师事务所，该律师事务所专门处理人身伤害案件。这家公司有一个丰富多彩的背景：它的创始人阿基姆·阿纳斯托波罗(Akim Anastopoulo)花了几年时间在一档名为Eye for a Eye的法庭电视节目中扮演极端阿基姆法官(Justice Extreme Akim)，在节目中，他对败诉的当事人进行了报复，而不仅仅是现金处罚。\n他的公司已经建立了一个网站CollegeRefund2020.com，为这些诉讼招募原告，到目前为止已经提起了30多起诉讼。\n当美国各地的大学因冠状病毒大流行而关闭大门并将学生送回家时，许多大学确实提供了部分宿舍和活动费的退款。但是，这些诉讼认为，他们应该退还更多，因为不仅学生无法进入健身房、餐厅、面对面的网络和派对，而且他们的文凭永远会有星号，因为他们是在网上完成学位的。\n例如，北卡罗来纳大学夏洛特分校(University Of North Carolina At Charlotte)的一名学生投诉说：\n很少有大学对这些诉讼发表公开评论。佩斯大学女发言人玛丽·博斯特在4月份接受NPR采访时表示：佩斯大学的教职员工和领导们在这个充满挑战的时期继续不知疲倦地工作，支持我们的学生。博斯特指出，教育工作者不仅继续教授学生所有的常规课程，而且学校还提供辅导、咨询和其他服务。因此，该校辩称，学费并不是真的要浪费。\n阿纳斯托波罗律师事务所(Anastopoulo Law)的律师罗伊·T·威利四世(Roy T.Willey IV)负责监督许多诉讼，他驳斥了这一说法，认为这是可笑的。\n考虑到他们如何推销自己的校园-体验式教育和实践学习，以及如果你支付这些巨额学费，你将在校园里受益的多样性-这是一个有趣的职位，现在，嗯，我们无论如何都可以在网上提供同样的东西。\n威利指出，一些在案件中被点名的大学已经提供在线课程，学费低于校园里当面向学生收取的学费。\n斯坦福大学法学院法学教授黛博拉·亨斯勒(Deborah Hensler)告诉NPR，这些案件在法庭上面临着一场艰苦的战斗。我认为这些西装可能性很小。\n首先，她解释说，不可抗力的法律原则意味着完全不可预见的事件，如天灾或全球大流行，往往会导致合同无效。\n威利反驳说，大多数学生协议实际上并不包括不可抗力条款。他补充说，在任何情况下，这些诉讼都不是针对彻底违约的。这里的学生非常公平，非常通情达理。而他们只是想要他们付出的东西和他们得到的回报之间的差额。\n其次，汉斯勒指出，尤其是在大学方面，在司法上对学术界的尊重有着良好的记录。基本上，法院通常会承认，当涉及到与学术和教育相关的决定时，大学应该拥有一定的自主权。\n最后，还有法律索赔本身的实质内容。在这里，Hensley引用了她作为一名教员的个人经历，自从斯坦福大学关闭校园以来，她一直在网上授课。她一直在布置阅读材料，给论文评分，并通过视频进行讨论。\n在我个人看来，我可以在网上提供和面对面一样高质量的教育。但是，她说，这对理科学生来说可能不是这样，例如，他们需要在实验室里，或者对于需要共用舞台的舞蹈学生来说。\n无论这些诉讼是胜诉还是失败，都给大学的价值主张蒙上了一层阴影。未来的大学是否能够对部分或全部在网上进行的学期收取他们习惯的相同学费？", "note_en": "Columbia, Brown, Penn, Purdue — universities with hallowed traditions, proud alumni and another thing in common: Right now they&#39;re being sued by disgruntled students.\n  The students claim that when campuses shut down amid the coronavirus pandemic, they should have been entitled to more of their money back. And the list of institutions facing such challenges is growing, including private universities, such as Cornell, Vanderbilt, Liberty and Temple, and entire public systems in California, Florida, North Carolina and Arizona.\n  The cases — now dozens in all — are raising difficult questions about what truly makes a college education valuable.\n  Several law firms are handling these suits. One of the most prolific is Anastopoulo Law Firm in South Carolina, which specializes in personal injury. The firm has a colorful background: Its founder, Akim Anastopoulo, spent several years known as Judge Extreme Akim on a court television show called  Eye for an Eye, where he meted out revenge, not just cash penalties, to losing parties.\n  His firm has set up a website, CollegeRefund2020.com, to recruit plaintiffs for these suits and has filed more than 30 so far.\n    When universities across the U.S. shut their doors because of the coronavirus pandemic and sent students home, many did offer partial refunds of dorm and activities fees. But, these lawsuits argue, they should have refunded more, because not only did students lose access to the gym, the dining hall, the in-person networking and parties, but their diplomas will always have an asterisk because they finished their degrees online.\n  For example, a complaint by a student at the University of North Carolina at Charlotte, says:\n    Few universities have commented publicly on the suits.  Pace University spokeswoman Marie Boster  told NPR in April: &#34;The faculty, staff and leaders of Pace continue to work tirelessly to support our students during this challenging time.&#34; Boster pointed out that not only have educators continued to teach students all their regular courses, but the university is offering tutoring, counseling and other services as well. So, the school argues, tuition dollars are not really going to waste.\n  Roy T. Willey IV, an attorney at Anastopoulo Law Firm who is overseeing many of the suits, dismisses that claim as &#34;laughable.&#34;\n  &#34;Considering how they market their campus — experiential education and hands-on learning and the diversity on campus that you will avail yourself of if you pay these large tuition bills — it&#39;s an interesting position to take now that, &#39;well, we&#39;re able to provide the same thing online anyway.&#39; &#34;\n  Some universities named in the cases already offer classes online for a lower tuition than they charge in-person students on campus, Willey pointed out.\n  Deborah Hensler, a law professor at Stanford Law School, told NPR that these cases face an uphill battle in court. &#34;I think these suits are a very long shot.&#34;\n  First of all, she explained, the legal principle of force majeure means that a totally unforeseen event, like an act of God or a global pandemic, tends to void a contract.\n  Willey counters that most of the students&#39; agreements don&#39;t actually include a force majeure clause. And in any case, he adds, these suits are not for outright breach of contract. &#34;The students here are very fair, very reasonable. And they&#39;re just asking for the difference between what they pay for and what they receive to come back to them.&#34;\n  Second, Hensler pointed out that when it comes to universities in particular, there&#39;s a track record of what&#39;s called &#34;judicial deference to academia.&#34; Basically, courts often recognize that universities deserve some autonomy when it comes to decisions related to scholarship and education.\n  And finally, there&#39;s the substance of the legal claim itself. Here, Hensley invoked her personal experience as a faculty member who has been teaching online since Stanford University closed its campus. She has been assigning readings, grading papers and holding discussions over video.\n  &#34;In my personal opinion, I can deliver the same quality of education online as I could in person.&#34; But, she said, this might not be true for science students, for example, who need to be in a lab or for dance students who need to share a stage.\n  Whether these lawsuits succeed or falter, they cast a shadow on the value proposition of college. Will universities going forward be able to charge the same tuition they&#39;re accustomed to for semesters that take place partially or entirely online?", "posttime": "2020-05-29 22:31:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大学,冠状病毒,coronavirus,病毒,面临", "title": "冠状病毒关闭后，大学面临要求退款的学生诉讼", "title_en": "Colleges face student lawsuits seeking refunds after coronavirus closures", "transed": 1, "url": "https://www.npr.org/2020/05/29/863804342/colleges-face-student-lawsuits-seeking-refunds-after-coronavirus-closures", "via": "", "real_tags": ["大学", "冠状病毒", "病毒", "面临"]}, {"category": "", "categoryclass": "", "imagename": "38a1744e68efcf9b183c97c860239529.jpg", "infoid": 1004245, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转导航跳转到搜索房间641A是美国电话电报公司(AT&amp；T)为美国国家安全局(National Security Agency)运营的电信拦截设施，是其根据爱国者法案(Patriot Act)授权的无授权证监视计划的一部分。该设施于2003年开始运营，其目的于2006年公开披露。[1][2]。\n641A房间位于旧金山福尔瑟姆街611号的SBC通信大楼内，在SBC收购AT&amp；T之前，该大楼的三层曾被AT&amp；T占用。[1]该房间在AT&amp；T内部文件中被称为SG3[学习小组3]安全室(SG3[Study Group 3]Secure Room)。\n房间的尺寸约为24x48英尺(7.3x14.6m)，其中包括几个机架上的设备，其中包括Narus STA 6400，这是一种旨在以非常高的速度拦截和分析互联网通信的设备。[1]它由安装在承载互联网主干业务的光纤干线中的分束器的光纤线路馈送。[3]根据J·斯科特·马库斯(J.Scott Marcus)的分析，他是GTE的前首席技术官，也是联邦通信委员会(Federal Communications Commission)的前顾问，它可以访问通过大楼的所有互联网流量，因此有能力对大规模的互联网内容进行监控和分析，包括海外和纯粹的国内流量。\n这个房间的存在是由前AT&amp；T技术人员Mark Klein透露的，2006年电子前沿基金会(Electronic Frontier Foundation)对AT&amp；T提起了集体诉讼。[5]克莱因声称，他被告知全国其他地方也有类似的黑房间。[6]。\n641A房间和围绕它的争议是公共广播公司(PBS)的时事纪录片节目“前线”(Frontline)的一集[7]的主题。它最初是在2007年5月15日播出的。它还于2008年3月14日出现在PBS的“Now”上。这个房间也在PBS的新星一集“间谍工厂”中被报道过。\n2006年1月31日，电子前沿基金会(EFF)对美国电话电报公司(AT&amp；T)提起集体诉讼，指控这家电信公司与美国国家安全局(NSA)合作，对美国人的通信进行大规模非法窃听和数据挖掘，违反了法律和侵犯了客户的隐私。2006年7月20日，一名联邦法官驳回了政府和美国电话电报公司(AT&amp；T；)提出的驳回此案的动议，主要是以国家机密特权为由，允许诉讼继续进行。2007年8月15日，该案由第九巡回上诉法院审理，并于2011年12月29日被驳回，理由是国会追溯授予与政府合作的电信公司豁免权。美国最高法院拒绝审理此案。[8]。\n电子前沿基金会(Electronic Frontier Foundation)于2008年9月18日提起了另一起案件，题为“宝石诉美国国家安全局”(Jewel v.NSA)。经过多年的诉讼，2019年4月25日，加利福尼亚州北区对“珠宝诉美国国家安全局”一案的裁决[9]得出结论，原告的专家提出的证据不充分；法院确认了其早先的裁决，即克莱恩不能根据自己的独立知识来确定AT&amp；网站安全室的内容、功能或用途。裁决中指出，“不能根据自己的独立知识来确定AT&amp；网站安全室的内容、功能或用途。”(9)裁决指出，原告的专家提交的证据不充分；法院确认了其早先的裁决，即克莱恩不能根据他自己的独立知识来确定AT&amp；网站安全室的内容、功能或用途。克莱因只能猜测哪些数据实际上是由谁在安全房间里处理的，以及如何处理和出于什么目的，因为他从未参与过它的操作。法院进一步诋毁了其他专家的名誉，理由是他们严重依赖克莱恩的声明。\n第17页：所谓的窃听是如何完成的基本示意图。从EFF的法庭文件中。[4]\n^a b c&34；AT&amp；T吹哨人的证据。窃听。2006年5月17日。2014年3月28日从原件存档。CS1维护：BOT：原始URL状态未知(链接)。\n詹姆斯·班福德(2012年3月15日)。美国国家安全局正在建设这个国家最大的间谍中心(注意你说的话)。窃听。\n^2007年赫亭诉美国电话电报公司(AT&&T)诉讼中的一份克莱恩证物文件(B&34；Klein Exhibit&34；Document of Hepting vs AT&&T)。瑞安·辛格尔(Ryan Singel)在“连线”杂志(Wire Magazine)上报道，AT&amp；T&39；Spy Room打开的文档；您已经看过了，这些文档发布在电子前沿基础文件(Electronic Frontier Foundation File&#34；SER_Klein_exhibits.pdf)网站(PDF)上。\n^2006年赫汀诉美国电话电报公司(AT&&T)诉讼中的一份马库斯宣言文件。瑞安·辛格尔(Ryan Singel)在“连线”杂志(Wire Magazine)上发表文章，文章AT&amp；间谍室打开的文件；您已经看过了这些文件6/13/07，这些文件发布在电子前沿基金会文件(SER Marcus decl.pdf)网站(PDF)上。\n技术人员Mark Klein在641A&34；房间讨论。倒计时一集。2007年11月7日。2009年2月2日从原件存档-通过YouTube。\n大卫·克里斯(2014)。“关于大量收集有形物品”(PDF)。“国家安全法与政策”杂志。2017年从原件存档。", "note_en": "Jump to navigation  Jump to search  Room 641A is a telecommunication interception facility operated by  AT&amp;T for the U.S.  National Security Agency, as part of  its warrantless surveillance program as authorized by the  Patriot Act. The facility commenced operations in 2003 and its purpose was publicly revealed in 2006.  [1]  [2]\n   Room 641A is located in the  SBC Communications building at 611 Folsom Street,  San Francisco, three floors of which were occupied by AT&amp;T before SBC purchased AT&amp;T.  [1] The room was referred to in internal AT&amp;T documents as the  SG3 [Study Group 3] Secure Room.\n The room measures about 24 by 48 feet (7.3 by 14.6 m) and contains several racks of equipment, including a  Narus STA 6400, a device designed to intercept and analyze Internet communications at very high speeds.  [1] It is fed by  fiber optic lines from  beam splitters installed in fiber optic trunks carrying  Internet backbone traffic.  [3] In the analysis of J. Scott Marcus, a former  CTO for  GTE and a former adviser to the  Federal Communications Commission, it has access to all Internet traffic that passes through the building, and therefore &#34;the capability to enable surveillance and analysis of internet content on a massive scale, including both overseas and purely domestic traffic.&#34;  [4]\n The existence of the room was revealed by former AT&amp;T technician  Mark Klein and was the subject of a 2006  class action lawsuit by the  Electronic Frontier Foundation against AT&amp;T.  [5] Klein claims he was told that similar  black rooms are operated at other facilities around the country.  [6]\n Room 641A and the controversies surrounding it were subjects of an episode of   Frontline,  [7] the current affairs documentary program on  PBS. It was originally broadcast on May 15, 2007. It was also featured on PBS&#39;s   NOW on March 14, 2008. The room was also covered in the PBS   Nova episode &#34; The Spy Factory&#34;.\n   The  Electronic Frontier Foundation (EFF) filed a  class-action  lawsuit against  AT&amp;T on January 31, 2006, accusing the telecommunication company of violating the law and the privacy of its customers by collaborating with the  National Security Agency (NSA) in a massive, illegal program to  wiretap and  data-mine Americans&#39; communications. On July 20, 2006, a federal judge denied the government&#39;s and AT&amp;T&#39;s motions to dismiss the case, chiefly on the ground of the  state secrets privilege, allowing the lawsuit to go forward. On August 15, 2007, the case was heard by the  Ninth Circuit Court of Appeals and was dismissed on December 29, 2011, based on a  retroactive grant of immunity by Congress for telecommunications companies that cooperated with the government. The U.S. Supreme Court declined to hear the case.  [8]\n A different case by the Electronic Frontier Foundation was filed on September 18, 2008, titled   Jewel v. NSA. After many years of litigation, on April 25, 2019, ruling from the Northern District of California for  Jewel v. NSA  [9] concluded that the evidence presented by the plaintiff&#39;s experts was insufficient; &#34;the Court confirms its earlier finding that Klein cannot establish the content, function, or purpose of the secure room at the AT&amp;T site based on his own independent knowledge.&#34; The ruling noted, &#34;Klein can only speculate about what data were actually processed and by whom in the secure room and how and for what purpose, as he was never involved in its operation.&#34; The Court further went on to discredit other experts called upon, citing their heavy reliance on the Klein declaration.\n  Page 17: Basic diagram of how the alleged wiretapping was accomplished. From  EFF court filings.  [4]\n     ^     a     b     c    &#34;AT&amp;T Whistle-Blower&#39;s Evidence&#34;.  Wired. May 17, 2006. Archived from the original on March 28, 2014 .  CS1 maint: BOT: original-url status unknown ( link)\n ^    Bamford, James (15 March 2012).  &#34;The NSA Is Building the Country&#39;s Biggest Spy Center (Watch What You Say)&#34;.   Wired .\n ^     a     b  &#34;Klein Exhibit&#34; Document from Hepting vs AT&amp;T lawsuit from 2007. Reported by Ryan Singel in Wired Magazine, article  &#34;AT&amp;T &#39;Spy Room&#39; Documents Unsealed; You&#39;ve Already Seen Them&#34; 6/13/07, Documents posted at the Electronic Frontier Foundation  File &#34;SER_klein_exhibits.pdf website (PDF)\n ^     a     b  &#34;Marcus Declaration&#34; Document from Hepting vs AT&amp;T lawsuit from 2006. Reported by Ryan Singel in Wired Magazine, article  &#34;AT&amp;T &#39;Spy Room&#39; Documents Unsealed; You&#39;ve Already Seen Them&#34; 6/13/07 , Documents posted at the Electronic Frontier Foundation  File &#34;SER marcus decl.pdf website (PDF)\n  &#34;Technician Mark Klein discussing Room 641A&#34;.   Countdown episode. November 7, 2007. Archived from  the original on February 2, 2009 – via  YouTube.\n Kris, David (2014).  &#34;On Bulk Collection of Tangible Things&#34;  (PDF).  Journal of National Security Law &amp; Policy.  Archived from the original on 2017.", "posttime": "2020-05-29 22:30:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "房间,room", "title": "641A房间", "title_en": "Room 641A", "transed": 1, "url": "https://en.wikipedia.org/wiki/Room_641A", "via": "", "real_tags": ["房间", "room"]}, {"category": "", "categoryclass": "", "imagename": "6d8c5a2408f2ec2b5c89d923422c6d23.jpg", "infoid": 1004243, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从Oumuamua在2017年被发现以来，在我们太阳系中探测到的第一个星际物体一直是天文学家无穷无尽的兴趣的来源。这块巨大的太空岩石有着不同寻常的雪茄形状，上下颠簸，不容易被归类为彗星或小行星。关于这个星际入侵者的不确定性导致了关于它的来源和组成的各种理论的扩散。有人猜测这是一只宇宙尘埃兔子，一艘外星宇宙飞船，或者是一颗被其宿主恒星撕裂的小行星的残留物。\n本周，两位耶鲁大学的天体物理学家提出了一种新的理论，认为“奥穆阿穆亚具备星际冰山的特质”。这项研究最近以预印本的形式发表，并被接受发表在“天体物理杂志快报”上，它追溯了欧穆阿木亚的起源，可以追溯到一个巨大的分子云。这些幽灵般的天体是巨大的恒星托儿所，可以绵延数光年，含有足够形成数万颗恒星的气体。但根据这项新的研究，它们也可能喷出看起来和行为都很像“欧穆阿穆瓦”的氢冰山。\n“尽管氢冰山的事情有点异国情调，但它解释了‘欧穆阿美亚’的每一件神秘的事情，”达里尔·塞利格曼说，他是芝加哥大学即将上任的博士后研究员，与他在耶鲁的博士导师、天体物理学家格雷戈里·劳克林共同撰写了这篇论文。如果塞利格曼和劳克林是对的，“欧穆阿穆亚不仅将是第一个被发现的星际天体，而且也将是第一座氢冰山。”\n氢通常以气体的形式存在，是像我们的太阳这样的恒星中推动聚变过程的物质。但是如果它变得足够冷，氢可以凝固。宇宙中唯一已知的足以引起这一相变的足够寒冷的区域是巨大分子云的致密、冰冷的心脏。“关于氢冰的研究并不多，因为它的升华温度很低，”塞利格曼说，他指的是固体直接转变为气体的点。他说氢在零下450华氏度左右结冰，仅比绝对零度高几度。\n巨型分子云的核心寿命相对较短，只有几十万年。随着时间的推移，它会被星系的搅动侵蚀，直到消失。但根据氢冰山理论，在核心短暂存在的过程中，冻结的氢分子会附着在云层中的尘埃上，形成一大块冰。这是一个极其缓慢的过程；几十万年后，它将产生一座只有几百米宽的冰山。对于像‘Oumuamua’这样的物体来说，这是完全正确的，NASA的研究人员计算出它的长度不到800米。\n冰山理论也可以解释“欧穆阿瓜怪异的雪茄形状”。巨型分子云核心消散后，冰山漂浮在空隙中，不断受到宇宙辐射的轰击。辐射会从某些方向比从其他方向撕裂冰山更多，这将导致冰山更加拉长。塞利格曼将其比作一块肥皂，使用时肥皂会变得更加扁平和椭圆形。\n但塞利格曼对氢冰山理论最感兴趣的原因是，它可以解释为什么“奥穆阿穆亚”在进入太阳系时开始加速，而这不能仅靠重力牵引来解释。几位不同的天文学家提出的一种主要理论认为，“欧穆阿穆亚是由从太空岩石上迅速沸腾的气体推动的，这种现象被称为放气。”这就是彗星明亮的尾巴的原因，彗星的尾巴通常由二氧化碳和水等化合物组成。但是，当天文学家观测到“Oumuamua”时，他们没有检测到可以解释该物体加速的放气现象--当然，除非它吐出纯氢，而进行观测的望远镜无法检测到这一点。\n塞利格曼和劳克林的理论是一个诱人的解释，涵盖了“欧穆阿穆亚最神秘的特征”。但它也召唤出了一种全新的天体物理对象-氢冰山-这是以前从未观察到的，甚至几乎没有理论化。塞利格曼说，在1990年代的一篇天文学论文中，仅有的一篇提到了类似的东西，该论文提出了固态氢可以解释暗物质的理论。\n海军学院的天文学家马修·奈特(Matthew Knight)之前曾研究过这个星际天体，他说，就物理学而言，氢冰山没有理由不存在--它们似乎确实解释了很多关于奥穆阿穆阿的事情。奈特说：“我们在细长的形状和如何获得加速度的能量方面一直存在问题，这在文献中没有太多报道。”“他们在全面解释可能发生的事情方面做得非常出色。”\n然而，不同寻常的说法需要不同寻常的证据，我们可能永远不会确切地知道“欧穆阿穆瓦”是否真的是一块氢冰。这个星际物体正以每小时7万英里的速度冲出太阳系，不可能被观测到，除非启动星际任务来拦截它。\n但也许还有另一次机会来观察另一个类似的情况。许多天文学家认为，星际天体可能会定期经过我们的太阳系，像智利的大型天气观测望远镜这样的下一代望远镜将在它们离开之前很久就能探测到它们。这将给天文学家足够的时间来测试关于这些物体是由什么组成的以及它们是如何形成的理论。塞利格曼说，如果冰山理论是正确的，天文学家们预计会看到这些物体在太阳系中移动时形状发生变化。最剧烈的变化将发生在该物体最接近太阳的时候，那时它会迅速蒸发掉氢气。\n奈特说：“这个想法击中了我们很难全面解释的许多事情，并开启了新的调查，当发现新的星际物体时，这些调查应该进行。”“如果我们能证明它真的是由氢冰制成的，那将是一个非常令人兴奋的结果。”\n👁大脑是人工智能的有用模型吗？另外：获取最新的人工智能新闻。\n🏃🏽‍♀️想要最好的健康工具吗？看看我们Gear团队挑选的最好的健身跟踪器、跑步装备(包括鞋子和袜子)和最好的耳机", "note_en": "Ever since ‘Oumuamua was discovered in 2017, the first interstellar object detected in our solar system has been a source of endless intrigue for astronomers. The giant hunk of space rock has an unusual cigar shape, is  tumbling end over end, and isn’t  easily classified as a comet or an asteroid. The uncertainties about this interstellar interloper have resulted in a proliferation of theories about its provenance and composition. There’s been speculation that it’s a  cosmic dust bunny, an  alien spaceship, or the remnants of  a small planet torn asunder by its host star.\n This week, two Yale astrophysicists put forth a new theory arguing that ‘Oumuamua has the makings of an interstellar iceberg. The research, recently  published as a preprint and accepted for publication in  Astrophysical Journal Letters, traces ‘Oumuamua’s origins to a giant molecular cloud. These ghostly objects are massive stellar nurseries that can stretch for light years and contain enough gas to form tens of thousands of stars. But according to the new research, they might also spit out hydrogen icebergs that look and behave a lot like ‘Oumuamua.\n “Even though the hydrogen iceberg thing is a little exotic, it explains every single mysterious thing about ‘Oumuamua,” says Darryl Seligman, an incoming postdoctoral researcher at the University of Chicago who coauthored the paper with astrophysicist Gregory Laughlin, his PhD adviser at Yale. If Seligman and Laughlin are right, ‘Oumuamua would not only be the first interstellar object discovered, but the first hydrogen iceberg, too.\n  Hydrogen typically exists as a gas and is the stuff that fuels the fusion process in stars like our sun. But if it gets cold enough, hydrogen can solidify. The only known regions of the universe frigid enough to cause this phase transition are the dense, icy hearts of giant molecular clouds. “There’s not much work on hydrogen ice, because its sublimation temperature is so low,” says Seligman, referring to the point at which a solid transitions directly into a gas. He says that hydrogen freezes at around -450 degrees Fahrenheit, just a few degrees above absolute zero.\n The core of a giant molecular cloud has a relatively short lifespan of just a few hundred thousand years. Over time, it gets eroded by the churn of the galaxy until it disappears. But according to the hydrogen iceberg theory, during the core’s brief existence, frozen hydrogen molecules latch on to dust in the cloud to build up a large block of ice. It’s a painstakingly slow process; after a few hundred thousand years it would produce an iceberg only a few hundred of meters across. This is squarely in the ballpark for an object like ‘Oumuamua, which  NASA researchers calculated to be less than 800 meters long.\n  The iceberg theory can also explain ‘Oumuamua’s weird cigar shape. After the core of the giant molecular cloud dissipates and the iceberg is set adrift in the void, it is constantly bombarded by cosmic radiation. The radiation would chip away at the iceberg from some directions more than others, which would result in a more elongated form. Seligman compares it to a bar of soap, which becomes more flat and oval as it is used.\n  But the reason Seligman is most excited about the hydrogen iceberg theory is because it can explain why ‘Oumuamua began speeding up as it entered the solar system, which couldn’t be explained by the tug of gravity alone. A leading theory advanced by several different astronomers  argued that ‘Oumuamua was propelled by gases rapidly boiling off of space rocks, a phenomenon known as outgassing. This is what gives a comet its brilliant tail, which is typically composed of compounds like carbon dioxide and water. But when astronomers observed ‘Oumuamua, they didn’t detect outgassing that would explain the object’s acceleration—unless, of course, it was spitting out pure hydrogen, which couldn’t be detected by the telescopes conducting the observations.\n  Seligman and Laughlin’s theory is a tantalizing explanation that covers ‘Oumuamua’s most mysterious features. But it also conjures an entirely new type of astrophysical object—a hydrogen iceberg—that has never been observed before and barely even theorized. Seligman says one of the only references to something like it is in an astronomy  paper from the 1990s, which theorized that solid hydrogen could explain dark matter.\n As far as physics is concerned, there’s no reason hydrogen icebergs can’t exist—and they do seem to explain a lot about ‘Oumuamua, says Matthew Knight, an astronomer at the Naval Academy who has previously researched the interstellar object. “We’ve been having trouble with the elongated shape and the energetics of how you get the acceleration, which hasn’t been covered much in the literature,” Knight says. “They do an excellent job of comprehensively explaining what could be going on.”\n Still, extraordinary claims require extraordinary evidence, and we may never know for sure if ‘Oumuamua is in fact a block of hydrogen ice. The interstellar object is sprinting out of the solar system at 70,000 miles per hour and impossible to observe, short of  launching an interstellar mission to intercept it.\n But there may be another chance to observe another like it. Many astronomers think that  interstellar objects may be passing through our solar system on a regular basis, and next-generation telescopes like Chile’s Large Synoptic Survey Telescope will be well-equipped to detect them long before they make their departure. This would give astronomers plenty of time to test theories about what these objects are made of and how they were formed. Seligman says that if the iceberg theory is correct, astronomers would expect to see these objects change shape as they move through the solar system. The most drastic change would occur during the object’s closest approach to the sun when it rapidly boils off its hydrogen.\n “This idea hits a lot of things we’ve had trouble explaining in a comprehensive way and opens up new investigations that ought to be done when new interstellar objects are discovered,” says Knight. “It would be a really exciting result if we could prove that it really was made out of hydrogen ice.”\n   👁 Is the brain a  useful model for AI? Plus:  Get the latest AI news\n 🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2020-05-29 22:29:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "oumuamua,giant,解释", "title": "Oumuamua可能是一座巨大的星际氢冰山", "title_en": "‘Oumuamua Might Be a Giant Interstellar Hydrogen Iceberg", "transed": 1, "url": "https://www.wired.com/story/oumuamua-might-be-a-giant-interstellar-hydrogen-iceberg/", "via": "", "real_tags": ["oumuamua", "giant", "解释"]}, {"category": "", "categoryclass": "", "imagename": "df03c0951cc9d8f78d9c6d62d4c03556.png", "infoid": 1004241, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "版本1：接收时间：2020年4月24日/批准时间：2020年4月25日/在线时间：2020年4月25日(CEST时间03：13：45)版本2：接收时间：2020年5月29日/批准时间：2020年5月29日/在线时间：2020年5月29日(CEST时间04：16：20)。\nDofferhoff，A.S.；Piscaer，I.；Schurgers，L.J.；Walk，J.；van den Ouwell and，J.M.；Hackeng，T.M.；de Jong，P.A.；Gosens，R.；Lux，P.；van Daal，H.；Maassen，C.；Maassen，E.G.；Kistemaker，L.E.；Vermeer，C.；Wouters，E.F.；Janssen，R.。2020年，2020040457预印本(doi：10.20944/preprints202004.0457.v2)。Dofferhoff，A.S.；Piscaer，I.；Schurgers，L.J.；Walk，J.；van den Ouwell and，J.M.；Hackeng，T.M.；de Jong，P.A.；Gosens，R.；Lux，P.；van Daal，H.；Maassen，C.；Maassen，E.G.；Kistemaker，L.E.；Vermeer，C.；Wouters，E.F.；Janssen，R.。2020年，2020040457预印本(doi：10.20944/preprints202004.0457.v2)。\nDofferhoff，A.S.；Piscaer，I.；Schurgers，L.J.；Walk，J.；van den Ouwell and，J.M.；Hackeng，T.M.；de Jong，P.A.；Gosens，R.；Lux，P.；van Daal，H.；Maassen，C.；Maassen，E.G.；Kistemaker，L.E.；Vermeer，C.；Wouters，E.F.；Janssen，R.。2020年，2020040457预印本(doi：10.20944/preprints202004.0457.v2)。Dofferhoff，A.S.；Piscaer，I.；Schurgers，L.J.；Walk，J.；van den Ouwell and，J.M.；Hackeng，T.M.；de Jong，P.A.；Gosens，R.；Lux，P.；van Daal，H.；Maassen，C.；Maassen，E.G.；Kistemaker，L.E.；Vermeer，C.；Wouters，E.F.；Janssen，R.。2020年，2020040457预印本(doi：10.20944/preprints202004.0457.v2)。\n背景：相当大比例的SARS-CoV-2感染患者发生呼吸衰竭。血栓栓塞在2019年冠状病毒病中也很常见(新冠肺炎)。维生素K在凝血中起作用，可能也在肺部疾病中起作用。因此，我们推测维生素K与新冠肺炎的发病机制有关。方法：选择新冠肺炎患者13 4例，对照组1 84例。测定非活性维生素K依赖基质GLA蛋白(即dp-ucMGP)和凝血酶原(即Pivka-II)，它们分别与肝外和肝脏维生素K状况呈负相关。测定桥粒蛋白以定量测定弹性纤维的降解程度。通过计算机断层扫描评估肺部受累程度和动脉钙化程度。结果新冠肺炎组dp-ucMgp明显高于对照组(P=0.001)。新冠肺炎预后差的患者dp-ucMgp高于预后好的患者(P=0.002)。在未使用维生素K拮抗剂的新冠肺炎患者中，PIVKA-II正常者占81.8%，轻度升高者占14.0%，中度升高者占4.1%。新冠肺炎患者DP-ucMGP与桥粒蛋白(P&lt；0.001)、胸主动脉钙化(P&lt；0.001)相关，与肺炎严重程度无关。结论：新冠肺炎患者肝外维生素K水平严重降低，表现为非活动性MGP升高，与预后不良有关。在大多数新冠肺炎患者中，促凝血原凝血酶原活性仍然保留，这与重症新冠肺炎患者经常观察到的血栓形成增加是一致的。MGP活性受损与弹性纤维加速降解和病前血管钙化有关。一项试验应该评估服用维生素K增加肌钙蛋白和蛋白S活性是否能改善新冠肺炎的预后。\n新冠肺炎；桥连素；DP-ucMGP；弹性纤维；因子II；基质GLA蛋白；PIVKA-II；蛋白S；维生素K；维生素K拮抗剂。\n这是一篇根据知识共享署名许可证分发的开放获取文章，允许在任何媒体上不受限制地使用、分发和复制，前提是正确引用了原始作品。\n评论：除了DP-ucMGP用于评估肝外维生素K状况外，肝脏/促凝血维生素K状况还通过测量PIVKA-II进行评估。手稿正文被修改了。增加的数字解释了维生素K代谢，以及提出的从SARS-CoV-2病毒细胞数量到弹性纤维降解加速和维生素K不足的病理顺序步骤。胸部CT扫描是自动评估的，而在1.0版中只有SARS-CoV-2肺炎严重程度是主观评估的。\n+回复此评论\n数学方程式可以LaTeX格式\\\\[.\\\\]或$$.$$或MathML格式&lt；MATH&gt；.&lt；/MATH&gt；键入。尝试LaTeX或MathML示例。\n请在此处输入或粘贴图像的URL(请仅使用指向jpg/jpeg、png和gif图像的链接)：\n键入作者姓名或关键字以筛选此组中的引用列表(您可以在“参考书目”下添加新引用)：\nWikify编辑器是一个用于维基样式标记的简单编辑器。它是MDPI于2014年为本论坛撰写的。标记的呈现基于Wiky.php，并进行了一些调整。数学方程式的渲染是使用MathJax完成的。请向我们发送消息以获得支持或报告错误。\n请申报您与这份报纸可能存在的任何利益冲突，无论是财务上的还是其他方面的。\n我希望我对Publons[这是什么？]的评论得到认可。在这里链接你的账户，我接受以下条件：评论必须遵循专业话语的标准，并且应该集中在文章的科学内容上。不允许使用侮辱性或冒犯性的语言、人身攻击和离题言论。评论必须用英语书写。预印本保留删除评论的权利，恕不另行通知。发表评论的读者有义务申报任何相互竞争的利益，无论是财务利益还是其他利益。\n我们鼓励广大读者的评论和反馈。请参阅评论标准和我们的多样性声明。\n留下公开评论向作者发送私人评论", "note_en": "Version 1: Received: 24 April 2020 / Approved: 25 April 2020 / Online: 25 April 2020 (03:13:45 CEST) Version 2: Received: 29 May 2020 / Approved: 29 May 2020 / Online: 29 May 2020 (04:16:20 CEST)\n Dofferhoff, A.S.; Piscaer, I.; Schurgers, L.J.; Walk, J.; van den Ouweland, J.M.; Hackeng, T.M.; de Jong, P.A.; Gosens, R.; Lux, P.; van Daal, H.; Maassen, C.; Maassen, E.G.; Kistemaker, L.E.; Vermeer, C.; Wouters, E.F.; Janssen, R. Reduced Vitamin K Status as A Potentially Modifiable Prognostic Risk Factor in COVID-19.  Preprints  2020, 2020040457 (doi: 10.20944/preprints202004.0457.v2).  Dofferhoff, A.S.; Piscaer, I.; Schurgers, L.J.; Walk, J.; van den Ouweland, J.M.; Hackeng, T.M.; de Jong, P.A.; Gosens, R.; Lux, P.; van Daal, H.; Maassen, C.; Maassen, E.G.; Kistemaker, L.E.; Vermeer, C.; Wouters, E.F.; Janssen, R. Reduced Vitamin K Status as A Potentially Modifiable Prognostic Risk Factor in COVID-19. Preprints 2020, 2020040457 (doi: 10.20944/preprints202004.0457.v2).\n Dofferhoff, A.S.; Piscaer, I.; Schurgers, L.J.; Walk, J.; van den Ouweland, J.M.; Hackeng, T.M.; de Jong, P.A.; Gosens, R.; Lux, P.; van Daal, H.; Maassen, C.; Maassen, E.G.; Kistemaker, L.E.; Vermeer, C.; Wouters, E.F.; Janssen, R. Reduced Vitamin K Status as A Potentially Modifiable Prognostic Risk Factor in COVID-19.  Preprints  2020, 2020040457 (doi: 10.20944/preprints202004.0457.v2).  Dofferhoff, A.S.; Piscaer, I.; Schurgers, L.J.; Walk, J.; van den Ouweland, J.M.; Hackeng, T.M.; de Jong, P.A.; Gosens, R.; Lux, P.; van Daal, H.; Maassen, C.; Maassen, E.G.; Kistemaker, L.E.; Vermeer, C.; Wouters, E.F.; Janssen, R. Reduced Vitamin K Status as A Potentially Modifiable Prognostic Risk Factor in COVID-19. Preprints 2020, 2020040457 (doi: 10.20944/preprints202004.0457.v2).\n  Background:  A significant proportion of SARS-CoV-2-infected patients develops respiratory failure. Thromboembolism is also prevalent in coronavirus disease 2019 (Covid-19). Vitamin K plays a role in coagulation and possibly also in lung diseases. We therefore hypothesized that vitamin K is implicated in Covid-19 pathogenesis.  Methods: 134 Covid-19 patients and 184 controls were included. Inactive vitamin K-dependent matrix Gla protein ( i.e.dp-ucMGP) and prothrombin ( i.e. PIVKA-II) were measured, which are inversely related to respectively extrahepatic and hepatic vitamin K status. Desmosine was measured to quantify elastic fiber degradation. Lung involvement and arterial calcifications severity were assessed by computed tomography.   Results  Dp-ucMGP was elevated in Covid-19 patients compared to controls (P=0.001). Higher dp-ucMGP was found in Covid-19 patients with poor compared to better outcomes (P=0.002). PIVKA-II was normal in 81.8%, mildly elevated in 14.0% and moderately elevated in 4.1% of Covid-19 patients  not using vitamin K antagonists. Dp-ucMGP in Covid-19 patients was correlated with desmosine (P&lt;0.001), thoracic aortic calcification (P&lt;0.001) but not with pneumonia severity.  Conclusions:  Extrahepatic vitamin K status was severely reduced in Covid-19 patients, as reflected by elevated inactive MGP, and related to poor outcome. Procoagulant prothrombin activity remained preserved in the majority of Covid-19 patients, which is compatible with the increased thrombogenicity that is frequently observed in severe Covid-19. Impaired MGP activation was linked to accelerated elastic fiber degradation and premorbid vascular calcifications. A trial should assess whether increasing MGP and protein S activity by vitamin K administration improves Covid-19 outcomes.\n   Covid-19; desmosine; dp-ucMGP; elastic fibers; factor II; matrix Gla protein; PIVKA-II; protein S; vitamin K; vitamin K antagonist\n This is an open access article distributed under the  Creative Commons Attribution License which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.\n    Comment: In addition to dp-ucMGP to assess extrahepatic vitamin K status, hepatic/procoagulant vitamin K status was assessed by measuring PIVKA-II. The manuscript text was revised. Figures were added explaining vitamin K metabolism as well as proposed pathomechanistic sequential steps from SARS-CoV-2 virus cell enty to acceleration of elastic fiber degradation and vitamin K insufficiency. Chest CT scans were automatically assessed, whereas only  SARS-CoV-2 pneumonia severity was subjectively assessed in version 1.0.\n + Respond to this comment\n Mathematical equations can be typed in either LaTeX formats \\\\[ ... \\\\] or $$ ... $$, or MathML format &lt;math&gt; ... &lt;/math&gt;. Try the  LaTeX or  MathML example.\n   Please enter or paste the URL to the image here (please only use links to jpg/jpeg, png and gif images):\n Type author name or keywords to filter the list of references in this group (you can add a new citation under Bibliography):\n Wikify editor is a simple editor for wiki-style mark-up. It was written by MDPI for Sciforum in 2014. The rendering of the mark-up is based on  Wiky.php with some tweaks. Rendering of mathematical equations is done with  MathJax. Please  send us a message for support or for reporting bugs.\n Please declare any conflicts of interest you may have with this paper, financial or otherwise.\n     I want to get recognition for my comment on  Publons   [ what’s this?].  Link your accounts here   I accept the following conditions:  Comments must follow the standards of professional discourse and should focus on the scientific content of the article. Insulting or offensive language, personal attacks and off-topic remarks will not be permitted. Comments must be written in English.  Preprints reserves the right to remove comments without notice. Readers who post comments are obliged to declare any competing interests, financial or otherwise.\n We encourage comments and feedback from a broad range of readers. See  criteria for comments and our  diversity statement.\n Leave a public comment  Send a private comment to the author(s)", "posttime": "2020-05-29 22:12:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "维生素,水平,vitamin,评论", "title": "维生素K水平降低是新冠肺炎的可调性预后危险因素", "title_en": "Reduced Vitamin K Status as a Modifiable Prognostic Risk Factor in Covid-19", "transed": 1, "url": "https://www.preprints.org/manuscript/202004.0457/v2", "via": "", "real_tags": ["维生素", "水平", "vitamin", "评论"]}, {"category": "", "categoryclass": "", "imagename": "3154551b073419aa519a38e1df9b5e36.jpg", "infoid": 1004238, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚州奥克兰。-面对大流行造成的广告业低迷，谷歌已经取消了向数千名同意在该公司作为临时工和合同工工作的人的邀请。\n“我们正在放慢招聘和投资的步伐，不会像年初计划的那样引入更多的新员工，”谷歌在上周发给合同代理机构的一封电子邮件中表示。“纽约时报”看到了这封电子邮件。该公司告诉这两家公司，它“将不会继续聘用”这些机构招募到谷歌工作的人。\n据三名知情人士透露，全球有2000多人与这些机构签署了合同或临时工的邀约，这一举措影响了他们。由于不允许公开谈论此事，这三名知情人士要求匿名。\n谷歌雇佣了超过13万名承包商和临时工，这是一个影子劳动力，超过了其12.3万名全职员工。谷歌的全职员工获得了高薪和丰厚的津贴，但临时工和承包商往往拿到的工资更少，福利更少，也没有同样的保护，尽管他们是和全职员工一起工作的。\n冠状病毒危机突显了这种差距。谷歌在4月份宣布，将把员工带薪休假政策从8周延长到14周，照顾者包括照顾学校停课的孩子的父母。谷歌母公司Alphabet的首席执行官桑达尔·皮查伊(Sundar Pichai)周二表示，对于在家工作的员工，他们可以花1000美元购买站立式办公桌和符合人体工程学的椅子等设备和家具。\n许多在美国大流行之前同意在谷歌工作的合同工和临时工候选人在没有任何遣散费或经济补偿的情况下被解雇。这是在数周的不确定性之后，谷歌一再推迟他们的开始日期，在此期间，谷歌或人力资源机构没有支付他们的工资。\n一些潜在的承包商在收到谷歌的雇佣邀请后，离开了稳定的全职工作，现在正在艰难的劳动力市场寻找工作。据几名面临这一困境的工人称，一些美国人表示，被取消的就业机会使他们的领取失业救济金的能力变得复杂，在某些情况下，他们推迟了领取失业救济金的能力，因为他们是自愿离开上一份工作的。\n4月中旬，皮查伊在一份备忘录中告诉员工，公司计划今年“大幅”放慢招聘步伐，除了几个战略领域。该公司的一位女发言人当时表示，谷歌打算让已经雇佣但还没有开始工作的人加入进来。\n但这似乎不适用于谷歌和Alphabet的承包商或临时工，这两家公司的市值接近1万亿美元。它在2020年前三个月实现了68亿美元的利润，尽管它所称的广告业“显著而突然的放缓”。\n本·格温(Ben Gwin)在承包机构HCL America的谷歌办公室担任数据分析师，他说，“如果Alphabet向这些人承诺了价值1万亿美元的工作，公司似乎有责任聘用他们。”“谷歌又不是买不起。”\n去年，格温在谷歌匹兹堡的办公室领导了一项为合同技术工人成立工会的努力。\n谷歌发言人亚历克斯·克拉索夫(Alex Krasov)说，“正如我们公开表示的那样，我们正在放慢招聘和投资的步伐，因此，我们没有像年初计划的那样招收更多的新人--全职和临时的。”\nAlphabet首席财务官露丝·波拉特(Ruth Porat)上个月告诉分析师，该公司正在通过招聘不像最初预计的那样多的新员工来削减开支。她没有提到合同工或临时工。\n谷歌已经采取了一些措施来帮助其临时工和合同工。今年3月，该公司表示，将把原定于3月20日结束工作的临时工的工作期限延长60天。\n该公司还表示，将继续支付受办公室关闭影响的合同工的工资，比如在公司自助餐厅提供食物的人。它还设立了一个基金，允许临时工在出现冠状病毒症状或因被隔离而无法上班时休带薪病假。\n与许多科技公司一样，谷歌依赖大量临时工、供应商和承包商来执行各种各样的工作，包括自助餐厅工作人员、维护人员、招聘人员、内容版主和软件测试人员。对公司来说，这些员工的成本低于全职员工，而且谷歌对他们没有长期义务，这使得聘用他们或取消他们的职位变得很容易。\n去年，10名民主党参议员呼吁谷歌将其临时工和合同工转变为全职员工，称该公司应停止“反工人行为”，对所有员工一视同仁。\n谷歌付钱给人力资源公司，让他们找到这些工人，并作为他们的雇主向他们提供工资和福利。但谷歌面试潜在候选人，并签署招聘协议，决定他们在哪里工作，做什么以及何时解雇他们。\n接触受污染的物体，然后将细菌感染我们自己，这并不是典型的病毒传播方式。但这是有可能发生的。对流感、鼻病毒、冠状病毒和其他微生物的多项研究表明，包括新型冠状病毒在内的呼吸道疾病可以通过接触受污染的表面传播，特别是在日托中心、办公室和医院等地方。但是，要让这种疾病以这种方式传播，必须发生一系列漫长的事件。保护自己免受冠状病毒感染的最好方法--无论是表面传播还是密切的人类接触--仍然是社交距离、洗手、不碰脸和戴口罩。\n常见症状包括发烧、干咳、疲劳、呼吸困难或呼吸急促。这些症状中的一些与流感的症状重叠，使检测变得困难，但流鼻涕和鼻窦堵塞不太常见。疾控中心还增加了寒战、肌肉疼痛、喉咙痛、头痛和新的味觉或嗅觉丧失作为要注意的症状。大多数人在接触后五到七天就会生病，但症状可能会在短短两天或长达14天内出现。\n如果航空旅行是不可避免的，你可以采取一些措施来保护自己。最重要的是：勤洗手，不要再摸你的脸。如果可能的话，选择靠窗的座位。埃默里大学的一项研究发现，在流感季节，坐在飞机上最安全的地方是靠窗的，因为坐在靠窗座位的人与可能生病的人接触较少。对坚硬的表面进行消毒。当你坐到座位上，双手干净后，用消毒湿巾清洁座椅的硬表面，如头枕和扶手、安全带扣、遥控器、屏幕、座椅靠背口袋和托盘桌子。如果座椅很硬，不透气，或者是皮革或人造革的，你也可以把它擦干净。(在软垫座椅上使用湿巾可能会导致座椅湿润，传播细菌，而不是杀死他们。)。\n自大流行以来，已有超过4000万人-相当于美国工人中的四分之一-申请了失业救济金。美联储(Federal Reserve)5月14日发布的一项调查数据显示，在2月份工作的人中，有五分之一的人报告在3月份或4月初失去了工作或被暂时解雇，这种痛苦高度集中在低收入者身上。一位美联储官员表示，在收入在4万美元或以下的家庭中，整整39%的前工人失去了工作，相比之下，收入超过10万美元的家庭中，这一比例为13%。\n报告冻疮症状的人数有所上升，冻疮是一种疼痛的红色或紫色病变，通常在冬天出现在手指或脚趾上。这些病变正在成为感染新型冠状病毒的另一种症状。冻疮是由小血管在寒冷或潮湿的条件下发生炎症引起的，但它们通常在最冷的冬季月份很常见。联邦卫生官员不将脚趾病变列入冠状病毒症状清单，但一些皮肤科医生正在推动改变，称所谓的Covid Toe应该是检测的充分理由。\n是的，但是要确保你和不住在你家里的人保持6英尺的距离。即使你只是在公园里闲逛，而不是去慢跑或散步，呼吸一些新鲜空气，希望能得到阳光，也是一个好主意。\n测量一个人的体温来寻找发烧的迹象并不像听起来那么容易，因为“正常”的体温数字可能会有所不同，但通常情况下，要注意100.5华氏度或更高的温度。如果你没有温度计(这些天它们可能很贵)，还有其他方法可以确定你是发烧了，还是有患新冠肺炎并发症的风险。\n美国疾病控制与预防中心建议所有美国人在公共场合外出时都要戴上口罩。这是联邦指导方针的转变，反映了新的担忧，即冠状病毒是由没有症状的感染者传播的。到目前为止，疾控中心和世界卫生组织一样，建议普通人除非生病和咳嗽，否则不需要戴口罩。部分原因是为了保存医用级口罩，供医护人员在口罩持续供不应求的时候迫切需要。口罩不能取代洗手和社交距离。\n如果你接触过冠状病毒或认为自己感染了冠状病毒，并出现发烧或咳嗽或呼吸困难等症状，请打电话给医生。他们应该就你是否应该接受检测，如何检测，以及如何在不潜在感染或暴露他人的情况下求医给你提供建议。\n如果你生病了，你认为你已经接触了新的冠状病毒，疾控中心建议你打电话给你的医疗保健提供者，解释你的症状和恐惧。他们会决定你是否需要检查。请记住，有一种可能性--例如，因为缺乏检测工具，或者因为你没有症状--你可能无法接受检测。\n慈善导航器使用基于数字的系统来评估慈善机构，它有一份在受疫情影响的社区工作的非营利性组织的运行名单。你可以通过美国红十字会献血，世界中央厨房已经介入，在主要城市分发食物。\n当谷歌撤回对未来员工的邀请时，该公司告诉包括埃森哲(Accenture)、Cognizant和Adecco等公司在内的人力资源公司，“我们会指望你与那些不愿入职的人进行对话。”谷歌表示，它“希望”这些“机构将能够为候选人找到其他任务”。\n目前还不清楚哪些国家在这一决定中受到的影响最大，但一些工人在美国、印度和菲律宾。这是第二波取消对临时工和合同工的工作邀请。谷歌在4月份取消了对数十名临时工的招聘。\n乔利·霍兰德(Joli Holland)是4月中旬被取消工作邀请的候选人之一。当Adecco联系她关于在加利福尼亚州山景城的谷歌工作的招聘职位时，她正在富国银行(Wells Fargo)担任首席出纳员。经过几轮面试，她获得了开始日期为3月23日的职位。\n她希望自己能在谷歌找到一份临时工作，并获得一份全职工作。在向富国银行发出为期两周的通知之前，她与Adecco核实了一下，鉴于人们对冠状病毒的担忧日益加剧，谷歌的工作是否安全。霍兰德说，她确信一切“应该都会很好”。\n另一名被取消聘书的应聘者与Adecco的另一名招聘人员表达了类似的担忧。这名人士要求不具名，因为他们仍想在谷歌工作，并担心因直言不讳而被列入黑名单。他说，招聘人员说，“谷歌总是做正确的事，所以我不会为此担心。”\n在霍兰德准备出发的前几天，她被告知，她在谷歌的上班日期将推迟到4月6日。然后又被推迟到4月13日和4月20日，也就是周一。霍兰德说，在她准备开始工作的前一个周五，她被告知公司将取消所有临时工的工作邀请。她在谷歌等待入职期间没有拿到一分钱，也没有拿到任何遣散费。\n“我很失望，因为现在招聘的人不多，”她说。她没有申请失业，因为她是自愿离开上一份工作的。不过，霍兰德说，她仍然希望为谷歌工作，因为这仍然是一个很好的机会。\n“我很失望，但这并没有完全让我对公司产生反感，”她说。“我还是想在那里工作。”", "note_en": "OAKLAND, Calif. — Google, facing an advertising slump caused by the pandemic, has rescinded offers to several thousand people who had agreed to work at the company as temporary and contract workers.\n “We’re slowing our pace of hiring and investment, and are not bringing on as many new starters as we had planned at the beginning of the year,” Google said in an email to contracting agencies last week that was seen by The New York Times. The company told the firms that it “will not be moving forward to onboard” the people that the agencies had recruited to work at Google.\n The move affected more than 2,000 people globally who had signed offers with the agencies to be a contract or temp worker, according to three people familiar with the decision, who spoke on the condition of anonymity because they were not allowed to speak publicly on the matter.\n Google employs more than 130,000 contractors and temp workers, a shadow work force that outnumbers its 123,000 full-time employees. Google’s full-time staff are rewarded with high salaries and generous perks, but temps and contractors often receive less pay, fewer benefits and do not have the same protections, even though they work alongside full timers.\n The coronavirus crisis has  underscored that disparity. Google announced in April that it was extending its employee paid leave policy to 14 weeks from eight weeks for caretakers, including parents looking after children whose schools are closed. For employees working from home, Sundar Pichai, chief executive of Google’s parent company Alphabet, said on Tuesday that they could spend $1,000 for equipment and furniture like standing desks and ergonomic chairs.\n Many of the contract and temp candidates who had agreed to work at Google before the pandemic took hold in the United States were let go without any severance or financial compensation. This came after weeks of uncertainty as Google repeatedly postponed their start dates during which time they were not paid by Google or the staffing agencies.\n Some of the would-be contractors left stable, full-time jobs once they received an employment offer at Google and are now searching for work in a difficult labor market. Some, who are Americans, said the rescinded offers have complicated and, in some cases, delayed their ability to receive unemployment benefits because they left their last jobs voluntarily, according to several of the workers facing this dilemma.\n  In mid-April, Mr. Pichai told employees in a memo that  the company planned to “significantly” slow the pace of hiring this year, with the exception of several strategic areas. A company spokeswoman said at the time that Google intended to bring on the people who it had already hired but who had not started.\n But this did not seem to apply to contractors or temp workers for Google and Alphabet, which has a market capitalization of near $1 trillion dollars. It made $6.8 billion in profit in the first three months of 2020, despite what it called “a significant and sudden slowdown” in advertising.\n “If these people were promised jobs at Alphabet, which is worth a trillion dollars, it seems like the company has a responsibility to take them on,” said Ben Gwin, who works as a data analyst in a Google office for HCL America, a contracting agency. “It’s not like Google can’t afford it.”\n Mr. Gwin led a unionization effort for contract technical workers at Google’s offices in Pittsburgh  last year.\n “As we’ve publicly indicated, we’re slowing our pace of hiring and investment, and as a result are not bringing on as many new people — full time and temporary — as we’d planned at the beginning of the year,” said Alex Krasov, a Google spokeswoman.\n Ruth Porat, chief financial officer for Alphabet, told analysts last month that the company was cutting expenses by not hiring as many new employees as initially projected. She did not address contract or temp workers.\n  Google has taken some steps to help its temp and contract workers. In March, the company said it would extend the assignments of temp workers whose jobs were scheduled to end from March 20 to May 15 by 60 days.\n The company also said it would continue to pay contract workers affected by office closures such as people who serve food in the company’s cafeterias. And it established a fund to allow contingent workers  to take paid sick leave if they exhibit coronavirus symptoms or can’t come to work because they’re quarantined.\n Like many technology companies, Google depends on a large number of temps, vendors and contractors to perform a wide variety of jobs, including cafeteria workers, maintenance workers, recruiters, content moderators and software testers. For the company, these workers cost less than full-time employees, and Google has no long-term obligation to them, making it easy to hire them or eliminate their positions.\n Last year, 10 Democratic senators  called on Google to convert its temporary and contract workers to full-time employees, saying the company should stop its “anti-worker practices” and treat all of its workers equally.\n  Google pays staffing companies to find the workers and provide them with salaries and benefits as their employer. But Google interviews prospective candidates and signs off on hiring, deciding where they work, what they do and when to fire them.\n Touching contaminated objects and then infecting ourselves with the germs is not typically how the virus spreads. But it can happen. A number  of studies of flu, rhinovirus, coronavirus and other microbes have shown that respiratory illnesses, including the new coronavirus, can spread by touching contaminated surfaces, particularly in places like day care centers, offices and  hospitals. But a long chain of events has to happen for the disease to spread that way. The best way to protect yourself from coronavirus — whether it’s surface transmission or close human contact — is still social distancing, washing your hands, not touching your face and wearing masks.\n  Common symptoms  include fever, a dry cough, fatigue and difficulty breathing or shortness of breath. Some of these symptoms overlap with those of the flu, making detection difficult, but runny noses and stuffy sinuses are less common.  The C.D.C. has also added chills, muscle pain, sore throat, headache and a new loss of the sense of taste or smell as symptoms to look out for. Most people fall ill five to seven days after exposure, but symptoms may appear in as few as two days or as many as 14 days.\n  If air travel is unavoidable,  there are some steps you can take to protect yourself. Most important: Wash your hands often, and stop touching your face. If possible, choose a window seat. A  study from Emory University found that during flu season, the safest place to sit on a plane is by a window, as people sitting in window seats had less contact with potentially sick people. Disinfect hard surfaces. When you get to your seat and your hands are clean, use disinfecting wipes to clean the hard surfaces at your seat like the head and arm rest, the seatbelt buckle, the remote, screen, seat back pocket and the tray table. If the seat is hard and nonporous or leather or pleather, you can wipe that down, too. (Using wipes on upholstered seats could lead to a wet seat and spreading of germs rather than killing them.)\n  More than 40 million people — the equivalent of 1 in 4 U.S. workers — have filed for unemployment benefits since the pandemic took hold. One in five who were working in February reported losing a job or being furloughed in March or the beginning of April,  data from a Federal Reserve survey released on May 14 showed, and that pain was highly concentrated among low earners. Fully 39 percent of former workers living in a household earning $40,000 or less lost work, compared with 13 percent in those making more than $100,000, a Fed official said.\n  There is an uptick in  people reporting symptoms of chilblains, which are painful red or purple lesions that typically appear in the winter on fingers or toes. The lesions are emerging as yet another  symptom of infection with the new coronavirus. Chilblains are caused by inflammation in small blood vessels in reaction to cold or damp conditions, but they are usually common in the coldest winter months. Federal health officials do not include toe lesions in the list of coronavirus symptoms, but some dermatologists are pushing for a change, saying so-called Covid toe should be sufficient grounds for testing.\n  Yes, but make sure you keep six feet of distance between you and people who don’t live in your home.  Even if you just hang out in a park, rather than go for a jog or a walk, getting some fresh air, and hopefully sunshine, is a good idea.\n  Taking one’s temperature to look for signs of fever is not as easy as it sounds, as “normal” temperature numbers can vary, but generally, keep an eye out for a temperature of 100.5 degrees Fahrenheit or higher. If you don’t have a thermometer (they can be pricey these days), there are  other ways to figure out if you have a fever, or are at risk of Covid-19 complications.\n  The C.D.C. has  recommended that all Americans wear cloth masks if they go out in public. This is a shift in federal guidance reflecting  new concerns that the coronavirus is being spread by infected people who have no symptoms. Until now, the C.D.C., like the W.H.O., has advised that ordinary people don’t need to wear masks unless they are sick and coughing. Part of the reason was to preserve medical-grade masks for health care workers who desperately need them at a time when they are in continuously short supply. Masks don’t replace hand washing and social distancing.\n  If you’ve been exposed to the coronavirus or think you have, and have a fever or symptoms like a cough or difficulty breathing, call a doctor. They should give you advice on whether you should be tested, how to get tested, and how to seek medical treatment without potentially infecting or exposing others.\n  If you’re sick and you think you’ve been exposed to the new coronavirus,  the C.D.C. recommends that you call your healthcare provider and explain your symptoms and fears. They will decide if you need to be tested. Keep in mind that there’s a chance — because of a lack of testing kits or because you’re asymptomatic, for instance — you won’t be able to get tested.\n  Charity Navigator, which evaluates charities using a numbers-based system, has a running list of nonprofits working in communities affected by the outbreak. You can give blood through the  American Red Cross, and  World Central Kitchen has stepped in to distribute meals in major cities.\n When Google pulled the offers to prospective workers, the company told the staffing companies, which included firms like Accenture, Cognizant and Adecco, that “we’ll look to you to have the conversations with the individuals who won’t be onboarded.” Google said it was “hopeful” that the “agencies will be able to find other assignments” for the candidates.\n It was not immediately clear which countries were most affected in the decision, but some of the workers are in the United States, India and the Philippines. This was the second wave of rescinded job offers for temps and contract workers. Google had pulled offers for several dozen temp workers in April.\n Joli Holland was one of the candidates whose job offers was rescinded in mid-April. She was working as a lead teller at Wells Fargo when Adecco contacted her about a recruiter position working at Google in Mountain View, Calif. After a few rounds of interviews, she was offered the position with a start date of March 23.\n She was hopeful that she would get her foot in the door with a temporary job and land a full-time position at Google. Before she gave her two-week notice to Wells Fargo, she checked with Adecco about whether the job at Google was safe given the growing concerns about the coronavirus. Ms. Holland said she was assured that everything “should be fine.”\n Another candidate whose offer was rescinded expressed similar concerns to another recruiter at Adecco. This person, who asked not to be identified because they still wanted to work at Google and were worried about being blacklisted for speaking out, said the recruiter said “Google always does the right thing, so I wouldn’t worry about it.”\n A few days before Ms. Holland was set to start, she was told that her start date at Google would be pushed back to April 6. Then it was postponed to April 13 and again to April 20, a Monday. On the Friday before she was set to begin her job, Ms. Holland said she was told that the company was rescinding all temp worker offers. She didn’t receive any money while she waited to start at Google, nor did she get any severance.\n “I’m disappointed, because not a lot of people are hiring right now,” she said. She hadn’t filed for unemployment because she left her last job voluntarily. Still, Ms. Holland said she still hoped to work for Google because it would still be a great opportunity.\n “I am disappointed, but it hasn’t completely soured me on the company,” she said. “I’d still like to work there.”", "posttime": "2020-05-29 21:55:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,取消,rescinds", "title": "谷歌取消对合同工的聘用", "title_en": "Google rescinds offer to contract workers", "transed": 1, "url": "https://www.nytimes.com/2020/05/29/technology/google-rescinds-job-offers-to-contract-workers.html", "via": "", "real_tags": ["google", "谷歌", "取消", "rescinds"]}, {"category": "", "categoryclass": "", "imagename": "580c2dcf55477ffa5762122766b7758e.jpg", "infoid": 1004237, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "还记得2019年的那个故事吗？当时，在线订购应用GrubHub被抓到创建了数以千计的虚假公司网站，唯一的目的就是超越真正的所有者的网站，这样他们就可以向在线订单中注入费用。\n这不仅听起来很可疑，而且确实如此，他们很快就结束了这一功能。一个被忽视的重要细节是，他们不仅建立了一个假网站，然后他们会积极地声称该网站地址是Google My Business的官方地址，然后在Google Maps上显示他们的假网站，在搜索结果知识面板等中显示他们的假网站。\n快进近一年后，我们偶然发现了另一位年度不道德增长黑客的竞争者，2020&34；。\n一家名为Slice的初创公司显然非常喜欢格鲁布的想法，他们开始做同样的事情，但这一次也看到了一个机会，让格鲁布抢先一步获得廉价产品，从而获得了他们的服务。\n他们的把戏集中在知识面板上。在搜索结果中有一块标价的房地产，还有一个谷歌的奖杯项目。它不仅具有实体(例如本地披萨餐厅)的语义数据，而且如果您是……，您还可以将其作为您自己的数据来索赔。🥁..。根据.🥁的说法，车主..。在谷歌上搜索我的业务。我想你知道这是怎么回事了吧？\n通过申请业务，您可以管理知识面板中的特殊元素，如营业时间和联系电话号码。但是你也可以发布关于你企业的新闻，包括有趣的工作机会。偶然的是，我们在Slice的朋友们有很多关于数百家当地企业的新闻，每一家都有这个令人惊叹的优惠：订购提货和送货。这是一个很棒的优惠(很抱歉在这里滥用撇号)。\n结果是什么呢？看看你自己(真的，点击它)。山谷里的一件美丽的事情。Slice能够注入他们的营销虚伪的报价，并免费索要SERP的大片！(傻瓜格鲁布正在为一则广告买单，哈！)。不通过Slice点餐几乎是不可能的。\n总而言之。Slice创建了非官方网站，声称谷歌“我的商业档案”，然后开始推出虚假的、经过验证的优惠，所以每当有人搜索他们最喜欢的当地披萨店时，Slice就无法在搜索结果中绕开Slice。为Slice带来了更多的免费点击和安装，并为企业主带来了甜蜜的Slice-Order-Tax税。\n聪明？当然.。但我想我们手上有一个颁奖典礼的潜在获胜者.", "note_en": "Remember that story from 2019 where Grubhub, a online ordering app, was  caught creating,  thousands of fake company websites for to sole purpose of outranking the true owner&#39;s site so they could inject their fees into online orders?\n  It not only sounded shady, it was and they  ended this &#34;feature&#34; quickly after. An important overlooked detail was that they did not only setup a fake website, they would actively then  claim the website address as being official on Google My Business, which would then feature their fake website on Google Maps, in the search results Knowledge Panel, etc.\n  Fast forward almost one year, and we stumbled upon another contender for the &#34;Unethical Growth Hacker of the Year, 2020&#34;.\n  A start-up named Slice, apparently liked Grubhub&#39;s idea so much, they started doing the same, but this time also saw an  opportunity to one-up Grubhub&#39;s attempt in acquiring cheap leads to their service.\n  Their trick centers around the Knowledge Panel. A priced piece of real estate in the search results, and a  trophy project by Google. It not only features semantic data of an entity (e.g. Local Pizza restaurant) but you can also &#34;claim&#34; it as your own if you are... 🥁... the owner according to...🥁... Google My Business. I think you see where this is going?\n  By claiming a business you can manage special elements in the knowledge panels, such as opening hours and contact phone numbers. But you can also  post &#34;news&#34; about your business, including &#34;interesting offers&#34;. And by chance our friends at  Slice have lots of &#34;news&#34; on hundreds of local businesses with every single one having this amazing offer: &#34; Order Pickup and Delivery&#34;. That is some great &#34;offer&#34; (sorry for the abuse of apostrophes here).\n    The result?  Look yourself (really, click it). A thing of beauty in the Valley. Slice is able to inject their  marketing fluff offers and claim large pieces of the SERP, for free! (Dumb Grubhub is paying for an ad, ha!). It is almost impossible not to order via Slice.\n  In summary. Slice creates un-official websites, claims Google My Business profiles, and then starts pushing out  fake &#34;verified&#34; offers so whenever someone searches for their favorite local pizza place, there is no way around Slice in the search results. Leading to more free clicks and installs for Slice and a sweet  Slice-order-tax for the business owners.\n  Smart? Sure... but I think we have a potential winner for that awards ceremony on our hands...", "posttime": "2020-05-29 21:54:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,google,谷歌,slice,evil", "title": "Slice在谷歌的邪恶增长黑客", "title_en": "Slice's evil growth hack in Google", "transed": 1, "url": "https://yvoschaap.com/weblog/slices_evil_growth_hack", "via": "", "real_tags": ["黑客", "google", "谷歌", "slice", "evil"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004236, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "距离冠状病毒流行高峰已过去10周，英国各地仍然严重缺乏个人防护用品和新冠肺炎检测试剂盒，特别是在农村和偏远地区。\n然而，在内赫布里底群岛的穆尔岛上，重要的补给每天最多到达四次。他们是由无人机从大陆空运过来的，这项试验可能会导致NHS定期使用无人机将设备和医疗样本空运到苏格兰大约90个有人居住的岛屿中的许多岛屿。\n无人机行业希望展示公共无人机可以帮助对抗新冠肺炎，甚至可以通过加快测试时间来拯救生命，这可以为更广泛地采用无人机技术铺平道路。\n美国投资银行高盛(Goldman Sachs)认为，如果世界各国政府允许无人机用于从警务和边境巡逻到桥梁等重要基础设施的勘测，甚至取代轻便摩托车骑手直接将披萨和炸鸡送到你家门口，无人机可能会催生1000亿美元(800亿GB)的市场。\n在大流行中，不仅仅是穆尔岛上的2800人正在接受无人机的个人防护装备。另一项审判是将个人防护装备从索伦特河畔的李运送到怀特岛。这两项试验都需要得到民航局(CAA)的批准，因为规则禁止无人机飞行在远程飞行员的视线之外。\n无人机还被用来在卢旺达和加纳的多达2500家医院和农村卫生站来回发送冠状病毒测试。本周，美国第一架医疗无人机向北卡罗来纳州的前线工作人员发送了一批个人防护用品。\n阿盖尔和布特医疗和社会护理合作伙伴关系的战略规划主管斯蒂芬·惠斯顿(Stephen Whiston)表示，无人机可以改变医生在苏格兰西部2500平方英里的农村社区诊断和治疗患者的速度。这包括穆尔岛和其他几个岛屿。\n惠斯顿说：“从这里的全科医生诊所接实验室的效率可能非常低，如果错过渡轮，延误从几个小时到两天不等。当你谈到严重和发展中的情况时，这种延误是非常严重的。“\n从大陆欧班的洛恩和群岛地区综合医院到岛西北部Craignure的Mull和Iona社区医院的飞行16公里(10英里)需要大约15分钟，相比之下，公路和渡轮需要90分钟到6个小时。\n惠斯顿说，为期两周的无人机交付试验是与无人机运营商Skyports和国防和技术公司泰利斯(Thales)合作进行的，在冠状病毒袭击之前就计划好了，但由于大流行而加速。\n惠特森说，今年冬天的第二次测试至关重要，因为“苏格兰的天气可能非常具有挑战性”。他认为，如果成功的话，无人机可以部署在苏格兰的NHS各地。“我们将寻求连接更多我们的岛屿，”他说。“我们一直在与苏格兰各地的同事分享我们在这里所做的事情，人们对在西岛、克莱德和格兰宾群岛使用它非常感兴趣。”\n提供技术和飞行规划的泰利斯公司(Thales)空中战略和营销主管雷蒙德·李(Raymond Li)表示，事实证明，这场流行病对无人机行业来说非常及时，因为监管机构采取行动，加快了开始试飞的审批程序。\n“这也将让我们向公众展示无人机的社会效益，”他说。\n“人们会在盖特威克(2018年，当时一架流氓无人机飞越跑道，导致数百个航班被取消)看到关于无人机的头条新闻，并对无人机感到担忧。新冠肺炎很可能会改变人们对其有用性的看法。他们会看到无人机可以帮助拯救生命，人们也会看到给自己和家人带来的好处。“。\n在目前的试验中，使用德国制造的Wingcopter无人机，训练有素的操作员必须驾驶无人机，并通过直播视频积极指挥它。但通过允许无人机自主执行任务，未来的成本可能会大大降低。李说：“想象一下，一支由数千架无人机组成的舰队，从搜救到边境巡逻，再到运送食物，无所不包。甚至可能会有空中出租车(在无人驾驶的情况下用无人机运送人)。“。\n支持创新的慈善机构Nesta Challenges未来城市负责人霍莉·贾米森(Holly Jamieson)表示，无人机在现实世界中的使用将有助于引发一场关于该技术的使用及其对个人隐私影响的公开对话。\n“你必须记住，冠状病毒大流行是一个非常特殊的事件，公众更容易接受很多我们在正常情况下不会容忍的事情。无人机可能也是如此，“她说。\nNesta的研究表明，到2035年，使用无人机协助公共服务，包括运送NHS测试和样本，以及支持警察和消防服务，可以为公共部门节省11亿英镑。\nJamieson说：“人们担心这会影响他们的隐私和噪音。公众参与绝对是关键。我们需要问的是，谁应该被允许操作它们，他们应该可以去哪里，以及为了什么目的。我们头顶上的那片空域是需要塑造的基础设施。“", "note_en": "Ten weeks on from the peak of the coronavirus pandemic there are still acute shortages of personal protective equipment (PPE) and Covid-19 testing kits across the UK, particularly in rural and isolated locations.\n On the Isle of Mull in the Inner Hebrides, however, the vital supplies arrive up to four times a day. They are flown in from the mainland by drone in a trial that could lead to the  NHS regularly using drones to fly equipment and medical samples to many of Scotland’s roughly 90 inhabited islands.\n The unmanned aircraft industry hopes that showing the public drones can help in the fight against Covid-19, perhaps even save lives by speeding up test time turnarounds, could pave the way for wider adoption of drone technology.\n US investment bank  Goldman Sachs  believe  drones could spawn a $100bn (£80bn) market if governments around the world allowed them to be used for everything from policing and border patrol to surveying vital infrastructuresuch as bridges, or even replacing moped riders to deliver pizzas and fried chicken direct to your door.\n It’s not just the 2,800 people on Mull who are receiving PPE by drone in the pandemic. Another trial is carrying PPE from Lee-on-the-Solent to the Isle of Wight. Both trials required approval by the Civil Aviation Authority (CAA) as rules ban drone flights beyond the  line of sight of the remote pilot.\n Drones are also being used to send coronavirus tests back and forth to up to 2,500 hospitals and rural health outposts in Rwanda and Ghana.  This week the first US medical drone flight despatched a consignment of PPE to  frontline workers in North Carolina.\n Stephen Whiston, head of strategic planning for the Argyll and Bute health and social care partnership said drones could transform the speed with which doctors diagnose and treat patients across the authority’s rural community which is spread across 2,500 sq miles of western  Scotland. This includes Mull and several other islands.\n Whiston said: “Laboratory pick ups from GP surgeries up here can be very inefficient, with delays ranging from a couple of hours to two days if ferries are missed. When you’re talking about serious and developing conditions those sort of delays are very serious.”\n The 16km (10 mile) flight from Lorn and Islands district general hospital in Oban, on the mainland, to Mull and Iona community hospital in Craignure, on the north-west of the island, takes about 15 minutes compared with between 90 minutes to six hours by road and ferry.\n Whiston said the two-week drone delivery trial, which is being run in partnership with drone operator Skyports and defence and technology company Thales, was planned before coronavirus struck but has been accelerated by the pandemic.\n A second test this winter is crucial because “the Scottish weather can be very challenging”, says Whitson. If it’s successful he thinks drones could be deployed across NHS Scotland. “We would look to link up more of our islands,” he said. “And we have been sharing what we’re doing here with colleagues across Scotland, and there is significant interest about using it in the Western Isles, Clyde and the Grampians.”\n Raymond Li, head of air strategy and marketing for Thales, which is providing technology and flight planning , said the pandemic had proved very timely for the drone industry as regulators acted to speed up the approval process to start trial flights.\n “This will also allow us to show the public the societal benefits of drones,” he said.\n “People will have seen the headlines about  the drone at Gatwick [in 2018, when hundreds of flights were cancelled when a rogue drone flew over the runway] and been worried about drones. Covid-19 may well change how people see their usefulness. They will see that drones can help save lives, and people will see the benefits to themselves and their families.”\n In the current trial, using a German-made  Wingcopter drone, a trained operator must pilot the drone and actively direct it via a live video feed. But future costs could be greatly reduced by allowing drones to fly missions autonomously. Li said: “Just imagine a fleet of thousands of drones doing everything from search and rescue, and border patrol to delivering food. There could even be air taxis [in which people are transported in drones without pilots].”\n  Holly Jamieson, head of future cities at Nesta Challenges, a charity supporting innovation, said the real-world use of drones would help prompt a public conversation on the use of the technology and its implications on personal privacy.\n “You have to remember that the coronavirus pandemic is a pretty exceptional event and the public are a lot more accepting about a lot of things we wouldn’t put up with in normal times. It could be the same with drones,” she said.\n Research by Nesta suggests using drones to assist public services, including transporting NHS tests and samples and supporting the police and fire services, could save the public sector £1.1bn by 2035.\n Jamieson said: “People are concerned about the impact on their privacy and the noise. Public engagement is absolutely key. We need to be asking who should be allowed to operate them, where should they be able to go, and for what purposes. That piece of airspace above our heads is infrastructure that needs to be shaped.”", "posttime": "2020-05-29 21:38:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,coronavirus,病毒,农村,deliveries", "title": "冠状病毒爆发期间苏格兰农村无人机送货量飙升", "title_en": "Drone deliveries soar in rural Scotland during coronavirus outbreak", "transed": 1, "url": "https://www.theguardian.com/uk-news/2020/may/29/drone-deliveries-soar-in-rural-scotland-during-coronavirus-outbreak", "via": "", "real_tags": ["冠状病毒", "病毒", "农村"]}, {"category": "", "categoryclass": "", "imagename": "4b7d9ecba1881eda1176c27aaa7da297.png", "infoid": 1004235, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "@wakeccoding也许我们应该将这些问题提交给微软支持部门？至少这样它就可以修好了。看来代码团队可能人手不足。我没有看到任何迹象表明我们很快就会得到ARM64的vscode，拉取请求似乎已经完成，它没有被审查/合并。我相信原因是他们不确定他们是否有足够的人力来审查、测试和支持WoA。虽然从点对点的关系上完全可以理解(我完全不会责怪vscode开发人员)，但从客户到公司的关系来看，这是很难理解的。这让我大失所望，特别是因为Surface pro x在当前的危机中是一款非常棒的笔记本电脑。我们都认为一些应用程序不会为它编译，但微软自己的旗舰开发应用程序没有为它编译有点令人沮丧，特别是在已经有了构建就绪的情况下。由于微软内部缺乏协调，似乎真的是天文数字的工作量和爱被点燃了。相比之下，DotNet核心团队正在构建一个WoA安装程序，并且已经有了可用的构建。为什么似乎没有人负责确保这一倡议得到贯彻，并分配资源使其在整个业务范围内都能实现？看起来他们只是说我们正在做工作，然后试图对开发人员施加压力，就好像他们还没有在做工作一样。也许他们甚至没有把这件事作为一件重要的事情和其他球队提出来。", "note_en": "@awakecoding perhaps we should be filing issues for those to Microsoft support I guess? At least then it could get fixed. It appears that the Code team may be understaffed. I&#39;m not seeing any indication that we will be getting vscode for arm64 any time soon, the pull request appears to be completed and it&#39;s not being reviewed/merged. I believe the reason is they aren&#39;t sure they have the manpower to review, test and support WoA. While completely understandable from a peer to peer relation (I don&#39;t blame vscode devs at all), it&#39;s very hard to understand in terms of a customer to corporation relation. This is a tremendous disappointment to me, especially because the surface pro x is a fantastic laptop for the current crisis. We all figured that some apps wouldn&#39;t be compiled for it, but it&#39;s a bit crushing that Microsoft&#39;s own flagship development applications aren&#39;t being compiled for it, especially when there is a build ready. Seems like a truly astronomical amount of work and love just being set on fire because of a lack of coordination within Microsoft. By contrast the dotnet core team is building an WoA installer and have a build already available. Why does it appear there was nobody tasked with making sure this initiative was followed through, and resources allocated to make it attainable across the business? It seems like they just said &#34;We&#39;re doing WoA&#34; and then tried to put pressure on the devs as though they weren&#39;t already doing a job. Maybe they didn&#39;t even bring it up with other teams as a thing that mattered.", "posttime": "2020-05-29 21:22:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,arm64,build", "title": "Windows/ARM64下VSCode的内幕构建", "title_en": "Insider Build of VSCode for Windows/ARM64", "transed": 1, "url": "https://github.com/microsoft/vscode/issues/33620#issuecomment-635367046", "via": "", "real_tags": ["windows", "arm64", "build"]}, {"category": "", "categoryclass": "", "imagename": "18a324dbfb804a320fab85a8c1cd02e7.png", "infoid": 1004234, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Airflow是一个由社区创建的平台，用于以编程方式编写、计划和监控工作流。\n机器学习是业界的热门话题。如果不是涉及到数据处理，它就不会这么酷。\n假设您有一个执行Twitter情感分析的ML模型。现在，您想要在Twitter上为您最喜欢的人每天的tweet运行该模型。这样的工作流应该是这样的。\n如您所见，数据从管道的一端流向另一端。可以有分支，但不能有循环。\n使用cron创建和维护任务之间的关系是一场噩梦，而在AirflowAirflow中，创建和维护任务之间的关系就像编写Python代码一样简单。\nCron需要外部支持来记录、跟踪和管理任务。用于跟踪和监控工作流执行的Airflow UI。\n除非外部配置，否则Cron作业不可重现。AirflowAirflow保留所有执行任务的审核跟踪。\nAirflow提供了DAG Python类来创建有向无环图，这是工作流的表示形式。\n从Airflow.model导入DAG从airflow.utils.date导入Days_agoargs={&#39；start_date&#39；：day_ago(0)，}dag=DAG(dag_id=&#39；example_bash_Operator&#39；，default_args=args，Schedule_Interval=&#39；*&#39；)Schedule_Interval是每个工作流运行的间隔。&#39；*&#39；表示任务需要每分钟运行一次。不要在这个语法上绞尽脑汁。您可以使用https://crontab.guru/.来处理这些问题。\nfrom airflow.operators.bash_Operator导入BashOperatorfrom airflow.operators.python_Operator import PythonOperator def print_function()：print(&#34；嘿，我是一项任务&#34；)run_this_last=PythonOperator(task_id=&#39；run_this_last&#39；，dag=dag，python_callable=print_function)run_this=BashOperator(task_id=&#39；)。&gt；run_this_last Web服务器是负责处理所有UI和REST API的组件。\n调度程序每隔n秒遍历DAG，并调度要执行的任务。\n调度程序还有一个称为Executor的内部组件。执行者负责启动工人并执行任务直到完成。\nSequentialExecutor一次仅运行一个任务。工作进程运行的计算机与调度程序运行的计算机相同。\nLocalExecutor与Sequential Executor相同，不同之处在于它可以同时运行多个任务。\n因此，甚至在Kubernetes之前，CeleryExecutor就已经成为AirflowAirflow的一部分很长一段时间了。\nCeleryExecutors有固定数量的工作进程在计划任务时执行任务。\n芹菜管理工人。万一失败了，芹菜会吐出一个新的。\n芹菜需要RabbitMQ/Redis to来对任务进行排队，这是对AirflowAirflow已经支持的轮子的重新发明。\nKubernetesExecutor在单独的Kubernetes Pod中运行每个任务。与CeleryCelery不同，它可以按需旋转工作区，从而最大限度地利用资源。\n对分配给任务的资源进行细粒度控制。可以定义任务级别所需的CPU/内存量。\n现在我们已经了解了气流的基础知识，让我们在下一篇文章中学习如何编写我们的工作流程。", "note_en": "Airflow is a platform created by the community to programmatically author, schedule, and monitor workflows.\n Machine learning is the hot topic of the industry. It won&#39;t be so cool if not for the data processing involved\n   Imagine you have an ML model that does twitter sentiment analysis. Now you want to run that model for your favorite people on twitter for their tweets every day. Such a workflow would look something like this.\n  As you can see, the data flows from one end of the pipeline to the other end. There can be branches, but no cycles.\n   With cron creating and maintaining a relationship between tasks is a nightmare, whereas, in AirflowAirflow, it is as simple as writing Python code.\n Cron needs external support to log, track, and manage tasks. Airflow UI to track and monitor the workflow execution\n Cron jobs are not reproducible unless externally configured. The AirflowAirflow keeps an audit trail of all tasks executed.\n    Airflow provides  DAG Python class to create a Directed Acyclic Graph, a representation of the workflow.\n    from Airflow.models import DAGfrom airflow.utils.dates import days_agoargs = { &#39;start_date&#39;: days_ago(0),}dag = DAG( dag_id=&#39;example_bash_operator&#39;, default_args=args, schedule_interval=&#39;* * * * *&#39;,)    Schedule_interval is the interval in which each workflow is supposed to run.  &#39;* * * * *&#39; means the tasks need to run every minute. Don&#39;t scratch your brain over this syntax. You can play around with these using  https://crontab.guru/.\n       from airflow.operators.bash_operator import BashOperatorfrom airflow.operators.python_operator import PythonOperator       def print_function(): print (&#34;Hey I am a task&#34;)run_this_last = PythonOperator( task_id=&#39;run_this_last&#39;, dag=dag, python_callable=print_function)       run_this = BashOperator( task_id=&#39;run_after_loop&#39;, bash_command=&#39;echo 1&#39;, dag=dag,)       run_this &gt;&gt; run_this_last         The webserver is the component that is responsible for handling all the UI and REST APIs.\n  Scheduler goes through the DAGs every  n seconds and schedules the task to be executed.\n The scheduler also has an internal component called  Executor. The executor is responsible for spinning up workers and executing the task to completion.\n     SequentialExecutor runs only one task at a time. The workers run the same machine as the scheduler is.\n      LocalExecutor is the same as the Sequential Executor, except it can run multiple tasks at a time.\n       Hence, CeleryExecutor has been a part of AirflowAirflow for a long time, even before Kubernetes.\n CeleryExecutors has a fixed number of workers running to pick-up the tasks as they get scheduled.\n  Celery manages the workers. In case of a failure, Celery spins up a new one.\n  Celery needs RabbitMQ/Redis to for queuing the task, which is reinventing the wheel of what AirflowAirflow already supports.\n  KubernetesExecutor runs each task in an individual Kubernetes pod. Unlike CeleryCelery,  it spins up worker pods on demand, hence enabling maximum usage of resources.\n  Fine-grained control over resources allocated to tasks. One can define the amount of CPU/memory required at a task level.\n    Now that we have understood Airflow&#39;s basics let&#39;s learn how to write our workflow in the next post.", "posttime": "2020-05-29 21:22:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "气流,apache,任务", "title": "阿帕奇气流简介", "title_en": "Introduction to Apache Airflow", "transed": 1, "url": "https://bhavaniravi.com/blog/apache-airflow-introduction", "via": "", "real_tags": ["气流", "apache", "任务"]}]