[{"category": "", "categoryclass": "", "imagename": "778c846a152e2049675e63a0807af38e.png", "infoid": 1002422, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尤其是现在，有东西可读是件好事。新事物，来自不同来源和不同声音的东西，不同的头脑谈论他们的想法和经历，讲述他们的故事，发布与他们相关的图片和事情。几年前，可能是8年或10年前，互联网上有博客，时间可能比很多人记忆中的都要长。你可以四处搜索，他们甚至在网络搜索中也会出现，你会发现自己正在阅读某人的博客。也许这是他们在日本找到一份教学工作时的生活编年史，记录了他们第一次如何离开美国，那里的所有新事物，滑板，结识人们，试图结识女孩，或者是一名摄影师在米诺卡岛或西班牙的某个岛屿工作了一段时间，当时音乐敲响了摇滚场面，所有的年轻人都穿着皮衣和紧身牛仔裤，随着摇滚跳舞，写下了他对自己在哪里适合这个场景的想法，因为他有点老了，但并不老，或者是一本奇怪和不老的汇编。或者是一些男人在他的车库里用木头或电子产品做的东西，或者一些日本女孩上传了自己看起来非常粉红色和充气的照片，并用它们写了一些小东西。\n如今，当每个人都被封锁，白天什么都没有，只有时间可以消磨，夜晚也是如此，你可以泡一杯热茶或一杯咖啡，然后坐下来，但当你看那里的时候，根本没有什么可读的。你不能进入那些独特的声音，写下他们关心的事情，发生在他们身上的事情。\n前几天我找了一个小时，一个也没找到。它们曾经是无穷无尽的。你只需点击你在Blogger上认识的一个博客，然后点击Blogger的随机博客按钮，或者进入你知道的博客的侧栏，那里总是有他们喜欢的博客列表，有时是四五个，有时是20个其他博客。Tumbler也是如此。\n博客过去之所以存在，是因为有了博客平台。但是Blogger在几年前就被谷歌关闭了，到现在为止，那里的博客一直在消失，你就是找不到真正的博客，而且它们不再在搜索中被索引。Tumbler也被人们用来记录他们的生活和兴趣，虽然也有很多只是图片的博客，但它最近改变了政策，现在不允许NSFW内容，这基本上损害了所有提到不完全PG的博客。所有我有书签的旧Tumbler博客我都不能再访问了，因为它们被Tumbler认为有NSFW内容。我想那些人在把所有的精力都投入到制作这样一个特别的东西之后会有什么感觉，然后Tumbler就把它毁了。这就是结束了。没有办法找到博客，也没有人在写博客，因为没有平台可供他们使用。\n但如果我能带回一样东西，我会把它们带回互联网。它们是我最怀念也是最经常怀念的东西。他们是这里最有价值的东西，除了可以更自由地获得新闻，YouTube上免费但质量不高的视频内容，我想还有一些社交媒体。但博客是你可以坐下来阅读的东西，你可以真正进入博客，以至于你甚至忘了自己在哪里，想想你想如何在生活中尝试这些事情，或者只是享受它们的写作，你可以更深入地阅读过去的博客帖子，稍后再调回，看看自从你读到关于它们的最后一篇文章以来，它们都发布了什么。\n当你搜索现在的博客时，你会看到类似这样的东西：前100个博客。如何制作一个成功的博客。最强大的50个博客。但你真正想要的是1万个不成功的博客。这句话的意思是：“当你在搜索博客时，你会看到这样的东西：如何做一个成功的博客。最强大的50个博客。但你真正想要的是1万个不成功的博客。”网络搜索现在为你的博客提供点子建议，以获得浏览量、分享和索引，但你真正想要的是没有点子。现在几乎不可能找到一个主题不集中的博客，因为这是搜索引擎关注的重点，也是网站如何获利的。但你想要的恰恰相反，一个从来没有试图集中精力，甚至从来没有想过这一点的博客。过去似乎有无穷无尽的搜索结果被谷歌和其他被谷歌扼杀的搜索引擎索引。也许你会看到4万个搜索结果。现在它说有40,000个，但你只能得到10到20页的结果，基本上都是公司的，而且很差劲。你再也看不到第100页了。即使有人建立了一个爬虫索引器，你可以用它来搜索所有东西，包括不受欢迎或被算法判定为相关的东西，那也是件好事。DuckDuckGo等替代引擎的问题是，它们只使用谷歌搜索，而不是以自己的方式爬行和索引东西。如果他们这样做了，他们将是有趣和有用的使用，而不是出于保护隐私的原因。虽然有人说谷歌变得越来越多\n隐私保护和不能将其更改为恶意使用，必须在一开始就考虑到这一点。我怀疑拉里和谢尔盖，甚至盖茨，如果他们知道它将被用来做什么，他们会以他们所做的方式创造出这样的东西。这些人现在可以尝试在他们的生活中寻找其他事情做，或者用慈善来弥补，但他们的发明是在如此极端的水平上用来对付人的可怕的工具。任何他们认为有一天可能会变大的东西，任何人都应该在一开始就参与进来，防止当它对强大的实体有用时，它可能会被负面利用。我不确定托管服务器是否可以设在美国，因为美国不保护隐私或互联网使用。我不知道哪里有。我读到阿根廷有宪法保护Insernet言论，尽管这种自由受到禁止撰写关于本国政府的文章的限制。憎恨阿根廷拥有受保护的言论自由的互联网，而美国、加拿大和欧洲却不保护互联网上的人权的实体会说，很好，因为阿根廷为恐怖主义和伤害儿童提供了支持，这是那些想要攻击个人或系统的人最喜欢的两个说法，而这些人或系统实际上并没有做错什么，他们需要引起支持者的警觉。当然，这些行为在阿根廷是被禁止的，但据我所知，他们互联网上的言论和表达是禁止的，包括那些东西。我的意思是，仅仅是这个想法：非法信息。非法言论。\n我不确定如何保护平台。或许可以及早与EFF这样值得信赖的透明组织合作，让他们定期公开审计平台，并表示，如果这一点发生变化，对平台的公开透明定期审计应该立即阻止它，用户应该立即认为它受到了损害，并停止使用它。\n此外，你必须将内容永远保存在备份的服务器上，否则，如果有一天平台会像Bloger和Tumbler那样删除这些内容，他们就不会觉得自己多年来在博客上的努力是值得的。也许平台没有太多钱，所以不能保存图片或视频，但至少应该保留文本。\n此外，平台必须盈利或承诺在不滥用用户或客人的情况下未来盈利。这可以是某家大型互联网广告公司提供的广告，也可以是作为平台一部分的广告公司提供的广告。没有太多的广告，所以博客被毁了，但可能在底部或顶部和底部都有广告，保留了属于博客作者的空间。此外，该公司可能永远不应该上市，因为我们已经看到，几家大公司或政府的参与如何让互联网(以及过去的表达形式)变得更糟，这两件事中任何一件事的参与程度都会侵蚀或完全摧毁它。\n即人们可以安全地私下写博客的平台，在这个平台上，博客不能被转化为辱骂他人的工具，隐私、思想、表达和讨论的自由得到维护，言论不会受到寒蝉效应。", "note_en": "Nowadays especially it&#39;s nice to have things to read. New things, things from various sources and various voices, various minds talking about their thoughts and experiences, telling their stories, posting pictures and things that are relevant to them. A couple of years ago, maybe 8 or 10 so maybe longer than a lot of people will be able to remember, there were blogs on the internet. You could search around and they&#39;d come up even in websearch, and you&#39;d find yourself reading someone&#39;s blogs. Maybe it was chronicles of their life as they got a job teaching in Japan and how it was leaving American for the first time and all the new things there and skateboarding and meeting people and trying to meet girls, or a photographer working for a while in Minorca or some island off Spain when music hit a rock scene period and all the young people were dressing up in leather and tight jeans and going out dancing to dance rock and writing about his thoughts on where he fit into the scene as he was kind of older but not old, or a compilation of weird and unexplained science and gnostic wisdom, or the things some guy was making out of wood or electronics in his garage, or some Japanese girl who posted pictures of herself looking extremely pink and pneumatic and writing little things with them.\n Nowadays when everyone is on lockdown and there are days with nothing but spaces of time to pass, nights too, and you can make a hot tea or a coffee and sit down but when you look there&#39;s nothing to read. You can&#39;t access those unique voices writing about the things they care about, that are happening to them.\n The other day I searched for an hour and couldn&#39;t find even one. They used to be endless. You&#39;d just click on one you knew on Blogger and either click Blogger&#39;s random blog button, or go to the sidebar of the blog you knew where they always had a list of blogs they liked, sometimes four or 5, sometimes 20 other blogs. And the same with Tumbler.\n Blogs used to exist because there were blogging platforms. But Blogger was shut down by Google years ago, and the blogs on there have been disappearing until now you just can&#39;t find really any, and they&#39;re not indexed in search anymore. Tumbler also was used by people to blog about their lives and interests, although there were also a lot of just pictures blogs, but it recently changed its policy and now permits no NSFW content, which compromised basically every blog that mentioned something not completely PG. All the old Tumbler blogs I had bookmarks for I can&#39;t even access anymore because they were deemed by Tumbler to have NSFW content. I think about how those people must feel after putting all that work into making such a special thing and then Tumbler just destroys it. And that&#39;s the end. There&#39;s no way to find blogs, and no one is writing them because there&#39;s no platform for them.\n But they would be the one thing I&#39;d bring back to the internet if I could bring one thing back. They&#39;re the thing I miss the most and the most often. They were the most valuable thing on here, besides freer availability of news, free although low quality video content on YouTube, and I guess some kinds of social media. But blogs are something you can sit down and read and get really into to the point you forget where you even are, and think about how you want to try those things maybe in your life, or just enjoy their writing, and you can read deeper into them into past blog posts, and tune back in later and see what they&#39;ve posted since the last things you read about them.\n When you search for blogs now on you see things like &#39;Top 100 Blogs.&#39; &#39;How to Make a Successful Blog.&#39; &#39;Most Powerful 50 Blogs.&#39; But what you really want is 10,000 unsuccessful blogs. Web search now suggests ideas for your blogs to get views, shares, indexed, but what you really want is no ideas. It&#39;s almost impossible now to find a blog that&#39;s not on a focused theme because that&#39;s what search engines focus on and how websites profit. But you want the opposite, a blog that never tried to focus or even thought about it. There used to seem to be endless search results indexed by Google and the other search engines that were killed by Google. Maybe you&#39;d see 40,000 results for your search. Now it says there are 40,000 but you only get 10 or 20 pages of results you can get to, all basically corporate and lame. You can&#39;t get to the 100th page anymore. It&#39;d be nice even if someone built a crawler-indexer that you could use to search for everything including things that weren&#39;t popular or judged by algorithms to be &#39;relevant.&#39; The problem with alternative engines like DuckDuckGo is they just use Google Search and don&#39;t crawl and index things in their own way. If they did they&#39;d be fun and useful to use for reasons other than protection of privacy. Although some people say Google is becoming more and more useless to the point it won&#39;t be revived and may collapse for this reason although even if that were true we&#39;d still have to suffer with it for years.\n  A couple of notes, in case anyone is thinking of starting a new blogging platform:\n There&#39;s no point if you&#39;re not going to protect people, and that means their privacy. Nowadays people won&#39;t share content simply because they don&#39;t trust the internet to share content to it. You have to provide for them to be anonymous and protected forever, which means letting people create accounts easily with just an email or something similar, and log into them or recover their password throught the email if they lose their password, and never any locking them out because you noticed suspicious activity or anything bogus like that and making them provide personal details. That is abuse of trust and abuse of people. They have to be able to blog without thinking someone is going to bring it up and file it away forever and maybe they won&#39;t get a job because of it, or their tyrannical government will think they&#39;re an agitator and attack them or an adversary will use it for selective characger defamation sometime. They have to be able to abandon a blog, start a new one, blog there, abandon it, etc. Otherwise they won&#39;t feel free to write, so you may as well not say you&#39;re going to provide a blogging platform for people if you won&#39;t protect them.\n Privacy protection and the inability of this to be changed to be used maliciously must be baked in at the start. I doubt Larry and Sergei or even Gates would have created what they did the way they did if they knew what it would be used for. Those guys now can try to find other things to do with their lives now, or make up for it with charity, but their inventions are tools terribly used against people on such an extreme level. Anybody creating anything they think might someday become big should bake in at the start prevention against the possibility it could be used negatively when it becomes useful to powerful entities. I&#39;m not sure the hosting servers could be based in the US because the US doesn&#39;t protect privacy or internet usage. I&#39;m not sure where does. I read that Argentina has constitutional law that protect insternet expression, although that freedom is tempered by the prohibition of writing about their own government. Entitites that hate that Argentina has a protected free speech internet while the US and Canada and Europe don&#39;t protect human rights on the internet will say &#39;Well because of that Argentina is providing for terrorism and harming children, the two favorite claims of people who want to attack people or systems when those people or systems haven&#39;t done anything actually wrong and they need to raise alarm in their supporters. Of course, those acts are prohibited in Argentina, but speech and expression on their internet is not, including of those things, as far as I know. I mean, just the idea: &#39;illegal information.&#39; &#39;Illegal speech.&#39;\n I&#39;m not sure how a platform could be protected. Perhaps by partnering early with a trusted, transparent organization like the EFF and having them publicly audit the platform on a regular basis and saying that if this is ever altered and public transparent regular audits of the platform stop it&#39;s users should immediately consider it compromised and stop using it.\n Also, you have to keep the content on the server of backed up forever, otherwise they won&#39;t feel their effort in blogging for years will be worthwhile if the platform will someday just erase it like Blogger and Tumbler did. Maybe the platform doesn&#39;t have a ton of money so it has to not save the images or videos, but at least the text should be maintained.\n Also, the platform must be profitable or promise future profit without abusing users or guests. This can simply be ads provided by one of the big internet ads companies or an ads company that&#39;s part of the platform. Not too many ads so the blogs are ruined, but maybe an ad at the bottom or perhaps the top and bottom, preserving the space that belongs to the blogger. Also the company probably should not ever go public, as we have seen how the involvement of a couple of big corporations or governments made the internet (and past forms of expression) worse, and that any degree of involvement of either of these two things will eat away or completely destroy it.\n Ie, a platform where people can securely and privately blog, where it can&#39;t be converted into a tool for abuse of people, and where freedom of privacy, thought, expression and discussion is maintained and there is no &#39;chilling effect on speech.&#39;", "posttime": "2020-05-17 02:33:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "博客,带回,internet", "title": "如果我能把一件事带回互联网，那就是博客", "title_en": "If I could bring one thing back to the internet it would be blogs", "transed": 1, "url": "http://tttthis.com/edit/blog/if-i-could-bring-one-thing-back-to-the-internet-it-would-be-blogs", "via": "", "real_tags": ["博客", "带回", "internet"]}, {"category": "", "categoryclass": "", "imagename": "059ee2f3bdffba96f0b77506eee115c8.png", "infoid": 1002421, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正确，我没有使用任何云功能。我的观点是，手写识别在很大程度上是为了缓解糟糕的笔记管理/索引技术，尽管如果有一个准确的HWR引擎用于一般文本输入，只要它在设备上本地运行，那就太好了。将文档以PDF格式直接导出到我的计算机非常容易；不需要任何额外的软件就可以通过Web界面导出文档，但我更喜欢使用shell脚本。对于一次性的，我只是通过将帧缓冲区的内容转储到我的计算机上来截屏，这需要大约1秒的时间。我仍然会收到安装在eMMC上的系统更新，而eMMC不会触及SD卡上的任何真实数据。", "note_en": "Correct, I don&#39;t use any cloud features. My opinion is that handwriting recognition is mostly a hack to alleviate poor note management/indexing techniques, although it would be lovely to have an accurate HWR engine for general text input so long as that runs locally on the device. Documents are super easy to export as PDF directly to my computer; it can be done without any additional software with the web interface, but I prefer to use a shell script. For one-offs, I just take a screenshot by dumping the contents of the framebuffer to my computer which takes ~1 second. I do still receive system updates which install over the eMMC which doesn&#39;t touch any of my real data residing on an SD card.", "posttime": "2020-05-17 02:32:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电脑,linux,平板,tablet", "title": "卓越的平板电脑获得Desktop Linux", "title_en": "ReMarkable Tablet Gets Desktop Linux", "transed": 1, "url": "https://old.reddit.com/r/RemarkableTablet/comments/gkktxy/desktop_linux_on_remarkable_xournal_doom_and_more/", "via": "", "real_tags": ["电脑", "linux", "平板", "tablet"]}, {"category": "", "categoryclass": "", "imagename": "158d000f35f233d2def89f0be4a02e86.png", "infoid": 1002418, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2017年，夏威夷的一台望远镜探测到了我们第一个来自另一个太阳系的天体访客-这是一个大问题，因为我们自己还没有完全弄清楚如何访问他们。“Oumuamua，这个雪茄形状的星际天体(ISO)，它的名字在夏威夷语中大致翻译为”第一个遥远的信使“，它肯定不会是最后一个经过的游客。如果我们的宇宙的故事是写在星星上的，那么即使是一个小小的碎片长途跋涉进行短暂的访问，也为科学发现提供了一个巨大的机会。但是，为了足够近地读到徘徊在我们家门口的下一篇故事，我们必须先抓住它。\n要仔细观察ISO在空间中的飞驰，时间是至关重要的。麻省理工学院航空宇航系(AeroAstro)助理教授理查德·利纳雷斯(Richard Linares)提出了一个概念，即“与星际物体会合的动态轨道弹弓”。他在一份研究提案中概述了他的想法，该提案最近被选为NASA创新先进概念(NIAC)计划的第一阶段研究，该计划“为创新的航空航天概念提供资金，这些概念可以支持和改变未来的任务。”\n“从地球上观测ISO有很多根本性的挑战--它们通常非常小，以至于太阳光需要以某种方式照亮它，我们的望远镜才能探测到它，”利纳雷斯说。他是AeroAstro空间系统实验室下属的天体动力学、空间机器人和控制实验室(AstroDynamics，Space Robotics，and Controls Laboratory)的主任。“他们的旅行速度如此之快，以至于很难团结起来，在我们拥有的很小的机会之窗内从地球上发射一项任务，然后它就会消失。”我们必须尽快到达那里，而目前的推进技术是一个限制因素。“。\n为了消除这些障碍，利纳雷斯转而建议使用静态卫星，即由恰好以合适的质量面积比建造的太阳帆实现的“静态卫星”。一个足够薄、表面积足够大的帆将具有足够低的质量，以利用太阳辐射压力来抵消太阳的引力，无论距离有多远，都会产生一种推进力，允许静止物体无限期地在原地盘旋。利纳雷斯设想在太阳系边缘部署一个星座来充当星际看门人，等待ISO越过我们的门槛将其唤醒。\n一旦探测到，太阳帆就能使宇航员迅速切换档位，并启动行动。由于静止轨道的速度为零，因此它已经处于有效轨迹的位置。一旦释放，太阳帆中储存的能量将利用太阳的引力将统计员以自由落体的轨迹投射到ISO，使其能够迎头赶上。如果时机合适，统计员可以用配备有机载传感器的立方体卫星对ISO进行标记，以便在较长一段时间内绕ISO运行，收集重要的科学数据。\n利纳雷斯说：“飞越任务往往更容易，因为它们不需要你放慢速度--你飞过物体，并试图在那个窗口尽可能多地拍摄照片。”“会合任务比较困难，因为你必须放慢速度，与物体的速度相匹配，这样你才能和它呆一段时间。但是，你在星际物体周围停留的时间越长，你收集的数据就越多。好的科学是近在咫尺的。“。\n在这个项目中，利纳雷斯正在与麻省理工学院的教职员工保罗·洛扎诺(Paulo Lozano)、地球、大气和行星科学系行星科学教授本杰明·韦斯(Benjamin Weiss)以及美国国家航空航天局(NASA)喷气推进实验室的达蒙·兰道(Damon Landau)合作。在接下来的9个月里，利纳雷斯和他的研究伙伴将确定他们的想法的可行性，如何评估他们系统的性能，并为潜在的任务制定一个概念。\n“研究星际天体的特写镜头将彻底改变我们对行星形成和演化的理解，”韦斯说，“这将是我们第一次获得其他太阳系主体组成的灵敏测量结果。”我们还可以了解物体在太阳系之间过境的速度和频率，这将告诉我们星际转移生命的可行性。“\nNIAC计划下的第一阶段指定在为期九个月的可行性研究期间为开箱即用的想法建立了概念证明。研究人员随后可以申请NIAC计划下的第二阶段和第三阶段奖励，以在更长的时间内进一步发展他们的概念。\n麻省理工学院(MIT)航空航天和工程系统教授奥利维尔·德韦克(Olivier De Weck)表示：“赢得这样的NIAC奖非常有声望，但也非常困难，因为提名者必须在听起来几乎像科幻小说的创新想法之间走钢丝，同时又要立足于真实的物理。”“利纳雷斯教授和他的同事们在这方面做得非常完美，这个概念将使我们能够以前所未有的方式研究ISO，从本质上平衡我们从太阳获得的两个主要东西：重力和辐射。”", "note_en": "In 2017, a telescope in Hawaii detected our first celestial visitor from another solar system — a big deal, since we haven’t quite figured out how to visit them ourselves yet. ‘Oumuamua, the cigar-shaped interstellar object (ISO) whose name roughly translates to “first distant messenger” in Hawaiian, will certainly not be the last visitor to pass through. If the story of our universe is written in the stars, even a tiny fragment traveling a long way for a short visit provides a tremendous opportunity for scientific discovery. But in order to get close enough to read the next piece of the story that wanders onto our doorstep, we will have to catch it first.\n To closely observe an ISO hurtling through space, time is of the essence. Richard Linares, an assistant professor in the Department of Aeronautics and Astronautics (AeroAstro) at MIT, developed a concept for a “dynamic orbital slingshot for rendezvous with interstellar objects.” He outlined his idea in a research proposal that was recently selected as a Phase 1 study in the NASA Innovative Advanced Concepts (NIAC) Program, which “funds innovative aerospace concepts that could enable and transform future missions.”\n “There are a lot of fundamental challenges with observing ISOs from Earth — they are usually so small that light from the sun needs to illuminate it in a certain way for our telescopes to even detect it,” said Linares, who is the director of the Astrodynamics, Space Robotics, and Controls Laboratory, part of the Space Systems Laboratory in AeroAstro. “And they are traveling so fast that it’s hard to pull together and launch a mission from Earth in the small window of opportunity we have before it’s gone. We’d have to get there fast, and current propulsion technologies are a limiting factor.”\n To eliminate these barriers, Linares instead proposes using statites, or “static satellites” enabled by a solar sail constructed with just the right mass-to-area ratio. A thin enough sail with a large enough surface area will have a low enough mass to use solar radiation pressure to cancel out the sun’s gravitational force no matter how far away it is, creating a propulsive force that allows the statite to hover in place indefinitely. Linares envisions deploying a constellation of statites to act as interstellar watchdogs along the edges of our solar system, lying in wait until roused by an ISO crossing our threshold.\n Once detected, the solar sail then enables the statite to switch gears quickly and spring into action. Since the statite has a velocity of zero, it is already in position for efficient trajectory. Once released, the stored energy in the solar sail would leverage the gravitational pull of the sun to slingshot the statite in a freefall trajectory towards the ISO, allowing it to catch up. If the timing is right, the statite could tag the ISO with a CubeSat armed with onboard sensors to orbit the ISO over an extended period of time, gathering important scientific data.\n “Flyby missions tend to be easier because they don’t require you to slow down — you fly past the object and try to get as many pictures as you can in that window,” says Linares. “A rendezvous mission is harder because you have to slow down and match the speed of the object so you can stay with it for a while. But the longer you can stay around the interstellar object, the better pool of data you can collect. Good science happens up close.”\n For this project, Linares is working with fellow MIT faculty members Paulo Lozano, professor of aeronautics and astronautics and director of the Space Propulsion Laboratory; and Benjamin Weiss, professor of planetary sciences in the Department of Earth, Atmospheric and Planetary Sciences; as well as Damon Landau at NASA’s Jet Propulsion Laboratory. Over the next nine months, Linares and his fellow investigators will determine the feasibility of their idea, how to evaluate the performance of their system, and develop a concept for a potential mission.\n “Studying an interstellar body close-up would revolutionize our understanding of planet formation and evolution,” says Weiss.  “For the first time, we could obtain sensitive measurements of the bulk composition of other solar systems. We could also learn how quickly and how commonly objects transit between solar systems, which will tell us the feasibility of the interstellar transfer of life.”\n The Phase 1 designation under the NIAC program establishes a proof-of-concept for out-of-the-box ideas over a nine-month period of viability studies. Investigators can subsequently apply for Phase 2 and Phase 3 awards under the NIAC program to further develop their concepts over a longer period of time.\n “Winning a NIAC award such as this one is very prestigious, but also very difficult, because the proposer has to walk a fine line between an innovative idea that sounds almost like science fiction while being grounded in real physics,” says Olivier de Weck, a professor of aeronautics and astronautics and of engineering systems at MIT. “Professor Linares and his colleagues have done this perfectly, and this concept will enable the study of ISOs in an unprecedented way by essentially balancing out the two major things we get from our sun in new ways: gravity and radiation.”", "posttime": "2020-05-17 02:00:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "教授,interstellar,iso", "title": "麻省理工学院教授提出一支准备绕星际彗星轨道运行的预定位卫星舰队", "title_en": "MIT Professor Proposes Fleet of Pre-Positioned Satellites Ready To Orbit Interstellar Comets", "transed": 1, "url": "https://news.mit.edu/2020/catch-interstellar-visitor-use-solar-powered-space-statite-slingshot-0506", "via": "", "real_tags": ["教授", "iso"]}, {"category": "", "categoryclass": "", "imagename": "e9c3d824f2f73a8098142d8ceacebb3d.jpg", "infoid": 1002417, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "西雅图--由亿万富翁比尔·盖茨(Bill Gates)和当地公共卫生官员推动的西雅图地区的一个创新冠状病毒测试项目，被联邦政府下令停止工作，等待进一步的审查。该项目是对该病毒隐形传播进行更广泛监控的一种方式。\n该项目包括向健康人和病人送回家检测套件，希望进行广泛的监测，帮助社区安全地从封锁中重新开放。研究人员和公共卫生当局已经检测了数千个样本，发现了数十个以前没有发现的病例。\n但该项目是研究机构与西雅图和金县公共卫生部门的合作项目，一直在州政府的授权下运作。本周，该项目接到通知，现在需要直接获得联邦政府的批准。美国食品和药物管理局(Food And Drug Administration)的官员告诉该合作伙伴在该机构进一步批准之前停止测试和报告。\nFDA在一份备忘录中写道：“请停止患者测试，并将诊断结果返回给患者，直到获得适当的授权。”\n这一延迟是最新的证据，表明开发、分发和提高检测的国家努力四分五裂，让联邦监管机构难以跟上步伐。由于对越来越多的冠状病毒抗体检测的可靠性感到担忧，FDA上周做出回应，要求各公司提交数据，证明检测的准确性。冠状病毒抗体检测是用来检查某人以前是否感染过该病毒的。\n但西雅图的这个项目不进行抗体检测，而且得到了广泛的支持，包括公共卫生领导人、弗雷德·哈钦森癌症研究中心(Fred Hutchinson Cancer Research Center)和盖茨，他们的基金会一直深度参与抗击这种流行病。疾病控制和预防中心还为该项目提供了面对面的技术顾问。\n斯克里普斯研究翻译研究所(Scripps Research Translational Institute)所长埃里克·托波尔(Eric Topol)博士没有参与西雅图小组，他说，西雅图小组已经“成为整个冠状病毒危机的主要亮点”。他说，FDA会停止这样的项目，这是“奇怪的”。\n正在进行这项测试的西雅图合作伙伴西雅图冠状病毒评估网络(Seattle CoronaVirus Review Network)在一份声明中表示，它已经与食品和药物管理局(Food And Drug Administration)就其计划进行了大约10周的谈判，并在一个月前提交了数据。\n该项目源于西雅图流感研究，该研究在秋季和冬季从华盛顿州有疾病症状的人那里收集了数千份样本。正如之前“纽约时报”详细报道的那样，那里的研究人员一直在努力获得政府的批准，以便对这些旧样本进行冠状病毒测试并报告结果。\n到2月底，这些研究人员还是做了一些测试，发现了该地区第一例社区传播病例，并提供了关键证据，表明病毒很可能已经传播了几周。\n微软联合创始人盖茨将大部分财富投入到全球公共卫生问题上，他支持西雅图的这项研究。他在周二的一篇博客文章中说，该项目可以发现病例，并帮助指导公共卫生应对措施。\n盖茨写道，“这不仅有助于提高我们对西雅图疫情的了解，还将为世界各地的其他社区提供有关该病毒的有价值的信息。”\nFDA的一位发言人说，房屋收集套件引起了人们对安全性和准确性的额外担忧，需要该机构进行审查。西雅图病例的问题似乎是，研究人员不仅将检测结果用于监测社区中的病毒，而且还将结果返回给患者，以告知他们。\n这两种检测--监测和诊断--属于不同的FDA标准。在纯粹的监督研究中，研究人员可能只把结果留给自己。但冠状病毒检测在很大程度上是围绕着将结果返回给医生，医生可以与患者分享结果。\n这位发言人说：“我们之前了解到，扫描是作为一项监视研究进行的。”\n私人公司也争先恐后地推广家庭测试套件，FDA在4月份批准了第一个可供购买的测试套件。\n托波尔博士说，让人们擦拭鼻子，然后不给他们检测结果是没有意义的。\n家庭测试套件被誉为办公室或免下车测试的有价值的替代方案，因为它们不需要临床医生在擦拭患者鼻子时冒暴露的风险。它们也出现在公共卫生领导人正在寻找方法迅速扩大检测以寻找热点和趋势的时候。\n哈佛全球卫生研究所(Harvard Global Health Institute)上周的一份报告估计，美国每天至少需要进行90万次检查，但跟踪报告显示，美国正在进行大约三分之一的检查。\n托波尔博士说，这个国家可能需要加大力度，每天做数百万次检查。他说，大规模得来速测试所需的基础设施将很难实现，而且可能会错过那些不想离开家开车去现场的人。\n“家庭测试真的是我们在美国进行大规模测试的唯一途径，”他说。\n西雅图检测小组表示，自3月初以来，他们一直在与FDA进行谈判，并于3月23日启动了获得联邦批准的程序。这一过程包括提交4月13日到目前为止测试的数据。\n该组织说，FDA官员已经要求提供有关该项目鼻拭子使用情况的数据。他们说，研究人员提交了数据，验证了家庭收集中棉签的安全性和可靠性。他们提供的研究表明，任何冠状病毒样本在西雅图地区典型的温度范围内都能保持稳定一周以上。他们还提供了有关内部控制的信息，使组织能够确定是否收集了足够的样本以保证准确的测试结果。\n该检测组织表示，FDA还要求提供更多有关该项目对没有症状的人进行测试的信息。", "note_en": "SEATTLE — An innovative coronavirus testing program in the Seattle area — promoted by the billionaire Bill Gates and local public health officials as a way of conducting wider surveillance on the invisible spread of the virus — has been ordered by the federal government to stop its work pending additional reviews.\n The program involved sending home test kits to both healthy and sick people in the hope of conducting the kind of widespread monitoring that could help communities safely reopen from lockdowns. Researchers and public health authorities already had tested thousands of samples, finding dozens of previously undetected cases.\n  But the program, a partnership between research groups and the Seattle and King County public health department that had been operating under authorization from the state, was notified this week that it now needs approval directly from the federal government. Officials with the Food and Drug Administration told the partnership to cease its testing and reporting until the agency grants further approval.\n “Please discontinue patient testing and return of diagnostic results to patients until proper authorization is obtained,” the F.D.A. wrote in a memo.\n The delay is the latest evidence of how a splintered national effort to develop, distribute and ramp up testing has left federal regulators struggling to keep up. Amid concerns about the reliability of a burgeoning number of coronavirus antibody tests — which check whether someone may have previously had the virus — the F.D.A. responded last week by  ordering companies to submit data proving the tests’ accuracy.\n But the Seattle program does not test for antibodies and has wide backing, including from public health leaders, the Fred Hutchinson Cancer Research Center and Mr. Gates, whose foundation has been deeply involved in fighting the pandemic. The Centers for Disease Control and Prevention also provided an in-person technical adviser to the project.\n  Dr. Eric Topol, the director of the Scripps Research Translational Institute, who is not involved in the Seattle group, said it had “emerged as leading lights in this whole Covid-19 crisis.” He said it was “bizarre” that the F.D.A. would halt such a project.\n The Seattle partnership that is conducting the testing, the Seattle Coronavirus Assessment Network, said in a statement that it had been in conversation with the Food and Drug Administration about its program for about 10 weeks and submitted data a month ago.\n  The program has roots in the Seattle Flu Study, which over the fall and winter had collected thousands of samples from people in Washington State who had symptoms of illness. As  previously detailed in The New York Times, researchers there had struggled to get government approval to test those old samples for the coronavirus and report the results.\n By the end of February, those researchers ended up doing some testing anyway, discovered the first case of community transmission in the region and provided key evidence that the virus had most likely been circulating for weeks.\n  Mr. Gates, the Microsoft co-founder who has committed much of his wealth to global public health issues, has backed the Seattle study. He  said in a blog post Tuesday that the program could detect cases and help guide public health responses.\n  “Not only will it help improve our understanding of the outbreak in Seattle, it will also provide valuable information about the virus for other communities around the world,” Mr. Gates wrote.\n  An F.D.A. spokesperson said home collection kits raised additional concerns about safety and accuracy that required the agency’s review. The issue in the Seattle case appears to be that the test results are being used not only by researchers for surveillance of the virus in the community but that the results are also being returned to patients to inform them.\n The two kinds of testing — surveillance and diagnostic — fall under different F.D.A. standards. In a pure surveillance study, the researchers may keep the results just for themselves. But coronavirus testing has largely revolved around getting results returned to doctors who can share the results with patients.\n  “We had previously understood that SCAN was being conducted as a surveillance study,” the spokesperson said.\n Private companies have also rushed to promote at-home test kits, and the  F.D.A. approved the first one available for purchase in April.\n Dr. Topol said it would not make sense to have people swab their noses and then not give them their test results.\n At-home testing kits have been praised as a valuable alternative to in-office or drive-through testing because they do not require a clinician to risk exposure when swabbing a patient’s nose. They have also emerged at a time when public health leaders are looking for ways to rapidly expand testing to look for hot spots and trends.\n A Harvard Global Health Institute report last week estimated that the United States needed to be conducting  at least 900,000 tests daily, but  tracking reports indicate the country is doing about one-third that amount.\n Dr. Topol said the country probably needed to ramp up to do millions of tests daily. The infrastructure needed for expansive drive-through testing would be difficult to achieve, he said, and could miss people who do not want to leave their home to drive to a site.\n “Home testing is really the only way we can get massive testing in the United States,” he said.\n  The Seattle testing group said it had been in conversation with the F.D.A. since the beginning of March and initiated the process to obtain federal approval on March 23. That process included submitting data from testing so far on April 13.\n The group said F.D.A. officials had requested data regarding the program’s use of nasal swabs. Researchers submitted data validating both the safety and reliability of the swabs in home-based collection, they said. They provided studies demonstrating that any coronavirus samples would remain stable for more than a week at the full range of temperatures typical in the Seattle area. They also provided information about internal controls that allow the organization to determine whether a sufficient specimen was collected to guarantee accurate test results.\n The testing group said the F.D.A. had also asked for more information about the program’s effort to test people who did not have symptoms.", "posttime": "2020-05-17 01:59:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,冠状病毒,coronavirus,halts,检测", "title": "FDA暂停比尔·盖茨支持的冠状病毒检测计划", "title_en": "FDA Halts Coronavirus Testing Program Backed by Bill Gates", "transed": 1, "url": "https://www.nytimes.com/2020/05/15/us/coronavirus-testing-seattle-bill-gates.html", "via": "", "real_tags": ["病毒", "冠状病毒", "halts", "检测"]}, {"category": "", "categoryclass": "", "imagename": "5df34f1be66de6c034c6bdf021c2547f.jpg", "infoid": 1002416, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "桑纳蒂克作品的不同之处在于，它富有表现力，并以呼吸等现实元素为特色，因此听起来不像是机器人在说话。\nSontic以更低的价格提供了更快的迭代周期，因为它降低了物流成本，而且语音模型随时可以执行。\n找到你最合适的衣服。选择我们其中一位才华横溢的语音模型开始您的项目，只需点击几下即可随时更换。\n导入现有脚本或手动输入对话框，以开始渲染。每当灵感袭来时，添加新的场景或重写故事情节。\n重要的不是你说什么，而是你怎么说。基于最佳情感传递的雕塑场景-包括步调、投影和强调。\n合并其他资源轨迹并导出您的最终镜头。产品级音频文件，可无缝插入现有工作流。", "note_en": "&#34;What is different about Sonantic’s work is that it is expressive and features realistic elements such as breathing so it doesn’t sound like a robot is speaking.&#34;\n &#34;Sonantic offers faster iteration cycles at a cheaper price because it cuts down logistical costs and has voice models ready to perform.&#34;\n Find your perfect fit. Select one of our talented voice models to start your project and swap it out at any time with just a few clicks.\n Import existing scripts, or manually enter dialogue, to start rendering. Add new scenes or rework storylines whenever inspiration strikes.\n It&#39;s not what you say, it&#39;s how you say it. Sculpt scenes based on optimal emotional delivery – including pacing, projection and emphasis.\n Incorporate additional asset tracks and export your final takes. Production-quality audio files that slot seamlessly into existing workflows.", "posttime": "2020-05-17 01:59:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "情感,expressive,语音", "title": "富有情感表现力的文本到语音转换", "title_en": "Emotionally Expressive Text to Speech", "transed": 1, "url": "https://www.sonantic.io/", "via": "", "real_tags": ["情感", "语音"]}, {"category": "", "categoryclass": "", "imagename": "cee8be11ec30ffde8b9f6661e192ecb4.jpeg", "infoid": 1002415, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英特尔在1980年推出8087芯片，以提高8086和8088处理器上的浮点性能，它是在最初的IBM PC上使用的。由于早期的微处理器只对整数进行运算，浮点数的算术速度很慢，诸如反正切或对数的超越运算甚至更差。将8087协处理器芯片添加到系统中，使浮点运算的速度提高了100倍。\n我打开一块8087芯片，用显微镜拍照。下面的照片显示了芯片的微小硅芯。在芯片的边缘，细小的焊线将芯片与40个外部引脚相连。标签显示了基于我的逆向工程的主要功能模块。通过仔细检查芯片，可以从芯片的ROM中读出各种常量，比如芯片在计算时使用的圆周率(Pi)。\nIntel8087浮点单元芯片的裸片，标有主要功能块。常量ROM用绿色标出。单击查看大图。\n芯片的上半部分包含控制电路。执行浮点指令可能需要1000个步骤；8087使用微码指定这些步骤。上面的芯片照片显示了运行微码程序的引擎；它基本上是一个简单的CPU。它旁边是容纳微码的大型ROM。\n芯片的下半部分包含处理浮点数的电路。浮点数由分数(也称为有效数或尾数)、指数和符号位组成。(对于以10为基数的类比，在数字6.02×10 23中，6.02是分数，23是指数。)芯片有单独的电路来并行处理分数和指数。分数处理电路支持67位值，64位小数加上三个额外的位以保证精度。和寄存器堆栈。常量ROM(以绿色突出显示)是本帖子的主题。\n8087与8086处理器作为协处理器运行。当8086遇到特殊的浮点指令时，处理器会忽略它，让8087并行执行该指令。我不会详细解释8087的内部工作原理，但作为一个概述，浮点运算是使用整数加/减和移位来实现的。要加或减两个浮点数，8087会将数字移位，直到二进制点(即小数点，但是二进制)对齐，然后加或减小数。乘法、除法和平方根是通过重复移位和加减来执行的。超越运算(tan、arctan、log。\n这篇文章描述了保存常量的ROM(不要与更大的四级微码ROM混淆)。2)常量ROM保存8087计算所需的常量(如pi、ln(2)和sqrt(2))，下图显示常量ROM的一部分。为了显示下面的硅，去除了金属层。粉红色的区域是掺硅的，具有不同的性质，而红色和绿色的线条是多晶硅，这是一种特殊类型的硅布线，覆盖在顶部。请注意ROM的规则栅格结构。只读存储器由两列晶体管组成，用来存放比特。为了解释只读存储器是如何工作的，我将首先解释晶体管是如何工作的。\n固定ROM的一部分，去除了金属层。三列较大的晶体管用于G。\n20世纪70年代的高密度集成电路通常是由一种被称为NMOS的晶体管建造的。(现代计算机是由CMOS组成的，它由NMOS晶体管和相反极性的PMOS晶体管组成。)下图显示了NMOS晶体管的结构。集成电路是由硅衬底和晶体管构成的。硅的各个区域掺入杂质，形成具有所需电性能的扩散区域。晶体管可以看作一个开关，允许电流在称为源极和漏极的两个扩散区域之间流动。晶体管由栅极控制，栅极由一种称为多晶硅的特殊类型的硅制成。在栅极上施加电压，使电流在源极和漏极之间流动，否则就会被阻塞。8087的芯片相当复杂。8087的芯片相当复杂，它由一种特殊类型的硅制成，称为多晶硅。在栅极上施加电压，可以让电流在源极和漏极之间流动，否则就会被阻塞。8087的芯片相当复杂。3个。\n放大ROM显示单个晶体管。粉红色区域是掺杂的硅，形成晶体管的源极和漏极。垂直的多晶硅选择线形成晶体管的栅极。指示的硅区连接到地，将每个晶体管的一侧拉低。圆圈是硅和上面的金属线之间的连接，称为通孔。(金属线已被移除；橙色线显示了一条的位置。)。\n常量只读存储器的一部分。每条选择线选择一个特定的常数。晶体管用黄色符号表示。X表示缺少晶体管，对应于0位。橙色线条表示金属线的位置。(这张照片的金属层已经溶解。)。\nROM的重要特征是一些晶体管丢失，第一个在上行，两个在下行标有X。通过改变硅掺杂图案、创建晶体管或离开绝缘区，位被编程到ROM中。每个晶体管或丢失的晶体管代表一位。当一条选择线被激活时，该列中的所有晶体管都将接通，将相应的输出线拉低。但是，如果晶体管从选定的位置丢失，则相应的输出线将保持高电平。因此，当选择线被激活时，该列中的所有晶体管都将导通，从而将相应的输出线拉低。因此，如果晶体管从选定的位置丢失，则相应的输出线将保持高。因此，当选择线被激活时，该列中的所有晶体管都将导通，将相应的输出线拉低。\n常量ROM有134行21列。5在显微镜下，ROM的位图案是可见的，可以提取。4如何解释原始比特并不明显，第一个问题是晶体管(相对于间隙)是0还是1。(原来晶体管表示1位。)下一个问题是如何将134×21位网格映射为值。6个。\n芯片的数据路径由67个水平行组成，因此ROM中的134行似乎相当清楚地对应于两组67位的常量。我提取了一组奇数行的常量和一组偶数行的常量，但这些值没有任何意义。经过进一步考虑，我确定这两行不是交替的，而是以重复的模式排列的。7使用此模式产生了大量可识别的常量，包括pi和1。这些常量的位如下图所示。(在此照片中，1位显示为绿色条纹，而0位显示为红色条纹。)在二进制中，pi为11.001001.。这个值在上面标有标签的位中可见。最下面的值是常数1.8。\n常量ROM中标记的位值。最高的位是π的第一部分，而较低的位是常数1，与其他图相比，这个图已经旋转了90度。未标记的位形成其他常量。\n解释的下一个困难是这个ROM只保存数字的小数部分，而不是指数。(我还没有找到单独的指数ROM。)我尝试了各种指数，直到我得到了合理的数值。有些很简单：例如，使用指数2-2时，常量1.204120产生log10(2)。还有一些比较难，9，比如1.734723。最后，我算出了1.734723×259时是10 18.10\n完整的常量表在脚注中。11从物理上讲，常量分为三组。第一组是用户可以加载的值(1、π、log210、log2e、log102和ln2)12以及内部使用的值(1018、ln(2)/3、3*log2(E)、log2(E)和sqrt(2))。第二组是16个arctan常量，第三组是14个log2常量。最后两组常量用于使用CORDIC算法计算超越函数，下面我将讨论这一点。\nROM中的常量揭示了8087使用的算法的一些细节。ROM包含16个反正切值，即2-n的弧线。它还包含14个对数值，即以(1+2-n)为底的对数。这些看起来可能不寻常的值，但它们被用于1958年发明的一种名为CORDIC的高效算法中。\nCORDIC的基本思想是通过将一个角度分解成较小的角度，然后按这些角度旋转矢量来计算正切和反正切。诀窍在于，通过仔细选择较小的角度，可以用有效的移位和加法而不是三角函数来计算每次旋转。具体地说，假设我们想要求tan(Z)，我们可以将z分解成更小角度的和：Z≈{atan(2-1)or 0}+{atan(2-2)或0}+{atan(2-2。旋转一个向量，比方说atan(2-2)，可以通过乘以2-2和加法来完成，关键是乘以2-2只是一个快速的位移位，把所有这些放在一起，计算tan(Z)可以通过将z与atan常量进行比较，然后进行16个周期的加法和移位来完成，这在硬件上执行起来很快。13为了使算法工作，需要预先计算ATAN常量并将其存储在常量ROM中。14.。\n计算以2为底的对数和以2为底的指数也使用CORDIC算法，并带有相关的对数常数，关键是通过移位和加法可以快速地乘以(1+2-n)，通过将方程的一侧乘以值序列，并将相应的对数常数加到另一侧，就可以计算对数或指数。15个。\n8087对超越函数的支持比你想象的要有限得多。它只支持正切和反正切函数，而不支持正弦或余弦函数；用户必须应用三角恒等式来计算正弦或余弦。对数和指数只支持基数2；对于基数10或基数e，用户必须应用适当的刻度因数。当时，8087突破了芯片容量的极限，因此指令集仅限于基本指令集。\n8087是一个复杂的芯片，乍看起来就像是一个毫无希望的电路迷宫。但仔细研究一下就能理解它的大部分内容。它包含42个常量，这些常量的值可以在显微镜下提取。有些常量(如pi)是预期的，而另一些(如log2(3))则更令人费解。许多常量被用来计算正切、反正切、正切、对数和幂函数，使用快速余弦法计算正切、反正切、对数和幂函数。8087是一个复杂的芯片，起初它看起来像一个无望的电路迷宫。但只要仔细研究，就能理解它的大部分内容。它包含42个常数，这些常数的值可以在显微镜下提取。\n去除金属层的8087模具照片。单击查看大图。\n尽管英特尔的8087浮点单元芯片是在40年前推出的，但它在今天仍然具有很大的影响力。它催生了用于大多数现代浮点算术的IEEE754浮点标准，8087指令仍然是大多数计算机中使用的x86处理器的一部分。\n有关8087的更多信息，请参阅我的其他文章：每晶体管2位ROM和衬底偏压发生器。我在Twitter上发布了我最新的博客文章，请关注me@kensheriff以获得未来的文章。我还有一个RSS订阅源。\n8086处理器和8087浮点单元之间的交互有点棘手；我将讨论一些亮点。简单的观点是，8087监视8086的指令流，并执行任何属于8087指令的指令。复杂的是，8086有指令预取缓冲器，所以正在获取的指令不是正在执行的指令。因此，8087复制了8086的预取缓冲器(或8088。较小的预取缓冲区)，因此它知道8086正在执行此操作。(一个Twitter线程详细讨论了这一点。)另一个复杂的问题是8086使用复杂的寻址模式，它使用8086内部的寄存器。8087不能执行这些寻址模式，因为它不能访问8086寄存器。取而代之的是，当8086看到8087指令时，它会从寻址的位置进行内存提取，并忽略结果。同时，8087从TheBus上获取地址，以便在需要时可以使用该地址。如果没有8087，您可能会认为会出现陷阱，但实际情况并非如此。相反，对于没有8087的系统，链接器会重写8087指令，用对仿真库的子例程调用替换它们。↩。\n8087的微码只读存储器是用一种不同寻常的技术构建的，每个晶体管存储两个比特。通过在每个位置使用三个不同大小的晶体管或不使用晶体管来实现这一点。每个位置的四种可能性代表两个比特。为了将大容量只读存储器安装到8087芯片上，这种复杂的技术是必要的。我写了一篇博客文章，详细介绍了这一点。相比之下，常量只读存储器是使用标准技术构建的。-↩。\n数据来源为8087中的晶体管数量提供了不一致的值：英特尔声称有40,000个晶体管，而维基百科声称有45,000个。这种差异可能是由于计算晶体管的方法不同。尤其是，因为ROM、PLA或类似结构中的晶体管数量取决于存储在其中的数据，所以数据来源通常计算潜在晶体管的数量，而不是物理晶体管的数量。其他差异可能是由于是否计算上拉晶体管以及是否计算大电流驱动器造成的。\n我没有手动复制ROM中的位，而是编写了一个简单的JavaScript程序来帮助我读取ROM。我点击只读存储器图像来指示每个晶体管，程序产生了相应的0和1的图案。↩。\nROM有134行21位，除了左上角缺少6×6块外，所以物理大小是恒定的ROM为2946位。\n由于只读存储器的布局，这一缺失的部分意味着前12个常量是64位长，而不是67位。这些是非CORDIC常量，显然不需要额外的位来保证精度。-↩。\n有两种方法可以确定比特的编码。第一种是找出从只读存储器中读取数据的电路，并检查数据是如何使用的。第二种是在原始数据中寻找模式，并确定什么对编码有意义。由于8087非常复杂，我想避免完全的反向工程来理解常量，所以我使用了第二种方法。-↩\n行的组织遵循ABBAABBAABBA.模式，其中行保存一组常量的位，行保存第二组常量的位。这种布局可能用来代替交替的行(#34；ABAB)，因为一个连接可以驱动两个相邻的选择晶体管。也就是说，可以用一根焊线选择每个&#34；aa&34；或&#34；bb&34；组。“↩。\n我确定了三个关键因素。首先，位从ROM的底部开始向上。第二，晶体管指示1，而不是0。第三，常量的开头没有隐含的1位。(换句话说，常量格式与8087使用的外部数据格式不匹配。)-↩。\n一些指数很难确定。我对他们中的一些人使用了暴力，看是否有指数能给出某个数字的对数或幂。最难计算的数字之一是ln(2)/3；我不确定为什么这个值很重要。“↩。\n为什么8087包含常量10 18？可能是因为8087支持可容纳18位的压缩bcd数据类型，因此最多可容纳10 18。/↩。\n下表总结了常量ROM的内容。&lt;#34；&gt;一栏的意思是&lt;#34；&gt;一栏是我对这个数字的解释。\n从CORDIC常量可以清楚地看出，只读存储器中的值没有按物理顺序存储，即连续的行没有按顺序寻址。我不确定为什么10 18出现两次；可能一个指数是不同的。二进制指数不在我检查的只读存储器中，所以我不得不估计它们。-↩。\n↩提供了7条直接加载常量的指令。指令FDLZ、FLD1、FLDPI、FLD2T、FLD2E、FLDLG2和FLDLN2分别将常量0、1、p1、log210、log2e、log102和ln2加载到堆栈上。除了0之外，这些常量还可以在ROM中找到。\n8087年的CORDIC算法在数值处理器的超越函数的实现中有描述，我在这里写了基于该描述的正切代码示例。在8087s的完整的TRAN算法中还有几个乘法和除法。它对剩余的角度使用了一个简单的有理正切近似，使其比直接的CORDIC更精确。-↩\n计算角度的反正切差所使用的算法与切线算法类似，但与之相反：在执行旋转时，会将角度(从常量ROM中)相加，以得出最终的角度。-↩。\n我找不到关于8087的对数和指数算法的文档。我认为这些算法与本页上的算法非常相似，只是8087使用的是基数2而不是基数E。我有点不明白为什么8087不需要该算法使用的常量log2(1+2-1)。-↩", "note_en": "Intel introduced the 8087 chip in 1980 to improve floating-point performance on the 8086 and 8088 processors, and it was used with the original IBM PC.Since early microprocessors operated only on integers, arithmetic with floating-point numbers was slow and transcendental operations such as arctangent or logarithmswere even worse.Adding the 8087 co-processor chip to a system made floating-point operations up to 100 times faster.\n I opened up an 8087 chip and took photos with a  microscope.The photo below shows the chip&#39;s tiny silicon die.Around the edges of the chip, tiny bond wires connect the chip to the 40 external pins.The labels show the main functional blocks, based on my reverse engineering.By examining the chip closely, various constants can be read out of the chip&#39;s ROM, numbers such as pi that the chip uses in its calculations.\n Die of the Intel 8087 floating point unit chip, with main functional blocks labeled. The constant ROM is outlined in green. Click for a larger image.\n The top half of the chip contains the control circuitry.Performing a floating-point instruction might require 1000 steps;the 8087 used microcode to specify these steps.The die photo above shows the &#34;engine&#34; that ran the microcode program; it is basically a simple CPU.Next to it is the large ROM that holds the microcode.\n The bottom half of the die holds the circuitry that processes floating-point numbers.A floating-point number consists of a fraction(also called significand or mantissa), an exponent, and a sign bit.(For a base-10 analogy, in the number 6.02×10 23, 6.02 is the fraction and 23 is the exponent.)The chip has separate circuitry to process the fraction and the exponent in parallel.The fraction processing circuitry supports 67-bit values, a 64-bit fraction with three extra bits for accuracy.From left to right, the fraction circuitry consists of a constant ROM, a shifter, adder/subtracters, and the register stack.The constant ROM (highlighted in green) is the subject of this post.\n The 8087 operated as a co-processor with the 8086 processor. When the 8086 encountered a special floating-point instruction, the processor ignored it and let the 8087execute the instruction in parallel.  1I won&#39;t explain in detail how the 8087 works internally, but as an overview,floating-point operations are implementedusing integer adds/subtracts and shifts.To add or subtract two floating-point numbers, the 8087 shifts the numbers until the binary points (i.e. the decimal points but in binary) line up, and then adds or subtracts the fraction.Multiplication, division, and square root are performed through repeated shifts and adds or subtracts.Transcendental operations (tan, arctan, log, power) use  CORDIC algorithms,which use shifts and adds of special constants for efficient computation.\n  This post describes the ROM that holds constants (not to be confused with the larger, four-level  microcode ROM.  2)The constant ROM holds the constants (such as pi, ln(2), and sqrt(2)) that the 8087 needs for its computations.The photo below shows part of the constant ROM. The metal layer has been removed to show the silicon underneath.The pinkish regions are silicon doped to have different properties, while the reddish and greenish lines are polysilicon, a special type of siliconwiring layered on top.Note the regular grid structure of the ROM. The ROM consists of two columns of transistors, holding the bits.To explain how the ROM works, I&#39;ll start by explaining how a transistor works.\n Part of the constant ROM, with the metal layer removed. The three columns of larger transistors are used to G.\n High-density integrated circuits in the 1970s were usually built from a type of transistor known as NMOS.(Modern computers are built from CMOS, which consists of NMOS transistors along with opposite-polarity PMOS transistors.)The diagram below shows the structure of an NMOS transistor. An integrated circuit is constructed from a silicon substrate, with transistors built on it.Regions of the silicon are doped with impurities to create &#34;diffusion&#34; regions with desired electrical properties.The transistor can be viewed as a switch, allowing current to flow between two diffusion regions called the source and drain.The transistor is controlled by the gate, made of a special type of silicon called polysilicon.Applying voltage to the gate lets current flow between the source and drain, which is otherwise blocked.The die of the 8087 is fairly complex, with about 40,000 of these transistors.  3\n  Zooming in on the ROM shows the individual transistors.The pinkish regions are the doped silicon, forming transistor sources and drains.The vertical polysilicon select lines form the gates of the transistors.The indicated silicon regions are connected to ground, pulling one side of each transistor low.The circles are connections called vias between the silicon and the metal lines above.(The metal lines have been removed; the orange line shows the position of one.)\n A portion of the constant ROM. Each select line selects a particular constant. Transistors are indicated by the yellow symbols. An X indicates a missing transistor, corresponding to a 0 bit. The orange line indicates the position of a metal wire. (The metal layer was dissolved for this picture.)\n The important feature of the ROM is that some of the transistors are missing, the first one in the upper row, and two marked with X in the lower row.Bits are programmed into the ROM by changing the silicon doping pattern, creating transistors or leaving insulating regions.Each transistor or missing transistor represents one bit.When a select line is activated, all the transistors in that column will turn on, pulling the corresponding output lines low.But if the transistor is missing from a selected position, the corresponding output line will remain high.Thus, a value is read from the ROM by activating a select line, reading that ROM value onto the output lines.\n  The constant ROM has 134 rows of 21 columns.  5Under a microscope, the bit pattern of the ROM is visible and can be extracted.  4How to interpret the raw bits is not obvious, though.The first question is if a transistor (versus a gap) indicates a 0 or a 1. (It turns out that a transistor indicates a 1 bit.)The next issue is how to map the 134×21 grid of bits into values.  6\n The chip&#39;s data path consists of 67 horizontal rows, so it seemed pretty clear that the 134 rows in the ROM corresponded to two sets of 67-bit constants.I extracted one set of constants for the odd rows and one for the even rows, but the values didn&#39;t make any sense.After more thought, I determined that the rows do not alternate but are arranged in a repeating &#34;ABBA&#34; pattern.  7Using this pattern yielded abunch of recognizable constants, including pi and 1.Bits from those constants are shown in the diagram below.(In this photo, a 1 bit appears as a green stripe, while a 0 bit appears asa red stripe.)In binary, pi is 11.001001... and this value is visible in the upper labeled bits.The bottom value is the constant 1.  8\n Bit values labeled in the constant ROM. The top bits are the first part of pi, while the lower bits are the constant 1, This diagram has been rotated 90 degrees compared to the other diagrams. The unlabeled bits form other constants.\n The next difficulty in interpretation is thatthis ROM holds just the fractional parts of the numbers, not the exponents. (I haven&#39;t found the separate exponent ROM yet.)I experimented with various exponents until I got values that were sensible numbers.Some were straightforward: for instance, the constant 1.204120 yielded log 10(2) when the exponent 2 -2 was used.Others were harder,  9 such as 1.734723.Eventually, I figured out that 1.734723×2 59 is 10 18.  10\n The complete table of constants is in the footnotes.  11Physically, the constants are arranged in three groups. The first group is values that the user can load(1, pi, log 210, log 2e, log 102, and ln 2)  12along with values used internally (10 18, ln(2)/3, 3*log 2(e), log 2(e), and sqrt(2)).The second group is sixteen arctan constants, and the third is fourteen log 2 constants.The last two groups of constants are used to compute transcendental functions using the CORDIC algorithm, which I will discuss next.\n  The constants in the ROM reveal some details about the algorithms used by the 8087.The ROM contains 16 arctangent values, the arctans of 2 -n.It also contains 14 log values, the base-2 logs of (1+2 -n).These may seem like unusual values, but they are used in an efficient algorithm called  CORDIC, which was invented in1958.\n The basic idea of CORDIC is to compute tangent and arctangent by breaking down an angle into smaller angles, and rotating a vectorby these angles.The trick is that by carefully choosing the smaller angles, each rotation can be computed with efficient shifts and adds instead of trig functions.Specifically, suppose we want to find tan(z).We can break z into a sum of smaller angles: z ≈ {atan(2 -1) or 0} + {atan(2 -2) or 0} + {atan(2 -3) or 0} + ... +{atan(2 -16 or 0}.Now, rotating a vector by, say atan(2 -2), can be done by multiplying by 2 -2 and adding.The key thing is that multiplying by 2 -2 is just a fast bit shift.Putting this all together, computing tan(z) can be done by comparing z with the atan constants, and then doing 16 cycles of additions and shifts,which are fast to perform in hardware.  13To make the algorithm work, the atan constants are precomputed and stored in the constant ROM.  14\n Computing the base-2 log and base-2 exponential also use CORDIC algorithms, with the associated logarithmic constants.The key observation is that multiplying by (1 + 2 -n) can be done quickly with a shift and addition.By multiplying one side of the equation by the sequence of values, and adding the corresponding log constants to the other side, the log or exponential can be computed.  15\n The 8087&#39;s support for transcendental functions is more limited than you might expect.It only supports tangent and arctangent, not sine or cosine; the user must apply trig identities to compute sine or cosine.Logs and exponentials only support base 2; for base 10 or base  e, the user must apply the appropriate scale factor.At the time, the 8087 pushed the limits of what could fit on a chip, so the instruction set was limited to the essentials.\n  The 8087 is a complex chip and at first it looks like a hopeless maze of circuitry.But much of it can be understood with careful study.It contains 42 constants in a ROM, and the values of these constants can be extracted under a microscope.Some of the constants (such as pi) are expected, while others (such as log 2(3)) are more puzzling.Many of the constants are used for computing the tangent, arctangent, log, and power functions, using fast CORDIC algorithms.\n Die photo of the 8087 with the metal layer removed. Click for a larger image.\n Even though Intel&#39;s 8087 floating point unit chip was introduced 40 years ago, it still has a large influence today. It spawned the IEEE 754 floating-point standard used for most modern floating-point arithmetic, and the 8087&#39;s instructions remain a part of the x86 processors used in most computers.\n For more information on the 8087, see my other articles:  the two-bit-per-transistor ROM and  the substrate bias generator.I announce my latest blog posts on Twitter, so follow me  @kenshirriff for future articles. I also have an  RSS feed.\n  The interaction between the 8086 processor and the 8087 floating point unit is somewhat tricky; I&#39;ll discuss some highlights.The simplified view is that the 8087 watches the 8086&#39;s instruction stream, and executes any instructions that are 8087 instructions.The complication is that the 8086 has an instruction prefetch buffer, so the instruction being fetched isn&#39;t the one being executed.Thus, the 8087 duplicates the 8086&#39;s prefetch buffer (or the 8088&#39;s smaller prefetch buffer), so it knows that the 8086 is doing.(A  Twitter thread discusses this in detail.)Another complication is the complex addressing modes used by the 8086, which use registers inside the 8086.The 8087 can&#39;t perform these addressing modes since it doesn&#39;t have access to the 8086 registers. Instead, when the 8086 sees an 8087instruction, it does a memory fetch from the addressed location and ignores the result. Meanwhile, the 8087 grabs the address off thebus so it can use the address if it needs it.If there is no 8087 present, you might expect a trap, but that&#39;s not what happens. Instead, for a system without an 8087, the linker rewrites the 8087 instructions, replacing them with subroutine calls to the emulation library.  ↩\n The 8087&#39;s microcode ROM is built with an unusual technique that stores two bits per transistor.It does this by using three different transistor sizes or no transistor in each position.The four possibilities at each position represent two bits.This complex technique was necessary in order to fit the large ROM onto the 8087 die.I wrote a  blog post with more details.The constant ROM, in comparison, is built using standard techniques.  ↩\n Sources provide inconsistent values for the number of transistors in the 8087:Intel claims  40,000 transistors while Wikipedia claims  45,000.The discrepancy could be due to different ways of counting transistors.In particular, since the number of transistors in a ROM, PLA or similar structure depends on the data stored in it, sources often count&#34;potential&#34; transistors rather than the number of physical transistors.Other discrepancies can be due to whether or not pull-up transistors are counted and if high-current drivers are countedas multiple transistors in parallel or one large transistor.  ↩\n Instead of copying bits from the ROM by hand, I made a simple JavaScript program to help me read out the ROM. I clicked on the ROM image to indicate each transistor, and the programproduced the corresponding pattern of 0&#39;s and 1&#39;s.  ↩\n The ROM has 134 rows of 21 bits, except there is a 6×6 chunk missing from the upper left.Thus, the physical size is of the constant ROM is 2946 bits.\n  Because of the ROM layout, this missing section means that the first 12 constants are 64 bits long, rather than 67 bits.These are the non-CORDIC constants, which apparently don&#39;t require the extra bits for accuracy.  ↩\n There are two ways to determine the encoding of the bits. The first is to trace out the circuitry that reads from the ROM and examine how the data is used.The second is to look for patterns in the raw data, and determine what makes sense for an encoding.Since the 8087 is very complex, I wanted to avoid a full reverse-engineering to understand the constants and I used the second approach.  ↩\n The organization of the rows follows the pattern ABBAABBAABBA..., where &#34;A&#34; rows hold bits for one set of constants and &#34;B&#34; rows hold bitsfor the second set of constants.This layout was probably used instead of alternating rows (&#34;ABAB&#34;) because one connectioncan drive two neighboring selection transistors. That is, each &#34;AA&#34; or &#34;BB&#34; group can be selected with one wire.  ↩\n A bit more trial-and-error was necessary to pull the values out of the ROM.I determined three key factors.First, the bits started at the bottom of the ROM, going up.Second, a transistor indicated a 1, rather than a 0.Third, the constants did not have an implicit 1 bit at the beginning.(In other words, the constant format does not match the external data format used by the 8087.)  ↩\n Some of the exponents were tricky to determine. I used brute force for some of them, seeing if any exponent would yield the log or power ofsome number. One of the hardest numbers to figure out was ln(2)/3; I&#39;m not sure why this value is important.  ↩\n Why does the 8087 contain the constant 10 18?Probably because the 8087 supports a packed BCD datatype holding 18 digits, so it can hold up to 10 18.  ↩\n The following table summarizes the contents of the constant ROM. The &#34;meaning&#34; column is my interpretation of the number.\n  It&#39;s clear from the CORDIC constants that the values in the ROM are not physically stored in order, i.e. sequential rows are not addressed in order.I&#39;m not sure why 10 18 appears twice; probably one exponent is different.The binary exponents are not in the ROM that I examined, so I had to estimate them.  ↩\n The 8087 provides seven  instructions to load constants directly.The instructions  FDLZ,  FLD1,  FLDPI,  FLD2T,  FLD2E,  FLDLG2, and  FLDLN2load onto the stack the constants 0, 1, pi, log 210, log 2e, log 102, and ln 2, respectively.Apart from 0, these constants can be found in the ROM.  ↩\n The 8087&#39;s CORDIC algorithm is described in  Implementation of transcendental functions on a numerics processor.I wrote sample tangent code based on that description  here.There are also a couple of multiplications and divisions in the 8087&#39;s full tan algorithm.It uses a simple rational approximation of tangent on the &#34;leftover&#34; angle, giving it a bit more accuracythan straight CORDIC.  ↩\n Computing the arctangent of an angle uses an algorithm that is similar to the tangent algorithm, but in reverse: as rotations are performed,the angles (from the constant ROM) are summed up to yield the resulting angle.  ↩\n I couldn&#39;t find documentation on the 8087&#39;s log and exponent algorithms. I think the algorithms are very similar to the oneson  this page, except the 8087 uses base 2 instead of base e.I&#39;m a bit puzzled why the 8087 doesn&#39;t need the constant log 2(1 + 2 -1), which is used by that algorithm.  ↩", "posttime": "2020-05-17 01:58:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "芯片,协处理器,rom,晶体管", "title": "从8087数学协处理器芯片中提取ROM常量", "title_en": "Extracting ROM constants from the 8087 math coprocessor's die", "transed": 1, "url": "http://www.righto.com/2020/05/extracting-rom-constants-from-8087-math.html", "via": "", "real_tags": ["芯片", "协处理器", "rom", "晶体管"]}, {"category": "", "categoryclass": "", "imagename": "e7a1d5fbfaee027c2c5952bf9733e67c.png", "infoid": 1002414, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从Firefox 77开始，&lt；input&gt；和&lt；textarea&gt；HTML元素将不再自动截断粘贴或删除的用户文本，即使内容比maxlength属性指定的字符数长。此更改主要是为了防止意外截断的密码被保存。\n如果文本长度超过最大长度，表单控件将被标记为无效。元素的有效性DOM对象将相应更新，其中Valid属性将为false，Toolong属性将为true。\n用户通常会看到文本字段周围有一个红色边框，以及一条验证消息，如“请将此文本缩短到20个字符或更少(您当前使用的是30个字符)”，如果需要，可以使用setCustomValidity方法对其进行自定义。\n在用户修复错误之前，无法提交表单，因此服务器不应该收到过长的文本或密码(无论如何都必须进行服务器端验证)。但是，如果前端实现希望输入的文本永远不会超过最大长度，则这可能会影响前端实现。", "note_en": "Starting with Firefox 77,  &lt;input&gt; and  &lt;textarea&gt; HTML elements will no longer automatically truncate pasted or dropped user text, even if the content is longer than the number of characters specified with the   maxlength attribute. This change mainly aims at preventing an unexpectedly truncated password from being saved.\n The form control will be marked as invalid if the text is longer than  maxlength. The element’s   validity DOM object will be updated accordingly, where the  valid property will be  false, and the  tooLong property will be  true.\n The user will typically see a red border around the text field along with a validation message like “Please shorten this text to 20 characters or less (you are currently using 30 characters),” that can be customized with the   setCustomValidity method if needed.\n The form cannot be submitted until the user fixes the error, so the server shouldn’t receive an excessively long text or password (a server-side validation has to be put in place anyway.) However, this could potentially affect a front-end implementation if it expects the entered text never to exceed  maxlength.", "posttime": "2020-05-17 01:57:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "firefox,超过,exceeding,文本", "title": "在Firefox 77中，超过最大长度的文本将不再被截断", "title_en": "Text exceeding maxlength will no longer be truncated in Firefox 77", "transed": 1, "url": "https://www.fxsitecompat.dev/en-CA/docs/2020/text-exceeding-maxlength-will-no-longer-be-truncated-when-pasted-into-input-or-textarea/", "via": "", "real_tags": ["firefox", "超过", "exceeding", "文本"]}, {"category": "", "categoryclass": "", "imagename": "86acc6a0405fc8baa1b857cb72696f76.jpg", "infoid": 1002413, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天早上，几名流行的电子邮件应用爱迪生邮件的用户报告说，他们可以在iOS应用程序中看到其他用户的电子邮件账户。这似乎是一次重大的隐私泄露，用户报告说，在启用了新的同步功能后，他们可以完全访问这些其他电子邮件账户。\n爱迪生最近推出了新的同步功能，允许连接的电子邮件账户出现在你所有的设备上，但很明显，这一功能出现了严重的问题。\n我刚刚更新了@EDISON_APPS邮件和应用程序，在启用了新的同步功能后，应用程序中出现了一个不是我的电子邮件帐户，我似乎可以完全AXCESS。这是一个重大的安全问题。在没有凭据的情况下访问另一个人的电子邮件！再也不相信这个应用了。", "note_en": "Several users of popular email app  Edison Mail this morning are reporting that they are able to see email accounts of other users within the iOS app. In what appears to be a major privacy breach, users report that after enabling a new sync feature, they have full access to these other email accounts.\n The new sync feature was recently rolled out by Edison to allow connected email accounts to show up across all of your devices, but clearly something has gone significantly wrong with the feature.\n  I just updated  @Edison_apps Mail &amp;, after enabling a new sync feature, an email account THAT IS NOT MINE showed up in the app, that I could seemingly axcess completely. This is a SIGNIFICANT security issue. Accessing another&#39;s email w/o credentials! Never trusting this app again.", "posttime": "2020-05-17 01:56:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "edison,mail,电子邮件", "title": "允许访问其他用户的电子邮件帐户的Edison邮件同步错误", "title_en": "Edison Mail Sync Bug Allowing Access to Other Users' Email Accounts", "transed": 1, "url": "https://www.macrumors.com/2020/05/16/edison-mail-sync-bug/", "via": "", "real_tags": ["edison", "mail", "电子邮件"]}, {"category": "", "categoryclass": "", "imagename": "092bfb11d798a7fff425d81f13415ea0.jpg", "infoid": 1002412, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "首先，一群不会飞的鸟最近被允许在芝加哥谢德水族馆的大厅里漫步--如果有的话，这是一个透过镜子的时刻。\n这次郊游是由密苏里州堪萨斯城的纳尔逊-阿特金斯艺术博物馆(Nelson-Atkins Museum of Art)和堪萨斯城动物园(Kansas City Zoo)安排的。由于大流行，这两家机构都对公众关闭。\n隔离令每个人都有点疯狂，甚至堪萨斯城动物园的居民也是如此。因此，几只企鹅决定去纳尔逊-阿特金斯(Nelson-Atkins)进行一次实地考察，那里仍然关闭，以了解一点文化，视频附带的说明说。\n动物园执行董事兰迪·威斯托夫在视频中说，他们的洪堡企鹅错过了与动物园游客的定期互动。\n威斯托夫说：“我们一直在想方设法丰富它们的生活，刺激它们的生活。在这段关门期间，我们的动物真的很怀念前来看它们的游客。”\n动物园还有一个摄像头，可以在家里观看企鹅，而不是文化鉴赏家。\n这种企鹅原产于秘鲁和智利，博物馆馆长朱利安·祖加戈蒂亚若有所思地说，当他说西班牙语时，企鹅们似乎真的很欣赏他。\n如果你想知道企鹅可能会喜欢什么样的艺术，这次出游提供了一些(非常)不起眼的轶事证据，表明它们可能会被意大利巴洛克风格的技巧所吸引。祖加戈蒂亚打趣地说，他们似乎对卡拉瓦乔的反应肯定比对莫奈好得多。", "note_en": "First, a group of the flightless birds were recently allowed to roam the halls of Chicago&#39;s  Shedd Aquarium — a through-the-looking-glass moment if there ever was one.\n    The outing was arranged by The Nelson-Atkins Museum of Art in Kansas City, Mo., and the Kansas City Zoo. Both institutions are closed to the public because the pandemic.\n  &#34;Quarantine has caused everyone to go a little stir-crazy, even the residents of the Kansas City Zoo. So several of the penguins decided to go on a field trip to the Nelson-Atkins, which is still closed, to get a little culture,&#34; said a caption accompanying the video.\n    The zoo&#39;s executive director, Randy Wisthoff, said in the video that their Humboldt penguins have missed their regular interactions with zoo visitors.\n  &#34;We&#39;re always looking for ways to enrich their lives and stimulate their days and during this shutdown period, our animals really miss visitors coming up to see them,&#34; Wisthoff said.\n      The zoo also  has a camera to watch the penguins when at home and not being cultural connoisseurs.\n  This type of penguin is native to Peru and Chile, and the museum&#39;s director, Julián Zugazagoitia, mused that the penguins seemed to &#34;really appreciate&#34; when he spoke Spanish.\n  And if you&#39;re wondering what sort of art penguins might like, this outing provides some (very) modest anecdotal evidence that they may be drawn to Italian Baroque techniques. &#34;They seemed, definitely, to react  much better to Caravaggio than to Monet,&#34; Zugazagoitia quipped.", "posttime": "2020-05-17 01:18:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "享受,penguins,企鹅", "title": "密苏里州企鹅在当地博物馆享受“美术之晨”", "title_en": "Missouri penguins enjoy ‘morning of fine art’ at local museum", "transed": 1, "url": "https://www.npr.org/sections/coronavirus-live-updates/2020/05/15/856767958/watch-missouri-penguins-enjoy-morning-of-fine-art-at-local-museum", "via": "", "real_tags": ["享受", "penguins", "企鹅"]}, {"category": "", "categoryclass": "", "imagename": "a1874e07e2354fbd999dfbf16fbacbb9.jpg", "infoid": 1002411, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一名申请阿肯色州大流行失业援助计划失业的计算机程序员在系统中发现了一个漏洞，暴露了大约3万名申请者的社保号码、银行账户和路由号码以及其他敏感信息。任何具有基本计算机知识的人都可能出于恶意目的访问个人信息。\n周五早上，这位计算机程序员惊慌失措地打电话给阿肯色州劳动力服务部，接线员告诉他，没有人可以和他说话。然后，他尝试了阿肯色州警察刑事调查局的人，后者告诉程序员，他会找到需要交谈的人来解决问题。这位程序员后来打电话给“阿肯色州时报”(Arkansas Times)，征求关于打电话给谁的建议。泰晤士报于下午4：30向劳动力服务部通报了这个问题。不久之后，网站上出现了一条消息，上面写着：“该网站目前正在维护中。”\n“我们非常重视申请者数据的安全和隐私，”劳动力服务部公关总监佐埃·卡尔金斯(ZoëCalkins)在一封电子邮件中说。“当我们得知这一事件后，我们立即让我们的系统离线，拒绝外界进入网络。我们已经聘请了独立的计算机取证专家进行调查，并确定这是如何发生的，以及哪些数据(如果有的话)处于危险之中。我们致力于完成全面的法医审查，并将对我们的调查结果采取一切适当的行动。“。\n该州推出了大流行失业援助，这是一项新的联邦援助计划，针对收入受到冠状病毒影响的个体户或合同工，一直存在失误和拖延。该州于4月16日推出了PUA应用门户网站，比其他许多州晚了几周。该州现在是仅有的13个尚未向申请者发放福利的州之一。在一个系统错误导致他们的证明文件被删除后，大约5700名在该州所谓的“测试期”内报名的申请者被迫重新提交信息。\n在浏览网站时，计算机程序员确定，只需删除网站的部分URL，他就可以进入网站的管理门户，在那里他可以选择编辑申请者的个人信息，包括银行账号。在管理门户上，他查看了页面的源代码，并看到该站点正在使用API(应用程序编程接口)与数据库连接。该API也没有加密，他可以访问所有申请者的原始数据，包括社会保险号和银行信息。在大约两分钟内，这名计算机程序员向“阿肯色时报”聘请的另一名程序员描述了这个漏洞，后者随后利用这些信息轻松进入了系统。要访问敏感信息，第二个程序员只需要创建一个帐户，而不是实际申请帮助。\n另一名申请大流行失业援助的人士周五告诉泰晤士报，当他申请援助、提交文件并到达“审查”页面时，他看到了另一名申请者的文件。他说，州政府花了三天时间才删除了另一名申请者的信息。然后他说，又出现了另一名申请者的文件。“花了两天时间和反复的电话才把第二个名字去掉，”他说。“然后第二天，他们就把它全部删除了，并告诉我们必须重新申请。”\n申请人要求匿名，因为担心他的申请不会获得批准。\n这位计算机程序员说，他认为他可以编写一个脚本，在不到一个小时的时间内从API收集所有信息。他没有。\n“这真的是个大问题，我的社保号码在里面，”他说。“这是不幸的。我正在努力寻求帮助，可能会遭到黑客攻击。“。\n劳动力服务部的一名官员今天在一个立法委员会上表示，该州将于下周开始向PUA计划的成功申请者发放支票。", "note_en": "A computer programmer applying for unemployment on Arkansas’s  Pandemic Unemployment Assistance program discovered a vulnerability in the system that exposed the Social Security numbers, bank account and routing numbers and other sensitive information of some 30,000 applicants. Anyone with basic computer knowledge could have accessed personal information for malicious purposes.\n Alarmed, the computer programmer called the Arkansas Division of Workforce Services Friday morning and was told by an operator that there was no one available who could talk to him. He then tried someone at the Arkansas State Police Criminal Investigation Division, who told the programmer he would find the person he needed to talk with to fix the situation. The programmer later called the  Arkansas Times for advice on whom to call. The  Times alerted the Division of Workforce Services to the issue at 4:30 p.m. Soon after a message appeared on the website that said, “The site is currently under maintenance.”\n  “We take the security and privacy of our applicant’s data very seriously,” Zoë Calkins, communications director for the Division of Workforce Services, said in an email. “As soon as we learned of this incident, we immediately took our systems offline to deny outside access to the network. We have engaged independent computer forensic experts to conduct an investigation and determine how this occurred and what, if any, data is at risk. We are committed to completing a full forensic review and will take all appropriate action in response to our findings.”\n The state’s rollout of Pandemic Unemployment Assistance, a new federal aid program for self-employed or contract workers whose earnings have been affected by COVID-19, has been marked by blunder and delay. The state launched the PUA application portal April 16, weeks later than many other states. It’s now  one of only 13 states that have yet to pay out benefits to applicants. Some 5,700 applicants who signed up during what the state called a “test period” were forced to resubmit information after a system error caused their supporting documentation to be deleted.\n   In exploring the website, the computer programmer determined that by simply removing part of the site’s URL, he could access the administrative portal of the site, where he had the option of editing the personal information of applicants, including bank account numbers. From the admin portal, he viewed the page’s source code and saw that the site was using an API (application programming interface) to connect with a database. That API was also left unencrypted, and he could access all of the applicants’ raw data, included Social Security numbers and banking information. In about two minutes, the computer programmer described the vulnerability to another programmer the  Arkansas Times engaged, who then used the information to easily enter the system. To access the sensitive information, the second programmer only needed to create an account, not actually apply for assistance.\n  Another person who applied for Pandemic Unemployment Assistance told the  Times on Friday that when he applied for assistance, submitted his documentation and reached a “review” page, he saw the documentation for another applicant. He said it took three days for the state to remove the other applicant’s information. Then he said documentation for yet another applicant appeared. “It took two days and repeated phone calls to get the second name off,” he said. “Then the next day was when they erased it all and told us we had to reapply.”\n The applicant asked that he remain anonymous for fear that his application wouldn’t be approved.\n The computer programmer said he thought he could have programmed a script that would gather all of the information from the API in under an hour. He did not.\n “It’s a really big issue, my Social Security number is in there,” he said. “It’s unfortunate. I’m trying to get assistance and might get hacked.”\n  An official with the  Division of Workforce Services told a legislative panel today that the state would begin to issue checks to successful applicants to the PUA program next week.", "posttime": "2020-05-17 00:34:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,门户,discovers,申请者", "title": "程序员发现不受保护地访问州申领失业救济金门户的管理模式", "title_en": "Programmer Discovers Unprotected Access to State's Jobless Claims Portal's Admin Mode", "transed": 1, "url": "https://arktimes.com/arkansas-blog/2020/05/15/social-security-numbers-banking-information-left-unprotected-on-arkansas-pua-website", "via": "", "real_tags": ["程序", "门户", "discovers", "申请者"]}, {"category": "", "categoryclass": "", "imagename": "40b515146c93127da5eeb81ac0a5712f.jpg", "infoid": 1002410, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "罗姆尼·惠勒在罗素位于英格兰萨里的家中采访了英国哲学家、逻辑学家、数学家、历史学家和社会评论家伯特兰·罗素。C.。", "note_en": "Romney Wheeler interviews British philosopher, logician, mathematician, historian, and social critic Bertrand Russell at Russell's home in Surrey, England. C...", "posttime": "2020-05-17 00:33:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "罗素,bertrand", "title": "与伯特兰·罗素的对话(1952)[视频]", "title_en": "A Conversation with Bertrand Russell (1952) [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=fb3k6tB-Or8", "via": "", "real_tags": ["罗素", "bertrand"]}, {"category": "", "categoryclass": "", "imagename": "83056ea84836b3ced698f87df00cb3aa.png", "infoid": 1002409, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此脚本将为底层WSL安装创建一个Windows工具栏启动器，可用于通过标准Windows工具栏直接从Windows启动Linux本机应用程序，如下所示：\n之所以特别酷，是因为WSL2即将到来，它带来了前所未有的性能和兼容性改进，因此这将把完整的Linux GUI应用程序直接带到Windows UI中。\n在您的Windows主机上运行的X11服务器(例如X410、Xming等)。必须可以从您的WSL环境访问此服务器(使用wsl.exe--source~/.bashrc；xterm&#34；之类的内容进行测试)。如果失败，请检查您的DISPLAY变量(故障排除中有更多详细信息)。\n安装后，右键单击您的工具栏，转到工具栏-&gt；新建工具栏.。并选择%USERPROFILE%\\.config\\wsl-windows-toolbar-launcher\\menus\\WSL作为目标文件夹(除非您选择了另一个目录)。\n注意：如果您希望使用其他位置，可以使用--help提供许多选项。\n如果已在WSL环境中安装了新软件，只需从WSL环境中再次运行脚本即可获取新的GUI。\n$python wsl-windows-toolbar.py--help用法：wsl-windows-toolbar.py[Options]选项：-i，--install-directory path将启动器目标安装到此目录(&lt；target&gt；将作为此位置的后缀)-m，--metadata-directory path将启动器目标安装到此目录(&lt；target&gt；将作为此位置的后缀)-d，--要为其生成快捷方式的分发文本WSL版本(如果未提供此参数，将使用默认版本)-u，--用户文本WSL版本启动程序的用户身份(如果未提供此参数，将使用默认用户)-y，--确认-yes假定所有确认提示的答案都是&#39；是。-f，--menu-file filename要解析的*.menu菜单文件-w，--wsl-相对于Windows安装的WSL可执行文件的文本路径-n，--目标名称要提供给创建的安装的文本名(将显示在工具栏菜单中)--help显示此消息并退出。\n加载器过程涉及使用wscript启动批处理文件(以降低快捷命令长度)。有一个JJJA模板定义了此脚本，该脚本默认为wsl-windows-bar-template.j2，并从该脚本接受以下可能的变量Passedthrough：\nrcfile：在脚本中选择的启动前的源rc文件(例如.bashrc。\nX11服务器未设置为允许从外部主机访问(如何配置将取决于您的X11服务器，因此请参阅他们的文档)。\n请注意，在本节中，您可以检查您正在使用的WSL版本和：\n如果您正在运行WSL1，那么WSL1的DISPLAY变量应该只是localhost：0.0(如果这是默认的发行版)。\n不幸的是，对于WSL2来说，它现在有点复杂，尽管我认为他们正在重新计划解决这个问题。您将需要类似这样的内容来提取正确的主机：\n那你就得担心防火墙了。WSL是作为公共网络出现的，但我不建议允许所有公共网络流量访问您的X服务器。因此，当出现此类提示时，您可以继续并选择默认值：\n现在，令人恼火的是，这将为公共网络主动添加阻止规则(而不是简单地不添加允许规则)，您需要在下一步中禁用该规则，方法是进入Windows Defender防火墙-&&gt;入站规则，并为公共网络上的TCP禁用此阻止规则。\n如果您不执行上述步骤，阻止规则将优先于允许规则，您将无法通过。\n现在，右键单击入站规则并选择New Rule.，选择TCP端口6000(很可能)，然后选择Defaults。这将为此端口打开您的公共网络.。这也不是你想要的。您想要的是只允许来自WSL子网的流量。因此，刷新列表，滚动到您最近创建的名称，右键单击并转到属性。现在，在“作用域”下，转到“远程IP地址”，选择这些IP地址，然后添加172.16.0.0/12以将可以访问此端口的子网限制为WSL子网。它应该看起来像这样：\n或者，您也可以只禁用WSL的整个防火墙，但这会添加一个防火墙警告，这会不断激怒我：\n应用程序是否使用dbus？如果是这样的话，建议在您的.bashrc中放入类似这样的内容，以满足许多依赖于dbus来运行的应用程序：\ndbus_status=$(服务dbus状态)如果[[$dbus_status=*&#34；没有运行&#34；*]]；则sudo服务dbus--full-restartfi。\n还要检查.bashrc调整是否已添加到.bashrc中会阻止设置显示的任何肮脏之前：\n您可以做类似的对接或任何其他服务，您将需要访问，但不一定已经在一个普通的WSL安装。\n要进一步调试，您可以直接从cmd shell的命令行运行快捷方式：\n将xterm替换为您试图启动的任何命令。注意：在本例中，env命令将打印出在运行xterm之前设置的所有环境变量，因此这将帮助您仔细检查是否真的正确设置了DISPLAY。\n验证您是否在Windows 10上运行X Server。常用选项包括X410或Xming。\n验证您是否可以从WSL终端实际启动X个应用程序(例如，尝试运行xterm)。\n如果需要解决问题，请准备命令的日志输出以及有关您的执行环境的详细信息。理想情况下，还可以尝试查找与故障软件相关的.ktop文件。", "note_en": "This script will create a Windows toolbar launcher for an underlying WSL install whichcan be used to fire up linux native applications directly from Windows via the standardWindows toolbar, like this:\n  It&#39;s particularly cool because WSL 2 is coming which is unlocking unprecedented performanceand compatibility improvements, so this will literally bring the full suite of Linux GUIapplications directly to Windows UI.\n   An  X11 Server running on your  windows host (e.g. X410, Xming etc). This servermust be  reachable from your WSL env (test with something like  wsl.exe -- source ~/.bashrc ; xterm&#34;).If this fails, check your  DISPLAY variable (more details in  troubleshooting).\n        After installation, right click on your toolbar, go to Toolbars -&gt; New toolbar... and select %USERPROFILE%\\.config\\wsl-windows-toolbar-launcher\\menus\\WSL as the target folder (unlessyou selected an alternative directory).\n Note there are many options available with  --help if you&#39;d prefer to use alternative locations.\n  If new software has been installed in the WSL environment, simply run the script again from the WSL environment to pickthe new GUIs up.\n    $ python wsl-windows-toolbar.py --helpUsage: wsl-windows-toolbar.py [OPTIONS]Options: -i, --install-directory PATH Install the launcher targets to this directory (&lt;target&gt; will be suffixed to this location) -m, --metadata-directory PATH Install the launcher targets to this directory (&lt;target&gt; will be suffixed to this location) -d, --distribution TEXT WSL Distro to generate shortcuts for (will use default distro if this parameter is not provided) -u, --user TEXT WSL Distro&#39;s user to launch programs as (will use default user if this parameter is not provided) -y, --confirm-yes Assume the answer to all confirmation prompts is &#39;yes&#39; -f, --menu-file FILENAME The *.menu menu file to parse -w, --wsl-executable TEXT Path to the WSL executable relative to the windows installation -n, --target-name TEXT Name to give to the created installation (will be displayed in toolbar menu) --help Show this message and exit.\n  The loader process involves using wscript to launch a batch file (to keep the shorcut commandlength down). There is a jinja template which defines this script which defaults to wsl-windows-toolbar-template.j2 and accepts the following possible variables passedthrough from the script:\n rcfile: The rc file (e.g.  .bashrc) to source prior to launch selected in the script\n    The X11 server isn&#39;t set up to allow access from external hosts (how to configure this will depend on your X11 serverso please refer to their documentation)\n Note that for this section, you can check which version of WSL you&#39;re using with:\n   If you&#39;re running WSL1, the  DISPLAY variable for WSL1 should simply be  localhost:0.0if this is the default distribution.\n  Unfortunately for WSL2, it&#39;s a little more complicated for now, though I think they&#39;replanning on fixing this. You&#39;ll need something like this to extract the correct host:\n   Then you need to worry about the firewall. WSL comes up as a public network, but I wouldn&#39;t recommendallowing all public network traffic to access your X server. So instead, you can go ahead and selectdefaults when this sort of prompt comes up:\n  Now, irritatingly this will actively add a block rule (rather than simply not add an allow rule) for public networkswhich you will need to disable for the next step by going into Windows Defender Firewall -&gt; Inbound Rules and disabling this block rule for TCP on the Public Network.\n If you don&#39;t do the above step, the Block rule will take precedence over the Allow allow rule and you won&#39;t get through.\n Now, right click on Inbound Rules and select  New Rule..., select TCP port 6000 (most likely) and select defaults. Thiswill open up your public network for this port... which is also not what you want. What you want is to only allow trafficfrom the WSL subnet. So refresh the list, scroll to your recently created name, right click and go to properties. Nowunder  Scope, go to  Remote IP address, Select  These IP addresses and add in  172.16.0.0/12 to limit the subnetswhich can access this port to the WSL subnet. It should look something like this:\n  Alternatively you  could just disable the entire firewall for WSL, but that adds a firewall warning that constantlyirritates me:\n   Does the application use dbus? If so, it&#39;s recommended to put something like this in your  .bashrc to satisfy the manyapplications which depend on dbus to function:\n dbus_status=$(service dbus status)if [[ $dbus_status = *&#34;is not running&#34;* ]]; then sudo service dbus --full-restartfi\n Also check that the  .bashrc tweaks are added  before any nastiness like this in your  .bashrc which would prevent  DISPLAY from being set:\n  You can do similar with  docker or any other service which you will need access to, but won&#39;t necessarily already berunning in a vanilla WSL installation.\n To debug further, you can run the shortcut directly from the command line from a  cmd shell:\n  Replacing xterm with whatever command you&#39;re trying to launch. Note the  env command willprint out all environment variables set before running  xterm in this example, so this shouldhelp you double check if  DISPLAY is really set correctly.\n   Verify that you have an X Server running on windows 10. Popular options include X410 or Xming.\n Verify that you can actually launch X applications from a WSL terminal (e.g. try running xterm).\n If an issue is to be required, please prepare the log output from the command and details on yourexecution environment. Ideally try and find the  .desktop file relating to the failing software as well.", "posttime": "2020-05-17 00:10:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,wsl", "title": "WSL Windows工具栏启动器", "title_en": "WSL Windows Toolbar Launcher", "transed": 1, "url": "https://github.com/cascadium/wsl-windows-toolbar-launcher", "via": "", "real_tags": ["windows", "wsl"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002407, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "准将64的系统软件已经进行了广泛的逆向工程。除了ROM的反汇编之外，还发布了几个“内存映射”：在RAM的第一个千字节中记录系统变量的表，以及如何使用peek和poke调整系统软件。现在，我将介绍终极C64内存映射：并排显示八个源的C64内存参考。\n来自MIT Wandervorschlägen记忆地图的德语参考，H.Hauck博士著，载于64‘er Sonderheft 1986/07。\n您可以通过单击源旁边的复选框来启用和禁用列，并且可以使用表上方的相应按钮展开/折叠所有详细信息。以下是状态字节的四种不同扩展说明：\n这里是$2B-$48范围的折叠版本，将原始源代码中的注释与程序员参考手册进行比较：\n符号(第二列)取自原始来源。有时，单个存储位置有多个含义，因此有几个符号。一些描述被改编来独立地描述不同的含义：\n在反汇编过程中，零页地址(如$CC)和符号(如BLNSW)链接回内存映射：\n内存映射表由独立格式化的ASCII文件生成，如下所示：\n它由三列组成：十六进制的地址范围、符号名称和标记格式的描述。\n旗舰版C64参考正在作为开源项目在github.com/mis64/c64ref上开发-欢迎以添加、修改等形式贡献内容！", "note_en": "The system software of the Commodore 64 has been extensively reverse-engineered. Next to  disassemblies of the ROM, several “memory maps” have been published: tables that document system variables in the first kilobyte of RAM, and how to tweak the system software with  PEEK and  POKE. Now, I’m presenting the  Ultimate C64 Memory Map: A C64 memory reference that shows eight sources side-by-side.\n   German-language reference from  Memory Map mit Wandervorschlägen by Dr. H. Hauck, in 64’er Sonderheft 1986/07.\n You can enable and disable columns by clicking the checkboxes next to the sources, and you can expand/collapse all details with the corresponding button above the table. Here are four different expanded explanations of the  STATUS byte:\n  And here is the collapsed version of the range $2B-$48, comparing the comments in the original sources with the Programmer’s Reference Manual:\n  The symbols (second column) are taken from the original sources. Sometimes, a single memory location has several meanings and thus several symbols. Some descriptions have been adapted to describe the different meanings independently:\n    And in the disassembly, zero page addresses (like  $CC) and symbols (like  BLNSW) link back to the memory map:\n  The memory map table is generated from independent formatted ASCII files that look like this:\n  It consists of three columns: the address range in hex, the symbol name and the description in MarkDown format.\n The Ultimate C64 Reference is being developed as an open source project at  github.com/mist64/c64ref – contributions in the form of additions, corrections etc. are welcome!", "posttime": "2020-05-16 23:48:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "内存,memory,原始", "title": "C64内存映射", "title_en": "C64 Memory Map", "transed": 1, "url": "https://www.pagetable.com/?p=1397", "via": "", "real_tags": ["内存", "memory", "原始"]}, {"category": "", "categoryclass": "", "imagename": "f46907cba5e36d922f9ead361ef0067c.jpg", "infoid": 1002405, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "异丙醇，特别是在60%至90%酒精与10%至40%纯水的溶液中，对细菌、真菌和病毒具有快速抗菌作用。一旦酒精浓度降到50%以下，消毒效果就会急剧下降。值得注意的是，较高浓度的酒精不会产生更理想的杀菌、杀病毒或杀菌特性。\n水的存在是异丙醇破坏或抑制病原微生物生长的关键因素。水在营养细胞膜的蛋白质变性过程中起着催化剂的作用，并且起着关键的作用。70%的IPA溶液更完全地穿透细胞壁，渗透到整个细胞，凝结所有的蛋白质，因此微生物死亡。额外的水含量会减缓蒸发，从而增加表面接触时间并提高效率。异丙醇浓度超过91%会立即凝结蛋白质。因此，形成了一层保护层，保护其他蛋白质不会进一步凝结。\n溶液&gt；91%的iPA确实能杀灭细菌，但有时需要更长的接触时间才能消毒，并使孢子处于休眠状态而不会被杀死。在这项分析中，50%的异丙醇溶液在不到10秒内就能杀死金黄色葡萄球菌(PG。238)，然而接触时间超过两小时的90%溶液是无效的。一些消毒剂会杀死孢子，这被归类为。那么，为什么更高的酒精溶液在杀菌和抗菌方面的效果会更差呢？", "note_en": "Isopropyl alcohol, particularly in solutions between 60% and 90% alcohol with 10 – 40% purified water, is rapidly antimicrobial against bacteria, fungi, and viruses. Once alcohol concentrations drop below 50%, usefulness for disinfection drops sharply. Notably, higher concentrations of alcohol don’t generate more desirable bactericidal, virucidal, or fungicidal properties.\n The presence of water is a crucial factor in destroying or inhibiting the growth of pathogenic microorganisms with isopropyl alcohol. Water acts as a catalyst and plays a key role in denaturing the proteins of vegetative cell membranes.   70% IPA solutions penetrate the cell wall more completely which permeates the entire cell, coagulates all proteins, and therefore the microorganism dies. Extra water content slows evaporation, therefore increasing surface contact time and enhancing effectiveness. Isopropyl alcohol concentrations over 91% coagulate proteins instantly. Consequently, a protective layer is created which protects other proteins from further coagulation.\n Solutions &gt; 91% IPA do kill bacteria, but sometimes require longer contact times for disinfection, and enable spores to lie in a dormant state without being killed. In this analysis, a 50% isopropyl alcohol solution kills  Staphylococcus Aureus in less than 10 seconds ( pg. 238), yet a 90% solution with a contact time of over two hours is ineffective. Some disinfectants will kill spores, which are classified as  . So why do higher alcohol solutions yield fewer results for bactericidal and antimicrobial outcomes?", "posttime": "2020-05-16 23:47:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "异丙醇,alcohol,溶液", "title": "为什么70%异丙醇(IPA)是比99%异丙醇更好的消毒剂？", "title_en": "Why Is 70% Isopropyl Alcohol (IPA) a Better Disinfectant Than 99% Isopropanol?", "transed": 1, "url": "https://blog.gotopac.com/2017/05/15/why-is-70-isopropyl-alcohol-ipa-a-better-disinfectant-than-99-isopropanol-and-what-is-ipa-used-for/", "via": "", "real_tags": ["异丙醇", "alcohol", "溶液"]}, {"category": "", "categoryclass": "", "imagename": "2aa210a51381d6731ed4a29d4f2807b9.jpg", "infoid": 1002404, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们中的许多人都看到了几周前在社交媒体上疯传的帖子，当时芝加哥餐厅老板朱塞佩·巴达拉门蒂(Giuseppe Badalamenti)在外卖应用GrubHub上发布了他3月份的发票。在扣除佣金、手续费、调整和促销费用后，他的披萨连锁店1,042.63美元的提货和送货销售额只剩下微不足道的376.54美元。\n巴达拉门蒂的例子虽然极端，但它揭示了在冠状病毒关闭进入第三个月之际，餐馆面临的一个日益繁重的问题：压榨可能徘徊在订单总成本30%左右的送货应用费用。\n向一个利润微薄的行业收取如此高昂的佣金，即使在最好的时候也对餐馆没有帮助。在大流行期间，它正在加速它们的灭亡。\n洛杉矶必须效仿旧金山和纽约的做法，对送货应用程序可以从餐厅收取的佣金设定上限，直到它们能够恢复全面的就餐服务。它还应该通过类似于芝加哥通过的立法，后者要求送货应用程序向用餐者提供清晰透明的费用明细。\n至少，送货应用程序应该被强制限制对小型独立餐厅和连锁店的费用。从麦当劳还是塔可钟点餐？当然可以，全额收费。\n我的资本主义头脑和任何人的一样好用，我知道送货应用程序是有自己的钱要赚的企业，要对投资者负责，要付钱给员工。但Uber Eats和GrubHub等服务正在为创纪录的顾客数量提供服务，而许多苦苦挣扎的餐厅几乎看不到任何顾客。\n餐馆几乎没有追索权，只能玩球：点击智能手机点餐很容易，而且许多食客现在离开家去取食物并不舒服。与此同时，大多数餐厅都没有自己的司机：除了雇佣他们的成本外，这也是一个令人头疼的法律问题。(应用程序交付人员也有自己的问题-他们在努力维持大流行期间的安全的同时，也在努力赚取最低生活工资。)。\n在关闭之前，Glassell Park的Lemon Poppy Kitchen和Highland Park的Parsnip的共同所有者安卡·卡利曼(Anca Caliman)说，她的餐厅不到15%的收入来自应用程序。现在已经超过一半，这意味着她的利润率更低了。\n“即使在疯狂之前，无论你怎么切分，这都是一笔可怕的交易，”她说。“费用实在太高了。餐厅利润率平均可能为5%。\n“那要收百分之二十到百分之三十的快递服务费，简直是疯了。他们展示自己的方式是：‘你会收到更多订单。’1000个订单打七折是没有用的。“。\n收费结构缺乏透明度是另一个令人沮丧的问题。Caliman说，当她两年前第一次与GrubHub交谈时，她被报价为10%的费用。“当你和销售人员通电话时，他们会向你承诺一切，”她说。\n她估计，她为GrubHub订单支付的实际金额在25%至27%之间。\n“他们所做的一切似乎都不符合客户的最佳利益。”\nCaliman想要抛弃GrubHub，但感到有压力要保持在这些应用程序上的存在，尽管这些应用程序的费用往往会让她失去从自己销售的产品中赚钱的机会。\n阿特瓦特村Giamela‘s和RC Provisions的老板马特·吉亚梅拉(Matt Giamela)呼应了这种感觉。\nGiamela向Uber Eats支付了22%的佣金，他说：“你必须接受，因为其他人都在这么做，你不想抬高你的价格。”\n餐厅支付的费率并不是一刀切的。它们可能因平台和业务的不同而大不相同。那些订单量大的人，或者同意与一个合作伙伴独家合作的人，有时可以谈判一个较低的价格。\n他说，像Uber Eats这样的应用程序会让餐厅通过提价来弥补费用，“但你不会这么做，因为如果你比竞争对手多出两三美元，顾客就不会来了。”\n去年，DoorDash以4.1亿美元收购了鱼子酱。现在，这个池将进一步整合。优步-过去曾被指控存在欺骗性商业行为-正在就以约60亿美元收购GrubHub进行谈判。这可能会让优步拥有更大的筹码，可以对送货收取任何费用。\n虽然优步和GrubHub都没有实现送餐盈利，但它们都得到了风险投资，获得了堆积如山的现金：GrubHub今年第一季度的收入为3.6298亿美元，同比增长超过12%。优步Eats的收入比去年同期猛增53%，达到8.19亿美元。\n与此同时，餐馆正面临彻底的破坏。根据美国劳工统计局(Bureau Of Labor Statistics)的数据，4月份全国餐饮业减少了550万个工作岗位。在洛杉矶，整体失业率目前为24%，高于2月份的4.7%。\n一位好莱坞餐厅老板在不具名的情况下透露了她的餐厅财务细节，她让我看了她3月份的GrubHub发票，发票上显示了93个订单，总收入6626美元。GrubHub收取了1208美元的佣金，592美元的单独送货费和230美元的手续费，总共2030美元，略高于30%。剩下的4596美元-其中包括她负责支付的573美元的销售税。\n“这不公平，”她说。“但是我能做些什么呢？”她说，她的信用卡债务堆积如山，难以赚到足够的钱来支付账单和剩余的13名员工。“每个人都很害怕。在接下来的几个月里，我们怎么才能拿到钱呢？“。\n坎特熟食店(Canter‘s Delicatessen)的老板马克·坎特(Marc Canter)坦率地说，他现在认为每一家餐厅都是真的-这只是一场生存和参与游戏的斗争。“根本没有盈利这回事，”他说。“把‘利润’这个词从谈话中去掉。我认为每个人都在亏本工作--问题是，规模有多大。“\n坎特说，尽管应用程序订单大幅增长--它们现在占他业务的70%--但收入远远不足以弥补餐饮业务的损失。他估计，仅他的水电费一个月就超过2.5万美元。\nCanter在其费尔法克斯分店与Postmate独家合作，并支付20%的佣金。他过去也曾与优步Eats合作，但最终放弃了这个平台。\n他说：“曾经有一段时间，我们在PostMates每周支付1万美元，在优步每周支付1万美元。”但他不喜欢优步30%的收费结构。\n“我们没有淹死，”他在谈到这家餐厅时说，尽管他不得不让150名员工中的100人休假。“我们正在慢慢地喝一点我们不想喝到嘴里的水。但至少我们的脚上没有系保龄球。如果他们降息5%，或许可以帮助我们实现盈亏平衡。“。\n在一份通过电子邮件发送的声明中，优步的一名代表表示，监管费用“最终可能会伤害到我们试图帮助最多的那些人：客户、小企业和送货员。”\nGrubHub的一位发言人呼应了这一观点，他说：“这完全是一个错误的提议。任何武断的上限--无论期限长短--都会降低当地餐馆的订单量，增加小企业主的成本，并增加顾客的成本。\n正如格鲁布所暗示的那样，收费限制怎么会伤害餐馆和他们的顾客呢？在泽西城，市长史蒂夫·富洛普(Steve Fulop)发布了一项行政命令，在紧急状态期间将送货应用程序的费用上限定为10%，优步的回应是将这一影响其收入的费用直接转嫁给用餐者，对每单订单单独收取3美元的费用。\n但现在不是正常时期。在联邦层面没有领导力，小企业得不到救济的情况下，没有人能让我们的小餐厅变得完整-为什么要指望餐厅让应用程序公司变得完整呢？\n外卖应用程序公布了创纪录的收入数字，不太可能出于好意而削减费用。(DoorDash一家公司表示，将暂时将商定的佣金减少50%，但只会持续到5月底。)。\n洛杉矶市议会正在考虑一项措施，将送货APP费用限制在15%，但尚未采取果断行动。这必须现在就做-每过去的一天，我们的餐厅都越来越接近悬崖边缘。\n同时：打电话给你最喜欢的餐厅，自己去取食物。忘了那些应用吧。", "note_en": "Many of us saw the viral   social media post from a couple of weeks ago, when Chicago restaurant owner Giuseppe Badalamenti posted his March invoice from food delivery app Grubhub. After being docked for commissions, fees, adjustments and promotions, all that remained of his pizza joint’s $1,042.63 in pickup and delivery sales: a measly $376.54.\n Badalamenti’s example, while extreme, sheds light on what is becoming an increasingly onerous problem for restaurants as we enter the third month of the coronavirus shutdown: crushing delivery app fees that can hover around 30% of the total cost of an order.\n Leveling such steep commissions on an industry with notoriously thin profit margins does not help restaurants in the best of times. During a pandemic, it is hastening their demise.\n  Los Angeles must follow examples set by San Francisco and New York by setting caps on the commissions that delivery apps can collect from restaurants until they are able to resume full dine-in service. It should also adopt similar legislation to that passed in Chicago, which requires the delivery apps to present a clear and   transparent breakdown of fees to diners.\n At the very least, delivery apps should be forced to cap their fees on small, independent restaurants and chains. Ordering from McDonald’s or Taco Bell? Sure, charge them the full amount.\n My capitalist brain works as well as anyone’s, and I get that delivery apps are businesses with money of their own to make, investors to answer to and employees to pay. But services like Uber Eats and Grubhub are serving a record number of customers during a time when many struggling restaurants are seeing barely any.\n Restaurants have little recourse but to play ball: Tapping on a smartphone to order dinner is easy, and many diners don’t feel comfortable leaving their homes to pick up food right now. Most restaurants, meanwhile, don’t have their own drivers in house: Besides the cost to employ them, it’s also a legal headache. (App delivery workers have their own problems — they’re struggling to   make a living wage while trying to keep safe   during the pandemic.)\n    Before the shutdown, Anca Caliman, co-owner of Lemon Poppy Kitchen in Glassell Park and Parsnip in Highland Park, said that less than 15% of her restaurants’ revenue came through apps. Now it’s more than half, which means her profit margins are thinner.\n  “Even before the madness, it was just a terrible deal no matter how you slice it,” she said. “The fees are just too high. Restaurant profit margins are maybe 5% on average.\n “Then to have a delivery service charge between 20% and 30% is just crazy. And the way they present themselves: ‘You’re going to get so many more orders.’ 1,000 orders at 30% off does not help.”\n  Lack of transparency in the fee structure is an additional frustration. Caliman said that when she first spoke to Grubhub two years ago, she was quoted a 10% fee. “When you talk to a salesperson on the phone, they promise you everything,” she said.\n She estimated the actual amount she pays on Grubhub orders is between 25% and 27%.\n “Nothing that they do seems like it’s in the best interest of their customers.”\n Caliman wants to ditch Grubhub but feels pressure to maintain a presence on the apps, despite the way their fees can often eliminate her chance of making any money on what she’s selling.\n  Matt Giamela, owner of Giamela’s in Atwater Village and RC Provisions, echoed that feeling.\n “You have to go along with it because everyone else is doing it, and you don’t want to inflate your prices,” said Giamela, who pays Uber Eats a 22% commission.\n The rates restaurants pay are not uniform across the board. They can vary wildly from platform to platform and business to business. Those who do a high volume of orders, or agree to be exclusive with one partner, can sometimes negotiate a lower rate.\n Apps like Uber Eats will offer to let restaurants make up fees by increasing their prices, he said, “but you don’t do it because customers won’t come if you’re two or three dollars more than your competition.”\n   Last year, DoorDash acquired Caviar for $410 million. Now the pool is set to consolidate yet further. Uber — which in the past has been accused of   deceptive business practices  — is in talks to purchase Grubhub   for about $6 billion. That could give Uber even greater leverage to slap whatever fees it chooses onto deliveries.\n While neither Uber nor Grubhub   turns a profit delivering food, they are nonetheless venture-backed and raking in mountains of cash: Grubhub reported revenue of $362.98 million during the first quarter this year, a year-over-year increase of more than 12%. Uber Eats’ revenue surged 53% from the same quarter a year ago, to $819 million.\n Restaurants, meanwhile, are facing utter devastation. The restaurant industry lost 5.5 million jobs nationwide in April, according to the   Bureau of Labor Statistics. In L.A., the overall unemployment rate now stands at 24%, an increase from 4.7% in February.\n  One Hollywood restaurant owner, who shared details of her restaurant’s finances on the condition she not be identified, let me see her Grubhub invoice for March, which showed 93 orders totaling $6,626 in revenue. Grubhub took $1,208 in commission, $592 in a separate delivery fee, and $230 in processing fees for a total of $2,030, just over 30%. That left $4,596 — which included $573 in sales tax that she’s responsible for paying.\n “It’s unfair,” she said. “But what can I do?” She said she’s racking up credit card debt and struggling to bring in enough money to pay her bills and 13 remaining employees. “Everyone’s scared. How are we going to get money in the next few months?”\n Marc Canter, owner of Canter’s Delicatessen, is honest about what he assumes to be true of every restaurant right now — it’s a fight simply to remain alive and in the game. “There’s no such thing as a profit,” he said. “Take the word ‘profit’ out of the conversation. I think everyone is working at a loss — the question is, how big.”\n Canter said that while app orders have grown significantly — they now make up 70% of his business — that revenue isn’t nearly enough to make up for lost dine-in business. His utilities alone, he estimates, are more than $25,000 a month.\n  Canter works exclusively with Postmates at its Fairfax location and pays a 20% commission. He used to work with Uber Eats as well but ended up dropping the platform.\n “There was a time we would do $10,000 a week in Postmates and $10,000 a week with Uber,” he said, but he didn’t like Uber’s 30% fee structure.\n “We’re not drowning,” he said of the restaurant, though he has had to furlough 100 of his 150 employees. “We’re slowly drinking a little water we don’t want in our mouth. But at least we don’t have a bowling ball attached to our foot. If they cut their rates 5%, maybe that could help us break even.”\n In an emailed statement, an Uber representative said that regulating fees “could ultimately hurt those that we’re trying to help the most: customers, small businesses and delivery people.”\n  A Grubhub spokesman echoed that sentiment, saying, “This is exactly the wrong proposal. Any arbitrary cap — regardless of the duration — will lower order volume to locally owned restaurants, increase costs for small business owners, and raise costs on customers.”\n How could fee limits hurt restaurants and their customers, as Grubhub is implying? In Jersey City, where Mayor Steve Fulop  issued an executive order capping delivery app fees at 10% during states of emergency, Uber’s response was to pass that hit to its revenue directly onto the diner, levying a separate $3 charge on each order.\n But these are not normal times. With no leadership on the federal level and a   lack of relief for small businesses, no one is making our small restaurants whole — why should the restaurants be expected to make the app companies whole?\n Food delivery apps, which are posting record revenue numbers, are unlikely to cut their fees out of the goodness of their hearts. (One company, DoorDash, said it would   temporarily reduce agreed-upon commissions by 50%, but only until the end of May.)\n  The L.A. City Council is   considering a measure to limit delivery app fees to 15%, but decisive action has not been taken. It has to be done now — every passing day brings our restaurants closer to the brink.\n In the meantime: Call your favorite restaurant and pick the food up yourself. Forget the apps.", "posttime": "2020-05-16 23:46:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,程序,delivery,餐厅", "title": "我们的餐厅正在倒闭。为什么外卖应用程序应该蓬勃发展？", "title_en": "Our restaurants are failing. Why should food delivery apps thrive?", "transed": 1, "url": "https://www.latimes.com/food/story/2020-05-16/food-delivery-app-commissions-ubereats-grubhub-doordash", "via": "", "real_tags": ["app", "程序", "delivery", "餐厅"]}]