[{"category": "", "categoryclass": "", "imagename": "9e510c6e23105b68f1aecd2161bc664b.png", "infoid": 1000408, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们的趋势观察家注意到亚马逊上1TB固态硬盘的价格大幅下降。你现在只需花97.99美元就可以买到评级最高的驱动器之一。\n售价97.99美元的Silicon Power 1TB固态硬盘3D NAND支持TRIM、垃圾收集技术、RAID和ECC(错误检查与纠正)，以提供优化的性能和增强的可靠性，先进的SLC缓存技术可提高性能并延长使用寿命。\n但这并不是唯一一家大幅下降的产品，其他制造商都在效仿，大幅降价。\nAce A55采用先进的3D NAND闪存，比配备2D NAND闪存的传统固态硬盘具有更高的可靠性和更高的电源效率。A55提供了更好的耐用性和更长的电池续航时间，您可以更长时间地工作，而无需频繁给笔记本电脑充电。\nA55由高质量控制器和原装同步NAND闪存驱动，可提供令人难以置信的高传输速度，从而缩短启动时间、快速加载应用程序和快速处理文件。\nA55特别应用了“SLC缓存技术”，允许所有数据首先写入SLC部分，从而实现更高的峰值写入性能。此外，该技术可以减少写入放大，从而提供更好的耐用性和更长的固态硬盘寿命。\nA55附带免费下载的固态硬盘运行状况监控工具-SP Toolbox软件，该工具专为您设计，可轻松监控固态硬盘的当前运行状况。这样，您就可以运行性能测试、获得总体运行状况评估并检查有关SSD的详细信息，包括设备上的已用空间、设备温度、写入的总字节数、S.M.A.R.T.状态、擦除计数状态和块数。\nA55采用坏块管理功能构建，可持续监控和更换坏块，以延长固态硬盘的使用寿命，使您的系统保持良好状态。\nA55是同类中最轻、最薄的固态硬盘之一，但它是防震和防震的，因为它没有活动部件。此外，还配备了S.M.A.R.T.监控系统和ECC技术，以保证更高的数据传输安全性。", "note_en": "Our trend watchers noticed a significant drop in 1TB SSD prices on Amazon. You can now pick up one of the highest rated drives for just $97.99.\n The  $97.99 Silicon Power 1TB SSD 3D NAND supports TRIM, Garbage Collection technology, RAID, and ECC (Error Checking &amp; Correction) to provide optimized performance, and enhanced reliability and the advanced SLC Cache Technology allows performance boost and longer lifespan.\n  But that’s not the only one that’s dropped significantly, the other manufacturers are all following suit and dropping their prices significantly.\n   Applying the advanced 3D NAND flash, Ace A55 features higher reliability and better power efficiency than traditional SSDs equipped with 2D NAND flash. The A55 offers improved endurance and longer battery life that you’re able to work longer without frequently recharge your laptop.\n  Powered by high quality controller and original synchronous NAND flash, the A55 delivers incredibly high transfer speeds that enable short boot time, fast application loading and quick file processing.\n  The A55 especially applies the ”SLC Cache technology” that allows all data to be written in the SLC portion first and leads to higher peak writing performance. In addition, the technology can reduce write amplification and thus offer better endurance and longer lifespan of the SSD.\n  The A55 comes with a free-download SSD health monitor tool – SP Toolbox Software, which is especially designed for you to easily monitor the current health status of a SSD. By such, you can run a performance test, get an overall health evaluation and check detailed information about your SSD, including used space on device, device temperature, total bytes written, S.M.A.R.T. status, erase count status and block numbers.\n   The A55 is built with Bad Block Management, which can continually monitor and replace bad blocks to keep your system in good condition with prolonged lifespan of a SSD.\n  The A55 is one of the lightest and thinnest SSD of its kind yet it is shock- and vibration-proof since it contains no moving parts. Furthermore, S.M.A.R.T. monitoring system and ECC technology are equipped to promise higher data transmission safety.", "posttime": "2020-05-03 04:19:42", "tags": "硬盘,固态硬盘,固态,ssd,写入", "title": "1 TB固态硬盘的成本刚刚降至98美元以下", "title_en": "The cost of a 1TB SSD drive just dropped below $98", "transed": 1, "url": "https://arador.com/the-cost-of-a-1tb-ssd-drive-just-dropped-below-98/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["硬盘", "固态硬盘", "固态", "ssd", "写入"]}, {"category": "", "categoryclass": "", "imagename": "0bc64b67a28f0c524e40524296d717a5.jpg", "infoid": 1000407, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "任何想法最好的部分是当它是新鲜的和新的，而你还不知道它的限制和限制。它几乎可以是神奇的！哦，你会帮助客户，你会赚到钱！你首先要做的就是…。写很多代码。\n有多少代码？嗯，很明显，这取决于你的想法和你计划建立的业务。但是，在任何SaaS业务中，都有大量的代码是您需要和想要的，而且在您甚至可以编写一行业务逻辑之前，您都必须编写其中的很多代码。\n好的，首先你需要一些开始的东西。除非您计划从头开始编写所有内容，否则您将需要设置一些通用框架来支持现代Web应用程序的运行。在前端，这大概是这样的：\n如果您的框架中没有HTTP请求库，那么可以提供一个HTTP请求库。例如：SuperAgent，Axios，GET。\n将所有这些不同的工具设置在一起也需要一些时间。只要搜索一下为X#34；配置webpack的版本，就会发现为不同版本的webpack和X写的博客帖子比比皆是。虽然有些会有所帮助，但也有一些会赢，有时只有实验才能揭晓哪个是哪个。\n谢天谢地，有一些工具可以让这一切变得更容易。React的Next.js和Vue的Nuxt.js只是两个例子，但是有许多风格的UI框架可以显著减少上面的设置时间。当然，现在您必须了解UI框架和UI库是如何工作的，但通常情况下，这种权衡是值得的。\n转到后端，您将需要一个Web框架。“这在很大程度上取决于您使用的语言，但您有很多可供选择的语言：\n这个列表决不是很广泛--仅仅是追踪一种语言的所有可用的框架就是它自己的一篇文章了。但它确实显示了各种可用的选择。每种语言和框架都有自己的能力和取舍，这是你在做出选择之前必须考虑的。现在(或之后！)在这一点上，你很难改变主意。)。\n实际上，让我们退一步说。当然，这些都是基本的，但您仍然需要某个地方来运行所有这些代码，并以某种方式加快对代码更改的评估。\n你可以在你的本地机器上运行所有的东西，但这很少是理想的。首先，您的本地环境不太可能与您的生产环境相似，并且您不希望在部署时看似微不足道的差异造成问题。此外，(相对而言)自动执行本地环境设置非常困难，因此将其他任何人添加到项目中必然会导致冲突，特别是如果他们想要使用与您完全不同的操作系统。\n虚拟机的优势在于非常易于理解和使用。如果你知道如何浏览你自己的系统，你就会知道如何浏览虚拟的系统。使用Ansible这样的工具，它们很容易实现自动化；使用Vagant这样的工具，开发时也很容易使用。此外，您可能只需要修改少量Ansible脚本或变量，即可将您的开发部署脚本转换为生产部署脚本。\n但它们可能有点重，因为它们是在模拟另一台完整的机器。这方面有很好的解决方案(启用CPU优化，使用AMI或其他机器映像减少部署时间等)，但也有替代方案。\n码头集装箱轻得离谱。从本质上说，他们只是按照您的指示运行运行您的代码所需的系统部分。此外，很多CI系统都接受dockerfile作为输入，以自动运行代码的测试和部署。一个建造良好的码头设置是一件美丽的事情。\n然而，docker可能会让人有点困惑。*它需要学习与直接在机器或虚拟机上工作不同的心态和工具，并且可以自然地引导您转向更复杂的解决方案，否则更简单的解决方案会更适合您的用例。(微服务您好！)。\n可以为您节省大量时间的一件小事是在您的代码上设置监视器。*这些程序会密切关注代码中的更改，然后重新编译并重新启动服务器，以便在您刷新浏览器时始终运行最新版本的代码。“您将使用的许多工具都带有内置的观察器(例如webpack)，但对于其他工具，您需要安装自己的(nodemon来监视您的node.js服务器)。\n与任何其他配置一样，您必须执行以下配置，以确保每个监视器只监视正确的目录，确保文件在您的主机系统和VM/docker容器之间以一种不会绊倒您的监视器的快速方法共享，等等。\n如果运气好的话，你已经有了一个设计要用，但是你还没有。", "note_en": "The best part of any idea is when it&#39;s fresh and new, and you don&#39;t yet know the limitations and restrictions.  It can be almost magical!  Oh, the customers you&#39;ll help and the money you&#39;ll make!  All you have to do first is... write a lot of code.\n How much code?  Well, obviously that depends on your idea and what business you&#39;re planning on setting up.  But there&#39;s a huge amount of code you&#39;ll need and want for  any SaaS business, and a lot of it you&#39;ll have to write before you can write even  line one of your business logic.\n    Okay, first you&#39;re gonna need something to start from.  Unless you plan on writing  everything from scratch, you&#39;ll need to set up some common frameworks to enable a modern web app to run.  On the front-end, that&#39;s something like:\n An HTTP requests library, if your framework doesn&#39;t come with one.  Examples:  Superagent,  Axios,  got.\n Getting all these various tools set up to work together will take some time as well.  Just searching &#34;configuring webpack for X&#34; reveals a minefield of blog posts written for various versions of webpack and X.  Some will help, some won&#39;t, and sometimes only experimentation will reveal which is which.\n Thankfully, there are tools that make a lot of this easier.   Next.js for React and  Nuxt.js for Vue are just two examples, but there are many flavours of UI frameworks that can significantly reduce the setup time for the above.  Of course, now you have to learn how your UI framework works as well as your UI library, but generally that trade-off is worthwhile.\n Moving on to the back-end, you&#39;re going to want a web framework.  This will largely depend on the language you&#39;re working with, but you have plenty to choose from:\n  This list is by no means extensive - just tracking down all the available frameworks for a single language would be an article in it&#39;s own.  But it does display the variety of choices available.  Each language and framework has its own capabilities and trade-offs, and that&#39;s something you&#39;ll have to take into account before you make your choice.  (Or after!  It&#39;s just harder to change your mind at that point.)\n  Actually, let&#39;s take a step back for a second.  Sure, those are the basics, but you still need someplace to  run all that code, and in a way that speeds up your evaluation of code changes.\n You could run everything on your local machine, but that&#39;s rarely ideal.  For starters, your local environment is highly unlikely to resemble your production environment, and you don&#39;t want seemingly-minor differences causing problems when you deploy.  Plus, it&#39;s very hard (comparatively) to automate local environment setup, so adding anyone else to the project is bound to cause conflict, especially if they want to use an entirely different OS from you.\n   Virtual Machines have the advantage of being very simple to understand and work with.  If you know how to navigate your own system, you&#39;ll know how to navigate a virtual one just fine.  They&#39;re easily automated with something like  Ansible, and easy to use for development with something like  Vagrant.  Plus, you&#39;ll likely only need to modify a bit of your Ansible scripts or variables to turn your development deploy script into a production deploy script.\n But they can be a bit  heavy, as they are emulating an entire other machine.  There are good solutions to this (enabling CPU optimizations, using AMIs or other machine images to reduce deploy time, etc), but there&#39;s also an alternative.\n  Docker containers are  crazy lightweight.  Essentially, they just run the bits of the system required to run your code, as dictated by you.  Plus, a great many CI systems accept dockerfiles as input to automatically run tests and deploys of your code.  A well-built docker setup is a thing of beauty.\n However, docker can be a bit  confusing.  It requires learning a different mindset and tooling from working directly on a machine or virtual machine, and can lead you naturally towards more-complex solutions where a simpler one would otherwise work better for your use case.  (Hello, microservices!)\n  A small thing that can save you a lot of time is setting watchers on your code.  These are programs that keep an eye out for changes in your code, then re-compile and restart servers so that the latest version of your code is always running when you refresh your browser.  Many of the tools you&#39;ll use will come with built-in watchers (webpack, for example), but for others, you&#39;ll need to install your own ( nodemon to watch your Node.js server).\n And like with anything else, there&#39;s configuration you have to do to make sure that each watcher is only watching the correct directories, that files are shared between your host system and VM/docker container in a fast method that won&#39;t trip up your watchers, etc.\n  With any luck, you&#39;ll have a design already to work with, but you still need to translate that design into an application template and common UI components and architecture. A good CSS framework can really help here, allowing you to set up common colours and sizes that you can use across the entire project, and using component-based development can allow you to, say, create a TextInput element once, then use it across your project multiple times. You&#39;ll also need to set  ...\n  Proper logging can give you more and more-useful information than a slapdash setup can.  You&#39;ll want to log requests and request data, useful checkpoint information, and the usual stuff - errors, stack traces, etc.  But you also want to make sure not to log  too much.  For example, you&#39;ll obviously want to omit passwords, but you should also in general omit headers, especially headers containing authentication tokens, for obvious security reasons.\n  Database schemas are part of your app as well, and that means they need to be represented as code somewhere and checked into version control.  Manually updating your production database to match your development database is amateur-hour.\n So in addition to your back-end frameworks and your front-end frameworks, you&#39;ll need a database migration framework, and you&#39;ll need to write migrations for it.\n  Users are the fundamental primitive of a SaaS application, and there&#39;s a common set of interactions you&#39;ll require: sign-up, login, logout, edit profile, etc.  But sitting underneath all that is a bit of a contentious topic: user authentication.\n There are a bunch of ways to do user authentication, but most of them are wrong and will end up leaving you with security vulnerabilities.   JWTs are popular and can be secured, but you need to follow some best practices:\n Don&#39;t store JWTs in localStorage, since any JS that runs on your page can access them, and if you get hit with a cross-site scripting attack, they can export your tokens en masse.\n  Include a global version code in your JWTs so that you can instantly invalidate all JWTs every issued.\n Include a user version code in your JWTs so that a user can instantly invalidate all JWTs ever issued for them specifically.  This is useful to include a &#34;log out all devices&#34; option for users who may have lost a device or had their account compromised.\n Send a  Cross-Site Request Forgery token with every request as a javascript-injected header, and make sure that token matches one you&#39;ve stored for the user on login.\n You&#39;ll notice a lot of these practices are &#34;in case of a security breach&#34;, and you&#39;d hope that if you did everything correctly, they&#39;d be unnecessary.  However, that&#39;s a fantasy and should be treated as such.  No site is 100% secure and bug-free, and yours won&#39;t be either.  Instead, you need to work in layers, so that if any one layer of security fails, there are still other layers and countermeasures in place.\n  When users sign up, log in, and really all throughout your app, they&#39;ll be filling out and submitting forms. These forms will need to be validated for the appropriate data, preferably on both the front-end (before the data is sent to the server, to provide the best experience to the user) and the back-end (to ensure no junk data is saved to the database). If your back-end isn&#39;t in JavaScript, you&#39;ll need validation libraries for both languages that have the  ...\n  Transactional email is the email you send when certain events happen for your users.  These can be lifecycle events, like welcome emails, &#34;trial about to expire&#34; emails, etc, or service-related emails like email address confirmation emails, password reset emails, notifications about your service, etc.\n You&#39;ll need to find and configure a decent mailer module, and usually perform some DNS configuration at your mail service host&#39;s instruction.  Some mailer modules will come with template capabilities built-in, while others will leave you to install your own.\n  Getting paid is why most people are going to start a SaaS in the first place, so processing payments and subscriptions is mightily important. Choosing and setting up an account with a payments provider is up to individual preference, but Stripe offers probably the best API and developer experience out there, while PayPal is usually the most-requested provider of choice from users. It&#39;s likely that you&#39;ll want to offer multiple ways to pay through multiple providers,  ...\n If you offer subscriptions, you&#39;ll want to allow users to choose between a monthly billing cycle and an annual one.  Annual billing is a great way for dedicated users to save money, while also offering you the benefits of higher  LTV and getting you the money up-front, increasing your liquidity.\n If you have multiple levels of plans, you&#39;ll need to implement the ability for users to change between those levels, usually offering a prorated fee for the month of transition.\n Though it&#39;s definitely not the &#34;happy path&#34;, you&#39;ll need to offer users the ability to cancel subscriptions.  You shouldn&#39;t add extra friction to this, since some users will just be cancelling temporarily, and you want to leave a good impression on them, but it&#39;s important to try to capture the reason they&#39;re leaving, so you can improve your service.\n  Once you&#39;ve fully-developed your fancy new SaaS, you&#39;re going to need to put it up on the web for people to interact with, and for that, you&#39;re going to need a deploy system.  Even if that system is largely manual, you&#39;re going to want defined, repeatable, documented steps that ensure that deploys go off without incident.\n   There are a whole lot more things you can do to ensure a safe and clean deploy, but this list is at least a good starting place.\n  Much like how we discussed security in layers above, backups of production data are another layer of defence in case something goes wrong.  If you&#39;re still using manual processes to alter user data, it can be very easy for a slip of the keys to accidentally alter or delete the wrong user&#39;s data.  And if you&#39;re using automated processes, it&#39;s usually a lot harder to make those simple mistakes, but more complex mistakes can make it very easy to edit or delete  huge  ...\n What makes a proper backup, then?  That&#39;s a whole topic on its own, but you should start with:\n Complete: Don&#39;t just backup the database - if the user uploads files, those should be backed up as well.\n  Retained: You&#39;ll want to keep your backups around for a while, though you might want to set up a schedule for longer-retained backups.  (i.e. Daily backups retained for 30 days, weekly backups retained for 3 months, monthly backups retained for 1 year.)\n Secure: Your backups should be kept with the same level of security as your data.  If your data is encrypted at rest, your backups should be as well.  Make sure to keep your encryption keys secure.  If you lose those keys, you lose the backup.\n Tested: A backup that hasn&#39;t been tested  is not a backup.  You don&#39;t want to find out that your backup process doesn&#39;t work (or stopped working) when you need to restore critical data.  There should be an automated test process that runs after backups are created.\n If you&#39;re lucky, your hosting platform will offer some level of database backup as a service, which will save you a lot of time and effort setting up.  It likely won&#39;t cover 100% of your needs, but it will get you a lot closer than starting from scratch.\n  Okay!  That&#39;ll get you off the ground, but once you start seeing any success at all, you&#39;re going to start wanting something a little more... robust.  Eventually, manually editing the database is going to get tedious (not to mention dangerous), and users will start asking the same questions over and over.  You&#39;re going to have to slow down on development related to your core business and implement a bunch more supporting features.\n  You can edit and delete users directly from the database, sure, but all it takes is one time forgetting to add a  WHERE or  LIMIT clause to a statement to make you long for a proper administration console.  (And backups.  You set up backups, right?)\n An admin console is also a great place for dashboards, user statistics, summaries, metrics, etc.  Your admin console can become your one-stop-shop for running your SaaS.\n  Documentation can serve multiple purposes.  Primarily, it&#39;s for user education, but conveniently, this is user education you don&#39;t have to do manually.  Think about it like automated customer support - a user that answer their question from your documentation is a user that doesn&#39;t email you.\n If your documentation is publicly available, it can also help users make purchasing decisions.  By answering questions about your service openly and up-front, you can let users more-easily determine if your service will work for them, as well as reassure them about your transparency.\n Public documentation also helps with SEO, since your keywords will likely naturally come up frequently on your documentation pages.\n  Once you have a sufficient number or sufficiently large customers, you&#39;ll likely start getting requests around tax time for their billing history.  Your payment system will keep track of payments for you, and many of them will be able to generate invoices from their web interface that you can send to customers who request it.\n That might hold you for a while, but eventually, you&#39;ll want this functionality built into your system, so clients can self-serve, and your customer support team can focus on more-important issues.\n  Making the right decisions early on and as your service grows can have compounding benefits, but frequently, it&#39;s difficult to find time to devote to tasks that aren&#39;t seen as critical.  Still, if you can make the time to invest in them, it can pay off for you and your users as well.\n  Especially now, when people are trying to cut costs in both their lives and businesses, the ability to  pause a subscription instead of  cancel it outright can mean the difference between saving a customer and losing them.  Similarly, the ability to credit customers some free time or usage on your service can aid in retention, especially if something goes wrong and you want to make it up to them.\n  When displaying publicly-visible auto-incrementing IDs (such as user IDs), it can be a good idea to obfuscate what that number actually is.  This prevents competitors and skittish customers from identifying how much usage your service has seen so far.  A great library for this is  Hashids, which has many compatible implementations across many languages.\n  The fewer languages your app uses, the less common code that you&#39;ll have to duplicate between the various services and projects you require. Some are going to be unavoidable, such as JavaScript if you have a web app with any serious browser interactions, Swift for iOS, and Java/Kotlin for Android. Web apps, however, offer a truly terrifying number of languages you can choose for server code: PHP, Ruby, JavaScript, Typescript, Go, Rust, Java,  ...\n In extreme situations, you can limit yourself to just one language, even across multiple disparate platforms.  JavaScript can do front-end and back-end web development, desktop development through Electron, and mobile development through Cordova.  There are definite trade-offs for going this route, but for a smaller studio, this opens up a multi-platform strategy on a limited budget.\n  Linters like  ESLint,  RuboCop, and  Flake8 can make a  marked improvement in your code.  They can catch stylistic errors long before they make it into production, and many stylistic errors are really just shortcomings of your chosen language, where hard-to-find bugs breed and propagate.\n  Monorepos are  great!  They&#39;re especially great if you&#39;re just starting your SaaS, as they&#39;re far simpler than trying to work with multiple repositories when managing dependencies, figuring out code re-use, and ensuring that all the correct code is committed before deploys go out.\n Everyone&#39;s situation is different, of course, and it may make sense in your case to go with multiple repositories, or even one day switch to such a strategy, but when you&#39;re starting out, you want to limit the complexity of your project as much as you can, and the monorepo strategy will definitely pay off in this regard.\n  Being able to log in as your users from your Admin Console can help immensely when trying to sort out customer service issues. Instead of having several back-and-forth &#34;what do you see now?&#34; emails, you can just log in as them and find out. There are a lot of things to consider when writing a user impersonation feature, however: Do you require special access to impersonate users? Do you require the user&#39;s permission to impersonate  ...\n These aren&#39;t the only considerations, but ideally it&#39;s enough to make the point that there&#39;s a lot more to user impersonation than simply changing a token ID.\n  Once you start getting enough customers with sufficient expectations, you&#39;ll have to make modifications to your deploy process for increased reliability and flexibility:\n Updating in-place won&#39;t work forever.  Eventually, switching to  blue/green deploys or even something as simple as displaying a maintenance mode page while you update will be necessary to keep people from interacting with the system while performing significant changes.\n If you have a complex  SPA, you&#39;ll want to be able to inform users when you&#39;ve made an update that requires reloading that code.  Tracking version numbers both in your UI code and on the server will allow you to pop up a notification, allowing the user to save their work and then reload.\n Ideally, you should be using a  bug  tracking  service.  If you also send your  source maps to them when performing a deploy, they can provide even better error messages when UI errors occur.\n Serving your UI JavaScript from your server is simple and easy, but users appreciate  fast, and your job is to do the hard work so that users have a good time.  A relatively easy way to speed up your user&#39;s experience is to upload your UI JavaScript on release to a  CDN.  This is a one-time change you need to make that pays dividends for your users going forwards.\n You&#39;ll likely be manually checking that releases go as expected, but automated smoke tests that run on every deploy are a better way to catch issues that might otherwise slip by you when you&#39;re tired, distracted, or in a hurry.\n  If you don&#39;t want to start from an empty folder and write all this code yourself, you should consider using a SaaS starter kit, and it just so happens that you&#39;re reading the blog for one right now!  With Nodewood, you can get started writing business logic today, saving weeks or even months of development time.\n Nodewood starts you off with a full working web app, with a Vue front-end and Express back-end, built entirely from JavaScript.  Form validation, testing, user authentication and management, subscription/billing are all built-in, alongside a sleek and customizable application theme with an easy-to-extend admin console.", "posttime": "2020-05-03 04:19:37", "tags": "代码,saas,code,users", "title": "启动SaaS需要编写的代码列表", "title_en": "The List of Code You Need to Write to Start a SaaS", "transed": 1, "url": "https://nodewood.com/blog/the-huge-list-of-code-you-need-to-write-to-start-a-saas/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["代码", "saas", "code", "users"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000406, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这篇为“圣地亚哥法律评论”研讨会撰写的短文中，丹尼尔·索洛夫(Daniel Solove)教授研究了“没有什么可隐瞒”的论点。当被问及政府监控和数据挖掘时，许多人的回答是：我没有什么可隐瞒的。根据“没什么可隐藏”的论点，除非政府发现非法活动，否则隐私不会受到威胁，在这种情况下，一个人没有正当理由声称它是私人的。没什么好说的..。\n索洛夫，丹尼尔·J，我没有什么可隐瞒的，也没有其他对隐私的误解。“圣地亚哥法律评论”，第44卷，第745页，2007年；华盛顿大学法学院公法研究论文第289号。可在srn：https://ssrn.com/abstract=998565上获得。", "note_en": "In this short essay, written for a symposium in the San Diego Law Review, Professor Daniel Solove examines the nothing to hide argument. When asked about government surveillance and data mining, many people respond by declaring: &#34;I&#39;ve got nothing to hide.&#34; According to the nothing to hide argument, there is no threat to privacy unless the government uncovers unlawful activity, in which case a person has no legitimate justification to claim that it remain private. The nothing to  ...\n           Solove, Daniel J., &#39;I&#39;ve Got Nothing to Hide&#39; and Other Misunderstandings of Privacy. San Diego Law Review, Vol. 44, p. 745, 2007; GWU Law School Public Law Research Paper No. 289. Available at SSRN:  https://ssrn.com/abstract=998565", "posttime": "2020-05-03 04:19:26", "tags": "没什么,hide,law", "title": "“我没什么好隐瞒的”和其他对隐私的误解(2007)", "title_en": "'I've Got Nothing to Hide' and Other Misunderstandings of Privacy (2007)", "transed": 1, "url": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=998565&", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["没什么", "hide", "law"]}, {"category": "", "categoryclass": "", "imagename": "5db30ed4131a273bbb8e928a119566b5.jpg", "infoid": 1000405, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在最近的一次AWS成本优化问答中，Corey Quinn谈到了他使用DynamoDB的实验：\n我在迪纳摩潜水的深度比我预想的要深。令人惊讶的是，这真是太棒了。我对数据库了解不多，但我正在看它，现在我在想：“迪纳摩太棒了，我能把它误用成什么呢？”S3是我最喜欢的消息队列，路由53是我最喜欢的数据库，但我不能完全确定到目前为止发生了什么。至于其他创造性的用途，我可以滥用的东西。也许使用迪纳摩作为一种计算机服务-我打赌我可以教它下棋。\nDynamoDB是亚马逊托管的NoSQL服务-基本上是一个数据库。它是用于保存大量非结构化数据的键值存储。我们在工作中使用DynamoDB来存储数据，所以我对使用它略知一二，而且我喜欢采纳糟糕透顶的好主意，并将它们拨到11。\n当你学习编程时，一项常见的任务是构建计算器：加法、减法、乘法和除法。这将是测试Amazon最不受欢迎的计算平台的好方法-我们可以在DynamoDB之上构建计算器吗？事实证明我们可以做到，这就是我在这篇文章中要经历的。(将这个实验扩展到国际象棋，留给读者作为练习。)。\n为了避免怀疑：这是一个坏主意™。请勿在生产中使用此代码，也不要在生产环境的十英里半径内使用此代码。这是一篇讽刺文章，不是严肃的节目。\nDynamoDB支持多种编程语言，包括Java、.NET和Python。我将在这篇文章中使用Python，因为这是我所熟悉的，但是这些想法也可以在其他语言中使用。\n在DynamoDB中，我们所有的计算都在Table中运行。在表中，操作在行内运行。让我们编写一些代码来为我们创建表，并分配可以用来跟踪单个计算的行ID：\n导入contextlib导入UUID导入boto3 DynamoDB=boto3。资源(&#34；DynamoDB&#34；)类DynamoCalculator：&#34；&#34；&#34；使用DynamoDB进行计算的整数计算器。&#34；&#34；&#34；def__enter__(Self)：table_name=f&#34；计算器-{uuid.uuid4()}&#34；DynamoDB。CREATE_TABLE(AttributeDefinitions=[{&#34；AttributeName&#34；：&#34；Calculation_id&#34；，&#34；：&#34；S&#34；，}]，TableName=TABLE_NAME，KeySchema=[{&#34；AttributeName&#34；：&#34；Calculation_id&#34；.。\n上下文管理器为我们处理创建和清理-它不仅为我们创建表，还会在之后删除它。在您可以进行第一次计算之前，这确实会造成一些延迟，但这意味着我们的帐户中没有闲置的表。\n记住：云的昂贵部分不是您使用的，而是您忘记关闭的部分。此API确保我们永远不会忘记关闭我们的表！\n重要提示：如果您创建的资源具有应该始终运行的清理，则上下文管理器是在Python API中强制执行此操作的好方法。例如套接字或文件，您应该在完成后始终关闭它们。\n在其他语言中，您可以使用Try…。除了…。最后，但是调用者必须记得做清理。Python使用WITH语句向调用者隐藏这种复杂性。您可能已经使用过一个-使用OPEN(…)。，它总是在您使用完文件后将其关闭，无论您的代码返回还是抛出异常。\n如果您不使用它们，它们是一个强大的功能，值得学习。\nDynamoDB支持将数字作为一级类型，我们可以分别使用GetItem和PutItem API读取和写入数字值。PutItem API完全替换了行的内容，这在某些情况下很有用并且易于批处理，但它并不总是适合这项工作的工具。\n假设我们使用DynamoDB来存储计数器。我们希望递增计数器的值，但不从表中读取现有值-如果另一个进程在读取和写入之间更新计数器，我们将丢失数据。为此，我们可以使用UpdateItem API，它可以根据行的现有值修改行。\n类发电机计算器：.。def add(self，x：int，y：int)-&gt；int：&#34；&#34；&#34；将两个整数相加并返回结果。&#34；&#34；&#34；&#34；与自己。row_id()AS CALCULATION_ID：Self。桌子。put_item(Item={&#34；Calculation_id&#34；：Calculation_id，&#34；sum&#34；：x})自身。桌子。UPDATE_ITEM(Key={&#34；Calculation_id&#34；：Calculation_id}，UpdateExpression=&#34；Set#sum=#sum+：Y&#34；，ExpressionAttributeNames={&#34；#sum&#34；：&#34；sum&#34；}，ExpressionAttributeValues.。\n在这里，我们使用PutItem将第一个数字(X)写入到表中。然后，我们执行一个UpdateItem，将第二个数字(Y)添加到现有值中。最后，我们调用GetItem来检索总和。\n事实证明，我们可以将这三个API调用合并为一个。UpdateItem API c", "note_en": "On a recent  AWS Cost Optimisation Q&amp;A, Corey Quinn talked about his experiments with  DynamoDB:\n  I’ve been diving deeper into Dynamo than I would expect. It’s surprisingly awesome. I don’t know much about databases, but I’m looking at it, and now I’m wondering:  “Dynamo’s awesome, what can I misuse it as?” S3 is my favourite message queue, Route 53 is my favourite database, but I’m not entirely sure what’s going on as far. As far as other creative uses, the things I could misuse. Maybe using Dynamo as a compute service – I bet I can teach that thing to place chess.\n  DynamoDB is Amazon’s hosted NoSQL service – basically, a database. It’s a key-value store for holding large amounts of unstructured data. We use DynamoDB for data storage at work, so I know a bit about using it, and I love taking  terrible brilliant ideas and dialling them up to 11.\n  When you’re learning to program, a common task is building a calculator: addition, subtraction, multiplication and division.  This would be a good way to test Amazon’s least-loved compute platform – can we build a calculator on top of DynamoDB? It turns out we can, and that’s what I’m going to walk through in this post. (Extending this experiment to play chess is left as an exercise for the reader.)\n  For the avoidance of doubt: this is a Bad Idea™. Do not use this code in production, or within a ten-mile radius of a production environment. This is a satire post, not serious programming.\n       DynamoDB supports a wide variety of programming languages, including  Java,  .NET and  Python. I’m going to use Python in this post, because that’s what I’m familiar with, but these ideas can be used in other languages.\n  Within DynamoDB, we run all our computing inside  Table. Within a table, operations run within  Rows. Let’s write some code to create a table for us, and to assign a row ID that we can use to track an individual calculation:\n  import  contextlib import  uuid import  boto3 dynamodb  =  boto3 . resource ( &#34;dynamodb&#34; ) class  DynamoCalculator :  &#34;&#34;&#34; An integer calculator that uses DynamoDB for compute. &#34;&#34;&#34;  def  __enter__ ( self ):  table_name  =  f &#34;calculator-{uuid.uuid4()}&#34;  dynamodb . create_table (  AttributeDefinitions = [{  &#34;AttributeName&#34; :  &#34;calculation_id&#34; ,  &#34;AttributeType&#34; :  &#34;S&#34; ,  }],  TableName = table_name ,  KeySchema = [{  &#34;AttributeName&#34; :  &#34;calculation_id&#34;  ...\n  The context manager handles creation  and cleanup for us – not only does it create a table for us, it deletes it afterwards. This does create a bit of latency before you can do your first calculation, but it means we don’t have tables hanging around in our account.\n  Remember: the expensive part of the cloud isn’t what you use, it’s what you forget to turn off. This API ensures that we’ll never forget to turn off our table!\n  Serious point:  if you create resources that have cleanup that should always run, context managers are a great way to enforce this in a Python API. Examples are sockets or files, which you should always close when you’re done.\n  In other languages, you use  try … except … finally, but the caller has to remember to do the cleanup. Python has the  with statement to hide this complexity from the caller. You’ve probably used one already –  with open(…), which always closes the file once you’re done using it, whether your code returned or threw an exception.\n  If you’re not using them, they’re a powerful feature and worth learning.\n    DynamoDB supports numbers as a first-class type, and we can read and write numeric values with the GetItem and PutItem APIs, respectively. The PutItem API completely replaces the contents of a row, which is useful in some cases and easy to batch, but it’s not always the right tool for the job.\n  Suppose we were using DynamoDB to store a counter. We want to increment the value of the counter, but without reading the existing value from the table – if another process updated the counter between the read and the write, we’d lose data. For this, we can use the UpdateItem API, which can modify a row based on its existing values.\n    class  DynamoCalculator :  ...  def  add ( self ,  x :  int ,  y :  int )  -&gt;  int :  &#34;&#34;&#34; Adds two integers and returns the result. &#34;&#34;&#34;  with  self . row_id ()  as  calculation_id :  self . table . put_item (  Item = { &#34;calculation_id&#34; :  calculation_id ,  &#34;sum&#34; :  x }  )  self . table . update_item (  Key = { &#34;calculation_id&#34; :  calculation_id },  UpdateExpression = &#34;SET #sum = #sum + :y&#34; ,  ExpressionAttributeNames = { &#34;#sum&#34; :  &#34;sum&#34; },  ExpressionAttributeValues  ...\n  Here we use PutItem to write the first number ( x) to the table. Then we do an UpdateItem to add the second number ( y) to the existing value. Finally, we call GetItem to retrieve the sum.\n  It turns out we can consolidate these three API calls into one. The UpdateItem API creates a row if it doesn’t exist yet (saving the PutItem), and we can also ask it to give us the value it just wrote to the row (saving the GetItem). Here’s what the consolidated version looks like:\n  class  DynamoCalculator :  ...  def  add ( self ,  x :  int ,  y :  int )  -&gt;  int :  &#34;&#34;&#34; Adds two integers and returns the result. &#34;&#34;&#34;  with  self . row_id ()  as  calculation_id :  resp  =  self . table . update_item (  Key = { &#34;calculation_id&#34; :  calculation_id },  UpdateExpression = &#34;SET #sum = :x + :y&#34; ,  ExpressionAttributeNames = { &#34;#sum&#34; :  &#34;sum&#34; },  ExpressionAttributeValues = { &#34;:x&#34; :  x ,  &#34;:y&#34; :  y },  ReturnValues = &#34;ALL_NEW&#34;  )  return  ...\n    with  DynamoCalculator ()  as  calculator :  print ( calculator . add ( 1 ,  2 ))  # 3  print ( calculator . add ( 5 ,  3 ))  # 8  print ( calculator . add ( 5 ,  - 1 ))  # 4\n  Addition is a very common operation, so it’s important we make it as fast as possible. Consolidating three API calls into one is a good optimisation!\n    Subtraction is the opposite of addition, with the convenient property that subtracting  y is the same as adding (negative  y). This leads some people to define subtraction like so:\n  def  subtract ( self ,  x :  int ,  y :  int )  -&gt;  int :  &#34;&#34;&#34; Subtracts one integer from another and returns the result. &#34;&#34;&#34;  return  self . add ( x ,  - y )\n  But you and I know these people are feeble and weak-willed. This approach uses Python to reverse the sign of  y for us, which is a computational operation. What’s the point of having a compute platform like DynamoDB if we don’t use it for computing?\n  DynamoDB’s UpdateItem API supports subtraction as well as addition, which is a much better approach:\n  class  DynamoCalculator :  ...  def  subtract ( self ,  x :  int ,  y :  int )  -&gt;  int :  &#34;&#34;&#34; Subtracts one integer from another and returns the result. &#34;&#34;&#34;  with  self . row_id ()  as  calculation_id :  resp  =  self . table . update_item (  Key = { &#34;calculation_id&#34; :  calculation_id },  UpdateExpression = &#34;SET #difference = :x - :y&#34; ,  ExpressionAttributeNames = { &#34;#difference&#34; :  &#34;difference&#34; },  ExpressionAttributeValues = { &#34;:x&#34;\n      This is where things get a bit trickier – the UpdateExpression used by the UpdateItem API doesn’t support multiplication, only addition and subtraction. We’ll have to build our own implementation of multiplication. A simple approach is to use a recursive algorithm:\n  def multiply(x, y): if y == 0: return 0 else: return x + multiply(x, y - 1)\n    multiply(5, 3) = 5 + multiply(5, 2) = 5 + (5 + multiply(5, 1)) = 5 + (5 + (5 + multiply(5, 0))) = 5 + (5 + (5 + 0)) = 15\n    If we want to implement this, we need a test for equality, and branching statements. How do we do that? We could use Python, or we could find a way to do them with DynamoDB. We both know what the correct answer is.\n  Let’s start by testing if two integers are the same. For this, we can misuse  conditional operations.\n  Suppose we were using DynamoDB to store date-based information. Each row includes a timestamp, and we want newer data to replace older data, but not the other way around. We could do a GetItem and then a PutItem before we write anything, but if the row changes between the Get and the Put, we could write bad data.\n  A better approach would be to supply a condition with our PutItem – for example,  “only update this row if the timestamp in the new row is greater than the timestamp in the already-stored row”. If the condition is true, the write succeeds. If the condition is false, the write fails and we get an error.\n  One of the conditions you can specify is that two values are the same. So let’s try to write to the table with this condition – if it succeeds, the numbers are equal; if it fails, they’re not.\n  class  DynamoCalculator :  ...  def  eq ( self ,  x :  int ,  y :  int )  -&gt;  bool :  &#34;&#34;&#34; Returns True if two integers are equal, False otherwise. &#34;&#34;&#34;  with  self . row_id ()  as  calculation_id :  try :  self . table . put_item (  Item = { &#34;calculation_id&#34; :  calculation_id },  ConditionExpression = &#34;:x = :y&#34; ,  ExpressionAttributeValues = { &#34;:x&#34; :  x ,  &#34;:y&#34; :  y },  )  except  Exception  as  exc :  return  False  else :  return  ...\n  (We are using a bit of Python control flow for the  try … except block – I can’t think of a better way to do this, but at least the equality testing is done inside DynamoDB.)\n  Next, let’s use DynamoDB to implement basic control flow. For an IF statement, we have a condition, an “if true” action, and an “if false” action. We can continue to misuse conditional operations, and pass the boolean directly to DynamoDB:\n  from  typing  import  Callable class  DynamoCalculator :  ...  def  if_ (  self ,  condition :  bool ,  if_true :  Callable [[],  int ],  if_false :  Callable [[],  int ]  )  -&gt;  bool :  &#34;&#34;&#34; If ``condition`` is True, returns the output of ``if_true``. If ``condition`` is False, returns the output of ``if_false``. &#34;&#34;&#34;  with  self . row_id ()  as  calculation_id :  try :  self . table . put_item (  Item = { &#34;calculation_id&#34; :  calculation_id  ...\n  Notice that this code doesn’t call “if_true” or “if_false” until they’re needed. This is a sophisticated programming technique called   lazy evaluation, and our ability to use it here speaks to the power of DynamoDB as a computing platform.\n    class  DynamoCalculator :  ...  def  multiply ( self ,  x :  int ,  y :  int )  -&gt;  int :  &#34;&#34;&#34; Multiplies two integers and returns the result. &#34;&#34;&#34;  def  if_y_non_zero ():  return  self . add ( x ,  self . multiply ( x ,  self . subtract ( y ,  1 )))  return  self . if_ (  self . eq ( y ,  0 ),  if_true = lambda :  0 ,  if_false = if_y_non_zero  )\n  This works if  y is positive or zero, but if  y is negative it keeps decrementing forever. We need to tweak our algorithm slightly:\n  def multiply(x, y): if y == 0: return 0 elif y &lt; 0: return -1 * multiply(x, -y) else: return x + multiply(x, y - 1)\n  We can get  -y by computing  0 - y, and similar for  -1 * multiply(x, -y). This leaves the problem of working out if  y is negative.\n  DynamoDB supports all the logical operators in conditional updates, so we can follow the same technique we’ve already used twice:\n  class  DynamoCalculator :  ...  def  lt ( self ,  x :  int ,  y :  int )  -&gt;  int :  &#34;&#34;&#34; Returns True if x &lt; y, False otherwise. &#34;&#34;&#34;  with  self . row_id ()  as  calculation_id :  try :  self . table . put_item (  Item = { &#34;calculation_id&#34; :  calculation_id },  ConditionExpression = &#34;:x &lt; :y&#34; ,  ExpressionAttributeValues = { &#34;:x&#34; :  x ,  &#34;:y&#34; :  y },  )  except  Exception  as  exc :  return  False  else  ...\n  This gives us the last piece we need to create a fully working multiplication function:\n  class  DynamoCalculator :  ...  def  multiply ( self ,  x :  int ,  y :  int )  -&gt;  int :  &#34;&#34;&#34; Multiplies two integers and returns the result. &#34;&#34;&#34;  def  if_y_non_negative ():  return  self . add ( x ,  self . multiply ( x ,  self . subtract ( y ,  1 )))  def  if_y_negative ():  y_pos  =  self . subtract ( 0 ,  y )  return  self . subtract ( 0 ,  self . multiply ( x ,  y_pos ))  return  self . if_ (  self . eq ( y ,  0 ),  if_true = lambda :  0 ,  if_false = lambda  ...\n      def divide(x, y): if y &lt; 0: return -1 * divide(x, -y) else: if x &lt; y: return 0 else: return 1 + divide(x - y, y)\n    class  DynamoCalculator :  ...  def  divide ( self ,  x :  int ,  y :  int )  -&gt;  int :  &#34;&#34;&#34; Divides x by y and returns the result. Assumes y != 0. &#34;&#34;&#34;  def  if_y_negative ():  return  self . subtract ( 0 ,  self . divide ( x ,  self . subtract ( 0 ,  y )))  def  if_y_positive ():  return  self . if_ (  self . lt ( x ,  y ),  if_true = lambda :  0 ,  if_false = lambda :  self . add ( 1 ,  self . divide ( self . subtract ( x ,  y ),  y ))  )  return  self  ...\n  This is the great thing about building our calculator from a library of reusable functions and operators: we can combine them to create more sophisticated functions.\n    We can continue to compose the functions we’ve already written to round out our calculator.\n  We can get “not equal to” by defining a NOT operator, and applying that to the output of “eq()”:\n  def  not_ ( self ,  condition :  bool )  -&gt;  bool :  &#34;&#34;&#34; Returns the negation of ``condition``. &#34;&#34;&#34;  return  self . if_ (  condition ,  if_true = lambda :  False ,  if_false = lambda :  True  )  def  ne ( self ,  x :  int ,  y :  int )  -&gt;  bool :  &#34;&#34;&#34; Returns True if two integers are different, False otherwise. &#34;&#34;&#34;  return  self . not_ ( self . eq ( x ,  y ))\n  We can define “less than or equal to” by defining an OR operator, and applying that to the output of “lt()” and “eq()”:\n  def  or_ ( self ,  condition1 :  bool ,  condition2 :  bool )  -&gt;  bool :  &#34;&#34;&#34; Returns True if at least one of ``condition1`` and ``condition2`` is True. &#34;&#34;&#34;  int_1  =  self . if_ ( condition1 ,  if_true = lambda :  1 ,  if_false = lambda :  0 )  int_2  =  self . if_ ( condition2 ,  if_true = lambda :  1 ,  if_false = lambda :  0 )  return  self . ne ( self . add ( int_1 ,  int_2 ),  0 )  def  le ( self ,  x :  int ,  y :  int )  -&gt;  ...\n  We can define “greater than” and “greater than or equal to” as the negation of “less than or equal to” and “less than”, respectively:\n  def  gt ( self ,  x :  int ,  y :  int )  -&gt;  bool :  &#34;&#34;&#34; Returns True if x &gt; y, False otherwise. &#34;&#34;&#34;  return  self . not_ ( self . le ( x ,  y ))  def  ge ( self ,  x :  int ,  y :  int )  -&gt;  bool :  &#34;&#34;&#34; Returns True if x &gt;= y, False otherwise. &#34;&#34;&#34;  return  self . not_ ( self . lt ( x ,  y ))\n  And finally, for completion’s sake, let’s define an AND operator and a NAND operator:\n  def  and_ ( self ,  condition1 :  bool ,  condition2 :  bool )  -&gt;  bool :  &#34;&#34;&#34; Returns True if both ``condition1`` and ``condition2`` are True. &#34;&#34;&#34;  int_1  =  self . if_ ( condition1 ,  if_true = lambda :  1 ,  if_false = lambda :  0 )  int_2  =  self . if_ ( condition2 ,  if_true = lambda :  1 ,  if_false = lambda :  0 )  return  self . eq ( self . add ( int_1 ,  int_2 ),  2 )  def  nand ( self ,  condition1 :  bool  ...\n  The  NAND gate is a key part of processor design, and being able to do it only using DynamoDB proves its capabaility as a computing platform.\n    This post shows the potential for using DynamoDB as a cloud computing platform. We were able to implement a simple calculator, comparison operators, and even better, a set of  logical gates (AND, OR, NOT and NAND). This lays the foundation for building far more sophisticated programs.\n  Performance remains an issue. As we ’d expect, simple operations (addition, subtraction) are faster than more complex operations (multiplication, division), but there ’s room for improvement in both areas. It ’s not clear whether the bottleneck is DynamoDB itself, or my home internet connection. Hopefully a future update will bring the ability to run code directly  ...\n  Pricing follows the usual AWS model of “clear as mud”. DynamoDB pricing is based on  how many read and write “units” you use, but it’s not obvious how many units a given operation might require.\n  It’s too soon to recommend using DynamoDB for production compute workloads, but these early signs are promising. I hope Amazon continues to work on improving DynamoDB, and I look forward to seeing how other people use it in future.\n        DynamoDB isn’t a compute platform, it’s a database. Still not a question. And you’re wrong – it  is a compute platform, as this experiment shows.\n  Why did you do this? Finally, a proper question! Partly for fun, partly as a way to get some practice with the gnarly bits of the DynamoDB API that I forget every time I use.\n  Can I get all the code you’ve written? Sure, it’s all here:\n      #!/usr/bin/env python &#34;&#34;&#34;What happens if you try to use DynamoDB as an integer calculator?&#34;&#34;&#34; import  contextlib from  typing  import  Callable import  uuid import  boto3 dynamodb  =  boto3 . resource ( &#34;dynamodb&#34; ) class  DynamoCalculator :  &#34;&#34;&#34; An integer calculator that uses DynamoDB for compute. &#34;&#34;&#34;  def  __enter__  ...", "posttime": "2020-05-03 04:19:22", "tags": "dynamodb", "title": "使用DynamoDB作为计算器", "title_en": "Using DynamoDB as a Calculator", "transed": 1, "url": "https://alexwlchan.net/2020/04/using-dynamodb-as-a-calculator/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["dynamodb"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000404, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "消除冗余通常被视为提高生产效率和减少浪费的一种方式。但是，正确的冗余可以极大地提高质量。例如，中世纪发明的复式簿记是会计的一大进步，因为它引入了冗余，几乎消除了常见的算术错误。\n良好的冗余通过具有通往相同结果的两个独立路径来检测故障。一条路径中的故障不会影响另一条路径，因此结果中的差异表明存在错误。\n不良冗余的区别在于要么不提供可检查的结果，要么冗余路径相互依赖，使得一条路径中的错误传播到另一条路径，因此错误的结果是一致的。\n编程语言广泛使用它来减少编码错误。如果一种语言完全没有冗余，那么任何随机的字符序列都是有效的程序。编译器生成的每条错误消息都是查找用户错误的语言中的冗余示例。几乎没有冗余的语言的一个例子是机器代码-几乎任何位模式都是有效的操作码。任何为机器代码编写过反汇编程序的人都知道这几乎是不可能的……。\n变量声明就是其中之一。但是，由于编译器可以根据上下文计算出声明的需要，所以声明似乎是可以丢弃的主要冗余。这称为隐式变量声明。这听起来是个好主意，而且它经常被载入新的语言中。问题是，编译器无法区分预期的新声明和打字错误-维护不善的程序员也无法区分。不过，过了一段时间，那个..。\n为什么需要分号？编译器完全有能力弄清楚这一点。但是，如果是这样的话呢：\n这可以是(x=3+y*p++)，其中*是乘法而不是间接的。缺少分号也会使错误恢复变得很差，因为编译器无法计算出当前错误语句的结束位置和下一个错误语句的开始位置。分号在文本中形成漂亮的“锚”，帮助编译器和阅读器与代码结构同步。\n(JavaScript是一个示例，其中分号是可选的，并且是从语法中推断出来的。Python不是一个示例，因为它仍然使用像\\n这样的词法提示来指示语句的结束。)。\n编程语言中冗余的最佳示例可能是单元测试。单元测试是函数功能的另一种规范，但它们指定的不是方法，而是结果。在结果中重现的方法中出现相同错误的几率非常、非常低。这意味着即使只适度使用单元测试也可以显著提高程序质量，这就是D编程语言内置单元测试支持的原因。\n冗余并不总是好的。例如，在C语言中，源代码分为头文件和实现文件。声明在这两个版本中都有转载。这种冗余的问题在于，副本是字面上复制的文本-其中一个中的错误被简单地复制到另一个中，没有赋予冗余任何价值。有用的冗余需要是独立的。\n乍一看，这看起来是一个很好的冗余。它正在检查tmp的类型是否为int。但是不，它没有检查类型，它强制类型为int，并将初始化式(a+b)转换为int。如果a和b被重新声明为某个其他类型(如无符号或浮点型)，这可能会导致问题。为了解决这个问题，D编程语言引入了auto，将tmp声明为(a+b)类型：\n一种常见的情况是C++中声明和表达式之间的语法歧义。例如：\n这是将P声明为指向T的指针，还是将T和P相乘？在这里，少量的冗余将会有很大的帮助。\n在C++中，重载使用&lt；和&gt；来表示模板参数列表。什么功能：\n刻薄？这种缺乏冗余性的后果是出了名的迟钝错误消息，因为编译器没有太多的信息来指导它猜测用户的意图。\nC++添加了一些关键字，如typeName，以及一些产品，如-&gt；template，以增加冗余，从而改进错误检查和诊断。\n通过查看编译器实现者倾向于随着时间的推移添加的警告诊断，您可以感觉到语言中缺少冗余的地方。对于新语言的设计者来说，常见的警告是改进灵感的丰富来源。\n许多编程语言设计者错误地认为消除冗余可以提高程序员的工作效率。这一点通过小的基准来展示，表明它们是多么简洁，暗示简洁使一种语言变得强大和富有表现力。这对于小程序确实很有效，比如只有几个脚本", "note_en": "Eliminating redundancy is often viewed as a way to streamline\rproductivity and reduce waste. But the right kind of redundancy\rcan dramatically improve quality. For example,\r double entry bookkeeping,\rinvented in the middle ages, was a great advance\rin accounting because it introduced a redundancy that nearly eliminated\rcommon arithmetic errors.\n    A good redundancy detects faults by having two independent\rpaths to the same result. A failure in one path does not affect the other,\rso the discrepancy in result indicates an error.\n  A bad redundancy is distinguished by either not providing a checkable\rresult, or by having the redundant paths dependent on each other in\rsuch a way that an error in one path propagates to the other, so the wrong\rresults agree.\n  Programming languages extensively use this to reduce coding errors. If there was no redundancy at all in a language, then any random sequence of characters would be a valid program. Every error message generated by the compiler is an example of redundancy in the language that finds user errors. An example of a language with next to no redundancy is machine code —nearly any bit pattern is a valid opcode. Anyone who ’s written a disassembler for machine code knows that it ’s nearly impossible  ...\n    Variable declarations are one. But since the compiler can figure the need for declarations from the context, declarations seem like prime redundancies that can be jettisoned. This is called implicit variable declaration. It sounds like a great idea, and it gets regularly enshrined into new languages. The problem is, the compiler cannot tell the difference between an intended new declaration and a typo —and the poor maintenance programmer can ’t tell, either. After a while, though, the  ...\n      why would semicolons be needed? The compiler is perfectly capable of figuring\rthat out. But what about:\n    that could be  (x = 3 + y * p++) where the  * is a multiply rather than an\rindirection. Lack of semicolons also makes error recovery poor, as the\rcompiler cannot figure out where the current wrong statement ends and the\rnext one starts. Semicolons make for nice “anchors” in the text that help\rboth the compiler and the reader synchronize with the code structure.\n  (Javascript is an example where the semicolon is optional and is inferred\rfrom the grammar. Python is not an example, because it still uses lexical\rcues like  \\n to indicate the end of a statement.)\n  Probably the best example of redundancy in a programming language is\runit tests. Unit tests are an alternative specification for what a function\rdoes, but rather than specify the method, they specify the results.\rThe odds of the same error in the method being reproduced in the results\rare very, very low. This means that even only moderate use of\runit tests can dramatically improve program quality, which is why\runit test support is built in to the D programming language.\n    Redundancy isn’t always good. In C, for example, source code is divided\rup into header files and implementation files. The declarations are reproduced\rin both. The problem with this redundancy is that the copies are literally\rcopied text — an error in one is simply copied to the other, giving no\rvalue to the redundancy. A useful redundancy needs to be independent.\n      At first glance, this looks like a good redundancy. It’s checking that the\rtype of  tmp is  int. But no, it isn’t checking the type, it’s forcing\rthe type to be  int, and converting the initializer  (a+b) to be  int.\rThis can result in problems if  a and  b are redeclared as some other type,\rlike  unsigned or  float. To\rsolve this problem, the D programming language has introduced  auto to\rhave  tmp declared as the type of  (a+b):\n        A common case is the syntactic ambiguity between declarations and expressions\rin C++. For example:\n    Is that a declaration of  P as a pointer to  T, or is it multiplying  T and  P?\rA little redundancy would go a long way here.\n  There’s the overloaded use of  &lt; and  &gt; to denote template argument lists in C++.\rWhat does:\n    mean? The consequence of this lack of redundancy is notoriously obtuse error\rmessages as the compiler has too little to guide it in guessing at what\rthe user’s intent is.\n  C++ has added some keywords, like  typename, and some productions, like\r -&gt;template, to add redundancy and so improve\rerror checking and diagnostics.\n  You can get a feel for where redundancy in a language is lacking by looking\rat warning diagnostics the compiler implementors tend to add over time.\rFor the designer of a new language, common warnings are a rich source of\rinspiration for improvements.\n    Many programming language designers mistakenly assume that removing redundancy makes programmers more productive. This is exhibited with small benchmarks showing how terse they are, with the implication that terseness makes a language powerful and expressive. And this does work great for small programs, such as scripts that are only a few lines long. But it doesn ’t scale well, and this rapidly becomes apparent as the source code gets larger and  ...\n  Well—designed redundancy can, however, dramatically improve productivity\rwith its ability to uncover errors early in the development process.\rRedundancy not only helps find errors, it helps produce better error\rmessages, and helps the maintenance programmer in understanding the intent\rof the code.\n  The trick, of course, is figuring out which redundancies are good,\rand which aren’t.", "posttime": "2020-05-03 04:19:16", "tags": "编程,programming language,编程语言,programming,错误", "title": "编程语言中的冗余", "title_en": "Redundancy in Programming Languages", "transed": 1, "url": "https://www.digitalmars.com/articles/b05.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["编程", "language", "编程语言", "错误"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000403, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从一开始，Bluecore就运行在Google Cloud Platform(GCP)上。到了构建高性能服务的时候，我们自然而然地希望利用GCP基础设施，而不是自己构建它。通过使用Kubernetes(GKE)、Redis(MemoryStore)、BigTable和其他GCP技术，我们能够构建具有足够带宽和延迟的服务，每秒发送10000个个性化推荐。\n你很可能收到了一封电子邮件，引诱你购买你放在网上购物车里的一种产品，而且它可能还附带了一些其他推荐的产品。我们是怎么想出这些产品来推荐消费者的呢？在Bluecore，我们通过两种方式创建产品推荐：通过产品推荐或通过消费者行为推荐。例如，可以根据最近查看或以前购买的产品来推荐产品。Bluecore已经开发出强大的数据模型来计算.。\n将产品映射到用户并不是一个看起来那么简单的过程。我们评估有关可以在运行时将哪些产品插入电子邮件的规则。例如，不包括缺货或打折的产品。因为我们只展示有效的产品是很重要的，我们必须有一个最新的产品目录。对于任何一家给定的零售店，产品都是不断变化的。因此，使我们的产品保持最新需要其自身的服务。\n虽然电子邮件是我们的主要产品，但Bluecore也在零售商的网站上提供实时产品推荐，这带来了比电子邮件更严格的延迟限制。现场推荐迫使我们重新考虑我们的推荐基础设施。推荐服务的构建考虑到了Bluecore的工程价值之一，即构建“尽可能简单，尽可能强大”的东西。在推荐服务的整个发展过程中，我们已经……。\n制作一封电子邮件有三个组成部分：模板(电子邮件的设计大纲)、受众(将接收电子邮件的电子邮件地址列表)和推荐(我们掌握的每个收件人的数据科学模型派生的值)。模板在云数据存储中，我们的受众在BigQuery中生成，我们的推荐在数据存储中。电子邮件是在Google App Engine Standard(GAE)中生成的，我们按每封电子邮件查询云数据存储(有时.。\n好吧，不。正如我们之前提到的，我们现在支持当消费者在网站上时显示的推荐。这意味着延迟现在确实很重要。从仅限电子邮件到同时提供现场和电子邮件服务的转变迫使我们重新评估我们的架构。现场建议要求我们有更严格的SLO(300-400毫秒)。在网站开始感觉缓慢之前，这就是你得到的全部信息。在考虑到其他服务、网络和传输到.的情况下，建议获取只是加载时间的一部分。\n受众(电子邮件地址列表)生成和个性化(将地址与他们的推荐进行映射)是分开的，这意味着模板仅限于附加到受众查询行的数据。如果推荐类型在单个模板内进行个性化，则受众查询将无法管理。\n在新版本的推荐服务中，我们想要做五件基本的事情：\n考虑到我们的新目标，本着“尽可能简单，尽可能强大”的精神，让我们构建一个天真的服务实现。我们知道我们需要GRPC服务，我们的推荐数据来自BigQuery/Datastore，而我们的产品数据驻留在Datastore中。我们的推荐服务(用GO编写)支持运行时个性化，因为现在我们将产品和推荐数据提供给服务，并将推荐的产品提供给个性化……。\n数据存储非常昂贵，而且BigQuery无法满足我们的延迟要求。所以再说一次，不是。即使我们将所有建议导出到数据存储区，我们仍然无法达到延迟目标。不过没关系，我们不能责怪锤子是个坏螺丝刀，我们只是需要合适的工具！\n让我们把重点放在如何改进图表的“RECS”部分。建议被写入BigQuery或Google Cloud Storage(GCS)，然后一些被加载到数据存储中。相反，我们可以将来自BigQuery和GCS的所有推荐加载到BigTable中。BigQuery Storage API的发布使得从BigQuery中提取海量数据变得更快。我们固定的推荐模式使范围保持在可管理的范围内。\n在考虑提高性能时，很多时候答案是实现缓存。在我们的情况下，这不是一个好的解决方案，因为接收者的推荐数据在其无效之前很可能只被读取一次。缓存未命中意味着我们将从源读取，从而导致延迟、金钱或两者都要付出代价，就像我们在前面的系统图中所说的那样。然而，Bigtable在受到重创时表现良好。E", "note_en": "From the beginning, Bluecore has run on the  Google Cloud Platform (GCP). When it came time to build a high-performance service, it was only natural that we looked to leverage the GCP infrastructure, rather than building it ourselves. By using Kubernetes ( GKE),  Redis ( MemoryStore),  Bigtable, and other GCP technologies, we were able to build a service with sufficient bandwidth and latency to send 10,000s of personalized recommendations per second.\n  You ’ve most likely received an email tempting you to buy a product you left in your online shopping cart, and it probably also came with a few other recommended products. How did we come up with these products to recommend the consumer? At Bluecore, we create product recommendations in two ways: via a product or via the consumer ’s behavior. For example, a product may be recommended based on one that was recently viewed or previously purchased. Bluecore has developed powerful data models to calculate  ...\n  Mapping products to users is not as simple a process as it seems. We evaluate rules about which products we can insert into the email at runtime. For example, to exclude products that are out of stock or on discount. Since it is important that we only show valid products, we must have an up-to-date product catalog. Products change constantly for any given retail store. Therefore, keeping our products up-to-date requires a service of its own.\n Though email is our primary product, Bluecore also provides real-time product recommendations on retailer’s websites, which introduces much tighter latency bounds than email would otherwise require. Onsite recommendations forced us to rethink our recommendations infrastructure. The recommendations service was built with one of Bluecore’s engineering values in mind, to build things  “as simple as possible, as powerful as necessary.”Throughout the evolution of the recommendations service, we have  ...\n   Three components go into making an email: the template (design outline of the email), the audience (the list of email addresses that will receive an email), and the recommendations (the values derived from the data science models per recipient we have information on). The templates live in  Cloud Datastore, our audiences are generated in  BigQuery, and our recommendations are in Datastore. Emails are generated in  Google App Engine Standard(GAE), and we query Cloud Datastore as each email (sometimes  ...\n  Well, no. As we mentioned before, we now support recommendations shown while the consumer is on the website. This means latency does matter now. The shift from email-only to both on-site and email services forced us to re-evaluate our architecture. Onsite recommendations require that we have a much tighter SLO of 300 –400 ms. This is about all you get before a website starts to feel slow. Recommendation fetching is only part of the load time given that other services, network, and transit to  ...\n Audience (list of email addresses) generation and personalization (mapping an address with their recommendations) were separate, which means that templates were limited to data appended to the rows of the audience query. If the type of recommendation were personalized within a single template, the audience query would be unmanageable.\n  In the new version of the recommendation service we want to do five basic things:\n   With our new goals in mind, and in the spirit of being  “as simple as possible, as powerful as necessary,” let’s build a naive implementation of the service. We know we want a  gRPC service, our recommendations data comes from BigQuery/Datastore, and our product data lives in Datastore. Our recommendations service, written in  Go, supports runtime personalization because now we feed the products and recommendations data to a service and give those recommended products to the personalization  ...\n   Datastore is expensive and Bigquery can’t meet our latency requirements. So again, no. Even if we exported all of our recommendations to Datastore, we  still wouldn’t hit our latency goals. That’s okay though, we can’t blame a hammer for being a bad screwdriver, we just need the right tool!\n   Let’s focus on how we can improve the “recs” portion of our diagram. Recommendations were written to BigQuery or  Google Cloud Storage (GCS), then some were loaded into Datastore. Instead, we could load all of our recommendations from BigQuery and GCS into Bigtable. The release of the  BigQuery Storage API made pulling massive volumes of data from BigQuery fast. Our fixed schema for recommendations kept the scope manageable.\n    When thinking about improving performance, many times the answer is to implement caching. In our case, this isn ’t a good solution because a recipient ’s recommendations data is most likely only read once before it is invalidated. Cache-miss means that we would read from the source, costing us latency, money, or both as in our previous system diagram. Bigtable, however, performs well when hit hard. Even with only three instances handling 5,000 requests, per second, we saw latency of 15  ...\n  Although we improved our recommendation part of our pipeline, we are still lacking with products. Datastore is still burning a hole in our wallet, and we are still failing our on-site latency requirements.\n   Let’s talk about latency. Our products are ~2KB of data (they contain information about various attributes like green, shirt, short-sleeved, etc.). Datastore latencies are 46.5 ms + 4.2 ms/key. This isn’t great, but not disqualifying. Memorystore latencies are 0.09 ms + 0.033 ms/key. This is outstanding! Memorystore takes home the belt.\n   Unlike recommendations, the same products are used thousands of times in a single batch of emails, so caching is a good fit — we will read the same product many times before it is invalidated. To handle this, we created a GKE-based service, written in Go, called the product update listener.\n  Product catalogs are maintained by our GAE application. Two updates for the same product may come in simultaneously, with the last write to Datastore winning. That makes cache invalidation a challenge. We could have had a short time-to-live (TTL) on cached items, but that would have cost a lot of runtime efficiency unless we had some kind of gate to keep all the recommendation service nodes from trying to fetch from Datastore at the same time. Instead, the product update listener receives  ...\n  Our cache holds objects in Datastore transmitted as  protobuf. While products across partners have different schemas, within a single retailer there is a lot of consistency and repetition. That made products, which average 2KB, a prime candidate for compression. However, most compression schemes do not do well on small files. The authors of  Zstandard recognized this problem and added features specifically to improve performance on  small files. The chart below shows that popular compression  ...\n   Utilizing GCP tools has improved our performance tremendously. Recommendations now come from Bigtable, giving us back literally seconds of latency. Our product cache hit rates are usually above 99.9% because of the long TTL enabled by the proactive refresh from the product update listener. We also improved performance by adding a small  LRU cache with a short TTL, keeping the Memorystore traffic down to a dull roar. So, finally,  YES! It is as powerful as necessary.\n   Let’s prove that we meet our goals. We deployed our service to a GKE cluster, cloned and anonymized data, created attacker clients in Go, and collected metrics for the results. Thanks to the power of GKE, we were able to scale both the service and the attacking clients with a single command. The entire run, including rescaling the components was scripted and hands-off.\n    The main takeaway from this graph is that we were able to handle well above our bandwidth goal of 20 kHz. Woo hoo!\n  The process of creating a recommendation service that meets our goals shows the importance of knowing the strengths of the tools that your service or application is using. GCPs breadth of offerings enabled us to build an incredible service with just a handful of engineers. Here is an overview we use GCP tools in the recommendation service:", "posttime": "2020-05-03 04:19:05", "tags": "接收,gcp,推荐,recommendations", "title": "使用GCP为每秒20K个性化接收提供服务", "title_en": "Using GCP to Serve 20K Personalized Recs per Second", "transed": 1, "url": "https://medium.com/bluecore-engineering/using-google-cloud-to-serve-10-000s-of-personalized-recs-per-second-d86b7cf6b6da", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["接收", "gcp", "推荐"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000402, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我的职业生涯一直是关于设计编程语言和为它们编写编译器。这对我来说是一种巨大的快乐和满足感，如果您决定设计和实现一种专业的编程语言，也许我可以帮助其他人观察一下您的需求。当然，这是一个全书篇幅的主题，所以我在这里只会顺其自然地谈几个要点，而避开在其他地方已经很好地讨论过的话题。\n首先，你有很多工作要做。多年的工作，其中大部分将在沙漠中游荡。成功的机会对你不利。如果你没有强烈的自我激励去做这件事，它是不会发生的。如果你需要别人的认可和鼓励，这是不会发生的。\n幸运的是，做这样一个项目不是一大笔钱的投资，即使你失败了，它也不会让你崩溃。即使你真的失败了，取决于项目进展到什么程度，它在你的简历上看起来也会相当不错，对你的职业生涯也有好处。\n有一件事非常清楚，那就是语法很重要。这非常重要。这就像汽车上的造型-如果造型不吸引人，那么表演再火爆也无关紧要。语法必须是您的目标受众喜欢的内容。\n尝试使用他们以前从未见过的东西，将使语言采用变得更难推销。\n我喜欢把熟悉的句法和美感结合在一起。它必须在屏幕上看起来很好看。毕竟，您将花费大量时间来研究它。如果它看起来笨拙、笨拙或难看，那么它就会玷污语言。\n也许令人惊讶的是，我建议的几件事不应该是考虑因素。这些都是虚假的神：\n最大限度地减少击键。当程序员使用纸带时，这可能很重要，而且对于bash或awk这样的小型语言也很重要。对于较大的应用程序，编程时间花在读写上的时间要比写多得多，因此减少击键本身不应该是一个目标。当然，我并不是说大量的样板文件是个好主意。\n易于解析。编写具有任意先行功能的解析器并不难。不应该为了在解析器中节省几行代码而影响语言的外观。请记住，您将花费大量时间盯着代码。这是第一位的。如下所述，它仍然应该是上下文无关文法。\n最大限度地减少关键字的数量。这个指标很愚蠢，但我看到它反复出现。英语有一百万个单词，我不认为有任何迫在眉睫的短缺。只要用你正确的判断力就行了。\n上下文无关文法。这实际上意味着代码应该是可解析的，而不必在符号表中查找。众所周知，C++不是上下文无关的语法。上下文无关的语法，除了使事情变得简单之外，还意味着IDE可以在不集成到大多数编译器前端的情况下进行语法突出显示，也就是说，第三方工具变得更有可能存在。\n冗余。是的，语法应该是多余的。你们都听人说过，语句终止是不必要的，因为编译器可以解决这个问题。这是真的-但这种非冗余会导致无法理解的错误消息。考虑一种没有冗余的语法。然后，任何随机的字符序列都将是有效的程序。甚至不可能出现错误消息。良好的语法需要冗余，以便诊断错误并提供正确的错误消息。\n久经考验，千真万确。如果没有非常有力的理由，对于熟悉的结构，最好坚持使用久经考验的真实语法形式。它确实缩短了该语言的学习曲线，并将提高采用率。想想看，如果这种语言交换了+和*的运算符优先级，人们会多么讨厌它。将分歧3保存为以前未见的特征，这也向用户发出这是新的信号。\n一如既往，这些原则不应被视为口头禅。要有正确的判断力。任何盲目遵循的语言设计原则都会导致灾难。这些原则很少是正交的，而且经常发生冲突。这很像设计一座房子--把主衣橱做得更大，意味着主卧室会变小。这一切都是为了找到合适的平衡。\n抛开语法不谈，语言的核心将是语义处理，也就是将意义赋予句法结构。这是您将花费大量设计和实现的地方。这很像你体内的器官--它们是看不见的，除非它们出了问题，否则我们不会去想它们。语义工作不会有太多荣耀，但它将是语言的全部意义所在。\n一旦通过语义阶段，编译器就会进行优化，然后生成代码，统称为后端。这两个关都很有挑战性，也很复杂。我，我喜欢和这些东西打交道，抱怨说我不得不把时间花在其他问题上。但除非你真的喜欢它，而且它需要一个相当精神错乱的人", "note_en": "My career has been all about designing programming languages and writing compilers for them.\rThis has been a great joy and source of satisfaction to me, and perhaps I can\rhelp others with some observations about what you’re in for if you decide to\rdesign and implement a professional programming language.\rOf course, this is a book length topic, so I’ll just hit on a few highlights here,\rand avoid topics well covered elsewhere.\n    First off, you’re in for a lot of work. Years of work, most of which will be\rwandering in the desert. The odds of success are heavily stacked against you.\rIf you are not strongly self-motivated to do this, it isn’t going to happen.\rIf you need validation and encouragement from others, it isn’t going to happen.\n  Fortunately, doing such a project is not major dollar investment, it won’t break\ryou if you fail. Even if you do fail, depending on how far the project got, it\rcan look pretty good on your resume and be good for your career.\n    One thing abundantly clear is that syntax matters. It matters an awful lot. It’s\rlike the styling on a car — if the styling is not appealing, it simply doesn’t\rmatter how hot the performance is. The syntax needs to be something your\rtarget audience would like.\n  Trying to go with something they’ve not seen before will make language adoption\ra much tougher sell.\n  I like to go with a mix of familiar syntax and aesthetic beauty. It’s got to look\rgood on the screen. After all, you’re going to spend plenty of time looking at it.\rIf it looks awkward, clumsy, or ugly, so will it taint the language.\n  A couple things I, perhaps surprisingly, suggest should not be considerations. These\rare false gods:\n  Minimizing keystrokes. Maybe this mattered when programmers used paper tape, and it\rmatters for small languages like bash or awk. For larger applications, programming\rtime is spent reading much more than writing so reducing keystrokes shouldn’t be a goal in itself.\rOf course, I’m not suggesting that large amounts of boilerplate is a good idea.\n  Easy parsing. It isn’t hard to write parsers with arbitrary lookahead. The looks\rof the language shouldn’t be compromised to save a few lines of code in the parser.\rRemember, you’ll spend a lot of time staring at the code. That comes first.\rAs mentioned below, it still should be a context free grammar.\n  Minimizing the number of keywords. This metric is just silly, but I see it cropping\rup repeatedly. There are a million words in the english language, I don’t think there\ris any looming shortage. Just use your good judgement.\n    Context free grammars. What this really means is the code should be parseable\rwithout having to look things up in a symbol table. C++ is famously not a context free\rgrammar. A context free grammar, besides making things a lot simpler, means that\rIDEs can do syntax highlighting without integrating in most of a compiler front end,\ri.e. third party tools become much more likely to exist.\n  Redundancy. Yes, the grammar should be redundant. You’ve all heard people say that\rstatement terminating ; are not necessary because the compiler can figure it out. That’s\rtrue — but such non-redundancy makes for incomprehensible error messages. Consider a\rsyntax with no redundancy. Any random sequence of characters would then be a valid program.\rNo error messages are even possible. A good syntax needs redundancy in order to diagnose\rerrors and give good error messages.\n  Tried and true. Absent a very strong reason, it’s best to stick with tried and true\rgrammatical forms for familiar constructs. It really cuts the learning curve for the language,\rand will increase adoption rates. Think of how people will hate the language if it\rswaps the operator precedence of + and *. Save the divergance3 for features not generally seen\rbefore, such also signals the user that this is new.\n  As always, these principles should not be taken as dicta. Use good judgement.\rAny language design principle blindly followed leads to disaster. The principles\rare rarely orthogonal, and frequently conflict. It’s a lot like designing a house -\rmaking the master closet bigger means the master bedroom gets smaller. It’s all about\rfinding the right balance.\n  Getting past the syntax, the meat of the language will be the semantic processing, which\ris when meaning is assigned to the syntactical constructs. This is where you’ll be spending\rthe vast bulk of design and implementation. It’s a lot like the organs in your body — they are sight\runseen and we don’t think about them unless they are going wrong. There won’t be a lot of\rglory in the semantic work, but in it will be the whole point of the language.\n  Once through the semantic phase, the compiler does optimizations, and then code generation, collectively called the back end. These two passes are very challenging and complicated. Me, I love working with this stuff, and grumble that I ’ve got to spend time on other issues instead. But unless you really like it, and it takes a fairly unhinged programmer to delight in the arcana of such things, I recommend taking the common sense approach and use an existing back end,  ...\n    How best to implement it? I hope I can at least set you off in the right direction.\rThe first tool beginning compiler writers often reach for is regex. Regex is just the wrong\rtool for lexing and parsing. Rob Pike\r explains why\rreasonably well.\rI’ll close that with the famous quote from Jamie Zawinski:\n  Some people, when confronted with a problem, think \r“I know, I’ll use regular expressions.” Now they have two problems.\n  Somewhat more controversial, I wouldn ’t bother wasting time with lexer or parser generators and other so-called compiler compilers. They ’re a waste of time. Writing a lexer and parser is a tiny percentage of the job of writing a compiler. Using a generator will take up about as much time as writing one by hand, and it will marry you to the generator (which matters when porting the compiler to a new platform). Generators also have the unfortunate reputation of  ...\n  Now that I mentioned it, error messages are a big factor in the quality of implementation of\rthe language. It’s what the user sees, after all. If you’re tempted to put out error messages\rlike “bad syntax”, perhaps you should consider taking up a career as a chartered accountant\rinstead. Good error messages are surprisingly hard to write, and often you won’t discover\rhow bad the error messages are until you work the tech support emails.\n    Print the first message and quit. This is of course the simplest approach, and works\rsurprisingly well. Most compilers’ follow on messages are so bad that the practical programmer\rignores all but the first one anyway. The holy grail is to find all the actual errors in one\rcompile pass, leading to:\n  Guess at what the programmer intended, repair the syntax trees, and continue.\rThis is an ever-popular approach. I’ve tried it\rindefatigably for decades, and it’s just been a miserable failure. The compiler seems to always\rguess wrong, and subsequent messages with the “fixed” syntax trees are just ludicrously wrong.\n  The poisoning approach. This is much like how floating point NaNs are handled. Any operation with a NaN operand silently results in a NaN. Applying this to error recovery, and any constructs that have a leaf for which an error occurred is itself considered erroneous (but no additional error messages are emitted for it). Hence the compiler is able to detect multiple errors as long as the errors are in sections of code with no dependency between them. This  ...\n  What else does the user care about in the hidden part of the compiler? Speed. I hear it over\rand over — compiler speed matters a lot. In fact, compile speed is often the first thing I\rhear when I ask a company what tipped the balance for choosing D. The reality is, most\rcompilers are pigs. To blow people away with your language, show them that it compiles as\rfast as hitting the return key on the compile command.\n  Wanna know the secret of making your compiler fast? I mean screaming, blinding, lightning fast?\rSend me $$$ in an SASE and I’ll tell you! Ok, ok, I’ll set my naked greed aside and let you\rin on it.\n    Sounds too easy, right? Trite, even. But raise your hands if you routinely use a profiler.\rBe honest, everyone says they do but that profiler manual remains in its pristine shrink wrap.\rI’m just astonished at the programmers who never use profilers. But it’s great for me, as\ra competitive advantage that never ceases to pay dividends.\n    valgrind. I suspect valgrind has almost single-handedly saved C and C++ from oblivion. I\rcan’t heap enough praise on this tool. It has saved my error-prone sorry ass untold numbers of\rfrustrating hours.\n  git and github. Not many tools are transformative, but these are. Not only do they provide\ran automated backup, but they enable collaborative work on the project by people all over the\rworld. They also provide a complete history of where and from whom every line of code came from,\rin case there’s a legal issue.\n  Automated testing framework. Compilers are enormously complicated beasts. Without constant\rtesting of revisions, the project will reach a point where it cannot advance, as more bugs than\rimprovements will be added. Add to this a coverage analyzer, which will show if the test suite\ris exercising all the code or not.\n  Automated documentation generator. The D project of course built our own (Ddoc), and it too\rwas transformative. Before Ddoc, the documentation had only a random correlation with the code,\rand too often they had nothing to do with each other.\rAfter Ddoc, the two were brought in sync.\n  Bugzilla. This is an automated bug tracking tool. This was a great leap forward from my\rpathetic older scheme of emails and folders, a system that simply cannot scale. Programmers\rare far less tolerant of buggy compilers than they used to be, this has to be addressed\raggressively head on.\n    One semantic technique that is obvious in hindsight but it took Andrei Alexandrescu to point out to me is called ’lowering ’. It consists of, internally, rewriting more complex semantic constructs in terms of simpler ones. For example, while loops and foreach loops can be rewritten in terms of for loops. Then, the rest of the code only has to deal with for loops. This turned out to uncover a couple of latent bugs in how while loops were implemented,  ...\n  If it turns out that there are some special case rules in the language that prevent this\rrewriting, it might be a good idea to go back and revisit the language design.\n  Any time you can find commonality in the handling of semantic constructs, it’s an opportunity\rto reduce implementation effort and bugs.\n    Rarely mentioned, but critical, is you’ll need write a runtime library. This is a major project.\rIt’ll serve as a demonstration of how the language features work, so it had better be good.\rSome critical things to get right:\n  I/O performance. Most programs spend a lot of time in I/O. Slow I/O will make the whole\rlanguage look bad. The benchmark is C stdio. If the language has elegant, lovely I/O APIs but\rruns at only half the speed of C I/O, then it just isn’t going to be attractive.\n  Memory allocation. A high percentage of time in most programs is spent doing mundane\rmemory allocation. Get this wrong at your peril.\n  Transcendental functions. Ok, I lied. Nobody cares about the accuracy of transcendental functions, they only care about the speed of them. My proof comes from trying to port the D runtime library to different platforms, and discovering that the underlying C transcendental functions often fail the accuracy tests in the D library test suite. C library functions also often do a poor job handling the arcana of the IEEE floating point  ...\n  A common trap people fall into with standard libraries is filling them up with trivia.\rTrivia is sand clogging the gears and just dead weight that has to be carried around forever.\rMy general rule is if the explanation for what the function does is more lines than the\rimplementation code, then the function is likely trivia and should be booted out.\n    You ’ve done it, you ’ve got a great prototype of the new language. Now what? Next comes the hardest part. This is where most new languages fail. You ’ll be doing what every nascent rock band does —play shopping malls, high school dances, dive bars, etc., slowly building up an audience. For languages, this means preparing presentations, articles, tutorials, and books on the language. Then, going to programmer meetings, conferences,  ...\n  There’s one huge thing in your favor. With the global reach of the internet, there’s an\rinstantly reachable global audience. Another favorable thing is that programmer meetings,\rconferences, etc., all are looking for great content. They love talks about new languages,\rnew programming ideas, etc. My experience with the audiences is they are friendly and\rwill give you lots of constructive feedback.\n  Of course, then you’ll almost certainly be forced to reevaluate some cherished features of the\rlanguage and reengineer them.", "posttime": "2020-05-03 03:57:09", "tags": "编程,programming language,编写,truth,语言", "title": "关于编写编程语言的赤裸裸的真相", "title_en": "The Naked Truth About Writing a Programming Language", "transed": 1, "url": "https://www.digitalmars.com/articles/b90.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["编程", "language", "编写", "truth", "语言"]}, {"category": "", "categoryclass": "", "imagename": "249446622459809052f700ba44b3d3ba.jpg", "infoid": 1000401, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿州布莱恩。-在他几十年的养蜂生涯中，泰德·麦克福尔(Ted McFall)从未见过这样的事情。\n11月，当他把卡车停在华盛顿州卡斯特附近检查一群蜂箱时，他可以从窗户看到地上一团糟的蜜蜂身体。当他仔细观察时，他看到蜂巢前有一堆死去的成员，里面还有更多的屠杀-成千上万的蜜蜂从身体上撕下了头，没有罪犯的迹象。\n麦克福尔说，“我无法理解到底是什么造成了这样的后果。”\n直到后来，他才开始怀疑凶手就是一些研究人员简单地称之为“谋杀大黄蜂”的那个人。\n有了可以长到两英寸长的蜂王，亚洲巨型黄蜂可以用长得像尖刺的鲨鱼鳍那样的下颚，在几个小时内消灭蜜蜂蜂巢，斩首蜜蜂，带着胸甲飞走，喂养它们的幼崽。对于较大的目标，黄蜂强大的毒液和毒刺-足够刺穿一套养蜂服-构成了一种令人痛苦的组合，受害者将其比作滚烫的金属刺进他们的皮肤。\n在日本，黄蜂每年杀死多达50人。现在，他们第一次抵达美国。\n麦克福尔仍然不确定亚洲巨型黄蜂是不是他的蜂巢被掠夺的罪魁祸首。但其中两种捕食性昆虫是去年秋天在华盛顿州西北角发现的，就在他的房产以北几英里处-这是美国首次发现这种昆虫。\n自那以后，科学家们开始了对黄蜂的全面追捕，他们担心入侵者可能会在美国大量消灭蜜蜂，并建立如此深入的存在，以至于可能会失去根除的所有希望。\n华盛顿州农业部的昆虫学家克里斯·鲁尼(Chris Looney)说，“这是我们阻止它建立的窗口。”“如果我们在未来几年做不到，很可能也做不到.”\n12月初一个寒冷的早晨，在麦克福尔房产以北2.5英里处，杰夫·科内利斯(Jeff Kornelis)带着他的混血狗踏上了他家的前廊。他低头看着一幅刺耳的景象：“这是我见过的最大的黄蜂。”\n这只昆虫死了，科内利斯在检查过它之后，有一种预感，它可能是一只亚洲巨型大黄蜂。考虑到他在世界上的位置，这没有多大意义，但他看过YouTube名人郊狼彼得森(Coyote Peterson)被其中一只大黄蜂狠狠地叮了一口的一集。\n除了它的大小，大黄蜂还有一个独特的外观，一张卡通般的凶猛的脸，有着蜘蛛侠那样的泪眼，像老虎一样延伸到身体下面的橙色和黑色条纹，以及像小蜻蜓一样宽大而纤细的翅膀。\n科内利斯联系了国家，后者出来确认这确实是一只亚洲巨型大黄蜂。不久之后，他们得知该地区的一名当地养蜂人也发现了其中一只黄蜂。\n鲁尼博士说，很明显，该州面临着一个严重的问题，但由于手中只有两只昆虫，而且冬天即将到来，几乎不可能确定大黄蜂已经在家里赚了多少钱。\n整个冬天，州农业生物学家和当地养蜂人开始工作，为即将到来的季节做准备。帮助组织同龄人对抗黄蜂的养蜂人露丝·丹尼尔森(Ruthie Danielsen)在她的汽车引擎盖上展开了一张地图，指出了Whatcom县各地养蜂人放置陷阱的地方。\n丹尼尔森说，“大多数人都害怕被它们叮到。”“我们害怕他们会彻底摧毁我们的蜂巢。”\n在加拿大边境另一边发现了一些亚洲巨型大黄蜂，这增加了不确定性和神秘性。\n去年11月，在不列颠哥伦比亚省的怀特罗克(White Rock)发现了一只黄蜂，距离华盛顿州的发现可能有10英里远-对于黄蜂来说，很可能太远了，不可能是同一殖民地的一部分。甚至在更早的时候，在温哥华岛上发现了一个蜂巢，横跨一条海峡，对于一只大黄蜂来说，可能太宽了，不可能从大陆穿越过来。\n工作人员能够追踪到温哥华岛上的母舰。康拉德·贝鲁贝是纳奈莫镇的养蜂人和昆虫学家，他被指派去消灭它。\n他在晚上出发，那时黄蜂正在它们的巢穴里。他穿上短裤和厚运动裤，然后穿上蜂服。他在脚踝和手腕上戴上了凯夫拉背带。\n但当他走近蜂巢时，他说，刷子的沙沙声和手电筒的光芒唤醒了蜂群。还没来得及往巢里浇二氧化碳，他就感觉到腿部第一次被灼热的刺伤--穿过蜂服和底层的运动裤。\n他说：“这就像是把滚烫的图钉刺进了我的肉里。”他最终被蜇了至少七次，其中一些叮咬流了血。\n日本京都尚约大学的研究员高桥俊一(Jun-ichi Takahashi)说，这个物种在那里赢得了“谋杀大黄蜂”的绰号，因为它咄咄逼人", "note_en": "BLAINE, Wash. — In his decades of beekeeping, Ted McFall had never seen anything like it.\n As he pulled his truck up to check on a group of hives near Custer, Wash., in November, he could spot from the window a mess of bee carcasses on the ground. As he looked closer, he saw a pile of dead members of the colony in front of a hive and more carnage inside — thousands and thousands of bees with their heads torn from their bodies and no sign of a culprit.\n “I couldn’t wrap my head around what could have done that,” Mr. McFall said.\n Only later did he come to suspect that the killer was what some researchers simply call the “murder hornet.”\n With queens that can grow to two inches long, Asian giant hornets can use mandibles shaped like spiked shark fins to wipe out a honeybee hive in a matter of hours, decapitating the bees and flying away with the thoraxes to feed their young. For larger targets, the hornet’s potent venom and stinger — long enough to puncture a beekeeping suit — make for an excruciating combination that victims have likened to hot metal driving into their skin.\n In Japan, the hornets kill up to 50 people a year. Now, for the first time, they have arrived in the United States.\n Mr. McFall still is not certain that  Asian giant hornets were responsible for the plunder of his hive. But two of the predatory insects were discovered last fall in the northwest corner of Washington State, a few miles north of his property — the first sightings in the United States.\n Scientists have since embarked on a full-scale hunt for the hornets, worried that the invaders could decimate bee populations in the United States and establish such a deep presence that all hope for eradication could be lost.\n “This is our window to keep it from establishing,” said Chris Looney, an entomologist at the Washington State Department of Agriculture. “If we can’t do it in the next couple of years, it probably can’t be done.”\n  On a cold morning in early December, two and a half miles to the north of Mr. McFall’s property, Jeff Kornelis stepped on his front porch with his terrier-mix dog. He looked down to a jarring sight: “It was the biggest hornet I’d ever seen.”\n The insect was dead, and after inspecting it, Mr. Kornelis had a hunch that it might be an Asian giant hornet. It did not make much sense, given his location in the world, but he had seen an episode of the YouTube personality Coyote Peterson  getting a brutal sting from one of the hornets.\n  Beyond its size, the hornet has a distinctive look, with a cartoonishly fierce face featuring teardrop eyes like Spider-Man, orange and black stripes that extend down its body like a tiger, and broad, wispy wings like a small dragonfly.\n Mr. Kornelis contacted the state, which came out to confirm that it was indeed an Asian giant hornet. Soon after, they learned that a local beekeeper in the area had also found one of the hornets.\n Dr. Looney said it was immediately clear that the state faced a serious problem, but with only two insects in hand and winter coming on, it was nearly impossible to determine how much the hornet had already made itself at home.\n Over the winter, state agriculture biologists and local beekeepers got to work, preparing for the coming season. Ruthie Danielsen, a beekeeper who has helped organize her peers to combat the hornet, unfurled a map across the hood of her vehicle, noting the places across Whatcom County where beekeepers have placed traps.\n “Most people are scared to get stung by them,” Ms. Danielsen said. “We’re scared that they are going to totally destroy our hives.”\n  Adding to the uncertainty — and mystery — were some other discoveries of the Asian giant hornet across the border in Canada.\n In November, a single hornet was seen in White Rock, British Columbia, perhaps 10 miles away from the discoveries in Washington State — likely too far for the hornets to be part of the same colony. Even earlier, there had been a hive discovered on Vancouver Island, across a strait that probably was too wide for a hornet to have crossed from the mainland.\n Crews were able to track down the hive on Vancouver Island. Conrad Bérubé, a beekeeper and entomologist in the town of Nanaimo, was assigned to exterminate it.\n He set out at night, when the hornets would be in their nest. He put on shorts and thick sweatpants, then his bee suit. He donned Kevlar braces on his ankles and wrists.\n But as he approached the hive, he said, the rustling of the brush and the shine of his flashlight awakened the colony. Before he had a chance to douse the nest with carbon dioxide, he felt the first searing stabs in his leg — through the bee suit and underlying sweatpants.\n “It was like having red-hot thumbtacks being driven into my flesh,” he said. He ended up getting stung at least seven times, some of the stings drawing blood.\n Jun-ichi Takahashi, a researcher at Kyoto Sangyo University in Japan, said the species had earned the “murder hornet” nickname there because its aggressive group attacks can expose victims to doses of toxic venom equivalent to that of a venomous snake; a series of stings can be fatal.\n The night he got stung, Mr. Bérubé still managed to eliminate the nest and collect samples, but the next day, his legs were aching, as if he had the flu. Of the thousands of times he has been stung in his lifetime of work, he said, the Asian giant hornet stings were the most painful.\n  After collecting the hornet in the Blaine area, state officials took off part of a leg and shipped it to an expert in Japan. A sample from the Nanaimo nest was sent as well.\n A genetic examination, concluded over the past few weeks, determined that the nest in Nanaimo and the hornet near Blaine were not connected, said Telissa Wilson, a state pest biologist, meaning there had probably been at least two different introductions in the region.\n Dr. Looney went out on a recent day in Blaine, carrying clear jugs that had been made into makeshift traps; typical wasp and bee traps available for purchase have holes too small for the Asian giant hornet. He filled some with orange juice mixed with rice wine, others had kefir mixed with water, and a third batch was filled with some experimental lures — all with the hope of catching a queen emerging to look for a place to build a nest.\n In a region with extensive wooded habitats for hornets to establish homes, the task of finding and eliminating them is daunting. How to find dens that may be hidden underground? And where to look, given that one of the queens can fly many miles a day, at speeds of up to 20 miles per hour?\n The miles of wooded landscapes and mild, wet climate of western Washington State make it an ideal location for the hornets to spread.\n In the coming months, Dr. Looney said, he and others plan to place hundreds more traps that could catch worker hornets that would start becoming active over the summer. State officials have mapped out the plan in a grid, starting in Blaine and moving outward.\n  The buzz of activity inside a nest of Asian giant hornets can keep the inside temperature up to 86 degrees, so the trackers are also exploring using thermal imaging to examine the forest floors. Later, they may also try other advanced tools that could track the signature hum the hornets make in flight.\n If a hornet does get caught in a trap, Dr. Looney said, there are plans to possibly use radio-frequency identification tags to monitor where it goes — or simply attach a small streamer and then follow the hornet as it returns to its nest.\n While most bees would be unable to fly with a disruptive marker attached, that is not the case with the Asian giant hornet. It is big enough to handle the extra load.", "posttime": "2020-05-03 03:56:49", "tags": "谋杀,murder,黄蜂,hornet", "title": "亚洲谋杀大黄蜂已经抵达北美", "title_en": "Asian Murder Hornets Have Arrived in North America", "transed": 1, "url": "https://www.nytimes.com/2020/05/02/us/asian-giant-hornet-washington.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["谋杀", "murder", "黄蜂", "hornet"]}, {"category": "", "categoryclass": "", "imagename": "24e61a8175af932d24d6bfab5f86fc71.png", "infoid": 1000400, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "也许有一天这会是个更好的主意，但那一天还没有到来。脚踝手镯就像任何其他电子设备一样，容易出现意想不到的故障。假阴性--提醒假释者不在家--从长远来看并不比假阳性好多少，尽管前者是唯一能剥夺某人自由的人。\n脚踝手镯的费用由假释犯承担。智能手机应用程序可能会稍微便宜一些，…。但前提是你不考虑智能手机或应用程序本身的成本。智能手机对于假释犯来说并不容易获得。补贴手机和应用程序的月费所需的工作也不多。\n那些有幸买到智能手机的人发现，新的解决方案和它的前身一样容易出错。\n在莱拉出狱回到佐治亚州家中的那天，她被告知需要购买一部智能手机-对于一个刚刚服刑结束的人来说，这不是一个无关紧要的任务，但莱拉很幸运有一个朋友可以给她买一部。她说，几天后，她在家睡觉时，根据她的释放条款，她被要求安装的应用程序出人意料地响起，高音的警告警报响起，因为它向她的假释官发送了一份通知，告诉.。\n惊慌失措的莱拉拍了一张自己的照片，把自己的位置发给他，试图纠正这款应用的错误。她说，这个过程会无情地重复，每隔半个小时就会在夜间叫醒她。“我会哭着醒来，”她说。有时，当她试图验证自己的位置或签到时，应用程序会告诉她，它无法识别她的声音。“我会觉得很累的，我想如果我不回答，我会回到监狱的。”很快，她说，她“乞求我的假释官……”\n“守护者”是一款无法正常工作的应用程序，一些假释犯要求恢复到以前版本的假释犯监控功能：脚踝手镯。根据“卫报”的数据，“卫报”拥有近5万名用户，而莱拉并不是唯一有可能被这款出故障的应用程序侵犯回监狱的假释犯。Gizmodo采访的其他假释犯也报告了同样的问题。他们说，这款应用程序几乎无法使用，因为它无法准确地报告……。\n不出所料，这款应用程序的所有者是Telmate，也就是运营Global Tele*Link的同一家公司。Global Tele*Link的业务是向囚犯出售通往外部世界的通道。它运营着许多监狱通信网络，这些网络以对从监狱打来的电话每分钟收取过高的费用而闻名，并控制着囚犯参与的几乎所有其他数字互动的娱乐设备(如平板电脑和MP3播放器)。它会释放一个编码草率的..。\n这款应用程序具有侵入性--甚至比假释官未经宣布的家访更具侵入性。这款应用做了惩戒人员在身体上做不到的事情：要求每天几十次签到。\n“Guardian让我丢掉了工作，”另一个被监禁了十多年的人说，他使用了这款应用，并记得它要求他每小时签到超过10次。“晚上我睡不着觉，然后在工作时，我不得不一直掏出手机。”他说，有一半的时间，它无法准确识别他的脸或声音。\n卫报要求更多，但做得更少。当与某人面对面会面时，邮局可以很容易地核实他们的身份。取代他们位置的应用程序显然无法可靠地做到这一点。在这项简单的任务上，它日复一日地在一小时内多次失败。一款无法平衡身份证账簿的应用程序不会帮助任何人在偿还了欠社会的债务后恢复正常生活。\n快速的成本效益分析很大程度上站在了成本的一边。这款应用程序的月费为90美元，而且不能正常工作。它所做的就是让顺从的假释犯面临再次入狱的风险。即使它工作得有点正常，它也是个问题。\n正如我们在评论中发现的那样，Guardian每分钟都会向Telmate的服务器签到，如果手机处于睡眠状态，它会唤醒手机，并忽略操作系统优化电池的请求。考虑到Guardian的用途，可以预见的是，这款应用程序依赖于用户授予它对设备上一些潜在侵犯隐私的传感器的访问权限，包括WiFi、蓝牙、音频设置和摄像头访问。\n一整天，每天的监视假释犯都需要支付费用。即使他们遵守了规则，这款应用程序也会说他们不是。代码中还包括用于秘密录音的挂钩--隐藏进入设备的麦克风，可以在待机或睡眠模式下触发。当应用程序每隔60秒给家里打一次电话时，睡眠模式并不意味着什么。\n假释囚犯的隐私权期望值很低。但它并不是不存在的。这款昂贵的应用程序移除了剩下的所有内容，取而代之的是侵入式签到", "note_en": "Maybe it will be a better idea someday, but that day isn&#39;t here yet. Ankle bracelets are prone to unexpected failure, just like any other electronic device. False negatives -- alerts saying a parolee isn&#39;t at home -- are no better than false positives in the long run, although the former is the only one that can take away someone&#39;s freedom.\n The costs of ankle bracelets are borne by the parolee. Smartphone apps may be slightly cheaper… but only if you don&#39;t factor in the cost of a smartphone or the app itself. Smartphones aren&#39;t easy for parolees to obtain. Neither are the jobs needed to subsidize both the phone and the app&#39;s monthly charge.\n Those lucky enough to secure a smartphone are discovering the new solution  is just as prone to error as its predecessor.\n On the day Layla got out of prison and back to her home in Georgia, she was told she would need to purchase a smartphone —not an insignificant task for someone who ’d just completed a sentence, but Layla was lucky to have a friend who could buy one for her. She says she was at home in bed a few days later when the app she had been mandated to install under the terms of her release went off unexpectedly, the high-pitched warning alarm blaring as it sent a notification to her parole officers telling  ...\n Panicked, Layla took a picture of herself and sent him her location, trying to correct the app ’s mistake. The process would repeat relentlessly, she says, waking her up every half hour during the night. “I ’d wake up crying, ”she says. Sometimes, when she tried to authenticate her location or check in the app would tell her it didn ’t recognize her voice. “I ’d feel so tired, and I thought if I didn ’t answer, I was going to go back to prison. ”Soon, she says, she was “begging my parole officer  ...\n Guardian is the app that&#39;s so unable to do its job properly some parolees are asking to be rolled back to the previous version of parolee monitoring: ankle bracelets. Guardian has almost 50,000 &#34;users,&#34; according to its data, and Layla isn&#39;t the only parolee in danger of being violated back into prison by the malfunctioning app. Other parolees spoken to by Gizmodo are reporting the same issues. They say the app is almost &#34;unusable&#34; due to its inability to accurately report  ...\n Unsurprisingly, the app is owned by Telmate, the same company that operates Global Tel*Link. Global Tel*Link is in the business of selling prisoners access to the outside world. It runs a number of prison communication networks -- ones known for  charging exorbitant per-minute fees for phone calls originating from prisons, as well as controlling  the entertainment devices(like tablets and mp3 players) of nearly every other digital interaction engaged in by inmates. That it would release a sloppily-coded  ...\n The app is intrusive -- even more intrusive than unannounced in-home visits by parole officers. The app does what corrections officers physically can&#39;t do: demand dozens of check-ins a day.\n “Guardian cost me my job,” says another person who had been incarcerated for more than a decade who used the app and remembers it asking him to check in more than 10 times an hour. “At night I couldn’t sleep, and then at work I’d have to pull my phone out all the time.” Half the time, he says, it wouldn’t accurately recognize his face or his voice.\n Guardian demands more but does less. A P.O. could easily verify a person&#39;s identity when meeting them in person. The app taking their place is apparently unable to reliably do this. It fails at this simple task multiple times an hour, day after day. An app unable to balance its ID books isn&#39;t going to help anyone return to a normal life after repaying their debt to society.\n A quick cost-benefit analysis sides heavily with costs. The app costs $90/month and doesn&#39;t work correctly. What it does do is put compliant parolees at risk of being incarcerated again. Even when it&#39;s working somewhat correctly, it&#39;s a problem.\n As we found in the review, Guardian checks in with Telmate’s servers every single minute, waking up a phone if it’s asleep and ignoring the operating system’s requests to optimize the battery. Given what Guardian is used for, the app predictably relies on the user granting it access to a number of potentially privacy-invasive sensors on their device, including wifi, Bluetooth, audio settings, and camera access.\n All day, everyday surveillance parolees are expected to pay for. And even when they follow the rules, the app says they aren&#39;t. Also included in the code are hooks for surreptitious recording -- hidden access to devices&#39; microphones that can be triggered in standby or sleep mode. Not that sleep mode means anything when the app is phoning home every sixty seconds.\n The expectation of privacy for paroled prisoners is low. But it&#39;s not nonexistent. This expensive app removes everything that&#39;s left and replaces it with intrusive check-ins that are so badly implemented they may as well be a malfunctioning ankle bracelet for all the good it&#39;s doing for parolees. But this is likely the best prisoners are ever going to get. Very few people who matter -- those with the power to change things -- care what happens to ex-criminals. Every sentence  ...", "posttime": "2020-05-03 03:56:39", "tags": "程序,app,手机,不起作用,replace", "title": "监狱用不起作用的智能手机应用程序更换脚踝手镯", "title_en": "Prisons Replace Ankle Bracelets with Smartphone App That Doesn't Work", "transed": 1, "url": "https://www.techdirt.com/articles/20200429/10182144405/prisons-replace-ankle-bracelets-with-expensive-smartphone-app-that-doesnt-work.shtml", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["程序", "app", "手机", "不起作用", "replace"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000399, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在是开发新产品的时候了！我决定分享我构建SaaS产品之旅中的每一步，以保持对自己的责任感。我花几天/几周/几个月的时间编写代码，在ProductHunt或IndieHacker上分享的日子已经一去不复返了，没有任何形式的吸引力。现在我们的做法是正确的！\n什么是正确的方式？我还不完全知道，但我过去的经验告诉我，在建立我的MVP之前，我需要专注于几件事：\n找到遇到该问题的人，并询问他们是如何解决该问题的(客户采访)。\n试着建立一个早期用户的初始列表，从他们那里获得反馈，并改进我的MVP。\n现有的书签解决方案允许我将链接保存在文件夹、标签等中，但有一个问题是要记得返回应用程序并打开链接。我遇到的另一个问题是，当我在网上阅读文章、观看视频或查找有趣的内容时，我想做笔记并保存片段以备快速参考。\n我这次实际上做了一些客户调查，洞察了人们目前是如何解决这个问题的：\n人们正在使用基本的笔记应用程序作为书签管理器：这个解决方案的问题是，你必须围绕笔记应用程序建立一个系统来保持一切井然有序。人们使用的应用程序有Google Keep和Apple Notes、Bear、Concept等。\n人们正在使用现有的书签应用程序：Raindrop、Pocket和Instapaper等应用程序。如果您要保存链接并将其组织在文件夹中或按标签进行组织，但它们不能帮助您稍后返回到链接，则此解决方案有效。\n开发人员正在构建自己的应用程序：在开发人员论坛上，我发现其他开发人员试图通过构建定制解决方案来解决这个问题。然而，并不是每个人都能编码。\n我的书签应用程序将在同一屋檐下提供所有这三样东西：组织、笔记和提醒。\n通用应用程序：Bear、Concept、RoamResearch：保存链接和笔记，但需要构建自己的系统才能运行。\n阅读清单提醒应用程序：Mailist.app(到目前为止，这是我找到的唯一一个)：提醒你阅读链接，但不提供组织功能。\nExcel和Airtable：任何人都可以在这两个应用程序中做任何事情，但是你需要找到时间来构建一个适合你的系统。这可能会很麻烦。\n通过在论坛、Twitter、IndieHacker、HackerNews上建立受众，我正在询问人们他们是如何解决这些问题的，并试图获得一些见解。然后我试着联系一些回答的人，建立一份早期采用者的名单。到目前为止，这还不是很成功：不是每个人都回答说。\n到目前为止，这种观众至上的方法并不顺利。我在Twitter和其他平台上没有追随者，所以我尝试了一种令人毛骨悚然的方式，直接联系人们。这对我不起作用，因为首先，这些人不了解我，其次，他们不在乎我要说什么。我在网上到处看到，在开发产品之前，你必须先建立一个受众，但要建立一个受众，你至少需要有愿意听你说话的人。\n我还创建了一个带有电子邮件表单的登录页面，我将在Twitter和其他地方分享，试图获得一些早期用户。然而，在社交媒体上没有追随者的情况下，很难获得吸引力。\n我已经在Adobe XD上构建了一个我认为这个应用程序会是什么样子的设计原型。然而，我认为我设计过度了，我不喜欢这样，所以我需要从头开始。", "note_en": "It is time build a new product! I have decided to share every step on my journey of building SaaS products to keep myself accountable. Long gone are the days where I would spend days/weeks/months coding something, sharing it on ProductHunt or IndieHackers and have no form of traction. Now we are doing it the right way!\n What is the right way? I don&#39;t fully know yet but my past experiences showed me that I need to focus on a few things before building my MVP:\n Find the people experiencing that problem and ask them how they are solving it (customer interviews)\n Try to build an initial list of early users, get feedback from them and refine my MVP\n       Existing bookmark solutions allow me to save links in folders, tags etc but one issue is to remember to come back to the application and open the links. The other problem I have is that when I read articles, watch videos or find interesting content online I want to take notes and save snippets for quick reference.\n  I have actually done some customer research this time and got some insight on how people are solving this problem at the moment:\n People are using basic note apps as a bookmark manager: The problem with this solution is that you have to build a system around the note app to keep everything organized. Example of apps people use for that are Google Keep and Apple Notes, Bear, Notion etc\n People are using existing bookmark apps: Apps like Raindrop, Pocket and Instapaper. This solution works if you want to save your links and organize them in folders or by tags but they don&#39;t help you come back to your links later\n Developers are building their own apps: On developer forums I found that other developers tried to solve this by building a custom solution. However not everyone can code.\n  My bookmark app will offer all those 3 things under the same roof: organization, notes and reminders.\n  General purpose apps: Bear, Notion, RoamResearch: Save links and notes but need to build your own system to make it work\n Reading list reminder apps: Mailist.app (so far it&#39;s the only one that I found): Reminds you to read links but offer no organization capabilities\n Excel and Airtable: Anybody can do anything in those 2 apps but you need to find time to build a system that works for you. It can be cumbersome.\n  Building an audience by going on forums, Twitter, IndieHackers, HackerNews, I am asking people how they are solving these problems and trying to get some insights. I then try to contact some of the people that answer to build a list of early adopters. So far this have not been very successful: not everybody replies\n  This audience-first approach is not going well so far. I have no following on Twitter and other platforms so I have tried the creepy way by contacting people directly. This is not working for me because first, these people don&#39;t know me and second, they don&#39;t care about what I have to say. I see everywhere online that you have to build an audience before building a product but to build an audience you need at least people that want to listen to you\n     I have also created a  landing page with an email form that I will share on Twitter and other places to try to get some early users. However with no following on social media it will be hard to get traction\n I have built a  design prototype on Adobe XD of what I think the app would look like. However I think I over engineered and don&#39;t like it this so I need to go back to the drawing board", "posttime": "2020-05-03 03:34:42", "tags": "程序,app,saas,应用程序,people", "title": "公开构建SaaS：书签应用程序-第1天(ISH)", "title_en": "Building a SaaS in Public: Bookmark App – Day 1(ish)", "transed": 1, "url": "https://charlesthecoder.dev/building-saas-in-public-bookmark-app-day-1/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["程序", "app", "saas", "应用程序", "people"]}, {"category": "", "categoryclass": "", "imagename": "027e951625cc3fe89626ad395687d766.png", "infoid": 1000398, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年5月1日-如果你和我一样，隔离让你想要重播你多年没有碰过的游戏。如果你更像我，你可能会在某个地方储存一份“帝国纪元3”。你可能在Mac上玩，你可能还没有升级到Catalina，你可能渴望一些摩根·布莱克的动作。\n所以你引导游戏，你登陆到主菜单，你立刻注意到…出了点问题。看起来像热垃圾。\n所以，你跳到选项上，提升所有的东西，…。…。它仍然很难看。\n令人怀疑的是，您会注意到，“着色器质量”选项被锁定为“低”。\n此时，您将在文档中的某个位置查找游戏预期创建的文件夹，因为这是2005年，而这正是游戏所做的。\n你会问，你在找什么？当然是存储设置的文件。界面可以把你锁在门外，但你是个节俭的人，不是吗？因此，您找到了您要查找的XML，因为它是2005年的，当然是XML，并且偶然发现了一个“optiongrfxshaderquality”选项设置为0。你认为这看起来很对，所以你把它提高到100，因为质量太高永远不会出错。我们意见一致。\n内容，你启动游戏。然而，帕塔特拉(这是法国的，查一下这个)，什么都没有改变。当您查看ol‘XML文件时，设置返回到0。合奏工作室(RIP)已经看到了你的技艺，并把它弄得一塌糊涂。\n在这一点上，你可能会放弃。这是一个Mac系统，你不太可能找到用户补丁(好吧，我看了一下。到处都有一些可疑的东西。可能会奏效。)。这只是图形而已。修理起来听起来很烦人。\n但你不会这么做的。因为你记得3岁时应该是什么样子。你还记得看着那美丽的波涛汹涌的水。那些粒子效果。在那些他妈的框架里根本放不下的大船上。天哪，摄像机被放大了。他们在想什么呢。\n在您的文档中，该文件夹的顶部有一个日志文件。这款游戏显示了一张显卡，并说它选择了“通用DX7”设置。这是说你有一台英特尔GMA 950，你以前的电脑确实有过。不过，这一款配备了Intel Iris Graphics 6100。确实有些不对劲。你胡乱猜测游戏是通过将计算机的图形能力与显卡数据库进行匹配来确定计算机的图形能力，而不是做正确的事情并检查这些功能……。\n顺便说一句，你发现了旧的补丁笔记。这些都证实了你的恐惧。您可以查看GameData文件夹中的一些文件，但它们都是.bar和.xmb文件，这些文件大多无法读取。您是“Intel”的grep，是“DX7”的grep。什么都没发生。你删除了一些文件…。什么都没发生。嗯，你知道AAA游戏可能想把一些资源捆绑在奇怪的地方，这是一个Windows游戏的Mac端口，所以你知道，也许事情很奇怪。\n尽管如此，您最终还是找到了一个“render.bar”文件，并在启动时移动该文件时崩溃。那还不算太好。您可以在十六进制恶魔中打开该文件，因为这通常可以告诉您一些有关二进制文件的信息。是的，确实如此。其中一些数据是可读文本。其中一些是着色器。但奇怪的是，它的大部分由空格…分隔。\n“很明显，那是UTF-16”，你惊呼道！这本来是一款Windows游戏，他们用UTF-16存储文本非常有意义，基本上浪费了30Mb数据文件的一半空间。毕竟，Windows喜欢UTF-16(尽管它不应该)，为什么不在同一文件中使用该着色器和ASCII着色器。非常明智的主意！(未显示：我花了一天时间才意识到)。\n不管怎么说。十六进制Fiend实际上有一个将字节解析为UTF-16的选项，因此您可以为DX7执行grep。这会给你带来一些打击。您可以用DX9替换所有这些数据，DX9偶尔也会出现在这些数据中，您可以保存并引导游戏。韦尔普。日志上甚至没有写“DX9”。这可能是在别处定义的。\n我们试试别的吧。假设游戏正在检测显卡，并且日志中有十六进制标识符(在我的例子中，是0x8086-Intel和0x2773)。格雷格在“魔法恶魔”中的“8086”在某个地方大受欢迎，其中一些文本看起来很鼓舞人心。英特尔9系列是GMA 950系列，它可能运行得不是很好。\n那里的一些数字看起来像卡片的标识符(2582，2592)，所以更改这些数字可能会有所帮助。不管怎么说，你已经复制了一份文件，所以试一试也没什么坏处。\n可悲的是，这也是一条死胡同。事实是，你看错文件了。谢天谢地，我可以告诉你这一点，因为我在这上面花了太多的时间，尝试了太多的东西。这该死的东西花了20多个小时。这还不算拍摄所有这些屏幕截图的时间，…。\n无论如何，正确的文件是“DataP.bar”，如果您巧妙地替换ID，日志将显示一些全新的内容：\n当然，在游戏中，你仍然停留在“低”设置上，所以日志没有说谎。你可能希望是“中等”的，但是，唉，不是。\n这", "note_en": "May 1st 2020 — if you’re like me, quarantine is making you want to replay games you haven’t touched in years. If you’re further like me, you might have a copy of Age of Empires 3 stored somewhere. You might be playing on a Mac, you might not yet have upgraded to Catalina, and you might be eager for some of that Morgan Black action.\n So you boot the game, you land on the Main Menu, and you immediately notice something is wrong… It looks like  hot  garbage.\n   So, you hop over to the options, boost everything up… …And it’s still ugly.\n Suspiciously, you notice, the “ Shader Quality” options is locked to “ Low”.\n  At this point, you’ll look for the folder the game has expectedly created somewhere in your Documents, because it’s 2005 and that’s what games do.\n What are you looking for, you ask? The file where settings are stored, of course. The interface can lock you out, but you’re a thrifty man, aren’t ya. So you find the XML you’re looking for, because it’s 2005 and of course it’s XML, and stumble upon a “ optiongrfxshaderquality” option set to 0. That looks right, you think, and so you bump that to 100 because one can never go wrong with too much quality. We are in agreement.\n  Content, you boot the game up. However,  patatras (it’s French, look this up), nothing changed. And as you look at the ol’ XML file, the setting is back to 0. Ensemble Studios (RIP) has looked at your craftiness and crapped all over it.\n At this point, you  might give up. This is a Mac system and you’re unlikely to find a user-patch (well — I’ve looked around a bit. There’s some shady stuff here and there. Might work.) It’s just graphics. It sounds annoying to fix.\n But you’re not going to. Because you remember how Age 3 should look like. You remember looking at that beautiful wavy water. At those particle effects. At those huge ships that simply wouldn’t fit in the goddamn  fucking frame. Jesus that camera is zoomed in. What were they thinking.\n  At the top of that Folder in your Documents, there is a log file. The game shows a graphic card, and says it’s picking the “generic dx7” setting. It’s saying you’ve got an Intel GMA 950, which your previous computer indeed had. This one, though, has an Intel Iris Graphics 6100. Something is indeed wrong. You take a wild guess that the game is determining your computer ’s graphics capabilities by matching it against a database of graphics cards, instead of doing the right thing and checking the capabilities  ...\n  Incidentally, you find old  patch notes. Those confirm your fears. You look around at some files in the GameData folder, but it’s all  .bar and  .xmb files, and those are mostly unreadable. You grep for “ Intel”, for “ dx7”. Nothing happens. You delete some files… Nothing happens. Well, you know that AAA games might want to bundle some resources in weird places, and this is a Mac port of a Windows game, so you know, maybe things are odd.\n Still, you end up finding a “render.bar” file, and moving that one crashes at startup. That’s vaguely good. You open that file in  Hex Fiend, because that usually can tell you a few things about binary files. And well, it does. Some of that data is readable text. Some of it is shaders. But most of it is oddly separated by empty spaces…\n  “Obviously, that’s UTF-16”, you exclaim ! This is originally a Windows game, it makes perfect sense they’d store text in UTF-16, wasting basically half the space of the 30Mb data file. After all, Windows loved UTF-16 (though it  shouldn’t), and why not use that and ASCII shaders in the same file. Perfectly sensible idea!  (Not shown: this took me like a day to realise)\n Anyways. Hex Fiend actually has an option to parse bytes as UTF-16, so you grep for dx7. That gives you a few hits. You replace all of that with dx9, which also shows up in that data occasionally, you save and you boot up the game. Welp. The logs don’t even say “dx9”. That’s probably defined elsewhere.\n  Let’s try something else. You assume the game is detecting graphic cards, and you have Hexadecimal identifiers in the logs (in my case, 0x8086 — Intel, and 0x2773). Grepping for “8086” in Hex Fiend hits somewhere, and some of that text looks encouraging. Intel 9 Series is the GMA 950 series, and it probably didn’t run Age 3 very well.\n  Some numbers there look like identifiers of cards (2582, 2592), so maybe changing those will do something. You’ve made a copy of the file anyways, so it can’t hurt to try.\n Sadly, that too is a dead end. Truth is, you’re looking at the wrong file. Thankfully, I can tell you that because I’ve spent too much time on this and tried  way too many things. This bloody thing took upwards of 20 hours. And that’s not counting the time to take all those screenshots…\n Anyways, the correct file is “DataP.bar”, and if you replace IDs smartly, the logs will show something completely new:\n  Of course, in-game, you’re still stuck on the “Low” setting, so the logs aren’t lying. You might have hoped for “Medium”, but  alas, no.\n This seems to be as much as you can do from hacking the data. Time to bring out the big gun.\n  So, with all else failing, we’ve only got one last thing to do: change the executable itself (aka “cracking” back in 2005). Nowadays, I suppose we’d just call it hacking, but the word has stuck in the game piracy sphere (not that I’ve  ever been anywhere near that, of course).\n It’s time for the actually interesting part of this article (yeah we’re over a thousand words in already, but are you not entertained?).\n  Our tool of choice for this step will be a disassembler: an application that takes the binary code of the executable and turns it into readable (haha) assembly code. The most famous one is IDA Pro, but it’s crazy expensive and I’m not sure it runs on a Mac, so I’ll go with  Hopper. It’s not free (it’s actually 90$), but you can freely use it for 30 minutes at a time with mostly all required functionality. I won’t go into too many details about how the interface looks, as the  Hopper tutorial  ...\n First, a note: this took me like 5 days to get right, and many unsuccessful attempts were made. I’ll mostly only show the successful path, so it might look kind of magic. But this is  hard. Don’t worry if you’re struggling.\n And another note: “cracking” is generally illegal and/or done for illegal purposes. This is a rare example of a rather legitimate use case which is also fairly “white hat”, so that’s nice. I do believe it’s technically illegal / against the EULA, but this a obviously a  force majeure case. Anyways, please pay for things you enjoy, and only those because anti-consumerism is cool.\n  This can, perhaps surprisingly, be the most tricky part. You have all of the disassembled code, and no idea where to look. True, some games ship with some level of debug symbols, making function names readable, but this one doesn’t. Hopper gives you “sub_a8cbb6” and you’ll have to make do with that.\n Thankfully, we do have a head start: our  log file. It’s quite likely that writing to the log uses  string literals, which basically means it’s ASCII hardcoded in the executable. That’s something you can grep for, because no amount of compiling will delete it (code obfuscation might hide it though. Thankfully, this isn’t the case here). Grepping for string literals is usually the first thing you’ll do when disassembling something. So let ’s go ahead and type “found vendor ”in the Hopper search, and  ...\n  On its own, this really wouldn’t move you forward too much. But since the adress of this “literal string” is hardcoded, you can actually find references to it. Hopper does that for you in the green bits on the right : “DATA XREF=sub_1d5908+1252”. Double-clicking on that will take you to the  sub_1d5908 procedure, our hero of the day.\n  There we find assembly code. Unlike what you may think, assembly code is very easy to read. The hard part is understanding it.\n Hopper uses ‘Intel Syntax’ by default, which means the first operand is the destination, and the second one is the source. On the highlighted line, you see  mov dword [esp+0x1DC8+var_1DC4], aXmlRenderConfi. Let’s unpack that.\n  mov is the MOV instruction, famously  turing-complete on x86. It moves (well, it copies) data from A to B, which basically means it reads A and writes it at B. Given what I’ve told you above,  aXmlRenderConfi is A, and  dword [esp+0x1DC8+var_1DC4] is B, the destination. Let’s unpack that further.\n aXmlRenderConfi is actually Hopper helping us. The truth is, this is an alias for the memory address of the string literal we clicked on a few seconds ago. If you split the window and look at things in Hex-mode (the  preferred hacker mode anyways), you’ll see  88 18 83 00 on the right there.\n  If you ‘reverse’ that in just the right way, it’s 0x00831888, the memory address of the string literal (it’s even highlighted in yellow in one of the above screenshots). So that’s one mystery solved: we’re MOV-ing, i.e. writing, the address 0x00831888.\n Why is it spelled  88 18 83 00 and not  00 83 18 88 ? Well, this is because of  Endianness, a rather arcane topic which usually has little impact. It’s just one of those things that make people go “you know, computers don’t work” (I’ve looked for a citation for this, and failed, but I know it’s out there). What it means for us is that all numbers we’ll look at today have this problem.\n You might have noticed that I’ve said we wrote the address, and this is right: we don’t actually care about the content, which happens to be a NULL-terminated string literal. We’re writing the address because code down the line will refer to that address. It’s a pointer.\n What about  dword [esp+0x1DC8+var_1DC4] then? This one is trickier.   dword technically means we are operating on “double-words”, aka 16*2 bits. Which means we’re copying 32 bits. Recall: our memory address is  0x00831888, which is 8 hexadecimal characters, and each hexadecimal character can take 16 values, which is 4 bits of data. So that ’s 8*4 = 32. By the way, that ’s where “32 bits ”in computer systems comes from. If we were using 64 bits, our memory address would be written 0x001122334455667788,  ...\n Now, what’s that bracketed bit? The brackets mean we’ll compute whatever is inside, and treat it like a pointer. Our MOV will thus write at whatever memory address this evaluates to. Again, let’s break it down (and don’t worry, once this is done, you’ll basically know how to read assembly code in Intel Syntax).\n esp is a  Register, which is the closest equivalent of a variable in assembly. The x86 architecture has plenty, they’re somewhat distinct in their usage, but we generally won’t care much. You can find details  here. Just know that there are special registers for floating point, and we also have “flags” which are used for comparisons and such. The rest is simply numbers written as hexadecimals, and Hopper has reprocessed them somewhat to help.  var_1DC4 is  -0x1DC4, you can see that at the  ...\n So, to recap, we’re writing the address of our string literal to “esp+4”. This is correct information, but extremely useless. What does it mean?\n This is the tricky bit when reading Assembly code: figuring out what this is supposed to be doing. Here, we have a head start: we know that this is probably logging something. So we can expect a function call that logs stuff. Let’s look around.\n  There are several similar calls above, and the a  call instruction, which calls a procedure. Hopper would usually say it (not sure why it doesn’t here), but what is happening is basically that we’re setting up the arguments for our function call. If you click around the different sub-calls, you’ll see stuff named imp___jump_table___Z22StringVPrintfExWorkerAPcmmPS_PmmPKcS_. This is a  name-mangledfunction name, and “Printf ”is enough to now that this indeed prints things. Don ’t care  ...\n  At this point, you’ve completely lost track of what you were doing: trying to make the game acknowledge that your 2015 graphics card is indeed powerful enough to run a 2005 game. Let’s recap. We’ve found the place where logging takes place. If we’re lucky, this is also the place where the code that checks our settings and our graphics cards capabilities is. And, thankfully, we are lucky (there’s a pretty good chance I couldn’t write this article otherwise).\n To get the bigger picture, we’ll use Hopper’s Control Flow Graph feature, which breaks down code in little blocks and draws arrows to represent the various jumps. This is much easier to grok than the actual assembly which is often terribly out of order.\n  Our logging call is in the middle of a terribly long function, because again, that’s what AAA games do. This is the point where one would look around for other string literals and Hopper “hints”, hoping to find something. I’ll give you some pointers (eh). You’ll see at the top of the procedure the rest of the logging, and down below some interesting bits about “forcing dx7” or “Very High” settings and a pixel shader version issue…  Which we have.\n The log of our “hacked” data said we had pixel shader version 0.0 which was incompatible with the “High” setting. That code lives in the bottom-left of our function, and if you squint you’ll see something peculiar (highlighted in terrible style by yours truly): this is just 4 times the same code, for each of “Very High”, “High”, “Medium” and “Low”. And yes, this took me hours to see.\n  The only differences are that we are writing “0x0”, “0x1”, “0x2” and “0x3” in a bunch of places. This looks suspiciously similar to our Settings file from earlier and the  optiongrfxshaderquality setting (well, you might not know that yet. But it does, believe me).\n At this point, we could try several things, and indeed I did. But to cut this short — he says, now almost 3000 words in — we’ll do the right thing: figure out why our pixel-shader check fails. Let’s look for a branch. The logging block is linear, so it must be before.\n  Indeed, right above that is a  jb instruction, a jump instruction (think “goto”). This is a “ conditional jump”, and the condition is “ if below”. The way Assembly ‘ifs’ work is through the  register flags I briefly mentioned before. Just know that usually you simply have to look at the instruction above: that one probably sets the flag. That instruction is often  cmp or  test , but here it’s  ucomiss . That’s barbarian. It’s also easy to Google:  ucomiss. It ’s a compare instruction  ...\n Now how do we fix this? Well, this compare instruction compares with the value in  xmm0 , which is set in the line above:  movss xmm0, dword [eax+0xA2A8] . MOVSS is a special “move” instruction for floating-point registers, and we’re writing 32 bits from whatever eax+0xA2A8 evalutes to.\n   We’re finally ready to l33t our way in the game’s High setting. What we want is to take the “red” path in the CFG above, and skip this “wrong pixel shader version” logic. We can achieve that by making the comparison succeed, by reversing the jump condition, but we have one more trick: the code is setup such that deleting the jump will make us take the “red” path. Let’s simply replace the jump with a  nop, an operation that does nothing (you can ’t simply delete —or add —data  ...\n I recommend switching out of CFG for this, as Hopper kinda freaks out otherwise. If you do it right, you’ll see some red bits in the Hex window.\n  Those red bits are the changes we’ve made. At this point, if you’ve paid for Hopper, you can simply save the file. But I haven’t, so I’ll open the executable in Hex Fiend, find the proper region (by copying a section from Hopper in the Find tab of Hex Fiend), and modify it manually. Be careful here, you can break everything, so I’d recommend copying the original executable somewhere.\n With that done, start the game, hop on to the settings… And Hurray, you can choose “High”. Can’t choose “medium” though. And you can’t use the high shadow settings. But still, progress !\n   Truth is, there is a better way to fix this. Our solution worked somewhat, but we can do better by making the condition succeed in the proper way: by actually making the game think our graphic card has 2.0 capability.\n If you recall, the game loaded up the value at  eax+0xA2A8 . We can use Hopper to figure out what is originally written there. What we’re looking for is an instruction where 0xA2A8 appears in the ‘destination’ operand (I use 0xA2A8 because it looks quite specific and we can’t be sure the same register will be used elsewhere). Hopper highlighting is very useful here, as we can simply click on 0xA2A8 and look for yellow bits in the CFG.\n  Victory is found a fair bit above: we are writing the value of some floating-point register, as expected. I confess I don’t really understand what is happening right before that (best guess: the game checks for texture compression capabilities), but that’s not really important. Let’s write “2.0” and be on our way.\n To do that, we’ll use Hopper’s “Assemble instruction”, and then do the same hex-fiend manipulation.\n  You’ll notice that something weird happened: we’ve “eaten” the  jb instruction. That’s because our new instruction takes up more bytes than the one before, and as said above we can’t add or delete data from an executable to preserve offsets. So Hopper had no choice but to destroy the  jbinstruction. This could be a problem, and we might fix it by actually moving the instruction above (we no longer need to set up xmm3 after all). Here, it ’ll work anyways because we ’re taking the branch we wanted  ...\n If you start things up… Well, nothing’s really changed. My best guess is that the Intel 9 series is not fast enough and the game complains. It’s no biggie, because what we really want is that “Very High” goodness.\n What was the most powerful card around 2004? The NVIDIA GeforceFX 6800. Let’s trick the game into believing that’s what we have.\n   What we know is that the game uses Hex codes to identify graphics card, and it’s fetching stuff from data files. We know that this must take place in the function we’ve been looking at (or at least it’d be really weird if it didn’t). So we should be able to find the code doing it. Still, this might be tricky, since we don’t really know what to look for.\n We do have one hint: the options are acting weird, with this “Low/High but no Medium” business. So perhaps there is other code handling this “Very High”, “High”, “Medium”, “Low” thing. And indeed, there is, in this very function. It’s much earlier in the CFG, and it looks interesting.\n  We can assume that the raw data is some form of XML, because that’s quite likely given there’s several other data files that are XML. And XML is basically a bunch of pointers, and attributes. So this code here is likely checking for some XML attributes (indeed below there is a “expected one of ID, Very High …” which looks a lot like a file sanity-check). We can kind of imagine an XML structure like that, with booleans for the shader qualities:\n  The very interesting bit is on the left of the CFG (well, it could be on the right for you, but it’s on the left in the above screenshot): we see the same  var_CC which is used by the code that logs the device ID. So  ebp+var_CCprobably refers to our device ID, 0x2773. The weird thing is the first “check ”doesn ’t show a string literal, but that ’s a Hopper bug: the adress 0x0089da8e contains Hex Data 69006400, which is UTF-16 for “id ”(the fact it ’s UTF16 is probably why Hopper cannot grasp  ...\n You know what? Let’s start a debugger and check it out for real.\n  Open a terminal window, and start lldb (just type lldb and enter). First we need to tell LLDB to target Age 3, then we can run the game by calling  run . So far, so good. The game runs, nothing useful is gained.\n  What we need to do is add a breakpoint: we want to stop the execution when we reach the code above to check our assumptions. We don’t have source code, but that doesn’t matter: we can set breakpoints at a memory address. And we do have the address of the code. Let’s break at the MOV call that fetches “id”, its address is 0x001d5e68. Setting up the breakpoint is as easy as  br set -a 001D5E68. When we run, the game stops there and LLDB shows the disassembly (in AT&amp;T syntax, not Intel,  ...\n  To move further, let’s “step instruction”. The shortcut is  ni . After a few times, you’ll notice you’re back where you were. This is a loop! It makes perfect sense: we’re probably iterating over some XML. Hopper was in fact showing this, if you follow the CFG you’ll see a (possible) loop.\n  Its exit condition is that  ebp+var_1D84 must be non-null. And we see some code setting that right where I highlighted the interesting  var_CC stuff.\n  We’ll look at registers with  reg r , and our memory value with  mem read $ebp-0x28 .  eax indeed contains 0x2773, and the value in memory is now 0x00A0. If you  thread c a few times, you’ll see that we’re iterating different IDs, checking for a match. At some point it matches, exits the loop, and the game starts. So now we know how to control this.\n Remember the log file: it found both device and vendor. So there’s probably a similar loop for the vendor somewhere else. Indeed, it’s quite similar and right above in the CFG. The loop is slightly simpler, and we’re looking for “vendor”.\n This time the comparison is with  var_D0 . This is indeed used by the logger for the vendor ID. If we put a breakpoint there and check things out, we see our familiar 0x8086 in  eaxand we’re comparing against 0x10DE at the moment. Let’s write that into  eax and see what happens.\n  So 0x10DE is NVIDIA. In fact, looking at the data file would have hinted at that… But that’s just not fun. Now the question is: what’s the identifier of the GeforceFX 6800? We could also use LLDB and just try every identifier, but that’ll take some time (as there are many, I’ve tried for a while). So let’s look into render.bar this time.\n  Well, this is a bit of a messy file. But after the Geforce FX 6800 tags, you can see a bunch of identifiers. One of those is probably a match. Let’s try 00F1.\n The simplest way to test this is through LLDB by setting the appropriate breakpoints — I’m skipping, but 00F1 works (thankfully).\n At this point, the question becomes “How do we make this permanent?” It seems like a simple way would be to change the  var_CC and  var_D0 values to 0X00F1 and 0X10DE, respectively. We just need to get some code-space to do that.\n One simple solution is to NOP one of the logging calls, for example the subsystem call. It’ll free up a few dozen bytes, more than needed. Let’s select it all, and NOP it. Then we simply need to MOV some things in our variables: Assemble  mov dword [ebp+var_CC], 0xF1 and  mov dword [ebp+var_D0], 0x10DE .\n  Let’s start up the game. Now we’re getting somewhere: you can pick from Low, Medium or High, and you can activate High shadows.\n  But we still can’t get Very High, and that makes Afroman unhappy. What’s going on?\n  Right. As it turns out, the Geforce FX 6800 is supposed to support pixel shader version 3.0, and we’ve configured ourselves for 2.0. This is a simple fix at this point: we just need to write float 3.0 in  ebp+0xA2A8 . That’s 0x40400000.\n  And that’s the end of the road. Thank FUCK, and thanks for reading.\n As a freebie, since every resource I’ve found online is broken, terrible quality or incomplete, here’s what the settings actually look like in-game.\n Medium is acceptable, but the lack of shadows hurts. From what I can tell, Very High mostly adds a completely different LUT (good explanation at “Color Grading”  here), distance fog, perhaps even a different lighting model altogether? It looks quite different, which is somewhat strange.\n  The blog I’ve linked just above is excellent at breaking down modern rendering pipelines:  http://www.adriancourreges.com/blog/\n Have a look at 0 A.D., an open-source (the libre kind, not the Docker kind) RTS games in the same genre:  https://play0ad.com . It needs devs.\n If you want to know more about the XMB format, you can look at  0 A.D.’s code for it. I haven’t actually checked, but I’m pretty sure it’s the same format, because the guy who wrote the  XMB decoder for Age 3 on Age of Empires heaven (that takes me back, though I was more active on RoN back then) is the same guy who committed those files in 2004 in the 0 A.D. source code. So that’s a fun bit of code paleontology. Thanks for all your work Ykkrosh.\n I also distinctly remember reading a great tutorial on how to use Hopper, but I couldn’t find the link again. If somebody knows what I’m talking about…\n Finally, I’d like to plug the Cosmic Frontier project: a remake of the classic Escape Velocity series (Override specifically, but Nova-compatible). It’s such a great game, and it’s such a shame it’s not more well known. They’ve got a  kickstarter running, and the lead dev has a very interesting  dev blog where they use Hex Fiend to reverse-engineer the data formats of the original game. It’s a great read. If you think  this was crazy, in one article they:\n Start up an emulator for Classic Mac to be able to use long-deprecated APIs to read the encrypted data file.\n Yeah. There are truly dedicated people out there, and I do wish this project succeeds, because EV Nova is perhaps my favourite game of all time.", "posttime": "2020-05-03 03:34:22", "tags": "破解,iii,age,游戏,game", "title": "帝国III在着色器质量设置上的破解时代", "title_en": "Cracking Age of Empires III over shader quality settings", "transed": 1, "url": "https://medium.com/@lancelot.deferriere/cracking-age-of-empires-iii-over-shader-quality-settings-7f729528cf1d", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["破解", "iii", "age", "游戏", "game"]}, {"category": "", "categoryclass": "", "imagename": "421e964119b476daab1c1514b735f7c3.jpeg", "infoid": 1000397, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这场大流行对组织的生存是一个真正的证明。虽然许多组织都屈服于冠状病毒造成的经济影响，但也有少数组织在逆境中获得了巨大收益。例如，Zoom和Citrix等品牌报告称，随着世界选择远程连接，收入和季度收益都有所增加。同样，像Gilead这样的制药公司也走上了盈利的道路。\n“反脆弱”这个词是由纳西姆·塔勒布首创的，简而言之，它的意思是“从混乱中获益的东西”，正如他的书“反脆弱”中所描述的那样。现在反脆弱的公司可能不是故意设计或建造成这样的，但它们在正确的时间拥有正确的产品和服务。其他组织，如微软和亚马逊，部分是反脆弱的，对远程连接的需求增加，云基础设施的升级和Essential.。\n事实证明，拥有一种或多种在大流行时期具有抗脆性的产品是有益的。即使有十种易碎产品受到冲击，一种或几种防脆产品也可以弥补损失。然而，这种收益可能是暂时的，因为随着大流行的平息，需求会随着时间的推移而下降。\n反脆弱性并不局限于当前所需的成功产品和服务。提前思考，并制定强有力的应急计划，可能有助于将经济崩溃的愤怒降至最低。温布尔登也许是拥有强大应急计划的一个很好的例子。在过去的17年里，作为“不可抗力”条款的一部分，温布尔登每年支付200万美元的大流行保险，并将获得1.41亿美元的赔付。温布尔登可能不会从支出中获益。\n品牌应该从别人的错误和他们为防止未来后果而采取的行动中吸取教训。温布尔登在2003年SARS冠状病毒疫情后痛苦地吸取了教训。其他体育和大型年度赛事可以通过良好的应急计划开始保障自己的未来。\n就个人而言，冠状病毒大流行的启示是，拥有一种或多种反脆弱的产品、服务、规划和想法可以帮助在逆境中变得更强大。对于个人来说，拥有多种技能和/或敏捷性来学习和适应进步可能有助于变得抗击脆弱。", "note_en": "The pandemic is a real testament to organizations for their survival. While many are succumbing to the economic impact caused by the COVID-19, there are a handful number of organizations that are making a substantial gain out of the adversity. For example, brands such as Zoom and Citrix have reported an increase in revenue and quarterly earnings as the world chooses to stay connected remotely. Similarly, pharmaceutical companies such as Gilead is on a path to make profit.\n The word antifragility was coined by Nassim Taleb and in simple words, it means “things that gain from disorder ”as described in his book, Antifragile. The companies that are antifragile now were perhaps not intentionally designed or built to be one, but they possess the right products and services at the right time. Other organizations such as Microsoft and Amazon are partially-antifragile with an increase in demand for remote connectivity, upscaling the cloud infrastructure and sales of essential  ...\n Having one or more products that are antifragile in times such as pandemic is proving to be beneficial. Even if ten fragile products take the hit, one or more antifragile products can compensate for the losses. However, the gain could be momentary as demands decline over time as the pandemic settles.\n Antifragility is not limited to successful products and services that are need of the hour. Thinking ahead-in-time and having a strong contingency planning could help minimize the wrath of a collapsing economy. Wimbledon is perhaps a good example of having a strong contingency plan. For the last 17 years, Wimbledon paid $2 million dollars per year in pandemic insurance as part of the “force majeure ”clause and will be receiving $141 million as a payout. Wimbledon might not gain from the payout  ...\n Brands should learn from the mistakes of others and the actions taken by them to prevent future consequences. Wimbledon learnt the lesson the hard way after the 2003 SARS-CoV epidemic. Other sporting and large annual events could start securing their future with good contingency plans.\n Personally, the takeaway from the coronavirus pandemic is that having one or more antifragile products, services, planning and ideas could help emerge out stronger in adverse times. In individuals, having multiple skills and/or agility to learn and adapt to advancements could help being antifragile.", "posttime": "2020-05-03 03:34:11", "tags": "暴露,exposed,产品,antifragile", "title": "这场大流行暴露了反脆弱性。", "title_en": "The pandemic has exposed antifragility", "transed": 1, "url": "https://medium.com/@santhoshsundar/the-pandemic-has-exposed-antifragility-c37dc7ae4855", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["暴露", "exposed", "产品"]}, {"category": "", "categoryclass": "", "imagename": "b784fdd044b45744e9e7f4ab7fa86ef3.png", "infoid": 1000396, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "静态站点是最好的。它们是最安全、最快的网站。它们非常适合匿名用户，你会希望内容编辑有一个安全和隐藏的后端，他们可以在那里管理内容-但内容可以在其他地方提供。\n在此基础上进行搜索可能会更具挑战性。对于像lunr.js这样的本地搜索(以及与之集成的Drupal模块)，有不同的解决方案，但这是相当有限的。也就是说，它将创建一个本地索引，在那里您可以让一些JS来查看它，但这无法与成熟的搜索引擎(如Elasticsearch)相匹敌。\n在这篇博客文章中，我将与大家分享我们建立的一个演示网站，作为一个大得多的网站的概念证明。我不打算详述静态站点的优势，而是要与大家分享指导我们的高级概念，以及一些技术提示。虽然具体的细节与Drupal无关--我们的客户站点在Drupal中，因此围绕它进行构建非常方便。但是你真的可以用任何一种语言做到这一点。\n使用静态站点，部署和恢复部署很容易。如果出了什么差错，这不过是git推送或git恢复而已。但是搜索怎么办呢？正如我们已经提到的，我们希望继续使用Elasticsearch来搜索聚合(也就是。方面)、拼写检查等。但是，我们如何支持，例如，在部署中回滚-确保搜索始终只通过部署的静态站点中存在的内容进行搜索。谢天谢地，Elasticsearch支持索引克隆，所以我们.。\n默认索引是Drupal将连接到的索引，它将是aread和write。也就是说，您可以将其视为一个“主”索引，将从该索引中获取快照。\n当我们想要创建一个新的静态站点时，我们还会创建默认索引的克隆。这将是一个只读索引。\n我们负责调用Elasticsearch的JS应用程序应该知道只读索引的名称。因此，如果我们将部署回滚到以前的版本，JS代码将连接到正确的索引。\n简单介绍一下Elasticsearch实例及其对外公开情况。就像我们将Drupal放在后端，远离公众视线一样，我们也可以用Elasticsearch做同样的事情。例如，当我们在Google Cloud上托管Elasticsearch实例时，我们可以使用负载均衡器来提供一个面向公众的SSLed URL-反过来，它将使用所需的任何类型的防火墙规则调用Elasticsearch，例如防止任何管理员类型的请求访问该实例，或者阻止任何请求.。\n实际上，我们开始研究Tome，这是一个允许将Drupal站点导入静态站点的Drupal模块。虽然它工作得很好，而且我确信使用它会有好处，但我认为在我们的情况下，并没有真正需要Drupal本身来提供导出。我们也可以使用其他开源工具，它们已经存在好几年了。\n然后开始了一场比预期更长的试验，并对HTTrack和wget进行了比较。虽然我们最终还是没有去，但分享一些我们的经验是值得的。首先，我们尝试了HTTrack，我们已经用它来帮助我们将一些老网站移到静态状态，它做得很好。令人惊叹的凯伦·史蒂文森(Karen Stevenson)也就此写了一篇很棒的帖子，内容更详细。HTTrack给我的印象是，对于一个拥有看起来像看起来一样过时的Asite的工具来说，它工作得出奇地好。..。\n我们从一开始就做了一件重要的事情，那就是以realclient站点为例。这立即体现了最大的挑战-快速出口不稳定的网站。通常情况下，当存档一些站点时，导出甚至需要一个小时也是完全可以的。但如果我们考虑的是一个实时网站，它会随着后台内容的改变而定期更新--必须等待这么长的时间是有问题的。\n这就是我们在HTTrack和wget之间来回跳跃的地方。让我们来看看我们得到的结果。我将隐藏真实的URL，这样您就不会像我们那样滥用我们客户的网站！：)。\n37分钟可保存约450 MB的内容(HTML以及所有资产、图像和文件)。\n那次尝试是在我本地的电脑上进行的。所以我们旋转了一个Google Cloud实例，看看从一个有更强大的互联网连接的服务器执行这个实例是否会快得多--但它不是。\n因此，我们决定排除所有用户生成的文件(图像、PDF等)。其想法是，文件将被上传到某些存储服务，如AWS或Google Cloud，并从那里提供服务。也就是说，当内容编辑器在Drupal中上传新文件时，它将“远程”保存，而不是将其保存在服务器上。\n这样做节省了相当多的时间，使我们的120MB内存减少到了20分钟。\n然后我们检查是否可以增加并发连接的数量。HTTrack有几个选项，特别是名称可怕的--禁用-安全限制，它应该允许我们轻松地对我们自己的站点进行DDOS，或者通过设置conne的特定计数来实现", "note_en": "Static sites are the best. They are the most secure and fastest of sites. Theyare perfect for anonymous users, where you would want content editors tohave a secure and hidden backend where they can administer the content - buthave the content served elsewhere.\n Having search on top of that can be a bit more challenging. There are differentsolutions for having a local search like lunr.js (and aDrupal  module to integrate with it), butit’s quite limited. That is, it will create a local index where you could havesome JS to look into it, but that is no match to full-blown search engines suchas Elasticsearch.\n In this blog post I will share a demo website we’ve built as a proof of conceptfor a much larger site. I’m not going to dwell on the advantages of staticsites, instead I’m going to share the high-level concepts that guided us, alongwith some technical tips. While the specific details have nothing to do withDrupal - our client’s site is in Drupal, so it was convenient to build itaround it. But you can really do it with any language.\n    With static sites, deploying and reverting deploys is easy. It’s not much morethan  git push or  git revertif something went wrong. But what about search?As we ’ve mentioned, we want to keep using Elasticsearch for things likeaggregations (a.k.a. facets), spell checks, etc. But how can we support, forexample, a rollback in the deploy - making sure that search is always searchingonly through the content that exists in the deployed static site. Thankfully,Elasticsearch supports index cloning, so we  ...\n The  default index is the one that Drupal will connect to, and it will be aread and write. That is, you can think of it as a “master” index, from which asnapshot will be taken.\n When we want to create a new static site, we would also create a clone of thedefault index. That will be a read-only index.\n Our JS app that will be in charge of calling Elasticsearch should know aboutthe name of the read-only index. So if we rollback a deploy to previousversions, the JS code will connect to the right index.\n A word about the Elasticsearch instance and its exposure to the outside. In asimilar way to how we place Drupal in the backend, away from the public eye,we could do the same with Elasticsearch. For example, when we hostElasticsearch instance(s) on Google Cloud, we can use a  loadbalancerto provide a public-facing,SSLed, URL - which, in turn, will call the Elasticsearch with any kind firewallrules needed, such as preventing any admin-type requests from hitting theinstance, or prevent any request  ...\n  We actually started our research looking into Tome, a Drupal module that allowsexporting a Drupal site into a static site. While it did work nicely, and I’msure there could be benefits to using it, I’ve thought that there wasn’t reallyany specific need in our case for Drupal itself to provide the export. We mayas-well use other open source tools, which have been around for quite a fewyears.\n Then started a longer than anticipated trial and comparisons between HTTrack and wget. While we did eventually go withwget it’s worth sharing some of our experience. First we’ve tried HTTrack.We have already used it to help us move some old sites to be static, and it didthe job well. The amazing Karen Stevenson also wrote a  greatpostabout it that goes into more details. My impression from HTTrack is that it works surprisingly well for a tool that has asite that looks as outdated as it looks.  ...\n One important thing we’ve done from the get go was take as example a realclient site. This immediately manifested the biggest challenge - exporting astatic site quickly. Normally, when archiving some site, it’s totally fine forthe export to take even an hour. But if we’re thinking of a live site, thatregularly updates as content in the backend is changed - having to wait so longis problematic.\n This is where we were jumping back and forth between HTTrack and wget. Lets seesome of the results we got. I’m going to hide the real URL, so you won’t abuseour client’s site as much as we did! :)\n   37 minutes for about 450 MB of saved content (HTML along with all the assets,images, and files).\n That attempt was on my local computer. So we spinned a Google Cloud instance,to see if executing this from a server with a more powerful internet connectionwould be much faster - but it wasn’t.\n So we decided to exclude all user-generated files (images, PDFs, etc). The ideawould be that files would be uploaded to some storage service like AWS orGoogle Cloud and be served from there. That is, when a content editor willupload a new file in Drupal, instead of saving it on the server, it will besaved “remotely.”\n  Doing so shaved quite a lot, and got us down to 20 minutes with 120 MB.\n Then we checked if we could increase the number of concurrent connections.HTTrack has a few options, notably the scarily-named  --disable-security-limitsthat should allow us to lightly DDOS our own site, or by setting a specificcount of connections (e.g.  -c16). However, we didn’t seem to see a change inthe number of connections.\n Then we tried to update an existing static site by executing  httrack --update. This one was already considerably faster, and got us down to 4.5minutes, and this time we also saw multiple active connections.\n  After that I started looking into wget, running  wget --recursive --page-requisites --adjust-extension --span-hosts --convert-links --restrict-file-names=windows --domains example.com --no-parent --reject jpg,jpeg,png,zip,pdf,svg https://example.com/ (see gistfor explanation on each option).\n  After spending many hours digging in different forums and StackOverflow, I’vedecided to go with wget, but I do think HTTrack should be considered if yougo with a similar solution. I believe it’s a “your mileage may vary”situation.\n One shortcoming I found with wget, was that unlike HTTrack I couldn’t tell itunder what name to save the HTML file. Instead of  /content/foo/index.html Igot the file as  /content/foo.html. Do you know how I solved it? With a hackequally nice as it’s ugly. On Drupal I’ve changed the path aliases pattern tobe  /content/[node:title]/index.html. I hope maybe someone will point me to a way ofgetting wget to do it for us.\n   My personal belief is that technical posts should put in the hands of theirreaders the means to get their hands dirty, experiment, and collaborate. So hereyou go, and here’s the recipe for the demo repo:\n It was scaffolded out of our  Drupal 8 &amp; 9Starter and as such you can easilydownload and try yourself as ddev is the only requirement. All commands areexecuted from inside the ddev container - so no special installation isrequired.\n Follow the installationsteps, and it should result with a Drupal site, and dummy content. Installationshould give you an admin link, but you can always grab a new one with  ddev . drush uli.\n Next, let’s create a static site with  ddev robo snapshot:create. The  Robocommandis responsible for clearing Drupal’s cache, wget-ing the site and massaging ita bit, cloning the Elasticsearch index, and is even nice enough to ask you ifyou’d like to run a local HTTP server to see your new static site. Notice howthe search is still working, but if you look inside the network panel, you’dsee it calls a specific index. That’s our “snapshot” read-only index.\n  Go ahead and make some changes to your site. Add/ delete content, or evenswitch the theme to Bartik.  ddev robo snapshot:create once more. Note that youmight need to hard refresh the page in the browser to see the changes.\n   I’ve written the JS application for the search in Elm. We fetchdata from the correct index URL, and then we showthem in a paginated list. Like any app we’ve written in Elm, It Simply Works™.\n As Elm is already bundledwith the ddev container, we have a simple  Robo command to watchfor changes and compile them to the right place inside Drupal.\n Two important things we do when create a static site, is find &amp; replace a  JSvariablewhich determines if Elm is operating in Drupal context, or static site context.With this knowledge we could have different functionality. For example, in theDrupal context, we could have shown an Edit link next to each result. At thissame time, we also change the URL of the index, to the cloned one, so our JS appalways calls the right URL.\n  I believe we have been successful with our attempts, and the requirements wehad were well answered. Going with a static site provides considerablesecurity, performance and stability gains. Having JS to communicate with asnapshot-specific Elasticsearch index wasn’t too hard and it’s working nicely.Naturally, in the demo repo the app is quite basic, but it lays the foundationfor fancier features.\n The biggest challenge of exporting the static site in a speedy manner boilsdown to excluding any user generated assets or pages. But still, some exporttime is always to be expected. Finally having Robo commands executed insideddev is a convenient way to automate and share with other devs on the team.", "posttime": "2020-05-03 03:12:30", "tags": "elasticsearch,sites,内容,site", "title": "使用Elasticsearch的静态站点", "title_en": "Static Sites with Elasticsearch", "transed": 1, "url": "https://www.gizra.com/content/drupal-static-elasticsearch/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["sites", "内容", "site"]}, {"category": "", "categoryclass": "", "imagename": "394b52164dcab22052e41dca0334b63d.png", "infoid": 1000395, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您有没有想过编写自己的编译器？…。什么事？…。你当然有！我一直想尝试编写编译器，随着WebAssembly最近的发布，我有了一个完美的理由来尝试一下。\n我最初的计划是发明我自己的编程语言，创建一个面向WebAssembly的编译器，并在FullStackNYC分享我的经验。第一部分进行了计划，我花了很多时间来构建、修补和改进我的编译器。不幸的是，我计划的最后一部分进行得不太顺利。长时间的延误和最终的取消意味着我终究不能去纽约了。😔😢😭。\n因此，与其浪费所有的工作-我想我应该把我的演讲写成博客帖子-所以这篇文章的阅读时间就是‘19分钟’。所以请坐，请自便，我们要开始…了。\n如果你以前没有听说过WebAssembly，并且想要一个真正详细的介绍，我会向你彻底推荐林克拉克的卡通指南。\n在这篇博客文章中，您将了解WebAssembly的“是什么”，但我确实想简要介绍一下“为什么”。\n上图显示了在浏览器中执行某些JavaScript代码的简化时间线。从左到右，代码(通常是以最小的乱七八糟的形式交付的！)。被解析成AST，最初在解释器中执行，然后逐步优化/重新优化，直到它最终运行得非常快。现在JavaScript速度很快--只需要一段时间就能跟上速度。\n底部的关系图相当于WebAssembly。用多种语言(RUST、C、C#等…)编写的代码。编译为以二进制格式交付的WebAssembly。这非常容易解码、编译和执行-提供快速和可预测的性能。\nWebAssembly在过去的一年里引起了不小的轰动。如此之多，以至于在Stack Overflow的开发者洞察力调查中，它被评为第五种“最受欢迎”的语言。\n考虑到对于大多数人来说，WebAssembly是一个编译目标，而不是他们将直接使用的语言，这是一个有趣的结果。\n这是我最初提出FullStackNYC演讲的部分动机。WebAssembly的技术方面真的很吸引人(让我想起几十年前的8位计算机)，然而大多数人永远没有机会涉足WebAssembly本身-它只是一个他们编译到的黑匣子。\n编写编译器真的是一个很好的机会，可以深入研究WebAssembly的细节，找出它是什么以及它是如何工作的。而且这也很有趣！\n最后一点，我的目标从来不是创建一种功能齐全的编程语言，也不是一种真正好的编程语言。我的目标是创建一种“足够的”语言，使我能够编写一个程序来呈现曼德布罗特集(Mandelbrot Set)。该语言是使用我的编译器编译成WebAssembly的，该编译器是用打字脚本编写的，并在浏览器中运行。\n我最后给语言鸿沟打了个电话，如果你愿意，你可以在网上玩。\n在处理编译器之前，我们将从更简单的东西开始，创建一个最小的WebAssembly模块。\n下面是一个发射器(该术语用于描述为目标系统输出指令的编译器部分)，它创建最小的有效WebAssembly模块：\n常量magicModuleHeader=[0x00，0x61，0x73，0x6d]；常量模块版本=[0x01，0x00，0x00，0x00]；导出常量发射器：发射器=()=&gt；Uint8Array。从([.。MagicModuleHeader，.。ModeVersion])；\n它由两部分组成，“Magic”头(即ASCII字符串\\0asm)和版本号。这八个字节形成有效的WebAssembly(或wasm)模块。更典型的情况是，这些文件将作为.wasm文件传送到浏览器。\n如果运行上面的命令，您会发现该实例实际上并不执行任何操作，因为我们的wasm模块不包含任何指令！\n如果您有兴趣亲自尝试这段代码，可以在GitHub上找到--每一步都有一个提交。\n让我们通过实现一个将两个浮点数相加的函数来使wasm模块做一些更有用的事情。\nWebAssembly是一种二进制格式，可读性不是很好(至少对人类而言)，这就是为什么您通常会看到它是以WebAssembly文本格式(WAT)编写的。下面是一个以WAT格式呈现的模块，它定义了一个名为$add的导出函数，该函数接受两个浮点参数，然后将它们相加并返回：\n(MODULE(func$add(Param F32)(Param F32)(Result F32)GET_LOCAL 0 GET_LOCAL 1 f32.add)(export&#34；add&#34；(Func 0)。\n如果您只想体验一下Wat，可以使用WebAssembly二进制工具包中的wat2wasm工具将WAT文件编译成wasm模块。\nWebAssembly是一种低级语言，只有一小部分(大约60条)指令集，其中许多指令与CPU指令的映射非常紧密。这使得将wasm模块编译成特定于CPU的机器码变得很容易。\n它没有内置的", "note_en": "Have you ever wanted to write your own compiler? … yes? … of course you have! I’ve always wanted to have a go at writing a compiler, and with the recent release of WebAssembly, I had the perfect excuse to have a go.\n My original plan was to  invent my own programming language, create a compiler that targets WebAssembly, and share my experiences at  FullStackNYC. The first part went to plan, I spent many-an-evening building, tinkering and refining my compiler. Unfortunately the last part of my plan didn’t go quite so well. Long delays, and an  eventual cancellation, meant that I wasn’t going to make it to New York after all. 😔😢😭\n So, rather than waste all that work - I thought I’d write up my talk as a blog post instead - hence the ‘19 min’ reading time for this article. So sit back, make yourself comfortable, and we’ll begin …\n  If you haven’t heard of WebAssembly before, and want a really detailed introduction, I’d thoroughly recommend  Lin Clark’s Cartoon Guide.\n You’ll learn the ‘what’ of WebAssembly throughout this blog post, but I do want to briefly touch on the ‘why’.\n   The top diagram shows a simplified timeline for the execution of some JavaScript code within the browser. From left-to-right, the code (typically delivered as a minified mess!) is parsed into an AST, initially executed in an interpreter, then progressively optimised / re-optimised until it eventually runs really quite quickly. These days JavaScript is fast - it just takes a while to get up to speed.\n The bottom diagram is the WebAssembly equivalent. Code written in a wide variety of languages (Rust, C, C#, etc …) is compiled to WebAssembly that is delivered in a binary format. This is very easily decoded, compiled and executed - giving fast and predictable performance.\n  WebAssembly has been causing quite a stir over the last year. So much so, that it was voted the fifth ‘most loved’ language in  Stack Overflow’s developer insights survey.\n  An interesting result, considering that for most people WebAssembly is a compilation target, rather than a language they will use directly.\n This was part of my motivation for proposing the FullStackNYC talk in the first place. The technical aspects of WebAssembly are really fascinating (and remind me of 8-bit computers from a few decades back), yet most people will never get the chance to dabble with WebAssembly itself - it will just be a black box that they compile to.\n Writing a compiler is a really good opportunity to delve into the details of WebAssembly to find it what it is and how it works. And it’s fun too!\n One final point, it was never my aim to create a fully-featured programming language, or one that is actually any good. My goal was to create ‘enough’ of a language to allow me to write a program that renders a mandelbrot set. This language is compiled to WebAssembly using my compiler, which is written in TypeScript and runs in the browser.\n   I ended up calling the language  chasm and you can  play with it online if you like.\n   Before tackling the compiler, we’ll start with something simpler, creating a minimal WebAssembly module.\n Here is an emitter (the term used for the part of a compiler that outputs instructions for the target system), that creates the smallest valid WebAssembly module:\n const  magicModuleHeader  =  [ 0x00 ,  0x61 ,  0x73 ,  0x6d ]; const  moduleVersion  =  [ 0x01 ,  0x00 ,  0x00 ,  0x00 ]; export  const  emitter :  Emitter  =  ()  =&gt;  Uint8Array . from ([  ... magicModuleHeader ,  ... moduleVersion  ]);\n It is comprised of two parts, the ‘magic’ header, which is the ASCII string  \\0asm, and a version number. These eight bytes form valid WebAssembly (or wasm) module. More typically these would be delivered to the browser as a  .wasm file.\n   If you run the above you’ll find that  instance doesn’t actually do anything because our wasm module doesn’t contain any instructions!\n If you’re interested in trying out this code for yourself, it is all on GitHub -  with a commit for each step.\n  Let’s make the wasm module do something more useful, by implementing a function that adds a couple of floating point numbers together.\n WebAssembly is a binary format, which isn’t terribly readable (to humans at least), which is why you’ll more typically see it written in WebAssembly Text Format (WAT). Here’s a module, presented in WAT format, that defines an exported function named  $add that takes two floating point parameters, adds them together and returns them:\n (module (func $add (param f32) (param f32) (result f32) get_local 0 get_local 1 f32.add) (export &#34;add&#34; (func 0)))\n If you just want to experiment with WAT you can use the  wat2wasm tool from the  WebAssembly Binary Toolkit to compile WAT files into wasm modules.\n  WebAssembly is a low-level language, with a small (approx 60) instruction set, where many of the instructions map quite closely to CPU instructions. This makes it easy to compile wasm modules to CPU-specific machine code.\n  It has no built in I/O. There are no instructions for writing to the terminal, screen or network. In order to wasm modules to interact with the outside world they need to do so via their host environment, which in the case of the browser is JavaScript.\n  WebAssembly is a stack machine, in the above example  get_local 0 gets the local variable (in this case the function param) at the zeroth index and pushes it onto the stack, as does the subsequent instruction. The  f3.add instruction pops two values form the stack, adds them together than pushes the value back on the stack.\n  WebAssembly has just four numeric types, two integer, two floats. More on this later …\n Let’s update the emitter to output this ‘hard coded’ WebAssembly module.\n WebAssembly modules are composed of a pre-defined set of optional sections, each prefixed with a numeric identifier. These include a type section, which encode type signatures, and function section, which indicates the type of each function. I’ll not cover how these are constructed here - they are quite dull. If you’re interested,  look at the next commit in the project.\n The interesting part is the code section. Here is how the above  add function is created in binary:\n const  code  =  [  Opcodes . get_local  /** 0x20 */ ,  ... unsignedLEB128 ( 0 ),  Opcodes . get_local  /** 0x20 */ ,  ... unsignedLEB128 ( 1 ),  Opcodes . f32_add  /** 0x92 */ ]; const  functionBody  =  encodeVector ([  ... encodeVector ([])  /** locals */ ,  ... code ,  Opcodes . end  /** 0x0b */ ]); const  codeSection  =  createSection ( Section . code  /** 0x0a */ ,  encodeVector ([ functionBody ]));\n I’ve defined an  Opcodes enum (I’m using TypeScript), which contains all of the wasm instructions. The  unsignedLEB128 function is a standard  variable length encoding which is used for encoding instruction parameters.\n The instructions for a function are combined with the function’s local variables (of which there are none in this case), and an  end opcode that signals the end of a function. Finally all the functions are encoded into a section. The  encodeVector function simply prefixes a collection of byte arrays with the total length.\n And there you have it, the complete module, which is about 30 bytes in total.\n   Interestingly if you inspect the exported  add function with the Chrome Dev Tools it identifier it as a ‘native function’.\n   Now that you’ve seen how to dynamically create wasm modules, it’s time to turn our attention to the task of creating a compiler. We’ll start with a bit of terminology.\n Here’s some  chasm code annotated to show the key components of a language:\n  Rather than give a ‘textbook definition’ of each, you’ll become familiar with them as the compiler evolves.\n The compiler itself will be formed of three parts, the  tokenizer which breaks up the input program (which is a string), into discrete tokens, the  parser that takes these tokens and converts them into an Abstract Syntax Tree (AST), and finally the  emitter which converts the AST into wasm binary module.\n   Rather than dive into a complete implementation, we’ll tackle a small subset of the problem. The goal is to create a compiler for a language that just supports print statements which print simple numeric literals …\n   The tokenizer works by advancing through the input string, one character at a time, matching patterns that represent specific token types. The following code creates three matches ( number,  keyword, and  whitespace), using simple regular expressions:\n const  keywords  =  [ &#34; print &#34; ];  // returns a token if the given regex matches at the current index const  regexMatcher  =  ( regex :  string ,  type :  TokenType ):  Matcher  =&gt;  ( input :  string ,  index :  number )  =&gt;  {  const  match  =  input . substring ( index ). match ( regex );  return  (  match  &amp;&amp;  {  type ,  value :  match [ 0 ]  }  );  }; const  matchers  =  [  regexMatcher ( &#34; ^[.0-9]+ &#34; ,  &#34; number &#34; ),  regexMatcher ( `^( ${ keywords . join ( &#34; | &#34; )} )` ,  &#34; keyword &#34; ),  ...\n  The  Matcher interface defines a function that given an input string and an index returns a token if a match occurs.\n The main body of the parser iterates over the characters of the string, finding the first match, adding the provided token to the output array:\n export  const  tokenize :  Tokenizer  =  input  =&gt;  {  const  tokens :  Token []  =  [];  let  index  =  0 ;  while  ( index  &lt;  input . length )  {  const  matches  =  matchers . map ( m  =&gt;  m ( input ,  index )). filter ( f  =&gt;  f )  const  match  =  matches [ 0 ];  if  ( match . type  !==  &#34; whitespace &#34; )  {  tokens . push ( match );  }  index  +=  match . value . length ;  }  return  tokens ; };\n  [   {   &#34;type&#34; :   &#34;keyword&#34; ,   &#34;value&#34; :   &#34;print&#34; ,   &#34;index&#34; :   1   },   {   &#34;type&#34; :   &#34;number&#34; ,   &#34;value&#34; :   &#34;23.1&#34; ,   &#34;index&#34; :   7   }  ]\n As you can see from the above input, the tokeniser removes whitespace as it has no meaning (for this specific language), it also ensures that everything in the input string is a valid token. However, it doesn’t make any guarantees about the input being well-formed, for example the tokeniser will happily handle  &#34;print print&#34;, which is clearly incorrect.\n   The goal of the parser is the creation of an Abstract Syntax Tree (AST), a tree structure that encodes the relationship between these tokens, resulting in a form that could potentially be sent to an interpreter for direct execution.\n  export  const  parse :  Parser  =  tokens  =&gt;  {  const  iterator  =  tokens [ Symbol . iterator ]();  let  currentToken  =  iterator . next (). value ;  const  eatToken  =  ()  =&gt;  ( currentToken  =  iterator . next (). value );  [...]  const  nodes :  StatementNode []  =  [];  while  ( index  &lt;  tokens . length )  {  nodes . push ( parseStatement ());  }  return  nodes ; };\n (I’ve no idea where the concept of eating tokens comes from, it appears to be standard parser terminology, they are clearly hungry beasts!)\n The goal of the above parser is to turn the token array into an array of statements, which are the core building blocks of this language. It expects the given tokens to conform to this pattern, and will throw an error (not shown above) if it does not.\n The  parseStatement function expects each statement to start with a keyword - switching on its value:\n const  parseStatement  =  ()  =&gt;  {  if  ( currentToken . type  ===  &#34; keyword &#34; )  {  switch  ( currentToken . value )  {  case  &#34; print &#34; :  eatToken ();  return  {  type :  &#34; printStatement &#34; ,  expression :  parseExpression ()  };  }  } };\n Currently the only supported keyword is  print, in this case it returns an AST node of type  printStatement parsing the associated expression.\n  const  parseExpression  =  ()  =&gt;  {  let  node :  ExpressionNode ;  switch  ( currentToken . type )  {  case  &#34; number &#34; :  node  =  {  type :  &#34; numberLiteral &#34; ,  value :  Number ( currentToken . value )  };  eatToken ();  return  node ;  } };\n In its present form the language only accepts expressions which are composed of a single number - i.e. a numeric literal. Therefore the above expression parser expects the next token to be a number, and when this matches, it returns a node of type  numberLiteral.\n Continuing the simple example of the program  &#34;print 23.1&#34;, the parser outputs the following AST:\n  As you can see the AST for this language is an array of statement nodes. Parsing guarantees that the input program is syntactically correct, i.e. it is properly constructed, but it doesn’t of course guarantee that it will execute successfully, runtime errors might still be present (although for this simple language they are not possible!).\n   Currently the emitter outputs a hard-coded add function. It now needs to take this AST and emit the appropriate instructions, as follows:\n const  codeFromAst  =  ast  =&gt;  {  const  code  =  [];  const  emitExpression  =  node  =&gt;  {  switch  ( node . type )  {  case  &#34; numberLiteral &#34; :  code . push ( Opcodes . f32_const );  code . push (... ieee754 ( node . value ));  break ;  }  };  ast . forEach ( statement  =&gt;  {  switch  ( statement . type )  {  case  &#34; printStatement &#34; :  emitExpression ( statement . expression );  code . push ( Opcodes . call );  code . push (... unsignedLEB128 ( 0 ));  break ;  }  });  return  code ; };\n The emitter iterates over the statements that form the ‘root’ of the AST, matching our only statement type - print. Notice that the first thing it does is emit the instructions for the statement expressions, recall that WebAssembly is a stack machine, hence the expression instructions must be processed first leaving the result on the stack.\n The print function is implemented via a  call operation, which invokes the function at index zero.\n Previously we’ve seen how wasm modules can export functions (as per the add example above), they can also import functions, which are supplied when you instantiate the module. Here we provide an  env.print function that logs to the console:\n   You can see the complete code for the  compiler at this point on GitHub - you can also have a play with this example via the  online chasm compiler playground.\n   So far we’ve put quite a lot of structure in place, but not really felt the benefit. A separate tokenizer, parser and emitter is overkill for a language that only prints simple numerics. However, as the language complexity grows, this structure really starts to pay dividends.\n  Next up, we’ll look at implementing binary expressions, allowing the language to perform simple mathematics, for example  print ((42 + 10) / 2).\n For the tokeniser the changes are quite trivial, involving adding a couple of additional regex matchers for parentheses and operators. I’ll not reproduce them here - instead, just show the resultant output:\n [   {   &#34;type&#34; :   &#34;keyword&#34; ,   &#34;value&#34; :   &#34;print&#34;   },   {   &#34;type&#34; :   &#34;parens&#34; ,   &#34;value&#34; :   &#34;(&#34;   },   {   &#34;type&#34; :   &#34;parens&#34; ,   &#34;value&#34; :   &#34;(&#34;   },   {   &#34;type&#34; :   &#34;number&#34; ,   &#34;value&#34; :   &#34;42&#34;   },   {   &#34;type&#34; :   &#34;operator&#34; ,   &#34;value&#34; :   &#34;+&#34;   },   {   &#34;type&#34; :   &#34;number&#34; ,   &#34;value&#34; :   &#34;10&#34;   },   {   &#34;type&#34;\n Next up, we’ll look at the changes to the parser - where the expression parser can encounter either  number of  parens tokens:\n const  parseExpression  =  ()  =&gt;  {  let  node :  ExpressionNode ;  switch  ( currentToken . type )  {  case  &#34; number &#34; :  [...]  case  &#34; parens &#34; :  eatToken ();  const  left  =  parseExpression ();  const  operator  =  currentToken . value ;  eatToken ();  const  right  =  parseExpression ();  eatToken ();  return  {  type :  &#34; binaryExpression &#34; ,  left ,  right ,  operator  };  } };\n Notice that parsing of  parens expressions is recursive, with the nodes for the left and right invoking the  parseExpression function once again.\n  [{   type:   &#34;printStatement&#34; ,   expression:   {   type:   &#34;binaryExpression&#34; ,   left:   {   type:   &#34;binaryExpression&#34; ,   left:   {   type:   &#34;numberLiteral&#34; ,   value:   42   },   right:   {   type:   &#34;numberLiteral&#34; ,   value:   10   },   operator:   &#34;+&#34;   },   right:   {   type:   &#34;numberLiteral&#34; ,   value:   2   },   operator:   &#34;/&#34;   }  }] ;\n  Finally, the emitter needs to be updated in order to handle the  binaryExpression node type, as follows:\n const  emitExpression  =  ( node )  =&gt;  traverse ( node ,  ( node )  =&gt;  {  switch  ( node . type )  {  case  &#34; numberLiteral &#34; :  code . push ( Opcodes . f32_const );  code . push (... ieee754 ( node . value ));  break ;  case  &#34; binaryExpression &#34; :  code . push ( binaryOpcode [ node . operator ]);  break ;  } });\n The  traverse function in the above code traverses tree structures invoking the given visitor for each node. While linear structures only have one logical way to traverse them (i.e. in order), trees can be  traversed in a number of different ways. The traversal method used by the emitter is a depth-first post-order traversal, in other words as it encounters each node it visits left, right, then root - this order ensures that  ...\n And that’s it, all the changes that are required to support expressions. Give it a  go online.\n     Variables are declared using the  var keyword, and can be used in expressions as identifiers.\n We’ll not look at the changes to the tokeniser, it’s just yet more regex! The main loop of the parser, which reads successive statements from the token array, determines the statement type based on the keyword it encounters:\n const  parseVariableDeclarationStatement  =  ()  =&gt;  {  eatToken ();  // var  const  name  =  currentToken . value ;  eatToken ();  eatToken ();  // =  return  {  type :  &#34; variableDeclaration &#34; ,  name ,  initializer :  parseExpression ()  }; }; const  parseStatement :  ParserStep &lt; StatementNode &gt;  =  ()  =&gt;  {  if  ( currentToken . type  ===  &#34; keyword &#34; )  {  switch  ( currentToken . value )  {  case  &#34; print &#34; :  return  parsePrintStatement ();  case  ...\n Variable declaration parsing is quite straight-forwards - notice that the  parseVariableDeclarationStatement function also makes use of the expression parser, which ensures that variables can be declared and assigned an initial value from an expression, e.g.  var f = (1 + 4).\n Next up, the emitter. WebAssembly functions can have local variables, these are declared at the beginning of the function definition, and are accessed via the  get_local and  set_local functions that also retrieve function parameters.\n The variables in our AST are referenced via their identifier name, whereas wasm identifies locals by their index. The emitter needs to maintain this information in a symbol table, which is a simple map from the symbol name to index:\n const  symbols  =  new  Map &lt; string ,  number &gt; (); const  localIndexForSymbol  =  ( name :  string )  =&gt;  {  if  ( ! symbols . has ( name ))  {  symbols . set ( name ,  symbols . size );  }  return  symbols . get ( name ); };\n Within the node traversal, when a variable declaration is encountered, the expression is emitted, them  set_local used to assign the value to the respective local variable.\n  Within expressions, when identifiers are found, the  get_local operation is used to retrieve the value:\n  Also, the function encoding we saw right back at the beginning is updated to add the locals for the function that the emitter builds. The  chasm language has a single variable type, everything is a float.\n   One of the final language constructs we need in order to achieve the goal of rendering a mandelbrot set is some kind of loop. For  chasm I opted for a while loop, as show in this simple program that prints the numbers 0 to 9:\n  WebAssembly has various control flow instructions (branch, if, else, loop, block). The following WAT show how a while loop can be constructed:\n  Branching within WebAssembly is based on stack depth. The outer  block and  loop instructions push entries onto the control-flow stack. The  br_if 1 instruction performs a conditional branch to a stack depth of one, and  br 0 an unconditional branch to a depth of zero, repeating the  loop.\n  case  &#34; whileStatement &#34; :  // outer block  code . push ( Opcodes . block );  code . push ( Blocktype . void );  // inner loop  code . push ( Opcodes . loop );  code . push ( Blocktype . void );  // compute the while expression  emitExpression ( statement . expression );  code . push ( Opcodes . i32_eqz );  // br_if $label0  code . push ( Opcodes . br_if );  code . push (... signedLEB128 ( 1 ));  // the nested logic  emitStatements ( statement . statements );  // br $label1  ...\n   We’re nearly there - up to the very last step now! Currently the only way we’ve been able to see output from our  chasm programs is via the  print statement, which is wired to the console via a function imported by the WebAssembly module. For the mandelbrot set we somehow need to render graphics to the screen.\n To achieve this we’ll make use of another very important component of WebAssembly modules, linear memory:\n  As I mentioned previously, WebAssembly only has 4 numeric data types. You might be wondering how languages with richer type systems (string, structs, arrays) can compile to WebAssembly?\n WebAssembly modules can optionally define (or import) a block of linear memory, this is a contiguous block of memory that is shared by the wasm module and its host - in other words both can read and write to this memory. Therefore, if you want to pass a string to your WebAssembly module, you do this by  writing it to linear memory.\n For  chasm we just want some sort of display, so will use linear memory as a form of  Video RAM.\n The  chasm languages supports a simple set-pixel command which takes three expressions, the x location, y location and colour. For example, the following program fill the screen with a horizontal gradient:\n var y = 0while (y &lt; 100) var x = 0 while (x &lt; 100) setpixel x y (x * 2) x = (x + 1) endwhile y = (y + 1)endwhile\n  The  setpixel command is implemented using the wasm  store instruction that writes to linear memory. On the JavaScript ‘hosting’ side, this same linear memory is read and copied to a HTML canvas. I’ll not reproduce the changes to the code here, you can  see them on GitHub\n And with that - the  chasm language is complete, and able to render the mandelbrot set:\n    I hope you enjoyed this journey and have either learnt a bit more about WebAssembly or how compilers work? For me, this project was a lot of fun - I’ve never written a compiler before, but have always wanted to.\n As you can probably imagine, I’ve not stopped there, the temptation was too great to keep going - I’ve already implemented if / else, and functions / procedures are in the pipeline. I’d also really like to explore some of the more involved topics like memory management, for example introduce string, arrays and a memory allocator for storage within linear memory.\n  I am Technology Director at Scott Logic and am a prolific technical author, blogger and speaker on a range of technologies.\n My blog includes posts on a wide range of topics, including WebAssembly, HTML5 / JavaScript and data visualisation with D3 and  d3fc. You&#39;ll also find a whole host of posts about previous technology interests including iOS, Swift, WPF and Silverlight.\n I&#39;m board member of  FINOS, which is encouraging open source collaboration in the financial sector. I&#39;m also  very active on GitHub, contributing to a number of different projects.", "posttime": "2020-05-03 03:12:26", "tags": "编译,webassembly", "title": "构建您自己的WebAssembly编译器", "title_en": "Build your own WebAssembly Compiler", "transed": 1, "url": "https://blog.scottlogic.com/2019/05/17/webassembly-compiler.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["编译"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000394, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "仍在加载…。*如果此问题仍然存在，请重新加载或通过quipsupport.com联系我们。", "note_en": "Still loading…    Please reload or contact us via  quipsupport.com if this issue persists.", "posttime": "2020-05-03 03:12:22", "tags": "面试,sql,hard,加载,contact", "title": "中硬SQL面试问题", "title_en": "Medium-hard SQL interview questions", "transed": 1, "url": "https://gstudent.quip.com/2gwZArKuWk7W", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["面试", "sql", "hard", "加载", "contact"]}]