[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1004524, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当他们年富力强的时候，这些地方看到了一切：谁在舞台上砸吉他；16岁的艾米·怀恩豪斯(Amy Winehouse)的首次亮相；60年代的节奏蓝调、70年代的朋克、80年代的流行和90年代的摇滚的到来。\n但一些帮助启动音乐事业的场所，从现状到性手枪，现在已经远离聚光灯，在伦敦的角落里像洗衣店、炸鸡店甚至警察局一样萎靡不振。\n现在，为了挽救他们在首都文化史上的位置，一位音乐发起人出身的摄影师记录了首都爵士乐、布鲁斯、摇滚乐、民谣、朋克和独立音乐历史的150个地标。\n保罗·塔林的新摄影散文包括数十家酒吧和酒吧，里奇·布莱克莫尔的“深紫色和苏西”和“女妖”等人就是在这些酒吧里第一次调好吉他的。\n现年52岁的塔林在20世纪80年代开始涉足伦敦的音乐界，并在那十年末在首都组织了狂躁街头传教士的第一场演唱会。\n“我给了GB 30英镑的汽油钱，让他们从威尔士去伦敦，这样他们就可以在89年在牧羊人灌木丛的果岭歌剧院演出。他们是如此诚实，他们只要求20 GB，因为这就是他们乘坐面包车到达那里所需的全部。这是他们第一次在伦敦演出，所以他们告诉了我，我只是不得不把这一点写进这本书里，“塔林说。\n塔林还在伦敦各地经营摇滚和流行徒步旅行，他说，他注意到在过去20年里，有多少著名的音乐酒吧、酒吧和俱乐部被快餐连锁店、住房协会，甚至福音派基督教教堂接管。\n他花了三年时间在全市徒步旅行，重新发现、研究和拍摄了所有的旧场地，其中许多都有被从摇滚史上抹去的危险。\n“这并不全是厄运和悲观，”他说。“一些老地方仍然很兴旺，比如普特尼的半月或牛津街的100俱乐部，既有新乐队，也有老乐队在那里演奏。但捕捉战后一些最大甚至最小的表演首次登上舞台或拥有一些最著名的时刻是至关重要的。“。\n随着冠状病毒的封锁可能会在不久的将来关闭更多的酒吧和俱乐部，塔林担心他可能会有更多以前的演唱会场所可以去看他的第二卷。\n“我还有150多个地方要拍，比如芬斯伯里公园的老彩虹，但我也会继续在伦敦进行摇滚乐之旅。”有一些关于那些伟大的摇滚之夜的故事，你不能把它们写进任何一本书里，有一些故事是不能出版的，甚至可能是诽谤的-所以我会把这些故事留到徒步旅行中去，“他说。\n1977年元旦，这场冲突成为这个朋克/新浪潮场地开幕的头条新闻。在跟随他们的常规羽翼未丰的乐队中，有苏西乐队、女妖乐队和X-Ray Spex乐队。\nDJ唐·莱茨(DJ Don Letts)在乐队之间演奏雷鬼配音的场地，部分原因是朋克唱片太少了，成为朋克/新浪潮场景的代名词，以至于同年录制了专辑“Live at the Roxy London”，那年春天跻身英国专辑排行榜前20名。马克·博兰非常喜欢这个地方，1977年3月，霸王龙在那里举办了“地下世界”专辑发布会上的“花花公子”(Dandy)乐队。\n然而不到一年，首都的朋克泡沫似乎已经破裂，Roxy关闭了，这让蹲在大楼里抗议关闭的粉丝们感到痛苦。会场最终被关闭，并被掏空。今天这里是Speedo运动服装店的所在地。\n曾有报道援引艾米·怀恩豪斯的话说，她的职业生涯就是从这个地方开始的，“在雷纳斯巷的一家酒吧的后屋里为老人唱歌”。\n在20世纪60年代末到21世纪初，雷纳夫妇主持了一系列兼收并蓄的表演，包括酒吧摇滚到新生朋克传奇人物费尔古德博士(Dr Feelgood)。像巴斯特王子这样的斯卡皇室成员在它的一个光头雷鬼之夜现场表演了布景。\n酒吧于2006年初关闭，原定于当地议会在最后一刻对建筑下达保护令之前拆除。现在它被救世主基督宗教培训学院占据，尽管酒吧的招牌仍然悬挂在外面。\n另一个朋克俱乐部像1977年的Roxy一样如雨后春笋般涌现，Vortex甚至在“果酱边的沃杜尔街的炸弹”的歌词中被提到。\n在那首歌中，Paul Weller等人回忆了场馆常客、工作人员和一群新纳粹光头党之间的暴力冲突。(“他们叫了军队，他们叫了警察/我被困在漩涡地板上/我的头被踢进去了，鲜血开始涌入…”)。\n在“漩涡”舞台上开始演艺生涯的艺人中，有一个是全女子朋克乐队The Slits，还有一个从都柏林赶来的乐队，名为“新兴城市老鼠”(The Boomtown Rats)。1977年，伯明翰的一家名为“钢铁脉动”(Steel Pulse)的根雷鬼组织就是从那里宣布埃尔维斯·普雷斯利(Elvis Presley)去世的。\n人群中的一些人欢呼起来-这一行为在舞台上遭到了一位名为丹尼·贝克(Danny Baker)的年轻乐迷的谴责，贝克是未来的电台DJ和电视主持人。\n以前的会场现在是SOHO的Dirty Harry‘s下面的Nova Club，它橱窗里的盒装霓虹灯招牌告诉顾客：“这不是脱衣舞俱乐部”。\n这个场地位于伦敦西部的一个汽车展厅上方，最初被称为阁楼俱乐部，1964年开业，乔治·名气(Georgie Fame)和吉诺·华盛顿(Geno Washington)等人在那里演奏。\nRicky-Tick是20世纪60年代颇具影响力的节奏蓝调俱乐部。在那里演出的最著名的演员有吉米·亨德里克斯、平克·弗洛伊德、克里姆、亚瑟·布朗的疯狂世界、庭院鸟和谁人。一张鼎盛时期的Ricky-Tick海报宣传着一场吉米·亨德里克斯体验演唱会，入场费为7先令6便士。\n该俱乐部还率先带领塔姆拉汽车城成功进军英国，至尊乐队、诱惑乐队和年轻的史蒂维·旺德都出现在那里。它还包括一家内部时装店或“Boutick”，顾客可以在那里购买60年代的摇摆服装。\n俱乐部今天的豪恩斯洛总部是一家职业介绍所的办公室，位于南多连锁餐厅的一家分店上方。\n保罗·塔林的“伦敦迷失的音乐场所”，GB 14.99，由www.DamagedGoodsBooks.com出版", "note_en": "When they were in their prime, these places saw it all: the Who smashing their guitars on stage; the debut of a 16-year-old Amy Winehouse; the arrival of 60s rhythm and blues, 70s punk, 80s pop and 90s rock.\n But some of the venues that helped launch musical careers from Status Quo to the  Sex Pistols are now far from the spotlight, languishing in corners of London as laundrettes, fried chicken joints and even police stations.\n Now, in an attempt to save their placein the capital’s cultural history, a music promoter turned photographer has documented 150 landmarks of the capital’s jazz, blues, rock, folk, punk and indie history.\n Paul Talling’s new photographic essay includes dozens of pubs and bars where the likes of Ritchie Blackmore’s Deep Purple and  Siouxsie and the Banshees first tuned up their guitars.\n  Talling, 52, became involved in London’s musical scene in the 1980s, and at the end of that decade organised the Manic Street Preachers’ first concert in the capital.\n “I offered £30 petrol money to get them from Wales to London so they could play in ’89 at the Opera On the Green at Shepherd’s Bush. They were so honest they only asked for £20 because that was all they needed to get there in their van. That was their first  London gig, so they told me, and I just had to put that in this book,” Talling said.\n Talling, who also runs rock and pop walking tours around London, said he has noticed over the last two decades how many of the famous music pubs, bars and clubs have been taken over by fast-food chains, housing associations and even evangelical Christian churches.\n  It took him three years of tramping across the city to rediscover, research and shoot all of the old venues, many of which were in danger of being erased from rock’n’roll history.\n “It’s not all doom and gloom,” he said. “Some of the old places are still going strong, like the Half Moon in Putney or the 100 Club in Oxford Street, with new bands as well as old ones playing there. But it was vital to capture the places where some of the biggest and even smallest acts from the postwar era onwards first took to the stage or had some of their most famous moments.”\n With the coronavirus lockdown threatening to close more pubs and clubs in the near future, Talling fears he may have more former gig venues to visit for his second volume.\n “I’ve another 150 more places to photograph, like the old Rainbow in Finsbury Park, but I will also keep doing the rock’n’roll tours of London too. There are stories about those great rock nights that you cannot put in any book, stories that are unprintable, maybe even libellous – so I’ll keep those tales for the walking tours,” he said.\n   On New Year’s Day, 1977, the Clash were the headline act to open this punk/new wave venue. Among the regular fledgling bands to follow them there were Siouxsie and the Banshees and X-Ray Spex.\n The venue, where DJ Don Letts played dub reggae between bands, partly because there were so few punk records to play, became so synonymous with the punk/new wave scene that an album,  Live at the Roxy London , was recorded in the same year, and that spring made the Top 20 in the UK album chart. Marc Bolan loved the place so much that in March 1977 T Rex hosted their  Dandy in the Underworld album party launch there.\n Yet within a year, the punk bubble in the capital appeared to have burst, and the Roxy closed, to the anguish of fans who squatted in the building in protest at its closure. The venue was eventually shut and gutted. Today it is the location of a Speedo sportswear shop.\n   Amy Winehouse was once quoted as saying that she began her career in this spot, “singing for old people in the back room of a pub in Rayners Lane”.\n  Between the late 1960s and early 2000s, the Rayners hosted an eclectic range of acts including pub rock-to-nascent punk legends Dr Feelgood. Ska royalty like Prince Buster performed live sets at one of its skinhead reggae nights.\n The pub closed in early 2006 and was due to be demolished before the local council put an 11th-hour conservation order on the building. It is now occupied by Christ the Redeemer religious training college, although the pub sign still hangs outside.\n   Another punk club that sprung up like the Roxy in 1977, the Vortex is even mentioned in the lyrics of ‘A’ Bomb in Wardour Street by  the Jam.\n In that song, Paul Weller et al recalled violent clashes between the venue’s regulars, the staff and a gang of neo-Nazi skinheads. (“They’ve called in the army, they’ve called in the police / I’m stranded on the vortex floor / My head’s been kicked in and blood’s started to pour…”)\n Among the acts who started their careers on the Vortex’s stage was the all-girl punk band the Slits, and a group that had travelled from Dublin known as the Boomtown Rats. And it was from there that Steel Pulse, a roots reggae outfit from Birmingham, announced Elvis Presley’s death in 1977.\n Some in the crowd cheered – an act that was denounced from the stage by a young music fan known as Danny Baker, the future radio DJ and television presenter.\n The former venue is now the Nova Club below Dirty Harry’s of Soho, whose boxed-off neon-sign in the window advises customers: “This Is Not A Strip Club”.\n   This venue, above a car showroom in west London, was originally called the Attic Club and opened in 1964 with the likes of Georgie Fame and Geno Washington playing there.\n  The Ricky-Tick was an influential 1960s rhythm and blues club. Among the most famous acts to play there were Jimi Hendrix, Pink Floyd, Cream, the Crazy World of Arthur Brown, the Yardbirds and the Who. One heyday Ricky-Tick poster advertised a  Jimi Hendrix Experience concert with the entry fee of 7 shillings, 6 pence.\n The club also pioneered Tamla Motown’s triumphant march into the UK with the Supremes, the Temptations and a young Stevie Wonder all appearing there. It also included an in-house fashion store or ‘Boutick’ where patrons could buy Swinging 60s clothing.\n The club’s Hounslow HQ today is the offices of an employment agency, located above a branch of the Nando’s restaurant chain.\n Paul Talling’s London’s Lost Music Venues, £14.99 is published by  www.DamagedGoodsBooks.com", "posttime": "2020-05-31 22:10:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "帮助,london,乐队", "title": "失去了帮助推出亨德里克斯、怀恩豪斯和朋克的伦敦场馆", "title_en": "Lost London venues that helped launch Hendrix, Winehouse and punk", "transed": 1, "url": "https://www.theguardian.com/artanddesign/2020/may/31/tracing-the-lost-london-venues-that-helped-launch-amy-winehouse-hendrix-and-punk", "via": "", "real_tags": ["帮助", "london", "乐队"]}, {"category": "", "categoryclass": "", "imagename": "d2892ebf4e31bc79b4735c6f3aa5d227.jpg", "infoid": 1004523, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "三个核心中的每一个都携带一台飞行计算机、降落伞展开系统和推力矢量控制组件。上级也配备了推力矢量控制，并搭载了一辆3D打印跑车-没有一款猎鹰重型跑车是不完整的。\n猎鹰重型模型是BPS太空的技术演示。其目的是展示在模型尺度上可能取得的进步。\n猎鹰重型飞行计算机是Signal的升级版本，Signal是一种专门为模型火箭的推力矢量控制而设计和制造的计算机。每台电脑都有一套MEMS陀螺仪和加速计，用于感知火箭上的运动和方向，与大多数智能手机中的传感器相同。气压传感器被用来确定火箭离地面的高度。\n在每台飞行计算机上，一个48 mhz的Cortex M0处理器以400 hz的速度读取飞行传感器，并将31个通道的数据记录到闪存芯片中，每秒40次。猎鹰重型在空中的每一秒都会记录4960个数据点-永远不会有太多的数据。\n飞行计算机在飞行过程中不相互通信，传感器和软件足够精确，短途飞行不需要。没有一个航班设置是硬编码的；根据航班配置文件的不同，它们都可以使用Signal iOS/Android应用程序进行更改。\n飞行软件是用C++编写的，SWIFT的iOS应用程序和Java的Android应用程序都是用C++编写的。飞行制导是使用四元数计算的，计算效率更高，在一些航天运载火箭中用于制导。有关各种BPS的更多详细信息。可以通过下面的按钮找到太空飞行计算机。您也可以单击此处查看Z轴陀螺仪测试的镜头。\n每个侧型芯顶部的附着点沿着中心型芯上的坡道滑下，在阶段分离过程中给它们留出一些间隙。这种被动的设置让事情在飞行过程中变得非常简单，但当飞行器在地面上时，核心通常是用螺栓固定在一起的。所有三个核心也连接在车辆的底部，使用稍微简单的推力板。\n侧芯通过保持比中心芯/上级略高的净推力来保持与车辆的连接。一旦CC/US产生的净推力超过侧核，级就会分开。为了灵活起见，每个侧芯还为小型分离电机提供了一个插槽。使用时，SEP马达通过侧芯以微小角度点火，以确保与中心芯的清洁分离。到目前为止，航班上还不需要这种设置，但以后可能会有帮助。\n猎鹰重型模型的中心核心在飞行过程中经历了两个助推阶段。在第一阶段，连接侧芯。就在侧面核心烧毁的时候，中心核心点燃了第二个马达，第二个助推阶段开始了。这两个火箭发动机安装在中心核心的推力矢量支架上。当第二个马达点火时，下部的废马达就会被弹出。同样的技术也被用来控制其他BPS太空火箭的上升和推进着陆马达。\n猎鹰重型模型每一级的火箭发动机可以在任何方向上进行±5度的平衡。由于侧芯不是直接通过车辆的质心发射，它们不仅可以用于俯仰和偏航，还可以用于侧滚控制。每一次多核飞行都运行一个滚动程序，该程序通常以20度正侧滚为目标，以每秒30-40度的速度执行。\n发射猎鹰重型型号需要一些深思熟虑。中心铁心马达在点火时有一个轻微的推力尖峰，此后产生的力量慢慢减少。在发射时，侧面的核心必须具有比中心核心更大的净推力。正因为如此，在跳频飞行期间，中心核心在T-1秒被点亮，而飞行器仍然被发射夹子夹在垫子上。在T-0时，侧面核心被点亮，在T+0.25时，野兽被释放。单击下面了解有关启动平台的更多详细信息。\n2018年2月，满载的猎鹰重型火箭被压在发射台上进行静态射击试验。一些航天运载火箭会在发射台上发动发动机几秒钟，以确保发射前一切正常。这场静态大火的目的是为了确保新的发射台工作正常，坦率地说，是为了获得一些项目宣传的酷镜头。\n在第一次跳频发射之前，火箭的每一级都进行了单独的测试。这些早期测试中的许多也作为信号R2推力矢量套件的试验台，当时该套件仍在开发中。首先，对中心堆芯进行了自行测试。这次飞行取得了成功，核心被找回，并进行了几次飞行测试。\n在中心核心又进行了几次飞行后，侧面核心被连接起来进行全面的助推器试飞。中央核心有一个软件错误，导致级分离后不稳定。然而，成功测试了飞行中最复杂的部分，包括正确的点火正时，滚动程序，以及基本干净的级分离(右助推器在9月级被中心核心损坏)。\n在将其连接到中心核心之前，上级也进行了自己的测试。第一次试飞没有成功，这就是为什么测试很重要！这次飞行失败有几个原因，主要与飞行器的稳定性和调谐有关。文中对失效原因和原因进行了详细的分析。\n第二次试飞部分成功，稳定性大大提高，PID增益和PID采样率均有所提高。还做了几个其他的改变。然而，降落伞(和跑车)仍然没有展开，车辆又发生了一次硬撞击。整流罩没有正确分离，因此需要另一轮整流罩分离测试。\n这是全猎鹰重型模型首次发射前的最后一次主要测试，这些整流罩分离测试确保了上级在飞行后可以安全回收。在这个过程中，整流罩的设计做了几处小的修改，测试结果是一个更可靠的回收系统。\n猎鹰重型模型的第一次飞行取得了部分成功。更复杂的点火序列达到了预期的效果，让中心核心在垫子上燃烧了一点。飞行的第一个助推阶段非常完美。两边的核心都击中了滚动程序目标，从T+0.9秒开始，以每秒40度的速度滚动到+20度。车辆在助推器第一阶段保持稳定。在两边的核心完全分开后，中心核心失去了控制。\n中心堆芯马达悬置的热致结构故障导致推力矢量控制丢失。在感觉到失去控制后，上级的飞行计算机呼叫飞行中的中止，将整流罩炸开以展开降落伞。当火箭开始坠落时，中心核心展开了上面的级和自己的降落伞，将两级都安全地带到了地面。在这一点上，两边的核心都已经在各自的降落伞下轻轻地到达了地面。多亏了飞行中的中止系统，火箭保持了良好的状态。\n猎鹰重型模型的第二次飞行将于2019年初进行。主要目标将是解决中心核心的机械问题，减少总体质量，并简化飞行器飞行准备程序。\n还有，我还需要说吗？那些助推器当然要着陆了！目前，推进着陆测试计划与猎鹰重型计划是分开的，但随着两个计划成功率的提高，这两个计划将合并。\n许多人通过Patreon慷慨解囊来支持BPS空间-如果您想要尽早访问视频、设计文件等，请单击下面。", "note_en": "Each of the three cores carries a flight computer, parachute deployment system, and thrust vector control assembly. The upper stage flies with thrust vector control as well, and it carries a 3d printed sports car - no Falcon Heavy model would be complete without one.\n The Falcon Heavy model is a technology demonstrator for BPS.space. The intention is to showcase the advancement possible at the model scale.\n   The Falcon Heavy flight computers are upgraded versions of  Signal, a computer designed and built specifically for thrust vector control in model rockets. Each computer has a set of MEMS gyroscopes and accelerometers for sensing movement and orientation on the rocket, the same kind of sensors found in most smartphones. A barometric pressure sensor is used to determine the rocket’s altitude above ground level.\n On each flight computer, a 48mhz Cortex M0 processor reads the flight sensors at 400hz and logs 31 channels of data to a flash chip, 40 times per second. Every second that Falcon Heavy is in the air, 4,960 points of data are recorded onboard - never too much data.\n The flight computers don’t communicate with each other during flight, the sensors and software are accurate enough that it’s not required for short flights. None of the flight settings are hard-coded; depending on the flight profile, they can all be changed using the Signal iOS/Android app.\n The flight software is written in C++, the iOS app in Swift, and the Android app in Java. Flight guidance is computed using  quaternions, which are more computationally efficient, and are used for guidance in some space launch vehicles. More details about the various BPS.space flight computers can be found via the button below.  You can also click here for footage of Z axis gyroscope testing.\n    The attachment points at the top of each side core slide down a ramp on the center core, giving them a bit of clearance during stage separation. This passive setup keeps things very simple during flight, but the cores are usually bolted together while the vehicle is on the ground. All three cores are also connected at the base of the vehicle using a slightly simpler thrust plate.\n The side cores remain attached to vehicle by maintaining a slightly higher net thrust force than the center core/upper stage. As soon as the CC/US produces more net thrust than the side cores, the stages will separate. For flexibility, each side core also has a slot for a small separation motor. When used, the sep motor fires at a slight angle through the side core to ensure a clean separation away from the center core. This setup has not been needed on flights so far, but may be helpful later down the road.\n The center core of the Falcon Heavy model goes through two boost phases during flight. During the first phase, the side cores are attached. Right around side core burnout, the center core lights a second motor, and the second boost phase begins. These two rocket motors are mounted on top of each other in the center core’s thrust vectoring mount. When the second motor ignites, the lower, spent motor, is ejected. This same technique used to control ascent and propulsive landing motors in other BPS.space rockets.\n The rocket motors in each stage of the Falcon Heavy model can be gimbaled ±5 degrees in any direction. Because the side cores are not firing directly through the vehicle’s center of mass, they can be used not just for pitch and yaw, but roll control as well. Each multi-core flight runs a roll program which usually targets 20 degrees of positive roll, executed at 30-40 degrees per second.\n Launching the Falcon Heavy model requires a bit of forethought. The center core motor has a slight thrust spike at ignition, after which the amount of force produced slowly tapers off. At liftoff, the side cores must have a greater net thrust than the center core. Because of this, during a full FH flight, the center core is lit at T-1 second while the vehicle is still held on the pad by the launch clamps. At T-0 the side cores are lit, and at T+0.25 the beast is released. Click below for more details on the launch pad.\n    In February of 2018, the full Falcon Heavy rocket was held down on the launch pad for a static fire test. Some space launch vehicles will fire their engines for a few seconds on the launch pad to make sure everything is working properly before launch day. The purpose of this static fire was instead to make sure the new launch pad was working correctly, and frankly, to get some cool footage for project promotion.\n  Each individual stage of the rocket was tested on its own before the first full FH launch. Many of these early tests also served as testbeds for the  Signal R2 thrust vectoring kit, which was still in development at the time. First, the center core was tested by itself. The flight was a success; the core was recovered and flight tested several more times.\n  After several more flights of the center core, the side cores were attached for a full booster test flight. The center core had a software bug which caused instability after stage separation. However, the most complex parts of the flight were successfully tested, including proper ignition timing, a roll program, and a mostly clean stage separation(right booster was damaged by the center core at stage sep).\n  Before attaching it to the center core, the upper stage was tested on its own as well. The first test flight was unsuccessful, which is why it’s important to test! The flight failed for several reasons, mostly having to do with the stability and tuning of the vehicle.  The failure and analysis is discussed in detail here.\n  The second test flight was a partial success - stability greatly improved with an increase in both PID gains and PID sample rate. Several other changes were made as well. However, the parachute(and sports car) still failed to deploy, and the vehicle had another hard impact. The fairing wasn’t separating properly, so another round of fairing separation tests was needed.\n  The final major test before the first launch of the full Falcon Heavy model, these fairing separation tests served to ensure the upper stage could be safely recovered after flight. Several small modifications were made to the fairing design in the process, and the tests resulted in a much more reliable recovery system.\n   Flight 1 of the Falcon Heavy model was a partial success. The more complex ignition sequence worked as intended, letting the center core burn a bit on the pad. The first boost phase of flight was picture perfect. Both side cores hit the roll program target dead on, rolling to +20 degrees at 40 degrees per second beginning at T+0.9 seconds. The vehicle remained stable during boost phase one. After a clean separation of both side cores, the center core lost control.\n A heat induced structural failure in the center core’s motor mount resulted in a loss of thrust vector control. After sensing a loss of control, the upper stage’s flight computer called an in-flight abort, blowing the fairing apart to deploy its parachute. As the rocket began falling, the center core deployed the upper stage, and its own chutes, bringing both stages safely to the ground. Both side cores had reached the ground softly under their own parachutes by that point. The rocket remains in excellent condition, thanks to the in-flight abort system.\n    Flight 2 of the Falcon Heavy model will take place in early 2019. Primary goals will be resolving the mechanical issues with the center core, reducing overall mass, and streamlining vehicle flight prep procedures.\n  Also, do I even have to say it? Of course those boosters are gonna land! The propulsive landing test program is isolated from the Falcon Heavy program right now, but the two will merge as the success rate for both programs increases.\n  BPS.space is supported by the generosity of many through Patreon - if you’d like early access to videos, design files, and more, click below.", "posttime": "2020-05-31 22:10:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "火箭,rust,矢量,spacex,核心", "title": "推力矢量控制1/48比例尺SpaceX猎鹰重型模型火箭", "title_en": "1/48 scale SpaceX Falcon Heavy model rocket with thrust vector control", "transed": 1, "url": "https://bps.space/falcon-heavy", "via": "", "real_tags": ["火箭", "rust", "矢量", "spacex", "核心"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004522, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从今天开始，也就是5月1日，我们将从CGIT/人造板安装切换到GitLab。我们的旧服务器git.xfce.org现在是一个只做好准备的同步镜像(所以您仍然可以拉取代码)。我们的新服务器是gitlab.xfce.org。\n(这篇博客文章的详细版本可以在我在Xfce邮件列表上的公告中阅读。)。\n对于分发者来说，没有什么变化(假设您使用的是发行版tarball而不是Git标签)。\n最重要的是：Git URL已更改，因此您需要更新本地存储库的远程。请随意使用我们的助手脚本。\n如果您还没有帐户(我们已经为您的常客创建了相当多的帐户)，请注册！我们已经开放了GitLab帐户的注册，并允许您注册您的GitHub帐户(如果您有的话)。如果您缺乏存储库访问权限或所有权，请在IRC或邮件列表上拨打我们的电话。(默认情况下，新用户在手动批准之前不能分叉。是。我们害怕垃圾邮件。)", "note_en": "Starting today, May 1, we’re switching from our cgit/gitolite setup to GitLab. Our old server, git.xfce.org, is now a ready-only in-sync mirror (so you can still pull code). Our new server is gitlab.xfce.org.\n (The detailed version of this blog post can be read in my  announcement on the Xfce Mailing List.)\n   For  distributors nothing changes (presuming you’re using the release tarballs and not Git tags).\n  Most importantly: The Git URL changed, so you need to update the remotes of your local repositories.  Feel free to use our helper script.\n  If you don’t have an account yet (we created quite a few for you regulars already) please sign up! We have opened registrations for GitLab accounts as well as allowing you to register with your GitHub account (if you have one). Please poke us on IRC or the mailinglist if you’re lacking repository access or ownership. (By default new users cannot fork before being manually approved. Yes. We  are afraid of the spambots.)", "posttime": "2020-05-31 22:09:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "切换,switches,帐户", "title": "XFCE切换到GitLab", "title_en": "Xfce Switches to Gitlab", "transed": 1, "url": "https://simon.shimmerproject.org/2020/04/30/xfce-switches-to-gitlab/", "via": "", "real_tags": ["切换", "switches", "帐户"]}, {"category": "", "categoryclass": "", "imagename": "be8c640a13d5624e253b0a60c38857e9.jpeg", "infoid": 1004521, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通常，制造商鼓励我们不要舔我们的电子设备，因为它们的味道可能不怎么样。日本明治大学的研究人员正在寻求改变这一点，不是通过制造可食用的智能手机外壳，而是一种几乎可以模拟用户舌头上任何味道的味觉显示器。大多数人可以感觉到四种主要的味道-甜、酸、咸和苦，以及它们的组合。第五种口味，鲜味(可口)，对我们如何品尝不同的食物，如肉汤和熟肉，也起着重要的作用。\n工程师们的新设备名为Norimaki合成器，可以捕捉到这五种口味，并用它们欺骗我们的大脑，让我们认为我们在品尝不同的食物，就像我们的大脑欺骗我们的眼睛看到了不存在的东西一样。可以把它想象成您当前正在阅读本文的显示器-它使用由红色、绿色和蓝色元素组成的像素来生成数百万种不同的颜色。\nNorimaki合成器的味道展示是使用五种不同颜色的凝胶设计的，这些凝胶由琼脂包装成管状，甘油代表甜味，柠檬酸代表酸性，氯化钠代表咸味，氯化镁代表苦味，谷氨酸钠代表鲜味。当按压舌头时，用户可以同时体验所有的味道，但是混合这些凝胶并调整它们的量和强度会产生特定的味道。\n显示器的管子是用铜箔包裹的，所以当它们拿在手中与舌头接触时，就会通过人体产生一条电路，这就是所谓的离子电泳。当施加电流时，这一过程会移动凝胶中的分子，将分子移动到远离舌头的阴极侧，导致该特定凝胶的味道较弱。\n这是一个减法过程，逐渐去除某些味道，以呈现特定的味道。在测试中，研究小组发现，他们可以在不吃任何食物的情况下复制从寿司到胶糖的一切味道。", "note_en": "Typically, we are encouraged not to lick our electronic devices by manufacturers, as they probably don’t taste that great anyway. Researchers from Meiji University in Japan are looking to change that, not by making edible smartphone enclosures, but rather a Taste Display that simulates nearly any flavor on the user’s tongue. Most humans can detect four primary flavors — sweet, sour, salty, and bitter, along with a combination thereof. A fifth flavor, umami (savory), also plays a significant role in how we taste different foods, such as broth and cooked meats.\n The engineers&#39; new device, known as the  Norimaki Synthesizer,  can capture those five flavors, and use them to trick our brains into thinking we are tasting distinct foods, much in the same way our brains trick our eyes into seeing something that isn’t there. Think of it like looking at the display you are currently reading this article on — it uses pixels made up of red, green, and blue elements to make millions of different colors.\n  The Norimaki Synthesizer taste display was designed using five different color-coded gels made of agar packed into a tube shape, which uses glycerin for sweet, citric acid for acidic, sodium chloride for salty, magnesium chloride for bitter, and glutamic sodium for umami. When pressed against the tongue, users experience all of the flavors at the same time, however mixing those gels and adjusting their amounts and intensities creates specific flavors.\n The tubes for the display are wrapped in copper foil, so when they are held in hand and make contact with the tongue, it creates an electrical circuit via the human body, which is known as ion electrophoresis. The process moves molecules in a gel when a current is applied, moving the molecules to the cathode side away from the tongue, resulting in a weak flavor for that particular gel.\n  It’s a subtractive process that removes certain flavors gradually to render a specific taste. In tests, the team found that they could replicate the flavors of everything from sushi to gummy candy without eating a single piece of food.", "posttime": "2020-05-31 22:09:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,大学,university,味道", "title": "明治大学开发几乎可以重现每一种味道的味觉展示", "title_en": "Meiji University Develop Taste Display That Can Recreate Nearly Every Flavor", "transed": 1, "url": "https://www.hackster.io/news/meiji-university-engineers-develop-taste-display-that-can-recreate-nearly-every-flavor-f1120994954b", "via": "", "real_tags": ["开发", "大学", "味道"]}, {"category": "", "categoryclass": "", "imagename": "080e3b0db1f05ffd1aed9f27aaae1e92.png", "infoid": 1004520, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个我一生都热爱和支持的组织也走向了黑暗面。\n是时候取消那份终身订阅了。(说真的，国家地理现在对我来说已经死了，因为我这样做了。这和“国家地理”已经不一样了。)。\n另一家对我来说应该是死路一条的公司，因为它在历史性的广播中毫无根据地破坏和删除了至关重要的流(YouTube的所有者)是……。\n我现在讨厌谷歌，因为你非法和错误地关闭了那些正在广播并作为一个社区一起庆祝的人，从而极大地伤害了我们社区的无辜欢呼，因为你非法和错误地关闭了那些正在广播的人，并将其作为一个社区一起庆祝，从而推动人类成为一个更好的物种，成为一个太空飞行物种。", "note_en": "An organization that I&#39;ve loved and supported ALL my life, has gone to the Dark Side as well.\n  Time to cancel that life long subscription. (Seriously: National Geographic is now dead to me, for doing this. This just isn&#39;t the same National Geographic anymore.)\n Another company that should be dead to me for unfoundedly destroying and taking down vitally important streams during historic broadcasts (who owns youtube) is...\n   I hate Google right now for how you greatly harmed our innocent viewing pleasure and how you greatly harmed our community&#39;s innocent cheering on of humanity&#39;s push to become a better species, and a space faring species, by illegally and WRONGLY shutting down those who were broadcasting and celebrating this as a community together.", "posttime": "2020-05-31 22:08:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "youtube,国家,geographic,无辜", "title": "国家地理非法声称所有Youtuber的流：SpaceXLounge", "title_en": "National Geographic Illegally Claimed Every Youtuber’s Stream: SpaceXLounge", "transed": 1, "url": "https://pay.reddit.com/r/SpaceXLounge/comments/gtwj02/national_geographic_illegally_claimed_every/", "via": "", "real_tags": ["youtube", "国家", "无辜"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004519, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Waymo的自动驾驶小型货车将重返旧金山湾区的街道。三个月前，由于冠状病毒大流行，该公司停止了对其自动驾驶汽车的公开测试。\n根据The Verge获得的一封电子邮件，Waymo计划在6月8日将其自动驾驶小型货车车队重新推出湾区街道。但这些车辆将不再运送乘客，而是专注于为非营利性组织#DrawTogether和灯塔递送包裹。#DrawTogether为儿童提供艺术工具包，灯塔为盲人和视障人士提供服务。\nTransdev在电子邮件中表示，将根据“工作技能、业务需求和资历”召回一些员工。Transdev为其自动驾驶小型货车雇佣了Waymo的后备司机。向非营利性组织的送货将只需要每辆车上有一名后备司机，返回的工人将接受包括社会距离和消毒在内的新安全程序的培训课程。\nAlphabet旗下公司的一位发言人在一份声明中向The Verge证实：“很快，旧金山人也将开始看到一些Waymo汽车重新上路，我们为能向社区合作伙伴提供慈善送货支持而感到自豪。”\n在即将返回旧金山湾区之前，Waymo重新启动了其在凤凰城的测试计划，因为本月早些时候放松了封锁限制。同样，该公司对返乡工人实施了新的安全措施，他们都被要求接受培训。自动驾驶汽车也将很快回到底特律和洛杉矶。\n在Waymo的车辆停放的同时，该公司通过模拟继续开发其自动驾驶汽车技术，这在冠状病毒爆发之前就已经在其运营中发挥了重要作用。\nWaymo表示，一天的模拟相当于100年的真实世界驾驶，因此任何新软件的大多数开发工作都是从模拟开始，然后再推广到自动驾驶汽车。现实世界的驾驶仍然很重要，但相对有限。\n在模拟中，Waymo可能会重播其测试车辆行驶2000万英里的真实世界中的某些时刻。乘客也可能被模拟，机器学习模型试图预测驾驶行为将如何影响乘客的体验。", "note_en": "Waymo’s self-driving minivans will return to San Francisco Bay Area streets, three months after the company stopped public testing of its autonomous vehicles due to  the coronavirus pandemic.\n Waymo plans to relaunch its fleet of self-driving minivans into Bay Area streets on June 8, according to  an email acquired by The Verge. But instead of transporting passengers, the vehicles will instead focus on delivering packages for non-profit organizations  #DrawTogether, which gives art kits to children, and  Lighthouse for the Blind and Visually Impaired.\n Transdev, which employs Waymo’s backup drivers for its self-driving minivans, said in the email that it will call back some of its workers depending on “job skills, business need, and seniority.” The deliveries to the non-profit organizations will need only one backup driver in each vehicle, and returning workers will undergo training sessions for new safety procedures that include social distancing and disinfection.\n “Soon San Franciscans will also begin to see some Waymo vehicles back on the road, and we’re proud to provide charitable delivery support to community partners,” a spokesperson for the Alphabet-owned company confirmed with The Verge in a statement.\n The pending return to the Bay Area follows Waymo’s restart of its testing program in  Phoenix, as lockdown restrictions were eased earlier this month. Similarly, the company implemented new safety measures for returning workers, who were all required to undergo training. The autonomous vehicles will also soon also make their way back in Detroit and Los Angeles.\n  While Waymo’s vehicles were parked, the company continued developing its autonomous vehicle technology through  simulations, which already played a major role in its operations before the coronavirus outbreak.\n A single day of simulations is equivalent to 100 years of real-world driving, so most of the development work on any new software starts with simulations before rolling out to self-driving vehicles, according to Waymo. Real-world driving is still important, but it is comparably limited.\n In simulations, Waymo may replay certain moments from 20 million miles of real-world driving by its test vehicles. Passengers may also be simulated, with machine learning models attempting to predict how driving behavior will affect the experience of passengers.", "posttime": "2020-05-31 21:36:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "旧金山,湾区,旧金山湾,driving,waymo", "title": "Waymo的自动驾驶小型货车返回凤凰城、底特律、洛杉矶和旧金山湾区", "title_en": "Waymo's Self-Driving Minivans Return to Phoenix, Detroit, Los Angeles, and the Bay Area", "transed": 1, "url": "https://finance.yahoo.com/news/waymo-bring-self-driving-minivans-223652239.html", "via": "", "real_tags": ["旧金山", "湾区", "旧金山湾", "driving", "waymo"]}, {"category": "", "categoryclass": "", "imagename": "c7ed5d5c578693ae0fd3279cd18f70cf.png", "infoid": 1004518, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着云计算的发展，容器继续变得越来越流行。我们实现容器的方式正在引入新的解决方案和想法。其中一个新想法是无根容器。\n无根容器是一个新的容器概念，它不需要root权限即可制定。已经提出了许多解决方案来克服创建具有非特权用户的容器的技术挑战，其中一些仍在开发中，一些已经准备好投入生产。虽然无根容器呈现出一些优势，主要是从安全角度来看，但它们仍处于早期阶段。\n在这篇文章中，第42单元研究员Aviv Sasson回顾了无根容器的内部结构。Aviv还提供了他在其中一个名为Slirp的主要无根网络组件中发现的漏洞。运行Prisma Cloud的Palo Alto Networks客户可通过主机和容器漏洞扫描程序保护其免受此漏洞的攻击，该扫描程序会对使用此漏洞运行的软件组件发出警报。\n顾名思义，无根容器与传统容器相同，但不同之处在于它们不需要root特权即可形成。\n如今，无根容器仍处于早期采用阶段，但已经得到该领域主要参与者的支持。\n添加新的安全层。如果容器引擎、运行时或协调器受到危害，攻击者将不会获得主机上的root权限。\nLinux内核中的一项新开发使此解决方案成为可能，它允许非特权用户创建新的用户名称空间。当用户创建并输入新的用户名称空间时，他将成为该名称空间上下文中的root用户，并获得生成正常运行的容器所需的大部分权限。\n我不会深入研究用户命名空间的技术细节，但是在影响整个系统的区域中，命名空间根没有真正的根拥有特权(例如，命名空间根不能加载或删除内核模块)。这导致了由每个容器引擎以不同方式解决的一些挑战。\n为了在容器内实现适当的联网，通常会创建一个虚拟以太网设备(Veth)并负责联网。这给无根容器带来了问题，因为只有真正的root才有权创建这样的设备。提出了许多解决方案来解决该问题-主要的解决方案是Slirp和LXC-User-NIC。\nSlirp是一个广为人知的项目，最初主要用于QEMU(又名Quick Emulator)中的联网。经过一些修改后，它被调整为在无根容器中启用网络。它的工作方式是分叉到容器的用户和网络名称空间，并创建一个成为默认路由的分路设备。然后，它将设备的文件描述符传给在默认网络名称空间中运行的父设备，该父设备现在可以与容器和Internet进行通信。\n设置网络的另一种方法是运行创建veth设备的setuid二进制文件。尽管它确实启用了容器内部的网络，但它忽略了无根容器的要点，因为它要求容器二进制文件以root权限运行。\n实现容器的一个复杂元素是存储管理。默认情况下，容器引擎使用称为Overlay2(或Overlay)的特殊驱动程序来创建空间和性能都很高效的分层文件系统。使用无根容器不能做到这一点，因为大多数Linux发行版不允许在用户名称空间中挂载覆盖文件系统(Ubuntu是个例外)。这个问题驱使无根容器与其他驱动程序和文件系统一起工作。\n显而易见的解决方案是使用另一个驱动程序，如VFS存储驱动程序。虽然它起作用了，但它的效率要低得多。更好的解决方案是创建一个新的存储驱动程序来满足无根容器的需要。一个这样的驱动器是FUSE-OverlayFS。它是Overlay的用户空间实现，比VFS更高效，并且可以在用户名称空间内运行。\nLinux控制组(Cgroup)特性是实现容器的另一个关键元素，它允许将进程和容器组织成分层的组，然后可以限制和监视各种类型的资源的使用。由于内核的cgroups接口是通过伪文件系统提供的，该伪文件系统通常驻留在“/sys”(根拥有的目录)中，因此非root用户无法访问和使用它。\ncgroup的新内核实现，支持将权限委派给非特权用户。缺点是V2不支持为cgroups V1实现的所有控制器(例如，DEVICES、NET_CLS、NET_PRIO等)。\nLXC针对该问题的另一个解决方案是安装pam_cgfs.so，这是一个可插拔的身份验证模块(PAM模块)，允许非特权用户对cgroup进行身份验证和管理。", "note_en": "As cloud computing evolves, containers continue to become more and more popular. New solutions and ideas to the way we implement containers are being introduced. One of these new ideas is rootless containers.\n Rootless containers is a new concept of containers that don’t require root privileges in order to formulate. Many solutions have been proposed to overcome the technological challenges of creating a container with an unprivileged user, some of them are still under development and some are production-ready. While rootless containers present some advantages, mainly from a security perspective, they are still in their early stages.\n In this post, Unit 42 researcher Aviv Sasson reviews the internals of rootless containers. Aviv also presents a vulnerability he found in one of the major rootless networking components called Slirp.  Palo Alto Networks customers running   Prisma Cloud  are protected from this vulnerability with the host and container vulnerability scanner, which alerts on software components running with this vulnerability.\n  As the name implies, rootless containers are the same as conventional containers but differentiate in the fact that they don’t need root privileges in order to be formed.\n Nowadays, rootless containers are still in early adoption stages, but are already supported by the major players in the field.\n  Adding a new security layer. In case the container engine, runtime or orchestrator is compromised, the attacker won’t gain root privileges on the host.\n This solution was made possible by a new development in the Linux kernel that allows unprivileged users to create new  user namespaces. When a user creates and enters a new user namespace, he becomes root in the context of that namespace and gains most of the privileges required to spawn a functioning container.\n I won’t dig into user namespace technicalities, but namespace root isn’t as privileged as real root in areas that affect the entire system (for example, a namespace root cannot load or delete kernel modules). This led to some challenges that were solved differently by each container engine.\n  In order to allow proper networking inside a container, usually, a Virtual Ethernet device (VETH) is created and in charge of the networking. This poses a problem for rootless containers, as only real root has the privileges to create such devices. A number of solutions were proposed to solve the problem — the main ones being Slirp and LXC-user-nic.\n  Slirp is a well-known project that was originally and mainly used for networking in  QEMU (aka Quick Emulator). After some modifications, it was adjusted to enable networking in rootless containers. It works by forking into the container’s user and network namespaces and creating a tap device that becomes the default route. It then passes the device’s file descriptor to the parent who runs in the default network namespace, which is now able to communicate both with the container and the internet.\n   Another way to set up networking is by running a  setuid binary that creates a VETH device. Although it does enable networking inside the container, it misses the point of rootless containers because it requires the container binary to run with root privileges.\n  One of the complex elements in implementing containers is storage management. By default, container engines use a special driver called Overlay2 (or Overlay) to create a layered filesystem that is efficient in both space and performance. This cannot be done with rootless containers, as most Linux distributions don’t allow mounting overlay filesystems in user namespaces (Ubuntu is an exception). This problem drove rootless containers to work with other drivers and filesystems.\n The obvious solution was to use another driver, like the  VFS storage driver. While it works, it is significantly  less efficient. The better solution was to create a new storage driver to suit the needs of rootless containers. One such driver is the  FUSE-OverlayFS. It’s a user-space implementation of Overlay, which is more efficient then VFS and can run inside user namespaces.\n  The Linux control group (cgroups) feature, another key element of implementing containers, allows processes and containers to be organized into hierarchical groups whose usage of various types of resources can then be limited and monitored. Since the kernel’s cgroups interface is provided through a pseudo-filesystem that usually resides in “/sys” (a root owned directory), a non-root user cannot access and utilize it.\n   A new kernel implementation of cgroups that supports delegating permissions to unprivileged users. The downside is that V2 doesn’t support all the controllers that were implemented for cgroups V1 (e.g.  devices,  net_cls, net_prio,etc.).\n  Another solution to the problem, by LXC, is to install pam_cgfs.so, which is a Pluggable Authentication Module ( PAM module) that will allow unprivileged users to authenticate and manage cgroups.", "posttime": "2020-05-31 21:04:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "容器,rootless", "title": "无根容器", "title_en": "Rootless Containers", "transed": 1, "url": "https://unit42.paloaltonetworks.com/rootless-containers-the-next-trend-in-container-security/", "via": "", "real_tags": ["容器", "rootless"]}, {"category": "", "categoryclass": "", "imagename": "79b9feb72e26403ca8d15017cf21dd54.jpg", "infoid": 1004517, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在5月27日星期三停止发射后，SpaceX现在的目标是5月30日星期六发射猎鹰9号，这是Crew Dragon的第二次演示(de.", "note_en": "After standing down from launch on Wednesday May 27, SpaceX is now targeting Saturday, May 30 for Falcon 9’s launch of Crew Dragon’s second demonstration (De...", "posttime": "2020-05-31 21:04:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "国际,iss,发射", "title": "龙-国际空间站交会正在进行中", "title_en": "Dragon-ISS Rendezvous in Progress", "transed": 1, "url": "https://www.youtube.com/watch?v=bIZsnKGV8TE&resubmit=1", "via": "", "real_tags": ["国际", "iss", "发射"]}, {"category": "", "categoryclass": "", "imagename": "c5a88ab41660229185a4e6b24972e06b.jpg", "infoid": 1004516, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "金世辉(2005)。室温下二氧化硅表面吸附水层结构的演化。物理化学杂志B109,16760-16763。|室温下硅氧化物表面吸附水层结构的演化|GoogleScholarGoogle Scholar|16853134PubMed|Aznar M，López R，Cacho JF，Ferreira V(2001)。里奥哈陈年红酒冲击性气味的鉴定与定量。GC-−嗅觉测定法、定量GC-MS和高效液相色谱馏分的气味评价。农业与食品化学学报49,2924-2929。|里奥哈陈年红酒冲击性气味的鉴定与定量。GC−嗅觉测定法、定量GC-MS和高效液相色谱组分的气味评价Crossref|谷歌学者|11409988PubMed|Cardis D，TAPP C，DeBrum M，Rice RG(2007年)。臭氧在洗衣业中的应用--英国的实践经验。臭氧科学与工程29，85-99。|洗衣业的臭氧--英国的实践经验|谷歌学者|Enami S，Hoffmann Mr，Colussi AJ(2017)。克里吉中间体与左旋葡聚糖在水中反应。物理化学期刊快报8,3888-3894。|Criegee中间体与左旋葡聚糖在水上反应Crossref|GoogleScholarGoogle Scholar|28767252PubMed|Fahlbusch KG，Hammerschmidt FJ，Panten J，Pickagen W，Schatkowski D，Bauer K，Garbe D，Surburg H(2012年)。香料和香水。乌尔曼工业化学百科全书。第15卷，第73-198页。(威利：新泽西州霍博肯)法拉利G，Lablanquie O，坎特格勒R，Ledauphin J，Payot T，Fournier N，Guichard E(2004)。用GC-O、GC-MS和感官评定测定新鲜蒸馏白兰地中的主要气味成分。农业与食品化学杂志52,5670-5676。|用GC-O、GC-MS和感官评定测定新鲜蒸馏白兰地中的关键气味成分Crossref|Google Scholar Google Scholar|15373408PubMed|Grego E，Roca FJ，Perales JF，Guardino X(2010)。多吸附床(Carbotrap，Carbopack X，Carboxen 569)和Tenax TA吸附管对挥发性有机物(VOCs)吸附性能的比较研究。塔兰塔81,916-924。|多吸附床(Carbotrap、Carbopack X、Carboxen 569)与Tenax TA吸附管分析挥发性有机物(VOC)的吸附性能对比研究CrossRef|GoogleScholarGoogle Scholar|20298873PubMed|Harnung SE，Johnson MS(2012)。“化学和环境。”(剑桥大学出版社：剑桥)Horie O，Moortgat GK(1991)。单烯烃臭氧化反应中激发的Criegee中间体的分解途径。大气环境。A部分，一般专题25,1881-1896年。|简单烯烃臭氧分解中激发的Criegee中间体的分解途径|Google ScholarGoogle Scholar|Hughes Ka(2007)。“为了对抗全球变暖，一些人挂上了衣裤。”纽约时报，4月12日，3-5日，Khan MAH，Percival CJ，Caravan RL，Taatjes CA，ShallCross DE(2018)。克里吉中间体及其对对流层的影响。环境科学。流程与影响20,437-453。|Criegee中间体及其对对流层的影响|GoogleScholarGoogle Scholar|Kepp IG，Buck M，Laitala K，Kjeldsberg M(2016)。有什么问题吗？运动服中的气味控制和汗味。时尚实践8,296-317。|问：有什么问题？SportswearCrossref中的气味控制和汗味|GoogleScholarGoogle Scholar|Labhard LA，Pedersen El(1989)。洗衣实践：在线烘干和负载特性。“消费者研究与家政杂志”第13期，307-312期。|洗衣实践：线干和负载特征Crossref|谷歌学者|LaFranchi BW，Wolfe GM，Thornton JA，Harrold SA，Browne EC，Min Ke，Wooldridge PJ，Gilman JB，Kuster WC，Goldan PD，de Gouw JA，McKay M，Goldstein AH，Ren X，Maoldridge PJ，Cohen RC(2009)。关闭过氧乙酰硝酸盐预算：2007 BEARPEX期间酰基过氧硝酸盐(PAN、PPN和MPAN)的观察。大气化学与物理9,7623-7641。|关闭过氧乙酰硝酸盐预算：BEARPEX 2007期间酰基过氧硝酸盐(PAN、PPN和MPAN)的观察|GoogleScholarGoogle Scholar|Leffingwell J，Leffingwell D(1991)。GRAS风味化学品.检测阈值。香水师和调味师78，1-13，Lovelock je，Penkett SA(1974)。大西洋上空的平底锅和干净亚麻的气味。大自然249,434|大西洋上空的平底锅和干净亚麻的气味Crossref|谷歌学者|莫里斯·马(Morris MA)，普拉托·HH(Prato HH", "note_en": "Asay DB, Kim SH (2005 ). Evolution of the Adsorbed Water Layer Structure on Silicon Oxide at Room Temperature.  The Journal of Physical Chemistry B  109, 16760–16763.  |   Evolution of the Adsorbed Water Layer Structure on Silicon Oxide at Room TemperatureCrossref |   GoogleScholarGoogle Scholar |   16853134PubMed |      \r\t\t\t\t\t\t\t\tAznar M, López R, Cacho JF, Ferreira V (2001 ). Identification and Quantification of Impact Odorants of Aged Red Wines from Rioja. GC−Olfactometry, Quantitative GC-MS, and Odor Evaluation of HPLC Fractions.  Journal of Agricultural and Food Chemistry  49, 2924–2929. |   Identification and Quantification of Impact Odorants of Aged Red Wines from Rioja. GC−Olfactometry, Quantitative GC-MS, and Odor Evaluation of HPLC FractionsCrossref |   GoogleScholarGoogle Scholar |   11409988PubMed |      \r\t\t\t\t\t\t\t\tCardis D, Tapp C, DeBrum M, Rice RG (2007 ). Ozone in the laundry industry – Practical experiences in the United Kingdom.  Ozone Science and Engineering  29, 85–99. |   Ozone in the laundry industry – Practical experiences in the United KingdomCrossref |   GoogleScholarGoogle Scholar |      \r\t\t\t\t\t\t\t\tEnami S, Hoffmann MR, Colussi AJ (2017 ). Criegee intermediates react with levoglucosan on water.  The Journal of Physical Chemistry Letters  8, 3888–3894. |   Criegee intermediates react with levoglucosan on waterCrossref |   GoogleScholarGoogle Scholar |   28767252PubMed |      \r\t\t\t\t\t\t\t\tFahlbusch KG, Hammerschmidt FJ, Panten J, Pickenhagen W, Schatkowski D, Bauer K, Garbe D, Surburg H (2012). Flavors and fragrances. Ullmann’s Encyclopedia of Industrial Chemistry. Vol. 15, pp. 73–198. (Wiley: Hoboken, NJ)      \r\t\t\t\t\t\t\t\tFerrari G, Lablanquie O, Cantagrel R, Ledauphin J, Payot T, Fournier N, Guichard E (2004 ). Determination of key odorant compounds in freshly distilled cognac using GC-O, GC-MS, and sensory evaluation.  Journal of Agricultural and Food Chemistry  52, 5670–5676. |   Determination of key odorant compounds in freshly distilled cognac using GC-O, GC-MS, and sensory evaluationCrossref |   GoogleScholarGoogle Scholar |   15373408PubMed |      \r\t\t\t\t\t\t\t\tGallego E, Roca FJ, Perales JF, Guardino X (2010 ). Comparative study of the adsorption performance of a multi-sorbent bed (Carbotrap, Carbopack X, Carboxen 569) and a Tenax TA adsorbent tube for the analysis of volatile organic compounds (VOCs).  Talanta  81, 916–924. |   Comparative study of the adsorption performance of a multi-sorbent bed (Carbotrap, Carbopack X, Carboxen 569) and a Tenax TA adsorbent tube for the analysis of volatile organic compounds (VOCs)Crossref |   GoogleScholarGoogle Scholar |   20298873PubMed |      \r\t\t\t\t\t\t\t\tHarnung SE, Johnson MS (2012). ‘Chemistry and the environment.’ (Cambridge University Press: Cambridge)      \r\t\t\t\t\t\t\t\tHorie O, Moortgat GK (1991 ). Decomposition pathways of the excited Criegee intermediates in the ozonolysis of simple alkenes.  Atmospheric Environment. Part A, General Topics  25, 1881–1896. |   Decomposition pathways of the excited Criegee intermediates in the ozonolysis of simple alkenesCrossref |   GoogleScholarGoogle Scholar |      \r\t\t\t\t\t\t\t\tHughes KA (2007). ‘To Fight Global Warming, Some Hang a Clothesline.’  New York Times, 12 April, 3–5.      \r\t\t\t\t\t\t\t\tKhan MAH, Percival CJ, Caravan RL, Taatjes CA, Shallcross DE (2018 ). Criegee intermediates and their impacts on the troposphere.  Environmental Science. Processes &amp; Impacts  20, 437–453. |   Criegee intermediates and their impacts on the troposphereCrossref |   GoogleScholarGoogle Scholar |      \r\t\t\t\t\t\t\t\tKlepp IG, Buck M, Laitala K, Kjeldsberg M (2016 ). What’s the Problem? Odor-control and the Smell of Sweat in Sportswear.  Fashion Practice  8, 296–317. |   What’s the Problem? Odor-control and the Smell of Sweat in SportswearCrossref |   GoogleScholarGoogle Scholar |      \r\t\t\t\t\t\t\t\tLabhard LA, Pedersen EL (1989 ). Laundry practices: line-drying and load characteristics.  Journal of Consumer Studies &amp; Home Economics  13, 307–312. |   Laundry practices: line-drying and load characteristicsCrossref |   GoogleScholarGoogle Scholar |      \r\t\t\t\t\t\t\t\tLaFranchi BW, Wolfe GM, Thornton JA, Harrold SA, Browne EC, Min KE, Wooldridge PJ, Gilman JB, Kuster WC, Goldan PD, de Gouw JA, McKay M, Goldstein AH, Ren X, Mao J, Cohen RC (2009 ). Closing the peroxy acetyl nitrate budget: observations of acyl peroxy nitrates (PAN, PPN, and MPAN) during BEARPEX 2007.  Atmospheric Chemistry and Physics  9, 7623–7641. |   Closing the peroxy acetyl nitrate budget: observations of acyl peroxy nitrates (PAN, PPN, and MPAN) during BEARPEX 2007Crossref |   GoogleScholarGoogle Scholar |      \r\t\t\t\t\t\t\t\tLeffingwell J, Leffingwell D (1991 ). GRAS flavor chemicals-detection thresholds.  Perfumer and Flavorist  78, 1–13.      \r\t\t\t\t\t\t\t\tLovelock JE, Penkett SA (1974 ). PAN over the Atlantic and the smell of clean linen.  Nature  249, 434 |   PAN over the Atlantic and the smell of clean linenCrossref |   GoogleScholarGoogle Scholar |      \r\t\t\t\t\t\t\t\tMorris MA, Prato HH, White NL (1984 ). Line‐Dried vs. Machine‐Dried Fabrics: Comparison of Appearance, Hand, and Consumer Acceptance.  Home Economics Research Journal  13, 27–35. |   Line‐Dried vs. Machine‐Dried Fabrics: Comparison of Appearance, Hand, and Consumer AcceptanceCrossref |   GoogleScholarGoogle Scholar |      \r\t\t\t\t\t\t\t\tMulders EJ (1973 ). The odour of white bread - IV. Quantitative determination of constituents in the vapour and their odour values.  Zeitschrift fur Lebensmittel-Untersuchung und Forschung  151, 310–317. |   The odour of white bread - IV. Quantitative determination of constituents in the vapour and their odour valuesCrossref |   GoogleScholarGoogle Scholar |      \r\t\t\t\t\t\t\t\tNagata Y (2003 ). Measurement of Odor Threshold by Triangle Odor Bag Method.  Odor Measurement Review  1187, 118–127.      \r\t\t\t\t\t\t\t\tPerincek SD, Duran K, Korlu AE, Bahtiyari IM (2007 ). An investigation in the use of ozone gas in the bleaching of cotton fabrics.  Ozone Science and Engineering  29, 325–333. |   An investigation in the use of ozone gas in the bleaching of cotton fabricsCrossref |   GoogleScholarGoogle Scholar |      \r\t\t\t\t\t\t\t\tRai AC, Guo B, Lin CH, Zhang J, Pei J, Chen Q (2014 ). Ozone reaction with clothing and its initiated VOC emissions in an environmental chamber.  Indoor Air  24, 49–58. |   Ozone reaction with clothing and its initiated VOC emissions in an environmental chamberCrossref |   GoogleScholarGoogle Scholar |   23841649PubMed |      \r\t\t\t\t\t\t\t\tRice RG, DeBrum M, Cardis D, Tapp C (2009 ). The ozone laundry handbook: A comprehensive guide for the proper application of ozone in the commercial laundry industry.  Ozone Science and Engineering  31, 339–347. |   The ozone laundry handbook: A comprehensive guide for the proper application of ozone in the commercial laundry industryCrossref |   GoogleScholarGoogle Scholar |      \r\t\t\t\t\t\t\t\tSander R (2015 ). Compilation of Henry’s law constants (version 4.0) for water as solvent.  Atmospheric Chemistry and Physics  15, 4399–4981. |   Compilation of Henry’s law constants (version 4.0) for water as solventCrossref |   GoogleScholarGoogle Scholar |      \r\t\t\t\t\t\t\t\tSeinfeld JH, Pandis SN (2016). ‘Atmospheric chemistry and physics: From air pollution to climate change, 3rd edn.’ (John Wiley: Hoboken, NJ)      \r\t\t\t\t\t\t\t\tSharma M, Hudson JB (2008 ). Ozone gas is an effective and practical antibacterial agent.  American Journal of Infection Control  36, 559–563. |   Ozone gas is an effective and practical antibacterial agentCrossref |   GoogleScholarGoogle Scholar |   18926308PubMed |      \r\t\t\t\t\t\t\t\tSheps L, Rotavera B, Eskola AJ, Osborn DL, Taatjes CA, Au K, Shallcross DE, Khan MAH, Percival CJ (2017 ). The reaction of Criegee intermediate CH2OO with water dimer: primary products and atmospheric impact.  Physical Chemistry Chemical Physics  19, 21970–21979. |   The reaction of Criegee intermediate CH 2OO with water dimer: primary products and atmospheric impactCrossref |   GoogleScholarGoogle Scholar |   28805226PubMed |      \r\t\t\t\t\t\t\t\tStora T, Escher S, Morris A (2001 ). The physicochemical basis of perfume performance in consumer products.  Chimia  55, 406–412.      \r\t\t\t\t\t\t\t\tThomas S, Paul SA, Pothan LA, Deepa B (2011). Natural fibres: structure, properties and applications. In ‘Cellulose fibers: Biol.- and nano-polymer composites’. (Eds S Kalia, B Kaith, I Kaur) pp. 3–42. (Springer: Berlin)      \r\t\t\t\t\t\t\t\tTinel L, Donaldson J, Brüggemann M, George C, Hayeck N (2018). Interfacial photochemistry. In ‘Physical chemistry of gas-liquid interfaces’. (Eds JA Faust, JE House) pp. 435–457. (Elsevier: Amsterdam)      \r\t\t\t\t\t\t\t\tTobias HJ, Ziemann PJ (2001 ). Kinetics of the gas-phase reactions of alcohols, aldehydes, carboxylic acids, and water with the C13 stabilized Criegee intermediate formed from ozonolysis of 1-tetradecene.  The Journal of Physical Chemistry A  105, 6129–6135. |   Kinetics of the gas-phase reactions of alcohols, aldehydes, carboxylic acids, and water with the C13 stabilized Criegee intermediate formed from ozonolysis of 1-tetradeceneCrossref |   GoogleScholarGoogle Scholar |      \r\t\t\t\t\t\t\t\tVereecken L, Novelli A, Taraborrelli D (2017 ). Unimolecular decay strongly limits the atmospheric impact of Criegee intermediates.  Physical Chemistry Chemical Physics  19, 31599–31612. |   Unimolecular decay strongly limits the atmospheric impact of Criegee intermediatesCrossref |   GoogleScholarGoogle Scholar |   29182168PubMed |      \r\t\t\t\t\t\t\t\tZhou X, Lee YN (1992 ). Aqueous solubility and reaction kinetics of hydroxymethyl hydroperoxide.  Journal of Physical Chemistry  96, 265–272. |   Aqueous solubility and reaction kinetics of hydroxymethyl hydroperoxideCrossref |   GoogleScholarGoogle Scholar |      \r\t\t\t\t\t\t\t\tZhu C, Kumar M, Zhong J, Li L, Francisco JS, Zeng XC (2016 ). New mechanistic pathways for Criegee–water chemistry at the air/water interface.  Journal of the American Chemical Society  138, 11164–11169. |   New mechanistic pathways for Criegee–water chemistry at the air/water interfaceCrossref |   GoogleScholarGoogle Scholar |   27509207PubMed |", "posttime": "2020-05-31 20:51:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "干洗,analysis,气味", "title": "线式干洗衣物气味的化学分析及来源", "title_en": "Chemical analysis and origin of the smell of line-dried laundry", "transed": 1, "url": "https://www.publish.csiro.au/en/EN19206", "via": "", "real_tags": ["干洗", "analysis", "气味"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004514, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：我们描述了一个围棋中泛型的设计，灵感来自于Igarashi、Piels和Wadler之前在Featherweight Java上的工作。Java子类型是名义上的，Go中是结构化的，而Java中的泛型是通过擦除定义的，而Go中我们使用的是单形化。虽然单形化被广泛使用，但我们是最先将其正规化的人之一。我们的设计还支持表达式问题的解决方案。", "note_en": "Download PDF  Abstract: We describe a design for generics in Go inspired by previous work onFeatherweight Java by Igarashi, Pierce, and Wadler. Whereas subtyping in Javais nominal, in Go it is structural, and whereas generics in Java are definedvia erasure, in Go we use monomorphisation. Although monomorphisation is widelyused, we are one of the first to formalise it. Our design also supports asolution to The Expression Problem.", "posttime": "2020-05-31 19:08:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "羽量级,featherweight,java", "title": "羽量级围棋", "title_en": "Featherweight Go", "transed": 1, "url": "https://arxiv.org/abs/2005.11710", "via": "", "real_tags": ["羽量级", "java"]}, {"category": "", "categoryclass": "", "imagename": "d78737b2a034dc68c40100ba072674ed.jpeg", "infoid": 1004513, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在最近的一次市政厅会议上，马克·扎克伯格分享了Facebook在冠状病毒时代过渡到远程工作的经验教训和战略。不过，尽管他谈到要创造一种“深思熟虑、负责任的”在家工作文化，但该公司的新薪资政策很难说是利他主义的。\n根据扎克伯格的说法，在疫情爆发期间搬出旧金山湾区的Facebook员工将面临生活费工资调整。那些不在2021年1月1日之前更新位置的人有“严重后果”的风险。\n但是，根据员工的居住地而不是他们的经验或产出来设定员工的工资是不合逻辑的。Basecamp联合创始人、“不需要远程办公”(Remote-Office Not Required)一书的合著者大卫·海内迈尔·汉森(David Heinemeier Hannson)表示，这也是“野蛮的”。\n作为一名远程工作顾问，我对Facebook的新政策为什么是错误的有强烈的看法。我有两种选择来代替它。\n尽管Facebook似乎专注于削减成本，但自大流行开始以来，业务一直很好。工作场所的订户几乎翻了一番，而六个月前成立的工作组拥有2000万日活跃用户。为了满足对远程协作工具日益增长的需求，并发明新的工具，Facebook将在美国和加拿大开始“积极”的招聘活动。\n第三类：该计划的第三阶段包括在北美更多的农村地区寻找人才。\n因此，尽管Facebook投资于扩大远程员工和建设新的中心，但它将降低现有员工的工资。到2020年，公司95%的员工将远程工作，但经理们有权决定哪些角色长期远程工作。\n与任何一家公司一样，Facebook过去也犯过很多商业失误。在2012年转向开放式办公室平面图后-旨在加强沟通和协作-数据显示，它产生了相反的效果。事实证明，开放式办公室会破坏生产力，员工对此深恶痛绝。同样，Facebook的新薪资政策弊大于利。公司只是还不知道而已。\n在远程工作的时代，拥有工作场所灵活性的公司将吸引并留住世界上最优秀的员工。他们也会省钱--即使他们给员工支付高额工资。最优秀的边远人才会去待遇最好的地方，而不是薪酬最低的地方。根据地点设定薪资将破坏Facebook的招聘努力，从而降低该公司的长期竞争力。\n强迫员工在职业、收入和生活质量之间做出权衡有什么好处？\n对于一家市值6540亿美元的公司来说，扣起员工的工资支票符合道德吗？(Facebook的人均年利润比财富500强中的任何一家科技公司都要高，达到634,694美元。)。\n按照扎克伯格的建议，哪些法规要求公司降低工资以遵守税收和报告要求？\n对于移居美国上大学或持H1B1签证然后返回本国的工人来说，这项政策会是什么？\n如果员工因个人原因暂时离开硅谷，然后搬回来怎么办？\nFacebook的独立承包商会受到怎样的影响？十分之七的美国自由职业者也想搬家。\n如果员工搬家，Facebook可以给他们更高的薪酬，而不是削减他们的工资。这就是Zapier所做的--早在2017年，一家硅谷公司就开始向员工提供1万美元的“迁址”激励，让他们搬离旧金山湾区。首席执行官韦德·福斯特说，\n我们早就接受了远程工作。并且认为你应该能够在你想去的任何地方工作，同时仍然在一个能帮助你实现职业目标的地方工作。\n因此，如果您住在旧金山湾区，但正在考虑做出改变，以提高您家庭的生活水平，我们热切希望能为您提供帮助。Zapier将提供高达10,000美元的资金，帮助您和您的家人重新安置到旧金山湾区以外的新家。\n虽然扎克伯格似乎不相信远程工作会减少他公司的管理费用，但完全分散的组织知道情况并非如此。异地旅行减少了房地产、管理和其他运营费用-即使考虑到设立家庭办公室、补贴合作会员和核算差旅费用的成本也是如此。\nZapier并不是唯一一家尝试远程工作激励的公司。2019年，美国各州和地方政府开始测试吸引远程员工的计划。每一家都提供现金补偿、税收抵免、住房津贴、合作会员资格和其他形式的支持。\nTulsa Remote的远程工作计划包括住房支持、共同工作津贴和1万美元现金。佛蒙特州的远程员工补助计划和内布拉斯加州的WorkNP计划为搬迁的远程员工提供高达5000美元的激励。\n与此同时，一家名为MainStreet的初创公司在2019年迅速走红，该公司宣布斥资1万美元帮助培训美国农村的工人，并将他们与远程科技工作相匹配。\n如果Facebook降低了对潜在员工的激励，而竞争对手却恰恰相反，那么他们如何能够吸引最优秀的人才呢？答案是任何人的猜测。\n同工同酬不一定完全是关于性别平等-它也可以适用于一个人的地理位置。那么，为什么不像Basecamp那样创建一致的薪酬等级和类别呢？\nBasecamp按照相同的比例支付所有程序员的工资，并使用第三方数据来获得市场工资率。尽管Basecamp在旧金山没有任何员工，但无论如何，员工的收入都在硅谷工资的前10%。该公司对年度加薪也有统一的政策。\nBasecamp的创始人知道，你做什么比你从哪里登录更重要，因此他们的员工保留率很高。\n(在大本营，)每个人都有选择自己想住的地方的自由，搬迁到生活成本更低的地区不会受到惩罚。我们鼓励远程工作，并且有许多员工在继续为Basecamp工作的同时，在各地生活过。-DHH，大本营CTO。\n另一家完全分布式的公司Help Scout根据员工反馈和逻辑，在2018年的薪酬公式中删除了地理位置作为一个变量。联合创始人尼克·弗朗西斯写道，\n偏远的公司显然自豪地对地理位置漠不关心。我们喜欢说，你可以在任何地方工作-我们没有国界，没有“市场”，但市场费率仍然是一个补偿因素。这不合情理。我们关心的是位置还是不关心？\n该公司在计算中不考虑地点的决定也是出于公平考虑：\n这是个数学问题--我们都应该知道，为了生产某种类型的工作，我们可以付给员工多少钱。\n不出所料，生活费工资公式在偏远地区的员工中非常不受欢迎。数字劳动力需要灵活性。为了吸引最优秀的人才，科技公司将需要相应地制定薪酬政策。\n扎克伯格说，他希望在Facebook增加创新、创造力、留住员工和员工多样性，但他的行动与他的言辞相矛盾。Facebook的新政策不会成为其他公司效仿的“北极星”，反而会产生相反的效果。这将打击现有员工的士气，削弱公司文化，同时稀释从更广泛的远程招聘池中获得的潜在收益。\n通过减薪建立远程工作基础开创了错误的先例。你不能通过告诉员工他们的价值与物理位置(或者更糟，IP位置)捆绑在一起，从而“服务于社区并开启创新”，尤其是在位置独立的时代。", "note_en": "In a recent  town hall meeting, Mark Zuckerberg shared  Facebook’s lessons and strategy for transitioning to remote work in the coronavirus era. But although he spoke of creating a “thoughtful and responsible” work-from-home culture, the company’s new salary policy is hardly altruistic.\n According to Zuckerberg, Facebook employees who move out of the Bay Area during the pandemic will face a cost-of-living salary adjustment. Those who don’t update their locations by January 1, 2021 risk “severe ramifications.”\n But setting employees’ salaries based on where they live rather than their experience or output is illogical. According to David Heinemeier Hannson, Basecamp co-founder and co-author of the book   Remote — Office Not Required, it’s also “barbaric.”\n  As a remote work consultant, I have strong opinions on why Facebook’s new policy is wrong. And I have two alternatives for what to do instead.\n  Although Facebook seems focused on cost-cutting, business has been good since the pandemic started.  Workplace subscribers have nearly doubled, while  Work Groups — launched six months ago — has twenty million daily active users. To meet the increased demand for remote collaboration tools and invent new ones, Facebook will begin an “aggressive” hiring push throughout the U.S. and Canada.\n    Category 3: The third phase of the plan consists of seeking out talent in the more rural areas of North America.\n So while Facebook invests in expanding its remote workforce and building new hubs, it will be reducing the salaries of existing employees. 95% of the company’s workforce is working remotely through 2020, but managers have discretion over which roles stay remote long-term.\n  Like any company, Facebook has made plenty of business missteps in the past. After moving to open-office floor plans in 2012 — designed to enhance communication and collaboration —  data showed it had the opposite effect. As it turns out, open-plan offices destroy productivity and  employees hate them. Likewise, Facebook’s new salary policy will do more harm than good. The company just doesn’t know it yet.\n In the age of remote work, companies with workplace flexibility will attract the best employees in the world and keep them. They’ll also save money — even if they pay employees at a premium. The best remote talent will go where they are treated best — not paid the least. Setting salaries based on location will undermine Facebook’s recruitment efforts, making the company less competitive long-term.\n   What is the benefit of forcing employees to make a trade-off between their careers, income, and quality-of-life?\n  Is it ethical for a company with market cap of $ 654 billion to dock employees’ paychecks?  (Facebook has a higher annual   profit-per-employee than any other tech company on the Fortune 500  —at $634,694.)\n Which regulation(s) require a company to lower salaries to comply with tax and reporting requirements, as Zuckerberg suggested?\n   What would the policy be for workers who move to the U.S. for college or on H1B1 visas, then return to their home countries?\n What if an employee temporarily relocates away from Silicon Valley for personal reasons, then moves back?\n  How would Facebook’s independent contractors be affected?  Seven in ten U.S. freelancers want to move somewhere, too.\n  Rather than cutting employees’ salaries if they move, Facebook could pay them  more. That’s what  Zapier does — a Silicon Valley company that began offering employees a $10,000 “de-location” incentive to move away from the Bay Area back in 2017. Said CEO,  Wade Foster,\n We’ve long embraced remote working. And think you should be able to work wherever you want and still work at a place that helps you achieve your career goals.\n So if you’re living in the Bay Area but thinking about making a change that will improve your family’s standard of living, we’re eager to help. Zapier will provide up to $10,000 to help relocate you and your family to your new home outside the Bay Area.\n While Zuckerberg seems unconvinced that remote work will decrease his company’s overhead, fully-distributed organizations know otherwise. Going remote reduces real estate, managerial, and other operating expenses— even when factoring in the cost of setting up home offices, subsidizing co-working memberships, and accounting for travel expenses.\n   Zapier isn’t the only company to experiment with remote work incentives. State and local governments across the U.S. began testing programs to attract remote workers in 2019. Each one offered some combination of cash compensation, tax credits, housing allowances, co-working memberships, and other forms of support.\n Tulsa Remote’s remote work program includes housing support, a co-working allowance, and $10,000 in cash. Vermont’s  Remote Worker Grant and Nebraska’s  WorkNP program offer up to $5,000 in incentives to remote workers who relocate.\n Meanwhile, a startup called  MainStreet went viral in 2019 when it announced a $10,000 offer to help train workers in rural America and match them with remote tech jobs.\n  How will Facebook be able to attract the best talent if they de-incentivize prospective employees, while competitors do the opposite? The answer is anyone’s guess.\n  Equal pay for equal work doesn’t have to be exclusively about gender equality — it can also apply to one’s geographic location. So, why not create consistent pay grades and categories,  like Basecamp does?\n Basecamp pays all its programmers according to  the same scale and uses third-party data to get market salary rates. Even though Basecamp doesn’t have any staff in San Francisco, employees  earn in the top 10% of Silicon Valley wages regardless. The company also has a uniform policy on annual raises.\n Basecamp’s founders know that what you do is more important than where you log in from, and their employee retention is high because of it.\n [At Basecamp,] everyone has the freedom to pick where they want to live, and there’s no penalty for relocating to a cheaper cost-of-living area. We encourage remote and have many employees who’ve lived all over while continuing to work for Basecamp. —  DHH,  Basecamp CTO\n Another fully-distributed company,  Help Scout,  removed geography as a variable in its salary formula in 2018 based on employee feedback and logic. Wrote co-founder,  Nick Francis,\n Remote companies are decidedly, proudly indifferent to geography. We love to say you can work from anywhere — we have no borders, no “market,” and yet market rate remains a compensation factor. It doesn’t add up. Do we care about location or do we not?\n The company’s decision to disregard location in its calculation was also about fairness:\n It’s math — we should all know what we can afford to pay an employee to produce a certain type of work.\n Unsurprisingly, cost-of-living salary formulas are  wildly unpopular among remote employees. The digital workforce wants flexibility. To attract the best talent, tech companies will need to set their pay policies accordingly.\n  Zuckerberg says that he wants to increase innovation, creativity, retention, and workforce diversity at Facebook, but his actions contradict his words. Rather than becoming a “north star” for other companies to follow, Facebook’s new policy will have the opposite effect. It will demoralize current employees and weaken the company’s culture while diluting potential gains from a wider remote hiring pool.\n Building a remote work foundation with salary cuts sets the wrong precedent. You don’t “serve the community and unlock innovation” by telling employees their worth is tied to a physical location — or worse, an IP location — especially in the era of location independence.", "posttime": "2020-05-31 19:07:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,远程,remote,员工", "title": "Facebook的远程薪资新政策是“野蛮的”", "title_en": "Facebook’s New Remote Salary Policy Is “Barbaric”", "transed": 1, "url": "https://medium.com/swlh/facebooks-new-remote-salary-policy-is-barbaric-1fca3f451e67", "via": "", "real_tags": ["facebook", "远程", "remote", "员工"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004512, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我调试一个基于2.4 GHz专有协议的无线鼠标时，我想要检测传输的信号。请注意，我特意写了“检测”：只需查看传输发生的频率(如果有的话)，以及链路是单向的(即，只有鼠标传输，而PC端的加密狗只是接收器)还是双向的就足够了。我不想对协议进行反向工程来解码数据。\n虽然我的实验室有很好的设备，可以处理从直流到大约1 GHz的信号，但2.4 GHz超出了我的仪器的能力。在我意识到我把事情搞得过于复杂之前，我正在考虑到哪里可以借到频谱分析仪或混音器。如果人们只对发射信号的检测感兴趣，那么可以使用无线电工程非常早期的一个概念：包络检测器。这个想法在今天仍然适用。例如，在我在一家射频和微波工程研究所担任研究助理期间，我的同事开发了一种部分基于包络检测的24 GHz通信系统。\n然而，我也没有一款昂贵而充满异国情调的毫米波探测器二极管。但后来我突然回想起小时候我是如何造了一台探测无线电的。在我的电子元器件抽屉里翻找，我很快就找到了这种探测无线电的关键部件：一个锗点接触二极管。与传统的硅二极管(大多数现代半导体器件的材料)相比，锗二极管具有较小的正向电压，因此对小信号具有更高的灵敏度。此外，微妙的点接触也有利于射频应用。有趣的是，这种类型的二极管至今仍在生产(例如1N60)，售价低于1欧元。\n尽管我曾经建造的探测无线电适用于千赫范围内的频率，但我的射频工程师“直觉”告诉我，这个古老的二极管应该也适用于2.4 GHz。因此，我将我的示波器连接到二极管上，并将其靠近无线鼠标的PC端加密狗。成功！我清楚地看到周期性的传输，甚至在鼠标没有移动的情况下也是如此。这已经回答了我的一个问题：交流实际上是双向的。\n这个简单的二极管探测2.4 GHz信号的能力给我留下了深刻的印象。这可能是因为包括引线的二极管在这个频率上几乎有半个波长长，这使它成为一种临时制作的偶极天线。在下一个屏幕截图上，您可以看到PC端的加密狗(脉冲较大)和无线鼠标(较小的脉冲，因为它距离较远)。人们可以清楚地看到传输发生的频率。任务完成了！\n请注意，二极管是宽带检测器。如果一个人想让它对某些频率比对其他频率更敏感，就需要增加一个谐振电路，通常是电感和电容器的组合-就像我小时候造的收音机一样。但事实上，探测器二极管可以用来与其他发射器进行实验。例如，考虑我的移动电话(在大约900 MHz的GSM模式下)。您可以看到传输信号按照GSM的预期以217 Hz的频率脉动：\n附言：如果我启发你用锗二极管做更多的实验，看看这本旧的小册子：锗二极管的40种用途。\nPPS：据推测，快速硅肖特基(！)。二极管也可以使用，因为它也有很小的正向电压。但对我来说，使用这个老式锗二极管更令人着迷。", "note_en": "As I was debugging a wireless mouse based on a 2.4 GHz proprietary protocol, I wanted to detect the transmitted signals. Note that I purposefully wrote “detect”: It was sufficient to see how often the transmission occurred (and if at all) and whether the link was unidirectional – i.e., only the mouse transmits and the PC-side dongle is only a receiver – or bidirectional. I did not want to reverse-engineer the protocol to decode the data.\n While my lab is well equipped for signals from DC to about 1 GHz, 2.4 GHz is beyond the capabilities of my instruments. I was pondering where to borrow a spectrum analyzer or a  mixer, before it occurred to me that I was overcomplicating things. If one is merely interested in detection of a transmit signal, one can use a concept from the very early days of radio engineering: an  envelope detector. This idea is still relevant today. For example, during my time as a research assistant in an RF and microwave engineering institute, my officemate developed a  24 GHz communication system partly based on envelope detection.\n However, I didn’t have one of the  expensive and exotic mmWave detector diodes available, either. But then I suddenly recalled how as a kid I once built a detector radio. Searching through my electronic components drawers, I soon found the key component of such a detector radio: a  germanium point-contact diode. Compared to a conventional silicon diode, the material of most modern semiconductor devices, a germanium diode has a smaller forward voltage, resulting in higher sensitivity for small signals. Also, the delicate point-contact is advantageous for RF applications. Interestingly, this type of diode is still made today (e.g. as  1N60) and available for under 1 EUR.\n   Even though the detector radio I once built was for frequencies in the kilohertz range, my RF engineer “gut feeling” told me that this ancient diode should be good for 2.4 GHz, too. Thus, I hooked up my scope to the diode and held it close to the PC-side dongle of the wireless mouse. Success! I was clearly seeing periodic transmissions, even when the mouse was not being moved. This already answered one of my questions: the communication is in fact bidirectional.\n   I was impressed how well this simple diode detected the 2.4 GHz signals. This may be because the diode including leads is almost half a wavelength long at that frequency, making it an improvised dipole antenna. On the next screenshot you can see the PC-side dongle (large pulses) and the wireless mouse (smaller pulses, because it was farther away). One can clearly see how often transmissions occur. Task accomplished!\n   Note that the diode is a broadband detector. If one wants to make it more sensitive to certain frequencies than to others, one needs to add a resonant circuit, usually a  combination of an inductor and a capacitor – like it is done in the radio that I built as a kid. But as it is, the detector diode can be used to experiment with other transmitters. Consider, for example, my mobile phone (in GSM mode at ca. 900 MHz). You can see the transmit signal pulsing with 217 Hz as expected for GSM:\n   PS: If I have inspired you to do more experiments with a germanium diode, have a look at this old booklet:  40 uses for germanium diodes.\n PPS: Presumably, a fast silicon Schottky(!) diode could be used as well, since it also has a small forward voltage. But it was more fascinating to me to use this old germanium diode.", "posttime": "2020-05-31 18:52:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "欧元,transmission,二极管", "title": "以低于1欧元的价格检测2.4 GHz传输", "title_en": "Detecting a 2.4 GHz transmission for under 1 EUR", "transed": 1, "url": "https://www.chzsoft.de/site/hardware/detecting-a-2.4-ghz-transmission-for-under-1-eur/", "via": "", "real_tags": ["欧元", "二极管"]}, {"category": "", "categoryclass": "", "imagename": "c5fc398817d1baa281704989273d49e1.jpg", "infoid": 1004511, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "评论：那些提出如何支付更多开源代码的简单答案的人并没有与这些项目的创始人交谈。\n在过去的几周里，我采访了一系列开源项目维护人员，他们中的大多数人不会直接从支持他们的项目中获得报酬。有些公司，比如Wireshark的杰拉尔德·库姆斯(Gerald Combs)，最终会被一些公司(在他的案例中是Riverbed)接洽，这些公司在确保项目得到积极发展方面有经济利益。但大多数人，无论是通过选择还是单纯的(坏)运气，从来没有得到专门的商业支持。\n这还不完全清楚。Linux基金会高管Chris Aniszczyk一直直言不讳地反对寻求通过捐款维持项目的开源小费罐。他认为，应该鼓励这些(开源开发者)创业，或者你的企业应该直接雇佣他们。但许多这样的开发人员不想要朝九晚五的公司工作，而更喜欢合同工作的独立性。换句话说，开放源码的可持续性是杂乱无章的。\n与我交谈过的大多数开放源码项目维护人员都是这样开始的，因为这是一种消磨空闲时间的有趣方式。他们有各种各样的个人瘙痒，需要挠痒痒。完全没有人开始编写代码，因为他们希望从这项工作中获得报酬。\n事实上，在某些情况下，他们开始这个项目是专门为了从雇主那里创造空间。例如，对于Datasette创始人西蒙·威里森(Simon Willison)来说，他想要一个创造性的出口。也就是说，一个他能够完全控制的项目。他说，在某些方面，这可能是一种发泄情绪的方式，但实际上，这是一个他可以在没有企业霸主指导的情况下表达自己创造力的地方。\n或者，更确切地说，看看Aniszczyk的建议在哪里与为什么有些(许多？)。开发人员首先要创建开放源码项目吗？Aniszczyk合理地建议，最可持续的资金来源是薪水，但这恰恰是这些开发商中的许多人不想要的。或者，至少，他们不想要一张工资支票，因为他们的自由编码能力受到限制。\n那么，公司应该做些什么呢？许多人希望支持开放源码项目，但如何做到这一点并不总是很清楚。例如，对于哪种类型的贡献是最好的，并没有达成一致意见(MUSL libc&39；的Rich Felker认为是开放源码软件的用户，而Fio的Jens Axboe认为是代码贡献者)。因为费尔克看重自己的独立性，他更喜欢自由职业，但他也有Patreon和GitHub的赞助商账户，帮助他满足财务需求(尽管他希望通过这些渠道获得更多支持)。\n对于捐款的愿望，无论是哪一种，甚至都没有达成普遍的共识。例如，RackN决定取消对Digital Rebar项目核心的贡献，转而促进插件/扩展的生态系统。代码贡献还会给项目维护人员带来相当大的工作量，导致一些流行的项目根本不寻求外部贡献。\n还有像PowerDNS这样的项目，它们似乎在将商业利益与代码结合在一起方面做得很好。在PowerDNS创始人伯特·休伯特的案例中，将代码商业化一直是交易的一部分，这一点很有帮助(尽管一开始它是一个可怕的失败)。而其他项目，如Wireshark，很好地符合商业公司的利益，而不会让这些利益垄断项目。\n要说开放源码的可持续性永远不会对所有的开放源码都有一个元的答案，这是一条很长的路要走。它总是一个项目一个项目地分析，而且真的是一个创始人一个创始人(或者社区一个社区)的决定。\n从最热门的编程语言到薪水最高的工作，获取您需要了解的开发人员新闻和提示。每周。\n今天报名", "note_en": "Commentary: Those proposing easy answers for how to pay for more open source code to be written clearly aren&#39;t talking to the founders of these projects.\n  Over the last few weeks I&#39;ve interviewed a range of open source project maintainers, most of which don&#39;t directly get paid for supporting their projects. Some, like Gerald Combs of Wireshark, eventually get approached by companies (in his case, Riverbed) that have a financial interest in ensuring a project sees active development. But most, whether through choice or simply (bad) luck never get dedicated commercial backing.\n  It&#39;s not completely clear. Linux Foundation executive  Chris Aniszczyk has been an outspoken opponent of open source &#34;tip jars&#34; that seek to sustain projects with donations. &#34;These [open source developers] should be encouraged to start businesses or your business should hire them directly,&#34; he argues. But many such  developers don&#39;t want a 9-to-5 corporate job, preferring the independence of contract work. Open source sustainability, in other words, is messy.\n       Most open source project maintainers with whom I&#39;ve spoken got started because it was a &#34;fun&#34; way to spend their free time. They had a variety of personal &#34;itches&#34; they needed to scratch. Exactly none started coding because they were hoping to get paid for that work.\n   In fact, in some cases, it was specifically to create space from their employer that they started the project. For Datasette founder Simon Willison, for example, he &#34;wanted a creative outlet.&#34; That is, a project that he got to have complete control over. In some ways, he said, it was perhaps &#34;a way of blowing off steam,&#34; but really it was a place where he could express his creativity without a corporate overlord steering that creativity.\n  Or, rather, see where Aniszczyk&#39;s suggestion bumps up against the reality of why some (many?) developers create open source projects in the first place? Aniszczyk reasonably suggests that the most sustainable source of funding is a paycheck, but that&#39;s precisely what many of these developers don&#39;t want. Or, at least, they don&#39;t want a paycheck that comes with restrictions on their ability to code freely.\n  So what should companies do? Many want to support open source projects but  how to do so isn&#39;t always clear. For example, there&#39;s no strong agreement on which  types of contributions are best (musl libc&#39;s Rich Felker argues for users of open source software, while fio&#39;s Jens Axboe argues for code contributors). Because Felker values his independence, he prefers freelance work, but also has Patreon and GitHub Sponsors accounts that help him cover financial needs (though he&#39;d appreciate more support through these channels).\n There&#39;s not even universal agreement on a desire for contributions at all, whatever the kind. RackN, for example,  decided to nix contributions for the core of the Digital Rebar project and instead promotes an ecosystem of plug-ins/extensions. Code contributions can also create a fair amount of work for project maintainers, causing some popular projects to seek no outside contributions at all.\n Then there are the projects like PowerDNS that seem to have done a great job of welding together commercial interests with code. It helps that in PowerDNS founder Bert Hubert&#39;s case, commercializing the code was always part of the bargain ( though it started out as an &#34;abysmal failure&#34;). And other projects, like Wireshark, fit nicely into a commercial company&#39;s interests without those interests monopolizing the project.\n All of which is a long way to say that open source sustainability will never have one, meta answer for all of open source. It&#39;s always a project-by-project analysis and, really, a founder-by-founder (or community-by-community) decision.\n  From the hottest programming languages to the jobs with the highest salaries, get the developer news and tips you need to know. Weekly\n      Sign up today", "posttime": "2020-05-31 18:35:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开源,项目,open", "title": "开源项目的维护者应该付费吗？", "title_en": "Should Maintainers of Open Source Projects Be Paid?", "transed": 1, "url": "https://www.techrepublic.com/article/open-source-sustainability-its-complicated/", "via": "", "real_tags": ["开源", "项目", "open"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004510, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们依赖您的支持：您知道您每月只需不到3美元就可以获得Phoronix Premium吗？今天就试着在一个页面上查看我们的网站无广告、多页文章，以及更多内容，这样我们就可以写更多的Linux硬件评论了。围绕MUSL libc和Busybox构建的Alpine Linux轻量级发行版的3.12版现在可以用于该平台，容器和其他嵌入式用例很流行。虽然MIPS的所有者Wave Computing在本月早些时候申请破产，以及近年来MIPS架构的其他重大挫折(包括放弃他们的Open MIPS计划)，但Alpine 3.12是目前支持64位MIPS的第一个版本。Alpine Linux3.12对仍然存在的许多MIPS64系统支持MIPS64大端。Alpine 3.12也是第一个正式支持D编程语言的版本。Alpine Linux3.12采用Linux5.4LTS内核、GCC 9.3和LLVM Clang10.0编译器以及一系列其他软件升级。更多详细信息，请访问AlpineLinux.org了解今天发布的Alpine 3.12.0版本。", "note_en": "We Rely On Your Support: Did you know that you can get  Phoronix Premium for under $3 per month? Try it today to view our site  ad-free, multi-page articles on a single page, and more while the proceeds allow us to write more Linux hardware reviews.   Version 3.12 of the Alpine Linux lightweight distribution built around musl libc and Busybox is now available for this platform popular with containers and other embedded use-cases.\r   While MIPS owner Wave Computing filed for bankruptcy earlier this month and other major setbacks in recent years for the MIPS architecture (including the abandoning of their Open MIPS plans), Alpine 3.12 is the first release now supporting 64-bit MIPS. MIPS64 big endian is supported by Alpine Linux 3.12 for the many MIPS64 systems still out there.\r   Alpine 3.12 is also the first release officially supporting the D programming language. Alpine Linux 3.12 is powered by the Linux 5.4 LTS kernel with the GCC 9.3 and LLVM Clang 10.0 compilers and a range of other software upgrades.\r   More details on today&#39;s Alpine 3.12.0 release via  AlpineLinux.org.", "posttime": "2020-05-31 18:34:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,发布,支持,language", "title": "Alpine Linux 3.12发布，支持D语言，MIPS64端口", "title_en": "Alpine Linux 3.12 Released with D Language Support, MIPS64 Port", "transed": 1, "url": "https://www.phoronix.com/scan.php?page=news_item&px=Alpine-Linux-3.12-Released", "via": "", "real_tags": ["linux", "发布", "支持", "language"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004509, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "8位灵性(8BS)是一种现代程序，它让人回想起应用程序提供健壮体验但可以放在一张软盘上的时代。相比之下，现代的应用程序比较臃肿，但也有一些应用程序符合8位时代的精神。\n也就是说，现代的8BS应该提供最小的现代功能集：Unicode支持和Internet和/或WWW支持(在适当的情况下)看起来像是最小集。\n我不想限制最终的二进制或链接库的大小，因为在这一点上没有必要将其限制为8位Era软盘大小。我认为现代系统相对“小”是可以接受的。此外，8BS是编程语言不可知的，VM绑定和直接硬件应用都是合理的选择。8BS可以说是一种精神状态。\n目前，我对wrt8位Sprituals感兴趣的一种应用程序示例如下…。\n在我指出几个符合8BS模式的现代程序的示例之前，我想花点时间谈谈几个有趣的示例。当然，默认情况下，8位时代的任何程序都符合约束环境程序的字面定义，但只有一小部分程序可以代表我在这篇文章中追求的程序类型。下面的计划都是有约束的--但它们从来没有约束过。\nKAMAS是开创性的大纲软件，最初是为Kaypro II设计的(最终在其他系统上找到了出路)，它提供了一个功能齐全的编辑器、BBS系统和内部编程语言解释器-所有这些都在191K的软盘上。\n我在某种程度上是Kamas软件的粉丝，尽管我只能在DOSBox仿真器上运行截短为1的版本。即使没有Kaypro版本中的更多高级功能，适用于DOS的Kamas也是一个可靠的应用程序；然而，凭借这些高级功能，该程序是一个强大的数字工作区。\n电动铅笔是第一个实现类似文字处理功能的程序，运行在MITS Altair上，内存为8K。\n虽然肯定比不上后来的许多文字处理器，但电动铅笔为它的许多继任者设定了速度。事实上，许多逆向计算机学家认为Macintosh的Word 5.1现已不复存在，是文字处理的巅峰之作。\n我从来没有足够幸运地使用Word 5.1，但作为一个8BS应该努力争取的应用程序示例，它看起来确实很有光彩。\nTurbo Pascal最初是在8位CP/MOS上发布的，它包含一个IDE和编译器，可以在内存中运行程序或以惊人的速度编译它们-所有这些都是35美元。2个。\n对于8位时代来说，Pascal是一种伟大的语言，并且易于快速编译，但Turbo Pascal软件因是Anders Hejlsberg编程能力的光辉典范而闻名。3个。\n在展示了几个作为现代8BS的门柱的例子之后，我将提供几个现代程序的例子，这些程序达到了本文开头设定的目标。\n像预聚类Redis这样的东西是一个不错的候选者。当然，这不是一个软盘大小的程序，但考虑到它占用的空间很小，它做了很多事情。虽然随着时间的推移，它的范围不断扩大，但最初的设想是一个运行良好、相当稳定、甚至易于理解的时髦的数据结构数据库。\nFrink是一种不同于任何其他编程语言的编程语言。众所周知，它能够在整个计算过程中始终如一地处理和转换一组测量单位。对于任何已经创建了一个复杂的系统(甚至是一个简单的系统)并需要同时处理不同测量单位的人来说，Frink无缝处理的问题的复杂性是令人震惊的。\n//Levenshtein距离是built-inprintln[editDistance[&#34；kitten&#34；，&#34；坐在#34；]]//=&gt；3//将英尺换算为米38英尺-&gt；米//=&gt；7239/625(正好是11.5824)\nFrink需要JVM，这与您能得到的8BS相差最远。然而，撇开VM不谈，“Frink编程语言，包括它的所有参考数据、GUI和图形，可以提供不到500KB(Pack200压缩)。”4。\n这是一款建造世界的/粗暴的/模拟的游戏，尽管它是文本图形，但它对细节的处理方式却令人着迷。这款游戏一直保持着严格的愿景，即由其设计师塔恩和扎克·亚当斯提供强模拟的游戏玩法。\n我将提名的最后一个程序是主要的终端仿真器PuTTY。经过20多年的开发，PuTTY仍然是3MB的安装，并提供了一组有用的功能。当您需要PuTTY提供的功能时，您确实需要它立即正常运行。PuTTY年复一年地满足这一需求，一路坚如磐石。\n在我结束之前，我应该指出硬件8BS的存在。我怀疑Pi、Arduino、ESP32等社区有大量可行的8位SPIRITUAL示例可供学习。我需要更多的探索，也许未来的帖子会更详细地解决这些问题-尽管下面的评论总是欢迎关于它们的指针和信息。\n这就是我目前所有的东西。8位时代已经过去，不太可能再回到以用户为中心的通用应用程序领域。不过，八位制的精神，仍然是值得我们争取和歌颂的。问题当然是--我们应该这样做吗？\n如果我能找到原始Kaypro II磁盘的可行副本，那么我会立即抓起一个尘土飞扬的旧系统来运行它。唉，事实证明，KAMAS软件比运行它的计算机更难找到。-↩。\n当时的PASCAL可以在一次编译过程中进行扫描、解析、优化和代码生成。-↩", "note_en": "An 8-bit Spiritual (8BS) is a modern program that hearkens back to a time when applications provided a robust experience but fit onto a single floppy disk. Modern apps are bloated by comparison, but there are applications that fit the spirit of the 8-bit days.\n That said, a modern 8BS should provide a minimal set of modern features: unicode support and Internet and/or WWW support (where appropriate) seem like a minimal set.\n I don’t want to limit the size of the eventual binary or linked libs because limiting to 8-bit era floppy sizes is not necessary at this point. I think modern-system-relative “small” is acceptable. Also, 8BSes are programming language agnostic and both VM-bound and direct hardware applications are fair game. 8BS is a state of mind so to speak.\n For now, an example of the kinds of applications that I would be interested in WRT 8-bit Spirituals are as follows…\n  Before I point out a few examples of modern programs that fit the 8BS mold I’d like to take a moment to talk about a few interesting examples. Certainly, ANY program from the 8-bit era fits the literal definition of a constrained environment program by default but only a small subset could be representational of the type of program that I’m after for this post. The programs below were all constrained — but they were never constraining.\n  KAMAS was ground-breaking outliner software originally designed for the  Kaypro II  (eventually finding its way onto other systems) that provided a full-fledged editor, BBS system, and internal programming language interpreter — all on a 191K floppy disk.\n  I’m somewhat of a fan of the KAMAS software, even though I’m only able to run a  truncated   1 version on the  DOSBox emulator. Even minus the more advanced features found on the Kaypro versions, KAMAS for DOS is a solid application; however with those advanced features the program was a  powerful digital workspace.\n  Electric Pencil was the first program to implement word processing-like features and ran on the MITS Altair on 8K of memory.\n  While certainly not at the level of many word processors that came after it, Electric Pencil set the pace for many of its successors. Indeed, many retrocomputerists consider the now defunct Word 5.1 for the Macintosh the pinnacle of word processing.\n  I was never fortunate enough to use  Word 5.1 but it certainly seems to shine as an example of an application that an 8BS should shoot for.\n  Turbo Pascal was originally released on the 8-bit CP/M OS and contained an IDE and compiler that could run programs in memory or compile them blazingly fast — all for $35.  2\n  Pascal was a great language to the 8-bit era and amenable to fast compilation but the Turbo Pascal software is famous for being a shining example of Anders Hejlsberg’s programming prowess.  3\n  Having shown a few examples that act as goalposts for the modern 8BSes, I’ll offer a few examples of modern programs that hit the mark set in the beginning of this post.\n  Something like pre-clustering Redis is a decent candidate. Certainly it’s not a floppy-sized program but it did a lot given its small footprint. While it’s grown in scope over time, the original vision was a sleek data-structures database that performed well, was quite stable, and was even easy to understand.\n  Frink is a programming language unlike any other. It is generally known for its ability to handle and convert between a bevy of units of measure consistently throughout calculations. For anyone who has created a complex system (or even a simple one for that matter) that needed to juggle varying units of measure, the complexity of the problem that Frink handles seamlessly is staggering.\n // Levenshtein distance is a built-inprintln[editDistance[&#34;kitten&#34;,&#34;sitting&#34;]]//=&gt; 3// Convert feet to meters38 feet -&gt; meters//=&gt; 7239/625 (exactly 11.5824)\n Frink requires a JVM, which is as far from an 8BS as you can get. However, VM aside “the Frink programming language including all its reference data, GUI, and graphics, can ship in less than 500 kilobytes (pack200 compression).”  4\n    It’s a world-builder / rougelike / simulation game that is obsessive in its approach to detail — despite its textual graphics. The game has maintained a strict vision of providing strong-simulative gameplay by its designers Tarn and Zach Adams.\n  The final program that I’ll nominate is the workhorse terminal emulator  PuTTY. After 20+ years of development, PuTTY is still a 3 MB install and provides a useful set of functionality. When you need the functionality that PuTTY provides you REALLY need it to run well and right away. PuTTY has been meeting this need year after year and has been rock-solid all along the way.\n  Before I end I should point out the existence of hardware 8BSes. I suspect that the Pi, Arduino, ESP32, etc. communities have a ton of examples of viable 8-bit Spirituals to learn from. More exploration needed on my part and perhaps a future post will tackle them in more detail — though pointers and info about them is always welcomed in the comments below.\n  That’s all that I have for now. The 8-bit era has passed us by and is not likely to ever return in the realm of the general-purpose user-centric application. However, the  spirit of the 8-bit system is still something that we can strive for and sing the praises of. The question is of course — should we?\n  If I could find a workable copy of the original Kaypro II disks then I would immediately grab an old dusty system to run it on. Alas, the KAMAS software has turned out more difficult to find than the computer to run it on.  ↩\n  Pascal of the time could be scanned, parsed, optimazed, and code-gen’d in a single compiler pass.  ↩", "posttime": "2020-05-31 18:16:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "精灵,bit,程序", "title": "8位精灵", "title_en": "8-Bit Spirituals", "transed": 1, "url": "http://blog.fogus.me/2020/05/20/8-bit-spirituals/", "via": "", "real_tags": ["精灵", "bit", "程序"]}]