[{"category": "", "categoryclass": "", "imagename": "20056a5158eb54c34e2fbb0dc68595c7.jpg", "infoid": 1007350, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为提醒，最初的法律规定，在线平台应在24小时内删除已标记的非法内容。否则，公司每次违法都将不得不支付巨额罚款。对于社交媒体公司来说，这可能会让他们每年损失数百万美元。\n非法内容指的是在线下世界中被视为犯罪或犯罪的任何东西，如死亡威胁、歧视、否认大屠杀…。非法内容清单包括更广泛地称为仇恨言论的内容。\n但宪法委员会表示，这样的技术清单使得裁决哪些是非法内容，哪些不是非法内容变得困难。由于时间窗口很短，在线平台无法与法院核实一条推文、一篇帖子、一张照片或一篇博客帖子是否被视为非法。\n当你将这一点与潜在的罚款结合在一起时，宪法委员会担心在线平台会太快地审查内容。\n“鉴于很难裁定被标记的内容是否明显非法，第一次违规所招致的处罚[…]。宪法委员会写道：“这些受到质疑的条款只能鼓励在线平台提供商删除被标记的内容，无论它是否明显非法。”\n对于最极端的类别，恐怖内容和儿童色情，根据几个月前投票通过的法律，在线平台必须在一小时内做出反应。宪法委员会使用同样的措辞裁定，在线平台必须过度审查，因为它们不能将温和努力建立在法院裁决的基础上。又是言论自由了。\n鉴于法律的其余部分是基于这两个过程，它不再相关。它包括缓和过程的透明度和上诉机制。\n“我们的目标是在保护言论自由和加强网上法治之间达成艰难的妥协。政府承认宪法委员会的决定--它认为有问题的法律文本不能以目前的形式达到这一目标，“政府在一份声明中表示。\n政府和代表莱蒂夏·阿维亚表示，他们现在将根据今天的裁决进行进一步的工作。换句话说，他们又回到了绘图板上。\n德国已经通过了类似的规定，欧盟层面的讨论正在进行中。", "note_en": "As a reminder, the original law said that online platforms should remove within 24 hours illicit content that has been flagged. Otherwise, companies will have to pay hefty fines every time they infringe the law. For social media companies, it could have potentially cost them many millions of dollars per year.\n Illicit content means anything that would be considered as an offense or a crime in the offline world, such as death threats, discrimination, Holocaust denial… The list of illicit content consists of what is more broadly called hate speech.\n  But the Constitutional Council says that such a technical list makes it difficult to rule what is illicit content and what is not. Due to the short window of time, online platforms can’t check with a court whether a tweet, a post, a photo or a blog post is deemed as illicit or not.\n When you combine that with potential fines, the Constitutional Council fears that online platforms will censor content a bit too quickly.\n “Given the difficulties to rule whether flagged content is evidently illicit, the incurred penalty with the first violation […], the impugned provisions can only encourage online platform providers to remove content that is flagged, whether it is evidently illicit or not,” the Constitutional Council writes.\n  For the most extreme categories, terrorist content and child pornography, online platforms had to react within an hour according to the law that was voted  a couple of months ago. The Constitutional Council uses the same wording to rule that online platforms have to over-censor as they can’t base their moderation efforts on court rulings. Free speech again.\n Given that the rest of the law is based on those two processes, it is no longer relevant. It included transparency on moderation processes and an appeal mechanism.\n “The goal was to reach a difficult compromise between preserving free speech and enforcing the rule of law online. The government acknowledges the decision of the Constitutional Council — it believes the legal text in question can’t reach this objective in its current form,” the government said in a statement.\n The government and deputy Laetitia Avia say they’ll now base further work on today’s ruling. In other words, they’re going back to the drawing board.\n Germany has already passed similar regulation and there are ongoing discussions at the European Union level.", "posttime": "2020-06-20 09:21:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "宪法,constitutional,内容", "title": "法国宪法委员会否决强制平台删除内容的法律", "title_en": "French constitutional council rejects law forcing platforms to delete content", "transed": 1, "url": "https://techcrunch.com/2020/06/19/french-constitutional-authority-rejects-law-forcing-online-platforms-to-delete-hate-speech-content/", "via": "", "real_tags": ["宪法", "内容"]}, {"category": "", "categoryclass": "", "imagename": "b6adddc2d939f746140bc4301868d434.jpeg", "infoid": 1007349, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿--美国国税局(Internal Revenue Service)试图通过购买一个商业数据库来识别和追踪潜在的犯罪嫌疑人，该数据库记录了数百万美国手机的位置。\n美国国税局刑事调查局(IRS CI)在2017年和2018年订阅了访问这些数据的服务，其使用数据的方式在上周美国国税局(IRS CI)官员向俄勒冈州民主党参议员罗恩·怀登(Ron Wyden)的简报中披露。办公室。这位参议员的一名助手向《华尔街日报》描述了这次简报。\n..。", "note_en": "WASHINGTON—The Internal Revenue Service attempted to identify and track potential criminal suspects by purchasing access to a commercial database that records the locations of millions of American cellphones.\n  The IRS Criminal Investigation unit, or IRS CI, had a subscription to access the data in 2017 and 2018, and the way it used the data was revealed last week in a briefing by IRS CI officials to Sen. Ron Wyden’s (D., Ore.) office. The briefing was described to The Wall Street Journal by an aide to the senator.\n...", "posttime": "2020-06-20 09:04:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "手机,国税局,cellphone,数据库", "title": "美国国税局使用手机定位数据试图找到嫌疑人", "title_en": "IRS Used Cellphone Location Data To Try To Find Suspects", "transed": 1, "url": "https://www.wsj.com/articles/irs-used-cellphone-location-data-to-try-to-find-suspects-11592587815", "via": "", "real_tags": ["手机", "国税局", "cellphone", "数据库"]}, {"category": "", "categoryclass": "", "imagename": "9423f27a07c844753ec64b6b887b9e2d.png", "infoid": 1007348, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我的第一次全职API测试经验是针对SOAP服务的。在那里您将了解什么是XSD。你要学会热爱它。\n你当然需要！有了基于模式的服务器端启用的验证，您就不必担心愚蠢的测试，比如检查当您发送100个长度的字符串(预期最大长度为50)时会发生什么。只需确保XSD完全正确即可。\n在那次魔术之后，测试RESTish API感觉就像回到了过去。回到非常体力劳动的时代。但是，当您了解JSON Schema(RAML、OpenAPI等)时，您又会感到高兴了！耶，我们可以打开服务器端验证，再次推开愚蠢的测试工具。\n问题是JSON和XML是不同的野兽。从表面上看，假设模式中定义的任何内容都应该盲目验证，这可能是错误的。\n好好看看tugrik元素。如果没有XSD，您就不会知道预期的类型。虽然它看起来像是数字，但您不能确定。也许是像名字一样的字符串？\n哦，不，你说，那看起来不对！我们知道图格里克是一个数字，所以就让它成为一个数字：\n然而，通过这样做，现在我们甚至不需要任何JSON Schema来猜测类型。没有讨厌的小引号-这是一个令人讨厌的数字！\n也许你知道这是怎么回事了。XML文档是纯文本的。每个元素的值都是一个简单的字符串，框架使用XSD将其转换为正确的类型。\n但我离题了。主要的一点是，基于XML的文档往往要经过转换机制。只有当无法完成强制转换时，验证才会失败。\nJSON不是纯文本的。它们已经有了一些仅通过观察就能看到的基本类型。如果在上面添加JSON Schema并使用任何不太健壮的验证器，则行为将完全不同。\n因为验证JSON文档的最简单方法是首先使用一些公用库来使用它，这些库猜测类型几乎和我们一样：“它周围有引号吗？弦！“。只有在此时，使用已经转换的值，才能将其类型与模式中定义的任何内容进行比较。\n您能猜到真正健壮的验证器有什么不同吗？正确的!。他们使图格里克：10&34；通过验证。因为他们遵循波斯特尔定律：\n虽然这句话比微不足道的小测试者的博客所能处理的要复杂得多，但了解它的存在和应用是很重要的。在任何程度上遵循波斯特尔定律都是一种设计和选择。\n如果您的服务旨在将弱输入(如&#34；tugrik&#34；：&#34；10&#34；)作为有效数字处理，则不是错误。如果您在请求中发送了额外的属性，而服务忽略了它们而没有抛出4xx错误，那么这也不是一个错误。这可能是一个非常好的功能。\n是的，肯定有一种方法可以错误地或过度地做健壮性。如果您从头开始编写浏览器引擎(为什么？)，您将严格遵循Postel定律。另一个原因是确保API客户端的最长正常运行时间。他们成功的请求越多，连接到您的产品所需的工作就越少，从而获得更高的利润。\n因此，当您探索新的API时，在提交错误“Achtung，Achtung，no Validation！1”之前，请确保您了解设计的方式和原因。", "note_en": "My first full-time  API testing experience was for  SOAP services. There you learn what  XSD is. You learn to love it.\n Of course, you do! With server-side enabled validation based on a schema, you need not worry about stupid testing like checking what happens when you send 100 length string where expected maximum length is 50. Just make sure that  XSD is correct.\n After that witchcraft, testing RESTish APIs feels like going back in time. To the very  manual times. But then you learn about  JSON Schema ( RAML, OpenAPI, etc) and you are happy again! Yay, we can turn on server-side validation and shove off stupid testing again.\n The problem is that  JSON and  XML are different beasts. Assuming at face value that whatever is defined in schema should be blindly validated  can be wrong.\n    Take  a good look at  tugrik element. Without  XSD you wouldn’t know the expected type. While it looks like something numeric, you can’t be sure. Maybe it’s a string like a  name?\n     Oh no, you say, that looks wrong! We know that  tugrik is a number, so make it so:\n  Yet by doing that, now we don’t even need any  JSON Schema to guess the type. No pesky little quotes — it’s a number!\n Perhaps you see where this is going.  XML documents are plain-text. Each element’s value is a simple string that frameworks cast into proper types using  XSD.\n     But I digress. The main point is that  XML-based documents often go through casting mechanism.  Validation fails only when casting could not be done.\n JSONs are not plain-text. They already have some rudimentary types visible just by looking at them. If you add  JSON Schema on top and use any  not overly robust validator, the behavior will be different.\n Because the simplest way to validate a  JSON document is first to consume it with some common library that guesses types almost like we do: “does it have quotes around? string!” And only then, with already cast value, to compare its type with whatever is defined in a schema.\n     Can you guess how  really robust validators are different? Right! They make  &#34;tugrik&#34;: &#34;10&#34; to pass validation. Because they follow Postel’s law:\n  While this statement is way more complex than puny little tester’s blog could handle, it’s important to know its existence and application. Following Postel’s law to any degree is  a design choice.\n If your service is designed to handle weak input like  &#34;tugrik&#34;: &#34;10&#34; as a valid number, it’s not a bug. If you send additional properties in the request and a service ignores them without throwing 4xx error, it’s not a bug either. It can be very well a feature.\n And yes, there is definitely a way  to do robustness wrong or overdo it. If you write a browser engine from scratch (why?), you’ll follow Postel’s law religiously. Another reason would be ensuring the maximum uptime of  API clients. More successful requests they do and less work is required from them to connect to your product result in more profit.\n So, when you explore new  API, make sure you understand how’s and why’s around the design before filing bugs “Achtung, Achtung, no validation!!!1”.", "posttime": "2020-06-20 09:03:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "api,apis,json", "title": "强大的API很奇怪", "title_en": "Robust APIs Are Weird", "transed": 1, "url": "https://www.aviskase.com/articles/2020/06/18/robust-apis-are-weird/", "via": "", "real_tags": ["api", "apis", "json"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007347, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于维护停机或容量问题，服务器暂时无法为您的请求提供服务。请稍后再试。\n此外，尝试使用ErrorDocument处理请求时遇到503服务不可用错误。", "note_en": "The server is temporarily unable to service yourrequest due to maintenance downtime or capacityproblems. Please try again later.\n Additionally, a 503 Service Unavailableerror was encountered while trying to use an ErrorDocument to handle the request.", "posttime": "2020-06-20 09:03:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,希望,parliament,请求", "title": "欧洲议会希望禁止个性化广告", "title_en": "European Parliament wants to forbid personalised advertisements", "transed": 1, "url": "https://paultang.nl/en/forbid-personalised-ads/", "via": "", "real_tags": ["广告", "希望", "请求"]}, {"category": "", "categoryclass": "", "imagename": "b20d9fa741bbd7ca387d5defb44a94ed.jpg", "infoid": 1007345, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "研究人员在一份新的报告中警告说，如果我们真的认真解决气候危机，我们需要开始解决我们的经济中压倒性的消费力量。\n虽然有钱经常被描绘成令人向往的东西，但最富有的国家和个人也在对环境造成最大的破坏。如果我们继续朝着这个方向发展，伴随着疯狂的经济增长，我们这个星球的一些地方将变得不适合居住。\n英国利兹大学的生态经济学家朱莉娅·斯坦伯格认为，为了保护自己免受日益恶化的气候危机的影响，我们必须减少不平等，挑战财富和拥有财富的人本质上是好的这一观念。\n这一新观点是由一个由环境科学家、工程师、物理学家和经济学家组成的团队提出的，它基于现有的知识和科学界的建议。\n研究人员检查了目前有关富裕家庭的文献，发现财富是全球环境影响的最强决定因素。进一步挖掘，他们还描述了在这沉重的足迹背后隐藏着什么力量。\n虽然大多数关于这个主题的研究都认为环境影响的主要驱动因素是技术变化(它可以减少我们的影响)和消费(它一直在加速我们的影响)，但似乎后者几十年来一直在超过前者。这对整个世界都是正确的，对许多个别国家也是如此。\n简而言之，即使我们在储存可再生能源或捕获二氧化碳方面做得更好，单靠技术也不能使我们免于生物多样性的丧失或污染。毕竟，在过去的40年里，全球财富的增长速度远远快于任何科学成果。\n澳大利亚新南威尔士大学的环境工程师汤米·维德曼(Tommy Wiedmann)表示，技术可以帮助我们更有效地消费，即节约能源和资源，但这些技术进步跟不上我们日益增长的消费水平。\n财富和环境破坏之间的联系是显而易见的，如果没有深远的生活方式改变和我们对金钱的态度的根本性转变，这一证据表明情况只会变得更糟。\n但是，尽管富人的个人牺牲显然是必要的，但Wiedmann和他的同事们认为，除非也实施更广泛的结构性改革，否则这些尝试注定会失败。\n例如，迫切需要改变经济范式。两位作者认为，可持续增长的想法是一个现实中无法实现的乌托邦；财富总是会比技术滚滚而下的速度更快。\n我们真的需要开始以一种保护我们的气候和自然资源的方式管理我们的经济，即使这意味着更少的、没有增长的，甚至是负增长的。\n多年来，世界各地的科学家和经济学家一直警告说，我们的经济需要重新审视，但到目前为止，这个想法几乎没有受到关注，我们的房子在富人变得更富有的同时继续燃烧。\n根据这一新观点的作者，最好的解决方案是对最富有的人征税，并投资于最贫穷的人和最脆弱的生态系统。因此，世界各国应该考虑生态税、绿色投资、财富再分配、最高和最低收入，以及有保障的基本收入，以帮助我们的环境从这场经济滚雪球中解脱出来。\n如果我们支持它，我们甚至可以更进一步，完全放弃资本主义的想法。\n维德曼说：“我们希望这篇评论能从不同的角度看待什么才是最重要的，并帮助我们克服根深蒂固的观点，即人类必须如何主宰自然，以及我们的经济如何必须增长得更快。”", "note_en": "If we&#39;re really serious about solving the climate crisis, we need to start tackling our economy&#39;s overwhelming &#39;power&#39; of consumption, researchers warn in a new report.\n While having money is often portrayed as something to aspire to, the wealthiest nations and individuals are also wreaking the most environmental destruction. If we keep heading in this direction with rampant economic growth, parts of our planet  will become uninhabitable.\n   &#34;To protect ourselves from the worsening climate crisis, we must reduce inequality and challenge the notion that riches, and those who possess them, are inherently good,&#34;  argues ecological economist Julia Steinberger from the University of Leeds in the UK.\n This new perspective was put together by a team of environmental scientists, engineers, physicists, and economists, and it&#39;s based on existing knowledge and recommendations from the scientific community.\n Examining the current literature on affluent households, researchers found wealth is the strongest determinant of global environmental impacts. Digging further, they also described what force lies behind this heavy footprint.\n While the majority of studies on the subject agree the major drivers of environmental impacts are technology change (which can reduce our impact) and consumption (which has been accelerating our impact), it appears the latter has been outrunning the former for decades. And that&#39;s true for the entire world, as well as numerous individual countries.\n In short, even if we get better at  storing renewable energy, or  capturing carbon dioxide, technology alone can&#39;t save us from  biodiversity loss or  pollution. After all, during the past four decades, worldwide wealth has grown much faster than any scientific gains.\n   &#34;Technology can help us to consume more efficiently, i.e. to save energy and resources, but these technological improvements cannot keep pace with our ever-increasing levels of consumption,&#34;  says environmental engineer Tommy Wiedmann, from the University of New South Wales in Australia.\n The link between wealth and environmental destruction is clear to see, and without far-reaching lifestyle changes and fundamental shifts in our attitude towards money, this evidence suggests things are only going to get worse.\n But while individual sacrifices among the wealthy are clearly needed, Wiedmann and colleagues argue those attempts are doomed to fail unless there are also broader structural changes put into place.\n A change in economic paradigms is, for instance, sorely needed. The idea of &#39;sustainable growth&#39;, the authors argue, is a utopia that cannot be achieved in reality; wealth will always roll faster than technology down a hill.\n  &#34;We really need to start managing our economies in a way that protects our climate and natural resources, even if this means less, no, or even negative growth.&#34;\n   Scientists and economists around the world have been  warning for years that our economy needs to be re-examined, but so far, little attention has been paid to that idea and our house has continued to burn while the rich become richer.\n According to the authors of this new perspective, the best solutions are ones that tax the wealthiest and invest in the poorest people and most vulnerable ecosystems. As such, nations around the world should consider eco taxes, green investments, wealth redistribution, a maximum and minimum income, and a guaranteed basic income to help untie our environment from this economic snowball.\n If we&#39;re up for it, we could even go a step further and leave the idea of capitalism altogether.\n &#34;We hope that this review shows a different perspective on what matters, and supports us in overcoming deeply entrenched views on how humans have to dominate nature, and on how our economies have to grow ever more,&#34;  says Wiedmann.", "posttime": "2020-06-20 09:01:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "过度,shows,经济", "title": "一份新的报告显示为什么我们必须解决过度财富问题来拯救地球", "title_en": "New Report Shows Why We Must Tackle Excessive Wealth to Save the Planet", "transed": 1, "url": "https://www.sciencealert.com/tackling-excessive-wealth-and-consumerism-will-save-the-planet-not-technology-experts-say", "via": "", "real_tags": ["过度", "shows", "经济"]}, {"category": "", "categoryclass": "", "imagename": "d4923d230d10a14be6c66b3c3d6d7000.png", "infoid": 1007344, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "告别货运代理这个黑匣子。只有Flexport才能提供深入的可见性和可控性、低且可预测的供应链成本以及更快、更可靠的运输时间。所有这些都来自一个强大的技术平台。\n要成为真正的货运代理合作伙伴，需要的不仅仅是仪表盘或数字市场。通过我们的安全云软件平台提供的Flexport全球贸易操作系统是一种独特的运营模式，它结合了先进的技术和数据分析、物流基础设施以及实际操作的供应链专业知识。\n从更简单的预订、通信和协作到报告、洞察力等，我们直观的云平台将一切都放在一个地方。因此，您可以获得控制、效率和透明度，并为您的供应链提供一个发射台。\n与您的Flexport“小分队”会面-货运、运输、运营、海关和数据专家组成的专门团队，全天候待命，主动帮助您管理供应链，确保您的货物在良好的状态下准时到达。\n有了Flexport.org，我们通过使用技术来缓解物流瓶颈，真正拯救了生命。\nFlexport充满了热情的人们，创造新事物和挑战现状是令人兴奋的。", "note_en": "Say goodbye to the black box of freight forwarding. Only Flexport delivers deep visibility and control, low and predictable supply chain costs, with faster and more reliable transit times. All from a powerful technology platform.\n  It takes more than dashboards or digital marketplaces to be a true freight forwarding partner. Delivered via our secure cloud software platform, Flexport&#39;s Operating System for Global Trade is a unique operating model that combines advanced tech and data analytics, logistics infrastructure, and hands-on supply chain expertise.\n From simpler bookings, communication, and collaboration to reporting, insights, and more, our intuitive cloud platform puts everything in one place. So you get control, efficiency, and transparency, and a launchpad for your supply chain.\n Meet your Flexport “Squad” – a dedicated team of freight, shipping, operations, customs, and data experts, available 24/7/365 to proactively help you manage your supply chain and ensure your goods arrive on time, in excellent condition.\n     With Flexport.org, we’re really saving lives by using technology to alleviate logistics bottlenecks.\n Flexport is full of passionate people and it&#39;s exciting to create new things and challenge the status quo.", "posttime": "2020-06-20 08:26:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hiring,供应链", "title": "Flexport公司正在阿姆斯特丹招聘工程师", "title_en": "Flexport is hiring engineers in Amsterdam", "transed": 1, "url": "https://Flexport.com", "via": "", "real_tags": ["hiring", "供应链"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007343, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "../阿富汗_OEF_PROPERTY_LIST/01-JAN-1984 01：01-Charterhouse/01-Jan-1984 01：01-伊拉克_OIF_PROPERTY_LIST/01-Jan-1984 01：01-WikiLeaks间谍文件/01-Jan-1984 01：01-Anakata/01-Jan-1984 01：01-Aryan-National-2009/01-Jan-1984 01：01-Baer-Essentials/01-Jan-1984 01：01-Bar.。2009/01-Jan-1984 01：01-谷仓和贵族商店管理-2009/01-Jan-1984 01：01-血液与荣誉数据库-2009/01-Jan-1984 01：01-BND-Query/01-Dec-2016 09：00-BNP-2009/01-Jan-1984 01：01-玻利瓦安娜/01-Jan-1984 01：01-布达佩斯-同性恋权利-暴动-2008/01-1984 01：01：1984 01：01-Cafcass-Board-Papers-2006-2007/01-Jan-1984 01：01-CBS-NEWS-60mins-Werner-Erhard/01-Jan-1984 01：01-Cerac-cenep-Columbia-video-2009/01-Jan-1984 01：01-Cerac-Investigadors/01-Jan-1984 01：01-Clinton-Email/08-Oct-2018 20：08-cms/14-9月-2016。COS-ORGANIZATION-1/01-JAN-1984 01：01-CRS/01-JAN-1984 01：01-REDITEEE Policies/01-Jan-1984 01：01-EmpireChallenges-2008/01-Jan-1984 01：01-ENIC-Tender-Fragence/01-Jan-1984 01：01-EWG-IFPMA-Reports-COMMS/01-Jan-1984 01：01-FARC-REYES-Yahoo-2008/01-Jan-1984 01：01。FITNA-FLASH-VIDEO/01-JAN-VIDEO/01-JAN-1984 01：01-FLOCK-Translations/01-Jan-1984 01：01-Freddy-Balzan-Email-2005-2008/01-Jan-1984 01：01-Galvin-Report-2008/01-Jan-1984 01：01-gifiles/01-Jan-1984 01：01-Gitmo-最高法院审查-2009/01-Jan-1984 01：01-hmulv-lcag。2016年5月9日：05-ICWatch-PICS/17-Feb-2017 23：45-IGES-BMWi-PKV-2010/01-Jan-1984 01：01-伊朗-kamayeshe-Kousar-2007/01-Jan-1984 01：01-伊朗-电信附件-2009/01-Jan-1984 01：01-伊拉克-IPLO/01-Jan-1984 01：01-意大利-儿童性别-2008/01-Jan-1984 01。：01-jp1_02-01-Jan-1984 01：01-Julius-Baer-Tracking/01-Jan-1984 01：01-Kenia-Imanyara-Threat-2009/01-Jan-1984 01：01-Kenia-Renditions-and-raraa-Odinga-Mou-2007/01-Jan-1984 01：01-Kenia-the Call-the Call-01-Jan-1984 01：01-kkw-Kruemmel-。抗议-照片-2008-5-31-01-Jan-1984 01：01-LoveParade2010/01-Jan-1984 01：01-Mara-land-Grab/01-Jan-1984 01：01-MFC-Leak 2-2009/01-Jan-1984 01：01-MFC-Problems/01-Jan-1984 01：01-mod-wl-Sep09/01-Jan-1984 01：01-nsmfargo-Hotmail-Email-2009/01。Jan-1984 01：01-ole-nydahl-diamond-way-buddhism-cult-teachings/01-Jan-1984 01：01-opcca/01-Jan-1984 01：01-秘鲁-petro-Audio-MP3/01-Jan-1984 01：01-秘鲁-Petro-Audio-Transcript/01-Jan-1984 01：01-Podesta-Email/01-Jan-1984 00：01-REZKO-EXPLETS-GMH-2008/01-JAN-1984 01：01-rnc-选举计划/。Jan-1984 01：01-Sarah-Palin-Hack-2008/01-Jan-1984 01：01-沙特-GOV-TECH-SPAM/01-Jan-1984 01：01-Scarlett-Keering-Murder-2008/01-Jan-1984 01：01-Schiy-el-Masri/01-Jan-1984 01：01-scientology-case-supervisor-class-viii-secrets-..&gt；1-1-1-1984 01：01-Smith-County-Justice/1-1-Jan-1984 01：01-Son of the oil/01-Jan-1984 01：01-spyfiles/01-Jan-1984 01：01-spyfiles3/01-Jan-1984 01：01-Steve-Jobs-HIV/01-Jan-1984 01：01-叙利亚-FILES/01-Jan-1984 01：01-TCI-INQUERY-MEDIA-INFORMANCION 1-2009/01-JAN-1984 01：01-TCI-INQUERY-MEDIA-INFORMATION 1-2009/01-JAN-1984 01：01。2009.01-Jan-1984 01：01-TCI-INQUERY-MEDIA-INFORMAND 3-2009/01-JAN-1984 01：01-TCI-INQUENCE-MEDIA-INBUSION 4-2009/01-JAN-1984 01：01-泰国-太子-狗狗生日/01-JAN-1984 01：01-西藏-PROGATION-PHOTES/01-JAN-1984 01：01-西藏-MANGATIONS-AVI/01-JAN-1984 01：01-西藏-PROSITIONS-FLASH-VIDEO。-TollCollect/1-01-Jan-1984 01：01-Tz-Foreign-Investors/01-Jan-1984 01：01-un-科索沃-Pristina/01-Jan-1984 01：01-un-监督厅/01-Jan-1984 01：01-US-天主教医院-2008/01-Jan-1984 01：01-us-fema-winter-storm-community-relations-2009/01-Jan-1984 01：01-vult7/30-Aug-2017 23：00-Videos/01-Jan-1984。198401：01-www.armagedon.org.il/01-JAN-198401：01-JAN-198401：01-1000-美国海军陆战队在格鲁吉亚-2008.zip 01-JAN-198401：01 724621 1973.pdf 01-JAN-198401：01 661033 2005-05-05-gig-ia-jcids-pia-report.pdf 01-Jan-198401：01 1888172 200609。6-09.pdf 01-Jan-198401：01 808895 23831690-091127 copenhagen.pdf 01-Jan-1984 01：01 241711 29-01-1998-tony-van-den-bogaert-1.pdf 01-Jan-1984 01：01 773939 60a-2-1-5-eod-procedures-freezing-techniques-19..&gt；01-JAN-198401：01 164609 9-11_ALL_Messages.7z 01-JAN-198401：01 7207722 9-11_Messages.7z 01-JAN-198401：01 7221141 90-12.pdf 01-JAN-198401：01 2810298 92澳大利亚零售商协会.pdf 01-JAN-198401：01 1231876 AT-KUBARK_Pt_2--Price.pdf 01-Jan-1984 01：01。-1984JAN-01：01 1903720阿富汗_OEF_PROPERTY_", "note_en": "../\r Afghanistan_OEF_Property_List/ 01-Jan-1984 01:01 -\r Charterhouse/ 01-Jan-1984 01:01 -\r Iraq_OIF_Property_List/ 01-Jan-1984 01:01 -\r WikiLeaks Spy files/ 01-Jan-1984 01:01 -\r anakata/ 01-Jan-1984 01:01 -\r aryan-nation-2009/ 01-Jan-1984 01:01 -\r baer-essentials/ 01-Jan-1984 01:01 -\r barclays-tax-avoidance-scm-censored-guardian-2009/ 01-Jan-1984 01:01 -\r barns-and-noble-store-management-2009/ 01-Jan-1984 01:01 -\r blood-and-honor-database-2009/ 01-Jan-1984 01:01 -\r bnd-inquiry/ 01-Dec-2016 09:00 -\r bnp-2009/ 01-Jan-1984 01:01 -\r bolivariana/ 01-Jan-1984 01:01 -\r budapest-gay-rights-riot-2008/ 01-Jan-1984 01:01 -\r cablegate/ 01-Jan-1984 01:01 -\r cafcass-board-papers-2006-2007/ 01-Jan-1984 01:01 -\r cbs-news-60mins-werner-erhard/ 01-Jan-1984 01:01 -\r cerac-cenep-colombia-conflict-videos-2009/ 01-Jan-1984 01:01 -\r cerac-investigadores/ 01-Jan-1984 01:01 -\r clinton-emails/ 08-Oct-2018 20:08 -\r cms/ 14-Sep-2016 15:54 -\r collateralmurder/ 01-Jan-1984 01:01 -\r cos-organization-1/ 01-Jan-1984 01:01 -\r crs/ 01-Jan-1984 01:01 -\r detaineepolicies/ 01-Jan-1984 01:01 -\r empirechallenge-2008/ 01-Jan-1984 01:01 -\r enic-tender-fraud/ 01-Jan-1984 01:01 -\r ewg-ifpma-reports-comms/ 01-Jan-1984 01:01 -\r farc-reyes-yahoo-2008/ 01-Jan-1984 01:01 -\r fb_onr/ 01-Jan-1984 01:01 -\r fitna-flash-video/ 01-Jan-1984 01:01 -\r flock-translations/ 01-Jan-1984 01:01 -\r freddy-balzan-emails-2005-2008/ 01-Jan-1984 01:01 -\r galvin-report-2008/ 01-Jan-1984 01:01 -\r gifiles/ 01-Jan-1984 01:01 -\r gitmo-supreme-court-censorship-2009/ 01-Jan-1984 01:01 -\r hmulv-lcag-thw-kueken/ 01-Jan-1984 01:01 -\r icwatch/ 28-May-2016 09:05 -\r icwatch-pics/ 17-Feb-2017 23:45 -\r iges-bmwi-pkv-2010/ 01-Jan-1984 01:01 -\r iran-kamayeshe-kousar-2007/ 01-Jan-1984 01:01 -\r iran-telco-attachments-2009/ 01-Jan-1984 01:01 -\r iraq-iplo/ 01-Jan-1984 01:01 -\r italy-child-sex-2008/ 01-Jan-1984 01:01 -\r jappah-bribery-affair/ 01-Jan-1984 01:01 -\r jp1_02/ 01-Jan-1984 01:01 -\r julius-baer-stalking/ 01-Jan-1984 01:01 -\r kenya-imanyara-threat-2009/ 01-Jan-1984 01:01 -\r kenya-renditions-and-raila-odinga-mou-2007/ 01-Jan-1984 01:01 -\r kenya-the-cry-of-blood/ 01-Jan-1984 01:01 -\r kkw-kruemmel-brand-juni-2007/ 01-Jan-1984 01:01 -\r korea-candlelight-protest-photos-2008-5-31/ 01-Jan-1984 01:01 -\r loveparade2010/ 01-Jan-1984 01:01 -\r mara-land-grab/ 01-Jan-1984 01:01 -\r mfc-leak2-2009/ 01-Jan-1984 01:01 -\r mfc-problems/ 01-Jan-1984 01:01 -\r mod-wl-sep09/ 01-Jan-1984 01:01 -\r nsmfargo-hotmail-emails-2009/ 01-Jan-1984 01:01 -\r nsw-workcover-2009/ 01-Jan-1984 01:01 -\r ole-nydahl-diamond-way-buddhism-cult-teachings/ 01-Jan-1984 01:01 -\r opcca/ 01-Jan-1984 01:01 -\r peru-petro-audio-mp3/ 01-Jan-1984 01:01 -\r peru-petro-audio-transcripts/ 01-Jan-1984 01:01 -\r podesta-emails/ 01-Jan-1984 00:01 -\r rezko-exhibits-gmh-2008/ 01-Jan-1984 01:01 -\r rnc-election-plans/ 01-Jan-1984 01:01 -\r sarah-palin-hack-2008/ 01-Jan-1984 01:01 -\r saudi-gov-tech-spam/ 01-Jan-1984 01:01 -\r scarlett-keeling-murder-2008/ 01-Jan-1984 01:01 -\r schily-el-masri/ 01-Jan-1984 01:01 -\r scientology-case-supervisor-class-viii-secrets-..&gt; 01-Jan-1984 01:01 -\r smith-county-justice/ 01-Jan-1984 01:01 -\r sonofthesoil/ 01-Jan-1984 01:01 -\r spyfiles/ 01-Jan-1984 01:01 -\r spyfiles3/ 01-Jan-1984 01:01 -\r steve-jobs-hiv/ 01-Jan-1984 01:01 -\r syria-files/ 01-Jan-1984 01:01 -\r tci-inquiry-media-injunction1-2009/ 01-Jan-1984 01:01 -\r tci-inquiry-media-injunction2-2009/ 01-Jan-1984 01:01 -\r tci-inquiry-media-injunction3-2009/ 01-Jan-1984 01:01 -\r tci-inquiry-media-injunction4-2009/ 01-Jan-1984 01:01 -\r thailand-crown-prince-dog-birthday/ 01-Jan-1984 01:01 -\r tibet-protest-photos/ 01-Jan-1984 01:01 -\r tibet-protests-avi/ 01-Jan-1984 01:01 -\r tibet-protests-flash-video/ 01-Jan-1984 01:01 -\r tollcollect/ 01-Jan-1984 01:01 -\r tz-foreign-investors/ 01-Jan-1984 01:01 -\r un-kosovo-pristina/ 01-Jan-1984 01:01 -\r un-oios/ 01-Jan-1984 01:01 -\r us-catholic-hospitals-2008/ 01-Jan-1984 01:01 -\r us-fema-winter-storm-community-relations-2009/ 01-Jan-1984 01:01 -\r vault7/ 30-Aug-2017 23:00 -\r videos/ 01-Jan-1984 01:01 -\r www.armagedon.org.il/ 01-Jan-1984 01:01 -\r www.armagedonz.org/ 01-Jan-1984 01:01 -\r 1000-us-marines-in-georgia-2008.zip 01-Jan-1984 01:01 724621\r 1973.pdf 01-Jan-1984 01:01 661033\r 2005-05-05-gig-ia-jcids-pia-report.pdf 01-Jan-1984 01:01 1888172\r 20060920.pdf 01-Jan-1984 01:01 700551\r 2009-worker-comp-wymanfinaldraftreport8-6-09.pdf 01-Jan-1984 01:01 808895\r 23831690-091127copenhagen.pdf 01-Jan-1984 01:01 241711\r 29-01-1998-tony-van-den-bogaert-1.pdf 01-Jan-1984 01:01 773939\r 60a-2-1-5-eod-procedures-freezing-techniques-19..&gt; 01-Jan-1984 01:01 164609\r 9-11_all_messages.7z 01-Jan-1984 01:01 7207722\r 9-11_messages.7z 01-Jan-1984 01:01 7221141\r 90-12.pdf 01-Jan-1984 01:01 2810298\r 92australianretailersassociationvic.pdf 01-Jan-1984 01:01 1231876\r AT-Kubark_Pt_2--Price.pdf 01-Jan-1984 01:01 819140\r AT-june07-Price-PT1.pdf 01-Jan-1984 01:01 749459\r Afghanistan_OEF_Property_List-extended.html 01-Jan-1984 01:01 1903720\r Afghanistan_OEF_Property_List.csv 01-Jan-1984 01:01 0\r Afghanistan_OEF_Property_List.html 01-Jan-1984 01:01 1701676\r Afghanistan_OEF_Property_List.xls 01-Jan-1984 01:01 0\r Assange_Indictment.pdf 24-May-2019 09:02 1900004\r Catholic-hospitals-Frequently-asked-questions.pdf 01-Jan-1984 01:01 103934\r Charterhouse.zip 01-Jan-1984 01:01 28898138\r Ctv030907_2100_wako_defends_govt_over_kroll_rep..&gt; 01-Jan-1984 01:01 3578003\r Defense-of-Catholic-hospitals-betray-mission.pdf 01-Jan-1984 01:01 135813\r Egerton_University_payroll_scandal.pdf 01-Jan-1984 01:01 7258099\r FBI-pedophile-symbols.pdf 01-Jan-1984 01:01 116868\r Farah-Khan.mp4 01-Jan-1984 01:01 5461130\r Farah-Khan.ogg 01-Jan-1984 01:01 5296147\r Farah-Khan.webm 01-Jan-1984 01:01 5285031\r Further-analysis-of-sterilization-data.pdf 01-Jan-1984 01:01 158332\r Githongo_report.pdf 01-Jan-1984 01:01 5804204\r Homeland_Security_Threat_Overview.pdf 01-Jan-1984 01:01 298084\r Iraq.xls 01-Jan-1984 01:01 0\r Iraq_OIF_Property_List.csv 01-Jan-1984 01:01 8616439\r Iraq_OIF_Property_List_Summary_by_NSN.html 01-Jan-1984 01:01 1650105\r Iraq_OIF_Property_List_Summary_by_NSN_Price.html 01-Jan-1984 01:01 1939732\r KTM_report.pdf 01-Jan-1984 01:01 3909093\r Kxmx5rel.rm 01-Jan-1984 01:01 5784367\r MOU_between_Ralia_Odinga_and_Muslims.pdf 01-Jan-1984 01:01 535903\r Mueller_Report_OCR.pdf 18-Apr-2019 22:03 123811867\r Ntv010907_fat_cats_of_africa_cor.rm 01-Jan-1984 01:01 4121389\r Ntv010907_kroll_report_saga_cor.rm 01-Jan-1984 01:01 4172227\r Ntv030907_1300_wako_admits_kroll_saga_cor.rm 01-Jan-1984 01:01 1425206\r Ntv050907_2100_kroll_report_presented_to_the_go..&gt; 01-Jan-1984 01:01 3551687\r Ntvn040907_2100_the_kroll_report_cor.rm 01-Jan-1984 01:01 4964212\r Project_Wing_-_Northern_Rock_Executive_Summary.pdf 01-Jan-1984 01:01 2754854\r Review-Narrative2.pdf 01-Jan-1984 01:01 79915\r Review-Summary.pdf 01-Jan-1984 01:01 377508\r TCH-xls-Data-Sample.pdf 01-Jan-1984 01:01 323669\r Tanzania.doc 01-Jan-1984 01:01 260096\r Translation_of_Aweis_Letter_1_.doc 01-Jan-1984 01:01 37376\r Tribalism_in_Afghanistan.rtf 01-Jan-1984 01:01 141163\r Vh97bers.rm 01-Jan-1984 01:01 4172227\r a-coup-for-the-rich.pdf 01-Jan-1984 01:01 555161\r a-steuerumgehung-103-08-aw-rr.pdf 01-Jan-1984 01:01 121899\r a-survival-guide-for-decent-folk.html 01-Jan-1984 01:01 45049\r abn-amro-tax.pdf 01-Jan-1984 01:01 325879\r abortiontv-censored-2009.pdf 01-Jan-1984 01:01 117238\r abschlussbericht-agnes.pdf 01-Jan-1984 01:01 1391154\r abu-ghraib-map.jpg 01-Jan-1984 01:01 137881\r abu-ghuragb-secret.jpg 01-Jan-1984 01:01 130719\r abweisung-rekurs-bjb-moonstone.pdf 01-Jan-1984 01:01 111185\r acma-abortion-takedown-2009.txt 01-Jan-1984 01:01 1339\r acma-censors-wikileaks-danish-censorship-list-2..&gt; 01-Jan-1984 01:01 41582\r acma-secret-blacklist-11-mar-2009.txt 01-Jan-1984 01:01 63446\r acma-secret-blacklist-18-mar-2009.txt 01-Jan-1984 01:01 34750\r acma-secret-blacklist-aug-2008.txt 01-Jan-1984 01:01 62587\r acs-town-hall-meeting.pdf 01-Jan-1984 01:01 424991\r acta-brief-enforcement-2008.pdf 01-Jan-1984 01:01 138451\r acta-denial-2009.pdf 01-Jan-1984 01:01 98908\r acta-drafts-2009.pdf 01-Jan-1984 01:01 5472021\r acta-proposal-2007.pdf 01-Jan-1984 01:01 180648\r adf-report-2007.pdf 01-Jan-1984 01:01 169231\r advantage-insecurities-2008.pdf 01-Jan-1984 01:01 2305829\r af447-acars.pdf 01-Jan-1984 01:01 503429\r afg.7z 01-Jan-1984 01:01 81745030\r afg.csv.7z 01-Jan-2011 09:00 20083904\r afghan-order-of-battle-2007.pdf 01-Jan-1984 01:01 989663\r afghanistanacmttp-s.pdf 01-Jan-1984 01:01 198293\r ag-kaiserslautern-quote.pdf 01-Jan-1984 01:01 274167\r aig-bailout-shareholder-approval.pdf 01-Jan-1984 01:01 82317\r aig-is-the-risk-systemic-2009.pdf 01-Jan-1984 01:01 134733\r aig09162008.pdf 01-Jan-1984 01:01 88754\r air-france-af447-2009.zip 01-Jan-1984 01:01 185337\r airbus-kingfisher-mou-2007.pdf 01-Jan-1984 01:01 619576\r aircraft-procurement-airforce.pdf 01-Jan-1984 01:01 2530444\r airline-pilot-scab-list-2004.pdf 01-Jan-1984 01:01 475381\r airline-pilot-scab-list.pdf 01-Jan-1984 01:01 318830\r al-qaeda-documents-visual-recognition-guide.pdf 01-Jan-1984 01:01 590347\r alcatel-support-document-for-cable-system-in-cu..&gt; 01-Jan-1984 01:01 473639\r algonquin-park-road-expansion.pdf 01-Jan-1984 01:01 1021562\r alien-user-manual.pdf 01-Jan-1984 01:01 971696\r alms-for-jihad.pdf 01-Jan-1984 01:01 23900820\r alp-v-whozadog-claim-2009.pdf 01-Jan-1984 01:01 150698\r alp-v-whozadog-orders-2009.pdf 01-Jan-1984 01:01 33858\r alpha-chi-omega-ritual.pdf 01-Jan-1984 01:01 2713083\r alpha-chi-sigma-ceremonies.pdf 01-Jan-1984 01:01 2102085\r alpha-gamma-delta-ritual.pdf 01-Jan-1984 01:01 1054505\r alpha-kappa-alpha-ritual-circa-1977.pdf 01-Jan-1984 01:01 3280683\r american-casinos.pdf 01-Jan-1984 01:01 4523446\r amnesty-international-abortion-policy-2008.zip 01-Jan-1984 01:01 185588\r anatomy-of-a-subway-hack.pdf 01-Jan-1984 01:01 4360850\r anc-nhi-presentation-nehawu-school-2009.pdf 01-Jan-1984 01:01 859616\r anc-nhi-submission-nec-july2009.pdf 01-Jan-1984 01:01 354093\r anderson-county-palmetta-agreement.pdf 01-Jan-1984 01:01 201402\r anderson-county-private-investigators-invoice-2..&gt; 01-Jan-1984 01:01 837295\r angela-merkel.pdf 01-Jan-1984 01:01 15984\r anti-anonymous-flyer-by-scientology-germany.jpg 01-Jan-1984 01:01 353571\r ap-iht-test-returns-2008-0-30.pdf 01-Jan-1984 01:01 362052\r ar-525-13--2002-1.pdf 01-Jan-1984 01:01 151359\r arbeitsentwurf-sperr-gesetz-bmwi-250309.pdf 01-Jan-1984 01:01 143352\r arbeitsentwurf-sperrgesetz-2009-04-01.pdf 01-Jan-1984 01:01 101859\r army-playbook.pdf 01-Jan-1984 01:01 1671715\r aryan-nation-2009.7z 01-Jan-1984 01:01 83831423\r asnsw-edl-09.pdf 01-Jan-1984 01:01 35333\r asnsw-social-media-policy-sop2009-027.pdf 01-Jan-1984 01:01 62343\r aspen-police-manual-2009.pdf 01-Jan-1984 01:01 913103\r atm-fraud-eurocash-automatia.pdf 01-Jan-1984 01:01 1572913\r au-acma-efa-sublime-link-deletion-notice-2009.pdf 01-Jan-1984 01:01 143132\r au-dha-sydney-medical-students-foi-2009.pdf 01-Jan-1984 01:01 852532\r auchi-dossier-2008.zip 01-Jan-1984 01:01 879894\r auchi-hawaii-free-press-2009.pdf 01-Jan-1984 01:01 167487\r auchi-to-newstatesman-oct-2008.pdf 01-Jan-1984 01:01 571442\r auchi-to-wikileaks-2008.pdf 01-Jan-1984 01:01 647553\r audio-recording--secret-call-to-defeat-employee..&gt; 01-Jan-1984 01:01 59298432\r aus-io-panning-manual-2001.pdf 01-Jan-1984 01:01 364701\r australian-national-broadband-network.pdf 01-Jan-1984 01:01 1810529\r austria-election-result-forecast-restricted.pdf 01-Jan-1984 01:01 72751\r austria-evoting-beilage-2009.jpg 01-Jan-1984 01:01 92244\r austrian-e-voting-2009.pdf 01-Jan-1984 01:01 4525878\r autumn-of-nations.pdf 01-Jan-1984 01:01 7734062\r avian-flu-chair-text-2008.pdf 01-Jan-1984 01:01 179328\r ayman-difrawi.html 01-Jan-1984 01:01 86993\r ba-038-air-traffic-control-tape.wmv 01-Jan-1984 01:01 5574440\r baer-essentials.zip 01-Jan-1984 01:01 8491364\r bahrain-bdf-plan.png 01-Jan-1984 01:01 32688\r baidu-blacklist.zip 01-Jan-1984 01:01 100124\r bandargate-report-2008.pdf 01-Jan-1984 01:01 32611087\r banned-in-lebanon.pdf 01-Jan-1984 01:01 176630\r barclays-tax-avoidance-scm-censored-guardian-20..&gt; 01-Jan-1984 01:01 2993296\r barry-diller.pdf 01-Jan-1984 01:01 709639\r bat-south-africa-report-sept07.pdf 01-Jan-1984 01:01 3002708\r bawue-dienstaufsichtsbeschwerden.pdf 01-Jan-1984 01:01 165512\r bayer-china-2002.pdf 01-Jan-1984 01:01 390043\r bayern-skype-interception.pdf 01-Jan-1984 01:01 1190205\r bbc-original-trafigura-video.flv 01-Jan-1984 01:01 42363031\r bbc-trafigura-killer-toxic-waste.mp3 01-Jan-1984 01:01 21863381\r bbc-trafigura.pdf 01-Jan-1984 01:01 3095881\r bdo-assessment-iqwig.pdf 01-Jan-1984 01:01 727402\r belgum-tax-property-registrar-2008.jpg 01-Jan-1984 01:01 295471\r berats-box.7z 04-Dec-2016 23:00 10175472662\r bernard-glazer-estate-2008.zip 01-Jan-1984 01:01 15290561\r bernard-securities-contact-information.txt 01-Jan-1984 01:01 1168\r bevatron-demolition-plans-2009.pdf 01-Jan-1984 01:01 3361745\r bia-san-pasqual-letter-2008.pdf 01-Jan-1984 01:01 125623\r big-brother-switzerland-2009.zip 01-Jan-1984 01:01 532721\r big-profits-from-a-very-dirty-business.pdf 01-Jan-1984 01:01 16554\r bilboa-de-chavez-2005.pdf 01-Jan-1984 01:01 172693\r bilderberg-history-1956.pdf 01-Jan-1984 01:01 30988\r bilderberg-meeting-report-1957.pdf 01-Jan-1984 01:01 115783\r bilderberg-meeting-report-1958.pdf 01-Jan-1984 01:01 737103\r bilderberg-meeting-report-1962.pdf 01-Jan-1984 01:01 1971462\r bilderberg-meetings-report-1955.pdf 01-Jan-1984 01:01 105245\r bilderberg-meetings-report-1960.pdf 01-Jan-1984 01:01 105093\r bilderberg-meetings-report-1963.pdf 01-Jan-1984 01:01 135878\r bilderberg-meetings-report-1980.pdf 01-Jan-1984 01:01 4048562\r bill-foster-divorce-documents.pdf 01-Jan-1984 01:01 235788\r bill-oreilly-hacked-2008.jpg 01-Jan-1984 01:01 211360\r bjb-aladin-invest-bernd-weikl-eur-5-mil.zip 01-Jan-1984 01:01 58216\r bjb-alpha-tankers.zip 01-Jan-1984 01:01 82934\r bjb-andrade.zip 01-Jan-1984 01:01 708792\r bjb-angel-trust-1999.zip 01-Jan-1984 01:01 269617\r bjb-carlyle-1999.zip 01-Jan-1984 01:01 1399488\r bjb-cronin.zip 01-Jan-1984 01:01 454472\r bjb-elmer-no-data-theft.pdf 01-Jan-1984 01:01 160408\r bjb-finanzintermediaere-methoden.zip 01-Jan-1984 01:01 121872\r bjb-hans-henning-abtrott.zip 01-Jan-1984 01:01 63346\r bjb-heinri-steinberger.zip 01-Jan-1984 01:01 139355\r bjb-juerg-grossmann.zip 01-Jan-1984 01:01 134735\r bjb-jurg-grossman-caymans.zip 01-Jan-1984 01:01 1201407\r bjb-leonhardt-pec-invest-steuerhinterziehung-us..&gt; 01-Jan-1984 01:01 42705\r bjb-lewis1.zip 01-Jan-1984 01:01 128955\r bjb-lewis2.zip 01-Jan-1984 01:01 371692\r bjb-lord-kadoorie.zip 01-Jan-1984 01:01 26855\r bjb-luis-avenvas.zip 01-Jan-1984 01:01 176111\r bjb-mass-murderer-mexico-several-millions-of-us..&gt; 01-Jan-1984 01:01 156130\r bjb-moonstone.zip 01-Jan-1984 01:01 52362\r bjb-peru.zip 01-Jan-1984 01:01 79229\r bjb-polygraph.pdf 01-Jan-1984 01:01 2315715\r bjb-renker-steuerbetrug-cayman-vaduz-zuerich.zip 01-Jan-1984 01:01 491532\r bjb-shape-creinvest-excellence-funds.zip 01-Jan-1984 01:01 1042208\r bjb-shortcomings-in-trust-administration.pdf 01-Jan-1984 01:01 813682\r bjb-smolka-trust-1999.zip 01-Jan-1984 01:01 204371\r bjb-spain-almazan---gallego-hidden-usd-1-2-mio.zip 01-Jan-1984 01:01 85032\r bjb-swisspartner-tax-scheme.xls 01-Jan-1984 01:01 19968\r bjb-tjabe-dr-van-os-usd-9mil.zip 01-Jan-1984 01:01 63261\r bjb-usa-tax-evasion.zip 01-Jan-1984 01:01 44051\r bjb-winston-layne.zip 01-Jan-1984 01:01 1203308\r bjb-zurich-moonstone-trust-prosecution-2008.pdf 01-Jan-1984 01:01 135500\r bka-auskunftsverweigerung.pdf 01-Jan-1984 01:01 140743\r blackwater-bankers.pdf 01-Jan-1984 01:01 97543\r blair-nhs-it.pdf 01-Jan-1984 01:01 471062\r blood-and-honor-database-2009.zip 01-Jan-1984 01:01 1347642\r blue-force-comms-emc-warlock-test-results-2-200..&gt; 01-Jan-1984 01:01 191032\r blue-force-comms-emc-warlock-test-results-2004.pdf 01-Jan-1984 01:01 191278\r bmf-gatzer-bmz-leprich.pdf 01-Jan-1984 01:01 363036\r bmwi-antipiraterie-gipfel.pdf 01-Jan-1984 01:01 82918\r bnd-correspondence.txt 01-Jan-1984 01:01 3612\r bnd-kosovo-2007.pdf 01-Jan-1984 01:01 7461937\r bnd-kosovo-feb-2005.pdf 01-Jan-1984 01:01 2992669\r bnd-networks.pdf 01-Jan-1984 01:01 125452\r bnetza-anhoerung20091105.pdf 01-Jan-1984 01:01 138000\r bnp-2009.xlsb 01-Jan-1984 01:01 1453930\r bnp-email.txt 01-Jan-1984 01:01 9363\r bnp-language-discipline-2005.pdf 01-Jan-1984 01:01 19688\r bnp-member-list-email.jpg 01-Jan-1984 01:01 171530\r bnp-memberlist-sql.zip 01-Jan-1984 01:01 628827\r bnp-members.csv 01-Jan-1984 01:01 1471011\r bnp-members.xls 01-Jan-1984 01:01 2710016\r bnp-membership-list.txt 01-Jan-1984 01:01 1551384\r bnp-racism-leaflet.pdf 01-Jan-1984 01:01 851743\r boeing-737-fire-suppression-report-2000.pdf 01-Jan-1984 01:01 415017\r boeing-737-maintenance-manual-2007.zip 01-Jan-1984 01:01 322712441\r boeing-denmark-hornet-2008.pdf 01-Jan-1984 01:01 904331\r boeing-f15-auto-flight-system-1998.pdf 01-Jan-1984 01:01 1461729\r boeing-f15-engine-starting-system-2001.pdf 01-Jan-1984 01:01 13976156\r boeing-uses-employees-to-keep-pork-flowing-2009..&gt; 01-Jan-1984 01:01 42443\r bohemian-grove-guest-list-2008.pdf 01-Jan-1984 01:01 4904113\r boliva-chille-intel-report-2006.pdf 01-Jan-1984 01:01 119510\r boomerang-system.pdf 01-Jan-1984 01:01 538799\r bosetti-walker-2009.pdf 01-Jan-1984 01:01 97126\r bradford-city-valley-parade-stadium-fire-footag..&gt; 01-Jan-1984 01:01 76956936\r brasilian-senator-roseana-sarney-estimated-usd-..&gt; 01-Jan-1984 01:01 647872\r brazil-inception-report-2003.pdf 01-Jan-1984 01:01 2007713\r brdc-final-reports.pdf 01-Jan-1984 01:01 1842692\r brein-thepiratebay-legal.zip 01-Jan-1984 01:01 1206066\r briefing-cfc.pdf 01-Jan-1984 01:01 11529926\r british-waterways-targets-2008-2009.pdf 01-Jan-1984 01:01 236630\r british-waterways-targets.pdf 01-Jan-1984 01:01 6645978\r bsu-sex-trips-1999.txt 01-Jan-1984 01:01 75794\r bt-phorm-report-2007.pdf 01-Jan-1984 01:01 17553260\r bucca-sop.pdf 01-Jan-1984 01:01 2148123\r budapest-gay-rights-riot-2008.zip 01-Jan-1984 01:01 45735482\r bulgaria-dans-report-2008.pdf 01-Jan-1984 01:01 9030132\r bundesministerium-access-blocking-19-feb-2009.pdf 01-Jan-1984 01:01 45987\r bureau-of-diplomatic-security-report.pdf 01-Jan-1984 01:01 561606\r burning-man-paul-addis-message-2008.txt 01-Jan-1984 01:01 5601\r business-software-alliance-belgium-21-september..&gt; 01-Jan-1984 01:01 419055\r butswana-stock-exchange-rules-1996.pdf 01-Jan-1984 01:01 442505\r cabinet-paper-port-klang-free-zone-malaysia-sca..&gt; 01-Jan-1984 01:01 31515\r cafcass-board-papers-2006-2007.zip 01-Jan-1984 01:01 5199394\r cafcass-board-papers-2006.zip 01-Jan-1984 01:01 7553575\r california-bar-complaint.pdf 01-Jan-1984 01:01 163094\r california-dentical-adjudication-2007.pdf 01-Jan-1984 01:01 707505\r call-fm-3-50.1-personnel-recovery-aug-2005.pdf 01-Jan-1984 01:01 2809905\r call-fmi3-07x22-counter-insurgency.pdf 01-Jan-1984 01:01 2505799\r call-hb-03-34-mre-ttps-oif.pdf 01-Jan-1984 01:01 1536912\r call-hb-using-interperters-04-7.pdf 01-Jan-1984 01:01 413591\r cameroon-corruption-in-parliamentarian-caucus-f..&gt; 01-Jan-1984 01:01 2929160\r canada-afghan-detainee-investigation-richard-co..&gt; 01-Jan-1984 01:01 105008\r canada-ambush-1977.pdf 01-Jan-1984 01:01 5019238\r canada-conservative-harper-stump-speech-may-200..&gt; 01-Jan-1984 01:01 3295453\r canada-mines-boobtraps-1999.pdf 01-Jan-1984 01:01 1418522\r canada-nuclear-linda-keen.pdf 01-Jan-1984 01:01 2642547\r canada-patrolling-2002.pdf 01-Jan-1984 01:01 4108191\r canada-tam-insert-807-2000.pdf 01-Jan-1984 01:01 889313\r canada-training-for-war-1992.pdf 01-Jan-1984 01:01 545738\r canada-unit-sop-2009.pdf 01-Jan-1984 01:01 459737\r canada-us-secret-communication-on-abousfian-abd..&gt; 01-Jan-1984 01:01 173291\r canadian-acta-consultation-report.pdf 01-Jan-1984 01:01 1877545\r canadian-coin-operations-manual.pdf 01-Jan-1984 01:01 17777930\r canadian-mine-manual.pdf 01-Jan-1984 01:01 573388\r canadianfederationofstudents-agm-november2009-a..&gt; 01-Jan-1984 01:01 3314530\r cards911.zip 01-Jan-1984 01:01 5062890\r carleton-uni-campuscard-2008.pdf 01-Jan-1984 01:01 123209\r carleton-university-fiasco-disciplinary-decisio..&gt; 01-Jan-19\n......", "posttime": "2020-06-20 08:25:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "解密,wikileaks,media", "title": "维基解密文件", "title_en": "WikiLeaks Files", "transed": 1, "url": "https://file.wikileaks.org/file/", "via": "", "real_tags": ["解密", "wikileaks", "media"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007342, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伊恩·霍尔姆(Ian Holm)去世，这位受过古典训练的莎士比亚演员因在“指环王”(Lord Of The Rings)和“霍比特人”(Hobbit)电影“烈火战车”(Chariots Of Fire)和“异形”(Alien)等电影中的表演而为电影观众所熟知。他88岁了。\n这位演员的一名代表表示，霍尔姆于周五上午在医院去世。这位演员多年来一直在与帕金森氏症作斗争。然而，就在最近的一月份，霍姆还亲自出现在伦敦领取纽波特海滩电影节的偶像奖。\n霍姆以诠释莎士比亚的大部分经典作品而闻名，其中包括高耸的“李尔王”，他还在舞台上出类拔萃地演出了哈罗德·品特(Harold Pinter)的原创作品“返校节”(The Homecoming)，这部作品也被带到了百老汇。他在职业生涯中途才开始在电影中工作，1968年首次亮相时改编了他在“仲夏夜之梦”中的舞台表演。\n然而，在后来的几年里，他越来越多地在电影中工作，并更有选择性地在舞台上工作，出现在备受瞩目的电影中，如“异形”(Alien)、“第五元素”(The Five Element)、“指环王”(The Lord Of The Rings)、“指环王归来”和“霍比特人”(Hobbit)电影“意外之旅”(An Underful Journey)和“五军之战”(The Battle Of The Fimies)。\n但他最好的作品包含在独立制作的作品中，比如奥斯卡最佳影片获得者“火的战车”(Chariots Of Fire)，这让他在1982年获得了最佳男配角提名，以及“乔治国王的疯狂”(The Madness Of King George)、“乔·古尔德的秘密”(Joe Gould‘s Secret)、“盛大的夜晚”(Big Night)和“来世甜蜜”(The Sweet HereAfter)。\n他还经常参与制作英国电视剧，如“借款人”、“钟声”、“埃奇希尔夫妇”、“我们是被告”和“游戏集与比赛”。\n霍尔姆非常多才多艺，尽管他身材矮小，但在角色选择上很少受到限制。他在很大程度上是一个演员的演员，太像变色龙了，不会有很强的明星影响力。1998年，他被女王伊丽莎白二世授予爵士头衔，以表彰他对戏剧的贡献。\n霍姆作为演员已经工作了几十年，他第一次获得主流关注是因为他在1979年的“异形”(Alien)中饰演一个机器人，在1981年的“烈火战车”(Chariots Of Fire)中饰演奥运教练萨姆·穆萨比尼(Sam Mussabini)。\n在接下来的十年里，这些角色变得更大、更有特色，包括在“时光匪徒”(Time Bandits)中扮演拿破仑，在泽菲雷利(Zeffirelli)的“哈姆雷特”(Hamlet)中与梅尔·吉布森(Mel Gibson)一起扮演普罗尼尔斯(Polonius)，在肯尼斯·布拉纳(Kenneth Branagh)的“亨利五世”(Henry V)中饰演弗伦船长，还在“梦幻童话”(DreamChild)、“巴西”、“格雷斯托克：人猿王”(Greystoke：The Legend of Terzan)、“韦瑟比”(Wetherby。\n在90年代，他在史蒂文·索德伯格(Steven Soderbergh)的“卡夫卡”(Kafka)和大卫·克罗南伯格(David Cronenberg)的“裸体午餐”(Naked Lunch)中，以及尼古拉斯·海特纳(Nicholas Hytner)的“乔治国王的疯狂”(The Madness Of King George)、布拉纳(Branagh)的“科学怪人”(Frankenstein)和“第五元素”(The Five El。\n霍姆在顶级独立电影中表现出色，包括斯坦利·图奇(Stanley Tucci)的“盛大之夜”(Big Night)和“乔·古尔德的秘密”(Joe Gould‘s Secret)，特别是在阿汤姆·伊戈扬(Atom Egoyan)的“甜蜜来世”(The Sweet HereAfter)中，他饰演的这位痛苦的律师在加拿大小镇的悲剧后徒劳地寻求赔偿，罗杰·埃伯特(Roger Ebert)说，他扮演的是“微妙的无底洞”。\n这位在剧院磨牙的演员仍然偶尔做舞台工作。霍尔姆1979年在《万娅叔叔》中饰演阿斯特罗夫，1997年饰演李尔王。后者为他带来了奥利维尔最佳男演员奖，他在电视上重复了这两次表演，并在1999年凭借《李尔王》赢得了艾美奖。1993年，他与妻子佩内洛普·威尔顿(Penelope Wilton)在舞台上主演了品特的《月光》(Moonlight)。\n他又回到了2001年电影“皇帝的衣服”中拿破仑的角色。(他第一次在1972年的电视连续剧“拿破仑和我”中扮演波拿巴，然后在“时光强盗”中滑稽地扮演波拿巴。)。“纽约时报”(New York Times)在对这部电影的总体负面评价中说，“霍尔姆先生在狡猾、冷漠的表演中，尽了最大努力实现这部电影温和的喜剧愿景。”\n在他70多岁的时候，霍姆继续出现在备受瞩目的电影中-没有哪部电影比他在其中扮演比尔博·巴金斯(Bilbo Baggins)的《指环王》(Lord Of The Rings)更引人注目。他是休斯兄弟与约翰尼·德普(Johnny Depp)合作的“来自地狱”(From Hell)中的一名虐待狂医生，并在罗兰·埃默里奇(Roland Emmerich)的灾难史诗“后天”和马丁·斯科塞斯(Martin Scorsese)的“飞行员”(The Aviator)中饰演气象学家。\n但他也是时尚动画片黑色科幻电影“文艺复兴”和令人愉快的动画片“料理鼠王”中的主演之一。霍尔姆在21世纪头10年做出了其他一些有趣的选择，出现在独立喜剧“带着糖果的陌生人”(Strangers With Candy)中；在“治疗”(The Treatment)中饰演一个令人震惊的精神分析学家；在埃利·楚拉基(Elie Chouraqui)的“啊耶路撒冷”(O耶路撒冷)中饰演以色列第一任总统大卫·本·古里安(David Ben Gurion)。\n他在两部“霍比特人”电影“意外之旅”和“五军之战”中再次出演比尔博·巴金斯一角。\n伊恩·霍姆·卡斯伯特出生于英国古德梅耶斯，1950年进入皇家戏剧艺术学院，1953年离开英国服兵役。\n第二年，他加入了埃文河畔斯特拉特福德的皇家莎士比亚剧团，并在“奥赛罗”中作为长矛搬运工首次亮相。霍尔姆在1956年的“恋爱事件”中首次亮相伦敦西区，并在“泰特斯·安德罗尼克斯”中与劳伦斯·奥利维尔一起在欧洲巡回演出，1957年重新加入皇家莎士比亚剧团，1959年凭借“仲夏夜之梦”中的著名冰球和“李尔王”中的愚人一角闯荡。他一直在皇家莎士比亚剧团工作到1967年，曾出演过《暴风雨》(饰演艾瑞尔)、《理查德三世》、《亨利五世》、《亨利四世，第一部》和《第二部》中的主演角色。\n1965年，他在品特的原创作品《返校节》中饰演莱尼而备受赞誉；1967年他在百老汇重复这个角色时获得托尼奖，并在1973年品特的大银幕改编剧中再次饰演这个角色。\n1968年，他在英国电影“博福斯枪”(The Bofors Gun)中首次亮相，这部电影为他带来了英国电影学院奖(BAFTA Award)的最佳男配角奖。此后，他更频繁地出现在电影和电视上，而不是舞台上。\n在接下来的几年里，他在“仲夏夜之梦”、“修理工”、“哦！多么可爱的战争啊，“尼古拉斯和亚历山德拉”，以及“罗宾和玛丽安”中的约翰国王。其他任务包括“年轻的温斯顿”、“霸主”、“向魔鬼呐喊”，以及电视方面的“悲惨世界”、“铁面人”、“西线的静默”和“拿撒勒的耶稣”。在美国迷你剧“大屠杀”和“第三帝国内部”中，他分别扮演海因里希·希姆莱和约瑟夫·戈培尔。\n2001年，他凭借与朱迪·丹奇(Judi Dench)在HBO的心灵感应片“金发碧眼的最后时刻”(The Last Of The Gonde Bombshell)中的对手戏，第二次获得艾美奖。他和妻子威尔顿一起出现在英国电视台的“借款人”和“借款人的归来”中，他是全明星阵容中的一员，为美国TNT电视台播出的真人版“动物农场”做出了贡献。\n霍尔姆还做了大量的画外音和旁白工作。他为探索频道讲述了纪录片“斯大林”、“伊丽莎白·R：女王生活的一年”和“广岛：投掷炸弹的决定”；为探索频道讲述了“桑给巴尔之海”和“皮肤深处”；为公共广播公司(PBS)讲述了“审判中的大屠杀”。\n霍姆结过四次婚，第一任妻子是林恩·玛丽·肖。他的第二任妻子是电影静物摄影师索菲·贝克。他们的婚姻于1986年结束。霍姆于1991年与威尔顿结婚，并于2001年离婚。\n他身后留下了他的第四任妻子、艺术家索菲·德·斯坦佩尔(Sophie De Stempel)，他们于2003年结婚；三个女儿杰西卡(Jessica)、莎拉-简(Sarah-Jane)和梅丽莎(Melissa)，他们做过一些电影表演，梅丽莎是一名选角导演；还有两个儿子，巴纳比(Barnaby)，他小时候扮演角色，哈里，一名制作音乐视频的电影制作人。", "note_en": "Ian Holm, the classically trained Shakespearean actor best known to film audiences for his performances in films including the “Lord of the Rings” and “Hobbit” movies, “Chariots of Fire” and “Alien,” has died. He was 88.\n A rep for the actor has said Holm died in the hospital Friday morning. The actor had been battling Parkinson’s disease for a number of years. However, as recently as January, Holm appeared in person to collect the Newport Beach Film Festival’s Icon Award in London.\n Holm, who was celebrated for interpretations of most of the Shakespeare canon, including a towering “King Lear,” also excelled onstage in the original production of Harold Pinter’s “The Homecoming,” which he also brought to Broadway. He began working in films only midway through his career, debuting with an adaptation of his stage performance in “A Midsummer Night’s Dream” in 1968.\n In later years, however, he worked increasingly in movies and more selectively onstage, appearing in high-profile films such as “Alien,” “The Fifth Element,” “Lord of the Rings” pics “The Fellowship of the Ring” and “The Return of the King” and “Hobbit” movies “An Unexpected Journey” and “The Battle of the Five Armies.”\n But his finest work was contained in independently made productions like Oscar best picture winner “Chariots of Fire,” which brought him a nomination as best supporting actor in 1982, as well as “The Madness of King George,” “Joe Gould’s Secret,” “Big Night” and “The Sweet Hereafter.”\n He also worked regularly on British television series such as “The Borrowers,” “Bells,” “Mr. and Mrs. Edgehill,” “We the Accused” and “Game Set and Match.”\n Holm was remarkably versatile and, despite his short stature, rarely limited in his selection of roles. He was very much an actor’s actor, too chameleon-like to have a strong star impact. In 1998, he received a knighthood from Queen Elizabeth II for his contribution to drama.\n Holm had been working as an actor for decades when he first achieved mainstream notice for his work as an android in 1979’s “Alien” and as the Olympic trainer Sam Mussabini in 1981’s “Chariots of Fire.”\n  Over the next decade, the roles became larger and more distinctive, including Napoleon in “Time Bandits,” Polonius in Zeffirelli’s “Hamlet” alongside Mel Gibson, Captain Fluellen in Kenneth Branagh’s “Henry V,” as well as turns in “Dreamchild,” “Brazil,” “Greystoke: The Legend of Tarzan, Lord of the Apes,” “Wetherby,” “Dance With a Stranger” and Woody Allen’s “Another Woman.”\n During the ’90s, he had meaty starring roles in Steven Soderbergh’s “Kafka” and David Cronenberg’s “Naked Lunch” as well as in Nicholas Hytner’s “The Madness of King George,” Branagh’s “Frankenstein” and “The Fifth Element.”\n Holm turned in several outstanding performances in top independent movies including Stanley Tucci’s “Big Night” and “Joe Gould’s Secret,” and especially in Atom Egoyan’s “The Sweet Hereafter,” where his performance as the pained lawyer futilely seeking redress in the wake of a Canadian town’s tragedy was “bottomless with its subtlety,” Roger Ebert said.\n  The actor, who cut his teeth in the theater, still did stagework occasionally. Holm starred as Astrov in “Uncle Vanya” in 1979 and as King Lear in 1997. The latter brought him an Olivier award as best actor, and he repeated both performances on television, winning an Emmy for “Lear” in 1999. In 1993, he starred in a production of Pinter’s “Moonlight” onstage with wife Penelope Wilton.\n He returned to the role of Napoleon in the 2001 film “The Emperor’s Clothes.” (He had first played Bonaparte in the 1972 TV series “Napoleon and Me,” then comically in “Time Bandits.”) In a generally negative review of the film, the New York Times said, “In a sly, deadpan performance, Mr. Holm does his best to realize the movie’s gentle comic vision.”\n In his 70s, Holm continued to show up in high-profile films — none more high-profile than the “Lord of the Rings” movies, in which he played Bilbo Baggins. He was a sadistic doctor in the Hughes brothers’ “From Hell,” with Johnny Depp, and played meteorologists in Roland Emmerich’s disaster epic “The Day After Tomorrow” and Martin Scorsese’s “The Aviator.”\n But he was also one of the starring voices in the stylish animated film noir sci-fier “Renaissance” and the delightful animated feature “Ratatouille.” Holm made some other interesting choices in the 2000s, appearing in the indie comedy “Strangers With Candy”; as an outrageous psychoanalyst in “The Treatment”; and as David Ben Gurion, the first president of Israel, in Elie Chouraqui’s “O Jerusalem.”\n He returned to the role of Bilbo Baggins for two “Hobbit” films, “An Unexpected Journey” and “The Battle of the Five Armies.”\n  Ian Holm Cuthbert was born in Goodmayes, England, and entered the Royal Academy of Dramatic Art in 1950, leaving in 1953 to do his military service.\n The following year, he joined the Royal Shakespeare Company at Stratford-on-Avon and made his debut as a spear carrier in “Othello.” Holm made his West End debut in 1956’s “Love Affair” and toured Europe with Laurence Olivier in “Titus Andronicus,” rejoining the RSC in 1957 and breaking out in 1959 with his celebrated Puck in “A Midsummer Night’s Dream” and as the Fool in “King Lear.” He remained with the RSC until 1967, appearing in starring roles in “The Tempest” (as Ariel), “Richard III,” “Henry V” and “Henry IV, Part 1” and “Part 2.”\n In 1965, he appeared to great acclaim as Lenny in the original production of Pinter’s “The Homecoming”; he won a Tony when he repeated the role on Broadway in 1967 and played the role again in Pinter’s 1973 big-screen adaptation.\n In 1968, he made his film debut in “The Bofors Gun,” a British film that brought him a BAFTA Award for supporting actor. Thereafter, he appeared more regularly in movies and on television than onstage.\n  Over the next few years, he had supporting roles in “A Midsummer Night’s Dream,” “The Fixer,” “Oh! What a Lovely War,” “Nicholas and Alexandra” and as King John in “Robin and Marian.” Other assignments included “Young Winston,” “Juggernaut,” “Shout at the Devil” and, for television, “Les Miserables,” “The Man in the Iron Mask,” “All Quiet on the Western Front” and “Jesus of Nazareth.” For the American miniseries “Holocaust” and “Inside the Third Reich,” he played Heinrich Himmler and Joseph Goebbels, respectively.\n He won a second Emmy in 2001 for his roguish work opposite Judi Dench in the HBO telepic “The Last of the Blonde Bombshells.” With wife Wilton, he appeared in “The Borrowers” and “The Return of the Borrowers” for Brit TV, and he was one of an all-star cast of voices that contributed to the live-action version of “Animal Farm” that aired on TNT in the US.\n Holm also did a considerable amount of voiceover and narration work. He narrated the documentaries “Stalin,” “Elizabeth R: A Year in the Life of the Queen” and “Hiroshima: The Decision to Drop the Bomb”; “The Seas of Zanzibar” and “Skin Deep,” both for the Discovery Channel; and “Holocaust on Trial” for PBS.\n Holm was married four times, first to Lynn Mary Shaw. His second wife was film still photographer Sophie Baker. Their marriage ended in 1986. Holm married Wilton in 1991, and they divorced in 2001.\n He is survived by his fourth wife, artist Sophie de Stempel, whom he married in 2003; three daughters, Jessica, Sarah-Jane, who did some film acting, and Melissa, a casting director; and two sons, Barnaby, who acted as a child, and Harry, a filmmaker who makes music videos.", "posttime": "2020-06-20 08:07:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "巴金,holm,电影", "title": "《指环王》和《异形》中的比尔博·巴金斯伊恩·霍尔姆逝世，享年88岁", "title_en": "Ian Holm, Bilbo Baggins In 'Lord of the Rings' and 'Alien' Star, Dies At 88", "transed": 1, "url": "https://nypost.com/2020/06/19/ian-holm-lord-of-the-rings-and-alien-star-dead-at-88/", "via": "", "real_tags": ["巴金", "holm", "电影"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007341, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了帮助支持我们的社区在新冠肺炎期间远程工作，我们将在2020年6月30日之前免费提供ACM在我们数字图书馆中发布的所有作品。了解更多。\n我们使用饼干，以确保我们给你最好的经验，在我们的网站。\n您的浏览器似乎不支持它们，这会影响网站功能。", "note_en": "To help support our community working remotely during COVID-19, we are making all work published by ACM in our Digital Library freely accessible through June 30, 2020.  Learn more\n   We use cookies to ensure that we give you the best experience on our website.\n  It seems your browser doesn&#39;t support them and this affects the site functionality.", "posttime": "2020-06-20 08:06:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "创意,面向,artboard,网站", "title": "Stamper：面向画板的创意编码环境", "title_en": "Stamper: An Artboard-Oriented Creative Coding Environment", "transed": 1, "url": "https://dl.acm.org/doi/pdf/10.1145/3334480.3382994", "via": "", "real_tags": ["创意", "面向", "artboard", "网站"]}, {"category": "", "categoryclass": "", "imagename": "f91f32c8a872cafae7b9f2d020ed2986.jpg", "infoid": 1007338, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook在收到版权所有者的版权投诉后，删除了发布在特朗普总统账户上的一段被篡改的视频。\n这段经过操控的视频显示，一个黑人幼儿从一个白人幼儿身边跑开，CNN的一根乳糜管上写着“惊恐的幼儿从种族主义婴儿身边跑开。”去年在网上疯传的原始视频看到了完全相反的情况，这两个蹒跚学步的孩子在人行道上跑向对方，这样他们就可以拥抱了。这段视频是由卡佩·唐克图姆(Carpe Donktum)创建的，他是一位多产的亲特朗普表情包创建者，总统过去曾放大过他的观点，并上传到了Facebook和Twitter上。它是在全国各地反对美国系统性种族主义的抗议活动中到来的，在6月19日前夕-许多人庆祝这一天是奴隶制结束的日子。\n据CNN报道，Facebook在“孩子的一位父母提出版权要求”后删除了这段视频。Facebook的一名代表向The Verge证实，版权所有者收到了投诉。据美国有线电视新闻网(CNN)报道，当Facebook删除它时，它的浏览量已经超过了400万次。Jukin Media是一家第三方公司，经常从人们那里获得病毒式视频的权利，该公司告诉CNN，“视频所有者和Jukin Media都没有允许总统发布视频，经过我们的审查，我们认为他未经授权使用内容是在没有有效合理使用或其他辩护的情况下侵犯版权的明显例子。”\n另外，我们绝不支持或纵容篡改视频或其传达的信息。\nFacebook发言人安迪·斯通(Andy Stone)告诉The Verge，“我们收到了这段视频版权所有者根据数字千年版权法提出的版权投诉，已经删除了这篇帖子。”\n根据Jukin Media在该公司账户上发布的一份声明，该公司还向Twitter提出了版权索赔投诉。虽然推特将这段视频贴上了“被操纵的媒体”的标签，但直到周五晚上，它在总统的账户上仍然很活跃。这似乎是唐克图姆的编辑第一次收到“被操纵的媒体”的标签，这个标签通常出现在深度赝品上。在撰写本文时，这段视频已经被观看了近2000万次。目前还不清楚东克图姆或总统的团队是否会辩称，这种迷因具有足够的变革性，以至于它可以在合理使用的情况下存在。\n朱金的声明写道：“我们已经代表视频创作者提交了DMCA下架通知，并符合Twitter的政策。”“另外，我们绝不支持或纵容篡改视频或其传达的信息。我们希望并期待推特能迅速采取行动删除这段视频。“。\n周五晚上，推特禁用了这段视频。由于版权所有者的DMCA通知，视频被删除。\nTwitter的一位发言人告诉The Verge：“根据我们的版权政策，我们会对版权所有者或其授权代表发送给我们的有效版权投诉做出回应。”\n更新6月19日美国东部时间下午5点40分：更新后加入了Twitter的评论，并注意到该评论在版权投诉后被删除。标题也已更改，以反映更新。", "note_en": "Facebook has removed a manipulated video posted on President Trump’s account after receiving a copyright complaint from the rights owners.\n The manipulated video shows a black toddler running away from a white toddler, with a CNN chyron reading “terrified toddler runs from racist baby.” The original video,  which went viral last year, sees the total opposite, with the two toddlers running toward each other on the sidewalk so they can hug. The video was created by Carpe Donktum, a  prolific pro-Trump meme creator who the president has amplified in the past, and uploaded to both Facebook and Twitter. It arrives as protests across the country fighting against systemic  racism in the United States, and on the  eve of Juneteenth — a day that many people celebrate as the day slavery ended.\n Facebook took the video down after “one of the children’s parents lodged a copyright claim,”  according to  CNN. A Facebook representative confirmed to  The Verge that a complaint was received by the rights holder. It had more than four million views by the time Facebook removed it, according to  CNN. Jukin Media, a third-party company that often  acquires the rights from people to viral videos, told  CNN that “neither the video owner nor Jukin Media gave the President permission to post the video, and after our review, we believe that his unauthorized usage of the content is a clear example of copyright infringement without valid fair use or other defense.”\n “Separately, in no way to we support or condone the manipulate video or the message it conveys”\n “We received a copyright complaint from the rights holder of this video under the Digital Millennium Copyright Act and have removed the post,” Andy Stone, a Facebook spokesperson, told  The Verge.\n Jukin Media has also filed a copyright claim complaint to Twitter, according to a statement posted on the company’s account. While Twitter  labeled the video as “manipulated media,” it was still active on the President’s account until Friday evening. It appeared to be the first time one of Donktum’s edits has received the “manipulated media” tag, which is usually found on deepfakes. The video has been viewed nearly 20 million times at the time of this writing. It’s still unclear whether Donktum or the president’s team will argue the meme is transformative enough that it’s allowed to exist under fair use.\n “We have submitted a DMCA takedown notice on behalf of the video’s creator, and in accordance with Twitter’s policy,” Jukin’s  statement reads. “Separately, in no way to we support or condone the manipulate video or the message it conveys. We hope and expect Twitter will take swift action to remove the video.”\n On Friday evening, Twitter disabled the video. The video was taken down due to a DMCA notice from the rights holder.\n “Per our  copyright policy, we respond to valid copyright complaints sent to us by a copyright owner or their authorized representatives,” a Twitter spokesperson told  The Verge.\n Update June 19th 5:40pm ET: Updated to include comment from Twitter and note it was removed after a copyright complaint. The headline has also been changed to reflect the update.", "posttime": "2020-06-20 07:29:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,操纵,twitter,视频", "title": "在DMCA投诉后，Facebook和Twitter从特朗普的账户中删除了被操纵的视频", "title_en": "Facebook and Twitter Remove Manipulated Video From Trump's Accounts After DMCA Complaint", "transed": 1, "url": "https://www.theverge.com/2020/6/19/21297209/facebook-removes-manipulated-toddler-video-president-trump-copyright-claim-dmca-jukin", "via": "", "real_tags": ["facebook", "操纵", "twitter", "视频"]}, {"category": "", "categoryclass": "", "imagename": "f2d6cce271b12e16317043f48fc04b9f.jpg", "infoid": 1007337, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我有几盒Ratheon牌的，当我使用它们时，我通常会将焊接件滑上一根导线，然后将它们拧在一起，然后再将接合件滑回接头上。如果它们不是干净的导线，那么接触熔剂或预镀锡导线也不会有什么坏处。", "note_en": "I have a few boxes of Ratheon branded ones, and when I use them, I typically slide the solder splice up one wire and twist the wires together, before sliding the splice back over the joint. A touch of flux or pre-tinning the leads doesn’t hurt either, if they are anything but clean wires.", "posttime": "2020-06-20 07:10:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打击,solder,导线", "title": "在敌后打击焊点", "title_en": "Strike a Solder Joint Behind Enemy Lines", "transed": 1, "url": "https://hackaday.com/2020/06/19/strike-a-solder-joint-behind-enemy-lines/", "via": "", "real_tags": ["打击", "solder", "导线"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007336, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这太奇怪了。行动小组几小时前发布了他们的消息。我的三星BD-57C大约一个小时前刚刚开始做同样的事情。一旦接通电源，它就会开始滴答声和嗡嗡声，就好像它正在试图装入一张光盘一样。电视上没有显示任何内容。我换了遥控器的电池。遥控器会打开抽屉一次，但玩家会在两秒内关闭它，并再次开始发出噪音。如果我插入一张光盘，我会听到播放机开始读取光盘，但随后它开始滴答声和嗡嗡声。在任何时候，电视屏幕上都不会显示任何内容。我把播放机的插头拔了十分钟。拔掉电源插头后，我按住电源按钮30秒。我一插上电源，它就立即开始发出噪音。有什么主意吗？它大约有两年的历史了。我可能已经用了大约20次了。“谢谢你，", "note_en": "This is strange. The OP posted their message a few hours ago. My Samsung BD-57C just started doing the same thing about an hour ago. As soon as it receives power, it starts clicking and buzzing as if it&#39;s trying to load a disc. Nothing is displayed on the TV. I changed batteries in the remote. The remote will open the drawer oncei per it on with the remote,  but the player closes it in two seconds and starts making noise again. If I insert a disc, I&#39;ll hear the player start reading the disc, but then it starts the clicking and buzzing. At no point will anything be displayed on the TV screen. I unplugged the player for ten minutes. While it&#39;s unplugged, I depressed the power button for 30 seconds. As soon as I plug it in, it immediately starts making noise. Any ideas? It&#39;s about 2 years old. I&#39;ve maybe used it about 20 times.  Thank you,", "posttime": "2020-06-20 06:52:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "蓝光,blu,电源", "title": "三星蓝光播放器在全球范围内突然停止工作", "title_en": "Samsung Blu-Ray Players Suddenly Stop Working Worldwide", "transed": 1, "url": "https://us.community.samsung.com/t5/Home-Theater/Blu-ray-player-BD-JM57C-keeps-cycling-on-off-whenever-plugged-in/td-p/1278935", "via": "", "real_tags": ["蓝光", "blu", "电源"]}, {"category": "", "categoryclass": "", "imagename": "0d40b8cbe5d6983ec077fc2d69404d4d.png", "infoid": 1007335, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "嗯，不完全是。这更像是黑客攻击。或者是两个协议的未记录的、非标准化的混搭。让我们来看看令人兴奋(和可怕)的细节。\n安全复制协议(SCP)允许我们在两台计算机之间移动文件(和目录)。使用它很简单：\n这会将local_file.txt复制到另一台域名为remote_host的计算机(通常是服务器)的/home目录中。\n它的美妙之处在于，它可以在几乎所有类Unix系统和许多流行的Windows客户端上运行！这种无处不在的可用性和易用性是SCP如此出名的原因。而且很容易建立一个关于它是如何工作的心理模型，这在故障排除时很有帮助。\n但是移动文件并不是那么令人兴奋。SCP的真正价值在于对两台计算机进行身份验证和对运行中的数据进行加密(这就是“S”表示的)。\n在使用它时，您可能已经注意到，您需要首先设置对远程计算机的SSH访问。SCP身份验证提示甚至看起来与SSH完全一样。这是因为SCP运行在SSH之上-它将SSH用作明文文件数据的管道。事实上，SSH完成了上面描述的所有安全繁重任务，SCP只通过SSH连接抛出一些明文文件。\n这篇维基百科条目有一些SCP历史。简而言之：在旧的BSD系统上曾经有一个名为RCP的工具，它可以在计算机之间移动文件。这是在值得信赖的网络无忧无虑的日子里，每个人都是其他人的朋友。然后人们意识到，也许并不是他们网络上的每个人都是这样的好朋友。有人将RCP实现复制到OpenSSH的前身，并简单地在SSH会话上运行它，以保护文件不受非好友的影响。问题解决了！从那以后，它一直保留在OpenSSH中，许多其他软件为了兼容而模仿它，所以我们就在这里。\nSSH RFC相当简单和完整。但是没有任何关于通过SSH复制文件的内容。那么SCP是如何实施的呢？\nSCP不是标准化协议。没有关于如何实现它的RFC或任何官方描述。OpenSSH实现是事实上的“规范”。这个实现分为两个部分：“连接”建立和之后的有线协议。\n好吧，这不是真正的联系。它只是使用SSH执行的命令的STDIN/STDOUT，有点像Unix管道。OpenSSH有两个主要程序参与其中：sshd和scp。sshd是始终运行的服务器守护进程，接受新的SSH连接。scp是一个客户端程序，它伪装成ssh，然后发送或接收文件。\n当SCP程序运行时，它会打开一个新的SSH连接。在该连接上，它在服务器端执行另一个SCP程序，带有特殊的、未记录的标志。您可以将scp视为运行ssh exec scp[FLAGS]。主要标志是-t(“to”)和-f(“from”)，分别用于接收和发送，其他标志是-d(目标是目录)和-r(递归的，源是目录)。\n值得注意的是，SCP协议是单向的：一端是发送文件，另一端是接收。要走另一条路，您需要单独的SCP执行。\nSCP在远程端运行后，实际的SCP协议命令开始通过STDIN和STDOUT流动。\n现在，我们有了安全的I/O管道，并有效地切换到RCP协议。该协议是顺序的(一次一个操作)和同步的(每个命令必须在下一个命令开始之前完成)。\n[参数]是特定于命令的，如文件/目录名、文件大小或时间戳。“E”命令没有参数。\n当最后一条命令为‘C’(创建文件)时发送[可选数据]。数据大小被指定为‘C’的参数\n此外，还有控制字节，它们自己发送，没有换行符：\n0x00-“OK”，确认完成最后一条命令(就像写入本地文件一样)。这也是由接收方在启动时发送的，以让发送方知道它已准备好接收命令。\n0x01-“警告”，后跟要向用户显示的行(以换行符结尾)。\n0x02-带有可选消息(与警告相同)的“ERROR”，但连接随后被终止。\n这个带注释的示例(#符号之后的所有内容都不在协议中)应该会阐明整个过程：\n到目前为止，SCP听起来还不错。粗糙的设计和缺乏规范是不幸的，但它是一个足够简单的工具，似乎可以为很多人工作。但现在让我们来看看一些现实世界的问题。\n有线协议的顺序性质(每个命令都必须确认)增加了大量开销。例如，如果单个确认数据包在传输过程中被丢弃，则整个连接将暂停，直到重新传输开始。最重要的是，在不压缩的情况下发送所有数据或询问接收方是否已经拥有该文件并不理想。\n经验丰富的sysadmin会告诉您，压缩文件并发送单个大型存档比使用递归scp命令要快得多。事实上，您完全可以在没有SCP的情况下做到这一点：\n#复制包含10000个文件的本地文件夹$FIND/TMP/BIG_Folder/-TYPE f|wc-l10000#使用scp$time scp-r-q/tmp/BIG_Folder/server:/tmp/big_folder__Executed in 882.99 MILIS FISH外部用户时间114.09 MILIS 0.00微秒。114.09毫秒系统时间278.46毫秒949.00微秒277.51毫秒#在ssh$time上使用tar sh-c&#34；tar cf-/tmp/BIG_Folder|ssh服务器&#39；tar xc/tmp/-f-&#39；&#34；tar：删除前导&#39；/&#39；来自会员names__Executed的215.68毫米鱼外部使用时间93.22毫秒0.00微秒93.22毫秒系统时间66.51毫秒897.00微秒65.62毫秒。\n在这个示例中，从882.99ms到215.68ms，这是4倍的加速(诚然，对于SCP来说是最糟糕的情况)！\nSCP运行在SSH之上，所以它是完全安全的，对吗？哦，我可爱的夏日孩子，事情从来都不安全。\nSCP协议过时、僵化、不易修复。我们建议使用更现代的协议(如sftp和rsync)进行文件传输。\n如果远程端的shell打印出非交互会话的任何内容，您的本地SCP进程将很乐意将该输出解释为SCP命令。充其量，这将中断SCP协议并产生模糊错误。在最坏的情况下，远程外壳启动脚本是恶意的，它会向您发送利用漏洞的有效负载，而不是您想要的文件。\n那么实现错误又是怎么回事呢？早在2018年，Harry Sintonen就在流行的SCP实现(包括OpenSSH)中发现了一系列漏洞。其中包括修改目录上的权限、覆盖任意文件(由于~/.ssh/Authorized_key或~/.bashrc而有效地执行代码)，以及插入终端转义序列以隐藏任何痕迹。对于构建网络CLI应用程序的任何人来说，这些漏洞都是一个很好的教训。\n好吧，那么也许SCP终究还是有问题的。我们应该如何在不设置全新系统或求助于蜗牛邮寄USB驱动器的情况下在计算机中移动文件？\nSFTP被广泛认为是SCP的继任者。它仍然在SSH之上运行，以实现传输层安全性，并且不需要单独设置访问。它可以为您提供浏览远程文件系统的自定义交互式提示，或者您可以使用预先编写的一系列命令编写脚本。\n不利的一面是，您需要学习SFTP提示符命令，并且协议本身还没有完全标准化(有很多RFC草案，但作者最终放弃了)。\nrsync是另一个很好的选择。其用法与scp命令完全相同-它是也利用SSH的临时替代命令。rsync完全取决于性能-它在本地执行大量复杂的计算，以便通过网络发送尽可能少的数据。从技术上讲，它进行数据同步而不是纯传输-如果远程和本地内容相似，则只发送增量。\n同样，它也有自己的缺点：发送方使用大量的CPU能力来确定要发送什么，而接收方使用大量的磁盘IO来按正确的顺序将东西组合在一起。与OpenSSH不同，大多数系统上也没有预装rsync。\n如果您需要将文件发送给某人(而电子邮件不是一个选项)，Magic Wormhole是一个简单易用的工具。您可以在带外(如通过电话)交换简短、可读的代码，并附加一些文件。它可以处理典型的NAT穿越难题，并且比交换SSH密钥容易得多。\n问题是每次传输都需要交换验证码，所以只适用于一次性拷贝。整个系统都是为人类设计的，如果你需要在你的笔记本电脑和一些服务器之间传输数据，魔术虫洞不是合适的工具。\n更重要的是，还有在个人设备(包括手机和服务器)之间同步文件夹的软件。Syncthing和PerKeep就是两个很好的例子。这些系统总是在后台运行，并在文件之间交换差异，类似于rsync。\n两者都需要一些时间来学习和配置(特别是在您利用它们的许多功能的情况下)，并且主要针对个人数据(如照片或聊天日志)进行优化，而不是针对基础架构脚本进行优化。它们也比我上面提到的所有东西都慢得多，也更需要资源。\nSCP是一个实现古怪的简单工具。它在移动文件方面做得不错，但较新的软件在很多方面都优于它。SCP仍然适用于您信任的计算机之间的简单个人用例。它很熟悉，一直在那里等着你。\n但是，如果您有性能问题或需要满足更高的安全标准，上面列出的任何替代方案都比SCP更可取。选择最适合您需要的，然后迁移过来。", "note_en": "Well, not quite. It’s more of a hack. Or an undocumented, unstandardized mashup of two protocols. Let’s look at the exciting (and scary) details.\n  Secure Copy Protocol (SCP) allows us to move files (and directories) between two computers. Using it is straightforward:\n  This will copy  local_file.txt to another computer (usually a server) with domain name  remote_host into the  /home directory.\n The beauty of it is that it works on pretty much any Unix-like system and many popular Windows clients too! This ubiquitous availability and ease of use is what made SCP so well-known. And it’s easy to build a mental model of how it works, which helps a lot when troubleshooting.\n But moving files around isn’t that exciting. SCP’s real value is in authentication of both computers and encryption of data in flight (that’s what “S” represents).\n When using it, you may have noticed that you need to set up SSH access to the remote computer first. The SCP authentication prompts even look exactly like with SSH. This is because SCP runs on top of SSH - it uses it as a pipe for plaintext file data. In fact, SSH does all the security heavy lifting described above, SCP just tosses some plaintext files over the SSH connection.\n This Wikipedia entry has a bit of SCP history. In short: there once was a tool called  RCP on old BSD systems, which moved files between computers. This was during the care-free days of trusted networks where everyone was friends with everyone else. Then people realized that  maybe not everyone on their network is such a good friend after all. Someone copied the RCP implementation over to a precursor of OpenSSH and simply ran it over an SSH session to protect files from not-friends. Problem solved! It remained in OpenSSH ever since and a bunch of other software mimicked it for compatibility, so here we are.\n  The  SSH RFC is fairly straightforward and complete. But there is nothing about copying files over SSH. How is SCP implemented then?\n SCP is not a standardized protocol. There’s no RFC or any official description of how to implement it. OpenSSH implementation is the de-facto “specification”. There are two parts to this implementation: “connection” establishment and wire protocol after that.\n  Okay, it’s not really a connection. It’s just  STDIN/STDOUT of a command executed with SSH, kind of like a Unix pipe. OpenSSH has two main programs involved in this:  sshd and  scp.  sshd is the server daemon that’s always running, accepting new SSH connections.  scp is a client program that pretends to be  ssh and then sends or receives files.\n When the  scp program runs, it opens a new SSH connection. On that connection, it executes  another scp program on the server side, with special, undocumented, flags. You can think of  scp as running  ssh exec scp [flags]. The main flags are  -t (“to”) and  -f (“from”) for receiving and sending respectively, other flags are  -d (target is a directory) and  -r (recursive, source is a directory).\n  It’s worth noting that SCP protocol is unidirectional: one end is sending files and another is receiving. To go the other way you need a separate  scp execution.\n After  scp is running on the remote end, the actual SCP protocol commands start flowing via  STDIN and  STDOUT.\n  Now we have a secure I/O pipe and effectively switch to the RCP protocol. This protocol is sequential (one operation at a time) and synchronous (each command must be completed before the next one starts).\n  [arguments] are command-specific, like file/directory name, file size or timestamps. ‘E’ command has no arguments.\n [optional data] is sent when the last command was ‘C’ (create file). The size of data is specified as an argument for ‘C’\n In addition, there are also control bytes, that are sent on their own without newlines:\n 0x00 - “OK”, acknowledgement of completing the last command (like writing a local file). This is also sent by the receiver at startup to let the sender know it’s ready to receive commands.\n 0x01 - “warning” that’s followed by a line (terminated by newline) to be displayed to the user.\n 0x02 - “error” with an optional message (same as warning) but the connection is terminated afterwards.\n This annotated example (everything after the  # symbol is not in the protocol) should clarify the whole process:\n   So far, SCP doesn’t sound too bad. The hacky design and lack of spec are unfortunate, but it’s a simple enough tool and seems to work for a lot of people. But now let’s look at some real-world issues.\n  The sequential nature of the wire protocol, with mandatory acknowledgements for every single command add a lot of overhead. For example, if the single acknowledgement packet gets dropped along the way, the entire connection pauses until a re-transmission kicks in. On top of that, sending all the data without compression or asking the receiver whether it already has the file is less than ideal.\n An experienced sysadmin can tell you that  tar-ing the files and sending a single big archive is substantially faster than using a recursive  scp command. In fact, you can do this without SCP at all:\n # Copy a local folder with 10000 files$ find /tmp/big_folder/ -type f | wc -l10000# Using scp$ time scp -r -q /tmp/big_folder/ server:/tmp/big_folder________________________________________________________Executed in 882.99 millis\tfish \texternal usr time 114.09 millis\t0.00 micros 114.09 millis sys time 278.46 millis 949.00 micros 277.51 millis# Using tar over ssh$ time sh -c &#34;tar cf - /tmp/big_folder | ssh server &#39;tar xC /tmp/ -f -&#39;&#34;tar: Removing leading &#39;/&#39; from member names________________________________________________________Executed in 215.68 millis\tfish \texternal usr time 93.22 millis\t0.00 micros 93.22 millis sys time 66.51 millis 897.00 micros 65.62 millis\n From 882.99ms to 215.68ms, that’s a 4x speedup in this (admittedly worst-case for  scp) example!\n  SCP runs on top of SSH, so it’s totally secure, right? Oh, my sweet summer child, things are never secure.\n  The scp protocol is outdated, inflexible and not readily fixed. We recommend the use of more modern protocols like sftp and rsync for file transfer instead.\n If a shell on the remote side prints out anything for non-interactive sessions, your local scp process will happily interpret that output as SCP commands. At best, this will break the SCP protocol with obscure errors. At worst, the remote shell startup script is malicious and sends you an exploit payload instead of the file you wanted.\n And what about implementation bugs? Back in 2018,  Harry Sintonen discovered  a bunch of vulnerabilities in popular SCP implementations (including OpenSSH). These ranged from modifying permissions on a directory to overwriting arbitrary files (effectively code execution because of  ~/.ssh/authorized_keys or  ~/.bashrc) and injecting terminal escape sequences to hide any traces. These vulnerabilities are a good lesson for anyone building networked CLI applications.\n  Okay, so maybe SCP has some problems after all. How should we move the files around our computers without setting up a brand new system or resorting to snail-mailing USB drives?\n SFTP is widely considered the successor of SCP. It still runs on top of SSH for transport-layer security and doesn’t require setting up access separately. It can give you a custom interactive prompt for exploring the remote filesystem or you can script with a pre-written series of commands.\n On the downside, you will need to learn SFTP prompt commands and the protocol itself hasn’t been fully standardized (there were  many RFC drafts, but the authors eventually gave up).\n Rsync is another good alternative. The usage is exactly the same as with the scp command - it’s a drop-in replacement that also leverages SSH. Rsync is all about performance - it does a lot of complex computation locally to send as little data as possible over the network. Technically, it does data synchronization instead of pure transfer - if remote and local content are similar, only the deltas will be sent.\n Again, it comes with its own downsides: the sender uses a lot of CPU power to figure out what to send and the receiver uses a lot of disk IO to put things together in the right order. Rsync also does not come pre-installed on most systems, unlike OpenSSH.\n If you need to send a file over to someone (and email isn’t an option),  Magic Wormhole is an easy tool to use. You exchange short, readable codes out-of-band (like over the phone) and throw in some files. It handles your typical  NAT traversal headaches and is much easier than exchanging SSH keys.\n The problem is that you need to exchange the authentication codes for each transfer, so it’s only good for one-off copies. The whole system is designed to be used by humans, if you need to transfer data between your laptop and some servers, Magic Wormhole is not the right tool.\n On the heavier side, there’s also software for syncing folders between personal devices (including phones and servers). Two great examples are  Syncthing and  Perkeep. These systems are meant to always run in the background and exchange diffs between the files, similar to rsync.\n Both take some time to learn and configure (especially if you make use of their many, many features) and are primarily optimized for personal data (such as photos or chat logs), not for infrastructure scripting. They’re also much slower and more resource-hungry than everything I’ve mentioned above.\n  SCP is a simple tool with a quirky implementation. It does an okay job at moving files around, but newer software outperforms it in many ways. SCP is still fine for simple personal use-cases, between computers you trust. It’s familiar and always there for you.\n But if you’re having performance issues or need to meet a higher security standard, any of the alternatives listed above are preferable to SCP. Pick the one that best suits your needs and migrate over.", "posttime": "2020-06-20 06:51:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "scp,familiar", "title": "SCP-熟悉、简单、不安全且速度慢", "title_en": "SCP – Familiar, Simple, Insecure, and Slow", "transed": 1, "url": "https://gravitational.com/blog/scp-familiar-simple-insecure-slow/", "via": "", "real_tags": ["scp", "familiar"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007333, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "输入的电子邮件地址和/或密码与我们的记录不匹配，请检查并重试。\n一些社会期刊要求您创建个人简档，然后激活您的社会帐户。", "note_en": "The email address and/or password entered does not match our records, please check and try again.\n   Some society journals require you to create a personal profile, then activate your society account", "posttime": "2020-06-20 06:50:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,胡说八道,bullshit,电子邮件", "title": "玩胡说八道的游戏：空洞和误导性的沟通是如何接管的", "title_en": "Playing the Bullshit Game: How Empty and Misleading Communication Takes Over", "transed": 1, "url": "https://journals.sagepub.com/doi/10.1177/2631787720929704", "via": "", "real_tags": ["游戏", "胡说八道", "bullshit", "电子邮件"]}, {"category": "", "categoryclass": "", "imagename": "944a5fb8e536c5bf2628e33f72eb6ee5.jpg", "infoid": 1007332, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "北达科他州大福克斯--根据海关和边境保护局的数据，国土安全部(Department Of Homeland Security)在15个示威者聚集抗议乔治·弗洛伊德(George Floyd)之死的城市部署了直升机、飞机和无人机，记录了至少270小时的监视时间，远远超过之前披露的时间。\n该部门上个月在明尼阿波利斯的抗议活动中出动无人驾驶飞机，引发了国会的调查，并引发了人们对联邦机构侵犯示威者隐私权的广泛指责。\n但这只是一项全国性行动的一部分，该行动部署了通常用于在美国边境巡逻以寻找走私者和非法越境的资源。飞机拍摄了俄亥俄州代顿、纽约市、布法罗和费城等城市的示威活动，将视频片段实时发送到海关和边境保护局下属的空中和海洋行动部门管理的控制中心。\n据空中和海洋作战部门的高级官员称，视频随后被送入国土安全部(Homeland Security Department)管理的一个名为“大管道”的数字网络，其他联邦机构和地方警察部门可以访问该网络，以便在未来的调查中使用。\n这些爆料是在一场关于警察战术和联邦执法和军事力量在控制或监测示威活动中应该发挥的作用的激烈全国辩论中披露的。华盛顿拉斐特公园(Lafayette Park)清除示威者参加总统合影活动的事宜仍在审查之中。空军监察长正在调查军方本月是否不当使用侦察机监控华盛顿和明尼阿波利斯的和平示威者。\n哥伦比亚特区的国民警卫队已经得出初步结论，由于指挥不明确，导致其一架医疗后送直升机低空扑向首都的抗议者。再次呼吁警察工作非军事化的不仅是刑事司法倡导者，还有前共和党国土安全部官员，如迈克尔·切尔托夫(Michael Chertoff)和汤姆·里奇(Tom Ridge)，他们是国土安全部(Homeland Security Department)的前两位领导人，国土安全部是在9·11事件后成立的。11,2001，袭击事件。\n这里的海关和边境保护基地的官员否认了他们的飞机机队被滥用的任何说法，要么是为了侵犯隐私权，要么是为了恐吓抗议者。\n位于大福克斯的国家空中安全行动中心负责空中行动的副主任大卫·富尔彻(David Fulcher)说，“对我来说，最糟糕的是当我们被装扮成风暴士兵的时候。”“我们相信和平抗议。”\n他们说，这些飞机被用来提供暴力行为和纵火的鹰眼视角。据明尼阿波利斯的高级官员称，部署在明尼阿波利斯的“捕食者”(Predator)无人机，与航空和海洋作战部门拥有的其他八架无人驾驶飞机一样，既没有装备，也没有配备面部识别技术，飞行的高度让人无法识别个人身份或车牌。\n富尔彻说，“捕食者的传说--无所不知、无所不知、在窗外盘旋的捕食者--是不准确的。”“技术不在那里。”\n但众议院民主党人和隐私权倡导者仍然担心视频的潜在传播，以及军事化飞机可能对和平抗议活动产生的寒蝉效应。\n本月早些时候，众议院监督委员会的民主党人，包括纽约州众议员卡罗琳·B·马洛尼(Carolyn B.Maloney)和亚历山德里亚·奥卡西奥-科尔特斯(Alexandria Ocasio-Cortez)，马里兰州众议员杰米·拉斯金(Jamie Raskin)，以及来自马萨诸塞州的斯蒂芬·F·林奇(Stephen F.Lynch)和阿亚娜·普雷斯利(Ayanna Pressley)，向代理国土安全部部长查德·。\n民主党人在写给沃尔夫的一封信中说，“这届政府破坏了所有种族的美国人的第一修正案自由，他们正当地抗议乔治·弗洛伊德被杀。”“部署无人机和警察监视抗议活动是对权力的严重滥用，当用来对付抗议执法暴行的美国人时，这一行为尤其令人不寒而栗。”\n但民主党人显然没有意识到该机构行动的广度。大部分监视都是用飞机和直升机完成的。空中和海上行动确实派遣无人机参加了两次示威活动--分别在明尼阿波利斯和得克萨斯州德尔里约热内卢。\n根据空中和海上作战部门提供的数据，该机构的AS350直升机对13个不同城市的抗议活动进行了超过168小时的监视，其中最长的一次是在底特律上空58小时。该机构还部署了一架黑鹰直升机近13个小时，协助其他联邦机构在华盛顿特区进行监视。海关和边境保护局发言人克里斯·格罗根(Kris Grogan)表示，该机构的黑鹰直升机不是低空飞越示威者并引发恐慌的直升机之一。\n一架塞斯纳单引擎飞机进行了近58个小时的监视，其中超过38个小时在布法罗上空。海关和边境保护局代理局长马克·摩根(Mark Morgan)本月在一条推文中表示，这架飞机的工作人员帮助追捕了使用SUV袭击地面当地警察的嫌疑人。\n大多数请求都不是来自当地警察部门。在明尼阿波利斯，电话来自国土安全调查(Homeland Security Investigations)的一名特工。国土安全调查是移民和海关执法局的分支机构，负责对恐怖分子、武器贩运和毒品走私进行长期调查。\n这名特工当时在明尼阿波利斯地面，经常与空中和海军作战部门合作，在该地区有纵火和暴力事件报告后，他于5月28日请求帮助。空中和海洋作战部门也从亚利桑那州的塞拉维斯塔和得克萨斯州的科珀斯克里斯蒂派遣无人机，直到第二天才能派出飞机。经过大约两个小时的监视，这名特工和其他执法机构表示，不再需要它。\n海关和边境保护局国家空中安全行动的执行主任乔纳森·米勒(Jonathan Miller)说，“这是可自由支配的，但谁能对部署这些资产说是或不是，这在很大程度上是有责任的。”\n航空和海洋行动官员表示，该机构的协议防止了对抗议权利的侵犯。这些无人机可以在空中停留12到大约24小时，具体取决于安装了多少雷达设备，其飞行高度不低于1.9万英尺。根据美国国土安全部(Department Of Homeland Security)对无人机的隐私影响评估，从这个高度来看，无人机上的“电动光学红外线球”不会让操作员看到脸、眼睛或发色。\n但运营商可以跟踪抗议者或抢劫者的行动，指导地面执法，并查看是否有人背着背包或步枪。存储的录像可以在以后访问，以证实调查结果，例如目击者的描述，即火灾是由一小群人在给定的时间放火的，或者嫌疑人的逃跑路线。\n视频的实况转播被发送到一个移动运营中心，在那里，一组特工在用操纵杆移动无人机的同时监控电视屏幕。富尔彻说，其他要求从空中观看的联邦特工也可以在手机上看到这段视频。\n富尔彻说，存储在飞机和控制室中的监控录像平均30天后会被新视频覆盖。但是发送到“大管道”的视频和雷达图像也可以被国土安全部情报人员分析。根据国土安全部的隐私影响评估，这些数据可能会储存“长达五年”。根据这份文件和富尔彻的说法，如果联邦机构或警察部门能够证明他们需要进行刑事调查，就可以提供视频。\n国土安全部没有说明是否有执法机构要求拍摄示威活动的镜头。\n美国公民自由联盟(American Civil Liberties Union)高级政策分析师杰伊·斯坦利(Jay Stanley)表示，这架飞机可能会阻止人们抗议。令人担忧的不仅是边境机构正在对飞机和录像做什么，而且未来的行动如何适应快速进步的技术。\n斯坦利说，“你看到一架飞机，你不知道这架飞机目前搭载的是什么技术。”“当你在外面抗议警察滥用职权时，一架军事化的警机在你头顶盘旋，这是一种军国主义和主导性的东西。”\n在截至9月份的财年中，空中和海上行动记录了超过9.28万小时的飞行时间，其中大部分花在了边境巡逻上。但直升机、飞机和无人机花费了8000多个小时帮助执法机构执行搜救任务和其他刑事调查。", "note_en": "GRAND FORKS, N.D. — The Department of Homeland Security deployed helicopters, airplanes and drones over 15 cities where demonstrators gathered to protest the death of George Floyd, logging at least 270 hours of surveillance, far more than previously revealed, according to Customs and Border Protection data.\n The department’s dispatching of unmanned aircraft over protests in Minneapolis last month sparked a congressional inquiry and widespread accusations that the federal agency had infringed on the privacy rights of demonstrators.\n But that was just one piece of a nationwide operation that deployed resources usually used to patrol the U.S. border for smugglers and illegal crossings. Aircraft filmed demonstrations in Dayton, Ohio; New York City; Buffalo and Philadelphia, among other cities, sending video footage in real time to control centers managed by Air and Marine Operations, a branch of Customs and Border Protection.\n The footage was then fed into a digital network managed by the Homeland Security Department, called “Big Pipe,” which can be accessed by other federal agencies and local police departments for use in future investigations, according to senior officials with Air and Marine Operations.\n The revelations come amid a fierce national debate over police tactics and the role that federal law enforcement and military forces should play in controlling or monitoring demonstrations. The clearing of demonstrators from Lafayette Park in Washington for a presidential photo op is still under scrutiny. The Air Force inspector general is  investigating whether the military improperly used a reconnaissance plane to monitor peaceful protesters in Washington and Minneapolis this month.\n And the National Guard in the District of Columbia has already reached a preliminary conclusion that a lack of clarity in commands led to one of its medical evacuation helicopters swooping low on protesters in the nation’s capital. Renewed calls to demilitarize police work have not only come from criminal justice advocates but  also former Republican Homeland Security officials such as Michael Chertoff and Tom Ridge, the first two leaders of the Homeland Security Department, which was created after the Sept. 11, 2001, attacks.\n Officials at the Customs and Border Protection base here rejected any notion that their fleet of aircraft had been misused, either to violate privacy rights or intimidate protesters.\n “The worst part for me is when we’re made out to be storm troopers,” said David Fulcher, the deputy director for air operations at the National Air Security Operations Center in Grand Forks. “We believe in peaceful protests.”\n The aircraft, they said, were used to provide an eagle-eyed view of violent acts and arson. The Predator drone deployed to Minneapolis, like eight other unmanned aircraft owned by Air and Marine Operations, was neither armed nor equipped with facial recognition technology and flew at a height that made it impossible to identify individuals or license plates, according to senior officials here.\n “The legend of the Predator — the all-seeing, all-knowing, hover-outside-your-window Predator — it’s just not accurate,” Mr. Fulcher said. “The technology is not there.”\n But House Democrats and privacy advocates still worry over the potential dissemination of the footage and the chilling effect that militarized aircrafts could have on peaceful protests.\n Earlier this month, Democrats with the House Oversight Committee, including Representatives Carolyn B. Maloney and Alexandria Ocasio-Cortez of New York, Jamie Raskin of Maryland, and Stephen F. Lynch and Ayanna Pressley, both of Massachusetts, protested to Chad Wolf, the acting secretary of homeland security.\n “This administration has undermined the First Amendment freedoms of Americans of all races who are rightfully protesting George Floyd’s killing,” the Democrats said in  a letter to Mr. Wolf. “The deployment of drones and officers to surveil protests is a gross abuse of authority and is particularly chilling when used against Americans who are protesting law enforcement brutality.”\n But Democrats apparently were unaware of the breadth of the agency’s actions. Most of surveillance was done with planes and helicopters. Air and Marine Operations did dispatch drones to two demonstrations — in Minneapolis and in Del Rio, Texas.\n  The agency’s AS350 helicopters conducted more than 168 hours of surveillance of protests in 13 different cities, the longest stretch being 58 hours over Detroit, according to data provided by Air and Marine Operations. The agency also deployed a Blackhawk helicopter for nearly 13 hours, assisting other federal agencies with surveillance in Washington, D.C. Kris Grogan, a spokesman for Customs and Border Protection, said the agency’s Blackhawk was not one of the helicopters that flew low over the demonstrators and caused panic.\n A Cessna single-engine plane conducted nearly 58 hours of surveillance, more than 38 of them over Buffalo. Mark Morgan, the acting commissioner of Customs and Border Protection, said in a tweet this month that the officers manning that plane helped track down suspects who used an S.U.V. to hit local police on the ground.\n Most of the requests did not come from local police departments. In Minneapolis, the call came from an agent in Homeland Security Investigations, the branch of Immigration and Customs Enforcement that conducts longer-term investigations into terrorists, weapons trafficking and drug smuggling.\n The agent, who was on the ground in Minneapolis and works with Air and Marine Operations regularly, requested the help on May 28 after reports of arson and violence in the area. Air and Marine Operations, which also dispatches drones from Sierra Vista, Ariz., and Corpus Christi, Texas, was not able to send the aircraft until the next day. After about two hours of surveilling, the agent and other law enforcement agencies said it was no longer needed.\n “It’s discretionary, but there’s a huge degree of accountability as far as who can say yes or no to deploying these assets,” said Jonathan Miller, the executive director of the National Air Security Operations at Customs and Border Protection.\n Air and Marine Operations officials said agency protocol prevents infringement on the right to protest. The drones, which can stay in the air from 12 to roughly 24 hours depending on how much radar equipment is attached, are directed to fly no lower than 19,000 feet. From that height, the “electrical optical-infrared ball” on the drones wouldn’t allow the operators to see faces, eyes or hair color, according to the Department of Homeland Security’s privacy impact assessment for the aircrafts.\n But operators can track movements of protesters or looters, direct law enforcement on the ground and see if someone is wearing a backpack or rifle. And stored footage could be accessed later to corroborate investigative findings , such as a witness account that a fire was set at a given time by a small group or the escape route of a suspect.\n  A live feed of the footage is sent to a mobile operations center, where a group of agents monitor television screens while moving the drone with joysticks. Other federal agents that request a view from the sky can also see the footage on their phones, Mr. Fulcher said.\n Mr. Fulcher said the surveillance footage, stored on the aircraft and in control rooms, is overwritten after an average of 30 days by new feeds. But video feeds and radar images sent to “Big Pipe” can also be analyzed by Homeland Security Department intelligence officers. That data may be stored for “up to five years,” according to Homeland Security’s Privacy Impact Assessment. If federal agencies or police departments can prove they need the footage for a criminal investigation, the video can be provided, according to the document and Mr. Fulcher.\n The Department of Homeland Security did not say whether any law enforcement agencies had requested footage of the demonstrations.\n Jay Stanley, a senior policy analyst at the American Civil Liberties Union, said the aircraft could discourage people from protesting. The concern is not only what the border agency is doing with the aircraft and footage but how future operations could adapt to quickly advancing technology.\n “You see an aircraft, you have no idea currently what technologies that aircraft is carrying,” Mr. Stanley said. “There is something militaristic and dominating about a militarized police aircraft hovering over you when you’re out there protesting police abuse.”\n Air and Marine Operations recorded more than 92,800 hours of flight time in the fiscal year that ended in September, most of that spent patrolling the border. But the helicopters, planes and drones spent more than 8,000 hours helping law enforcement agencies with search and rescue missions and other criminal investigations.", "posttime": "2020-06-20 06:50:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,aerial,飞机", "title": "美国使用空中监视观看了15个城市的乔治·弗洛伊德抗议活动", "title_en": "U.S. Watched George Floyd Protests in 15 Cities Using Aerial Surveillance", "transed": 1, "url": "https://www.nytimes.com/2020/06/19/us/politics/george-floyd-protests-surveillance.html", "via": "", "real_tags": ["美国", "aerial", "飞机"]}]