[{"category": "", "categoryclass": "", "imagename": "3e8c8aef16e76d252acb0e08359946bd.jpg", "infoid": 1003898, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人口普查局的数据显示，三分之一的美国人表现出临床焦虑或抑郁的迹象，这是冠状病毒大流行造成的心理损失的最明确和最令人担忧的迹象。\n当被问及通常用于筛查患者精神健康问题的问题时，24%的人表现出严重抑郁障碍的临床显著症状，30%的人表现出广泛性焦虑症的症状。\n这些发现表明，与大流行之前相比，这一数字出现了巨大的跃升。例如，在一个关于抑郁情绪的问题上，报告出现这种症状的比例是2014年全国调查结果的两倍。\n美国人如何回答这样一个问题：“你有多少次被情绪低落、沮丧或绝望所困扰？”回答了几天或一半以上时间的人需要表现出其他症状，才能筛查出阳性的抑郁症。\n2013-2014年的调查反映了两周内的症状，而2020年的调查反映了一周内的症状。\n这些令人不安的统计数据是在上周人口普查局的一批数据中发布的。该机构在4月底启动了一项针对美国家庭的每周紧急调查，以衡量疫情对就业、住房、金融、教育和健康的影响。在最新发布的数据中，在5月7日至12日期间联系了100万户家庭，超过4.2万户家庭做出了回应。\n在这份20分钟的调查中，美国官员提出了四个问题，几乎逐字摘自医生用来筛查患者抑郁和焦虑的表格。在经历了三个月的恐惧、孤立、失业率飙升和持续的不确定性之后，这些答案为了解这个国家的集体心理健康提供了一个实时窗口。\n纽约是全国冠状病毒爆发最严重的州，就成年人出现症状的比例而言，纽约在全国排名第12位。近一半的密西西比州人的焦虑或抑郁筛查呈阳性-这是一个令人震惊的数字。相比之下，在爱荷华州，略高于四分之一的筛查呈阳性。\n一些群体受到的打击比其他群体更严重。在年轻人、女性和穷人中，焦虑和抑郁的比例要高得多。考虑到这种病毒更有可能杀死老年人或让他们身患重病，年轻人的得分更低，这一点尤其值得注意。\n这些结果反映了现有趋势的深化：年轻人中抑郁、压力和自杀的增加。宾夕法尼亚大学(University Of Pennsylvania)精神病学教授玛丽亚·A·奥昆多(Maria A.Oquendo)说，“这是一个很多人一直在研究但没有明确答案的问题--无论是社交媒体还是这一代人的成长方式，或者只是因为他们更愿意谈论自己的问题。”“令人担忧的是，这种情况显然对年轻人产生了影响。”\n老年人感染冠状病毒的风险更高，但报告焦虑或抑郁症状的可能性较小。\n倡导组织美国心理健康组织(Mental Health America)主席保罗·詹弗里多(Paul Gionfriddo)表示，随着大学和学校寻求重新开学，他们必须考虑到心理健康。Gionfriddo说：“关于课桌间距和教室比例的讨论很多，但关于心理健康支持的讨论却很少。”“首先，我们必须对年轻人进行更多的心理健康筛查。”\n根据人口普查局的数据，死亡人数对穷人的打击也要大得多-给长期存在的心理健康差距带来了更大的缓解。\n“在过去的七天里，你有多少次因为无法控制或不能停止担心而感到困扰？”\n最高收入阶层中只有6%的人几乎每天都在失控地担心，相比之下，最低收入阶层中有23%的人几乎每天都在失控地担忧。\n例如，当被问及过去一周失控担忧的频率时，收入在15万美元或更多的人中有60%的人表示，他们根本没有为此而苦苦挣扎。与此同时，在年收入低于2.5万美元的人群中，这些数字几乎是相反的-只有32%的人表示他们不会与无法控制的担忧作斗争，23%的人表示他们几乎每天都会无法控制地担忧。\n在整个危机期间，低收入人群更多地在失业、食品短缺和低薪工作中苦苦挣扎，这些工作不允许他们在家工作，而且几乎没有提供经济和身体保护。\n人口普查局的调查结果呼应了越来越多的证据表明，美国人的精神伤害正在积累。凯撒家庭基金会(Kaiser Family Foundation)4月份发布的一项民意调查显示，近一半的美国人报告冠状病毒危机正在损害他们的心理健康。美国预防自杀基金会的一项调查发现，人们比大流行之前更频繁地经历焦虑和悲伤，也更频繁地谈论心理健康。研究人员预测，如果不进行干预，这个国家将面临自杀、药物滥用和过量死亡的增加。\n“考虑到正在发生的事情，这是可以理解的。如果你不感到焦虑和沮丧，那就太奇怪了。“Oquendo说。“这种病毒不像飓风或地震，甚至不像恐怖袭击。它不是你看得见、摸不着的东西，但对它的恐惧无处不在。“。\n这些心理健康问题取自两种名为PHQ-2和GAD-2的筛查工具，一些初级保健医生使用这两种工具来筛查患者的抑郁和焦虑。官员们说，在疾病控制和预防中心国家卫生统计中心的建议下，他们被纳入了人口普查局的紧急冠状病毒项目-其正式名称是2020年家庭脉搏调查(Household Pulse Survey)。\n并不是每个在这些测试中筛选出阳性的人都有临床抑郁或焦虑。华盛顿邮报对这一主题的研究进行了分析，发现在平时PHQ-2筛查呈阳性的人中，约有一半患有严重的抑郁障碍。GAD-2的这一百分比较低。\n人口普查局计划在三个月内每周进行这项调查，这可能会产生有价值的数据，说明美国人对这种流行病的体验可能会发生什么变化。但初步结果引发了人们对政府计划如何应对迫在眉睫的精神健康危机的质疑。\n当这种筛查工具在医院或医生办公室使用时，临床医生通常有义务通过进行深入测试并将他们与治疗和精神科医生联系起来，对筛查呈阳性的患者进行随访。\n当被问及如何跟进人口普查局调查的受访者时，疾控中心在一份电子邮件声明中表示，“根据受访者的回复向他们提供任何健康建议是不可行的，也是不合适的。”\n心理健康专家表示，政府有责任在更广泛的全国范围内解决调查突出的问题。\n甚至在大流行之前，该国的精神卫生保健就严重资金不足，并充斥着准入、差距和保险路障等问题。在冠状病毒大流行之后，国会拨出了数万亿美元的紧急资金，但几乎没有一笔资金用于心理健康项目和诊所。\n“如果你衡量一个问题，大概是因为你想为此做点什么，”美国精神病学协会前主席奥昆多说。\n她说，例如，医生不会诊断癌症患者，只是为了送他们上路。“既然政府知道人们受苦的范围有多广，问题是他们将如何应对。”\n如果您或您认识的人需要帮助，请拨打全国预防自杀生命线800-273-Talk(8255)。危机短信热线还通过短信向危机中的人提供24/7全天候的免费保密支持，当他们发短信给741741的时候。", "note_en": "A third of Americans are showing signs of clinical anxiety or depression, Census Bureau data shows, the most definitive and alarming sign yet of the  psychological toll exacted by the coronavirus pandemic.\n  When asked questions normally used to screen patients for mental health problems, 24 percent showed clinically significant symptoms of major depressive disorder and 30 percent showed symptoms of generalized anxiety disorder.\n  The findings suggest a huge jump from before the pandemic. For example, on one question about depressed mood, the percentage reporting such symptoms was double that found in a 2014 national survey.\n  How Americans responded to the question “How often have you been bothered by feeling down, depressed, or hopeless?” Someone who answered &#34;several days&#34; or &#34;more than half the days&#34; would need to show other symptoms to screen positive for depression.\n                              The 2013-2014 survey reflects symptoms over a two-week period, while the 2020 survey reflects symptoms over a one-week period.\n    The troubling statistics were released last week in  a tranche of data from the Census Bureau. The agency launched an emergency weekly survey of U.S. households at the end of April to measure the pandemic’s effects on employment, housing, finances, education and health. In the most recent data release, 1 million households were contacted between May 7 and 12, and more than 42,000 responded.\n  Buried within that 20-minute survey, U.S. officials included four questions taken nearly word-for-word from a form used by doctors to screen patients for depression and anxiety. Those answers provide a real-time window into the country’s collective mental health after three months of fear, isolation, soaring unemployment and continuing uncertainty.\n    New York, which had the worst  coronavirus outbreak in the country, ranked 12th nationwide in terms of share of adults showing symptoms. Nearly half of Mississippians screened positive for anxiety or depression — a staggering number. By contrast, in Iowa, just over a quarter screened positive.\n      Some groups have been hit harder than others. Rates of anxiety and depression were far higher among younger adults, women and the poor. The worse scores in young adults were especially notable, given that the virus has been more likely to kill the elderly or leave them critically ill.\n  Those results reflect a deepening of existing trends: rising depression, stress and  suicide among young adults. “It’s been a problem many have been studying with no clear answers — whether it’s social media or the way this generation was reared or just a greater willingness to talk about their problems,” said Maria A. Oquendo, a professor psychiatry at the University of Pennsylvania. “What’s worrying is the effect this situation is clearly having on young adults.”\n  Older people are more at risk for the coronavirus, but less likely to report symptoms of anxiety or depression\n  As universities and schools  look to reopen, they must take mental health into account, said Paul Gionfriddo, president of the advocacy group Mental Health America. “There’s been plenty of talk about spacing desks apart and classroom ratios but not much at all about mental health support,” Gionfriddo said. “For one thing, we have to do much more mental health screening among young people.”\n  The toll has also hit the poor much harder, according to the Census Bureau data — throwing into even sharper relief mental health disparities that have long existed.\n  “Over the last seven days, how often have you been bothered by not being able to control or stop worrying?”\n                                                      Only  6% in the highest income bracket worried uncontrollably  nearly every day,  compared with  23% in the lowest income bracket\n  When asked, for example, how often they worried uncontrollably in the past week, 60 percent of those making $150,000 or more said they didn’t struggle with it at all. Meanwhile, those numbers were almost inverted among people making less than $25,000 a year — with only 32 percent saying they didn’t struggle with uncontrollable worry and 23 percent saying they worried uncontrollably nearly every day.\n  Throughout the crisis, lower-income people have struggled more with  unemployment,  food scarcity and  low-wage jobs that don’t allow them to work from home and that offer few financial and physical protections.\n    The findings by the Census Bureau echo  growing evidence of accumulating mental harms among Americans. Nearly half of Americans reported the coronavirus crisis is impairing their mental health, according to  a Kaiser Family Foundation poll released in April. A survey by the  American Foundation for Suicide Prevention found people are experiencing anxiety and sadness more often than before the pandemic and are talking about mental health more frequently. Researchers have projected that without intervention, the country is poised to experience a rise in suicides, substance abuse and overdose deaths.\n  “It’s understandable given what’s happening. It would be strange if you didn’t feel anxious and depressed,” Oquendo said. “This virus is not like a hurricane or earthquake or even terrorist attack. It’s not something you can see or touch, and yet the fear of it is everywhere.”\n  The mental health questions were taken from two screening tools called  PHQ-2 and  GAD-2, used by some primary care doctors to screen patients for depression and anxiety. They were included in the Census Bureau’s emergency coronavirus project — its official name is the 2020 Household Pulse Survey — at the recommendation of the Centers for Disease Control and Prevention’s National Center for Health Statistics, officials said.\n  Not everyone who screens positive on these tests has clinical depression or anxiety. A Washington Post analysis of research studies on the topic found that about half of those who screen positive on the PHQ-2 in normal times have major depressive disorder. That percentage is lower for the GAD-2.\n    The Census Bureau plans to conduct the survey every week for three months, which could yield valuable data on how Americans’ experience of this pandemic may change. But the initial results raise questions about what the government plans to do about a looming mental health crisis.\n  When such screening tools are administered in a hospital or doctor’s office, clinicians are usually obligated to follow up with patients who screen positive by conducting in-depth tests and connecting them to therapy and psychiatrists.\n  When asked about following up with respondents to the Census Bureau survey, the CDC said in an emailed statement, “It is not feasible, nor would it be appropriate, to provide any health advice to respondents on the basis of their responses.”\n  Mental health experts say the government has a responsibility to address on a wider national scale the problems highlighted by the survey.\n  Even before the pandemic, mental health care in the country was severely underfunded and riddled with problems of  access,  disparities and  insurance roadblocks. In the wake of the coronavirus pandemic, Congress appropriated trillions of dollars in emergency funds, but  almost none of it has gone toward mental health programs and clinics.\n  “If you measure a problem, presumably it’s because you want to do something about it,” said Oquendo, former president of the American Psychiatric Association.\n  Doctors don’t diagnose patients with cancer, for instance, only to send them on their way, she said. “Now that the government knows how widely people are suffering, the question is what are they going to do about it.”\n  If you or someone you know needs help, call the   National Suicide Prevention Lifeline  at 800-273-TALK (8255).   Crisis Text Line  also provides free, 24/7, confidential support via text message to people in crisis when they text to 741741.", "posttime": "2020-05-27 13:38:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "表现,show,心理健康", "title": "三分之一的美国人现在表现出临床焦虑或抑郁的迹象。", "title_en": "A third of Americans now show signs of clinical anxiety or depression", "transed": 1, "url": "https://www.washingtonpost.com/health/2020/05/26/americans-with-depression-anxiety-pandemic/", "via": "", "real_tags": ["表现", "show", "心理健康"]}, {"category": "", "categoryclass": "", "imagename": "041d359d2dafead0564752b7786cde35.jpg", "infoid": 1003897, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "编辑：在这篇讽刺帖子发表大约3年后，一家名为“.NetRock”的网站决定把它搞成一个数字。讽刺显然超出了他们的头脑，我在帖子中概述的事实遭到了嘲笑。我对.NetRock有点失望，因为这对他们来说可能是一个很好的机会，让他们更多地了解现代Object-Pascal开发及其生态系统。他们似乎真的对德尔福和Object-Pascal在2016年(和2019年)被使用感到困惑，他们的行为和反应表明了我们对他们这种类型的“兄弟”的非常傲慢和无知。\n我必须承认，像.NetRock这样的大型节目完全不知道Object-Pascal作为一种语言在世界各地拥有数百万用户，这让我有点震惊。您可以使用像RemObjects的Oxygene这样的编译器，它们面向.Net、Java、x86、ARM和WebAssembly。因此，他们关于“如何将Delphi应用程序移植到C#”的整个播客都是荒谬的，因为这不是将代码从Delphi迁移到.Net的方式。Elements生态系统(涵盖C#、Pascal、Java、Swift和GoLang)直接安装到Visual Studio中，并将Object-Pascal添加到环境中。您还可以通过自动化在Pascal和C#之间转换源代码。至少可以说，手动处理这些任务是业余的，但老实说，当他们用辱骂打开他们的播客时，我并没有期待太多。\nNetRock似乎忽略了另一点，那就是自从Embarcadero从Borland手中接管以来，Delphi一直在积极地进行优化。2016年，Object Pascal在Tiobi指数上排在第14位[2.164分]，超过了[全球]最流行的编程语言，仅比C#低9分。因此，使您的遗留Delphi应用程序现代化的最具成本效益的方法是从RemObjects购买元素，或者将您的Delphi版本升级到本世纪。\n如果他们不厌其烦地查看一下，他们也会知道我在社交媒体上管理着大约16+个开发人员小组，总共大约有50.000名开发人员。我也曾为制作德尔福的Embarcadero工作过，所以我的言论虽然异想天开和讽刺，但都是基于事实的。我与美国的财富500强公司以及欧洲各地的大公司合作，这些公司的日常运营都依赖于Object-Pascal。见鬼，就连华特迪士尼公司也想在2018年摆脱.Net，转而使用Object Pascal。事实证明，在针对硬件中断和“老式”自动化进行编码时，JIT是一场灾难。谁能猜到呢？(顺便说一句，这是讽刺)。\n总体而言，.NetRock的人似乎对专业开发人员用于专业工作的工具一无所知，这一点令人担忧。手工移植Delphi代码库，好吧，充其量是业余的。他们不妨做一个关于如何使用ms-aint创作艺术的播客，因为人们使用的不是Adobe Photoshop或Illustrator(顺便说一句，这是讽刺)。\n然而，我也很高兴，因为.NetRock无意中展示了我对完美🙂的观点，而不是更多地了解Anders Hejlsberg在加入微软之前的旅程和生活，.Net类层次结构如何受到Delphi VCL框架的严重影响，或者.Net最终成为.Net的概念实际上是如何在更早的时候被原型和实验的-他们直接跳到了嘲笑中。一篇讽刺帖子(哈哈！)。\n您可以单击此处查看我的完整回复。说真的，怎么可能把这篇老帖子误认为是严重的讽刺，这是我无法理解的。但我要感谢.NetRock证明了我的观点。我再也找不到比这更好的傲慢和无知的例子了，🙂摇滚！\n那些关注我的博客或了解我个人的人也知道，我不会刻意表现出对抗或不尊重的态度。我尽我最大的努力走中间路线，在任何事情上都要看到积极的一面。但有时，你会面临某种程度的愚蠢，这需要你的回应，而不是口头上的回应。这就是其中一个案例。\n最近，我看到越来越多的Delphi开发人员与C#开发人员展开辩论，他们面临的态度和信仰体系相当坦率地说是完全是无稽之谈。它不是基于历史或事实，而是植根于幼稚的“主义”的争论。旧习惯和对新意味着更好的概念的不健康痴迷的混合。\n如果是这样的话，那么C/C++应该是彻头彻尾的狗屎，因为C比Pascal早了3年。创建Pascal是为了取代C，并摆脱(在其他事情中)荒谬和耗时的头文件实践，更不用说当头引用其他头和条件符号堆积时仍然会发生的递归地狱。\n你知道花括号是怎么流行起来的吗？跳到离你最近的塔迪斯，把目的地设在20世纪60年代中期。回到大型机只有葡萄牙那么大的时候，1024字节的内存是炸弹。您知道，那时候内存很少，几乎所有的语言(或工具包)都需要节省空间。因此，{}个卷曲被用作“BEGIN”和“END”等单词的代号。为什么？因为一个ASCII字节小于五个ASCII字节。当您只有几KB内存时，每个字节都很重要。\nPS：当我在这里使用工具包这个词的时候，我真的是指在织布机上随意堆积的ASM片断。收集来制作C的骨头实际上是当时不同工程团队制造的自制工具包的混合体。这些工具包中的每一个都有自己的粉丝俱乐部/斜杠/法律代表；因为他们所有人奇迹般地都在其他人之前同时发明了完全相同的东西。这些家伙一直在争夺谁拥有什么，一直持续到沃特康时代。这可能是自罗马皇帝卡里古拉宣布服装非法以来，持续时间最长的成年人发脾气的示威活动。\n快进到1970年，大型机上的内存使用量已经翻了几番，就像摩尔五年前预测的那样。丹尼斯·里奇(Dennis Ritchie)苦口婆心地从脾气暴躁的老技术人员手中挣扎出来的C标准应该升级了。测试是由穿着灰色衣服的非常枯燥、非常严肃的人完成的-他们惊恐地发现，人类与单词和短语的互动速度会比符号和字形更快。因此，像“开始”这样的词被大脑接受的速度会比{.。这只是淘汰品，不是吗？\n你不能一边称赞安德斯是一位天才建筑师，一边又把他毕生的作品扔进垃圾桶。也许你应该问问自己，为什么安德斯如此热爱Object Pascal，以至于他职业生涯的一半时间都致力于确保大学能够接触到它。\n尼克劳斯·沃斯(Niklaus Wirth)出场了，他是一个非常聪明和有学问的人，他不会捕捉到例外；他是一个例外。但在伯克利的同事们旁边，我们亲爱的尼克劳斯是一位广为人知的摇滚明星。他决定，为了让学生更容易掌握编程，更容易学习，最重要的是，建立一个更安全的代码标准，他们应该把科学放在心上，并将其包括在编程语言设计中。因此，他穿上了最庄严的实验室大衣，开始实施“更好的C”，在那里他应用了大脑比符号和符号更快地识别单词的研究。9个月后，帕斯卡出生了，为了庆祝那一天，尼克劳斯穿上了彩色袜子。一项有风险的生意可能会让他失去在奇怪的棕色女生联谊会俱乐部的席位，在那里他是仪式的主持人。但是，嘿，尼古拉斯不是一个叛乱者，而这毕竟是摇摆不定的70年代。\n我的意思是？这就是Pascal使用“BEGIN”和“END”而不是{AND}的原因。这是使帕斯卡语言如此容易掌握的众多方面中的一个。\n撇开异想天开的讽刺不谈：知道C实际上比帕斯卡更老，更不用说它在功能、深度和复杂性上都与帕斯卡相同--它会是什么呢？你还坚持认为老的价值要比新的低吗？或者，是否实际上您一开始就没有真正仔细研究过对象Pascal？您是否安装了Delphi的现代版本，并将其作为值得的试驾？或者，你只是根据你喜欢和知道的东西说出来，而不是你不知道的，甚至没有尝试过的东西。\n我8岁的女儿就是这样。她还没尝过就对食物下了决心。一个训练有素的工程师肯定能做得更好吗？\n我这么说是因为--如果我们按照你的推理路线，C/C++应该不能生成C#。旧的和过时的东西怎么可能产生新的和令人兴奋的东西呢？你应该知道C#是用C++和汇编语言写的，对吧？而且Java和所有其他高级语言并不是自发地自组装的。它们都是用C、汇编语言或PASCAL编写的。这是有原因的。\n就像大自然有不同的层次，从颗粒到矿物，从矿物到细菌，从细菌到植物，从植物到昆虫(等等)-计算机也是如此。这些层次中的每一个都有管理它们的法律和原则，无论你多么想把一些东西从更高的层次引入到更低的层次-那就是现实不是这样运作的。\n规律很简单：每级只能散发复杂性以上。所以汇编语言被用来产生C和PASCAL，C和PASCAL被用来产生C++和对象PASCAL，C++和对象PASCAL被用来产生你认为理所当然的每一项技术。\n因此，当您批评Delphi而使用C#时，您只是在潜意识中没有真正理解原型语言和基于上下文的语言之间的区别。\n这就好比说Visual basic5比汇编程序更酷。你不会和那样的人辩论，你只是用怜悯的眼光看着他们。我不知道软件工程学士学位在其他地方是多少年，但如果你只是在大学度过了3年，在大学度过了2年，然后又花了一两年时间获得文凭-这就是你毕业时的洞察力水平，那我就可怜你了。我同情你的雇主，因为你迟早会带来世界末日。\n如果我们把理性的逻辑思维运用到手头的这个命题上，就不能不得出这样的结论：“新总是更好”的观念是错误的，是把营销误认为是事实，把资本主义误认为是科学。计算的基本原则不会因为您偏爱高级编程语言而改变。C/C++嵌入式市场不会奇迹般地翻身，因为C#在嵌入式设备上是一场减轻了灾难的灾难。我说的是经验，而不是喜好。\n你的老师应该教你这一点：“在电脑里，就像大自然一样，过去永远是活的。”仔细观察您的全新PC或Mac：BIOS、VESA屏幕模式、非线性内存、硬件中断向量和支持不少于3个指令集的CPU。你有一层又一层不断增加的复杂性(也就是“过去的还在”)。为什么不打电话给Linus Torvalds，问他为什么在他的工作中不使用C#；或者NVIDIA为什么他们的GPU流水线只附带C头而不是C#类。我敢肯定，该死的，我不想成为那个电话的接收方。\n唯一值得使用的C#编译器实际上是RemObjects C#(Elements编译器)。因为与mono或ms的编译器不同，Elements在与C/C++和Pascal相同的级别上构建适当的二进制文件。如果您愿意，您实际上可以使用元素编写内核模块，这是使用Mono或Visual Studio所不能做的。见鬼，.Net服务仍然需要Windows上的服务主机。\n实际上并非如此。今天被称为.Net的东西，从它的CIL中间语言一直到全局汇编缓存，几乎都是Delphi，上面有一个新的语法解析器。是的，您没看错，整个.Net产品系列实际上都是Delphi重构的。整个字节码制度是安德斯从事的最后几个恶作剧项目之一，实际上在它神奇地重新成为微软的旗舰产品之前几年，Borland的新闻服务器上就描述了整个字节码制度。\nAnders Hejlsberg在Borland工作期间创建并制作了这些技术的原型(许多其他公司也是如此，因为Java使字节码变得很酷)。事实上，C#和整个.net堆栈之父不是别人，正是Delphi之父。\n在Borland大学(在Borland.language新闻馈送中，我记忆犹新)，这些技术以“便携Delphi”的代号被提及。我在新闻服务器上关注了很长一段时间。Borland正在修补下一件大事，这已经不是什么秘密了，我相信这最终是Borland对Java的回应。因为当时爪哇吃掉了相当大一块博兰兹的教育席位执照。如果Anders继续为Borland工作，Delphi和C++Builder今天可能会基于字节码。\n事实：安德斯加入微软时被分配的第一个项目是J#。微软试图劫持Java语言。微软输掉了这场法律战，被迫转向。最终结果将是C#。\n所以，当你这个C#的粉丝提出Delphi在某种程度上不如.Net，或者说Pascal对象过时了，在技术上落后于C#时，坦率地说，你完全不知道自己在说什么。是仿制药吗？我们有那个。是一个丰富而强大的RTTI吗？我知道了。匿名手术？它也在那里。事实上，这里的整个误解源于这样一个事实，即C#开发人员通常认为“Delphi 7”就是Delphi的全部。这就是说.Net就是版本1中出现的东西。在我们这个时代，谁会该死地使用Delphi 7呢？\n但我只想说清楚一点：Anders Hejlsberg不仅仅是C#和dot net之父：他也是Delphi之父，而且在此之前他还诞生了Turbo Pascal。事实上，Anders在加入微软之前已经有3个(如果不是4个)Pascal开发系统支持他。\n安德斯工作的公司Borland被微软赶出了牧场。比尔·盖茨发起了一场地球上很少有公司能够忍受的金融冲击。原因是微软确实拥有市场上最差的开发工具(Visual Basic和Visual C++)，而Borland则是最好的。因此，在很长一段时间里，Borland在软件开发方面彻底摧毁了微软。\n当Borland后来开始与Linux(Delphi Kylix)调情时，这一定让微软的研发部门感到恼火。Delphi负责数以千计的桌面应用程序，这是Windows的同义词-如果Linux用户获得了像Delphi这样的RAD工具，成千上万的应用程序准备好移植到上面呢？算一算吧。你要记住，这是在云计算出现之前，微软没有后备战略，依赖于台式机和服务器的销售。Linux可以做Windows能做的一切，但它缺乏桌面应用程序、用户友好性和Borland使之变得简单的功能。\n基本上，微软所做的就是从Borland手中买断安德斯(他们还收购了Borland研发部门的一大部分)，同时从各个角度攻击公司。将他们淹没在胡说八道的诉讼、专利主张和微软当时所有肮脏、懦弱的做法中(我们都还记得网景以及当时的情况)。\n比尔·盖茨亲自打电话给安德斯，给了他“一个我无法拒绝的提议”。不管那是什么意思。\n因此，我要把这个神话抛诸脑后：作为一种语言的C#和作为一种技术的.net并不是起源于微软。它写满了Borland，它的体系结构与Delphi和C++Builder紧密结合在一起。像微软这样的公司不再创新，他们购买能力，并将其重新塑造为自己的品牌。\n如果这还不够，那就仔细看看.Net框架是如何组织的。要特别注意基类和RTTI的特性和方法。您看到的是VCL、可视化组件库、Delphi和C++Builder的运行时库。\n如果您熟悉Delphi，并且熟悉它的RTL和C#，那么您很快就能认出它的架构。语法可能不同，但是组织和名称都太熟悉了。\n这从没有任何秘密，但它也没有广告，所以我不会责怪人们没有认识到它。但是，当人们开始对本应是激情爱好或专业纪律的行为感到不快时，就必须说出真相，因为.NET框架的基础是直接从VCL中拿出来的。\n为什么不能呢？整个平台最初的代号是“可移植的Delphi”，它甚至是由同一作者设计的-所以为什么它基本上是用不同的语法解析器转世的Delphi就不足为奇了呢？无论哪种方式，都应该开始在您的脑海中响起几个铃声-告诉您可能对Delphi和Object Pascal的看法总体上是错误的，这可能是因为您从一开始就对Delphi知之甚少。\n所以，尽管你可能认为C#有别于Delphi，但你想象的给予dot net相对于Delphi的优势-实际上恰恰相反：它就是Delphi。它起源于德尔福，受到德尔福的启发，直接来自德尔福的发明者本人。在为微软工作之前，Anders负责两个不同的Object Pascal开发平台。花点时间反思一下这一点。\n你不能一边称赞安德斯是一位天才建筑师，一边又把他毕生的作品扔进垃圾桶。也许你应该问问自己，为什么安德斯如此热爱Object Pascal，以至于他职业生涯的一半时间都致力于确保大学能够接触到它。\nC/C++今天仍然存在，这一事实证明了我的观点：在处理基本技术时，年龄没有意义。这些语言体现了计算的基本原理。它们不会变老，因为它们代表了一个永远无法取代的根本水平。现在有一条法律说，C必须在那里，坚持下来的最终是C带来的特性-从汇编到桌面。这些相同的功能只能在另一种语言中找到，即帕斯卡语。\n事情是这样的是有原因的。以及在你建立标准之前的程序员，这些标准解决了你可能不需要处理的事情，但那是因为他们在你之前处理了这些事情。你看不到水管并不意味着它不在那里。\n这些编译器负责所有其他语言、操作系统、应用程序和服务所依赖的基础。移走这些，整个纸牌屋就会倒塌。\n因此，C/C++和object Pascal继续存在，甚至蓬勃发展，正是因为它们与硬件本身交互，而不是与虚拟机或字节码格式交互。Delphi作为一种产品自然是为操作系统量身定做的，就像C/C++一样。但这是因为我们使用编程语言来创建应用程序。没有什么阻碍人们使用像freepascal这样的编译器，并从头开始编写一个操作系统。\n相比之下，C#、Java和Visual Basic是上下文相关的语言。它们纯粹存在于操作系统或运行时环境的上下文中。它们离不开这些，缺乏C和PASCAL给桌面带来的深度。跨越多个级别的深度，从最低级别一直到云和域驱动编程。\n看看Android，它是用Java编写的操作系统，对吗？嗯，那不是真的。Android操作系统依赖于本机引导，这是一段为Java应用程序建立运行时环境的代码。因此，当你启动Android手机、平板电脑或机顶盒时，首先要启动的是用普通C编写的加载机制，这反过来会挂载一个文件系统，并继续加载大量本地驱动程序。显示器、存储、wi-fi和最终组成SoC(片上系统)的所有硬件和组件的驱动程序。\n只有在这个漫长的过程之后，环境才有能力。\n..", "note_en": "EDIT:     Some 3 years after this satire post was published, a website called “.NetRocks” decided to make a number out of it. The satire clearly went over their heads, and the facts I outline in the post was met with ridicule. I’m a bit disappointed with .NetRocks, because this could have been a great opportunity for them to learn more about modern object-pascal development and it’s ecosystems. They seem genuinely baffled that Delphi and Object-Pascal in general was being used in 2016 (and 2019), and their behavior and response demonstrates the very arrogance and ignorance we have come to expect from “brogrammers” of their type.\n I must admit that I’m somewhat shocked that a massive show like .NetRocks is utterly ignorant of the fact that Object-Pascal as a language has millions of users around the world. You have compilers like Oxygene from RemObjects that targets .Net, Java, x86, ARM and WebAssembly. So their whole podcast on “how to port Delphi applications to C#” is absurd, because that’s not how you migrate code from Delphi to .Net. The Elements ecosystem, which covers C#, Pascal, Java, Swift and GoLang installs straight into Visual Studio and adds Object-Pascal to the environment. You can also convert source-code between Pascal and C# through automation. Manually going about such tasks is amateurish to say the least, but I honestly didn’t expect much when they open their podcast with verbal abuse.\n  Another point .NetRocks seem to have missed, is that Delphi has been aggressively optimized since Embarcadero took over from Borland. In 2016 Object Pascal ranked as #14 [2.164 score] on the Tiobi index over most popular programming languages [globally], just nine points below C#. So the most cost effective way of getting your legacy Delphi application modernized, is to just buy Elements from RemObjects, or upgrade your Delphi version to this century.\n If they had bothered to check they would also have learned that I manage some 16+ developer groups on social media, with roughly 50.000 developers in total. I have also worked for Embarcadero that makes Delphi, so my statements while whimsical and satirical, were based on facts. I work with Fortune 500 companies in the US, as well as large companies around Europe, that all rely on Object-Pascal for their daily operations. Heck, even the Walt Disney company wanted to get rid of .Net in favour of Object Pascal in 2018. Turns out JIT is a disaster when coding against hardware interrupts and “old school” automation. Who could have guessed? (that was satire btw).\n  On the whole, It’s alarming that the guys at .NetRocks seem clueless to the tools professional developers use for specialized work. Porting a Delphi codebase by hand its, well, amateurish at best. They might as well do a podcast on how to use ms-paint to create art, because Adobe Photoshop or Illustrator is not what people use (that was satire btw).\n I am also pleased however, because .NetRocks unwittingly demonstrated my point to perfection 🙂 Instead of learning more about Anders Hejlsberg’s journey and life before he joined Microsoft, how the .Net class hierarchy is heavily influenced by the Delphi VCL framework, or how the concepts that ended up as .Net were in fact prototyped and experimented with earlier — they jumped straight to ridicule. Of a satire post (lol!).\n You can   click here for my full reply. And seriously, how it’s possible to mistake this old post as anything but   heavy satire is beyond me. But I am thankful to .NetRocks for demonstrating my point. I could not have asked for a better example of arrogance and ignorance 🙂 Rock on!\n    Those that follow my blog or know me personally – also know that I don’t go out of my way to be confrontational or disrespectful. I try my best to follow the middle-path, to see positive in all things. But sometimes you face a level of stupid that begs a response. A verbal one. And this is one of those cases.\n Lately I see more and more Delphi developers getting into debates with C# developers, and they are confronted with an attitude and  belief-system that quite frankly is utter nonsense. It’s not based on history or facts but disputes rooted in childish “isms”. A mix of old habits and an unhealthy obsession with the notion that  new means better.\n   If that is the case then C/C++ should be utter shit, because C is 3 years older than Pascal.  Pascal was created to replace C and get away from (amongst other things) the absurd and time-consuming header file practice, not to mention the recursive hell that still occur when headers reference other headers and conditional symbols pile up.\n Do you know how curly brackets became popular? Jump into your nearest Tardis and set the destination to the mid 1960’s. Back when mainframes were the size of Portugal and 1024 bytes of memory was the bomb. You see, back then memory was sparse and pretty much all the languages (or toolkits) needed to save space. So the { } curly’s were used as tokens for words like “begin” and “end”. Why? Because one ascii byte is less than five ascii bytes. Every byte counts when you only have a few Kb of memory.\n Ps: when I use the word  toolkit here I really mean  a random soup of asm snippets on a loom. The bones collected to make C was actually a mix of homebrew toolkits made by different engineering teams at the time. And each of these toolkits had their own fanclub /slash/ legal representation; because all of them, miraculously, had invented the exact same thing at the same time before everyone else. These guys kept on fighting over who owned what well into the  Watcom era. It’s probably the longest standing demonstration of a grown-up tantrum since the  roman emperor caligula outlawed clothing.\n Fast forward to 1970 and the amount of memory on mainframes had already doubled a few times just like  Moore had predicted five years earlier. The C standard that Dennis Ritchie had painstakingly wrangled from the cold, greedy hands of grumpy old technicians was due for an upgrade. Tests were done by very dull, very serious men in grey clothing – and in their horror they discovered that human beings would interact with words and phrases faster than symbols and glyphs. So a word like “begin” would be picked up by the brain faster than {. It is just knockout stuff isn’t it.\n You cannot praise Anders as a genius architect and at the same time throw his life work in the thrash.  Perhaps you should ask yourself why Anders loved object pascal so much that he dedicated half his career making sure universities had access to it.\n  Enter  Niklaus Wirth, a man so clever and academic that he doesn’t catch exceptions; He is the exception. But next to his colleagues over at Berkley our dear Niklaus is the proverbial rock-star. He decided that in order to make programming more accessible for students, easier to learn and above all, establishing a standard for safer code, that they should take science to heart and include that in a programming language design. So he put on his gravest lab coat and began to implement “a better C” where he applied the research that words are picked up by the brain faster than tokens and symbols. Nine months later pascal was born, and to celebrate Niklaus used colored socks that day. A risky bit of business that could have cost him his seat at the  strangely brown sorority club, in which he was master of ceremonies. But hey, Nikolaus is a rebel and this was the swinging 70’s after all.\n My point? This is why pascal uses “begin” and “end” as opposed to { and }. It’s one of the many aspects of the Pascal language that makes it so easy to master.\n Whimsical satire aside:  with the knowledge that C is actually older than pascal, not to mention that it is identical in features, depth and complexity to Pascal– what is it going to be? Do you still cling to the notion that older have to be of less value than new? Or could it in fact be that  you haven’t really looked closer at object pascal to begin with? Have you even installed a modern version of Delphi and given it a worthy test drive? Or do you just speak out based on what you like and know, as opposed to what you don’t know and haven’t even tried.\n My 8-year-old daughter is like that. She makes up her mind about food before she has even tasted it. Surely a trained engineer can do better?\n And I say that because — if we follow your line of reasoning, C/C++ should be incapable of producing C#. How can something old and outdated possibly produce something new and exciting? You do know that C# is written in C and assembler right? And that Java and all the other high level languages out there didn’t spontaneously self assemble. They are all written in C, assembler or pascal.  And there is a reason for that.\n Just like nature have different levels, from particles to minerals, from minerals to bacteria, from bacteria to plants, from plants to insects (and so on) — so does a computer. Each of these levels have laws and principles that govern them, and no matter how much you want to introduce something from a higher level into a lower level – that’s just not how reality works.\n  The law is very simple: each level can only emit complexity upwards. So assembler is used to produce C and pascal, C and pascal is used to produce C++ and object pascal, C++ and object pascal is used to bring about  every other single piece of tech you take for granted.\n So when you criticize Delphi but use C#, you are just underlying that you dont really understand the difference between archetypical languages and context based languages.\n It’s like saying  Visual Basic 5 is cooler than assembler. You don’t debate with people like that, you just look at them with pity. I don’t know how many years a software engineering  degree is elsewhere, but if you just spent 3 years in college and 2 years at a university followed by one or two additional years getting your diploma – and this is the level of insight you graduate with then I pity you. And I pity your employer because sooner or later you will bring about the apocalypse.\n If we apply rational logical thought to the proposition at hand, we cannot but conclude that the notion of “new is always better” is false. It is to mistake marketing for facts and capitalism for science. The fundamental principles of computing wont change because you favour a high-level programming language. The C/C++ embedded market wont magically roll over, because C# is a mitigated disaster on embedded devices. And I speak from experience, not preference.\n Your teacher should have taught you this: “ In a computer, like nature, the past is always alive“. Look closely at your brand new PC or Mac: Bios, Vesa screen modes, non linear memory, hardware interrupt vectors and a cpu that supports no less than 3 instruction sets. You have layer on layer of increasing complexity (a.k.a “the past is still there”). Why not call up Linus Torvalds and ask him why he’s not using C# in his line of work; or NVidia why their GPU pipeline only ships with C headers and not C# classes. I sure as hell wouldn’t want to be on the receiving end of that call.\n The only C# compiler worth using, is actually RemObjects C# (the Elements compiler). Because unlike mono or ms’s compilers, Elements builds proper binaries on the same level as C/C++ and Pascal. You can actually write kernel modules with Elements if you like, something you cant do with Mono or Visual Studio. Heck, .net services still require a service host on Windows.\n   Actually, it’s not. What today is known as .net, from its CIL intermediate language right down to the global assembly cache  is pretty much Delphi with a new syntax parser on top. Yes you read that correctly  the entire .net product family  is practically Delphi refactored. The whole bytecode regime was one of the last skunkwork projects Anders worked on, and was actually described on Borland’s news-servers years before it magically re-appeared as Microsoft’s flagship product.\n Anders Hejlsberg created and prototyped these technologies (as did many other companies, since Java made bytecodes cool) while he was working at Borland. And indeed,  the father of C# and entire dot net stack is none other than the father of Delphi.\n At Borland (in the borland.language newsfeed I vividly remember) these technologies went mentioned under the codename “ portable Delphi”. I followed the thread on the news servers for quite some time. It was no secret that Borland was tinkering away on the next big thing, and I believe it was ultimately Borland’s response to Java. Because at the time Java had eaten quite a chunk of Borlands educational seat licenses. And had Anders continued working for Borland, Delphi and C++ builder would perhaps be bytecode based today.\n Factoid: The first project Anders was assigned to when he joined Microsoft, was J#. Microsoft’s attempt at hijacking the Java language. Microsoft lost the legal battle and was forced to pivot. The end result would be C#.\n So when you, the C# fanboy, propose that Delphi is somehow inferior to dot net, or that object pascal is outdated and technically behind C# you quite frankly have no clue what you are talking about. Is it generics? We have that. Is a rich and powerful RTTI? Got that covered. Anonymous procedures? Its there too. In fact, the whole misunderstanding here stems from the fact that C# developers generally think “Delphi 7” is what Delphi is all about. Which is the same that saying that .Net  is what came out in version 1. Who the hell uses Delphi 7 in our day and age.\n But just to make this crystal clear: Anders Hejlsberg is not just the father of C# and dot net:  he is also the father of Delphi. And before that he gave birth to  Turbo Pascal. In fact, Anders have 3 (if not four) Pascal development systems behind him before he came to Microsoft.\n  Borland, the company Anders worked for, was put out to pasture by Microsoft. Bill Gates launched a financial onslaught that few companies on the planet could have endured. The reason was that Microsoft really had the worst developer tools on the market (Visual Basic and Visual C++), while Borland represented the very best. So for a long time Borland utterly demolished Microsoft when it came to software development.\n When Borland later began to flirt with Linux ( Delphi Kylix) it must have made the R&amp;D department at Microsoft piss themselves. Delphi is responsible for thousands of desktop applications synonymous with Windows – and if Linux users got their hands on RAD tools like Delphi, with thousands of applications ready to be ported over? Do the math. You have to remember that this was before cloud computing. Microsoft didn’t have a fallback strategy and depended on desktop and server sales. Linux could do everything Windows could, but it lacked the desktop applications, the user friendliness and features Borland made simple.\n  What Microsoft did was, basically, to buy out Anders (they also picked up a huge part of Borlands R&amp;D department) from Borland and at the same time attack the company from every angle. Drowning them in bullshit lawsuits, patent claims and all the nasty, cowardly practices Microsoft was into back then (we all remember Netscape and how that went).\n Bill Gates called Anders up personally and gave him “ an offer I could not refuse“. Whatever that means.\n So to put this myth to bed and be done with it: C# as a language and dot net as a technology did not originate with Microsoft. It has Borland written all over it and its architecture is intimately joined at the hip with Delphi and C++ builder. Companies like Microsoft dont innovate any more, they buy competence and re-brands it as their own.\n  If that is not enough, take a long, hard look at how the .net framework is organized. Pay special attention to the features and methods of the base-classes and RTTI. What you are looking at is the VCL, the visual component library,  Delphi and C++ builder’s run time library.\n If you know Delphi and it’s RTL intimately as well as C#, you quickly recognize the architecture. The syntax might be different, but the organization and names are all too familiar.\n There was never any secret where this came from, but it’s not advertised either so I don’t blame people for not recognizing it. But when people start to behave nasty over what should be either a passionate hobby or a professional discipline, then truth must be told. The very foundation of the dot net framework is taken straight out of the VCL.\n And why shouldn’t it? The whole platform was whispered about under the codename “portable Delphi” to begin with, it was even designed by the same author – so why should it come as a surprise that it’s basically Delphi reincarnated with a different syntax parser? Either way a few bells should start ringing in your head – telling you that  you may have been wrong about Delphi and object pascal in general. Probably because you know very little about Delphi to begin with.\n So, what you perhaps believe sets C# apart from Delphi, what you imagine gives dot net an advantage over Delphi – is in reality the opposite: it  is Delphi. It originated in Delphi, was inspired by Delphi and flows straight from the inventor of Delphi himself.   Anders is responsible for two distinct object pascal development platforms prior to working for Microsoft. Take some time to reflect on that.\n You cannot praise Anders as a genius architect and at the same time throw his life work in the thrash.  Perhaps you should ask yourself why Anders loved object pascal so much that he dedicated half his career making sure universities had access to it.\n  The fact that C/C++ is alive and well today serves to prove my point: age has no meaning when dealing with fundamental technology. These languages embody the fundamental principles of computing. They don’t grow old because they represent a fundamental level that can never be replaced. There is now law that says C must be there, what persists is ultimately the features that C brings – spanning from assembly to the desktop. Those same features can be found only in one other language, namely Pascal.\n Things are the way they are for a reason. And programmers before you established standards that address things you might not have to deal with, but that’s because they dealt with it before you. Just because you don’t see the plumbing doesn’t mean it’s not there.\n These are the compilers responsible for the foundation on which all other languages, operating-systems, applications and services rest. Remove those, and the whole house of cards come crashing down.\n So C/C++ and object pascal continue to exist, thrive even, precisely because they interface with the hardware itself, not a virtual machine or bytecode format. Delphi as a product is naturally tailored for operating-systems, as is C/C++. But that is because we use programming languages to create applications. There is nothing in the way of someone using compilers like freepascal and writing an operative system from scratch.\n  By contrast, C#, Java and Visual Basic are  context dependent languages. They exist purely in context with an operative system or run-time environment. They can’t exist without these and lack the depth C and pascal brings to the table. The depth to span many levels, from the lowest all the way up to cloud and domain driven programming.\n Just look at Android, an operative system written in Java right? Well that’s not really true. The Android operative system depends on a native bootstrap, a piece of code that establishes the run-time environment for Java applications. So when you fire up your Android phone, tablet or set-top box, the first thing to boot is a loading mechanism written in vanilla C. This in turn mounts a filesystem and continues to loads in bunch of native drivers. Drivers for the display, storage, wi-fi and all the hardware components that ultimately make up your SoC (system on a chip).\n Its only after this long process that the environment is capable\n......", "posttime": "2020-05-27 13:21:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c#,程序,程序员,coders,delphi", "title": "为什么C#程序员应该闭嘴谈论Delphi", "title_en": "Why C# coders should shut up about Delphi", "transed": 1, "url": "https://jonlennartaasenden.wordpress.com/2016/10/18/why-c-coders-should-shut-up-about-delphi/", "via": "", "real_tags": ["c#", "程序", "程序员", "coders", "delphi"]}, {"category": "", "categoryclass": "", "imagename": "644b69a06d396206e83c669d54205d14.jpg", "infoid": 1003896, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "成群的沙漠蝗虫正在摧毁印度西部和中部的庄稼，促使当局加紧应对该国近30年来最严重的瘟疫。\n无人机、拖拉机和汽车已经被派去追踪这些贪婪的害虫，并向它们喷洒杀虫剂。蝗虫已经摧毁了近5万公顷(12.5万英亩)的农田。\n政府蝗虫预警组织副主任KL Gurjar告诉法新社，拉贾斯坦邦和中央邦的部分地区活跃着8到10只蝗虫，每个虫群的面积约为1平方公里(0.39平方英里)。\n预警中心说，自1993年以来，印度还没有出现过如此规模的蝗虫群。\n这些昆虫对这两个州的季节性作物造成了巨大的破坏，摧毁了许多已经在与冠状病毒严格封锁的影响作斗争的农民。\n在进入拉贾斯坦邦之前，他们在4月份摧毁了邻国巴基斯坦农业腹地的收成。\n根据联合国粮农组织的数据，一群4000万蝗虫可以吃掉相当于3.5万人或6头大象的食物。\n拉贾斯坦邦首府斋浦尔的居民区被昆虫淹没，困惑的当地人敲打锅碗瓢盆，试图驱赶昆虫。\n蝗虫破坏了拉贾斯坦邦靠近巴基斯坦边境的一些地区的农作物，但这种昆虫很少会进一步进入该邦。\n专家警告说，情况可能会恶化，预计6月份将有更多人从非洲之角经由巴基斯坦抵达印度。\n根据联合国的数据，去年年初，暴雨和龙卷风使阿拉伯半岛史无前例的繁殖和蝗虫数量的快速增长成为可能。\n蝗虫破坏了拉贾斯坦邦靠近巴基斯坦边境的一些地区的农作物，但这种昆虫很少会进一步进入该邦。", "note_en": "Huge swarms of desert locusts are destroying crops across western and central India, prompting authorities to step up their response to the country&#39;s worst plague in nearly three decades.\n  Drones, tractors and cars have been sent out to track the voracious pests and spray them with pesticides. The locusts  have already destroyed nearly 50,000 hectares (125,000 acres) of cropland.\n          &#34;Eight to 10 swarms, each measuring around a  square kilometre (0.39sq miles) are active in parts of Rajasthan and Madhya Pradesh [states],&#34; the government&#39;s Locust Warning Organisation&#39;s deputy director KL Gurjar told the AFP news agency.\n  India has not seen locust swarms on this scale since 1993, the warning centre said.\n  The insects have caused enormous damage to the seasonal crops in both the states, devastating many farmers already struggling with the impact of a strict coronavirus lockdown.\n  They destroyed harvests in the agricultural heartlands of neighbouring Pakistan in April, before entering Rajasthan.\n      A swarm of 40 million locusts can eat as much food as 35,000 people, or six elephants, according to the United Nation&#39;s Food and Agriculture Organisation.\n  Residential areas in Rajasthan state&#39;s capital Jaipur were overwhelmed by the insects as bewildered locals banged on pots and pans to try and ward off the insects.\n     Locusts destroy crops in some parts of Rajasthan close to the border with Pakistan most years, but it is rare for the insects to move further into the state.\n  Experts warn the situation could worsen with more expected to reach India via Pakistan from the Horn of Africa in June.\n  Heavy rains and cyclones enabled unprecedented breeding and the rapid growth of locust populations on the Arabian Peninsula early last year, according to the UN.\n  Locusts destroy crops in some parts of Rajasthan close to the border with Pakistan most years, but it is rare for the insects to move further into the state.", "posttime": "2020-05-27 12:48:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "袭击,locust,蝗虫", "title": "印度面临“27年来最严重的蝗虫袭击”，农作物被毁", "title_en": "Crops destroyed as India faces 'worst locust attack in 27 years'", "transed": 1, "url": "https://www.aljazeera.com/news/2020/05/crops-destroyed-india-faces-worst-locust-attack-27-years-200526160727430.html", "via": "", "real_tags": ["袭击", "locust", "蝗虫"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003895, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然我们都想让事情恢复正常，但科学并不能让这成为可能。7月和8月似乎还很遥远，但即使在最好的情况下，新冠肺炎危机也不可能到那时结束。我们原计划等到6月份再做最后决定，但很明显，计划一次面对面的会议根本不是负责任的做法。没有什么比我们与会者的健康和安全更重要的了。是的，这对我们来说将是财务上的一记重击。但我们愿意接受这一点，因为仅仅把你们中的任何一个人置于危险境地的可能性都是不合情理的。\n我们想要弄清楚一个重要的点。除了对不能在我们期待已久的新会场举办这一历史性活动明显感到失望之外，我们希望每个人都能从这次活动中走出来，而不是对此感到不满。稍后再讲。\n我们没有取消希望。相反，我们正在改变今年的希望。\nHOPE 2020现在将是一个为期9天的活动，从7月25日(星期六)开始，一直持续到2020年8月2日(星期日)。为什么我们要加一整周呢？因为我们希望从这件事中得到一些好处，我们相信我们的社区有能力做到这一点。我们都知道我们在没有实体会议的情况下赢得了什么，但现在让我们把重点放在我们可以通过一些想象力和合作来拥有什么。这就是黑客社区的全部意义所在。\n我们打算举行与往常相同的会谈次数，但要分散到更长的时间，并可在高容量的视频流中观看。购买门票的人将拥有与演讲者的独家访问权限，因此您可以提问、参加研讨会并与其他与会者互动。此外，你还将收到一件会议T恤和徽章，这是任何人都不能获得的。\n我们计划有9位主旨演讲者，同样为我们的与会者提供独家问答权限。\n参加希望活动将不再受到签证和某些有争议的类型逮捕的担忧的约束。因此，期待一个充满活力和多样化的角色阵容。没有它就不是希望，但现在我们真的可以消除一些障碍了。\n除了正在进行的讲座和小组讨论外，我们还将在为期九天的活动期间举办研讨会。期待一切，从开锁到焊接指导，再到我们臭名昭著的业余无线电考试。\n在通宵时间里，我们计划举办音乐会、DJ和其他有趣的活动。希望仍然是一项24小时的活动，但要持续九天！\n所有这一切一直是-并将继续是-一项艰巨的任务。新冠肺炎疫情对我们所有人都产生了不同程度的影响。2600的持续生存很快就受到了质疑，因为我们的分销商不再付钱给我们，里面有我们的问题的书店关闭了，新的问题留在了装卸区。根据最新统计，我们已经损失了半年多的收入，为了继续生存，我们不得不停止领工资。让今年的希望取得成功是我们度过难关的唯一途径。\n如上所述，我们不希望任何人因此而感到格外不开心。如果您要退款，我们可以给您退款。但是，考虑到我们已经遭受的所有损失，如果我们不得不发行很多这样的债券，我们将无法继续生存。这就是为什么尽管发生了这么多事情，我们还是希望能把尽可能好的活动放在一起，让它成为我们夏天的亮点。\n我们正在接受已经提交的谈话和研讨会提案。我们将提供技术支持，以便演讲者能够顺利参与虚拟环境。我们现在正在开放提交过程，以包括来自全球各地的更多参与者，这是我们以前从未真正有能力做到的。我们希望有来自真正的国际社会的演讲、研讨会和音乐表演，不再受实体存在的束缚。\n虽然我们已经有一个专门的志愿者团队正在努力实现这一点，但我们肯定可以使用更多的志愿者，特别是随着活动的临近和规模的扩大。请发送电子邮件至volilents@Hope.net，让我们知道您认为您可以提供哪些帮助。我们正在寻找有经验的人设置和生产在线直播。我们还在寻找主持人，在线论坛的版主，以及履行其他幕后角色的人。\n如果我们度过这一切，我们完全打算在2021年抱有一个实际的希望(这是自1997年以来的第一个奇数年的希望)。这也将使我们能够在书店重新开张后继续出版。所有这一切都有赖于我们的黑客精神，帮助我们度过了我们所能想象到的最艰难的时期。如果你们和我们一样热衷于这个新的希望化身将意味着什么，那么这个夏天确实是一个值得期待的夏天。", "note_en": "While we all want things to go back to normal, the science just doesn&#39;t make that possible. July and August may still seem far away, but there simply is no way the COVID-19 crisis will be over by then, even in the best-case scenario. We had planned on waiting until June to make a final decision, but it&#39;s become clear that planning an in-person conference simply wouldn&#39;t be the responsible thing to do. Nothing matters more than the health and safety of our attendees. Yes, this will be a financial kick in the teeth for us. But it&#39;s one we&#39;ll willingly take as the mere possibility of putting any of you at risk is unconscionable.\n We want to be clear on one important point. Apart from the obvious disappointment of not being able to host this historic event at a new venue we were so looking forward to, we want everyone to come out of this not feeling dissatisfaction beyond that. More on that later.\n  We are NOT canceling HOPE. Instead, we are changing what this year&#39;s HOPE will be.\n HOPE 2020 will now be a NINE DAY EVENT, beginning on Saturday, July 25th and running until Sunday, August 2nd, 2020. Why did we add an entire week? Because we want some good to come out of this and we believe our community is in a position to do just that. We all know what we WON&#39;T have without a physical conference, but let&#39;s now focus on what we CAN have with some imagination and collaboration. That&#39;s what the hacker community is all about.\n We intend to have around the same number of talks as we normally do, but spread out over a much longer period and available for viewing on a high capacity stream. Those of you who bought tickets will have exclusive access to the presenters so you can ask questions, participate in workshops, and interact with other conference attendees. In addition, you will also receive a conference t-shirt and badge that won&#39;t ever be made available to anyone else.\n We plan on having NINE keynote speakers, again with exclusive Q&amp;A access for our attendees.\n Participation in HOPE will no longer be bound by visas and worries of arrest by certain controversial types. So expect a dynamic and varied cast of characters. It wouldn&#39;t be HOPE without that, but now we can REALLY remove some barriers.\n In addition to ongoing talks and panels, we&#39;ll also have workshops for the duration of the nine day event. Expect everything from lockpicking to soldering instruction to our infamous ham radio exams.\n For the overnight hours, we&#39;re planning on having concerts, DJs, and other fun stuff. HOPE will remain a 24 hour event, but for nine days!\n All of this has been - and will continue to be - a daunting task. The COVID-19 pandemic has affected all of us in varying ways. The continued survival of 2600 was quickly put into doubt as our distributors stopped paying us, bookstores with our issues in them shut down, and new issues were left in loading zones. We&#39;ve lost more than half a year&#39;s income at last count and have had to stop getting paid in order to continue to survive. Making this year&#39;s HOPE a success is really the only way we can come through this.\n As mentioned above, we don&#39;t want anyone to feel extra unhappy because of this. If you want a refund, we will give you one. But with all of the losses we&#39;ve already suffered, we won&#39;t be able to continue existing if we have to issue very many of those. That&#39;s why we&#39;re hoping we can put together the best event possible and make this the highlight of our summer despite all that&#39;s happened.\n We are in the process of accepting talk and workshop proposals that have already been submitted. We will be providing technical support so that presenters will be able to participate smoothly in a virtual environment. We are now opening up the submission process to include many more participants from all around the globe, something we never really had the ability to do before. We hope to have talks, workshops, and musical presentations from a truly international community, no longer bound by a physical presence.\n While we have a dedicated team of volunteers already working on making this happen, we can definitely use many more, especially as the event draws closer and becomes bigger. Email  volunteers@hope.net and let us know how you think you can help. We&#39;re looking for people with experience setting up and producing live online broadcasts. We are also looking for emcees, moderators for online forums, and people to fulfill other behind-the-scenes roles.\n If we get through all of this, we fully intend to hold a physical HOPE in 2021 (the first odd-year HOPE since 1997). This will also enable us to continue publishing once bookstores start opening again. All of this depends on our hacker spirit getting us through the toughest times we ever could have imagined. And if you share our enthusiasm over what this new incarnation of HOPE will mean, this summer will indeed be one to look forward to.", "posttime": "2020-05-27 12:48:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,杂志,magazine,希望", "title": "2600杂志：希望2020更新", "title_en": "2600 Magazine: Hope 2020 Update", "transed": 1, "url": "https://www.2600.com/content/hope-2020-update", "via": "", "real_tags": ["2020", "杂志", "magazine", "希望"]}, {"category": "", "categoryclass": "", "imagename": "66f0d7033c4b59f21d84a498959ec815.jpg", "infoid": 1003892, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大约6600万年前，一颗小行星撞上了现代墨西哥东海岸的地球，导致地球上多达四分之三的动植物物种灭绝-包括恐龙。现在，一组配备了超级计算机的研究人员成功地模拟了整个事件，揭示了撞击导致生命大规模灭绝的原因。\n这些模拟是由伦敦帝国理工学院的科学家使用惠普企业公司提供的高性能计算(HPC)设备进行的。这项研究的重点是建立尽可能精确的撞击角度和轨迹，这反过来可以帮助准确地确定小行星的撞击如何影响周围环境。\n考虑了不同的撞击角度和速度，并将每个角度和速度的3D模拟输入超级计算机。然后将这些模拟与在撞击发生的墨西哥尤卡坦半岛110英里宽的希克苏鲁布陨石坑中观察到的地球物理特征进行了比较。\n与奇克苏鲁布陨石坑结构最一致的模拟结果显示，撞击角约为60度。这样一次撞击的威力相当于100亿颗广岛原子弹，而这个特殊的角度意味着岩石和沉积物几乎对称地被抛出。\n反过来，这又导致了更多的气候变化气体被释放，其中包括数十亿吨阻挡太阳的硫磺。剩下的就是历史了：大火、飓风、海啸和地震撼动了地球，大多数物种从地球表面消失了。\n研究论文称，最初认为小行星以90度角撞击希克苏鲁布，但不太可能发生近乎垂直的撞击。然而，对于恐龙来说，直接撞击可能是一种更好的情况：科学家们现在诊断出的角度构成了撞击致命性的最坏情况，他们写道，因为它最大限度地增加了岩石的喷射，从而产生了气体。\n研究人员在得出结论之前进行了近300次3D模拟，结果由位于莱斯特大学的HPE Apollo 6000 Gen10超级计算机处理。这个14000核的系统由英特尔的Skylake芯片驱动，由一台6TB的服务器支持，以适应大规模的内存计算。\n阿波罗6000被部署到这所大学，作为一项名为DIRAC(使用先进计算的分布式研究)的倡议的一部分，该倡议为科学技术研究中的模拟和大规模数据分析提供高性能计算。\n来自莱斯特大学的狄拉克导演马克·威尔金森(Mark Wilkinson)说：当你研究像陨石坑形成这样的复杂问题时，一个关键的挑战是你必须考虑的变量的数量。\n到目前为止，DiRAC已经为这个项目提供了大约200万小时的核心计算时间，很高兴看到他们已经有了如此令人兴奋的新发现。\n由于计算的限制，以前对小行星撞击的大多数模拟都被限制在两个维度上--这只允许研究正面撞击。使用HPE的超级计算机，该团队能够更容易地运行倾斜撞击的3D模拟，尽管这项任务对计算的要求要高得多。\n虽然事件的一些3D模拟确实已经存在，但它们仅限于撞击后的前几秒钟。这样的模型关注的是希克苏鲁布陨石坑在撞击后的瞬间是如何增长的，以及气体和尘埃的瞬间喷发。然而，狄拉克的高性能计算设施让研究小组对撞击过程有了更全面的了解，从小行星撞击地面的那一刻起，一直到最终陨石坑的形成。\n该模型展示了陨石坑底部是如何被抬升的，几分钟后突然坍塌，并为该遗址的创建提供了新的见解。峰环是陨石坑中心的一圈山脉。\n奇克苏鲁布陨石坑是地球上唯一保存完好的峰环陨石坑，但在其他行星和卫星上观察到类似类型的撞击是很常见的。因此，研究小组的发现，以及在阿波罗6000上进行更多模拟的能力，可能会为更好地了解其他行星表面铺平道路。\n狄拉克向英国各机构部署高性能计算服务，以推进天体物理、粒子物理、宇宙学和核物理方面的研究。从模拟引力波到行星形成，该组织提供的超级计算机帮助研究团队处理大量数据。\n例如，莱斯特大学(University Of Leicester)的阿波罗6000(Apollo 6000)目前也在帮助一组科学家了解气云中的数十亿粒子是如何从气体变成恒星的。", "note_en": "Some 66 million years ago, an asteroid hit the Earth on the eastern coast of modern Mexico, resulting in up to three quarters of plant and animal species living on the planet going extinct -- including the dinosaurs. Now, a team of researchers equipped with a supercomputer have managed to simulate the entire event, shedding light on the reasons that the impact led to a mass extinction of life.\n The simulations were carried out by scientists at Imperial College in London, using high performance computing (HPC) facilities provided by Hewlett Packard Enterprise. The research focused on establishing as precise an impact angle and trajectory as possible, which in turn can help determine precisely how the asteroid&#39;s hit affected the surrounding environment.\n    Various impact angles and speeds were considered, and 3D simulations for each were fed into the supercomputer. These simulations were then compared with the geophysical features that have been observed in the 110-mile wide Chicxulub crater, located in Mexico&#39;s Yucatán Peninsula, where the impact happened.\n The simulations that turned out to be the most consistent with the structure of the Chicxulub crater  showed an impact angle of about 60 degrees. Such a strike had the strength of about ten billion Hiroshima bombs, and this particular angle meant that rocks and sediments were ejected almost symmetrically.\n This, in turn, caused a greater amount of climate-changing gases to be released, including billions of tonnes of sulphur that blocked the sun. The rest is history: firestorms, hurricanes, tsunamis and earthquakes rocked the planet, and most species disappeared from the surface of the Earth.\n    It was originally thought that the asteroid hit Chicxulub at a 90-degree angle – but  near-vertical impact is &#34;unlikely&#34;, says the research paper. And yet a straight-down hit would have been a preferable scenario for dinosaurs: the angle now diagnosed by the scientists constituted &#34;the worse-case scenario for the lethality of the impact&#34;, they wrote, because it maximized the ejection of rock and therefore, the production of gases.\n The researchers carried out almost 300 3D simulations before they were able to reach their conclusions, which was processed by the HPE Apollo 6000 Gen10 supercomputer located at the University of Leicester. The 14,000-cores system, powered by Intel&#39;s Skylake chips, is supported by a 6TB server to accommodate large, in-memory calculations.\n   The Apollo 6000 was deployed to the university as part of an initiative dubbed DiRAC (Distributed Research using Advanced Computing), which provides high-performance computing for simulation and large-scale data analytics in science and technology research.\n DiRAC director Mark Wilkinson, from the University of Leicester, said: &#34;When you study a complex problem such as crater formation, a key challenge is the number of variables you have to consider.&#34;\n &#34;To date, DiRAC has provided about two million core hours of computing time to this project and it&#39;s great to see that they have already made such exciting new discoveries.&#34;\n Most previous simulations of the asteroid&#39;s hit have been restricted to two dimensions due to computational limitations – which only allows head-on impacts to be studied. Using HPE&#39;s supercomputer, the team was able to run 3D simulations for oblique impacts much more easily, even though the task is far more computationally demanding.\n While some 3D simulations of the event do already exist, they are limited to the first few seconds after the impact. Such models focus on how the Chicxulub crater grew in the immediate aftermath of the hit, and on the instantaneous expulsion of gas and dust. DiRAC&#39;s high-performing computing facilities, however, let the team draw a more complete picture of the impact, from the moment the asteroid hit the ground all the way until the final crater was formed.\n The model shows how the crater floor was uplifted before suddenly collapsing a few minutes later, and gives new insights into the creation of the site&#39;s &#34;peak ring&#34; – the circle of mountains in the center of the crater.\n The Chicxulub crater is the only well-preserved peak-ring crater on Earth, but it is common to observe similar types of impact on other planets and moons. The team&#39;s findings, along with the ability to run more simulations on the Apollo 6000, might therefore pave the way for a better understanding of other planetary surfaces.\n DiRAC deploys HPC services to various UK institutions to advance research in astrophysics, particle physics, cosmology and nuclear physics. From simulating gravitational waves to planet formation, the supercomputers that the organization provides help research teams handle great volumes of data.\n The University of Leicester&#39;s Apollo 6000, for example, is currently also helping a team of scientists understand how the billions of particles in a cloud of gas can turn from gas into stars.", "posttime": "2020-05-27 11:31:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "模拟,simulates,撞击", "title": "超级计算机模拟小行星毁灭恐龙的影响", "title_en": "Supercomputer Simulates the Impact of the Asteroid That Wiped Out Dinosaurs", "transed": 1, "url": "https://www.zdnet.com/article/supercomputer-simulates-the-impact-of-the-asteroid-that-wiped-out-dinosaurs/", "via": "", "real_tags": ["模拟", "simulates", "撞击"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003891, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "6600万年前，一块珠穆朗玛峰大小的岩石撞击了我们的星球，喷出的云层遮蔽了太阳，杀死了地球上的大多数生物。\n但科学家说，这可能是非常不同的--因为岩石以“最致命的角度”撞击地球。\n火山口喷发出的燃烧的云层烧毁了数百英里内的一切，并引发了“核冬天”，导致恐龙灭绝。\n但是，根据撞击的首次3D计算机模拟，如果末日小行星的接近更浅或更陡，就会有另一种结果。\n伦敦帝国理工学院的主要作者加雷斯·柯林斯博士说：“对于恐龙来说，最坏的情况就是所发生的事情。”\n撞击留下了一个1200英里宽的陨石坑，蒸发了岩石，并将数十亿吨的硫和二氧化碳送入史前的天空。\n气温骤降，酸雨下降，75%的生命被消灭，包括恐龙。\n柯林斯说：“小行星撞击向大气释放了数量惊人的气候变化气体，引发了一连串事件，导致恐龙灭绝。\n“这可能是因为它击中了一个最致命的角度，这一事实可能会使情况变得更糟。我们的模拟提供了令人信服的证据，小行星以陡峭的角度撞击-可能在地平线上方60度-并从东北方向接近目标。\n“我们知道，这是撞击致命性最糟糕的情况之一，因为它将更多的危险碎片放入高层大气，并将其散落各地--正是这种情况导致了核冬天。”\n柯林斯和他的同事们使用了一个模型，该模型考虑了四个不同的角度-90度、60度、45度和30度。\n他们使用现场的地球物理数据再现了整个事件，从最初的撞击到6600万年前被称为希克苏鲁布的陨石坑形成的那一刻。\n这包括一次近海钻探探险的最新结果，该探险发现了含有极端力量证据的岩石。\n诊断撞击角度和方向的关键是陨石坑的中心与“峰环”(边缘内的一圈严重破碎的山脉)和20英里地下的地幔岩石之间的关系。\n德国弗莱堡大学的合著者Auriol Rae博士说：“尽管被埋在近一公里(0.62英里)的沉积岩下，但值得注意的是，地球物理数据揭示了这么多关于陨石坑结构的信息-足以描述撞击的方向和角度。”", "note_en": "A Mount Everest-sized rock smashed into our planet 66 million years ago, sending up clouds  that blotted out the sun and killed most creatures on Earth.\n But it could have been very different, scientists say – as the rock hit Earth at the “deadliest possible angle”.\n The burning cloud that erupted from the crater incinerated everything within hundreds of miles and triggered a “nuclear winter” that  wiped out the dinosaurs.\n But if the doomsday asteroid’s approach had been shallower or steeper, there would have been another outcome, according to the first 3D computer simulation of the impact.\n  Lead author Dr Gareth Collins, of Imperial College London, said: “For the dinosaurs, the worst-case scenario is exactly what happened.”\n The impact left a 1200-mile-wide crater, vaporising rock and sending billions of tons of sulphur and carbon dioxide into the prehistoric skies.\n  Temperatures plunged, acid rain fell and 75 percent of life was wiped out, including the dinosaurs.\n Collins said: “The asteroid strike unleashed an incredible amount of climate-changing gases into the atmosphere – triggering a chain of events that led to the extinction of the dinosaurs.\n “This was likely worsened by the fact it struck at one of the deadliest possible angles. Our simulations provide compelling evidence the asteroid struck at a steep angle – perhaps 60 degrees above the horizon – and approached its target from the north-east.\n  “We know this was among the worst-case scenarios for the lethality on impact because it put more hazardous debris into the upper atmosphere and scattered it everywhere – the very thing that led to a nuclear winter.”\n Collins and his colleagues used a model that considered four different angles – 90, 60, 45 and 30 degrees.\n They used geophysical data from the site to reproduce the whole event, from the initial impact to the moment the crater, called Chicxulub, was created 66 million years ago.\n   This included recent results from an offshore drilling expedition that brought up rocks containing evidence of the extreme forces that were generated.\n Pivotal to diagnosing the angle and direction of impact was the relationship between the centres of the crater and the “peak ring” – a circle of heavily-fractured mountains inside the rim – and mantle rocks 20 miles underground.\n  Co-author Dr Auriol Rae, of the University of Freiburg in Germany, said: “Despite being buried beneath nearly a kilometre (0.62 mile) of sedimentary rocks, it is remarkable geophysical data reveals so much about the crater structure – enough to describe the direction and angle of the impact.”", "posttime": "2020-05-27 11:30:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "恐龙,killed,撞击", "title": "杀死恐龙的小行星“以最致命的角度撞击地球”", "title_en": "Asteroid that killed dinosaurs 'hit Earth at deadliest possible angle'", "transed": 1, "url": "https://www.yahoo.com/news/asteroid-dinosaurs-angle-183118607.html", "via": "", "real_tags": ["恐龙", "killed", "撞击"]}, {"category": "", "categoryclass": "", "imagename": "ddc166edf6e7ee4efd8b774883673d52.png", "infoid": 1003890, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "文件夹是一种将程序编码到目录结构中的语言。其中的所有文件都会被忽略，文件夹的名称也会被忽略。命令和表达式由文件夹内的文件夹模式编码。文件夹编译器的源代码可以在GitHub上找到。\n就像编程语言本身(它们只是规则列表)一样，文件夹语言也是非物质化的。操作系统中等同于内容的文件消失了，只留下文件夹和结构元素。\n文件夹是一种Windows语言。在Windows中，文件夹在磁盘空间方面是完全空闲的！为了证明，比如创建352,449个文件夹并获取其属性。\n每个命令文件夹至少有一个子文件夹。第一个文件夹中的子文件夹数量(按字母顺序)指示命令的类型；任何参数都在第二个文件夹中指示；某些命令需要第三个文件夹。\n在上面的程序中，只有一个命令(Print)，它的参数是一个字符串。字符串包含&#34；Hello，World！&#34；。\n文件夹OS文件夹解释器不会创建临时文件；任何没有立即保存在内存中的内容都会作为一组临时文件夹存储在%APPDATA%目录中。文件夹的首选I/O是另一组文件夹。这意味着您可以对文件夹中的所有数据进行编码，完全绕过文件的物质领域。\n来自多个文件夹程序的临时文件夹。\n第二个子文件夹保存值的类型(例如，一个字符串有两个文件夹，第三个子文件夹保存值", "note_en": "Folders is a language where the program is encoded into a directory structure. All\r files within are ignored, as are the names of the folders. Commands and expressions are\r encoded by the pattern of folders within folders. Source code for the Folders compiler\r  can be found on github.\n    Like programming languages\r themselves (which are only lists of rules), the Folders language is dematerialized.\r Files, the equivalent of &#34;content&#34;\r within an operating system are gone, leaving only folders, structural elements.\n  Folders is a Windows language. In Windows, folders are entirely free in terms of disk space!\r For proof, create say 352,449 folders and get properties on it.\n       Each command folder has at least one child folder. The number of subfolders in the first\r folder (alphabetically) indicates the type of command; any arguments are indicated in a\r second folder; some commands require a third folder.\n  In the program above, there is a single command (print), with its argument\r a string. The string holds &#34;Hello, World!&#34;.\n  Folders OS \r The Folders interpreter does not create temp files; anything not held\r immediately in memory is stored as a set of temp folders\r in the %appdata% directory. The prefered I/O of\r Folders is another set of folders. This means you can encode all your data in\r folders, bypassing the material realm of files entirely.\n     Temp folders from several Folders programs\n  Second sub-folder holds the type of the value (eg two folders for a string, third holds the value", "posttime": "2020-05-27 11:30:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,层次结构,folders,文件夹", "title": "文件夹：一种将程序编码为文件夹层次结构的语言", "title_en": "Folders : a language where programs are encoded as hierarchies of folders", "transed": 1, "url": "http://danieltemkin.com/Esolangs/Folders/", "via": "", "real_tags": ["程序", "层次结构", "folders", "文件夹"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003885, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科学家们说，玻璃蛙为什么有透明皮肤的谜团已经解开：这种不同寻常的特征是一种伪装。\n玻璃蛙产于热带的中美洲和南美洲，它们的名字来源于它们的皮肤。\n然而，青蛙并不是真正的透明，而是半透明的，它们背部的皮肤通常是鲜艳的绿色，它们的肠道和心脏通过腹部可以看到。这就引出了一个让科学家们手忙脚乱的问题。\n“如果捕食者不能直视青蛙，为什么玻璃蛙的皮肤是透明的，而不是其他树蛙的不透明伪装图案呢？”加拿大麦克马斯特大学博士后研究员詹姆斯·巴内特博士说，他是这项研究的合著者。\n巴内特和他的同事们说，他们已经破解了这个难题。巴尼特说：“青蛙总是绿色的，通常与树叶相匹配，但树叶的亮度会有所不同。”研究小组说，尽管青蛙身体的颜色与深色或浅色的树叶相比变化不大，但腿部更加透明，因此亮度发生了变化，这有助于两栖动物融入其中。\n巴尼特说：“通过拥有半透明的腿并让腿围绕身体休息，青蛙的边缘从树叶到腿，再从腿到身体，都变成了更柔和、对比度更小的梯度。”他指出，这使得青蛙的轮廓对捕食者来说更难辨认。\n巴内特和他的同事在美国“国家科学院院刊”上发表文章，报告了他们是如何进行三个实验的。\n首先，他们在树叶和白色背景上拍摄了55只玻璃青蛙，然后使用计算机模型比较了每种情况下青蛙的颜色。巴尼特说：“我们发现青蛙身体的颜色在不同的背景下没有太大的变化，但腿确实有很大的变化。”他补充说，这种变化是由于亮度的变化，而不是色调的变化。\n当他们模拟不同物种(包括蛇、鸟和人)对这些青蛙的看法时，结果是相同的。巴尼特说：“在人类和青蛙的天敌之间，伪装效应的解释是相似的。”\n然后，研究小组制作了玻璃青蛙的计算机生成图像，在树叶背景的衬托下，玻璃青蛙具有不同的半透明图案。研究人员向20个人每人展示了125张这样的图片，并要求他们尽快指出青蛙。研究小组发现，与自然模式为半透明的青蛙相比，当青蛙完全不透明时，参与者更快地发现青蛙。\n最后，研究小组用明胶制作了180只半透明和180只不透明的青蛙，并将它们放入厄瓜多尔的植被中，在72小时的过程中监测青蛙是否受到鸟类的攻击。在实验过程中，总共吃掉了53只不透明青蛙和24只半透明青蛙。\n巴尼特说：“我们的研究表明，半透明确实有助于玻璃蛙伪装自己不受捕食者的伤害，但与完全透明的物种相比，它们的伪装方式并不一定像预期的那样。”\n墨尔本大学的动物颜色和行为专家德维·斯图尔特-福克斯教授没有参与这项研究，他说：“这是一项有趣的研究，因为它展示了动物的另一种伪装形式--自然界中伪装策略的绝对多样性真的很了不起。”\n斯图尔特-福克斯说，所有三个实验都有局限性，但综合起来，证据令人信服地表明，青蛙的半透明是一种伪装形式。\n她说：“有趣的是，腿部比身体更透明，这使得身体的边缘更难区分。”“捕食者会对猎物的形状形成搜索图像，因此遮盖身体轮廓是增强伪装的非常有效的策略。”", "note_en": "The mystery of why glass frogs have see-through skin has been solved, scientists say: the unusual feature is a type of camouflage.\n Glass frogs are found in tropical Central and South America, and get their name from their skin.\n However, the frogs are not truly transparent but translucent, with the skin on their backs typically a vivid green and their intestines and heart visible through their underbelly. This has led to a question that has kept scientists on the hop.\n “If predators cannot see straight though the frogs, why do glass frogs have transparent skin at all, and not the opaque camouflaged patterns of other tree frog species?” said Dr James Barnett, a postdoctoral researcher at McMaster University, Canada, who co-authored the study.\n Barnett and colleagues say they have cracked the conundrum. “The frog is always green to generally match leaves, but leaves will differ in their brightness,” said Barnett. The team say that while the colour of the frog’s body changes little against dark or light foliage, the legs are more translucent and hence shift in brightness, helping the amphibians to blend in.\n “By having translucent legs and resting with the legs surrounding the body, the frog’s edge is transformed into a softer, less contrasting gradient from the leaf to the legs, and again from the legs to the body,” said Barnett, noting that this makes the frog’s outline less recognisable to predators.\n Writing in the US journal Proceedings of the National Academy of Sciences, Barnett and colleagues report how they carried out three experiments.\n In the first, they photographed 55 glass frogs both on leaves and on a white background and then used computer models to compare the colour of the frog in each scenario. “We found that the colour of the frogs’ bodies did not change much between backgrounds, but the legs did change significantly,” said Barnett, adding that the change was down to a shift in brightness, not hue.\n The results were the same when they modelled how different species may see these frogs, including a snake, a bird and a human. “The camouflaging effect is interpreted in a similar manner between humans and the frogs’ natural predators,” said Barnett.\n The team then produced computer-generated images of glass frogs with different patterns of translucency against leafy backgrounds. Twenty people were each presented with 125 such images and asked to point out the frog as quickly as possible. The team found participants were quicker to spot the frog when it was fully opaque compared with frogs with a natural pattern of translucency.\n Finally, the team made 180 translucent and 180 opaque frogs out of gelatine and put them in vegetation in Ecuador, monitoring over the course of 72 hours whether the frogs were attacked by birds. Overall, 53 opaque and 24 translucent frogs were eaten during the experiment.\n “Our study shows that being translucent does help glass frogs camouflage themselves from predators, but not necessarily in the way expected by comparison to fully transparent species,” said Barnett.\n Prof Devi Stuart-Fox, an expert on animalcolour and behaviour at the University of Melbourne, who was not involved in the research, said: “This is a fascinating study because it shows yet another form of camouflage in animal – the sheer diversity of camouflage strategies in nature is truly remarkable.”\n Stuart-Fox said all three of the experiments had limitations, but taken together the evidence was compelling that the frogs’ translucency is a form of camouflage.\n “Interestingly, the legs are more translucent than the body, making the edges of the body harder to distinguish,” she said. “Predators form a search image for the shape of their prey, so masking the body’s outline is a very effective strategy to enhance camouflage.”", "posttime": "2020-05-27 10:12:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "皮肤,frogs,青蛙", "title": "玻璃蛙为什么有透明皮肤在研究中变得清晰", "title_en": "Why Glass Frogs Have See-Through Skin Becomes Clear In Study", "transed": 1, "url": "https://www.theguardian.com/science/2020/may/25/why-glass-frogs-have-see-through-skin-becomes-clear-study-legs-translucent", "via": "", "real_tags": ["皮肤", "frogs", "青蛙"]}, {"category": "", "categoryclass": "", "imagename": "4e1d003d1026b88bd89ccc95e3b5748a.jpg", "infoid": 1003883, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌定期检查网站是否有有害和恶意内容，以帮助人们避免陷入危险境地。\n这项安全的浏览服务被Chrome和Firefox等流行浏览器使用。当网站被标记时，他们会在人们试图访问危险网站之前发出警告。\n这也是目前YTS.mx正在发生的事情，它是周围最受欢迎的Torrent网站之一。虽然该网站的主页可以很好地访问，但导航到Torrent详细信息页面会在Chrome中弹出以下警告。\n“前方有欺骗性的地点。yts.mx上的攻击者可能会诱骗您做一些危险的事情，如安装软件或泄露您的个人信息(例如，密码、电话号码或信用卡)。\nFirefox显示了类似的警告，并阻止人们直接进入下载页面。然而，在这两种浏览器中，人们都可以接受风险并访问他们要查找的页面。\n目前还不清楚具体的问题是什么，但Chrome的警告提到YTS是被抓到钓鱼的。这一点也反映在谷歌的安全浏览报告中，该报告指出，Torrent网站最近试图欺骗访问者分享个人信息或下载软件。\n这其中是否有任何一种是故意的，仍然是一个问题。这一警告似乎更有可能是由某种类型的恶意广告触发的。\n虽然我们在盗版网站上并不经常遇到这样的警告，但这并不是我们第一次看到它们。类似的问题也影响到了其他地点，包括海盗湾。当网站运营者采取适当措施时，这些警告通常会消失。\n我们已经检查了其他几个流行的盗版网站，寻找类似的警告，但这个问题似乎仅限于YTS。我们调查的其他地点都报告是干净的。\n然而，当涉及到海盗湾时，谷歌有一个警告。谷歌没有将Torrent网站报告为安全或不安全，而是要求用户检查比主页更具体的URL。\n“像ThePirateBay.org这样内容丰富的网站很难提供简单的安全状态。通常安全的站点有时会包含一些不安全的内容。有关更详细的安全信息，请查看特定的目录或网页。\n虽然我们预计YTS会在适当的时候解决问题，但被谷歌标记也不是没有风险的。几年前，安全浏览团队宣布，“惯犯”将保持至少30天的标记，这将严重损害流量。", "note_en": "Google regularly checks websites for harmful and malicious content to help people avoid running into dangerous situations.\n This  Safe Browsing service is used by popular browsers such as Chrome and Firefox. When a site is flagged, they throw up a warning before people attempt to visit risky sites.\n This is also what’s happening to YTS.mx at the moment, which is one of the most popular  torrent sites around. While the site’s homepage can be visited just fine, navigating to a torrent detail page throws up the following warning in Chrome.\n “Deceptive site ahead. Attackers on yts.mx may trick you into doing something dangerous like installing software or revealing your personal information (for example, passwords, phone numbers, or credit cards).”\n  Firefox shows a similar alert and also prevents people from going directly to the download pages. In both browsers, people can, however, accept the risk and visit the page they were looking for.\n It’s not clear what the exact problem is but the Chrome warning mentions that YTS was caught phishing. This is also reflected in Google’s Safe Browsing report, which states the torrent site recently tried to  trick visitors into sharing personal info or downloading software.\n Whether any of this is intentional remains a question. It seems more likely that the warning was triggered by some type of malicious advertisement.\n  While we don’t encounter these kinds of warnings on pirate sites often, this isn’t the first time that we’ve seen them. Similar issues have affected other sites,  including The Pirate Bay. These warnings generally disappear when the site operator takes appropriate action.\n We have checked several other popular pirate sites for similar warnings but this particular issue seems to be limited to YTS. The other sites we looked into were all reported as clean.\n However, Google has a caveat when it comes to The Pirate Bay. Instead of reporting the torrent site as safe or unsafe, Google asks users to  check a more specific URL than the homepage.\n “It’s hard to provide a simple safety status for sites like thepiratebay.org, which have a lot of content. Sites that are generally safe sometimes contain some unsafe content. For more detailed safety info, check a specific directory or webpage,” Google notes.\n While we expect YTS to resolve the matter in due course, being flagged by Google is not without risk. A few years ago the Safe Browsing team announced that “ repeat offenders” will remain flagged for 30 days at least, which will seriously harm traffic.", "posttime": "2020-05-27 09:41:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "chrome,firefox,站点,网站", "title": "Chrome和Firefox阻止“网络钓鱼”上的Torrent站点YTS", "title_en": "Chrome and Firefox Block Torrent Site YTS Over 'Phishing'", "transed": 1, "url": "https://torrentfreak.com/chrome-and-firefox-block-torrent-site-yts-over-phishing-200525/", "via": "", "real_tags": ["chrome", "firefox", "站点", "网站"]}, {"category": "", "categoryclass": "", "imagename": "17dc1bf71fe2b714987f7e67bfaf79c6.jpeg", "infoid": 1003882, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊公司(Amazon.com Inc.)。正在就收购Zoox Inc.进行深入谈判。此举将扩大这家电商巨头在自动驾驶汽车技术领域的影响力。\n据知情人士透露，两家公司正在讨论一项交易，该交易对Zoox的估值将低于其在2018年一轮融资中实现的32亿美元。", "note_en": "Amazon.com Inc. is in advanced talks to buy Zoox Inc. in a move that would expand the e-commerce giant’s reach in autonomous-vehicle technology.\n  The companies are discussing a deal that would value Zoox at less than the $3.2 billion it achieved in a funding round in 2018, according to people familiar with the matter.", "posttime": "2020-05-27 09:41:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,亚马逊,自动,advanced", "title": "亚马逊就收购自动驾驶汽车技术公司Zoox进行深入谈判", "title_en": "Amazon in Advanced Talks to Buy Self-Driving-Car Tech Company Zoox", "transed": 1, "url": "https://www.wsj.com/articles/amazon-in-advanced-talks-to-buy-self-driving-car-tech-company-zoox-11590538611", "via": "", "real_tags": ["amazon", "亚马逊", "自动", "advanced"]}, {"category": "", "categoryclass": "", "imagename": "2cb9442152b38e1622e672f944a6fd34.jpeg", "infoid": 1003881, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "毒液是一种12自由度的无人四足(四足机器人)，配备了RGB深度摄像头和一个用于船上计算的手臂处理器。\n该行业中可用的大多数机器人都使用轮子进行导航。其目标是建造具有多地形机动性的腿式车辆，优于现有的轮式和履带式车辆。该系统将能够在携带自己的燃料和有效载荷的情况下，用腿去任何人或动物可以去的地方。在最少人工指导和干预的情况下通过地形进行谈判将是足够聪明的。该系统将实现路径、轨迹、步态优化算法、概率算法和逆运动学，以及动态稳定运动的欧拉-拉格朗日模型。\n通过使用像Robot操作系统这样的强大工具，我们可以实现SLAM(同步定位和地图绘制)来生成其周围地区的地图，该地图可以发送到Web应用程序或Android应用程序。", "note_en": "Venom is a 12-DOF unmanned Quadruped(four legged robot) equipped with RGB-Depth Camera and an ARM Processor for onboard computations.\n     Most of the robots available in the industry make use of wheels for navigation. The goal is to build legged vehicle with multiple-terrain mobility superior to existing wheeled and tracked vehicles. The system would be able to travel anywhere a person or animal could go using their legs while carrying its own fuel and payload. It would be smart enough to negotiate terrain with a minimum of human guidance and intervention. Path, trajectory, gait optimization algorithms, probabilistic algorithms along with inverse kinematics, Euler-Lagrange model for dynamically stable motion will be implemented on the system.\n By using a powerful tool like Robot Operating System, we can implement SLAM(Simultaneous Localization and Mapping) to generate a map of its surrounding area which can be sent to a web app or an android app.", "posttime": "2020-05-27 09:41:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "地形,terrain,地图", "title": "毒液：全地形自主四足动物", "title_en": "Venom: All Terrain Autonomous Quadruped", "transed": 1, "url": "https://github.com/chinmaynehate/Venom", "via": "", "real_tags": ["地形", "terrain", "地图"]}, {"category": "", "categoryclass": "", "imagename": "d31108c41e05c343f18c8c71c400d028.png", "infoid": 1003880, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是Delore的源代码：一个蒂姆布尔威德公园的迷你冒险。阅读“暴躁玩家”了解更多背景信息。\nDelore的源代码在自定义许可证下可用。有关更多详细信息，请参见LICENSE.md。\n这个存储库不包括引擎的源代码，它只是游戏Delore的源代码。要运行Delore源代码，您需要在此处下载该引擎的开发版本。如果您希望共享您的更改或修改，请将用户引导到上一页下载开发引擎，因为LICENSE.md不允许重新分发引擎。\nDelore源代码仅供个人学习和探索。请尊重我们的选择，通过按计划使用源代码来发布源代码。\n将存储库克隆到您的本地计算机。假设这些文件放在DelresDev目录中。\n从此处下载并解压缩DeloreDev引擎可执行文件。引擎可执行文件可以转到任何地方。\n如果您正在寻求帮助或帮助他人，请访问蒂姆布尔威德公园论坛。\n单击右上角的X可以关闭调试控制台。要使其重新显示，请按Ctrl-Tab。\n如果右键单击控制台标题栏，则可以在下拉菜单中找到更多调试选项。\n将以下内容添加到Prefs.json以扩展屏幕，以便为调试控制台留出更多空间。\n所有声音都是通过FMOD和FMOD完成的。在启用音频之前，必须创建或下载.bank文件。\n如果您想听音频，但对创建新音频不感兴趣，可以从此处下载Delore FMOD.bank文件。将这两个.bank文件解压并放置在DelresDev/Sound/中。\n可以在此处下载FMOD Studio工具。构建.bank文件并将其放在DelresDev/Sound/MasterBank.bank和DelresDev/Sound/MasterBank.string s.bank中。\nDelore是用一种名为Dinky的自定义语言编写的，该语言基于Squirrel并受其启发。\n如果您将浏览器指向DeloreDev/HelpDocsHtml/home.html，您将找到Dinky语言的帮助文件。它还远远没有完成，写得很仓促，而且可能充斥着严重的错误。你已经被警告过了。\n如果这是您第一次安装，我建议您先停在这里，确保一切正常，然后再继续。如果您只对代码感兴趣，您也可以停在这里。\n整个艺术管道涉及大量Python脚本，这些脚本被证明是一场安装噩梦，因此没有包括在内。\n如果要添加图片，请在Delore/Dev/Images/RoomName中为该元素放置一个.png，然后运行bin/munge_images.py，将创建精灵工作表。\n为此，您需要安装并运行TexturePacker，并定义一个指向DelresDev目录的环境变量DELORES_GAMEROOT。\n动画控制文件可以在DelresDev/Animation中找到，并且是.json文件。为廷布尔威德公园创造这些的工具早已不复存在。\n网上商店提供的Delore版本不包括任何翻译。这个repo版本剥离并包装了所有文本，并将其放入DelresDev/Translations_en.tsv中。有关更多信息，请参阅翻译帮助文档或查看DeloresDev/Scripts/Helpers/TranslationHelpers.dinky。\n添加和定位对象工具名为Wimpy，可从此处下载。\n当您第一次启动Wimpy时，您将看到一个空白窗口。要加载.wimpy文件，请将其拖动到窗口中。wimpy文件必须来自DelresDev/Wimpy文件夹，并且项目目录结构必须保持在repo中的原样。\nDinky的垃圾收集中有一个bug，所以我把它关掉了。你会注意到内存使用量在攀升，但这不太可能是一个问题，除非你一玩就是几个小时。", "note_en": "This is the source code to  Delores: A Thimbleweed Park mini-adventure. Read  Grumpy Gamer for more background.\n  The source code for Delores is made available under a custom license. See  LICENSE.md for more details.\n This repository does not include the source code for the engine, it is just the source for the game Delores. To run the Delores source code, you will need to download a development version of the engine  here. If you wish to share your changes or modifications, direct people to the preceding page to download the development engine as the  LICENSE.md does not permit redistribution of the engine.\n The Delores source is intended solely for personal use to learn and explore. Please respect our choice to release the source by using it as intended.\n  Clone the repository to your local machine. It is assumed that these files are placed in a  DeloresDev directory.\n Download and extract the DeloreDev engine executable from  here. The engine executable can go anywhere.\n            If you&#39;re looking for help or to help others, please visit  the Thimbleweed Park Forums.\n  The debug console can be closed by clicking on the  X in the upper right. To make it reappear, press  control-TAB.\n If you right-click on the console title bar, more debug options can be found in the drop-down menu.\n Add the following to  Prefs.json to extend the screen to allow more room for the debug console.\n    All sound is done via  FMOD and  FMOD  .bank files must be created or downloaded before audio can be enabled.\n If you want to hear audio and aren&#39;t interested in creating new audio, the Delores  FMOD  .bank files can be downloaded from  here. Extract and place both  .bank files in  DeloresDev/Sounds/\n The  FMOD Studio Tool can be downloaded  here. Build and place the  .bank files in  DeloresDev/Sounds/MasterBank.bank and  DeloresDev/Sounds/MasterBank.strings.bank\n   Delores is coded in a custom language called  Dinky that is based on and inspired by  Squirrel.\n If you point a browser to  DeloresDev/HelpDocsHtml/home.html you will find the help files for the  Dinky language. It is far from complete, hastily written, and probably riddled with spealling mistakes. You&#39;ve been warned.\n  If this is your first time installing, I suggest you stop here and ensure everything works before proceeding.If all you&#39;re interested in is code, you can also stop here.\n  The full art pipeline involves a slew of Python scripts that proved to be an installation nightmare so they are not included.\n If you want to add art, place a  .png for the element in the  Delores/Dev/Images/RoomName and then run  Bin/munge_images.py and the sprite sheets will be created.\n To do this, you need to have  TexturePacker installed and working and define an enviornment variable  DELORES_GAMEROOT that points to your  DeloresDev directory.\n  Animation control files can be found in  DeloresDev/Animation and are  .json files. The tool that created these for Thimbleweed Park is long gone.\n  The version of Delores avaliable in online stores does not include any translation. This repo version has all the text stripped and wrapped and placed into  DeloresDev/Translations_en.tsv. See the help doc on Translations or look at  DeloresDev/Scripts/Helpers/TranslationHelpers.dinky for more information.\n  The tool to add and position objects is called  Wimpy and it can be download  here\n When you first start  Wimpy, you will see a blank window. To load a  .wimpy file, drag it into the window. The  .wimpy file must come from the  DeloresDev/Wimpy folder and the project directory structure must remain as it is in the repo.\n  There is a bug in the garbage collection for Dinky, so I turned it off. You will notice memory usage climbing, but it&#39;s not likely to be an issue unless you&#39;re playing for hours and hours.", "posttime": "2020-05-27 09:39:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,delore,code,delresdev", "title": "Delore的源代码：蒂姆布尔威德公园的迷你冒险", "title_en": "Source code to Delores: A Thimbleweed Park mini-adventure", "transed": 1, "url": "https://github.com/grumpygamer/DeloresDev", "via": "", "real_tags": ["代码", "delore", "code", "delresdev"]}, {"category": "", "categoryclass": "", "imagename": "6cf30e781502368f90bf5b5a8f3dd451.jpeg", "infoid": 1003879, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "印第安纳波利斯-印第安纳大学医学院(Indiana University School Of Medicine)的一组研究人员已经展示了一种使用特定类型的织物对抗冠状病毒的方法。该研究小组由印第安纳再生医学中心和工程总监昌丹·森领导，他们说，将病毒暴露在电疗织物中可以在一分钟内消除它们感染的能力。这些发现通过预印本发表在在线服务ChemRxiv上。\n森说，当冠状病毒颗粒附着在个人防护装备表面时，它们仍然可能是一个威胁。\n参议员说：我们都知道新冠肺炎具有很高的传染性，特别是对医疗服务提供者来说；他们经常接触到感染这种病毒的人，虽然他们戴着口罩，但其中一些病毒会粘附在口罩的外部，当你摘下口罩时，你会不经意地传播感染，所以我们这里的挑战是，一旦这种病毒接触到口罩的织物，它就不再能再感染了，所以我们这里的挑战是，一旦这种病毒接触到口罩的织物，它就不再能再感染了，所以我们这里的挑战是，一旦这种病毒接触到口罩的织物，它就不再能够感染了，所以我们这里的挑战是，一旦这种病毒接触到口罩的织物，它就不再能够再感染了。\n森说，“电疗法”指的是使用电力治疗疾病。这一过程使用了嵌入式微电池矩阵，可以产生电场，并无线产生对人类无害但可以消除细菌感染的低水平电力。\n在过去的六年里，研究小组一直在研究电化学纤维的用途。IU说，这种面料目前被用作广谱抗菌伤口护理敷料。\n研究小组还发现，将这种具有自身电动特性的病毒暴露在织物中，不会使其丧失感染能力。\n当我们不断从文献中了解病毒是如何构建的，以及它依赖于静电力的事实时，我们认为我们的敷料(将)能够破坏这些静电力。我们开始测试它，最终的结果看起来很有希望。\n这项名为V.Dox Technology的电刀技术是由总部位于亚利桑那州的Vomaris创新公司开发并申请专利的。\n这项工作提供了第一个证据，证明冠状病毒的物理特征可以被利用，使它们在接触到低电平产生电场的织物后不具感染性，参议员说，我们希望这些发现将帮助Vomaris获得美国食品和药物管理局的紧急使用授权，并且我们可以广泛地利用这种织物来对抗新冠肺炎，最终拯救生命。&#34；我们希望这些发现将帮助Vomaris获得美国食品和药物管理局的紧急使用授权，我们可以广泛地利用这种织物来对抗新冠肺炎，最终拯救生命。", "note_en": "INDIANAPOLIS -  A team of researchers at the Indiana University School of Medicine has demonstrated a way to fight coronaviruses using a specific type of fabric. The team, led by Indiana Center for Regenerative Medicine and Engineering Director Chandan Sen, says exposing the viruses to an electroceutical fabric can eliminate their ability to infect within one minute. The findings were published via pre-print in the online service ChemRxiv.\n Sen says coronavirus particles can still be a threat when they attach to personal protective equipment surfaces.\n &#34;COVID-19 as we all know is highly infectious, especially (for) healthcare providers; they&#39;re constantly exposed to people that have this infection and although they are wearing, for example, face masks, some of these viruses are adhering to the exterior of those masks and when you are taking off the masks, inadvertently you end up spreading infection,&#34; said Sen. &#34;So our challenge here is once this virus comes in contact with the fabric of the mask that it no longer is able to infect anymore.&#34;\n  Sen says &#34;electroceutical&#34; refers to treating a disorder using electrical forces. The process uses a matrix of embedded microcell batteries that can create an electric field and wirelessly generate a low level of electricity that is harmless to humans but can dismantle bacterial infection.\n The research team has been studying the use of electroceutical fabric for the last six years. IU says the fabric is currently used as a broad-spectrum antimicrobial wound care dressing.\n The team found that exposing the virus, which has its own eletrokinetic properties, to the fabric would incapacitate its ability to infect.\n &#34;As we kept understanding from the literature on how the virus is constructed and the fact that it relies on electrostatic forces, we thought then our dressing (would be) capable of disrupting those electrostatic forces. We started testing it and the end results seem very promising.&#34;\n The electroceutical technology, known as V.Dox Technology, was developed and patented by Arizona-based Vomaris Innovations Inc.\n &#34;This work presents the first evidence demonstrating that the physical characteristic features of coronaviruses may be exploited to render them non-infective following contact with low-level electric field-generating electroceutical fabric,&#34; said Sen. &#34;Our hope is that these findings will help Vomaris receive FDA Emergency Use Authorization and that we can utilize this fabric widely in the fight against COVID-19, ultimately saving lives.&#34;", "posttime": "2020-05-27 09:24:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,coronavirus,病毒,研究,study", "title": "IU研究表明面料可以帮助对抗冠状病毒", "title_en": "IU Study Suggests Fabric Could Help Fight Coronavirus", "transed": 1, "url": "https://www.insideindianabusiness.com/story/42147198/iu-study-suggests-fabric-could-help-fight-coronavirus", "via": "", "real_tags": ["冠状病毒", "病毒", "研究", "study"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003877, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "18年后(大约几个月)，Eric S.Raymond做了一个UNIX托管的内部编译器作为周末黑客。自那以后，C-INTERCAL的实施一直由包括路易斯·豪厄尔(Louis Howell)、史蒂夫·斯瓦尔斯(Steve Swales)、迈克尔·恩斯特(MichaelErnst)和布莱恩·瑞特(BrianRaiter)在内的国际技术受虐者社区维护和推广。(很明显，在这两个版本之间的某个时候有一个Atari实现；关于它的注释被附加到Intercal-72手册中。(这些官员明智地拒绝透露自己的身份。)。Intercal的灵感来自于一个雄心壮志：拥有一种与任何其他主要语言毫无共同之处的编译器语言。主要指的是作者完全熟悉的任何语言，例如FORTRAN、BASIC、COBOL、ALGOL、SNOBOL、SPITBOL、FOCUS、SOLVE、TEST、APL、LISP和PL/I。在很大程度上，INTALL仍然忠于这一目标，只共享变量、数组和执行I/O的能力等基本元素，并避开赋值语句以外的所有传统操作(FORTRAN=。编译器的全名是Compiler Language，具有不可声明的首字母缩写，出于显而易见的原因，它被缩写为Intercal&#34；。作者深深感谢埃里克·M·范和丹尼尔·J·瓦门霍温，如果没有他们的不知不觉中的帮助，这本手册仍然是可能的。", "note_en": "Eighteen years later (give or take a few months) Eric S. Raymond perpetrated aUNIX-hosted INTERCAL compiler as a weekend hack. The C-INTERCALimplementation has since been maintained and extended by aninternational community of technomasochists, including Louis Howell,Steve Swales, MichaelErnst, and  BrianRaiter. (There was evidently an Atari implementation sometime between thesetwo; notes regarding it got appended to the INTERCAL-72 manual. Theculprits have sensibly declined to identify themselves.) INTERCAL was inspired by one ambition: to have a compiler languagewhich has nothing at all in common with any other major language. By&#34;major&#34; was meant anything with which the authors were at allfamiliar, e.g., FORTRAN, BASIC, COBOL, ALGOL, SNOBOL, SPITBOL, FOCAL,SOLVE, TEACH, APL, LISP, and PL/I. For the most part, INTERCAL hasremained true to this goal, sharing only the basic elements such asvariables, arrays, and the ability to do I/O, and eschewing allconventional operations other than the assignment statement (FORTRAN =). The full name of the compiler is &#34;Compiler Language With NoPronounceable Acronym&#34;, which is, for obvious reasons, abbreviated&#34;INTERCAL&#34;. The authors are deeply indebted to Eric M. Van and Daniel J.Warmenhoven, without whose unwitting assistance this manual wouldstill have been possible.", "posttime": "2020-05-27 09:08:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,intercal,缩写", "title": "Intercal出生于1972年5月26日。生日快乐，Intercal", "title_en": "INTERCAL was born on May 26, 1972. Happy Birthday, INTERCAL", "transed": 1, "url": "https://www.muppetlabs.com/~breadbox/intercal-man/s01.html", "via": "", "real_tags": ["app", "intercal", "缩写"]}, {"category": "", "categoryclass": "", "imagename": "e6ef2ef7efcec512b58a73d8a5a2a07b.jpg", "infoid": 1003876, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "奥迪已经在全电动赛车系列E方程式中放弃了车手丹尼尔·阿伯特(Daniel Abt)，因为他在周末的一场虚拟比赛中有一名职业模拟车手为他秘密比赛。因此，他还被告知要向慈善机构支付1万欧元。\nABT周二表示，他认为这个想法会很有趣，并计划发布一段关于整个诡计的视频。\nABT本应参加E方程式在线模拟赛车系列赛的第五轮比赛，该系列赛于4月份开始，与一级方程式(F1)、纳斯卡(NASCAR)和印地车(IndyCar)的虚拟替代系列赛并驾齐驱。E方程式SIM系列赛不仅是为了让球迷们在大流行期间看一些东西，还应该让车手和车队保持联系，同时为联合国儿童基金会筹集资金。\n但阿伯特已经聘请了18岁的洛伦茨·霍尔津(Lorenz Hoerzing)代替他参赛，霍尔津一直在参加E方程式赛事的模拟车手部分的比赛。(因此，霍尔津已被暂停参加模拟赛车系列比赛。)。ABT甚至在车手组Zoom Call上出现了一个人，名字是“Daniel Abt”，穿着奥迪红色的衣服，但用麦克风挡住了他的脸-考虑到Abt在之前的比赛中活跃地出现在他的个人视频流中，这是一个明显的背离：\n霍尔津在Abt的虚拟赛车中领先了大部分比赛，但他接触到了梅赛德斯-奔驰车手Stoffel Vanhone，让日产车手Oliver Rowland取得了胜利。这最初引起了怀疑，因为Abt之前在虚拟锦标赛的前几轮比赛中一直举步维艰。\n在霍尔津获得第三名后，欺骗行为真正开始破灭，这意味着阿伯特应该出现在标准的赛后采访前三名车手的时候。但他没有；罗兰和范霍恩的Zoom feed被放在一个写有Abt名字的黑匣子旁边，广播主持人甚至从未试图采访这位奥迪司机。在采访中，范霍恩说，他是在“质疑车里是否真的是丹尼尔。”\n范霍恩在比赛结束后在他的个人Twitch频道上发泄了更多的情绪，甚至试图在流媒体的同时打电话给Abt，但奥迪司机没有接电话。据报道，比赛的组织者能够根据霍尔津的IP地址核实阿伯特不是在比赛。\nABT在被捕后道歉。“我没有把这件事当回事。我对此特别抱歉，因为我知道E方程式赛车组织在这个项目上做了多少工作，“他在本周末的一份声明中说。\n周二上午，奥迪宣布Abt被停职。当天晚些时候，Abt发布了一段14分钟的关于丑闻的视频，在视频中他宣布他“不会再与E方程式车队比赛”。\n“我们想记录下来，为粉丝们创造一个有趣的故事。”\nABT在视频中解释说，他更多地将这些比赛视为球迷的娱乐活动，而不是严肃的竞争。因此，根据英文字幕，Abt说他认为这将是一个“有趣的举动，如果一个模拟赛车手”为他开车的话。“我们想记录下来，为粉丝们创造一个有趣的故事。”\n他甚至包括了一次练习会的镜头和音频，在那里他向霍尔津提出了这个想法。“老实说，你想代替我来驾驶比赛吗，伙计？”他问霍尔津，霍尔津笑了。“不开玩笑，不开玩笑，”阿伯特说。“让我们真的想一想这件事。那会非常有趣的。“。\nABT继续解释说，为了让他看起来更好，“他从来没有(他)打算让另一名司机为他开车”，他的计划是在某个时候发布一段视频，“解除”这一计划。他还说他没有付钱给霍尔津，并声称没有使用VPN隐藏这位奥地利模拟赛车手的IP地址就是他们没有试图掩盖这一事实的证据。他指责媒体把他描绘成一个骗子，“没有给(他)一个亲自谈论这件事的机会。”\n阿伯特说：“比赛结束后不久，我意识到比赛并没有到此为止，它突然朝一个我自己在梦中都无法想象的方向前进。”“我们没有充分考虑事态的严重性和后果.”司机说他犯了一个“巨大的错误”。\nABT并不是第一个在这些在线比赛中给自己带来现实世界后果的司机。就在上个月，纳斯卡车手凯尔·拉森(Kyle Larson)因为在模拟人生比赛中使用Twitch流中的n-word而被他的车队解雇。\nABT是参加每一场一级方程式比赛的四名车手之一，他的父亲管理着奥迪车队\n但阿伯特的情况是第一个真正面对作弊问题的人。这是其他大型游戏联盟在大流行期间已经试图阻止的事情，他们实施了围绕屏幕录制的规则，并迫使玩家使用网络摄像头-想必是用清晰的面部镜头。\nABT从球队中被除名是令人震惊的。自2014年E方程式系列赛开始以来，他是参加每一场一级方程式比赛的四名车手之一。他也是汉斯-于尔根·阿伯特(Hans-Jürgen Abt)的太阳，阿伯特经营着监督奥迪E方程式车队的公司。(“Abt”这个姓氏甚至是车队全名的一部分，奥迪运动ABT舍弗勒(Audi Sports ABT Schaeffler)。)。\n他在视频中说：“我相信，即使现在感觉不好，人们也不应该忘记，我们一起取得了奥迪、德国车手和我的第一次E方程式胜利。”", "note_en": "Audi has dropped driver Daniel Abt in the all-electric racing series Formula E after he had a pro sim driver surreptitiously race for him during a virtual competition over the weekend. He has also been told to  pay €10,000 to charity as a result.\n Abt said Tuesday that he thought the idea would be funny and that he had planned to release a video about the whole ruse.\n Abt was supposed to be competing in the fifth round of Formula E’s online sim racing series,  which started up in April alongside  virtual substitute series from Formula One, NASCAR, and IndyCar. The Formula E sim series was not only meant to give fans something to watch during the pandemic, but it was also supposed to keep the drivers and teams connected, all while raising funds for UNICEF.\n  But Abt had tapped 18-year-old Lorenz Hoerzing, who has been competing in the sim racer section of Formula E’s events, to run in his place. (Hoerzing has since been suspended from the sim racing series as a result.) Abt had someone even appear on the drivers’ group Zoom call under the name “Daniel Abt” dressed in Audi red, but with a microphone blocking his face — a noticeable departure considering Abt’s lively presence on his personal streams of the previous races:\n  Hoerzing led most of the race in Abt’s virtual car, but he came into contact with Mercedes-Benz driver Stoffel Vandoorne, allowing Nissan driver Oliver Rowland to take the win. This initially raised suspicions because Abt had previously  struggled to compete in the earlier rounds of the virtual championship.\n The deception really started to unravel after Hoerzing finished third, meaning Abt was  supposed to show up for the  standard post-race interview with the top three drivers. But he didn’t; Rowland and Vandoorne’s Zoom feeds were instead placed next to a black box with Abt’s name, and the broadcast hosts never even attempted to interview the Audi driver. During his portion of the interview, Vandoorne said was “questioning if it was really Daniel in the car.”\n   Vandoorne vented even more on his personal Twitch channel following the race and even  tried to call Abt while streaming, but the Audi driver did not pick up. Organizers of the race were reportedly able to verify that Abt was not racing based on Hoerzing’s IP address.\n Abt apologized after he was caught. “I didn’t take it as seriously as I should have. I’m especially sorry about this, because I know how much work has gone into this project on the part of the Formula E organisation,” he said in a statement this weekend.\n On Tuesday morning, Audi announced that Abt was suspended. Later in the day, Abt  released a 14-minute video about the scandal where he announced that he “won’t be racing” with the Formula E team anymore.\n “We wanted to document it and create a funny story for the fans with it.”\n Abt explains in the video that he had viewed these races more as entertainment for the fans and less as serious competition. As a result, Abt says he thought it would be a “funny move if a sim racer” drove for him, according to the English subtitles. “We wanted to document it and create a funny story for the fans with it.”\n He even included footage and audio from a practice session where he proposed the idea to Hoerzing. “Honestly, do you want to drive the race instead of me, man?” he asks Hoerzing, who laughs in response. “No joke, no joke,” Abt says. “Let’s actually think about this. That would be super funny.”\n  Abt goes on to explain that it was “never [his] intention to let another driver drive for [him]” to make him look better and that his plan was to release a video “unwind[ing]” the scheme at some point. He also says he didn’t pay Hoerzing, and claims that not using a VPN to hide the Austrian sim racer’s IP address is proof that they weren’t trying to cover it up. He blames the media for painting him as a cheater “without giving [him] a chance to personally talk about it.”\n “Shortly after the race, I realized myself that it did not end there and it suddenly went in a direction which I, myself, had not ever been able to even imagine in my dreams,” Abt says. “We did not think enough about the seriousness and the consequences of the situation.” The driver says he made a “huge mistake.”\n Abt is not the first driver to wind up causing real-world consequences for himself during these online competitions. Just last month, NASCAR driver Kyle Larson was fired from his team for  using the n-word on a Twitch stream while competing in a sim race.\n Abt’s one of four drivers to run every Formula E race, and his father runs the Audi team\n But Abt’s situation is the first to really brush up against the issue of cheating. This is something  other big gaming leagues have already tried to prevent during the pandemic by implementing rules around screen recording as well as forcing players to use webcams — presumably with a clear shot of their faces.\n Abt’s removal from the team is striking. He’s one of four drivers to have run in every Formula E race since the series’s inception in 2014. He’s also the sun of Hans-Jürgen Abt, who runs the company that oversees the Audi Formula E team. (The “Abt” surname is even part of the team’s full name, Audi Sport ABT Schaeffler.)\n “I believe that, even if it does not feel good now, one should not forget that together, we achieved the first Formula E victory for Audi, for a German driver, for me,” he says in the video.", "posttime": "2020-05-27 08:53:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "司机,drops,abt", "title": "奥迪私自使用铃声角逐虚拟赛车的司机下架", "title_en": "Audi Drops Driver For Secretly Using a Ringer To Compete In Virtual Race", "transed": 1, "url": "https://www.theverge.com/2020/5/26/21270503/audi-drops-formula-e-daniel-abt-esports-racing-ringer-scandal", "via": "", "real_tags": ["司机", "drops", "abt"]}]