[{"category": "", "categoryclass": "", "imagename": "1b4ab85435ff5d94e3cb4ba50877146f.jpg", "infoid": 1003351, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据杜兰大学(Tulane University)的一项新研究，考虑到目前全球海平面上升的速度，密西西比三角洲剩余的沼泽很可能会被淹没。\n发表在“科学进展”上的这项研究的一个关键发现是，沿海沼泽经历了临界点，海平面上升速度的小幅增加会导致大范围的淹没。\n在过去的一个世纪里，路易斯安那州沿海2000平方英里(5000平方公里)湿地的损失是有据可查的，但预测剩余的6000平方英里(15000平方公里)沼泽地的命运更具挑战性。这项研究使用了自20世纪90年代初收集的数百个沉积物岩心，以检查沼泽对过去8500年来一系列海平面上升速度的反应。\n目前的情况是，海平面上升的速度将继续加快，并使我们走上未来沼泽消失得更快的轨道。“。\n“以前的调查表明，沼泽可以跟上海平面每年高达半英寸(10毫米/年)的上升速度，但那些研究是基于对非常短的时间窗口的观察，通常是几十年或更短的时间，”杜兰大学地球与环境科学系的主要作者、沃克斯地质教授托尔比约恩·特伦奎斯特(Torbjörn Törnqvist)说。\n“我们通过研究7000多年前的沼泽反应，把眼光放得更远了，当时全球海平面上升的速度非常快，但在本世纪晚些时候预计的范围内。”\n研究人员发现，在密西西比三角洲，一旦海平面上升的速度超过每年约十分之一英寸(3毫米/年)，大多数沼泽在几个世纪内就会淹死。当溺水速度超过每年0.25英寸(7.5毫米/年)时，大约半个世纪后就会发生溺水事件。\nTörnqvist说：“可怕的是，由于气候变化，目前全球海平面上升的速度已经超过了沼泽溺水的最初临界点。”“就目前的情况而言，海平面上升的速度将继续加快，并使我们走上未来沼泽消失得更快的轨道。”\n虽然这些发现表明路易斯安那州沿海剩余沼泽的丧失可能是不可避免的，但仍然可以采取有意义的行动来防止可能出现的最坏结果。Törnqvist说，最重要的是大幅限制温室气体排放，以防止海平面上升到几十年内沼泽将被淹没的速度。\n另一个是尽快实施主要河流改道，这样至少密西西比三角洲的一小部分可以存活更长的时间。然而，他表示，这些行动有效的机会之窗正在迅速关闭。\nTörnqvist与克里斯塔·扬科夫斯基(Krista Jankowski)和胡安·冈萨雷斯(Juan González)一起进行了这项研究，他们在他的指导下在杜兰获得了博士学位，以及他的团队中的前博士后李永祥(音译)。\n为这项研究提供资金的美国国家科学基金会(National Science Foundation)的贾斯汀·劳伦斯(Justin Lawrence)补充说，“沼泽流失的影响是美国沿海地区和其他地方公众严重关注的问题，这项研究可能会带来更好的管理决策，以减少这些影响。”\n美国能源部国家气候变化研究所沿海中心提供了额外的资金。", "note_en": "Given the present-day rate of global sea-level rise, remaining marshes in the Mississippi Delta are likely to drown, according to a new Tulane University study.\n A key finding of the study, published in   Science Advances is that coastal marshes experience tipping points, where a small increase in the rate of sea-level rise leads to widespread submergence.\n The loss of 2,000 square miles (5,000 km 2) of wetlands in coastal Louisiana over the past century is well documented, but it has been more challenging to predict the fate of the remaining 6,000 square miles (15,000 km 2) of marshland. The study used hundreds of sediment cores collected since the early 1990s to examine how marshes responded to a range of rates of sea-level rise during the past 8,500 years.\n &#34;As things stand right now, the rate of sea-level rise will continue to accelerate and put us on track for marshes to disappear even faster in the future.”\n “Previous investigations have suggested that marshes can keep up with rates of sea-level rise as high as half an inch per year (10 mm/yr), but those studies were based on observations over very short time windows, typically a few decades or less,” said Torbjörn Törnqvist, lead author and Vokes Geology Professor in the Tulane Department of Earth and Environmental Sciences.\n “We have taken a much longer view by examining marsh response more than 7,000 years ago, when global rates of sea-level rise were very rapid but within the range of what is expected later this century.”\n The researchers found that in the Mississippi Delta most marshes drown in a few centuries once the rate of sea-level rise exceeds about one-tenth of an inch per year (3 mm/yr). When the rate exceeds a quarter of an inch per year (7.5 mm/yr), drowning occurs in about half a century.\n “The scary thing is that the present-day rate of global sea-level rise, due to climate change, has already exceeded the initial tipping point for marsh drowning,” Törnqvist said. “And as things stand right now, the rate of sea-level rise will continue to accelerate and put us on track for marshes to disappear even faster in the future.”\n While these findings indicate that the loss of remaining marshes in coastal Louisiana is probably inevitable, there are still meaningful actions that can be taken to prevent the worst possible outcomes. The most important one, Törnqvist said, is to drastically curb greenhouse gas emissions to prevent sea-level rise from ramping up to rates where marshes will drown within a matter of decades.\n The other one is to implement major river diversions as quickly as possible, so at least small portions of the Mississippi Delta can survive for a longer time. However, the window of opportunity for these actions to be effective is rapidly closing, he said.\n Törnqvist conducted the research with Krista Jankowski and Juan González, who received their PhD degrees at Tulane under his supervision, and Yong-Xiang Li, a former postdoc in his group.\n Justin Lawrence of the National Science Foundation, which provided funding for the study, added, “The effects of marsh loss are a serious public concern in coastal regions of the United States and elsewhere, and this study could lead to better management decisions that curtail those effects.”\n Additional funding was provided by the National Institute for Climatic Change Research Coastal Center of the U.S. Department of Energy.", "posttime": "2020-05-23 13:40:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "三角洲,delta,沼泽", "title": "密西西比三角洲沼泽处于不可逆转的崩溃状态", "title_en": "Mississippi Delta marshes in a state of irreversible collapse", "transed": 1, "url": "https://news.tulane.edu/pr/mississippi-delta-marshes-state-irreversible-collapse-tulane-study-shows", "via": "", "real_tags": ["三角洲", "delta", "沼泽"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003346, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我几乎所有的技术职业生涯中，我一直是“远程”工作的直言不讳的支持者--碰巧的是，这份工作是从一份完全偏远的工作开始的。(谢谢您，IBM！)。正如我以前写过的，我一直相信，远程工作是一项从根本上颠覆性的技术，其明显的优势将不可避免地获胜。我认为这件事的真相是显而易见的，不会再长篇大论了。\n本周，Facebook宣布允许(一些)员工住在他们想住的任何地方，从而打破了围绕远程薪酬的长期争议。从根本上说，问题是如何“公平”支付远程员工的工资--实际上，这个词到底是什么意思，或者它是否相关。这切中了一些基本问题的核心，这些问题使薪酬成为一个如此艰难的话题。许多公司都在为薪酬而苦苦挣扎，而且大多数都是出于非邪恶的原因。\n综上所述，我确实认为有一个正确和错误的答案-有点冷酷的实用主义色彩。\n这里有一个务实的部分：如果需要削减工资才能把更多的技术工作岗位从旧金山/纽约市撬到“所有其他地方”，那么就这样吧。即使在理发20%之后，温斯顿-塞勒姆、杰克逊维尔、小石城或布鲁明顿的人们可能仍然会发现Facebook产品营销经理的起薪仍然很有竞争力。我们在工人工资上竞争的雇主越多越好。机会越多越好。太好了。勇敢点儿。\n有了这个告诫，让我继续说：生活费调整(COLA)是非常不公平的，也是一种糟糕的做法。做同样工作、提供同样价值的人应该得到同样的报酬。\n直到最近，对于大多数人来说，完全远程访问还不是一种选择。如果你想在X公司工作，你必须在某个巨型地铁的办公室工作。这就是我们的交易。\n然而，在我工作过的每一家软件公司，几乎每个人的工作都可以--有时也确实是--在网上、远程完成得非常好。是的，全部都有：产品、工程、设计、运营、营销等等。即使是对远程工作持怀疑态度的人也深知这一点。现在，我们正在看到一个现实生活中的概念证明，这一事实每个人都已经知道很长一段时间了。远程团队工作得很好。怀疑者已被确凿地证明是错误的。\n换句话说，员工需要在大型地铁工作的商业理由正在崩溃。尽管如此，仍然有许多人可能想要住在纽约-但他们这样做对公司的成功并不关键，甚至不相关。代码并不关心它是在哪里编写的。用户故事、设计样机或卖家支持平台也不需要。如果在坦佩行得通，门洛帕克也会行得通。\n(因为这是互联网，人们喜欢吹毛求疵，让我补充一句，有些员工实际上可能有与商业相关的原因住在某个地理区域。特别是，我会考虑直接面向客户的角色，比如销售或客户成功。它们是这条规则的一些罕见的例外。)。\n如果基于可乐的薪酬的基本原理是，高成本地铁的员工需要更多的补偿，那么当他们的雇主不再偏爱时会发生什么？另一种说法是：“为什么成本较低地区的员工需要这么多钱”的另一面变成了，公司为什么需要旧金山的员工？\n在谈到廉价/昂贵地点的员工时，人们经常会提出这样一个问题，即人们“需要”什么来负担他们的生活方式。这是错误的处理问题的方式，因为它不可避免地充满了个人选择。如果旧金山有人想把收入的一大部分花在他们想住的地方，那是很棒的--也是他们的选择。但是，如果圣马特奥的一名远程(或办公室)员工与他们在小石城的同事做同样的工作，为什么一个人的个人选择会得到奖励，另一个人会受到惩罚？如果小石城的员工有一个孩子，正在照顾年迈的父母，而圣马特奥的员工是单身的，那该怎么办？如果问题是“需要”，为什么这些情况不被认为是相关的呢？简而言之，对可乐进行调整不可避免地会对个人“应该”如何使用他们的钱做出假设，而且大多是不合适的；他们认为生活在大城市是一个值得的选择，而其他决定就不那么值得了。\n“如果每个人的工资都是标准的，与低收入社区的同龄人相比，那些生活在高收入地区的人的可自由支配收入会更少。”\n根据个人的生活方式选择，可乐不可避免地是对某人的补贴和对另一个人的惩罚。想要住在一个令人向往的、高成本的地铁里，不应该给你的雇主带来商业义务。你住的地方是，而且一直都是一个消费选择。这一选择现在只是形成了更鲜明的对比。\n使用COLA最常见的论点是，由于劳动力供求关系，它们是必需的。也就是说：不同地区的市场清算工资不同，因此公司应该根据当地的标准支付工资。这是像GitLab这样的完全分散的公司所采取的基本方法，他们帮助使他们的薪酬公式完全透明。\n这种方法的问题来自你对“劳动力供应”的定义。对于一家总部所在地的公司来说，这个劳动力池就像半径20英里内的每个人一样。然而，对于一家偏远的公司来说，它变成了“互联网”。(或者，出于实际目的，您可以在合法司法管辖区雇用的所有网民。(稍后将详细介绍这一点。)。从双方的角度来看，韦恩堡的候选人不仅仅是与当地的候选人“竞争”，她也在与孟菲斯、斯波坎和什里夫波特的候选人竞争。当公司向下调整以达到候选人所在地的市场清理水平时，他们真正谈论的是公司可以惩罚员工并逍遥法外的程度，而不是那个职位的人应该得到什么。在补贴一名员工对另一名员工的地域偏好时，他们陈述的是一种毫无商业意义的组织偏好。\n有些人会在这种模式中看到一种“逐底竞赛”。我没有-我认为这是扩大机会。如果其他地方的人能够以较少的薪酬费用完美地完成一项给定的工作，那么让他们做显然是有商业意义的。我可以清楚地理解为什么这会吓到一个在门洛帕克一年赚50万美元的Facebook工程师。考虑到大多数偏远公司所需的稀有人才，无论他们最终付给班戈或里诺接受这份工作的人多少钱，仍然是一笔不错的、高收入的中产阶级收入。\n这里有一种滑坡式的相反论点，从逻辑上讲，完全远离意味着好的科技工作将完全从美国消失，并转移到海外。这句话的逻辑结论是，完全远离美国意味着好的科技工作将完全从美国消失，并流向海外。毕竟，海得拉巴、基辅和拉各斯的人们也同样聪明，可以做这些工作中的大多数。从20世纪90年代开始，我们就听到了软件开发行业即将把所有工程角色外包出去的阴暗警告。(说真的，这在90年代末被认为是一个大问题。)。但这不仅没有发生，而且对美国工程师和其他知识型工人的需求也有了相当大的增长。我认为这种情况将继续存在。我认为，主要针对美国观众和公司打造产品，会让美国员工变得有价值。出于远程招聘的目的，与州边界相比，国家边界明显不那么漏洞百出，主要是为了监管和税收问题。\n(从政策制定的角度来看，我认为美国领导人为高薪工作的大规模离岸设置监管障碍是有意义的。在没有提供任何替代模式的情况下，关于全球化如何伤害了美国的工人阶级就业，有一些有趣的争论。但这是一篇不同的博客文章，与对该公司的分析水平不同。)。\n当谈到薪酬时，很多美国人会说，支付班加罗尔的普加或伊兹密尔的穆斯塔法，就像支付帕洛阿尔托的产品设计师一样，当然是没有意义的。但在这一点上，我感觉到了很多自私自利的想法-普贾和穆斯塔法可能有不同的想法。事实上，如果他们为公司提供相同的价值，我认为正确的做法是向他们支付相同的工资。如果这意味着普贾和穆斯塔法的生活就像国王(/女王)一样，那么就这样吧。对他们来说很好。为离岸团队支付极低的工资相当于基于他们出生的意外而惩罚他们，这甚至比因为他们的生活方式选择而这样做更站不住脚。\n这不是会增加补偿成本吗？嗯，我不知道。当然，这会把他们养大的。但以GitLab为例，它已经筹集了大约5亿美元的风投资金。他们有能力支付他们的员工工资。微软或IBM或任何其他在低工资国家拥有数十万员工的大公司的收入低于美国同行的情况又如何呢？我真的不知道那里的答案。正确的是正确的-人们应该得到公平的薪酬，而不是基于国籍。有一种纯粹务实的论点认为，比方说，对班加罗尔来说，许多人的工资低于美国人(但按照当地标准仍然很高)，比起拿到美国工资的少得多的人更好。那不是由我来裁决的问题。但这公平吗？不，它不是。\n如果有正当的商业理由要求雇员的所在地，雇主应该向他们支付当地的工资。但如果不是这样的话--对于大多数软件角色来说，情况就是这样--那么劳动力池就会变得比以往任何时候都更广、更深。\n随着这种混乱在未来几个月甚至可能几年内逐渐显现，将会有赢家和输家。没有人确切地知道我们将在哪里降落。但是，如果少数几个大型沿海大都市对有利可图的科技公司工作的束缚被打破，我们的社会-和行业-将对此有利。远程工作对公司和团队更有利。这对员工、家庭和社区都更好。并不是每个人都喜欢远程工作，但也不是每个人都喜欢在办公室工作。(我不记得以前有谁的个人喜好很重要。)。\n远程工作不会像潮汐一样向我们袭来。在可预见的未来，大多数公司仍将对此犹豫不决。我对COVID危机将如何加速远程工作持乐观态度，但也只是谨慎地乐观。我可能错了，但我认为这将是小步前进，而不是大跃进。但我知道的是：我现在不想持有硅谷写字楼园区的长期商业地产租约。\n我会半定期更新我最近读到的最有趣的东西，以及我自己的博客摘要。了解更多信息并阅读老问题，或者直接在下面注册。我不会给你发垃圾邮件的-我保证。\n如果您是人类，请将此字段留空：", "note_en": "I’ve been a vocal proponent of “remote” working for pretty much all of my career in technology – which, as it happens, started off in a fully remote gig. (Thanks, IBM!) My belief all along –  as I’ve written about before – is that remote working is a fundamentally disruptive technology whose clear advantages will inevitably win out. I think the truth in this is pretty obvious and won’t belabor it further.\n This week, Facebook broke open a long-running controversy over remote compensation with its announcement about letting (some) employees live wherever they want. Fundamentally, the question is how to pay remote employees “fairly” – indeed, what that word even means, or if it’s even relevant. This hits right at the core of some basic issues that make compensation such a hard topic. Lots of companies struggle with compensation, and most for non-evil reasons.\n That all said, I do think there’s a right and wrong answer – colored a little bit by cold pragmatism.\n  Here’s the pragmatic bit: if it takes cutting wages to pry more tech jobs out of SF/NYC and into “everywhere else,” then so be it. Even after a 20% haircut, folks in Winston-Salem or Jacksonville or Little Rock or Bloomington will probably still find the starting salary of a product marketing manager at Facebook competitive. The more employers we have competing over workers’ wages, the better. Expanded opportunity is  always better. So fine. Go for it.\n With that caveat out of the way, let me go on: cost of living adjustments (COLAs) are deeply unfair and a bad practice. People doing the same jobs and providing the same value should be paid the same.\n  Until very recently, going fully remote simply was not an option for most people. If you wanted to work at Company X, you had to be based at an office in some giant metro. That was the deal.\n Yet in every software company I’ve worked for, almost everyone’s job could be – and sometimes was – done perfectly well online, remotely. Yes, all of them: product, engineering, design, ops, marketing and more. Even skeptics of remote work know this, deep down. And right now, we are seeing a real-life proof of concept for this fact that everyone has sorta known for a long time. Remote teams work just fine. The doubters have been conclusively proven wrong.\n In other words, the  business justification for employees needing to be in a major metro is collapsing. There are many who may nevertheless  want to live in, say, NYC – but their doing so is not critical, or indeed even connected, to the company’s success. Code does not care where it’s written. Neither do user stories, design mockups or seller enablement decks. If it works in Tempe, it’ll work in Menlo Park, too.\n (Because this is the internet and people love to nitpitck, let me just add that there are some employees who may  actually have a business-related reason to live in a certain geographic area. In particular, I would think of direct client-facing roles, like sales or customer success. They are some rare exceptions to this rule.)\n If the basic rationale for COLA-based compensation is that employees in high-cost metros need more to be made whole, what happens when their employer no longer has a preference? Said another way: the flip side of “why do employees in cheaper areas need as much money” becomes, rather, why does the company need people in San Francisco?\n This question of what people “need” to afford their lifestyle comes up frequently when talking about employees in cheap/expensive locations. This is the wrong way of approaching the question because it’s fraught with unavoidably personal choices. If someone in San Francisco wants to spend a large chunk of their income on living where they do, then that’s great – and their choice. But if a remote (or office-based) employee in San Mateo does the same work as their colleague in Little Rock, why is one’s personal choice rewarded and the other penalized? What if the Little Rock employee has a child and is caring for an elderly parent, and the San Mateo employee is single and unattached? If the question is “need,” why are those circumstances not deemed relevant? In short, making COLA adjustments inevitably makes assumptions, mostly inappropriate, about what individuals “should” do with their money; and deems living in a big city to be a worthy choice while other decisions to be less so.\n  “If everyone is paid a standard salary, those who live in high-income areas would have less discretionary income when compared to their counterparts in lower-income communities.”\n  COLAs are unavoidably a subsidy to someone and a penalty to another based on personal lifestyle choices. Wanting to live in a desirable, high-cost metro should not create a business obligation for your employer. Where you live is, and has always been, a consumption choice. That choice is only drawn in sharper contrast now.\n  The most common argument for using COLAs is that they’re required due to labor supply and demand. Namely: the market-clearing wage varies across different regions, so companies should pay based on local norms. This is the basic approach taken by such fully distributed companies like Gitlab, who helpfully makes their  compensation formula fully transparent.\n The problem with this approach comes from your definition of the “labor supply.” For an HQ-bound company, that labor pool is something like everyone in a 20-mile radius. For a remote company, however, it becomes “the internet.” (Or, for practical purposes, all internet denizens in legal jurisdictions you can hire in. More on that in a moment.) From both sides’ perspectives, the candidate in Fort Wayne is not “competing” just with those in her local area; she’s competing with the one in Memphis and Spokane and Shreveport, too. When the company adjusts  downward to meet a market-clearing level for the candidate’s location, they’re really talking about how much the company can penalize employees and get away with, not what a person in that role deserves. In subsidizing one employee’s geographic preference over another, they’re stating an organizational preference that makes no business sense.\n Some people will see in this model a “race to the bottom.” I do not – I see it as expanding opportunity. If there are people elsewhere who can do a given job perfectly well for less compensation expense, it obviously makes business sense to let them. I can clearly understand why this would freak out a Facebook engineer making half a million a year in Menlo Park. Given the rarified talent required at most remote companies, whatever they wind up paying the person in Bangor or Reno who takes that job will still be a good, high middle-class income.\n  There’s a slippery slope counter-argument here that, taken to its logical conclusion, going fully remote means that good tech jobs will disappear from the U.S. entirely and go overseas. After all, folks in Hyderabad and Kiev and Lagos are just as smart too and could do most of these jobs. Literally since the 1990s, we’ve heard dark warnings that the software development industry was on the verge of offshoring all engineering roles. (Seriously, this was considered a big problem in the late 90s.) But not only has it not happened, but demand for U.S. engineers and other knowledge workers has grown considerably. I think this will continue to be the case. I think there’s something about building products aimed largely at American audiences and companies that makes American employees valuable. For the purposes of remote hiring, national boundaries are meaningfully less porous than state ones, mostly for regulatory and tax issues.\n (From a policymaking perspective, I think it makes sense for U.S. leaders to set up regulatory obstacles to large scale offshoring of high-wage jobs. There are interesting arguments about how globalization has hurt working-class employment in America without offering any alternative model. But that is for a different blog post, and different from the level of analysis of the firm.)\n When it comes to compensation, a lot of Americans would say that  of course it doesn’t make sense to pay Puja in Bangalore or Mustafa in Izmir the same as a product designer in Palo Alto. But in this, I sense a lot of self-interested thinking – Puja and Mustafa probably feel differently. Indeed, if they are providing the same value to the company, I think the right thing to do is to pay them the same wage. If this means that Puja and Mustafa live like kings (/queens), then so be it. Good for them. Paying radically lower wages for offshored teams amounts to penalizing people based on an accident of their birth, which is even less defensible than doing so because of their lifestyle choices.\n Wouldn’t this explode compensation costs? Well, I don’t know. It’ll raise them, sure. But Gitlab, for example, has raised something like half a billion dollars in VC money. They can afford to pay their people. What about Microsoft or IBM or any of the other major companies with hundreds of thousands of employees in low-wage countries making less than their American counterparts? I truly don’t know the answer there. What’s right is right – people should be paid equitably, not on the basis of nationality. There is a purely pragmatic argument that it’s better for, say, Bangalore for lots of people to be paid less than Americans (but still very well by local standards) than for many fewer to be paid U.S. wages. That’s not a question for me to adjudicate. But is it fair? No, it is not.\n  Where there is a defensible business justification for requiring an employee’s location, the employer should pay them a local wage. But if not – and for most software roles, this is the case – then the labor pool has just gotten much wider and deeper than ever before.\n There will be winners and losers as this disruption shakes out over the next several months, and probably years. No one quite knows where we’ll land. But to the extent that a handful of giant coastal metro cities’ stranglehold on lucrative tech company jobs is broken, our society – and industry – will be better for it. Remote working is better for companies and teams. It’s better for employees, families and communities. Not everyone loves remote working, but not everyone likes working in an office, either. (I don’t recall anyone’s personal preference ever mattering before.)\n Remote working isn’t going to crash down on us like a tidal wave. For the foreseeable future, most companies will still be hesitant about it. I am optimistic,  but only guardedly so, about how the COVID crisis will accelerate remote working. I could be wrong, but I think this will advance in small steps, not giant leaps. But here’s what I do know: I wouldn’t want to be holding a long-term commercial real estate lease on a Silicon Valley office park right now.\n      I send out a semi-regular update with the most interesting stuff I&#39;ve read recently, as well as a digest of my own blogging.  Learn more about it and read old issues, or just sign up below. I won&#39;t spam you - promise.\n Leave this field empty if you&#39;re human:", "posttime": "2020-05-23 13:38:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "员工,remote", "title": "向远程员工公平支付薪酬", "title_en": "Paying Remote Employees Fairly", "transed": 1, "url": "http://blairreeves.me/2020/05/22/paying-remote-employees-fairly/", "via": "", "real_tags": ["员工", "remote"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003345, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "给你带来了另一个很棒的释放。这一次整理了一些更不稳定的功能。\n如果您在单个选项卡中运行多个语句，您现在将在结果窗口的左下角看到一个下拉列表，您可以在该下拉列表中看到每个查询的输出。\n表的加载速度要快得多。感谢为这个版本做出贡献的每一个人。敬请关注即将推出的更多精彩功能。：-)", "note_en": "Got another great release for you. This time tidying up some of the more flaky functionality.\n  if you run multiple statements in a single tab, you will now get a dropdown at the bottom-left of the result window that lets you see the output from each query.\n        Table loading is muuuuch quicker.Thanks to everyone who has contributed to this release. Stay tuned for more great upcoming features. :-)", "posttime": "2020-05-23 13:38:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "隧道,tunnels,加载", "title": "BeeKeeper Studio 1.4-SSH隧道、SQL Server和单击", "title_en": "Beekeeper Studio 1.4 – SSH Tunnels, SQL Server, and Clicking", "transed": 1, "url": "https://www.beekeeperstudio.io/blog/release-1.4", "via": "", "real_tags": ["隧道", "tunnels", "加载"]}, {"category": "", "categoryclass": "", "imagename": "78df11877b2a923d76d48822a7c338ce.jpg", "infoid": 1003344, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个模拟游戏的重点是探索通过社会距离和封锁来降低病毒每日传播率的短期努力可能会如何影响感染和死亡。\n此仿真基于SIR模型。使用的隔间是敏感的、暴露的、感染的、康复的和康复的。康复车厢进一步分为三个车厢：非住院车厢、住院车厢和超载车厢。产能过剩的死亡率高于住院的死亡率，而非住院的死亡率则不适用。\n免责声明：这是一个模拟游戏，并不是试图预测冠状病毒。我们不是流行病学家，这不应该用来预测实际病毒的行为。\n在这个国家发现了一种新的病毒。据估计，人们将被感染，导致住院和死亡。疫苗预计在一年内问世。在此之前，你的工作是减缓病毒的传播，挽救尽可能多的生命。你有两种方法来对抗病毒：在整个国家或只在特定的州。小贴士：人们不喜欢别人告诉他们该做什么，如果他们与世隔绝太久，他们可能会违抗命令。\n准备好后，单击开始。祝你好运！\n人们不喜欢别人告诉他们该做什么。在某一时刻，他们会停止倾听。", "note_en": "The point of this simulation game is to explore how infections and deaths might be\r affected by short term efforts to reduce the daily transmission rates of a virus\r by social distancing and lockdown.\n  This simulation is based on the  SIR model. The compartments used\r are Susceptible, Exposed, Infected, Recovering, and Recovered. The Recovering compartment is further broken down into\r three sub-compartments: Non-Hospitalized, Hospitalized, and Over Capacity. Higher death rates are applied to Over Capacity\r than Hospitalized and no death rates are applied to Non-Hospitalized.\n    Disclaimer: This is a simulation game and this is not trying to predict COVID-19. We are not epidemiologists and this should not be used to predict behavior of an actual virus.\n  A novel virus has been detected in the country. It is estimated that   people will become\r infected leading to  \r hospitalizations and  \r deaths.\r A vaccine is expected in one year.  \r Your job is to slow the spread of the virus and save as many lives as possible\r until then. You have two ways to fight the virus:\r  across the entire country or just specific states.  \r Tip: People don&#39;t\r like to be told what to do and they might disobey if they are\r isolated for too long.\n\r\r When you are ready, click Begin. Best of luck to you!\n      People don&#39;t like to be told what to do. At some point\r they will stop listening.", "posttime": "2020-05-23 13:37:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "应对,curve,感染", "title": "弯曲曲线-大流行应对模拟器", "title_en": "Bend the Curve – Pandemic Response Simulator", "transed": 1, "url": "https://jundroo.com/bend-the-curve/", "via": "", "real_tags": ["应对", "curve", "感染"]}, {"category": "", "categoryclass": "", "imagename": "7e88ada4e67d5e98fdbeb8732b22cb20.png", "infoid": 1003343, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，关于工作效率的讨论一直在谈论专注、分心、进入工作流等等。随着冠状病毒的流行，不间断的时间变得更加宝贵。我们中的许多人被迫在一个共享的空间里平衡我们的工作和家庭、健康、学校和爱好。我们的生产力和专注度正在受到影响。\n一直以来，我们每天都会用到一些可以帮助我们的东西。它的电子邮件！\n在你生活中的所有干扰和混乱中，电子邮件是不变的。每个人都有电子邮件，每个电子邮件系统都可以互相发送电子邮件。它可以让我们保持联系，但不需要立即做出回应。你可以在你自己的时间里阅读它，并有空间起草一份深思熟虑的回复。\n当我们争先恐后地适应这种新的工作方式时，我们发现视频会议让人精疲力竭。如果没有面对面的交流，不间断的即时通讯聊天会鼓励肤浅的工作，这会让我们感觉效率低下。\n在办公室里，你可以看到某人是否看起来在忙于其他事情而不打扰他们--或者如果事情紧急就打断他们。如果没有这种意识，一切都会感到同样紧迫。\n任何关注JMAP从最初宣布(2014年)到最终标准化(2019年)的人都知道，电子邮件世界中的事情进展缓慢！这是一件好事。\n人们享受着电子邮件的连续性，日复一日地以完全相同的方式工作。电子邮件是稳定和可靠的，你可以直接完成你的工作。在这个瞬息万变的世界里，稳定更加重要。\n电子邮件的优势恰恰在于它不是立竿见影的。在你自己的时间里处理你的电子邮件是可以的，而且你不必按照递送的顺序来处理它们。每封电子邮件都有自己的未读状态，因此很容易挑选出要处理的即时消息，然后再返回到其他邮件。\n全世界使用电子邮件已有50多年的经验。电子邮件工作流程可以通过强大的概念(如过滤、文件夹和标记或固定)来适应您的需求。\nFastmail是世界上运营时间最长、持续增长的电子邮件公司之一。我们从1995年就开始使用电子邮件了，我们明白永久的重要性，电子邮件是你的电子记忆。我们快速而强大的搜索可以帮助您快速回忆起那些重要的记忆。\n我们也明白不受干扰地工作和保持井井有条的重要性，通过Snooze和VIP联系人，您可以控制何时被新电子邮件打扰。\n我们将继续让您更轻松地控制您的电子邮件，最近推出了更强大的过滤器，现在还在测试版中添加标签！\n如果您还没有使用我们的任何过滤或生产力工具，请不要为此感到压力，但一定要留出时间进行实验。设置一个让您的电子邮件为您工作的工作流程。\n您的时间很宝贵。我们在这里建立一个系统，让你可以进入，按照你自己的时间表处理你的电子邮件，然后继续你的余生。许多网站希望你在上面花更多的时间。我们希望您快速处理电子邮件，并有更多时间处理其他优先事项。\n不要让你的注意力一次只被一个通知偷走。利用电子邮件的优势，在不被淹没的情况下保持消息灵通。", "note_en": "For years, productivity discussions have talked about focus, distractions, getting into the flow, etc., etc. With the coronavirus pandemic, uninterrupted time is even more precious. Many of us are forced to balance our work with home, health, school, and hobbies in one shared space. Our productivity and focus is suffering.\n All along, there’s been something that we use every day, which can help. It&#39;s email!\n  Through all the interruptions and turmoil in your life, email is a constant. Everyone has email, and every email system can email every other. It lets us stay connected, but doesn’t demand an immediate response. You can read it in your own time, and have the space to craft a thoughtful reply.\n As we scramble to adjust to this new way of working, we&#39;re discovering that  video conferences are exhausting. Without in-person communication, the incessant instant messaging chatter encourages  shallow work, which leaves us feeling unproductive.\n  In the office, you can see if someone looks busy with something else and not bother them—or interrupt if it’s urgent. Without that awareness, everything feels equally urgent.\n  Things move slowly in the email world, as anyone following the progress of JMAP from  initial announcement (2014) to  eventual standardization (2019) knows! This is a good thing.\n People enjoy the continuity of email continuing to work exactly the same way, day after day. Email is stable and dependable, and you can just get your job done. In this rapidly shifting world, stability is even more valuable.\n  The advantage of email is precisely that it’s not immediate. It’s ok to deal with your emails on your own time, and you don’t have to process them in order of delivery. Every email has its own unread status, so it’s easy to pick out immediate messages to deal with, and come back to the others later.\n The world has over 50 years of experience with email. Email workflow can adapt to your needs, with powerful concepts like  filtering, folders, and flagging or pinning.\n  Fastmail is one the longest-running, and continually growing, email companies in the world. We’ve been working with email since 1995, and we understand the importance of permanence and of email being  your electronic memory. Our  fast and powerful search helps you quickly recall those important memories.\n We also understand the importance of working without interruption and keeping organized, with  snooze and  VIP contacts giving you control over when you’re interrupted by new email.\n We&#39;re continuing to make it easier for you to be in control of your email, with  more powerful filters launched recently, and  labels in beta now!\n  If you’re not using any of our filtering or productivity tools yet, don’t stress about it, but do set aside time to experiment. Set up a workflow that makes your email work for you.\n Your time is valuable. We’re here building the system lets you get in, deal with your email on your own schedule, and get on with the rest of your life. Many sites want you to spend more time on them. We want you to deal with email quickly and have more time for other priorities.\n Stop your attention being stolen one notification at a time. Take advantage of email to remain well informed without being overwhelmed.", "posttime": "2020-05-23 13:37:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "远程工作,电子邮件,email", "title": "选择电子邮件提高远程工作效率", "title_en": "Choose Email for Remote Productivity", "transed": 1, "url": "https://fastmail.blog/2020/05/22/email-for-remote-productivity/", "via": "", "real_tags": ["远程工作", "电子邮件", "email"]}, {"category": "", "categoryclass": "", "imagename": "5d8b3259ddb7167b8dcb965c6415d1b7.jpg", "infoid": 1003341, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "海平面--永恒不变。在海洋表面有一个微毫米，在海洋和天空之间移动，两者同时存在，两者都不存在。每一种已知的生命形式都与这一层有关。在它的上方，是土地、空气、阳光和肺部的世界。在它下面，是水、深度和压力的世界。你走得越深，就越黑暗，越充满敌意，越不熟悉，越不慎重，越不为人所知。\n去年6月南太平洋的一次水花，标志着那个世界的历史性突破。一台起重机把一个白色的小潜水器从船尾放下来，然后把它扑通一声扔进水里。有一阵子，它在水面上悄悄地上下摆动，它的浮力根据飞行员的重量进行了校准，飞行员是它唯一的乘客。然后他按下开关，潜水艇发出疯狂的、高音的漩涡。电泵将海水吸入一个空房间，将船压得喘不过气来。当水涌入时，水面起泡-然后沉默，因为潜水器的顶部浸入水线以下，海洋吸收了它。\n大多数潜艇下潜几百米，然后横跨；这艘潜艇被设计成像石头一样沉没。它的形状像一个鼓起的公文包，底部有一个突出的灯泡。这就是耐压船体-一个直径5英尺的钛球，它与潜水器的其余部分密封在一起，容纳着飞行员和他的所有控制器。乘客座位下面是一个金枪鱼三明治，飞行员的午餐。他凝视着其中一个视口，凝视着蓝色。到达底部需要近四个小时。\n阳光穿透了最初的1000英尺深的水。这是上层，浮游生物、海藻和珊瑚礁的一层。它包含了海洋植物的整个生态系统，以及哺乳动物和以它们为食的鱼类。一名埃及潜水员曾下潜到这一层的极限。这一壮举需要终生的训练，四年的计划，一支支援潜水员团队，一系列专门的气罐，以及冗长的13个小时的攀登，不停地减压，这样他的血液才不会中毒，他的肺也不会爆炸。\n潜水器以大约每秒2.5英尺的速度下沉。潜水20分钟后，飞行员到达了午夜区域，那里的黑暗水域变成了黑色。唯一的光是微弱的生物发光-来自电凝胶、伪装的虾和带着天然灯笼的有牙齿的捕食者，以吸引不知情的猎物。这些深海的一些鱼没有眼睛--它们有什么用呢？几乎没有什么吃的。午夜地带的条件有利于新陈代谢速度慢、肌肉虚弱、身体粘稠的鱼。\n下降一个小时后，飞行员到达了10000英尺--深海地带的起点。温度总是比冰点高几度，不受地表天气的影响。动物以“海洋雪”为食：上层的死鱼和植物的碎片，轻轻地从水柱中飘落下来。延伸到两万英尺的深海带覆盖了97%的海底。\n在自由落体两个小时后，飞行员进入了哈达尔区域，该区域以希腊冥界之神的名字命名。它是由海沟(地球构造板块边缘的地质伤痕)组成的，虽然它只占海底的一小部分，但却占到了将近50%的深度。\n超过了2.7万英尺，飞行员已经超出了任何一种鱼的理论极限。(它们的细胞在更深的地方坍塌。)。在3.5万英尺后，他开始释放一系列的重量，以减缓他的下降速度。将近7英里的水压在钛球上。如果有任何瑕疵，它可能会立即内爆。\n潜艇触碰了淤泥质的海底，53岁的德克萨斯人维克多·韦斯科沃(Victor Vescovo)成为第一个到达汤加海沟最深处的有血有骨的生物。他驾驶着唯一能把人带到那个深度的潜水器：他自己的潜水器。\n在接下来的一个小时里，他探索了平淡无奇的米色沉积物，并试图找到并收集岩石样本。然后灯在闪烁，警报器响了。Vescovo检查了他的系统-一号电池发生了灾难性的故障。水已经渗入电子设备，带来了一个不太受欢迎的最好的东西：有史以来最深的人工爆炸发生在距离他头部几英尺的地方。\n如果在那个深度有氧气，可能会有一场熊熊大火。取而代之的是，一个电池接线盒熔化了，在外壳上烧了一个洞，没有显示出火焰。由于无法营救，任何恐慌的本能都被压制住了。维斯科沃将不得不自己想办法。\n头顶七英里处，一艘白色的船在波利尼西亚水域上下摆动。它曾由美国海军建造，目的是追捕苏联军用潜艇，最近被重新调整用途，以运输和推出韦斯科沃的私人潜艇。船上有几十名机组人员，他们都是Vescovo雇佣的。他试图成为第一个到达每个大洋最深处的人，这一探险被他称为五个迪普斯(Fiep Deep)，当时他已经进行了一半。他在私募股权领域赚了一大笔钱，但他买不到这方面的成功--一个更有钱的人尝试过，但失败了。当这个想法第一次浮现在他脑海中时，他没有可以租用的车辆，甚至没有来自政府的车辆。没有一位科学家或军方有能力进入他试图探访的深度2英里以内。地质学家甚至不确定他应该潜入哪里。\n维斯科沃的船员是一个不太可能的集合-正如探险队的首席科学家所说，是“一群真正的小偷”-拥有后勤、工程学、学术界和轻微犯罪的背景。船上的一些人在海上呆了几十年，另一些人是陆上驾驶者。在一年多的时间里，他们面临着像恶劣天气一样永恒的挑战，像他们为这项工作发明的设备一样新颖。他们发现了海底山脉，收集了数千个生物样本，发现了数十个新物种，并烧毁了数万加仑的燃料和酒精。\n1969年，当韦斯科沃三岁时，他爬上了母亲的车的前座，这辆车停在他们家门外的小山上。他身材矮小，金发碧眼，是19世纪末来到美国的意大利移民的早熟蓝眼睛孙子，以在南方卖冰激凌为生。维斯科沃把车调到空档。它向后滚到一棵树上，他在重症监护病房度过了接下来的六个星期。有持久的影响：他的右手神经受损，对驾驶复杂车辆的兴趣，以及“折磨人的强迫”，他说，在他死前体验他能体验到的一切。\n他从小看科幻小说长大，渴望成为一名宇航员；他有成绩，但没有视力。在斯坦福大学读本科时，他学会了驾驶飞机。之后，他去了麻省理工学院，攻读国防与军备控制研究的硕士学位，在那里他为决策和风险利益建模，这些利益后来汇聚在重叠的职业生涯中，既是一名后备海军情报官员，也是一名商人。韦斯科沃被部署为科索沃爆炸案的目标官员，作为一名反恐官员，他参与了菲律宾的人质营救行动。他学习阿拉伯语，通过金融和咨询工作致富，后来又通过他居住的达拉斯郊区的一家名为Insight Equity的私募股权公司致富。\n韦斯科沃开始进行越来越复杂的登山探险，到2014年，他已经滑雪了最后100公里到达北极和南极，并登上了每一大洲的最高峰。他在山顶附近的一次山体滑坡中险些幸免于难。位于阿根廷安第斯山脉的阿空加瓜，并逐渐接受了以计算风险为中心的哲学。控制你能控制的；意识到你不能控制的。在某种程度上，死亡是必然的--“你必须接受它，”他说--他推断，一个人能冒的最大风险就是浪费地球上的时间，在没有最大限度地活着的情况下到达终点。“这是对抗死亡的唯一途径，”他说。“我的社交生活几乎不存在，但这不是优先事项。生活太有趣了。“。他把头发留到肩膀，甚至在胡须变白的时候也染上了颜色。周末，他用自己的私人飞机将救援犬运送到美国各地的潜在主人手中。据他的探险队成员说，在海上，他一个人在船舱里呆了几个小时，玩着使命召唤，吃着微波通心粉和奶酪。\n但是，每一个探索的时代都有它自己的路要走。“当沙克尔顿在1914年乘船前往南极时，他仍然可以成为一名英雄。当他在1917年回来时，他不能，“费格斯·弗莱明在欧内斯特·沙克尔顿的日记”南方“的引言中写道。“英雄主义的概念在第一次世界大战的战壕中烟消云散。”当沙克尔顿在南极洲失踪时，他的探险队的一名成员发来电报寻求帮助。温斯顿·丘吉尔回应说：“当所有的伤病员都得到了照顾，当他们所有的贫穷和破碎的家园都得到了重建，当每家医院的钱都充斥着，所有的慈善捐款都被关闭了，那么直到那时。”我很关心这些企鹅。“。\n一个世纪后，冒险家们往往会积累更多毫无意义的第一：从山顶上发一条Snapchat。珠穆朗玛峰；在南极洲，用吊杆旅行的最快英里。但没有限制地开放海洋进行探索-韦斯科沃认为，这是一项有意义的记录，可能是地球上最后一项记录。1961年，约翰·F·肯尼迪说：“海洋知识不仅仅是好奇心的问题。我们的生存可能取决于它。“。然而，在接下来的几十年里，距离美国最近的哈达尔海沟成为了制药废物的垃圾场。\n2014年9月，Vescovo向佛罗里达州维罗比奇的一家小型制造商Triton Submarines发出了询盘。他指出，他是一名喷气式和直升机飞行员，熟悉“复杂飞行器的程序驱动驾驶”，并概述了后来的五次深度探险。\nTriton的总裁帕特里克·莱希在他13岁的时候开始潜水，他发现他在水下的感觉比在陆地上更自在。静默，缓慢而深呼吸的潜水迫使他进入一种冥想状态。“我喜欢失重的感觉，”他告诉我。“我喜欢三维运动，而不是二维运动。”莱希就读于商业潜水学校，学习水坝、桥梁和油气设施的水下焊接和施工。他说：“你可以在水中做的任何事情都可以在水下做。”“你用螺栓固定东西，你切割东西，你把东西焊接在一起，你移动东西，你回收东西。”他补充说，水能导电，有时，“你能感觉到它在牙齿里冒泡。”\n1983年，当他21岁的时候，他进行了他的第一次潜艇潜水，下潜到1400英尺的高度，检查北加州海岸的一个石油钻井平台。他被这一经历深深地影响着--前一个小时深入海底，下个小时浮出水面，“没有任何惩罚性的减压，”他说。到维斯科沃联系他时，莱希已经驾驶了60多艘潜水器进行了数千次潜水。一位与他共事数十年的探险队队长告诉我，他“毫无疑问，是世界上最好的潜水艇驾驶员。”\n莱希于2007年与人共同创立了Triton。商业模式是为亿万富翁建造私人潜水器，其中包括一名俄罗斯寡头和一名中东王室成员。(在第一个订单之前的几年里，莱希在参加船展时经常被嘲笑；现在有一些公司为游艇建造支援船，用来运载直升机、潜艇和其他昂贵的玩具。)。但他更深层次的愿望是让其他人理解，正如赫尔曼·梅尔维尔在“白鲸”中所写的那样，在河流和海洋中，我们看到了“难以捉摸的生命幻影的形象；而这是一切的关键。”在潜水几次之后，莱希的许多客户开始允许他们的车用于科学和拍摄。\n维斯科沃不在乎莱希是否把他用无窗钢球送到海底；他只想到那里去。但莱希拒绝建造任何没有乘客座位的东西，比如科学家；没有用于采集样本的机械手手臂；没有视口的东西，这样乘客就可以享受沉没的感觉。这样的功能会使构建复杂化，甚至可能导致失败。但莱希有一种倾向，在他确定如何实现之前，他倾向于承诺他想要的现实。“这不是一个真正的商业决定，”一位Triton工程师告诉我。“他想要建造这个。放弃不是一种选择。“。莱希将维斯科沃的任务视为开发和测试世界上第一个无限哈达尔探测系统的一种方式-一个可以复制和改进的系统，供科学家使用。\n维斯科沃飞往巴哈马，莱希带他乘坐Triton的旗舰潜水器进行了试潜，该潜水器有三个座位，额定深度为3300英尺。第三个座位被一个30多岁的古怪的英国男子约翰·拉姆齐占据，他似乎不喜欢潜水；他全神贯注于他不喜欢的潜水器-这是他设计的。\n“我从来没有真正对潜艇有过特别的热情，”拉姆齐告诉我，他是Triton的首席潜艇设计师。“我现在仍然不知道，真的。”他真正喜欢的是，他可以设计每台机器的每一个方面，从中央框架到舱门后部优雅的把手。汽车制造商让整个团队设计座椅或挡泥板，然后规模化生产。但几乎每一艘Triton潜艇都是独一无二的；拉姆齐决定了他想要的样子，佛罗里达州的十几个人开始建造。\n拉姆齐在英格兰西南部荒野的一间空余卧室里工作，他从未读过一本关于潜艇的书。“你最终只会完全被你的思维方式玷污，”他说。“我只是想清楚它必须做些什么，然后拿出一个解决方案.”维斯科沃任务的成败在很大程度上掌握在他手中。\n“如果维克多死了，这是你的错，你就得自杀，”他告诉他的妻子卡罗琳。\n潜水员根据压力、浮力和重量来考虑空间和材料。空气上升，电池下沉；为了实现中性浮力-在水下保持悬浮的能力，而不会上升或下降-每个组件必须与其他组件相互抵消。鱼也是如此，它们通过鱼囊的充气和放气来调节它们的浮力。\n拉姆齐的潜艇通常以一个厚厚的丙烯酸球体为中心，本质上是一个气泡；把它释放到水下，它就会弹出水面。但对于维斯科沃的潜水器来说，丙烯酸还不够坚固。在最深的沟渠底部，每平方英寸都要挡住一万六千磅的水--一头站在细高跟鞋上的大象。\n拉姆齐固定在钛上：延展性好，耐腐蚀，强度密度比高。耐压船体将重近8000磅。它将不得不由复合泡沫来平衡，复合泡沫是一种由数百万个空心玻璃球组成的浮力填充物。为了让潜艇保持直立，泡沫必须浮在船体上方，提供向上的升力-就像热气球一样，提供水。拉姆齐解释说：“只要重物悬挂在浮力之下保持平衡，潜艇就会一直保持直立。”\n船体需要将两块钛板锻造成完美的半球。世界上只有一个设施的舱室足够大、足够强大，可以让船体承受与全海洋深度相当的压力，那就是位于俄罗斯圣彼得堡的克里洛夫国家研究中心(Krylov State Research Center)。莱希参加了压力测试。当时没有后备船体；如果发生内爆，该项目将会终止。“但它奏效了--它证实了我们正在做的事情，”莱希告诉我。\n那是2018年仲夏，在南佛罗里达州，Triton的技术人员每天工作15个小时，在一个没有空调的空间里。莱希在车间里走来走去，汗流浃背，试图鼓励他的团队。建造世界上最先进的深潜器的人没有毕业于斯坦福大学或麻省理工学院；他们以前是汽车修理工、潜水教练和水下焊工，因为他们的职业道德和实践经验而被聘用。商店领班过去是一名卡车司机。这位水力学专家在80年代将可卡因运出劳德代尔堡的时候，腹部中了一颗子弹。十几岁时，其中一名电工通过偷汽车收音机来磨练自己的手艺。(“我真的很擅长，”他告诉我。)。拉希则表示，他被联邦政府点名为一起涉及一艘苏联军用潜艇和一个哥伦比亚卡特尔的毒品走私行动中未被起诉的同谋，后来又被宣布无罪。\n维斯科沃潜艇的每一个主要部件都必须从头开始研发。石油和天然气行业已经建立了压力额定在6000米左右的零部件供应链-但这只是所需深度的一半。在组装潜艇之前，Triton团队花了几个月的时间在压力室内爆部件，并向制造商发送反馈。拉姆齐说：“你正在解决以前从未存在过的问题，用以前从未存在过的零件，从不知道如何制造它们的供应商那里。”\n探险队的其余成员在停靠在维罗海滩港口的一艘船上，等待着。Vescovo留在达拉斯的家中，在Triton在他的车库里组装的模拟器上进行训练。在莱希的推荐下，他聘请了探险队队长兼探险联合创始人罗布·麦卡勒姆(Rob McCallum)，为这个原本可能会梦想破灭的项目注入现实主义。\n对于每一个去南极的维斯科沃，都有一个麦卡勒姆确保他活着。(麦卡勒姆去过南极洲128次。)。他对我说：“我喜欢客户走进门来说，‘有人告诉我，这是不可能的，但你怎么看？’”他对我说。“嗯，我认为你刚刚暴露了你的谈判立场。我们喝杯酒好好谈谈吧。“。\n麦卡勒姆身材苗条，但胸部丰满，声音柔和，带有新西兰口音。他在巴布亚新几内亚的热带地区长大，后来成为了一名极地导游。他是一名训练有素的医生、潜水大师、消防员、飞机飞行员和船只操作员，曾是新西兰公园护林员，曾担任挪威海军的顾问。他会说三种新美拉尼西亚语言，可以在16英尺深的海浪中为一艘黄道十二宫船驾驶。他是“泰晤士报”“现代爱情”专栏的主角。(“我父亲警告过我要提防你这样的人，”作者回忆道，不管怎样，在嫁给他之前，他曾这样告诉过他。)。麦卡勒姆和他的同事们发现了几艘备受瞩目的沉船，包括澳大利亚和美国的军舰以及一艘以色列军用潜艇。几个月前，他在他的电脑上向我展示了一个声纳扫描的物体，他认为这就是阿米莉亚·埃尔哈特(Amelia Earhart)的飞机。\n维斯科沃问麦卡勒姆对他有什么要求。“我首先需要的是你把预算增加两倍，”他回答说。他还驳斥了维斯科沃的几个提议，从过时的(船上没有酒精或配偶)到疯狂的(在船头上安装假军事装备；把他的狗带到地球的最深处)。\n五大洋，五深--环游世界，到达两极。麦卡勒姆解释说，探险必须以极地潜水为依托。北冰洋可能的潜水点一年中的大部分时间都被冰覆盖，但有两周的潜水时间。\n..", "note_en": "Sea level—perpetual flux. There is a micromillimetre on the surface of the ocean that moves between sea and sky and is simultaneously both and neither. Every known life-form exists in relation to this layer. Above it, the world of land, air, sunlight, and lungs. Below it, the world of water, depth, and pressure. The deeper you go, the darker, the more hostile, the less familiar, the less measured, the less known.\n  A splash in the South Pacific, last June, marked a historic breach of that world. A crane lowered a small white submersible off the back of a ship and plonked it in the water. For a moment, it bobbed quietly on the surface, its buoyancy calibrated to the weight of the pilot, its only occupant. Then he flipped a switch, and the submarine emitted a frantic, high-pitched whirr. Electric pumps sucked seawater into an empty chamber, weighing the vessel down. The surface frothed as the water poured in—then silence, as the top of the submersible dipped below the waterline, and the ocean absorbed it.\n  Most submarines go down several hundred metres, then across; this one was designed to sink like a stone. It was the shape of a bulging briefcase, with a protruding bulb at the bottom. This was the pressure hull—a titanium sphere, five feet in diameter, which was sealed off from the rest of the submersible and housed the pilot and all his controls. Under the passenger seat was a tuna-fish sandwich, the pilot’s lunch. He gazed out of one of the viewports, into the blue. It would take nearly four hours to reach the bottom.\n  Sunlight cuts through the first thousand feet of water. This is the epipelagic zone, the layer of plankton, kelp, and reefs. It contains the entire ecosystem of marine plants, as well as the mammals and the fish that eat them. An Egyptian diver once descended to the limits of this layer. The feat required a lifetime of training, four years of planning, a team of support divers, an array of specialized air tanks, and a tedious, thirteen-hour ascent, with constant decompression stops, so that his blood would not be poisoned and his lungs would not explode.\n  The submersible dropped at a rate of about two and a half feet per second. Twenty minutes into the dive, the pilot reached the midnight zone, where dark waters turn black. The only light is the dim glow of bioluminescence—from electric jellies, camouflaged shrimp, and toothy predators with natural lanterns to attract unwitting prey. Some fish in these depths have no eyes—what use are they? There is little to eat. Conditions in the midnight zone favor fish with slow metabolic rates, weak muscles, and slimy, gelatinous bodies.\n  An hour into the descent, the pilot reached ten thousand feet—the beginning of the abyssal zone. The temperature is always a few degrees above freezing, and is unaffected by the weather at the surface. Animals feed on “marine snow”: scraps of dead fish and plants from the upper layers, falling gently through the water column. The abyssal zone, which extends to twenty thousand feet, encompasses ninety-seven per cent of the ocean floor.\n  After two hours in free fall, the pilot entered the hadal zone, named for the Greek god of the underworld. It is made up of trenches—geological scars at the edges of the earth’s tectonic plates—and although it composes only a tiny fraction of the ocean floor, it accounts for nearly fifty per cent of the depth.\n Past twenty-seven thousand feet, the pilot had gone beyond the theoretical limit for any kind of fish. (Their cells collapse at greater depths.) After thirty-five thousand feet, he began releasing a series of weights, to slow his descent. Nearly seven miles of water was pressing on the titanium sphere. If there were any imperfections, it could instantly implode.\n  The submarine touched the silty bottom, and the pilot, a fifty-three-year-old Texan named Victor Vescovo, became the first living creature with blood and bones to reach the deepest point in the Tonga Trench. He was piloting the only submersible that can bring a human to that depth: his own.\n  For the next hour, he explored the featureless beige sediment, and tried to find and collect a rock sample. Then the lights flickered, and an alarm went off. Vescovo checked his systems—there was a catastrophic failure in battery one. Water had seeped into the electronics, bringing about a less welcome superlative: the deepest-ever artificial explosion was taking place a few feet from his head.\n  If there were oxygen at that depth, there could have been a raging fire. Instead, a battery junction box melted, burning a hole through its external shell without ever showing a flame. Any instinct to panic was suppressed by the impossibility of rescue. Vescovo would have to come up on his own.\n  Seven miles overhead, a white ship bobbed in Polynesian waters. It had been built by the U.S. Navy to hunt Soviet military submarines, and recently repurposed to transport and launch Vescovo’s private one. There were a couple of dozen crew members on board, all of whom were hired by Vescovo. He was midway through an attempt to become the first person to reach the deepest point in each ocean, an expedition he called the Five Deeps. He had made a fortune in private equity, but he could not buy success in this—a richer man had tried and failed. When the idea first crossed his mind, there was no vehicle to rent, not even from a government. No scientist or military had the capacity to go within two miles of the depths he sought to visit. Geologists weren’t even sure where he should dive.\n  Vescovo’s crew was an unlikely assemblage—“a proper band of thieves,” as the expedition’s chief scientist put it—with backgrounds in logistics, engineering, academia, and petty crime. Some on board had spent decades at sea; others were landlubbers. For more than a year, they faced challenges as timeless as bad weather and as novel as the equipment they had invented for the job. They discovered undersea mountain ranges, collected thousands of biological samples that revealed scores of new species, and burned through tens of thousands of gallons of fuel and alcohol.\n    In 1969, when Vescovo was three years old, he climbed into the front seat of his mother’s car, which was parked on a hill outside their house. He was small and blond, the precocious, blue-eyed grandson of Italian immigrants who had come to the United States in the late nineteenth century and made a life selling gelato in the South. Vescovo put the car in neutral. It rolled backward into a tree, and he spent the next six weeks in an intensive-care unit. There were lasting effects: nerve damage to his right hand, an interest in piloting complex vehicles, and the “torturous compulsion,” he said, to experience everything he could before he died.\n  He grew up reading science fiction, and aspired to be an astronaut; he had the grades but not the eyesight. As an undergraduate, at Stanford, he learned to fly planes. Afterward, he went to M.I.T., for a master’s degree in defense-and-arms-control studies, where he modelled decision-making and risk—interests that later converged in overlapping careers as a Reserve Naval Intelligence officer and a businessman. Vescovo was deployed as a targeting officer for the   bombing of Kosovo, and, as a counterterrorism officer, he was involved in a hostage rescue in the Philippines. He learned Arabic and became rich through finance and consulting jobs, and, later, through a private-equity firm, Insight Equity, in the suburbs of Dallas, where he lives.\n  Vescovo started going on increasingly elaborate mountaineering expeditions, and by 2014 he had skied the last hundred kilometres to the North and South Poles and summited the highest peak on every continent. He had narrowly survived a rock slide near the top of Mt. Aconcagua, in the Argentinean Andes, and had come to embrace a philosophy that centered on calculated risk. Control what you can; be aware of what you cannot. Death, at some point, is a given—“You have to accept it,” he said—and he reasoned that the gravest risk a person could take was to waste time on earth, to reach the end without having maximally lived. “This is the only way to fight against mortality,” he said. “My social life was pretty nonexistent, but it just wasn’t a priority. Life was too interesting.” He grew his hair down to his shoulders, and touched up the color, even as his beard turned white. On weekends, he used his private jet to shuttle rescue dogs to prospective owners all over the U.S. At sea, according to members of his expedition team, he spent hours in his cabin alone, playing Call of Duty and eating microwaved macaroni and cheese.\n  But every age of exploration runs its course. “When Shackleton sailed for the Antarctic in 1914, he could still be a hero. When he returned in 1917 he could not,” Fergus Fleming writes, in his introduction to “ South,” Ernest Shackleton’s diary. “The concept of heroism evaporated in the trenches of the First World War.” While Shackleton was missing in Antarctica, a member of his expedition cabled for help. Winston Churchill responded, “When all the sick and wounded have been tended, when all their impoverished &amp; broken hearted homes have been restored, when every hospital is gorged with money, &amp; every charitable subscription is closed, then &amp; not till then wd. I concern myself with these penguins.”\n  A century later, adventurers tend to accumulate ever more meaningless firsts: a Snapchat from the top of Mt. Everest; in Antarctica, the fastest mile ever travelled on a pogo stick. But to open the oceans for exploration without limit—here was a meaningful record, Vescovo thought, perhaps the last on earth. In 1961, John F. Kennedy said that “knowledge of the oceans is more than a matter of curiosity. Our very survival may hinge upon it.” Yet, in the following decades, the hadal trench nearest to the U.S. became a dumping ground for pharmaceutical waste.\n  In September, 2014, Vescovo sent an inquiry to Triton Submarines, a small manufacturer in Vero Beach, Florida. He noted that he was a jet and helicopter pilot familiar with the “procedure-driven piloting of complex craft,” and outlined what became the Five Deeps Expedition.\n  Patrick Lahey, the president of Triton, took up scuba diving when he was thirteen years old, and discovered that he felt more at home underwater than he did on land. The muted silence, the slow, deep breaths—diving forced him into a kind of meditative state. “I love the feeling of weightlessness,” he told me. “I love moving around in three dimensions, instead of two.” Lahey attended commercial diving school, to learn underwater welding and construction for dams, bridges, and oil-and-gas installations. “Just about anything you might do out of the water you could do underwater,” he said. “You bolt things, you cut things, you weld things together, you move things, you recover things.” Water conducts electricity, and sometimes, he added, “you can feel it fizzing in your teeth.”\n  In 1983, when he was twenty-one, he carried out his first submarine dive, to fourteen hundred feet, to inspect an oil rig off the coast of Northern California. He was profoundly affected by the experience—to go deep one hour and surface the next, with “none of the punitive decompression,” he said. By the time Vescovo contacted him, Lahey had piloted more than sixty submersibles on several thousand dives. An expedition leader who has worked with him for decades told me that he is, “without question, the best submarine pilot in the world.”\n  Lahey co-founded Triton in 2007. The business model was to build private submersibles for billionaires, including a Russian oligarch and a member of a Middle Eastern royal family. (In the years leading up to the first order, Lahey used to be laughed at when he attended boat shows; now there are companies that build support vessels for yachts, to carry helicopters, submarines, and other expensive toys.) But his deeper aspiration was to make other people comprehend, as Herman Melville wrote, in “ Moby-Dick,” that in rivers and oceans we see “the image of the ungraspable phantom of life; and this is the key to it all.” After a few dives, many of Lahey’s clients started allowing their vehicles to be used for science and filming.\n  Vescovo didn’t care if Lahey sent him to the bottom of the ocean in a windowless steel ball; he just wanted to get there. But Lahey declined to build anything that didn’t have a passenger seat, for a scientist; a manipulator arm, for collecting samples; and viewports, so that the occupants could appreciate the sensation of submergence. Such features would complicate the build, possibly to the point of failure. But Lahey has a tendency to promise the reality he wants before he’s sure how to deliver it. “It wasn’t really a business decision,” a Triton engineer told me. “He wanted to build this. Giving up was not an option.” Lahey saw Vescovo’s mission as a way to develop and test the world’s first unlimited hadal exploration system—one that could then be replicated and improved, for scientists.\n    Vescovo flew to the Bahamas, and Lahey took him for a test dive in Triton’s flagship submersible, which has three seats and is rated to a depth of thirty-three hundred feet. The third seat was occupied by an eccentric British man in his thirties, named John Ramsay, who didn’t seem to enjoy the dive; he was preoccupied with what he didn’t like about the submersible—which he had designed.\n  “I never really had a particular passion for submarines,” Ramsay, who is Triton’s chief submarine designer, told me. “I still don’t, really.” What he does love is that he gets to design every aspect of each machine, from the central frame to the elegant handle on the back of the hatch. Car manufacturers have entire teams design a seat or a fender, and then produce it at scale. But nearly every Triton submarine is unique; Ramsay determines how he wants things to be, and a dozen or so men in Florida start building.\n  Ramsay, who works out of a spare bedroom in the wilds of southwest England, has never read a book about submarines. “You would just end up totally tainted in the way you think,” he said. “I just work out what it’s got to do, and then come up with a solution to it.” The success or the failure of Vescovo’s mission would rest largely in his hands.\n  “If Victor dies, and it’s your fault, you’ve got to kill yourself,” he told his wife, Caroline.\n  A submariner thinks of space and materials in terms of pressure, buoyancy, and weight. Air rises, batteries sink; in order to achieve neutral buoyancy—the ability to remain suspended underwater, without rising or falling—each component must be offset against the others. The same is true of fish, which regulate their buoyancy through the inflation and deflation of swim bladders.\n  Ramsay’s submarines typically center on a thick acrylic sphere, essentially a bubble; release it underwater and it will pop right up to the surface. But acrylic was not strong enough for Vescovo’s submersible. At the bottom of the deepest trench, every square inch would have to hold back sixteen thousand pounds of water—an elephant standing on a stiletto heel.\n  Ramsay settled on titanium: malleable and resistant to corrosion, with a high ratio of strength to density. The pressure hull would weigh nearly eight thousand pounds. It would have to be counterbalanced by syntactic foam, a buoyant filler comprising millions of hollow glass spheres. For the submarine to stay upright, the foam would have to go above the hull, providing upward lift—like a hot-air balloon, for water. “As long as the heavy stuff hangs in balance below the buoyant stuff, the sub will always stay upright,” Ramsay explained.\n  The hull required the forging of two slabs of titanium into perfect hemispheres. Only one facility in the world had a chamber that was sufficiently large and powerful to subject the hull to pressures equivalent to those found at full ocean depth: the Krylov State Research Center, in St. Petersburg, Russia. Lahey attended the pressure test. There was no backup hull; an implosion would end the project. “But it worked—it validated what we were doing,” Lahey told me.\n   It was the middle of summer, 2018, in South Florida, and Triton’s technicians were working fifteen hours a day, in a space with no air-conditioning. Lahey paced the workshop, sweating, trying to encourage his team. The men who were building the world’s most advanced deep-diving submersible had not attended Stanford or M.I.T.; they were former car mechanics, scuba instructors, and underwater welders, hired for their work ethic and their practical experience. The shop foreman used to be a truck driver. The hydraulics expert had a bullet in his abdomen, from his days running cocaine out of Fort Lauderdale, in the eighties. One of the electricians honed his craft by stealing car radios, as a teen-ager. (“I was really good at it,” he told me.) Lahey, for his part, said that he was named—and later exonerated—by the federal government as an unindicted co-conspirator in a narcotics-trafficking operation involving a Soviet military submarine and a Colombian cartel.\n  Every major component of Vescovo’s submarine had to be developed from scratch. The oil-and-gas industry had established a supply chain of components that are pressure-rated to around six thousand metres—but that was only half the required depth. Before assembling the submarine, the Triton team spent months imploding parts in a pressure chamber, and sending feedback to the manufacturers. “You’re solving problems that have never existed before, with parts that have never existed before, from venders who don’t know how to make them,” Ramsay said.\n  The rest of the expedition team was on a ship docked in the harbor at Vero Beach, waiting. Vescovo remained at home in Dallas, training on a simulator that Triton had rigged up in his garage. On Lahey’s recommendation, he had hired Rob McCallum, an expedition leader and a co-founder of   Expeditions, to inject realism into a project that might otherwise die a dream.\n  For every Vescovo who goes to the South Pole, there is a McCallum making sure he stays alive. (McCallum has been to Antarctica a hundred and twenty-eight times.) “I love it when clients come through the door and say, ‘I’ve been told this is impossible, but what do you think?’ ” he said to me. “Well, I think you’ve just given away your negotiating position. Let’s have a glass of wine and talk about it.”\n  McCallum—who is trim but barrel-chested, with a soft voice and a Kiwi accent—grew up in the tropics of Papua New Guinea, and became a polar guide. He is a trained medic, dive master, firefighter, aircraft pilot, and boat operator, a former New Zealand park ranger who has served as an adviser to the Norwegian Navy. He speaks three Neo-Melanesian languages, and can pilot a Zodiac boat standing up, in sixteen-foot waves. He is the subject of a “Modern Love” column, in the  Times. (“My father warned me about guys like you,” the author recalls telling him, before  marrying him anyway.) McCallum and his associates have discovered several high-profile shipwrecks, including Australian and American warships and an Israeli military submarine. A few months ago, he showed me on his computer an object on a sonar scan, which he believes to be  Amelia Earhart’s plane.\n  Vescovo asked what McCallum required from him. “The first thing I need is for you to triple the budget,” he replied. He also shot down several of Vescovo’s proposals, from the antiquated (no alcohol or spouses on board) to the insane (installing fake military hardware on the bow; bringing his dog to the deepest point on earth).\n  Five oceans, five deeps—a journey around the world and to both poles. McCallum explained that the expedition would have to be anchored by the polar dives. The likely dive spot in the Arctic Ocean is covered by ice for much of the year, but there is a two-week dive\n......", "posttime": "2020-05-23 13:37:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "feet", "title": "海底3.6万英尺", "title_en": "Thirty-Six Thousand Feet Under the Sea", "transed": 1, "url": "https://www.newyorker.com/magazine/2020/05/18/thirty-six-thousand-feet-under-the-sea", "via": "", "real_tags": ["feet"]}, {"category": "", "categoryclass": "", "imagename": "e98d8df8f2973e682b0a1326bdc0f405.jpg", "infoid": 1003340, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "强大激光的成功测试是海军定向能武器雄心向前迈出的重要一步。\n圣安东尼奥级着陆平台码头波特兰号航空母舰使用其新型激光定向能武器成功击落了一架小型无人机。这艘船于2019年12月离开加州圣地亚哥的母港时首次被发现安装了该系统，战区率先报道了这一情况。\n美国海军太平洋舰队于2020年5月22日宣布测试波特兰的激光武器，正式名称为激光武器系统演示器(LWSD)Mk 2 Mod 0。测试本身于5月16日在太平洋的一个未指明的地点进行。该部门称这是第一次系统级的高能级固态激光器的实施，但没有说明这是否是该船第一次实际发射武器。\n波特兰指挥官、海军上尉卡里·桑德斯(Karrey Sanders)在一份声明中表示，固态激光武器系统演示器是波特兰为海军测试和操作的独特能力，同时也为未来的武器系统铺平了道路。通过对无人机(无人机)和小型飞行器进行先进的海上测试，我们将获得有关固态激光武器系统演示器抵御潜在威胁能力的宝贵信息。\n诺斯罗普·格鲁曼公司(Northrop Grumman)为海军开发了LWSD Mk 2 Mod 0，作为固态激光技术成熟(SSL-TM)计划的一部分，并于2019年底将其交付给圣地亚哥安装在波特兰，战区也率先报道了这一点。该部门曾宣布，圣安东尼奥级舰艇将于2018年率先携带这种激光武器，原计划在2019年9月底之前进行首次海上测试。\n海军预计150千瓦级LWSD Mk2 Mod 0将主要为舰艇提供一条额外的防线，以抵御无人机和小船群。激光还可以起到眩目的作用，使光学传感器和导引头失明。整个系统可以使用自己的集成全动摄像机，用于跟踪目标和瞄准武器，也可以进行监视。\nSSL-TM计划只是海军激光系统家族的四个活跃项目之一，这些系统有望成为未来更强大和更有能力的激光武器的垫脚石。Arleigh Burke级驱逐舰USS Dewey现在还装备了看起来像是光学眩目阻断器海军(ODIN)系统的初始版本，这是战区第一个报道的另一项海军定向能源发展，您可以在上一篇文章中找到更多信息。\n值得注意的是，这不是海军第一次在舰艇上安装作战激光武器系统。美国临时海上基地USS Ponce在2014年至2017年期间部署到中东时携带AN/SEQ-3激光武器系统(LAWS)。诺斯罗普·格鲁曼公司开发了这些定律，以及早期的海上激光演示仪(MLD)，这两个都有助于LWSD Mk 2 Mod 0的开发。这种新型激光武器是150千瓦级的，比15千瓦级的MLD和30千瓦级的AN/SEQ-3威力要大得多。\n有了这一新的先进能力，我们正在重新定义海军的海上战争，波特兰号船长桑德斯说。这次成功的试验对于海军的定向能野心来说无疑是令人兴奋的一步。", "note_en": "The successful test of the powerful laser is a major step forward for the Navy&#39;s directed energy weapons ambitions.\n The  San Antonio class landing platform dock USS  Portland has successfully knocked down a small drone using its new laser directed energy weapon. The ship was first spotted with the system installed as it left its homeport in San Diego California in December 2019, which  The War Zone was first to report.\n  The U.S. Navy&#39;s Pacific Fleet  announced the test of  Portland&#39;s laser weapon, which is formally known as the Laser Weapon System Demonstrator (LWSD) Mk 2 Mod 0, on May 22, 2020. The test itself took place on May 16 at an unspecified location in the Pacific Ocean. The service described the event as &#34;the first system-level implementation of a high-energy class solid-state laser,&#34; but did not say if this was the first time that the ship has actually fired the weapon.\n   &#34;The Solid State Laser Weapons System Demonstrator is a unique capability the  Portland gets to test and operate for the Navy, while paving the way for future weapons systems,&#34; Navy Captain Karrey Sanders,  Portland&#39;s commanding officer, said in a statement. &#34;By conducting advanced at sea tests against UAVs [unmanned aerial vehicles] and small crafts, we will gain valuable information on the capabilities of the Solid State Laser Weapons System Demonstrator against potential threats.&#34;\n   Northrop Grumman developed the LWSD Mk 2 Mod 0 for the Navy as part of the Solid-State Laser Technology Maturation (SSL-TM) program and delivered it to San Diego for installation on  Portland in late 2019, something  The War Zone was also first to report. The service had announced that the  San Antonio class ship would be the first to carry this laser weapon back in 2018 and had originally planned to conduct the first at-sea tests by the end of September 2019.\n  The Navy expects the 150-kilowatt class LWSD Mk 2 Mod 0 to primarily provide ships with an additional line of defense against  unmanned aircraft and  small boat swarms. The laser can also act as a dazzler, blinding optical sensors and seekers. The full system can use its own integrated full-motion video cameras, which are used to track targets and aim the weapon, to conduct surveillance, as well.\n The SSL-TM program is just one of four active programs that the service is working on as part of the Navy Laser Family of Systems, which will hopefully serve as stepping stones to more powerful and otherwise capable laser weapons in the future. The  Arleigh Burke class destroyer USS  Dewey is also now equipped with what looks to be an initial version of the Optical Dazzling Interdictor, Navy (ODIN) system, another naval directed energy development that  The War Zone was first to report on and that you can find out more about  in this past piece.\n  It&#39;s worth noting that this is not the first time the Navy has installed an operational laser weapon system on a ship. The  interim sea base USS  Ponce carried the AN/SEQ-3 Laser Weapon System (LaWS) while deployed to the Middle East between 2014 and 2017. Northrop Grumman developed the LaWS, as well as the earlier Maritime Laser Demonstrator (MLD), both of which helped inform the development of the LWSD Mk 2 Mod 0. Being in the 150-kilowatt class, the new laser weapon is significantly more powerful than the 15-kilowatt-class MLD and the 30-kilowatt-class AN/SEQ-3.\n &#34;With this new advanced capability, we are redefining war at sea for the Navy,&#34; the  Portland&#39;s Captain Sanders said. This successful test is certainly an exciting step forward for the Navy&#39;s directed energy ambitions.", "posttime": "2020-05-23 13:36:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "激光器,warship,海军", "title": "波特兰号两栖军舰用新型高功率激光器击落一架无人机", "title_en": "Amphibious Warship USS Portland Shot Down a Drone with Its New High-Power Laser", "transed": 1, "url": "https://www.thedrive.com/the-war-zone/33634/the-amphibious-warship-uss-portland-has-shot-down-a-drone-with-its-new-high-power-laser", "via": "", "real_tags": ["激光器", "warship", "海军"]}, {"category": "", "categoryclass": "", "imagename": "80f733faadeb48a2d0c4ed6914736d50.png", "infoid": 1003338, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "机密允许您在存储库中存储敏感信息，如访问令牌。现在，通过在组织级别创建机密，您可以轻松地与多个存储库共享、更新和自动同步机密。这通过减少手动复制机密提高了组织的安全性，并降低了因机密过期而导致工作流失败的可能性。\n您可以与您选择的存储库共享组织机密。这减少了跨存储库设置的机密重复，同时允许您将机密仅公开给需要它的存储库。\n您还可以选择与所有存储库或所有专用存储库共享组织机密。向组织添加新资料档案库时，默认情况下，该资料档案库可以访问任何组织机密。\n组织管理员可以更新组织机密的值，并管理哪些存储库有权访问该机密。当管理员轮换机密时，该机密会自动与有权访问它的存储库同步，从而可以轻松地在一个位置管理多个存储库使用的机密。\n我们还更新了存储库机密，存储库所有者现在也可以更新他们的值。\n我们已经为GitHub Actions API提供了组织机密，允许合作伙伴编写自动提供组织机密的集成。\n组织机密可以与任何公共存储库共享，也可以与该组织内属于GitHub Team或Enterprise或GitHub One计划一部分的私人存储库共享。", "note_en": "Secrets allow you to store sensitive information, such as access tokens, in your repository. Now, you can easily share, update, and automatically sync secrets with multiple repositories by creating them at the organization level. This increases security for your organization by reducing manual duplication of secrets, and reduces the likelihood of workflow failure due to an out-of-date secret.\n  You can share organization secrets with the repositories you choose. This reduces duplication of secrets across repository settings, while allowing you to limit the exposure of the secret to just the repositories that require it.\n  You also have the option to share an organization secret with all repositories or all private repositories. When a new repository is added to the organization, it has access to any organization secret by default\n  Organization admins can update the value of organization secrets, as well as manage which repositories have access to that secret. When the admin rotates the secret, that secret automatically syncs with repositories that have access to it, making it easy to manage secrets used by multiple repositories in one place.\n We’ve updated repository secrets as well, and repository owners can now update their values, too.\n   We’ve made organization secrets available for the GitHub Actions API, allowing partners to write integrations that automatically provision organization secrets.\n Organization secrets can be shared with any public repository, and to private repositories within that organization that are part of a GitHub Team or Enterprise, or GitHub One plan.", "posttime": "2020-05-23 13:36:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机密,secrets", "title": "将您的机密与组织机密保持跨多个存储库同步", "title_en": "Keep your secrets synced across multiple repositories with organization secrets", "transed": 1, "url": "https://github.blog/2020-05-22-keep-your-secrets-synced-across-multiple-repositories-with-organization-secrets/", "via": "", "real_tags": ["机密", "secrets"]}, {"category": "", "categoryclass": "", "imagename": "630c90e19854b58c2c13198e732b67a9.jpg", "infoid": 1003337, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司在给The Verge的电子邮件中证实，Gitch周四解雇了“相当数量的员工”，以努力削减成本并确保“长期生存能力”.。Gitch表示，由于市场状况，它不得不“大幅削减运营成本”。\n据两名要求匿名的前员工称，至少有18人被解雇。消息人士称，Gitch在裁员前约有50名员工。格林奇拒绝就有多少员工被裁员发表评论。该公司表示，它正在为被解雇的员工提供“遣散费、医疗保险和寻找新工作的支持”。\nGitch执行长Anil Dash在推特上表示，裁员是因为“在艰难的经济环境下，身处竞争激烈的小公司”.。\n这周我们在格林奇进行了裁员。背景正如你所预期的那样：我们是一家小公司，在艰难的经济形势下，我们处于竞争激烈的领域。但这些优秀的人做了非常有价值的工作，我们整个团队和社区都很感激。\n-Anil Dash(@anildash)2020年5月22日。\nGitch是一个编码平台，于2017年推出，当时名为Fog Creek Software。该平台有一个古怪的外观，并强调其易用性-任何人都应该能够跳进去，重新混合其他人的代码，并启动一个将在Gitch的服务器上运行的小应用程序。\n不过，在过去的三年里，这项服务几乎都是完全免费的。直到一个月前，也就是疫情爆发大约一个月后，故障才推出了一项订阅服务，为用户提供每月支付10美元来扩展功能的能力。据两位消息人士透露，这项服务起步缓慢，其中一位称此次发布“平淡无奇”。\n今年3月，格林奇的员工投票决定在美国通信工人协会(Communications Workers Of America)的领导下成立一个工会，使他们成为首批组织起来的科技公司之一。格林奇同意自愿承认工会，但工会尚未与该公司谈判合同。The Verge已经联系工会请其置评。\n2018年，Gitch筹集了3000万美元的资金。该公司表示，这笔资金将使该公司能够“建立符合其雄心勃勃的愿景的平台和社区”。", "note_en": "Glitch laid off “a substantial number of employees” on Thursday in an effort to cut costs and ensure “long term viability,” the company confirmed in an email to  The Verge. Glitch said it had to “significantly cut operating costs” due to market conditions.\n At least 18 people were laid off, according to two former employees who asked to remain anonymous. Glitch had about 50 employees before the layoffs, the sources said. Glitch declined to comment on how many employees were laid off. The company said it is offering “severance, health insurance, and support in finding new employment” to employees who were laid off.\n Glitch CEO Anil Dash tweeted that the layoffs came as a result of being a “small company in a fiercely competitive space in a tough economy.”\n We had layoffs at Glitch this week. The context is what you’d expect: we are a small company in a fiercely competitive space in a tough economy. But these good people have done immensely valuable work that our entire team and community are grateful for.\n— Anil Dash (@anildash)  May 22, 2020\n Glitch is a coding platform that  launched in 2017 under what was then known as Fog Creek Software. The platform has a quirky look and emphasizes its ease of use — anyone is supposed to be able to jump in, remix someone else’s code, and launch a bite-sized app that will run on Glitch’s servers.\n The service has been completely free to use nearly all of the past three years, though. It wasn’t until one month ago — about a month into the pandemic — that  Glitch launched a subscription service, offering users the ability to pay $10 per month for expanded capabilities. The service had a slow start, according to both sources, with one describing the launch as “underwhelming.”\n In March, Glitch employees voted to form a union under the Communications Workers of America, making them one of the first tech companies to organize. Glitch agreed to voluntarily recognize the union, but the union had not yet negotiated a contract with the company.  The Verge has reached out to the union for comment.\n Glitch raised $30 million in funding in 2018. It said the funding would allow the company to “build the kind of platform and community that fits” its ambitious vision.", "posttime": "2020-05-23 13:35:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "裁员,lays,员工", "title": "小故障裁员“大量员工”以削减成本", "title_en": "Glitch lays off ‘substantial number of employees’ to cut costs", "transed": 1, "url": "https://www.theverge.com/2020/5/22/21268007/glitch-layoffs-substantial-number-coding-platform-union", "via": "", "real_tags": ["裁员", "lays", "员工"]}, {"category": "", "categoryclass": "", "imagename": "74999c26c25af8b626b9bfa9ba6859f8.jpg", "infoid": 1003336, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "阴影常常与黑暗和不确定性联系在一起。现在，NUS的研究人员通过展示一种利用这种常见但经常被忽视的光学效应来发电的方法，给阴影带来了积极的旋转。这一新颖的概念为电力电子在室内照明条件下产生绿色能源开辟了新的途径。\n来自NUS材料科学与工程以及NUS物理的一个团队创造了一种名为阴影效应能量发生器(SEG)的设备，它利用照明区和阴影区之间的照明对比度来发电。他们的研究突破于2020年4月15日发表在科学期刊“能源与环境科学”(Energy&Amp；Environmental Science)上。\n“影子无处不在，我们常常认为它们是理所当然的。在使用稳定光源为器件供电的传统光伏或光电应用中，阴影的存在是不希望的，因为它降低了器件的性能。在这项工作中，我们利用阴影造成的照明对比度作为一种间接的能量来源。照明中的对比度在阴影部分和照明部分之间感应电压差，从而产生电流。这种在阴影下收集能量的新概念是史无前例的，“研究小组组长、来自国立大学材料科学与工程学院的助理教授谭瑞清解释说。\n智能手机、智能眼镜和电子手表等移动电子设备需要高效、持续的电源供应。由于这些设备在室内和室外都可以佩戴，可以利用环境光的可穿戴电源可能会提高这些设备的多功能性。虽然商用太阳能电池可以在室外环境中发挥这一作用，但在阴影持续存在的室内条件下，它们的能量收集效率会显著下降。这种从与低光强相关的照明和阴影中清除能量的新方法既令人兴奋又及时，从而最大限度地提高能量收集的效率。\n为了应对这一技术挑战，NUS团队开发了一种低成本、易于制造的SEG，以执行两项功能：(1)将照明对比度从部分阴影投射转化为电能，(2)用作自供电的接近传感器来监控经过的对象。\nSEG包括布置在柔性透明塑料膜上的一组SEG电池。每个SEG单元都是沉积在硅片上的一层金薄膜。经过精心设计，与商用硅太阳能电池相比，SEG的制造成本更低。研究小组随后进行了实验，以测试SEG在发电和作为自供电传感器方面的性能。\n“当整个SEG电池处于照明或阴影下时，产生的电量很低或根本没有。当SEG单元的一部分被照亮时，检测到显著的电输出。我们还发现，发电的最佳表面积是当SEG电池的一半发光，另一半在阴影下，因为这样就有足够的面积分别产生和收集电荷，“来自NUS物理的联合团队负责人Andrew Wee教授说。\n基于实验室实验，该团队的四电池SEG在阴影移动的影响下，与商用硅太阳能电池相比，效率是商业硅太阳能电池的两倍。在室内照明条件下产生阴影的情况下，从SEG获得的能量足以为一块数字手表供电(即1.2V)。\n此外，该研究小组还表明，SEG可以作为监测移动物体的自供电传感器。当物体经过SEG时，它会在设备上投下间歇性的阴影，并触发传感器记录物体的存在和移动。\n这个由六名成员组成的团队花了四个月的时间来构思、开发和完善设备的性能。在下一阶段的研究中，NUS团队将试验黄金以外的其他材料，以降低SEG的成本。\nNUS的研究人员还在研究开发具有多功能的自供电传感器，以及连接到衣服上的可穿戴式传感器，以便在正常的日常活动中收集能量。另一个有前途的研究领域是开发低成本的SEG电池板，以有效地从室内照明中获取能量。\n喜欢这个故事吗？你可以加入NUS新闻电报频道，或者注册电子邮件时事通讯频道，定期更新。", "note_en": "Shadows are often associated with darkness and uncertainty. Now, NUS researchers are giving shadows a positive spin by demonstrating a way to harness this common but often overlooked optical effect to generate electricity. This novel concept opens up new approaches in generating green energy under indoor lighting conditions to power electronics.\n  A team from  NUS Materials Science and Engineering as well as  NUS Physics created a device called a shadow-effect energy generator (SEG), which makes use of the contrast in illumination between lit and shadowed areas to generate electricity. Their research breakthrough was reported in the scientific journal   Energy &amp; Environmental Science on 15 April 2020.\n  “Shadows are omnipresent, and we often take them for granted. In conventional photovoltaic or optoelectronic applications where a steady source of light is used to power devices, the presence of shadows is undesirable, since it degrades the performance of devices. In this work, we capitalised on the illumination contrast caused by shadows as an indirect source of power. The contrast in illumination induces a voltage difference between the shadow and illuminated sections, resulting in an electric current. This novel concept of harvesting energy in the presence of shadows is unprecedented,” explained research team leader Assistant Professor Tan Swee Ching, who is from NUS Materials Science and Engineering.\n  Mobile electronic devices such as smart phones, smart glasses and e-watches require efficient and continuous power supply. As these devices are worn both indoors and outdoors, wearable power sources that could harness ambient light can potentially improve the versatility of these devices. While commercially available solar cells can perform this role in an outdoor environment, their energy harvesting efficiency drops significantly under indoor conditions where shadows are persistent. This new approach to scavenge energy from both illumination and shadows associated with low light intensities to maximise the efficiency of energy harvesting is both exciting and timely.\n  To address this technological challenge, the NUS team developed a low-cost, easy-to-fabricate SEG to perform two functions: (1) to convert illumination contrast from partial shadows castings into electricity, and (2) to serve as a self-powered proximity sensor to monitor passing objects.\n    The SEG comprises a set of SEG cells arranged on a flexible and transparent plastic film. Each SEG cell is a thin film of gold deposited on a silicon wafer. Carefully designed, the SEG can be fabricated at a lower cost compared to commercial silicon solar cells. The team then conducted experiments to test the performance of the SEG in generating electricity and as a self-powered sensor.\n  “When the whole SEG cell is under illumination or in shadow, the amount of electricity generated is very low or none at all. When a part of the SEG cell is illuminated, a significant electrical output is detected. We also found that the optimum surface area for electricity generation is when half of the SEG cell is illuminated and the other half in shadow, as this gives enough area for charge generation and collection respectively,” said co-team leader Professor Andrew Wee, who is from NUS Physics.\n  Based on laboratory experiments, the team’s four-cell SEG is twice as efficient when compared with commercial silicon solar cells, under the effect of shifting shadows. The harvested energy from the SEG in the presence of shadows created under indoor lighting conditions is sufficient to power a digital watch (i.e. 1.2 V).\n  In addition, the team also showed that the SEG can serve as a self-powered sensor for monitoring moving objects. When an object passes by the SEG, it casts an intermittent shadow on the device and triggers the sensor to record the presence and movement of the object.\n    The six-member team took four months to conceptualise, develop and perfect the performance of the device. In the next phase of research, the NUS team will experiment with other materials, besides gold, to reduce the cost of the SEG.\n  The NUS researchers are also looking at developing self-powered sensors with versatile functionalities, as well as wearable SEGs attached to clothing to harvest energy during normal daily activities. Another promising area of research is the development of low-cost SEG panels for efficient harvesting of energy from indoor lighting.\n      Like this story?  Join the NUS News Telegram channel or  sign up for the email newsletter for regular updates .", "posttime": "2020-05-23 13:35:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "影子,effect,seg", "title": "利用“影子效应”发电", "title_en": "Using the ‘shadow-effect’ to generate electricity", "transed": 1, "url": "https://news.nus.edu.sg/research/using-shadow-effect-generate-electricity", "via": "", "real_tags": ["影子", "effect", "seg"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003335, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PI 4上用于USB大容量存储引导的测试版固件和引导加载程序现已面市。文档和设置说明在引导加载程序配置页面上，请阅读。这是测试版。如果您对手动固件更新感到不舒服，请等待标准版本提供此更新。不会很久的！https://www.raspberrypi.org/documentati._config.md一般互操作性报告应发布在论坛上。RPI-EEPROM问题模板已更新，以指明错误报告中需要哪些类型的日志。迷你如何使用USB卡读卡器：-选择Beta引导加载器并使用rpi-eeprom-update-d-f进行更新(需要新的配置设置)。\n弹出SD卡并使用USB读卡器引导，而不是直接引导SD。\nUSB SD卡读卡器通常比直接从卡启动性能更差，但这是一个有用的快速测试。注意：测试版的标准是没有任何退步和足够的USB笔驱动程序、固态硬盘+鼠标+键盘+供电集线器工作，即普通的台式机配置。具有更复杂设置的错误将在通常的增量版本中修复。不管怎样，代码发布了，该运行了(字面意思)。玩得开心!。\n太棒了！我专门为此预留了一个USB 3.0固态硬盘盘柜。快速问题：与SD卡相比，您期望的存储和引导性能如何？有什么我可以运行的有用的性能指标吗？\nBomblord写道：↑太棒了！我专门为此预留了一个USB 3.0固态硬盘盘柜。快速问题：与SD卡相比，您期望的存储和引导性能如何？有什么我可以运行的有用的性能指标吗？\n引导速度可能要快一些，对于大内核(例如，64位内核未压缩)或initramfs来说可能最明显，但一些SSD的初始化时间可能会更长。与SDHCI相比，初始化xHC控制器还有大约0.5秒的开销。也就是说，吞吐量很高，但有一些固定的管理费用。Linux有自己的USB3xHC堆栈，所以如果您已经将SSD用于rootfs，那么它不会改变，但至少在Raspbian上，systemd和X启动是启动的最大部分。\nUSB SD卡读卡器的性能通常比直接从卡启动差，但这是一个有用的快速测试。\n那么，如果我在完成入围列表后将SD卡映像重新刻录到USB3拇指驱动器上，这应该也能正常工作，对吧？\n干得好。没有启动介质的启动闪屏调试显示中出现较小的拼写错误.。USBMSD在10000秒后超时，我猜这应该是从SD卡启动，通过USB2.0或3.0.插入Poundland Signalex USB2.0多槽SDHC读卡器中。很完美，从最初的测试来看。\ntimg236写道：↑PI4上用于USB海量存储引导的测试版固件和引导加载程序现已面市。..。[*]弹出SD卡并使用USB读卡器引导，而不是直接引导SD。[/列表].。不管怎样，代码发布了，该运行了(字面意思)。玩得开心!。\n`+oooooooo00：`+ooooooooooo：-/ooooo++//ooooo：ooooo+//+ooooo。操作系统：Raspbian GNU/Linux 10(Buster)armv7l`+oooooo：-：oo-+o+：：/oooooo：host：raspberry Pi 4 Model B Rev 1.1`：ooooooo+``.ooooooo+-内核：5.4.42-v7l+`：++ooo/。：+ooo+/.`正常运行时间：2分钟.``.-.``.。套餐：2575(Dpkg).：-``：.`-：：-`shell：Bash 5.0.3-：-`.：-``-：-`解析：2560x1440`：：`.--.`.-.``.：`DE：LXDE.：`-：``WM：Openbox.：：`.：-`：``：``。主题：Adwaita[GTK3]-：`：。：.`：-Icons：Adwaita[GTK3]：-：。`-：终端：lxTerminal-：：-.-：-.``.``.-：：-。-：：-终端字体：等宽10.。``.：。`..`..。CPU：BCM2711(4)@1.500 GHz-：-`-：`内存：320MiB/3744MiB：`-：`：.：-：。：`-：`..--.`：。`.``.--..`.`.：`.-：-`。\n尝试从旧的USB卡读卡器引导(第一次尝试)未成功。\n干得好，覆盆子圆周率队。当我将固态硬盘插入USB2.0时，这里看起来都很好，但USB3.0端口却没有什么乐趣。快速互联网搜索https://jamesachambers.com/raspberry-pi.。SH-DRIVES/建议这可能是我的军刀USB/SATA电缆。会拿到一个不同的品牌，看看会不会有什么不同。\n最后一次编辑时间为2020年5月20日星期三下午2：18，共编辑1次。\n感谢您让它正常工作(主要是)我从SD卡运行RPI-UPDATE以提取ELF和DAT文件时遇到错误，如下所示：[电子邮件受保护]：~$sudo RPI-UPDATE BRANCH=msd-boot*Raspberry PI固件更新程序由Hexxeh提供，由Andrews和Dom增强*执行自我更新*更新后重新启动*Raspberry Pi固件更新程序由Hexxeh提供，由Andrews和Dom增强。我看不到MSD-BOOT分支。我猜MSD-BOOT还没有上市吧？问候！杰伊。\n我已经对它进行了测试，所以更新到了新的测试版Pieprom，并安装了最新的固件。在没有任何microSD卡的情况下，USB 3.0端口的引导似乎工作得非常好，速度也非常快。UAS和TRIM处于活动状态，因此没有负面影响。我的USB转SATA适配器是ASMedia1351，2TB硬盘有一个带有混合MBR的GPT分区表。\n@jr3us也许是不带参数的RPI更新，就像第一篇文章中的迷你指南所建议的那样？\n最后一次编辑时间为2020年5月20日星期三下午2：24分，共编辑1次。\n我在GitHub上做了一些调查，但我没有看到MSD-boot分支。我猜MSD-BOOT还没有上市吧？\n我用了引导文件夹里的那些。它们刚刚更新过，所以我以为就是它们了。工作得很好。\n肯德克写道：↑我已经测试过了，所以更新到了新的测试版Pieprom，并安装了最新的固件。在没有任何microSD卡的情况下，USB 3.0端口的引导似乎工作得非常好，速度也非常快。UAS和TRIM处于活动状态，因此没有负面影响。我的USB转SATA适配器是ASMedia1351，2TB硬盘有一个带有混合MBR的GPT分区表。\n在运行rpi-update时，是否使用了BRANCH=msd-boot？我看到您使用的链接在主分支中。问候！杰伊。\njr3us写道：↑当您运行rpi-update时，您是否使用了BRANCH=msd-boot？我看到您使用的链接在主分支中。\n我的操作系统是带有自定义内核的自定义Ubuntu20.04。因此，我只是将文件下载到/boot目录中。\n汉索顿写道：↑@jr3us，也许像第一篇帖子中的迷你指南所建议的那样，是一个没有参数的rpi-update？\n这个修好了，谢谢！看起来MSD-BOOT已经迁移到MASTER了。我正在使用这里链接的说明：usb._config.md谢谢你的hintl，我的https://www.raspberrypi.org/documentati引导现在可以工作了！问候！杰伊。\n分支昨天切换为主分支，以避免需要特殊分支文件.1553/https://github.com/raspberrypi/document。\ntimg236写道：昨日分支切换为主分支，以避免需要特殊分支https://github.com/raspberrypi/document.1553/↑。\n有人需要更新分支._config.md，因为它在几个地方仍然显示https://www.raspberrypi.org/documentati=msd-boot。\nhttps://github.com/raspberrypi/document写道：↑timg236写道：↑昨天分支切换为主分支，以避免需要特殊分支Trejan.1553/Files。\n有人需要更新分支._config.md，因为它在几个地方仍然显示https://www.raspberrypi.org/documentati=msd-boot。\n这是自动发生的，但是脚本运行和内容缓存更新会有一些延迟。\n测试了Raspbian w/Desktop下的Beta固件和引导程序EEPROM，在PI 4B 4 GB上使用Kingston USB 3多卡读卡器(FCR-HS4)中的Micro SD卡-与Micro SD卡插槽中的Micro SD卡和使用黑色覆盆子PI品牌适配器的SD卡插槽配合正常工作。已在PI上的所有4个USB端口中测试。USB 3端口，USB 2端口为正式PI鼠标和戴尔键盘；USB 2端口为USB 3端口，鼠标和键盘为USB 3端口。都在工作。在HDMI 0上显示。使用SD卡复制器将卡复制到2.5&#34；Startech.com盘柜(S2510BMU33)中的160 GB日立硬盘(从旧笔记本电脑)，并设置了新分区UUIDs&#39；选项。关机，断开电源和USB多卡读卡器，重新通电，PI已从硬盘正确启动。已测试重新启动-正常。已在两个USB 3端口中测试-正常。已测试HDMI 1上的单显示器-正常。注：硬盘和固态硬盘可能需要通过通电集线器连接。使用通过通电的USB 2.0集线器(D-Link DUB-H7 B1)连接的硬盘盘柜进行了快速测试-似乎工作正常。\n最后一次编辑时间为2020年5月20日周三下午3：39，共编辑2次。\nhttps://github.com/raspberrypi/document写道：↑Trejan写到：↑timg236写到：↑昨天分支切换为主分支以避免需要特殊分支timg.1553/files.。\n有人需要更新分支._config.md，因为它在几个地方仍然显示https://www.raspberrypi.org/documentati=msd-boot。\n这是自动发生的，但是脚本运行和内容缓存更新会有一些延迟。\n在raspbercrypi.org上似乎是最新的。如果您仍然看到旧版本的页面，请按键盘上的CTRL+F5，这将强制浏览器返回服务器获取页面，而不管服务器是否告诉它页面没有更改。\n这只是一个小细节，但是使用15/05/20的EEPROM镜像时，我最初无法让USB引导工作，因为引导顺序是0xF21，而不是Bootload配置页面上描述的0xF41。但是，将配置转储到文本文件时，引导顺序列为0xF41。将配置重写到EEPROM似乎也没有达到预期的效果-用0xF41的引导顺序重写配置一开始不起作用-我必须先将其更改为不同的值，然后再改回0xF41才能起作用。\n我执行了以下步骤来更新用于从USB引导的RPi4：1.使用定义的步骤更新EEPROM。2.通过写入新镜像创建USB驱动器。以下步骤为RPi4创建了一个USB可引导设备(我使用了SanDisk 128 GB USB3Ultra Lite Boot a Raspberry pi 3，(使用上面新鲜USB的Raspberry pi 3。3.sudo apt update&amp；&amp；sudo apt Full-Upgrade 4.rpi-update#这将安装RPI 4.5所需的更新后的*.elf和*.dat文件。5.重新启动，让RPI 3返回桌面。6.关闭RPI 3.7。7.将USB从RPI 3移出，并使用它从USB3端口引导RPI 4。成功！\nMarko73写道：↑只是一个小细节，但是使用15/05/20的EEPROM镜像，我最初无法启动USB，因为启动顺序是0xF21，而不是Bootload配置页面上描述的0xF41。但是，将配置转储到文本文件时，引导顺序列为0xF41。将配置重写到EEPROM似乎也没有达到预期的效果-用0xF41的引导顺序重写配置一开始不起作用-我必须先将其更改为不同的值，然后再改回0xF41才能起作用。\n听起来您可能是通过不同的途径获得EEPROM映像的。不同的发行版？\n也有raspi-config选项在工程中，它将提供一个简单的引导顺序配置选择SD/网络或SD/USB-MSD。https://github.com/RPi-Distro/raspi-con..。spi-config这应该可以帮助任何想要开始网络引导的人，例如PiServer。注意：它不是用于编辑引导加载程序配置的GUI，它是更高级别的配置选择。\ngeev03写道：usb timg236写道：↑↑PI4上用于大容量存储引导的测试版固件和引导加载程序现已面市。..。[*]弹出SD卡并使用USB读卡器引导，而不是直接引导SD。[/列表].。不管怎样，代码发布了，该运行了(字面意思)。玩得开心!。\n`+oooooooo00：`+ooooooooooo：-/ooooo++//ooooo：ooooo+//+ooooo。操作系统：Raspbian GNU/Linux 10(Buster)armv7l`+oooooo：-：oo-+o+：：/oooooo：host：raspberry Pi 4 Model B Rev 1.1`：ooooooo+``.ooooooo+-内核：5.4.42-v7l+`：++ooo/。：+ooo+/.`正常运行时间：2分钟.``.-.``.。套餐：2575(Dpkg).：-``：.`-：：-`shell：Bash 5.0.3-：-`.：-``-：-`解析：2560x1440`：：`.--.`.-.``.：`DE：LXDE.：`-：``WM：Openbox.：：`.：-`：``：``。主题：Adwaita[GTK3]-：`：。：.`：-Icons：Adwaita[GTK3]：-：。`-：终端：lxTerminal-：：-.-：-.``.``.-：：-。-：：-终端字体：等宽10.。``.：。`..`..。CPU：BCM2711(4)@1.500 GHz-：-`-：`内存：320MiB/3744MiB：`-：`：.：-：。：`-：`..--.`：。`.``.--..`.`.：`.-：-`。\n尝试从旧的USB卡读卡器引导(第一次尝试)未成功。\n除了一张很不错的覆盆子的大照片外，它完全没有告诉我们任何关于你的USB硬件，引导加载程序版本，你采取了什么步骤，或者它以什么方式不起作用。\n我设法找到了一台如果连接了USB启动就会损坏的设备。我有一对Startech.com 3.5&34；HDD盘柜(S3510BMU33)，它们是单驱动器盘柜。我每个都有一个1TB的硬盘，目前组成了一个ZFS池，我已经成功地与Raspbian以及现在的Ubuntu20.04arm64一起使用了这个池。为了测试USB MSD引导，我关闭了该PI、集线器和机箱的电源，然后将集线器和两个机箱连接到我的测试用的PI 4B 4 GB(与从其他USB MSD设备引导的那个相同)。当引导加载程序进入检查驱动器的LUN 0阶段时，我发现引导加载程序一致挂起。我试过将设备超时时间从2000毫秒延长到7000毫秒，但没有什么不同。驱动器开始旋转，但引导加载程序在&#39；LUN 0&#39；处停滞。Startech盘柜具有VID：PID 174c：1053，这是一个通用ASM1053 ID。桥接芯片上写着ASM1053。由于某些原因，引导加载程序在尝试与此驱动器通信时挂起。我可以从另一个硬盘(在正常工作的2.5&34；盘柜中)启动，但如果在启动时连接了非正常工作的3.5&34；盘柜，则引导加载程序总是挂起。我已尝试将盘柜连接到USB 2集线器和USB 3集线器，使用不同的驱动器和盘柜(2.5和#34；日立硬盘，盘柜桥接器174C：1153，ASM1153E)可以正常启动USB MSD。两个有问题的驱动器存储模块和工作正常的存储模块连接的屏幕截图，所有这些都通过HUB：https://drive.google.com/file/d/1qvkYpd.。SP=仅与通过集线器https://drive.google.com/file/d/1_lGwHV连接的一个有问题的盘柜共享屏幕截图.。SP=共享我有跳线电缆，以便连接到另一台机器上，这样我就可以从串行端口进行调试(我似乎丢失了以前使用PI 1的那些电缆)。我还将介绍如何设置网络调试输出。", "note_en": "The beta firmware and bootloader for USB mass storage boot on Pi 4 are now available.   Documentation and setup instructions are on the bootloader configuration page, please read it.    This is a beta release. If you aren&#39;t already comfortable with manual firmware updates then please wait until this is available in a standard release. It won&#39;t be very long!   https://www.raspberrypi.org/documentati ... _config.md  General interoperability reports should be posted on the forums. The rpi-eeprom issue template has been updated to indicate what sort of logs will be required in bug reports.   Mini-HOWTO if you have a USB card reader:-   Select beta bootloader and use rpi-eeprom-update -d -f to update it (the new configuration settings are required)\n  Eject the SD card and boot using USB card reader instead of direct SD boot.\nUSB sd-card readers will generally give worse performance than booting from the card directly but it&#39;s a useful quick test.  N.B. The &#39;pass&#39; criteria for the beta is no regressions and enough USB pen-drivers, SSDs + mouse + keyboard + powered hub working i.e. usual desktop configurations. Bugs with more complicated setups will be fixed in the usual incremental releases.  Anyway, code released, time to run (literally). Have fun!\n    Awesome! I have a USB 3.0 SSD enclosure set aside specifically for this. Quick question how do you expect the storage and boot performance to compare to an SD card? Any useful performance metrics I could run?\n    bomblord wrote:  ↑ Awesome! I have a USB 3.0 SSD enclosure set aside specifically for this. Quick question how do you expect the storage and boot performance to compare to an SD card? Any useful performance metrics I could run?\nMaybe a bit faster to boot, probably most noticeable with large kernels (e.g. the 64 bit kernel is not compressed) or initramfs but some SSDs can take longer to initialise. There is also about a 0.5 second overhead in initialising the xHC controller compared to the SDHCI.  i.e Throughput is high but there are some fixed overheads.  Linux has it&#39;s own USB3 xHC stack so that won&#39;t change if you already use an SSD for rootfs but at least on Raspbian the systemd and X startup is the largest part of boot.\n    USB sd-card readers will generally give worse performance than booting from the card directly but it&#39;s a useful quick test\nSo then, if I re-burn the SD card image to a USB3 thumbdrive after having done the short list, this should work too right?\n    Excellent work. Minor typo in the boot splash screen debug display with no boot media...  &#34;USB MSD timed out after 10000 seconds&#34;  I&#39;m guessing that should be &#34;milliseconds&#34;  Boot from SD Card plugged into a Poundland Signalex USB 2.0 Multislot SDHC Reader, via USB 2.0 or 3.0 ... Perfect, from initial testing.\n    timg236 wrote:  ↑ The beta firmware and bootloader for USB mass storage boot on Pi 4 are now available.   .... [*] Eject the SD card and boot using USB card reader instead of direct SD boot. [/list] ... Anyway, code released, time to run (literally). Have fun!\n `+oooooooooooo: `+oooooooooooo: -------------- /oooo++//ooooo: ooooo+//+ooooo. OS: Raspbian GNU/Linux 10 (buster) armv7l `+ooooooo:-:oo- +o+::/ooooooo: Host: Raspberry Pi 4 Model B Rev 1.1 `:oooooooo+`` `.oooooooo+- Kernel: 5.4.42-v7l+ `:++ooo/. :+ooo+/.` Uptime: 2 mins ...` `.----.` ``.. Packages: 2575 (dpkg) .::::-``:::::::::.`-:::-` Shell: bash 5.0.3 -:::-` .:::::::-` `-:::- Resolution: 2560x1440 `::. `.--.` `` `.---.``.::` DE: LXDE .::::::::` -::::::::` ` WM: Openbox .::` .:::::::::- `::::::::::``::. Theme: Adwaita [GTK3] -:::` ::::::::::. ::::::::::.`:::- Icons: Adwaita [GTK3] :::: -::::::::. `-:::::::: :::: Terminal: lxterminal -::- .-:::-.``....``.-::-. -::- Terminal Font: Monospace 10 .. `` .::::::::. `..`.. CPU: BCM2711 (4) @ 1.500GHz -:::-` -::::::::::` .:::::` Memory: 320MiB / 3744MiB :::::::` -::::::::::` :::::::. .::::::: -::::::::. :::::::: `-:::::` ..--.` ::::::. `...` `...--..` `...` .:::::::::: `.-::::-`\nAttempt to boot from an old usb-card reader (first attempt) did not succeed\n    Great work raspberry pi team. All looking good here when I plug SSD into USB 2.0 but no joy in USB 3.0 port. A quick internet search  https://jamesachambers.com/raspberry-pi ... sh-drives/ suggests it&#39;s possibly my Sabrent USB/Sata Cable. Will get hold of a different brand and see if that makes a difference.\n  Last edited by   on Wed May 20, 2020 2:18 pm, edited 1 time in total.\n    Thank you for getting this working(mostly)     I am getting an error when running rpi-update from the sd card to pull the elf and dat files as follows:   [email protected]:~ $ sudo rpi-update branch=msd-boot  *** Raspberry Pi firmware updater by Hexxeh, enhanced by AndrewS and Dom  *** Performing self-update  *** Relaunching after update  *** Raspberry Pi firmware updater by Hexxeh, enhanced by AndrewS and Dom  *** Invalid hash given  [email protected]:~ $    I did a little sleuthing on github, and I don&#39;t see an msd-boot branch.   I am guessing that msd-boot isn&#39;t available yet?  Regards!  Jay\n    I&#39;ve tested it, so updated to the  new beta pieeprom, and installed  the latest firmware. The boot seems to work very well and very fast on USB 3.0 port, without any microSD card. The UAS and TRIM are active, so there are no negative effects. My USB to SATA adapter is ASMedia 1351, and the 2TB HDD has a GPT partition table with hybrid MBR.\n    @jr3us Perhaps a rpi-update without arguments as the &#39;mini&#39; guide&#39; in the first post suggests?\n  Last edited by   on Wed May 20, 2020 2:24 pm, edited 1 time in total.\n    I did a little sleuthing on github, and I don&#39;t see an msd-boot branch.   I am guessing that msd-boot isn&#39;t available yet?\nI used the ones in the boot folder. They had just been updated so I assumed that they were the ones. Worked fine.\n    Kendek wrote:  ↑ I&#39;ve tested it, so updated to the  new beta pieeprom, and installed  the latest firmware. The boot seems to work very well and very fast on USB 3.0 port, without any microSD card. The UAS and TRIM are active, so there are no negative effects. My USB to SATA adapter is ASMedia 1351, and the 2TB HDD has a GPT partition table with hybrid MBR.\nWhen you ran rpi-update, did you use the branch=msd-boot? I see the link you used was in the master branch.  Regards!  Jay\n    jr3us wrote:  ↑ When you ran rpi-update, did you use the branch=msd-boot? I see the link you used was in the master branch.\nMy OS is a custom Ubuntu 20.04 with a custom kernel. So I just downloaded the files into the /boot dir.\n    hansotten wrote:  ↑ @jr3us Perhaps a rpi-update without arguments as the &#39;mini&#39; guide&#39; in the first post suggests?\nThis fixed it, thanks! Looks like msd-boot was migrated into master. I was using the instructions linked here:   https://www.raspberrypi.org/documentati ... _config.md  Thanks for the hintl, my usb boot is now working!  Regards!   Jay\n    The branch was switched to the master branch yesterday to avoid needing a special branch   https://github.com/raspberrypi/document ... 1553/files\n    timg236 wrote:  ↑ The branch was switched to the master branch yesterday to avoid needing a special branch   https://github.com/raspberrypi/document ... 1553/files\nSomebody needs to update  https://www.raspberrypi.org/documentati ... _config.md as it still says branch=msd-boot in several places.\n    trejan wrote:  ↑  timg236 wrote:  ↑ The branch was switched to the master branch yesterday to avoid needing a special branch   https://github.com/raspberrypi/document ... 1553/files\nSomebody needs to update  https://www.raspberrypi.org/documentati ... _config.md as it still says branch=msd-boot in several places.\nThat happens automatically, but there will be some delay for scripts to run and content caches to update.\n    Tested beta firmware and bootloader EEPROM under Raspbian w/desktop on PI 4B 4GB with micro SD card in Kingston USB 3 multi card reader (FCR-HS4) - works fine with micro SD card in micro SD card slot, and SD card slot using black Raspberry Pi-branded adaptor. Tested in all 4 USB ports on the Pi. While in USB 3 port, official Pi mouse and Dell keyboard in USB 2 ports; while in USB 2 port, mouse and keyboard in USB 3 ports. All working. Display on HDMI 0.  Copied card to 160GB Hitachi hard disk (from an old laptop) in 2.5&#34; Startech.com enclosure (S2510BMU33) using SD Card Copier, with &#39;New Partition UUIDs&#39; option set. Shut down, removed power and USB multi card reader, reapplied power and Pi booted correctly from hard disk. Tested reboot - OK. Tested in both USB 3 ports - OK. Tested single display on HDMI 1 - OK.  Note: Hard disks and SSDs may need to be connected via a powered hub.  Did a quick test with hard disk enclosure connected via powered USB 2.0 hub (D-Link DUB-H7 B1) - seems to work fine.\n  Last edited by   on Wed May 20, 2020 3:39 pm, edited 2 times in total.\n    timg236 wrote:  ↑  trejan wrote:  ↑  timg236 wrote:  ↑ The branch was switched to the master branch yesterday to avoid needing a special branch   https://github.com/raspberrypi/document ... 1553/files\nSomebody needs to update  https://www.raspberrypi.org/documentati ... _config.md as it still says branch=msd-boot in several places.\nThat happens automatically, but there will be some delay for scripts to run and content caches to update.\nSeems to be up-to-date now on raspberrypi.org. If you are still seeing the old version of the page, press CTRL+F5 on your keyboard, which should force the browser to go back to the server to fetch the page, regardless of whether the server tells it the page has not changed.\n    Just a small detail but using the EEPROM image from 15/05/20 I initially couldn&#39;t get USB booting to work, because the boot order was 0xF21 instead of 0xF41 as described on the bootload configuration page. However, dumping the config to a text file, the boot order was listed as 0xF41. Rewriting the config to the EEPROM also seemed not to behave as expected - rewriting the config with boot order of 0xF41 didn&#39;t work at first - I had to change it to something different first, then back to 0xF41 before it worked.\n    I did the following steps to update the RPi4 for booting off USB:  1. Update the eeprom, using the steps defined. 2. Create a usb drive by writing a fresh image.  The following steps create a USB bootable device for the RPi4 ( I used a SANDISK 128GB USB3 Ultra Lite  Boot a raspberry pi 3 , ( use a Raspberry pi 3 with the fresh USB above.  3. sudo apt update &amp;&amp; sudo apt full-upgrade 4. rpi-update ### This installs the updated *.elf and *.dat files needed by the RPi 4.  5. Reboot, and let the RPi 3 return to desktop. 6. Shutdown the RPi 3.  7. Move the USB from the RPI 3 and use it to boot the RPi 4 from a USB3 port.  Success!\n    Marko73 wrote:  ↑ Just a small detail but using the EEPROM image from 15/05/20 I initially couldn&#39;t get USB booting to work, because the boot order was 0xF21 instead of 0xF41 as described on the bootload configuration page. However, dumping the config to a text file, the boot order was listed as 0xF41. Rewriting the config to the EEPROM also seemed not to behave as expected - rewriting the config with boot order of 0xF41 didn&#39;t work at first - I had to change it to something different first, then back to 0xF41 before it worked.\nIt sounds like you may have gotten the EEPROM image via a different route. Different distro?\n    There&#39;s also raspi-config option in the works which will present a simple boot order configuration choice SD/Network or SD/USB-MSD.    https://github.com/RPi-Distro/raspi-con ... spi-config  This should help anyone who wants to get started with network-boot e.g. with PiServer.   N.B. It&#39;s not intended to be GUI for editing the bootloader config, it&#39;s a higher level configuration choice.\n    geev03 wrote:  ↑  timg236 wrote:  ↑ The beta firmware and bootloader for USB mass storage boot on Pi 4 are now available.   .... [*] Eject the SD card and boot using USB card reader instead of direct SD boot. [/list] ... Anyway, code released, time to run (literally). Have fun!\n `+oooooooooooo: `+oooooooooooo: -------------- /oooo++//ooooo: ooooo+//+ooooo. OS: Raspbian GNU/Linux 10 (buster) armv7l `+ooooooo:-:oo- +o+::/ooooooo: Host: Raspberry Pi 4 Model B Rev 1.1 `:oooooooo+`` `.oooooooo+- Kernel: 5.4.42-v7l+ `:++ooo/. :+ooo+/.` Uptime: 2 mins ...` `.----.` ``.. Packages: 2575 (dpkg) .::::-``:::::::::.`-:::-` Shell: bash 5.0.3 -:::-` .:::::::-` `-:::- Resolution: 2560x1440 `::. `.--.` `` `.---.``.::` DE: LXDE .::::::::` -::::::::` ` WM: Openbox .::` .:::::::::- `::::::::::``::. Theme: Adwaita [GTK3] -:::` ::::::::::. ::::::::::.`:::- Icons: Adwaita [GTK3] :::: -::::::::. `-:::::::: :::: Terminal: lxterminal -::- .-:::-.``....``.-::-. -::- Terminal Font: Monospace 10 .. `` .::::::::. `..`.. CPU: BCM2711 (4) @ 1.500GHz -:::-` -::::::::::` .:::::` Memory: 320MiB / 3744MiB :::::::` -::::::::::` :::::::. .::::::: -::::::::. :::::::: `-:::::` ..--.` ::::::. `...` `...--..` `...` .:::::::::: `.-::::-`\nAttempt to boot from an old usb-card reader (first attempt) did not succeed\nOther than a large picture of a Raspberry which is nice, that tells us absolutely nothing about your USB hardware, the bootloader version, what steps you took or in what way it di not work\n    I&#39;ve managed to find a device that breaks USB boot if it is attached. I have a pair of Startech.com 3.5&#34; HDD enclosures (S3510BMU33), which are single drive enclosures. I have a 1TB hard disk in each which currently make up a ZFS pool that I have used successfully with Raspbian, and now Ubuntu 20.04 arm64. To test USB MSD boot, I powered down that Pi, the hub, and the enclosures, then connected the hub and the two enclosures to my &#39;testing&#39; Pi 4B 4GB (same as the one that boots from other USB MSD devices). I&#39;m seeing a consistent hang in the bootloader when it gets to the &#39;LUN 0&#39; stage of examining the drive. I&#39;ve tried extending the device timeout from 2000 to 7000 milliseconds, but it makes no difference. The drive spins up but the bootloader gets stuck at &#39;LUN 0&#39;.  The Startech enclosure has vid:pid 174c:1053 which is a generic ASM1053 id. The bridge chip says ASM1053 on it.  For some reason the bootloader is hanging when it tries to talk to this drive. I can boot from another hard disk (in the working 2.5&#34; enclosure), but if the non-working 3.5&#34; enclosure is connected at boot time, the bootloader always hangs. I have tried the enclosure connected to a USB 2 hub and USB 3 hub that will do USB MSD boot OK with a different drive and enclosure (2.5&#34; Hitachi hard disk, enclosure bridge 174c:1153 which is an ASM1153E).  Screenshot with both problematic drive enclosures, and working 2.5&#34; enclosure attached, all via hub:  https://drive.google.com/file/d/1qvkYpd ... sp=sharing  Screenshot with just one problematic enclosure attached via hub:  https://drive.google.com/file/d/1_lGwHV ... sp=sharing  I have jumper cables on order to hook up to another machine so I can get debug out of the serial port (I seem to have lost the ones I used back back in the day with my Pi 1s). I will look at setting up network debug output as well.", "posttime": "2020-05-23 13:35:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "raspberry-pi,pi,usb", "title": "Raspberry PI 4 USB大容量存储测试版", "title_en": "Raspberry Pi 4 USB mass storage beta", "transed": 1, "url": "https://www.raspberrypi.org/forums/viewtopic.php?t=274595&p=1663644", "via": "", "real_tags": ["pi", "usb"]}, {"category": "", "categoryclass": "", "imagename": "6a3cee053f9020262e8abf739d934cdf.jpg", "infoid": 1003334, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你曾经渴望在星舰企业号上工作，那就放心吧：最新的办公楼与宇宙飞船的共同点比你意识到的要多得多。\n这也不仅仅是苹果的新园区。随着工作在我们生活中的地位越来越重要，工程师、建筑师和科学家开始将我们的工作场所视为密封的结构，必须积极管理内部环境，同时减轻污染和其他危险，这些都是在世界上许多最经济的国家做生意的成本……", "note_en": "If you have ever yearned to work aboard the Starship Enterprise, take comfort: The newest office buildings have more in common with spaceships than you realize.\n  It isn’t just Apple’s new campus, either. As work takes an ever more central place in our lives, engineers, architects and scientists are beginning to view our workplaces as sealed structures that must actively manage their internal environments, while mitigating pollution and other hazards that are the cost of doing business in many of the world’s most economically...", "posttime": "2020-05-23 13:34:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "应该,buildings", "title": "写字楼应该像宇宙飞船一样运转(2017)", "title_en": "Office buildings should run like spaceships (2017)", "transed": 1, "url": "https://www.wsj.com/articles/why-office-buildings-should-run-like-spaceships-1507467601", "via": "", "real_tags": ["应该", "buildings"]}, {"category": "", "categoryclass": "", "imagename": "48e295b17026344c87c590eb9efed199.jpg", "infoid": 1003333, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在机组人员龙飞船被安装在猎鹰9号火箭上后，过去几天进行的最后一次拉力检查已经正式结束，结果是一切都准备就绪，为周三的发射做准备。猎鹰9号火箭将把机组人员龙飞船送往国际空间站(ISS)。另一次飞行准备情况审查计划在进一步检查后于周一进行。\n5月27日的发射窗口正式定于美国东部夏令时下午4点33分(太平洋标准时间下午1点33分)开放，搭载机组人员龙的猎鹰9号将从佛罗里达州的肯尼迪航天中心起飞。机上将有NASA宇航员道格·赫尔利(Doug Hurley)和鲍勃·本肯(Bob Behnken)，他们是第一批被美国制造的私人航天器搭载的宇航员，也是自2011年航天飞机计划结束以来第一批从美国本土发射进入太空的人类。\n这项任务将包括本肯和赫尔利发射到太空，然后与国际空间站的乘员龙会合，如果一切按计划进行，乘员龙将自动与空间站对接。然后，宇航员们将留在空间站，作为机组人员为空间站的工作做出贡献，最长可达三个月，然后才能回家。\n尽管Behnken和Hurley将在国际空间站为这次任务花费一些时间，但这实际上并不是一次可操作的发射-这是SpaceX公司为NASA商业机组人员计划进行的人类评级过程中的最后一次演示任务。商业乘员是NASA与公司发展强有力的公私合作伙伴关系的尝试，以帮助支付从美国将人送入太空的费用。\n任务的结束将涉及机组人员龙与空间站分离，宇航员在船上，并执行受控的重返大气层和下降到海洋，他们将在那里被SpaceX的回收机组人员接走。\n准备过程中的下一步是静态试射，将在今天晚些时候进行，包括在发射台上点燃猎鹰9号的发动机，以确保它们在起飞前正常工作。然后是发射日(还有备用日期以防天气问题)-根据Behnken的说法，届时这次飞行的机组人员龙太空舱的正式名称也将公布。", "note_en": "This final stretch check, conducted over the past few days after the Crew Dragon spacecraft was mounted on top of the  Falcon   9 rocket that will take it to the International Space Station (ISS), has officially concluded and the result is that everything is cleared to go forward with preparations ahead of the launch on Wednesday. Another flight readiness review is scheduled for Monday after further checkouts.\n The launch window on May 27 is officially set to open at 4:33 PM EDT (1:33 PM PDT), and the Falcon 9 carrying the Crew Dragon will be taking off from Kennedy Space Center in Florida. On board will be NASA astronauts Doug Hurley and Bob Behnken, the first astronauts to be carried aboard a private U.S.-built spacecraft, and the first humans to launch into space from U.S. soil since the end of the Space Shuttle program in 2011.\n  The mission will involve Behnken and Hurley launching to space, then making a rendezvous with the ISS in Crew Dragon, which will autonomously dock with the station if all goes to plan. The astronauts will then stay on the station and contribute to its work as crew members for up to three months before returning home.\n Despite the fact that Behnken and Hurley are going to spend a bit of time at the ISS on this mission, this isn’t actually an operational launch — it’s the final demonstration mission in SpaceX’s human-rating process for the NASA Commercial Crew program. Commercial Crew is NASA’s attempt to develop strong public-private partnerships with companies to help defray the cost of sending people to space from the U.S.\n The end of the mission will involve the Crew Dragon detaching from the Space Station with the astronauts on board, and performing a controlled re-entry and descent into the ocean, where they’ll be picked up by SpaceX’s recovery crew.\n Next up in the preparation sequence is a static test fire, which will be performed sometime later today, and involves firing the Falcon 9’s engines while it’s on the launchpad to see that they’re functioning correctly before it takes off. Then it’s on to launch day (and there are backup dates in case of weather problems) — when the official name of the Crew Dragon capsule for this flight will be revealed, too, according to Behnken.", "posttime": "2020-05-23 13:34:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "航天器,crewed,机组人员", "title": "SpaceX的第一次载人航天器发射获准进行到5月27日的目标", "title_en": "SpaceX’s first crewed spacecraft launch cleared to proceed for May 27 target", "transed": 1, "url": "https://techcrunch.com/2020/05/22/spacexs-first-crewed-spacecraft-launch-is-officially-cleared-to-proceed-on-may-27/", "via": "", "real_tags": ["航天器", "crewed", "机组人员"]}, {"category": "", "categoryclass": "", "imagename": "1016b28248ad952d65c253423118c9d4.png", "infoid": 1003332, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "旧金山湾区揭露丑闻的报纸“SF周刊”今天发表了一篇揭露特斯拉弗里蒙特工厂糟糕的健康状况和工作条件的文章。一位特斯拉工厂工人说，“这是生死攸关的情况.”另一名拒绝重返工作岗位的工人说，“这是一个现代的血汗工厂。”不幸的是，我们从特斯拉未加入工会的员工那里听到了类似的严厉言论，他们帮助公司取得了重大成功。\n卡洛斯·加布里尔(Carlos Gabriel)是一名工人，他拒绝返回，因为社交距离没有得到遵守。他说：\n这里真的没有空间，而且这是一家空气回收的工厂。你们基本上就是在互相呼吸。\n上周联系electrek的另一名员工证实了SF Weekly的报道。他描述了在阿拉米达县批准特斯拉之前整整一周举行的一次会议。\n我们彼此相距几英寸。看起来他们没有对生产线做任何改变。在生产线上，我们有时会互相顶着工作，接触相同的设备。\n他们给了我们一个面具，当我们走进来的时候，他们给了我们临时工。浴室并不总是干净的，而且很小。\n联系到electrek的工人补充说，“工会多年来一直试图进入，但一直没有运气。”他说每个人都知道“埃隆不会允许的”SF Weekly指出，特斯拉是美国所有主要(美国)汽车公司中唯一没有加入工会的员工。\n今年3月，另一名同样不愿透露姓名的员工向electrek通报了工厂正式关闭时的情况。\n我今天早上到公司了。我们仍在全面投产。看起来他们并没有裁员。他们给我们一个口罩，当我们走进去的时候给我们量体温。他们不是在练习安全社交距离。\n这位特斯拉首席执行官5月12日给他的工人发了一条信息，感谢他们在工厂重新开工后重返工作岗位。他写道：\n我只想给你寄一封感谢信，感谢你为特斯拉的成功付出了辛勤的努力。看到工厂恢复生机，而你正在让它发生，这真是太酷了！\n为他人制造产品或提供有用的服务，一天的诚实工作是极其光荣的。我对那些以做好工作为荣的人，不管是什么职业，比起那些什么都不做的富人或名人，要尊敬得多。\n一些员工表示支持马斯克作为回报。他们是抵制封锁协议的所谓揭幕运动的一部分。这些工人对马斯克和唐纳德·特朗普表达的“重返工作岗位”的观点表示同情。据SF周刊报道，一些员工还“摘下口罩，以便在几个小时的体力劳动后呼吸”。\n特斯拉继续将更多员工召回工作岗位。尽管如此，该公司警告称，不回来工作的员工可能会失去失业救济金。\n5月12日，通过阿拉米达县和特斯拉官员的会议，制定了一套针对特定地点的大流行安全指南。指导方针要求改变休息室，温度筛选，并让员工分散在整个工厂。\n我们已做好充分准备，确保安全进行，并与政府的所有预防措施和该县要求的安全措施保持一致。\n然而，SF Weekly报道称，工人们表示，人力资源备忘录和重返工作岗位手册中概述的措施“在弗里蒙特的工厂车间没有得到始终如一的执行，工厂管理层仍在摸索着建立动态的安全指导方针。”\n他们试图在每个人都在工作的时候实施这些改变。这会让你怀疑你的生命是否值每小时20美元。\n员工们说，到上周四，轮班之间20分钟的宽限期缩短到了10分钟。一次换班涉及的员工人数可能超过1000人。有些班次早在凌晨5点就开始了。\n一位61岁的流水线员工叫阿特(Art)，他只透露了自己的名字，他说他和同事们“肩并肩”工作，没有6英尺的距离。\n弗里蒙特警方已经短暂露面几次，以核实是否执行了社会疏远措施。然而，弗里蒙特警察局的一位发言人说，“我们根本没有能力对弗里蒙特的每一家企业进行(检查)，因为我们有数千家企业。”\n加布里埃尔告诉SF周刊，他相信马斯克几个月来一直在考虑将工厂从旧金山湾区搬出去。他说，这家拥有1万名员工的工厂是该地区最后几家蓝领工作的供应商之一，但特斯拉管理层并不认为自己是社区的一部分。“我们对(特斯拉)来说是一次性的，”加布里埃尔说。\n您正在阅读的是electrek，专家们日复一日地发布关于特斯拉、电动汽车和绿色能源的新闻。一定要查看我们的主页，了解所有最新新闻，并在Twitter、Facebook和LinkedIn上关注electrek，随时了解最新消息。不知道从哪里开始？请查看我们的YouTube频道以了解最新的评论。", "note_en": "SF Weekly, the Bay Area’s muckraking newspaper, today published an exposé about poor health and work conditions at Tesla’s Fremont plant. One Tesla factory worker said, “This is a life and death situation.” Another worker, who refused to return to work, said, “It’s a modern-day sweatshop.” Unfortunately, we’ve heard similarly harsh words from Tesla non-unionized employees, who helped build the company into a major success.\n  Carlos Gabriel, the worker who refused to return because social distancing is not being observed, said:\n There’s really no room, and this is a factory with recycled air. You’re basically just breathing on each other.\n Another employee who reached out to  Electrek last week corroborated the report from  SF Weekly. He described a meeting held a full week before Tesla was given the go-ahead from Alameda County.\n We were inches apart from one another. Didn’t look like they made any changes to the line. On the line, we sometimes work on top of each other, touching the same equipment.\n They give us a mask and take our temps when we walk in. The bathrooms aren’t always clean and are small.\n  The worker who contacted  Electrek added, “Unions have been trying to get in for years with no luck.” He said that everybody knows that “Elon wouldn’t allow it.”  SF Weekly noted that Tesla is the only non-unionized workforce of any major [American] car company in the US.\n In March, another employee who also wanted to remain anonymous informed  Electrek about conditions at the plant when it was formally shut down.\n I arrived at work this morning. We are still running full production. Does not look like they cut down on the workforce. They give us a mask and take our temperature when we walk in. They are not practicing safe social distance.\n  The Tesla CEO sent a message to his workers on May 12, thanking them for returning to work after the factory was re-opened. He wrote:\n Just wanted to send you a note of appreciation for working hard to make Tesla successful. It is so cool seeing the factory come back to life and you are making it happen!\n An honest day’s work spent building products or providing services of use to others is extremely honorable. I have vastly more respect for someone who takes pride in doing a good job, whatever the profession, than some rich or famous person who does nothing useful.\n Some employees expressed support for Musk in return. They are part of the so-called Unmasking movement resisting the lockdown protocols. Those workers are sympathetic to the “back to work” sentiments expressed by Musk and Donald Trump. Some employees also “remove their masks in order to breathe after hours of physical labor,” according to  SF Weekly.\n Tesla continues to  call more employees back to work. Nonetheless, the company warns that employees who don’t come back to work might  lose unemployment benefits.\n A set of site-specific pandemic safety guidelines were created on May 12 via meetings between Alameda county and Tesla officials. The guidelines called for changes to the breakroom, temperature screenings, and having employees dispersed throughout the plant.\n  We are well-prepared to proceed safely and in alignment with all government precautions and the county’s requested safety measures.\n  However,  SF Weekly reports that workers say the measures outlined in the HR memo and Return to Work playbook are “not being implemented consistently on the Fremont factory floor, where plant management is still fumbling to establish safety guidelines on the fly.”\n  They’re trying to implement the changes while everyone’s working. It makes you wonder if your life is worth 20 bucks an hour.\n Employees said that that by last Thursday, a 20-minute grace period between shifts was shortened to 10 minutes. The number of employees involved in a shift change can number more than 1,000 people. Some shifts begin as early as 5 a.m.\n A 61-year-old assembly line employee named Art, who only shared his first name, said that he and his colleagues work “shoulder to shoulder,” with no room for 6 feet of distance.\n Fremont police have made a few brief appearances to verify whether social distancing measures are enforced. However, a spokesperson from the Fremont Police Department said, “We would simply not have the capacity to do [inspections] for every business in Fremont, as we have thousands.”\n Gabriel told  SF Weekly that he believes Musk has been looking at moving the factory from the Bay Area for months. He said the plant, which employs 10,000 people, is one of the last suppliers of blue-collar jobs in the area, but that Tesla management doesn’t see itself as part of the community. “We are disposable to [Tesla],” said Gabriel.\n  You’re reading Electrek— experts who break news about  Tesla,  electric vehicles, and  green energy, day after day. Be sure to check out our  homepage for all the latest news, and follow Electrek on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  YouTube channel for the latest reviews.", "posttime": "2020-05-23 13:34:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,担心,employees,员工", "title": "特斯拉员工担心工厂不安全的条件，称之为现代血汗工厂", "title_en": "Tesla employees fear unsafe conditions at factory, call it modern-day sweatshop", "transed": 1, "url": "https://electrek.co/2020/05/21/tesla-employees-fear-unsafe-conditions-at-factory-call-it-modern-day-sweatshop/", "via": "", "real_tags": ["特斯拉", "担心", "employees", "员工"]}, {"category": "", "categoryclass": "", "imagename": "59bdd091a7f6b8c680ad535954f28708.jpg", "infoid": 1003330, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作者Neil Savage Communications of the ACM，2020年6月，第63卷第6期，第15-16页10.1145/3392516评论机器视觉与人工智能(AI)相结合，在让计算机理解图像方面取得了长足的进步。多亏了深度学习，它以类似于人脑的方式处理信息，机器视觉正在做一切事情，从保持自动驾驶汽车在正确的轨道上行驶，到通过检查活组织切片或x光图像来改进癌症诊断。现在，一些研究人员正在超越人眼或相机镜头所能看到的范围，使用机器学习来观察墙另一边的人在做什么。\n这项技术依赖于低功率射频(RF)信号，这种信号反射活组织和金属，但很容易穿过木质或石膏内墙。人工智能可以破译这些信号，不仅可以检测人的存在，还可以看到他们是如何移动的，甚至可以预测他们从事的活动，从打电话到刷牙。有了射频信号，他们可以在黑暗中看到东西。麻省理工学院(MIT)计算机科学与人工智能实验室的博士生李天红(音译)说，他们可以透过墙壁或家具看到东西。他和他的研究生范丽杰(Lijie Fan)帮助开发了一种测量运动的系统，并由此识别具体的行动。我们的目标是了解人们在做什么，李说。\n这样的理解可以派上用场，例如监察辅助生活设施的年长居民，看看他们在执行日常生活任务方面是否有困难，或察觉他们是否跌倒。它还可以用来创建智能环境，在这些环境中，自动设备可以打开家里或办公室的灯或暖气。警察部队可能会使用这样的系统来监视疑似恐怖分子或武装抢劫犯的活动。\n数字。RF-POSE使用无线信号来监视墙另一边的人的活动。\n领导这项研究的麻省理工学院教授迪娜·卡塔比(Dina Katabi)表示，在生活环境中，通过射频信号通过墙壁监控活动的一个好处是，例如，它们无法分辨人脸或看到一个人的穿着，所以比起在家里布满摄像头，它们可以提供更多的隐私感。另一个原因是，它不要求人们佩戴他们可能会忘记或不舒服的监控设备；他们只需像往常一样在家里走动即可。\n麻省理工学院系统使用的无线电发射机工作在5.4 GHz到7.2 GHz之间，功率水平比Wi-Fi信号低1000倍，因此应该不会造成干扰。由于我们身体的所有水分含量，射频发射会强烈地反弹到人身上，但它们也会不同程度地反弹到环境中的其他物体上，这取决于物体的组成。卡塔比说，你会得到大量的反射，信号从所有东西上反弹。\n因此，第一步是教计算机识别哪些信号是来自人的。研究小组通过记录可见光和射频信号中的场景，并使用视觉图像来标记卷积神经网络(CNN)训练数据中的人类，卷积神经网络是一种深度学习算法，为图像的不同方面分配权重。信号还包含空间信息，因为信号传输更远的距离需要更长的时间。Katabi说，CNN可以捕捉到这些信息，并利用它将同一附近的两个或更多人分开，尽管如果这些人非常接近或拥抱，这可能会导致错误。\n研究人员还希望根据人们的行动方式来确定他们正在采取的行动。为了做到这一点，该系统采取了中间步骤，将来自人的信号渲染成骨骼，这是人体的简化版本，将它们简化为基本上由头部和四肢组成的棍状图形。根据线条在条形图中的相对位置，计算机可以识别各种动作-坐下、弯腰拿起东西、挥手、喝酒、打电话等等。\n该团队建立在之前使用人工智能从视频图像派生动作的工作基础上。然而，现有的动作检测数据集都不包括射频信息，因此团队必须创建自己的数据集。他们找到了30名志愿者，将他们放在10个不同的环境中-例如办公室、走廊和教室-并要求他们从35种可能性中随机执行行动。这产生了25小时的数据来训练和测试他们的计算机模型。\n为了提供更多数据，他们从没有任何相关RF信号的视频中提取骨架。李说，这些骨架与从射频信号中提取的骨架略有不同，所以他们必须做出一些调整。然而，这种方法允许研究人员纳入其他信息，例如名为PKU-MMD的数据集，该数据集包含来自51个类别的近2万个动作，由66个人执行。\n卡塔比并不是唯一一个使用射频透视墙壁的研究人员。密苏里州圣路易斯市华盛顿大学(Washington University)的计算机科学与工程教授尼尔·帕特瓦里(Neal Patwari)多年来一直在研究射频传感，尽管他在2009年的工作并不涉及机器学习。他的基本系统同时使用无线电发射机和接收机。附近的物体会改变接收器接收到的信号的强度。直接穿过这两条线的人会强烈地阻挡信号，附近的人会阻挡得稍微少一些，而当一个人在很远的地方时，一个散布在他们身体上的信号会稍微改变接收到的信号。\n帕特瓦里使用机器学习来教导计算机特定的信号混合与特定的动作相匹配。例如，厨房的一组特定尺寸可能意味着有人在做饭。你可以有一个算法来学习与烹饪相对应的特征是什么。他说：然后我就可以知道，对于独居在家的人来说，他们在这一天的这个时候正在做饭，并确保他们没有太多偏离正常的日程安排。这样的系统可能有助于监测处于痴呆症早期阶段的人，或者处于已知的抑郁症风险中的人。\n帕特瓦里说，但有一个问题是，测量结果可能会随着环境的变化而改变。例如，如果一个人刚刚去杂货店购物，打开装满食物的冰箱可能会产生一组射频信号。几天后，当冰箱里有更多的空空间时，信号可能会看起来不同。训练数据会在一段时间后变得陈旧。\n例如，Patwari目前正在开发一种系统，该系统使用射频信号通过精神病院的墙壁监测患者的呼吸。许多精神病院有一项政策，晚上每隔15分钟进一次病人的房间，以确保他们睡得正常，不会试图伤害自己。当然，这样的检查可能会唤醒患者，干扰他们获得所需的睡眠。射频系统可以检测到患者胸部的运动，并能看到他们是否正常睡眠。因为它能透过墙壁，所有的设备和电线都在房间外面，所以病人不能损坏它们或用它们伤害他/她自己。\n伦敦大学学院(University College London)安全与犯罪科学系教授凯文·切蒂(Kevin Chetty)表示，可以通过将射频信号用作一种多普勒雷达来检测呼吸，观察信号在反射来回移动的东西时如何变化。他的重点是利用机器学习来理解他所说的被动Wi-Fi，利用环境中已经存在的射频信号，可能包括5G手机使用的信号。射频场中的任何运动都会产生多普勒信号。切蒂说，这是一个复杂的融合，有向前和向后，向左和向右，不同角度的不同多普勒分量。你可以得到与不同类型的运动相关联的微多普勒信号。\n依靠环境中已经存在的射频信号意味着不需要像Patwari这样的系统所要求的那种类型的校准。另一方面，它不得不凑合使用任何存在的信号，而不是依赖于像卡塔比那样的可预测信号。\n为了训练他的动作识别系统，切蒂让志愿者穿着点缀着LED的西装，这个系统类似于创建虚拟现实场景时使用的系统。随着人的移动，切蒂和他的团队收集摄像机记录的视觉数据和射频信号。视觉数据为训练系统基于微多普勒特征识别动作提供了基础事实。它可能是一组复杂的测量数据，需要破译。例如，根据观察的角度不同，同一动作的多普勒信号可能会有所不同。\n一些射频传感技术已经在使用中。例如，帕特瓦里以前的学生成立了一家名为Xandem的公司，销售使用射频探测人类存在和运动的传感器。使用机器学习来识别医疗保健或智能环境中使用的操作的系统仍需要进一步开发。切蒂说：我们还没有到那一步，但我们正在努力。\n李涛，范林，赵明，刘勇，卡塔比，D让看不见的：通过墙壁和封闭的行动识别，2019年，arxiv.org/abs/1909.09300。\nAl-Husseiny，A.，Patwari，N.无设备本地化信号强度模型的无监督学习，2019IEEE第20届无线、移动和多媒体网络世界国际研讨会，DOI：10.1109/WoWMoM.2019.8792970。\n李伟，Piechocki R，Woodbridge K，Chetty K WiFi传感，体力活动，修正的交叉模糊函数，独立WiFi设备，2019年，IEEE全球通信会议，https://discovery.ucl.ac.uk/id/eprint/10084427/。\n王霞，王霞，毛，S。物联网中的射频传感：一个通用的深度学习框架，2018年，IEEE通信杂志，DOI 10.1109/MCOM.2018.1701277。\n允许将本作品的部分或全部数字或硬拷贝用于个人或课堂使用，但不得以盈利或商业利益为目的制作或分发拷贝，并且拷贝的首页必须注明本通知和完整的引文。必须尊重ACM以外的其他人拥有的本作品组件的版权。允许赊账提款。要以其他方式复制、重新发布、在服务器上发布或重新分发到列表，需要事先获得特定许可和/或收取费用。通过Permission@acm.org或传真(212)869-0481请求发布许可。\n数字图书馆由计算机械协会出版。版权所有©2020 ACM，Inc.", "note_en": "By Neil Savage Communications of the ACM,June 2020,Vol. 63 No. 6, Pages 15-16 10.1145/3392516  Comments      Machine vision coupled with artificial intelligence (AI) has made great strides toward letting computers understand images. Thanks to deep learning, which processes information in a way analogous to the human brain, machine vision is doing everything from keeping self-driving cars on the right track to improving cancer diagnosis by examining biopsy slides or x-ray images. Now some researchers are going beyond what the human eye or a camera lens can see, using machine learning to watch what people are doing on the other side of a wall.\n The technique relies on low-power radio frequency (RF) signals, which reflect off living tissue and metal but pass easily through wooden or plaster interior walls. AI can decipher those signals, not only to detect the presence of people, but also to see how they are moving, and even to predict the activity they are engaged in, from talking on a phone to brushing their teeth. With RF signals, &#34;they can see in the dark. They can see through walls or furniture,&#34; says Tianhong Li, a Ph.D. student in the Computer Science and Artificial Intelligence Laboratory at the Massachusetts Institute of Technology (MIT). He and fellow graduate student Lijie Fan helped develop a system to measure movement and, from that, to identify specific actions. &#34;Our goal is to understand what people are doing,&#34; Li says.\n Such an understanding could come in handy for, say, monitoring elderly residents of assisted living facilities to see if they are having difficulty performing the tasks of daily living, or to detect if they have fallen. It could also be used to create &#34;smart environments,&#34; in which automated devices turn on lights or heat in a home or an office. A police force might use such a system to monitor the activity of a suspected terrorist or an armed robber.\n Figure. RF-Pose uses wireless signals to monitor people&#39;s movements on the other side of a wall.\n In living situations, one advantage of monitoring activity through walls with RF signals is that they are unable to resolve faces or see what a person is wearing, for instance, so they could afford more of a sense of privacy than studding the home with cameras, says Dina Katabi, the MIT professor leading the research. Another is that it does not require people to wear monitoring devices they might forget or be uncomfortable with; they just move through their homes as they normally would.\n The MIT system uses a radio transmitter operating at between 5.4 GHz and 7.2GHz, at power levels 1,000 times lower than a Wi-Fi signal, so it should not cause interference. The RF transmissions bounce strongly off people because of all the water content of our bodies, but they also bounce off other objects in the environment to varying degrees, depending on the composition of the object. &#34;You get this mass of reflections, signals bouncing off everything,&#34; Katabi says.\n So the first step is to teach the computer to identify which signals are coming from people. The team does this by recording a scene in both visible light and RF signals, and using the visual image to label the humans in the training data for a convolutional neural network (CNN), a type of deep learning algorithm that assigns weights to different aspects of an image. The signals also contain spatial information, because it takes a longer time for a signal to travel a longer distance. The CNN can capture that information and use it to separate two or more people in the same vicinity, although it can lead to errors if the people are very close or hugging, Katabi says.\n    The researchers also want to identify the actions people are taking based on how they move. To do that, the system takes the intermediate step of rendering the signals from the people into skeletons, simplified versions of human bodies that reduce them to essentially stick figures consisting of a head and limbs. Based on the relative positions of the lines in the stick figures, the computer can identify various actions—sitting down, bending to pick something up, waving, drinking, talking on the phone, and so on.\n The team built on previous work done using AI to derive actions from video images. None of the existing action detection datasets, however, included RF information, so the team had to create its own. They found 30 volunteers, put them in 10 different environments—offices, hallways, and classrooms, for example—and asked them to randomly perform actions from a list of 35 possibilities. That produced 25 hours of data to train and test their computer model.\n To provide more data, they derived skeletons from video that did not have any associated RF signals. Li says those skeletons were slightly different from those derived from the RF signals, so they had to make some adjustments. This approach, however, allowed the researchers to incorporate other information, such as a dataset called PKU-MMD, which contains nearly 20,000 actions from 51 categories performed by 66 people.\n    Katabi is not the only researcher using RF to see through walls. Neal Patwari, a professor of computer science and engineering at Washington University in St. Louis, MO, has been working on RF sensing for years, although his work back in 2009 did not involve machine learning. His basic system uses both a radio transmitter and receiver. Bodies in the vicinity alter the strength of the signal being picked up by the receiver. A person directly crossing a line between the two blocks the signal strongly, someone nearby blocks it somewhat less, and when a person is far away, a signal scattering off their body changes the received signal a bit.\n Patwari uses machine learning to teach the computer what particular blend of signals goes with a specific action. For instance, a particular set of measurements from the kitchen might mean someone was cooking. &#34;You could have an algorithm that learned what the features are that correspond to cooking. And then I could know, for somebody living home alone, that they&#39;re cooking at this time on this day and make sure that they&#39;re not veering from their regular schedule too much,&#34; he says. Such a system could be useful to monitor a person in the early stages of dementia, or who was at known risk for depression.\n One issue, though, is that the measurements could change with changes in the environment, Patwari says. For instance, if a person had just done the grocery shopping, opening a refrigerator full of food might generate one set of RF signals. A few days later, when there was more empty space in the refrigerator, the signals could look different. The training data goes stale after a while.\n Patwari currently is developing a system that uses RF signals to monitor a patient&#39;s breathing through the walls of a psychiatric hospital, for instance. Many psychiatric hospitals have a policy to go into a patient&#39;s room every 15 minutes at night to make sure they are sleeping normally and not trying to harm themselves. Such checks, of course, can wake the patients and interfere with them getting the sleep they need. An RF system can detect the movement of a patient&#39;s chest and see that they are sleeping normally. Because it sees through walls, all the equipment and wires are outside the room, so the patient cannot damage them or use them to harm him/herself.\n    Respiration can be detected by using RF signals as a sort of Doppler radar, seeing how the signal changes as it reflects off something moving back and forth, says Kevin Chetty, a professor in the department of security and crime science at University College London. His focus is on using machine learning to make sense of what he calls passive Wi-Fi, taking advantage of RF signals already in the environment including, potentially, the signals used by 5G cellphones. Any sort of movement in an RF field produces Doppler signals. &#34;There&#39;s a complex amalgamation of forward and back, left and right, different angles to different Doppler components,&#34; Chetty says. &#34;You get micro-Doppler signatures associated with different types of motion.&#34;\n Relying on RF signals already in the environment means there is no need for the type of calibration that a system like Patwari&#39;s requires. On the other hand, it has to make do with whatever signals exist, instead of relying on a predictable signal like Katabi&#39;s.\n To train his action recognition system, Chetty has volunteers wear suits studded with LEDs, a system similar to that used in creating virtual reality scenarios. As the person moves, Chetty and his team collect both visual data recorded by cameras, and RF signals. The visual data provides ground truth for training the system to recognize actions based on the micro-Doppler signatures. It can be a complex set of measurements to decipher. For instance, the Doppler signal for the same action can look different depending on the angle from which it&#39;s viewed.\n Some RF sensing technology is already in use. Former students of Patwari&#39;s, for instance, formed a company called Xandem that sells sensors that use RF to detect human presence and motion. Systems using machine learning to identify actions, for use in healthcare or smart environments, still require further development. &#34;We&#39;re not there yet, but we&#39;re working on it,&#34; Chetty says.\n  Li, T., Fan, L., Zhao, M., Liu, Y., Katabi, D  Making the Invisible Visible: Action Recognition Through Walls and Occlusions, 2019,  arxiv.org/abs/1909.09300\n Al-Husseiny, A., Patwari, N.  Unsupervised Learning of Signal Strength Models for Device-Free Localization, 2019 IEEE 20th International Symposium on &#34;A World of Wireless, Mobile and Multimedia Networks&#34; DOI: 10.1109/WoWMoM.2019.8792970\n Li W, Piechocki R, Woodbridge K, Chetty K  WiFi Sensing, Physical Activity, Modified Cross Ambiguity Function, Stand-Alone WiFi Device, 2019, IEEE Global Communications Conference,  https://discovery.ucl.ac.uk/id/eprint/10084427/\n Wang, X, Wang, X., Mao, S.  RF Sensing in the Internet of Things: A General Deep Learning Framework, 2018, IEEE Communications Magazine, DOI 10.1109/MCOM.2018.1701277\n      Permission to make digital or hard copies of part or all of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and full citation on the first page. Copyright for components of this work owned by others than ACM must be honored. Abstracting with credit is permitted. To copy otherwise, to republish, to post on servers, or to redistribute to lists, requires prior specific permission and/or fee. Request permission to publish from  permissions@acm.org or fax (212) 869-0481.\n The Digital Library is published by the Association for Computing Machinery. Copyright © 2020 ACM, Inc.", "posttime": "2020-05-23 13:33:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "透过,walls,信号", "title": "透过墙壁看得见", "title_en": "Seeing Through Walls", "transed": 1, "url": "https://cacm.acm.org/magazines/2020/6/245152-seeing-through-walls/fulltext", "via": "", "real_tags": ["透过", "walls", "信号"]}]