[{"category": "", "categoryclass": "", "imagename": "bb9611244c5cdbb3eab5af11f9760f09.png", "infoid": 1000000, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "截至2020年4月29日，全球有超过313万例冠状病毒(冠状病毒)确诊病例，其中美国、西班牙和意大利的确诊病例最多。这个数字很可能是对所有病例的低估，因为一个国家检测冠状病毒的方式可能会对他们检测到的病例数量产生巨大影响。我们探索不同的检测方法如何极大地限制各国平坦感染曲线的能力。\n关于病例数量的统计数据很难在各国之间进行比较。各国在测试人口方面有着截然不同的方法。例如，冰岛的检测次数与人口的比率最高，并对没有症状或与感染者没有明显接触的人进行例行检测。在冠状病毒爆发的前30天，每1000名冰岛人中有近44人接受了检测。相比之下，美国只对部分有症状的人进行检测，\n未能对其大部分或有代表性的人口进行检测的国家可能面临严重的不利影响。意大利贝加莫的案例就是一个很好的例子。[1]由于病毒在没有发现的情况下传播了几周，当2020年3月急性病例和死亡人数开始迅速增加时，它很快就超出了当地医院和殡仪馆的能力。\n关于检测的决定对于平坦感染曲线至关重要。比较意大利沃镇和钻石公主号游轮提供了一个自然的实验来理解不同测试决定的后果。这两个地方的人口都在3000到4000人之间，在疫情期间都实施了类似的隔离政策。然而，Vo‘镇在发现第一例病例后对几乎所有的居民进行了检测，而钻石公主船最初.。\n到最后一轮检测(第一次检测后两周)，Vo‘有6人感染(占人口的0.2%)，2人死亡。相比之下，钻石公主号有712名乘客感染(占总人口的19.2%)，7人死亡。由于在第一轮测试中只检测了可疑病例，钻石公主错过了许多感染者，这些感染者随后在接下来的一段时间里促成了病毒的传播。这两种情况的主要不同之处在于……期间的测试次数不同。\n在各国进行的检测次数和确定的病例数量之间有很强的关系(见下图)。也有证据表明，来自测试的易感人群、感染人群、恢复者和死亡者(SIRD)的统计数据不能代表潜在人群(http://lapogianni.blogspot.com/).。这证明政策制定者一再呼吁“测试、测试、测试”是合理的。它还强调了引导群众……的重要性。", "note_en": "As of April 29th 2020, there were over  3.13 million confirmed cases of coronavirus (COVID-19) globally, with the United States, Spain, and Italy having the highest numbers. This number is most likely an undercount of all cases because the way a country tests for coronavirus can have a huge impact on the number of cases they detect. We explore how different testing approaches can dramatically limit countries’ abilities to flatten the curve of infections.\n Statistics on the number of cases are difficult to compare across countries. Countries have vastly different approaches to testing their populations. For example, Iceland has the highest ratio of number of tests to population and has routinely tested persons with no symptoms or no evident contacts with infected persons. Nearly 44 tests per 1000 Icelanders were administered in the first 30 days of their coronavirus outbreak. In contrast, the US only tests some of the people with symptoms,  ...\n  Countries that fail to test a large or representative portion of their population might face severe adverse effects.   The case of Bergamo in Italy is a case in point. [1] As the virus circulated undetected for weeks, when the number of acute cases and deaths started to increase rapidly in March 2020 it quickly overwhelmed the capacity of local hospitals and funeral homes.\n Decisions on testing are essential to flatten the curve of infections. Comparing the town of Vo ’, Italy and the Diamond Princess cruise ship provides a natural experiment to understand the consequences of different testing decisions. Both places had a population of between 3,000 and 4,000 people and implemented similar isolation policies during the epidemic. However, the town of Vo ’tested almost all of its residents following the first detected case while the Diamond Princess ship initially  ...\n  By the final round of tests (two weeks since the first test), Vo ’had 6 people infected (0.2% of the population) and 2 deaths. In contrast, the Diamond Princess had 712 passengers infected (19.2% of the population) and 7 deaths. By testing only suspicious cases during the very first round of tests, the Diamond Princess had missed many infected people who then contributed to spread the virus in the subsequent period. The main difference between the two cases is the number of tests during  ...\n There is a strong relationship between the number of tests performed and the number of cases identified across countries (see diagram below). There is also evidence that the statistics emerging on Susceptible, Infected, Recovered, and Dead people (SIRD) from tests are not representative of the underlying populations ( http://lapogianni.blogspot.com/). This justifies the repeated calls by policy makers for “testing, testing, testing ”. It also emphasizes the importance of conducting mass  ...", "posttime": "2020-05-02 17:42:35", "tags": "病毒,冠状病毒,测试,testing,检测", "title": "全部测试还是部分测试？一个小镇在检测每个人的冠状病毒方面的关键一课", "title_en": "Testing for all or some? A town's key lesson in testing everyone for Covid-19", "transed": 0, "url": "https://blogs.worldbank.org/opendata/covid-19-testing-all-or-testing-some-towns-key-lesson-testing-everyone-coronavirus", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["病毒", "冠状病毒", "测试", "testing", "检测"]}]