[{"category": "", "categoryclass": "", "imagename": "83ed21d4def2ab6f46a99fa991df739a.png", "infoid": 1005095, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Unionen和中美合作所与游戏发行商联手确保瑞典所有Paradox工作室的利益并制定标准。\n斯德哥尔摩-2020年6月3日-Paradox Interactive是一家集体讨价还价的游戏的发行商和开发商，该公司今天宣布，该公司与其员工工会、Unionen和中美合作所之间的集体协议即将完成。根据协议条款，Paradox员工有一个正式的方式来影响他们的工资、福利、责任等。该协议将适用于自实施之日起在瑞典境内工作的所有Paradox员工，预计将在本季度内敲定。\nParadox Interactive的首席人力资源官玛丽娜·赫德曼(Marina Hedman)说：“在我们运营的20多年里，Paradox一直是一家不断增长的公司，但在过去的几年里，这种增长尤其引人注目。”我们这种规模的组织有不同的需求，我们必须确保我们的员工继续感到被重视和有能力塑造我们的公司，即使我们的结构转向更大的团队和项目。无论是作为一家瑞典公司，还是作为游戏行业的一员，我们都为能将我们的名字加入支持工会的公司名单而感到自豪。“。\n该协议有助于将许多现行的Paradox公司标准奉为神圣，确保员工福利、职业发展道路和工资预期继续满足每个人的需求。该协议将适用于Paradox在瑞典境内的工作室，包括Paradox Interactive、Paradox Development Studio、Paradox北极和Paradox Malmö。\n“就像Paradox本身一样，这里的工会在过去几年里得到了大规模的发展，逐渐变得越来越有组织性。这是一个明确的迹象，表明我们的努力已经导致了有意义的变化。Paradox Development Studio的游戏程序员、Unionen工会代表Magne Skjæran说：“我们很高兴公司同意我们集体协议的好处，我们一起签署了这份协议。“有了这项协议，我们将进一步有权在Paradox这里为我们的成员辩护，并为使其成为该行业最佳的工作场所做出贡献。我们希望这将激励人们在世界各地的视频游戏公司中组织起来。“", "note_en": "Unionen and SACO Join with Games Publisher to Secure Benefits and Set Standards at All Paradox Studios across Sweden\n STOCKHOLM – June 3, 2020-          Paradox Interactive, a publisher and developer of games that are collectively a bargain, today announced the impending completion of a collective agreement between the company and its employees’ labor unions, Unionen and SACO. Under the terms of the agreement, Paradox employees have a formalized means of influencing their pay, benefits, responsibilities, and more. The agreement will apply to all Paradox employees working at locations within Sweden as of its implementation, expected to be finalized within the quarter.\n “In the 20-plus years we’ve been in operation, Paradox has always been a growing company, but that growth has been especially dramatic in the last few years,” said Marina Hedman, Chief Human Resources Officer at Paradox Interactive. “An organization of our size has different needs, and we must ensure that our employees continue to feel valued and empowered to shape our company, even as our structure shifts towards larger teams and projects. We’re proud, both as a Swedish company and as a member of the games industry, to add our name to the roster of companies who support unionization.”\n The agreement helps enshrine a number of current Paradox company standards, ensuring that employee benefits, paths to career growth, and salary expectations continue to meet everybody’s needs. The agreement will apply to Paradox’s studios located within Sweden, including Paradox Interactive, Paradox Development Studio, Paradox Arctic, and Paradox Malmö.\n “Much like Paradox itself, the unions here have been growing massively in the past few years, gradually becoming more and more organized. This is a clear sign that our efforts have resulted in meaningful change. We’re very glad that the company agrees with us on the benefits of a collective agreement and that we’re signing this together,” said Magne Skjæran, Games Programmer at Paradox Development Studio and Union Representative for Unionen. “With this agreement in place, we will be further empowered to advocate for our members here at Paradox, and contribute to making it the best place to work in the industry. We hope it will inspire people to organize in video game companies the world over.”", "posttime": "2020-06-04 10:17:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "签订,interactive,paradox", "title": "悖论互动与工会签订集体谈判协议", "title_en": "Paradox Interactive to Sign Collective Bargaining Agreement with Labor Unions", "transed": 1, "url": "https://www.paradoxinteractive.com/en/paradox-interactive-to-sign-collective-bargaining-agreement-with-labor-unions/", "via": "", "real_tags": ["签订", "paradox"]}, {"category": "", "categoryclass": "", "imagename": "5abf05ef4a5b3d530c3a2888e0598bf8.jpg", "infoid": 1005094, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "来自莫纳什大学和CSIRO的研究人员已经创造了二氧化碳捕获和储存(CCS)的纪录，他们使用的技术类似于充满微小磁铁的海绵。利用一种可以以惊人的速度和低成本再生的金属有机骨架(MOF)纳米复合材料，研究人员开发出了海绵状技术，可以从多种来源捕获二氧化碳，甚至直接从空气中捕获二氧化碳。\n使用与电磁炉相同的技术，磁性海绵被用来去除二氧化碳，所用能量是任何其他报道方法的三分之一。\n莫纳什大学CSIRO和化学工程系副教授Matthew Hill和莫纳什大学化工系Muhammad Munir Sadiq博士领导了这项研究。\n在这项发表在“细胞报告物理科学”(Cell Reports Physical Science)上的研究中，研究人员设计了一种名为M-74 CPT@PTMSP的独特吸附材料，其能源成本仅为1.29MJ kg-1CO2，创历史新低，比商业部署的材料低45%，并且是有记录以来最好的CCS效率。\nMOF是一类由金属离子组成的化合物，形成的晶体材料的表面积是已知材料中最大的。事实上，MOF是如此多孔，以至于它们可以将足球场的整个表面都装进一茶匙。\n这项技术使储存、分离、释放或保护有价值的商品成为可能，使公司能够开发高价值的产品。\n希尔副教授说，全球对不断上升的温室气体排放水平和相关问题的担忧再次引发了减少排放和发展绿色和可再生替代能源的呼声。\n然而，现有的商业碳捕获技术使用像单乙醇胺这样的胺，这种胺腐蚀性强，能源密集型，从大气中捕获的碳数量有限。\n我们的研究表明，对于任何固体多孔吸附剂，包括单乙醇胺、哌嗪和其他胺，计算出的再生能量是最低的。这使得它成为一种廉价的方法，可以与可再生太阳能配对，从大气中捕获多余的能量。\n从本质上说，我们可以从任何地方捕获二氧化碳。我们目前的重点是通过所谓的负排放技术直接从空气中捕获。\n对于用于CCS应用的MOF来说，具有易于制造且具有良好稳定性和性能的材料是必不可少的。\nM-74CPT@PTMSP的稳定性是通过估计研究人员通过磁感应摆动吸附(MISA)过程在连续20个循环中捕获和释放的CO2和H2O的量来评估的。\nM-74CPT@PTMSP计算的再生能是报道的所有固体多孔吸附剂中最低的。在14mT和15mT磁场下，计算出M-74CPT的再生能分别为1.29和1.44mJ·kg·CO2~(-1)。引用：澳大利亚研究人员创造了二氧化碳捕获记录(2020年6月3日)，从https://phys.org/news/2020-06-australian-carbon-dioxide-capture.html检索到。\n本文档受版权保护。除为私人学习或研究的目的而进行的任何公平交易外，未经书面许可不得复制任何部分。提供的内容仅供参考。", "note_en": "Researchers from Monash University and the CSIRO have set a record for carbon dioxide capture and storage (CCS) using technology that resembles a sponge filled with tiny magnets.    Using a Metal Organic Frameworks (MOFs) nanocomposite that can be regenerated with remarkable speed and low   cost, researchers have developed sponge-like technology that can capture   dioxide from a number of sources, even directly from air.\n  The magnetic sponge is used to remove carbon dioxide using the same techniques as induction cooktops using one-third of the energy than any other reported method.\n  Associate Professor Matthew Hill (CSIRO and Department of Chemical Engineering, Monash University) and Dr. Muhammad Munir Sadiq (Department of Chemical Engineering, Monash University) led this research.\n  In the study, published in  Cell Reports Physical Science, researchers designed a unique adsorbent material called M-74 CPT@PTMSP that delivered a record low energy cost of just 1.29 MJ kg-1CO2 , 45 per cent below commercially deployed materials, and the best CCS efficiency recorded.\n  MOFs are a class of compounds consisting of metal ions that form a crystalline material with the largest surface area of any material known. In fact, MOFs are so porous that they can fit the entire surface of a football field in a teaspoon.\n  This technology makes it possible to store, separate, release or protect valuable commodities, enabling companies to develop high value products.\n  &#34;Global concerns on the rising level of greenhouse gas emissions and the associated   has led to renewed calls for emissions reduction and the development of green and renewable alternative energy sources,&#34; Associate Professor Hill said.\n  &#34;However, existing commercial carbon capture technologies use amines like monoethanolamine, which is highly corrosive, energy intensive and captures a limited amount of carbon from the atmosphere.\n  &#34;Our research shows the lowest reported regeneration energy calculated for any solid porous adsorbent, including monoethanolamine, piperazine and other amines. This makes it a cheap method that can be paired with renewable solar energy to capture excess   from the atmosphere.\n  &#34;Essentially, we can capture CO2 from anywhere. Our current focus is for capture directly from the air in what are known as negative emissions technologies.&#34;\n  For MOFs to be used in CCS applications, it is essential to have materials that can be easily fabricated with good stability and performance.\n  The stability of M-74 CPT@PTMSP was evaluated by estimating the amount of CO2 and H2O captured and released via the researchers&#39; magnetic induction swing adsorption (MISA) process over 20 consecutive cycles.\n  The regeneration energy calculated for M-74 CPT@PTMSP is the lowest reported for any solid porous adsorbent. At magnetic fields of 14 and 15 mT, the regeneration energy calculated for M-74 CPT was 1.29 and 1.44 MJ kg CO2-1.             Citation: Australian researchers set record for carbon dioxide capture (2020, June 3) retrieved 3 June 2020 from https://phys.org/news/2020-06-australian-carbon-dioxide-capture.html\n  This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.", "posttime": "2020-06-04 10:01:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "研究,researchers", "title": "澳大利亚研究人员创下二氧化碳捕获纪录", "title_en": "Australian researchers set record for carbon dioxide capture", "transed": 1, "url": "https://phys.org/news/2020-06-australian-carbon-dioxide-capture.html", "via": "", "real_tags": ["研究"]}, {"category": "", "categoryclass": "", "imagename": "578b130041cc13853a202688ef5f67f7.jpeg", "infoid": 1005091, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "柏林(路透社)-德国将禁止护照照片的“变形”，即两个人的照片通过数字方式组合在一起，这样就有可能为一份文件分配多个身份。\n变形可以欺骗用于护照控制的人工智能来“识别”不同的人。\n发言人斯特芬·塞伯特(Steffen Seibert)表示，政府周三支持一项法律，要求人们要么在护照办公室拍照，要么如果使用摄影师，则通过安全连接以数字形式提交照片。\n弗劳恩霍夫计算机图形研究所(Fraunhofer Institute For Computer Graphics)的研究人员发现，可以变形甚至没有血缘关系的不同人的面孔照片。\n一定程度的相似性就足够了，比如眼睛是对齐的。研究人员发现，这种对照片的操纵通常是人眼看不见的。", "note_en": "BERLIN (Reuters) - Germany will outlaw the ‘morphing’ of passport photos, in which pictures of two people are digitally combined, making it possible to assign multiple identities to a single document.\n Morphing can trick artificial intelligence used at passport control into ‘recognising’ different individuals.\n The government on Wednesday backed a law requiring people to either have their photo taken at a passport office or, if they use a photographer, have it submitted in digital form over a secure connection, spokesman Steffen Seibert said.\n Researchers at the Fraunhofer Institute for Computer Graphics have found that it is possible to morph photos of the faces of different people who are not even related.\n A certain degree of similarity is sufficient, such as the eyes being aligned. Such manipulation of photos is typically invisible to the human eye, the researchers found.", "posttime": "2020-06-04 09:37:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "禁止,bans,照片", "title": "德国禁止数字二重身护照照片", "title_en": "Germany Bans Digital Doppelganger Passport Photos", "transed": 1, "url": "https://www.reuters.com/article/us-germany-tech-morphing/germany-bans-digital-doppelganger-passport-photos-idUSKBN23A1YM", "via": "", "real_tags": ["禁止", "bans", "照片"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005090, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转导航跳转搜索东京波纳是一种哲学、艺术、构造性语言，以词汇量小著称。它是由加拿大语言学家和翻译家索尼娅·朗(Sonja Lang)创作的，目的是简化思想和交流。它于2001年作为草稿首次在网上发表[3]，后来在2014年出版的“Toki Pona：The Language of Good”一书中以完整形式发表。21世纪初，一个小型的演讲者社区发展起来。[4]社区在官方图书发布后不断增长，并且自出版以来一直在不断扩大。虽然活动大多在网上聊天室、社交媒体和其他小组中进行，但在2010年代也有一些有组织的面对面会议。\n东京波纳的基本特征是极简主义。它专注于简单的普遍概念，用很少的东西来表达最多。这种语言是孤立的，有120-125个词根单词和14个音素，很容易在不同的语言之间发音。然而，它并不是为了成为一种国际辅助语言而创建的。受到道家哲学的启发，根据萨皮尔-沃尔夫假说，该语言旨在帮助用户专注于基本的事情，并促进积极思维。尽管词汇量很小，但说话者之间能够理解和交流，主要依靠上下文和几个单词的组合来表达更具体的意思。[5][6][7]。\n该语言的名称由Toki(语言)和pona(好/简单)组成，Toki(语言)源于Tok Pisin tok，而poa(好/简单)，从世界语到Bona(好)，[8]最终来自拉丁语奖金。[9]。\n索尼娅·朗(Née Elen Kisa)[10]开始开发Toki Pona，以此作为她在抑郁期间简化思维的一种方式。\n语言的主要目标之一是关注极简主义。它的设计目的是以最小的复杂性表达最大的意义。[7][11]就像洋泾渭语一样，它关注的是在不同文化中普遍存在的简单概念和元素。[11][12]它有120-125个根词，14个音素，设计成对不同语言背景的人来说很容易发音。[12]。\n受到道家哲学的启发，Toki Pona的另一个目标是通过将复杂的概念简化为基本元素来帮助用户专注于本质[13]，并从思维过程中去除复杂性。[5][14]从这些简单的概念出发，可以通过简单的组合产生更复杂的想法。[11]这允许用户看到所表达的想法的基本性质和效果。[5]。\n就像萨皮尔-沃尔夫假说指出，一种语言会改变说话者的思维和行为方式，[1]Toki Pona试图诱导积极的思考。[15]。\n语言的另一个目的是让使用者意识到当下的时刻，更多地关注周围的环境和人们使用的词语。[14]据它的作者说，它应该是有趣和可爱的。[16]\n虽然它不打算作为一种国际辅助语言[15]，但世界各地的人们都在使用它进行交流。[14]。\nSonja Lang于2001年在网上发布了该语言的早期版本，[1][17]，并迅速流行起来。[18]早期活动发生在雅虎！一群人。小组成员用英语、Toki Pona和世界语互相讨论了该语言，提出了修改建议，并讨论了tokipona.org站点上的资源。在其成员数量的高峰期，该组织的成员略高于500人。[1]小组中的信息使用phpBB在Toki Pona论坛存档。\n郎平后来在2014年出版了一本关于这种语言的官方书籍，名为Toki Pona：The Language of Good。[3]在Toki Pona社区，它有时也被称为PU。[19]2016年，该书也以法语出版。[20]虽然社区已经创建了该语言的其他资源，但主要的学习资源仍然是由Bryant Knight或早期采用Toki Pona的Bryant Knight或Jan Pije；开发的书籍和在线课程。[20][21]。\n2008年，一份ISO 639-3代码的申请被拒绝，声明称这种语言太年轻了。[22]2018年，另一项申请被拒绝，因为这种语言似乎没有在各种领域使用，也没有在包括所有年龄段的社区内进行交流。[23]。\nToki Pona是一些科学著作的主题[6]，它还被用于人工智能和软件工具，[20]，以及一种通过让患者用语言跟踪他们的想法来消除负面思维的治疗方法。[1]2010年，它被选为ROILA项目的第一版词汇表。本研究的目的是考察人工语言的使用对机器语音识别准确率的影响，结果表明，Toki Pona修改后的词汇显著优于英语。[24]。\nToki Pona有九个辅音(/p，t，k，s，m，n，l，j，w/)和五个元音(/a，e，i，o，u/)，这里用国际音标符号表示。重音落在单词的第一个音节上。没有双元音，没有对比鲜明的元音长度，没有辅音簇(除了那些以鼻尾开头的)，也没有声调。[6]它的声音目录和音韵学都与大多数人类语言兼容，因此很容易获取。[3]。\n与其他语言相比，统计元音分布是相当典型的。[6]每根数一次，32%的元音是/a/，25%的元音是/i/，其中/e/和/o/各略高于15%，10%的元音是/u/。[6]在10kb的文本样本中，使用频率稍有偏差：34%/a/、30%/i/、15%/e/和/o/，以及6%/u/。[25]。\n在音节声母中，/l/是最常见的，占总数的20%；/k，s，p/占10%以上，其次是鼻音/m，n/(不包括尾音N)，最不常见的是/t，w，j/，每个略高于5%。/l/的高频率和/t/的低频率在世界语言中有些不寻常。[6]\n所有音节都是(C)V(N)形式，即可选辅音+元音+可选韵母鼻音，或V，CV，VN，CVN。和大多数语言一样，CV是最常见的音节类型，占75%(每个词根数一次)。V音节和CVN音节都在10%左右，而只有5个单词有VN音节(占音节的2%)。[6]。\n大多数词根(70%)是双音节的，大约20%是单音节的，10%是三音节的。这是一种常见的分布，与波利尼西亚语相似。[6]。\n不允许使用以下序列：*/ji、Wu、wo、ti/，音节的尾鼻音也不能出现在/m/或/n/之前。20%的词根是元音首字母。[6]不是单词首字母的音节必须有声母。[20]。\n专有名词通常按照一套准则转换成Toki Pona专有形容词。[26]使用本地发音，甚至是口语发音作为后续发音转换的基础。因此，英格兰或英格兰变成了英利，约翰变成了桑人。[27][27]。\n音节末尾的鼻音可以发音为任何鼻塞音，尽管它通常被同化为下面的辅音。也就是说，它通常出现在/n/、/t/、/s/或/l/之前的[n]，出现在/m/、/p/或/w/之前的[m]，出现在/k/之前的[ŋ]，以及出现在/j/之前的[ɲ]。[6]。\n因为它的音素库很小，Toki Pona允许相当多的音素变化。例如，/p t k/可以读为[b dɡ]、[p t k]、/s/as[z]或[ʃ]以及[s]、/l/as[ɾ]和[l]，元音可以长也可以短。[6]。\n14个拉丁字母a e i j k l m n o p s t u w用于书写这种语言。它们与国际音标中的值相同：[28]j听起来像英语y，元音像西班牙语或意大利语。大写字母用来标记适当的形容词，而Toki Pona词根总是用小写字母书写，即使它们开始一个句子。[12]。\n除了拉丁字母，这是最方便和最常用的书写语言的方式，两个标志书写系统，sitelen pona和sitelen sitelen，后来被引入并包括在Toki Pona：The Language of Good中。前者，其中每个单词都用一个符号表示，是郎平自己设计的另一种选择。它被描述为一种象形文字一样的文字，利用了曲折和其他孩子般的形状。专有名称是用一系列符号写在一个类似于卡通画的符号内的，其中每个符号代表其单词的第一个字母。[29][29]适当的名字是用一系列符号写在一个类似卡通画的符号里的，其中每个符号代表它的单词的第一个字母。表示单个形容词的符号可以写在它们所修饰的前一个单词的符号内或符号之上。[30]该语言的符号用Sitelen pona写成[29]，在Toki的符号内写有pona的符号。它也是用字体中使用的符号来书写的，比如丁丁蝙蝠、数学符号等等。[12]\n后一种系统，Sitelen Sitelen，是由乔纳森·加贝尔(Jonathan Gabel)创建的。它更精致，视觉上更像玛雅文字。[19]该非线性标志系统使用两种不同的方法来构成单词：表示整个单词的图像和表示音节的图像，这些图像由表示每个音素的字素组成。[31]使用这个系统的困难及其吸引人的设计是人们放慢脚步，探索语言和沟通方式如何影响思维的一种方式。[32][font=宋体]。\n此外，来自社区的个人还改编了许多其他剧本来写东京波纳，比如韩国语或J·R·R·托尔金(J.R.R.Tolkien)的《腾瓦尔》(Tengwar)。[6]。\nToki Pona的词序是主语-动词-宾语。[33]词li介绍谓语，e介绍直接宾语，介词短语紧跟在宾语之后，la短语出现在主语之前，以增加额外的上下文。[20]。\n有些词根是语法功能的助词，而另一些词根则具有词汇意义。词根不属于定义明确的词性；相反，它们通常可以用作名词、动词、修饰语或感叹词，这取决于上下文或它们在短语中的位置。[34]例如，ona li moku可能意味着他们吃了或者是食物。[6]。\n有些感叹词有a、ala、ike、jaki、mu、o、pakala、pona、Toki等，可以单独作为句子使用。[35]。\n语句遵循主谓的正常结构，开头有一个可选的la短语。除非主语是mi或sinina本身，否则li一词总是出现在谓语之前。直接宾语标记e在直接宾语之前。更多的li和e标记可以引入新的谓语或直接宾语。[20]职业短语出现在主句之前，并在短语末尾、收信人之后用o标记。[35]。\n在命令中，单词o出现在动词之前，表示第二人称命令。它也可以代替李，或者在主题mi或sinina之后出现，以表达愿望。[35]。\n在Toki Pona中有两种方式形成是非疑问句。第一种方法是使用动词ALA动词结构，在该结构中，ALA位于重复动词、助动词或其他谓语之间。形成是非疑问句的另一种方式是把“是”和“不是”放在一起。否则呢？)。在一句话的末尾。问题不能仅仅通过在句子末尾加一个问号来提出。[36]\nToki Pona有基本的代词：mi(第一人称)、新浪(第二人称)和ona(第三人称)。[37]。\n代词没有指定数字或性别。因此，ona可以指他、她、她。在实践中，说东京都波纳语的人使用短语mi mute来表示“我们”的意思，尽管这个数字通常是从上下文中辨别出来的，因此只有mi是必要的。同样，a mute的意思可能是“他们”，而新浪的“哑巴”意思是“你”(复数)。[35]。\n当一个句子的主语是未修饰的代词mi或sina时，就不能用li来分隔主语和谓语。[20]。\n由于词根词汇量如此之小，Toki Pona严重依赖名词短语，即名词由紧随其后的词根修饰，以产生更复杂的意义。一个典型的例子是将Jan(人)和Utala(战斗)组合成Jan Utala(士兵，战士)。[38][下一步请参阅修饰语。]。\n名词不会按数字递减。[35]根据上下文的不同，Jan可以指人、人或人。[11]。\nToki Pona不使用孤立的专有名词；相反，它们必须修饰前面的名词。出于这个原因，它们可能被称为专有形容词，或者简称为“专有词语”，而不是“专有名词”。[13]例如，人名和地名用作&#34；人名&#34；和&#34；地点&#34；的共同词根的修饰语，例如ma Kanata(Lit.。加拿大国家(&#34；)或Jan Lisa(文学)。&#34；Lisa Person&#34；)。[6]。\nToki Pona中的短语是首字母；修饰语总是在它们所修饰的单词之后。[21]因此，Soweli Utala，字面意思是战斗的动物，是一种战斗的动物，而Utala Soweli，字面意思是战斗的动物，意味着动物战争。[6]。\n当一个短语加上第二个修饰语时，例如Jan pona Lukin，它会修饰它前面的所有修饰语，因此((Jan Pona)Lukin)=&#34；Friend Watning&#34；，而不是(Jan(Pona Lukin))，&#34；Person-Good&34；。[6]\n粒子pi，&#34；可以放在头部之后和修饰语之前，以将修饰词组合成另一个用作修饰头部的单位的短语，因此Jan pi pona Lukin=(Jan pi(Pona Lukin))，&#34；好看的人&#34；。在这种情况下，Lukin修饰pona，而pona Lukin作为整体修饰Jan。\nToki Pona不根据人称、时态、语气或声音来改变动词的词尾变化，因为这种语言没有任何词尾变化。人称是从动词的主语推断出来的；时间是从上下文或句子中的时间副词推断出来的，作为一个子句。[35]。\n介词可以用作动词的一种。例如，tawa表示&#34；to&#34；作为介词，&#34；to go&#34；，&#34；to to&#34；or&#34；to to&#34；to to&#34；or&#34；to&#34；in&#34；or&#34；at&#34；作为介词，&#34；处于/at&#34；或&#34；to be&#34；or&#34；to be&#34；to be&#34；to to&#34；or&#34；to to&#34；to&#34；or&#34；to be&#34；to be&#34；将&#34；或&#34；与&#34；(从工具格的意义上)连用作介词，将&#34；用作动词。来自介词词根的动词的宾语紧跟其后，没有直接宾语标记e，这与它们用作介词时的情况类似。[35]。\nToki Pona通常被认为有大约120、[39]、123、[40]或125[6][41]个词根。[42]这些词都是多义词，可以看作是一组相似的概念，[19]所以苏里不仅指大的或长的，而且重要。[6]它们的使用在很大程度上依赖于上下文[5]和隐喻。[3]要表达更复杂的思想，可以将词根组合起来。[17]例如，Jan pona可以表示朋友，尽管字面上翻译为善良/友好的人，而telo NASA，字面意思是奇怪的水或疯狂的液体，根据上下文可能被理解为酒精或酒精饮料。[35]动词“教”可以用Pana e Sona来表示，字面意思是“传授知识”。[18]本质上相同的概念可以用不同的词来描述，因为选择取决于说话人的感知和经验。[3]。\nToki Pona有五个表示颜色的词根：pimeja(黑色)、walo(白色)、loje(红色)、jelo(黄色)和laso(蓝色和绿色)。[14]虽然颜色的简化概念化倾向于排除西方语言中通常表达的一些颜色，但说话者有时可能会将这五个词结合起来对某些颜色进行更具体的描述。例如，紫色可以用laso和loje组合表示。短语laso loje的意思是略带红色的蓝色，loje laso的意思是蓝色的红色。[6]。\nToki Pona有一个(Wan)、两个(Tu)和许多(Mute)的词根。此外，ALA可以表示零，尽管其更多的字面意思是&#34；NO&#34；或&#34；NONE，&#34；ALL&#34；ALL&#34；可以表示无限或巨大的数量。[43]。\n最简单的数字系统使用这五个根来表示所需的任何数量。对于大于2的数字，说话者会使用静音，这意味着很多。[35]。\n更复杂的系统通过使用图万表示三、图表示四等短语来加法表示较大的数字。此功能故意使大量通信变得不切实际。[13]\n郎朗的书中描述了另一种表示较大数字的系统，它用卢卡(字面意思是手形)表示&#34；5；，用静音(字面意思是许多)表示##34；20；，用黄色(字面意思是全部)表示&#34；100；。例如，使用这个结构ale tu表示102&34；，而静音Luka tu wan表示78#34；78。[44][44]。\n有些词有过时的同义词。例如，在语言发展的早期，由于未知的原因，妮娜取代了卡帕(突起)。后来，代名词Iki(他，她，它，他们)取代了Iki(他，她，它，他们)，后者有时会与Ike(不好的)混淆。[13]。\n同样，为了避免在减少非重读元音的人中与ala(no，not)混淆，添加了Ali作为ale(All)的替代，尽管这两种形式仍然在使用。[45]。\n最初，oko的意思是眼睛，而卢金被用作动词。这些意思后来被合并到卢金中，OKO是另一种选择。然而，大多数用户倾向于遵循传统的定义。[46][中英文对照]。\n简单地从词典中删除的单词包括leko(街区，楼梯)，monsuta(怪物，恐惧)，Majuna(旧)，pata(兄弟姐妹)。[47]。\n除了取代现有词根的Nena和ona之外，在原来的118个词根的基础上增加了几个词根：PAN(谷物，面包，意大利面，大米)，eSun(市场，商店，贸易)，ALASA，(狩猎，聚集)，kipisi，(切)，和namako(额外的，额外的，香料)，另一个词是罪恶(新的)。[48][48]。\n基皮西、马古纳和蒙苏塔现在被认为是过时的，因为它们没有包括在官方书籍中。[47]。\n大多数Toki Pona词根来自英语、Tok Pisin、芬兰语、乔治亚语、荷兰语、阿卡迪亚语、法语、世界语和克罗地亚语，也有少数来自汉语(普通话和粤语)。[8]\n这些派生中的许多都是透明的。例如，oko(眼)与斯拉夫语oko相同，并与西班牙语Ojo、意大利语occhio和英语occhio等其他同源词相似；Toki(language，language)与Tok Pisin tok及其英文源talk相似，而来自世界语到Bona的pona(Good，Positive)则反映了普通罗曼语bon、buona、英语奖金等。然而，简单的语音系统要求发音发生变化，往往使其他单词的来源更难辨认。例如，单词Lape(睡觉，休息)来自荷兰语slapen，与英语睡眠同源；kepeken(使用)从荷兰语gebroiken有点歪曲，hagedis(蜥蜴)的akesi几乎认不出来。[因为*ti在Toki Pona中是非法音节，荷兰语di变成si。][8]。\n虽然只有14个词根(12%)被列为源自英语，但大量的托皮辛语、世界语和其他词根与英语有明显的同源关系，这增加了英语友好的部分。\n..", "note_en": "Jump to navigation  Jump to search  Toki Pona is a  philosophical  artistic  constructed language known for its small vocabulary. It was created by Canadian linguist and translator Sonja Lang  [1]  for the purpose of simplifying thoughts and communication.  It was first published online in 2001 as a draft,  [3] and later in complete form in the book  Toki Pona: The Language of Good in 2014. A small community of speakers developed in the early 2000s.  [4] The community grew after the release of the official book and has continued to grow larger since its publication. While activity mostly takes place online in chat rooms, on social media, and in other groups, there were a few organized in-person meetings during the 2010s.\n The underlying feature of Toki Pona is  minimalism. It focuses on simple universal concepts, making use of very little to express the most. The language is  isolating and has 120–125  root words and 14  phonemes that are easy to pronounce across different languages. However, it was not created to be an  international auxiliary language. Inspired by  Taoist philosophy, the language is designed to help users concentrate on basic things and to promote positive thinking, in accordance with the  Sapir–Whorf hypothesis. Despite the small vocabulary, speakers are able to understand and communicate with each other, mainly relying on context and combinations of several words to express more specific meanings.  [5]  [6]  [7]\n   The name of the language is constituted by  toki (language), derived from  Tok Pisin  tok, which itself comes from English  talk; and  pona (good/simple), from  Esperanto  bona (good),  [8] ultimately from Latin  bonus.  [9]\n  Sonja Lang (née Elen Kisa)  [10] started developing Toki Pona as a way of simplifying her thoughts during depression.\n One of the language&#39;s main goals is a focus on minimalism. It is designed to express maximal meaning with minimal complexity.  [7]  [11] Like a pidgin, it focuses on simple concepts and elements that are universal among cultures.  [11]  [12] It has 120–125 root words, and 14 phonemes devised to be easy to pronounce for speakers of various language backgrounds.  [12]\n Inspired by Taoist philosophy, another goal of Toki Pona is to help its users focus on the essentials by reducing complex concepts into basic elements  [13] and remove complexity from the thought process.  [5]  [14] From these simple notions, more complex ideas can be created by simple combining.  [11] This allows the users to see the fundamental nature and effect of the ideas expressed.  [5]\n Like the Sapir–Whorf hypothesis, which states that a language changes the way its speakers think and behave,  [1] Toki Pona tries to induce positive thinking.  [15]\n Another aim of the language is for the users to become aware of the present moment and pay more attention to the surroundings and the words people use.  [14] According to its author, it is meant to be &#34;fun and cute&#34;.  [16]\n Although it was not intended as an international auxiliary language,  [15] people from all around the world use it for communication.  [14]\n  An early version of the language was published online in 2001 by Sonja Lang,  [1]  [17] and it quickly gained popularity.  [18] Early activity took place in a  Yahoo! group. Members of the group discussed the language with one another in English, Toki Pona, and Esperanto, proposed changes, and talked about the resources on the  tokipona.org site. At its peak member count, the group had a little over 500 members.  [1] Messages in the group were archived in the Toki Pona forum using  phpBB.\n  Lang later released an official book on the language,  Toki Pona: The Language of Good, in 2014.  [3] It is also sometimes referred to as  pu in the Toki Pona community.  [19] In 2016, the book was also published in French.  [20] Although other resources for the language have been created by the community, the major sources for learning continue to be Lang&#39;s book and online lessons developed by Bryant Knight or &#34;jan Pije&#34;, an early adopter of Toki Pona.  [20]  [21]\n In 2008 an application for an  ISO 639-3 code was rejected, with a statement that the language was too young.  [22] Another request was rejected in 2018 as the language &#34;does not appear to be used in a variety of domains nor for communication within a community which includes all ages&#34;.  [23]\n Toki Pona was the subject of some scientific works,  [6] and it has also been used for artificial intelligence and software tools,  [20] as well as a therapeutic method for eliminating negative thinking by having patients keep track of their thoughts in the language.  [1] In 2010 it was chosen for the first version of the vocabulary for the  ROILA project. The purpose of the study was to investigate the use of an artificial language on the accuracy of  machine speech recognition, and it was revealed that the modified vocabulary of Toki Pona significantly outperformed English.  [24]\n   Toki Pona has nine  consonants ( /p, t, k, s, m, n, l, j, w/) and five  vowels ( /a, e, i, o, u/), shown here with the  International Phonetic Alphabet symbols. Stress falls on the initial syllable of a word. There are no  diphthongs,  contrasting  vowel length,  consonant clusters (except those starting with the nasal coda), or  tones.  [6] Both its sound inventory and  phonotactics are compatible with the majority of human languages, and are therefore readily accessible.  [3]\n    The statistical vowel spread is fairly typical when compared with other languages.  [6] Counting each root once, 32% of vowels are  /a/, 25% are  /i/, with  /e/ and  /o/ a bit over 15% each, and 10% are  /u/.  [6] The usage frequency in a 10kB sample of texts was slightly more skewed: 34%  /a/, 30%  /i/, 15% each  /e/ and  /o/, and 6%  /u/.  [25]\n Of the syllable-initial consonants,  /l/ is the most common, at 20% total;  /k, s, p/ are over 10%, then the nasals  /m, n/ (not counting final N), with the least common, at little more than 5% each, being  /t, w, j/. The high frequency of  /l/ and low frequency of  /t/ is somewhat unusual among the world&#39;s languages.  [6]\n  All syllables are of the form (C)V(N), i.e. optional consonant + vowel + optional final nasal, or V, CV, VN, CVN. As in most languages, CV is the most common syllable type, at 75% (counting each root once). V and CVN syllables are each around 10%, while only 5 words have VN syllables (for 2% of syllables).  [6]\n Most roots (70%) are disyllabic; about 20% are monosyllables and 10% trisyllables. This is a common distribution, and similar to Polynesian.  [6]\n  The following sequences are not allowed: * /ji, wu, wo, ti/, nor may a syllable&#39;s final nasal occur before  /m/ or  /n/ in the same root. 20% of roots are vowel initial.  [6] Syllables that aren&#39;t word-initial must have an initial consonant.  [20]\n Proper nouns are usually converted into Toki Pona proper adjectives using a set of guidelines.  [26] The native, or even colloquial, pronunciation is used as the basis for the subsequent sound conversion. Thus, England or English become  Inli and John becomes  San.  [27]\n  The nasal at the end of a syllable can be pronounced as any nasal stop, though it is normally assimilated to the following consonant. That is, it typically occurs as an  [n] before  /n/,  /t/,  /s/ or  /l/, as an  [m] before  /m/,  /p/ or  /w/, as an  [ŋ] before  /k/, and as an  [ɲ] before  /j/.  [6]\n Because of its small phoneme inventory, Toki Pona allows for quite a lot of allophonic variation. For example,  /p t k/ may be pronounced  [b d ɡ] as well as  [p t k],  /s/ as  [z] or  [ʃ] as well as  [s],  /l/ as  [ɾ] as well as  [l], and vowels may be either long or short.  [6]\n  14  Latin letters,  a e i j k l m n o p s t u w, are used to write the language. They have the same values as in the  International Phonetic Alphabet:  [28]  j sounds like English  y, and the vowels are like those of  Spanish or  Italian. Capital initials are used to mark  proper adjectives, while Toki Pona roots are always written with lowercase letters, even when they start a sentence.  [12]\n  Besides the Latin alphabet, which is the most convenient and most used way of writing the language, two  logographic writing systems,  sitelen pona and  sitelen sitelen, were later introduced and included in  Toki Pona: The Language of Good. The former, in which each word is represented by a symbol, was devised as an alternative by Lang herself. It has been described as &#34;a hieroglyphic-like script that makes use of squiggles and other childlike shapes.&#34;     [29] Proper names are written inside a  cartouche-like symbol using a series of symbols, where each symbol represents the first letter of its word. Symbols representing a single adjective may be written inside or above the symbol for the preceding word that they modify.  [30] The symbol of the language is written in  sitelen pona,  [29] with the symbol for  pona written inside the symbol for  toki. It has also been written with symbols used in fonts such as dingbats, mathematical symbols, and so on.  [12]\n  The latter system,  sitelen sitelen, was created by Jonathan Gabel. It is more elaborate and visually resembles the  Mayan script.  [19] This non-linear logographic system uses two separate methods to form words: images representing whole words, and images that represent syllables, composed of  graphemes representing each  phoneme.  [31] The difficulty of using this system along with its appealing design is a way for people to slow down and explore how not only the language but also the method of communication can influence thinking.  [32]\n In addition, individuals from the community have adapted many other scripts to write Toki Pona, such as Korean  Hangul or  J. R. R. Tolkien&#39;s  Tengwar.  [6]\n  Toki Pona&#39;s word order is  subject–verb–object.  [33] The word  li introduces predicates,  e introduces direct objects, prepositional phrases follow the objects, and  la phrases come before the subject to add additional context.  [20]\n Some roots are particles for grammatical functions, while others have  lexical meanings. The lexical roots do not fall into well defined  parts of speech; rather, they may generally be used as nouns, verbs, modifiers, or interjections depending on context or their position in a phrase.  [34] For example,  ona li moku may mean &#34;they ate&#34; or &#34;it is food&#34;.  [6]\n   Some interjections are  a,  ala,  ike,  jaki,  mu,  o,  pakala,  pona,  toki, etc. and can stand alone as a sentence.  [35]\n Statements follow the normal structure of  subject predicate with an optional  la phrase at the beginning. The word  li always comes before the predicate unless the subject is  mi or  sina by itself. The direct object marker  e comes before the direct objects. More  li and  e markers can introduce new predicates or direct objects.  [20]  Vocative phrases come before the main sentence and are marked with  o at the end of the phrase, after the addressee.  [35]\n In commands, the word  o comes before a verb to express a second person command. It can also replace  li, or come after the subjects  mi or  sina, to express wishes.  [35]\n There are two ways to form  yes-no questions in Toki Pona. The first method is to use the &#34;verb ala verb&#34; construction in which ala comes in between a duplicated verb, auxiliary verb, or other  predicators. Another way to form a yes-no question is to put &#34;anu seme?&#34; (lit. or what?) at the end of a sentence. Questions cannot be made by just putting a question mark at the end of a sentence.  [36]\n   Toki Pona has basic pronouns:  mi (first person),  sina (second person), and  ona (third person).  [37]\n The pronouns do not specify number or gender. Therefore,  ona can mean &#34;he&#34;, &#34;she&#34;, &#34;it&#34;, or &#34;they&#34;. In practice, Toki Pona speakers use the phrase  mi mute to mean &#34;we&#34;, though the number is often discernible from context and thus only  mi is necessary. Likewise,  ona mute may mean &#34;they&#34; and  sina mute would mean &#34;you&#34; (plural).  [35]\n Whenever the subject of a sentence is either of the unmodified pronouns  mi or  sina, then  li is not used to separate the subject and predicate.  [20]\n  With such a small root-word vocabulary, Toki Pona relies heavily on noun phrases, where a noun is modified by a following root, to make more complex meanings.  A typical example is combining  jan (person) with  utala (fight) to make  jan utala (soldier, warrior).  [38] [See &#39;modifiers&#39; next.]\n Nouns do not decline according to number.  [35]  jan can mean &#34;person&#34;, &#34;people&#34;,  [35] &#34;the human race&#34;, or &#34;somebody&#34;, depending on context.  [11]\n Toki Pona does not use isolated proper nouns; instead, they must modify a preceding noun. For this reason they may be called &#34;proper adjectives&#34; or simply “proper words” instead of “proper nouns”.  [13] For example, names of people and places are used as modifiers of the common roots for &#34;person&#34; and &#34;place&#34;, e.g.  ma Kanata (lit. &#34;Canada country&#34;) or  jan Lisa (lit. &#34;Lisa person&#34;).  [6]\n  Phrases in Toki Pona are  head-initial; modifiers always come after the word that they modify.  [21] Therefore,  soweli utala, literally &#34;animal of fighting&#34;, is a &#34;fighting animal&#34;, whereas  utala soweli, literally &#34;fighting of animal&#34;, means &#34;animal war&#34;.  [6]\n When a second modifier is added to a phrase, for example  jan pona lukin, it modifies all that comes before it, so (( jan pona)  lukin) = &#34;friend watching&#34;, rather than ( jan ( pona lukin)), &#34;person good-looking&#34;.  [6]\n The particle  pi, &#34;of&#34;, can be placed after the head and before the modifiers, to group the modifiers into another phrase that functions as a unit to modify the head, so  jan pi pona lukin = ( jan pi ( pona lukin)), &#34;good-looking person&#34;. In this case,  lukin modifies  pona and  pona lukin as a whole modifies  jan.\n   Toki Pona does not inflect verbs according to person, tense, mood, or voice, as the language features no  inflection whatsoever. Person is inferred from the subject of the verb; time is inferred from context or a temporal adverb in the sentence as a subclause.  [35]\n Prepositions can be used as a kind of verb. For example,  tawa means &#34;to&#34; as a preposition and &#34;to go&#34;, &#34;to move&#34; or &#34;to go to&#34; as a verb;  lon means &#34;in&#34; or &#34;at&#34; as a preposition and &#34;to be in/at&#34; or &#34;to exist&#34; or &#34;to be true&#34; as a verb;  kepeken means &#34;using&#34; or &#34;with&#34; (in the sense of the  instrumental case) as a preposition and &#34;to use&#34; as a verb. Verbs from prepositional roots have their objects right after them without the direct object marker  e, similar to when they are used as a preposition.  [35]\n   Toki Pona is generally said to have around 120,  [39] 123,  [40] or 125  [6]  [41] root words.  [42] Each of these is  polysemous and can be thought of as a group of similar concepts,  [19] so  suli not only means &#34;big&#34; or &#34;long&#34;, but also &#34;important&#34;.  [6] Their use relies heavily on context  [5] and metaphor.  [3] To express more complex thoughts, the roots can be combined.  [17] For example,  jan pona can mean friend, although it literally translates as &#34;good/friendly person&#34;, and  telo nasa, which literally means &#34;strange water&#34; or &#34;liquid of craziness&#34;, would be understood to mean &#34;alcohol&#34; or &#34;alcoholic beverage&#34; depending on the context.  [35] The verb &#34;to teach&#34; can be expressed by  pana e sona, which literally means &#34;to give knowledge&#34;.  [18] Essentially identical concepts can be described by different words as the choice relies on the speaker&#39;s perception and experience.  [3]\n   Toki Pona has five root words for colours:  pimeja (black),  walo (white),  loje (red),  jelo (yellow), and  laso (blue and green).  [14] Although the simplified conceptualization of colours tends to exclude a number of colours that are commonly expressed in Western languages, speakers sometimes may combine these five words to make more specific descriptions of certain colours. For instance, &#34;purple&#34; may be represented by combining  laso and  loje. The phrase  laso loje means &#34;a reddish shade of blue&#34; and  loje laso means &#34;a bluish shade of red&#34;.  [6]\n  Toki Pona has root words for one ( wan), two ( tu), and many ( mute). In addition,  ala can mean zero, although its more literal meaning is &#34;no&#34; or &#34;none,&#34; and  ale &#34;all&#34; can express an infinite or immense amount.  [43]\n The simplest number system uses these five roots to express any amount necessary. For numbers larger than two, speakers would use  mute which means &#34;many&#34;.  [35]\n A more complex system expresses larger numbers additively by using phrases such as  tu wan for three,  tu tu for four, and so on. This feature purposely makes it impractical to communicate large numbers.  [13]\n An alternate system for larger numbers, described in Lang&#39;s book, uses  luka (literally &#34;hand&#34;) to signify &#34;five&#34;,  mute (literally &#34;many&#34;) to signify &#34;twenty&#34; and  ale (literally &#34;all&#34;) to signify &#34;100&#34;. For example, using this structure  ale tu would mean &#34;102&#34; and  mute mute mute luka luka luka tu wan would signify &#34;78&#34;.  [44]\n   Some words have obsolete  synonyms. For example,  nena replaced  kapa (protuberance) early in the language&#39;s development for unknown reasons. Later, the pronoun  ona replaced  iki (he, she, it, they), which was sometimes confused with  ike (bad).  [13]\n Similarly,  ali was added as an alternative to  ale (all) to avoid confusion with  ala (no, not) among people who  reduce unstressed vowels, though both forms are still used.  [45]\n Originally,  oko meant &#34;eye&#34; and  lukin was used as a verb &#34;see&#34;. The meanings were later merged into  lukin,  oko being the alternative . Most users, however, tend to follow the traditional definitions.  [46]\n Words that have been simply removed from the lexicon include  leko (block, stairs),  monsuta (monster, fear),  majuna (old), and  pata (sibling).  [47]\n Besides  nena and  ona, which replaced existing roots, a few roots were added to the original 118:  pan (grain, bread, pasta, rice),  esun (market, shop, trade),  alasa, (hunt, gather),  kipisi, (to cut), and  namako (extra, additional, spice), another word for  sin (new).  [48]\n kipisi,  majuna and  monsuta are now considered outdated because they were not included in the official book.  [47]\n   Most Toki Pona roots come from  English,  Tok Pisin,  Finnish,  Georgian,  Dutch,  Acadian French,  Esperanto,  Croatian, with a few from  Chinese ( Mandarin and  Cantonese).  [8]\n Many of these derivations are transparent. For example,  oko (eye) is identical to Slavic  oko and similar to other  cognates such as  Spanish  ojo,  Italian  occhio and English  ocular; likewise,  toki (speech, language) is similar to  Tok Pisin  tok and its English source  talk, while  pona (good, positive), from Esperanto  bona, reflects generic  Romance  bon, buona, English  bonus, etc. However, the changes in pronunciation required by the simple phonetic system often make the origins of other words more difficult to see. The word  lape (to sleep, to rest), for example, comes from  Dutch  slapen and is cognate with English  sleep;  kepeken (to use) is somewhat distorted from Dutch  gebruiken, and  akesi from  hagedis (lizard) is scarcely recognizable. [Because  *ti is an illegal syllable in Toki Pona, Dutch  di becomes  si.]  [8]\n Although only 14 roots (12%) are listed as derived from English, a large number of the Tok Pisin, Esperanto, and other roots are transparently cognate with English, raising the English-friendly portion o\n......", "posttime": "2020-06-04 09:35:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "pona,语言", "title": "Toki Pona--试图用120个字来理解生命的意义", "title_en": "Toki Pona – An attempt to understand the meaning of life in 120 words", "transed": 1, "url": "https://en.wikipedia.org/wiki/Toki_Pona", "via": "", "real_tags": ["pona", "语言"]}, {"category": "", "categoryclass": "", "imagename": "3b74b50ea3592eadce7fee7a6025ce81.jpg", "infoid": 1005089, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一位前隐形喷气式飞机飞行员在最近一次战斗机飞行员播客的采访中提供了一些关于F-117以前不为人知的角色的细节。下面是一些评论。\n我必须承认，我不知道标志性的洛克希德F-117夜鹰具有特定的反苏AWACS任务的空对空能力，直到我碰巧在战斗机飞行员播客中收听了对一名隐形喷气式飞机飞行员的精彩采访。\n战斗机飞行员播客是一个互联网广播节目，由前Top Gun教官文森特“Jell-O”Aiello经营，探索战斗航空的世界。在第72集，日期为2020年2月13日，你可以听到退役的密歇根州空军国民警卫队少校罗伯特·“罗布森”·唐纳森(Robert“Robson”Donaldson)回忆他在沙特阿拉伯参加沙漠风暴行动之前和执行任务期间使用F-117的经历。\n在阅读了有关F-117战机在光天化日之下飞越洛杉矶和南加州进行某种训练的最新报道后，我需要更多关于隐形喷气式飞机的故事，所以我认为现在是花一个小时多一点的时间收听以一名前F-117飞行员为主角的那一集的合适时机。\n在下面嵌入的视频中，采访于16：17开始。你可以了解唐纳森的背景，他在驾驶夜鹰之前和之后都主要驾驶F-16约600小时(“我相信总时间对飞机来说是相当高的时间”)。\n首先，关于新喷气式飞机的培训，“罗布森”唐纳森(他记得第一次看到飞机时说“哇”)回忆说，培训只有一个月的时间，有两周的学术培训、模拟培训和两周的飞行培训。考虑到没有双座教练机，每个人的第一次飞行都是在白天，但总体而言，F-117“真的是一架非常简单的飞机，飞行和使用起来都非常简单，所以它不需要那么长时间，但他们根据需要每年只训练大约12个人，所以第一次飞行就像模拟客机一样。”\n然后，在回答有关F-117的来源而不是更正确的A-117的“果冻”问题时，唐纳森的回忆中出现了一些有趣的事情，他们认为这架飞机不是战斗机，而是攻击机：\n“是的，他的主要作用是攻击，但话虽如此，它实际上可以携带库存中的每一种弹药，除了麻雀导弹，它是雷达制导的，这样我们就可以携带空对空导弹，我们可以携带所有的空对地弹药和所有东西。”因此，关于f-117的名称一直是传言，然后又是假设，许多人都在谈论为什么会这样，但我认为基本上他们只是说，嘿，我们不想有什么太特别的东西，但实际上，这是一架攻击式喷气式飞机，但它的空对空能力确实是有限的。“(编者注：F-117是一架攻击型喷气式飞机，但它的空对空能力确实有限。)”\n这真的是我第一次听说隐形喷气式飞机的A2A能力。\n这位前夜鹰飞行员在深入了解F-117的主要角色，解释了攻击任务的负载，使用FLIR(前视红外)和DLIR(俯视红外)进行武器投放后解释说：“我们的次要角色是击落苏联的预警机。所以，是的，我们对他们的雷达是看不见的，我们不想让他们控制他们的领空，所以无论是在进出的路上，你都可以在你的飞机侧面加一架苏联的预警机。“。\n不幸的是，唐纳森没有提供关于这一以前未知的次要角色的任何额外细节，但我们可以假设，很可能考虑使用红外制导的AIM-9导弹，能力非常有限。根据这位退休飞行员的说法，F-117可以携带美国空军库存中的所有武器，但如果知道潜在的响尾蛇是如何考虑的，那将是一件很有趣的事情。使用AIM-9搭载在外部塔架上(这将使飞机在雷达上可见)已经讨论了很久，但从未得到证实，我们也不知道对舱门的修改以容纳倾斜的空中飞人(类似于F-22猛禽战斗机用来将AIM-9响尾蛇导引头放入气流中的那种)。还有一个机会，洛克希德公司进行了研究，在F-117的内部机架上增加了AIM-9导轨，作为一些拟议的夜鹰变种的一部分，这些变种从未在这里提到过：\n“洛克希德公司的文件认为A/F-117X具有AIM-120AMRAAM和AIM-9响尾蛇空对空导弹能力。图片/图表显示了A/F-117X(完全膨胀的)防弹舱门内侧的AIM-9/AIM-120导轨。虽然没有说明，但暗示F-117B也有这些能力。“。\n无论如何，将AIM-9添加到基线F-117A意义不大，而且不知何故只作为一种自卫武器有用：像AIM-9这样的红外制导导弹需要近距离发射，所以，为了有机会击毙敌人的AWACS，F-117将不得不危险地接近其目标(在盟军的空中预警控制下-因为缺乏雷达)。一旦到达正确的射击场，夜鹰就会打开武器舱(带有明显的低可观测性惩罚)，向苏联的AWACS发射红外制导导弹，可能是由苏联米格或苏霍伊提供HVAAE(高价值航空资产护送)的。看起来有些不合理，尽管我们可能不知道全部情况，也有一些片段丢失了。\n话虽如此，作为播客一集结尾的荧光笔，值得记住的是，唐纳森提到的次要角色与汤姆·克兰西(Tom Clancy)的科技惊悚片小说“红色风暴升起”(Red Storm Ring)中的F-19 Ghostrider(飞行员和机组人员昵称为“飞盘”)惊人地相似。这部小说出版于1986年，也就是F-117出现的几年前，F-19A进行了一次大胆的突袭，摧毁了苏联的伊尔-76雷达飞机，使北约在战争早期获得了空中优势。\n这位前隐形喷气式飞机飞行员回忆起一件有趣的事情，那就是飞机是“高亚音速”的，在沙漠风暴期间，他们利用了流经伊拉克上空的200节急流。因此，他们的大部分攻击都是从西向东计划的，以获得额外的200节推力：这是一个很高的地面速度，而那个空速(IAS)是亚音速。夜鹰也不能飞得太高：它可以飞到40K(空着的时候)，但在较低的高度会更舒服。此外，在操纵性方面，它具有与幻影相同的g限制：+7.3-3g。然而，它根本不是一架斗狗：在一个高g转弯后，它将不得不低空飞行以躲避交战，而正面能见度的缺乏将极大地影响飞行员与对手作战的能力。\n另一件让采访成为必听之事的事情是沙漠风暴期间的任务故事，当时唐纳森被困在他在700英尺高空释放的炸弹的爆炸封套中，炸弹把飞机弄翻了！还有，当“罗布森”解释他们在执行…任务时给F-117型战机起的绰号时，不要错过这一部分。。\n无论如何，不管这架飞机在过去扮演着次要的角色，我非常高兴地看到这架标志性的黑色喷气式飞机在正式退役12年后的今天仍然在执行某种侵略者和测试任务。“摇摆不定的小妖精”万岁(或者，如果你愿意，也可以叫“湿梦”…)。。\n我们来自战区的朋友泰勒·罗格威(Tyler Rogoway)向我们提供了一个关于这个以前不为人知的故事的有趣更新，几乎证实了作者的怀疑，并暗示这种能力确实经过了测试(顺便说一句，你可能还记得我们在这里报道的关于外部商店的有趣的实验活动)，但从未形成任何可操作的形式：\n“事实证明，这从来都不是一种实际的作战能力，但多年来，它以独特而有趣的方式进行了试验，我们将在即将发布的一篇专题文章中详细说明这一点。”", "note_en": "A former Stealth Jet pilot provided some details about a previously unknown role of the F-117 during a recent interview at the Fighter Pilot Podcast. And here are some comments.\n I must admit I had no idea that the iconic  Lockheed F-117 Nighthawk, had an air-to-air capability with a specific anti-Soviet AWACS mission until I happened to listen to a great interview of a  Stealth Jet pilot on The Fighter Pilot Podcast.\n The Fighter Pilot Podcast is an internet radio show run by former Top Gun Instructor Vincent “Jell-O” Aiello that explores the world of combat aviation. On  Episode 72, dated Feb. 13, 2020, you can listen retired Michigan Air National Guard Major Robert “Robson” Donaldson recall his experiences with the F-117, before and during his tour of duty in Saudi Arabia to take part in Operation Desert Storm.\n After reading the  latest reports about the F-117s flying over Los Angeles and  off Southern California in plain daylight to carry out some kind of training, I needed some more Stealth Jet stories, so I thought it was the right time to spend little more than one hour to listen to the episode featuring a former F-117 pilot.\n The interview starts at 16:17 mark in the video embedded below. You get to know the background of Donaldson, who flew principally the F-16 both before and after flying the Nighthawk for around 600 hours (“I believe a total time which was fairly high time for the airplane”).\n  First of all, dealing with the training on the new jet, “Robson” Donaldson (who remembers saying “wow” the first time he saw the jet) recalls the training was only about a month long, with two weeks of academics, sim and two weeks of flying. Considered there were no two-seat trainers everybody’s first flight was during daylight but, overall, the F-117 was “really a very simple airplane to fly and employ so it didn’t take that long but they only trained about 12 guys a year just depending upon the needs so the first flight was yep just like the sim.”\n  Then, responding to “Jello” questions about the origin of the designation F-117 instead of a more correct A-117 considered that the aircraft was not a fighter but and attack jet, something interesting emerges in Donaldson recollections:\n “yes his primary role was attack but having said that, it could actually carry every munition in the inventory at the time of its insertion, with the exception of the Sparrow missile which was radar-guided so we could carry  air-to-air missiles we could carry the full gamut of air-to-ground munitions and everything. So the f-117 designation has long been rumored and then postulated and and many beers have gone down about why it was as such but I think it was basically they just said – hey we don’t want to have anything really too extraordinary out there at all – but yes in all reality it is an attack jet but it did have  a limited air-to-air capability.”\n This was really the first time I ever heard about this A2A capability of the Stealth Jet.\n After diving a bit more into the primary role of the F-117, explaining the load out of an attack mission, the use of FLIR (Forward Looking Infra Red) and DLIR (Downward Looking Infra Red) to perform the weapon drop, the former Nighthawk pilot explains: “our secondary role was to shoot down the Soviet AWACS. So yeah, we were invisible to their radar and we didn’t want them controlling their airspace so, either on the way in or on the way out you could add a Soviet AWACS paint it to the side of your aircraft”.\n Unfortunately, Donaldson does not provide any additional details about this previously unknown secondary role, but we can assume a very limited capability was probably considered using an IR-guided AIM-9 missile. According to the retired pilot, the F-117 could carry all the weapons in the U.S. Air Force inventory, but it would have been interesting to know how the potential employment of a Sidewinder was thought. The use of AIM-9 carried on external pylons (that would make the aircraft visible on radars) has long been discussed and never confirmed nor are we aware of bay door modifications to house canted trapeze (similar to that the  F-22 Raptors use to put the AIM-9 Sidewinder seeker into the airstream). There is also a chance, Lockheed made studies to add AIM-9 rails on the interior bays of the F-117 as part of some proposed Nighthawk variants that never were as mentioned  here:\n “Lockheed documents credit the A/F-117X with AIM-120 AMRAAM and AIM-9 Sidewinder air-to-air missile capability. The pictures/diagrams show the AIM-9/AIM-120 rails on the interior sides of the A/F-117X’s (fully bulged) bomb bay doors. Although it was not stated, it is implied that the F-117B also has these capabilities.”\n Whatever, adding the AIM-9 to a baseline F-117A would make little sense and be somehow useful just as a self-defense weapon: the IR-guided missiles like the AIM-9 need to be fired from short distance so, to get a chance of a kill on an enemy AWACS, the F-117 would have had to fly dangerously close to its target (under allied Airborne Early Warning control – because of the lack or radar). Once at the right shooting range, the Nighthawk would have opened the weapons bay (with a significant Low Observability penalty) to fire the IR-guided missile to a Soviet AWACS probably covered by Soviet MiGs or Sukhois providing HVAAE (High Value Air Asset Escort). Seems somehow unreasonable, even though we probably don’t know the full story and some pieces are missing.\n That being said, as highlighter at the end of the podcast episode, it’s worth remembering that the secondary role metioned by Donaldson is strikingly similar to the one of the F-19 Ghostrider ( nicknamed “Frisbee” by the pilots and crew) in Tom Clancy’s techno-thriller novel “Red Storm Rising.” In that novel, published in 1986, a couple of years before the existence of the F-117 was made public, the F-19A carry out a daring raid to  destroy Soviet Il-76 “Mainstay” radar planes, enabling NATO to secure air superiority in the early stages of the war.\n  An interesting thing recalled by the former Stealth Jet pilot is the fact that aircraft was “high subsonic” and, during Desert Storm they took advantage of the 200 knot jet stream flowing over Iraq. So most of their attacks were planned from west to east to get the extra 200 knots push: it was a high ground speed while that airspeed (IAS) was subsonic. The Nighthawk could not fly too high either: it could reach 40K (when empty) but it was more comfortable at lower altitudes. Moreover, in terms of maneuverability, it had the same g-limits of a Phantom: + 7.3 – 3g. However, it was not a dogfighter at all: after a high-g turn it would have to fly low to escape the engagement and the lack of frontal visibility would greatly affect the pilot ability to fight the opponent.\n Another thing that makes the interview a must hear is the story of the mission during Desert Storm when Donaldson was caught in the blast envelope of the bomb he had released at 700 feet that turned the aircraft upside down! And, don’t miss the part when “Robson” explains the nickname they had given to ther F-117 during his tour of duty….\n Anyway, no matter the secondary role the aircraft had in the past, I’m more than happy to see the iconic black jet still flying some kind of aggressor and test mission today, 12 years after it was officially retired. Long live the   “ Wobblin‘  Goblin” (or, if you prefer, the “ Wet Dream“…).\n  Our friend Tyler Rogoway from  The War Zone reached out to us with an interesting update on this previously unknown story that pretty much confirms this Author’s doubts and suggests the capability was indeed tested (BTW you may remember the interesting experimental campaign with external stores we  reported about here), but never made into any operational form:\n “It turns out that this was never an actual capability in any operational form whatsoever, but it was experimented with over the years in unique and intriguing ways, something we are detailing in a soon to be released special feature.”", "posttime": "2020-06-04 09:35:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苏联,空对空,soviet,飞行员", "title": "F-117战机具有空对空能力，第二次执行射击苏联预警机的任务。", "title_en": "F-117s had an air-to-air capability with secondary mission to shoot Soviet AWACS", "transed": 1, "url": "https://theaviationist.com/2020/06/03/f-117s-had-an-air-to-air-capability-with-secondary-mission-to-shoot-down-soviet-awacs-former-stealth-pilot-says/", "via": "", "real_tags": ["苏联", "空对空", "soviet", "飞行员"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005088, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周，我发起了一个个人项目。一个很好的变化，绝对来自于在Covid-19禁闭期间想要做些其他事情的愿望。随着那次发布，我有了某种程度的分析的愿望，我不需要完整的客户旅程，但我肯定很好奇，在我将我的网站提交给黑客新闻后，有多少人在使用我的网站，你知道吗？\n我也有动力继续去谷歌我的生活，这是我在电子邮件、主机和搜索方面一直在做的事情。\n所以我的小服务在运行，但是分析！我可以grep我的nginxlog文件来获得测量值，但是我想要更健壮的东西。我发现了一项名为Simple Analytics的APAID服务，它提供专注于隐私的分析，顾名思义，就是简单的分析。\n这很棒，但对我来说并不理想。我的应用程序没有产生任何收入(它也无意产生任何收入)，所以我需要一些其他的东西。为了记录起见，我建议你去看看。\n基本分析。在了解了客户的全部行程后，我并不是很清楚，我只是好奇随着时间的推移，有多少人使用了我的服务。\n不侵犯隐私。我不想使用cookie或会话跟踪我的用户。\n重量轻，我可以编译。理想情况下，我可以自行托管，不必担心将我的数据通过管道传输到另一个服务。\n立即，这似乎满足了我的主要标准，并进一步考虑跟踪更有趣的指标，如应用程序响应时间。因此，我尝试了GoAccess。安装很简单，只需一个简单的命令，我就可以得到以下输出：\nGoAccess可以很好地处理Apache和nginx日志格式，尽管它支持种类繁多的日志格式。此命令为您的服务器打开基于终端的各种数据范围的可视化。\n这很棒，甚至还支持基于HTML的静态和实时仪表板。它的输出是美丽的：\n我的当务之急是我的原木会轮换。默认情况下，当您安装nginx时，会添加一个logrotate配置来每天轮换它们。幸运的是，GoAccess可以方便地分析多个文件：\n但是，在每次旋转时编写和调整都会令人沮丧。幸运的是，我们可以利用管道操作员。我喜欢Unix应用程序的可组合性！\n与解析单个Access文件相比，结果多花费了几十毫秒，但在浏览数据时，其他方面的体验是相同的。更多信息！\n当然，由于我们所在的平台(Linux！)，我们可以通过各种方式组合我们的应用程序将捕获的数据。例如，假设我每天轮换日志，并想要最近15天的日志文件(包括今天)：\n这真是太棒了。它给了我很多我想要的，而且我喜欢各种输出选项。利用操作系统，我可以使用其他工具来指定我想要解析的数据类型，而GoAccess对它的处理方式是一样的。\n我在网上搜索了更多的选项，找到了像GoatCounter这样的其他几个，但它并不符合我的全部标准(在这种情况下，它不是自我托管的)。\n我更喜欢GoAccess的一个地方是，我可以在一台单独的机器上运行它，将来自多个服务器的Ringlog转移到一个位置，然后创建我所需的仪表板。这很好地迎合了这样一个事实，即我正在运营Digital Ocean Droplet，虽然它们不会自己崩溃，但我自己也有擦除和从头开始的倾向(只是测试我重新配置服务器的弹性)。\nGoAccess提醒我，像它这样的可组合工具是多么美丽。它的功能集非常少，并且可以很好地配合我们在*nix平台上已有的工具。做好一件事--智慧的话语。", "note_en": "Last week, I launched a  personal project. A nice changethat most definitely came from a desire to  do something else during covid-19lockdown. With that launch came a desire to have some level of analytics, Ididn&#39;t need the full customer journey but I sure was curious how many peoplewere using my site after I submitted it to Hacker News y&#39;know?\n I was also motivated to continue to de-Google my life, somethingI&#39;ve been doing with  email, hosting, and  search.\n So my little service was running, but analytics! I could grep my  nginxlog files to get a gauge, but I wanted something more robust. I discovered apaid service named  Simple Analytics which offersprivacy-focused analytics that, as the name suggests, are simple.\n This was great, but not ideal for me. My application was not generating anyrevenue (nor did it have intention to), so I needed something else. For therecord, I do recommend checking them out.\n  Essential analytics. I wasn&#39;t after knowing the full customer journey, I was just curious how many people were hitting my service over time.\n  Not invasive to privacy. I don&#39;t want to track my users with cookies or sessions.\n  Light weight and compilable by me. Ideally I can self-host this and don&#39;t have to worry about piping my data to another service.\n  Immediately, this seemed to meet my primary criteria, with further considerationfor tracking more interesting metrics like application response times. So, Igave  GoAccess a try. Installation was trivial and with a simple command, I had output:\n  GoAccess plays nicely with Apache and nginx log formats, although it supports alarge variety. This command opens up a Terminal-based visualization of variouspanels of data for your server.\n This was great and there&#39;s even support for HTML based static and real-timedashboards. The output of which is beautiful:\n   An immediate concern I had was that my logs would rotate. By default when youinstall  nginx, a  logrotate configuration is added to rotate them daily.Luckily, GoAccess makes it easy to analyse over multiple files:\n  But this would get frustrating to write and adjust on each rotation. Luckily, wecan leverage the pipe operator. I love how composable unix applications are!\n  The result took a few dozen more milliseconds compared to parsing a singleaccess file but was otherwise the same experience when browsing the data. Justmore information!\n  Of course, because of the platform we&#39;re on (Linux!), we can compose the dataour application will capture in various ways. For example, assuming I rotated logs on a daily basis and wanted the last 15 days of log files (including today):\n  So this was nice. It gave me plenty of what I wanted and I liked the variousoutput options. Leveraging the operating system, I can use other tools tospecify what kind of data I want parsed and GoAccess treats it all the same.\n  I scoured the web for a few more options, finding a few others like GoatCounter but it didn&#39;t match my fullcriteria (in this case, it isn&#39;t self-hosted).\n What I further liked about GoAccess is I could run it on a separate machine, transferringlogs from multiple servers into one place, then creating my necessarydashboards. This plays nicely with the fact that I&#39;m running Digital OceanDroplet&#39;s, which although don&#39;t go kaboom on their own, I make a tendency myselfto erase and start from scratch (just testing my resiliency in re-provisioningservers)\n GoAccess reminded me how beautiful composable tools like it are. Its feature set isminimal and it plays nicely with the tools already available to us on a *nixplatform. Do one thing and do it well -- words of wisdom.", "posttime": "2020-06-04 09:35:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,analytics,数据", "title": "没有谷歌的分析", "title_en": "Analytics Without Google", "transed": 1, "url": "https://www.justbartek.ca/analytics-without-google/", "via": "", "real_tags": ["谷歌", "google", "analytics", "数据"]}, {"category": "", "categoryclass": "", "imagename": "531594ea7c5346f8206f560fa4bb4287.jpg", "infoid": 1005087, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "知情人士告诉TechCrunch，今年5月，超过7,500万用户在谷歌支付应用程序上进行交易，领先于PhonePe的6,000万用户和软银支持的Paytm的3,000万用户。\n谷歌在商家方面仍然落后于Paytm，但这家Android制造商近几个月来保持了整体领先地位，尽管由于印度实施的全球最严格的封锁之一，每个参与者都失去了动力。谷歌拒绝置评。\nPaytm曾经是印度的主导企业，近两年来一直在努力维持其用户基础。知情人士称，该公司去年1月的交易用户约为6,000万。\n数据集认为交易用户是那些在一个月内通过该应用程序至少支付一次的用户。这是一个令人垂涎的指标，与各公司用来分享业绩的更受欢迎的月度活跃用户(MAU)不同。其中一部分被标记为月度活跃用户的人不会在这款应用上进行任何交易。\n一些知情人士表示，印度本土支付公司Paytm近年来一直难以增长，部分原因是印度央行要求移动钱包公司-用户和银行之间的中间人-对用户进行了解客户(KYC)验证，这在许多人中造成了困惑。尽管该公司募集资金取得了超过30亿美元的成功，但这些问题还是出现了。\n在一份声明中，Paytm的一位发言人表示：“当谈到移动钱包时，人们必须记住这样一个事实，即Paytm是一家为KYC建立基础设施的公司，并且已经能够通过亲自会见客户来完成超过1亿个KYC。”\nPaytm长期以来一直受益于与优步(Uber)、外卖初创公司Swiggy和Zomato等热门服务的整合，但近几个月来，Paytm每月交易用户中依赖这一功能的不到1000万。\n两名高管也表示，Paytm抵制采用Unified Payments Interface的想法。这两名高管和其他人一样，因为害怕报复而不愿透露姓名。这是已有近两年历史的支付基础设施，由印度的银行整理而成，使资金可以在不同银行的账户之间直接汇款，并且不需要单独的移动钱包。\nPaytm在采用该标准方面的拖延为谷歌和另一家UPI的早期采用者PhonePe抓住机会留下了空间。\nPaytm在谷歌和PhonePe之后一年采用了UPI，它驳斥了有关它拒绝加入UPI生态系统的说法。\n“我们是一家珍视能够改变数百万人生活的创新和技术的公司。我们理解金融科技的重要性，正因为如此，我们一直是UPI的拥护者和支持者。然而，我们在Paytm上推出它的时间比我们的同行晚，因为我们获得批准开始基于UPI的服务需要更长的时间，“一位发言人说。\n这场争斗中没有Facebook，它将印度视为其用户数量最大的市场。该公司开始与银行洽谈进入印度移动支付市场的事宜，据瑞士信贷(Credit Suisse)估计，印度移动支付市场到2023年将达到1万亿美元(根据瑞士信贷的数据)，最早在2017年就是通过WhatsApp进行的。WhatsApp是印度最受欢迎的智能手机应用，在印度拥有超过4亿用户。\nFacebook在次年向100万用户推出了WhatsApp Pay，但自那以来一直陷入一场监管斗争，目的是将支付服务扩展到其他用户。Facebook首席执行官马克·扎克伯格(Mark Zuckerberg)表示，WhatsApp Pay将于去年年底在全国推出，但该公司尚未获得所有批准-新的挑战不断涌现。WhatsApp拒绝置评。\nPhonePe是在WhatsApp涉足印度移动支付的前一年构思出来的，随着增加了几项第三方服务，PhonePe一直在不断增长。其中包括领先的食品和食品杂货外卖服务Swiggy and Grofers，叫车巨头Ola，票务和住宿公司ixiGO和Oyo Hotels，这是所谓的超级应用战略。11月，约有6300万用户在PhonePe上活跃，其中4500万人通过这款应用进行交易。\nPhonePe的业务主管Karthik Raghupath向TechCrunch证实了该公司的交易用户。\n他在接受采访时表示，有三个因素推动了PhonePe的增长。他说：“近年来智能手机和移动数据采用率的上升；在印度大多数移动支付公司都押注于虚拟移动钱包模式的时候，早期采用UPI；以及采取开放生态系统的方法。”\n“我们很早就向所有的商业伙伴开放了我们的消费者基础。我们的理念是，我们不会进入在线电影票和旅游票务等类别，而是在这些领域与市场领先者合作。“他解释说。\n我们还带着完全开放、可互操作的二维码进入市场，使商家和企业只需使用一个二维码就可以接受任何应用程序的支付-而不仅仅是我们的应用程序。在此之前，你会看到附近的一家商店维护着几个二维码，以支持多个支付应用程序。多年来，我们的做法已经成为行业标准，“他说，并补充说，PhonePe也同样对其他钱包和支付方式持开放态度。\n但是，尽管PhonePe实现了增长，并采取了开放的方式，但在最近几个季度，PhonePe仍难以赢得投资者的信心。印度移动支付公司缺乏明确的商业模式，这加剧了投资者的担忧。\nPhonePe高管去年举行了筹资谈判，原本对其估值为80亿美元，但谈判破裂。三位知情人士说，今年早些时候类似的谈判也破裂了，该谈判原本对PhonePe的估值为30亿美元，此前没有报道。Raghupath和PhonePe发言人拒绝就该公司的筹资计划置评。\n目前，沃尔玛已同意继续为这款支付应用提供资金，该应用在2018年收购Flipkart后成为沃尔玛零售集团的一部分。\n随着UPI在市场上取得进展，银行已经取消了对移动支付参与者的任何促销激励措施，移动支付是银行仅有的收入来源之一。\n去年年底在班加罗尔的一次活动中，谷歌支付和下一个10亿用户倡议的董事总经理兼业务主管萨吉斯·西万丹丹(Sajith Sivananda)表示，目前的当地规定迫使谷歌支付在印度没有明确的商业模式的情况下运营。\n冠状病毒大流行促使新德里在3月下旬下令在全国范围内封锁，随后几周移动支付使用量大幅下降，但这是可以预见的。但是，尽管Paytm仍在努力反弹，但随着印度放松一些限制，PhonePe和Google Pay已经完全恢复。\n根据监管UPI的机构NPCI汇编并由TechCrunch获得的数据，5月份Paytm上发生了约1.2亿笔UPI交易，低于4月份的1.27亿笔和3月份的1.86亿笔。(Paytm维持着一项移动钱包业务，这为其整体交易用户做出了贡献。)。\n谷歌支付只支持UPI支付，5月份促成了5.4亿笔交易，高于4月份的4.34亿笔和3月份的5.15亿笔。PhonePe 3月份的数据为4.54亿，4月份下滑至3.68亿，但它已经扭亏为盈，上个月有4.6亿笔交易。NPCI发言人没有回复记者的置评请求。\nPhonePe和Google Pay上月合计约占印度所有UPI交易的83%。\n在竞争对手公司工作的行业高管表示，解雇Paytm将是一个错误，Paytm曾经是印度移动支付市场的领先者。\nPaytm最近几个季度削减了营销费用，并积极追逐商家。今年早些时候，该公司推出了一系列小玩意儿，包括一款显示二维码的设备，该设备配有计算器和USB充电器，还有一款自动点唱机，它提供交易和服务的语音确认，以简化商家的库存管理。\n使用这些设备的商家向Paytm支付经常性费用，该公司联合创始人兼首席执行官Vijay Shekhar Sharma在今年早些时候的一次采访中告诉TechCrunch。Paytm还进入了电影和旅游票务、借贷、游戏和电子商务等几个业务，多年来还成立了一家数字支付银行。\n“大家都知道Paytm。在印度，Paytm是数字支付的代名词。从外部看，有一种观念认为它真的是印度的支付宝，“一家竞争对手公司的高管说。", "note_en": "In May, more than 75 million users transacted on Google Pay app, ahead of  PhonePe’s   60 million users, and  SoftBank  -backed  Paytm’s   30 million users, people familiar with the companies’ figures told TechCrunch.\n Google still lags Paytm’s reach with merchants, but the  Android  -maker has maintained its overall lead in recent months despite every player losing momentum due to one of the most stringent lockdowns globally in place in India. Google declined to comment.\n  Paytm, once the dominant player in India, has been struggling to sustain its user base for nearly two years. The company had about 60 million transacting users in January last year, said people familiar with the matter.\n Data sets consider transacting users to be those who have made at least one payment through the app in a month. It’s a coveted metric and is different from the much more popular monthly active users, or MAU, that various firms use to share their performance. A portion of those labeled as monthly active users do not make any transaction on the app.\n India’s homegrown payment firm, Paytm, has struggled to grow in recent years in part because of a mandate by India’s central bank to mobile wallet firms — the middlemen between users and banks — to perform know-your-client (KYC) verification of users, which created confusion among many, some of the people said. These woes come despite the firm’s fundraising success, which  amounts to more than $3 billion.\n In a statement, a Paytm spokesperson said, “When it comes to mobile wallets one has to remember the fact that Paytm was the company that set up the infrastructure to do KYC and has been able to complete over 100 million KYCs by physically meeting customers.”\n Paytm has long benefited from integration with popular services such as  Uber,   and food delivery startups Swiggy and Zomato, but fewer than 10 million of Paytm’s monthly transacting users have relied on this feature in recent months.\n Two executives, who like everyone else spoke on the condition of anonymity because of fear of retribution, also said that Paytm resisted the idea of adopting Unified Payments Interface. That’s the nearly two-year-old payments infrastructure built and backed by a collation of banks in India that enables money to be sent directly between accounts at different banks and eliminates the need for a separate mobile wallet.\n Paytm’s delays in adopting the standard left room for Google and PhonePe, another early adopter of UPI, to seize the opportunity.\n Paytm, which adopted UPI a year after Google and PhonePe, refuted the characterization that it resisted joining UPI ecosystem.\n “We are the company that cherishes innovation and technology that can transform the lives of millions. We understand the importance of financial technology and for this very reason, we have always been the champion and supporter of UPI. We, however, launched it on Paytm later than our peers because it took a little longer for us to get the approval to start UPI based services,“ a spokesperson said.\n  Missing from the fray is Facebook, which counts India as its biggest market by user count. The company began talks with banks to enter India’s mobile payments market, estimated to reach $1 trillion by 2023 (according to Credit Suisse), through WhatsApp as early as 2017. WhatsApp is the most popular smartphone app in India with  over 400 million users in the country.\n Facebook launched  WhatsApp Pay to a million users in the following year, but has been locked in a regulatory battle since to expand the payments service to the rest of its users. Facebook chief executive Mark Zuckerberg said WhatsApp Pay would roll out nationwide by end of last year, but the firm is yet to secure all approvals — and new challenges  keep cropping up. WhatsApp declined to comment.\n PhonePe, which was conceived only a year before WhatsApp set eyes to India’s mobile payments, has consistently grown as it added several third-party services. These include leading food and grocery delivery services Swiggy and Grofers, ride-hailing giant Ola, ticketing and staying players Ixigo and Oyo Hotels, in a so-called super app strategy. In November, about 63 million users were active on PhonePe, 45 million of whom transacted through the app.\n Karthik Raghupathy, the head of business at PhonePe, confirmed the company’s transacting users to TechCrunch.\n Three factors contributed to the growth of PhonePe, he said in an interview. “The rise of smartphones and mobile data adoption in recent years; early adoption to UPI at a time when most mobile payments firms in India were betting on virtual mobile-wallet model; and taking an open-ecosystem approach,” he said.\n “We opened our consumer base to all our merchant partners very early on. Our philosophy was that we would not enter categories such as online ticketing for movies and travel, and instead work with market leaders on those fronts,” he explained.\n “We also went to the market with a completely open, interoperable QR code that enabled merchants and businesses to use just one QR code to accept payments from any app — not just ours. Prior to this, you would see a neighborhood store maintain several QR codes to support a number of payment apps. Over the years, our approach has become the industry norm,” he said, adding that PhonePe has been similarly open to other wallets and payments options as well.\n But despite the growth and its open approach, PhonePe has still struggled to win the confidence of investors in recent quarters. Stoking investors’ fears is the  lack of a clear business model for mobile payments firms in India.\n PhonePe executives held talks to raise capital last year that would have valued it at $8 billion, but the negotiations fell apart. Similar talks early this year, which would have valued PhonePe at $3 billion, which hasn’t been previously reported, also fell apart, three people familiar with the matter said. Raghupathy and a PhonePe spokesperson declined to comment on the company’s fundraising plans.\n For now,  Walmart   has agreed to continue to bankroll the payments app, which became part of the retail group with  Flipkart acquisition in 2018.\n As UPI  gained inroads in the market, banks have done away with any promotional incentives to mobile payments players, one of their only revenue sources.\n At an event in Bangalore late last year, Sajith Sivanandan, managing director and business head of Google Pay and Next Billion User Initiatives, said current local rules have forced Google Pay to operate without a clear business model in India.\n  The coronavirus pandemic that prompted New Delhi to order a nationwide lockdown in late March preceded a significant, but predictable, drop in mobile payments usage in the following weeks. But while Paytm continues to struggle in bouncing back, PhonePe and Google Pay have fully recovered as India eased some restrictions.\n About 120 million UPI transactions occurred on Paytm in the month of May, down from 127 million in April and 186 million in March, according to data compiled by NPCI, the body that oversees UPI, and obtained by TechCrunch. (Paytm maintains a mobile wallet business, which contributes to its overall transacting users.)\n Google Pay, which only supports UPI payments, facilitated 540 million transactions in May, up from 434 million in April and 515 million in March. PhonePe’s 454 million March figure slid to 368 million in April, but it turned the corner, with 460 million transactions last month. An NPCI spokesperson did not respond to a request for comment.\n PhonePe and Google Pay together accounted for about 83% of all UPI transactions in India last month.\n Industry executives working at rival firms said it would be a mistake to dismiss Paytm, the one-time leader of the mobile payments market in India.\n Paytm has cut its marketing expenses and  aggressively chased merchants in recent quarters. Earlier this year, it unveiled a range of gadgets, including a device that displays QR check-out codes that comes with a calculator and USB charger, a jukebox that provides voice confirmations of transactions and services to streamline inventory management for merchants.\n Merchants who use these devices pay a recurring fee to Paytm,  Vijay Shekhar Sharma,   co-founder and chief executive of the firm told TechCrunch in an interview earlier this year. Paytm has also entered several businesses, such as movie and travel ticketing, lending, games and e-commerce, and set up a digital payments bank over the years.\n “Everyone knows Paytm. Paytm is synonymous with digital payments in India. And outside, there’s a perceived notion that it’s truly the  Alipay   of India,” an executive at a rival firm said.", "posttime": "2020-06-04 09:34:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,沃尔玛,walmart", "title": "谷歌和沃尔玛在印度移动支付市场确立主导地位", "title_en": "Google and Walmart establish dominance in India’s mobile payments market", "transed": 1, "url": "https://techcrunch.com/2020/06/03/google-and-walmarts-phonepe-establish-dominance-in-indias-mobile-payments-market-as-whatsapp-pay-struggles-to-launch/", "via": "", "real_tags": ["谷歌", "google", "沃尔玛", "walmart"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005085, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "不久前，我在Hacker News上读到一篇关于提高一个人作为开发人员表现的小贴士的评论；它推荐了一个边工作边记录自己的系统，有人建议将视频上传到YouTube(作为私人视频或未列出的视频)，以供将来修改和备份。\n我喜欢这个主意，所以我想亲自试一试。当然，就像我做的大多数事情一样，它的实用性并不重要，重要的是有机会看看我将如何实现一个系统来支持这样的工作流程。\n我得到了一些我相当满意的东西，因为大部分过程都是自动化的。以下是配料：\n我正在使用TaskWrior来跟踪我现在正在做的事情。\n我还将它与TimeWarrior集成在一起，TimeWarrior会记录我在每项任务中花费的时间。正如我们将看到的，这也在我的工作流中启用了一些不错的功能。\n当我运行任务START TASK_ID时，它将自动开始录制屏幕(除了一个谨慎的系统托盘图标外，不会显示任何UI)。\n当我运行TASK STOP TASK_ID时，它将停止屏幕投射和停止trackingtime。\n在一天(或一周，或任何时候)结束时，我会运行一个程序，将特定一天的所有视频合并在一起，并使用最常用的TaskWrior标签的名称和其他元数据将它们推送到YouTube。这也会在视频上传成功完成时删除原件。\n我将我正在使用的代码推送到github：https://github.com/casidiablo/hippo-critical。请记住，它是为myusecase量身定做的；我不期望它不经过一些调整就能为任何人工作)。\n导出OBS Studio设置：基本上是手动创建您满意的配置文件和场景集合。我用的那个可以记录我的屏幕，屏幕底部的我的脸，我的麦克风，以及我正在听的任何东西。然后，您可以将其导出并在流启动时引用它。\n获取YouTube API的凭据：我正在使用https://github.com/tokland/youtube-upload发布视频。请按照此回购的文档获取正确的凭据。\n使用Timewarrior可以实现非常有趣的用例：我正在使用导出功能来获取每个日常会话使用的标签，这样我就可以对其进行排名，并为视频添加一个有意义的标题。\n使用标签过滤掉你可能不想上传的东西，或者为每个标签推送不同的视频，应该是相当容易的。\n我不喜欢把这个推到YouTube上，不过随便了。这些视频是私人的，我几乎把它们当作一个免费的存储系统来使用。我觉得很有趣的是，所有的视频都有版权投诉，因为我在编码时会听很多音乐。\n如果我是一个自由职业者，我会用它来跟踪我自己，并与我的客户分享。", "note_en": "Not long ago I read a comment on Hacker News about tips to improve one’sperformance as a developer; it recommended a system of recording oneself whileworking and someone suggested uploading the videos to YouTube (as  private or unlisted) for future revision and as a backup.\n I liked the idea so I wanted to give it a try myself. Of course, like most ofthe stuff I do, the practicality of it was not as important as the chance to seehow I would implement a system to support such workflow.\n I landed with something I’m fairly happy with, because most of the process isautomated. These are the ingredients:\n I’m using  Taskwarrior to keep track of what I’mdoing right now.\n I also integrate it with  Timewarrior which keepstrack of how long I take in each task. This also enabled some nice features inmy workflow as we will see.\n  When I run  task start TASK_ID it will start recording a screencastautomatically (no UI is shown other than a discreet systray icon).\n When I run  task stop TASK_ID it will stop the screen cast and stop trackingtime.\n At the end of the day (or the week, or whenever), I run a program that mergesall the videos for a particular day and pushes them to YouTube using the nameof the most used Taskwarrior tag, and other metadata. This also deletes theoriginals when the video upload finishes successfully.\n  I pushed the code I’m using to Github: https://github.com/casidiablo/hippo-critical . Keep in mind it is tailored to myusecase; I don’t expect it to work for anyone without some tweaking).\n  Export OBS Studio settings: basically, manually create a  Profile and Scene Collection that you are satisfied with. The one I’m using records myscreen, my face at the bottom of the screen, my mic and whatever I’m listeningto. Then you can export it and  reference it when the streamstarts.\n   Get credentials for the YouTube API: I’m using https://github.com/tokland/youtube-upload to publish the video. Follow thedocs of this repo to get the proper credentials.\n    Using  Timewarrior enables very interesting use cases: I’m  using the export feature to get thetagsused for each daily session, so I can rank it and have a sensical title forthe video.\n It should be fairly easy to use tags to filter out stuff you might not wantto upload, or to push different videos for each tag, etc.\n I don’t like the idea of pushing this to YouTube, but whatever. The videos areprivate and I am pretty much using them as a free storage system. I find it funny that all of the videos have Copyright complaints, because Ilisten to a lot of music while coding.\n I would use this if I were a freelancer to track my self and share it with myclients.", "posttime": "2020-06-04 09:10:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "obs,work,视频", "title": "使用OBS Studio和TaskWarrior和TimeWarrior自动录制工作", "title_en": "Automated Work Recordings with OBS Studio and TaskWarrior and TimeWarrior", "transed": 1, "url": "https://cristian.io/post/auto-screencasts/", "via": "", "real_tags": ["obs", "work", "视频"]}, {"category": "", "categoryclass": "", "imagename": "798ffe6eb2782d58dec0ed6c5f3f6930.jpg", "infoid": 1005083, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与其他大大小小的零售商一样，在美国各地持续的抗议活动中，苹果专卖店一直受到机会主义者的洗劫。作为回应，苹果再次关闭了其在美国的所有门店。在新冠肺炎疫情导致商店关门后，商店最近才重新开张。\n但是，将偷来的iPhone带回家的抢劫者，或者最终以个人对个人的方式购买这些手机的人，可能会遇到一些令人惊讶的事情：被盗的iPhone似乎不起作用，甚至可能被苹果或当局追踪。这可能会给在未来几周和几个月内购买二手iPhone的普通消费者-以及修理店-带来挑战。\n据称从苹果商店抢劫iPhone的个人发现，手机被自动禁用，屏幕上显示如下消息(通过Twitter)：\n请回到苹果核桃街。此设备已被禁用，正在被跟踪。地方当局会收到警报。\n在过去的一两天里，Reddit和Twitter上出现了一些这样的信息。尽管如此，我们也不知道有多少iPhone从苹果专卖店被拿走并开始流通。\n众所周知，苹果过去在演示iPhone上使用了特殊的iOS图像，那些演示iPhone有一个关闭开关，一旦手机超出了商店的Wi-Fi网络，它就会立即关闭手机。因此，这些都不令人惊讶。(注：苹果在苹果演示版iPhone上使用了特殊的iOS图像，那些演示版iPhone有一个关闭开关，一旦手机超出了商店的Wi-Fi网络范围，它就会立即关闭。)因此，这并不令人惊讶。此外，苹果已经向用户提供了一项名为FindMy的服务，可以通过用户的iCloud账户追踪丢失或被盗的iPhone。没有明显的理由相关的工具和服务不能由苹果自己使用。\n然而，在内乱中，防盗措施并不是苹果唯一的关注点。彭博社获得了苹果首席执行官蒂姆·库克发给员工的一份备忘录，这份备忘录构成了公司对乔治·弗洛伊德被杀事件和针对这起杀戮事件的抗议活动的官方回应。在其他事情中，库克写道：\n那段痛苦的过去今天仍然存在-不仅以暴力的形式存在，而且在根深蒂固的歧视的日常经历中仍然存在。我们在我们的刑事司法系统中看到了这一点，从黑人和布朗社区不成比例的疾病死亡人数中看到了这一点，从邻里服务和我们孩子接受的教育中看到了这一点。虽然我们的法律已经改变，但现实情况是，它们的保护仍然没有得到普遍适用。\n如今，苹果正在向多个组织捐款，其中包括致力于挑战种族不公正、结束大规模监禁、保护美国社会最弱势群体人权的非营利性组织平等正义倡议(Equity Justice Initiative)。在六月份，为了纪念六一九假期，我们还将通过Benevity为所有员工提供二送一的捐款。\n《纽约时报》报道称，昨晚抗议活动周围的环境比最近其他夜晚更加平静，抢劫事件较少。但目前尚不清楚苹果何时可能再次重新开放门店。", "note_en": "Along with other retailers big and small, Apple Stores have been  subject to looting by opportunists amid the ongoing protests around the United States. In response, Apple has again closed all of its stores in the US. Stores had only recently reopened after closures related to the COVID-19 pandemic.\n But looters who brought stolen iPhones home, or people who end up buying those phones in person-to-person transactions, are in for what may be a surprise: it appears that the stolen iPhones don&#39;t work and may even be tracked by Apple or authorities. This could pose a challenge for regular consumers who buy second-hand iPhones—as well as repair shops—in the coming weeks and months.\n Individuals with iPhones allegedly looted from Apple stores found that the phones were automatically disabled and had messages like the following (via  Twitter) displayed on-screen:\n Please return to Apple Walnut Street. This device has been disabled and is being tracked. Local authorities will be alerted.\n A few examples of these messages have surfaced on Reddit and Twitter over the past day or two. That said, we don&#39;t know how many iPhones have been taken from Apple Stores and put in circulation.\n Apple has been known in the past to use special images of iOS on demo unit iPhones, and those demo iPhones have a sort of  kill switch that disables the phones as soon as they are out of range of the store&#39;s Wi-Fi network. So none of this is surprising. Also, Apple already offers a service to users called FindMy that allows tracking of lost or stolen iPhones via the user&#39;s iCloud account. There&#39;s no apparent reason related tools and services couldn&#39;t be used by Apple itself.\n Anti-theft measures are not Apple&#39;s only focus amid civil unrest, though. Bloomberg acquired a  memo sent by Apple CEO Tim Cook to employees that constitutes the company&#39;s official response to the killing of George Floyd and the protests in response to that killing. Among other things, Cook wrote:\n That painful past is still present today—not only in the form of violence, but in the everyday experience of deeply rooted discrimination. We see it in our criminal justice system, in the disproportionate toll of disease on Black and Brown communities, in the inequalities in neighborhood services and the educations our children receive. While our laws have changed, the reality is that their protections are still not universally applied.\n  Today, Apple is making donations to a number of groups, including the Equal Justice Initiative, a non-profit committed to challenging racial injustice, ending mass incarceration, and protecting the human rights of the most vulnerable people in American society. For the month of June, and in honor of the Juneteenth holiday, we’ll also be matching two-for-one all employee donations via Benevity.\n The New York Times  reported that the environment around the protests was more peaceful last night than other recent nights, with fewer instances of looting. But it is not known when Apple might again reopen its stores.", "posttime": "2020-06-04 09:10:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "iphone,抢劫者,looters,苹果", "title": "iPhone抢劫者发现设备被禁用，并警告他们正在被跟踪", "title_en": "iPhone looters find devices disabled, with a warning they’re being tracked", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/06/local-authorities-will-be-alerted-iphone-looters-end-up-with-useless-phones/", "via": "", "real_tags": ["iphone", "抢劫者", "looters", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "2a2b45804fb50779b0df9d6c3145aeb6.jpg", "infoid": 1005082, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "奢侈品吸尘器大亨詹姆斯·戴森披露了他的公司失败的电动汽车的新照片和更多信息-他最近透露，他在这个项目上投入了超过5亿美元的自有资金。\n在公司网站上的一篇新的博客文章中，戴森展示了该项目去年10月被扼杀前制作的真实原型的一些首批图像和视频，以及一些更多的计算机渲染。他将SUV描述为“一款充满技术的激进汽车”，并表示他的公司“解决了许多传统上与电动汽车相关的问题”，尽管该项目最终因为“在商业上不可行”而被放弃。\n不过，这篇帖子没有对这些问题是什么，或者公司打算如何解决这些问题做出任何实质性的解释。戴森吹捧“由戴森数字电机、单速变速器和最先进的功率逆变器组成的定制、集成和高效的电力驱动单元(EDU)”，尽管没有解释这些技术与电动汽车领域其他公司开发的技术的不同之处。\n其他列出的设计优势(如灵活的电池组设计、改善的内部空间、更长的轴距)和功能(如平视显示器或免把手车门)也远不是独一无二的。虽然Autocar报告说，SUV应该使用150kWh电池提供大约600英里的续航里程，但戴森从未足够接近，无法将这一说法放在测试中。\nSUV为数不多的突出部件之一是方向盘，它看起来更像是一个视频游戏控制器。除此之外，戴森电动汽车的设计与Byton甚至Faraday Future的设计几乎没有什么区别。戴森与这些初创公司不同，它目前是一家销售产品和创造收入的公司，如果找到合适的制造合作伙伴或筹集数十亿美元投入生产，戴森可能会让这款豪华电动SUV发挥作用。但即使该公司做到了这一点，它仍然只是另一款面向富人的小批量电动汽车-这肯定不是激进的。", "note_en": "Luxury vacuum magnate James Dyson has revealed  new photos and a little more information about his company’s failed electric vehicle — a project into which he recently revealed he poured more than  half a billion dollars of his own money.\n In a new blog post on his company’s website, Dyson shows off some of the first images and videos of the real prototype it made before the project was killed last October, as well as a few more computer renderings. He describes the SUV as “a radical car which was loaded with technology,” and says his company “solved lots of problems that are traditionally associated with electric vehicles,” though the project was ultimately abandoned for  not being “commercially viable.”\n  Missing from the post is any substantive explanation of what those problems were, though, or how the company was going to solve them. Dyson touts a “bespoke, integrated and highly efficient Electric Drive Unit (EDU) comprising Dyson digital electric motor, single speed transmission and state of the art power inverter,” though there’s no explanation about what sets those technologies apart from the ones developed by other companies in the electric vehicle space.\n Other listed design benefits (like a flexible battery pack design, improved interior space, longer wheelbase) and features (like a heads-up display or handle-free doors) are also far from unique. And while   Autocar reports that the SUV was supposed to offer somewhere around 600 miles of range using a 150kWh battery, Dyson never got close enough to put that claim to the test.\n   One of the few standout parts of the SUV is the steering wheel, which looks more like a video game controller than anything. Other than that, the Dyson EV’s design is almost indistinguishable from Byton’s or even Faraday Future’s. Perhaps Dyson — which, unlike those startups, is a company that currently sells products and generates revenue — would have been able to make this luxury electric SUV work had it found the right manufacturing partner or scrounged up a few billion dollars to get to production. But even if the company had done that, it’d still have been just another small-volume electric vehicle for the wealthy — something that is decidedly not radical.", "posttime": "2020-06-04 08:46:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "分享,shares", "title": "戴森分享其取消电动SUV的新照片和视频", "title_en": "Dyson Shares New Photos and Videos of Its Canceled Electric SUV", "transed": 1, "url": "https://www.theverge.com/2020/6/3/21279684/james-dyson-ev-photos-videos-suv-project-canceled", "via": "", "real_tags": ["分享", "shares"]}, {"category": "", "categoryclass": "", "imagename": "79e3e57968d2f382ab4eeb13b24bec32.jpg", "infoid": 1005081, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Linux内核负责人Linus Torvalds销毁了亚马逊网络服务(AWS)工程师提供的一个补丁，该补丁旨在缓解今年早些时候一名AWS工程师发现的针对英特尔CPU的Snoop攻击。\n3月份披露了所谓的Snoop辅助的L1数据采样或Snoop(CVE-2020-0550)攻击，这些攻击影响到一系列英特尔至强和酷睿CPU。\nAWS工程师Pawel Wieczorkiewicz发现了一种方法，可以通过位于CPU内核中的L1D高速缓存，通过总线监听(在L1D中修改数据时发生的高速缓存更新操作)泄漏英特尔CPU内存中的数据。\n在这一消息披露之后，AWS工程师Balbir Singh为Linux内核提出了一个补丁，使应用程序能够在任务切换时选择加入刷新L1D缓存。\n辛格在4月份解释说，这可以保护他们的数据不会在任务上下文切换后通过旁路被窥探或泄露。该修补程序计划随Linux内核5.8版一起提供。\n该功能将允许基于选择加入的应用程序调用prctl(2)，以便在任务离开CPU时刷新该任务的L1D缓存(假设硬件支持它)。\n但是，正如Phoronix发现的那样，Torvalds相信补丁将允许选择加入补丁的应用程序降低其他应用程序的CPU性能。\n托瓦尔兹昨天写道，因为在我看来，这基本上就是将缓存刷新指令导出到用户空间，并给进程提供了一种只需说出减慢我安排的其他任何人的速度的方法。\n换句话说，据我所知，这让疯狂的英特尔发布了有缺陷的CPU，它会导致虚拟化代码出现问题(我并不太在意这一点)，并将其变成任何人都可以选择加入这种疾病的疾病，现在它甚至会影响不需要它的人和CPU，以及它完全没有意义的配置。在这种情况下，任何人都可以选择加入这一疾病，而现在它甚至会影响到不需要它的人和CPU，以及它完全没有意义的配置。在这种情况下，它会导致虚拟化代码出现问题(我并不太在意这一点)，并将其转变为任何人都可以选择加入这种疾病，现在它甚至会影响到不需要它的人和CPU，以及它完全没有意义的配置。\n我不想让某些应用程序运行。哦，我很特别，很漂亮，而且是如此精致的一朵花，以至于我想刷新每个任务开关上的L1D，不管我在哪个CPU上，也不管有没有勘误表。因为这款应用程序不仅降低了自身的运行速度，还降低了其他应用程序的运行速度。\n托瓦尔兹提到的虚拟化是针对AWS的，与其他云提供商一样，AWS销售的虚拟CPU通常启用了同步多线程(SMT)。\n他接着指出，启用SMT后，它应该完全禁用这种疯狂的伪安全，因为在那种情况下它是完全没有意义的。\n至少，启用SMT应该完全禁用这种疯狂的伪安全，因为在那种情况下它是完全没有意义的。他说，在SMT开启的情况下，计划根本不是同步点，所以说我当然会在上下文切换时刷新L1是非常愚蠢的。\n在与辛格的一次讨论中，托瓦尔兹指出，在SMT上刷新L1D$是疯狂的，因为攻击者只会坐在兄弟核心上，在*任务切换发生之前*攻击L1内容。\n正如注册中心所指出的那样，AWS首席工程师Benjamin Herrenschmidt在与Red Hat Linux内核贡献者Ingo Molnar的讨论中也为关于补丁的辩论增加了一些背景。\nHerrenschmidt承认该补丁对SMT毫无意义，但他敦促内核开发者不要随波逐流，并驳斥了该补丁是因为AWS想要将超线程作为虚拟CPU销售的说法。\n赫伦施密特写道，不一定也不是在所有情况下。&#34；是的，虚拟机通常会启用SMT。不过，这并不是针对他们的。他说，讨论期间给出的一个例子是属于不同用户的容器。\n另一个示例是，与系统的其余部分相比，进程处理更关键的数据(如支付信息)，并且希望保护自己(或管理员希望保护该进程)，使其不会将数据泄露给不太受信任的进程。&#34；\n&#34；AWS不仅仅有VM可供租用：-)我们的用户可以使用一大堆更高级别的服务，而不是所有这些服务都必须在按vCPU收费的VM上运行。&#34；\nHerrenschmidt说，这些补丁并不是试图解决运行SMT的客户虚拟机内部发生的问题，也不是为了保护虚拟机免受同一系统上其他虚拟机的攻击。", "note_en": "Linux kernel head Linus Torvalds has trashed a patch from Amazon Web Services (AWS) engineers that was aimed at mitigating the Snoop attack on Intel CPUs discovered by an AWS engineer earlier this year.\n The so-called &#39; Snoop-assisted L1 Data Sampling&#39;, or Snoop (CVE-2020-0550) attacks affecting a range of Intel Xeon and Core CPUs were disclosed in March.\n AWS engineer Pawel Wieczorkiewicz discovered a way to leak data from an Intel CPU&#39;s memory via its L1D cache, which sits in CPU cores, through &#39;bus snooping&#39; – the cache updating operation that happens when data is modified in L1D.\n    In the wake of the disclosure, AWS engineer Balbir Singh proposed a patch for the Linux kernel for applications to be able to opt in to flush the L1D cache when a task is switched out.\n &#34;This protects their data from being snooped or leaked via side channels after the task has context switched out,&#34;  Singh explained in April. The patch was intended to ship with Linux kernel version 5.8.\n   The feature would allow applications on an opt-in basis to call prctl(2) to flush the L1D cache for a task once it leaves the CPU, assuming the hardware supports it.\n But,  as spotted by Phoronix, Torvalds believes the patch will allow applications that opt in to the patch to degrade CPU performance for other applications.\n   &#34;Because it looks to me like this basically exports cache flushing instructions to user space, and gives processes a way to just say &#39;slow down anybody else I schedule with too&#39;,&#34; wrote Torvalds yesterday.\n &#34;In other words, from what I can tell, this takes the crazy &#39;Intel ships buggy CPU&#39;s and it causes problems for virtualization&#39; code (which I didn&#39;t much care about), and turns it into &#39;anybody can opt in to this disease, and now it affects even people and CPU&#39;s that don&#39;t need it and configurations where it&#39;s completely pointless&#39;.\n &#34;I don&#39;t want some application to go &#39;Oh, I&#39;m _soo_ special and pretty and such a delicate flower, that I want to flush the L1D on every task switch, regardless of what CPU I am on, and regardless of whether there are errata or not. Because that app isn&#39;t just slowing down itself, it&#39;s slowing down others too.&#34;\n Torvalds&#39; reference to virtualization was directed at AWS which, like other cloud providers, sells virtual CPUs often with simultaneous multithreading (SMT) enabled.\n He goes on to point out that with SMT enabled, it &#34;should disable this kind of crazy pseudo-security entirely, since it is completely pointless in that situation&#34;.\n &#34;At a _minimum_, SMT being enabled should disable this kind of crazy pseudo-security entirely, since it is completely pointless in that situation. Scheduling simply isn&#39;t a synchronization point with SMT on, so saying &#34;sure, I&#39;ll flush the L1 at context switch&#34; is beyond stupid,&#34;  he said.\n In a discussion with Singh, Torvalds notes that to &#34;&#39;flush L1D$ on SMT&#39; is crazy, since an attacker would just sit on a sibling core and attack the L1 contents *before* the task switch happens&#34;.\n As noted by The Register, AWS principal engineer Benjamin Herrenschmidt also  added some context to the debate over the patch in a discussion with Red Hat Linux kernel contributor Ingo Molnar.\n Herrenschmidt admitted that the patch is pointless with SMT, but urged kernel developers not to &#34;throw the baby out with the bath water&#34; and contested the argument that the patch was because AWS wants to sell hyper threads as virtual CPUs.\n &#34;Not necessarily and not in every circumstances,&#34; Herrenschmidt wrote. &#34;Yes, VMs will typically have SMT enabled. This isn&#39;t targeted at them though. One example that was given during the discussions was containers pertaining to different users,&#34; he said.\n &#34;Another example would be a process that handles more critical data such as payment information, than the rest of the system and wants to protect itself (or the admin wants that process protected) against possible data leaks to less trusted processes.&#34;\n &#34;AWS has more than just VMs for rent :-) There are a whole pile of higher level &#39;services&#39; that our users can use and not all of them necessarily run on VMs charged per vCPU.&#34;\n Herrenschmidt said the patches aren&#39;t trying to solve problems happening inside of a customer VM running SMT and nor are they about protecting VMs against other VMs on the same system.", "posttime": "2020-06-04 08:32:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,拒绝,rejects,cpu", "title": "Linus拒绝“超越愚蠢”AWS制造的Linux补丁", "title_en": "Linus rejects 'beyond stupid' AWS-made Linux patch", "transed": 1, "url": "https://www.zdnet.com/article/linus-torvalds-rejects-stupid-aws-made-linux-patch-for-intel-cpu-snoop-attack/", "via": "", "real_tags": ["linux", "拒绝", "rejects", "cpu"]}, {"category": "", "categoryclass": "", "imagename": "890db4d8c3aa2455545a0ca3130fe7ff.jpg", "infoid": 1005080, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从2006年到2016年，我想成为那种随身携带纸质笔记本的人。我买了不错的笔记本，每一本都坚持读了一半，然后就放弃了，然后又放弃了。\n2016年，一切都一下子改变了。自从我写完纸质日记后每个月。以下是我在之前的尝试中所做的更改和发现的缺陷。\n纸质笔记是仅附加的：就像对待它们一样。电脑笔记的无限灵活性让我对纸质笔记产生了扭曲的期望，在我旅行的早期，我会试着维护关于某些主题的笔记本。我试着把关于某本书的笔记记在一个连续的部分，在开头增加一个目录，并保持条理清晰。\n像数字笔记一样组织纸质笔记是一件愚蠢的事情。我发现唯一有效的组织策略就是这个。\n唯一一致的结构就是时间。音符会随着时间向前移动。你把笔记本的日期跨度写在封面上，把笔记的日期写在页面上，并保持笔记本的整齐。尽量将某个时间点的所有笔记保存在同一笔记本中。\n在写完笔记本的时候总结主题，而不是开始的时候。将主题列表添加到封面(内部或外部)，然后在一年后总结另一个笔记本中所有笔记本的主题。\n耐用性、便携性和容量是同一连续体的一部分。一本80页的笔记本可能需要一个坚固的封面，就像Moleskine或Leuchtturm笔记本上的那种。这是我尝试了很长时间的那种-但我在犹豫是否要牺牲这种幻想来换取可以放在口袋里的东西。在这一点上我完全错了：当我最终转到现场笔记时，我理解了这个空间的另一个更好的个人角落。这些小笔记本很精致，装在口袋或背包里一个月后就会开始坏掉，但是--长达48页，到那个月底，你就快用完它了。\n做完笔记后，如果没有地方放，做笔记是没用的。继续现场笔记粉丝的主题，我买了他们的“档案木盒”，一个价格过高但尺寸完美的…。盒子…。它是为容纳完成的音符而制造的。这一策略的关键是，你的笔记本大小完全相同，这样它们就会整齐地排列在一起，如果你在笔记本的一角标上开始和结束日期(就像我一样)，那么对于堆叠中的每一本笔记本来说，那个角落都会落在相同的位置。这也为您提供了一个添加带有日期&amp；标签的分隔符的结构的位置，这样以后查找特定笔记本就更容易了。\n我也做数字笔记：第一天是数字日志，档案馆是工作相关的或参考笔记。就像待办事项列表一样，我怀疑这些应用程序会随着时间的推移而改变并被取代，但值得庆幸的是，随着我开始了解自己的习惯和偏好，这种改变已经放缓。", "note_en": "From 2006 to 2016, I wanted to be the kind of person who carried a paper notebook around. I bought nice notebooks and consistently got halfway through each one before abandoning it and giving up again.\n In 2016, everything changed all at once. Every month since I’ve finished a paper journal. Here’s what I changed and the flaws that I discovered in my previous attempts.\n  Paper notes are append-only: treat them as such. The unlimited flexibility of computer note-taking gave me warped expectations of paper notes, and early in my journey I’d try to maintain notebooks about certain subjects. I tried to keep notes about a certain book in one contiguous section, add a table of contents at the beginning, and stay organized.\n Organizing paper notes like digital notes is a fool’s errand. The only organization strategy that I’ve found that works is this one.\n The only consistent structure is time. Notes go forward in time. You write the date span of notebooks on the cover, and the date of notes on the pages, and keep the notebooks in order. Try to keep all notes from a certain point in time in the same notebook.\n Summarize topics when you finish notebooks, never when you start. Add a list of topics to the front cover (inside or outside), and then after a year, summarize the topics from all notebooks in another notebook.\n  Durability, portability, and capacity are part of the same continuum. An 80-page notebook will probably need a rigid cover, like the kind on a Moleskine or Leuchtturm notebook. That’s the kind that I tried using for a long time – I was hesitant to sacrifice the fanciness of that for something that was pocketable. I was completely wrong about that: when I finally switched to Field Notes, I understood the other, personally better corner of the space. The small notebooks are delicate, and start breaking down after a month being carried around in a pocket or a backpack, but – at 48 pages long, by the end of that month, you’re about finished using it anyway.\n  Taking notes is useless without a place to put them when you’re done. Continuing on the theme of Field Notes fandom, I bought their ‘Archival Wooden Box’, a wildly overpriced but perfectly-sized… box… made to hold finished notes. Key to this strategy is that your notebooks are precisely the same size, so that they line up neatly and if you mark a corner of the notebook with its start &amp; end date (as I do), that corner will fall in the same place for each notebook in the stack. This also gives you a place to add structure with dated &amp; labeled dividers, so it’s easier to hunt down a specific notebook later on.\n  I also take digital notes:  Day One as a digital journal, and  The Archive for work-related or reference notes. Like with  todo lists, I suspect those applications will change and be replaced over time, but thankfully as I’ve started to understand my own habits and preferences, that change has slowed.", "posttime": "2020-06-04 08:32:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "纸质,paper,笔记", "title": "纸质笔记(2019)", "title_en": "Paper Notes (2019)", "transed": 1, "url": "https://macwright.org/2019/01/02/paper-notes.html", "via": "", "real_tags": ["纸质", "paper", "笔记"]}, {"category": "", "categoryclass": "", "imagename": "2302ec59da2805060407bc9b13f22ed2.png", "infoid": 1005079, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自由/开源软件始于Richard Stallman的GNU项目和1978年麻省理工学院的自由软件基金会。今天，自由/开源软件为世界各地的项目、职业、业务和创新提供动力。\n“我会站在山顶对任何能听到我说话的人尖叫，说利用自由/开源软件对经营一家精简、盈利的企业至关重要。食谱整理应用程序ClipDish Target的开发商AppJawn的联合创始人乔·科泰莱斯说：“有很多例子表明，围绕自由/开源软件建立起来的整个行业都是因为开发者需要挠痒痒才存在的，”他是AppJawn公司的联合创始人，该公司是一款菜谱整理应用程序ClipDish Target的开发商。\n尽管自由/开源软件在时间、行业和项目上取得了响亮而持续的成功，但如果没有持续的推广和支持，它就不会出现，也不会保持今天的强势地位。\n“倡导自由/开源软件意味着支持自由/开源软件项目，并鼓励个人和公司在自由/开源软件许可证下贡献他们的代码。消费者VPN公司Private Internet Access的内容营销经理Caleb Chen表示：“在逐行的层面上，自由/开源软件就是这样发展起来的。”\n此外，倡导自由/开源软件意味着支持自由/开源软件社区周围的基础设施-我能想到的最好的例子就是支持软件自由保护协会，而软件自由保护协会反过来又为自由/开源软件项目提供关键的支持，并帮助他们在世界的法律框架中导航，“陈补充道。\n然而，自由和开放源码软件的倡导也是为了让每个需要它的人都知道这个词。\n自由/开源软件倡导者和技术记者Don Watkins说：“自由和开放源码软件的宣传很重要，因为仍然有大量的人不知道什么是自由和开放源码软件，以及它如何为每个人创造公平的竞争环境，无论是年轻人还是老年人。”\n自由和开放源码软件的粉丝们也很快指出了它更广泛的覆盖范围。“自由和开放源码软件是一个令人难以置信的推动者和连接者。没有开源，我们所知的互联网就不会存在，“彼得·塔莱基斯(Peter Thaleikis)说，他是一名来自德国和新西兰的软件工程师和开源爱好者。\n“如果没有开源至少是底层技术，任何在线业务都是不可想象的：路由器运行开源固件，服务器运行Linux，它们所服务的网站都是使用开源软件构建的。开放源码和开放标准使互联网成为可能，“Thaleikis补充说。\n除了提供建立互联网的手段外，事实证明，开源软件对于建立和维护网站至关重要。因此，开源成为电子商务的基石，也是更多开源软件企业支持电子商务的发起人。\n“对我们来说，构建自由开放源码的软件非常重要。我们相信开源会带来更好的结果，“HAProxy Technologies的产品总监Daniel Corbett说。HAProxy Technologies是一家软件负载平衡器提供商，也是OpenSSL和Linux内核等开源项目的贡献者。\nCorbett解释说，开源的核心原则是“能够查看底层代码，而且由于HAProxy源代码可以在GitHub上获得，这意味着任何人都可以研究项目、查看其提交、提交错误报告和跟踪进度。这提供了完全透明，并允许轻松审核代码的安全问题。另一个很大的好处是围绕该项目的社区的增长。“。\n另一个主要好处是，开源软件往往比其专有软件更安全，部分原因是有更多的人关注代码来查找和修复缺陷，并在其中建立安全性。\n有趣的是，自由/开源软件可以而且经常会同时催生由业务和项目组成的组织。\nThaleikis说：“整个公司都建立在开源软件之上：开源并不排除建立业务并使其可持续发展。”\nTailwind CSS和Laravel只是两个开源项目的例子，它们同时是两家公司，使这些开源项目的创建者能够全心全意地专注于构建一些伟大的东西，这些东西仍然可以免费供任何人使用。也有一些公司经营SaaS业务，并将产品作为开源共享。InvoiceNinja是一个有趣的例子，“Thaleikis补充道。\n非开源的商业企业也出于各种原因接受了自由/开源软件。但他们是集体这么做的，这表明这是一种持续的移民，而不是一种暂时的趋势。\n“我们最近看到了向开源的巨大转变。这在一定程度上是由于不断变化的客户需求和快速创新的推动，“Aiven开源专家兼首席技术官Heikki Nousiainen说。\n“今天，我们可以将开放源码确定为业务增长和构建新应用程序等流程的强大组件。源自现有开源项目的协作性质和好处是其可信度将继续膨胀的原因之一，并促使更多的组织在未来采用它，“Nousiainen补充道。\n例子不胜枚举，五花八门。他说：“如果我们只能依靠闭源产品，将我们的产品推向市场的成本将增加两倍。这不是因为自由/开源软件是“免费的”，而是因为我们堆栈中的关键部分就是没有商业上的等价物，科特莱斯说。\n协作是为企业实现最大收益的关键。事实上，这正是开放源码的精神，也是其成功的基础。\n“作为一名开源倡导者，我坚信开源协作可以最大限度地促进创新。这就是为什么我联合创立了TODO集团，该集团将公司聚集在一起，分享启动开放源码程序的最佳实践。而且，为了确保公司在业务创新的同时帮助维持开源，“Linux基金会负责开发人员关系的副总裁兼云本地计算基金会的CTO/COO Chris Aniszczyk说。\nAniszczyk补充说：“从长远来看，我们都做得越多，确保我们不仅消费开源，而且找到回馈我们所依赖的项目的方法，就会帮助我们所有人。”\n虽然自由/开源软件是软件，但它是由人们构建的，而这些人反过来又从制作它的过程中获益，与使用它的人一样多。\n“它允许你通过阅读别人的代码来向他们学习，它允许人们展示他们的技能，同时分享他们的工作。你可以通过为他们的开源项目做贡献来找到“虚拟导师”。公司可以通过检查他或她的开源工作找到最合适的开发人员，“Thaleikis解释说。\n“自由/开源软件是我有职业的原因，也是我非常热爱的东西。在幕后，自由/开源软件为世界上大多数主要的软件项目提供动力。它是大多数项目的基石，也是构建更好软件的起点，“Riot Games的高级开发人员吉恩·乔尔巴(Gene Chorba)说。\n超级明星凭借才华和努力迅速崛起。而且很多人从无到有地创建了企业和项目。\n“我是开源的超级粉丝，因为对开源项目的贡献让我从大学毕业后找到了第一份主要工作，我对此永远心存感激。Aniszczyk说：“那些早期对Linux发行版的开源贡献让我有幸从事开源技术的工作，从一名维护员到最近围绕云本机计算构建了一个开源基金会。\n随着开源技能成为招聘市场上最受欢迎的技能，机会比比皆是。即使在失业率飞涨的大流行期间，自由和开放源码软件也为那些试图晋升和刚刚开始的人提供了职业机会。\n“自由/开源软件是我们看到未来的舞台。无论是在开发的软件类型中，还是在从事该软件开发的人员中。通过自由/开源软件开发学习、工作和学习的人是软件行业的未来。乔尔巴说：“这也是一条巨大的捷径，没有足够多的人利用它来提升你的职业水平。”\n自由/开源软件的另一大优势是它对开发人员和用户的包容性。这就更有理由提倡对所有人口和人口使用它。\n“我经常被要求为收入有限的老年人提供解决方案，他们的电脑是恶意软件和病毒的牺牲品。我喜欢为他们提供Linux和开源选项。大多数人从来没有听说过这种选择，他们对这种体验的积极程度感到惊讶。“沃特金斯说。\n沃特金斯补充说：“对于那些选择继续使用Windows或MacOS的人来说，许多人根本不知道LibreOffice、Audacity、Gimp、Inkscape等许多伟大的软件程序可以为他们提供高质量的工具，帮助他们完成他们认为只有通过昂贵的专有软件才能完成的任务。”\nChorba说：“在自由/开源软件中，世界是你的，你可以按照自己的节奏学习，建造任何你想要的东西，在任何你想要的项目上提供帮助。”", "note_en": "FOSS began with Richard Stallman’s  GNU Project and the  Free Software Foundation at MIT in 1978. Today, FOSS powers projects, careers, businesses, and innovations around the world.\n “I’d stand on the top of a mountain screaming to anyone that can hear me that leveraging FOSS is essential to running a lean, profitable business. There are examples of entire industries built around FOSS that only exist because a developer needed to scratch an itch,” says Joe Cotellese, co-founder of AppJawn, the makers of  ClipDish target, a recipe organizer app.\n Despite FOSS’s resounding and sustained success across time, industries, and projects, it would not have come into existence, nor will it remain the powerhouse it is today, without continuous promotion and support.\n  “FOSS advocacy means supporting FOSS projects and encouraging people and companies to contribute their code under FOSS licenses. At a line-by-line level, that is how FOSS grows,” said Caleb Chen, content marketing manager at  Private Internet Access, a consumer VPN company.\n “Additionally, FOSS advocacy means supporting the infrastructure around the FOSS community – the best example I can think of that PIA participates in is support of the Software Freedom Conservancy, which in turn provides crucial support for FOSS projects and helps them navigate the legal framework of the world,” Chen added.\n However, FOSS advocacy is also about getting the word out to everyone who needs it.\n “FOSS advocacy is important because there are still a large number of people who have no idea of what free and open source software is and how it can level the playing field for everyone whether young or old,” said  Don Watkins, FOSS advocate and technology journalist.\n  FOSS fans are also quick to point out its broader reach. “Free and open source software is an incredible enabler and connector. Without open source, the internet as we know it wouldn’t exist,” said  Peter Thaleikis, a software engineer and open source fan working from Germany and New Zealand.\n “No online business would even be thinkable, without open source being at least the underlying technology: Routers run open source firmware, servers run on Linux, the websites they serve are built using open source software. Open source and open standards are what made the internet possible,” Thaleikis added.\n Beyond providing the means to build the internet, open source software proved crucial to building and maintaining websites. Open source thus became a bedrock for e-commerce and the initiator of even more open source software businesses to support it.\n “For us, building free and open source software is very important. We believe that open source leads to better outcomes,” said Daniel Corbett, product director at  HAProxy Technologies, a software load balancer provider and contributor to open source projects, including OpenSSL and the Linux kernel.\n A central tenet of open source, Corbett explained, is “being able to view the underlying code, and since the HAProxy source code is available on GitHub, that means that anyone can study the project, see its commits, submit bug reports, and track the progress. This provides full transparency and allows the code to easily be audited for security issues. Another great benefit is the growth of a community around the project.”\n Another major benefit is that open source software tends to be more secure than its proprietary counterparts, in part because there are many more eyes on the code to find and fix flaws and to build security within.\n  Interestingly, FOSS can and often does spawn organizations that comprise businesses and projects at the same time.\n “Whole companies are built on top of open source software: open source doesn’t exclude building a business and making it sustainable,” said Thaleikis.\n “ TailwindCSS and  Laravel are just two examples of open source projects which are companies at the same time and enable the creators of these open source projects to concentrate wholeheartedly on building something great which is still free for anyone to use. There are also companies which run a SaaS business and share the product as open source.  InvoiceNinja is an interesting example,” Thaleikis added.\n Commercial businesses that are not open source born have also embraced FOSS for myriad reasons. But they have done so en masse, indicating a sustained migration rather than a momentary trend.\n “We’ve seen a big shift towards open source recently. This is due in part to ever-changing customer needs and the push to innovate quickly,” said Heikki Nousiainen, open source expert and CTO at  Aiven.\n “Today, we can identify open source as a strong component for processes like business growth and building new applications. The collaborative nature and benefits that root from existing open source projects are one reason its credibility will continue to balloon and cause more organizations to adopt it in the future,” Nousiainen added.\n Examples are numerous and varied. “The cost of bringing our product to market would have tripled if we had to rely on only closed-source products. Not because FOSS is ‘free’ but because critical pieces of our stack just don’t have a commercial equivalent,&#34; Cotellese said.\n    Collaboration is key to realizing maximum benefits for businesses. Indeed, it is the very spirit of open source and the foundation for its success.\n “As an open source advocate, I&#39;m a strong believer that open source collaboration maximizes innovation. That’s why I co-founded the TODO Group that brings together companies to share best practices in starting open source programs. And, to ensure that companies help sustain open source while innovating in their business,” said Chris Aniszczyk, vice president of developer relations at  The Linux Foundation and CTO/COO of the  Cloud Native Computing Foundation.\n “The more we all do to ensure that we not only consume open source but find ways to give back to projects we depend on helps us all in the long run,” Aniszczyk added.\n  While FOSS is software, it is built by people who in turn benefit from making it as much as those who use it.\n “It allows you to learn from others by reading their code, it allows people to present their skills and share their work at the same time. You can find ‘virtual mentors,’ by contributing to their open source projects. Companies can find the best suitable developer, by checking his or her open source work,” Thaleikis explained.\n  “FOSS is why I have a career and is something that I am extremely passionate about. Behind the scenes FOSS software powers most major software projects around the world. It&#39;s the building blocks of most projects and a jumping-off point to building better software,” said Gene Chorba, senior developer relations at  Riot Games.\n Superstars are quick to rise on merit and effort. And more than a few have created businesses and projects from scratch.\n “I’m a huge fan of open source as contributing to open source projects led to my first major job out of university, and I am forever grateful for that. Those early open source contributions to a Linux distro led to a career where I’ve been blessed to work on open source technology, from a maintainer to recently building an open source foundation around cloud native computing,” said Aniszczyk.\n  Opportunities abound as open source skills are the most desired on the hiring market. Even during this pandemic when unemployment is skyrocketing, FOSS offers career opportunities for those trying to advance and those just starting out.\n “FOSS software is the arena where we see the future. Either in the types of software developed or in the people who are working on it. The people studying, working on and learning through FOSS development are the future of the software industry. It&#39;s also a huge shortcut that not enough people take advantage of to level up your career,” said Chorba.\n Another big plus to FOSS is its inclusiveness for developers and users alike. And that is all the more reason to advocate its use to all populations and demographics.\n “I&#39;m routinely asked to provide solutions to senior citizens who live on limited incomes and whose computers are prey to malware and viruses. I like to provide them with the Linux and open source option. Most have never heard of that option and are surprised at how positive the experience can be,” said Watkins.\n “For those who opt to remain on Windows or MacOS, many are simply unaware of the host of great software programs like LibreOffice, Audacity, Gimp, Inkscape, and more that can provide them with high-quality tools that can help them accomplish tasks that they thought were only possible with costly proprietary software,” Watkins added.\n “In FOSS, the world is your oyster and you can learn at your own pace building whatever you want and helping on whatever projects you want,” Chorba said.", "posttime": "2020-06-04 08:31:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,开源,foss", "title": "自由/开源软件倡导者的多种形式", "title_en": "The Many Forms of FOSS Advocacy", "transed": 1, "url": "https://www.fosslife.org/many-forms-foss-advocacy", "via": "", "real_tags": ["软件", "开源", "foss"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005078, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这一突破是与总部位于卧龙岗的医学创新中心(Medical Innovation Hub)合作取得的，代表着治疗外周动脉疾病(PAD)的自膨胀镍钛合金支架生产的范式转变，这种疾病困扰着超过10%的澳大利亚人。\nPAD是一种脂肪沉积聚集并减少心脏外动脉-最常见的是腿部动脉的血液流动的情况。患有PAD的人通常在行走时会感到疼痛，在严重的情况下可能会发展成坏疽。\n工业、科学和技术部部长卡伦·安德鲁斯(Karen Andrews)表示，这项自主研发的技术有可能给价值160亿美元的全球支架制造业带来革命性的变化。\n安德鲁斯部长说：这是产业界与我们的研究人员合作开发一种创新产品的一个很好的例子，这种产品可以满足全球需求，并建立在我们的主权能力基础上。\n3D打印支架的能力预计将改进尺寸选择，保留基本解剖结构，并使直径和形状能够满足个别患者的要求。\n这一过程还可以在外科医生的指导下，在现场制作单个支架，减少库存，节省资金。\n找到一种在不损害金属独特性能的情况下3D打印自膨胀镍钛合金支架的方法已经向世界各地的冶金学家提出了挑战。\n位于墨尔本的CSIRO实验室22的科学家团队使用一种名为“选择性激光熔化”的尖端3D打印工艺破解了这一问题。\nCSIRO首席研究科学家SRI Lathabai博士说，这一过程使他们能够创造出具有高几何精度的复杂产品，这些产品是根据患者的具体情况而定的。\n由于它对应力和热量敏感，在3D打印条件下使用它是一种棘手的合金。\n我们必须选择正确的3D打印参数，以获得血管内支架所需的超细网状结构，并仔细管理热处理，这样一旦进入体内，最终产品就可以根据需要膨胀。&#34；我们必须选择正确的3D打印参数，以获得血管内支架所需的超细网状结构，并仔细管理热处理，这样成品一旦进入体内，就可以根据需要膨胀。\n医疗创新中心的首席执行官亚瑟·斯坦顿博士是一名血管外科医生，他已经治疗了数千名患者，并看到了改进治疗的必要性。\n斯坦顿博士说，目前，外科医生使用现成的支架，虽然它们的形状和大小各不相同，但总的来说，可用的支架范围是有限的。\n我们相信，我们的新型3D打印自膨胀镍钛合金支架通过更好的安装设备、更好的血管顺应性和更短的恢复时间，提供了更好的患者体验。\n这项技术也有机会用于大规模生产支架，可能会以较低的成本生产。\n一家名为Flex Memory Ventures的新公司已经成立，以推动该技术的商业化。\nCSIRO的第22实验室创新中心设在维多利亚州的克莱顿。专家研究团队与行业合作伙伴合作，制造了一系列世界第一的生物医学部件，包括世界上第一个3D打印的钛脚跟、胸骨和部分肋骨。\n在医疗创新中心，我们开发使医疗保健部门受益的技术。凭借三十多年的血管外科经验，我们的目标是通过将创新想法转化为真正的技术来改善所有澳大利亚人的血管护理。\n您的联系方式详细说明了您的问题*我们需要知道您想联系我们什么，这样我们才能给您答复。\n请将此字段留空：您不应该看到此字段。请重试，并将该字段留空。", "note_en": "The breakthrough, made in partnership with Wollongong-based Medical Innovation Hub, represents a paradigm shift in the production of self-expanding nitinol stents for Peripheral Arterial Disease (PAD), which afflicts more than 10 per cent of Australians.\n PAD is a condition in which fatty deposits collect and reduce blood flow in arteries outside the heart — most commonly in the legs. People with PAD typically experience pain when walking and in severe cases may develop gangrene.\n Minister for Industry, Science and Technology, Karen Andrews, said the home-grown technology had the potential to revolutionise the $16 billion global stent manufacturing industry.\n &#34;This is a great example of industry working with our researchers to develop an innovative product that addresses a global need and builds on our sovereign capability,&#34; Minister Andrews said.\n  The ability to 3D print stents is expected to improve sizing options, preserve essential anatomy, and enable diameters and shapes to suit individual patient requirements.\n The process could also allow for individual stents to be made on-site, under the surgeon&#39;s direction, reducing inventory and saving money.\n Finding a way to 3D print a self-expandable nitinol stent without compromising the metal&#39;s unique properties has challenged metallurgists around the world.\n The team of scientists at CSIRO&#39;s Lab22 in Melbourne cracked the problem using a cutting-edge 3D printing process called Selective Laser Melting.\n CSIRO Principal Research Scientist Dr Sri Lathabai said the process allowed them to create complex products with high geometric accuracy that are patient specific.\n  &#34;It&#39;s a tricky alloy to work with in 3D printing conditions, due to its sensitivity to stress and heat.\n &#34;We had to select the right 3D-printing parameters to get the ultra-fine mesh structure needed for an endovascular stent, as well as carefully manage heat treatments so the finished product can expand as needed, once inside the body.&#34;\n Chief Executive of Medical Innovation Hub Dr Arthur Stanton is a vascular surgeon who has treated thousands of patients and saw a need for an improved treatment.\n &#34;Currently, surgeons use off-the-shelf stents, and although they come in various shapes and sizes, overall there are limitations to the range of stents available,&#34; Dr Stanton said.\n &#34;We believe our new 3D-printed self-expanding nitinol stents offer an improved patient experience through better fitting devices, better conformity to blood vessel and improved recovery times.\n &#34;There is also the opportunity for the technology to be used for mass production of stents, potentially at lower cost.&#34;\n A new company, Flex Memory Ventures, has been established to drive commercialisation of the technology.\n               CSIRO&#39;s Lab22 Innovation Centre is based in Clayton, Victoria. The team of specialist researchers has worked with industry partners to build a range of world-first biomedical parts including the world&#39;s first 3D printed titanium heel, sternum and partial rib cage.\n  At Medical Innovation Hub we develop technologies to benefit the health care sector. With over thirty years of experience in vascular surgery behind us, we aim to improve vascular care for all Australians by turning innovative ideas into real technologies.\n    Your contact details  Your enquiry *    We&#39;ll need to know what you want to contact us about so we can give you an answer.\n     Leave this field blank please: You shouldn&#39;t be able to see this field. Please try again and leave the field blank.", "posttime": "2020-06-04 08:31:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打印,定制,tailor,支架", "title": "3D打印定制支架", "title_en": "3D printing tailor-made stents", "transed": 1, "url": "https://www.csiro.au/en/News/News-releases/2020/World-first-in-3D-printing-gives-a-personal-touch-to-keep-the-blood-flowing", "via": "", "real_tags": ["打印", "定制", "tailor", "支架"]}, {"category": "", "categoryclass": "", "imagename": "54700c48f5990f6cf43447ff68eeb614.png", "infoid": 1005077, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从2020年4月起，SeatGeek不再支持注册或登录Facebook。为确保您的帐户受到保护并能够登录，您必须确认您的帐户详细信息并添加密码。您可能已经收到一封电子邮件，提示您这样做，或者您可以在下次登录时在应用程序或网站中确认您的详细信息。\n如果您已注销帐户，请按照以下步骤确认您的SeatGeek帐户详细信息并登录：\n确认或更改与您的SeatGeek帐户关联的电子邮件地址。如果您的Facebook帐户使用旧的或过时的电子邮件地址，我们建议您更改电子邮件地址。\n如果您未自动登录，请使用您的电子邮件地址和新密码登录。\n确认或更改与您的SeatGeek帐户关联的电子邮件地址。如果您的Facebook帐户使用旧的或过时的电子邮件地址，我们建议您更改电子邮件地址。\n如果您未自动登录，请使用您的电子邮件地址和新密码登录。\n确认或更改与您的SeatGeek帐户关联的电子邮件地址。如果您的Facebook帐户使用旧的或过时的电子邮件地址，我们建议您更改电子邮件地址。\n点击移动网站导航栏上的登录，导航到登录屏幕。\n确认或更改与您的SeatGeek帐户关联的电子邮件地址。如果您的Facebook帐户使用旧的或过期的电子邮件地址，我们建议您更改电子邮件地址。", "note_en": "As of April 2020, SeatGeek no longer supports signing up with or logging in with Facebook. To ensure that your account is protected and that you are able to log in, you will have to confirm your account details and add a password. You may have already received an email prompting you to do so, or you will be able to confirm your details in the app or website the next time you go to log in.\n If you’re logged out of your account, follow the steps below to confirm your SeatGeek account details and log in:\n Confirm or change the email address associated with your SeatGeek account. We recommend changing your email address if your Facebook account uses an old or outdated email address.\n   Log in with your email address and new password if you aren’t automatically logged in.\n Confirm or change the email address associated with your SeatGeek  account. We recommend changing your email address if your Facebook account uses an old or outdated email address.\n   Log in with your email address and new password if you aren’t automatically logged in.\n Confirm or change the email address associated with your SeatGeek account. We recommend changing your email address if your Facebook account uses an old or outdated email address.\n Navigate to the login screen by tapping  Sign In  on the Mobile Website navigation bar.\n   Confirm or change the email address associated with your SeatGeek account. We suggest changing your email address if your Facebook account uses an old or outdated email address.", "posttime": "2020-06-04 08:31:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,注册,longer,登录", "title": "SeatGeek不再支持注册或登录Facebook", "title_en": "SeatGeek no longer supports signing up with or logging in with Facebook", "transed": 1, "url": "https://support.seatgeek.com/hc/en-us/articles/360044786153-Why-can-t-I-sign-in-with-Facebook-anymore-#:~:text=As%20of%20April%202020%2C%20SeatGeek,details%20and%20add%20a%20password.", "via": "", "real_tags": ["facebook", "注册", "longer", "登录"]}]