[{"category": "", "categoryclass": "", "imagename": "60b0c7a974d2e051e939ee9ee32ac701.png", "infoid": 1000746, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "可以肯定的是，大多数读者都知道什么是竞争条件。然而，为了完整性，让我包含简短的描述。就计算机编程而言，争用条件是两段代码如果同时执行会导致错误的错误。\n作为内核，QA我最感兴趣的是编写测试用例，这些测试用例可以在内核代码中重现曾经固定的竞争，以避免回归，并确保所有代码流(如稳定内核)都没有bug。\n这些测试的主要问题是它们出了名的不可靠。特别是当竞争窗口非常小，只有几条指令长度时，几乎不可能编写能够合理可靠地触发问题的测试。\n竞争复制器测试通常是这样实现的，这样两个线程运行两个不同的循环，每个循环都有不同的代码段，希望竞争能够触发。对于内核，这通常意味着两个线程，每个线程在一个循环中调用不同的syscall。这种方法的问题是，我们依赖系统抖动才能达到比赛窗口。正如你可能知道的那样，计算机大多是确定性的，因此我们在这种情况下很大程度上依赖于运气。\n当我们将概念的CVE证明转换为LTP测试用例时，我们开始思考是否可以做得更好。经过三次重新设计和重写，我们最终得到了一个很好的库，它可以极大地提高成功引发竞赛的可能性。作为一个副作用，我们需要的迭代次数要少得多，并且我们的测试用例在无竞争系统上完成的速度要快得多。\n总体思路相当简单。首先，我们采样导致比赛运行的两段代码需要多长时间。一旦解决了这个问题，我们需要做的就是相应地同步代码段。因为我们不知道两个部分的哪些部分需要对齐才能触发竞争，所以我们同步代码部分，以便在每次迭代中对齐是随机的。但我们也要确保两个赛段重叠，否则就没有机会触发比赛。\n不过，实现有点复杂。在抽样阶段，我们使用移动平均，我们等待偏差稳定下来，以便我们对赛段持续时间有合理的近似值。区段的同步依赖于原子增量和自旋锁，用于排列随机化的延迟由校准的繁忙环路引入。\n不，不完全是。现实世界的问题要比这复杂一点。这是真的，模糊同步库适用于许多种族复制者很好，但有些情况下根本不起作用。我们发现的问题之一是，系统调用的持续时间可能会根据竞速代码的第二部分的对齐而有很大的不同。\n例如，考虑使用Close()与recvmsg()竞争。如果我们将这两个syscall对齐，使文件描述符在recvmsg()开始时关闭，则syscall将快速返回EBADF，这是零成功的机会。CVE-2016-7117就是这种情况，因此必须引入一个函数来偏置代码段的偏移量，以便在这种情况下成功完成采样阶段。\n下面是一段试图重现d90a10e2444b“fstification：fix fstify_mark_connector race”的代码。\n静态结构tst_fzsync_air fzsync_air；static int fd；static void*write_Seek(void*unuse){char buf[64]；while(tst_fzsync_run_b(&amp；fzsync_air)){tst_fzsync_start_race_b(&amp；fzsync_air)；safe_write(0，fd，buf，sizeof(Buf))；Safe_Write(0，fd，buf，sizeof(Buf))；Safe_。}静态无效设置(VOID){FD=SAFE_OPEN(FNAME，O_CREAT|O_RDWR0600)；tst_fzsync_pair_init(&amp；fzsync_pair)；}static无效清理(VALID){IF(FD&&gt;；0)SAFE_CLOSE(FD)；tst_fzsync_pair_cleanup(&amp；fzsync_pair)；}static VALID VERIFY_INNOTIFY(VALID){INT INOTIFY_FD；INT wd；INOTIFY_FD=SAFE_MYINOTIFY_INIT1(0)；TST_FZSYNC_Pair_RESET(&AMP；fzsync_Pair，Write_Seek)；While(TST_fzsync_run_a(&amp；fzsync_Pair)){wd=SAFE_MYINOTIFY_ADD_WATCH(inotify_fd，FNAME，IN_Modify)；tst_fzsync_start_race_a(&amp；fzsync_air)；wd=myinotify_RM_watch(inotify_FD，wd)；TST。inotify_rm_watch()失败。&#34；)；}SAFE_CLOSE(Inotify_Fd)；/*我们在给定时间内存活-测试成功*/tst_res(tpass，&#34；内核在inotify测试中存活&#34；)；}静态结构tst_test={.nesids_tmpdir=1，.setup=setup，.leanup=Cleanup，.test_all=Verify_inotify，}；\n如您所见，初始化和退出是在setup()和leanup()函数中处理的。\n函数的作用是：清除计数器，并启动与主线程竞争的线程。", "note_en": "Most of the readers, for sure, do know what a race condition is. Let me however include short description just for the sake of completeness.  Race condition, in terms of a computer programming, is a bug where two pieces of code cause an error if executed concurrently.\n As a kernel  QA I&#39;m mostly interested in writing testcases that can reproduce once fixed races in kernel code in order to avoid regressions and also to make sure all code streams, such as stable kernels, are bug free.\n The main problem with these tests is that they are notoriously unreliable. Especially when the race window is very small, just a few instructions in length, it&#39;s nearly impossible to write a test that can reasonably reliably trigger the problem.\n  Race reproducer tests are usually implemented so that two threads runs two different loops each with a different piece of code in a hope that the race would trigger. In a case of a kernel this usually means two threads each calling a different syscall in a loop. The problem with this approach is that we are depending on system jitter in order to hit the race window. And as you may know computers are mostly deterministic, hence we are strongly depending on luck in this case.\n  We started to ponder if we can do better while we were converting a  CVE proof of concepts into a LTP testcases. We ended up, after three redesigns and rewrites, with a nice library that can greatly improve the likelihood of triggering a race successfully. As a side effect we need much less iterations and our testcases finish much faster on race-free systems.\n The overall idea is quite simple. First we sample how long it takes for the two pieces of code that cause the race to run. Once that is settled all we need to do is to synchronize the code sections accordingly. As we do not know which exact parts of the two sections needs to be aligned to trigger the race, we synchronize the code sections so that the alignment is random in each iteration. But we also make sure that the two sections overlap, otherwise there is no chance to trigger the race.\n The  implementation is a bit more complicated though. In the sampling phase we are using moving average and we wait for the deviation to settle down so that we have reasonable approximation of the race sections duration. Synchronization of the sections depends on atomic increments and spinlocks and the delay, used for alignment randomization, is introduced by a calibrated busy loops.\n  No, not completely. The real world problem is a bit more complex than that. It&#39;s true that fuzzy sync library applies well to many race reproducers but some cases does not work at all. One of the problems we found is that the syscall duration may vary considerably depending on the alignment of the second piece of the racing code.\n Consider for example  recvmsg() racing with  close(). If we align these two syscalls in a way that the file descriptor would be closed at the beginning of  recvmsg() the syscall will quickly return  EBADF which has zero chance of hitting the race. This was the case for  CVE-2016-7117 so had to introduce a function to bias the offset of the code sections in order to finish sampling phase successfully in this case.\n  Piece of code that attempts to reproduce  d90a10e2444b “fsnotify: Fix fsnotify_mark_connector race” follows.\n static struct tst_fzsync_pair fzsync_pair;static int fd;static void *write_seek(void *unused){ char buf[64]; while (tst_fzsync_run_b(&amp;fzsync_pair)) { tst_fzsync_start_race_b(&amp;fzsync_pair); SAFE_WRITE(0, fd, buf, sizeof(buf)); SAFE_LSEEK(fd, 0, SEEK_SET); tst_fzsync_end_race_b(&amp;fzsync_pair); } return unused;}static void setup(void){ fd = SAFE_OPEN(FNAME, O_CREAT | O_RDWR, 0600); tst_fzsync_pair_init(&amp;fzsync_pair);}static void cleanup(void){ if (fd &gt; 0) SAFE_CLOSE(fd); tst_fzsync_pair_cleanup(&amp;fzsync_pair);}static void verify_inotify(void){ int inotify_fd; int wd; inotify_fd = SAFE_MYINOTIFY_INIT1(0); tst_fzsync_pair_reset(&amp;fzsync_pair, write_seek); while (tst_fzsync_run_a(&amp;fzsync_pair)) { wd = SAFE_MYINOTIFY_ADD_WATCH(inotify_fd, FNAME, IN_MODIFY); tst_fzsync_start_race_a(&amp;fzsync_pair); wd = myinotify_rm_watch(inotify_fd, wd); tst_fzsync_end_race_a(&amp;fzsync_pair); if (wd &lt; 0) tst_brk(TBROK | TERRNO, &#34;inotify_rm_watch() failed.&#34;); } SAFE_CLOSE(inotify_fd); /* We survived for given time - test succeeded */ tst_res(TPASS, &#34;kernel survived inotify beating&#34;);}static struct tst_test test = { .needs_tmpdir = 1, .setup = setup, .cleanup = cleanup, .test_all = verify_inotify,};\n As you can see the initialization and exit are handled in the  setup() and  cleanup() functions.\n  The  tst_fzync_pair_reset() functions clears the counters and also starts a thread that is racing against the main thread.", "posttime": "2020-05-05 20:56:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,触发,races,竞争,race", "title": "如何在Linux内核中可靠地触发竞争", "title_en": "How to trigger races reliably in the Linux kernel", "transed": 1, "url": "https://people.kernel.org/metan/how-to-trigger-races-reliably", "via": "", "real_tags": ["linux", "触发", "races", "竞争", "race"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000745, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一份关于普通公众使用口罩作为控制冠状病毒在社区传播的方法的新报告在科学家中爆发了争执。\n英国皇家学会(Royal Society)召集的一个名为Delve的多学科小组发布的这份报告-病毒流行的数据评估和学习-权衡了证据，并站出来支持公众佩戴口罩，包括自制的布料，以应对冠状病毒。\n报告指出：“我们的分析表明，如果在物理距离不可能或不可预测的情况下广泛使用口罩，与标准使用口罩保护佩戴者相比，使用口罩可能会减少无症状和无症状的佩戴者的传播。”“如果在此基础上正确使用，口罩，包括自制的布制口罩，可以有助于减少病毒传播。”\n世界卫生组织(世卫组织)关于口罩的指南在冠状病毒大流行期间保持一致。它坚持口罩是给医护人员的，而不是公众的。\n他说：“佩戴医用口罩是其中一项预防措施，可限制某些呼吸道病毒疾病，包括冠状病毒的传播。然而，仅使用口罩并不足以提供足够的保护，还应采取其他措施。“。\n然而，随着一些国家放宽了封锁条件，他们一直强制要求在户外佩戴面罩，以此作为试图阻止病毒传播的一种方式。这是因为人们相信，遮脸可以防止咳嗽和打喷嚏的人将病毒喷出很远的距离。\n没有强有力的科学证据-以试验的形式-证明普通口罩可以阻止病毒感染戴口罩的人。还有人担心公众不会了解如何正确使用口罩，如果他们在摘下口罩然后触摸自己的脸时接触到病毒，可能会被感染。\n世卫组织担忧的另一个潜在原因是前线医护人员缺乏高质量的防护口罩。\n尽管如此，口罩在被已经感染的人使用时确实起到了一定的作用。这是公认的，他们可以阻止传播给其他人。鉴于许多冠状病毒携带者在感染后的头几天没有表现出任何症状，如果每个人都戴上口罩，显然可以发挥潜在的作用。\n这一结论是基于对三个关键考虑因素的分析，包括液滴作为传播途径的作用，以及口罩是否有助于减少液滴的扩散。然而，作者指出，目前只有少量的研究。\n但这份报告促使其他科学家表达了他们的保留意见，警告称这只是一种观点，夸大了现有的证据。\n雷丁大学细胞微生物学副教授西蒙·克拉克博士表示，这份报告“没有提供新的证据，在讨论口罩和覆盖物可能对人们的行为产生负面影响时，过于随意地忽视了预防原则”。\n他补充说：“在向任何一个方向提供更多证据之前，这就是所有可以基于意见的建议。”\n伦敦大学学院医院急性医学和传染病顾问本·基林利(Ben Killingley)博士也很关键。\n他说：“报告对遮脸的价值过于乐观，认为证据显示遮脸可以减少社区内病毒传播的结论是不正确的。”“事实上，没有很好的证据表明面罩可以做到这一点。”\nKillingley补充说，报告在很大程度上忽略了真实世界的数据，这些数据表明有效性很低，尽管是为了保护佩戴者。\n“这并不是说面罩可能没有帮助，”他说，并指出，在大流行期间或在一种新病毒的背景下，没有进行过口罩研究。“然而，在我看来，这份报告并没有准确地代表目前存在的关于面罩的证据，”他说。\n伦敦大学学院流行病和公共卫生系的安东尼奥·拉扎里诺博士对此表示赞同。\n“这不是一篇文章，也不是一项研究。这是对轶事和非临床研究的非系统回顾，“他说。\n拉扎里诺说：“在我们实施涉及数十亿人的公共干预之前，我们需要的证据最好来自人群水平的随机对照试验，或者至少来自与比较组的观察性随访研究。”拉扎里诺指出，这将使专家能够审视戴口罩的利弊。\n他说：“根据我们目前对冠状病毒传播动力学和病理生理学的了解，戴口罩的负面影响大于正面影响。”\n但牛津大学纳菲尔德初级保健健康科学系的特丽莎·格林哈尔教授对这份报告表示欢迎，称这份报告增加了公众遮脸可能是解除封锁的一部分的论点。\n她说：“它收集了大量证据，包括在实验室研究和随机对照试验中关于源头控制和穿着者保护的传播学和布基材料的功效。”\n“作者指出了一个重要的发现，即SARS-CoV-2(冠状病毒)的大部分传播(如果不是大部分传播)发生在目前没有症状的人身上。正如这群杰出的科学家所期望的那样，潜在的证据基础被仔细地剖析和展示，包括指出需要进行更多研究的领域。“\nGreenhalgh指出，虽然有人担心公众使用口罩可能会减少医护人员的医用级口罩的供应，但自制口罩对大多数人来说就足够了。“在医疗保健环境之外，不需要医用级别的口罩。布质口罩提供了很好的保护，戴起来更舒服。“", "note_en": "A row has erupted among scientists over a new report into  the use of face masks by the general public as an approach to managing the spread of Covid-19 in the community.\n The report from a multidisciplinary group convened by the Royal Society called Delve – Data Evaluation and Learning for Viral Epidemics – has weighed up the evidence and  come out in favour of the public wearing face masks, including homemade cloth coverings, in a bid to tackle Covid-19.\n “Our analysis suggests that their use could reduce onward transmission by asymptomatic and pre-symptomatic wearers if widely used in situations where physical distancing is not possible or predictable, contrasting to the standard use of masks for the protection of wearers,” the report notes. “If correctly used on this basis, face masks, including homemade cloth masks, can contribute to reducing viral transmission.”\n The World Health Organization (WHO)  guidance on face masks has remained consistent during the coronavirus pandemic. It has stuck to the line that masks are for healthcare workers – not the public.\n “Wearing a medical mask is one of the prevention measures that can limit the spread of certain respiratory viral diseases, including Covid-19. However, the use of a mask alone is insufficient to provide an adequate level of protection, and other measures should also be adopted,” the WHO has stated.\n Nevertheless, as some countries have eased lockdown conditions, they have been making it mandatory to wear face coverings outside, as a way of trying to prohibit spread of the virus. This is in the belief that the face covering will prevent people who cough and sneeze ejecting the virus any great distance.\n There is no robust scientific evidence – in the form of trials – that ordinary masks block the virus from infecting people who wear them. There is also concerns the public will not understand how to use a mask properly, and may get infected if they come into contact with the virus when they take it off and then touch their faces.\n Also underlying the WHO’s concerns is the shortage of high-quality protective masks for frontline healthcare workers.\n Nevertheless, masks do have a role when used by people who are already infected. It is accepted that they can block transmission to other people. Given that many people with Covid-19 do not show any symptoms for the first days after they are infected, masks clearly have a potential role to play if everyone wears them.\n The conclusion is based on analysis of three key considerations, including the role of droplets as a route of transmission, and whether masks can help to reduce dispersal of droplets. However the authors note there are only a small number of studies.\n But the report prompted other scientists to express their reservations, warning that it amounted to no more than opinion and overstated the available evidence.\n Dr Simon Clarke, associate professor in cellular microbiology at the University of Reading, said the report “falls short of delivering new evidence and too casually dismisses precautionary principle when addressing the possibility that masks and coverings could have negative effects on people’s behaviours”.\n He added: “Until more evidence is delivered in either direction, that’s all advice can be based on – opinions.”\n Dr Ben Killingley, consultant in acute medicine and infectious diseases at University College London hospital, was also critical.\n “The report is overly optimistic about the value of face coverings and it is incorrect to conclude that the evidence shows that face covering can reduce viral transmission in the community,” he said. “There is in fact no good evidence that face coverings achieve this.”\n Killingley added that the report largely ignored real-world data, which suggests low effectiveness, albeit for protection of the wearer.\n “This is not to say that face coverings might not be helpful,” he said, noting, face mask studies have not been carried out during a pandemic or in the context of a novel virus. “Nevertheless, the report, in my view, does not accurately represent the evidence on face coverings that currently exists,” he said.\n Dr Antonio Lazzarino of the Department of Epidemiology and Public Health at University College London, agreed.\n “That is not a piece or research. That is a non-systematic review of anecdotical and non-clinical studies,” he said.\n “The evidence we need before we implement public interventions involving billions of people, must come ideally from randomised controlled trials at population level or at least from observational follow-up studies with comparison groups,” said Lazzarino noting that will allow experts to look at the pros and cons of wearing masks.\n “Based on what we now know about the dynamics of transmission and the pathophysiology of Covid-19, the negative effects of wearing masks outweigh the positive,” he said.\n  But Prof Trisha Greenhalgh, of the Nuffield Department of Primary Care Health Sciences at the University of Oxford, welcomed the report, saying it adds weight to the argument that face coverings by the general public could be part of a route out of lockdown.\n “It draws together a wealth of evidence including the science of transmission and the efficacy of cloth-based materials both in laboratory studies and in randomised controlled trials, in relation to both source control and protection of the wearer,” she said.\n “The authors flag the important finding that much if not most transmission of Sars-CoV-2 [coronavirus] happens from people who do not currently have symptoms. As would be expected from this distinguished group of scientists, the underlying evidence base is meticulously dissected and presented, including pointing out areas where more research is needed.”\n Greenhalgh noted that while there have been concerns that use of masks by the public could reduce supply of medical-grade masks for healthcare workers, a homemade mask is sufficient for most people. “Medical-grade masks are not needed outside of healthcare settings. A cloth mask provides very good protection, and is more comfortable to wear,” she said.", "posttime": "2020-05-05 20:41:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,冠状病毒,科学家,face,口罩", "title": "关于口罩对冠状病毒的有效性的报告导致科学家意见不一", "title_en": "Report on face masks' effectiveness for Covid-19 divides scientists", "transed": 1, "url": "https://www.theguardian.com/world/2020/may/04/scientists-disagree-over-face-masks-effect-on-covid-19", "via": "", "real_tags": ["病毒", "冠状病毒", "科学家", "face", "口罩"]}, {"category": "", "categoryclass": "", "imagename": "cf396c88de06cf623887feeef5b0f916.jpg", "infoid": 1000743, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有没有想过你在禁闭演习中走过的那棵树是什么？有一个网站可以告诉你答案。\n来自Tree Talk的树地图已经存在了几年了，但并没有多少人知道它-它应该更为人所知，因为现在这张地图覆盖了伦敦的大部分地区。\n在使用中，如果树木不是绿色的圆圈可能会更好，因为这会使它们在地图背景下稍微难以发现，因为周围有其他公园和绿地-但一旦你放大一点，那里的情况就会变得更加清晰。\n除了识别你附近的那棵大树，还有一些有趣的分析地图，比如这张显示了伦敦各地稀有树种的地图。\n当然，任何分级标准都会有奇特之处，所以泰晤士河之所以看起来到处都是树，这要归功于海岸线上更密集的树木数量。不过，遗憾的是，泰晤士河上的漂浮森林会很酷。\n树地图就在这里，当你外出走动的时候，它可以在智能手机上使用。\n这个网站现在已经运营了十多年，虽然广告收入为网站提供了资金，但并不能支付成本。这就是为什么我与DonorBox建立了一个设施，在那里你可以为网站的成本做出贡献，并为新闻文章的写作和研究投入时间。\n这与“卫报”和许多较小的网站在面对成本上升和广告下降的情况下寻求创收的方式非常相似。\n无论是一次性捐款还是定期捐赠者，每一笔额外的支持都将大大有助于支付本网站的运营成本，并让您定期获得伦敦新闻和事实的最新信息。", "note_en": "Ever wondered what that tree is you passed during your lockdown exercise walk? There’s a website that tells you the answer.\n The Tree Map from Tree Talk has been around for a couple of years, but not many people know about it – and it should be better known as the map covers a lot of London now.\n  In use, it might be better if the trees weren’t green circles as that makes them slightly harder to spot against the map background where there’s other parks and green spaces around — but once you zoom in a bit it becomes clearer what’s there.\n Apart from identify that big tree near you — there’s also some interesting analysis maps, such as this one showing tree species rarity across London.\n  Of course, any grading scale will have oddities, so where the Thames seems to be filled with trees is thanks to denser numbers of trees on the shoreline. Pity though – a floating forest on the Thames would be cool.\n  The tree map is  here, and it works on a smartphone for when you’re out and about.\n     This website has been running now for just over a decade, and while advertising revenue contributes to funding the website, but doesn&#39;t cover the costs. That is why I have set up a facility with  DonorBox where you can contribute to the costs of the website and time invested in writing and research for the news articles.\n It&#39;s very similar to the way The Guardian and many smaller websites are now seeking to generate an income in the face of rising costs and declining advertising.\n Whether its a one-off donation or a regular giver, every additional support goes a long way to covering the running costs of this website, and keeping you regularly topped up doses of Londony news and facts.", "posttime": "2020-05-05 20:28:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "树木,trees,网站,tree", "title": "伦敦树木地图", "title_en": "A Map of the Trees of London", "transed": 1, "url": "https://www.ianvisits.co.uk/blog/2020/05/05/a-map-of-the-trees-of-london/", "via": "", "real_tags": ["树木", "trees", "网站", "tree"]}, {"category": "", "categoryclass": "", "imagename": "49df6df531d7c3e2ec6431ea553a0efb.png", "infoid": 1000742, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着各国驾驭一场史无前例的大流行，全球各地的人们纷纷撤退到自己的家中，以平坦冠状病毒的传播曲线。在此期间，享誉全球的耶鲁大讲堂《心理与美好生活》的线上迭代，已有来自多个不同国家的订阅者大量涌入。\n这门课由心理学教授兼西里曼学院(Silliman College)院长劳里·桑托斯(Laurie Santos)授课，最初于2018年春季在耶鲁大学开设。有1000多名学生注册，这门课成为耶鲁历史上最受欢迎的课程。这门为期10周的课程名为“福祉的科学”，在Coursera平台上免费提供，仅在过去几周就获得了100多万新订户。\n桑托斯告诉“新闻报”，她认为最近注册人数的激增反映了在大流行期间寻求以证据为基础的干预措施以保障心理健康的动机增强。\n桑托斯在给“新闻报”的一封电子邮件中写道：“每个人都知道如何保护自己的身体健康--洗手和保持6英尺的距离--但我认为，在这段充满挑战的时期，人们需要同样可行的技巧来改善自己的情绪和幸福感。”\n随着物理距离措施在世界各地的实施，桑托斯强调了保持社会联系的重要性。“好消息是，身体上的距离并不意味着社会孤立，”她说。根据她的说法，在这样的时刻，利用技术来找回我们生活中失去的社会元素，对于保持我们的心理健康是必不可少的。\n随着不断变化的环境颠覆了我们的日常习惯，桑托斯还强调，保持例行公事可以产生变革性的影响。\n“我们是习惯的生物，部分原因是稳定的习惯给了我们更多的控制权，”她说。“通过在原地避难的同时找到一个常规，我们可以减少每个人对这一天所做决定的认知疲劳，这可以让我们感到更有控制力。”\n在她的课程中，桑托斯还参考了经验证据来讨论正念和冥想如何能够减少焦虑和负面情绪。她告诉“新闻报”，“花时间关注我们的呼吸可以更好地调节我们过度活跃的交感神经系统。”\n20岁的迈克尔·博格(Michael Borger)是桑托斯学院的一名大四学生，他在耶鲁开设这门课程时参加了这门课程，他讨论了他认为现在的课程内容可以有所帮助的方法。\n他说：“她教给我们的最突出的一件事是享乐适应的概念，也就是我们适应新情况的能力。”“虽然这并不意味着我们在未来几个月不会感受到痛苦或失落，但它确实意味着我们有韧性，我们将适应我们的新现实，无论它们可能是什么.”\n安东尼娅·佩克托(Antonia Peixoto)是里约热内卢教皇天主教大学(Pontifical天主教University Of Rio De Janeir o)的法律系学生，她已经报名参加Coursera上的课程，在自己的课程间隙，课程已经转移到了在线平台。像世界各地的许多人一样，她希望了解更多关于她可以做些什么来让自己在大流行中站稳脚跟的信息。\n她说：“在危机期间，我们开始质疑自己，以及我们处理如此多痛苦的能力，这是很自然的。”“我认为这门课程如此相关的原因之一是，它向我们展示了我们自己的大脑对我们福祉的影响。引导这种力量从来没有像现在这样重要。“。\n桑托斯最近为她广受欢迎的播客“幸福实验室”录制了一系列关于冠状病毒的新节目。她希望通过这些事件，包括如何“战胜你的孤立孤独”和“保持你的关系幸福”的讨论，传达一个信息，无论情况多么糟糕，我们的反应最终都是我们自己决定的。\n在每一集“冠状病毒奖金”中，桑托斯都接待了嘉宾，包括西北大学关系与动机实验室主任、心理学家伊莱·芬克尔，以及耶鲁学生利亚姆·埃尔金德21岁，他是“看不见的手”的联合创始人，这是一项帮助弱势群体足不出户就能获得补给的倡议。\n桑托斯说：“播客的每一集都经历了不同的提示，从把危机重塑为保护你的浪漫关系的挑战，到使用社交情感的力量来寻找通过科技联系的方法。”“我们希望我能给我的听众一些循证的建议，他们可以立即付诸实践，让他们在这段紧张的时间里感觉更好。”\n《幸福实验室》第二季将于4月27日上线。", "note_en": "As nations navigate a pandemic of unprecedented proportions, people across the globe have retreated into their homes to flatten the curve of COVID-19 spread. During this time, the online iteration of the world-famous Yale lecture class “Psychology and the Good Life” has seen a large influx of subscribers from several different countries.\n Taught by Laurie Santos, professor of Psychology and Head of Silliman College, the class was originally offered at Yale in the spring of 2018. With over 1,000 students enrolled, it became the most popular course in Yale history. Under a new title, “The Science of Well-being,” the 10-week class is being offered for free on the Coursera platform and has garnered over one million new subscribers over the past few weeks alone.\n Santos told the News she believes the recent surge in sign-ups reflects an increased motivation to pursue evidence-based interventions to safeguard mental health during the pandemic.\n “Everyone knows how to protect their physical health — washing hands and keeping six feet apart — but I think people want similarly actionable tips to improve their mood and well-being during this challenging time,” Santos wrote to the News in an email.\n As physical distancing measures are enforced around the world, Santos stresses the importance of remaining socially connected. “The good news is that physical distancing doesn’t mean social isolation,” she said. According to her, in moments as trying as these, harnessing technology to take back social elements our lives have lost is essential in preserving our mental health.\n With changing circumstances upending our day-to-day habits, Santos also emphasized that maintaining a routine can have transformative effects.\n “We’re creatures of habit, in part because stable habits give us more control,” she said. “By finding a routine while sheltering in place, we can reduce the cognitive fatigue of each individual decision about the day, which can make us feel a bit more in control.”\n In her course, Santos also refers to empirical evidence to discuss how mindfulness and meditation can reduce anxiety and negative emotions. She told the News that “taking time to focus on our breath can better regulate our overly active sympathetic nervous systems.”\n Michael Borger ’20, a senior in Santos’s college who took the class when it was offered at Yale, discussed ways in which he believes the content of the course can be helpful right now.\n  “One thing she taught us that stood out was the concept of hedonic adaptation, or our ability to adapt to new situations,” he said. “While this does not mean we won’t feel pain or loss in the coming months, it does mean that we are resilient and that we will adjust to our new realities, whatever they may be.”\n Antonia Peixoto, a law student at Pontifical Catholic University of Rio de Janeir o , has signed up to take the class on Coursera in between her own classes, which have moved to online platforms. Like many around the world, she hopes to learn more about what she can do to keep herself grounded amidst the pandemic.\n “During a crisis, it’s only natural that we begin to question ourselves, as well as our capacity to deal with so much distress,” she said. “One of the reasons why I think this course is so relevant is that it shows us the power of our own brains over our well-being. There has never been a time when channeling that power has been as important as now.”\n Santos recently recorded a series of new episodes on Coronavirus for her popular podcast, “The Happiness Lab.” Through these episodes, which include discussions on how to “Beat Your Isolation Loneliness” and “Keep Your Relationship Happy,” she hopes to convey the message that however awful a situation may be, how we react is ultimately up to us.\n In each one of the “Coronavirus Bonus” episodes, Santos hosted guests including psychologist Eli Finkel, director of the Relationships and Motivations Lab at Northwestern University, and Yale student Liam Elkind ’21, co-founder of “Invisible Hands” — an initiative that helps people in vulnerable groups get supplies without leaving their homes.\n “Each episode of the podcast goes through a different tip, from reframing the crisis as a challenge to protecting your romantic relationships to using the power of social emotions to finding ways to connect through technology,” Santos said. “The hope is that I’m giving my listeners evidence-based tips that they can put into practice immediately to feel better during this stressful time.”\n The second season of “The Happiness Lab” will be launched on April 27.", "posttime": "2020-05-05 20:28:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "福祉,science,桑托斯,santos", "title": "Courseras“福祉的科学”课程拥有100多万订户", "title_en": "Courseras 'The Science of Well Being' course gets over a million subscribers", "transed": 1, "url": "https://yaledailynews.com/blog/2020/04/06/162062/", "via": "", "real_tags": ["福祉", "science", "桑托斯", "santos"]}, {"category": "", "categoryclass": "", "imagename": "d13717388dee65ae9ccf4d12f27c6858.jpg", "infoid": 1000741, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "成人直播网站CAM4发生了一起数据泄露事件，暴露了超过7TB的会员个人身份信息。\n这起事件是由安全侦探和阿努拉格参议员发现的。PII存储在超过108.8亿条数据库记录中。故障是错误配置的Elasticsearch群集。\nPII之所以被租用，是因为该网站的一个生产数据库在配置错误的Elasticsearch服务器上对互联网开放。CAM4每年约有20亿访问者，会员每周播放的成人内容超过100万小时。这使得每天播放的私人节目超过75，999个。\n好消息是，在事件报道后不久，CAM4的爱尔兰母公司Granity Entertainment立即撤下了这个不安全的数据库。\n显然，CAM4的用户记录包含各种不同组合的PII，包括姓名、性取向、电子邮件、IP地址、电子邮件信息记录，甚至用户的私人对话。\n此外，1100万条记录中还包括至少一个来自Gmail、iCloud和Hotmail等电子邮件提供商的电子邮件地址。这使得与成人站点相关的高度敏感的信息非常丰富。\n经过详细的分析，安全研究人员发现，650万受攻击的CAM4用户是美国居民。根据安全侦探的报告，其他受影响的国家包括巴西和意大利用户：\n美国、巴西和意大利用户受到的影响最大，尽管由于多个条目重复，很难准确估计电子邮件记录的确切数量。不出所料，阿联酋、沙特阿拉伯和伊朗等国的词条都为零，因为这些国家在国内禁止成人内容。\n研究人员指出，欺诈检测日志的可用性可以使恶意黑客更好地了解网络安全系统是如何建立的。然后，这些知识可以作为威胁参与者的有效验证工具加以利用，从而实现更高级别的服务器渗透。\n涉及恶意软件的恶意攻击也可能被启用，因为“网站后端数据可能被利用来利用网站并制造包括勒索软件攻击在内的威胁”。\n最后，最大的风险与受损的CAM4用户的财务和声誉方面有关。勒索骗局(性勒索骗局)可以向受害人发起，我们在其他类似的案件中已经看到了这种情况。\n2019年10月，Data Viper安全研究人员Bob Diachenko和Vinny Troia发现了一个完全开放的Elasticsearch服务器，其中包含“史无前例的40亿用户账户，数据超过4TB。”该服务器无需身份验证即可访问，从而暴露了超过12亿个独立个人的数据。\n可能会在您的系统上持续存在，并可能会再次感染。我们建议您下载SpyHunter并运行免费扫描以删除PC上的所有病毒文件。与自己进行拆卸相比，这为您节省了数小时的时间和精力。\nSpyHunter 5免费删除程序允许您在48小时的等待期内，对发现的结果进行一次补救和删除。阅读EULA和隐私政策。\n在开始实际删除过程之前，我们建议您执行以下准备步骤。\n备份所有文件，即使它们可能已损坏。您应该使用云备份解决方案备份您的数据，并确保您的文件不会丢失任何类型，即使是最严重的威胁。", "note_en": "CAM4, an adult live streaming website, has been through a data breach which exposed over 7TB of personally identifiable information of its members.\n The incident was discovered Security Detectives and Anurag Sen. The PII was stored on more than 10.88 billion database records. At fault is a misconfigured Elasticsearch cluster.\n  The PII was leased because one of the website’s production databases was left open to the Internet on a misconfigured Elasticsearch server.  CAM4 has approximately 2 billion visitors a year, with member streaming more than 1 million hours of adult content weekly. This makes over 75,999 private shows being broadcast every day.\n The good news is that the unsecured database was immediately taken down by Granity Entertainment, the Irish parent company of CAM4, shortly after the incident was reported.\n  Apparently, the CAM4 user records contained various PII in different combinations, including names, sexual orientation, emails, IP addresses, email message transcripts, and even private conversations of users.\n    In addition, 11 million of the records also included at least one email address from email providers such as Gmail, iCloud, and Hotmail. This makes for an abundance of highly sensitive information, associated with an adult site.\n   After a detailed analysis, the security researchers discovered that 6.5 million of the compromised CAM4 users are residents of the United States. Other affected nationalities include Brazilian and Italian users, according to the  Safety Detectives report:\n US, Brazilian and Italian users were the most heavily affected although the precise number of email records is difficult to gauge accurately due to multiple entries being duplicated. As expected, countries such as the UAE, Saudi Arabia and Iran all had zero entries given the fact that these countries ban adult content domestically.\n  The availability of fraud detection logs could enable malicious hackers to better understand how cybersecurity systems have been set up, the researchers noted. This knowledge could then be exploited as an efficient verification tool for threat actors, enabling a greater level of server penetration.\n Malicious attacks involving malware can also be enables, as “ website backend data could be harnessed to exploit the website and create threats including ransomware attacks”.\n Finally, the greatest risk is associated with the financial and reputational aspects of the compromised CAM4 users. Blackmail scams ( sextortion scams) can be launched against the victims, as we have already seen happening in other similar cases.\n  In October 2019, Data Viper security researchers Bob Diachenko and Vinny Troia  discovered a wide-open Elasticsearch server which contained “ an unprecedented 4 billion user accounts spanning more than 4 terabytes of data.” The server was accessible without the need of authentication, which exposed the data of more than 1.2 billion unique individuals.\n      may remain persistent on your system and may  re-infect it. We recommend you to download SpyHunter and run  free scan to remove all virus files on your PC. This saves you hours of time and effort compared to doing the removal yourself.\n SpyHunter 5 free remover allows you, subject to a 48-hour waiting period, one remediation and removal for results found. Read  EULA and  Privacy Policy\n    Before starting the actual removal process, we recommend that you do the following preparation steps.\n Do a backup of all of your files, even if they could be damaged. You should back up your data with a cloud backup solution and insure your files against any type of loss, even from the most severe threats.", "posttime": "2020-05-05 20:28:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据,data,电子邮件,cam4", "title": "CAM4数据泄露：7TB高度敏感的用户数据泄露", "title_en": "CAM4 Data Breach: 7 Terabytes of Highly Sensitive User Data Exposed", "transed": 1, "url": "https://sensorstechforum.com/cam4-data-breach-7tb-data/", "via": "", "real_tags": ["数据", "data", "电子邮件", "cam4"]}, {"category": "", "categoryclass": "", "imagename": "f56ecb788e4a3730f7bd633da09352aa.jpg", "infoid": 1000740, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我以前写过如何处理明显错误时的错误：当人们引入软件错误、破坏构建或意外删除某些内容时。有一条明确的路线可以遵循，在这个过程中你有机会提高团队的安全性。\n如果行为是错误的，但是这个人没有意识到，我们该如何处理这种情况呢？我们如何指出错误，并确保我们下次有更好的行为？\n在我职业生涯的早期，我的一个团队将我复制到他回复给外部联系人的电子邮件中。他的电子邮件听起来有点讽刺，我觉得这是不专业的。我决定我对此真的不高兴。在我看来，文化界限已经被越过了。\n我开始私下给他回信。想了想之后，我开始说：“我不赞成这种沟通方式。”我不记得那封电子邮件的其余部分了，但我记得那封邮件相当长，我详细地解释了我所有的理由。\n我发了电子邮件，转了转椅子，看着他打开了它。突然感到尴尬，我去拿了一杯咖啡，感觉到他在我离开房间时看着我。\n我们再也没谈过交换的事。在那之后，这个人在我的团队里呆了将近一年。我不认为我们的关系会完全恢复。\n这种方法有很多地方不对劲。让我们从“问题”本身开始。\n我根本没有给他任何关于如何代表公司的指示，他几乎没有工作经验。在更广泛的公司文化中，也没有任何东西可以清楚地表明这一点。当我没有解释我的标准时，期望我的团队成员符合我的标准是不公平的。通过我的无所作为，我的团队被完美地设计来实现我正在获得的结果。因此，这真的是我的错，因为我没有交流文化。\n如果我再这么做，我就不会管这件事了。损害已经造成，还没有重要到迫使他回去道歉的地步。稍后，我会非常清楚地告诉整个团队我期待的是什么样的行为。我会观察病情的好转或复发，只有在这种情况再次发生时才会提出这个问题。\n电子邮件是我处理这个问题的错误方式。这太正式了，而且矫揉造作。在之前解释了我的期望之后，我应该简单地和他私下谈一谈。然而，我太缺乏经验，不知道如何通过仔细的交谈来推动某人做出我所期待的行为。(如果你是远程领导，这里有更多关于如何远程实现这一点的信息。)。\n在这类谈话中，关键是要确保我们真的沟通得很好。沟通真的、真的很难做到正确。我们必须努力确保我们所说的话真正进入，被理解，并引起变化。如果我们在这件事上失败了，我们弊大于利。\n对于像这样的小问题，说：“这是一个小问题，但是…”是值得的。或“…”不过，这不是什么大事。“。明确确保您清楚问题有多严重。\n如果这是一个更大的问题，你手头的工作就更难了。首先“要求理解”。确保问题真的很严重是值得的，而且你没有弄错问题的另一端。问一些探索性的问题，以了解正在发生的事情。保持真诚的好奇心。你可能误解了所发生事情的情况。只有弄清楚实际问题是什么，你才会知道如何处理好它。\n(有关进行精彩对话的更多信息，我强烈建议您预订即将出版的“敏捷对话”一书。我很幸运地阅读了预览版，它是伟大的团队沟通的真正里程碑式的指南。在未来的帖子中会有更多关于这方面的信息。)。\n如果有任何形式的定期回顾，或者1：1，那么处理这件事可能会更容易。我什么都没做。\n说实话，我根本没有和这个人建立起良好的工作关系。我们只谈工作任务。我们的关系完全是肤浅的。因此，我很难很好地驾驭这个过程。\n从我的错误中吸取教训。花点时间问问你的团队成员他们做得怎么样。发现他们做得很好，并为此称赞他们。尽可能地建立关系和善意，在可能的情况下帮助你的团队。每个人都会更喜欢他们的工作(包括你)，而且你以后永远不会知道你什么时候会需要这种善意。\n错误地纠正某人是打击团队成员积极性的快捷方式。他们将不再关心球队，他们的产出将因此受到影响，传染将蔓延到其他人，这将是我们的错。随着时间的推移建立关系，努力进行正确的沟通。然后，你可以在需要的时候轻而易举地改正路线，这样你就可以把你的团队带到交付的新高度。\n在此浏览器中保存我的姓名、电子邮件和网站，以便下次我发表评论时使用。", "note_en": "I have written before on  how to deal with mistakes when the mistake is obvious: when people introduce software bugs, break the build, or delete something by accident. There’s a  clear route to follow, and you have an opportunity to improve team safety in the process.\n How do we deal with cases where behaviour is wrong, but the person isn’t aware? How do we point out the mistake, and ensure we get better behaviour next time?\n  Earlier in my career, one of my team copied me in to his email reply to an external contact. His email had a slightly sarcastic ring to it, and I felt that was unprofessional. I decided that I really wasn’t happy about this. In my mind, a cultural line has been crossed.\n  I started a private reply to him. After some thought, I began with “I don’t approve of this type of communication.” I don’t remember the rest of the email, but I do remember that it was quite long, and that I explained all my reasons in detail.\n I sent the email, turned my chair, and watched him open it. Suddenly embarrassed, I went to get a cup of coffee, feeling him watching me as I left the room.\n We never spoke about the exchange again. This person was in my team for nearly a year after that. I don’t think our relationship ever fully recovered.\n  There are so many things wrong with this approach. Let’s start with the “issue” itself.\n I had given no indication at all to him about how to represent the company, and he had little work experience. There was also nothing in the wider company culture that would have made this clear. It wasn’t fair to expect my team member to conform to my standards, when I hadn’t explained my standards. Through my inaction, my team was  perfectly designed to achieve the result I was getting. Therefore, this was really my fault for not communicating culture.\n If I was to do this again, I’d let the issue go. The damage was done, and it wasn’t important enough to force him to go back and apologise. At a later time, I’d make it quite clear to the whole team what kind of behaviour I was expecting. I’d have watched for an improvement or relapse, and only brought up this issue if it was repeated.\n  Email was the wrong way for me to deal with this issue. It was overly formal, and stilted. I should have simply had a quiet word with him, after previously explaining expectations. Yet I was too inexperienced to know how to nudge someone towards the behaviour that I was expecting through a careful conversation. (If you’re leading remotely,  here’s more on how to do this remotely.)\n In these kind of conversations, the key thing is to make sure we really are communicating well. Communicating is really, really difficult to get right. We must strive to ensure what we say actually goes in, is understood, and elicits change. If we fail in this, we have done more harm than good.\n For minor issues like this one, it pays to say: “this is a minor issue, but…” or “…it’s not a huge deal though”. Explicitly ensure you are clear about how severe the issue is.\n If it’s a bigger issue, you have a harder job on your hands. “Ask to understand” first. It pays to ensure that the issue really is severe, and you haven’t got the wrong end of the stick. Ask probing questions to understand what’s going on. Be genuinely curious. You may have misunderstood the circumstances of what happened. Only when it’s clear what the actual problem is will you know how to deal with it well.\n (For more on having great conversations, I’d highly recommend  preordering the upcoming Agile Conversations book. I’m lucky enough to have read a preview copy, and it’s a truly landmark guide to great team communication. More on this in a future post.)\n  If there had been  any kind of regular retrospective happening, or 1:1s, then dealing with this might have been easier. I wasn’t doing any of that.\n Truth be told, I simply hadn’t built up a proper working relationship with this person. We only talked about work tasks. Our relationship was entirely superficial. Therefore it was difficult for me to navigate this process well.\n Learn from my mistakes. Take the time to ask your team members how they’re doing. Catch them doing something well, and compliment them for it. Build up relationship and goodwill wherever possible, and help your team out wherever possible. Everyone will enjoy their jobs more (including you), and you’ll never know when you will need that goodwill later.\n  Correcting someone badly is a fast way to demotivate a team member. They will care less about the team, their output will suffer as a result, the contagion will spread to others, and it will be our fault. Build relationship over time, and work hard at getting the communication right. Then you can gently effortlessly course correct when needed, and you’ll take your team to new heights of delivery.\n      Save my name, email, and website in this browser for the next time I comment.", "posttime": "2020-05-05 20:27:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "团队,team", "title": "如何纠正团队成员：避免我破坏性的新手错误", "title_en": "How to correct a team member: avoid my damaging rookie mistakes", "transed": 1, "url": "https://deliverydoubled.com/correcting-a-team-member-avoid-my-damaging-rookie-mistakes/", "via": "", "real_tags": ["团队", "team"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000739, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "某些Word功能无法在Google Docs中显示，如果您进行更改，这些功能将被删除", "note_en": "Some Word features can&#39;t be displayed in Google Docs and will be dropped if you make changes", "posttime": "2020-05-05 20:27:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,app,android,issues,功能", "title": "在COVIDSafe Android应用程序的BLE实施中发现的隐私问题", "title_en": "Privacy issues discovered in the BLE implementation of the COVIDSafe Android app", "transed": 1, "url": "https://docs.google.com/document/d/1u5a5ersKBH6eG362atALrzuXo3zuZ70qrGomWVEC27U/edit#heading=h.q4sovraiy4kn", "via": "", "real_tags": ["程序", "app", "android", "issues", "功能"]}, {"category": "", "categoryclass": "", "imagename": "41f43f7e000723d8dadbe59120d0cd36.png", "infoid": 1000738, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "更新：30小时后，我们仍然无法验证我们的付款方式，即使我们已经两次联系到实时聊天支持团队，他们表示他们理解这是一个紧急情况，正在优先治疗。但一切都没有改变，除了一封确认他们几个小时前收到了请求的电子邮件。\n根据这篇帖子，从2018年开始，但变化不大。甚至他们也更新了他们的帐户管理策略，使其对GCP客户更加友好。\n我们的项目是一个区块链游戏服务，我们选择GCP是因为他们背后有非常好的产品，比如FiRestore，Cloud Functions，Cloud Pubsub，Kubernetes，…。并相信不会存在停机。\n我们已经运行了2个月的项目，所有的人都很满意。云功能和FiRestore是自动扩展，代码和管理更少。即使每秒有100个请求，该函数仍然运行良好，只是来自BigQuery的意外账单，但最终我们已经控制了这一点。\n那么我们的项目马上就被关闭了。所有故障、防火墙故障、云计算故障、云SQL故障、…故障。\n当时，我的团队没有意识到这一点，因为当时是我国时间的凌晨3点左右。然后3个小时后，我们开始核实。\n他们需要一张维萨卡的照片和一张政府签发的身份证的照片。我的帐单账户是我的，但为了支付发票，我们使用的是联合创始人的VISA卡。不幸的是，他没有身份证，所以我们用护照代替。\n大约一个小时后，我们收到了这封电子邮件：“您的Google支付将继续暂停”(请注意：由于Covid 19，响应时间可能比正常情况下预期的要长)\n我们不明白为什么？没有理由退货，我们以为VISA卡是无效的。所以这次我们提交了一张短信银行对账单的截图作为替代，并说明了我们的情况。\n然后大约一个小时后，电子邮件回复说：“您的谷歌支付将继续暂停”，上面同样的内容，并要求我们再次核实。然后我们又试了一次，这次我们把护照换成了驾照。但是它仍然不起作用，我们不知道为什么和如何使它起作用？而我们的客户却怒不可遏，因为网站关闭了将近6个小时。他们也不能做得和我们队一样好。\n现在我们试图再次提交，但是一个多小时，我们没有收到任何回复。而我的联合创始人正试图拿到银行对账单。但不幸的是，他现在在国外，处理过程可能需要1天或几个小时以上。\n我们已经尝试将项目备份或转移到另一个帐户以建立网站，但由于项目已暂停，因此无法完成。我们有一些备份文件，但这还不够，我们从来没有计划在Google Cloud上进行自动备份，因为我们从来没有想过这种情况会发生在今天。那是我们的错。现在我们所有的数据都可能丢失，如果验证不能通过，即使卡是我们自己的，我们的网站也会丢失。\n根据他们的付款条款，他们保留随时更改、暂停或中断其服务的任何方面的权利，包括任何服务或任何功能，而无需通知和承担任何责任。\n他们是对的，因为我注册帐户时按了“同意”键。\n嘿，谷歌！是否只有一个办法：立即暂停项目，然后要求核实付款方式？\n哦，我不知道该怎么回答。因为Google Cloud拥有很好的产品，如Firebase Auth、Functions、FiRestore、…。。使得开发时间更短。但是请注意计费方式。", "note_en": "Update: After 30 hours, we still cannot verify our payment method even we’ve reached the live chat support team twice and they said that they understand this is an urgent case and getting priority treatment. But nothing’s changed, except an email confirm that they have received the request few hours ago.\n   According to  this post since 2018, but there are not many things that have been changed. Even they updated their account management policies to be friendlier to GCP customers\n  Our project is a blockchain gaming service, we chose GCP because they have really good products behind such as Firestore, Cloud Functions, Cloud Pubsub, Kubernetes, … and believe that there will be no downtime exists.\n  We have run the project for 2 months with all satisfied. The Cloud functions and Firestore is auto scaleup with less code and management. Even there are 100 requests/second the function still works great, except an unexpected billing came from BigQuery, but finally we’ve controlled that.\n     Then immediately our project has been turned off. All downed, Firebase downed, Cloud Compute Downed, Cloud SQL downed, …\n At that time, my team did not recognize that, because it was about 3 AM in my country’s time. Then 3 hours later we started to verify.\n They required a photo of the VISA card and a photo of an ID issued by the government. My billing account was mine, but we used a co-founder’s VISA card in order to pay the invoices. Unfortunately, he hasn’t had the ID, so we used the passport as the replacement.\n About one hour later, we received this email: “Your Google payments will remain suspended“ (Please note: Due to Covid 19, the response time might take longer than normal expected)\n  We don’t understand why? No reason give back, we assumed that the VISA card wasn’t valid. So this time we submitted a screenshot of the SMS bank statement as the replacement and explain about our situation.\n Then about 1 hour later, the email responded: “Your Google payments will remain suspended” with the same content above and asked us to verify again. Then we tried again, this time we replace the passport by a driver license. But it still didn’t work, we don’t understand why and how to make it work? While our customers are ablaze with anger because the site is downed for almost 6 hours. They cannot do anything as well as our team too.\n Now we tried to submit once again, but more than an hour, we haven’t received any responses. While my co-founder is trying to get the bank statement. But unfortunately, he is abroad and the processing might take more than 1 day or several hours.\n  We’ve tried to backup or transfer the project to another account to make the website up, but that couldn’t because the project was suspended. We have some backup files, but it doesn’t enough, we’ve never planned to have an automatic backup on Google Cloud because we’ve never thought about this situation is occurring today. That’s our bad. Now all our data might be lost, our website will be lost if the verification cannot be passed even the card is our own.\n   By their Payments Terms, they reserve the right to change, suspend or discontinue any aspect of their services at any time, including any services or any feature  without notice and liability.\n  They were right because I was press “Agree” when I registered the account.\n     Hey Google! Is there just one way: immediately suspend the project then ask to verify the payment method?\n    Oh, I don’t know how to answer that. Because Google Cloud is owning good products such as Firebase Auth, Functions, Firestore,…. it makes the development time is shorter. But please be careful about the billing method.", "posttime": "2020-05-05 19:42:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,project", "title": "为什么不应该使用FireBase和Google云", "title_en": "Why you should not use firebase and google cloud", "transed": 1, "url": "https://medium.com/@amton15127/why-you-should-not-use-firebase-and-google-cloud-c05fe6ccdbe8", "via": "", "real_tags": ["google", "project"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000736, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "41年前的这个夏天，我还是一名年轻的调查员，在宾夕法尼亚州哈里斯堡和华盛顿特区为三里岛事故总统委员会工作，这是一项由达特茅斯教授约翰·凯梅尼(John Kemeny)主持的大型联邦调查，他最出名的身份是Basic编程语言之父。那年夏天和秋天，我不仅学到了很多关于核事故的知识，也学到了很多关于政府和行业如何应对危机的知识。其中一些经验教训适用于目前的冠状病毒大流行，它也管理不善。这可能会让你大吃一惊(41年前的教训仍然适用)，但尤其是政府，变化速度非常缓慢。\n我主要与之打交道的两个联邦机构是联邦紧急事务管理局(FEMA)和核管理委员会(NRC)。这两个机构在不久之前都经历了品牌重塑的努力，所以我遇到的几乎所有人都是在老品牌下开始他们的职业生涯的-民防和原子能委员会。这些早期的身份是这个故事的关键。\n如果你不记得民防，那就是负责规划第三次世界大战期间行动计划的机构。第三次世界大战是一场可能导致数百万人死亡的热核战争。民防在全国各地的公共建筑地下室修建了防空洞，为它们配备了生存物资。民防每周进行一次空袭测试，全镇都能听到巨大的警报声。民防教会了像我这样的小孩子躲在我们学校的课桌下，希望能在核武器落下的情况下拯救我们。\n但核武器从未下降，最终民防对美国政策的重要性开始下降。我明白我们还处于冷战时期。柏林墙仍然屹立不倒，罗纳德·里根甚至还没有参加总统竞选。但事情渐渐平息下来，所以决定将民防改建为联邦应急管理局，并承担其他类型的灾难的责任，如飓风、龙卷风，以及，嗯，核事故。三里岛是他们的第一个。\n没过多久，我就意识到，我会见的民防人员(每个人都是男性)都怀念过去与俄罗斯人争斗的日子，他们非常不确定如何处理这些新的紧急情况，比如我们称之为三里岛(TMI)的三里岛(Three Mile Island)。拥有TMI(通用公用事业或GPU)的公司表示，工厂是他们的孩子，事故都在控制之中，他们很快就会恢复运行。当然，这是一个彻头彻尾的谎言，但联邦应急管理局并不知道，因为联邦应急管理局什么都不知道。\n联邦应急管理局：“我们正在监测情况，并支持GPU，这似乎做得很好。”\n从某种意义上说，很难指责联邦应急管理局，因为他们不知道自己不知道的事情。但我们可以在某种结构层面上指责它们推迟使用GPU。我们在监管官僚机构中经常看到这一点。如果其他人要为这场巨大的、可能无法取胜的危机承担责任-那就让他们去吧-那是一堆热气腾腾的狗屎。站在一边看着假人失败。这就是联邦应急管理局最初在TMI做的事情。这是掩饰自己的好办法，但根本不是解决实际危机或帮助你的国家的办法。联邦应急管理局没有尽到自己的职责。\n联邦应急管理局不得不为卡特里娜飓风和玛丽亚飓风再次吸取同样的教训-又是两场他们迟迟没有进入的巨大灾难。\n在这一点上，我们可能会问，联邦应急管理局在1979年擅长什么？他们认为存在的真正原因是什么？我很快了解到联邦应急管理局非常擅长绘制地图和研究盛行风向。他们认为他们的真正职能是计划核攻击，目标是在最初的30天内将生命损失降至最低。为此，联邦应急管理局(如民防)制定并不断更新了详细的计划，以便在袭击发生后不久转移大量人员。他们会把死者留在那里，把活着的人转移到他们计算过的地方，在那里风力驱动的核尘埃会更少。\n他们的努力是一项崇高的30年努力，最终产生了越来越详细和复杂的计划，随着时间的推移，这些计划越来越远离现实。到1979年，联邦应急管理局的计划-只针对东北部各州-是在核袭击后的72小时内转移超过5000万人-据推测，这次袭击也会摧毁大部分基础设施。\n在当前冠状病毒危机的背景下看待这一点。在目前的情况下，我们没有被要求搬家，我们被要求不要搬家，这要简单得多。实际行动仅限于医疗箱、人员和补给。我们处理得怎么样了？街道很安静，没有核武器摧毁他们，我们所做的一切就是转移数百万人，向他们提供他们需要的东西。进展如何？坦率地说，事情一点也不顺利。\n旧的CD/FEMA疏散计划很像手机中的GPS路由算法，它让你额外转七个弯，在100英里的旅程中节省0.3英里。如果他们能将5000万人从辐射较多的地方转移到辐射较少(但仍有辐射)的地方，那么如果他们真的到达目的地，就会多出几千人存活下来。那之后30天呢？这就是民防计划停止的地方，所以那些现在离家几英里远，想必仍在死于辐射中毒的人，在30天后，完全是独自一人。是啊，对。\n我之所以告诉你这些，是因为昨天疾控中心和联邦应急管理局宣布他们正在为美国制定重返工作岗位的计划。这听起来是不是开始有点耳熟了？\n我不是说联邦应急管理局/疾控中心的计划不好。我简直不知道他们的计划。但如果非要我打赌的话，我会说这个计划不是很好。它不是很好的原因是因为-就像旧的CD撤离计划一样-它从一个根本上不好的想法开始，在这种情况下就是“我们如何在6月1日之前让经济启动和运行，同时杀死最少的人？”\n他们不会说这是目标，但这是目标，因为这是特朗普总统的目标。\nCDC和FEMA甚至不会在这一点上公开计划，如果他们不是被白宫推动的话。\n所以他们的目标是错误的。它可能应该是“我们如何最终以最小的生命损失回到工作岗位？”他们甚至可能会说这就是目标。但我们都知道，真正的目标是“我们如何在6月1日之前恢复工作，并将生命损失降至最低？”\n这两个目标之间的差异可能在3万到5万死亡人数之间，这些人将会死亡，所以唐纳德·特朗普有希望再次当选。\n在1979年与联邦应急管理局的会议上，我提出了一些问题，我认为这些问题切中了TMI危机管理问题的核心。他们不喜欢我的问题。他们一点也不喜欢我问问题。这就是他们开始在会议桌上敲打西点军校班级戒指的时候。\n对于1979年联邦应急管理局的精英们来说，我是个朋克。但我是为美国总统工作的朋克。吉米·卡特总统本人毕业于美国海军学院，拥有核工程研究生学位。吉米·卡特不是朋克，所以联邦应急管理局的人必须把我当回事。\n所以他们在会议桌上敲了敲他们的班级戒指，让我知道他们是成年人，而我是个朋克。但事实最终变得清晰起来，他们几乎不知道实际该做什么，主要是希望GPU说的是实话，核事故将在几周内结束，生活将恢复正常。这听起来是不是有点耳熟？\n100多亿美元和41年后，GPU破产和死亡，而TMI仍然需要花费金钱来修复。\n适用于冠状病毒，这意味着我们在6月1日之前不能回去工作了。\n在这一点上，我本打算继续我在核管理委员会的冒险，这让联邦应急管理局看起来像鹰式童子军。但是这已经太长了，所以这将是我的下一个专栏。", "note_en": "Forty-one years ago this summer I was a young investigator working in Harrisburg, Pennsylvania and Washington, DC for the President’s Commission on the Accident at Three Mile Island, a big federal investigation chaired by Dartmouth Professor  John Kemeny, who is best known as the father of the BASIC programming language. I learned a lot that summer and fall not only about nuclear accidents but about how governments and industries respond to crises. Some of those lessons apply to the current COVID-19 pandemic, which is also being poorly managed. This may surprise you (that 41-year-old lessons can still apply) but governments, especially, change at a glacial pace.\n The two federal agencies with which I mainly dealt were the Federal Emergency Management Agency ( FEMA) and the Nuclear Regulatory Commission ( NRC). Both agencies had not long before gone through rebranding efforts so nearly all of the people I met had started their careers under the old brands — Civil Defense and the Atomic Energy Commission. These earlier identities are key to this story.\n If you don’t remember Civil Defense, it was the agency charged with planning what to do during World War III — a thermonuclear war that would have killed millions. Civil Defense built bomb shelters all over the country in the basements of public buildings, equipping them with survival supplies. Civil Defense ran  weekly air raid tests where huge sirens could be heard all over town. Civil Defense taught little kids like me to hide under our school desks in hopes that would save us in case the nukes ever dropped.\n But the nukes never dropped and eventually Civil Defense began to look less and less crucial to U.S. policy. Understand we were still in the Cold War. The Berlin Wall still stood and Ronald Reagan wasn’t even running for President yet. But things were winding-down a bit, so it was decided that Civil Defense would be remade into FEMA and take on responsibility for other kinds of disasters like Hurricanes, tornadoes, and, well, nuclear accidents. Three Mile Island was their first one of those.\n It didn’t take long for me to realize that the Civil Defense folks I was meeting with (everyone was a man) both missed the old days of sparring with the Russkies and they were very uncertain how to handle these new kinds of emergencies like Three Mile Island, which we called TMI. The company that owned TMI, General Public Utilities, or GPU, was saying the plant was their baby, that the accident was all under control, and they’d be back up and running in no time at all. It was a complete lie of course, but FEMA didn’t know that because FEMA didn’t know much of anything.\n  FEMA: “We’re monitoring the situation and supporting GPU, which seems to be doing a very good job.”\n In one sense it is hard to fault FEMA because they didn’t know what they didn’t know. But we  can fault them on a kind of structural level for deferring to GPU. We see this a lot in regulatory bureaucracies. If someone else is going to grab responsibility for that huge and probably un-winnable crisis — that steaming pile of shit — heck, let them. Stand aside and watch the dummies fail. That’s what FEMA did initially at TMI. It’s a good way to cover your ass, but not at all a way to solve an actual crisis or to help your country. FEMA wasn’t doing its job.\n FEMA had to learn this same lesson again for Hurricane Katrina and then again for Hurricane Maria –two more huge disasters they were slow to enter.\n Here is a point where we might ask what  was FEMA good at back in 1979? What did they see as their real reason for existing? I quickly learned that FEMA was really good at making maps and studying prevailing winds. They saw their true function as planning for a nuclear attack with the goal of minimizing loss of life in those first 30 days. Toward that end FEMA (as Civil Defense) had created and continually updated elaborate plans for moving large groups of people shortly after an attack. They’d leave the dead and move the living to places where they had calculated there would be less nuclear fallout driven by the wind.\n Theirs’ was a noble 30-year effort that resulted in ever more detailed and complex plans that diverted further and further from reality as the years passed. By 1979, FEMA’s plan — just for the northeast states — was to move more than 50 million people over the 72 hours following a nuclear attack — an attack that would presumably have also destroyed most infrastructure.\n Look at this in the context of the current COVID-19 crisis. In the current case we aren’t being asked to move, we’re being asked to  not move, which is way simpler. Actual movement is limited to medical cases, personnel, and supplies. How are we doing with that? The streets are quiet, no nukes have destroyed them, and all we are trying to do is move a couple million people around and supply them with what they need. How is that going? It’s not going well at all, frankly.\n  The old CD/FEMA evacuation plan was a lot like that GPS routing algorithm in your phone that has you make seven extra turns to save 0.3 miles on a 100-mile trip. IF they could move 50 million people from where there was more fallout to where there was a little less fallout (but still fallout) then a few thousand more people were calculated to survive  if they actually made it to their destinations. And 30 days after that? That’s where the Civil Defense plan stopped, so people who were now miles away from their homes and presumably still dying of radiation poisoning were, after 30 days, completely on their own. Yeah, right.\n I’m telling you this because yesterday the CDC and FEMA announced they are working on a  back-to-work plan for America. Is this starting to sound familiar?\n I’m not saying the FEMA/CDC plan is bad. I simply don’t know their plan. But if I had to bet I’d say the plan isn’t very good. And the reason it isn’t very good is because — just like the old CD evacuation plan — it is starting with a fundamentally bad idea, which in this case is “how do we get the economy up and running by June 1 while killing the least people?”\n They won’t say that’s the goal, but that  is the goal because it is President Trump’s goal.\n The CDC and FEMA wouldn’t be even going public with a plan at this point if they weren’t being pushed into it by the White House.\n So their goal is wrong. It probably should be “how do we eventually get back to work with minimal loss of life?” They may even say that’s the goal. But we all know the real goal is “how do we get back to work by June 1 with minimal loss of life?”\n The difference between those two goals is probably somewhere between 30,000 and 50,000 dead people — people who will have died so Donald Trump has a hope of being re-elected.\n In my meetings with FEMA back in 1979, I asked questions that, I thought, got to the heart of the TMI crisis management problem. They didn’t like my questions. They didn’t like that I was asking questions at all. And that’s when they would start tapping their West Point class rings on the conference table.\n To the fine men of FEMA in 1979, I was a punk. But I was a punk working for the President of the United States. And that President, Jimmy Carter, was himself a graduate of the U.S. Naval Academy and had a post-graduate degree in nuclear engineering. Jimmy Carter was no punk, so the FEMA guys had to take me seriously.\n  So they tapped their class rings on the conference table to let me know they were the adults and I was a punk. But the truth eventually became clear that they had little idea what actually to do and were mainly hoping GPU was telling the truth, that the nuclear accident would be over in a couple of weeks, and that life would get back to normal. Does this sound somewhat familiar?\n $10+ billion and 41 years later, GPU is bankrupt and dead and TMI is still costing money to fix.\n Applied to COVID-19 that means we won’t be back to work by June 1.\n At this point, I had planned to move on to my adventures with the Nuclear Regulatory Commission, which made FEMA look like Eagle Scouts. But this is too long already, so that will be my next column.", "posttime": "2020-05-05 19:41:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,冠状病毒,island,管理局,fema", "title": "三里岛冠状病毒的教训：联邦应急管理局和我", "title_en": "Three Mile Island Lessons for Covid-19: FEMA and Me", "transed": 1, "url": "https://www.cringely.com/2020/04/15/three-mile-island-lessons-for-covid-19-fema-and-me/", "via": "", "real_tags": ["病毒", "冠状病毒", "island", "管理局", "fema"]}, {"category": "", "categoryclass": "", "imagename": "38cc5160afd1515105f2898de548cbd3.png", "infoid": 1000734, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Expensify在很多方面都有不同寻常的技术堆栈。例如，我们不在内部使用DNS-只是配置管理的/etc/hosts文件-它工作得很好。类似地，我们只有限地使用AWS-而不是托管我们自己的Web和数据库层硬件-它工作得很好。但最令人惊讶的是，我们没有使用MySQL或Postgres-而是使用SQLite-它工作得非常好。\n诚然，它本身并不是SQLite。我们已经将它包装在一个名为Bedock的自定义分布式事务层中，该层是开源的，可以在这里获得：www.Bedckdb.com。它不仅是我们核心数据库背后的主力，而且还为我们的任务关键型作业队列提供动力，并提供一个本地托管的复制缓存层。功能越重要，它对Bedrock的依赖就越大。\n因此，考虑到2017年的爆炸性增长，升级驱动基岩的服务器一直是当务之急--同时升级基岩(在不可思议的SQLite团队和SQLite本身的帮助下)，以利用所有这些硬件。为此，我们即将推出全新的一代自托管硬件，其基本规格如下：\n这是一个庞然大物的服务器，几乎是在现货Linux内核上运行的最大的服务器(没有进入“超级计算机”领域)，我们正在得到一大批这样的服务器。但仅有硬件是不够的。需要明确的是，以上规格对于大多数数据库来说是毫无意义的，因为几乎没有任何可伸缩的东西可以很好地处理这种硬件-而且几乎没有人尝试。\n传统的智慧是，你应该总是“向外”而不是“向上”，这意味着拥有大量的小服务器比相对较少的大型服务器更好。大多数公司会将他们的数据“分割”到单独的服务器中，比如在每台服务器上放置1000名客户-然后在客户登录时只需将每个客户路由到正确的服务器即可。这种设计对许多应用程序都非常有效，这意味着你永远不需要学习如何管理大型数据库-只需要很多小型数据库。\nExexpsify有点不同，因为没有分片-也没有明确的“断层线”来做这件事。“每一个用户都可以与其他每个用户分担费用，无论他们在哪里工作。”这是一个关键功能，使我们能够为管理数百甚至数千客户的大型会计师事务所提供如此好的支持：当一家公司与一家公司竞争时，我们希望让该公司访问该公司的数据，而不需要将公司迁移到会计师事务所已经在使用的同一服务器上。(这是一个关键功能，使我们能够为管理数百甚至数千客户的大型会计师事务所提供如此好的支持：当一家公司与一家公司竞争时，我们希望让该公司访问该公司的数据，而不需要将该公司迁移到该会计师事务所已经在使用的同一服务器上。\n换句话说，作为一名会计师，你的Expensify“收件箱”向你展示了你需要同时在所有客户身上做的所有事情，而不需要从一个客户“切换”到另一个客户，看看是否需要为每个客户做什么。当然，即使你进行了分片，也有其他方法可以做到这一点。但是，由于没有分片，这以及其他一系列类似的多客户处理变得超级容易。\n显然，SQLite从来不是为做这样的事情而设计的。但这并不能改变这样一个事实，即它做得非常好，尽管SQLite多年来应我们的要求做了一些修改(我们是SQLite联盟非常热情的赞助商，他们给了我们很大的帮助)。这些修改是开源的，任何人都可以使用(只要问他们，我相信他们会把你联系起来)，而且基本上不在本文的讨论范围内，但包括(如果我都记得的话)：\n禁用POSIX建议锁。这会阻止您在数据库运行时从外部进程(例如，从命令行工具)访问同一数据库，但这对于我们的使用是可以接受的。\n禁用malloc()全局锁(我不记得为什么会有这样的锁，但对于我们的情况显然不需要)。\n换句话说，SQLite的核心设计非常准确。我认为人们没有意识到它是一个多么不可思议的工具。相反，优化系统性能的大部分努力归结为优化BIOS和内核功率设置，以消除无关的内存访问(例如，禁用预取)，并防止CPU自行节流以节省电力。\n人们普遍认为EC2比托管你自己的硬件更快、更便宜、更容易。也许我是老派，但我从来都不完全认同这个观点。你在EC2服务器上可能得到的最好价格是预付3年合约的一年，但你在第一天支付的价格仍然等于硬件成本。因为想想看：亚马逊不会在你身上冒险，所以他们不会为你购买硬件，除非他们预付了钱，否则他们不会为你购买硬件，因为亚马逊不会在你身上冒险，所以他们不会为你购买硬件，除非他们预付了钱，否则他们不会为你购买硬件，因为亚马逊不会在你身上冒险，所以他们不会为你购买硬件，除非他们预先付款。他们相信他们会得到很多倍的回报。因此，对于同样的硬件，你拿出了同样的现金，除了不是得到5年的稳定使用-你需要再支付同样的钱5次(因为与手机不同，服务器硬件在3年后不会变成南瓜)。EEC2的溢价令人震惊-可能是实际硬件成本的3-10倍-如果你这么看重便利性，这是可以接受的。但鲜为人知的是，它也会带来巨大的性能损失。\n在撰写本文时，您可以买到的最大的ec2实例是具有128vCPU和4TB内存的3x1e.32xLarge。它的价格为每小时26.688美元，即每台服务器每年233K美元。)(如果您承诺使用3年，并预付1年，则可以“仅”花35万美元购买3年。)以下是该服务器与您可以托管的服务器的比较结果，预付成本和持续成本都很低：“只需”35万美元。(如果您承诺购买3年，并预付1年的费用，则可以“仅”花35万美元购买3年的服务器。)下面是该服务器与您可以托管的服务器的比较结果，前者的预付成本和持续成本都只有很小的一部分：\n纵轴显示每秒查询的总数，横轴显示获取该数据点所使用的线程数。对于每个线程计数配置(例如，一个线程为100s，两个线程为100s，等等)，测试运行100s，并使用最快的单个秒作为结果。(这一点很重要，因为CPU缓存“预热”可能需要一段时间，这会过滤掉人为缓慢的样本。)完整的性能测试可以在GitHub上找到。(这很重要，因为CPU缓存需要一段时间才能“预热”，这会过滤掉人为缓慢的样本。)-完整的性能测试可以在GitHub上找到。(这一点很重要，因为CPU缓存需要一段时间才能“预热”，这会过滤掉人为缓慢的样本。)。\n查询本身只是对随机整数的10B行(447 GB)两列数据库中随机放置的10行的范围求和，其中一行已编制索引，另一行未编制索引。*这意味着测试已完全缓存在RAM中，而数据库在测试之前已预缓存。*在此测试期间不执行写入，只执行读取操作。*每个线程都支持NUMA，这意味着其所有本地内存访问都在本地内存节点内完成，数据库本身在NUMA节点之间拆分(尽管与预期相反，NUMA感知不会。\n橙色线条显示EC2机器的总聚合性能，上限约为每秒150万次查询。蓝线显示在“裸机”机器上进行的相同测试，每秒查询次数超过4M次，并且在测试期间不断攀升。(出于测试目的，我只关心192个线程，所以我不担心线程数会更高。)红线显示的是同样的测试，只不过是30B的行表(1.3TB)--比裸机的物理RAM还大。\n首先，哇。这是一吨的马力。一台服务器每秒进行400万次查询是不容小觑的，即使认识到这是一个很难测试的人工查询。)(如果你测试“SELECT 1”，它每秒会获得大约1.6亿次查询，但这更是人为的。)(如果你测试“SELECT 1”，它每秒会得到大约1.6亿次查询，但这更是人为的。)。\n其次，SQLite的伸缩性令人惊叹，几乎开箱即用。这项测试在添加物理CPU时实现了近乎完美的线性可伸缩性，超线程在释放额外容量方面的效果比我预期的要好得多。\n但第三，wtf与EC2有问题？我真的认为1个vCPU大致等于1个物理CPU，但MAN错了。这一点在这里真正突出显示：\n这是相同的基本图表，但这一次显示了每个线程的平均性能，以及该性能是如何随着线程数量的变化而变化的。蓝线显示的几乎与我预期的一样：当新的物理核心被激活时，每个线程的性能保持稳定(非常明显)，但当我们达到超线程区域时，性能开始下降。事实上，这比我预期的线性程度要高得多，因为测试的设计方式确保每个CPU 87.5%的时间都在访问远程RAM。这意味着这几乎是最糟糕的情况。但这似乎丝毫没有降低测试的性能，看起来英特尔可以做对一些事情，而Purley的新内存架构相当稳固！\n此外，红线显示，即使25%的读取进入磁盘，对总体性能的影响也可以忽略不计。我将此归因于NVMe固态硬盘的疯狂快速访问-同样，远远好于预期。\n但橙色的线条显示，EC2机器上的每个新线程都会对其他线程造成很大的惩罚。首先，这个图表非常明显地显示，128个“虚拟CPU”实际上意味着64个物理CPU+超线程。*这相当令人失望和误导，因为我真的认为每个vCPU都意味着同等的性能。\n然而，更重要的是橙线本身的曲线。当用单行数据库替换100亿行数据库后重新运行测试时，更容易看到这一点，以便从等式中删除内存访问：\n(请原谅参差不齐的数据，这是以每个样本较短的周期运行的，因此噪音较大，但它让人明白了这一点。)\n蓝线显示了添加新线程时裸机上每个线程的QPS，正如您所预期的那样，它获得了高达192个物理核心的完美线性可伸缩性，然后随着超线程开始发挥作用，QPS线性下降。\n红线是EC2的盒子，性能甚至在达到64个物理核心之前就会下降，但在达到64个物理核心之前就会急剧下降。更糟糕的是，这条线的曲线表明它不是内存访问减慢了速度-这是电源节流。*一旦超过64个核心并开始超线程，每个CPU消耗的功率就会上升。但很明显，EC2已经将其配置为某种“平衡”的性能配置文件，这意味着当总功耗变得太高时，CPU的时钟速度会降低-从而限制了CPU的运行速度。但很明显，EC2在达到64个物理核心之前就会降低性能，这意味着当总功耗过高时，CPU的时钟速度会降低，从而限制了。\n这会导致每个线程的性能-计数曲线，在128个线程处趋于平缓的线性下降斜率，因为这是所有128个CPU都在使用的点。“一旦所有CPU都被使用了，线程就会竞争一个插槽-添加更多的线程不会消耗更多的电力(但它是线性的，因为每个新线程都会占用现有线程的时间)。\n事实证明，托管您自己的硬件的一个主要隐藏优势是，它意味着您可以配置BIOS以满足您自己的需求，在我们的特定情况下，这些更改就是一切。\n购买功能强大的服务器价格低得惊人(只要您托管的是您自己的硬件)。\n并不是所有的EC2虚拟CPU都是相同的，而且它们都不像您自己托管的实际CPU那样强大。\n所有这些测试都是在Meltdown和Spectre之前完成的，所以我不确定这项测试的性能会受到什么影响。“我们现在正在进行这些测试，如果有人感兴趣，我会写下来分享结果。”早期迹象显示，性能大约会下降2.5%，但还有更多的工作要做。\n此外，虽然这项测试的重点是读取性能，但我应该提一下SQLite也有出色的写入性能。*默认情况下，SQLite使用数据库级锁定(最小并发)，并且有一个“开箱即用”的选项来使WAL模式获得出色的读取并发性--如此测试所示。但是不太为人所知的是，SQLite有一个分支具有页面锁定，这可以实现出色的并发写入性能。如果您联系SQLite人员，我相信他们会告诉您更多！", "note_en": "Expensify has an unusual technology stack in many ways.  For example, we don’t use DNS internally — just configuration-managed /etc/hosts files — and it works  great.  Similarly, we only make limited use of AWS — instead hosting our own hardware for the web and database layer — and it works  great.  But most surprising of all is that we don’t use MySQL or Postgres — instead using none other than SQLite — and it works  great.\n Granted, it’s not SQLite by itself.  We’ve wrapped it in a custom distributed transaction layer named Bedrock, which is open sourced and available here:  www.bedrockdb.com.  It’s not just the workhorse behind our core database, but also powers our mission-critical  job queue, and provides a locally-hosted  replicated caching layer.  The more important the function, the more it depends on Bedrock.\n Accordingly, given the  explosive growth of 2017, upgrading the servers that power Bedrock has been a top priority — along with upgrading Bedrock (and with the help of incredible the SQLite team, SQLite itself) to take advantage of all that hardware.  To that end we’re just about to roll out an entirely new generation of self-hosted hardware with the following basic specs:\n  This is a monster server, nearly the biggest that is possible to buy that runs on a stock Linux kernel (without getting into “supercomputer” territory), and we’re getting a bunch of them.  But hardware alone isn’t enough.  To be clear, the above specs would be pointless for most databases, as almost nothing scales to handle this kind of hardware well — and almost nobody tries.\n  The traditional wisdom is that you should always build “out” not “up”, meaning it’s better to have a large number of small servers than a relatively small number of large servers.  Most companies will “shard” their data into separate servers, such as to put 1000 customers on each server — and then just route each customer to the right server when they sign in.  That design works super well for many applications, and means you never need to learn how to manage a big database — just a lot of small databases.\n Expensify is a bit different in that there is no sharding — and no clear “faultline” on which to do it.  Every single user can share expenses with every single other user, regardless of where they work.  This is a critical feature that enables us to offer such good support for large accounting firms that manage hundreds or even thousands of clients: when a company takes on a firm, we want to give that firm access to that company’s data, without needing to migrate the company onto the same server the accounting firm is already on.\n Said another way, as an accountant, your Expensify “Inbox” shows you everything you need to do aggregated across all your clients simultaneously, without needing to “switch” from one client to the next to see if anything needs to be done for each.  Sure, there are other ways to do it even if you do shard.  But the lack of sharding makes this, and a bunch of other similar kinds of multi-client processing, super easy.\n  Obviously, SQLite was never designed to do anything like this.  But that doesn’t change the fact that it does this incredibly well, albeit with a few modifications created by SQLite over the years at our request (we are a very enthusiastic sponsor of the  SQLite Consortium, and they’ve been a tremendous help).  The modifications are open source and available to anyone (just ask them and I’m sure they’ll hook you up), and are largely out of scope of this post, but consist of (if I can remember them all):\n Disable Posix advisory locks.  This prevents you from accessing the same database from an external process (eg, from the command line tool) while the database is running, but that is acceptable for our use.\n  Disable the malloc() global lock (I don’t remember why this was there, but apparently not needed for our case)\n In other words, the core design of SQLite was pretty much on point.  I don’t think people realize how incredible a tool it is.  Rather, most of the effort into optimizing the performance of the system came down to optimizing the BIOS and kernel power settings to eliminate extraneous memory access (eg, disable prefetching) and prevent CPUs self-throttling to conserve power.\n  There’s a general conception that EC2 is faster, cheaper, and easier than hosting your own hardware.  Maybe I’m old school, but I’ve never quite subscribed to that notion.  The best price you can possibly get on an EC2 server is to prepay for a year with a 3 year commitment, but the price you still pay on day one is  equal to the cost of the hardware.  Because think of it: Amazon isn’t going to take a chance on you, so they’re not going to buy hardware for you unless they get paid up front, and are confident they’ll get paid back many times more.  So you are out the same amount of cash, for the same hardware, except rather than getting five years of solid use — you need to pay that same amount of money 5 more times (because unlike phones, server hardware doesn’t turn into a pumpkin after 3 years).  EC2 comes at an astonishing premium — perhaps 3-10x the actual hardware cost — which is fine if you value the convenience that much.  But what’s less known is that it also comes at an enormous performance penalty.\n At the time of this writing, the largest EC2 instance you can possibly buy is the x1e.32xlarge, with 128 “vCPUs” and 4TB of RAM.  It costs $26.688 per hour, meaning $233K/yr — for a single server.  (If you commit to 3 years and prepay for 1, you can get it for “only” $350K for 3 years.)  Here’s how that server compares to what you can host yourself at a fraction of both the up front and ongoing cost:\n  The vertical axis shows the total number of Queries Per Second, and the horizontal axis shows how many threads are being used to get that datapoint.  The test is run for 100s for each thread count configuration (eg, 100s with 1 thread, 100s with 2 threads, etc), and the fastest individual second is used as the result.  (This is important as it can take a while for the the CPU caches to “warm up” and this filters out the artificially slow samples.)  The full performance test can be found on  GitHub here.\n The query itself just sums a range of 10 rows randomly located inside 10B row (447GB) two column database of random integers, one of which is indexed and the other not.  This means that the test is fully cached in RAM, and the database is precached prior to the test.  No writes are done during this test, only reads.  Each thread is NUMA aware, meaning all its local memory access is done inside a local memory node, and the database itself is split between the NUMA nodes (though contrary to expectation, NUMA awareness doesn’t actually matter much for this test).  Everything is done on a stock 16.04 Ubuntu install.\n The orange line shows total aggregate performance of the EC2 box capping out around 1.5M queries per second.  The blue line shows the same test on a “bare metal” machine, which gets upwards of 4M queries per second and keeps on climbing for the duration of the test.  (I only care about 192 threads for the purpose of my test so I didn’t worry about going higher.)  The red line shows the same test, but for a 30B row table (1.3TB) — larger than the physical RAM of the bare metal machine.\n  First, wow.  This is a ton of horsepower.  4M queries per second from a single server is nothing to sneeze at, even recognizing that it’s a pretty artificial query to be testing.  (If you test “SELECT 1;” it gets about 160M queries per second, but that’s even more artificial.)\n Second, SQLite scales amazingly, almost out of the box.  This test achieves almost perfect linear scalability as we add physical CPUs, and hyperthreading works much better than I expected in eeking out extra capacity after that.\n But third, wtf is wrong with EC2?  I really assumed 1 vCPU was roughly equal to 1 physical CPU, but man is that wrong.  That is really highlighted here:\n  This is the same basic chart, but this time showing the average performance of each thread, and how that performance changes with thread count.  The blue line shows pretty much what I’d expect: per-thread performance stays stable (remarkably so) as new physical cores are activated, but starts to drop as we hit hyperthreading territory.  In fact, this is scaling far more linearly than I expected, as the test is designed in such a way to ensure each CPU is accessing remote RAM 87.5% of the time.  This means it’s pretty much a worst-case scenario in terms of NUMA access, but it doesn’t seem to degrade the performance of the test much at all.  Looks like Intel can do something right, and Purley’s new memory architecture is pretty solid!\n Additionally, the red line shows that even when 25% of the reads go to disk, it has a negligible impact on total performance.  I attribute this to the crazy fast access of NVME SSD drives — again, much better than expected.\n But the orange line shows that each new thread on the EC2 box comes at a substantial penalty to the others.  First, this chart shows pretty obviously that 128 “virtual CPUs” actually means 64 physical CPUs + hyperthreading.  That’s pretty disappointing and misleading, as I really assumed every vCPU was implied to be equal performance.\n More importantly, however, is the curve of that orange line itself.  This is easier to see when the test is re-run after replacing the 10-billion row database with a single-row database, to remove memory access from the equation:\n  (Please excuse the jagged data, this was run with a shorter period per sample and thus is a bit more noisy, but it gets the point across.)\n The blue line shows QPS per thread on the bare machine as new threads are added, and as you would expect, it gets perfect linear scalability up to 192 physical cores, and then linearly drops off as hyperthreading comes into play.\n The red line is the EC2 box, and performance degrades even before hitting 64 physical cores, but then drops off precipitously after that.  Even worse, the curve of that line signals that it’s not memory access slowing things down — it’s power throttling.  Once you get over 64 cores and start hyperthreading, the power consumed by each CPU goes up.  But clearly EC2 has configured things in some kind of “balanced” performance profile, which means the clock speed of the CPU is reduced when the total power consumption gets too high — thereby limiting power consumption at the expense of performance.\n This results in a curved performance-per-thread-count profile, which levels off into a linear downward slope at 128 threads because that’s the point at which all the 128 CPUs are in use.  Once all CPUs are used, threads just compete for a slot — and adding more threads doesn’t consume any more power (but it’s linear because each new thread takes time away from the existing threads).\n It turns out a major hidden advantage of hosting your own hardware is it means you can configure the BIOS to suit your own needs, and in our particular case those changes were everything.\n   Crazy powerful servers are surprisingly cheap to buy (so long as you are hosting your own hardware)\n   Not all EC2 virtual CPUs are the same, and none of them are remotely as powerful as an actual CPU you host yourself\n  All this testing was done before Meltdown and Spectre, so I’m not sure how the performance of this test will be impacted.  We’re running those tests now, and if anybody is interested, I’ll write up and share the results.  Early indications suggest about a 2.5% reduction in performance, but more work remains to be done.\n Additionally, though this test was focused on read performance, I should mention that SQLite has fantastic write performance as well.  By default SQLite uses database-level locking (minimal concurrency), and there is an “out of the box” option to enable WAL mode to get fantastic read concurrency — as shown by this test.  But lesser known is that there is a branch of SQLite that has  page locking, which enables for fantastic concurrent write performance.  Reach out to the SQLite folks and I’m sure they’ll tell you more!", "posttime": "2020-05-05 19:38:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sqlite,服务器,single,性能,performance", "title": "在单台服务器上将SQLite扩展到4M QPS(EC2与裸机)", "title_en": "Scaling SQLite to 4M QPS on a Single Server (EC2 vs. Bare Metal)", "transed": 1, "url": "https://blog.expensify.com/2018/01/08/scaling-sqlite-to-4m-qps-on-a-single-server/", "via": "", "real_tags": ["sqlite", "服务器", "single", "性能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000733, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "巴尔的摩警方备受争议的空中侦察机周五开始飞行，记录城市中每个人在白天的行动。这是这个项目在巴尔的摩的第二次生命。它于2016年在当时的专员凯文·戴维斯(Kevin Davis)的领导下首次秘密运营。现在，它变得更加公开了，但争论仍然存在：这是侵犯隐私还是有效的打击犯罪的工具？你不能真正看到这一点，但私人资助的侦察机正在飞行。这是一种侵犯隐私的行为，还是一种有效的打击犯罪的工具？你不能真正看到这一点，但这架私人资助的侦察机正在飞行。该项目名为空中调查研究(AIR)试点项目，由俄亥俄州一家公司运营，费用由德克萨斯州的一位亿万富翁支付。周五下午，警察局长迈克尔·哈里森告诉11News I-Team，他正在控制人们的期望。我对此没有什么期望，我会持开放态度，让数据来说明问题。与其说我有什么看法或期望，不如说我不想抱太大希望，也不想让任何人抱太大希望。但哈里森说，让我们把这看作是一项实验，该项目将试行6个月。该合同将监视的重点缩小到枪击、凶杀、抢劫和劫车，图像储存45天，只能用于刑事调查。为了评估该项目的有效性，将进行一项独立审计。该项目的总预算为3690667美元，全部由私人支付。美国公民自由联盟(American Civil Liberties Union)在维持该项目的诉讼中败诉，但该组织已经提起上诉。马里兰州ACLU的律师大卫·罗卡说，这是美国历史上对美国城市实施的最全面的监控。(注：美国公民自由联盟(ACLU)律师大卫·罗卡(David Rocah)表示，该项目的总预算为3690667美元，全部由私人支付。)美国公民自由联盟(American Civil Liberties Union)在维持该项目的诉讼中败诉，但该组织已经上诉。这是美国历史上对美国城市实施的最全面的监控。这实际上相当于让一名警察在居民每次出门时都跟着他们，如果这发生在现实生活中，我们所有人都会理解这样做对隐私的巨大影响。哈里森认为没有隐私问题。在公共街道上，人行道上没有隐私可言。哈里森说，它不能在私人场所或墙外拍摄，而且当你在户外时，也不能期望隐私。美国公民自由联盟表示，联邦上诉法院已经同意加快上诉速度，争论可能会在今年夏天进行听证。||阅读：BPD侦察机专业服务协议备忘录||", "note_en": "The controversial aerial surveillance planes for Baltimore police started flying Friday, recording movements of everyone in the city during the day.This is the second life of this program in Baltimore. It first operated in secret in 2016 under then-Commissioner Kevin Davis. Now, it&#39;s more public, but the debate remains the same: Is it an invasion of privacy or an effective crime-fighting tool?You can&#39;t really see it, but the privately funded surveillance plane is flying. It&#39;s called the Aerial Investigation Research (AIR) Pilot Program, and it&#39;s operated by an Ohio-based company and is paid for by a Texas billionaire.Police Commissioner Michael Harrison told the 11 News I-Team Friday afternoon that he&#39;s keeping expectations in check.&#34;I don&#39;t have an expectation, and I am going into this with an open mind and let the data speak for itself. And rather than have an opinion or an expectation, I don&#39;t want to get my hopes up or anybody&#39;s hopes up. But let&#39;s look at this as an experiment,&#34; Harrison said.The program will operate on a trial basis for six months. The contract narrows the focus of the surveillance to shootings, homicides, robberies and carjackings.Images are stored for 45 days and can be used only for criminal investigation. An independent audit will be done to evaluate the program&#39;s effectiveness.The total budget for the program is $3,690,667 -- all of it paid for privately.The American Civil Liberties Union lost a court battle to keep the program grounded, but the organization has already appealed.&#34;It&#39;s the most comprehensive surveillance ever imposed on an American city in the history of the country,&#34; ACLU of Maryland attorney David Rocah said. &#34;It&#39;s the virtual equivalent of having a police officer follow a resident every time they walk out the door, and if that happened in real life, all of us would understand the huge privacy implications in doing that.&#34;Harrison sees no privacy concern.There is no expectation of privacy on a public street, a sidewalk. It can&#39;t film inside private places or beyond walls, and while you are outside, there is no expectation of privacy,&#34; Harrison said.The ACLU said the federal appeals court has agreed to expedite the appeal, and arguments could be heard over the summer.|| Read: BPD surveillance plane professional service agreement memo ||", "posttime": "2020-05-05 19:27:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "巴尔的摩,plane,项目,surveillance", "title": "一架侦察机开始在巴尔的摩上空飞行，记录每个人的行动", "title_en": "Surveillance plane starts flying over Baltimore, recording everyone's movements", "transed": 1, "url": "https://www.wbaltv.com/article/baltimore-police-surveillance-plane-starts-flying-recording-everyones-movements/32346318", "via": "", "real_tags": ["巴尔的摩", "plane", "项目"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000732, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "NVIDIA在2006年发布的统一特斯拉架构解决了日益复杂的问题。在G80模具中，层与层之间没有更多的区别。流多处理器(SM)取代了所有以前的单元，这要归功于它能够无差别地运行顶点、碎片和几何体内核(kernel&#34；kernel)。根据流水线的需要，通过交换每个SM运行的内核自动实现负载平衡。我们几乎从NV30/NV40中丢弃了整个着色器架构，并使用新的通用处理器架构(SIMT)从头开始创建了一个新的着色器架构，这也引入了新的处理器设计方法。\n不再支持SIMD，着色器单元现在每个时钟可以处理一个整数或一个浮点32指令。SM接收以32条为一组的称为经纱的线程。理想情况下，WARP中的所有线程将同时执行相同的指令，只是针对不同的数据(因此称为SIMT)。多线程指令单元(MT)负责启用/禁用WARP中的线程，以防它们的指令指针(IP)聚合/发散。这里有两个SFU单元来帮助进行复杂的数学计算，如平方根反比、sin、cos、exp和rcp。这些单元也能够在每个时钟执行一条指令，但是因为它们只有两条，所以WARP执行速度除以4。Float64没有硬件支持，它是由软件完成的，极大地影响了执行速度。当SM可以通过始终具有可调度的Warps来隐藏内存延迟时，而且当Warp中的线程没有分歧时(控制流将它们保持在相同的指令路径上)，SM将以其最大潜力执行。4KiB寄存器文件(RF)是存储线程状态的位置。消耗太多堆栈的线程会减少可以保持运行的线程数量，并会降低性能。特斯拉的旗舰芯片是90纳米的G80，在GeForce 8800GTX中具有特色。两个SMS与纹理单元和TeX L1高速缓存一起捆绑到纹理处理器集群(TPC)中。在8TPC的情况下，G80公布了128个内核，生成了345.6个Gflop[3]。8800GTX卡在当时非常受欢迎，收到了极好的评论，受到了负担得起的客户的喜爱。它是如此强大，以至于在发布13个月后，它仍然是市场上速度最快的GPU之一。与特斯拉一起，NVIDIA推出了计算统一设备架构(CUDA)C编程语言，这是C99的超集。这让GPGPU爱好者松了一口气，他们欢迎用GLSL着色器和纹理欺骗GPU的另一种选择。尽管本节广泛关注SM，但它只是系统的一半。SM需要提供驻留在GPU存储器中的指令和数据。为了避免停滞，GPU不会像CPU那样试图避免带有大量缓存和投机的内存旅行。GPU通过使内存总线饱和来满足数以千计的线程I/O来实现延迟。为此，像G80这样的芯片通过六条双向DRAM存储线实现了高内存吞吐量。\n特斯拉是一个冒险的举动，结果证明是一件非常好的事情。它非常成功，在接下来的二十年里成为了NVIDIA图形处理器的基础。虽然从那时起我们确实进行了重大的架构更改(费米是一个重大的系统架构更改，Maxwell是处理器设计的另一个重大更改)，但我们在G80中引入的基本结构至今仍在很大程度上保留着[Pascal]。\n2010年，NVIDIA发布了基于其全新费米架构的GF100。他们最新芯片的内部结构在费米白皮书中有大量描述[4]。执行模型仍然围绕SM上调度的32个线程的偏差。多亏了40纳米的制程，NVIDIA将所有东西都翻了一番/翻了四番。SM现在可以同时调度两个半翘曲(16个线程)，这要归功于16个CUDA内核的两个阵列。由于每个内核每个时钟执行一条指令，因此SM可以在每个时钟有效地引退一条WARP指令(容量是Tesla SM的4倍)。特种部队的数量也有所增加，尽管没有那么多，因为运力只增加了一倍。可以推断，这些类型的指令并没有被广泛使用。对Float64有半硬件支持，其中操作由两个CUDA内核组合而成。GF100可以在单个时钟内进行整数乘法运算，这要归功于32位ALU(特斯拉为24位)，并且使用融合乘加(FMA)技术从IEEE 754-1985移动到IEEE 754-2008的Float32流水线具有更好的精度(比特斯拉使用的MAD更精确)。从编程的角度来看，Fermi的统一内存系统允许CUDA C使用C++特性(如对象、虚拟方法和异常)进行扩展。随着纹理单位现在成为SM的一部分，TPC的概念消失了。取而代之的是具有四个SM的图形处理器群集(GPC)。最后但并非最不重要的是，SM\n有传言称，代号为Ampere的下一个架构将于2020年晚些时候宣布。由于英特尔证明了7纳米的冰湖还有小型化的空间，毫无疑问，NVIDIA将利用它进一步缩小其SM，并再次将性能提高一倍。有趣的是，既然现在有三种不同用途的内核，NVIDIA将如何继续发展下去，这将是令人感兴趣的。我们会看到模具完全由张量芯或RT芯组成吗？我很好奇想知道。\n*", "note_en": "Nvidia solved the problem of escalating complexity with its &#34;unified&#34; Tesla architecture, released in 2006.    In the G80 die, there is no more distinction between layers. The Stream Multiprocessor (SM) replaces all previous units thanks to is ability to run vertex, fragment and geometry &#34;kernel&#34; without distinction. The load balancing happens automatically by swapping the &#34;kernel&#34; run by each SM depending on the need of the pipeline.  We pretty much threw out the entire shader architecture from NV30/NV40 and made a new one from scratch with a new general processor architecture (SIMT), that also introduced new processor design methodologies.\n No longer SIMD capable, &#34;shaders units&#34; are now &#34;core&#34; capable of one integer or one float32 instruction per clock. SM receive threads in groups of 32 called warps. Ideally all threads in a warp will execute the same instruction at the same time, only on different data (hence the name SIMT). The Multi-threaded Instruction Unit (MT) takes care of enabling/disabling threads in a warp in case their Instruction Pointer (IP) converge/diverge.    Two SFU units are here to help with complex mathematic calculation such as inverse square root, sin, cos, exp, and rcp. These units are also able to execute one instruction per clock but since there are only two of them, warp execution speed is divided by four. There is no hardware support for float64, it is done in software and greatly affects the execution speed.     A SM will perform at its maximum potential when it can hide memory latency by always having schedulable warps but also when the thread in a warp don&#39;t diverge (control-flow keeps them on the same instruction path). The 4KiB Register File (RF) is where thread states are stored. Threads consuming too much stack reduce how many of them can be kept in-flight and will degrade performance.    The Tesla flagship die was the 90nm based G80, featured in the GeForce 8800 GTX. Two SMs are bundled into a Texture Processor Cluster (TPC) along with a Texture Unit and Tex L1 cache. With 8 TPC, the G80 advertised 128 cores generating 345.6 Gflops  [3]. The 8800 GTX card was immensely popular in its time, receiving stellar reviews and beloved by customers who could afford it. It was such a tour-de-force that thirteen months after its release, it remained one of the fastest GPU on the market.        Along with Tesla, Nvidia introduced the Compute Unified Device Architecture (CUDA) C programming language, a super-set of C99. It was a relief for GPGPU enthusiasts who welcomed an alternative to cheating the GPU with GLSL shaders and textures.    Even though this section focuses extensively on the SM, it is only one half of the system. The SM needs to be fed instructions and data which resides in the GPU memory. To avoid stalling, GPUs don&#39;t try to avoid memory trips with a lot of cache and speculation like CPUs do. GPUs embrace latency by saturating the memory bus to satisfy thousands of threads I/O. To this effect a die like the G80 implements a high memory throughput via six bi-directional DRAM memory lines.\n   Tesla was a risky move which turned out to be a very Good Thing. It was so successful that it became the foundation of NVidia GPUs for the next two decades. While we’ve definitely made major architectural changes since then (Fermi was a major system architecture change and Maxwell was another large change to the processor design), the basic structure that we introduced in G80 is still very much there today [Pascal].\n In 2010, Nvidia released the GF100 based on its brand new Fermi architecture. The internals of their latest chip were abundantly described in the Fermi white-paper  [4].  The execution model still revolves around warps of 32 threads scheduled on a SM. Only thanks to a process of 40nm, NVidia doubled/quadrupled everything. A SM can now schedule two half-warp (16 threads) simultaneously thanks to two arrays of 16 CUDA cores. With each core executing one instruction per clock, a SM has can effective retire one warp instruction per clock (4x the capacity of Tesla SM).  The SFU count was also beefed up although not as much since capacity only doubled. It can be inferred these types of instructions were not widely used.  There is a semi-hardware support for float64 where operations are carried by two CUDA core combined. The GF100 can do an integer multiplication in a single clock thanks to a 32-bit ALU (vs 24-bit in Tesla) and has better accuracy with a float32 pipeline moving from IEEE 754-1985 to IEEE 754-2008 with Fused Multiply-Add (FMA) (more accurate than MAD used in Tesla).  From a programming perspective, the unified memory system of Fermi allowed CUDA C to be augmented with C++ features such as object, virtual methods, and exceptions.   With the Texture Units now part of the SM, the concept of TPC disappeared. It is replaced with the Graphics Processor Clusters (GPC) which features four SMs.Last but not least, the SM is gifted with a Polymorph Engine which takes care of vertex fetching, viewport transform, and tessellation. The flagship card, the GeForce GTX 480 featured a GF100 advertising 512 cores and 1,345 Gflops  [5].\n   In 2012 Nvidia released the Kepler architecture named after the astrologer best known for his laws of planetary motion. As usual an inside peek was allowed by the GK104 whitepaper  [6].   With Kepler, Nvidia drastically improved the energy efficiency of their die by lowering the clock and unifying the core clock with the card clock (they used to be clocked at 2x).  These changes should have resulted in lower performance. However, thanks to a process halved down to 28nm and the removal of the hardware scheduler in favor of software, Nvidia was able to not only pack more SMs but also improve their design.  The Next Generation Streaming Multiprocessor (SMX) is a monster where pretty much everything has been doubled or tripled.  With four warp scheduler able to process a whole warp in one clock (compared to Fermi&#39;s half-warp design) the SMX now contains 196 cores. Each scheduler has a double dispatch to execute a second instruction in a warp if it is independent from the instruction currently executed. This double scheduling may not always doable since one column of 32 cores is shared by two dispatchs.   This approach made the scheduling logic more complicated (we will revisit this) but with up to six warp instruction per clock a SMX provided 2x the performance of a Fermi SM.  The flagship NVIDIA GeForce GTX 680 card with a GK104 die and 8 SMX advertised 1536 cores to reach 3,250 Gflops  [7]. The details of the die become so intricate that the labels in the drawing must be removed.        Notice how a completely revamped memory sub-systems running at a whooping 6Ghz allowed to reduce the number of memory controllers from six to four.\n   In 2014 Nvidia release Maxwell, its 10th generation GPU. As the GM107 whitepaper  [8] explains, the soul of the first generation was &#34;Extreme power efficiency and Exceptionalperformance per watt consumed&#34;. The consumer target was &#34;power-limited environments like notebooks and small form factor (SFF) PC&#34;.  The major decision was to drop the Kepler approach of having a non-power-of-two CUDA cores per SM where some cores are shared and go back to running half-warp. For the first time in the series, the SMM features less cores than its predecessor with &#34;only&#34; 128 cores.   Having the core count &#34;aligned with warp size&#34; improved die partitioning which resulted in saved area and power.     The second generation of Maxwell (described in the GM200 whitepaper  [9]) improved performance significantly while preserving the energy efficiency of the first generation.   With a process stagnating at 28nm, Nvidia engineers could not bank on raw miniaturization to improve performance. However, fewer cores per SMM reduced their size which meant many more SMM could be packed on a die. Maxwell Gen2 packs 2x the number of SMM as Kepler with only a 25% increase in die area.     On the list of improvements can also be found a simplified scheduling logic which reduced redundant recomputation of scheduling decisions reduced computation latency to provide a better warp occupancy. Memory clock was also cranked up 15%.  Looking at the Maxwell GM200 block diagram starts to hurt the eyes. But we still do it like the GPU heroes we are. The flagship NVIDIA GeForce GTX 980 Ti card with a GM200 die and 24 SMM advertised 3072 cores to reach 6,060 Gflops  [10].\n    In 2016, Nvidia introduced Pascal. The GP104 whitepaper  [11] gives a impression of &#34;deja-vu&#34; since the Pascal SM looks exactly like the Maxwell SMM. No change in the SM did not mean stagnating performance since the 16nm process allowed to pack more SMs and once again double the Gflops.   The other major improvements was the memory system built around the brand new GDDR5X. Providing 10 Gflops transfer rates thanks to eight memory controllers, the 256-bit memory interface provides 43% more memory bandwidth to reduce warp starvation.  The flagship NVIDIA GeForce GTX 1080 Ti card with a GP102 die and 28 TSM advertised 3584 cores to reach 11,340 Gflops  [12].\n   With the release of Turing in 2018, Nvidia operated its &#34;biggest architectural leap forward in over a decade&#34;  [13]. Not only the &#34;Turing SM&#34; added A.I dedicated Tensor cores, they also gained Raytracing cores. This fragmented design reminds of the Pre-Tesla layered architecture, proving once again that history likes to repeat itself. Besides the new cores, Turing added three major features. First, the CUDA core is now a super-scalar able to execute both integer instruction and float instruction in parallel. If you were around in 1996 this may remind you of the Intel &#34;breakthrough&#34; Pentium architecture.  Second, the new GDDR6X memory sub-system, backed by 16 controllers, can now achieve 14 Gbps.   Last, threads are no longer sharing their Instruction Pointer in a warp. Thanks to Independent Thread Scheduling introduced in Volta each thread has its own IP. As a result, SMs are free to fine schedule threads in a warp without the need to make them converge as soon as possible.   The flagship NVIDIA GeForce GTX 2080 Ti card with a TU102 die and 68 TSM advertised 4352 cores to reach 13,45 Gflops  [14]. No block diagram is provided since it would have looked like a blurry green blob.\n   The next architecture, codenamed Ampere, is rumored to be announced later in 2020. Since Intel proved that there is still room for miniaturization with the 7nm of Ice Lake, there is little doubt Nvidia will leverage it to shrink its SM even more and double performance again.        What will be interesting is to see is how Nvidia keeps on evolving now that there dies have three types of cores serving different purpose. Will we see die entirely made of Tensors cores or RT cores? I am curious to find out.\n       *", "posttime": "2020-05-05 19:12:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nvidia,stream,sm,memory", "title": "NVIDIA Stream多处理器发展史", "title_en": "An History of Nvidia Stream Multiprocessor", "transed": 1, "url": "http://fabiensanglard.net/cuda/index.html", "via": "", "real_tags": ["nvidia", "stream", "sm", "memory"]}, {"category": "", "categoryclass": "", "imagename": "b5d0f1167a86fdbbb8945644fc4c54f6.png", "infoid": 1000731, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "具有系统跟踪功能的Python GOTO。GitHub Gist：即时共享代码、笔记和代码片段。", "note_en": "python goto with system trace function . GitHub Gist: instantly share code, notes, and snippets.", "posttime": "2020-05-05 19:12:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,goto,代码", "title": "Python Goto实现系统跟踪功能(2017)", "title_en": "Python goto implemented with system trace function (2017)", "transed": 1, "url": "https://gist.github.com/georgexsh/ede5163a294ced53c3e2369ccaa392cc", "via": "", "real_tags": ["python", "goto", "代码"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000730, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一项研究显示，全球气温每上升1摄氏度，10亿人要么流离失所，要么被迫忍受难以忍受的高温，气候危机的人类代价将比之前认为的更严重、更广泛、更快。\n这篇论文警告说，在加速排放的最坏情况下，目前居住着世界三分之一人口的地区将在50年内变得与撒哈拉最热的地区一样热。即使在最乐观的前景下，12亿人也将落入人类至少在6000年来蓬勃发展的舒适“气候利基”之外。\n这项研究的作者说，他们对这些发现感到“震惊”和“震惊”，因为他们没有想到我们这个物种会如此脆弱。\n“数字令人瞠目结舌。埃克塞特大学的蒂姆·兰顿(Tim Lenton)说：“我第一次看到它们的时候，真的是看了两眼。”“我之前研究过气候临界点，通常被认为是世界末日。但这更加切中要害。这让威胁变得非常人性化。“。\n这篇发表在“美国国家科学院院刊”上的论文没有将气候变化视为一个物理学或经济学问题，而是研究了它如何影响人类栖息地。\n绝大多数人类一直生活在年平均气温在6摄氏度(43华氏度)到28摄氏度(82华氏度)左右的地区，这对人类健康和食品生产是理想的。但是，由于人为的全球变暖，这一甜蜜点正在转移和缩小，这让更多的人陷入了作者所说的“几乎不适合居住”的极端境地。\n人类之所以特别敏感，是因为我们集中在陆地上--陆地变暖的速度比海洋还快--而且未来的人口增长大多将在本已炎热的非洲和亚洲地区。由于这些人口因素，当全球气温达到3摄氏度(预计到本世纪末)时，人类平均气温将上升7.5摄氏度。\n在这个水平上，世界上大约30%的人口将生活在极端高温中-定义为平均温度为29摄氏度(84华氏度)。在撒哈拉沙漠最炎热的地区以外，这种情况极其罕见，但随着全球气温达到3摄氏度，预计印度将有12亿人，尼日利亚将有4.85亿人，巴基斯坦、印度尼西亚和苏丹各将超过1亿人。\n“我认为公平地说，平均气温超过29摄氏度是不适宜居住的。你必须搬家或适应。但适应是有限度的。如果你有足够的钱和精力，你可以用空调和空运食物，然后你可能就没事了。但对大多数人来说，情况并非如此，“该研究的主要作者之一、瓦格宁根大学的马腾·谢弗教授说。\n谢弗是一名训练有素的生态学家，他说这项研究最初是一次思维实验。他之前曾研究过热带雨林和稀树草原的气候分布，并想知道如果他将同样的方法应用于人类，结果会是什么。“我们知道大多数生物的栖息地都受到温度的限制。例如，企鹅只在冷水中发现，珊瑚只在温暖的水中发现。但我们没想到人类会这么敏感。我们认为自己适应能力很强，因为我们使用衣服、暖气和空调。但事实上，绝大多数人都生活在--而且一直都生活在--这个气候利基环境中，这个环境正在以前所未有的速度移动。“。\n我们被震级震撼了，“他说。“未来50年将发生比过去6000年更多的变化。”\n作者说，他们的发现应该会刺激政策制定者加快减排，共同努力应对移民，因为每一个可以避免的变暖程度都将拯救10亿人，使其免于脱离人类的气候利基。\n另一位作者、南京大学的徐驰表示：“显然，我们需要一种全球性的方式来保护我们的孩子免受预期变化可能引发的潜在巨大社会紧张局势的影响。”", "note_en": "The human cost of the  climate crisis will hit harder, wider and sooner than previously believed, according to a  study that shows a billion people will either be displaced or forced to endure insufferable heat for every additional 1C rise in the global temperature.\n In a worst-case scenario of accelerating emissions, areas currently home to a third of the world’s population will be as hot as the hottest parts of the Sahara within 50 years, the paper warns. Even in the most optimistic outlook, 1.2 billion people will fall outside the comfortable “climate niche” in which humans have thrived for at least 6,000 years.\n The authors of the study said they were “floored” and “blown away” by the findings because they had not expected our species to be so vulnerable.\n “The numbers are flabbergasting. I literally did a double take when I first saw them, ” Tim Lenton, of Exeter University, said. “I’ve previously studied climate tipping points, which are usually considered apocalyptic. But this hit home harder. This puts the threat in very human terms.”\n  Instead of looking at climate change as a problem of physics or economics, the paper, published in the Proceedings of the National Academy of Sciences, examines how it affects the human habitat.\n The vast majority of humanity has always lived in regions where the average annual temperatures are around 6C (43F) to 28C (82F), which is ideal for human health and food production. But this sweet spot is shifting and shrinking as a result of manmade global heating, which drops more people into what the authors describe as “near unliveable” extremes.\n Humanity is particularly sensitive because we are concentrated on land – which is warming faster than the oceans – and because most future population growth will be in already hot regions of Africa and Asia. As a result of these demographic factors, the average human will experience a temperature increase of 7.5C when global temperatures reach 3C, which is forecast towards the end of this century.\n At that level, about 30% of the world’s population would live in extreme heat – defined as an average temperature of 29C (84F). These conditions are extremely rare outside the most scorched parts of the Sahara, but with global heating of 3C they are projected to envelop 1.2 billion people in India, 485 million in Nigeria and more than 100 million in each of Pakistan, Indonesia and Sudan.\n   “I think it is fair to say that average temperatures over 29C are unliveable. You’d have to move or adapt. But there are limits to adaptation. If you have enough money and energy, you can use air conditioning and fly in food and then you might be OK. But that is not the case for most people,” said one of the lead authors of the study, Prof Marten Scheffer of Wageningen University.\n An ecologist by training, Scheffer said the study started as a thought-experiment. He had previously studied the climate distribution of rainforests and savanna and wondered what the result would be if he applied the same methodology to humans. “We know that most creatures’ habitats are limited by temperature. For example, penguins are only found in cold water and corals only in warm water. But we did not expect humans to be so sensitive. We think of ourselves as very adaptable because we use clothes, heating and air conditioning. But, in fact, the vast majority of people live – and have always lived – inside a climate niche that is now moving as never before.”\n We were blown away by the magnitude,” he said. “There will be more change in the next 50 years than in the past 6,000 years.”\n The authors said their findings should spur policymakers to accelerate emission cuts and work together to cope with migration because each degree of warming that can be avoided will save a billion people from falling out of humanity’s climate niche.\n “Clearly we will need a global approach to safeguard our children against the potentially enormous social tensions the projected change could invoke,” another of the authors, Xu Chi of Nanjing University, said.", "posttime": "2020-05-05 19:12:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生活,people,人类", "title": "50年内将有10亿人生活在令人难以忍受的炎热中--研究", "title_en": "One billion people will live in insufferable heat within 50 years – study", "transed": 1, "url": "https://www.theguardian.com/environment/2020/may/05/one-billion-people-will-live-in-insufferable-heat-within-50-years-study", "via": "", "real_tags": ["生活", "people", "人类"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000728, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了帮助支持我们的社区在COVID-19期间远程工作，我们将在2020年6月30日之前免费访问ACM在我们的数字图书馆中发布的所有作品。了解更多。\n我们使用饼干，以确保我们给你最好的经验，在我们的网站。\n您的浏览器似乎不支持它们，这会影响网站功能。", "note_en": "To help support our community working remotely during COVID-19, we are making all work published by ACM in our Digital Library freely accessible through June 30, 2020.  Learn more\n   We use cookies to ensure that we give you the best experience on our website.\n  It seems your browser doesn&#39;t support them and this affects the site functionality.", "posttime": "2020-05-05 18:43:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "度量,cost,网站,ensure", "title": "在实践中度量回归测试的成本", "title_en": "Measuring the Cost of Regression Testing in Practice", "transed": 1, "url": "https://dl.acm.org/doi/pdf/10.1145/3106237.3106288", "via": "", "real_tags": ["度量", "cost", "网站", "ensure"]}]