[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1001353, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "啊，是的，所以昨天关于我愚蠢的小RPC负载测试的帖子炸了。有很多关于它的反馈和其他几个相关的帖子。我将尝试回答或以其他方式解决一些问题。\n我不会告诉你，至少现在不会。这实际上无关紧要。我认为您可以用任何语言编写糟糕的服务，也可以用任何语言编写相当不错的服务。然而，当你开始从你的硬件中挤出最后66%的时候，橡胶就会遇到麻烦。\n如果您没有在一个认为主机上CPU利用率达到33%的情况下正常工作的地方工作，那么这可能没有任何意义。我曾经这样做过。这太可怕了。\n通过不告诉你它用的是哪种语言，我设法饿死了一整场关于对话的次要表演，在这场对话中，人们进行了一场全面的语言战争，忘记了他们仍然没有用自己选择的语言完成同样的事情。\n我打赌它可以用这种语言来做。那些整天吠个不停、干得很少的人，能不能做到呢？那完全是另一回事了。\n我要指出的是，在这个过程的早期，一位朋友决定用一种完全不同的语言编写一个类似的服务器，并设法完全销毁了其他地方认为理所当然的数字。这位朋友使用的语言在这里也无关紧要。\n哦，我相信他们会的。有些人可能想要它，因为它能传递信息。我不会就这么把它送人的。鉴于目前这类事情在世界上似乎不合理地罕见，我想这里可能会赚到很多钱。\n好好想想。这是一个不受限制的代码库，其中唯一的外部依赖项是protocol buf，上次我检查过它基本上是一个包含3个条款的BSD，所以只要您遵循文档/版权要求，您基本上可以做任何您想做的事情。\n另外，协议部分并不是非常关键的。您可以将其替换为二进制兼容的实现，没有人会知道其中的区别。Wire协议有很好的文档记录，如果您只是想测试一些东西，那么可以很容易地*手工*修改它。\n有没有人尝试过为GRPC制作第二个资源？你知道，说相同的语言，但不使用相同的实现？那会是什么样子？\n想象一下，当你签出某个东西时，它不会从互联网上的随机位置克隆出50个不同的子模块。多好的概念啊，对吧？\n此外，正如我已经说过的，出于多种原因，我不是整个社区的一部分。我肯定不会带着这样的东西跳进去的。\n它不是单线的，对不起。它将每个连接使用一个线程作为精心设计的选择。我不想为线程池而烦恼。我可以吗？好的。我有吗？没有，或者至少现在还没有。如果我需要，我会加进去的。现在，简单是值得的。\n我是专用服务器市场的老手，因为很久以前我曾为世界的那一边提供技术支持。当他们是每月5美元的员工特惠时，拿回一台机器是很自然的事情，之后很容易把它留在身边。\n在那段时间里，我已经使用过几台专用服务器。他们只是坐在那里，有点像是在做他们自己的事情。他们很无聊，这正是我想要的。这些年来，我拥有的这些盒子中的任何一个都可以充分体现几个商业概念，以确定是否值得在上面投入更多资金。他们的月费通常在100美元到200美元之间。\n对我来说，人们在Prem&34；上说的话现在意味着他们办公室里的某个壁橱。如今的办公室经常有非常好的连接，比如千兆或更好的连接，可以体面地前往任何重要的地方。我是在有一条专用于互联网的T1线路(~1.5 Mbps)进入您的企业是件大事的时候想到这一点的。我在这些连接上托管了一些东西。它们也工作得很好。\n我会再做一次吗？也许吧。这取决于我需要以多快的速度让事情发生，以及我是否能将某些东西粘在现有服务器的一侧。\n任何事情都有风险。你的办公室连接将会有糟糕的一天。你的服务器会死的。一只松鼠会在你的变压器上烧烤，而你一天都会断电。一个专心致志的提供者也会时不时地发生一些愚蠢的事情。那些机器也会时不时地死掉。\n不同的问题需要不同的解决方案。时间是一个因素，金钱是一个因素，你已经拥有的资源是一个因素，所需的灵活性是一个因素。\n壁橱里的那个备用盒也许正好够插上你的旗帜。只是别忘了稍后重新评估情况。\n我认为这意味着丢弃EPOLL内容，只需坐在read()或类似的地方。除了这是我在设计中刻意避免的问题外，还有其他问题。\n我的serviceworker线程需要时不时地做一些内务工作。他们可能需要做一次空闲的检查，才能将一位已经有一段时间没有说话的客户平底船。可能还有其他事情要做。此外，我还希望能够清理和关闭它们，而不必做可怕的事情来使它们解脱。\n会发出信号让它松开吗？呃.。正在取消线程吗？呃，不。与我最终所做的相比，这些都是令人讨厌的。\n我喜欢这样一个事实，即调度我的工人的唯一事情就是内核本身。你不能把它卡住了。如果你呼喊着阻止工人的东西，你就不会得到一大堆其他的东西，这些东西也马上就会受到影响。(这句话的意思是：“如果你大声呼喊，阻止了工人，你就不会得到一大堆其他东西，这些东西也会马上受苦。)”\n把整台机器弄坏才能让一切都停下来。在你到达那里之前，一切都只是跳来跳去，安排其他地方。这也是一个很好的缓慢下降，而不是简单地开下悬崖。\n同样的道理也适用于我，并且拥有我自己的线程池实现。也会有同样的担忧，另外，如果我不得不自己滚的话，还会增加正确操作的担忧。\n这个真的很让人迷惑。这就像是，是的，2013年我确实停止了每天写作，因为我被拖进了门洛帕克的蓝色大沼泽。\n但即便如此，我还是时不时地在有些东西需要脱口而出的时候重新露面：不要扼杀苹果公司(Apple)推出的糟糕透顶的Git版本，你甚至都不能关掉这类东西。\n不过，老实说，随着工作的增多，原本会用来在这里写作的精力会越来越多地从泳池中消失。这就是事情的发展方式。我签约了，我把我所有的一切都给了它。说它不健康，但这是我唯一可以操作的方法。不做半途而废的事。\n我可能永远不会知道，这个人是如何成功地阅读了2013年的一篇帖子，但在那之后很长一段时间都没有看到其他的帖子。\n有些人..。都在使用Python..。很糟糕。比如，训练有素的猴子坐在一堆连接到Unix shell账户的愚蠢终端前，循环运行NC-l(Port)&34；可以更好地运行服务器……。那是很糟糕的。\n大多数人？你不会听说他们的。对他们来说已经足够好了，他们用得不是很好。\n有些人还在使用PHP、C、C++、Perl、Ruby、Rust、Haskell、OCaml、Java、Clojure、Basic、shell脚本、D、Nim、Kotlin、Julia、JavaScript、Scala和Crystal。\n不同公司的相对高层已经告诉过我好几次了。这真是太可怕了！你真的以为你和什么都学不到的笨蛋一起工作吗？如果那是真的，你为什么要把它们留在身边呢？\n我还断定：这不是真的。事实上，他们是人，这意味着他们是聪明的、会挥舞工具的灵长类动物。人们，当你对他们有信心的时候，通常会想出有趣的解决方案来解决你摆在他们面前的问题。看看在过去的几个月里，这场“暮光之城”的封锁狂潮发生了什么。\n餐馆有大量的清洁用品，没有坐下来的交通工具可以使用。被困在家里的人需要清洁用品。餐馆把两件事放在一起，开始直接向公众销售。非常出色!。\n我假设大多数人的能力比这些诋毁者想的要多。\n你知道我喜欢和谁一起工作吗？在这方面是新手的人还没有见过太多东西，但对任何事情都持开放态度。想象一下一个典型的实习生。他们还在上学。他们在课堂上做了一些事情，也许在另外一两个实习中也做过。他们知道他们还有很长的路要走。\n我向他们提出了一个问题。他们走了，我不知道。我说，嗯，你知道吗，我也不知道。然后我们坐下来一起想办法。我爱死它了！这些都是我能想到的最有成就感的故事。我去年夏天做了这件事，感觉很棒。\n你知道我不喜欢和谁一起工作吗？那些不愿意为了更好的结果而尝试的人。甚至是任何结果。他们会固执己见，不会尝试我提出的东西，但他们也不会实现他们所谓的解决方案。你两败俱伤。\n对任何事情说不都很容易。这需要付出实际的努力才能给出一个替代方案。不要总是默认走最懒惰、最便宜、最糟糕、阻力最小的道路。\n相信你的员工，相信他们有能力成为有思想、以成长为导向、愿意成长和开拓眼界的人。如果你不这么做，别人也会这么做。\n哦，别告诉我，我不知道。这条线的问题是，它可以用得好，也可以用得不好，我看到它经常被用得不好。\n但你知道吗，我已经看到了那些大地方和一些小地方的内部情况--有些是直接看到的，有些是通过可信的内幕报道看到的。你猜怎么着？小得多的地方因为认为自己可以继续逍遥法外而苦不堪言。毕竟，他们是F、A、其他A、N或G。\n记住，科技的肮脏秘诀是，你必须把任何粘在墙上的屎都运出去，然后尽快发挥作用，否则别人会先发制人，抢先一步。然后，如果你在企业里呆的时间足够长，能够挺过那些可怕的事情-无论是哪几年，你就会赢得清理东西的机会。\n问题在于，这些地方从来没有完全意识到，是时候改变策略，停止像那家扔屎的小公司那样行事了。他们认为以前管用的东西现在会继续管用，我很抱歉，情况往往并非如此。\n要点：在一个进程中拥有所有这些连接是很糟糕的，因为如果它死了怎么办？\n你说得对，如果它死了，那我们就有麻烦了。所以，让我们确保它不会死得越多越好。我们将检查所有返回代码，并且不假定一切正常。我们将处理我们的语言提供的任何异常类型的东西。我们将构建一个系统，该系统将中止单个请求或连接，并且不会使整个过程崩溃。\n不过，当然，好的，如果你想的话可以查几个。如果你对此如此偏执，你甚至可以在同一个箱子上运行它们。我不想，但是，嘿，你是老板。\n要点：如果它重新启动怎么办？天哪，TIME_WAIT，无法再次绑定到端口！\n我现在不打算在这里演示它(这篇文章更像是一个选集设备，我们会一直呆在火车上)，但相信我，我可以在一个正确的；做事情；完成；循环，^C循环中运行服务器的时候，它会立即恢复--即使有客户在积极地使用它。它也不一定要干净利落地关门。不管你想要什么，你都可以签上它，它仍然会工作得很好。\n为什么？因为我做了功课，摆弄了所有的旋钮。它不一定是如此重用*.。还有更多。真的。去看看吧。\n为什么？因为在我开发它的时候，我只是使用Netcat作为我的客户端，只是为了生成TCP连接活动，而且在杀死服务器之后必须等待一两分钟才能清理干净，这真是太糟糕了！\n如果你真的边走边测试，你很快就会发现这类东西，不要只满足于喝咖啡，我猜我会去喝杯咖啡，然后决定好好地挖掘和清理你的烂摊子。\n此外，如果您有一个合理的系统来发现您的服务的实例，您不应该需要出现在同一端口。不管你在哪里，只要有足够的人在任何地方都能满足你的延迟要求，就不应该有问题。\n你会对黑客新闻上的其他一切说同样的话吗？因为，老实说，天底下几乎没有什么新东西。您读到的大部分内容与五年前的内容相同，但上面加了另一个名称(也许还增加了另一层间接/抽象层)。\n我看了最新的帖子，寻找了一些统计上不太可能的术语，只是想看看它可能有多糟糕。让我们拭目以待吧。\n我想我可以发布关于烘焙巧克力曲奇的帖子，然后从某些人那里得到同样的抱怨。小苏打！无盐黄油！杯子尺寸！金棕色！开球了！\n基本上，我没有办法把它做好，因为它是我做的。话题无关紧要，陈述无关紧要，措辞也无关紧要。我应该坐下来，闭嘴，给他们提供技术输出，就像一个好的小勺子。\n要点：(类似的关于可怕系统沸腾的悲剧故事，当你看起来很滑稽的时候)。\n如果不是因为这件检疫的事，我很可能会请你喝一杯，因为你是“让垃圾随意运转”俱乐部的一员。坚持住，记住，有些地方不是一直都是这样的。等待时机，保留你的选择余地。\n从我的角度来看，我没有做过任何事情。代码中(目前)没有任何内容说，哦，我正受到攻击，所以也许我应该为此做点什么。例如，我可以在某些操作达到一定的延迟后关闭连接，或者限制每个源地址、每个用户或任何其他可能有用的维度的连接。\n现在有一个限制：一旦我达到32000个serviceworker线程，我就会主动拒绝新的连接。事实证明，超越这一点开始让生活变得非常有趣，因为你的VSZ，嗯，是巨大的。\n为什么我要做线程限制器？嗯，早些时候，我一直在用连接来敲打这个东西，并注意到当它达到这个大小时，它就不能像通常那样启动一个新的线程了。现在，需要明确的是，这个计划并没有死亡。当线程创建由于缺乏资源而失败时，它只会出现一个有趣的错误，比如幕后的mmap调用无法分配更多的内存。\n正如你所预期的那样，计划的其余部分继续进行。毕竟，内存分配问题不是导致整个系统崩溃的理由。\n就网络问题而言，这主要是客户关心的问题。无可否认，这位客户现在确实很愚蠢。你给它一台主机和一个端口，它就会建立一个连接，然后它就可以开始比赛了。它不做服务发现、通道、负载平衡或任何其他类似的事情。为什么？因为我想先解决服务器端的问题。\n客户完全可以达到这样的地步：去给我找个LavaLamp；，带上一份(有限的)名单，找出谁在附近，谁不在，然后开始尝试联系，并进行健康检查，看看谁实际上是有空的。这句话的意思是：“你可以去找一只LavaLamp；给我找一只LavaLamp；，拿出一份(有限的)名单，找出谁在附近，谁不在。”然后，它将只平衡从用户到这些实例的那些通道上的请求。如果一个人死了，没什么大不了的，它会另找地方去的。用户甚至不应该注意到这一点。\n这是你在谷歌和Stubby一起工作，或者在Facebook和Service Router一起工作时免费得到的。当你在一个还没有解决这个问题的地方工作时，这也是你得不到的。\n旁白：所以，是的，如果我想要超过32K的并发连接，我将不得不在每个线程上处理多个客户端，或者产生另一个进程，或者诸如此类的事情。每个8MB+4096字节的32000个线程相当于大量的地址空间，因此我达到如此高的限制并不令人惊讶。\n我想使用超过1024个FDS，而不需要太长时间。我还想学习如何正确使用EPOLL，这样下一次我看到什么东西用得不好时，它就会变得相当明显。\n我知道这会自动隔离非Linux解决方案。就目前而言，我对此没有意见。如果它在某个时刻开始变得重要，那么我会拉出一个libeventent，并以多种方式实现它。\n但是后来我开始把实际的用例挂在上面，嘿，这真是一段美好的时光。我们还没有谈到这些，但是哦，是的，我拿了这个代码，把一些旧的东西移到上面。这些东西实际上做的是真正的工作，比如来自磁盘的I/O-喘气！-以及创建互斥锁后面的数据结构。天哪，由于并发访问而导致的实际锁争用！\n要点：这相当于开着更大的卡车过桥，直到它们断裂。\n嗯，是的，这就是问题的关键。我想展示一下，你最终是如何无法获得更多的吞吐量，而它只是开始减速。您想要在图表中找到那个膝盖，然后保持在它的下方。\n另外，我已经用卡尔文和霍布斯的漫画告诉负载测试人员停止杀死我的系统已经很长一段时间了。其中一个团体把它作为他们团体的非官方旗帜。", "note_en": "Ah yes, so yesterday&#39;s postabout my stupid little RPC load tests blew up. There&#39;s been a lot of feedback to it and a couple of other related posts. I will attempt to answer or otherwise address some of the points.\n   I&#39;m not going to tell you, at least, not yet. It actually doesn&#39;t matter. I submit that you can write terrible services in any language, and you can probably write halfway decent services in any language. Where the rubber meets the road, however, is when you start squeezing that last 66% out of your hardware.\n  If you haven&#39;t had to work at a place that thinks that scaling up at 33% CPU utilization on a host is normal, then this might not make any sense.I have. It&#39;s terrible.\n By not telling you what language it&#39;s in, I manage to starve out a whole side-shitshow of the &#34;conversation&#34; in which people have a full-on language war and forget about the fact that they still haven&#39;t managed to accomplish the same thing in their language of choice.\n I bet it can be done in the language. Whether it can be done by the people who just bark all day and accomplish very little? That&#39;s another story entirely.\n I will point out that much earlier in this process, a friend decided to write a similar server in a totally different language and also managed to totally destroy the numbers that other places take for granted. The language that friend used is also irrelevant here.\n   Oh, I&#39;m sure they do. Some people probably want it because it delivers. I&#39;m not going to just give it away. Given that this kind of thing seems to be unreasonably rare in the world right now, I figure maybe there&#39;s money to be made here.\n Just think of it. An unencumbered code base in which the only external dependency is protobuf, and last time I checked that&#39;s basically a 3-clause BSD so you can basically do whatever you want as long as you heed the documentation/copyright requirements.\n Also, the protobuf part isn&#39;t exactly critical. You could replace it with a binary-compatible implementation and nobody would know the difference. The wire protocol is well-documented and is easy enough to hack up *by hand* if you just want to test things.\n Has anyone tried making a second-source for gRPC? You know, speak the same language but not use that same implementation? What would that be like?\n Imagine something that won&#39;t clone 50 different &#34;sub modules&#34; from random places on the Internet when you check it out. What a concept, right?\n Also, as I already said, I&#39;m not a partof that whole community thing for multiple reasons. I&#39;m sure not going to hop into it with something like this.\n   It&#39;s not single-threaded, sorry. It uses one thread per connection as a deliberate design choice. I didn&#39;t feel like bothering with thread pools. Could I? Sure. Have I? No, or at least, not yet. If I need them, I&#39;ll add them. Right now, the simplicity is worth it.\n   I&#39;m a veteran of the &#34;dedicated server&#34; market since I used to do tech support for that side of the world a long time ago. It was a natural thing to get a machine back when they were a $5/month employee special, and it was very easy to keep it around afterward.\n I&#39;ve been through several dedicated servers in that time. They just sit there and kind of do their thing. They&#39;re boring, just the way I want it. Any one of these boxes I&#39;ve had over the years could run several business concepts far enough to find out if it&#39;s worth investing more in it. They usually run between $100 and $200/month.\n To me, people saying &#34;on prem&#34; now means some closet in their office. Offices these days frequently have very nice connections, like gigabit or better, with decent transit to anywhere that matters. I came up in the days when having a dedicated T1 line (~1.5 Mbps) for Internet into your business was a big deal. I hosted stuff on those connections. They also worked fine.\n Would I do that again? Maybe. It depends on how quickly I needed to get things happening, and whether I couldn&#39;t just glue something to the side of my existing server.\n Everything comes with risks. Your office connection will have a bad day. Your servers will die. A squirrel will barbeque itself on your transformer and you&#39;ll lose power for the day. A dedicated provider will also have stupid things happen from time to time. Those machines also die now and then.\n Different problems call for different solutions. Time is a factor, money is a factor, what resources you already possess is a factor, and the needed flexibility is a factor.\n That spare box in the closet might just be enough to plant your flag. Just don&#39;t forget to re-assess the situation later on.\n    I assume this means ditching the epoll stuff and just sitting there in read() or something like that. Besides the fact this is what I deliberately avoided in my design, there are other problems.\n My &#34;serviceworker&#34; threads need to do some housekeeping from time to time. They might need to do an idle check in order to punt a client who hasn&#39;t spoken in a while. There might be other things to do. Also, I wanted the ability to clean up and shut down without having to do terrible things to get them &#34;unstuck&#34;.\n Generating a signal to knock it loose? Ugh. Cancelling a thread? Eww, no. Those are nasty compared to what I ended up doing.\n    I like the fact that the only thing scheduling my workers is the kernel itself. You can&#39;t get it jammed up. If you call out to something that &#34;blocks the worker&#34;, you aren&#39;t going to end up with a whole bunch of other stuff which also suffers right away.\n It takes screwing up the whole machine in order to make everything stop.Until you get there, things just hop around, scheduling other places.It&#39;s also a nice slow descent rather than just driving off a cliff.\n The same goes for me and having my own thread pool implementation. There would be the same concerns, plus the added worry of doing it correctly if I had to roll my own.\n   This one is really confusing. It&#39;s like, yeah, I did stop writing every single day in 2013, because I got pulled into the big blue swamp in Menlo Park.\n But even then, I still resurfaced from time to time when there was something I needed to get out: &#34;don&#39;t kill -9 -1&#34;, &#34;Apple&#39;s shipping a terrible git build you can&#39;t even turn off&#34;, that kind of thing.\n Honestly, though, as a job ramps up, it takes more and more energy away from the pool that would otherwise be used to spend time writing here.That&#39;s how it goes. I sign up and I give it everything I have. Call it unhealthy, but it&#39;s the only way I can operate. No half-assing things.\n How this person managed to read one post from 2013 and not see the rest of them from well past that point, I may never know.\n    Some people... are using Python... BADLY. Like, trained monkeys sitting in front of a bunch of dumb terminals wired up to Unix shell accounts running &#34;nc -l (port)&#34; in a loop could run the server better... that kind of badly.\n Most people? You don&#39;t hear about them. It works well enough for them.They aren&#39;t using it badly.\n Some people are also using PHP, C, C++, Perl, Ruby, Rust, Haskell, OCaml, Java, Clojure, BASIC, shell scripts, D, Nim, Kotlin, Julia, JavaScript, Scala and Crystal badly.\n    I&#39;ve been told this a few times by relatively high-up people at different companies. This is really terrible! You honestly think you work with complete nincompoops who can&#39;t learn anything? If that&#39;s true, why do you keep them around?\n I also posit: it&#39;s not true. The fact that they are people means they are clever tool-wielding primates. People, when you have faith in them, will generally come up with interesting solutions to the problems you put in front of them. Just look at what&#39;s been happening with this Twilight Zone lockdown craziness of the past couple of months.\n Restaurants had tons of cleaning stuff and no sit-down traffic to use it on. People stuck at home needed cleaning stuff. Restaurants put two and two together and started selling directly to the public. Brilliant!\n I posit that most people are capable of more than some of these detractors would think.\n You know who I love working with? People who are new at this stuff, haven&#39;t seen too much yet, but are open to anything. Imagine a typical intern. They&#39;re still in school. They&#39;ve done a few things in classes and maybe at one or two other internships. They know they have a long way to go.\n I present a problem to them. They go &#34;I don&#39;t know&#34;. I say &#34;well, you know what, I don&#39;t either&#34;. Then we sit down and figure it out together. I love that! Those are some of the most fulfilling stories I can think of. I got to do this last summer and it was great.\n You know who I don&#39;t like working with? The people who aren&#39;t willing to try something for a better outcome... or even ANY outcome. They&#39;ll dig in their heels and not try the thing I pitched, but they won&#39;t deliver on their so-called solution, either. You get the worst of both worlds.\n It&#39;s easy to say &#34;no&#34; to everything. It takes actual effort to give an alternative. Don&#39;t be the one who always defaults to the laziest, cheapest, crappiest path of least resistance.\n Trust in your employees and their ability to be thoughtful, growth-oriented human beings who are willing to grow and expand their horizons. If you don&#39;t, someone else will.\n   Oh, don&#39;t I know it. The problem with this line is that it can be used well, and it can be used poorly, and I see it being used poorly more often than not.\n But you know what, I&#39;ve seen the innards of those big places and some smaller places - some directly, some via trusted insider reports. Guess what? Far, far smaller places are having miserable times with their &#34;infra&#34; because they thought they could keep getting away with it.After all, they aren&#39;t F, A, the other A, N, or G.\n  Remember, the dirty &#34;secret&#34; of tech is that you have to ship whatever shit will stick to the wall and kinda-sorta work as soon as you can, or someone else will do it first and beat you to the punch. Then, if you stay in business long enough to survive those terrible do-whatever years, you then  earn the opportunity to clean things up.\n The problem is those places which never quite realize that it&#39;s time to shift gears and stop behaving like that tiny little shit-flinging company. They think what worked before will keep working now, and I&#39;m sorry, that&#39;s frequently not the case.\n  Point: having all of those connections in one process is terrible, because what if it dies?\n You&#39;re right, if it dies, then we have a problem. So let&#39;s make sure it doesn&#39;t die as much as possible. We&#39;ll check all of our return codes and not assume things work. We&#39;ll deal with whatever exception type stuff our language provides. We&#39;ll build a system that aborts individual requests or connections and doesn&#39;t crash the whole process.\n  But still, sure, okay, run a couple of them if you want. You could even run them on the same box if you&#39;re that paranoid about it. I wouldn&#39;t, but hey, you&#39;re the boss.\n  Point: what if it restarts? OMG TIME_WAIT and not being able to bind to the port again!\n I&#39;m not going to demonstrate it here right now (this post is more of an anthology device, and we&#39;re staying on the train), but trust me when I say I can run the server in a &#34;while true; do thing; done&#34; loop, ^C it, and it&#39;ll come right back up -- even if there are clients actively whacking away at it. It doesn&#39;t have to be a clean shutdown either. SIGKILL it or whatever you want, and it&#39;ll still work out fine.\n Why? Because I did my homework and twiddled all of those knobs. It&#39;s not necessarily SO_REUSE* ... there are more. Really. Go look.\n Why? Because while I was developing it, I was just using netcat as my &#34;client&#34; just to generate TCP connection activity, and having to wait for a minute or two for things to clear out after killing the server really sucked!\n This is the kind of stuff that you discover pretty quickly if you&#39;re actually testing as you go, and don&#39;t just settle for &#34;well, guess I&#39;ll go get a coffee&#34;, and decide to dig in and clean up your messes properly.\n Also, if you have a reasonable system for discovering instances of your service, you shouldn&#39;t need to come up on the same port. It shouldn&#39;t matter where you are, as long as there are enough of you available within whatever locality is needed to meet your latency requirements.\n   Do you say the same thing to everything else on Hacker News? Because, honestly, there&#39;s very little new under the sun. Most of what you read about is the same thing from five years ago with another name slapped on it (and perhaps another layer of indirection/abstraction added).\n    I looked at the most recent post for some statistically improbable terms just to see how bad it might be. Let&#39;s just see.\n  I suspect I could post about baking chocolate chip cookies and get the same complaint from certain individuals. Baking soda! Unsalted butter! Cup measures! Golden brown! Kicking off!\n Basically, there&#39;s no way for me to do it right, because it&#39;s done by me. The topic doesn&#39;t matter, the presentation doesn&#39;t matter, and the wording doesn&#39;t matter. I should sit down, shut up, and provide them technical output like a good little peon.\n    Point: (similar tales of woe about terrible systems boiling when you so much as look at them funny)\n If not for this quarantine thing, I&#39;d probably buy you a drink of choice for being a fellow member of the &#34;keeps random crap running&#34; club. Hang in there, and remember, there are places where it&#39;s not like that all the time. Bide your time and keep your options open.\n   I haven&#39;t gone to any lengths from my perspective. There&#39;s nothing in the code (yet) which says &#34;oh, I&#39;m under attack, so maybe I should do something about it&#34;. I could, for example, wave off connections after certain operations reach a certain amount of latency, or limit connections per source address, or per user, or any other dimension that might be useful.\n There is ONE limiter in there right now: I actively reject new connections once I hit 32000 serviceworker threads. It turns out that going much beyond that starts making life very interesting since your VSZ is, well, massive.\n Why did I do the thread limiter? Well, early on, I was hammering the thing with connections, and noticed that it would fail to do the usual stuff to start a new thread when up around that size. Now, to be clear, the program did not die. It would just have a funny error when thread creation failed due to a lack of resources, like a mmap call behind the scenes failing to allocate more memory.\n The rest of the program kept going, as you would expect. A memory allocation problem is no reason to crash the whole thing, after all.\n In terms of &#34;network issues&#34;, those would mostly be the concern of the client. The client is admittedly stupid right now. You give it a host and a port, it nails up a connection, and it&#39;s off to the races. It&#39;s not doing service discovery, channels, load balancing, or anything else of the sort. Why? Because I wanted to solve for the server side first.\n The client could totally get to the point where it is told &#34;go find me a LavaLamp&#34;, brings in a (limited) list of them, figures out who&#39;s close by and who isn&#39;t, then starts attempting connections and doing health checks to see who&#39;s actually available. Then it&#39;ll just balance the requests from the user onto those channels to those instances. If one dies, no big deal, it&#39;ll find another place to go. The user shouldn&#39;t even notice.\n This is what you get for free when you work at Google with Stubby, or at Facebook with Service Router. It&#39;s also what you don&#39;t get when you work at a place that hasn&#39;t solved this problem yet.\n Aside: so, yeah, if I want to go past 32K simultaneous connections, I&#39;m going to have to do multiple clients per thread, or spawn another process, or something like that. 32000 threads at 8 MB + 4096 bytes each equals a LOT of address space, and it&#39;s not surprising that I&#39;m hitting limits up that high.\n    I wanted to use more than 1024 fds without going to lengths. I also wanted to learn how to use epoll correctly so that it&#39;ll be quite obvious the next time I see something using it poorly.\n I know this automatically walls off non-Linux solutions. I&#39;m okay with that for the moment. If it starts to matter at some point, then I&#39;ll pull a libevent and implement it multiple ways.\n    But then I started hanging actual use cases off of it, and hey, good times. We haven&#39;t talked about those yet, but oh yes, I took this code and moved some older stuff onto it. These things actually do real work, like I/O from the disk - gasp! - and frobbing data structures which are behind mutexes. OMG, actual lock contention because of concurrent accesses!\n   Point: this is the equivalent of driving bigger trucks across the bridge until they break.\n Well, yeah, that&#39;s the whole point. I wanted to demonstrate how you eventually can&#39;t get any more throughput and it just starts slowing down. You want to find that knee in the graph and then stay below it.\n  Also, I&#39;ve been using that Calvin and Hobbes comic to tell load testing people to stop killing my systems for a very long time now. One group made it the unofficial banner of their group.", "posttime": "2020-05-09 10:03:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "反馈,reader", "title": "对读者反馈的回应", "title_en": "Responses to Reader Feedback", "transed": 1, "url": "https://rachelbythebay.com/w/2020/05/08/feedback/", "via": "", "real_tags": ["反馈", "reader"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001352, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英国《卫报》透露，政府科学顾问对此感到愤怒，因为他们认为，在冠状病毒封锁期间，政府科学顾问试图通过在一份官方报告向公众发布之前对其进行大量编辑，来审查他们对政府提案的建议。\n这份报告是紧急情况科学咨询小组(Sage)本周发布的一系列文件之一，目的是平息越来越多的批评，即向应对冠状病毒的部长们提供的建议缺乏透明度。\n然而，这份由SPI-B编制的报告中的大段文本被完全删掉了。SPI-B是Sage小组委员会，提供行为科学家关于公众可能如何应对封锁措施的建议。\nSPI-B的几名成员告诉卫报，文件的编辑部分包含了他们对潜在政府政策的批评，这些政策是他们在3月底和4月初被正式要求考虑的。\nSPI-B的一位顾问说：“这太愚蠢了，而且完全适得其反。”另一名委员会成员说：“我得到的印象是，本届政府不想要任何批评。”\n周五下午，在“卫报”披露了对编辑后的报告感到失望之后，政府顾问委员会的另一名成员在Twitter上抱怨他所说的“斯大林主义”审查制度。\n圣安德鲁斯大学(University Of St Andrews)社会心理学教授斯蒂芬·赖彻(Stephen Reicher)说：“就我个人而言，与其说是愤怒，不如说是困惑。”“在这场危机中，我们拥有的最大资产是公众的信任和坚守。你想要信任吗？你需要对人敞开心扉。这个不是开着的。这让人想起斯大林主义的俄罗斯。看上去不怎么样。“。\n委员会成员之间一直在讨论如何最好地对编辑做出回应，他们认为这是一项危及他们独立性的高压举措。\n据悉，至少有一名科学顾问正在考虑辞职，原因是政府围绕冠状病毒爆发对科学采取了保密的做法，他们认为这正在破坏公众的信任。\n4月1日的这份报告总结了SPI-B关于如何处理刚刚为减缓冠状病毒传播而引入的社会疏远措施可能发生的变化的讨论。\n在Sage的政府网站上发布的版本中，几乎有一页半的文本被大量编辑。卫报理解与SPI-B大约在那个时候批评可能的政府提案有关的被屏蔽的文本。\n这些措施包括减少英国人可以花在锻炼或购物上的时间，以及对那些被发现违反封锁的人进行更严厉的经济处罚。第三项提案涉及要求人们自我验证他们的行动，就像法国所发生的那样，那里的公民被要求在离开家之前完成许可证。\nSPI-B的专家(包括心理学、流行病学和人类学教授)表示，他们认为这些提议过于惩罚性，更有可能导致贫困经济状况下的人受到不公平待遇。\n政府科学办公室的一位发言人表示，之所以进行编辑，是因为文件中讨论的政策仍在考虑中。\n这位发言人说：“唯一的编辑内容涉及一个Sage小组的评论，其中具体提到了仍在考虑中的政策或取消联系。”\n“编辑工作是由Sage秘书处的官员与制定政策的部门协商后进行的。所有小组均获通知，并有机会在发表前就任何文件的特定内容所作的修订发表意见。“\n然而，接受卫报采访的SPI-B顾问驳斥了他们被征询过意见的说法。第二个SPI-B成员说：“我们没有得到事先通知，我们仍然没有得到一个令人满意的解释。”他补充说，他们觉得编辑是为了压制批评。\n“这届政府没有表现出任何自我批评，因为每个人都很明显地看到，他们犯了大错。如果你想得到民众的信任，你就举手说‘我们犯了这些错误，这就是为什么会发生这些错误，我们后悔，我们正在从中吸取教训’。而不是一直说‘我们做得最棒了’，而不是以任何方式接受批评。“。\nSPI-B的第三名成员表示，他们认为这些修订破坏了专家组对政客的独立性。“这份经过编辑的文件中记录的是我们对这些建议的批评。他们只是没有特别深思熟虑。在这里，我们是独立的，你看不到这一点(因为编辑)。“。\nSPI-B的第四名成员质疑大量的编辑工作是否可能是一个错误，因为这些文件是公务员编制的委员会讨论的摘要。\n“这是一个错误还是故意并不重要；这不应该发生，这是非常有问题的，”这位顾问说。“公众需要对科学建议有信任和信心，政府声称这是它所依赖的，而看到出版的文件中的章节被编辑会削弱信任和信心。”\n据悉，该委员会对政府提案的审议是在3月23日开始的封锁的第一周进行的。\n行为科学家在他们长达4页的报告中表示，人们一致认为，对政府指导方针的高度遵守“很可能在中短期内保持不变，只要冠状病毒构成无法通过任何其他方式管理的严重风险”就是如此。这两位行为科学家在他们长达4页的报告中表示，人们一致认为，只要冠状病毒构成无法用任何其他方式管理的严重风险，“在中短期内很可能会保持高度遵守政府指导方针的水平”。\n然而，他们担心，引入更多强制性措施，如对行动实施更严格的限制，可能会破坏高度遵守的情况，他们表示，这“很可能是基于社区合作的感觉”。", "note_en": "Government scientific advisers are furious at what they see as an attempt to censor their advice on government proposals during the Covid-19 lockdown by heavily redacting an official report before it was released to the public, the Guardian can reveal.\n The report was one of a series of documents published by the Scientific Advisory Group on Emergencies (Sage) this week to mollify growing criticism about the lack of transparency over the advice given to ministers responding to the coronavirus.\n However, large blocks of text in the report, produced by SPI-B, the Sage subcommittee providing advice from behavioural scientists on how the public might respond to lockdown measures, were entirely blanked out.\n Several SPI–B members told the Guardian that the redacted portions of the document contained criticisms they had made of potential government policies they had been formally asked to consider in late March and early April.\n One SPI-B adviser said: “It is bloody silly, and completely counterproductive.” A second committee member said: “The impression I’m getting is this government doesn’t want any criticism.”\n On Friday afternoon, after the Guardian revealed frustrations over the redacted report, another member of the government’s advisory committee took to Twitter to complain of what he said was “Stalinist” censorship.\n “Personally, I am more bemused than furious,” said Stephen Reicher, a professor of social psychology at the University of St Andrews. “The greatest asset we have in this crisis is the trust and adherence of the public. You want trust? You need to be open with people. This isn’t open. It is reminiscent of Stalinist Russia. Not a good look.”\n Members of the committee have been discussing among themselves how best to respond to the redaction, which they believe was a heavy-handed move that jeopardises their independence.\n  At least one scientific adviser is understood to be considering resigning over the government’s secretive approach to science around the Covid-19 outbreak, which they believe is undermining public trust.\n The report, from 1 April, summarised SPI-B’s discussions about how to handle possible changes to the social distancing measures that had just been introduced to slow the spread of Covid-19.\n In the version published on  Sage’s government website, almost a page and a half of text was heavily redacted. The Guardian understands the blocked text related to SPI–B’s criticism about possible government proposals around that time.\n These included the idea of reducing the amount of time Britons could spend exercising or shopping, and stricter financial penalties for those found to be breaking the lockdown. A third proposal involved requiring people to self-validate their movements, as was occurring in France, where citizens were required to complete permits before leaving home.\n Experts on SPI-B, which includes professors in psychology, epidemiology and anthropology, said they felt the proposals were too punitive and more likely to result in unfair treatment among people in deprived economic circumstances.\n A spokesperson for the Government Office for Science said the redactions took place because the policies discussed in the document were still under consideration.\n “The only redactions relate to comments made by a Sage subgroup where specific reference is made to policy still under consideration or to remove contact,” the spokesperson said.\n “Redactions were carried out by officials working for the Sage secretariat in consultation with the department developing the policy. All the subgroups were notified and given the opportunity to comment in advance of publication on the redactions being made to specific elements of any papers.”\n However, SPI–B advisers who spoke to the Guardian disputed that they had been consulted.  “We weren’t given advance notice and we still haven’t been given a satisfactory explanation,” the second SPI–B member said, adding they felt the redaction had been intended to stifle criticism.\n “This government has failed to show any self-criticism whatsoever, when it is glaringly obvious to everybody that big mistakes have been made. If you want the trust of the population you hold up your hand and you say ‘we’ve made these mistakes, this is why they happened, we regret it, we’re learning from it’. Rather than just keep saying ‘we’ve done the most fantastic job’ and not being open to criticism in any way.”\n  A third member of SPI–B said they felt the redactions undermined the expert group’s independence from politicians. “What is recorded in the redacted document is us criticising those proposals. They were just not particularly well thought out. Here we were being independent, and you can’t see it [because of the redactions].”\n A fourth member of SPI-B questions whether the heavy redaction might even have been a mistake, as the documents were summaries of the committee’s discussions produced by civil servants.\n  “Whether it was a mistake or deliberate doesn’t matter; it should not have happened, it’s deeply problematic,” the adviser said. “The public needs to have trust and confidence in the scientific advice, which the government claims it is relying on, and to see sections redacted in published documents diminishes trust and confidence.”\n The committee’s consideration of the government proposals is understood to have occurred during the first week of the lockdown, which began on 23 March.\n The behavioural scientists said in their four-page report that there was a consensus that the high-levels of adherence to government guidelines “are likely to be maintained in the short-to-medium term, for as long as it is evident that Covid-19 poses a serious risk that cannot be managed in any other way”.\n However they were concerned that introducing more coercive measures, such as more draconian restrictions on movements, risked undermining the high levels of adherence, which they said was “likely based on a sense of community cooperation”.", "posttime": "2020-05-09 09:33:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,冠状病毒,病毒,censor,政府", "title": "英国科学家谴责“斯大林主义”企图审查冠状病毒建议", "title_en": "UK scientists condemn 'Stalinist' attempt to censor Covid-19 advice", "transed": 1, "url": "https://www.theguardian.com/world/2020/may/08/revealed-uk-scientists-fury-over-attempt-to-censor-covid-19-advice", "via": "", "real_tags": ["科学家", "冠状病毒", "病毒", "censor", "政府"]}, {"category": "", "categoryclass": "", "imagename": "453380464056990f0f0190b93a81e2df.jpg", "infoid": 1001351, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "IT服务提供商Cognizant在本周的财报电话会议上表示，上个月发生在2020年4月的勒索软件事件将对其第二季度收入产生负面影响。\n虽然我们预计与这个问题相关的收入影响将在本季度中期基本得到解决，但我们确实预计本季度的收入和相应的利润率影响将在5000万至7000万美元之间，Cognizant首席财务官卡伦·麦克洛夫林(Karen McLoughlin)在昨天的财报电话会议上表示。\nMcLoughlin还预计，该事件将招致与调查、恢复服务和补救违规相关的额外和不可预见的法律、咨询和其他成本。\nCognizant首席财务官表示，公司现在已经完全从勒索软件感染中恢复过来，并恢复了大部分服务。\n在谈到勒索软件攻击时，Cognizant首席执行官布莱恩·汉弗莱斯(Brian Humphries)表示，这起事件只影响了其内部网络，但不影响客户系统。\n更确切地说，汉弗莱斯表示，勒索软件事件影响了(1)Cognizant支持员工在家工作的精选系统，以及(2)在冠状病毒流行期间Cognizant用来支持在家工作能力的笔记本电脑的供应。\n汉弗莱斯说，工作人员迅速采取行动，关闭了所有受影响的系统，这在一段时间内影响了Cognizant的计费系统。作为预防措施，一些客户服务部门被关闭了。\nCogizant与客户举行了会议，然而，由于Cognizant避免透露所发生事情的任何实际细节，会议进行得并不顺利。\nZDNet了解到这一事件的时间是在4月17日，当时几名心怀不满的客户联系了本报记者，称该公司试图以技术问题为幌子掩盖一个重大的安全漏洞，并切断了一系列服务的接入。\n起初，客户担心黑客从服务器窃取了用户数据，或者发生了勒索软件事件，勒索软件传播到客户服务器，加密了他们的数据，服务器变得无法访问。\n在Cognizant向所有客户发送内部警报，敦促客户阻止IP地址列表的流量后，客户被推入完全偏执的模式。\n客户很快将IP地址链接到过去由迷宫勒索软件团伙运营的网络服务器。\n作为美国最大的服务器托管和IT服务提供商之一，Cogizant最终在4月18日公开承认，其网络在一天后感染了迷宫勒索软件。\n这起事件的认知损失与铝生产商挪威海德鲁(Norsk Hydro)去年报告的范围相同，该公司报告称，2019年3月的勒索软件事件将导致总收入损失超过4000万美元，该公司后来将这一数字调整为年内近7000万美元。\n汉弗莱斯表示，Cognizant目前正在努力解决客户的担忧，这些客户在勒索软件攻击后选择暂停Cognizant服务，这也影响了Cognizant目前的利润。\n近年来，美国证交会(SEC)将勒索软件列为公司利润主要前瞻性风险因素的申请数量从2014年的3份飙升至2019年的1139份，2020年已经达到743份。企业今天将勒索软件攻击视为其利润的真正风险，因为勒索软件事件往往会对股价造成声誉损害，并因收入损失而造成财务损失，因为大多数受害者需要数周至数月的时间才能完全恢复。", "note_en": "IT services provider Cognizant said in an earnings call this week that a ransomware incident that took place last month in April 2020 will negatively impact its Q2 revenue.\n &#34;While we anticipate that the revenue impact related to this issue will be largely resolved by the middle of the quarter, we do anticipate the revenue and corresponding margin impact to be in the range of $50 million to $70 million for the quarter,&#34; said Karen McLoughlin, Cognizant Chief Financial Officer in an earnings call yesterday.\n McLoughlin also expects the incident to incur additional and unforeseen legal, consulting, and other costs associated with the investigation, service restoration, and remediation of the breach.\n The Cognizant CFO says the company has now fully recovered from the ransomware infection and restored the majority of its services.\n  Speaking on the ransomware attack, Cognizant CEO Brian Humphries said the incident only impacted its internal network, but not customer systems.\n   More precisely, Humphries said the ransomware incident impacted (1) Cognizant&#39;s select system supporting employees&#39; work from home setups and (2) the provisioning of laptops that Cognizant was using to support its work from home capabilities during the COVID-19 pandemic.\n Humphries said staff moved quickly to take down all impacted systems, which impacted Cognizant&#39;s billing system for a period of time. Some customer services were taken down as a precaution.\n   Cognizant held meetings with customers, however, the meetings did not go smoothly as Cognizant avoided sharing any actual details of what had happened.\n ZDNet learned of the incident as it was going on, at the time, on April 17, when several disgruntled customers had reached out to this reporter about the company attempting to hide a major security breach under the guise of &#34;technical issues&#34; and cutting off access to a series of services.\n Initially, customers feared that a hacker had either stole user data from servers, or a ransomware incident had taken place, and the ransomware spread to customer servers, encrypting their data and the servers becoming inaccessible.\n Customers were thrown in full paranoia mode after Cognizant sent an internal alert to all customers, urging clients to block traffic for a list of IP addresses.\n Customers were quick to link the IP addresses to web servers operated in the past by the Maze ransomware gang.\n Cognizant, one of the largest providers of server hosting and IT services in the US, eventually publicly admitted that its network was infected with the Maze ransomware a day later  on April 18.\n  Cognizant losses from the incident are in the same range reported last year by aluminum producer Norsk Hydro, which reported that a March 2019 ransomware incident would cause total revenue losses of  more than $40 million, a number it later adjusted to nearly $70 million during the year.\n Humphries said that Cognizant is now working to address the concerns of customers who opted to suspend Cognizant services in the wake of the ransomware attack, which also impacted Cognizant&#39;s current bottom line.\n  The number of SEC filings listing ransomware as a major forward-looking risk factor to companies&#39; profits  has skyrocketed in recent years from 3 filings in 2014 to 1,139 in 2019, and already 743 in 2020. Companies are seeing today ransomware attacks as a real risk for their bottom lines as ransomware incidents tend to cause reputational damage to stock prices and financial losses due to lost revenue as most victims take weeks and months to fully recover.", "posttime": "2020-05-09 09:17:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,cogizant,expects,客户", "title": "Cogizant预计在勒索软件攻击后损失在5000万至7000万美元之间", "title_en": "Cognizant Expects To Lose Between $50 Million and $70 Million Following Ransomware Attack", "transed": 1, "url": "https://www.zdnet.com/article/cognizant-expects-to-lose-between-50m-and-70m-following-ransomware-attack/?ftag=TREc64629f&bhid=24300273679863920476885701297324&mid=12825712&cid=717442900", "via": "", "real_tags": ["软件", "cogizant", "expects", "客户"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001350, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通常，当我在这里写东西时，我会花时间充分思考一个观点，提出一个理由，解决我能想到的问题的所有主要方面，等等。\n但是这周我已经因为使用代码库而筋疲力尽了，所以这篇文章不会出现在那些帖子中。我打算尝试一下意识流博客。\n当程序员对自己说，我这里有一些代码或想法，我认为这些代码会让其他人的生活变得更轻松时，代码通常有两种大致的形式：库或框架。\n库是一组构建块，它们可以共享一个共同的主题或很好地协同工作，但在很大程度上是独立的。\n框架是一个上下文，用户可以在其中编写自己的代码。这可以采取控制反转、特定于领域的语言，或者仅仅是一个非常固执己见的内部耦合库的形式。这是一种谱系；两者之间没有硬性界限。判断某物是否为框架的一种方法是问问自己，我可以将其与其他类似的东西结合使用吗？或者它已经建立了与其他可能做这些事情的方式相互排斥的做事方式？&#34；\n框架的主要特点是它们对程序员施加了限制。它们没有提供一组程序员可以做的新事情，而是对程序员可以做的事情建立了一个边界。作为灵活性的交换，它们通常消除样板，为在其上构建新的库建立试金石，并允许程序员的技能在项目之间变得更具可移植性。事实上，有时限制本身是可取的！毕竟，类型系统只不过是对代码施加限制的一种方式。限制本身并不是坏事。\n但是。当你编写一个框架，希望别人用它来构建真正的项目时(也就是说，它不只是一个玩具)，你承担的责任比你使用库要大得多。\n通常，框架必须提前预测其用户在其围墙内可能需要做的每一种事情。对于它吸收到自己的词汇表中的每一块拼图，它必须承担起这组任务的责任。它不仅必须注意需要在其中完成的每项任务都能完成，而且理想情况下，它还需要提供一种比正常方式更好的方式来完成这些任务。否则，为什么要用它呢？\n这也转化为开发人员的体验。您的框架是否引入了超越基本语言的基于约定的行为？您最好彻底记录这些内容，否则用户将无可救药地迷失方向。您是否引入了一种特定于领域的语言？您现在负责构建链的一部分，并负责编辑器集成。\n现在，如果有一个主要的组织支持这个框架，也许这个演算就会奏效。谷歌可以背角度，枢轴可以背弹簧，史诗可以背虚幻引擎。在这些情况下，框架方法是可行的，因为存在真正涵盖所有需要覆盖的基础的资源和意愿。\n但是，如果没有大的组织；如果项目是由个人、初创公司或不是公司核心的小团队编写和维护的，那么它几乎肯定会在库中出错。有了库，核心概念的编辑器集成和文档更有可能掌握在语言初学者自己手中。对于库，任何缺陷--如错误、文档缺失、功能缺失、缺乏持续维护、与其他库的争议性等--都更有可能被自定义代码或其他库中的片段所掩盖。有了库，好的部分可以零碎地使用，而不必因为一个没有人会在后备箱里解决的问题而扔掉整个东西。\n所以我的观点是：框架并不总是糟糕的，但它们比库更大的风险--无论是对创建者还是用户。如果您的框架能够在不损失太多的情况下成为一个库，那么它很可能就应该是一个库。如果你没有在一家大型科技公司工作，你可能没有时间或精力去给予一个框架它所需要的所有关注。图书馆不是万能的，但它们应该是首选。", "note_en": "Normally when I write about something on here I take the time to fully think-out a point, make a case, address all the major sides of the issue that I can think of, etc.\n  But I am exhausted from fighting with a codebase this week, so this is not going to be one of those posts. I&#39;m going to try a little stream-of-consciousness blogging.\n  When a programmer thinks to herself &#34;I&#39;ve got some code or an idea for some code here that I think will make others&#39; lives easier&#34;, there are generally two broad-strokes forms that code can take: a library, or a framework.\n  A library is a set of building blocks that may share a common theme or work well together, but are largely independent.\n  A framework is a  context in which someone writes their own code. This could take the form of inversion-of-control, a domain-specific language, or just a very opinionated and internally-coupled library. It&#39;s a spectrum; there&#39;s no hard line between the two. One way to tell if something is a framework is to ask yourself, &#34;Could I use this in combination with something else like it? Or has it established ways of doing things that are mutually-exclusive with other ways those things might be done?&#34;\n  Frameworks&#39; key trait is that they impose  limitations on the programmer. Rather than  providing a set of new things the programmer can do, they establish a  boundary on the things the programmer can do. In exchange for flexibility they often eliminate boilerplate, establish a touchstone for new libraries to be built on top of them, and allow a programmer&#39;s skills to become more transferrable beteen projects. In fact, sometimes the limitations themselves are desirable! After all, type systems are nothing but a way of imposing limitations on code. Limitations are not intrinsically  bad.\n  However. When you write a framework that you expect others to build real projects with (i.e. it isn&#39;t just a toy), you are taking on a much greater responsibility than you would with a library.\n  A framework, usually, must predict ahead of time every kind of thing a user of it might need to do within its walls. For each piece of the puzzle that it assimilates into its own vocabulary, it must take over responsibility for that set of tasks. It must not only take care that every task that needs to be done in it  can be done, it ideally needs to offer a  better way of doing those things than the way they would be done normally. Otherwise, why use it?\n  This translates to the developer experience as well. Does your framework introduce convention-based behaviors that go beyond the base langauge? You&#39;d better thoroughly document those, or users will become hopelessly lost. Do you introduce a domain-specific language? You&#39;re now responsible for part of the build chain, and for editor integration.\n  Now, if there&#39;s a major organization backing the framework, maybe the calculus works out. Google can back Angular, Pivotal can back Spring, Epic can back Unreal Engine. These are the cases where the framework approach can work out, because there exist the resources and the will to really cover all of the bases that need covering.\n  But if there is not a major organization; if the project is written and maintained by an individual, or a startup, or a small team who isn&#39;t central to their company, it almost certainly should err on the &#34;library&#34; side of things. With a library, editor integration and documentation of core concepts are more likely to remain in the hands of the language matinainers themselves. With a library, any shortcomings - in the form of bugs, missing documentation, missing functionality, lack of continued maintenance, combatibility with other libraries, etc. - are much more likely to be able to be papered-over with custom code or with pieces from other libraries. With a library, the good bits can be used piecemeal without having to throw the whole thing away because of one problem that nobody&#39;s ever going to fix in the trunk.\n  So here&#39;s my point: frameworks aren&#39;t always bad, but they are a much bigger risk - for both the creators and the users - than libraries are. If your framework can be a library without losing much, it probably should be. If you don&#39;t work at a major tech company, you probably don&#39;t have the time or energy to give a framework all of the attention it requires. Libraries aren&#39;t everything, but they should be preferred.", "posttime": "2020-05-09 09:16:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编写,libraries,框架", "title": "编写库，而不是框架", "title_en": "Write Libraries, Not Frameworks", "transed": 1, "url": "https://www.brandonsmith.ninja/blog/libraries-not-frameworks", "via": "", "real_tags": ["编写", "libraries", "框架"]}, {"category": "", "categoryclass": "", "imagename": "9baff3f416b4c1e84b045167f2cc4048.png", "infoid": 1001349, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人工智能不应该作弊。也就是说，使用人类玩家不可用任何资源和/或信息。\n对AI的调整必须在每个核心模块中进行测试。一个方面的改善不应该对其他多器官功能障碍有负面影响。\n我不应该照看球员。将Micro从RTS流派中移除并不是OpenRA的目标。\n管道和一般逻辑是由C#代码处理的，也应该由C#代码处理。变量，如建筑比率、班组组成、队列和单位名称存储在MiniYAML文件中。这使得开发人员可以相对轻松地对AI进行细微的调整。\n然而，大多数特定于MOD的行为，以及所有更复杂的行为，都不能以这种方式合理实现，这是因为人工智能需要在不同的MOD中支持许多特定的功能，这些功能大多是独占的，甚至是相互冲突的。\n这种瘫痪的人工智能在许多关键领域产生了问题，包括但不限于：战术决策、资源使用优化和基地建设。\n因此，未来的OpenRA AI应该使用Lua脚本来制定所有特定于MOD的决策，以及所有复杂的行为。这样的AI实现将允许建模者和开发人员根据自己的需要轻松地调整AI，同时还可以防止C#代码和MiniYAML文件不必要的膨胀。已经有几次尝试实现这样的人工智能，到目前为止都没有完全成功。最值得注意的包括：#12949。\n团队协调：人工智能应该能够与队友分享信息，并对他们的环境做出反应。这包括人类和人工智能球员。\n精准经济管理。因此，人工智能意识到它的资源，并能够根据需要重新分配它们。", "note_en": "AI shouldn&#39;t cheat. That is, use any resources and or information not available to human player.\n   Adjustments to the AI must be tested in each of the core mods. Improvement in one shouldn&#39;t negatively impact other mods.\n   AI shouldn&#39;t babysit the player. Removing micro from RTS genre  is not the goal of OpenRA.\n  The plumbing and general logic is handled, and should be handled, by C# code.The variables, such as building ratios, squad composition, queues and unit names are stored in miniYAML file.This allows developers to perform minor tweaks on the AI, with relative ease.\n However, most mod specific behavior, and all more complex behavior, can not be reasonably implemented in this fashion.This is because of many specific features the AI has to support in different mods, most of which are exclusive and even conflicting with each other.\n Issues arising from this cripple AI in many key areas, including but not limited to: tactical decisions, resource use optimization and base construction.\n  Therefore the future OpenRA AI should use LUA scripts for all mod specific decision making, as well all complex behavior.Such AI implementation would allow modders and developers to easily adjust AI to their needs, while also preventing unnecessary bloat of C# code and miniYAML files. There have been several attempts to implement such AI, so far none of them completely successful.The most notable ones include: #12949\n  Team coordination: The AI should be able to share information with its teammates, and react to their circumstances.This includes both human and AI players.\n  Precise economic management. So that AI is aware of it&#39;s resources and is able to reallocate them as needed.", "posttime": "2020-05-09 09:01:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,ai,人工智能", "title": "OpenRA AI开发指南", "title_en": "OpenRA AI Development Guidelines", "transed": 1, "url": "https://github.com/OpenRA/OpenRA/wiki/AI-Development-Guidelines", "via": "", "real_tags": ["开发", "ai", "人工智能"]}, {"category": "", "categoryclass": "", "imagename": "4b22f0769d5d63b239b2fff37264705d.png", "infoid": 1001346, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我真的很想成为一名大公司的人，但我是一个容易感到无聊的多面手，而现实是我喜欢创业。诚然，在大多数初创公司中，大多数事情都是永无止境的，但如果你能接受这一点，那就有很多值得喜欢的地方。有一个众所周知的例子：在一家快速发展的初创公司，一个勤奋、有才华的人，如果得到公司领导层的一些支持，通常可以很快获得一个令人印象深刻的头衔(或者至少是很多事实上的权力)。\n我遇到过很多以这种方式上台的人，他们几乎没有或根本没有管理经验，有时甚至对自己角色的核心职责没有太多经验。一切都是新的，而拥有权力本身又是一件新的事情。我在我的编程生涯中只有几年的时间就第一次遇到了这种情况，我发现它让我迷失了方向。我有时可以感觉到，就像质量扭曲时空结构一样，权力正在重塑我周围的一切，但我看不到确切的方式。以下是我希望自己当时就知道的一些事情：\n权力会扭曲品味。这个世界上我最喜欢的一件事是，有人说了一些非常有趣的话，却没有人笑--可能是因为承认你听懂了这个笑话太小众和怪异了，也许是因为你在电话会议上假装在听，一位同事给你发了一张有趣的截图，也许是因为你在偷听，试图表现得好像你在关心自己的事情。不管是什么原因，我喜欢看着人们尽量不笑。我过去常常讲很多笑话，这些笑话要么很愚蠢，要么晦涩难懂，以至于人们很少笑，我对此很高兴。但是，当我在我管理的第一支球队签下第一个新员工后，我注意到了一些事情-人们开始嘲笑我所有的笑话。我被搞糊涂了。我并没有变得更有趣。我的同事们并没有变得更加坚忍。几周后，我突然意识到：这是因为我变得更强大了。我仍然不确定这到底有什么关系--我猜人们比以往任何时候都更关心与我保持良好的关系，所以如果这个笑话既聪明又无害，为什么不加入到笑声中来呢？起初，我很反感--这似乎是一种卑躬屈膝的粗暴表现--尽管我知道这些人谁也不会承认(甚至可能不相信)他们已经改变了自己的行为。后来我意识到，这并不是真的(或者，至少，只是)拍马屁。权力定义了什么是正常的-突然之间，我的幽默感向主流跌跌撞撞地走了一步，刚刚接近到可以让我们在午餐时都笑的东西。\n权力扭曲了责任。我经常去的部门有两个人会做出同样的问题行为，但只有一个人会经常因此而被叫出来。有时这是显而易见的事情，比如合并没有审查者的公关，有时是更微妙的事情，比如在会议上以高人一等的姿态与其他人交谈。一个人会当场面对，而另一个人可能会一言不发地逃脱。总是有理由的：“嗯，那个人是一名高级软件工程师”，或者，“我认为他的行为还不够糟糕，不足以挑起争执。”但更多时候，我开始注意到，与他们的待遇最相关的是他们在团队中的权力。当然，效果只能和那个人的力量一样持久；通常情况下，当那个人绊倒并失去一些感知到的力量时，一群手持干草叉的暴徒突然出现在他们周围。他们总是大吃一惊。我永远无法解释这一点--他们可能没有意识到别人对他们行为的感受，他们的批评者突然都选择了同一时间提出他们的抱怨。但权力扭曲了责任。这里有多个因素：很少有人想给有权势的人带来令人不快的反馈，有权势的人有时觉得不可战胜，可以忽略更多的批评而逍遥法外，最阴险的是，人们有时会微妙地调整他们对因果和责任的理解，将积极的结果归因于有权势的人，将消极的结果归因于不那么有权势的人。相比之下，我们似乎愿意给那些因自己的错误选择而跌跌撞撞的富人和有权势的人提供如此多的新机会，但我们喜欢憎恨穷人的问题，尽管所有明显的结构性因素都对他们不利。同样的事情也发生在公司里。\n权力扭曲了意义。对新获得的权力最大的迷失方向之一是，它可以改变你所做和所说的一切的意义。曾经你没有回复偶尔发来的“松弛”信息，是因为你头脑不集中，很忙，现在是因为你觉得自己太重要了，不会被打扰。**你的行为一点也没有改变，但是突然之间，人们认为你有了新的个性。“。一个例子是：一位同事曾经从一个特定小组的成员晋升为该小组的领导人。转换几周后，我要求她停止回复“+1”以松弛消息", "note_en": "I truly  want to be a big company person, but I am a generalist who gets bored easily, and the reality is that I love startups. It’s true that most things at most startups are perpetually on fire, but if you can accept that, there is a lot to like. One well-known one: at a fast-growing startup, a hard-working, talented person who has some support from company leadership* can often acquire an impressive title (or at least a lot of de facto power) very quickly.\n I’ve met a lot of people who have come to power this way with little or no management experience and sometimes not even much experience with the core responsibilities of their role. Everything is new, and having power itself is one more new thing. I first landed in that situation only a few years into my programming career, and I found it so disorienting. I could sometimes feel that, just as mass distorts the fabric of space time, power was reshaping everything around me, but I couldn’t see exactly how. Here are some things I wish I’d known at the time:\n Power bends taste. One of my favorite things in the world is when someone says something very funny and nobody laughs — maybe because it’s too niche and weird to admit that you got the joke, maybe because you’re on a conference call pretending to be listening and a coworker sent you a funny screenshot, maybe because you’re eavesdropping and trying to act like you’re minding your own business. Whatever the reason, I love watching people try not to laugh. I used to make a lot of jokes that were either so goofy or obscure that people rarely laughed, and I was happy with that. But after I signed my first new hire on the first team I managed, I noticed something — people started laughing at all my jokes. I was flummoxed. I hadn’t gotten funnier. My coworkers hadn’t become less stoic. A few weeks later, it hit me: it was because I had become more powerful. I’m still not sure exactly  why that mattered — I guess people cared more than ever about having a good relationship with me, so why not join in on the laughter if the joke was clever and harmless? At first, I was repelled — it seemed like a gross display of obsequiousness — even though I knew none of these people would admit (or probably even believe) they had changed their behavior. I realized later it wasn’t really (or, at least,  only) about sucking up. Power defines what’s normal — and suddenly my sense of humor had stumbled one tick toward the mainstream, just close enough to be something we could all laugh about at lunch.\n Power bends accountability. I’ve often been in departments where two people would perform the same problematic behavior, but only one person would regularly get called out for it. Sometimes it would be something obvious like merging PRs with no reviewer, and sometimes something more subtle like talking down to someone else in a meeting. One person would be confronted on the spot, while someone else might get away without a word. There are always justifications: “well, that person is a  senior software engineer,” or, “I didn’t think the behavior was bad enough to pick a fight about it.” But more often than not, I started to notice that the thing most strongly correlated to their treatment was their power on the team.     Of course, the effect is only as durable as that person’s power is; often, when that person stumbles and loses some perceived power, a mob with pitchforks suddenly appears around them. Invariably they are surprised. I could never explain it — both that they could be unaware of how others felt about their behavior, and that their critics suddenly all picked the same time to bring up their gripes. But power bends accountability. There are multiple factors here: few people want to give a powerful person unpleasant feedback, powerful people sometimes feel invincible and can get away with ignoring more criticism, and, most insidious of all, people sometimes make subtle adjustments to their understanding of cause, effect, and accountability to attribute positive outcomes to powerful people, and negative outcomes to less-powerful ones. Compare how we seem to be willing to give so many fresh chances to wealthy and powerful people who stumble due to their own bad choices, but we love to  hate on poor people for their problems despite all the obvious structural factors working against them. The same thing happens in companies.\n Power bends meaning. One of the greatest disorientations of newly acquired power is that it can change the meaning of everything you do and say. Where once you didn’t reply to the occasional Slack message because you were scatterbrained and busy, now it’s because you think you’re too important to be bothered.** Your behavior hasn’t changed at all, but all of a sudden people think you have a new personality. One example: a colleague was once promoted from being a member of a particular group to being its leader. A few weeks after the switch, I asked her to stop replying with “+1” to Slack messages in the group. In the past, this behavior had been a benign way to help the group build consensus. Now it had become a way to stifle debate and create new hierarchies within the group. She didn’t need to help build consensus anymore; as the leader of the group, her stated opinion was nearly enough to  be consensus. Tossing a +1 after someone else’s opinion went from putting a thumb on the scale to  standing on the scale, even though we were all typing the exact same things we had been a week before.\n Once I started watching for how newly-acquired power distorts the meanings of everything, I started seeing examples everywhere: it sometimes felt like my startup surroundings had the wavy hallucinatory quality of a mirage in the desert. To help organize my thoughts, I started abbreviating this phenomenon with a phrase:  power bends light.\n I thought I would need it mostly to deal fairly with the leaders on my team, and it helps there sometimes, but again and again, the person I continue to need it most for is myself. You often gain power from doing a good job, but power also makes you  feel like you are doing a good job — and it makes people around you less likely to tell you differently. When people tell me everything is great even though their faces say something else, when I apologize for something and they insist it was no big deal, when I suddenly get a raised eyebrow for doing something I’ve done 100 times before, I try to remember to ask myself, what’s my relationship to this person? Do I have power over them somehow? Is power bending light?", "posttime": "2020-05-09 08:31:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "折弯,bends", "title": "权力折弯灯光(2019)", "title_en": "Power Bends Light (2019)", "transed": 1, "url": "https://honkathon.com/2019-08-18-power-bends-light/", "via": "", "real_tags": ["折弯", "bends"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001345, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "是HTML规范所要求的，但是99%的浏览器会在没有提供的情况下为您补充一些内容。注意：我不会在生产网站上使用这个建议。但是为了快速开发，这里有一些技巧可以帮助我们进行me.--Here：*标记外的文本在现代浏览器中是可以接受的。**是HTML规范(但不是XHTML规范)所必需的。99%的浏览器不会在意你是否省略了它。创建它是为了向后兼容以前的HTML版本。对于最小的HTML5文档，您可以省略它。*，", "note_en": "is required by the HTML spec, but 99%of all browsers will make up something for you if it isn&#39;t supplied.Note: I wouldn&#39;t use this advice on production websites. But for quickdevelopment, here are some tips that help me.-------------------------------------------------------------------------------Here we go:* Text outside of tags is acceptable in modern browsers.*  *is* required by the HTML spec (but not the XHTML spec). 99% of browsers will not care if you omit it. It was created for backwards compatibility with prior HTML versions. You can omit it for minimal HTML5 documents.*  ,", "posttime": "2020-05-09 08:31:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生成,facts,规范", "title": "关于生成最小HTML的有趣事实", "title_en": "Fun Facts on Producing Minimal HTML", "transed": 1, "url": "https://blog.notryan.com/013.txt", "via": "", "real_tags": ["生成", "facts", "规范"]}, {"category": "", "categoryclass": "", "imagename": "ec35448b52580fef30c02c3cd178ddde.png", "infoid": 1001344, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "端到端加密(E2EE)的前提是客户端安全可信，您的终端设备安全可信，但网络和服务器不需要可信。您已经阅读了客户端中的所有代码，或者您信任的某个人已经为您这样做了。但是，在将代码加载到您的手机上--安装密钥库应用程序--并开始与您的朋友聊天之后，您仍然需要验证服务器是否向您发送了正确的加密密钥。因为您不能托管您自己的服务器，所以必须是Keybase，Inc.的服务器向您发送您朋友的加密密钥。\n对于E2EE软件来说，(客户端)代码是开放的，服务器向您发送加密密钥，您可以在带外检查加密密钥，这是E2EE软件的标准。在Signal中检查安全号码，在Wire中检查设备指纹，在Telegram中检查加密密钥。如果它们匹配，您就知道(基于开放客户端代码和它使用的密码)中间没有(Wo)man。\n爱丽丝和鲍勃共享一个对称加密密钥，他们通过将其加密到每个设备的公共加密密钥来传递给服务器。\n好的，我们要么验证对称密钥(在两部手机上相同)，要么验证公钥(我应该能够在我的手机上显示我的公钥，我的朋友会查询他们的手机认为我的公钥是什么，这应该是匹配的)。\n奇怪的是，没有按钮来做这两件事中的任何一件。文档里没有提到任何东西，我四处看看也找不到。“。\n所有密钥库设备在第一次提供时都会发布一个crypto_box公钥和一个crypto_sign公钥。这些密钥位于用户的签名链中[.]。聊天对称加密密钥是32个随机字节。它由聊天中的每个人共享，[.]。当新设备需要该共享密钥时，拥有该共享密钥的另一设备将使用新设备的公共CRYPTO_BOX密钥对其进行加密，然后将其上载到密钥库服务器。\n因此，如果我读对了这一点，当我的朋友与我打开新的聊天时，他们的客户端将生成共享密钥，它将从我的签名链内的crypto_box中获取公钥，并使用该公钥加密共享密钥，然后将结果上传到密钥库的服务器，以便我可以下载和解密它，从而建立共享密钥并开始聊天。\n..。但是这个签名链是从哪里来的呢？它必须从密钥库服务器获取，因此由于无法显示它，我必须信任服务器会给我发送正确的密钥。当他们宣称所有消息都是安全的、端到端加密的时，这又有什么意义呢？客户偶尔也会在聊天上方短暂地显示一个横幅，上面写着“端到端加密&#34；”。\n有关于如何一步一步进行验证的文档，但是除了指令被破坏之外(root_desc中没有sigs字段，这是root.json？hash=X的结果)，这不是我可以在我的手机上做的事情。恶意服务器可以向我的命令行客户端返回正确答案，同时告诉移动应用程序签名链包含完全不同的密钥(即恶意行为者用来执行MITM的密钥)。\n当与其他人谈论它时，他们会提到区块链这件事，因为它是安全的，而不需要自己验证任何东西，但我不知道它是如何工作的。\n密钥库聊天是否需要手动验证任何类型的密钥才能进行端到端加密，或者区块链数据(应用程序可以在幕后静默验证)是否以某种方式阻止了我们不得不比较指纹/密钥/图章链？\n如果我们确实需要比较指纹/密钥/图章链，那么如何在密钥库应用程序中做到这一点呢？\n最新消息：一位朋友将GitHub的问题联系了起来，基本上是说整个区块链的事情还不是这个应用程序做的。至于SPV是不是一个好的解决方案，目前还没有实现。如果我没记错的话，这就排除了第一个选择。\n由于这个应用程序似乎也不允许实现第二个选项(比较键)，我猜这得出的结论是目前在Keybase中没有实现E2EE？攻击很难成功：即使是恶意服务器(非常理想的位置)也必须从一开始就攻击MITM，因此他们必须事先知道目标是谁。但我们确实相信服务器是诚实的，至少在某些时候是这样。或者，我是否仍然缺少某种方法来实现真正的端到端加密？\n更新2：黑客新闻提到，这款应用程序应该自己检查第三方的证据。这并不完全是端到端加密的意思，因为它仍然依赖于第三方，但尽管如此，必须拥有两家或更多公司的服务器，才能窃取某人的密钥(另外还有豆腐密钥)，这应该会给人相当大的信心。然而，当检查Wireshark是否真的这样做时(向Twitter API请求证明字符串，并使用它从密钥库收到的公钥验证签名)，我手机上的密钥库根本没有联系Twitter。(然而，它确实自豪地宣布，新的聊天是端到端加密的。)。\n在数据包捕获之前，与其开始聊天的用户名从未键入测试系统(开始聊天的那个用户名)。\n这两个账户之前从未在任何设备上进行过任何形式的联系。他们也不会互相效仿。在聊天建立之前，对方甚至不知道我的用户名，所以他们也不可能触发任何事情。\n数据包捕获在用户名输入到测试设备的搜索字段之前开始，只有在密钥库完全建立聊天并声称它是端到端加密之后才结束。\nTwitter似乎将其所有服务都托管在自己的IP范围内，测试系统在聊天过程中与之交谈的IP都不在该范围内。如果此假设为假，并且密钥库客户端使用104.244.40.0/21之外的端点，请发表评论。我检查了所有的IP地址，都不太可能是Twitter的幌子(黑客新闻的细节)，但我想知道Twitter是否会在亚马逊网络服务(Amazon Web Services)或其他网站上发布推文。\n移动密钥库客户端简单地从密钥库上存在的所有用户下载了所有签名链，并且在开始数据包捕获之前检查了他们的所有证据，这被认为是不可信的。这是我唯一能想到如何在数据包捕获之前验证第三方托管的证据的方法。\n令人惊讶的是，通过密钥库访问远程方的公钥如此困难。使用EncryptedSend(www.cryptedsend.com)，可以很容易地访问远程方的公钥。-11mti2935。\n据我所知，答案是应用程序应该像你提到的那样自己检查第三方的证明，这就是允许你信任提供的密钥的原因。然而，可能会发生的情况是，它只验证一次或定期验证-如果它已经检查了您设备上的证明，则不会在每个新的聊天会话中再次检查。-CristianTM。\n@CristianTM我确保以前从来没有查过和我一起在手机上测试过的用户名，在声称聊天是安全的之前，它肯定没有检查过。请注意，黑客新闻帖子中记录了这一点。-*LUC。\n@CristianTM你看到帖子里的编辑了吗？我想这应该能澄清你的问题。如果没有，请告诉我。-*LUC\n看起来真的很奇怪。我认为这是一个为开发者或查看源代码的案例。但是，如果他们依赖于服务器端的校样检查或类似的东西，那么安全的期望在这里似乎就被打破了。-CristianTM。\n当您第一次与某人交谈时，它会从密钥库服务器下载他们的加密密钥，您必须信任服务器会向您发送正确的密钥。它还可以向您发送一个假密钥，这样您就可以使用恶意密钥来加密您的消息。没有办法在应用程序中验证这一点。\n在密钥库的情况下，公平地说，攻击很难成功，因为他们提供的检查可用，但它不是端到端加密，除非你想扩大定义，以包括信任服务器的密钥交换(再加上一点一厢情愿的想法，甚至有少数人曾经检查Merkle根包含他们的密钥，尽管关于如何检查的说明被打破，如问题所述)。\n如果要验证密钥库服务器没有执行任何类型的攻击，则必须使用命令行；这在官方应用程序中是不可能的。校样(推特校样、网站校样等)。似乎工作不可靠(如问题中所述)，但即使它们工作可靠，Keybase也会将聊天标记为E2EE，而不需要在您的帐户中提供任何第三方证据。如果不给我一个理由，我想我妈妈不会加证据的(也许即使到那时也不会，这是可以的，但是她不应该被误导去相信它比它实际上更安全)。所应用的密钥库机制通常称为豆腐：首次使用时信任。它只下载一次密钥，如果没有更改，它会认为一切正常。\n我同意。好在他们花了10万多美元给NCC集团的安全和密码学专家，让他们进行一次审计.。在他们的报告中从来没有提到过这个问题吗？(我还给其中一名审计师发了电子邮件，上面有这个问题的链接，但从来没有收到过确认收到的邮件。)。审计师确实发现了其他问题：\n[NCC发现的这两个]漏洞只有在我们的服务器恶意操作的情况下才能被利用。我们可以向你保证，他们不是，但你没有理由相信我们。这才是关键所在！\n只是我们必须相信他们，因为我们不能自己检查。\n不过，也许我没有给予Keybase足够的信任。我引用的博客正确地指责其他应用程序只接受和使用新的(可能是恶意的)密钥，而不需要用户输入。WhatsApp就是一个很好的例子：你最多只能打开警告，但WhatsApp客户端仍会很高兴地参与切换，在你发送消息时，攻击者会马上向你发送新的加密密钥，让他们知道至少一个明文，即使你非常小心，只在你看到密钥没有改变的时候才发送消息。但默认情况下，不会显示新的密钥通知，因此默认情况下它是机会性加密的。我认识的许多技术人员似乎都信任它，因为它使用信号协议，所以它一定很好。我希望密钥库应用程序能正确地做到这一点。虽然再次检查一下机制中是否没有任何缺陷可能是件好事，但我预计如果有缺陷，审计就会发现这一点，所以Keybase可能会做得很好。\n但是这个具体的问题现在已经没有意义了，因为Keybase已经被Zoom关闭了。我在等待Keybase要么解决这个问题并发布一个令人满意的答案，要么等待一个独立的人重新做我的分析并用他们的结论回答，或者等待Keybase承认他们欺骗了整个安全社区。一个叫贾里德的好心的陌生人就这个问题开了赏金，我把它贴到了黑客新闻上以吸引答案，希望也有一个人尝试过关键的验证。但现在这一切都不会发生，所以让我们从更广泛的角度来看这个问题背后的原因。\n用户应该要求有可遵循的说明。我们应该询问Keybase，现在是Zoom，以及任何提出强烈安全声明的人。他们认领了吗？您应该希望看到可以遵循的步骤来验证它。因为您信任已发布的代码，所以这些指令不应该涉及任何命令行编码工作，并且绝对不会有诸如验证笔记本电脑上的密钥和希望服务器将相同的密钥发送到您的手机这样的空白。\n举一个很好的例子，我讨厌这么说，Telegram的呼叫功能很好地解决了这一点。他们在屏幕上显示了四个表情符号，用于密钥验证。见鬼，这很有趣：在与我女朋友的通话中，我有时发现我们在随机进行验证，比较表情符号库的差异，或者取笑其中一个图标。我还没有研究过它的安全性，也许你需要五个表情符号才能达到128位以上的熵，但从用户体验的角度来看，这是一个很好的例子。Matrix对调用做了类似的事情，但(目前还没有)。\n黑客新闻(Hacker News)、Reddit、PrivacyTools(Keybase[提供]E2EE)上的技术社区，甚至连审计人员都忽视了这个纯粹的实际问题(总的来说，我相信他们的专业知识，在像Keybase或Zoom这样复杂的项目中，没有一项审计是真正完整的)。当我问问题时，人们都很敌视我，以为我是一个新手，不会读文档，不会弄清楚验证是如何进行的，而他们自己从来没有真正尝试过。保持更多的好奇心。当调用端到端加密时，密钥验证不应该很困难，因为最终用户必须能够验证它。虽然我妈妈可能需要信任某个人来检查代码，但我(或者像F-Droid这样的项目)可以独立编译二进制文件并将其交给她。但是，如果她希望这样做，她需要能够检查加密密钥。我们知道，即使是美国国家安全局也很难破解好的密码学，并称赞密钥库建立了好的密码学，但攻击者通过交换服务器响应来解决这个问题没有问题。\n点击“发布您的答案”，即表示您同意我们的服务条款、隐私政策和Cookie政策。\n不是你想要的答案吗？浏览标记的其他问题或提出您自己的问题。", "note_en": "The premise of end-to-end encryption (E2EE) is that the client is secure and trustworthy, your end devices is secure and trustworthy, but the network and server need not be trusted. You&#39;ve read all the code in the client, or someone you trust has done so for you. But after loading the code onto your phone -- installing the Keybase app -- and starting a chat with your friend, you still need to verify that the server sent you the right encryption key. Since you can&#39;t host your own server, it has to be the Keybase, Inc&#39;s server that sends you the encryption key of your friend.\n It&#39;s pretty standard for E2EE software that the (client) code is open, the server sends you the encryption key, and you can check the encryption keys out of band. In Signal you check the safety number, in Wire you check the device fingerprints, and in Telegram you check the encryption key. If they match, you know (based on the open client code and the cryptography it uses) that there is no (wo)man in the middle.\n  Alice and Bob share a symmetric encryption key, which they pass through the server by encrypting it to each of their devices&#39; public encryption keys.\n Okay, so either we verify the symmetric key (identical on both phones), or we verify the public key (I should be able to display mine on my phone, and my friend will call up what their phone thinks my public key is, and that should match).\n The weird thing is that there is no button to do either of this. The documentation doesn&#39;t mention any and I can&#39;t find it when looking around.\n  All Keybase devices publish a  crypto_box public key and a  crypto_sign public key when they&#39;re first provisioned. Those keys live in the user&#39;s signature chain [...] A chat symmetric encryption key is 32 random bytes. It&#39;s shared by everyone in the chat, [...] When a new device needs this shared key, another device that has it will encrypt it with the new device&#39;s public  crypto_box key and then upload it to the Keybase server.\n So if I&#39;m reading this right, when my friend opens a new chat with me, their client generates the shared secret, it will take the public key from the  crypto_box inside my signature chain and encrypt the shared secret with that public key, and upload the result to Keybase&#39;s server so that I can download and decrypt it, thereby establishing the shared secret and starting the chat.\n ... but where does that signature chain come from? This has to be fetched from Keybase servers, so since there is no way to display it, I have to trust the server to send me the right key. How does that make sense when they  claim &#34;all messages are secure, end-to-end encrypted&#34;? The client also occasionally and briefly displays a banner above the chat saying &#34;end-to-end encrypted&#34;.\n There is documentation about  how to do the verification step by step, but aside from that the instructions are broken (there is no  sigs field in  root_desc, the result of  root.json?hash=X), this is not something I can do on my phone. A malicious server could return the correct answers to my command line client while telling the mobile app that the signature chain contains an entirely different key (namely the one the malicious actor uses to perform the MitM).\n When talking about it to others, they mention this blockchain thing as the reason why it&#39;s secure without needing to verify anything yourself, but I can&#39;t figure out how it works.\n Do Keybase chats require any kind of key to be manually verified for end-to-end encryption, or does the blockchain data (which the app could verify silently under the hood) somehow prevent us from having to compare fingerprints/keys/sigchains?\n If we do need to compare fingerprints/keys/sigchains, how can that be done in the Keybase app?\n Update: A friend linked  this GitHub issue, where it is basically said that the whole blockchain thing isn&#39;t yet done by the app. Leaving in the middle whether (something like)  SPV is a good solution, it is currently not implemented. That strikes out the first option if I&#39;m not mistaken.\n Since the app also seems not to allow fulfilling the second option (comparing keys), I guess this concludes that there is no E2EE currently implemented in Keybase? An attack is hard to pull off: even a malicious server (very ideal position) would have to MitM from the start, so they have to have prior knowledge of whom to target. But we do  trust the server to be honest at least some of the time. Or am I still missing some way that makes this true end to end encryption?\n Update 2: It was  mentioned on hacker news that the app should check third party proofs by itself. This is not exactly what end to end encryption means since it still relies on third parties, but nevertheless, having to own 2 or more companies&#39; servers before being able to MitM someone&#39;s keys (which are additionally TOFU&#39;d) should give quite some confidence. However, when checking in Wireshark whether it actually does this (ask the Twitter API for the proof string and verify the signature with the the public key it received from Keybase), Keybase on my phone did not contact Twitter at all. (It did, however, proudly proclaim that the new chat was end to end encrypted.)\n  The username with whom a chat was started was never typed into the test system (the one that started the chat) prior to the packet capture.\n The two accounts never had any sort of contact before, on any device. They also don&#39;t follow each other. Until the chat was established, the other party did not even know my username, so they could not have triggered anything either.\n The packet capture started before the username was typed into the search field on the test device and ended only after Keybase completely established the chat and claimed it was end to end encrypted.\n Twitter seems to host all its services on its own IP range, and none of the IPs the test system talked to during chat establishment fell inside that range. If this assumption is false and the Keybase client uses endpoints outside of  104.244.40.0/21, please comment. I checked all IPs and all are implausible to be a front for Twitter (details on hacker news), but I would be interested to know if Twitter publishes tweets on Amazon Web Services&#39; Simple Storage Service or something.\n It is deemed implausible for the mobile Keybase client to simply have downloaded all signature chains from all users that exist on Keybase and to have checked all their proofs prior to starting the packet capture. This is the only way I can think of how the third party hosted proof could have been verified prior to the packet capture.\n  It&#39;s surprising that it&#39;s this difficult to access the remote party&#39;s public keys through Keybase. With EncryptedSend (www.encryptedsend.com) the remote party&#39;s public key is readily accessible.\r \r–  mti2935\n  The answer, as far as I understand, is that the app should check third party proofs by itself as you mentioned, and that is what allows you to trust the keys that are provided. What may be happening however is that it only verifies it once or periodically - if it already checked a proof on your device it will not check it again on each new chat session.\r \r–  CristianTM\n  @CristianTM I made sure to never have looked up the username with whom I tested on my phone before, it definitely didn&#39;t check before claiming the chat is secure. Do note that this is documented in the hacker news thread.\r \r–  Luc\n  @CristianTM Did you see the edit in the post? I think that should clarify your questions. Let me know if not.\r \r–  Luc\n  Looks really strange. I think its a case to take for the devs or look on the source code. But really an expectation of security seems to be broken here if they rely on server-side checking of proofs or something like this.\r \r–  CristianTM\n  The first time you talk to someone, it downloads their encryption key from the Keybase server and you have to trust the server to send you the right key. It could also send you a fake one such that you encrypt your messages using a malicious key instead. There is no way to verify this in the app.\n In Keybase&#39;s case, to be fair, the attack is hard to pull off due to the checks they made available, but it is not end-to-end encryption unless you want to broaden the definition to include trusting the server for the key exchange (combined with a bit of wishful thinking that there is even a minority of people that ever checked the Merkle root for inclusion of their key despite that the instructions on how to check were broken, as noted in the question).\n If you want to verify that the Keybase server is not performing any kind of attack, you will have to use the command line; it is not possible in the official application. The &#34;proofs&#34; (Twitter proof, website proof, etc.) did not seem to work reliably (as described in the question), but even if they did, Keybase also labeled chats as E2EE without requiring any third party proof to be in your account. And I don&#39;t think my mom would add proofs if not given a reason why (and perhaps not even then, which is okay, but then she shouldn&#39;t be lead to believe it&#39;s more secure than it is). The mechanism Keybase applied is commonly called TOFU: trust on first use. It downloads the keys one time, and if it doesn&#39;t change, it assumes everything is fine.\n   I agree. Good thing they paid over $100 000 to NCC Group&#39;s security and cryptography experts to have an audit which... never mentioned this issue in  their report? (I also emailed one of the auditors with a link to this question, but never got so much as an acknowledgement of receipt.) The auditors did find other issues:\n [The two] bugs [found by NCC] were only exploitable if our servers were acting maliciously. We can assure you they weren&#39;t, but you have no reason to believe us.  That&#39;s the whole point!\n Except that we do have to believe them, because we can&#39;t just check for ourselves.\n Perhaps I am not giving Keybase enough credit, though. The blog I quoted from rightly accuses other apps of just accepting and using new (potentially malicious) keys without requiring input from the user. WhatsApp is a prime example: the best you can do is turn on warnings, but the WhatsApp client will still happily participate in a switcharoo where the attacker sends you a new encryption key right when you send a message, allowing them to learn of at least one plaintext even if you are super careful and only send messages when you saw the key didn&#39;t change. But by default, no new key notices are shown, so it&#39;s opportunistically encrypted by default. Many tech people I know seem to trust it because it uses the Signal protocol and so it must be good. I expect the Keybase app does this properly. While it might be good to check again if there aren&#39;t any flaws in the mechanism, this is the kind of thing I expect an audit  would have revealed if it were there, so Keybase probably does that fine.\n But this specific question is moot now that Keybase is being shut down by Zoom. I was kind of waiting for Keybase to either fix this issue and post a happy answer, for an independent person to re-do my analysis and answer with their conclusion, or for Keybase to acknowledge that they&#39;ve had the whole security community fooled. A kind stranger called  Jared opened a bounty on this question and I posted it to Hacker News to attract an answer, hoping there existed a single person who had attempted the key verification as well. But none of that will happen now, so let&#39;s look at the broader perspective, the reason behind this question.\n Users should have demanded followable instructions. We should have questioned Keybase, now Zoom, and anyone who makes a strong security claim. They claim it? You should want to see steps  you can follow to verify it. Since you put your trust in the published code, those instructions should not involve any command line coding work, and definitely not have gaps like verifying keys on your laptop and hoping that the server sent the same keys to your phone.\n To give one good example, and I hate to say it, Telegram&#39;s calling feature nailed this. They  show four emojis on the screen for key verification. Heck, it&#39;s fun: in calls with my girlfriend I sometimes find us doing the verification randomly, comparing emoji library differences or making fun of one of the icons. I haven&#39;t looked into its security, maybe you&#39;d need five emojis to get above 128 bits of entropy or whatever, but from a UX perspective, this is a great example.  Matrix does something similar but not (yet) for calls.\n The tech communities on Hacker News, Reddit, PrivacyTools (&#34; Keybase [provides] E2EE.&#34;), even the auditors overlooked this purely practical issue (and I do trust their expertise in general, no audit is ever really complete in a project as complex as Keybase&#39;s or Zoom&#39;s). People were hostile when I asked questions, assuming I was a noob who couldn&#39;t read the docs and figure out how the verification worked when they never actually tried it themselves. Be more curious. Key verification should not be hard when it is called &#34;end to end encryption&#34; because the end users have to be able to verify it. While my mom may have to trust someone to have checked the code, I (or a project like F-Droid) can compile the binary independently and give it to her. However, the encryption key is something she  needs to be able to check if she wishes to do so. We know that even the NSA has trouble breaking good cryptography, and kudos to Keybase for building good cryptography, but attackers have no trouble working around it by swapping out server responses.\n    By clicking “Post Your Answer”, you agree to our  terms of service,  privacy policy and  cookie policy\n  Not the answer you&#39;re looking for? Browse other questions tagged         or  ask your own question.", "posttime": "2020-05-09 08:16:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,app,密钥,chat", "title": "密钥库在应用程序中的聊天从未经过可验证的端到端加密", "title_en": "Keybase's chat in the app was never verifiably end-to-end encrypted", "transed": 1, "url": "https://security.stackexchange.com/a/231344/10863", "via": "", "real_tags": ["程序", "app", "密钥", "chat"]}, {"category": "", "categoryclass": "", "imagename": "cb8e00ebe19434fb550ae5081cac6875.jpg", "infoid": 1001343, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "领导一项研究的艾伯塔省一位研究人员说，大麻提取物在使人们对这种新型冠状病毒更具抵抗力方面显示出潜力。\n生物科学家伊戈尔·科瓦尔丘克(Igor Kovalchuk)博士说，在筛选了400种大麻菌株后，莱斯布里奇大学(University Of Lethbridge)的研究人员正专注于大约12种大麻菌株，这些菌株在确保这种潜在致命病毒生根的肥沃土壤方面取得了令人振奋的结果。\n科瓦尔丘克说：“他们中的一些人已经将这些(病毒)受体的数量减少了73%，它进入的机会要低得多。”\n“如果他们能减少受体的数量，感染的几率就会小得多。”\n利用过去三个月的大麻毒株，研究人员说，大麻成分THC和CBD之间的有效平衡-后者通常与医疗用途有关-在阻止新型冠状病毒方面仍不清楚。\n科瓦尔丘克说：“需要很长时间才能找到有效成分是什么--可能有很多。”他的Pathway RX部分归老牌大麻生产商Sunial Growers所有，并与艾伯塔省的大麻研究人员Swysh合作。\n但他补充说，通常情况下，最有希望的是高CBD含量的抗炎特性。\n科瓦尔丘克说：“我们更关注高CBD，因为人们可以服用更高剂量，而不会受到损害。”\n根据加拿大卫生部的许可，这项使用人造人体3-D组织模型的研究一直在寻找方法，以阻止这种高传染性的新型冠状病毒在肺部、肠道和口腔中找到宿主。\n科瓦尔丘克说，如果成功，这项工作可能会在漱口、漱口、吸入剂或凝胶帽等方面找到实际的医疗用途。\n“这对人们来说会更便宜，副作用也会少得多，”他说。\n但科瓦尔丘克说，缺乏临床试验仍然是一个障碍，来自资金日益紧张的大麻行业的资金并不能推动这一点。\n他说：“我们有愿意与我们合作的临床医生，但对于许多从事大麻业务的公司来说，这是他们负担不起的大量现金。”\n这位科学家强调，这些发现不会导致疫苗-某种“不那么具体和精确”的东西，但尽管如此，它仍然是另一种可能的对抗冠状病毒的武器。\n科瓦尔丘克说：“我们最成功和最新颖的高CBD-C丰度品系的提取物有待进一步研究，可能会成为治疗冠状病毒的有用和安全的补充，作为一种辅助疗法。”\n“鉴于目前可怕和迅速演变的流行病学情况，必须考虑每一个可能的治疗机会和途径。”\n以色列研究人员已经开始对CBD进行临床试验，作为一种治疗方法，利用其抗炎能力修复被冠状病毒破坏的细胞。\n据认为，CBD可以增强类固醇治疗危及生命的患者的传统疗效，并增强免疫系统。\n这位密歇根大学的科学家说，这类研究和他自己的研究值得加拿大政府支持，加拿大联邦政府已经承诺为冠状病毒研究提供11亿美元的资金。\n他说：“我们的工作可能会产生巨大影响--有潜力将感染降低70%至80%的药物并不多。”\n邮政媒体致力于保持一个活泼而文明的讨论论坛，并鼓励所有读者分享他们对我们文章的看法。评论可能需要长达一个小时的审核时间才能出现在网站上。我们要求您保持相关和尊重您的评论。我们已经启用了电子邮件通知-如果您收到对您的评论的回复、您关注的评论帖子有更新，或者如果用户关注您的评论，您现在将收到一封电子邮件。有关如何调整您的电子邮件设置的更多信息和详细信息，请访问我们的社区指南。", "note_en": "Cannabis extracts are showing potential in making people more resistant to the novel coronavirus, says an Alberta researcher leading a study.\n After sifting through 400 cannabis strains, researchers at the University of Lethbridge are concentrating on about a dozen that show promising results in ensuring less fertile ground for the potentially lethal virus to take root, said biological scientist Dr. Igor Kovalchuk.\n  “A number of them have reduced the number of these (virus) receptors by 73 per cent, the chance of it getting in is much lower,” said Kovalchuk.\n “If they can reduce the number of receptors, there’s much less chance of getting infected.”\n Employing cannabis sativa strains over the past three months, the researcher said the effective balance between cannabis components THC and CBD — the latter more typically associated with medical use — is still unclear in blocking the novel coronavirus.\n  “It will take a long time to find what the active ingredient is — there may be many,” said Kovalchuk, whose Pathway RX is owned partly by Olds-based licensed cannabis producer Sundial Growers and partnered with Alberta cannabis researcher Swysh.\n But it’s generally the anti-inflammatory properties of high-CBD content that have shown most promise, he added.\n “We focus more on the higher CBD because people can take higher doses and not be impaired,” said Kovalchuk.\n The study under Health Canada licence using artificial human 3-D tissue models has been seeking ways to hinder the highly contagious novel coronavirus from finding a host in the lungs, intestines, and oral cavity.\n  If successful, the work could find practical medical use in the form of mouth wash, gargle, inhalants or gel caps, said Kovalchuk.\n “It would be cheaper for people and have a lot less side-effects,” he said.\n But the absence of clinical trials remains a barrier, and funding from an increasingly cash-strapped cannabis industry isn’t there to fuel that, said Kovalchuk.\n “We have clinicians who are willing to work with us but for a lot of companies in the cannabis business, it’s significant cash that they can’t afford,” he said.\n The scientist emphasized the findings wouldn’t lead to a vaccine — something “less specific and precise” but nonetheless another possible weapon against COVID-19.\n  “The extracts of our most successful and novel high CBD C sativa lines, pending further investigation, may become a useful and safe addition to the treatment of COVID-19 as an adjunct therapy,” said Kovalchuk.\n “Given the current dire and rapidly evolving epidemiological situation, every possible therapeutic opportunity and avenue must be considered.”\n Israeli researchers have begun clinical trials of CBD as a treatment to repair cells damaged by COVID-19 by using its anti-inflammatory abilities.\n It’s thought CBD could enhance the traditional effect of steroids in such treatment of patients in life-threatening condition and also bolster the immune system.\n It’s the kind of research and his own that deserves government support in Canada, whose federal government has pledged $1.1 billion in funding for COVID-19 research said the U of L scientist.\n “Our work could have a huge influence — there aren’t many drugs that have the potential of reducing infection by 70 to 80 per cent,” he said.\n Postmedia is committed to maintaining a lively but civil forum for discussion and encourage all readers to share their views on our articles. Comments may take up to an hour for moderation before appearing on the site. We ask you to keep your comments relevant and respectful. We have enabled email notifications—you will now receive an email if you receive a reply to your comment, there is an update to a comment thread you follow or if a user you follow comments. Visit our  Community Guidelines for more information and details on how to adjust your  email settings.", "posttime": "2020-05-09 08:14:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,coronavirus,病毒,显示,shows", "title": "大麻显示出阻止冠状病毒感染的希望：艾伯塔省研究人员", "title_en": "Cannabis shows promise blocking coronavirus infection: Alberta researcher", "transed": 1, "url": "https://calgaryherald.com/cannabis/cannabis-shows-promise-blocking-coronavirus-infection-alberta-researcher/", "via": "", "real_tags": ["冠状病毒", "病毒", "显示", "shows"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001341, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我的团队正在广场建造一个通用的Kubernetes集群。作为扩展的一部分，我们实施了Pod安全策略(PSP)来保护我们的群集免受许多容器逃逸风险。\n这篇文章的重点是如何全面部署Pod安全策略，并锁定所有内容，以及如何授予例外。有关PSP的介绍，请阅读Kubernetes PSP官方文档。官方文档很好地展示了如何使用一个简单的PSP示例，但是没有描述一个功能齐全的PSP系统将如何工作，它将如何在默认情况下应用，以及如何管理异常。这篇帖子就是为了帮助填补这一空白而写的。最后，我们将讨论您在实施PSP时可能遇到的几个陷阱，并讨论一些故障排除策略。\nKubernetes是一个非常强大和复杂的工具；然而，这在社区内导致了几个安全问题。大多数库伯内斯的安全故障可分为两大阵营：\n利用PSP的所有功能可以显著增加容器逃逸的难度，从而缩小第一个主要攻击载体。PSP不是灵丹妙药(什么都不是)，但它们是保护集群和工作负载的强大工具。\n注：以上是对复杂主题的简化。有关更多信息，微软最近发布了针对Kubernetes的攻击矩阵。PSP允许您限制31个挑战中的9个。\n这篇文章中演示的PSP可以在以后的版本中使用，但是您应该仔细阅读官方文档，以确保列举了所有可用的控件。\n为了简化异常管理，本文中的PSP示例在语法中只采用了很少的快捷方式，并显式列举了所有功能/权限。例如：对于requidDropCapability，我们提到了每种功能，而不是使用&#34；ALL&#34；。\n本文中的PSP避免AppArmor和SELinux管理，因为这两个主题本身都是博客文章系列，只提到存根。\n-api版本：策略/v1beta1Kind：PodSecurityPolicyMetadata：注释：kubernetes.io/Description：&#39；所有标准用例的受限psp&#39；seccomp.security.alpha.kubernetes.io/allowedProfileNames：停靠器/默认seccomp.security.alpha.kubernetes.io/defaultProfileName：停靠器/默认名称：restrictedspec：#alloweCapability：#-NET_BIND_SERVICE#如果工作负载需要低端口，则使用#-NET_BIND_SERVICE#。但默认情况下，它已注释掉#alloweHostPath：#-path Prefix：&#34；/ome/path&#34；#如何允许特定主机路径的示例#readOnly：true allowPrivilegeEscalation：false#禁止将权限提升到允许的任何特殊功能Procmount Types：#不允许完全/proc装载，仅允许&#34；默认值&#34；掩码/proc-default fsGroup：#不允许根fsGroups进行卷装载规则：MustRunAs范围：-max：65535分钟：1主机Ipc：False#不允许共享主机ipc命名空间主机网络：FALSE#不允许主机联网主机PID：FALSE#不允许共享主机进程ID命名空间主机端口：#不允许低位主机端口(这似乎只适用于EKS上的eth0)-最大：65535分钟：1025特权：FALSE#不允许特权POST。quiredDropCapability：#删除Linux内核中的所有权限-AUDIT_CONTROL-AUDIT_READ-WRITE-BLOCK_SUSPEND-CHOWN-DAC_OVERRIDE-DAC_READ_SEARCH-FOWNER-FSETID-IPC_LOCK-IPC_OWNER-KILL-LE-LINUX_IMMOTABLE-MAC_ADMIN-MAC_OVERRIDE-MKNOD-NET_ADMIN-NET_BIND_SERVICE-NET_BROADOAD-NET_RAW-SETGID-SETFCAR。sys_ptrace-SYS_RAWIO-SYS_RESOURCE-SYS_TIME-SYS_TTY_CONFIG-SYSLOG-WAKE_ALARM runAsGroup：#不允许Pod的GID 0(块根组)规则：MustRunAs范围：-max：65535分钟：1 RunAsUser：#不允许Pod的UID 0规则：MustRunAsNonRoot seLinux：#利用SELinux规则：RunAsAny补充组：#限制补充。emptyDir-Projected-Secret#-hostPath#默认情况下不允许使用主机路径。#-sistentVolumeClaim#如果使用statefulsets，你&#39；我需要这件。\n注意：您可以在此处找到所有Kubernetes卷类型的列表。您可能需要不同的卷列表，只是要小心使用它们。\n然后，您必须确保所有用户都可以访问PSP。要理智地做到这一点，您需要授予所有用户对最严格的PSP的访问权限。\n我们将这个受限的PSP授予System：Authenticated组，而不是枚举所有用户(这可能最终导致在启用PSP之后添加的丢失用户)。如果用户缺乏更明确的权限，则SYSTEM：AUTHENTED组是所有通过身份验证的用户的备用组。\n注意：如果您允许未经身份验证的用户部署工作负载，则PSP可能不足以满足您的问题空间。但是，我要注意的是，确实存在System：UnAuthenticated组。\n要附加此PSP访问，需要ClusterRole授予权限，并将ClusterRoleBinding绑定到SYSTEM：AUTHENTIZED组。ClusterRole和ClusterRoleBinding用于启用PSP访问，因为我们希望将此限制应用于群集中所有经过身份验证的用户。此ClusterRole用法不会取代限制用户功能(如创建Pod或部署)的其他现有RBAC策略。\n-apiVersion：rbac.authization.k8s.io/v1Kind：ClusterRolemetadata：labels：eks.amazonaws.com/component：pod-security-policy kubernetes.io/cluster-service：&#34；true&#34；名称：PSP-受限规则：-apiGroups：-policy resource名称：-受限资源：-podsecuritypolicy谓词：-use-api版本：rbac.authization.k8s.io/v1Kind：ClusterRoleBindingMetadata：注释：kubernetes.io/Description：绑定到系统的限制性PSP：已通过身份验证以覆盖所有用户标签：eks.amazonaws.com/component：pod-security-policy kubernet.com/component：pod-security-policy kubernet。名称：psp-restrictedroleRef：apiGroup：rbac.authization.k8s.io Kind：群集角色名称：PSP-RestrictedSubjects：-apiGroup：rbac.authization.k8s.io Kind：组名：系统：已验证。\n监控节点和工作负载？它可能需要一些特殊的主机挂载，以及可怕的/var/run/docker.sock\n最后，每个异常都需要四样东西：一个自定义PSP、一个ServiceAccount、一个角色或ClusterRole，以及一个RoleBinding或ClusterRoleBinding。\n如果您的用例仅在单个命名空间中创建工作负载，则可以使用角色/角色绑定。如果您的异常用例将在几个名称空间中重用给定的PSP，您可以为每个名称空间使用一个ClusterRole和一个服务帐户/RoleBinding。或者，每个NS可以有一个ServiceAccount和一个ClusterRole和ClusterRoleBinding，后者提到所有ServiceAccount。\n我确定的模式是PSP、集群角色和绑定到它的角色。这具有将所有与PSP相关的群集角色保持在一起以进行审核的优点。使用到ClusterRole的RoleBinding还将PSP异常限制为单个命名空间中的工作负载。\n下面显示了一个涵盖fluentd DaemonSet(fluentd将日志消息导出到其最终目标)的PSP异常示例，因为与限制性的默认PSP相比，它需要大量的异常：\n-api版本：策略/v1beta1种类：PodSecurityPolicyMetadata：注释：kubernetes.io/Description：&#39；针对Fluentd-&gt；Fluentd&#39；seccomp.security.alpha.kubernetes.io/allowedProfileNames：扩展坞/默认seccomp.security.alpha.kubernetes.io/defaultProfileName：扩展坞/默认名称：fluentd-fluentdspec：#alloweCapability：#-NET_BIND_SERVICE#在工作负载需要低端口时有用。但默认情况下，允许将其注释掉HostPath：-path Prefix：&#34；/run/fluentd/data&#34；#Exception：Fluentd需要一个主机持久位置来存储状态readOnly：false-path Prefix：&#34；/var/lib/docker/Containers&#34；#Exception：Fluentd需要具有对码头容器日志ReadOnly：true-path Prefix：&#34；/var/log&#34；的读取权限。#Exception：fluentd需要主机日志的读取权限只读：true allowPrivilegeEscalation：true#Exception：fluentd需要root用户才能读取允许的日志Procmount类型：#禁止完全/proc装载，只允许&#34；默认值&#34；MASTED/PROC-Default fsGroup：#Exception：Fluentd以特权身份运行，因此需要fsGroup 65535规则：MustRunAs范围：-max：1025min：0 hostIpc：FALSE#不允许共享主机ipc命名空间hostNetwork：FALSE#不允许共享主机联网主机PID：FALSE#不允许共享主机进程ID命名空间hostPort：#不允许低位主机端口(这似乎只适用于EKS上的eth0)-max：1025min：65535特权：TRUE#EXCEPTION。quiredDropCapability：#删除Linux内核中的所有权限-AUDIT_CONTROL-AUDIT_READ-WRITE-BLOCK_SUSPEND-CHOWN-DAC_OVERRIDE-DAC_READ_SEARCH-FOWNER-FSETID-IPC_LOCK-IPC_OWNER-KILL-LE-LINUX_IMMOTABLE-MAC_ADMIN-MAC_OVERRIDE-MKNOD-NET_ADMIN-NET_BROADIO-NET_RAW-SETGID-SETFCAP-SETPCAP。RAWIO-SYS_RESOURCE-SYS_TIME-SYS_TTY_CONFIG-SYSLOG-WAKE_ALARM runAsGroup：#Exception：Fluentd以特权身份运行，因此需要GID 0规则：MustRunAs范围：-max：65535分钟：0运行方式用户：规则：MustRunAs#Exception：Fluentd以特权身份运行，因此需要UID 0范围：-max：65535分钟：0 seLinux：#适用于SELinux的工具规则：RunAs任何补充组：#Exception：Fluentd以特权身份运行，因此需要GID 0规则：MustRunAs范围：-max：65535分钟：0卷。你&#39；我需要这件。\n注意：每个异常都以YAML注释的形式调用，并带有单词&#34；异常&#34；。这种做法使您可以在管理异常的代码中轻松跟踪异常，并使审计师在他们来访时感到高兴。\n注意2：这与限制性PSP的布局相同，以便于使用要验证的风格工具。\n为了允许Fluentd使用上面的PSP，我们有这个ClusterRole和RoleBinding：\n-api版本：rbac.Authization.k8s.io/v1Kind：ClusterRolemetadata：Labels：eks.amazonaws.com/Component：pod-security-policy kubernetes.io/cluster-service：&#34；true&#34；名称：psp-fluentd-fluentd#为策略api组命名：-psp-&lt；namespace&gt；-&lt；serviceaccount&gt；rules：-资源名称：-fluentd-fluentd资源：-podsecuritypolicy谓词：-Use。为fluentd-&gt；fluentd&#39；量身定做的PSP标签：eks.amazonaws.com/component：pod-security-policy kubernetes.io/cluster-service：&#34；true&#34；名称：psp-fluentd-fluentd命名空间：fluentdroleRef：apiGroup：rbac.Authization.k8s.io Kind：ClusterRole名称：psp-fluentd-fluentdSubjects：-Kind：Servic。\n要使用此PSP，DaemonSet只需在其Pod规范中指定serviceAccountName：fluentd，并在fluentd命名空间中运行以利用RoleBinding。\n上面的流畅工作负载将可以访问两个不同的PSP.。这是怎么运作的？\nPSP准入控制器按字母顺序对所有允许的PSP运行给定的PSP。使用允许工作负载的第一个PSP。人们似乎会纠结于按字母顺序排列，但实际上这没什么大不了的。此框架中的工作负载将可以访问一个或两个PSP：完全受限的PSP，也可能是特殊的PSP。首先评估哪一个并不重要，因为PSP是在一个单独的策略中处理的，如果只有一个策略允许该工作，它就会进入模式。如果存在完全受限的PSP，则其工作方式实际上类似于默认拒绝防火墙策略。\n如果没有PSP允许该工作负载，您将看到一个Kubernetes事件，该事件显示工作负载针对其拥有访问权限的每个PSP所具有的所有错误的并集。这使得故障排除相当痛苦。\n缺点是，当工作负荷使所有可用的PSP失效时，几乎没有提供有用的信息。\n警告失败创建1s(3s上的x2)后台启动-控制器(由类似事件组合而成)：创建错误：Pod&#34；fluentd-4mqhj&#34；被禁止：无法根据任何Pod安全策略进行验证：[]。\n我用来帮助分类这些问题的一个策略是临时kubectl删除PSP限制，这样我就只能看到异常试图利用的实际PSP中的错误。显然，此测试将中断正在运行的群集的新工作负载(无PSP？没有启动)，因此我们建议在非生产环境中进行此类分类。\n到目前为止，我们在启用PSP时遇到的最大挑战是围绕着我们变异的准入控制器。\n在幕后，Kubernetes准入控制器(包括PSP)具有复杂的优先级层次结构，导致PSP运行两次。以下是网络挂钩的订购顺序：\n内置变异WebHooks：POD安全策略变异WebHook在此处运行，以根据确定最适用的PSP修改POD默认值。\n内置验证WebHooks：Pod Security Policies验证WebHook在此处运行，以验证Pod对象是否仍符合PSP要求。\n总而言之，上面的设置是合理的，可能也是启用所有这些不同的WebHook功能的唯一方法。然而，它几乎没有记录在案(除非你偶然发现了正确的GitHub问题，比如istio上的这个问题)。更糟糕的是，PSP准入控制器的验证版本产生的错误消息为零，因此您是在盲目地对其进行故障排除。\n最后，如果您有一个变异的准入控制器，您需要确保它的突变对于集群中限制最严格的PSP是完全安全的。而且这个验证可能会很繁琐(对我们来说是这样)，所以我们才会写这本指南。", "note_en": "My team is building a general purpose kubernetes cluster at Square. As a part of that build out, we implemented Pod Security Policies (PSPs) to protect our clusters from many container escape risks.\n This post is focused on how to do a full deployment of Pod Security Policies with everything locked down and how to grant exceptions. For an introduction to PSPs, please go read the  Official Kubernetes PSP documentation. The official documentation does a good job of showing how to use a simple PSP example, however fails in describing how a fully functioning PSP system would work, how it would be applied by default, and how exceptions could be managed. This post was written to help fill that gap. At the end, we will discuss several pitfalls you might run into while implementing PSPs, and discuss some troubleshooting tactics.\n  Kubernetes is a very powerful and complicated tool; however, this has led to several security issues within the community. Most kubernetes security failures fall into two broad camps:\n  Leveraging all the capabilities of PSPs allow you to dramatically increase the difficulty of a container escape, which shrinks the first major attack vector. PSPs are not a silver bullet (nothing is), but they are a powerful tool to protect your clusters and workloads.\n NOTE: the above is a simplification of a complex topic. For more information, Microsoft recently released an  Attack Matrix for Kubernetes. PSPs allow you to restrict 9 of those 31 challenges.\n   PSPs demonstrated in this post will work with later versions, but you should go through the official docs to ensureall available controls are enumerated.\n In an effort to simplify exception management, the PSP examples in this post take very few &#34;shortcuts&#34; in theirsyntax and explicitly enumerate all capabilities/permissions. Example: for  requiredDropCapabilities we mentionevery capability rather than using &#34;all&#34;.\n The PSPs found in this post avoid AppArmor and SELinux management as either topic is a blog post series unto itself.Only the stubs are mentioned.\n  ---apiVersion: policy/v1beta1kind: PodSecurityPolicymetadata: annotations: kubernetes.io/description: &#39;restricted psp for all standard use-cases&#39; seccomp.security.alpha.kubernetes.io/allowedProfileNames: docker/default seccomp.security.alpha.kubernetes.io/defaultProfileName: docker/default name: restrictedspec:# allowedCapabilities:# - NET_BIND_SERVICE # useful if a workload needs a low port. but by default it&#39;s commented out# allowedHostPaths:# - pathPrefix: &#34;/some/path&#34; # Example of how to allow a specific host path# readOnly: true allowPrivilegeEscalation: false # Disallow privilege escalation to any special capabilities allowedProcMountTypes: # Disallow full /proc mounts, only allow the &#34;default&#34; masked /proc - Default fsGroup: # disallow root fsGroups for volume mounts rule: MustRunAs ranges: - max: 65535 min: 1 hostIPC: false # disallow sharing the host IPC namespace hostNetwork: false # disallow host networking hostPID: false # disallow sharing the host process ID namespace hostPorts: # disallow low host ports (this seems to only apply to eth0 on EKS) - max: 65535 min: 1025 privileged: false # disallow privileged pods readOnlyRootFilesystem: true # change default from &#39;false&#39; to &#39;true&#39; requiredDropCapabilities: # Drop all privileges in the Linux kernel - AUDIT_CONTROL - AUDIT_READ - AUDIT_WRITE - BLOCK_SUSPEND - CHOWN - DAC_OVERRIDE - DAC_READ_SEARCH - FOWNER - FSETID - IPC_LOCK - IPC_OWNER - KILL - LEASE - LINUX_IMMUTABLE - MAC_ADMIN - MAC_OVERRIDE - MKNOD - NET_ADMIN - NET_BIND_SERVICE - NET_BROADCAST - NET_RAW - SETGID - SETFCAP - SETPCAP - SETUID - SYS_ADMIN - SYS_BOOT - SYS_CHROOT - SYS_MODULE - SYS_NICE - SYS_PACCT - SYS_PTRACE - SYS_RAWIO - SYS_RESOURCE - SYS_TIME - SYS_TTY_CONFIG - SYSLOG - WAKE_ALARM runAsGroup: # disallow GID 0 for pods (block root group) rule: MustRunAs ranges: - max: 65535 min: 1 runAsUser: # disallow UID 0 for pods rule: MustRunAsNonRoot seLinux: # Harness for SELinux rule: RunAsAny supplementalGroups: # restrict supplemental GIDs to be non-zero (non-root) rule: MustRunAs ranges: - max: 65535 min: 1 volumes: # allow only these volume types - configMap - downwardAPI - emptyDir - projected - secret# - hostPath # Host paths are disallowed by default.# - persistentVolumeClaim # If you use statefulsets, you&#39;ll need this one.\n NOTE: Here you can find a  list of all kubernetes volume types. You may require a different volume list, just be careful with them.\n   Then you must ensure that all users have access to a PSP. To do that sanely, you grant all users access to the most restrictive PSP.\n Instead of enumerating all users, which could end up missing users added after PSPs are enabled, we grant this restrictive PSP to the  system:authenticated group. The  system:authenticated group is the fallback group for all authenticated users if the user lacks more explicit permissions.\n NOTE: if you are allowing unauthenticated users to deploy workloads, PSPs might not be sufficient to your problem space. However, I will note that a  system:unauthenticated group does exist.\n Attaching this PSP access requires a ClusterRole to grant the permissions and a ClusterRoleBinding to the  system:authenticated group. A ClusterRole and ClusterRoleBinding are used to enable PSP access as we want this restriction to apply to all authenticated users in the cluster. This ClusterRole usage does not supersede other existing RBAC policies limiting user capabilities like creating pods or deployments.\n ---apiVersion: rbac.authorization.k8s.io/v1kind: ClusterRolemetadata: labels: eks.amazonaws.com/component: pod-security-policy kubernetes.io/cluster-service: &#34;true&#34; name: psp-restrictedrules:- apiGroups: - policy resourceNames: - restricted resources: - podsecuritypolicies verbs: - use---apiVersion: rbac.authorization.k8s.io/v1kind: ClusterRoleBindingmetadata: annotations: kubernetes.io/description: Restrictive PSP bound to system:authenticated to cover all users labels: eks.amazonaws.com/component: pod-security-policy kubernetes.io/cluster-service: &#34;true&#34; name: psp-restrictedroleRef: apiGroup: rbac.authorization.k8s.io kind: ClusterRole name: psp-restrictedsubjects: - apiGroup: rbac.authorization.k8s.io kind: Group name: system:authenticated\n   Monitoring nodes and workloads? It will probably need some special host mounts, and the dreaded /var/run/docker.sock\n  In the end you&#39;ll need four things for each exception: a custom PSP, a ServiceAccount, either a Role or ClusterRole, and either a RoleBinding or ClusterRoleBinding.\n If your use-case only makes workloads in a single namespace, you can use a Role/RoleBinding. If your exception use-case will reuse a given PSP in a few namespaces, you could use a ClusterRole, and a service account/RoleBinding per namespace. Or you could have one ServiceAccount per NS and a ClusterRole and ClusterRoleBinding which mentions all the ServiceAccounts.\n The pattern I&#39;ve settled on is a PSP, a ClusterRole and a RoleBinding to it. This has the advantage of keeping all the PSP related cluster roles together for auditing purposes. Using a RoleBinding to a ClusterRole also restricts the PSP exceptions to workloads in a single namespace.\n The following shows an example of a PSP exception which covers a fluentd DaemonSet (fluentd exports log messages to their final destination) as it needs a significant number of exceptions compared to the restrictive default PSP:\n ---apiVersion: policy/v1beta1kind: PodSecurityPolicymetadata: annotations: kubernetes.io/description: &#39;tailored PSP for fluentd-&gt;fluentd&#39; seccomp.security.alpha.kubernetes.io/allowedProfileNames: docker/default seccomp.security.alpha.kubernetes.io/defaultProfileName: docker/default name: fluentd-fluentdspec:# allowedCapabilities:# - NET_BIND_SERVICE # useful if a workload needs a low port. but by default it&#39;s commented out allowedHostPaths: - pathPrefix: &#34;/run/fluentd/data&#34; # EXCEPTION: fluentd needs a host-persistent place to store state readOnly: false - pathPrefix: &#34;/var/lib/docker/containers&#34; # EXCEPTION: fluentd needs read access to docker container logs readOnly: true - pathPrefix: &#34;/var/log&#34; # EXCEPTION: fluentd needs read access to host logs readOnly: true allowPrivilegeEscalation: true # EXCEPTION: fluentd needs root to read logs allowedProcMountTypes: # Disallow full /proc mounts, only allow the &#34;default&#34; masked /proc - Default fsGroup: # EXCEPTION: fluentd runs as privileged, so requires fsGroup 0 rule: MustRunAs ranges: - max: 65535 min: 0 hostIPC: false # disallow sharing the host IPC namespace hostNetwork: false # disallow host networking hostPID: false # disallow sharing the host process ID namespace hostPorts: # disallow low host ports (this seems to only apply to eth0 on EKS) - max: 65535 min: 1025 privileged: true # EXCEPTION: fluentd needs root readOnlyRootFilesystem: true # change default from &#39;false&#39; to &#39;true&#39; requiredDropCapabilities: # Drop all privileges in the Linux kernel - AUDIT_CONTROL - AUDIT_READ - AUDIT_WRITE - BLOCK_SUSPEND - CHOWN - DAC_OVERRIDE - DAC_READ_SEARCH - FOWNER - FSETID - IPC_LOCK - IPC_OWNER - KILL - LEASE - LINUX_IMMUTABLE - MAC_ADMIN - MAC_OVERRIDE - MKNOD - NET_ADMIN - NET_BROADCAST - NET_RAW - SETGID - SETFCAP - SETPCAP - SETUID - SYS_ADMIN - SYS_BOOT - SYS_CHROOT - SYS_MODULE - SYS_NICE - SYS_PACCT - SYS_PTRACE - SYS_RAWIO - SYS_RESOURCE - SYS_TIME - SYS_TTY_CONFIG - SYSLOG - WAKE_ALARM runAsGroup: # EXCEPTION: fluentd runs as privileged, so requires GID 0 rule: MustRunAs ranges: - max: 65535 min: 0 runAsUser: rule: MustRunAs # EXCEPTION: fluentd runs as privileged, so requires UID 0 ranges: - max: 65535 min: 0 seLinux: # Harness for SELinux, if we ever engage with it rule: RunAsAny supplementalGroups: # EXCEPTION: fluentd runs as privileged, so requires GID 0 rule: MustRunAs ranges: - max: 65535 min: 0 volumes: # allow only these volume types - configMap - downwardAPI - emptyDir - hostPath # EXCEPTION: Fluentd needs to mount hostPaths - projected - secret# - persistentVolumeClaim # If you use statefulsets, you&#39;ll need this one.\n NOTE: each exception is called out as a YAML comment with the word &#34;EXCEPTION&#34;. This practice lets you track yourexceptions easily in the code which manages them, and makes the auditors happy when they come calling.\n NOTE2: This is laid out identically to the restrictive PSP for ease of using &#34;diff&#34; style tools to validate.\n To permit usage of the above PSP by fluentd, we have this ClusterRole and RoleBinding:\n ---apiVersion: rbac.authorization.k8s.io/v1kind: ClusterRolemetadata: labels: eks.amazonaws.com/component: pod-security-policy kubernetes.io/cluster-service: &#34;true&#34; name: psp-fluentd-fluentd # named for psp-&lt;namespace&gt;-&lt;serviceaccount&gt;rules:- apiGroups: - policy resourceNames: - fluentd-fluentd resources: - podsecuritypolicies verbs: - use---apiVersion: rbac.authorization.k8s.io/v1kind: RoleBindingmetadata: annotations: kubernetes.io/description: &#39;tailored PSP for fluentd-&gt;fluentd&#39; labels: eks.amazonaws.com/component: pod-security-policy kubernetes.io/cluster-service: &#34;true&#34; name: psp-fluentd-fluentd namespace: fluentdroleRef: apiGroup: rbac.authorization.k8s.io kind: ClusterRole name: psp-fluentd-fluentdsubjects: - kind: ServiceAccount namespace: fluentd name: fluentd\n To use this PSP, the DaemonSet just needs to specify  serviceAccountName: fluentd in their pod specification and run in the fluentd namespace to leverage the RoleBinding.\n  The fluentd workload above will have access to two distinct PSPs... How does that work?\n The PSP Admission Controller runs the given pod against all allowed PSPs in alphabetical order. The first PSP which allows the workload is used. People seem to get hung up on the alphabetical thing, but in practice it&#39;s not a big deal. Workloads in this framework will have access to one or two PSPs: the fully restrictive one, and perhaps aspecial one. It doesn&#39;t really matter which one gets evaluated first, since PSPs are handled in a &#34;if there is a single policy allowing the work, it goes in&#34; pattern. If there is a fully restrictive PSP, then in effect it works similarly to a &#34;default deny&#34; firewall policy.\n If no PSPs allow the workload, you&#39;ll see a kubernetes event which shows the union of ALL errors the workload has against EVERY PSP it has access. This makes troubleshooting quite painful.\n    The downside is there&#39;s almost no useful information given when workloads FAIL all available PSPs.\n   Warning FailedCreate 1s (x2 over 3s) daemonset-controller (combined from similar events): Error creating: pods&#34;fluentd-4mqhj&#34; is forbidden: unable to validate against any pod security policy: []\n A tactic I used to help triage these problems would be to temporarily  kubectl delete psp restrictive so that I would only see the errors from the actual PSP the exception was trying to leverage. Obviously this testing would break new workloads for a running cluster (no PSP? No launch), so we recommend a non-production environment for such triage.\n  By far the hardest challenge we had enabling PSPs was around our Mutating Admission Controllers.\n Under the covers, kubernetes admission controllers (which include PSPs) have a complex precedence hierarchy that causesPSPs to run twice. Here&#39;s the webhook ordering:\n Builtin Mutating Webhooks: Pod Security Policies mutating webhook runs here to modify pod defaults according to thePSP determined to best apply.\n   Builtin Validating Webhooks: Pod Security Policies validating webhook runs here to verify that pod objects stillabide by the PSP requirements.\n All in all, the above is a reasonable setup, and probably the only way to enable all these distinct webhook features. However, it&#39;s barely documented (unless you stumble onto the right github issues like  this one from istio). Worse, the Validating version of the PSP admission controller yields zero error messages, so you&#39;re blind troubleshooting it.\n In the end, if you have a Mutating Admission Controller, you need to ensure that its mutations are completely safe against the most restrictive PSP in your cluster. And this verification will probably be tedious (it was for us), hence why we wrote this guide.", "posttime": "2020-05-09 07:43:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "pod,psp", "title": "Kubernetes-Pod安全策略", "title_en": "Kubernetes – Pod Security Policies", "transed": 1, "url": "https://developer.squareup.com/blog/kubernetes-pod-security-policies/", "via": "", "real_tags": ["pod", "psp"]}, {"category": "", "categoryclass": "", "imagename": "5bbe7968162421a1944b4163427a229f.jpg", "infoid": 1001339, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "三星今天在三星支付北美副总裁兼总经理Sang Ahn(通过Android Central)的一篇博客文章中宣布，三星计划在今年夏天推出三星支付借记卡。安说，三星将与个人金融公司SoFi合作推出这张卡，卡将由现金管理账户支持。\n根据安的说法，三星还在开发一个“移动优先的资金管理平台”。他的博客没有详细说明资金管理平台或即将推出的借记卡可能有哪些功能，但他确实表示，三星将在“未来几周”分享更多细节。\n三星加入苹果的行列，推出品牌支付卡。苹果的是苹果卡，这是与高盛(Goldman Sachs)合作发行的信用卡，于2019年8月推出。苹果卡既是一张可以放入钱包的钛卡，也是一张可以通过iPhone和Apple Watch上的Apple Pay使用的数字卡，你可以在iOS的钱包应用程序中跟踪你在苹果卡上的消费情况。\n据报道，谷歌也在开发自己的品牌支付卡，尽管谷歌的支付卡显然会像三星的那样是借记卡。谷歌还将为该卡提供消费跟踪工具。", "note_en": "Samsung plans to launch a Samsung Pay debit card this summer,  the company announced today in a blog post by Sang Ahn, vice president and general manager of Samsung Pay in North America ( via  Android Central). Samsung will launch the card, which will be backed by a  cash management account, in partnership with personal finance company SoFi, Ahn said.\n Samsung is also developing a “mobile-first money management platform,” according to Ahn. His blog doesn’t detail what features that money management platform or the upcoming debit card may have, but he does say that Samsung will share more details “in the coming weeks.”\n  Samsung joins Apple in offering a branded payment card. Apple’s is the Apple Card, a credit card issued in partnership with Goldman Sachs and launched in  August 2019. The Apple Card is both a titanium card you can put in your wallet and a digital card you can use via Apple Pay on your iPhone and Apple Watch, and you can track spending on your Apple Card inside iOS’s Wallet app.\n Google is reportedly  working on its own branded payment card as well, though Google’s will apparently be a debit card, like Samsung’s. Google will also supposedly offer spending-tracking tools for the card.", "posttime": "2020-05-09 07:13:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "三星,samsung", "title": "三星将于今年夏天推出三星支付借记卡", "title_en": "Samsung To Launch a Samsung Pay Debit Card This Summer", "transed": 1, "url": "https://www.theverge.com/2020/5/7/21251293/samsung-pay-debit-card-sofi-this-summer", "via": "", "real_tags": ["三星", "samsung"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001338, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "哎呦。现在，在这项任务中投入12个内核需要两倍的时间才能完成。我对结果感到惊讶，因为我小心翼翼地避免了错误共享，Scott Meyers[5]很好地描述了这个问题，当缓存一致性在运行时占据主导地位时就会出现这个问题。很明显，我没有抱住嘉年华。如果您返回到card_cores.cpp，您能发现错误吗？如果你猜对了libc&#39；的rand()，那么你是对的。这个版本的随机生成器在调用之间维护内部状态，这意味着每个调用rand()的内核都会使包含该状态的所有其他内核缓存行变脏。解决方案是使用线程本地重新实现随机函数生成器。THREAD_LOCAL INT SEED=1；FLOAT R(){SEED=(214013*SEED+2531011)；RETURN((SEED&gt；&gt；16)&amp；0xFFFF)/66635.0f；}。\n$&gt；clang-O3-o multithard-lm-lpthread multithard.cpp$&gt；time./multithard&gt；/dev/null real 0m1.291suser 0m14.734ssys 0m0.109s。\n此时，名片光线跟踪器运行时间从101秒缩短到1.3秒。我估计，在仅依靠CPU的情况下，它已接近我所能做到的最好水平。是时候换个更强壮的东西了。\n在尝试了编译器优化和多线程之后，下一步是涉及到GPU。这是一个很好的时机，因为我刚刚为自己建造了一台新的PC[6]。15年来，我的GPU(Pascal GeForce GTX 1050Ti)首次仅比最新的图灵落后一代。进行GPGPU编程有两种选择：OpenCL和CUDA。我在id Software大学学习多年，这句格言“开放标准很好而且可移植”引发了我的思考，所以我考虑使用OpenCL。经过一些研究之后，它看起来很像GLSL，您需要创建缓冲区、绑定变量，并通过给出内核的源代码来创建Program。我对使用此方法处理编译器实现细节有过痛苦的记忆。使用Spir-V和clCreateProgramWithBinary有一些希望，但关于某些平台不支持它的报道很快就掩盖了这一点。最后，我选择了CUDA。事实证明，这是一种令人愉快的体验，程序员只需通过特殊限定符(如__global__和__device_)标记代码/数据位置，而NVCC编译器几乎负责所有事情。\n有很多关于CUDA的书。他们的封面上似乎都有一个博格立方体。以Cuda为例，它是一个很好的开端，它将我从#34；HelloWorld；带到了一些编译和运行时不会崩溃的东西。通过最少的重构和主要依赖于限定符关键字，我想出了一个简单的card_cuda.cu。我原以为会有一场彻底的表演大屠杀，但事情比预期的要好。C：\\Users\\fab&&gt;；NVCC-o card_cuda-O3 card_cuda.cuwarning：无法静态确定入口函数&#39；_Z8GetColorPh&#39；的堆栈大小C：\\Users\\fab&&gt;；card_cuda&gt；nul时间：984ms。\n该警告可能不是一件好事(稍后我会再谈到这一点)，但程序运行成功。在零优化的情况下，GPU的性能比12核CPU高出30%。\n为了进一步改进运行时，我发现CUDA C专业编程是一座金矿。这本书非常详细地解释了CUDA核心/流多处理器是如何工作的，以及如何评测/优化内核。这篇文章的其余部分植根于这本书，我强烈推荐它。\n在过去的二十年里，NVIDIA GPU架构发生了巨大的变化[7]。幸运的是，编程模型保持不变。一个GPU需要数千个线程。这些指令被分组为32个包(称为WARP)，其中所有这些指令都具有相同的指令指针(因此称为SIMT)，并以锁步方式执行相同的指令。就性能而言，最重要的是让SM保持良好的指令、数据和偏差。NVIDIA提供了一个名为nvprof的性能分析工具，该工具允许测量诸如占用率和经度中的线程发散等指标。分支效率测量经纱中有多少纱线发散。我们的光线跟踪器的数字很好。我原本以为它的表现会很糟糕，因为光线到处都是反弹的，但它似乎是空间位置帮助线条连贯的。另一边的入住率糟糕透顶(最好是1.0)。似乎GPU的SMS不能在飞行中保持足够的曲速，这导致了饥饿。这与发出的警告NVCC相关。因为光线跟踪器使用递归，所以它使用了大量堆栈。实际上是如此之多，以至于SM无法让更多的人存活下来。问题在于代码的递归性质。这就是编译器早先无法猜测堆栈大小的原因。修改raytracer以使用循环而不是递归(card_cudb.cu)减少了堆栈的消耗量。这意味着占用时间是原来的两倍，运行时间减少了一半！C：\\Users\\fab&gt；nvcc-o card_cudb-O3 card_cudb.cuC：\\Users\\fab&gt；nvprof--已实现的指标_占用卡_", "note_en": "Oops. Throwing 12 cores at the task now takes twice as long to complete. I was surprised by the result since I was careful to avoid false sharing, an issue well described by Scott Meyers  [5] that arise when cache coherency dominates runtime. I had obviously failed to cuddle the cachelines. If you go back to  card_cores.cpp, can you spot the mistake?  If you guessed libc&#39;s rand(), you were right. This version of the random generator maintains an internal state between calls which mean every core calling rand() made all other core cacheline containing that state dirty. The solution was to re-implement the random function generator with a thread local.  thread_local int seed = 1;float R() { seed = ( 214013 * seed + 2531011); return ((seed &gt;&gt; 16) &amp; 0xFFFF) / 66635.0f;}\n  $&gt; clang -O3 -o multi_thard -lm -lpthread multi_thard.cpp$&gt; time ./multi_thard &gt; /dev/null  real 0m1.291suser 0m14.734ssys 0m0.109s\n At this point, the Business Card Raytracer runtime was down from 101 seconds to 1.3 seconds. I assessed it was close to the best I could do while relying only on a CPU. It was time to move onto something beefier.\n   After playing with compiler optimizations and multi-threading, the next step was to involve the GPU. It was a good timing since I had just finished building myself a new PC  [6]. For the first time in 15 years my GPU (Pascal GeForce GTX 1050 Ti) was only one generation behind the latest Turing.     To do GPGPU programming there are two choices named OpenCL and CUDA. My years studying at University of id Software and the adage &#34;open standards are Good and Portable&#34; triggered so I contemplated using OpenCL. After a little bit of investigation it looked a lot like GLSL where you need to create buffers, bind variables, and createProgram by giving the source code of the kernel. I had painful memories of dealing with compiler implementation details with this method. There was some hope to use Spir-V and clCreateProgramWithBinary but reports of it not being supported on certain platforms buried it quick. In the end, I went with CUDA.     It turned out to be a delightful experience where a programmer only need to tag code/data location via special qualifiers such as __global__ and __device_ with nvcc compiler taking care of almost everything.\n   There are a lot of books about CUDA. They all seem to have a Borg cube on their cover.                                       &#34;Cuda by Example&#34; was a good starter which took me from &#34;HelloWorld&#34; to something that compiled and ran without crashing. With minimal refactoring and relying mostly on qualifier keyword, I came up with a naive  card_cuda.cu.   I was expecting a total performance carnage but things went better than expected.   C:\\Users\\fab&gt;nvcc -o card_cuda -O3 card_cuda.cuwarning : Stack size for entry function &#39;_Z8GetColorPh&#39; cannot be statically determined C:\\Users\\fab&gt;card_cuda &gt; NUL Time: 984ms\n The warning is probably not a good thing (I&#39;ll get back to this later) but the program ran successfully. With zero optimization the GPU outperformed a 12-core CPU by 30%.\n   To improve runtime further, I found &#34;Professional CUDA C Programming&#34; to be a gold mine. The book explains in great details how the CUDA core/stream multiprocessor work and how to profile/optimize a kernel. The rest of this article is rooted in this book, I highly recommend it.\n   Over the past two decades, NVidia GPU architecture has evolved drastically  [7]. Fortunately, the programming model has remained unchanged. A GPU is fed thousands of threads. Those are grouped in packs of 32 (called warps) where all of them have the same Instruction Pointer (hence the name SIMT) and execute the same instruction in lockstep. Performance-wise, the most important thing is to keep the SM well fed with instructions, data, and warps.  Nvidia provides a profiling tool named nvprof which allows to measure metrics such as occupancy and thread divergence in a warp.   &#34;Branch Efficiency&#34; measures how much threads in a warp diverge. The figure for our raytracer is good. I was expecting it to perform badly since rays bounce everywhere but it seems spacial locality helped thread to be coherent.    &#34;Achieved Occupancy&#34; on the other side was abysmal (best is 1.0). It seems the GPU SMs were not able to keep enough warp in-flight which resulted in starvation. This is correlated with the warning nvcc issued. Because the raytracer uses recursion, it uses a lot of stacks. So much actually that the SM cannot keep more than a few alive.   The problem is the recursive nature of the code. That is why the compiler was unable to guess the stack size earlier.Revising the raytracer to use a loop instead of recursion ( card_cudb.cu) reduced the amount of stack consumed. This translated in an occupancy twice as good and halved runtime!  C:\\Users\\fab&gt;nvcc -o card_cudb -O3 card_cudb.cuC:\\Users\\fab&gt;nvprof --metrics achieved_occupancy card_cudb &gt; NULAverage Achieved Occupancy 0.282478C:\\Users\\fab&gt;card_cudb &gt; NUL Time: 546ms", "posttime": "2020-05-09 07:13:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "名片,business", "title": "重温名片光线跟踪器", "title_en": "Revisiting the Business Card Raytracer", "transed": 1, "url": "https://fabiensanglard.net/revisiting_the_businesscard_raytracer/index.html", "via": "", "real_tags": ["名片", "business"]}, {"category": "", "categoryclass": "", "imagename": "60483bbdd0a4e039d48bc718d580d881.png", "infoid": 1001337, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "JavaScript预处理器可以帮助您更轻松、更方便地创作JavaScript。例如，CoffeeScript可以帮助防止容易出错，并提供更干净的语法，而Babel可以为只支持ECMAScript 5的浏览器带来ECMAScript 6特性。\n需要使用Babel来处理包裹导入。如果您需要不同的预处理器，请先删除所有软件包。\n私人钢笔隐藏在CodePen上的任何地方，除了您。您仍然可以共享它们，其他人也可以看到它们，只是他们无法通过搜索或浏览找到它们。\n升级到PRO。\n如果启用，预览面板将在您编写代码时自动更新。如果禁用，请使用运行按钮进行更新。\n如果启用，您的代码将在您主动保存钢笔时格式化。注意：您的代码在格式化过程中会展开。\n模板是可用于启动其他钢笔的钢笔。您可以查看所有模板，或在文档中了解更多信息。\nPens的屏幕截图显示在移动浏览器、RSS订阅源、选择图像而不是IFRAME的用户，以及社交媒体共享中。\n此笔正在使用由CodePen生成的默认屏幕截图。升级到PRO可上载您自己的缩略图，这些缩略图将在整个站点的此笔预览中显示，并在共享到社交媒体时显示。\n升级到PRO", "note_en": "JavaScript preprocessors can help make authoring JavaScript easier and more convenient. For instance, CoffeeScript can help prevent easy-to-make mistakes and offer a cleaner syntax and Babel can bring ECMAScript 6 features to browsers that only support ECMAScript 5.\n  Babel is required to process package imports. If you need a different preprocessor remove all packages first.\n  Private Pens are hidden everywhere on CodePen, except to you. You can still share them and other people can see them, they just can&#39;t find them through searching or browsing.\n Upgrade to PRO\n If enabled, the preview panel updates automatically as you code. If disabled, use the &#34;Run&#34; button to update.\n If enabled, your code will be formatted when you actively save your Pen.  Note: your code becomes un-folded during formatting.\n  Templates are Pens that can be used to start other Pens. You can  view all of your templates, or  learn more in the documentation.\n Screenshots of Pens are shown in mobile browsers, RSS feeds, to users who chose images instead of iframes, and in social media sharing.\n This Pen is using the default Screenshot, generated by CodePen. Upgrade to  PRO to upload your own thumbnail that will be displayed on previews of this pen throughout the site and when sharing to social media.\n Upgrade to PRO", "posttime": "2020-05-09 07:12:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,flutter,codesen,releases", "title": "Codesen发布在线颤振编辑器", "title_en": "Codepen releases online Flutter editor", "transed": 1, "url": "https://codepen.io/pen/editor/flutter", "via": "", "real_tags": ["发布", "flutter", "codesen", "releases"]}, {"category": "", "categoryclass": "", "imagename": "7fb9a9f522662a5cd4237bb5fd4f3b98.jpg", "infoid": 1001336, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "埃隆·马斯克(Elon Musk)在即将授予股票期权时宣布了一个令人惊讶的消息，该期权有望使他至少在纸面上增加近10亿美元的财富。\n“我几乎卖掉了所有的实物，”特斯拉公司(Tesla Inc.)说。首席执行官于5月1日在Twitter上发帖。“不会拥有任何房子。”", "note_en": "On the cusp of a stock-option grant that promises to make him nearly $1 billion richer, at least on paper, Elon Musk made a surprising announcement.\n  “I am selling almost all physical possessions,” the Tesla Inc. chief executive tweeted on May 1. “Will own no house.”", "posttime": "2020-05-09 06:57:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "埃隆·马斯克,musk,期权", "title": "埃隆·马斯克(Elon Musk)，科技公司现金贫乏的亿万富翁", "title_en": "Elon Musk, Tech’s Cash-Poor Billionaire", "transed": 1, "url": "https://www.wsj.com/articles/elon-musk-techs-cash-poor-billionaire-11588967043", "via": "", "real_tags": ["埃隆·马斯克", "musk", "期权"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001335, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "是的，这次是真的。为了我们社区的健康和安全，我们已经决定将DEF CON 28设为“联网安全模式”。原定于2020年8月6日至9日举行的DEF CON面对面会议已被取消。请看这里的公告：https://forum.defcon.org/node/232005黑帽美国公司也更新了他们的计划。详情请点击此处：https://www.blackhat.com/us-20/updates.html。\n尽管我们的面对面拉斯维加斯活动被取消，我们将在8月7日至9日(周五至周日)运行DEF CON 28安全模式，周四将举行101迎新活动-所有这些都是远程的。我们将利用DEF CON论坛协调您参与的各种方式。在那里，每个人都可以宣布他们的计划，进行注册，发布图片和视频，并让人们参与进来。然后在8月6日，我们将开放DEF CON Discord.io/DC服务器，每个人都可以加入，开始他们的骗局体验！\n如果您在DEF CON官方酒店街区(凯撒宫、哈拉斯、林肯、弗拉明戈、好莱坞星球、巴黎、巴利、克伦威尔)内预订，凯撒娱乐将自动取消您的预订，并将通过电子邮件通知您。如果您在我们的DEF CON集团区外预订了房间，请直接联系酒店取消您的预订。\nDef Con 29定于2021年8月5日至8日举行。您现在可以预订DEF CON 29个酒店房间。\nDEF CON 28现场正式取消，但DEF CON讲座、研讨会、演示实验室和培训CFPS提交的文件将按原计划如期处理。\n是的，请查看您的状态电子邮件中的详细信息以获取反馈信息。CFP、培训、研讨会和演示实验室的状态电子邮件都应按原计划在6月的第一周(如果不是更早)到达。当所有申请都已收到通知后，我们将通过DEF CON官方账户发布最新消息。\n不可以，当DEF CON 29要求开放内容时，您必须提交一份新的表格。时间会过得太久，我们希望确保您进行了更新以保持更新。\n我们还不知道，但正在内部评估各种选择。如果您的申请符合我们的标准接受标准，我们将直接与您沟通选项。\n对于讲座、研讨会、演示实验室和培训，支付酬金、徽章或支票仍将受到尊重。进入徽章形式的酬金将在2021年延续到DEF CON 29，但旅行和住宿不会。\n我们计划在DEF CON论坛上组织这里的一切，然后在8月6日我们将开放DEF CON Discord.io/DC服务器，供每个人加入并开始他们的Con体验！Def Con安全模式将于8月7日至9日(周五至周日)运行，周四将举行101场迎新活动。鼓励想要举办虚拟活动、竞赛或派对的内容组织者使用DEF CON论坛作为与与会者联系和共享计划的枢纽。自去年以来，我们已经添加了相册、视频上传支持，以及一款移动应用程序。如果您希望有一个论坛的存在，请阅读规则，创建一个帐户，然后开始。我们建议您也阅读论坛规划公告。", "note_en": "Yes, for really real this time. For the health and safety of our community, the decision has been made to put DEF CON 28 into “safe-mode with networking”. The DEF CON in-person conference scheduled August 6-9, 2020 has been canceled.   See the announcement here:  https://forum.defcon.org/node/232005  Black Hat USA also has an update to their plans. Details here:  https://www.blackhat.com/us-20/updates.html\n    Even though our in-person Las Vegas event is canceled, we will run DEF CON 28 Safe Mode August 7-9 (Friday through Sunday) with 101 orientation Thursday - all of it remote. We will use the DEF CON Forums to coordinate all the various ways for you to participate. That is where everyone can announce their plans, do signups, post pictures and videos and get people involved.  Then on August 6th we will open the  DEF CON discord.io/dc server up for everyone to join and start their con experience!\n       If you made a reservation within the official DEF CON hotel block (Caesars Palace, Harrahs, Linq, Flamingo, Planet Hollywood, Paris, Bally&#39;s, Cromwell), your reservation will automatically be canceled by Caesars Entertainment and you will be notified by email. If you made a reservation outside of our DEF CON group block, please contact the hotel directly to cancel your reservation.\n   DEF CON 29 is scheduled for August 5-8, 2021. You can reserve  DEF CON 29 hotel rooms now.\n   DEF CON 28 on-site is officially canceled, however DEF CON talks, workshops, demo labs, and training CFPs submissions will be processed on schedule as originally planned.\n   Yes, please review the details in your status email for feedback information. CFP, training, workshops and demo labs status emails should all arrive as originally planned in the first weeks of June, if not earlier. We will post an update via official DEF CON accounts when all applications have been notified.\n   No, you will have to submit a fresh form when the DEF CON 29 calls for content open. Too much time will have passed and we want to make sure you have made updates to keep it fresh.\n   We don&#39;t know yet, but are reviewing options internally. If your application meets our standard criteria for acceptance we will communicate options with you directly.\n   Payment Honorariums, badge(s) or check(s), will still be honored for talks, workshops, demo labs, and training. Honorariums in form of entry Badge(s) will carry over for DEF CON 29 in 2021, but travel and accommodations will not.\n   We plan to organize everything  here on the DEF CON Forums, and then on August 6th we will open the  DEF CON discord.io/dc server up for everyone to join and start their con experience! DEF CON Safe Mode will then run August 7-9 (Friday through Sunday) with 101 orientation Thursday.  Content organizers that want to run a virtual event, contest, or party are encouraged to use the DEF CON Forums as a hub to connect with attendees and share plans. Since last year we have added photo albums, video upload support, along with a mobile app. If you wish to have a forums presence please read the rules, create an account, and get started. We recommend reading the  forums planning announcement too.", "posttime": "2020-05-09 06:57:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "defcon,def", "title": "Defcon 28真的被取消了", "title_en": "Defcon 28 Is Really Canceled", "transed": 1, "url": "https://defcon.org/html/defcon-safemode/dc-safemode-faq.html", "via": "", "real_tags": ["defcon", "def"]}]