[{"category": "", "categoryclass": "", "imagename": "02a16abc91bf141964f438e01ad1833a.jpg", "infoid": 1007355, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "醒来时会想到一个新小部件的好主意。建造它，在你的房子前面摆一张桌子，然后以10美元的现金出售。\n所以你扩大了你的业务，开了一家Shopify商店，然后在网上销售。Shopify收取您售价的2%，外加2.9%+30美分的支付手续费。\n你每笔交易赚9.21美元(尽管每月仍然需要支付29美元的店铺费用)，总共给Shopify和Strike送去了大约8%的收入。还不错。\n越来越多的人在eBay上搜索小工具，所以你也把它列在那里。他们收取10%的费用，外加贝宝手续费。其他市场也是类似的；Etsy收取5%的费用，外加更多的费用来列出你的产品。\n亚马逊有更多的客户，人们喜欢免费送货，所以你也在那里销售。虽然没有什么是真正免费的：你可能要为每件商品支付15%的介绍费、2美元的送货费和0.99美元的费用。\n如果您的小部件在真正的商店中，可能会有更多的人看到它。但那是要付出代价的。据特拉克斯估计，你将支付“每个SKU平均每家门店1500美元”的进货费。如果你的小玩意儿在结账时出售，你可能会为每家商店每英寸的零售空间支付几美元，将你的库存放入仓库的10%的库存费，以及促销和折扣的住宿费。\n一份关于美国零售市场的报告称：“一家公司可能需要支付约500万美元，才能在50家最大的超市连锁店的所有门店放置一块糖果。”\n这足以让亚马逊听起来很便宜，直到你卖出大量的小工具。\n所以你换档了。人们喜欢您的小部件；也许他们会读到您是如何构建它们的。你写一本书，在Kindle和苹果书店出售。\n亚马逊的Kindle商店收取30%的费用，但是有条件的。你的书的价格必须在2.99美元到9.99美元之间，比任何纸质书都便宜20%。它必须是Kindle的独家产品，才能在某些市场上获得这样的价格。任何增值税都是从你的分成中提取的，0.15美元/mb的下载费也是如此。卖一本9.99美元的书，你可能会得到6.69美元。\n如果不符合这些要求，亚马逊会收取你售价的65%。卖一本10美元的书，只能得到3.5美元。\n写一首关于你的小工具的歌似乎不是一个好主意，无论是从内容还是从收入的角度来看都是如此。Spotify每播放支付0.32美分，Apple Music约为0.56美分。你需要有人把你的歌播放3125次，才能等同于在你家门前卖出一个10美元的小玩意儿。\n也许一款应用程序会更有意义。你为你的小工具制作一个数字版本，把它放在App Store和Google Play上，每一个都收取30%的佣金。\n游戏也没什么不同。蒸汽店的阀门收费30%(销售超过1000万美元可享受5%的折扣)。索尼、微软和任天堂也收取30%的费用。如果你在真正的商店里销售你的游戏，在扣除所有的费用之后，“从实体零售商那里拿到的外卖……。通常只有10%-15%。“。\n也许订阅更有意义，因为每个月都会有新的数字小工具。第一年，苹果和谷歌照旧抽成30%。第二次及之后，他们将收取15%的费用。\n或。网络是免费的，任何人都可以发布一个网站，而有了Strike账户，你只需收取2.9%+30美分的费用就可以自己出售软件。卖出10美元，你就会得到9.41美元。订阅费是1%(10美元的订阅费是10美分)，或者像Chargebee这样的订阅费是299美元/月。\n这比在Shopify上销售实体商品的利润率更高，比App Store的定价要好得多，更不用说亚马逊的定价了。\n在零售销售产品时，并不是什么都不付钱。\n房地产是昂贵的。货架，库存，物流和配送，电费和收银员，所有这些加起来。如果沃尔玛向你收取货架空间、促销费用，并且仍然在你的产品上增加他们的利润，至少你有一些东西可以展示。你付钱是为了把你的产品放在真正的客户面前。\n亚马逊也是如此。送货从来都不是免费的，履行中心和传说中的一键结账也不是。即使是信用卡费用和附属机构的削减也会加在一起。此外，每月有超过20亿人访问亚马逊网站。为了站在那些人的前面，多花一点钱是值得的。如果算术不起作用，你可以随时去找他们的竞争对手。\n你可以在eBay，Etsy，或者Shopify或WooCommerce商店花更少的钱。但选择在亚马逊上销售的商家愿意为观众付费，愿意接触数百万随时准备购买任何东西的客户，只要它是Prime Now。\n当苹果在2008年推出App Store时，软件下载已经扼杀了盒装软件。但这并不意味着软件很容易分发。\n例如，在移动设备上，典型的Java移动应用程序是通过聚合器分发的，聚合器将协商API访问并直接将其出售给运营商。资深科技记者沃尔特·莫斯伯格(Walt Mossberg)回忆说：“运营商控制着手机上的应用程序，通常会拿走大部分收入-50%、70%，甚至更多。”\n在台式机上，这并不容易。您需要人们发现您的软件、下载软件、支付费用、输入许可证密钥以防止盗版，并在修复错误时安装更新。你需要自己做这件事。Stripe只存在了十年；在此之前，规模较小的开发者只能听任贝宝(PayPal)的突发奇想。\nApp Store以你售价的30%涵盖了所有这些内容。这几乎看起来很划算，特别是与与手机运营商打交道相比。\n你只要上传一个应用程序，每个iOS和Mac用户就可以立即用他们现有的账户购买你的软件--不需要贝宝，也不需要输入信用卡号码。没有许可证和帐户；苹果为您处理这些。不管怎么说，一开始，App Store搜索足以把感兴趣的人吸引到你的软件上，这是亚马逊零售搜索的应用程序版本。更新很容易；苹果自动将它们推送给所有客户。\n正如作家约翰·格鲁伯(John Gruber)所说，“App Store不仅仅是一个支付处理器，对于一些开发者来说，苹果的分成要么值得高兴，要么至少是勉强值得。”顾客也喜欢它，只需点击两下付款即可。\n然后裂缝开始显露出来。下载你的应用程序的人本身并不是你的客户-你永远不知道是谁买了你的应用程序，几乎没有直接联系他们的方式。苹果没有提供销售升级的方式，所以即使客户希望你保持应用程序的最新版本，也很难继续赚钱。如果你在你的应用程序中销售额外的内容-歌曲、电子书、视频、课程、不需要许可证密钥和更新的内容，以及整个App Store基础设施-苹果仍然希望获得30%的提成。\n尽管万维网很复杂，但它开始看起来更有吸引力了。如果说有什么不同的话，那就是App Store越来越看起来是一个过时的负担，而不是简化软件分发的合理费用。\n在App Store提供的所有功能中，SaaS可能发现两件事很有帮助：发现和下载。没有这两个，他们也能活下去。\n订阅软件企业必须建立客户关系，每个用户拥有唯一的账户。在你做这件事的时候还不如多付点钱。账户否定了对许可证密钥的需求，并使盗版成为过去。而且，很有可能，您的SaaS是一个Web应用程序-所以您只需要一个浏览器，无需访问特定于设备和操作系统的API。有一个手机应用程序会很好，有离线支持、通知和共享菜单集成。在App Store搜索中发现也会很好。但是，所有其他使App Store对开发者有价值的东西，比如说，开发游戏的开发者，对商业SaaS供应商来说都无关紧要。\n这并不是说你必须自己建造它。Stripe处理支付、递归订阅，甚至像Ghost这样的博客系统也可以帮助你建立一个完整的会员系统。你甚至可以通过浏览器推送通知，如果需要，可以在移动设备上退回到Twilio支持的短信和SendGrid电子邮件通知。\n于是出现了变通的办法。他们从内容驱动型企业起步，比如世界上的Netflix、Spotify和Kindle，这些公司希望发布移动应用程序，但不想支付内容收入的30%。就像SaaS一样，他们已经需要管理账户和订阅，在App Store中发现除了分发之外几乎没有什么价值。作为一种变通办法，他们建立了苹果现在所说的“阅读器应用程序”，用现有的账户登录，并查看已经购买的内容。他们就是不能让人们通过他们的移动应用程序创建新账户，否则苹果将要求提成30%(如果是后续年份的订阅，提成为15%)。\n现实世界的商品和服务也是如此，因此亚马逊商店应用程序、Expedia等旅游应用程序，以及Uber和Grab等交通服务都可以自由使用自己的账单，而不需要支付苹果的费用。无论如何，他们需要拥有客户关系，并围绕增加其他产品和服务的利润率来建立业务。\n这样就只剩下SaaS了。有一段时间，苹果似乎满足于视而不见，让商业软件订阅的移动应用程序不提供平安无事的注册方式。但这一点已经改变了。\nBasecamp团队的新电子邮件应用嘿的工作原理与Netflix的应用类似：你可以用现有账户登录，但不能创建新账户。App Store只做分销；嘿自己有足够的营销能力，而且有几十年在互联网上销售软件的经验。苹果对此不以为然，拒绝了他们的最新更新，并威胁要将嘿从App Store中删除。事实证明，这只是最近的事情；本·汤普森在Stratechery上发现，苹果公司告诉销售数字事件的应用程序，他们也需要使用官方的应用程序内购买。\n有趣的是。苹果15%-30%的订阅费削减对开发者和苹果来说都不是理想的选择。这足以推动最大的平台，最受欢迎的软件走出自己的道路。\n这个App Store是值得付钱的。也许不是30%，甚至不是15%，而是略高于处理信用卡交易的成本。今天，一款免费的应用程序给苹果带来的收入为零，而确实带来收入的付费应用程序则承担了整个生态系统的成本。也许更低的订阅率(交易的5%左右)可能足以说服Netflix和更多的人，让他们相信数百万张联网信用卡的好处是值得与客户进行稍微不那么直接的连接，足以让开发者不再抱怨这一要求。\n苹果似乎不同意这种说法。App Store不只是值得花钱，它值得花30%的钱。这是他们的店面，讨论到此为止。不喜欢吗？也许iPhone不适合你。\n苹果似乎将App Store视为一家数字零售店，那里30%的货架空间和有保证的货架空间对于消费包装商品来说是一笔划算的交易。\n也许吧。然而，Kindle商店在数字零售领域展示了垄断定价权，这可能是极端的。在Kindle商店销售图书要收取65%的费用-除非你跳过圈套达到30%的费用水平-这意味着你向亚马逊支付的图书费用比作者更高。然而，与文学代理商、出版商、书店相比，即使是这样，对于自助出版的作家来说，也是免费的，而且在其他人都拿到自己的份额后，一个作家在传统世界可能会获得10%-20%的版税。老国王死了，新国王万岁，只是稍微仁慈一点。\n今天的软件开发人员有一个强大的优势，他们在网络上构建他们的工具，每一个构建的最开放的分发系统。与实物商品相比，他们习惯了在市场上以最低的单位成本和难以想象的利润率在市场上免费销售或几乎免费销售。尽管转换到SaaS可能很困难，但它让团队构建了取代App Store的技能集。\n如果App Store的收入削减减少，来自网络和SaaS的竞争将会改变局面-就像苹果自己带头削减运营商强加给上一代移动开发者的成本一样。\n现在，SaaS-有了新的平台来建立订阅、销售媒体并将追随者货币化-会给Kindle商店、流媒体音乐和其他媒体带来定价压力吗？亚马逊将继续重建在线实体店的价格结构，还是独立零售商会让收取零售价40%+的费用变得站不住脚？\n构建自定义API文档的最佳工具是什么？假设您有一个要记录的API，并且您想要：-让您的用户测试他们对API的调用，这要归功于像Figma API上那样的操场-能够自定义它以匹配……。\n获得关于设计或产品的反馈的最佳方式是什么？你有没有最喜欢的调查或民意测验工具来获得反馈，或者有一个独特的过程来从你的用户那里获得关于你的设计、产品功能、定价和更多的可行的见解？\n概念与融合的优势是什么？我从2013年开始使用Confluence，在我看来，它是最好的文档协作工具。最近，我发现这种观念正在变得流行起来。周围有没有重度用户的想法？", "note_en": "Wake up with a great idea for a new widget. Build it, set up a table in front of your house, and sell it for $10 cash.\n    So you expand your business, start a Shopify store, and sell online.  Shopify charges 2% of your sale price, along with another 2.9% + 30¢ payment processing fee.\n You make $9.21 per sale (though still need to pay $29/month for the store), and sent Shopify and Stripe around 8% total. Not bad.\n  More people are searching for widgets on eBay, so you list it there too.  They charge 10%, plus PayPal fees. Other marketplaces are similar; Etsy charges 5%, plus a bit more to list your product.\n   Amazon has more customers, and people love free shipping, so you sell there too. Though nothing’s truly free: You might pay a 15%  referral fee, $2 fulfillment charge, and $0.99 fee per item sold.\n  If your widget was in a real store, perhaps more people would see it. But that costs. You’ll pay slotting fees which “average $1500 per store per SKU,” estimates  Trax. You might  pay a few dollars per inch of retail space per store if your widget is sold near checkout, 10%  stocking fees to put your inventory in warehouses, and pay-to-stay fees for promotions and discounts.\n “A company might have to pay up to about $5 million to place one candy bar in all the stores of the 50 biggest supermarket chains,”  said one report on the US retail market.\n That’s enough to make Amazon sound cheap, until you’re selling a  lot of widgets.\n  So you switch gears. People like your widgets; maybe they’d read about how you built them. You write a book, sell it on the Kindle and Apple Books stores.\n  Amazon’s Kindle store charges 30%, but with conditions. Your book must cost $2.99 to $9.99, and 20% less than any print copiesell. It must be exclusive to the Kindle to get this rate in some markets. Any VAT comes out of your cut, as does a download fee of $0.15/mb. Sell a $9.99 book, and you might get $6.69.\n Don’t meet those requirements, and Amazon charges 65% of your selling price. Sell a $10 book, get only $3.50.\n Writing a song about your widget doesn’t seem like a great idea, either from a content and revenue perspective. Spotify  pays 0.32¢ per play, Apple Music around 0.56¢. You’ll need someone to play your song 3,125 times to equal selling one $10 widget in front of your home.\n  Maybe an app would make more sense. You make a digital version of your widget, put it the  App Store and  Google Play, each of which take a 30% cut.\n  Games aren’t much different. Valve  charges 30% for the Steam store (with a 5% discount after you sell over $10 million). Sony, Microsoft, and Nintendo  also charge 30%. And if you sell your game in a real store, after  all the fees the “takeaway from a physical retailer ... is often between just 10-15%.”\n Maybe a subscription makes more sense, with new digital widgets every month. The first year, Apple and Google take 30% as before. The second and thereafter, they take 15%.\n  Or. The web’s free, anyone can publish a website, and with a Stripe account, you can sell software yourself for  only a 2.9% + 30¢ charge. A $10 sell nets you $9.41. Subscriptions will cost you an extra 1% through Stripe (an extra 10¢ on that $10 subscription), or perhaps $299/month with a subscription tool like  Chargebee.\n That’s better margins than selling physical goods on Shopify, incomparably better to the App Store’s pricing, let alone Amazon’s.\n   It’s not like you’re paying for nothing when selling products at retail.\n Real estate’s expenive. Shelving, stocking, logistics and distribution, the electric bill and checkout staff, it all adds up. If Walmart charges you for shelf space, promotion, and still adds their margin to your product, at least you’ve got something to show for it. You paid to put your product in front of real customers.\n Same for Amazon. Shipping’s never actually free, neither are fulfillment centers and the fabled 1-click checkout. Even credit card fees and affiliate cuts add up. Plus, over 2 billion people visit Amazon sites each month. It’s worth paying a bit more to get in front of those people. And if the math doesn’t work, you could always go to one of their competitors.\n You could pay less on eBay, Etsy, or with a Shopify or WooCommerce store. But the vendors that choose to sell on Amazon are willing to pay for the audience, for access to millions of customers ready to buy anything as long as it’s on Prime Now.\n    Software downloads had already killed boxed software when Apple launched the App Store in 2008. But that didn’t mean software was easy to distribute.\n On mobile, for example, the typical  Java mobile app was distributed through an aggregator, who would negotiate API access and sell it directly to carriers. “Carriers controlled which apps would make it onto phones, and often took most of the revenue - 50%, 70%, more,”  recalled veteran technology journalist Walt Mossberg.\n It wasn’t much easier on desktop. You needed people to discover your software, download it, pay for it, enter a license key to prevent piracy, and install updates as you fixed bugs. And you needed to do it on your own. Stripe’s only been around for a decade; before that, smaller developers were left to the whims of PayPal.\n The App Store covered all of that, for 30% of your selling price. It could almost seem like a bargain, especially compared to dealing with phone carriers.\n You’d upload an app, and instantly every iOS and Mac owner could buy your software with their existing account—no PayPal or entering credit card numbers needed. No licensing and accounts; Apple handled that for you. And at first anyhow, App Store search was enough to bring interested people to your software, the app version of Amazon’s retail search. Updates were easy; Apple pushed them to all your customers, automatically.\n “The App Store is more than just a payment processor, and for some developers, Apple’s cut is either happily worth it or at least begrudgingly worth it,” as writer John Gruber  put it. Customers like it, too, with payments only two taps away.\n Then the cracks started showing. People downloading your app weren’t  your customers, per se—you never knew who bought your app, had few ways of contacting them directly. Apple didn’t offer a way to sell upgrades, so it was difficult to keep making money even as customers expected you’d keep the app up to date. And if you sold extras in your app—songs, eBooks, videos, courses, content that wouldn’t have required license keys and updates and a whole App Store infrastructure to start with—Apple still wanted a 30% cut.\n The web, with all its complexities, started looking more appealing. If anything, the App Store increasingly seemed an archaic burden, not a reasonable fee to simplify software distribution.\n  Of all the things the App Store offers, SaaS finds perhaps two things helpful: Discovery and downloads. And they could live without either.\n Subscription software businesses have to build a customer relationship, with unique accounts per-user. Might as well build out payments while you’re at it. Accounts negate the need for license keys, and make  piracy a thing of the past. And, odds are, your SaaS is a web app—so a browser’s all you need, no access to device and operating system-specific APIs needed. A mobile app would be nice to have, with offline support and notifications and share menu integration. Discovery in the App Store search would be nice, too. But all the other things that make the App Store valuable to, say, developers building games don’t matter to business SaaS vendors.\n It’s not like you’ll have to build it on your own. Stripe handles payments, Recurly subscriptions, even blog systems like Ghost can help you set up a full membership system. You can even push notifications through the browser, and fall back to Twilio-powered SMS and Sendgrid email notifications on mobile if needed.\n So came the workarounds. They started with content-driven businesses, the Netflix and Spotify and Kindle’s of the world, who wanted mobile apps for distribution, but didn’t want to pay 30% of their content revenue. Just like SaaS, they already needed to manage accounts and subscriptions, and found little value beyond distribution in the App Store. As a workaround, they built what Apple is now calling “ Reader Apps” to sign in with existing accounts and view content already purchased. They just couldn’t let people create new accounts from their mobile apps, or Apple would require a 30% cut (or 15%, for subsequent-year subscriptions).\n The same went for real-world goods and services, so the Amazon store app, travel apps like Expedia, and transit services like Uber and Grab are free to use their own billing and skip paying Apple’s fees. They need to own the customer relationship anyhow, and built their business around adding margin to others products and services the same.\n That leaves SaaS. For a while Apple seemed content to look the other way, to let business software subscriptions’ mobile apps not offer ways to signup without fuss. But that’s changed.\n The Basecamp team’s new email app  Hey works like Netflix’ app: You can sign in with an existing account, but can’t create a new account. The App Store only does distribution; Hey has marketing enough on its own, and decades of experience selling software on the internet. Apple wasn’t too fond of that,  rejected their latest update, and threatened to remove Hey from the App Store. Turns out, that was only the more recent; Ben Thompson on  Stratechery found that Apple’s told apps selling digital events that they, too, needed to use official in-app purchases.\n Here’s the funny thing. Apple’s 15-30% cut on subscriptions isn’t ideal for either developers or Apple. It’s enough of a cut to push the largest platforms, the most popular software to forge their own path.\n The App Store’s worth paying for. Maybe not 30%, or 15% even, but something over just the cost of processing credit card transactions. Today, a free app brings Apple zero revenue, while the paid apps that do bring revenue shoulder the cost of the whole ecosystem. Perhaps a lower subscription rate, at 5% or so of transactions, might be enough to convince Netflix and more that the benefit of millions of connected credit cards were worth a slightly less direct connection to customers, enough to keep developers from complaining about the requirement.\n  Apple seems to disagree. The App Store’s not just worth paying for, it’s worth paying 30% for. It’s their storefront, end of discussion. Don’t like it? Maybe the iPhone’s not for you.\n Apple seems to see the App Store as a digital retail store, where 30% and guaranteed shelf space would be a bargain for consumer packaged goods.\n Perhaps. The Kindle store, though, shows monopoly pricing power at what may be the extreme in digital retail. 65% in fees to sell books on the Kindle store—unless you jump through hoops to hit the 30% fee tier—means you’re paying Amazon more for books than the authors. Yet even that was freeing to self-published authors compared to literary agents, publishers, bookstores, and the perhaps 10-20% royalties an author might receive in the traditional world after everyone else got their share. The old king is dead, long live the only slightly more benevolent new king.\n Today’s software developers have a strong advantage, building their tools on the web, the most open distribution system every built. They’re used to things being free, or nearly so, of selling in market with minimal per-unit costs and impossible-to-imagine margins compared to physical goods. And the switch to SaaS, hard as it may have been, made teams build the skill sets to replace the App Store.\n If App Store revenue cuts come down, it’s competition from the web and SaaS that will move the needle—much as Apple itself led the way in cutting the costs carriers used to impose on the previous generation of mobile developers.\n Now, will SaaS—with new platforms to build subscriptions, sell media, and monetize a following—provide pricing pressure for the Kindle store, streaming music, and other media? Will Amazon continue to rebuild the price structure of physical stores online, or will independent retailers make charging 40+% of retail prices untenable?\n  What&#39;s the best tool for building a customized API documentation? Let&#39;s say you have an API you want to document and you want to:- Let your users test their calls to the API thanks to a &#34;playground&#34; like the one on the Figma API- Be able to customize it to matc...\n What&#39;s the best way to get feedback about a design or product? Do you have a favorite survey or poll tool to get feedback, or a unique process to get actionable insights from your users about your design, product features, pricing, and more?There was an inte...\n What are the advantages of Notion vs Confluence? I&#39;ve been using Confluence since 2013, and in my opinion, it&#39;s the best document collaboration tool. Lately, I&#39;ve seen that Notion is getting trendy. Any Notion heavy user around?", "posttime": "2020-06-20 09:43:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,kill,应用程序", "title": "30%的人没有扼杀App Store模式。SaaS做到了", "title_en": "30% didn’t kill the App Store model. SaaS did", "transed": 1, "url": "https://capiche.com/e/ecommerce-and-app-store-fees-compared", "via": "", "real_tags": ["app", "kill", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007354, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一份新的国家报告首次使用了最新的低可再生能源和储存价格，该报告显示，如果政策正确，美国可以避免建造新的化石燃料，并将每年增加50多万个能源部门的就业机会，支持复苏努力。\n加利福尼亚州伯克利-根据加州大学伯克利分校(University Of California，Berkeley)环境公共政策中心(Center For Environmental Public Policy)今天发布的一项研究，到2035年，美国可以在全国范围内可靠地提供90%的清洁、无碳电力，而不会给消费者账单带来额外成本，也不需要新的化石燃料工厂。这项研究还发现，如果没有强有力的政策改革，大部分减少排放和增加就业的潜力都不会实现。2035年的报告：太阳能、风能和电池成本的暴跌可以加速我们的清洁能源未来。这是第一项此类研究，表明最近太阳能、风能和电池储存成本的下降如何使美国能够大幅减少现有化石发电厂的发电量和排放量，同时淘汰煤炭和减少70%的天然气发电量。\n额外可再生能源的快速建设将向经济注入1.7万亿美元的投资，并在不提高消费者账单的情况下，到2035年，美国所有地区的能源部门就业岗位每年增加高达53万个。到2035年提供90%的清洁电力还通过减少空气污染和碳排放造成的损害，到2050年避免了1.2万亿美元的环境和健康成本。\n电力部门接近完全脱碳的2035年时间框架意义重大，因为这比大多数州和国家政策提案中的预期快了15年，这些提案几乎没有避免最严重气候变化影响的希望。2018年10月，联合国政府间气候变化专门委员会警告称，为了将全球变暖控制在1.5摄氏度以内，世界只有12年的时间将排放量减半。报告发现，到2030年，美国可能会达到70%以上的清洁电力，使美国整个经济领域的排放量减少18%。到2050年，通过到2035年达到90%的无碳发电部门，到2050年，与美国发电厂空气污染相关的多达8.5万人不必要的过早死亡可以避免，这将使整个经济的排放量减少27%。\n2035年的目标年为大多数煤和天然气工厂留出了足够的时间来收回固定成本，从而避免了消费者和投资者的成本搁浅风险，如果政策到位的话。风能、太阳能和电池储存可以提供90%的清洁电力的大部分。报告发现，不需要新的化石燃料发电机。现有的天然气发电厂很少使用，并与储存、水电和核能相结合，足以满足可再生能源发电量极低或电力需求极高的时期的需求。与2019年相比，2035年天然气工厂的发电量将下降70%。\n加州大学伯克利分校环境公共政策中心的高级科学家兼附属机构Amol Phadke博士说：“清洁技术的成本降低速度比几年前预期的要快得多。”“这是第一份整合了最新的可再生能源和储存低价的报告，表明到2035年在美国电网上提供90%的无碳电力在技术上和经济上都是可行的。”\n加州大学伯克利分校高盛公共政策学院(UC Berkeley Goldman School Of Public Policy)教授、环境公共政策中心(Center For Environmental Public Policy)执行主任大卫·伍利(David Wooley)表示：“我们谈论的是到2035年实现近100%清洁电力的能力，这是大多数人谈论的时间的一半。”“这令人兴奋，因为2035年的时间表实际上符合气候现实。然而，如果没有强有力的政策变化，这一结果是不可能的，我们希望这份报告能帮助就实现这一目标所需的联邦、州和公司政策进行对话。“。\n2035年报告发布的同时，无党派政策公司能源创新(Energy Innovation)提出了一系列政策建议，以实现这里设想的就业和经济效益。备忘录的主要政策建议是建立一个技术中立的国家清洁能源标准，目标是到2035年达到90%，到2045年达到100%。开启清洁能源未来的其他建议包括支持清洁能源部署的补充政策，解决批发市场故障，重新制定公用事业电网监管，以及确保受影响社区公平公正的能源过渡。\n“对于经济刺激来说，这是一个多么令人难以置信的机会。联邦清洁能源标准，加上政府在部署和美国制造业方面的投资，可能会让我们回到更健康的经济轨道上来。与此同时，各州持续的政策领导可以推动进步，“能源创新副总裁索尼娅·阿加瓦尔(Sonia Aggarwal)说。\n环境公共政策中心设在加州大学伯克利分校的高盛公共政策学院，采取综合方法解决环境问题，并基于严格的分析标准支持公共政策的制定和实施，这些标准仔细定义问题，并将其与最有效的解决方案相匹配。\nGridLab是一家创新的非营利性组织，提供技术网格专业知识，以增强政策决策，并确保快速过渡到可靠、经济高效和低碳的未来。\n能源创新公司是一家无党派的能源和环境政策公司，为政策制定者提供高质量的研究和原创分析，帮助他们在能源政策上做出明智的选择。能源创新的使命是通过支持最有效地减少温室气体排放的政策，与政策制定者、其他专家、非政府组织、媒体和私营部门密切合作，加快清洁能源的发展。", "note_en": "New national report is first to use latest low renewable energy and storage prices, shows with the right policy the U.S. can avoid building new fossil fuels and increase energy sector jobs by over half a million each year, supporting recovery efforts\n BERKELEY, CA — The United States can deliver 90 percent clean, carbon-free electricity nationwide by 2035, dependably, at no extra cost to consumer bills and without the need for new fossil fuel plants, according to  a study released today from the Center for Environmental Public Policy at the University of California, Berkeley. The study also finds that without robust policy reforms, most of the potential to reduce emissions and increase jobs would not be realized.  2035 Report: Plummeting Solar, Wind, and Battery Costs Can Accelerate Our Clean Energy Future is the first study of its kind to show how recent cost declines for solar, wind, and battery storage allow the U.S. to dramatically reduce generation and emissions from existing fossil power plants, while retiring coal and reducing gas generation by 70 percent.\n The rapid buildout of additional renewable energy would inject $1.7 trillion of investment into the economy and increase energy sector jobs by up to 530,000 per year through 2035, across all regions of the U.S., without raising consumer bills. Delivering 90 percent clean electricity by 2035 also avoids $1.2 trillion in environmental and health costs through 2050 by reducing damages from air pollution and carbon emissions.\n The 2035 time frame for near-complete decarbonization of the power sector is significant because it is 15 years faster than projected in most state and national policy proposals, which provide little hope that the worst climate change impacts can be avoided. In October 2018, the U.N.’s Intergovernmental Panel on Climate Change warned that the world has only a dozen years to halve emissions in order to limit warming to 1.5°C. By 2030, the report finds, the U.S. could reach over 70 percent clean electricity, reducing U.S. economy-wide emissions by 18 percent. Up to 85,000 unnecessary premature deaths associated with air pollution from power plants in the U.S. could be avoided through 2050 by reaching a 90 percent carbon-free electric generation sector by 2035, which would reduce economy-wide emissions 27 percent.\n The target year of 2035 allows sufficient time for most coal and gas plants to recover their fixed costs, thereby avoiding risk of stranded costs for consumers and investors, if the right policies are in place. Wind, solar, and battery storage can provide the bulk of the 90 percent clean electricity. The report finds that new fossil fuel generators are not needed. Existing gas plants, used infrequently and combined with storage, hydropower, and nuclear power, are sufficient to meet demand during periods of extraordinarily low renewable energy generation or exceptionally high electricity demand. Power generation from natural gas plants would drop by 70 percent in 2035 compared to 2019.\n “Cost reductions in clean technology have occurred much faster than anticipated just a few years ago,” said Dr. Amol Phadke, Senior Scientist and affiliate at UC Berkeley’s Center for Environmental Public Policy. “This is the first report to integrate the latest low prices for renewable energy and storage and shows it is technically and economically feasible to deliver 90 percent carbon-free electricity on the U.S. power grid by 2035.”\n “We’re talking about the ability to achieve near-100 percent clean electricity by 2035, in half the time most people are talking about,” said David Wooley, professor at the UC Berkeley Goldman School of Public Policy and Executive Director of the Center for Environmental Public Policy. “This is exciting, because the 2035 timeframe is actually compatible with climate realities. However, this outcome isn’t possible without strong policy changes and our hope is this report can help inform the dialogue on federal, state, and corporate policies needed to achieve it.”\n The 2035 Report’s release is accompanied by a s et of policy recommendations from nonpartisan policy firm Energy Innovation to realize the jobs and economic benefits envisioned here. The memo’s primary policy recommendation is establishing a technology-neutral national clean energy standard targeting 90 percent by 2035 and 100 percent by 2045. Additional recommendations to unlock a clean energy future include complementary policies that support clean energy deployment, address wholesale market failures, remake utility grid regulation, and ensure an equitable and fair energy transition for impacted communities.\n “What an incredible opportunity for economic stimulus. A federal clean energy standard, supported by government investments in deployment and American manufacturing, could put us back on track for a healthier economy. Meanwhile, continued policy leadership from the states can bolster progress,” said Sonia Aggarwal, Vice President at Energy Innovation.\n    The Center for Environmental Public Policy, housed at UC Berkeley’s Goldman School of Public Policy, takes an integrated approach to solving environmental problems and supports the creation and implementation of public policies based on exacting analytical standards that carefully define problems and match them with the most impactful solutions.\n  GridLab is an innovative non-profit that provides technical grid expertise to enhance policy decision-making and to ensure a rapid transition to a reliable, cost effective, and low carbon future.\n  Energy Innovation is a nonpartisan energy and environmental policy firm, delivering high-quality research and original analysis to policymakers to help them make informed choices on energy policy. Energy Innovation’s mission is accelerating clean energy by supporting the policies that most effectively reduce greenhouse gas emissions, working closely with policymakers, other experts, NGOs, the media, and the private sector.", "posttime": "2020-06-20 09:42:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "增加,consumer,政策", "title": "美国到2035年可以在不增加消费者账单的情况下达到90%的清洁电力", "title_en": "The US can reach 90% clean electricity by 2035 without increasing consumer bills", "transed": 1, "url": "https://gspp.berkeley.edu/news/news-center/the-us-can-reach-90-percent-clean-electricity-by-2035-dependably-and-without-increasing-consumer-bills", "via": "", "real_tags": ["增加", "consumer", "政策"]}, {"category": "", "categoryclass": "", "imagename": "79f2ad766d39132593e10b096586ac31.png", "infoid": 1007353, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这不是新闻。这是我们知道它一直在发生的那种事情，但是的，这就是生活，我们只是忍受它，不去想太多。\n我知道Facebook是邪恶的已经有一段时间了，但老实说，我喜欢通过Instagram和Facebook与我的朋友保持联系，所以我只是忍受它。那好吧。\n最近，发生了一件让我在专业层面上感到震惊的事情：苹果，从字面上讲，正在让Basecamp的产品嘿成为他们的人质。\n如果你不知道发生了什么，嘿是一项基于订阅的电子邮件服务。简而言之，苹果要求Basecamp实现应用内购买--你使用触摸/面部ID，它就会为你执行购买。他们说，每一个有支付功能的应用程序(无论在哪里)都需要有IAP。\n但需要注意的是，他们会从中抽取30%的佣金。所以他们要从Basecamp每年99美元的价格中扣除30美元。\n这比Facebook侵犯我的隐私对我的打击更大，因为那可能是我。我是一名开发人员，我本可以发布一款产品，但也会面临同样的情况。\nBasecamp(DHH和Jason)可以发出他们的声音，但有多少公司(特别是小公司)也面临同样的情况，刚刚屈服于苹果的“规则”，刚刚被减薪30%？\n当然，你可以争辩说，任何人都不能就是不把他们的应用程序放到App Store上。这就是资本主义--如果你不喜欢某样东西，你就不用它。这不是问题所在。问题不仅是他们收取的费用荒谬，而且也没有留下任何其他选择。您需要让Apple处理您的付款。这不像是“嘿，你可以使用这种非常方便的支付方式，用户只需扫描他们的脸就可以为你的商品付款，从而提高你的转换率”。它是“如果你不让你的用户通过应用程序付款，让我们从所有付款中抽取30%，你的应用程序就不会出现在App Store上。”\n所以，基本上，你要么同意他们的条款，要么将你的应用程序从App Store中删除。真的没有任何选择-我相信Basecamp有足够的资源在没有应用程序的情况下生活-尽管远不理想-或者只是支付赎金，但大多数小公司不得不接受减薪，这肯定会严重影响他们的利润。\n我们必须记住，大多数公司并不像Basecamp那样稳定，非常有利可图，拥有巨大的资源，支付赎金可能会过得很好。他们不稳定，规模小，通常不会赚取任何巨额利润，如果他们抱怨，苹果会直接切断他们的业务。\n我并不是说巴塞坎普是错的或别的什么--事实上，我非常感谢他们对这个问题发出了自己的声音。他们很可能只是同意了苹果的条款，要么提高了价格，要么只是靠较小的利润生活。相反，他们决定公开反对苹果，向全世界展示他们的所作所为。\n我敢肯定，其他公司也面临着同样的问题，只是没有像Basecamp那样的受众，一切都落空了。\n首先，我必须说，我理解，从理论上讲，苹果可以收取任何他们想要的费用。我们才是接受他们条件的人，而不是反过来。\n这并不能阻止这完全是荒谬的-当然，你可以以2000美元的价格出售一部iPhone，而其他商店的售价为1000美元，但人们可以在其他地方购买。\n现在，当你实际控制了整个市场，而你甚至没有提供选择的时候，情况就会改变。正如我所说的，如果他们只提供IAP服务，同时收取30%的费用，那就不那么麻烦了-你不能在你的应用程序中有这个选项，然后让人们在其他地方付费。这就是巴塞坎普所做的。就像Netflix、亚马逊、Spotify和许多其他应用程序一样。\n现在，当真正控制市场的公司要求你向他们支付30%的费用，如果你想以任何方式利用这款应用程序，并强迫你拥有IAP时，情况开始发生变化。这不是一种好的行为。这是完全错误的。\n我真的不知道怎么解决这个问题。我认为最好的方式就是正在发生的事情--人们大声抱怨，我们只能希望苹果倾听并修改他们的行为和条款。如果更多像Basecamp这样的公司决定与他们对抗而不是接受它，那就太好了。\n不过，有一个简单得离谱的选择：让开发人员决定是否需要IAP。如果他们这样做了，向你可笑的30%收取费用，但至少给他们一个选择。\n如果你对此有什么想法，我很乐意听听。请将它们发布在下面的评论区或我发表这篇文章的媒体上。\n非常感谢您的阅读，如果您想阅读更多或更多关于我的信息，请在Twitter上关注我。\n跟踪我的文章、教程和课程，并直接在您的收件箱中接收有价值的信息。\n谢谢订阅！", "note_en": "This Is not news. It’s the kind of thing we know it’s been happening, but yeah, that’s life, we just bear with it and don’t think much about it.\n I’ve known Facebook is evil for awhile, but honestly, I like to keep in touch with my friends through Instagram and Facebook so I just bear with it. That’s okay.\n Now, recently, something happened that kind of hits me on a professional level:  Apple is, literally, making HEY, a Basecamp product, their hostage.\n If you don’t know what happened, HEY is a subscription-based email service.  All payments are made through the web application.In short, Apple requires Basecamp to implement  In-App Purchases — that little thing where you use touch/Face ID and it performs a purchase for you. They say every app that has payments (doesn’t matter where) needs to have IAP.\n The caveat is they take a 30% cut on this. So they’re taking 30 bucks out of Basecamp’s $99/year price.\n This hits me harder than Facebook invading my privacy because that could have been me. I’m a developer and I could have released a product and faced the same situation.\n Basecamp (DHH and Jason) can make their voice heard, but how many companies (specially the small) have faced the same thing and just succumbed to Apple’s “rules” and just had a 30% pay cut?\n Sure, you can argue that anyone can just not put their app on the App Store. That’s capitalism — if you don’t like something, you don’t use it. That’s not what is in question. The issue is not only the ridiculous fee they charge, but also not leaving any other options. You are  required to let Apple process your payments. It’s not like it’s “hey, you can use this very convenient payment method where the user only scans their face and pay for your item, making your conversion rate higher”. It’s “if you do not let your users pay through the app and let us take 30% of all payments, your app is not going on the App Store.”\n So, basically, you either agree to their terms or you have your app out of the App Store. There really isn’t any option really — I believe Basecamp has the resources to live without an app — though far from ideal — or to just pay the ransom, but most small companies have to take that pay cut which definitely severely impacts their profit.\n We must keep in mind that most companies aren’t like Basecamp — stable, very profitable, with huge resources and that could, probably, live just fine paying the ransom. They’re unstable, small, usually not making any huge profits and if they were to complain Apple would just cut them off.\n I’m not saying that Basecamp is wrong or anything — I actually am very thankful that they raised their voices to this issue. They could very well have just agreed to Apple terms and either raised the prices or just lived of a smaller profit. Instead, they decided to publicly fight Apple and show what they’re doing to the whole world.\n I’m sure other companies faced the same issue and just didn’t have an audience as Basecamp do, and everything fell into the void.\n  First, I must say that I understand that, theoretically, Apple can charge whatever they want. We are the ones accepting their terms, not the other way around.\n It doesn’t stop this from being completely ridiculous — sure, you can sell an iPhone for $2000 while other stores sell it for $1000, but people can just buy it someplace else.\n Now, when you actually control the whole market and you  don’t even offer an option, things change. As I said, if they simply offered the IAP service while charging 30%, that’s less troublesome — you can not have that option in your app and let people pay somewhere else. This is what Basecamp did. Just like Netflix, Amazon, Spotify and many other apps.\n Now, when the company that literally controls the market, demands you pay them 30% if you want to make money of the app in any way, and obligates you to have IAP, things start to change. That’s not an okay behaviour. This is completely wrong.\n  I honestly don’t know how to solve this. I think the best way is what’s happening — people are making their complaints out loud and we can only hope Apple listens and revises their behaviour and terms. It’d be great if more companies like Basecamp decided to fight them instead of accepting it.\n There is a ridiculously simple option though: let developers decide wether they want IAP or not. Charge your ludicrous 30% if they do, but at least give them an option.\n If you have any thought on this, I’d love to hear them. Please post them on the comments section below or on the media I posted this article on.\n Thanks so much for reading, and if you want to read more or know more about me,  give me a follow on Twitter.\n   Keep track of my articles, tutorials and courses and receive valuable information directly in your inbox.\n  Thanks for subscribing!", "posttime": "2020-06-20 09:41:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,开发,app,apple,tech", "title": "大型科技公司正在夺走我们的自由-苹果公司是如何要求开发者支付赎金的", "title_en": "Big Tech is taking our freedom – How Apple is making developers pay ransom money", "transed": 1, "url": "https://mateusguimaraes.com/posts/big-tech-is-taking-away-our-freedom-how-apple-is-making-companies-their-hostages-and-demanding-ransom-money", "via": "", "real_tags": ["苹果", "开发", "app", "apple", "tech"]}, {"category": "", "categoryclass": "", "imagename": "82c94b2bf942d34d2a41af70925f5c71.jpg", "infoid": 1007352, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到主要内容它是从实验开始的。史蒂夫·科利刚刚想出如何在屏幕上旋转一个立方体，霍华德·帕尔默就建议他们可以制作一个三维迷宫。\n那一年是1973年。他们是参加NASA勤工俭学项目的高三学生，任务是测试Imlac PDS-1和PDS-4小型机的极限。他们的迷宫程序以简单的线框图形和几乎没有现代游戏的装饰品的形式闪现在生活中。你可以用第一人称四处走动，寻找一条走出迷宫的路，仅此而已。没有物体，也没有虚拟的人。只是一个迷宫。\n但是迷宫会在夏天和随后的几年里进化。很快，两个人就可以通过不同的计算机连接在一起占据迷宫。然后他们可以互相射击，甚至可以在角落里偷看。不久，多达8个人可以在同一个迷宫中玩耍，将他们的朋友炸过阿帕网-互联网的前身。在id Software凭借“沃尔芬斯坦3D”和“末日”改变游戏行业的二十年前，科利、帕尔默和麻省理工学院的学生格雷格·汤普森和戴夫·莱布林发明了第一人称射击游戏。\n这就是迷宫的故事，这款视频游戏号称可能比其他任何游戏都拥有更多的“第一”-第一个第一人称射击游戏，第一个联网的多人游戏，第一个同时具有头顶和第一人称查看模式的游戏，第一个带有修改工具的游戏等等。\n格雷格·汤普森(Greg Thompson)总是对电子比医学更感兴趣，而他的麻醉师父亲曾试图推动他进入医学领域。他有一个合适的导师，约翰·麦科勒姆(John McCollum)，他是霍姆斯特德高中(Homestead High School)的电子老师，汤普森认为他是硅谷的无名英雄。也许最值得注意的是，苹果联合创始人史蒂夫·沃兹尼亚克(Steve Wozniak)和史蒂夫·乔布斯(Steve Jobs)(比汤普森高一岁)从麦科勒姆那里学到了制造Apple I电脑所需的技能。\n1972年夏天，麦科勒姆让汤普森参加了美国宇航局艾姆斯研究中心的大学勤工俭学项目。在那里，汤普森结识了旧金山湾区的高中同学史蒂夫·科利和霍华德·帕尔默。他们在NASA Ames的计算机图形实验室工作，该实验室正在研究计算流体力学，以帮助设计未来的航天器。\n实验室里有几个Imlacs。这些都是带有图形显示的可编程小型机，有点像当时的高端个人计算机，有足够的内存来处理一个人运行当时通过的一个相当大的程序。科利、帕尔默、汤普森和小组其他成员的任务是探索这些系统的能力-实验和突破界限。当然，作为青少年，这导致他们大部分时间都在玩游戏。他们从Pong等2-D游戏开始，并复制了其他早期的街机游戏，如Drop Zone，他们经常在当地多哥的三明治店玩Drop Zone，希望获得足够高的分数，赢得一个免费的三明治。\n1973年，科利想出了如何在不显示背面线条的情况下旋转屏幕上的线框立方体。到目前为止，小组中的资深成员科利和帕尔默一直克制着不做任何游戏。他们的重点是严肃的、“有用的”软件。但有一天，当他们在思考如何让事情变得有趣时，他们想到了创建一个联网的多人迷宫游戏的想法。帕尔默认为3-D会很酷，但科利怀疑这是不可能的，直到帕尔默指出，如果迷宫只有90度的角度，它就可以工作。科利很兴奋，第二天带着一个实现回来了，汤普森说，这个实现实际上是一堆立方体堆叠在一起。“在那里”的立方体构成了墙壁，而其余的则充当走廊。由此，汤普森继续说，“你基本上得到了一个迷宫。你可以看到你可以走下去的走廊。“\n迷宫很小，大小为16×32个正方形。汤普森说，它的图形提供了一种置身于空间的感觉，他们三人喜欢在大厅里徘徊寻找出路。但科利在为DigiBarn计算机博物馆举办的回顾展上写道，很快就变得无聊起来。你可以解决这个迷宫，仅此而已。然后，三人中的一个人有了一个想法：如果迷宫里还有其他东西呢？Colley增加了一些额外的代码，并用串行电缆直接连接了两个Imlacs。当被问及他们是如何想出这个想法时，汤普森说：“你可以潜在地与另一台机器通信，这似乎是很自然的。”\n突然之间，你可能会有两个人一起在迷宫里走来走去，每个人都有一个1到8个字符的浮动用户名和一个简单的图形指示来显示每个人的位置和方向-如果他们面对你，两个点代表眼睛，如果他们向左或向右看，箭头，如果他们离开，什么都没有。\n为了让事情更有趣，他们增加了子弹。现在你不仅可以看到第二个人，还可以开枪打死那个人。作为最后的贡献，科利增加了在步入一条新走廊之前偷看角落的能力。只要你按住钥匙，你的视线就会在拐角处移动，但是你不能在偷看的时候做其他的事情。\n在这一点上，除了它的三位创造者之外，迷宫并没有引起太多的关注，但在他们高中毕业后，这种情况很快就改变了。1973年秋天，科利去了加州理工学院，帕尔默去了斯坦福，而汤普森带着梅兹和其他IMLAC项目一起去了麻省理工学院。在麻省理工学院，他参与了MAC项目，该项目后来成为该学院的计算机科学实验室，他遇到了动态建模小组-该小组正在制作自己的游戏。\n戴夫·莱布林(Dave Leering)可能是你最不会想到的人，他发明了第一人称射击游戏。他是Infocom的联合创始人，Infocom是一家在冒险游戏没有图形之前为个人电脑制作冒险游戏的公司。在图形冒险兴起之前，Infocom富有想象力的纯文本游戏在20世纪80年代上半叶主导了整个行业。莱布林与人合写了其中的第一部，也可能是最著名的一部：佐克(Zork)，这是一场他感到惊讶和高兴的冒险，至今仍是许多创意头脑喜爱的灵感源泉。但在他做这一切之前，戴夫·莱布林帮助将“迷宫”扩展成了一种更生动的体验。\n莱布林不记得汤普森带到麻省理工学院拍摄过的迷宫版本。“你在迷宫里徘徊，就是这样，”他说。不管枪击是在迷宫到达麻省理工学院之前还是之后不久增加的，莱布林和汤普森很快就合作了。汤普森专注于Imlac方面的事情，因为他对这台机器更了解，莱布林说他将在PDP-10主机上工作-这是楼上的一台大电脑，Imlacs一家都与之相连。\n在NASA Ames，每个Imlac都运行自己版本的迷宫，并在当地计算位置-这一怪癖可能会导致关于是否有人被枪击的差异。有了大型机，他们可以将这项工作卸载到一台中央机器上，该机器将协调所有的动作，并将它们广播给所有玩家。\n“它花了一定的调试时间，”莱布林回忆道，“但它起作用了，而且真的很酷。”在雷柏林的帮助下，梅兹获得了在一个网络上最多处理8名玩家的能力。汤普森添加了代码，以跟踪显示导弹沿着走廊飞行的分数和图形。莱布林还编写了一个迷宫编辑器，允许玩家创建新地图。\n“这很简单，”他解释说。“你调用了一个文本编辑器，创建了一个网格-我忘了我们使用的是什么字符，但它可能是空格以外的任何字符。您刚刚创建了一个文本字符网格，其中有1，其中有墙，而0，其中没有经过处理的字符。“。\n“人们会尝试各种怪异的迷宫想法，”莱布林说。但标准迷宫的用处最大。“它有一些非常扭曲的部分，还有一些长长的走廊，所以你可能会躲到走廊里，向相当远的人开枪，然后躲回去，他们就会死。”\n消息在实验室里传开了，实验室里有八个Imlacs。“人们开始玩游戏，这是一个巨大的--从今天的意义上说，这是一件病毒式的事情，”莱布林说，“因为我们不是实验室里唯一的研究小组。”\n人们从大楼的其他楼层赶来只是为了玩迷宫。莱布林说：“Imlacs非常稀缺，我们实际上必须注册才能使用它们。”“所以人们会在半夜来玩，他们会互相射击，跑来跑去，会有一个跑动的比分，诸如此类。”汤普森说，任何麻省理工学院的学生或教授都可以在该系统上开设账户，因此消息很快就传遍了校园。在“末日之战”占领大学宿舍本地网络的20年前，麻省理工学院的学生正在电脑上做同样的事情，这是为了进行尖端研究。\n在这种受欢迎程度的刺激下，这两个人不断添加新功能。他们喜欢玩迷宫，但他们真正的热情是让它变得更好，学到更多东西，给他们的朋友留下深刻印象。汤普森的成绩也开始下滑。“我可能花了很多时间编写代码，让它正常工作，因为我对它很感兴趣，”他说。“我想这么做，而且我也在学习。”莱布林的驱动力略有不同：“我认为，写游戏和看别人玩游戏比玩游戏更有趣。”\n他们增加了一个自上而下的视图，你可以切换到这个视图来看到整个迷宫，更好地规划你的路线，但需要注意的是，当你看着它的时候，有人可以相当容易地偷偷接近你。汤普森增加了作弊行为，使穿越墙壁成为可能，而莱布林则在写机器人玩家。\n“人们开始玩耍，这是一个巨大的--在今天的意义上，这是一件病毒式的事情。”\n“并不总是有足够的人让它变得有趣，”莱布林说，“所以我决定写一个非常愚蠢的人工愚蠢的小程序，而不是人工智能的机器人程序。”你可以启动一堆机器人。如果你想一个人玩七个机器人，你可以做到。人们会这样做，机器人会在迷宫中徘徊，向你开枪。“\n这些机器人对许多玩家来说太好了。“我们必须让它们比正常情况下移动得慢一些，”莱布林说。“他们会适应性地认为他们打你打得太多，让自己变得更愚蠢，或者如果你打得太多，他们会让自己变得更聪明。”当时有一些反馈。“。\n然而，莱布林指出，机器人并不能取代人类玩家。他说，如果你“感到无聊，想一个人玩”，它们只是一个有趣的选择。\n最好的迷宫玩家肯·哈伦斯汀(Ken Harrenstien)很快在大型机上重写了大部分程序，使其更有效率，而查尔斯·弗兰克斯顿(Charles Frankston)在Imlacs部分也做了同样的事情。这使得在PDP-10主机上运行两个或更多同时进行的迷宫游戏变得更加可行。\n与此同时，他们研究小组的另一名成员Tak to编写了一个名为Maze Watcher的程序，允许人们在Evans和Sutherland LDS-1图形显示计算机上观看比赛。“你可以坐在图形计算机显示器所在的实验室里，你可以在你的朋友们玩的时候为他们欢呼，”莱布林回忆道，模仿着“加油，加油！哦不！他就在拐角处！“。\n梅兹的受欢迎程度不仅仅停留在麻省理工学院的城墙内。他们通过ARPANET在全国范围内共享源代码。莱布林认为，在ARPANET上玩的第一个迷宫游戏是在麻省理工学院和加州大学圣克鲁斯分校的学生之间进行的。它的速度很慢--当时的ARPANET只有50千比特的网络，比今天快速的互联网连接管理的兆字节甚至几十亿字节慢了几个数量级。但这真是太棒了。\n也许甚至有点太美妙了。传说迷宫后来被负责运营ARPANET的国防高级研究计划局(DARPA)禁止了一段时间，因为每月通过网络发送的所有数据包(基本上是数据)有一半是在麻省理工学院和斯坦福之间飞行的。实验室主任J·C·R·利克利德(J.C.R.Licklider)和艾尔·维扎(Al Vezza)早在那之前就担心迷宫会被视为过于轻浮。他们不鼓励在由DARPA资助的实验室里玩迷宫游戏，以保持事情的严肃性，并保持Imlacs可用于严肃的工作。\n“[迷宫]堵塞了IMLACS，这是一种非常稀缺的资源，”莱布林说。“要运行迷宫，你必须加载迷宫程序，而不是通常的终端程序，因为这些东西只有8K内存，(所以)人们会加载迷宫程序，然后忘记重新加载终端程序，否则它会崩溃，他们不知道如何重启Imlac，这并不复杂，但比现在重启一台个人电脑要困难得多。”\n为了对抗这一点，董事们禁止了梅兹。(尽管他们也曾在多个场合被发现玩游戏并享受比赛。)。这是徒劳的努力。这些计算机都在网络上，所以人们会简单地从另一台机器上复制它，或者隐藏一些可以再次下载程序的代码。事情很快就升级了，有人添加了一个守护程序-一个在后台运行的程序，用来寻找迷宫的实例并使它们崩溃。\n通过使用不同的签名重新编译迷宫代码，或者利用系统没有任何安全性来禁用Guncher守护程序这一事实，可以很容易地击败这个迷宫Guncher。“这只是黑客和非黑客之间的事情，”莱布林说。“这场小战争来来回回地进行着。”\n1976年秋天，格雷格·汤普森(Greg Thompson)、马克·霍洛维茨(Mark Horowitz)和乔治·沃尔特曼(George Woltman)一起报名参加了电气工程数字硬件设计课程。对于他们的班级项目，汤普森建议他们制作一个只运行迷宫的系统。\n“我觉得会很有趣，然后我们就开始考虑怎么做，怎么建造它。这似乎是一件相当复杂和令人兴奋的事情，但谈到它，我们认为我们可以弄清楚如何才能真正实施它，“霍洛维茨说。“我们告诉班上的助教，我们要这么做，他们告诉我们，他们基本上不认为这是个好主意，但如果我们愿意，我们可以继续尝试。”\n三人决定，如果他们让游戏变得更复杂，就会更容易构建。虽然最初的迷宫实际上是一个以线段绘制的二维迷宫，但新版本完全是3-D的。在迷宫的硬件版本中，您可以在一个16x16x16的立方体内向任何方向旋转，该立方体在每个维度上都有四层。\n“我们这么做的原因是它让游戏完全对称，”霍洛维茨解释说。“事实证明，从硬件的角度来看，这样做要容易得多，因为没有那么专业的表面。所以基本上，你是在一个没有重力的迷宫中行走。你可以左转、右转，也可以上转或下转。“。\n这几乎和听起来一样令人困惑，但他们发现这令人振奋。然后沃尔特曼增加了机器人玩家。“他们打得比我们好得多，因为他们从来没有感到困惑，”霍洛维茨回忆道。“他们只是遵循一些相当简单的规则，四处寻找人们，当他们看到他们时，他们就开枪打死了他们。”\n与此同时，霍洛维茨将忙于试图回忆起他在迷宫中的什么位置。“(我)试图记住哪一头是向上的，”他说。“他们不在乎。他们只是走了过去，找到了空缺，然后继续往前走。“。\n就像Imlac版的迷宫一样，你可以让机器人玩得更好或更差，但在这种情况下，这完全是改变处理器上的时钟频率的问题。汤普森解释说：“如果你想让它播放得更快，你只需要调高时钟频率，让整个系统运行得更快一点。”\n至于显示器，如果没有图形处理器，他们必须要有创意。霍洛维茨说：“我们最终决定使用示波器，因为它们在实验室里是用来帮助你调试硬件的。”“我们在X-Y模式下使用它，我用它作为矢量绘图显示。所以我没有像今天所有的显示器那样做光栅扫描，而是在屏幕上画了线。“。\n霍洛维茨还画了子弹，你可以看到子弹从屏幕上飞下来，随着子弹越来越近，逐渐变大，随着子弹离开，子弹逐渐变小。\n这款游戏令人印象深刻，以至于三人在项目中获得了近乎完美的分数，实验室将Hardware Maze保留了一到两年，作为向其他学生展示的示例游戏。对于霍洛维茨来说，令他惊讶的不仅是人们今天仍然关心这个项目，而且他还能记住所有的事情。“我的记忆力真的很差，”他说。“我不记得两周前我做了什么，更不用说40年前了。但事实是，我记得迷宫游戏。我记得那是什么感觉。图形看起来是什么样子，它是如何工作的，我只记得它试图建造它是多么令人兴奋。“。\n“迷宫”的许多创造者各自朝不同的方向出发。雷布林和他的几名动态建模团队成员创立了Infocom，而汤普森则在科技行业四处奔波，为数字设备公司(Digital Equipment Corporation)、Ncube和思科(Cisco)等公司担任顾问、工程师和设计师。史蒂夫·科利(Steve Colley)创立了Ncube，成为早期视频点播行业的领先者。霍洛维茨成为斯坦福大学计算机系统实验室的主任。乔治·沃尔特曼接着发现了几个已知的最大质数。\n迷宫还在继续，变异和传播到整个计算机世界。吉姆·盖顿(Jim Guyton)为施乐的Alto和Star个人电脑的光栅显示器重写了Imlac版本，将其重新命名为迷宫战争，并将迷你地图添加到主显示器的底部。苹果公司早期Macintosh团队的两名成员看到了这个版本，并出于测试目的编写了自己的版本--Gene Tyacke的Bus‘d Out在阿尔法级别的完成时泄露出来，测试了AppleTalk网络协议的早期版本，而伯特·斯隆(Burt Sloane)的迷宫战争(Maze Wars)则展示了一个文件传输和消息传递服务器。\n斯隆的迷宫战争被MacroMind重新制作和扩展，成为1986年Mac发布的迷宫战争+的第一个商业版本，这后来导致Callisto公司在1993年制造了一个更复杂、更充实(更不用说256色)的版本，称为超级迷宫战争-也适用于Mac。\n迷宫也出现在其他几个平台上。Xanth软件公司于1987年将其作为MIDI迷宫放在雅达里街。他们的标题指的是使用MIDI电缆将计算机串在一起进行多人比赛。程序员迈克尔·帕克通过电子邮件解释说：“我们只是在环上传递操纵杆数据，然后每台机器都更新了它的世界状态，重新绘制了屏幕，然后重复。”每个人都必须在最慢的机器上等待(以显示时间最长的机器为准)。“。\n他们还编写了一个雅达利8位版本，虽然已经完成，但从未发布。由程序员马库斯·弗里茨(Markus Fritz)领导的一个德国团队对MIDI迷宫进行了逆向工程，这样他们就可以更新它，修复MIDI迷宫2的错误。弗里茨说，这个版本只卖出了大约200份，但尽管如此，它还是在世界各地发展了一批狂热的追随者，直到今天，玩家们仍然聚集在一起参加半定期的锦标赛。\n迷宫还进入了游戏男孩，更名为Faceball 2000，以及其他几个90年代初的游戏机和手持设备，以及Palm OS，NextStep和更多平台。\n它的最初创作者似乎对梅兹的长寿和遗产感到有点困惑。汤普森说：“这只是我和我周围的人在将技术推向一个有趣的领域方面所做的一种小小的贡献。”“我们可能从石器时代就开始玩游戏了。它是。\n..", "note_en": "Skip to main content                                                                                                                It started as an experiment. Steve Colley had just figured out how to rotate a cube on the screen when Howard Palmer suggested they could make a three-dimensional maze.\n The year was 1973. They were high school seniors in a work-study program with NASA, tasked with testing the limits of the Imlac PDS-1 and PDS-4 minicomputers. Their maze program flickered into life with simple wireframe graphics and few of the trappings of modern games. You could walk around in the first person, looking for a way out of the maze, and that’s about it. There were no objects or virtual people. Just a maze.\n But  Maze would evolve over the summer and the years that followed. Soon two people could occupy the maze together, connected over separate computers. Then they could shoot each other and even peek around corners. Before long, up to eight people could play in the same maze, blasting their friends across the ARPANET — a forebear to the internet. Two decades before id Software changed the game industry with  Wolfenstein 3D and  Doom, Colley, Palmer and MIT students Greg Thompson and Dave Lebling invented the first-person shooter.\n This is the story of  Maze, the video game that lays claim to perhaps more “firsts” than any other — the first first-person shooter, the first networked multiplayer game, the first game with both overhead and first-person view modes, the first game with modding tools and more.\n  Greg Thompson was always more interested in electronics than medicine, which his anesthesiologist father had tried to push him into. He had just the right mentor, John McCollum, who was the electronics teacher at Homestead High School and who Thompson believes is the unsung hero of Silicon Valley. Perhaps most notably, Apple co-founders Steve Wozniak and Steve Jobs (who was a year above Thompson) learned the skills they required to build the Apple I computer from McCollum.\n In the summer of 1972, McCollum got Thompson into a college-level work-study program at NASA’s Ames Research Center. There Thompson met fellow Bay Area high schoolers Steve Colley and Howard Palmer. They worked in the computer graphics lab at NASA Ames, which was doing research into computational fluid dynamics to help design future spacecraft.\n  The lab had several Imlacs. These were programmable minicomputers with graphical displays — sort of the high-end personal computer of the time with enough memory to handle one person running what passed then for one decent-sized program. Colley, Palmer, Thompson and the rest of the group were tasked with exploring the capabilities of these systems — to experiment and push the boundaries. Being teenagers, this, of course, led to them mostly making games. They started with 2-D games like  Pong and duplications of other early arcade titles such as  Drop Zone, which they regularly played at their local Togo’s sandwich shop in hopes of getting a score high enough to win a free sandwich.\n In 1973 Colley figured out how to rotate a wireframe cube on the screen without the lines at the back showing. Up to this point, Colley and Palmer, the senior members in the group, had refrained from making any games. Their focus was on serious, “useful” software. But one day while thinking about how to make something fun, they came up with the idea of creating a networked, multiplayer maze game. Palmer thought it would be cool in 3-D, but Colley doubted it was possible until Palmer noted that it could work if the maze had nothing but 90-degree angles. Colley got excited and returned the next day with an implementation that Thompson says was, effectively, a bunch of cubes stacked next to each other. The cubes that were “there” formed the walls while the rest acted as hallways. From that, Thompson continues, “You basically got a maze. You could see corridors you could walk down.”\n The maze was small, sized 16 squares by 32. Thompson says that its graphics provided a sense of being in a space, and the three of them enjoyed wandering around its halls looking for the way out. But Colley, writing in  a retrospective for the DigiBarn Computer Museum, notes that it got boring soon enough. You could solve the maze, and that was it. Then one of the trio had an idea: What if there were something else in that maze? Colley added a little extra code and connected two Imlacs directly with a serial cable. “It just seemed natural that you could potentially communicate to another machine,” Thompson says when asked how they came up with the idea.\n  Suddenly you could have two people walking around the maze together each with a one to eight character floating username and a simple graphical indication to show each person’s location and orientation — two dots for eyes if they’re facing you, arrows if they’re looking left or right, nothing if they’re moving away.\n To make things even more interesting, they added bullets. Now you could not only see a second person but shoot the person as well. And as a final contribution, Colley added the ability to peek around corners before stepping into a new corridor. Your viewpoint would shift around the corner so long as you held the key down, but you couldn’t do anything else while peeking.\n Maze wasn’t drawing much attention outside of its three creators at this point, but that quickly changed after they graduated high school. In the fall of 1973, Colley went to Caltech and Palmer to Stanford while Thompson took  Maze and the rest of their Imlac programs with him to MIT. And at MIT he got involved with Project MAC, which later became the college’s computer science laboratory, and he met the dynamic modelling group — which was making games of its own.\n   Dave Lebling may be the last person you’d expect to have been involved with inventing the first-person shooter. He was co-founder of Infocom, which was a company that made adventure games for personal computers before adventure games had graphics. Infocom’s imaginative text-only games dominated the industry in the first half of the 1980s, before graphic adventures rose to prominence. And Lebling co-wrote the first and perhaps most famous of those:  Zork, an adventure that he’s surprised and delighted to see is still a beloved source of inspiration for many creative minds. But before he did any of that, Dave Lebling helped expand  Maze into a livelier experience.\n Lebling doesn’t recall the version of  Maze that Thompson brought to MIT having shooting in it. “You wandered around in a maze, and that was it,” he says. Regardless of whether the shooting was added before or shortly after  Maze reached MIT, Lebling and Thompson soon teamed up. Thompson focused on the Imlac side of things since he knew the machine better, and Lebling said that he would work on the PDP-10 mainframe — the big computer upstairs that the Imlacs were all connected to.\n At NASA Ames, each Imlac ran its own version of  Maze and calculated positions locally — a quirk that could lead to discrepancies over whether someone was shot or not. With the mainframe, they could offload this work to a central machine that would coordinate all moves and broadcast them to all players.\n  “It took a certain amount of debugging,” Lebling recalls, “but it worked, and it was really cool.” With Lebling’s help,  Maze gained the ability to handle up to eight players on a network. Thompson added code to keep track of scores and graphics that would show missiles travelling down a corridor. And Lebling also wrote a maze editor, which allowed players to create new maps.\n “It was very simple,” he explains. “You called up a text editor and you created a grid of — I forget what character we used, but it may have been any character other than space. You just created a grid of text characters that had 1s where there were walls and 0s where there weren’t once it was processed.”\n “People would try various bizarre ideas for mazes,” Lebling says. But the standard maze got the most use. “It had some very twisty parts and it had some long hallways, so you could potentially duck out into the hallway and shoot at someone who was quite far away and then duck back and they would die.”\n Word got around in the lab, which had eight Imlacs. “People started playing and it was an enormous — it was a viral thing in today’s sense,” Lebling says, “because we weren’t the only research group in the lab.”\n People came from other levels in the building just to play  Maze. “The Imlacs were sufficiently scarce that we actually had to sign up to use them,” Lebling says. “So people would come in the middle of the night to play and they would shoot each other and run around and there’d be a running score and so forth.” Thompson says that any MIT student or professor could set up an account on the system, so word quickly spread around campus. Twenty years before  Doom death matches took over local networks in college dorm rooms, MIT students were doing the same thing on computers meant for cutting-edge research.\n Spurred on by this popularity, the pair kept adding new features. They enjoyed playing  Maze, but their true passion was making it better, learning more and impressing their friends. Thompson’s grades started to slip, too. “I probably spent a lot of time coding and getting it working because I was intrigued by it,” he says. “I wanted to, and I was learning.” Lebling’s driving motivation differed slightly: “Writing [games] and watching other people enjoy them was, I think, more fun than playing them,” he says.\n They added a top-down view that you could switch into to see the whole maze and better plan your routes, but the caveat was that, while you were looking at that, someone could sneak up on you fairly easily. Thompson added cheats that made it possible to pass through walls while Lebling wrote robot players.\n “People started playing and it was an enormous — it was a viral thing in today’s sense”\n “There weren’t always enough people to make it interesting,” Lebling says, “so I decided to write a little really stupid — artificial stupidity rather than artificial intelligence — robot program. You could start up a bunch of robots. If you wanted to play by yourself with seven robots you could have done it. And people would do that and the robots would wander around the maze and shoot you.”\n The robots were too good for many players. “We had to make them move slower than they normally could have,” Lebling says. “They adaptively decided they had beaten you too much and made themselves stupider, or if you beat them too much, they would make themselves smarter. There was a bit of feedback going on there.”\n Nevertheless, Lebling notes, the robots were no substitute for human players. They were simply a fun option for if you were “bored and wanted to play by yourself,” he says.\n The very best  Maze player, Ken Harrenstien, soon rewrote much of the program on the mainframe to make it more efficient, while Charles Frankston did the same on the Imlacs portion. This made it more feasible for two or more simultaneous  Maze games to run through the PDP-10 mainframe.\n Meanwhile, another man in their research group, Tak To, wrote a program called Maze Watcher, which allowed people to watch matches on an Evans and Sutherland LDS-1 graphics display computer. “You could sit in the lab that the display for the graphics computer was in and you could cheer on your friends as they played,” Lebling recalls, mimicking “Go go go! Oh no! He’s around the corner!”\n Maze’s popularity didn’t stay just within MIT’s walls. They shared the source code across the country via the ARPANET. Lebling believes that the first game of  Maze played over the ARPANET was between students at MIT and the University of California, Santa Cruz. It was slow — the ARPANET of the time was only a 50-kilobit network, which is a few orders of magnitude slower than the megabytes and even gigabytes that a fast internet connection manages today. But it was wonderful.\n Perhaps even a little too wonderful. Legend has it that  Maze was later banned for a period by the Defense Advanced Research Projects Agency (DARPA), which ran the ARPANET, because half of all packets (data, essentially) being sent over the network each month were flying between MIT and Stanford. Lab directors J. C. R. Licklider and Al Vezza worried well before then that  Maze would be seen as too frivolous. They discouraged  Maze play in the lab, which was funded by DARPA, to keep things serious and to keep the Imlacs available for serious work.\n  “[ Maze] clogged up the Imlacs, which were a very scarce resource,” Lebling says. “To run  Maze, you had to load the  Maze program in instead of the usual terminal program because these things only had 8K of memory, [so] people would load the  Maze program in and then forget to reload the terminal program, or it would crash or something and they wouldn’t know how to reboot an Imlac, which wasn’t all that complicated but was more difficult than rebooting a personal computer today.”\n To combat this, the directors banned  Maze. (Despite that they had been spotted on multiple occasions playing and enjoying the game, too.) It was a futile endeavor. The computers were on a network, so people would simply copy it over from another machine or hide away some code that would download the program again. Things soon escalated, and someone added a daemon program — a program that runs in the background to look for instances of  Maze and crash them.\n This  Maze Guncher could be easily defeated by either recompiling the  Maze code with a different signature or by taking advantage of the fact that the system had no security whatsoever to disable the Guncher daemon. “It was just this hackers versus nonhackers thing,” Lebling says. “This little war going on back and forth.”\n  In the fall of 1976, Greg Thompson, Mark Horowitz and George Woltman enrolled in an electrical engineering digital hardware design class together. For their class project, Thompson suggested they make a system designed to run just  Maze.\n “I thought it would be fun, and then we started thinking about how to do it and build it. It seemed like a pretty complicated and exciting thing, but talking about it we thought we could figure out how we could actually implement it,” says Horowitz. “We told the TAs in the class that we were going to do it, and they told us that basically they didn’t think it was a good idea but if we wanted to we could go ahead and try.”\n  The trio determined that it would be easier to build the game if they made it more complicated. Whereas the original  Maze was effectively a two-dimensional maze that was drawn in line segments, the new version was fully 3-D. In the hardware version of  Maze, you could turn in any direction inside a 16-by-16-by-16 cube that had four floors in each dimension.\n “The reason we did that was it made the game completely symmetric,” Horowitz explains. “It turned out, from a hardware perspective, it was way easier to do that because there were less specialized surfaces. So you were walking in a maze with no gravity, essentially. You could turn left, right, or you could turn up or down.”\n It was about as confusing as it sounds, but they found it exhilarating. Then Woltman added robot players. “They played so much better than we did because they never were confused,” Horowitz recalls. “They just followed some pretty simple rules and just looked around for people, and when they saw them, they shot them.”\n Horowitz, meanwhile, would be too busy trying to remember where he was in the maze. “[I was] trying to remember which end was up,” he says. “They didn’t care. They just walked through and found openings and continued moving forward.”\n Like in the Imlac version of  Maze, you could make the robots play better or worse, but in this case it was entirely a matter of changing the clock rate on the processor. “If you wanted it to play faster you’d just turn up the clock rate and run the whole system a little bit faster,” explains Thompson.\n  As for the display, without a graphics processor they had to get creative. “We ended up deciding to use oscilloscopes because they were in the labs to help you to debug your hardware,” says Horowitz. “We used it in X-Y mode and I used the display as a vector draw display. So instead of doing raster scan, which is how all displays are today, I actually drew lines on the screen.”\n Horowitz also drew bullets that you could see flying down the screen, gradually getting bigger as they came closer or smaller as they moved away.\n The game was so impressive that the trio earned near-perfect marks for the project and the lab kept hardware  Maze around for a year or two as an example game to show other students. And Horowitz, for his part, is surprised not only that people still care about the project today, but also that he can remember it all. “I have a really bad memory,” he says. “I don’t remember what I did two weeks ago let alone 40 years ago. But the truth is, I remember the maze game. I remember what it was like. What the graphics looked like and how it all worked and I just remember how exciting it was trying to build it.”\n  Maze’s many creators each went off in separate directions. Lebling and a few of his dynamic modelling group cohorts founded Infocom while Thompson flitted around the technology industry as a consultant, engineer and designer for the likes of Digital Equipment Corporation, nCube and Cisco. Steve Colley founded nCube, which became a leader in the early video on demand industry. Horowitz became director of Stanford University’s computer systems lab. And George Woltman went on to discover several of the largest known prime numbers.\n Maze carried on, mutating and spreading throughout the computing world. Jim Guyton rewrote the Imlac version for the raster displays of Xerox’s Alto and Star personal computers, renaming it  Maze War and adding the minimap to the bottom of the main display. Two members of the early Macintosh team at Apple saw this version and wrote their own for testing purposes — Gene Tyacke’s  Bus’d Out, which was leaked out at an alpha level of completion, tested an early version of the AppleTalk networking protocol, while Burt Sloane’s  Maze Wars demonstrated a file transfer and messaging server.\n   Sloane’s  Maze Wars was reworked and expanded by MacroMind as the first commercial version of  Maze with the 1986 Mac release  Maze Wars+, and that later led to Callisto Corporation making a more sophisticated and fleshed-out (not to mention 256-color) version called  Super Maze Wars in 1993 — also for the Mac.\n Maze popped up on several other platforms as well. Xanth Software put it on Atari ST as  MIDI Maze in 1987. Their title refers to the use of MIDI cables to string computers together for multiplayer matches. “We just passed joystick data around the ring,” programmer Michael Park explains via email, “then each machine updated its world state and redrew the screen, then repeated. Everyone had to wait on the slowest machine (whichever took the longest to render its display).”\n They also wrote an Atari 8-bit version that was finished but never released, and a German group led by coder Markus Fritz reverse engineered  MIDI Maze so they could update it and fix bugs for  MIDI Maze 2. Fritz says that that version only sold around 200 copies, but it nonetheless developed a cult following around the world with players still getting together today for semi-regular tournaments.\n Maze also made it onto Game Boy, retitled  Faceball 2000, and several other early ’90s games consoles and handhelds, along with Palm OS, NEXTSTEP and yet more platforms.\n Its original creators seem somewhat bemused by  Maze’s longevity and legacy. “It’s just kind of a small contribution that I and the people around me helped to make in pushing technology into a fun area,” says Thompson. “We’ve had games since probably the days of the Stone Age. It’s \n......", "posttime": "2020-06-20 09:40:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "第一人称,person,迷宫", "title": "第一个第一人称枪手(2015)", "title_en": "The first first-person shooter (2015)", "transed": 1, "url": "https://www.polygon.com/features/2015/5/21/8627231/the-first-first-person-shooter", "via": "", "real_tags": ["第一人称", "person", "迷宫"]}, {"category": "", "categoryclass": "", "imagename": "20056a5158eb54c34e2fbb0dc68595c7.jpg", "infoid": 1007350, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为提醒，最初的法律规定，在线平台应在24小时内删除已标记的非法内容。否则，公司每次违法都将不得不支付巨额罚款。对于社交媒体公司来说，这可能会让他们每年损失数百万美元。\n非法内容指的是在线下世界中被视为犯罪或犯罪的任何东西，如死亡威胁、歧视、否认大屠杀…。非法内容清单包括更广泛地称为仇恨言论的内容。\n但宪法委员会表示，这样的技术清单使得裁决哪些是非法内容，哪些不是非法内容变得困难。由于时间窗口很短，在线平台无法与法院核实一条推文、一篇帖子、一张照片或一篇博客帖子是否被视为非法。\n当你将这一点与潜在的罚款结合在一起时，宪法委员会担心在线平台会太快地审查内容。\n“鉴于很难裁定被标记的内容是否明显非法，第一次违规所招致的处罚[…]。宪法委员会写道：“这些受到质疑的条款只能鼓励在线平台提供商删除被标记的内容，无论它是否明显非法。”\n对于最极端的类别，恐怖内容和儿童色情，根据几个月前投票通过的法律，在线平台必须在一小时内做出反应。宪法委员会使用同样的措辞裁定，在线平台必须过度审查，因为它们不能将温和努力建立在法院裁决的基础上。又是言论自由了。\n鉴于法律的其余部分是基于这两个过程，它不再相关。它包括缓和过程的透明度和上诉机制。\n“我们的目标是在保护言论自由和加强网上法治之间达成艰难的妥协。政府承认宪法委员会的决定--它认为有问题的法律文本不能以目前的形式达到这一目标，“政府在一份声明中表示。\n政府和代表莱蒂夏·阿维亚表示，他们现在将根据今天的裁决进行进一步的工作。换句话说，他们又回到了绘图板上。\n德国已经通过了类似的规定，欧盟层面的讨论正在进行中。", "note_en": "As a reminder, the original law said that online platforms should remove within 24 hours illicit content that has been flagged. Otherwise, companies will have to pay hefty fines every time they infringe the law. For social media companies, it could have potentially cost them many millions of dollars per year.\n Illicit content means anything that would be considered as an offense or a crime in the offline world, such as death threats, discrimination, Holocaust denial… The list of illicit content consists of what is more broadly called hate speech.\n  But the Constitutional Council says that such a technical list makes it difficult to rule what is illicit content and what is not. Due to the short window of time, online platforms can’t check with a court whether a tweet, a post, a photo or a blog post is deemed as illicit or not.\n When you combine that with potential fines, the Constitutional Council fears that online platforms will censor content a bit too quickly.\n “Given the difficulties to rule whether flagged content is evidently illicit, the incurred penalty with the first violation […], the impugned provisions can only encourage online platform providers to remove content that is flagged, whether it is evidently illicit or not,” the Constitutional Council writes.\n  For the most extreme categories, terrorist content and child pornography, online platforms had to react within an hour according to the law that was voted  a couple of months ago. The Constitutional Council uses the same wording to rule that online platforms have to over-censor as they can’t base their moderation efforts on court rulings. Free speech again.\n Given that the rest of the law is based on those two processes, it is no longer relevant. It included transparency on moderation processes and an appeal mechanism.\n “The goal was to reach a difficult compromise between preserving free speech and enforcing the rule of law online. The government acknowledges the decision of the Constitutional Council — it believes the legal text in question can’t reach this objective in its current form,” the government said in a statement.\n The government and deputy Laetitia Avia say they’ll now base further work on today’s ruling. In other words, they’re going back to the drawing board.\n Germany has already passed similar regulation and there are ongoing discussions at the European Union level.", "posttime": "2020-06-20 09:21:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "宪法,constitutional,内容", "title": "法国宪法委员会否决强制平台删除内容的法律", "title_en": "French constitutional council rejects law forcing platforms to delete content", "transed": 1, "url": "https://techcrunch.com/2020/06/19/french-constitutional-authority-rejects-law-forcing-online-platforms-to-delete-hate-speech-content/", "via": "", "real_tags": ["宪法", "内容"]}, {"category": "", "categoryclass": "", "imagename": "b6adddc2d939f746140bc4301868d434.jpeg", "infoid": 1007349, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿--美国国税局(Internal Revenue Service)试图通过购买一个商业数据库来识别和追踪潜在的犯罪嫌疑人，该数据库记录了数百万美国手机的位置。\n美国国税局刑事调查局(IRS CI)在2017年和2018年订阅了访问这些数据的服务，其使用数据的方式在上周美国国税局(IRS CI)官员向俄勒冈州民主党参议员罗恩·怀登(Ron Wyden)的简报中披露。办公室。这位参议员的一名助手向《华尔街日报》描述了这次简报。\n..。", "note_en": "WASHINGTON—The Internal Revenue Service attempted to identify and track potential criminal suspects by purchasing access to a commercial database that records the locations of millions of American cellphones.\n  The IRS Criminal Investigation unit, or IRS CI, had a subscription to access the data in 2017 and 2018, and the way it used the data was revealed last week in a briefing by IRS CI officials to Sen. Ron Wyden’s (D., Ore.) office. The briefing was described to The Wall Street Journal by an aide to the senator.\n...", "posttime": "2020-06-20 09:04:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "手机,国税局,cellphone,数据库", "title": "美国国税局使用手机定位数据试图找到嫌疑人", "title_en": "IRS Used Cellphone Location Data To Try To Find Suspects", "transed": 1, "url": "https://www.wsj.com/articles/irs-used-cellphone-location-data-to-try-to-find-suspects-11592587815", "via": "", "real_tags": ["手机", "国税局", "cellphone", "数据库"]}, {"category": "", "categoryclass": "", "imagename": "9423f27a07c844753ec64b6b887b9e2d.png", "infoid": 1007348, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我的第一次全职API测试经验是针对SOAP服务的。在那里您将了解什么是XSD。你要学会热爱它。\n你当然需要！有了基于模式的服务器端启用的验证，您就不必担心愚蠢的测试，比如检查当您发送100个长度的字符串(预期最大长度为50)时会发生什么。只需确保XSD完全正确即可。\n在那次魔术之后，测试RESTish API感觉就像回到了过去。回到非常体力劳动的时代。但是，当您了解JSON Schema(RAML、OpenAPI等)时，您又会感到高兴了！耶，我们可以打开服务器端验证，再次推开愚蠢的测试工具。\n问题是JSON和XML是不同的野兽。从表面上看，假设模式中定义的任何内容都应该盲目验证，这可能是错误的。\n好好看看tugrik元素。如果没有XSD，您就不会知道预期的类型。虽然它看起来像是数字，但您不能确定。也许是像名字一样的字符串？\n哦，不，你说，那看起来不对！我们知道图格里克是一个数字，所以就让它成为一个数字：\n然而，通过这样做，现在我们甚至不需要任何JSON Schema来猜测类型。没有讨厌的小引号-这是一个令人讨厌的数字！\n也许你知道这是怎么回事了。XML文档是纯文本的。每个元素的值都是一个简单的字符串，框架使用XSD将其转换为正确的类型。\n但我离题了。主要的一点是，基于XML的文档往往要经过转换机制。只有当无法完成强制转换时，验证才会失败。\nJSON不是纯文本的。它们已经有了一些仅通过观察就能看到的基本类型。如果在上面添加JSON Schema并使用任何不太健壮的验证器，则行为将完全不同。\n因为验证JSON文档的最简单方法是首先使用一些公用库来使用它，这些库猜测类型几乎和我们一样：“它周围有引号吗？弦！“。只有在此时，使用已经转换的值，才能将其类型与模式中定义的任何内容进行比较。\n您能猜到真正健壮的验证器有什么不同吗？正确的!。他们使图格里克：10&34；通过验证。因为他们遵循波斯特尔定律：\n虽然这句话比微不足道的小测试者的博客所能处理的要复杂得多，但了解它的存在和应用是很重要的。在任何程度上遵循波斯特尔定律都是一种设计和选择。\n如果您的服务旨在将弱输入(如&#34；tugrik&#34；：&#34；10&#34；)作为有效数字处理，则不是错误。如果您在请求中发送了额外的属性，而服务忽略了它们而没有抛出4xx错误，那么这也不是一个错误。这可能是一个非常好的功能。\n是的，肯定有一种方法可以错误地或过度地做健壮性。如果您从头开始编写浏览器引擎(为什么？)，您将严格遵循Postel定律。另一个原因是确保API客户端的最长正常运行时间。他们成功的请求越多，连接到您的产品所需的工作就越少，从而获得更高的利润。\n因此，当您探索新的API时，在提交错误“Achtung，Achtung，no Validation！1”之前，请确保您了解设计的方式和原因。", "note_en": "My first full-time  API testing experience was for  SOAP services. There you learn what  XSD is. You learn to love it.\n Of course, you do! With server-side enabled validation based on a schema, you need not worry about stupid testing like checking what happens when you send 100 length string where expected maximum length is 50. Just make sure that  XSD is correct.\n After that witchcraft, testing RESTish APIs feels like going back in time. To the very  manual times. But then you learn about  JSON Schema ( RAML, OpenAPI, etc) and you are happy again! Yay, we can turn on server-side validation and shove off stupid testing again.\n The problem is that  JSON and  XML are different beasts. Assuming at face value that whatever is defined in schema should be blindly validated  can be wrong.\n    Take  a good look at  tugrik element. Without  XSD you wouldn’t know the expected type. While it looks like something numeric, you can’t be sure. Maybe it’s a string like a  name?\n     Oh no, you say, that looks wrong! We know that  tugrik is a number, so make it so:\n  Yet by doing that, now we don’t even need any  JSON Schema to guess the type. No pesky little quotes — it’s a number!\n Perhaps you see where this is going.  XML documents are plain-text. Each element’s value is a simple string that frameworks cast into proper types using  XSD.\n     But I digress. The main point is that  XML-based documents often go through casting mechanism.  Validation fails only when casting could not be done.\n JSONs are not plain-text. They already have some rudimentary types visible just by looking at them. If you add  JSON Schema on top and use any  not overly robust validator, the behavior will be different.\n Because the simplest way to validate a  JSON document is first to consume it with some common library that guesses types almost like we do: “does it have quotes around? string!” And only then, with already cast value, to compare its type with whatever is defined in a schema.\n     Can you guess how  really robust validators are different? Right! They make  &#34;tugrik&#34;: &#34;10&#34; to pass validation. Because they follow Postel’s law:\n  While this statement is way more complex than puny little tester’s blog could handle, it’s important to know its existence and application. Following Postel’s law to any degree is  a design choice.\n If your service is designed to handle weak input like  &#34;tugrik&#34;: &#34;10&#34; as a valid number, it’s not a bug. If you send additional properties in the request and a service ignores them without throwing 4xx error, it’s not a bug either. It can be very well a feature.\n And yes, there is definitely a way  to do robustness wrong or overdo it. If you write a browser engine from scratch (why?), you’ll follow Postel’s law religiously. Another reason would be ensuring the maximum uptime of  API clients. More successful requests they do and less work is required from them to connect to your product result in more profit.\n So, when you explore new  API, make sure you understand how’s and why’s around the design before filing bugs “Achtung, Achtung, no validation!!!1”.", "posttime": "2020-06-20 09:03:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "api,apis,json", "title": "强大的API很奇怪", "title_en": "Robust APIs Are Weird", "transed": 1, "url": "https://www.aviskase.com/articles/2020/06/18/robust-apis-are-weird/", "via": "", "real_tags": ["api", "apis", "json"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007347, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于维护停机或容量问题，服务器暂时无法为您的请求提供服务。请稍后再试。\n此外，尝试使用ErrorDocument处理请求时遇到503服务不可用错误。", "note_en": "The server is temporarily unable to service yourrequest due to maintenance downtime or capacityproblems. Please try again later.\n Additionally, a 503 Service Unavailableerror was encountered while trying to use an ErrorDocument to handle the request.", "posttime": "2020-06-20 09:03:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,希望,parliament,请求", "title": "欧洲议会希望禁止个性化广告", "title_en": "European Parliament wants to forbid personalised advertisements", "transed": 1, "url": "https://paultang.nl/en/forbid-personalised-ads/", "via": "", "real_tags": ["广告", "希望", "请求"]}, {"category": "", "categoryclass": "", "imagename": "b20d9fa741bbd7ca387d5defb44a94ed.jpg", "infoid": 1007345, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "研究人员在一份新的报告中警告说，如果我们真的认真解决气候危机，我们需要开始解决我们的经济中压倒性的消费力量。\n虽然有钱经常被描绘成令人向往的东西，但最富有的国家和个人也在对环境造成最大的破坏。如果我们继续朝着这个方向发展，伴随着疯狂的经济增长，我们这个星球的一些地方将变得不适合居住。\n英国利兹大学的生态经济学家朱莉娅·斯坦伯格认为，为了保护自己免受日益恶化的气候危机的影响，我们必须减少不平等，挑战财富和拥有财富的人本质上是好的这一观念。\n这一新观点是由一个由环境科学家、工程师、物理学家和经济学家组成的团队提出的，它基于现有的知识和科学界的建议。\n研究人员检查了目前有关富裕家庭的文献，发现财富是全球环境影响的最强决定因素。进一步挖掘，他们还描述了在这沉重的足迹背后隐藏着什么力量。\n虽然大多数关于这个主题的研究都认为环境影响的主要驱动因素是技术变化(它可以减少我们的影响)和消费(它一直在加速我们的影响)，但似乎后者几十年来一直在超过前者。这对整个世界都是正确的，对许多个别国家也是如此。\n简而言之，即使我们在储存可再生能源或捕获二氧化碳方面做得更好，单靠技术也不能使我们免于生物多样性的丧失或污染。毕竟，在过去的40年里，全球财富的增长速度远远快于任何科学成果。\n澳大利亚新南威尔士大学的环境工程师汤米·维德曼(Tommy Wiedmann)表示，技术可以帮助我们更有效地消费，即节约能源和资源，但这些技术进步跟不上我们日益增长的消费水平。\n财富和环境破坏之间的联系是显而易见的，如果没有深远的生活方式改变和我们对金钱的态度的根本性转变，这一证据表明情况只会变得更糟。\n但是，尽管富人的个人牺牲显然是必要的，但Wiedmann和他的同事们认为，除非也实施更广泛的结构性改革，否则这些尝试注定会失败。\n例如，迫切需要改变经济范式。两位作者认为，可持续增长的想法是一个现实中无法实现的乌托邦；财富总是会比技术滚滚而下的速度更快。\n我们真的需要开始以一种保护我们的气候和自然资源的方式管理我们的经济，即使这意味着更少的、没有增长的，甚至是负增长的。\n多年来，世界各地的科学家和经济学家一直警告说，我们的经济需要重新审视，但到目前为止，这个想法几乎没有受到关注，我们的房子在富人变得更富有的同时继续燃烧。\n根据这一新观点的作者，最好的解决方案是对最富有的人征税，并投资于最贫穷的人和最脆弱的生态系统。因此，世界各国应该考虑生态税、绿色投资、财富再分配、最高和最低收入，以及有保障的基本收入，以帮助我们的环境从这场经济滚雪球中解脱出来。\n如果我们支持它，我们甚至可以更进一步，完全放弃资本主义的想法。\n维德曼说：“我们希望这篇评论能从不同的角度看待什么才是最重要的，并帮助我们克服根深蒂固的观点，即人类必须如何主宰自然，以及我们的经济如何必须增长得更快。”", "note_en": "If we&#39;re really serious about solving the climate crisis, we need to start tackling our economy&#39;s overwhelming &#39;power&#39; of consumption, researchers warn in a new report.\n While having money is often portrayed as something to aspire to, the wealthiest nations and individuals are also wreaking the most environmental destruction. If we keep heading in this direction with rampant economic growth, parts of our planet  will become uninhabitable.\n   &#34;To protect ourselves from the worsening climate crisis, we must reduce inequality and challenge the notion that riches, and those who possess them, are inherently good,&#34;  argues ecological economist Julia Steinberger from the University of Leeds in the UK.\n This new perspective was put together by a team of environmental scientists, engineers, physicists, and economists, and it&#39;s based on existing knowledge and recommendations from the scientific community.\n Examining the current literature on affluent households, researchers found wealth is the strongest determinant of global environmental impacts. Digging further, they also described what force lies behind this heavy footprint.\n While the majority of studies on the subject agree the major drivers of environmental impacts are technology change (which can reduce our impact) and consumption (which has been accelerating our impact), it appears the latter has been outrunning the former for decades. And that&#39;s true for the entire world, as well as numerous individual countries.\n In short, even if we get better at  storing renewable energy, or  capturing carbon dioxide, technology alone can&#39;t save us from  biodiversity loss or  pollution. After all, during the past four decades, worldwide wealth has grown much faster than any scientific gains.\n   &#34;Technology can help us to consume more efficiently, i.e. to save energy and resources, but these technological improvements cannot keep pace with our ever-increasing levels of consumption,&#34;  says environmental engineer Tommy Wiedmann, from the University of New South Wales in Australia.\n The link between wealth and environmental destruction is clear to see, and without far-reaching lifestyle changes and fundamental shifts in our attitude towards money, this evidence suggests things are only going to get worse.\n But while individual sacrifices among the wealthy are clearly needed, Wiedmann and colleagues argue those attempts are doomed to fail unless there are also broader structural changes put into place.\n A change in economic paradigms is, for instance, sorely needed. The idea of &#39;sustainable growth&#39;, the authors argue, is a utopia that cannot be achieved in reality; wealth will always roll faster than technology down a hill.\n  &#34;We really need to start managing our economies in a way that protects our climate and natural resources, even if this means less, no, or even negative growth.&#34;\n   Scientists and economists around the world have been  warning for years that our economy needs to be re-examined, but so far, little attention has been paid to that idea and our house has continued to burn while the rich become richer.\n According to the authors of this new perspective, the best solutions are ones that tax the wealthiest and invest in the poorest people and most vulnerable ecosystems. As such, nations around the world should consider eco taxes, green investments, wealth redistribution, a maximum and minimum income, and a guaranteed basic income to help untie our environment from this economic snowball.\n If we&#39;re up for it, we could even go a step further and leave the idea of capitalism altogether.\n &#34;We hope that this review shows a different perspective on what matters, and supports us in overcoming deeply entrenched views on how humans have to dominate nature, and on how our economies have to grow ever more,&#34;  says Wiedmann.", "posttime": "2020-06-20 09:01:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "过度,shows,经济", "title": "一份新的报告显示为什么我们必须解决过度财富问题来拯救地球", "title_en": "New Report Shows Why We Must Tackle Excessive Wealth to Save the Planet", "transed": 1, "url": "https://www.sciencealert.com/tackling-excessive-wealth-and-consumerism-will-save-the-planet-not-technology-experts-say", "via": "", "real_tags": ["过度", "shows", "经济"]}, {"category": "", "categoryclass": "", "imagename": "d4923d230d10a14be6c66b3c3d6d7000.png", "infoid": 1007344, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "告别货运代理这个黑匣子。只有Flexport才能提供深入的可见性和可控性、低且可预测的供应链成本以及更快、更可靠的运输时间。所有这些都来自一个强大的技术平台。\n要成为真正的货运代理合作伙伴，需要的不仅仅是仪表盘或数字市场。通过我们的安全云软件平台提供的Flexport全球贸易操作系统是一种独特的运营模式，它结合了先进的技术和数据分析、物流基础设施以及实际操作的供应链专业知识。\n从更简单的预订、通信和协作到报告、洞察力等，我们直观的云平台将一切都放在一个地方。因此，您可以获得控制、效率和透明度，并为您的供应链提供一个发射台。\n与您的Flexport“小分队”会面-货运、运输、运营、海关和数据专家组成的专门团队，全天候待命，主动帮助您管理供应链，确保您的货物在良好的状态下准时到达。\n有了Flexport.org，我们通过使用技术来缓解物流瓶颈，真正拯救了生命。\nFlexport充满了热情的人们，创造新事物和挑战现状是令人兴奋的。", "note_en": "Say goodbye to the black box of freight forwarding. Only Flexport delivers deep visibility and control, low and predictable supply chain costs, with faster and more reliable transit times. All from a powerful technology platform.\n  It takes more than dashboards or digital marketplaces to be a true freight forwarding partner. Delivered via our secure cloud software platform, Flexport&#39;s Operating System for Global Trade is a unique operating model that combines advanced tech and data analytics, logistics infrastructure, and hands-on supply chain expertise.\n From simpler bookings, communication, and collaboration to reporting, insights, and more, our intuitive cloud platform puts everything in one place. So you get control, efficiency, and transparency, and a launchpad for your supply chain.\n Meet your Flexport “Squad” – a dedicated team of freight, shipping, operations, customs, and data experts, available 24/7/365 to proactively help you manage your supply chain and ensure your goods arrive on time, in excellent condition.\n     With Flexport.org, we’re really saving lives by using technology to alleviate logistics bottlenecks.\n Flexport is full of passionate people and it&#39;s exciting to create new things and challenge the status quo.", "posttime": "2020-06-20 08:26:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hiring,供应链", "title": "Flexport公司正在阿姆斯特丹招聘工程师", "title_en": "Flexport is hiring engineers in Amsterdam", "transed": 1, "url": "https://Flexport.com", "via": "", "real_tags": ["hiring", "供应链"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007343, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "../阿富汗_OEF_PROPERTY_LIST/01-JAN-1984 01：01-Charterhouse/01-Jan-1984 01：01-伊拉克_OIF_PROPERTY_LIST/01-Jan-1984 01：01-WikiLeaks间谍文件/01-Jan-1984 01：01-Anakata/01-Jan-1984 01：01-Aryan-National-2009/01-Jan-1984 01：01-Baer-Essentials/01-Jan-1984 01：01-Bar.。2009/01-Jan-1984 01：01-谷仓和贵族商店管理-2009/01-Jan-1984 01：01-血液与荣誉数据库-2009/01-Jan-1984 01：01-BND-Query/01-Dec-2016 09：00-BNP-2009/01-Jan-1984 01：01-玻利瓦安娜/01-Jan-1984 01：01-布达佩斯-同性恋权利-暴动-2008/01-1984 01：01：1984 01：01-Cafcass-Board-Papers-2006-2007/01-Jan-1984 01：01-CBS-NEWS-60mins-Werner-Erhard/01-Jan-1984 01：01-Cerac-cenep-Columbia-video-2009/01-Jan-1984 01：01-Cerac-Investigadors/01-Jan-1984 01：01-Clinton-Email/08-Oct-2018 20：08-cms/14-9月-2016。COS-ORGANIZATION-1/01-JAN-1984 01：01-CRS/01-JAN-1984 01：01-REDITEEE Policies/01-Jan-1984 01：01-EmpireChallenges-2008/01-Jan-1984 01：01-ENIC-Tender-Fragence/01-Jan-1984 01：01-EWG-IFPMA-Reports-COMMS/01-Jan-1984 01：01-FARC-REYES-Yahoo-2008/01-Jan-1984 01：01。FITNA-FLASH-VIDEO/01-JAN-VIDEO/01-JAN-1984 01：01-FLOCK-Translations/01-Jan-1984 01：01-Freddy-Balzan-Email-2005-2008/01-Jan-1984 01：01-Galvin-Report-2008/01-Jan-1984 01：01-gifiles/01-Jan-1984 01：01-Gitmo-最高法院审查-2009/01-Jan-1984 01：01-hmulv-lcag。2016年5月9日：05-ICWatch-PICS/17-Feb-2017 23：45-IGES-BMWi-PKV-2010/01-Jan-1984 01：01-伊朗-kamayeshe-Kousar-2007/01-Jan-1984 01：01-伊朗-电信附件-2009/01-Jan-1984 01：01-伊拉克-IPLO/01-Jan-1984 01：01-意大利-儿童性别-2008/01-Jan-1984 01。：01-jp1_02-01-Jan-1984 01：01-Julius-Baer-Tracking/01-Jan-1984 01：01-Kenia-Imanyara-Threat-2009/01-Jan-1984 01：01-Kenia-Renditions-and-raraa-Odinga-Mou-2007/01-Jan-1984 01：01-Kenia-the Call-the Call-01-Jan-1984 01：01-kkw-Kruemmel-。抗议-照片-2008-5-31-01-Jan-1984 01：01-LoveParade2010/01-Jan-1984 01：01-Mara-land-Grab/01-Jan-1984 01：01-MFC-Leak 2-2009/01-Jan-1984 01：01-MFC-Problems/01-Jan-1984 01：01-mod-wl-Sep09/01-Jan-1984 01：01-nsmfargo-Hotmail-Email-2009/01。Jan-1984 01：01-ole-nydahl-diamond-way-buddhism-cult-teachings/01-Jan-1984 01：01-opcca/01-Jan-1984 01：01-秘鲁-petro-Audio-MP3/01-Jan-1984 01：01-秘鲁-Petro-Audio-Transcript/01-Jan-1984 01：01-Podesta-Email/01-Jan-1984 00：01-REZKO-EXPLETS-GMH-2008/01-JAN-1984 01：01-rnc-选举计划/。Jan-1984 01：01-Sarah-Palin-Hack-2008/01-Jan-1984 01：01-沙特-GOV-TECH-SPAM/01-Jan-1984 01：01-Scarlett-Keering-Murder-2008/01-Jan-1984 01：01-Schiy-el-Masri/01-Jan-1984 01：01-scientology-case-supervisor-class-viii-secrets-..&gt；1-1-1-1984 01：01-Smith-County-Justice/1-1-Jan-1984 01：01-Son of the oil/01-Jan-1984 01：01-spyfiles/01-Jan-1984 01：01-spyfiles3/01-Jan-1984 01：01-Steve-Jobs-HIV/01-Jan-1984 01：01-叙利亚-FILES/01-Jan-1984 01：01-TCI-INQUERY-MEDIA-INFORMANCION 1-2009/01-JAN-1984 01：01-TCI-INQUERY-MEDIA-INFORMATION 1-2009/01-JAN-1984 01：01。2009.01-Jan-1984 01：01-TCI-INQUERY-MEDIA-INFORMAND 3-2009/01-JAN-1984 01：01-TCI-INQUENCE-MEDIA-INBUSION 4-2009/01-JAN-1984 01：01-泰国-太子-狗狗生日/01-JAN-1984 01：01-西藏-PROGATION-PHOTES/01-JAN-1984 01：01-西藏-MANGATIONS-AVI/01-JAN-1984 01：01-西藏-PROSITIONS-FLASH-VIDEO。-TollCollect/1-01-Jan-1984 01：01-Tz-Foreign-Investors/01-Jan-1984 01：01-un-科索沃-Pristina/01-Jan-1984 01：01-un-监督厅/01-Jan-1984 01：01-US-天主教医院-2008/01-Jan-1984 01：01-us-fema-winter-storm-community-relations-2009/01-Jan-1984 01：01-vult7/30-Aug-2017 23：00-Videos/01-Jan-1984。198401：01-www.armagedon.org.il/01-JAN-198401：01-JAN-198401：01-1000-美国海军陆战队在格鲁吉亚-2008.zip 01-JAN-198401：01 724621 1973.pdf 01-JAN-198401：01 661033 2005-05-05-gig-ia-jcids-pia-report.pdf 01-Jan-198401：01 1888172 200609。6-09.pdf 01-Jan-198401：01 808895 23831690-091127 copenhagen.pdf 01-Jan-1984 01：01 241711 29-01-1998-tony-van-den-bogaert-1.pdf 01-Jan-1984 01：01 773939 60a-2-1-5-eod-procedures-freezing-techniques-19..&gt；01-JAN-198401：01 164609 9-11_ALL_Messages.7z 01-JAN-198401：01 7207722 9-11_Messages.7z 01-JAN-198401：01 7221141 90-12.pdf 01-JAN-198401：01 2810298 92澳大利亚零售商协会.pdf 01-JAN-198401：01 1231876 AT-KUBARK_Pt_2--Price.pdf 01-Jan-1984 01：01。-1984JAN-01：01 1903720阿富汗_OEF_PROPERTY_", "note_en": "../\r Afghanistan_OEF_Property_List/ 01-Jan-1984 01:01 -\r Charterhouse/ 01-Jan-1984 01:01 -\r Iraq_OIF_Property_List/ 01-Jan-1984 01:01 -\r WikiLeaks Spy files/ 01-Jan-1984 01:01 -\r anakata/ 01-Jan-1984 01:01 -\r aryan-nation-2009/ 01-Jan-1984 01:01 -\r baer-essentials/ 01-Jan-1984 01:01 -\r barclays-tax-avoidance-scm-censored-guardian-2009/ 01-Jan-1984 01:01 -\r barns-and-noble-store-management-2009/ 01-Jan-1984 01:01 -\r blood-and-honor-database-2009/ 01-Jan-1984 01:01 -\r bnd-inquiry/ 01-Dec-2016 09:00 -\r bnp-2009/ 01-Jan-1984 01:01 -\r bolivariana/ 01-Jan-1984 01:01 -\r budapest-gay-rights-riot-2008/ 01-Jan-1984 01:01 -\r cablegate/ 01-Jan-1984 01:01 -\r cafcass-board-papers-2006-2007/ 01-Jan-1984 01:01 -\r cbs-news-60mins-werner-erhard/ 01-Jan-1984 01:01 -\r cerac-cenep-colombia-conflict-videos-2009/ 01-Jan-1984 01:01 -\r cerac-investigadores/ 01-Jan-1984 01:01 -\r clinton-emails/ 08-Oct-2018 20:08 -\r cms/ 14-Sep-2016 15:54 -\r collateralmurder/ 01-Jan-1984 01:01 -\r cos-organization-1/ 01-Jan-1984 01:01 -\r crs/ 01-Jan-1984 01:01 -\r detaineepolicies/ 01-Jan-1984 01:01 -\r empirechallenge-2008/ 01-Jan-1984 01:01 -\r enic-tender-fraud/ 01-Jan-1984 01:01 -\r ewg-ifpma-reports-comms/ 01-Jan-1984 01:01 -\r farc-reyes-yahoo-2008/ 01-Jan-1984 01:01 -\r fb_onr/ 01-Jan-1984 01:01 -\r fitna-flash-video/ 01-Jan-1984 01:01 -\r flock-translations/ 01-Jan-1984 01:01 -\r freddy-balzan-emails-2005-2008/ 01-Jan-1984 01:01 -\r galvin-report-2008/ 01-Jan-1984 01:01 -\r gifiles/ 01-Jan-1984 01:01 -\r gitmo-supreme-court-censorship-2009/ 01-Jan-1984 01:01 -\r hmulv-lcag-thw-kueken/ 01-Jan-1984 01:01 -\r icwatch/ 28-May-2016 09:05 -\r icwatch-pics/ 17-Feb-2017 23:45 -\r iges-bmwi-pkv-2010/ 01-Jan-1984 01:01 -\r iran-kamayeshe-kousar-2007/ 01-Jan-1984 01:01 -\r iran-telco-attachments-2009/ 01-Jan-1984 01:01 -\r iraq-iplo/ 01-Jan-1984 01:01 -\r italy-child-sex-2008/ 01-Jan-1984 01:01 -\r jappah-bribery-affair/ 01-Jan-1984 01:01 -\r jp1_02/ 01-Jan-1984 01:01 -\r julius-baer-stalking/ 01-Jan-1984 01:01 -\r kenya-imanyara-threat-2009/ 01-Jan-1984 01:01 -\r kenya-renditions-and-raila-odinga-mou-2007/ 01-Jan-1984 01:01 -\r kenya-the-cry-of-blood/ 01-Jan-1984 01:01 -\r kkw-kruemmel-brand-juni-2007/ 01-Jan-1984 01:01 -\r korea-candlelight-protest-photos-2008-5-31/ 01-Jan-1984 01:01 -\r loveparade2010/ 01-Jan-1984 01:01 -\r mara-land-grab/ 01-Jan-1984 01:01 -\r mfc-leak2-2009/ 01-Jan-1984 01:01 -\r mfc-problems/ 01-Jan-1984 01:01 -\r mod-wl-sep09/ 01-Jan-1984 01:01 -\r nsmfargo-hotmail-emails-2009/ 01-Jan-1984 01:01 -\r nsw-workcover-2009/ 01-Jan-1984 01:01 -\r ole-nydahl-diamond-way-buddhism-cult-teachings/ 01-Jan-1984 01:01 -\r opcca/ 01-Jan-1984 01:01 -\r peru-petro-audio-mp3/ 01-Jan-1984 01:01 -\r peru-petro-audio-transcripts/ 01-Jan-1984 01:01 -\r podesta-emails/ 01-Jan-1984 00:01 -\r rezko-exhibits-gmh-2008/ 01-Jan-1984 01:01 -\r rnc-election-plans/ 01-Jan-1984 01:01 -\r sarah-palin-hack-2008/ 01-Jan-1984 01:01 -\r saudi-gov-tech-spam/ 01-Jan-1984 01:01 -\r scarlett-keeling-murder-2008/ 01-Jan-1984 01:01 -\r schily-el-masri/ 01-Jan-1984 01:01 -\r scientology-case-supervisor-class-viii-secrets-..&gt; 01-Jan-1984 01:01 -\r smith-county-justice/ 01-Jan-1984 01:01 -\r sonofthesoil/ 01-Jan-1984 01:01 -\r spyfiles/ 01-Jan-1984 01:01 -\r spyfiles3/ 01-Jan-1984 01:01 -\r steve-jobs-hiv/ 01-Jan-1984 01:01 -\r syria-files/ 01-Jan-1984 01:01 -\r tci-inquiry-media-injunction1-2009/ 01-Jan-1984 01:01 -\r tci-inquiry-media-injunction2-2009/ 01-Jan-1984 01:01 -\r tci-inquiry-media-injunction3-2009/ 01-Jan-1984 01:01 -\r tci-inquiry-media-injunction4-2009/ 01-Jan-1984 01:01 -\r thailand-crown-prince-dog-birthday/ 01-Jan-1984 01:01 -\r tibet-protest-photos/ 01-Jan-1984 01:01 -\r tibet-protests-avi/ 01-Jan-1984 01:01 -\r tibet-protests-flash-video/ 01-Jan-1984 01:01 -\r tollcollect/ 01-Jan-1984 01:01 -\r tz-foreign-investors/ 01-Jan-1984 01:01 -\r un-kosovo-pristina/ 01-Jan-1984 01:01 -\r un-oios/ 01-Jan-1984 01:01 -\r us-catholic-hospitals-2008/ 01-Jan-1984 01:01 -\r us-fema-winter-storm-community-relations-2009/ 01-Jan-1984 01:01 -\r vault7/ 30-Aug-2017 23:00 -\r videos/ 01-Jan-1984 01:01 -\r www.armagedon.org.il/ 01-Jan-1984 01:01 -\r www.armagedonz.org/ 01-Jan-1984 01:01 -\r 1000-us-marines-in-georgia-2008.zip 01-Jan-1984 01:01 724621\r 1973.pdf 01-Jan-1984 01:01 661033\r 2005-05-05-gig-ia-jcids-pia-report.pdf 01-Jan-1984 01:01 1888172\r 20060920.pdf 01-Jan-1984 01:01 700551\r 2009-worker-comp-wymanfinaldraftreport8-6-09.pdf 01-Jan-1984 01:01 808895\r 23831690-091127copenhagen.pdf 01-Jan-1984 01:01 241711\r 29-01-1998-tony-van-den-bogaert-1.pdf 01-Jan-1984 01:01 773939\r 60a-2-1-5-eod-procedures-freezing-techniques-19..&gt; 01-Jan-1984 01:01 164609\r 9-11_all_messages.7z 01-Jan-1984 01:01 7207722\r 9-11_messages.7z 01-Jan-1984 01:01 7221141\r 90-12.pdf 01-Jan-1984 01:01 2810298\r 92australianretailersassociationvic.pdf 01-Jan-1984 01:01 1231876\r AT-Kubark_Pt_2--Price.pdf 01-Jan-1984 01:01 819140\r AT-june07-Price-PT1.pdf 01-Jan-1984 01:01 749459\r Afghanistan_OEF_Property_List-extended.html 01-Jan-1984 01:01 1903720\r Afghanistan_OEF_Property_List.csv 01-Jan-1984 01:01 0\r Afghanistan_OEF_Property_List.html 01-Jan-1984 01:01 1701676\r Afghanistan_OEF_Property_List.xls 01-Jan-1984 01:01 0\r Assange_Indictment.pdf 24-May-2019 09:02 1900004\r Catholic-hospitals-Frequently-asked-questions.pdf 01-Jan-1984 01:01 103934\r Charterhouse.zip 01-Jan-1984 01:01 28898138\r Ctv030907_2100_wako_defends_govt_over_kroll_rep..&gt; 01-Jan-1984 01:01 3578003\r Defense-of-Catholic-hospitals-betray-mission.pdf 01-Jan-1984 01:01 135813\r Egerton_University_payroll_scandal.pdf 01-Jan-1984 01:01 7258099\r FBI-pedophile-symbols.pdf 01-Jan-1984 01:01 116868\r Farah-Khan.mp4 01-Jan-1984 01:01 5461130\r Farah-Khan.ogg 01-Jan-1984 01:01 5296147\r Farah-Khan.webm 01-Jan-1984 01:01 5285031\r Further-analysis-of-sterilization-data.pdf 01-Jan-1984 01:01 158332\r Githongo_report.pdf 01-Jan-1984 01:01 5804204\r Homeland_Security_Threat_Overview.pdf 01-Jan-1984 01:01 298084\r Iraq.xls 01-Jan-1984 01:01 0\r Iraq_OIF_Property_List.csv 01-Jan-1984 01:01 8616439\r Iraq_OIF_Property_List_Summary_by_NSN.html 01-Jan-1984 01:01 1650105\r Iraq_OIF_Property_List_Summary_by_NSN_Price.html 01-Jan-1984 01:01 1939732\r KTM_report.pdf 01-Jan-1984 01:01 3909093\r Kxmx5rel.rm 01-Jan-1984 01:01 5784367\r MOU_between_Ralia_Odinga_and_Muslims.pdf 01-Jan-1984 01:01 535903\r Mueller_Report_OCR.pdf 18-Apr-2019 22:03 123811867\r Ntv010907_fat_cats_of_africa_cor.rm 01-Jan-1984 01:01 4121389\r Ntv010907_kroll_report_saga_cor.rm 01-Jan-1984 01:01 4172227\r Ntv030907_1300_wako_admits_kroll_saga_cor.rm 01-Jan-1984 01:01 1425206\r Ntv050907_2100_kroll_report_presented_to_the_go..&gt; 01-Jan-1984 01:01 3551687\r Ntvn040907_2100_the_kroll_report_cor.rm 01-Jan-1984 01:01 4964212\r Project_Wing_-_Northern_Rock_Executive_Summary.pdf 01-Jan-1984 01:01 2754854\r Review-Narrative2.pdf 01-Jan-1984 01:01 79915\r Review-Summary.pdf 01-Jan-1984 01:01 377508\r TCH-xls-Data-Sample.pdf 01-Jan-1984 01:01 323669\r Tanzania.doc 01-Jan-1984 01:01 260096\r Translation_of_Aweis_Letter_1_.doc 01-Jan-1984 01:01 37376\r Tribalism_in_Afghanistan.rtf 01-Jan-1984 01:01 141163\r Vh97bers.rm 01-Jan-1984 01:01 4172227\r a-coup-for-the-rich.pdf 01-Jan-1984 01:01 555161\r a-steuerumgehung-103-08-aw-rr.pdf 01-Jan-1984 01:01 121899\r a-survival-guide-for-decent-folk.html 01-Jan-1984 01:01 45049\r abn-amro-tax.pdf 01-Jan-1984 01:01 325879\r abortiontv-censored-2009.pdf 01-Jan-1984 01:01 117238\r abschlussbericht-agnes.pdf 01-Jan-1984 01:01 1391154\r abu-ghraib-map.jpg 01-Jan-1984 01:01 137881\r abu-ghuragb-secret.jpg 01-Jan-1984 01:01 130719\r abweisung-rekurs-bjb-moonstone.pdf 01-Jan-1984 01:01 111185\r acma-abortion-takedown-2009.txt 01-Jan-1984 01:01 1339\r acma-censors-wikileaks-danish-censorship-list-2..&gt; 01-Jan-1984 01:01 41582\r acma-secret-blacklist-11-mar-2009.txt 01-Jan-1984 01:01 63446\r acma-secret-blacklist-18-mar-2009.txt 01-Jan-1984 01:01 34750\r acma-secret-blacklist-aug-2008.txt 01-Jan-1984 01:01 62587\r acs-town-hall-meeting.pdf 01-Jan-1984 01:01 424991\r acta-brief-enforcement-2008.pdf 01-Jan-1984 01:01 138451\r acta-denial-2009.pdf 01-Jan-1984 01:01 98908\r acta-drafts-2009.pdf 01-Jan-1984 01:01 5472021\r acta-proposal-2007.pdf 01-Jan-1984 01:01 180648\r adf-report-2007.pdf 01-Jan-1984 01:01 169231\r advantage-insecurities-2008.pdf 01-Jan-1984 01:01 2305829\r af447-acars.pdf 01-Jan-1984 01:01 503429\r afg.7z 01-Jan-1984 01:01 81745030\r afg.csv.7z 01-Jan-2011 09:00 20083904\r afghan-order-of-battle-2007.pdf 01-Jan-1984 01:01 989663\r afghanistanacmttp-s.pdf 01-Jan-1984 01:01 198293\r ag-kaiserslautern-quote.pdf 01-Jan-1984 01:01 274167\r aig-bailout-shareholder-approval.pdf 01-Jan-1984 01:01 82317\r aig-is-the-risk-systemic-2009.pdf 01-Jan-1984 01:01 134733\r aig09162008.pdf 01-Jan-1984 01:01 88754\r air-france-af447-2009.zip 01-Jan-1984 01:01 185337\r airbus-kingfisher-mou-2007.pdf 01-Jan-1984 01:01 619576\r aircraft-procurement-airforce.pdf 01-Jan-1984 01:01 2530444\r airline-pilot-scab-list-2004.pdf 01-Jan-1984 01:01 475381\r airline-pilot-scab-list.pdf 01-Jan-1984 01:01 318830\r al-qaeda-documents-visual-recognition-guide.pdf 01-Jan-1984 01:01 590347\r alcatel-support-document-for-cable-system-in-cu..&gt; 01-Jan-1984 01:01 473639\r algonquin-park-road-expansion.pdf 01-Jan-1984 01:01 1021562\r alien-user-manual.pdf 01-Jan-1984 01:01 971696\r alms-for-jihad.pdf 01-Jan-1984 01:01 23900820\r alp-v-whozadog-claim-2009.pdf 01-Jan-1984 01:01 150698\r alp-v-whozadog-orders-2009.pdf 01-Jan-1984 01:01 33858\r alpha-chi-omega-ritual.pdf 01-Jan-1984 01:01 2713083\r alpha-chi-sigma-ceremonies.pdf 01-Jan-1984 01:01 2102085\r alpha-gamma-delta-ritual.pdf 01-Jan-1984 01:01 1054505\r alpha-kappa-alpha-ritual-circa-1977.pdf 01-Jan-1984 01:01 3280683\r american-casinos.pdf 01-Jan-1984 01:01 4523446\r amnesty-international-abortion-policy-2008.zip 01-Jan-1984 01:01 185588\r anatomy-of-a-subway-hack.pdf 01-Jan-1984 01:01 4360850\r anc-nhi-presentation-nehawu-school-2009.pdf 01-Jan-1984 01:01 859616\r anc-nhi-submission-nec-july2009.pdf 01-Jan-1984 01:01 354093\r anderson-county-palmetta-agreement.pdf 01-Jan-1984 01:01 201402\r anderson-county-private-investigators-invoice-2..&gt; 01-Jan-1984 01:01 837295\r angela-merkel.pdf 01-Jan-1984 01:01 15984\r anti-anonymous-flyer-by-scientology-germany.jpg 01-Jan-1984 01:01 353571\r ap-iht-test-returns-2008-0-30.pdf 01-Jan-1984 01:01 362052\r ar-525-13--2002-1.pdf 01-Jan-1984 01:01 151359\r arbeitsentwurf-sperr-gesetz-bmwi-250309.pdf 01-Jan-1984 01:01 143352\r arbeitsentwurf-sperrgesetz-2009-04-01.pdf 01-Jan-1984 01:01 101859\r army-playbook.pdf 01-Jan-1984 01:01 1671715\r aryan-nation-2009.7z 01-Jan-1984 01:01 83831423\r asnsw-edl-09.pdf 01-Jan-1984 01:01 35333\r asnsw-social-media-policy-sop2009-027.pdf 01-Jan-1984 01:01 62343\r aspen-police-manual-2009.pdf 01-Jan-1984 01:01 913103\r atm-fraud-eurocash-automatia.pdf 01-Jan-1984 01:01 1572913\r au-acma-efa-sublime-link-deletion-notice-2009.pdf 01-Jan-1984 01:01 143132\r au-dha-sydney-medical-students-foi-2009.pdf 01-Jan-1984 01:01 852532\r auchi-dossier-2008.zip 01-Jan-1984 01:01 879894\r auchi-hawaii-free-press-2009.pdf 01-Jan-1984 01:01 167487\r auchi-to-newstatesman-oct-2008.pdf 01-Jan-1984 01:01 571442\r auchi-to-wikileaks-2008.pdf 01-Jan-1984 01:01 647553\r audio-recording--secret-call-to-defeat-employee..&gt; 01-Jan-1984 01:01 59298432\r aus-io-panning-manual-2001.pdf 01-Jan-1984 01:01 364701\r australian-national-broadband-network.pdf 01-Jan-1984 01:01 1810529\r austria-election-result-forecast-restricted.pdf 01-Jan-1984 01:01 72751\r austria-evoting-beilage-2009.jpg 01-Jan-1984 01:01 92244\r austrian-e-voting-2009.pdf 01-Jan-1984 01:01 4525878\r autumn-of-nations.pdf 01-Jan-1984 01:01 7734062\r avian-flu-chair-text-2008.pdf 01-Jan-1984 01:01 179328\r ayman-difrawi.html 01-Jan-1984 01:01 86993\r ba-038-air-traffic-control-tape.wmv 01-Jan-1984 01:01 5574440\r baer-essentials.zip 01-Jan-1984 01:01 8491364\r bahrain-bdf-plan.png 01-Jan-1984 01:01 32688\r baidu-blacklist.zip 01-Jan-1984 01:01 100124\r bandargate-report-2008.pdf 01-Jan-1984 01:01 32611087\r banned-in-lebanon.pdf 01-Jan-1984 01:01 176630\r barclays-tax-avoidance-scm-censored-guardian-20..&gt; 01-Jan-1984 01:01 2993296\r barry-diller.pdf 01-Jan-1984 01:01 709639\r bat-south-africa-report-sept07.pdf 01-Jan-1984 01:01 3002708\r bawue-dienstaufsichtsbeschwerden.pdf 01-Jan-1984 01:01 165512\r bayer-china-2002.pdf 01-Jan-1984 01:01 390043\r bayern-skype-interception.pdf 01-Jan-1984 01:01 1190205\r bbc-original-trafigura-video.flv 01-Jan-1984 01:01 42363031\r bbc-trafigura-killer-toxic-waste.mp3 01-Jan-1984 01:01 21863381\r bbc-trafigura.pdf 01-Jan-1984 01:01 3095881\r bdo-assessment-iqwig.pdf 01-Jan-1984 01:01 727402\r belgum-tax-property-registrar-2008.jpg 01-Jan-1984 01:01 295471\r berats-box.7z 04-Dec-2016 23:00 10175472662\r bernard-glazer-estate-2008.zip 01-Jan-1984 01:01 15290561\r bernard-securities-contact-information.txt 01-Jan-1984 01:01 1168\r bevatron-demolition-plans-2009.pdf 01-Jan-1984 01:01 3361745\r bia-san-pasqual-letter-2008.pdf 01-Jan-1984 01:01 125623\r big-brother-switzerland-2009.zip 01-Jan-1984 01:01 532721\r big-profits-from-a-very-dirty-business.pdf 01-Jan-1984 01:01 16554\r bilboa-de-chavez-2005.pdf 01-Jan-1984 01:01 172693\r bilderberg-history-1956.pdf 01-Jan-1984 01:01 30988\r bilderberg-meeting-report-1957.pdf 01-Jan-1984 01:01 115783\r bilderberg-meeting-report-1958.pdf 01-Jan-1984 01:01 737103\r bilderberg-meeting-report-1962.pdf 01-Jan-1984 01:01 1971462\r bilderberg-meetings-report-1955.pdf 01-Jan-1984 01:01 105245\r bilderberg-meetings-report-1960.pdf 01-Jan-1984 01:01 105093\r bilderberg-meetings-report-1963.pdf 01-Jan-1984 01:01 135878\r bilderberg-meetings-report-1980.pdf 01-Jan-1984 01:01 4048562\r bill-foster-divorce-documents.pdf 01-Jan-1984 01:01 235788\r bill-oreilly-hacked-2008.jpg 01-Jan-1984 01:01 211360\r bjb-aladin-invest-bernd-weikl-eur-5-mil.zip 01-Jan-1984 01:01 58216\r bjb-alpha-tankers.zip 01-Jan-1984 01:01 82934\r bjb-andrade.zip 01-Jan-1984 01:01 708792\r bjb-angel-trust-1999.zip 01-Jan-1984 01:01 269617\r bjb-carlyle-1999.zip 01-Jan-1984 01:01 1399488\r bjb-cronin.zip 01-Jan-1984 01:01 454472\r bjb-elmer-no-data-theft.pdf 01-Jan-1984 01:01 160408\r bjb-finanzintermediaere-methoden.zip 01-Jan-1984 01:01 121872\r bjb-hans-henning-abtrott.zip 01-Jan-1984 01:01 63346\r bjb-heinri-steinberger.zip 01-Jan-1984 01:01 139355\r bjb-juerg-grossmann.zip 01-Jan-1984 01:01 134735\r bjb-jurg-grossman-caymans.zip 01-Jan-1984 01:01 1201407\r bjb-leonhardt-pec-invest-steuerhinterziehung-us..&gt; 01-Jan-1984 01:01 42705\r bjb-lewis1.zip 01-Jan-1984 01:01 128955\r bjb-lewis2.zip 01-Jan-1984 01:01 371692\r bjb-lord-kadoorie.zip 01-Jan-1984 01:01 26855\r bjb-luis-avenvas.zip 01-Jan-1984 01:01 176111\r bjb-mass-murderer-mexico-several-millions-of-us..&gt; 01-Jan-1984 01:01 156130\r bjb-moonstone.zip 01-Jan-1984 01:01 52362\r bjb-peru.zip 01-Jan-1984 01:01 79229\r bjb-polygraph.pdf 01-Jan-1984 01:01 2315715\r bjb-renker-steuerbetrug-cayman-vaduz-zuerich.zip 01-Jan-1984 01:01 491532\r bjb-shape-creinvest-excellence-funds.zip 01-Jan-1984 01:01 1042208\r bjb-shortcomings-in-trust-administration.pdf 01-Jan-1984 01:01 813682\r bjb-smolka-trust-1999.zip 01-Jan-1984 01:01 204371\r bjb-spain-almazan---gallego-hidden-usd-1-2-mio.zip 01-Jan-1984 01:01 85032\r bjb-swisspartner-tax-scheme.xls 01-Jan-1984 01:01 19968\r bjb-tjabe-dr-van-os-usd-9mil.zip 01-Jan-1984 01:01 63261\r bjb-usa-tax-evasion.zip 01-Jan-1984 01:01 44051\r bjb-winston-layne.zip 01-Jan-1984 01:01 1203308\r bjb-zurich-moonstone-trust-prosecution-2008.pdf 01-Jan-1984 01:01 135500\r bka-auskunftsverweigerung.pdf 01-Jan-1984 01:01 140743\r blackwater-bankers.pdf 01-Jan-1984 01:01 97543\r blair-nhs-it.pdf 01-Jan-1984 01:01 471062\r blood-and-honor-database-2009.zip 01-Jan-1984 01:01 1347642\r blue-force-comms-emc-warlock-test-results-2-200..&gt; 01-Jan-1984 01:01 191032\r blue-force-comms-emc-warlock-test-results-2004.pdf 01-Jan-1984 01:01 191278\r bmf-gatzer-bmz-leprich.pdf 01-Jan-1984 01:01 363036\r bmwi-antipiraterie-gipfel.pdf 01-Jan-1984 01:01 82918\r bnd-correspondence.txt 01-Jan-1984 01:01 3612\r bnd-kosovo-2007.pdf 01-Jan-1984 01:01 7461937\r bnd-kosovo-feb-2005.pdf 01-Jan-1984 01:01 2992669\r bnd-networks.pdf 01-Jan-1984 01:01 125452\r bnetza-anhoerung20091105.pdf 01-Jan-1984 01:01 138000\r bnp-2009.xlsb 01-Jan-1984 01:01 1453930\r bnp-email.txt 01-Jan-1984 01:01 9363\r bnp-language-discipline-2005.pdf 01-Jan-1984 01:01 19688\r bnp-member-list-email.jpg 01-Jan-1984 01:01 171530\r bnp-memberlist-sql.zip 01-Jan-1984 01:01 628827\r bnp-members.csv 01-Jan-1984 01:01 1471011\r bnp-members.xls 01-Jan-1984 01:01 2710016\r bnp-membership-list.txt 01-Jan-1984 01:01 1551384\r bnp-racism-leaflet.pdf 01-Jan-1984 01:01 851743\r boeing-737-fire-suppression-report-2000.pdf 01-Jan-1984 01:01 415017\r boeing-737-maintenance-manual-2007.zip 01-Jan-1984 01:01 322712441\r boeing-denmark-hornet-2008.pdf 01-Jan-1984 01:01 904331\r boeing-f15-auto-flight-system-1998.pdf 01-Jan-1984 01:01 1461729\r boeing-f15-engine-starting-system-2001.pdf 01-Jan-1984 01:01 13976156\r boeing-uses-employees-to-keep-pork-flowing-2009..&gt; 01-Jan-1984 01:01 42443\r bohemian-grove-guest-list-2008.pdf 01-Jan-1984 01:01 4904113\r boliva-chille-intel-report-2006.pdf 01-Jan-1984 01:01 119510\r boomerang-system.pdf 01-Jan-1984 01:01 538799\r bosetti-walker-2009.pdf 01-Jan-1984 01:01 97126\r bradford-city-valley-parade-stadium-fire-footag..&gt; 01-Jan-1984 01:01 76956936\r brasilian-senator-roseana-sarney-estimated-usd-..&gt; 01-Jan-1984 01:01 647872\r brazil-inception-report-2003.pdf 01-Jan-1984 01:01 2007713\r brdc-final-reports.pdf 01-Jan-1984 01:01 1842692\r brein-thepiratebay-legal.zip 01-Jan-1984 01:01 1206066\r briefing-cfc.pdf 01-Jan-1984 01:01 11529926\r british-waterways-targets-2008-2009.pdf 01-Jan-1984 01:01 236630\r british-waterways-targets.pdf 01-Jan-1984 01:01 6645978\r bsu-sex-trips-1999.txt 01-Jan-1984 01:01 75794\r bt-phorm-report-2007.pdf 01-Jan-1984 01:01 17553260\r bucca-sop.pdf 01-Jan-1984 01:01 2148123\r budapest-gay-rights-riot-2008.zip 01-Jan-1984 01:01 45735482\r bulgaria-dans-report-2008.pdf 01-Jan-1984 01:01 9030132\r bundesministerium-access-blocking-19-feb-2009.pdf 01-Jan-1984 01:01 45987\r bureau-of-diplomatic-security-report.pdf 01-Jan-1984 01:01 561606\r burning-man-paul-addis-message-2008.txt 01-Jan-1984 01:01 5601\r business-software-alliance-belgium-21-september..&gt; 01-Jan-1984 01:01 419055\r butswana-stock-exchange-rules-1996.pdf 01-Jan-1984 01:01 442505\r cabinet-paper-port-klang-free-zone-malaysia-sca..&gt; 01-Jan-1984 01:01 31515\r cafcass-board-papers-2006-2007.zip 01-Jan-1984 01:01 5199394\r cafcass-board-papers-2006.zip 01-Jan-1984 01:01 7553575\r california-bar-complaint.pdf 01-Jan-1984 01:01 163094\r california-dentical-adjudication-2007.pdf 01-Jan-1984 01:01 707505\r call-fm-3-50.1-personnel-recovery-aug-2005.pdf 01-Jan-1984 01:01 2809905\r call-fmi3-07x22-counter-insurgency.pdf 01-Jan-1984 01:01 2505799\r call-hb-03-34-mre-ttps-oif.pdf 01-Jan-1984 01:01 1536912\r call-hb-using-interperters-04-7.pdf 01-Jan-1984 01:01 413591\r cameroon-corruption-in-parliamentarian-caucus-f..&gt; 01-Jan-1984 01:01 2929160\r canada-afghan-detainee-investigation-richard-co..&gt; 01-Jan-1984 01:01 105008\r canada-ambush-1977.pdf 01-Jan-1984 01:01 5019238\r canada-conservative-harper-stump-speech-may-200..&gt; 01-Jan-1984 01:01 3295453\r canada-mines-boobtraps-1999.pdf 01-Jan-1984 01:01 1418522\r canada-nuclear-linda-keen.pdf 01-Jan-1984 01:01 2642547\r canada-patrolling-2002.pdf 01-Jan-1984 01:01 4108191\r canada-tam-insert-807-2000.pdf 01-Jan-1984 01:01 889313\r canada-training-for-war-1992.pdf 01-Jan-1984 01:01 545738\r canada-unit-sop-2009.pdf 01-Jan-1984 01:01 459737\r canada-us-secret-communication-on-abousfian-abd..&gt; 01-Jan-1984 01:01 173291\r canadian-acta-consultation-report.pdf 01-Jan-1984 01:01 1877545\r canadian-coin-operations-manual.pdf 01-Jan-1984 01:01 17777930\r canadian-mine-manual.pdf 01-Jan-1984 01:01 573388\r canadianfederationofstudents-agm-november2009-a..&gt; 01-Jan-1984 01:01 3314530\r cards911.zip 01-Jan-1984 01:01 5062890\r carleton-uni-campuscard-2008.pdf 01-Jan-1984 01:01 123209\r carleton-university-fiasco-disciplinary-decisio..&gt; 01-Jan-19\n......", "posttime": "2020-06-20 08:25:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "解密,wikileaks,media", "title": "维基解密文件", "title_en": "WikiLeaks Files", "transed": 1, "url": "https://file.wikileaks.org/file/", "via": "", "real_tags": ["解密", "wikileaks", "media"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007342, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伊恩·霍尔姆(Ian Holm)去世，这位受过古典训练的莎士比亚演员因在“指环王”(Lord Of The Rings)和“霍比特人”(Hobbit)电影“烈火战车”(Chariots Of Fire)和“异形”(Alien)等电影中的表演而为电影观众所熟知。他88岁了。\n这位演员的一名代表表示，霍尔姆于周五上午在医院去世。这位演员多年来一直在与帕金森氏症作斗争。然而，就在最近的一月份，霍姆还亲自出现在伦敦领取纽波特海滩电影节的偶像奖。\n霍姆以诠释莎士比亚的大部分经典作品而闻名，其中包括高耸的“李尔王”，他还在舞台上出类拔萃地演出了哈罗德·品特(Harold Pinter)的原创作品“返校节”(The Homecoming)，这部作品也被带到了百老汇。他在职业生涯中途才开始在电影中工作，1968年首次亮相时改编了他在“仲夏夜之梦”中的舞台表演。\n然而，在后来的几年里，他越来越多地在电影中工作，并更有选择性地在舞台上工作，出现在备受瞩目的电影中，如“异形”(Alien)、“第五元素”(The Five Element)、“指环王”(The Lord Of The Rings)、“指环王归来”和“霍比特人”(Hobbit)电影“意外之旅”(An Underful Journey)和“五军之战”(The Battle Of The Fimies)。\n但他最好的作品包含在独立制作的作品中，比如奥斯卡最佳影片获得者“火的战车”(Chariots Of Fire)，这让他在1982年获得了最佳男配角提名，以及“乔治国王的疯狂”(The Madness Of King George)、“乔·古尔德的秘密”(Joe Gould‘s Secret)、“盛大的夜晚”(Big Night)和“来世甜蜜”(The Sweet HereAfter)。\n他还经常参与制作英国电视剧，如“借款人”、“钟声”、“埃奇希尔夫妇”、“我们是被告”和“游戏集与比赛”。\n霍尔姆非常多才多艺，尽管他身材矮小，但在角色选择上很少受到限制。他在很大程度上是一个演员的演员，太像变色龙了，不会有很强的明星影响力。1998年，他被女王伊丽莎白二世授予爵士头衔，以表彰他对戏剧的贡献。\n霍姆作为演员已经工作了几十年，他第一次获得主流关注是因为他在1979年的“异形”(Alien)中饰演一个机器人，在1981年的“烈火战车”(Chariots Of Fire)中饰演奥运教练萨姆·穆萨比尼(Sam Mussabini)。\n在接下来的十年里，这些角色变得更大、更有特色，包括在“时光匪徒”(Time Bandits)中扮演拿破仑，在泽菲雷利(Zeffirelli)的“哈姆雷特”(Hamlet)中与梅尔·吉布森(Mel Gibson)一起扮演普罗尼尔斯(Polonius)，在肯尼斯·布拉纳(Kenneth Branagh)的“亨利五世”(Henry V)中饰演弗伦船长，还在“梦幻童话”(DreamChild)、“巴西”、“格雷斯托克：人猿王”(Greystoke：The Legend of Terzan)、“韦瑟比”(Wetherby。\n在90年代，他在史蒂文·索德伯格(Steven Soderbergh)的“卡夫卡”(Kafka)和大卫·克罗南伯格(David Cronenberg)的“裸体午餐”(Naked Lunch)中，以及尼古拉斯·海特纳(Nicholas Hytner)的“乔治国王的疯狂”(The Madness Of King George)、布拉纳(Branagh)的“科学怪人”(Frankenstein)和“第五元素”(The Five El。\n霍姆在顶级独立电影中表现出色，包括斯坦利·图奇(Stanley Tucci)的“盛大之夜”(Big Night)和“乔·古尔德的秘密”(Joe Gould‘s Secret)，特别是在阿汤姆·伊戈扬(Atom Egoyan)的“甜蜜来世”(The Sweet HereAfter)中，他饰演的这位痛苦的律师在加拿大小镇的悲剧后徒劳地寻求赔偿，罗杰·埃伯特(Roger Ebert)说，他扮演的是“微妙的无底洞”。\n这位在剧院磨牙的演员仍然偶尔做舞台工作。霍尔姆1979年在《万娅叔叔》中饰演阿斯特罗夫，1997年饰演李尔王。后者为他带来了奥利维尔最佳男演员奖，他在电视上重复了这两次表演，并在1999年凭借《李尔王》赢得了艾美奖。1993年，他与妻子佩内洛普·威尔顿(Penelope Wilton)在舞台上主演了品特的《月光》(Moonlight)。\n他又回到了2001年电影“皇帝的衣服”中拿破仑的角色。(他第一次在1972年的电视连续剧“拿破仑和我”中扮演波拿巴，然后在“时光强盗”中滑稽地扮演波拿巴。)。“纽约时报”(New York Times)在对这部电影的总体负面评价中说，“霍尔姆先生在狡猾、冷漠的表演中，尽了最大努力实现这部电影温和的喜剧愿景。”\n在他70多岁的时候，霍姆继续出现在备受瞩目的电影中-没有哪部电影比他在其中扮演比尔博·巴金斯(Bilbo Baggins)的《指环王》(Lord Of The Rings)更引人注目。他是休斯兄弟与约翰尼·德普(Johnny Depp)合作的“来自地狱”(From Hell)中的一名虐待狂医生，并在罗兰·埃默里奇(Roland Emmerich)的灾难史诗“后天”和马丁·斯科塞斯(Martin Scorsese)的“飞行员”(The Aviator)中饰演气象学家。\n但他也是时尚动画片黑色科幻电影“文艺复兴”和令人愉快的动画片“料理鼠王”中的主演之一。霍尔姆在21世纪头10年做出了其他一些有趣的选择，出现在独立喜剧“带着糖果的陌生人”(Strangers With Candy)中；在“治疗”(The Treatment)中饰演一个令人震惊的精神分析学家；在埃利·楚拉基(Elie Chouraqui)的“啊耶路撒冷”(O耶路撒冷)中饰演以色列第一任总统大卫·本·古里安(David Ben Gurion)。\n他在两部“霍比特人”电影“意外之旅”和“五军之战”中再次出演比尔博·巴金斯一角。\n伊恩·霍姆·卡斯伯特出生于英国古德梅耶斯，1950年进入皇家戏剧艺术学院，1953年离开英国服兵役。\n第二年，他加入了埃文河畔斯特拉特福德的皇家莎士比亚剧团，并在“奥赛罗”中作为长矛搬运工首次亮相。霍尔姆在1956年的“恋爱事件”中首次亮相伦敦西区，并在“泰特斯·安德罗尼克斯”中与劳伦斯·奥利维尔一起在欧洲巡回演出，1957年重新加入皇家莎士比亚剧团，1959年凭借“仲夏夜之梦”中的著名冰球和“李尔王”中的愚人一角闯荡。他一直在皇家莎士比亚剧团工作到1967年，曾出演过《暴风雨》(饰演艾瑞尔)、《理查德三世》、《亨利五世》、《亨利四世，第一部》和《第二部》中的主演角色。\n1965年，他在品特的原创作品《返校节》中饰演莱尼而备受赞誉；1967年他在百老汇重复这个角色时获得托尼奖，并在1973年品特的大银幕改编剧中再次饰演这个角色。\n1968年，他在英国电影“博福斯枪”(The Bofors Gun)中首次亮相，这部电影为他带来了英国电影学院奖(BAFTA Award)的最佳男配角奖。此后，他更频繁地出现在电影和电视上，而不是舞台上。\n在接下来的几年里，他在“仲夏夜之梦”、“修理工”、“哦！多么可爱的战争啊，“尼古拉斯和亚历山德拉”，以及“罗宾和玛丽安”中的约翰国王。其他任务包括“年轻的温斯顿”、“霸主”、“向魔鬼呐喊”，以及电视方面的“悲惨世界”、“铁面人”、“西线的静默”和“拿撒勒的耶稣”。在美国迷你剧“大屠杀”和“第三帝国内部”中，他分别扮演海因里希·希姆莱和约瑟夫·戈培尔。\n2001年，他凭借与朱迪·丹奇(Judi Dench)在HBO的心灵感应片“金发碧眼的最后时刻”(The Last Of The Gonde Bombshell)中的对手戏，第二次获得艾美奖。他和妻子威尔顿一起出现在英国电视台的“借款人”和“借款人的归来”中，他是全明星阵容中的一员，为美国TNT电视台播出的真人版“动物农场”做出了贡献。\n霍尔姆还做了大量的画外音和旁白工作。他为探索频道讲述了纪录片“斯大林”、“伊丽莎白·R：女王生活的一年”和“广岛：投掷炸弹的决定”；为探索频道讲述了“桑给巴尔之海”和“皮肤深处”；为公共广播公司(PBS)讲述了“审判中的大屠杀”。\n霍姆结过四次婚，第一任妻子是林恩·玛丽·肖。他的第二任妻子是电影静物摄影师索菲·贝克。他们的婚姻于1986年结束。霍姆于1991年与威尔顿结婚，并于2001年离婚。\n他身后留下了他的第四任妻子、艺术家索菲·德·斯坦佩尔(Sophie De Stempel)，他们于2003年结婚；三个女儿杰西卡(Jessica)、莎拉-简(Sarah-Jane)和梅丽莎(Melissa)，他们做过一些电影表演，梅丽莎是一名选角导演；还有两个儿子，巴纳比(Barnaby)，他小时候扮演角色，哈里，一名制作音乐视频的电影制作人。", "note_en": "Ian Holm, the classically trained Shakespearean actor best known to film audiences for his performances in films including the “Lord of the Rings” and “Hobbit” movies, “Chariots of Fire” and “Alien,” has died. He was 88.\n A rep for the actor has said Holm died in the hospital Friday morning. The actor had been battling Parkinson’s disease for a number of years. However, as recently as January, Holm appeared in person to collect the Newport Beach Film Festival’s Icon Award in London.\n Holm, who was celebrated for interpretations of most of the Shakespeare canon, including a towering “King Lear,” also excelled onstage in the original production of Harold Pinter’s “The Homecoming,” which he also brought to Broadway. He began working in films only midway through his career, debuting with an adaptation of his stage performance in “A Midsummer Night’s Dream” in 1968.\n In later years, however, he worked increasingly in movies and more selectively onstage, appearing in high-profile films such as “Alien,” “The Fifth Element,” “Lord of the Rings” pics “The Fellowship of the Ring” and “The Return of the King” and “Hobbit” movies “An Unexpected Journey” and “The Battle of the Five Armies.”\n But his finest work was contained in independently made productions like Oscar best picture winner “Chariots of Fire,” which brought him a nomination as best supporting actor in 1982, as well as “The Madness of King George,” “Joe Gould’s Secret,” “Big Night” and “The Sweet Hereafter.”\n He also worked regularly on British television series such as “The Borrowers,” “Bells,” “Mr. and Mrs. Edgehill,” “We the Accused” and “Game Set and Match.”\n Holm was remarkably versatile and, despite his short stature, rarely limited in his selection of roles. He was very much an actor’s actor, too chameleon-like to have a strong star impact. In 1998, he received a knighthood from Queen Elizabeth II for his contribution to drama.\n Holm had been working as an actor for decades when he first achieved mainstream notice for his work as an android in 1979’s “Alien” and as the Olympic trainer Sam Mussabini in 1981’s “Chariots of Fire.”\n  Over the next decade, the roles became larger and more distinctive, including Napoleon in “Time Bandits,” Polonius in Zeffirelli’s “Hamlet” alongside Mel Gibson, Captain Fluellen in Kenneth Branagh’s “Henry V,” as well as turns in “Dreamchild,” “Brazil,” “Greystoke: The Legend of Tarzan, Lord of the Apes,” “Wetherby,” “Dance With a Stranger” and Woody Allen’s “Another Woman.”\n During the ’90s, he had meaty starring roles in Steven Soderbergh’s “Kafka” and David Cronenberg’s “Naked Lunch” as well as in Nicholas Hytner’s “The Madness of King George,” Branagh’s “Frankenstein” and “The Fifth Element.”\n Holm turned in several outstanding performances in top independent movies including Stanley Tucci’s “Big Night” and “Joe Gould’s Secret,” and especially in Atom Egoyan’s “The Sweet Hereafter,” where his performance as the pained lawyer futilely seeking redress in the wake of a Canadian town’s tragedy was “bottomless with its subtlety,” Roger Ebert said.\n  The actor, who cut his teeth in the theater, still did stagework occasionally. Holm starred as Astrov in “Uncle Vanya” in 1979 and as King Lear in 1997. The latter brought him an Olivier award as best actor, and he repeated both performances on television, winning an Emmy for “Lear” in 1999. In 1993, he starred in a production of Pinter’s “Moonlight” onstage with wife Penelope Wilton.\n He returned to the role of Napoleon in the 2001 film “The Emperor’s Clothes.” (He had first played Bonaparte in the 1972 TV series “Napoleon and Me,” then comically in “Time Bandits.”) In a generally negative review of the film, the New York Times said, “In a sly, deadpan performance, Mr. Holm does his best to realize the movie’s gentle comic vision.”\n In his 70s, Holm continued to show up in high-profile films — none more high-profile than the “Lord of the Rings” movies, in which he played Bilbo Baggins. He was a sadistic doctor in the Hughes brothers’ “From Hell,” with Johnny Depp, and played meteorologists in Roland Emmerich’s disaster epic “The Day After Tomorrow” and Martin Scorsese’s “The Aviator.”\n But he was also one of the starring voices in the stylish animated film noir sci-fier “Renaissance” and the delightful animated feature “Ratatouille.” Holm made some other interesting choices in the 2000s, appearing in the indie comedy “Strangers With Candy”; as an outrageous psychoanalyst in “The Treatment”; and as David Ben Gurion, the first president of Israel, in Elie Chouraqui’s “O Jerusalem.”\n He returned to the role of Bilbo Baggins for two “Hobbit” films, “An Unexpected Journey” and “The Battle of the Five Armies.”\n  Ian Holm Cuthbert was born in Goodmayes, England, and entered the Royal Academy of Dramatic Art in 1950, leaving in 1953 to do his military service.\n The following year, he joined the Royal Shakespeare Company at Stratford-on-Avon and made his debut as a spear carrier in “Othello.” Holm made his West End debut in 1956’s “Love Affair” and toured Europe with Laurence Olivier in “Titus Andronicus,” rejoining the RSC in 1957 and breaking out in 1959 with his celebrated Puck in “A Midsummer Night’s Dream” and as the Fool in “King Lear.” He remained with the RSC until 1967, appearing in starring roles in “The Tempest” (as Ariel), “Richard III,” “Henry V” and “Henry IV, Part 1” and “Part 2.”\n In 1965, he appeared to great acclaim as Lenny in the original production of Pinter’s “The Homecoming”; he won a Tony when he repeated the role on Broadway in 1967 and played the role again in Pinter’s 1973 big-screen adaptation.\n In 1968, he made his film debut in “The Bofors Gun,” a British film that brought him a BAFTA Award for supporting actor. Thereafter, he appeared more regularly in movies and on television than onstage.\n  Over the next few years, he had supporting roles in “A Midsummer Night’s Dream,” “The Fixer,” “Oh! What a Lovely War,” “Nicholas and Alexandra” and as King John in “Robin and Marian.” Other assignments included “Young Winston,” “Juggernaut,” “Shout at the Devil” and, for television, “Les Miserables,” “The Man in the Iron Mask,” “All Quiet on the Western Front” and “Jesus of Nazareth.” For the American miniseries “Holocaust” and “Inside the Third Reich,” he played Heinrich Himmler and Joseph Goebbels, respectively.\n He won a second Emmy in 2001 for his roguish work opposite Judi Dench in the HBO telepic “The Last of the Blonde Bombshells.” With wife Wilton, he appeared in “The Borrowers” and “The Return of the Borrowers” for Brit TV, and he was one of an all-star cast of voices that contributed to the live-action version of “Animal Farm” that aired on TNT in the US.\n Holm also did a considerable amount of voiceover and narration work. He narrated the documentaries “Stalin,” “Elizabeth R: A Year in the Life of the Queen” and “Hiroshima: The Decision to Drop the Bomb”; “The Seas of Zanzibar” and “Skin Deep,” both for the Discovery Channel; and “Holocaust on Trial” for PBS.\n Holm was married four times, first to Lynn Mary Shaw. His second wife was film still photographer Sophie Baker. Their marriage ended in 1986. Holm married Wilton in 1991, and they divorced in 2001.\n He is survived by his fourth wife, artist Sophie de Stempel, whom he married in 2003; three daughters, Jessica, Sarah-Jane, who did some film acting, and Melissa, a casting director; and two sons, Barnaby, who acted as a child, and Harry, a filmmaker who makes music videos.", "posttime": "2020-06-20 08:07:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "巴金,holm,电影", "title": "《指环王》和《异形》中的比尔博·巴金斯伊恩·霍尔姆逝世，享年88岁", "title_en": "Ian Holm, Bilbo Baggins In 'Lord of the Rings' and 'Alien' Star, Dies At 88", "transed": 1, "url": "https://nypost.com/2020/06/19/ian-holm-lord-of-the-rings-and-alien-star-dead-at-88/", "via": "", "real_tags": ["巴金", "holm", "电影"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007341, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了帮助支持我们的社区在新冠肺炎期间远程工作，我们将在2020年6月30日之前免费提供ACM在我们数字图书馆中发布的所有作品。了解更多。\n我们使用饼干，以确保我们给你最好的经验，在我们的网站。\n您的浏览器似乎不支持它们，这会影响网站功能。", "note_en": "To help support our community working remotely during COVID-19, we are making all work published by ACM in our Digital Library freely accessible through June 30, 2020.  Learn more\n   We use cookies to ensure that we give you the best experience on our website.\n  It seems your browser doesn&#39;t support them and this affects the site functionality.", "posttime": "2020-06-20 08:06:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "创意,面向,artboard,网站", "title": "Stamper：面向画板的创意编码环境", "title_en": "Stamper: An Artboard-Oriented Creative Coding Environment", "transed": 1, "url": "https://dl.acm.org/doi/pdf/10.1145/3334480.3382994", "via": "", "real_tags": ["创意", "面向", "artboard", "网站"]}, {"category": "", "categoryclass": "", "imagename": "f91f32c8a872cafae7b9f2d020ed2986.jpg", "infoid": 1007338, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook在收到版权所有者的版权投诉后，删除了发布在特朗普总统账户上的一段被篡改的视频。\n这段经过操控的视频显示，一个黑人幼儿从一个白人幼儿身边跑开，CNN的一根乳糜管上写着“惊恐的幼儿从种族主义婴儿身边跑开。”去年在网上疯传的原始视频看到了完全相反的情况，这两个蹒跚学步的孩子在人行道上跑向对方，这样他们就可以拥抱了。这段视频是由卡佩·唐克图姆(Carpe Donktum)创建的，他是一位多产的亲特朗普表情包创建者，总统过去曾放大过他的观点，并上传到了Facebook和Twitter上。它是在全国各地反对美国系统性种族主义的抗议活动中到来的，在6月19日前夕-许多人庆祝这一天是奴隶制结束的日子。\n据CNN报道，Facebook在“孩子的一位父母提出版权要求”后删除了这段视频。Facebook的一名代表向The Verge证实，版权所有者收到了投诉。据美国有线电视新闻网(CNN)报道，当Facebook删除它时，它的浏览量已经超过了400万次。Jukin Media是一家第三方公司，经常从人们那里获得病毒式视频的权利，该公司告诉CNN，“视频所有者和Jukin Media都没有允许总统发布视频，经过我们的审查，我们认为他未经授权使用内容是在没有有效合理使用或其他辩护的情况下侵犯版权的明显例子。”\n另外，我们绝不支持或纵容篡改视频或其传达的信息。\nFacebook发言人安迪·斯通(Andy Stone)告诉The Verge，“我们收到了这段视频版权所有者根据数字千年版权法提出的版权投诉，已经删除了这篇帖子。”\n根据Jukin Media在该公司账户上发布的一份声明，该公司还向Twitter提出了版权索赔投诉。虽然推特将这段视频贴上了“被操纵的媒体”的标签，但直到周五晚上，它在总统的账户上仍然很活跃。这似乎是唐克图姆的编辑第一次收到“被操纵的媒体”的标签，这个标签通常出现在深度赝品上。在撰写本文时，这段视频已经被观看了近2000万次。目前还不清楚东克图姆或总统的团队是否会辩称，这种迷因具有足够的变革性，以至于它可以在合理使用的情况下存在。\n朱金的声明写道：“我们已经代表视频创作者提交了DMCA下架通知，并符合Twitter的政策。”“另外，我们绝不支持或纵容篡改视频或其传达的信息。我们希望并期待推特能迅速采取行动删除这段视频。“。\n周五晚上，推特禁用了这段视频。由于版权所有者的DMCA通知，视频被删除。\nTwitter的一位发言人告诉The Verge：“根据我们的版权政策，我们会对版权所有者或其授权代表发送给我们的有效版权投诉做出回应。”\n更新6月19日美国东部时间下午5点40分：更新后加入了Twitter的评论，并注意到该评论在版权投诉后被删除。标题也已更改，以反映更新。", "note_en": "Facebook has removed a manipulated video posted on President Trump’s account after receiving a copyright complaint from the rights owners.\n The manipulated video shows a black toddler running away from a white toddler, with a CNN chyron reading “terrified toddler runs from racist baby.” The original video,  which went viral last year, sees the total opposite, with the two toddlers running toward each other on the sidewalk so they can hug. The video was created by Carpe Donktum, a  prolific pro-Trump meme creator who the president has amplified in the past, and uploaded to both Facebook and Twitter. It arrives as protests across the country fighting against systemic  racism in the United States, and on the  eve of Juneteenth — a day that many people celebrate as the day slavery ended.\n Facebook took the video down after “one of the children’s parents lodged a copyright claim,”  according to  CNN. A Facebook representative confirmed to  The Verge that a complaint was received by the rights holder. It had more than four million views by the time Facebook removed it, according to  CNN. Jukin Media, a third-party company that often  acquires the rights from people to viral videos, told  CNN that “neither the video owner nor Jukin Media gave the President permission to post the video, and after our review, we believe that his unauthorized usage of the content is a clear example of copyright infringement without valid fair use or other defense.”\n “Separately, in no way to we support or condone the manipulate video or the message it conveys”\n “We received a copyright complaint from the rights holder of this video under the Digital Millennium Copyright Act and have removed the post,” Andy Stone, a Facebook spokesperson, told  The Verge.\n Jukin Media has also filed a copyright claim complaint to Twitter, according to a statement posted on the company’s account. While Twitter  labeled the video as “manipulated media,” it was still active on the President’s account until Friday evening. It appeared to be the first time one of Donktum’s edits has received the “manipulated media” tag, which is usually found on deepfakes. The video has been viewed nearly 20 million times at the time of this writing. It’s still unclear whether Donktum or the president’s team will argue the meme is transformative enough that it’s allowed to exist under fair use.\n “We have submitted a DMCA takedown notice on behalf of the video’s creator, and in accordance with Twitter’s policy,” Jukin’s  statement reads. “Separately, in no way to we support or condone the manipulate video or the message it conveys. We hope and expect Twitter will take swift action to remove the video.”\n On Friday evening, Twitter disabled the video. The video was taken down due to a DMCA notice from the rights holder.\n “Per our  copyright policy, we respond to valid copyright complaints sent to us by a copyright owner or their authorized representatives,” a Twitter spokesperson told  The Verge.\n Update June 19th 5:40pm ET: Updated to include comment from Twitter and note it was removed after a copyright complaint. The headline has also been changed to reflect the update.", "posttime": "2020-06-20 07:29:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,操纵,twitter,视频", "title": "在DMCA投诉后，Facebook和Twitter从特朗普的账户中删除了被操纵的视频", "title_en": "Facebook and Twitter Remove Manipulated Video From Trump's Accounts After DMCA Complaint", "transed": 1, "url": "https://www.theverge.com/2020/6/19/21297209/facebook-removes-manipulated-toddler-video-president-trump-copyright-claim-dmca-jukin", "via": "", "real_tags": ["facebook", "操纵", "twitter", "视频"]}, {"category": "", "categoryclass": "", "imagename": "f2d6cce271b12e16317043f48fc04b9f.jpg", "infoid": 1007337, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我有几盒Ratheon牌的，当我使用它们时，我通常会将焊接件滑上一根导线，然后将它们拧在一起，然后再将接合件滑回接头上。如果它们不是干净的导线，那么接触熔剂或预镀锡导线也不会有什么坏处。", "note_en": "I have a few boxes of Ratheon branded ones, and when I use them, I typically slide the solder splice up one wire and twist the wires together, before sliding the splice back over the joint. A touch of flux or pre-tinning the leads doesn’t hurt either, if they are anything but clean wires.", "posttime": "2020-06-20 07:10:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打击,solder,导线", "title": "在敌后打击焊点", "title_en": "Strike a Solder Joint Behind Enemy Lines", "transed": 1, "url": "https://hackaday.com/2020/06/19/strike-a-solder-joint-behind-enemy-lines/", "via": "", "real_tags": ["打击", "solder", "导线"]}]